{
 "id": "1179249",
 "text": "East Germany, officially known as the German Democratic Republic (GDR),German: Deutsche Demokratische Republik (DDR) was a Soviet communist puppet state that existed from 1949 to 1990. There were a few hundred Jews in East Germany, mostly Holocaust survivors who had lived in pre-war eastern Germany or had been Marxist before the 1933 Nazi takeover. ==Overview== Between the 1950s and 1980s, Jews in East Germany were persecuted for following Judaism or being seen as agents of Zionism over their Jewishness. The persecution coincided with Soviet Union's persecution of her own Jews. * * Etinger, Iakov (1995). \"The Doctors' Plot: Stalin's Solution to the Jewish Question\". In Yaacov Ro'i, Jews and Jewish Life in Russia and the Soviet Union. London: Frank Cass. , pp. 103–6. * * * * * * * * * Just as in the Soviet Union, the distinction between antisemitism and anti-Zionism in East Germany was virtually non- existent. The East German communist regime often excused its antisemitism as \"anti-Zionism\", despite its extensive use of antisemitic tropes in state propaganda and hostile policies towards Jewish citizens. ==History== ===1950s=== ====Support for antisemitic executions==== On December 20, 1952, the Central Committee of East Germany's ruling party declared support for the execution of Rudolf Slánský and another ten high-ranking communist officials in Czechoslovakia,Tagung des Zentralkomitees der Sozialistischen Einheitspartei Deutschlands 13–14 May 1953, 48–70Translation of the declaration: \"Sailing under the Jewish nationalistic flag, and disguised as a Zionist organization and as diplomats of the American vassal government of Israel, these American agents practiced their trade. From the Morgenthau- Acheson Plan that was revealed during the trial in Prague it appears unmistakably that American imperialism organizes and supports its espionage and sabotage activities in the people's republics via the State of Israel with the assistance of Zionist organizations\" who were accused by the Czechoslovak communist leaders of being \"Zionists\" over their Jewish origin. * Helfant, Audrey L. (1991). The Slánksý trial reconsidered. Minda de Gunzburg Center for European Studies, Harvard University. * Blumenthal, Helaine. (2009). Communism on Trial: The Slansky Affair and Anti-Semitism in Post-WWII Europe. UC Berkeley: Berkeley Program in Soviet and Post-Soviet Studies. (Read online) * Wein, Martin J. A History of Czechs and Jews: A Slavic Jerusalem. United Kingdom: Taylor & Francis Limited, 2019, pp.145-184 including a detailed table of all trial participants and their fates, before, during and (if so) after the trial. * Ahlbäck, Anders, & Kasper Braskén (eds) Anti-fascism and ethnic minorities: history and memory in Central and Eastern Europe. Routledge Studies in Fascism and the far right. London ; New York, NY: Routledge, Taylor & Francis Group, 2024. ====Holocaust denial==== Regarding the Holocaust, * * * * * * Distortion of the Holocaust refers, inter alia, to: not only did the East German communist regime refuse to take responsibility for the Nazi genocide of Jews, but also it supported the antisemitic Arab states * * * * that repeatedly invaded Israel.J. H. Brinks, \"Political Anti- Fascism in the German Democratic Republic\", Journal of Contemporary History, Vol. 32, No. 2, 1997, pg. 207-17. East German military advisers were active in Libya, Syria and South Yemen, all of which were systemically antisemitic. * Friedman, Saul S. (1989). Without Future: The Plight of Syrian Jewry. Praeger Publishers. * * * * When West Germany made an agreement with Israel to pay Holocaust survivors reparations, * * * * * the East German ruling party newspaper Neues Deutschland published the article Reparations - For Whom? in which the agreement was dismissed as \"a deal between powerful West German and Israeli capitalists\"State and Minorities in Communist East Germany – the antisemitic trope of Jews being \"capitalists\" was invoked. * * * East German official history emphasized communist resistance rather than Jewish suffering in the Holocaust. The fact that Nazism is fundamentally antisemitic was rarely mentioned, so were the stories of Holocaust survivors. In history textbooks, Nazi death camps were often discussed without their antisemitic background, with the Jewish victims generalized as \"inmates from all European countries\" or misclassified as \"the resistance\". East German communist leaders did not officially commemorate the Kristallnacht * * * * * until 1988, two years before East Germany ceased to exist. * * * * * ====Anti-cosmopolitan campaign==== Following its Soviet overlord's anti-cosmopolitan campaign, the East German communist regime harassed, detained, and interrogated several Jews on charges of \"cosmopolitanism\" and \"spying for the West\", causing many East German Jews to flee to West Berlin in 1953. ===1970s=== Without regard for Germany's Nazi past, the East German communist regime sent Syria 75,000 grenades, 30,000 mines, 62 tanks and 12 fighter jets to support her invasion of Israel during the Yom Kippur War.Marc Fisher. \"E. Germany Ran Antisemitic Campaign in West in ’60s\", The Washington Post, February 28, 1993 In 1972, the East German communist regime labelled Zionism a \"reactionary-nationalist ideology of the Jewish big bourgeoisie\",Timm 1997, p. 248. which invoked the antisemitic trope of Jews being \"capitalists\". On September 18, 1973, Yosef Tekoah (1925–1991), Israel's ambassador to the UN General Assembly, said:Israel's struggle in the UN. In 1975, the East German communist regime supported the now-withdrawn UN resolution that falsely condemned Zionism as a form of racism.Nations United: How the United Nations Undermines Israel and the West. The condemnation is antisemitic under the IHRA definition of antisemitism. IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. ===1980s=== Jewish cemeteries in East Germany were often vandalized, especially by Neo-Nazi groups that arose in the 1980s. These were ignored by the East German communist regime. Instead of protecting its Jewish citizens, the regime devoted more effort to distributing antisemitic propaganda and demanding ordinary Jews to condemn Israel. ==Issues== ===Proliferation of antisemitism=== Antisemitic broadcasting was common in East Germany and increased whenever Israel clashed with the Arab states. Those broadcasting often recycled materials from Nazi propaganda, equated Jews with Zionism, accused Jews of serving American imperialism, and blamed all of them for Israel's policies. Simon Wiesenthal, a Holocaust survivor and Nazi hunter, said that East German state propaganda was far more hostile to Jews than that of other communist countries. Meanwhile, Mike Dennis, a professor of modern German history, wrote: The same propaganda was widespread in the Soviet Union and her puppet states. In his book A History of the Jews in the Modern World, American historian Howard Sachar stated that \"anti-Zionism\" in the Soviet Union and her puppet states was not much different from Nazism:Howard Sachar, A History of the Jews in the Modern World (New York: Knopf, 2005) p.722 ===Popularization of Holocaust inversion=== East German communists, led by Walter Ulbricht (ruled from 1950 to 1971), were also the ones who popularized the trope \"Israel is the new Nazi Germany\". In antisemitism studies, the trope is classified by historians as Holocaust inversion, which is considered antisemitic under the IHRA definition of antisemitism. On July 14, 1967, the state-affiliated newspaper Berliner Zeitung published an iconic cartoon in which a flying Moshe Dayan stretched his hands across Gaza and Jerusalem, next to whom stood a decomposing Adolf Hitler encouraging Dayan: \"Carry on, colleague Dayan!\" Such cartoons are still popular in the Arab states and Western leftist activist spaces. ===Obstruction of bringing Nazi war criminals to justice=== In a 1991 interview with Jack Koehler, Simon Wiesenthal said that his efforts to track down Nazi war criminals hiding in East Germany were sabotaged by the antisemitic East German communist regime.John Koehler, The Stasi: The Untold Story of the East German Secret Police, page 27, 414. Footnote 35. Wiesenthal noted that East Germany was \"the most antisemitic and anti-Israel in the entire Eastern Bloc\", adding that: ==Influence== East German antisemitism's influence extended far beyond the East German borders. Notably, it has left a long-lasting mark on American society. Famous pro-communist Black nationalists, especially Malcolm X (1925–1965), adopted East German antisemitic tropes and mainstreamed them via circulation among academics and Black Americans, * * * * * * from whom the influential antisemitic groups Nation of Islam (NOI) * * * * * * and Black Hebrew Israelites (BHI) drew massive support. Particularly, NOI's leader Louis Farrakhan was classified by the American civil rights group Anti-Defamation League (ADL) as the most popular antisemite in America. In American society, East German antisemitic tropes were normalized over the decades and engendered a form of new antisemitism, * * * * * where Jews are accused of being the \"beneficiaries\" of \"White privilege\" and \"embodiment of evil\" allegedly coordinating Western governments to \"support Israel at the expense of Palestinians\". * * * * * As per a 2016 survey by the American civil rights group Anti-Defamation League (ADL), 23% Black Americans held negative beliefs about Jews, while a 2023 survey reportedly showed that one-eighth of Black Americans doubted whether the Holocaust really happened. ==Reception== ===Academic views=== ====Walter Laqueur==== Walter Laqueur (1921–2018), a German-American historian, summarized his research: ====David Hirsh==== David Hirsh (1967 – ), a British historian, shared similar views: ===Public views=== Public figures also commented on \"anti-Zionism\" associated with the antisemitism in the Soviet Union and her puppet states. ====David Neil==== Writing for the Algemeiner, real estate executive David Neil pointed out that academia played a huge role in modern antisemitism, with \"anti-Zionism\" being an academically driven \"revisionist movement\" similar to the pro-Confederate Lost Cause movement once popular in elite universities, especially the Columbia University, * * * * as noted by W. E. B. Du Bois in his 1935 book Black Reconstruction in America: Neil said that the Lost Cause phenomenon was a classical case of how harmful beliefs can become normalized by universities spreading racism under the pretence of social justice. ==Related pages== * German Jews * Secondary antisemitism * Anti-Judaism and antisemitism ==References== Category:Communism Category:East Germany Category:Jewish history Category:History of Germany Category:Antisemitism in Germany",
 "title": "Antisemitism in East Germany"
}