{
 "id": "118018",
 "text": "With telegraphy (from the Greek words tele (τηλε) = far and graphein (γραφειν) = write), messages are sent over long distances without any need to physically transport letters. To send messages, a telegraph sends pulses of electricity through wires in a special code. The code includes short and large dots and dashes. Usually, amateur radio operators use Morse code. ==History== === The first telegraphs === Some of the first telegraphs were made in the late 1700s, but these were hard to use because they had too many wires. Telegrams first became popular in the mid-1800s. In 1844 Samuel Morse built a single-wire telegraph line from Baltimore to Washington, D.C.. This was much easier to use than the earliest telegraphs, which used many wires. Soon there were telegraphs all over the United States. By the end of the nineteenth century, a transatlantic telegraph cable and other developments linked the world by the end of the century. Radio telegraphy became widespread in the early 20th century, especially on ships. After the 1930s, long-distance telephone calls became less expensive than telegrams. Telegrams became less and less popular. Western Union, an American company created for telegrams, sent its last one in 2006. === Telegrams === See the main article: Telegram In the mid-1800s, people communicated across long distances by writing letters. However, letters could take a long time to cross the country. Telegrams were much more convenient than letters because they could be delivered to faraway places immediately. This made it much easier for people to communicate and to move to the Western United States. To send a telegram, a person would give their message to a telegraph operator, who would send the message to another operator message using Morse code. The second operator would write down the message and give it to the person who received it. ==Telegraphs now== Telegrams have become rare. This is because of newer technology that people can use to communicate, such as the telephone and the Internet. However, Morse code is still popular among amateur radio enthusiasts. == Related pages == * Electrical telegraph * Telegram * Transatlantic telegraph cable * Morse code ==References== == Other websites == * Category:Postal history Category:Telegraphy",
 "title": "Telegraphy"
}