{
 "id": "1180225",
 "text": "The literature in Interlingua is the collection of written words in that artificial language. Gode had an extremely limited conception regarding the possible or desirable fields of use for Interlingua. His legacy consists only of several hundred summaries in Interlingua of scientific articles from the 1950s and 1960s, and two small collections of short stories... without much literary value. The first works written in Interlingua were books for learning the language, such as the Interlingua-English Dictionary and A Brief Grammar of Interlingua for Readers, both published in 1954. These were accompanied in 1954 by Interlingua a Prime Vista and, a year later, by Interlingua: A Grammar of the International Language, this time written by Gode and Blair. Already in 1960, Eric Ahlström began translating and editing booklets of fictional literature in his series Scriptores scandinave in INTERLINGUA: Episodio con perspectiva (Harald Herdal, 1960); Un desertor (Bo Bergman, 1961); and Le nove vestimentos del imperator (H.C. Andersen, 1961). One of the most prolific authors in Interlingua was the Swede Sven Collberg (1919–2003). His first publication in Interlingua, Alicubi-Alterubi, was an 18-poem booklet of original poetry. In the same year, he published Cunate tu es a mi mar, a book of 100 poems translated from languages all over the world and from poetry ranging from the past up to his own time. Other works by the same author include Inter le stellas (1975), Le prince e altere sonetos (1977), Lilios, Robores (1979), Prosa (1980), and Versos grec (1987). In the 1970s, Carolo Salicto published Volo asymptotic (1970), a collection of original poems and two translations. Celestina le gallina del vicina and Hannibalo le gallo del vicino were published in 1971. Seven tales also by H.C. Andersen were translated in 1975. Also in this decade, Alexander Gode published Un dozena de breve contos (1975), and Sven Collberg published the translation of the previously mentioned Inter le stellas, a work by Casemir Wishlace. Alexander Gode published Dece Contos in 1983.Dece contos (Alexander Gode-von Aesch) In the 1990s, one finds many translations such as Le familia del antiquario by Carlo Goldoni,[https://www.taziocarlevaro.ch/dds_culturali_letterari/A3%20Goldoni%20Trad%20Carlevaro%20-%20Le%20familia%20antiquario%202019.pdf Le familia del antiquario] translated in 1993, and Le Albergatrice,Listo del edituri da la domo editeriala Hans Dubois by the same author, translated two years later. Other works translated in this decade include Contos e historias by H.C. Andersen (translated in 1995) and Le pelegrinage de Christiano by John Bunyan (1994). Vicente Costalago published the original novella Juliade in 2022, followed by Poemas, also published in the same year. Kilglan, by the same author, was published in 2023. In issue 46 of Posta Mundi, from March 2025, Eduardo Ortega, also known as Le Canario Interlinguista, published Sonetto del depression (\"Sonnet of Depression\"),Posta Mundi 46 where Ad su prude dama (\"To His Coy Mistress\") by Andrew Marvell also appeared, translated by Martin Lavallée, who also translated Le Albatros (\"The Albatross\") by Charles Baudelaire. == Bibliography == === Original works === * Breinstrup, Thomas (2013) Mysterios in Mexico - un novella criminal * Costalago, Vicente (2020) Le dece-duo travalios de Heracles * Costalago, Vicente (2022) Juliade * Costalago, Vicente (2022) Poemas * Hak, Esbern (1996) Paletta: dece-duo novellas original * Scriptor, Marcus (2015) Le polyglotto involuntari e altere contos * Soreto, Carlos (2020) Anthologia Litterari * Costalago, Vicente (2023) Kilglan === Translations The dates are the ones when the text of Interlingua was published === * Andersen, H. C. (1975) Septe contos * Andersen, H. C. (1995) Contos e historias * Andersen, H.C. (1961) Le nove vestimentos del imperator * Baldwin, James (2022) Robinson Crusoe scribite de novo pro infantes * Bang, Herman (1994) Tres novellas * Arseneault, Daniel (2023) Le torno del mundo in octanta dies * Bunyan, John (1994) Le pelegrinage de Christiano * Buzzati, Dino (1992) Tres novellas * Collberg, Sven (1975) Alicubi, alterubi * Collberg, Sven (1977) Le Prince e altere sonettos * Collberg, Sven (1978) Pandora. Scenas mythic in interlingua * Collberg, Sven (1980) Prosa Pensatas breve e longe in interlingua * Collodi, Carlo (2018) Pinocchio * Daudet, Alphonse (2013) Litteras de mi molino * Doyle, Arthur Conan (2014) Le grande experimento de Keinplatz * Enfors, Erik (2020) Tres contos per Selma Lagerlöf * Frank, Sven (2012) Contos in Interlingua * Gibran, Khalil (2019) Le Propheta * Gode, Alexander (1983) Dece Contos, Beekbergen. * Goldoni, Carlo (1995) Le Albergatrice * Goldoni, Carlo (1993) Le familia del antiquario * Le Fanu, Joseph Sheridan (2015) Contos de phantasmas * Leblanc, Maurice (2014) Arsène Lupin - le fur gentilhomine * Leroux, Gaston (2014) Duo historias terrificante * Macovei, Toma (2019) Ab le auro spiritual del scena e del schermo II * Notarstefano, Italo (2019) Facile contos 1 – contos del humor * Notarstefano, Italo (2019) Facile contos 2 – contos del mysteri * Poe, Edgar Allan (2013) Le Barril de Amontillado, traducite per Patricio Negrete * Poe, Edgar Allan (2013) Le homicidios in le Rue Morgue * Quiroga, Horacio (2013) Contos del foreste * Söderberg, Hjalmar (2012) Le joco seriose * Tchekhov, Anton (2006) 11 contos == References == == Other websites == * Bibliotheca electronic in interlingua Category:Interlingua",
 "title": "Literature in Interlingua"
}