{
 "id": "1180114",
 "text": "Just as many other ethnic minorities within the Soviet Union, * * * * * * * * * * * \"In the 1939-1941 period alone, Soviet-inflicted suffering on all citizens in Poland exceeded that of Nazi-inflicted suffering on all citizens. (...) The Soviet-imposed myth about \"Communist heroes of resistance\" enabled them for decades to avoid the painful questions faced long ago by other Western countries.\" Johanna Granville, H-Net Review of Jan T. Gross. Revolution from Abroad. * Greeks were also persecuted by the totalitarian regime of Joseph Stalin (1878–1953). * * * * Το πογκρόμ κατά των Ελλήνων της ΕΣΣΔ, ΕΛΛΑΔΑ, 09.12.2007 * ==Events== Between the 1930s and 1949, Greek schools, cultural centres and publishing houses were banned from operating, while all Greek men older than 16 years old were deported to forced settlements that took the form of cattle trains. One of the Greek victims said: ==Casualties== 70,000‒80,000 Greeks were victims of such deportation and 15,000 did not survive, a death rate between 18.8% and 21.4%. The surviving Greeks were not allowed to return to their original homes until the MVD Order N 0402 was adopted on September 25, 1956. Some survivors moved to Greece. ==Aftermath== Despite not being comparable to the Holocaust, the Soviet deportation of Greeks has been classified as a genocide by some historians. It has however received little attention from left-wing scholars in the West, who have substantial influence in academia and history writing. * Lappin, Shalom (2006), ‘How Class Disappeared from Western Politics’, Dissent, Vol. 51, No. 1, pp. 73-78. * * * * Kirsch, Adam (2024), On Settler Colonialism: Ideology, Violence, and Justice, W.W. Norton and Company, New York and London. * * * * * ==Related pages== * Holodomor * Soviet deportation of Koreans * Soviet deportations of Chechens and Ingush * Soviet persecution of Poles during World War II * Soviet deportations from Bessarabia and Northern Bukovina ==Footnotes== ==References== Category:Racism Category:Communism Category:Deportations Category:Soviet crimes against humanity",
 "title": "Soviet deportation of Greeks"
}