{
 "id": "1180249",
 "text": "The Battle of Tabriz was a turning point in the Iran-Ottoman wars. Having inflicted a heavy defeat on the Safavid army under the command of Shah Ismail in the Battle of Chaldiran on 23 August 1514, the Ottoman army under the command of Yavuz Sultan Selim continued its forward operations and entered the Safavid capital Tabriz on 6 September 1514.Uzunçarşılı, 1986, p. 23-76 == Battle == The Ottoman army under the command of Yavuz Sultan Selim advanced towards Tabriz on August 25, 1514 after the Chaldiran victory. Dukaginoğlu Ahmet Pasha, Defterdar Piri Çelebi and (chronicle) Idris-i Bitlisî were sent to Tabriz as a vanguard with a reserve unit. This vanguard unit took over the city and preparations for welcoming began. The people of Tabriz covered the road with shawls and precious fabrics until Surhab outside Tabriz. The soldiers and the people lined up along the route applauded Yavuz Sultan Selim and the Ottoman army who entered the city on September 6, 1514.\"İzahlı Osmanlı Tarihi Kronolojisi\", İsmail Hami Danişmend, n.2, p.14 On Friday, September 8, 1514, the Friday greeting was performed at the Sultan Yakub Mosque (or Hasan Han Mosque in some sources) and a sermon was read in the name of Yavuz Sultan Selim.Hoca Sâdeddin,II, 279 Selim also ordered the repair of mosques that had been ruined due to neglect.Michael, Alan. God's Shadow: Sultan Selim, His Ottoman Empire, and the Making of the Modern World. Liveright. 2020. ISBN 978-1631492396. On September 12, the transfer of approximately 1,000 scientists and artists from Tabriz to Istanbul began. On September 15, the Ottoman army left Tabriz and advanced towards Karabakh. The Janissaries, who opposed the idea of Yavuz Sultan Selim staying in Tabriz, also rebelled against the idea of Selim wintering in Karabakh and marching on Iran again in the following campaign season (sources record that the Janissaries shouted around the Sultan by attaching their torn shoes and clothes to the tips of their spears, and even fired bullets into the Sultan's tent). ==References== Category:16th-century conflicts Category:Ottoman Empire Category:Wars involving Asia",
 "title": "Battle of Tabriz (1514)"
}