{
 "id": "118036",
 "text": "In the National Football League, NFL Training Camp is the time before the season starts. During this time, teams will work hard at an special place, often a university. This is almost the same as baseball's spring training. == Training camp sites by team == Team Site Location Arizona Cardinals Northern Arizona University Flagstaff, Arizona Atlanta Falcons Atlanta Falcons Training Facility Flowery Branch, Georgia Baltimore Ravens McDaniel College Westminster, Maryland Buffalo Bills St. John Fisher College Pittsford, New York Carolina Panthers Wofford College Spartanburg, South Carolina Chicago Bears Olivet Nazarene University Bourbonnais, Illinois Cincinnati Bengals Georgetown College Georgetown, Kentucky Cleveland Browns Cleveland Browns Training Facility Berea, Ohio Dallas Cowboys Alamodome San Antonio, Texas Denver Broncos Paul D. Bowlen Memorial Centre Centennial, Colorado Detroit Lions Detroit Lions Training Facility Allen Park, Michigan Green Bay Packers St. Norbert College De Pere, Wisconsin Houston Texans Houston Texans Practice Facility Houston, Texas Indianapolis Colts Rose-Hulman Institute of Technology Terre Haute, Indiana Jacksonville Jaguars Jacksonville Municipal Stadium Jacksonville, Florida Kansas City Chiefs University of Wisconsin-River Falls River Falls, Wisconsin Miami Dolphins Miami Dolphins Training Center Davie, Florida Minnesota Vikings Minnesota State University, Mankato Mankato, Minnesota New England Patriots Gillette Stadium Foxboro, Massachusetts New Orleans Saints Millsaps College Jackson, Mississippi New York Giants University at Albany Albany, New York New York Jets Hofstra University Hempstead, New York Oakland Raiders Napa Valley Marriott Napa Valley, California Philadelphia Eagles Lehigh University Bethlehem, Pennsylvania Pittsburgh Steelers Saint Vincent College Latrobe, Pennsylvania St. Louis Rams Rams Park St. Louis, Missouri San Diego Chargers Chargers Park San Diego, California San Francisco 49ers San Francisco 49ers Complex Santa Clara, California Seattle Seahawks Seahawks Kirkland Headquarters Kirkland, Washington Tampa Bay Buccaneers Disney's Wide World of Sports Complex Lake Buena Vista, Florida Tennessee Titans Baptist Sports Park Nashville, Tennessee Washington Redskins Redskins Park Ashburn, Virginia == Other websites == *NFL Training Camp Information - From NFL.com Training camp",
 "title": "National Football League Training Camp"
}