{
 "id": "1180043",
 "text": "Nay Shwe Thway Aung (; ; born 22 May 1991), also known as Phoe La Pyae (; ; ), is a Burmese public figure, businessman, and musician. He is the grandson of former leader of Myanmar Than Shwe. == Early life and family == He was born in Yangon on 22 May 1991. His father is army doctor Nay Soe Maung and his mother is Kyi Kyi Shwe, the daughter of Than Shwe. He studied at Practising School Yangon Institute of Education and later went to West Yangon Technological University. == Business interests == Nay Shwe Thway Aung is known for helping connect business people and government officials. He was accused of using his family’s power for business deals and getting benefits like vehicle imports. He had conflicts with other generals’ sons, including Aung Thet Mann and Toe Naing Mann. He is close to businessman Zaw Zaw, who got licenses and contracts with help from this relationship. Zaw Zaw invited him to play for the football club Delta United. In 2007, he played in a match attended by famous footballer Hidetoshi Nakata. He also joined the Lamborghini Club in Singapore and reportedly got a Mercedes-Benz at a low price from a military-owned warehouse. == Political involvement == Many military officers were unhappy with how high his status was despite not being in the army. He often appeared beside his grandfather in official photos and state visits. In September 2010, he joined Than Shwe on a trip to China. He also managed Yadanabon Cyber City, which is Myanmar’s internet control center. People thought he might take over after Than Shwe, but in 2011, he publicly said he would not. Than Shwe stepped down on 30 March 2011 and passed power to Thein Sein. On 4 December 2015, he and his grandfather met Aung San Suu Kyi and showed support for her. In October 2016, he joined a state meeting with 158 top businessmen and Suu Kyi. After the 2021 military coup, he became less active publicly and faced social boycotts due to his military family background. == Music career == He is a big fan of singer Enrique Iglesias and covers many of his songs. On 4 October 2014, he posted a Burmese cover of \"Escape\", which got over 1.1 million views. On 8 November 2018, he released a Burmese version of \"Tonight (I'm Lovin' You)\" that reached over 1.9 million views, with one million in the first day. On 27 December 2018, he shared a Burmese cover of \"Hero\", which got over 1.2 million views. He often mixes Burmese lyrics with the original English ones. His videos are high-budget, including scenes with expensive cars and even burning real money. In 2019, he met Enrique Iglesias in person and also appeared at the Miss Universe Myanmar 2019 event. == Controversies == He was involved in many scandals during Than Shwe’s rule. He denied the claims in 2017 and said they were made up for political reasons. When he was young, he was accused of kidnapping actress Wutt Hmone Shwe Yi. He was also said to have used his power to get his girlfriend Nay Chi Lin Let admitted into medical school. He was linked to a group called \"Sin Zway\" (Elephant Tusk), which was known for violence. In 2009, he was connected to a drug case. Two people close to him, businessman Maung Weik and the son of General Ye Myint, were arrested. A US cable said he asked Than Shwe to buy Manchester United for $1 billion, but the idea was dropped after international criticism. He later denied this, saying he is a fan of Chelsea F.C. He reportedly ordered the destruction of a café in Yangon after a disagreement with the owners, who were sons of other high-ranking officials. In December 2010, he allegedly had his assistants beat up a professional golfer over a personal issue. == References == Category:Pages created with the Article Wizard from 2025 Category:Living people Category:1991 births Category:Burmese singers Category:Business people",
 "title": "Nay Shwe Thway Aung"
}