{
 "id": "1180053",
 "text": "The 2010 Nobel Prizes were given out by the Nobel Foundation. There were six different awards: Physics, Chemistry, Physiology or Medicine, Literature, Peace, and Economic Sciences. Nobel Week was from December 6 to December 12. During the week, there were many lectures and discussions. On December 10, the award ceremony and banquet (celebration meal) for each prize happened. The award ceremony and banquet for the Peace Prize was in Oslo, and the award ceremony and banquet for the other awards were in Stockholm. == Prizes == === Physics === Winners Andre Geim (b. 1958) Russian British \"for groundbreaking experiments regarding the two-dimensional material graphene\" Konstantin Novoselov (b. 1974) === Chemistry === Winners Richard F. Heck (1931–2015) American \"for palladium-catalyzed cross couplings in organic synthesis\" Ei- ichi Negishi (1935–2021) Japanese Akira Suzuki (b. 1930) === Physiology or Medicine === Winner Sir Robert G. Edwards (1925–2013) \"for the development of in vitro fertilization\" === Literature === Winner Mario Vargas Llosa (b. 1936) \"for his cartography of structures of power and his trenchant images of the individual's resistance, revolt, and defeat\" === Peace === Winner Liu Xiaobo (1955–2017) \"for his long and non-violent struggle for fundamental human rights in China.\" === Economic Sciences === Winners Peter A. Diamond (b. 1940) \"for their analysis of markets with search frictions\" Dale T. Mortensen (1939–2014) Christopher A. Pissarides (b. 1948) Liu Xiaobo's Prize was given in absentia (without him being there) because he was in prison in China. == Controversy == China and several other countries boycotted the awards ceremony in Sweden because they did not like that the Peace Prize was going to be given to Liu. China also started their own peace prize, the Confucius Peace Prize, which is given one day before the Nobel Prizes award ceremony. == References == Category:Nobel Prize Category:2010 establishments in Europe",
 "title": "2010 Nobel Prizes"
}