{
 "id": "1180983",
 "text": "On 8 April 2025, the roof collapsed at the Jet Set nightclub in Santo Domingo during a live music performance. Santo Domingo is the capital of the Dominican Republic. The disaster resulted in at least 221 deaths and 255 injuries.150 people needed to go to the hospital. As many as 189 people were rescued alive from the rubble. Among those who died were Monte Cristi provincial governor Nelsy Cruz, former Major League Baseball players Octavio Dotel and Tony Blanco, and merengue musician Rubby Pérez, who was performing when the roof collapsed. Dominican Social Policy Cabinet coordinator Tony Peña Guaba called the disaster the \"worst non-atmospheric disaster\" in the country's history. == Background == The Jet Set nightclub in Santo Domingo was hosting a concert by merengue musician Rubby Pérez. The nightclub opened in 1973. It was renovated in 2010 and 2015. It was also struck by lightning in 2023. The club was famous for playing live dance music on Monday nights. This attracted many well-known people. The nightclub had been used for years but the structural issues were relatively new. The building used to be a cinema. Cinemas had different rules about safety of the building. == Collapse == The collapse occurred on Tuesday, 8 April 2025, at 12:44 a.m. AST. At that time, there were between 500 and 1,000 people in the club. A video clip reportedly taken of the concert in the venue showed someone someone who was visiting the concert pointing to the roof. They said that \"something fell from the ceiling\". Pérez was also looking at that section of the roof. Less than 30 seconds later, a loud noise was heard. The video went black, with a woman shouting in Spanish, \"Dad, what's happened to you?\" According to what witnesses said that they saw, the roof fell without warning about one hour into the musical performance. The cause of the structural failure is unknown. Investigators began checking the site once rescue operations allowed it. A musician playing alongside Rubby Pérez said that the venue was full at the time of collapse. He initially believed an earthquake had occurred. First Lady of the Dominican Republic Raquel Arbaje said that the trapped Governor of Monte Cristi province Nelsy Cruz called President Luis Abinader at 12:49 a.m., shortly after the collapse. == Emergency response == A large search and rescue mission was started. 400 responders were sent to the disaster site. First responders worked constantly to find survivors among the rubble. Rubby Pérez had been performing when the disaster occurred. He reportedly began singing to help rescuers find where he was within the rubble. Pérez's daughter, Zulinka, escaped from the collapse. According to her, the performer was injured but stayed in stable condition after he was freed from the collapsed structure. However, he was later reported dead. From 3 p.m. on the day of the collapse onwards, no more survivors were recovered from the disaster site. 22 state agencies conducted rescue operations at the site. This included three cranes and many search dogs. During rescue operations, crowds gathered outside. They prayed for the victims and sung Christian songs to help each other cope with the tragedy. A crowd gathered in front of the National Institute of Forensic Pathology. It showed images of the victims to help loved ones identify them. After 8:00 p.m., updates were paused until the next day. This is because the victims' relatives asked for the updates to be paused. Several trapped victims helped rescue efforts by crying for help. Others helped by calling their families on their phones. Emergency services counted at least 138 ambulance transfers. The actual number of injured people was more than 150 according to Juan Manuel Méndez, the country's director of emergency management operations. This discrepancy was caused by multiple people sometimes being taken to hospital in one ambulance. At least 155 trips were made to nearby hospitals. Abinader visited the disaster site on the morning of 8 April. He checked the situation and confirmed the government's dedication to the rescue efforts. He said that \"all government resources\" were being used in the ongoing operation. Rescue crews from Israel, Puerto Rico and Mexico arrived in Santo Domingo on 9 April to assist in rescue efforts. Mayor of Santo Domingo Carolina Mejía started up the municipal disaster response committee. She showed sympathy to families awaiting news about their loved ones. The municipal government coordinated closely with national emergency services to manage the crisis. The management of the Jet Set nightclub promised their full cooperation with authorities in the investigation and in giving help to victims and their families. == Injuries and deaths == Below is a list of people who were talked about in the news because of their deaths in the roof collapse. List of notable people who died Picture Name Nationality Known for Notes Nelsy Cruz Governor of Monte Cristi province, Modern Revolutionary Party (PRM) politician Sister of Major League Baseball player Nelson Cruz. Her death was attributed to injuries from falling glass. Octavio Dotel Major League Baseball (MLB) pitcher, 2011 World Series champion Died at the hospital after the incident. A memorial was held for him by the New York Mets at Citi Field. Rubby Pérez Merengue singer Main performer at the night club during the incident. Tony Blanco Major League Baseball (MLB) and Nippon Professional Baseball (NPB) player Died while saving fellow athlete Esteban Germán from the falling roof. Alexandra Grullón Project manager of Daughter of tycoon Alejandro Grullón and sister of Banco Popular chairman Manuel Alejandro Grullón. Eduardo Grullón Chairman of Son of tycoon Alejandro Grullón and brother of Banco Popular chairman Manuel Alejandro Grullón. Eduardo Guarionex Estrella Deputy director of the National Housing Institute in the Dominican Republic Son of politician Eduardo Estrella, the former president of the Senate and current minister of public works. Christian Alejandro Tejeda Pichardo Director of Urban Infrastructure for the Distrito Nacional Mayor's Office Fray Luis Rosario Owner of the Terra Luna Cafe in Lawrence, Massachusetts, and the Terre Negra Cantina in Providence, Rhode Island. Went to the concert with his wife Florinda Rojas, who owns a bakery and was reported missing. Lucila Ramón Official of the United Nations World Food Programme Sister of a former governor of Elías Piña province. Her daughter was also killed. Luis Guillén Dominican Republic national football team player Martín Polanco Fashion designer, specifically in guayabera shirts The collapse killed 221 people. Police said that those killed included former Major League Baseball pitcher Octavio Dotel, baseball player Tony Blanco (who died saving Esteban Germán) and Rubby Pérez. National football team player Luis Guillén, fashion designer Martín Polanco and National District Mayor's Office's Director of Urban Infrastructure Christian Alejandro Tejeda Pichardo were confirmed dead. Rubby Pérez's manager said Pérez's saxophonist was also killed. Grupo Popular confirmed in the early morning of 9 April the death of several members of the Grullón family: chairman of AFP Popular Eduardo Grullón and his wife, as well as his sister and her husband. Abinader also confirmed that Nelsy Cruz, governor of Monte Cristi province and sister of former Major League Baseball player Nelson Cruz, was among those killed. She died from falling glass. It was said that at least 25 Venezuelan people were inside Jet Set when the roof collapsed. This included Telemicro news anchor , who was injured. Ten Venezuelans were killed, five injured and others went missing. A woman from Colombia was also killed. Two other Colombian people were injured. An Italian man, who worked as a chef in the city, and a woman with Dominican–Italian citizenship were also among the deaths. Other people from other countries were among the dead. There were two from France and one each from Haiti and Kenya. The number of injured victims reached more than 200 people, including members of the Chamber of Deputies Bray Vargas and Carlos J. Gil Rodríguez and the latter's wife. Two of Rodríguez's assistants went missing. Former MLB player Esteban Germán survived the collapse, while MLB pitcher Pedro Martínez said several of his family members went missing following the roof falling down. == Aftermath == Abinader declared three days of mourning in the country from 8 to 10 April. All country flags at public structures and military bounds were lowered to half-mast. On 10 April, Abinader extended the mourning period to six days. His office also said that a commission of national and international experts would be set up to investigate the disaster. The Senate of the Dominican Republic suspended an arranged session for 9 April and all committee activities and shared a statement showing regret for the disaster. Soon after the disaster, reports from Diario Libre said that Santo Domingo had less traffic. Diario Libre called this \"unusual\". It went on to say that fewer people were walking and there was an \"unusual silence\". A memorial service was held for Rubby Pérez at the Eduardo Brito National Theater. President Abinader and First Lady Raquel Arbaje went there. == Reactions == In the hours after the disaster, the family of Governor Nelsy Cruz announced through her brother, baseball player Nelson Cruz, that memorial services would be held at the Provincial Government of Montecristi. They said that a funeral was arranged for the evening of 8 April. In a statement, Commissioner of Major League Baseball Robert Manfred offered sympathy for the deaths of Governor Cruz and former players Octavio Dotel and Tony Blanco. New York Mets player Juan Soto and former pitcher Pedro Martínez expressed their condolences to the victims' families. Dotel played for the St. Louis Cardinals, New York Yankees, Houston Astros, Toronto Blue Jays, Detroit Tigers, Pittsburgh Pirates, Colorado Rockies, and Oakland Athletics, and each team shared statements on social media mourning his death. Dotel also played for the Mets, the Kansas City Royals, the Atlanta Braves, the Chicago White Sox, and the Los Angeles Dodgers. Before the start of a game against the Miami Marlins, the Mets held a tribute and moment of silence for Dotel. In Haina, the town where dead performer Rubby Pérez and at least 28 other victims lived, members of the Jaineros Dorados choir lit candles in tribute to the dead. Minister of Culture Roberto Salcedo Jr. publicly mourned the death of Governor Cruz. He described her death as \"an irreparable loss for her community and for the entire country\". He also said that she was \"a committed public servant\" and \"a woman of steadfast leadership\". Celebrities who expressed solidarity and remorse for the victims and their loved ones include rappers Bad Bunny, Daddy Yankee, Cardi B, and Don Omar; musicians Juan Luis Guerra, Alejandro Sanz, Wilfrido Vargas, and Francisca Valenzuela; singers Ricardo Montaner, Eddy Herrera, Natti Natasha, Thalía, Marc Anthony, and Olga Tañón; and actresses Zoe Saldaña and Clarissa Molina. Several members of the United States Congress—including María Elvira Salazar, Nydia Velázquez, and Adriano Espaillat—as well as New York State senator Luis Sepúlveda, offered condolences. Nicolás Maduro, the president of Venezuela, shared his \"most heartfelt message of condolence\" to the \"sister Dominican Republic and its people\". Bruno Rodríguez Parrilla, the minister of foreign affairs of Cuba, shared his condolences to the Dominican people and government for the loss of human life. This was on behalf of the Cuban government. Russian president Vladimir Putin sent his \"sincere condolences\" and said that Russia \"shares the sorrow of the Dominican people over this tragic incident\". The Espaillat family, one of the richest families in the Dominican Republic and the owners of the nightclub, shared a statement showing their regret. == References == Category:2025 disasters Category:2020s disasters in North America",
 "title": "Jet Set nightclub roof collapse"
}