{
 "id": "118025",
 "text": "Gout is a very painful medical condition that affects a joint or joints. Acute gout usually affects one joint, usually the big toe (as podagra). Around one to two percent of people in the West will have gout during their lifetime. In 2011, in the US, around 6.1 million Americans had gout. It has become more common since 1990, and risk factors of gout have been increasing. Gout was historically known as “the disease of kings”Kubitz possibly has gout. or “the disease of rich men\". It might show up or \"present\" red on skin (causing erythema) and as swelling of the joint affected. Gout may affect one joint (called monoarticular gout), two, three or (rarely) four joints (oligoarticular) or even five joints (polyarticular gout). The attacks affect the joint at the base of the big toe about half the time and 90% of people with gout will experience an attack in the toe. However, it can happen in any joint, such as the feet, ankles, fingers, wrists and elbows. 50% of people that have untreated gout will develop tophi within 10 years, and after 20 years, the amount to develop tophi is 72%. The amount of people who get tophi after 5 years is 30%, after the first acute attack. It is usually sudden and severe. Acute gout is usually self-limiting, meaning that attacks last 4-7 days and seem to resolve (go away) on their own with no pain between attacks. People with gout often have more than one attack (two thirds of people with gout will have repeat attacks). If it is left untreated, future attacks might get worse while also being more likely. In a follow-up the patient is usually given information about gout and how they can get relief from the pain, like how using ice packs (or ice wrapped in a towel), elevation of the limb higher up, and oral NSAIDs can give relief straight away when gout flares up. However these do not do anything to treat the swelling or cause of gout (it only helps pain). It also helps most people to not touch the swollen joint (and even letting it air out without a bedsheet or clothing covering the affected joint). With proper treatment, gout can be resolved within 4 days to a week (7 days) and would be treated for an extra 24-48 hours afterwards. Gout caused by having to much uric acid in the blood is called primary gout and can cause other problems in the body. Gout caused by problems in the body is called secondary gout. With positive lifestyle changes, most gout can be treated and even prevented. Medicines that help people with gout are usually a lifelong change. Most of them try to help lower the amount of urate in blood serum, while some drugs help under-secretors urinate more.https://www.goodrx.com/conditions/gout/febuxostat-vs-allopurinol It is important to continue with treatment and prevention, even when gout is gone, because blood levels of uric acid can rise back up quickly. People with gout may want to learn about gout, and how to cope with attacks, stress, family and other information such as medication, family history, and other interventions. Inflammatory arthritis happens in about 50% of all cases of gout. Gout attacks happen because of crystals in the blood made of uric acid and sodium salt, called monosodium urate crystals. When these crystals are put into fluid around the joints it causes gout. Both these parts are normally kept in the blood until they can be excreted through the kidneys, but sometimes the body can not. The crystals can go in to bone, cartilage, and surrounding tissue. The body might do this with uric acid in the blood when levels are too high (hyperuricemia), but this does not always result in gout. == Signs and symptoms == Gout can present in a number of ways. It is often misdiagnosedhttps://www.bmj.com/content/320/7228/132.short or left untreated. The most common sign of gout is a recurrent (keeps happening) attack of intense inflammatory arthritis, and a red hot, tender and swollen joint. Joint pain lasts for around two to four hours and usually happens during the night. Attacks will often occur at night because of the lower body temperature at this time. The pain is usually as bad as it will get within the first 24 hours.In some cases, checking for high amounts of urate crystals in blood or fluid from joints is not possible. This could be for a joint that is potentially infected (10,000 cases of sepsis occur per year in the UK because of aspiration of infected joints) or that a flare-up is still happening. To diagnose, the ACR recommendhttps://pubmed.ncbi.nlm.nih.gov/32391934/ checking for more signs. When the diagnosis of gout is not certain (sure), there should be a check for more than one sign out of a list of common signs and symptoms. In some cases though, a doctor might ask the patient to return to measure the serum uric acid levels once the gout attack has passed. This also occurs if gout is suspected but levels are below the 360/mmol threshold, and this is because the urate levels might go down during an attack. Clinically, the signs of gout are: * having had self limiting gout before, lasting from 7 to 14 days * pain and soreness of the gout, which might affect work or home life * monosodium urate crystals in the jointhttps://pubmed.ncbi.nlm.nih.gov/32391934/ * monosodium urate crystals found in the tophus Or if 6 or more of the following list applyhttps://pubmed.ncbi.nlm.nih.gov/32391934/ * more than one attack of acute arthritis * maximum inflammation developed within 1 day * monoarthritis attack, redness observed over joints * first metatarsophalangeal (MTP) joint painful or swollen * unilateral (one side) first metatarsophalangeal joint attack * unilateral tarsal joint attack * tophus (confirmed or suspected) * hyperuricemia * asymmetrical swelling within a joint on X-ray film * subcortical cyst without erosions on X-ray film * joint culture negative for organism during attack File:Case 30-top.jpg|Nodules of the finger and helix of the ear representing gouty tophi Image:ChronicGout.jpg|Tophus of the knee Image:Case 30-bottom.jpg|Tophus of the toe, and over the external malleolus Image:Tophigout.JPG|Gout complicated by ruptured tophi (exudate tested positive for uric acid crystals) A sign of chronic gout is painless deposits of uric acid crystals known as tophi. Extensive tophi may lead to long-term, chronic arthritis due to bone damage and erosion. High levels of uric acid in the blood may also cause crystals to form in the kidneys. This causes stone formation (called renal calculi) followed by urate nephropathy. There may also be cardiovascular disease, an important set of conditions to prevent, and finding related illness could give more healthy life years and relieve gout, and is also cost effective to do so overall. Many of the people with gout suffer from impaired heart, kidney and thyroid function. Hyperparathyroidism causes gout, because of hormones.https://arthritis- research.biomedcentral.com/articles/10.1186/ar3769 It can also cause pseudogout when it involves calcium phosphate crystals instead of uric acid. The hormone that is causing gout in this case is the parathyroid hormone (or PTH for short), and does this because PTH can cause renal function to be impaired.https://academic.oup.com/jes/article/6/4/bvac018/6525332 * Tophi can happen over knees, elbows, Achilles tendon, the helix of the ears or dorsum of the hands or feet. ==Cause== A very high (abnormal) level of uric acid in the blood (hyperuricemia) is the basic cause of gout.https://gpnotebook.com/en- GB/pages/general-information/gout/risk-factors When serum uric acid level is the cause, it is called primary gout. The crystallization of uric acid happens when there is too much of it in the blood. There may be too much uric acid because of: (i) diet; (ii) under-excretion (for example if the kidneys fail to work properly); (iii) over-production (the body making too much of it).https://pmc.ncbi.nlm.nih.gov/articles/PMC4346785 Most people with gout have hyperuricemia while many people with hyperuricemia do not have gout. Most people have hyperuricemia from under-excretion, while around 10% are over- producers of uric acid.https://www.jrheum.org/content/jrheum/29/7/1350.full.pdf There are a lot of reasons for why gout might occur, but hyperuricemia is the common sign among them all. Finding crystals (of monosodium urate) in samples of the synovial joint fluid is enough of a sign to clinically diagnose gout. High levels of uric acid in the blood over a long period of time can cause other symptoms. It may co-exist with or be secondary to other conditions, so it is important to be aware of the comorbidities such as heart disease (cardiovascular disease (CVD) and peripheral Artery Disease, or PAD for short) and chronic kidney failure (CKD), or other metabolic syndromes, in a person with gout or hyperuricemia. When gout is caused by another problem in the body, it is called secondary gout. Age and gender are factors to be aware of in gout. It affects old people more than it does young people, and men more often than it does women (affects males:females 4:1) except in the elderly where the differences in gender are less obvious. Women after menopause are more at risk of developing gout, but overall men develop gout more than women.https://gpnotebook.com/en-GB/pages/general-information/gout/risk-factors This is true for the medicines that are made to treat gout too. Diuretics, such as Thiazine, and other medications may cause gout.https://patient.info/heart-health/high-blood-pressure- hypertension/thiazide-diuretics Studies suggest that gout may be secondary to sleep apnea through the release of purines from oxygen-starved cells. Treatment of sleep apnea can lower how many gout attacks happen. ===Lifestyle=== The increase in risk factors might be causing the number of cases to increase in certain demographics, such as in New Zealand,https://doi.org/10.1136/ard.56.1.22 but there is not much evidence to show that gout is on the rise everywhere. Diet and genetics are possible reasons for the high levels of uric acid causing gout. Levels can become high if the body can not excrete enough urate, the salts of uric acid. Unhealthy foods or eating too much makes uric acid levels higher than normal. Diet is the cause in about 12% of cases of gout. Not enough water (dehydration), or drinking a lot of alcohol or fructose-sweetened drinks, and eating too much organ meat, or seafood can cause the disease. Fructose is the only carbohydrate which causes uric acid levels to increase.https://pmc.ncbi.nlm.nih.gov/articles/PMC6297580/ Injuries and surgery (organ transplant) may also start attacks of gout. Recent studies have cast doubts on some beliefs about connections between gout and diet, and the involvement of certain purines. Eating purine-rich vegetables (e.g., beans, peas, lentils, and spinach) or large amounts of protein do not contribute to developing gout. Other research has found that not all vegetables are high in purines but some (including peas, seaweed, and asparagus) may increase the risk of someone developing gout regardless.https://www.jrheum.org/content/jrheum/29/7/1350.full.pdf Medications to lower the uric acid concentration in the body are used to treat recurrent high levels of uric acid. These are taken to treat both under- excretion and over-production of urate. Supplements, for example vitamin C tablets (an antioxidant) may help. Coffee, and dairy products, as well as physical fitness appear to decrease the risk of future attacks. These things reduce insulin resistance and may reduce cases of gout. ===Inherited causes=== Inherited factors are about 60% - 73% responsible for the variability in uric acid level. 40% - 50% of people with gout have a family member older than them with it too.https://www.ncbi.nlm.nih.gov/pmc/articles/PMCf6/ Two genes called SLC2A9 and ABCG2 are commonly associated with gout. Variations in these genes can almost double the risk of developing this disease. Some people of African American, Asian (Han Chinese) descent, and from other SEA countries might respond poorly to gout or certain drugs (allopurinol) because of genetics. The HLA-B5801 allele is found more often in Han Chinese and African American populations and is a risk factor in these people. It affects them in gout and its treatment. There could be adverse reactions to allopurinol in these people affected such as Stevens–Johnson syndrome and toxic epidermal necrolysis. These are serious and can be life threatening. These people are also at an increased risk in gout and of severe bleeding when taking other medications. ===Medical conditions=== Gout often happens with other medical problems. Metabolic syndrome happens along with nearly 75% of all cases of gout. Gout often makes these other problems worse, can make them harder to treat, or be what is causing them. Polycythemia, lead poisoning, renal failure, hemolytic anemia, psoriasis, and solid organ transplants are some examples of this. These examples may also be caused by gout as well as being what is causing it, for example by making the levels of the uric acid higher (in kidney problems, hypertension, diabetes, and hyperlipidaemia, which means high levels of cholesterol in the blood, and hyperparathyroidism). Rapid changes in uric acid levels sometimes occur due to a number of these factors, including trauma, surgery, chemotherapy, diuretics, and stopping or starting the medication allopurinol. One less commonly mentioned cause of gout is starvation. Males have three times the chance of getting gout when the body mass index is greater than or equal to 35. Frequent lead exposure and lead-contaminated alcohol are risk factors for gout because lead harms the kidney function. ==Changes in the body== Gout is a crystal arthropathy arising from the disorder of purine metabolism, and occurs when its final metabolite, called uric acid, crystallizes in the form of monosodium urate. The blood deposits the crystals in joints, on tendons, and in the surrounding tissues. These crystals then trigger a local immune system inflammatory reaction. Uricase is required to breakdown uric acid. An evolutionary loss of uricase in humans and higher primates has made this condition more common. This, paired with our lack of ability to produce vitamin C, has made some people think that uric acid replaced ascorbic acid as a the main oxidiser in the body. While UA may crystallize at normal levels, it is more likely to do so as uric acid levels increase. Other factors believed to be important in triggering an acute episode of arthritis are cold temperatures, fast changes in uric acid levels, acidosis, articular hydration, and extracellular matrixproteins, such as proteoglycans, collagens, and chondroitin sulfate. The increased crystallization at low temperatures partly explains why the joints in the feet are most commonly affected. as well as the low volume of blood, and extra work for the heart in dehydration. ==Diagnosis== Gout may be diagnosed and treated without further investigations in someone with hyperuricemia and the classic podagra. If gout is strongly suspected, but uric acid levels are low (below 360 μmol/L), testing the uric acid levels in blood 2 to 4 weeks after the flare-up has settled should be done. If there is any doubt about the diagnosis, synovial fluid analysis should be done. The presence of hyperuricemia alone should not be the sole diagnostic.https://pubmed.ncbi.nlm.nih.gov/31167758/ X-rays are useful for identifying chronic gout only. X-rays are not useful for treating acute gout attacks. ===Synovial fluid=== A definitive diagnosis of gout is based upon the identification of monosodium urate (MSU) crystals in joint fluid or a tophus. All synovial fluid samples obtained from undiagnosed, inflamed joints should be examined for these crystals as soon as possible. Transporting or overnight storage of the sample may cause the quality of the test to be lower; it is important to check the fluid right away, in the same (primary/secondary care) building. Under polarized light microscopy, the crystals have a \"needle-like\" shape and strong negative birefringence meaning the crystals have the same shape and appearance as tiny needles in the joint. This test is difficult to perform, and often requires a trained technician. The test is not usually done in joints that could be infected, meaning the test might have to wait for the flare-up to disappear. The fluid must also be examined relatively quickly after aspiration, because temperature and pH affect their solubility. ===Blood tests=== Hyperuricemia is a classical feature of gout. Gout occurs nearly half of the time without hyperuricemia and most people with raised uric acid levels never develop gout. The usefulness of measuring uric acid levels is limited but can still be done. Hyperuricemia is defined as a plasma urate level greater than 420 μmol/L (7.0 mg/dL) in males and 360 μmol/L (6.0 mg/dL) in females. Other blood tests commonly performed are white blood cell count, electrolytes, renal function, and erythrocyte sedimentation rate (ESR), and estimated glomerular filtration rate (eGFR).https://www.kidney.org/kidney- topics/estimated-glomerular-filtration-rate-egfr Both the white blood cells and ESR may be elevated due to gout in the absence of infection. A white blood cell count as high as 40.0×109/L (40,000/mm3) has been documented in people with gout. ===Differential diagnosis=== The most important diagnosis to rule out in gout is septic arthritis (an infection in the joint). A joint fluid Gram stain and culture may be performed to support the diagnosis, before starting IV antibiotics. In cases where septic arthritis is suspected, a referral should be made immediately. Septic arthritis should be considered in those with signs of infection or those who do not improve with treatment. Other conditions which present similarly are pseudogout (CPPD) and cases of swelling caused by trauma and infection. Gouty tophi, especially when not in a joint, can be mistaken for basal cell carcinoma, or other cancers. Finding crystals made of calcium pyrophosphate and normal uric acid levels when testing can help differentiate (tell the difference between) gout and pseudogout. ==Prevention== Both lifestyle changes and medications can lower uric acid levels. Dietary and lifestyle choices mean finding and beating the root cause in some cases and treating obesity (and alcoholism) in general. The BMJ has not found evidence of a specific diet (or fad diet) working for gout but say physical fitness and healthy diet is good. Prevention is usually started when there has been 1 or 2+ attacks in 12 months, tophi, or renal stones. In trying to prevent gout, the goal is to lower the amount of attacks and prevent damage to the joints, caused by crystal deposition. This is done by lowering the amount of urate in the blood. The aim in gout that is already highly affecting the body is to lower joint damage and stop tophi being made, or breaking the tophi down. In starting treatment, a plan will be worked out between patient and doctor, and a target (level of serum urate) will be set to begin urate lowering therapy (ULT). In some cases, prevention could mean lowering how much meat and seafood is eaten, and taking or eating adequate vitamin C, limiting how much fructose is in the diet, avoiding obesity, alcohol, and tobacco smoking if this is causing blood serum levels of uric acid to be abnormal (not normal). A low-calorie diet in obese men lowered uric acid levels by 100 µmol/L (1.7 mg/dL) on average. Vitamin C eating of 1,500 mg per day lowers the risk of gout by 45%. Coffee, but not tea, drinking is associated with a lower risk of gout. Replacing dietary sugar and fructose with artificial sweeteners can help prevent gout, although there is debate on whether artificial sweeteners cause gout. Clinical options for prevention are allopurinol, febuxostat and probenecid. Lowering uric acid levels can cure the disease. ==Treatment== Most of the time gout is treated using medicine after testing. The most common treatments use the xanthine oxidase inhibitors (XOIs) allopurinol and febuxostat and usually they are given with NSAIDs. Ice wrapped in a towel, bed cages, elevation of the limb, and oral NSAIDs can give relief straight away when gout flares up at home. Opiates are less frequently used and are not recommended by NICE, but may be used if too many NSAIDs are ineffective,https://pubmed.ncbi.nlm.nih.gov/17522099/ and may be useful in combination with colchicine to prevent the diarrhoea as a side effect. The first goal of treating gout is to reduce the symptoms of an acute attack such as pain and inflammation. It is preferred that treatment begins within 24 hours. Ice applied for 20 to 30 minutes several times a day decreases pain. Treatment of comorbidities is also important. Treating comorbidities or in off-label use, different medicines for concurrent used for concurrent disease, mainly drugs which reduce the uric acid levels in the blood, can be used in the treatment of gout. Options for immediate treatment are nonsteroidal anti- inflammatory drugs (NSAIDs), and then colchicine and steroids if that is ineffective. A target for the patient to reach with the help of medicines as the treatment for gout is called a treat-to-target approach. Usually the therapy involves urate lowering therapy (ULT) and NSAIDs or colchicine are used as a prophylactic and for pain at the start of ULT. Generally speaking, one medicine is not more effective than another for treating gout. It depends on which treatment is tolerated best, or most effective, or is not contravened by concurrent disease or conditions or more dangerous or harmful than it is worth in the individual. Some treatment options need to be referred to a specialist, including gout in young children. ===NSAIDs=== NSAIDs are the most common treatment for gout. No specific type of NSAID is significantly more or less effective than any other except aspirin, which is contravened. In low doses aspirin may cause gouthttps://www.jwatch.org/na33525/2014/02/06/cardioprotective-aspirin- associated-with-elevated-risk but it is sometimes used if the benefits (such as treating a heart condition) outweighs the risk as the initial treatment or in the elderly. Most people (60% in the UK) will respond to any NSAID, but each work differently and for the person some can work better or worse than others. Improvement may be seen within 4 hours. Treatment is recommended for 1–2 weeks. The starting dose is the maximum dose. NSAIDs are not recommended for people with some other health problems such as bleeding from the stomach, esophagus or intestines, renal failure, or heart failure. A proton pump inhibitor may be given to people at risk of experiencing gastric side effects and PPI inhibitors are usually given to people over 45 years of age because of this risk. While indomethacin has historically been the most commonly used NSAID, ibuprofen may be preferred due to its lack of side effects. Ibuprofen is often the preferred drug choice by patients too. The risks of using NSAIDs in the clinical management of gout are dose-dependant and start from the first dose. ===Colchicine=== Colchicine is an alternative treatment for people that are unable to tolerate NSAIDs. It is an effective alternative to NSAIDs but is slower to work.https://gpnotebook.com/en-GB/pages/general- information/treatment/treatment-of-acute-gout Its side effects, primarily gastrointestinal upset, limit its use.Gout~Medication at eMedicine The occurrence of gastrointestinal upset depends on the dose. The risk of experiencing this side effect can be reduced by using smaller, yet still effective doses. It is very important that the patient is instructed to stop taking colchicine right away if they get diarrhoea or GI upset. Colchicine may interact with other commonly prescribed drugs such as atorvastatin and erythromycin. It has an very narrow therapeutic index and is extremely toxic in overdose (people at an increased risk are those at either extreme of age range, renal or hepatic failure (kidneys and liver, respectively), and GI (gastrointestinal) or cardiac (heart) disease). It does not make the body retain (keep) water, unlike NSAIDs, and can be given to patients who are taking anticoagulant drugs. ===Steroids=== Corticosteroids (otherwise known as steroids) have been found to be as effective as NSAIDs for treating gout. Corticosteroids may be used if it is not possible to use NSAIDs or colchicine. Using them may also lead to improvement when it is injected into the joint. Treatment continues for 5-10 days. A joint infection must be excluded if the condition worsens. Corticosteroids may be used intramuscularly (IM) (injected into the muscle) or intra-articularly (IA) (into the joint). Colinchine, allopurinol, and febuxostat are not to be used as IM injections. IA injections should not injected into the same joint more than once in a 3-month period and no more than three injections should be given over the course of one year. Glucocorticoids (a subclass of corticosteroids) are an effective first-line treatment for the management of gout.https://gpnotebook.com/en- GB/pages/general-information/treatment/treatment-of-acute-gout This means it is a valid treatment option for the initial help offered. They can be oral (and usually are given as oral tablets) but also come in IM and IA use forms. Single injections of glucocorticoids have been shown to be highly effective and as useful as other treatment options. Methylprednisolonehttps://en.wikipedia.org/wiki/Methylprednisolone is a commonly used drug for this purpose. The most effective and safe dose is not yet understood well enough to be clear because there is not a lot of data. ===Pegloticase=== Pegloticase (Krystexxa) was approved in the USA to treat gout in 2010. It will be a treatment option for the 3% of people who are intolerant to other medications and have chronic gout. Pegloticase is administered as an intravenous infusion every two weeks like with glucocorticoids and has been found to reduce uric acid levels. ===Uricosuric agents=== Uricosuric drugs are preferred for treating gout if there is not enough uric acid in the urine. This is tested by finding how much the patient urinates within 24-hours, and checking urine for a specific concentration (less than 800 mg of uric acid per amount).Page 251 in: This test looks for a low amount of uric acid in the urine, with a high amount in the blood between attacks. If uric acid levels are high because of under-excretion, uricosuric agents help the kidneys excrete more liquid. An example uricosuric agent for patients that can not have allopurinol or febuxostat is benzbromarone, despite it no longer being commonly used in most countries due to concerns about hepatotoxicity. ===Prophylaxis (prevention) === A number of medications are useful for preventing further episodes of gout. Common examples are xanthine oxidase inhibitors (allopurinol and febuxostat), which inhibit the conversion of uric acid, and uricosuric drugs. Some commonly used uricosuric drugs are probenecid and sulfinpyrazone, which lower the amount of uric acid in the blood serum by increasing urine output. XOIs and uricosuric drugs are not usually given until one to two weeks after an acute attack has resolved due to concerns that it may worsen attack symptoms. If there is no time between attacks they may still be used. These medications are often used in combination with either an NSAID or colchicine for the first 3–6 months. This treatment is not recommended until a person has suffered two gout attacks, unless destructive joint changes, tophi, or urate nephropathy exist. This type of treatment is delayed until this point because it is not cost effective to offer this treatment sooner. Early treatment (during an attack) can make the problem worse. Urate lowering measures should be increased until serum uric acid levels are below 360 µmol/L (5.0-6.0 mg/dL), but there has been research into the benefit of the target with therapy to be 300 mmol/L (4 mg/dL) and a range of different numbers are used in the reading as a whole. This treatment will be continued forever. These medications should be continued even if the person experiences a gout attack while on the medication according to NICE. A 24-hour urine excretion of more than 800 mg indicates overproduction and xanthine oxidase inhibitor are the preferred drugs for providing treatment. Probenecid appears to be less effective than allopurinol. Xanthine oxidase inhibitors block uric acid production. Long term therapy is safe and well tolerated, and can be used in people with reduced renal function or urate stones. Allopurinol has caused hypersensitivity in a small number of individuals. In such cases, the alternative drug febuxostat has been recommended. ==Outcomes== Without treatment, an acute attack of gout will usually resolve in 4 to 7 days. 60% of people will have a second attack within one year and 80% within three years. Future attacks after untreated gout will be more severe and involve more joints if it goes on long enough to become chronic gout. These attacks will likely be with gout advancing to the next stage (stage 2 gout) from other disease causing or caused being caused by gout which is more harmful. Untreated gout in the past or a slow response to gout means that future attacks may have to be treated for longer, usually one or two weeks instead of days and the attacks can cause damage to joints. Those with gout are at increased risk of metabolic syndromes: hypertension, diabetes mellitus, and renal and cardiovascular disease and at increased risk of death. This may be partly due to its association with insulin resistance and obesity, but some of the increased risk appears to be simply due to having gout. This is primary gout, which is gout caused by things such as genetics and the body not processing uric acid for some other reason, making the levels of uric acid higher and putting someone at risk. When gout is caused by something specific, such as long-term kidney problems or taking certain medications for a long time, it is called secondary gout. Without treatment, acute gout attacks may develop into chronic gout with destruction of joint surfaces, joint deformity, and painless tophi. These tophi occur in 50% of those who are untreated for ten years, often in the outer part (helix) of the ear, over the outer part of the elbow, or on the Achilles tendons. With aggressive treatment they may dissolve. Kidney stones also frequently complicate gout, affecting between 10 and 40% of people. Kidney stones occur due to low urine pH promoting the crystallization of uric acid. Other forms of chronic renal dysfunction may occur. ==Epidemiology== Gout affects around 1–2% of the Western population at some point in their lives and it is becoming more common. Rates of gout have about doubled between 1990 and 2010. This rise is believed to be due to increasing life expectancy, changes in diet, and an increase in diseases associated with gout, such as metabolic syndrome and high blood pressure. A number of factors have been found to influence rates of gout, including age, race, and the season of the year. In men over the age of 30 and women over the age of 50, prevalence is 2%. Gout supposedly happens more often in spring (season) but the reason for this is currently unknown. In the United States, gout is twice as likely to occur in African American males as it is in European Americans. Rates are high among the peoples of the Pacific Islands and the Māori of New Zealand, but rare in Australian aborigines, despite a higher average concentration of serum uric acid in the aboriginal group. Gout has become common in China, Polynesia, and urban sub-Saharan Africa. The genetically at risk Chinese people are specifically the Han Chinese. Gout flare-ups have been attributed to seasonal changes in diet, alcohol consumption, physical activity, and temperature. ==History== The word gout was initially used by Randolphus of Bocking, around 1200 AD. It is derived from the Latin word gutta, meaning \"a drop\" (of liquid). According to the Oxford English Dictionary, this is derived from humorism and \"the notion of the 'dropping' of a morbid material from the blood in and around the joints\". People have been aware of gout since ancient times. Historically, it has been referred to as \"the king of diseases and the disease of kings\" or \"the disease of rich men\". The first documentation of the disease is from Egypt in 2,600 BC. In a description of arthritis of the largest toe. The Greekhy physician Hippocrates around 400 BC. Commented on it in his Aphorisms and noted its absence in eunuchs (men who have had their testicles removed at a young age) and women before menopause. Aulus Cornelius Celsus (30 AD.) described the linkage with alcohol, later onset in women, and associated kidney problems: > Again thick urine, the sediment from which is white, indicates that pain and > disease are to be apprehended in the region of joints or viscera... Joint > troubles in the hands and feet are very frequent and persistent, such as > occur in cases of podagra and cheiragra. These seldom attack eunuchs or boys > before coition with a woman, or women except those in whom the menses have > become suppressed... some have obtained lifelong security by refraining from > wine, mead and venery. In 1683, Thomas Sydenham, an English physician, described its occurrence in the early hours of the morning, and it is more frequent occurrence in older males: > Gouty patients are, generally, either old men, or men who have so worn > themselves out in youth as to have brought on a premature old age - of such > dissolute habits none being more common than the premature and excessive > indulgence in venery, and the like exhausting passions. The victim goes to > bed and sleeps in good health. About two o'clock in the morning he is > awakened by a severe pain in the great toe; more rarely in the heel, ankle > or instep. The pain is like that of a dislocation, and yet parts feel as if > cold water were poured over them. Then follows chills and shivers, and a > little fever... The night is passed in torture, sleeplessness, turning the > part affected, and perpetual change of posture; the tossing about of body > being as incessant as the pain of the tortured joint, and being worse as the > fit comes on. The Dutch scientist, Antonie van Leeuwenhoek, first described the microscopic appearance of urate crystals in 1679. In 1848, English physician Alfred Baring Garrod realized that this excess uric acid in the blood was the cause of gout. ==In other animals== Gout is rare in most other animals due to their ability to produce uricase, which breaks down uric acid. Humans and other great apes don't have this ability, which makes gout common. The Tyrannosaurus rex specimen known as \"Sue\", however, is believed to have suffered from gout. ==Research== A number of new medications are under study for treating gout, including anakinra, canakinumab, and rilonacept. A man made uricase enzyme (rasburicase) is also available, which aims to lower uric acid levels in blood by inhibiting its production. Its use is limited because it triggers an autoimmune response. Versions of this medication that are less prone to cause allergies are in development. == Related pages == * Kidney stones * Podagra (definition) * BUPA and GoutAlliance - Support groups for gout ==References== Category:Diseases and disorders of joints Category:Rheumatology",
 "title": "Gout"
}