{
 "id": "1180273",
 "text": "The Takhel Ngamba (literally, \"Success against Takhel\" or \"the conquest of Tripura\"Sarma, Ramanimohan. Political History of Tripura. India: Puthipatra, 1987. p.124Jhalajit Singh, R. K.. A Short History of Manipur. India: O.K. Store, 1965. p. 131 or \"Victor of Tripura\") is a Meitei language literary text that chronicles the historical conflict between the Meitei king Garib Niwaj, also known as Pamheiba, of the Manipur Kingdom, and the Tripuris (referred to as Tepperahs) of the Tripura Kingdom, as well as the Burmese forces. It is an epic composition from the medieval period, attributed to the prominent writer Nunggangbam Govindharam. The text documents the Meitei imperial conquest over the Tripuris and the Tripura Kingdom.A Glimpse of Manipuri Literary Works. N.p.: FSP Media Publications, 2018. p. 66-68Manihar Singh, Ch. A History of Manipuri Literature. India: Sahitya Akademi, 1996. It is written in the Meitei script. \"Takhel\" () is a Meitei language word for the land of Tripura and the Tripuri people, as known to the Meitei people (alias Manipuris).North-East India: Interpreting the Sources of Its History. India: Indian Council of Historical Research, 2008. p. 152 The Takhel Ngamba by Nunggangbam Govindaram presents a historical account of the Meitei king’s victory over the Takhels, the people of modern-day Tripura, providing detailed descriptions of the laws of chivalry observed by Meitei warriors. It outlines the ethical treatment of prisoners of war, defeated soldiers, and individuals seeking pardon or refuge, with a clear prohibition against their execution. The text also describes the customs and traditions associated with warfare, including the procedures followed by kings when preparing for battle and the formal receptions they received upon returning from victory. == Language == The language of the Takhel Ngamba () is characterized by grand, stylized diction, incorporating elements of non native language vocabularies. The language of Takhel Ngamba is characterized by a more modern diction, reflecting both its historical roots and its adaptation to contemporary linguistic standards. == Portrayal of the Meitei ruler == The narrative of the Takhel Ngamba portrays the king as a courageous and formidable figure, likened to the mythical predatory bird Garuda in Hindu tradition. The text emphasizes the king’s leadership and valor in the face of a dual-front assault. During a strategic retreat from the overwhelming Burmese offensive, the king performed a ritual obeisance to his traditional Meitei deity, Lainingthou Sanamahi (), and instructed his men to bring his four-year-old horse and finely crafted spear for personal combat. He subsequently led a symbolic war dance to inspire and rally his troops. == Burmese alliance for the Tripuris == The Burmese, resentful of their previous defeat by the Meiteis, sought an opportunity for revenge. They allied with the Takhels (Tripuris), who also harbored grievances against the Meeteis. These grievances stemmed from the Meeteis’ interception of a Takhel detachment collecting tributes from villages near Manipur, the seizure of the holy Srimad Bhagavat text from Takhel travelers, and the refusal to return a Brahman scholar, Swarupananda, and a Muslim Takhel emissary. The combined forces of the Burmese and Takhels invaded Manipur. While the Meeteis were still engaged in combat with the Burmese in the east, the Takhels advanced toward Kwakta in the southwest. The king of Manipur initially dispatched a contingent of troops under his trusted general, Akong Haomacha, to confront the Takhels. This force was subsequently reinforced by another under the leadership of the distinguished warrior Thangjaba Chakrapani. After securing victory over the Burmese, the king swiftly turned his attention to the southwest, continuing his campaign with renewed confidence and effectively defeating the Takhel forces. The king’s march to battle, accompanied by a strong army and the support of his people, is depicted with grandeur, reminiscent of the heroic battles. The narrative highlights the psychological impact of the king’s personal leadership on the Takhels. Faced with the king’s presence, the Takhels fled in panic. In the ensuing disorder, their garments became entangled in thorny bushes and low-hanging branches, creating a chaotic scene likened to a tree bursting into full bloom during spring. == An account of a Meitei soldier == A notable incident in the narrative involves a Meitei soldier who, after a daring raid, is unable to continue due to a severe leg ulcer. Facing imminent capture by the enemy, he requests his comrades to behead him and send his head to his wife. == Kindness of the Meitei king == The Meitei king of Manipur displays magnanimity when he complies with the request of a fleeing Burmese commander, who is the son of the Meitei king’s aunt. The commander requests large quantities of local fish, rice, spicy wine, and beer, which the king provides without hesitation. Additionally, when Meitei soldiers are on the verge of pursuing the defeated Tripuris, the king intervenes, urging mercy. He instructs his general to treat any wounded or hungry Tripuris seeking food and shelter with kindness. == Leadership of the Meitei king == The Meitei king’s leadership is also marked by strategic insight. He tests the loyalty and fighting spirit of his men by proposing an unconditional surrender to the Tripuris. This proposal is rejected, which inspires a vigorous response from his soldiers. Among them, Cheksa Chakrapani emerges as a distinguished warrior, repeatedly charging into enemy lines to rescue captured comrades and create disruption within the enemy ranks. == Metaphors == The writer portrays the king with nobility and valor. The conflict between the Tripuris and the Meeteis is described through vivid metaphors, likening it to the struggle between two large elephants in a banana grove or two hungry lions fighting over a piece of meat. The Tripuris’ relentless assault is compared to a wild boar struck by a spear, a school of fish swimming upstream in a narrow canal, or a strong current that cannot be restrained by a reed-made dam. == Related pages == * Ahom–Meitei relations * Burmese–Meitei relations ** Chahi Taret Khuntakpa * Meitei–Shan relations * Meitei people in Assam * Meitei people in Bangladesh * Meitei people in Myanmar * Meitei people in Tripura ** Meitei language in Tripura * Meitei martial arts * Meitei traditional weapons * Meitei traditional toys * Meitei traditional games == Bibliography == * == References == Category:Meitei literature Category:History of Manipur Category:Tripura Category:History of Myanmar Category:Middle Ages",
 "title": "Takhel Ngamba"
}