{
 "id": "1180238",
 "text": "Louis Kampf (May 12, 1929 – May 30, 2020) was an American literature professor and former president of the Modern Language Association.“Louis Kampf, Former President of the MLA, 1929–2020,” by Emily Tober, MLA Commons: News from the MLA, June 15, 2020. https://news.mla.hcommons.org/2020/06/15/louis-kampf- former-president-of-the-mla-1929-2020/ ==Early life and education== Louis Kampf was born on May 12, 1929 in Vienna. In 1938 he fled Nazi Germany with his parents, and, via Belgium, France, and Morocco, arrived in the United States in 1941. He attended George Washington High School in New York City, then Long Island University on a basketball scholarship, and then graduate school in comparative literature at the University of Iowa. From 1958 to 1961, he was a Junior Fellow at Harvard, the last year of which he spent at the American Academy in Rome.”Louis Kampf, professor emeritus of literature and women's and gender studies, dies at 91,” MIT News, August 14, 2020. https://news.mit.edu/2020/louis-kampf-mit-professor-emeritus-literature- womens-gender-studies-dies-0814 ==Career== Kampf taught in the Massachusetts institute of Technology Humanities Department from 1961 to 1995 and was Literature chair from 1967-1969. At the 1968 convention of the Modern Language Association in New York City, an uprising in protest of the Vietnam war led to his election as second vice-president and succession to the presidency of the organization in 1970.“An Invitation to the Archives,” by Brent Hayes Edwards, PMLA (Publications of the Modern Language Association), vol. 138, no. 1, January 2023, pp. 9-19. https://doi.org/10.1632/S0030812923000160 He was a founder of the MLA’s Radical Caucus, of the journal Radical Teacher, and of the New University Conference, an organization of left and feminist graduate students and faculty on more than 40 campuses. In 1967, he helped organize Resist, which began as a source of support for Vietnam war draft resistance and continues to this day to support and fund a wide rage of social justice causes. Throughout his life, he was active in struggles against war, imperialism, sexism, racism, and homophobia, as well as in support of Palestinian freedom. In his 34 years at MIT, Kampf helped found the new Women’s Studies program, team-taught “Intellectuals and Social Change” with Noam Chomsky, and created a variety of innovative courses. He served on the Reprints Committee of the Feminist Press and on the editorial board of Signs: A Journal of Women and Culture. Upon his retirement, the Louis Kampf Writing Prize in Women's and Gender Studies was established in his honor.“Junior wins Louis Kampf writing prize for her essay,” MIT News, June 5, 2002. https://news.mit.edu/2002/awdkampf-0605 ==Personal life and death== Kampf was married for a number of years to journalist and academic, Ellen Cantarow. He shared the last 30 years of his life with his partner, Jean Jackson, professor emerita of anthropology at MIT. Louis Kampf died on May 30, 2020, in Cambridge, Massachusetts ==Publications== *On Modernism; The Prospects for Literature and Freedom, MIT Press, 1967. *The Politics of Literature: Dissenting Essays on the Teaching of English, edited with Paul Lauter, Pantheon, 1972. ==References== Category:Pages created with the Article Wizard from 2025 Category:1929 births Category:2020 deaths Category:American academics",
 "title": "Louis Kampf"
}