{
 "id": "1180684",
 "text": "The Gezi Park protests were a series of protests that started in Istanbul, Turkey on 28 May 2013. Initially, climate activists protested against a project that aims to remove Taksim Gezi Park. The violent response of police forces caused thousands of citizens to join the activists. Social media was used to spread the news about the protests. Then it changed into country-wide large-scale protests.Acar Yasemin G., and Özden M. Uluğ. “Ten Years after the Gezi Park Protests: Looking Back on Their Legacy and Impact.” Social Movement Studies 24, no.1 (2023): 130–35. doi:10.1080/14742837.2023.2267996. == Background == Gezi Park is located next to Taksim Square in Istanbul. It was one of the last remaining public green spaces in the area. In 2013, Prime Minister Recep Tayyip Erdoğan's government announced an urbanization project which included removing Gezi Park to build an Ottoman-era military building and a shopping mall. This announcement was met with reaction from opposition groups. The reaction was not only against the renewal project but also the rising authoritarianism of the government. Amnesty International, Gezi Parkı Eylemleri: Türkiye’de Toplanma Özgürlüğü Hakkı Şiddet Kullanılarak Engelleniyor (Amnesty International Publications, 2013). 4-5. == Timeline of Events == Date What Happened 31 May * People start protesting in Gezi Park against the government’s plan to rebuild it. * Amnesty International says police use too much force. 2 June Prime Minister Erdogan calls the protesters \"looters\" and says social media is dangerous. 4–11 June Large-scale protests in Istanbul and other cities. June People in many cities around the world hold rallies to support the protests in Turkey (like in Athens, New York, London, Buenos Aires, Tokyo, and Beijing). 13 June Prime Minister Erdogan gives a \"final warning\" to end the protest in Gezi Park. 15 June * Police enter the park with water cannons and tear gas. * Gezi Park is cleared in 30 minutes. 17 June Trade unions start a general strike to protest the police actions. 18 June * A man stands silently in a public square—he is called the \"standing man\" (duran adam). * He becomes a symbol of peaceful protest and gets worldwide attention. 22 June Police stop big protests again using water cannons. 29 June Large protests begin again across the country. 8 July Police use tear gas and water cannons to clear protestors Gezi Park. == Outbreak == In May 2013, a group of climate activists started a peaceful protest in the park to protect the trees. However, the police forces used violence and acted in a way that ignored people’s rights. Therefore, protests grew larger and spread to the country with more people joining the protests. The Gezi Park protest campaign lasted 10 weeks with 2.5 to 3.5 million people participating in protests across 79 cities in Turkey. These developments affected the government, the public and the media differently. === Government Reactions === During the protests, the Turkish government, reacted with mix of denial. Rather than an expression of freedom, Recep Tayyip Erdogan reflected on these protests as a coup attempt driven by foreign powers and extremist groups and allowed heavy-handed police force. The government relied on oppressive policies that involve arresting individuals, crackdown and media restrictions. With the police forces that use tools such as water cannons, pepper spray and plastic bullets, many operations led to detention of a lot of people to control the crowd. Legal actions are taken by the government not only to the protestors, but also doctors, journalists, and even social media users, accusing some of attempting to overthrow the state. After many people arrested without a legal reason, rest of the people who were subjected to violence and harmed by the police violence did not report it. Because they afraid they would be blamed and taken to court. Erdogan sought to discredit the protesters by stating that he would gather more people than the protesters on June 1st and by calling them “çapulcu” (looter) on June 2nd. === Media and Social Media === Mainstream media initially did not show the protests. They feared government action against them. One channel, CNN-Türk, showed a penguin documentary instead of the news, getting people angry. The penguin became one of the symbols of the demonstrations. Censorship of the mainstream media forced people to mobilize using social media. Many people used social media platforms, such as Facebook and Twitter, to share news and organize protests. Twitter gained millions of new users in Turkey in the first week of the protests. The use of social media as an organizing tool became permanent in this time. In an interview, Recep Tayyip Erdoğan criticized social media, especially Twitter, saying it’s “evil” and full of misinformation. He blamed the users for “terrorizing the people”. == Demands and Participants == The protests began with environmentalist concerns. With time they grew into a broader movement including a wide range of political and social demands. Protesters demanded: * Preservation of Gezi Park * Punishment for those who are responsible for violence during the protests * An end to police brutality * Prohibition of using gas bombs and other similar tools * Release of the detained protestors * Greater freedom of speech and press The participants were diverse. They included Republican People’s Party supporters, anti- systemic radicals and supporters of the political parties below the electoral threshold (10% in 2014). == Significant Symbols and Events == ==== Kırmızılı Kadın – The Woman in Red ==== A protestor wearing a red dress and a white purse, Ceyda Sungur, became a symbol of Gezi Park Protests after a police officer pepper-sprayed her directly in her face. It is argued that the police officer, Fatih Zengin sprayed her unprovoked and from closer than 1-meter distance, disobeying the directive. ==== Duran Adam – The Standing Man ==== On June 17, 2013, a man named Erdem Gündüz stood still for hours facing Atatürk Kültür Merkezi (AKM) without saying anything. He was protesting silently, and many others joined him soon. They assumed that if they did not do anything, the police would not interfere with them. Gündüz stopped his protest to prevent violence after he saw that the police started preparations to intervene. ==== Death of Berkin Elvan ==== Berkin Elvan was a 14-year-old boy who was hit in the head by a tear gas canister while going to buy bread during the protests. He was in a coma for 269 days and died in March 2014, aging 15. His death caused new protests all over Turkey. It was argued by some that he participated in the protests and the incident happened at that time. Prime minister Erdoğan stated that the 14-year-old boy was a member of a terrorist organization. ==== Death of Ali Ismail Korkmaz ==== Ali İsmail Korkmaz was a 19-year-old university student. He was beaten by plainclothes police and civilians while running away from tear gas in the city of Eskişehir. He was taken to a hospital by his friends but was sent home by the doctors saying he was fine. His situation worsened at home and was taken to another hospital where it was found that he had a brain haemorrhage. He died after being in a coma for 38 days, on July 10, 2013. His death caused sadness and anger all over the country. ==== Hitting Pans and Pots (Cacerolazo): ==== Many people protested by banging pots and pans from their homes at 9 pm throughout Turkey. This was a way to protest without going outside. It became a loud and powerful sound across Turkish cities and neighbourhoods. Prime minister Erdoğan stated that hitting pans and pots was a crime and that perpetrators should be brought to justice. == Aftermath == The aftermath of the protests is complex. They did not achieve their most immediate goals, but they had a lasting impact on Turkish civil society and resistance movements. New identities, including being a “Gezici” or “çapulcu (looter/tug)” were created. Being a “Gezici” is still used by resistance groups today. They brought together different and normally distant political and social groups like LGBTI+ activists, Kurds, socialists, Kemalists and anti-capitalist Muslims. Some of these connections are broken, but some are still intact. Throughout the protests, some 4900 protestors were detained. According to Turkish Medical Association, 8038 people were injured. 8 civilians, including 14-year-old Berkin Elvan and 2 security officers died during and after the protests. Since the end of the protests, authoritarianism in Turkey increased in the form of controversial elections and restriction on academics, students and journalists. ==References==",
 "title": "Gezi Park protests"
}