{
 "id": "1180996",
 "text": "==War== ===Khuzestan=== When the Mongols attacked Ghazni, Jalaluddin Khwarazmshah fled to India, but when he realized that he could not hold on there, he went to Kirman and annexed many provinces of Iraq-ı Acem to himself. He came to Isfahan, which was in the hands of his brother, but he did not stay long and entered the Khuzestan region in January 1225. The Khuzestan region was under the rule of Caliph Nasir. When Jalaluddin Khwarazmshah came to the region, the attitude towards the caliph continued during his time, just as it had during the time of his father Alaeddin Muhammad. Caliph Nasir also continued his hostile attitude. He wanted to eliminate the Caliph of Baghdad, whom he saw as the sole reason for what had happened to his father and the disintegration of his state and falling into the hands of the Mongols. He would complete the Baghdad expedition that his father could not complete and kill the caliph.https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ===Tushter=== When Celaleddin besieged the city of Tustar in Khuzestan, the city was governed by the caliph's slave, Emir Muzeffereddin Sungur, nicknamed \"Vech es-Subu\". While Celaleddin besieged the city, on the other hand, he wrote a letter to Muazzam, one of the Ayyubid kings, offering to act together against the caliph. However, Muazzam did not accept this. The Khwarezmian soldiers began plundering activities in the surrounding area. Some Khwarezmian soldiers reached settlements such as Badra and Baksa, and reached the surroundings of Basra. In response, the Basra commander, Emir Biltekin, attacked them and clashes broke out. When Emir Biltegin attacked the Khwarezms and killed some of them, Sultan Celaleddin besieged Basra for two months, but could not capture it. The siege of Tustar continued in this way for two months. However, as Celâleddin could not receive the support he wanted from the Ayyubid ruler Muazzam and as the ruler of the city, Muzafferüddin Sungur, took excellent measures to protect the city, Celâleddin was forced to leave the region.https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ===Bakuba=== Continuing the sieges, Celaleddin pursued the defeated Baghdad army to Bakuba, which was seven leagues away from Baghdad, and took this city. Cemaleddin Kush Timur and his soldiers who defended this place could not stop him. Nasir Lidinillah, who received news that the Caliph's army was defeated in the village of Bakuba, began to fear that Celaleddin would take over Baghdad.https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ===Dakuk=== He moved to the village of Dakuk. The people of the city besieged by Jalaluddin Harezmshah climbed onto the walls and began to fight. During the fighting, the people chanted takbirs and swore and insulted Jalaluddin. Jalaluddin, who took the city by force of the sword, had the city plundered and many people were killed during the plunder (622/1225).https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ==References==",
 "title": "Khwarazmian-Abbasid Conflict (1225)"
}