{
 "id": "1180383",
 "text": "The 1119 papal election (from January 29 to February 2) was the smallest papal election by the Roman Catholic Church in the 12th century. Only 2 cardinal bishops, 4 cardinal priests, and 4 cardinal deacons voted in this election. The election was in the abbey of Cluny in Burgundy, France. Most of the other cardinals were in Italy. Guy de Bourgogne, the Archbishop of Vienne, was not a cardinal. However, he was elected as Pope Callixtus II. The cardinals that voted decided to get approval by the cardinals in Rome before Guy became pope. The cardinals in Rome said that Guy could become pope.Gregorovius, History of Rome in the Middle Ages IV, p. 391. Watterich II, pp. 122-124. Therefore, on February 9, Guy became pope inVienne. The pope would only reach Rome on 3 June 1120. ==Cardinal electors== About 10 cardinals voted in the election. However, historians are not entirely sure.S. Miranda Election of 1119; Stroll, 2004, p. 58-59 and 61-62. Elector Nationality Cardinalatial order and title Elevated Elevator Other ecclesiastical titles Notes Kuno von UrachHüls, pp. 113-116. Germany Cardinal-bishop of Palestrina c. 1107 Paschal II Papal legate in Germany and France Lamberto Scannabecchi, Can.Reg.At a session for signing bulls in 1119, reported by Hugh the Chanter, the pope signed with his own hand. \"Deinde Ostiensis episcopus subscribens sic ait, \"Spatium proxime [post] dominum papam ad scribendum domino Praenestino reservo, quoniam prior meus est.\" Cardinal Kuno had precedence over Cardinal Lamberto. James Raine (ed.) (1886), The Historians of the Church of York and Its Archbishops Volume II (London: Longman 1886), p. 182. Bologna (Fagnano) Cardinal-bishop of Ostia and Velletri 1105G. Trombelli, Memorie istoriche cocern. le due canoniche di S. Maria di Reno e di S. Salvatore (Bologna 1752), p. 207. Paschal II Future Pope Honorius II (1124–1130) Giovanni da CremaHüls, pp. 176-178. Crema Cardinal-priest of S. Crisogono 1116 Paschal II Papal legate in Milan (1116) Guido, O.S.B.Hüls, p. 153. Guido died on 7 January 1119, or 1120. If in 1119, he did not participate in the election of Calixtus II. Italy Cardinal-priest of S. Balbina 1116 Paschal II BosoHüls, pp. 146-149. Boso was a cardinal- deacon before 1113; cardinal-priest by 16 October 1113. Italy Cardinal-priest of S. Anastasia 1113 Paschal II Corrado da SuburraHüls, pp. 201-202. Rome Cardinal-priest of S. Pudenziana c. 1111-1114 Paschal II Future Pope Anastasius IV (1153–1154) Gregorio Papareschi, Can.Reg.Lat.Hüls, pp. 223-225. Rome Cardinal-deacon of S. Angelo in Pescheria 1116 Paschal II Archdeacon of the Holy Roman Church Future Pope Innocent II (1130–1143) Pietro PierleoniHüls, p. 225. He was promoted cardinal-priest of Santa Maria in Trastevere on 12 June 1120. Rome Cardinal-deacon of Ss. Cosma e Damiano Paschal II Future Antipope Anacletus II (1130–1138) CrisogonoHüls, p. 240. There is no evidence of him after 26 June 1122. Pisa Cardinal-deacon of S. Nicola in Carcere 1117 Paschal II Bibliothecarius of the Holy Roman ChurchU. Robert, Bullaire, pp. x-xi. Roscemanno, O.S.B.Cas.Hüls, pp. 227-228. Marsica Cardinal-deacon of S. Giorgio in Velabro c. 1112 ? Paschal II Of the Counts of Marsi ==Notes== ==Sources== * * Gregorovius, Ferdinand (1896). History of Rome in the Middle Ages. Volume IV. part 2, second edition, revised (London: George Bell, 1896). * Hüls, Rudolf (1977). Kardinal, Klerus und Kirchen Roms: 1049–1130, Tübingen: Max Niemeyer 1977. * * * *Stroll, Mary. 2004. Calixtus II (1119-1124): A Pope Born to Rule. BRILL. . * == References == *John Paul Adams (2010, revised 2016), \"Sede Vacante 1119 (January 29 — February 2, 1119).\" Conclave. California State University Northridge. Retrieved: 12 August 2021. *John Paul Adams, \"List of Documents concerning the Papal Election of 1119.\" Conclave. California State University Northridge. Retrieved: 12 August 2021. Category:1119 Category:1110s in France Category:Papal conclaves",
 "title": "1119 papal election"
}