{
 "id": "1180482",
 "text": "The Soviet deportation of Poles during World War II refers to the mass deportation of around 1,200,000 Poles from Soviet-occupied eastern Poland to mainland Russia between February 10, 1940 and June 1941. * * * * ==Overview== The deportation happened while Polish and Jewish property across the occupied zone was taken over by the Soviets. Represje 1939-41 Aresztowani na Kresach Wschodnich (Repressions 1939–41. Arrested on the Eastern Borderlands.) Ośrodek Karta. Retrieved 15 November 2006. Polish Jews made up 30% of the Poles deported to Siberia,Jan Tomasz Gross, Revolution from Abroad (Princeton: Princeton University Press, 2003), pp. 196–98. making them statistically the most targeted group among the deportees. ==Events== ===Deportations=== The Soviets conducted the deportation in four waves.* * * Foreword by Dr. Tomasz Piesakowski 1998 reprint with excerpts by Waldemar Wajszczuk. Book review with excerpts by Derek Crowe. * The first wave of deportation in February 1940 saw 220,000 Poles sent to northern European Russia. The second wave of deportation in April 1940 saw as many as 330,000 Poles sent to Soviet-occupied Kazakhstan. The third and fourth wave saw as many as 400,000 and 200,000 Poles sent to forced settlements across the Soviet Union respectively. ===Forced conscription=== As many as 210,000 young Polish men were forced to fight for the Soviet Union following the annexation of the Kresy macroregion. ==Academic views== Some historians saw the Soviet deportation of Poles as the worst part of the Soviet persecution of Poles during World War II, followed by the Katyn massacre in which around 22,000 Poles were mass-murdered by the Soviets. * * * * * * Some historians saw it as a genocide as well, despite not comparable to the Holocaust. ==Related pages== * Double genocide theory * NKVD prisoner massacres * Genocides by the Soviet Union ==Footnotes== ==References== Category:Racism Category:Genocide Category:Communism Category:Deportations Category:History of Poland Category:Soviet crimes against humanity",
 "title": "Soviet deportation of Poles during World War II"
}