{
 "id": "1181190",
 "text": "The Meitei people (), also referred to as Manipuris (), form a small but distinct diaspora community in Canada. Originating primarily from the Indian state of Manipur and from regions of Bangladesh with Meitei populations, their migration to Canada has taken place in gradual phases over recent decades. Members of this community have settled in various parts of the country, significantly in Montreal of Quebec and Toronto of Ontario, contributing to Canada’s demographic diversity while maintaining elements of their linguistic, cultural, and religious heritage. The Meitei diaspora in Canada includes both first-generation immigrants and Canadian-born individuals of Meitei descent. == Migration == Most Meitei people in Canada come from Manipur and Bangladesh. Some students who come to Canada for their studies have said that some immigration consultants are asking for too much money while claiming to help them with studying or moving to Canada for work. == Cinema == The 5th edition of the Ottawa Festival 2022 featured the Meitei-language film \"Nine Hills One Valley\" () in its competition section, along with 11 other films in Canada. The Meitei-language film \"Boong\" () was shown at the International South Asian Film Festival Canada (iSAFF), the Toronto International Film Festival (TIFF). == Cuisines == Meitei people in Canada enjoy traditional Meitei dishes like eromba () and special fish curries. These are notably seen during festive occasions like that of the Ningol Chakouba celebrations in the city of Montreal. == Dance and music == Meitei people in Canada take part in cultural performances like Pung Cholom dance (with notable artist Shanti Pebam), popular Manipuri songs, Western instrumental music, piano, and Thabal dance. Meitei women in Canada also occasionally perform Leima Jagoi, a traditional Manipuri dance. A notable highlight is the Thabal Chongba performance, often held on the grass lawn, bringing a festive and traditional vibe to the celebration. == Education == Some associations and organizations like Manipuri Association of Canada (MAC) support students who want to immigrate to Canada, helping them avoid using outside agencies and saving them from spending large amounts of money. The MAC Academic Award is given to Canadian Manipuri students—there's a competition for Grade 10 students and appreciation awards for students of all grades. They not only help students in Canada but also supports students in Manipur and Bangladesh. == Festivals == The Meitei people in Ontario, Canada, observes Ningol Chakkouba (), one of the largest events for their community in Canada. This annual celebration is marked by participation from diverse families across the country. The event includes traditional cuisine, cultural performances, fun activities such as Tambola (Housie) and Karaoke, as well as the display of traditional attire. It serves as a significant cultural gathering for the Meitei people in Canada. The Ningol Chakouba festival in Montreal, Canada, is celebrated with the intention of reinforcing the bonds of love, care, and encouragement between brothers (Pibas) and sisters (Ningols). The event offers an opportunity for Meitei individuals in Montreal to meet and reconnect, promoting a sense of community. The festival was held at an Indian restaurant near Plamondon metro station, serving as a gathering for Meitei people in the city. The commemoration of Nupi Lan () was observed for the first time in Montreal, Canada, on 25th December 2013. Nupi Lan refers to two historical events in which Meitei women organized protests against the British Empire's forces in response to the unjust treatment of Meitei men and the mismanagement of agricultural crops in the Kingdom of Manipur. == Literature == On 4 September 2012, two Meitei- language literary works were released in Montreal, Canada. The first book, titled \"Circus\" (), was authored by Shonney (also known as Thokchom Manihar). The second publication, \"Bangladesh Ki Akhannaba Manipuri Sheireng\" (), was written by Hamom Promud. The event marked a contribution to the promotion of Meitei literature within the diaspora community. == Media == CFMT-TV, Canada's first free over-the-air multilingual and multicultural television broadcaster, includes a half-hour interactive program titled Ishtyle TV. As part of its \"Websites of the Week\" segment, the program featured www.e-pao.net, an online platform focused on Manipuri-related content. The segment was broadcast on 6 April 2002 at 12:30 PM EST, with a repeat telecast on 9 April 2002 at 9:00 AM EST. The broadcast was available on channel 47 in Toronto, Ontario, Canada. The online platform of Manipuri Mirror operates from 2227 Rue Dollard, Longueuil, Quebec J4K 4P1, Canada. It is intended for members of the Meitei community originating from India and Bangladesh who are residing in Canada. == International services == On 27 November 2011, the Manipuri Association of Canada (MAC) issued a formal appeal to the Government of India for the permanent removal of the Protected Area Permit (PAP) requirement for foreign nationals entering the state of Manipur. This request was made in response to the temporary suspension of the PAP regulation implemented a year earlier, which had received positive reception from various stakeholders. On 16 December 2012, the Manipuri Association of Canada (MAC) submitted a formal letter to the Union Home Minister of India, reiterating its request for the permanent removal of the Protected Area Permit (PAP) requirement for foreign nationals entering Manipur. === Remittances === In January 2024, the Manipuri Association of Canada initiated a fundraising campaign in Canada, raising 60,000 INR to assist victims of ethnic violence in Manipur, India. == Religion == Canadian Meitei people practice Sanamahism and Hinduism. On 4 February 2013, the commemoration of Puya Meithaba () was observed in Montreal, Canada. Puya Meithaba refers to a historical event in medieval Manipur when the sacred scriptures of Sanamahism (), the traditional Meitei religion, were collected and burned by a Meitei ruler who had recently embraced Hinduism. == Sports == At the 13th World Police and Fire Services Games held in British Columbia, Canada, Manipuri sportsperson L. Sarita Devi won a gold medal in the boxing event, representing India. == Associations and organizations == The Manipuri Association of Canada (MAC) is a key organization representing the Meitei community in Canada, focusing on the welfare and support of its members through various initiatives. == Related pages == * Meitei people in Bangladesh * Meitei people in Myanmar * Meitei people in Assam * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura * South Asian Canadians * Indian Canadians * Bangladeshi Canadians == References == Category:Meitei people Category:Canada Category:Indian people Category:Migration",
 "title": "Meitei people in Canada"
}