{
 "id": "1181134",
 "text": "International Manipuri Short Story Festival (IMSSF) was a 2022 literary event jointly organized by the Bangladesh Manipuri Sahitya Sangsad of Sylhet, Bangladesh, and the Manipuri Short Story Society of India. This three-day festival was dedicated to the promotion and celebration of short stories written in the Meitei language, also known as Manipuri, a language spoken in the northeastern Indian states of Manipur, Assam, and among Meitei diaspora communities in Bangladesh. == Venue and inauguration == The festival commenced at the Zilla Parishad Conference Hall in Sylhet, Bangladesh. The inauguration ceremony was graced by Dr. Muhammad Mosharrof Hossain, Sylhet Divisional Commissioner, who served as the chief guest. The event brought together prominent writers, literary scholars, and cultural figures from both Bangladesh and India. == Awards and recognition == Two major awards were presented during the festival: * Sinam Tanubabu Memorial International Award 2022: This was conferred on Mutum Ramani Devi, a writer from Imphal, Manipur, for her acclaimed collection of Meitei short stories titled \"Fongngamdraba Cheinakhol\" (). * Lifetime Achievement Award (Ajkumar Sitaljit Memorial Award): This prestigious honor, given by the Manipuri Short Story Society of India, was awarded to AK Seram, a prominent literary figure based in Sylhet, Bangladesh, for his lifelong contributions to Meitei literature. == Book Releases == As part of the festival, several literary works in the Meitei language were unveiled: * Panthung Tamna () – a new collection of Meitei short stories. * Two additional short story collections authored by Lairenlakpam Ngouba and Usharani Devi were also released during the event. * In a speech delivered during the occasion, AK Seram, president of the Bangladesh Manipuri Sahitya Sangsad (Sylhet), noted that only two Meitei language short story collections had been published in Bangladesh in that calendar year, underscoring the need for further literary development in the language. == Symposium and participation == The first day of the festival featured a literary symposium, during which 26 writers from India (primarily from Manipur and Assam) and Bangladesh presented and read their short stories. The sessions highlighted the richness of the Meitei literary tradition and fostered cross- border cultural exchange between writers of shared linguistic and cultural heritage. Nahakpam Arun was a moderator of the symposium on the topic \"Manipuri wari macha gi khongchat amasung thak Bangladesh/Assam/Manipur\" (). == Cultural and linguistic significance == The festival held particular significance for the Meitei people (also called Manipuris), an ethnic minority group in Bangladesh with ancestral roots in India. Events like the International Manipuri Short Story Festival not only serve to promote literary expression but also help preserve the Meitei language and culture within the diaspora. This event marked a milestone in the collaborative efforts between India and Bangladesh to preserve and promote Meitei literature, fostering deeper cultural ties and creating a platform for emerging and established voices in Meitei storytelling. == Related pages == * Meitei language in Bangladesh * Meitei clothing in Bangladesh * Meitei monuments in Bangladesh * Meitei language festival * Meitei language day == References == Category:Meitei culture Category:Indian culture Category:Bangladeshi culture Category:Short stories Category:Meitei literature Category:Meitei festivals Category:Manipur Category:Assam",
 "title": "International Manipuri Short Story Festival"
}