{
 "id": "1181159",
 "text": "Nokomis Library is a library built for the Nokomis East area of Minneapolis, Minnesota. The library was opened in 1968, as a replacement for the nearby Longfellow Community Library. The library was too popular for its size in 1999, the library got a renovation from 2009 to 2011. The library contains 37 computers, a public meeting room, and a Spanish-language collection of materials. == History == At the time it was built, Nokomis was the first library added to the Minneapolis Public Library system in over 35 years; the previous library was the Linden Hills Community Library, which was completed in 1931. It was built to replace the Longfellow Community Library. The library was designed after a tepee from the poem The Song of Hiawatha. Additionally, the library was named after Nokomis in the poem, the breanch is the only library to be named after a fictional character. The library has a meeting room and a relaxing area. The library was used with the same limestone as the Stone Arch Bridge. The library opened in September 1968 and had twice the users as the old Longfellow branch. In 2004, Minneapolis Public Library had budget cuts making the library loose its opening on Saturday. The local community helped fund the library to keep it opened on Saturday. In mid-2005, funds were brought back to keeping the library opened. == Renovation == In 2007, a $7 million was given to improve Nokomis Library and Northeast Community Library. The old building was closed after September 12, 2009, and was expected to reopen sometime in the fall of the next year. During the construction, people could use nearby libraries including East Lake, Roosevelt, Washburn, and Southdale. The library was expanded by to a total size of . A new system that automatically adjusts the lighting based on the amount of brightness entering the library. The carpets were made from recycled fibers. A water system and plants were put on the outside of the building. The library used the same materials for the stone making the difference between the old and new walls nearly the same. The children and teen sections were expanded and themed. New books, DVDs, and CDs were purchased to update the library. The library reopened on April 30, 2011, after being closed for 19 months. == Wind and Water Chime == Nokomis has an art piece called Wind and Water Chime which hangs above a fountain. Wind and Water Chime has of 4,000 pieces. It was designed after Minnehaha Falls, which was also in the The Song of Hiawatha.\"Nokomis\". After the renovation of the library, $52,000 were spent to clean the wind and water chime to return it to its original appearance. It now hangs near the entrance on the library's west side in an adult reading area. == Services == The library is open from Monday to Saturday. The library has 37 computers, 24 were added in the expansion, and the library has a free Wi-Fi network. The building has a public meeting room that can fit 36 people. A local teen gaming group meets weekly in Nokomis's meeting room. The library has a parking lot. In 2008, 53% of library users were adults and 47% were children, 240,334 items were checked out from the library. The locals help keep the library running. == References == * * Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Infobox mapframe without OSM relation ID on Wikidata Category:1968 establishments in the United States Category:Minneapolis Category:Libraries in Hennepin County Library Category:Minnesota Category:Education in the United States",
 "title": "Nokomis Library"
}