{
 "id": "1181570",
 "text": "Xolane Ndhlova, is a billionaire from South Africa business executive, and a philanthropist. He is the founder and chairman of DafriBank Digital Ltd. a company that operates in the banking sector. Xolane is recognised in the fintech and cryptocurrency sectors. His business activities have been reported in the media for their effects on finance in Africa. He founded several charitable organisations that focus on education, health, and poverty alleviation. Through his philanthropy, he aims to improve the lives of many South Africans, especially in community development and humanitarian aid. Xolane's work has earned him recognition both in South Africa and internationally. He is often invited to speak at conferences and events, where he shares his experiences and encourages others to contribute to social causes. == Education == Xolane was born to a Nigerian father and a South African mother. He spent his childhood in several countries in Sub-Saharan Africa before moving to South Africa in 2001. Xolane improved his education by returning to school. He earned a diploma in Media Management, a bachelor's degree in Economics, and a Master of Business Administration (BA) from the Georgia Institute of Technology. == Career == In his early career, Xolane was involved in gang activity, which led to his arrest and conviction for attempted murder and possession of a semi-automatic weapon. He was sentenced to prison for these crimes. While he was in prison, Xolane began to focus on his future and started to invest in start-up technology companies. This decision marked a turning point in his life and set the stage for his later success in the business world. After his release from prison, Xolane founded DafriBank Digital Ltd. This company aims to improve financial access for people across Africa, making it easier for them to use banking services. In addition to his work with DafriBank, Xolane is an investor in the cryptocurrency exchange Binance, which allows users to trade digital currencies, he has achieved significant recognition in the world of cryptocurrency by making it onto the global Top 50 Crypto Rich List, where he was ranked 40th. He also owns a stake in Royal IVY, a luxury brand based in South Africa, which focuses on high-quality fashion and lifestyle products. During the COVID-19 Xolane donated R500,000 to South Africa's Solidarity Funds to help with COVID-19 relief. He also gave $1 million to support victims of the war in Ukraine. == Philanthropy == Xolane Founded Ziggy's Foundation with the aim of promoting education and reducing poverty in Africa. The foundation works on various projects that help improve access to education for children and young adults. In addition to this, he created the UMEH Group Education Fund, which provides financial support to students in South Africa, Nigeria, and Namibia. This fund helps cover costs such as tuition, books, and other educational expenses, making it easier for students to pursue their studies and achieve their goals. Through these incitive, Ndhlovu hopes to make a positive impact on the lives of many individuals and communities in Africa. == References == Category:Living people Category:1985 births Category:Business people Category:Philanthropists Category:South African people",
 "title": "Xolane Ndhlovu"
}