{
 "id": "1181048",
 "text": "Sarsa Cave is known both culturally and archaeologically, as well as for its significant landscape. This site was formed over millions of years by the erosion of the land. A curious fact is the large number of stalactites and stalagmites found in this area, due to the contact of water with the limestone rock. La Sarsa is a very large cave, composed of many chambers and a labyrinthine path. These ancient inhabitants resided mainly in the first chamber, which is where the most archaeological remains and finds have been found. However, this was not the most important aspect of this site. In La Sarsa Cave, several indications have been found that humans have lived there, not only from one era but from several, making this site of great interest to archaeologists and adding importance to the area. It could be said that this cave was used for specific funerary purposes. This cave has yielded many materials dating back to the Neolithic period, but also many from the Bronze Age, even from the Iberian and Islamic worlds. It is also particularly noteworthy for its pottery finds, as completely different ceramics are found alongside other, indicating some connection between the two types of pottery. They most likely belonged to different cultures and different times, but they did come together. This cave is located far from urban development, in the center of the natural landscapes of this town. == Discovery == This cave was discovered before, but archaeological excavation began in the mid-20th century. The first discovery at this site was made in 1913 by archaeologist Henri Breuil. This discovery was followed by Fernando Ponsell in 1928, and remains are housed in the Museum of Prehistory in Valencia. == Location and geological environment == The Sarsa Cave is located in the municipality of Bocairente, Valencia, within the Valencian Community, in the Vall de Albaida region. The cave is located on the northeast slope of the Sierra de Mariola mountain range. The cave has several labyrinthine rooms. The main room was the vestibule, which was the preferred habitat, as it was the area with the most natural light and the least humidity. It is believed that these groups were small in number during the Neolithic. Most of the cave's artifacts have been found in the vestibule, including flint, bone, and even shell tools used as ornaments, as well as many pottery decorated with various techniques. == Chronology == This site has been dated primarily using two methods: radiocarbon dating and ceramic analysis. As Martí Oliver argues, La Sarsa is a site included in the Early Valencian Neolithic, being very similar to sites such as Cova de l'Or. The same study also states that the Cardial occupation of the Sarsa Cave is between 5,500-5,000 BP (~4,400-3700 BC). According to the Carbon 14 dating made by Bernabeu Aubán, two levels of the site belong to the Neolithic. Level III, which belongs to the Cardial Neolithic, was occupied between 5,490 ± 60 BP (~4,350-4,250 BC), and Level II belongs to the Postcardial Neolithic 5,050 ± 50 BP (~3,950-3,700 BC). The main finds at the site are varied. First, according to Bernabeu Aubán's study, fragments of Cardial pottery dated to 5,500-5,000 BC were found. Shell and stone necklace beads were also found that are believed to be contemporary with the Cardial pottery. Flint blades and retouched plates dated to around 5,500 BC were also found. Another discovery is botanical remains, specifically remains of wheat and barley dated to 5620-5480 cal BC. == Paleoecology == In 1981, excavations were carried out to analyze the fauna, cereals, and pollen at the La Sarsa site. The pollen analysis was carried out by P. Molero and he determined that there was enough pollen to obtain samples but there was no trace of pollen in the second and fifth strata. The analysis of cereals was carried out by P. López and he determined that the pollen in the trees averaged 20%, herbaceous species made up less than 10% of the landscape, and finally, the cereals showed deforestation by Homo sapiens in order to obtain space for cultivation. As a result, it was determined that the fields accounted for a ratio of one km. After all this, it was found that the landscape during recent prehistory would have been a mixed forest with Mediterranean trees. These results have been obtained through the cold CIH methods, hot 20% NaOH and cold 10% KOH and with dense liquor concentration. Thanks to radiocarbon dating on a sample of bones extracted from this site, it has been determined that there were several phases of occupation, but it was in the Cardial Neolithic when this occupation was most intensive. This is because most of the pottery found belongs to this period and it is believed that around 5000-4900 cal BC it would stop being occupied more extensively, later becoming a burial site. 5475 cal BC is proposed as the date where signs of human activity begin to be seen. In this chronology, two ceramic traditions are differentiated: on the one hand, archaic or impressed pottery (5500-5450 cal BC) and the classic Cardial tradition dated between the years 5500-5475 cal BC. == Burials == In order to confirm the presence of inhumations in Cardial contexts in the Valencian Country, various AMS datings have been performed on human bones found in Neolithic contexts. The results confirm that the inhumation ritual was practiced at Cova de la Sarsa during the Early Neolithic, although they also demonstrate its use as a funerary space at later times. The human remains in the cave are associated with specific funerary use. Comparison of the data obtained with Valencian and peninsular records provides a heterogeneous picture of the Cardial funerary ritual. This ritual is associated with groups made up of a small number of members, organized into different communities. Pottery with Cardial decoration has been found at this site, along with other material remains characteristic of the Neolithization process. F. Ponsell attests to the presence of Neolithic human remains at this site. These human remains corroborate that the beginning of funerary practices in caves is linked to the Cardial Ceramic Neolithic, which is very characteristic of the Valencian Eneolithic. Of these human remains, the majority were adults or very old adults. Sex has been difficult to determine since only fragments of the pelvis have been found, and this classification is most evident in this area. In addition, the remains of a child have been found with a trepanation in a parietal area, which could shed more light on the symbolic world of Homo sapiens, although its significance is still unknown. The human remains from Cova de la Sarsa suggest the use of these caves as a necropolis during the Early Neolithic, although it is also believed that Cova de l'Or could have been used as a necropolis. Multiple burials occurred during this period. There is a relationship between the double burials and the ceramic vessel with impressed decoration. The deposition of the individuals reveals the existence of a ritual for the transition between life and death in the Valencian Cardial Neolithic. This is related to the expression of a supernatural religious entity, evidenced through the decoration of ceramics and rock art. The individual is accompanied by grave goods in the same space, which is sealed by a small stone wall. During excavations, two humans have been found buried together, and it is believed that if they were not buried at the same time, they were probably buried within a short period of time. AMS dating on two bovid bones recovered from the cave has determined the dates of OxA-V-2360-25 6399±33 BP (5470-5310 Cal BC 2 σ) and OxA-V-2360-22 6389±33 BP (5470-5310 Cal BC 2 σ) and thus allows us to state that it had been inhabited at times prior to the date of the human vertebra fragment. This suggests the coexistence of the burial rite with the habitual use of the cave as a permanent or seasonal habitat. This question is interesting when defining the different functions of the cave, which are not incompatible with each other: whether we are dealing with a continuously occupied habitat site, a seasonally occupied habitat site, or whether the site serves as a necropolis. It is also suggested that the period of occupation by these human groups was consciously used within the context of the symbolic world or as a place for the redistribution of materials used in possible ceremonies. In Valencia, no specific characteristics of Cardial pottery have been determined, although it is closely linked to the funerary world. == Cardial ceramics == A large number of fragments of cardial vessels are found in La Sarsa, with varied and rich ornamentation achieved by human groups of recent prehistory with such a modest tool as the valve of a cardium, which they used to adorn the walls of the vessel, in soft form, through various combinations of impressions produced, either with a wavy edge or with the underside or with the natis of such a shell. These ceramics are accompanied by others with incised decoration or cords with digital impressions and some smooth ones, in addition to awls, spatulas, and also human remains that point to its probable nature as a burial cave. Thus, it represents an Eneolithic cultural modality that seems to have developed throughout the eastern part of the Iberian Peninsula and is well deserving of exhaustive study. This ceramic type acquired increasing prominence until it became the exponent of the Neolithic period throughout a wide territory. L. Bernabò Brea points out that in Spain, the Early Neolithic with impressed pottery corresponds to the cultural phase called Hispano- Mauritanian by San Valero, who has demonstrated its coastal distribution and limited penetration into the Meseta, and whose most characteristic expression is ceramics. The chronology of the Cardial pottery at this site is very similar to the dates obtained at Cova de l'Or. As mentioned in the section on inhumations, since the funerary world and Cardial pottery are closely linked, radiocarbon dating has allowed this pottery to be dated to the Valencian Cardial Neolithic around 5460 and 5330 cal BC and extending to ca. 5250 cal BC. Cardial pottery was also part of the grave goods. Various forms of decoration can be seen on Cardial pottery vessels, including simple elements such as short straight lines, long straight lines, and curved straight lines, as well as more complex elements such as triangles, circles, and zigzags. == Lithic Industry == After the 1928 campaign, Cardial ceramics, awls, bone spatulas, pierced shells used as ornaments, and polished stone were found. Tools made of flint, shells, stones, and retouched bone material have been found. The pottery has been drawn almost completely, with the exception of highly fragmented pieces in which neither the decoration, nor the thickness or surface of this vessel can be distinguished. Regarding the flint, these are divided into two groups: retouched, as is the case with the laminar set and the scraped set; and the second group consists of core remains and carving remains. Overall, the flint industry is composed of scrapers, burins, perforators, geometric tools, etc. The laminar set has been analyzed for the condition of the pieces, the presence or absence of cortex and working, the type of retouching, and the method of retouching. As for stone tools, it should be noted that there are planers, adzes, hammers... there is an absence of \"axes\", mortars and hand mills in this group. Ornaments are divided into seven sections: perforated shells (the valves of lamellibranchs, examples of which are cardium, pecten, pectunculus... and gastropod shells, which are columbella, cyprea, conus... these perforated shells have suffered abrasion and/or intentional perforation on the surface. Five types of necklaces are distinguished. Type I is an elliptical pendant made on a more or less modified tooth, in type Ia which produces a slightly strangled profile, and with perforation either in the center and type Ib either in the depression of the strangulation. Type II is a pendant, also elliptical, on bone or shell, flat or with slightly convex faces and a central perforation. Type III has a rectangular or elliptical silhouette, flat faces and a large central perforation, and is generally made of bone. Type IV includes fusiform or conical objects. This type is subdivided into two: on the one hand the Type IVa or cylindrical and Type IVb, with perforation at one end and, finally, Type V, corresponds to teeth - not modified in their original form, so that it is recognizable with perforation at one end, which may well be the opposite to the root or in it. Necklace Beads are generally small pieces with a centered perforation, intended to be strung in series. The condition and shape of Perforation 5 (truncated cone, bitruncone, cylindrical) and the morphological types of beads have been analyzed: discoidal, hemispherical, cylindrical, and elliptical. We also mention the material used in their manufacture. Lunulae, for their part, are objects shaped like a circular segment with one concave side and one convex side, normally made of bone or shell, although other materials are sometimes used. In this section, the condition and raw material are examined. Rings are hollow cylindrical portions, usually made of bone; there are also some made of shell, although not yet among these materials. They have a smooth or decorated surface, variable width and thickness, and a lenticular, trapezoidal, elliptical, or rectangular section. We consider wide those over 15 mm, medium those between 15 and 10 mm, and narrow those less than 5 mm. ==References== == Bibliografía == Bernabeu Aubán, J. (s.f.). La Cova de la Sarsa: ocupaciones neolíticas en el Valle de Agres. Manuscrito no publicado. Servicio de Investigación Prehistórica, Valencia. Martí Oliver, B. (1977). La Cova de la Sarsa y el Neolítico de la región valenciana (Trabajos Varios del SIP, No. 53). Servicio de Investigación Prehistórica, Diputación de Valencia. Fortea Pérez, F. J. (1973). Los complejos microlaminares y geométricos del Epipaleolítico mediterráneo español. Universidad de Salamanca. López García, P. (1980). Análisis paleocarpológico de la Cova de la Sarsa. Servicio de Investigación Prehistórica, Diputación de Valencia. Category:Caves of Asia",
 "title": "Cave Of Sarsa"
}