{
 "id": "1181284",
 "text": "Australian Crawl (often called Aussie Crawl or The Crawl by fans) were an Australian rock band. They were founded by James Reyne (lead vocals/piano/harmonica), Brad Robinson (rhythm guitar), Paul Williams (bass), Simon Binks (lead guitar) and David Reyne (drums). The band was founded in Melbourne in 1978. David Reyne soon left. He was replaced by Bill McDonough (drums, percussion). Later, Bill's brother, Guy McDonough joined the band as vocals and rhythm guitar. The band was named after the front crawl swimming style. This swimming style is also called the Australian crawl. Australian Crawl made surf music. They sponsored a surfing competition in 1984. Their band also talked about social issues, like materialism, alcoholism, car accidents, and romance. Their first album was released in 1980. This album was called The Boys Light Up. The song was No. 4 in music popularity. After this album, they had two more No. 1 albums. These albums were Sirocco in 1981 and Sons of Beaches in 1982. Their early singles reached the top 25 but none were in the Top Ten. They would soon have high-performing singles, however. They made the song \"Reckless\", which became a No. 1 hit. It came from their 1983 Semantics EP. The band was not very steady after 1983. In 1983, Bill McDonough the band. His brother, Guy McDonough, died in 1984. In 1985, Paul Williams left the band. Their made a song Between a Rock and a Hard Place in 1985. This song was very expensive to make. It cost $400,000 AUD. Sales for this song were disappointing. The band disbanded in 1986. In 1996, the band was put into the 1996 Australian Recording Industry Association (ARIA) Hall of Fame. The founding guitarist Brad Robinson had lymphoma at the time. He was not able to be at the Hall of Fame induction. He died two weeks later. ==Members== Chronological list: *Simon Binks – guitars (1978–1986) *David Reyne – drums (1978) *James Reyne – vocals, guitars, keyboards, harmonica (1978–1986) *Brad Robinson (d. 1996) – guitars, keyboards (1978–1986) *Paul Williams – bass guitar (1978–1985) *Bill McDonough – drums (replaced David Reyne) (1978–1983) *Guy McDonough (d. 1984) – vocals, guitar (1980–1984) *Graham \"Buzz\" Bidstrup – drums (replaced Bill McDonough) (1983) *John Watson – drums (replaced Bidstrup) (1983–1986) *Mark Greig – guitars (replaced Guy McDonough) (1984–1986) *Harry Brus – bass guitar (replaced Williams) (1985–1986) == Discography == * The Boys Light Up (1980) * Sirocco (1981) * Sons of Beaches (1982) * Semantics (1983 EP / 1984 LP) * Phalanx (1983) * Between a Rock and a Hard Place (1985) * The Final Wave (1986) ==Awards and nominations== ===ARIA Music Awards=== Australian Crawl were inducted into the Hall of Fame in 1996. |- | 1987 | Art Scarff for The Final Wave by Australian Crawl | Best Cover Art | |- | 1996 | Australian Crawl | ARIA Hall of Fame | ===TV Week / Countdown Awards=== |- | rowspan=\"5\" |1980 | \"Downhearted\" | Best Single Record | |- | rowspan=\"2\" | The Boys Light Up | Best Australian Record Cover Design | |- | Most Popular Record | |- | Themselves | Most Popular Group | |- | James Reyne (Australian Crawl) | Most Popular Male Performer | |- | rowspan=\"3\" |1981 | Sirocco | Best Australian Album | |- | Themselves | Most Popular Group | |- | James Reyne (Australian Crawl) | Most Popular Male Performer | |- | 1982 | Themselves | Most Popular Group | |- | rowspan=\"3\" | 1983 | Mark Opitz for work with Australian Crawl | Best Record Producer of the Year | |- | Themselves | Most Popular Group | |- | James Reyne (Australian Crawl) | Most Popular Male Performer | |- ==References== ==Other websites== * Universal Music's 'Australian Crawl' website. * * * * Official website of James Reyne * Category:Musical groups established in 1978 Category:Musical groups disestablished in 1986 Category:1978 establishments in Australia Category:1980s disestablishments in Australia Category:Australian musical groups",
 "title": "Australian Crawl"
}