{
 "id": "1181213",
 "text": "The Our Homeland Movement (Hungarian: Mi Hazánk Mozgalom, MHM) is a Hungarian political party described as national radical, populist, and skeptical of the European Union. Many political analysts place it on the radical right or even far-right, though the party calls itself \"third way,\" meaning neither left nor right. It was founded by László Toroczkai and others who left the Jobbik after the 2018 election, when Jobbik moved away from its radical right-wing roots. Some political opponents and liberal media claim MHM works with the ruling Fidesz party, but there are also clear tensions and personal conflicts between the two, showing they don't always agree. == History == On June 14, 2018, László Toroczkai announced on Facebook that he was founding a movement called Our Homeland Movement. On August 20, 2018, during a celebration in Budapest’s City Park, the movement released its Founding Declaration. The next day, August 21, deputy leader Dóra Dúró announced that Mi Hazánk had been officially registered as a political party by the court. To gain attention, the party initially organized high-profile events, often marches. For example, on May 21, 2019, they held a march in Törökszentmiklós, claiming it was in response to a Roma man repeatedly attacking people in the town without provocation. Another demonstration took place on February 17, 2020, in Sály, following the brutal murder of a 61-year-old woman by a 21-year-old local Roma man. On January 26, 2019, in Budapest, Toroczkai held a year-end review and campaign launch, presenting MHM’s program for the European Parliament election, which was also published in print. On February 20, 2019, Toroczkai, along with Tibor Nagy of MIÉP and Roland Hajdara of the FKGP, signed an agreement for cooperation between their three parties. During the 2019 European Parliament election campaign in May, Facebook removed Toroczkai’s official page and later his Instagram account, prompting him to file a complaint against the platform. On May 28, 2020, MHM organized a demonstration with a few hundred people in Budapest, first outside the National Roma Self- Government office and then at Deák Ferenc Square. The protest was held in response to the brutal stabbing deaths of two young people at Deák Ferenc Square on May 22. MHM claimed the march was to fight crime and suggested the attacker was of Roma origin. The police did not approve the demonstration but did not disperse it. Several participants were reported for violating COVID-19 emergency rules on gatherings. On August 16, 2020, MHM’s vice president, Előd Novák, climbed a 15-meter fire truck ladder to remove a rainbow flag from Budapest’s City Hall, placed there by the mayor. The party called the flag a “rainbow rag” and said the action was to protest “sexual deviance” and “anti- family symbols.” The police launched an investigation against him and conducted a nighttime search of his home. These two actions by Our Homeland Movement generated significant media attention, with even the U.S. Embassy commenting on the events, a statement that party leader László Toroczkai rejected in a public response. Earlier, Toroczkai had called for a labeling system to flag “homosexual propaganda” in films and TV shows, threatening to propose a law to enforce it. In September 2020, Dóra Dúró, the party’s vice president, called the children’s book A Fairytale for EveryoneThe book was published in English as A Fairytale for Everyone, and in Hungarian as Meseország mindenkié. “homosexual propaganda.” The book retells classic fairy tales from the perspectives of ethnic and social minorities. Dúró publicly tore the book apart page by page and then shredded it. On October 27, 2020, Facebook deleted the official page of MHM. == Ideology == === Politicial position === The movement is considered part of the radical right on the political spectrum. Its members often use the term \"third way,\" claiming the party rejects both the right-wing Fidesz-KDNP and the left-wing, liberal opposition coalition, positioning MHM as a third option, the \"Third Way.\" === Ideologies === Our Homeland Movement describes itself as a nationalist, national conservative, and the only anti-globalist party in Hungary. It supports a strong nation-state and emphasizes national-cultural identity in government actions. The party values green policies and animal welfare, creating a \"Green Homeland Cabinet\" to promote these issues. The party calls for revising the Treaty of Trianon, which redrew Hungary’s borders, and supports autonomy for Hungarians living abroad. Opposing globalization, it prioritizes Hungarian traditions, holidays, and culture, and rejects illegal immigration. The party is Eurosceptic, proposing a referendum on Hungary leaving the EU, arguing that the EU undermines national sovereignty and meddles in domestic affairs. Economically, the party wants Hungary to become self-sufficient by establishing hundreds of small and large businesses and launching a new land redistribution program. For public safety, it advocates harsher penalties and prison conditions based on the Singapore model, including prison terms for drug possession, turning prisons into work camps, and, in extreme cases, enforcing sentences in Siberia. The party also supports reinstating the death penalty for repeat murderers. Additionally, MHM backs tourism infrastructure development, creating an independent Hungarian social media platform, improving healthcare, reforming education, and reinstating mandatory military service. It condemns the \"flaunting\" of sexual minorities, opposing support for their organizations and events like Budapest Pride, and seeks to limit the promotion of gender theory in schools. == International relations == MHM regularly hosts events featuring representatives from nationalist, patriotic, sovereigntist, and Eurosceptic parties across Europe, while its delegations also attend events organized by partner organizations abroad. On June 10, 2024, the party co-founded the Europe of Sovereign Nations faction in the European Parliament alongside Germany’s AfD and other sovereigntist, anti-globalist parties. == Notes == Category:Political parties in Hungary Category:2018 establishments in Europe Category:21st-century establishments in Hungary",
 "title": "Our Homeland Movement"
}