{
 "id": "118167",
 "text": "The beluga whale (Delphinapterus leucas) is a small toothed whale that is white as an adult. They are found in coastal areas of the Arctic Ocean, and travel south when the sea ice forms. Belugas belong to the genus Delphinapterus (which means \"whale without fins\"), and the species leucas (which means \"white\"). == Name == \"Beluga\" means white one in Russian. The beluga is also called the white whale, the white porpoise, the sea canary (because of its songs), and the squid hound (because of its diet). == Description == === Body === The beluga's body is stout and has a small, blunt head with a small beak, tiny eyes and thick layers of blubber. Belugas have one blowhole. On their head, belugas have a round shape called the melon. It holds oil, and the whale is able to change its shape. Scientists believe that it has something to do with the whale's echolocation system. Unlike most other cetaceans, the beluga's seven neck vertebrae are not fused, giving it a flexible, well-defined neck. === Lifespan === A baby beluga whale, called a calf, is a grey or even brown color when it is born. It will gradually become white over the next five years as it becomes an adult. A female beluga whale will have one calf every 3 or 4 years. These are born near the coast, often near the entrance to large rivers. The calfs are fed on milk which is 30% fat. Belugas grow up to in length and weigh up to . They usually live for 35 to 50 years of age. They can dive down to depths of and stay underwater for as long as 25 minutes. Polar bears and killer whales are known to hunt beluga whales. === Pods === Beluga whales live in groups called pods. At their smallest, a pod can contain just three whales. Larger pods can have more than 200 members. == Diet and teeth == Belugas have 34 teeth. The teeth are not designed for chewing, but for grabbing and tearing prey. They swallow their prey whole. Belugas are opportunistic feeders, eating a varied diet of fish, squid, crustaceans, octopi, and worms. They are both benthic (bottom) and pelagic (oceanic) feeders (in shallow water). Belugas sometimes hunt schools of fish cooperatively in small groups. == References == Category:Toothed whales",
 "title": "Beluga whale"
}