{
 "id": "1181175",
 "text": "Indo-Bangla International Poets Meet was a 2013 international two-day literary and cultural event which was organised to promote dialogue and understanding between the literary communities of India and Bangladesh, particularly through the mediums of the literatures of Meitei language (alias Manipuri) and Bengali language. It was held on July 13 and 14, in Imphal, Manipur. It was organized by Sahitya Thoupang Lup, in collaboration with the Department of Art and Culture, Manipur, Manipur State Kala Akademi, Manipur Jagoi Marup, Sahitya Seva Samiti, Macha Chanu, Liberty Theatre, and the Library and Information Centre, Kakching. == Objective and cultural significance == The convener of the organizing committee, Saratchand Thiyam, articulated the primary aim of the meet as fostering mutual literary exchange and cultural integration between the peoples of India and Bangladesh. He emphasized the importance of such platforms in bridging the literary traditions of both nations, stating that although the world is increasingly interconnected, meaningful interaction between linguistic and literary communities remains essential. He highlighted the richness of Meitei literature and its growing influence, especially among the Meitei diaspora in Bangladesh, who have contributed to building a cultural bridge between the literary spheres of Meitei language (alias Manipuri) and Bengali language. == Inaugural session and literary presentations == The meet commenced on July 13, 2013, at the Library and Information Centre, Kakching. The second and concluding day took place at the J.N. Manipur Dance Academy Auditorium in Imphal. The program began with readings of translated poetry. Kulamani Singh presented Bengali translations of works by Meitei poets, including Kh. Chaoba, Dr. Kamal, Hijam Anganghal, E. Nilakanta, and Shri Biren. This was followed by Tongbram Kumarjit, who read Meitei language translations of poems by Bengali poets such as Kazi Nazrul Islam, Shamsur Rahman, Nirmalendu Goon, Mahadev Saha, and Dilwar. Kumarjit also recited Dilwar’s Bangla poem Aidi Houjik Manipurdani, dedicated to human rights activist Irom Chanu Sharmila. == Participating dignitaries and poets == The event was graced by a panel of poets and literary figures, serving as members of the Presidium: * B. Jayantakumar Sharma () – Indian poet and lyricist from Manipur. * Ratan Thiyam () – Indian theatre personality and poet. * Rabiul Husain – Bangladeshi architect, poet, short story writer, and cultural activist. He has authored seven poetry collections, three short story collections, and a novel. His accolades include the Bangla Academy Award (2009), Kobitalap Literary Award (2011), and Kobita Porishod Award (2012). He holds positions such as Chief Architect and Director of Shahidullah and Associates Ltd. and President of the International Film Critic Association of Bangladesh. * Mustafa Majid – General Manager of Bangladesh Bank and a poet and researcher. His oeuvre includes nine poetry volumes, notable titles being Kushumito Panchadhasi (1993) and Janajudher Convoy (2004). He has also authored biographies and scholarly works on indigenous cultures in Bangladesh. * Mohammad Enayet Ali – Bangladeshi bank officer from Sylhet, who is also a poet, singer, lyricist, and editor of the literary journal Shobdoshilan. He has published two poetry collections and one book of lyrics. * A.K. Sheram () – Bangladeshi Manipuri poet and writer residing in Bangladesh, and a retired bank manager. His body of work includes Basanta Kunnipalgi Leirang (1982), Nongoubi (2001), and Meira Paibi (2011). He is also the founder-president of the Bangladesh Manipuri Sahitya Sangsad, and recipient of multiple literary awards, including the Hijam Irabot Memorial International Award (2011). * Additional poets from Manipur and Bangladesh, such as S. Bhanumati Devi, Thangjam Ibopishak, Sanaton Hamom, Khairom Indrajit, Yumlembam Ibomcha, and Maisnam Rajesh, also presented their works during the sessions. == Cultural performance and conclusion == The concluding segment of the meet featured a cultural performance — a ballet adaptation of Rabindranath Tagore’s Kabuliwallah — staged by Manipuri Jagoi Marup, blending classical dance with literary narrative. == Legacy == The Indo-Bangla International Poets Meet was a cultural milestone that not only celebrated the literary heritage of the Meitei language (alias Manipuri) and Bengali language, but also highlighted the enduring ties between the peoples of India and Bangladesh through poetry, translation, and performance. It underlined the role of language and literature in fostering cross-border cultural solidarity and mutual appreciation. == Related pages == * Meitei language in Bangladesh * Meitei clothing in Bangladesh * Meitei monuments in Bangladesh * Meitei language festival * Meitei language day == References == Category:Meitei culture Category:Indian culture Category:Bangladeshi culture Category:Poems Category:Meitei literature Category:Meitei festivals Category:Manipur",
 "title": "Indo-Bangla International Poets Meet"
}