{
 "id": "1181195",
 "text": "The Hungarian Justice and Life Party (Hungarian: Magyar Igazság és Élet Pártja, MIÉP) was a far-right Hungarian political party. It described itself as \"neither left nor right, but Christian and Hungarian\" (\"Se nem jobb, se nem bal, keresztény és magyar\"). == History == The Hungarian Justice and Life Party was founded in 1993 by István Csurka and his supporters after they were expelled from the Hungarian Democratic Forum (MDF). They believed that MDF leader József Antall made a secret deal with the liberal SZDSZ party and failed to keep his main election promise of a \"major cleanup\" in politics. They also felt Antall pushed out leaders who supported traditional Hungarian and national values. Another reason for the split was a treaty signed with Ukraine. Csurka and his group believed this treaty meant Hungary was accepting the Treaty of Trianon, which had reduced Hungary’s territory after World War I. They saw this as a mistake because, at the time, Germany had reunited, and countries like the Soviet Union, Czechoslovakia, and Yugoslavia had broken apart. They thought these changes showed that old treaties, like those from Paris and Yalta, no longer applied, so Hungary should have pushed to revise Trianon instead of signing the new agreement. Additionally, they criticized the MDF government for not trying to reduce Hungary’s large foreign debt, which had grown during the communist regime. In the 1994 Hungarian parliamentary election, MIÉP received 1.59% of the vote. In 1998, it improved to 5.55%, allowing it to form its own parliamentary group. In 2002, the party got 4.37% but did not win any seats. In the 2006 Hungarian parliamentary election, MIÉP formed an alliance with Jobbik and the Smallholders’ Party called \"MIÉP–Jobbik Third Way Alliance of Parties\" earning 2.2% of the vote, but no seats. In the 2004 European Parliament election, MIÉP received 2.35%, or 72,000 votes. The party did not participate in the 2009 European Parliament election. In the 2014 Hungarian parliamentary election, MIÉP ran individual candidates with the Smallholders’ Party but did not field a national list, earning only 0.04% of the vote. In 2018, they managed to run 58 individual candidates and a national list. On February 20, 2019, in Budapest, MIÉP and the Our Homeland Movement signed a cooperation agreement at the latter’s office, sealed by party leaders Tibor Nagy and László Toroczkai. The party dissolved on July 27, 2021, and most of its members continued their activities in the Our Homeland Movement. On 23 September 2021, the court registered a new organisation called the Hungarian Justice and Life Party, but it is not the legal successor of the defunct party. == Ideology == MIÉP defined itself as a radical national conservative party and, for a long time, as a radical right- wing party. However, its slogan, \"neither left nor right, Christian and Hungarian,\" positioned its main ideology as a so-called \"third way.\" The party shared some views with the Fidesz–KDNP alliance. == References == Category:Defunct political parties in Hungary Category:20th-century establishments in Hungary Category:1993 establishments in Europe Category:2020s disestablishments in Europe",
 "title": "Hungarian Justice and Life Party"
}