{
 "id": "1181951",
 "text": "Keb Cuevas (born October 6, 1995) is a Filipino agriculturist, data scientist, and journalist. He is notable for his science education and public interest content on TikTok. He is also dubbed as The Digital Agriculturist, being a board-licensed agriculturist with background in data science. He was awarded as a Young Southeast Asian Leaders Initiative (YSEALI) Fellow for Economic Development in 2018. He currently leads his own digital agriculture firm KEBCO. == Early Life and Education == Cuevas was born in Las Piñas, Philippines. He grew up in an informal settlers area and working-class family. He helped with their small business while joining singing contests to support his studies. He finished elementary at Almanza Elementary School and high school at Saint Anthony School of Las Piñas. He started college at Adamson University before transferring to the University of the Philippines Los Baños (UPLB), where he earned a degree in agribusiness management and became a licensed agriculturist. He also studied economics at Brown University as a U.S. State Department scholar. Later, he studied for a master's degree in data science from the Technological Institute of the Philippines. In 2023, he was admitted to a PhD program at the University of the Philippines Diliman. He currently is pursuing law at Adamson University. == Career == === Journalism and Public Education === Cuevas worked at Rappler, focusing on stories about fake news, disaster preparedness, and public engagement. He made TikTok videos about science, economics, food, and urban agriculture to reach younger audiences. === Startups and Innovation === Cuevas co-founded Tagani, a startup that helped farmers access markets and digital tools. He worked with the Department of Agriculture and other groups to support small farmers. He later joined the National Economic and Development Authority (NEDA) and helped write the country's National Innovation Strategy. In 2023, he co-founded Taxikel, a ride-hailing app for rural areas. === Research and Teaching === Cuevas worked as a data scientist and analytics manager in both government and private companies. He also taught data science at CIIT College of Arts and Technology and joined the National Institute of Physics for PhD research in network science. == Advocacy Work == Cuevas promotes sustainable farming, mental health, and climate change awareness. He taught safe farming practices during the COVID-19 pandemic and spoke out about farmers' struggles and the need for fair pricing. He supported urban gardening for mental wellness and climate- resilient agriculture. He is also an advocate for LGBT rights, gender equality, and cultural respect. He supports same-sex marriage, anti- discrimination laws, and HIV/AIDS prevention. Cuevas joined public conversations about cultural appropriation during the Nas Daily-Whang-od controversy. == Television == * 2021: Project GO (AXN Asia) - Contestant == References == == External Links == * MuckRack Biography * Wikipedia (English) Category:Filipino activists Category:Filipino journalists Category:1995 births Category:Living people Category:Environmentalists",
 "title": "Keb Cuevas"
}