{
 "id": "1181809",
 "text": "\"Al-Isra, 81\" is the 81st verse of the 17th Sura (Surah Al-Isra) of the Al- Qur'an. In which the difference between truth and falsehood has been highlighted. In tafsir of this verse, Muslim thinkers talk about the incident of breaking the idols in the Kaaba by Muhammad (PBUH) during the conquest of Makkah. == Verse 81 of Surah Isra (Arabic) == * وَ قُلۡ جَآءَ الۡحَقُّ وَ زَهَقَ الۡبَاطِلُ ؕ اِنَّ الۡبَاطِلَ كَانَ زَهُوۡقًا ( w qulۡ ja' alۡhaqu w zahaq alۡbatil ؕ aina alۡbatil kan zahuۡqan) === Translation === *And say, ``Haqq has come and batil has disappeared. Surely the cancellation had to be abolished. Al-Bayan * Say, 'Truth has come and lies have disappeared, lies are to disappear.' Taisirul * And say: Truth has come and falsehood has vanished; Lies disappear. Mujibur Rahman * When truth comes and stands next to falsehood then falsehood disappears, because falsehood will disappear due to its nature. - Zakir Naik == Tafsir == * This verse was uttered by the Messenger of Allah (peace and blessings of Allah be upon him) during the conquest of Makkah after the Hijrah. Ibn Mas'ud Radiyallahu Anhu said: On the day of the conquest of Makkah, when the Messenger of Allah, may God bless him and grant him peace, entered Makkah, three hundred and sixty idols were installed on the four sides of the Baitullah. When the Messenger of Allah, may Allah bless him and grant him peace, reached there, this verse was being recited in his mouth, and he was striking the chest of each idol with his staff. [Bukhari: 2478, 4720, Muslim: 1781] So if the truth is established, falsehood will be removed. In another verse, Allah Ta'ala says, \"But I strike falsehood with the truth; it crushes the falsehood to pieces and immediately the falsehood is destroyed. [Surah Al-Ambiyyah: 18] And says, \"Say, 'Truth has come and falsehood cannot create anything new, nor can it repeat itself.'\" [Surah Saba: 49] He also said: “Allah wipes out falsehood and establishes the truth by His words. He is well aware of what is in the heart.” [Surah Ash-Shura: 24] - Tafseer Zakaria * It is narrated in the hadith that when the Prophet (PBUH) entered the Kaaba after the conquest of Makkah, three hundred and sixty idols were placed there. The Prophet (PBUH) had a wooden stick in his hand. He was poking the idols with his tip and جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ... And جَاءَ الْحَقُّ وَمَا يُبْدِئُ الْبَاطِلُ وَمَا يُعِيدُ were falling. (Bukhari: Kitabul Mazalim, Muslim: Kitabul Jihad) - Tafseer Ahsanul Bayan ==Rhetoric == In Arabic rhetoric (balagat), the verse is subject to the principle of ta'zil, where the first sentence is followed by another sentence containing the meaning, following one sentence containing the meaning with another to confirm it. Here it means to emphasize, that is, to emphasize what is being said: \"And say, 'Truth has come, falsehood has perished. Surely falsehood must perish.\" ==legacy== General Intelligence Department (Jordan) use the first part of the verse (وقل جاء الحق, And say the truth has come) in their logo. Zakir Naik used this verse at the beginning of many of his speeches. == References == Category:Islamic terminology Category:Components of the Quran Isra Category:Al-Isra Category:Islamic ethics",
 "title": "Al-Isra, 81"
}