{
 "id": "1181268",
 "text": "Super Bowl XVIII was an American football game. It was played on January 22, 1984, at Tampa Stadium. It was between the Washington Redskins and the Los Angeles Raiders. The winner would be the National Football League (NFL) champion for the 1983 season. The Raiders beat the Redskins, 38–9. The win broke Super Bowl records. It is still the most points scored from an AFC team in a Super Bowl. This record was later tied by the Kansas City Chiefs in Super Bowl LVII. This is the first time Tampa had the Super Bowl. This would be the AFC's last Super Bowl win until Super Bowl XXXII. In Super Bowl XXXII, the AFC team Denver Broncos won. The Redskins were the Super Bowl XVII champions. They were the best in the league for wins (14 wins and 2 losses) for the 1983 regular season. The Raiders had 12 wins and 4 losses for 1983. The telecast of the game on CBS was seen by an about 77.62 million viewers. The broadcast was famous for airing the \"1984\" television commercial, which showed the Apple Macintosh. ==Final statistics== Sources: NFL.com Super Bowl XVIII, Super Bowl XVIII Play Finder LA, Super Bowl XVIII Play Finder Was ===Statistical comparison=== Washington Redskins Los Angeles Raiders First downs 19 18 First downs rushing 7 8 First downs passing 10 9 First downs penalty 2 1 Third down efficiency 6/17 5/13 Fourth down efficiency 0/1 0/0 Net yards rushing 90 231 Rushing attempts 32 33 Yards per rush 2.8 7.0 Passing – Completions/attempts 16/35 16/25 Times sacked-total yards 6–50 2–18 Interceptions thrown 2 0 Net yards passing 193 154 Total net yards 283 385 Punt returns-total yards 2–35 2–8 Kickoff returns-total yards 7–132 1–17 Interceptions-total return yards 0–0 2–5 Punts-average yardage 8–32.4 7–42.7 Fumbles-lost 1–1 3–2 Penalties- total yards 4–62 7–56 Time of possession 30:38 29:22 Turnovers 3 2 ===Individual statistics=== Redskins Passing C/ATT1 Yds TD INT Rating Joe Theismann 16/35 243 0 2 45.3 Redskins Rushing Car2 Yds TD LG3 Yds/Car John Riggins 26 64 1 8 2.46 Joe Theismann 3 18 0 8 6.00 Joe Washington 3 8 0 5 2.67 Redskins Receiving Rec4 Yds TD LG3 Target5 Clint Didier 5 65 0 20 7 Charlie Brown 3 93 0 60 7 Joe Washington 3 20 0 10 6 Nick Giaquinto 2 21 0 14 3 Art Monk 1 26 0 26 10 Alvin Garrett 1 17 0 17 1 John Riggins 1 1 0 1 1 Raiders Passing C/ATT1 Yds TD INT Rating Jim Plunkett 16/25 172 1 0 97.4 Raiders Rushing Car2 Yds TD LG3 Yds/Car Marcus Allen 20 191 2 74 9.55 Greg Pruitt 5 17 0 11 3.40 Kenny King 3 12 0 10 4.00 Chester Willis 1 7 0 7 7.00 Frank Hawkins 3 6 0 3 2.00 Jim Plunkett 1 –2 0 –2 –2.00 Raiders Receiving Rec4 Yds TD LG3 Target5 Cliff Branch 6 94 1 50 7 Todd Christensen 4 32 0 14 9 Frank Hawkins 2 20 0 14 3 Marcus Allen 2 18 0 12 2 Kenny King 2 8 0 7 2 Malcolm Barnwell 0 0 0 0 1 ===Records set=== These records were set in Super Bowl XVIII. Player Records Set Player Records Set Player Records Set Passing Records Passing Records Passing Records Highest passer rating, career, (40 attempts) 122.8 Jim Plunkett (Los Angeles) Highest completion percentage, career, (40 attempts) 63.0% (29–46) Jim Plunkett (Los Angeles) Lowest percentage, passes had intercepted, career, (40 attempts) 0% (0–46) Jim Plunkett (Los Angeles) Rushing Records Rushing Records Rushing Records Most yards, game 191 Marcus Allen (Los Angeles) Longest rushing touchdown 74 yards Marcus Allen (Los Angeles) Longest run from scrimmage 74 yards Marcus Allen (Los Angeles) Highest average gain, career (20 attempts) 9.6 yards (191–20) Marcus Allen (Los Angeles) Combined yardage records † Combined yardage records † Combined yardage records † Most yards gained, game 209 Marcus Allen (Los Angeles) Special Teams Special Teams Special Teams Longest punt return 34 yards Darrell Green (Washington) Records Tied Records Tied Records Tied Most touchdowns, game 2 Marcus Allen (Los Angeles) Most rushing touchdowns, game 2 Marcus Allen (Los Angeles) Most receiving touchdowns, career 3 Cliff Branch (Los Angeles) Most interceptions returned for touchdown, game 1 Jack Squirek (Los Angeles) Most kickoff returns, game 5 Alvin Garrett (Washington) Most (one point) extra points, game 5 Chris Bahr (Los Angeles) Most (one point) extra points, career 8 Chris Bahr (Los Angeles) Most fair catches, game 3 Greg Pruitt (Los Angeles) * † This category shows rushing, receiving, interception returns, punt returns, kickoff returns, and fumble returns. Team Records Set Team Records Set Team Records Set Points Points Points Most points, game 38 Raiders Largest margin of victory 29 points Raiders Largest lead, end of 3rd quarter 26 points Raiders Rushing Rushing Rushing Highest average gain per rush attempt 7.0 (231–33) Raiders Kickoff returns Kickoff returns Kickoff returns Fewest yards gained, game 17 Raiders Records Tied Records Tied Records Tied Most points scored, first half 21 Raiders Most points, third quarter 14 Raiders Most touchdowns, game 5 Raiders Most (one point) PATs 5 Raiders Most touchdowns scored by interception return 1 Raiders Fewest kickoff returns, game 1 Raiders Fewest passing touchdowns 0 Redskins Most kickoff returns, game 7 Redskins Records Set, both team totals Records Set, both team totals Records Set, both team totals Records Set, both team totals Total Raiders Redskins Points, Both Teams Points, Both Teams Points, Both Teams Points, Both Teams Most points, third quarter 20 14 6 Punting, Both Teams Punting, Both Teams Punting, Both Teams Punting, Both Teams Most punts, game 14 7 7 ==Starting lineups== Source: Washington Position Position Los Angeles Offense Charlie Brown WR Cliff Branch‡ Joe Jacoby LT Bruce Davis Russ Grimm‡ LG Charley Hannah Jeff Bostic C Dave Dalby Mark May RG Mickey Marvin George Starke RT Henry Lawrence Don Warren TE Todd Christensen Art Monk‡ WR Malcolm Barnwell Joe Theismann QB Jim Plunkett John Riggins‡ FB Kenny King Rick Walker TE RB Marcus Allen‡ Defense Todd Liebenstein LE Howie Long‡ Dave Butz LT NT Reggie Kinlaw Darryl Grant RT RE Lyle Alzado Dexter Manley RE LLB Ted Hendricks‡ Mel Kaufman ILB Matt Millen Neal Olkewicz MLB ILB Bob Nelson Rich Milot RLB Rod Martin Darrell Green‡ LCB Lester Hayes Anthony Washington RCB Mike Haynes‡ Ken Coffey SS Mike Davis Mark Murphy FS Vann McElroy ==Officials== * Referee: Gene Barth #14 first Super Bowl * Umpire: Gordon Wells #89 first Super Bowl * Head Linesman: Jerry Bergman #17 third Super Bowl (XIII, XVI) * Line Judge: Bob Beeks #59 third Super Bowl (XIV, XVI) * Back Judge: Ben Tompkins #52 second Super Bowl (XIV) * Side Judge: Gil Mace #90 first Super Bowl * Field Judge: Fritz Graf #34 fourth Super Bowl (V, VIII, XV) * Alternate Referee: Jim Tunney #32 worked Super Bowls VI, XI, XII on field * Alternate Umpire: Ed Fiffick #57 did not work Super Bowl on field ==References== ==Other websites== * * Super Bowl official website * Super Bowl XVIII Box Score at Pro Football Reference * * * * https://www.pro-football-reference.com – Large online database of NFL data and statistics * Super Bowl play-by-plays from USA Today (Last accessed September 28, 2005) * All-Time Super Bowl Odds from The Sports Network (Last accessed October 16, 2005) Category:Super Bowl Category:1984 in American television Category:1980s in Florida Category:1984 in sports",
 "title": "Super Bowl XVIII"
}