{
 "id": "1181539",
 "text": "A speech droplet or speaking droplet is a particle of salivaMaton, Anthea 1993.. Human biology and health. Prentice Hall. involuntarily expelled from the mouth during speech, especially during vigorous articulation or the pronunciation of explosive consonants (such as /p/, /b/, /t/). These droplets, distinct from respiratory droplets, are produced by fluid dynamics in the oral cavity rather than by pulmonary exhalation. == Characteristics and Formation == They form when tongue movements, lip bursts, or airflow turbulence disrupt the thin saliva film coating the mouth, ejecting droplets into the air. Speach droplets are typically: * Larger (50–500 µm in diameter) than respiratory aerosols (<5 µm) but smaller than visible spittle. * Projected short distances (usually <1 meter) due to their mass, though forceful speech can extend their range. * Composed of saliva, oral mucus, and potential oral microbiota (e.g., Streptococcus). == Differences from respiratory droplets == Modern studies (Anfinrud et al., 2020) have quantified their role in disease spread, particularly during the COVID-19 pandemic, where masks reduced their dispersion by 99 %. Feature Speech Droplets Respiratory Droplets Origin Oral cavity (saliva) Lungs, bronchial tract Size 50–500 µm (often visible) 0.1–10 µm (smaller, aerosolizable) Expulsion Force Moderate (speech-dependent) High (coughing/sneezing) Disease Relevance Lower transmission risk (e.g., colds) High (COVID-19, influenza, TB) Dispersion Fall quickly, limited airborne time Can remain suspended for hours == Historical context == The term speech droplet appeared in medicine in the 18th century to describe salivary projections linked to the transmission of tuberculosis . In the 19th century, actors and orators avoided explosive consonants to reduce spit on stage. Modern studies (Anfinrud et al., 2020) have quantified their role in disease spread, particularly during the COVID-19 pandemic, where masks reduced their dispersion by 99 % . == Mitigation == * Hygiene : Hydration and lip balms reduce their formation. * Theater : Actors use speaking techniques to minimize them. * Physical barriers : Plexiglass ceilings block spit, but they do not block aerosols. == Scientific research == # Pasteur Study (2021) #* Analysis of 800 French speakers #* The consonants /p/ and /t/ produce 35% more spit than other phonemes #* Speakers in the South of France produce 20% more than those in the North. # Public Health France Data (2020-2023) #* Contribution of droplets to contamination: #** 22% in choirs #** 12% in classrooms #** 7% in public transport == Related pages== * Infection == References == ==Other websites== * Category:Infectious diseases",
 "title": "Speech droplet"
}