{
 "id": "1181148",
 "text": "Emma Lambotte-Protin (11 August 1876 — 18 March 1963)Sextant. Revue du Groupe interdisciplinary d'etudes sur les femmes. Issues 11–12. Brussels 1999. p. 154. (French) was a Belgian author, art critic, sports administrator and fencer. As a art collector, she owned the largest collection of works by James Ensor. ==Biography== ===Early life=== Protin was born on 11 August 1876 in Liège. Her father was printer Edouard Protin. She received an education at the best private schools and, thanks to her artistic talent, she was allowed to take private lessons at the Liège Academy. In 1895, she married surgeon one of the pioneers of osteosynthesis. He became chief of surgery in Antwerp in 1900. Emma Lambotte wrote poems and art criticism, which she published under a pseudonym. She mostly collected contemporary art, which often did not correspond to bourgeois tastes in Antwerp.kmska.be: Emma Lambotte Ensor’s soul mate. (English and Dutch) Lambotte painted when she was young and exhibited at the Kursaal in Ostend in 1908. ===Fencing=== From 1907 to 1914 she was the president of one of worlds leading women’s fencing club, the Ladies Fencing Club in Antwerp. She was also a fencer herself, trained by Olympic champion Cyrille Verbrugge. It was the early era of women’s fencing. In March 1910 she participated with her club at the earliest international women’s fencing meeting, the 1910 England–Belgium women's fencing competition in London against a British team. She was with the club also involved at the other early women’s fencing meetings, including the 1911 Netherlands–Belgium women's fencing meeting and 1911 Belgium–Netherlands women's fencing meeting. Women’s fencers were at the time pioneers, and caused astonishment among respectable people who considered them \"eccentric\". She also wrote the non-fiction book L'Escrimeuse (The Fencer), that was published much later in 1937. ==References== Category:1876 births Category:1963 deaths Category:Belgian people Category:Belgian fencers",
 "title": "Emma Lambotte"
}