{
 "id": "1181168",
 "text": "Rough Draft Studios, Inc. is an American animation studio in Glendale, California. It also has Rough Draft Korea, which is in Seoul, South Korea. The studio was founded in Van Nuys, Los Angeles by Gregg Vanzo in 1991. Rough Draft Studios has made many specials, commercials and video work for many companies. Some of these companies have been Warner Bros. Animation, Cartoon Network Studios, 20th Television Animation, MTV Animation, Film Roman, Disney Television Animation and Nickelodeon Animation Studio. == Founding == Rough Draft Studios was founded in a Van Nuys, Los Angeles garage by Gregg Vanzo and Nikki Vanzo. Nikki started and runs Rough Draft Korea. ==Technology== Rough Draft Studios is known for using both 2-D with computer animation and non- photorealistic rendering. This was used in many of Matt Groening's projects. These include The Maxx, then Futurama, The Simpsons Movie, a few episodes of The Simpsons after the movie and Disenchantment. ==Filmography== ===Rough Draft Studios=== ====TV series==== Show Year(s) Client Notes 1990s The Maxx 1995 MTV Animation Futurama 1999–2003; 2008–2013; 2023–present The Curiosity Company * * * 20th Television Animation 2000s Baby Blues 2000 Warner Bros. Animation 5 episodes Star Wars: Clone Wars 2003–2005 Lucasfilm * * * Cartoon Network Studios Drawn Together 2004–2007 Double-Hemm Productions * * * Comedy Partners Korgoth of Barbaria 2006 Williams Street TV pilot Sit Down Shut Up! 2009 Adelaide Productions * * * 20th Century Fox Television 2010s Good Vibes 2011 Rough House Pictures * * * Warner Horizon Television * * * MTV Production Development \"Pilot\" Napoleon Dynamite 2012 Hess Films * * * Scully Productions * * * 20th Century Fox Television Full English Two Brothers Pictures Coffin Dodgers 2013 Williams Street TV pilot Clash-a-Rama 2015–present Tolerable Entertainment * * * Supercell Web series Tarantula 2017 Rough House Pictures * * * Solid Brass Studio T Disenchantment 2018–2023 The ULULU Company * * * Netflix 2020s Fired on Mars 2023 Pat & Mike Productions NN Productions ====Films/specials==== Title Year Client Notes 1990s The Thief and the Cobbler 1992 The Completion Bond Company ink-and-paint RoboCop 3 1993 Orion Pictures \"Johnny Rehab\" commercial animation 2000s The Whizzard of Ow 2003 Warner Bros. Animation theatrical short Duck Dodgers: Attack of the Drones 2004 theatrical short produced in 2003 Futurama: Bender's Big Score 2007 The Curiosity Company 20th Century Fox Television direct-to-video Futurama: The Beast with a Billion Backs 2008 Futurama: Bender's Game The Pink Panther 2 2009 Metro-Goldwyn-Mayer Columbia Pictures opening title sequence only Futurama: Into the Wild Green Yonder The Curiosity Company 20th Century Fox Television direct-to-video 2010s How Murray Saved Christmas 2014 Universal Television TV special 2020s King Star King!/!/!/ 2023 Williams Street TV special ==== Other ==== *The Simpsons - \"Deep, Deep Trouble\" music video (overseas animation provided by Anivision) *MADtv - Spy vs. Spy shorts *2003 Wendy's \"Go Wild\" and Sprint “Duck Naked” commercials. These had the Looney Tunes characters, promoting Looney Tunes: Back in Action *59th Primetime Emmy Awards - Brian and Stewie Griffin opening number *Gravity Falls - \"Weirdmageddon 3: Take Back The Falls\" (ShackTron CG animation) *Futurama: Worlds of Tomorrow *DuckTales - \"Moonvasion!\" === Rough Draft Korea === Rough Draft Korea, RDS' sister studio based in Seoul, South Korea. Rough Draft Korea has made animation for these series, features, specials, short films, music videos and commercials. ==== TV series ==== Show Year(s) Client Notes 1990s The Ren & Stimpy Show 1992–1995 Spümcø * * * Games Animation The Simpsons 1992–present Gracie Films * * * Film Roman (1992–2016) * * * 20th Television Animation (2016–present) season 4–present Beavis and Butt-Head 1993–1997; 2011 MTV Animation The Critic 1994–1995 Gracie Films * * * Film Roman The Brothers Grunt A.k.a. Cartoon Timon & Pumbaa 1995 Walt Disney Television Animation 8 shorts Eek! Stravaganza Film Roman Klutter! segments only The Twisted Tales of Felix the Cat 1995–1996 The Nanny 1995 TriStar Television \"Oy to the World\" Rocko's Modern Life 1996 Joe Murray Productions * * * Games Animation \"Fatal Contraption\" and season 4 only with Sunwoo Entertainment Dexter's Laboratory 1996–1999; 2001–2003 Hanna-Barbera (1996–1998) * * * Cartoon Network Studios (2001–2003) Pinky and the Brain 1996–1998 Warner Bros. Animation Jumanji 1996 Adelaide Productions 6 episodes of season 1 What a Cartoon! 1996–1997 Cartoon Network Studios \"Buy One, Get One Free*\", \"The Zoonatiks, in Home Sweet Home\" King of the Hill 1997–2001 Deedle-Dee Productions * * * Judgemental Films * * * 3 Arts Entertainment * * * 20th Television Animation 30 episodes The Angry Beavers Gunther-Wahl Productions * * * Nickelodeon Animation Studio Happily Ever After: Fairy Tales for Every Child 1997 HBO 8 episodes of season 2 Johnny Bravo Hanna-Barbera Season 1 alongside Sunwoo Entertainment Cow and Chicken 1997–1999 I Am Weasel 1997–2000 Daria 1998 MTV Animation Season 2 CatDog 1998–2001 Peter Hannan Productions Nickelodeon Animation Studio with Saerom Animation Oh Yeah! Cartoons 1998–2001 Frederator Studios The Powerpuff Girls 1998–2005 Hanna-Barbera (1998–2001) * * * Cartoon Network Studios (2002–2005) Dilbert 1999–2000 Adelaide Productions 11 episodes SpongeBob SquarePants 1999–present United Plankton Pictures Nickelodeon Animation Studio ChalkZone 1999–2000 Frederator Studios season 1 Dragon Tales 1999–2005 Adelaide Productions 2000s Family Guy 2000–2001 Fuzzy Door Productions * * * 20th Television Animation eight episodes of season 2 (production order) The Cartoon Cartoon Show Cartoon Network Studios Sammy 2000 Adelaide Productions Jackie Chan Adventures 2000–2002 13 episodes of seasons 1 and 2 Sheep in the Big City Curious Pictures The Oblongs 2001 Film Roman Samurai Jack 2001–2004; 2017 Cartoon Network Studios seasons 1-4 and \"XCVIII\" Grim & Evil 2001–2004 Harold and the Purple Crayon Adelaide Productions Kim Possible 2002–2007 Walt Disney Television Animation 22 episodes Harvey Birdman, Attorney at Law 2002–2003 Williams Street episodes 2-9 Whatever Happened to... Robot Jones? Cartoon Network Studios 3-South Hentemann Films * * * Warner Bros. Animation MTV Animation Clone High Touchstone Television * * * Doozer * * * Lord Miller Productions * * * Nelvana My Life as a Teenage Robot 2002–2006 Frederator Studios Nickelodeon Animation Studio Codename: Kids Next Door 2002–2008 Curious Pictures The Grim Adventures of Billy & Mandy 2001–2005 Cartoon Network Studios seasons 1-5 Evil Con Carne 2001–2004 Danny Phantom 2004–2007 Billionfold Inc. Nickelodeon Animation Studio American Dad! 2005 Underdog Productions * * * Fuzzy Door Productions * * * 20th Television Animation Unaired pilot episode only The Life & Times of Juniper Lee 2005–2007 Cartoon Network Studios Catscratch Nickelodeon Animation Studio Camp Lazlo 2005–2008 Cartoon Network Studios Sunday Pants 2005 \"Periwinkle Around the World\" The X's 2005–2006 Nickelodeon Animation Studio Squirrel Boy 2006–2007 Cartoon Network Studios Korgoth of Barbaria 2006 Williams Street TV pilot American Dragon: Jake Long 2006–2007 Walt Disney Television Animation Season 2 Class of 3000 2006–2008 Cartoon Network Studios 14 episodes Random! Cartoons 2006–2007 Frederator Studios Nickelodeon Animation Studio The Modifyers 2007 TV pilot Tom and Jerry Tales 2007–2008 Warner Bros. Animation 5 episodes of season 2 Phineas and Ferb 2007–2012 Disney Television Animation Seasons 1-3 The Replacements 2008–2009 Season 2 The Mighty B! 2008–2011 Paper Kite Productions * * * Polka Dot Pictures * * * Nickelodeon Animation Studio The Cartoonstitute 2009 Cartoon Network Studios 2010s Adventure Time 2010–2018 Frederator Studios Cartoon Network Studios with Saerom Animation Sym-Bionic Titan 2010–2011 Orphanage Animation Studios The Looney Tunes Show 2011–2013 Warner Bros. Animation Scooby-Doo! Mystery Incorporated 2012 \"The Night the Clown Cried\" and \"The Night the Clown Cried II\" Gravity Falls 2012–2016 Disney Television Animation 23 episodes Ben 10: Omniverse 2012–2014 Cartoon Network Studios Nickelodeon Animated Shorts Program 2013–2018 Nickelodeon Animation Studio \"Bug Salad\", \"Ice Station Zedonk\", \"Magic Children Doing Things\", \"Someone Needs to Stop Aunt Phyllis\", \"Camp Weedonwantcha\" Uncle Grandpa 2013–2017 Cartoon Network Studios Steven Universe 2013–2019 with Sunmin Image Pictures Star vs. the Forces of Evil 2015–2019 Disney Television Animation \"Blood Moon Ball\", Season 2 until season 4 We Bare Bears 2015–2019 Cartoon Network Studios with Saerom Animation Wabbit 2015–2016 Warner Bros. Animation Season 1 Bug Salad 2016 Nickelodeon Animation Studio web shorts Billy Dilley's Super-Duper Subterranean Summer 2017 Disney Television Animation Craig of the Creek 2017–2025 Cartoon Network Studios Summer Camp Island 2017–2023 Big City Greens 2018–present Disney Television Animation with Sugarcube Animation Amphibia 2019–2022 with Saerom Animation and Sunmin Image Pictures Steven Universe Future 2019–2020 Cartoon Network Studios with Sunmin Image Pictures 2020s The Owl House 2020–2023 Disney Television Animation with Sunmin Image Pictures and Sugarcube Animation Chibi Tiny Tales 2020–present interstitial series Tig n' Seek 2020–2022 Cartoon Network Studios Kamp Koral: SpongeBob's Under Years 2021 United Plankton Pictures * * * Nickelodeon Animation Studio \"Kitchen Sponge\", \"Outhouse Outrage\", \"Help Not Wanted\", and \"Mermaid Men and Barnacle Boys\" (2D sequences only) The Patrick Star Show 2021–present We Baby Bears 2022–present Cartoon Network Studios with Saerom Animation Chibiverse 2022–present Disney Television Animation with Saerom Animation Hailey's On It! 2023–2024 with Saerom Animation Adventure Time: Fionna and Cake 2023–present Cartoon Network Studios * * * Frederator Studios with Saerom Animation Jessica's Big Little World 2023–2024 Cartoon Network Studios with Saerom Animation ====Films/specials==== Title Year Client Notes 1990s FernGully: The Last Rainforest 1992 20th Century Studios Kroyer Films P. J. Sparkles Mike Young Productions opening titles The Bears Who Saved Christmas 1994 Film Roman Izzy's Quest for Olympic Gold 1995 Beavis and Butt-Head Do America 1996 Paramount Pictures MTV Films Geffen Pictures Judgemental Films overseas animation, 3-D sequences The Story of Santa Claus Film Roman A Day in the Life of Ranger Smith 1999 Spümcø Boo Boo Runs Wild Uncredited Dexter's Laboratory: Ego Trip Hanna-Barbera 2000s The Flintstones: On the Rocks 2001 Cartoon Network Studios The Powerpuff Girls Movie 2002 Warner Bros. Pictures Cartoon Network Studios Globehunters: An Around the World in 80 Days Adventure Nickelodeon Animation Studio produced in 2000 The Electric Piper 2003 Polly Pocket: Lunar Eclipse Mike Young Productions Stitch! The Movie Disney Television Animation The SpongeBob SquarePants Movie 2004 Paramount Pictures Nickelodeon Movies United Plankton Pictures Inside the CIA 2005 20th Century Studios Underdog Productions Fuzzy Door Productions Short Kim Possible Movie: So the Drama Disney Television Animation How to Eat Fried Worms New Line Cinema Walden Media Animated sequences The Simpsons Movie 2007 20th Century Studios 20th Century Animation Gracie Films also co-produced overseas with AKOM Phineas and Ferb's Musical Cliptastic Countdown 2009 Disney Television Animation 2010s Phineas and Ferb: Summer Belongs To You! 2010 Disney Television Animation Achmed Saves America 2012 Anchor Bay Entertainment Hotel Transylvania Columbia Pictures Sony Pictures Animation End title sequence Madea's Tough Love 2015 Lionsgate Tyler Perry Studios Bento Box Entertainment The SpongeBob Movie: Sponge Out of Water Paramount Pictures Paramount Animation Nickelodeon Movies United Plankton Pictures 2D hand-drawn animated sequences only Looney Tunes: Rabbits Run Warner Bros. Animation Hotel Transylvania 2 Columbia Pictures Sony Pictures Animation End title sequence Hotel Transylvania 3: Summer Vacation 2018 Steven Universe: The Movie 2019 Cartoon Network Studios 2020s We Bare Bears: The Movie 2020 Cartoon Network Studios ==Notes== ==References== ==Other websites== * * ** Category:1991 establishments in California Category:American entertainment companies Category:South Korean animation studios Category:Animation studios in Asia Category:American animation studios Category:Companies based in California Category:1990s establishments in South Korea Category:1992 establishments in Asia",
 "title": "Rough Draft Studios"
}