{
 "id": "1182036",
 "text": "==March== He also clashed with the Abbasid Caliph al-Nasir in Khuzestan, capturing parts of western Iran.Grousset, Rene (1991). The Empire of the Steppes. Rutgers University Press. Luristan and Khuzestan, which were the lands of the Caliph, submitted to Jalaluddin.https://www.kitapyurdu.com/kitap/son-harzemsah- celaleddin/630230.html?srsltid=AfmBOormefeUxC8YYRNbTL4hKtw8-6iXyMe2pTI8eNMsOPe99NTEIK8t ===Khuzestan=== He came to Isfahan, which was under his brother's control, but he did not stay long and entered the Khuzestan region in January 1225. The Khuzestan region was under the rule of Caliph Nasir. When Jalaluddin Khwarazmshah came to the region, the attitude towards the caliph continued during his time, just as it had during the time of his father Alaeddin Muhammad. Caliph Nasir also continued his hostile attitude. He wanted to eliminate the Caliph of Baghdad, whom he saw as the sole reason for what had happened to his father and the disintegration of his state and falling into the hands of the Mongols. He would complete the Baghdad expedition that his father could not complete and kill the caliph.https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ===Lorestan=== When the Khwarezm sultan left the region and came to Baghdad, Caliph Nasir sent an army of 20 thousand men under the command of Kush Timur against Celaleddin. He also asked for help from the ruler of Erbil, Muzafferuddin Gokboru, to go with his army against Celaleddin. When Celaleddin approached Kush Timur's army, he gave him the following message: \"A strong enemy army is threatening our country. The reason we came here is to take refuge with the commander of the believers against the enemy army. If the caliph supports me, it will be easy for me to throw that strong army out of our country.\"4 However, Kush Timur, who did not heed Celaleddin's words and due to his self-confidence, attacked the Khwarezm army without waiting for Gokboru's army and lost the war. Continuing the sieges, Celaleddin pursued the defeated Baghdad army to Baquba, which was seven leagues away from Baghdad, and captured this city. Cemaleddin Kush Timur and his soldiers, who were defending the city, could not stop him. After hearing that the Caliph's army had been defeated in the village of Baquba, Nasir Lidinillah began to fear that Jalaleddin would capture Baghdad. He began to make preparations in response to a siege that Jalaleddin would launch. They prepared all kinds of swords, arrows and incendiary materials to be used during the war. While Caliph Nasir was making defensive preparations, the Khwarezmian soldiers plundered everywhere they passed and seized many spoils such as horses, mules and mounts. After capturing the village of Baquba, the Khwarezmian soldiers moved from there to the village of Dakuka. The people of the city besieged by Jalaluddin Harezmshah climbed onto the walls and started to fight. During the fighting, the people were chanting takbirs and swearing and insulting Celaleddin. Celaleddin, who took the city by force of the sword, had the city plundered and many people were killed during the plunder (622/1225).https://nek.istanbul.edu.tr/ekos/TEZ/ET003215.pdf ==References== Category:13th-century conflicts Category:Wars involving Asia Category:Lorestan Province",
 "title": "Jalaluddin march to Khuzestan and Lorestan"
}