{
 "id": "1182690",
 "text": "Paracetamol poisoning happens when someone takes too much paracetamolAlso called Panadol or Tylenol in some countries. ‒ a common drug for relieving pain ‒ within a short time. The poisoning tends to happen in three phases. ==Phases== ===First phase=== The first phase begins within hours of someone overdosing on paracetamol. Symptoms include nausea, vomiting, sweating, and a pale look, though some patients do not show symptoms. ===Second phase=== The second phase occurs within 24 and 72 hours of the overdose when liver damage happens. The damage is typically found in liver cells that metabolize the paracetamol. Liver biopsy tends to show coagulative necrosis in zone 3 of the liver acinus, around the central venules, as these hepatocytes have higher concentrations of cytochrome P450 enzymes compared to zone 1 hepatocytes around the acinus' portal venule. The liver damage is often not noticed until right upper quadrant abdominal pain occurs, while the international normalized ratio (INR) and the liver transaminases ALT and AST rise to abnormal levels. ====Pathophysiology==== This can happen when the sulfate and glucuronide pathways, and the cytochrome P450 enzyme system, are saturated with toxic reactive intermediates from the metabolized paracetamol ‒ especially N-acetyl- p-benzoquinone imine (NAPQI).* * * The lack of glutathione to detoxify the excess NAPQI allows it to damage liver cells massively, causing liver failure. Acute kidney failure may also occur due to either hepatorenal syndrome or multiple organ dysfunction syndrome. ===Third phase=== The third phase follows at 3 to 5 days, marked by massive liver cell deaths and fulminant liver failure, along with sepsis, brain swelling, kidney failure, and multiple organ failure that cause death. ==Treatment== Paracetamol poisoning can be treated by activated charcoal. The antidote acetylcysteine is sometimes given. A liver transplant may be required if the liver damage is huge. Liver failure is rare when early treatment is given. Death occurs in 0.1% of the treated cases. ==Related pages== * Toxicology * Barbiturate overdose * Benzodiazepine withdrawal syndrome ==References== Category:Disorders Category:Medical emergencies",
 "title": "Paracetamol poisoning"
}