{
 "id": "1182680",
 "text": "Mehdi Asadshir (Persian: مهدی اسدشیر; born December 5, 1998) is an Iranian professional futsal player who plays as a [position, e.g. winger/midfielder] for Giti Pasand Isfahan in the Iranian Futsal Super League and the Iran national futsal team. He is known for his technical skills, agility, and consistent performance in both domestic and international competitions. == Early life == Asadsheer was born in Shahr-e Rey, Iran. He began playing futsal at a young age with the Shahid Sorkheh'i club in Shahr-e Rey. His performance quickly attracted attention, and he progressed through youth teams before moving into the senior ranks. == Career == ===Club career=== * Shahid Sorkheh’i Shahr-e Rey – Youth team; third place in Iran's First Division (U19) * Moghavemat Tehran – Achieved: \\- Champion of Iran’s First Division (U21) \\- Champion of Iran’s Premier League (U21) * Foodka Tehran – Champion of Iran’s First Division (Senior) * Raga Tehran – Promoted to the Premier League * Sanayeh Sazeh Saveh (Sanayeh Sazeh Saweh) – Fourth place in the Premier League * Gohar Zamin Sirjan – Third place in the Iranian Futsal Super League * Giti Pasand Isfahan – Current club === International Career === Mehdi Asadsheer has represented the Iran national futsal team in several international tournaments, achieving multiple podium finishes: * Runner-up – AFC Futsal Asian Cup * Runner-up – Intercontinental Futsal Cup, Thailand * Champion – 6-Nation Tournament, Thailand * Runner-up – International Tournament, Brazil === Style of Play === Asadsheer is recognized for his versatility and high work rate. He plays a pivotal role in transition plays and has contributed both offensively and defensively in various matches. === Personal Information === * Height: 1.76 m * Weight: 75 kg * Residence: Shahr-e Rey, Iran == Honors == === Club === * Iranian First Division U19 – Third place (Shahid Sorkheh’i Shahr-e Rey) * Iranian First Division U21 – Champion (Moghavemat Tehran) * Iranian Premier League U21 – Champion (Moghavemat Tehran) * Iranian First Division (Senior) – Champion (Foodka Tehran) * Iranian Futsal Super League – Third place (Gohar Zamin Sirjan), Fourth place (Sanayeh Sazeh Saveh) === International === * AFC Futsal Asian Cup – Runner-up (Iran) * Intercontinental Futsal Cup (Thailand) – Runner-up * 6-Nation Tournament (Thailand) – Champion * Brazil International Tournament – Runner-up == References == Category:Living people Category:1998 births Category:Futsal players Category:Iranian sportspeople",
 "title": "Mehdi Asadshir"
}