{
 "id": "1182620",
 "text": "The Committee on International Affairs of the State Duma () is a committee of the State Duma. The Committee implements foreign policy in Russia. The Committee works with parliaments in other countries. They also checks treaties. After they have checked the treaty, the State Duma votes on the treaty. When the President of Russia decides a new ambassador, the Committee has to agree to use that person for ambassador.General information ==Membership == Members of the Committee in the 8th State Duma:Committee Staff Member Position Party Party Leonid Slutsky Chair of the Committee Liberal Democratic Party Svetlana Zhurova First Deputy Chair of the Committee United Russia Vyacheslav Nikonov First Deputy Chair of the Committee United Russia Dmitry Novikov First Deputy Chair of the Committee Communist Party Shamsail Saraliev First Deputy Chair of the Committee United Russia Alexey Chepa First Deputy Chair of the Committee A Just Russia — For Truth Irina Rodnina Deputy Chair of the Committee United Russia Dmitry Belik Member of the Committee United Russia Maria Butina Member of the Committee United Russia Sergey Kotkin Member of the Committee United Russia Dmitry Kuznetsov Member of the Committee A Just Russia — For Truth Zelimkhan Mutsoev Member of the Committee United Russia Valentina Tereshkova Member of the Committee United Russia Saygidpasha Umakhanov Member of the Committee United Russia Roza Chemeris Member of the Committee New People ==Chairs== Duma Chair Chair Took office Left office Political Party Political Party 1st Vladimir Lukin (1937–) 17 January 1994 17 January 1996 Yabloko КОМИТЕТЫ И МАНДАТНАЯ КОМИССИЯ ГОСУДАРСТВЕННОЙ ДУМЫ первого созыва (1994-1995) 2nd Vladimir Lukin (1937–) 17 January 1996 19 January 2000 Yabloko Комитет Государственной Думы II созыва (1996-1999) по международным делам 3rd Dmitry Rogozin (1963–) 19 January 2000 16 January 2004 Rodina КОМИТЕТЫ И ПОСТОЯННЫЕ КОМИССИИ ГОСУДАРСТВЕННОЙ ДУМЫ третьего созыва 4th Konstantin Kosachev (1962–) 16 January 2004 24 December 2007 United Russia КОМИТЕТЫ И ПОСТОЯННЫЕ КОМИССИИ ГОСУДАРСТВЕННОЙ ДУМЫ четвертого созыва 5th Konstantin Kosachev (1962–) 24 December 2007 21 December 2011 United Russia 6th Aleksey Pushkov (1954–) 21 December 2011 5 October 2016 United Russia 7th Leonid Slutsky (1968–) 5 October 2016 12 October 2021 Liberal Democratic Party 8th Leonid Slutsky (1968–) 12 October 2021 Incumbent Liberal Democratic Party ==References== ==Other websites== * Committee on International Affairs of the State Duma, committee activity. Category:Government of Russia Category:1993 establishments in Europe Category:1990s establishments in Russia Category:State Duma",
 "title": "Committee on International Affairs of the State Duma"
}