{
 "id": "1182747",
 "text": "The Lisbon massacre, sometimes known as the Lisbon pogrom, was a massacre that happened on April 19, 1506 when Portuguese Catholics killed between 500 and 4,000 Jews who were considered \"New Christians\" (Portuguese: Cristãos-Novos) ‒ the name for Jews who had been forcibly converted to Christianity ‒ across the city of Lisbon. * * * ==Background== King Manuel I, who took the throne in 1495, ordered all Jews within Portugal to either baptize as Catholics or leave the kingdom in 1496 under the pressure of Spain's Queen Isabella I and King Ferdinand II. Since then, the original Portuguese Catholics disliked the recent Jewish converts, suspecting them of practicing Judaism in secret. Antisemitic violence happened from time to time before the Lisbon massacre in 1506. ==Massacre== The massacre began in the Church of São Domingos on April 19, 1506, when a New Christian was accused of mocking the churchgoers who claimed to have seen (1) a strange light rising from a crucifix in the Chapel of Jesus (2) a girl with a deformed hand getting miraculously cured. The antisemitic Portuguese Catholics hunted for Jews across Lisbon. Some of the murdered Jews were burned in public as described by New Christian Isaac Ibn Farad: Some historians claimed that a number of Old Christians were also killed when they were mistaken for being Jewish. Victims of the antisemitic massacre also had their homes looted. Dominican friars from the Monastery of São Domingos were reportedly heard inciting the murderers to kill the \"heretics\" and \"extinguish the wicked race\". ==Casualties== The exact death toll remains unknown. Historians put the toll at between 500 and 4,000. ==Aftermath== When King Manuel I learned of the massacre, he ordered the execution of the identified participants. Summary executions happened. Two of the Dominican friars who had incited the massacre had their religious orders removed, strangled and burned. Historians estimated that 500 murderers were executed. The ones managing to escape were mostly foreign sailors and merchants, who returned to their ships and sailed away. ==Related pages== * Babi Yar * Kristallnacht * Kraków pogrom * Jedwabne pogrom * Rhineland massacres ==References== Category:Pogroms Category:Massacres Category:History of Portugal Category:Antisemitism in Europe",
 "title": "Lisbon massacre"
}