{
 "id": "1182544",
 "text": "Schloss Ettersburg is a palace with a park. It is near Weimar, Thuringia, Germany. It is on the Ettersberg. It has been part of the Klassisches Weimar since 1998. The Klassisches Weimar is a World Heritage Site. == History == === Building === Schloss Ettersburg was built by Duke Wilhelm Ernst of Saxe- Weimar. He liked to hunt in the forests on the Ettersberg. The Ettersberg is a mountain range close to Weimar. The first building was built from 1706 to 1712. The \"Neues Schloss\" (New palace) was then built in 1722. Ernst's nephew, Duke Ernest Augustus, later changed the palace. From 1728 to 1740, he added an outside staircase. It is hard to know the history of the building, since the documents were destroyed in a fire.Heiko Laß: Jagd- und Lustschlösser des 17. und 18. Jahrhunderts in Thüringen. Michael Imhof Verlag, 2006, ISBN 3-86568-092-5, p. 298. In 2006, the building was restored. It was made into a hotel with a restaurant. It is used mostly by the Bauhaus Akademie Schloss Ettersburg. The Bauhaus Akademie Schloss Ettersburg is an academy. The building is also sometimes used for local events. For example, the Pfingst.Festival Schloss Ettersburg is in this building. It has 2 weeks of concerts and theater. This was founded in 2011. The palace and park was given the 2009 by the Federal Ministry for Digital and Transport. == Further reading == * Werner Deetjen: Auf den Höhen Ettersburgs. (= . 17). Verlagsbuchhandlung J.J. Weber in Leipzig, Leipzig o. J. um 1936. * H. v. Hintzenstern, J. Schüffler, P. Heller, H-D. Loew, E. Fischer: \"Fundamente\". Dreißig Beiträge zur Thüringischen Kirchengeschichte. Evangelische Verlagsanstalt, Berlin 1987, ISBN 3-374-00213-7. * Angelika Pöthe: Schloss Ettersburg. Weimars Geselligkeit und kulturelles Leben im 19. Jahrhundert. Böhlauverlag, Weimar 1995, ISBN 3-412-09094-8. * Angelika Schneider: Fürst Hermann von Pückler Muskau als Gartenkünstler in Weimar – Der \"Große Aushau\" auf dem Ettersberg. In: 2020/2, pp. 387–394. * Thomas A. Seidel, Justus H. Ulbricht, Heinrich-Dieter Hischer (ed.): Schloss Ettersburg. Ein Laboratorium europäischer Kultur. Glaux-Verlag, Jena 2006, ISBN 3-931743-98-5. * Günther Thimm: Die Allee von Weimar nach Ettersburg. Ihre Gestaltung durch Carl Eduard Petzold um 1845 im Sinne der Landesverschönerung. In: Die Gartenkunst. vol. 18, No. 2, 2006, pp. 331–337. * Werner Vollrath: Die Schlossanlagen bei Weimar. Naumburger Verlagsanstalt, 2010, ISBN 978-3-86156-205-4. == References == == Other websites == * Category:Parks in Europe Category:Palaces in Europe Category:1710s works Category:Buildings and structures in Thuringia",
 "title": "Schloss Ettersburg"
}