{
 "id": "1182311",
 "text": "The Trần dynasty () was one of the greatest royal families in the history of Vietnam. It ruled the kingdom of Đại Việt from 1225 to 1400, a golden age remembered for its powerful emperors, wise queens, brilliant generals, and heroic defense against invasions. The dynasty was founded by Trần Thái Tông, who came to power through a peaceful marriage alliance with the last princess of the Lý dynasty, Chiêu Thánh. With the help of the political mastermind Trần Thủ Độ, the Trần family rose from noble fishermen of Chinese descent to rulers of a mighty empire. The Trần dynasty became legendary for defeating not one, but three Mongol invasions led by the mighty Kublai Khan. Under the command of the great general Trần Hưng Đạo, the Vietnamese people defended their land with unmatched courage, using guerrilla tactics, naval battles, and the strength of unity. Many rulers of the Trần era were not just kings—they were poets, monks, and philosophers. Trần Nhân Tông is remembered as a wise king who later became a Zen Buddhist monk, founding the \"Trúc Lâm Zen School\" and guiding the country toward peace and inner balance after the wars. The women of the dynasty also played important roles. Empress Trần Thị Dung was a symbol of continuity and grace during the transition between the Lý and Trần dynasties. Princess Huyền Trân, known for her beauty and wisdom, was married to a king of Champa to secure peace—her story became a famous legend of sacrifice and diplomacy. The dynasty began to weaken in the late 14th century due to internal conflicts and corrupt rulers. In 1400, the last emperor, Trần Thiếu Đế, was forced to abdicate, ending 175 years of Trần rule. A short-lived restoration, known as the Later Trần dynasty, tried to revive the glory, but it too was defeated. Today, the Trần dynasty is honored in temples, literature, and the hearts of Vietnamese people, remembered as a time of heroism, learning, and spiritual depth. ==References== * * Category:Trần dynasty Category:Vietnamese royalty Category:Royal dynasties Category:13th century in Vietnam Category:14th century in Vietnam Category:Dynasties of Asia Category:History of Vietnam",
 "title": "Trần dynasty"
}