{
 "id": "1182291",
 "text": "Lil’ Kev is an adult animated sitcom created by Matthew Claybrooks and Michael Price for BET+. It aired on March 6th, 2025. == Plot == In 1993 North Philly, 12-year-old Kevin faces tough neighborhood life with boundless optimism. His mom works nights, his brother's a troublemaker, his dad wants back in, and his uncle gives dubious advice - but Kev keeps hustling. == Characters == === Main === * Kevin Darnell Hart (voiced by Kevin Hart) is the 12-year-old younger animated version of the person with the same name. His confidence, imagination and constant daydreaming drive him to attempt insanely lofty goals, most of which he fails at miserably. * Nancy Hart (voiced by Wanda Sykes) is Kevin’s overprotective and busy mother. She works at the hospital as a nurse. She’s alost intimidating, quick to ass-whooping, and God-fearing, as she works tremendously hard to pay the bills and put food on the table. * Henry Hart (voiced by Gerald “Slink” Johnson) is Nancy’s ex-husband and Kevin’s father, who had a troubled past tainted by addiction, which caused his vices to doom his relationship with Nancy. * Uncle Richard Jr. (voiced by Deon Cole) is Nancy’s younger brother and Kevin’s parental uncle. He tries his best to stay clear of the crime scene because he respects his family and deep down is a little scared of his big sister. === Recurring === * Robert Hart (voiced by Jamar Neighbors) is Kev’s 16-year-old “glass half-empty” older brother, who calls him “Negative Ned”, due to him constantly shitting all over his dreams and covers up his shitting-overs with the catch-all excuse that he’s “just keeping it real.” Robert is a hustler who’s all about making cash money. * Rhe Rhe (voiced by Wé Ani) is the object of Kevin’s affection. Rhe Rhe is super cute, super sweet, and super smart. She’s never received anything lower than an A on her report card. Her goal is to be a brain surgeon one day. * Omar & Darnell (voiced by Jayden Libran & Affion Crockett) are Uncle Richard Jr.’s boys from prison. Omar met his cellmate Darnell, and then became lovers, though they most definitely do not fit the stereotype of gay men. * Chin-Check (voiced by Justin Hires) is Kevin’s arch-nemesis and the school bully. Chin Check robs people for sport and he chin checks fools as a form of greeting, as his name implies. Chin Check struggles with a learning disability and is just starting to learn how to read. == Episodes == ===Season 1 (2025)=== Category:Sitcoms Category:Adult animated television series",
 "title": "Lil’ Kev"
}