{
 "id": "1182867",
 "text": "Sunset Paradise is an Australian-American computer-animated web series created by Luke Lerdwichagul and Kevin Lerdwichagul, produced and animated by Glitch Productions and funded by Screen Australia for YouTube. The series is a spinoff of SMG4, which focuses on Meggy Spletzer, a character from SMG4, who takes a vacation to find the calling she needs, and also fights a variety of criminals and her inner demon, Shadow Meggy. The pilot was released on March 26, 2021, and more episodes were released weekly starting on June 4, 2021, with the final episode concluding the series on July 30, 2021. == Characters == === Main === * Meggy Speltzer (voiced by Lizzie Freeman) is an inkling- turned human and the main protagonist of the series. She goes on a vacation to Port Aurora to figure out what to do next in life, while also helping to fight criminals on the island. Freeman reprises her role as Meggy from SMG4. * Auri Bori (voiced by Aimee Smith) is the secondary protagonist of the series, who is a young inept, but well-intentioned Aura Bora who is the self-proclaimed deputy of Port Aurora. In the penultimate episode, he sacrificed himself to save Meggy from the laser shot by Benedict at the top of the tower, but was later revived in the series finale. * Mayora Bora (voiced by Jasmine Yang) is the tritagonist of the series. He is the mayor of Port Aurora. In “Mad Meggy”, he was ultimately killed by the Funky Fource when he sacrificed himself to save Meggy and Auri. === Villains === * Benedict Cumbersnatch (voiced by Edwyn Tiong) is the main antagonist of the series. He is the crime boss of Port Aurora's criminal underworld who, after a confrontation with Auri's grandfather which resulted in the latter’s death, Benedict was cursed to be reduced into an egg-shaped form, forcing him to rely on the Goonies, alongside the Spud Buds, Whisk, and the Funky Fource. He wants to utilize Aloysius's ashes to bring him back to his original form, gain the Phoenix Egg to harness its power, and rule Port Aurora. However, he is defeated for good by Meggy and Auri. * The Spud Buds (voiced by Kevin Lerdwichagul, Luke Lerdwichagul & Jasmine Yang) are major antagonists in the series. They are a gang of anthropomorphic potato bandits terrorizing Port Aurora and contribute to the crime occurring on the island, and are under the command of Benedict. Their names are Yam, Mash, Duke, & Russet. * Whisk (voiced by Amber May) is the secondary antagonist in the series. She is a world-class cat thief who's always brimming with confidence and skill, whenever she's wearing her mask, that is. Without it, she turns into a literal scaredy-cat, and is under the command of Benedict. * The Funky Fource (all voiced by Anthony Sardinha) are major antagonists in the series. They are a “funkalicious foursome of crime- fighting superheroes” who crush evil through the power of dance...or so they claim. In truth, they're frauds who harbor a dark secret behind their acts of derring-do, and are under the command of Benedict. After the fall of benedict, they are forced to fix the damage they caused. Their names are Frank Fresh, Freddy Fresh, Felix Fresh & Phil Fresh. * Goonies - The recurring antagonsists of the series. They are silent, hulking Aura Boras serving under Benedict's whim as his army of henchmen. They are now working as ice-cream vendors with Aziz. * Shadow Meggy (voiced by Lizzie Freeman) is one of the two overarching antagonists of the series. She is a mysterious entity and the dark counterpart of Meggy, who exists in her subconscious mind, serving as the manifestation of her negative thoughts and emotions, and the reason Meggy is even visiting Port Aurora in the first place. * Froy and Doy Maloy (both voiced by Anthony Sardinha) are two minor antagonists in the series. They are a pair of big time magician brothers in Port Aurora who love to con and scam their way to the top. They also owned a pet tiger as their guard named Tig Tig. They only appear in episode 4. === Supporting === * Aziz Youshi (voiced by James Bailey) is a Arab-American ice cream vendor in Port Aurora, who pretends that he is happy with his customers, but in fact he is very unhappy to serve customers and instead, rather unenthusiastic and grumpy. * Chet (voiced by Anthony Sardinha) is a room cleaner of Hotel Aurora, who has some feelings toward Whisk. * Aloysius Bori (voiced by Jason Marnocha) is the posthumous overarching protagonist of the series. He was Auri's late Grandfather and the previous sheriff of Port Aurora, who was murdered by Benedict, but not before cursing him into his current form. == Episodes == === Season 1 (2021) === All episodes were written by Jasmine Yang & Jasper Marlow (except for the pilot), and directed by Luke Lerdwichagul. Category:Animation Category:Television Category:Glitch Productions",
 "title": "Sunset Paradise"
}