{
 "id": "1182365",
 "text": "Kashish Khan (born 2 June 1989) is an Indian film producer, director, writer, and actress. She is the founder and director of \"Kashish Khan Production Private Limited Company\". With a career spanning film production, direction. == Early Life and Background == Kashish Khan was born on 2 June 1989 in Faridabad, Haryana, India. She comes from a family with a strong background in social work and politics. Her mother, Basiri Khan, is an Indian politician and social worker who also serves as the director of Kashish Khan Production Private Limited Company and runs the NGO Jan Sewa Sanghthan, which focuses on public welfare. Her father, Late Pahalwan Paltu Khan, was from Kot Mewat, Haryana. == Career == * Mystery of Tattoo (2023) – A suspense thriller starring Arjun Rampal, Daisy Shah, Myraa Sareen, and Rohit Raaj. * Riwaj (2024) – A socially relevant drama addressing the issue of triple talaq, featuring Aftab Shivdasani, Myraa Sareen, Mithun Chakraborty, Adhvik Mahajan, Jaya Prada, Anita Raj, and Ashwani Kapoor. * Second Chance – Starring Arjan Bajwa, Myraa Sareen, Tanisha Mukherjee, Iulia Vântur, and Zakir Khan. * Puniya Ki Duniya – Starring Jimmy Sheirgill, Elli AvrRam, Poonam Dhillon, Sharad Saxena, Kiku Sharda, and Shelly. === Upcoming Dream Project === Kashish Khan is currently working on an ambitious historical horror-biopic film on a grand scale. The project aims to redefine Indian cinema with high-end visual effects and a compelling narrative. === Acting Career === Before entering film production, Kashish Khan won the title of Miss Faridabad, which led to her success in the Miss Delhi pageant. Her achievements in the beauty industry paved the way for her acting career. She appeared in: * Bombay to Goa – A comedy film featuring Sunil Pal, Raju Srivastava, and other comedians. * Barber – Starring Soham Shah. === Brand Ambassador === Between 2019 and 2022, Kashish Khan served as the Brand Ambassador of South Korea for beauty and health products. She also represented the T10 Cricket League as its brand ambassador. === Writing and Creative Contributions === Kashish Khan actively participates in scriptwriting and creative development for her films, ensuring that each project under her banner aligns with her artistic vision. == References == Category:Living people Category:1989 births Category:Indian movie producers Category:Indian movie directors Category:Indian movie actors Category:People from Haryana",
 "title": "Kashish Khan"
}