{
 "id": "1182328",
 "text": "Monique Adolphe (born July 23, 1932) was a French scientist and pharmacist.Andrew Worth, Michael Balls, Robert Combes. The History of Alternative Test Methods in Toxicology. (2018). United Kingdom: Academic Press. P.41 She was one of the first people to figure out how to use cell culture methods for pharmacotoxicology. Pharmacotoxicology is the testing of drugs to find out if they are toxic and what their effects can be. A cell culture is a group of cells under controlled growth. She was also a pioneer of pharmacotoxicology using in vitro techniques. In vitro means in glass, or in test tubes. She helped figure out how to test drugs that could be toxic on cell cultures instead of on a human or an animal. She was the president of the EPHE Cellular Pharmacology Laboratory. She was the first woman to hold this position. She founded the Society of Cellular Pharmacotoxicology. She was the president of it for 10 years. She was an officer in the Order of the Legion of Honor and a Commander in the National Order of Merit in France. She was also a member of the Royal Academy of Belgium and the Royal Academy of Spain. == Early Life: == She was born in Paris, France, on July 23, 1932. Her father was a pharmacist. == Career: == She started her career as an intern at a hospital in Paris. She got a doctorate in cell biology sciences. She became director of studies at the EPHE Cellular Pharmacology Laboratory in 1974. She became president of the EPHE in 1990. She was the first woman to be in this position. She was also the director of the cellular pharmacology laboratory, a laboratory that the EPHE created for her. Monique Adolphe was one of the pioneers of using cell cultures to test drug toxicity. A human cell culture is a group of human cells under controlled growth, not attached to a human body. With the use of human cell cultures, pharmacists can test possibly harmful drugs on cell cultures instead of on humans. She founded the Society of Cellular Pharmacotoxicology. She was president of it for 10 years. She was a member of the European Society of Tissue Culture. She then became the president of it from 1985 to 1987. She represented France at the ECVAM (European Center for the Validation of Alternative Methods) from 1992 to 1997. She co-founded the French Society of Cellular Pharmacotoxicology. She chaired the National Academy of Pharmacy in 2009. She was the first woman to hold this position since 1803. She was a member of the National Academy of Medicine. She became a full member in 2001, also becoming the first female pharmacist in the company. == Death: == She died in Paris, France on June 27, 2022. == References == Category:Pages created with the Article Wizard from 2025",
 "title": "Monique Adolphe"
}