{
 "id": "1182523",
 "text": "Amateur geology, by the book, is a nonprofessional study. It consists of rock collecting, forgery, and fossicking. Heavily popular in Australia, the amateur geologists founded companies around it, bringing knowledge on the topic around the world. Perchance, a person to bring rocks to the United States would, introduce new people to specimens of new geological rocks. For the types of amateur geology can vary, it can be connected to the Neutron star. Amateur geology attracts hobbyists with diverse interests. Some are interested in the aesthetics and science of rocks and minerals, others enjoy outdoor exploration and fossil hunting. The field is accessible to people of all ages and often serves as an introduction to broader scientific curiosity and environmental awareness. Many amateurs pursue geology for personal enjoyment, education, or as part of a club or society. With the availability of online resources, smartphone apps, and portable identification tools, learning about geology outside of formal institutions has become increasingly accessible. Amateur geology originated with Isaac Newton who would look in his backyard for rocks. He is a physicist and didn't know much about geology so he read books about it to gain his knowledge. This is how amateur geology got its name. Amateur meaning a person without a proper degree, nor education. Of course, geology just means geology the study of rocks. How to start amateur geology? Amateur geology is a hobby that is for everyone. It does not require a lot of money nor a lot of knowledge. This hobby can help you better learn the world around you. First thing to do is read books on geology. Now go on rock hunts. Go around your local area and find some VERY COOL ROCKS. There are three types of rocks. First off are igneous rocks which is when molten rock cools down and solidifies. Next we have sedimentary rocks, these suckers are formed when previous rocks and dead organisms come onto Earth's surface. After a very long time, they are buried deeply and become compacted. Lastly, metamorphic rocks are formed by changes in heat and pressure. Now with your basic understanding and some rocks collected you need tools. Start off with a magnifying glass, handpick, pen, and paper. You can use these tools to look into how the rock is formed. A rock star pun intended Amateur geologist Harry Young has collected rocks for over 30 years. He decided to create a \"geologically correct and aesthetically pleasing\" map. After four long years, he finished it and his family framed it so it could be put up on a wall. Young wanted it to go viral so he made a plea which worked. This got the map nearly five millions views which is almost Scotland's whole population! ==References== https://incrediblethings.com/education/science/want-to-get-into-amateur- geology-heres-how-to-start/ https://www.amnh.org/exhibitions/permanent/planet- earth/how-do-we-read-the-rocks/three- types#:~:text=There%20are%20three%20kinds%20of,They%20accumulate%20in%20layers. https://www.nps.gov/subjects/geology/sedimentary.htm#:~:text=Sedimentary%20rocks%20are%20formed%20from,and%20cemented%2C%20forming%20sedimentary%20rock. Category:Geology Category:Collecting",
 "title": "Amateur geology"
}