{
 "id": "1182898",
 "text": "Tamara Beccam Mello (born 1976) is an American actress. She is of Mexican descent on her mother's side and Portuguese Azorean and French descent on her father's side. ==Career== Her career began in 1993 with appearances on various television programs and films. She has appeared in the TV series 7th Heaven, Boy Meets World, and Diagnosis: Murder and in the films The Brady Bunch Movie and She's All That. In 1999, she appeared in the TV series Popular as Lily, the politically correct vegetarian. Following 2 seasons on Popular Tamara continued to work in theater, film and television before taking several years off to raise her daughter. She returned to acting and worked sporadically, limited to mainly guest appearances on television shows such as the pilot for the comedy Worst Week and a 2013 episode of The Mentalist, and she now lives in Los Angeles. In January/February 2009, she also appeared in T-Mobile Blackberry Pearl Flip television commercials alongside Danny Pudi campaigning against \"butt-dialing\". == Filmography == === Film === Year Title Role Notes 1993 Dial S Woman 1995 Stacy 1995 Tom and Huck Townspeople 1996 Scorpion Spring Girl in Alley 1997 Infidelity/Hard Fall Lola 1997 Consuela 1998 Get a Job Rachel/Con Artist 1998 Overnight Delivery Marita 1999 Carlo's Wake Gwen Brock 1999 She's All That Chandler 2000 Spanish Judges Mars Girl 2000 Rave Nette 2001 Tortilla Soup Maribel Naranjo 2002 Scream at the Sound of the Beep Tori 2004 Clean Audrey === Television === Year Title Role Notes 1996 7th Heaven Tia Jackson Episode: \"Now You See Me\" 1997 Diagnosis Murder Maria Moreno Episode: \"Blood Brothers Murder\" 1997 Boy Meets World Sherri Episode: \"Cult Fiction\" 1997–1998 Nothing Sacred Rachel 20 episodes 1999 Zoe Angela Episode: \"Everything You Wanted to Know About Zoe\" 1999–2001 Popular Lily Esposito 43 episodes 2002 Miss Miami TV movie 2003 Toni Delgado TV movie 2004 JAG Elisa Cumpeano Episode: \"Good Intentions\" 2004 Strong Medicine Dr. Burke Episode: \"Life in the Balance\" 2004 Hawaii Episode: \"Almost Paradise\" 2004 What I Like About You Nikki Episode: \"We'll Miss Gittle a Little\" 2007 Psych Amanda Episode: \"From the Earth to Starbucks\" 2008 Worst Week Nicky Episode: \"Pilot\" 2013 The Mentalist Lily Soto Episode: \"Red Letter Day\" ==References== ==Other websites== * *Official facebook Page Category:Living people Category:1976 births Category:American people of Portuguese descent Category:Actresses from Orange County, California Category:American child actresses Category:American movie actors Category:American television actors",
 "title": "Tamara Mello"
}