{
 "id": "1182337",
 "text": "Mary Elliott Hill (January 5, 1907) was one of the first African American female chemists in the United States.Warren, W. (1999). Black women scientists in the United States. United Kingdom: Indiana University Press. p. 114-115. Retrieved from https://www.google.com/books/edition/Black_Women_Scientists_in_the_United_Sta/75bnncOVqEIC?hl=en&gbpv;=1&dq;=Mary%20Elliott%20Hill%20ketene%20synthesis&pg;=PA114&printsec;=frontcover. Retrieved 2025-04-14. Hill’s research played a major role in the development of plastics.Brown, J. (2012). African American Women Chemists. United Kingdom: Oxford University Press, USA. p. 29-33. Her research focused on ketene synthesis. Ketene synthesis is the process of making a chemical called ketene, where you combine different chemicals. She earned her Bachelor of Science from Virginia State College Laboratory School in 1929. Hill also did research in ultraviolet spectrophotometry and worked in organic and analytical chemistry. Ultraviolet spectrophotometry is a technique that analyzes how materials absorb visible light. It helps provide information about their composition and concentration. Her work in ultraviolet spectrophotometry helped develop methods that allowed more precise tracking of progress in chemical reactions.Smith, M. B. (2022). Organic Chemistry: An Acid-Base Approach, Third Edition. United States: CRC Press. p. 10. Retrieved from https://www.google.com/books/edition/Organic_Chemistry/xxmbEAAAQBAJ?hl=en&gbpv;=1&printsec;=frontcover&bsq;=Mary%20Elliott%20Hill%20ultraviolet%20spectrophotometry. Accessed on 2025-04-14. When Hill became a teacher, she had a big influence on her students, which made her part of the top six chemistry teachers in the United States and Canada. In her later years, she returned to Virginia State College and taught chemistry at the college level. Also, Hill worked on her master’s degree in analytical chemistry at the University of Pennsylvania. For six years, she was an instructor in chemistry at a high school, but in 1950, there were racial barriers that kept blacks from finding employment in the chemical industry. She also encouraged other African American women to pursue STEM careers. Additionally, she created student chapters of the American Chemical Societies at schools where she taught.American National Biography. (1999). United Kingdom: Oxford University Press. V.10, p. 796. Hill was a member of the Alpha Kappa Alpha National Honor Society, the Tennessee Academy of Science, and the National Institute of Science. Throughout her career, Hill wrote several textbooks with her husband and co-authored more than 40 scientific papers. She died in Frankfurt, Indiana, in 1969 and was buried in Norfolk, Virginia. == References == Category:Pages created with the Article Wizard from 2025",
 "title": "Mary Elliott Hill"
}