{
 "id": "1182367",
 "text": "The Meitei people (), also known as the Manipuris (), originating from the northeastern Indian state of Manipur and parts of Bangladesh with Meitei population, constitute a small but growing diaspora in Australia. Migration to Australia began in the late 20th and early 21st centuries, primarily for purposes of higher education, skilled employment, and family reunification. Concentrated in urban centers such as Sydney, Melbourne, and Brisbane, the Meitei community maintains aspects of its linguistic, cultural, and religious traditions while adapting to the sociocultural environment of Australia. Community organizations and informal networks support cultural continuity and social integration within the broader multicultural framework of the country. The Australian Meitei diaspora comprises individuals across different generational cohorts, including established residents who have lived in Australia for over a decade, as well as recent arrivals such as international students. The community is characterized by a dual sense of belonging, maintaining cultural and social connections to their place of origin in India while adapting to life in Australia. == Cinema == In October 2017, the Meitei language film Loktak Lairembee (Lady of the Lake) received two nominations for the 11th Asia Pacific Screen Awards (APSA) in Brisbane. The Meitei language film Boong was awarded Best Youth Film, in the 17th edition of the Asia Pacific Screen Awards, held in 2024 in Gold Coast, Queensland, Australia, following the four-day Asia Pacific Screen Forum. == Clothing == Meitei women in Australia commonly wear traditional attire consisting of the phanek (), a wraparound skirt, paired with the innaphi (), a lightweight shawl draped over the upper body. This clothing style reflects customary dress practices of the Meitei community from northeastern India. == Cuisines == Meitei cuisine in Australia features traditional dishes such as eromba, a preparation made by mashing fermented fish with boiled vegetables and chillies; ooti, a stew of peas cooked with alkaline water and regional herbs; and singju, a salad composed of raw or lightly blanched vegetables mixed with fermented fish or other condiments. These dishes are typically prepared within domestic settings and community events, reflecting culinary practices of the Meitei community. Traditional Meitei dishes such as Iromba, Utti, Sareng Thongba, Ataoba Thongba, and Singju are prepared within the Australian Meitei diaspora using ingredients consistent with their traditional culinary practices. Fermented fish (Ngari) continues to be a central element in many preparations. A variety of indigenous herbs and vegetables, including Pan, Yendem, Komprek, Hawai Maton, Pullei, Uyyen, Yennam Nakkuppi, Koli Hawai, Hawai Asangbi, and Hungam, are also used, either cultivated locally or obtained through import channels, reflecting an effort to maintain traditional foodways in a diasporic context. During Meitei festivals in Australia, traditional Meitei foods such as ngatoi (fish curry), ooti (greens and lentil curry), singju (a salad spiced with perilla seeds, fermented fish, and ghost pepper), keli channa (chickpea preparation), and laphutharo eromba (a dish made with banana flower) are prepared and consumed by the Meitei community. == Dance and music == Louise Lightfoot played a significant role in contextualizing Meitei dance () for Australian audiences, aiming to ensure it was understood as a sophisticated and culturally grounded art form rather than interpreted through racialized or exoticized frameworks. She supported young Manipuri performers, including Ibetombi, by presenting their work within an informed, scholarly context. Lightfoot studied Manipuri dance through a range of academic sources, including Bejoy Punchalee: History of Manipur, Parts 1 and 2 by Mutua Jhulan Singh; Faubion Bowers’ Dance and Opera in Manipur; Haobam Kulabidhu Singh’s Manipuri Dances, Manipuri Raasas, and The Art of Manipuri Dances; and Jyotirmoy Roy’s History of Manipur. Drawing on these texts, Lightfoot prepared explanatory notes that outlined core features of Manipuri dance. These included an understanding of the performance space as sacred, the ritualistic and devotional character of the dance, the deliberate absence of emotions such as lust, greed, anger, envy, hatred, and pride, and the use of modest costuming intended to prevent sexualized interpretations. Lightfoot’s efforts contributed to the reception of Manipuri dance as a serious artistic practice in Australia. A review published on 15 February 1957 described the Maibi Jagoi dance () as previously unseen by Australian audiences and noted the combination of technical precision and expressive grace in the performances. The review emphasized the dancers’ ability to convey narrative through gesture, rhythm, and movement, and remarked that even viewers unfamiliar with Indian classical dance could discern the meanings embedded in the choreography. Lightfoot observed that while vocal narration was customary in India, its absence in the Australian context did not substantially diminish the traditional elements of the performance. A Journey of Manipuri Dance was a performance held in Melbourne, Australia, from 14 to 16 February 2014, featuring Sinam Basu Singh. The event focused on Manipuri dance, a classical dance form originating from the Indian state of Manipur. It aimed to present the traditional movements, techniques, and cultural significance of Manipuri dance to an international audience. == Fashion == During the 2018 Eco Fashion Week Australia (EFWA), Robert Naorem, a designer of Meitei heritage, presented a collection as part of the EFWA UpCycling Challenge on Day 4 of the event, held on 19 November. The showcase, titled Fashion Archaeology, incorporated elements of Meitei cultural heritage within the framework of sustainable fashion practices. Naorem's collection was constructed using upcycled materials, including thrifted garments, handmade pieces, and recycled textiles. The designs drew inspiration from Meitei historical and cultural symbols associated with Manipur, particularly the traditional inaphi, a draped shawl worn by Meitei women, known for its distinctive motif work. The garments utilized handloom textiles, organic silks, and cottons, produced by artisanal weavers in Manipur. The collection featured embroidered representations of culturally significant symbols such as the Sangai (Rucervus eldii eldii), Kangla Sha (a mythological guardian figure), Pung Cholom (a traditional drum dance), Meitei Mayek (the indigenous Meitei script), and the Nongin (a bird species with symbolic relevance in Manipur). The design aesthetic emphasized bold colors and detailed craftsmanship. The runway presentation was accompanied by music based on Meitei folk traditions, composed by Thiyam. The event concluded with a visual emphasis on vibrant, jewel-toned garments, marking the final segment of EFWA 2018. The presentation served as an example of the integration of indigenous cultural elements with environmentally conscious design in a diasporic context. == Festivals == === Cheiraoba === The Australian Meitei diaspora observes Cheiraoba () in cities such as Melbourne and elsewhere. Cheiraoba marks the beginning of the traditional Meitei New Year in the Indian state of Manipur. The observance typically involves domestic rituals, preparation of specific ceremonial foods, and communal activities that reflect customary practices associated with the Meitei lunar calendar. === Ningol Chakouba === Ningol Chakouba (), a festival celebrated to strengthen the bond of love between married women and their paternal families, is also observed by the Meitei diaspora in Australia. Sometimes, it was cancelled due to COVID-19 pandemic. == Facing racism == Instances of racialized interpretations of Meitei culture in Australia have been documented in historical media coverage. In an article published in The Sydney Morning Herald on 13 June 1957, a writer identified as R.R. described the Manipuri dancer Ibetombi in racialized terms, referring to her as belonging to the \"Mongolian\" race. The writer drew parallels between her performance and what he termed \"Mongolian art,\" characterizing it with language suggestive of primitivism and exoticism. This depiction was publicly challenged by David K. Cleaver, a supporter of Indian classical dance, who submitted a letter to the editor published the same day. Cleaver criticized the racial classification as inaccurate, arguing that there is no singular concept of \"Mongolian art or dance.\" He noted that while some Southeast Asian cultures had borrowed artistic influences from the north, their aesthetic traditions were more closely aligned with those of the Indian subcontinent than with East Asian cultures such as Korea or Japan. Cleaver further condemned the racial framing of cultural expression as a remnant of 19th-century pseudo-scientific theories. The categorization of regions such as northeast India within a so- called \"Mongolian Fringe\"—a term used by Olaf Caroe, former Foreign Secretary to the British-Indian government—has historically contributed to a racialized perception of indigenous and tribal communities. This classification has often led to cultural stereotyping, social marginalization, and discriminatory attitudes toward people from these regions. In contrast, figures such as Lightfoot sought to present Meitei dance in Australia through a more scholarly and culturally informed lens. Drawing on academic sources—including works by Mutua Jhulan Singh, Faubion Bowers, Haobam Kulabidhu Singh, and Jyotirmoy Roy—Lightfoot produced detailed explanatory notes for performances. These emphasized core characteristics of Manipuri dance, such as its ritualistic and devotional nature, the sacred symbolism of the performance space, the emotional restraint embodied by the dancers, and the use of modest costumes to prevent misinterpretation of the performance's intent. == Related pages == * Meitei people in Canada * Meitei people in the United Kingdom * Meitei people in the United States * Meitei people in Bangladesh * Meitei people in Myanmar * Meitei people in Assam * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura == Bibliography == * == References == Category:Meitei people Category:Australian people",
 "title": "Meitei people in Australia"
}