{
 "id": "1183547",
 "text": "Sigurd Rosted (; born 22 July 1994) is a Norwegian professional footballer who plays as a centre-back for Major League Soccer club Toronto FC and the Norway national team. Described as a calm and intelligent centre-back with leading abilities, Rosted began his career in his native Norway and made the move to Belgian Gent in January 2018 before making the move to Brøndby one and a half years later. He won the Danish Superliga with Brøndby in 2021, before joining Toronto FC in Major League Soccer in January 2023. Rosted is an international for Norway, receiving his first call-up in 2017 and gaining his first international cap in 2018 in a friendly against Albania, in which he also scored a goal. In 2017, he was called up to the Norway national team for the first time in his career, as a replacement for injured Tore Reginiussen before the friendly match against Sweden on 13 June. He played his first international match on 26 March 2018 in a friendly against Albania, scoring the only goal in a 1–0 win. He had been substituted in for Håvard Nordtveit in the 63rd minute. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Kjelsås 2012 Norwegian Second Division 21 2 2 0 — — 23 2 2013 Norwegian Second Division 26 2 1 0 — — 27 2 2014 Norwegian Second Division 24 5 1 0 — — 25 5 Total 71 9 4 0 — — 75 9 Sarpsborg 08 2015 Eliteserien 1 0 0 0 — — 1 0 2016 Eliteserien 23 3 3 0 — — 26 3 2017 Eliteserien 27 4 5 0 — — 32 4 Total 51 7 8 0 — — 59 7 Gent 2017–18 Belgian Pro League 8 0 0 0 — — 8 0 2018–19 Belgian Pro League 29 5 3 1 4 0 — 36 6 2019–20 Belgian Pro League 0 0 — 1 0 — 1 0 Total 37 5 3 1 5 0 — 45 6 Brøndby 2019–20 Danish Superliga 25 1 1 0 — — 26 1 2020–21 Danish Superliga 23 3 2 0 — — 25 3 2021–22 Danish Superliga 26 1 3 0 7 0 — 36 1 2022–23 Danish Superliga 10 0 1 0 3 0 — 14 0 Total 84 5 7 0 10 0 — 101 5 Toronto FC 2023 Major League Soccer 21 0 1 0 — 2 0 24 0 2024 Major League Soccer 25 0 3 0 — 1 0 29 0 2025 Major League Soccer 7 1 0 0 — 0 0 7 1 Total 53 1 4 0 — 3 0 60 1 Career total 296 27 26 1 15 0 3 0 340 28 ===International goals=== :Scores and results list Norway's goal tally first. No. Date Venue Opponent Score Result Competition 1\\. 26 March 2018 Elbasan Arena, Elbasan, Albania 1–0 1–0 Friendly ==Honours== Brøndby * Danish Superliga: 2020–21 ==References== ==External links== * MLS profile * Sigurd Rosted at Brøndby IF * Category:1994 births Category:Living people Category:Toronto FC players",
 "title": "Sigurd Rosted"
}