{
 "id": "1183794",
 "text": "Sitaram Yechury (12 August 1952 – 12 September 2024) was a well-known Indian Marxist politician. He served as the General Secretary of the Communist Party of India (Marxist), also called CPI(M). He had been a member of the party’s top decision-making group, the Politburo, since 1992. Before becoming General Secretary, Yechury also worked as a Member of Parliament in the Rajya Sabha (the upper house of India's Parliament), representing West Bengal from 2005 to 2017. == Early life == Yechury was born on 12 August 1952 into a Telugu Brahmin family in Madras. His father Sarveswara Somayajula Yechury and mother Kalpakam Yechury were natives of Kakinada, Andhra Pradesh. His father was an engineer in the Andhra Pradesh State Road Transport Corporation. His mother was a government officer and lived in Kakinada till her death in 2021. Yechury grew up in Hyderabad, and studied at the All Saints High School, Hyderabad, till his tenth standard. The Telangana agitation of 1969 brought him to Delhi. He joined Presidents Estate School, New Delhi, and achieved the All-India first rank in the Central Board of Secondary Education Higher Secondary Examination. Subsequently, he studied B.A. (Hons.) in Economics at St. Stephen's College, Delhi, and M.A. in Economics, from Jawaharlal Nehru University (JNU), achieving first class in both. He joined the JNU for a Ph.D. in Economics, which was aborted with his arrest during The Emergency. == Political career == Yechury joined the Students' Federation of India (SFI) in 1974. A year later, he joined the Communist Party of India (Marxist). Sitaram Yechury was arrested in 1975 during the Emergency in India, a time when many political freedoms were suspended. At that time, he was a student at Jawaharlal Nehru University (JNU). Before being caught, he had gone underground to help organize resistance against the Emergency. After the Emergency ended, Yechury was elected President of the JNU Students' Union three times in one year (1977–78), showing how popular and active he was in student politics. Along with Prakash Karat, he helped form a leftist student group at JNU, which became influential in campus politics. Yechury was considered to uphold the coalition-building legacy of former general secretary Harkishan Singh Surjeet. He worked with P. Chidambaram to draft the common minimum program for the United Front government in 1996 and had actively pursued the coalition-building process during the formation of the United Progressive Alliance government in 2004 and Indian National Developmental Inclusive Alliance in 2023. Yechury was elected to Rajya Sabha from West Bengal in July 2005. He was known for bringing several popular issues to the notice of parliament and for raising questions on important issues. On blaming by the ruling party for frequent disruptions in parliament, he said that government cannot escape from its responsibility by blaming the opposition for frequent disruptions. He justified disruptions in parliament by calling it a legitimate process in a democracy. During the negotiations for the Indo-US Nuclear Pact, Yechury listed in the Rajya Sabha all the conditions that the CPM required of the agreement. After the Manmohan Singh government satisfied all the conditions, he was overruled by Prakash Karat, who claimed that the agreement still violated the CPM's idea of independent foreign policy. It was said that this left Yechury \"displeased and helpless\". == Personal life == Sitaram Yechury was married to Seema Chishti, a well-known journalist. She is the editor of The Wire, and she previously worked as the Delhi editor of BBC Hindi Service and as the Resident Editor of The Indian Express in Delhi. In an episode of ScoopWhoop, Yechury mentioned that his wife supported him financially. Before this marriage, he was married to Indrani Mazumdar, the daughter of feminist scholar Vina Mazumdar. He had two children from this earlier marriage — a daughter named Akhila and a son named Ashish. His daughter, Akhila Yechury, studied history and teaches at both the University of Edinburgh and the University of St. Andrews in the UK. His son, Ashish Yechury, sadly passed away on 22 April 2021 due to COVID-19 at the age of 34. Yechury’s maternal uncle was Mohan Kanda, an IAS officer who served as the Chief Secretary of Andhra Pradesh. == Illness and death == Yechury was admitted to the department of emergency medicine at AIIMS Delhi on 19 August 2024 and was put on respiratory support after his condition turned critical in September, according to a statement by the CPI(M). He displayed symptoms of a pneumonia-like chest infection and died on 12 September, at the age of 72, after suffering from an acute respiratory infection. His body was donated to AIIMS for teaching and research purposes by his family. == References == Category:Indian political writers Category:2024 deaths Category:1952 births",
 "title": "Sitaram Yechury"
}