{
 "id": "1183494",
 "text": "During 1915, an anti christian systematical genocide campaign was perperated by Committee of Union and Progress. The genocide was affected the demographics of Turkey. The campaign was ordered by Diyarbekir governor Mehmed Reshid, which supported by the CUP. ==Sources== *Gaunt, David (2006). Massacres, Resistance, Protectors: Muslim-Christian Relations in Eastern Anatolia During World War I. Gorgias Press. ISBN 978-1-59333-301-0. *Gaunt, David (2012). \"Relations between Kurds and Syriacs and Assyrians in Late Ottoman Diyarbekir\". Social Relations in Ottoman Diyarbekir, 1870-1915. Brill. pp. 241–266. ISBN 978-90-04-23227-3. *Gaunt, David (2013). \"Failed Identity and the Assyrian Genocide\". Shatterzone of Empires: Coexistence and Violence in the German, Habsburg, Russian, and Ottoman Borderlands (illustrated ed.). Indiana University Press. ISBN 978-0-253-00631-8. *Gaunt, David (2015). \"The Complexity of the Assyrian Genocide\". Genocide Studies International. 9 (1): 83–103. doi:10.3138/gsi.9.1.05. ISSN 2291-1847. *Gaunt, David (2017). \"Sayfo Genocide: The Culmination of an Anatolian Culture of Violence\". Let Them Not Return: Sayfo - The Genocide Against the Assyrian, Syriac, and Chaldean Christians in the Ottoman Empire. Berghahn Books. pp. 54–69. ISBN 978-1-78533-499-3. *Kévorkian, Raymond (2011). The Armenian Genocide: A Complete History. Bloomsbury Publishing. ISBN 978-0-85771-930-0. *Üngör, Uğur Ümit (2011). The Making of Modern Turkey: Nation and State in Eastern Anatolia, 1913–1950. Oxford University Press. ISBN 978-0-19-965522-9. *Üngör, Uğur Ümit (2017). \"How Armenian was the 1915 Genocide?\". Let Them Not Return: Sayfo - The Genocide Against the Assyrian, Syriac, and Chaldean Christians in the Ottoman Empire. Berghahn Books. pp. 33–53. ISBN 978-1-78533-499-3. *Suny, Ronald Grigor (2015). \"They Can Live in the Desert but Nowhere Else\": A History of the Armenian Genocide. Princeton University Press. ISBN 978-1-4008-6558-1. ==References==",
 "title": "1915 genocide in Diyarbekir"
}