{
 "id": "1183542",
 "text": "Samhita (सम्हिता IAST: Saṃhitā) translates to \"put together\" or \"joined\" and refers to a collection or systematic arrangement of verses or texts. It is the oldest part of the Vedas and includes mantras, hymns, prayers, litanies, and blessings.saMhita, Monier-Williams' Sanskrit-English Dictionary, Oxford University Press, page 1123Lochtefeld, James G. \"Samhita\" in The Illustrated Encyclopedia of Hinduism, Vol. 2: N-Z, Rosen Publishing, , page 587 Parts of Vedic Samhitas constitute the oldest living part of Hindu tradition.Lochtefeld, James G. \"Samhita\" in The Illustrated Encyclopedia of Hinduism, Vol. 2: N-Z, Rosen Publishing, , page 587 == Word Meaning == \"Samhita\" is a Sanskrit word formed from \"sam\" (सम्), meaning \"together,\" and \"hita\" (हित), which comes from \"dhā\" (धा), meaning \"put.\" The word means \"joined, arranged, or united.\" It also refers to something that matches a principle like dharma (justice or duty) or is connected to it. In its feminine form, \"Samhitā\" (संहिता) is a noun meaning \"union,\" \"connection,\" or \"arrangement of texts or verses in a systematic way,\" and can describe how letters are combined according to sound rules. == Discussion == Samhita, in contemporary literature typically implies the earliest, archaic part of the Vedas. These contain mantras – sacred sounds with or without literal meaning, as well as panegyrics, prayers, litanies and benedictions petitioning nature or Vedic deities.Lochtefeld, James G. \"Samhita\" in The Illustrated Encyclopedia of Hinduism, Vol. 2: N-Z, Rosen Publishing, , page 587 Vedic Samhita refer to mathematically precise metrical archaic text of each of the Vedas (Rigveda, Yajurveda, Samaveda and Atharvaveda). The Vedas have been divided into four styles of texts – the Samhitas (mantras and benedictions), the Brahmanas (text on rituals, ceremonies, sacrifices and symbolic- sacrifices), the Aranyakas (commentaries on rituals, ceremonies and sacrifices), and the Upanishads (text discussing meditation, philosophy and spiritual knowledge). The Samhitas are sometimes identified as karma-khanda (कर्म खण्ड, action / ritual-related section), while the Upanishads are identified as jnana-khanda (ज्ञान खण्ड, knowledge / spirituality-related section).See to Brihad Aranyaka Upanishad, pages 1–5: The Aranyakas and Brahmanas are variously classified, sometimes as the ceremonial karma-khanda, other times (or parts of them) as the jnana-khanda. The Vedic Samhitas were chanted during ceremonies and rituals, and parts of it remain the oldest living part of Hindu tradition.Lochtefeld, James G. \"Samhita\" in The Illustrated Encyclopedia of Hinduism, Vol. 2: N-Z, Rosen Publishing, , page 587 Historically, there were five recensions of the Rigveda Samhita, but now only one survives. The Samaveda has three Samhitas, two of which are quite similar, while the Atharvaveda has two. The term \"samhita\" also appears in titles of some non-Vedic texts like the Pancharatra Samhitas and the Brhat Samhita, an astrological work, as well as in the Bhagavata Purana, which self- references as a samhita. == Examples == The Gayatri mantra is among the famous Hindu mantras. It is found in Rig Veda Samhita. > :ॐ भूर्भुवस्वः। तत्सवितुर्वरेण्यम्। भर्गो देवस्य धीमहि। धियो यो नः > प्रचोदयात् – Rig Veda 3.62.10 == References == Category:Vedas Category:Hindu texts",
 "title": "Samhita"
}