{
 "id": "1183708",
 "text": "Meitei people (), also known as the Manipuris (), mostly from the northeastern Indian state of Manipur, have a presence in Maharashtra, particularly in urban centers such as Mumbai, Pune, and Nagpur. Migration to the state has been influenced by factors such as access to higher education and employment opportunities. In these urban settings, Meitei communities have maintained aspects of their cultural identity, including the observance of traditional Meitei festivals, the use of the Meitei language, and the practice of indigenous art forms. While integrating into the broader socio-cultural landscape of Maharashtra, they continue to preserve elements of their ethnic heritage. == Calendar == The Annual Calendar for Nawa Marup Pune 2024 was released on January 28, 2024, during the Nawa Marup Annual Convention 2024, held at Coastal Bay Beach Resort, Saldure Beach, Dapoli, Maharashtra. == Cinema == Gun and a God, a documentary film directed by Sonia Nepram, was selected for the Mumbai Women's International Film Festival in 2013. The film, which marked Nepram's directorial debut, was initially released online on Vimeo on March 22, 2013, and later made available on YouTube. On May 29, 2022, the Mumbai International Film Festival (MIFF) commenced with the screening of the Meitei language documentary film Meiram – The Fireline, produced in Manipur. The 33-minute film documents forest conservation initiatives in the Punsilok region of the Langol Hills in Manipur. It was featured under the 'National Prism' category of the MIFF 2022 official selection. == Clothing == During the Thabal Chongba performance at the Yaoshang festival in Maharashtra, married women (mous) traditionally wore Phanek Mapal naiba paired with Wangkhei phi, while unmarried women (leishabis) typically wore phanek dresses. These traditional garments reflect the cultural attire of the Meitei community, which is an integral part of their customs during the festival. == Cuisine == Manipuri Black Rice Crispies, a type of homemade cracker made from black rice, is a notable food item found in Mundhwa, Pune. It is part of the regional Meitei culinary offerings available in the area. During Yaoshang, a variety of authentic Meitei snacks and dishes, such as Singju, Bora, Kanghou, Kelichana, Tharoi thongba, Nga thongba, and Eronba, were consumed by Meitei people in Pune, including fresh vegetables from Manipur, like Yongchak, Hawaimubee, and Yendem. During Cheiraoba, indigenous fresh vegetables, such as yongchak, ngari, and maroi, along with traditional Meitei dishes like nga thongba, makokmaru ngouba, uti, paan eronba, singju, heithongba, and kheer, are commonly consumed by the Meitei community in Pune, Maharashtra. During Ningol Chakouba festival, the male members of the Association of Manipuri Diaspora (AMAND), Pune, prepared a traditional Meitei feast, including dishes such as nga matum thongba, nga atoiba thongba, laphu iromba, singju, ooti, chak-hao kheer, and other customary Meitei delicacies. The meal was prepared specifically for the participating Ningols and their children, reflecting the cultural emphasis on hospitality and familial respect. == Dance and music == On February 1, 2014, a cultural program featuring traditional Meitei performing arts was held at Symbiosis International University, Viman Nagar Campus, Pune, Maharashtra. The event showcased a range of classical and martial art forms integral to Manipuri heritage. Performances included Maibi Jagoi, a ritual dance of priestesses; Thougal Jagoi, a devotional group dance; and Dhon Dholok Cholom, a percussive drum performance. Meitei martial arts demonstrations under the Thang Ta tradition were also presented, including dagger combat, sword and spear fighting, and sword-based choreography. Additional performances included the Stick Dance, Pung Cholom—a dynamic drum dance blending acrobatics and rhythm—and Basanta Ras, a classical devotional dance depicting themes from the Vaishnavite tradition. The program reflected a cross-section of Manipuri cultural expressions encompassing ritual, martial, and devotional forms. In Pune, Thabal Chongba, a traditional Manipuri folk dance, was a key feature of the Yaoshang festival, attracting participants of all ages, including children, youth, and senior citizens. The event also included a Tambola game, the distribution of prizes for the winners of the AMAND Step Challenge 2023, and a presentation of self-knitted Athenpot covers to the AMAND office bearers by Oinam Purnimashi Devi. == Festivals == === Ningol Chakouba === On November 20, 2022, the Association of Manipuri Diaspora (AMAND), Pune, organized the traditional Meitei festival Ningol Chakouba at the Don Bosco Youth Centre in Koregaon Park, Pune, following a two-year hiatus due to the COVID-19 pandemic. The festival, which emphasizes the strengthening of familial bonds between women (ningols) and men (pibas) through a shared traditional meal, was attended by approximately 400 individuals. Participants included members of the Tangkhul, Zeliangrong, Chiru, Khasi, Assamese, and Marathi communities, as well as Manipuri families from Mumbai and Ranjangaon. Guests arrived in their respective traditional attire, reflecting the cultural diversity present alongside Meitei traditional dress. During the Ningol Chakouba celebration organized by the Association of Manipuri Diaspora (AMAND), Pune, female participants (Ningols) arrived bearing athenpot—traditional offerings consisting of items such as kom kwa, kabok, sitamishri, laloo, and fruits—carried on their heads using sengas, in accordance with longstanding Meitei customs marking the beginning of auspicious occasions. Families from the Mumbai Manipuri Association (MMA) also participated, bringing athenpot for their AMAND counterparts. Following a communal feast, male members (pibas) of AMAND presented gifts to all attendees, including three visiting mothers, 105 married women (mous), and 110 unmarried women (leisabis). After receiving the gifts, the Ningols offered traditional blessings for prosperity, health, and well-being. The event also featured cultural and recreational activities such as live Meitei music performances, a tambola game, a selfie contest, and Thabal Chongba, a traditional Meitei folk dance. On November 7, 2021, the organization Nawa Marup, Pune, conducted the Ningol Chakouba festival at the Club House of Marvel Zephyr in Kharadi, Pune. The event was attended by invited guests from various localities in Pune, including participants from inter-community families. Among the attendees were women of Manipuri origin married into other communities such as Maharashtrian, Gujarati, Punjabi, and Assamese, reflecting the cultural integration and diversity within the diaspora community. On November 10, 2019, the Ningol Chakouba festival was held at the Don Bosco Youth Centre in Koregaon Park, Pune, with the objective of promoting unity, harmony, and goodwill among the Manipuri community. The event was attended by over 350 individuals, including approximately 90 married women (referred to as mous), 60 unmarried women (leisabis), and other community members. Attendees included Manipuri families from Pune as well as those from nearby cities such as Mumbai and Kolhapur, reflecting the wider participation of the Manipuri diaspora in the region. On November 18, 2018, the Association of Manipuri Diaspora (AMAND), Pune, a registered non-profit and non-governmental community organization established by working and retired professionals from Manipur residing in and around Pune, organized the traditional festival Ningol Chakouba. The event was held at the Sonawane Sainik Institute in Wanorie, Pune, with the objective of promoting unity, harmony, and goodwill between brothers and sisters within the Manipuri community. The program was attended by over 350 individuals, including approximately 100 married women, 80 unmarried women, 75 children, and 100 men, representing various ethnic communities of Manipur living in Pune and neighboring areas. Families from other cities, including Mumbai, also participated. In accordance with tradition, the Ningols arrived in traditional Manipuri attire, carrying athenpot—ceremonial gift baskets presented to their brothers as part of the customary observance. === Yaoshang === On March 25, 2023, the Association of Manipuri Diaspora (AMAND) organized the Yaoshang festival at the Don Bosco Youth Centre in Koregaon Park, Pune. The event was held to observe and promote the cultural traditions of the Meitei community. === Sajibu Cheiraoba === On April 26, 2019, the AMAND Ladies' Club, the women's wing of the Association of Manipuri Diaspora (AMAND) Pune, organized the Sajibu Cheiraoba-2019 celebration on April 21 at the NCL Community Centre, Pashan Road, Pune. The event aimed to promote and preserve the socio-cultural traditions of Manipur. Around 250 attendees from Pune and Mumbai participated. The event featured the presentation of Khudol pots (gifts) to brothers by the Ladies' Club members as part of the tradition. It also included entertainment activities such as chafu thugaibi, chandon thinba without mirror, and bumper housie. Stalls were set up offering indigenous fresh vegetables like yongchak, ngari, and maroi, along with traditional clothing. Additionally, the winners of the 2018 Ningol Chakouba Selfie Contest were recognized, and various lucky draws were held. On April 10, 2022, the AMAND Ladies' Club (ALC), a women's wing of the Association of Manipuri Diaspora (AMAND) Pune, organized the traditional festival Shajibu Cheiraoba 2022 at the Don Bosco Youth Centre in Koregaon Park, Pune. The event aimed to preserve and promote the sociocultural heritage of Manipur while fostering unity and coexistence among the Meitei diaspora in Pune. The celebration, marking the transition from the old year to the new year, was attended by around 200 individuals from various Manipuri families and communities in Pune, as well as from Mumbai, Talegaon, and Ranjangaon. Participants, including women, men, and children, wore traditional Meitei attire, reflecting the cultural significance of the event. === Nupi Lal commemoration === On December 15, 2024, AMAND Pune organized the 85th Nupi Lal Memorial Function at the MCCIA Auditorium in Hadapsar, Pune. The event commemorated the women of Manipur who participated in the Nupi Lal (Women’s War) against British colonial authorities, protesting against repressive and discriminatory policies. On December 14, 2022, the Association of Manipuri Diaspora (AMAND), Pune, observed the 83rd Nupi Lan Memorial Day. The commemoration paid tribute to the women of Manipur who led the Nupi Lan (Women's War) against British colonial authorities in resistance to discriminatory and exploitative policies. Members of AMAND, along with their families, participated in the event to honor the historical significance and legacy of the movement. On December 12, 2021, the Association of Manipuri Diaspora (AMAND), Pune, observed the 82nd Nupi Lan Memorial Function. The event paid tribute to the women of Manipur who led a resistance movement against British colonial policies perceived as discriminatory and unjust. === Patriots' Day observation === On August 13, 2021, the Association of Manipuri Diaspora (AMAND) Pune observed the 130th Patriots' Day. The event took place at the residence of the AMAND president in Pune, with floral tributes paid to the martyrs, following COVID-19 safety protocols. The ceremony was attended virtually by participants from across the country via Zoom. The event began with a patriotic Manipuri group song. During his welcome speech, AMAND President Er Naorem Giridhar Singh provided a brief historical overview of the geopolitical situation in the 19th century, which led to the Anglo-Manipur War of 1891, where the British Indian Empire defeated the princely state of Manipur. == Games and sports == The Association of Manipuri Diaspora (AMAND), Pune, hosted the 1st AMAND Football Cup 2025 on March 2nd at Pune Mundhwa, in honor of Late Hony Capt NK Singh, the Founder President of AMAND. The tournament served as a tribute to the values of team spirit, friendship, and community bonding. Following this inaugural event, the tournament is set to be held annually. == Handicrafts == The Keithel Store, inaugurated in Pune on February 20, 2023, is a retail establishment that offers a variety of indigenous products from Manipur, including traditional handicrafts and food items. The store, located at Shop 4/1/b/32, Opposite Ababil Plaza, Near DPS School, Undri, Pune, serves as a marketplace outside Manipur, providing local entrepreneurs with the opportunity to sell their products and support their livelihoods. Named after the Ima Keithel market in Manipur, a 500-year-old women-only market, the store seeks to promote and preserve the cultural heritage of the state. The Keithel Store aims to create a global market supply chain for the unique products of Manipur, thereby supporting economic growth in the region. It offers a platform for Meitei entrepreneurs to display and sell their goods beyond their home state. In addition, the store plays a role in preserving the indigenous crafts and traditions of Manipur. == Protests == On May 12, 2023, a gathering of predominantly Manipuri community members residing in Pune took place at the basketball court of Vidyanchal School in Aundh. The participants took an oath to advocate for peace in their home state, Manipur. The gathering was organized by the Association of Manipuri Diaspora (AMAND), Pune. On June 26, 2023, a sit-in protest was organized by Meitei Nupi Lup, Pune, near the Collector's Office in Pune, from 5 pm to 7 pm. The protest aimed to raise awareness about the issues of narco-terrorism and illegal immigration affecting Manipur. Over 100 participants from various communities and religious backgrounds in Pune gathered to express solidarity with Manipur and call for immediate action from the Central and State governments to restore peace. The protestors observed a moment of silence in honor of those who had lost their lives in the ongoing violence in Manipur. Slogans such as \"We Want Peace in Manipur,\" \"Stop Hill Valley Divide,\" and \"Meitei Lives Matter\" were chanted, reflecting the desire to preserve the cultural heritage and identity of the indigenous Meitei community. Notable figures, including Adv Geetarani Takhellambam, Dr Jyotsna Angom, and Rohan Philem, a cyclist and social activist, spoke at the event, urging the government to intervene and foster unity among the communities in Manipur. The Meitei Nupi Lup, Pune, submitted a memorandum to the District Collector of Pune, addressing the Prime Minister, the Governor, and the Chief Minister of Maharashtra, requesting urgent attention to the situation in Manipur and the restoration of peace. == Social services == In October 2023, a group of five women from the Hindu Meitei community in Navi Mumbai organized a relief initiative in response to the displacement caused by ongoing ethnic violence between the Meitei and Kuki communities in Manipur. Operating under the name Tengbanbi Lup (translated as “Helping Other Groups”), the women aimed to mitigate the impact of cold weather conditions on displaced persons residing in relief camps in the Imphal Valley. Through personal and community networks, the group raised ₹1.5 lakh, which was allocated toward the purchase of blankets. A total of 72 blankets were distributed across two relief camps. The members of the group included Prabha Arambam, Piyai Yumnam, Sophia Thingam, Sumita Shamurailatpam, and one other unnamed individual. This initiative was part of a broader support effort involving approximately 25 Meitei families residing in Navi Mumbai, who mobilized resources such as clothing, medical supplies, and other essentials to aid those affected by the conflict in Manipur. In December 2023, the Association of Manipuri Diaspora (AMAND), Pune, in coordination with the Rotary Club of Pune Kharadi, Lions Club of Pune, Rubicon Foundation, Manav Darshan Foundation, Leichal Taret Foundation, and Meitei Nupi Lup, organized a relief initiative titled \"Supply of Materials in Relief Camps in Manipur.\" The objective of the program was to provide essential aid to individuals residing in relief camps across Manipur. With contributions from partner organizations and individual donors, AMAND dispatched a total of 1,130 kilograms of relief materials from Pune to Imphal. Distribution was carried out by AMAND volunteers across 35 relief camps beginning in the first week of December. The relief items included blankets, shawls, jackets, hoodies, warm clothing, 1,000 units of women’s innerwear, 10,000 sanitary napkins, 500 pairs of socks, and food supplies such as rice, oil, and other groceries procured locally. The Association of Manipuri Diaspora (AMAND), Pune, organized the Annual Legal Awareness Program 2019. The event was held on August 3, 2019, at the ELTIS-SIFIL Symbiosis Auditorium in Pune. The program focused on the theme \"Start-up and Its Related Legal Aspects,\" addressing the legal considerations essential for entrepreneurs in the context of starting and managing a business. It aimed to raise awareness about the legal frameworks that impact the development of start-ups in the contemporary business environment. == Victims == * On October 15, 2023, Langpoklakpam Lamnganba Singh, a 20-year-old individual from Manipur, was found murdered in Mulkhed village, located on Chande Road in Mulshi taluka, approximately 25 kilometers from Pune city. * In May 2020, Rebita Devi Kongbrailatpam, a 29-year-old professional bodybuilder from Manipur, remained stranded in Mumbai due to the COVID-19 lockdown imposed across India. She had traveled to Mumbai on 16 February 2020 to attend the 7th World Women Leadership Congress and Awards, held at Taj Lands End in Bandra, where she was conferred the Woman Super Achiever Award. Following the event, Kongbrailatpam extended her stay in the city to pursue meetings related to sponsorship opportunities for an upcoming project. ** The nationwide lockdown, initiated in late March 2020 to curb the spread of the coronavirus pandemic, restricted her travel and left her confined to a hotel room for over two months. During this period, Kongbrailatpam reported incidents of racial discrimination, including verbal abuse and physical assault. She stated that individuals directed xenophobic slurs at her, associating her appearance with the COVID-19 virus and accusing her of being responsible for its spread. In a reported incident, she was physically attacked by a group of men who damaged her mobile phone. In response to the ongoing harassment and for personal safety, she chose to shave her head at a local temple in an effort to avoid further targeting. * In September 2018, a 22-year-old researcher from Manipur reported an incident of molestation while commuting on a local train in Mumbai. On September 11, the woman, who was accompanied by her European colleague, filed a complaint with the Vashi railway police. The victim alleged that an unidentified man molested her in the general compartment of a train traveling between Vashi and Govandi stations on the suburban harbour line. She stated that the incident occurred while she and her colleague were returning from research work in Navi Mumbai. According to her account, the accused touched her inappropriately in the crowded train. Despite efforts to apprehend the man, other passengers reportedly did not intervene, allowing the perpetrator to flee the scene. == Notable people == * Khomdram Gambhir Singh, a former soldier from Manipur, went missing in 1978 at the age of 26. For decades, his family had no information about his whereabouts. However, they later discovered a video showing him performing a Hindi song for money on a street in Mumbai, approximately 3,300 km away. With the assistance of the police, Singh, now 66 years old, was located. He was subsequently flown back to Manipur, where he was reunited with his family. == Associations and organizations == * The Association of Manipuri Diaspora (AMAND), Pune, is a non-profit and non-governmental organization registered under the Societies Registration Act of 1860. It was formed by Manipuri professionals, both working and retired, residing in Pune and surrounding areas. * Meitei Nupi Lup, Pune * Mumbai Manipuri Association (MMA) * Nouwa Marup, Pune is a community group formed in 2018 by families of Manipuri origin residing in Pune and nearby areas. The group’s primary objective is to promote and preserve traditional Manipuri culture and practices among younger generations living outside their native region. * Tengbanbi Lup (translated as “Helping Other Groups”), a group of Meitei women, based in Navi Mumbai == Related pages == * Meitei people in Australia * Meitei people in Canada * Meitei people in the United Kingdom * Meitei people in the United States * Meitei people in Bangladesh * Meitei people in Myanmar * Meitei people in Assam * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura == References == Category:Meitei people Category:Maharashtra",
 "title": "Meitei people in Maharashtra"
}