{
 "id": "1183548",
 "text": "Leonard Trask (June 30, 1805 – April 13, 1861) was an American who had a \"contortion of neck and spine\" during his late 20s after an accident while horse riding, which led to Trask becoming a medical curiosity. After numerous attempts at a cure, several further accidents resulting from his condition, and a loss of employment and mobility, Trask (by then earning small amounts of money as a curiosity) published an account of his condition which further increased his renown. His condition remained unsolved upon his death, but he was diagnosed post mortem with ankylosing spondylitis (AS). ==Early life and injuries== Trask was born in June 1805 in Hartford, Maine. In 1833, while in his late 20s—having spent his life thus far as a farm hand—he was involved in an accident in which a pig ran under the hooves of his horse, causing it to buck and throw Trask to the ground. Landing on his neck, Trask was severely injured, and spent \"several days\" crawling back to his home. Over subsequent years, despite great pain and spending months confined to his bed, Trask continued to work. During this time, his spine \"began to curve, and he began to bow forward.\" By 1858, Trask had seen up to 22 doctors regarding a cure, with various attempts all ending in failure. David Tucker published that year a small booklet which described Trask as having severe spinal deformity. The 1833 fall from a horse exacerbated the condition and resulted in severe deformity. Tucker reported: Trask's injury had further been exacerbated in 1840 when he fell into a load of hay, and in 1853 when he was thrown from his wagon, breaking his collar bone and four of his ribs. On May 24, 1858, he was involved in a third incident, where, while traveling in a coach which took a corner too sharply, he and a number of other passengers were thrown to the ground. Trask's head impacted with an iron projection on the coach door, opening a wound \"which parted the scalp, opening a gash in his head five inches long, and penetrating to the skull bone.\"Trask, p. 46-47. Despite the severity of the injury, which further deformed his spine, pushing his chin into his chest to the extent that it hampered breathing, and despite being told he would be dead by morning, Trask recovered and was able to walk again.Trask, p. 48. ==Career as the Invalid== Trask was now severely disabled. His wife nursed him, as he was unable to navigate—not being able to see more than a short distance in front of him without leaning backwards. Trask thus sought to earn a living from his disability in order to sustain his wife and seven children. This included the production and sale of numerous documents and items which survive for historical analysis, including the self-published A Brief Historical Sketch of the Life and Sufferings of Leonard Trask, the Wonderful Invalid in 1860, for which Trask had traveled to Maine's District Court to produce.Trask, p. 1-2. It contains numerous accounts of Trask's activities, such as \"Mr. Trask in Pursuit of Fuel\" and \"Mr Trask at the Circus\".Trask, 38-41. During all Trask is referred to as 'Mr. T.' His account became the first documented case of AS in the United States. ==Notes== ==References== * * * Category:1805 births Category:American people with disabilities Category:1861 deaths Category:People with ankylosing spondylitis",
 "title": "Leonard Trask"
}