{
 "id": "1183114",
 "text": "On 21 April 2025, Pope Francis died at age 88 in his home, Domus Sanctae Marthae in Vatican City. Francis was pope from 2013 until his death. Cardinal Kevin Farrell said the news in a Vatican video at 09:47. == Health problems == Francis had lung problems since he was young. In the 2020s, he had flu and bronchitis in winter. He often used a wheelchair. People talked about a possible resignation in 2021, but he said no. In 2022, he cancelled a trip because of his knee. He said he would resign only if his health became too bad. == Final illness == From 14 February to 23 March, 2025, he was in the hospital with double pneumonia. He got well enough to leave the hospital and rest at his home, the Domus Sanctae Marthae. == Day before death == On 20 April 2025 (Easter Sunday), he met people in Saint Peter's Square and gave a blessing. He also met U.S. Vice President JD Vance. == Death == Francis died at 07:35 CEST on 21 April 2025 (Easter Monday). The Vatican said the cause was a stroke and heart failure. He also had type 2 diabetes and high blood pressure. == Conclave == The 2025 papal conclave to choose the next pope after Francis took place between 7 May and 8 May. US Cardinal Robert Francis Prevost was elected as Pope Leo XIV. == Funeral == Cardinal Kevin Farrell led the rite to confirm the death. Francis had asked for a simple funeral. On April 22, 2025, the pope's body was shown in the Domus Sanctae Marthae. On the same day, the Holy See said that the funeral of Pope Francis would take place on April 26, 2025, in St. Peter's Square. He was buried in the Basilica of Santa Maria Maggiore. He was the first pope buried outside of the Sistine Chapel since Leo XIII. Leaders who came to the funeral included Giorgia Meloni,Frank-Walter Steinmeier, Javier Milei, Donald Trump, Andrzej Duda, Prince William, Keir Starmer, Emmanuel Macron, and Volodymyr Zelenskyy.Javier Milei viajará a Roma... ==Related pages== * Death and funeral of Pope Benedict XVI ==References== Category:Pope Francis Category:History of Vatican City Category:April 2025 events",
 "title": "Death and funeral of Pope Francis"
}