{
 "id": "1183490",
 "text": "Tian Stacy Boothe (born July 24, 1990) is an American film director, producer and singer-songwriter. She is known for her compelling storytelling and musical talents. Boothe directed, wrote, produced, edited Shattered Dream(2016), E.R Compliance(2022) and E.R. Emotional Release. Her notable work Shattered Dream won the award for her directing at the Rebel Minded Festival during 2018. The film was also selected at the Culture Life Film Festival in 2018. The filmmaker’s style is described as fearlessly honest, truthful, dramatic, touching and emotionally powerful. Her documentary film “You Should Never Tell” is a 2023 is a ScreenCraft True Story & Public Domain Competition Semifinalist. Her songs include singles \"Shattered Dream\", \"CP Original\", \"Healer\". == Early life and education == Tian Stacy Boothe was born on July 24, 1990, in Saint Andrew, Jamaica. Boothe attended Immaculate Conception High School and Preparatory School, completing her education through private tutoring and homeschooling. She earned a Bachelor of Science in Information Technology from the University of the Commonwealth Caribbean. In 2013, while pursuing her master’s degree in software engineering online at Nova Southeastern University she relocated to the United States. Driven by a deep passion for the arts, Boothe made a pivotal career shift from software engineering to filmmaking. In 2016, she relocated to California to pursue Cinema Production at a college, where she earned an Associate of Arts degree. Her creative work has since centered on narrative romance and pressing social issues. In late 2020 Boothe was scouted while trending on a popular livestream app. Soon Boothe became a content creator for their partner app Likee. Boothe earned a master’s degree in Humanitarian Action and Human Rights from Liberty University in 2024. == Personal life == Boothe is the mother of actor Tai Boothe and resides in Los Angeles, California. She is the niece of Jamaican singer Ken Boothe. Boothe became an American citizen in 2021. == Music career== Tian's music career is characterized by her commitment to authenticity and artistic expression. She writes songs about people she loves, using music as a medium to express emotions that are sometimes hard to convey through conversation. == Film career == Boothe's film career began with several short films all of which she directed edited wrote and composed music for which earned the Top Student Film award at LACC. Her film \"Shattered Dream\" additionally won the Rebel Film Festival award in 2018. == Discography == Singles and Music Videos Title Year Artist Shattered Dream 2018 Tian Boothe Shattered Dream (Remastered Film Version) 2022 Tian Boothe CP Original 2022 Tian Boothe CP It's All About the Bounce 2023 Tian Boothe CP Number 1 Lover 2024 Tian Boothe Healer 2025 Tian Boothe CP Escapade 2025 Tian Boothe == Filmography == Tian's film career includes several notable projects Title Year Role The Chase 2016 Producer, Director, Editor, Writer Fall Break 2016 Producer, Director, Editor, Writer Worrying About the Future 2017 Producer, Director, Editor The Tip 2017 Producer, Director, Editor Never Look Back 2017 Producer, Director, Editor, Writer Shattered Dream 2018 Producer, Director, Editor, Writer, Actress, Composer Ain't No Other Way 2019 Actress E.R. Compliance 2020 Producer, Director, Editor, Writer, Actress, Composer On Locc 2021 Actress You Were Meant To Be a Millionaire 2022-2023 Producer, Director, Editor, Writer, Actress You Should Never Tell 2023 Does The World Ever End 2025 Producer, Director, Editor, Writer, Actress E.R. Emotional Release Producer, Director, Editor, Writer, Actress, Composer == References == == External links == *Tian Boothe at IMDb *Tian Boothe on YouTube *Tian Boothe on Apple Music",
 "title": "Tian Boothe"
}