{
 "id": "1183674",
 "text": "The 2025 Pahalgam Massacre refers to the events from 22nd April, 2025, when terrorists connected to the Pakistan-supported * * * * * * Islamist groups Lashkar-e-Taiba and Hizbul Mujahideen shot several visitors in Pahalgam, Jammu and Kashmir, India.* 26 were killed, including one Nepali, and 20 others were injured. Several world leaders, including United States president Donald Trump, Russian president Vladimir Putin, and Israeli prime minister Benjamin Netanyahu offered sadness. In retaliation, the Indian government started Operation Sindoor. * * * * ==Background== Fighting started in Jammu and Kashmir in 1989 and has continued since then, although violence has gone down a lot in recent years. In 2019, India took away Jammu and Kashmir’s special status and divided it into two union territories — Jammu and Kashmir and Ladakh. This change let local leaders give domicile status to people who could not get it before, allowing them to buy land and get jobs in the J&K.; On April 10, the revenue minister said that 83,000 people have been given domicile certificates under the new rules in the past two years. According to Forbes, Kashmir was already the most heavily militarized place in the world. India has kept around 500,000 security forces in the area permanently. ==Massacre== The attack happened at 2:50 PM on April 22 in Baisaran Valley near Pahalgam, a remote tourist area. Four to six armed men, dressed like soldiers, came out of the forest and started shooting at the crowd with powerful guns. Many visitors were there enjoying the nice weather after days of rain. * * * * ===Targeting of non-Muslims=== The attackers asked people their names and religions before shooting them. Some tourists said they were told to recite an Islamic verse so the attackers could separate them by religion. Men were forced to remove their trousers to check for a lack of circumcision before being shot at close range, and video footage from the scene showed scenes of panic with injured victims pleading for help and bodies strewn across the ground. * * * A local pony operator, Syed Adil Hussain Shah, reportedly tried to protect the tourists and wrestle the gun from one of the attackers before being shot and killed. ==Casualties== Nationality Dead Injured 25 20 1 0 Total 26 20 At least 28 people lost their lives, and many people were seriously injured. Emergency workers arrived quickly after hearing about the attack. Two badly hurt people were taken to Anantnag District Hospital around 4:30 PM, while others went to nearby clinics. Some victims were flown by helicopter to a military hospital in Srinagar for further treatment. * * * * At least 20 people were injured. The dead included those from Karnataka, Kerala, Maharashtra, Odisha, Gujarat, Haryana, West Bengal and Uttar Pradesh, as well as injured from Gujarat, Tamil Nadu and Maharashtra. The casualties included a 26-year-old Indian Navy officer and an Intelligence Bureau official. Witnesses stated that most of the victims were male, with one assailant allegedly telling a woman that she was being spared so she could \"narrate the horrors\" to Prime Minister Narendra Modi. Several victims were shot at close range, and video footage from the scene showed bloodied people lying on the ground and others pleading for help. The local police and the Indian Army started a joint search operation in the area. Helicopters were used to find the perpetrators, and some parts of Pahalgam were temporarily locked down. * * * ==Perpetrators== The massacre was committed by five terrorists, including three Pakistani nationals and two local residents from Jammu and Kashmir. Name Background Asif Fauji (Moosa) Identified as the field commander who led the Pahalgam massacre. Believed to be a Pakistani national and senior operative of The Resistance Front (TRF), a Lashkar-e-Taiba proxy. Active in Jammu & Kashmir for some time, with a history of orchestrating terror strikes in Poonch. Described as young and bearded in sketches released by security agencies. Suleman Shah (Yunus) Also a Pakistani national, operative of TRF/Lashkar-e-Taiba. Previously active in Poonch and suspected of involvement in earlier attacks. Young, bearded, and used a code name for operational secrecy. His personal life details remain limited, but he is described as a battle-hardened terrorist Abu Talha (Asif) Pakistani national, commander in Lashkar-e-Taiba. \"Abu Talha\" is a rank/title for mid-level commanders in the group. He is believed to have infiltrated Kashmir recently, and was involved in earlier attacks in Poonch. Sketches show him as young and bearded Adil Guri Local from Bijbehara, Anantnag, Jammu & Kashmir. Reportedly underwent training in Pakistan in 2018 and returned to the Valley recently. He is believed to have facilitated movement and operations for the Pakistani terrorist Ahsan Local from Pulwama, Jammu & Kashmir. Also reportedly trained in Pakistan in 2018 and returned recently. He is believed to have played a supporting role in the attack ==Responsibility== The massacre was claimed by The Resistance Front, a group related to the Lashkar-e-Taiba, backed by Pakistan, and Hizbul Mujahideen blaming the settlement of over 85,000 non- Kashmiris that were driving a \"demographic change.\" ==Response== Indian prime minister Narendra Modi cut short his visit to Saudi Arabia and said that those responsible would be brought to justice, emphasizing India's resolve to combat terrorism. Union Home Minister Amit Shah travelled to Srinagar to assess the situation and coordinate the security response. Union minister for finance and corporate affairs Nirmala Sitharaman cut short her official visit to the United States and Peru. Security forces launched a manhunt to apprehend the perpetrators, and a helpline was established to assist affected tourists. On April 23, the Indian Army gave limited clearance for the operation of HAL Dhruv for counter-terrorism operations. The fleet was otherwise grounded. ===Investigation=== The National Investigation Agency initiated an investigation into the massacre after visiting the site on 23 April. Security agencies released sketches of three of the terrorist involved in attack and stated that all of them were linked to Lashkar-e-Taiba and at least two are believed to be Pakistani. Intelligence agencies identified Saifullah Kasuri alias Khalid, a top LeT commander, as the mastermind of the massacre. As part of these measures, authorities demolished properties belonging to individuals identified as attackers. Within 40 hours following the terrorist attack, Indian security forces identified terror launch pads and training camps in Pakistan-occupied Kashmir. Around 150–200 trained terrorists were reportedly stationed there, with the Pakistan Army aiding infiltration efforts. A failed attempt made by 642 Mujahid Battalion near the Battal sector led to heavy Pakistani casualties. Additionally, 60 foreign terrorists from groups like Hizbul Mujahideen, Jaish-e-Mohammed, and Lashkar-e-Taiba were found to be active in Jammu and Kashmir. ====Survivor testimonies==== Accounts from survivors indicated that an attacker spared a woman telling that she was being spared so she could \"narrate the horrors\" to the Indian prime minister, Narendra Modi. One of the victims was a Christian from Madhya Pradesh named Sushil Nathaniel, who got shot dead because when asked to recite Kalma, the Islamic declaration faith, he was unable do so as he was Christian. A Hindu, who recited Kalma was spared to live, when he started chanting louder when the terrorist asked him what he was reciting. ==Reactions== ===Domestic=== The massacre was quickly condemned by political leaders and the public. Chief Minister Omar Abdullah said it was \"much bigger than anything we’ve seen against civilians in recent years.\" President Droupadi Murmu shared her sympathy with the victims’ families and called the massacre a \"terrible and inhumane act.\" Prime Minister Narendra Modi also condemned the violence and promised that those responsible would be punished, saying the country is strongly committed to fighting terrorism. Defense Minister Rajnath Singh called it an \"act of cowardice.\" Congress MP Priyanka Gandhi said it was a \"crime against humanity.\" Leader of the Opposition Rahul Gandhi called the massacre \"horrific,\" showed support for the victims, and also criticized the BJP, along with the PDP. ==== Kashmir ==== Protests were held across Kashmir, including Srinagar, Pulwama, Shopian, Pahalgam, Anantnag and Baramulla. Protestors expressed sorrow and anger, calling the attack a blow to Kashmiriyat and condemning the violence. Shops and businesses shut down in support. On 25 April, Mirwaiz Umar Farooq, in his Friday sermon at Srinagar's Jamia Masjid, said that Kashmiris \"stand shoulder to shoulder with the victims.\" A minute of silence was observed before prayers in memory of those killed. ===International=== * : Secretary General Antonio Guterres has strongly condemned the massacre and stressed that that attacks against civilians are unacceptable under any circumstances. * : The Foreign Ministry issued a statement that \"categorically condemns\" the massacre and offered condolences and adding that: \"Such Incidents Undermine Efforts To Ensure Regional Security.\" * : Prime Minister Nikol Pashinyan offered his condolences. * : Interim Government Chief Adviser Muhammad Yunus expressed his deep condolences for the victims and reaffirmed Bangladesh's stance against terrorism. * : The Foreign Ministry of China offered its \"sincere sympathies\" to the families of the victims and the injured. Additionally, Chinese Ambassador to India Xu Feihong condemned the massacre on social media. * : President Emmanuel Macron condemned the massacre and the ambassador of France to India stated that France would stand in solidarity with India in the fight against terrorism. * : The Foreign Ministry issued a statement calling the Pahalgam attack a \"heinous terrorist crime\" that \"contradicts all human rights norms.\" The Government of Iran extended condolences to the people and the Government of India. * : Foreign Minister Gideon Sa'ar and Prime Minister Benjamin Netanyahu condemned the massacre and extended condolences to the affected victims and families. Ambassador of Israel to India Reuven Azar also issued condolences and stated \"our support is for the security forces in their struggle against terror\". * : Prime Minister Giorgia Meloni expressed sorrow over the terrorist attack, conveying condolences via social media. She stated that Italy sends its sympathies to the affected families, the injured, the Indian government, and the people of India. * : Chancellor Olaf Scholz strongly condemned the massacre and offered his condolences to the victims. * : Prime Minister KP Sharma Oli expressed solidarity with India and stated that Nepal stands firmly with it during this time of sorrow. The Ministry of Foreign Affairs condemned the massacre as a \"barbaric terrorist act\" and extended condolences to the victims' families, reaffirming its position against terrorism in all forms. * : President Vladimir Putin condemned the terrorist attack in Kashmir, stating that \"this brutal crime has no justification whatsoever.\" A subsequent statement from the Kremlin reaffirmed Russia's commitment to cooperate with India in combating terrorism in all its forms and manifestations, and extended sympathies to all those affected. * : Saudi Crown Prince Mohammed bin Salman \"strongly condemned\" the massacre in Kashmir. He reaffirmed Saudi Arabia's solidarity with India during this time of grief, emphasizing support for the country and its people. * : \"Singapore strongly condemns the terror attacks in Pahalgam, Jammu and Kashmir on 22 April 2025 which have claimed many lives.\" says the Ministry of Foreign Affairs. * : The Foreign Ministry condemned the \"heinous terrorist attack\" and offered condolences to the people. It also reiterated its commitment to regional peace and security. * : UAE's Ministry of Foreign Affairs strongly condemned the massacre. It expressed condolences to the government and people of India, as did the ambassador. * : Prime Minister Keir Starmer offered his condolences. * : President Donald Trump described the incident as \"deeply disturbing\" and extended condolences to the victims. On social media, he reaffirmed support for India, stating that the U.S. stands with India against terrorism and expressing solidarity with Modi and the people of India. Vice President JD Vance, who was on a visit to India with his wife, Usha Vance, also condemned the massacre. ==Related pages== * Charlie Hebdo shooting * April 2017 Champs-Élysées attack * 2025 D.C. Jewish museum shooting ==References== Category:Islamism Category:Massacres Category:Islamic terrorism Category:Crimes against humanity Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Pages with unreviewed translations",
 "title": "2025 Pahalgam Massacre"
}