{
 "id": "1183545",
 "text": "Christa Reinig (6 August 1926, in Berlin – 30 September 2008, in Munich) was a German poet, fiction and non-fiction writer, and dramatist. She began her career in the Soviet occupation zone which became East Berlin, was banned there, after publishing in West Germany, and moved to the West in 1964, settling in Munich. She was openly lesbian. Her works are marked by black humor, and irony. ==Works== ===Poetry=== * Die Steine von Finisterre. 1961. Partial trans. Ruth and Matthew Mead, The Tightrope Walker. Edinburgh: Rutherford, 1981. * Gedichte. Frankfurt: Fischer, 1963. * Schwabinger Marterln. Freche Grabsprüche für Huren, Gammler und Poeten. Stierstadt im Taunus: Eremiten, 1969. * Schwalbe von Olevano. Stierstadt im Taunus: Eremiten, 1969. * Papantscha-Vielerlei: Exotische Produkte Altindiens. Stierstadt im Taunus: Eremiten, 1971. * Die Ballade vom Blutigen Bomme. Düsseldorf: Eremiten, 1972. * Müßiggang ist aller Liebe Anfang. Düsseldorf: Eremiten, 1979. . Munich: Frauenoffensive, 1980. . Trans. Ilze Mueller. Idleness is the Root of All Love. Corvallis, Oregon: Calyx, 1991. * Sämtliche Gedichte. Düsseldorf: Eremiten, 1984. * Die Prüfung des Lächlers: Gesammelte Gedichte. Munich: DTV, 1970, 1984. ===Stories=== * \"Eine Ruine\" (1949) and \"Ein Fischerdorf\" (1951) in Anthologien der DDR * Der Traum meiner Verkommenheit. Berlin: Fietkau, 1961. * Drei Schiffe: Erzählungen, Dialoge, Berichte. Frankfurt: Fischer, 1965. * Orion trat aus dem Haus: neue Sternbilder. Stierstadt im Taunus: Eremiten, 1968. * Das grosse Bechterew- Tantra: Exzentrische Anatomie. Stierstadt im Taunus: Eremiten, 1970. * Hantipanti: zwölf Kindergeschichten zum Nachdenken und ein Nachwort. Weinheim: Beltz, 1972. * Clever Elsie, Frederick and Catherine, and The Goose Girl Meets The Four Bremen City Musicians. Weinheim: Beltz & Gelberg, 1976. * Der Wolf und die Witwen: Erzählungen und Essays. Düsseldorf: Eremiten, 1980. . Munich: Frauenoffensive, 1981. * Die ewige Schule. Munich: Frauenoffensive, 1982. * Nobody and other stories. Düsseldorf: Eremiten, 1989. * Glück und Glas. Düsseldorf: Eremiten, 1991. * Simsalabim. Düsseldorf: Eremiten, 1991. * Der Frosch im Glas: neue Sprüche. Düsseldorf: Eremiten, 1994. ===Novels=== * Die himmlische und die irdische Geometrie. Düsseldorf: Eremiten, 1975. * Entmannung: die Geschichte Ottos und seiner vier Frauen. Düsseldorf: Eremiten, 1976. * Die Frau im Brunnen. Munich: Frauenoffensive, 1984. ===Audio plays=== * Kleine Chronik der Osterwoche. 1965 * Tenakeh. 1965 * Wisper. 1967 * Das Aquarium. 1967 ===Non-fiction=== * Das Gelbe vom Himmel: Betrachtungen. Düsseldorf: Eremiten, 2006. ===Translations=== * Marina Zwetajewa. Gedichte. Berlin: Wagenbach, [1968]. ==Honours== * 1964 Bremen Literature Prize, for Gedichte * 1965 Villa Massimo FellowshipDie Stipendiaten der Villa Massimo vom Gründungsjahr 1913 bis 2011 , German Academy in Rome * 1968 Hörspielpreis der Kriegsblinden, for Das AquariumÜbersicht über die preisgekrönten Hörspiele, Hörspielpreis der Kriegsblinden, Bund der Kriegsblinden Deutschlands * 1969 Toucan Prize of the City of Munich (with five others),Preisträgerinnen und Preisträger, Tukan-Preis, City of Munich for Schwabinger Marterln * 1973 Literary Award of the Bavarian Academy of Fine Arts * 1975 German Critics' Prize, for Die Prüfung des LächlersDeutscher Kritikerpreis, Literaturpreis Gewinner * 1976 Cross of Merit of the Federal Republic of Germany * 1984 SWR- Bestenliste Prize, for Sämtliche GedichteSWR-Bestenliste: Kritikerpreis, Literaturpreise, All Around New Books * 1993 Roswitha Prize of the City of Bad GandersheimDie Preisträgerinnen des Roswithapreises (Literaturpreis) , City of Bad Gandersheim * 1999 Brandenburg Literature Prize * 2003 Kester- Haeusler Award of the German Schiller FoundationKester-Haeusler-Ehrengabe, Alle Preisträger chronologisch bis 1995, 6-10 , Deutsche Schillerstiftung von 1859 \"Ehrung für Reinig: Schillerstiftung würdigt Lyrikerin\", Süddeutsche Zeitung, 8 October 2003 ==References== ==Sources== * \"Abgestorbener Raum\". Interview with Jo Wünsche. Alternative 20 (April 1977) 68-72 * Peter Horn. Christa Reinig und das \"weibliche Ich\". In Frauenliteratur: Autorinnen, Perspektiven, Konzepte. Ed. Manfred Jurgensen. Bern: Lang, 1983. . pp. 101-22 * Sibylle Scheßwendter. Darstellung und Auflösung von Lebensproblemen im Werk: Christa Reinig. Doctoral thesis, University of Siegen, 2000. pdf ==External links== * Christa Reinig at the German National Library Category:1926 births Category:2008 deaths Category:People with ankylosing spondylitis",
 "title": "Christa Reinig"
}