{
 "id": "1183694",
 "text": "Marie-Juliette Olga \"Lili\" Boulanger (; 21 August 189315 March 1918) was a French composer and the first female winner of the Prix de Rome composition prize. Her older sister was the noted composer and composition teacher Nadia Boulanger. == Music == Boulanger grew up in a time of musical transition and her music fits easily into what was becoming defined as a post-Romantic style. Like Debussy, Boulanger associated herself more with Symbolism than Impressionism, with her music featuring the sense of obscurity and indirection more common in Symbolism. However, she also “explored the ‘Impressionists’ palette of nonfunctional seventh and ninth chords, parallel chords, and modal progressions”. While much of Boulanger’s music reflects the feelings of isolation and alienation that were starting to emerge during the twentieth century, it also reveals her own struggles with depression and loneliness caused by her long-term illness. She often chose texts that conveyed a strong sense of hopelessness and sadness, as seen in Demain fera un an: “Nothing more. I have nothing more, nothing to sustain me” and “I seem to feel a weeping within me, a heavy, silent sobbing, someone who is not there”. == Works == === Les sirènes === Les sirènes (1911) is written for solo soprano and three part choir. The topic, sirens, uses a text by Charles Grandmougin. This work was first premiered at one of her mother's exclusive musical gatherings. Auguste Mangeot, a critic from the Paris music journal Le Monde Musicale, reported that everyone liked the piece so well it had to be repeated. Boulanger used this piece as a preparation for the Prix de Rome competition, and from it one can see her firm grounding in the classical technique taught at the Conservatoire. She uses this technique as a starting point and employs many devices popular at that time to create a personal and clear statement. The poetry of this selection deals with the mythological siren, a creature that sings to seduce sailors to steer closer; when they do, the sirens devour the men. Boulanger depicts this scene as vividly as she possibly can. She uses a pedal tone on F combined with ascending C octaves at the beginning to portray the mesmerizing effect of the sirens. She uses this effect for twenty-eight measures, in effect, lulling listeners into a trance- like sleep. The work is dedicated to Madame Jane Engel Bathori. Bathori, a soprano, was known for her concert organisation, and supported many new artists and composers. === Psalms === Boulanger composed three psalm settings: Psalms 24, 129 and 130. ==== Psalm 24 ==== She composed Psalm 24, entitled La terre appartient à l'Eternel (\"The earth is the Lord's\"), in 1916 while she was resident in Rome. The work is dedicated to Monsieur Jules Griset, who was the director of Choral Guillot de Saint-Brice. Durand published the work in 1924. The work is scored for choir (consisting of soprano, alto, tenor and bass), accompanied by organ and brass ensemble (consisting of 4 horns, 3 trumpets, 4 trombones, 1 tuba), timpani and 2 harps. Boulanger's score uses brass fanfares and homophonic choral passages: the contrast of sections contrast to the style of her 1912 Prix de Rome-winning cantata, Faust et Hélène, as heard in Yan Pascal Tortelier's recording.Lili Boulanger, 'Faust et Hélène, D'un matin de printemps, D'un soir triste, Psaume 130, Psaume 24', [CD], cond. Yan Pascal Tortelier, BBC Philharmonic, City of Birmingham Symphony Chorus (1999) Chandos CHAN9745. ==== Psalm 129 ==== Psalm 129 was also composed in 1916 in Rome. This psalm is much longer than Psalm 24 and is composed for full orchestra. The premiere performance was held at the Salle Pleyel in 1921, conducted by Henri Busser. ==== Psalm 130 ==== Du fond de l'abîme (Psalm 130: De Profundis / \"Out of the depths\"), composed for voice and orchestra, is dedicated to the memory of her father, as noted at the top of the score. The work, completed when Boulanger was aged only twenty-two, sounds mature and conveys a developed compositional style.Lili Boulanger: Psalm 130 (Du fond de l'abîme), Psalms 24 & 129, Vieille Priere bouddhique; Igor Stravinsky: Symphony of Psalms; London Symphony Orchestra, The Monteverdi Choir, Sally Bruce-Payne (mezzo soprano), Julian Podger (baritone), cond. John Eliot Gardiner; Deutsche Grammophon CD B000068PHA (2002). Boulanger's psalms convey her Catholic faith. It has been suggested that the work was composed in reaction to World War I.Ristow, Gregory Carylton. (2011) \"Contextualizing Lili Boulanger's Psalm 130: Du fond de l'abîme: Music, War and Politics with a re- orchestration for performance in halls without organ.\" DMA diss., University of Rochester. The work is for a large orchestra including a sarrusophone. === Pie Jesu === Lili Boulanger finished this Pie Jesu (1918), scored for high voice, string quartet, harp and organ, towards the end of her life, but \"the first of Lili Boulanger's sketches for the Pie Jesu are to be found in a composition book she used between 1909 and 1913.\"Léonie Rosenstiel, The Life and Works of Lili Boulanger (Cranbury, NJ: Associated UPs 1978), 200. As noted by her sister, Nadia, she dictated the work to her. Scholars such as biographer Léonie Rosenstiel and Olivia MattisMattis, Olivia, 1993. \"Lili Boulanger - Polytoniste.\" In Lili Boulanger-Tage 1993. Bremen zum 100. Geburtstag der Komponisten : Konzerte und Veranstaltungen, edited by Kathrin Mosler, 48-51. Callas/Zeichen und Spuren. speculate that Boulanger intended to write a complete Requiem Mass but did not live to complete it. === Vieille prière bouddhique === This work, \"Old Buddhist Prayer\", is written for tenor and chorus (soprano, alto, tenor and bass), accompanied by a large orchestra consisting of: 2 flutes, 2 oboes, English horn, 2 clarinets (B♭), bass clarinet (B♭), 2 bassoons, sarrusophone + 4 horns (F), 3 trumpets, 4 trombones, tuba + tympani, cymbals, bass drum + celesta + 2 harps, strings. Composed during 1914–1917, it was, as many of her works, not performed until after World War I, in 1921. This work is not based within Catholicism, as her psalms were. Rather, it sets the text of a Buddhist daily prayer. James Briscoe notes that this work shows similarities to Stravinsky but also anticipates the next generation of composers. === D'un soir triste === This symphonic poem was the last work Boulanger was able to compose by her own hand, without help in writing. === D'un matin de printemps === This instrumental work is one of the last pieces Lili Boulanger completed. Different arrangements were produced including a version for violin, for flute, and for piano, another for piano trio, and another for orchestra. Although she finished both these instrumental works, her sister Nadia reportedly edited the works to add dynamics and performance directions. ===List by year=== Title Year Instrumentation Text by Sous-Bois 1911 Choir (SATB) and piano Philippe Gille Nocturne 1911 Violin and piano N/A Renouveau 1911 Vocal quartet (SATT) and piano/orchestra Armand Silvestre Les Sirènes 1911 Soprano, chorus and piano Charles Grandmougin Reflets 1911 Voice and piano Maurice Maeterlinck Prelude in Db 1911 Piano N/A Attente 1912 Voice and piano/orchestra Maurice Maeterlinck Hymne au Soleil 1912 Contralto, chorus and piano Casimir Delavigne Le Retour 1912 Voice and piano Georges Delaquys Pour les Funérailles 1912 Baritone, chorus and piano Alfred de Musset Soir sur la Plaine 1913 Soprano, tenor and orchestra Albert Samain Faust et Hélène 1913 Mezzo-soprano, tenor, baritone, chorus and orchestra Eugène Adenis D'un Jardin Clair 1914 Piano N/A D'un Vieux Jardin 1914 Piano N/A Cortège 1914 Violin and piano N/A Clairières dans le Ciel 1914 Voice and piano Francis Jammes Psaume 24 1916 Chorus, organ and orchestra N/A Psaume 129 1916 Baritone and orchestra N/A Dans l'immense Tristesse 1916 Voice and piano Psaume 130 1917 2 solo voices, chorus, organ and orchestra N/A Vieille Prière bouddhique 1917 Tenor, chorus and orchestra D'un Matin de Printemps 1918 Violin and piano N/A Pie Jesu 1918 Voice, string quartet, harp and organ D'un Soir Triste 1918 Orchestra ==Legacy== In March 1939, Nadia Boulanger with the help of American friends created the Lili Boulanger Memorial Fund. It has two objectives: to perpetuate Lili Boulanger's music and memory and to financially support talented musicians. The Lili Boulanger Memorial Fund does not accept applications for its annual competition but a list of candidates is produced by a group of nominators selected each year by the Board of Trustees. Each nominator can then propose a candidate for the prize. The Fund then awards the Prix Lili Boulanger to one of these candidates. The University of Massachusetts Boston curates the fund. Previous winners have included Alexei Haieff (1942), Noël Lee (1953), Wojciech Kilar (1960), Robert D. Levin (1966, 1971) and Andy Akiho (2015). In April 1965, the Friends of Lili Boulanger Association was created in Paris. This organization became the Nadia and Lili Boulanger International Centre (CNLB) in 2009. Joy-Leilani Garbutt and Laura Colgate, two Washington, DC, musicians, started the Boulanger Initiative in 2018 to support music composed by women, in honor of Lili and Nadia Boulanger. The asteroid 1181 Lilith was named in honour of Boulanger. == Illness and death == She suffered from chronic illness, beginning with a case of bronchial pneumonia at age two that weakened her immune system, leading to the intestinal tuberculosis that ended her life at the age of 24. Although she loved to travel and completed several works in Italy after winning the Prix de Rome, her failing health forced her to return home, where she and her sister organised efforts to support French soldiers during World War I. Her last years were a productive time musically as she labored to complete works. Her death left unfinished the opera La princesse Maleine on which she had spent most of her last years. Boulanger died in Mézy-sur-Seine. In 1979, her sister Nadia Boulanger was buried in the same tomb. It also contains the remains of their parents. ==Notes== ==References== ==Other websites== * Category:1893 births Category:1918 deaths Category:Deaths from Crohn's disease",
 "title": "Lili Boulanger"
}