{
 "id": "1183914",
 "text": "Mistral AI SAS is a French artificial intelligence (AI) company based in Paris, specializing in large language models (LLMs) and generative AI technologies. Founded on 28 April 2023 by Arthur Mensch, Guillaume Lample, and Timothée Lacroix, Mistral AI focuses on open-weight and efficient AI models to provide alternatives to proprietary systems. Named after the mistral, a strong wind in southern France, the company aims to bring clarity and innovation to the AI field. Mistral AI’s models, such as Mistral 7B, Mixtral 8x7B, and Mistral Large 2, are used by businesses, developers, and researchers for tasks like text generation, coding, and data analysis. The company’s chatbot, Le Chat, and its open-source approach have positioned it as a key player in the global AI landscape, competing with companies like OpenAI, Anthropic, and Meta AI. == History == Mistral AI was founded by three AI researchers who met at École Polytechnique: Arthur Mensch, former researcher at Google DeepMind; Guillaume Lample, and Timothée Lacroix, both previously with Meta AI. Their goal was to create efficient, open-weight AI models to democratize access to AI technology and challenge the dominance of proprietary systems. In June 2023, Mistral AI raised €105 million from investors, including Lightspeed Venture Partners, Eric Schmidt, and Xavier Niel, valuing the company at €240 million. By December 2023, a second funding round of €385 million, led by Andreessen Horowitz, BNP Paribas, and Salesforce, increased its valuation to €2 billion. In June 2024, a €600 million round, led by General Catalyst, raised the valuation to €5.8 billion, making Mistral AI a leading AI company outside the San Francisco Bay Area. On 26 February 2024, Mistral AI partnered with Microsoft to integrate its models into Microsoft Azure, expanding its global reach. By 2025, the company employed 150 people and continued to develop new models and services. == Philosophy == Mistral AI promotes open- source innovation and accessibility in AI development. Unlike proprietary models from companies like OpenAI, Mistral releases many of its models under open licenses, such as Apache 2.0, to encourage research and collaboration. The company aims to make AI efficient, cost-effective, and widely available, positioning itself as a European alternative to U.S.-based AI giants. == Services == === Le Chat === Le Chat (pronounced \\lə ʃa\\ in French) is Mistral AI’s conversational AI assistant, launched in February 2024 as a competitor to ChatGPT. On 19 November 2024, it was updated to include: * Image Generation: Powered by Black Forest Labs’ Flux Pro model for creating visuals from text prompts. * Web Search: Provides real-time, reliable information from online sources. * Canvas System: A collaborative interface for generating and editing code. On 6 February 2025, Le Chat was released as a mobile app for iOS and Android, offering web search, image generation, and real-time updates. A Pro subscription tier, priced at $14.99 per month, provides access to advanced models, unlimited messaging, and enhanced features. === Models === Mistral AI develops a range of LLMs, from lightweight models like Mistral 7B to high- capacity models like Mistral Large 2. Most models are released with open weights under licenses like Apache 2.0, while some, like Mistral Large, are proprietary. Below is a summary of key models: Name Release Date Status Parameters (Billion) License Notes Mistral Small 3.1 Active 24 Apache 2.0 Efficient model with image understanding, leading small models category. Mistral Large 2 Active 123 Mistral Research License High-performance model, competitive with Llama 3.1 405B, fluent in multiple languages. Pixtral Large Active 124 Mistral Research License Enhanced vision-language model with 1-billion-parameter visual encoder. Mixtral 8x22B Active 141 Apache 2.0 Sparse mixture-of-experts model, released via BitTorrent, high performance. Codestral 22B Active 22 Mistral Non-Production License Code-focused model, fluent in over 80 programming languages. Mathstral 7B Active 7 Apache 2.0 STEM-focused model, strong in math and science tasks. Mistral 7B Active 7.3 Apache 2.0 First model, efficient with grouped-query attention, outperforms larger models. Mixtral 8x7B Active 46.7 Apache 2.0 Mixture-of-experts model, outperforms GPT-3.5 in benchmarks. == Performance == Mistral AI’s models are designed for efficiency and high performance, often rivaling larger models from competitors. * Mistral 7B: Outperforms LLaMA 2 13B and matches LLaMA 34B on many benchmarks, despite its 7.3 billion parameters. * Mixtral 8x7B: In 2023 tests, it surpassed LLaMA 70B and GPT-3.5 in most language benchmarks, using a sparse mixture-of-experts architecture. * Mistral Large 2: Competitive with Llama 3.1 405B, particularly in programming tasks, with 123 billion parameters and a 128,000-token context length. * Codestral 22B: Outperforms Llama 3 70B and DeepSeek Coder 33B on coding benchmarks like HumanEval FIM (78.2%–91.6%). * Mathstral 7B: Scores 56.6% on the MATH benchmark and 63.47% on MMLU, excelling in STEM tasks. A 2024 study by Patronus AI found Mixtral 8x7B generated copyrighted text in 22% of responses when prompted with protected book content, compared to 44% for GPT-4. == Applications == Mistral AI’s models are used across industries for various purposes: * Businesses: Companies like BNP Paribas, AXA, and Zalando use Mistral models for customer support, data analysis, and automation. * Developers: Codestral and Codestral Mamba support coding in over 80 programming languages, aiding software development. * Research: Open-weight models like Mistral 7B and Mixtral 8x22B are used by academics for AI research and experimentation. * Education: Mathstral 7B supports STEM education with strong performance in math and science tasks. * Logistics and Retail: Firms like CMA CGM and Mirakl apply Mistral models for supply chain optimization and e-commerce solutions. == Partnerships == Mistral AI’s partnership with Microsoft, announced on 26 February 2024, integrates its models into Microsoft Azure, making them accessible to Azure’s global user base. This collaboration also supports Le Chat’s deployment as a multilingual conversational assistant. Additional partnerships with Black Forest Labs enhance Le Chat’s image generation capabilities. == Impact and challenges == Mistral AI has strengthened Europe’s position in the global AI race, ranking fourth among AI companies worldwide and first outside the San Francisco Bay Area, ahead of Cohere, Hugging Face, and Perplexity AI. Its open-weight models have fostered innovation by enabling developers and researchers to build on its technology, contributing to advancements in AI accessibility. However, challenges remain. The company faces competition from larger U.S.-based firms, and its open-source approach raises concerns about misuse, such as generating harmful content or copyrighted material. Additionally, maintaining high performance while scaling models to handle diverse languages and tasks requires significant resources. == Future plans == Mistral AI plans to: * Expand model capabilities to support more languages and specialized tasks. * Enhance Le Chat with advanced features like real-time collaboration and multimodal inputs. * Develop enterprise solutions for industries like healthcare and finance. * Increase global adoption through partnerships and API integrations. These efforts aim to solidify Mistral AI’s role as a leader in open and efficient AI development. == Related pages == * Large language model * Generative AI * Open-source software == References == == Other websites == * * Hugging Face: Mistral AI Models * Mistral Large Announcement on Mistral AI * Mixtral 8x7B Announcement on Mistral AI * Microsoft Partnership on Microsoft Azure Blog Category:Companies of France Category:Companies based in Paris Category:2023 establishments in France",
 "title": "Mistral AI"
}