{
 "id": "118314",
 "text": "Gregorio Allegri (1582 – February 7, 1652),Roche, Jerome and O’Regan, Noel. \"Allegri, Gregorio.\" Grove Music Online. Oxford Music Online. Oxford University Press, , accessed January 2, 2016, was an Italian composer and priest. He wrote a large number of religious pieces, including motets and several settings of the Mass. His best known compositions is the Miserere mei Deus.Miserere: Classical Net Article - Allegri - Miserere, accessdate: January 3, 2016 From 1591 to 1596 Allegri was employed in a church choir in Rome. In 1601 he became a tenor in the choir. He studied music and composing with the director of the choir, G. B. Nannio. He moved around to a number of different churches in Rome, before joining the choir at the Vatican in 1629. This was the choir that performed in the Sistine Chapel for the pope. he was made the director of the choir in 1650. Pope Urban VIII had rewritten some of the texts used in the religious services. Allegri was given the job of editing Giovanni da Palestrina's music so that it would fit with the new words. He was seen as an expert in the old style, even though some of his music was written in the new baroque style. ==Misere mei Deus== Miserere mei, Deus is a motet written to be sung by two choirs. One choir is five voices - soprano, alto, two tenors and bass. The second choir has two sopranos, alto and baritone. One choir sings a simple kind of tune called a fauxbourdon which is based on a plainchant. The other sings a more complicated version, with a top part which goes up to top C (the note two octaves higher than Middle C). The singers also improvised some parts of the music, making up elaborate ornamented parts. These improvisations were not written down, but were passed from singer to singer in the choir.Gregorio Allegri's Miserere mei, Deus: Gregorio Allegri's Miserere mei, Deus, accessdate: January 4, 2016 Allegri wrote the Miserere to be sung in the Sistine Chapel during the Easter celebrations. During the service, which started at 3.00am, there would be 27 candles burning. The Pope would gradually extinguish the candles until there was only one left burning. The Miserere was performed as the pope prayed at the altar with the single candle. This piece of music became very popular, and some allege the Vatican did not want anyone else to perform it. Mozart's father Leopold wrote as much to his wife in a letter: that no one was allowed to take the music away from the chapel or make copies of it and that the Vatican called for excommunication of anyone trying to make a copy. Musicologist Ben Byram- Wigfield says: \"It's a lovely story, but none of it is true.\" Graham O'Reilly, in tackling why manuscripts weren't widespread, explains there are only two possible answers. Either: > # the MSS which contained them really were so secret that they did not leave > the choir room, or # the tradition was still largely an oral one. This > second solution, of course, does not preclude some phrases being scribbled > onto separate parts as aides-mémoire, but which by their unorganised and > temporary nature, remained out of the mainstream of the official archives. In any case, by 1770 there were three known copies of the music. One of these was given to the Emperor Leopold I by the pope. Wolfgang Amadeus Mozart visited the Sistine Chapel during a tour of Europe with his father in 1770. He was just 14 years old, but heard the piece and wrote all the music out from memory later the same day. A second visit enabled him to check that he had it written correctly. It has been suggested that Mozart's copy of the music was sent to England where it was published by Dr Charles Burney. O'Reilly casts doubt on this: \"It seems unlikely that [Mozart] would have needed [two visits] to note down what Burney subsequently printed\", so anodyne was it. It is believed that the version of the Miserere mei Deus performed today, is very different to the work that Allegri composed. ==References== Category:1582 births Category:1652 deaths Category:Baroque composers Category:17th-century Italian composers Category:Musicians from Rome Category:Italian Roman Catholic priests",
 "title": "Gregorio Allegri"
}