{
 "id": "1183721",
 "text": "Meitei people (), also known as the Manipuris (), in West Bengal, are an ethnic group, mostly originated from the northeastern Indian state of Manipur. Their migration to West Bengal occurred in multiple phases, often driven by educational, occupational, and administrative opportunities. Concentrated primarily in urban centers such as Kolkata, the community maintains linguistic and cultural practices associated with Meitei identity, including the use of the Meitei language (also known as Manipuri) and observance of traditional Meitei festivals and rituals. Despite assimilation into the broader Bengali- speaking environment, the Meitei population in West Bengal continues to preserve aspects of their distinct socio-cultural heritage. == History == Meitei King Bhagya Chandra Singh was a ruler of Manipur Kingdom and a key figure in the cultural and religious history of Meitei Hindus. In 1797, with an agreement with Raja Krishnachandra, the king of Nadia, in a piece of land along the Ganga in Nabadwip, which became known as 'Manipur Rajkunja,' a temple named, Anumahaprabhu Mandir, was established in honor of Chaitanya Mahaprabhu, attracting pilgrims from various regions, including Manipur, Tripura, Assam, and Bangladesh. The town of Nabadwip, located in West Bengal, is home to the Anumahaprabhu temple complex, which includes a temple, pond, garden, guesthouses, and residential buildings. The complex is managed by Sri Sri Anumahaprabhu Sebait Samity. The temple has faced challenges, including the loss of part of the land to refugees and opposition to nearby construction projects, such as a proposed meat processing plant. Yaoshang, a Meitei festival, simultaneous with the birthday of Chaitanya Mahaprabhu, is the most prominent festival held at the temple. The death anniversary of Maharaja Bhagya Chandra Singh is also commemorated annually with lectures on Meitei culture and Vaishnavism. The temple and its associated activities serve as a prominent center of Meitei cultural and religious identity. == Cinema == ARCUREA is a seven-day international event organized by the Satyajit Ray Film and Television Institute (SRFTI) in Kolkata. As part of the event’s inauguration, the digitally restored Meitei language film Ishanou (1990), directed by Aribam Syam Sharma and restored through a collaboration between the Film Heritage Foundation and the Manipur State Film Development Society (MSFDS), was screened at SRFTI’s main auditorium. The screening formed part of the Festival of Restored Films, which featured works from Manipur alongside other historically significant Indian films. The event also acknowledged the contributions of the State’s film archive and preservation body, SNCCAM, highlighting the 4K digitisation of Brojendragee Luhongba, the first film directed by a Meitei filmmaker, and the preservation of film reels from Mainu Pemcha (1948), considered Manipur’s earliest feature film attempt. The Meitei language film \"Joseph’s Son,\" directed by Haobam Pabankumar, received the Special Jury Award in the Indian Language Films category at the 29th edition of the Kolkata International Film Festival (KIFF). It was selected to compete alongside eleven other Indian language films at the event, held from 5 to 12 December 2023. The Kolkata premiere of the documentary by Meena Longjam, the first female filmmaker from Manipur to win the National Award for her debut documentary \"Autodriver,\" took place at the 10th Kolkata People’s Film Festival on Republic Day in January 2024. Joshy Joseph's \"Aribam Syam Sharma - Laparoscopic Cinemascapes,\" a film honoring the legendary Manipuri director, was screened at the Indian pavilion during the 2023 Cannes Film Festival in May. == Dance and music == Manipuri dance is highly regarded in Kolkata, largely due to the influence of Rabindranath Tagore, who was an admirer of this traditional art form. Tagore played a key role in introducing Manipuri dance, which originated in the temple courtyards of Manipur, to a broader audience beyond its regional roots. Manipuri classical dance is offered as part of the curriculum in the Department of Manipuri Dance at Rabindra Bharati University, Kolkata. Thabal Chongba, a traditional dance linked to the Yaoshang festival of Manipur, is also performed during the Ningol Chakouba festival in Kolkata. In October 2022, Kolkata hosted performances as part of the Sangai Festival, featuring Manipur's cultural traditions, including Pung Cholom, Thang Ta martial art, and Maibi Jagoi dance. == Festivals == The Festival of Manipur 2003 commenced on January 14 in Kolkata with a procession starting from Aiketan and concluding at the Swabhumi complex. Led by Dr. Nara Singh, the Minister of Arts and Culture of Manipur, the procession included over 400 participants, such as traditional dancers, schoolchildren, and artisans, and conveyed a message of peace under the theme \"A Culture of Peace.\" The event marked the culmination of a journey that began in Imphal on January 10, with participants traveling by bus to Kolkata. The festival's inauguration was attended by the Governors of Manipur and Nagaland, who highlighted the significance of cultural exchange. The festival featured a variety of performances, including Lai Haraoba, Pung Cholom, and Thang Ta, showcasing the diverse cultural heritage of Manipur. In Kolkata, Manipuris residing in the city celebrate Ningol Chakouba, a Meitei festival, which translates to 'feast for daughters' (with 'ningol' meaning daughter and 'chakouba' meaning feast), involves married daughters being invited to their parents' home, where they are treated to a feast and given gifts. The event celebrates the bond between married women and their parents, as well as other family members. In 2015, the Manipuri community in Kolkata observed Yaoshang, the traditional Meitei festival of Manipur, at Manipur Bhavan in Kolkata. The celebration included traditional dances, food, and the use of powdered colours. The event was primarily attended by students from Manipur residing in Kolkata for higher education. According to a representative of the Manipur Students' Association Kolkata (MASAK), approximately 100 individuals participated in the festivities, which commenced in the evening and continued into the night. Manipuris in Kolkata observe Patriots’ Day annually by organizing an interfaith prayer meeting. The event is held to commemorate the day and promotes participation from followers of various religious communities. == Language and literature == On October 14, 2019, Manipuris in Kolkata (MIK), in collaboration with the Poetry and Fiction Club, Manipur, observed \"Manipuri Poetry Day\" at Manipur Bhavan in Kolkata. The event featured an open reading session during which twelve prominent Meitei language writers presented their poetry. In a formal address, the president and chief guest noted the significance of holding such an event in Kolkata and highlighted its potential to inspire younger generations. == Theatre == Banian Repertory Theatre's Meitei language play Kumudini was selected as one of 19 plays for the 29th Nandikar National Theatre Festival, held from December 16 to 25, 2012, at the Academy of Fine Arts in Kolkata. The Nandikar National Theatre Festival is recognized as one of the largest theatre events in Kolkata and India, providing a platform for both established and emerging theatre practitioners from across India and internationally. Directed by M.C. Thoiba and written by Dr. M.C. Arun, Kumudini depicts the story of Maharani Kumudini, the wife of Meitei King Gambhir Singh, who played a key role in liberating Manipur from Burmese occupation during the Chahi Taret Khuntakpa (The Seven Years Devastation). After the death of Maharaja Gambhir Singh, Kumudini faced political challenges from her husband's relatives who sought control of the throne. She ultimately succeeded in placing her son, Chandrakirti, on the throne, overcoming significant political opposition. The play explores the complex position of Meitei women in society, addressing themes of power, gender roles, and political influence. Set against the backdrop of Kumudini's life, the narrative examines the broader socio-political context of Meitei women’s roles and their agency in a patriarchal culture. Kumudini, originally produced in 2007, was later performed in the 7th Abhinaya National Theatre Festival in Hyderabad and Tirupati in August 2012. The performance at Ravindra Bharati was noted for its thematic depth and experimental approach. A review by theatre critic Gudipoodi Srihari in The Hindu (August 23, 2012) commended the production for its strong thematic content and the engaging nature of the performance, despite the language barrier for the audience. In 2019, the Kanglei Mime Theatre Repertory, consisting of 13 members, participated in the India International Mime Festival held in Kolkata from March 24 to 30. The troupe presented the mime play \"No Budget,\" directed by Dr. Yumnam Sadananda. The participation was supported by the Ministry of Culture and Sangeet Natak Akademi, New Delhi. In addition to the performance, Dr. Sadananda also contributed as a resource person at workshops and interactions organized during the festival. Among the participants were two differently-abled artists, Bilu Roy and M Inaoton. The festival, organized by Indian Mime Theatre Kolkata in collaboration with the Ministry of Culture and the Eastern Zonal Cultural Centre, featured 25 international mime groups and 20 Indian groups. The Kanglei Mime Theatre Repertory was also scheduled to perform \"No Budget\" at the National Mime Festival in Kerala from May 10 to 12, 2019. == Sports == In 2010, a 34-member Manipuri polo team participated in the Invitational Polo Tournament held in Kolkata from December 18 to 25. The team showcased the traditional Pana Sagol Kangjei during the event. Unlike the previous year, when state players had struggled with the larger horses provided by the organizers, the team brought their own horses for improved performance. The tournament featured three categories: six goals, eight goals, and ten goals, with Manipur competing in the six-goals category. The Indian Army assisted in the preparation for the event, and the Chief of the Army Staff attended the closing ceremony. The team comprised 11 officials and artists, 15 players, and eight horse attendants. == Notable people == * Bimbavati Devi, a Manipuri dancer based in Kolkata * Haobam Bella Devi, a 1st Winter Queen crown at Beauty Pageant, 2011, organised by Ordinance Club, Kolkata * Kalavati Devi, one of the directors of Manipuri Nartanalaya and heads of the department of Manipuri Dance at Rabindra Bharati University, Kolkata == Associations and organizations == * Anjika – Center for Manipuri Dance, Kolkata * Kolkata Apunba Lup * Manipuris in Kolkata (MIK), an organisation formed by the people from Manipur living in the city of Kolkata * Manipuri Nartanalaya, a dance troupe based in Kolkata * Manipur Students' Association Kolkata (MASAK) == Gallery == File:Maa Durga Images - An image of Goddess Durga from Kolkata.jpg File:An image of Krishna stands in the background as part of colorful decorations of a Durga Puja pandal in Kolkata.jpg == Related pages == * Meitei people in Australia * Meitei people in Canada * Meitei people in the United Kingdom * Meitei people in the United States * Meitei people in Bangladesh * Meitei people in Korea * Meitei people in Myanmar * Meitei people in Assam * Meitei people in Maharashtra * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura == References == Category:Meitei people Category:West Bengal",
 "title": "Meitei people in West Bengal"
}