{
 "id": "118333",
 "text": "Homo floresiensis (\"Flores Man\", also called \"hobbit\") is a probable species in the genus Homo, to which humans belong. The remains were found in 2004 on the island of Flores in Indonesia. Parts of the skeletons of nine individuals were found, including one complete cranium (the head).Brown P. et al 2004. A new small-bodied hominin from the Late Pleistocene of Flores, Indonesia. Nature 431 (7012): 1055–1061. Morwood M.J. et al 2005. Further evidence for small-bodied hominins from the Late Pleistocene of Flores, Indonesia. Nature 437 (7061): 1012–1017. The most important and obvious identifying features of H. floresiensis are its small body, and small size of the space for the brain inside the skull. This is why the discoverers have called members of the species \"hobbits\", after J.R.R. Tolkien's fictional race of roughly the same height. ==Discovery== The remains were discovered on the Indonesian island of Flores by an Australian-Indonesian team of archaeologists in 2003. Archaeologist Mike Morwood and colleagues were looking for evidence of the original human migration of H. sapiens from Asia to Australia.Morwood M.J. et al 2004. Archaeology and age of a new hominin from Flores in eastern Indonesia. Nature 431 (7012): 1087–1091. They were not expecting to find a new species. They were surprised at the discovery of a nearly complete skeleton of a hominin. Excavations done after that found seven more skeletons, originally thought to be from 38,000 to 13,000 years ago. An arm bone which they think belongs to H. floresiensis was dated at about 74,000 years old. The specimens are not fossilized and have \"the consistency of wet blotting paper\"; once exposed. The bones had to be left to dry before they could be dug up.Nature 2004. Little lady of Flores forces rethink of human evolution. Nature 431 (7012): 1029. Morwood, Mike; van Oosterzee, Penny 2007.A new human: the startling discovery and strange story of the \"Hobbits\" of Flores, Indonesia. Smithsonian Books. However, more extensive stratigraphic and chronological work pushed the most recent evidence of their existence back to 50,000 years ago. Their skeletal material is now dated to from 100,000 to 60,000 years ago. Stone tools recovered alongside the skeletal remains were from archaeological horizons ranging from 190,000 to 50,000 years ago. Researchers hope to find preserved mitochondrial DNA to compare with samples from similarly unfossilised specimens of Homo neanderthalensis and H. sapiens. This hominin is remarkable because it has a small body and brain. There are also a lot of stone tools found in the cave. The tools are of a size that could be used by the 1 meter tall human. They are dated from 95,000 to 13,000 years ago. They are found in the same archeological layer as an elephant of the extinct genus Stegodon. The hobbit might have hunted this elephant. The elephant would have been very common throughout Asia during the Quaternary. Other animals that lived on the island at that time were giant rats, Komodo dragons, and even larger species of lizards.The Age. October 28, 2008. Lost race of human 'hobbits' Homo sapiens reached the region by around 45,000 years ago.Smithsonian, July 2008. The great human migration == A new species or not? == Archaeologist Mike Morwood and colleagues who found the remains say they think the individuals belong to a new species, H. floresiensis, in our human genus Homo. The discoverers also say that H. floresiensis might have lived at the same time as modern humans (Homo sapiens) on Flores. Not everyone agrees that this is a new species. Indonesian anthropologist Teuku Jacob suggested that the skull of LB1 was a modern human with microcephaly. This is a disorder that causes the bones of the head to stop growing. Another study says that perhaps the individuals were born without a working thyroid gland, which would result in the small size of the hominins because of a disorder called myxedema.Obendorf P.J; Oxnard C.E. & Kefford C.E. 2008. Are the small human- like fossils found on Flores human endemic cretins?. Proceedings of the Royal Society of London, B Biological Sciences. 275 (1640): 1287–1296. Two studies of the bones published in 2007 both reported evidence to support species status for H. floresiensis. A study of three bits of bones from the hand (carpals) showed that they were similar to the carpal bones of a chimpanzee or an early hominin such as Australopithecus. They were also different from the bones of modern humans.Tocheri M.W et al 2007. The primitive wrist of Homo floresiensis and its implications for hominin evolution. Science 317 (5845): 1743. New Scientist, September 20, 2007. 'Hobbitt' wrist bones suggest a distinct species. A study of the bones and joints of the arm, shoulder, and legs also concluded that H. floresiensis was more similar to early humans and apes than modern humans.Larson et al 2007. Homo floresiensis and the evolution of the hominin shoulder. Journal of Human Evolution 53 (6): 718–31. preprint online Guardian, September 21, 2007. Yes, it's a Hobbit. The debate that has divided science is solved at last (sort of). In 2009, the publication of a cladistic analysis,Argue, Debbie et al 2009. Homo floresiensis: a cladistic analysis. Journal of Human Evolution. and a study comparing body sizes,Jungers W. & Baab K. 2009. The geometry of hobbits: Homo floresiensis and human evolution. Significance 6 (4). gave further support for the theory that H. floresiensis and Homo sapiens are separate species. == Extinction == Archaeologists believe that the species has survived on Flores at least until 12,000 years ago. This makes it the longest lasting non-modern human. It also lived longer than the Neanderthals (H. neanderthalensis), which became extinct about 24,000 years ago. Because of a deep neighboring strait, Flores remained isolated during the last ice age. Because of this, the discoverers of H. floresiensis think that the species, or its ancestors, must have reached the isolated island by water transport around 100,000 years ago (or, if they are H. erectus, then about 1 million years ago). Local geology suggests that a volcanic eruption on Flores approximately 12,000 years ago was responsible for the end of H. floresiensis and animals that lived on the island. The elephant Stegodon also became extinct at this time. === Stories of later survival === There are local stories that a small race of people lived on the island. The Ebu Gogo were small, hairy, language-poor cave dwellers.Forth G. 2005. Hominids, hairy hominoids and the science of humanity. Anthropology Today 21 (3): 13–17. It is said that they were there at the time of the arrival of the first Portuguese ships during the 16th century. These creatures are claimed to have existed as recently as the late 19th century.Telegraph. 2 November 2004. Villagers speak of the small, hairy Ebu Gogo. Gerd van den Bergh, a paleontologist working with the fossils, reported hearing of the Ebu Gogo ten years before the fossil discovery. On the nearby island of Sumatra, there are reports of a 1-1.5m tall humanoid, the Orang Pendek which might be related to H. floresiensis.Dalton, Rex 2004. Little lady of Flores forces rethink of human evolution. Nature 431 (7012): 1029. == References == == Further reading == *Linda Goldenberg 2007. Little people and a lost world: an anthropological mystery. Minneapolis, Minnesota: Twenty-First Century Books. *Maciej Henneberg & John Schofield 2008. The Hobbit trap: money, fame, science and the discovery of a 'new species'. Kent Town: Wakefield Press. ==Other websites== * John D. Hawks. Blog of a professor of anthropology: ** ** ** * Homo floresiensis - The Smithsonian Institution's Human Origins Program * Hobbits in the Haystack: Homo floresiensis and Human Evolutions – Turkhana Basin Institute presentment at the Seventh Stony Brook Human Evolution Symposium Category:Hominins",
 "title": "Homo floresiensis"
}