{
 "id": "1183043",
 "text": "The Super Mario Bros. theme, officially named the \"Ground Theme\" is a musical theme. It was first heard in the first stage of the 1985 Nintendo Entertainment System (NES) video game Super Mario Bros. It was one of six themes made for the game by Koji Kondo, a composer for Nintendo. Kondo thought that it was the most difficult theme to make for the game. The theme is in the key of C major. It has a swing rhythm and uses syncopation. The original theme was made within the sound limitations of the NES's 8-bit hardware. In later installments with more powerful hardware, it is often remixed as a calypso song led by steel drums. It went on to become the main theme of the Mario franchise, and has appeared in most of its games. It has also been reused and remixed in other Nintendo-published games. The theme was included in the American National Recording Registry in 2023 for its importance to popular culture, becoming the first video game music song to be included. ==Composition== The theme's composer Koji Kondo said that out of the six music tracks in the Super Mario Bros. soundtrack, this theme took the most time to make. He stated that he would write one part of the song, and the developers would put it in the game. If it did not time up with Mario running and jumping or did not harmonize with the sound effects well enough, he would replace it. Kondo made the theme using only a small keyboard. The theme was influenced by the 1984 song \"Sister Marian\" by the Japanese band T-Square. The first theme that Kondo made for Super Mario Bros. was based on an early prototype of the game, which had Mario running around a big empty area. Kondo described this early theme as more \"lazy\", with a slower tempo. As the game was changed, he realized that that theme no longer fit, so he made it faster and changed it around to fit better. Kondo was allowed to make whatever he wanted for the soundtrack of Super Mario Bros. He would work with Shigeru Miyamoto, the game's director, daily. Miyamoto would tell Kondo about the type of music he liked, but he did not tell him exactly what to make. When the player has less than 100 units of time left to complete the level, the music becomes faster. ==Reception== Wired.com editor Chris Kohler said that the theme is one of the most famous in the world. Jeremy Parish of 1UP.com said that it is one of the most memorable tracks in video game history. Editors Jeff Dickerson and Luke Smith of The Michigan Daily newspaper said that if you were to ask a random student to hum the theme, they would likely know every note. Video game music composer Tommy Tallarico said that Kondo was the reason that he became a composer. He said that when he first heard this theme, it was the first time he thought music in video games really existed. Former Final Fantasy series composer Nobuo Uematsu said that Kondo was one of the best composers in the video game industry. He said that he was sure everyone in the world who has come across the Super Mario Bros. theme would never forget it. He also said that it should become the new national anthem of Japan. In an interview with Kondo, 1UP.com editor Sam Kennedy said that Paul and Linda McCartney visited Kondo in Japan and liked the theme. In 2023, the Super Mario Bros. theme was selected by the U.S. Library of Congress for preservation in the National Recording Registry because of its cultural importance. The theme was the first video game music track ever selected for preservation in the registry. ==Notes== ==References== Category:1985 songs",
 "title": "Super Mario Bros. theme"
}