{
 "id": "1183901",
 "text": "Bhuj () is a city and the headquarters of Kutch district in the Indian state of Gujarat. == Etymology == According to legend, the region of Kutch (also called Kachchh) was once ruled by Nāga chieftains. One of the key figures in this story is Queen Sagai of Sheshapattana, who was married to King Bheria Kumar. She led a revolt against Bhujanga, the last Nāga chieftain. In the battle that followed, Bheria was defeated, and Queen Sagai committed sati, the act of self-immolation. The hill where they lived eventually became known as Bhujia Hill, and the town at its base was named Bhuj. Over time, the local people began to worship Bhujanga as a snake god, and a temple was built in his honor. == Geography == Bhuj is located at an average elevation of 110 metres (about 360 feet) above sea level. On the eastern side of the city stands Bhujia Hill, which is topped by Bhujia Fort. This hill acts as a natural divider between Bhuj city and the nearby town of Madhapar, which is known as one of the richest villages in Asia. The city also has two main lakes—Hamirsar Lake and Deshadsar (દેેશળસર)—which add to its charm and are important water sources. == Places of interest == File:Prag_Mahal_Palace_Bhuj.jpg|Prag Mahal File:Aina_Mahal.jpg|Aina Mahal File:Sharad_Baugh_Palace_Bhuj_Kutch_Gujarat.jpg|Sharadbaugh Palace File:Kutch_Museum_Bhuj_Kutch_Gujarat_India.jpg|Kutch Museum File:Ramkund_Bhuj_Kutch_Gujarat.jpg|Ramkund File:Shri_Swaminarayan_Mandir,_Bhuj,_Gujarat.jpg|Swaminarayan temple File:Chhatedi_of_Bhuj.jpg|Chhatedi of Bhuj File:Hamirsar.JPG|Hamirsar Lake File:Mahadev_Gate.jpg|Mahadev Gate near Hamirsar Lake File:Darbargadh_Fort.jpg|Darbargadh Fort File:Smritivan_2001_Gujarat_earthquake_memorial_garden_in_Bhuj,_Gujarat,_India.jpg|Bhujia Fort and Smritivan on Bhujia Hill File:Tapakeshwari_Devi_Temple_near_Bhuj_Kutch_Gujarat_Indua.jpg|Tapakeshwari Devi Temple near Bhuj File:Fairground_near_Bhuj_-_panoramio.jpg|Hill Garden File:Vandemataram_Memorial.jpg|The Vande Mataram Memorial is located at Village - Bhujodi near Bhuj == Demographics == In 2011 the population of Bhuj was 213,514, which consisted of 111,146 males and 102,368 females. == Transportation == === Trains === Train no. Train Name Runs From Destination Departure Days Arrival Days 11091-11092 Bhuj-Pune express Bhuj Pune Wednesday Tuesday 14312-14311 via Ahmedabad & 14322-14321 via Bhildi Ala Hazrat Express Bhuj Bareilly Tuesday, Thursday & Sunday for 14312. Monday, Wednesday, Friday & Saturday for 14322 Friday, Saturday, Monday for 14311. Tuesday, Wednesday, Thursday & Sunday for 14321 22829-22830 Shalimar - Bhuj Weekly SF Express Bhuj Shalimar Tuesday Monday 22904-22903 Bandra Terminus Bhuj AC Superfast Express Bhuj Bandra Monday, Thursday, Saturday Thursday, Saturday, Monday 12960-12959 Bhuj Dadar Superfast Express Bhuj Dadar Monday, Thursday Wednesday, Saturday 19132-19131 Kutch Express Bhuj Bandra Daily Daily 19116-19115 Shayajinagari Express Bhuj Dadar Daily Daily == References == Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas",
 "title": "Bhuj"
}