{
 "id": "1183370",
 "text": "Meitei people (), also known as the Manipuris (), in Korea, constitute a small but gradually increasing diaspora, mostly originating from the northeastern Indian state of Manipur. Primarily composed of students, professionals, and workers, this group has migrated to South Korea in pursuit of higher education, employment opportunities, and academic research. While the community remains limited in number, its members often maintain cultural practices, language use, and social networks connected to their Meitei heritage. The presence of Meiteis in Korea reflects broader patterns of transnational mobility and cross-cultural interaction in contemporary Asia. == Cinema == A Meitei language feature film Leipaklei (), directed by Aribam Syam Sharma, was screened at the 14th Jeonju International Film Festival in South Korea. The film was shown on April 29 and May 1, 2013, as part of a special section titled \"Beyond Bollywood,\" which aimed to showcase films beyond the dominant Bollywood industry. == Cuisine == Meitei cuisine in Korea includes dishes like Rhou fish for Nga Thongba, Nganu Thongba, Nga Ataoba, Soibum Iromba, Hawaijar Chagem Pomba, Sougri Thongba, Singju, Chamfut, Nakuppi Bora, and Manipuri Papar, among others. Culinary preparations for the Meitei lunar new year festival, Cheiraoba, traditionally include a range of dishes specific to the occasion. These include Yongchak Eromba, Nga Thongba, Bora, Chamfut, Singju, and others. These foods are customarily prepared and consumed during the festival as part of ritual and communal observance. == Dance and music == During the Ningol Chakouba festival in Korea, Meitei participants performed the Thabal Chongba () group dance, and both Pibas (men) and Ningols (women) sang songs together as part of the celebration. == Festivals == === Cheiraoba === The Meitei lunar new year festival, Cheiraoba (), was celebrated on April 5th, 2025, at a pension house located in the suburbs of Anseong City, approximately 80 km south of Seoul. The event attracted Meitei individuals from various regions of South Korea. Some attendees traveled from the southern parts of the country, taking early morning trains, while others drove for 4 to 5 hours. The festival served as an occasion for the Meitei community to gather and observe the traditional customs associated with Cheiraoba. === Ningol Chakouba === The Ningol Chakouba () and get-together of the Korea Manipuri Association (KMA) took place on November 8, 2015, at a pension house in Nongin, located outside the main city area. During the event, Ningols were served a variety of dishes prepared by the pibas. After the meal, younger pibas presented gifts to the Ningols while receiving blessings from them. The gathering began on the evening of November 7 at a two-story pension house on the outskirts of Nongin. A discussion was held afterward regarding the strengthening of the KMA as an organization and its role in engaging with social activities in Manipur. In 2019, various communities from Manipur residing in South Korea celebrated Ningol Chakouba and Chavang Kut together under the Korea Manipuri Association (KMA). The event was held on November 2, 2019, at Lake Town pension house in Anseong City, South Korea. The celebration marked the harvest festival shared with the Chin Kuki Mizo tribal groups and featured a special luncheon for Meitei married women (Ningols), hosted by their brothers (pibas) at their natal homes. The theme of the event was \"Ching Tam Amatani\" (Hill valley is one). Approximately 40 KMA members participated, with people from different communities coming together to observe the festival, emphasizing communal harmony and the significance of the gathering. == Protests == On November 17, 2024, the Korea Manipuri Association (KMA) organized a protest in Seoul, South Korea, in response to the murder of six Meitei family members, including elderly women and children. The protest, held in Itaewon, was attended by approximately 150 individuals, including representatives from the Indians in Korea (IIK). Participants displayed placards with slogans such as \"End Kukis Terrorism in Manipur,\" \"Protect Human Rights,\" and \"Governments Must Act.\" == International activities == On June 7, 2023, members of the Korea Manipuri Association (KMA) met with the Ambassador of India to South Korea at the Indian Embassy. They submitted a memorandum calling for peace and a resolution to the ongoing conflict in Manipur. The KMA informed the Ambassador about the current crisis and requested the Indian government to take prompt action to address the violence, including controlling \"Kuki militants and their allies, Chin-Mizo terrorists, infiltrating from Myanmar.\" == Remittances == In 2015, the Korea Manipuri Association (KMA) and its members contributed over 1 lakh INR to various activities in Manipur. A significant portion of this contribution, approximately 90 thousand INR, was donated for flood relief efforts in the region. == Associations and organizations == * The Korea Manipuri Association (KMA) is an organization formed by Meitei people residing in South Korea, aimed at promoting cultural exchange, supporting social activities, and preserving Meitei traditions. == Related pages == * Meitei people in Australia * Meitei people in Canada * Meitei people in the United Kingdom * Meitei people in the United States * Meitei people in Bangladesh * Meitei people in Myanmar * Meitei people in Assam * Meitei people in Maharashtra * Meitei people in Meghalaya * Meitei people in Nagaland * Meitei people in Tripura == References == Category:Meitei people Category:Korea Category:South Korea",
 "title": "Meitei people in Korea"
}