{
 "id": "1183752",
 "text": "During the Kosovo War, the Yugoslav police and armed forces committed a series of massacres against Kosovo Albanians. ==Casualties== 7,000–9,000 Kosovo Albanians were killed, while 848,000 of them were expelled from Kosovo during the war. The number of Kosovo Albanians killed by the Yugoslavs is roughly the same as that of the Bosniaks killed in the Bosnian genocide. * * * * * * * * * * * ==Timeline== ===March 1998=== * Likoshan and Çirez massacres – 26 Albanian civilians were killed. * * * * Drenica massacre – there were 29 identified corpses discovered in a mass-grave, committed by Serbian law enforcement. * Attack on Prekaz – Serbian forces launched an operation aimed at killing Adem Jashari and his family on March 5–7, 1998. Approximately 58 members of the Jashari family were killed, including at least three non-combatants by summary execution and 28 women and young children. ===July 1998=== * Orahovac massacre – Serbian forces executed 79 ethnic Albanians on 17–20 July 1998. ===September 1998=== * Gornje Obrinje massacre – 18 corpses were found,Europe | Serbs attack Kosovo massacre reports . BBC News (October 1, 1998). Retrieved on 2011-04-30. but more people were slaughtered. ===January 1999=== * Račak massacre on January 15, 1999 – 45 Albanians were rounded up and killed by Serbian special forces. The first forensic report, by a joint Yugoslavian and Belarusian team, concluded that those killed were not civilians. The massacre provoked a shift in Western policy towards the war. * Europe | Racak massacre haunts Milosevic trial . BBC News (February 14, 2002). Retrieved on 2011-04-30. * * * ===March 1999=== * Pastasel massacre – Serbian forces entered the village of Pastasel and expelled the women to Albania. Men from the village were gathered and 106 were executed. * Krusha massacres – The ICTY discovered 98 bodies at Velika Kruša and, according to HRW, the number of people killed could exceed this number. According to the ICTY, Sava Matić participated in the murder 42 persons on March 26, 1999.SUĐENJA ZA RATNE ZLOČINE – Presuda Savi Matiću zasnovana je na dokazima – Fond za humanitarno pravo . Hlc-rdc.org. Retrieved on 2011-04-30. There were also reports of mass rape.Dla Myvedete wojna się nie skończyła . Serwisy.gazeta.pl. Retrieved on 2011-04-30. * Suva Reka massacre on March 26, 1999 – 48 Albanian civilians killed, among them many children.Serbia jails ex-policemen for the Kosovo massacre – Europe, World . The Independent (April 23, 2009). Retrieved on 2011-04-30. * Imeraj massacre on March 26, 1999 – Serbian forces entered the village of Pemishtë/Cërkolez and killed 19 Albanian civilians including 13 women and children.Milosevic faces justice for the Serbs' crimes against humanity . Telegraph. Retrieved on 2022-02-26. * Bela Crkva massacre – 62 known fatalities * Izbica massacre – Serbian forces killed at least 93 Albanian civilians.U.S. Massacre video matches mass grave evidence . CNN (May 19, 1999). Retrieved on 2011-04-30.\"OSCE Daily Broadcast Media Overview\" UNMIKonline.org March 28, 2000 Link Retrieved January 5, 2010 * Podujevo massacre – 14 Albanian civilians were killed and 5 wounded, including women, children and the elderly.Massacre described at Kosovo war crimes trial – International News | News of the World | Middle East News | Europe News . FOXNews.com (December 11, 2008). Retrieved on 2011-04-30. ===April 1999=== * Poklek massacre – at least 47 people were forced into one room and systematically gunned down on April 17, 1999. The precise number of dead is unknown, although it is certain that 23 children under the age of fifteen were killed in the massacre.UNDER ORDERS: War Crimes in Kosovo – 5. Drenica Region . Hrw.org. Retrieved on 2011-04-30. * Mala Kaludra massacre on April 19, 1999 – 23 Albanian refugees were killed by Serbian paramilitaries as they fled towards Montenegro.Idriz Rreci dhe grupi i tij u vra nga Jovica Utviq . ekonomia (albanian) (January 7, 2013). * Rezala massacre – About 83 Albanian civilians were captured and most of them were executed, leaving only two survivors. * Meja massacre – at least 377 persons were killed by Serbian police and paramilitary forces on April 27–28 1999. ===May 1999=== * Vushtrri massacre – More than 100 Kosovo refugees were killed by Serbian Police. * Ćuška massacre – 41 known victims.Qyshk . Americanradioworks.publicradio.org. Retrieved on 2011-04-30. * Dubrava Prison massacre – Prison guards killed more than 70 Albanian prisoners in Dubrava Prison. * Albanian leaders massacre – 5 Albanian leaders were killed after they had attended the funeral of Albanian lawyer Bajram Kelmendi.Document – Federal Republic of Yugoslavia: Kosovo -Outrageous Execution of ethnic Albanian leaders | Amnesty International . Amnesty.org (March 29, 1999). Retrieved on 2011-04-30. ==Related pages== * The Holocaust * Bosnian genocide * Cambodian genocide * Genocides by the Soviet Union * The Bosnian Book of the Dead ==References== Category:Socialism Category:History of Yugoslavia Category:Crimes against humanity",
 "title": "Yugoslav massacres of Kosovo Albanians during the Kosovo War"
}