{
 "id": "1183969",
 "text": "MyLime is an Italian startup founded in 2018, specializing in digital product passports based on blockchain technology. == History == MyLime was founded in 2018 to develop a secure and tamper-proof certification system for physical assets, leveraging blockchain technology. The company gained recognition through participation in international events such as CES in Las Vegas and EICMA, where it showcased applications of its technology in the automotive and cycling industries. In 2023, MyLime was listed among the leading startups at the Salone del Mobile by Designtech, highlighting its growing influence in the design and technology sectors. === Technology and Applications === At the core of MyLime’s innovation is the Digital Product Passport (DPP), a blockchain- based digital archive linked to a physical product. The European Union has recognized Digital Product Passports as a key technology for sustainability, and MyLime’s platform aligns with upcoming EU regulations on circular economy and product traceability. === Cycling Industry === One of MyLime’s most notable applications has been in the cycling industry, where Colnago became the first bicycle manufacturer to integrate a blockchain-based digital passport for its frames. The system enhances security by allowing owners to verify authenticity, track ownership, and prevent theft. This innovation has been widely covered by cycling media, including CyclingNews, Bicycling Magazine, and GearJunkie. Despite this, some experts have raised concerns about adoption challenges and user accessibility, emphasizing that further industry-wide integration is needed. === Automotive and Classic Cars === In the automotive sector, MyLime has collaborated with historical brand to track vehicle authenticity and service history via blockchain. The company has also developed a specialized features for classic car certification which aims to preserve and verify the historical value of vintage vehicles. == Recognition and Partnerships == In 2022 and 2023, Elena with MyLime was included among the 50 most innovative female-led startups in Italy, as recognized by the GammaDonna Award. She is also part of the Corporate Advisory Board of the Rome Business School, contributing to research and innovation in blockchain applications for industry. == References ==",
 "title": "MyLime (blockchain)"
}