{
 "id": "1183366",
 "text": "The 2025 conclave was held to elect the new pope following the death of Francis, which occurred at 7:35 a.m. on Monday, April 21 of that year. The conclave began on May 7, 2025 in the Sistine Chapel. Robert Francis Prevost was elected as the new pope, and he took the name Leo XIV. ==Cardinal electors== Cardinals aged 80 years or older before the day the papacy is held, are not allowed to participate. As of 21 April 2025, there are 252 cardinals, of which 135 are under 80; 108 (80%) of the potential electors were appointed as cardinals by Francis. == Papabili == At the time of Francis's death, the College of Cardinals had a total of 252 members, of whom 135 were cardinal electors qualified to participate in the conclave, despite the fact that the apostolic constitution Universi Dominici Gregis sets a maximum limit of 120 electors. For the election of the new pope, a two-thirds majority of the votes is required, which is equivalent to 80 votes if the number of electors is 120. The following cardinal electors have been considered in the 2025 papal conclave by at least seven distinct media sources. Portrait Name Nationality Position at time of conclave Created cardinal Birth date Ref. Anders Arborelius Sweden Bishop of Stockholm (Francis) France Archbishop of Marseille (Francis) DR Congo Archbishop of Kinshasa (Francis) Hungary Archbishop of Esztergom-Budapest, Primate of Hungary (John Paul II) Malta Secretary General of the Synod of Bishops (Francis) Italy Cardinal Secretary of State (Francis) Italy Latin Patriarch of Jerusalem (Francis) United States Prefect of the Dicastery for Bishops (Francis) Guinea Prefect Emeritus of the Congregation for Divine Worship and the Discipline of the Sacraments (Benedict XVI) Philippines Pro-Prefect for the Section of First Evangelization of the Dicastery for Evangelization (Benedict XVI) Ghana Chancellor of the Pontifical Academy of Sciences and the Pontifical Academy of Social Sciences (John Paul II) Italy Archbishop of Bologna and President of the Episcopal Conference of Italy (Francis) == Papal election process == 2025 papal conclave 17 36 20 17 18 23 4 Total electors 135 Deceased pope Francis (2013-2025) New pope Leo XIV (2025-Present) As in the 2013 papal conclave, both the dean and vice-dean of the College of Cardinals are over the age of 80 and not able to participate. Therefore, Pietro Parolin, the most senior cardinal bishop under the age of 80, is expected to preside over the conclave. ==Controversies== ===Cardinal Becciu's Participation=== Cardinal Giovanni Angelo Becciu's possible participation in the 2025 conclave generated significant controversy both within and outside the Vatican. Becciu was convicted in December 2023 of embezzlement and abuse of power in connection with a failed real estate investment in London, United Kingdom, and sentenced to five and a half years in prison and permanently banned from holding office in the Holy See. Despite being stripped of his cardinal rights by Pope Francis in 2020, Becciu maintained that he was never formally notified of his exclusion from the conclave and that his participation in a 2022 consistory indicated that his prerogatives remained in effect. The Vatican has classified him as a \"non- elector,\" equating him with cardinals over the age of 80, although Becciu was 76 at the time. Cardinal Pietro Parolin, Secretary of State, presented two letters signed by Pope Francis, dated 2023 and March 2025, expressing his intention to exclude Becciu from the conclave. The cardinal announced on April 29, 2025, that he would not participate in the conclave scheduled for May 7, agreeing to withdraw \"for the good of the Church,\" following the presentation of the letters by Cardinals Parolin and Giovanni Battista Re. ==Rounds and voting== Ballot(s) Date Announcement Result(s) 1 9:00p.m. Black smoke 2–3 11:53a.m. Black smoke 4 4:30p.m. White smoke ===First day, Wednesday, May 7=== * First ballot: At 9:01 p.m. Rome time, the smoke from the burning of the first ballot paper rose; the result was negative (black smoke). This smoke was the latest recorded on the first day of a conclave since at least the beginning of the 20th century, surpassing that of the 2005 conclave, which occurred at 8:05 p.m. ===Second day, Thursday, May 8=== * Second and third ballot: The second day of the conclave began with two back-to-back ballots, at 10:30a.m and 12noon. Since there was no pope elected, ballots will follow at 4:30p.m. and 7p.m. Smoke is not necessarily issued after every unsuccessful election; as the ballots from two votes in the morning and in the afternoon are burned together (if they are both unsuccessful). This means that smoke will only appear once at the end of each morning and afternoon session. After the second and third vote had failed, the cardinals went to Santa Marta in order to have lunch, and returned to the Vatican Palace later in the afternoon for two more rounds of ballots. * Fourth ballot: The afternoon voting of the second day started at 4:30 p.m. Smoke began to billow from the chimney on the Sistine Chapel around 6 p.m local time, which eventually billowed into a white smoke, signifiying the election of a new Pope. Pope Leo XIV was introduced at around 7:13 p.m., protodeacon Dominique Mamberti delivered the \"Habemus Papam\" in which it was revealed that the new pope would be American Cardinal Robert Francis Prevost: ==Post-conclave== ===Reactions=== ====Political==== Various national leaders voiced their congratulations and comments regarding the election of the new pope. * – President Javier Milei tweeted in Spanish in all-caps, \"The forces of Heaven have given their verdict clearly\", while attaching an AI-generated image of a lion in papal robes, in reference of Leo, a Latin word for lion. * – Prime Minister Anthony Albanese wrote on social media, \"My heartfelt congratulations to Pope Leo XIV on his election\", calling it a \"moment of joy\", before asking for God's blessing. * – Chancellor Christian Stocker tweeted in German, congratulating Pope Leo XIV on his election. * – President Ilham Aliyev congratulated Pope Leo XIV on his election, saying he was \"confident that our fruitful cooperation with the Holy See will continue to develop successfully through our joint efforts in promoting universal values and creating the atmosphere of mutual understanding and trust among civilizations.\" * – President Luiz Inácio Lula da Silva tweeted in Portuguese, congratulating Pope Leo XIV on his election and hoping the Pope \"continues the legacy of Pope Francis\". * – Prime Minister Mark Carney said in a public statement, \"Canadians offer best wishes to His Holiness Pope Leo XIV as he begins his papacy. At a time of profound global challenges, may his pontificate be marked by wisdom, discernment, a deep commitment to common good, and dignity of all.\" * – Foreign ministry spokesperson Lin Jian issued congratulations on the election of Pope Leo XIV. He also stated that \"under the leadership of the new pope, the Vatican will continue to have dialogue with China in a constructive spirit, have in-depth communication on international issues of mutual interest, jointly advance the continuous improvement of the China-Vatican relations and make contributions to world peace, stability, development and prosperity.\" Two government- affiliated Catholic groups, the Chinese Catholic Patriotic Association and the Bishops' Conference of Catholic Church in China, also congratulated the new Pope on his election. * – President Gustavo Petro stated that he hopes that Pope Leo XIV would become a great leader for people with migrant backgrounds around the world, encouraging Colombia's Latin American migrant brothers and sisters, that according to him faced humiliation in the United States under the current government. * – President Daniel Noboa tweeted in Spanish, welcoming Leo as the new Pope \"with hope in our hearts\". * – European Council president António Costa, European Commission president Ursula von der Leyen, and European Parliament president Roberta Metsola all sent congratulatory messages to the new Pope. * – President Emmanuel Macron congratulated the new Pope with a message that went as followed: \"To Pope Leo XIV, and to all Catholics in France and around the world, I extend a message of fraternity.\" * – Chancellor Friedrich Merz congratulated the newly elected Pope, saying that through his role, he would provide \"hope and guidance to millions of believers around the world in these challenging times\". * – Prime Minister Kyriakos Mitsotakis gave his congratulations online, highlighting the importance of the new Pope's leadership during \"a time when the world faces profound challenges\". * – Prime Minister Narendra Modi offered his \"sincere felicitations and best wishes\" for the new head of the Catholic Church via a tweet. * – President Prabowo Subianto via Minister of the State Secretariat Prasetyo Hadi congratulated the newly elected Pope, adding that the president himself would soon issue an official statement. * – President Michael D. Higgins said, \"I send Pope Leo my very best wishes as he begins his pontificate, and I welcome his statement that he is prepared to lead with compassion.\" * – President Isaac Herzog stated that Israel would \"look forward to enhancing the relationship between Israel and the Holy See, and strengthening the friendship between Jews and Christians in the Holy Land and around the world\". * – Prime Minister Giorgia Meloni stated that \"in a time marked by conflict and unrest, his words from the Loggia of Benedictions are a powerful call to peace, brotherhood and responsibility\". * – President Joseph Aoun congratulated the newly-elected pope and stated that he hoped the new pontiff would \"strengthen dialogue between religions and cultures\". * – Prime Minister Anwar Ibrahim called the election of Pope Leo XIV \"a historic occasion\" and expressed confidence that it would bring renewed purpose and inspiration to the global Catholic community. He also emphasised Malaysia's valued relationship with the Holy See, highlighting hopes for continued engagement rooted in mutual respect, dialogue and a shared commitment to peace and human dignity. * – President Claudia Sheinbaum praised Pope Leo's values \"in favor of world peace and prosperity\". * – King Mohammed VI congratulated Pope Leo, highlighting relations between the Holy See and Morocco, which he said were \"united by an unwavering commitment to peace and the principles of living together\". * – President Dina Boluarte wrote on social media that Pope Leo XIV's election was a day of \"pride and hope\" for the nation of Peru, which for more than 20 years was \"his home, his mission and his faith\". * – President Bongbong Marcos congratulated the newly elected Pope, adding that he \"prayed that [the Pope] will continue to bring the Church closer to the poor and disadvantaged\". * – President Andrzej Duda asked the Pope to \"accept the assurance of the readiness of the Republic of Poland to further strengthen\" its \"unique bonds—in the name of shared values, responsibility for the common good and the strengthening of peace in the world\". * – President Vladimir Putin stated that he was \"confident that the constructive dialogue and cooperation established between Russia and the Vatican\" would \"continue to develop on the basis of the Christian values\" that unite the two nations. Primate of the Russian Orthodox Church, Patriarch Kirill of Moscow, also congratulated the new Pope, expressing hope for the development of relations between the churches. * – Prime Minister Lawrence Wong congratulated Pope Leo on Facebook, acknowledging his values as \"longstanding relationship with the Holy See and appreciates the Catholic Church's contributions to promoting peace, compassion, and religious harmony in our nation\". * – Prime Minister Pedro Sánchez wished that the Pope's pontificate would \"contribute to strengthening dialogue and the defence of human rights in a world that needs hope and unity.\" * – President Cyril Ramaphosa commented that \"Pope Leo XIV's early emphasis on peace is a call that resonates with most of humanity and is one that honours the legacy of the late Pope Francis\". * – President Lai Ching-te congratulated the new Pope via the foreign ministry. He also tweeted, \"We look forward to building on our diplomatic ties with the Holy See, 83 years strong, to advance peace, justice, solidarity, and benevolence.\" * – President Volodymyr Zelenskyy stated that \"at this decisive moment for Ukraine\", the nation hopes for the \"continued moral and spiritual support of the Vatican in Ukraine's efforts to restore justice and achieve a lasting peace\". * – Prime Minister Keir Starmer highlighted that \"the election of Pope Leo XIV is a deeply profound moment of joy for Catholics in the United Kingdom and globally, and begins a new chapter for the leadership of the Church and in the world\". Buckingham Palace said that King Charles III had sent \"most sincere good wishes for his pontificate\". * – President Donald Trump posted a message on Truth Social, congratulating Leo XIV for being the first American pope and expressing interest in meeting him soon. He also described the election of an American pope as \"a great honor\" for the United States. Vice President JD Vance, who is a Catholic convert and the last known politician to meet Pope Francis alive, congratulated Leo XIV via a tweet, adding that he is sure \"millions of American Catholics and other Christians will pray for his successful work leading the Church.\" Former presidents Joe Biden (the second Catholic U.S. president), Barack Obama (a fellow Chicagoan and a U.S. Senator from Illinois before becoming president), George W. Bush, and Bill Clinton, as well as former vice president Kamala Harris, also congratulated the new pope. Chicago mayor Brandon Johnson also congratulated the new pope, tweeting: \"Everything dope, including the Pope, comes from Chicago.\" * – President Yamandú Orsi congratulated the election of Leo XIV, highlighting his \"chosen\" connection with Latin America. Meanwhile, the Ministry of Foreign Relations issued a statement expressing the hope that his pontificate \"contributes to world peace and sets an example, spreading goodwill, hope, solidarity, generosity, and social justice\". ==References== Category:2025 in Europe Category:2025 elections Category:Papal conclaves Category:April 2025 events Category:2025 elections in Europe Category:May 2025 events",
 "title": "2025 papal conclave"
}