{
 "id": "1183593",
 "text": "Gernot Plassnegger (born 23 March 1978 in Leoben) is a former Austrian football player. He played as defender. He also played one match for the Austrian national football team. After the end of his career he became coach. ==Career == Plassnegger began his career at his hometown club, FC Trofaiach. Via ASVÖ FC Puchhe moved to Austria Salzburg at the age of 19. There, he won the Austrian championship in his second season under coach Heribert Weber. In 1998 Plassnegger moved to Austria Vienna. He played there for two and a half years. During the winter break of the 2000/01 season he signed with 1. FC Saarbrücken . He played a powerful second half of the season and went to the Bundesligaclub VfL Wolfsburg. However, he was unable to establish himself. He was loaned back to SV Waldhof Mannheim in the 2. Bundesliga. There, the Styrian was particularly impressive as a striker, scoring ten goals in 26 league matches. 2003 he went Hansa Rostock. However, after failing to secure a regular place he returned to Austria after a total of three and a half years in Germany. He signed with GAK. In the spring of 2006, Plassnegger left GAK due to unpaid wages. He moved to SK Rapid in June. He then moved to SK Austria Kärnten in 2007. For the 2008/09 season, Gernot Plassenegger signed for three years with Greek first division club Ergotelis. He left Greece after one season and moved to FC Admira Wacker Mödling. During this time he achieved promotion to the Bundesliga and qualification for the UEFA Europa League. For Admira he played 139 matches. After five years the contract was not renewed in 2013. That is why he ended his career. ==International == In total, Plassnegger played 53 times for the Austrian junior teams. On 6 October 2006, he also made his only appearance for the Austrian national team in a 2-1 friendly win against Liechtenstein in Vaduz. ==Manager career == Plassnegger became coach of Grazer AK for the 2013/14 season. In September 2017, he became coach of second-division club SC Austria Lustenau. Austria Lustenau Homepage (German) After two years as coach of Lustenau, he resigned from his position in September 2019. In March 2020, he became coach of Grazer AK for a second time.GAK Homepage (German) GAK parted ways with Plassnegger in October 2021.GAK Homepage (German) 2024 he became coach of SV Oberwart in the Regionalliga Ost (3rd tier). == References == Category:1978 births Category:Living people Category:Austrian footballers Category:SK Rapid Wien players Category:FC Red Bull Salzburg players Category:Austrian football defenders Category:Austrian football champions Category:FK Austria Wien players Category:Austrian football managers Category:Players of the Austrian national football team",
 "title": "Gernot Plassnegger"
}