{
 "id": "1183238",
 "text": "Animal Instincts is a 1992 indepedent, erotic thriller and drama movie. Its director is Gregory Dark. The movie was followed by two sequels–Animal Instincts 2 (1994) and Animal Instincts 3 (better known as Animal Instincts: The Seductress). ==The synopsis== Joanna is married to David Cole. The latter is a police worker. They love each other although their relationship is in a dangerous and unsure position. That's because David's impotence prevents them from being intimate to each other. Joanna then begins getting sexually frustrated and performs an extramarital affair with a cable television repairman. They are caught in the act by David. This is when David responds through passionately having sex with Joanna (to her surprise). Joanna and David then get involved under voyeurism. Joanna Cole becomes involved with several affairs to multiple other men in her and David's home. David records these activities with hidden cameras for himself to later watch. But then, problems begin coming up when the local mob learn of the couple's sexual activities. The mob's leader blackmails Joanna and David into recording videotapes of encounters with a corrupt politician. ==Cast== * Shannon Whirry as Joanna Cole * Jan-Michael Vincent as corrupt politician Fletcher Ross * Maxwell Caulifeld as David Cole * David Carradine as William ==Release== Animal Instincts was released in the United States under an R-rating (restricted) for profanity and explict sexual content. In Australia, this same movie was given an R18+ (the restricted) rating for high level sexual content. The reviews of Animal Instincts were mixed-to-negative in accordance to audience and the movie critics together. With Rotten Tomatoes, the audience were giving the movie only a 14% rating. The Radio Times magazine gave two out of five stars to Animal Instincts and described it as \"the thriller that made Shannon Whirry a favourite of the top-shelf brigade\". The Radio Times critics later wrote: \"Director Gregory Hippolyte, who became one of the genre's leading directors, presents the many couplings with some panache, but he can't hide the fact that this is really just Emmanuelle for the 1990s.\" ==References== Category:1992 independent movies Category:1992 crime thriller movies Category:1990s erotic movies",
 "title": "Animal Instincts (movie)"
}