{
 "id": "1183696",
 "text": "The M23 campaign is a series of military attacks by the March 23 Movement (M23), a rebel group supported by Rwanda, in the Democratic Republic of the Congo. It started in March 2022. In November 2021, M23 began attacking the Congolese army (FARDC) and UN peacekeepers (MONUSCO), taking over military bases in Ndiza, Cyanzu, and Runyoni in North Kivu Province. At the same time, Uganda sent its army (UPDF) to the area to fight the Allied Democratic Forces (ADF), a Ugandan rebel group active in North Kivu and Ituri provinces. The fighting got worse between March and June 2022, when M23 took control of important places in Rutshuru Territory, including the key border town of Bunagana. This made Congolese soldiers run into Uganda. Uganda said that Rwanda planned the attacks to weaken Uganda’s fight against the ADF. Rwanda, however, said Uganda was using M23 fighters to threaten Rwanda’s safety. The Democratic Republic of the Congo (DRC) said Rwanda was giving weapons to M23 and helping restart the rebellion. A United Nations report supported the DRC’s claim. Rwanda and M23 said the DRC was working with the Democratic Forces for the Liberation of Rwanda (FDLR) and said their attacks were meant to protect the Banyamulenge people from FDLR attacks. A UN report also said Rwanda had already sent troops into Congo before the DRC and FDLR started working together. Experts said M23's comeback was more about money and business than about ethnic or security reasons. The fighting brought in more countries, and the East African Community (EAC) sent the East African Community Regional Force (EACRF) to help calm the situation. On 26 January 2023, M23 captured the town of Kitchanga. Frustrated that EACRF wasn't doing enough, the Congolese government asked the Southern African Development Community (SADC) for help and also created a reserve army. This led to the rise of local militias called the Wazalendo movement near areas controlled by M23. In June 2023, Human Rights Watch reported that M23 committed serious crimes like illegal killings, sexual violence, and other war crimes, with Rwanda also being blamed. The UN Security Council (UNSC) called for punishments against M23 leaders and accused high-ranking Rwandan officials of being involved. By March 2024, M23 started more attacks, taking places like Rwindi and a fishing area called Vitshumbi near Lake Edward. A UN report in April said that 3,000 to 4,000 Rwandan soldiers were in eastern Congo, more than the 3,000 M23 fighters. In June 2024, M23 and Rwandan forces captured Kanyabayonga and Kirumba and moved into Lubero Territory for the first time. Peace talks failed after Rwanda’s President Paul Kagame did not show up at a planned meeting with Congo’s President Félix Tshisekedi and Angola’s President João Lourenço. Because of Rwanda’s actions, many believed that Rwanda’s main goal in eastern Congo was to get access to Kivu's valuable minerals, not just to protect its security. Beginning in January 2025, M23 began making major advances towards Goma and Bukavu, the provincial capitals of North Kivu and South Kivu, with alleged Rwandan backing, intensifying growing tensions between the two nations. By 30 January, M23 had captured all of Goma and began an advance towards Bukavu, capturing the town by 16 February. Following the capture of Goma, M23 announced their intentions to march on Kinshasa. == Related pages== *List of ongoing armed conflicts *2025 Goma offensive == References == Category:CS1 German-language sources (de) Category:CS1 French-language sources (fr) Category:Africa",
 "title": "M23 campaign (2022–present)"
}