{
 "id": "1183781",
 "text": "Devanagari is an Indic script used for many Indo-Aryan languages of North India and Nepal, including Hindi, Marathi and Nepali, which was the script used to write Classical Sanskrit. There are several somewhat similar methods of transliteration from Devanagari to the Roman script (a process sometimes called romanization), including the influential and lossless IAST notation. Romanized Devanagari is also called Romanagari. == IAST == The International Alphabet of Sanskrit Transliteration, or IAST, is a way to write Indian languages like Sanskrit, Prakrit, and Pāli using the English alphabet. It is part of a larger standard called ISO 15919. Many people use IAST because it makes it easy to show the correct sounds of the words by using small marks called diacritics. In IAST, some letters that look similar in Indian scripts but sound different are written differently. For example, the letter द (which is a dental sound) is written as d, while the letter ड (which is a retroflex sound) is written as ḍ with a dot underneath. This helps people read and pronounce the words more correctly. One of the best things about IAST is that it is reversible. This means if you write something in IAST, you can easily change it back into the original Devanagari script or other Indian scripts without making mistakes. Many computer fonts support IAST, so it works well on screens and in print. This makes it helpful for scholars, students, and anyone who wants to write Indian languages using the Roman alphabet. == Hunterian system == The Hunterian system is the \"national system of romanization in India\" and the one officially adopted by the Government of India. The Hunterian system was created in the 1800s by William Wilson Hunter, who was the Surveyor General of India at the time. When he introduced it, many people disagreed with it. They preferred an older way of writing Indian names in English, even though that method was often confusing and incorrect—like turning “Siraj ud-Daulah” into “Sir Roger Dowler.” The debate peaked during a big meeting on 28 May 1872, where the Hunterian system was chosen. This new system became popular because it was more organized and easier to use with many Indian scripts. It focused on writing each letter (grapheme) from Indian languages into English, rather than trying to match sounds. Even though some people kept asking the government to go back to the old way, the Hunterian system eventually became the standard for both official and academic use. Over time, the Hunterian system was expanded to cover more scripts, like Burmese and Tibetan. It also included rules for when to drop the \"schwa\" sound (the short 'a' often implied in Indian scripts), which is common in Indo-Aryan languages. For example, the Hindi word कानपुर is written as kānpur (not kānapura) because the final \"a\" sound is not pronounced. But in Sanskrit, क्रम is written as krama because all vowels are usually pronounced. The system has changed a bit since it was first made. Originally, long vowels were shown using an accent mark, like ján for जान (meaning \"life\"). But in 1954, the Indian government changed that to a macron (a horizontal line), so now it's written jān. Still, the Hunterian system has its critics. Some say it doesn’t show pronunciation clearly and is too focused on what’s easy for English speakers to read. One big problem is that it doesn't tell apart certain sounds. For example, both द (a dental 'd') and ड (a retroflex 'd') are just written as d, even though they sound different. People have suggested fixes, like adding little marks below retroflex letters (ड = ḍ) or using capital letters (ड = D), but these changes have their own issues—either they’re harder to print, or harder to read. == Transliteration comparison == The following is a comparison of the major transliteration methods used for Devanāgarī. === Vowels === Devanāgarī IAST ISO 15919 Monier-Williams72 Harvard-Kyoto ITRANS Velthuis SLP1 WX Hunterian a a a a a a a a a ā ā ā A A/aa aa A A a i i i i i i i i i ī ī ī I I/ii ii I I i u u u u u u u u u ū ū ū U U/uu uu U U u e ē e e e e e e e ai ai ai ai ai ai E E ai o ō o o o o o o o au au au au au au O O au ṛ r̥ ṛi R RRi/R^i .r f q ri ṝ r̥̄ ṛī RR RRI/R^I .rr F Q ri ḷ l̥ lṛi lR LLi/L^i .l x L ḹ l̥̄ lṛī lRR LLI/L^I .ll X LY ṁ ṁ ṉ/ṃ M M/.n/.m .m M M n, m ḥ ḥ ḥ h H H .h H H m̐ m̐ .N ~ az ' ’ ' .a .a ' Z === Consonants === The Devanāgarī standalone consonant letters are followed by an implicit _shwa_ (/Ə/). In all of the transliteration systems, that /Ə/ must be represented explicitly using an 'a' or any equivalent of shwa. Devanāgarī IAST ISO 15919 Monier-Williams72 Harvard-Kyoto ITRANS Velthuis SLP1 WX Hunterian ka ka ka ka ka ka ka ka k kha kha kha kha kha kha Ka Ka kh ga ga ga ga ga ga ga ga g gha gha gha gha gha gha Ga Ga gh ṅa ṅa n·a Ga ~Na \"na Na fa n ca ca ća ca cha ca ca ca ch cha cha ćha cha Cha chha Ca Ca chh ja ja ja ja ja ja ja ja j jha jha jha jha jha jha Ja Ja jh ña ña ṅa Ja ~na ~na Ya Fa n ṭa ṭa ṭa Ta Ta .ta wa ta t ṭha ṭha ṭha Tha Tha .tha Wa Ta th ḍa ḍa ḍa Da Da .da qa da d ḍha ḍha ḍha Dha Dha .dha Qa Da dh ṇa ṇa ṇa Na Na .na Ra Na n ta ta ta ta ta ta ta wa t tha tha tha tha tha tha Ta Wa th da da da da da da da xa d dha dha dha dha dha dha Da Xa dh na na na na na na na na n pa pa pa pa pa pa pa pa p pha pha pha pha pha pha Pa Pa ph ba ba ba ba ba ba ba ba b bha bha bha bha bha bha Ba Ba bh ma ma ma ma ma ma ma ma m ya ya ya ya ya ya ya ya y ra ra ra ra ra ra ra ra r la la la la la la la la l va va va va va/wa va va va v, w śa śa ṡa za sha \"sa Sa Sa sh ṣa ṣa sha Sa Sha .sa za Ra sh sa sa sa sa sa sa sa sa s ha ha ha ha ha ha ha ha h ḻa ḷa La La .la La lY Devanāgarī ISO 15919 Harvard-Kyoto ITRANS Velthuis SLP1 WX Hunterian kṣa kSa kSa/kSha/xa k.sa kza kRa ksh tra tra tra tra tra wra tr jña jJa GYa/j~na j~na jYa jFa gy, jñ śra zra shra \"sra Sra Sra shr === Other consonants === Devanāgarī ISO 15919 ITRANS WX Hunterian qa qa kZa q k͟ha Ka KZa kh ġa Ga gZa gh za za jZa z fa fa PZa f ṛa .Da/Ra dZa r ṛha .Dha/Rha DZa rh == References == Category:Articles containing Hindi-language text",
 "title": "Devanagari transliteration"
}