{
 "id": "1184350",
 "text": "Stratford is a borough in Camden County, New Jersey, United States. As of the 2020 Census, 6,981 people lived there, which was 59 fewer people (−0.8%) than in 2010. In 2000, the population was 7,271.Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed April 26, 2025. The Rowan-Virtua School of Osteopathic Medicine is located in Stratford. == Geography == According to the United States Census Bureau, Stratford has a total area of 1.57 square miles (4.07 km²), all of it land. Stratford borders: * Gloucester Township (north and east) * Hi-Nella (north) * Laurel Springs (south) * Lindenwold (south and west) * Somerdale (west)Home page, Borough of Stratford. Accessed April 26, 2025.Areas touching Stratford, MapIt. Accessed April 26, 2025.Municipalities within Camden County, NJ, Delaware Valley Regional Planning Commission. Accessed April 26, 2025.New Jersey Municipal Boundaries, New Jersey Department of Transportation. Accessed April 26, 2025. == History == In the 1740s, early settlers built a village called White Horse near the White Horse Tavern. Today, the only building left from that time is the Stratford Quaker Store. In the 1880s, the Rural Land Improvement Company developed the area and named it Stratford, after Stratford-upon-Avon in England.Hutchinson, Viola L. The Origin of New Jersey Place Names, New Jersey Public Library Commission, May 1945. Accessed April 26, 2025.Borough History , Borough of Stratford. Accessed April 26, 2025. Stratford officially became a borough on February 13, 1925, from parts of Clementon Township.The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 108. Accessed April 26, 2025. In the 1960s, land from Hunt's farm was sold, and the Laurel Mill Farms housing development was built near the North Branch of Big Timber Creek. == References == Category:Boroughs in New Jersey Category:Camden County, New Jersey",
 "title": "Stratford, New Jersey"
}