{
 "id": "1184531",
 "text": "Celebrity Worship Syndrome (CWS) is when a person becomes too interested in a celebrity’s life. It means they spend a lot of time thinking about the celebrity, following their news, and sometimes even feeling very close to them, even though they do not really know them. == What Happens == Most people like some celebrities, like singers, actors, or athletes. But with CWS, the person’s interest becomes very strong. They may: * Always check what the celebrity is doing. * Feel very happy when good things happen to the celebrity, or very sad when bad things happen. * Think they have a special connection with the celebrity. * Try to meet or contact the celebrity. In very serious cases, it can lead to stalking or believing they have a real relationship with the celebrity. == Why It Happens == There are many reasons why someone might develop CWS: * Feeling lonely and wanting a connection. * Having low self-esteem and looking up to someone “better.” * Using celebrities to escape from problems in real life. * Being influenced by social media and celebrity news everywhere. == Levels of Celebrity Worship == Scientists say there are three main levels: # Entertainment-Social: Liking celebrities for fun and for talking with friends. # Intense-Personal: Having very strong feelings about a celebrity. # Borderline-Pathological: Doing strange or dangerous things because of the celebrity. == Problems It Can Cause == CWS can sometimes cause problems like: * Poor grades in school or bad work performance. * Spending too much money on celebrity items. * Feeling very anxious or depressed. * Acting in risky or illegal ways. == How to Help == People with CWS can get help by: * Talking to a therapist. * Learning better ways to handle feelings. * Making real friendships and social connections. == Related pages== * Fandom * Parasocial relationship * Stalking == References == * McCutcheon, L. E., Lange, R., & Houran, J. (2002). Celebrity Worship and its Measurement. British Journal of Psychology.",
 "title": "Celebrity Worship Syndrome"
}