{
 "id": "1184887",
 "text": "Brian Condenanza (born May 3, 1999) is an Argentine entrepreneur, investor and venture capitalist who specializes in fintech, impact investing, and emerging technologies. He was named to Forbes 30 Under 30 in 2022 and is a TEDx speaker who advocates for positive change and innovation through technology and financial inclusion. == Early life and education == Condenanza was born on May 3, 1999 in Buenos Aires, Argentina. He earned a Bachelor of Business Administration (BBA) from the University of Mississippi (Ole Miss), where he was a member of the Beta Theta Pi fraternity and president of the Latin American Student Association. He later completed postgraduate studies at Saïd Business School, University of Oxford. == Career == Condenanza began his career as an advisor and private investor in fintech startups, and eventually founded Hevea Capital, a venture capital fund focused on financial technology and digital assets. He has invested in several companies, such as Linen App, Nada Inc. and the social investment app Iris. In 2017, he was selected to represent Argentina at the UN Youth Assembly at the United Nations Headquarters in New York, where he spoke about technology’s role in widening access to finance. The following year, he delivered a TEDx talk in Switzerland exploring how blockchain can unlock cost and efficiency gains for public and private sector services. In 2022, Condenanza was included in the Forbes 30 Under 30 list (Finance category), citing his early stage investments in fintech and the launch of Hevea Capital. Condenanza is a proponent of impact investing. He has contributed his expertise to various business publications and written articles on this subject. == Honours == Fellow of the Royal Society of Arts (FRSA), 2024 — elected in recognition of his patronage of art museums and their education programmes. == References == Category:Living people Category:1999 births Category:Argentine businesspeople",
 "title": "Brian Condenanza"
}