{
 "id": "1184945",
 "text": "Lai Haraoba (, ) is a traditional cultural and religious festival celebrated by the Meitei people in Bangladesh. The festival honors the gods and spirits of Sanamahism, the traditional Meitei pantheon, through a series of rituals, music, and dance. It is characterized by classical Manipuri dance, devotional songs, and the use of traditional instruments, such as the pung (drum). Lai Haraoba serves as an important cultural event for the Meitei diaspora in Bangladesh, playing a key role in the preservation and transmission of Meitei religious and cultural practices. The festival encompasses various cultural expressions, including rituals, music, dance, and religious performances. It is held annually and is rooted in the social customs and traditions of the Meitei community. The practices associated with Lai Haraoba involve elements of performing arts and ritual observances that are transmitted orally and through community participation. == Assistance by UNESCO & Government of Bangladesh == In April 2025, a three-day Lai Haraoba festival was announced to be held at the Manipur Cultural Complex in Bangladesh, beginning on April 23. The event was jointly supported by UNESCO, the Government of Bangladesh, and the Consulate General of India. According to Mutua Bahadur, director of the Mutua Museum, a 12-member delegation from Manipur, including priests, priestesses, and a Pena artist, departed for Bangladesh on April 20 to participate in the festival and bring necessary ritual items. The festival in Bangladesh marked the first instance of it being conducted under the authority of the Government of Bangladesh and was intended to engage the Meetei community residing there with traditional Umang Lai Haraoba practices. A group of instructors trained in Maibi Jagoi and Pena (musical instrument) had already been sent to Bangladesh to provide cultural training to the local Meetei population. The festival was conducted, in the name of Makong Leima Lairembi, by ritual specialists from Manipur, with emphasis on maintaining the original form of the ceremonies without adaptations commonly seen in some regional versions. The event was organized with help from several groups. These included the Bangladesh National Museum, Porei Apokpa Marup Religious Cultural Organization, the Indian Council for Cultural Relations (ICCR), the Consortium of Intangible Cultural Heritage of Bangladesh (CIB), and Sadhana – A Center for the Advancement of South Asian Culture. == Places == Lai Haraoba is a traditional festival observed by the Meitei people (alias Manipuris) in the Sylhet division of Bangladesh. The festival is primarily celebrated in Kamalganj Upazila, located in Moulvibazar District. It is recognized as a significant cultural practice among the Meitei population in the region. == Recognition of its domains == According to the \"Cultural Heritage Inventory of Bangladesh (CHIB), Cultural Heritage Hub of Bangladesh (CHIB)\", the knowledge and practices related to Lai Haraoba are associated with several domains of intangible cultural heritage. These include oral traditions and expressions, performing arts, social customs and traditions, knowledge and practices concerning nature and the universe, and traditional craftsmanship. The festival is maintained and transmitted through both individual and collective efforts within the community. == Characteristics == === Practitioners and Performers === Lai Haraoba involves a range of participants with specific roles in the performance and transmission of the tradition: * Maibi: Female ritual specialists who are central to the festival. They are responsible for leading rituals, dances, chants, and songs. Maibis may be of any age but typically undergo structured training. Their role is not determined by social status, though knowledge is often transmitted through family lines. * Maiba: Male counterparts to the Maibis. They provide ritual assistance, play musical instruments, and participate in selected ceremonial functions. * Dancers and Musicians: Male dancers may perform alongside Maibis, often representing mythological or divine figures. Musicians play traditional instruments, including the pena and cymbals, to accompany the performances. * Community Members: The broader Meitei community participates in the festival as attendees, supporters, and volunteers. Their involvement includes logistical support, donations, and informal participation. === Other Tradition Bearers === In addition to ritual performers, several individuals and groups contribute to the maintenance of the tradition: * Pena Khongba: A specialist who plays the pena, a traditional Meitei bowed string instrument. * Artisans: Craftspeople involved in producing costumes, headgear, masks, and other ritual items. These items are essential for the visual and symbolic aspects of the festival. * General Community: Community involvement is integral to the continuity of Lai Haraoba. Contributions include volunteering, funding, and preparation. === Language and speech forms === The festival involves the use of the Meitei language, as well as distinct speech forms and registers: * Language: Meitei is the primary language used during rituals, chants, and songs. It is written in its indigenous script. * Register and Speech Levels: A formal register is used during prayers and hymns, while informal language is used in casual interactions. Ritual speech often employs an elevated form to denote reverence. === Associated Tangible Elements === Several material components are associated with the practice of Lai Haraoba: * Costumes: Participants wear ritual attire made from silk or brocade, often decorated with traditional motifs. Specific garments and headgear correspond to roles or deities represented. * Masks: Used in certain performances to depict divine or mythical characters. These are typically made from wood or papier-mâché and painted. * Shrines: Celebrations occur at shrines dedicated to Umang Lai (forest deities), which include altars and ritual spaces. * Musical Instruments: The pena, a single-stringed bowed lute, and cymbals are commonly used. The pena is considered one of the oldest traditional instruments of the Meitei people. === Gender Roles === Lai Haraoba assigns defined roles to participants based on gender: * Women: Central to the festival as Maibis, who perform major rituals and artistic expressions. They also take part in music and dance. * Men: Participate in supporting roles as Maibas, dancers, or musicians. * Other Community Members: Individuals of all genders may contribute through organizing, volunteering, and attending the festival. === Division of Labor === The festival relies on a structured division of responsibilities: * Maibis: Lead ritual and performance elements. * Maibas: Provide support during ceremonies. * Hereditary Specialists: Families tasked with preserving specific rituals. * Musicians and Drummers: Supply rhythmic and melodic accompaniment. * Artisans: Responsible for producing ritual attire and props. * Oral Historians: Convey the meaning and origin of rituals. * Community Volunteers: Handle preparations, logistics, and general support. === Related Practices === Lai Haraoba is connected to broader cultural and religious frameworks: * Meitei mythology: Rituals often depict narratives related to Meitei cosmology and creation myths. * Sanamahi religion: Provides the theological and ritual foundation for many elements of the festival. * Language Preservation: Use of Meitei contributes to the maintenance of the language. * Traditional Crafts: Involves the use and transmission of artisanal knowledge. * Community Life: Functions as a social event that reinforces collective identity. === Modes of Transmission === Transmission occurs through both traditional and contemporary methods: * Traditional Transmission: Knowledge is passed down through apprenticeships, family instruction, and community participation. * Contemporary Methods: Documentation and media are used for preservation and education. === Organizations Involved === While there is no centralized authority overseeing Lai Haraoba, several local entities support its continuity: * Community-Based Organizations: Local Meitei groups organize the festival, manage logistics, collect resources, and encourage participation. == State == === Threats to Enactment === Lai Haraoba, while still observed by Meitei communities in Bangladesh, faces several challenges that affect its continuity: * Endangered Language: The primary language used in Lai Haraoba, Meitei, is considered at risk due to a declining number of fluent speakers. This poses a threat to the preservation of the ritual vocabulary and oral expressions integral to the festival. * Urbanization and Modernization: Socioeconomic changes, including urban development and the adoption of modern lifestyles, have contributed to a shift away from traditional practices. Younger members of the community may have limited exposure to Lai Haraoba, reducing intergenerational transmission. * Resource Constraints: Financial limitations and the lack of institutional support restrict the scale at which the festival can be organized. This can affect the performance quality and reduce opportunities for broader community involvement. * Loss of Traditional Knowledge: Much of the knowledge associated with Lai Haraoba, including ritual procedures and performance techniques, is transmitted orally and through practice. The absence of formal documentation or training mechanisms increases the risk of knowledge erosion. === Threats to Transmission === The transmission of Lai Haraoba within the Meitei community in Bangladesh is subject to the following constraints: * Limited Number of Practitioners: The scarcity of trained Maibis and Maibas reduces the capacity to conduct the festival in its full form. This limitation has led to increased reliance on individuals or resources from Manipur, India, and may result in a simplified or symbolic version of the ritual. === Threats to Associated Tangible Elements === Material elements linked to Lai Haraoba are also under threat: * Costumes and Ritual Objects: The availability of skilled artisans capable of producing traditional costumes, headgear, and masks is limited in Bangladesh. This may affect the authenticity and continuity of these elements. * Musical Instruments: Traditional instruments such as the pena and cymbals are not widely produced or maintained in Bangladesh. In some cases, communities depend on imports from Manipur, which may not be sustainable due to cost and accessibility. === Viability of Associated Intangible Elements === The viability of intangible aspects of Lai Haraoba is also a concern: * Knowledge and Skills: Ritual knowledge and performance skills are largely held by a small number of individuals. Without systematic transmission or documentation, these competencies are at risk of decline. * Oral Traditions: Oral narratives and liturgical texts are primarily preserved through elderly practitioners. A limited pool of active learners may hinder the continuation of these traditions. == Safeguards == Safeguarding efforts are currently led by community-based initiatives: * Community-Led Practices: Meitei communities in Bangladesh continue to observe Lai Haraoba on a limited scale. Knowledge and practices are maintained and transmitted informally within families and community groups. === Existing Safeguarding Measures === Lai Haraoba in Bangladesh is currently maintained through limited-scale celebrations organized by members of the Meitei community. These events contribute to the continuity of the tradition by offering opportunities for intergenerational transmission of knowledge and practice, despite the overall decline in practitioners and available resources. === Proposed Safeguarding Measures === To enhance the viability of Lai Haraoba in Bangladesh, the following measures are proposed: * Community-Based Training Initiatives: The development of structured apprenticeship programs and community workshops may facilitate the transfer of ritual knowledge, performance techniques, and related cultural practices to younger members of the community. * Documentation and Archiving: Systematic recording of rituals, oral traditions, and region-specific variations of Lai Haraoba can serve as a resource for preservation, research, and future revitalization efforts. * Material and Financial Support: Provision of financial assistance to ritual specialists and local artisans involved in the creation of costumes, instruments, and other associated elements may help sustain the material aspects of the festival. * Public Outreach and Integration: Incorporating Lai Haraoba into cultural events, educational programs, and public performances may increase awareness and facilitate broader community engagement. These measures may be implemented through collaboration between local communities, cultural organizations, and academic institutions, with the aim of supporting the long-term safeguarding of Lai Haraoba as practiced in Bangladesh. == Literature, discography, audiovisual materials, archives == === Audiovisual Materials or Archives === * YouTube: A limited number of Lai Haraoba performances are available on YouTube. While the quality of these videos may vary, they provide a visual representation of the tradition. Searching for \"Lai Haraoba performance\" may help locate relevant content. * Documentaries: Some documentaries that focus on the cultural heritage of Manipur may feature segments on Lai Haraoba. These documentaries typically explore Meitei culture, including dance traditions and rituals. === Discography and Archives === * Field Recordings: Field recordings of Lai Haraoba rituals may exist, created by researchers or organizations focused on preserving Meitei culture. These recordings typically capture chanting, hymns, and instrumental music associated with the festival. These materials may be found through universities with South Asian studies programs or folklore archives in Manipur. * Folklore Recordings: Recordings of Meitei folk music may include instruments or musical elements associated with Lai Haraoba. While these recordings are not specifically focused on the festival, they may offer insights into the musical traditions related to it. == Gallery == A holy and sacred place of worship of traditional Meitei deities called Umang Lai of Sanamahism (ancient Meitei religion) in Bangladesh.jpg == Related pages == * Lai Haraoba in Myanmar * Lai Haraoba in Tripura * Meitei language in Bangladesh * Meitei clothing in Bangladesh * Meitei monuments in Bangladesh == References == Category:Meitei culture Category:Meitei religion Category:Indian culture Category:Bangladeshi culture Category:UNESCO",
 "title": "Lai Haraoba in Bangladesh"
}