{
 "id": "1184216",
 "text": "The Macintosh 512K enhanced (512Ke) was released in April 1986. It was a cheaper version of the newer Macintosh Plus, which came out three months earlier. The 512Ke looked like the older Macintosh 512K, but it had a better 800K floppy disk drive and newer 128K ROM chips, like the ones in the Macintosh Plus. It still didn’t allow for msny upgrades, but some companies made memory expansions to increase RAM up to 2 MB or more. ==Model differences== At first, the 512Ke looked the same as the 512K, except for a different label on the back. It also used the same beige case. Later, Apple sold it at a discount for schools and renamed it the Macintosh ED (M0001D and later M0001ED). It came with the short original Macintosh Keyboard, but users could also buy the longer Macintosh Plus Keyboard that had a number pad. In some countries outside North America, the 512Ke came with the full keyboard and was called the Macintosh 512K/800. Later, this full keyboard was also included in North American models. Although the 512Ke had the same ROMs and 800K drive as the Mac Plus, it still used the older connectors. Because of this, users couldn’t use fast SCSI hard drives unless they bought a third- party adapter. The only built-in option was the slower Hard Disk 20 or other drives that connected through the serial port. Even though the computer had the software to support SCSI, it needed extra hardware to actually use it. ==Official upgrades== You could upgrade a regular Macintosh 512K to a 512Ke using Apple’s $299 Macintosh Plus Disk Drive Kit. This kit included an 800 KB floppy drive to replace the old 400 KB one, new 128 KB ROM chips, a disk with updated system software, and a guide for installing the parts. Apple also sold another upgrade that replaced the logic board and back case with ones from the Macintosh Plus. This gave the computer completely full SCSI support and allowed up to 4 MB of RAM. Because Apple’s upgrades were expensive, many other companies made cheaper SCSI cards and RAM expansions. The newer ROM allowed the computer to use newer software. It used a little more memory, but still left about 370 KB free for applications. The Macintosh Plus Logic Board Kit ==System software== Starting in June 1986, the 512Ke came with System 3.2. After it was discontinued, Apple recommended using System 4.1. The latest system it can run is System 6.0.8.Macintosh 512Ke: Technical Specifications ==References== ==Other websites== * Category:Apple hardware Category:1986 establishments Category:1987 disestablishments",
 "title": "Macintosh 512Ke"
}