{
 "id": "1184594",
 "text": "The Archdiocese of Santa Fe de la Vera Cruz (Latin: Archidioecesis Sanctae Fidei Verae Crucis) is an ecclesiastical constituency of the Catholic Church in Argentina. It is a Latin archdiocese, metropolitan seat of the ecclesiastical province of Santa Fe de la Vera Cruz. Since April 17, 2018, its archbishop is Sergio Alfredo Fenoy. ==History== The Diocese of Santa Fe was established by Pope Leo XIII with the papal bull In Petri Cathedra on February 15, 1897, separating the province of Santa Fe and the national territories of Formosa and Chaco from the Diocese of Paraná (now the archdiocese). It was originally a suffragan of the Archdiocese of Buenos Aires. Its first bishop was Juan Agustín Boneo, elected by Leo XIII as auxiliary bishop of Buenos Aires on June 15, 1893, and consecrated on the following October 22. The same pope later transferred him to the Diocese of Santa Fe on January 27, 1898, and he died on June 16, 1932. In 1899, Pope Leo XIII proclaimed the Virgin of Guadalupe patron saint and titular saint of the Diocese of Santa Fe. On October 14, 1900, the first official procession was held at Boneo's initiative. On June 3, 1939, by means of the bull Ecclesiarum omnium of Pope Pius XII, the diocese of Resistencia (today the archdiocese) was erected, separating the national territories of Formosa and Chaco, which until then were part of the archdiocese of Santa Fe. The new diocese became a suffragan of Santa Fe. On August 28, 1984, Edgardo Gabriel Storni was promoted to Archbishop of Santa Fe following the death of his predecessor. He took office as Archbishop of Santa Fe on September 30, 1984. He resigned on October 1, 2002, following accusations of sexual abuse for which he was convicted in 2009 by a sentence that was overturned two years later. Upon resigning, he became Archbishop Emeritus of Santa Fe de la Vera Cruz, giving way to José María Arancedo, who, while Bishop of Mar del Plata, was promoted by Pope John Paul II to this archiepiscopal see on February 13, 2003. Arancedo submitted his resignation in 2015, in accordance with canon law upon reaching the age of 75. His resignation was accepted by Pope Francis on April 17, 2018, the same day that the new Archbishop of Santa Fe, Sergio Fenoy, was appointed. He was then serving as bishop of the Diocese of San Miguel. ==Territory and organization== The archdiocese covers an area of 30,701 km² and extends its jurisdiction over the Catholic faithful of the Latin rite residing in the province of Santa Fe: in the departments of La Capital, Garay, Las Colonias, San Jerónimo, San Justo, San Martín, and a small part of San Javier in southern Santa Fe. The seat of the archdiocese is located in the city of Santa Fe, where the Cathedral of All Saints and the minor basilicas of Nuestra Señora de Guadalupe, and Our Lady of Carmen are located. The Basilica of the Nativity of the Blessed Virgin is located in Esperanza. The archdiocese has the dioceses of Rafaela and Reconquista as suffragans. In 2020, there were 93 parishes and 4 quasi-parishes in the archdiocese. ==Bishops== ===Ordinaries=== *Juan Agustín Boneo (1898–1932) *Nicolás Fasolino (1932–1969) (Cardinal from 1967) *Vicente Faustino Zazpe (1969–1984) *Edgardo Gabriel Storni (1984–2002) *José María Arancedo (2003–2018) *Sergio Alfredo Fenoy (2018–present) == References == Category:Church architecture Category:Cathedrals Category:Argentina",
 "title": "Archdiocese of Santa Fe de la Vera Cruz"
}