{
 "id": "1184867",
 "text": "The Peshwa was the second-in-command of the Maratha Empire, just under the king (Chhatrapati). At first, the Peshwa was a Prime Minister chosen by the king, but when King Shahu gave the job to Bajirao Ballal, it became a family inheritance. Under Shahu’s rule, the Peshwas grew very powerful and ran the empire. Over time, the king’s role became mostly ceremonial, and the Peshwas held the real power, as set out in the Sangola agreement. During the time of Shivaji, Sambhaji, and Rajaram, all Peshwas came from the Marathi Deshastha Brahmin community. The first Peshwa was Moropant Pingle, appointed by Shivaji as the head of the Ashta Pradhan (council of eight ministers). Early Peshwas served mainly as chief ministers to the king. Later, especially under the Bhat family, the Peshwas became hereditary leaders and the true rulers of the Maratha Confederacy. The Peshwas were most powerful under Baji Rao I (1720–1740), when the Marathas expanded and ruled large parts of India. Later Peshwas allowed more autonomy to regional Maratha chiefs like the Scindias, Holkars, and Gaekwads, though these leaders still recognized the Peshwa's authority. The Bhonsles were also forced to accept the Peshwa as their overlord after their defeat by Madhavrao I in 1765. In 1760, the Kolis, led by Naik Javji Bamble, rose up against the Peshwa government. Javji hid in the hills and carried out raids for 20 years, defeating many of the Peshwa’s generals. Eventually, on the advice of Dhondo Gopal (the Peshwa’s governor at Nasik), Javji gave up his forts to Tukoji Holkar. Holkar helped him win a pardon and made him in charge of sixty villages, with the power to deal with outlaws. In 1798, another Koli leader, Ramji Naik Bhangria, rebelled. He was clever at avoiding capture, so the government decided not to fight him. Instead, they pardoned Ramji and gave him a key police position. == List of Peshwas == Sr. Name Reign Began C.E. Reign Ended C.E. 1 Moropant Trimbak Pingle 1674 1683 2 Nilakanth Moreshvar Pingale 1683 1689 3 Ramchandra Pant Amatya 1689 1708 4 Bahiroji Pingale 1708 1711 5 Parshuram Trimbak Kulkarni 1711 1713 === Hereditary Peshwas from Bhat family === Sr. Name Particulars Reign Began C.E. Reign Ended C.E. Portrait 6 Balaji Vishwanath (Sixth appointed Peshwa) Assisted the Syed Brothers in removing Mughal Emperor Farrukhsiyar from the throne in 1719. 1713 1720 7 Baji Rao I (Seventh appointed Peshwa) Known as Thorle (elder) Bajirao and regarded as the most influential of the nine Peshwas. He fought to establish \"Hindu Pad Padshahi\" (Hindu Empire), helped conquer Central India (Malwa) and Rajputana, and extended Maratha rule into Gujarat and the Deccan. He attacked Delhi in 1737. Bajirao fought in over 41 battles and never lost a single one. He died of sudden fever at age 40 while on a campaign toward Delhi. An equestrian statue of him stands at Shaniwar Wada in Pune. 1720 1740 8 Balaji Bajirao (Eighth appointed Peshwa) Known as Nanasaheb Peshwa, he expanded Maratha territory across much of North-West, East, and Central India. His forces captured Attock and Peshawar in 1758. Under his leadership, the Maratha Empire reached its height, but his general and cousin lost the Third Battle of Panipat to Ahmad Shah Abdali in 1761. Nanasaheb also contributed greatly to the development of Pune, building the Parvati Temple, Lakdi Bridge, and founding Nana Peth. He constructed a water reservoir near Katraj to supply Pune with clean water — a system still in use today. 1740 1761 9 Madhav-Rao I (First hereditary Peshwa) Madhavrao I’s time as Peshwa had many internal fights but also successful wars against the Nizam. During his rule, the Marathas regained their strength after the big loss at the Third Battle of Panipat. This recovery is called the Maratha Resurrection. He fixed the damaged government, treasury, and accounts of the Maratha Empire. Madhavrao I died of tuberculosis in 1772. A memorial for him stands at Peshwe Park in Pune. Some say he was killed by his aunt, Anandi Bai, the wife of Raghunath Rao. 1761 1772 10 Narayan-Rao Madhavrao I was allegedly killed by Gardi guards. Raghunath Rao wanted to just kidnap him, but his wife, Anandi Bai, decided to have him killed. Later, Narayan Rao was also killed in Shanivar Wada. Today, Shanivar Wada is considered one of the haunted places in Maharashtra. 1772 1773 11 Raghunath-Rao As a general, he expanded the Maratha Empire to its peak in the north but also witnessed its decline there. He was removed from power by Nana Phadnis and 11 other officials in what is now known as \"The Barbhai Conspiracy.\" 1773 1774 12 Madhav-Rao II He was made Peshwa as an infant, with a group of Maratha generals and ministers acting as his advisors. During his time, Nana Phadnis played a big role in politics. This period saw the rise of Maratha power in North India again. 1774 1796 13 Baji Rao II During his first reign, he was defeated by Yashwantrao Holkar, the ruler of Indore, at the Battle of Poona. He fled to the British for protection and signed the Treaty of Bassein with the British East India Company in December 1802. The treaty gave up land for a British army and prevented him from making treaties with other powers. This led to the Second Anglo-Maratha War and the start of the Maratha confederacy breaking apart. 1796 1802 – Amrut Rao (Appointed as Peshwa by Yashwantrao Holkar) Amrutrao was made Peshwa by Yashwantrao Holkar after defeating Baji Rao II and Daulat Rao Sindhia in the Battle of Poona. 1802 1803 13 Baji Rao II During his second reign, Baji Rao II started the Third Anglo-Maratha War in 1817. After losing the Battle of Koregaon in January 1818, he fled from the British. The British took control of his territories and made Pratap Singh of Satara support them. This ended Baji Rao II's role as the head of the Maratha confederacy. On June 3, 1818, Baji Rao II surrendered to the British and was sent into exile at Bithur, near Kanpur. 1803 1851 14 Nana Sahib (Pretender to the position of Peshwa) Nana Sahib, born Dhondu Pant on May 19, 1824, was the adopted son of Baji Rao II, the last Maratha Peshwa. When the British refused to give him his father’s pension and honors because he was adopted, he joined the Indian Rebellion of 1857 to try to bring back the Maratha rule. He led the siege of Cawnpore (now Kanpur) and made the British troops surrender. After that, many British soldiers, women, and children were killed—a massacre whose exact details and his role in it are still debated. When the British retook Cawnpore, Nana Sahib vanished. Some say he escaped to Nepal and died there, but no one knows for sure. 1851 1857 == References == Category:Heads of government Category:Maratha Empire Category:Harv and Sfn no- target errors Category:Pages with unreviewed translations",
 "title": "Peshwa"
}