{
 "id": "1184564",
 "text": "The Texas State Capitol is the capitol and central government building of the U.S. state of Texas. The building is located in Austin, Texas, and contains the offices and chambers of the Texas legislature and Governor. The capitol was designed in 1881 by architect Elijah E. Myers and was built between 1882 and 1888 under the engineer Reuben Lindsay Walker. An underground part of the building was added in 1993, costing $75 million. The building became a National Historic Landmark in 1986. The Texas State Capitol is 302.64 feet (92.24 m) tall. This makes it the sixth-tallest state capitol in the US. == History == In 1839, the newly formed Republic of Texas decided to make Austin its capital city. Before today's capitol was built a small log cabin and later a limestone building served as the state capitol. The limestone building was very simple and was criticized by architects. In 1876, the Texas government sold land in the Texas Panhandle in exchange for money to build a new capitol. Four years later, the government announced a national capitol building design competition with a $1,700 prize. Eight architects submitted designs. The government decided that architect Elijah E. Myers' design was best. Just one year after the design competition, the limestone capitol caught fire. The plans for the new capitol were inside the limestone capitol and were almost destroyed. The plans survived, however, and construction of the new capitol would begin soon. The first stone of the building was laid in March of 1885. Many important government figures attended the event. The first stone had a hole carved into it which held a box containing objects that symbolized the building of the new capitol. The capitol was completed in 1888. It contained 392 rooms. Its top dome was constructed from iron braces. ==References== ==Other websites== * Texas State Preservation Board - Maintainers of the Capitol * Capitol Grounds Monuments * Library of Congress: architectural drawings and photographs of the Texas State capitol * Capitol Dedication Ceremony - Excerpts from Senator Temple Houston's acceptance (of the capitol building) speech May 16, 1888 at TexasBob.com * America's Favorite Architecture * * Film footage about the building's Goddess of Liberty from the local Austin TV program Progress Report Austin, 1962, Texas Archive of the Moving Image Category:1888 establishments in the United States Category:1880s establishments in Texas Category:Buildings and structures in Texas Category:Austin, Texas Category:Museums in the United States Category:National Historic Landmarks of the United States",
 "title": "Texas State Capitol"
}