{
 "id": "1184118",
 "text": "Gustaaf Stephanus Modestus \"Guus\" Meeuwis (born 23 March 1972) is a Dutch singer-songwriter. As part of the band Vagant, he scored several hits in the Netherlands and Flanders during the 1990s and first decade of the 2000s. On 24 May 2015, Meeuwis became the first Dutch language performing artist ever to play a fully booked concert at London's Royal Albert Hall. == Biography == Guus Meeuwis was born in the local monastery of Mariahout, a village in the current municipality of Laarbeek, where his parents lived temporarily. He grew up in the adjacent village of Lieshout. Meeuwis went to the Lorentz Casimir Lyceum in Eindhoven and Stella Maris College in Meerssen, and then studied law at Tilburg University. At Stella Maris College it soon became clear that Meeuwis was artistic and musically gifted. After a romantic weekend in Bruges with his girlfriend Valérie he wrote the song It's a night... Emerged for the Tilburg Student Corps Sint Olof, Meeuwis and his guidance group won the first AHC Classic Festival on the ALSV Quintus in 1994 with this issue. The group was then offered a record deal by talent scout Willem van Schijndel This is how the group Guus Meeuwis & Vagant was born (named after the tribal café of Meeuwis and his \"student friends\"). This accompaniment group originally consisted of Marc Meeuwis, Jan-Willem Rozenboom, Hugo van Bilsen, Robin van Beek and Dirk Oerlemans. In 2001 the band Vagant ceased to exist and Meeuwis focused on a solo career. == Career == === Guus Meeuwis and Vagant (1994 - 2001) === With Vagant, Meeuwis released the albums Verbazing (1996), Schilderij (1997) and 1 voor Allen (2001). The singles Het is een Nacht... and Per Spoor, respectively, took the number 1 position in the Dutch Top 40 and the Mega Top 50 won the number 1 track in 1995 and 1996. Also Zo Ver Weg, Verliefd Zijn, Ik Wil Met Je Lachen, 't Dondert en 't Bliksem and Ik tot tel 3 hits. In 1997 Antonie Camery as Hero, a character from the film All Stars, had a number 1 hit with Toen Ik Je Zag, that Meeuwis had written with Jan-Willem Rozenboom on the occasion of the film. The recordings for 1 voor Alles were quiet due to a cyst on Meeuwis' vocal chords for more than six months. At the end of 2001, the band came to an end and Meeuwis would continue with a new management and a new record company. === Solo Career and Guus Meeuwis === 2002, Meeuwis made a solo debut album, simply called Guus Meeuwis. In his band are new faces and former Vagant members, such as his brother Marc Meeuwis and writer/pianist Jan-Willem Rozenboom. Daniël Lohues, Tren van Enckevort (Rowwen Hoze), Martijn Bosman (o.a Kane) and Paskal Jakobsen (BL-F) make guest contributions to the album. The most famous song on the album is Brabant, also called the \"unofficial anthem of Brabant\". The editor-in-chief of the regional daily BN/DeStem sent a letter to Provincial Executive to present the song of Guus Meeuwis as an official anthem of the province and receives a lot of support from other Brabant media His motivation was that otherwise there would remain a 'historic opportunity', because \"Meeuwis's song is timeless. It appeals to the young and old in Brabant. In fact, it has already been elevated to the state anthem by the population.” Via an internet site, more than 30,000 people signed a petition that is offered to the Queen’s Commissioner in North Brabant, Hanja Maij-Weggen, but did not produce anything. Meeuwis himself is not involved in the discussion. In 2004 Meeuwis released the single Hé sun, specially written for the Bart de Graaff Foundation of which Meeuwis is ambassador. He also toured that year under the direction of comedian Bavo Galama through the Netherlands with his first theatre tour Guus Meeuwis In Concert, which was later released on DVD. ==== 10 Jaar Levensecht and Geef mij je angst (2004) ==== In 2005 Meeuwis' first album with highlights, entitled 10 Jaar Levensecht. The album includes his biggest hits, supplemented with some personal favorites and two new songs. Meeuwis' cover version of Geef mij je angst originally by folk singer André Hazes is also on the album. Earlier, at the request of Edwin Evers, Meeuwis took this song on the occasion of the silver jubilee concert by Hazes. After the death of Hazes, his widow Rachel asked if Meeuwis would like to sing the song during the farewell ceremony in the Amsterdam ArenA. Just after the funeral of Hazes, the song rose to the highest position of the Single Top 100 and the Top 40. The album was crowned with a double platinum status, which means that at least 160,000 copies were sold at the time. Guus Meeuwis was already 10 years in the business in 2004 and this musical anniversary was celebrated with three concerts at the Heineken Music Hall in Amsterdam. The concerts held on 23, 26 and 27 September 2005 were sold out the day after the start of the pre-sale. A month later he started his second theatre tour, Levensecht. ==== Wijzer and Met een zachte G ==== Meeuwis' second solo album was released at the end of October 2005 and was called Wijzer. This album shows the result of the collaboration \"Meeuwis, Roy and Rozenboom\" for the first time. This triumvirate will be found on all subsequent records. The first single is De Weg, a translation of the song by the German singer and actor Herbert Grunemeyer. The song made the top 10. The album was crowned with a platinum record, which means that at least 70,000 copies were sold. Meeuwis was awarded this at the same time as the news that his DVD In Concert is gold, and his CDs Painting and Ten Years of Life- Properly Platinum. On 6 February 2006, Meeuwis received a Golden Harp during the Harpen Gala in Bussum. He received this prize because, according to the jury, he has made himself very special in good faith for Dutch light music during his career. On March 15 of the same year his single Geef me je angst wins an Edison Award. In the Philips Stadium of 'his' Eindhoven football club PSV he gave three sold-out concerts in 2006 under the title Groots met een zachte G. Here he sang his new single Ik wil dat ons land juicht for the first time, which he wrote together with footballer Ruud van Nistelrooij especially for the World Cup in Germany. Special guests during his shows were the Limburg band Rowwen Hoze and the then still unknown singer Dennis. A day after the last concert, SBS6 broadcasts it in its entirety. The concert series would become an annual phenomenon. ==== Hemel Nr. 7 and voice problems (2006-2008) ==== In October 2006, four months after the concert series Groots met een zachte G in the Philips Stadium, Meeuwis' management announced that a polyp has been discovered on his left vocal chord. For the last months of the year he had to rest and all performances and promotional activities were cancelled That also meants a delay in the preparations of his new album. In early 2007, Meeuwis became a panel member in the program Stenders Laat Vermaak, a music quiz of Rob Stenders on the television channel Talpa. In April the forerunner of the album Hemel Nr. 7 is released, the single Trannen gelachen. The song entered at number one in the Singles Top 100, and also reaches the highest position of the Top 40. At the end of August the second number 1 single of the album, called Proosten. The album also got to first place in the Top 100. Meanwhile, Meeuwis is busy with the preparations for his third theatre tour that starts in January 2008. Iin June 2008 for the third year in a row, he will perfom in the Philips Stadium with his concert series Groots met een zachte G. This time for four nights in a row . This concert was also recorded for a live album and DVD. On 26 May 2008 he was a guest of sports at Together with Dré in concert at the Amsterdam ArenA. Between the end of October and the beginning of December 2008, Meeuwis ventured into something new, a club tour. It was the first time he'd done a tour of the pop venues. For the occasion he invited friend and musical partner JW Roy as a support act. All shows were sold out and they performed in Tivoli, the Oosterpoort, 013, Het Paard and the Effenaar. In addition, Meeuwis is the first Dutch artist to be in the Melkweg and Paradiso within two weeks and sell both halls. Category:Living people Category:1972 births Category:Dutch singer-songwriters Category:Dutch people",
 "title": "Guus Meeuwis"
}