{
 "id": "1184284",
 "text": "Lilia Oleksandrivna Podkopayeva (; born 15 August 1978) is a Ukrainian artistic gymnast. She is retired. == Career== === 1993 - 1995 === In April 1993, Podkopayeva was at the World Artistic Gymnastics Championships in Birmingham, England. She was last place. Her score was 8.893. At the 1994 World Championships in Brisbane, Australia, she was sixth place. Her score was 38.942. At the World Team Championships in Dortmund, Germany, she was fifth place. Her score was 38.099. In 1995, Podkopayeva was at the 1995 World Championships in Sabae, Japan. She was fifth place and went on to the the 1996 Olympics. At the Olympics, she got first place on vault. She got second place for uneven bars and for balance beam. === 1996 === In January 1996, Podkopayeva was hurt when she fell during practice. She fractured two ribs. In May 1996, she was at the European Championships in Birmingham, England. She and her team were third place. In the finals, Podkopayeva got third place for the balance beam. She got first place for uneven bars and for floor. ==== Atlanta Olympics ==== In July, Podkopayeva was at the 1996 Summer Olympics in Atlanta, Georgia. In the finals, she won second place on balance beam. She won first place on floor. == Post-retirement == In 2002, Podkopayeva started the Golden Lilia International Sports Festival. In December 2004, she married the Ukrainian businessman Tymofiy Nahornyi. Nahornyi and Podkopayeva adopted Vadym in July 2006. In November 2006, Podkopayeva gave birth to her daughter, Karolina. Nahornyi and Podkopayeva divorced in 2009. In 2005, Podkopayeva became a part of the United Nations in Ukraine. She is also an Ambassador of the Council of Europe for Sport, Tolerance, and Fair Play. In 2008, she represented Ukraine in the Eurovision Dance Contest. She and her partner were third place. In 2014, Podkopayeva did a gala event in Mexico. In 2019, Podkopayeva became a coach at Marcus Jewish Community Center of Atlanta's Perimeter Gymnastics. ==References== Category:1978 births Category:Living people Category:Gymnasts Category:Olympic gold medalists Category:Ukrainian sportspeople Category:Medalists at the 1996 Summer Olympics Category:Olympic silver medalists ==Other websites== *",
 "title": "Lilia Podkopayeva"
}