{
 "id": "1184977",
 "text": "Ali Salahshour (; born June 5, 1990) is an Iranian endurance athlete, martial arts champion, and record holder. He is known for breaking national and international records in continuous punching and rope skipping. He is also a coach and judge in various martial arts in Iran. == Early life and education == Ali Salahshour was born in Ardabil Province, Iran. He earned a bachelor's degree in Agricultural Engineering. He currently lives in Golestan, Baharestan County, Tehran Province. == Martial arts career == Salahshour holds several black belts and certifications: * 1st, 2nd Dan in Grappling Kickboxing (Federation-certified) * 3rd Dan in Self-defense and Ghoot Al-Rami * 5th Dan in Kickboxing (WAKF Federation) * 5th Dan in Wushu (Nan Chuan style) He also holds official coaching licenses: * Level 1–3 in Kickboxing, Grappling, Wushu, Parkour, Boxing, Ninjutsu * National referee in Kickboxing, Grappling, Self- defense == Titles and achievements == * National champion in Grappling Kickboxing (2014) * National champion in Super Contact Kickboxing (2015) * Provincial champion in object breaking (2017) * Team champion in Wushu, Self- defense, Kung Fu competitions (2016–2017) * Coach of national-level athletes in Wushu and Parkour == Endurance records == * World endurance rope skipping record – IMARO, 2024 * National endurance heavy bag punching record – 2024 * International punching endurance record – 2024 (registered in the Iran Federation of Public Sports) * He has been invited to submit his record to Guinness World Records == Coaching and leadership == * Founder of Ghahramanan Pars Sports Club (since 2015) * Head of Individual Sports Committee in Baharestan Wushu Board (2018–2022) * Head of Baharestan Parkour Committee * Supervisor of sports record registration in Baharestan * Worked with the Islamic Republic of Iran Armed Forces as trainer * Honored as \"Athlete of the Year 2024\" by local officials == Refereeing and judging == * National referee in Kickboxing, Grappling since 2015 * Judge in several national team selection competitions * Judge in WKF Kickboxing and Martial Arts Federation matches * Refereed most national competitions in Tehran (2015–2018) == Personal attributes == * Height: 178 cm * Weight: 84 kg * Active in public fitness education and youth training * Known for discipline, endurance, and contribution to community sports == References == Category:Living people Category:Iranian sportspeople Category:Martial arts coaches Category:Endurance athletes Category:1990 births == Other websites == * Instagram profile * Ali Salahshour at bamorabi.ir",
 "title": "Ali Salahshour"
}