{
 "id": "1184468",
 "text": "In the United States, about one in four arrests involves a woman. Both women and men are usually arrested for less serious property crimes, but men are more often involved in violent crimes. Since 1960, overall arrests have gone down, but women now make up a larger share of those arrested, mainly because of more drug-related arrests. Steffensmeier and Schwartz (2008) say this isn’t because more women are using drugs, but because police have started using broader definitions of crimes and arresting more people for minor offenses. ==Women and the War on Drugs== In the late 1960s, drug use became more common among the middle class and was linked to countercultural movements and social unrest. In 1970, Congress passed the Controlled Substances Act, which organized drugs into five groups based on how addictive they are, whether they have medical uses, and how safe they are. Each group came with different penalties — Schedule I drugs had the toughest punishments, while Schedule V had the lightest. The War on Drugs grew stronger when Ronald Reagan became president in 1981. His wife, Nancy Reagan, led the \"Just Say No\" campaign aimed at middle-class kids and teens. At the same time, the rise of crack cocaine in New York City hit inner-city communities hard and increased public opposition to drugs. In 1986, Reagan signed the Anti-Drug Abuse Act, which created mandatory minimum sentences, meaning judges had less power to adjust punishments for drug crimes. == Women and the informal economy == The informal economy includes all types of criminal activities that make money. In the U.S., selling and using drugs are part of this sector. Around the world, women are more likely to work in the informal economy because household and childcare duties often make working from home easier. Some people also think women are pushed into this sector because regular jobs don’t meet their needs, like offering paid maternity leave. Since the 1980s, cheaper imported goods have hurt U.S. manufacturing, especially in cities, leading to job losses. Cuts to welfare programs have also made unemployment worse. These changes have made the informal economy grow, with more women working in it. ==References== Category:United States",
 "title": "Women in the drug economy in the United States"
}