{
 "id": "1184852",
 "text": "Villa Devoto is one of the 48 neighborhoods of the Autonomous City of Buenos Aires. It is characterized by being an urban residential neighborhood. It is considered \"The Garden of the City\", since it has a big number of trees. It is often considered a neighborhood with a strong sense of belonging due to its relative isolation from the rest of the city. == Geographic location == The Villa Devoto neighborhood is comprised of General Paz Avenue, Campana Street, Gutenberg Street, San Martín Avenue, Francisco Beiró Avenue, Joaquín V Street. González, Baigorria Street and Lope de Vega Avenue. It borders the neighborhoods of Villa Pueyrredón to the north, Agronomía and Villa del Parque to the east, Monte Castro and Villa Real to the south, and the districts of Tres de Febrero and General San Martín to the west. == History == === Origins === By the end of 1615, the then governor of the Río de la Plata, Don Hernando Arias de Saavedra, granted several hundred hectares to Don Cristóbal de Luque y Cobos in what is now the center of Devoto, in addition to the north of Agronomía, Villa Pueyrredón and the west of Villa Urquiza. Around 1700, a group of Jesuits settled east of the neighborhood, at the corner of Helguera and Navarro. In 1767 the residents were evicted from their land and the building was left abandoned. It was still standing in the middle of the siglo XIX . At the corner of Segurola and Habana 4310, Diego Armando Maradona used to live, and it has become a popular place among tourists. === Present === For decades, neighborhood residents have been demanding the demolition of the Devoto Prison, but it has not stopped operating since 1927. === Ecclesiastical establishments === * Metropolitan Seminary of Buenos Aires, better known as Villa Devoto Seminary, located at José Cubas 3543. Successive generations of priests and bishops from Argentina were trained there. * Faculty of Theology of the Immaculate Conception of the Catholic University of Argentina, which offers all university's degrees in theological science. * Basilica San Antonio de Padua, Av. Lincoln 3751 * Parishes ** Immaculate Conception, José Cubas 3599 ** Jesus of Good Hope, José León Cabezón 3350 ** St. John the Baptist, New York 4717 ** Solitude of the Most Holy Mary, Av. Gral. Mosconi 4119 == References == Category:Buenos Aires Category:Argentina",
 "title": "Villa Devoto"
}