{
 "id": "118465",
 "text": "Abdul Qadeer Khan (; April 1, 1936 - October 10, 2021) was a Pakistani scientist and metallurgical engineer. He was a controversial figure. He is thought by many people to be one of the pioneers of Pakistan's nuclear program. Others disagree and claim he is only an opportunist who abused his position to obtain personal benefits and make a lot of money. His middle name is occasionally spelt Quadeer, Qadir or Gadeer. His given names are usually abbreviated to A.Q.. Khan claimed he had Pashtun ancestry. However, his ancestors supposedly immigrated to modern India, during the reign of Afghan Emperor Shahabuddin Ghouri from the district of Ghour of present Afghanistan. He was born in Bhopal State in British India in 1936. His father Abdul Ghafoor Khan served in the Education Department, British India, and after retirement, settled in Bhopal. He remained under arrest in Pakistan for quite some time, because he was accused of Nuclear proliferation to the North Korean government and also to Iran. In August 2021, Khan was hospitalized in Islamabad after testing positive for COVID-19. He died at the age of 85 in Islamabad from the infection on October 10, 2021. Several politicians in Pakistan, including the Prime Minister Imran Khan stated their tribute to him. In a post on Twitter, Imran Khan stated https://twitter.com/ImranKhanPTI/status/1447080688797327360?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1447080688797327360%7Ctwgr%5E%7Ctwcon%5Es1_&ref;_url=https%3A%2F%2Fwww.opindia.com%2F2021%2F10%2Fabdul- qadeer-khan-pakistan-nuclear-bomb-secrets-proliferation%2F ==Related pages== *Munir Ahmad Khan == References == ==Further reading== * * * == Other websites == *AQ Khan, Samar Mubarmand talking on Pakistani Nuclear Program *Samar Mubarakmand telling truth about AQ Khan Category:1936 births Category:2021 deaths Category:Nuclear engineers Category:Pakistani criminals Category:Bhopal Category:Pakistani physicists Category:Deaths from the COVID-19 pandemic in Islamabad",
 "title": "Abdul Qadeer Khan"
}