{
 "id": "1184015",
 "text": "Siddhaṃ (also spelled Siddhāṃ) is an ancient Indian script used from the 6th to 13th century. It is a type of abugida, meaning each character represents a consonant with an attached vowel. Siddhaṃ comes from the Gupta script and later developed into other scripts like Nāgarī, Tirhuta, Odia, and Nepalese. It was widely used by Indian Buddhists, especially to write mantras, seed syllables, and dharanis. Today, it is still used in East Asian Buddhist traditions.. The word Siddhaṃ means \"accomplished\", \"completed\", or \"perfected\" in Sanskrit. The script got its name from the tradition of writing Siddhaṃ or Siddhaṃ astu (which means \"may there be perfection\") at the top of documents. It is also known by other names, such as bonji in Japanese, meaning \"Brahma's characters\" or \"Sanskrit script\", and in Chinese as Xītán wénzi, which means \"Siddhaṃ script\". The script evolved from the Gupta Brahmi script in the late 6th century CE. Siddhaṃ is an abugida, not a full alphabet. This means each character usually shows a syllable made of a consonant and a vowel. If the vowel isn’t written, it is understood to be a short \"a\". Small marks (called diacritics) are used to show other vowels and sounds like the anusvara and visarga. A special symbol called the Virama can be added to show that a consonant has no vowel, which sometimes happens at the end of Sanskrit words. Siddhaṃ was usually written from left to right, top to bottom—like most Indian scripts. But sometimes, it was written like traditional Chinese, from top to bottom and right to left. In texts that had both Siddhaṃ and Japanese, the page was turned sideways to write Japanese top to bottom. Then it was turned back to write Siddhaṃ normally, left to right—so the Japanese letters looked sideways. == Vowels == Independent form Romanized As diacritic with Independent form Romanized As diacritic with Independent form Romanized As diacritic with Independent form Romanized As diacritic with == Consonants == Stop Approximant Fricative Tenuis Aspirated Voiced Breathy voiced Nasal Glottal Velar Palatal Retroflex Dental Bilabial Labiodental In Japan, Siddhaṃ is still used in certain Buddhist traditions like Shingon and Tendai, as well as the Shugendō sect. The script is called Bonji (梵字) or shittan (悉曇) there. It's mainly used to write mantras and copy sutras. The Taishō Tripiṭaka, a major collection of Buddhist texts, keeps the original Siddhaṃ script for most mantras. Korean Buddhists also use a modified Siddhaṃ to write sacred syllables (bījas). Today, people even use Bonji creatively, like printing Japanese slogans in Siddhaṃ on T-shirts. Over time, the Japanese style of Siddhaṃ has changed and looks a bit different from the ancient version. == Siddhaṃ fonts == Siddhaṃ is mostly still written by hand. Some computer fonts exist, but none can show all the joined letters (conjuncts) Siddhaṃ uses. For example, the Chinese Buddhist Electronic Texts Association made a Siddhaṃ font for their Taisho Tripiṭaka, but it’s missing many of the joined forms. Another tool, Mojikyo, has Siddhaṃ fonts too, but it breaks them into different parts—so you need several fonts just to write one document. == Gallery == File:MahaPratyangira Mantra.png|Chinese use of the Siddhaṃ script for the Mahāpratyaṅgirā mantra. 971 CE File:Siddham Bijakshara A.jpg|Siddhaṃ Bijakshara A, Daishō-in, Miyajima File:Mirror with bijaksharas.jpg|Mirror with bijaksharas, Miyajima File:Asakusa Temple Usnisa Vijaya Dharani Sutra Inscription.png|A stone inscription of the Buddhist Uṣṇīṣa Vijaya Dhāraṇī Sūtra at Asakusa Temple in Tokyo using Siddham script. File:Siddham alphabet by Kukai.svg|Siddhaṃ alphabet by Kūkai (774–835) == References == Category:Brahmic scripts Category:CS1 maint: multiple names: authors list Category:Harv and Sfn no-target errors Category:CS1 errors: missing periodical Category:Articles with dead links to other websites from February 2022 Category:All articles with dead links to other websites Category:Articles containing Japanese-language text Category:Articles containing Chinese- language text Category:Articles containing traditional Chinese-language text Category:Scripts with ISO 15924 four-letter codes Category:Pages with unreviewed translations",
 "title": "Siddhaṃ script"
}