{
 "id": "1184716",
 "text": "{{Infobox writer | name = Friedrich Hölderlin | image = FK Hiemer - Friedrich Hölderlin (Pastell 1792).jpg | caption = Hölderlin by Franz Carl Hiemer, 1792 | birth_date = | birth_place = Lauffen am Neckar, Duchy of Württemberg, Holy Roman Empire | death_date = | death_place = Tübingen, Kingdom of Württemberg, German Confederation | occupation = | education = Tübinger Stift, University of Tübingen (1788–1793) University of Jena (1795) | genre = Lyric poetry | movement = Romanticism, German idealism | notableworks = Hyperion | signature = Hoelderlin Unterschrift.svg | birth_name = Johann Christian Friedrich Hölderlin }} Johann Christian Friedrich Hölderlin (, ; ; 20 March 1770 – 7 June 1843) was a German poet and philosopher. He has been called \"the most German of Germans\" and was an important person in German Romanticism. He was also an important thinker in the creation of German Idealism.\"Because of his small philosophical output, it is important to indicate in what way Hölderlin's ideas have influenced his contemporaries and later thinkers. It was Hölderlin whose ideas showed Hegel that he could not continue to work on the applications of philosophy to politics without first addressing certain theoretical issues. In 1801, this led Hegel to move to Jena where he was to write the Phenomenology of Spirit.... Schelling's early work amounts to a development of Hölderlin's concept of Being in terms of a notion of a prior identity of thought and object in his Philosophy of Identity.\" Christian J. Onof, \"Johann Christian Friedrich Hölderlin\", Internet Encyclopedia of Philosophy. Accessed 15 January 2011.\"Hegel is completely dependent on Hölderlin—on his early efforts to grasp speculatively the course of human life and the unity of its conflicts, on the vividness with which Hölderlin's friends made his insight fully convincing, and also certainly on the integrity with which Hölderlin sought to use that insight to preserve his own inwardly torn life.\" Dieter Henrich, The Course of Remembrance and Other Essays on Hölderlin, Ed. Eckart Förster (Stanford: Stanford University, 1997) p. 139.\"Indeed, the Pietistic Horizon extended for generations up to and including the time when Hegel, together with his friends Hölderlin and Schelling, spent quiet hours strolling along the banks of the Neckar receiving the theological education they would eventually challenge and transform through the grand tradition now known as German Idealism.\" Alan Olson, Hegel and the Spirit. (Cambridge: Cambridge University Press, 1992), p. 39. ==References== ==Other websites== * * * * Hölderlin-Archiv * Hölderlin Gesellschaft (in German, links to English, French, Spanish, and Italian) * Poems of Friedrich Hölderlin – English translations * Poems by Friedrich Hölderlin – English translations * Selective list of Hölderlin's poems in German, with linked texts – contains most of his major finished poems up to 1804, but not complete * * * * Friedrich Hölderlin, Homburger Folioheft. Diachrone Darstellung – Hölderlin's most important manuscript as online-edition, presented by Württembergische Landesbibliothek Stuttgart and A und A Kulturstiftung, Cologne (in German) Category:1770 births Category:1843 deaths Category:German poets Category:German philosophers Category:German novelists Category:German playwrights Category:People with schizophrenia Category:Writers from Baden-Württemberg",
 "title": "Friedrich Hölderlin"
}