{
 "id": "1184359",
 "text": "Saad Kassis-Mohamed (June 21 2001 in Kuwait) is a Kuwaiti entrepreneur, investor, and philanthropist. He is the founder and chairman of the WeCare Foundation, an organization focused on sustainable development projects in underserved communities worldwide. In March 2025, he was included in Forbes' \"30 Under 30\" list in the Social Impact category. == Career == Saad Kassis- Mohamed was born on June 21, 2001, in Kuwait. He earned a Bachelor of Commerce in Global Financial Management from the Manipal Academy of Higher Education and later pursued a Master's degree in Finance at the University of Würzburg and the University of Oxford. == WeCare Foundation == In 2023, Saad Kassis- Mohamed founded the WeCare Foundation with the aim of promoting sustainable development projects in underserved communities. Under his leadership, the organization raised $350,000 in April 2024 to support innovations in lab-grown diamonds. In Sudan, the WeCare Foundation initiated several projects, including the \"Darfur Water Renewal Project\" to provide clean drinking water and the \"Blue Nile Renewable Energy Initiative\" to establish mini solar grids for rural regions. == Investments == In August 2024, Saad Kassis-Mohamed was appointed to the board of Zavi & Co, an Egyptian consultancy for nonprofit organizations. In March 2025, Saad Kassis-Mohamed emerged as a potential investor for the English football club Reading FC, which was facing financial difficulties at the time. == Disaster Relief == Following the Mangaf fire (Kuwait) in June 2024, which claimed 50 lives including 46 Indians, the WeCare Foundation, under the leadership of Saad Kassis-Mohamed, coordinated emergency relief efforts for the victims. == Awards == * Forbes \"30 Under 30\" Social Impact * Presidential Medal – Order of the Republic (Sudan) == Personal Life == Saad Kassis-Mohamed is passionate about equestrian sports and has participated in several international competitions. He also plays the guitar and piano and is committed to environmental conservation. == References == Category:Entrepreneurs (21st century) Category:Investors Category:Kuwaiti people Category:Kuwaitis Category:2001 births Category:Living people",
 "title": "Saad Kassis-Mohamed"
}