{
 "id": "1184527",
 "text": "The Battle of Ali Masjid took place on 27 July 1839 between the Sikh Empire and its allies against the Emirate of Afghanistan during the First Anglo- Afghan War and Afghan-Sikh Wars. The Sikh forces, led by Colonel Sheikh Basawan and Shahzada Timur Mirza, achieved victory over the Afghan forces commanded by Wazir Akbar Khan. The battle was a pivotal moment as it allowed the Sikh forces to advance into Kabul and support Shah Shujah Durrani's restoration to the throne. == Background == With the Tripartite Treaty of 1838, Maharaja Ranjit Singh and the British government agreed to support Shah Shujah Durrani's return to power in Kabul. The Sikh Empire was tasked with protecting the Khyber Pass, while the British advanced via the Bolan Pass and Ghazni. == Battle == Colonel Sheikh Basawan's Khalsa Army crossed the Indus River and assembled in Peshawar. Wazir Akbar Khan attempted to block the Sikh failed and advance at the Khyber Pass. However, upon hearing of the fall of Ghazni and facing rebellions in support of Shah Shuja Durrani, he withdrew north. On 27 July 1839, Colonel Sheikh Basawan successfully seized Ali Masjid. == Aftermath == Following the battle, Colonel Sheikh Basawan was officially acknowledged by the British government for his leadership, and Lord Auckland awarded him a sword. After the fall of Ali Masjid, Dost Mohammed Khan recalled his son to Kabul. Colonel Sheikh Basawan's forces reached Kabul and took part in Shah Shujah Durrani's victory parade. In a gesture of gratitude, Shah Shujah Durrani offered horses, mules, swords, and fine textiles to the Lahore Darbar through his envoy Mulla Muhammad Hussain.. After this victory Shah Shujah himself sated the Sikhs to take upon the throne of Kabul The Sikhs did so and the Sikhs were throned the seats of Kabul, This was the first time any foreign took the throne of Kabul after 500 years after the Mughal empire. == References == ===Citations=== ===Works cited=== * * * * * * * * * * * * * * * * Category:Battles",
 "title": "Battle of Ali Masjid (1839)"
}