{
 "id": "1184623",
 "text": "Chhinnamastika Temple is a Hindu temple dedicated to Goddess Chhinnamasta, located in Rajrappa, Ramgarh district, Jharkhand, India. It is a popular pilgrimage site for people from Jharkhand, West Bengal, and Bihar. The temple is known for its Tantric-style architecture. Besides the main temple, there are also ten smaller temples for other gods like Surya, Hanuman, and Shiva. == History == It was this place where the Raja of Ramgarh Raj gave 3 acres of land to the people in the Bhudhan Movement in Jharkhand. == Etymology == Chhinnamasta (Sanskrit: छिन्नमस्ता), also called Chinnamasta, Chhinnamastika, or Prachanda Chandika, is one of the Mahavidyas, the ten powerful Tantric goddesses. She is a fierce form of Devi, the Hindu Divine Mother. Chhinnamasta is known for her striking image: she has cut off her own head, which she holds in one hand along with a sword in the other. Three streams of blood flow from her neck, feeding her severed head and two attendants. She is often shown standing on a couple engaged in love. == Geography == Chhinnamasta Temple is located in Rajrappa, about 28 km from Ramgarh Cantonment, along National Highway 20 in Ramgarh district, Jharkhand, India. It stands on a hill at the meeting point of the Damodar and Bhera (Bhairavi) rivers, near the Rajrappa Falls. This place is considered special because it is where the Bhairavi River (female) flows down to meet the Damodar River (male), symbolizing the \"opposite copulation\" pose (vipareeta rati) described in the meditation (dhyana) of Goddess Chhinnamasta. In this union, Bhairavi represents the active energy (Shakti), while Damodar represents the calm and passive male. == Description == At the temple, a natural rock covered with an eight-metal (ashtadhatu) covering is worshipped as Goddess Chhinnamasta. The site has been a place of worship for tribal people since ancient times and became well-known as a Chhinnamasta center by the 18th century. Devotees offer kheer (a sweet dish) and animal sacrifices to the goddess. The Chhinnamasta Temple is very old and attracts devotees from Bihar, Jharkhand, West Bengal, Assam, and Nepal for worship. The temple is mentioned in the Vedic book Durga Saptashati. Its architecture is similar to that of Tantric temples, such as the Kamakhya Temple in Assam, which has a similar design. As one of the 10 Mahavidyas, the temple holds great significance. The original temple was destroyed, but a new temple was constructed, and the original idol of Goddess Chhinnamasta was placed in it. Animal sacrifice is still practiced, particularly on Tuesdays, Saturdays, and during Kali Puja. == References == Category:Coordinates on Wikidata Category:Pages using gadget WikiMiniAtlas Category:Pages with unreviewed translations Category:Hinduism Category:Hindu temples",
 "title": "Chhinnamasta Temple"
}