{
 "id": "118410",
 "text": "M*A*S*H is an American television sitcom made by Larry Gelbart about doctors in a mobile . It was inspired by MASH: A Novel About Three Army Doctors. It stars Alan Alda as the main character. It was very popular, lasting 11 seasons, and having one of the most viewed series finales in television history. ==Summary== M*A*S*H is about a Mobile Army Surgical Hospital during the Korean War. It stars Hawkeye Pierce, an American surgeon who dislikes the war and makes a lot of jokes. ==Cast== There have been a strong cast of characters through the show's life. The only four people who appeared from the first episode to the last are Alan Alda and Loretta Swit. William Christopher's character, Father Mulcahy appeared in the first episode but was played by George Morgan. William Christopher took over the role for the rest of the series. Character Actor/Actress Rank Role Benjamin Franklin \"Hawkeye\" Pierce Alan Alda Captain Chief surgeon John Patrick Francis Mulcahy George Morgan (Pilot Episode), Replaced by William Christopher 1st Lieutenant, later Captain Chaplain Margaret \"Hot Lips\" Houlihan (O'Houlihan in the film) Loretta Swit Major Head nurse Maxwell Q. Klinger Jamie Farr Corporal, later Sergeant Medic/Orderly, later Company Clerk John Francis Xavier \"Trapper\" McIntyre (Seasons 1-3) Wayne Rogers Captain Surgeon Henry Braymore Blake (Seasons 1-3) McLean Stevenson Lieutenant Colonel Surgeon, Commanding officer Franklin Marion \"Frank\" Burns, also known as \"Ferrett Face\" (Seasons 1-5) Larry Linville Major, later Lieutenant Colonel (off-screen) Surgeon, Temporary Commanding officer (following the discharge of Henry Blake) Walter Eugene \"Radar\" O’Reilly (Seasons 1-7) Gary Burghoff Corporal Company Clerk, Bugler B. J. Hunnicutt (replaced Trapper; Seasons 4-11) Mike Farrell Captain Surgeon Sherman T. Potter (replaced Henry Blake; Seasons 4-11) Harry Morgan Colonel Surgeon, Commanding officer (After Lt. Col. Blake) Charles Emerson Winchester III (replaced Frank Burns; Seasons 6-11) David Ogden Stiers Major Surgeon ==\"Goodbye, Farewell, and Amen\"== \"Goodbye, Farewell, and Amen\" is the series finale. It was aired on February 28, 1983, and is two and a half hours long. Nearly 106 million Americans watched it, which was 77% of the people watching TV at the time. It is the most watched episode of any show in American history. Category:1983 American television series endings Category:1970s American comedy television series Category:1980s American comedy television series Category:American comedy-drama television series Category:1980s American sitcoms Category:Black comedy television series Category:CBS network shows Category:Korean War Category:English-language television programs Category:1972 American television series debuts",
 "title": "M*A*S*H (TV series)"
}