{
 "id": "1184928",
 "text": "Lai Haraoba (, ) is a traditional ritual festival observed by the Meitei people in Tripura, as well as in other regions of Northeast India. The name translates to \"merrymaking of the gods\" and the festival is primarily dedicated to the Umang Lai, or forest deities. It involves a series of ritualistic ceremonies, dances, music, and folk narratives that depict the creation of the universe according to Meitei cosmology. Lai Haraoba serves both religious and cultural functions, preserving indigenous belief systems and performing arts. According to Biplab Kumar Deb, a Chief Minister of the Government of Tripura, the Lai Haraoba festival plays a role in strengthening the relationship between Manipur and Tripura states. == History == Panganbam Chanu Rajeswari (), also known as Kaboklei (), one of the Meitei queens of Tripura's King Birchandra Manikya (r. 1862–1896) and the mother of his successor, Radhakishore Manikya, introduced the Meitei religious festival Lai Haraoba () in the Kingdom of Tripura for the first time. Besides, she commissioned the construction of a temple dedicated to the Meitei deity Lainingthou Pakhangba () at Banamalipur.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 6, 23-24Sinha, Astamika; Datta, Debasish. \"The matrimonial relationship of the manikyas of Tripura with Manipur\". International Journal of Humanities and Social Science Research | socialsciencejournal.in (in English and Manipuri). Volume 8, Issue 6, 2022. pp. 62–66.Singha, Memchaton (2014-01-01). \"Matrimonial Alliances between the Royal Houses of Tripura and Manipur in the Days of Monarchy\". History Research Network (Forthcoming) (in English and Manipuri). 1 (1). International Journal of Humanities & Social Science Studies (IJHSSS): 25–33. Tulshibati (), one of the Meitei queens of Tripura's King Radhakishore Manikya (r. 1896–1909) and daughter-in-law of Meitei Queen Mother Rajeswari, established a temple dedicated to the Meitei deity Lainingthou Puthiba () at Abhoynagar (also known as Abhaynagar) in Tripura.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 6, 23-24Sinha, Astamika; Datta, Debasish. \"The matrimonial relationship of the manikyas of Tripura with Manipur\". International Journal of Humanities and Social Science Research | socialsciencejournal.in (in English and Manipuri). Volume 8, Issue 6, 2022. pp. 62–66.Singha, Memchaton (2014-01-01). \"Matrimonial Alliances between the Royal Houses of Tripura and Manipur in the Days of Monarchy\". History Research Network (Forthcoming) (in English and Manipuri). 1 (1). International Journal of Humanities & Social Science Studies (IJHSSS): 25–33. This site has since become the primary location for the celebration of the Lai Haraoba festival by the Meitei community in the region. == State holiday designation == In January 2015, the Government of Tripura designated \"Meitei Umang Lai Haraoba\" () as an official state festival, acknowledging its cultural significance within the state's diverse communities. == Duration == In Tripura, the Lai Haraoba festival is observed annually, typically spanning a duration of five days. On 14 March 2022, a seven-day observance of the Lai Haraoba Festival commenced in the Bamutia block of Tripura. The festival was formally inaugurated by Member of Parliament Rebati Tripura at the Erendhau Lamden Lairembi Temple () in Bajalghat, located within the jurisdiction of the Bamutia block. The event was reported by the Directorate of Information and Cultural Affairs, Government of Tripura. == Revival == In January 2012, after nearly 40 years, the Meitei community in Agartala revived the celebration of the Lai Haraoba festival. Previously, the festival had been organized by the royal family, but in this instance, it was organized by the local community. The event aimed to preserve cultural traditions and raise awareness of Meitei cultural heritage among the younger generation. It was noted that the festival served to promote peace and unity within the community. For many participants, this was the first time experiencing the festival in Agartala. The celebration provided an opportunity to learn about traditional Meitei culture, with an emphasis on the importance of cultural awareness among youth. The revival of the festival contributed to reinforcing cultural identity and fostering a sense of community. == Worshipping deities == * Erendhau Lamden Lairembi * Ima Panthoibi * Lainingthou PakhangbaManipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 6, 23-24Sinha, Astamika; Datta, Debasish. \"The matrimonial relationship of the manikyas of Tripura with Manipur\". International Journal of Humanities and Social Science Research | socialsciencejournal.in (in English and Manipuri). Volume 8, Issue 6, 2022. pp. 62–66.Singha, Memchaton (2014-01-01). \"Matrimonial Alliances between the Royal Houses of Tripura and Manipur in the Days of Monarchy\". History Research Network (Forthcoming) (in English and Manipuri). 1 (1). International Journal of Humanities & Social Science Studies (IJHSSS): 25–33. * Lainingthou Puthiba (also known as Ibudhou Puthiba or Iputhou Puthiba) == Assistance from Manipur == In 2014, a group of individuals and organizations from Manipur contributed financial assistance to restore items stolen from the shrine of the Meitei deity Lainingthou Puthiba in Tripura. The support was extended in preparation for the Lai Haraoba festival. Contributors included Pangamba Bobo of Yairipok Keithel, Soraisam Gopeshwore of Mekola, T. Mangibabu, Thiyam Dilip Meitei, a Zilla Parishad member from Nachou, K. Bante (Sub-Divisional Officer) of Moirang, the Democratic Students’ Alliance of Manipur (DESAM), International Modernised Academy of Konung Mamang, Pukhrabam Ingobi of Kongba Nandeibam Leikai, and Sanasam Bira, Member of the Legislative Assembly from Kumbi. On 23 May 2022, a delegation from the Lainingthou Sanamahi Temple Board (LSTB) of Imphal was dispatched to Dharmanagar, Tripura, to conduct the 'Ima Lairembi Lai Haraoba' festival, scheduled from 25 to 27 May. According to a statement issued by the LSTB, the festival was held in Dharmanagar and was organized by the Lainingthou Sanamahi Temple Board of Haying Khongbal Uphong Yumpham, in collaboration with Ima Panthoibi Haraoba Thougal Lup, Dharmanagar. The event aimed to revive a traditional religious observance that had not been practiced for approximately two centuries. == Organising groups == * Abhoynagar Puthiba Social Welfare and Cultural Society * Department of Information and Cultural Affairs (ICA Department) of Tripura Government * Ima Panthoibi Haraoba Thougal Lup, Dharmanagar * Lainingthou Sanamahi Temple Board (LSTB) * Puthiba Lai Haraoba Committee * Umang Lai Kanba Apunba Lup (UKAL) Manipur == Notable visitors == * Sanajaoba Leishemba, a member of the royal family of Manipur (in January, 2023) * Pratima Bhoumik, Union Minister of States (MoS) (in January, 2023) * Tinku Roy, a minister of Youth Affairs & Sports, Social Welfare & Social Education departments of the Government of Tripura (in December, 2023) * Dipak Majumder, a Mayor of Agartala Municipal Corporation (AMC) (in December, 2023) * Biplab Kumar Deb, a chief minister of Tripura (in January, 2022) * Mevar Kumar Jamatia, a Tribal Welfare Minister of Tripura (in January, 2022) * Rampada Jamatia, an MLA of Tripura (in January, 2021) * Rebati Mohan Das, a Speaker of State Legislative Assembly of Tripura (in January, 2020) * Jitendra Chowdhury, an MP of Tripura (in December, 2017) * Sudip Barman, an MLA of Tripura (in December, 2017) == Related pages == * Lai Haraoba in Bangladesh * Lai Haraoba in Myanmar * Manipuri Literary and Cultural Forum, Tripura * Meitei language in Tripura * Takhel Ngamba == References == Category:Meitei religion Category:Meitei folklore Category:Tripura Category:Manipur Category:Holidays of India Category:Meitei festivals",
 "title": "Lai Haraoba in Tripura"
}