{
 "id": "1184711",
 "text": "Alex Walkinshaw (born 5 October 1974) is a British actor from Barking, England. He is known for playing Dale \"Smithy\" Smith in the police show The Bill and Adrian \"Fletch\" Fletcher in the medical dramas Casualty and Holby City. He also played a teacher in the school drama Waterloo Road. == Work == Walkinshaw first appeared on TV when he was 12. He played in the children's show Grange Hill. He stayed on the show for one year. In the early 1990s, he acted in the sitcom Side by Side. In 1999 Alex Walkinshaw joined show The Bill. He played Police Constable (PC) Dale \"Smithy\" Smith. He later became a sergeant on the show. Walkinshaw stayed in the show until it ended in 2010. He said it was emotional to film the final scenes. In 2008, Walkinshaw was nominated for the National Television Award. The award was won by David Tennant. In 2011, Walkinshaw joined the drama Waterloo Road as physical education teacher Jez Diamond. After leaving that show, he joined TV series Casualty as nurse Adrian \"Fletch\" Fletcher. In 2014, his character moved to Holby City, where he continued playing Fletch. == Filmography == === Film === * Saving Santa (2013) === Television === Year Programme Role 2025–present EastEnders Ross 2014−2022 Holby City Adrian \"Fletch\" Fletcher 2012–2014, 2016, 2019–2020, 2022 Casualty 2011–2012 Waterloo Road Jez Diamond 2002 Stan the Man Tommy 2001 Holby City Mickey 2001 Urban Gothic Stevo 1999–2001, 2003–2010 The Bill PC/Sgt/Insp. Dale Smith 1995–1998 McCallum DS Small 1995 Crown Prosecutor Troy Daly 1995 The Bill Andy Franklin 1995 A Touch of Frost Pearce 1995 London's Burning Truck Driver 1994 Anna Lee Kevin 1994 Harry Enfield & Chums Unwanted party guest 1993 To Play the King Boy Mugger 1993 The Bill Lee Tarrant 1993 A Question of Guilt Ed Darvas 1992 Casualty Alan 1992 The Bill Steven Murray 1992–1993 Side by Side Terry Shane 1990 Death in Venice Older Boy == References == Category:People from Barking Category:Living people Category:1974 births Category:British actors",
 "title": "Alex Walkinshaw"
}