{
 "id": "118406",
 "text": "Sarah Louise Christine Chalke (born August 27, 1976) is a Canadian-American actress most famous for her role as \"Elliot Reid\" on Scrubs and \"Becky Conner\" on Roseanne and in the CBS comedy How I Met Your Mother, and The Powerpuff Girls.\"It's Official: Chalke Returning to 'Mother! Is Brit Next?'\" TV Guide. April 21, 2008. Retrieved on April 22, 2008. She is engaged to lawyer Jamie Afifi, with whom she has a son, Charlie Rhodes Afifi, born December 24, 2009.E-Online celebrity news report ==Filmography== Movie Year Title Role Notes 1994 Ernest Goes to School Maisy 1999 All Shook Up Katy Dudston 2000 Spin Cycle Tess 2000 Cinderella: Single Again Cinderella 2001 Kill Me Later Linda 2001 XCU: Extreme Close Up Jane Bennett 2002 The Powerpuff Girls Movie Bessy 2005 Cake Jane 2007 Chaos Theory Paula Crowe 2007 Mama's Boy Maya 2008 Prop 8: The Musical Scary Catholic School Girls From Hell Short movie Television Year Title Role Notes 1992 City Boy Angelica TV movie 1993 Neon Rider Annie 1 episode 1993 The Odyssey Estate Agent 1 episode 1993 Relentless: Mind of a Killer Carrie TV movie 1993 Woman on the Ledge Elizabeth TV movie 1993–1997 Roseanne Becky Conner-Healy Main role; 70 episodes 1994 Beyond Obsession Laura Sawyer TV movie 1996 Robin of Locksley Marion Fitzwater TV movie 1996 Dead Ahead Heather Loch TV movie 1996 Stand Against Fear Krista Wilson TV movie 1997 Daughters Annie Morrell TV movie 1997 A Child's Wish Melinda TV movie 1997 Dying to Belong Drea Davenport TV movie 1997 Dead Man's Gun Murial Jakes 1 episode 1998 I've Been Waiting for You Sarah Zoltanne TV movie 1999 Y2K Myra Soljev TV movie 1999 First Wave Chloe Wells 1 episode 1999–2000 Nothing Too Good for a Cowboy Gloria Hobson Main role; 23 episodes 2001–2010 Scrubs Dr. Elliot Reid Main role; 173 episodes 2002 It's a Very Merry Muppet Christmas Movie Dr. Elliot Reid TV movie 2001–2003 The Powerpuff Girls Additional voices 14 episodes 2006 Why I Wore Lipstick to My Mastectomy Geralyn Lucas TV movie 2007 Saturday Night Live Dr. Elliot Reid 2008–2009 How I Met Your Mother Stella Zinman 9 episodes 2009 Maneater Clarissa Alpert Mini- series 2009 Prep and Landing Magee Voice; TV special on ABC 2010 Freshman Jane Pilot on ABC 2010 Team Spitz Guidance Counsellor Pilot on CBS 2011 Prep and Landing: Naughty vs. Nice Magee Voice; TV Special on ABC 2011 Mad Love Kate Swanson Main role; 13 episodes 2011 American Dad! Cami 1 episode 2011 Cougar Town Angie LeClaire 4 episodes 2012 The Fresh Beat Band Glinda the Good Witch \"The Wizard of Song\" 2013 How to Live with Your Parents (for the Rest of Your Life) Polly Main role 2013 Nutri Ventures Nina Season 2, Episode 3-10 2013 The Powerpuff Girls Dance Pantsed Wendy Episode: Dance Pantsed 2013 Rick and Morty Beth (voice) Main Cast ==References== Category:1976 births Category:Canadian television actors Category:Actors from Ottawa Category:Living people Category:Canadian voice actors",
 "title": "Sarah Chalke"
}