{
 "id": "1185074",
 "text": "TheOregon's 1st congressional district is a congressional district located in the U.S state of Oregon. The district stretches from Portland's western suburbs, to parts of the coast. The district has the cities of Beaverton, Hillsboro, and Tigard, which are in the Portland metropolitan area. The district is in the northwest corner of Oregon. It includes all of Clatsop, Columbia and Tillamook Counties, and most of Washington County and a bit of southwest Multnomah County in Portland. It generally has most of Portland west of the Williamette River. The district has been represented by Suzanne Bonamici since 2012, who won an election to replace David Wu, who resigned. In the 1990s, it was a swing district, but after the 2000 United States Census, the district included parts of Democratic Portland, and it is now the second most Democratic district in Oregon, behind Oregon’s 3rd congressional district. == List of members for the district == Member Party Years Cong ess Electoral history District established March 4, 1893 District established March 4, 1893 District established March 4, 1893 District established March 4, 1893 District established March 4, 1893 Binger Hermann Republican March 4, 1893 – March 3, 1897 Redistricted from the and re-elected in 1892. Re-elected in 1894. Resigned to become Commissioner of the United States General Land Office. Thomas H. Tongue Republican March 4, 1897 – January 11, 1903 Elected in 1896. Re-elected in 1898. Re-elected in 1900. Re-elected in 1902 but died before next term began. Vacant Vacant January 11, 1903 – June 1, 1903 Binger Hermann Republican June 1, 1903 – March 3, 1907 Elected to finish Tongue's term. Re-elected in 1904. Retired due to the Oregon land fraud scandal. Willis C. Hawley Republican March 4, 1907 – March 3, 1933 Elected in 1906. Re-elected in 1908. Re-elected in 1910. Re-elected in 1912. Re-elected in 1914. Re-elected in 1916. Re-elected in 1918. Re-elected in 1920. Re-elected in 1922. Re-elected in 1924. Re-elected in 1926. Re-elected in 1928. Re-elected in 1930. Lost renomination. James W. Mott Republican March 4, 1933 – November 12, 1945 Elected in 1932. Re-elected in 1934. Re-elected in 1936. Re-elected in 1938. Re-elected in 1940. Re-elected in 1942. Re-elected in 1944. Died. Vacant Vacant November 12, 1945 – January 18, 1946 A. Walter Norblad Republican January 18, 1946 – September 20, 1964 Elected to finish Mott's term. Re-elected in 1946. Re-elected in 1948. Re-elected in 1950. Re-elected in 1952. Re-elected in 1954. Re-elected in 1956. Re-elected in 1958. Re-elected in 1960. Re-elected in 1962. Died. Vacant Vacant September 20, 1964 – November 3, 1964 Wendell Wyatt Republican November 3, 1964 – January 3, 1975 Elected to finish Norblad's term. Also elected to the next full term. Re-elected in 1966. Re-elected in 1968. Re-elected in 1970. Re-elected in 1972. Retired. Les AuCoin Democratic January 3, 1975 – January 3, 1993 Elected in 1974. Re-elected in 1976. Re-elected in 1978. Re-elected in 1980. Re-elected in 1982. Re-elected in 1984. Re-elected in 1986. Re-elected in 1988. Re-elected in 1990. Retired to run for U.S. Senator. Elizabeth Furse Democratic January 3, 1993 – January 3, 1999 Elected in 1992. Re-elected in 1994. Re-elected in 1996. Retired. David Wu Democratic January 3, 1999 – August 3, 2011 Elected in 1998. Re-elected in 2000. Re-elected in 2002. Re-elected in 2004. Re-elected in 2006. Re-elected in 2008. Re-elected in 2010. Resigned due to sexual misconduct accusations. Vacant Vacant August 3, 2011 – January 31, 2012 Suzanne Bonamici Democratic January 31, 2012 – present Elected to finish Wu's term. Re-elected in 2012. Re-elected in 2014. Re-elected in 2016. Re-elected in 2018. Re-elected in 2020. Re-elected in 2022. Re-elected in 2024. ==References== Category:Congressional districts of Oregon",
 "title": "Oregon's 1st congressional district"
}