{
 "id": "1185128",
 "text": "Heribert Weber (born June 28, 1955 in Pöls, Murtal District, Styria) is a former Austrian football player and football coach. He played for SK Sturm Graz, SK Rapid Wien and SV Austria Salzburg as defender. He also played for the Austrian national football team. During his playing career, he won the Austrian championship five times, the Austrian Cup four times. As coach he won the Championship one time with Austria Salzburg. ==Career == He played for the Styrian amateur club FC Pöls until he was 18. In 1973, Heribert Weber moved to first division club SK Sturm Graz. Weber made his first appearance in Sturm's first league match in the spring of 1974. With the Graz team, he reached the 1975 cup final against SSW Innsbruck under coach Karl Schlechta. He also received his first call-up to the national team as a Sturm player. When Schlechta joined Rapid Vienna in January 1978, he also brought Heribert Weber to the team in the summer of the same year. From 1978 to 1989, the defender scored 39 goals in 315 league games. With Rapid he won the Austrian championship title four times and the ÖFB Cup also four times. He was also part of the 1984/85 team that reached the final of the European Cup Winners' Cup under then coach Otto Barić. In 1989 he moved to first division promoted side SV Austria Salzburg. With Salzburg, Heribert Weber again achieved two runner-up titles under coach Otto Baric and, in 1994, the club's first ever league title. In the 1993/94 season, at the age of 39, he reached the European Cup final with Salzburg for the second time in his career. After the two UEFA Cup finals, the captain of Austria Salzburg ended his playing career and switched to coaching. With 580 league matches he is on 2. place as record player. Transfermarkt.at Only Robert Sara has four matches more. He also made 63 European Cup appearances, scoring three goals. ==International == Weber made his debut on 28 April 1976, in Austria's 1-0 victory over the Swedish national football team.ÖFB players profile He was team captain for a long time. Weber made 68 international appearances for Austria, scoring one goal. The Styrian played three games each at the 1978 and 1982 World Cups. His last appearance for Austria was in the 1990 World Cup qualifiers on 25 October 1989, in a 3-0 defeat to the Turkish national football team in Istanbul. ÖFB players profile ==Manager == After retiring from his active playing career, Heri Weber signed on as coach at ASVÖ FC Puch. From 1995 to 1996, he was responsible for the U-18 and U-19 youth teams of the ÖFB . Then he moved to Austria Salzburg. In Salzburg, he was faced with a team that was weakened by the departure of numerous European Cup heroes and top players. Weber was able to form a new compact unit and sensationally won the Austrian championship title with Austria Salzburg in the 1996/97 season. Weber had made a name for himself as a coach after winning the title the previous year. So Rapid's sporting director, Ernst Dokupil, brought him to Rapid as coach in May 1998. With Rapid, Weber finished second in the championship behind Sturm Graz in both the 1997/98 and 1998/99 seasons. After one year and a half before he moved as coach and later as sports director to German second division club 1. FC Saarbrücken. In July 2003he took over SC Untersiebenbrunn team. Heribert Weber then worked as a TV soccer expert for the pay-TV channel Premiere (now Sky). ==Honours == ;Player *5 × Austrian Champion: 1982, 1983, 1987, 1988 (Rapid), 1994 (Austria Salzburg) *4 × Austrian Cup: 1983, 1984, 1985, 1987 (Rapid) *3 × Austrian Supercup winners: 1986, 1987, 1988 (Rapid) * 1 × European Cup Winners' Cup Final: 1985 (Rapid) * 1 × UEFA Cup Final: 1994 (Austria Salzburg) ;Manager *1x Austrian Champion: 1997 (Austria Salzburg) *1x Austrian Supercup Winner: 1997 (Austria Salzburg) *2x Austrian Runner-up: 1998, 1999 (Rapid) ==References == Category:1955 births Category:Living people Category:Austrian footballers Category:Players of the Austrian national football team Category:SK Rapid Wien players Category:Association football defenders Category:Austrian football managers Category:Austrian football defenders Category:Austrian football champions Category:FC Red Bull Salzburg players Category:FC Red Bull Salzburg managers",
 "title": "Heribert Weber"
}