{
 "id": "1185905",
 "text": "PES University (PESU) is a private university in Bengaluru, India, established in 1988. It offers programs in Engineering, Management, Law, Economics, Commerce, Architecture, Design, Psychology, Arts, Medicine, and Life Sciences, providing Bachelor's, Master's, and PhD degrees. The university operates three campuses in Bengaluru: Ring Road, Electronic City, and Hanumantha Nagar. == History == Founded by M. R. Doreswamy in 1972 under the People's Education Society (PES), PESU began as PES Institute of Technology (PESIT) in 1988. It became a private university in 2013 under the Karnataka Act. PES manages over 45 educational programs across Karnataka and Andhra Pradesh, serving over 18,000 students. == Academics == PESU admits 40% of its undergraduate students via Karnataka CET and 60% through its own PESSAT entrance test. A Management quota is also available. Lateral entry allows diploma holders to join the second year of engineering. Postgraduate admissions are based on GATE or Karnataka CET scores. The university was ranked 139th for engineering in India by NIRF in 2024. == Research == The Crucible of Research and Innovation (CORI) and Centre for Intelligent Systems (CIS) drive multidisciplinary research in areas like AI, robotics, and VLSI design. Students can intern at the PES Innovation Lab. == Events == PES University hosts numerous events, including the notable CIDECODE Hackathon, organized by the Center for Information Security Forensics and Cyber Resilience (ISFCR) in collaboration with Karnataka Police CID Center for Cyber Crime Investigation Training & Research (CCITR). The 24-hour hackathon, held on 2 March 2024, focused on cybersecurity challenges in Dark Web Monitoring, Cryptocurrency Traceability, and OSINT Automation. It attracted 341 teams, with 39 shortlisted, and was inaugurated by Dr. M. A. Saleem, IPS, Director General of Police, CID Karnataka. During the 2025 CIDECODE Hackathon, Zero Defend Security launched Vastav AI, India’s first deepfake detection system, boasting 99% accuracy in identifying manipulated media. Vastav AI, developed by Santhosh Kumar, uses advanced AI tools for forensic analysis and is currently available to law enforcement, with plans for enterprise subscriptions. == Controversies == PESU faced scrutiny following student suicides in 2020, 2023, and 2024. In July 2023, Aditya Prabhu, a 19-year-old B.Tech student, died by suicide after being caught with a mobile phone during an exam, prompting allegations of faculty harassment. Three faculty members were charged with abetting suicide. Another suicide occurred in October 2023, and in May 2024, Carasala Rahul, a 21-year- old student, died after allegedly being denied exam entry. The UGC has called for an investigation into these incidents. == References ==",
 "title": "PES University"
}