{
 "id": "1185159",
 "text": "Gender Information Center NORA, ops (abbreviated as GIC NORA) is a Czech non-governmental, non-profit organization based in Brno, which bases its activities on a feminist approach and deals with the field of gender.Covid-19 is threatening CEE's gender equality gains. Emerging Europe [online]. 2021-11-10 [cit. 2023-11-13]. Available online. (English) The organization's mission is to promote equality between men and women in societyGender and language make for a volatile mix in Central and Eastern Europe. Emerging Europe [online]. 2021-06-22 [cit. 2023-11-13]. Available online. (English) and improve the living standards of socially disadvantaged groups in Czech society. Its activities include projects focusing on gender-sensitive education, eliminating discrimination against ethnic minoritiesReflection on the Let's Make the Invisible Visible conference organized by Nora on August 17, 2023 - Blog iDNES.cz. iDNES.cz [online]. [cit. 2023-11-13]. Available online. and LGBTQ+ people, promoting equality between women and men in the labor market,REUTERS. Women in companies earned a quarter less wages than men. They were better paid by the state. iDNES.cz [online]. 2016-06-28 [cit. 2023-11-13]. Available online. preventing gender-based violence not only in the workplace,Prevention of Gender-Based Violence in the Work Environment of Public Research Institutions and Universities in the Czech Republic | J. Heyrovský Institute of Physical Chemistry. www.jh-inst.cas.cz [online]. [cit. 2023-11-13]. Available online.LINDOVSKÁ, Aneta. Gender-based violence in the workplace is still a problem in the Czech Republic. Nora is preparing training videos. blog.givt.cz [online]. [cit. 2021-11-13]. Available online.ĐORĐEVIĆ, Nikola. Why have so many countries in emerging Europe failed to take action to combat domestic violence?. Emerging Europe [online]. 2020-06-02 [cit. 2023-11-13]. Available online. (English) and others. Among other things, the organization conducts gender audits of companies and institutions.S.R.O, Via Aurea. Gender Equality Plan MMCI Masaryk Memorial Cancer Institute Brno. www.mou.cz [online]. [cit. 2023-11-13]. Available online. == Origin == The GIC Nora organization was founded in the fall of 2004. It was initiated by students and teachers from the Faculty of Social Studies of Masaryk University in Brno. The organization's goal was to expand gender activities beyond academia. The Gender Center of the Faculty of Social Sciences of the University of Moravia in Brno, the women's interest group Medúza, and Stud Brno participated in establishing the center.Organization structure :: Nora. www.gendernora.cz [online]. 2023-04-26 [cit. 2023-11-13]. Available online. The founding members were based on the idea that equality had been achieved de jure in the Czech Republic, as the principle of equality is enshrined in several key legal documents, such as the Charter of Fundamental Rights and Freedoms or the Anti-Discrimination Act . However, in their view, there is still a long way to go to achieve de facto equality.Nora members. www.gendernora.cz [online]. 2023-10-23 [cit. 2023-11-13]. Available online. === Origin of the name === The name of the organization, NORA, is inspired by the heroine of Henrik Ibsen's 1879 play A Doll's House. The main character, Nora, became a global symbol of women's emancipation. == Projects and focus == Since 2014, the NORA Gender Information Center has focused on extensive educational activities. These include various projects, courses, and trainings on gender-related topics, such as non-stereotypical career choices, supporting girls in technical and scientific fields (STEM), gender-sensitive language, and more.Burrow. www.gendernora.cz [online]. 2023-10-15 [cit. 2023-11-13]. Available online. GIC Nora also actively contributes to the discussion on unequal pay for women and men. In cooperation with the Office of the Public Defender of Rights, it initiated a project in 2015–2016 aimed at raising public awareness in the Czech Republic about unequal pay ( Gender Pay Gap ).Beware of the gender pay gap!. www.ochrance.cz [online]. [cit. 2023-11-13]. Available online. The project aimed to stimulate social discussion and find ways to prevent this form of inequality. In 2021, the Gender Pay Gap in the Czech Republic reached 15.0 %, while the average GPG in the European Union was 12.7 %. In addition, GIC Nora conducts gender audits of companies and institutions in both the public ČABANOVÁ, Adéla. When hospitals address gender, they will get happier employees. Medical Tribune [online]. [cit. 2023-11-13]. Available online. Equal Opportunities Plan. Charles University [online]. [cit. 2023-11-13]. Available online.UNIVERSITY, Masarykova. Equal Opportunities Audit at the Faculty of Education, MU. Faculty of Education MU [online]. [cit. 2023-11-13]. Available online.Equal Opportunities Audit - Human Resources Management Department. orlz.mendelu.cz [online]. [cit. 2023-11-13]. Available online. and privateReferences and partners | Euregnia - accounting and tax consultancy. www.euregnia.cz [online]. [cit. 2023-11-13]. Available online. spheres. These audits serve as a corporate development tool to uncover potential non-compliance with the law, such as discrimination based on gender or age. This approach seeks to promote equal opportunities and access to remuneration, career growth and further development of male and female employees. An important output of a gender audit is a gender equality plan.SMEKALOVÁ, Monika. Gender Equality Plan. epale.ec.europa.eu [online]. 2022-06-03 [cit. 2023-11-13]. Available online. GIC Nora also focuses on the issue of intersectionality, i.e. the interconnection of various identity factors, especially in the areas of gender, ethnicity, sexuality and education. Since 2015, it has started to involve the Roma minority (especially Roma girls and women) living in Brno and the South Moravian Region in its projects.REFRESHER. The Czech project presents young, successful Romani women. We want to show that Romani people are not a burden, says its founder. refresher.cz [online]. [cit. 2023-11-13]. Available online. O Roma vakeren with Iveta Demeterová. Radiožurnál [online]. 2020-09-12 [cit. 2023-11-13]. Available online. == Membership and Partnership == GIC Nora has been a member organization of the Czech Women's Lobby, since 2014. (ČŽL), a network of organizations defending women's rights in the Czech Republic.https://czlobby.cz/cs/clenske-organizace. czlobby.cz [online]. [cit. 2023-11-13]. Available online. GIC Nora is a partner of Amnesty International's Letter Writing Marathon. AMNESTY INTERNATIONAL CZECH REPUBLIC. Together we are creating a path to justice.... maraton.amnesty.cz [online]. Available online. Nora focuses primarily on people who are unfairly persecuted for their sexual orientation, gender identity, or for defending women's rights. == Reference == Category:Articles with VIAF identifiers Category:Articles with NKC identifiers",
 "title": "Gender Information Center NORA"
}