{
 "id": "1185287",
 "text": "Isatou Ceesay is a Gambian environmental activist and social entrepreneur. Her work convinced two countries, The Gambia and Senegal, to ban plastic bags in 2015. She is the Director of the Gambia Women’s Initiative (WIG). She began teaching women in her village to recycle trash. They made bags that people could reuse many times. Ceesay worked with more and more women. Now, she helps women all over The Gambia start businesses that let them earn money to live. Ceesay received the Goldman Environmental Prize in 2011 and the International Alliance for the Defense of Women Award in 2012. Miranda Paul wrote a book about her in 2015. It is titled One Plastic Bag: Isatou Ceesay and the Recycling Women of The Gambia. Ceesay was always bothered by garbage around her village, N'Jau. The garbage harmed the environment and the people and animals living there. Old plastic bags were one of the most common kinds of trash. Ceesay and several other women started the Njau Recycling and Income Generating Group in 1997. A Peace Corps worker from the United States also helped. Her name is Peggy Sedlak. Together they figured out how to clean plastic bags. They cut them into strips of \"plarn\" (short for \"plastic yarn\") and crochet them into reusable items. Their nonprofit also helped women earn money by selling the purses and other items they made from old plastic bags. Some people in their village did not like their organization. Some people thought it was embarrassing to sort trash to find plastic bags. Other people did not like women earning money for their families. They thought earning money was work for men. The Recycling Centre kept doing its work anyway. A Swedish non-profit called Future In Our Hands hired Ceesay in 2009. Her new job allowed Ceesay to work all over the country. Ceesay used her relationships all over The Gambia to also spread the Recycling Center's ideas to over seventy-five communities around the country. The Recycling Center later changed its name to The Gambia Women’s Initiative. It now helps women earn money to live by creating different businesses. The businesses are usually environmentally sustainable. Gambia Women’s Initiative has trained more than 5000 women. It is also the longest-running grassroots organization in The Gambia. ==References== Category:Living people Category:Gambian people Category:Environmentalists Category:Climate activists",
 "title": "Isatou Ceesay"
}