{
 "id": "1185299",
 "text": "The Hindustani-speaking world refers to the areas where the Hindustani language is spoken. This includes places where Hindustani—such as Standard Hindi, Standard Urdu, or regional varieties—is used as an official, administrative, cultural, or commonly spoken language. == Background == The Hindustani language developed in medieval India through contact between different linguistic and cultural groups. It was influenced by Indo-Aryan, Iranian, Arabic, and Turkic languages, especially during the Mughal Empire. Today, it has two standard forms: Hindi, written in the Devanagari script, and Urdu, written in the Perso-Arabic script. Both forms have similar grammar and much shared vocabulary, so speakers of one can usually understand the other. The idea of Hindustani as a \"unifying\" or \"fusion\" language that transcends communal and religious divisions across the Indian subcontinent was strongly supported by Mahatma Gandhi. Unlike Hindi, often associated with the Hindu community, and Urdu, linked with the Muslim community, Hindustani was seen as a neutral medium belonging to all. It was also considered simpler and more accessible for the general population to learn. Translation between Hindi and Urdu typically involves transliteration between their scripts—Devanagari and Perso-Arabic—since the spoken language is largely mutually intelligible. Full translation is generally only needed for religious or literary texts that use domain-specific vocabulary. Before 1947, Hindustani was officially recognized by the British Raj. However, after independence, the term \"Hindustani\" gradually fell out of official use and today holds no formal status in either India or Pakistan. Instead, the language is officially acknowledged through its standardized forms—Hindi in India and Urdu in Pakistan. As of 2023, Hindi and Urdu together—collectively referred to as Hindustani—constitute the third- most spoken language in the world after English and Mandarin, with approximately 843 million native and second-language speakers, according to Ethnologue. In 1995, the number of Hindi–Urdu speakers was around 300 million, already placing Hindustani among the top three most spoken languages globally. == Statistics == Native speakers of the Hindustani language by country Country or territory Number % Status Notes & References 829,000 2% Minority Language 460,000 37.6% Official Language (Hindi) 79,539 6.1% Minority Language Bhojpuri is considered a dialect of Hindustani. 579,119,824 48% Official Language (Hindi) Scheduled Language (Urdu) Total native speakers of Hindi & Urdu. 22,332,193 9.3% National Language (Urdu) 441,000 4.2% Court Language (Hindi) 321,465 0.9% Minority Language 61,000 4.4% Minority Language Trinidadian Hindustani 54,000 1.9% Minority Language 150,000 24% Minority Language Sarnámi Hindustáni 6,000 1.9% Minority Language 870,399 3% Minority Language Awadhi and Bhojpuri are considered separate in Nepal's Census. 845,000 2.1% Minority Language 221,684 0.8% Minority Language 84,000 1.6% Minority Language 344,654 0.5% Minority Language 1,372,802 0.4% Minority Language Total 484,630,000 5.9% - - == References == Category:Pages with unreviewed translations Category:Language Category:Hindi Category:Urdu language",
 "title": "Hindustani-speaking world"
}