{
 "id": "1185509",
 "text": "Tibetans in India are one of the biggest Tibetan communities living outside Tibet. After the 1959 uprising against Chinese rule, the 14th Dalai Lama and many Tibetans ran away to India for safety. Since then, India has been the main country giving them shelter and places to live. The Tibetan government- in-exile, called the Central Tibetan Administration, is based in Dharamshala, in the state of Himachal Pradesh. == Background == Tibetans and Indians have had close ties for a long time because of Buddhism. But the large movement of Tibetans to India started in 1959. That year, the 14th Dalai Lama and many Tibetans escaped from Tibet after China crushed a protest in Lhasa. India’s Prime Minister at the time, Jawaharlal Nehru, gave them safe shelter. He also let them set up the Tibetan Government-in-Exile in Dharamshala, a town in Himachal Pradesh. Between 1959 and 1963, about 80,000 Tibetans came to live in India. The Indian government gave them land to live and work on in places like Himachal Pradesh, Karnataka, Arunachal Pradesh, and Uttarakhand. More Tibetans came later during the Cultural Revolution (1966–1976) and again in the 1980s and 1990s because life in Tibet was still very hard under Chinese rule. == Settlements == Tibetans in India primarily reside in over 35 designated settlements across various states. The largest Tibetan communities are found in: * Dharamshala, Himachal Pradesh – Headquarters of the Tibetan Government- in-Exile and home to the Dalai Lama. * Bylakuppe, Karnataka – One of the largest Tibetan settlements, home to several monasteries and institutions. * Mundgod, Karnataka – A major settlement with monastic centers. * Majnu-ka- tilla, Delhi – A well-known Tibetan refugee colony in India's capital. The 2011 census of India recorded 83,799 Tibetans in India. == Legal status == Tibetans in India have a special legal status. They are not Indian citizens, but the Indian government gives them Identity Certificates, which they can use to travel. Before, it was hard for Tibetans to get Indian passports. But in 2017, a court said that Tibetans born in India between 1950 and 1987 can become Indian citizens under the law. Still, many Tibetans do not apply for citizenship because they would lose the special help they get as refugees.Namgyal Dolkar v. Union of India. == Culture and religion == Tibetans in India have preserved their cultural and religious traditions. Tibetan Buddhism plays a central role in community life, with major monasteries such as Namdroling Monastery in Karnataka and Tawang Monastery in Arunachal Pradesh serving as cultural hubs. Institutions such as the Library of Tibetan Works and Archives in Dharamshala work to preserve Tibetan literature, history, and philosophy. Losar (Tibetan New Year) and the Dalai Lama’s birthday are widely celebrated in Tibetan settlements. Traditional Tibetan arts, including Thangka painting and opera, are also maintained through community efforts and educational programs. == Language == The Tibetic languages are a group of related languages from the Sino-Tibetan family. They are spoken by about 8 million people, mostly Tibetans, in places like the Tibetan Plateau, Baltistan, Ladakh, Nepal, Sikkim, and Bhutan. These languages are very different from each other and cannot be easily understood across regions. Classical Tibetan is an important written language, especially for Buddhist texts. Some main forms of Tibetan—like Central Tibetan (spoken in Lhasa), Khams, and Amdo—are seen as dialects of one language because they share the same writing system. Other related languages, like Dzongkha, Sikkimese, Sherpa, Jirel, and Ladakhi, are treated as separate languages. == Economy and education == Many Tibetans in India are engaged in handicrafts, agriculture, and small businesses. The Carpet weaving industry, in particular, is a significant source of income for Tibetan refugees. Others operate restaurants, hotels, and travel businesses catering to tourists interested in Tibetan culture. Education is very important for the Tibetan exile community. In 1961, the Central Tibetan School Administration was created to run schools for Tibetan children. For college-level education, there are places like the Dalai Lama Institute for Higher Education and Sarah College for Higher Tibetan Studies. == Related pages == * Ladakhi people * Sikkimese people == References == Category:Ethnic groups",
 "title": "Tibetans in India"
}