{
 "id": "1185093",
 "text": "Tirhuta, also called Mithilakshar or Maithili script, was traditionally used to write the Maithili language, spoken by about 35 million people in the Mithila region. It was also used for writing Sanskrit. Tirhuta belongs to the same script family as Bengali–Assamese, Newari, Odia, and Tibetan. == History == The Lalitavistara, an old Buddhist text, mentions the Vaidehi script. Around the late 600s AD, big changes happened in the writing style used in the northeast of India. This change first appeared in the writings of King Adityasena. Over time, the eastern version of this new script became the Maithili script, which later became popular in places like Assam, Bengal, and Nepal. The earliest written evidence of the Maithili script comes from the 7th century AD. It appears in inscriptions by King Adityasena on the Mandar Hill Stone in Bounsi, Banka district, Bihar. These inscriptions are now kept in the Baidyanath Temple in Deoghar and are important for understanding the early form of the Maithili script.Chaudhary, Radha Krishna (1976). \"A Survey Of Maithili Literature\". Archive.org. The script has been used throughout Mithila from Champaran to Deoghar. == Current status == The use of the Maithili script has been declining over the past 100 years, which has also led to a decline in the culture. Even though Maithili is recognized by the constitution, its growth is held back because the script is not widely used today.Press Information Bureau Government of India Ministry of Education (11 February 2019). \"The MHRD constituted a Committee in the year 2018 for making a report for the Promotion and Protection of Maithili Language and its scripts\". Today, the Maithili language is mostly written in the Devanagari script, but the Tirhuta script is still occasionally used by religious pundits and culturally aware families for ceremonial letters (pātā), documents, and cultural events, with ongoing efforts to revive and expand its use.\"An overview of Tirhuta script of Maithili language of India and Nepal\". Script Source. Maithili was officially recognized as one of Nepal’s 14 provincial languages and was added to the Eighth Schedule of the Indian Constitution in 2003, confirming its status as an independent language. However, only the Devanagari script is officially used today.India Mysore, CIIL. \"SCRIPT AND SPELLING of Maithili language\". LIS-India. == Letters == === Consonant letters === Tirhuta script uses its own signs for the positional decimal numeral system. == Image Gallery == File:Mandar_parvat_inscriptions_of_Tirhuta.jpg|7th Century AD, Mandar Parvat inscriptions of Tirhuta File:Tirhuta_script_found_on_Mandar_parbat.jpg|Tirhuta script found on Mandar Parvat File:Tirhuta_inscriptions_at_Mandar_Parvat.jpg|Image showing early Tirhuta writing in 7th century AD, Mandar Hills inscriptions File:Table_showing_various_alphabets_used_in_Mithila.png|Table showing various alphabets used in Mithila File:Varṇa_Ratnākara_manuscript_in_the_Library_of_Royal_Asiatic_Society_of_Bengal.jpg|Varṇa Ratnākara manuscript in Maithili script File:Three_scripts_of_Mithila.png|A Sanskrit Shloka written in three characters of Mithila File:Mithilakshara_Scripts_hand_writting.jpg|Hand written Mithilakshara scripts File:Inscription_of_King_Narsimha_of_the_Oinwar_dynasty_of_Mithila.jpg|Inscription of King Narasimha of the Oinwar dynasty in the Tirhuta script at the Kandaha Sun Temple in Saharsa district, (c. 1435 A.D.) == Unicode == Tirhuta script was added to the Unicode Standard in June 2014 with the release of version 7.0. == References == Category:Brahmic scripts Category:Scripts with ISO 15924 four-letter codes Category:Pages with unreviewed translations",
 "title": "Tirhuta script"
}