{
 "id": "1185718",
 "text": "\"Home Sweet Home\" * * * is a power ballad by American heavy metal band Mötley Crüe. It was released in 1985 in the album Theatre of Pain, and again in 1991 for the Decade of Decadence 81-91 compilation album. It has been covered by several artists, most notably country singer Carrie Underwood, who released her version as a single in 2009. ==Release== ===1985 version=== Originally released on the band's 1985 album, Theatre of Pain, the song came with a music video (MV) documenting the band's performances during one or several concerts. Some of the original video was shot in Houston, Texas live at The Summit during the 1985 Theatre of Pain tour. They performed the song twice that night apparently to get more video footage. Home Sweet Home was released and remixed twice: once for the original promotion for the single in 1985. A radio only promo 12\" with the remix was sent to stations, but not released commercially until the 1988 Japan-only EP Raw Tracks. ===1991 version=== The song was remixed again in 1991 with additional instrumental overdubs. Now called \"Home Sweet Home '91\", it was released as a single with a new video and included on the Decade of Decadence compilation. ==Music video== The video, directed by Wayne Isham and guest-starring actor Michael Berryman, depicts each band member receiving a phone call home, and replying \"I'm on my way!\", Vince Neil on a beach, Mick Mars on a throne in a haunted house, Nikki Sixx at a bar, and Tommy Lee at a wild party. The piano intro plays over a clip of a tour bus driving by at sunset. The rest of the video shows the band pre-concert and performing on stage, shot at The Summit in Houston, Texas (concert footage) and Reunion Arena in Dallas, Texas (exterior). The end of the video shows the same tour bus with the words \"Rockin 'N' Rollin\" on the marquee. The video topped the MTV daily request chart for over three months, until MTV used the \"Crue Rule\", dropping videos from their request line 30 days after their MTV premiere. ==Track listing== # \"Home Sweet Home\" # \"Red Hot\" ==Personnel== * Vince Neil – lead vocals * Mick Mars – guitar * Nikki Sixx – bass, keyboards, backing vocals * Tommy Lee – drums, piano ==Chart positions== The original release of \"Home Sweet Home\" peaked at No. 89 on the Billboard Hot 100 and No. 80 on the Cash Box Top 100. \"Home Sweet Home '91\" peaked at No. 37 the Billboard Hot 100 and did significantly better on the Cash Box Top 100, peaking at No. 19. As of 2025, \"Home Sweet Home '91\" is the last Mötley Crüe song to chart on the Billboard Hot 100. Chart (1985-1986) Peak position US Cash Box Top 100 19 \"Home Sweet Home '91\" Chart (1991) Peak position Australia (ARIA) 88 US Cash Box Top 100 19 Chart (2019) Peak position ==Carrie Underwood version== Country singer Carrie Underwood recorded a cover version in 2009 as the contestant farewell song for the eighth season of American Idol. Underwood performed the song live on the season finale. The song was included on the deluxe edition of her third studio album Play On, released exclusively in Australia and New Zealand. It sold 288,000 downloads in the United States (US). ===Chart positions=== Chart (2009) Peak position ==Justin Moore version== Justin Moore covered the song as a duet with Vince Neil on the 2014 album Nashville Outlaws: A Tribute to Mötley Crüe. It was sent to country radio on July 8, 2014. On the Country Airplay chart dated for July 19, 2014, Moore's version was the highest-debuting song of the week, entering at No. 39. The song has sold 112,000 copies in the U.S. as of September 2014. Sales figures given here The members of Mötley Crüe make a cameo appearance in the song's promo video. ===Chart positions=== Chart (2014) Peak position ==Cover versions== Details Examples * The song was re-recorded by Linkin Park vocalist Chester Bennington on co-lead vocals along with Mötley Crüe in the wake of Hurricane Katrina. The music video for the song shows videos of Katrina rescues, along with a performance from the band * 30 Foot Fall included a cover version of the song as a bonus track on their album Ever Revolving, Never Evolving * It was also recorded by Limp Bizkit for their Greatest Hitz album, and is joined by a remake of Bitter Sweet Symphony' by The Verve. It is often referred to as \"Bittersweet Home\" * Rob Corddry did a cover version for the 2010 film Hot Tub Time Machine * Tommy Lee performed the song on piano when he guest starred as a singer on the TV series Californication at the end of the episode of \"Lights, Camera, Asshole\". This version also appears on the show's Season 4 soundtrack * In 2013, former American Idol contestant Todrick Hall made a version of the song in a medley video in tribute to The Wizard of Oz * John Cena performed a piano cover of \"Home Sweet Home\" in episode six of Peacemaker in 2022. This version was arranged by John Murphy ==Reception== The song is often called a power ballad, and its success became a marketing template for other hair bands of the late 1980s.[ Theatre of Pain article on Allmusic] The song ranks number 12 on VH1's list of the greatest power ballads. The Cash Box said that the song has \"a slow-rocking groove and a surprisingly melodic verse and chorus,\" making it \"a pleasant metal outing.\" Billboard called it a \"loping rock ballad [that] is beefed up by power guitar.\" ==Legacy== A parody of this video was used for the end credits of the 2010 film Hot Tub Time Machine, with Rob Corddry's character Lou \"Violator\" Dorchen clothed in Vince Neil's purple vest, white tiger striped spandex and headband, with the band's name altered to \"Mötley Lüe\". It also parodies some of the same clips from the original video. Drummer Tommy Lee re-recorded the song in 2011, for Season 4 of the TV series Californication, and has a cameo in \"Lights, Camera, Asshole\" performing the song on piano in a bar at the end of the episode, the third episode in the show's fourth season was named for this song. John Cena performs a heartfelt, instrumental rendition of the song at the end of the sixth episode of Peacemaker. This version was released as a single on February 4, 2022. ==References== Category:1985 songs Category:1980s ballads Category:Mötley Crüe songs Category:Carrie Underwood songs",
 "title": "Home Sweet Home (Mötley Crüe song)"
}