{
 "id": "1185763",
 "text": "King Khagemba (ruled 1597–1654) was a ruler of the kingdom of Kangleipak, now known as Manipur. He was called \"Khagemba,\" which means \"the conqueror of the Chinese.\" He got this name after defeating Chinese soldiers who came from the north. === Achievements === King Khagemba made many changes in Manipur. He brought new clothing styles and a new way of playing polo. He also built many markets, including the Ima Market, which still exists today. During his rule, Chinese workers helped build bridges and walls. These workers were prisoners of war from China. They taught the people of Manipur how to make bricks. These bricks were used to build the Kangla Gate and other places. Manipur also started using coins more widely during his rule. He allowed Muslims to settle in the kingdom and made good relationships with the Mughal Empire. == Military Conflicts == === Fight with the Mughals === In 1606, the Mughals, led by Shah Jahan, tried to attack Manipur. Prince Sanongba, the younger brother of King Khagemba (also called Ningthou Hanba), joined the Mughals because he wanted to become king. But the Mughals and Sanongba were defeated and captured in Cachar. King Khagemba brought many Mughal prisoners to Manipur. === War with the Chinese === In 1631, the Chinese emperor Chongzhen of the Ming Dynasty sent his army south after taking over parts of Myanmar. They moved toward Manipur, but King Khagemba defeated them. The Chinese emperor ran back to Yunnan. King Khagemba brought many Chinese prisoners to Manipur. He used their skills to build things like the arched bridge over the Nambul River and the gate at the royal palace. The Chinese taught the people how to make bricks. These bricks were small and not fully baked. The Manipuri language also borrowed the Chinese word for \"brick.\" === War with Burma === In 1649, Burma invaded Manipur, but King Khagemba quickly stopped the attack. === War with Tripura === King Khagemba also fought with the Tripura kingdom in 1603 and 1634. In the 1634 war, his army captured 200 people from Tripura. == References == Category:History of Manipur Category:16th-century births Category:1652 deaths",
 "title": "Khagemba"
}