{
 "id": "1185582",
 "text": "Yuka is a mummified woolly mammoth (Mammuthus primigenius) discovered by tusk hunters in August 2010, and was turned over to local scientists, who made an initial assessment of the carcass in 2012. Yuka died about 39,000 years ago. Radiocarbon dating suggested that Yuka the mammoth is around 28,140 (±230) years old. It is considered the most intact woolly mammoth carcass. Scientists believe its corpse froze after falling into a lake, making it remain in a frozen state for generations. Yuka's body is now used by researchers to clone and hopefully revive the woolly mammoth. Yuka's corpse is in such good shape that much of its flesh is still intact, retaining its pink color. The blonde- red hue of Yuka's woolly coat also remains. == Discovery == A female woolly mammoth calf carcass was found along the Oyogos Yar coast of the Dmitry Laptev Strait, near the Kondratievo River, Siberia (72° 40′ 49.44″ N, 142° 50′ 38.35″) in the region of the Laptev Sea. The mammoth was nicknamed \"Yuka\" after the village of Yukagir, whose local people discovered it. Yuka was also near the village. After its discovery, Yuka stayed for two years in a natural refrigerator, the local permafrost at Yukagir. == Research == === Age === An analysis of the teeth and tusks said Yuka was about 6–8 years old when it died. The mammoth had most likely been attacked by lions or other predators. However, evidence that the predators killed Yuka was not found. === Cells === In March 2019, a Japanese research team of scientists led by Kazuo Yamagata, a biologist at Kindai University, worked with Yuka's tissue. Yamagata's team reported that they were able to stimulate nucleus-like structures to perform biological activities and visualised their dynamics in living mouse oocytes after nuclear transfer. But this did not lead to cell division. === Brain === Yuka is also famous for its intact brain. It is the most preserved mammoth brain in the world. The preliminary description of the gyri and sulci is described and paleoneurological perspectives are observed and discussed. == Gallery == File:Yuka (Mammuthus primigenius) - Skull and Lower Jaw B.JPG|Yuka's skull and mandible File:Yuka (Mammuthus primigenius) - Skull and Lower Jaw A.JPG|Another image == Related pages == * Lyuba (mammoth) – previously known as the best preserved mammoth mummy ever * Yukagir Mammoth * List of mammoth specimens == References == Category:Mummies Category:Proboscideans",
 "title": "Yuka (mammoth)"
}