{
 "id": "1185019",
 "text": "Arthur L. Costa (born November 30, 1931) is an American teacher, author, and professor emeritus of education at California State University, Sacramento. == Early life and education == Costa was born in Tampa, Florida. He studied at the University of Southern California, where he earned a Bachelor of Science degree in 1953 and a Master of Science degree in 1958. Later, he earned a Doctorate in Education from the University of California, Berkeley. == Career == Before he retired in 1998, Costa worked in many different jobs in education. He was a professor of education at California State University, Sacramento from 1969 to 1990. He was also the chair of the Department of Educational Administration from 1976 to 1979. Earlier, he worked as the Assistant Superintendent of Educational Services for the Sacramento County Office of Education (1964–1968), Director of Educational Programs at NASA in Santa Monica, California (1962–1964), curriculum consultant for the Los Angeles County Superintendent of Schools (1958–1962), and as a teacher for grades 7 and 8 in Bellflower Unified School District (1955–1958). Costa also taught as a visiting professor at many universities, including North Carolina State University, Texas Christian University, University of Wisconsin–Green Bay, University of Massachusetts Boston, and Western Michigan University. His teaching work continued from the late 1950s to the early 2000s. Costa and Robert Garmston started the Center for Cognitive Coaching in El Dorado Hills, California. Later, Costa and Bena Kallick started the International Institute for Habits of Mind in Westport, Connecticut. These groups train teachers and schools to help students become better thinkers and more independent learners. The \"Habits of Mind\" program created by Costa and Kallick has been used in schools across the United States and in many countries such as Australia, the United Kingdom, New Zealand, South Africa, Argentina, Mexico, Singapore, Hong Kong, Italy, Spain, and Canada. Schools that used these ideas, like Estrella Elementary School in Los Angeles, Furr High School in Houston, and Waikiki Elementary School in Honolulu, reported better student learning, better school culture, and more parent involvement. == Publications == Costa has written or helped write many books and articles about education, thinking, and cognitive coaching. Some of his works include: *Leading Learning Organizations with Habits of Mind (2020) *Nurturing Habits of Mind in Early Childhood (2019) *Cognitive Coaching: Developing Self-directed Leaders and Learners (3rd ed., 2015) *Academic Conferences for School Teacher Leaders (2014) *Cognitive Capital: Investing in Teacher Quality (2014) *Dispositions: Reframing Teaching and Learning (2014) *The Power of the Social Brain: Teaching, Learning, and Using Interdependent Thinking (2013) *Learning and Leading with Habits of Mind: 16 Characteristics for Success (2009, co-editor) *Habits of Mind Across the Curriculum (2009, co-editor) *The School as a Home for the Mind (2008) *Thinking Based Learning (2008, co-author) *Assessment Strategies for Self- Directed Learning (2004) *Developing Minds: A Resource Book for Teaching Thinking (2001, editor) *Habits of Mind (2000, co-editor) *Process as Content trilogy (1997, co-editor) *Assessment in the Learning Organization: Shifting the Paradigm (1995, co-editor) *Cognitive Coaching: A Foundation for Renaissance Schools (1994; later editions in 2002 and 2016) *Techniques for Teaching Thinking (1989, co-author) *Better Teaching Through Instructional Supervision: Policy and Practice (1986, co-editor) *If Minds Matter: A Forward To The Future (co-editor) == References == Category:Living people Category:1931 births Category:American teachers Category:Writers from Tampa, Florida Category:California State University faculty",
 "title": "Arthur L. Costa"
}