{
 "id": "1185603",
 "text": "Emmanouil Varvounis (; born 1966 in Samos, Greece) is a Greek academic and folklorist. He serves as a professor of folklore in the Department of History and Ethnology and dean of the School of Classical and Humanistic Studies at the Democritus University of Thrace. His work addresses Greek folk culture, religious traditions, and regional ethnography, with a particular emphasis on the history and customs of Samos. == Early life and education == Varvounis studied history and archaeology at the Philosophical School of the University of Athens, followed by theology at the university’s Theological School. He earned a doctorate in folklore in 1991 from the University of Athens’s Department of Primary Education under Professor M. G. Merakles, with a thesis titled \"Folk Religion and Religious Behaviour of the Inhabitants of Samos.\" From 1996 to 1997, he conducted postdoctoral research at the Université catholique de Louvain in Belgium. == Career == Varvounis joined the Democritus University of Thrace in 1992, advancing from lecturer to full professor of folklore by 2012. He served as Vice-Chair of the Department of History and Ethnology (2010–2012, 2014–2015) and later as Chair (2016–present). Since 2005, he has also taught at the “Free University” of the Athens-based “Society of Friends of the People.” === Academic work === Varvounis has held several administrative positions at the Democritus University of Thrace, including serving as Chair of the Department of History and Ethnology since 2015. He has been a member of the university’s Senate (1997–1998, 2015–present), the Research Committee (2010–2013), and the Deanship of the School of Classical and Humanistic Studies (2015–present). Outside the university, he served as Secretary of the Cultural Organization of the Prefectural Government of Samos (OPONAS) from 2008 to 2010 and was a member of the Board of Directors of the Center for Popular Events of Komotini (1995–2003). He has also participated in ecclesiastical and cultural bodies, including the Special Synodal Committee for Ecclesiastical Arts (2006–2009) and the Special Synodal Committee for Cultural Identity of the Holy Synod of the Church of Greece (2010–present). Since 2013, he has been a member of the Board of Directors of the Institute of Popular Culture of Karpathos, a joint initiative of the School of Philosophy of the University of Athens and the Municipality of Karpathos. On September 5, 2024, Varvounis was re-elected as Dean of the School of Classical and Humanistic Studies at the Democritus University of Thrace. This marked his second term in the position, following his initial election in 2021. ==Honors and distinctions== In 2005, Emmanouil Varvounis was conferred the title of Archon Protector of the Letters of the Holy Great Church of Christ by Ecumenical Patriarch Bartholomew. In 2007, he received the title of Archon Portfolio of the Alexandrian Throne from the Patriarch of Alexandria,https://dspace.nplg.gov.ge/bitstream/1234/145383/1/Phasis_2010-2011_N13-14.pdf and in 2011, he was named Crossbearer of the Holy Sepulchre by the Patriarch of Jerusalem. In 2010, he received a prize from the Academy of Athens. He was awarded the Gold Medal of Arts and Sciences in 2011 and the Grand Gold Cross of Honor by the Österreichische Albert Schweitzer Gesellschaft in 2012. In 2014, he was awarded an honorary Doctor of Letters degree by Saint Stephen Harding University. In 2017, he was named Honorary Professor at the University of Bucharest’s Department of Classical and Modern Greek Philology. In the same year, he was made an Honorary Member of the European Academy of Sciences and Arts. In 2020, Varvounis has been awarded an honorary doctorate by the University of the Aegean. == References == Category:Greek academics",
 "title": "Emmanouil Varvounis"
}