{
 "id": "1185266",
 "text": "The Jan Lokpal Bill, also known as the Citizen's Ombudsman Bill, was a proposed law created by Indian civil society activists. It aimed to set up an independent body called the Jan Lokpal to investigate corruption cases. The goal was to complete investigations within one year and ensure trials were also finished within the same time frame. The Jan Lokpal aimed to stop corruption, address complaints from citizens, and protect people who report wrongdoing (whistle-blowers). The word Jan means \"citizens,\" showing that the bill included suggestions from everyday people, gathered through public meetings led by activists—not the government. The word Lokpal was coined in 1963 by L. M. Singhvi, a member of parliament during a debate. == Origins == The call for a Jan Lokpal was inspired by the Hong Kong Independent Commission Against Corruption. A group of activists, known in the media as Team Anna, helped push this demand forward. == Key features == # The goal was to create a national anti-corruption body called the Lokpal, with similar state-level bodies called Lokayuktas. Key features include: #* Independence: Like the Supreme Court and Election Commission, the Lokpal would be independent of government control and free from ministerial influence. #* Transparent Selection: Members would be chosen by judges, clean-record IAS officers, citizens, and constitutional authorities through a public and transparent process, including open interviews. #* Time-bound Action: Inquiries must be completed within 60 days, and investigations within six months. Lokpal can only begin investigations after hearing the public servant’s side. #* Accountability: Any loss to the government due to corruption would be recovered upon the offender’s conviction. #* Whistle-blower Protection: Individuals who report corruption would be safeguarded. == Powers of the Lokpal == The Lokpal has the authority to investigate corruption complaints against a wide range of public officials. This includes individuals who are or have been the Prime Minister of India, Union Ministers, and Members of Parliament. The Lokpal can also inquire into allegations against government officials working under Groups A, B, C, and D, covering nearly all levels of the Union government bureaucracy. In addition to government officials, the jurisdiction of the Lokpal extends to chairpersons, members, officers, and directors of any board, corporation, society, trust, or autonomous body that is either established by an Act of Parliament or receives full or partial funding from the Union or State government. This ensures that government- funded entities are also held accountable for corruption. Furthermore, the Lokpal Act covers any society, trust, or organization that receives foreign contributions exceeding ₹10 lakh (approximately US$12,045 as of 2024). This broad coverage ensures transparency and accountability not only in government bodies but also in non-governmental organizations that have significant public influence or foreign funding. The Lokpal, however, has limited powers when it comes to investigating the Prime Minister. If the corruption allegations involve matters related to international relations, external or internal security, or public order, the Lokpal cannot begin an inquiry unless certain strict conditions are met. In such sensitive cases, the entire Bench of the Lokpal—comprising the chairperson and all its members—must first meet to consider the complaint. At least two-thirds of the members must agree to initiate the investigation. This process must be conducted in strict confidentiality, with the hearing held behind closed doors (in camera). If the Lokpal decides to dismiss the complaint, then all records related to the hearing will remain confidential and cannot be published or shared with anyone. This rule is intended to protect national interests in matters of high sensitivity.Venkataramanan, K. (23 March 2019). \"What are the powers and duties of Lokpal?\". The Hindu. Retrieved 28 April 2019. Under the Lokpal Act, anyone can file a complaint, as long as it is in the proper format and relates to a corruption offense under the Prevention of Corruption Act committed by a public servant. There are no restrictions on who is allowed to submit such a complaint. Once a complaint is received, the Lokpal has the authority to conduct a preliminary inquiry through its Inquiry Wing. If the complaint appears valid (prima facie), the Lokpal may also direct another agency, like the Central Bureau of Investigation (CBI), to carry out a full investigation. Before allowing an investigation to begin, however, the Lokpal will ask the public servant for an explanation to decide if there’s enough reason to move forward. This step is required, but it does not prevent the investigating agency from carrying out searches or seizures if necessary. For public servants working under the Central Government, the Lokpal can forward the complaint to the Central Vigilance Commission (CVC). The CVC then reports back to the Lokpal for officials in Groups A and B, and directly handles complaints about those in Groups C and D, as per its own rules.Venkataramanan, K. (23 March 2019). \"What are the powers and duties of Lokpal?\". The Hindu. Retrieved 28 April 2019. The Lokpal institution includes two main branches: the Inquiry Wing and the Prosecution Wing. The Inquiry Wing is led by the Director of Inquiry. Its job is to carry out a preliminary inquiry into complaints of corruption made against public servants under the Prevention of Corruption Act, 1988. This inquiry must be finished and a report submitted to the Lokpal within 60 days. Before finalizing the report, the Inquiry Wing must ask for comments from both the public servant involved and the competent authority. The competent authority is different depending on the person under investigation: * For the Prime Minister, it's the Lok Sabha. * For Union Ministers, it's the Prime Minister. * For department officials, it's the Minister in charge of that department. The Prosecution Wing, led by the Director of Prosecution, is responsible for prosecuting public servants based on complaints made by the Lokpal. A Lokpal Bench, made up of at least three members, reviews the preliminary inquiry report once it's submitted. Before making a decision, the Bench must give the accused public servant a chance to defend themselves. After reviewing the report, the Lokpal Bench can: * Order a full investigation * Start departmental action * Close the case if there's no basis to proceed * Take action against the complainant if the complaint is found to be false The preliminary inquiry should usually be completed within 90 days from the date the complaint is received.Venkataramanan, K. (23 March 2019). \"What are the powers and duties of Lokpal?\". The Hindu. Retrieved 28 April 2019. After the investigation, the agency assigned to conduct the probe must file its investigation report in the court of the appropriate jurisdiction and also submit a copy to the Lokpal. A Lokpal Bench consisting of at least three members will review the report. The Bench can then: * Grant permission to the Prosecution Wing to proceed against the public servant based on the chargesheet * Ask the competent authority to take departmental action * Close the case if the report does not warrant further action Previously, the authority to grant permission for prosecution, under Section 197 of the Code of Criminal Procedure and Section 19 of the Prevention of Corruption Act, was with the authority that had the power to appoint or dismiss the public servant. However, now this power is exercised by the Lokpal, a judicial body. Before granting any sanction, the Lokpal must also seek the comments of: * The competent authority (the body that appoints or oversees the public servant) * The public servant involvedVenkataramanan, K. (23 March 2019). \"What are the powers and duties of Lokpal?\". The Hindu. Retrieved 28 April 2019. The institution cannot entertain review petition on the order passed by it as there is no provision to review its orders. == Fundamental duties == # To make jurisdictions against corruption cases with the Lokpal. # To judge whether a case is genuine or whether a fake complaint has been made. Anna Hazare, a Gandhian rights activist, started a fast-unto-death at Jantar Mantar in New Delhi, demanding the passing of the Jan Lokpal Bill. Hazare ended his hunger strike on 9 April 2011, after 98 hours of protest, following the government's announcement of a gazette notification. This notification formed a 10-member Joint Committee, consisting of government ministers and civil society activists (including Hazare), to draft a bill aimed at creating an effective Lokpal. The cause gained widespread support, especially among the youth, who attended candle-lit marches and organized online campaigns via social media to show solidarity with Hazare's movement. Anna Hazare on 8 June 2011, declared that he would again fast unto death on 16 August, if the Lokpal bill were not passed by the Parliament of India by 15 August, which is the Independence Day of India. == Campaign for passage == The first version of the Lokpal Bill, drafted by the Government of India in 2010, was considered ineffective by some anti-corruption activists from civil society. In response, these activists came together to create a citizen's version of the bill, which later became known as the Jan Lokpal Bill. To gather public support, awareness drives and protest marches were organized. The movement gained significant momentum when Anna Hazare announced that he would begin an indefinite fast on 5 April 2011 to demand the passing of the Jan Lokpal Bill. This announcement sparked widespread public support, with people from all over India, especially the youth, participating in rallies and social media campaigns to back the cause. == Criticisms == The Jan Lokpal Bill was met with significant criticism from some quarters, particularly regarding its approach to combating corruption. Pratap Bhanu Mehta, President of the Centre for Policy Research, argued that the bill was \"naïve\" in its institutional approach. He suggested that it lacked a practical understanding of governance and, in some cases, could undermine representative democracy. Former Human Resource Development Minister Kapil Sibal also criticized the bill, stating that it would create an institution that was unaccountable, oppressive, and ultimately undemocratic. Sibal expressed concerns about the concentration of power in a single body like the Lokpal, arguing that it would lack checks and balances, potentially leading to authoritarianism. == References == Category:Pages with unreviewed translations",
 "title": "Jan Lokpal Bill"
}