{
 "id": "118537",
 "text": "Germany's Next Topmodel (also known as GNTM) is a German reality television program. It is hosted by supermodel Heidi Klum. The program is based on the American series America's Next Top Model. The first cycle (season) was in 2006. The 18th cycle began in February 2023. ==Overview== A group of girls are chosen to live together for a few weeks and compete to become Germany's Next Topmodel. Each week, one girl is asked to leave because she is not good enough to stay in the competition and become a top model. The last three/four girls are in the finale. The winner is then chosen with help of the group of judges. There have been 18 cycles of the show so far. == Host and judges == Only Heidi Klum has been a judge on every cycle. Thomas Hayo was a judge for the longest at six cycles, Peyman Amin was next longest at four cycles. Boris Entrup was a judge for cycle two, but he was part of the program until 2017 as the makeup advisor. In 2017 Wolfgang Joop became the first former judge to return to the program. He had been a guest judge for one episode. He came back in 2018 as well. The judging panel since the 14th season was only guest judges and Klum. She was the only permanent judge. Judges Seasons 1(2006) 2(2007) 3(2008) 4(2009) 5(2010) 6(2011) 7(2012) 8(2013) 9(2014) 10(2015) 11(2016) 12(2017) 13(2018) 14(2019) 15(2020) 16(2021) 17(2022) 18(2023) Hosts Heidi Klum colspan=\"18\" Judging Panelists Peyman Amin colspan=\"4\" colspan=\"14\" Bruce Darnell colspan=\"2\" colspan=\"16\" Armin Morbach colspan=\"1\" colspan=\"17\" Boris Entrup colspan=\"1\" colspan=\"1\" colspan=\"1\" colspan=\"15\" Rolf Scheider colspan=\"2\" colspan=\"2\" colspan=\"14\" Qualid \"Q\" Ladraa colspan=\"4\" colspan=\"1\" colspan=\"13\" Kristian Schuller colspan=\"2\" colspan=\"2\" colspan=\"1\" colspan=\"1\" colspan=\"3\" colspan=\"1\" colspan=\"5\" colspan=\"3\" Thomas Hayo colspan=\"5\" colspan=\"8\" colspan=\"5\" Thomas Rath colspan=\"5\" colspan=\"2\" colspan=\"1\" colspan=\"10\" scope=\"row\" colspan=\"6\" colspan=\"1\" colspan=\"1\" colspan=\"1\" colspan=\"9\" Wolfgang Joop colspan=\"8\" colspan=\"2\" colspan=\"1\" colspan=\"5\" colspan=\"2\" Michael Michalsky colspan=\"10\" colspan=\"3\" colspan=\"1\" colspan=\"4\" * == Cycles == Cycle Premiere date Winner Runner-up Number of contestants International Destinations 1 Lena Gercke Yvonne Schröder 12 New York City, Los Angeles, Paris 2 Barbara Meier Anni Wendler 17 St. Moritz, Bangkok, Los Angeles 3 Jennifer Hof Janina Schmidt 19 Barcelona, Vienna, New York City, Sydney, Melbourne, Los Angeles 4 Sara Nuru Mandy Bork 17 Las VegasLos AngelesMiamiNew York CityHonoluluLondonSingapore 5 Alisar Ailabouni Hanna Bohnekamp 18 Cape Town, New York City, Los Angeles, San Francisco, Milan 6 Jana Beller Rebecca Mir 25It was never announced which contestants were part of the final cast. There was no fade-out at the end of each episode, the opening sequence only featured the top 18 and several girls were not present at the live finale for the runway walk. However, ONEeins Management listed the entire top 25 as cast members of the cycle. Schladming, London, Los Angeles, Tampa, Miami, Las Vegas, Rio de Janeiro, Sao Paulo, Nassau 7 Luisa Hartema Hitzschke 25 Phuket, Los Angeles, New York, San Diego, Papeete, Cancún, Paris 8 Lovelyn Enebechi Maike van Grieken 26 Dubai, Los Angeles, New York City, Honolulu 9 Stefanie Giesinger Jolina Fust 25 Singapore, Los Angeles, Salt Lake City, New York City, Mumbai, Paris, Malé 10 Vanessa Fuchs Anuthida Ploypetch 23 Los Angeles, Oahu, Miami, New York City, London, Dubai, Milan, Auckland, Malé, Paris 11 Kim Hnizdo Elena Carriere 24 Lanzarote, Fuerteventura, Madrid, Majorca, Milan, Los Angeles, New York City, Miami, Sydney, Shanghai 12 Céline Bethmann Serlina Hohmann 28 Barcelona, Menorca, Majorca, Paris, Marseille, Los Angeles, New York, Las Vegas, London 13 Toni Dreher-Adenuga Julianna Townsend 29 Las Terrenas, Los Angeles, San Diego, New York City, Cancún, Lisbon, Paris, Havana 14 Simone Kowalski Sayana Ranjan 30 Sölden, Los Angeles, New York City, Miami, Amsterdam, Paris 15 Jacky Wruck Sarah Posch 28 Los Pargos, Los Angeles, New York City, London, Milan, Paris, Montego Bay, Ocho Rios 16 Alex-Mariah Peter Dascha Carriero 31 None 17 Lou-Anne Gleißenebner-Teskey Luca Lorenz 31 Athens, Mykonos, Los Angeles, Ibiza 18 Vivien Blotzki Somajia Ali 35 Los Angeles, Las Vegas, Ibiza ==References== Category:2006 television series debuts Category:2000s television series Category:2010s television series Category:German television series Category:Top Model television series Category:2006 establishments in Germany",
 "title": "Germany's Next Topmodel"
}