{
 "id": "1185217",
 "text": "Mayfair Witches is an American fantasy and horror television series. It started in 2023 and is based on books by Anne Rice. The show tells the story of a woman who learns that she is part of a powerful family of witches. == Story == Dr. Rowan Fielding is a smart brain surgeon. One day, she finds out she is the new leader of a witch family called the Mayfairs. The family history goes back hundreds of years to 17th-century Scotland. Rowan starts to feel new powers and sees strange visions. She also meets a dark and mysterious being called Lasher. He has a strong connection to her family. As she learns more, Rowan must stop a dangerous curse and protect her family from danger. The story moves between the past and present and mixes magic, family secrets, and mystery. == Cast == * Alexandra Daddario as Rowan Fielding * Jack Huston as Lasher * Tongayi Chirisa as Ciprien * Beth Grant as Carlotta Mayfair * Harry Hamlin, Ben Feldman, Alyssa Jirrels, and Olive Abercrombie also appear == Production == The series was filmed in New Orleans, Louisiana. Some scenes were filmed in the Garden District and at the Lafayette Cemetery No. 1. The old house used as the Mayfair family home is based on the real Soria-Creel House at Prytania Street. The production team worked with locals to show the city in an authentic way. == Reception == People liked the dark style, the music, and the performance by Alexandra Daddario. Some critics said the story was a little slow, but most liked the mix of horror and fantasy. The series was popular and got a second season in 2024. A third season is planned for 2026, and it will take place in Salem. == Episodes == === Season 1 === # The Witching Hour # The Dark Place # Second Line # Curiouser and Curiouser # The Thrall # Transference # Tessa # What Rough Beast === Season 2 === # Lasher # Ten of Swords # Cover the Mirrors # Double Helix # Julien’s Victrola # Michaelmas # Tangled Web # The Innocents == Main actress == Alexandra Daddario was born on March 16, 1986, in New York City. She became famous for her role in the Percy Jackson movies. She also acted in True Detective, White Lotus, and movies like San Andreas and Baywatch. Since 2023, she plays the lead role in Mayfair Witches. She is married to producer Andrew Form, and they had a child in 2024. == Sources == * Mayfair Witches on Fernsehserien.tv Category:2023 television series debuts Category:American television series Category:Fantasy television series Category:Horror television series Category:Television shows set in New Orleans Category:English-language television programs",
 "title": "Mayfair Witches"
}