{
 "id": "1185705",
 "text": "The Battle of Tashkent (713) unfolded in the city of Tashkent, located in what is now Uzbekistan, during the early 8th century. This significant conflict featured the forces of the Second Turkic Khaganate clashing with the Umayyad Caliphate. Leading the Turkic forces was the renowned commander Kul Tigin, while the Umayyad troops were under the command of Qutayba ibn Muslim. The battle was a key event in the ongoing struggles for control and influence in the region. ==Background== The Umayyad Caliphate was actively expanding its influence across Asia, particularly in regions like Khorasan and Transoxiana.Silk Road to Belt Road, p.99 The Turks, including groups such as the Turgesh and Khazars, had already engaged in numerous conflicts with the Arabs. Before the battle, the Turgesh had been subjugated by the UmayyadsOrkhon Inscriptions, Kül Tigin Inscription, D.39, K.1 and coerced into fighting against the Göktürk. Meanwhile, Kul Tigin had been conducting campaigns in the area to suppress revolts by the Karluk TurksEssays on Central Asia, p.7 revolts. ==The Battle== Kul Tigin was actively involved in suppressing numerous Karluk uprisings in the region. During this period, Qutayba ibn Muslim had already seized several towns and villages in Transoxiana. With intentions to take Tashkent, Qutayba advanced towards the city. Upon learning of these plans, Kul Tigin moved to Tashkent to defend it against the UmayyadsNikoloayevich Gumilev, Ancient Turks, p.374 Qutayba who had Captured Sas and FerganaRıza Nur, Turkish History, p.68 made it to Tashkent. Qutayba, after capturing Sas and Fergana , arrived in Tashkent, where he confronted Kul Tigin directly. Despite being outnumbered, Kul Tigin stood firm and managed to defeat QutaybaRıza Nur, Turkish History, p.68Nikoloayevich Gumilev, Ancient Turks, p.374 many cities would be recaptured by Kul Tigin for the Göktürks. ==Aftermath== Following the death of Qutayba ibn Muslim, the territorial gains he had achieved in Transoxiana rapidly diminished. Kul Tigin, a prominent leader of the Second Turkic Khaganate, successfully reclaimed numerous cities from Umayyad control. Tashkent, in particular, remained under Turkic dominion for many years, even throughout the Turgesh-Umayyad Wars. This period marked a significant reversal of the Umayyad expansion efforts in the region, highlighting the resilience and strategic prowess of the Turkic forces.Rıza Nur, Turkish History, p.68 ==References==",
 "title": "Battle of Tashkent (713)"
}