{
 "id": "1185233",
 "text": "George Ross Jr (May 10, 1730 – July 14, 1779) was a Founding Father of the United States who signed the Continental Association and the United States Declaration of Independence as a representative of Pennsylvania. He was also the uncle of the man who married Betsy Griscom in 1773, more famous under her married name, Betsy Ross. In 1952, Ross, George Washington, and Robert Morris appeared on a three-cent stamp commemorating Betsy Ross.George Ross was born in May of 1730 in Newcastle, Delaware, into very large family. His father was a minister, educated at Edenburgh, and the Ross children received a sound classical education at home. George then proceeded to read law at the office of his older brother,Initially a Tory, he served as Crown prosecutor for 12 years from 1768 to 1776. His sympathies began to change, and he became a strong supporter of the colonial assemblies in their disputes with Parliament. In 1768 he was elected to the provincial legislature of Pennsylvania. He was elected to Continental Congress in 1774, 1776, and 1777. He was a colonel in the Continental Army in 1776. In 1776, he undertook negotiations with the northwestern Indians on behalf of his colony, and that year he acted as vice president of the state constitutional convention, so then that led to helping draft a declaration of rights. He was re-elected to the Continental Congress in January 1777 but resigned that same year because of poor health. He was vice president of the Pennsylvania constitutional convention and was the Judge of the Admiralty Court of Pennsylvania in 1779. In 1778, while he was acting as admiralty judge, a congressional court of appeals overruled his decision in a case involving a dispute between a citizen of Connecticut and the state of Pennsylvania. He refused to acknowledge the authority of the higher court to counter state decisions, which initiated a dispute between manifestation of the states' rights controversy and did not subside until 1809. He resigned from the Continental Congress in 1777 because of poor health and was appointed to the Pennsylvania Court of Admiralty where he died in 1779 at age 49. He was buried at Christ Church Burial Ground in Philadelphia. ==References== Category:American people Category:1730 births Category:1779 deaths",
 "title": "George Ross (delegate)"
}