{
 "id": "1185730",
 "text": "Nir Knaan (born April 12, 2001) is an Israeli actor, singer and songwriter. == Early life and education == Knaan was born in 2001 in Nes Ziona, the eldest son of Eyal, a programmer, and Merav, a bank employee. He studied computer science in high school, but became interested in theatre and music from a young age. Knaan studied violin and learned to play the piano. As a child, he studied at the Chamber Theatre youth academy, and did his military service at the IDF Theatre. In 2018, he played the role of Ronnie in \"Special Objects Department\". In 2020, he began acting in the Kan Educational series \"The Well\" as Illi. In 2022, he began acting in the series \"Who Heard of Hava and Nava?\" as Spitz. In 2021, he played Ziggy in Avi Nesher's film \"The Picture of Victory.\" In 2022, he starred in the film \"Our Story,\" directed by Yaron Arazi. When the film \"Snow White\" was released in March 2025, Knaan voiced Prince \"Jonathan\" in the Hebrew dub. ==Music career== Starting in 2023, Knaan participated with his band. In July 2023, he released his first song, \"What Am I Doing Wrong?\" Following the song's release, Knaan signed with the Helikon Aroma Music label. In February 2024, his second song, \"Song for Neta,\" was released. Knaan wrote it at the age of 19 as a birthday present for his then- partner, Neta Roth. The song became a hit on TikTok with 900,000 views on YouTube and millions of streams across digital platforms. The song earned Knaan the title of Newcomer of the Year on Kan Gimel. It also received covers from Eden Hasson and Neta Barzilai. In September 2024, he released his third song, \"Don't Go.\" In November 2024, he released his fourth song, \"Enough,\" which was released as part of his debut album and was written about dealing with a breakup. His debut album, \"Blue\", was released on December 4, 2024. In his work on the album, Knaan was influenced by artists such as Yoni Rechter, Gidi Gov, and Yehudit Ravitz, and incorporated nostalgic and youthful elements into his songs. In addition, Knaan is also writing the music for the play \"The Good Soul of Sichuan\" to be performed at the Cameri Theater in Israel. ==References== == Other websites == * on YouTube Category:2001 births Category:Israeli singers Category:Israeli composers Category:Israeli musicians",
 "title": "Nir Knaan"
}