{
 "id": "1185408",
 "text": "The 31 persons listed in the table below are those whose deaths the Soviet Union included in its official roster—released in the latter half of 1986—of casualties directly attributable to the disaster.Some groups, including the UNSCEAR, posit slightly higher direct death tallies of 49, 54, or 59. (See .) Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Table: Known Deaths due to Trauma and Radiation Sickness Name (Eng/Rus): Last, First, PatronymThe disaster relief operation, as well as the whole work of the Chernobyl Nuclear Power Plant, was directly supervised by the Soviet government using exclusively Russian language. Directly translated into wide English use, respective names and terms may differ from their local Ukrainian or Belarusian spelling/pronunciation. Names use eastern European naming conventions. Date and place of birth Date and place of death Cause of death/injury Occupation Description Official Recognition Original 1988 equivalent dose estimates New 2014 revised equivalent dose estimates Akimov, Aleksandr Fyodorovich Акимов, Александр Фёдорович 1953-05-06, Novosibirsk 1986-05-10, Moscow ARS of the 4th degree; burns on 100% of body. Parts of his skin received as much as 400-500Gy of radiation. Skin and intestinal injuries. Unit #4 Shift Supervisor The shift supervisor, in the control room at the time of the explosion; received fatal dose during attempts to restart feedwater flow into the reactor in room 714/2 along with Toptunov, Nekhaev, Uskov and Orlov. Ukraine's Order For Courage of third degree (likely 1100-1300 rem). Unknown Baranov, Anatoly Ivanovich Баранов, Анатолий Иванович 1953-06-13, Tsyurupynsk, Kherson, Ukrainian SSR 1986-05-20, Moscow ARS of the 4th degree, lung injuries. Senior electrical engineer Managed generators during emergency, preventing fire spread through the generator hall. Ukraine's Order For Courage of third degree; Soviet Union's Order of the October Revolution 830-1030 rem. 940-1140 rem. Brazhnik, Vyacheslav Stepanovych Бражник, Вячеслав Степанович 1957-05-03, Atbasar, Tselinograd, Kazakh SSR 1986-05-14, Moscow ARS of the 4th degree. Skin and intestinal injuries. Senior turbine machinist operator In the turbine hall at the moment of explosion. Received fatal dose (over 1000 rad) during firefighting and stabilizing the turbine hall, died in Moscow hospital. Irradiated by a piece of fuel lodged on a nearby transformer of turbogenerator 7 during manual opening of the turbine emergency oil drain valves. Ukraine's Order For Courage of third degree; Soviet Union's Order of the Badge of Honor. 990-1190 rem. 1120-1320 rem. Degtyarenko, Viktor Mykhaylovych Дегтяренко, Виктор Михайлович 1954-08-10, Ryazan, Russian SFSR 1986-05-19, Moscow ARS of the 3rd degree; thermal and radiation burns. Reactor operator Close to the pumps at the moment of explosion; face scalded by steam or hot water. Ukraine's Order For Courage of third degree; Soviet Union's Order of the Badge of Honor. 320-420 rem. 390-490 rem. Ignatenko, Vasily Ivanovych Игнатенко, Василий Иванович 1961-03-13, Sperizhe, Gomel, Byelorussian SSR 1986-05-13, Moscow ARS of the 4th degree. Skin and intestinal injuries. Firefighter, 6th Paramilitary Fire Department, Pripyat, Kyiv A fireman from the Pripyat Fire Department (SWPCH-6/ СВПЧ-6). Arrived on scene at 1:35 AM under the command of Lieutenant Viktor Kibenok. He was the first man from his squad to reach the roof of reactor 3. Assisted in fire extinguishing efforts on the roof of the ventilation block and successfully prevented the fire from spreading to reactor 3. He carried two of his comrades down from the roof, despite being weakened by the radiation himself. Died in Moscow Hospital No.6, 17 days later. Hero of Ukraine with Order of the Gold Star; Cross for Courage; The Soviet Union's Order of the Red Banner. 1100-1300 rem. 1240-1440 rem. Ivanenko, Yekaterina Alexandrovna Иваненко, Екатерина Александровна 1932-09-11, Nezhihov, Gomel, Byelorussian SSR 1986-05-26, Moscow ARS of the 4th degree. Toxicity and respiratory insufficiency. Security guard Guarded a gate opposite to the Block 4, stayed on duty for the entire night until morning, radioactive debris rained down upon her resulting in a fatal dose. Soviet Union's Order of the Red Banner. 730-930 rem. 840-1040 rem. Khodemchuk, Valery Ilyich Ходемчук, Валерий Ильич 1951-03-24, Krapyvnya, Ivankov, Kyiv, Ukrainian SSR 1986-04-26, Chernobyl NPP unknown, likely explosion trauma Senior operator, Main circulating pump, reactor 4 Stationed in the southern main circulating pumps engine room, likely killed immediately; body never found, likely buried under the wreckage of the steam separator drums. Has a memorial sign in the Reactor 4 building. Ukraine's Order For Courage of third degree. Died instantly. Died instantly. Kibenok, Viktor Mykolayovych Кибенок, Виктор Николаевич 1963-02-17, Sirohozskoho, Kherson, Ukrainian SSR 1986-05-11, Moscow ARS of the 4th degree, skin and lung injuries. Firefighter, 6th Paramilitary Fire Department, Pripyat, Kyiv Lieutenant, shift leader from the Pripyat Fire Department. Arrived on scene at 1:35 AM, along with Lieutenant Pravik, coordinated firefighting deployments on the north side of the reactor building. Climbed to the roof of unit 3 at 2:05 AM after Pravik reported over the radio that there had been an explosion in the reactor compartment. He received a fatal dose of radiation whilst assisting and coordinating firefighting efforts on the roofs of the ventilation block and reactor 3. Died two weeks later. Posthumously became a Hero of the Soviet Union. Soviet Union's Hero of the Soviet Union and the Order of Lenin, by decree of the Presidium of the Supreme Soviet of the USSR on September 25, 1986. 820-1020 rem. 900-1100 rem. Konoval, Yuriy Ivanovych Коновал, Юрий Иванович 1942-01-01, Ust-Pier, Altai ASSR 1986-05-28, Moscow ARS of the 4th degree; respiratory insufficiency and cerebral oedema. Electrician Managed machinery and fought fires in the 4th and 5th block receiving a fatal dose in the process. Ukraine's Order For Courage of third degree; Soviet Union's Badge of Honor. 570-770 rem. 670-870 rem. Kudryavtsev, Aleksandr Gennadiyevych Кудрявцев, Александр Геннадиевич 1957-12-11, Kirov, Russian SSR 1986-05-14, Moscow ARS of the 3rd degree; 100% radiation burns. Died from skin injuries and post transfusion shock. Reactor control chief engineer candidate Present in the control room at the moment of explosion; received fatal dose of radiation during attempt to enter the hall to manually lower the control rods and attempting to restart feedwater flow. Ukraine's Order For Courage of third degree. 420-520 rem. 500-600 rem. Kurguz, Anatoly Kharlampiyovych Кургуз, Анатолий Харлампиевич 1957-06-12, Unechskoho, Bryansk, Russian SSR 1986-05-12, Moscow ARS of the 3rd degree. Thermal and radiation burn. Senior reactor operator, central hall Scalded by radioactive steam entering his control room at the epicenter of the explosion, he helped rescue personnel; his colleague, Oleg Genrikh, survived. USSR's Order of Lenin; Ukraine's Cross for Courage. 520-620 rem. 550-650 rem. Lelechenko, Aleksandr Grigoryevich Лелеченко, Александр Григорьевич 1938-07-26, Lubensky, Poltava, Ukrainian SSR 1986-05-06, Kyiv, Ukrainian SSR ARS of the 4th degree; parts of his skin received as much as 500Gy. Skin and intestinal injuries, first to perish due to ARS. Deputy chief of the electrical shop Former Leningrad power plant electrical shop shift leader at the central control room with Kukhar; at the moment of explosion just arrived to the block 4 control room; in order to spare his younger colleagues from radiation exposure, he went through radioactive water and debris three times to switch off the electrolyzers and the feed of hydrogen to the generators, then tried to supply voltage to the feedwater pumps receiving a beyond fatal dose of more than 1,000 rad. USSR's Order of Lenin, the title of Hero of Ukraine on awarding of the Order of the Gold Star; Ukraine's Cross for Courage. 920-1120 rem. 1080-1280 rem. Lopatyuk, Viktor Ivanovich Лопатюк, Виктор Иванович 1960-08-22, Lilov, Kyiv, Ukrainian SSR 1986-05-17, Moscow ARS of the 3rd degree; died from bleeding through mechanical injury during attempted catheterisation. Electrician Received a fatal dose (more than 500 rad) while switching off the electrolyzer. USSR's Order of Lenin; Ukraine's Cross for Courage. 500-600 rem. 590-690 rem. Luzganova, Klavdia Ivanovna Лузганова, Клавдия Ивановна 1927-05-09 1986-07-31, Moscow ARS of the 2nd degree. Last death from ARS 96 days after the accident due to infection, renal-hepatic insufficiency skin injuries and cerebral edema. Security guard Guarded the construction site of the spent fuel storage building about 200 meters from Block 4, where a fuel fragment ejected from the core landed nearby, irradiating her with more than 400 rad. Soviet Union's Order of the Red Banner. 360-460 rem. 440-540 rem. Novyk, Aleksandr Vasylyovych Новик, Александр Васильевич 1961-08-11, Dubrovytsky, Rivne, Ukrainian SSR 1986-07-26, Moscow ARS of the 4th degree; Infection and graft versus host disease. Turbine equipment machinist-inspector Received fatal dose (over ) during firefighting and stabilizing the turbine hall. Irradiated by a piece of fuel lodged on a nearby transformer of the turbo-generator 7 during attempts to call the control room. Ukraine's Order For Courage of third degree 910-1110 rem. 1030-1230 rem. Orlov, Ivan Lukych Орлов, Иван Лукич 1945-01-10 1986-05-13 ARS of the 4th degree. Died from skin and intestinal injuries. Employee of \"Chernobylenergozashita\" Received a fatal dose of more than 1,200 rad from core fragments that landed around the Unit 5 warehouses and construction staging area. 1140-1340 rem. 1280-1480 rem. Perchuk, Kostyantyn Grigorovich Перчук, Константин Григорьевич 1952-11-23, Magadan, Kolyma, Russian SSR 1986-05-20, Moscow ARS of the 4th degree; succumbed to fatal lung injuries. Turbine operator, senior engineer In the turbine hall at the moment of explosion; received fatal dose (over ) during firefighting and stabilizing the turbine hall. Irradiated by a piece of fuel lodged on a nearby transformer of the turbo-generator 7 during manual opening of the turbine emergency oil drain valves. Ukraine's Order For Courage of third degree; 730-930 rem. 830-1030 rem. Perevozchenko, Valery Ivanovich Перевозченко, Валерий Иванович 1947-05-06, Starodub, Bryansk, Russian SSR 1986-06-13, Moscow ARS of the 3rd degree. Infection and graft versus host disease following bone marrow transplant. Foreman, reactor section Received fatal dose of more than 600 rad during attempt to locate and rescue Khodemchuk and others, manually lower the control rods together with Kudryavtsev and Proskuryakov in the reactor hall and attempting to restart feedwater flow to the reactor. Consequently suffering radiation burns on side and back. Made extra efforts to save fellow crew. Ukraine's Order For Courage of third degree. 540-740 rem. 630-830 rem. Popov, Georgi Illiaronovich Попов, Георгий Илларионович 1940-02-21 1986-06-13 ARS of the 3rd degree; lung injuries, respiratory insufficiency and cerebral oedema. Employee of the Kharkiv \"Turboatom\" plant (a NPP subcontractor) Vibration specialist, mobile truck-based laboratory at Turbine 8; assisted in holding the turbine room fires in check where he received a fatal dose (over 500 rad). 530-630 rem. 620-720 rem. Pravyk, Volodymyr Pavlovych Правик, Владимир Павлович 1962-06-13, Chernobyl, Kyiv, Ukrainian SSR 1986-05-11, Moscow ARS of the 4th degree; skin and intestinal injuries. Firefighter, 2nd Militarized Fire Department, Chernobyl NPP Lieutenant, Shift leader of the nuclear plant's fire station. Commanded the first unit to arrive at 1:28. He called a stage 3 alert immediately upon seeing the destroyed reactor building. Held scene command until 2:00 AM. Coordinated firefighting efforts on the roof of the ventilation block, successfully preventing the spread of fire to reactor 3's roof. Likely the first person to look into the reactor core from the roof. Descended from the roof at 2:30 AM but had already received a lethal dose of radiation. Died two weeks later in Moscow Hospital No.6. Posthumously named a Hero of the Soviet Union. He received the highest dose of radiation out of everyone present during disaster. Named a Hero of the Soviet Union with the awarding of the Order of Lenin, by decree of the Presidium of the Supreme Soviet of the USSR on September 25, 1986. 1270-1470 rem. 1420-1620 rem. Proskuryakov, Viktor Vasilyevich Проскуряков, Виктор Васильович 1955-04-09, Svobodnyj, Amur, Russian SSR 1986-05-17, Moscow ARS of the 4th degree; combined 100% radiation burns. Died due to skin injuries (radiation burns). Reactor Control Chief Engineer candidate Present in the control room at the moment of explosion; received fatal dose of radiation (over 600 rad) during attempt to manually lower the control rods and restart feedwater flow, he suffered 100% radiation burns. Ukraine's Order For Courage of third degree; Soviet Union's Order of Courage. 560-660 rem. 650-750 rem. Savenkov, Vladimir Ivanovych Савенков, Владимир Иванович 1958-02-15 1986-05-21 ARS of the 4th degree; Toxicity and respiratory insufficiency. Employee of the Kharkiv \"Turboatom\" plant (a NPP subcontractor) Vibration specialist, mobile truck-based laboratory at Turbine 8 where he received a fatal dose (over 650 rad). First patient admitted to Moscow hospital; case number 1. Buried in Kharkiv in a lead coffin. 610-710 rem. 700-800 rem. Shapovalov, Anatoliy Ivanovych Шаповалов, Анатолий Иванович 1941-04-06, Kirovograd, Ukrainian SSR 1986-05-19, Moscow ARS of the 4th degree, combined skin and lung injuries. Electrician Fought fires and managed electrical equipment where he received more than 1,000 rad. Ukraine's Order For Courage of third degree; USSR's Order of Friendship of Peoples. 820-1020 rem. 970-1170 rem. Shashenok, Vladimir Nikolaevich Шашенок, Владимир Николаевич 1951-04-21, Schucha Dam, Chernihiv, Ukrainian SSR 1986-04-26, Pripyat thermal and radiation burns, trauma Employee of the \"Atomenergonaladka\" (Chernobyl startup and adjustment company, a NPP subcontractor), adjuster of automatic systems Stationed in Room 604, found unconscious and pinned down under a fallen beam, with broken spine, broken ribs, deep thermal and radiation burns. He died in the hospital without regaining consciousness. Ukraine's Order For Courage of third degree; USSR's Order of Courage. Unknown, died of other injuries. Unknown, died of other injuries. Sitnikov, Anatoly Andreyevich Ситников, Анатолий Андреевич 1940-01-20, Voskresenka, Primorye, Russian SSR 1986-05-30, Moscow ARS of the 3rd degree, failed bone marrow transplant resulted in immunosuppression combined with fatal infection. Deputy chief operational engineer, physicist Received fatal dose (over 450 rad) while surveying the damage to Unit 4 and assisting with the coolant supply efforts. USSR's Order of Lenin; Ukraine's Cross for Courage. 390-490 rem. 470-570 rem. Telyatnikov, Leonid Petrovich Телятников, Леонид Петрович 1951-01-25, Vvedenka, Kustanai, Kazakh SSR 2004-12-02, Kyiv died of cancer 18 years after the accident. Suffered ARS of the 2nd degree receiving an estimated dose. Firefighter, 2nd Militarized Fire Department, Chernobyl NPP Major. Commanding officer of the nuclear plant's fire station (ВПЧ-2). He was on vacation at the time of the disaster and arrived at 1:47 AM. Took over scene command from Lieutenant Pravik and began his reconnaissance inside the plant. He held overall scene command until 4 AM, when he could no longer continue due to the onset symptoms of ARS. He received an estimated 450 REM dose, recovered from his treatment, and was named a Hero of the USSR in September 1986. Died from jaw cancer in December 2004. Hero of the Soviet Union with the awarding the Order of Lenin by decree of the Presidium of the Supreme Soviet of the USSR on September 25, 1986; Ukraine's Cross for Courage. Tishura, Vladimir Ivanovych Тишура, Владимир Иванович 1959-12-15, North Station, Leningrad, Russian SSR 1986-05-10, Moscow ARS of the 4th degree; skin and intestinal injuries. Firefighter, 6th Paramilitary Fire Department, Pripyat, Kyiv A fireman from the Pripyat Fire Department (SWPCH-6/ СВПЧ-6). Arrived on scene at 1:35 AM under the command of Lieutenant Viktor Kibenok. Assisted in fire extinguishing efforts on the roof of the ventilation block and successfully prevented the fire from spreading to reactor 3. He was the first to collapse and had to be assisted down from the roof by his comrade Vasily Ignatenko. He died in Moscow Hospital No.6 two weeks later, being the first fireman to die. He was posthumously named a Hero of Ukraine in 2006. Hero of Ukraine on awarding the Order of the Gold Star; Ukraine's Cross for Courage; USSR's Order of Red Banner. 1010-1210 rem. 1140-1340 rem. Titenok, Nikolai Ivanovych Титенок, Николай Иванович 1962-12-05, Vilcha, Kyiv, Ukrainian SSR 1986-05-16, Moscow ARS of the 4th degree, combined with external and internal radiation burns, blistered heart and intestinal damage. Firefighter, 6th Paramilitary Fire Department, Pripyat, Kyiv A fireman from the Pripyat Fire Department (SWPCH-6/ СВПЧ-6). Arrived on scene at 1:35 AM under the command of Lieutenant Viktor Kibenok. Assisted in fire extinguishing efforts on the roof of the ventilation block and successfully prevented the fire from spreading to reactor 3. He was the second fireman in his squad to collapse and had to be assisted down from the roof in his weakened state. He died two weeks later in Moscow Hospital No.6 after receiving an estimated 1300-1500 REM dose. He was the last fireman to die from ARS, and was posthumously named a Hero of Ukraine in 2006. Hero of Ukraine on awarding the Order of the Gold Star; Ukraine's Cross for Courage; USSR's Order of Red Banner. 1150-1350 rem. 1300-1500 rem. Toptunov, Leonid Fedorovych Топтунов, Леонид Федорович 1960-08-16, Mykolaivka, Burinskiy, Sumy, Ukrainian SSR 1986-05-14, Moscow ARS of the 4th degree; skin and intestinal injuries, radiation burns to 90% of his body. Senior reactor control chief engineer In the control room at the reactor control panel at the moment of explosion, with Akimov; received fatal dose of more than 1,000 rad during attempts to restart feedwater flow into the reactor. Ukraine's Order For Courage of the third degree. 900-1,100 rem. 950-1,150 rem. Vashchuk, Nikolai Vasilievich Ващук, Николай Васильевич 1959-06-05, Zhitomir, Ukrainian SSR 1986-05-14, Moscow ARS of the 4th degree; combined skin and intestinal injuries. Firefighter, 6th Paramilitary Fire Department, Pripyat, Kyiv A fireman from the Pripyat Fire Department (SWPCH-6/ СВПЧ-6). Arrived on scene at 1:35 AM under the command of Lieutenant Viktor Kibenok. Assisted in fire extinguishing efforts on the roof of the ventilation block and successfully prevented the fire from spreading to reactor 3. He notably ran hose lines to and from the roof multiple times. He received an estimated 1220 - 1420 REM dose and died two weeks later in Moscow Hospital No.6. He was posthumously named a Hero of Ukraine in 2006. Hero of Ukraine with the Order of the Gold Star. 1080-1280 rem. 1220-1420 rem. Vershynin, Yuriy Anatoliyovych Вершинин, Юрий Анатольевич 1959-05-22, Zuyevskaya, Kirov, Russian SSR 1986-07-21, Moscow ARS of the 4th degree. Developed fatal infections following failed bone marrow transplant. Turbine equipment machinist-inspector In the turbine hall at the moment of explosion; received over dose during firefighting and stabilizing the turbine hall. Irradiated by a piece of fuel lodged on a nearby transformer of the turbogenerator 7 during attempts to call the control room. Ukraine's Order For Courage of third degree; Soviet Union's Order of the Badge of Honor. 650-850 rem. 750-950 rem. ==Notes== ==References==",
 "title": "Deaths due to the Chernobyl disaster"
}