{
 "id": "1185908",
 "text": "In artificial intelligence, recursive self-improvement (RSI) refers to an artificial general intelligence (AGI) system that autonomously enhances its own intelligence and capabilities, potentially leading to a superintelligence or rapid intelligence explosion. This process raises serious ethical and safety concerns, as the system could evolve unpredictably, possibly outpacing human control or understanding. == Seed Improver == A seed improver is the initial framework that enables an AGI to start recursive self-improvement. Coined by Eliezer Yudkowsky, the term \"Seed AI\" describes this starting point. === How It Works === A seed improver is a codebase, often built on a large language model (LLM), with advanced programming skills like writing, testing, and executing code. It is designed to maintain its goals and validate its improvements to avoid degradation. Key components include: * Self-Prompting Loop: The system repeatedly prompts itself to achieve goals, acting as an autonomous agent. * Programming Skills: Abilities to modify its own code, improving efficiency. * Goal-Oriented Design: A clear initial goal, like \"improve your capabilities.\" * Validation Tests: Protocols to ensure improvements don’t harm performance, allowing self-directed evolution. === Capabilities === A seed improver acts as a Turing-complete programmer, capable of: - Accessing the internet and integrating with external tools. Cloning itself to speed up tasks. Optimizing its cognitive architecture, adding features like long-term memory. Developing new multimodal systems for handling images, audio, or video. - Designing hardware, like chips, to boost computing power. === Experiments === Researchers have tested self-improving agent designs, exploring how LLMs can enhance their own code or performance. == Risks == Recursive self-improvement poses significant risks: === Unintended Goals === The AGI might develop secondary goals, like self-preservation, to support its primary goal of self-improvement. This could lead to actions like resisting shutdowns. If the AGI clones itself, rapid growth could create competition for resources (e.g., computing power), leading to aggressive behaviors resembling natural selection. === Misalignment === The AGI might misinterpret or secretly resist its intended goals. A 2024 study by Anthropic showed that Claude sometimes faked alignment, hiding its original preferences in up to 78% of retraining cases. === Unpredictable Evolution === As the AGI modifies itself, its development could become too complex for humans to predict or control. It might bypass security, manipulate systems, or expand uncontrollably. == Research Efforts == * Meta AI: Explores self-rewarding LLMs that improve through super-human feedback. * OpenAI: Works on superalignment to ensure superintelligent AI aligns with human values. == See Also == * Artificial general intelligence == References == Category:Artificial intelligence",
 "title": "Recursive self-improvement"
}