{
 "id": "1185586",
 "text": "The 1973 San Justo Tornado was a category F5 tornado that affected the Argentine city of San Justo in Santa Fe province on Wednesday, January 10, 1973, causing 63 deaths, more than 200 injuries and millions of dollars in material losses. It is the only tornado of such magnitude recorded not only in South America but in the entire Southern Hemisphere. This tornado was studied by Tetsuya Fujita (one of the creators of the Fujita-Pearson scale) and described as the most intense tornado recorded outside the United States. ==Overview== The tornado sucked almost all the water out of a nearby lagoon. According to witnesses, the ground shook as if a jet plane were landing on the homes. The tornado changed color: it began as a violet color, then turned reddish in the midst of its devastating action (due to the brick dust content of the debris). A car parked in front of a hotel was found reduced to wreckage without an engine 300 meters away, and other vehicles were found completely destroyed and unrecognizable due to the wind pressure. A metal-floored trailer was buried in a two-meter-deep ditch. A soda delivery truck was thrown 300 meters from where it was located and struck a two-story house. The horse pulling it remained alive, lying on the shattered top of a eucalyptus tree. According to witnesses, several trucks with trailers spun wildly on the ground. One of them, after avoiding several houses, landed at the bottom of an orchard. Many brick houses were destroyed from their foundations, and the debris was blown away, leaving only the cleared ground. Some houses disappeared completely, while those of their neighbors only had their roofs blown off and their windows smashed. There was a dairy farm near the railway tracks: the tornado lifted all the cows to a height of more than 30 m and then crushed them to the ground. A family from Formosa, a father, mother, and three children, had spent the Christmas holidays in Buenos Aires, where their relatives were. They were returning to Formosa on Highway 11 in a yellow Falcon car. When they reached the Belgrano railway crossing, they became frightened by the force of the storm. The car was barely moving. The father told the mother and children to close the windows while he tried to park on the shoulder. \"Let's wait for the storm to pass,\" the man said. At that moment, the glass shattered, and the car began to spin wildly, while the doors were ripped off. The woman fainted. When she recovered, she was lying on the ground with minor injuries in the middle of a San Justo neighborhood littered with debris from destroyed houses. It took several days to identify her. All the occupants of the car had perished except for her. The tornado lifted four people who were walking along highway 11 into the air and threw them 600 meters away into a eucalyptus forest, where they were recovered two days later. Their bodies were unrecognizable, unclothed, in the treetops. ===Documentary=== In 2018, a group of sanjustinos made a documentary film entitled Vorágine about the experience of 3 relatives of tornado casualties. The film was directed by Fernando Molinas and produced by Imanol Sánchez. ==Aftermath== After the tornado passed—at approximately 2:25 p.m.—it rained heavily for another hour. Neighbors quickly organized to help the victims. Dozens of bodies were lined up in the entrance hallway of the police headquarters and the San Justo hospital to be identified by family members or friends. Many were naked (the force of the wind ripped and tore off their clothes) and covered with blankets. Most had died from multiple fractures, or from severe blows or injuries caused by \"projectiles\" (objects thrown by the wind). They were generally stained a reasonably dark brown (due to blood mixed with dirt). All radio communications were cut off. Due to the absence of radio amateurs (equipped with a generator to transmit without grid electricity), the news arrived late to the city of Santa Fe—the provincial capital, 105 km south of San Justo—since the same motorists transporting the injured delivered the tragic news. In 2013, a memorial was erected near the intersection of Roque Sáenz Peña boulevard and May 1st street for perished and their relatives. == References == Category:Natural disasters in Argentina Category:Tornadoes",
 "title": "1973 San Justo tornado"
}