{
 "id": "1185004",
 "text": "The Grelling–Nelson paradox is a logical paradox, which is a statement that cannot be true or false. The paradox relates to how adjectives work. All adjectives describe something, including the properties of words. Some adjectives' meanings can also describe a property of themselves. For example, the word pentasyllabic is an adjective that means \"having five syllables\", which describes the word pentasyllabic because that word does have five syllables. Adjectives that describe themselves are called autological. Some adjectives' meanings describe something that is the opposite of themselves. For example, the word hyphenated means \"having a hyphen\", but the word hyphenated does not have a hyphen in it. Adjectives that describe the opposite of themselves are called heterological. The Grelling–Nelson paradox comes about when you ask whether the word heterological is autological (meaning it describes itself) or heterological (meaning it describes the opposite of itself). * If it is autological, it describes itself, but since heterological means \"describes the opposite of itself\", that means it is really describing the opposite of itself. This is a contradiction. * If it is heterological, it describes the opposite of itself, but that also means it describes itself because heterological means \"describes the opposite of itself\". That would mean it is autological, so the same contradiction happens again. This means the word heterological can never be heterological or autological. It also means the sentence \"the word heterological is heterological\" can never be true or false. Likewise, the sentence \"the word heterological is autological\" can never be true or false. This is what makes this case a paradox. The Grelling–Nelson paradox is related to Russell's paradox in set theory, which asks if a set made up of other sets that are not members of themselves can be a member of itself. It works like this. Imagine an adjective being a set of everything that can be described by that adjective. For example, you can understand the adjective green as a set made up of every object that is green. If a word is autological and describes itself, that means it is a member of its own set. On the other hand, if a word is heterological, and describes the opposite of itself, that means it is not a member of its own set. In this way, the word heterological can be understood as being the set of all sets that are not members of themselves, so the Grelling–Nelson paradox becomes the same type of problem as Russell's paradox. ==References== * * Category:Logical paradoxes Category:Paradoxes",
 "title": "Grelling–Nelson paradox"
}