{
 "id": "1185612",
 "text": "Bruno Bérard (born October 28, 1958, in Nancy, France) is a French philosopher, essayist, and metaphysician. He holds a doctorate from the École Pratique des Hautes Études in Religions and Thought Systems and has written extensively on metaphysics, Christian mysticism, and the works of philosopher Jean Borella. == Biography == Bérard is the son of André Bérard (also known as Pamphile), a philosopher, poet laureate of the French Academy, and educator noted for introducing yoga to France. His father was associated with figures such as Jean Borella, Lanza del Vasto, and François Chenique. After growing up in Nancy, Bérard moved to Paris, where he attended Lycée Janson-de-Sailly and later graduated with a degree in commercial studies and a certificate in foreign trade from the Académie Commerciale Internationale. He pursued an international career in the aeronautics industry while teaching at business schools, collaborating with France’s Ministry of Industry, and serving as an expert for the National Agency for Research Promotion (ANVAR). He also volunteered to advise entrepreneurs on business development. === Education === Bérard earned a Diplôme Supérieur d’Études Commerciales and a Certificat Spécial de Commerce Extérieur before enrolling at Paris-Sud University in 1999, where he completed a master’s degree in economics with a focus on globalization. On January 16, 2015, he defended his doctoral thesis, titled “Un philosophe et théologien occultisant au XIXe siècle : la vie et l’œuvre de l’abbé Paul François Gaspard Lacuria (1806–1890)” (“A 19th-Century Occult Philosopher and Theologian: The Life and Work of Abbé Paul François Gaspard Lacuria [1806–1890]”), under the supervision of Jean-Pierre Brach at the École Pratique des Hautes Études. === Career === Bérard began studying metaphysics in 1986 and developed an interest in the works of Jean Borella, with whom he later formed a professional relationship. His writings explore metaphysical themes, Christian mysticism, and Borella’s philosophy. Starting in 2018, his works were translated into English and Italian and featured in publications such as the Corriere Metapolitico. === Editorial Work === After publishing his first books with L’Harmattan in 2005 and 2006, Bérard assisted in relocating the Delphica book series (renamed Théôria) to the publisher. At L’Harmattan, he founded the “Métaphysique au quotidien” (“Metaphysics in Daily Life”) series, which included works by authors such as François Chenique, Jean Borella, and Wolfgang Smith. He also contributed to the journal Politica Hermetica and edited several collaborative volumes, including Qu’est-ce que la métaphysique ? (“What Is Metaphysics?”) and Métaphysique des contes de fées (“Metaphysics of Fairy Tales”). == Main publications == === Works === * A Metaphysics of the Christian Mystery. Introduction to Jean Borella’s Work, ed. John Champoux, Tacoma (WA), Angelico Press, 2018. * (fr) Introduction à une métaphysique des mystères chrétiens (en regard des traditions bouddhique, hindoue, islamique, judaïque et taoïste), Paris, L’Harmattan, 2005, imprimatur (Paris) n° 20 (janv. 2003). [Introduction to a Metaphysics of the Christian Mysteries (with regard to the Buddhist, Hindu, Islamic, Judaic and Taoist traditions)] * (fr) Jean Borella : la Révolution métaphysique après Galilée, Kant, Marx, Freud, Derrida, Paris, L’Harmattan, 2006, apostille de Jean Borella (https://en.wikipedia.org/wiki/Jean_Borella). [Jean Borella: The Metaphysical Revolution after Galileo, Kant, Marx, Freud, Derrida] * (fr) Initiation à la métaphysique. Les trois songes, préface de M. Cazenave, Paris, L’Harmattan, 2009. [Initiation to Metaphysics. The three Dreams] * (fr) Collectif, Bruno Bérard dir., Qu’est-ce que la métaphysique ?, Paris, L’Harmattan, 2010. [What is Metaphysics ?] * (fr) Bruno Bérard et Jean Borella, Métaphysique des contes de fées, Paris, L’Harmattan, 2011. [Metaphysics of the Fairy Tales] * (fr) Collectif, Bruno Bérard dir., Métaphysique et psychanalyse, Paris, L’Harmattan, 2013. [Metaphysics and Psychoanalysis] * (fr) Collectif, Bruno Bérard dir., Physique et métaphysique, Paris, L’Harmattan, 2018. [Physics and Metaphysics] * (fr) Métaphysique du paradoxe, t. 1. Paradoxes et limites du savoir, t. 2. La Connaissance paradoxale, Paris, L’Harmattan, 2019. [Metaphysics of paradox, t. 1. Paradoxes and limits of knowledge, t. 2. The paradoxical knowledge] * (fr) Lacuria, un philosophe et théologien occultisant au XIXe s., t. 1 & 2, ART édition, 2020. [Lacuria, a occultist philosopher and theologian in the 19th century] * (it) Introduzione a una metafisica cristiana, Rome, Simmetria, 2021. [Introduction to a Christian Metaphysics] * (fr) Métaphysique du sexe, Paris, L’Harmattan, 2022. [Metaphysics of Sex] * (fr) Bruno Bérard et Annie Cidéron, Métaphysique pour tous, Entretiens avec Bruno Bérard, Paris, L’Harmattan, 2022. [Metaphysics for Everyone] * (fr) La démocratie du futur. Le partage du pouvoir, Paris, L’Harmattan, 2022. [The Democracy of the Future. Power sharing] * (it) Metafisica per tutti, Rome, Simmetria, 2023. [Metaphysics for Everyone] === Articles & lectures === * “Unmasking ‘AI’”, Philos-Sophia.org, 22 février 2018. * (fr) « Jean Borella : distinguer entre intelligence et raison », dans Alain Santacreu (dir.), Au commencement est le cœur, Paris, L’Harmattan, 2010. * (fr) « René Guénon, l’ésotérisme et le christianisme », dans Alain Santacreu (dir.), Au commencement est le cœur, Paris, L’Harmattan, 2010. * (fr) « Faut-il être intelligent pour être sauvé ? », Contrelittérature website, 2010. * (fr) « Retour vers une métaphysique du Beau », dans Alain Santacreu (dir.), Du religieux dans l’art, Paris, L’Harmattan, 2012. * (fr) « Un prêtre indépendant au XIXe siècle : l’abbé Lacuria (1806-1890) », Politica Hermetica n° 30, 2017 (pp. 159 sq). * (fr) Lecture Politica Hermetica : « Un prêtre indépendant au XIXe siècle, l’abbé Lacuria », 10 avril 2015, couvent de l’Annonciation, Paris. * (it) “La metafisica come anti-dogmatismo e non- sistema”, trad. Aldo La Fata, Il Corriere Metapolitico, IIIe année, n°9, déc. 2019. * (it) “Chrono-Sophia, Riflessioni sulla fine dei tempi”, trad. Aldo La Fata, Il Corriere Metapolitico, IVe année, n° 10, avril 2020. * (it) “La Guarigione in due tempi”, trad. Aldo La Fata, Il Corriere Metapolitico, Ve année, n° 13, avril 2021. * (it) “L’ologramma cristologico o il Cristo olagrammatico“, trad. Aldo La Fata, Il Corriere Metapolitico, Ve année, n° 14, septembre 2021. * (fr) « La notion japonaise « Aïda », in Morena Campani, Mieko Matsumoto, À la recherche d’Aïda, Paris, L’Harmattan, 2022. === Forewords === * Jean Borella, Wolfgang Smith, Rediscovering the Integral Cosmos: Physics, Metaphysics, and Vertical Causality, Angelico Press, 2018. * Wolfgang Smith, The Vertical Ascent, from Particles to the Tripartite Universe and Beyond, Angelico Press, 2020. * (fr) Qu’est-ce que la métaphysique ? collectif, Paris, L’Harmattan, 2010 [What is Metaphysics ?] * (fr) Jean Biès, Le soleil se lève à minuit. Initiation aux sagesses du quotidien, Paris, L’Harmattan, 2011 [The Sun rises at Midnight. Initiation to the Wisdoms of everyday Life] * (fr) Métaphysique et psychanalyse, collectif, Paris, L’Harmattan, 2013 [Metaphysics and Psychoanalysis] * (fr) Physique et métaphysique, collectif, Paris, L’Harmattan, 2018 [Physics and Metaphysics] == References == Category:1958 births Category:Living people Category:French philosophers Category:French essayists",
 "title": "Bruno Bérard"
}