{
 "id": "1186311",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = Iranian-American | other_names = | siglum = | citizenship = United States | education = | alma_mater = Vanderbilt University | occupation = | years_active = | era = | employer = | organization = | agent = | known_for = | notable_works = | style = | height = | television = | title = | term = | predecessor = | successor = | party = | otherparty = | movement = | opponents = | boards = | criminal_charges = | criminal_penalty = | criminal_status = | spouse = Leila Hormozi | partner = | children = | parents = | mother = | father = | relatives = | family = | callsign = | awards = | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_type = | signature_size = | signature_alt = | footnotes = }} Alex Hormozi is an Iranian-American entrepreneur, investor, philanthropist, internet personality, author, digital marketer, podcaster, and public speaker who has made investments in the software, service, e-commerce, and brick-and-mortar industries. He is best known as the co-founder and CEO of Acquisition.com, a holding company that oversees a portfolio of Hormozi’s private investment businesses. Hormozi has authored Amazon's best selling book, $100M Offers that offers tips how to take the business to the next level. Hormozi has gained recognition for working closely with individuals and businesses with $3 million in revenue to scale faster. Hormozi is also the founder and CEO of three companies, Gym Launch, a licensing business model; ALAN, a software company; and Prestige Labs, a gym supplement company. He has established himself as an influential figure on Instagram and YouTube for sharing entrepreneurial content videos, which helped him in gaining a following on his social handles. Hormozi is recognized as an acquisition and monetization expert. He is a contributor on Forbes and Entrepreneur magazine, and featured on publications for his work. ==References== Category:Living people Category:Business Category:American businesspeople Category:American Entrepreneur Category:American Investor Category:American writers",
 "title": "Alex Hormozi"
}