{
 "id": "1186448",
 "text": "Hatmehit or Hatmehyt () was an Ancient Egyptian goddess associated with the city in the Nile Delta known as Djedet () or Mendes (). == Etymology == Hatmehit's name is typically translated as \"Foremost of Fish\", literally from the words ḥꜢt \"Chief, head, foremost\" and mḥyt \"fish\" (as a mass noun). However, the word mḥyt in Hatmehit's name does not include the fish determinative, which allows it to have a double meaning. The root of mḥyt is mḥj, which also means \"to flood\". Therefore her name is sometimes considered to mean \"Foremost of the Inundation\", with a connection drawn between the floodwaters and the fish that come with them. == Iconography == In Ancient Egyptian art, Hatmehit was traditionally depicted either as a fish or a woman with a fish emblem or crown on her head. The fish can be directly above her head or presented on a standard, as in the nome symbol of Nome 16 of Lower Egypt. Due to that, it is difficult to distinguish images that depict Hatmehit from that of a female personification of the Mendesian nome. The identification of the fish that is her symbol has been debated, with various researchers identifying it as a dolphin, a lepidotes, or a schilbe. However, the iconography of the creature was consistent, with a relatively small head, prominent dorsal spine, and a long anal fin which extends most of the way down its tail. More recent interpretations of the Mendes fish by the current excavation headed by Donald and Susan Redford describe it as Schilbe mystus. In later periods Hatmehit takes on the iconography of Isis and Hathor, with her fish standard or crown replaced by the horns and sun disk that both shared. == Cult == Hatmehit was part of the Mendesian triad which consisted of her, the god Banebdjedet, and Harpocrates (Horus the child). Her cult was localized mainly to Nome 16 of Lower Egypt around Mendes although there are depictions of her found widely around Egypt. She can be found in the temples at Behbeit El Hagar, Dendera, and Edfu, as well as in tombs in Abusir and Bahariya Oasis. The first evidence of her dates back to the Old Kingdom as part of the titulary of the official Hetepi, who was called \"Inspector of the Estate 'Seat of the Goddess Hatmehit' of the Great phyle\" as well as on the walls of the mortuary complex of Sahure. Due to the identical iconography, Hatmehit may have originated as the tutelary goddess of the city of Mendes and its accompanying nome. Her spheres of influence corresponded with the concerns and lifestyle of those who resided within Mendes. For example, due to Mendes' role as a center for perfume production, Hatmehit gained an association with good scents and perfumery. Some of her epithets included \"Lady of Punt\", \"Lady of myrrh\", and \"She who creates everyone's scent\". The only location of a shrine to Hatmehit discovered thus far in Mendes was one located near an ancient harbor. Several examples of stelae inscribed with fish as well as fish-shaped jars with the remains of juvenile schilbe were found. These represent votive offerings to the goddess, supported by the beer jug and bread molds that were also found in the area. Outside of Mendes, Hatmehit appears as a deity overseeing the day on IV Akhet 22 in Dendera, cited in and II Peret 3 in Edfu., cited in On IV Akhet 28, there is a Procession of Hatmehit recorded in the Cairo Calendar. This is accompanied by instructions to neither eat nor offer fish on that day, due to Hatmehit leaving Mendes in the form of an i͗tn fish. == Connections with other gods == ===Isis=== In earlier periods, Hatmehit was considered her own goddess. However from the Third Intermediate Period onwards, Isis would begin to take the role of Hatmehit in the local cult, with Hatmehit being considered a form of Isis particular to Mendes. This was prompted by the growing association between Banebdjedet and Osiris, with Banebdjedet being considered the ba of Osiris. This is also evidenced by her epithets \"She who looks for (the members of) her brother on the flow\" and \"The excellent Sister of He who wakes healthy (=Osiris)\". The Dendera temple complex contains the most evidence of the connection between Isis and Hatmehit, where Isis is referred to explicitly as Hatmehit on two occasions. The first is on the wall of the mysterious hall in a series of inscriptions about Isis visiting the various nomes. When they get to Nome 16 of Lower Egypt it states: : \"The king of Upper and Lower Egypt, the son of Ra comes to you, Isis the great, the mother of the god, mistress of Iatdi. He brings you to the capital of the Mendesian nome carrying his possessions, it garnishes your chapel, you are Hatmehit, sovereign in Mendes, who seeks (the members of) her brother on the flow.\": \"Le roi de Haute et Basse Ègypte, le files de Rê vient auprès de toi, maîtresse de Iatdi. Il t'amène la capitale du nome mendésien protant ses biens, elle garnit ta chapelle, tu es Hatmehyt, souveraine dans Mendès, qui recherche (les membres de) son frère sur le flot.\" The second was a shorter reference found on the doorjamb to a room called the Birthplace of Isis where as part of her titulary she was called by the name \"Hatmehit, who protects ames-scepter\".: \"Hatmehyt, qui protège le Sceptre-ames\" As the connection between Isis and Hatmehit became stronger, eventually Isis was shown as part of the Mendesian triad without necessarily being explicitly identified as Hatmehit. For example, a stela from Mendes from the reign of Iuput II depicts an offering being given to a triad of Banebdjedet, Isis the Great, and Harpocrates. Another stela depicts Ptolemy II Philadelphus making an offering to the deified Arsinoe II, the ram of Mendes, Banebdjedet the ba of Osiris, and a figure with the inscription Ꜣst-wrt-ḥꜢt-mḥyt \"Isis the Great Hatmehit\"., cited in Isis-Hatmehit remained an important part of life in the Mendesian nome into the Roman period. She featured on several coins from the reign of Trajan and Hadrian, typically wearing the sun disk and horns and holding a small goat or ram representing Banebdjedet. === Hathor === Hatmehit is considered by some Egyptologists to be connected with Hathor. Hathor is one of the oldest deities of Egypt who also went by the name Mehet- Weret, meaning \"great flood\". This may possibly be due to being seen as a remnant of the primal waters of creation from which all things arose. Other goddesses associated with the primal waters of creation are Mut and Naunet. === Nephthys === There is one note of a Nephthys-Hatmehit in a hieratic papyrus Book of Hours., §19,21 Additionally, Herman de Meulenaere argues that due to Hatmehit's epithets describing her as one of the parties who search for the body of Osiris that pointed to a connection with Nephthys as well. == References == == Further reading == * * == External links == * * Hatmehit article from the Iconography of Deities and Demons in the Ancient Near East Category:Egyptian goddesses Category:Fish goddesses Category:Sea and river goddesses Category:Hathor Category:Isis Category:Nile Delta Category:Nephthys",
 "title": "Hatmehit"
}