{
 "id": "1186070",
 "text": "Allison Anne France (née Lawlor; born 13 May 1973) is an Australian politician. She has been serving as the member of parliament (MP) for the Queensland division of Dickson since 2025. She is a member of the Labor Party. France previously ran to represent this division in 2019 and 2022. She lost to the Liberal Party's Peter Dutton both times. She defeated Dutton, the then Leader of the Opposition, on her third attempt in the 2025 Australian federal election. This made her the first Labor MP from Dickson since Cheryl Kernot lost to Dutton in 2001. ==Early life and education== France is the daughter of Peter Lawlor, a former Labor MP. She was born in Durban, South Africa, and educated on the Gold Coast, Toowoomba and Canberra. ==Career== Before she started being a politician, France was a journalist at the Courier Mail} and in Hong Kong. She worked as the communications manager for the indigenous production company Carbon Media in Brisbane. She is also a para-athlete and an advocate for people with disabilities. In 2016, she represented Australia in paracanoeing, winning two team gold medals and a silver medal at the Outrigger Canoe World Sprint Championships. France has criticized offshore detention. France ran as the Australian Labor Party candidate for the seat of Dickson in 2019 and 2022. She lost both times to Peter Dutton, who was first elected as the MP for Dickson in 2001. At the 2025 Australian federal election, she defeated Dutton, the then Leader of the Liberal Party and Leader of the Opposition, and became an MP. France was the first person in Australian history to defeat a Leader of the Opposition at an election. ==Personal life== France and her husband Clive had two sons. They divorced in 2019, and he died from cancer in 2023. In 2011, France and her younger son were at a shopping centre when they were hit by a car. She pushed her son out of the way but was badly hurt. Her leg needed to be amputated because of it. In 2024, her older son died from leukaemia. ==References== Category:1973 births Category:Members of the Australian House of Representatives Category:Australian Labor Party politicians",
 "title": "Ali France"
}