{
 "id": "1186912",
 "text": "The cremasteric artery (Latin: arteria cremasterica, also known as the external spermatic artery) is an artery found in the body of man and woman. It is a branch of the inferior epigastric artery. It has branches of its own. The cremasteric artery branches to supply the cremaster muscle and other coverings of the spermatic cord (in man) or round ligament (in woman). It supplies other anatomical structures in the area as its function as well. It is one of the main three vessels to the testicular blood supply and supplies one third of the total blood to the area (to the epididymis and testis). It supplies less than the testicular artery (which supplies the most - 2/3rds of the total supply) and vasal artery. It enters the inguinal canal with the vasal artery (where it accompanies the spermatic cord and is contained in the external spermatic fascia) through the deep inguinal ring, where it goes along the length of the spermatic cord and testicular artery (also called the internal spermatic artery) in males. The cremasteric artery goes with the cremasteric vein as it travels down near the side of the penis as part of its course. The thickness of the cremaster varies, but it is thickest in men that are young. == Anatomy == === Cremaster muscle & fascia === The cremaster is a muscle in the external spermatic fascia which runs down the spermatic cord in man, or goes with the round ligament in woman. It is an array of loosely fitting fascia. On top of the muscle is another layer called the cremaster fascia. ==== Spermatic fascia ==== Together, with a coating of connective tissue, the cremaster fascia creates an incomplete coating around the spermatic cord. The cremaster muscle, including the cremasteric artery and other vessels, and near related structures like the vas deferens, and the vessels of the deferens, sit inside the external spermatic fascia. It sits outside of the internal spermatic fascia which contains the testicular artery and other internal spermatic veins. === Epigastric artery (inferior) === The inferior epigastric artery branches to the cremasteric artery. The epigastric artery is present in the body of both sexes. The epigastric artery (in woman) goes with the round ligament of the uterus. However it is very small unlike it is in man. A pubic branch near the femoral ring goes down posterior to (below) the pubis and joins (anastomoses) with the pubic branch of the obturator artery. === Testicular artery === The cremasteric artery anastomoses with the testicular artery after supplying blood to the related structures (organs). It drains into the pampiniform plexus, which eventually connects to the testicular vein.https://www.researchgate.net/figure/Anatomy-of-vascular-supply-to-rat- cremaster-muscle-DCIA-deep-circumflex-iliac-artery_fig1_8029144 The cremasteric artery goes with the spermatic cord in males or round ligament of the uterus in females. === Scrotum === In the scrotum, the cremasteric artery is part of an anastomosis between vessels at the tail-end of the epididymis, and the opposite end (the head), as part of a rich vascular anastomosis happening in the area. At the head of the epididymis between the epididymal and testicular arteries, and the opposite end the testicular, epididymal, cremasteric and vasal arteries, the anastomosis occurs. == Related pages == * Cremaster muscle * Epigastric artery (internal spermatic artery) * Vasal artery * Spermatic cord == References == Category:Blood vessels",
 "title": "Cremasteric artery"
}