{
 "id": "1186738",
 "text": "Carmine Biancardi is an Italian author, living in Cap-d'Ail, France. == Early life and Professional Career == He served as a President and Shareholder of Futuraships. Biancardi has spoken at significant conferences such as MARSIM, BBC London, the Yacht Club of Monaco, the United Nations, Seatrade Miami, and RAI TV. He has held positions, including founding, chairing, or serving as president of international organizations like NATO, the United Nations, the U.S. Department of Transportation and Navy, the European Parliament and Commission, and others. === As an author === Title Year Trends in the field of Marine Technology emerging from \"Marine Engineering Seminar\" 1984 On a simplified mathematical model for an onboard manoeuvring simulator and its potential applications to ship control 1988 Privatization: a recent example at the National Maritime Research Center 1988 Computational Hydrodynamics and Ship Manoeuvring Characteristics 1988 Applications of artificial intelligence in the management of marine operations 1988 The piloting advisory system 1990 Practical calculation method of ship manoeuvring characteristics at the design stage 1990 Integrating ship manoeuvrability with safety 1993 Integrating ship maneuverability with safety. Discussion. Authors' closure 1994 Principle of a Set of Maneuvering Indices Based on Sway/Yaw Phase Relations 1995 Relevance of information and communications technologies for shipping (RIACT) 1996 An alternative methodology for calculating ship manoeuvring coefficients at the design stage 1997 Manoeuvering Criteria at the Design Stage 2002 EIRAC: Visions of the intermodal transport: bottlenecks and research needs 2007-2020” 2007 Marine navigation and safety of sea transportation 2009 Modular Technologies for Zero/low Emissions Ferries and Yachts 2012 Test Series Results of Varying Yaw and Roll Angles of Trimaran Amas 2014 == Early life and Education == Biancardi is a visiting professor at the U.S. Merchant Marine Academy's Department of Math and Science in Kings Point, New York, USA, and a Senior Research Specialist at the Istituto Universitario Navale in Naples, Italy. He graduated from the Istituto Universitario Navale in Naples, Italy, with a doctorate in nautical science. == References ==",
 "title": "Carmine Biancardi (author)"
}