{
 "id": "1186928",
 "text": "The Byzantine-Sasanian War of 602-628 was the final conflict between the Roman and Byzantine Empires against the Parthian and Sassanian Empires. == Beginning == Emperor Maurice put Khosrow II on the throne by kicking out his usurper Bahram Chobin. As such, the two become close friends and even ended the Byzantine-Sasanian War of 572-591. Past Byzantine Empires focused on the Persians instead of the Slavs and Avars who were attacking from the North. The empire was still drained from Justinian I's massive invasions and other wars, so Maurice originally planned to leave his soldiers fighting in the Balkans in that region for the winter. He also had to cut the army's pay, which began riots and revolts. A Thracian named Phocas was proclaimed emperor, marched on Constantinople, and killed Maurice, along with his sons. Phocas was terrible at ruling and was among the worst Byzantine emperors of all time. In Carthage, Heraclius the Elder and his son with the same name began a revolt. Heraclius was eventually successful and captured Phocas. He asked Phocas \"Is this how you've governed the empire?\", and Phocas replied with \"And will you rule it any better?\", before Phocas was killed by Heraclius. Heraclius the Elder dies sometime after this, and Heraclius is declared emperor. When Phocas took over, Khosrow wanted revenge for the death of Maurice. == Persian Invasion == === Persian Dominance === With all this chaos going on in Constantinople, Khosrow began his invasion into Eastern territories. They took parts of Armenia. The empire's troops had been being killed during civil war, and Heraclius tried to make peace with the Persians, who rejected this peace. Khosrow sent his general Shahrbaraz to invade Syria. Heraclius gathered his men and marched to Antioch, where he was seriously defeated in the battle. The Persians then plundered the city, killed the Patriarch, and deported its inhabitants. === Jerusalem === After pushing through Syria, the Persians entered the rest of the Levant. They sided with the Jewish citizens and then helped the Persians then captured Jerusalem, and burned The Church of the Holy Sepulchre. They stole the True Cross, Holy Lance, and Holy Sponge. This was very bad for the Christian inhabitants of the Byzantine Empire, and many saw it as God left them. Multiple of them began blaming Jewish people for the disaster. === Egypt === The Sasanians led by Shahrbaraz turned into Egypt and raided it. Khosrow II sent a letter to Heraclius, insulting him, talking about how Caesarea, Jerusalem, and Alexandria, and said said if Jesus didn't save himself from the cross, Heraclius won't save himself. Heraclius watched as the empire was devastated. The Avars and Slavs to the North also began to raid. == Heraclius strikes back == Heraclius decided that instead of surrendering as Khosrow said in his letter, he'd flee to Carthage. However, the Patriarch of Constantinople made Heraclius swear he would not abandon his city. Heraclius first ordered all precious metals be stripped and turned into war loans and told all Christian men it is their duty to fight for God. The Patriarch handed Heraclius as much money as the church could spare, and as many citizen volunteers joined the army. He left Constantinople on April 4th, 622. He met Shahrbaraz in battle and destroyed his army. The Avars and Slavs also fought Heraclius, whom was able to defend. === Return to the East === Heraclius came back to Persia and attacked and took the Persian Armenian capital Dvin. He also defeated the Persians at Ganzaka, and as revenge for Jerusalem, he destroyed the Zoroastrian Fire temple, and then took Gayshawan, one of Khosrow's palaces. Then, Heraclius fought Shahin, a general of Khosrow near Tigranakert and defeated Shahin, Shahrbaraz, and Shahraplakan. Then at Ailovit, Heraclius surprised Shahrbaraz at his camp, and the general fled naked and alone. These victories made Khosrow angry, since he thought Heraclius would surrender to him. He then fought them at the Battle of the Sarus River, and destroyed Shahrbaraz again. === Siege of Constantinople === Khosrow sent messages to the Slavs and Avars asking to both help attack Constantinople. They agreed and the siege began in 626. Since they were on opposite sides of the Bosporus, there were communication issues. The Slavs and Avars were also not used to siege warfare. The siege was directed by a patrician and general named Bonus. The Persians tried to sail, but their ships were destroyed by the ships of Bonus. Shahin eventually died, and the Avars saw it was useless and fled. The Persians also were defeated and ended up losing some of their best troops. Khosrow was furious and sent a message to kill Shahrbaraz, which was intercepted by Heraclius, who showed it to the general, who defected along with the best the Persians had. === Byzantine Dominance === By now, Heraclius had made allies with multiple Turco-Persian peoples. These included the Göktürks (Who would later become the Western Turkic Khaganate), the Khazars, and Ghassanids. The Persians however found themselves short on troops and allies. Their troops were weakened, along with their economy and support for their king. ==== The Final Battle ==== Heraclius and his men were nearing Ctesiphon, so Khosrow sent the Armenian Rhahzadh to defeat Heraclius. The two armies met near Nineveh, and engaged in battle. The troops of Heraclius ran away and then turned around and smashed into the Sasanian troops. In the climax of the battle, Rhahzadh challenged Heraclius to a duel. Heraclius killed Rhahzadh and two other champions. The Persians now leaderless fled. The duel however is disputed among historians. == End of the War == === The Byzantine Empire === The Byzantines plundered another palace of Khosrow, Dastagrid. Heraclius sent Khosrow a letter, and instead of insulting him asked for peace. Khosrow fled however and tried to raise troops to save Ctesiphon. His son, Kavad II, overthrew him, left him in jail for 5 days, and then had him executed either by strangulation or arrows. He made peace with Heraclius, and gave them back lost territory, money, their captured soldiers, and their holy relics. He however did not impose any harsh rules on to Persia. He paraded the True Cross through Constantinople, where he was hailed as \"The New Scipio\". Heraclius would eventually die from illness. === The Sasanian Empire === The Sasanians fell into civil war after civil war. However, in Arabia, a prophet named Muhammad preached a new religion. His followers would take advantage of the weak Persians and quickly defeat them. The Persians who had went through the Achaemenids, Parthians, and Sasanians were now under the Muslims. However, this religion would be the end of the empire Heraclius fought so hard to defend. == Significance == The war ended the 570 year conflict between the two, and began the spread of Islam across the Middle East. Along with ending the Sasanians, it would end Zoroastrianism, as it would be replaced with Islam. The war would also allow the Byzantines to focus up North on the Slavs and Avars raiding their borders. It would also help strengthen the Byzantine army, as they learned Cataphract tactics from the Persians. It also made Heraclius one of the most successful Byzantine Emperors, savior of the empire, and savior of Christianity.",
 "title": "Byzantine–Sasanian War of 602–628"
}