{
 "id": "1186441",
 "text": "Arterial insufficiency ulcers (also known as ischemic ulcers, or ischemic wounds) are ulcers mostly located on the lateral surface of the ankle or the distal digits. They are commonly caused by peripheral artery disease (PAD). ==Characteristics== The ulcer has punched-out appearance. It is intensely painful. It has gray or yellow fibrotic base and undermining skin margins. Pulses are not palpable. Associated skin changes may be observed, such as thin shiny skin and absence of hair. They are most common on distal ends of limbs. A special type of ischemic ulcer developing in duodenum after severe burns is called Curling's ulcer. ==Cause== The ulcers are caused by lack of blood flow to the capillary beds of the lower extremities. Most often endothelial dysfunction is causative factor in diabetic microangiopathy and macroangiopathy. In microangiopathy, neuropathy and autoregulation of capillaries leads to poor perfusion of tissues, especially wound base. When pressure is placed on the skin, the skin is damaged and is unable to be repaired due to the lack of blood perfusing the tissue. The wound has a characteristic deep, punched out look, often extending down to the tendons. The wounds are very painful. ==Diagnosis== The lesion can be easily identified clinically. Arterial doppler and pulse volume recordings are performed for baseline assessment of blood flow. Radiographs may be necessary to rule out osteomyelitis. ===Differential diagnoses=== * Neuropathic ulcer * Gangrene * Infected wound ==Management== The prevalence of arterial insufficiency ulcers among people with Diabetes is high due to decreased blood flow caused by the thinning of arteries and the lack of sensation due to diabetic neuropathy. Prevention is the first step in avoiding the development of an arterial insufficiency ulcer. These steps could include annual podiatry check ups that include, \"assessment of skin, checking of pedal pulses (assessing for blood flow) and assessing physical sensation\".American Diabetes Association. Standards of medical care in diabetes-2011. Diabetes Care. 2011;34(Suppl. 1):S11–S61 The management of arterial insufficiency ulcers depends on the severity of the underlying arterial insufficiency. The affected region can sometimes be revascularized via vascular bypass or angioplasty. If infection is present, appropriate antibiotics are prescribed. When proper blood flow is established, debridement is performed. If the wound is plantar (on walking surface of foot), patient is advised to give rest to foot to avoid enlargement of the ulcer. Proper glycemic control in diabetics is important. Smoking should be avoided to aid wound healing. ==Epidemiology== These ulcers are difficult to heal by basic wound care and require advanced therapy, such as hyperbaric oxygen therapy or bioengineered skin substitutes. If not taken care of in time, there are very high chances that these may become infected and eventually may have to be amputated. Individuals with history of previous ulcerations are 36 times more likely to develop another ulcer. == Related pages == * Peripheral artery disease == References == [[Category:diseases] ]",
 "title": "Arterial insufficiency ulcer"
}