{
 "id": "1186078",
 "text": "Kanyakubja or The Empire of Kanyakubja (or the Imperial Kannauj) was a medieval kingdom in northern India from 510, when it was established as a vassal state of the Gupta Empire, and as an independent sovereign state after 550, until 1036, when it collapsed after Ghaznavid invasions. During the reign of Harsha, and later under the Pratiharas, the Kingdom of Kannauj stood as the most powerful state in India, flourishing in the seventh century, and again in the ninth and tenth centuries. Kannauj became the most important city in North India during this period, and hence was contested by the three great powers of the subcontinent of the period the Gurjara kingdom under the Pratihara dynasty, the Bengal kingdom under the Pala dynasty, and the Rashtrakutas of Manyakheta. Following his victory in 816, the king of the Gurjaras, Nagabhata II declared himself the king of Kannauj. For nearly half a century, between 890 and 944, the kings of Kannauj also bore the imperial title of 'Emperor of Āryāvarta'. However, after this period, the empire began to fragment as its vassals gradually declared their independence, eventually reducing the kingdom to the Doaba region by the late tenth century. Following invasions of the Ghaznavid Empire in the early eleventh century, the kingdom came to an end and the prestige of Kannauj slowly dwindled, and Delhi became the most important city of Hindustan (North India). == Names == The kingdom was also referred to as Middle Country or Middle India during diplomatic exchanges with Tang China,https://journals.du.ac.in/humsoc/pdf/ZHANG%20Harsa.pdf as well as Madhyadesha in Sanskrit within India. Xuanzang also called Harsha's territories as the Five Indias (Five Indies), although it is not known whether this referred to Northern India or the entire subcontinent. == Establishment and early rule == === Harivarman === Gupta emperor Budhagupta met the young Harivarman in 487 AD,. \"They explain that Budhagupta had selected this youth for public service as early as 168 GS (487 CE) if not earlier. This view is largely based on an interpretation of an inscription called the \"Shankarpur charter.\"\" when he was choosing men for his public service. Harivarman, a warrior from Baghelkhand,. \"A section of modern historians conclude that Harivarman was originally from Baghelkhand (in modern Madhya Pradesh)\" had a well-built physique, excellent archery skill, and a fierce face but a great calmness inside, a strict moral code and sensitivity to public sufferings.. \"But as Budhagupta sat down to find out more about this ferocious looking man, he realized that behind this fierce exterior was a calm and composed man who believed in tact as much as in strength. He was a man who had a strong sense of morality. And behind that outer layer of toughness, he was also sensitive to the suffering of others. Like Krishnagupta, Hari had a strong physique and was a master archer himself\" Impressed by him, the emperor gave him the title Maharaja and granted him rule over the regions around Ayodhya, Kannauj and Antarvedi (Ganga-Yamuna Doab.. \"Budhagupta impressed by Harivarman, conferred on him the honorific title of \"Maharaja\" and assigned him the important regions of Ayodhya, Kanyakubja to the east of the river Ganga (in modern Uttar Pradesh) and Antarvedi or the Ganga-Yamuna Doab.\" The nobles and elites of the doab opposed his rule, but he eventually subdued them with military prowess and diplomacy, and soon assumed full control of his assigned provinces. His rule emphasised moral rightness and benevolence and he allied with other prominent families such as the later Guptas.. \"The Disaffected elites and closet enemies to the imperial throne Harivarman tooth and nail. However, the latter showed both diplomatic tact and martial prowess to subdue the trouble makers. Using a combination of his sharp political acumen, amiable personality and fierce martial reputation, Hari managed to quickly outsmart his opponents and assume full control of his assigned provinces.\" === Ishanavarman === His great-grandson, Ishanavarman, (550–560) was the first prominent king of Kannauj. He pursued a policy of aggression against the emperors of Magadha and thus declared his independence, proclaiming himself Maharajadhiraja of Kannauj. He invaded the Andhra country and defeated the king of Andhra, Madhava Varma IV who had conquered and held suzerainty over a large region including modern day western Maharashtra and Karnataka. The Emperor of Magadha, Kumargupta III defeated Ishanavarman in 554 AD, but shortly died thereafter in Prayag. Harivarman's reign was followed by that of Adityavarman and Ishvavarman. === Sharvavarman === Ishvavarman's son, Sharvavarman (560–575) invaded and conquered eastern portion of the Later Gupta dynasty, i.e., Magadha and Bundelkhand from Mahasenagupta who fled to Malwa (the remaining western portion of the empire) and established a rump state. His reign was followed by that of Avantivarman. == Kannauj–Malwa War and Harshavardhan == === Grahavarman === Avantivarman's reign was followed by Grahavarman (r. 600–605) who married Rajyashri, the daughter of Prabhakarvardhana, the King of Thanesar as a part of an alliance. Mahasenagupta's son Devagupta invaded the Kannauj and killed Grahavarman. Rajyavardhan the then king of Kannauj and brother of Rajyashri, defeated Devagupta but was himself killed by the king of Gauda. === Harshavardhan === Following these events, Harshavardhana, the younger brother of the dead king of Thanesar, vowed to avenge the death of his brother and rescue his sister. He repelled the invasion by the king of Gauda and rescued his widowed sister. He was then crowned the Emperor of Kannauj by the nobles of Kannauj in a grand ceremony at Kannauj attended by representatives of multiple principalities and kingdoms of North India. He carried out campaigns in Northern India to bring under his suzerainty the various kingdoms of northern India. He reigned until 647. As per Hsüan Tsang, Harsha divided the income of his kingdom into four — a quarter for government expenses, another for salaries of public servants, a third quarter for the reward of intellectual attainments, and the last quarter for gifts. Although it seems to be very idealistic, but historians argue that there was a decay in urbant centres at that time. == Interwar era == === Arunasva === Harsha's rule was succeeded by that of Arunasva who had previously been the governor of Tirabhukti (modern-day north Bihar). Since Harsha had no heir, Arunasva usurped the throne. Arunavasa repelled an invasion by the Arab Rashidun Caliphate. He had attacked the envoy of the Chinese emperor who had come earlier during the reign of Harsha. === Yashovarman === Arunasva was succeeded by Yashovarman who established the Varman dynasty. Yashovarman led military campaigns in Bengal, Indus Valley, the Deccan and Kashmir. Conflicting records exist regarding his war with Kashmir. Though Kannauj records claim that he was victorious over Kashmir, Kashimri records claim that Yashovarman was defeated by the Kashmir king. He was succeeded by Ama, Dunduka and Bhoja who were weak rulers. == Tripartite Struggle == === Vajrayudha === In 770, Bhoja was deposed by Vajrayudha founding the Ayudha dynasty.Shyam Manohar Mishra (1977). Yaśovarman of Kanauj. Abhinav. pp. 120–121 OCLC 5782454 This destabilised the political climate of eighth century northern India. Much of India at that time was under the rule of three great powers — the Gurjara Empire under the Rajput Pratihara dynasty, the Bengal Empire under the House of Pala, and the Manyakheta empire under a Rashtrakuta branch. The Kingdom of Kannauj constituted a vast prosperous region to the centre of northern India and seeing the instability of the kingdom due to the recent coup, the three powers were hoping to succeed to the throne of Kannauj. === Indrayudha === Indrayudha succeeded to the throne of Kannauj in 770. In 785, Vatsaraja, the Gurjara Emperor invaded Kannauj, made Indrayudha his vassal. Indrayudha continued rule over Kannauj under the suzerainty of the Gurjara emperor. === Chakrayudha === In response to this, Dharmapala, the Emperor of Bengal invaded Kannauj and deposed Indrayudha and replaced him with Indrayudha's brother, Chakrayudha whom he made his vassal at an imperial court at Kannauj attended by the rulers of Bhoja (possibly Vidarbha), Matsya (Jaipur and north-east Rajasthan), Madra (East Punjab), Kuru (Haryana-Delhi-Western UP region), Yadu (possibly Mathura, Dwarka or Siṁhapura in the Punjab (Katas Raj Temples), Yavana, Avanti, Gandhara and Kira (Kangra Valley). This obviously led to war and the Gurjara Empire defeated Bengal and the Gurjara Emperor Vatsaraja occupied Kannauj. Rashtrakuta Emperor Dhruva defeated the Gurjara Empire and Vatsaraja fled his empire, while Dhruva returned to his empire. Bengal re-installed Chakrayudha as the King of Kannauj and its vassal. After the death of Dhruva in 793, the Rashtrakuta Empire fell into a war of succession. In the Gurjara Empire, the son of Vatsaraja, Nagabhata II, seeking revenge and taking advantage of the succession crisis in the Rashtrakuta Empire, invaded Kannauj and defeated Dharmapala and made Chakrayudha his vassal. Before he could invade Bengal however, the new Rashtrakuta Emperor Govinda III invaded Kannauj and defeated the Gurjara armies, and Nagabhatta retreated back to his empire. Dharmapala and Chakrayudha acknowledged Govinda III as their overlords to earn his friendship after which Govinda went back and Kannauj came back under Bengal rule in 800. Kannauj remained a vassal of the Bengal Empire until 816 when the Gurjara Emperor Nagabhata II invaded the Kingdom of Kannauj and conquered it and proclaimed himself as the king of Kannauj after deposing the Ayudhas. == Pratihara rule and decline == === Nagabhata II === Following the deposition of the Ayudhas, and proclamation of Nagabhata II as king of Kannauj, the Pratiharas became the rulers of the Kingdom of Kannauj to which they added their dominions of Gurjaradesa as well. Nagabhata II was succeeded by Ramabhadra (r. 833–836). === Bhoja I === Rambhadra was followed by his son, Bhoja I (r. 836–885), one of the greatest rulers of Kannauj. He invaded the Kingdom of Lata around 840 but failed to conquer it. He led campaigns in other neighbouring regions and was successful in conquering included Travani, Valla, Mada, Arya, Gujarat, and Bundelkhand who acknowledged his suzerainty. He also managed to conquer Lata by the 870s. The territories of Bhoja extended up till Kashmir in the north after Bhoja conquered Punjab by defeating ruling Thakkiyaka dynasty. After Devapala's death, Bhoja defeated the Bengal emperor Narayanapala and expanded his boundaries eastward into Bengal-held territories near Gorakhpur. Bhoja also defeated the Arab invasions from Sindh into Kutch in 838 in the Battle of Sindhan, and conquered a portion of Sindh. His reign was followed by that of his son Mahendrapala I (r. 890–910) who further expanded into the territories of the empire of Bengal. During the reign of Mahipala I (r. 913–944), the Manyakheta Rashtrakutas sacked Kannauj in 916, causing a weakening of the imperial power. This was also the period during which they used the title King of Kings of Aryavarta (ancient name for northern India/Hindustan). === Devapala I === Mahipala was followed his son, Devapala I (r. 944–954), during whose decade-long reign the empire began to crumble away. Simharaja, the King of Sambhar, also declared his independence in 944 (in modern-day Rajasthan). The Kingdom of Bundelkhand under Dhanga declared its independence in 950. Other kingdoms such as that of the Tomaras of Delhi and the Kingdom of Dahala declared their independence during the tenth century as well. This reduced the Kingdom of Kannauj to the Ganga Yamuna Doab region. === Rajyapala === In January 1019, Mahmud of Ghazni reached Kannauj. Surprisingly, Rajyapala, the then king of Kannauj, offered no resistance and fled his capital by crossing the Ganga River, ultimately seeking refuge in Bari. In his absence, Ghaznavid forces ransacked Kannauj, seizing a substantial amount of plunder. Ultimately, Rajyapala, after fleeing to Bari, decided to surrender to Mahmud, acknowledging the nominal suzerainty of the Ghaznavids. The seven forts of Kannauj fell in one day to the Ghaznavids. Following this development, Mahmud engaged in other campaigns within India after successfully asserting control over Kannauj. Rajyapala's surrender to the Ghaznavids had consequences, leading to some turn of events. The Bundelkhand king Vidyadhara, along with his allies, took matters into their own hands and killed Rajyapala. After Rajyapala's demise, his successors persisted in maintaining control over certain territories by relocating their capital to Bari, near Kannauj, until the demise of the last ruler Yasahpala in 1036. == Territorial extent == The Kingdom of Kannauj dominated the upper Gangetic basin and parts of middle Gangetic basin during its early stages. Following the coronation of Harshavardhan, the Kingdom of Thanesar, i.e., eastern Punjab and the Trans-Gangetic Plain was merged into the Kingdom of Kannauj. Harshavardhan's campaigns expanded the empire of Kannauj to include the entirety of the Gangetic plain and eastern Punjab, as well as the Bundelkhand and Malwa. Under the Varmans, the Kingdom of Kannauj lost control over Malwa and later Bengal. Other territories were lost during the Kannauj Wars, and significant power and territory was lost as the kingdom transitioned into a vassal state under Bengal. Under the Pratiharas, the Kingdom of Kannauj transformed once again into a vast realm, even larger than that of Harshavardhana. The empire including its vassals extended from Gujarat to Magadha during its initial rule. Later, it was reduced to a small dominion around the capital city. == List of kings == Royal title Name Dynasty Reign Emperor Narasimhagupta of Magadha appoints Harivarman as the Maharaja of Kannauj Maharaja Harivarman Maukhari 510–? Maharaja Adityavarman Maukhari Maharaja Ishvaravarman Maukhari Maharadhiraja Ishanavarman Maukhari 560–574 Maharadhiraja Sharvavarman Maukhari Maharadhiraja Avantivarman Maukhari 586–600 Maharadhiraja Grahavarman Maukhari 600–605 Grahavarman is killed in war and the King of Thanesar, Harshavardhan is crowned Emperor of Kannauj. Maharadhiraja Harshavardhan Pushyabhuti 606–647 Arunasva usurps the throne after Harsha's death. After Arunasva, Yashovarman establishes Varman rule over Kannauj. Arunasva ? 647–? Yashovarman Varman 725–752 Āma Varman 752–? Dunduka Varman ? Bhoja Varman ?–770 Vajrayudha establishes Ayudha rule over Kannauj after deposing Bhoja. Vajrayudha Ayudha 770–783 Indrayudha Ayudha 783–791 Chakrayudha Ayudha 791–816 Nagabhata conquers Kannauj and deposes the Ayudhas, and declares himself as the emperor of Kannauj. Maharajadhiraja Nagabhata II Pratihara 800–833 Maharajadhiraja Ramabhadra Pratihara 833–836 Maharajadhiraja Mihira Bhoja or Bhoja I Pratihara 836–885 Maharajadhiraja Mahendrapala I Pratihara 885–910 Maharajadhiraja Bhoja II Pratihara 910–913 Maharajadhiraja Mahipala I Pratihara 913–944 Maharajadhiraja Mahendrapala II Pratihara 944–948 Maharajadhiraja Devapala Pratihara 948–954 Maharajadhiraja Vinayakapala Pratihara 954–955 Maharajadhiraja Mahipala II Pratihara 955–956 Maharajadhiraja Vijayapala II Pratihara 956–960 Maharajadhiraja Rajapala Pratihara 960–1018 Maharajadhiraja Trilochanapala Pratihara 1018–1027 Maharajadhiraja Yasahpala Pratihara == References == === Citations === * === References ===",
 "title": "Kanyakubja"
}