{
 "id": "1186442",
 "text": "Standard anatomical terms of location are used to describe unambiguously the anatomy of humans and other animals. The terms, typically derived from Latin or Greek roots, describe something in its standard anatomical position. This position provides a definition of what is at the front (\"anterior\"), behind (\"posterior\") and so on. As part of defining and describing terms, the body is described through the use of anatomical planes and axes. The meaning of terms that are used can change depending on whether a vertebrate is a biped or a quadruped, due to the difference in the neuraxis, or if an invertebrate is a non-bilaterian. A non-bilaterian has no anterior or posterior surface for example but can still have a descriptor used such as proximal or distal in relation to a body part that is nearest to, or furthest from its middle. International organisations have determined vocabularies that are often used as standards for subdisciplines of anatomy. For example, Terminologia Anatomica, Terminologia Neuroanatomica, and Terminologia Embryologica for humans and Nomina Anatomica Veterinaria for animals. These allow parties that use anatomical terms, such as anatomists, veterinarians, and medical doctors, to have a standard set of terms to communicate clearly the position of a structure. ==Introduction== Standard anatomical terms of location have been developed, usually based on Latin and Greek words, to enable all biological and medical scientists, veterinarians, medical doctors and anatomists to precisely delineate and communicate information about animal bodies and their organs, even though the meaning of some of the terms often is context- sensitive. Much of this information has been standardised in internationally agreed vocabularies for humans (Terminologia Anatomica, Terminologia Neuroanatomica, and Terminologia Embryologica), with Nomina Anatomica Veterinaria and Nomina Embryologica Veterinaria used for animal anatomy. Different terms are used for those vertebrates that are bipedal and those that are quadripedal. The reasoning is that the neuraxis, and therefore the standard anatomical position is different between the two groups. Unique terms are also used to describe invertebrates, because of their wider variety of shapes and symmetries. ===Standard anatomical position=== Because animals can change orientation with respect to their environment, and because appendages like limbs and tentacles can change position with respect to the main body, terms to describe position need to refer to an animal when it is in its standard anatomical position, even when its appendages are in another position. This helps to avoid confusion in terminology when referring to the same animal in different postures. In humans, this refers to the body in a standing position with arms at the side and palms facing forward. ===Planes=== Anatomical terms describe structures with relation to four main anatomical planes. Anatomical planes are useful in a number of fields including medical imaging, embryology, and the study of movement. The four main planes are: *The median plane, also called the midsagittal plane, divides the body into left and right parts starting from the sagittal suture. The median plane passes through the head, spinal cord, navel and, in many animals, the tail. *The sagittal planes, also called the parasagittal planes or paramedian planes, are planes that are parallel to the median plane. * The coronal plane, also called the frontal plane, divides the body into front and back parts. * The transverse plane, also called the axial plane or horizontal plane, is perpendicular to the other two planes. In a human, this plane is parallel to the ground; in a quadruped, the coronal plane divides the animal into anterior and posterior sections. Sagittal planes and transverse planes are used as anatomical lines to delineate bodily regions. There are several transverse planes with clinical relevance in the division of the torso into sections. They include the transpyloric plane, the subcostal plane, and the transumbilical plane. ===Axes=== The three axes of a vertebrate, are formed in embryonic development before and during the gastrulation stage. Distinct ends of the embryo are chosen, and the axis is named according to those directions. The three main axes of a bilaterally symmetrical animal that intersect at right angles, are the left-right, the craniocaudal, and the anteroposterior axes. * The left-right axis, also known as the horizontal or frontal axis * The craniocaudal axis, also known as the rostrocaudal, longitudinal or cephalocaudal * The anteroposterior axis, also known as the dorsoventral, or sagittal axis An organism that is round, or asymmetrical may have different axes. ==Related pages== * Chirality ==References== Category:Animal anatomy Category:Medical terminology Category:Orientation (geometry) Category:Position",
 "title": "Distal"
}