{
 "id": "1186467",
 "text": "Luís Filipe Madeira Caeiro Figo (born 4 November 1972) is a Portuguese former professional footballer who played as a winger. Widely regarded as one of the greatest players of his generation, Figo was known for his creativity, dribbling skills, precise passing, and ability to beat defenders. He won numerous major trophies at club level and earned more than 100 caps for the Portugal national team. == Early life and youth career == Luís Figo was born in Almada, Portugal, a suburb of Lisbon. He began playing football at a young age with local side Os Pastilhas before joining the youth academy of Sporting CP, one of Portugal's \"Big Three\" clubs. Figo made his professional debut with Sporting in 1989 at the age of 16. == Club Career == === Sporting CP (1989–1995) === Figo developed rapidly at Sporting CP, becoming one of the most exciting young talents in Portuguese football. His performances attracted interest from several top European clubs. === Barcelona (1995–2000) === In 1995, Figo signed with Spanish giants FC Barcelona. Under Johan Cruyff and later Louis van Gaal, he became a key player in a team that included other stars like Rivaldo and Patrick Kluivert. At Barcelona, Figo won two La Liga titles, two Copa del Rey titles, and the UEFA Cup Winners’ Cup. === Real Madrid (2000–2005) === In a highly controversial move, Figo transferred to Barcelona's arch-rivals Real Madrid in 2000 for a then world-record fee of €62 million. The move made him the first major \"Galáctico\" signing under club president Florentino Pérez. Despite intense backlash from Barcelona fans, Figo succeeded at Madrid, winning two La Liga titles, a UEFA Champions League (2001–02), and the FIFA Intercontinental Cup. === Inter Milan (2005–2009) === Figo joined Inter Milan in 2005, where he finished his career. He won four consecutive Serie A titles with the Italian club and was praised for his professionalism and leadership. Figo retired from professional football in 2009. == International Career == Figo earned 127 caps and scored 32 goals for Portugal between 1991 and 2006. He was part of the \"Golden Generation\" that won the 1991 FIFA World Youth Championship. He represented Portugal at three European Championships (1996, 2000, 2004) and two FIFA World Cups (2002, 2006). He captained Portugal to a runner-up finish at UEFA Euro 2004 and to the semi-finals of the 2006 World Cup. == Playing Style == Figo was known for his exceptional ball control, vision, and crossing ability. He primarily played as a right winger but was also effective on the left or as a central playmaker. He was admired for his elegance on the ball and tactical intelligence. == Post-Retirement == After retiring, Figo became involved in football administration and charity work. He has held ambassadorial roles for various organizations, including UEFA and Inter Milan. In 2015, he ran for the presidency of FIFA but later withdrew from the race. == Personal life == Figo is married to Swedish model Helen Svedin, and they have three daughters. He is also involved in business ventures, including restaurants and sports marketing. == Honors and Achievements == Club: * Barcelona: La Liga (1997–98, 1998–99), Copa del Rey (1996–97, 1997–98), UEFA Cup Winners’ Cup (1996–97) * Real Madrid: La Liga (2000–01, 2002–03), UEFA Champions League (2001–02), Intercontinental Cup (2002) * Inter Milan: Serie A (2005–06, 2006–07, 2007–08, 2008–09) Individual: * Ballon d'Or (2000) * FIFA World Player of the Year (2001) * UEFA Team of the Year (2003) * FIFA 100 (2004, selected by Pelé) \\----",
 "title": "Luis Figo"
}