{
 "id": "1186824",
 "text": "In mathematics, generalization is the idea of taking some of the properties of some physical or mathematical object and examining just those specific properties, without relying on other things about the objects they came from. Generalization is an important mathematical tool because it allows for statements to be made about large groups of mathematical objects at once. Many classes of mathematical objects are defined by having specific properties that generalize the behavior of specific objects. Abstract algebra studies many algebraic structures that generalize properties of important sets like the integers, the real numbers, the 2D plane \\mathbb{R}^2, and the 3D space \\mathbb{R}^3. == Example: Properties of numbers == The simplest case of generalization is talking about numbers themselves instead of numbers of objects. The statement \"four is divisible by two\" is more general than \"if you have four apples, you can give an equal amount of apples to two people\". A property of mathematical objects defines a set or proper class of objects with that property. Generalization allows us to make statements about the whole class that apply to everything in it: \"even numbers are divisible by two\" generalizes the more specific statements \"four is divisible by two\" and \"six is divisible by two\". == Example: Groups == Addition has many important properties on the integers. Group theory looks at four in particular: * Associativity: The sum of three numbers doesn't depend on the order addition is performed: ::2+5+8 = (2+5)+8 = 2+(5+8) = 7+8 = 2+13 = 15 * Additive identity: There is an element, 0, which can be added to any element to get the same element. * Closure: Adding two integers always gives another integer. * Additive inverse: For any integer x, there is another integer -x such that x + -x = 0 A group is any operation over any set that has these same properties. In the notation of group theory, we say that the integers and addition form the group (\\mathbb{Z},+). Any theorem about groups in general applies to addition on the integers specifically. Category:Mathematics",
 "title": "Generalization (mathematics)"
}