{
 "id": "1186161",
 "text": "Brian Joe Lobley Berry (Sedgely, Staffordshire, United Kingdom, February 16, 1934- Dodd City, Texas, January 2, 2025) was a British and American human geographer, and Professor of the University of Texas at Dallas. His studies in the 1960s initiated the scientific revolution in geography that made him the most cited geographer for over 25 years. == Early life and education == Berry was born in Sedgley, Staffordshire, United Kingdom. He graduated from University College London with a B.Sc. in Economics in 1955 and got his postgraduate work at the University of Washington, where he earned an M.A. in 1956 and a PhD in 1958 under the supervision of William Garrison. == Career == After earning his doctorate, Berry was appointed to the University of Chicago, where he became director of the Center for Urban Studies. He held this position until 1976, conducting research on the geography of urban areas and regions and leading the geographic revolution that Garrison had preceded. He was the most cited geographer during the following two decades. From 1976 to 1981, Berry was a professor at Harvard 's Laboratory for Computer Graphics and Spatial Analysis, after which he was appointed dean at Carnegie Mellon University for five years. In 1986, he joined the University of Texas at Dallas as founding dean of the School of Economics, Policy, and Government. Berry was elected to the United States National Academy of Sciences in 1975, and to the American Academy of Arts and Sciences in 1976. He was also a member of the British Academy . In 1988, he won the Victoria Medal of the Royal Geographical Society. In 1999, he was appointed to the Council of the National Academy of Sciences, and in 2004, he became a founding member of the Texas Academy of Medicine, Engineering and Sciences. == Publications == Berry has authored more than 550 books and articles, covering both theory and practice in the development of urban areas and developed and developing regions. == References == Category:Harvard University faculty Category:University of Chicago faculty Category:Alumni of University College London Category:American geographers",
 "title": "Brian Berry"
}