{
 "id": "1186593",
 "text": "Milo Lazarevic (born August 14, 1942) is an American artist known for his sculptures, paintings, and mixed media works. Born in Montenegro, he moved to the United States and became a professor at Columbia University (1973–1978) and Rensselaer Polytechnic Institute(1998–2014). His art is inspired by themes like nature, history, and human existence. == Education == In the 1960s, Lazarevic studied metalwork in Germany before moving to New York City. He earned a master’s degree (1974) and a PhD (1977) from Columbia University, where he later taught art. He became a U.S. citizen in 1974. ==Career== ===Teaching=== Lazarevic taught art at Columbia University from 1973 to 1978. He focused on sculpture, art history, and creative thinking. He also led a study-abroad program in Italy. Later, from 1998 to 2014, he taught at Rensselaer Polytechnic Institute. There, he encouraged students to find their own creative voices through hands-on work. ===Exhibitions=== Lazarevic held his first solo show in New York in 1973. Since then, his art has been shown in many group and solo exhibits in the U.S. and Europe. His work has been written about in newspapers and magazines such as The New York Times, ARTnews, and The Houston Post. ===Sculpture=== His sculptures are made from stone, metal, marble, and wood. He often uses simple, large shapes. His work explores big ideas like time, space, and human life. He tries to keep a close connection with nature and avoids traditional rules in art. Notable sculptures: *Hoodlum (2000) *Equinox (2008) *Pythia (2009) *Contessa (2011) *Appalachian (2016) ===Painting=== Lazarevic’s paintings use strong colors, simple shapes, and symbols like letters and numbers. He removes realistic images and tries to create new ways of seeing the world. His goal is to show a deeper truth through art. Notable paintings: *Crossing the Delaware (2002) *Go-between (2009) *Kamikaze (2015) *Tokyo Eloquence (2015) *Tempest (2018) *Sartre’s Cousin Jules (2018) *Paradox Lost (2019) ===Eclectic works=== In these pieces, Lazarevic reuses old objects, like tools or household items, to make new art. He combines these objects with painted backgrounds. These works mix sculpture and painting and ask people to think about the meaning of everyday things. Notable eclectic works: *Trojan Horse (2005) *Amish Clock (2012) == Awards and Honors == * Pollock-Krasner Award for Sculpture, 1985. * Gottlieb Foundation Award, 1997. == Books == *Intuitive Reality (2021) *Brutalist Sculpture & Dystopia (2022) == Gallery== File:Уметник Мило Лазаревић,02.jpg File:Уметник Мило Лазаревић,03.jpg File:Уметник Мило Лазаревић,04.jpg File:Уметник Мило Лазаревић,05.jpg File:Уметник Мило Лазаревић06.jpg == References == Category:American sculptors Category:Columbia University faculty",
 "title": "Milo Lazarevic"
}