{
 "id": "1186911",
 "text": "The epigastric artery is an artery found in the body of man. It penetrates (or pierces) the transversalis fascia. The fascia separates the epigastric artery and the spermatic cord. It has blood vessels in the lower half (the superficial epigastric vein) which drain the abdomen of blood. Usually it is two veins. They join together and form a single vein which drains in to the external iliac artery near the spermatic cord. The inferior epigastric artery (deep epigastric artery), which starts at the medial (towards the body) part of the external iliac artery, is posterior (behind) the inguinal ligament. ==Inferior epigastric == The inferior epigastric artery gives off (branches to) the cremasteric artery too, and the cremasteric artery also has branches of its own. These are the public branch, and muscular, and cutaneous branches. It supplies cremaster and other coverings of the spermatic cord and other structures, and is joined with the testicular artery. The cremasteric artery (from the inferior epigastric artery) goes with the spermatic cord in males. It is present in females however it is very small. In females it goes with the round ligament. A pubic branch, near the femoral ring, goes down in the body posterior to the pubis and with joins the pubic branch of the obturator artery in both males and females. This helps circulation in the pelvis. Also, the superior and inferior epigastric arteries are important vessels for blood flow, if aortic blood flow is stopped for whatever reason, or when blood supply is low. When this happens it provides blood between the internal thoracic artery and the external iliac artery. Lastly, sometimes the inferior epigastric artery comes up from the femoral artery. It then ascends (goes up) anterior to (in front of) the femoral vein, but then it follows the normal course across the abdomen. In rare cases it comes up from the external iliac artery (in common with an aberrant obturator artery) or from the obturator artery. The aberrant obturator is the public branch of the inferior epigastric artery when it is larger (and supplies more blood) to the area. == Superior epigastric == The superior epigastric artery is the main vascular connection (pedicle) for the rectus abdominis flap, which is myocutaneous or muscle. The superior epigastric artery is located posteriorly (below) it. The rectus abdominis flap is useful in surgery, during reconstruction of the breast, sternal, or chest walls. One type of surgery, similar to TRAM flaps, are the deep inferior epigastric artery perforator (DIEP) flaps, which have also seen a rise in use in surgery. These involve the inferior epigastric artery and is one procedure. Another procedure involves the superior epigastric artery. In women, the abdominal panniculus is excess tissue which sometimes can be used in surgery if it is suitable. In the past, this was done with a pedicle (connection) to the transverse rectus abdominis musculocutaneous (TRAM) flap based on the superior epigastric artery. The surgical procedure involves the skin and fat (lipids) of the lower abdomen, which are attached to the rectus muscle. The skin and fats are transposed into the breast defect, shaped, and become a breast reconstruction in this type of reconstruction. This procedure as well as others involving the epigastric arteries, have been helped along with the progress made in surgery (especially in the microvascular fields). Other surgeries involve muscle-sparing and free-tissue transfers which are enabled by the epigastric artery. A lot of progress has happened in the past 30 years for example. Progress in surgical procedures involving the epigastric arteries (and the superior epigastric artery) have lead to an increase in their popularity and how much they see use. They are muscle-sparing compared to other procedures because they use the dissection (cutting) of blood vessels that are in the rectus abdominis. The cutting is done for the flaps and this is done instead of other procedures, which may require a sacrifice of the rectus abdominis, to reduce donor (getting the structure taken out) morbidity (death), risk of hernia, bulging, and bleeding. This procedure (a pediculed version of it) involves the risk of fat tissue necrosis and abdominal wall weakness. The surgery is helped along with radiology, using CT (computer topography) angiograms (mapping of the vessels), MRI scans and duplex, which helps find the position and level of perforators (piercing into) within the flaps, to improve accuracy. This is thought to improve outcomes of surgery on the epigastric artery. Over the years, it has become more possible to do the procedure with good results. Technology has helped with surgery within the last 30 years too. == Related pages == * Epigastric vein and cremasteric artery * Spermatic cord * Sampson's artery (a branch of the inferior epigastric artery) Category:Blood vessels",
 "title": "Epigastric artery"
}