{
 "id": "1186800",
 "text": "A shelf (plural: shelves) is a flat, horizontal surface used to hold items that are stored or displayed in various environments such as homes, businesses, and stores. Shelves are usually raised off the floor and may be fixed to walls or incorporated into free-standing units. They can be supported using brackets, dowels, nails, or other anchoring hardware, and may also rest on columns or pillars. == Overview == Shelves may be part of larger furniture items such as cabinets, bookcases, or entertainment centers. Alternatively, they can be independent structures, either wall-mounted or free-standing. Most shelving units contain two to six shelves stacked vertically. When shelves are mounted on a wall using concealed brackets, they are referred to as floating shelves. Shelves specifically designed for storing books are called bookshelves. == Materials == * Wood * Metal (such as steel or aluminum) * Glass * Plastic In DIY (do-it-yourself) projects, unconventional materials such as old doors, pencils, books, or even 3D-printed elements may be used. Adjustable shelving systems allow vertical spacing to be changed to accommodate different object heights. == Pipe shelving == Pipe shelving is a modern style of shelving that combines wooden boards with steel gas pipes (black or galvanized). These systems may be wall-mounted or floor-supported using flanges. Though copper pipes are sometimes used for aesthetics, they are not ideal for heavy loads. Pipe shelving is often seen in: * Retail clothing displays * Restaurants and cafes * Industrial-themed homes and offices * Reclaimed architecture projects such as those involving shipping containers == Design and installation == * The width of a shelf should generally not exceed 1.4 times the width of the supporting brackets. * The vertical height of a bracket should be at least 1.2 times the shelf width. * For long shelves, bracket spacing should not exceed four times the shelf's breadth. * For concrete walls, screws should penetrate at least one-tenth the shelf's width. Some modern systems include wall braces that allow bracket attachment without the need for screws. == Uses == * Organizing household items * Displaying decor * Storing products in commercial spaces * Holding books or media * Creating customized furniture solutions == See also == * Bookcase == References == == Other websites == * Shelf definition at Wiktionary * Media related to shelves at Wikimedia Commons",
 "title": "Shelf (storage)"
}