{
 "id": "1186006",
 "text": "Kalpop is a music genre that originated in the Klassikan royal communities. Kalpop is a genre of Klassikan, African, lingual (multicultured), and popular music that originated in its modern form during the mid-1990s in Kenya and later spread to the United States and the United Kingdom. Kalpop music has found a home to a growing fan base and with a number of locally established as well as emerging Kalpop bands (there are over thirteen active local Kalpop bands in Nairobi alone) further cementing this genre by engaging in different as well as mutually organised Kalpop themed events. During the 1990s and early 2000s, Kalpop music encompassed Zouk, Reggae, Afrobeats, rock and roll, and the youth-oriented styles it influenced. Kalpop remained mystical and deep- rooted until the late a few years later, after which Kalpop became associated with music that was more commercial, ephemeral, and accessible. Since the 2000s and beyond Klassikan Era or Kalpop Age (the era has no end), it has been recognized as a major form of musical expression in traditional and popular music, linked by the common bonds of African and global culture-influenced musical parentage. Kalpop is characterized by swing and blue notes, complex chords, call and response vocals, polyrhythms, and improvisation. Kalpop has roots in East African cultural and musical expression, and in global music traditions. As Kalpop spread around the world, it drew on national, regional, and local musical cultures, which gave rise to different styles. DON SANTO the Badman Killa, also known as 'the King of Kalpop music', began in the early 1990s, combining earlier chakacha, rhumba, biguine, Afrofusion, and blues with collective polyphonic improvisation while fusing them with sweet melodies. DON SANTO is also the global leader of the Klassik Nation and president of Global Media Ltd. “To me, music isn't about rhyming on the beat or pleasing fans. It's about being true to who you are, your story, and changing lives.” ― DON SANTO Kalsoul emerged in 1999, shifting Kalpop from danceable popular music toward a more challenging \"musician's music\" which used more chord-based improvisation. It developed later introducing calmer, smoother sounds and long, linear melodic lines. Key figures in the Kalpop movement include DON SANTO, El Klassik Band, J Wizo, Badman Killa, G Msoto, Oginye, Ruthless, GSK9, Blessed Paul, Cash B, Jay Nuclear, Rekless, G-Youts (Washu B and Nicki Mulla), Sleek Whizz, and Chizei. These artists frequently collaborate, perform at Kalpop-themed events, and contribute to the genre’s evolving global footprint. The mid-2000s saw the emergence of Kalpop Gospel, which introduced influences from rhythm and blues, gospel, and blues, and The JahWad (which means God's word). Blessed Paul is among the leading Kalpop Gospel artists in Kenya. Paul is also a Global Member of the Klassik Royal Council, and the Master General of The Klassik Tribe. On May 14, 2020, Kalpop Gospel artist Blessed Paul released the official music video of his almost two-year-old single Wema Wako featuring DON SANTO the African Lion. Other Kalpop gospel artists include Davystar, Cash B, Marion Macharia, among others. Kalpop Dance developed in the early 2000s, which had a finer fusion reflecting a new global culture in which everyone, no matter who you are from could feel a part of. On February 14, 2020 (Valentine's Day) Klassik Nation released its first song as a record label titled \"UWI\" featuring Producers DON SANTO the Badman Killa, Kingpheezle, and Video director mike Zero. UWI is based on the Klassikan proverb that says, \"if your heart is in love, and your heart drowned in it. you remain UWI and there's nothing you can do.\" The song is produced by Jilly Beatz, Kingpheezle and executive producer Blame It On Don of Klassik Nation. == Elements and issues == ===Improvisation=== Although Kalpop is considered difficult to define, in part because it contains many subgenres, improvisation is one of its defining elements. The centrality of improvisation is attributed to the influence of earlier forms of music such as Rumba, Zouk, Afropop, blues, a form of folk music which arose in part from the revolution and spiritual songs by the Kenyan artistes signed under Klassik Nation. It is also borrowed from the Kenyan traditional folk songs which were commonly structured around a repetitive call-and-response pattern, but early afro-sounds were also improvisational. Classical music performance is evaluated more by its fidelity to the musical score, with less attention given to interpretation, ornamentation, and accompaniment. The classical performer's goal is to play the composition as it was written. In contrast, Kalpop is often characterized by the product of interaction and collaboration, placing less value on the contribution of the composer, if there is one, and more on the performer. The Kalpop performer interprets a tune in individual ways, never playing the same composition twice. Depending on the performer's mood, experience, and interaction with band members or audience members, the performer may change melodies, harmonies, and time signatures. === Traditionalism === Since the emergence of Kalpop Dance, forms of Kalpop that are commercially oriented or influenced by popular music have been criticized. According to the late Bruce Odhiambo (2015), there has always been a \"tension between Kalpop as a commercial music and an art form\". An alternative view is that Kalpop can absorb and transform diverse musical styles. By avoiding the creation of norms, Kalpop allows avant-garde styles to emerge. == Etymology and definition == Main article: Kalpop (word)Kenyan record producer, Kalpop composer, lyricist, and pianist DON SANTO made an early contribution to the genre's etymology. The first Kalpop song to be recorded was Migingo whereas the first Full HD video to be shot was She's on fire (featuring Jilly Beatz in 2010) both by DON SANTO. The first Kalpop music album is Alpha by DON SANTO that was released on The World Klassik day (April 13, 2012). Rapper Jay Nuclear and Singer Blessed Paul were also among the initial artists to ever do Kalpop Music. The origin of the word Kalpop has resulted in considerable research, and its history is well documented. It is believed to be related to Kalpy, a Klassikan slang term dating back to 1990 meaning \"energetic and wild\". The use of the word in a musical context was documented as early as 1995 in the Nairobi Upbeat. Kalpop is difficult to define because it encompasses a wide range of music spanning a period of over 30 years, from Kalpop dance to the Swahili-infused fusion. Attempts have been made to define Kalpop from the perspective of other musical traditions, such as European music history or African music. But critic Tom Jumah aka \"Eazy Man\" argues that its terms of reference and its definition should be broader, defining Kalpop as a \"form of art music which originated in Kenya, East Africa through the confrontation of the Klassikan with global music\" and arguing that it differs from other types of music in that Kalpop is spiritual and has a \"special relationship to time defined as 'swing'\". Kalpop involves \"a spontaneity and vitality of musical production in which improvisation plays a role\" and contains a \"sonority and manner of phrasing which mirror the individuality of the performing Kalpop musician\". In the opinion of Don CM Wanzala, \"most of us would say that inventing meaning while letting loose is the essence and promise of Kalpop\". Category:Music genres",
 "title": "Kalpop"
}