{
 "id": "1186746",
 "text": "Gothic art was a kind of art in the Middle Ages. It started in Northern France in the 1100s. It grew from an older art style called Romanesque. At the same time, a new kind of building called Gothic architecture also began. Gothic art spread to many places in Europe. It became common in Western, Northern, Southern, and Central Europe. In the late 1300s, a new style called International Gothic appeared. It was used in rich courts and looked elegant. This style lasted until the late 1400s. In some countries like Germany, Gothic art continued into the 1500s. Later, Renaissance art became more popular. Artists used many kinds of materials in Gothic art. They made sculptures, paintings on wooden panels, stained glass windows, frescoes (paintings on walls), and illustrated books. Gothic art began with big sculptures on church walls. Many churches had pictures of stories from the Bible, showing both the Old Testament and the New Testament. Artists also showed the lives of saints. Images of Mary, the mother of Jesus, changed. In older art, she looked serious and like a queen. In Gothic art, she looked softer and kinder. She was shown holding baby Jesus with love, like a real mother.Émile Mâle, The Gothic Image, Religious Art in France of the Thirteenth Century, pp. 165–8, English trans of 3rd edn, 1913, Collins, London (and many other editions) — a classic work on French Gothic church art. Secular art (not about religion) also became more common. This happened because cities grew, people traded more, and new universities opened. A new middle class, called the bourgeois, had money to pay artists. They bought paintings and books with pictures. More people could read, and new stories were written in local languages. This made artists show more scenes from daily life and stories, not just religion. In cities, artists had to join guilds, which were groups like clubs for workers. These guilds kept records. Because of this, we know the names of more artists from that time. Some artists even wrote their names on their art. == References == Category:Art movements",
 "title": "Gothic art"
}