{
 "id": "1187432",
 "text": "{{Infobox writer | image = Margaret Mahy at the Kaiapoi Club, 27 July 2011, smiling (digitally altered).jpg | image_size = | alt = | caption = Mahy, with her characteristic rainbow wig, at the Kaiapoi Club, July 2011 | name = Margaret Mahy | honorific_suffix = | birth_date = | birth_place = Whakatāne, New Zealand | death_date = | death_place = Christchurch, New Zealand | occupation = Writer, librarian | language = English | genre = Children's picture books, supernatural fiction | subject = | period = 1969–2012 | notableworks = | awards = | influences = | influenced = | website = }} Margaret Mahy (21 March 1936 – 23 July 2012) was a New Zealand author of children's and young adult books. Many of her books have strong supernatural elements. Her books focus on the themes of human relationships and growing up. She wrote more than 100 picture books, 40 novels and 20 collections of short stories. Before she died, she was one of thirty writers to win the biennial, international Hans Christian Andersen Award. \"Hans Christian Andersen Awards\" (top page). International Board on Books for Young People (IBBY). Retrieved 20 August 2012. \"2006\". Hans Christian Andersen Awards. IBBY. With presentation speech by jury president Jeffrey Garrett (21 September 2006) and other contemporary material. Acceptance speeches for 2006 are missing. Retrieved 29 July 2013. Mahy won the annual Carnegie Medal twice. The medal recognises the year's best children's book by a British subject. She won it for both The Haunting (1982) and The Changeover (1984). She was also a runner up for Memory (1987). Her children's books A Lion in the Meadow, The Seven Chinese Brothers and The Man Whose Mother was a Pirate are considered national classics in New Zealand. Her novels have been translated into Te Reo Māori, German, French, Spanish, Dutch, Norwegian, Danish, Swedish, Finnish, Italian, Japanese, Catalan, and Afrikaans. Some of her stories have been translated into Russian, Chinese, and Icelandic. The Margaret Mahy Playground in the Christchurch Central City is named after her. ==References== Category:1936 births Category:2012 deaths Category:New Zealand writers Category:Children's writers",
 "title": "Margaret Mahy"
}