{
 "id": "1187742",
 "text": "Ankit Pathak is an Indian music composer and rapper better known by his stage name Lil RockStar, stylised LiL RockStar. He was formerly a member of the urban music group International Desi'Z, formed by Akki Kalyan. After leaving the group, he signed to perform on Black Tea Production of the Punjabi band Beats Mk (band)|MK. In 2015 he released his debut Single Track Mehnat. After the spilt of Mk, he started working Label Lil RockStar and also started his solo career. He won a IdealCiti Award for Figure Kamaal as the Best Urban Song Of The Year\" in 2017. == EARLY LIFE == Lil RockStar Real Name Is Ankit Pathak Ankit Pathak Was Born On 28 August 2003 In Varanasi to a Pathak Family He Moved To The Delhi With His Family When He Was 4 Year Old... Ankit Pathak Better Known By His Stage Name Lil RockStar Is An Young Indian Rapper, Singer, Lyricist Composer & Director... He Started As A Session And Recording Artist Lil RockStar Started His Career In 14 Year Old As A Rapper. Lil RockStar Was First Introduced In The Song \"Mehnat\" == CAREER == Lil RockStar started his career as a rapper. He began his career with Ashu Chauhan and Akash Kalyan , Himanshu , Shivam Singh ( now known as Akki Kalyan , Desi King , Apple SingH, recording songs and uploading them on social sites. He then started working with Akki Kalyan , Desi King as a part of group highlight Records. Lil RockStar then split from the group when Akki Kalyan became popular. He was supported by his friend Akki Kalyan , Desi King, who introduced him to the Punjabi music band HighLight Records , who then signed him onto their label, GanaPur Records. Soon after the split between the GanaPur Records members, Lil RockStar joined Aakash kalyan (now known as Akki Kalyan), who served as the lead singer for GanaPur Records & highlight Records. Lil RockStar was first introduced in the song \"Mehnat\" With Ashu Chauhan by Akki Kalyan. Later, he starred in the album MehNat and contributed One songs, \"MehNat\", . Lil RockStar released his album Apna Tujhe Banaya With Ashu Chauhan – in 2015. In 2016 he is about to release his mixtape called School Boyz With Lil Apple. He keeps doing live shows and concerts in many states. He has also done live concerts in various colleges of India, such as Rajdhani College Delhi University Lil RockStar's \"Apna Tujhe Banaya\", a record-breaking song, won Best Urban Song. U Turn On IMDb Lil RockStar Age Wiki Family And Cast On Menafn.com https://menafn.com/1102296455/Lil-RockStar-Age-wiki-Family-and-cast Lil RockStar A Popular Music Artist In The World On Menafn.com https://menafn.com/1102307300/Lil-RockStar-A-popular-Music-Artist-In-The-World Lil RockStar Covered Everything In Life As An Actor On Menafn.com https://menafn.com/1102312123/Lil-RockStar-Covered-everything-in-life-as-an- actor Lil RockStar On IMDb == Discography == === Albums === * Illlite (2020) Year Song Artist (s) Produced by Note 2020 Illlite (Intro) Lil RockStar Desi King 2020 Mehnat Lil RockStar Akki Kalyan 2020 Suicide Lil RockStar ft. Lezter Lezter 2020 Yadav Anthem Lil RockStar ft. DESi TEAM & Pasha Bhai Akki Kalyan 2020 Beef Pal Li Lil RockStar Yawar 2020 Bhole Ke Aghori Lil RockStar Black World 2020 Figure Kamaal Lil RockStar ft. Apple Singh Beats MkLil RockStar pays homage to late American singer Justin Bieber in his Chorus 2020 Bholenaath Lil RockStar Beats Mk 2020 School Boyz Lil RockStar ft. Lil Apple Mr. Kz 2020 Lockdown Lil RockStar 27Corazones Beats 2020 Black Out Day Lil RockStar ft. Profetesa Beats Profetesa Beats === Singles and collaborations === Year Track Artist (s) Produced by Note (s) 2016 Apna Tujhe Banaya Lil RockStar 2021 Meri Nature Lil RockStar Saurya Music A collaboration with Saurya India == References == == External links == * * * Category:Living people Category:Indian rappers Category:2003 births",
 "title": "Lil RockStar"
}