{
 "id": "1187543",
 "text": "The femoral sheath is a multi-compartmented funnel-shaped wall of muscle fascia found in the leg. The sheath is in the body of both man and woman, and at birth it is shorter. It becomes longer when the hips start getting used (where they elongate) as habit. It contains the femoral artery and is entered (perforated) by the genitofemoral nerve (at the femoral branch of the nerve) at the lateral sheath wall. The femoral canal allows the femoral vein to distend (swell and become larger). It is wider proximally (towards the body, the opposite of distal). Its tapered distal (going away from the body) end is tapered and as it gets more narrow towards the end it fuses (connects) with the vascular adventitia 3 or 4 cm distal to the inguinal ligament. It is tapered because it gets more narrow towards the ends. The canal is conical in shape and around 1.25 cm in length. Its proximal (wider) end is called the femoral ring. The ring bounded in front by the inguinal ligament, behind by pectineus and its fascia and the pectineal ligament, medially (towards the middle of the body) by the lateral edge of the crescent-shaped lacunar ligament and laterally by the femoral vein. It is made of the transversalis fascia, making the extraperitoneal fascia, which is in the shape of a funnel, longer and distal. The medial wall (going towards the middle of the body) slopes laterally (to one side of the body), is also pierced by lymphatic vessels and the long saphenous vein. Multiple (a lot of) lymph vessels that connect the deep inguinal to the external iliac lymph nodes travel across the femoral septum. It is formed (of transversalis fascia) anterior (in front of) the femoral artery and posterior (behind) the iliac fascia. == Compartments == Like the carotid sheath, the femoral sheath also has to contain a mass of connective tissue. In the tissues the vessels are put in, and embedded so that they are stuck as a part of the mass. The femoral sheath can be split, or separated, into three compartments: * Lateral compartment, for the femoral artery * Intermediate compartment, for the femoral vein * A medial compartment, the femoral canal, contains lymph vessels, and sparsely embedded lymph nodes in areolar tissue == Related pages == * Carotid sheath * Pelvis == References ==",
 "title": "Femoral sheath"
}