{
 "id": "118732",
 "text": "Saturn V was the launch vehicle used by NASA in the Apollo program. The Saturn V carried Apollo 11 to the Moon in 1969, after years of trial, study, and research into its design. Much of the rocket was designed by German engineer and scientist Wernher von Braun, who had previously created the V2 rocket under Nazi Germany. 32 Saturn-model rockets were sent up into space in total, with the launches split between the smaller Saturn I, and its bigger sibling, the Saturn V. 15 Saturn V rockets were made, and 13 were sent up to space for missions. There were two Saturn V's launched with no people in them, used as 'dress rehearsals', with the first manned Apollo flight using a Saturn V being Apollo 8, which was sent around the Moon on December 21, 1968.The Saturn V rocket was a three-part machine. It stood high and weighed . The first rockets were able to carry , which went up to for the later Apollo flights. The first and second stages gave the power needed to lift the rocket off of Earth, intended to break through the atmosphere, so that the weaker third stage could go the rest of the way. The first and second stages each had five engines. The first stage burned kerosene and liquid oxygen together, with the other stages burning a mixture of liquid oxygen and liquid hydrogen. The first stage engines burned for 168 seconds and was able to lift Apollo about off of from the launch pad. The second stage burned for about 8 minutes, in order to take Apollo through the upper atmosphere. By this time, it was traveling at . The third stage was used for 2 minutes and 30 seconds to put Apollo into an Earth orbit. This was at a height of above the Earth. The third stage was started again and burned for 6 minutes to make the speed go up to needed to send Apollo off to the Moon. == Related pages == * Apollo program * NASA == Notes == ==References== ==Other websites== === NASA sites === * Three Saturn Vs on Display Teach Lessons in Space History * Apollo Lunar Surface Journal * Declassified 1964 NASA technical memo on Saturn Rockets Note that this is a large PDF file (61 Megabytes) * Launch complex 39 facility description from 1966 (10 Megabyte PDF file) * Exploring the Unknown Selected Documents in the History of the U.S. Civil Space Program === Other websites === * Apollo Saturn Reference Page * Project Apollo Archive * Apollo/Saturn V Development ApolloTV.net Video * Saturn I-IVB Stage * xkcd:Up Goer Five Category:Apollo program Category:Rockets Category:Wernher von Braun",
 "title": "Saturn V"
}