{
 "id": "1187299",
 "text": "The United States of America (USA) was represented by the United States Olympic & Paralympic Committee (USOPC) in the 2024 Summer Olympics in Paris. This was from July 26 to August 11, 2024. U.S. athletes have been in every modern Summer Olympic Games except for in 1980 edition in Moscow. In 1980, America was part of a 66-nation boycott. They were protesting the Soviet invasion of Afghanistan. The United States marched into the Place du Trocadéro stadium for the parade of nations second-to-last. They were before the French team. They were second-to-last because Los Angeles is hosting the 2028 Summer Olympics. H.E.R. and Tom Cruise, and the Red Hot Chili Peppers, Billie Eilish, Snoop Dogg, and Dr. Dre from Long Beach, was performed during the closing ceremony. LeBron James and Coco Gauff were the opening ceremony flag-bearers for the United States. James also had 2 Olympic gold medals. James was the 1st male basketball player to be the flag bearers. Gauff was 20 years old and was the youngest American athlete and the first tennis player to be a flag-bearer. The closing ceremony flag-bearers were Nick Mead and Katie Ledecky. Mead was part of the U.S. men's four rowing team. This team won America's first gold medal in that event since 1960. Ledecky had won 9 Olympic medals. The United States competed in all sports except handball. They had more female than male athletes for the 4th time in the Summer Olympics (278 men and 314 women). The team won the Olympics for the 4th time in a row and 19th overall time. They had 40 gold, 44 silver, and 42 bronze medals. They had the same number of gold medal as China (40). However, the U.S. won because they had more silver medals (44–27 in silver). This was the first time in the Summer Olympics that the top 2 countries had the same number of gold medals. Americans also won 126 total medals overall. China only won 91. ==Medalists== These U.S. people won medals at this game. The people that won medals are bolded in later sections. |style=\"text-align:left;width:78%;vertical-align:top\"| Medal Name Sport Event Date Hunter Armstrong Caeleb Dressel Chris Guiliano Ryan Held Matt King Swimming Men's 4 × 100 m freestyle relay Fencing Women's foil Swimming Women's 100 m butterfly Jade Carey Jordan Chiles Sunisa Lee Hezly Rivera Gymnastics Women's artistic team all-around Swimming Women's 1500 m freestyle Lee Kiefer Lauren Scruggs Maia Weintraub Fencing Women's team foil Gymnastics Women's artistic individual all-around Liam Corrigan Michael Grady Nick Mead Rowing Men's four Swimming Women's 200 m breaststroke Athletics Men's shot put Gymnastics Women's vault Shooting Men's skeet Swimming Women's 800 m freestyle Nic Fink Torri Huske Ryan Murphy Regan Smith Charlie Swanson Gretchen Walsh Abbey Weitzeil Swimming Mixed 4 × 100 m medley relay Athletics Men's 100 m Cycling Women's individual road race Golf Men's individual Swimming Men's 1500 m freestyle Kate Douglass Torri Huske Lilly King Alex Shackell Regan Smith Gretchen Walsh Emma Weber Swimming Women's 4 × 100 m medley relay Athletics Women's discus throw Surfing Women's shortboard Athletics Men's 1500 m Athletics Women's 200 m Wrestling Women's freestyle 68 kg Athletics Men's 400 m Kristen Faulkner Jennifer Valente Lily Williams Cycling Women's team pursuit Wrestling Women's freestyle 50 kg Athletics Men's 110 m hurdles Athletics Women's 400 m hurdles Athletics Women's long jump Athletics Men's 400 m hurdles Sha'Carri Richardson Twanisha Terry Gabby Thomas Athletics Women's relay Weightlifting Women's 71 kg Rai Benjamin Bryce Deadmon Vernon Norwood Quincy Wilson Athletics Men's 4 × 400 m relay Athletics Women's 100 m hurdles Aaliyah Butler Quanera Hayes Alexis Holmes Shamier Little Sydney McLaughlin-Levrone Gabby Thomas Athletics Women's 4 × 400 m relay Basketball Men's tournament Football Women's tournament Basketball Women's tournament Cycling Women's omnium Kassidy Cook Diving Women's synchronized 3 m springboard Kate Douglass Torri Huske Simone Manuel Gretchen Walsh Abbey Weitzeil Swimming Women's 4 × 100 m freestyle relay Cycling Women's cross-country Fencing Women's foil Swimming Men's 100 m breaststroke Swimming Women's 100 m butterfly Skateboarding Men's street Swimming Women's 400 m individual medley Swimming Men's 800 m freestyle Carson Foster Chris Guiliano Luke Hobson Drew Kibler Blake Pieroni Kieran Smith Swimming Men's 4 × 200 m freestyle relay Swimming Women's 100 m backstroke Cycling Women's BMX freestyle Swimming Women's 100 m freestyle Swimming Women's 200 m butterfly Katie Ledecky Paige Madden Simone Manuel Anna Peplowski Alex Shackell Claire Weinstein Swimming Women's 4 × 200 m freestyle relay Laura Kraut McLain Ward Equestrian Team jumping Shooting Women's 50 m rifle three positions Swimming Women's 200 m backstroke Athletics Men's shot put Athletics Women's 100 m Bryce Deadmon Shamier Little Vernon Norwood Athletics Mixed 4 × 400 m relay Shooting Men's skeet Swimming Women's 200 m individual medley Rajeev Ram Tennis Men's doubles Archery Men's individual Hunter Armstrong Caeleb Dressel Nic Fink Thomas Heilman Ryan Murphy Charlie Swanson Swimming Men's 4 × 100 m medley relay Athletics Men's pole vault Gymnastics Women's floor Austen Smith Shooting Mixed skeet team Morgan Pearson Seth Rider Taylor Spivey Triathlon Mixed relay Athletics Women's hammer throw Jamie Czarkowski Megumi Field Keana Hunter Audrey Kwon Jacklyn Luu Daniella Ramirez Ruby Remati Artistic swimming Team Athletics Women's pole vault Athletics Men's 3000 m steeplechase Skateboarding Men's park Athletics Men's 200 m Athletics Men's 110 m hurdles Athletics Women's 400 m hurdles Wrestling Men's freestyle 57 kg Athletics Men's high jump Canoeing Women's C-1 200 m Sport climbing Women's combined Volleyball Women's tournament Wrestling Women's freestyle 76 kg Cycling Women's road time trial Swimming Women's 400 m freestyle Swimming Men's 400 m individual medley Fencing Men's foil Paul Juda Brody Malone Stephen Nedoroscik Fred Richard Gymnastics Men's artistic team all-around Skateboarding Men's street Swimming Men's 200 m freestyle Swimming Men's 100 m backstroke Swimming Women's 400 m individual medley Rugby sevens Women's tournament Swimming Women's 100 m backstroke Canoeing Women's slalom C-1 Gymnastics Women's artistic individual all-around Casey Kaufhold Archery Mixed team Athletics Men's 10,000 m Hans Henken Sailing 49er Athletics Women's 100 m Athletics Women's triple jump Gymnastics Men's pommel horse Gymnastics Women's vault Peter Chatain Clark Dean Henry Hollingsworth Rielly Milne (c) Evan Olson Pieter Quinton Nicholas Rusher Christian Tabash Rowing Men's eight Swimming Women's 800 m freestyle Tommy Paul Tennis Men's doubles Athletics Men's 100 m Gymnastics Women's uneven bars Shooting Women's skeet Cierra Burdick Dearica Hamby Rhyne Howard Hailey Van Lith Basketball Women's 3x3 tournament Athletics Men's 1500 m Athletics Women's 200 m Boxing Men's welterweight Weightlifting Men's 61 kg Athletics Men's 200 m Athletics Women's long jump Sport climbing Men's speed Taekwondo Women's 67 kg Volleyball Men's tournament Wrestling Men's freestyle 86 kg Wrestling Women's freestyle 57 kg Athletics Men's 5000 m Breaking B-Boys Wrestling Men's freestyle 74 kg Water polo Men's tournament |style=\"text- align:left;width:22%;vertical-align:top\"| Medals by sport Sport Total Athletics 14 11 9 34 Swimming 8 13 7 28 Cycling 3 2 1 6 Gymnastics 3 1 5 9 Wrestling 2 2 3 7 Fencing 2 1 1 4 Basketball 2 0 1 3 Shooting 1 3 1 5 Rowing 1 0 1 2 Weightlifting 1 0 1 2 Football 1 0 0 1 Golf 1 0 0 1 Surfing 1 0 0 1 Skateboarding 0 2 1 3 Archery 0 1 1 2 Canoeing 0 1 1 2 Sport climbing 0 1 1 2 Tennis 0 1 1 2 Volleyball 0 1 1 2 Artistic swimming 0 1 0 1 Diving 0 1 0 1 Equestrian 0 1 0 1 Triathlon 0 1 0 1 Boxing 0 0 1 1 Breaking 0 0 1 1 Rugby sevens 0 0 1 1 Sailing 0 0 1 1 Taekwondo 0 0 1 1 Water polo 0 0 1 1 Total 40 44 42 126 Medals by day Day Date Total 1 July 27 1 2 2 5 2 July 28 2 4 1 7 3 July 29 0 2 6 8 4 July 30 1 3 2 6 5 July 31 1 2 1 4 6 August 1 4 2 1 7 7 August 2 0 3 3 6 8 August 3 5 6 7 18 9 August 4 5 2 3 10 10 August 5 2 4 1 7 11 August 6 3 1 3 7 12 August 7 3 4 1 8 13 August 8 3 3 3 9 14 August 9 3 1 4 8 15 August 10 5 3 3 11 16 August 11 2 2 1 5 Total Total 40 44 42 126 Medals by gender Gender Total Female 26 24 18 68 Male 13 16 23 52 Mixed 1 4 1 6 Total 40 44 42 126 Multiple medalists Name Sport Total Torri Huske Swimming 3 2 0 5 Regan Smith Swimming 2 3 0 5 Simone Biles Gymnastics 3 1 0 4 Kate Douglass Swimming 2 2 0 4 Gretchen Walsh Swimming 2 2 0 4 Katie Ledecky Swimming 2 1 1 4 Gabby Thomas Athletics 3 0 0 3 Caeleb Dressel Swimming 2 1 0 3 Nic Fink Swimming 1 2 0 3 Ryan Murphy Swimming 1 1 1 3 Sunisa Lee Gymnastics 1 0 2 3 Rai Benjamin Athletics 2 0 0 2 Kristen Faulkner Cycling 2 0 0 2 Lee Kiefer Fencing 2 0 0 2 Sydney McLaughlin-Levrone Athletics 2 0 0 2 Jennifer Valente Cycling 2 0 0 2 Jack Alexy Swimming 1 1 0 2 Hunter Armstrong Swimming 1 1 0 2 Kaylyn Brown Athletics 1 1 0 2 Bryce Deadmon Athletics 1 1 0 2 Bobby Finke Swimming 1 1 0 2 Chris Giuliano Swimming 1 1 0 2 Vincent Hancock Shooting 1 1 0 2 Shamier Little Athletics 1 1 0 2 Vernon Norwood Athletics 1 1 0 2 Sha'Carri Richardson Athletics 1 1 0 2 Lauren Scruggs Fencing 1 1 0 2 Alex Shackell Swimming 1 1 0 2 Charlie Swanson Swimming 1 1 0 2 Abbey Weitzeil Swimming 1 1 0 2 Katharine Berkoff Swimming 1 0 1 2 Jade Carey Gymnastics 1 0 1 2 Chloé Dygert Cycling 1 0 1 2 Melissa Jefferson Athletics 1 0 1 2 Noah Lyles Athletics 1 0 1 2 Simone Manuel Swimming 0 2 0 2 Brady Ellison Archery 0 1 1 2 Carson Foster Swimming 0 1 1 2 Luke Hobson Swimming 0 1 1 2 Paige Madden Swimming 0 1 1 2 Austen Smith Shooting 0 1 1 2 Grant Fisher Athletics 0 0 2 2 Jasmine Moore Athletics 0 0 2 2 Stephen Nedoroscik Gymnastics 0 0 2 2 Athletes who participated in the heats only. ==Competitors== On July 10, 2024, the United States Olympic & Paralympic Committee said that there were 592 athletes (314 women and 278 men) that would be in the 2024 Paris Olympics. This is the list of number of competitors in each sport. Sport Men Women Total Archery 1 3 4 Artistic swimming 0 8 8 Athletics 59 61 120 Badminton 3 4 7 Basketball 16 16 32 Boxing 4 4 8 Breaking 2 2 4 Canoeing 3 2 5 Cycling 10 13 23 Diving 5 6 11 Equestrian 6 3 9 Fencing 6 9 15 Field hockey 0 16 16 Football 18 18 36 Golf 4 3 7 Gymnastics 6 7 12 Judo 2 2 4 Modern pentathlon 0 1 1 Rowing 18 24 42 Rugby sevens 12 12 24 Sailing 6 7 13 Shooting 7 9 16 Skateboarding 6 6 12 Sport climbing 4 4 8 Surfing 2 3 5 Swimming 27 21 48 Table tennis 1 3 4 Taekwondo 2 2 4 Tennis 6 5 11 Triathlon 2 3 5 Volleyball 16 16 32 Water polo 12 12 24 Weightlifting 2 3 5 Wrestling 10 6 16 Total 278 314 592 ==Team leaders== Rocky Harris was the chef de mission of the 2024 U.S. Olympic team. Team USA House was at the Palais Brongniart. ==Archery== Four American archers were in the recurve event. They were chosen from their results at 3 different events. These were the 2023 World Championships in Berlin, Germany; 2023 Pan American Games in Santiago, Chile; and 2024 Pan American Championships in Medellín, Colombia. The team had the medalists Brady Ellison and Casey Kaufhold. Athlete Event Ranking round Ranking round Round of 64 Round of 32 Round of 16 Quarterfinals Semifinals Final / Final / Athlete Event Score Seed Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Brady Ellison Men's individual 677 7 W 6–2 W 6–2 W 6–2 W 6–0 W 7–3 L 5–6 Catalina GNoriega Women's individual 648 38 W 6–0 L 5–6 Did not advance Did not advance Did not advance Did not advance Did not advance Casey Kaufhold Women's individual 672 4 W 6–2 L 3–7 Did not advance Did not advance Did not advance Did not advance Did not advance Jennifer Mucino-Fernandez Women's individual 625 57 L 2–6 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Catalina GNoriega Casey Kaufhold Jennifer Mucino-Fernandez Women's team 1945 8 colspan=2 L 1–5 Did not advance Did not advance Did not advance Did not advance Brady Ellison Casey Kaufhold Mixed team 1349 3 Q colspan=2 W 6–0 W 5–3 L 3–5 W 6–2 ==Artistic swimming== The United States had a team of 8 artistic swimmers. They competed in the open team and women's duet events. They were able to compete because they were a top 5 nation at the 2024 World Aquatics Championships in Doha, Qatar. The full team was announced on June 8, 2024. The team also had Anita Alvarez. She had been in the Olympics 3 other times before. Athlete Event Technical routine Technical routine Free routine Free routine Free routine Acrobatic routine Acrobatic routine Acrobatic routine Athlete Event Points Rank Points Total (technical + free) Rank Points Total (technical + free + acrobatic) Rank Jaime Czarkowski Megumi Field Duet 230.7134 11 254.0354 484.7488 10 colspan=3 Anita Alvarez Jaime Czarkowski Megumi Field Keana Hunter Audrey Kwon Jacklyn Luu Daniella Ramirez Ruby Remati Team 282.7567 4 360.2688 643.0255 2 271.3166 914.3421 ==Athletics (track and field)== U.S. track and field athletes qualified to be an Olympian if they had a fast time or high score. They could also compete if they had a high world ranking. The men's head coach was Stanley Redwine. The women's head coach was LaTanya Sheffield. Athletes also had to do well in the 2024 U.S. Olympic Trials on June 21–30, 2024, in Eugene, Oregon. On July 9, 2024, USA Track & Field announced the 120 athletes (59 men and 61 women) that would go to the Olympics. 16-year-old Quincy Wilson was part of the 4x400-meter relay team. He became the youngest male U.S. track athlete in history. Track and road events Men Athlete Event Preliminary Preliminary Heat Heat Repechage Repechage Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Time Rank Time Rank Kenneth Bednarek 100 m colspan=2 9.97 1 Q rowspan=3 colspan=2 9.93 4 q 9.88 7 Fred Kerley 100 m colspan=2 9.97 1 Q 9.84 2 Q 9.81 Noah Lyles 100 m colspan=2 10.04 2 Q 9.83 2 Q 9.79 (.784) Kenneth Bednarek 200 m colspan=2 rowspan=3 19.96 1 Q colspan=2 20.00 1 Q 19.62 Erriyon Knighton 200 m 19.99 1 Q colspan=2 20.09 1 Q 19.99 4 Noah Lyles 200 m 20.19 1 Q colspan=2 20.08 2 Q 19.70 Christopher Bailey 400 m colspan=2 rowspan=3 44.89 2 Q colspan=2 44.31 3 q 44.58 6 Quincy Hall 400 m 44.28 1 Q colspan=2 43.95 1 Q 43.40 Michael Norman 400 m 44.10 1 Q colspan=2 44.26 2 Q 45.62 8 Bryce Hoppel 800 m colspan=2 rowspan=3 1:45.24 2 Q colspan=2 1:43.41 2 Q 1:41.67 4 Hobbs Kessler 800 m 1:46.15 3 Q colspan=2 1:46.20 6 Did not advance Did not advance Brandon Miller 800 m 1:46.34 8 R 1:44.21 1 Q 1:45.79 5 Did not advance Did not advance Cole Hocker 1500 m colspan=2 rowspan=3 3:35.27 2 Q colspan=2 3:32.54 3 Q 3:27.65 OR Hobbs Kessler 1500 m 3:36.87 2 Q colspan=2 3:31.97 2 Q 3:29.45 5 Yared Nuguse 1500 m 3:36.56 5 Q colspan=2 3:31.72 1 Q 3:27.80 Graham Blanks 5000 m colspan=2 rowspan=3 14:09.06 6 Q rowspan=3 colspan=4 13:18.67 9 Grant Fisher 5000 m 13:52.44 4 Q 13:15.13 Abdihamid Nur 5000 m 14:15.00 19 Did not advance Did not advance Grant Fisher 10000 m colspan=8 rowspan=3 26:43.46 Woody Kincaid 10000 m 27:29.40 16 Nico Young 10000 m 26:58.11 12 Freddie Crittenden 110 m hurdles colspan=2 rowspan=3 18.27 8 R 13.42 1 Q 13.23 2 Q 13.32 6 Grant Holloway 110 m hurdles 13.01 1 Q colspan=2 12.98 1 Q 12.99 Daniel Roberts 110 m hurdles 13.43 3 Q colspan=2 13.10 2 Q 13.09 (.085) CJ Allen 400 m hurdles colspan=2 rowspan=3 48.64 2 Q colspan=2 48.44 4 Did not advance Did not advance Trevor Bassitt 400 m hurdles 49.38 5 R 48.64 1 Q 48.29 4 Did not advance Did not advance Rai Benjamin 400 m hurdles 48.82 1 Q colspan=2 47.85 1 Q 46.46 James Corrigan 3000 m steeplechase colspan=2 rowspan=3 8:36.67 10 colspan=4 rowspan=3 Did not advance Did not advance Kenneth Rooks 3000 m steeplechase 8:24.95 2 Q 8:06.41 Matthew Wilkinson 3000 m steeplechase 8:16.82 6 Did not advance Did not advance Kenny Bednarek Christian Coleman Fred Kerley Kyree King Courtney Lindsey 4 × 100 m relay colspan=2 37.47 1 Q colspan=4 Chris Bailey Rai Benjamin Bryce Deadmon Vernon Norwood Quincy Wilson 4 × 400 m relay colspan=2 2:59.15 3 Q colspan=4 2:54.43 Leonard Korir Marathon rowspan=3 colspan=8 2:18:45 63 Conner Mantz Marathon 2:08:12 8 Clayton Young Marathon 2:08:44 9 Source: Women Athlete Event Preliminary Preliminary Heat Heat Repechage Repechage Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Time Rank Time Rank Melissa Jefferson 100 m colspan=2 10.96 2 Q rowspan=3 colspan=2 10.99 1 Q 10.92 Sha'Carri Richardson 100 m colspan=2 10.94 1 Q 10.89 2 Q 10.87 Twanisha Terry 100 m colspan=2 11.15 1 Q 11.07 3 q 10.97 5 Brittany Brown 200 m colspan=2 rowspan=3 22.38 1 Q colspan=2 22.12 1 Q 22.20 McKenzie Long 200 m 22.55 1 Q colspan=2 22.30 3 q 22.42 7 Gabrielle Thomas 200 m 22.20 1 Q colspan=2 21.86 1 Q 21.83 Aaliyah Butler 400 m colspan=2 rowspan=3 50.52 2 Q colspan=2 51.18 6 Did not advance Did not advance Kendall Ellis 400 m 51.16 5 R 50.44 1 Q 50.40 4 Did not advance Did not advance Alexis Holmes 400 m 50.35 2 Q colspan=2 50.00 2 Q 49.77 6 Nia Akins 800 m colspan=2 rowspan=3 1:59.67 2 Q colspan=2 1:58.20 3 Did not advance Did not advance Juliette Whittaker 800 m 2:00.45 3 Q colspan=2 1:57.76 3 q 1:58.50 7 Allie Wilson 800 m 1:59.69 6 R 1:59.73 3 Did not advance Did not advance Did not advance Did not advance Nikki Hiltz 1500 m colspan=2 rowspan=3 4:00.42 3 Q colspan=2 3:56.17 3 Q 3:56.38 7 Emily Mackay 1500 m 3:59.63 6 Q colspan=2 4:02.03 13 Did not advance Did not advance Elle St. Pierre 1500 m 4:03.22 3 Q colspan=2 3:59.74 3 Q 3:57.52 8 Elise Cranny 5000 m colspan=2 rowspan=3 14:58.55 7 Q rowspan=3 colspan=4 14:48.06 10 Whittni Morgan 5000 m 15:02.14 6 Q 14:53.57 13 Karissa Schweizer 5000 m 14:59.64 8 Q 14:45.57 9 Weini Kelati 10000 m colspan=8 rowspan=3 30:49.98 8 Karissa Schweizer 10000 m 30:51.99 9 Parker Valby 10000 m 30:59.28 11 Alaysha Johnson 100 m hurdles colspan=2 rowspan=3 12.61 2 Q colspan=2 12.34 1 Q 12.93 7 Masai Russell 100 m hurdles 12.53 =1 Q colspan=2 12.42 2 Q 12.33 Grace Stark 100 m hurdles 12.72 3 Q colspan=2 12.39 1 Q 12.43 5 Anna Cockrell 400 m hurdles colspan=2 rowspan=3 53.91 1 Q colspan=2 52.90 2 Q 51.87 Jasmine Jones 400 m hurdles 53.60 1 Q colspan=2 53.83 2 Q 52.29 4 Sydney McLaughlin-Levrone 400 m hurdles 53.60 1 Q colspan=2 52.13 1 Q 50.37 WR Valerie Constien 3000 m steeplechase colspan=2 rowspan=3 9:16.33 3 Q rowspan=3 colspan=4 9:34.08 15 Marisa Howard 3000 m steeplechase 9:24.78 7 Did not advance Did not advance Courtney Wayment 3000 m steeplechase 9:10.72 4 Q 9:13.60 12 Melissa Jefferson Sha'Carri Richardson Twanisha Terry Gabrielle Thomas 4 × 100 m relay colspan=2 41.94 1 Q colspan=4 41.78 Kaylyn Brown Aaliyah Butler Quanera Hayes Alexis Holmes Shamier Little Sydney McLaughlin-Levrone Gabrielle Thomas 4 × 400 m relay colspan=2 3:21.44 1 Q colspan=4 3:15.27 AM Dakotah Lindwurm Marathon rowspan=3 colspan=8 2:25:44 12 Fiona O'Keeffe Marathon Emily Sisson Marathon 2:29:53 23 Source: Mixed Athlete Event Heat Heat Final Final Athlete Event Time Rank Time Rank Kaylyn Brown Bryce Deadmon Shamier Little Vernon Norwood 4 × 400 m relay 3:07.41 1 Q 3:07.74 Athletes who participated in the heats only. Field events Men Athlete Event Qualification Qualification Final Final Athlete Event Result Rank Result Rank Malcolm Clemons Long jump 7.72 21 Did not advance Did not advance Jeremiah Davis Long jump 7.83 15 Did not advance Did not advance Jarrion Lawson Long jump Did not advance Did not advance Salif Mane Triple jump 17.16 =3 Q 17.41 6 Russell Robinson Triple jump 16.47 22 Did not advance Did not advance Donald Scott Triple jump 16.77 14 Did not advance Did not advance JuVaughn Harrison High jump 2.20 =19 Did not advance Did not advance Shelby McEwen High jump 2.27 1 q 2.36 Vernon Turner High jump 2.15 28 Did not advance Did not advance Sam Kendricks Pole vault 5.75 8 q 5.95 Chris Nilsen Pole vault 5.40 =26 Did not advance Did not advance Jacob Wooten Pole vault 5.60 22 Did not advance Did not advance Ryan Crouser Shot put 21.49 4 Q 22.90 Joe Kovacs Shot put 21.24 7 q 22.15 Payton Otterdahl Shot put 21.52 3 Q 22.03 4 Joseph Brown Discus throw 61.68 22 Did not advance Did not advance Andrew Evans Discus throw 62.25 17 Did not advance Did not advance Sam Mattis Discus throw 62.66 14 Did not advance Did not advance Curtis Thompson Javelin throw 76.79 27 Did not advance Did not advance Daniel Haugh Hammer throw Did not advance Did not advance Rudy Winkler Hammer throw 77.29 4 Q 77.92 6 Women Athlete Event Qualification Qualification Final Final Athlete Event Distance Position Distance Position Tara Davis-Woodhall Long jump 6.90 1 Q 7.10 Jasmine Moore Long jump 6.66 6 q 6.96 Monae' Nichols Long jump 6.64 8 q 6.67 6 Tori Franklin Triple jump 14.02 14 Did not advance Did not advance Jasmine Moore Triple jump 14.43 3 Q 14.67 Keturah Orji Triple jump 14.09 11 q 14.05 9 Vashti Cunningham High jump 1.92 =12 q 1.95 5 Rachel Glenn High jump 1.88 =15 Did not advance Did not advance Brynn King Pole vault 4.40 =22 Did not advance Did not advance Katie Moon Pole vault 4.55 =1 q 4.85 Bridget Williams Pole vault 4.40 =22 Did not advance Did not advance Chase Jackson Shot put 17.60 17 Did not advance Did not advance Jaida Ross Shot put 18.58 8 q 19.28 4 Raven Saunders Shot put 18.62 7 q 17.79 11 Valarie Allman Discus throw 69.59 1 Q 69.50 Veronica Fraley Discus throw 62.54 13 Did not advance Did not advance Jayden Ulrich Discus throw 61.08 18 Did not advance Did not advance Maggie Malone- Hardin Javelin throw 58.76 24 Did not advance Did not advance Annette Echikunwoke Hammer throw 73.52 4 Q 75.48 DeAnna Price Hammer throw 73.79 3 Q 71.00 11 Erin Reese Hammer throw 70.23 14 Did not advance Did not advance Combined event – Men's decathlon Athlete Event Final Rank Heath Baldwin Result 10.91 7.38 14.48 2.17 49.04 14.04 43.66 4.70 67.59 4:40.67 8422 10 Heath Baldwin Points 881 905 758 963 859 969 739 819 853 676 8422 10 Harrison Williams Result 10.62 7.42 15.66 1.96 46.71 14.28 46.91 5.10 51.17 4:19.58 8538 7 Harrison Williams Points 947 915 830 767 973 939 806 941 606 814 8538 7 Zach Ziemek Result 10.60 6.86 15.03 1.96 50.79 15.11 50.08 5.00 57.05 4:53.17 7983 17 Zach Ziemek Points 952 781 792 767 779 836 872 910 694 600 7983 17 Combined event – Women's heptathlon Athlete Event 200 m 800 m Final Rank Taliyah Brooks Result 13.00 1.77 13.58 24.02 6.15 38.76 2:13.95 6258 11 Taliyah Brooks Points 1124 941 766 979 896 644 908 6258 11 Anna Hall Result 13.36 1.89 14.11 23.89 5.93 45.99 2:04.39 6615 5 Anna Hall Points 1071 1093 801 991 828 783 1048 6615 5 Chari Hawkins Result 13.16 13.64 24.49 5.90 44.30 2:15.76 5255 21 Chari Hawkins Points 1100 0 770 934 819 750 882 5255 21 ==Badminton== The United States had 7 badminton players in the tournament. They could go based on their BWF Race to Paris Rankings. Athlete Event Group stage Group stage Group stage Group stage Group stage Elimination Quarter- final Semi-final Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Opposition Score Rank Howard Shu Men's singles L (14–21, 8–21) L (11–21, 12–21) colspan=2 3 Did not advance Did not advance Did not advance Did not advance Did not advance Vinson Chiu Joshua Yuan Men's doubles L (13–21, 16–21) L (13–21, 14–21) L (11–21, 12–21) L (12–21, 13–21) 5 Did not advance Did not advance Did not advance Did not advance Beiwen Zhang Women's singles W (21–9, 21–4) W (22–20, 22–20) colspan=2 1 Q L (21–12, 9–21, 18–21) Did not advance Did not advance Did not advance Did not advance Annie Xu Kerry Xu Women's doubles L (11–21, 14–21) L (22–24, 21–17, 12–21) L (18–21, 12–21) 4 Did not advance Did not advance Did not advance Did not advance Vinson Chiu Jennie Gai Mixed doubles L (11–21, 14–21) L (15–21, 22–24) L (17–21, 12–21) 4 Did not advance Did not advance Did not advance Did not advance ==Basketball== ===5×5 basketball=== Summary Team Event Group stage Group stage Group stage Group stage Quarterfinal Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States men Men's tournament W 110–84 W 103–86 W 104–83 1 Q W 122–87 W 95–91 W 98–87 United States women Women's tournament W 102–76 W 87–74 W 87–68 1 Q W 88–74 W 85–64 W 67–66 ===3×3 basketball=== Summary Team Event Group stage Group stage Group stage Group stage Group stage Group stage Group stage Group stage Play-in game Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States men Men's tournament L 14–22 L 17–19 L 18–20 L 19–21 W 21–19 W 21–17 L 6–21 7 Did not advance Did not advance Did not advance Did not advance United States women Women's tournament L 13–17 L 17–20 L 15–17 W 17–11 W 14–13 W 18–17 (OT) W 14–12 3 PI W 21–13 L 16–18 (OT) Bronze medal final W 16–13 ==Boxing== The U.S. had 8 boxers in the tournament. A boxer could qualify by going to the 2023 Pan American Games, the 2024 World Olympic Qualification Tournament 1, or at the 2024 World Olympic Qualification Tournament 2 in Bangkok, Thailand. American athletes would compete in 8 of the 13 weight classes. Men Athlete Event Round of 32 Round of 16 Quarterfinals Semifinals Final Final Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Roscoe Hill Flyweight W 5–0 L 2–3 Did not advance Did not advance Did not advance Did not advance Jahmal Harvey Featherweight W 3–2 L 2–3 Did not advance Did not advance Did not advance Omari Jones Welterweight W 5–0 W 5–0 L 2–3 Did not advance Joshua Edwards Super heavyweight L 1–3 Did not advance Did not advance Did not advance Did not advance Women Athlete Event Round of 32 Round of 16 Quarterfinals Semifinals Final Final Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Jennifer Lozano Flyweight L 0–5 Did not advance Did not advance Did not advance Did not advance Alyssa Mendoza Featherweight W 3–2 L 1–4 Did not advance Did not advance Did not advance Did not advance Jajaira Gonzalez Lightweight W 4–0 L 0–5 Did not advance Did not advance Did not advance Did not advance Morelle McCane Welterweight L 2–3 Did not advance Did not advance Did not advance Did not advance ==Breaking== The United States had 4 breakdancers in the Paris Olympics. Victor Montalvo (Victor) joined the team in the B-Boy category from winning the 2023 World Championships in Leuven, Belgium. Sunny Choi (Sunny) joined the team in the B-Girl category from winning the 2023 Pan American Games in Santiago, Chile.Jeffrey Louis (Jeffro) and Logan Elanna Edra (Logistx) joined the team from the 2024 Olympic Qualifier Series in Shanghai, China and Budapest, Hungary. Athlete Nickname Event Pre-qualification Round robin Round robin Round robin Round robin Quarterfinal Semifinal Final / Final / Athlete Nickname Event Opposition Result Opposition Result Opposition Result Opposition Result Rank Opposition Result Opposition Result Opposition Result Rank Jeffrey Louis Jeffro B-Boys rowspan=2 W 2–0 W 2–0 T 1–1 1 Q L 1–2 Did not advance Did not advance Did not advance Victor Montalvo Victor B-Boys T 1–1 W 2–0 W 2–0 1 Q W 3–0 L 1–2 Bronze medal match W 3–0 Sunny Choi Sunny B-Girls L 0–2 L 0–2 W 2–0 3 Did not advance Did not advance Did not advance Did not advance Logan Edra Logistx B-Girls W 2–0 L 0–2 T 1–1 3 Did not advance Did not advance Did not advance Did not advance ==Canoeing== ===Slalom=== The United States had 2 boats in the slalom competition from the 2023 ICF Canoe Slalom World Championships in London, Great Britain. Evy Leibfarth was the first American woman to be in 3 paddling events in the Olympics. Athlete Event Preliminary Preliminary Preliminary Preliminary Preliminary Preliminary Semifinal Semifinal Final Final Athlete Event Run 1 Rank Run 2 Rank Best Rank Time Rank Time Rank Casey Eichfeld Men's C-1 99.84 14 94.69 4 94.69 10 Q 162.23 16 Did not advance Did not advance Evy Leibfarth Women's C-1 108.82 9 107.09 8 107.09 11 Q 117.58 12 Q 109.95 Evy Leibfarth Women's K-1 97.24 8 93.84 4 93.84 4 Q 109.54 15 Did not advance Did not advance Kayak cross Athlete Event Time trial Time trial Round 1 Repechage Heat Quarterfinal Semifinal Final Final Athlete Event Time Rank Position Position Position Position Position Position Rank Casey Eichfeld Men's KX-1 81.13 33 3 R 3 Did not advance Did not advance Did not advance Did not advance 37 Evy Leibfarth Women's KX-1 72.66 6 1 Q 1 Q 3 Did not advance Did not advance 10 ===Sprint=== U.S. canoeists had one boat in 3 events. They qualified from the 2023 ICF Canoe Sprint World Championships in Duisburg, Germany, and the 2024 Pan American Canoe Sprint Olympic Qualifiers in Sarasota. On March 22, 2024, 2020 Nevin Harrison became the first American to qualify for the Paris Games in any canoe or kayak event. Athlete Event Heats Heats Quarterfinals Quarterfinals Semifinals Semifinals Final Final Athlete Event Time Rank Time Rank Time Rank Time Rank Jonas Ecker Men's K-1 1000 m 3:37.21 3 QF 3:41.77 5 Did not advance Did not advance Did not advance Did not advance Aaron Small Men's K-1 1000 m 3:40.87 6 QF 3:42.05 5 Did not advance Did not advance Did not advance Did not advance Jonas Ecker Aaron Small Men's K-2 500 m 1:32.01 5 QF 1:28.93 3 SF 1:29.51 4 FA 1:30.02 8 Nevin Harrison Women's C-1 200 m 45.70 1 SF colspan=2 45.30 2 FA 44.13 Qualification Legend: FA - Qualify to final (medal); FB - Qualify to final B (non-medal); SF - Qualify to semifinal; QF - Qualify to quarterfinal ==Cycling== ===Road=== The United States had a team of 6 road cyclists from the UCI Nation Ranking and 2023 World Championships in Glasgow, Scotland, United Kingdom. Men Athlete Event Time Rank Matteo Jorgenson Road race 6:20:50 9 Brandon McNulty Road race 6:21:54 24 Magnus Sheffield Road race 6:26:57 42 Brandon McNulty Time trial 37:16.60 5 Magnus Sheffield Time trial 38:05.24 16 Women Athlete Event Time Rank Chloé Dygert Road race 4:03:03 15 Kristen Faulkner Road race 3:59:23 Chloé Dygert Time trial 41:10.70 Taylor Knibb Time trial 43:03.46 19 ===Track=== The United States had 6 track athletes from the 2022–2024 UCI Track Olympic Ranking. Pursuit Athlete Event Qualification Qualification Semifinal Final / / Final / / Athlete Event Time Rank Opponent Results Opponent Results Rank Chloé Dygert Kristen Faulkner Jennifer Valente Lily Williams Women's team pursuit 4:05.238 2 Q W 4:04.629–4:04.908 FA W 4:04.306–4:04.927 Qualification legend: Q - Qualify to semifinal for gold medal; q - Qualify to classification semifinal; FA - Gold medal final; FB - Bronze medal final; FC - Fifth place final; FD - Seventh place final Omnium Athlete Event Scratch race Scratch race Tempo race Tempo race Tempo race Elimination race Elimination race Points race Points race Total Total Athlete Event Rank Points Rank OP Rank OP Points Rank OP Rank Grant Koontz Men's omnium 15 12 21 9 24 18 6 0 6 42 16 Jennifer Valente Women's omnium 1 40 9 2 38 1 40 26 18 144 Madison Athlete Event Points Rank Jennifer Valente Lily Williams Women's madison 18 4 ===Mountain biking=== U.S. mountain bikers had 4 athletes. Athlete Event Time Rank Riley Amos Men's cross-country 1:28:08 7 Christopher Blevins Men's cross-country 1:29:06 13 Haley Batten Women's cross-country 1:28:59 Savilia Blunk Women's cross-country 1:31:52 12 ===BMX=== Freestyle The United States had 4 athletes. American athletes could be in this event if they were in the top six at the 2024 Olympic Qualifier Series. Athlete Event Seeding Seeding Final Final Athlete Event Points Rank Points Rank Marcus Christopher Men's 89.48 2 Q 93.11 4 Justin Dowell Men's 89.07 4 Q 88.35 7 Perris Benegas Women's 85.44 4 Q 90.70 Hannah Roberts Women's 91.45 1 Q 70.00 8 Race Athlete Event Quarterfinal Quarterfinal Semifinal Semifinal Final Final Athlete Event Points Rank Time Rank Points Rank Result Rank Kamren Larsen Men's 7 4 Q colspan=2 19 14 Did not advance Did not advance Cameron Wood Men's 7 5 Q colspan=2 11 7 Q 32.446 5 Felicia Stancil Women's 20 22 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Daleny Vaughn Women's 8 7 Q colspan=2 16 11 Did not advance Did not advance Alise Willoughby Women's 3 3 Q colspan=2 11 5 Q 36.171 6 ==Diving== Men Athlete Event Preliminary Preliminary Semifinal Semifinal Final Final Athlete Event Points Rank Points Rank Points Rank Andrew Capobianco 3 m springboard 382.05 15 Q 407.65 15 Did not advance Did not advance Carson Tyler 3 m springboard 389.80 10 Q 438.00 7 Q 429.25 4 Brandon Loschiavo 10 m platform 393.65 13 Q 372.45 17 Did not advance Did not advance Carson Tyler 10 m platform 363.75 19 Did not advance Did not advance Did not advance Did not advance Tyler Downs Greg Duncan 3 m synchronized springboard colspan=4 346.08 8 Women Athlete Event Preliminary Preliminary Semifinal Semifinal Final Final Athlete Event Points Rank Points Rank Points Rank Sarah Bacon 3 m springboard 264.40 19 Did not advance Did not advance Did not advance Did not advance Alison Gibson 3 m springboard 198.30 28 Did not advance Did not advance Did not advance Did not advance Delaney Schnell 10 m platform 278.15 17 Q 271.95 15 Did not advance Did not advance Daryn Wright 10 m platform 272.25 19 Did not advance Did not advance Did not advance Did not advance Sarah Bacon Kassidy Cook 3 m synchronized springboard colspan=4 314.64 Jessica Parratto Delaney Schnell 10 m synchronized platform colspan=4 287.52 6 ==Equestrian== ===Dressage=== Athlete Horse Event Grand Prix Grand Prix Grand Prix Special Grand Prix Special Grand Prix Freestyle Grand Prix Freestyle Overall Overall Athlete Horse Event Score Rank Score Rank Technical Artistic Score Rank Adrienne Lyle Helix Individual 72.593 3 colspan=2 rowspan=3 Did not advance Did not advance Did not advance Did not advance Marcus Orlob Jane Individual Did not advance Did not advance Did not advance Did not advance Steffen Peters Suppenkasper Individual 66.491 9 Did not advance Did not advance Did not advance Did not advance Adrienne Lyle Marcus Orlob Steffen Peters See above Team Did not advance Did not advance colspan=4 Qualification Legend: Q = Qualified for the final based on position in group; q = Qualified for the final based on overall position ===Eventing=== Athlete Horse Event Dressage Dressage Cross-country Cross-country Cross-country Jumping Jumping Jumping Jumping Jumping Jumping Total Total Athlete Horse Event Dressage Dressage Cross-country Cross-country Cross-country Qualifier Qualifier Qualifier Final Final Final Total Total Athlete Horse Event Penalties Rank Penalties Total Rank Penalties Total Rank Penalties Total Rank Penalties Rank Liz Halliday-Sharp Cooley Nutcracker Individual 28.00 19 6.00 34.00 22 0.80 34.80 15 Q 5.20 40.00 19 40.00 19 Boyd Martin Fedarman B Individual 30.50 26 1.60 32.10 17 0.00 32.10 11 Q 0.00 32.10 10 32.10 10 Caroline Pamukcu HSH Blake Individual 30.40 25 32.00 62.40 47 4.40 66.80 37 Did not advance Did not advance Did not advance 66.80 37 Liz Halliday-Sharp Boyd Martin Caroline Pamukcu See above Team 88.90 6 38.00 128.50 9 5.20 133.70 7 colspan=3 133.70 7 ===Jumping=== Athlete Horse Event Qualification Qualification Qualification Final Final Final Jump-off Jump-off Jump-off Athlete Horse Event Penalties Time Rank Penalties Time Rank Penalties Time Rank Karl Cook Caracole de la Roque Individual 0 76.97 16 Q 8 79.72 16 Did not advance Did not advance Did not advance Laura Kraut Baloutinue Individual 4 73.22 27 Q 4 81.61 8 Did not advance Did not advance Did not advance McLain Ward Ilex Individual 4 75.50 34 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Karl Cook Laura Kraut McLain Ward See above Team 6 227.57 2 Q 4 229.90 colspan=3 ==Fencing== Men Athlete Event Round of 64 Round of 32 Round of 16 Quarterfinal Semifinal Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Nick Itkin Foil W 15–10 W 15–8 W 15–14 L 11–15 Bronze medal final W 15–12 Alexander Massialas Foil W 15–3 L 8–15 Did not advance Did not advance Did not advance Did not advance Gerek Meinhardt Foil W 15–7 L 10–15 Did not advance Did not advance Did not advance Did not advance Miles Chamley-Watson Nick Itkin Alexander Massialas Gerek Meinhardt Team foil colspan=3 W 45–35 L 38–45 Bronze medal final L 32–45 4 Eli Dershwitz Sabre L 10–15 Did not advance Did not advance Did not advance Did not advance Did not advance Colin Heathcock Sabre L 10–15 Did not advance Did not advance Did not advance Did not advance Did not advance Mitchell Saron Sabre W 15–12 L 13–15 Did not advance Did not advance Did not advance Did not advance Eli Dershwitz Filip Dolegiewicz Colin Heathcock Mitchell Saron Team sabre colspan=3 L 44–45 Classification semifinal L 40–45 Seventh place final W 45–43 7 Women Athlete Event Round of 64 Round of 32 Round of 16 Quarterfinal Semifinal Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Anne Cebula Épée W 15–14 L 13–15 Did not advance Did not advance Did not advance Did not advance Hadley Husisian Épée W 12–11 L 12–15 Did not advance Did not advance Did not advance Did not advance Margherita Guzzi Vincenti Épée L 6–15 Did not advance Did not advance Did not advance Did not advance Did not advance Anne Cebula Katharine Holmes Hadley Husisian Margherita Guzzi Vincenti Team épée colspan=3 L 29–31 Classification semifinal L 39–45 Seventh place final W 44–30 7 Jacqueline Dubrovich Foil L 12–15 Did not advance Did not advance Did not advance Did not advance Did not advance Lee Kiefer Foil W 15–13 W 15–9 W 15–4 W 15–10 W 15–6 Lauren Scruggs Foil W 15–13 W 15–11 W 15–14 W 15–9 L 6–15 Jacqueline Dubrovich Lee Kiefer Lauren Scruggs Maia Weintraub Team foil colspan=3 W 45–37 W 45–31 W 45–39 Tatiana Nazlymov Sabre L 14–15 Did not advance Did not advance Did not advance Did not advance Did not advance Magda Skarbonkiewicz Sabre L 11–15 Did not advance Did not advance Did not advance Did not advance Did not advance Elizabeth Tartakovsky Sabre L 13–15 Did not advance Did not advance Did not advance Did not advance Did not advance Maia Chamberlain Tatiana Nazlymov Magda Skarbonkiewicz Elizabeth Tartakovsky Team sabre colspan=3 L 35–45 Classification semifinal W 45–28 Fifth place final W 45–39 5 ==Field hockey== Summary Team Event Group stage Group stage Group stage Group stage Group stage Group stage Quarterfinal Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States women Women's tournament L 1–4 D 1–1 L 0–3 L 2–5 W 1–0 5 Did not advance Did not advance Did not advance 9 ==Football (soccer)== Summary Team Event Group Stage Group Stage Group Stage Group Stage Quarterfinal Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States men Men's tournament L 0–3 W 4–1 W 3–0 2 Q L 0–4 Did not advance Did not advance 8 United States women Women's tournament W 3–0 W 4–1 W 2–1 1 Q W 1–0 W 1–0 W 1–0 ==Golf== Men Athlete Event Round 1 Round 2 Round 3 Round 4 Total Total Total Athlete Event Score Score Score Score Score Par Rank Wyndham Clark Men's 75 68 65 65 273 −11 =14 Collin Morikawa Men's 70 68 70 70 278 −6 =24 Xander Schauffele Men's 65 66 68 73 272 −12 =9 Scottie Scheffler Men's 67 69 67 62 265 −19 Women Athlete Event Round 1 Round 2 Round 3 Round 4 Total Total Total Athlete Event Score Score Score Score Score Par Rank Nelly Korda Women's 72 70 70 75 287 −1 =22 Lilia Vu Women's 70 73 76 74 293 +5 =36 Rose Zhang Women's 72 70 67 74 283 –5 =8 ==Gymnastics== ===Artistic=== Men Team Athlete Event Qualification Qualification Qualification Qualification Qualification Qualification Qualification Qualification Final Final Final Final Final Final Final Final Athlete Event Apparatus Apparatus Apparatus Apparatus Apparatus Apparatus Total Rank Apparatus Apparatus Apparatus Apparatus Apparatus Apparatus Total Rank Athlete Event Total Rank Total Rank Asher Hong Team 14.100 14.633 14.700 14.300 12.600 colspan=2 14.133 14.533 14.833 14.400 rowspan=5 colspan=2 Paul Juda Team 13.966 13.600 14.533 13.333 82.865 13 Q 14.200 13.900 14.666 13.366 Brody Malone Team 14.233 14.533 79.598 30 rowspan=2 13.700 14.166 14.533 14.433 14.166 Stephen Nedoroscik Team 15.200 Q colspan=6 14.866 colspan=4 Fred Richard Team 13.833 13.633 13.500 13.933 14.433 14.166 83.498 10 Q 14.466 14.033 14.566 14.833 Total Team 41.899 42.433 42.366 43.166 43.266 40.099 253.229 5 Q 42.799 42.466 42.732 44.032 43.399 42.365 257.793 Individual finals Athlete Event Qualification Qualification Qualification Qualification Qualification Qualification Qualification Qualification Final Final Final Final Final Final Final Final Athlete Event Apparatus Apparatus Apparatus Apparatus Apparatus Apparatus Total Rank Apparatus Apparatus Apparatus Apparatus Apparatus Apparatus Total Rank Athlete Event Total Rank Total Rank Paul Juda All-around See team results above See team results above See team results above See team results above See team results above See team results above See team results above See team results above 13.533 13.866 13.433 13.733 13.866 13.766 82.197 14 Fred Richard All- around See team results above See team results above See team results above See team results above See team results above See team results above See team results above See team results above 13.200 12.733 13.600 14.100 14.133 14.400 82.166 15 Stephen Nedoroscik Pommel horse 15.200 colspan=4 15.200 2 Q 15.300 colspan=4 15.300 Women Team Athlete Event Qualification Qualification Qualification Qualification Qualification Qualification Final Final Final Final Final Final Athlete Event Apparatus Apparatus Apparatus Apparatus Total Rank Apparatus Apparatus Apparatus Apparatus Total Rank Athlete Event Total Rank Total Rank Simone Biles Team 15.800 Q 14.433 14.733 Q 14.600 Q 59.566 1 Q 14.900 14.400 14.366 14.666 rowspan=5 colspan=2 Jade Carey Team 14.666 Q colspan=2 colspan=2 14.800 colspan=3 Jordan Chiles Team 14.333 14.266 13.600 13.866 Q 56.065 4 14.400 14.366 12.733 13.966 Sunisa Lee Team 14.866 Q 14.033 Q 13.100 56.132 3 Q rowspan=2 14.566 14.600 13.533 Hezly Rivera Team colspan=3 colspan=3 Total Team 44.799 43.565 42.366 41.566 172.296 1 Q 44.100 43.332 41.699 42.165 171.296 Individual finals Athlete Event Qualification Qualification Qualification Qualification Qualification Qualification Final Final Final Final Final Final Athlete Event Apparatus Apparatus Apparatus Apparatus Total Rank Apparatus Apparatus Apparatus Apparatus Total Rank Athlete Event Total Rank Total Rank Simone Biles All-around See team results above See team results above See team results above See team results above See team results above See team results above 15.766 13.733 14.566 15.066 59.131 Sunisa Lee All-around See team results above See team results above See team results above See team results above See team results above See team results above 13.933 14.866 14.000 13.666 56.465 Simone Biles Vault 15.300 colspan=3 rowspan=2 15.300 1 Q 15.300 colspan=3 rowspan=2 15.300 Jade Carey Vault 14.433 14.433 3 Q 14.466 14.466 Sunisa Lee Uneven bars 14.866 colspan=2 14.866 3 Q 14.800 colspan=2 14.800 Simone Biles Balance beam colspan=2 rowspan=2 14.733 rowspan=2 14.733 2 Q colspan=2 rowspan=2 13.100 rowspan=2 13.100 5 Sunisa Lee Balance beam 14.033 14.033 4 Q 13.100 13.100 6 Simone Biles Floor rowspan=2 colspan=3 14.600 14.600 1 Q rowspan=2 colspan=3 14.133 14.133 Jordan Chiles Floor 13.866 13.866 3 Q 13.666 13.666 5 ===Rhythmic=== Athlete Event Qualification Qualification Qualification Qualification Qualification Qualification Final Final Final Final Final Final Athlete Event Hoop Ball Clubs Ribbon Total Rank Hoop Ball Clubs Ribbon Total Rank Evita Griskenas Individual 30.500 31.200 27.550 29.250 118.500 18 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance ===Trampoline=== Athlete Event Qualification Qualification Final Final Athlete Event Score Rank Score Rank Aliaksei Shostak Men's 57.350 10 Did not advance Did not advance Jessica Stevens Women's 53.170 13 Did not advance Did not advance ==Judo== Athlete Event Round of 32 Round of 16 Quarterfinals Semifinals Repechage Final / Final / Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Jack Yonezuka Men's −73 kg L 00–10 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance John Jayne Men's −90 kg W 10–00 L 00–01 Did not advance Did not advance Did not advance Did not advance Did not advance Maria Laborde Women's −48 kg W 10–00 L 00–10 Did not advance Did not advance Did not advance Did not advance Did not advance Angelica Delgado Women's −52 kg W 01–00 L 00–01 Did not advance Did not advance Did not advance Did not advance Did not advance ==Modern pentathlon== Athlete Event Fencing ranking round (épée one touch) Fencing ranking round (épée one touch) Fencing ranking round (épée one touch) Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Final Final Final Final Final Final Final Final Final Final Final Final Final Athlete Event Fencing ranking round (épée one touch) Fencing ranking round (épée one touch) Fencing ranking round (épée one touch) Fencing Swimming (200 m freestyle) Swimming (200 m freestyle) Swimming (200 m freestyle) Riding (show jumping) Riding (show jumping) Riding (show jumping) Riding (show jumping) Shooting / Running (10 m laser pistol / 3000 m cross-country) Shooting / Running (10 m laser pistol / 3000 m cross-country) Shooting / Running (10 m laser pistol / 3000 m cross-country) Total points Final rank Fencing Swimming Swimming Swimming Riding Riding Riding Riding Shooting / Running Shooting / Running Shooting / Running Total points Final rank Athlete Event Rank MP points Time Rank MP points Time Penalties Rank MP points Time Rank MP points Total points Final rank Time Rank MP points Time Penalties Rank MP points Time Rank MP points Total points Final rank Jessica Savner Women's 16–19 21 209 4 2:27.61 18 255 54.99 7 9 293 12:27.42 15 553 1310 14 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance ==Rowing== Men Athlete Event Heats Heats Repechage Repechage Quarterfinal Quarterfinal Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Time Rank Time Rank James Plihal Single sculls 6:54.95 2 QF colspan=2 6:47.03 3 SC/D 6:56.95 1 FC 6:41.97 13 William Bender Oliver Bub Pair 7:02.62 5 R 6:51.32 3 SA/B colspan=2 6:46.11 6 FB 6:28.57 10 Benjamin Davison Sorin Koszyk Double sculls 6:16.48 3 SA/B colspan=2 colspan=2 6:14.19 2 FA 6:17.02 4 Justin Best Liam Corrigan Michael Grady Nick Mead Four 6:04.95 1 FA colspan=2 colspan=4 5:49.03 Christopher Carlson Peter Chatain Clark Dean Henry Hollingsworth Rielly Milne (c) Evan Olson Pieter Quinton Nicholas Rusher Christian Tabash Eight 5:29.94 1 FA colspan=2 colspan=4 5:25.28 Women Athlete Event Heats Heats Repechage Repechage Quarterfinal Quarterfinal Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Time Rank Time Rank Kara Kohler Single sculls 7:32.46 1 QF colspan=2 7:34.96 2 SA/B 7:22.33 3 FA 7:25.07 5 Azja Czajkowski Jessica Thoennes Pair 7:25.52 3 SA/B colspan=2 colspan=2 7:15.59 2 FA 7:05.31 4 Sophia Vitas Kristi Wagner Double sculls 6:56.47 3 SA/B colspan=2 colspan=2 7:04.12 5 FB 6:50.74 9 Molly Reckford Michelle Sechser Lightweight double sculls 7:12.65 2 SA/B colspan=2 colspan=2 7:05.03 3 FA 6:55.60 6 Emily Kallfelz Kaitlin Knifton Mary Mazzio-Manson Kelsey Reelick Four 6:49.66 4 R 6:32.48 1 FA colspan=4 6:34.88 5 Teal Cohen Emily Delleman Grace Joyce Lauren O'Connor Quadruple sculls 6:27.35 4 R 6:34.04 5 FB colspan=4 6:31.71 9 Molly Bruggeman Charlotte Buck Cristina Castagna (c) Olivia Coffey Claire Collins Margaret Hedeman Meghan Musnicki Regina Salmons Madeleine Wanamaker Eight 6:19.00 2 R 6:03.93 1 FA colspan=4 6:01.73 5 Qualification Legend: FA=Final A (medal); FB=Final B (non-medal); FC=Final C (non-medal); FD=Final D (non-medal); FE=Final E (non-medal); FF=Final F (non- medal); SA/B=Semifinals A/B; SC/D=Semifinals C/D; SE/F=Semifinals E/F; QF=Quarterfinals; R=Repechage ==Rugby sevens== Summary Team Event Pool round Pool round Pool round Pool round Quarterfinal Semifinal / Final / / Final / / Team Event Opposition Result Opposition Result Opposition Result Rank Opposition Result Opposition Result Opposition Result Rank United States men Men's tournament D 12–12 L 12–38 W 33–17 3 Q L 0–18 Classification semifinal L 14–17 Seventh place match L 0–19 8 United States women Women's tournament W 36–7 W 24–5 L 14–31 2 Q W 17–7 L 12–24 Bronze medal final W 14–12 ==Sailing== Elimination races Athlete Event Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Opening series Quarterfinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Final Final Final Final Final Final Final Final Athlete Event 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Net points Rank Rank 1 2 3 4 5 6 Total Rank 1 2 3 4 5 6 Total Rank Noah Lyons Men's IQFoil 5 1 8 13 12 3 9 6 11 6 14 colspan=7 88 7 QF 5 colspan=7 colspan=7 EL Markus Edegran Men's Formula Kite 13 11 7 6 3 3 colspan=13 31 9 SF 4 colspan=5 4 colspan=7 EL Dominique Stater Women's IQFoil 11 20 6 21 16 22 20 12 18 8 20 14 colspan=6 188 22 colspan=7 EL colspan=7 EL Daniela Moroz Women's Formula Kite 3 4 1 2 7 colspan=14 17 3 SF 1 colspan=6 1 F 3 4.1 colspan=4 7.1 4 Qualification legend: QF - Qualify to quarterfinal; SF - Qualify to semifinal; F - Qualify to final Medal races Athlete Event Race Race Race Race Race Race Race Race Race Race Race Race Race Net points Final rank Athlete Event 1 2 3 4 5 6 7 8 9 10 11 12 M* Net points Final rank Ian Barrows Hans Henken 49er 8 7 9 9 5 10 7 3 2 8 11 8 88 Erika Reineke ILCA 6 13 25 18 3 4 7 2 25 colspan=2 12 110 9 Stephanie Roble Maggie Shea 49erFX 7 11 10 3 9 13 15 13 8 7 9 20 125 10 Lara Dallman-Weiss Stuart McNay 470 9 17 4 13 11 6 12 colspan=2 colspan=2 72 13 David Liebenberg Sarah Newberry Moore Nacra 17 10 16 18 14 13 16 11 15 3 12 13 141 16 Key: M - Medal race; EL - Eliminated, did not advance into the medal race ==Shooting== Men Athlete Event Qualification Qualification Final Final Athlete Event Points Rank Points Rank Rylan Kissell 10 m air rifle 626.3 35 Did not advance Did not advance Ivan Roe 10 m air rifle 626.3 34 Did not advance Did not advance Rylan Kissell 50 m rifle 3 positions 579-25x 38 Did not advance Did not advance Ivan Roe 50 m rifle 3 positions 587-32x 20 Did not advance Did not advance Henry Leverett 25 m rapid fire pistol 573-16x 25 Did not advance Did not advance Keith Sanderson 25 m rapid fire pistol 579-16x 19 Did not advance Did not advance Will Hinton Trap 116 27 Did not advance Did not advance Derrick Mein Trap 122 (+13) 6 Q 26 5 Vincent Hancock Skeet 123 4 Q 58 Conner Prince Skeet 124 (+12) 1 Q 57 Women Athlete Event Qualification Qualification Final Final Athlete Event Points Rank Points Rank Sagen Maddalena 10 m air rifle 631.4 7 Q 207.7 4 Mary Tucker 10 m air rifle 625.2 32 Did not advance Did not advance Sagen Maddalena 50 m rifle 3 positions 593-45x OR 1 Q 463.0 Mary Tucker 50 m rifle 3 positions 579-20x 25 Did not advance Did not advance Katelyn Abeln 10 m air pistol 570-16x 24 Did not advance Did not advance Alexis Lagan 10 m air pistol 570-15x 25 Did not advance Did not advance Katelyn Abeln 25 m pistol 585-19x 8 Q 5 8 Ada Korkhin 25 m pistol 571-17x 32 Did not advance Did not advance Ryann Phillips Trap 116 16 Did not advance Did not advance Rachel Tozier Trap 116 18 Did not advance Did not advance Austen Smith Skeet 122 (+14) 1 Q 45 Dania Vizzi Skeet 118 12 Did not advance Did not advance Mixed Athlete Event Qualification Qualification Final / Final / Athlete Event Points Rank Opponent Result Rank Sagen Maddalena Ivan Roe 10 m air rifle team 624.9 18 Did not advance Did not advance Mary Tucker Rylan Kissell 10 m air rifle team 626.0 13 Did not advance Did not advance Vincent Hancock Austen Smith Skeet team 148 2 G L 44–45 Conner Prince Dania Vizzi Skeet team 144 6 Did not advance Did not advance Key: G - Qualify to gold medal match; B - Qualify to bronze medal match ==Skateboarding== Men Athlete Event Qualification Qualification Final Final Athlete Event Score Rank Score Rank Gavin Bottger Park 86.95 10 Did not advance Did not advance Tate Carew Park 90.42 4 Q 91.17 5 Tom Schaar Park 92.05 2 Q 92.23 Jagger Eaton Street 274.88 1 Q 281.04 Nyjah Huston Street 272.66 2 Q 279.38 Chris Joslin Street 50.84 21 Did not advance Did not advance Women Athlete Event Qualification Qualification Final Final Athlete Event Score Rank Score Rank Ruby Lilley Park 75.07 13 Did not advance Did not advance Minna Stess Park 54.71 19 Did not advance Did not advance Bryce Wettstein Park 85.65 2 Q 88.12 6 Mariah Duran Street 58.36 22 Did not advance Did not advance Paige Heyn Street 244.29 6 Q 163.23 6 Poe Pinson Street 241.12 8 Q 222.34 5 ==Sport climbing== The U.S. had 8 climbers. Colin Duffy and Emma Hunt qualified for the team after winning silver medals at the 2023 World Championships in Bern, Switzerland. Piper Kelly, Samuel Watson, Natalia Grossman, and Jesse Grupper qualified for the team by winning gold medals at the 2023 Pan American Games in Santiago, Chile. Brooke Raboutou and Zach Hammer qualified for the games by having a high rank in the 2024 Olympic Qualifier Series. Boulder & lead combined Athlete Event Semifinal Semifinal Semifinal Semifinal Semifinal Semifinal Final Final Final Final Final Final Athlete Event Boulder Boulder Lead Lead Total Rank Boulder Boulder Lead Lead Total Rank Athlete Event Points Rank Points Rank Total Rank Points Rank Points Rank Total Rank Colin Duffy Men's 33.8 11 54.1 6 87.9 7 Q 68.3 2 68.1 7 136.4 4 Jesse Grupper Men's 18.9 18 21.0 17 30.9 18 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Natalia Grossman Women's 69.2 5 39.1 18 108.3 11 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Brooke Raboutou Women's 83.7 3 72.1 4 155.8 3 Q 84.0 2 72.0 5 156.0 Speed Athlete Event Qualification Qualification Round of 16 Quarterfinals Semifinals Final / Final / Athlete Event Time Rank Opposition Time Opposition Time Opposition Time Opposition Time Rank Zach Hammer Men's 6.05 12 L –4.75 Did not advance Did not advance Did not advance 14 Sam Watson Men's 4.91 3 W 4.75 WR–F W 5.03–5.65 L 4.93–4.85 Bronze medal final W 4.74 WR–4.88 Emma Hunt Women's 6.36 2 W 6.38–7.07 L 7.98–6.54 Did not advance Did not advance 5 Piper Kelly Women's 7.39 9 L 8.43–6.38 Did not advance Did not advance Did not advance 13 ==Surfing== Athlete Event Round 1 Round 1 Round 2 Round 3 Quarterfinal Semifinal Final / Final / Athlete Event Score Rank Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Griffin Colapinto Men's shortboard 17.03 1 R3 L 13.83–15.10 Did not advance Did not advance Did not advance Did not advance John John Florence Men's shortboard 17.33 1 R3 L 9.07–13.94 Did not advance Did not advance Did not advance Did not advance Caroline Marks Women's shortboard 17.93 1 R3 W 6.93–1.63 W 7.77–5.37 W 12.17(7.00)–12.17(6.50) W 10.50–10.33 Carissa Moore Women's shortboard 16.50 1 R3 W 8.16–3.87 L 6.50–10.34 Did not advance Did not advance Did not advance Caitlin Simmers Women's shortboard 12.93 1 R3 L 1.93–12.34 Did not advance Did not advance Did not advance Did not advance Qualification legend: R3 - Qualifies to elimination rounds; R2 - Qualifies to repechage round ==Swimming== Men Athlete Event Heat Heat Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Caeleb Dressel 50 m freestyle 21.91 13 Q 21.58 5 Q 21.61 6 Chris Guiliano 50 m freestyle 21.97 17 Did not advance Did not advance Did not advance Did not advance Jack Alexy 100 m freestyle 47.57 1 Q 47.68 6 Q 47.96 7 Chris Guiliano 100 m freestyle 48.25 =8 Q 47.72 7 Q 47.98 8 Chris Guiliano 200 m freestyle 1:47.60 19 Did not advance Did not advance Did not advance Did not advance Luke Hobson 200 m freestyle 1:46.23 =7 Q 1:45.19 3 Q 1:44.79 Aaron Shackell 400 m freestyle 3:45.45 6 Q rowspan=2 colspan=2 3:47.00 8 Kieran Smith 400 m freestyle 3:46.47 11 Did not advance Did not advance Bobby Finke 800 m freestyle 7:43.00 5 Q rowspan=2 colspan=2 7:38.75 Luke Whitlock 800 m freestyle 7:49.26 15 Did not advance Did not advance Bobby Finke 1500 m freestyle 14:45.31 6 Q rowspan=2 colspan=2 14:30.67 David Johnston 1500 m freestyle 15:10.64 18 Did not advance Did not advance Hunter Armstrong 100 m backstroke 53.34 9 Q 53.11 11 Did not advance Did not advance Ryan Murphy 100 m backstroke 53.06 4 Q 52.72 5 Q 52.39 Keaton Jones 200 m backstroke 1:57.54 11 Q 1:56.39 6 Q 1:55.39 5 Ryan Murphy 200 m backstroke 1:57.03 5 Q 1:56.62 10 Did not advance Did not advance Nic Fink 100 m breaststroke 59.66 10 Q 59.16 4 Q 59.05 = Charlie Swanson 100 m breaststroke 59.92 14 Q 1:00.16 14 Did not advance Did not advance Matthew Fallon 200 m breaststroke 2:10.49 11 Q 2:09.96 =10 Did not advance Did not advance Josh Matheny 200 m breaststroke 2:10.39 10 Q 2:09.70 6 Q 2:09.52 7 Caeleb Dressel 100 m butterfly 50.83 6 Q 51.57 13 Did not advance Did not advance Thomas Heilman 100 m butterfly 51.82 18 Did not advance Did not advance Did not advance Did not advance Thomas Heilman 200 m butterfly 1:55.74 11 Q 1:54.87 10 Did not advance Did not advance Luca Urlando 200 m butterfly 1:56.18 17 Did not advance Did not advance Did not advance Did not advance Shaine Casas 200 m individual medley 1:58.04 5 Q 1:57.82 9 Did not advance Did not advance Carson Foster 200 m individual medley 1:58.63 10 Q 1:56.37 2 Q 1:56.10 4 Carson Foster 400 m individual medley 4:11.07 4 Q rowspan=2 colspan=2 4:08.66 Chase Kalisz 400 m individual medley 4:13.36 11 Did not advance Did not advance Jack Alexy Hunter Armstrong Caeleb Dressel Chris Guiliano Ryan Held Matt King 4 × 100 m freestyle relay 3:12.61 4 Q colspan=2 3:09.28 Brooks Curry Carson Foster Chris Guiliano Luke Hobson Drew Kibler Blake Pieroni Kieran Smith 4 × 200 m freestyle relay 7:05.57 2 Q colspan=2 7:00.78 Jack Alexy Hunter Armstrong Caeleb Dressel Nic Fink Thomas Heilman Ryan Murphy Charlie Swanson 4 × 100 m medley relay 3:31.62 3 Q colspan=2 3:28.01 Ivan Puskovitch 10 km open water colspan=4 1:57:52.5 19 Women Athlete Event Heat Heat Semifinal Semifinal Final Final Athlete Event Time Rank Time Rank Time Rank Simone Manuel 50 m freestyle 24.587 =18 Did not advance Did not advance Did not advance Did not advance Gretchen Walsh 50 m freestyle 24.37 3 Q 24.17 2 Q 24.21 4 Torri Huske 100 m freestyle 53.53 7 Q 52.99 7 Q 52.29 Gretchen Walsh 100 m freestyle 53.54 8 Q 53.18 8 Q 53.04 8 Erin Gemmell 200 m freestyle 1:57.23 11 Q 1:56.46 9 Did not advance Did not advance Claire Weinstein 200 m freestyle 1:56.48 6 Q 1:55.24 3 Q 1:56.60 8 Katie Ledecky 400 m freestyle 4:02.19 1 Q rowspan=2 colspan=2 4:00.86 Paige Madden 400 m freestyle 4:03.34 6 Q 4:02.26 6 Katie Ledecky 800 m freestyle 8:16.62 1 Q rowspan=2 colspan=2 8:11.04 Paige Madden 800 m freestyle 8:18.48 2 Q 8:13.00 Katie Grimes 1500 m freestyle 16:12.11 10 rowspan=2 colspan=2 Did not advance Did not advance Katie Ledecky 1500 m freestyle 15:47.43 1 Q 15:30.02 OR Katharine Berkoff 100 m backstroke 57.99 1 Q 58.27 3 Q 57.98 Regan Smith 100 m backstroke 58.45 2 Q 57.97 1 Q 57.66 Phoebe Bacon 200 m backstroke 2:09.00 4 Q 2:07.32 1 Q 2:05.61 4 Regan Smith 200 m backstroke 2:09.61 6 Q 2:08.14 6 Q 2:04.26 Lilly King 100 m breaststroke 1:06.10 5 Q 1:05.64 3 Q 1:05.60 =4 Emma Weber 100 m breaststroke 1:07.65 23 Did not advance Did not advance Did not advance Did not advance Kate Douglass 200 m breaststroke 2:23.44 3 Q 2:19.74 1 Q 2:19.24 AM Lilly King 200 m breaststroke 2:24.91 11 Q 2:23.25 6 Q 2:25.91 8 Torri Huske 100 m butterfly 56.72 3 Q 56.00 2 Q 55.59 Gretchen Walsh 100 m butterfly 56.75 4 Q 55.38 1 Q 55.63 Alex Shackell 200 m butterfly 2:07.49 5 Q 2:06.46 5 Q 2:07.73 6 Regan Smith 200 m butterfly 2:06.99 2 Q 2:05.39 2 Q 2:03.84 NR Kate Douglass 200 m individual medley 2:10.70 5 Q 2:08.59 3 Q 2:06.92 Alex Walsh 200 m individual medley 2:10.48 3 Q 2:07.45 1 Q Katie Grimes 400 m individual medley 4:37.24 2 Q rowspan=2 colspan=2 4:33.40 Emma Weyant 400 m individual medley 4:36.27 1 Q 4:34.93 Erika Connolly Kate Douglass Torri Huske Simone Manuel Gretchen Walsh Abbey Weitzeil 4 × 100 m freestyle relay 3:33.29 2 Q colspan=2 3:30.20 AM Erin Gemmel Katie Ledecky Paige Madden Simone Manuel Anna Peplowski Alex Shackell Claire Weinstein 4 × 200 m freestyle relay 7:52.72 4 Q colspan=2 7:40.86 Katharine Berkoff Kate Douglass Torri Huske Lilly King Alex Shackell Regan Smith Gretchen Walsh Emma Weber 4 × 100 m medley relay 3:56.40 4 Q colspan=2 3:49.63 Mariah Denigan 10 km open water colspan=4 rowspan=2 2:06:42.9 16 Katie Grimes 10 km open water 2:06:29.6 15 Mixed Athlete Event Heat Heat Final Final Athlete Event Time Rank Time Rank Caeleb Dressel Nic Fink Torri Huske Ryan Murphy Regan Smith Charlie Swanson Gretchen Walsh Abbey Weitzeil 4 × 100 m medley relay 3:40.98 1 Q 3:37.43 Swimmers who participated in the heats only. ==Table tennis== Athlete Event Preliminary Round of 64 Round of 32 Round of 16 Quarterfinals Semifinals Final / Final / Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Kanak Jha Men's singles W 4–0 W 4–2 W 4–2 L 0–4 Did not advance Did not advance Did not advance Did not advance Amy Wang Women's singles W 4–0 L 2–4 Did not advance Did not advance Did not advance Did not advance Did not advance Lily Zhang Women's singles W 4–0 W 4–2 L 0–4 Did not advance Did not advance Did not advance Did not advance Rachel Sung Amy Wang Lily Zhang Women's team colspan=3 L 2–3 Did not advance Did not advance Did not advance Did not advance ==Taekwondo== Athlete Event Qualification Round of 16 Quarterfinals Semifinals Repechage Final / Final / Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Carl Nickolas Men's −80 kg W 2–0 W 2–0 L 0–2 Bronze medal match L 0–2 4 Jonathan Healy Men's +80 kg W 2–1 L 0–2 Did not advance Did not advance Did not advance Did not advance Faith Dillon Women's −57 kg L 1–2 Did not advance Did not advance Did not advance Did not advance Did not advance Kristina Teachout Women's −67 kg W 2–0 L 1–2 Did not advance W 2–1 Bronze medal match W 2–0 ==Tennis== Men Athlete Event Round of 64 Round of 32 Round of 16 Quarterfinals Semifinals Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Christopher Eubanks Singles L 4–6, 2–6 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Taylor Fritz Singles W 6–4, 6–4 W 6–7(3–7), 6–3, 6–2 L 4–6, 5–7 Did not advance Did not advance Did not advance Did not advance Marcos Giron Singles L 1–6, 4–6 Did not advance Did not advance Did not advance Did not advance Did not advance Did not advance Tommy Paul Singles W 6–3, 6–4 W 6–3, 6–1 W 7–6(7–5), 6–3 L 3–6, 6–7(7–9) Did not advance Did not advance Did not advance Taylor Fritz Tommy Paul Doubles rowspan=2 W 7–6(16–14), 6–4 W 6–3, 6–4 W 6–2, 6–4 L 5–7, 2–6 Bronze medal match W 6–3, 6–4 Austin Krajicek Rajeev Ram Doubles W 6–2, 6–3 W 6–4, 7–6(7–3) W 6–2, 6–4 W 6–2, 6–2 L 7–6(8–6), 6–7(1–7), [8–10] Women Athlete Event Round of 64 Round of 32 Round of 16 Quarterfinals Semifinals Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Danielle Collins Singles W 6–3, 2–0, W 6–3, 3–6, 6–3 W 6–0, 4–6, 6–3 L 1–6, 6–2, 1–4 Did not advance Did not advance Did not advance Coco Gauff Singles W 6–3, 6–0 W 6–1, 6–1 L 6–7(7–9), 2–6 Did not advance Did not advance Did not advance Did not advance Emma Navarro Singles W 6–2, 6–0 W 6–7(5–7), 6–4, 6–1 L 7–6(9–7), 6–7(4–7), 1–6 Did not advance Did not advance Did not advance Did not advance Jessica Pegula Singles W 6–3, 6–4 L 6–4, 1–6, 3–6 Did not advance Did not advance Did not advance Did not advance Did not advance Danielle Collins Desirae Krawczyk Doubles rowspan=2 W 6–1, 6–3 L 6–3, 4–6, [7–10] Did not advance Did not advance Did not advance Did not advance Coco Gauff Jessica Pegula Doubles W 6–3, 6–1 L 6–2, 4–6, [5–10] Did not advance Did not advance Did not advance Did not advance Mixed Athlete Event Round of 16 Quarterfinal Semifinal Final / Final / Athlete Event Opposition Score Opposition Score Opposition Score Opposition Score Rank Taylor Fritz Coco Gauff Doubles W 6–1, 6–7(6–8), [10–5] L 6–7(2–7), 6–3, [8–10] Did not advance Did not advance Did not advance ==Triathlon== Individual Athlete Event Time Time Time Time Time Time Rank Athlete Event Swim (1.5 km) Trans 1 Bike (40 km) Trans 2 Run (10 km) Total Rank Morgan Pearson Men's 21:30 0:47 54:35 0:30 31:04 1:48:26 31 Seth Rider Men's 20:30 0:53 52:00 0:27 34:03 1:47:53 29 Kirsten Kasper Women's 22:39 0:53 1:05:47 0:31 36:48 2:06:38 49 Taylor Knibb Women's 24:08 0:56 57:45 0:31 35:17 1:58:37 19 Taylor Spivey Women's 22:43 0:57 58:04 0:30 34:57 1:57:11 10 Relay Athlete Event Time Time Time Time Time Time Rank Athlete Event Swim (300 m) Trans 1 Bike (7 km) Trans 2 Run (2 km) Total Rank Taylor Knibb Mixed relay 4:50 1:10 10:08 0:27 5:38 22:13 rowspan=4 Morgan Pearson Mixed relay 4:33 0:58 9:32 0:24 5:00 20:27 Seth Rider Mixed relay 4:09 1:07 9:38 0:24 5:01 20:19 Taylor Spivey Mixed relay 5:00 1:12 10:25 0:25 5:39 22:41 Total Mixed relay colspan=5 1:25:40 ==Volleyball== ===Beach=== Athletes Event Preliminary round Preliminary round Preliminary round Preliminary round Round of 16 Quarterfinal Semifinal Final / Final / Athletes Event Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Andy Benesh Miles Partain Men's L (18–21, 18–21) W (21–12, 28–26) W (21–17, 14–21, 15–8) 2 Q W (21–17, 21–18) L (14–21, 16–21) Did not advance Did not advance 5 Chase Budinger Miles Evans Men's W (21–14, 21–11) L (13–21, 15–21) L (18–21, 11–21) 3 LL W (21–19, 21–17) L (16–21, 14–21) Did not advance Did not advance Did not advance 9 Kelly Cheng Sara Hughes Women's W (21–16, 21–11) W (21–16, 23–21) W (21–18, 21–18) 1 Q W (21–18, 17–21, 15–12) L (18–21, 19–21) Did not advance Did not advance 5 Taryn Kloth Kristen Nuss Women's W (21–17, 21–14) W (21–16, 21–16) W (15–21, 21–16, 15–12) 1 Q L (19–21, 18–21) Did not advance Did not advance Did not advance 9 ===Indoor=== Summary Team Event Group stage Group stage Group stage Group stage Quarterfinal Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States men Men's tournament W 3–0 W 3–2 W 3–1 1 Q W 3–1 L 2–3 Bronze medal match W 3–0 United States women Women's tournament L 2–3 W 3–2 W 3–0 2 Q W 3–0 W 3–2 L 0–3 ==Water polo == Summary Team Event Group stage Group stage Group stage Group stage Group stage Group stage Quarterfinal Semifinal Final / Final / Team Event Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank United States men Men's tournament L 8–12 W 14–8 L 11–13 W 12–7 W 14–11 3 Q W 11–10 L 6–10 Bronze medal match W 11–8 United States women Women's tournament W 15–6 L 11–13 W 10–3 W 17–5 2 Q W 5–4 L 13–14 Bronze medal match L 10–11 4 ==Weightlifting== Athlete Event Snatch Snatch Clean & Jerk Clean & Jerk Total Rank Athlete Event Result Rank Result Rank Total Rank Hampton Morris Men's –61 kg 126 5 172 1 298 Wesley Kitts Men's −102 kg 172 9 202 8 374 8 Jourdan Delacruz Women's −49 kg 84 7 111 5 195 5 Olivia Reeves Women's −71 kg 117 OR 1 145 1 262 Mary Theisen-Lappen Women's +81 kg 119 6 155 5 274 5 ==Wrestling== Men Athlete Event Round of 16 Quarterfinal Semifinal Repechage Final / Final / Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Spencer Lee Freestyle 57 kg W 3–1PP W 4–1SP W 4–1SP L 1–3PP Zain Retherford Freestyle 65 kg L 0–3PO Did not advance Did not advance L 0–5VB Did not advance 8 Kyle Dake Freestyle 74 kg W 4–0ST W 5–0VT L 1–3PP Bronze medal match W 10–4PO Aaron Brooks Freestyle 86 kg W 3–1PP W 4–1SP L 1–3PP Bronze medal match W 3–0PO Kyle Snyder Freestyle 97 kg W 3–1PP W 5–0VT L 1–3PP Bronze medal match L 1–3PP T5 Mason Parris Freestyle 125 kg L 1–3PP Did not advance Did not advance Did not advance Did not advance 10 Kamal Bey Greco-Roman 77 kg L 1–3PP Did not advance Did not advance Did not advance Did not advance 11 Payton Jacobson Greco-Roman 87 kg L 0–4ST Did not advance Did not advance Did not advance Did not advance 16 Josef Rau Greco-Roman 97 kg L 1–4SP Did not advance Did not advance L 1–3PP Did not advance 9 Adam Coon Greco-Roman 130 kg L 1–3PP Did not advance Did not advance Did not advance Did not advance 12 Women Athlete Event Round of 16 Quarterfinal Semifinal Repechage Final / Final / Athlete Event Opposition Result Opposition Result Opposition Result Opposition Result Opposition Result Rank Sarah Hildebrandt 50 kg W 4–0ST W 3–1PP W 3–0PO W 3–0PO Dominique Parrish 53 kg L 0–5VT Did not advance Did not advance L 0–5VT Did not advance 11 Helen Maroulis 57 kg W 3–1PP W 3–1PP L 1–3PP Bronze medal match W 5–0VT Kayla Miracle 62 kg W 4–1SP L 1–3PP Did not advance Did not advance Did not advance 7 Amit Elor 68 kg W 3–1PP W 3–0PO W 4–0ST W 3–0PO Kennedy Blades 76 kg W 4–0ST W 4–3PP W 3–1PP L 1–3PP * ==References== ==Other websites== * * Category:Nations at the 2024 Summer Olympics Category:2020s in American sports Category:United States at the Summer Olympics Category:2024 in sports",
 "title": "United States at the 2024 Summer Olympics"
}