{
 "id": "1187189",
 "text": "On 22 April 2025, five armed militants attacked on non-Muslim tourists near Pahalgam in The Indian-administered Jammu and Kashmir known as the 2025 Pahalgam Attack. On 07 May 2025, India launched air strikes on The Islamic Republic of Pakistan. India said it launched in response to the 2025 Pahalgam Attack. A number of countries, including many of India's Western allies, such as Israel and a number of European countries, expressed solidarity for India and stated that India has a right to defend itself from terrorist attacks. == Countries == === Africa === * – The Ministry of Foreign Affairs expressed deep concern about the recent escalation of armed exchanges between India and Pakistan, urged both sides to maintain self‑restraint and calm, to return immediately to dialogue in a spirit of responsibility, and warned that political and diplomatic means must prevail over the use of force. * – The Ministry of Foreign Affairs, in an official statement, has called on India and Pakistan to exercise \"utmost restraint\" and prioritize diplomacy, as rising tensions between the nuclear-armed neighbours sparked fears of broader regional instability. * – The Ministry of Foreign Affairs and International Cooperation, the Government of National Unity called for restraint and urged both nations to prioritise dialogue and diplomacy. The ministry emphasised the importance of de-escalation to maintain regional peace and stability, and to avoid further deterioration of the situation. === Middle East === * – Foreign Minister Abbas Araghchi said “We seek de-escalation and urge all parties to exercise restraint and avoid increasing tensions”. * – Israel’s Ambassador to India, Reuven Azar, posted on X: “Israel supports India’s right for self- defense. Terrorists should know there’s no place to hide from their heinous crimes against the innocent.” * – The Kingdom of Saudi Arabia has expressed concern over the heightened tensions and continued border fire between the Republic of India and the Islamic Republic of Pakistan. The Kingdom appealed to both nations to de-escalate, avoid further escalation, resolve their disagreements through diplomatic channels, uphold the principles of good neighborliness, and strive for stability and peace for the welfare of their people and region. * – The Ministry of Foreign Affairs said it is following with \"great concern and interest\" the tension between \"the friendly\" India and Pakistan. \"The ministry also calls on all parties to exercise self-restraint, avoid escalation, and adhere to the provisions and rules of international law and the principles of good neighbourliness, with the aim of achieving constructive dialogue that achieves regional and international security and stability,\" the statement said. * – The Ministry of Foreign Affairs urged diplomacy and restraint. * – The UAE has called for restraint and de- escalation of tensions between India and Pakistan. === Asia === * – The Ministry of Foreign Affairs expresses concern over rising India-Pakistan tensions, stressing that escalation harms regional interests. It urges both sides to pursue dialogue and uphold regional stability. * – The Ministry of Foreign Affairs said “We are concerned about recent tensions between India and Pakistan following attack in Pahalgam”. * – The Ministry of Foreign Affairs, in an official statement, has conveyed that it is closely observing the situation. Additionally, it has urged both nations to exercise restraint and maintain calm. * – China has expressed “regret” over India’s military action against Pakistan and voiced “concerns” over the escalating tensions between the South Asian nations, the Chinese foreign ministry said “India and Pakistan are neighbours who cannot be moved away, and both are also China’s neighbours. The ministry said China opposes all forms of terrorism”. * – The Ministry of Foreign Affairs urges India, Pakistan to exercise restraint, calls for dialogue for peace in South Asia * – The Foreign Ministry spokesperson Maria Zakharova said “We are deeply concerned about the intensifying military confrontation between India and Pakistan after the terrorist attack near the city of Pahalgam”. === Europe === * – The Foreign Minister Jean-Noël Barrot said that while India has the right to defend itself against terrorism, both India and Pakistan should stay calm, avoid further conflict, and protect civilians. * – The Federal Foreign Office urged both India and Pakistan to act responsibly, avoid escalation, and ensure the protection of civilians, while closely monitoring the situation. * – The Ministry of Foreign Affairs of Ukraine called on both parties to exercise restraint and diplomatic dialogue in order to de-escalate the situation. * – The Foreign Secretary David Lammy said that “The U.K. government is urging India and Pakistan to show restraint and engage in direct dialogue to find a swift, diplomatic path forward,” calling the tensions “a serious concern”. === Americas === * – The Ministry of Foreign Affairs, on a X post, expressed serious concern about the rising tensions between India and Pakistan after the terrorist attack on April 22. It strongly condemned all kinds of terrorism but also said that using force is not the right way to solve conflicts. * – President Donald Trump called India's military strikes on Pakistan shameful and said he hopes the fighting ends quickly. Secretary of State Marco Rubio spoke to the national security advisers from India and Pakistan and urged both to keep lines of communication open and avoid escalation. == References ==",
 "title": "International reactions to the 2025 India-Pakistan conflict"
}