{
 "id": "1187744",
 "text": "Pope Benedict XVI's resignation from the pontificate of the Catholic Church was announced by him on February 11, 2013. The resignation became effective on February 28, at 8:00 p.m. (Rome time), at which time the Holy See automatically became vacant, and a conclave was held in march to elect the next Supreme Pontiff of the Catholic Church. The news was the subject of extensive media coverage, focusing on the unusual nature of such an event in history, described by some as \"revolutionary\", as it went against the Catholic custom in which the Pope extends his pontificate until the moment of his death. On March 13 of that year, the Argentine Jorge Mario Bergoglio was elected pope, adopting the name of Francis, which made him the first American pope in history. ==Overview== Resignations from the papacy are not an isolated case in the history of the Catholic Church; in fact, the possibility of resignation is contemplated in the Code of Canon Law of 1983. The first pope known to have resigned was Clement I, in 97, while the last papal resignation occurred with Gregory XII, who served as pope from 1406 to 1415; since then, no other pontiff had resigned his ministry, making Benedict XVI the first to resign in 598 years. However, the precedent of Pope Celestine V, in 1294, is the only one that leaves no doubt about the spontaneity of the decision. In the case of Benedict XVI, the situation following the resignation was anomalous. Although the Code of Canon Law provides for the resignation of the Roman Pontiff and only requires for its validity \"that the resignation be free and formally manifested, but not that it be accepted by anyone\", there was a debate about whether it is correct to use the title \"pope emeritus\", whether Ratzinger should have become a cardinal again or whether, taking into account canon 402 § 1 of the Code of Canon Law, the Pope - as bishop of Rome can acquire the title of \"emeritus\" like other bishops when they resign. ==Announcement== The Pope announced his resignation in Latin, the official language of the Catholic Church, during a public ordinary consistory, or meeting of the College of Cardinals, to reveal the canonization dates of Blessed María Guadalupe García Zavala of Mexico and Blessed Laura Montoya of Colombia, and of the Italian martyrs Antonio Primaldo and more than 800 of his companions. This ceremony took place on 11 February 2013, between 11:30 and 11:40 a.m. (rome time). Five reporters covering the consistory were present at the event: an Italian correspondent, a Mexican correspondent, two French reporters, and a Japanese reporter. ==Reactions== === State === Australia's Prime Minister Julia Gillard, Brazil's President Dilma Rousseff, Canada's Prime Minister Stephen Harper, Germany's Chancellor Angela Merkel,Germany and Europe hail retiring Pope Benedict XVI , Deutsche Welle, 11 February 2013 United Kingdom's Prime Minister David Cameron and United States' President Barack Obama praised Benedict and his pontificate; while Italy's Prime Minister Mario Monti and Philippines' President Benigno Aquino III expressed shock and regret, respectively. ==Subsequent events== Benedict XVI continued his scheduled papal activities until 28 February, including audiences with Otto Pérez Molina of Guatemala and Traian Băsescu of Romania. He also presided over Ash Wednesday Mass on 13 February. Between 17 and 23 February, he participated in a spiritual retreat, and on 24 February, he celebrated his last mass as Pope in St. Peter's Square before 200,000 people. A day later, he authorized a change in church law to allow the conclave to begin earlier than the traditional timeframe of 15 to 20 days after a pope's death or resignation. In this way, the conclave would begin just after all the cardinals eligible to participate in the event were gathered in Rome. On 27 February he held his last audience in St. Peter's Square, and, the following day, at 4:55 p.m. in Rome, he left the Vatican Apostolic Palace accompanied by the ringing of the bells of the churches located in the diocese of Rome. ==References== ==Other websites== * \"Declaratio, 11 February 2013 – Benedict XVI\" (English translation). Vatican State: Holy See. 11 February 2013. Category:Vatican City",
 "title": "Resignation of Pope Benedict XVI"
}