{
 "id": "1187952",
 "text": "The India national futsal team is India's team for international futsal competitions. The All India Football Federation (AIFF) controls the team. The team is governed in Asia by the Asian Football Confederation (AFC). India's first game was against Bahrain in an international friendly game on 12 August 2023. The 2024 AFC Futsal Asian Cup qualification was their first international competition. That was in October 2023. == Competitive record == === FIFA Futsal World Cup === FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record FIFA Futsal World Cup record Year Result Position 1989 – 2020 Did not enter 2024 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Total 0/1 0 0 0 0 0 0 0 === AFC Futsal Asian Cup === AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record AFC Futsal Asian Cup record Qualification record Qualification record Qualification record Qualification record Qualification record Qualification record Year Result Position 1999 – 2022 Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter 2024 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 3 0 0 3 10 17 Total 0/1 0 0 0 0 0 0 0 3 0 0 3 10 17 == Results and fixtures == === Overall results === Against M W D L GF GA GD Total 5 0 0 5 10 24 –14 == Players == Caps and goals are correct as of 14 August 2023, after the match against . == Related pages == * Sport in India Category:Asian national futsal teams Category:2023 establishments in India Category:Futsal in Asia Category:National sports teams",
 "title": "India national futsal team"
}