{
 "id": "1187473",
 "text": "The Pehuenche spiny-chest frog (Alsodes verrucosus) is a frog. It lives in Chile and Argentina. ==Home== The tadpoles and adults only live in or near streams that come from melted snow water. People see adult frogs in the forests right next to the streams and in high, watery meadows. The water in these places is clear with almost no acid and a lot of oxygen. Scientists have seen the frog between 2000 and 2500 meters above sea level. ==Young== The female frog lays eggs in balls with a jelly around them. Scientists say the eggs are hard to find. This animal spends four winters as a tadpole before growing legs and becoming a frog. Younger and older tadpoles live together in the same parts of the streams. The tadpoles grow during the summer, and stay under the ice during the winter. ==Danger== Scientists say this frog is in big danger of dying out. Human beings change the places where the frogs live, especially when people paved the Paso Pehuenche road. The streams next to the road dried and disappeared. People built puts to stop salt from the road from going into the streams, but then the frogs fell into the pits too. Human beings change the places where the frog lives. Bad chemicals from cars and other vehicles, human beings' animals, garbage from human visitors, and floods can all kill this frog. The animasl, for example cows and goats, step on the grass and pools. Climate change could kill this frog by changing the water in the places where the frogs live. Because this animals spends a long time as a tadpole, any big change in the water could kill many of them at the same time. Trout fish that people brought from other parts of the world can also hurt this frog. Scientists are not sure if the trout eat the tadpoles, the adult frogs, or both. In Chile, the fungal disease chytridiomycosis has killed many frogs and other animals that lay eggs in water, and it might kill this frog too. ==First paper== * ==References== Category:Frogs of South America",
 "title": "Alsodes pehuenche"
}