{
 "id": "118725",
 "text": "Maronites (; ) are a Christian ethnoreligious group* * * * * * * native to the Eastern Mediterranean and Levant region of West Asia, whose members traditionally belong to the Maronite Church, with the largest concentration long residing near Mount Lebanon in modern Lebanon. The Maronite Church is an Eastern Catholic particular church in full communion with the pope and the rest of the Catholic Church.Malone, Joseph J. The Arab Lands of Western Asia, Prentice-Hall, 1973, Page 7 The Maronites derive their name from Saint Maron, a Syriac Christian whose followers migrated to the area of Mount Lebanon from their previous place of residence around the area of Antioch, and established the nucleus of the Antiochene Syriac Maronite Church. Christianity in Lebanon has a long and continuous history. Biblical scriptures state that Peter and Paul evangelized the Phoenicians, whom they affiliated to the ancient patriarchate of Antioch. The spread of Christianity in Lebanon was very slow where paganism persisted, especially in the mountaintop strongholds of Mount Lebanon. During the 5th century AD, Saint Maron sent Abraham of Cyrrhus, often referred to as the Apostle of Lebanon, to convert the still significant pagan population of Lebanon to Christianity. The area's inhabitants renamed the Adonis River the Abraham River after Saint Abraham preached there. The early Maronites were Hellenized Semites, natives of Byzantine Syria who spoke Greek and Syriac, yet identified with the Greek-speaking populace of Constantinople and Antioch. They were able to maintain an independent status in Mount Lebanon and its coastline after the Muslim conquest of the Levant, keeping their Christian religion, and even their distinct Lebanese Aramaic as late as the 19th century. While Maronites identify primarily as native Lebanese of Maronite origin, some wish to identify as Arab Christians. Others identify as descendants of Phoenicians. Some Maronites argue that they are of Mardaite ancestry, and other historians, such as Clement Joseph David, Syriac Catholic archbishop of Damascus, reject this. Mass emigration to the Americas at the outset of the 20th century, famine during World War I that killed an estimated one third to one half of the population, the 1860 Mount Lebanon civil war and the Lebanese Civil War between 1975 and 1990 greatly decreased their numbers in the Levant; however Maronites today form more than one quarter of the total population of modern-day Lebanon. Though concentrated in Lebanon, Maronites also show presence in the neighboring Levant, as well as a significant part in the Lebanese diaspora in the Americas, Europe, Australia, and Africa. The Antiochene Syriac Maronite Church, under the patriarch of Antioch, has branches in nearly all countries where Maronite Christian communities live, in both the Levant and the Lebanese diaspora. The Maronites and the Druze founded modern Lebanon in Ottoman Lebanon in the early 18th century, through the ruling and social system known as the \"Maronite-Druze dualism\" in the Ottoman Mount Lebanon Mutasarrifate. All Lebanese presidents, with the exception of Charles Debbas and Petro Trad, have been Maronites as part of a continued tradition of the National Pact, by which the prime minister has historically been a Sunni Muslim and the speaker of the National Assembly has historically been a Shi'ite. ==Notes== ==References== Category:Eastern Catholicism Category:Organizations based in Lebanon Category:Religion in Lebanon",
 "title": "Maronite Church"
}