{
 "id": "1187583",
 "text": "Wing Commander Vyomika Singhis an officer in the Indian Air Force (IAF), serving as a helicopter pilot in the Flying Branch. She co-led the media briefing for Operation Sindoor in 2025, a military operation targeting terrorist infrastructure in Pakistan and Pakistan-occupied Kashmir (PoK), following the Pahalgam terror attack. ==Early life and education== Vyomika Singh was born in Lucknow. Her name \"Vyomika\" means \"dweller in the sky\" or \"daughter of the sky\" , which matches her career as a pilot. She participated in the National Cadet Corps (NCC) during her school and college days. Singh holds a Bachelor of Engineering degree in environmental engineering from Delhi Technological University (formerly DCE). She completed her training at the Air Force Academy at Dundigal, Hyderabad , after which she was commissioned into the Indian Air Force (IAF). ==Military career== ===Commissioning and initial service=== Singh was commissioned as a helicopter pilot into the flying branch of the Indian Air Force on 18 December 2004. She has accumulated over 2,500 flying hours, piloting Chetak and Cheetah helicopters in areas such as Jammu and Kashmir and Northeast India. Her early assignments included reconnaissance, troop transport and rescue missions. In November 2020, she led a rescue operation in Arunachal Pradesh, providing air support in remote areas. On 18 December 2019, Singh received a permanent commission in the flying branch, allowing her to continue serving in a long-term capacity. ==Operation Sindoor== On 7 May 2025, Singh held a detailed media briefing on Operation Sindoor along with Colonel Sofia Qureshi and Foreign Secretary Vikram Misri in New Delhi. ==Personal life== Singh was the first woman in her family to join the armed forces. In an interview with India Today, her parents Mr. RSNim and Mrs. Karuna Singh revealed that she is married to an officer of the Indian Air Force. She studied at St.Anthony Sr. Sec.School at Hauz Khas in New Delhi. She has 2 siblings- Bhumika Singh and Nirmika Singh. Her elder sister Bhumika Singh is a scientist in the UK. Her other sister Nirmika Singh is a poetess and an entrepreneur. All three sisters are alumnus from the same school. Her parents are retired teachers. Her father was a botany teacher. Her participation in the Mount Manirang expedition reflects her interest in mountaineering. ==References== == External links == Category:Living people",
 "title": "Vyomika Singh"
}