{
 "id": "1187197",
 "text": "After the 2025 Pahalgam attack, protests have been sparked around the world. These protests focused on a variety of issues related to the 2025 India–Pakistan conflict. == Pakistan == === Peshawar === On May 7th, 2025, following India's overnight airstrikes on Pakistan in response to assaults on Hindu tourists in Kashmir, numerous individuals began demonstrating against India in the streets of Peshawar. === Karachi === Numerous political parties in Pakistan gathered in Karachi to strongly condemn India's missile attacks that resulted in the deaths of 26 individuals and injuries to 57 others. === Islamabad === At the National University of Modern Languages (NUML) in Islamabad, a significant rally was organized against India by students and faculty members. === Lahore === A demonstration was arranged by the Pakistan Markazi Muslim League in Lahore, starting at Istanbul Chowk and making its way to the Punjab Assembly, accompanied by enthusiastic shouts of \"Pakistan Zindabad\" and \"Pak Army Zindabad.\" === Azad Jammu and Kashmir === On April 26, 2025, a large anti-India demonstration took place in Muzaffarabad, the capital of Pakistan-administered Kashmir, organized by Pasban-e-Hurriyat Jammu and Kashmir (PHJK). A separate public protest was conducted in Mirpur to express opposition to the cowardly Indian assaults on Pakistan and Azad Jammu and Kashmir. == India == === Delhi === More than five hundred people demonstrated in front of the Pakistan High Commission in Delhi after the terror attack in Pahalgam, calling for action against Pakistan. Participating social groups and the BJP called on the government to carry out another surgical strike. == Europe == === United Kingdom === Indian diaspora residents demonstrated against the Pahalgam terror attack on April 25, 2025, in front of the Pakistan High Commission in London. In response to the growing tensions between Pakistan and India, a number of British Pakistani demonstrators gathered in front of the Indian High Commission in London on May 3. In addition, following the nation's missile strikes on Pakistan on May 7th evening, British Pakistani demonstrators staged an outside demonstration outside the Indian Embassy in London on May 8. === France === Members of the Indian diaspora in France gathered in front of the Eiffel Tower to hold an anti-Pakistan protest. == Asia == === Bangladesh === A pro-Pakistani demonstration was staged in Bangladesh on May 6, 2025, following the attack in Pahalgam on April 22, 2025. == Americas == === United States === Members of the Indian diaspora gathered for a peaceful demonstration in Washington, DC, to honor the victims of the Pahalgam terrorist attack. == Religious groups == === Christianity === On May 5, 2025, the Christian community held a protest in Pakistan against India's misleading propaganda. === Sunni Muslims === Maulana Muhammad Ahmed Ludhianvi, the Chief of the Sunni Ulema Council (SUC) and Qaide Ahl-e-Sunnat, issued a warning during a rally that if India takes any action against Pakistan's security, the Council will fully support the Pakistan Army and respond with greater force than in the 1965 war. == Boycott == According to a statement from the Turkish presidency, Erdogan commended Pakistan's \"calm and restrained\" response to the crisis and expressed support for Islamabad's call for an investigation into the Pahalgam attack that killed 26 people on April 22.Azerbaijan also issued statements in support of Pakistan after India conducted Operation Sindoor. Due to these statements Indian citizen are calling for a boycott of Turkish Airlines and Azerbaijan due to their public support for Pakistan in the face of escalating Indo-Pak tensions. == References ==",
 "title": "Protests against the 2025 India-Pakistan conflict"
}