{
 "id": "1187908",
 "text": "The St. Petersburg–Tampa Airboat Line was the world's first scheduled airline, operating between St. Petersburg and Tampa, Florida, in 1914. * First Scheduled Airline: The St. Petersburg–Tampa Airboat Line is widely recognised as the first airline to offer scheduled passenger and commercial freight service. * Benoist Flying Boats: The airline used Benoist Type XIV flying boats, a type of biplane designed by Thomas Benoist. * Short-Lived, but Pivotal: The airline operated for a relatively short time, from January 1 to March 31, 1914, but its impact on aviation history is significant. * Early Air Cargo: One of the airline's Benoists also became the world's first air cargo flight when a Swift & Co. butcher in Tampa ordered meats to be delivered. * P.E. Fansler's Idea: The idea for the airline originated with P.E. Fansler, who was interested in flying after experimenting with speed boat racing. * Contract with the City: The city of St. Petersburg provided a subsidy to the airline, ensuring a schedule of two flights per day, six days a week, for three months. * First Passenger: The first paying passenger was former St. Petersburg Mayor A.C. Phiel, who paid $400 for the honor of being the first to fly on the airline. * Decline and Cessation of Operations: The St. Petersburg- Tampa Airboat Line's decline came from finance and limited customer interests causing its decline. * Significance: The St. Petersburg–Tampa Airboat Line marked the beginning of commercial air travel, demonstrating that planes could connect the people of the world. January 1, 1914: The first scheduled commercial flight took place, piloted by Tony Jannus, carrying passengers between St. Petersburg and Tampa. January 1 - March 31, 1914: The airline operated with a daily schedule, offering flights across Tampa Bay. March 31, 1914: The daily schedule was suspended due to the end of the tourist season. April - May 1914: The airline continued to offer flights on a reduced schedule and by request. May 5, 1914: The last flight took place. Total Flights: The airline made 172 flights, transporting 1,205 passengers. Total Miles Flown: The airline covered more than 11,000 miles (17,702 kilometres). == References ==",
 "title": "St. Petersburg-Tampa Airboat Line"
}