{
 "id": "1187019",
 "text": "Ilson de Jesus Montanari (Born, July 18, 1959) is a Brazilian catholic archbishop and theologian. ==Biography== ===Early years and education=== Born in the Brazilian city of Sert達ozinho, S達o Paulo State, in 1959, he studied Law and Economics at the University of Ribeir達o Preto and then moved to Rome, where he earned a degree in Theology from the Pontifical Gregorian University and also completed his ecclesiastical training. ===Priesthood=== He was ordained a priest on August 18, 1989, by Archbishop Arnaldo Ribeiro of Ribeir達o Preto. After being ordained a priest, he began working in various parishes in the archdiocese and was an educator in several seminaries. In 1993, he was appointed Rector and Coordinator of the Archdiocese's pastoral ministry. Years later, he returned to the Pontifical Gregorian University in Rome, where he earned a degree in Dogmatic Theology in 2004. In 2008, he became a member of the Congregation for Bishops, and on May 13, 2011, he was appointed Chaplain to His Holiness. ===Episcopate=== On October 12, 2013, Pope Francis appointed him Secretary of the Congregation for Bishops and at the same time appointed him Bishop of the titular Diocese of Capocilla, with the dignity of archbishop. He received episcopal consecration on November 7 of the same year from Archbishop Moacir Silva, with Cardinal Odilo Scherer and Archbishop Walmor Oliveira de Azevedo as co-consecrators. On January 28, 2014, Pope Francis appointed him Secretary of the College of Cardinals, and on May 1, 2020, Vice-Camerlengo of the Holy Roman Church. On October 11, 2018, he was confirmed as Secretary of the Congregation for Bishops, donec aliter provideatur. On April 14, 2020, he was appointed Vice-Camerlengo of the Holy Roman Church ad quinquennium. On May 3, 2022, he was appointed a member of the Congregation for Divine Worship and the Discipline of the Sacraments ad quinquennium. ==References== Category:Living people Category:1959 births Category:Brazilian Roman Catholic archbishops",
 "title": "Ilson de Jesus Montanari"
}