{
 "id": "1187722",
 "text": "Selahattin Demirtaş (born 10 April 1973) is an origin of Zaza politician, and author. He was the co-leader of the pro-Kurdish Peoples' Democratic Party (HDP) from 2014 to 2018. He was arrested on 4 November 2016. Selahattin Demirtaş left politics after the May 2023 elections. Selahattin Demirtaş was born in Palu in 1973. He completed his primary, secondary and high school education in Diyarbakır. He graduated from the Ankara University Faculty of Law. He worked as a self-employed lawyer. He was the head of the Diyarbakır branch of the Human Rights Association (IHD) in 2004, and worked with the Diyarbakır branch of International Amnesty Organization and founder of the Human Rights Foundation of Turkey. He became a member of parliament for Diyarbakır from the Democratic Society Party (DTP) in the 2007 Turkish general elections and served as the group deputy chairperson of his party. Following the closure of the party in 2009, he joined and was elected as the president of the Peace and Democracy Party (BDP) in 2010. He was elected as an MP for Hakkari in the 2011 Turkish general election. In 2014, he joined the Peoples' Democratic Party and was elected as the party's co-president. He ran as a candidate in the 2014 Turkish presidential election and came in third. He was elected as an MP for Istanbul in the June 2015 Turkish general election. He was detained and arrested on 4 November 2016. While in detention, he ran again as a candidate in the 2018 Turkish presidential election and came in third. Demirtaş remains in prison, despite decisions by the European Court of Human Rights in particular calling for his release. Demirtaş announced that he will retire from politics after the May 2023 elections. == Personal Life == Demirtaş is of Zaza origin and he knows the Zaza language. He told those who criticized him for not speaking the Zaza language fluently that the Turkish state was to blame. His parents are Tahir and Sadiye Demirtaş and he has six siblings. His mother is a housewife, his father had his own plumbing shop in Diyarbakır. He lost his father Tahir Demirtaş on December 31, 2023 at the age of 78. One of his brothers, Nurettin Demirtaş, was sentenced to 22 years in prison for Kurdish Worker' Party (PKK) membership when he was 22 years old and was released in 2004. Nurettin became the chairman of the Peace and Democracy Party (BDP) in 2007. Demirtaş is married to Başak Demirtaş and is the father of two girls, Delal and Dılda. == Political Career == === Diyarbakır Human Rights Association === After graduating from the Faculty of Law, he joined the Diyarbakır branch of the Human Rights Association (IHD) in 2000. During this period, he worked on many \"human rights violation\" cases. In 2004, he became the head of the Human Rights Association (IHD) in Diyarbakır. === Democratic Society Party === Selahattin Demirtaş was appointed as the group deputy chairperson in the Democratic Society Party (DTP), where his brother Nurettin Demirtaş rose rapidly and became first the deputy chairman and then the chairman in February 2007. After the closure of Democratic Society Party (DTP) in 2009, Selahattin joined the newly founded Peace and Democracy Party (BDP). === Peace and Democracy Party === After switching to Peace and Democracy Party (BDP), he was elected as the president of the party on February 1, 2010, receiving 288 out of 289 votes. In the 2011 elections, supported by his party and the Labor, Democracy and Freedom Bloc and was elected as a MP from Hakkari. === Solution Process 2013 === Demirtaş was the co-president of Peace and Democracy Party (BDP) during the period when the Solution Process and negotiations started in Turkey. He was one of the Peace and Democracy Party (BDP) politicians who met Öcalan on Imrali island during the peace negotiations. === Peoples' Democratic Party === In 2012, he acted together with the Peace and Democracy Party (BDP) cadres who switched to Peoples' Democratic Party (HDP), which aimed to form a broader political formation. He was elected as the Peoples' Democratic Party (HDP) co-president with Figen Yüksekdağ on June 22, 2014. While he was the co-president of the Peoples' Democratic Party (HDP), he was nominated by his party for the presidency in the 2014 presidential elections. He was nominated by his party as a candidate for Istanbul MP for the June 7, 2015 Turkish general elections. === 2014 Presidential Election === Selahattin Demirtaş, one of the 3 candidates who participated in the presidential election held for the first time in August 2014 through a referendum, came in 3rd place with 9.76% of the votes. Demirtaş criticized the state channel TRT for not giving him enough time during the election campaign. He expressed his criticism about the time TRT gave to the candidates during the election campaign by calling TRT as slave of Prime Minister Recep Tayyip Erdoğan which works for him. He also criticized Erdogan, who did not respond to his offer to face him on TV. === November 2015 general election === In August 2015, two months after the June 2015 general elections and one month after the return to military confrontation with the Kurdish Worker' Party (PKK), early general election were announced for November 2015. Peoples' Democratic Party (HDP), led by Demirtaş, came third, securing 10.7% of the vote, barely passing the parliament's 10% threshold. === Solution Process Collapse === In July 2015, the Solution Process initiated by Justice and Development Party (AKP) and Kurdish Workers' Party (PKK) leadership and facilitated by Peoples' Democratic Party (HDP) collapsed. Demirtaş attributes this collapse to Justice and Development Party (AKP), responding to the June election's vote loss to following parties, loss of its governing majority, and relative electoral defeat. According to Demirtaş, Justice and Development Party (AKP) bleeding votes in polls lead this party to reign the war against Kurdish Workers' Party (PKK). In July 2015, observing an increase in violence between Kurdish Workers' Party (PKK)-affiliated parties and Turkish authorities, Demirtaş opposed violence from both parties and called for a higher political autonomy in South-East Turkey. === 2016 to 2018 Presidential Campaign === In May 2016, the Turkish parliament revoked the parliamentary immunity for several Peoples' Democratic Party (HDP) member including the leadership. Following the 2016 Turkish coup d'état attempt, Demirtaş stated in his statement on 16 July that he was against the coup and that the attempt was an indication that there was still no democracy in Turkey. On July 25, Erdogan invite and met with major opposition leaders, except Peoples' Democratic Party (HDP) leadership and Demirtaş. On November 4, 2016, few months after the 2016 Turkish coup d'état attempt and in the mist of large-scale purges, Demirtaş was arrested along with Figen Yüksekdağ and other Peoples' Democratic Party (HDP)MPs, accused of spreading propaganda for militants fighting the Turkish state. Demirtaş stated that he was related to Kurdish Workers' Party (PKK). Demirtaş was officially announced as the candidate of the Peoples' Democratic Party (HDP) on May 4, 2018, for the presidential election, after members of the party had hinted at his candidacy weeks in advance. He received 8.4% of the votes. == ECHR's Judgments == On 20 November 2018 the European Court of Human Rights (ECHR) ruled Demirtaş should be released from preliminary detention, and ordered Turkey to pay him 25'000 Euros. On 30 November 2018 a court in Turkey ruled he shall remain detained despite the ECHR rulings to release him. According to the verdict by the Turkish court, the decisions of the ECHR were not definitive and therefore not binding. The sentence he received on 7 September 2018 was upheld on 4 December 2018 by an appeal court. On the 31 December 2018 the lawyers of Demirtaş appealed the sentence at the Constitutional Court. On December 22, 2020, the ECHR condemns Turkey and called again for the release of Selahattin Demirtaş. ECHR deemed the lifting of the immunity and the subsequent pre-trial detentions as politically motivated because this step came only after the governing Justice and Development Party (AKP) had lost its majority in parliament. ECHR called for releasing Demirtaş and stated that his arrest in 2016 violated his freedom of speech and the right of joining to the elections. == Publications == After he is prisoned he began to write books. Books of Demirtas: * Seher, Dipnot Yayınları, 2017 * Devran, İletişim Yayınları, 2019 * Leylan, Dipnot Yayınları, 2020 * Efsun, Dipnot Yayınları, 2021 * Dad, Dipnot Yayınları, 2023 * Arafta Düet, Dipnot Yayınları, 2024 * Onurlu Yaşam Davası, Dipnot Yayınları, 2024. == References ==",
 "title": "Selahattin Demirtaş"
}