{
 "id": "1187357",
 "text": "Canadian values are the common beliefs that most people in Canada agree on. Most Canadians accept that many different beliefs can exist together, which shows that Canadian society is open and ready to adapt. Some values are shared by almost everyone in Canada. These include freedom, being treated with worth, respect, equality, and the chance to succeed. These values help bring people together.Douglas Baer, Edward Grabb, and William Johnston, \"National character, regional culture, and the values of Canadians and Americans.\" Canadian Review of Sociology/Revue canadienne de sociologie 30.1 (1993): 13-36. Respect for others is a very important value in Canada. It is a big part of what makes Canada special. Except for Indigenous peoples, everyone in Canada comes from families who moved here from other places. Because of this, Canadian values come from many different life experiences and cultures. The Canadian government stands for the idea that the Constitution of Canada should help guide these values and beliefs. Each government supports the idea that people are part of the nation because they live and follow its laws, not because of their race (it relates to Civic nationalism). A 2016 Nanos survey showed that Canadians care a lot about things that protect their personal well-being and help society work better. The survey listed the following key values: * rights and freedoms * fairness and respect * kindness * valuing different cultures and languages * treating everyone fairly * fairness in law and society * honesty * good public services * living peacefully with others In the past, many Canadians believed it was important to quietly obey and accept the decisions made by people in power, and protect the working ways of government and economy in place. These beliefs came from old traditions passed down from the British Empire, and they stayed strong because people who lost in the American Revolutionary War and stayed loyal to Britain moved to Canada and kept those values alive. After the Second World War, people’s values started to change. More Canadians began to focus on fairness, equal rights, and peace, based on ideas of freedom and democracy. Canadians are also open to changing the rules in the Constitution if it helps them live better. Most people in Canada care more about their own well-being than about being part of one big national group. This can be seen in some places like Quebec, Alberta, and Saskatchewan. Some people in these provinces want to leave Canada and make their own country. Some want to join together as \"Western Canada.\" Others want to become part of the United States. In British Columbia, some people talk about making a new province called Khalistan. Canadians believe that education and healthcare are important, and they think the government should spend money on services that help people, make good plans, and start programs that benefit everyone. In general, there is strong support for public services funded by taxes because they help people do better, support communities, and build a better future. A 2025 survey by Nanos found that 38 percent of younger adults want Canada to spend less on foreign aid, while fewer older adults feel the same. This suggests that many young people would rather see tax money used to improve life in Canada before helping other countries. ==References== Category:Canada",
 "title": "Canadian values"
}