{
 "id": "1187267",
 "text": "Nobita Nobi (野比 のび太, Nobi Nobita) is one of the main characters from the Japanese multi-media franchise, Doraemon, he is a 10-year-old boy who was once a regular elementary school student, until Doraemon was sent to the past to change Nobita's terrible future being married to Jaiko Gouda (Takeshi Gouda's sister). (or in the 1973 series, help Nobita with his extremely unlucky life.) He (along with Doraemon) is considered to be one of the most popular characters in the franchise, though he has been heavily criticized (in countries such as India and Pakistan) for being a harmful role model to kids due to his behavior. == Personality == he is depicted as a lazy boy who is not good at anything, he dislikes reading books (except for manga). == Appearence == === 1973 anime === Nobita had the same hair style as the 1979 anime, but the only difference was that his shirt was red instead of yellow and that he was drawn differently and more accurately to the manga. === 1979 anime (1978 pilot only) === he is drawn similar of that to the 1979 anime, the only difference is that he wears a green shirt with short sleeves, brown pants, white socks and blue shoes. it seems that he and Suneo swapped colors in the final version of the pilot since Suneo is seen wearing yellow while Nobita is wearing green. === 1979 anime === He is drawn more differently than the 1973 anime, a significant change in the 1979 anime is that Nobita's shirt was changed from Red to yellow === 2005 anime === Nobita still looks the same as his 1979 counterpart, though he occasionally changes his clothes. == in other media == throughout the years of 2011 to 2016, the Japanese actor Satoshi Tsumabuki played a older version of Nobita in a series of Toyota ads depicting the human Doraemon characters as adults. He has also appeared in various educational manga along with other characters from the series. the series, Kiteretsu Daihyakka (another work by Fujiko Fujio)'s spanish, portuguese and catalan dubs have the name \"Kiteretsu: el primo mas listo de Nobita/Kiteretsu: el cosí més llest d'en Nobita/Kiteretsu, o primo listo de Nobita\" (English: Kiteretsu: Nobita's smarter cousin), despite the fact that Nobita nor anyone from the Doraemon series never appears in that series. == References == Category:Fictional characters introduced in 1969 Category:Anime characters",
 "title": "Nobita Nobi"
}