{
 "id": "1188153",
 "text": "Namiq Nariman oglu Salifov (born May 28, 1976 in the city of Dmanisi - Thief in law. == Life == Namik Salifov was born on May 28, 1976 in Dmanisi, Georgia, into a family of immigrants from Azerbaijan. In addition to him, the Salifov family had two more sons, among whom the elder brother Namik Nadir, whose explosive and fearless character was closely connected with the biography of his younger brother, stood out. What is known directly about Namig's childhood is that some time after his birth, the Salifov family left Georgia and returned to their historical homeland, Azerbaijan. It is now impossible to say for sure what prompted the youngest generation of this family to choose the path of criminal life. Perhaps this was influenced by the reputation of the aggressive older brother - Nadir Salifov, who at the age of 22 was known in his native Azerbaijan as Guli Bakinski or Lotu Guli and became one of the most dangerous young criminals in the republic. So, it seems that his younger brothers Namig and Mushfig could not stay away from his evil deeds. Of the two younger Salifovs, Namig Bakinski was the one who achieved particular success in this area, But the Salifov brothers could not remain unpunished for a long time - and already in 1996 Nadir and Namik were sent to the 1st pre-trial detention center of Baku, also called the \"Bayil prison\". By the way, Namik Rizhiy (Aliyev N. A.) was there at the same time. Little Mushfig was deprived of the fate of adults then, and he is now. In August 1996, events took place in Shuvalan SIZO-3, but they did not stay there for long — already in the last days of February 1996, they were transferred to Baku ITK-1 and there the verdict was announced. And as a result, in November 1996, the Supreme Court of Azerbaijan, having considered the case of Nadir and Namik Bakinsky, sentenced Lotan to 15 years in prison. According to calculations, he should have been released earlier than 2010, but later, in light of newly discovered cases, the court added another 16 years to him — and now Nadir was waiting for freedom of will only in 2021. And Namik suddenly turned 27 years old. == References == Category:1976 births Category:21st-century criminals Category:Russian people of Azerbaijani descent Category:Russian gangsters Category:Azerbaijani gangsters Category:People from Dmanisi Category:Georgian Azerbaijanis Read more on the Kompromat portal: https://m.kompromat1.pro/articles/140720-vor_v_zakone_namik_salifov__namik_bakinskij",
 "title": "Namiq Salifov"
}