{
 "id": "1188256",
 "text": "Dr. Arun Kumar Singh (born 2 August 1970) is an Indian politician from Bihar and a member of the Bharatiya Janata Party (BJP). He serves as a Member of the Bihar Legislative Assembly from the Baruraj Assembly constituency in Muzaffarpur district.https://affidavit.eci.gov.in/CandidateCustomFilter?electionType=9-AC- GENERAL-3-13&election;=9-AC-GENERAL-3-13&states;=S04&page;=428 ==Early life and family== Dr. Arun Kumar Singh was born on 2 August 1970 in Baburban, Muzaffarpur district, Bihar. He hails from a politically influential family. His father, the late Brij Kishor Singh, was an MLA from Baruraj (2010–2015).https://www.ndtv.com/elections/bihar-assembly-election- results-2020/baruraj ==Education== Dr. Singh is highly educated, holding a Doctorate (Ph.D.), a Master of Arts (M.A.), and a Master of Business Administration (MBA). He completed his higher education at Babasaheb Bhimrao Ambedkar University and LN Mishra College, Muzaffarpur. ==Political career== ===Grassroots Politics=== He started his political journey as a Ward Parishad (Ward Member) from 2002 to 2007 in Muzaffarpur, where he focused on road repairs, public sanitation, education, and welfare initiatives.https://www.bhaskar.com/local/bihar/muzaffarpur/news/baruraj-mla- raised-demand-to-open-police-op-in-sirsia-132652604.html ===2015 Bihar Assembly Election=== In the 2015 assembly elections, Dr. Singh contested from the Baruraj constituency as a BJP candidate but lost to Nand Kumar Rai of the Rashtriya Janata Dal by a narrow margin of 4,909 votes.https://www.ndtv.com/elections/bihar-assembly-election- results-2020/baruraj ===2020 Bihar Assembly Election=== In 2020, Dr. Singh contested again from Baruraj and defeated the same opponent with a remarkable margin of 43,654 votes, securing 51% of the total votes polled. He received 87,407 votes and marked a significant political turnaround in the region. ==Related pages== * Bharatiya Janata Party * Muzaffarpur district ==References== Category:1970 births Category:Living people Category:Bihari politicians",
 "title": "Arun Kumar Singh"
}