{
 "id": "1188898",
 "text": "Brunswick High School (BHS) is a public high school in Brunswick, Ohio. It is the only high school in the Brunswick City School District and the only high school in the city. BHS offers many classes, including ten Advanced Placement (AP) courses and honors classes in all subjects. The school also has many clubs, activities, and sports. As of 2015, BHS had about 2,500 students and 132 teachers. It is one of the largest high schools in Ohio by number of students. == Information == Brunswick High School's colors are royal blue and white. The mascot is the Blue Devil. BHS is part of the Greater Cleveland Conference. In the past, it was in the Pioneer Conference. === Sports === BHS has many sports teams, including: * Football * Soccer * Swimming * Gymnastics * Basketball * Baseball and Softball * Wrestling * Cheerleading * Track and Cross Country * Volleyball * Golf and Tennis * Hockey * Lacrosse * Bowling * Rugby === Band and Theater === The BHS band program is well-known. The marching band has earned Superior ratings at almost every Ohio Music Education Association (OMEA) state finals for the last 18 years. In 2020, the BHS marching band was invited to perform in the London New Year's Day Parade by the Deputy Lord Mayor of Westminster. === School Building === The school is one story and has three main areas: * West House (mostly freshmen) * Center House (all students) * East House (sophomores, juniors, seniors) There are two gyms and two cafeterias. In 2011, the East gym floor was replaced after water damage. Behind the school, there is a turf field with a 1/4-mile track, used for sports like football, soccer, rugby, and lacrosse. There is also a baseball field. In 2008, shop classes (auto, metal, wood) were removed and turned into computer labs. Technology classes are mostly in the West House. Foreign language classes are in the Center House. The East House has an art wing with four art rooms. The school has eight computer labs. The student center no longer functions as a library. Instead, it is used as a study area with internet access. It also connects to the University of Akron for distance learning. === Technology === In 2010, every classroom received a SMART Board and teachers got HP ProBook laptops. Security cameras and magnetic locks were added in 2011. Wi-Fi was also installed for student computers. Some classes no longer use paper textbooks, especially in math. Students use MacBook Air laptops for classwork. == Championships == BHS has won state championships in: * Boys Track and Field – 1998 * Boys Cross Country – 1999 * Girls Softball – 1986 * Girls Cross Country – 2011 * Boys Rugby – 2017, 2018 == Notable alumni == * Clay Pickering, former NFL wide receiver (transferred after junior year) == External links == * Brunswick City Schools official website Category:High schools in Medina County, Ohio Category:Public high schools in Ohio Category:Education in Medina County, Ohio",
 "title": "Brunswick High School (Ohio)"
}