{
 "id": "1188651",
 "text": "The Scottish Professional Football League (SPFL) is the national men's association football league in Scotland. The league was formed after the merger of the Scottish Premier League and the Scottish Football League in June 2013. The league consists of the top four levels of the Scottish football, the Scottish Premiership, Scottish Championship, Scottish League One and Scottish League Two. The league also operates two cup competitions, the Scottish League Cup and the Scottish Challenge Cup. The Scottish Cup includes all the teams within the SPFL, but it's is run and organised by the Scottish Football Association (SFA). ==Champions== Season Premiership Championship League One League Two 2013–14 Celtic Dundee Rangers Peterhead 2014–15 Celtic (2) Heart of Midlothian Greenock Morton Albion Rovers 2015–16 Celtic (3) Rangers Dunfermline Athletic East Fife 2016–17 Celtic (4) Hibernian Livingston Arbroath 2017–18 Celtic (5) St Mirren Ayr United Montrose 2018–19 Celtic (6) Ross County Arbroath Peterhead (2) 2019–20 Celtic (7) Dundee United Raith Rovers Cove Rangers 2020–21 Rangers Heart of Midlothian (2) Partick Thistle Queen's Park 2021–22 Celtic (8) Kilmarnock Cove Rangers Kelty Hearts 2022–23 Celtic (9) Dundee (2) Dunfermline Athletic (2) Stirling Albion 2023–24 Celtic (10) Dundee United (2) Falkirk Stenhousemuir 2024–25 Celtic (11) Falkirk Arbroath (2) Peterhead (3) ==Promotion/relegation play-off winners== Clubs in bold are those who were promoted from the lower to the higher tier. Season Premiership / Championship Championship / League One League One / League Two League Two / Regional Leagues 2013–14 Hamilton Academical Cowdenbeath Stirling Albion 2014–15 Motherwell Alloa Athletic Stenhousemuir Montrose 2015–16 Kilmarnock Ayr United Queen's Park Edinburgh City L 2016–17 Hamilton Academical Brechin City Forfar Athletic Cowdenbeath 2017–18 Livingston Alloa Athletic Stenhousemuir Cowdenbeath 2018–19 St Mirren Queen of the South Clyde Cove Rangers H 2019–20 2020–21 Dundee Greenock Morton Dumbarton Kelty Hearts L 2021–22 St Johnstone Queen's Park Edinburgh City Bonnyrigg Rose L 2022–23 Ross County Airdrieonians Annan Athletic The Spartans L 2023–24 Ross County Hamilton Academical Dumbarton Stranraer 2024–25 Livingston Airdrieonians East Fife East Kilbride L :H Club promoted from the Highland Football League. :L Club promoted from the Lowland Football League. ==Notes== ==References== ==External links== * Official website Category:Scottish Football League",
 "title": "Scottish Professional Football League"
}