{
 "id": "1188309",
 "text": "Ronald Charles Clark (28 April 1914 – 12 June 2000) was a British biologist, linguist, and educator best known for his role in developing and promoting Glosa, a simplified international auxiliary language derived from Interglossa, originally created by Lancelot Hogben. Clark’s later collaboration with Wendy AshbyGlosa Education Organisation (GEO) (2006). History behind Glosa. (pdf) , p. 7. was central to transforming Glosa into a practical and accessible tool for international communication and education. == Biography == === Early life and education === Ronald Clark was born in St. Pancras, London, to Lilian and Charles Clark. His father, an engineer with Marconi, died in France during World War I while serving as a frontline radio operator, leaving Ron to be raised solely by his pacifist mother, who never remarried. Growing up in Hampstead, Clark received a strong education and developed an early love of classical and jazz music. He attended Marylebone Grammar School and later earned a scholarship to study at the University of London. He specialized in mathematics, biology, medicine, and the sciences, while also learning Russian, German, and French to aid communication during travels. === Scientific and personal interests === Clark was an avid biologist with a particular interest in mycology and freshwater ecosystems. He spent much of his time studying fungi, insects, and aquatic life in rural England, often using microscopy and photography to document his findings. He also developed a passion for winemaking and home-brewing as both a scientific and culinary hobby. Ron and his mother later moved to the countryside in Shaftesbury, Wiltshire, where they maintained a smallholding with dairy cows, chickens, and bees. They traveled regularly to France, especially the Côte d’Azur, and developed many friendships with international visitors. == Involvement with artificial language creation == === Discovery of Interglossa === In the late 1960s, Clark came across a reference in The Daily Telegraph to Lancelot Hogben’s 1943 book, Interglossa: A Draft of an Auxiliary for a Democratic World Order. Fascinated by the idea of a logical, international auxiliary language, Clark acquired the book and soon corresponded with Hogben directly. Although Hogben’s health prevented deeper collaboration, he encouraged Clark’s efforts to revise and expand the language. === Development of Glosa === Clark took up the challenge of continuing Hogben’s work, eventually naming the modernized version Glosa. Working initially alone and later with collaborator Wendy Ashby, he simplified the grammar, expanded the vocabulary, and produced a wide range of educational materials to support language learners. In the 1980s, Clark co-founded the Glosa Education Organisation (GEO) with Ashby, aiming to promote Glosa globally. They published textbooks, dictionaries, and newsletters, and held regular community meetings and language classes in the UK, including in Mudeford, Hampstead, and Richmond upon Thames. === Collaboration with Wendy Ashby === Wendy Ashby became an essential collaborator in the promotion and development of Glosa. Together, they authored numerous publications, including \"Glosa 6000\", and \"Glosa Dictionary\", which presented the language's vocabulary and structure in an accessible form. Ashby also played a key role in establishing the Glosa Education Organisation and producing educational outreach materials, including the long-running Glosa newsletter PGN. == Later life and legacy == In his later years, Clark continued teaching and promoting Glosa, traveling as far as Italy and maintaining international contacts with Glosa advocates in France, Uganda, and the Netherlands. He remained intellectually active and deeply committed to educational outreach, botany, and museum visits until his death. Clark passed away on 12 June 2000 at the age of 86. His legacy lives on through the continued use and development of Glosa, particularly through the efforts of Wendy Ashby and other language activists. == Works == * Ashby, Wendy & Clark, Ronald: Glosa 6000: 6000 Greek and Latin words and roots which occur in the Euro-languages and international scientific terminology. London: 1983 (48 p.) * Ashby, Wendy & Clark, Ronald: Glosa 1000. Richmond: Glosa, 1984 * Ashby, Wendy & Clark, Ronald: Basic dictionary of the international language Glosa. Richmond [Surrey]: Glosa, 1987 (44 p.) History of the GID (The Glosa Internet Dictionary/ Glosa Inter-reti Diktionaria). * Ashby, Wendy: 18 steps to fluency in Euro-Glosa. Glosa, 1989 (2nde edition) * Ashby, Wendy & Clark, Ronald: Introducing Euro-Glosa. Richmond: Glosa, 1990 (36 p.) == See also == * Glosa (auxiliary language) * Interglossa * Constructed language * Lancelot Hogben * Mathilde ter Heijne == References == Category:1914 births Category:2000 deaths Category:Glosa",
 "title": "Ronald Clark"
}