{
 "id": "1188932",
 "text": "The oldest remains found in Syria, are from the Palaeolithic era (c.800,000 BCE). ==History== ===Before 20th century=== It was a land of Phoenicians, which then became part of the Achaemenid Empire, Roman Empire, and then the Eastern Roman Empire. In those days people in Syria spoke the Syriac language and used the Syriac alphabet, while the Syrian city Antioch was one of the important cities in Christendom. ====Islamization==== The Rashidun Caliphate took over Syria from the Eastern Roman Empire in the 6th century. Most of the indigenous population converted to Islam and adopted the Arabic language. The region then became an important province of the subsequent Muslim empires under the name of Bilād ash-Shām. * * * * * ===20th century=== When World War I started, the Ottoman Empire ruled Syria and many other places. When it ended, France controlled Lebanon and Syria. Britain had Iraq, Jordan and Palestine. They drew a border between Iraq and Syria in 1920. France controlled Syria until 1946 when Syria became its own country. ====Cold War==== Syria was part of the United Arab Republic with Egypt between 1958 and 1961. Syria fought some wars with Israel. Its former territory Golan Heights has been governed by Israel since 1967. * * * Meanwhile, the Ba'athist party seized power with a coup in 1963 to establish a junta. * * * * * * * * * * In 1970, Hafiz al-Assad, the father of Bashar al-Assad, took over with another coup and turned the Ba'athist Syrian state into a dynastic totalitarian state, featured by systematic oppression and widespread human rights abuses, which was passed on to Bashar when Hafiz passed away in 2000. ===21st century=== Most Syrians believe in Islam, while an ethnoreligious Christian minority, called the Syriac Christians, exists. * * * * * ====2010s==== In 2011, anti- regime protests were brutally suppressed by President Bashar al-Assad, sparking off a civil war against Assad. Assad went on to commit countless atrocities against Syrians, including massacres, starving sieges * * * * * and chemical attacks, * * * * * * * * * * which killed over 400,000 Syrians. Amid the war, the Kurds took over a sizeable part of northern Syria, namely the Rojava. * * * * * In 2016, Assad regained most of Syria with the superior firepower of Russia and Iran. * * * * * ====2020s==== A myriad of factors, including the COVID-19 pandemic * * * and pro-Russian Western leftist opposition to NATO intervention, * * * * * * * * * * had made the civil war a frozen conflict for several years until December 2024. * * * * * In December 2024, regrouped rebel forces launched large-scale multi-pronged offensives amid weakened local Russian and Iranian military presence, * * * * * reportedly due to the countries' respective involvement in the invasion of Ukraine and conflict with Israel. Aleppo, Homs and Daraa, * * * * * three of the largest Syrian cities, fell to the rebels within a week, who also encircled Syria's capital Damascus. * * * * * ===Fall of Ba'athist rule=== On December 8, 2024, Bashar al-Assad fled the capital as the rebels stormed in. * * * * * Assad's protecting power Russia claimed that Assad had left Syria * * * * * for Moscow. * * * * * Rebels inside the capital announced the end of the six-decade Ba'athist rule in Syria. * * * * * ===Transitional government=== The united opposition announced that Mohammed al-Bashir, a previous leader of the provisional Salvation Government in Turkish-controlled northwest Syria, was named as the head of the transitional government, expected to serve until March 2025. * * * * * ===Israeli invasion (since December 2024)=== An Israeli invasion has been going on since December 8, 2024. On that day, the Syrian Army (left or) abandoned its positions along the Purple Line (a buffer area). Israel then invaded the buffer zone between Syria and the Israeli-occupied Golan Heights. Israeli forces continued into Syria. Places (in Syria) with military equipment of the Syrian Army, were bombed from the air. As of 2025's first quarter, Israeli forces control some Syrian settlements along the border. Israel has built outposts and military bases within the Purple Line (or the UNDOF buffer area); Near Jubata al-Khashab (map) and surrounding villages, that happened (February 2025). == Foreign relations == Under the Ba'athist rule, diplomatic relations broke up with several countries, including Turkey, Canada, France, Australia, New Zealand, Sweden, Denmark, the Netherlands, Germany, the United States, the United Kingdom, Belgium, Spain, Mexico, Qatar, Georgia, and Ukraine. In 2011 and 2012, Syria was suspended from the Organisation of Islamic Cooperation, Union for the Mediterranean and the Arab League. ==References== Category:Syria",
 "title": "History of Syria"
}