{
 "id": "1188133",
 "text": "Veer Tejaji (29 January 1074 - 28 August 1103) “ As per historians, he was born on Friday, Magha Shukla 14 samvat 1130 (29 January 1074). also known as Tejaji Maharaj, or simply Tejaji, was a great warrior, social reformer, cow protector and folk-deity in Rajasthan. In rural parts of northern Rajasthan, he is revered as a deity and is considered to be one of Lord Shiva's eleven primary incarnations. “ Teja is considered to be one of the eleven incarnations of Lord Shiva and worshipped as a deity in rural Rajasthan. Devotees sang and danced to the sounds of drums and instruments, holding snakes in their hands and receiving their bites. It is believed that the snake bites cures ailments and bring good fortune.” He is mainly worshipped in the states of Rajasthan, Madhya Pradesh, Haryana, Uttar Pradesh, and Gujarat. “ वीर तेजाजी को भगवान शिव का ग्यारहवां अवतार माना जाता है. राजस्थान, मध्यप्रदेश, गुजरात, उत्तर प्रदेश, हरियाणा और अन्य राज्यों में इन्हें लोक देवता के रूप में पूजा जाता है.” He is commonly known as the God of Snakes in Rajasthan, because it protect against snake bites or also worshipped as Dhauliya Veer. “ Veer Teja or Tejaji was a legendary Rajasthani folk hero, also considered to be one of the major eleven incarnations of Lord Shiva and worshipped as a deity in rural Rajasthan.” ==Early life== Veer Tejaji was born on 29 January 1074, in the family of Tahar Dev, a Dhauliya Jat, chieftain in Kharnal, Nagaur and Ram Kunwari in Kharnal village of Nagaur district in Rajasthan. “ Veer Teja or Satyavadi Veer Tejaji is a Rajasthani folk deity. Its history says that Kanwar Tejaji ji is considered to be the eleventh incarnation of Lord Shiva and he was born in Dholiya gotra of Nagvanshiya Jat.” As per the historians, it is believed that Ram Kunwari, Tejaji mother, got a boon from Nagaraja and gave birth to a baby named, Teja Ji. His parents were worshippers of Lord Shiva. “राजस्थान में नागौर जिले के खरनालियां गांव में तेजाजी का जन्म हुआ था. नागवंशी क्षत्रिय जाट घराने के एक जाट परिवार में जन्मे वीर तेजाजी सामान्य किसान के बेटे थे. तेजाजी के पिता ताहड़ देव और माता रामकंवरी भगवान शिव के उपासक थे. मान्यता है कि माता रामकंवरी को नाग-देवता के आशीर्वाद से पुत्र की प्राप्ति हुई थी.” == Story == === Halsotia: The Sacred Duty === In the rural heartland of Rajasthan, tradition dictated that the chieftain Tejaji, must initiate the plowing of fields after the first monsoon rains in the month of Jyestha. This ritual, known as “halsotia,” held immense significance. Tejaji embraced this duty with unwavering determination, ready to turn the soil and honor age-old customs. === Bhabhi’s Taunts and the Quest for Pemal === Tejaji’s mother urged him to perform the ploughing, known as Halsotia, because his father and brother were out of village due to some work. So,Tejaji started ploughing his fields and his sister-in-law was responsible for bringing him food in fields during ploughing (locally known as “Chhak”), one day she arrived late. Frustrated, Tejaji’s anger flared when she taunted him about his wife’s absence- Pemal (Tejaji wife) was still at her father’s home. Determined to rectify this perceived shame, Tejaji resolved to retrieve his wife from her in-laws’ abode. Before bringing Pemal back, Tejaji faced another task: reuniting with his sister, Rajal. Pemal had requested that Rajal be there to welcome her. === War with Meenas === When Tejaji was on his way to bring his sister, Rajal back he encountered some meena dacoits. In fight Tejaji emerged victorious and proceeded to Tabiji, Ajmer, securing permission from his sister’s husband, to bring Rajal back to Kharnal. === Journey to Paner === When Tejaji arrived at his in-laws house, he found his mother-in-law was busy in milking cows. His entry on his leelan mare startled the animals, disrupting their peaceful routine. Unfortunately, his mother-in-law failed to recognize him because Tejaji was married to Pemal when he was only nine months old. Tejaji's mother-in-law gave Tejaji a curse that he would be bitten by a black snake for disturbing her cows. Tejaji’s anger flared, and he decided to return to Kharnal without Pemal. However, Pemal was upset by her mother's reaction and requested that her father and brother stop Tejaji. Lachha Gujari, Pemal’s friend, stepped forward and shared the story of Pemal’s suffering to Tejaji. Then Tejaji stayed at Lachha’s Gujari house, where he met Pemal for the first time. === Lachha Cows Incident === When Tejaji and Pemal are talking to each other at Lachha House, a knock is echoed by Lachha Gujari. Lachha urgently informed Tejaji that the Meenas from Chang had stolen all her cows and requested help from Tejaji. Without hesitation, Tejaji mounted his Leelan and rode off alone to confront the dacoits who had taken Lachha's cows. When Tejaji was on his way to confront the dacaits, Basak Naag, a snake, was burning in the fire, and Tejaji saved him from burning. That snake cursed and wanted to bite him. Tejaji assured that he would come back after taking Lachha cows back.After that, Tejaji fought with the Meenas in the valley of Chang, about 15 km from Sursura. He killed all 350 Meenas in the fight and got back the cows of Lachha Gujari. === Death of Teja Ji === Tejaji, after returning cows to Lachha, produced himself before Basak Naga, the snake, and asked the snake to bite his body. Basak Naga did not find any unwounded places on Tejaji's body, and then Tejaji asked him to bite on his tongue. Basak Naga gave a boon to Tejaji that he will be a deity of Kalyug and will be worshipped. That’s why Tejaji is also called a man of words. Tejaji died on Bhadrapada Shukla Dashmi Saturday, V.S. 1160, or 28 August 1103 at the age of 29. The date of the martyrdom of Tejaji is celebrated as Teja Dashmi. Tejaji is also known as God of Snakes, because of this when anyone gets bitten by snake, then there are rituals to visit Tejaji temple and seek blessings from Tejaji. Apart from being called as God of Snakes, Tejaji was also a great protector of cows. “ गायों की रक्षा को दी प्राणों की आहुति: इतिहासकार घनश्याम मुंडेल बताते हैं कि सर्पदंश के कारण लोक देवता तेजाजी महाराज की मृत्यु हुई थी. तेजाजी महाराज बचपन से ही बहादुर थे. एक बार की बात है जब तेजाजी महाराज अपनी बहन को लेने उनके ससुराल पहुंचे तो पता चला कि दस्यु गिरोह उनकी बहन की सारी गायों को लूटकर ले गए. जिसके बाद तेजाजी महाराज अपने एक साथी के साथ जंगलों में बहन की गायों को छुड़ाने के लिए निकल गए. इस दौरान बीच रास्ते में एक सांप तेजाजी के घोड़े के सामने आ गया और उन्हें डसने की कोशिश करने लगा. यह देख तेजाजी ने उस सांप को वचन दिया कि जब वो अपनी बहन की गायों को छुड़ाकर आएंगे तब वो उन्हें डस ले. तेजाजी का वचन सुनकर सांप उनके रास्ते से हट गया” ==Commemoration== In Rajasthan and Madhya Pradesh, Teja Dashami is celebrated on the Dashami Tithi (tenth day), Shukla Paksha (bright phase of the Moon) in the month of Bhadrapada. The festival commemorates the greatness of Teja Ji Maharaj, and the sacrifice he made to honour his words. Today, on Teja Dashami, know more about Teja Ji Maharaj, who is worshipped by his devotees and hailed as a nobleman. He is believed to be eleventh incarnation of Lord Shiva. In September 2011, India Post released a commemorative stamp depicting Tejaji.Rajasthan Voice: Thursday, September 8, 2011, Special postage stamp released on Folk deity Veer Teja Rajasthan Government has constituted Rajasthan State Veer Tejaji Welfare Board for farmers. The board will have seven members including the chairman and vice-chairman. According to the officials, the board will aim to take stock of the condition of the farmers’ society and suggest measures to remove the backwardness of the farmers. A Rajasthani language movie titled Veer Tejaji, based on the life of Tejaji was made in the 1980s. In November 2023, Prime Minister Narendra Modi visited Tejaji Temple in Kharnal village, Nagaur, Rajasthan.PM Modi performs Darshan and Pooja at Veer Tejaji Temple, Kharnal, Rajasthan == Personal life == Tejaji married Pemal, daughter of Raimal, chieftain of Paner village in the Ajmer district of Rajasthan. He was just nine months old at the time of marriage, while Pemal was six months old, and they got married at Pushkar Ghat on Pushkar Purnima in 1074. His wife, Pemal, and his sister, Rajal, practiced sati pratha when Tejaji sacrificed his life for cows. ==Gallery== This section includes pictures of some temples dedicated to Veer Tejaji. File:Tejaji Temple Kharnal.JPG|Tejaji temple at Kharnal, Nagaur, Rajasthan File:Tejaji's marriage.JPG|Painting depicting Tejaji's marriage in Pushkar, Rajasthan File:Tejaji Mandir Sursura.JPG|Teja Dham at his death place in Sursura, Ajmer File:Tejaji Temple at Palot village.jpg|Tejaji temple at Palot village == See also == *Kharnal - Tejaji birth place *Paner - Tejaji marriage place *Sursura - Tejaji samadhi place ==Further reading== * Madan Meena: Tejaji Gatha (Hadoti & Hindi), Kota Heritage Society, Kota, 2012 (Published under the World Oral Literature Project, University of Cambridge, UK) ==References==",
 "title": "Veer Teja"
}