{
 "id": "1188128",
 "text": "Hanuman Beniwal (born on 2 March 1972) is an Indian politician, farmer leader, and founder of the Rashtriya Loktantrik Party (RLP), known for championing farmers' rights and opposing corruption. Representing Nagaur as a Member of Parliament since 2019, he has also served four terms as an MLA from Khinwsar in the Rajasthan Legislative Assembly since 2008. A former student leader and Bharatiya Janata Party member, Beniwal formed the RLP in 2018 after breaking ties with the BJP, later gaining prominence for his role in the 2020 farmers' protests and his swift action during a 2023 Lok Sabha security breach. Belonging to the Nagaur district of Rajasthan state, he was born to Ramdev Beniwal, a two-term Rajasthan MLA, and Mohini Devi. Beniwal earned a Bachelor of Arts in 1993 and a Bachelor of Laws in 1998 from the University of Rajasthan, where he began his political journey in student politics, becoming president of the Rajasthan University Student Union in 1997. Initially joining the Bharatiya Janata Party (BJP), he won the Khinwsar Assembly seat in 2008, but left the BJP in 2013 after alleging corruption by senior leaders, including Vasundhara Raje and Rajendra Rathore, leading to his suspension and eventual formation of the RLP in 2018. As an Independent, he won Khinwsar again in 2013, followed by victories as an RLP candidate in 2018 and 2023, securing four consecutive terms as an MLA. Entering national politics, he contested the 2014 Lok Sabha election from Nagaur as an Independent but lost, later winning the seat in 2019 in alliance with the BJP-led NDA and again in 2024 with the Congress-led INDIA bloc, defeating Congress’s Jyoti Mirdha both times. A vocal advocate for farmers, Beniwal resigned from three parliamentary committees and ended his NDA alliance in 2020 to support the farmers’ protests against controversial farm laws, mobilizing rallies in Rajasthan’s Shekhawati and Nagaur regions. In 2025, he led protests demanding the cancellation of Rajasthan’s Sub-Inspector recruitment exam due to a paper leak, organizing sit-ins and calling for a CBI probe, with his supporters briefly detained during a 2025 march. During a 2023 Lok Sabha security breach, Beniwal heroically subdued an intruder alongside other MPs, earning praise for his quick action. His RLP, a regional force, won three seats in the 2018 Rajasthan Assembly elections but only one in 2023. Married to Kanika in 2009, the couple has two children, Ashutosh and Diya, and Beniwal is a devoted follower of Rajasthan’s folk hero-deity Veer Teja. == References == Category:1972 births Category:Living people Category:Rajasthani politicians",
 "title": "Hanuman Beniwal"
}