{
 "id": "1188300",
 "text": "Narpinder Singh (born 19 September 1962) is an Indian food scientist, academic, and researcher. He is known for his contributions to food science and technology, particularly in the areas of starch and protein chemistry. He currently serves as the vice chancellor of Graphic Era University, a position he has held since transitioning from a distinguished career at Guru Nanak Dev University (GNDU) in Amritsar, Punjab. Singh is recognised for his research, which has garnered over 33,000 citations and is the most cited researcher from India in food science. == Early life and education == Singh was born on 19 September 1962 in Amritsar, Punjab, India. He pursued his higher education at Punjab Agricultural University (PAU) in Ludhiana, earning a Bachelor of Science in Agriculture with a specialisation in Food Science, Technology, and Nutrition in 1982, then a Master of Science in Food Technology in 1984. He completed his Ph.D. in Food Technology at Punjab Agricultural University in 1989, supported by a University Grants Commission (UGC) research fellowship during his doctoral studies. == Academic and research career == Singh began his academic career as an assistant professor in the department of food science and technology at Punjab Agricultural University in 1988. In 1993, he joined Guru Nanak Dev University as a reader, where he played a role in establishing the M.Sc. program in Food Technology. He was promoted to professor in 2000 and later served as head of the department of Food Science and Technology from 1997–2000, 2001–2004, and again from 2018 onward. During his tenure at Guru Nanak Dev University, he also held administrative roles, including director of research, dean of applied sciences, and coordinator of the UGC-special assistance program. Singh has held visiting professorships internationally, including at the Institute of food research in the UK (1995–1996), Osaka City University in Japan (2004–2005), Kansas State University in the USA, and South China University of Technology in Guangzhou, China (2019). Singh’s research primarily focuses on starch and protein chemistry, extruded products, modified starches, baked goods, cereal and legume quality, and gluten-free product development. He has conducted studies on the structure-function relationships of starches from various crops, including potato, corn, rice, wheat, and pulses, using advanced analytical techniques. In Singh’s academic career, with over 420 publications, including 323 research papers, 43 review articles, and two books - one published by the Royal Society of Chemistry and another by Springer Publishing. He has an h-index of more than 90 and over 33,000 citations, making him the most cited scientist in agricultural and food sciences from India. == Awards == Singh has received numerous accolades for his contributions to science and education. Notable awards include: * J.C. Bose National Fellowship (2011–present), awarded by the Department of Science and Technology (India) * Rafi Ahmed Kidwai Award (2010), from the Indian Council of Agricultural Research for outstanding contributions to natural resource management and agricultural engineering. * Professor Krishna Sahai Bilgrami Memorial Medal (2021), by the Indian National Science Academy. * Professor Priyadaranjan Ray Memorial Award (2023), by the Indian Chemical Society. * INSA Young Scientist Medal (1993), recognising his early career achievements. * Excellence in Carbohydrate Research Award (2016), from the Association of Carbohydrate Chemists & Technologists, India. * Indian Research Excellence–Citations Award in Agricultural Sciences (2019), by Web of Science. Singh is a fellow of several prestigious academies, including the Indian National Science Academy (2010), the National Academy of Sciences, India (2011), the National Academy of Agricultural Sciences (2005), the Royal Society of Chemistry (2022), and the Cereals & Grains Association (2019). == References ==",
 "title": "Narpinder Singh"
}