{
 "id": "1188261",
 "text": "The Eugeneodontiformes are an order of prehistoric cartilaginous fishes commonly known as the Eugeneodonts. They are renowned for having unique circular saw-like structures called tooth whorls on the symphysis of either the lower or both jaws. The palatoquadrate was either fused to the skull or reduced. Now belonging within the Holocephali, their closest living relatives are the chimaeras. They probably lacked pelvic and anal fins. Some eugeneodonts in the superfamily Edestoidea were probably the biggest marine creatures of their time, with the famous Pennsylvanian Edestus estimated to reach about or exceed 6.7 metres (22 ft) in length, with some Helicoprion from the Cisuralian epoch suggested to be over 7.6 metres (25 ft) long, according to some estimates. == Taxonomy == * Superfamily Caseodontoidea ** Family Caseodontidae *** Genus Caseodus *** Genus Erikodus *** Genus Fadenia *** Genus Ornithoprion *** Genus Pirodus *** Genus Romerodus ** Family Eugeneodontidae *** Genus Bobbodus *** Genus Eugeneodus *** Genus Gilliodus ** Family incertae sedis *** Genus Campodus *** Genus Chiastodus *** Genus Tiaraju * Superfamily Edestoidea ** Family Helicoprionidae *** Genus Agassizodus *** Genus Arpagodus *** Genus Campyloprion *** Genus Helicoprion *** Genus Parahelicoprion *** Genus Sarcoprion *** Genus Sinohelicoprion *** Genus Toxoprion ** Family Edestidae *** Genus Edestus *** Genus Helicampodus *** Genus Lestrodus *** Genus Parahelicampodus *** Genus Syntomodus *** Genus Protopirata *** Genus Prospiraxis *** Genus Spiraxis *** Genus Metaxyacanthus ** Family incertae sedis *** Genus Paredestus == Some genera == === Helicoprion === Helicoprion is perhaps the most iconic eugeneodont. It is from the family Helicoprionidae and is known for its famous tooth whorls which are situated on the lower jaw. H. bessonowi is the first species of this genus to be described from complete tooth whorls, demonstrating that Helicoprion is distinct from Edestus. === Edestus === Edestus is another famous eugeneodont of the family Edestidae. Just like Helicoprion, it had tooth whorls. The largest species, E. heinrichi, is estimated to have reached greater than 6.7 m (22 ft) in length, around the size of the largest known great white shark, possibly making it the largest marine predator to have ever existed up to that point. === Fadenia === Fadenia was another type of eugenodont from the family Caseodontidae. It is known from the Carboniferous Period of Missouri (United States), Permian period of Greenland, and the Early Triassic epoch of British Columbia, Canada (Sulphur Mountain Formation). == Gallery == File:Romerodus.png|Romerodus File:Caseodus2.jpg|Caseodus File:Campodus sp.jpg|Campodus File:Ornithoprion skeletal.png|Ornithoprion File:Helicampodus kokeni.jpg|Helicampodus == References == == Other websites == Category:Cartilaginous fish",
 "title": "Eugeneodontiformes"
}