{
 "id": "1188278",
 "text": "Wendy Ashby (1950-2015Wendy Ashby 1953-2015) was a British linguist and co- developer of the constructed international auxiliary language Glosa, which she developed in collaboration with Ron Clark.Glosa Education Organisation (GEO) (2006). History behind Glosa. (pdf) , p. 7. She is recognized for her contributions to simplified, culturally neutral communication systems and her efforts to promote Glosa as an educational and international medium. == Work on Glosa == Ashby’s work on Glosa began in the 1970s, when she and Ron Clark revived and expanded upon Interglossa, a simplified language system first proposed by British scientist Lancelot Hogben during the 1940s. Glosa was designed as a logical, vocabulary-based language with minimal grammar and phonetic regularity, drawing heavily from classical Greek and Latin roots — especially those common in scientific and medical terminology. Ashby played a central role in formalizing the language’s structure and co-authoring a series of foundational texts. Notably, she co-wrote: * Ashby, Wendy & Clark, Ronald: Glosa 6000: 6000 Greek and Latin words and roots which occur in the Euro- languages and international scientific terminology. London: 1983 (48 p.) * Ashby, Wendy & Clark, Ronald: Glosa 1000. Richmond: Glosa, 1984 * Ashby, Wendy & Clark, Ronald: Basic dictionary of the international language Glosa. Richmond [Surrey]: Glosa, 1987 (44 p.)History of the GID (The Glosa Internet Dictionary/ Glosa Inter-reti Diktionaria). * Ashby, Wendy: 18 steps to fluency in Euro-Glosa. Glosa, 1989 (2nde edition) * Ashby, Wendy & Clark, Ronald: Introducing Euro-Glosa. Richmond: Glosa, 1990 (36 p.) Her contributions focused on accessibility and ease of use, aiming to create a bridge language that could be adopted globally without linguistic bias. == Artistic Collaboration: Qo Akti? == In addition to her linguistic work, Wendy Ashby participated in a multidisciplinary art project with German artist Mathilde ter Heijne, contributing to the film Qo Akti?.Qo Akti? This experimental film, part of a broader exploration of feminist ritual and language, featured a Glosa translation of its script, incorporating the language into the artwork’s conceptual framework. Ashby’s involvement not only introduced Glosa into the realm of contemporary art but also demonstrated the language’s adaptability in expressive and symbolic contexts. The project was exhibited as part of ter Heijne’s broader body of work on ritual, feminism, and collaboration. == See also == * Glosa (auxiliary language) * Interglossa * Constructed language * Lancelot Hogben * Mathilde ter Heijne == References == Category:1950 births Category:2015 deaths Category:Glosa",
 "title": "Wendy Ashby"
}