{
 "id": "1188693",
 "text": "Mordechai Anielewicz (1919 – 8 May 1943) was the Polish leader of the Jewish Combat Organization during the Warsaw Ghetto Uprising; the largest Jewish resistance movement during the Second World War. Anielewicz inspired further rebellions in both ghettos and extermination camps with his leadership. His character was engraved as a symbol of courage and sacrifice, and was a major figure of Jewish resistance during the Holocaust. Emanuel Ringelblum described Anielewicz as Mordechai () Anielewicz was born to a Polish-Jewish family of Abraham (Avraham) and Cyryl (Cirel) née Zaltman, in the town of Wyszków near Warsaw where they met during the reconstitution of sovereign Poland. Shortly after Mordechai's birth, his family moved to Warsaw. Mordechai had a brother and two sisters: Pinchas, Hava and Frida. He finished Tarbut elementary with Hebrew instructions in 1933, at the age of 14. Mordechai was a member of the Betar youth movement from 1933 until 1935. He completed the private Jewish Laor Gimnazjum (also La Or, approved by the Ministry of Education). He later switched over to the left-leaning Hashomer Hatzair. At the age of 18 he went to a pre-military Polish training camp. On 18 January 1943, the Germans resumed deportation. Anielewicz, together with other members of ŻOB and ŻZW, decided to act. They were armed with five revolvers, five grenades, Molotov cocktails, crowbars and clubs.Twelve of them joined a group of evacuated Jews and attacked the German soldiers on the contracted signal. The fighters joined the line of hundreds of prisoners concentrated on Mila Street. As they reached the corner of Zamenhof and Niska, they attacked, each member of the unit targeting a German soldier. In the subsequent confusion, part of the deported Jews managed to escape. Most of the resistance in the attack died. Towards the end Anielewicz, surrounded by several gendarmes, was saved by Yitzhak Suknik throwing two grenades at the SS officers who were pursuing him, one grenade killing two Germans whilst the others ran away, allowing Anielewicz to escape.[Devastation and mutiny of Warsaw Jews by Melech Neustadt Print Achdot Inc. Tel-Aviv 1947][Ainsztein, Reuben (1979). The Warsaw Ghetto Revolt. New York: Holocaust Library. ISBN 9780896040076.][Noy, Melech (1948). Ḥurbn un oyfshṭand fun di Yidn in Ṿarshe eydes-bleṭer un azḳoreʹs (in Yiddish). Tel- Aviv: Ṿaadat ha-Golah fun der Algemeyner Yidisher arbeṭer-organizatsye (ha- Histadrut ha-kelalit) in Erets Yiśraʼel. pp. 533–4.] This first case of armed resistance was of great importance. Among other things, it led to the greater willingness of the Polish underground to provide weapons to the Jewish resistance. Not all weapons, however, came from underground groups. Some of them ŻOB bought from arms dealers. The beginning of the revolt was a prelude to the Warsaw Ghetto uprising that began on 19 April. During these three months, Anielewicz's leadership underwent intensive preparations for the further clashes with the Germans. He decided to use the guerrilla way of fighting with a vast network of tunnels, bunkers, roofs and surprise moments. He believed that enough Jews could withstand the ghetto for months. A day after the Germans suspended deportations, he wrote an open letter to the people of the ghetto under the name of the Jewish Battle Organization. Several days before the final suppression of the rebellion and shortly after the destruction of the Command Bunker, a rescue operation was carried out, during which about eighty Jewish fighters were transferred to a so-called Aryan section of the city and taken to safety. The event was organized by Yitzhak Zuckerman and Simcha Rotem. Although the Germans planned to destroy the ghetto within three days, the struggles lasted for four weeks and they didn't suppress them definitively until 16 May 1943, when Operation Commander Jürgen Stroop symbolically ended the explosion of the Great Synagogue in Warsaw. Yet, after many months, the remaining surviving Jews were attacking German patrols. Most of those who managed to escape from the ghetto became guerrillas but were often shot or committed suicide to avoid capture. Many of them later fought alongside the Poles during the Warsaw uprising in 1944. According to an official German report, written by Stroop, the German army captured 57,065 Jews and destroyed 631 bunkers. He estimated that 7,000 Jews died during the rebellion, and another 7,000 German authorities deported to Treblinka. The remaining Jews, around 42,000, were deported to Majdanek, Poniatowa, Trawniki, Budzyń, and Kraśnik camps. With the exception of several thousand prisoners in the Budzyń and Krasnik camps, the remaining Warsaw Jews from other camps were murdered in November 1943, during Aktion Erntefest. == References ==",
 "title": "Mordecai Anielewicz"
}