{
 "id": "1188678",
 "text": "Al Hasan Milad (born: 11 February 2000) popularly known as Mr. Milad is a Bangladeshi tech entrepreneur and author. He was representatives of Bangladesh and the United Nations Development. The founder and CEO of International Technology of Bangladesh. He received the Ernst & Young Entrapreneur of The Year Award in 2022 and the Global Youth Parliament Awards Georgia nomination in 2024 he is working as an ambassador for CalliGirlBooks LLC, USA. He was represented by the United Nations of Bangladesh in the development of Bangladesh because of the absence of Rabab Fatima in 2022. The United Nations Headquarters represents Bangladesh in New York City, which is led by a permanent representative of Bangladesh to the United Nations. He represented Bangladesh's interest in UN agencies in Geneva, the permanent mission of Bangladesh in Geneva. ==Education== Milad completed his secondary from Ranaping Adarsh High School and College and higher secondary from Syed Nabib Ali College. He achieved a double degree with computer science from the Institute of Technical & Information Technology (ITIT) and studying in the Department of Law at Metropolitan University, Sylhet. ==Writing career== He used to write columns in Bangladesh's national daily newspaper Prothom Alo, Daily Star, Channel 24, Ittefaq. His first book Struggle was published in 2022. ==Entrepreneurship== Milad founded the cyber security company International Technology of Bangladesh in 2022. In 2024, he founded the international news portal Daily Topnatch published from Sylhet and established another IT company named Syl Tech. ==controversy== During an international cricket match between Bangladesh vs India, Pakistani actress Shinwari and Milad were criticized by India's supporters supporting Bangladesh. Later, India's supporters accused Milad and Shinwari of love affair between Shinwari. Milad from the Delhi Police's headquarters was described as Indian hater. In the Biography of the Father of Nation cinema of former President Sheikh Mujibur Rahman, he praised Arifin Shuvoo's performance and became the victim of Criticism to the opposition. Former Bangladesh Education Minister Nurul Islam Nahid campaigned for the election of Sylhet-6 constituency against Milad. Nurul Islam Nahid has been accused of making Nurul Islam Nahid a Member of Parliament for the influence of Bangladesh Awami League. After writing columns on Channel 24 on corruption in Bangladesh, he fell under various sanctions of the Government of Bangladesh. He was the victim of the troll by questioning the role in the development of Bangladesh development. ==Books== * Struggle * The Breath of Life * Journalism and Artificial Intelligence ==Awards== * Ernst and Young Entrepreneur of The Year Award * Global Youth Parliament in Georgia * National Information and Communication Technology Awards * SAARC Youth Forum Awards (2023) * National Tech Entrepreneur of The Year == References == ==External links== * * *",
 "title": "Al Hasan Milad"
}