{
 "id": "1188641",
 "text": "Forrest Frank (born April 8, 1995) is an American contemporary Christian singer, songwriter, and producer, as well as one half of the pop music duo Surfaces. He has released seven albums, including Warm (2018), Effortless (2020), Nostalgia Pack, California Cowboy, New Hymns, and A Merry Lofi Christmas all in 2023, and 2024 and 2025's Child of God and Child of God 2 == Career == === Early Career (2018–2023) === Frank made his first album, Warm, on July 1, 2018. It was followed by Effortless, released on July 24, 2020. Both albums were made with the fake stage name \"Forrest.\", before he started using his real name \"Forrest Frank\" for his songs and albums in 2023. His song No Longer Bound was made in 2023 === Child of God (2024) === On April 12, 2024, Forrest Frank made God Is Good, with Caleb Gordon. Then on April 26, 2024, he made All the Time, with nobigdyl. On June 11, 2024, he announced his first tour, called the Child of God Tour. The tour visited 17 US cities, with Josiah Queen, Antoine Bradford, and nobigdyl. On July 26, 2024, he released his album Child of God. On October 25, 2024, he announced plans for a deluxe version of Child of God, including seven more songs. The album was made on November 1. On November 15, he released a Christmas-themed song, \"The Present\". Frank spent 2025 on the Child of God Part II tour. === Child of God II (2025–present) === On January 24, 2025, he released his first song of the year, named \"Drop!\". It was followed on February 7 by \"Sunrise\", and on February 28 by \"Nothing Else\" with Thomas Rhett. On April 4, 2025, he was featured on a rendition of tobyMac's \"Heaven On My Mind\". On April 11, he made the song \"No L's\", followed by \"Celebration\" on April 18 and \"Amen\" on April 25. On April 25, 2025, the album _Child of God II_ was announced. It dropped on May 9, 2025. == Musical style and influence == Frank is primarily a contemporary Christian artist that uses elements of hip hop, pop, and rock in his music. > Frank is known for bringing Christian music into the mainstream through his > songs' use on TikTok, YouTube Shorts and Instagram Reels. == Personal life > == Frank's parents are Kerryl Ann Frank and Ronald Frank. He attended > Houston Christian High School and later Baylor University, graduating in > 2017 with a degree in business. Frank is married to Grace, with a son named > Bodie. == Songs and Albums == * Warm (2018) * Effortless (2020) * Nostalgia > Pack (2023) * California Cowboy (2023) * New Hymns (2023) * A Merry Lofi > Christmas (2023) * Child of God (2024) * Child of God II (2025) == Awards == > === Grammy Awards === Year Nominee/work Category Result 2025 Child of God > Best Contemporary Christian Music Album === GMA Dove Awards === Year > Nominee / work Category Result 2023 \"No Longer Bound\" Rap/Hip-Hop Recorded > Song of the Year 2024 Forrest Frank New Artist of the Year \"Good Day\" > Pop/Contemporary Recorded Song of the Year === Billboard Music Awards === > Year Nominee / work Category Result 2024 Child of God Top Christian Album > Forrest Frank Top Christian Artist \"Good Day\" Top Christian Song === K-Love > Fan Awards === Year Nominee/work Category Result 2024 \"Good Day\" Breakout > single of the year 2025 Forrest Frank Artist of the Year Male Artist of > the Year === We Love Awards === Year Nominee / work Category Result 2023 \"No > Longer Bound\" Mainstream Impact Award 2024 Child of God Pop Album of the > Year Album of the Year \"UP!\" Song of the Year \"Good Day\" Pop Song of the > Year \"God Is Good\" Rap/Urban Song of the Year \"Praises (Remix)\" (with Elevation Rhythm) Collaboration of the Year Forrest Frank New Artist/Group of the Year == References == == External links == Category:Living people Category:1995 births Category:Rappers from Texas Category:Articles with hCards",
 "title": "Forrest Frank"
}