{
 "id": "1188006",
 "text": "Rolls Royce Phantom is a full-sized luxury sedan made by Rolls Royce. It is one of the most expensive sedan ever made. Its current price starts from 550000$. This car is the most luxurious, longest and most expensive sedan. ==Generations== There are eight generations of Phantom. The following are generations and model years of the Rolls Royce Phantom. Phantom I - 1925 to 1931 Phantom II - 1929 to 1935 Phantom III - 1936 to 1939 Phantom IV - 1950 to 1956 Phantom V - 1959 to 1968 Phantom VI - 1968 to 1990 Phantom VII - 2003 to 2017 Phantom VIII - 2017 to Present time ===Phantom I=== The Phantom I was also called \"The New Phantom\". Rolls Royce introduces the Phantom I to replace the Silver Ghost in 1925. ===Phantom II=== In the 1929, Rolls Royce introduces the Phantom II but the Phantom I has still producing and stopped producing in 1931. Then also, Rolls Royce ended producing Phantom II in 1935. ===Phantom III=== The Phantom III is the last Rolls Royce pre-war model. It started producing in 1936 and stopped in 1939. The gold Rolls Royce in 1964 James Bond movie, The Goldfinger was a Phantom III. ===Phantom IV=== After eleven years, Rolls Royce started producing the Phantom again. It was named Phantom IV. Only 18 units of this car had made. The owners of this car include British Royal Family and the leaders of some countries. Rolls Royce ended producing the Phantom IV in 1956. ===Phantom V=== Three years later, Rolls Royce introduced the Phantom V in 1959. The British Royal Family owns two Phantom Vs. It ended making the Phantom V in 1968. ===Phantom VI=== After ending the Phantom V, it introduced the Phantom VI. 374 units of this sedan were made. It ended making this sedan in 1990. ===Phantom VII=== After thirteen years, BMW bought Rolls Royce and started making Phantom VII. The Phantom VII Series I was produced from 2003 to 2012. In the 2012, Rolls Royce introduced the Series II as a 2013 model. It ended making these limousines in 2017. ===Phantom VIII=== In the late 2017, Rolls Royce introduces its best sedan ever made, the Phantom VIII. There are two types of Phantom VIII. They are Series I and Series II. Rolls Royce started making Phantom VIII Series I from 2017 to 2022 and Series II from 2023 to current time. ==References== https://carbuzz.com/100-year- anniversary-of-the-rolls-royce-phantom/ https://www.caranddriver.com/rolls- royce/phantom",
 "title": "Rolls-Royce Phantom"
}