{
 "id": "1188149",
 "text": "The O'Brien Trophy, or O'Brien Cup, as labelled on the trophy itself, is a retired trophy that was awarded in the National Hockey Association (NHA) and the National Hockey League (NHL) ice hockey leagues of North America from 1910 to 1950. It was originally donated to the NHA by Canadian Senator M. J. O'Brien in honour of his son, Ambrose O'Brien. The Cup was fabricated using silver from an O'Brien mine. The Cup has been awarded under four definitions. From 1910 through 1917, it was awarded to the NHA champion. In 1921, the Cup was transferred to the NHL and awarded to the NHL playoff champion until 1926–27. From 1927–28 until 1937–38, it was awarded to the Canadian Division regular season champion. Starting with the 1938–39 season, it was awarded to the NHL playoff runner-up. After 1949–50, the Cup was retired and has not been awarded since. In total, the Cup has been awarded in 41 seasons to twelve different teams. The Cup is now in the collection of the Hockey Hall of Fame The Cup was donated to the National Hockey Association by Canadian Senator Michael J. O'Brien in honour of his son, Ambrose O'Brien, who was credited with the formation of the National Hockey Association, the forerunner to the NHL. The Cup was originally to be given to the NHA's championship team. Made entirely from silver from the O'Brien mine, the trophy's value was estimated at CA$600 (over CA$14,069 in 2023 dollars). Like the Stanley Cup, trustees were named for the trophy. These were NHA executives Harry Trihey, Emmett Quinn and T. Yates Foster. Later, Stanley Cup trustee William Foran would become the sole trustee of the O'Brien Cup. On December 2, 1911, the NHA officially designated the trophy as the league's championship trophy. When the NHA was suspended in 1917, the Cup was held by the Montreal Canadiens. It remained in their care until 1921. In November 1921, it was announced that the Cup would be given over to the National Hockey League to be awarded annually to the NHL playoff champions. NHL president Frank Calder arranged with Ambrose O'Brien a new deed of gift. The Cup, which Calder had secured following the death of Montreal President George Kennedy, was then presented to the NHL champion Ottawa Senators. In 1925, the NHL inaugurated the Prince of Wales Trophy, which also was presented to the NHL playoff champions. From 1927–28 onwards, one year after the NHL expanded to two divisions in 1926, the Cup was awarded to the winner of the Canadian Division, while the Prince of Wales Trophy was awarded to the winner of the American Division. It would be awarded under this definition until the end of the 1937–38 season. The 1938–39 NHL season saw the NHL move back to a single division, and from that point on the Cup was awarded to the playoff runner-up. The Cup was not formally awarded from 1939 to 1943 and it would not be until 1944 that the winning teams from that period were inscribed on the trophy. At the end of the 1949–50 NHL season, the trophy was retired and has not been awarded since. It is now in the collection of the Hockey Hall of Fame in Toronto, Ontario, Canada and is on display with other historic trophies in the entrance to the Panasonic Hometown Hockey exhibit. The Montreal Canadiens have won it the most, having won the Cup eleven times. The Toronto Maple Leafs have won it the second most, a total of eight times, six as the Maple Leafs, once as the St. Patricks and once as the Torontos. The Detroit Red Wings have won the Cup the most times of any American team, having won it five times.",
 "title": "O'Brien Trophy"
}