{
 "id": "1188137",
 "text": "The Rashtriya Loktantrik Party ( RLP; translation: National Democratic Party) is an Indian political party in the state of Rajasthan. It was founded by Hanuman Beniwal on 29 October 2018, on the eve of the 2018 Rajasthan Legislative Assembly election with the aim of addressing the regional issues, particularly of the farmer community. == History == Hanuman Beniwal was initially exposed to politics due to his family political background, as his father, Ramdev Beniwal, was elected to the Rajasthan Legislative Assembly. He then became president of the student union of the Rajasthan University which marked his step into the politics. Hanuman Beniwal was elected to the Rajasthan Legislative Assembly for first time in 2008 as a member of the Bharatiya Janata Party. In 2013, Beniwal's persistent claims against prominent party leaders, such as Rajendra Rathore and Vasundhara Raje, led to his suspension from the Bharatiya Janata Party (BJP). According to Beniwal, they were thoroughly corrupt, and there was a corrupt relationship between Raje and Ashok Gehlot, the chief minister at that time. “ A day earlier, the party issued the first notice to Beniwal for repeatedly calling party colleague Rajendra Rathore and the leader of Opposition Vasundhara Raje as \"thoroughly corrupt\". He even criticised senior BJP leader LK Advani and alleged that there existed a 'nexus of corruption' between Raje and chief minister Ashok Gehlot. Beniwal made the accusations at a public function at the city's Maharaja's College on Saturday.” Hanuman Beniwal successfully organised five Kisan Hunkar Maha Rallies in Nagaur, Barmer, Bikaner, Sikar, Jaipur and this rally aimed at addressing the grievances of farmers in Rajasthan and the focused on issues such as loan waivers, fair prices for crops and better irrigation facilities for farmers of Rajasthan and launched a political party called Rashtriya Loktantrik Party with an election symbol of \"Bottle\" in Jaipur on 29 October 2018. The Kisan Hunkar rally was supported by some political leaders such as, Ghanshyam Tiwari, Jayant Chaudhary and Sanjay Lathar. RLP party received support from the farmer community, and was able to have its representatives elected on three seats of the Rajasthan legislative assembly in 2018. In 2019, the Rashtriya Loktantrik Party entered into an alliance with the Bharatiya Janata Party before the 2019 Indian general election. RLP contested on the Nagaur seat and extended support to the Bharatiya Janata Party on all other seats of the state. Hanuman Beniwal who had contested from the Nagaur seat was elected to the Lok Sabha in 2019. Following the passage of the 2020 Indian agriculture acts, Beniwal resigned from three parliamentary committees, and the party extended its support to the Indian farmers' protest and supported the 2020 Indian general strike. On 26 December 2020, Rashtriya Loktantrik Party quit NDA alliance in 2020-21 farmers protest to three farmer laws and the party said them as Anti-farmer laws. On 27 October 2023, the Rashtriya Loktantrik Party announced their alliance with Chandra Shekhar Ravan's Azad Samaj Party for the 2023 Rajasthan Assembly elections. Following 2024 Indian general elections, the Rashtriya Loktantrik Party announced their alliance with INDIA bloc to protect the democratic system in country. Hanuman Beniwal was announced as the candidate of INDIA bloc from Nagaur on 25 March 2024. On 11 January 2025, the Rashtriya Loktantrik Party announced their alliance with Aam Admi Party for the 2025 Delhi Legislative Assembly elections and also supported the Arvind Kejriwal demand to include the Jats across the country into the central list of OBC. “ Rajasthan MP Hanuman Beniwal's announcement came after AAP Rajya Sabha floor leader Sanjay Singh met him. As Beniwal supported Kejriwal's demand to include Jats across the country in the central list of OBCs, the AAP chief thanked his RLP counterpart.” == Electoral performance == Lok sabha election results Year Lok sabha Party leader Pre-poll alliance Seats contested Seats won Change in seats Total votes Overall vote % Vote swing Outcome Ref. 2019 17th Hanuman Beniwal NDA 1 1 Government Later Opposition 2024 18th INDIA 1 State assembly election results Year Party leader Pre-poll alliance Seats contested Seats won Change in seats Total votes Overall vote % Vote swing Outcome Rajasthan 2018 Hanuman Beniwal none 58 3 856,038 2.40% 2023 ASP(KR)+ 78 2 946,209 2.38% == Members of Parliament == Year Map Lok Sabha MP Portrait Constituency Margin 2019 17th Lok Sabha Hanuman Beniwal Nagaur Lok Sabha constituency 1,81,260 2024 18th Lok Sabha 42,225 == Members of Legislative Assembly == Members of the Rajasthan Legislative Assembly Year Name Constituency Margin 2018 Indira Devi Merta 12,835 Pukhraj Garg Bhopalgarh 4,962 Hanuman Beniwal Khinwsar 16,948 2019 By-election Narayan Beniwal 4,680 2023 Hanuman Beniwal Khinwsar 2,059 == References ==",
 "title": "Rashtriya Loktantrik Party"
}