{
 "id": "1188838",
 "text": "Muhammad al-Durrah was a 12-year-old boy who was killed in Gaza on the 30th of September in 2000. Together with his father, Jamal al-Durrah, they both got caught in a gunfight between Israeli soldiers and Palestinian fighters. A French television channel, France 2, filmed this event. Its footage shows Muhammad and his father hiding behind a concrete object during said gunfight. After a range of bullets and a wave of dust, Muhammad is seen slumped over his father's legs and died soon after. The footage reached the entire world and led to global outrage, and further on, it became one of the most famous images of the Second Intifada. This wikipedia article will deepen into several points involving the incident, context, the conceptualization of his death in media and the controversy where some disagree with the framing of his death and finally concluding with his legacy. == The incident == Muhammad and his father were walking in the Netzarim Junction in the Gaza Strip on the morning of September 30th, 2000. In this area, there were confrontations between Palestinian fighters and the Israeli army. The two sides were shooting at each other during these confrontations. During the fighting, Muhammad and his father tried to hide behind the concrete to avoid being hit by the flying bullets. Talal Abu Rahma, a Palestinian cameraman, was filming for the French television Channel France 2. His footage shows the father and son protecting themselves as bullets hit their surroundings. Later on in the footage, you can see that Muhammad stopped moving, and his father was unconscious. Charles Enderlin, the reporter of France 2, stated that this 12-year-old boy was killed by Israeli gunfire. == Context == The killing of Muhammad al-Durrah happened at the beginning of the Second Intifada, a period of violence and protests that started on the 28th of September in 2000 until the 8th of February 2005. Even though the tensions between the Palestinians and the Israeli forces were previously increasing, the Second Intifada started with the visit of Ariel Sharon to the Aqsa Mosque and the Temple Mount. Sharon was a right-wing Israeli politician and general; his visit, accompanied by a number of 1,000 troops, caused anger among Palestininans due to his controversial policies regarding the Sabra and Shatila massacre. The second Intifada followed a period of intense fighting between Palestinian protesters and the Israeli army, present also in the Gaza Strip, where Muhammad and his father were caught in the conflict. Muhammad’s death happened in a very early and tense period of the Second Intifada, and quickly became symbol of the Israel-Palestine conflict. == Media and public reaction == France 2 launched the footage of the shooting the same day it happened, which was also reproduced by many other news stations around the world. As the the footage spread around quickly, it also gained popularity at the same time. Furthermore, the killing of Muhammad al-Durrah became a symbol of Palestinian suffering to many countries. In Britain, for example, the 12 year boy was broadcasted in ITV as \"Images that Shook The World\", and served as an image people would agree represented the Palestinian landscape during the second intifada. This image would be used later in other newspapers, posters, and graffiti. And in a more formal context, his image was also shown during political speeches and other public events. Many countries responded to this footage. In the Arab world, tons of people believe that Muhammad was killed by the Israeli army. The event led to protests, and a number of people used the footage as reason to speak out against Israel. This rising popularity also encouraged fellow Palestinians to take advantage of the internet in their favour and show their opposition in the internet sphere, or \"citizen journalists\". On the other hand, Muhammad was also recognized as more than a photo of the events that happened. His murder later served as a conmemoration of the martyrs, in which his sneakers, without a shoelace represented a small and personal detail of him. == Controversy == However, there started to be some disagreements after the footage was realeased, questioning what actually happened in that event. The TV channel France 2 got exposed to critics after the case of Muhammad started to be investigated by the Israeli government. At first, the Israeli forces apologised, but they soon brought up that the murder of Muhammed lacked too much evidence for it to be framed. While Charles Enderlin said that Israeli soldiers had shot and killed Muhammad, journalists, researchers, and Israeli officials stated that the footage might be wrong and incomplete. Karsenky also called out this channel, stating the french nation's approach to anti-Israel ideas influenced the framing of Durrah's murder by Israeli forces. He was later brought up to court, accused of \"defamation\" and got fined after not being able to prove his words. The investigation of the Israeli governmnet also pointed out that in the footage (which the video was not fully realeased by France 2) neither of the involved had blood on them, and that the boy had moved after being killed. On the other hand, they also argued that it was unclear who shot the bullets that killed Muhammad, being the possibility certain that it could have been the Palestinian soldiers, and even claimed Muhammad was not killed at all. This case showed the world how controversial the event was. == Legacy == The footage of Muhammad al-Durrah’s killing became the most famous image of the Second Intifada and it is still relevant to the present day. Muhammad's father links the present Gaza conflict to his own son as a story that only repats itself: \"Every day they kill a child. The scene of Mohammed's killing still repeats itself after 23 years.\" For many people in the Arab world, and the Palestinians especially, Muhammad had become a symbol of their struggles and pain. His image would be a symbol in schools, public spaces, media, and even militant groups, who used Muhammad’s name in both actions and speeches. Many media debates have discussed this event. Most people believe that what was filmed yet some others doubt what really happened. Nevertheless, the killing of Muhammad al-Durrah forms part of the contemporary events that seem to be repeated after more than 20 years, transforming the image of an innocent boy into a common lived experience of the palestinian people, as also still remembering him as an essential moment in the history of the conflict between Israel and Palestine. .",
 "title": "Muhammad al-Durrah"
}