{
 "id": "1188740",
 "text": "Ditipriya Roy is an Indian actress who works in Bengali TV shows, movies, and theatre. She is well known for playing the role of Rani Rashmoni in the Bengali TV series Karunamoyee Rani Rashmoni. Some of the movies she has acted in are Avijatrik, Bob Biswas, Aay Khuku Aay, Kolkata Chalantika, and Achena Uttam. == Career == Ditipriya began her television career as a child actress and appeared in shows like Maa, Durga, Aparajito, Byomkesh, Bamakhyapa, Tomay Amay Mile, and Tare Ami Chokhe Dekhini. In 2015, she acted in the movie Rajkahini, directed by Srijit Mukherji. In 2017, she played the lead role in the Bengali TV series Karunamoyee Rani Rashmoni. The show was broadcast on Zee Bangla and had a total of 1,549 episodes. She made her Hindi movie debut with Bob Biswas. == Television == Year Show Channel Character Roles 2008 Durga Star Jalsha Gauri Side Role 2011–2013 Aparajito Rishita / Titli 2013 Tomay Amay Mile Young Ushoshi Lead Role 2014 Byomkesh Colors Bangla Chingri Episodic Role 2017–2021 Karunamoyee Rani Rashmoni Zee Bangla Rani Rashmoni Lead Role 2025–Present Chirodini Tumi Je Amar Aparna \"Apu\" Basu ===Guest appearances=== Year Show Channel Character 2022 Mithai Zee Bangla Opening of \"Mithai Hub\" and promotion Mukti Ei Poth Jodi Na Sesh Hoy Celebration of Republic Day and promotion Mukti == Movies == Year Movie Role Director Language Ref 2014 Biye Not Out Abhijit Guha, Sudeshna Roy Bengali 2015 Rajkahini Buchki Srijit Mukherji Bengali 2016 Dev: I Love You Chaapa Abhimanyu Mukherjee Bengali 2021 Avijatrik Aparna Subhrajit Mitra Bengali Bob Biswas Tina Diya Annapurna Ghosh Hindi 2022 Aay Khuku Aay Satabdi/Buri Sauvik Kundu Bengali Achena Uttam Sabitri Chatterjee Atanu Bose Bengali Kolkata Chalantika Ador Mukherjee Pavel Bengali Stories on the Next Page Brinda Mitra Bengali 2023 Bogla Mama Jug Jug Jiyo Madhuja Dhrubo Banerjee Bengali 2025 Pataligunjer Putul Khela Rai Subhankar Chattopadhyay Bengali Jodi Emon Hoto Jiya Rabindra Nambiar Bengali TBA Bengali == Web series == Year Film Role Platform Director Language Note 2021 Rudrabinar Obhishaap Saaz Hoichoi Joydeep Mukherjee Bengali Debut Web Series & Released Season 1( Part 1 & 2) 2022 Mukti Minu ZEE5 Rohan Ghosh Bengali 2022 Bodhon Shinjini Hoichoi Aditi Roy Bengali 2023 Dakghor Manjuri Hoichoi Abhrajit Sen Bengali 2023 Rajneeti Rashi Hoichoi Sourav Chakraborty Bengali == Awards == Roy has received the following awards: Year Award Category Character Film/TV show 2018 Zee Bangla Sonar Sansar Awards 2018 Best Actress Rani Rashmoni Karunamoyee Rani Rashmoni Zee Bangla Sonar Sansar Awards 2018 Facebook Popular Face Zee Bangla Rani Rashmoni 2019 Zee Bangla Sonar Sansar Awards 2019 Priyo Maa Rani Rashmoni Zee Bangla Sonar Sansar Awards 2019 Sonar Juti (with Gazi Abdun Noor) Rani Rashmoni- Rajchandra Telly Academy Awards 2019 Best Actress Rani Rashmoni 2020 Zee Bangla Sonar Sansar Awards 2020 2021 Zee Bangla Sonar Sansar Awards 2021 Bochorer Sera Award 2022 Anandalok Puraskar 2022 Best Actress Television 2022 WBFJA Awards Best Actor in a Leading Role (Female) Manjuri Dakghor 2023 TV 9 Bangla Ghorer Bioscope Best Actor in a Supporting Role (Female) Shinjini Bodhon == References == == Other websites == * Category:Living people Category:Indian actors",
 "title": "Ditipriya Roy"
}