{
 "id": "1188329",
 "text": "The Scottish League Two, also known as the William Hill League Two, is the fourth division of the Scottish Professional Football League (SPFL). The League was established in July 2013, after the merger of the Scottish Premier League and Scottish Football League. The Scottish League Two was previously known as the Scottish Football League Third Division. ==Teams== 2025–26 season Team Location Stadium Capacity Notes Annan Athletic Annan Galabank 2,504 Clyde Hamilton New Douglas Park 6,018 Dumbarton Dumbarton Dumbarton Football Stadium 2,020 East Kilbride East Kilbride K-Park Training Academy 700 Edinburgh City Edinburgh Meadowbank Stadium 1,280 Elgin City Elgin Borough Briggs 4,520 Forfar Athletic Forfar Station Park 6,777 Stirling Albion Stirling Forthbank Stadium 3,808 Stranraer Stranraer Stair Park 4,178 The Spartans Edinburgh Ainslie Park 3,612 ==Winners== Season Winner Runner-up Third place Fourth place 2013–14 Peterhead Annan Athletic Stirling Albion Clyde 2014–15 Albion Rovers Queen's Park Arbroath East Fifa 2015–16 East Fife Elgin City Clyde Queen's Park 2016–17 Arbroath Forfar Athletic Annan Athletic Montrose 2017–18 Montrose Peterhead Stirling Albion Stenhousemuir 2018–19 Peterhead (2) Clyde Edinburgh City Annan Athletic 2019–20 Cove Rangers Edinburgh City Elgin City Cowdenbeath 2020–21 Queen's Park Edinburgh City Elgin City Stranraer 2021–22 Kelty Hearts Forfar Athletic Annan Athletic Edinburgh City 2022–23 Stirling Albion Dumbarton Annan Athletic East Fife 2023–24 Stenhousemuir Peterhead The Spartans Dumbarton 2024–25 Peterhead (3) East Fife Edinburgh City Elgin City ==Play-off finals== * Match went to extra time † Match decided by a penalty shootout after extra time (P) Promoted (R) Relegated Season Winning team Losing team Losing semi-finalist 2013–14 Montrose 3–2 Brora Rangers Edinburgh City 2015–16 Edinburgh City (P) 2–1 East Stirlingshire (R) Cove Rangers 2016–17 Cowdenbeath 1–1† East Kilbride Buckie Thistle 2017–18 Cowdenbeath 3–2 Cove Rangers The Spartans 2018–19 Cove Rangers (P) 7–0 Berwick Rangers (R) East Kilbride 2019–20 No playoffs were held due to the COVID-19 pandemic in Scotland 2020–21 Kelty Hearts (P) 3–1 Brechin City (R) Brora Rangers 2021–22 Bonnyrigg Rose (P) 4–0 Cowdenbeath (R) Fraserburgh 2022–23 The Spartans (P) 2–1 Albion Rovers (R) Brechin City 2023–24 Stranraer 5–3* East Kilbride None 2024–25 East Kilbride (P) 3–1 Bonnyrigg Rose (R) Brora Rangers ==Notes== ==References== ==External links== * Official website Category:Scottish Football League",
 "title": "Scottish League Two"
}