{
 "id": "1188867",
 "text": "The Merchant's House Museum, also known as the Old Merchant's House and the Seabury Tredwell House, is a museum at Fourth Street in the NoHo neighborhood of Manhattan in New York City. It was built by Joseph Brewster in 1831 and 1832. It is a four-story building with a Federal-style brick facade and a Greek Revival interior. The Tredwell family lived there for almost one hundred years. Then the building became a museum in 1936. The Merchant's House Museum is the only 19th-century home in Manhattan with its original exterior and interior intact. Brewster built the house and in 1835 sold it to Seabury Tredwell. Tredwell lived there with his family and servants. The family owned the house until the death of the youngest child, Gertrude, in 1933. George Chapman, a distant relative, bought the building and turned it into a museum. Over the next three decades, the museum's operators struggled to get funds to restore the house. The architect Joseph Roberto completely renovated the building from 1970 to 1980. The museum underwent further restoration in the early 1990s after the demolition of nearby buildings damaged it. During the 2010s and 2020s, museum officials protested the building of a nearby hotel because they feared that the project would further hurt the house. The Merchant's House Museum has a raised basement, a front doorway accessed by a stoop, a slate roof, and a rear garden. The inside has a family room and kitchen in the basement; two parlors on the first floor; and bedrooms on the upper floors. The museum's collection has over 4,500 items owned by the Tredwell family. The items include pieces of furniture, clothing, household items, and personal items. The museum also hosts various performances and events. It operates tours and educational programs. Reviewers have praised both the museum's exhibits and the architecture. The building's facade and interior are New York City designated landmarks, and the building is a National Historic Landmark. Category:New York City Designated Landmarks",
 "title": "Merchant's House Museum"
}