{
 "id": "1188588",
 "text": "Huidrom Pushparani Devi, better known as Pushparani Huidrom, nicknamed as \"The Melody Queen of Manipur\", is an Indian singer and music instructor. She is noted for her songs in Meitei language in Manipur and other Northeast Indian states. Native to Imphal, Manipur, known for her significant contributions to Manipuri music, she presented over a thousand songs in twenty years. She began her singing career at the age of four and has since gained recognition for her vocal ability. In 1998, she secured the position of first runner-up in the All India Mega Final of the TVS Sa-Re-Ga-Ma competition organized by Zee TV. Over the years, she has recorded hundreds of songs and received numerous awards, including the Best Playback Singer (female) on several occasions. In 2019, she was awarded the title of Best Singer (female) at the SKG International Film Festival. Additionally, she has been honored with various awards for her performances and contributions to the film industry. As of 2025, Pushparani’s most streamed tracks on Spotify include “Taningle” with approximately 1.7 million streams, “Lei Lei” with approximately 1.3 million streams, “Choirabi” with 889,900 streams, “Hairo” with 795.1 K streams, and “Hainabado Chumle” with 775,300 streams, reflecting her ongoing presence in digital music distribution. == Career == Pushparani, born in 1987 at Wabagai Terapishak in Kakching (then Thoubal District) of Manipur, is a graduate and holds the title of Sangeet Nipun in Hindustani classical music. She is the daughter of Huidrom Gogol Singh and Bishobhanu. Her involvement in music began in 1991 at a very young age, marked by early participation in song competitions. On February 1, 1991, she secured the first position in a competition jointly organized by NEZCE Dimapur, EZCC Calcutta, and the Department of Arts and Culture, Manipur, held in the name of Pandit Jawaharlal Nehru. Between 1992 and 1994, Pushparani received several first prizes in district-level and local music competitions. These included the District Level Music Competition organized by Khonthang Musical Centre (1992), Shri Arambam Dayananda Singh Memorial Musical Competition (1992), Nehru Yuva Kendra Thoubal (1992), Geetmala Musical Centre Mayang Imphal (1993), and W.Y.C. Thoubal (1994). She also participated in the Annual State Level Arambam Dayananda Singh Memorial Musical Competition on August 31, 1994, and the first State Level Jananeta Irawat Manipur Song Competition organized by AIYF/MSC in 1994, where she attained third position. Pushparani served as a music instructor at the Government Ideal Blind School, Takyel, in Imphal. She sang multiple songs for Meitei language movies, like Akhunba Takhellei, Aliyah, Angaoba, Chingda Satpi Engellei, Ima Machet Icha Tangkhai, Inamma, Kanana Helli, Leiyisigi Wangmada, Nangna Helli Nungshiba, Nungshi Khudol, Phisakol, Wakching Thagi Sanarei, Wakching Thana Lakpada, among many others. She is one of the vocalists of the song Lonna Chikna, which she performed alongside Ranbir Thouna. The song was composed under the music direction of Oken Amakcham. Pushparani was one of the singers featured in Romi Meitei gi THOIBI, an event presented by Mayum Network on 14 May 2009 at BOAT. She is featured as one of the vocalists on the audio CD School Karusi, which includes five songs. The CD, produced by LEGEND STUDIO, also includes contributions from Ranbir Thouna, Mandakini, and Suren. Nangna Khangbidraba Nungsiba is a song performed by Pushparani for the 2015 Manipuri film TORO. The track is part of the film's soundtrack, contributing to its musical composition. The Manipuri music video Khoidajei (My Secret Love), whose song she sang, won the Best Music Video Award at the SKG International Film Festival (SIFF-2019), held from 29 May to 2 June 2019 in Ahmedabad, India. In the Music Video category, Pushparani was awarded the Best Female Singer Award for her performance in Khoidajei. She performed at the 9th Annual General Meeting (AGM) and Annual Cultural Program organized by the Association of Manipuri Diaspora (AMAND), Pune. The event was held virtually on 4 October 2020 via Zoom and was streamed live on the AMAND Facebook page. In 2023, Pushparani was one of the playback singers for the music video album Lingjel Khaba Meeteini, produced by Laishram Pictures Production. The album was released at a function held at the Manipur Press Club. Pushparani was among the artists representing Manipur at the Bishgaon Festival 2023, which took place on January 20 at Abadgaon, Gazipur, Habigonj, in Bangladesh. Pushparani performed the vocals for the song Nungsijeine Ema Mahousa Lairembi, which was released on October 20, 2024, during a ceremony at Loktak Hall, Manipur Press Club, Imphal. == Awards and honour == On 10 May 1995, Manipur University conferred the ‘Echo Award’ on Pushparani in recognition of her early contributions to the field of music. On 19 August 1995, she secured first position in the Second State Level Junior Literary Meet, an event sponsored by the Directorate of Education, Manipur. Subsequently, on 16 February 1996, she was named Best Artiste during the Aheibam Shyam Nite, organized by the Naharol Thoudang Club in Borbil, Cachar. On 2 May 1998, Pushparani attained second place (first runner-up) in the All India Mega Final of the TVS Sa-Re-Ga-Ma music competition, organized by ZEE TV, a national-level platform for emerging musical talent. Pushparani has been the recipient of multiple recognitions for her contributions to music and Manipuri cinema. On 30 September 1999, she received the Jana Neta Irawat Award for her performance in the field of music. In the same year, she was conferred the Rajkumari Sanatombi Award for best child artist singer, presented in the presence of the then Governor of Manipur. On 21 April 2001, she was awarded Best Female Singer at the Third Manipur State Film Festival, organized by the Manipur Film Development Corporation, Imphal. She participated in the Festival of Manipur held in Kolkata on 19 January 2003. A Certificate of Appreciation was presented to her by Prajapita Brahma Kumaris Ishwariya Vishva Vidyalaya during the Festival of Peace on 31 August 2008. In 2009, she was awarded a Certificate of Honour by R.K. Films Pvt. Ltd. Production for her contributions to Manipuri cinema. On 15 February 2010, she received a Certificate of Honour from SEUTI Films Production, Imphal, for her role in the Manipuri feature film 21st Century’s Kunti. She was also named Best Playback Singer (Female) at the 1st and 5th editions of the SSS MANIFA awards in 2012 and 2016, respectively, organized by Sahitya Seva Samiti in collaboration with Film Forum, Manipur. Pusparani Huidrom was awarded the Khomdonsana Best Female Singer Award for the year 2012 at the inaugural Sahitya Seva Samiti Manipuri Film Awards. The ceremony took place on 23 September 2012 at the Auditorium of the Library and Information Centre in Kakching. The event was organized by the Sahitya Seva Samiti, Kakching, in collaboration with the Film Forum, Manipur. On 12 September 2012, Huidrom Pushparani Devi was announced as one of the nominees for the Best Female Singer category for her performance in the film Luhingbagi Ahing. The announcement was made by R.K. Jnanrajan, Festival Director of the 1st Sahitya Seva Samiti Manipur Film Awards 2012 and the Neta Irawat Leelarol Lifetime Mana 2012, at the office of the Film Forum Manipur in Lamphel. Pushparani and Bonium were awarded the titles of Best Female and Best Male Playback Singer, respectively, for the song Nangsu Eisu Nangsu from the film Nangna Nokpa Yengningi at the Sahitya Seva Samiti Manipuri Film Awards 2016. The award function, which also recognized Nangna Nokpa Yengningi as the Best Feature Film, was held at Kakching Khullen. Pushparani was conferred the Best Female Playback Singer award for her performance in the song Kourakhini Eibu Soidana from the film Mamlasanu Taibangpal at the 11th Manipur State Film Awards 2018. The awards ceremony took place at the auditorium of the Manipur State Film Development Society (MSFDS). At the SKG International Film Festival (SIFF-2019), held from 29 May to 2 June 2019 in Ahmedabad, India, in the Music Video category, Pushparani was awarded the Best Female Singer Award for her performance in Khoidajei. She was nominated for the Best Female Playback Singer award at the 9th Manipur Film Awards (MANIFA) 2020 for her performances in the songs Yengdaba Ngamde and Mamal Naidraba Thamoi. Pushparani received the Best Female Playback Singer award for the song Maral Leitaba Pirangse from the film Akangba Nachom at the 11th Manipur Film Awards (MANIFA) 2023. == Controversy == On 26 February 2022, Huidrom Pushparani Devi, serving as a music instructor at the Government Ideal Blind School, Takyel, was suspended from duty by the Department of Social Welfare, Government of Manipur. The suspension followed her participation in a political meeting held on 22 February 2022 during the visit of the Prime Minister of India. The department's order cited video evidence provided by the office of the Chief Electoral Officer, Manipur, which showed her presence at the event. In her official response, Pushparani Devi stated that she was unaware of the political nature of the meeting. However, based on the evidence, she was placed under suspension with immediate effect. The order also directed that she must not leave Imphal without prior approval from the competent authority. == Related pages == * Mangka Mayanglambam * Danube Kangjam * Bishesh Huirem == References == * Pushparani Huidrom at IMDb Category:Meitei people Category:Indian singers",
 "title": "Pushparani Huidrom"
}