{
 "id": "1188043",
 "text": "Raseshwari Devi Ji is an Indian spiritual leader and Vedic scholar who simplifies the ancient Vedic teachings for practical application in daily life. She was born on 12 January 1968 in a devout Punjabi Brahmin family in Bhilai, Chhattisgarh. == Spiritual teachings == She gave her first public discourse in 1989 in Durg, Chhattisgarh, and has since delivered spiritual talks across several Indian states including Odisha, West Bengal, Bihar, Chhattisgarh, and Rajasthan. Internationally, she has been active in countries like Mauritius and the United Kingdom. == Braj Gopika Seva Mission == Raseshwari Devi Ji is the founder president of the non-profit charitable organization, the Braj Gopika Seva Mission, established in 1999. The mission undertakes several community upliftment programs and has contributed to the PM CARES fund and various Chief Minister Relief Funds during emergencies such as the COVID-19 pandemic. === Major Initiatives === The mission organizes four major annual events: * Bal Sanskar Shivir – Focused on inculcating traditional values in children. * Yuva Utthan Shivir – Targeted at youth empowerment and moral leadership. * Annual Sadhana Shivir * Jagadguru Sadhana Shivir – Advanced spiritual retreats promoting Upanishadic teachings and Rupadhyana meditation. == Awards and recognition == In 2019, she received the Yuva Adhyatmik Guru Puraskar by the MIT World Peace University, Pune, recognizing her contributions as a spiritual youth icon.https://www.bhaskar.com/jharkhand/ranchi/news/raseshwari-devi-honored- with-youth-spiritual-teacher-award-034055-3730577.html == Bibliography == * Gurutatwa, ISBN 978-81-960815-0-8 * Asa Ras Moha Mohi, ISBN 978-81-960489-3-8 * Ab Pana Shesh Hai, ISBN 978-81-960489-7-6 * Lalsa, ISBN 978-81-960815-5-3 * Sumiran Kar Le Mana, ISBN 978-81-960489-6-9 * The Eight Pearls of Devotion, ISBN 978-81-967654-5-3 * An Unfinished Pursuit, ISBN 978-81-968059-7-5 == Early Life and Education == Raseshwari Devi Ji completed her formal education in 1988. Thereafter, she pursued the study of Vedic scriptures and philosophies under the guidance of Jagadguru Shri Kripalu Ji Maharaj. On 15 October 1988, she was directed by her guru to begin preaching the teachings of Sanatana Dharma.https://www.oneindia.com/in-the-news/spiritual-movement-near- bhubaneswar-gains-global-reach-4136037.html == Other websites == == References ==",
 "title": "Raseshwari Devi Ji"
}