{
 "id": "1189200",
 "text": "Aiden Michael Roach (born December 31, 1996), known professionally as King Aiden, is an American singer-songwriter, music producer, actor, and model. His work spans genres including hip-hop, pop, and acoustic music, and often incorporates themes related to transgender identity and LGBTQIA+ advocacy. == Early life and education == Roach was born in Russellville, Kentucky, and assigned female at birth. He later came out as transgender and legally transitioned, adopting the name Aiden Michael Roach. He trained in music and performance from a young age, including artist development with Terry Watson of Warner Music Group and courses in music production. == Career == === Music === Roach writes and produces his own music independently. His 2024 album, Walk In My Shoes, explores themes of identity, resilience, and transgender experience. Notable tracks include That Old Kentucky Road and The Spirit Flow (Save Trans Lives), which features both his pre- and post-transition vocals. He has collaborated with musicians including David Leonard, Ian Keaggy, and Ryan Cassata. His collaboration with Cassata produced the track I'm a Man (And I'm Trans), which received notable streaming traction. === Acting and modeling === Roach appeared in an episode of the television series Nashville and was featured in TobyMac’s music video Feel It. He is signed with Advantage Talent Agency in Nashville for acting and modeling. == Advocacy == Roach is an advocate for transgender rights, using his music and platform to raise awareness about LGBTQIA+ issues, mental health, and anti-transgender legislation. == Personal life == He is married and resides in Nashville, Tennessee. == Discography == === Albums === * Royalty (2025) * Walk In My Shoes (2024) * No Kingdom Can Endure Two Kings (2023) * No Apologies (2022) === Notable Singles === * I’m A Man (And I’m Trans) (with Ryan Cassata) * The Spirit Flow (Save Trans Lives) * Safer Places * Stressed * Conversations * Anxiety * I’ll Look After You === Filmography === Television * Nashville (Season 4, Episode 5) === Music Videos === * TobyMac - Feel It == References == Category:American singer-songwriters Category:American record producers Category:American television actors Category:American models Category:LGBT musicians Category:LGBT rights activists Category:Transgender people Category:People from Kentucky",
 "title": "King Aiden"
}