{
 "id": "1189046",
 "text": "The sport of cricket has a large vocabulary which includes many unusual terms. A comprehensive glossary is a necessary aid for people trying to understand the sport. The list below, still under construction, highlights key terms for expansion into glossary format. Many of these terms will need an article in their own right. ==A== :;All out : Ten members of the batting team have been dismissed (one batter remains not out) and the innings ends at that point.<ref name=\"Law13–3> :;All-rounder : A player who is good at both batting and bowling—the majority of players are good at only one. The all-rounder often bats in the middle of the batting order. Depending on whether he/she is better in one skill than the other, they may be termed a batting all-rounder or a bowling all-rounder. There are also wicket-keeper-batters (see below). A \"genuine\" all-rounder is a player who is equally good at batting and bowling. This type of player is also, usually, a good fielder. Famous all-rounders include W. G. Grace, Gary Sobers, and Ellyse Perry. :;Appeal : Most usually associated with the \"Owzat!\" call to the umpire which is made by the bowler and other fielders when they believe the batter should be given out. In fact, it is a request by any player to an umpire for a decision on anything that may affect play: for example, an appeal by a batter for play to be suspended because of poor light. :;Averages : Batting average is the mean number of runs scored by a batter per innings and is calculated by dividing their total number of runs scored by the number of completed (excluding not out) innings they have played through the period under consideration (e.g., series, season, career). Bowling average is the mean cost of runs conceded by a bowler per wicket taken and is calculated by dividing the total runs conceded by the number of wickets taken, again by period. ===Additions from redirected article=== :;Around the wicket : When the bowler is right handed, bowling over the wicket is when he's on the right of the stumps. When he is left handed, it is when he bowls on the left on the stumps. After bowling over the wicket, the bowler might try bowling around the wicket. This might make the batsman make an error. :;The Ashes :The perpetual prize in England v Australia Test match series. Invented by The Sporting Times in 1882, after a match when Australia beat England on an English ground for the first time. The obituary said that English cricket had died, and the body would be cremated and the ashes taken to Australia. The English press dubbed the next English tour to Australia (1882–83) as the quest to regain The Ashes. During that tour a small terracotta urn was presented to England captain Ivo Bligh by a group of Melbourne women. The contents of the urn are reputed to be the ashes of an item of cricket equipment, a bail. :;Asking rate :The run rate at which the team batting second needs to score to catch the opponents' score in a limited overs game. Same as 'required run rate'. ==B== * bail * batter * batting * batting average * boundary * bowled * bowler * bowling * bowling average * bowling crease * bye ===Additions from redirected article=== :;Backlift :Lifting the bat in preparation to hitting the ball. :;Backing up : The term has two meanings. A non striker (the batsman who is not receiving) advances a few steps, and hopes the batsman on strike will score some runs. This is a way to get quick singles. ::When a fielder backs up, he covers another fielder in case that one misses the ball. This prevents the possibility of more runs being scored because of an overthrow. :;Bad light : Bad light is a reason to stop the play. The umpires may stop the game if they think the fielders, batsmen or bowlers cannot see well enough to play. Sometimes the umpires offer the light to the batsmen. This means they ask them if they want to continue batting or not when it starts to get dark. In one day matches, umpires usually let play continue. :;Bails : Each set of three stumps has a pair of bails. They are also made of wood. They are just less than five inches long. They cannot be more than one inch above the stumps. For a batsman to be out at least one of the bails must fall. If neither falls, the batsman cannot be out. :;Ball-tampering : Bowlers often polish the ball, usually on their trousers. However, nobody is allowed to rub it on the pitch or ground. Ball-tampering is when a bowler or fielder deliberately scratches the balls. The most famous example was in 1994. England captain Mike Atherton was fined £2,000 for ball- tampering in a match against South Africa. He had dirt in his pocket. He said he was using it to stop his hands sweating. :;Beamer : A beamer is a ball which does not bounce in front of the batsman. Instead it is aimed directly at his head. Sometimes it is done deliberately, but it is usually an error from the bowler. :;Block hole : The block hole is a small hole in the pitch. It is normally just behind or in front of the popping crease. It is made by the batsman so he knows where to stand. He will usually ask the umpire to help him. The block hole may be for example in line with the leg stump. :;Bouncer : A bouncer (or a bumper) is a fast ball. It is bowled short so that it bounces up towards the batsman's head. It is used to intimidate them. Sometimes the ball is bounced to high and the umpire calls a no-ball. If the bowler bowls too many bouncers the umpire may stop him from bowling. In a one-day game, a bouncer which goes over the batsman's head can be called a wide by the umpire. :;Boundary : The boundary defines the limit of the playing zone. It is normally marked by a rope. When the batsman hits the ball and it goes over the rope without touching the ground, he scores six runs. This is where the term hit for six comes from. If the ball bounces, the batsman gets four runs. There are sometimes other rules on some wicket grounds. For example at Kent's Canterbury ground, there is a lime tree. If you touch the tree you get four runs. The tree was blown over by wind in 2005. Since then a new one is in place, and the tradition continues. :;Box : The box is a hard protector for the region of the groin. batsmen, wicketkeepers and close fielders usually wear it. The cricket ball is very hard, so the box is an essential part of equipment for a cricketer. :;Bump Ball : When a batsman hits the ball into the ground and a fielder catches it, it is called a bump ball. The batsman is not out. However, some spectators which are far away sometimes appeal for a catch because it looked like the fielder caught the ball without it bouncing. :;Bye and Leg Bye : Any runs scored without the ball touching the bat or the batsman's body is called byes. Usually the wicketkeeper stops the ball, but sometimes he misses resulting in byes. ::Leg byes are scored when the ball touches any part of the body other than the hands (which count as the bat). Byes and leg byes are not counted as runs for the batsman. They are counted as extras. ==C== * captain * caught * century * chinaman (unorthodox left arm spin) * crease * cricket ball * cricket bat * cricket field * cricket pitch ==D== * declaration * delivery * dismissal * draw * duck ==E== * equipment * extras ==F== * fast bowling * fielder * fielding * finger spin * first-class cricket * follow-on ==G== * googly ==H== :;Handled the ball : :;Helicopter shot : An unconventional batting shot which was made popular by MS Dhoni. The batter uses a low grip and a high backlift when expecting to receive a full- length delivery such as a yorker. The shot requires fast wrist movement to force the ball upwards, the intention being to score six runs. Dhoni characterised the shot by using shoulder rotation in his follow-through, and circling the bat over his head. :;Hit the ball twice : :;Hit wicket : ==I== * innings * inswinger * International Cricket Council (ICC) ==L== :;The Laws of Cricket : * league cricket * leg before wicket (lbw) * leg break * leg bye * limited overs * List A cricket ==M== * maiden * Marylebone Cricket Club (MCC) ==N== :;No ball : * non-striker * not out ==O== * obstructed the field * off break * orthodox left arm spin * out * outswinger * over * overarm bowling * overthrow ==P== * partnership * pavilion * pitched delivery bowling * playing time * popping crease ==R== * return crease * roundarm bowling * run * run out ==S== * schools cricket * scoring * seam bowling * sightscreen * single * single wicket * spell * spin bowling * square leg * striker * stump * stumped * substitute * swing bowling ==T== * Test cricket * tie * timed out * toss * Twenty20 ==U== * umpire * underarm bowling ==V== * village cricket ==W== * wicket * wicket-keeper * wide * Wisden Cricketers' Almanack * women's cricket * wrist spin ==Y== * yorker ==References== ==Bibliography== * * International Cricket Conference. Official ICC App. ICC (2018). * * Oxford University. Oxford English Dictionary, 11th Edition. Oxford University Press (2004). * Swanton, E. W. (editor). Barclays World of Cricket, 3rd edition. Willow Books (1986). * Williamson, Martin. A glossary of cricket terms. ESPN Sports Media Ltd. Category:Cricket * Category:Sports words Cricket",
 "title": "Glossary of terms used in cricket"
}