{
 "id": "1189034",
 "text": "Sandeepa Dhar is an Indian actress who appears in Hindi movies and Web series. She made her acting debut in 2010 with Isi Life Mein.Isi Life Mein : Complete Cast and Crew details. Bollywoodhungama.com (24 December 2010). Retrieved 7 February 2011.Isi Life Mein movie review: Wallpaper, Story, Trailer at Times of India. The Times of India. (24 December 2010). Retrieved 7 February 2011. For her performance in the film, she was nominated for Filmfare Award for Best Female Debut, Star Screen Award for Most Promising Newcomer and Stardust Award for Superstar of Tomorrow. Dhar did a cameo in Dabangg 2. == Early life == Dhar was born in Srinagar, Jammu and Kashmir, India in a Kashmiri Pandit family. She is professionally trained dancer. Have won several awards for her dancing, she trained in Bharatanatyam for 8 years from Vani Ganpathy. She also trained in Jazz and Contemporary for 4 years from Shiamak Davar and Terence Lewis. == Filmography == === Movies === Year Title Role Notes 2010 Isi Life Mein Rajnandini 2012 Dabangg 2 Anjali Cameo 2014 Heropanti Renu 2015 Gollu Aur Pappu Pia 2016 Global Baba Bhavana 7 Hours to Go Nandini Shukla 2017 Baaraat Company Mehek 2019 Cartel Sweta 2021 Kaagaz Herself Special appearance Delayed Firrkie Shanaya ===Web series=== Year Title Role Notes Ref. 2019 Abhay Komal Season 1 Flip Firdaus Episode: \"Massage\" 2020 Mum Bhai Vaishnavi 2021 Bisaat- Khel Shatranj Ka Dr. Kiana Verma Chattis Aur Maina Rani Angle a.k.a. Maina 2022 Mai Inaya Siddiqui 2022 Dr Arora: Gupt Rog Visheshagya Mithu Tomar Season 1 2025 Pyar Ka Professor MX Player === Music videos === Year Title Singer Ref. 2022 ik Mili Mainu Apsraa B Praak & Asees Kaur 2022 Ab Kise Barbaad Karoge Altamash Faridi 2022 Dua karo Stebin Ben == Awards and nominations == *Nominated - Filmfare Best Female Debut Award *Nominated - Star Screen Award for Most Promising Newcomer – Female *Nominated - Stardust Award for Superstar of Tomorrow – FemaleNominations of Stardust Awards 2011. Bollywoodhungama.com (22 January 2011). Retrieved 7 February 2011. == References == == Other websites == Category:Living people Category:Indian actors",
 "title": "Sandeepa Dhar"
}