{
 "id": "1189935",
 "text": "Aviatrix Systems, Inc. (known as Aviatrix) is a U.S. company that helps businesses manage and secure their cloud computing networks. Cloud computing means using internet-based services to store data and run applications instead of local computers. The company is based in Santa Clara, California, and was started in 2014. == History == Aviatrix was founded in 2014. In June 2023, Doug Merritt became the company’s Chairman, CEO, and President. Merritt had earlier been the CEO of Splunk, a data software company, and worked at other tech companies like Cisco and SAP. From 2020 to 2022, Aviatrix was named one of the fastest-growing tech companies in North America by Deloitte’s Technology Fast 500 list. In 2025, Aviatrix partnered with Megaport, a network services company, to improve data encryption (a way to protect information) on global networks. === Funding === Aviatrix has raised 350 million from investors. In September 2021, the company received $200 million in a Series E funding round. In September 2021, the company received 200 million in a funding round, making its total value 2 Billion. == Products and services == Aviatrix’s main product is a cloud networking platform. This tool helps businesses set up and manage networks across different cloud providers like Amazon Web Services (AWS), Microsoft Azure, and Google Cloud. It focuses on security, making it easier to monitor and control cloud networks, especially when using multiple providers together. In 2024, Aviatrix introduced a new service called PaaS (Platform-as-a-Service), which helps companies fix security problems in their cloud networks. == Reception == Aviatrix’s products have received mostly positive reviews. On Gartner, a review site for businesses, the platform has a 4.5 out of 5 rating. Users liked its easy management for hybrid (mixed cloud and local) networks. On G2, another review site, customers praised Aviatrix’s tools for creating visual maps of cloud networks, which help solve problems faster. TrustRadius reviews noted that the platform reduces downtime (time when systems stop working) by finding network issues early. == References == Category:2014 establishments in California",
 "title": "Aviatrix Systems"
}