{
 "id": "1189053",
 "text": "The North American Eagle Project was a collaborative venture between American and Canadian engineers, pilots, and mechanics aiming to break the land speed record by converting a jet fighter into a supersonic land vehicle. The project sought to surpass the existing record of 763.035 mph (1,227.985 km/h), set by the British jet-powered car ThrustSSC in 1997. == Background == Initiated in 1998 by former IBM project manager and U.S. Air Force veteran Ed Shadle, along with partner Keith Zanghi, the project repurposed a retired Lockheed F-104 Starfighter. The aircraft's fuselage was modified into a 56-foot-long (17.07 m) vehicle, powered by a General Electric J79 turbojet engine capable of producing 19,000 pounds of thrust. The team aimed to achieve speeds exceeding 800 mph (1,287 km/h), or Mach 1.058. == Design and Engineering == The North American Eagle vehicle integrated aerospace technology with automotive engineering. The F-104 fuselage provided aerodynamic efficiency, while the J79 engine, originally used in aircraft like the McDonnell Douglas F-4 Phantom II, delivered substantial thrust. The vehicle featured aluminum wheels designed to withstand speeds up to 1,000 mph (1,609 km/h), and braking was managed through a combination of parachutes and magnetic brakes. == Testing and Record Attempts == Testing occurred at various sites, including the Bonneville Salt Flats in Utah, the Black Rock Desert in Nevada, and the Alvord Desert in Oregon. In 2013, professional racer and television personality Jessi Combs joined the team as a driver. On October 9, 2013, Combs set the women's four- wheel land speed class record with an official run of 392.954 mph (632.39 km/h). == Fatal Accident and Legacy == On August 27, 2019, during a high-speed run in the Alvord Desert, Jessi Combs tragically lost her life when the vehicle crashed. In June 2020, the Guinness World Records posthumously awarded Combs the title of \"Fastest Woman on Earth,\" recognizing her record-setting speed of 522.783 mph (841.338 km/h).",
 "title": "North American Eagle Project"
}