{
 "id": "1189190",
 "text": "Luc Collard is a French academic and researcher in the field of Physical education, Sports science, and Motor praxeology. He is a Professor of Exceptional Class at Paris University. He is known for his pioneering contributions to the study of swimming techniques, particularly his advocacy for the development of a \"fifth stroke\" in competitive swimming, known as underwater oscillation or undulation swimming. == Academic background and career == Collard began his career as a teacher of Physical education and Sports, earning his CAPEPS certification in 1988 and the aggregation in 1991. In 1997, he completed a thesis on risk-taking in sports games, awarded the First Thesis Prize at the Sorbonne, Paris. Collard's work in experimental game theory established the educational value of risky sports, which later informed his studies on swimming tactics. He became a prominent advocate for the integration of innovative approaches into sports education and competition. == Research == Collard is best known for developing the \"fifth stroke,\" an underwater swimming technique based on full-body undulation, inspired by aquatic animals for greater speed and efficiency. He argues it is as natural for humans as traditional strokes. In 2019, he launched the first fifth-stroke competitions under the French Federation of University Sports (FFSU), following FINA rules, aiming for official recognition of the technique. Collard's interdisciplinary research treats swimming as both a physical skill and social construct. Drawing on Evolutionary biology and Game theory, he explores underwater propulsion and strategic swimming, emphasizing that swimming techniques are shaped by culture and open to innovation. == Selected publications == * La cinquième nage. Natation & Théorie de l’évolution (2009) * The Fifth Stroke: Explorez une nouvelle dimension! (2018) * Nager en apnée (2020) * The Aquatic Ape (2022) == References == Category:French academics Category:French scientists Category:Swimming Category:Game theory",
 "title": "Luc Collard"
}