{
 "id": "1189023",
 "text": "Claude Kiambe (born 16 September 2003), known professionally as Claude, is a Congolese-born Dutch singer and songwriter. He represented the Netherlands at the Eurovision Song Contest 2025 with the song \"C'est la vie\". ==Career== In 2019, Claude took part in the eighth season of The Voice Kids, he made it through to the battle stage of the competition but was eliminated. His debut studio album, Parler français, was released on 15 November 2024 and peaked at number six on the Dutch Albums Chart. The album includes the singles \"Ladada (Mon dernier mot)\", \"Layla (Take Me on Your Way)\", \"Vas-y (Ga maar)\", \"Écoutez-moi\", \"Parler français\", \"La pression\" and \"Je t'aime\". On 19 December 2024, AVROTROS the Dutch broadcaster announced that Claude would be representing the Netherlands at the Eurovision Song Contest 2025. His song \"C'est la vie\", was released on 27 February 2025. On 17 May 2025, he finished 12th in the Grand Final. ==Discography== ===Studio albums=== Title Details Peak chart positions NLD Parler français * Released: 15 November 2024 * Label: Cloud 9 * Format: CD, LP, digital download, streaming 6 ===Extended plays=== Title Details Beste Zangers 2024 (Claude) * Released: 15 November 2024 * Label: Inmediate, Cornelis * Format: Digital download, streaming The Singles Collection * Released: 9 May 2025 * Label: Cloud 9 * Format: Digital download, streaming ===Singles=== Title Year Peak chart positions Certifications Album NLD AUT BEL (Fl) FIN NOR SWE UK Down. \"Ladada (Mon dernier mot)\" 2022 1 — — — — — — * NVPI: Diamond Parler français \"Layla (Take Me on Your Way)\" 2023 11 — — — — — — * NVPI: Platinum \"Vas-y (Ga maar)\" 8 — 44 — — — — * NVPI: Platinum \"Écoutez-moi\" 2024 32 — — — — — — \"Parler français\" — — — — — — — \"La pression\" — — — — — — — \"Je t'aime\" 35 — — — — — — \"C'est la vie\" 2025 2 63 — 44 67 53 52 The Singles Collection \"—\" denotes a recording that did not chart or was not released in that territory. ==Awards and nominations== Year Award Category Nominee(s) Result Ref. 2023 3FM Awards Best Newcomer Himself 2024 Best Artist Best Song \"Layla (Take Me on Your Way)\" Best Collaboration \"Vas-y (Ga maar)\" Qmusic Top 40 Awards Best National Artist Himself MTV Europe Music Awards Best Dutch Act 2025 3FM Awards Best Artist Best Album Parler français ==Notes== ==References== Category:2003 births Category:Living people Category:Dutch singers Category:Eurovision Song Contest entrants Category:Democratic Republic of the Congo people Category:Musicians from North Holland",
 "title": "Claude (singer)"
}