{
 "id": "1189530",
 "text": "Perfect North Slopes is a ski area in Lawrenceburg, Indiana. It is one of only two skiing areas in Indiana. It consists of seven carpet lift(Magic carpets)s and five chairlifts, and two tubing carpets. It has 23 runs, and includes two terrain parks.https://perfectnorth.com/trail-map/https://perfectnorth.com/ ==Resort history== Perfect North Slopes was made by the Perfect family and others in 1980 on the land of their 200 acre farm. It used money from the sale of cows by Clyde & Ella Mae Perfect, and it began with two handle tows and a rope tow on two ski runs on the \"big\" hill, and two rope tows on the bunny slope. In 1984, a chairlift was added where the \"big\" rope tow was, and another chair was added in 1985. In 1987, Perfect North installed a third chairlift, which added one medium and two hard runs. After a long time, they added two more chairlifts, which opened up 4 new ski runs.https://www.snowindustrynews.com/articles/2020/september/rip-clyde-allen- perfect-founder-of-perfect-north-ski-area/ Perfect North Slopes did not allow snowboarding until 2002, making them very late to allow them. Some American places still do not allow snowboarders. In 2006, an avalanche happened on the hill. It was very strange as it happened in the Midwest United States, with just fake snow, and slid on grass. Pictures show that there was bad damage. Heat causing melting made a big heavy snow piece broke off on the steepest part.https://www.reddit.com/r/snowboarding/comments/pzl61o/my_home_mountain_perfect_north_slopes_in/https://recreation- law.com/2008/02/10/avalanche-man-made-snow-to-the- ground/?utm_source=chatgpt.comhttps://liftblog.com/white-perfect-north-slopes- in/ ref>https://liftblog.com/red-perfect-north-slopes- in/https://www.reddit.com/r/skiing/comments/1h47lco/snowmaking_in_indiana_perfect_north_slopes/ On November 20, 2019, Perfect North bought Timberline Four Seasons Resort. It is on the eastern slope of the Canaan Valley close to Davis, West Virginia. Timberline and close Cannan Valley Ski Resort get a lot of snow compared to everything around. Timberline had started breaking down, like sudden broken lifts and other building problems. A team fixed everything for 2020–2021. In 2019, Perfect North Slopes also bought Swiss Valley in Michigan, but did not tell anybody until 2025.https://snocountry.com/news-post/Perfect-North- Acquires-Southern-Michigan-Ski- Area/?postID=6351#:~:text=The%20chalet%20features%20a%20full,for%20Chapter%2011%20bankruptcy%20protection. Perfect North Slopes themselves said that they had fixed and started running First Tracks at Ski Train Depot (an ice cream and coffee shop), but when it happened we do not know.perfectnorth.com/first-tracks/ In 2022, a new half mile (0.804672 kilometer) trail, Ella Mae Way, was made on the right side of the slopes. This was named after one of the makers of Perfect North Ella Mae Perfect. in 2023, the Red Chairlift was replaced by a new four person Chairlift. In the 2024-25 season they replaced Jam Session and remade it left of Ella Mae Way with a beginner terrain park below it. They also added a few snow blowers with generators being able to make more snow than many other generators. Perfect North was also where Nick Goepper practiced. Growing up about 15 minutes from the slopes, Goepper used to spend up to 12 hours a day training at Perfect North before he went to the Winter Olympic Games in Sochi, Russia. Four years later, in Pyeongchang, South Korea, Goepper excitedly asked \"What's up, Perfect North?\" to the camera. ==Activities== The Perfect North Slopes lodge has 3 parts: east, west, and main. The west lodge is the first lodge. The main lodge and the East Lodge came after. The first floor of the main lodge has a small cafeteria. On the second floor of the east lodge, there is a small skiing and snowboarding shop. Near the main ski area is a tubing area that includes 3 parts and 25 lanes. Perfect North Slopes gives ski and snowboarding lessons. Perfect North Slopes has two terrain parks. There is a hard terrain park and an easy terrain park. You can get to the hard terrain park with a chairlift and it has three jumps and a few rails. The easy terrain park is carpet serviced and has easy rails and small jumps. ===Trail list=== Difficulties from easy to hard Easiest/Green Circle : * Cat Walk (Carpets) * Rehearsal (Carpets) * Call back (Carpets) * Understudy (Carpets) * Broadway (Green Chair) More Difficult/Blue Square : * Ella Mae Way (Red Chair) * Backstage (Red Chair) * Tuff Enuff (Red Chair) * Hoyt Connection (White Chair, Orange Chair) * Clyde's Super Slide (Red Chair, White Chair, Orange Chair) * The Meadow (Blue Chair) * Ski Wiz (Green Chair) * Rewind (Orange Chair) * The Far Side (Orange Chair) * Runway (Orange Chair) Advanced Intermediate/Blue Square with Black Diamond : * Intermission [Race Course] (Orange Chair) Most Difficult/Black Diamond : * Center Stage (Red Chair, White Chair) * Deception (Red Chair, White Chair) * Prime Time (Orange Chair) * Special Effects(Orange Chair) Experts Only/Double Black Diamond : * Hollywood (Red Chair) Terrain parks/Orange oval: * Audition Terrain Park(Blue Chair) * Jam Session (Red chair, carpet) Snow tubing is allowed right of Orange Chair. ==Events== Perfect North allows nearby activities. Some are: Small Terrain park clinics, the yearly Big Air competition (Held in Audition Terrain Park), the Mud Stash, and a Spring Carnival. They also host an annual ski swap and ColorFall, which is a fall themed event with lit walkway around the snowmaking pond, a hayride around Perfect North Slopes, and a fall themed menu and it happens a lot every year. ==Food and beverage== Perfect North Slopes sells food and drinks in three different places. *The Chow Corral (In the Main Lodge) *The Grill (On the Main Deck when Weather Permits on Weekends) *Slip-N-Slide Snack Shack (In the Snow Tubing Area) ==Facts== Place: 19074 Perfect Place Lane, Lawrenceberg, Indiana 47025 Coordinates: Status: Temporarily closed for the ski season Height: Top height: Bottom height: Skiable area : Number trails: 23 total 5 easy 10 normal 1 a bit hard 4 hard 1 super hard 2 terrain parks Longest run: The Far Side Lifts: 13 total (3 quad chairs, 2 triple chairs, 8 surface) Terrain parks: 2 Snowfall: Snowmaking: Yes Nightskiing: Yes External_link = www.perfectnorth.com ==See also== *List of ski areas and resorts in the United States *Paoli Peaks ==References== ==External links== * Category:Buildings and structures in Dearborn County, Indiana Category:Ski areas and resorts in Indiana Category:Tourist attractions in Dearborn County, Indiana Category:1980 establishments in Indiana",
 "title": "Perfect North Slopes"
}