{
 "id": "1189413",
 "text": "Neha Sharma (born 21 November 1987) is an Indian actress, model, and businesswoman. Sharma has acted in many films like Yamla Pagla Deewana 2 (2013), Solo (2017), and Tanhaji (2020). She started working in web series with Illegal in 2020. She also acted in short films Kriti and Vikalp, where she played the main roles. == Early life == Neha Sharma was born on 21 November 1987, into a Hindu family in Bihar, She studied at Mount Carmel School in Bhagalpur and later did a fashion design course at the National Institute of Fashion Technology (NIFT) in New Delhi. == Personal life == Her hobbies are cooking, listening to music, reading, and dancing. Sharma has learned the Indian classical dance form called Kathak. She has also learned street hip hop and Latin dances like salsa, merengue, jive, and jazz at Pineapple Dance Studios in London. She sees Kate Moss as her style inspiration. Sharma also dreams of starting her own clothing brand.. ==Filmography== Key Denotes films that have not yet been released === Movies=== Year Title Role Language Notes Ref. 2007 Chirutha Sanjana Telugu 2009 Kurradu Hema Telugu 2010 Crook Suhani Hindi 2012 Teri Meri Kahaani Meera Hindi Cameo appearance Kyaa Super Kool Hain Hum Simran Singhania Hindi 2013 Jayantabhai Ki Luv Story Simran Desai Hindi Yamla Pagla Deewana 2 Suman Khanna Hindi 2014 Youngistaan Anwita Chauhan Hindi 2016 Kriti Kriti Hindi Short film Xuanzang Kumari Mandarin Tum Bin 2 Taran Hindi 2017 Mubarakan Advocate Nafisa Qureshi Hindi Solo Akshara Malayalam Bhama Tamil 2020 Tanhaji Kamla Devi Hindi Ik Sandhu Hunda Si Simran Punjabi 2021 Vikalp Shivani Hindi Short film Aafat-E-Ishq Lallo Hindi 2023 Jogira Sara Ra Ra Dimple Chaubey Hindi Hi Nanna Model Telugu Cameo appearance 2024 Bad Newz Sejal Hindi Cameo appearance 2025 Punjabi Currently Filming 2025 Hindi === Web series === Year Title Role Notes Ref. 2020–2024 Illegal Advocate Niharika Singh 2022 Shinning With The Sharmas Herself 2024 36 Days Farah Zaidi / Suhana Mohan == Awards and Nominations == === Applause Entertainment Screenxx Awards === Year Show Category Result 2024 36 Days Best Female Actor == References == == External links == * * * * * Category:Living people Category:1987 births Category:Indian actors",
 "title": "Neha Sharma"
}