{
 "id": "1189126",
 "text": "On February 12, 2025, the 14th Prime Minister of India, Narendra Modi, made a visit to the United States of America. == Background == === Planning === In January 2025, President Donald Trump announced that Prime Minister Narendra Modi is set to visit the White House in February. The Indian Ministry of External Affairs confirmed coordination between the U.S. and Indian governments for the visit, with spokesperson Randhir Jaiswal noting that exact dates are being finalized. Both the Government of India and the Government of US later officially stated that Modi will arrive in the U.S. on February 12, 2025. == Visit == === Arrival in the United States === On February 12, 2025, at 6:00 PM EST, Indian Prime Minister Narendra Modi landed in Washington DC, after his trip to France. He was greeted at Joint Base Andrews by Vinay Mohan Kwatra, India’s Ambassador to the U.S., along with other important officials and members of the Indian community living in America. === Meeting with Donald Trump === On February 13, 2025, Indian Prime Minister Narendra Modi met U.S. President Donald Trump at the White House, marking Modi as the fourth foreign leader to visit Trump since his inauguration. During their press conference, Modi expressed his pleasure at Trump's re-election. The leaders discussed defense, trade agreements, and immigration, launching \"Mission 500\" to increase trade between India and the U.S. to $500 billion by 2030. Modi also proposed an energy deal, with Trump announcing that India would boost its imports of U.S. oil and gas to help reduce the trade deficit. Donald Trump said that India will buy a lot of oil and gas from the U.S. This year, he and Prime Minister Narendra Modi want to sign a new 10-year plan for the US-India Major Defence Partnership. They also talked about sending back Indian migrants who are in the U.S. illegally, and Modi said India is ready to take them back. Plus, they discussed some new U.S. taxes that are affecting different countries, including India. == References ==",
 "title": "2025 visit by Narendra Modi to the United States"
}