{
 "id": "1190418",
 "text": "Apedemak or Apademak (originally, due to the absence of the /p/ phoneme in Meroitic, it was probably pronounced 'abademak' (Father king) ) was a major deity in the ancient Nubian and Kushite pantheon. Often depicted as a figure with a male human torso and a lion head, and at the temple of Naqa with a snakes body and a lion's head, Apedemak was a war god worshiped by the Meroitic peoples inhabiting Kush. He is often considered the equivalent of Maahes the lion-headed war god of Egypt, despite a claim of the two not being counterparts. As a war god, Apedemak came to symbolize martial power, military conquest, and empire. Apedemak is also closely associated with Amun, the state-sponsored Egyptian deity during the preceding Napatan period, and is assumed to hold an equal level of importance. == Origins == Because inlays of lions were originally used for highly-esteemed individuals in burials, it is possible that these early Kerman lion figures evolved to become Apedemak. However, it is unknown whether the Kermans venerated them as gods with dedicated temples, such as those in later Napatan and Meroitic periods, or if they were symbols of legend, oral tradition or folklore. Kuckertz, Josefine; Lohwasser, Angelika (2019). Introduction to the Religion of Kush. Germany: J.H. Röll GmbH. pp. 115–118. ISBN 978-3-89754-543-4. Apedemak primarily appears during the Meroitic Period. It is likely that precursors of Apedemak existed and that the deity has an origin in the mythology of Kerma culture, where lions had a significant presence in art and amulet designs. Depicted in anthropomorphic fashion, Apedemak seems to have been venerated in an animistic tradition, rather than the polytheistic style of other Nilotic (Egyptian) cultures. Nevertheless, at least by the 3rd century BCE, Apedemak appears to have become an important deity to the peoples living in Upper Nubia. Numerous temples to Apedemak are concentrated in the Butana region, south of the capital city of Meroë. The absence of cult places to him in areas further north points to his southern origin. == Other forms of worship == At present, Apedemak is best understood due to his depictions in temples. However, it is possible that other representations of lions, such as statutes and statuettes, may have been depictions of Apedemak. There are some small objects, such as seals and jewelry, that depict lions that might have represented Apedemak as well. The level by which people worshiped the deity outside of official temple worship is poorly understood at this time. == Images == Naga Löwentempel.jpg|Temple of Apedemak in Naqa. Pylons depicting King Natakamani and Queen Amanitore smiting enemies. The queen holds a sword, the king an axe. Sudan tempel of musawwar es sufra.jpg|Temple of Apedemak in Musawwarat es- Sufra, built by Arnekhamani File:NaqaLionTempleApedemakSnake.jpg|Lion Temple of Naqa: Apedemak represented as a coiled snake with lion's head ==References== ==Further reading== * * ==External links== *Meroitic: 𐦠𐦧𐦡𐦷𐦡𐦨𐦲 (at Wiktionary) * Category:Egyptian gods Category:Lion gods Category:Nubian gods Category:Tutelary gods Category:War gods",
 "title": "Apedemak"
}