{
 "id": "1190731",
 "text": "Rocourt is a section of the Belgian city of Liège located in the Walloon Region in the province of Liège. It is made up of Rocourt-Chaussée, Rocourt- Barrière and Rocourt-Village. It was a municipality in its own right before the merger of the municipalities in 1977. Rocourt was particularly famous for its former maternity hospital, the Saint-Vincent de Paul clinic, which was one of the largest in Belgium. Marie Gillain, David Goffin, Déborah François and Justine Henin were born there. Rocourt is also home to an arsenal, created by Napoleon I in 1803, in order to manufacture 3,000 cannons for the Empire's navy in order to invade England. == History == === Battle of Rocourt === The Battle of Rocourt took place on 11 October 1746. The French, commanded by the Marshal of Saxony, defeated the allies commanded by Duke Charles of Lorraine. In France, the battle is called \"Battle of Rocoux\" corresponding to the name of the village in Walloon that has been retained. === 19th century === At the time of Belgium's independence, the geographer Philippe Vandermaelen invented 89 houses in Rocourt \"more or less well built\"; it does not mention farms, churches or chapels, windmills, or proto-industries. There were 420 inhabitants, who are only involved in agriculture. The inventory also includes details of the natural environment, soils, agricultural production and livestock. The road network is also described: apart from the roadway, there were nine local roads that were not very passable in winter. === RFC Liège === Rocourt is also known for being home to RFC Liège, the oldest football club in Wallonia and bearing the number 4 of Belgian football, since 1921. This club played at the Stade Vélodrome on the Chaussée de Tongeren. For a long time, this place was one of the largest outdoor sports arenas in Belgium. RFC Liège won two successive titles of Belgian Champion in Division 1 football, in 1952 and 1953. As well as a Belgian Cup in 1990. In 1995, the famous Velodrome was razed to make way for a mega-complex of cinemas belonging to the Kinepolis group. After years of wandering, a new stadium was built in Rocourt in 2015. RFC Liège was thus able to return to its historic birthplace. The club now plays in the Challenger Pro League, the second tier of Belgian football. == References == Category:Municipalities of Liège",
 "title": "Rocourt (Liège)"
}