{
 "id": "1190922",
 "text": "Ilias Hossain () is a Bangladeshi journalist and YouTuber.https://dailyinqilab.com/national/news/707671https://www.dailyjanakantha.com/national/news/764082 He reports on political and social issues in Bangladesh on his YouTube channel. He discusses issues of public interest and accountability.https://netra.news/2023/bangladeshs-youtube- dissidents/https://www.jagonews24.com/en/entertainment/news/1252 In January 2024, he was charged in a case. It was filed by the Police Bureau of Investigation under the Digital Security Act.https://www.dhakatribune.com/bangladesh/court/337077/dsa-charges-framed- against-elias-hossain The tribunal issued an arrest warrant for him. He allegedly left the country to \"avoid arrest\".https://www.thedailystar.net/news/bangladesh/crime- justice/news/journalist-elias-hossain-indicted-pbis-dsa-case-3522346 == Early life == Ilias was born in 1984 into a Muslim family in Chuadanga district of Bangladesh.https://www.jagonews24.com/en/entertainment/news/1252 https://web.archive.org/web/20231229092052/https://www.jagonews24.com/en/entertainment/news/1252https://www.youtube.com/watch?v=RPpfALMuoow&t;=135s == Career == Ilias started his career as a presenter of a program called \"Good Morning Bangladesh\" on Channel One. Later, he worked as a presenter of the Bengali crime program \"Ekusheyer Chokh\" on Ekushey Television. He first appeared in front of the TV camera on Bangladesh Television's program called \"Natun Kudi\". == Life in exile == During the Awami League government, Elias' investigative work brought him into direct conflict with powerful figures. His reports exposed allegations of government corruption, enforced disappearances, extrajudicial killings, and abuse of power. In 2015, for growing threats to his safety, Elias left Bangladesh. He sought political asylum in the United States of America.https://www.jagonews24.com/law- courts/news/871747https://www.dhakapost.com/national/210738 While in exile, Elias continued his work using digital platforms.https://www.bhorerkagoj.com/national/765042https://www.thedailystar.net/news/bangladesh/crime- justice/news/journalist-elias-hossain-indicted-pbis-dsa-case-3522346 He has millions of followers. He has used this large audience to uncover important issues in Bangladesh. Despite living abroad, his commitment to investigative journalism has remained unwavering. It allowed his influence to continue.https://www.dhakatribune.com/bangladesh/court/337077/dsa-charges- framed-against-elias-hossain == Legal issues == On 27 September 2022, the Police Bureau of Investigation(PBI) chief, Additional IGP Banaj Kumar Majumder, filed a case against former OC Babul Akhter, journalist Ilias Hossain and two others for allegedly compromising the investigation and spreading false information. The Dhanmondi police registered the case based on a report by SI Jahangir Alam. Babul's father and brother were also among the other accused. Earlier, Babul had sought court permission to file a case against six officers of the Police Bureau of Investigation for alleged torture, but the court dismissed his appeal.https://www.dhakatribune.com/bangladesh/294875/pbi-chief-sues-babul- akter-journalist-eliashttps://www.dhakatribune.com/bangladesh/309795/charges- pressed-against-ex-sp-babul-youtuber Additionally, the Dhaka Cyber ​​Tribunal has ordered the seizure of journalist Ilias Hossain's property in a case filed under the Digital Security Act. The case alleged that Ilias had provided and disseminated false and misleading information about the Mitu murder case. Judge Zulfikar Hayat issued the order on August 31, 2023.https://en.shampratikdeshkal.com/bangladesh/news/230840550/the-court- orders-to-seize-the-properties-of-journalist-elias- hossainhttps://bangla.bdnews24.com/bangladesh/xvqqoijro9https://www.asiansomoy.com/204#google_vignette In January 2024, Elias was charged in a case filed by the Police Bureau of Investigation under the Digital Security Act. The tribunal issued an arrest warrant against him in this case. New York police arrested Elias on charges of threatening and attempting to extort money from a person. He was arrested in New York City in February 2024.https://bdnews24.com/bangladesh/g0mmahgxz7https://thefinancialexpress.com.bd/national/youtuber- elias-hossain-arrested-in-new-york-over-extortion- attempthttps://en.ittefaq.com.bd/7579/elias-hossain-arrested-in-new-york-over- extortion On February 19, 2024, Elias was arraigned in Queens Criminal Court. The judge granted him bail.https://dailyinqilab.com/foreign-life/news/640058 ==Awards == * Awarded the Television Reporters Association of Bangladesh (TRAB) Award 2024 in recognition of investigative journalism.https://dailyinqilab.com/national/news/728265#goog_rewarded == References == == Other websites == * Official YouTube Channel Category:1984 births Category:Bangladeshi YouTubers Category:Bangladeshi journalists Category:Living people Category:Bangladeshi exiles Category:Bangladeshi anti- fascists",
 "title": "Elias Hossain (journalist)"
}