{
 "id": "1190001",
 "text": "Oknarel or Oknaren, also known as Thengnarel, or Thangnarel, is a forest deity in Meitei mythology and traditional Meitei religion (Sanamahism) of Kangleipak (Manipur).Kirti Singh, Moirangthem. Recent Researches in Oriental Indological Studies: Including Meiteilogy. India: Parimal Publications, 1998. p. 140 He originates from the mountainous region of Mount Koubru. Within various interpretations of Meitei mythology, he is regarded either as an incarnation of God Koubru, his son, or as an embodiment of Lainingthou Sanamahi. Traditional narratives describe Ibudhou Oknarel as possessing notable proficiency in Meitei traditional sports and Meitei martial art skills, including polo (Sagol Kangjei), spear throwing, spear combat, and the use of the bow-slingshot (Shairong). Oknarel is one of the fourteen deities who play Sagol Kangjei, the traditional Meitei polo.Tensuba, Keerti Chand. Genesis of Indian Tribes: An Approach to the History of Meiteis and Thais. India: Inter- India Publications, 1993. p. 111 In the game, he holds the role of \"panjengchang\", which means \"No. 2 forward\" in fielding position, opposite to God Nongshaba. The worship of Ibudhou Oknarel, along with his daughter, the goddess Macha Ibemma Khudithibi, has been maintained by various communities, notably the Meitei people and the Rongmei (Kabui) people. Ritual observances and offerings are conducted at two primary locations: the sanctum-sanctorum (main shrine) located in Ningthoukhong, and the sacred forest grove at Khudithibi, situated near Sadu Khuroi village in Churachandpur district, Manipur. == Titles == Within the royal context, particularly in the palace of Manipur, Oknarel is referred to as Lai Hanuba, which translates to \"Grand Old Deity.\" The term Iputhou, an earlier form now altered to Ibudhou, through linguistic change, is traditionally used as a prefix to the deity’s name. == Martial skills == Ibudhou Oknarel, a forest deity (Umang Lai), is said to have journeyed across the Koubru mountain ranges and the Leimaton hills to reach Thingpui village (now Laimanai Kabui). There, he performed Ta-Khousaba, a spear-wielding exercise, under a large tree near a stream, both to mark his arrival and to drive away evil forces. During this, he practiced Laan-Yengba (a gesture of searching for enemies) and Laan-Koiba (a gesture of encircling the enemy). The stream where this took place came to be known as Khousa-lok, later altered to Khujairok. == Identity == In response to the disturbance caused by the unknown presence, Ibudhou Thangjing traveled from the northern foothills and met Ibudhou Oknarel. This meeting was considered a significant encounter, symbolizing the incarnation of Lord Koubru as Oknarel (with Oknare meaning \"met\" and Rel meaning \"grand\"). A contest of strength between the two deities, referred to as Thengnare or Sathengnare, led to the creation of the name Thengnarel, which later evolved into Ibudhou Thangnarel. Thus, Oknarel and Thangnarel came to represent two aspects of the same divine entity. == Mythology == === Divine brotherhood and arrival at Kege Moirang === According to Meitei mythology, Oknarel and Thangnarel are metaphorically described as two faces of the same coin. Through a series of divine trials, they recognized each other as brothers. Ibudhou Thangjing extended a warm welcome to his elder brother, Ibudhou Oknarel, inviting him to settle in Kege Moirang Leipak. Oknarel, abandoning his quest for a suitable dry land, followed the path indicated by Thangjing and stayed in the foothills of Kege. === Settlement at Sadu Village === Oknarel spent a significant period in Kege before returning to Sadukhuroi, where he rested at Uwung Pareng (interpreted as “Rows of Oak Trees”) near the gateway of Sadu village. The Rongmei (Kabui) community of Sadu continues to observe annual offerings of flowers, food, and livestock in his honor. This tradition highlights the interconnectedness of various ethnic groups in the valley and hills of Manipur. === Integration with the local community === Disguised as a young man from the Tangkhul community (Haoba Tangkhul), Ibudhou Oknarel lived among the Kabui women. He eventually entered into a divine union with Khunbuleima (also known as Khuningthou Tompokhanbi), daughter of the village chief (Khullakpa). They led a nomadic agrarian lifestyle, including hunting, fishing, farming, and firewood collection, and had a daughter named Macha Ibemma. === Communal farming and the spear legend === During communal cultivation activities, Oknarel marked his farmland by throwing his spear toward the southeast, declaring that the site where it landed would be his field. The community followed him to Lamlemumang, located behind the Ningthoukhong Kha Khunou area, and began cultivation. === Origin of rice cultivation === While resting after farm work, Oknarel traveled to Terapokpi and shot a wild pigeon (Lam Khunutharikpi, also known as Leimakhunu – Streptopelia chinensis) perched on a Tera tree (Bombax ceiba). The pigeon was believed to be a divine messenger. Inside its crop were wild rice seeds, which Oknarel sowed with the Sadu villagers. This act is regarded as the introduction of rice cultivation in the region. A ritual seed-sowing ceremony at Khunu Pamfenlou commemorates this event annually. === Agricultural exchange and ritual continuity === Oknarel later shared rice seeds with his younger brother Thangjing, who began rice cultivation in Kege Moirang. The tradition of returning rice after harvest during the Lai Haraoba festival remains active, symbolizing agricultural reciprocity. Thangjing's shrine in Ithing continues to follow the ritual of returning rice to Oknarel during Ibudhou Oknarel Haraoba. === Domestication and spread of rice === The domestication and spread of rice in the valley of Manipur are documented in ancient Meitei texts such as Kangparon and Poireiton Khunthoklon. These works mention early rice varieties like Morshy Thangyi (weedy rice, Oryza sativa f. spontanea), Tongnu Mathi, Likshi Khalil Mathi, Yaisel Yao Phou Mathi, and Chakchal Chahao Mathi. The term “Mathi” refers to seeds. According to these texts, the first rice seeds were brought by Poireiton, an immigrant from the East, considered the progenitor of the Khuman and Luwang clans. The goddess of rice, Phouoibi, is also believed to have arrived with Poireiton from Khamnung. === Fate of Macha Ibemma === As the water level in the valley decreased, Oknarel sought new settlement areas. During the journey, Macha Ibemma injured her toe on a stone and was unable to walk due to severe bleeding. Although Oknarel stopped the bleeding using medicinal herbs, she could not be moved. The location became known as Napithabi. The surrounding Rongmei and Meitei villagers continue to offer plants and flowers at this site, particularly at the large oak tree where she was treated. The hill is called Khudithibi, meaning “where Macha Ibemma stayed.” === Departure from daughter === Despite all efforts, Macha Ibemma remained at the hillock. Oknarel and Ibendhou mourned deeply, expressing sorrow comparable to human parental grief. Before parting, Oknarel promised annual visits with offerings of food and gifts at Kabokthel, a sacred meadow near Khudithibi. This site continues to hold ritual importance. == Annual rituals and worship practices == === Ritual visits to Khudithibi === Prior to the commencement of the annual Lai Haraoba and Hiyang Tannaba festivals, Ibudhou Oknarel and Ibendhou, accompanied by Amaibas, Amaibis, and their disciples, are traditionally believed to undertake a ritual journey to Khudithibi. They are said to travel by palanquin, bringing offerings that include food, fruits, and flowers. This ritual visit is considered an invitation for the participation of their daughter, Macha Ibemma Khudithibi, who, according to mythological accounts, waits at Kabokthel in anticipation of her parents’ arrival. The ceremonial procession is referred to as Lai- Chingkaba. === Settlement at Ningthoukhong and consecration of idols === Following the departure from Khudithibi, Ibudhou Oknarel is believed to have settled near the streams of Ningthoukhong along with his consort, Ibendhou Khunbungambi. At a later period, an apparition or divine revelation reportedly occurred to an individual named Pee-thadoi, who is regarded as an ancestor of the Moirangthem clan, believed to have migrated from Moirang. This event led to the creation of sacred effigies (Komai) of both Ibudhou and Ibendhou, which were subsequently consecrated at the current sanctum in Ningthoukhong. === Continuation of ritual practices === Since the establishment of the shrine, ritual practices such as Lai Haraoba, Lai Phou Hunba, Lai-Chingkaba, and Hiyang Tannaba have been observed regularly. The precise historical origins of these rites remain undetermined, but their continuity is maintained in both ritual form and community participation. == Fertility beliefs == Historically, access to the shrine of Ibudhou Oknarel was restricted to members of the Manipur's royal family (Ningthouja dynasty), with worship permitted only on Saturdays and Sundays. Over time, the deity became associated with fertility and was regarded by devotees—particularly childless women—as a source of divine intervention in matters of conception. Royal women, including queens and princesses, are reported to have visited the shrine for this purpose. One documented example includes M.K. Binodini Devi, a member of the royal family, who reportedly conceived after visiting the shrine following a prolonged period of infertility. In contemporary practice, women from various parts of the state continue to visit the shrine at Ningthoukhong, seeking blessings related to childbirth. == Related pages == * Lai Haraoba in Myanmar * Lai Haraoba in Bangladesh * Lai Haraoba in Tripura == References == Category:Meitei gods and goddesses",
 "title": "Oknarel"
}