{
 "id": "1190239",
 "text": "Vlad Suglobov (born in 1977) is a Russian-American entrepreneur based in California since 2011. Vlad Suglobov: Chief Executive Officer & Director, G5 Entertainment AB The Wall Street Journal 2023 G5 Entertainment AB ANNUAL REPORT p.70 He co-founded mobile gaming company G5 Entertainment in 2001, best known for its mobile-app games such as Hidden City, Sherlock and Jewels of Rome. Gaming Firm Upended by War Opens New Hubs in Europe Bloomberg Hall of Fame: Vlad Suglobov ==Early life== Suglobov was born in Moscow. As a child, Vlad was engaged in programming and soon started coding his own games. Kodaren från Sovjet In 2000 he graduated from Lomonosov Moscow State University with M.Sc. in Mathematics and Computer Science. ==Career== In the mid-1990s, while still a freshman, he got his first job as a game programmer at one of the very first game development studios in Moscow. In 2001, he co- founded G5 Entertainment as CEO, a position he continues to hold. Vlad kept working on game engine code and later shifted his focus to business. When the iPhone launched in 2008, he started G5’s publishing division. Vlad Suglobov: Co-Founder, CEO and Board Member This helped bring popular PC hidden object games to mobile devices, along with G5’s own games. In late 2011, Vlad moved to the San Francisco Bay Area to build G5’s marketing operations in the U.S., the company’s biggest market. Vd: Fler medarbetare flyr från Ryssland än Ukraina By 2013, as free-to-play (F2P) games became more popular on mobile, he led G5 to focus on this model. On the back of 42% Q1 FY14 growth, G5 steps up with OMX Stockholm listing He prioritized quality, fewer new releases, and global cross-platform distribution. “Panic is stupid. The long—term investor who does not succumb to it wins,” – Vlad Suglobov about the history of G5 Games Vlad has played a key role in G5’s growth and is still deeply involved in the company’s strategy, marketing, and product development. Three questions with G5 Entertainment’s CEO Vlad Suglobov == References == Category:1977 births Category:Living people Category:Video game developers",
 "title": "Vlad Suglobov"
}