{
 "id": "1190941",
 "text": "Juliet Bawuah is a sports journalist from Ghana who has worked with major media outlets. She has interviewed important figures like FIFA President Gianni Infantino and former World Player of the Year and ex-President of Liberia, George Weah. She became well known after her interview with Infantino during a FIFA Summit in Mauritania, a country in North-West Africa. Juliet also started the Africa Women's Sports Summit, an event that brings together top female sports professionals in Africa and those who want to follow in their footsteps. == Education == After finishing secondary school at Mawuko Girls Senior High School, Bawuah earned a Bachelor of Arts degree in Journalism and Public Relations from the Ghana Institute of Journalism. She also got a Diploma in Communication Studies from the African University College of Communications. She studied at the Radio Netherlands Training Center in the Netherlands as well. In 2018, she completed a Master’s degree in International Public Relations and Global Communications at Cardiff University. == Career == Before joining TV3 in July 2013, Bawuah worked with several media outlets including Goal.com, CITI FM, the Globe Newspaper, Cafonline.com, Metro TV, and ETV. Before going to Cardiff University for further studies, she worked at Africanews, a sister station of Euronews based in Congo, where she hosted the show Football Planet and covered the 2017 AFCON tournament. She has also appeared on the BBC and contributes to the Turkish broadcaster TRT. She started the Africa Women's Sports Summit, which was first held on May 15, 2019, in Accra. The summit brings together top female sports figures in Africa along with young women who want to enter the sports industry. She is the founder of Africa Women's Sports Summit, which was first hosted on 15 May 2019 in Accra. The Africa Women's Sports Summit is a gathering of Africa's leading female sports names and aspiring ones. She was also chosen to be a member of the Local Organizing Committee (LOC) for the Women’s Premier League Super Cup. == Philanthropy == Bawuah was an ambassador for the UNAIDS ‘Protect the Goal’ campaign. She was one of the well-known Ghanaians who supported the campaign, which was a joint effort by UNAIDS and FIFA to use sports to raise awareness and help prevent the spread of HIV. == Achievements and awards == In 2015, Bawuah was nominated for the Sport Media Pearl Awards. In 2017, she was chosen to be part of the expert panel that votes for the African Footballer of the Year Awards, organized by the Confederation of African Football. She later joined the voting panel for the BBC African Footballer of the Year, one of the most respected awards in football. She was also one of 50 African journalists who helped choose the winner of the first ‘Africa Football Shop Player of the Year Award.’ In 2021, she won the African Woman in Sport award at the GSport Awards. At the 26th Ghana Journalists Awards, she was named Sports Journalist of the Year. == References == Category:Year of birth missing (living people) Category:Living people",
 "title": "Juliet Bawuah"
}