{
 "id": "1190742",
 "text": "Hanan Ashrawi (October 8, 1946) is a Palestinian scholar, activist and politician. She spoke for Palestine at the Madrid Peace Talks in 1991. She was also the first woman to be elected to the Palestine Liberation Organization (PLO). == Early Life and Education == Ashrawi was born in Ramallah, Palestine (now occupied West Bank) to an Anglican Christian family. Her father helped found the PLO. She got her Master's degree at the American University in Beirut. She also has a PhD in English literature from the University of Virginia. She was part of the General Union of Palestinian Students during her studies. == Scholarly Career == Ashrawi was a professor of medieval and comparative literature at Birzeit University in the West Bank from 1973 onwards. There she was also dean of the School of Arts. She worked there until the Israeli army closed it after the first intifāḍa in December 1987. She spoke out against the Israeli occupation in Palestinian Territories using her academic work. == Political Career == In 1996 she became the Authority Minister of Higher Education and Research in Palestine. She resigned 2 years later. She also represented Jerusalem in the Palestinian Legislative Council in 1996. Ashrawi became the first female member of the Executive Committee of the PLO in 2009. In 2022, she made an important call in Washington, DC, on human rights, justice, and Palestine's future. Hanan Ashrawi considers that Palestine should be a free and independent country that is backed by the international community and protected by international law. == Civil Society Work == She founded the Independent Commission for Human Rights in 1994, where she served as commissioner-general for a year. Ashrawi founded the Palestinian Initiative for the Promotion of Global Dialogue and Democracy (MIFTAH) in 1998. She is the head of the board of directors. She is also the founder of the National Coalition of Accountability and Integrity in 1999. During her time at Birzeit University, she helped those affected by Israeli occupation. == Awards == * 1992: Marissa Bellisario International Peace Award * 1994: Pio Manzu Gold Medal Peace Award * 1996: Jane Addams International Women's Leadership Award * 1999: International Women of Hope \"Bread and Roses\" * 2002: Olof Palme Prize * 2003: Sydney Peace Prize * 2005: Mahatma Gandhi International Award for Peace and Reconciliation * 2006: d'Officier de l'Ordre national de la Légion d'Honneur",
 "title": "Hanan Ashrawi"
}