{
 "id": "1190361",
 "text": "Rolus in the Outskirts is an upcoming Indie top-down Action-adventure game for PC and Nintendo Switch. Developed by a small team known as Penguins at Work and funded via Kickstarter, the game draws inspiration from classic titles like The Legend of Zelda, as well as modern indie games such as Undertale and The Binding of Isaac. == Overview == You play as a cyclops, Rolus, living on the outskirts of a poverty-stricken town. The game features a blend of exploration, combat, and humorous interactions, all wrapped in crude hand- drawn animation. == Plot == The game follows Rolus, a naïve and persistent character driven by an insatiable hunger for a simple fast-food burger. One day, during his routine scavenging, he encounters a mysterious glowing crystal, Chris the Crystal Baby, which bonds with him. Chris possesses healing powers, making him both a valuable ally and a target for nefarious forces seeking to harness his powers. As Rolus ventures through the dangerous and absurd world of The Outskirts, he encounters a cast of eccentric characters, faces bizarre enemies and boss fights, and seeks to gather enough change to satisfy his craving for a burger. == Gameplay == * Top-Down Combat: Players wield a hand-me-down pistol and engage in combat against various foes, including ducks, junkies, and aggressive gnomes. * Resource Management: Instead of health pickups, players collect crystal shards to trade for healing or powerful crystal bullets that pierce multiple enemies. * Exploration: The game emphasizes humor and absurdity in exploring a backwater town. * Boss Battles: Unusual boss fights pit Rolus against larger-than-life bullies and monsters. * Innovative Inventory System: Items can be used in two modes—normal interaction or self-application—adding strategic depth. == Characters == * Rolus: The protagonist, a curious and hungry cyclops with a carefree attitude. * Chris the Crystal Baby: A mysterious floating orb with healing abilities, bonded to Rolus. * Cylo: A mischievous character who delights in tormenting Rolus. * Nilt: A laid-back guide who believes in alien conspiracies. * Nophie: A dreamy girl convinced that Rolus is her perfect match. * Carmen: A latina McDonald's employee who also appears in the Doobus Goobus video. == Development and Team == The game was developed by a small team led by director and artist Toony, with contributions from: * Fig, writer * JasonTGF, lead designer and programmerhttps://x.com/jason_tgf * WasabiHeat, lead programmer and graphic designerhttps://x.com/wasabiheat * PostElvis, soundtrack composerhttps://soundcloud.com/postelvis/rolling-the-ball-rolus-in-the- outskirts-ost * Cheeps, sound design and additional arthttps://sonicfangameshq.com/forums/showcase/rolus-in-the-outskirts-summer- demo.1461/ * Davestoons, key artist and character designerhttps://www.newgrounds.com/art/view/davestoons/rolus-in-the-outskirts- cast The team drew inspiration from titles like South Park, Mother 3, FLCL, and Yume Nikki, as well as personal memories and underground art scenes.https://www.vice.com/en/article/rolus-in-the-outskirts-combines-zelda- esque-exploration-and-gameplay-with-early-2000s-flash-cartoons-and-its-on- kickstarter-now/ === Kickstarter Campaign === The project was successfully funded on Kickstarter, with a goal of $50,000, raising a total of $91,315 from 1,611 backers. The campaign offered various rewards, including digital copies of the game, artbooks, soundtrack, in-game character appearances, and personalized in-game graffiti or quests.https://x.com/RolusOutskirts/status/1923512212183765305?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet The Youtuber Doobus Goobus made an animation promoting the Kickstarter which mainly resulted in the campaign being successful.https://x.com/RolusOutskirts/status/1922929108297605182 They made stretch goals up until May 31, 2025, if $60k they would add codec calls inspired by Metal Gear Solid and Undertale, if $70k they would make a Spanish localization, if $80k they would add a bonus winter themed episode, and if $90k they would make a Japanese localization. If $100k they would have added Local Multiplayer Mode.https://x.com/RolusOutskirts/status/1924217508887671140?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweethttps://x.com/RolusOutskirts/status/1928848996761518242?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet == References == == External Links == * Steam Page * Twitter Category:Indie video games Category:Single-player video games Category:Video games developed in the United States Category:Nintendo Switch games",
 "title": "Rolus in the Outskirts"
}