{
 "id": "1190700",
 "text": "== Geographical Position == Mhaibib (also spelled “Muhaibib”) is a village located at 33° 9’ 17”N, 35° 30’ 20” E in the Marjayoun District of the Nabatieh Governorate in Lebanon. Only about 2 kilometres separate the village and the Israeli border.{ \"type\": \"FeatureCollection\", \"features\": [ { \"type\": \"Feature\", \"properties\": {}, \"geometry\": { \"type\": \"Point\", \"coordinates\": [ 35.511932, 33.154224 ] } } ] }The village is located in the very southern part of Lebanon, close to the border with Israel and the Blue Line. Speaking from the etymological perspective, the meaning behind the name ‘Mhaibib’ means ‘the lover’/ ‘the beloved’. The Israeli military confirmed that the cause behind the bombing of the village was to destroy Hezbollah’s underground tunnels. On the other hand, the village has explicit connection to the Islamic religion itself: there is an important shrine of Prophet Benjamin, who was the son of the Prophet Jacob. == Relevance == During the start of the 2024 Israeli invasion of Lebanon, the Mhaibib was mostly destroyed by an Israeli missile strike. A video started circulating on October 16th, 2024 of Israeli Defence Forces (IDF) soldiers viewing the destruction of the village. The IDF later made a statement that the video was allegedly of the destruction of a large tunnel network underneath the village. This tunnel was to be used by Hezbollah to bring people and weapons closer to the front. The Lebanese narrative believes that the purpose of the attack was to erase the important cultural and religious sites in the village. Before Israeli bombing After Israeli bombing Population around 1100 0 == Ties to the Hezbollah == Hezbollah in Lebanon has been supported by Iran, and as Israel opposes its right to exist, it is perceived by it as a terrorist organisation. Hezbollah has originated from the militias of the Shia islamists, that were primarily created and organised to fight against the Israeli invasion of southern Lebanon during Lebanon’s civil war at the end of the 20th century. Ever since, Hezbollah has been building its strong network in the whole country, reaching almost every aspect of the Lebanese country’s structure. Israel keeps striking and bombing Lebanese cities and villages as their main purpose is to undermine and decimate Hezbollah’s structures.",
 "title": "Mhaibib"
}