{
 "id": "1190545",
 "text": "George Washington and Jefferson National Forests are two big public forests in the United States. They are managed together as one forest area. The forests are 1.8 million acres (7,300 km²). Most of the land is in the Appalachian Mountains in the states of Virginia, West Virginia, and Kentucky. Around 1 million acres (4,000 km²) of the forests are wild and have no buildings or roads. Some parts of the forests are called wilderness areas. These places are protected and cannot be developed in the future. == History == The George Washington National Forest started on May 16, 1918. It was first called the Shenandoah National Forest. It was renamed in 1932 after George Washington, the first President of the United States. Later, in 1933, the Natural Bridge National Forest was added to it. The Jefferson National Forest was created in 1936. It was made from parts of the George Washington Forest, the Unaka Forest, and other land. In 1995, the two forests were joined together for management. The main office is in Roanoke, Virginia. == Plants and animals == The George Washington and Jefferson National Forests have many different kinds of plants. There are more than 50 kinds of trees and over 2,000 kinds of shrubs and small plants. The forests also have about 230,000 acres (930 km²) of old-growth trees. These are trees that have been growing for a very long time and have not been cut down. Many different types of forests grow in these areas. Some places with old-growth forests include Peters Mountain, Mount Pleasant National Scenic Area, Rich Hole Wilderness, Flannery Ridge, Pick Breeches Ridge, Laurel Fork Gorge, Pickem Mountain, and the Mount Rogers National Recreation Area. The Ramsey's Draft Wilderness and Kimberling Creek Wilderness are mostly old-growth forests. Many kinds of animals live in the forests. The American black bear is common. There is even a short hunting season to help keep the number of bears under control. Other animals in the forests include white-tailed deer, bobcat, bald eagle, weasel, otter and marten. == References == Category:Protected areas of Virginia Category:Appalachian Mountains",
 "title": "George Washington and Jefferson National Forests"
}