{
 "id": "1190107",
 "text": "The New Mexico Senate () is the upper house of the New Mexico Legislature. The Senate has 42 members, with each senator representing an equal amount of single-member constituent districts across the state. All of the senate districts are divided to contain a average population of 43,300 state residents. Members of the Senate are elected to four-year terms, without term limits. The Senate meets at the New Mexico State Capitol building in Santa Fe. == Composition == The makeup of the Senate for sessions from 2009–present is: Affiliation Party (Shading indicates majority caucus) Total Democratic Republican Vacant End 2008 24 18 42 0 2009–2012 27 15 42 0 Begin 2013 25 17 42 0 End 2016 24 18 2017–2020 26 16 42 0 2021–2024 27 15 42 0 Begin 2025 26 16 42 0 Latest voting share === Leadership === Position Senator District President/Lieutenant Governor Howie Morales President pro tempore Mimi Stewart 17 Majority Leader Peter Wirth 25 Majority Whip Michael Padilla 14 Minority Leader William Sharer 1 Minority Whip Pat Woods 7 === Current members === District Senator Party Residence First elected Counties represented 1 William Sharer Rep Farmington 2000 San Juan (part) 2 Steve D. Lanier Rep Aztec 2024 San Juan (part) 3 Shannon Pinto Dem Tohatchi 2019† McKinley (part), San Juan (part) 4 George Muñoz Dem Gallup 2008 Cibola (part), McKinley (part), San Juan (part) 5 Leo Jaramillo Dem Española 2020 Los Alamos (part), Rio Arriba (part), Sandoval (part), Santa Fe (part) 6 Roberto Gonzales Dem Ranchos de Taos 2019† Los Alamos (part), Rio Arriba (part), Santa Fe (part), Taos (part) 7 Pat Woods Rep Broadview 2012† Curry (part), Harding (part), Quay (part), Union 8 Pete Campos Dem Las Vegas 1990 Colfax, Guadalupe, Harding (part), Mora, Quay (part), San Miguel (part), Taos (part) 9 Cindy Nava Dem Bernalillo 2024 Bernalillo (part), Sandoval (part) 10 Katy Duhigg Dem Albuquerque 2020 Bernalillo (part) 11 Linda M. Lopez Dem Albuquerque 1996 Bernalillo (part) 12 Jay C. Block Rep Rio Rancho 2024 Bernalillo (part), Sandoval (part) 13 Debbie O'Malley Dem Albuquerque 2024 Bernalillo (part) 14 Michael Padilla Dem Albuquerque 2012 Bernalillo (part) 15 Heather Berghmans Dem Albuquerque 2024 Bernalillo (part) 16 Antoinette Sedillo Lopez Dem Albuquerque 2019† Bernalillo (part) 17 Mimi Stewart Dem Albuquerque 2015† Bernalillo (part) 18 Natalie Figueroa Dem Albuquerque 2024 Bernalillo (part) 19 Ant Thornton Rep Sandia Park 2024 Bernalillo (part), Sandoval (part), Santa Fe (part), Torrance (part) 20 Martin Hickey Dem Albuquerque 2020 Bernalillo (part) 21 Nicole Tobiassen Rep Albuquerque 2024 Bernalillo (part) 22 Benny Shendo Dem Jemez Pueblo 2012 Bernalillo (part), McKinley (part), Rio Arriba (part), San Juan (part), Sandoval (part) 23 Harold Pope Jr. Dem Albuquerque 2020 Bernalillo (part) 24 Linda Trujillo Dem Santa Fe 2024 Santa Fe (part), Socorro (part) 25 Peter Wirth Dem Santa Fe 2008 Santa Fe (part) 26 Moe Maestas Dem Albuquerque 2022† Bernalillo (part) 27 Pat Boone Rep Elida 2024 Chaves (part), Curry (part), De Baca, Lea (part), Roosevelt 28 Gabriel Ramos Rep Silver City 2024 Grant (part), Hidalgo (part), Luna (part) 29 Joshua A. Sanchez Rep Bosque 2020 Socorro (part), Valencia (part) 30 Angel Charley Dem Acoma 2024 Bernalillo (part) 31 Joe Cervantes Dem Las Cruces 2012 Chaves (part), Doña Ana (part), Otero (part) 32 Candy Ezzell Rep Roswell 2024 Chaves (part), Eddy (part) 33 Nick Paul Rep Alamogordo 2024 Lincoln, Otero (part) 34 James G. Townsend Rep Artesia 2024 Eddy (part), Otero (part) 35 Crystal Brantley Rep Elephant Butte 2020 Catron, Doña Ana (part), Grant (part), Hidalgo (part), Luna (part), Sierra, Socorro (part) 36 Jeff Steinborn Dem Las Cruces 2016 Doña Ana (part) 37 William Soules Dem Las Cruces 2012 Doña Ana (part) 38 Carrie Hamblen Dem Las Cruces 2020 Doña Ana (part) 39 Liz Stefanics Dem Los Cerrillos 2016 San Miguel (part), Santa Fe (part), Torrance (part), Valencia (part) 40 Craig Brandt Rep Rio Rancho 2012 Sandoval (part) 41 David Gallegos Rep Eunice 2020 Eddy (part), Lea (part) 42 Larry R. Scott Rep Hobbs 2024 Chaves (part), Eddy (part), Lea (part) † Senator was originally appointed. == Past composition of the Senate == == See also == * New Mexico House of Representatives == Notes == == References == == External links == * Official government website * Project Vote Smart – State Senate of New Mexico",
 "title": "New Mexico Senate"
}