{
 "id": "1190682",
 "text": "== Protests == After the death of Mahsa Amini on 16 September 2022, the slogan \"Zan, Zendegi, Azadi\" (in Kurdish: \"Jin, Jiyan, Azadi\", meaning \"Woman, Life, Freedom\") became very popular, with people singing it at Mahsa Amini’s funeral and at Tehran University. \"مهسا امینی با شرکت گسترده مردم به خاک سپرده شد\" [Mehsa Amini was buried with the large participation of people]. dw.com (in Persian). 17 September 2022. Archived from the original on 1 December 2022. Retrieved 19 May 2025. It quickly spread across Iran and around the world. Women started protesting to demand bodily autonomy and gender equality. Many of them went out in the streets, removing their headscarves, burning them, cutting their hair, or wore white to show their discontent against the hijab rules.Merve Çalhan (2023). \"Amini Protests: Vowing for a New Commitment Between Society and State.\" *The Journal of Iranian Studies*, 7(1): 111 DOI link Soon, men joined the protests, and the youth across the country came together to mobilise, speading from big cities to smaller towns and turning into a national movement. These became some of the largest protests in Iran since the 1979 Islamic Revolution. These protests, also called the Mahsa Amini Protests, showed the strength of the Woman, Life, Freedom movement. Although they began because of the hijab laws, other problems helped the protests grow, with people also starting to ask for bigger political changes, such as gender inequality, authoritarian rule, and economic difficulties. For example, many young people, especially women, have a good education but cannot find jobs. Almost 40% of girls aged 14 to 25 are neither working nor studying. One important part of the movement was that it united people from different groups. For example, Persians and Kurds protested together, and people from different ethnic, religious, and political backgrounds stood side by side. The slogan \"Woman, Life, Freedom\" became a symbol of unity and change. The government answered with violent repression. Police used tear gas, gunfire, censorship, and Internet blackouts to stop the protests.Weronika Strzyżyńska and agencies (2022). \"Iran blocks capital’s internet access as Amini protests grow.\" *The Guardian*, 22 September 2022. Link By February 2023, at least 551 people had been killed, including 68 minors. Around 15,000 people were arrested, and seven were executed after unfair trials. == International reaction == The slogan \"Woman, Life, Freedom\" was shared widely in the international media. Photos of women removing their hijabs became powerful symbols of the movement. On social media, many celebrities cut their hair in support of Iranian women under the hashtag #Mahsa_Amini. In the first months of the protests, people around the world organized events to support the movement. Important demonstrations happened in Europe and North America. One of the largest was in Berlin, Germany, where tens of thousands of people came together on 22 October 2022. On the one-year anniversary of Mahsa Amini’s death, thousands of people joined again to show their support for the movement and to remember her. == History == The women’s rights movement in Iran dates back to the early 20th century. Long before the slogan Women, Life, Freedom, became popular female activists tried to influence developments during the Constitutional revolution of 1905 and the Islamic Revolution in 1979. Their struggle for justice and equality in a deeply male-oriented society remained difficult. Political and religious leaders regarded women as not competent and second class. Demands for the right to vote were rejected over a long time. After several decades the right to vote for women was granted in 1963. With the Iranian Revolution all hopes for change, participation, and gender equality were destroyed. The Islamic Republic was founded and the sharia law introduced. The situation especially for women became increasingly repressive. Women were discriminated and banned from social life. The regime tried to silence them and to make women invisible. Modern clothing was forbidden. Women and girls from six years on were dictated to wear a hijab. Those who challenge these orders run the risk of getting detained, jailed and punished by the morality police. The women’s movement was thrown back for years. Some tried to work within the Islamic system for their rights. Others withdrew into the private sphere where the regime wanted them to stay. Against all odds, the resistance remained vibrant under the surface and was never completely absent. It returned many years later with the Woman, Life, Freedom Movement. The long struggle of women in Iran for their rights merged with a strong symbol of resistance. In the recent times women got more courageous in their struggle to fight the rules of the regime when they lifted their mandatory hijab in public in 2017. The so called “Girls of Revolution Street” was the turning point of protest. It was the beginning of wave of demonstrations against the hijab and veiling of one’s body. When the Kurdish-Iranian Jina Mahsa Amini got arrested and later killed by the morality police of the regime a nationwide protest erupted. The slogan Jin, Jiyan, Azadi became a symbol and a strong popular tool in the struggle of women for justice and gender equality in Iran and elsewhere. == Origin == At first the slogan was used by the Kurdish women’s movement. In Iran Kurdish people make up around 10 per cent of the population. Kurdish women were the first who chanted the slogan Jin, Jiyan, Azadi, meaning Woman, Life, Freedom, on funerals. It was a protest in the early 2000 against patriarchal dominance, family violence and a deeply male-based tradition of killing women, who allegedly dishonoured their own families. This form of resistance was later transformed into a slogan, which applied against injustice, repression, and discrimination of women by a state and it spilled over into other regions. The slogan became prominent among the women fighters in the militant group PKK in its search for self-determination, freedom, and independence in the whole Kurdish region. In 2007 women chanted the slogan Jin, Jiyan Azadi on the International Women’s day in Diybarkir, Turkey. In the Kurdish autonomous region of Rojava in Syria, women played a decisive role in building a democratic community and administration from the bottom up. == Creative resistance == As the protests grew bigger, many people started sharing the message of the Women Life Freedom movement in creative ways. The song \"Baraye\" (which means \"For the sake of\") by Shervin Hajipour was released on 28 September 2022, and it quickly became the anthem of the movement and protests.Shervin Hajipour (2022). \"Baraye.\" SoundCloud, Link Because of this, the singer was arrested. In his song, Shervin talks about many problems such as gender inequality, oppression, and damage to the environment.Tara Mehrab. \"Woman, Life, Freedom: On Protests in Iran and Why It Is a Feminist Movement.\" DOI link Some translated lines from the song in Persian are: “For dancing freely in the streets... For my sister, for your sister, for our sisters... '' For the girl who wished to be a boy...”Tara Mehrab. \"Woman, Life, Freedom: On Protests in Iran and Why It Is a Feminist Movement.\" DOI link His song was sung at thousands of protests for Iran in about more than a hundred different cities around the world. \"Worldwide Rallies Show Unprecedented Support For Iran Protests\". Iran International. Archived from the original on 20 February 2023. Retrieved 20 October 2022. == References ==",
 "title": "Women Life Freedom Movement"
}