{
 "id": "1190732",
 "text": "Deir Yassin (Arabic:دير ياسين) was an Arab village on the western edge of Jerusalem. On April 9, 1948, the village experienced a massacre by the Zionist militias Irgun (IZL) and Lehi (Sterngang), who raided Deir Yassin in the morning to conquer the village. Despite having issues with the resistance of the inhabitants of Deir Yassin, IZL and Sterngang managed with the help of the Palmach and Haganah militias to occupy the village on the same day. Over 100 people died during the massacre as a result of the raw violence by the Jewish militias forced upon the people of Deir Yassin.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 96. As of today, the massacre is viewed as a major event in the Arab-Israeli conflict, being one important reason of the huge wave of Palestinian refugees in 1948.Morris, (2005), \"The Historiography of Deir Yassin,\" p.79. Deir Yassin no longer exists. Today, Israeli Kfar Shaul Mental Health Center lies on the former village. == Geography and Origins of Deir Yassin == Deir Yassin was a village with a population of 710 inhabitants (in 1948) on the top of an 800-meter-high hill 5 kilometers away from Jerusalem. Its name originates from a sheikh named Yasin who was buried near the ruins of Deir.A vale separated the village from the western outskirts of Jerusalem. Access from Deir Yassin to Jerusalem was possible through a road on the northern end of the village, which was also connected to a main street that connected Jerusalem and Jaffa. Deir Yassin was assigned to the administrative district of Jerusalem (Al-Quds). The village was not known for hostility towards Jews. However, it was known that Deir Yassin had peace agreements with neighbouring Jewish settlements Giv’at Shaul.Morris, (2005), \"The Historiography of Deir Yassin,\" p.94. == Massacre of Deir Yassin == === Background === The Irgun and Lehi troops made plans to raid Deir Yassin, following operation of Nachshon. The operation had the purpose to clear the road that ran to Jerusalem and to cleanse the area of Arabs. Morris, (2005), \"The Historiography of Deir Yassin,\" p. 86. The Haganah, and Palmach militia were informed of the plan. The plan was to conquer Deir Yassin and to hold the occupation of the village. Although the Jerusalem Haganah command David Shaltiel preferred to attack the villages, Qaluniya or 'Ein Karim, Irgun and Lehi rejected the proposal. The Haganah command had to leave its concerns on attacking Deir Yassin aside and unwillingly approved the decision of the Irgun and Lehi militias to attack Deir Yassin.Morris, (2005), \"The Historiography of Deir Yassin,\" p.86. === The Massacre === Around 4:30 a.m.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 92., 130 troops divided in two groups came from two directions. The troop of Irgun soldiers came from southeast, whilst the Lehi soldiers came from the north east. Additionally, a van with a megaphone drove towards Deir Yassin, that warned the villagers to not resist and to seek a way out of Deir Yassin. It is not clear, if the villagers of Deir Yassin heard the announcement. The operation faced struggles, as the troops had to fight against strong resistance from the people of Deir Yassin.Morris, (2005), \"The Historiography of Deir Yassin,\" p.86. It is said that the Irgun troops were not sufficiently prepared and experienced in fighting. The Irgun troops managed to pass the houses of the village, committing atrocities to the people of Deir Yassin.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 86. Heavily armed, they used grenades and fired their weapons into the houses of Deir Yassin. Plenty families were killed inside their houses, or outside while some were trying to escape or submit.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 92.Other troops helped the Lehi and Irgun troops. Haganah troops provided support for Irgun and Lehi troops by giving them ammunition, and granting them backfire. Troops from the Palmah Millitia helped to evacuate injured fighters of the Irgun and Lehi troop and also conquer houses.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 94. The fight lasted until the afternoon of the same day. The Zionist troops had won and took over the village. They continued to arbitrarily kill the Arab villagers, no matter of age or gender. Furthermore, they took the money and jewelry from the dead people's houses and from the villagers who were still alive. The massacre was heavily celebrated. Detained people of Deir Yassin were proudly presented in a convoy on the streets of Jerusalem. After the 'parade' some of the detainees were freed. However a group of around 20 people in Deir Yassin were murdered.The total number of deaths after the massacre was highly debated. As some sources say the number of deaths was around 250,Khalidi, Walid (1998), \"Deir Yassine : Autopsie d’un massacre,\" p.54. latest investigations show, 100-110 people died during the massacre.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 87.Afterwards, the Haganah publicly distanced themselves from the cruelties committed by the Irgun Lehi troops.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 92. Yet, the village was passed to Haganah's control. === Aftermath of the massacre === The massacre of Deir Yassin contributed heavily to the massive wave of Palestinian refugees. As the news of the events was spread across the Arab world.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 88. Media outlets reported about Deir Yassin which affected the Palestinians up to Haifa and Jaffa.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 88. It is being said that through media, like radio channels, panic amongst the Palestinians came along, as they could be the next target of Zionist millitias.Rui and Wenliang, (2020),\"The Impact of the Deir Yassin Massacre on the Arab-Israel Conflict,\" p.15. IZL militias, however, were conscious of the Palestinian fear, which allowed them to immediately conquer the next villages, such as Qaluniya or Beit Iksa.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 88. It was notably a success for the Zionist movement. The flight of Palestinian refugees allowed an accelerated process of the Zionist occupation of Palestinian soil. Menachem Begin, the command of the IZL troops even argued: \"Out of evil, however, good came.\"Morris, (2005), \"The Historiography of Deir Yassin,\" p. 88. Psychological intimidation with the case of Deir Yassin was one fundamental reason for the flight of refugees. Rui and Wenliang, (2020),\"The Impact of the Deir Yassin Massacre on the Arab-Israel Conflict,\" p.15. Deir Yassin also had a severe political effect in the Middle East. The Jordanian King Abdullah condemned himself from peace negotiations with Israel.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 95.Deir Yassin was a reason for taking military actions against Israel, as the Jordanian King stated in a speech: \"Secretary-General we were compelled to enter Palestine to protect unarmed Arabs against massacres similar to those of Deir Yasin. We are aware of our national duty towards Palestine in general and Jerusalem in particular and also Nazareth and Bethlehem. Be sure that we shall be very considerate in connection with Jews in Palestine and while maintaining at the same time the full rights of the Arabs in Palestine. Zionism did not react to our offers made before the entry of armed forces.\"Regarding the political aftermath, Rui and Wenliang write: \"The Deir Yassin Massacre was the turning point in the Arab-Israel conflict from civil struggle to official armed force confrontation, which opened the prelude to the first Middle East war; it sparked the anger in the Arab world and opened the Arab and Jewish leaders. The prelude to horrific hatred for more than half a century.\"Rui and Wenliang, (2020),\"The Impact of the Deir Yassin Massacre on the Arab-Israel Conflict,\" p.15. The Massacre is still deeply remembered in Palestinian culture. It has become a symbol for Palestinian struggle and the resistance against the actions of the Israelis on the Palestinians. It is often connoted with the Nakba and also serves as the synonym for it.Morris, (2005), \"The Historiography of Deir Yassin,\" p. 79. An example for that deep imprint is the Palestinian president Mahmoud Abbas, who refers to the events of Deir Yassin during a debate of the UN General Assembly in 2015. He speaks about the cruelties done by the militias, and the fact that there was no punishment.Rui and Wenliang, (2020),\"The Impact of the Deir Yassin Massacre on the Arab- Israel Conflict,\" p.15. When it comes to means of resistance, Benny Morris argues: \"Deir Yassin served as a symbol and battle cry for genrations of Palestinian guerrillas and terrorists [...]\" .Morris, (2005), \"The Historiography of Deir Yassin,\" p. 79. == Deir Yassin today == Today, not much of Deir Yassin is left. A few stone houses still exist, that are not publicly accessible. In 1951 the Kfar Shaul Mental Health Center was built on the place of Deir Yassin.It is said that prominent Jews, such as Martin Buber advocated for letting Deir Yassin alone, out of respect for the people who lost their lives. However, the Mental Health Center was built. Nevertheless, Deir Yassin is remembered in different places in the world, such as the Deir Yassin memorial tstone in Glasgow in the United Kingdom. == References ==",
 "title": "Deir Yassin"
}