{
 "id": "1190481",
 "text": "Asendorf is a village in the Samtgemeinde Bruchhausen-Vilsen in the Diepholz district of Lower Saxony, Germany. == Geography == === Location === The village is located 36 km (22 mi) south of Bremen. It is the second-largest place in its joint municipality. === Divisions === Asendorf is made up of these eight areas: * Asendorf (the main village) * Brebber * Essen * Graue * Haendorf * Hohenmoor * Kuhlenkamp * Uepsen == History == === Place name === The village was called Asenthorpe in 1252 and Asendorpe in 1330. The personal name Aso might come from the Germanic word Ans, which refers to the Æsir, the pagan gods of the Germanic peoples. Names like Anso, Aso, Aaso, Asso, Oso, Osso are known from written sources since the 8th century. The name could also be of Lombard origin, as there was a Lombard personal name Aso or Anso. === Village history === Asendorf was first mentioned in a document in 091. This document describes events from a few years earlier. Gerhard II. von Stumpenhusen was supposed to give seven farms and eight serfs in Asendorf, plus four more farms in Uepsen, to the church. He was accused of cheating the church and being excommunicated because he only gave four farms from Asendorf and two from Uepsen. The church in Achim took him to court because of this fraud and the unpaid farms and serfs. The highest church leaders in the region, Archbishop Liemar of Bremen, and his vassal Duke Magnus (who held the king's ban), led the court. More than 300 people attended, including knights from the Archbishop, the Duke, and the Margrave. Asendorf was already a Kerkspeel (a church parish) with a presbyter named Lambertus at that time, which means the church building must have existed then. The village started much earlier, but its official 900-year celebration was held in 1991. Around 1250, there was a confirmed parish church (\"parochia in Asenthorpe\"). In the 16th century, the church records mentioned it again. The St. Paul's Monastery outside Bremen, which the Asendorf church belonged to, refused to help pay off debts caused by the occupation of the County of Hoya by the Dukes of Brunswick-Lüneburg. As a result, Count Jobst II. von Hoya seized the monastery's properties in Asendorf. In 1524, the tower of the St. Marcellus Church was built, and the nave was made larger. The church was repaired in 1778, and in 1909, two transepts and the apse were added. Between 1950 and 1964, the church was fully restored, and the inside was painted. In 1898, the Hoya-Syke-Asendorf narrow-gauge railway opened, and in 1900, it was extended to Bruchhausen-Vilsen–Asendorf. The Asendorf station is now the end point of the First Museum Railway in Germany. The current Bundesstraße 6 (federal highway 6) was already planned from Syke to Wietzen in 1771, but it was not paved until 1810 to 1826. From 2001 to 2013, the village received money from the Lower Saxony village renewal program. === Mergers === The Samtgemeinde Asendorf was dissolved during the Lower Saxony local government reform on March 1, 1974. The communities of Brebber, Essen, Graue, Haendorf, Hohenmoor, Kuhlenkamp, and Uepsen were combined with Asendorf to form the present rural municipality of Asendorf. == External links == * Asendorf Website * History of Asendorf * Museum Railway between Bruchhausen-Vilsen and Asendorf * Homepage of the Kunst-Schuppen Asendorf * Historical postcards from Asendorf == References == Category:Asendorf (Diepholz district) Category:Villages in the Diepholz district Category:1091 establishments",
 "title": "Asendorf"
}