{
 "id": "1190152",
 "text": "Trent Kelly John Trent Kelly (born March 1, 1966) is an American politician and attorney serving as the U.S. Representative for Mississippi's 1st congressional district since 2015. A member of the Republican Party, Kelly was elected in a special election following the death of Representative Alan Nunnelee. His district includes northeastern Mississippi, including cities such as Tupelo, Oxford, and Columbus. == Early Life and Education == Kelly was born in Union, Mississippi. He graduated from Union High School in 1984. He earned an Associate of Arts from East Central Community College in Decatur, Mississippi, followed by a Bachelor of Arts from the University of Mississippi. He later received a Juris Doctor (J.D.) from the University of Mississippi School of Law and a Master of Strategic Studies from the U.S. Army War College. == Military Service == Kelly has served in the Mississippi Army National Guard for over 30 years and holds the rank of Major General. He has deployed in support of military operations, including during the Iraq War. His military career includes leadership roles in engineering and logistics, and he has received numerous commendations, including the Bronze Star. == Legal and Early Political Career == Before entering Congress, Kelly served as a district attorney for Mississippi’s First Judicial District. He was elected as a prosecutor in 2011 and was known for his tough-on-crime stance and commitment to public safety. == U.S. House of Representatives == Kelly won a special election in 2015 to fill the seat vacated by the late Alan Nunnelee. Since taking office, he has been reelected multiple times with strong support from his district. === Committee Assignments === * House Committee on Armed Services ** Subcommittee on Tactical Air and Land Forces ** Subcommittee on Intelligence and Special Operations * House Committee on Agriculture ** Subcommittee on Conservation, Research, and Biotechnology ** Subcommittee on General Farm Commodities, Risk Management, and Credit * House Permanent Select Committee on Intelligence === Political Positions === Kelly is considered a conservative Republican. He supports strong national defense, Second Amendment rights, and limited government. He has consistently voted in line with Republican leadership and supported key pieces of legislation focused on agriculture, military affairs, and rural economic development. == Personal Life == Kelly resides in Saltillo, Mississippi, with his wife Sheila, and they have three children. He remains active in the Mississippi National Guard and continues to advocate for veterans and military families. == Electoral History == Year Election Opponent(s) Result 2015 Special General Walter Zinn (D) Won 2016–2022 General Elections Various Democratic nominees Won (60–70% of vote) == References == == External Links == * Official U.S. House Website * Trent Kelly on Ballotpedia * https://trentkelly.house.gov/",
 "title": "Trent Kelly"
}