{
 "id": "1190820",
 "text": "Richard Buford Thomas, Jr. is a National icon in the Sports Tourism Industry having organized over 400 sports events in partnership with State and City/County tourism officials. He is the Executive Director of the International Senior Softball Association (ISSA) which he created in 1994 to provide the senior men and women an opportunity to participate in a competitive sport as they age. RB was born in Roanoke, Virginia on July 26, 1941 where he graduated from Jefferson Senior High School in 1959. He continued his education at Virginia Tech getting a Civil Engineering Degree in 1964. He was a licensed Professional Engineer and Land Surveyor and managed his own consulting engineering business in Manassas, VA for over 50 years. While working as a consultant engineer he participated in amateur softball first as a player then team manager and administrator. He had a \"Hall of Fame\" career in the sport and has been inducted in seven (7) softball halls of fame including the USA Softball National Hall of Fame, World Baseball Softball Confederation Softball Hall of Fame and the National Senior Softball Hall of Fame. He and his wife, Ann have seven children and live in Nokesville, VA. In 1994 he was asked to serve on a new committee organized by his local government and named \"Sports Promotion Committee.\" The committee was charged with looking into sports tourism opportunities available locally. As a result, RB volunteered to organize an event to demonstrate the value to local businesses of having sports tournaments using local parks and facilities. He created the ISSA and set out to organize the first ISSA World Championships which was held in 1995. The event was successful and RB grew the organization to where they hold over 20 such sport tourism events annually. In 2015 RB was recognized by the National Association of Sports Commissions (now SportsETA) as the Sports Event Organizer of the Year in the United States. Now over 30 years later he is widely known for his expertise with sports tourism as well as promoting the development of senior softball programs around the Country.",
 "title": "RB Thomas Jr."
}