{
 "id": "1190341",
 "text": "Ellen Marion Delf-Smith FLS (née Delf, 1883–1980) was an English algologist and botanist. == Early life and education == She attended James Allen's Girls' School before studying natural history at Girton College, Cambridge. She studied there from 1902 to 1906, supported by the Clothworkers' scholarship, specialising in botany. == Career == After completing his studies at Cambridge, Delf took a position at Westfield College, University of London. She was tasked with establishing the teaching of botany at the university. Despite the university's lack of resources for equipment or technicians, and poor specimen collection, it managed to raise funds to better equip the laboratory. Her efforts led the University to approve the Westfield Laboratory to prepare students for the undergraduate examinations in botany in 1910 and for the bachelor's degree in 1915; she was also recognized as a university professor in 1910. During the period from 1911 to 1916, she studied plant physiology, specifically transpiration . She won her D. Sc. in London in 1912 and returned to Girton in 1914 as a researcher. Delf worked as a research assistant at the Lister Institute of Preventive Medicine from December 1916 to January 1920. Her studies dealt with the vitamin content of foods, including military rations. In 1920 she took up a temporary post to research the nutrition, specifically vitamin C content, of the diets of mine workers in the Johannesburg area, and as a result \"their health substantially improved.\" She also spent time in Cape Town studying seaweed . In 1921 she returned to Westfield as a professor of botany and remained there for the remainder of her career. In 1939, she became head of the Department of Botany, and arranged for her transfer to Oxford during the Second World War . She retired in 1948, but continued to work at Westfield as a gardener. She later served on the board, and from 1950 to 1955, she was president of the Alumnae Association; and in 1955, she was elected an honorary member. She was a member of the Linnean Society . In 1928 she married the artist Percy John Smith, taking the surname Delf-Smith. They found common interests in drawing and gardening and had a happy marriage, but Smith died in 1948. Delf-Smith died on 23 February 1980 at the age of 97. == References == Category:British scientists Category:Botanists",
 "title": "Ellen Marion Delf"
}