{
 "id": "1190808",
 "text": "Thomas Ellison (1772 – 29 October 1792) was an able seaman. After participating in a mutiny, he remained in Tahiti rather than continuing on to the Pitcairn Islands, and in 1791 voluntarily turned himself in to the seamen of HMS Pandora to face justice in England. He was court-martialed at Spithead in September 1792, sentenced to death, and hanged on 29 October. Questions continue as to the degree of Ellison's culpability in the mutiny. Ellison was in Christian's watch and on the morning of the mutiny he was at the wheel. When the mutiny broke out, he was at first \"Terrifyde,\" as he later testified during the court-martial, but – like several others among the crew – he soon became elated at the turn of events, in fact he lashed the wheel, took a bayonet and waved it in Bligh's face and shouted: \"Damn him, I will be sentinel over him!\" Bligh's description of Ellison, written after the mutiny, reads as follows: Ellison, although he was only 15 years old when he was mustered aboard captain William Bligh's armed vessel Bounty as it sailed from Spithead for Tahiti, was already an experienced able seaman who had seen service in the merchant navy under Bligh in the West Indies. He was short () and was described as dark-haired and fair-skinned. In records of the outbound voyage, Bligh praised the lad as \"improving\" and \"is a very good Boy and will do very well.\"Alexander, Caroline (2003), The Bounty: the True Story of the Mutiny on the Bounty Bligh also instructed his clerk, John Samuel, to teach \"Writing and Arithmetick\" to the illiterate teenager.During the Mutiny on the Bounty on 28 April 1789, Ellison was standing his watch as the ship's wheelsman, which gave him a vantage point to view the personal confrontation between Captain Bligh and Fletcher Christian at the heart of the mutiny. Ellison described himself as continuing to obey the captain's orders to \"clap the helm down\". However, the young seaman then handed control of the helm to a mutineer, John Mills, and left the scene to ask for advice from a loyal crewman, Lawrence LeBogue. When the time came for Ellison to tell his story at his court-martial, he tried to portray this incident as an attempt to establish his loyalty; but LeBogue – who would within minutes be set adrift with Bligh in the ship's boat – was less than helpful or sympathetic to the confused youth: == References == Category:HMS Bounty mutineers Category:1772 births Category:1792 deaths Category:18th-century pirates Category:English pirates",
 "title": "Thomas Ellison"
}