{
 "id": "1190661",
 "text": "Eugene Lim YJ (born 1983) is the founder and CEO of The Assembly Place. == Early life == Eugene Lim was born in Singapore in 1983. He grew up in a middle-income family. His father was a property manager and his mother was a homemaker. He went to Ai Tong Primary School and Kuo Chuan Presbyterian Secondary School. He later attended Yishun Junior College, where he played rugby. In 2005, he began studying at the University of London, earning a degree in Business Administration and Management. During his secondary school years, he was part of the Boys Brigade (5th Company) and became a Christian. == Career == Before working in real estate, Eugene Lim was a hip-hop dancer and instructor. He has invested in two dance schools: Distinct Creative Arts and One Dance Asia. During his National Service, Eugene Lim served in the Commando Unit/Special Forces. In 2012, Eugene joined Knight Frank as Head of Project Marketing. He was promoted to Director in 2014, where he worked with property developers and launched about 35 projects. In 2015, he became AGM of Marketing and Sales at Wing Tai Holdings, a Singaporean property developer. From 2016 to 2021, he was a marketing and sales director at Oxley Holdings Limited. He launched projects in Singapore, London, Malaysia, and Cambodia. During this time, he was mentored by Eric Low. In May 2019, Eugene Lim started The Assembly Place, a co-living company in Singapore. The company began with six rooms and now has about 2000 rooms. In December 2023, The Assembly Place and its partner TS group won a tender from the Ministry of Health Holdings to house over 1700 foreign healthcare workers in Singapore. The company also won a contract to manage Serene Centre, which will include F&B;, retail, and 90 service apartments. It is expected to open in Q2 2025. In 2023, Eugene Lim received the Rising Star Award at the PropertyGuru Asia Property Awards (Singapore). == References == Category:1983 births Category:Living people Category:People from Singapore Category:Singaporean businesspeople Category:Alumni of the University of London",
 "title": "Eugene Lim"
}