{
 "id": "1190301",
 "text": "The 2025 Depayin School bombing () was an airstrike by the Tatmadaw, the military of Myanmar. It happened on 12 May 2025 in Oe Htein Kwin village, Tabayin Township (also called Depayin), in Sagaing Region, Myanmar. The attack hit a school run by the pro-democracy movement. At least 22 people were killed, including 20 students and 2 teachers. Many others were injured. The bombing happened while the school was in session. It happened even though the military said there was a ceasefire. == Background == After the military coup in 2021, many people in Myanmar resisted military rule. Sagaing Region, especially Tabayin Township, became a strong area for the resistance. The Myanmar military began using more airstrikes, even in civilian areas. == Attack == At around 9:00 a.m. on 12 May 2025, a Myanmar military MiG-29 jet dropped two bombs on the school in Oe Htein Kwin village. The school had students from primary to high school. The attack killed 20 students and 2 teachers. More than 100 people were injured. Three houses near the school were also damaged. About 500 people fled from the village after the bombing. The village had around 300 households. == Aftermath == Eyewitnesses, aid workers, and opposition leaders said the military targeted civilians to stop support for the resistance. The National Unity Government (NUG) said more people might have died. They said the military has a pattern of attacking schools and hospitals. Additionally, three nearby houses were damaged. The NUG’s Ministry of Human Rights called the attack a war crime and asked the United Nations and other countries to take action. A UK minister and Myanmar’s ambassador to the UN, Kyaw Moe Tun, also condemned the attack. The military’s state TV, MRTV, denied the reports. Furthermore, a UK Minister and Myanmar's ambassador to United Nations, Kyaw Moe Tun criticized the airstrike. It said the opposition was spreading false information and the army was working for peace. == Related pages == * Depayin massacre * 2021 Myanmar coup d'état * Internal conflict in Myanmar * Human rights in Myanmar == References == Category:2025 disasters in Asia Category:Airstrikes Category:Massacres in Myanmar Category:May 2025 events Category:Attacks on schools Category:Pages created with the Article Wizard from 2025",
 "title": "2025 Depayin School bombing"
}