{
 "id": "1190356",
 "text": "Alaa Mohamed Sarhan (born June 27, 1996, Egypt) is an Egyptian Novelist and Screenwriter. He began his artistic career in 2015 and has participated in publishing numerous literary works in the Middle East and Europe.. == Life and career == Alaa Sarhan was born in Damascus and then moved to his homeland, Egypt, where he grew up in an environment that valued the arts, especially novel and playwriting. Alaa Sarhan has written more than 30 novels and books. He showed an interest in writing from a young age, specifically 17 years old, which led him to study acting, theater, and screenwriting at the Arts University Bournemouth. There, he received fundamental academic training and collaborated with the omniscriptum foundation, which motivated him to participate in international book fairs. He showed an interest in writing from a young age, specifically 17 years old, which led him to study acting, theater, and screenwriting at the Arts University Bournemouth. There, he received fundamental academic training and collaborated with the omniscriptum foundation, which motivated him to participate in international book fairs. He also founded the first non-profit academy in the Middle East dedicated to teaching and developing writing, called 'Sirius'. == Writing style and themes == Alaa Sarhan's narrative style is distinguished by several characteristics that make his works unique and intriguing. Here are some key features of his narrative style: 1\\. *Mystery and Suspense*: His style is characterized by mystery and suspense, creating an atmosphere of tension and curiosity in the reader. This is evident in the \"Arooah Asirakass\" series, where he poses existential and thought-provoking questions that make the reader wonder about the nature of existence and identity. 2\\. *Imagination and Fantasy*: Sarhan extensively uses imagination and fantasy in his novels, creating new and exciting worlds. This is evident in the concept of multiple souls in one body, which raises many questions about identity and existence. 3\\. *Philosophical Depth*: His style is marked by philosophical depth, posing existential and thought-provoking questions that make the reader reflect on the nature of existence and identity. This is evident in the \"Arooah Asirakass\" series, where Sarhan raises questions about identity and existence. 4\\. *Poetic Language*: Sarhan uses poetic language in his novels, creating an atmosphere of beauty and wonder. This is evident in the use of metaphors and similes in his novels. 5\\. *Focus on Character Development*: Sarhan focuses on developing complex and intriguing characters in his novels, making the reader engage with them more deeply. This is evident in the \"Arooah Asirakass\" series, where Sarhan develops complex and intriguing characters. Overall, Alaa Sarhan's narrative style is characterized by mystery and suspense, imagination and fantasy, philosophical depth, poetic language, and a focus on character development. These features make his works unique and intriguing. == Awards and Honors == \"Alaa Sarhan participated in international exhibitions in London, Germany, Egypt, and Damascus, His book \"Yaqout\" was discussed to support cancer patients at the Cultural Center. Additionally, his book series \"Arooah Asirakass\" received an honorary recognition from the omniscriptum foundation == External sites == Category:Writers from Cairo Category:1996 births Category:Living people == References == Category:Alumni by university or college in England",
 "title": "Alaa Mohammed Sarhan"
}