{
 "id": "1190948",
 "text": "Caroline Sampson (born 2 August 1984) is a radio presenter, TV host, event MC, and voiceover artist from Ghana, known mostly for her work in TV and radio ads. She started her media career in 2005 after becoming a finalist in the third season of the Ghanaian reality TV show Miss Malaika Ghana. Besides working on TV and radio, Sampson has also hosted reality shows, business events, movie premieres, and music album launches. She was the first English- speaking African and the first Ghanaian to win the Best Presenter award at the Stars Integration of Culture of Africa festival and competition held in Benin.. == Career == === Modeling === Sampson started her career in 2005 as a contestant on the third season of the TV reality show Miss Malaika Ghana, where she made it to the final 16. In 2006, she also took part in the Top Ghana Model Contest, which helped her become a full-time model. As a model, she worked with fashion designers like Kofi Ansah, Ozwald Boateng, Nana Asihene, and House of Eccentric. === Television === In 2005, Sampson had her first chance on TV when she hosted a game show called U-Win Game, which was shown on GTV (Ghana’s national broadcaster). Later, she became the host of Hitz Video, a weekly music video show on TV3 Ghana. In 2009, Sampson joined Global Media Alliance, which owns ETV and YFM Ghana. She hosted E on E, a daily entertainment show on ETV Ghana. In 2017, she moved to Kwese Sport, where she hosted the station’s breakfast show called Head Start. Later, she also became the host of a sports program called Sports Arena on the same channel. === Radio === In 2005, while working at GTV, Sampson also started working in radio at Atlantis radio station in Accra. She hosted two daily drive-time shows called Continuous Drive and Mellow Cruise. Later, she joined Citi FM and hosted three daily shows: Room 973, Rhythms in the Citi, and Citi Countdown.. After two years at Citi FM, Sampson moved to YFM Ghana, where she hosted a weekly show called Shout on Y. == Brand ambassador == In 2017, Sampson and Ghanaian rapper Kofi Kinaata were brand ambassadors for the drink company Guinness Ghana. She was also a brand ambassador for Woodin, a fabric company, and in 2014, she was the face of the drink company Castle Milk Stout. Caroline is a social media influencer too and has promoted brands like Zeepay, Huawei, and World Remit, among others. == Awards == Caroline Sampson won the Best Presenter award in 2009 at the Stars Integration of Culture of Africa event in Cotonou, Benin. In 2019, she won Best Female Radio Personality at the 3rd Ghana Entertainment Awards USA. She also received the 4th XWAC-Africa Award of Honour for Media Excellence that same year. Caroline Sampson was nominated and won the Best Female Radio Personality Award again at the 2024 Ghana Entertainment Awards in the USA. == References == Category:1984 births Category:Living people Category:Ghanaian musicians Category:Pages with unreviewed translations",
 "title": "Caroline Sampson"
}