{
 "id": "1190951",
 "text": "Viriathus (also spelled Viriato) was a leader of the Lusitanians, an ancient people from the western part of the Iberian Peninsula, which is now Portugal and western Spain. He is remembered for leading his people in resisting Roman rule during the Lusitanian War from 147 BC to 139 BC. == Early life == Viriathus was born in Lusitania and started his life as a shepherd. His rise to leadership began when he became a warrior and later the chief of the Lusitanians. == Resistance against Rome == During the Lusitanian War, Viriathus led his people in several battles against the Roman army. He was known for his clever tactics and ability to unite different tribes against a common enemy. His leadership was instrumental in the Lusitanians' resistance efforts. == Betrayal and death == In 139 BC, after years of successful resistance, Viriathus was betrayed by his own men. Three of his envoys, Audax, Ditalcus, and Minurus, were bribed by the Romans to assassinate him. They killed Viriathus while he was sleeping, ending his leadership and the organized resistance against Rome. == Legacy == Despite his death, Viriathus became a symbol of resistance and national pride for the Lusitanians and later for the Portuguese people. Monuments and statues have been erected in his honor, such as the Monument to Viriathus in Zamora, Spain, and in Viseu, Portugal. == See also == * Artistic depictions of Viriathus == References == == Further reading == * Ribeiro, Ângelo and Saraiva, José Hermano História de Portugal I — A Formação do Território QuidNovi, 2004 (). * Loução, Paulo Alexandre: Portugal, Terra de Mistérios Ésquilo, 2000 (third edition; ). * Muñoz, Maurício Pastor: Viriato, A Luta pela Liberdade Ésquilo, 2003 (third edition; ). * Freitas do Amaral, Diogo: Viriato ; Lisboa: Bertrand, 2004 () * Silva, Luis: \"Viriathus and the Lusitanian Resistance to Rome\", Pen & Sword, South Yorkshire, UK, 2013 () Category:139 BC deaths Category:Lusitanians Category:Celtic warriors Category:Year of birth unknown Category:2nd-century BC rebels",
 "title": "Viriathus"
}