{
 "id": "1190059",
 "text": "Nora Fatehi (born on 6 February 1992) is a dancer and actress from Canada who works in India. She has acted in Hindi, Telugu, and Malayalam movies. She started her acting career with the Hindi movie Roar: Tigers of the Sundarbans. Fatehi became popular in Telugu movies for her special dance performances in films like Temper, Baahubali: The Beginning, and Kick 2. She also acted in two Malayalam movies, Double Barrel and Kayamkulam Kochunni. In 2015, she joined the reality TV show Bigg Boss as a contestant. In 2016, she took part in the dance reality show Jhalak Dikhhla Jaa. She appeared in the Bollywood movie Satyameva Jayate, where she danced in the remake of the song Dilbar. This song got over 20 million views on YouTube in just 24 hours, making it the first Hindi song in India to reach that number. She also worked with a Moroccan hip- hop group called Fnaïre to release an Arabic version of Dilbar. In 2019, she worked with Tanzanian singer and songwriter Rayvanny to release her first international English song called Pepeta. In October 2022, she was selected to be part of the song Light The Sky for the 2022 FIFA World Cup in Qatar, along with artists RedOne, Manal, Balqees, and Rahma Riad. After that, she played supporting roles in the Hindi movies Street Dancer 3D (2020) and Bhuj: The Pride of India (2021). She has also been a judge on TV shows like Dance Deewane Juniors and Jhalak Dikhhla Jaa 10. == Early life == Fatehi was born and grew up in Toronto, Canada, Her family is originally from Morocco on both her father’s and mother’s side. She finished school at Westview Centennial Secondary School in Toronto. She studied political science and international relations at York University. In interviews, she has said that she feels like \"an Indian at heart.\" == Filmography == === Movies=== Key Denotes films that have not yet been released Year Title Role(s) Language(s) Notes Ref. 2014 Roar: Tigers of the Sundarbans CJ Hindi 2015 Crazy Cukkad Family Amy Temper Herself Telugu Special appearance in song \"Ittage Rechchipodam\" Mr. X Herself Hindi Special appearance in song \"Alif Se\" Double Barrel Herself Malayalam Special appearance Baahubali: The Beginning Unnamed Telugu / Tamil Special appearance in song \"Manohari\" Kick 2 Herself Telugu Special appearance in song \"Kiruku Kick\" Sher Herself Special appearance in song \"Napere Pinky\" Loafer Herself Special appearance in song \"Nokkey Dochey\" 2016 Rocky Handsome Herself Hindi Special appearance in song \"Rock Tha Party\" Oopiri / Thozha Nemali Telugu / Tamil Special appearance in song \"Door Number\" 2018 My Birthday Song Sandy Hindi Satyameva Jayate Unnamed Special appearance in song \"Dilbar\" Stree Unnamed Special appearance in song \"Kamariya\" Kayamkulam Kochuni Herself Malayalam Special appearance in song \"Nrithageethikalennum\" 2019 Bharat Suzan Vilayati Khan Hindi Batla House Huma / Victoria Special appearance in song \"O Saki O Saki\" Marjaavaan Herself Special appearance in song \"Ek Toh Kum Zindagani\" 2020 Street Dancer 3D Mia 2021 Bhuj: The Pride of India Heena Rehman Satyameva Jayate 2 Dilruba Special appearance in song \"Kusu Kusu\" 2022 Thank God Herself Special appearance in song \"Manike\" An Action Hero Herself Special appearance in song \"Jehda Nasha\" 2024 Crakk Alia Madgaon Express Tasha Matka Sofia Telugu 2025 Be Happy Maggi Hindi TBA Tamil Filming TBA! scope=\"row\" Kannada Kannada debut === Television === Year Title Role Notes Ref. 2015–2016 Bigg Boss 9 Contestant 9th place 2016 Jhalak Dikhhla Jaa 9 10th place 2018 MTV Dating in the Dark Host 2022 Dance Deewane Juniors 1 Herself Judge Jhalak Dikhhla Jaa 10 2023 Hip Hop India 1 === Web series === Year Title Role Notes Ref. 2021 Star vs Food (Season 2) Herself Episode 5 2022 Moving In With Malaika Episode 7 2025 The Royals === Music videos === Year Title Singer(s) Ref. 2017 Pop The Bottle Vishal Dadlani, Shekhar Ravjiani, Akasa Singh, Badshah 2017 Naah Harrdy Sandhu 2017 Baby Marvake Maanegi Raftaar 2018 Dilbar Arabic Version Herself, Fnaïre 2019 Pachtaoge Arijit Singh 2019 Pepeta Herself, Rayvanny 2020 Pachtaoge (Female version) Asees Kaur Naach Meri Rani Guru Randhawa, Nikhita Gandhi Body (Dance Cover) Megan Thee Stallion 2021 Chhor Denge Parampara Tandon Dance Meri Rani Guru Randhawa, Zahrah S Khan 2023 Achha Sila Diya B Praak 2024 Zaalim Payal Dev, Badshah Payal Yo Yo Honey Singh, Paradox Aaye Haaye Karan Aujla, Neha Kakkar == Discography == Year Title Co-singer Ref. 2018 Dilbar Arabic Version Fnaïre 2019 Pepeta Rayvanny 2022 Dirty Little Secret Zack Knight Light The Sky Balqees, Rahma Riad, Manal 2023 Sexy In My Dress Im Bossy 2024 Who's Your Mommy Srushti Tawade, Sameer Uddin Body On Me Badshah NORA It's True CKay 2025 Snake Jason Derulo == Awards == Year Award Category Result Ref. 2023 Pinkvilla Style Icons Awards Fashion Trailblazer Bollywood Hungama Style Icons Most Stylish Glam Star == References == == Other websites == * * * * Category:Living people Category:1992 births Category:Canadian actors Category:Canadian models Category:Canadian singers",
 "title": "Nora Fatehi"
}