{
 "id": "1190393",
 "text": "Alexander Alexandrovich Friedmann (also spelled Friedman; ; 16 June 1888 – 16 September 1925) was a Russian physicist and mathematician best known for founding modern cosmological models of an expanding universe. His pioneering work laid the theoretical foundation for what would later become known as the Big Bang theory, and his contributions remain central to the field of cosmology. == Early life and education == Friedmann was born in Saint Petersburg, Russian Empire, into a well-educated family. His father was a ballet dancer and composer, and his mother was a pianist. Demonstrating strong mathematical and scientific aptitude early in life, Friedmann studied at the Saint Petersburg State University, where he specialized in physics and mathematics. He graduated in 1910 and soon began a career in academia and meteorology. == Scientific career == During World War I, Friedmann worked in the field of military aeronautics and meteorology, applying his mathematical expertise to the analysis of atmospheric conditions. After the war, he returned to academia and began delving into problems in theoretical physics, particularly in the area of general relativity. In 1922, Friedmann published his landmark paper \"On the Curvature of Space\", in which he derived non-static solutions to Einstein’s field equations of general relativity. Contrary to Einstein’s own belief in a static universe, Friedmann showed that the equations allowed for dynamic models where the universe could either be expanding or contracting. These results, now known as the Friedmann equations, describe how the universe's scale factor changes over time depending on its energy content. His 1924 follow-up paper expanded these results to include open and closed universe models, each with distinct implications for the geometry and fate of the cosmos. Friedmann was not directly inspired by Galileo, but his groundbreaking approach to cosmology follows in the Galilean tradition of questioning orthodoxy and using mathematics to describe the universe. == Reception and legacy == Initially, Friedmann’s work was not widely accepted. Albert Einstein himself rejected Friedmann’s conclusions at first, believing there was a mathematical error. However, he later acknowledged that Friedmann’s solutions were correct after a review in 1923. Still, Friedmann’s ideas remained largely obscure until Edwin Hubble’s observations in 1929 confirmed that galaxies are receding from one another, providing empirical support for an expanding universe. Although Friedmann died young—at age 37 due to complications from typhoid fever—his contributions became central to cosmology. The Friedmann–Lemaître–Robertson–Walker (FLRW) metric, a cornerstone of modern cosmological models, is named in part after him. == Honors and memorials == Friedmann’s work is commemorated in scientific literature and in numerous cosmological models. The lunar crater Friedmann and various academic institutions have been named in his honor. His life and work are widely regarded as critical milestones in the development of 20th-century physics. == Related pages == * General relativity == References == * Friedmann, A. (1922). \"On the Curvature of Space.\" Zeitschrift für Physik. * Kragh, H. (1996). Cosmology and Controversy: The Historical Development of Two Theories of the Universe. Princeton University Press. * Einstein, A. (1923). Letter acknowledging Friedmann’s correction of his earlier rejection.",
 "title": "Alexander Friedmann"
}