{
 "id": "1190049",
 "text": "In the early Abbasid era, the Byzantine emperor Constantine V advanced in 133 AH, controlled Maltea, and Poly, and sent his commander Kushin to take control of Kammakh, then headed to Erzrum, and transferred the inhabitants of Poly Wardrum to Byzantium, and seized the event, Golzia and Samisat The emperor was able to destroy the Islamic forts line and demolish the Thaghari regime, so Musa bin Kaab al-Tamimi, the worker of the island, marched to him, and there was no meeting between them. Caliph al-Saffah to Abdullah bin Ali, his uncle and his guardian on the Levant, ordering him to move with the armies that are with him, so he broadcasts his armies in the areas of Al-Thagh, so Abdullah moved until he reached the event, and began to fortify the staq. Then Caliph Abu al-Abbas sent the first sect to the land of the Byzantines in 133 AH, conquered by Saeed bin Abdullah, and also landed new ships in the port of Alexandria, which succeeded in raiding the islands of Sicily and Sardinia in 134 AH , and the raid was on Sicily led by Abdul Rahman bin Habib Al-Fahri, while Sardinia, the prince of Africa, Abdullah bin Habib, went to it and forced it to pay the reward. == References == * Al-Manaseer, Mohammad Abdul- Hafiz Darwish. The Army in the Early Abbasid Period (132–232 AH). PhD Dissertation. Supervised by Prof. Muhammad Ibrahim Abu Salim. [In Arabic]. * Ibn al-Athir. Al-Kamil fi al-Tarikh [The Complete History]. Various editions. [In Arabic]. * Kennedy, Hugh. The Early Abbasid Caliphate: A Political History. London: Croom Helm, 1981. * Al-Tabari, Muhammad ibn Jarir. Tarikh al- Rusul wa al-Muluk [History of Prophets and Kings]. Translated by various scholars. [In Arabic and English]. ==see aslo== arab muslims Islamic conquests == The raid on Sicily== The African governor, Abdul Rahman bin Habib, directed a naval campaign to Sicily under the leadership of his brother Abdullah bin Habib, who managed to defeat the Byzantine force on the island, so he she sheped and came back",
 "title": "Abbasids raid on Sicily"
}