{
 "id": "1191889",
 "text": "Macha Ibemma Khudithibi (), also known as Macha Ebemma Khudithibi (MEK), is a goddess in Meitei mythology and traditional Meitei religion (Sanamahism) of ancient Kangleipak (early Manipur). She is a daughter of Oknarel and Khunbuleima (Khuningthou Tompokhanbi). Through her maternal ties, she is a granddaughter of the Khullakpa (Headman) of Sadu village. She is traditionally venerated in the region surrounding Ningthoukhong in present-day Manipur, India. == Mythology == According to Meitei mythology and folklore, Macha Ibemma Khudithibi () was journeying with her divine parents, Iputhou Oknarel and Ibendhou, in search of dry land suitable for settlement. During their passage through the Ningthoukhong region, the goddess sustained a severe injury to her big toe after stumbling on a hard stone. The wound bled profusely, rendering her unable to continue the journey. Her mother, Ibendhou, expressed profound grief at their daughter's condition and implored Iputhou Oknarel to intervene. Using spiritual powers and medicinal herbs, Oknarel was able to stop the bleeding and relieve the pain, though Khudithibi could not be moved from the location. This site of healing came to be known as Napithabi (). Efforts to relocate the goddess failed, and it was ultimately accepted that she would remain at the site permanently. The surrounding hillock was named Khudithibi (), derived from the event, and later prefixed with the deity’s name, becoming Macha Ibemma Khudithibi. Since then, villagers from the Meitei and Rongmei communities have continued to make offerings of leaves, flowers, and grasses at the foot of a prominent oak tree () in her honor. === Another account === According to another legend, when Oknarel arrived in Ningthoukhong with his family, Macha Ibemma Khudithibi accidentally struck a stone with her foot, fell onto the road, and died. The location of her death has since been maintained with natural vegetation, including trees, flowers, and sacred groves. Tombs and places of worship have been established at the site by the local community. The area reflects elements of Manipur's historical and cultural heritage. == Cultural significance == The location and associated myth form an important part of local religious practice. The separation of Macha Ibemma Khudithibi from her parents is marked by ritual lamentations, particularly those attributed to Ibendhou. The narrative highlights themes of maternal devotion, divine destiny, and ritual remembrance. Her father, Ibudhou Oknarel, is said to have promised annual visits to his daughter. He vowed that no significant occasion, particularly religious festivals, would occur without including her. These visits take place at Kabokthel (), a sacred meadow en route to Khudithibi from Ningthoukhong. The ritual visitation, known as Lai-Chingkaba (), is conducted annually prior to major Meitei festivals such as Lai Haraoba () and Hiyang Tannaba (). The event involves ceremonial processions with offerings, led by priests (Amaiba) and priestesses (Amaibi), with the deities symbolically carried on a palanquin. After leaving his daughter at Khudithibi, Ibudhou Oknarel is believed to have resettled in the Ningthoukhong region alongside his consort, Ibendhou Khunbungambi, near the local brooks. == Worship and legacy == Macha Ibemma Khudithibi continues to be a subject of local devotion, and her legend is preserved in ritual practice and oral tradition. The site remains culturally significant to communities in and around Ningthoukhong, serving as a locus for annual observances and offerings linked to Meitei cosmology and ancestral worship. == MEK area == In 2015, the Sub-Divisional Officer (SDO)/Sub-Divisional Magistrate (SDM) of Bishnupur issued an eviction notice concerning the Macha Ebemma Khudithibi (MEK) area. The notice raised concerns among local inhabitants, particularly the Meetei and Kabui communities, regarding the potential displacement and loss of ancestral land. The proposed development project involves the establishment of a Technology Centre for Fragrance and Flavor by the Department of Commerce and Industries, Government of Manipur. The MEK area is located approximately 33 kilometers south of Imphal and 3 kilometers west of Ningthoukhong Municipal Town, situated along National Highway 150. Geographically, it lies at the foothills of the Laimaton and Thangching hill ranges, which were historically significant during World War II due to battles between British and Japanese forces. The region is situated about 4 kilometers from Loktak Lake and is separated from it by extensive agricultural land. Covering an area of around 60 hectares, MEK is surrounded by cultivated paddy fields, agroforestry plots, and native vegetation. Notable tree species in the area include Phoebe hainesiana (Uningthou), Quercus serrata (Uyung), Schima wallichii (Usoi), Tectona grandis (Teak), Magnolia champaca (Leihao), Gmelina arborea (Wang), and Cycas pectinata (Yendang). Some of these trees are estimated to be over a century old, and the area also contains various medicinal plant species. The MEK area has been inhabited by diverse ethnic groups, including Meeteis and tribal communities, who have coexisted in the region for generations. == Religious body == The Macha Ibemma Trust, Khudithibi, Ningthoukhong (/), is a religious organization. It focuses on preserving, protecting, and promoting the holy and sacred places and activities related to the goddess Macha Ibemma Khudithibi. The trust was founded in September 2018. == Related pages == * Lai Haraoba in Myanmar * Lai Haraoba in Bangladesh * Lai Haraoba in Tripura * Meitei princess * Meitei royal etiquette == References == Category:Meitei mythology Category:Meitei folklore Category:Meitei religion Category:Meitei gods and goddesses",
 "title": "Macha Ibemma Khudithibi"
}