{
 "id": "1191586",
 "text": "The monarchs of Kush were the rulers of the ancient Kingdom of Kush (8th century BCE – 4th century CE), a major civilization in ancient Nubia (roughly corresponding to modern-day Sudan). Kushite power was centralised and unified over the course of the centuries following the collapse of the New Kingdom of Egypt , leading to the eventual establishment of the Kingdom of Kush under Alara . Kush reached the apex of its power –656 BCE, when the Kushite kings also ruled as the Twenty-fifth Dynasty of Egypt. The kingdom remained a powerful state in its heartland after Kushite rule in Egypt was terminated and it survived for another millennium until its collapse . Egyptian culture heavily influenced Kush in terms of its royal and monumental iconography, though indigenous elements were also used and became increasingly prominent in the Meroitic period (c. 270 BCE–350 CE). There are no preserved Kushite lists of rulers and the regnal sequence is instead largely reconstructed based on evidence such as royal inscriptions and burials. Surviving sources are at several points scant, meaning that parts of the chronology and sequence are approximate and tentative. The list of rulers might also be incomplete given that future discoveries of additional royal names and burials are possible. == List of ancient monarchs (1069 BCE – CE 350) == === Early Napatan period (1069–780 BCE) === The Early Napatan period began with Kush becoming autonomous or independent in the wake of the collapse of the New Kingdom of Egypt, 1069 BCE. The material from Kush during this time is extremely scant. There may have been several local Kushite political units, not properly unified into a single kingdom until the beginning of the later Middle Napatan period. During the Early Napatan period, political authority in the region slowly coalesced around Napata. The original royal cemetery of Napata (El- Kurru) contains several (unnamed) burials that are earlier in age than the later Middle Napatan period, perhaps the burials of local chieftains. These have sometimes been interpreted as the burials of around five generations of kings earlier than Alara, the earliest Kushite king known by name. Alara is however generally considered the founder of Kush by historians since he was referenced in the writings of later monarchs as a dynastic founder, in contexts suggesting that he also established the kingdom. === Middle Napatan period (780–656 BCE) === The Middle Napatan period began with the rule of the earliest known named Kushite monarch, Alara, and encompassed the later period of Kushite rule over Egypt (as Ancient Egypt's 25th dynasty). This list includes the conventional speculative patrilineal relationships between some of the rulers; these are not accepted by all scholars and it is possible that as many as three intermarrying families were involved in the early stages of the kingdom. Portrait Name Reign Succession and notes Burial Alara 780–760 BCE (traditional dates) The earliest known Kushite ruler; in later times considered a dynastic founder. There is no contemporary evidence from Alara's reign but he is named in the funerary inscription of his daughter Tabiry (wife of Piye) and was also named as an ancestor by his successors. Piye's direct predecessor was Kashta, so Alara was likely Kashta's direct predecessor. Kur. 9 (assumed) Kashta –747 BCE Brother of Alara (?). Established Kushite control over Upper Egypt 760 BCE and proclaimed himself as pharaoh, challenging the claims of Egyptian rulers further north. Secured his daughter Amenirdis I's appointment as God's Wife of Amun. Kur. 8 (assumed) Piye –716 BCE Son of Kashta (?) and son-in-law of Alara. Conquered Egypt in an extensive 739 BCE military campaign, making Kashta's pharaonic claim a political reality and establishing the 'Kushite Empire' (Twenty-fifth Dynasty of Egypt). Kur. 17 Shebitku –702 BCE Possibly son of Piye and Queen Peksater or maybe a brother of Piye. Moved the capital from Napata to Memphis. Entered into trade and diplomacy with the Assyrian king Sargon II. Kur. 18 Shabaka –690 BCE Son of Shebitku (?). Established full control over the Nile Delta; defeated the delta-based rival Pharaoh Bakenranef. Intervened in the Assyrian king Sennacherib's campaign in the Levant in 701 BCE, on the side of the Kingdom of Judah. Kur. 15 Taharqa 690–664 BCE Son of Piye and Queen Abar. Had a largely peaceful and prosperous reign, overseeing several building projects in Egypt and Kush. Lost Egypt to the Assyrian Empire in 671 BCE and transferred the capital back to Napata. Recaptured Egypt but defeated again in 667 BCE. Founded a new royal cemetery in Nuri, used by later kings for c. 300 years. Nu. 1 Tantamani 664–after 656 BCE Son of Shabaka and Queen Qalhata. Recaptured Egypt from the Assyrians in 664 BCE, though was defeated and driven away the next year. Remained recognised in Upper Egypt until 656 BCE, whereafter the Kushites completely lost control over Egypt. Last ruler to be buried at the ancestral Kushite royal cemetery in El-Kurru. Kur. 16 === Late Napatan period (656–270 BCE) === The Late Napatan period encompasses Kushite history after the loss of Egypt, for as long as Napata remained the site used for royal burials. Portrait Name Reign Succession and notes Burial Phase I: The first four kings of the Late Napatan period are well-attested and maintained much of the earlier Kushite royal practices. Phase I: The first four kings of the Late Napatan period are well-attested and maintained much of the earlier Kushite royal practices. Phase I: The first four kings of the Late Napatan period are well-attested and maintained much of the earlier Kushite royal practices. Phase I: The first four kings of the Late Napatan period are well-attested and maintained much of the earlier Kushite royal practices. Phase I: The first four kings of the Late Napatan period are well-attested and maintained much of the earlier Kushite royal practices. Atlanersa Second half of the 7th century BCE Son of Taharqa (?) and Queen (...)salka (?). Kush may have faced an invasion led by Pharaoh Psamtik I under either Atlanersa or his successor, though the evidence is lacking. Began building Temple B700 in Jebel Barkal. Nu. 20 Senkamanisken Second half of the 7th century BCE Son of Atlanersa (?) and Queen Maletaral. Finished building Temple B700. Nu. 3 Anlamani Late 7th century BCE Son of Senkamanisken (?) and Queen Nasalsa. Earliest ruler documented to have undertaken the traditional Kushite coronation journey, being crowned in Meroë, Napata, and Kawa. Nu. 6 Aspelta Early 6th century BCE Son of Senkamanisken (?) and Queen Nasalsa. Younger brother of Anlamani. Likely king at the time of Pharaoh Psamtik II's 593 BCE war against Kush. The amount and quality of his monuments indicates a prosperous reign. Aspelta's name being erased in some places also suggests that he faced some unknown internal political controversy. Nu. 8 Phase II: Little information is recorded from Kush during the reigns of the kings immediately following Aspelta. The chronology is approximate and not much is known other than names and places of burial. Phase II: Little information is recorded from Kush during the reigns of the kings immediately following Aspelta. The chronology is approximate and not much is known other than names and places of burial. Phase II: Little information is recorded from Kush during the reigns of the kings immediately following Aspelta. The chronology is approximate and not much is known other than names and places of burial. Phase II: Little information is recorded from Kush during the reigns of the kings immediately following Aspelta. The chronology is approximate and not much is known other than names and places of burial. Phase II: Little information is recorded from Kush during the reigns of the kings immediately following Aspelta. The chronology is approximate and not much is known other than names and places of burial. Aramatleqo Second quarter of the 6th century BCE Son of Aspelta (?) and Queen Kheb (?), a daughter of Anlamani. Known from his tomb, a statue, and inscriptions in Meroë. Nu. 9 Malonaqen First half of the 6th century BCE Son of Armatleqo (?) and Queen Amanitakaye (?). Known from his tomb, building activity, and various inscriptions. Nu. 5 Analmaye Middle of the 6th century BCE Unknown descent. Known from his tomb. Nu. 18 Amaninatakilebte Second half of the 6th century BCE Unknown descent. Known from his tomb, building activity, and various inscriptions. Nu. 10 Piankhariten Second half of the 6th century BCE (?) Unknown descent. Known from cartouches on objects in Nu. 25 (burial of a queen consort). Unidentified Karkamani Second half of the 6th century BCE Unknown descent. Known from his tomb and inscriptions in Meroë. Nu. 7 Amaniastabarqa Late 6th century BCE Unknown descent. Known from his tomb. Nu. 2 Siaspiqa Early 5th century BCE Unknown descent. Known from his tomb and inscriptions in Meroë. Nu. 4 Nasakhma First half of the 5th century BCE Unknown descent. Known from his tomb. Nu. 19 Malewiebamani Middle 5th century BCE Son of Nasakhma (?) and Queen Saka'aye (?). Known from his tomb. Nu. 11 Talakhamani Younger brother of Malewiebamani (?). Known from his tomb and inscriptions by his successor. Nu. 16 Phase III: Kushite rulers beginning with Amanineteyerike revive some earlier practices. Their royal titularies suggest a period of greater political ambition. Phase III: Kushite rulers beginning with Amanineteyerike revive some earlier practices. Their royal titularies suggest a period of greater political ambition. Phase III: Kushite rulers beginning with Amanineteyerike revive some earlier practices. Their royal titularies suggest a period of greater political ambition. Phase III: Kushite rulers beginning with Amanineteyerike revive some earlier practices. Their royal titularies suggest a period of greater political ambition. Phase III: Kushite rulers beginning with Amanineteyerike revive some earlier practices. Their royal titularies suggest a period of greater political ambition. Amanineteyerike Son of Malewiebamani. Known from his tomb and several inscriptions. Amanineteyerike's royal titles are strongly associated with rule in Egypt, suggesting (unrealised) hopes of restoring Kushite rule there. Nu. 12 Baskakeren Unknown descent. Known from his tomb, the small size of which could indicate a short and insignificant reign. Nu. 17 Harsiotef (c. 400–360 BCE) Son of one of his predecessors and Queen Atasamale. Had a documented reign of at least 35 years, the longest recorded reign of any Kushite ruler. The great political and geographical range of Harsiotef's recorded wars indicate a time of empire-building and expansionism. Nu. 13 Unknown king Middle 4th century BCE An unknown ruler from this time is likely associated with the pyramid Kur. 1. This pyramid was never used for burial but the change in location could indicate political unrest and perhaps a royal claimant from a rival lineage. Kur. 1 (unused) Akhraten ( c. 340 BCE) Son of Harsiotef (?). Known from his tomb and from a granite statue. The statue and the large size of his pyramid indicates that his reign was prosperous and important. Nu. 14 Amanibakhi Second half of the 4th century BCE (?) Unknown descent. Known from a stela and an offering table found in Nuri. Unidentified Nastasen Last third of the 4th century BCE (fl. c. 325 BCE) Son of Harsiotef (?) and Queen Pelkha. Known from his tomb, a stela, and several inscriptions. Continued the empire-building and militant policies of Harsiotef. Nu. 15 Phase IV: The end of Nastasen's reign concludes the period of revival. This time is one of the least-known in Kushite history; rulers are mostly attested only in inscription fragments and the chronology is hypothetical and problematic. Phase IV: The end of Nastasen's reign concludes the period of revival. This time is one of the least-known in Kushite history; rulers are mostly attested only in inscription fragments and the chronology is hypothetical and problematic. Phase IV: The end of Nastasen's reign concludes the period of revival. This time is one of the least-known in Kushite history; rulers are mostly attested only in inscription fragments and the chronology is hypothetical and problematic. Phase IV: The end of Nastasen's reign concludes the period of revival. This time is one of the least-known in Kushite history; rulers are mostly attested only in inscription fragments and the chronology is hypothetical and problematic. Phase IV: The end of Nastasen's reign concludes the period of revival. This time is one of the least-known in Kushite history; rulers are mostly attested only in inscription fragments and the chronology is hypothetical and problematic. Aktisanes Late 4th century BCE Unknown descent. Known from a handful of inscriptions. Mentioned in the works of the Greek historian Hecataeus of Abdera. Bar. 14 (hypothetical) Aryamani Late 4th/early 3rd century BCE Unknown descent. Known from a stela found in Kawa. Bar. 11 (hypothetical) Kash(...)amani Late 4th/early 3rd century BCE Unknown descent. Known from a fragmentary cartouche impressed on a gold leaf. Name type suggests reign sometime between Aktisanes and Sabrakamani. Unidentified Arikepiankhiqo Late 4th/early 3rd century BCE Unknown descent. Known only from an inscription by his successor. Unidentified Sabrakamani First half of the 3rd century BCE Unknown descent. Known only from an inscription in Kawa which also identifies Arikepiankhiqo as his direct predecessor. Unidentified === Meroitic period (270 BCE–350 CE) === In third century BCE, the royal burial ground was moved from Napata to Meroë for the burial of Arakamani. This marked the final step in a more gradual transfer of political authority and wealth to Meroë and is regarded as the beginning of the Meroitic period. The change in capital should not be misinterpreted as indicating a break in historical or cultural continuity; Napata continued to function as an important religious centre and evidence suggests that Meroë had been important from very early on. It is possible that Meroë served as the residence of the Kushite kings from as early as the fifth century BCE. From the 2nd century BCE onwards, Kush is noteworthy for a large number of queens regnants (queens ruling in their own right). Queens regnant retained their earlier style (often kandake) when becoming rulers, though they also adopted the kingly title of qore to indicate their new authority. Due to the high number of ruling queens in the Meroitic period, absent in earlier times, the gender of each monarch is here indicated by a gender symbol (♀ or ♂). In cases where the gender is unknown, no symbol is included. The royal succession, sequence, and chronology of Kushite rulers is especially uncertain in the Meroitic period. By necessity this list shows only one interpretation, though noteworthy alternate ideas are featured in footnotes. Given that the throne appears to have been able to pass through male, female, and indirect lines, this list simply records the parents (if known) of each monarch in the 'filiation' column, without speculation on their overall relations. The use of the ♔ symbol in this column indicates that the parent of a monarch was also a monarch. Portrait Name (gender) Reign Filiation Notes Burial Arakamani (♂) (Ergamenes I) c. 270–middle 3rd century BCE Parents unknown Known in Kush only from his tomb. Identified with 'Ergamenes', who appears in the work of the Greek historian Agatharchides. Contemporary of Ptolemy II in Egypt. Beg. S 6 Amanislo (♂) Middle 3rd century BCE Arakamani (father ♔) (?) Sar(...)tiñ (mother) (?) Known from his tomb and from cartouches inscribed on lion statues. Restored Palace B1200 in Napata. Beg. S 5 Amantekha (♂) Second half of the 3rd century BCE Parents unknown Known from his tomb. Amantekha's tomb is relatively small though also important as the earliest burial in Meroë's northern cemetery. Beg. N 4 Unknown king (♂) Second half of the 3rd century BCE Parents unknown Known from fragmentry inscriptions on a stray block in Meroë's northern cemetery. Contemporary of Ptolemy III in Egypt. Unidentified Arnekhamani (♂) Second half of the 3rd century BCE (c. 240–215 BCE) Parents unknown Known from monumental buildings, some of the most impressive in Kushite history. Contemporary of Ptolemy III and Ptolemy IV in Egypt. Beg. N 53 (assumed) Arqamani (♂) (Ergamenes II) Late 3rd–early 2nd century BCE Arnekhamani (father ♔) (?) Mother unknown Known from his tomb and inscriptions at Philae, Dakka, and Kalabsha. Reconquered Triakontaschoinos from Egypt. Contemporary of Ptolemy IV and Ptolemy V in Egypt. Beg. N 7 Adikhalamani (♂) First half of the 2nd century BCE Parents unknown Known from inscriptions at Philae. Contemporary of Ptolemy V in Egypt. Beg. N 8 (assumed) Tabirqo (♂) First half of the 2nd century BCE Parents unknown Known from his tomb. Beg. N 9 Unknown king (♂) 2nd century BCE Parents unknown Known from his planned tomb, Beg. N 10. This pyramid does not preserve his name and was never used for burial. Beg. N 10 (unused) Nahirqo (♀) Middle 2nd century BCE Parents unknown Known from an inscription and attributed objects. Earliest known female ruler. Former wife of Adikhalamani. Beg. N 11 (assumed) Tanyidamani (♂) Second half of the 2nd century BCE Adikhalamani (father ♔) (?) Nahirqo (mother ♔) (?) Known from numerous inscriptions in Jebel Barkal and Meroë. The earliest known monumental inscriptions written in Meroitic are from Tanyidamani's reign. Beg. N 12 (assumed) Pakhedateqo (♂) End of the 2nd–first half of the 1st century BCE Parents unknown Known only from an inscription on a rock, dated using palaeography to around Tanyidamani's time. Unidentified Unknown queen (♀) End of the 2nd–first half of the 1st century BCE Parents unknown Known from a tomb dated to this time, which does not preserve a name. Bar. 8 Naqyrinsan (♂) First half of the 1st century BCE Parents unknown Known from an inscription on an offering table found in pyramid Beg. N 13, presumably his tomb. Beg. N 13 (assumed) Teriteqas (♂) Late 1st century BCE Parents unknown Known from Meroitic inscriptions at Dakka. The direct predecessor of Amanirenas. Contemporary of Cleopatra VII in Egypt and Augustus in Rome. Beg. N 20 (assumed) Amanirenas (♀) End of the 1st century BCE–beginning of the 1st century CE Parents unknown Known from four inscriptions. Attested as kandake under Teriteqas (perhaps her husband) and then as qore. Contemporary of Augustus in Rome; successfully defended Kush against Roman expansion. Bar. 4 (assumed) Amanishakheto (♀) Early 1st century CE Father unknown Ar(...)tḫwit (mother) Very well documented. Likely the direct successor of Amanirenas, though the relation between them is unclear. Had a prosperous reign and oversaw considerable building projects and administrative reorganisation. Beg. N 6 Shanakdakhete (♀) First half of the 1st century CE Parents unknown Known from inscriptions on a temple she built in Naqa. Previously misplaced in the chronology three centuries earlier due to a misinterpretation of her inscriptions. Beg. N 21 (hypothetical) Unknown king (♂) First half of the first century CE Parents unknown Known from a tomb dated to this time, which does not preserve a name. Bar. 2 Nawidemak (♀) First half of the first century CE (?) Parents unknown Known from a statuette and from her tomb, which depicts and titles her as a queen regnant. Bar. 6 Amanikhabale (♂) First half of the first century CE (?) Father unknown Nawidemak (mother ♔) (?) Known from inscriptions from Kawa, Basa, and Naqa, as well as a broken stela from Meroë. The monuments and their distribution indicate a prosperous reign. Beg. N 2 (assumed) Natakamani (♂) Middle 1st century CE Father unknown Amanitore (mother ♔) Very well documented. Amanitore was Natakamani's mother and they ruled together as co-regents. Only Natakamani was titled as qore (Amanitore being kandake), though both were consistently depicted together in monuments with the regalia of kings and neither is ever attested as sole ruler. Their reign appears to have been a very prosperous period. Contemporaries of Nero in Rome (?). Beg. N 22 Amanitore (♀) Middle 1st century CE Parents unknown Very well documented. Amanitore was Natakamani's mother and they ruled together as co-regents. Only Natakamani was titled as qore (Amanitore being kandake), though both were consistently depicted together in monuments with the regalia of kings and neither is ever attested as sole ruler. Their reign appears to have been a very prosperous period. Contemporaries of Nero in Rome (?). Beg. N 1 Shorkaror (♂) Second half of the 1st century CE Parents unknown Known from two inscriptions in Amara and a large rock carving at Gebel Qeili. Also attested as a prince in the time of Natakamani and Amanitore. Unidentified Amanikhareqerem (♂) End of the 1st century CE Parents unknown Known from inscriptions on monuments. Possibly the direct successor of Shorkaror. Beg. N 16 (hypothetical) Amanitenmemide (♂) End of the 1st century–first half of the 2nd century CE Parents unknown Known from his tomb and from an inscription in Meroë. Likely the direct successor of Amanikhareqerem. A skull believed to be Amanitenmemide's was found in his tomb and indicates that he died aged c. 30. Beg. N 17 Amanikhatashan (♀) Middle 2nd century CE (?) Parents unknown Known from her tomb. Beg. N 18 Tarekeniwal (♂) Second half of the 2nd century CE Parents unknown Known from an inscription on an offering table and his tomb. Imagery in Tarekeniwal's tomb places \"unusually strong emphasis\" on him as a triumphant warrior. Beg. N 19 Amanikhalika (♀) Second half of the 2nd century CE (?) Parents unknown Former wife of Tarekeniwal (?). Known from an inscription on her son Aritenyesbokhe's offering table. Tentatively identified as the ruler buried in Beg. N 32. Beg. N 32 (tentative) Aritenyesbokhe (♂) Second half of the 2nd century CE Tarekeniwal (father ♔?) Amanikhalika (mother ♔) Known from an inscription on an offering table and inscriptions on loose blocks in Meroë. Beg. N 34 (assumed) Amanitaraqide (♂) End of the 2nd century CE (?) Pisakar (father) Amankhadoke (mother) Known from an inscription on an offering table. Might have had royal descent through his mother. Chronological position and burial site debated. Beg. N 36 (tentative) Amanikhedolo (♂) First half of the 3rd century CE (?) Akedḫetiwl (father) Amanipiteke (mother) Known from an inscription on an offering table. Might have had royal descent through his mother. Chronological position uncertain and speculatively identified as the ruler buried in Beg. N 43. Beg. N 43 (hypothetical) Takideamani (♂) First half of the 3rd century CE Adeqetli (father) Nptdḫeto (mother) Known from an inscription on an offering table. Names of his parents suggest lack of direct royal descent. Rough chronological position can be established by the objects found in his tomb. Beg. N 29 Mashadakhel First half of the 3rd century CE (?) A(...)ble (father) Mother unknown Known from a partial inscription on an offering table. Likely dates to the 2nd or 3rd century CE, though precise chronological position and burial site unknown. Unidentified Teqorideamani (♂) Second half of the 3rd century CE Teritni(d)e (father) Arqtñmaks (mother) Known from his tomb, a graffito at Philae, and three inscriptions in Meroë. The graffito establishes that he became king in 249 CE. Contemporary of Trebonianus Gallus, and perhaps also Valerian and Gallienus, in Rome. His pyramid is the youngest securely attributed Kushite pyramid. Beg. N 28 Tamelerdeamani (♂) Second half of the 3rd century CE Arotnide (father) Arqtñmaks (mother) Younger half-brother of Teqorideamani. Known from an inscription on an offering table. Hypothetically identified as the ruler buried in pyramid Beg. N 27. Beg. N 27 (hypothetical) Talakhidamani (♂?) End of the 3rd/first half of the 4th century CE (?) Parents unknown Once known only from an enigmatic inscription at Philae. Securely identified as a ruler in 2017 through another inscription in Meroë. Perhaps initially regent for the prince Maloqorebar, who is not attested to have ever ruled in his own right. Unidentified Aryesbokhe (♂) End of the 3rd/first half of the 4th century CE (?) Teritebḫtey (father) Wlamni(..)ptide (mother) Assumed to have had royal descent through his mother. Known from an inscription on an offering table. Chronological position and burial site debated. Beg. N 16 (tentative) Yesebokheamani (♂) End of the 3rd/first half of the 4th century CE (?) Parents unknown Known from inscriptions. One of these is a dedication text at Philae which might place Yesebokheamani after 298 CE, when the Romans withdrew from that region. Contemporary (?) of Diocletian in Rome. Beg. N 51 (hypothetical) (...)k(...) (♂) First half of the 4th century CE Parents unknown Known from a partial inscription on a fragmentary offering table. Speculatively identified as the ruler buried in pyramid Beg. N 38. Beg. N 38 (hypothetical) (.)p(...)niñ First half of the 4th century CE Arḫrli (father) Mother unknown Known from a partial inscription on a fragmentary offering table. Speculatively identified as the ruler buried in pyramid Beg. N 37. Beg. N 37 (hypothetical) (♀) First half of 4th century CE Delitey (father) (...)tli (mother) Known from an inscription on an offering table. Tentatively identified as the ruler buried in pyramid Beg. N 26. Beg. N 26 (tentative) Amanipilade (♀) Middle 4th century CE Tehye (father) Mkeḫñye (mother) Known from an inscription on an offering table. Tentatively identified as the ruler buried in pyramid Beg. N 25. Beg. N 25 (tentative) Beg. N 25 is the last known royal burial in Meroë and is assumed to mark the end of the dynasty ruling from that city. Circumstantial and indirect evidence also dates the end of Meroitic political authority to the middle decades of the fourth century CE. == Successor nations of Nubia == László Török hypothesised that a unified (Nubian?) 'Post-Meroitic successor state' ruled a territory roughly corresponding to the Kushite kingdom for several decades after the end of the Meroitic period. Such a realm may be indicated by later burials of elites at Ferkeh, Gemai, Qustul and El-Hobagi. Török suggested that these elites were non-royal deputies of a monarch residing in the south. The southern cemetery of Ballana, where seven generations of post-Kushite but pre-Christian rulers are buried, has sometimes been suggested to belong to a successor state of Kush, though the burials share few ideological similarities with those of the Kushite rulers beyond the presence of silver crowns in a similar style. The existence of a unified post- Meroitic state is not universally accepted. Josefine Kuckertz, for instance, instead dates the disintegration of the kingdom to already in the middle fourth century CE, at the same time as the fall of the Meroitic dynasty. Around 420 CE, the aforementioned elites or deputies began assuming royal insignia of their own, resulting in the disintegration of the supposed successor state (if one existed) into the later kingdoms of Nobatia (north), Makuria (center), and Alodia (south). Out of these three, Nobatia is in particular sometimes considered a small post-imperial remnant of Kush, maintaining some aspects of Kushite culture but also exhibiting Hellenistic and Roman influences. The early stage of Nobatia is conventionally associated with the Ballana cemetery. === Kings of Blemmyes === Name Reign Succession and notes Tamal Isemne Degou Phonen === Kings of Nobatia === Name Reign Succession and notes Charamadoye Aburni Eiparnome First Orthodox Christian ruler of Nobatia. Tokiltoeton W-r-p-y-w-l (maybe read Awarfiula or Orfiulo) Zacharias Following the annexation of the kingdom by Makuria in C.E.701, the kings of Nobatia were the rulers of Makuria. ==== Eparchs of Nobatia ==== The eparchs were also viceroys of the kingdom of Makuria-Nobatia. Name Reign Succession and notes Lesu Lesu II Mari Kuda Urrosi === Kings of Makuria === . Name Reigned Succession and notes Qalidurut Defended Makuria against the Muslims; an annual tribute was negotiated Mercurios CE 696–710 Mentioned in two building inscriptions Simon Abraham ruled only for a short time Markus reigned only six months, was murdered while praying in church Cyriacus marched with his army to Cairo to force the release of the Patriarch of Alexandria Chael or Michael Johannes Zacharias I. Sent his son to Baghdad because he had not paid the tribute for 14 years, there he could probably obtain a debt relief Giorgios I CE 856/859/866 Son of Zechariah I; border disputes in the north are reported Zacharias II CE 920–930 Was involved in border disputes in the north; son of George I. Kabil Giorgios II CE 969 – Appears on murals in the Faras Cathedral Raphael CE 1000- Erected Christian building in Old Dongola Son of Raphael Stephanos Solomon 1077–1079/80 Giorgios III Basil I made his son a bishop Giorgios IV. CE 1130–1158 Known from his tombstone, which was found in Egypt Moses Giorgios was also Eparch of Palagi Murtaschkar David Schekanda ca. 1276 Barak Semamun Nephew of Senamun 1287/8–1288 Semamun Nephew of David (Budamma) Semamun Ayay Kernabes CE 1311–1316 Barschanbu CE 1316–1317 First Muslim ruler of Makuria, puppet of the Mamluks Kanz ad-Daula Abram Kanz ad- Daula Kernabes CE 1323–1324 Kanz ad-Daula al-Amir Abi Abdallah Kanz ad-Daula CE 1333 === King(s) of Tungul === Name Reign Succession and notes Paper === Kings of Alwa === Name Reigned Succession and Notes Giorgios Asabiyus (Eusebios) Astabanus (Stephanus) David ?Basil CE 12th century}} ?Paul === Kings of Dotawo === Name Reign Succession and notes David Moses Gorgios? Basil Elite Paul or Piarl Giorgio Simon Siti Joel == See also == * Kandake * Viceroy of Kush == Notes == == References == === Citations === === Bibliography === * * * *Dunham, Dows (1950–1955). The Royal Cemeteries of Kush ** ** ** * * *Eide, Tormod; Hägg, Tomas; Holton Pierce, Richard; Török, Lászlo (1994–1998). Fontes Historiae Nubiorum: Textual Sources for the History of the Middle Nile Region Between the Eighth Century BC and the Sixth Century AD ** ** ** * * * * * * * * * * * * * * * * * * * \\+ \\+ Kush Kush",
 "title": "List of monarchs of Nubia"
}