{
 "id": "1191784",
 "text": "The Movement for Black Lives (M4BL) is a group made up of over 50 organizations that work to support and protect Black communities in the United States. Some of the groups in the movement include the Black Lives Matter Network, the National Conference of Black Lawyers, and the Ella Baker Center for Human Rights. Other organizations like Color of Change, Race Forward, Brooklyn Movement Center, PolicyLink, Million Women March Cleveland, and ONE DC support their work. They also get help with communication and strategy from another group called Blackbird. On July 24, 2015, the Movement for Black Lives held its first big meeting at Cleveland State University, where about 1,500 to 2,000 activists came together for open talks and demonstrations. The original goal was to find ways to hold police responsible for their actions across the country. But the event became the start of a much larger movement. By the end of the 3-day meeting on July 26, the group began a year-long effort to bring together local and national groups to form a united front. After that year, they created a platform to clearly share their goals, demands, and policies—all focused on helping Black communities gain freedom and justice across the U.S. Later, after George Floyd was killed, the group introduced the BREATHE Act, which called for major changes to policing. The act asked for less money to be spent on police and more money to go to community programs and new ways to handle emergencies. In 2020, the Movement for Black Lives also shared policy ideas to deal with the effects of the COVID-19 pandemic. == Organization == During the George Floyd protests, Deva Woodly, a Politics Professor at The New School, said the Movement for Black Lives is a group that brings together many organizations from across the country. She explained that it helps people understand how today’s problems are connected to deeper, long- term issues in the system. === Platform and statements === In August 2016, the Movement for Black Lives shared its main goals in a plan called A Vision for Black Lives: Policy Demands for Black Power, Freedom and Justice. The plan had six main points: # Stop unfair treatment and violence against Black people. # Give reparations (repayments) for the past and ongoing harm caused to Black people. # Take money away from systems that hurt or lock up Black people, and instead invest in schools, healthcare, and safety. # Make the economy fair for everyone, and give Black communities real control and ownership, not just access. # Let communities have control over the laws and systems that affect them the most. # Support Black leadership and independence in all parts of life. The group believes that reparations are realistic and possible. They point to payments made in 2012 to African-American farmers as an example. In 2023–2024, the group also called for an end to violence in Gaza. They asked for a ceasefire and said they stand against what they called a genocide in Palestine. === Money and Organizational Support === Soon after the movement shared its platform in 2016, 50 different groups showed their support. One big project that followed was the creation of the Black-Led Movement Fund (BLMF) by a charity group called Borealis Philanthropy. The BLMF was made to support the Movement for Black Lives. It has two main goals: # To collect and provide $100 million in donations for the movement. # To help the movement grow stronger by improving how its organizations are run and supported. == Major events == === Cleveland State University protests === On July 24, 2015, people from all over the U.S. came together at Cleveland State University to respond to police violence against African Americans. The deaths of Michael Brown, Eric Garner, and Tamir Rice helped spark the need for this meeting. Over three days (July 24–26), activists took part in discussions, watched short films, and joined workshops focused on finding ways to solve problems faced by Black communities. This event was the first big gathering of the Movement for Black Lives, with more than 1,500 people attending. After the event, activists began working to officially form the Movement for Black Lives and create a shared policy platform to help guide efforts to end police violence and racial injustice in the U.S. === Professional sports demonstrations === Athletes in many U.S. professional sports have shown their support for the movement through protests and demonstrations. In 2016, NFL player Colin Kaepernick chose to kneel during the national anthem before a game. He said, “I’m not going to stand and show pride in a flag for a country that oppresses Black people and people of color.” Kaepernick and other players faced strong criticism throughout the season, including from Supreme Court Justice Ruth Bader Ginsburg, who said, “Would I arrest them for doing it? No… I think it’s dumb and disrespectful.” Even though reactions were mixed, Kaepernick’s protest clearly helped bring more attention to the issue of how Black people are treated in the United States. === Strike for Black Lives === On July 20, 2020, the Movement for Black Lives joined with about 60 other groups, including many trade unions, to organize the Strike for Black Lives. This event was part of the larger protests after George Floyd's death and the broader Black Lives Matter movement. Thousands of workers across the country walked off their jobs to protest for racial and economic justice. == Reception == Groups like the National Council of Asian Pacific Americans, ACLU of Northern California, and the National Council of Jewish Women showed support for the Movement for Black Lives by making public statements after the movement shared its platform. Many groups agreed with the movement’s call to change the criminal justice system and stop police violence. The National Council of Jewish Women said, \"NCJW believes Black lives matter, including Jews of color, who are an important part of both the Jewish community and our NCJW community. We know that the Black and Jewish communities are connected, and our fights for justice are linked.\"In August 2020, the Movement for Black Lives and more than 100 left-wing groups, like the Council on American-Islamic Relations, Jewish Voice for Peace, and Jews for Racial and Economic Justice, signed a public letter. They asked people to stop working with the Anti- Defamation League (ADL) because the ADL supports Israel. == References == == External links == * Category:Black Lives Matter Category:2014 establishments in the United States",
 "title": "Movement for Black Lives"
}