{
 "id": "1191138",
 "text": "Dorothea Frances Matilda \"Dora\" Pertz FLS (14 March 1859 – 6 March 1939) was a British botanist. She co-authored five papers with Francis Darwin, the son of Charles Darwin, and published many of her own as well. She was elected a Fellow of the Linnean Society of London, being among the first women being admitted into the society. == Early life and education == Pertz was born in London on 14 March 1859 to Georg Heinrich Pertz and his second wife, Leonora Horner, daughter of Leonard Horner, who was a progressive intellectual and a staunch follower of Darwinism. She grew up in a family where the women were well educated and intellectually active; one of her aunts was the botanist Katharine Murray Lyell, who was the biographer of Charles Lyell, her brother- in-law. Through family connections she met many naturalists, including Darwin. She spent most of her youth in Berlin. After her father's death in 1876, Pertz moved to Florence with her mother. She later returned to England and in 1882 was admitted to Newnham College, Cambridge. He spent a year in Italy before returning to Cambridge in 1884, when she participated in one of the Natural Sciences Tripos Courses, including botany, and obtained class honors. Once women were allowed to earn undergraduate degrees, she took her MA in 1932. She later undertook studies of plant physiology, working under the supervision of Francis Darwin, a reader at the university. From 1892 to 1912, they jointly published five papers; During that period, she also collaborated with William Bateson, and they jointly published a paper On Inheritance in Veronica. She also produced two papers independently. == Academic career == In 1905, she was elected to the Linnean Society of London, among the first women admitted as full members. After Darwin's retirement, Pertz was encouraged by Frederick Blackman to undertake research on meristematic tissue, but after a year of observations of germinating seeds her results were inconclusive. She abandoned the research. After Pertz left her research, at Blackman's suggestion, she worked on indexing the German literature on plant physiology, including the journals Biochemische Zeitschrift and Zeitschrift fur Physiologische Chemie. Despite the difficulty of the task, she completed the index by 1935. Between 1923 and 1936 she provided illustrations for her friend Edith Rebecca Saunders, in Floral Anatomy, and both the paper and the illustrations were highly respected. Pertz did much of her work ad honorem, out of a passion for science, and never had a formal contract at Newnham or the university. She also did charity work, including working at a hospital in Cambridge during the First World War. After several years of illness, Pertz died in Cambridge on 6 March 1939. She was cremated and buried at Brookwood Cemetery. == References == Category:Science writers Category:Scientists from London Category:English botanists Category:English scientists Category:English science writers",
 "title": "Dorothea Pertz"
}