{
 "id": "1191826",
 "text": "Philippa Garrett Fawcett (Brighton, April 4, 1868 - London, June 10, 1948) was an English mathematician and educator. She achieved the milestone of obtaining the highest score in the final exams of the mathematics degree at the University of Cambridge, but her academic success was not recognized as the university did not grant any official degree to women at the time. == Early years == She was the only child of suffragette Millicent Fawcett and Henry Fawcett, a professor of political economy at Cambridge University and a Member of Parliament, and the niece of Elizabeth Garrett Anderson, the first British woman to graduate in medicine. == Education == Philippa was educated at Newnham College, Cambridge, co-founded by her mother. On 7 June 1890, aged 22, she became the first woman to achieve the highest score in the Cambridge University Mathematical Tripos examinations. The results were made public, and the students with the highest marks received the most praise. Philippa’s mark was 13 percent higher than the next best student, Geoffrey Thomas Bennett. Even so, she was not called “Senior Wrangler” because, at that time, the title was only given to men. == Career == Thanks to his results in the Mathematical Tripos he obtained a scholarship in Cambridge where he focused his research on fluid mechanics . Among his published articles is \"Note on the Motion of Solids in a Liquid.\" She was later hired as a university professor of mathematics at Newnham College, Cambridge, where she worked for a decade, achieving significant prestige as a professor. Philippa Fawcett maintained strong links with Newnham College throughout her life. The Fawcett Building (1938) was named in recognition of her and her family's contribution to Newnham. == Death == She died on 10 June 1948 just one month after Royal Assent was confirmed allowing the Cambridge BA degree to be awarded to women and thus to be awarded the title of Wrangler, fifty-eight years after passing the examination and obtaining the score that made her worthy of it. == References == Category:Mathematicians Category:British scientists",
 "title": "Philippa Fawcett"
}