{
 "id": "1191743",
 "text": "The Margraviate of Brandenburg () was a principality in the Holy Roman Empire from 1157 to 1806. The principality was originally poor. However, the principality became very important because they were given the Duchy of Prussia in 1618. They then became very important in the history of Germany and Central Europe as part of the Prussian kingdom. Brandenburg started from the Northern March. The Northern March was started in the territory of the Slavic Wends. The rulers of Brandenburg were called margraves. The margraves were prince-electors in the Golden Bull of 1356. Margraves could vote in electing the Holy Roman Emperor. Because of this, the Margraviate of Brandenburg also was called the Electoral Brandenburg or the Electorate of Brandenburg ( or ). The House of Hohenzollern became the leader of Brandenburg in 1415. In 1417, Frederick I moved the capital from Brandenburg an der Havel to Berlin. By 1535, the Margraviate of Brandenburg was about big. In 1535, the Margraviate of Brandenburg also had about 400,000 people.Preserved Smith. The Social Background of the Reformation. 1920. Page 17. The House of Hohenzollern let Brandenburg have a lot of power in the 17th century. In the 17th, century, they were also given the Duchy of Prussia. This made Brandenburg into Brandenburg-Prussia. Brandenburg-Prussia would then become the Kingdom of Prussia. The Kingdom of Prussia was a very important German state in the 18th century. The Margraviate of Brandenburg ended when the Holy Roman Empire ended in 1806. It was replaced after the Napoleonic Wars with the Province of Brandenburg in 1815. Brandenburg turned into the North German Confederation in 1867. In 1871, Germany was unified. The North German Confederation became the German Empire. The German Empire became the German Reich of 1871–1945. This soon became the Federal Republic of Germany, == Footnotes == == References == * * == Other websites == * at Brandenburg1260.de. * * Historical map of Brandenburg, 1789 * by Theodor Fontane, 1899 at Lexikus.de. Category:Former principalities Category:1806 disestablishments Category:1800s disestablishments in Germany Category:1150s establishments Category:12th- century establishments in Europe",
 "title": "Margraviate of Brandenburg"
}