{
 "id": "1191508",
 "text": "The 2024–25 Major League Tournament was the 83rd edition of Sri Lanka's national cricket championship, and the 35th since it became a first-class competition. The tournament was contested by 18 teams, who were divided into two groups of nine. The group matches were played in round-robin format from 27 December 2024 until 2 March 2025. Each team took part in eight 3-day matches, four at home and four away. The winners of the two groups were Bloomfield Cricket and Athletic Club and Nondescripts Cricket Club. They qualified for the final, which was a 4-day match from 5 to 8 March 2025 at the R. Premadasa Stadium in Colombo. It was drawn, and ended in a first innings victory for Bloomfield who scored 508 and 242/4, while Nondescripts scored 312. It was Bloomfield's tenth title (including one shared), and their first since the 2010–11 season. ==Format== The tournament was contested by a total of 18 teams, who were split into two round-robin groups—A and B—of nine teams apiece. All teams played eight 3-day matches, one against each of the other eight teams in the group. Four matches were played at home, and four away. Points were awarded after each match, based on the match result, and on the teams' batting and bowling performances. ==Group stage== The tournament began on 27 December 2024 with four matches in each of Groups A and B. The last group matches ended on 2 March 2025. The leading teams in Group A were Bloomfield Cricket and Athletic Club (105.225 points), Colts Cricket Club (94.89), and Ace Capital Cricket Club (87.595). The Group B leaders were Nondescripts Cricket Club (117.67), Moors Sports Club (103.315), and Colombo Cricket Club (94.04). A big talking point at the end of the season was the relegation to second tier cricket of Singhalese Sports Club. They finished eighth in Group B. Sri Lanka's Sunday Times commented: Kandy Customs Sports Club finished bottom of Group B, and yet their Sahan Kosala was voted Best Batter of the tournament. He scored 722 runs with a highest innings of 128. The Best Bowler award went to Dilum Sudeera of the Police Sports Club, who finished fourth in Group A. The prestigious Player of the Tournament award was presented to Ravindu Fernando of Bloomfield. ==Final== Bloomfield and Nondescripts met in the final, a 4-day match from 5 to 8 March 2025, played at the R. Premadasa Stadium in Colombo. The match was drawn, with Bloomfield achieving a first innings victory. They scored 508 and 242/4, against 312 by Nondescripts. It was Bloomfield's first championship since the 2010–11 season, and their ninth overall (plus one shared). Ron Chandraguptha won the Player of the Final award with an innings of 237 from 493 balls. He was supported by Asitha Wanninayake, who scored 96 and 104*. The best performances for Nondescripts were by Test pace bowler Lahiru Kumara, who took 6/87 in the first innings, and Lahiru Udara, who scored 145. ==References== Category:Major League Tournament Category:2024 in cricket Category:2025 in cricket Category:2024 in Sri Lanka Category:2025 in Sri Lanka",
 "title": "2024–25 Major League Tournament"
}