{
 "id": "1191363",
 "text": "Doug Merritt is an American business executive who serves as the Chairman, Chief Executive Officer (CEO), and President of Aviatrix, a company that provides secure cloud networking solutions. He has held senior leadership positions at several technology firms, including Splunk, Cisco Systems, SAP, and PeopleSoft. ==Early life and education== Merritt began his undergraduate studies at the University of California, Berkeley, from 1982 to 1984. He later transferred to the University of the Pacific in Stockton, California, where he earned a Bachelor of Science degree in Business in 1987. ==Career== Merritt has held a range of executive roles across the technology industry. He began his executive career as co-founder and CEO of Icarian, Inc., a cloud-based human capital management company, from 1996 to 2001. The company was later acquired by Workstream Corp. He then joined PeopleSoft Inc., where he served from 2001 to 2004 as Group Vice President and General Manager of the Human Capital Management Product Division. Following this, Merritt held several executive positions at SAP between 2005 and 2011, including serving as a member of the company's extended Executive Board. In 2011, Merritt became CEO of Baynote, Inc., a company focused on behavioral personalization and marketing technology, before moving to Cisco Systems in 2012. At Cisco, he served as Senior Vice President of Products and Solutions Marketing, overseeing global product strategy and positioning. In 2014, he joined Splunk as Senior Vice President of Field Operations and was appointed President and CEO the following year. Under his leadership, Splunk transitioned from an on- premises software company to a cloud-based SaaS provider, increasing its Annual Recurring Revenue (ARR) from approximately $100 million to nearly $3 billion by 2022. In June 2023, Merritt was appointed Chairman, CEO, and President of Aviatrix, a company specializing in secure cloud networking. He succeeded Steve Mullaney. == References == Category:Living people Category:American chief executives Category:American businesspeople",
 "title": "Doug Merritt"
}