{
 "id": "1191532",
 "text": "47, the Dead Man (original title: 47, el muerto) is a short film from Argentina. It was released in 2000 and is about 14 minutes long. The movie was directed by Andrés Dentoni and Fernando \"Nano\" Sosa. The script and storyboard were made by Sosa. The film is in Spanish and was filmed in black and white. It is a mix of psychological horror and political drama. == Plot == Miguel is a young journalism student living in Argentina during the military dictatorship in the 1970s. He joins protests and becomes active in politics. Because of this, he is kidnapped and taken to a secret prison called La Perla. There, he is tortured and dies. Five years later, Argentina becomes a democracy again. One of Miguel’s torturers, known as \"El Turco\", is hiding from the law. He lives alone in an old house and wants to escape the country. He struggles with drug addiction and guilt. He starts to see ghostly visions of Miguel and other victims. These visions remind him of the crimes he did. == Style and production == The movie was made using a handheld camera and natural sound. It has a raw and homemade look. Its style is similar to the Dogme 95 movement, but it is not part of that group. The film uses horror to show the mental effects of political violence. == Themes and importance == 47, the Dead Man is one of the first short films in Argentina to use horror to talk about the country’s history. It connects memory, fear, and justice. It is seen as an early example of using symbolic horror to explore Latin American history in movies. == Recognition == The movie received a special mention for its subject at the annual showcase of the Film and TV School at the National University of Córdoba (UNC). In 2024, it was added to the Internet Movie Database (IMDb). == References == 47, the Dead Man on IMDb Category:Argentine short films Category:2000 films Category:Horror films Category:Political films Category:Films about the Dirty War",
 "title": "47, el muerto"
}