{
 "id": "1191929",
 "text": "Lainingthou Sanamahi Puya Santhok Lup (LSPSL) (), also known as Lainingthou Sanamahi Puya Sandok Lup (LSPSL) (), is a group that works for the development of Sanamahism, the traditional Meitei religion, in Manipur. == Religious conversion == During the third anniversary event in 2022, forty individuals were formally brought in as members or followers of the Sanamahi religion. Attendees of the event adopted a resolution to disseminate the principles of Lainingthou Sanamahi Laining and to seek cooperation from residents of Moreh. The programme concluded with a communal feast. The event was attended by representatives from the Lainingthou Sanamahi Temple Board, Imphal, along with various other organizations. == Foundation days == On May 18, 2022, the third foundation day of the Lainingthou Sanamahi Puya Santhok Lup (LSPSL) Moreh was observed at Ima Kondong Lairembi Haraobung, situated in Ward No. 7, Heinoumakhong Leikai, Moreh. At the event, experts explained the Sanamahi religion in detail and taught the people who attended. A coordinator was appointed to oversee the activities of the Lainingthou Sanamahi Puya Santhok Lup (LSPSL) in the Moreh area, along with the designation of an Amaiba (priest) responsible for performing organizational and ritual duties. On May 18, 2023, the fourth foundation day of the Lainingthou Sanamahi Puya Sandok Lup, Moreh, was observed at the Lainingthou Sanamahi Temple Board premises located at Ahing Khongbal Uphong Yumpham, Imphal. The event was presided over by Bidyapati Senjam, also known as Wakhal Lamjingba, vice president of the Lainingthou Sanamahi Temple Board. It was attended by members of the temple board, staff, and displaced members of the Lup affected by the ongoing situation in the state. The programme concluded with a collective prayer for the restoration of peace and harmonious coexistence among indigenous communities. As part of the observance, attendees offered prayers to Ema Leimarel Sidabi and Lainingthou Sanamahi, seeking peace and harmony among the indigenous communities of Manipur. == Secular events == === Hunger Marchers' Day === In August 2022, Lainingthou Sanamahi Puya Santhok Lup (LSPSL), along with students and residents of the local community, participated in the observance of the 57th Hunger Marchers' Day, which was commemorated at the hall of Eastern Shine School, located in Ward No. 7, Moreh, Tengnoupal district. === Independence Day observance === On August 14, 2022, Lainingthou Sanamahi Puya Santhok Lup, Moreh, served as one of the organizing bodies for the 76th Independence Day observance of Manipur at Keibi Mana Ching. The event included the ceremonial unfurling of the 'Malem Puba Pakhangba Paphal Tongba' flag. == Langban Chara Tamba ritual == On September 11, 2022, the Lainingthou Sanamahi Puya Santhok Lup, Moreh, conducted the annual \"Langban Chara Tamba\" ritual at Ima Kondong Lairembi Haraobung, Moreh. The ritual, traditionally performed to pay homage to deceased ancestors, was attended by residents from five Meitei villages in Moreh. A similar observance took place on the previous day in Serou, Kakching district, organized by Sanamahi Laining (Salai) Kakching, with approximately 300 participants. == Related pages == * Sanamahi Temple * Konthong Lairembi * Lai Haraoba in Bangladesh * Lai Haraoba in Myanmar * Lai Haraoba in Tripura == References == Category:Meitei religion Category:Organisations Category:2019",
 "title": "Lainingthou Sanamahi Puya Santhok Lup"
}