{
 "id": "1191998",
 "text": "The Massacre of Isfahan was a series of mass killings, executions, and purges that occurred between 1722 and 1725 in the city of Isfahan (then the capital of Safavid Persia) after its conquest by Mahmud Hotak, ruler of the Hotak dynasty of Kandahar and self-declared Shah of Persia. Following the decisive siege of the city in October 1722, Mahmud initiated widespread executions of Safavid nobles, Qizilbash military elites, scholars, and civilians. According to later chronicles and travel accounts, approximately 1.2 million civilians were estimated to have died during Mahmud’s occupation, due to mass executions, starvation, disease, and reprisals. Additionally, as many as 7,000 members of the Safavid nobility, including princes and governors, were reportedly executed on Mahmud’s orders. == Background == In March 1722, Mahmud Hotak led a Pashtun army from Kandahar into Persia, defeating Safavid forces at the Battle of Gulnabad and besieging the capital. The siege lasted nearly seven months and resulted in the starvation of tens of thousands. Shah Sultan Husayn surrendered on 23 October 1722 and abdicated in favor of Mahmud, who became ruler of most of Persia. == The Massacre == Following his occupation, Mahmud initially retained Sultan Husayn in a ceremonial role. However, uprisings in the north and east (particularly in Qazvin, Mazandaran, and Tabriz) made Mahmud increasingly paranoid. === Executions of Nobles and Qizilbash Commanders === Between 1722 and 1724, Mahmud ordered the systematic killing of: * Safavid bureaucrats * Qizilbash officers * High-ranking ulema * Former governors and advisors Chroniclers such as Mohammad Sadeq Eshrat report that these purges reached a frenzy, especially after the Afghan garrison suffered assassination attempts. An estimated 7,000 members of the elite were executed, many in the courtyards of the Ali Qapu Palace. === Starvation and Disease === The siege had already caused the deaths of 80,000–100,000 civilians. Under Hotak rule, Isfahan’s food shortages persisted due to disrupted trade and looting. Plague and disease became rampant, leading to **total civilian deaths exceeding 1.2 million, according to European and later Persian estimates. === Execution of Safavid Princes === Fearing their potential as figureheads for rebellion, Mahmud reportedly executed several of Sultan Husayn’s sons in 1724. == Decline and Death == In late 1724 and early 1725, Mahmud began exhibiting signs of mental instability. He suffered from hallucinations, refused to eat, and believed he was being poisoned. In April 1725, he was deposed and likely killed by his cousin, Ashraf Hotak, who seized the throne. == Historical Accounts == The massacre is attested by multiple contemporary and near-contemporary sources: * Persian chronicles (e.g. **Eshrat**, **Astarabadi**) * European witnesses in Isfahan (e.g. **Tavernier**, **Krüsinski**, **Chardin**) * Later Afghan oral traditions (collected by Elphinstone) * Modern historians such as Lockhart, Roemer, and Hanifi == Legacy == The Massacre of Isfahan remains a deeply traumatic episode in Iranian history. Mahmud Hotak’s short-lived rule is remembered for unprecedented bloodshed and destruction of Persian state structures. Although the Hotaks briefly held Persia, their rule was marked by instability, leading to their expulsion by the Afsharid dynasty under Nader Shah. == See also == * Siege of Isfahan (1722) * Hotak dynasty * Safavid dynasty * Ghilji dynasty * Ashraf Hotak == References ==",
 "title": "Massacre of Isfahan"
}