{
 "id": "1191109",
 "text": "Sandy Henny Walsh (born 14 March 1995), also known as Sandy Walsh, is a Belgian-Dutch-Indonesian footballer. He can play as a right-back, as a centre- back. He plays for Yokohama F. Marinos and the Indonesia national team. ==Club career== Walsh spent time in the youth sides of Tempo Overijse and ERC Hoeilaart before joining Anderlecht in 2003 where he stayed until 2011 when he joined Genk. ===Genk=== On 2 September 2012, he made his professional debut for Genk, coming on as a substitute for the final moments of a 2–2 draw with his former side Anderlecht in the Belgian Pro League. ===Zulte Waregem=== Walsh moved to Zulte Waregem in the summer of 2017, making his league debut on 5 August 2017 as a substitute in a 2–0 win over Sint-Truiden. ===Mechelen=== In October 2020, he moved to another Belgian club Mechelen. He made his league debut on 1 November 2020 as a starter in a 2–2 draw with Club Brugge. He scored the only goal in the quarter-final of the Belgian Cup in injury time against Kortijk, sending Mechelen to the semi-finals. ===Yokohama F. Marinos=== On 9 February 2025, J1 League club Yokohama F. Marinos announced the signing of Walsh. He made his debut on 19 February 2025 as a starter in a match AFC Champions League Elite against Shanghai Port. ==International career== === Netherlands === Walsh has represented the Netherlands at youth international and won the UEFA European Under-17 Championship with the under-17 side in 2012. He has represented the Netherlands at every level from under-15 to under-20. === Indonesia === In May 2022, Walsh confirmed that he had decided to represent Indonesia at international level. On 22 November 2022, Walsh received a call-up from Indonesia national team coach Shin Tae- Yong for a training camp in preparation for the 2022 AFF Championship. He was however called back by his club. On 27 May 2023, Walsh received call-up to the Indonesia national team for friendly matches against Palestine and Argentina. However, Walsh was unable to play in both matches, as he got a calf injury during training. On 29 August 2023, Walsh received another call-up to the national team for the friendly match against Turkmenistan. He went on to make his debut against said team in a 2–0 win. On 24 January 2024, Walsh scored his debut goal in injury-time for the national team in a 1–3 loss against Japan in the final match of the 2023 AFC Asian Cup group stage. On 5 September 2024, in the first match of the third round of 2026 FIFA World Cup qualification, Walsh scored a goal against Saudi Arabia through a deflection from his teammate Ragnar Oratmangoen in a 1–1 draw. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Genk 2011–12 Belgian Pro League 0 0 0 0 0 0 0 0 0 0 2012–13 1 0 1 0 0 0 0 0 2 0 2013–14 4 0 1 0 1 0 0 0 6 0 2014–15 11 0 0 0 0 0 0 0 11 0 2015–16 23 1 5 0 0 0 0 0 28 1 2016–17 12 0 2 0 9 0 5 1 28 1 Total 51 1 9 0 10 0 5 1 75 2 Zulte Waregem 2017–18 Belgian Pro League 18 1 2 0 4 0 10 0 34 1 2018–19 21 1 2 0 0 0 10 1 33 2 2019–20 9 0 4 0 0 0 0 0 13 0 Total 48 2 8 0 4 0 20 1 80 3 Mechelen 2020–21 Belgian Pro League 30 3 1 0 – – 0 0 31 3 2021–22 33 3 1 0 – – 0 0 34 3 2022–23 25 2 5 1 – – 0 0 30 3 2023–24 31 0 0 0 – – 0 0 31 0 2024–25 6 0 1 0 – – 0 0 7 0 Total 125 8 8 1 0 0 0 0 133 9 Yokohama F. Marinos 2025 J1 League 8 0 0 0 3 0 0 0 11 0 Career total 233 11 24 1 17 0 25 2 301 14 ===International=== Appearances and goals by national team and year National team Year Apps Goals Indonesia 2023 4 0 2024 14 2 2025 2 0 Total 20 2 :Scores and results list Indonesia's goal tally first, score column indicates score after each Walsh goal. List of international goals scored by Sandy Walsh No. Date Venue Cap Opponent Score Result Competition 1 24 January 2024 Al Thumama Stadium, Doha, Qatar 8 1–3 1–3 2023 AFC Asian Cup 2 5 September 2024 King Abdullah Sports City, Jeddah, Saudi Arabia 14 1–0 1–1 2026 FIFA World Cup qualification == References == ==Other websites== Profile at the K.V. Mechelen website *Profile at the Royal Dutch Football Association (archived) *Profile at the Football Association of Indonesia Category:1995 births Category:Living people Category:Indo people Category:Naturalised citizens of Indonesia Category:Indonesian people of Dutch descent Category:Indonesian people of Belgian descent Category:Indonesian people of Irish descent Category:Dutch people of Irish descent Category:Dutch people of Indonesian descent Category:Sportspeople of Indonesian descent Category:Belgian people of Irish descent Category:Dutch people of Javanese descent Category:Belgian people of Indonesian descent Category:Indonesian men's footballers Category:Dutch men's footballers Category:Belgian men's footballers Category:Footballers from Brussels Category:Indonesia men's international footballers Category:Netherlands men's youth international footballers Category:Men's association football defenders Category:2023 AFC Asian Cup players Category:Belgian Pro League players Category:J1 League players Category:K.R.C. Genk players Category:S.V. Zulte Waregem players Category:K.V. Mechelen players Category:Yokohama F. Marinos players Category:Naturalised association football players Category:Indonesian expatriate men's footballers Category:Indonesian expatriate sportspeople in Belgium Category:Indonesian expatriate sportspeople in Japan Category:21st- century Indonesian sportsmen Category:21st-century Dutch sportsmen Category:21st-century Belgian sportsmen",
 "title": "Sandy Walsh"
}