{
 "id": "1191614",
 "text": "The Slavery Abolition Act of 1833 (3 &amp; 4 Will. 4. c. 73) was a law made by the United Kingdom's Parliament to end slavery in the British Empire. It was passed under Prime Minister Charles Grey’s government. The law said the British government would pay to free all enslaved people and made slavery illegal across the Empire. Although the law was removed from the law books in 1998 as part of a cleanup of old laws, slavery is still banned. == Background == In May 1772, a judge named Lord Mansfield made a decision in the Somerset case that set a slave free. The slave had been brought to England from Boston, Province of Massachusetts Bay in what is now the United States. This decision helped start the fight to end slavery across the British Empire. The court said slavery was not legal in England because there were no laws supporting it. Many people, like Granville Sharp, believed this meant slavery had no legal support in England or Scotland and that no one could claim ownership of a person there..(1827) 2 Hag Adm 94 .Simon Schama, Rough Crossings (London: BBC Books, 2005), p. 61. In 1778, Ignatius Sancho, the first known Black person to vote in a British election, praised Britain's freedom but also spoke out against the bad treatment of Black people in places like the West Indies. === Campaigns === By 1783, an anti-slavery movement in Britain had started a movement to end the slave trade across the British Empire. In 1787, a group called the Society for Effecting the Abolition of the Slave Trade was formed. A famous anti-slavery image was made by Josiah Wedgwood — a medallion showing a Black man in chains with the words “Am I Not a Man and a Brother?” The BBC called it the most well-known picture of a Black person from the 1700s. Another abolitionist, Thomas Clarkson, said many women wore the medallion as bracelets or hairpins. He said it was one time when fashion helped support justice, kindness, and freedom. The phrase \"the honourable office of promoting the cause of justice, humanity and freedom\" means doing important and noble work to support fairness, kindness, and liberty. An incident involving a slave woman named Chloe Cooley, who was brought to Canada by an American loyalist, led John Graves Simcoe, the Lieutenant-Governor of Upper Canada, to introduce the Act Against Slavery in 1793. This law, passed by the local government, was the first in the British Empire to stop the slave trade. By the late 1700s, Britain was both the biggest trader of slaves and the center of the biggest movement to end slavery. In 1787, William Wilberforce wrote in his diary that his main goal in life was to end the slave trade, and he spent 20 years fighting against it.William Wilberforce: A Man for All Seasons . CBN == The act == The law passed its second reading in the House of Commons without any objections on 22 July 1833, just one week before William Wilberforce died. It was officially approved by the king on 28 August and took effect on 1 August 1834. In reality, only children under six years old were fully freed at that time. Older slaves were called \"apprentices\" and were to be freed in stages: the first group became free on 1 August 1838, and the last group was set to be free by 1 August 1840. The law did not apply to areas controlled by the East India Company, the island of Ceylon (now Sri Lanka), or the island of Saint Helena. These areas were later included under the Indian Slavery Act of 1843. == In popular culture == Ava DuVernay was asked by the Smithsonian's National Museum of African American History and Culture to make a film that premiered at the museum’s opening on 24 September 2016. The film, 28 August: A Day in the Life of a People, shows six important events in African-American history that all happened on 28 August. One of the events shown is King William IV giving approval to the Slavery Abolition Act. Amazing Grace is a movie from 2006, directed by Michael Apted. It tells the story of William Wilberforce and his fight to end the slave trade in the British Empire. The title comes from the famous hymn “Amazing Grace,” written after John Newton, a former slave ship worker, had a religious change of heart. In the film, Newton is shown as a big influence on Wilberforce and the anti-slavery movement. The Slavery Abolition Act is also mentioned in the 2010 novel The Long Song by Andrea Levy and in the 2018 BBC TV version. Both tell the story of a female slave in Jamaica during the time when slavery was ending in the British West Indies. == See also == * 1926 Slavery Convention, * Act Against Slavery * Blockade of Africa * Brussels Conference Act of 1890 * Centre for the Study of the Legacies of British Slavery * Compensated emancipation * Indian Slavery Act, 1843 * Slave Trade Acts * Slavery in Britain * Thirteenth Amendment to the United States Constitution * Timeline of abolition of slavery and serfdom == Notes == == References ==",
 "title": "Slavery Abolition Act 1833"
}