{
 "id": "1191568",
 "text": "Meitei headgears, or headwears, or headdresses, are traditional headdresses originating from the Meitei community of Manipur, India. These headpieces are used in a variety of cultural, religious, and ceremonial contexts, including festivals, dance performances, weddings, and official functions. Each type of headgear is characterized by distinct structural and symbolic features, often associated with specific roles, gender, or occasions. Notable examples include the Kokyet, Kajenglei, and Samjin, each of which holds particular significance within the cultural and religious framework of Meitei society, including its indigenous belief system, Sanamahism. == Kajenglei == Kajenglei (), also known as Leitreng (), is a traditional headdress worn by Meitei women. It is typically used during marriage ceremonies by brides and in classical dance performances by artists. The headdress is composed of approximately eighty to one hundred brass strips, which are affixed to red flannel bands measuring about one centimeter in width and arranged around a circular metal ring.Thilakavathy, M.; Maya, R. K. (2019-06-05). FACETS OF CONTEMPORARY HISTORY. MJP Publisher.Doshi, Saryu (1989). Dances of Manipur: The Classical Tradition. Marg Publications. ISBN 978-81-85026-09-1. == Kokyet == Kokyet (), also rendered as Koyet, Koyyet, or Koiyet, is a traditional male headdress in Meitei culture. It is produced in twelve distinct designs and is worn during various cultural ceremonies, festivals, and formal occasions. The Kokyet is used by individuals across social strata, including both commoners and members of the royal family. Its design is derived from the two horns of the ancient Meitei deity Pakhangba. The Kokyet also functions as a symbolic representation of Sidaba, a central deity in the traditional Meitei religion, Sanamahism. == Samjin == Samjin () is a traditional male headgear associated with Meitei cultural attire, notably worn by performers of the Khamba Thoibi Jagoi dance. It is attributed to the reign of King Meidingu Khuyoi Tompok. The headgear features intricate needlework with tassel-ended designs hanging from the front and back. Its stylistic elements are traditionally believed to be derived from the horn and head structure of the Meitei deity, Pakhangba. == National level recognition == Since 2023, the Kokyet has been incorporated into the official uniform of marshals serving in the Indian Parliament, encompassing both the Lok Sabha and the Rajya Sabha. The adoption of the headdress was authorized by the Union Government of India. == Usage by notable people == In 2017, during a visit to election-bound Manipur, Prime Minister Narendra Modi wore a traditional Meitei attire, including a headgear featuring a peacock plume and a cloak. In 2022, Manipur Chief Minister N. Biren Singh presented Prime Minister Narendra Modi with a traditional Meitei headgear, white in color with saffron embroidery, and a matching block-printed shawl. The headgear included a golden brooch, and the shawl contrasted with the Prime Minister’s tan- colored attire.Sanajaoba, Naorem (1988). Manipur, Past and Present: The Heritage and Ordeals of a Civilization. Mittal Publications. ISBN 978-81-7099-853-2. == Related pages == * Meitei clothing in Bangladesh * Meitei clothing in Myanmar * Manipur and Bollywood == References == Category:Meitei culture Category:Clothing Category:Headgear",
 "title": "Meitei headgears"
}