{
 "id": "1191057",
 "text": "The French West Indies (also called the French Antilles) are the parts of France that are in the Caribbean islands. * Two overseas departments: ** Guadeloupe – this includes the islands of Basse-Terre, Grande-Terre, Les Saintes, Marie-Galante, and La Désirade ** Martinique * Two overseas collectivities: ** Saint Martin – this is the northern part of the island of Saint Martin. The southern part is called Sint Maarten and is part of the Kingdom of the Netherlands. ** Saint Barthélemy == History == In 1635, a French trader named Pierre Belain d'Esnambuc started the first French colony in the Caribbean. He made the colony in Saint-Pierre on the island of Martinique.Trager, James (2005). The People's Chronology 1635 (3rd. ed.). Gale ebooks. D'Esnambuc first came to the Caribbean in 1625. He wanted to build a French colony on Saint Kitts (then called Saint-Christophe in French). In 1626, he went back to France and got help from Cardinal Richelieu. Richelieu helped create the Compagnie de Saint-Christophe, a company to start French colonies. D'Esnambuc was the leader of this company. Later, the company changed its name to Compagnie des Îles de l'Amérique. In 1635, d'Esnambuc went to Martinique again with 100 French settlers. They started to grow sugarcane. After 6 months, d'Esnambuc went back to Saint Kitts. He died there in 1636. His nephew, Jacques Dyel du Parquet, became the leader of the French colonies in the Caribbean in 1637. He stayed in Martinique and became its governor. The French made permanent settlements on Martinique and Guadeloupe after the British forced them to leave Saint Kitts and Nevis (called Saint-Christophe in French). They built a port called Fort Royal (now called Fort-de-France) in Martinique. This port was important for French warships. The ships left from here to explore the Caribbean. In 1638, a man named Jacques Dyel du Parquet (1606–1658), who was the nephew of Pierre Belain d'Esnambuc, became the first governor of Martinique. He built Fort Saint Louis to protect the city from attacks. From Fort Royal, du Parquet sailed south to find new places. He made the first French settlement in Saint Lucia in 1643. In 1649, he led a group that started a settlement in Grenada. Even though Grenada was later ruled by the British, it still has many things from French culture. The local language, Grenadian Creole, has French words. Some food, houses, and place names like Petit Martinique and Martinique Channel are French. In 1642, the Compagnie des Îles de l'Amérique (a French trading company) got permission to keep working for 20 more years. The King of France chose the Governor General, and the company chose the governors of the islands. But by the late 1640s, the company was not doing well. In 1651, the company closed. It sold the rights to use the islands to different people. The du Parquet family bought Martinique, Grenada, and Saint Lucia. A man named d’Houël bought Guadeloupe, Marie-Galante, La Désirade, and Les Saintes. The Knights of Malta bought Saint Barthélemy and Saint Martin. These two islands became part of Guadeloupe. In 1665, the Knights sold their islands to a new company called the Compagnie des Indes occidentales. Dominica is a small island in the eastern Caribbean. It is between Guadeloupe in the north and Martinique in the south. Christopher Columbus named the island Dominica after the day he saw it — a Sunday (domingo in Spanish), on 3 November 1493. For many years, Dominica stayed isolated. It was home to the Kalinago people (also called Island Caribs). More Kalinago moved to Dominica after losing land on other islands. In 1690, French woodcutters came from Martinique and Guadeloupe. They cut wood for the other islands and later started to live there. France started a colony and brought enslaved people from West Africa, Martinique, and Guadeloupe to work on farms. During this time, people began to speak Antillean Creole. In 1763, France gave Dominica to Great Britain. Britain made a small colony in 1805. Today, the people of Dominica speak English as the official language. They also speak Antillean Creole as a second language. Creole is still spoken because Dominica is close to French-speaking islands. In Trinidad, the Spanish rulers did not do much to develop the island. A Frenchman named Roume de St. Laurent, who lived in Grenada, asked the Spanish king Charles III of Spain for permission to bring settlers to Trinidad. On 4 November 1783, the king gave him a paper called the Cédula de Población. This document allowed French planters, free people of color, and mulattos to move from islands like Martinique, Grenada, Guadeloupe, and Dominica to Trinidad. The Spanish gave them free land and no taxes for ten years. Many people came because of the French Revolution. These new settlers built towns like Blanchisseuse, Champs Fleurs, Paramin, Cascade, Carenage, and Laventille. These people helped to shape the culture of Trinidad and Tobago. The languages spoken were Spanish, French, and Patois (a type of Creole). The population grew from 1,400 in 1777 to more than 15,000 by the end of 1789. In 1797, Trinidad became a British colony, but many people there spoke French. Islands of the French West Indies Name Largest settlement Area (km2) Martinique Fort-de-France 1,128 Guadeloupe proper (Basse-Terre & Grande- Terre) Pointe-à-Pitre 1,436 Saint Martin Marigot 53 Marie-Galante Grand-Bourg 158 Saint Barthélemy Gustavia 25 Les Saintes Terre-de-Haut 13 La Désirade Beauséjour 21 French West Indies 2,834 == References ==",
 "title": "French West Indies"
}