{
 "id": "1191674",
 "text": "Agreement Regarding Compensation for the Kubo (Kabaw) Valley (1834), also known as the Kabaw Valley Compensation Agreement, was a historical international agreement, signed on January 25, 1834, at Langthabal, Manipur, between British India, represented by Major F.J. Grant and Captain R. Boileau Pemberton, and Rajah of Manipur. This agreement formed part of the British administration's effort to maintain political relations with the Rajah of Manipur while formalizing territorial arrangements with the Burmese Kingdom. It was signed after the Agreement regarding the Kubo (Kabaw) Valley, 1834, also known as the Kabaw Valley Agreement, was inscribed.Documents on North- East India: An Exhaustive Survey. India: Mittal Publications, 2021. p. 11Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 18Suresh Singh, Th. The Endless Kabaw Valley: British Created Vicious Cycle of Manipur, Burma and India. India: Quills Ink Publishing, 2014. p. 272, 273 == Overview == The Agreement Regarding Compensation for the Kubo (Kabaw) Valley, dated 25 January 1834, was a financial arrangement established by the British colonial administration to compensate the Rajah of Manipur for the cession of the Kubo Valley to the Kingdom of Ava (Burma). It followed the formal transfer of territory as per the territorial agreement signed on January 9, 1834. == Terms of Compensation == 1\\. Monthly Stipend: The British Government agreed to provide a monthly allowance of 500 Sicca Rupees to the Rajah of Manipur. The payment was to begin from 9 January 1834, the date on which the Kubo Valley was officially transferred to Burmese control. 2\\. Termination Clause: The agreement stipulated that if the Kubo Valley were to be returned to Manipur at any future date, the compensation payments would cease from the moment the territory reverted. == Signatories == * Major F.J. Grant, Commissioner, British India * Captain R. Boileau Pemberton, Commissioner, British India == Reclamation == In March 2025, Rajya Sabha Member of Parliament Leishemba Sanajaoba referenced historical treaties in a parliamentary statement concerning the Kabaw Valley. According to the 1834 Kabaw Valley Agreement, Burma (now Myanmar) was required to pay a monthly compensation of Sicca 500 to Maharaj Gambhir Singh, then ruler of Manipur. These payments reportedly continued after Manipur's integration into the Indian Union in 1949. However, in 1953, following a meeting between Indian Prime Minister Jawaharlal Nehru and Burmese Prime Minister U Nu on March 3, the compensation payments were discontinued. On 10 March 2025, Sanajaoba urged the Government of India either to pursue the reclamation of the Kabaw Valley or to ensure the resumption of compensation payments, citing the terms of the Treaty of Yandaboo (1826) and the Kabaw Valley Agreement (1834). On 19 March 2020, in front of S Jaishankar, the Minister of External Affairs, inside the Indian Parliament, Rajkumar Ranjan Singh, a Member of Parliament, representing the Inner Manipur constituency in the Lok Sabha, raised the issue of historical tribute payments associated with the Kabaw Valley, a region formerly under the territorial domain of the Kingdom of Manipur and presently located within Myanmar. == Related pages == * Meitei–Shan relations * Manipur Levy * Chahi Taret Khuntakpa (Seven Years' Devastation) * Burmese–Meitei relations * Anglo- Manipur War * Anglo Manipuri Treaty (1762) * Anglo Manipuri Treaty (1833) * Ahom–Meitei relations == References == Category:History of Manipur Category:History of Myanmar Category:British India",
 "title": "Agreement Regarding Compensation for the Kubo (Kabaw) Valley (1834)"
}