{
 "id": "1191090",
 "text": "Meitei royal etiquette is the traditional system of conduct and ceremonial protocol observed in the royal court of the Meitei people (also known as Manipuris) of Kangleipak (Manipur Kingdom). It encompasses prescribed forms of speech, dress, posture, and behavior appropriate to interactions within the court. The etiquette reflects a hierarchical social structure and plays a role in maintaining order, respect, and continuity of Meitei cultural practices. It has been transmitted through generations as part of the broader framework of Meitei court traditions, notably documented in the Loiyumpa Silyel.Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 7–11 == State Duty of the Crown (Meitei Royal Protocol) == In Meitei royal tradition, the duties and conduct of the sovereign are characterized by restraint and formality. Public audiences granted by the crown are infrequent, and official addresses are delivered rarely, typically no more than once or twice per month. These addresses are issued only after deliberate consideration. The reception of a royal address is marked by ceremonial protocol. A body of high state dignitaries, traditionally numbering sixty-four, stands in ovation with folded hands to receive the pronouncement. If the address is deemed appropriate and just, it is publicly acclaimed. Conversely, if the address is considered prejudicial or inappropriate, the dignitaries may issue a formal and modest beseechment—a rare and symbolic act of disapproval. Access to the sovereign by high-ranking officials is limited and generally occurs only upon the monarch's summons. On occasions when the sovereign intends to participate in cultural or recreational activities, such as Kangjei (a traditional form of hockey), or other official movements, the protocol for communication follows a structured route. The first queen (Ningthemnupi), situated within the palace, conveys the information to the Lakton, a chamber adjacent to the royal quarters. From there, the Pheida Shanggaiselba—a eunuch and palace official with direct access to the royal household, also functioning in a judicial or executive capacity—receives the communication. Subsequently, the Yairekshang issues orders to the Shangpalba, the officers responsible for individual departments, instructing them to ensure their duties are performed without failure. == Regal Life (Meitei Court Conduct) == In Meitei royal protocol, specific codes of conduct govern the daily life and domestic arrangements of the sovereign and the royal household. These rules delineate the proper behavior to be maintained when the king, the queen, and the royal offspring are together. According to custom, the king resides with the queen during the night. During the daytime, the king may spend time with his other consorts. Any deviation from these established practices is subject to formal scrutiny. Matters concerning breaches of this domestic protocol are adjudicated by a council comprising nine designated officials: the Lakhong-hanjabi, Hirushanghanjabi, Leikhomshanghanjabi, Yendrel-hanbi, Keikralhanbi, Phirunghanbi, Phourunghanbi, Ngarunghanbi, and Thumjaorungbee. These individuals collectively assess the case and impose fines if any violations are found. The king, like all members of the royal household, is subject to these regulations. The observance of this regal conduct is considered mandatory and inviolable within the structure of Meitei royal governance. == Royal Decorum for the Nobility (Meitei Court Protocol) == In the context of Meitei royal etiquette, specific guidelines govern the conduct and positioning of nobility and their attendants during formal occasions. These regulations pertain particularly to the ceremonial halting points for horses (sagol) and palanquins (dollai) during royal processions or gatherings involving the Phamthou Ningthou (a noble or royal dignitary, also referred to as Angam Athou). According to the established ordinance: * The Dolaitongba (palanquin bearers) and Sagoltongba (horse attendants) are required to stop at the main gate of the royal compound. * The four Hajaris are to halt at Keithel Lanmithong. * The Haopanba Puren must stop at designated locations, including Chingmeirong, Chinga, Langjing, and Khomidok, specifically at the bank of the Iril River. * The Chothe Khullakpa halts at Moirangkhom. * The Moirangningthou halts at Yaiskul Thong. These halting points are fixed and carry ceremonial significance. Transgressing or violating the designated areas is considered a breach of royal decorum and is not permitted under the established court protocol. == Rules Regarding Costumes (Meitei Royal Attire Protocol) == In Meitei court tradition, strict guidelines govern the attire of royalty and high-ranking individuals, reflecting hierarchical distinctions and ceremonial roles. These regulations include specifications for color, fabric, accessories, and how items are to be carried or presented within the royal premises. For the Angoupalba (also referred to as the Angom Ningthou), the prescribed attire and accessories are as follows: * Footwear: Green shoes are designated. * Mattress: Red Phirangji cloth is used. * Garments: A loincloth featuring a blue outer lining, a white shirt, and a white Innaphi (a traditional upper-body cloth worn from the shoulder to the waist) are worn. The Shamjil, a garment associated with tiger hunting and boat racing (Hiyang Tannaba), is white and embroidered in white. * Accessories: The Chongpe (possibly a headgear or emblem of the Tengna clan) is white. Upon entering the palace, the Angoupalba’s personal guard carries his seat on the head and transports his Kwasen (betel nut container) and Khudong (smoking apparatus). At the Laakhong (the first chamber of the royal guard), the seat is carried in the arms, and the Kwasen and Hidakphu are stored in the Laaton. These items—shoes, seat, and Kwasen—are carried up to the royal courtyard. For the Meidingu Apanba (sovereign or ruling monarch), the ceremonial costume includes: * A white Shamjil and white Khadangchet, both embroidered in white with Phirangji motifs and accented with two Sanakhongol threads. * Footwear adorned with Sanakongpol decorations. * A Konkha, a velvet half-shirt. * A dhoti embroidered along the outer edge. * A folded Innaphi draped over the shoulder or wrapped around the waist. * The ceremonial nine- layered Shekpin (parasol) is white. * The Chong and Pe (possibly elements of the royal seat or regalia) are red. * The seat is made of coarse white cloth. A critical directive under this etiquette states that princes, princesses, and state dignitaries must not replicate or mirror the sovereign in attire, mannerisms, or personal behaviors—including movement, speech, or emotional expression—underscoring the distinct and sacrosanct status of the monarch. == Rules for Rewards (Meitei Royal Honor System) == In the Meitei royal system, a structured protocol governs the granting of rewards for valor and achievement, particularly in the context of military success and acts of bravery. === Military Rewards === When an individual—whether a subject, a village, or a gallant warrior—achieves a decisive victory in a significant battle witnessed by the sovereign (Meidingu Apanba), the following honors may be conferred: * First Victory: The recipient is awarded the Ningthouphimayek, a special regal costume signifying royal recognition. * Fifth Victory: A princess may be given in marriage, accompanied by a ceremonial flag titled Phiral Namma Thakta Namma Thoiba. * Seventh Victory: The individual is awarded the Thangballoi, a special distinction. * Ninth Victory: The reward conferred is termed Meipumi, a high-status honor. * Exceptional Honors: Further recognition may include Lupa Leikham and Sana Leikham, considered among the highest honors. These are awarded only under extraordinary circumstances and are typically withheld unless merited by exceptional feats. === Tiger-Hunting Trophy Protocol === In the event of a tiger hunt involving ten participants, only three are selected to receive formal recognition: 1\\. First Recipient: Awarded one pari (unit of land) of paddy field and Thum Nama (equivalent to one hundred plates of common salt). 2\\. Second Recipient: Granted Phimakhai phi (ceremonial cloth) and Thum Nama. 3\\. Third Recipient: Receives a shared portion of Thum Nama and clothing. These reward protocols illustrate the hierarchical and merit-based nature of honors within the Meitei court, emphasizing valor, contribution, and royal discretion. == Administration of Justice (Meitei Governance Principles) == A formal edict attributed to Lairel Meidingu Naophangba outlines foundational principles for the administration of justice within the Poyrei Kanglei Meitei Sanaleibak. The king, having received authority from the principal figures of Mangang Luwang Khuman, is tasked with ensuring just governance and public welfare. According to the edict: * The queen (Meitei Leima) of Kanglei is expected not to express complaints of fatigue, symbolizing steadfastness and resilience within the royal household. * In undertaking welfare measures for the state, the monarch must avoid imposing excessive financial burdens or stringency on the kingdom's resources. * The king must maintain clarity and consistency in state affairs, refraining from issuing contradictory or opposing proclamations simultaneously. * Issuing conflicting statements by the sovereign is considered detrimental, as it creates confusion and poses a threat to national stability. * The edict emphasizes that irreconcilable or conflicting pronouncements by the ruler are unwarranted and must be avoided to preserve harmony and order within the state. This directive reflects the Meitei emphasis on coherent leadership and equitable justice as essential components of governance. == Conscience Keeper of the Nation == In the traditional governance system of Meitei society, the role of moral and ethical oversight was vested in religious leaders, scholars, and high-ranking dignitaries. These individuals functioned as the conscience keepers of the nation, tasked with the responsibility of alerting the monarch to omens and moral portents—both positive and negative—that they perceived through spiritual or learned insight. This advisory role was deemed essential to the stability and longevity of the ruling sovereign and their consort, with the belief that failure in such counsel could result in the untimely demise of the royal figures. The legal framework associated with this system prescribed strict punishments for various crimes, reflecting a code that emphasized deterrence and moral rectitude: * Theft of livestock or servants: Amputation of the offender’s leg was mandated. * Burglary (Sagun Touba): Defined as theft by means of creating an opening in a dwelling, this offense warranted the severing of the perpetrator’s hand. * Perjury or habitual lying: Punishable by slashing the offender’s lips. * Violation of royal domestic sanctity (e.g., the harem): The punishment included the removal of the offender's eyes. * Incestuous conduct or sexual misconduct with close relatives: Addressed through Nonglaoba, a form of public shaming in which the incident was proclaimed aloud for communal awareness. * Disrespect or offenses against the monarch: Such acts resulted in exile. * Involvement in regicide or dethronement conspiracies (Ningthoushemba): This was considered a capital offense and met with execution. Additionally, the social and marital customs were governed by strict clan-based rules. Marriages between individuals of the same yek (clan) or of common ancestry were strictly prohibited, emphasizing the maintenance of social and genealogical boundaries within the community. These practices collectively underscore a socio-political system where moral vigilance, social order, and royal sanctity were upheld through a combination of spiritual advisement and rigid legal codes. == Related pages == * Meitei intangible cultural heritage * Ningthouja dynasty * Ahom–Meitei relations ** Kuranganayani * Burmese–Meitei relations ** Chakpa Makhao Ngambi ** Meitei–Shan relations * Meitei queens of Tripura * Takhel Ngamba * Induprabha * Meitei confederacy * Meitei martial arts * Meitei traditional weapons * Meitei traditional games * Meitei traditional toys == References == Category:Meitei people Category:Meitei clothing Category:Meitei culture Category:Royalty",
 "title": "Meitei royal etiquette"
}