{
 "id": "1191275",
 "text": "Talakhidamani (or Talakhideamani)The pronunciation is reconstructed as /talahidamani/ by Rilly. was the king of Kush in the mid or late 3rd century AD, perhaps into the 4th century. He is known from two Meroitic inscriptions, one of which commemorates a diplomatic mission he sent to the Roman Empire.Claude Rilly (2017), \"New Light on the Royal Lineage in the Last Decades of the Meroitic Kingdom: The Inscription of the Temple of Amun at Meroe Found in 2012 by the Sudanese–Canadian Mission\", Sudan and Nubia 21: 144–147 (appendix to \"The Amun Temple at Meroe Revisited\" by Krzysztof Grzymski).Josefine Kuckertz (2021), \"Meroe and Egypt\", in Wolfram Grajetzki, Solange Ashby and Willeke Wendrich (eds.), UCLA Encyclopedia of Egyptology, Los Angeles. Talakhidamani's reign is tentatively placed between those of Tamelerdeamani and Aryesebokhe. His dates are uncertain, but a different king was ruling in 253. He is associated with a diplomatic mission usually dated to around 260, but his inscriptions have been put closer to c. 300 on palaeographic grounds. The name Talakhidamani consists of three elements: the stem tlh, the verbal suffix id and the name of the god Amun, amani. The last part is a universal element in the regnal names of later Kushite rulers. The first part may correspond to Greek Nike and signify victory. On this interpretation, the name means \"he is victorious, Amun\" and is equivalent to that of the 5th-century BC Kushite ruler Talakhamani. Talakhidamani is named in an inscription (no. REM 0101) placed in the so-called \"Meroitic chamber\" of the temple of Isis at Philae, where his name is spelled Tlhidmni. The name is preceded by the title qore (king) and that of another person, Maloqorebar, whose name probably means \"beautiful is the boy of the kings\". The two are placed under the protection of the goddess Patarus (an epithet of Isis) and the child god Horus. It has been tentatively suggested that Talakhidamani was ruling on behalf of a child, Maloqorebar, who had not yet received a regnal name. The Philae inscription is part of a larger representation in relief of a diplomatic mission meant to maintain contact with the Roman authorities in Egypt. Several members of the prominent Wayekiye family took part. The inscription itself is a letter from one of the diplomats describing the presents brought for the gods on behalf of the royalty who sent the mission, which apparently visited the Abaton as well as Philae. It is unknown if they went into Roman territory or to Rome itself. Talakhidamani also had an inscription placed on a stone in the temple of Amun outside the walls of Meroë, where his name is spelled Tlhidemn[i]. Both inscriptions appear to have been written by scribes from the same circle, which suggests that the Philae inscription was written by a scribe sent from Meroë, the Kushite capital. Prior to the discovery of the Meroë inscription, the name in the Philae inscription was often read as Lakhidamani (Lhidmni) and treated as feminine, that is, the name of a kandake. The absence of Maloqorebar's name on this inscription may suggest that he died before it was carved. The inscription asks the god for five gifts, but these cannot be translated. Three graffiti in Meroitic cursive at the Great Enclosure of Musawwarat, originally thought to refer Talakhamani, may actually refer to Talakhidamani, but this is speculative. ==References== Category:Kings of Kush Category:3rd-century monarchs in Africa",
 "title": "Talakhidamani (Sudanese king)"
}