{
 "id": "1191449",
 "text": "Armenia is a country located in the Caucasus, The UN classification of world regions places Armenia in Western Asia; the CIA World Factbook , , and Oxford Reference Online also place Armenia in Asia. whose people are descendants of Armenian genocide survivors. * * * * * * Bat Ye’or, Islam and Dhimmitude: Where Civilizations Collide (Madison: Fairleigh Dickinson University Press, 2002), p. 169. * * * * Despite their traumatic history, Armenian society is not free of racism, including antisemitism. * * * * ==Recent trend== In 2014, 58% of the Armenian population are found to hold negative views about Jews, including 62% of those aged 18–34. The percentages are the highest in Eastern Europe, making Armenia statistically the most antisemitic Eastern European country. Garegin Nzhdeh (1886–1955), an Armenian nationalist who recruited thousands of Armenians to fight for Nazi Germany, is still popular among Armenians. * * * * * * * * * ==20th century== From the 1930s through the Holocaust, Armenian-American media, especially the Hairenik, fully backed Adolf Hitler and defended the Holocaust as a \"necessary surgical operation\" by demonizing Jews as \"poisonous elements\", while 20,000 Armenian Nazi volunteers hunted for Jews and other \"undesirables\" on behalf of the Nazi German Army. ==21st century== Despite such history, hundreds of statues have been erected across Armenia in honor of Garegin Nzhdeh. Meanwhile, the only synagogue in Armenia's capital Yerevan was attacked four times in a row between 7 October 2023 and 11 June 2024. Members of the Marxist-Leninist militant front Armenian Secret Army for the Liberation of Armenia (ASALA) claimed responsibility for the attacks, some of which involved the synagogue being set on fire. * * * * * ==Related pages== * German Jews * Antisemitism in France * History of Jews in Romania ==Footnotes== ==References== Category:Antisemitism Category:20th century Category:21st century",
 "title": "Antisemitism in Armenia"
}