{
 "id": "1191950",
 "text": "Kwatha () is a village in Tengnoupal district of Manipur, India. Kwatha is notable for being the only Meitei-majority settlement in the hill regions of Manipur, as Meitei people are predominantly found in the Imphal valley. It is situated approximately 16 to 18 kilometers from Moreh, a town on the Indo- Myanmar border. == Etymology == The name “Kwatha” () is derived from the Meitei language word Kwa (), meaning “betel nut.” The early settlers are believed to have engaged in betel nut cultivation, which influenced the naming of the village. == Historical background == The village is believed to date back to the reign of King Senbi Kiyamba (, 1467–1508), during which it functioned as a strategic meeting point between the Meitei kingdom and the rulers of Burma (present-day Myanmar). According to tradition, a symbolic exchange of a flowering plant between the two kings is said to have led to the initial settlement of Meitei people in the area, forming the basis of the current village population. == Demographics and Governance == As of March 2025, Kwatha comprises 87 households with a population of approximately 437 residents. The village maintains a traditional governance system in which a village head (often referred to as a king) plays a central role in community decisions. As of 2023, the village has a population of 370 residents. As of December 2019, the village currently has 75 clans, with a population of 382 people and 160 eligible voters. == Socio-Political Context == Since May 2023, Manipur has experienced ethnic tensions. However, Kwatha has remained largely unaffected by direct conflict. Surrounded by Kuki and Naga villages, Kwatha has retained relative stability. The presence of the Assam Rifles and other security forces has contributed to the village's security. Residents also cite cooperative relations with neighboring communities as a stabilizing factor. Movement and trade have become restricted compared to previous years, which has impacted daily life. Nonetheless, the village continues to function without major disruption. Educational opportunities remain limited within the village, prompting children to travel outside the area for schooling. === Education === Kwatha village has one high school, which was upgraded from a junior high school in 2017. The school is staffed by five teachers, two of whom are residents of the village, and currently serves a total of 30 students. === Health === Healthcare infrastructure in the village is limited to a single Primary Health Sub-Centre (PHSC), which is staffed by two nurses. The facility does not include a pharmacy. In cases of medical emergencies, patients are typically transported to Moreh, Kakching, or Imphal for further treatment. == Economy and Livelihood == The local economy is primarily agrarian. The village is known for its bamboo shoot production, which is a commonly consumed food item in the region. Kwatha village has a population primarily composed of individuals from economically underprivileged backgrounds. The main sources of livelihood are agriculture, farming, and food processing, with a significant focus on the production of fermented bamboo shoots. The bamboo shoot used in this process, locally referred to as Usoi—characterized by its thick and triangular shape—is either collected from surrounding forests or procured from neighboring Myanmar. The growth of new shoots occurs around June and July, with harvesting typically taking place from August to September. Villagers are employed in cutting the bamboo shoots, for which they receive approximately ₹200 per individual. About 20 households, identified as relatively financially stable within the village, are engaged in the fermentation and processing of the bamboo shoots. The fermented product is generally made available for sale between December and January. Buyers from Kakching district regularly procure the product from Kwatha, and villagers also sell directly in Kakching. The current market rate for fermented bamboo shoots is approximately ₹50 per kilogram, an increase from the earlier rate of ₹10–15 per kilogram. The village has a limited number of government employees—approximately seven—with the majority of residents engaged in subsistence agriculture, food processing, or wage labor related to bamboo shoot fermentation. == Accessibility and Geography == Kwatha is accessible via mountainous terrain, with roads that pass through forested areas and streams. The village infrastructure remains basic, and modern development is limited. Housing primarily consists of traditional wooden structures, and the community largely relies on subsistence practices. == Cultural significance == Kwatha’s status as the only Meitei village in the hills gives it a distinctive place in the socio-cultural landscape of Manipur. The village reflects a blend of historical continuity and adaptation within a diverse and often tense regional context. == Festivals == The Kwatha Schedule Caste Welfare Youth Club organizes the annual Kwatha Festival and the celebration of the Soibum Festival. The District Administration of Tengnoupal organized the 2024 Ningol Chakkouba event for the women of Kwatha and Kwatha Khunou. The program was held at the Kwatha Community Hall. == Public Interest Litigation == The Manipur High Court is currently hearing a Public Interest Litigation (PIL) related to a humanitarian situation in Kwatha village, Tengnoupal district. The situation has arisen due to ongoing state-wide violence over a period of seven months. As Kwatha is the last Meitei-majority village in the district, located near the Myanmar border, its villagers have been affected by communal tensions. While some Meitei individuals have relocated from the area, others remain in Kwatha, which is geographically isolated from the rest of the state. The PIL was filed by Kongjengbam Chingkham of Singjamei, Imphal. It reports that due to conflicts between the Meitei and Kuki communities, which began on May 3, 2023, villagers have been unable to sell their products or leave the village. The Court scheduled a hearing of the case for January 24, 2024. == Related pages == * Meitei people in Myanmar * Konthong Lairembi == References == Category:Meitei people Category:Manipur",
 "title": "Kwatha"
}