{
 "id": "1191802",
 "text": "The National Coalition of Blacks for Reparations in America (N'COBRA) is a group that works to get money for the descendants of former slaves in the United States. == History == The National Coalition of Blacks for Reparations in America (N'COBRA) was started on September 26, 1987. Its main goal was to share information and work toward getting reparations for slavery in the United States. The group was founded by Imari Obadele and Chokwe Lumumba. Other groups that helped start N'COBRA include the National Conference of Black Lawyers, the New Afrikan Peoples Organization, and the Republic of New Afrika. In 1994, N'COBRA held a big meeting in Detroit. One of the speakers was Queen Mother Moore, who helped start the Republic of New Afrika. == Organizational structure == N'COBRA does its work through nine main national groups: # Economic Development # Human Resources # Legal Strategies # Legislation # Information and Media # Membership and Organizational Growth # International Affairs # Youth # Education There are three types of members in N'COBRA: individual members, local and national chapters, and partner organizations. N'COBRA has members across the United States (like in Philadelphia) and also in parts of Africa, Europe, Central and South America, and the Caribbean. The organization is led by a national board of directors. == Positions == The National Coalition of Blacks for Reparations in America (N'COBRA) says its mission is to seek justice and repair for the harms caused by slavery. Since at least 2017, N'COBRA has pushed for reparations to be given through rebuilding and improving Black communities, rather than giving money directly to individuals whose ancestors were enslaved. In 2022, Taiwo Kujichagulia-Seitu from N'COBRA explained that the group’s goal is to achieve “full repair” for the damage caused by slavery. === Juneteenth === Since the early 1990s, N'COBRA has celebrated Juneteenth, a holiday that marks the end of slavery in the United States. H.R. 40 H.R. 40 is a bill in Congress called the Commission to Study and Develop Reparation Proposals for African-Americans Act. It was first introduced in 1989 by Representatives John Conyers (D-MI) and Sheila Jackson Lee (D-TX), and it has been reintroduced in every Congress since then. In 2001, N'COBRA officially supported H.R. 40. At that time, the group, along with its lead legal advisor Adjoa Aiyetoro, was also preparing a lawsuit against the U.S. government to demand reparations. === 2016 Movement for Black Lives policy platform === In August 2016, the Movement for Black Lives, a group connected to the Black Lives Matter movement, released a policy platform focused on reparations. The platform included six main demands and 40 policy ideas. It called for reparations for the long-term harm caused by slavery and for more support for education and jobs for African Americans. Reuters praised the platform as the first time that Black-led groups connected to the Black Lives Matter movement had come together to create a detailed and united policy plan. == Criticism == Some people say that N'COBRA has not made much progress in pushing for reparations in the United States. For example, reparations expert William A. Darity Jr. said that N'COBRA’s plans will not lead to a reparations program that gives direct payments to Black Americans who are descendants of slavery in the U.S. == Well-known Current and Former Members == * Imari Obadele – Co-founder * Chokwe Lumumba – Co-founder * James Forman – Member * Efia Nwangaza – National co-chair * Adjoa Aiyetoro – Chief legal advisor * Robin Rue Simmons – Lifetime member * Conrad Worrill – Economic development commissioner == See also == * H.R. 40 — Commission to Study and Develop Reparation Proposals for African-Americans Act * H.R. 40 Wikiquotes * American Descendants of Slavery * Mayors Organized for Reparations and Equity * National African American Reparations Commission * Civil Liberties Act of 1988 — reparations to Japanese Americans interned by the United States government during World War II) * Reparations Agreement between Israel and the Federal Republic of Germany (1952) == Further reading == * * * == References == === Notes === === Sources === * * * * == Other websites == * * N'COBRA legacy site",
 "title": "National Coalition of Blacks for Reparations in America"
}