{
 "id": "1191606",
 "text": "The Anglo-Manipuri Treaty of 14 September 1762, also known as the Anglo- Manipuri Mutual Defence Treaty, 1762, marked a formal alliance between Manipur Kingdom and the British East India Company, driven by mutual interests in resisting Burmese expansion and securing commercial and strategic advantages in the region. It was concluded on 14 September 1762 between Harray Das Gussein, acting on behalf of Jai Singh of Manipur, and Mr. Harry Verelst, Chief of the British East India Company’s Chittagong Factory. The treaty outlined mutual military and political cooperation between Manipur and the British East India Company, particularly against Burmese incursions.Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 12–16Tarapot, Phanjoubam. Bleeding Manipur. India: Har-Anand Publications, 2003. p. 22, 125, 220, 221, 224, 231, 286, 287, 290, 291, 319Documents on North-East India: An Exhaustive Survey. India: Mittal Publications, 2021. p. 1, 3, 7Sana, Raj Kumar Somorjit., Wangam, Somorjit. Manipur: The Forgotten Nation of Southeast Asia. India: Waba Publications, 2015. p. 5, 6, 50, 159, 160, 163, 165, 167, 169, 181, 185, 193, 195, 251, 255, 257, 259, 261, 359, 398 The Anglo-Manipuri Treaty of 14 September 1762 was the first treaty between Manipur and the British Empire. In this treaty, the British agreed to help Manipur get back its land or push out the Burmese from the state. This was followed by another defence agreement in 1763 between the two sides. == Key Provisions == 1\\. Military Assistance: The British agreed to provide military support to Jai Singh for the recovery of territories and property taken by the Burmese, subject to availability of troops. 2\\. Financial Responsibility: Jai Singh committed to covering all expenses and related costs of the British troops on a monthly basis, for the duration of their service under his command. 3\\. Joint Military Action: Jai Singh agreed to combine his forces with those of the British to seek redress for damages previously inflicted by the Burmese, including at Negrais and other locations under Burmese administration. 4\\. Mutual Recognition of Grievances: Jai Singh declared that any aggression by the Burmese against the British would be considered as aggression against Manipur. He pledged to oppose any future interference with British trade or personnel by the Burmese or any other authority. 5\\. Shared Enemies Clause: Both parties agreed to treat the enemies of one as the enemies of the other. 6\\. Establishment of British Facilities: Jai Singh consented to grant the British land within his domain to establish a factory and fort. An area extending 8,000 cubits around these facilities was to be granted rent-free in perpetuity. 7\\. Trade Rights: The British were permitted to conduct trade freely throughout Jai Singh’s territory without duties or obstruction. Jai Singh also committed to their protection. 8\\. Diplomatic Alignment: Neither party was to enter into an agreement with the Burmese without the other’s knowledge and approval. 9\\. Future Compensation: Should British and allied forces gain control over Burmese territory and transfer it to Jai Singh, he agreed to compensate the British for all prior losses incurred due to Burmese hostilities. == Proposals == On 11 September 1763 (Gregorian calendar), a set of proposals was submitted by Anund Sah, Podullo Singh, and Chitton Singh Hazarry on behalf of Goursah Singh, Raja of Meckley (modern-day Mekhli), concerning the Anglo-Manipuri Treaty originally signed on 14 September 1762. The proposals were intended to affirm and clarify Meckley’s position within the framework of the earlier alliance. === Confirmation of Treaty === Goursah Singh formally confirmed and ratified the treaty of alliance concluded on 14 September 1762 between representatives of the British East India Company—namely Harry Verelst, Randolf Marriott, and Thomas Rumbold—and Hurry Dass Gussein on behalf of Jai Singh, Raja of Manipur. All terms of the original treaty were approved without reservation. === Modification to Financial Obligations === Referring to the second article of the original treaty, which required monthly payments by Jai Singh for expenses incurred by British troops, Goursah Singh acknowledged his inability to meet such payments in specie (i.e., gold or silver), due to extensive damage inflicted on Meckley by Burmese forces. In response, he proposed an alternative arrangement: * All past and future military expenses would be paid in kind, using goods and merchandise available within Meckley. * Payments would be delivered to the British at Raung Roong, according to agreed-upon rates and conditions. * An initial consignment of goods, as specified in an attached list, would be provided upon the arrival of British troops in Meckley. * An upfront payment of 100 Meckley gold rupees (valued at 12 silver rupees each) would also be made. === Mining Agreement === Goursah Singh agreed to allow the British to assist in the development and operation of mineral resources in Meckley, specifically: * The exploitation of a gold mine located on the banks of the River Barrampooter, as well as any other known or future-discovered mines of gold, silver, lead, iron, tin, copper, and precious stones within his territory. * He undertook responsibility for the expenses involved in operating these mines. * Seventy-five percent of the mined output would be allocated to the British, to be used toward covering military expenses incurred on his behalf. === Settlement of Accounts and Commercial Provisions === Payments in goods and mined products would continue until the full cost of British assistance was repaid. Upon full settlement of all accounts, no further payments would be required. In accordance with the 1762 treaty, the British were to be permitted to reside in Meckley as merchants, enjoying the same commercial rights and privileges previously agreed upon. The document was signed at Islamabad on 1 September 1685 (Saka calendar), corresponding to 11 September 1763 in the Gregorian calendar. == Related pages == * Meitei–Shan relations * Chahi Taret Khuntakpa (Seven Years' Devastation) * Burmese–Meitei relations * Anglo-Manipur War * Ahom–Meitei relations == References == Category:History of Manipur Category:British India Category:Meitei people",
 "title": "Anglo Manipuri Treaty (1762)"
}