{
 "id": "1191531",
 "text": "The following are the women's football (soccer) events in the year 1971 around the world. ==Events== ===April=== * April 17: ** The first FIFA-recognized international women's football match is played. In that match, France beat the Netherlands 4–0 in Hazebrouck, France, thanks to goals from Jocelyne Ratignier and Marie-Claire Caron-Harant. ===May=== * May 9: ** The first ever WFA Cup final is played. Southampton beat Scottish side Stewarton Thistle 4–1 at the Crystal Palace in London. ===September=== * September 5: ** The 1971 Women's World Cup final is played. Denmark beat Mexico 3–0 at the Estadio Azteca in Mexico City, thanks to a hat-trick from Susanne Augustesen. The match was played in front of a crowd of between 110,000 and 112,500, which remains a record in women's football. ==Tournament winners== ===International=== Tournament Confederation Host Country(s) Winner Runner-Up Third Place Finals Stadium 1971 Women's World Cup FIEFF (Europe/Global) Estadio Azteca, Mexico City ===League & Cup Winners=== Nation League Champion Cup Winner Runner-Up 1970–71 Czech SR Championship Slavia Prague No Cup No Cup No Cup 1970–71 Slovak SR Championship Dukla ZPA Prešov No Cup No Cup No Cup No League No League 1970–71 WFA Cup Southampton Stewarton Thistle 1971 Naisten SM-sarja Helsingin Jalkapalloklubi No Cup No Cup No Cup 1971 Serie A (FFIGC) Piacenza 1971 Coppa Italia Roma CF Fiorentina 1971 Serie A (FICF) Real Juventus 1971 Coppa Italia Roma CF Fiorentina 1970–1971 Nationalliga A DFC Aarau No Cup No Cup No Cup ==Clubs== ===Clubs founded=== Date Founded Club Country Current League Women's team of Notes January 21 Jitex BK Elitettan 6-time Damallsvenskan champions March 4 Deportivo Cuenca Femenino Ascenso Nacional Femenino Ecuabet Deportivo Cuenca 2-time Superliga Femenina champions 1971 Esteghlal Women FC Iran Women Soccer League 1 Esteghlal FC 1971 Helsingin Jalkapalloklubi Kansallinen Liiga HJK Helsinki 24-time Kansallinen Liiga champions 1971 IF Brommapojkarna Damallsvenskan IF Brommapojkarna 1971 KFC '71 Folded in 2010 2-time Hoofdklasse champions 1971 KRC Genk Ladies Belgian Women's Super League KRC Genk 1971 KSK Heist Folded in 2022 KSK Heist 3-time Belgian Women's First National Division champions 1971 Lowestoft Ladies Folded in 1983 1981–82 WFA Cup winner 1971 Paris FC Première Ligue Paris FC 6-time Première Ligue champions 1971 Paris Saint-Germain Première Ligue Paris Saint- Germain 2020–21 Division 1 Féminine winner 1971 RSC Anderlecht Belgian Women's Super League RSC Anderlecht 7-time Belgian Women's Super League champions 4-time Belgian Women's First National Division champions 1971 Sheffield Wednesday LFC North East Regional Women's Football League Sheffield Wednesday 1971 Standard Fémina Belgian Women's Super League Standard Liège 16-time Belgian Women's First National Division champions 2014–15 BeNe League winner 2-time Belgian Women's Super League champions 1971 TSV Fortuna Sachsenross (formerly) Folded, date unknown TSV Fortuna Sachsenross Founding member of the Frauen-Bundesliga 1971 Tyresö FF Division 1 Mellersta 2012 Damallsvenskan winner 1971 Zulte Waregem Belgian Women's Super League Zulte Waregem ==Births and deaths== ===Births=== Note: Male managers will be listed in Italics. Additionally, only their jobs in women's football will be listed. Date of Birth Player Nationality Played For Managed Date of Death Other Notes January 5 Manuela Goller (formerly) SSG 09 Bergisch Gladbach Grün-Weiß Brauweiler 1996–97 Frauen-Bundesliga winner 2-time DFB-Pokal Frauen winner (1993–94, 1996–97) 1994 DFB-Supercup Frauen winner 1995 FIFA Women's World Cup runner-up UEFA Women's Euro 1995 winner January 15 Agnete Carlsen SK Sprint-Jeløy Nikko Securities Kolbotn Athene Moss 2-time 1. divisjon winner (1990, 1993) 2-time Norwegian Women's Cup winner (1988, 1989) 3-time L.League winner (1996, 1997, 1998) 1996 Empress's Cup winner 1995 FIFA Women's World Cup winner 1991 FIFA Women's World Cup runner-up UEFA Women's Euro 1993 winner Bronze medalist at the 1996 Summer Olympics January 23 Julie Foudy Stanford Cardinal Sacramento Storm Tyresö FF San Diego Spirit 2-time FIFA Women's World Cup winner (1991, 1999) 2-time FIFA Women's World Cup third place (1995, 2003) 2-time Olympic gold medalist (1996, 2004) Silver medalist at the 2000 Summer Olympics Member of the National Soccer Hall of Fame January 25 Silke Rottenberg (formerly) Grün-Weiß Brauweiler TSV Siegen Sportfreunde Siegen FFC Brauweiler Pulheim FCR 2001 Duisburg 1\\. FFC Frankfurt 3-time Frauen-Bundesliga winner (1993–94, 1995–96, 2006–07) 3-time DFB-Pokal Frauen winner (1990–91, 1992–93, 2006–07) 2-time FIFA Women's World Cup winner (2003, 2007) 3-time UEFA Women's Championship winner (1997, 2001, 2005) 2-time Olympic bronze medalist (2000, 2004) 1998 German Women's Footballer of the Year June 13 Saskia Webber Rutgers Scarlet Knights OKI FC Winds Philadelphia Charge New York Power 1999 FIFA Women's World Cup winner Third place at the 1995 FIFA Women's World Cup Gold medalist at the 1996 Summer Olympics Founding member of Angel City FC July 22 Kristine Lilly North Carolina Tar Heels Tyresö FF Delaware Genies Boston Breakers (WUSA) KIF Örebro DFF Boston Breakers (WPS) 4-time NCAA Women's College Cup winner 2-time FIFA Women's World Cup winner (1991, 1999) 3-time FIFA Women's World Cup third place (1995, 2003, 2007) 2-time Olympic gold medalist (1996, 2004) Silver medalist at the 2000 Summer Olympics 1992 Honda Sports Award winner Member of the National Soccer Hall of Fame July 30 Anita Waage Spjelkavik IL IK Grand Bodø Trondheims-Ørn SK Kolbotn Skeid 4-time Toppserien winner 4-time Norwegian Women's Cup winner 1995 FIFA Women's World Cup winner August 3 Cathrine Zaborowski Asker Fotball North Carolina Tar Heels 4-time Toppserien winner 2-time Norwegian Women's Cup winner (1990, 1991) 1991 FIFA Women's World Cup runner-up UEFA Women's Euro 1993 winner 2-time UEFA Women's Championship runner-up (1989, 1991) 1988 FIFA Women's Invitation Tournament winner 1994 Algarve Cup winner September 7 Briana Scurry UMass Minutewomen Atlanta Beat Washington Freedom Washington Spirit (assistant) 1999 FIFA Women's World Cup winner 2-time FIFA Women's World Cup third place (1995, 2003) 2-time CONCACAF Women's Gold Cup winner (2000, 2006) 2-time Olympic gold medalist (1996, 2004) Silver medalist at the 2000 Summer Olympics 4-time Algarve Cup winner 2-time Algarve Cup runner-up (1994, 1999) Gold medalist at the Soccer at the 1998 Goodwill Games 2008 Peace Queen Cup winner 2008 Four Nations Tournament winner 1999 FIFA Women's World Cup Golden Glove winner September 24 Claudia Klein (formerly) Grün-Weiß Brauweiler Sportfreunde Siegen 1\\. FFC Frankfurt Sportfreunde Siegen 2-time Frauen-Bundesliga winner (1996–97, 2001–02) 4-time DFB-Pokal Frauen winner 2-time DFB-Supercup Frauen winner (1994, 1997) 3-time DFB-Hallenpokal Frauen winner (1994, 1997, 2000) 2001–02 UEFA Women's Cup winner 1995 FIFA Women's World Cup runner-up 2-time UEFA Women's Championship winner (1995, 1997) October 7 Bettina Wiegmann (formerly) FFC Brauweiler Pulheim Boston Breakers 1996–97 Frauen-Bundesliga winner 3-time DFB-Pokal Frauen winner (1990–91, 1993–94, 1996–97) 2003 FIFA Women's World Cup winner 4-time UEFA Women's Championship winner Bronze medalist at the 2000 Summer Olympics 1997 German Women's Footballer of the Year October 10 Reynald Pedros Olympique Lyon 2-time Division 1 Féminine winner (2017–18, 2018–19) 2018–19 Coupe de France Féminine winner 2-time UEFA Women's Champions League winner (2018–19, 2019–20) 2022 Women's Africa Cup of Nations runner-up ====January==== * January 5: ** Manuela Goller, footballer (SSG 09 Bergisch Gladbach, Grün-Weiß Brauweiler, Germany). ** Wei Haiying, footballer (China), and Hong Konger councillor. * Janaury 11: ** Luce Mongrain, soccer player (NC State Wolfpack, Canada). *January 15: ** Agnete Carlsen, footballer (SK Sprint-Jeløy, Nikko Securities, Kolbotn, Athene Moss, Norway). ** Zhou Yang, footballer (China). * Janaury 21: ** Tina Mapes, footballer (Millwall Lionesses, Wimbledon, Lindsdals IF, Croydon, Arsenal, England). *January 23: ** Julie Foudy, soccer player (Stanford Cardinal, Sacramento Storm, Tyresö FF, San Diego Spirit, United States). * January 25: ** Silke Rottenberg, footballer (Grün-Weiß Brauweiler, TSV Siegen, Sportfreunde Siegen, FFC Brauweiler Pulheim, FCR 2001 Duisburg, 1. FFC Frankfurt, Germany) and manager (Germany U20). * January 29: ** Veronica O'Brien, soccer player (New Hampshire Wildcats, Canada) and manager (UTEP Miners, UC Riverside Highlanders). * January 31: ** Rita Guarino, footballer (Torino, Reggiana, Fiammamonza, Torres, Maryland Pride, Lazio, Foroni Verona, Italy), assistant manager (Italy U17), and manager (Italy U17, Juventus, Inter Milan). ** Tara Proctor, footballer (Charlton Athletic Ladies, Brighton & Hove Albion Women, England). ====February==== * February 4: ** Clare Wheatley, footballer (Sheffield Wednesday, Arsenal Ladies, England). * February 6: ** Luisa Marchio, footballer (Torino, ACF Milan, Torres, Atletico Oristano, Roma CF, Italy), assistant manager (Torres), and manager (Atletico Oristano). * February 16: ** Amanda Crawford, footballer (New Zealand). * February 17: ** Huang Yu-chuan, footballer (Ming Chuan University, Chinese Taipei). * February 24: ** Annika Nessvold, footballer (Malmö FF, Sweden). * February 25: ** Olivia O'Toole, footballer (Drumcondra, Castle Rovers, Shamrock Rovers, Raheny United, St Catherine's, Republic of Ireland). ====March==== * March 8: ** Arantza del Puerto, footballer (Añorga KKE, Spain). * March 22: ** Angela Iannotta, footballer (ACF Agliana, Panasonic Bambina, Autolelli Picenum, Australia). * March 26: ** Anne Zenoni, footballer (Toulouse, France). ====April==== * April 1: ** Elke Walther, footballer (VfL Sindelfingen, SV Bergisch Gladbach 09, TuS Niederkirchen, SC Freiburg, West Germany/Germany). * April 4: ** Sharon Black, footballer (Fortuna Hjørring, Adelaide United, Australia). * April 22: ** Eliane, footballer (Brazil). ** Spencer Prior, men's footballer, assistant manager (Australia), and manager (Australia U20, Thailand, Papua New Guinea). ====May==== * May 1: ** Inesu Emiko Takeoka, footballer (Nikko Securities, Japan). ====June==== * June 13: ** Saskia Webber, footballer (Rutgers Scarlet Knights, OKI FC Winds, Philadelphia Charge, New York Power, United States) and assistant manager (NC State Wolfpack, Rutgers Scarlet Knights). * June 14: ** Karen Burke, footballer (St Helens, Liverpool Ladies, Everton Ladies, ÍBV, Doncaster Rovers Belles, Leeds United Ladies, Blackburn Rovers Ladies, England). ** Annelie Nilsson, footballer (Sunnanå SK, Sweden). ====July==== * July 16: ** Wendi Henderson, footballer (New Zealand) and assistant manager (New Zealand). * July 22: ** Kristine Lilly, soccer player (North Carolina Tar Heels, Tyresö FF, Boston Breakers (WUSA), KIF Örebro DFF, Boston Breakers (WPS), United States) and indoor soccer player (Washington Warthogs). * July 25: ** Irene Stelling, footballer (Hartford Hawks, Denmark). * July 30: ** Anita Waage, footballer (Spjelkavik IL, IK Grand Bodø, Trondheims-Ørn SK, Kolbotn, Skeid, Norway). ====August==== * August 3: ** Cathrine Zaborowski, footballer (Asker Fotball, North Carolina Tar Heels, Norway). * August 20: ** Alexandra Svetlitskaya (died 2019), footballer (CSK VVS Samara, Lada Togliatti, Energiya Voronezh, Alma-KTZh, Russia) and manager (Kazakhstan U19). * August 30: ** Roser Serra, footballer (Club Femení Barcelona, Arsenal Ladies, Spain). ====September==== * September 7: ** Briana Scurry, footballer (UMass Minutewomen, Atlanta Beat, Washington Freedom, United States) and assistant manager (Washington Spirit). * September 12: ** Ri Ae-gyong, footballer (North Korea). * September 21: ** Beate Wendt, footballer (SC Poppenbüttel, Germany). * September 24: ** Claudia Klein, footballer (Grün-Weiß Brauweiler, Sportfreunde Siegen, 1. FFC Frankfurt, Germany) and player-manager (Sportfreunde Siegen). ====October==== * October 2: ** Anette Igland, footballer (Kaupanger IL, Norway). * October 3: ** Angela Kelly, soccer player (North Carolina Tar Heels, Raleigh Wings, Canada), assistant manager (Tennessee Lady Volunteers), and manager (Tennessee Lady Volunteers, Texas Longhorns). * October 7 ** Bettina Wiegmann, footballer (FFC Brauweiler Pulheim, Boston Breakers, West Germany/Germany). * October 10: ** Reynald Pedros, men's footballer and manager (Olympique Lyon, Morocco). * October 18: ** Megumi Sakata, footballer (Nissan Ladies, Prima Ham FC Kunoichi, Tasaki Perule, Japan). * October 26: ** Andrea Neil, soccer player (UBC Thunderbirds, Vancouver Whitecaps, Canada), assistant manager (Canada), and manager (UBC Thunderbirds). ====December==== * December 16: ** Scott Booth, men's footballer and manager (Glasgow City, Birmingham City, Lewes, Aberdeen). * December 18: ** Pauline Hamill, footballer (Kilmarnock Ladies, ÍBV, Hibernian Ladies, Doncaster Rovers Belles, Blackburn Rovers Ladies, Celtic, Spartans Women, Scotland) and manager (Scotland U17, Scotland U19, Saudi Arabia U20). * December 25: ** Chioma Ajunwa, footballer (Nigeria) and track and field athlete. Gold medalist for Women's long jump at the 1996 Summer Olympics. ==References==",
 "title": "1971 in women's association football"
}