{
 "id": "1191607",
 "text": "The Anglo-Manipuri Treaty of 1833, also known as the Jiri Treaty of 1833,Suresh Singh, Th. The Endless Kabaw Valley: British Created Vicious Cycle of Manipur, Burma and India. India: Quills Ink Publishing, 2014. p. X, 193, 201, 229 was signed on 18 April 1833, by Rajah Gumbheer Singh of Manipur Kingdom, F.J. Grant, Commissioner representing the British East India Company, formalized through written agreement, witnessed by Lt. Geo. Gordon, Adjutant of Gumbheer Singh’s Manipur Levy.Colonialism and Resistance: Society and State in Manipur. India: Taylor & Francis, 2015. p. 150Tarapot, Phanjoubam. Bleeding Manipur. India: Har-Anand Publications, 2003. p. 22, 125, 220, 221, 224, 231, 286, 287, 290, 291, 319Documents on North-East India: An Exhaustive Survey. India: Mittal Publications, 2021. p. 1, 3, 7 It marked the proper demarcation of the boundary between Manipur and Cachar. == Overview == The Anglo-Manipuri Treaty of 1833 was a formal agreement between the British East India Company and the Manipur Kingdom under the leadership of Raja Gumbheer Singh. The treaty outlined territorial arrangements, trade regulations, infrastructural cooperation, and military collaboration between the two parties. It is a document of geopolitical importance in the colonial history of Northeast India. == Territorial provisions == The British East India Company ceded all claims to the Kala Naga and Nungjai hill ranges, located between the eastern and western bends of the Barak River. These areas were officially transferred to the possession of the Raja of Manipur. The boundary between British territory and Manipur was set along the Jiri River and the western bend of the Barak, contingent on acceptance of the treaty's conditions by the Raja. == Key provisions == === Political and Administrative Terms === 1\\. The Raja agreed to relocate his administrative outpost (Thana) from Chandrapur to the eastern bank of the Jiri River. === Trade Provisions === 2\\. The Raja was required to allow free trade between British and Manipuri subjects. He was prohibited from imposing excessive duties or establishing monopolies on any trade goods. 3\\. The treaty ensured the rights of Naga inhabitants of the ceded hill regions to trade local products (e.g., ginger, cotton, pepper) freely in the plains of Cachar, specifically at Banskandi and Oodherban bazaars, in accordance with prior custom. === Infrastructure and Road Development === 4\\. The Raja undertook responsibility for maintaining a trade and military route extending from the eastern bank of the Jiri, via Kala Naga and Kowpum, to the Manipur valley. The road was to remain passable during dry and cool seasons for pack animals. The Raja also agreed to comply with instructions from British officers inspecting or supervising the road. 5\\. The Raja was to supply a contingent of Naga laborers to aid in road construction when requested by the British Government. === Military Provisions === 6\\. In case of conflict with Burma (the Burmese Kingdom), the Raja was obligated to provide hill porters to support British military operations in or through Manipur, particularly for the transport of supplies and ammunition. 7\\. In the event of unrest or conflict on the eastern frontier of British territory, the Raja agreed to provide military assistance upon request. 8\\. The Raja was held accountable for all British-supplied ammunition and was required to submit monthly expenditure reports to the British officer attached to his Levy. == Significance == The treaty formalized British strategic interests in Northeast India and reinforced the role of the Manipur kingdom as a subordinate ally. It reflected the British policy of indirect control through treaty obligations, road infrastructure, and military logistics while maintaining local rulership. == Authentication == The agreement was signed and sealed by Raja Gumbheer Singh, Commissioner F.J. Grant, and witnessed by Lieutenant Geo. Gordon. == Related pages == * Meitei–Shan relations * Chahi Taret Khuntakpa (Seven Years' Devastation) * Burmese–Meitei relations * Anglo-Manipur War * Ahom–Meitei relations == References == Category:History of Manipur Category:British India Category:Meitei people",
 "title": "Anglo Manipuri Treaty (1833)"
}