{
 "id": "1192409",
 "text": "Aditi Rao Hydari (born on 28 October 1978) is an Indian actress who works in Hindi, Tamil, and Telugu movies. She comes from the Tyabji–Hydari family and started her acting career with the Malayalam movie Prajapathi in 2006. She became well known for her roles in Delhi-6 (2009) and Yeh Saali Zindagi (2011), winning a Screen Award for Best Supporting Actress for the latter. She also acted in popular movies like the musical romance Rockstar (2011), the thriller Murder 3 (2013), and the action film Wazir (2016). In 2018, she played a key role in the historical drama Padmaavat, which was a big box office hit and won her an IIFA Award for Best Supporting Actress. Aditi played the main role in Mani Ratnam’s Tamil movie Kaatru Veliyidai (2017), for which she won the SIIMA Award for Best Female Debut – Tamil. She was also nominated for the Filmfare Award for Best Actress – Telugu for her role in Sammohanam (2018). Some of her other movies include Chekka Chivantha Vaanam (2018), Sufiyum Sujatayum (2020), and Maha Samudram (2021), as well as the Netflix movie Ajeeb Daastaans (2021), and web series Jubilee (2023) and Heeramandi (2024). == Filmography == === Movies === Year Title Role Language Notes 2006 Prajapathi Savithri Malayalam 2007 Sringaram Madhura/Varshini Tamil 2009 Delhi 6 Rama Hindi 2010 Dhobi Ghat Guest at art gallery 2011 Yeh Saali Zindagi Shanti Rockstar Sheena 2012 London, Paris, New York Lalitha Krishnan 2013 Murder 3 Roshni Boss Ankita Thakur 2014 Khoobsurat Kiara Special appearance Rama Madhav Herself Marathi Special appearance in song \"Loot Liyo Mohe Shyam\" 2015 Guddu Rangeela Baby Hindi 2016 Wazir Ruhana Ali Fitoor Young Begum Hazrat Special appearance The Legend of Michael Mishra Varshali Shukla 2017 Kaatru Veliyidai Leela Abraham Tamil Bhoomi Bhoomi Sachdeva Hindi 2018 Padmaavat Mehrunisa Daas Dev Chandni Sammohanam Sameera Telugu Chekka Chivantha Vaanam Parvathi Tamil Antariksham 9000 KMPH Riya Telugu 2020 Psycho Dagini Tamil Sufiyum Sujatayum Sujatha Malayalam V Saheba Telugu 2021 The Girl on the Train Nusrat John Hindi Ajeeb Daastaans Priya Sharma Sardar Ka Grandson Young Swanmeet \"Sardar\" Kaur Special appearance Maha Samudram Mahalakshmi Telugu 2022 Hey Sinamika Mouna Yaazhan Tamil 2023 Gandhi Talks Gayathri Silent Premiered at the IFFI Mehak English Filming ===Television=== Year Title Role Network Notes 2023 Taj: Divided by Blood Anarkali ZEE5 Jubilee Sumitra Kumari Amazon Prime Video 2024present Heeramandi Bibbojaan Netflix Filming ===As voice actor=== Year Movie Dubbing for Language Notes Ref. 2022 Ponniyin Selvan: I Trisha Hindi Dubbed for the character Kundavai 2023 Ponniyin Selvan: II == Discography == Year Album Song Music Director Language Ref. 2021 Jail \"Kaathodu Kaathanen\" (co-singer Dhanush) G. V. Prakash Kumar Tamil 2024 Coke Studio Tamil \"Please Purinjukko\" (co-singer Sean Roldan) Sean Roldan == Accolades == Year Award Category Movie Result Ref. 2010 Screen Awards Best Ensemble Cast Delhi-6 2013 Best Supporting Actress Yeh Saali Zindagi Zee Cine Awards Best Actor in a Supporting Role – Female Stardust Awards Best Actress London, Paris, New York Producers Guild Film Awards Best Actress in a Supporting Role Rockstar 2014 BIG Star Entertainment Awards Most Entertaining Actor in a Thriller Film – Female Murder 3 2018 Asiavision Awards Best Actress – Tamil Kaatru Veliyidai Edison Awards Face of the Year South Indian International Movie Awards Best Female Debut – Tamil 2019 Zee Cine Awards Telugu Best Debut Actor – Female Sammohanam Filmfare Awards South Best Actress – Telugu South Indian International Movie Awards Best Actress – Telugu International Indian Film Academy Awards Best Supporting Actress Padmaavat 2023 Indian Television Academy Awards Best Actress – Popular (OTT) Jubilee === Other recognitions === Year Award Category Result Ref. 2023 Distinctive International Arab Festivals Awards Outstanding Contributions to the Entertainment Industry 2024 Bollywood Hungama Style Icons Most Stylish Classic Beauty of the Year == References == * == Other websites == * * Category:Living people Category:1978 births Category:Indian actors",
 "title": "Aditi Rao Hydari"
}