{
 "id": "1192535",
 "text": "Leopold Vogl (* 16 September 1910 in Atzgersdorf, Austria-Hungary - 16 December 1991) was an Austrian football player and football coach. He played as forward, who won four championship titles with SK Admira Wien in the 1930s. He also played for the Austrian national football team. ==Career == Vogl began his career at Vorwärts Atzgersdorf. 1930 he moved to first division club SC Wacker Wien. In 1932, he moved to Admira Wien. In the beginning he played as a backup in the attacking line. He was called Vogl II to avoid confusion with left winger Adolf Vogl. After Ignaz Sigl retired at the end of the season, the young striker took over this position. In his first season as a regular player, Admira won the championship. They also achieved the double with an 8-0 victory over SK Rapid Vienna in the final of the ÖFB Cup. The following season, Vogl was Admira's top scorer with 15 goals. That was remarkable, because the attacking line (Anton Schall, Karl Stoiber, Karl Durspekt, Wilhelm Hahnemann and Adolf Vogl) was made up of international players. Although this was only enough for runner-up in the league, Admira won three more titles in the four following years. In 1941, Vogl and his teammate Karl Stoiber moved to second-division club Wiener AC. They won the title but also achieved promotion to the first division. In the Gauliga WAC reached the second place behind Vienna, followed by third place the following year. Vogl remained with WAC even after the war. He then worked as a player-coach until 1947. ==International == Due to the fierce competition for striker positions in the 1930s, there was hardly any room for Leopold Vogl in the national team. Vogl's first international match was actually a match between the B national team and the Polish national team on 12 May 1935. ÖFB players profile It was later declared an official international match by the Austrian Football Association (ÖFB). Vogl's only \"real\" appearance came on 6 October of that year, in a 4-4 draw with Hungary.ÖFB players profile After the Anschluss, he also played several times for the Ostmark selection and the Vienna city team. ==Honours == * 1× Mitropacupfinal: 1934 * 4× Austrian champion: 1934, 1936, 1937, 1939 * 1× Austrian Cup: 1934 * 1× Champion 2nd leagueː 1942 * 2 matches and 2 goals for the Austrian national football team: 1935 ==References == Category:Austrian footballers Category:Players of the Austrian national football team Category:1910 births Category:1991 deaths Category:Austrian football managers Category:Austrian football champions Category:Austrian football forwards Category:Association football forwards",
 "title": "Leopold Vogl"
}