{
 "id": "1192922",
 "text": "Amanirenas (also spelled Amanirena), was queen regnant of the Kingdom of Kush from mid to late 1st century BCE.Kuckertz, Josefine, 2021, Meroe and Egypt. In Wolfram Grajetzki, Solange Ashby, and Willeke Wendrich (eds.), UCLA Encyclopedia of Egyptology, Los Angeles. . p. 5. She is known for invading Roman occupied Egypt and successfully negotiating the end of Roman retaliation, retaining Kushite independence. Her full title was Amnirense qore li kdwe li (\"Ameniras, qore and kandake\"). Meroitic, the indigenous language of the kingdom of Kush, remains undeciphered; however, inscriptions giving Queen Amanirenas the title of \"qore\" as well as \"kandake\" suggest that she was an individually ruling queen. ==Meroë Head== The head of Augustus preserved by Amanirenas, referred to as the Meroë Head, was discovered by British archaeologist John Garstang in 1910. The glass, metal, and crystal eyes of the statue, which are frequently lost in similar pieces, remained intact due to its burial. The portrait is done in the Greek style, evoking youth and power. The head itself is made of bronze, larger-than-life, and similar in style to the Augustus Prima Porta. The eyes are made of calcite, metal rings, and glass. The head was buried beneath the steps of a temple in Meroë, the capital of the Kingdom of Kush. The temple was dedicated to Victory, likely in an attempt to subjugate Augustus in the mind of the Kushite people and establish Rome as a defeated power. Frescoes within the temple itself possibly depict Roman prisoners of war standing before a ruling Kushite, possibly Akinidad. The excavation of Meroë (Nubia) was funded by the Sudan Excavation Committee. After the Meroë Head’s discovery, it was gifted to the British Museum where it still resides today. ==Hamadab Stela== The Hamadab Stela, which dates to the first century BC, is made of sandstone. There are forty-five rows of Meroitic text, cursive and incised. The text mentions both Queen Amanirenas and King Akinidad, presumably her son. The incised image of the two, which features some deities, is lost; only the legs remain visible. The stela was discovered by John Garstang, the archaeologist responsible for discovering the Meroë Head, in 1914. The stela stood at the doorway of a small temple, accompanied by a second stela on the opposite side. The stela is roughly two meters tall and one meter wide. It is incised with the Meroitic language. The deities incised alongside Amanirenas and Akinidad are possibly Amun and Mut; the latter figure is holding an ankh, the Egyptian symbol of eternal life. Shackled prisoners are depicted beneath the ruling couple and the deities. Because the stela depicts the ruling couple with bound prisoners and dates to the first century BC, scholars believe the stela may provide a Kushite account of the campaign against Rome. It features the Meroitic term “Areme,” which may translate as Rome. If the inscription discusses the Roman campaign, its translation is of vital importance for scholarship. The only extant descriptions of the Meroitic-Roman conflict are Roman in origin and often rife with propaganda. ==Legacy== Though initially obscure, Amanirenas has become a popular figure due to recent popular publications such as Rejected Princesses: Heroines, Hellions, and Heretics by Jason Porath and renewed scholarly interest in resistance to Roman rule. The introduction of post-colonial studies and a focus on identity under imperial rule within the Classics and the resulting publications have broadened understanding of the subject, but information about Amanirenas remains limited due to Meroitic being an undeciphered language. Strabo's account being the only translated primary source to discuss Amanirenas at length further limits understanding of this African queen. ==Related pages== *Kingdom of Kush *Kandake (royal title) *List of monarchs of Nubia *Gaius Petronius (Roman Governor of Egypt) *Augustus ==Notes== ==Further reading== *Török, László, in: Fontes Historiae Nubiorum Vol. II, p. 723-725 (Bergen, 1996). * ==Other websites== *in power 500 – B.C. 1\" at Guide2womenleaders.com *Stela found in Naqa *Chicago Oriental Institute Archive: picture of her destroyed pyramid * A short animation about Amanirenas. *\"The Queen of Kush\" – A novel about Queen Amanirenas's war with the Roman Empire Category:Amanirenas Category:Kushite Monarchs Category:57 BC births Category:10 BC deaths Category:1st century BC in Roman Egypt Category:1st-century BC monarchs of Kush Category:1st-century BC queens regnant Category:Nubian women in warfare Category:Queens of Kush Category:Blind royalty and nobility",
 "title": "Amanirenas"
}