{
 "id": "1192235",
 "text": "The President of the Honourable Chamber of Deputies of the Argentine Nation (), commonly known simply as the president of the Chamber of Deputies, is the presiding officer of the lower house of the National Congress of Argentina, customarily a member of the governing party. He is after the Vice President and the provisional President of the Senate in the line of succession to the President of Argentina, in case of temporary impediment or vacancy, according to the Constitution of the Argentine Nation, in its article 88, and the Presidential Acephaly Law No. 25,716 (amending Law No. 20,972). ==Appointment== According to the House regulations, within the first ten days of December (Art.1), the deputies whose terms are not yet complete in that month, and the elected deputies, are summoned by the outgoing president to elect their officers. Once a quorum is reached, the session begins, presided over by the oldest deputy (Art. 2). After the new deputies are sworn in, the officers are elected by simple majority from among the members of the House: the president and his three vice presidents. The president is generally elected at the nomination of the governing party, while the vice presidents are chosen based on the number of seats held by the first three majority blocs. The president and vice presidents serve a one-year term (Article 37). If they have not been replaced by the end of their term, they will continue to perform their duties until that date. If the president completes his or her term as a deputy, or is incapacitated or absent, he or she will be replaced in order by the vice presidents. In the absence of the four authorities, they will be replaced by the chairs of the standing committees in order, according to Article 61 of the House's regulations. ==Functions== According to Article 39 of the House Regulations, the powers and duties of the Speaker are: * Call the deputies to the chamber and open the sessions from their seats * To report on the matters entered in the order and manner established in article 165 * Conduct the discussion in accordance with the regulations * Call the deputies to order and to the matter * Propose the votes and proclaim their results * Prepare the Agenda in the absence of the draft of the Parliamentary Work Commission * Authenticate with his signature the Journal of Sessions, which will serve as minutes and, when necessary, all acts, orders and procedures of the Chamber * Receive and open communications addressed to the Chamber to bring them to its attention * Provide for matters concerning the police, order and mechanism of the Secretariat * Submit to the Chamber for approval the salary and expense budgets of the Chamber * Appoint all employees of the Chamber, except for the secretaries and deputy secretaries. Vacancies that arise within the staff appointed by the president pursuant to the provisions of this paragraph shall be filled, to the extent possible, by promotion within the respective categories, based on competency, proven skills, and seniority. In the event that new positions are created, they shall be filled through a selection process, the terms and conditions of which shall be established by the Chamber authorities * Remove them when legally required * In general, to enforce this regulation in all its parts, and to exercise the other functions assigned to it therein. ==List of presidents== President Party Term start Term end José Graña Unitarian Party 17 October 1854 10 May 1856 Baltazar Sánchez Unitarian Party 10 May 1856 9 May 1857 Juan José Álvarez Unitarian Party 9 May 1857 7 May 1858 Mateo Luque Federalist Party 7 May 1858 5 May 1860 Eusebio Ocampo Federalist Party 5 May 1860 4 April 1861 José García Isasa Federalist Party 4 April 1861 24 May 1862 Pastor Obligado Autonomist Party 24 May 1862 27 April 1863 José Evaristo Uriburu Autonomist Party 27 April 1863 4 May 1864 Arístides Villanueva Autonomist Party 4 May 1864 30 April 1865 José Evaristo Uriburu Autonomist Party 30 April 1865 15 May 1868 Mariano Acosta Autonomist Party 15 May 1868 4 May 1869 Manuel Quintana Autonomist Party 4 May 1869 5 May 1870 Mariano Acosta Autonomist Party 5 May 1870 29 April 1872 Octavio Garrigós Autonomist Party 29 April 1872 4 May 1874 Luis Sáenz Peña National Autonomist Party 4 May 1874 5 May 1875 Bernardo de Irigoyen National Autonomist Party 4 May 1875 5 May 1876 Félix Frías National Autonomist Party 4 May 1876 1 May 1879 Manuel Quintana National Autonomist Party 1 May 1879 3 May 1881 Vicente Peralta National Autonomist Party 3 May 1881 28 April 1882 Tristán Achával National Autonomist Party 28 April 1882 30 April 1883 Miguel Navarro National Autonomist Party 30 April 1883 29 April 1884 Rafael Ruiz National Autonomist Party 29 April 1884 26 April 1886 Juan Serú National Autonomist Party 26 April 1886 4 May 1887 Estanislao Zeballos National Autonomist Party 4 May 1887 1 May 1888 Carlos Tagle National Autonomist Party 1 May 1888 4 May 1889 Tristán Malbrán National Autonomist Party 4 May 1889 28 April 1890 Benjamín Zorrilla National Autonomist Party 28 April 1890 1 May 1893 Francisco García National Autonomist Party 1 May 1893 26 April 1894 Francisco Alcobendas National Autonomist Party 26 April 1894 27 April 1896 Marco Aurelio Avellaneda National Autonomist Party 27 April 1896 15 June 1901 Benito Villanueva National Autonomist Party 15 June 1901 26 April 1904 Benjamín Victorica National Autonomist Party 26 April 1904 28 April 1905 Ángel Sastre National Autonomist Party 28 April 1905 26 April 1906 Alejandro Carbó National Autonomist Party 26 April 1906 29 April 1907 Juan Manuel Ortiz de Rosas National Autonomist Party 29 April 1907 1 May 1908 Eliseo Cantón National Autonomist Party 1 May 1908 13 May 1912 Rosendo Fraga National Autonomist Party 13 May 1912 25 April 1914 Marco Aurelio Avellaneda National Autonomist Party 25 April 1914 1 May 1915 Alejandro Carbó National Autonomist Party 1 May 1915 12 January 1916 Mariano Demaría National Autonomist Party 12 January 1916 10 April 1918 Fernando Saguier Radical Civic Union 10 April 1918 8 January 1919 Arturo Goyeneche Radical Civic Union 8 January 1919 26 April 1922 Ricardo Pereyra Radical Civic Union 26 April 1922 10 April 1924 Mario Guido Radical Civic Union 10 April 1924 6 April 1926 Miguel Sussini Antipersonalist UCR 6 April 1926 21 May 1928 Andrés Ferreyra Radical Civic Union 21 May 1928 6 September 1930 Congress closed during the dictatorship of José Félix Uriburu (1930–1932) Juan Cafferata National Democratic Party 20 January 1932 10 April 1934 Manuel Fresco National Democratic Party 10 April 1934 25 April 1936 Carlos Noel Radical Civic Union 25 April 1936 26 April 1938 Juan Gaudencio Kaiser National Democratic Party 26 April 1938 26 April 1940 Carlos Noel Radical Civic Union 26 April 1940 3 January 1941 José Luis Cantilo Radical Civic Union 3 January 1941 5 June 1943 Congress closed during the dictatorship of the Revolución del 43 (1943–1946) Ricardo Guardo Peronist Party 26 April 1946 26 April 1948 Héctor Cámpora Peronist Party 26 April 1948 25 April 1953 Antonio J. Benítez Peronist Party 23 April 1953 27 July 1955 Alberto Rocamora Peronist Party 27 July 1955 23 September 1955 Congress closed during the dictatorship of the Revolución Libertadora (1955–1958) Federico Fernández de Monjardín Intransigent UCR 31 March 1958 29 March 1962 Arturo Mor Roig Radical Civic Union 12 August 1963 28 June 1966 Congress closed during the dictatorship of the Revolución Argentina (1966–1973) Raúl Lastiri Justicialist Party 7 May 1973 7 July 1975 Nicasio Sánchez Toranzo Justicialist Party 7 July 1975 24 March 1976 Congress closed during the dictatorship of the National Reorganization Process (1976–1983) Juan Carlos Pugliese Radical Civic Union 29 November 1983 3 April 1989 Leopoldo Moreau Radical Civic Union 26 April 1989 6 July 1989 Alberto Pierri Justicialist Party 6 July 1989 1 December 1999 Rafael Pascual Radical Civic Union 1 December 1999 5 December 2001 Eduardo Camaño Justicialist Party 5 December 2001 6 December 2005 Alberto Balestrini Justicialist Party–FPV 6 December 2005 12 December 2007 Eduardo Fellner Justicialist Party–FPV 12 December 2007 6 December 2011 Julián Domínguez Justicialist Party–FPV 6 December 2011 4 December 2015 Emilio Monzó PRO–Cambiemos 4 December 2015 10 December 2019 Sergio Massa Renewal Front–FdT 10 December 2019 3 August 2022 Cecilia Moreau Renewal Front–FdT 3 August 2022 10 December 2023 Martín Menem UCEDE–LLA 10 December 2023 incumbent ==References==",
 "title": "President of the Argentine Chamber of Deputies"
}