{
 "id": "1192446",
 "text": "BBVA México S.A is a Mexican financial institution, a subsidiary of the Spanish bank Banco Bilbao Vizcaya Argentaria (BBVA), founded on October 15, 1932 as Banco de Comercio, and since 1977 known simply by the acronym Bancomer. In 2000, Bancomer was acquired by BBVA. In 2019, BBVA began a process of unifying its name worldwide and in 2020, the Bancomer brand was eliminated to be called simply BBVA. At the end of 2024, BBVA México was the largest financial group in the country, with a network of 1,691 branches and 14,439 ATMs distributed across the country's 32 states, and a 26.7% market share. On September 20, 2021, BBVA México announced the change of its corporate name. ==History== BBVA México, formerly Bancomer (Banco de Comercio), was founded in Mexico City in 1932 by Salvador Ugarte, Raul Bailleres, Liberto Senderos, Mario Dominguez, and Ernesto Amescua, with Ugarte holding about two-thirds of the shares. In 1977, one of the most significant changes for the institution took place. Banco de Comercio, its 34 affiliated banks, and some non-bank subsidiaries merged to form BANCOMER a commercial banking institution. In July 2000, the company changed its name to Grupo BBV Bancomer when Banco Bilbao Vizcaya, which had not yet merged with Argentaria (BBV), invested USD 1,400,000,000 through the merger of the BBV-Probursa financial group. BBV Bancomer became Mexico's largest financial institution in August 2000 when it acquired Banca Promex. In June 2002, Grupo Financiero BBVA Bancomer became a subsidiary of Banco Bilbao Vizcaya Argentaria (BBVA) as a result of the latter's acquisition of more than 51% of the Group's capital stock. In order to embark on a path to becoming the best bank in Mexico, the Client Project was implemented in 2002. In 2010, BBVA Bancomer launched the first mobile account for banking transactions from a mobile phone. On June 10, 2019, BBVA unified its brand worldwide, which is why BBVA Bancomer became BBVA México. == References == Category:Banks Category:BBVA",
 "title": "BBVA México"
}