{
 "id": "1192393",
 "text": "This page has a selected list of press headlines related to the Armenian genocide from newspaper archives. The sources before 1914 relate to the Adana massacre and the Hamidian massacres. Instead of \"genocide\", words like \"massacre\", \"killed\", \"murdered\", \"slaughtered\", \"systematic massacre\", \"extermination\", \"atrocities\", and \"war crimes\" were used back then, because Raphael Lemkin did not come up with the word \"genocide\" until 1943, when the Holocaust ‒ happening in Axis-occupied territories ‒ was still not known among Western public. * * ==List== The list also includes press coverage of the massacres before the Armenian genocide, including the Adana massacre and the Hamidian massacres. Such massacres are seen by scholars as the start of the attempted elimination of Armenians, which peaked in the Armenian genocide in 1915. * Vahakn N. Dadrian, The History of the Armenian Genocide: Ethnic Conflict from the Balkans to Anatolia to the Caucasus (Providence, RI, and Oxford: Berghahn Books, 1995) * * ===Hamidian massacres and pre–Young Turk Revolution=== ====1890==== * July 25, 1890, Los Angeles Times, \"Turkish Atrocities: Details of the Massacre at Erzeroum\" * July 26, 1890, The New York Times, \"The Erzeroum Massacre: Armenians slaughtered and the British Consulate stoned.\" * November 6, 1890, The New York Times, \"Cruelty of the Turks. Prof. Bryce Describes The Condition Of Armenia.\" ====1893==== * April 10, 1893, The Washington Post, \"Dungeons for Christians: Nearly 2,000 Armenians immured in Turkish prisons.\" * August 4, 1893, Los Angeles Times, \"The Armenians: Innocent Christians executed by the Ottoman Authorities.\" * October 20, 1893, Chicago Daily Tribune, \"Armenians murdered in Turkey: Hundreds of bodies thrown into the harbor of Constantinople.\" ====1894==== * November 17, 1894, The New York Times, \"Massacre of Armenians: Equals the Bulgarian Butcheries Which Led to War. Over Six Thousand Murdered\" * November 19, 1894, The Sydney Morning Herald, \"Terrible Atrocities In Armenia. Massacre By Turkish Troops. Thousands Of Inhabitants Slaughtered. Men, Women, And Children Butchered Without Mercy. Women Violated and Hacked To Pieces. Appalling Details.\" * November 20, 1894, The Age, \"The Massacres In Armenia. Cholera Bred By The Corpses Of Victims.\" * November 20, 1894, The Halifax Herald, \"Massacre of Armenians: Horrible tales of butchery perpetrated by Turks - Thousands were killed.\" * November 22, 1894, Chicago Daily Tribune, \"Armenian Massacres.\" * December 4, 1894, The Record-Union, \"Massacre of Armenians. Reports of the Terrible Atrocities in Asia Minor Confirmed\" * December 6, 1894, The Scranton Tribune, \"Those Armenian Atrocities.\" * December 7, 1894, Bismarck Weekly Tribune, \"Armenian Refugees.\" * December 17, 1894, Boston Evening Transcript, \"Those Armenian Massacres.\" ====1895==== * January 14, 1895, The New York Times, \"The Worst Was Not Told; Armenian Massacres Described by the Rev. George H. Filian. Horrible Atrocities Of The Kurds. Still More Revolting Cruelties Prophesied -- Turkey's Denials Declared to be False -- Future of Armenia.\" * January 16, 1895, The New York Times, \"Kurds and Christians, Some of the Oppressions and Cruelties in Times of Peace\" * February 3, 1895, Los Angeles Herald, \"Red Horrors in Sassoun. The Atrocities in Armenia Not Exaggerated.\" * February 28, 1895, The Halifax Herald, \"Horrible Massacres: Treacherous Turkish troops murder 360 Armenians of all ages and both sexes.\" * March 16, 1895, The New York Times, \"Persecution of the Armenians\" * March 16, 1895, The New York Times, \"Kurdish Fiendish Cruelty\" * March 25, 1895, The New York Times, \"Eight Thousand Butchered: The horrors of the Armenian massacres only just beginning to be realized by the World.\" * May 29, 1895, Los Angeles Times, \"The Armenian Horrors.\" * June 13, 1895, The Halifax Herald, \"Turkish Atrocities: Pitiful stories of pillage, burning, torture and murder.\" * August 5, 1895, L'Univers Illustre, \"A hanged Armenian, Constantinople\" * September 5, 1895, The New York Times, \"Rustem Pasha Moved to Tears\" * September 10, 1895, The New York Times, \"Another Armenian Holocaust, Five Villages Burned, Five Thousand Persons Made Homeless, and Anti-Christians Organized\" * September 10, 1895, Brooklyn Daily Eagle, \"The Armenian Outrages\" * September 13, 1895, Le Petit Journal, \"Armenian Massacre in Constantinople: The gathering of the corpses of victims, streets of Galata\" * October 5, 1895, The Salt Lake Herald, \"The Scenes in the Churches. They Are Heartrending and Deplorable in the Extreme. The Armenian Atrocities. American Sympathy is Badly Needed\" * October 27, 1895, Il Secolo Illustrato, \"Armenian Massacre in Constantinople\" * November 17, 1895, Sunday Herald, \"Armenians Murdered. Under Turkey's Auspices 5,000 More Have Been Slaughtered.\" * November 17, 1895, Il Secolo Illustrato, \"The Red Sultan\" * November 19, 1895, The San Francisco Call, \"Shocking Crimes of the Terrible Turk\" * November 29, 1895, Vermont Phoenix, \"Armenian Atrocities Still Continue\" * December 4, 1895, The Chenango Semi-Weekly Telegraph, \"Two More Massacres. Thousands of Armenians Murdered at Marash\" * December 14, 1895, Harpers Weekly, \"The Armenian Massacres-Burying the Victims\" ====1896==== * 1896, Le Musée de Sires, \"Abdul Hamid II, The Red Sultan\" * January 25, 1896, Salt Lake Herald, \"Armenia Massacres\" * February 12, 1896, Staunton Spectator, \"Armenian Atrocities\" * February 24, 1896, The Los Angeles Herald, \"The Armenian Atrocities. Not Ended by Labors of the Commission. A Farcical Investigation. Consisting Simply of a Threat of Extermination. The Armenians Are Impoverished - Hunger and Cold May Finish the Work Begun With the Sword.\" * May 20, 1896, The Sydney Morning Herald, \"The Armenian Massacres. Horrible Details. Eight Thousand Butchered. Three Thousand Roasted Alive.\" * May 23, 1896, The Sydney Mail, \"The Armenian Massacres. Horrible Details.\" * August 29, 1896, Brooklyn Daily Eagle, \"Details Of The Massacre\" * August 30, 1896, The Philadelphia Record, \"Turkey Must Explain. Peace of Europe Menaced by the Sultan's Armenian Policy.\" * October 24, 1896, Brooklyn Daily Eagle, \"Killing of Armenians\" ====1897==== * March 14, 1897, La Libre Parole,\"New massacres in Armenia\", page 1. * March 27, 1897, The Sydney Morning Herald, \"Armenian Massacres. Apathy Of The Turkish Authorities\", page 5. * April 3, 1897, The Sydney Mail, \"More Armenian Massacres.\", page 7. * May 29, 1897, Le Rire, \"Abdul Hamid II, The Red Sultan\", page 1. ====1898==== * August 5, 1898, The Glasgow Herald, \"The Armenian Massacres\", page 9. ====1900==== * January 19, 1900, The Nebraska Advertiser, \"More Armenian Massacres. Some Fugitives of 1895 Return to Turkey and Bloodshed Speedily Follows.\", page 7. * February 2, 1900, Boston Evening Transcript, \"General Massacre Feared. Terror Among Christians in Turkey\", page 12. * February 2, 1900, The Meriden Daily Journal, Connecticut, \"Another Massacre Plans of Turks\", page 1. * August 10, 1900, The St. Louis Republic, \"Massacre of Armenians By Order of A Turk. Two Hundred Men, Women and Children in the Sassun District Slaughtered by Kurds-Town to be Burned.\", page 1. * August 10, 1900, New York Tribune, \"More Armenians Killed.\", page 9 * August 17, 1900, The McCook Tribune, \"More Armenian Massacres.\", page 7. * October 21, 1900, The New York Times, \"Awful Armenian Massacres. Mussulmans Pillage, Outrage, and Murder Unchecked for Five Days-Eight Villages Destroyed.\" * October 21, 1900, Chicago Daily Tribune, \"Frightful massacres of Armenians occurred in the district of Diarbekir.\" ====1901==== * August 30, 1901, The San Francisco Call, \"Kurds Will Continue to Massacre Armenians\" * August 30, 1901, The Norfolk Weekly News-Journal, \"Exterminating the Armenians\" * September 6, 1901, The McCook Tribune, \"System of Extermination. Turks Begin Once More of Massacre Armenians.\" * December 14, 1901, The New York Times, \"Armenian Massacres Feared. Report of American Board Says Repetition of Slaughter of 1894 Is Likely.\" ====1902==== * April 16, 1902, The Jennings Daily Record, \"Armenians Massacred\" ====1903==== * April 29, 1903, The Spokane Press, \"Sultan Again Orders Armenian Massacre\" * April 29, 1903, The Washington Times, \"Sultan Orders Massacres.\" * April 29, 1903, The Daily Journal, \"Sultan's Counter Irritant. Killing Armenians Would Detract Attention. Kurds Attack Armenians who Flee Across Russian Border and Turks Fight Cossacks\" * May 1, 1903, The Stark County Democrat, \"Sultan Issues Bloody Edict. Instructs His Allies to Renew, the Armenian Massacres, Which Shocked the World a Few Years Ago-Murderous Engagement.\" * May 4, 1903, Aberdeen Herald, \"Sultan Said to Have Ordered Massacre of Christians in Armenia.\" * November 13, 1903, Baltimore Morning Herald, \"Armenian Band Was Slaughterd By Turks\" * November 13, 1903, Spokane Daily Chronicle, \"Butchery in Cold Blood\" ====1904==== * May 9, 1904, The St. Louis Republic, \"Call on America to Aid Armenians. Turkish Policy is Cruelty. Extermination of His Christian Subjects the Sultan's Deliberately Chosen Way of Settling Troubles.\" * May 13, 1904, The Day, \"Turks Wipe Out Armenians. Troops Have Practically Exterminated All in Mountainous Sassoun\" * May 13, 1904, The Lewiston Daily Sun, \"Turkish Atrocities. Villages Burned and People Killed in Sassoun\" * May 13, 1904, The Deseret News, \"Reports of Turkish Atrocities Confirmed\" * May 13, 1904, The Tacoma Times, \"Armenians Killed.\" * May 14, 1904, Atlanta Constitution, \"Turk's Sword Red With Blood\" * May 14, 1904, The Washington Post, \"Sassoun Armenians practically exterminated by the Turks\" * May 14, 1904, The Paducah Sun, \"Many Armenians Killed by Turks\" * May 19, 1904, The Weekly Guernsey Times, \"Exterminating Armenians.\" * May 29, 1904, Chicago Daily Tribune, \"Turks said to have destroyed forty-three villages and massacred the inhabitants\" * June 9, 1904, The New York Times, \"France Warns Turkey.; Atrocities in Armenia Must Stop - Delcasse Tells of Investigation.\" * June 13, 1904, The Spokane Press, \"2000 Armenians Are Massacred\" * June 16, 1904, Mansfield Daily Shield, \"3,000 Armenians Murdered by The Turks.\" * June 30, 1904, The Montreal Gazette, \"Armenian Massacres. Terrible Atrocities Committed By Turkish Soldiers\" * July 4, 1904, The New York Times, \"General Armenian Massacre. Is Reported to Have Begun in Van Province -- Travelers Slain.\" * July 6, 1904, The Minneapolis Journal, \"Roosevelt May Aid Armenians. Steps to Prevent Further Massacres Considered—Cranks Threaten President.\" * July 25, 1904, The Spokane Press, \"Armenians Are Massacred By The Wholesale\" * August 3, 1904, The Star, \"More Armenians Massacred\" ====1906==== * May 11, 1906, The Hawaiian Gazette, \"Armenians Killed By Turks.\" ====1907==== * November 26, 1907, The Marion Daily Mirror, \"Armenians Massacred Villages Are Burned\" * November 29, 1907, The Sydney Morning Herald, \"Armenian Massacres Renewed. Ibrahim Pasha Active.\" ===Adana Massacre=== ====1909==== * April 21, 1909, The New York Times, \"Moslem Massacres Take 5,000 Lives\" * April 21, 1909, The Wayne County Democrat, \"Kill Christians In Asiatic Turkey. Town is Burned and Soldiers are Powerless to Stop Slaughtering of Armenians.\" * April 22, 1909, Oakland Tribune, \"Women and Children are Burned Alive\" * April 23, 1909, The New York Times, \"American Women in Peril at Hadjin\" * April 25, 1909, The New York Times, \"30,000 Killed in Massacres; Conservative Estimate of Victims of Turkish Fanaticism in Adana Vilayet.\" * April 25, 1909, The Pensacola Journal, \"30,000 Killed in Armenian Massacres\" * April 25, 1909, Bismarck Daily Tribune, \"30,000 is Estimate of Killed in Massacres\" * April 26, 1909, Sydney Morning Herald, \"Armenian Massacres.\" * April 29, 1909, The Evening Statesman, \"Fearful Massacres In Turkey Continue\" * May 2, 1909, Le Pelerin, \"Armenian Massacres, Adana, 1909\" * May 2, 1909, Le Petit Journal, \"Massacres of Christians in Turkey \" * May 5, 1909, The Pensacola Journal, \"Entire Population Armenian Village Massacred by Turks * May 16–23, 1909, La Domenica Del Corriere, \"Massacres in the Eastern Turkey: thousands of Armenians were burnt alive by Turks near the Catholic Church in Adana\" * July 14, 1909, Christian Herald, \"Sorting Clothing in the Gregorian Church, for the Destitute Armenians\" * July 18, 1909, Journal des Voyages, \"Massacres in Asia Minor, Adana, 1909\" * August 22, 1909, The New York Times, \"The Slaughter of Christians in Asia Minor\" ====1912==== * September 9, 1912, El Paso Herald, \"Armenians Are Being Massacred By Kurds\" ===Armenian genocide=== ====1913==== * January, 1913, The Living Age, \"The Peril of Armenia \" * July 5, 1913, The Literary Digest, \"Young Turks' Misrule In Armenia \" ====1914==== * November 12, 1914, The New York Times, \"Report Christians Peril in Turkey\" ====1915==== ;January * January 11, 1915, The New York Times, \"Says Turks Advice Christians To Flee: Fear of General Massacre in Constantinople if Allied Fleet Passes Dardanelles.\" * January 13, 1915, The New York Times, \"Christians in Great Peril\" * January 30, 1915, Goulburn Evening Penny Post, \"Armenian Massacres ;March * March 20, 1915, The New York Times, \"Whole Plain Strewn by Armenian Bodies\" ;April * April 26, 1915, The Cleveland Leader, \"Kurds' Christian Massacre Grows. Village of 800 Armenians Is Wiped Out; Ten Others Attacked.\" * April 28, 1915, Atalanta Constitution, \"Massacre Continues in Turkish Armenia\" * April 28, 1915, Atlanta Constitution, \"United States Urged to Save Armenians\" * April 28, 1915, The New York Times, \"Appeal to Turkey to Stop Massacres\" image * April 29, 1915, The New York Times, \"Turkey Bars Red Cross: Will Not Permit America to Aid Armenian Sufferers \" ;May * May 10, 1915, St. Paul Pioneer Press, \"Armenians Appeal to Wilson for Aid \" * May 17, 1915, The Ogden Standard, \"Armenians At Van Massacred\" * May 18, 1915, The New York Times, \"6,000 Armenians Killed\" * May 18, 1915, Richmond Times-Dispatch, \"Armenians Massacred\" * May 24, 1915, The New York Times, \"Allies To Punish Turks Who Murder\" * May 25, 1915, Zeehan and Dunas Herald, \"The Armenian Massacres: The Blame Laid on Armenia. All Able-bodied Men Killed. Whole Villages Devastated\" * May 25, 1915, Northern Star, \"Armenian Atrocities: Shocking Carnage in Armenia\" ;July * July 12, 1915, The New York Times, \"Turks Are Evicting Native Christians\" * July 29, 1915, The Times, \"Reported Massacres In Armenia\" * July 29, 1915, The New York Times, \"Wholesale Massacres Of Armenians By Turks\" ;August * August 4, 1915, The New York Times, \"Report Turks Shot Women and Children, Nine Thousand Armenians Massacred and Thrown Into Tigris, Socialist Committee Hears\" * August 6, 1915, The New York Times, \"Armenian Horrors Grow: Massacre Greater Than Under Abdul Hamid, London Paper Says\" * August 10, 1915, The New York Times, \"Slay All Armenians In City Of Kerasunt. Turks Wipe Out Entire Population in Town on the Black Sea\" * August 17, 1915, The Times, \"Armenians Expelled\" * August 18, 1915, The New York Times, \"Armenians are Sent to Perish in Desert: Turks Accused of Plan to Exterminate Whole Population-People of Karahissar Massacred.\" * August 20, 1915, The New York Times, \"Burn 1,000 Armenians: Turks lock them in Wooden Building and Then Apply the Torch.\" * August 25, 1915, The New York Times, \"Turks' Sop to Armenians, Sublime Porte Promises Not to Deport 10 Per Cent. of Them\" * August 25, 1915, The New York Times, \"Turks Depopulate Towns of Armenia. Traveler Reports Christians of Great Territory Have Been Driven from Homes. 600,000 Starving On Road\" ;September * September 5, 1915, The New York Times, \"1,500,000 Armenians Starve \" * September 7, 1915, Saint Paul Pioneer Press, \"Save The Armenians \" * September 13, 1915, Duluth News Tribune, \"Armenian Girls Sold in Turkish Capital \" * September 14, 1915, The New York Times, \"Defense Committee Corners Supplies\" * September 16, 1915, The New York Times, \"Answer Morgenthau by Hanging Armenians, He Protests Against the War of Extermination Now in Progress\" * September 21, 1915, The New York Times, \"Bryce Asks Us To Aid Armenia.; Says That All the Christians in Trebizond, Numbering 10,000, Were Drowned. Women Seized For Harems. Only Power That Can Stop the Massacres Is Germany, and We Might Persuade Her to Act.\" * September 23, 1915, The Winona Independent, \"Bringing Armenians to America \" * September 23, 1915, The Evening Independent, \"Slaughtering Of Armenians By The Thousand. Official Reports That Half A Million Have Been Killed By The Turks. Uncle Sam Appealed To Saved Doomed People.\" * September 23, 1915, The Mercury, \"Turkish Atrocities. Systematic Slaughter Of Armenians. Half-a-Million Killed. Roads Strewn With Corpses. Ten Thousand Drowned.\" * September 24, 1915, The Duluth Herald, \"Half Million Armenians Put to Death in Turkey \" * September 24, 1915, The New York Times, \"500,000 Armenians Said to Have Been Perished\" image * September 25, 1915, The Glasgow Herald, \"Armenian Massacres. Turkey's Extermination Policy. A Tale Of Horror.\" * September 25, 1915, The New York Times, \"Says Extinction Menaces Armenia; Dr. Gabriel Tells of More Than 450,000 Killed in Recent Massacres. 600,000 Driven Into Exile. Unless Neutral Powers Intervene, Says Nubar Pasha, Almost the Whole People Is Doomed.\" * September 27, 1915, The Independent, \"The Depopulation of Armenia\" * September 27, 1915, The Superior News Tribune, \"Turkish Officials Promote Massacres \" * September 27, 1915, Los Angeles Times, \"Massacre of Armenians at Height of its Fury.: Confirmation of Slaughter is Received by Prof. Dutton; Report States Five Hundred Thousand Men, Women and Children Have Either been Killed by the Turks or Driven to the Desert to Perish of Starvation--Extermination of Non- Moslems is Programme Decided Upon.\" * September 27, 1915, The New York Times, \"Tales of Armenian Horrors Confirmed: Committee on Atrocities says 500,000 Victims Have Suffered Already.\" * September 27, 1915, The Sun, \"500,000 Armenians Slain in 6 Months.\" * September 27, 1915, The Independent, \"The Depopulation of Armenia\" * September 28, 1915, Goulburn Evening Penny Post, \"Armenian Massacres\" * September 28, 1915, The Horsham Times, \"Massacres of Armenians. Incredible Cruelty.\" * September 28, 1915, Kerang New Times, \"Armenia Devastated By Turks. Fearful Stories Of Atrocities.\" * September 29, 1915, The Toronto World, \"Armenian Atrocities Increase In Horror. Ottoman Government's Program to Extirpate Christians in Dominions\" * September 29, 1915, The Outlook, \"The Turkish Atrocities in Armenia \" * September 29, 1915, The New York Times, \"Armenian Women Put Up At Auction\" * September 30, 1915, St. Paul Pioneer Press, \"Pathetic Armenia. * September 30, 1915, The New York Times, \"Armenian Officials Murdered By Turks \" ;October * October 1, 1915, The Washington Herald, \"Will Ask U.S. Aid for Suffering Armenians. Details of Atrocities to Be Made Public Monday to Bring Government Intervention.\" * October 2, 1915, Survey Magazine, \"Annihilation of All Armenians Threatened\" * October 4, 1915, The New York Times, \"Tell of Horrors Done in Armenia\" * October 4, 1915, Duluth News Tribune, \"Evidence Portrays Turks as Butchers \" * October 4, 1915, Duluth News Tribune, \"Speaking To Him About It \" * October 5, 1915, The Minneapolis Journal, \"A Word To Turkey \" * October 5, 1915, Springfield Republican, \"Turkey is Warned. Friend in Danger. Unless Massacres Stop.\" * October 5, 1915, The Duluth Herald, \"Holy War is on in Turkey: Turks and Kurds Determined to Exterminate all Armenians \" * October 5, 1915, The Pittsburgh Press, \"United States Urges Turkey To Put An End To Armenian Massacres\" * October 5, 1915, Easton Free Press, \"United States Acts On Turks' Atrocities. Warns Porte That Armenian Massacres Must Cease\" * October 6, 1915, Keowee Courier, \"Turkish Atrocities Menace\" * October 7, 1915, The New York Times, \"Already Has $75,000 to Help Armenians\" * October 7, 1915, The New York Times, \"800,000 Armenians Counted Destroyed\" * October 8, 1915 The Ballarat Courier, \"Armenian Atrocities: Doctors and Nurses Required\" * October 8, 1915, Dutch Herald, \"Massacre of Armenians \" * October 8, 1915, St. Paul Pioneer Press, \"Vigorous Measures. \" * October 9, 1915, The Literary Digest, \"Exterminating the Armenians \" * October 10, 1915, The New York Times, \"Turkish Statesman Denounces Atrocities\" * October 10, 1915, Duluth News Tribune \"Christians Slain; Mission Burned in Turks' Empire \" * October 11, 1915, The Duluth Herald, \"Will Protest The Armenian Murders \" * October 12, 1915, Easton Free Press, \"Armenian Massacres Renewed With Vigor.\" * October 13, 1915, Rochester Daily Post and Record, \"The Armenian Massacres \" * October 13, 1915, The Gazette Times, \"Turks Renew Brutal Killing Of Armenians\" * October 13, 1915, Duluth Weekly Herald, \"Turks Renew Massacres \" * October 13, 1915, Duluth News Tribune, \"Tells of Further Atrocities by Turks \" * October 13, 1915, Los Angeles Times, \"Gives Details of Massacres: American Committee Receives News from Armenia; Convicts are Turned Loose to Murder People; Thousands of Victims are Killed on Highways.\" * October 14, 1915, Toledo Blade, \"Armenian Massacres Renewed By The Turks. Morgenthau Reports Majority Has Been Slain.\" * October 15, 1915, Los Angeles Times, \"Ask Wilson to Stop Armenian Massacres: Resolutions of Laymen's Missionary Movement Request President to Act-Rev. Ernest Partridge of Sivas, Turkey, Tells Delegates 800,000 Persons have been Killed and that Whole Race will be Wiped Out\" * October 17, 1915, Duluth News Tribune, \"Armenian Refugees in Pitiable Condition; Thousands Need Aid \" * October 18, 1915, The New York Times, \"Thousands Protest Armenian Murders\" * October 18, 1915, Iskri Newspaper, \"Tortured Armenian woman with her child\" * October 18, 1915, The Independent, \"The Assassination of a Race\" * October 22, 1915, The New York Times, \"Only 200,000 Armenians Now Left in Turkey; More Than 1,000,000 Killed, Enslaved or Exiled, Says a Tiflis Paper.\" * October 22, 1915, The Daily Star, \"Turks Boiled Baby Alive. Made Armenian Mother Heat Water, Bound Her and Took Child's Life.\" * October 22, 1915, The Washington Herald, \"Armenians In Turkey Almost Exterminated\" * October 23, 1915, Duluth News Tribune, \"Turkish Officials Show No Interest: German Governments Makes Efforts to Alleviate Alleged Atrocities Upon Armenians \" * October 23, 1915, Honolulu Star Bulletin, \"Wave of Indignation Sweeping Over States at Turk Atrocities. Threatened Annihilation of Armenians Causes Outbursts of Sympathy\" * October 23, 1915, La Rire Rouge, \"Armenian Massacres\" * October 26, 1915, Duluth News Tribune, \"Turks Continue Barbarous Work: Kill Armenians \" * October 26, 1915, Cornell Daily Sun, \"Atrocities Include Horseshoeing Bishop. Turks Reported to Have Committed Terrible Massacres in Armenia. Women Horribly Treated. Tied to Carts and Exposed to Hunger and Weather-Suspect German Influence\" * October 27, 1915, Weekly Journal-Miner, \"Terrible Turks at Old Game of Butchery. Unspeakable Atrocities Inflicted on Armenians, According to Prisoner's Story\" ;November * November 1, 1915, The New York Times, \"Aid For Armenians Blocked By Turkey,\" * November 27, 1915, Christian Science Monitor, \"Further Details of Armenian Atrocities Given. Lord Bryce Affirms Additional Evidence Surpasses in Horror Previous Statements.\" * November 27, 1915, Springfield Republican, \"Fiends' Work. Armenian Horror. Told By Lord Bryce.\" * November 29, 1915, Warwick Examiner and Times, \"Armenian Atrocities: Unparalleled Savagery\" * November 29, 1915, The Argus, \"Armenians. Half a Million Killed. Blood-Curdling Horrors\" ;December * December 3, 1915, The Border Morning Mail and Riverina Times, \"Armenian Atrocities: Bishops Murdered\" * December 12, 1915, Le Petit Journal, \"The Massacres of Armenia\" * December 12, 1915, The New York Times, \"Woman Describes Armenian Killings: German Missionary Says Turks Proclaimed Extermination as Their Aim.\" * December 15, 1915, The New York Times, \"Million Armenians Killed or in Exile\" * December 18, 1915, The Bathurst Times, \"Armenian Atrocities: Ghastly Stories\" * December 19, 1915, The Washington Herald, \"The Massacre of a Nation. All of the Horrors, Tortures and Barbarities of History Surpassed in List of Cruelties Practiced by Turks on Defenseless Armenians.\" ====1916==== * January 17, 1916, Warwick Examiner and Times, \"Armenian Atrocities: Brutal Massacre by Turks.\" * January 26, 1916 The New York Times, \"Bryce Asks America To Succor Armenians. Refugees Will Starve If Not Quickly Fed-Page To Inform Washington\" * January 29, 1916, Bisbee Daily Review, \"U.S. Council and Wife Save Thousands Of Armenians\" * February 5, 1916, The New Age, \"The Murder of Armenia\" * February 6, 1916, The Sun, \"American Consul Who Saved Thousands Of Armenians In Syria\" * February 6, 1916, The New York Times, \"Saw Armenians Go Starving to Exile\" * February 14, 1916, Honolulu Star-Bulletin, \"Armenian Massacres Again Reported\" * February 21, 1916, The Ballarat Courier, \"Armenian Atrocities: America Warns Turkey\" * May 6, 1916, Le Matin, \"The Turkish Atrocities: The Infants Were Thrown into the Sea, Men were Shot in Packs \" * June 6, 1916, Youngstown Vindicator, \"Tortured Armenians Cry For American Mandatory\" * June 30, 1916, Excelsior, \"The symbol of the protection of Armenians by Russians\" * July 5, 1916, Outlook Magazine, \"Turkey's Treatment of the Armenians\" * July 12, 1916, The New York Times, \"Turks are Evicting Native Christians: Greeks and Armenians Driven From Homes and Converted by the Sword, Assert Americans\" * August 21, 1916, The New York Times, \"Armenians Dying in Prison Camps. Hundreds of Thousands Still in Danger from Turks, Refugee Fund Secretary Says\" * October 4, 1916, The Spokesman-Review, \"Ask $5,000,000 For Armenians. Report Declares There Are 1.000,000 Destitute in That Country and Syria. Many Have Been Killed.\" * October 4, 1916, The Atlanta Constitution, \"1,000,000 People Dying of Hunger. Campaign Launched in the United States to Relieve Armenians and Syrians. Stories of Suffering Beggar Belief.\" * October 4, 1916, The Day, \"Half Armenia's People Slain; Ask Aid For Rest\" * October 25, 1916, The Kosciusko Union, \"Americans Pay Thousands For Relief of Armenians\" * October 1916, The Missionary Review of the World, \"Signs of Death in Turkey\" * November, 1916, The Atlantic Monthly, \"The Calvary of a Nation \" * November 11, 1916, Literary Digest, \"Why the Armenians Were Killed \" * November 12, 1916, The New York Times, \"Armenian Horrors Seen by Germans: Documents in Possession of the French Government Give Details of Atrocities.\" * November 12, 1916, The New York Times, \"Halil Bey's Admissions: Turkey Planned to Exterminate the Armenian Race. * November 27, 1916, \"Armjanski vestnik, \"The corpses of Armenians\" * December 3, 1916, Los Angeles Times, \"Fresh Horrors of Armenian Massacres Reported From Asiatic Turkey.\" ====1917==== * January 1, 1917, The New York Times, \"Saw Armenians Burned Alive: So Says Mussulman, Who Tells of Ravines Full of Dead.\" * January 27, 1917, The New Republic, \"Massacre by Decree \" * February 26, 1917, The Sydney Morning Herald, \"Armenians Massacres.\" * June 23, 1917, The Independent, \"Must Armenia Perish? \" * September 30, 1917, The Troy Sunday Budget, \"Armenians Are Slain With Axes. An Eye-Witness to Massacres Tells a Story of the Horrors Committed by Turks.\" * September 30, 1917, The New York Times, \"ARMENIANS KILLED WITH AXES BY TURKS; Members of Faculty of Anatolia College Among More Than 1,200 Slain at Marsovan. ONE OF MANY MASSACRES Story of Ferocity Told by President of College, an Eyewitness of the Marsovan Horrors.\" * September 30, 1917,The Spokesman-Review, \"Armenians Led To Slaughter. Anatolia College Head, Recently Returned, Relates Seizing of Students and Faculty. Sold Girls To Slavery. Turks Aimed to End Armenian Question by Wiping Out Out These People.\" * September 30, 1917, Los Angeles Times, \"Turk Murders Defy Relation.: Minister from Front Tells of War Atrocities; Clothing of Children is Prize for Death; Sufferings in Armenia are Vividly Told.\" * October 18, 1917, Cornell Daily Sun, \"Turks Bury Armenian Babies Alive in Work of Extermination. Rev. Henry H. Riggs, Missionary Worker, Tells of Wholesale Method of Murder. Pictures Prove Tales. German's Ally Seems Intent on Entire Extinction of the Armenians. Skeletons Cover Desert. Story of Deportation from Turkey One of Unbelievable Cruelty.\" * November 1917: The New York Times - Current History \"Armenians Killed with Axes by Kurds\" ====1918==== * January 27, 1918, The Sun, \"Effort To Wipe Out Nation Described in a Sensational Book By German War Correspondent\" * March, 1918, The Red Cross Magazine, \"“The greatest horror in History”- Henry Morgenthau \" * March 21, 1918, The Mineral Country Press, \"The Horrors of Aleppo\" * April 28, 1918, New York Tribune, \"Armenians in Fear Of Extermination\" * August, 1918, The World's Work, \"Ambassador Morgenthau’s story\" * October, 1918, The World's Work, \"Turkish barbarism toward hostages\" ====1919==== * January 2, 1919, Le Petite Parisien, \"The review of “Little Parisian” on Armenian massacres: 1.5 million Victims\" * January 6, 1919, Port Pirie Recorder, \"The Armenian Massacre: 50 Percent of People Killed\" * January 11, 1919, The Colville Examiner, \"The Horrors of Aleppo\" * February 12, 1919, The New York Times, \"Turkish Trials Begin. Governor of Diarbekir First to be Arraigned for Massacres\" * February 15, 1919, Le Feu, \"Pour L'Armenie\" * April 14, 1919, The New York Times, \"Turks Hang Kemal Bey for Armenian Massacres.\" * June 1, 1919, The New York Times, \"Armenian Girls Tell of Massacres. Escaped Victims of Turkish and Circassian Cruelty Recount Their Experience. Held Naked and Starving. Hundreds Slaughtered with Clubs as Parties Up to 5,000 Were Taken to Syrian Desert.\" * June 7, 1919, The New York Times, \"Reports Asia Minor Looking to America\" * June 27, 1919, New York Tribune, \"Another Chapter In Germany's Confession of Turkish Guilt\" * July 13, 1919, New York Tribune, \"Germany Confesses in a Secret Record Her Turkish Partner's Crimes in Armenia\" * July 31, 1919, The Brisbee Daily Review, \"Turks Marching Upon Armenians On Three Sides; U.S. Powerless to Render Help. American Relief Cut Off, Fear Extermination of the Entire Armenian Nation, For Which U.S. Is Potential Mandatory\" * August, 1919, The National Geographic, \"Between Massacres in Van \" * October 1, 1919, New York Tribune, \"Turks Slaying All Armenians, Senate Is Told. State Department Declares Whole Nation Will Be Gone in Month Unless Congress Sends Troops.\" * November, 1919, National Geographic, \"The Land of the Stalking Death \" * December 19, 1919, The Maui News, \"Armenians May Be Exterminated If U.S. Refuses Help\" * December 19, 1919, Holt County Sentinel, \"How Armenians Are Held Back By Fate\" ====1920==== * January 4, 1920, The Minneapolis Journal, \"First Victim of Turk Assassins Arrives in City \" * February 14, 1920, The Toledo News-Bee, \"2000 Armenians Murdered\" * February 17, 1920, The Minneapolis Morning Tribune, \"Attack Still in Progress \" * February 28, 1920, The Independent, \"Shall Armenia Perish?\" by Henry Morgenthau, Sr. * February 29, 1920, Bisbee Daily Review, \"Armenians Die By Thousands In Massacres\" * March 1, 1920, The Pittsburgh Press, \"10,000 Armenians Are Murdered by Turks in Cilicia\" * March 8, 1920, Jerusalem News, \"Reuters Telegrams \" * March 8, 1920, The Toronto World, \"Allies Notify Turkey Armenian Massacres Must Stop\" * April 17, 1920, The Pittsburgh Press, \"Armenian Massacres Renewed By Turks\" * September 5, 1920, The Washington Times, \"How Science Cleansed Her of the Cruel Turk's Brand of Shame\" ====1921==== * June 4, 1921, The Sydney Morning Herald, \"Million Perished. What Armenia Suffered.\" * November 23, 1921, The Minneapolis Journal, \"Girl- Slave of Turks Who Found Refuge in City Now Finds Happiness as Bride \" ====1922==== * February 25, 1922, Literary Digest, \"Armenia's Tragic Finish\" * October, 1922, The New York Times, \"Crimes of Turkish Misrule\" * November 28, 1922, St. Petersburg Times, \"The Terrible Turk\" ==Related pages== * The Holocaust * Rwandan genocide * Cambodian genocide * Late Ottoman genocides * Armenian genocide denial ==Footnotes== ==References== Category:Journalism Category:20th century Category:Armenian Genocide Category:History of the United States Category:History of the United Kingdom",
 "title": "Press coverage of the Armenian genocide"
}