{
 "id": "1192045",
 "text": "Tara Basro (born June 11, 1990) is an Indonesian actress and model. She started her career in modeling by becoming a finalist in the 2005 GADIS Sampul selection. == Early life == Tara was born in Jakarta on June 11, 1990. She completed her education in Australia for 4 years. In 2009, Tara studied at Bina Nusantara University, majoring in Management, but she submitted her resignation. == Career == In 2011, Tara appeared as Putri in her first film titled Catatan (Harian) Si Boy. The following year, Tara appeared in an omnibus horror film Hi5teria. In 2013, Tara starred in Make Money with Pandji Pragiwaksono. Tara starred in four films in 2014, namely the omnibus family film Princess, Pirates and Alien, the English-language romantic drama The Right One, the Indonesian-Japanese thriller Killers, and the martial arts film Pendekar Tongkat Emas. In 2015, Tara won the Best Actress award at the 2015 Indonesian Film Festival for her role as Sari in Joko Anwar's A Copy of My Mind == Filmography == Year Title Role Notes 2011 Catatan (Harian) Si Boy Putri Debut work 2012 Hi5teria Sari Segmen: Pasar Setan 2013 Make Money Imelda 2014 Princess, Bajak Laut & Alien Ibu Kei Killers Dewi The Right One Alice Pendekar Tongkat Emas Gerhana 2015 Another Trip to the Moon Asa Filosofi Kopi Asisten pengusaha 2016 A Copy of My Mind Sari 3 Srikandi Kusuma Wardhani Ini Kisah Tiga Dara Ella 2017 Flutter Echoes and Notes Concerning Nature Pengebun gerilya Documenter Pengabdi Setan Rini Suwono 2018 Hoax Ade 2019 Gundala Sedhah Esti Wulan Perempuan Tanah Jahanam Maya Setiawati 2022 Pengabdi Setan 2: Communion Rini Suwono == Awards and nominations == Year Awards Category Nominated works Results 2012 Indonesian Movie Actors Awards Aktris Pendatang Baru Terbaik Catatan (Harian) Si Boy Aktris Pendatang Baru Terfavorit 2015 Festival Film Indonesia Pemeran Utama Wanita Terbaik A Copy of My Mind 2016 Indonesian Movie Actors Awards Pemeran Utama Wanita Terbaik Pemeran Utama Wanita Terfavorit Usmar Ismail Awards Pemeran Utama Wanita Terbaik 2017 Festival Film Tempo Aktris Utama Pilihan Pengabdi Setan 2020 Festival Film Indonesia Pemeran Utama Wanita Terbaik Perempuan Tanah Jahanam Indonesian Box Office Movie Awards 2022 Festival Film Wartawan Indonesia Aktris Utama Terbaik - Genre Film Horor Pengabdi Setan 2: Communion == References == == External Links == * Tara Basro in IMDB * https://id.wikipedia.org/wiki/Tara_Basro Category:1990 births Category:Living people Category:Indonesian actors",
 "title": "Tara Basro"
}