{
 "id": "1192482",
 "text": "Loretta Caravette (born October 1, 1956), known by her pen name J.B. Frank, is an American television producer, literary agent, and children's author. == Early life == Frank was born in Chicago, Illinois. She was the third of fourteen siblings and grew up in a small bungalow on the city's Northwest Side. Encouraged by her father, who organized summer contests in storytelling and poetry, she developed a love for writing at a young age. One of these contests led her to write a story about an alien, earning her a pen as a prize, an experience she later credited as the spark for her passion for storytelling. She earned her MFA in writing for children and young adults from Hamline University. == Career == Frank spent over two decades working in television production, specializing in children's programming and documentaries. She produced various programs, including Ruth Page, Once Upon a Dancer, for which she won an Emmy Award. She also received a CINE Award for producing the ABC Afterschool Special Love Hurts and was nominated for a National Emmy for the music program Rhythm and Jam. After her television career, Frank transitioned into the publishing industry. She co-founded Sadler-Caravette Children's Literary, an agency representing children's book authors and illustrators. She later founded LR Children's Literary, focusing on middle-grade fiction, early readers, and picture books. Her interests include historical fiction and humor in children's literature. Her published books include: * Somewhere in the City – A bedtime story that explores the sights and sounds of urban life. * Down on the Funny Farm – A humorous tale featuring farm animals and their adventures. * Count on Me 1 2 3 – A colorful board book introducing children to counting through everyday heroes. == Other work == Caravette is a co-founder of the Zoo & Aquarium Video Archive, an organization dedicated to documenting the history of professionals in the zoo and aquarium industry. == References == Category:1956 births Category:American television producers Category:American children's writers Category:Writers from Chicago",
 "title": "J. B. Frank"
}