{
 "id": "1192542",
 "text": "A rocaille is a type of rock garden. It is made to look like natural mountain landscapes using rocks and plants. A rocaille can be large or small, flat or on a slope. Sometimes it is built along stairs. == Materials == People use materials like rocks, flat slates, paving stones, pebbles, and volcanic stones. These can be held together with cement, which is often hidden using moss or plantsAymon Correvon, Rocailles fleuries, Genève, Aymon Correvon, 1942, 256 p., p. 37. == Plants == Rock gardens often use alpine plants, which grow in mountains. Other plants can also be used, such as small or tall perennial plants, mountain shrubs (like alpine rhododendrons, azaleas, creeping willow), and climbing plants like alpine clematis. == History == Rock gardens have been used in Chinese and Japanese gardens for many centuries. In 1743, a French missionary described Chinese gardens with rocks placed in an artistic and natural-looking way. Plants grew on the rocks to look like mountain scenery. Japanese gardens also use rocks with symbolic meaning. In 18th-century England, people started to prefer more natural garden designs compared to the formal French style. Horticulture societies and plant shows helped grow interest in new garden styles.Aymon Correvon, « Histoire des rocailles », dans Rocailles fleuries, Chêne-Bourg (Genève), Imprimerie de la Tribune de Genève, 1942, 256 p., p. 11-13 In the 19th century, tourists visited the mountains in Switzerland and saw wild alpine plants. In England, collecting these rare plants became popular, but it also endangered some species. In response, garden societies in places like Geneva created alpine gardens to protect and grow these plants. New gardens were built in Sion, Zermatt, the Great St. Bernard Pass, and Bourg-Saint-Pierre.Bernard Bornet, « Les 100 ans d'existence du jardin alpin « La Linnaea » à Bourg-Saint-Pierre », Musées de Genève, no 296,‎ juin 1989, p. 3 == References == Category:Gardening",
 "title": "Rock garden"
}