{
 "id": "1192472",
 "text": "Gideon Jacob Stein (born December 19, 1971) is an American entrepreneur and philanthropist. He serves as the president of the Moriah Fund, chair of the Civic News Company (publisher of Chalkbeat, Votebeat, and Healthbeat), and chairman of Write Label, a company that provides short-form writing services to media and advertising clients. Stein has held executive roles in ventures focused on technology, education, and social issues since the early 2000s. == Early life and education == Stein was born in Washington, D.C., to Robert Jay Stein, the founder of the Democracy Alliance, and Mary Ann Stein (née Efroymson), a philanthropist. He graduated with honors from Wesleyan University with a degree in economics and history. He also studied at St Edmund Hall, Oxford as a visiting scholar in development economics and European history. == Career == Stein began his career in the technology sector. He was the founder, chairman, and CEO of Omnipod, Inc., a company that provided enterprise messaging services. The company was acquired by MessageLabs in 2005, which later became part of Symantec. Following that, Stein founded LightSail Education, an adaptive literacy platform used in K–12 education. He later led Write Label, a crowd-sourced writing platform for advertising and media content. As chairman, he oversees the company's production of advertising content, including materials developed by freelance writers and automated tools. == Philanthropy and civic engagement == In 2019, Stein became the president of the Moriah Fund, a private family foundation that supports initiatives in human rights, civic life, reproductive rights, and economic justice. He also serves as chair of Civic News Company, the nonprofit publisher of Chalkbeat, Votebeat, and Healthbeat. He previously served as vice chair of the board of Success Academy Charter Schools, a charter school network based in New York City. Stein has participated in various civic and media-related initiatives and was quoted in national and international news outlets for his role in helping to convince President Joe Biden to step aside in the 2024 United States presidential election. Years earlier, he was featured in The New York Times for leading efforts to make his New York City condominium building the first to go completely smoke-free. == Media and public appearances == Stein has been interviewed on several podcasts about leadership, writing, and the use of technology in education and marketing. His appearances include: * Cloud Creative Collection – Apple Podcasts * Cloud Creative with Mike Walsh – SoundCloud * Chats with Chip on the FIR Podcast Network He was also cited in nonprofit and philanthropic publications, including Chalkbeat, for his perspective on how the COVID-19 pandemic affected educational philanthropy. == Personal life == Gideon Stein is married to Zoey Zebedee Stein and has two college-age children. The couple resides in New York City, St. Simons Island, GA, and Aspen, CO. == References == Category:1971 births Category:American philanthropists Category:People from Washington, D.C.",
 "title": "Gideon Stein"
}