{
 "id": "1192509",
 "text": "Karl Stoiber (13 September 1907 in Vienna - 12 December 1994 in Stockerau) was an Austrian international football player. He played as forward mainly for SK Admira Wien. He won 7 titels with them. He also played for the Austrian national football team. ==Career == Karl Stoiber began his football career in 1923 with SK Admira Wien. He spent the next two decades of his life with this teaam.. As a centre forward, he played a key role in the successes during this time. He worked his way into Admira's starting eleven in 1926/27 and promptly won his first championship. A year later he even won the double. Before his temporary departure from Admira, he and his team won the double two more times. Following the annexation of Austria by the German Reich on 12 March 1938, and the resulting decline of Admira, Karl Stoiber decided to move to Wiener AC in 1941. He returned to his home club after the war and played his last first-division matches of his football career for them. The center forward spent several more years playing for lower-league clubs in the Floridsdorf area. ==International == The striker was only occasionally called up for the national team. In his position he had to compete with Matthias Sindelar and Friedrich Gschweidl. Karl Stoiber made his debut for the national team on 1 April 1928 against Czechoslovakia (0-1). ÖFB Players profile He scored his first goal in Austria's 3-1 victory over Switzerland on 27 October 1929. His last match was on 5 April 1936 versus Hungary (3-5). ÖFB Players profile In total he played 6 matches and scored 2 goals. ==Honours == *Mitropa Cup Final: 1934 *7 × Austrian Champion: 1927, 1928, 1932, 1934, 1936, 1937, 1939 *3 × Austrian Cup Winner: 1928, 1932, 1934 *6 matches and 2 goals for the Austrian national football team from 1928 to 1936 ==References == Category:1907 births Category:1994 deaths Category:Austrian footballers Category:Association football forwards Category:Austrian football champions",
 "title": "Karl Stoiber"
}