{
 "id": "1192511",
 "text": "Emerald Hill - The Little Nyonya Story () is a 2025 Singaporean drama serial on Mediacorp's Channel 8. It stars Tasha Low, Chantalle Ng, Ferlyn Wong, Zhang Zetong, Tyler Ten, Jesseca Liu, Kai Hsiu, Romeo Tan, Dawn Yeoh, Shaun Chen, Jojo Goh and Zoe Tay as the main cast. This series serves as a standalone sequel to Channel 8's 2008 series, The Little Nyonya, with Jeanette Aw reprising her role as Yamamoto Yueniang. It is set in the 1950s to 1970s and centres around an extended Peranakan Chinese family in Emerald Hill, Singapore. The series first aired on Netflix and mewatch Prime on 10 March 2025, and every weekday on Channel 8 from 19 March 2025, at 21:00 (SGT). The drama became the first Channel 8 series to top Netflix Singapore's most- watched list after its streaming debut on 10 March 2025. The season finale was broadcast on 21 April 2025 for Netflix and meWatch Prime, and 30 April 2025 for Channel 8. ==Plot== The series follows the lives of three Nyonyas from the Zhang family, a Baba Nyonya household in Emerald Hill, Singapore. The story follows Zhang Xinniang, Zhang Anna, and Zhang Anya. Anya, born into a wealthy family, is abducted at a young age and forced into a brothel, facing a turbulent life. Xinniang, once a street beggar, is adopted by a wealthy family and grows into a striking and accomplished young woman. Anna, regarded as a bringer of misfortune by her birth family, is raised away from home, only to return with a changed temperament that unsettles her household. As their destinies become intertwined, the three women navigate the complexities of family ties and love. Their journey explores themes of resilience and self- determination as they strive to overcome adversity and reshape their futures. ==Cast== ===Zhang family=== * Nick Teo as Zhang Yaozu, Zhang Jin Hai and Li Shu Yu's son * Tasha Low as Zhang Xinniang Emily/Zhenen, Zhang Jin He and Li Shu Qin's adopted daughter * Ferlyn Wong as Zhang Anya/Zhou Hongyu (Chew Hong Ee), Zhang Jin He and Li Shu Qin's daughter * Herman Keh as Zhang Yaoguang, Zhang Jin Quan and Kang Si Li's eldest son * Zhu Zeliang as Zhang Yaoliang, Zhang Jin Quan and Kang Si Li's second son * Chantalle Ng as Zhang Anna, Zhang Jin Quan and Kang Si Li's youngest daughter * Zoe Tay as Liu Xiu Niang, Zhang Jin Hai/Jin He/Jin Quan/Yin Niang's mother * Shaun Chen as Zhang Jin Hai, Liu Xiu Niang's eldest son * Jojo Goh as Li Shu Yu, Zhang Jin Hai's wife * Kai Hsiu as Zhang Jin He, Liu Xiu Niang's second son * Jesseca Liu as Li Shu Qin, Zhang Jin He's wife * Romeo Tan as Zhang Jin Quan, Liu Xiu Niang's third son * Dawn Yeoh as Kang Si Li, Zhang Jin Quan's wife * Sheila Sim as Zhang Yin Niang, Liu Xiu Niang's youngest daughter * Rayson Tan as Zhang Qi Ye (Cameo appearance), Liu Xiu Niang's husband * Priscelia Chan as Ping Jie, Zhang family's maid, serve Liu Xiu Niang * Jolynn Min as Ah Fang, Zhang's family's maid, Serve Li Shu Yu * Juin Teh as Yan Jie, Zhang family's maid, serve Li Shu Qin * Gini Chang as Ah Zhen, Zhang family's maid, serve Kang Si Li * Jernelle Oh as Ah Hua, Zhang family's maid * Kiki Lim as Ah Ju, Zhang family's maid * Seow Sin Nee as Ah Hao, Zhang family's maid ===Huang family=== * Jeanette Aw as Yamamoto Yueniang, Zhang family's friend, Huang Zu Ye‘s adopted mother * Zhang Zetong as Huang Zu Ye (Ng Chor Yap), Yueniang's adopted son, Zhang Xinniang's love interest * Huang Yu Zhu, Yueniang’s stepsister, Zu Ye’s biological mother (Mentioned only) * Huang Ju Xiang, Yueniang’s mother (Mentioned only) * Tian Lan, Yueniang’s grandmother (Mentioned only) * An Qi, Yueniang’s granddaughter, Zu Ye’s daughter (Archival footage) ===Other characters=== * Tyler Ten as Bai Ah Li, gangster and childhood friend of Zhang Xinjiang, likes Zhang Xinniang * Chen Liping as Cai Zhu Niang/Ah Zhu, Zhang Xinniang's foster mother * Elvin Ng as Simon Chen Dong Hao, Zhang Yin Niang's boyfriend * Desmond Ng as Kang Zhi Jie, Kang Si Li's younger brother * Aileen Tan as Su Gui Feng, brothel owner * Chen Tianwen as Wu De, brothel customer * Chen Huihui as Ying Jie, Gui Feng's maid * Zhai Siming as Xiao Lao Shu, gangster, Bai Ah Li’s fellow, Xiao Hui’s boyfriend * Yunis To as Xiao Hui, student, Xiao Lao Shu’s girlfriend * Guo Liang as Gao Si, police inspector * Dennis Chew as Ni Lao Zi, storyteller * Cavin Soh as Qian Duo Duo, a supervisor working for Yamamoto Yueniang * Chen Shucheng as Uncle Qing, Li Shu Qin's family's old worker * Eric Lay as Guo Zhi Bang, Zhang Anna’s fiancee, but like Zhang Anya * Ah Tao, Yueniang’s maid (Mentioned only) * Chen Xi, Yueniang’s love interest (Archival footage) ==Production== Mediacorp first announced the development of the series in October 2023 as a sequel to The Little Nyonya. Production officially began on 30 January 2024, with a main cast that includes Tasha Low, Chen Liping, Jesseca Liu, Chantalle Ng, Ferlyn Wong, Kiki Lim, Sheila Sim, Elvin Ng, Zoe Tay, Shaun Chen, Romeo Tan, Tyler Ten, Zhang Zetong, Dawn Yeoh, Desmond Ng, Herman Keh, Zhai Siming and Zhu Zeliang. Zhang Zetong took over the role of middle-aged Zhang Zuye originally portrayed by Edsel Lim and Zen Chong. Filming for the series took place primarily in Singapore, with select outdoor scenes shot in Malacca and Johor, Malaysia. Mediacorp leased a two-storey conserved bungalow known as the Keppel House located in Mount Faber that is managed by the Singapore Land Authority to serve as the Zhang family's residence. Built in 1899, the property underwent a S$1 million refurbishment for the production. The set included a specially constructed outdoor kitchen, along with the acquisition and rental of various Peranakan furniture pieces, including a round wooden table valued at S$50,000. The series showcases traditional Peranakan attire, primarily the sarong kebaya, along with traditional beaded shoes. Designed by Raymond Wong and Tee Yu Yan, the outfits feature intricate motifs embellishing each kebaya. After filming concluded, the costumes and accessories were donated to the Peranakan Museum, where they are now exhibited in a section highlighting the significance of costume in Peranakan theatre and television. On 2 December 2024, Mediacorp released the music video for the opening theme song, \"落花如雨\", which sung by Kit Chan on YouTube. ==Release== Mediacorp secured its first pre-sale distribution agreement with Netflix for Emerald Hill – The Little Nyonya Story in Southeast Asia. This milestone marks the first time a Mediacorp Chinese drama has been acquired through a pre-sale deal and premiered simultaneously on both Netflix and mewatch Prime on 10 March 2025. The series also debuted on 19 March 2025, on Channel 8 at 21:00 (SGT) in Singapore and on Astro AEC at 20:30 (MST) in Malaysia. The final episode for the series was released on 21 April, and 30 April for Channel 8; it was originally scheduled for 29 April, but was pre-empted due to the coverage for the Chinese Roundtable Forums for the 2025 Singaporean general election. ==References== ==External links== * * Emerald Hill: The Little Nyonya Story on IMDb Category:Singapore Chinese dramas Category:2025 Singaporean television series debuts Category:Channel 8 (Singapore) original programming",
 "title": "Emerald Hill - The Little Nyonya Story"
}