{
 "id": "1192441",
 "text": "According to the Khuman Kangleirol, the ruling lineages of the Khuman and Luwang dynasties are recorded as having a common origin. This shared ancestry may not necessarily extend to the broader populations associated with these dynasties. King Singtangpung Tapung Singminnapa, the ninth and final ruler of the undivided common ancestral Khuman-Luwang royal lineage, had two successor sons, King Aalong, who founded the independent Khuman dynasty, and King Pamingnapa, who established the independent Luwang dynasty. == Background == The Khuman () and Luwang () communities are two of the seven sub-ethnic groups traditionally recognized within the Meitei ethnicity. Collectively, these groups are referred to as the \"seven clans\" or 7 Yek Salai. In Meitei mythology, religion, and traditions, all seven clans are said to originate from a common divine ancestor named Pakhangba. From a historical perspective, the seven clans appear to have existed as distinct ethnic groups, each with separate origins. Despite their differences, they shared a common linguistic base (with regional dialectal variations) and practiced a shared religion (with sectarian differences). These similarities are likely due to prolonged cohabitation in the same geographical region—historically referred to as Kangleipak. Each group had its own rulers and independent polities. Over time, these groups were politically unified under the Ningthouja dynasty, forming what is now recognized as the Meitei ethnicity. As with most ethnographic histories, the origins of populations are complex and multifaceted. It cannot be assumed that all individuals within a particular group share a single origin. Similarly, the ancestry of ruling elites may not align with that of the general population. This applies to both the Khuman and Luwang groups. == List of kings == The following provides a list of the kings from the period before the division of the Khuman and Luwang dynasties into distinct royal lineages. Ancient Meitei name(s) Latin transliteration Alternative spelling(s) (if any) Latin transliteration Modernized Meitei name(s) Latin transliteration Alternative spelling(s) (if any) Latin transliteration Note(s) / Nongtamlen Akhupa / Nongtamlen Akhoopa / Nongtamlel Akhupa / Nongtamlel Akhoopa / Nongdamlen Akhuba / Nongdamlen Akhooba / Nongdamlel Akhuba / Nongdamlel Akhooba First ruler of the Khuman-Luwang common royal lineage / Nongtamlen Ahanpa / Nongtamlel Ahanpa / Nongdamlen Ahanba / Nongdamlel Ahanba Second ruler of the Khuman-Luwang common royal lineage / Kulumlen Meinaitapa / Kulumlel Meinaitapa / Kurumlen Meinaidaba / Kurumlel Meinaidaba Third ruler of the Khuman-Luwang common royal lineage Kulumlen Meinaipa Kulumlel Meinaipa Kurumlen Meinaiba Kurumlel Meinaiba Fourth ruler of the Khuman-Luwang common royal lineage Pothang Ponghan Pothang Ponghal Fifth ruler of the Khuman-Luwang common royal lineage Heilonglen Longchumpa Heilonglel Longchumpa Heironglen Longjumba Heironglel Longjumba Sixth ruler of the Khuman-Luwang common royal lineage Heilong-ngang Thanganglen / Heilongngang Thanganglen / Heilongang Thanganglen Heilong-ngang Thanganglel / Heilongngang Thanganglel / Heilongang Thanganglel Heirong-ngang Thanganglen / Heirongngang Thanganglen / Heirongang Thanganglen Heirong-ngang Thanganglel / Heirongngang Thanganglel / Heirongang Thanganglel Seventh ruler of the Khuman-Luwang common royal lineage Poileiton Poileitol Poireiton Poireitol Eighth ruler of the Khuman-Luwang common royal lineage Singtangpung Tapung Singminnapa / Shingtangpung Tapung Shingminnapa Singtangpung Tapung Singminapa / Shingtangpung Tapung Shingminapa Singdangpung Tabung Singminnaba / Shingdangpung Tabung Shingminnaba Singdangpung Tabung Singminaba / Shingdangpung Tabung Shingminaba Ninth and the last ruler of the Khuman-Luwang common royal lineage; had two sons: Aalong (ꯑꯥꯂꯣꯡ), also called Aarong (ꯑꯥꯔꯣꯡ), and Pamingnapa (ꯄꯥꯃꯤꯡꯅꯄ / ꯄꯥꯃꯤꯡꯅꯄꯥ), also called Pamingnaba (ꯄꯥꯃꯤꯡꯅꯕ / ꯄꯥꯃꯤꯡꯅꯕꯥ). Both became kings. King Aalong started the Khuman dynasty. King Pamingnapa started the Luwang dynasty. == List of queens == The following provides a list of the queens from the period before the division of the Khuman and Luwang dynasties into distinct royal lineages. * Queen Mother Chinphuron Leichik Nganbi - Queen Mother of Nongdamlen Akhuba, the first king of the Khuman-Luwang common royal lineage * Queen Leithamlen Chanu (ꯂꯩꯊꯝꯂꯦꯟ ꯆꯅꯨ) - consort of King Nongdamlen Akhuba, the first ruler of the Khuman-Luwang common royal lineage, and queen mother of King Nongdamlen Ahanba * Queen Chitnu Leima (ꯆꯤꯠꯅꯨ ꯂꯩꯃꯥ) - consort of King Nongdamlen Ahanba, the second ruler of the Khuman-Luwang common royal lineage, and queen mother of King Kurumlen Meinaidaba * Queen Hainu Leima (ꯍꯥꯏꯅꯨ ꯂꯩꯃ) - consort of King Kurumlen Meinaidaba, the third ruler of the Khuman-Luwang common royal lineage, and queen mother of King Kurumlen Meinaiba * Queen Leiphulen Chanu (ꯂꯩꯐꯨꯂꯦꯟ ꯆꯅꯨ), also known as Leiphuren Chanu (ꯂꯩꯐꯨꯔꯦꯟ ꯆꯅꯨ) - consort of King Kurumlen Meinaiba, the fourth ruler of the Khuman-Luwang common royal lineage, and queen mother of King Pothang Ponghan * Queen Pisinnu, also known as Pishinnu (ꯄꯤꯁꯤꯟꯅꯨ) - consort of King Pothang Ponghan, the fifth ruler of the Khuman- Luwang common royal lineage, and queen mother of King Heironglen Longjumba * Queen Pisinnukhompi, also known as Pishinnukhompi (ꯄꯤꯁꯤꯟꯅꯨꯈꯣꯝꯄꯤ), or Pisinnukhombi or Pishinnukhombi (ꯄꯤꯁꯤꯟꯅꯨꯈꯣꯝꯕꯤ) - consort of King Heironglen Longjumba, the sixth ruler of the Khuman-Luwang common royal lineage, and queen mother of King Heirong-ngang Thanganglen * Queen Piyainu (ꯄꯤꯌꯥꯏꯅꯨ) - consort of King Heirong-ngang Thanganglen, the seventh ruler of the Khuman- Luwang common royal lineage, and queen mother of two sons, King Thawalen (ꯊꯋꯥꯂꯦꯟ), also known as Thawaren (ꯊꯋꯥꯔꯦꯟ), who ruled the ancestral kingdom, and King Poireiton (ꯄꯣꯏꯔꯩꯇꯣꯟ), who established his own kingdom in Kangleipak. * Queen Leima Leinaotabi (ꯂꯩꯅꯥꯑꯣꯇꯥꯕꯤ), also known as Leinautabi (ꯂꯩꯅꯥꯎꯇꯥꯕꯤ) - consort of King Poireiton, the eighth ruler of the Khuman-Luwang common royal lineage, and queen mother of King Singtangpung Tapung Singminnapa * Queen Santhong Punempa Chanu (ꯁꯟꯊꯣꯡ ꯄꯨꯅꯦꯝꯄ ꯆꯅꯨ), also known as Shanthong Punemba Chanu (ꯁꯟꯊꯣꯡ ꯄꯨꯅꯦꯝꯕ ꯆꯅꯨ) - consort of King Singtangpung Tapung Singminnapa, the ninth ruler of of the Khuman-Luwang common royal lineage, and queen mother of two sons, King Aalong (ꯑꯥꯂꯣꯡ), also known as Aarong (ꯑꯥꯔꯣꯡ), who founded the independent Khuman dynasty, and King Pamingnapa (ꯄꯥꯃꯤꯡꯅꯄ / ꯄꯥꯃꯤꯡꯅꯄꯥ), also known as Pamingnaba (ꯄꯥꯃꯤꯡꯅꯕ / ꯄꯥꯃꯤꯡꯅꯕꯥ), who founded the independent Luwang dynasty. == Related pages == * Poireiton Khunthok * Nongda Lairen Pakhangba * Meitei deities * Lai Haraoba == Bibliography == * Yek Taretkee Ningthourol, by Sudhir, Angom * Khuman Sheirol * খুমন্ নিংথৌরোন লম্বুবা, by Brahmacharimayum Kulachandra Sharma == References == Category:Meitei culture Category:History of Manipur Category:Ancient history",
 "title": "List of Khuman and Luwang common ancestral monarchs"
}