{
 "id": "1192236",
 "text": "The World Conference Against Racism (WCAR) is a series of international meetings organized by UNESCO to fight against racism and discrimination. So far, five conferences have taken place—in the year 1978, 1983, 2001, 2009, and 2021. UNESCO was created after World War II and the Holocaust as part of the United Nations. From the beginning, it worked to promote scientific research on ethnic groups and share this knowledge with the public to challenge false, so-called \"scientific\" ideas used to justify racism. One of its first major publications was The Race Question in 1950, written by well-known experts from around the world. == 1978 conference == The 1978 World Conference Against Racism took place in Geneva, Switzerland. A key topic was South Africa’s apartheid system, which enforced racial segregation and discrimination. The conference strongly criticized South Africa’s actions and also condemned its close ties with Israel (Israel–South Africa relations), especially their economic and military cooperation. It urged the United Nations Security Council to consider strict sanctions against South Africa and other racist governments in southern Africa. The conference ended with a declaration and plan of action that rejected ideas of racial superiority, racism, and discrimination. It also called for the use of education to promote understanding among people and to show that all ethnic and racial groups are equal. == 1983 conference == The 1983 World Conference Against Racism was also held in Geneva, Switzerland. == 2001 conference == The 2001 World Conference Against Racism took place in Durban, South Africa, from August 31 to September 8. It was held under the United Nations and led by Mary Robinson, the former president of Ireland and then UN High Commissioner for Human Rights. The full title of the event was \"World Conference Against Racism, Racial Discrimination, Xenophobia and Related Intolerance.\" It focused on unfair treatment between groups of people. Much of the attention was given to how Israel treats Palestinians, while other human rights issues and cases of genocide got less focus.UN.org World Conference against Racism, Racial Discrimination, Xenophobia and Related Intolerance. \"General issues\" 63 and 151(pages 13 and 48). Retrieved 8 October 2020. The conference faced major disagreements, especially over the Middle East and slavery. There were strong anti-Israel protests at a related gathering of non-governmental organizations. The United States and Israel left the conference early because they felt a draft resolution unfairly criticized Israel and compared Zionism to racism. The European Union also rejected wording from Arab states that accused Israel of racist actions. African countries, led by Nigeria and Zimbabwe, along with African-American organizations, wanted countries involved in slavery to officially apologize, recognize slavery as a crime against humanity, and agree to reparations. European countries, led by the UK, refused. In the end, African nations got some support for the New African Initiative, help with debt relief, funding for AIDS treatment, efforts to recover stolen funds hidden in Western banks, and action against human trafficking. However, the term \"reparations\" was removed from the final document. == 2009 conference == The 2009 World Conference Against Racism was held in Geneva, Switzerland. Several countries—including Canada, Israel, the United States, New Zealand, Germany, Italy, Sweden, the Netherlands,, AP 19 April 2009 Poland, and later AustraliaThe Australians delayed their decision to withdraw to properly consult other nations on the conference platform. Within a day of learning that the draft was not ready, they announced they were joining the boycott. See: * * Australia ready to boycott Durban II—chose not to attend. BBC reporter Mark Mardell shared comments from Italian Foreign Minister Franco Frattini (who was the European Commissioner for security and justice), said that Europe made a serious mistake by not agreeing on a shared response. He criticized the conference documents for still treating Israel as a racist country instead of a democracy. Frattini said Europe should have been more consistent and decided not to attend the event—just like the U.S., Canada, Australia, New Zealand, and the Netherlands. New Zealand’s Foreign Minister, Murray McCully, also said the wording in the conference documents made him worry it would turn into the same kind of angry, unhelpful arguments that happened in 2001. He was especially concerned that some Muslim countries might use the conference to attack Israel or limit free speech, especially speech that criticizes religion. On the first day of the conference, France warned that European delegates would walk out if Iran’s President, Mahmoud Ahmadinejad, made anti-Semitic comments. French Foreign Minister Bernard Kouchner said they would not accept any hateful or racist remarks and would leave immediately if they heard them. Germany chose not to attend at all due to fears that the conference might include anti-Semitic messages, a senior official confirmed in Berlin Thursday. In his opening speech, UN Secretary- General Ban Ki-moon said that some countries that should have been helping create a better future chose not to attend the conference. He also noted that outside the event, different political and ideological groups were loudly arguing with each other. Later that day, around 40 delegates walked out during a speech by Iranian President Mahmoud Ahmadinejad after he called Israel a \"racist government\" and criticized the founding of the country. France, which had already warned that it would walk out if this happened, called Ahmadinejad’s speech \"hate speech,\" according to the BBC. The walkout was seen as a big embarrassment for the United Nations. The UN had hoped the event would show its strength in uniting countries to fight injustice, said BBC reporter Imogen Foulkes. Another BBC journalist, Jeremy Paxman, called the walkout a \"stunt\" and said people should be allowed to criticize Zionism. Ahmadinejad, who was the only major world leader at the event, said that after World War II, Jews from Europe and the U.S. were sent to the Middle East to create what he called a racist government in Palestine. He added that, as a way of making up for racism in Europe, Western powers helped build what he claimed was a harsh and racist regime in Palestine. French Ambassador Jean- Baptiste Mattei explained that they left the room as soon as Ahmadinejad started talking about Jews and Israel. British Ambassador Peter Gooderham, who also walked out, said Ahmadinejad's speech was offensive and hateful. He said such anti-Semitic remarks had no place at a UN event meant to fight racism. The United Nations posted a video of Ahmadinejad’s speech online, and the Foreign Policy Journal quickly published a transcript. == 2021 conference == In September 2021, the United Nations General Assembly marked 20 years since its 2001 anti-racism conference by promising to strengthen its fight against racism. However, many countries chose not to take part in the event. These included Albania, Australia, Austria, Bulgaria, Canada, Colombia, Croatia, Cyprus, Czech Republic, Denmark, Dominican Republic, Estonia, France, Georgia, Germany, Greece, Honduras, Hungary, Israel, Italy, Latvia, Lithuania, Montenegro, Moldova, Netherlands, New Zealand, North Macedonia, Poland, Romania, Serbia, Slovakia, Slovenia, Spain, Sweden, Ukraine, the United Kingdom, the United States, and Uruguay. The European Union also did not attend or give any speeches at the event. ==See also== * Durban III * Israel and apartheid * International Day for Tolerance * United Nations General Assembly Resolution 3379 ==References== ==Other websites== *WCAR website *Summary of Durban Declaration Radio France Internationale *\"Third Decade to Combat Racism and Racial Discrimination, G.A. res. 48/91, 48 U.N. GAOR Supp. (No. 49) at 193, U.N. Doc. A/48/49 (1993)\", Human Rights Library, University of Minnesota. Category:Human rights Category:UNESCO",
 "title": "World Conference against Racism"
}