{
 "id": "1192216",
 "text": "Nobatia or Nobadia (; Greek: Νοβαδία, Nobadia; Old Nubian: ⲙⲓⲅⲛ̅ Migin or ⲙⲓⲅⲓⲧⲛ︦ ⲅⲟⲩⲗ, Migitin Goul lit. \"of Nobadia's land\") was a late antique kingdom in Lower Nubia. Together with the two other Nubian kingdoms, Makuria and Alodia, it succeeded the kingdom of Kush. After its establishment in around 400, Nobadia gradually expanded by defeating the Blemmyes in the north and incorporating the territory between the second and third Nile cataract in the south. In 543, it converted to Coptic Christianity. It would then be annexed by Makuria, under unknown circumstances, during the 7th century. ==Religion== ===Paganism=== Since Ptolemaic times, the \"state religion\" of Lower Nubia had been the Isis cult of Philae. Its importance outlived the Ptolemaic and Meroitic period and Nubian pilgrims continued to travel to Philae. The temple on Philae was eventually shut down between 535 and 538 and Nubians were forbidden to enter. Another Isis cult, the Greco-Roman mysteries of Isis, has been confirmed to be practised in Nobadia by an unearthed shrine in Qasr Ibrim. This cult was practised during Meroitic times as well. ===Christianity=== As confirmed by epigraphical and archaeological evidence, Christianity was already present among parts of the Nobadian society even before the official conversion of 543. The Nobadian elite might have started considering to convert to Christianity in the 530s, parallel to when the Isis temple was shut down. Christianity proceeded to spread through Nobadia on various levels at different speeds. Towns, for example, were quick in adopting the new religion, while the Christianization of the villages was not accomplished until the 7th–9th centuries. South of the second cataract, Christianity seems to have begun spreading later than in the north, possibly since the late 6th or early 7th century. Many ancient Egyptian temples were converted to churches and plastered with Christian wall paintings. File:Dendur conversion inscription.jpeg|Copy of a Coptic inscription in the Temple of Dendur, commemorating the conversion of the temple into a church during the reign of king Eirpanome (mid-6th century) File:Kalabsha Coptic conversion inscription.png|Coptic inscriptions in the Temple of Kalabsha commemorating its conversion into a church by a certain bishop Paul File:Blok fryzu z absydy I Katedry, warsztat nubijsk.jpg|Early-7th-century frieze fragment of the Faras cathedral File:Amada - Allan John H - 1843.jpg|The converted Temple of Amada with the now-demolished Christian dome File:Amada temple Christian paintings.png|Damaged paintings of Christian saints inside the temple of Amada File:Wadi es-Sebua church plan.png|Plan of the Christian church (red) inserted into the temple of Wadi es-Sebua File:Wadi es Sebua church painting.png|Christian painting of St. Peter in the temple of Wadi es- Sebua File:Christian wall painting from Kalabsha, Nubia.png|Christian wall paintings in the temple of Kalabsha File:Abu oda painting.jpg|Painting of Christ on the ceiling of the converted Temple of Abu Oda near Gebel Adda ==References== * * * * * * * * ==Further reading== * * * * * * Category:History of Nubia Category:Makuria Category:Christianity in Sudan Category:Countries in ancient Africa Category:Former countries in Africa Category:States and territories established in the 4th century Category:7th- century disestablishments in Africa Category:States and territories disestablished in the 7th century Category:Christianity in the Middle Ages Category:Coptic Orthodox Church Category:Blemmyes Category:Former kingdoms",
 "title": "Nobatia"
}