{
 "id": "1192371",
 "text": "Ashnoor Kaur (born on 3 May 2004) is an Indian actress who mainly acts in Hindi TV shows. She started her acting career in 2009 with the show Jhansi Ki Rani. She is well known for playing Navika in Na Bole Tum Na Maine Kuch Kaha, Naira in Yeh Rishta Kya Kehlata Hai, Mini in Patiala Babes, and Suman in Suman Indori. She has won an Indian Telly Award and has been nominated for two ITA Awards. == Early life == Kaur was born on 3 May 2004. In 2019, she got 93% marks in her Class 10 CBSE board exams, and in 2021, she got 94% marks in her Class 12 exams. == Filmography == === Movies === Year Title Role Notes Ref. 2018 Sanju Young Priya Dutt Cameo appearance Manmarziyaan Kiran Bagga 2024 Kisko Tha Pata Shreya === Television === Year Title Role Notes Ref. 2009–2010 Jhansi Ki Rani Prachi 2010 Saath Nibhaana Saathiya Panna 2011-2012 Shobha Somnath Ki Young Princess Shobha 2012–2013 Na Bole Tum Na Maine Kuch Kaha Young Navika \"Nanhi\" Vyas Bhatnagar 2012 CID Sia Khanna Episode: \"Abhijit Ka Inteqaam\" Devon Ke Dev...Mahadev Young Ashokasundari 2013 Bade Achhe Lagte Hain Young Mayra Kapoor Jai Jag Janani Maa Durga Young Katyayani Mahabharat Young Dushala 2014 The Adventures of Hatim Maya 2014 Tum Saath Ho Jab Apne Najma Baig Siddiqui 2014 Bhoot Raja Aur Ronnie Sheena Season 2 2015 Siyaasat Mumtaz Mahal 2015–2016 Yeh Rishta Kya Kehlata Hai Young Naira Singhania 2017 Koi Laut Ke Aaya Hai Young Geetanjali Shekhari 2018 Prithvi Vallabh Princess Vilasvati 2018–2020 Patiala Babes Mini Babita 2024–2025 Suman Indori Suman Sharma Mittal === Web series === Year Title Role Notes Ref. 2021 Pari Hun Main Pari 2024 Butterflies Mini Episode: \"To Rishi, from Mini and Ishaan\" 2025 School Friends Yashika Malhotra Season 3 === Music videos === Year Title Singer(s) Ref. 2019 Koi Nahi Lisa Mishra and Rupinn Meri Galti Ambili Menon Swag Salamat Shobhana Gudage 2020 Red Yellow Suit Karan Singh Arora and S Mukhtiar Kya Karu Millind Gaba and Parampara Thakur Khidki Papon Mana Sakda Hai Harish Moyal Akhiyaan Tadpegi Aishwarya Pandit 2021 Yaara Indeep Bakshi and Sumit Goswami Tu Kya Jaane Jyotica Tangri Ignore Ayush Talniya and Indeep Bakshi Tere Noor Se Revaansh Kohli 2022 Yaar Ki Mehfil Stebin Ben Tutt Gaya 2023 Jaana Hai Toh Jaa Raas, Sheetal == Awards and nominations == Year Award Category Work Result Ref. 2013 Indian Telly Awards Best Child Artiste - Female Na Bole Tum Na Maine Kuch Kaha Indian Television Academy Awards Best Child Artist 2019 Best Actress – Drama Patiala Babes Indian Telly Awards Next Generation Star 2021 Iconic Gold Awards Youngest Star of the Year == References == == Other websites == * * Category:Living people Category:2004 births Category:Indian actors Category:Punjabi people",
 "title": "Ashnoor Kaur"
}