{
 "id": "1192149",
 "text": "== Key rollover == Key rollover is the ability of a keyboard to detect multiple key presses at once. A keyboard with n-key rollover (NKRO) can detect every key you press, no matter how many are held down at the same time. == Keyboard usage == Most people press one key at a time when typing. But in gaming or fast typing, you might press several keys together. For example, holding Shift to sprint while pressing W to move and Space to jump. Some typing systems, like stenography or Braille keyboards, need many keys pressed at once. Games also often require holding down movement keys while pressing others to interact. == n-key rollover == NKRO means the keyboard treats each key independently. It won’t miss or mix up keys, even if many are pressed. This is important for fast typing, stenography, and games. To work properly, the keyboard must send all key data to the computer. USB keyboards usually use the HID report protocol, which supports full NKRO. Some older modes, like the boot protocol, only support a few keys at once. == Multi-key rollover == Cheaper keyboards don’t have full NKRO. They may miss keys or register the wrong one if too many are pressed. This happens because of how the keyboard's wiring is set up. A 2-key rollover keyboard can only handle two keys at once. Pressing a third may cause a wrong key to be sent. Higher-quality keyboards use smarter designs to support more keys and avoid these errors. == Key jamming and ghosting == * Ghosting: When pressing three keys makes the keyboard think a fourth key was pressed. * Jamming: When the keyboard blocks extra keys to stop ghosting. Some keys just won’t register. High-end or gaming keyboards often add diodes to prevent this. These keyboards can detect any number of key presses without errors. Some gaming keyboards only add diodes to keys used the most, like WASD. == See also == * Keyboard technology * Stenotype * Charlieplexing == External links == * Key rollover test",
 "title": "Key rollover"
}