{
 "id": "1192200",
 "text": "Ikhmindi, also Iḫmindi; was a fortified city founded in the CE 6th century on the Nile in what is now southern Egypt. Until its flooding by Lake Nasser in the 1960s, the site was one of the best-preserved early Christian settlements in Lower Nubia. == Location == Ikhmindi lay north of the ancient settlement of Sayala on the left, western bank of the Nile, about 120 kilometers as the crow flies south of Aswan and just under 40 kilometers south of Sabagura, a fortress city of comparable size. A few kilometers downstream, the Wadi Allaqi flowed into the Nile Valley from the east. Here, an old caravan route branched off towards the Red Sea, but the city itself was not located on a caravan route. In Ptolemaic times, the border between Egypt and Nubia ran roughly at Ikhmindi. After the Roman prefect in 23 BCE, After having taken the fortified Qasr Ibrim further south and stationed a garrison there for two years, the Romans withdrew to the old border and held al-Maharaqqa a few kilometers north of Ikhmindi as the border town of the province of Egypt.John Whitehorne: The Pagan Cults of Roman Oxyrhynchus. In: Wolfgang Haase, Hildegard Temporini (eds.): Rise and Decline of the Roman World. Volume 1, Part 2. De Gruyter, Berlin / New York 1995, p. 3057. == History of Research == The first sketches were made by Ludwig Borchardt in 1900; E. Somers Clarke published his archaeological investigations in 1912. From 1928 to 1934, the Egyptian Antiquities Authority commissioned excavations in Lower Nubia, supported by the Italian Foreign Ministry. Ugo Monneret de Villard was the director of the work. The most extensive excavations were carried out in 1958/59 by a team from the University of Milan led by Sergio Donadoni and Arturo Stenico. They produced a detailed master plan of the settlement. This was done under the auspices of the Egypt Exploration Society as part of the UNESCO rescue operation shortly before the site was flooded by Lake Nasser. Friedrich Wilhelm Deichmann and Peter Grossmann of the German Archaeological Institute visited the site on a short trip in early 1964.F. W. Deichmann, P. Grossmann: Nubian Research. Berlin 1988, p. 14 f. == Townscape == The settlement's founding can be narrowed down to the second half of the 6th century, as it is mentioned in a Greek founding inscription from this period. Large sections of the approximately 120 × 120 meter fortress wall and the ruins of numerous residential buildings of the almost square, walled town complex were still preserved at the beginning of the 1960s. According to the inscription, the purpose of the fortification was \"to offer protection to people and animals.\"F. W. Deichmann, P. Grossmann: Nubische Forschungen. Berlin 1988, pp. 67 f. This indicates the primary function, which the fortifications of Sabagura, Kalabscha, and Sheik Daud may also have had. For the local population, it was a matter of defense against raids by nomads, not of securing a trade route. Only the city wall of Faras dates back to the Kushite period, while the other towns were also expanded and fortified during the 6th century. However, this does not indicate a higher-level, state-based organization of the cities, as existed in the Byzantine Empire. The town was conveniently situated on a low hill that sloped steeply down to the river Nile, forming a narrow peninsula extending southward between the Nile and a dead tributary, so that access was only possible from the north. The eastern section of the city wall and a 20 to 30 meter wide strip of the settlement behind it had collapsed due to a landslide. It’s certain that, as on the other sides, the city wall on the east side was also secured by square corner towers. To the north and south there were gateways whose entrances faced east. As in Sabagura, the road led into the city at a right angle; as there, in Ikhmindi the outside of the wall was slightly banked. However, the additional stiffening provided by buttresses was missing. The entire wall was made of rubble stone; mud bricks were used only to create a level walkway on the top of the wall. The walkway was protected by a 75 centimeter thick parapet. Two towers on the western wall, and one each on the north and south walls, served as defenses in addition to the gates. Their distance of between 30 and 40 meters corresponded to the range of an arrow.F. W. Deichmann, P. Grossmann: Nubian Researches. Berlin 1988, p. 68 f., Plan: Figure 32. To the extent that the location of the streets within could be determined, a loosely structured, essentially planned street grid emerged between the densely built-up areas. Typical for Nubian settlements was a ring road running parallel to the surrounding wall. The straight, north-south main street was interrupted in its middle section by the central church, which had probably been built before the streets were planned and now formed the city center. Additional streets served different-sized city districts (insulae). The arrangement of the houses suggests a later, unplanned, gradual coalescence. The streets were all narrow and unpaved. Apparently, after the houses were completed, the narrow street space between them was covered in some places by a Nubian barrel vault. The supports for the vaults were missing from many house walls and had to be created by subsequently added walls. Such roofing did not exist in other locations. Their installation was probably largely initiated by the respective house residents, which would explain some irregularities in their execution.F. W. Deichmann, P. Grossmann: Nubian Research. Berlin 1988, p. 71 f. The adjoining houses consisted of two or three small, rectangular rooms. They were usually built of rubble stone in the base zone, while the upper walls and vaulted ceilings were made of mud bricks. Some houses exhibited two construction phases. The oldest buildings had such thin walls that they could only have been covered with a flat roof made of palm trunks. In order to add a vault during a later renovation, the walls had to be reinforced to create a support. In some buildings, straight or double-flight staircases led to an upper floor, which was sometimes added later. Apart from a few fishermen's huts on the banks of the Nile, all residential buildings were located within the city walls.F. W. Deichmann, P. Grossmann: Nubische Forschungen. Berlin 1988, pp. 73–81. === Central Church === The central church, completely excavated by the Italians in 1958/59, stood on a slightly elevated slab of rock on the main axis between the two city gates. The apse, located within a rectangle measuring approximately 14 x 10 meters, was rebuilt several times. In the oldest building, made of mud bricks, the central apse extended beyond the east wall as an obtuse-angled rectangle. Later, during a complete reconstruction of the sandstone exterior walls, the two side rooms were extended to a straight east wall, and the apse was given a semicircular wall shell on the inside. The two entrances were typically located in the western area, opposite the north and south sides. On the west wall, a roughly square side room separated from the nave (Naos) in each corner, and the southern room housed the staircase to the upper floor. Ugo Monneret de Villard had already found no remains of these installations, nor of the presumed central pillars, in the early 1930s. Unlike other Nubian churches (such as the local South Church and that of Sabagura), a connecting passage between the side rooms behind the apse was missing. The first phase is dated to the time of the site's founding and the beginning of Christianization, i.e., to the 6th century. The passage behind the apse was generally abandoned only from the middle of the 8th century onwards. The final phase was the installation of the apse's circular arch.F. W. Deichmann, P. Grossmann: Nubische Forschungen. Berlin 1988, pp. 14–20. === South Church === The remains of the three-aisled South Church were excavated to the south, outside the walled city. The rectangular floor plan, measuring approximately 12.5 × 9.5 meters, followed the usual Nubian layout, with entrances in the western part of the two long sides, two side rooms on the western wall, the southern one serving as a stairwell, and four rectangular pillars in the center of the transversely rectangular nave. The eastern side rooms were connected by a corridor behind the semicircular apse. Corresponding to the width of the apse, the central nave was somewhat wider than the side aisles. The circular apse wall was preserved up to the base of the vault. Parts of a low wall (ḥijāb) separating the choir were also preserved. The outer walls were made of sandstone up to a height of 1.5 meters, and of mud bricks above. The apse and interior walls were entirely made of mud brick. The question of dating is answered differently. Arturo Stenico specifies the second half of the 6th century. William Y. Adams (1965) suggests a construction period between the 7th and 9th centuries, and Peter Grossmann considers the 9th century likely due to a central dome above the central pillars. Barrel vaults are assumed to cover the side aisles.F. W. Deichmann, P. Grossmann: Nubische Forschungen. Berlin 1988, pp. 20–22. == Building inscription of Ikhmindi == In 1958, an undated Greek foundation inscription was found in the southern church, in which, in addition to King Basileus Tokiltoeton and several dignitaries, an Exarch (military leader, governor) Joseph of Talmis (Kalabsha) is named. He’s also mentioned together with Bishop Theodoros of Philae in the inscription commissioned by King Eiparnome in either 559 or 574, which was placed there on the occasion of the conversion of the Temple of Dendur into a church. The written announcement marks the beginning of the widespread Christianization of Lower Nubia and coincides with the first Christian mission to Nubia under the Eastern Roman Emperor Justin II (r. 565–578).John Donelly Fage et al. (eds.): The Cambridge History of Africa. Volume 2, Cambridge University Press, Cambridge 1979, p. 560. Bishop Theodoros of Philae was largely responsible for the Christianization of Nubia. In accordance with to another inscription from the Temple of Philae, which was commissioned by him and dated 577, he was still alive in that year. The Ikhmindi inscription must therefore have been made around this time. It was certainly moved to the southern church at a later time. It was probably originally attached to the south gate. It describes a \"structure\" that was founded under Basileus Tokiltoeton and the exarch. This dates the enclosure wall of Ikhmindi to the second half of the 6th century. The interpretation of the numerous Byzantine honorary titles that the ruler and other Nubian dignitaries also used indicates a strong Byzantine influence on the culture. Political influence from Constantinople on the administration may not be related to this; the awarding of the title seems more likely to have been a takeover by the Egyptian bureaucracy.F. W. Deichmann, P. Grossmann: Nubian Research. Berlin 1988, pp. 81–88. == Literature == * Friedrich Wilhelm Deichmann, Peter Grossmann: Nubian Research. (= Archaeological Research. Volume 17). German Archaeological Institute, Gebrüder Mann, Berlin 1988, ISBN 3-7861-1512-5. * Arturo Stenico: Ikhmindi, a fortified medieval city of Lower Nubia. In: Annali della Facoltà di Lettere e Philosophia dell’Università degli Studi di Milano. (ACME) Volume 13, No. 1, 1960, pp. 31–76. == Weblinks == * Derek A. Welsby: Settlement in Nubia in the Medieval Period. (MS Word; 207 kB) * A Common Trust: The Preservation of the Ancient Monuments of Nubia. UNESCO, 1960 == Notes == Category:Archaeological site in Egypt Category:Archaeological site in Africa Category:Nobatia Category:Ancient Nubian city Category:Coptic Christianity Category:Aswan Governorate",
 "title": "Ikhmindi (Egypt)"
}