{
 "id": "1192540",
 "text": "Omniscriptum Publishing Group is a German-based academic publishing company that specializes in publishing scholarly books, journals, and conference proceedings in various fields of study. The company was founded in 2002 and has since become a prominent player in the academic publishing industry.https://www.omniscriptum.com/ == History == Omniscriptum Publishing Group was established in 2002 with the goal of providing a platform for scholars and researchers to publish their work. Since its inception, the company has published thousands of books and articles in various fields, including humanities, social sciences, and natural sciences, The company was previously specialized in publishing and selling Wikipedia articles, but it announced that the practice of publishing Wikipedia content ended in 2013.https://www.omniscriptum.com/faqcriticism/ In 2007 the group began distributing its publications through Lightning Source,Amazonhttps://web.archive.org/web/20110719070409/http://www.offenes- presseportal.de/medien_kommunikation/vdm_verlag_erweitert_sein_angebot_kostenloser_buchveroeffentlichungen_mit_isbn_19773.htm, and the Germanhttps://web.archive.org/web/20120426050508/http://www.boersenblatt.net/140837/https://archive.ph/20100227205616/http://www.bod.ch/12-april-2007.html company Books on Demand. == Publishing Services == Omniscriptum Publishing Group offers a range of publishing services to authors, including: -Book publishing: The company publishes scholarly books in various formats, including print and digital. -Journal publishing: Omniscriptum publishes several academic journals in various fields of study. -Conference proceedings: The company publishes conference proceedings and abstracts in various fields. -Editing and formatting: Omniscriptum offers editing and formatting services to authors to ensure that their work meets the highest standards of quality. == Imprints == Omniscriptum Publishing Group has several imprints, including: -LAP Lambert Academic Publishing: This imprint publishes scholarly books and journals in various fields of study. -Scholars' Press: This imprint publishes books and journals in the fields of humanities and social sciences. -MoreBooks!: This imprint publishes books and journals in various fields of study. == Criticism and Controversy == Omniscriptum Publishing Group has faced criticism and controversy in recent years, including: -Predatory publishing practices: Some critics have accused the company of engaging in predatory publishing practices, including charging authors fees to publish their work without providing adequate editorial or peer-review services. -Lack of transparency: Some authors have criticized the company for lacking transparency in its publishing practices and fees. == See also == * == External links == * Category:Book publishing companies of Germany Category:Book publishing companies of Latvia Category:Book selling websites Category:Wikipedia-derived encyclopedias Category:Publishing companies established in 2002 Category:Mass media in Saarbrücken Category:Self- publishing companies Category:2002 establishments in Germany == References ==",
 "title": "Omniscriptum"
}