{
 "id": "1192678",
 "text": "Nationalism is the idea of promoting the interests of a particular nation, especially the interests of their country or homeland. Nationalists consider this the best way to avoid oppression by foreign powers. However, nationalism has been criticized by scholars across the political spectrum. ==Overview== Critics of nationalism have argued that it is often unclear what forms a nation. Nationalists hold that the boundaries of a nation and a state should overlap one another, making nationalism tend to oppose multiculturalism. It can also cause conflicts when more than one national group finds itself claiming rights to a particular territory or seeking to take over the state. Nationalism is seen by them as inherently divisive, because nationalists may highlight perceived differences between groups and emphasize individual identifications with their own nations. They also consider the idea potentially oppressive, because it can bury individual identities and give leaders the opportunities to control the masses. ==History== Early opposition to nationalism was related to its geopolitical ideal of a separate state for every nation. 19th-century nationalist movements rejected the very existence of the multi-ethnic empires in Europe, contrary to an ideological critique of nationalism which became several forms of internationalism. The 20th-century Islamic revival also produced an Islamist critique of nationalism.World Book Encyclopedia, 2018 ed., s.v. \"Muslims\" ==A. C. Grayling== Philosopher A. C. Grayling describes nations as artificial constructs: ==George Orwell== George Orwell distinguished nationalism from patriotism, considering it \"power-hunger tempered by self-deception\".George Orwell, Notes on Nationalism , orwell.ru . For Orwell, the nationalist is more likely than not dominated by irrational negative impulses: > A nationalist is one who thinks solely, or mainly, in terms of competitive > prestige. He may be a positive or a negative nationalist—that is, he may use > his mental energy either in boosting or in denigrating—but at any rate his > thoughts always turn on victories, defeats, triumphs and humiliations. He > sees history, especially contemporary history, as the endless rise and > decline of great power units and every event that happens seems to him a > demonstration that his own side is on the upgrade and some hated rival is on > the downgrade. But finally, it is important not to confuse nationalism with > mere worship of success. The nationalist does not go on the principle of > simply ganging up with the strongest side. On the contrary, having picked > his side, he persuades himself that it is the strongest and is able to stick > to his belief even when the facts are overwhelmingly against him. ==Liberalism== Liberals tend to oppose nationalism as a dangerous force and a cause of wars between nation-states. Historian Lord Acton put the case for \"nationalism as insanity\" in 1862, arguing that nationalism suppresses minorities, places country above morality and creates a dangerous individual attachment to the state. He opposed democracy and tried to defend the pope from Italian nationalism. Since the late 20th century, liberals have been increasingly divided, with some philosophers like Michael Walzer, Isaiah Berlin, Charles Taylor and David Miller emphasizing a liberal society's need to be rooted in a stable nation state.Motyl 1:298 ==Marxism== At the end of the 19th century, Marxists, like Rosa Luxemburg, wrote political analyses criticizing the nationalist movements then active in Central and Eastern Europe. However, other Marxists, especially Vladimir Lenin, supported national self-determination more. ==Pacifism== The pacifist critique of nationalism also focuses on the violence of some nationalist movements and the associated militarism. National symbols and patriotic assertiveness are in some countries discredited by their historical link with past wars, especially in Germany. ===Bertrand Russell=== British pacifist Bertrand Russell criticized nationalism for causing an individual to lose his or her capacity to judge his or her fatherland's foreign policy.Russell Speaks His Mind, 1960. Fletcher and son Ltd., Norwich, United Kingdom ===Albert Einstein=== Albert Einstein stated that \"Nationalism is an infantile disease. It is the measles of mankind\". ===Jiddu Krishnamurti=== Jiddu Krishnamurti stated that \"Nationalism is merely the glorification of tribalism\". ==Transhumanism== Transhumanists have also opposed nationalism to the extent that some of them find the dissolution of national identities necessary. ===FM-2030=== The influential transhumanist FM-2030 refused to identify with any nationality, calling himself \"universal\". ===Kate Levchuk=== In The Transhumanist Handbook, Kate Levchuk stated that a transhumanist \"doesn't believe in nationality\". ==Related pages== * Nazism * The Holocaust * Holocaust denial * Bosnian genocide ==Footnotes== ==References== Category:Politics Category:Controversies",
 "title": "Criticism of nationalism"
}