{
 "id": "1192545",
 "text": "\"Seeing Off a Recruit\" is a painting by Russian artist Ilya Repin (1844–1930). He finished it in 1879. The painting is kept in the State Russian Museum in St. Petersburg. It is 143 by 225 cm in size. The painting is connected to important events in Russian history in the 1870s — the change from forced recruitment (called “recruit levies”) to universal military service, and the start of the Russo-Turkish War of 1877–1878. The scene takes place in a typical Russian village yard, where a family is saying goodbye to a young man who is leaving for the army. Repin worked on the painting from 1877 to 1879 in Moscow and in the village of Abramtsevo. The final version was painted for Grand Duke Vladimir Alexandrovich, who bought it in 1879. He hung it in the billiard room of his palace, across from another famous painting by Repin — Barge Haulers on the Volga. The painting was first shown in April 1880 in Moscow at the 8th exhibition of the “Peredvizhniki” (a group of traveling Russian artists). It was later shown in 1881 at the Academy of Arts in St. Petersburg, and again in 1882 at an industrial and art exhibition in Moscow. After the October Revolution in 1918, the painting was moved to the State Russian Museum. Art critic Vladimir Stasov said that some parts of the painting were beautifully done, with great color and skill, but he still thought the painting overall was not very successful — except for the figure of the recruit’s wife, which he found very lifelike and emotional. Artist and art historian Igor Grabar said the center of the painting was the strongest part, showing a new and powerful direction in Repin’s art. He believed this painting showed the beginning of the style that Repin would later use in his famous work Religious Procession in Kursk Province. Although some critics thought the painting was too sentimental, art historian Olga Lyaskovskaya argued that it deserved more respect because it was an important step in Repin’s artistic development. Category:1879 paintings Category:Ilya Repin",
 "title": "Seeing Off a Recruit"
}