{
 "id": "1192433",
 "text": "The Pope is the leader of the Catholic Church. According to Catholic tradition, the first pope was Saint Peter, one of Jesus' apostles. The papacy has a long history, starting from the early Christian Church to the present day. == Early Christianity (30–313) == In the beginning, Christians were often persecuted, and many early popes were martyred. The Church was not yet powerful in politics. This changed when Emperor Constantine legalized Christianity in 313 AD, allowing the Church to grow and gain influence. == Late Antiquity and Early Middle Ages (313–800) == After Christianity became legal, the Church's influence increased. The Pope began to have more authority, both spiritually and politically. Over time, the Pope's role expanded as the Western Roman Empire declined. == Carolingian and Ottonian Periods (800–1048) == In 800 AD, Pope Leo III crowned Charlemagne as Emperor, strengthening the bond between the papacy and European rulers. Later, the Holy Roman Emperors, like Otto I, had significant influence over the Church, including appointing popes. == Reform and conflict (1048–1257) == During this time, the Church sought to reform itself. Pope Gregory VII led the Gregorian Reforms, aiming to free the Church from secular interference. This led to the Investiture Controversy, a conflict over who had the authority to appoint bishops: the Pope or the Emperor. == Avignon Papacy and Western Schism (1257–1417) == From 1309 to 1377, the popes lived in Avignon, France, instead of Rome. This period is known as the Avignon Papacy. After returning to Rome, disagreements led to the Western Schism, where multiple individuals claimed to be the true pope, causing division in the Church. == Renaissance and Reformation (1417–1565) == After the schism ended, the papacy entered the Renaissance, a time of art and culture. Popes like Julius II and Leo X supported artists like Michelangelo. However, corruption and the sale of indulgences led to the Protestant Reformation, challenging the Church's authority. == Counter-Reformation and Baroque Period (1565–1789) == In response to the Reformation, the Church initiated the Counter-Reformation to reform itself and reaffirm its doctrines. The Council of Trent played a significant role in this. The Church also embraced the Baroque style in art and architecture to inspire faith. == Revolutionary era and loss of Papal States (1789–1870) == The French Revolution and other movements reduced the Church's power. In 1870, the Papal States were annexed by the Kingdom of Italy, leaving the Pope without temporal power. This led to the \"Roman Question\" about the Pope's status. == Modern era and Vatican City (1870–present) == In 1929, the Lateran Treaty established Vatican City as an independent state, resolving the Roman Question. Since then, popes have focused on spiritual leadership, human rights, and global issues. Modern popes like John Paul II and Francis have played significant roles in world affairs.",
 "title": "History of the Papacy"
}