{
 "id": "1192928",
 "text": "Gaius or Publius Petronius (died: after 20 BCE) was the second and then fourth prefect of Roman Egypt. =History== Petronius led a campaign into present-day central Sudan against the Kingdom of Kush at Meroë, whose queen Imanarenat had previously attacked Roman Egypt. Failing to acquire permanent gains, he razed the city of Napata to the ground and retreated to the north. Strabo describes a war with the Romans in the 1st century BCE. After the initial victories of Kandake (or \"Candace\") Amanirenas against Roman Egypt, the Kushites of northern Nubia were defeated and Napata sacked.Arthur E. Robinson, \"The Arab Dynasty of Dar For (Darfur): Part II\", Journal of the Royal African Society 28 (1928), pp. 55–67. The destruction of the capital of Napata was not a crippling blow to the Kushites and did not frighten Candace enough to prevent her from again engaging in combat with the Roman military. Gaius Petronius's attack might have had a revitalizing influence on the kingdom. Three years later, in 22 BCE, a large Kushite force moved northward with intention of attacking Qasr Ibrim. Alerted to the advance, Petronius again marched south and managed to reach Qasr Ibrim and bolster its defences before the invading Kushites arrived. The ancient sources give no description of the ensuing battle. At some point the Kushites sent ambassadors to negotiate a peace settlement with Petronius and possibly accept a status like \"Client State\" of Rome. By the end of the second campaign after other years of fighting, however, Petronius was in no mood to deal further with the Kushites. The Kushites succeeded in negotiating a peace treaty on favourable terms and trade between the two nations increased. ==Related pages== *Kingdom of Kush ==References== ==Bibliography== *Edwards, David N. (2004). The Nubian Past. London: Routledge. pp. 348 Pages. . *Leclant, Jean (2004). The empire of Kush: Napata and Meroe. London: UNESCO. pp. 1912 Pages. . *Roger S. Bagnall. Publius Petronius, Augustan Prefect of Egypt. In: Naphtali Lewis (ed.): Papyrology (Yale Classical Studies XXVIII) (1985). S. 85–93. Category:70s BC births Category:1st-century deaths Category:Year of death unknown Category:Roman people",
 "title": "Gaius Petronius (Roman Governor of Egypt)"
}