{
 "id": "1193660",
 "text": "Monirul Islam Prince (born April 18, 1989) is a Bangladeshi recitation artist, author, and software developer. He performs on television and stage, and also works in technology and writing. He is a verified artist on Spotify, Musixmatch, and Boomplay, He also Enlisted artist at Bangladesh Television from 2020 to till now. == Early life and education == Monirul was born in Mymensingh, Dhaka, Bangladesh. He studied Computer Science and Engineering at Dhaka International University. == Career == Monirul started performing recitation in 2012 with the group Swarosruti. He became an enlisted reciter at Bangladesh Television in 2020. He has taken part in many cultural events. In 2019, he was the production manager for the recitation show \"Manushera Manusher Pashe\" by Swarosruti, at the Ganga-Jamuna Cultural Festival at Bangladesh Shilpakala Academy. The show was covered by media including Channel i, RTV Online, and NTV Online. Monirul has worked as a Service Engineer, Project Engineer, and Chief Technology Officer (CTO). He is also part of the ICT committee of the Bangladesh Abritti Somonnoy Parishad. He has created mobile apps like Smart Metro BD, which helps people check Dhaka Metro Rail card balance and trip history. He also runs businesses including Aamra Technologies and Mega Deals LTD. == Books and albums == * Adorer Upobash (Album, 2024) * The Art of Recitation (Book, 2025) == Personal life == Monirul is married to Kaniz Fatima Khayer Anna. He enjoys reading, music, and fine arts. He has one brother and two sisters. == Other websites == * Official website * Discogs profile * MusicBrainz profile * Spotify artist page * Google Books – The Art of Recitation == References == * Channel i – স্বরশ্রুতির আবৃত্তি পরিবেশনা * মঞ্চায়ন হলো স্বরশ্রুতির আবৃত্তি প্রয়োজনা – NTV Online * RTV Online coverage of “Manushera Manusher Pashe” * অনন্য আঙ্গিকে আবৃত্তি প্রয়োজনা – দৈনিক ইত্তেফাক Category:1989 births Category:Living people Category:Bangladeshi writers Category:Bangladeshi artists Category:Software developers Category:People from Mymensingh District",
 "title": "Monirul Islam Prince"
}