{
 "id": "1193938",
 "text": "Ballana () was a cemetery in Lower Nubia. It, along with nearby Qustul, were excavated by Walter Bryan Emery between C.E.1928 and 1931 as a rescue project before a second rising of the Aswan Low Dam. A total of 122 tombs were found under huge artificial mounds. They date to the time after the collapse of the Meroitic state but before the founding of the Christian Nubian kingdoms, around C.E.350 to C.E.600. They usually featured one or several underground chambers, with one main burial chamber. Some tombs were found unlooted, but even the robbed burials still proved to contain many burial goods. The objects found are chiefly of Nubian origin, but there were also many objects imported from Byzantine Egypt and the Mediterranean in general. Most remarkable is a set of crowns from different tombs showing that the richest burials belong to local ruling kings and queens. There were horses and servants buried with their masters. There are few written objects in the burials. The identification of the tomb owners is, therefore, impossible. It has been assumed that these are the burials of the kings and the court of Nobatia. One important tomb discovered here was tomb 118 which consisted of three chambers. It might be described as an example of a royal burial at Ballana and consisted of a main burial chamber and two storage rooms. The roof of the burial chamber had collapsed and the tomb, therefore, escaped looting. The body of the person buried here was found on a bier. It was most likely that of a king. Upon his head was found a crown. Under the bier, were the remains of a large wooden gaming board, weapons and an iron folding chair. There were also skeletons of a young male servant and a cow. In the two storerooms, more skeletons of servants, as well as pottery and several bronze lamps were discovered. The Ballana tombs belong to a culture complex often called X-Group. Following the find of these tombs, this culture is most often called Ballana Culture.TRIGGER, Bruce (1978). The Ballana Culture and the Coming of Christianity. In: The Essays, edited by S. Hochfield and E. Riefstahl, 107-19. Vol.1 of Africa in Antiquity: The Arts of Ancient Nubia and the Sudan. Brooklyn: Brooklyn Museum. The original Ballana cemetery is now flooded by the Nasser Lake. == References == ==External links== * * Category:History of Nubia Category:Archaeological sites in Egypt Category:1928 archaeological discoveries Category:Buildings and structures completed in the 1st century",
 "title": "Ballana (Egypt)"
}