{
 "id": "1193944",
 "text": "Qustul () is an archaeological cemetery located on the eastern bank of the Nile in Lower Nubia, just opposite of Ballana near the Sudan frontier. The site has archaeological records from the A-Group culture, the New Kingdom of Egypt and the X-Group culture. == History == A city of some importance in the Predynastic period (Naqada II) and the Protodynastic period of Egypt, as a trading post on the route to the Kush regions. It was the capital of the proto-state of Qustul, in Lower Nubia, represented with a bird-shaped emblem. Group A is considered Late Neolithic and dates back to the 5th-4th millennium B.C.E. It is a nomadic herding group of cattle and sheep-caprid herders and gazelle hunters. It is related to the populations of the western Nile Desert. They settled sporadically in small villages built with perishable huts and had necropolises with burial mounds. This group appears to have been influenced by the Late Neolithic culture of Khartoum and the Northern Chalcolithic cultures of Nagada and Badarí. T. Säve-Söderberg, 1963, 1964; F.H. Hintze, 1967; H.A. Nordström, 1966, 1972; F. Wendorf, 1968. == A-Group records == Three significant A-group culture cemeteries of the times of the First Dynasty of Egypt have been excavated, which is located in present-day Egypt what was once Lower Nubia at least 5800 years ago. The most important one, cemetery L, revealed wealthy burials of rulers. In one of these graves was found an incense burner believed by Bruce Williams of the Oriental Institute at the University of Chicago depicting images assigned to the Pharaoh including a shape of the White Crown of Upper Egypt.More info about the Qustul Incense Burner retrieved 30 March 2017 Bruce Williams argued in 1987 that his discovery of the Qutsul incense burner advanced no claim of a Nubian origin or genesis for the pharaonic monarchy but that the archaeological data shows Nubian linkages and influence in helping to \"fashion pharaonic civilization\", including detailed excavations of the burial place of the Nubian rulers with date stamps well before the historical First Dynasty of Egypt. The size and wealth of the tombs were also described as vastly greater than that of the well-known Abydos tombs in Egypt. This theory has been directly contradicted by more recent discoveries at Abydos in Upper Egypt which prove that the Egyptian monarchy predates the tombs at Qustul, and that the Qustul rulers probably adopted/emulated the symbols of Egyptian pharaohs.The Birth of an Ancient African Kingdom: Kush and Her Myth of the State in the First Millennium BC Issue 4 of Cahier de recherches de l'Institut de papyrologie et d'égyptologie de Lille: Supplément, Institut de Papyrologie et d'Egyptologie Lille, By László Török, page 98, University of Michigan; ISBN 9782950476432Wegner, J. W. 1996. Interaction between the Nubian A-Group and Predynastic Egypt: The Significance of the Qustul Incense Burner. In T. Celenko, Ed., Egypt in Africa: 98-100. Indianapolis: Indianapolis Museum of Art/Indiana University Press. The archaeological cemeteries at Qustul are no longer available for excavations since the flooding of Lake Nasser. According to David Wengrow, the A-Group polity of the late 4th millenninum BCE is poorly understood since most of the archaeological remains are submerged underneath Lake Nasser. Frank Yurco (1996) stated that depictions of pharonic iconography such as the royal crowns, Horus falcons and victory scenes were concentrated in the Upper Egyptian Naqada culture and A-Group Nubia. He further elaborated that: > \"Egyptian writing arose in Naqadan Upper Egypt and A-Group Nubia, and not in > the Delta cultures, where the direct Western Asian contact was made, further > vititates the Mesopotamian-influence argument\". Kathryn A. Bard wrote in 2003 that cylinder seals, \"unquestionably invented in Mesopotamia\", are found in Naqada II and Naqada III graves, and Mesopotamian motifs are found in Upper Egypt and Lower Nubia, on Naqada II and Naqada III artefacts, which has \"raised the possibility of some southern route of contact between Susa and Upper Egypt, the nature of which is unknown at present.\" She also wrote that: > The A-Group wares were very distinct from the Naqada ones, and Egyptian > products were probably obtained through trade and exchange. It has been > suggested by Bruce Williams that the elite A-Group Cemetery L at Qustul in > Lower Nubia represents Nubian rules who conquered and unified Egypt, > founding the early pharaonic state, but most scholars do not agree with this > hypothesis. Focusing on the A-Group culture (3500–2800 BCE), Michinori argued in 2000 that external influence from Nubia on the formation of Ancient Egypt in the pre- dynastic period to the dynasty period predates influence from eastern Mesopotamia. According to him, chiefs of the same cultural level as Upper Egyptian powers existed in Lower Nubia and exhibited pharaonic iconography before the unification of Egypt. Robert Bianchi wrote in 2004 that the Qustul burner was made from a type of limestone rock which is indigenous to Egypt. He also wrote that: > \"The Egyptian character of the Qustul incense burner has been firmly > established. The vessel can now be shown to be an Egyptian product imported > into Nubia…. There is no comparable corpus of stone in the material culture > of the A-Group Nubians.\" David Wengrow wrote in 2006 that during the late A-Group period, \"the flow of imported goods southwards into Lower Nubia increased progressively.\" He also wrote that: > \"Arguments made by Bruce Williams for the Nubian origins of ancient Egyptian > kingship, based on his analysis of the Qustul material, have not been widely > accepted, and are difficult to reconcile with growing evidence for the > emergence of local elites within Egypt during the Naqada III period.\" Maria Carmela Gatto wrote in 2020 that Bruce Williams' statement was misunderstood as a claim that the Egyptian pharaonic monarchy originated in Nubia, leading to criticism from scholars such as William Y. Adams. Williams explicitly denied making such a sweeping claim, saying that he was only trying to \"raise the strong possibility that Egypt’s founding dynasty originated near Qustul and that the unification was accomplished from Nubia”. Gatto added that the > \"Whatever the claim, the (for some scholars) inconceivable idea of a primary > role for Nubia in the rise of the Egyptian monarchy has been reconsidered > after more recent finds in Upper Egypt dating back to the Naqada I period > the early manifestations of elite iconography.\" Gatto also noted \"That the tombs found in Qustul were exceptional and comparable to those of the earliest Egyptian rulers remains, nevertheless, a fact.\" In 2023, Christopher Ehret re-examined the archaeological findings of Bruce Williams. He argued that William’s findings were challenged at the time of discovery due to long-held assumptions of ancient Egypt “as somehow in but not of Africa”. Ehret cited recent work which revealed the Qustul state was more influential than initially suggested by Williams. Ehret also wrote that: > “The Qustul elite and ruler in the second half of the fourth millennium > participated together with their counterparts in the communities of the > Naqada culture of southern Egypt in creating the emerging culture and > paraphernalia of pharaonic culture”. Bowl with exterior painted scallop decoration, Qustul, Cemetery V, tomb 67, A-Group, 3800-3000 BC, ceramic - Oriental Institute Museum, University of Chicago - DSC08017.JPG|Bowl with exterior painted scallop decoration, Qustul, Cemetery V, tomb 67, A-Group, 3800-3000 BCE, ceramic - Oriental Institute Museum, University of Chicago File:Wierookbrandervoorstelling.jpg|Qustul Incense burner fragments and reconstitution == X-Group records == A necropolis of the X-Group excavated by Walter Emery in 1931–1933 features large grave tumulae with bed burials for the kings with funeral sacrifices of horses, horse trappings and servants from the fourth to the sixth century CE. The royal nature of the burials is confirmed by the presence of bodies which were still wearing their crowns at the time of their discovery.Derek A. Welsby, The kingdom of Kush: the Napatan and Meroitic empires, chapter 9: The Decline and Fall of the Kushite Kingdom, ==References== ==External links== * * Category:History of Nubia Category:Archaeological sites in Egypt Category:Aswan Governorate",
 "title": "Qustul (Egypt)"
}