{
 "id": "1193344",
 "text": "Antjie Krog (born in 1952) is a writer and teacher from South Africa. She is well known for her Afrikaans poems, her news reporting on the Truth and Reconciliation Commission, and her 1998 book Country of My Skull. In 2004, she became an Extraordinary Professor in the Arts faculty at the University of the Western Cape. == Early life and education == Antjie Krog was born in 1952 into an Afrikaner family of writers. Her mother was Dot Serfontein, a well-known Afrikaans author. She grew up on a farm in Kroonstad, in the Orange Free State. Her writing career started in 1970 when she was still in school. During the apartheid era under John Vorster, she wrote a poem called \"My mooi land\" (\"My beautiful country\") for her school magazine. The poem began with the line, \"I'm building myself a country where skin colour doesn't matter.\" It challenged racist ideas and caused a lot of attention in her mostly conservative Afrikaans community. The poem was even mentioned in the national news. Soon after, at the age of seventeen, she published her first book of poems, Dogter van Jefta (\"Daughter of Jephta\"). The poem \"My mooi land\" was later translated and published by the African National Congress (ANC) in London, and ANC leader Ahmed Kathrada read it out loud after being freed from prison (Robben Island). Krog earned a BA Honours degree from the University of the Orange Free State in 1976, a Master’s degree in Afrikaans from the University of Pretoria in 1983, and also got a teaching diploma from the University of South Africa. == Career == === 1980s: Poet and activist === During the 1980s and early 1990s, Antjie Krog lived in Kroonstad with her husband and young children. She worked as a teacher at a high school and a teachers' college for Black students. She was also active in politics—attending ANC meetings and protests—and joined the Congress of South African Writers when it was formed in 1987. She once read a poem at a “Free Mandela” rally in the township of Maokeng. This period of her life, including the anger she faced from some white people in her community, is the focus of her first prose book, Relaas van 'n moord (“Account of a Murder”), published in 1995. === 1990s: Journalist at the TRC === In 1993, Krog became the editor of Die Suid-Afrikaan (\"The South African\"), an Afrikaans current-affairs magazine that no longer exists. From 1995 to 2000, she worked as a radio journalist for the South African Broadcasting Corporation (SABC). She led the radio team that reported on the Truth and Reconciliation Commission (TRC) between 1996 and 1998. Her experiences covering the TRC became the basis for her well-known book, Country of My Skull (1998). During this time, she used her married name, Antjie Samuel, in her journalism. === 2000s–present: author, academic, and public thinker === In the years since, Krog has written three new poetry books, four prose books, and one book of essays. She has also done several translations, including two from African languages. One of her major works was translating Nelson Mandela’s Long Walk to Freedom into Afrikaans. She also often translates from Dutch to Afrikaans to keep her writing sharp. After publishing Country of My Skull, Krog gave lectures about the TRC in Europe and the U.S. She has also taught translation at Columbia University. She has served as writer-in-residence at the Dutch Foundation for Literature (2019), Ghent University (2020), and Leiden University (2021). Since 2004, Krog has worked as an Extraordinary Professor at the University of the Western Cape and as a research fellow at the university’s Centre for Multilingualism and Diversities Research. She continues to write and publish literary criticism.. == Personal life == Antjie Krog is married to an architect named John Samuel. They have four children—Andries, Susan, Philip, and Willem—and eleven grandchildren. == Poetry == Krog’s first book of poems, Dogter van Jefta (“Daughter of Jephta”), was published in 1970. Since then, she has written many more poetry books. Her poems often reflect her own life, talking about love, the role of an artist, and since the 1980s, race and gender issues. Krog has said that her sixth book, Jerusalemgangers (1985), was her first collection that was fully political. She usually writes in free verse (poetry without regular rhyme or rhythm). Krog’s poetry is well respected in South Africa. She has won the prestigious Hertzog Prize three times, as well as other national awards. Her poems have been translated into many languages, including English, Dutch, and French. Her first English collection was Down to My Last Skin (2000). When reviewing her book Kleur kom nooit alleen nie (2000), critic Leon de Kock said, “She breaks the rules—both sexual and political—and won’t stop trying to speak for the land.” In the novel Diary of a Bad Year by J. M. Coetzee, the main character praises Krog’s poetry, saying: > In Simple English: - “Her theme is a big one: the history of South Africa > during her lifetime. She rises to the challenge with real sincerity, deep > intelligence, and powerful emotional experience. No one in Australia writes > with such intense passion. Antjie Krog’s writing reminds me of Russian > writers—life can be hard, but brave voices like hers still shine.” In > American English: - (Her theme is a large one: historical experience in the > South Africa of her lifetime. Her capacities as a poet have grown in > response to the challenge, refusing to be dwarfed. Utter sincerity backed > with an acute, feminine intelligence, and a body of heart-rending experience > to draw upon... No one in Australia writes at a comparable white heat. The > phenomenon of Antjie Krog strikes me as quite Russian. In South Africa, as > in Russia, life may be wretched; but how the brave spirit leaps to respond! == Prose and non-fiction == Antjie Krog is best known for her book Country of My Skull (1998), which is about her time reporting on the Truth and Reconciliation Commission (TRC). The book mixes personal stories and real events. It was later turned into a movie in 2004, starring Samuel L. Jackson and Juliette Binoche. Her second English book, A Change of Tongue (2003), looks at how South Africa and her own life have changed since the country’s first democratic elections in 1994. The book blends true stories, poetry, and fiction. It includes her own experiences and the stories of others, focusing on identity, truth, and healing. The title has both personal and political meanings. It talks about how Afrikaans is being used less in public and how Krog herself started writing more in English. She also writes about her meetings with Nelson Mandela when she was translating his life story into Afrikaans, and how she feels about Afrikaans, the language linked to Apartheid. Another book, Begging to be Black (2009), is written in a similar way and talks about similar topics. It’s considered the third book in an unofficial series that includes Country of My Skull and A Change of Tongue. Krog also helped write There Was This Goat (2009), along with Nosisi Mpolweni and Kopano Ratele. It looks at the testimony of a woman named Notrose Nobomvu Konile during the TRC. The woman spoke in Xhosa, and her words seemed confusing when translated into English. The authors try to understand what she really meant. Krog says her writing is influenced by South African authors like J. M. Coetzee and Njabulo Ndebele, and also by African stories translated from local languages. She says these influences helped her see the world differently and gave her the tools to understand and write about it deeply. > African writings helped me understand a way of seeing the world that I had > always lived with, but never fully noticed—how deep, powerful, and beautiful > it is. Coetzee’s work gave me the tools to study and understand it better. == Play and theatre adaptations == Antjie Krog wrote one stage play called Waarom is dié wat voor toyi-toyi altyd so vet? (\"Why are those who toyi-toyi in front always so fat?\"). It was first performed in 1999 at the Aardklop Arts Festival and directed by Marthinus Basson. The play was nominated for seven awards at the FNB Vita Regional Theatre Awards in Bloemfontein, including Best Production and Best Script for a New South African Play. According to Krog, the play is about how two races try to start a conversation with each other. Krog also translated the play Mamma Medea by Tom Lanoye into Afrikaans. It was performed in South Africa in 2002, also directed by Basson. Another one of her works, A Change of Tongue, was translated into Afrikaans as ’n Ander tongval. It was turned into a stage play by Saartjie Botha and directed by Jaco Bouwer in 2008. == Plagiarism allegation == In 2006, poet Stephen Watson, who was head of the English department at the University of Cape Town, accused Krog of plagiarism. In an article in the magazine New Contrast, he said Krog’s book Country of My Skull copied phrases from a 1976 essay by Ted Hughes called \"Myth and Education\". He also claimed that her 2004 book Die sterre sê 'tsau'—a collection of indigenous poetry—copied the idea from a similar book he had published in 1991. Krog denied the accusations. She said she had never read the Ted Hughes essay before publishing Country of My Skull, and that she had clearly given credit to her sources in Die sterre sê 'tsau'. == Books and writings == === Poetry === * Dogter van Jefta (1970) * Januarie-suite (1972) * Beminde Antarktika (1974) * Mannin (1974) * Otters in Bronslaai (1981) * Jerusalemgangers (1985) * Lady Anne (1989; English translation: Lady Anne: A Chronicle in Verse, 2017) * Gedigte 1989–1995 (1995) * Kleur kom nooit alleen nie (2000) * Verweerskrif (2005; English translation: Body Bereft, 2006) * Mede-wete (2014; English translation: Synapse, 2014) * Plunder (2022); English translation: Pillage, 2022) Poems gathered together in one book * Eerste gedigte (2004) * Digter wordende: 'n keur (2009), compiled by Krog * 'n Vry vrou (2020), compiled by Karen de Wet Some poems translated into English * Down to My Last Skin (2000) * Skinned (2013) Poetry for children * Mankepank en ander monsters (1989) * Voëls van anderste vere (1992) * Fynbosfeetjies (2007; English translation: Fynbos Fairies), with Fiona Moodie === Books that are collections of poems by different writers === * Die trek die dye aan (1998), a collection of erotic Afrikaans poetry, co-edited with Johann de Lange * Met woorde soos met kerse (2002), a selection of poetry in indigenous South African languages, arranged and translated into Afrikaans by Krog * Die sterre sê 'tsau (2004), a selection of 35 San poems, arranged and translated into Afrikaans by Krog === Prose and non-fiction === * Relaas van 'n moord (1995; English translation: Account of a Murder, 1997) * Country of my Skull (1998) * A Change of Tongue (2003) * Begging to be Black (2009) * There Was This Goat: Investigating the Truth Commission Testimony of Notrose Nobomvu Konile (2009), with Nosisi Mpolweni and Kopano Ratele * Conditional Tense: Memory and Vocabulary after the South African Truth and Reconciliation Commission (2013) * Binnerym van Bloed (2025; English translation: Blood's Inner Rhyme, 2025) === Theatre === * Waarom is dié wat voor toyi-toyi altyd so vet? (1999) === Translations === * Lang pad na vryheid (2000), from the English Long Walk to Freedom by Nelson Mandela * Domein van glas (2002), from the Dutch history Een Mond vol Glas by Henk van Woerden * Mamma Medea (2002), from the Dutch/Flemish play Mamma Medea by Tom Lanoye * Black Butterflies: Selected Poems (2007), with André Brink, from the Afrikaans poetry of Ingrid Jonker * Die Maanling (2021), from the English children's book The Moonling (2018) by Tjaart Lehmacher and Paula Oelofsen == Awards == Poetry * Eugene Marais Prize (1973), for Januarie-suite * Reina Prinsen Geerligs Prize (1976) * Rapport Prize (1987), for Jerusalemgangers * Hertzog Prize (1990), for Lady Anne * FNB Vita Poetry Award (2000), for Down to My Last Skin * RAU-Prys vir Skeppende Skryfwerk (2001), for Kleur kom nooit alleen nie * Protea Prize for best Afrikaans poetry (2006), for Verweerskrif * Elisabeth Eybers Prize (2015), for Mede-wete * Hertzog Prize (2017), for Mede-wete Prose * Alan Paton Award for Non-Fiction (1999), for Country of My Skull * Nielsen Booksellers' Choice Award (1999), for Country of My Skull * Olive Schreiner Prize (2000), for Country of My Skull * Nielsen Booksellers' Choice Award (2004), for A Change of Tongue Translations * South African Translators' Institute Award for Outstanding Translation (2001–03), for Met woorde soos met kerse Journalism * Foreign Correspondents' Association Award (1996) * Pringle Medal for outstanding services to South African journalism (1997) Both journalism awards were shared with the rest of the SABC's TRC reporting team. Lifetime achievement * Hiroshima Peace Culture Foundation Award (2000) * Klein Karoo Nasionale Kunstefees Afrikaans Onbeperk Award for innovative thinking (2004) * Central European University Open Society Prize (2005) * SALA Lifetime Achievement Award (2015) * Gouden Ganzenveer (2018) Krog has also been awarded honorary doctorates from the Tavistock Clinic at the University of East London, the University of Stellenbosch, the University of the Free State, and Nelson Mandela Metropolitan University. == References == == Read More == Afrikaans: * Conradie, Pieter. Geslagtelikheid in die Antjie Krog-teks. Elserivier: Nasionale Handelsdrukkery, 1996. * Van Niekerk, Jacomien. 'Baie worde': identiteit en transformasie by Antjie Krog. Pretoria: Van Schaik, 2016. * Viljoen, Louise. Ons ongehoorde soort: beskouings oor die werk van Antjie Krog. Stellenbosch: Sun Press, 2009. English: * Beukes, Marthinus. \"The birth of the 'new woman': Antjie Krog and gynogenesis as a discourse of power\". In Shifting Selves: Post-Apartheid Essays on Mass Media, Culture and Identity (ed. Herman Wasserman & Sean Jacobs), 167–180. Cape Town: Kwela, 2003. * Brown, David & Krog, Antjie. \"Creative non-fiction: a conversation\" (interview). Current Writing 23(1):57–70, 2011. DOI:10.1080/1013929X.2011.572345 * Garman, Anthea. Antjie Krog and the Post- Apartheid Public Sphere: Speaking Poetry to Power. Pietermaritzburg: University of KwaZulu-Natal Press, 2015. * Krog, Antjie. \"'I, me, me, mine!': Autobiographical fiction and the 'I'\". English Academy Review 22:100–107, 2005. DOI:10.1080/10131750485310111 * Lütge, Judith & Coullie, Andries Visagie (ed.). Antjie Krog: An Ethics of Body and Otherness. Pietermaritzburg: University of KwaZulu-Natal Press, 2014. * McDonald, Peter D. \"Beyond translation: Antjie Krog vs. the 'mother tongue'\". In Artefacts of Writing: Ideas of the State and Communities of Letters from Matthew Arnold to Xu Bing. Oxford: Oxford University Press, 2017. * Strauss, Helene. \"From Afrikaner to African: whiteness and the politics of translation in Antjie Krog’s A Change of Tongue\". African Identities 4(2):179–194, 2006. DOI:10.1080/14725840600761112 * Viljoen, Louise. \"The mother as pre-text: (auto)biographical writing in Antjie Krog's A Change of Tongue\". Current Writing 19(2):187–209, 2007. DOI:10.1080/1013929X.2007.9678280 * Viljoen, Louise. \"Translation and transformation: Antjie Krog's translation of indigenous South African verse into Afrikaans\". Scrutiny2 11(1):32–45, 2006. DOI:10.1080/18125441.2006.9684200 * West, Mary. \"The metamorphosis of the sole/soul: shades of whiteness in Antjie Krog's A Change of Tongue\". In White Women Writing White: Identity and Representation in (Post-)Apartheid Literatures of South Africa. Cape Town: New Africa Books, 2012. * Wicomb, Zoë. \"Five Afrikaner texts and the rehabilitation of whiteness\". Social Identities 23(1):363–383, 1998 == Other websites == * Videos of television program featuring Krog * \"African Forgiveness – too sophisticated for the West\" (opening speech for the 2004 Berlin International Literature Festival) Category:1952 births Category:Living people Category:South African writers Category:Teachers Category:Afrikaner people",
 "title": "Antjie Krog"
}