{
 "id": "1193232",
 "text": "Karl Humenberger (* 25 October 1906 in Vienna, Austria-Hungary - 28 December 1989 in Vienna, Austria) was an Austrian football player and football coach. He also played one match for the Austrian national football team. ==Career == Karl Humenberger began his football career at Floridsdorfer AC. He made his first team debut there in the fall of 1926. He followed Leopold Drucker as center half. This position he played throughout his career. In the following years, the team regularly maintained a comfortable mid-table finish and reached the semifinals of the ÖFB Cup in 1928. Then he moved to SK Admira Vienna during the 1930/31 season. At the end of 1931 he left Austria and moved to FC Zurich in Switzerland. After just one season, he returned to Admira. Two league titles and a cup victory were won in the following years. In 1936 he accepted an offer from Racing Strasbourg, where the Austrian Josef Blum was the coach. In the following two years, the club finished in the top third of Division 1. 1937Straßbourgeven reached the French Cup final. In 1938, Humenberger moved to newly promoted AS Saint-Étienne The team reached an excellent fourth-place finish in his final season in France. ==International == He played one match for the Austrian national football team. It was a 0-1 loss versus Czechoslovakia on 1 April 1928. ÖFB Players profile . ==Manager == After the 2nd World war Humenberger worked as a coach in Austria(SV Rapid Lienz , SV Hitiag Neuda, Polizei SV Innsbruck and Newag Eisenstadt, SC Ortmann ). Till 1954 he coached Royal Olympic Club Charleroi in Belgium. He accepted an offer from the Dutch club Ajax Amsterdam in 1954 and coached the team for the next five years. Greatest sucess was winning the Dutch championship in 1957. Humenberger then returned to Austria. There he coached SV Austria Salzburg for one season. The team won the Tauernliga Nord with the team before returning abroad again. He coached FC Dordrecht in the 1960/61 season and Royal Antwerp from 1961 to 1964. After returning to Vienna, he took over as coach of Wiener AC in 1965. ==Honours == ;as player * 1× Mitropacup-final: 1934 * 2× Austrian champion: 1934, 1936 * 1× ÖFB-Cup: 1934 * 1× French Cup runner-up: 1937 * 1 match for the Austrian national football team: 1928 ;as coach * 1× champion Netherlands: 1957 * 1× belgian runner-up: 1963 ==References == Category:1906 births Category:1989 deaths Category:Austrian footballers Category:Austrian football managers Category:FC Red Bull Salzburg managers Category:Austrian football midfielders Category:Austrian football champions",
 "title": "Karl Humenberger"
}