{
 "id": "1193598",
 "text": "Iguazú National Park () is a national park in Argentina. It is in the Iguazú Department. It is in the north part of the province of Misiones, Argentine Mesopotamia. It is big. ==History== People lived in this place 10,000 years ago. They were hunter-gatherers in the Eldoradense people. About 1,000 CE, the Guaraní, pushed the Eldoradense people away. The Guarani made farms. In the 16th century, the Spanish and Portuguese conquistadores pushed the Guarani away too, but many of the names of places come from Guarani words. For example, the river is Guaraní y guasu, \"large water.\" The first European to visit the place was Álvar Núñez Cabeza de Vaca, in 1542. The Jesuits built a place to turn people into Christians in 1609. The government made the place a park in 1934 to protect Iguazu Falls and the subtropical jungle around it. The Iguazú National Reserve was defined by law 18.801 of October 7, 1970 as being the western part of the Iguazú National Park. In the rest of the park, people are not allowed to make too many changes, but in the reserve, people can do and build some things. For example, there are an airport and hotels there now. The Brazilian park Iguaçu National Park is on the other side of the Iguazu River. UNESCO said both parks were a World Heritage Sites in 1984. The park might be part of the proposed Trinational Biodiversity Corridor, which makes a way through the forest in Brazil, Paraguay, and Argentina in the Upper Paraná place. The southeast part of the park is next to the Urugua-í Provincial Park, created in 1990. ==Animals and plants== The park is in the Alto Paraná Atlantic forests ecoregion. Many animals live in the park: jaguar, jaguarundi, South American tapir, ocelot, tirica, anteater, the black-fronted piping guan, the harpy eagle, the yacare caiman, the great dusky swift, large toucans, the coatí, and many butterflies. The vinaceous amazon, named for its wine-colored feathers, is sometimes in this park. The Iguazú River ends in the Paraná River 23 km past the waterfalls, after a 1320 km way. Inside the park, it becomes up to 1,500 m wide. It goes south and then north in a U-shape. Trees grow next to the river, for example the ceibo (Cockspur coral tree), whose flower is Argentina's national flower. There are many plants in the park: lapacho negro and lapacho amarillo (family Bignoniaceae), and palmito trees and the 40-metre-high palo rosa (family Apocynaceae). == Pictures == File:Iguazu National Park-109972.jpg|Plush-crested jay (Cyanocorax chrysops) File:Iguazu National Park-109974.jpg|View of waterfall File:Iguazu National Park-109976.jpg|View of waterfall File:Iguazu National Park-109978.jpg|View of waterfall File:Iguazu National Park-109980.jpg|Distant view of waterfall File:Coatí del Parque Nacional Iguazú.JPG File:Nasenbären im Parque nacional Iguazú 7 (22089877936).jpg File:Nasenbären im Parque nacional Iguazú 9 (22103508692).jpg File:Cataratas del Iguazú, Misiones, Argentina - panoramio.jpg File:Cartel Puerto Iguazú - Acceso al Área Cataratas del Iguazú - Parque Nacional Iguazú (Misiones, Argentina).jpg File:Tucán en el Parque Nacional Iguazú.JPG File:Tren ecológico de la Selva Parque Nacional Iguazú.JPG|Ecological Train File:Perspektiven des Parque nacional Iguazú 70 (21494738873).jpg File:Perspektiven des Parque nacional Iguazú 24 (22103322112).jpg ==Other websites== *Rainforest Ecological Train *Iguaçu National Park (Brazilian side of the park) *Iguazu Falls ==References== ==Sources== * * * * * * ==Other websites== *Official web site *Administración de Parques Nacionales - National Parks Administration of Argentina (in Spanish and English) *World Heritage Site *Iguazu Falls National Park Category:National parks in South America Category:World Heritage Sites in South America Category:Misiones Province",
 "title": "Iguazú National Park"
}