{
 "id": "1193902",
 "text": "A rockfall or rock-fallWhittow, John (1984). Dictionary of Physical Geography. London: Penguin, 1984. . is a quantity of rock that has fallen freely from a cliff face. The word is also used for collapse of rock from roof or walls of mine or quarry workings. A rockfall is \"a fragment of rock (a block) detached by sliding, toppling, or falling, that falls along a vertical or sub-vertical cliff, proceeds down slope by bouncing and flying along ballistic trajectories or by rolling on talus or debris slopes\". A rockfall can also be \"the natural downward motion of a detached block or series of blocks with a small volume involving free falling, bouncing, rolling, and sliding\". The mode of failure differs from that of a rockslide. == Mechanisms == Favourable geology and climate are the main causes of rockfall. These factors include intact condition of the rock mass, discontinuities within the rockmass, weathering susceptibility, ground and surface water, freeze-thaw, root-wedging, and external stresses. A tree may be blown by the wind, and this causes a pressure at the root level and this loosens rocks and can trigger a fall. The pieces of rock collect at the bottom creating a talus or scree. Rocks falling from the cliff may dislodge other rocks and serve to create another mass wasting process, for example an avalanche. A cliff that has favorable geology to a rockfall is sometimes called incompetent. One that is not favorable to a rockfall, which is better consolidated, may be said to be competent. In higher altitude mountains, rockfalls may be caused by thawing of rock masses with permafrost. In contrast, lower altitude mountains with warmer climates rockfalls may be caused by weathering being enhanced by non-freezing conditions. == Mitigation == Rockfall events can be pevented. There are two main modes of prevention: * With passive mitigation, the rockfall is not preventted, but the effects it has are kept small. The rocks may be caught by nets, rockfall catchment fences, galeries, ditches, embankments etc The rockfall still takes place but an attempt is made to control the outcome. * With active mitigation, the rockfall is prevened. Some examples of these measures are rock bolting, slope retention systems, shotcrete, etc. Other active measures might be by changing the geographic or climatic characteristics in the initiation zone, e.g. altering slope geometry, dewatering the slope, revegetation Design guides of passive measures with respect to the block trajectory control have been proposed by several authors.Pantelidis, L. (2010). Rock catchment area design charts. In Proceedings of GeoFlorida 2010 (ASCE) Conference on Advances in Analysis, Modelling and Design (pp. 224-233). == Effects on trees == The effect of rockfalls on trees can be seen in several ways. The tree roots may rotate, via the rotational energy of the rockfall. The tree may move via the application of translational energy. And lastly deformation may occur, either elastic or plastic. Dendrochronology can reveal a past impact, with missing tree rings, as the tree rings grow around and close over a gap; the callus tissue can be seen microscopically. A macroscopic section can be used for dating of avalanche and rockfall events. == References == Category:Pages using div col with small parameter Category:Erosion",
 "title": "Rockfall"
}