{
 "id": "1193123",
 "text": "In the early 20th century, the Irish Republican Army (IRA) was an Irish militant group that fought for Ireland's independence. After Ireland became independent in 1922, the IRA kept fighting what they alleged to be the British occupation of Northern Ireland, where pro-British Protestants made up the majority. * * * The IRA had widespread support among Irish Catholics, who were mostly nationalists believing that Northern Ireland belonged to the Catholic south. As a result, anti-British sentiment was common among Irish Catholics throughout the 1930s and 1940s, * * * * * * when the United Kingdom was fighting Nazi Germany in World War II. The IRA became pro-Nazi, and collaborated with Nazi Germany, * * * * * hoping that the Germans would help them \"reunify\" Ireland within their perceived historical boundaries. ==World War II== In July 1940, the Irish Republican Army (IRA) praised Nazi Germany as the \"friends and liberators of the Irish people\" in a statement, with little to no opposition from the Irish public. Meanwhile, the IRA worked with Nazi spies to plot attacks on British troops in Northern Ireland and circulated materials accusing Éamon de Valera's neutral Irish government of being owned by \"Jews and Freemasons\". Declassified MI5 documents stated that IRA leading figures Seán Russell and James O'Donovan – both veterans of the Irish War of Independence – were the main Irish contacts with Nazi Germany. They got Nazi weapons, plotted joint attacks on British troops and discussed with Hitler a possible German invasion of Northern Ireland to facilitate Irish \"reunification\". Russell told a Nazi official: After Adolf Hitler's death on April 30, 1945, Éamon de Valera, the Prime Minister of Ireland, mourned the death of Hitler * * * * * with backing from the Irish parliament. De Valera also denied reports of the Bergen-Belsen concentration camp as \"anti-national propaganda\", reportedly out of refusal to acknowledge that the Jews could have suffered more than the Irish. ==Nuremberg Trials== Kurt Haller, an anti-Nazi German diplomat, testified in the Nuremberg Trials: Erwin von Lahousen, a Nazi German general, also testified: ==Related pages== * The Troubles * The Holocaust * History of Ireland * Antisemitism in Europe ==Footnotes== ==References== Category:Nazism Category:Catholicism Category:World War II Category:Antisemitism Category:History of Ireland Category:History of the United Kingdom",
 "title": "IRA-Nazi collaboration"
}