{
 "id": "1193964",
 "text": "Spanish Romantic literature was part of the broader European Romantic movement in the 19th century. It emphasized emotion, individualism, and imagination, often reacting against the rationalism of the Enlightenment. == Historical context == Romanticism in Spain emerged after the death of King Ferdinand VII in 1833. This period saw political instability, wars, and a desire for freedom, which influenced writers to explore themes like liberty, nature, and national identity. == Characteristics == * Emotion and Subjectivity: Focus on personal feelings and individual experiences. * Freedom: Rejection of strict rules in favor of creative liberty. * Nature: Use of natural settings to reflect emotions. * Nationalism: Interest in Spain's history, legends, and folklore. * Exoticism and the Supernatural: Inclusion of mysterious and fantastical elements. == Poetry == José de Espronceda: A leading Romantic poet known for his passionate and rebellious works. * \"Canción del pirata\": Celebrates freedom through the figure of a pirate. * \"El estudiante de Salamanca\": A narrative poem blending love, death, and the supernatural. * \"El diablo mundo\": An unfinished philosophical poem exploring human nature. Gertrudis Gómez de Avellaneda y Arteaga (born March 23, 1814 – died February 1, 1873 in Madrid) was a writer and poet from Cuba in the 19th century. Even though she was Cuban, she spent most of her life in Spain. She wrote many poems, plays, and novels. Her most famous book is a novel against slavery called Sab. Carolina Coronado (born in Almendralejo in 1823 – died in Lisbon in 1911) was also an important writer. She spent much of her childhood in the countryside of Extremadura and started writing poetry when she was very young. She married an American diplomat and lived in several foreign countries. After facing personal tragedies, she moved to Lisbon to live quietly, where she died in 1911. Her most important book is Poesías (1852). == Prose == === Historical novels === Writers like Francisco Martínez de la Rosa and Enrique Gil y Carrasco wrote novels set in Spain's past, blending history with fiction. === Costumbrismo === A literary style focusing on everyday life and customs. * Mariano José de Larra: A journalist and satirist who critiqued Spanish society. == Theatre == Romantic theatre broke classical rules, mixing prose and verse, comedy and tragedy. * Ángel de Saavedra, Duke of Rivas: His play \"Don Álvaro o la fuerza del sino\" introduced Romantic drama to Spain. * José Zorrilla: \"Don Juan Tenorio\" remains a staple of Spanish theatre. == Late Romanticism (Post-Romanticism) == In the latter half of the 19th century, Romanticism evolved, focusing more on personal feelings and simpler styles. * Gustavo Adolfo Bécquer: His \"Rimas\" are short, lyrical poems about love and poetry itself. His \"Leyendas\" are prose tales blending reality and fantasy. * Rosalía de Castro: A Galician poet who wrote about longing and identity. ** \"Cantares gallegos\": Celebrates Galician culture and language. ** \"Follas novas\": Reflects on sorrow and social issues. == Anti-Romantic poets == Some poets, like Ramón de Campoamor and Gaspar Núñez de Arce, moved away from Romantic ideals, focusing on realism and contemporary issues. == Bibliography == *Historia de la Literatura Española. El Romanticismo, Juan Luis Alborg, Madrid, Gredos, 1980. *Historia de la Literatura Española. El Siglo XIX (I), Víctor García de la Concha, Madrid, Espasa Calpe, 1998. *La Imaginación romántica, C. M. Bowra, Taurus, Madrid, 1972. *Las Románticas, Susan Kirkpatrick, Castalia, Madrid, 1991. *El alma romántica y el sueño, A. Béguin, Fonde de Cultura Económica, Madrid, 1993. *El Romanticismo, Gras Balaguer, Montesinos, Barcelona, 1988. *El romanticismo español, Vicente Llorens, Madrid, Fundación Juan March, Castalia, 1983. *El romanticismo español, Ricardo Navas Ruiz, Madrid, Cátedra, 1982. *Historia del movimiento romántico en España, E. Allison Peers, Gredos, Madrid, 1954, 2 vols. *\"The internalization o Quest-Romance\", en Romanticism and Consciousness, H. Bloom, New York, Norton, 1970. *Panorama crítico del romanticismo español, Leonardo Romero Tobar, Madrid, Castalia, 1994. *El Romanticismo: tradición y revolución, M. H. Abrams, Visor, Madrid, 1992. *Los orígenes del romanticismo reaccionario español: el matrimonio Böhl de Faber, G. Carnero, Universidad de Valencia, 1978. *Los orígenes del Romanticismo, F. Garrido Pallardó, Barcelona, Labor, 1968. *Entre pueblo y corona. Larra, Espronceda y la novela histórica del Romanticismo, G. Güntert y J.L. Varela, Madrid, UCM, 1986. *La época del Romanticismo (1808–1874), H. Juretschke, Madrid, Espasa-Calpe, 1989. *Trayectoria del romanticismo español Madrid, P. Sebold, Madrid, Crítica, 1983. *De ilustrados y románticos, P. Sebold, Madrid, El Museo Universal, 1952. *Poesía española del siglo XIX, J. Urrutia, Madrid, Cátedra, 1985. *José de Espronceda y su tiempo. Literatura, sociedad y política en tiempos del romanticismo, R. Marrast, Barcelona, Crítica, 1989 (1ª edición, 1974). *El teatro romántico español (1830–1850). Autores, obras, bibliografía, P. Menarini, Bologna, Atesa, 1982. Category:Spanish literature Category:Romantic literature",
 "title": "Spanish Romantic Literature"
}