{
 "id": "1193252",
 "text": "MYTV Broadcasting Sdn Bhd (MYTV) is a Malaysian television broadcasting company based in Cyberjaya, Selangor. It provides free digital terrestrial television (DTT) in the country, considered a first of its kind in the country. The DTT service is officially branded as myFreeview since August 2015, though the legal name of the company remained unchanged A billion MYR deal have been signed with Telekom Malaysia to distribute the services. The set top box has been available for sale as of February 2017, after long delays of building infrastructure and other issues. Its in-house service, myFreeview was officially launched at 6 June 2017. Its main competitor would be the freemium satellite & digital television based service, Astro NJOI which has huge more channels to view. Current coverage for this service in average of 99%. == History == === Developments === Taiwanese company Allion Labs, Inc. has been awarded accreditation from the Standards and Industrial Research Institute of Malaysia (SIRIM) to become the first lab facility for digital television in Malaysia. Around 30 channels have been set to broadcast in the first stage. HbbTV services are also integrated into MYTV service with the usage of Sofia Digital's HbbTV technology. ==== First phase ==== East Coast Peninsular Malaysia has been chosen as the first site for testing followed by East Malaysia, and northern and southern Peninsular Malaysia before reaching Klang Valley. ==== Transmission fee ==== According to MYTV, the initial annual rental fee for a 24-hour free-to-air TV channel was RM12 million for an SDTV channel and RM25 million for an HDTV channel. However, following reports of Media Prima might quit free-to-air transmission due to unviable fees, MYTV may introduce bandwidth based charging, which is already in consideration. On a statement given by MYTV CEO, Michael Chan announced that transmission fees will be waived until June 2018, when Malaysia completes DTT migration by terminating analogue transmission. Rebates will be also given on a case-by- case basis for six months up to the end of 2018. He is also looking to bring the transmission fee down to between RM8 million and RM18 million, since the Malaysian TV market do not accept fees of RM12 million or RM25 million per channel. The transmission cost for each SD and HD channel was eventually revised to RM6.7 million and RM7.4 million respectively per year. === Distributions === According to former Malaysian Communication and Multimedia Minister Ahmad Shabery Cheek, the MYTV Basic decoder would be distributed to around two million select Malaysian households while other recipients would be determined later. All 2 million households had now been determined and it would be sent to recipients house via PosLaju. ==== Types of decoders used by MYTV Broadcasting ==== There would be 3 types of set top boxes (STB) planned for use by MYTV, all with approved certification by \"DTTV Malaysia\". The first one is the trial test decoder, which was distributed to selected households for test transmission (which itself need to return to MYTV and eventually replaced by MYTV Basic STB). There are two standard set-top boxes issued, the first being the \"MYTV Basic\" decoder to be given to 2 million selected households nationwide for free, while the other is the standard \"MYTV Advance\" decoder, which is sold for RM299 excluding GST at Pos Malaysia branches and selected electrical stores. CI slots comes as a standard for both set top boxes, which it may be used for pay TV in the future. The major differences for these set-top boxes is the latter one (MYTV Advance) comes with support for HbbTV while MYTV Basic did not come with such support. MYTV has sign an agreement with Pensonic to distribute MYTV Advance set top box exclusively on 29 November 2016. Digital televisions with \"DTTV Malaysia\" certification can also be used to receive transmission. ==== Requirements to receive a free MYTV test decoder (known as MYTV Basic) ==== * Came from low-income group. * Included in the category of recipients of government aid. While households that are not listed as recipients of government aid can purchased the certified DVB-T2 decoders or Integrated Digital TV (IDTV) from local distributor. It can also be found from online e-commerce platform such as Lazada and Shopee. == Channel list == There are currently 14 Radio and 16 Television Channels listed on myFreeview, as approved by Ministry of Communications. === Television channels === Channel No. Channel Name Channel Owner MYTV Mana Mana 101HD TV1 Radio Televisyen Malaysia 102HD TV2 103HD TV3 HD Media Prima 105 Enjoy TV5 SD Enjoy TV Broadcasting Sdn Bhd 107 NTV7 SD Media Prima 108 8TV SD Media Prima 109 TV9 SD Media Prima 110HD OKEY Radio Televisyen Malaysia 111HD Sukan RTM 112 Awesome TV SD Awesome Broadcasting Sdn Bhd 113HD TV6 Radio Televisyen Malaysia 114HD TV AlHijrah AlHijrah Media Corporation 116 SUKE TV SD DNF Group Sdn Bhd 121HD Bernama TV Bernama 122HD TVS Sarawak Media Group 123HD Berita RTM Radio Televisyen Malaysia === Radio channels === Channel No. Channel Name Channel Owner MYTV Mana Mana 701 Nasional FM Radio Televisyen Malaysia 702 TraXX FM 703 Minnal FM 704 Ai FM 705 Radio Klasik 706 Asyik FM 707 Sabah FM 708 Sabah V FM 709 Sarawak FM 710 Wai FM 711 Bernama Radio Bernama 712 Hot FM Media Prima Berhad 714 Molek FM 716 Kool 101 == Streaming channels on MYTV Mana Mana == === Television === Channel Name Channel Owner MYTV Mana-Mana SEA Today PT Metra Digital Media TV IKIM Institut Kefahaman Islam Malaysia Arirang Korea International Broadcasting Foundation Selangor TV Media Selangor Sdn Bhd CNA Mediacorp Al Jazeera Arabic Al Jazeera Media Network Al Jazeera English Al Jazeera Media Network DW English Deutsche Welle Taiwan Plus Public Television Service AFL TV Amateur Football League MYTV MYTV Broadcasting Sdn Bhd === Radio === Channel Name Channel Owner MYTV Mana-Mana IKIM FM Institut Kefahaman Islam Malaysia 988 FM Star Media Group Berhad Suria FM Star Media Group Berhad Best FM Suara Johor Sdn Bhd Rakita FM Radio Kita Sdn Bhd Fly FM Media Prima Berhad Eight FM Media Prima Berhad == Former channels == ===TV=== * TVRI Nasional (only in MYTV Mana Mana) * MotoRRacing TV (only in MYTV Mana Mana) * Astro Go Shop * WowShop (Malay) * WowShop (Chinese) * Horizon Sports (only in MYTV Mana Mana) * My Cinema Europe (only in MYTV Mana Mana) * British Muslim TV (only in MYTV Mana Mana) * Channel W * Hao Xiang Shopping Channel * Drama Sangat * TVRI World (only in MYTV Mana Mana) ===Radio=== == Transmitters and frequencies == According to MYTV, there are 13 test phase sites which will be operate on the first stage, which it currently covers around 80% of population. MYTV will eventually develop 60 main transmitters and 40 gap fillers which it will cover 98% of population. Based on the information provided by myFreeview, 34 transmission sites are utilized to cover around 95% of Malaysian population via outdoor antenna. == Controversies == === 2018 payment dispute between MYTV and TM for digital launch === myFreeview viewers residing in some/all parts of Sabah, Sarawak, Kelantan, Terengganu, Pahang, Negeri Sembilan, Malacca and Perak are facing prolonged transmission issues since 11 and 25 October 2018, which 20 of 34 transmission sites has been taken down due to a payment dispute between Telekom Malaysia (TM) and MYTV Broadcasting. The remaining 14 sites were planned to be taken down by TM at 1 November but those sites was eventually not taken down after intervention by the Malaysian Communications and Multimedia Commission (MCMC). Digital TV transmission on all 20 affected sites was fully restored on 30 November 2018 after both parties reached a compromise. ==See also== * List of television stations in Malaysia * List of radio stations in Malaysia == References == == External links == * Category:Privately held companies of Malaysia Category:Malaysian companies established in 2014 Category:Mass media companies established in 2014 Category:Television in Malaysia Category:Digital terrestrial television in Malaysia Category:Companies based in Selangor",
 "title": "MYTV Broadcasting"
}