{
 "id": "1193904",
 "text": "Polish Memory Law, officially called the Amendment to the Act on the Institute of National Remembrance of 2018 in Poland, is a partly repealed law that made it criminal for members of the public to claim that Poland was responsible for the Holocaust. The terms that made such speech criminal were removed after international protests. ==Overview== Scholars worldwide see the Law as part of the Law and Justice party-led government's policy to present ethnic Poles as the only victims and heroes in Nazi-occupied Poland, * * * Robert Rozett, “Competitive Victimhood and Holocaust Distortion,” The Israel Journal of Foreign Affairs, XVI (2022); “Distorting the Holocaust and Whitewashing History: Toward a Typology,” XIII: 1 (2019); Yehuda Bauer, “Creating a “Usable” Past: On Holocaust Denial and Distortion,” XIV: 2 (2022); and Jan Grabowski, “The Holocaust and Poland's 'History Policy'” X: 3 (2016). * Joanna Beata Michlic, “The Politics of the Memorialisation of the Holocaust in Poland: Reflections on the Current Misuses of the History of Rescue,” Jewish Historical Studies—Transactions of the Jewish Historical Society of England, LIII: 1 (2022); Piotr Forecki, Po Jedwabnem: Anatomia pamięci funkcjonalnej (Kraków, 2018); Jan Gross, Neighbors: The Destruction of the Jewish Community in Jedwabne (Princeton, 2001). * * * Piotr Forecki, “Domestic ‘Assassins of Memory’: Various Faces of Holocaust Revisionism in Contemporary Poland,” presentation at a symposium in honor of Professor Antony Polonsky called “The Holocaust in Eastern Europe: sources, memory, politics,” March 16, 2021, UCL, London. and a violation of freedom of speech due to its potential of suppressing discussions on Polish collaboration in Nazi-occupied Poland. ==Original bill== The proposed law changes a previous law known as the Act of 18 December 1998 on the Institute of National Remembrance – Commission for the Prosecution of Crimes against the Polish Nation (Dz.U. 1998 nr 155 poz. 1016). Articles added in February 2018 included: * Article 53o: > Protecting the reputation of the Republic of Poland and the Polish Nation > shall be governed by the provisions of the Civil Code Act of 23 April 1964 > (Polish Journal of Laws of 2016, items 380, 585 and 1579) on the protection > of personal rights. A court action aimed at protecting the Republic of > Poland’s or the Polish Nation’s reputation may be brought by a non- > governmental organisation within the remit of its statutory activities. Any > resulting compensation or damages shall be awarded to the State Treasury. * Article 53p: > A court action aimed at protecting the Republic of Poland’s or the Polish > Nation’s reputation may also be brought by the Institute of National > Remembrance. In such cases, the Institute of National Remembrance shall have > the capacity to be a party to court proceedings. * Article 55a: > 1\\. Whoever claims, publicly and contrary to the facts, that the Polish > Nation or the Republic of Poland is responsible or co-responsible for Nazi > crimes committed by the Third Reich, as specified in Article 6 of the > Charter of the International Military Tribunal enclosed to the International > agreement for the prosecution and punishment of the major war criminals of > the European Axis, signed in London on 8 August 1945 (Polish Journal of Laws > of 1947, item 367), or for other felonies that constitute crimes against > peace, crimes against humanity or war crimes, or whoever otherwise grossly > diminishes the responsibility of the true perpetrators of said crimes—shall > be liable to a fine or imprisonment for up to 3 years. The sentence shall be > made public. 2\\. If the act specified in clause 1 is committed > unintentionally, the perpetrator shall be liable to a fine or a restriction > of liberty. 3\\. No offence is committed if the criminal act specified in > clauses 1 and 2 is committed in the course of one's artistic or academic > activity.' * Article 2a: > The crimes of Ukrainian nationalists and members of Ukrainian organizations > collaborating with the Third German Reich, as defined in the Act, are acts > committed by Ukrainian nationalists in the years 1925–1950, involving the > use of violence, terror or other forms of violation of human rights, against > individuals or ethnic groups. One of the crimes of Ukrainian nationalists > and members of Ukrainian organizations collaborating with the Third German > Reich is their involvement in the extermination of the Jewish population and > genocide on citizens of the Second Polish Republic in Volhynia and Eastern > Lesser Poland.\" ==Amendment== The US Department of State opposed the bill, and the Polish government removed Articles 55a and 55b from the bill draft, meaning that it would not become criminal to claim that Poland was responsible for the Holocaust. In June 2018, the Polish parliament spent merely 8.5 hours to pass the bill. The bill's passage makes it a civil offence for someone associated with Poland to make the said claim. ==Reactions== ===Poland=== According to a survey from February 2018, 40% of Poles supported the criminal penalties in the Law, while 51% believed that the issue should be handled differently.The amendment to the Institute of National Remembrance act Centre for Public Opinion Research Research has shown that the Law had the opposite effect of raising global searches for the English phrase \"Polish death camps\" ninefold, while increasing antisemitic expression in public and on social media. ====Scholars==== Legal scholars Aleksandra Gliszczyńska-Grabias, Grażyna Baranowska, and Anna Wójcik state that with the revised version of the Law, \"the risk of violations of individual rights and freedoms remains high\". Meanwhile, legal scholar Patrycja Grzebyk said: Legal scholar Uladzislau Belavusau also said: Furthermore, legal scholar Tomasz Tadeusz Koncewicz said: In addition, constitutional law scholar Wojciech Sadurski said: Mathematician Stanisław Krajewski, co-chair of the Polish Council of Christians and Jews, said: ====Religious groups==== The Polish Bishops' Conference noted a rise in anti-Semitism after the amendment was passed, declaring the phenomenon \"contrary to the Christian tenet of loving one's neighbor\". The Union of Jewish Religious Communities in Poland said the legislation has led to a \"growing wave of intolerance, xenophobia, and anti-Semitism\", making many members fearful for their safety. ===United States=== ====Government==== US Secretary of State Rex Tillerson was disappointed with the Law, saying that the \"enactment of this law adversely affects freedom of speech and academic inquiry.\" The United States Holocaust Memorial Museum (USHMM) said that the Law could not secure a future for Holocaust education, scholarship, and remembrance, hinting at the chances of intimidation, politicization and self- censorship. ====Scholars==== In February 2018, the American Historical Association (AHA) stated that the Law \"a threat both to historians' freedom of speech and to the future of historical scholarship\". The AHA was supported by 50 academic organizations. The Polish Center for Holocaust Research called the Law an \"unprecedented intrusion into the debate about the Polish history\". American jurist Alexander Tsesis said: A letter signed by prominent figures in February 2018, including American historian Anne Applebaum and the third President of Poland Aleksander Kwaśniewski, said: ====Advocacy groups==== The American Jewish Committee (AJC) stated: ===Canada=== ====Scholars==== In his book Intimate Violence: Anti-Jewish Pogroms on the Eve of the Holocaust, Jeffrey Kopstein of the University of Toronto said: ===Israel=== ====Government==== The law damaged Israel–Poland relations. Israel's Foreign Ministry director-general Yuval Rotem said that preserving the memory of the Holocaust takes priority over international relations, saying: Israel's Prime Minister Benjamin Netanyahu accused Poland of Holocaust denial. Israel's Education and Diaspora Affairs Minister Naftali Bennett said: ====Holocaust museum==== Yad Vashem condemned the bill: ===International=== The International Holocaust Remembrance Alliance (IHRA) expressed regret over Polish President Andrzej Duda's signing of the Law into power, adding that the Law would harm the right to free and open research. ==Subsequent events== In February 2023, Profs. Jan Grabowski and Shira Klein * * * published a 57-page article, where they said that the revisionism encouraged by the Law motivated a years-long campaign of Holocaust distortion on English Wikipedia. * * * The years-long campaign of distortion involved the exaggeration of Jewish collaboration with Nazi/Soviet occupiers, invention of Jewish \"war crimes\" against Poles, downplaying of Polish collaboration with Nazi/Soviet occupiers, and blaming Jews for their own suffering: [[File:Bialystok- following-1939-So.jpg|thumb|A photo that (in this version) is featured as figure 1 in the paper, with the caption \"Photograph of a sign in Białystok, wrongly captioned as a Jewish welcoming banner for the Soviets\" (referring to this edit)]] Prof. Grabowski and Dr. Klein also criticized English Wikipedia's administrators and the Wikimedia Foundation's lack of will to handle, leaving the site vulnerable to disinformation: Grabowski is a prominent historian strongly opposed to the Law, which has made him a target of threats. * * * * * In February 2021, Profs. Jan Grabowski and Barbara Engelking were sued in a Polish court over a book in which they discussed the role of Catholic Poles in the Holocaust. * * * * * In August 2021, the Warsaw Court of Appeal dismissed the lawsuit against them. * * * * * In August 2024, Grabowski said that the distortions encouraged by the Law had far-reaching global consequences on the public view of the Holocaust. A trend of Holocaust distortion, some state- sponsored, is also seen in other European countries, including Austria, Croatia, * * * * * Czechia, Hungary, * * * Germany, and Italy. In the book Decoding Antisemitism, co-author Hagen Troschke said that the common strategies of Holocaust distortion consisted of: # Making some Holocaust perpetrators look better than they were # Reducing the Holocaust responsibility to a small group of perpetrators # Doubting the scientifically proven death tollLitvak, Meir, and Esther Webman. 2009. From Empathy to Denial. Arab Responses to the Holocaust. New York: Columbia University Press. # Blaming Jews for the Holocaust # Equating the Holocaust with other crimes against humanity, which is common in academia. * * * * Some scholars said that Holocaust distortion had gone mainstream * * * amid the rise of nationalism across Europe, where Jews were sometimes equated with the disliked Soviet communists against whom the Holocaust was considered \"a reaction\". Some described the phenomenon with the concept mnemonic politics, where nationalist governments distorted the Holocaust by framing their ethnic majority as the victims rather than the Jews or Roma.Kónczal, Kornelia, and Moses, A. Dirk. 2022. “Patriotic Histories in Global Perspective.” Journal of Genocide Research 24 (2): 153–157. CrossRef Google Scholar Such distortion is sometimes rooted in the conspiracy theory that the mainstream Holocaust historiography's focus on Jews is an EU plot to suppress national identitySoroka, George, and Krawatzek, Félix. 2019. “Nationalism, Democracy, and Memory Laws.” Journal of Democracy 30 (2): 157–171. CrossRef Google Scholar and promote \"cosmopolitanism\" and \"multiculturalism\".Ray, Larry, and Kapralski, Sławomir. 2019. “Introduction to the Special Issue – Disputed Holocaust Memory in Poland.” Holocaust Studies 25 (3): 209–219. CrossRef Google Scholar ==Related pages== * Kraków pogrom * Vichy syndrome * Jedwabne pogrom * Szczuczyn pogrom * Holocaust uniqueness debate ==Footnotes== ==References== Category:Law Category:The Holocaust Category:History of Poland Category:Politics of Europe Category:Antisemitism in Europe",
 "title": "Polish Memory Law"
}