{
 "id": "119571",
 "text": "Pioneer 10 is a space probe launched by NASA on March 2 1972. Its aims were to study the planet Jupiter as well as the edges of the Solar System. The spacecraft also carried one of two plaques, the Pioneer plaques. On the plaques were images that held some information about humans and Earth. The other plaque was on Pioneer 11. The plaques were designed by a team lead by Carl Sagan to communicate with extraterrestrial life should the spacecraft come into contact with it. It was launched on March 3, 1972 at 01:50:00 UTC (March 2 local time), by an Atlas-Centaur expendable vehicle from Cape Canaveral, Florida. On July 15, 1972, Pioneer 10 became the first spacecraft that entered the asteroid belt, and then on February 15, 1973, Pioneer 10 exited the asteroid belt. During this period, the spacecraft did encounter some asteroid hits, although fewer than expected. Pioneer 10 was the first spacecraft that explored the fifth planet from the Sun, Jupiter. Photography of Jupiter began November 6, 1973, at a range of 25,000,000 kilometers (16,000,000 mi), and about 500 images were transmitted. On December 4, 1973, Pioneer 10 made the closest approach with Jupiter at a range of 132 250 km (82 180 miles). During the mission, the on-board instruments were used to study the asteroid belt, the environment around Jupiter, the solar wind, cosmic rays, and eventually the far reaches of the Solar System and heliosphere. In 1976, Pioneer 10 passed Saturn's orbit, on February 11, 1979 it passed Uranus's orbit, on April 25, 1983 it passed Pluto, and on June 13, 1983, Pioneer 10 became the first spacecraft that passed Neptune's orbit. The mission came to an official end on March 31, 1997, when Pioneer 10 was by that time at a distance 67 AU, which is 6.2 billion miles from the Sun or 10 billion km from the Sun. On February 17, 1998, Pioneer 10 was surpassed in the distance to the Sun by Voyager 1 at the distance 70 AU (6.5 billion miles or 10.4 billion km) from the Sun. There's not communication with the space probe anymore; the last contact was on January 23, 2003 and on March 2, 2006 a final attempt at contact failed. This was the last time Pioneer 10 was aligned with Earth, and no further contact would be possible. By 2019, Pioneer 10 was predicted to exit the heliosphere and enter interstellar space. On July 18, 2023, Pioneer 10 is predicted to be surpassed in the distance from the Sun by Voyager 2 at the distance 133.93 AU (around 12.45 billion miles or around 20.036 billion km) from the Sun. ==References== Category:Pioneer program Category:1970s in spaceflight",
 "title": "Pioneer 10"
}