{
 "id": "119656",
 "text": "Sehwan Sharif () is a taluka in Jamshoro District, Sindh, Pakistan. The taluka headquarter is Sehwan, the city famous for saint Lal Shahbaz Qalandar. Currently, Sindh government is planning to create Sehwan Sharif District with the combination of Sehwan taluka and Rani Kot Taluka (Planned), Rani Kot Taluka is under planning due to upgrade tourists facilities == History == The city is known for its Muslim patron saint Hazrat Lal Shahbaz Qalandar who lived here in 13th century CE. Lal Shahbaz Qalandar's mausoleum attracts hundred of thousands of faithful Muslims every year. Sehwan Sharif is basically known by the Muslim Sufi saint, philosopher and poet Hazrat Syed Usman Shah Marwandi commonly known as Lal Shahbaz Qalandar ( لال شھباز قلندر). === Colonial Era === In British India, Sehwan Taluka was a part of Sehwan Division of Karachi District. Its headquarters were in the town of Sehwan and it was a tehsil (administrative subdivision) of the district. The taluka was bordered to the north by the talukas of Dadu and Johi, to the east by the talukas of Kazi Ahmed and Moro, and to the south by the talukas of Manjhand and Kohistan Mahal (now Thana Bula Khan). Sehwan Taluka has a ancient history that goes back thousands of years. Siwistan or sewan was the traditional name for sehwan. The shrine of Lal Shahbaz Qalander, a Sufi saint who is thought to have lived in the 12th century, is located in the town of Sehwan. Muslim pilgrims from all over the world frequently visit the shrine. Sehwan was a part of the Talpur kingdom in the 18th century. Sindh was controlled by the Talpur family from 1783 to 1843. Following the British victory over the Talpurs in 1843, Sehwan was given the rank of taluka, and the taluka joined the Karachi district of British India. The taluka was transferred to Larkana from Karachi district in 1901 to create the new Larkana District. Before being combined with the taluka of Dadu to establish the new district of Dadu in 1931, the taluka was still a part of the Larkana district. Sehwan Taluka is currently a part of Sindh, Pakistan's Jamshoro district. In 2004, Sehwan taluka was again combined with Kotri taluka to form a new Jamshoro district. The shrine of Lal Shahbaz Qalander, the remains of the Sehwan Fort, and the Manchhar Lake are just a few of the historical and archaeological monuments that can be found in the taluka. Additionally, the taluka is renowned for its agricultural output, particularly of wheat, sugarcane, and rice. The following are a few significant occasions in Sehwan Taluka's history: Lal Shahbaz Qalander is reputed to have resided in Sehwan in the 12th century. Sehwan was a component of the Talpur kingdom from 1783 to 1843. 1843: The British annex Sehwan Taluka. 1858: Sehwan attained taluka rank. 1901: Sehwan Taluka was moved to the Larkana district. 1931: The talukas of Sehwan and Dadu are combined to create the new district of Dadu. 2004: taluka again combined with Kotri taluka to form a new district Jamshoro. ==References== Category:Tehsils of Sindh Category:Jamshoro District",
 "title": "Sehwan Sharif Tehsil"
}