{
 "id": "119790",
 "text": "Patricia Helen Heaton (born March 4, 1958 in Bay Village, Ohio) is an American actress best known for playing lead character and Ray Barone's wife Debra Barone on the CBS television sitcom Everybody Loves Raymond. She currently stars as Frankie Heck on the ABC sitcom The Middle. She received a star on the Hollywood Walk of Fame on May 22, 2012. ==Early life== Patricia Heaton was born in Bay Village, Ohio, the daughter of Patricia (née Hurd) and Chuck Heaton, who was a sportswriter for The Plain Dealer. Heaton's mother died of an aneurysm when the actress was 12. The fourth of five children, Heaton was raised as a devout Catholic.Green, Jesse. Not Everybody Loves Patricia, The New York Times, December 31, 2006. Retrieved April 1, 2009. Heaton has three sisters, Sharon, Alice, and Frances, and one brother, Michael, who is the \"Minister of Culture\" columnist for The Plain Dealer and a writer for the paper's Friday Magazine. ==Personal life== Heaton has been married to British actor David Hunt since 1990. They have four sons and they divide their time between Los Angeles and Cambridge, Cambridgeshire, England. Her memoir, Motherhood and Hollywood: How to Get a Job Like Mine, was published by Villard Books in 2002. Hunt is Heaton's second husband. After her divorce from her first husband, she went through a self-described \"Protestant wilderness\". Since June 2017, Heaton's first marriage has been annulled by the Catholic Church and has since returned as an observant of Catholicism. Heaton has been open about having plastic surgery; citing having a tummy-tuck and a breast reduction after undergoing four Caesarean sections. ==Filmography== Year Film/TV Role Notes 1989 Alien Nation Amanda Russell 1 episode 1989–1991 Thirtysomething Dr. Silverman 6 episodes 1990 Shattered Dreams Older Dotti (TV Film) 1990 Matlock Ellie Stanford 1 episode 1991 DEA Paula Werner 1 episode 1992 Memoirs of an Invisible Man'' Ellen 1992 Beethoven Brie 1992–1993 Room for Two Jill Kurland 26 episodes 1994 Someone Like Me'' Jean Stepjak 5 episodes 1994 The New Age Anna 1995 Women of the House Natalie Hollingsworth 11 episodes 1996 Party of Five Robin Merrin 2 episodes 1996 Space Jam Woman Fan 1996–2005 Everybody Loves Raymond Debra Barone 1997 Miracle in the Woods Wanda Briggs (TV Film) 1999 The King of Queens Debra Barone 1 episode 2001 A Town Without Christmas'' M.J. Jensen (TV Movie) 2004 The Goodbye Girl Paula McFadden (TV Film) Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie (2005) 2004 Danny Phantom Lunch Lady 1 episode (Voice) 2005 The Engagement Ring Sara Rosa Anselmi (TV Film) 2006 Untitled Patricia Heaton Project Janet Daily TV pilot 2006 The Path to 9/11 Ambassador Bodine (TV Miniseries) 2007 Amazing Grace Producer Won - Christopher Award for best film (2008) 2007–2008 Back to You Kelly Carr 17 episodes Nominated – Satellite Award for Best Actress – Television Series Musical or Comedy (2007) 2008 Front of the Class Ellen Cohen (TV Film) 2009–2018 The Middle'' Frankie Heck Nominated - Critics' Choice Award for Best Actress in a Comedy Series (2011) 2011 Easy to Assemble Mrs. Hullestaad 3 episodes ==Emmy Awards== Heaton won two Outstanding Lead Actress in a Comedy Series Emmy Awards for her work in Everybody Loves Raymond: * for: \"Bad Moon Rising\" (2000) * for: \"The Canister\" (2001) She has been nominated for five others for the same series: * for: \"Be Nice\" (1999) * for: \"A Vote for Debra\" (2002) * \"Baggage\" (2003) * \"Fun with Debra\" (2004) * for: \"Finale\" (2005) ==References== == Other websites == * Category:1958 births Category:Living people Category:American television actors Category:Actors from Ohio Category:Emmy Award winning actors",
 "title": "Patricia Heaton"
}