{
 "id": "119715",
 "text": "Stromatolites from Greek strōma, mattress, bed, stratum, and lithos, rock are special rock-like structures. They usually form in shallow water. They are formed by bacteria such as cyanobacteria. There may also be other types of bacteria and single-celled algae. The mucus secreted by the bacteria collects grains of sediment, and they are stuck together with calcium carbonate, also from the bacteria. This builds up into the structures seen in certain sea- shore bays. Cyanobacteria use water, carbon dioxide, and sunlight to create their food, and expel oxygen as a by-product. The real significance of stromatolites is that they are the earliest fossil evidence of life on Earth. The oldest known stromatolites have been dated between 3,710 million years and 3,695 million years old, and were discovered from an exposed outcrop of metacarbonate rocks in the Isua supracrustal belt (ISB) in Southwest Greenland. The ISB stromatolites predate by over 215 million years the previous evidence for oldest life remains: stromatolites in the 3,480 million year old Dresser Formation of the Pilbara craton in Western Australia. At one time, the oldest known stromatolites were dated to 3,450 million years ago, during the Archaean eon.Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton N.J. For a description of the method used to establish this date, see J. William Schopf 1999. Cradle of Life: the discovery of Earth's earliest fossils. Princeton U. Press (pages 87-89 and figure 3.9). The remarkable precision was possible because the fossils were sandwiched between lava flows that could be precisely dated from embedded zircon crystals. Recent discoveries of older stromatolites shows evidence in accord with genetic molecular clock studies. These have placed the origin of life in the Hadean eon. The ability of cyanobacteria to perform oxygenic photosynthesis is highly significant. Early cyanobacteria in stromatolites are thought to be responsible for increasing the amount of oxygen in the primeval Earth's atmosphere through their continuing photosynthesis. They were the first known organisms to photosynthesize and produce free oxygen. After about a billion years, the effect of this photosynthesis began to make a huge change in the atmosphere. The process, called the Great Oxygenation Event, actually took a long time. Eventually, it killed off most of the organisms which could not live in oxygen. It led to the kinds of environment we know today, where most organisms use and need oxygen.Frei R. et al 2009. Fluctuations in Precambrian atmospheric oxygenation recorded by chromium isotopes. Nature 461 (7261): 250–253. Abstract: Heinrich D. Holland: The oxygenation of the atmosphere and oceans. In: Phil. Trans. R. Soc. B, vol. 361, 2006, p. 903–915 http://rstb.royalsocietypublishing.org/content/361/1470/903.full.pdf == Related pages == *Thrombolite == References == Category:Fossils",
 "title": "Stromatolite"
}