{
 "id": "119851",
 "text": "The Presidents' Trophy is an award presented by the National Hockey League (NHL) to the team that finishes with the most points in the league during the regular season. If two teams tie for the most points, then the trophy goes to the team with the most wins. The winning team is also awarded $350,000 in cash bonuses. The Presidents' Trophy has been awarded 27 times to 15 different teams since first being awarded in 1985. The most recent winner is the New York Rangers for the NHL season. == History == The trophy was introduced at the start of the 1985–86 NHL season by the league's Board of Governors. Before the 1985–86 NHL season, the best team in the league during the regular season was allowed to hang a banner stating \"NHL League Champions\". The winning team is also awarded 350,000 Canadian dollars, to be shared between the team and its players. The Presidents' Trophy winner is guaranteed home-ice advantage in all four rounds of the Stanley Cup playoffs, provided the team goes that far, so it remains the most likely position to produce the cup winner. From 1937 to 1968, the same rules now used for winning the Presidents' Trophy were used to award the Prince of Wales Trophy. With the Modern Era expansion in the 1967–68 season and the start of the West Division, the Wales Trophy was awarded to the team that finished in first place in the East Division during the regular season. However, no trophy was awarded to the team that finished with the best overall record in the league during this period, and no trophy at all was awarded from the 1981–82 season through the 1984–85 season; the Wales and Campbell trophies were transferred to the playoff champions of those conferences in 1981–82. A cash bonus was given to each player on the team with the league's best regular-season record during these years, to which the Presidents' Trophy was added in 1985–86. The only teams to have won the Presidents' Trophy more than twice are the Detroit Red Wings with six and the Washington Capitals with three. However, the Montreal Canadiens have finished first overall 21 times, the most times in league history, although they have yet to win the Presidents' Trophy. Detroit is second with 18 first-overall finishes. ==Winners== Bold Team with the most points ever accumulated in a season during the trophy's existence. Year Winner Points Margin Playoff Result Edmonton Oilers 119 9 1 Lost Division Finals (CGY) Edmonton Oilers 106 6 2 Won Stanley Cup (PHI) Calgary Flames 105 2 1 Lost Division Finals (EDM) Calgary Flames 117 2 2 Won Stanley Cup (MTL) Boston Bruins 101 2 1 Lost Stanley Cup Finals (EDM) Chicago Blackhawks 106 1 1 Lost Division Semifinals (MNS) New York Rangers 105 7 1 Lost Division Finals (PIT) Pittsburgh Penguins 119 10 1 Lost Division Finals (NYI) New York Rangers 112 6 2 Won Stanley Cup (VAN) Detroit Red Wings 070Only 48 games were played in the 1994–95 season due to a lockout. Detroit's 70 points in 48 games extrapolates to 122 points in 84 games, which was the standard season length at the time. 5 1 Lost Stanley Cup Finals (NJD) Detroit Red Wings 131 27 2 Lost Conference Finals (COL) Colorado Avalanche 107 3 1 Lost Conference Finals (DET) Dallas Stars 109 2 1 Lost Conference Finals (DET) Dallas Stars 114 9 2 Won Stanley Cup (BUF) St. Louis Blues 114 6 1 Lost Conference Quarterfinals (SJS) Colorado Avalanche 118 7 2 Won Stanley Cup (NJD) Detroit Red Wings 116 15 3 Won Stanley Cup (CAR) Ottawa Senators 113 2 1 Lost Conference Finals (NJD) Detroit Red Wings 109 3 4 Lost Conference Semifinals (CGY) Detroit Red Wings 124 11 5 Lost Conference Quarterfinals (EDM) Buffalo Sabres 113 0 1 Lost Conference Finals (OTT) Detroit Red Wings 115 7 6 Won Stanley Cup (PIT) San Jose Sharks 117 1 1 Lost Conference Quarterfinals (ANA) Washington Capitals 121 8 1 Lost Conference Quarterfinals (MTL) Vancouver Canucks 117 10 1 Lost Stanley Cup Finals (BOS) Vancouver Canucks 111 2 2 Lost Conference Quarterfinals (LAK) Chicago Blackhawks 77Only 48 games were played in the 2012–13 season due to a lockout. Chicago's 77 points in 48 games extrapolates to 132 points in an 82-game season; this number would have eclipsed Detroit's record by one, and would have tied the record-high of points held by the 1976–77 Montreal Canadiens (the trophy did not exist at the time, and Montreal accomplished the feat in 80 games). 5 2 Won Stanley Cup (BOS) Boston Bruins 117 1 2 Lost Second Round (MTL) New York Rangers 113 3 3 Lost Conference Finals (TBL) Washington Capitals 120 11 2 Lost Second Round (PIT) Washington Capitals 118 7 3 Lost Second Round (PIT) Nashville Predators 117 3 1 Lost Second Round (WPG) Tampa Bay Lightning 128 21 1 Lost First Round (CBJ) Boston Bruins 100Due to the COVID-19 pandemic, the Bruins only played 70 games when the 2019–20 season regular season was curtailed. Under the special 2020 playoff format that was then conducted, with a round-robin tournament for the top four teams in each conference, the Bruins were not guaranteed home-ice advantage in all postseason rounds. Boston's 100 points in 70 games extrapolates to 117 points in an 82-game regular season. 6 3 Lost Second Round (TBL) Colorado Avalanche 82Due to the COVID-19 pandemic, the 2020–21 NHL season was shortened to 56 games. Colorado's 82 points in 56 games extrapolates to 120 points in an 82-game season. 0 (5 regulation wins) 3 Lost Second Round (VGK) Florida Panthers 122 3 1 Lost Second Round (TBL) Boston Bruins 135 22 4 Lost First Round (FLA) New York Rangers 114 1 4 Lost Conference Finals (FLA) ==Related pages== * Stanley Cup == References == ;General * * * ;Specific Category:National Hockey League trophies and awards",
 "title": "Presidents' Trophy"
}