{
 "id": "119960",
 "text": "WWE Unforgiven was a yearly professional wrestling pay-per-view event made by World Wrestling Entertainment (WWE). The event was exclusive to the Raw brand from 2003 to 2006. The first event was an In Your House pay-per-view event. It took place on April 26, 1998 and featured the first Inferno match. The combatants were The Undertaker and his brother (kayfabe) Kane. Unforgiven happened in September from 1999 to 2008. The event was replaced by WWE Breaking Point in 2009. == Event dates and locations == Raw-branded event # Event Date City Venue Main Event Ref. 1 Unforgiven: In Your House April 26, 1998 Greensboro, North Carolina Greensboro Coliseum Complex Stone Cold Steve Austin (c) vs. Dude Love for the WWF World Heavyweight Championship 2 Unforgiven (1999) September 26, 1999 Charlotte, North Carolina Charlotte Coliseum Triple H vs. The Rock vs. Kane vs. Mankind vs. Big Show vs. The British Bulldog in a Six-Pack Challenge for the vacant WWF Championship with Stone Cold Steve Austin as the special guest enforcer 3 Unforgiven (2000) September 24, 2000 Philadelphia, Pennsylvania First Union Center The Rock (c) vs. Chris Benoit vs. The Undertaker vs. Kane in a fatal four-way match for the WWF Championship 4 Unforgiven (2001) September 23, 2001 Pittsburgh, Pennsylvania Mellon Arena Stone Cold Steve Austin (c) vs. Kurt Angle for the WWF Championship 5 Unforgiven (2002) September 22, 2002 Los Angeles, California Staples Center Brock Lesnar (c) vs. The Undertaker for the WWE Championship 6 Unforgiven (2003) September 21, 2003 Hershey, Pennsylvania Giant Center Triple H (c) vs. Goldberg in a Title vs. Career match for the World Heavyweight Championship 7 Unforgiven (2004) September 12, 2004 Portland, Oregon Rose Garden Arena Randy Orton (c) vs. Triple H for the World Heavyweight Championship 8 Unforgiven (2005) September 18, 2005 Oklahoma City, Oklahoma Ford Center John Cena (c) vs. Kurt Angle for the WWE Championship 9 Unforgiven (2006) September 17, 2006 Toronto, Ontario, Canada Air Canada Centre Edge (c) vs. John Cena in a Last Chance Tables, Ladders, and Chairs match for the WWE Championship 10 Unforgiven (2007) September 16, 2007 Memphis, Tennessee FedExForum The Undertaker vs. Mark Henry 11 Unforgiven (2008) September 7, 2008 Cleveland, Ohio Quicken Loans Arena Chris Jericho vs. Batista vs. Kane vs. John \"Bradshaw\" Layfield vs. Rey Mysterio in a Championship Scramble for the vacant World Heavyweight Championship ==References== == Other websites == * WWE Unforgiven Official website ** WWE Unforgiven history",
 "title": "WWE Unforgiven"
}