{
 "id": "119973",
 "text": "The Montevideo Convention on the Rights and Duties of States is a treaty. Today, it is part of customary international law. The treaty was signed at Montevideo, Uruguay, on December 26, 1933, at the Seventh International Conference of American States. At this conference, United States President Franklin D. Roosevelt and Secretary of State Cordell Hull declared the so- called Good Neighbor Policy which opposed U.S. armed intervention in inter- American affairs. Franklin D. Roosevelt tried to reverse the perception of \"Yankee imperialism\" with this treaty. The view of Yankee imperialism was brought about by policies instituted (largely) by his predecessor, President Herbert Hoover. The convention was signed by 19 states, three with reservations (Brazil, Peru and the United StatesList of signatories of the Montevideo Convention). The convention is about what a state is and what rights and duties a state has. The most well-known is article 1, which sets out the four criteria for statehood that have sometimes been recognized as an accurate statement of customary international law: :The state as a person of international law should possess the following qualifications: (a) a permanent population; (b) a defined territory; (c) government; and (d) capacity to enter into relations with the other states. The first sentence of article 3 states explicitly that \"The political existence of the state is independent of recognition by the other states.\" This is known as the declarative theory of statehood. Some have questioned whether these criteria are enough, as they allow less-recognized entities like the Republic of China (Taiwan) or under- or unrepresented entities like the Principality of Sealand, Somaliland or Liberland to claim full status as states. According to the alternative constitutive theory of statehood, a state exists only insofar as it is recognized by other states. It should not be confused with the Estrada doctrine. Some people have attempted make the definition of statehood broader, although they have less support. Founders of non-territorial micronations often say that the requirement in the Montevideo Convention of a defined territory is unjust. Some non-territorial entities, notably the Sovereign Military Order of Malta, are considered subjects of international law, but they do not aspire to be states. == Signatories == The states that signed this agreement are: Honduras, United States of America, El Salvador, Dominican Republic, Haiti, Argentina, Venezuela, Uruguay, Paraguay, Mexico, Panama, Guatemala, Brazil, Ecuador, Nicaragua, Colombia, Chile, Peru, Cuba. The Montevideo Convention only codified existing norms, there is nothing new in the convention. For this reason, it does not only apply to those who signed it, but to all subjects of international law.Harris, D.J. (ed) 2004 \"Cases and Materials on International Law\" 6th Ed. at p. 99. Sweet and Maxwell, London The European Union, in the principal statement of its Badinter Committee,The Badinter Arbitration Committee (full title), named for its chair, ruled on the question of whether the Republics of Croatia, Macedonia, and Slovenia, who had formally requested recognition by the members of the European Union and by the EU itself, had met conditions specified by the Council of Ministers of the European Community on December 16, 1991. follows the Montevideo Convention in its definition of a state as having a territory, a population, and a political authority. The committee also found that the existence of states was a question of fact, while the recognition by other states was purely declaratory and not a determinative factor of statehood.[Opinion No 1., Badinter Arbitration Committee, states that \"the state is commonly defined as a community which consists of a territory and a population subject to an organized political authority; that such a state is characterized by sovereignty\" and that \"the effects of recognition by other states are purely declaratory.\"] Switzerland, although not a member of the European Union, adheres to the same principle, stating that \"neither a political unit needs to be recognized to become a state, nor does a state have the obligation to recognize another one. At the same time, neither recognition is enough to create a state, nor does its absence abolish it.\"[Switzerland's Ministry of Foreign Affairs, DFA, Directorate of International Law: \"Recognition of States and Governments,\" 2005.] ==Related pages== * Sovereignty == References == Category:1933 in the United States Category:International law Category:Montevideo Category:1930s treaties",
 "title": "Montevideo Convention"
}