{
 "id": "120062",
 "text": "The Andy Griffith Show is an American sitcom television series. The series won no awards, but it was very popular in its day. It was #1 in its final year on the air. ==Cast== *Andy Griffith as Sheriff Andy Taylor *Don Knotts as Deputy Barney Fife *Ron Howard as Andy's son Opie *Frances Bavier as Andy's aunt and housekeeper Aunt Bee *Elinor Donahue as Andy's girlfriend and drug store owner Ellie Walker *Jim Nabors as garage mechanic Gomer Pyle *Howard McNear as town barber Floyd Lawson *Aneta Corsaut as Andy's girlfriend and Opie's schoolteacher Helen Crump *Betty Lynn as Barney's girlfriend Thelma Lou *Hope Summers as Aunt Bee's friend Clara Edwards *Jack Dodson as county clerk Howard Sprague *George Lindsey as Gomer's cousin Goober Pyle ==Story== The series is about a sheriff in fictional Mayberry, North Carolina, a friendly, backward town with colorful characters. Andy is a widower with a young son named Opie. His paternal Aunt Bee, lives with them and maintains the home. Andy's friend/cousin (or cousin-in-law), Barney is his oddball deputy/ sidekick. ==Production== The show aired on CBS between October 3, 1960 and April 1, 1968. Griffith, Howard, and Bavier were introduced in an episode of The Danny Thomas Show. The show transitioned to color with the sixth season. The broad, cornball comedy was toned-down and the show was allowed to touch on serious themes. ==Awards== Don Knotts and Frances Bavier won a combined total of six Emmy Awards. Knotts left the show at the end of its fifth black and white season. ==Spinoffs== The series had two spin-off shows and one spin-off movie: *Mayberry: RFD, a sitcom series starring Ken Berry as Sam Jones, a councilman and farmer, and featured most of the characters from The Andy Griffith Show *Gomer Pyle, U.S.M.C. with filling station worker Gomer (Jim Nabors) becoming a Marine *Return To Mayberry, a 1986 NBC TV movie that reunited most of the cast members from the show Category:1960 establishments in the United States Category:1960 television series debuts Category:1968 disestablishments Category:1968 television series endings Category:1960s American television series Category:American sitcoms Category:Black and white television series Category:CBS network shows Category:English-language television programs",
 "title": "The Andy Griffith Show"
}