{
 "id": "120095",
 "text": "Kofi Nahaje Sarkodie-Mensah (born August 14, 1981) is a Ghanaian-born American professional wrestler. He is currently signed to WWE where he wrestles under the ring name Kofi Kingston on the Raw brand and is a part of The New Day with Xavier Woods. Kingston is the first African-born WWE Champion and held the Intercontinental and United States Championships multiple times. He also has won tag team championships in WWE 16 times, only the Dudley Boyz (Bubba Ray and D-Von Dudley) are listed as holding more by WWE (18 times). Kingston originally played the character of a Jamaican wrestler until late 2009. == Filmography == Year Title Role Notes 2012 Kickin' It Himself Episode \"Kickin' It on Our Own\" 2016 Countdown Himself Uncredited 2016 Scooby-Doo! and WWE: Curse of the Speed Demon Himself Voice 2021 The Main Event Himself Cameo 2021 Escape the Undertaker Himself Main star == Championships and accomplishments == * CBS Sports ** Best Moment/Angle of the Year (2019) – * Pro Wrestling Illustrated ** Tag Team of the Year (2012) ** Tag Team of the Year (2015, 2016) ** Ranked No. 4 of the best 500 singles wrestlers in the PWI 500 in 2019 ** Ranked No. 8 of the top 50 tag teams in the PWI Tag Team 50 in 2020 * Sports Illustrated ** Ranked No. 9 of the top 10 male wrestlers in 2019Barrassodec, J., \"The Top 10 Male Wrestlers of 2019\", Sports Illustrated, December 27, 2019. * Wrestling Observer Newsletter ** Best Gimmick (2015) – * WWE/World Wrestling Entertainment ** WWE Championship (1 time) ** WWE Intercontinental Championship (4 times) ** WWE United States Championship (3 times) ** WWE/Raw/World Tag Team Championship (7 times, current) – with Evan Bourne (1), R-Truth (1), Big E (2) and Xavier Woods (5) ** WWE SmackDown Tag Team Championship (7 times) – with Big E (6) and Xavier Woods (7) ** World Tag Team Championship (1 time) – with CM Punk **NXT Tag Team Championship (1 time) – with Xavier Woods ** 13th Grand Slam Champion (under current format; 20th overall) ** 30th Triple Crown Champion (traditional format) ** Third Tag Team Triple Crown Champion – with Xavier Woods ** Bragging Rights Trophy (2010) – with Team SmackDown (Big Show, Rey Mysterio, Jack Swagger, Alberto Del Rio, Edge and Tyler Reks) ** WWE Intercontinental Championship Tournament (2010) ** WWE SmackDown Tag Team Championship Tournament (2018) – with Big E and Xavier Woods ** Slammy Award (2 times) *** \"Tell Me I Did Not Just See That\" Moment of the Year (2012) – *** Ring Gear of the Year (2020) – with Big E and Xavier Woods ** WWE Year-End Award (2 times) *** Men's Tag Team of the Year (2019) – with Big E and Xavier Woods *** Moment of the Year (2019) – ==Footnotes== == References == == Other websites == * * * * Official website Category:Living people Category:African-American wrestlers Category:Ghanaian sportspeople Category:WWE wrestlers Category:1981 births",
 "title": "Kofi Kingston"
}