{
 "id": "120183",
 "text": "The term Australopithecine ('australos' for short) refers to any species in the genus Australopithecus or the genus Paranthropus. These were bipedal genera that lived in the Pliocene–Pleistocene era. == Description == The australopithecines had a brain size not much larger than modern apes. The great increase in brain size of modern man began with the genus Homo: it did not start with the australos. The arrangement of their teeth, especially the dental arcade, was similar to humans. They did not have the large canine teeth characteristic of present-day apes. They were mainly bipedal, but probably capable of climbing and living at least partly in trees. Their arms were longer in proportion to their bodies, and this also suggests their inherited capacity to move above the ground. The efficiency of their walking is difficult to estimate, but they were not so well adapted to bipedalism as humans. The males were much larger than the females, which suggests a family arrangement with a dominant male and several females, as with modern apes. Nothing is known for certain about their use of tools.Klein R.G. The human career:human & biological cultural origins. 2nd ed, Chicago, chapter 4, p144.Wood B.A. 1994. Evolution of australopithecines. In Jones S. Martin R. & Pilbeam D. (eds) 2004. The Cambridge encyclopedia of human evolution. 8th ed, Cambridge University Press. == Classification == Australopithecines are in the hominin tribe of african apes that includes humans and all ancestors of Homo sapiens back to our split from the apes. The australopithecines appeared in the late Miocene epoch: *Australopithecus, about four million years ago (mya) *Paranthropus, about 2.7 mya When used alone, the term refers to both genera together. Australopithecus is sometimes referred to as the \"gracile (slender) australopithecines\", while Paranthropus are also called the \"robust australopithecines\". === Other genera === *Kenyanthropus (3.5 to 3.2) mya is either a separate genus of australos, or a species of Australopithecus. *Ardipithecus (5.6 and 4.4) mya is a Miocene hominin. It had a grasping big toe, and therefore could live in trees as well as on the ground. The term \"facultative biped\" is used. *Sahelanthropus, also a Miocene hominin, lived about seven million years ago (mya). The relationships of this species to the australos is unclear. *Orrorin, at 6.1 to 5.7 mya is known from 20 pieces of bone, and its relationships are unclear. Orrorin is both earlier, by almost 3 million years, and more similar to modern humans than is A. afarensis. The main similarity is that the Orrorin femur is morphologically closer to that of H. sapiens than is Lucy's; there is, however, some debate over this point.Pickford, Martin (December 2001). \"Martin Pickford answers a few questions about this month's fast breaking paper in field of Geosciences\". Essential Science Indicators. == Ancestry == A likely ancestor of the australopithecines is the Ardipithecus genus, which lived in East Africa. The genus Homo (humans) appears about 2.4 million years ago with Homo habilis. Australos moved into mixed savannah/woodland habitats as the climate cooled in the later Miocene. This explains their adaptations to walking or walking plus climbing. It also explains the changes to their diet and teeth, though not in detail. == List == The australopithecines according to Briggs & Crowther are:Briggs D.G. & Crowther P.R. (eds) 2008. Palaeobiology II. Wiley, p600. *Australopithecina **Australopithecus ***A. afarensis ***A. africanus ***A. anamensis ***A. bahrelghazali ***A. garhi **Paranthropus ***P. robustus ***P. boisei ***P. aethiopicus **Ardipithecus ***A. ramidus **Orrorin ***Orrorin tugenensis **Sahelanthropus ***Sahelanthropus tchadensis == References == Category:Miocene",
 "title": "Australopithecine"
}