{
 "id": "120192",
 "text": "US Airways, Inc. was an airlineLean Production in the Air: Low-cost Competition Taking Off in the Global Airline Industry and Implications for Employment Relations , Nancy Johnson, Labor and Employment Relations Association Series, Proceedings of the 58th Annual Meeting' that used to be owned by the US Airways Group, Inc. US Airways was previously known as USAir. It was the sixth largest airline in the United States. Its headquarters were in Tempe, Arizona. US Airways owned 357 large jet aircraft and 329 smaller planes that flew to 240 places in North America, Central America, the Caribbean, Hawaii, and Europe. In May 2008, US Airways had 36,632 people working for them in the world and flew 3,512 flights each day. The US in US Airways stands for United States. ==Flights== US Airways had many flights from Charlotte, North Carolina, Philadelphia, Pennsylvania and Phoenix, Arizona. US Airways also ran smaller numbers of flights from Washington, DC, Las Vegas, Nevada, New York City, and Boston, Massachusetts.US Airways System Fact Sheet. ==Affiliates== The airline also had the US Airways Shuttle. It's a brand which operates frequent flights between cities in the northeast part of the United States. Other companies operate short flights for US Airways, which are called US Airways Express. After the AA combination, the brand is now known as the \"American Shuttle\". ==History== In 2005, US Airways combined with America West Airlines, but they kept the US Airways name. In 2013, US Airways announced it was going to be combined with American Airlines. The combination was completed on April 8, 2015, with the new airline keeping the \"American Airlines\" name. US Airways had it's last flight on October 16, 2015. ==Gallery== File:US Airways 737 N355US.jpg|A US Airways Boeing 737 landing at Boston. File:US Airways (6218972132).jpg File:US Airways 762 N253AY.JPG File:US Airways A333 N275AY.JPG File:US Airways A330 (3458288487).jpg File:Boeing 737-301, USAir AN0201093.jpg|Boeing 737-301 livery in post merger Piedmont USAir hybrid File:Boeing 737-301, USAir AN0208998.jpg File:2345 Crystal Drive Hbrackett.jpg|USAir then US Airways headquarters in Crystal City File:Allegheny Airlines DC-9-31; N950VJ, June 1975 ATZ (5126631925).jpg|Before they were USAir they were Allegheny Airlines ==References== Category:Airlines of the United States category:Companies based in Arizona Category:Tempe, Arizona category:1937 establishments in the United States Category:Star Alliance",
 "title": "US Airways"
}