{
 "id": "120172",
 "text": "Category:1921 births Category:2016 deaths Category:American astronauts Category:American aviators Category:American military personnel of the Korean War Category:American military personnel of World War II Category:American Presbyterians Category:Burials at Arlington National Cemetery Category:American colonels Category:Disease-related deaths in Ohio Category:1984 United States presidential candidates Category:United States senators from Ohio Category:Democratic Party (United States) politicians Category:Businesspeople from Columbus, Ohio Category:Engineers from Ohio Category:Congressional Gold Medal recipients Category:Freemasons Category:Scientists from Columbus, Ohio Category:Politicians from Columbus, Ohio Category:Presidential Medal of Freedom recipients Category:United States Marine Corps personnel Category:Military people from Ohio Former astronaut and U.S. Senator John Glenn died Thursday, Dec. 8, 2016, at the Ohio State University Wexner Medical Center in Columbus. Glenn, who served four terms as a U.S. senator from Ohio, was one of NASA’s original seven Mercury astronauts. His flight on Friendship 7 on Feb. 20, 1962, showed the world that America was a serious contender in the space race with the Soviet Union. It also made Glenn an instant hero. His mission of almost nine days on the space shuttle orbiter Discovery, launched Oct. 29, 1998, when he was 77, made him the oldest human to venture into space. On Discovery he participated in a series of tests on the aging process. The aging population was one focus of his work as a U.S. senator. Glenn was described as “humble, funny, and generous” by Trevor Brown, dean of the John Glenn School of Public Affairs at Ohio State University, in a statement joined by the Glenn family. “Even after leaving public life, he loved to meet with citizens, school children in particular. He thrilled to music and had a weakness for chocolate.” Image Gallery: John Glenn Video: Archival Footage from Glenn’s Mercury Flight He wasn’t sure whether the flaming debris was the rocket pack or the heat shield breaking up. “Fortunately,” he told an interviewer,” it was the rocket pack — or I wouldn’t be answering these questions.” From Ohio to Orbit John Herschel Glenn Jr. was born July 18, 1921, in Cambridge, Ohio. He attended primary and secondary schools in New Concord, Ohio. He received a bachelor of science degree in engineering from Muskingum College in New Concord. Muskingum College is among nine colleges or universities that subsequently awarded him honorary doctoral degrees. Glenn entered the Naval Aviation Cadet Program in March 1942. He graduated and was commissioned in the Marine Corps in 1943. After advanced training, he joined Marine Fighter Squadron 155 and spent a year flying F-4U fighters in the Marshall Islands. He flew 59 combat missions during World War II. After the war, he was a member of Marine Fighter Squadron 218 on the North China patrol and served on Guam. From June 1948 to December 1950 he served as an instructor in advanced flight training at Corpus Christi, Texas. He then attended Amphibious Warfare Training at Quantico, Va. In Korea he flew 63 missions with Marine Fighter Squadron 311. As an exchange pilot with the Air Force Glenn flew 27 missions in the F-86 Sabre. In the last nine days of fighting in Korea, Glenn shot down three MiGs in combat along the Yalu River. Glenn attended Test Pilot School at the Naval Air Test Center, Patuxent River, Md. After graduation, he was project officer on a number of aircraft. He was assigned to the Fighter Design Branch of the Navy Bureau of Aeronautics (now Bureau of Naval Weapons) in Washington from November 1956 to April 1959. During that time he also attended the University of Maryland. In July 1957, while he was project officer of the F-8U Crusader, he set a transcontinental speed record from Los Angeles to New York — 3 hours and 23 minutes. It was the first transcontinental flight to average supersonic speed. Glenn accumulated nearly 9,000 hours of flying time, about 3,000 of it in jets. After his selection as a Mercury astronaut, Glenn was assigned to the NASA Space Task Group at Langley, Va., in April 1959. The Space Task Group was moved to Houston and became part of the NASA Manned Spacecraft Center (now Johnson Space Center in Houston) in 1962. Before his 4-hour, 55-minute flight in the Friendship 7 capsule, Glenn had served as backup pilot for astronauts Alan Shepard, the first American in space who flew on May 5, 1961, and to Virgil “Gus” Grissom, who followed Shepard on a suborbital flight of his own. When astronauts were assigned to provide pilot input for the design and development of spacecraft, Glenn specialized in cockpit layout and control functioning, including some of the early designs for the Apollo Project. Glenn was awarded the Distinguished Flying Cross on six occasions, and holds the Air Medal with 18 Clusters for his service during World War II and Korea. Glenn also received the Navy Unit Commendation for service in Korea, the Asiatic-Pacific Campaign Medal, the American Campaign Medal, the World War II Victory Medal, the China Service Medal, the National Defense Service Medal, the Korean Service Medal, the United Nations Service Medal, the Korean Presidential Unit Citation, the Navy’s astronaut Wings, the Marine Corps’ Astronaut Medal, the NASA Distinguished Service Medal, and the Congressional Space Medal of Honor. Glenn resigned as an astronaut on Jan. 16, 1964. He was promoted to colonel in October 1964 and retired from the Marine Corps on Jan. 1, 1965. He became an executive with Royal Crown International, but took an active part in Ohio politics and environmental protection efforts. He won his Senate seat in 1974, carrying all 88 counties of Ohio. He was re-elected in 1980 with the largest margin in Ohio history. Ohio returned him to the Senate for a third term in 1986, again with a substantial majority. In 1992 he was elected again, becoming the first popularly elected senator from his state to win four consecutive terms. During his last term he was the ranking member of both the Governmental Affairs Committee and the Subcommittee on Air/Land Forces in the Senate Armed Services Committee. He also served on the Select Committee on Intelligence and the Special Committee on Aging. He was considered one of the Senate’s leading experts on technical and scientific matters, and won wide respect for his work to prevent the spread of weapons of mass destruction. He took pride in using his position on the Governmental Affairs Committee to root out waste in government and to clean up the nation’s nuclear materials production plants. In 1998, Glenn flew on the STS-95 Discovery shuttle flight, a 9-day mission during which the crew supported a variety of research payloads including deployment of the Spartan solar-observing spacecraft, the Hubble Space Telescope Orbital Systems Test Platform, and Glenn’s investigations on space flight and the aging process.",
 "title": "John Glenn"
}