{
 "id": "120173",
 "text": "Super OS (formerly: Super Ubuntu) was a free Linux distribution. It was a modified version of Ubuntu made with reconstructor. Its main goal was to provide an ‘Out of the Box’ experience, containing various enhancements over Ubuntu. It had the goal of remaining compatible with Ubuntu. == Features == *Includes an easy way to run executable files and scripts. *Multimedia support: It is prepackaged with support for MP3 files and video-DVDs. *Internet codecs: It includes an additional web browser (Opera), Adobe Flash Player, and more communication software (aMSN and Skype). *Additional software: It also includes, Wine, the GUI for Uncomplicated Firewall, and other software installed by default. ==Tools and software== === App Runner === App Runner is a script included in Super OS that allows any kind of executable or script to be launched without having to use the command line. App Runner was also subject of an article by Lifehacker, saying \"App Runner would come in handy\" and \"there's plenty of scripts and closed-source apps that this would be useful for\". === Live USB === There is also a Windows tool called cd2usb to create Ubuntu and Super OS Live USBs. The program is already included in the DVD of Super OS. ===RUNZ Framework=== The RUNZ Framework is a tool that allows the use of portable apps and something called SuperDebs (an installer with a .deb file + its dependencies that can be installed offline) in Super OS. It is already included in Super OS 9.04 SP 0.1+ ==Software repository== In addition to the official Ubuntu repositories, Super OS also includes its own repositories, which include third-party software like Adobe Reader, Skype, Real Player, TrueCrypt, PeaZip, Google Chrome or Ubuntu calendar, but also include tools/software developed by hacktolive, like App Runner and RUNZ. == Reception and adoption == Super OS had been received mainly with positive reviews, with softpedia saying \"it is a distribution with super powers […] [due to] the inclusion of applications, tools and technologies that are missing from a standard Ubuntu\". Super OS (still with the name Super Ubuntu at the time), was also Lifehacker's featured download saying \"It's basically just a re-compiled version of the official Ubuntu distribution, but with a whole bunch of features included that save you the time of grabbing them yourself\".Super OS was also the OS that the Helios project (a non-profit organization to give away computers to children without the money to buy them) pre-loads on most of the computers they give away. , Super OS was in the top 100 of the page hit ranking of DistroWatch,. ==Related pages== *List of Ubuntu-based distributions == References == == Other websites == *Official website *Super OS coverage and reviews *Official blog *Super OS at DistroWatch *Super OS Archive Category:Linux software Category:Ubuntu (operating system) derivatives Category:Linux distributions Category:Live CD",
 "title": "Super OS"
}