{
 "id": "120559",
 "text": "The National Hockey League Players' Association (; AJLNH) or NHLPA is a labour union that represents the interests of the hockey players in the National Hockey League of North America. == Organization == While the management of daily operations is the responsibility of the NHLPA Executive Director Paul Kelly, the ultimate control over all NHLPA activities resides with the players, who each year elect representatives in order to form an Executive Board. === Executive Directors === *Alan Eagleson, 1967–91 *vacant, 1991–92 *Bob Goodenow, 1992–2005 *Ted Saskin, 2005–07 *Paul Kelly, 2007 - August 31, 2009 *Ian Penny (Interim), August 31, 2009 - October 30, 2009 *Mike Ouellet (Interim), October 30, 2009 - December 18, 2010 *Donald Fehr, December 18, 2010 – present ===Executive Board Members=== Club Representative Alternate Anaheim Ducks Bryan Allen‡ François Beauchemin* Arizona Coyotes David Moss‡ Keith Yandle* Boston Bruins Daniel Paille* TBD Buffalo Sabres John Scott‡ TBD Calgary Flames Matthew Stajan Chris Butler* Carolina Hurricanes Justin Faulk Jay Harrison* Chicago Blackhawks Patrick Sharp* TBD Colorado Avalanche John Mitchell Jean-Sébastien Giguère‡ Columbus Blue Jackets Brandon Dubinsky David Savard Dallas Stars Alex Goligoski Vernon Fiddler* Detroit Red Wings Niklas Kronwall Justin Abdelkader Edmonton Oilers TBD TBD Florida Panthers Krys Barch‡ Jonathan Huberdeau Los Angeles Kings Matt Greene TBD Minnesota Wild Clayton Stoner* Ryan Suter Montreal Canadiens Josh Gorges* Max Pacioretty Nashville Predators TBD Nick Spaling* New Jersey Devils Bryce Salvador‡ TBD New York Islanders John Tavares TBD* New York Rangers Derek Stepan TBD Ottawa Senators Chris Phillips‡ Colin Greening* Philadelphia Flyers Braydon Coburn* Scott Hartnell* Pittsburgh Penguins Craig Adams‡ Brooks Orpik* San Jose Sharks Joe Pavelski Tommy Wingels St. Louis Blues Kevin Shattenkirk* Alex Pietrangelo Tampa Bay Lightning Nate Thompson* Brandon Crombeen* Toronto Maple Leafs TBD TBD Vancouver Canucks Alex Burrows* TBD Vegas Golden Knights TBD TBD Washington Capitals TBD* Troy Brouwer* Winnipeg Jets TBD* Grant Clitsome‡ *Player no longer signed with club. ‡Player has retired. ==References== == Other websites == * National Hockey League Players' Association * National Hockey League Category:1967 establishments in North America Players Association Category:Trade unions in the United States",
 "title": "National Hockey League Players' Association"
}