{
 "id": "120769",
 "text": "Felipe Massa (born April 25 1981 in São Paulo) is a Brazilian Formula One racing driver. In the 2008 racing season he was working for the Ferrari team. His contract allows him to continue driving for that racing team until 2010. In 2008 he is a co-driver of Kimi Räikkönen. Massa was hurt in the 2009 Grand Prix of Hungary qualifying session. He missed the remainder of the 2009 season, but was back for the season. == Racing record == === Career summary === Season Series Team Races Wins Poles Podiums Points Position 1998 Formula Chevrolet Brazil ? ? ? ? ? ? ? 5th 1999 Formula Chevrolet Brazil Team MasterCardteamdan.com, 1999 Brazilian Formula Chevrolet Championship Retrieved 20 August 2009 10 3 ? ? ? ? 1st 2000 Formula Renault 2000 Eurocup Cram Competition 9 3 ? ? 4 140 1st 2000 Formula Renault 2000 Italy Cram Competition 8 4 4 3 5 147 1st 2001 Euro Formula 3000 Draco Junior Team 8 6 6 5 6 60 1st 2001 European Supertouring Championship Team Nordauto 4 0 0 0 0 71 23rd 2001 24 Hours of Sicily Alfa Romeo 1 0 0 0 1 N/A 2nd 2002 Formula One Sauber Petronas 16 0 0 0 0 4 13th 2003 Formula One Scuderia Ferrari Marlboro Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2004 Formula One Sauber Petronas 18 0 0 0 0 12 12th 2005 Formula One Sauber Petronas 19 0 0 0 0 11 13th 2006 Formula One Scuderia Ferrari Marlboro 18 2 3 2 7 80 3rd 2007 Formula One Scuderia Ferrari Marlboro 17 3 6 6 10 94 4th 2008 Formula One Scuderia Ferrari Marlboro 18 6 6 3 10 97 2nd 2009 Formula One Scuderia Ferrari Marlboro 10 0 0 1 1 22 11th 2010 Formula One Scuderia Ferrari Marlboro 19 0 0 0 5 144 6th 2011 Formula One Scuderia Ferrari 19 0 0 2 0 118 6th 2012 Formula One Scuderia Ferrari 20 0 0 0 2 122 7th 2013 Formula One Scuderia Ferrari 19 0 0 0 1 112 8th 2014 Formula One Williams Martini Racing 19 0 1 1 3 134 7th 2015 Formula One Williams Martini Racing 19 0 0 0 2 121 6th 2016 Formula One Williams Martini Racing 21 0 0 0 0 53 11th 2017 Formula One Williams Martini Racing 20 0 0 0 0 43 11th 2018 Stock Car Brasil Cimed Chevrolet Team 2 0 0 0 0 0 NC† 2018–19 Formula E Venturi Formula E Team 13 0 0 0 1 36 15th 2019-20 Formula E ROKiT Venturi Racing 11 0 0 0 0 3 22nd 2020 Porsche Endurance Series ? 3 0 0 0 0 166 5th 2021 Stock Car Brasil Lubrax Podium 19 0 0 0 0 76 22nd* † As Massa was a guest driver, he was ineligible for points. * Season still in progress. === Complete Euro Formula 3000 results === (key) (Races in bold indicate pole position) Year Entrant 1 2 3 4 5 6 7 8 DC Points 2001 Draco Junior Team VLL 1 PER 1 MOZ 1 DON 8 ZOL Ret IMO 1 NÜR 1 VAL 1 1st 60 === Complete Formula One results === (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 WDC Points Sauber Petronas Sauber C21 Petronas 02A 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR GBR FRA GER HUN BEL ITA USA JPN 13th 4 Sauber Petronas Sauber C23 Petronas 04A 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN BEL ITA CHN JPN BRA 12th 12 Sauber Petronas Sauber C24 Petronas 05A 3.0 V10 AUS MAL BHR SMR ESP † MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN CHN 13th 11 Scuderia Ferrari Marlboro Ferrari 248 F1 Ferrari 056 2.4 V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 3rd 80 Scuderia Ferrari Marlboro Ferrari F2007 Ferrari 056 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 4th 94 Scuderia Ferrari Marlboro Ferrari F2008 Ferrari 056 2.4 V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN † EUR BEL ITA SIN JPN CHN BRA 2nd 97 Scuderia Ferrari Marlboro Ferrari F60 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 11th 22 Scuderia Ferrari Marlboro Ferrari F10 Ferrari 056 2.4 V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 6th 144 Scuderia Ferrari Marlboro Ferrari 150º Italia Ferrari 056 2.4 V8 AUS MAL CHN TUR ESP MON CAN EUR 6th 118 Scuderia Ferrari GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA Scuderia Ferrari Ferrari F2012 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA 7th 122 Scuderia Ferrari Ferrari F138 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 8th 112 Williams Martini Racing Williams FW36 Mercedes PU106A Hybrid 1.6 V6 t AUS MAL BHR CHN ESP MON CAN † AUT GBR GER HUN BEL ITA SIN JPN RUS USA BRA ABU 7th 134 Williams Martini Racing Williams FW37 Mercedes PU106B Hybrid 1.6 V6 t AUS MAL CHN BHR ESP MON CAN AUT GBR HUN BEL ITA SIN JPN RUS USA MEX BRA ABU 6th 121 Williams Martini Racing Williams FW38 Mercedes PU106C Hybrid 1.6 V6 t AUS BHR CHN RUS ESP MON CAN EUR AUT † GBR HUN GER BEL ITA SIN MAL JPN USA MEX BRA ABU 11th 53 Williams Martini Racing Williams FW40 Mercedes M08 EQ Power+ 1.6 V6 t AUS CHN BHR RUS ESP MON CAN AZE AUT GBR HUN BEL ITA SIN MAL JPN USA MEX BRA ABU 11th 43 Driver failed to finish the race, but was classified as they had completed more than 90% of the race distance. == References == == Other websites == * The official website for Felipe Massa Category:1981 births Category:Living people Category:Formula One current Category:Brazilian Formula One drivers Category:Racecar drivers from São Paulo",
 "title": "Felipe Massa"
}