{
 "id": "120832",
 "text": "Mohenjo-daro (; ) is an ancient city in Pakistan. It was built around 2500 BCE and was the biggest town in the ancient Indus Valley civilization. It's one of the earliest big cities in the world, like the ones in Egypt, Mesopotamia, Crete, and Norte Chico. People also call it the 'Mound of the Dead Men'. It is in province of Sindh, Pakistan. The city was built around 2600 BC. It was one of the early urban settlements in the world. Mohenjo-daro existed at the same time as the civilization of ancient Egypt, Mesopotamia and Greece. The archaeological ruins of the city are designated a UNESCO World Heritage Site. In Pakistan, it is one of the national icons of the distant past.Aitzaz Ahsan 1997. Indus saga and the making of Pakistan Karachi: Oxford University Press. ==Historical context== Mohenjo-daro was built in the 26th century BC.Ancientindia.co.uk. Retrieved 2012-05-02. It was one of the largest cities of the ancient Indus Valley Civilization, which developed around 3000 BC from the prehistoric Indus culture. At its height, the Indus Civilization spanned much of what is now Pakistan and some parts of northwest India. It also had an outpost in Bactria. There were major urban centers at Harappa, Mohenjo-daro. Mohenjo-daro was the most advanced city of its time, with remarkably sophisticated civil engineering and urban planning.Dani A.H. 1992. Critical assessment of recent evidence on Mohenjo-daro. Second International Symposium on Mohenjo-daro, 24–27 February 1992. When the Indus civilization went into sudden decline around 1900 BC, Mohenjo-daro was abandoned.Kenoyer, Jonathan Mark 1998. Indus cities, towns and villages. Ancient Cities of the Indus Valley Civilization. Islamabad: American Institute of Pakistan Studies. p.65 == Artifacts == The Dancing girl found in Mohenjo-daro is an artifact that is some 4500 years old. The 10.8 cm long bronze statue of the dancing girl was found in 1926 from a house in Mohenjo-daro. She was British archaeologist Mortimer Wheeler's favorite statuette, as he said in this quote from a 1973 television program: :\"There is her... pouting lips and insolent look in the eyes. She's about fifteen years old I should think, not more, but she stands there with bangles all the way up her arm and nothing else on. A girl perfectly, for the moment, perfectly confident of herself and the world. There's nothing like her, I think, in the world\". John Marshall, one of the excavators at Mohenjo-daro, described her as a vivid impression of the young ... girl, her hand on her hip in a half-impudent posture, and legs slightly forward as she beats time to the music with her legs and feet. A seated male sculpture is the so-called \"Priest King\" (even though there is no evidence that either priests or kings ruled the city). Archaeologists discovered the sculpture in Lower town at Mohenjo-daro in 1927. It was found in an unusual house with ornamental brickwork and a wall niche and was lying between brick foundation walls which once held up a floor. This bearded sculpture wears a fillet around the head, an armband, and a cloak decorated with trefoil patterns that were originally filled with red pigment. == References == Category:Archaeological sites in Pakistan Category:Ancient history of Pakistan Category:World Heritage Sites in Pakistan Category:Ancient settlements Category:3rd millennium BC",
 "title": "Mohenjo-daro"
}