{
 "id": "121137",
 "text": "Tricastin is a nuclear power plant in France. It has 4 reactors, which each generate 915 MW, for a total of 3.6 TW. It is next to the highway, about halfway between Valence-sur-Rhône and Avignon. It is on the River Rhône. It was built form 1974 to 1981; the first reactors started working in 1980. It has been criticized several times, because of incidents: *The French control authority said in 2002 that certain means of cooling would not work when there was an earthquake. *A study done in 2004 said that tests done at the site showed that firefighters needed 37 minutes to bring a fire under control. This is too long, and mostly related to the lack of training. According to the report, this makes it impossible to extinguish a bigger fire.http://www.asn.gouv.fr/Actualite/lds/maj/2004-38/INS_2004_EDFTRI0023.PDF *In 2003, the temperature of the water of the canal next to the site was higher than allowed, for a total of over 44 hours. The autorized limit was 27 °C, the measured temperature was 28.8 °C. *Between July 7 and July 8, 2008, a solution containing Uranium was spilled on the site; about 75 kg of a total of about 250 kg reached nearby rivers., during cleaning works. The incident has been classified at level 1 of 8 of the International Nuclear Event Scale. The company doing the uranium enrichment was closed.Nucléaire : Socatri priée de stopper l'activité de Tricastin, Europe 1, 11 juillet 2008 French authorities have banned the use of water from the respective rivers for drinking and watering of crops. Swimming, water sports and fishing were also banned. Measurements done 3 days later on the site revealed radiation levels that could not be explained by the facts cited, alone. The leader of the investigation team said that there probably had been similar incidents earlier that were not reported.De l'uranium suspect décelé dans la nappe phréatique au Tricastin Le Monde, 14 juillet 2008.Un taux d'uranium suspect découvert au Tricastin , Le Figaro, 15 juillet 2008. *In July 2008, about 100 employees were exposed to radioactive particles that escaped from a pipe in a reactor that had been shut down. *On August 21, 2008 workers replacing a drain pipe detected a broken valve. Because of this, radioactive uranium would occasionally spill into the sourrounding environment. A study is currently under way to determine how much uranium escaped, those running the power plant talk of about 250g per year. ==References== Category:Nuclear power plants in Europe",
 "title": "Tricastin nuclear power plant"
}