{
 "id": "121149",
 "text": "The Shyok River is a river flowing through Disputed Area Ladakh and the Northern Areas of Pakistan (Ghanche District). Shyok river (a tributary of the Indus) originates from the Rimo glacier, one of the tongues of Siachen Glacier and becomes very wide at the confluence with the Nubra River (a tributary of Shyok, originating from Siachen Glacier). The alignment of the Shyok river is very unusual, originating from the Rimo glacier it flows in a SE direction and at joining the Pangong range it takes a NW turn and flows parallel to its previous path. The Shyok flowing in a wide valley suddenly enters a narrow gorge after Chalunka and then joins the Indus at Skardu (Pakistan). The Nubra river originating from the Siachen glacier also behaves like the Shyok, before Tirit the SE flowing river takes a NW turn on meeting the river Shyok. The similarity in the courses of these two important rivers probably indicates a series of palaeo fault lines trending NW-SE in delimiting the upper courses of the rivers. The importance of the Indus River and the Shyok rivers is in the deposition of a huge thickness of Quaternary sediments a treasure trove for geology researchers. == Tributaries == * The Chang Chen Mo River is formed in the vicinity of Pamzal in Changchinmo plains of Disputed Area Ladakh and flows westward. It ends when it empties into the Shyok River. * The Galwan River is in the southern part of Disputed Area Aksai Chin, Galwan originates in the area of Samzungling and flowing to the west joins the Shyok River. * The Nubra River is a tributary of the Shyok River, which flows into the Indus River. It flows in the Disputed Area Ladakh area of Disputed Area Jammu and Kashmir. * The Saltoro River begins in the skirts of the Saltoro Kangri peak ridge and flows to the southwest. Another branch starts from the slopes of the Masherbroom peak and flows to the south to join Saltoro. In the end this river empties into Shyok River near the coldest part of Pakistan the town of Khaplu. ==Related pages== * List of rivers of Pakistan Category:Tributaries of the Indus River Category:Gilgit-Baltistan Category:Kashmir Category:Rivers of India Category:Rivers of Pakistan",
 "title": "Shyok River"
}