{
 "id": "121161",
 "text": "The Gilgit River () is a tributary of the Indus River, and flows past the town of Gilgit. It is in the Northern Areas of disputed Kashmir, Pakistan. == Tributaries == * The Ghizar River is the source of this river is the south of Shandoor pass in the western frontiers of Gilgit. Different streams flowing to the north join each other and take the shape of river near Chhashi. It then turns to the southeast and joins the Ishkuman River near Gupis and proceeds farther to Gakooch. From this point the river is named Gilgit. Flowing near Sher Qilla it reaches Gilgit town, where the river Hunza from north joins it. ** The Ishkuman River begins at Ishkuman where many streams meet. The streams come from the north western boundaries of Gilgit in the Hindu Kush range of mountains. At Ishkuman these streams join to make the Ishkuman River which flows south, passing through Chitarkhand. It ends where it joins into the Ghizar River at Gakooch. ** The Yasin River begins in the glaciers near Darkot, and passes in to the north western frontiers of Gilgit and flows south to the join the Ghizar River near Gupis. * The Hunza River () is the main river in Hunza, in the Northern Areas of Pakistan. It is formed by the confluence of the Khunjerab River, Gujerab River, Misgar River, Chapursan River and Shimshal River. These rivers are fed by glaciers. After flowing to south up to Nagar it turns to west. From Chalit it again takes a turn to the south. Flowing through Nomal Valley, it reaches Gilgit city and empties out into Gilgit River. It joins the Gilgit River with the Naltar River. Later it flows into the Indus River. ** The Hispar River forms from the melt water of the Hispar Glacier - a 49 kilometer-long glacier in the Northern Areas of Pakistan's Karakoram Mountains. The Hispar Glacier and river both flow northwest, passing through Hispar, Hopar and Nagar (Nagir) villages until the confluence with the Hunza River in the Hunza Valley. Road conditions are spectacular at best, treacherous at worst. ** The Khunjerab River begins in the snow clad mountains and glaciers in the north and south of Khunjerab pass. The river flows to the west then turns southward. It ends when it flows into the Hunza River. *** The Chapursan River begins in the area of the Chilanji pass and the slopes of Kampiri Diwar peak. It flows to the east and joins Khunjerab River near Khuda Abad. *** The Gujerab River starts from small glaciers and snow-topped mountains of the Gujerab range, and flows to the west and later joins Khunjerab River. **** The Misgar River begins in the slopes of the mountains between Mintaka and the Kilik pass on the northern boundary of Gilgit. It flows to the south east and ends when it empties into the Khunjerab River. *** The Shimshal River begins in the Shimshal pass from Virjirab and other glaciers. This is in the north eastern region of the Gilgit Agency. It flows to the west and after reaching Passu it joins the Khunjerab River. Later the Khunjerab River joins the Hunza River. ==Related pages== * List of rivers of Pakistan Category:Rivers of Pakistan Category:Tributaries of the Indus River",
 "title": "Gilgit River"
}