{
 "id": "121254",
 "text": "Undertow is Tool's first full-length album, released in 1993. When this album was released, grunge music was at its most popular, and pop punk was slowly beginning to become popular. Undertow helped heavy metal music continue as a leading mainstream musical style, and allowed several later bands to break through to the mainstream. Allmusic saw the album's success in the \"striking, haunting visuals that complemented the album's nihilistic yet wistful mood.\" It was eventually certified double platinum by the RIAA on May 14, 2001. The album was recorded between October and December 1992 at Grand Master Studios, Hollywood, California, and includes songs that the band decided to not release on their previous EP, Opiate. ==Track listing== ===CD=== All songs written by Tool unless otherwise noted. :1. \"Intolerance\" – 4:53 :2. \"Prison Sex\" – 4:56 :3. \"Sober\" - 5:06 :4. \"Bottom\" - 7.13 (Tool, Henry Rollins) :5. \"Crawl Away\" - 5:29 :6. \"Swamp Song\" - 5:31 :7. \"Undertow\" - 5:21 :8. \"4°\" - 6:02 :9. \"Flood\" - 7:45 :69. \"Disgustipated\" - 15:47 \"Disgustipated\" is track 69 on most pressings in North America (causing most CD players upon reaching the end of track 9 to advance through tracks 10-68, which contain no data, at a rate of about 2 per second until track 69 is reached). It also appears as track 39, track 10 (mostly in Europe) or as a hidden track following \"Flood\" on track 9. On certain Japanese imports, \"Disgustipated\" is track 70, with a short live version of \"Flood\" as track 71. The exact breakdown of \"Disgustipated\" is as follows:) :Percussion/Animal sounds - 0:00 - 1:10 :Preacher - 1:11 - 2:32 :Disgustipated - 2:33 - 6:45 :Crickets - 6:46 - 13:50 :Phone message - 13:51 - 15:47 ===LP=== ====Side one==== #\"Intolerance\" #\"Prison Sex\" #\"Sober\" ====Side two==== #\"Bottom\" #\"Crawl Away\" #\"Swamp Song\" ====Side three==== #\"Undertow\" #\"4°\" #\"Flood\" ====Side four==== #\"Disgustipated\" ==Charting== ===Albums=== Year Chart Position 1993 Billboard 200 50 1993 Top Heatseekers 1 ===Singles=== Year Single Chart Position 1993 \"Sober\" Mainstream Rock Tracks 13 1994 \"Prison Sex\" Mainstream Rock Tracks 32 1994 \"Sober\" Mainstream Rock Tracks 23 ==Accolades== Publication Country Accolade Year Rank Raw UK Albums of the Year 1993 6 Raw UK 90 Essential Albums of the 90s 1995 * Visions Germany The Best Albums 1991-96 1996 * Pause & Play US The 90s Top 100 Essential Albums 1999 11 Classic Rock UK The 100 Greatest Rock Albums of All Time 2001 87 (*) designates unordered lists. == References == Category:1993 albums Category:Debut albums Category:Heavy metal albums Category:Tool (band) albums",
 "title": "Undertow (Tool album)"
}