{
 "id": "121379",
 "text": "In calculus, a branch of mathematics, the limit of a function is the behavior of a certain function near a selected input value for that function. Limits are one of the main calculus topics, along with derivatives, integration, and differential equations. == Definition of the limit == The definition of the limit is as follows: :If the function f(x) approaches a number L as x approaches a number c, then \\lim_{x \\to c}f(x) = L. The notation for the limit above is read as \"The limit of f(x) as x approaches c is L\", or alternatively, f(x) \\to L as x \\to c (reads \"f(x) tends to L as x tends to c\"). Informally, this means that we can make f(x) as close to L as possible—by making x sufficiently close to c from both sides (without making x equal to c). Imagine we have a function such as f(x)={1 \\over x^2}. When x=0, f(x) is undefined, because f(0)={1 \\over 0 ^ {2}} and division by zero is undefined. On the Cartesian coordinate system, the function f(x) = {1 \\over x ^ 2} would have a vertical asymptote at x=0. In limit notation, this would be written as: :The limit of 1 \\over x^2 as x approaches 0 is \\infty, which is denoted by \\lim_{x \\to 0}{1 \\over x^2} = \\infty. === Right and left limits === Consider the function f(x)={1 \\over x}, we can get as close to 0 in the x-values as we want, so long as we do not make x equal to 0. For instance, we could make x=.00000001 or -.00000001, but never 0. Therefore, we can get f(x) as close as we want to \\infty or \\- \\infty depending on if we approach 0 from the right side or the left side. The left limit is the limit the function tends to if we only approach the target x-value from the left, for instance in the case of f(x)={1 \\over x} when getting close to the 0 x-value from the left side, by using x-values that are smaller than 0, the limit would approach \\- \\infty. In the same way, the right limit is the limit the function tends to if we only approach the target x-value from the right, for instance in the case of f(x)={1 \\over x} when getting close to the 0 x-value from the right side, by using x-values that are larger than 0, the limit would approach \\infty. == Related pages == * Derivative (mathematics), a quantity defined as a limit of slopes * Infinity * Limit of a sequence == References == Category:Calculus Category:Mathematical analysis",
 "title": "Limit of a function"
}