{
 "id": "121442",
 "text": "Ambush marketing is a form of marketing. Many events, especially in sports have sponsors. These sponsors pay money, which makes it possible to hold the event. In return for this, they get publicity and media coverage. Ambush marketing is a name given to marketing campaigns that are also done around the event, but where no money is paid for the event. There are many major events where one company will pay money to become the exclusive sponsor of the event (or in a category of the event). This blocks other brands or companies. These other brands then seek to promote themselves in connection with the same event. They do not pay the sponsorship fee. Even if they wanted to, they could not, because one brand is the exclusive sponsor. Ambush marketing is not illegal, and many people do it. Examples in sport include FIFA World Cup, Olympic Games, and the Super Bowl. Anti-ambush marketing regulations have become controversial for restricting freedom of speech and self-promotion. == Famous \"ambush marketing\" == * 1984 Summer Olympics; Kodak sponsors TV broadcasts of the games as well as the US track team even though Fujifilm is the official sponsor. * 1988 Summer Olympics; Fujifilm sponsors the games, but Kodak is the official sponsor. * 1992 Summer Olympics in Barcelona; Nike sponsors press conferences with the US basketball team despite Reebok being the official sponsor. During ceremonies, the players covered their Reebok logos. * 1994 Winter Olympics; American Express sponsors the games despite Visa being the official sponsor. * 1996 Atlanta Olympics; sprinter Linford Christie wore contact lenses embossed with the Puma AG logo at the press conference preceding the 100 metres final, despite Reebok being the official sponsor. * 1996 Atlanta Olympics; Messages On Hold strategically infiltrates a banner within the camera frame as US runner Jon Drummond prepares for the opening leg of 4x100 relay final. The moment is broadcast live across the world. * 1996 Cricket World Cup; Pepsi ran a series of advertisements titled \"Nothing official about it\" targeting the official sponsor Coca Cola. * 1998 World Cup; Nike sponsored a number of teams competing in the Cup despite Adidas being the official sponsor. * 2000 Sydney Olympics; Qantas Airlines’ slogan \"The Spirit of Australia\" sounds strikingly similar to the games’ slogan \"Share the Spirit.\" despite Ansett Air being the official sponsor. * 2002 Boston Marathon; as Adidas-sponsored runners come off the course Nike are treated to spray-painted messages honoring the day of the race, but not the race itself. * 2003 Cricket World Cup; Indian players threatened to strike over concerns that the anti-ambush marketing rules were too strict. Of particular concern was the length of time before and after the cup that players were not allowed to endorse a rival to one of the official sponsors. Players argued that if they had pre-existing contracts that they would be in breach of them if they were to accept the ICC's rules. * 2006 FIFA World Cup; fans of the Netherlands had to disrobe Bavaria Brewery's leeuwenhosen because Budweiser was the official beer sponsor. == References == Category:Marketing",
 "title": "Ambush marketing"
}