{
 "id": "121512",
 "text": "The Australian Recording Industry Association (ARIA) is a group that represents the music industry in Australia. It is in charge of music licenses and royalties. ARIA has more than 100 members, and is run by a Board of Directors. ARIA holds annual award ceremonies called the \"ARIA Music Awards\" where prizes are given for Australian music. It also runs the \"ARIA\" which are music charts which list the most popular songs and albums in Australia each week. ==2009 ARIA award winners== * Album of the year - Walking on a Dream - by Empire of the Sun * Single of the year - \"Walking on a Dream\" - by Empire of the Sun * Best Group - Empire of the Sun * Best pop release - \"Walking on a Dream\" - by Empire of the Sun * Breakthrough artist album - Ladyhawke - by Ladyhawke * Breakthrough artist single - \"My Delirium\" - by Ladyhawke * Best female artist - Sarah Blasko, for \"As Day Follow Night\" * Best male artist - Daniel Merriweather, for \"Love & War\" * Best rock album - Black Ice by AC/DC * Best urban release - \"State of the Art\" by Hilltop Hoods * Best dance release - \"Talk Like That\" by the Presets * Best blues and roots album - Jungle Blues by C.W. Stoneking * Best country album - I Love This Place by Troy Cassar- Daley * Best independent release - Secrets and Lies by Bertie Blackman * Best adult contemporary album - Chimney's Afire by Josh Pyke * Best DVD - \"TV Is My Parent\" by Sia * Best children's album - Go Bananas! by the Wiggles * Best comedy release - Unessential Listening by Hamish and Andy * Highest selling single - \"Running Back\" by Jessica Mauboy * Highest selling album - Black Ice by AC/DC ==2010 Aria Award winners== *Album of the Year - Down the Way by Angus and Julia Stone *Single of the Year - \"Big Jet Plane\" by Angus and Julia Stone *Best group - The Temper Trap ==References== Category:Organisations based in Australia Category:Music industry organizations Category:Australian music",
 "title": "Australian Recording Industry Association"
}