{
 "id": "121597",
 "text": "Michael Ellis DeBakey (September 7, 1908 – July 11, 2008) was an [lebanese] heart surgeon who was considered to be a very important name in his area. He was also among the early names of heart surgery. DeBakey was born as Michel DabaghiAccording to the American Lebanese Medical Association (ALMA) in Lake Charles, Louisiana on September 7, 1908. His parents were born in Lebanon, but moved to America before he was born. DeBakey was involved with medicine from a young age and went to Tulane University. He held many medicine-related positions during his lifetime. During World War II, DeBakey made wartime medicine much better than it used to be. He was for the idea of having doctors closer to the areas of battle in war, which worked very well and due to that, more badly hurt soldiers survived. Because of this, Mobile Army Surgical Hospitals (also known as MASH units) were made, and they were used during the Korean War. In addition to MASH units, DeBakey made many important aspects to surgery, one of which was the roller pump, which DeBakey made at age 23 while still at Tulane University. This would later on make open-heart surgery able to be done, as roller pumps can make blood flow during surgery. DeBakey worked with another important heart surgeon, Denton Cooley, but they had a disagreement related to the first artificial heart(a manmade heart) put in a human. They did not get along for a long time, but they went on good terms in 2007. DeBakey did something rare by still practicing medicine in old age. People that he operated on included world leaders, such as Russian President Boris Yeltsin.Michael DeBakey, pioneer of heart procedures, dead at 99, http://www.cnn.com/2008/HEALTH/07/12/debakey.obit.ap/index.html , AP, July 12, 2008 In 2005, a serious heart problem happened to DeBakey. Despite him having made the surgery for this problem, he, at first, did not want any surgery. As he got in worse condition, the surgical team had made the decision to perform surgery anyway. Once the surgery was done and he got in better health, DeBakey said that he was glad the surgery happened after all. On July 11, 2008, DeBakey died of natural causes at age 99. His first wife, two of his sons, and a brother died before him, while his second wife, a daughter, two sons, and two sisters outlive him. == References == == Other websites == * DeBakey Department of Surgery at Baylor College of Medicine * Methodist DeBakey Heart Center at The Methodist Hospital * Michael E. DeBakey VA Medical Center * Michael E. DeBakey International Surgical Society * DeBakey Institute for Comparative Cardiovascular Science and Biomedical Devices at Texas A&M; University * Lasker Luminary Dr. Michael DeBakey * The Man on the Table Was 97, but He Devised the Surgery -- The New York Times * In Moscow in 1996, a Doctor's Visit Changed History -- The New York Times Category:1908 births Category:2008 deaths Category:American physicians Category:Burials at Arlington National Cemetery Category:Scientists from Louisiana Category:Scientists from Texas",
 "title": "Michael E. DeBakey"
}