{
 "id": "121613",
 "text": "12 Angry Men is an American drama movie directed by Sidney Lumet and written by Reginald Rose. It is set in New York City and stars Henry Fonda. It was produced in 1957, and is based on a play by the same name also written by Reginald Rose. It's about 12 jurors having to decide whether a defendant is guilty or not, with only one person saying not guilty in the beginning and trying to convince everyone to vote the same. == Plot == The story is about 12 jurors having to vote on whether the defendant being tried for the murder of his father. The crime carries the death penalty, so they are deciding whether he lives or dies. At the beginning, only Juror #8 votes not guilty, and he tries to get everyone else to do the same. After a while, Juror #8 agrees to vote guilty if everyone votes guilty again, but Juror #9 votes not guilty, and they keep talking. Slowly, Juror #8 convinces more and more people to vote not guilty, with a few people fighting him strongly. In the end Juror #3 cracks under the pressure of the other jurors and they all end up voting not guilty. == Cast == Juror # Character 1954 actor 1957 actor 1997 actor 2004-2005 Actor 2006-2007 Actor Order that juror votes 'not guilty' 1 The jury foreman Norman Fell Martin Balsam Courtney B. Vance Mark Blum George Wendt 9 2 Bank clerk John Beal John Fiedler Ossie Davis Kevin Greer Todd Cerveris 5 3 Business man Franchot Tone Lee J. Cobb George C. Scott Philip Bosco (Replaced by Robert Foxworth) Randle Mell 12 4 A stockbroker Walter Abel E. G. Marshall Armin Mueller-Stahl James Rebhorn Jeffrey Hayenga 10 (tie) 5 A man from a violent slum Lee Phillips Jack Klugman Dorian Harewood Michael Mastro Jim Saltouros 3 6 A house painter Bart Burns Ed Binns James Gandolfini Robert Clohessy Charles Borland 6 7 A salesman Paul Hartman Jack Warden Tony Danza John Pankow Mark Morettini 7 8 An architect called Davis Robert Cummings Henry Fonda Jack Lemmon Boyd Gaines Richard Thomas 1 9 An old man called McArdle Joseph Sweeney Joseph Sweeney Hume Cronyn Tom Aldredge Alan Mandell 2 10 A garage owner Edward Arnold Ed Begley Mykelti Williamson Peter Friedman Julian Gamble 10 (tie) 11 An immigrant watchmaker George Voskovec George Voskovec Edward James Olmos Larry Bryggman David Lively 4 12 An advertising executive William West Robert Webber William L. Petersen Adam Trese (Replaced by Byron Jennings) Craig Wroe 8 Category:1957 drama movies Category:1950s American drama movies Category:1950s English-language movies Category:Legal movies Category:Movies set in New York City Category:United States National Film Registry movies Category:Movies directed by Sidney Lumet",
 "title": "12 Angry Men"
}