{
 "id": "12178",
 "text": "Antonio Prohias (January 17, 1921 – February 24, 1998) was a Cuban-born cartoonist. He is best known as the creator of Spy vs. Spy. The running gag is of two incompent spies-one in black clothing-one in white clothing-who consisity try to outdo each other in comic mayhem. Although one comic only identies their countries as Black/White Spy Vs Spy the complete Casebook p.156 another one tells their nationalities are given in an International border cartoon in which the Black Spy from the \"East\" tries to sneak over to the \"West\" [Guarded by the \"White Spy.\"]-although a later cartoon identies their countries as \"Black SpyLand\" (and presumedly \"White Spyland\") Spy vs Spy The Complete Casebook p.113 and p.297-299 Likewise the Spys parents Spy vs Spy comic panel and their Children are cloathed as Black/white Miniature copies of their fathersSpy Vs Spy The Complete Casebook p.127 Even in childhood and old age the two spys began their mayhem against one another-although their feuding goes back to Caveman times and the Roman EmpireSpy Vs Spy Casebook p.205 and p.396 and p.408; p.419;pp.463-464 In the Spy Vs Spy World even innocenet human bystanders Spy Vs Spy The Complete Casebook p.89 toys Spy vs Spy Casebook .p.181 and the Spys animals are cloathed in Black/White Spy vs Spy The Complete Casebook .p.73Spy vs Spy Casebook .p263 & p.265 They even have their own Spy Cemeteries [ID only as Agent Number but no names];Spy vs Spy casebook p.273 and Fan Clubs; their newspapers are called \"Spy News\"Spy Vs Spy Complete Casebook .p 123 The Spys weopons could be anything-from antique BiplanesSpy vs Spy Casebook p.167 to JetsSpy vs Spy casebook.p.179 Each spy would be attached to either their own embassy or their respective Spy HqSpy vs Spy casebook .p.221 and p.296-a running gag is that each spy would try to steal secrets from the enemy spy embassy Spy vs Spy Casebook.p.219 On occasion Prohias would introduce a variation in which one Spy would embaress -but not kill-the enemy spySpy Vs Spy the Complete Casebook p.175 and p.221 Other variations-more than One spy of the same color vs enemy Spy;Spy vs Spy casebook .p.273 and occasionally the introduction of a third Spy..the femme fatalee female \"Grey Spy\" would always trick the two love struck bumblers to their doom.Spy vs Spy The Complete Casebook .p.83 In Honor of St Patricks Day another Spy was introduced the \"Green Spy\".Spy vs Spy vs Spy When \"Mad Magazine\" had its own TV Show they would show 3D Cartoons of Spy Vs Spy shorts. After Prohias demise the Cartoon has been drawn by Kupper Spy vs Case Casebook pp.331-494 ==References== Category:Cartoonists Category:Cuban people Category:1921 births Category:1998 deaths",
 "title": "Antonio Prohias"
}