{
 "id": "121711",
 "text": "The Grammy Award for Best Alternative Music Album is an award given to recording artists for quality albums in the alternative rock genre at the Grammy Awards. The Grammy Awards were established in 1958 and originally called the Gramophone Awards. Honors in several categories are presented at the ceremony each year by the National Academy of Recording Arts and Sciences of the United States to \"honor artistic achievement, technical proficiency and overall excellence in the recording industry, without regard to album sales or chart position\". The definition of \"alternative\" has been debated. The award was first presented in 1991 to recognize non-mainstream rock albums \"heavily played on college radio stations\". According to the academy, the award is presented to \"vocal or instrumental alternative music albums containing at least 51% playing time of newly recorded music\". The academy defines \"alternative\" as a \"non-traditional\" genre that exists \"outside of the mainstream music consciousness\". In 1991, and from 1994 to 1999, the award was known as Best Alternative Music Performance. Beginning in 2001, award recipients included the producers, engineers, and/or mixers associated with the nominated work in addition to the recording artists. Note: User must select the \"Alternative\" category as the genre under the search feature. As of 2011, Radiohead and The White Stripes share the record for the most wins in this category, having won three times each. Radiohead's lead singer, Thom Yorke, was also nominated for the 2007 award for his solo album. Beck and Coldplay have each received the award twice, the latter being the only group to win two years in a row. American artists have been presented with the award more than any other nationality, though it has been presented to musicians or groups from the United Kingdom five times, from Ireland twice, and from France once. Female musicians Tori Amos and Björk hold the record for the most nominations without a win, with five each. == Recipients == Year Performing artist(s) Nationality Work Nominees Ref. 1991 Ireland * Laurie Anderson – Strange Angels * Kate Bush – The Sensual World * The Replacements – All Shook Down * World Party – Goodbye Jumbo 1992 R.E.M. United States * Elvis Costello – Mighty Like a Rose * Jesus Jones – Doubt * Nirvana – Nevermind * Richard Thompson – Rumor and Sigh 1993 United States * The B-52s – Good Stuff * The Cure – Wish * Morrissey – Your Arsenal * XTC – Nonsuch 1994 U2 Ireland * Belly – Star * Nirvana – In Utero * R.E.M. – Automatic for the People * The Smashing Pumpkins – Siamese Dream 1995 Green Day United States * Tori Amos – Under the Pink * Crash Test Dummies – God Shuffled His Feet * Sarah McLachlan – Fumbling Towards Ecstasy * Nine Inch Nails – The Downward Spiral 1996 Nirvana United States * Björk – Post * Foo Fighters – Foo Fighters * PJ Harvey – To Bring You My Love * The Presidents of the United States of America – The Presidents of the United States of America 1997 Beck United States * Tori Amos – Boys for Pele * Tracy Bonham – The Burdens of Being Upright * R.E.M. – New Adventures in Hi-Fi * The Smashing Pumpkins – Mellon Collie and the Infinite Sadness 1998 Radiohead United Kingdom * Björk – Homogenic * David Bowie – Earthling * The Chemical Brothers – Dig Your Own Hole * The Prodigy – The Fat of the Land 1999 Beastie Boys United States * Tori Amos – From the Choirgirl Hotel * PJ Harvey – Is This Desire? * Radiohead – Airbag / How Am I Driving? * The Smashing Pumpkins – Adore 2000 Beck United States * Tori Amos – To Venus and Back * Fatboy Slim – You've Come a Long Way, Baby * Moby – Play * Nine Inch Nails – The Fragile 2001 Radiohead United Kingdom * Fiona Apple – When the Pawn… * Beck – Midnite Vultures * The Cure – Bloodflowers * Paul McCartney – Liverpool Sound Collage 2002 Coldplay United Kingdom * Tori Amos – Strange Little Girls * Björk – Vespertine * Fatboy Slim – Halfway Between the Gutter and the Stars * Radiohead – Amnesiac 2003 Coldplay United Kingdom * Beck – Sea Change * Clinic – Walking with Thee * Elvis Costello and the Imposters – Cruel Smile * The Soundtrack of Our Lives – Behind the Music 2004 The White Stripes United States * The Flaming Lips – Fight Test * Radiohead – Hail to the Thief * Sigur Rós – ( ) * Yeah Yeah Yeahs – Fever to Tell 2005 Wilco United States * Björk – Medúlla * Franz Ferdinand – Franz Ferdinand * PJ Harvey – Uh Huh Her * Modest Mouse – Good News for People Who Love Bad News 2006 The White Stripes United States * Arcade Fire – Funeral * Beck – Guero * Death Cab for Cutie – Plans * Franz Ferdinand – You Could Have It So Much Better 2007 Gnarls Barkley United States * Arctic Monkeys – Whatever People Say I Am, That's What I'm Not * The Flaming Lips – At War with the Mystics * Yeah Yeah Yeahs – Show Your Bones * Thom Yorke – The Eraser 2008 The White Stripes United States * Lily Allen – Alright, Still * Arcade Fire – Neon Bible * Björk – Volta * The Shins – Wincing the Night Away 2009 Radiohead United Kingdom * Beck – Modern Guilt * Death Cab for Cutie – Narrow Stairs * Gnarls Barkley – The Odd Couple * My Morning Jacket – Evil Urges 2010 Phoenix France * David Byrne and Brian Eno – Everything That Happens Will Happen Today * Death Cab for Cutie – The Open Door EP * Depeche Mode – Sounds of the Universe * Yeah Yeah Yeahs – It's Blitz! 2011 The Black Keys United States * Arcade Fire – The Suburbs * Band of Horses – Infinite Arms * Broken Bells – Broken Bells * Vampire Weekend – Contra Each year is linked to the article about the Grammy Awards held that year. ==References== ;General * Note: User must select the \"Alternative\" category as the genre under the search feature. * ;Specific ==Other websites== * Official site of the Grammy Awards Alternative Music Album *",
 "title": "Grammy Award for Best Alternative Music Album"
}