{
 "id": "121833",
 "text": "Treasure Island is a book by Robert Louis Stevenson. It was published in 1883. It is about pirates (finding gold) and a treasure hunt on a tropical isle. Famous characters include Jim Hawkins, Long John Silver, and Ben Gunn. The book has been adapted to movies, comic books, and other media. ==Movies== The story has been made into many movies. The story in the movie is often different to the story in the book. *Treasure Island (1934 movie), 1934 movie starring Jackie Cooper and Wallace Beery *Treasure Island (1950 movie), 1950 Disney movie starring Bobby Driscoll and Robert Newton *Animal Treasure Island (1971 Japanese animated movie) (Dobutsu Takarajima), a collaboration between Hiroshi Ikeda and Hayao Miyazaki at Toei Doga *Treasure Island (1972 movie), 1972 movie starring Orson Welles *Treasure Island (1972 animated movie), a 1972 movie released by Filmation *Return to Treasure Island, 1986 Disney mini- series starring Brian Blessed *Treasure Island (1988 animated movie), 1988 Soviet animated movie released by Kievnauchfilm *Treasure Island (1990 movie), 1990 movie starring Christian Bale and Charlton Heston *Treasure Island (1993 movie) (只要為你活一天), 1993 Taiwanese film *Muppet Treasure Island, 1996 movie rendition of Stevenson's novel starring The Muppets and Tim Curry *Treasure Island (1999 movie), 1999 movie starring Kevin Zeger and Jack Palance ==References== * Cordingly, David (1995). Under the Black Flag: The Romance and Reality of Life Among the Pirates. ISBN 0-679-42560-8 * Letley, Emma, ed. (1998). Treasure Island (Oxford World's Classics). ISBN 0-19-283380-4 * Pietsch, Roland (2010). The Real Jim Hawkins: Ships' Boys in the Georgian Navy. ISBN 978-1-84832-036-9 * Reed, Thomas L. (2006). The Transforming Draught: Jekyll and Hyde, Robert Louis Stevenson, and the Victorian Alcohol Debate. ISBN 0-7864-2648-9 * Watson, Harold (1969). Coasts of Treasure Island;: A study of the backgrounds and sources for Robert Louis Stevenson's romance of the sea. ISBN 0-8111-0282-3 ==Other websites== * Category:1880s books Category:Books by Robert Louis Stevenson Category:British novels",
 "title": "Treasure Island"
}