{
 "id": "121906",
 "text": "Guy Fawkes (13 April 1570 – 31 January 1606), sometimes known as Guido Fawkes, was a member of a Roman Catholic revolutionary group based in England who planned to carry out the Gunpowder Plot. Fawkes and the other plotters planned to kill the king, James I, and replace him with a Catholic monarch. The day 5 November 1605 is remembered each year in the UK during Guy Fawkes Night. People build large bonfires, light fireworks, and burn figures of Fawkes (known as 'the guy'). November 5 was the date when Parliament re-assembled after a long recess. The plot was uncovered quite late, in the night before the day of the 5th. Fawkes was arrested as he sat in a cellar, near the gunpowder, waiting for the right time to set it off. He was tortured to make him reveal the names of the other plotters. Later eight men, including Fawkes, stood trial for high treason. They were found guilty and executed by hanging in Westminster, London, except for Fawkes, who killed himself by jumping from the scaffold before he was to be hanged. Their remains were sent to the corners of the kingdom and displayed, as a warning to others. There were five other conspirators; the main man, Robert Catesby, was killed by the Sheriff of Worcester when he tried to flee. ==Literature== There are many places to find Fawkes in popular literature. Here are some important examples, listed in chronological order. *1842: William Harrison Ainsworth - Guy Fawkes: A Historical Romance, is a historical novel which portrays Fawkes, and Catholic refusal to co-operate in general, favorably and begins to challenge the official version of the plot, one of the first to do so. *1847: Charlotte Brontë - Jane Eyre, Jane is compared to Guy Fawkes, by Abbot, with the line \"a sort of infantine Guy Fawkes\" because she looked like she was constantly inventing wicked plots. Brontë, like Fawkes, was from Yorkshire. *1850: Charles Dickens - David Copperfield, for Peggotty to find money for Saturday's expenses, she \"had to prepare a long and elaborate scheme, a very Gunpowder Plot...\", a direct reference to the Plot of Fawkes. *1886: Herman Melville - Billy Budd, the novella mentions Fawkes in the passage \"The Pharisee is the Guy Fawkes prowling in the hid chambers underlying the Claggarts\". *1925: T. S. Eliot - The Hollow Men, the epigraph of the Nobel Prize winning poem directly refers to Fawkes, \"A penny for the Old Guy\". *1953: Ray Bradbury - Fahrenheit 451, the protagonist of the novel is named Guy Montag, after Guy Fawkes and the Montag Paper Company. In the story, the character plans to start burning firemen's houses in order to challenge the government. *1982: Alan Moore - V for Vendetta, the dystopian graphic novel of a fascist Britain is influenced by the story of Fawkes. The main character, V, wears a Guy Fawkes mask. *1998: J. K. Rowling - Chamber of Secrets, the Harry Potter series school headmaster Dumbledore's phoenix is named Fawkes after Guy Fawkes. *2005: V for Vendetta – film portraying some of the events of the Guy Fawkes Gunpowder Plot and replicating Alan Moore's graphic novel. ==References== == Other websites == * Guy Fawkes * A biography on Guy Fawkes from the Gunpowder Plot Society * Site of the Center for Fawkesian Pursuits * British parliament's Web site to commemorate the 400th anniversary of the plot * Britannia on Fawkes * Site of Guy Fawkes birth place * Guy Fawkes and the Gunpowder Plot Category:English criminals Category:Criminals who committed suicide Category:English Roman Catholics Category:People from York Category:Suicides by jumping in the United Kingdom Category:Terrorists Category:1570 births Category:1606 deaths",
 "title": "Guy Fawkes"
}