{
 "id": "121907",
 "text": "A graphic novel is a type of comic book usually with a long storyline similar to those of novels. The term also encompasses comic short story anthologies, and in some cases bound collections of previously published comic book series (more commonly referred to as trade paperbacks). Graphic novels are often bound in a better format than the comic magazines, using the same materials and methods as printed books, and are generally sold in bookstores and specialty comic book shops rather than at newsstands. Graphic novels are popular around the world. There are many Latino superheroes in American mainstream comics and graphic novels. == Types of graphic novels == There are many kinds of graphic novels. The most popular types are: * Personal Narratives (\"Perzines\") are autobiographical stories about person experiences or opinions. * Non-fiction graphic novels deal with major social issues such as war or immigration. * Manga are Japanese style comics. People read Manga from top to bottom and right to left. This format comes from the traditional Japanese reading pattern. == Famous graphic novels == * Maus: A Survivors Tale, My Father Bleeds History by Art Spiegelman. This graphic novel is about the Holocaust. * Persepolis: The Story of a Childhood by Marjane Satrapi. This is a story about the Islamic revolution of 1979. * Fun Home: A Family Tragicomic by Alison Bechdel. This tells the story of a gay father who commits suicide. This is an example of a personal narrative. * Duck: Two Years in the Oil Sands, by Kate Beaton, published September, 2022 by Drawn & Quarterly * Road to Perdition by Max Allan Collins. This is a crime story that became a movie starring Tom Hanks and Jude Law. == Further reading == * Tychinski, Stan. Brodart.com: \"A Brief History of the Graphic Novel\" (2004) * Couch, Chris. \"The Publication and Formats of Comics, Graphic Novels, and Tankobon\", Image & Narrative #1 (Dec. 2000) * Aldama, Frederick Luis. The Oxford Handbook of Comic Book Studies (Sept. 2020) == References == Category:Fiction genres Category:Comic books",
 "title": "Graphic novel"
}