{
 "id": "122285",
 "text": "This is a chronological list of pay-per-view (PPV) and livestreaming events made by American professional wrestling company WWE (World Wrestling Entertainment). Each month, WWE holds one or two yearly pay-per- view/livestreaming events. Since 2022, WWE calls these kind of events Premium Live Events. One event is usually three hours long and features six to twelve matches. The events are a big part of how the WWE earns money. Starting in 1985, WWE made Premium Live Events that can be watched live on pay-per-view channels. Since February 2014, with the start of the WWE Network, events are also legally streamed live on the internet. ==History== Many people believe wrongly that the first WWE, then known as the World Wrestling Federation (WWF), pay-per-view was November 1985's The Wrestling Classic. This was a tournament held at the Rosemont Horizon near Chicago. The first WrestleMania event, in March of the same year, was on pay-per-view in some areas. The first two WrestleManias earned much money. After WrestleMania III became one of the best events in wrestling history, the WWF then decided to have more pay-per- views. The first Survivor Series event took place on November 29, 1987. It was shown at the same time as NWA's Starrcade which was thought to be the biggest yearly event for NWA. The WWF informed cable companies that if they were showing Starrcade, they would not be allowed to show future WWF events. Most companies showed Survivor Series. Because of this, Starrcade did not make much money that year. This is thought to be the start of many problems for Jim Crockett Promotions. The first Royal Rumble in January 1988 was shown on the USA Network. It had the highest rating in the network's history up until that time. The event became a pay-per-view the next year. The first SummerSlam was held in Madison Square Garden in August 1988. These four events - the Royal Rumble in January, WrestleMania in March or April, SummerSlam in August, and Survivor Series in November - were the only yearly pay-per-view offerings (other than the King of the Ring) from the WWF until 1995. After World Championship Wrestling (WCW) started showing more pay-per-views, the WWF increased the number of pay-per-views it made. At first, the WWF used the name In Your House for its new shows. Beginning in 1996, it began using other names along with the In Your House name (such as Badd Blood and No Way Out of Texas). This was done to avoid confusion. By the end of February of 1999, the In Your House name was no longer used. Both companies increased the number of pay-per-views until they each had one pay-per-view event each month. From the late '90s until 2003, WWE had a once-a-month pay-per-view schedule. The pay- per-view events in the United States can be bought through iN DEMAND, Dish Network or DirecTV. Up until 2003, WWE ran two pay-per-views a year which were only shown in the United Kingdom. After the brand extension started, they stopped doing these two events. Instead of the UK events, they did international tours which were taped for television. In Australia, WWE's pay- per-views were shown on Main Event. In the United Kingdom and Republic of Ireland, some pay-per-views were shown on Sky Sports 1 and others on Sky Box Office. Starting with the 2008 Royal Rumble, all WWE pay-per-views were broadcast in high definition. In February 2014, WWE introduced the WWE Network. a subscription service, where PPV events were streamed live and more WWE content, including every previous PPV event, were available for a lower monthly price. In 2021, events began airing on NBCUniversal's streaming service, Peacock, in the United States, ending the WWE Network there. Over the following years, the service was also ended in other countries when different streaming platforms took over its content: Disney+ Hotstar in Indonesia, Disney+ in the Philippines, Binge in Australia, and Abema in Japan. On 1 January 2025, the WWE Network ended completely in most countries, as WWE content moved to Netflix in the rest of the world. ===Brand extension=== In June 2003, WWE decided to only use people from one brand for many of its pay- per-views. Only the Royal Rumble, WrestleMania, SummerSlam and Survivor Series events used people from different brands. WrestleMania and The Royal Rumble were the only events with wrestlers from different brands competing against each other. This allowed WWE to show more pay-per-view events, such as Cyber Sunday and The Great American Bash. From late 2005, they decided to change this and matches with people from different brands were shown more often. In March 2007, WWE said they would stop only using one brand on each pay-per- view. All of its pay-per-views would have matches from all three brands. When the brand extension was reintroduced in 2016, WWE started making their pay- per-view and livestreaming events single-branded again, except for the \"big four\" events. This stopped again following WrestleMania 34 in 2018. == Current events == === Regular events === Name Month(s) Years Active Brand-exclusive to Note Royal Rumble January/February 1988–present Features the Royal Rumble match NXT Vengeance Day February 2001–2007 2011 2021–present SmackDown! (2003) Raw (2004–2006) NXT (2021–present) Previously known as WWE Vengeance Elimination Chamber February/March 2009–2015 2017–present SmackDown (2017) Raw (2018) Features the Elimination Chamber match Also known as No Escape in Germany NXT Stand & Deliver March/April 2021–present NXT (2022–present) WrestleMania 1985–present WWE's biggest event of the year Backlash May 1999–2009 2016–2018 2020–present Raw (2004–2006) SmackDown (2017–2018) Also known as WrestleMania Backlash NXT Battleground June 2013–2017 2023–present SmackDown (2017) NXT (2023–present) Previously known as WWE Battleground Money in the Bank June/July 2010–present SmackDown (2017) Features the Money in the Bank ladder match NXT Heatwave 2022–present NXT Previously held by ECW The Great American Bash July/August 2004–2009 2020–present SmackDown! (2004-2007) NXT (2020–present) Previously held by NWA/JCP (1985–1988) and by WCW (1989–2000) Also known as The Bash SummerSlam 1988–present NXT No Mercy September 1999–2008 2016–2017 2023–present SmackDown (2002–2006, 2016) Raw (2017) NXT (2023–present) Previously known as WWE No Mercy NXT Halloween Havoc October 2020–present NXT Previously held by WCW Crown Jewel October/November 2018–2019, 2021–present Takes place in Riyadh, Saudi Arabia as part of a deal between WWE and the country's Ministry of Sport Survivor Series November 1988–present Also known as Survivor Series: WarGames NXT Deadline December 2022–present NXT Features the Iron Survivor Challenge === Recurring events === Name Month(s) Years Active Brand-exclusive to Note King and Queen of the Ring April–June 1993–2002 2015 2024–present Previously known as King of the Ring Features the King of the Ring tounament Clash at the Castle September (2022) June (2024) 2022 2024 Bad Blood October (1997, 2024) June (2003–2004) 1997 2003–2004 2024–present Raw (2003–2004) Previously known as Badd Blood: In Your House Bash in Berlin August 2024–present ==Former events== Name Month Years Active Brand-exclusive to Note The Wrestling Classic November 1985 This Tuesday in Texas December 1991 In Your House Various 1995–1999 2020–2022 NXT (2020–2022) Over the Edge May 1998–1999 Also known as Over the Edge: In Your House Fully Loaded July 1998–2000 Also known as Fully Loaded: In Your House Invasion 2001 Rebellion October–December 1999–2002 SmackDown! (2002) All events took place in the United Kingdom Insurrextion May/June 2000–2003 Raw (2002–2003) One Night Stand June 2005–2008 Also known as ECW One Night Stand and One Night Stand: Extreme Rules December To Dismember December 2006 ECW Previously held by ECW Armageddon 1999–2000 2002–2008 Raw (2003) SmackDown! (2004–2006) New Year's Revolution January 2005–2007 Raw No Way Out February June (2012) 1998 2000–2009 2012 SmackDown! (2004–2007) Also known as No Way Out of Texas: In Your House Unforgiven April (1998) September 1998–2008 Raw (2003–2006) Also known as Unforgiven: In Your House Cyber Sunday October/November 2004–2008 Raw (2004–2006) Also known as Taboo Tuesday Judgment Day October (1998) May 1998 2000–2009 SmackDown! (2004–2006) Also known as Judgment Day: In Your House Night of Champions Various 2007–2015 2023 Extreme Rules 2009–2022 Raw (2017) Breaking Point September 2009 Hell in a Cell September/October June (2021–2022) 2009–2022 Raw (2016) SmackDown (2017) Featured the Hell in a Cell match TLC: Tables, Ladders & Chairs December October (2017) 2009–2020 SmackDown (2016) Raw (2017) Bragging Rights October 2009–2010 Fatal 4-Way June 2010 Over The Limit May 2010–2012 Capitol Punishment June 2011 Payback Various 2013–2017 2020 2023 Raw (2017) NXT TakeOver 2014–2021 NXT Fastlane February/March October (2023) 2015–2019 2021 2023 Raw (2017) SmackDown (2018) Roadblock March December 2016 Raw (December 2016) Also known as Roadblock: End of the Line Held as an NXT TV special since 2022 Clash of Champions September December (2017) 2016–2017 2019–2020 Raw (2016) SmackDown (2017) NXT WarGames November/December 2017–2021 NXT Super ShowDown Various 2018–2020 NXT UK TakeOver 2019–2020 NXT UK === International pay-per-view events === Pay-per- view Year(s) Active Note One Night Only 1997 only Mayhem in Manchester 1998 only Capital Carnage 1998 only No Mercy (UK) 1999 only Although this event took place in the UK, another PPV called \"No Mercy\" was held the same year in the US Global Warning 2002 only ==Non-pay-per-view supercards== Supercard Year(s) Active Note Saturday Night's Main Event 1985-1992 2006–2008 2024–present The Main Event 1988-1991 Was a spin-off of Saturday Night's Main Event. ==References== ==Other websites== *WWE.com *WWE Corporate.com * Category:Sports lists",
 "title": "List of WWE pay-per-view events"
}