{
 "id": "122678",
 "text": "The Poor Fellow-Soldiers of Christ and of the Temple of Solomon (Latin: Pauperes commilitones Christi Templique Salomonici), commonly known as the Knights Templar or the Order of the Temple (French: Ordre du Temple or Templiers), were among the most famous military orders of Western Christianity.Malcolm Barber, The New Knighthood: A History of the Order of the Temple. Cambridge University Press, 1994. . The organization lasted for two centuries in the Middle Ages. It was founded after the First Crusade of 1096, with its original purpose to ensure the safety of the many Christians who made the pilgrimage to Jerusalem after it was taken from the Muslims. It was officially endorsed by the Roman Catholic Church around 1129, and became a favored charity by many Christians and grew fast in membership and power. Templar knights wore white mantles quartered by a red cross and were among the most skilled fighting units of the Crusades. Livia Gershon. (2019). 10 Reasons the Knights Templar Were History's Fiercest Fighters. https://www.history.com/news/knights-templar-facts-crusades-wealth. Those members of the Order that did not fight managed a large economic infrastructure throughout Christendom, innovating financial techniques that were an early form of banking,Martin, p. 47.Nicholson, p. 4 and building many fortifications throughout the Mediterranean and the Holy Land. The Templars' success was tied closely to the Crusades; when the Holy Land was lost, support for the Order faded. Rumors about the Templars' secret initiation ceremony created mistrust, and King Philip IV of France, deeply in debt to the Order, began pressuring Pope Clement V to take action against the Order. In 1307, many of the Order's members in France were arrested, tortured into giving false confessions, and then burned at the stake.Malcolm Barber, The Trial of the Templars. Cambridge University Press, 1978. . In 1312, Pope Clement, under continuing pressure from King Philip, disbanded the Order. ==Related pages== * Teutonic Knights ==Notes== ==References== * Barber, Malcolm. The New Knighthood: A History of the Order of the Temple. Cambridge University Press, 1994. . * Barber, Malcolm. The Trial of the Templars, 1st edition, Cambridge University Press, 1978. * Barber, Malcolm. The Trial of the Templars, 2nd edition, Cambridge University Press, 2006. * * Burman, Edward. The Templars: Knights of God. Destiny Books, 1986. . * Martin, Sean, The Knights Templar: The History & Myths of the Legendary Military Order, 2005. . * Nicholson, Helen. The Knights Templar: A New History. Sutton, 2001. * Gershon, Livia. (2019). 10 Reasons the Knights Templar Were History's Fiercest Fighters. https://www.history.com/news/knights-templar-facts-crusades-wealth ==Further reading== * Barber, Malcolm. \"Who Were the Knights Templar?\". Slate Magazine, 20 April 2006. * * Butler, Alan and Stephen Dafoe, The Warriors and the Bankers: A History of the Knights Templar from 1307 to the present, Templar Books, 1998. . * Haag, Michael, The Templars: History and Myth, Profile Books, 2008. . * Partner, Peter. The Knights Templar and their Myth. Destiny Books; Reissue edition (1990). . * Ralls, Karen. The Templars and the Grail, Quest Books, 2003. . * Smart, George. The Knights Templar: Chronology, Authorhouse, 2005. . * Upton-Ward, JM. The Rule of the Templars: The French Text of the Rule of the Order of the Knights Templar. The Boydell Press, 1992. . ==Other websites== * BBC Radio 4 ' On the Trail of The Templars' Program audio, first broadcast 2007-06-18 * The medicine of Knights Templars * The History of the Knights Templar, by Charles Addison, 1842 Category:Christianity of the Middle Ages Category:Knights",
 "title": "Knights Templar"
}