{
 "id": "122740",
 "text": "is a manga work of Hayao Miyazaki's., and then later made into an anime. ==Summary== A young princess makes various questions between right or wrong in the world. ===Setting=== The world of is filled with large, carnivorous insects in the poisonous jungle while it grows slowly. ==Manga== The manga lasted from 1982 and to 1994. ==Anime== The movie premiered in 1984 and follows the same plot as the manga, but it is less developed. It has several famous English actors, including Patrick Stewart, Uma Thurman, Shia LaBeouf and Mark Hamill. It sold more than 1 million tickets when it came out, and it first came out in North America in the 1980s, but was called Warriors of the Wind. It was a cut version of the movie, losing 30 minutes of the movie that the editors called \"slow-moving\", and the voice actors were never told the plot of the movie. The emphasis that the movie had on environmentalism was diluted because of the cuts, and there was next to no character development. Miyazaki dislikes this version of the movie a lot, and made a \"no cuts\" clause to make sure this doesn't happen again. The uncut version of the movie was re- released in 2005 on DVD, and won a set of 3 film awards in 1985. ===Cast=== Character Japanese English 1985 dub English 2005 dub Narrator (none) Hal Smith Tony Jay Nausicaä/Princess Zandra Sumi Shimamoto Susan Davis Alison Lohman Lord Yupa Goro Naya Hal Smith Patrick Stewart Kushana Yoshiko Sakakibara Uma Thurman Kurotowa Iemasa Kayumi Chris Sarandon Mito Ichirō Nagai Edward James Olmos Lastelle Miina Tominaga Emily Bauer Asbel Yōji Matsuda Cam Clarke Shia LaBeouf Mayor of Pejite Makoto Terada Mark Hamill Obaba Hisako Kyōda Tress MacNeille King Jihl Mahito Tsujimura Mark Silverman Muzu James Arnold Taylor Gikuri Jōji Yanami Jeff Bennett Lastelle's Mother Akiko Tsuboi Jodi Benson Gol Kōhei Miyauchi Frank Welker == References == Category:1984 movies Category:Anime Category:1980s fantasy movies Category:Manga Category:Studio Ghibli Category:Japanese movies Category:Movies directed by Hayao Miyazaki",
 "title": "Nausicaä of the Valley of the Wind"
}