{
 "id": "122784",
 "text": "{{Infobox settlement | name = Walloon Brabant | native_name = | native_name_lang = | settlement_type = Province of Belgium | image_flag = Drapeau Province BE Brabant Wallon.svg | flag_size = 120x80px | image_shield = Arms of Walloon Brabant.svg | shield_size = 100x90px | coordinates = | image_map = Province du Brabant wallon in Belgium.svg | subdivision_type = Country | subdivision_name = | subdivision_type1 = Region | subdivision_name1 = | seat_type = Capital | seat = Wavre | leader_title = Governor | leader_name = Gilles Mahieu (PS) | area_total_km2 = 1,097 | area_footnotes = | population_total = 409,782 | population_footnotes = | population_as_of = 1 January 2022 | population_density_km2 = 374 | blank_name_sec2 = HDI (2019) | blank_info_sec2 = 0.948 · 1st |iso_code = BE-WBR | website = }} Walloon Brabant Official name is Province du Brabant wallon (French). (, , , , ) is one of the five provinces of Wallonia in the country of Belgium. ==History== Walloon in Walloon Brabant means that it is in the Wallon part of the former province of Brabant of Belgium. Brabant was an old region, the Duchy of Brabant. The word Brabant appears for the first time in the seventh century when the abbey of Nivelles was founded in the pagus Bracbatensis (pagus is a Latin word meaning a very small town, with only few houses). Walloon Brabant is the youngest and the smallest province of Belgium. The province was created in 1995 when the former province of Brabant was split along the language border in three parts: a Flemish part (Flemish Brabant), a Wallon part (Walloon Brabant) and the Brussels Capital Region, which no longer belongs to any province. ==Geography== The total area of the province is with a population of about 410,000 in 2022. The province is very flat and the highest point is in Genappe, with an altitude of above sea level. Also the geographical centre of Belgium is in the province, in the municipality of Walhain. The province has an elongated shape and measures from east to west about and about from north to south. The capital is Wavre; it is much more centrally located than the old capital, Nivelles. ==Administrative division== The province of Walloon Brabant has only one arrondissement that is divided in 27 municipalities. Arrondissement Nivelles # Beauvechain # Braine-l'Alleud # Braine-le-Château # Chastre # Chaumont-Gistoux # Court-Saint-Étienne # Genappe # Grez-Doiceau # Hélécine # Incourt # Ittre # Jodoigne # La Hulpe # Lasne 15. Mont-Saint-Guibert 16. Nivelles 17. Orp-Jauche 18. Ottignies-Louvain-la-Neuve 19. Perwez 20. Ramillies 21. Rebecq 22. Rixensart 23. Tubize 24. Villers-la-Ville 25. Walhain 26. Waterloo 27. Wavre ==Population by arrondissement== Population x 1,000 (on 1 January since 1980).Institut national de statistique - Direction générale Statistique et information économique Arrondissement 1970 1980 1990 2000 2010 2020 Nivelles 235 286 315 350 380 406 Province of Walloon Brabant (235) (286) (315) 350 380 406 The province of Walloon Brabant did not exist before 1995. ==References== == Other websites == * The province's official site",
 "title": "Walloon Brabant"
}