{
 "id": "122801",
 "text": "The Propædia is the first of three parts of the Encyclopædia Britannica, the other two being the 12-volume Micropædia and the 17-volume Macropædia. The Propædia is supposed to be a book that organizes the things in the Britannica, and a guideline to the index of the other two parts. It was introduced in 1974 with the 15th edition of the encyclopaedia to replace the index, but when many people complained, Britannica put the index back in two books in 1985. The core of the Propædia is its Outline of Knowledge, which is supposed to give people a classification of what we know, but the Propædia also has some parts listing the staff members, advisors and contributors to all three parts of the Britannica. The Propædia can be used by a student who wants to know what there is to know, before even finding out about it. Once the student finds out what he needs to know, he will then find out about the thing itself. The Outline has ten Parts, each with an essay to introduce the part. Below is the table of the ten parts. Table 1: The Ten Parts of the Outline of Knowledge in the Propædia Part Title Major subjects # of Divisions # of Sections Total # Lead author 01Part One Matter and Energy Physics, Chemistry, Astronomy 3 2,8,3 13 Nigel Calder 02Part Two The Earth Geology, Geography, Oceanography 4 4, 3, 2, 3 12 Peter John Wyllie 03Part Three Life on Earth Taxonomy, Molecular and cell biology, Physiology, Neuroscience, Ecology 5 3, 3, 9, 2, 5 22 René Dubos 04Part Four Human Life Human evolution, Medicine, Psychology 3 2, 4, 6 12 Loren Eiseley 05Part Five Human Society Sociology, Economics, Politics, Law, Education 6 4, 4, 6, 4, 3, 2 23 Harold D. Lasswell 06Part Six Art Classification; criticism; various arts 2 3, 9 12 Mark Van Doren 07Part Seven Technology History and elements of technology; various technologies 3 2, 5, 8 15 Lord Peter Ritchie Calder 08Part Eight Religion General observations; various religions 2 2, 9 11 Wilfred Cantwell Smith 09Part Nine The History of mankind History organized by continent and epoch 7 2, 4, 7, 5, 2, 11, 8 39 Jacques Barzun 10Part Ten The Branches of Knowledge Logic, Mathematics, Science, Humanities, Philosophy, Library science 6 2, 3, 7, 2, 3, 1 18 Mortimer J. Adler == Contributors to Propædia == Table 2: Contributors to the Outline of Knowledge in the The dates of death in Table 2 were taken from the 2007 version of the Propædia, except recent (post-1999) deaths which were not noted. Name Date of birth Date of death Part of Outline Description Index Mortimer J. Adler 1902 2001 All Parts Editor 1 Charles Van Doren 1926 All Parts Associate editor; Editorial Vice President of Encyclopædia Britannica Inc. (1973-1982) 2 William J. Gorman 1982 All Parts Associate editor; Senior Fellow of the Institute for Philosophical Research 3 A. G. W. Cameron Matter and Energy Professor of Astronomy, Harvard University 4 Farrington Daniels 1889 1972 Matter and Energy Professor of Chemistry, University of Wisconsin- Madison, Madison 5 Morton Hamermesh Matter and Energy Professor of Physics, University of Minnesota, Minneapolis (1975-1986) 6 Vincent E. Parker Matter and Energy Emeritus Professor of Physics, California State Polytechnic University, Pomona; Dean, School of Science (1967-1977) 7 Richard J. Chorley 1927 2002 The Earth Professor of Geography, University of Cambridge; Fellow of Sidney Sussex College, Cambridge 8 William Stelling von Arx The Earth Senior Scientist, Woods Hole Oceanographic Institution (1968-1978) 9 Peter John Wyllie The Earth Professor of Geology and Chairman, Division of Geological and Planetary Sciences, California Institute of Technology 10 N. J. Berrill Life on Earth Strathcone Professor of Zoology, McGill University (1946-1965) 11 V. G. Dethier 1993 Life on Earth Gilbert L. Woodside Professor of Zoology, University of Massachusetts at Amherst (1975-1993) 12 Louis S. Goodman Life on Earth Distinguished Professor of Pharmacology, University of Utah, Salt Lake City 13 Garrett Hardin 1915 2003 Life on Earth Emeritus Professor of Human Ecology, University of California, Santa Barbara 14 Ernst Walter Mayr 1904 2005 Life on Earth Alexander Agassiz Professor Emeritus of Zoology, Harvard University 15 John Alexander Moore Life on Earth Emeritus Professor of Biology, University of California, Riverside 16 Theodore T. Puck Life on Earth Professor of Biology, Biophysics and Genetics; Distinguished Professor of Medicine, University of Colorado, Health Sciences Center; Director, Eleanor Roosevelt Institute for Cancer Research 17 Birgit Vennesland Life on Earth Head, Vennesland Research Laboratory, Max Planck Society (1970-1981); Director, Max Planck Institute for Cell Physiology, Berlin (1968-1970) 18 Paul B. Weisz Life on Earth Professor of Biology, Brown University 19 Ralph H. Wetmore Life on Earth Emeritus Professor of Botany, Harvard University 20 Emil H. White Life on Earth D. Mead Johnson Professor of Chemistry, Johns Hopkins University 21 Wilfrid Edward Le Gros Clark 1895 1971 Human Life Professor of Anatomy, University of Oxford 22 Russell S. Fisher 1985 Human Life Chief Medical Examiner, State of Maryland; Professor of Forensic Pathology, University of Maryland Medical School, Baltimore 23 F. Clark Howell Human Life Professor of Anthropology, University of California, Berkeley 24 Gregory A. Kimble Human Life Emeritus Professor of Psychology, Duke University 25 Erich Klinghammer Human Life Associate Professor of Psychology, Purdue University 26 Warren Sturgis McCulloch 1899 1969 Human Life Staff member, Research Laboratory of Electronics, MIT (1952-1969) 27 William J. McGuire Human Life Professor of Psychology, Yale University 28 Peter Medawar 1915 1987 Human Life Nobel Prize for Physiology or Medicine, 1960; Jodrell Professor of Zoology and Comparative Anatomy, University College London (1951-1962); Director, National Institute, Mill Hill, London (1962-1971); Scientific staff member, Medical Research Council, England (1971-1984) 29 William J. Baumol 1922 Human Society Professor of Economics, New York University; Emeritus Professor of Economics, Princeton University 30 Daniel Bell 1919 Human Society Henry Ford II Professor Emeritus of Social Science, Harvard University 31 Guiliano H. Bonfante Human Society Former Professor of Linguistics, University of Turin 32 Kenneth E. Boulding 1910 1993 Human Society Distinguished Professor of Economics, University of Colorado, Boulder 33 Lewis A. Coser 1913 2003 Human Society Distinguished Professor Emeritus of Sociology, SUNY, Stony Brook 34 Sigmund Diamond Human Society Giddings Professor Emeritus of Sociology, Columbia University 35 Carl J. Friedrich 1901 1984 Human Society Eaton Professor of the Science of Government, Harvard University (1955-1971) 36 Paul Mundy Human Society Professor of Sociology and Chairman, Department of Criminal Justice, Loyola University Chicago 37 Kenyon E. Poole 1988 Human Society Professor of Economics, Northwestern University 38 C. Herman Pritchett Human Society Emeritus Professor of Political Science, University of California, Santa Barbara and University of Chicago 39 Sol Tax 1907 1995 Human Society Professor of Anthropology, University of Chicago (1948-1976); Director, Center for the Study of Man, Smithsonian Institution 40 Charles Raymond Whittlesey Human Society Emeritus Professor of Finance and Economics, University of Pennsylvania 41 Rudolf Arnheim 1904 Art Emeritus professor of Psychology of Art, Carpenter Center for the Visual Arts, Harvard University 42 Robert Jesse Charleston 1994 Art Keeper, Department of Ceramics, Victoria and Albert Museum (1963-1976) 43 Clifton Fadiman 1904 1999 Art Member, Board of Editors, Encyclopædia Britannica 44 Francis Fergusson 1904 1986 Art Professor of Comparative Literature, Rutgers University (1953-1969); Professor of Comparative Literature, Princeton University (1973-1981) 45 John Gloag 1981 Art Novelist and writer on architecture and industrial design 46 Richard Griffith 1969 Art Curator, Museum of Modern Art Film Library (1951-1965); Lecturer on Motion Pictures, Wesleyan University (1967-1969) 47 Richard Hoggart 1918 Art Professor of English, University of Birmingham (1962-1973); Warden, Goldsmiths' College, University of London (1976-1984) 48 Edward Lockspeiser 1973 Art Officier d'Académie, Paris; Writer and broadcaster on music. 49 Roy McMullen 1984 Art Author, critic, and art historian 50 Leonard B. Meyer 1918 Art Benjamin Franklin Professor of Music and Humanities, University of Pennsylvania 51 Michael Morrow 1994 Art Music editor, Encyclopædia Britannica; Director, Musica Reservata, London 52 Beaumont Newhall 1908 1993 Art Director, Eastman Kodak House (1958-1971); Visiting Professor of Art, University of New Mexico (1971-1984) 53 Herbert Read 1893 1968 Art Watson Gordon Professor of Fine Art, University of Edinburgh (1931-1933); editor, The Burlington Magazine (1933-1939); Charles Eliot Norton professor of Poetry, Harvard University (1953-1954) 54 Richard Roud 1989 Art Program Director, London (1959-1963) and New York (1963-1987) Film Festivals; Movie critic, The Guardian (1963-1969) 55 George Savage 1982 Art Art consultant; author of Porcelain Through the Ages, Pottery Through the Ages, and other works 56 Wolfgang Stechow 1974 Art Professor of Fine Arts, Oberlin College (1940-1963) 57 Joshua C. Taylor 1981 Art William Rainey Harper Professor of Humanities and Professor of Art, University of Chicago (1963-1974); Director, National Collection of Fine Arts, Smithsonian Institution 58 Everard M. Upjohn 1978 Art Professor of Fine Arts, Columbia University (1951-1970) 59 Pierre Verlet Art Chief Curator, Cluny Museum (1945-1965); Chief Curator, National Museum of Sèvres Porcelain (1945-1965); Chief Curator of Art Objects from the Middle Ages to the Modern Period, Louvre Museum (1945-1965) 60 René Wellek 1903 1995 Art Sterling Professor of Comparative Literature, Yale University (1952-1972) 61 Glynne William Gladstone Wickham Art Emeritus Professor of Drama, University of Bristol; Dean, Faculty of Arts (1970-1972) 62 Raymond (Henry) Williams 1988 Art Professor of Drama, University of Cambridge (1974-1983); Fellow of Jesus College, Cambridge (1961-1988) 63 Paul S. Wingert 1974 Art Professor of Art History and Archaeology, Columbia University 64 Bruno Zevi 1918 2000 Art Professor of Architectural History, University of Rome (1963-1979) 65 Konstantinos Apostolos Doxiadis 1975 Technology Chairman, Doxiadis Associates International; Chairman, Board of Directors, Doxiadis Associates, Inc.; Washington D.C. Chairman, Board of Directors, Athens Technological Organization; President, Athens Center of Ekistics 66 Eugene S. Ferguson 1916 2004 Technology Emeritus Professor of History, University of Delaware; Curator of Technology, Hagley Museum, Greenville Delaware 67 Melvin Kranzberg 1917 1995 Technology Callaway Professor of the History of Technology, Georgia Institute of Technology (1972-1988) 68 Harvey G. Mehlhouse Technology Vice President, Western Electric Company, New York City (1965-1969); President (1969-1971); Chairman of the Board (1971-1972) 69 Robert Smith Woodbury 1983 Technology Professor of the History of Technology, MIT 70 Arthur Llewellyn Basham 1914 1986 Religion Professor of Asian Civilizations, Australian National University 71 James T. Burtchaell Religion Professor of Theology, University of Notre Dame; Provost (1970-1977) 72 J. V. Langmead Casserley 1978 Religion Professor of Apologetics, Seabury-Western Theological Seminary 73 Ichiro Hori 1974 Religion Professor of the History of Religions, Seijo University and Kokugakuin University 74 Jaroslav Jan Pelikan Religion Sterling Professor of History, Yale University; President, American Academy of Arts and Sciences 75 Jakob Josef Petuchowski 1991 Religion Sol and Arlene Bronstein Professor of Judeo-Christian Studies, Hebrew Union College, Jewish Institute of Religion, Cincinnati (1981-1991) 76 Jacques Barzun 1907 The History of Mankind University Professor Emeritus, Columbia University; Dean of Faculties and Provost (1958-1967) 77 Otto Allen Bird The Branches of Knowledge Emeritus Professor of Arts and Letters, University of Notre Dame 78 Wing-Tsit Chan 1901 1994 The Branches of Knowledge Professor of Chinese Philosophy and Culture, Dartmouth College (1942-1966); Anna R. D. Gillespie Professor of Philosophy, Chatham College (1966-1982) 79 William H. Dray The Branches of Knowledge Emeritus Professor of Philosophy and of History, University of Ottawa 80 Norwood Hanson 1967 The Branches of Knowledge Professor of Philosophy, Yale University (1963-1967) 81 J. H. Hexter 1910 1996 The Branches of Knowledge Charles L. Stillé Professor of History, Yale University (1967-1978); Distinguished Historian in residence, Washington University (1978-1986) 82 Ernan V. McMullin The Branches of Knowledge Professor of Philosophy, University of Notre Dame 83 Karl Menger 1902 1985 The Branches of Knowledge Professor of Mathematics, Illinois Institute of Technology (1946-1971) 84 Arthur Norman Prior 1969 The Branches of Knowledge Fellow, Balliol College, University of Oxford; Professor of Philosophy, Manchester University (1959-1966) 85 Nicholas Rescher 1928 The Branches of Knowledge University Professor of Philosophy, University of Pittsburgh; editor, American Philosophical Quarterly 86 Seymour Schuster The Branches of Knowledge Professor of Mathematics, Carleton College 87 ==Related pages== * Encyclopædia Britannica * Micropædia, Macropædia == References == Category:Encyclopædia Britannica",
 "title": "Propædia"
}