{
 "id": "122919",
 "text": "The Debian Free Software Guidelines (DFSG) is a set of guidelines (rules) that the Debian Project uses to decide whether a software license is a free software license, which is used to decide whether a piece of software can be included in Debian. The DFSG is part of the Debian Social Contract. ==The guidelines== # Free redistribution. # Inclusion of source code. # Allowing for modifications and derived works. # Integrity of the author's source code # No discrimination against persons or groups. # No discrimination against fields of endeavor, like commercial use. # The license needs to apply to all to whom the program is redistributed. # License must not be specific to Debian. # License must not contaminate other software. # The GPL, BSD, and Artistic licenses are examples of licenses thought of as free. ==History== The DFSG was first published together with the first version of the Debian Social Contract in July 1997. The primary authors were Bruce Perens and several other Debian developers at the time. == Application == === Software === Most discussions about the DFSG happen on the debian-legal mailing list. When a Debian Developer first uploads a package to be included in Debian, the ftpmaster team checks the software licenses and decides whether they follow the DFSG's rules. The team sometimes discusses with the debian-legal list in difficult cases. === Non-software content === The DFSG is focused on software, but in June 2004 the Debian project decided to use the same rules on software documentation, multimedia data and other content. The non-software content of Debian began to follow the DFSG more strictly in Debian 4.0 (released in April 2007) and following releases. === GFDL === Much documentation written by the GNU Project, the Linux Documentation Project and others licensed under the GNU Free Documentation License contain invariant sections, which do not comply with the DFSG. This assertion is the end result of a long discussion and the General Resolution 2006-001 ==Related pages== * The Free Software Definition * History of free software ==References== ==Other websites== * Debian Social Contract and Free Software Guidelines * debian-legal list, with archives from previous discussions * Draft DFSG FAQ(down?) * DFSG FAQ * Section A.1.3 of Why OSS/FS? Look at the Numbers! identifies some of the major issues discussed by debian-legal. * List of software licenses currently found in Debian Free Software Guidelines",
 "title": "Debian Free Software Guidelines"
}