{
 "id": "122998",
 "text": "Liberal arts is a name used in education. It includes humanities, social sciences, natural sciences, and the arts. It has its origins in Ancient Greece. It began with a \"desire for a universal understanding\". It aimed at holistic education. This meant number and language. It began with Pythagoras and his interest in all things mathematical. Pythagoras learnt a lot from the Ancient Egyptians. Four specialisms (Quadrivium) of astronomy, arithmetic, geometry and music developed. Language became more and more important in human affairs. In 4th century Athens it decided how the city state (polis) was governed. Education began to include instruction in how to speak well. This became the three language arts (Trivium) of grammar, dialectic, and rhetoric. Liberal arts became formalised in the middle ages drawing on its origins in Ancient Greek and Roman culture. Perhaps the most famous image of the Liberal Arts is Philosophy and the Liberal Arts from the Garden of Delights (The Hortus deliciarum)., It was created by a group of women in the 12th century. In the image [right] you can see the seven liberal arts arranged around the Queen Philosophy. She sits above Socrates and Plato. \"Their encyclopedia compiled ideas drawn from philosophy, theology, literature, music, arts, and sciences and was intended as a teaching tool for women of the abbey who focused on Liberal Arts Education.\" Liberal arts education aimed at bringing the theoretical and practical together. As Dante put it, so \"that the theoretical intellect by extension becomes practical, its goal then being doing and making\". It was intended to be a mental and practical education. The Renaissance valued a many sided individual. It was an education reserved only for the elite. Students were mostly young gentlemen from wealthy families. Today, in the USA liberal arts education is still restricted to \"elites\" who can pay significant fees to attend exclusive liberal arts colleges. Across Europe liberal arts education is now far more affordable. Some universities say it can now \"be enjoyed by everyone.\" == The four liberal arts == The four liberal arts were taught in two groups: the trivium and the quadrivium . During the Middle Ages, the liberal arts were central to university education. The quadrivium followed the preparatory work of the trivium. The area and range of the liberal arts evolved in time. Most of the teaching, and all of the text-books, were in Latin. Students learnt Latin at school before they came to college. In the beginning the courses were aimed at educating the elite in the classical works. Eventually, the meaning of \"liberal arts\" got extended to include both humanities and science. But even today, practical activities as agriculture, business, engineering, pedagogy or pharmacy are excluded from the liberal arts. The liberal professions include only professions which require education at university, mainly law and medicine. ==The trivium== The trivium (Latin for three ways), included the literary disciplines: * Grammar, the science of the correct usage of language. It helps a person to speak and write correctly; * Dialectic (or logic), the science of correct thinking. It helps you to arrive at the truth; * Rhetoric, the science of expression, especially persuasion. Ways of organizing a speech or document. Adapting it so that people understand it, and believe it. ==The quadrivium== The quadrivium (Latin for four ways), included the disciplines connected with mathematics. They were: * arithmetic teaches about numbers; * geometry teaches about calculating spaces; * astronomy teaches about the stars; * music teaches ratio and proportion and is related to melody and song as it was in the Middle Ages. == Liberal arts colleges, USA == Liberal arts colleges are a modern re- interpretation of the old idea. Mostly in the United States, these colleges concentrate on good teaching. They are closer to the Oxford & Cambridge type of tuition than most universities. They are mostly or entirely fee-paying institutions. They offer an elite education to students from prosperous families or gifted students through significant financial aid. The courses are mostly or entirely undergraduate courses. ==Publications on the subject== *Charles Blaich, Anne Bost, Ed Chan, and Richard Lynch 2004. Defining liberal arts education. Center of Inquiry in the Liberal Arts. * Sister Miriam Joseph (2002) The Trivium: the liberal arts of logic, grammar, and rhetoric. Paul Dry Books. * Brand Blanshard 1973. The uses of a liberal education: and other talks to students. Open Court. * Winterer, Caroline 2002. The culture of classicism: Ancient Greece and Rome in American intellectual life, 1780-1910. Baltimore: Johns Hopkins University Press. == References == Category:Cultural history",
 "title": "Liberal arts"
}