{
 "id": "123065",
 "text": "Metropolitan Statistical Areas (MSA) are large metropolitan areas of the United States as defined by the Office of Management and Budget. These areas are urban areas with a lot of people. An earlier version of the MSA was the \"Standard Metropolitan Statistical Area\" (SMSA). MSAs are used for official purposes. They are made up of counties and for some, county equivalents. MSAs are created around a central urban area —an area with high population density. The counties within the urbanized area are known as the central counties of the MSA. Other nearby counties (known as outlying counties) can be a part of the MSA if these counties have strong social and economic connections to the central counties. Some areas within these outlying counties may actually be rural areas. The population estimates for some metro areas are not always agreed upon. In some cases, different sources give numbers of people which differ by millions. The definitions used for the last U.S. Census differed from those for previous censuses. This makes it hard to compare official information from different dates. MSA boundaries do not stretch into Canada or Mexico. This can affect the number of people in several cities. For example, Detroit, Buffalo, El Paso and San Diego are often much larger than their MSA figures. Since June 2003, there is now an additional classification, “Metropolitan Division.” The term metropolitan division is used for a county or group of counties that are a distinct employment area within a metropolitan statistical area that has at least 2.5 million people. A metropolitan division is a part of a larger metropolitan statistical area but it is often a distinct social, economic, and cultural area within the larger region. == List of metropolitan statistical areas == The 387 MSAs in the United States, including those in all 50 states and the national capital of Washington, D.C. are ranked, including: #The MSA rank by population as of July 1, 2024, as estimated by the United States Census Bureau #The MSA name, given by the United States Office of Management and Budget #The MSA population as of July 1, 2024, as estimated by the United States Census Bureau #The MSA population as of April 1, 2020, as counted by the 2020 United States census #The percent MSA population change from April 1, 2020, to July 1, 2024 #The combined statistical area (CSA) that includes this metropolitan area, if any The 387 metropolitan statistical areas of the United States Metropolitan statistical area 2024estimate 2020census %change Combined statistical area New York–Newark–Jersey City, NY-NJ MSA New York–Newark, NY-NJ-CT-PA CSA Los Angeles–Long Beach–Anaheim, CA MSA Los Angeles–Long Beach, CA CSA Chicago–Naperville–Elgin, IL-IN MSA Chicago–Naperville, IL-IN-WI CSA Dallas–Fort Worth–Arlington, TX MSA Dallas–Fort Worth, TX-OK CSA Houston–Pasadena–The Woodlands, TX MSA Houston–Pasadena, TX CSA Miami–Fort Lauderdale–West Palm Beach, FL MSA Miami–Port St. Lucie–Fort Lauderdale, FL CSA Washington–Arlington–Alexandria, DC-VA-MD-WV MSA Washington–Baltimore–Arlington, DC-MD-VA-WV-PA CSA Atlanta–Sandy Springs–Roswell, GA MSA Atlanta–Athens-Clarke County–Sandy Springs, GA-AL CSA Philadelphia–Camden–Wilmington, PA-NJ-DE-MD MSA Philadelphia–Reading–Camden, PA-NJ-DE-MD CSA Phoenix–Mesa–Chandler, AZ MSA Phoenix–Mesa, AZ CSA Boston–Cambridge–Newton, MA-NH MSA Boston–Worcester–Providence, MA-RI-NH CSA Riverside–San Bernardino–Ontario, CA MSA Los Angeles–Long Beach, CA CSA San Francisco–Oakland–Fremont, CA MSA San Jose–San Francisco–Oakland, CA CSA Detroit–Warren–Dearborn, MI MSA Detroit–Warren–Ann Arbor, MI CSA Seattle–Tacoma–Bellevue, WA MSA Seattle–Tacoma, WA CSA Minneapolis–St. Paul–Bloomington, MN-WI MSA Minneapolis–St. Paul, MN-WI CSA Tampa–St. Petersburg–Clearwater, FL MSA San Diego–Chula Vista–Carlsbad, CA MSA Denver–Aurora–Centennial, CO MSA Denver–Aurora–Greeley, CO CSA Orlando–Kissimmee–Sanford, FL MSA Orlando–Lakeland–Deltona, FL CSA Charlotte–Concord–Gastonia, NC-SC MSA Charlotte–Concord, NC-SC CSA Baltimore–Columbia–Towson, MD MSA Washington–Baltimore–Arlington, DC-MD-VA-WV- PA CSA St. Louis, MO-IL MSA St. Louis–St. Charles–Farmington, MO-IL CSA San Antonio–New Braunfels, TX MSA San Antonio–New Braunfels–Kerrville, TX CSA Austin–Round Rock–San Marcos, TX MSA Portland–Vancouver–Hillsboro, OR-WA MSA Portland–Vancouver–Salem, OR-WA CSA Sacramento–Roseville–Folsom, CA MSA Sacramento–Roseville, CA CSA Pittsburgh, PA MSA Pittsburgh–Weirton–Steubenville, PA-OH-WV CSA Las Vegas–Henderson–North Las Vegas, NV MSA Las Vegas–Henderson, NV CSA Cincinnati, OH-KY-IN MSA Cincinnati–Wilmington, OH-KY-IN CSA Kansas City, MO-KS MSA Kansas City–Overland Park–Kansas City, MO-KS CSA Columbus, OH MSA Columbus–Marion–Zanesville, OH CSA Indianapolis–Carmel–Greenwood, IN MSA Indianapolis–Carmel–Muncie, IN CSA Cleveland, OH MSA Cleveland–Akron–Canton, OH CSA Nashville-Davidson–Murfreesboro–Franklin, TN MSA Nashville- Davidson–Murfreesboro, TN CSA San Jose–Sunnyvale–Santa Clara, CA MSA San Jose–San Francisco–Oakland, CA CSA Virginia Beach–Chesapeake–Norfolk, VA-NC MSA Virginia Beach–Chesapeake, VA-NC CSA Jacksonville, FL MSA Jacksonville–Kingsland–Palatka, FL-GA CSA Providence–Warwick, RI-MA MSA Boston–Worcester–Providence, MA-RI-NH CSA Milwaukee–Waukesha, WI MSA Milwaukee–Racine–Waukesha, WI CSA Raleigh–Cary, NC MSA Raleigh–Durham–Cary, NC CSA Oklahoma City, OK MSA Oklahoma City–Shawnee, OK CSA Louisville/Jefferson County, KY-IN MSA Louisville/Jefferson County–Elizabethtown, KY-IN CSA Richmond, VA MSA Memphis, TN-MS-AR MSA Memphis–Clarksdale–Forrest City, TN-MS- AR CSA Salt Lake City–Murray, UT MSA Salt Lake City–Provo–Orem, UT CSA Birmingham, AL MSA Birmingham–Cullman–Talladega, AL CSA Fresno, CA MSA Fresno–Hanford–Corcoran, CA CSA Grand Rapids–Wyoming–Kentwood, MI MSA Grand Rapids–Wyoming, MI CSA Hartford–West Hartford–East Hartford, CT MSA New Haven–Hartford–Waterbury, CT CSA Buffalo–Cheektowaga, NY MSA Buffalo–Cheektowaga–Olean, NY CSA Tucson, AZ MSA Tucson–Nogales, AZ CSA Tulsa, OK MSA Tulsa–Bartlesville–Muskogee, OK CSA Rochester, NY MSA Rochester–Batavia–Seneca Falls, NY CSA Omaha, NE-IA MSA Omaha–Fremont, NE-IA CSA Urban Honolulu, HI MSA Greenville–Anderson–Greer, SC MSA Greenville–Spartanburg–Anderson, SC CSA Bridgeport–Stamford–Danbury, CT MSA New York–Newark, NY-NJ-CT-PA CSA New Orleans–Metairie, LA MSA New Orleans–Metairie–Slidell, LA-MS CSA Knoxville, TN MSA Knoxville–Morristown–Sevierville, TN CSA North Port–Bradenton–Sarasota, FL MSA North Port–Bradenton, FL CSA Albuquerque, NM MSA Albuquerque–Santa Fe–Los Alamos, NM CSA Bakersfield–Delano, CA MSA McAllen–Edinburg–Mission, TX MSA McAllen–Edinburg, TX CSA Albany–Schenectady–Troy, NY MSA Albany–Schenectady, NY CSA Allentown–Bethlehem–Easton, PA-NJ MSA Allentown–Bethlehem–East Stroudsburg, PA-NJ CSA Baton Rouge, LA MSA Baton Rouge–Hammond, LA CSA Worcester, MA MSA Boston–Worcester–Providence, MA-RI-NH CSA El Paso, TX MSA El Paso–Las Cruces, TX-NM CSA Columbia, SC MSA Columbia–Sumter–Orangeburg, SC CSA Charleston–North Charleston, SC MSA Cape Coral–Fort Myers, FL MSA Cape Coral–Fort Myers–Naples, FL CSA Lakeland–Winter Haven, FL MSA Orlando–Lakeland–Deltona, FL CSA Boise City, ID MSA Boise City–Mountain Home–Ontario, ID-OR CSA Oxnard–Thousand Oaks–Ventura, CA MSA Los Angeles–Long Beach, CA CSA Dayton–Kettering–Beavercreek, OH MSA Dayton–Springfield–Kettering, OH CSA Stockton–Lodi, CA MSA San Jose–San Francisco–Oakland, CA CSA Greensboro–High Point, NC MSA Greensboro–Winston- Salem–High Point, NC CSA Colorado Springs, CO MSA Little Rock–North Little Rock–Conway, AR MSA Little Rock–North Little Rock, AR CSA Provo–Orem–Lehi, UT MSA Salt Lake City–Provo–Orem, UT CSA Des Moines–West Des Moines, IA MSA Des Moines–West Des Moines–Ames, IA CSA Deltona–Daytona Beach–Ormond Beach, FL MSA Orlando–Lakeland–Deltona, FL CSA Kiryas Joel–Poughkeepsie–Newburgh, NY MSA New York–Newark, NY-NJ-CT-PA CSA Madison, WI MSA Madison–Janesville–Beloit, WI CSA Winston-Salem, NC MSA Greensboro–Winston-Salem–High Point, NC CSA Akron, OH MSA Cleveland–Akron–Canton, OH CSA Ogden, UT MSA Salt Lake City–Provo–Orem, UT CSA Wichita, KS MSA Wichita–Arkansas City–Winfield, KS CSA Palm Bay–Melbourne–Titusville, FL MSA Syracuse, NY MSA Syracuse–Auburn, NY CSA Augusta-Richmond County, GA-SC MSA Durham–Chapel Hill, NC MSA Raleigh–Durham–Cary, NC CSA Harrisburg–Carlisle, PA MSA Harrisburg–York–Lebanon, PA CSA Jackson, MS MSA Jackson–Vicksburg–Brookhaven, MS CSA Fayetteville–Springdale–Rogers, AR MSA Spokane–Spokane Valley, WA MSA Spokane–Spokane Valley–Coeur d'Alene, WA-ID CSA Toledo, OH MSA Chattanooga, TN-GA MSA Chattanooga–Cleveland–Dalton, TN-GA-AL CSA New Haven, CT MSA New Haven–Hartford–Waterbury, CT CSA Reno, NV MSA Reno–Carson City–Gardnerville Ranchos, NV-CA CSA Scranton–Wilkes-Barre, PA MSA Portland–South Portland, ME MSA Portland–Lewiston–South Portland, ME CSA Lancaster, PA MSA Modesto, CA MSA San Jose–San Francisco–Oakland, CA CSA Port St. Lucie, FL MSA Miami–Port St. Lucie–Fort Lauderdale, FL CSA Huntsville, AL MSA Huntsville–Decatur–Albertville, AL-TN CSA Pensacola–Ferry Pass–Brent, FL MSA Lexington-Fayette, KY MSA Lexington-Fayette–Richmond–Frankfort, KY CSA Killeen–Temple, TX MSA Springfield, MO MSA Santa Rosa–Petaluma, CA MSA Visalia, CA MSA Wilmington, NC MSA Lansing–East Lansing, MI MSA Lansing–East Lansing–Owosso, MI CSA York–Hanover, PA MSA Harrisburg–York–Lebanon, PA CSA Springfield, MA MSA Springfield–Amherst Town–Northampton, MA CSA Fort Wayne, IN MSA Fort Wayne–Huntington–Auburn, IN CSA Waterbury–Shelton, CT MSA New Haven–Hartford–Waterbury, CT CSA Vallejo, CA MSA San Jose–San Francisco–Oakland, CA CSA Corpus Christi, TX MSA Corpus Christi–Kingsville–Alice, TX CSA Santa Maria–Santa Barbara, CA MSA Salem, OR MSA Portland–Vancouver–Salem, OR-WA CSA Reading, PA MSA Philadelphia–Reading–Camden, PA-NJ-DE-MD CSA Salinas, CA MSA Brownsville–Harlingen, TX MSA Brownsville–Harlingen–Raymondville, TX CSA Savannah, GA MSA Savannah–Hinesville–Statesboro, GA CSA Manchester–Nashua, NH MSA Boston–Worcester–Providence, MA-RI-NH CSA Ocala, FL MSA Gulfport–Biloxi, MS MSA Youngstown–Warren, OH MSA Youngstown–Warren–Salem, OH CSA Asheville, NC MSA Asheville–Waynesville–Brevard, NC CSA Lafayette, LA MSA Lafayette–New Iberia–Opelousas, LA CSA Naples–Marco Island, FL MSA Cape Coral–Fort Myers–Naples, FL CSA Myrtle Beach–Conway–North Myrtle Beach, SC MSA Myrtle Beach–Conway, SC CSA Mobile, AL MSA Mobile–Daphne–Fairhope, AL CSA Anchorage, AK MSA Flint, MI MSA Detroit–Warren–Ann Arbor, MI CSA Canton–Massillon, OH MSA Cleveland–Akron–Canton, OH CSA Beaumont–Port Arthur, TX MSA Tallahassee, FL MSA Tallahassee–Bainbridge, FL-GA CSA Spartanburg, SC MSA Greenville–Spartanburg–Anderson, SC CSA Fayetteville, NC MSA Fayetteville–Lumberton–Pinehurst, NC CSA Trenton–Princeton, NJ MSA New York–Newark, NY-NJ-CT-PA CSA Montgomery, AL MSA Montgomery–Selma, AL CSA Shreveport–Bossier City, LA MSA Shreveport–Bossier City–Minden, LA CSA Eugene–Springfield, OR MSA Davenport–Moline–Rock Island, IA-IL MSA Davenport–Moline, IA-IL CSA Fort Collins–Loveland, CO MSA Ann Arbor, MI MSA Detroit–Warren–Ann Arbor, MI CSA Hickory–Lenoir–Morganton, NC MSA Charlotte–Concord, NC-SC CSA Atlantic City–Hammonton, NJ MSA Philadelphia–Reading–Camden, PA-NJ-DE-MD CSA Greeley, CO MSA Denver–Aurora–Greeley, CO CSA Lubbock, TX MSA Lubbock–Plainview, TX CSA Huntington–Ashland, WV-KY-OH MSA Charleston–Huntington–Ashland, WV-OH-KY CSA Peoria, IL MSA Peoria–Canton, IL CSA Gainesville, FL MSA Gainesville–Lake City, FL CSA Lincoln, NE MSA Lincoln–Beatrice, NE CSA Clarksville, TN-KY MSA Rockford, IL MSA Rockford–Freeport–Rochelle, IL CSA Green Bay, WI MSA Green Bay–Shawano, WI CSA Boulder, CO MSA Denver–Aurora–Greeley, CO CSA South Bend–Mishawaka, IN-MI MSA South Bend–Elkhart–Mishawaka, IN-MI CSA Columbus, GA-AL MSA Columbus–Auburn–Opelika, GA-AL CSA Kennewick–Richland, WA MSA Kennewick–Richland–Walla Walla, WA CSA Roanoke, VA MSA Kingsport–Bristol, TN- VA MSA Johnson City–Kingsport–Bristol, TN-VA CSA Hagerstown–Martinsburg, MD-WV MSA Washington–Baltimore–Arlington, DC-MD-VA-WV-PA CSA Crestview–Fort Walton Beach–Destin, FL MSA Sioux Falls, SD-MN MSA Waco, TX MSA Olympia–Lacey–Tumwater, WA MSA Seattle–Tacoma, WA CSA Merced, CA MSA San Jose–San Francisco–Oakland, CA CSA Longview, TX MSA Utica–Rome, NY MSA College Station–Bryan, TX MSA Norwich–New London–Willimantic, CT MSA New Haven–Hartford–Waterbury, CT CSA Tuscaloosa, AL MSA San Luis Obispo–Paso Robles, CA MSA Duluth, MN-WI MSA Duluth–Grand Rapids, MN-WI CSA Bremerton–Silverdale–Port Orchard, WA MSA Seattle–Tacoma, WA CSA Cedar Rapids, IA MSA Cedar Rapids–Iowa City, IA CSA Slidell–Mandeville–Covington, LA MSA New Orleans–Metairie–Slidell, LA-MS CSA Amarillo, TX MSA Amarillo–Borger, TX CSA Laredo, TX MSA Evansville, IN MSA Evansville–Henderson, IN-KY CSA Fargo, ND-MN MSA Fargo–Wahpeton, ND-MN CSA Erie, PA MSA Erie–Meadville, PA CSA Lynchburg, VA MSA Kalamazoo–Portage, MI MSA Kalamazoo–Battle Creek–Portage, MI CSA Bend, OR MSA Santa Cruz–Watsonville, CA MSA San Jose–San Francisco–Oakland, CA CSA Daphne–Fairhope–Foley, AL MSA Mobile–Daphne–Fairhope, AL CSA Yakima, WA MSA Prescott Valley–Prescott, AZ MSA Tyler, TX MSA Tyler–Jacksonville, TX CSA Appleton, WI MSA Appleton–Oshkosh–Neenah, WI CSA Binghamton, NY MSA Lake Charles, LA MSA Lake Charles–DeRidder, LA CSA Champaign–Urbana, IL MSA Champaign–Urbana–Danville, IL CSA Macon-Bibb County, GA MSA Macon-Bibb County–Warner Robins, GA CSA Hilton Head Island–Bluffton–Port Royal, SC MSA Bellingham, WA MSA Fort Smith, AR-OK MSA Topeka, KS MSA Barnstable Town, MA MSA Boston–Worcester–Providence, MA-RI-NH CSA Rochester, MN MSA Rochester–Austin–Winona, MN CSA Lafayette–West Lafayette, IN MSA Lafayette–West Lafayette–Frankfort, IN CSA Burlington–South Burlington, VT MSA Burlington–South Burlington–Barre, VT CSA Las Cruces, NM MSA El Paso–Las Cruces, TX-NM CSA Charlottesville, VA MSA Lake Havasu City–Kingman, AZ MSA Panama City–Panama City Beach, FL MSA Athens-Clarke County, GA MSA Atlanta–Athens-Clarke County–Sandy Springs, GA-AL CSA Monroe, LA MSA Monroe–Ruston, LA CSA Gainesville, GA MSA Atlanta–Athens-Clarke County–Sandy Springs, GA-AL CSA Medford, OR MSA Medford–Grants Pass, OR CSA Yuma, AZ MSA Columbia, MO MSA Columbia–Jefferson City–Moberly, MO CSA Johnson City, TN MSA Johnson City–Kingsport–Bristol, TN-VA CSA Jacksonville, NC MSA Punta Gorda, FL MSA North Port–Bradenton, FL CSA Lexington Park, MD MSA Washington–Baltimore–Arlington, DC-MD-VA-WV-PA CSA Chico, CA MSA St. George, UT MSA Elkhart–Goshen, IN MSA South Bend–Elkhart–Mishawaka, IN-MI CSA Joplin, MO-KS MSA Joplin–Miami, MO-OK-KS CSA Springfield, IL MSA Springfield–Jacksonville–Lincoln, IL CSA Auburn–Opelika, AL MSA Columbus–Auburn–Opelika, GA-AL CSA St. Cloud, MN MSA Minneapolis–St. Paul, MN- WI CSA Warner Robins, GA MSA Macon-Bibb County–Warner Robins, GA CSA Charleston, WV MSA Charleston–Huntington–Ashland, WV-OH-KY CSA Florence, SC MSA Houma–Bayou Cane–Thibodaux, LA MSA Racine–Mount Pleasant, WI MSA Milwaukee–Racine–Waukesha, WI CSA Bowling Green, KY MSA Bowling Green–Glasgow–Franklin, KY CSA Dover, DE MSA Philadelphia–Reading–Camden, PA- NJ-DE-MD CSA Billings, MT MSA Midland, TX MSA Midland–Odessa–Andrews, TX CSA Coeur d'Alene, ID MSA Spokane–Spokane Valley–Coeur d'Alene, WA-ID CSA Saginaw, MI MSA Saginaw–Midland–Bay City, MI CSA Yuba City, CA MSA Sacramento–Roseville, CA CSA Abilene, TX MSA Abilene–Sweetwater, TX CSA Jackson, TN MSA Burlington, NC MSA Greensboro–Winston-Salem–High Point, NC CSA Kingston, NY MSA New York–Newark, NY-NJ-CT-PA CSA Iowa City, IA MSA Cedar Rapids–Iowa City, IA CSA Blacksburg–Christiansburg–Radford, VA MSA El Centro, CA MSA Redding, CA MSA Redding–Red Bluff, CA CSA Greenville, NC MSA Greenville–Washington, NC CSA Muskegon–Norton Shores, MI MSA Grand Rapids–Wyoming, MI CSA Eau Claire, WI MSA Eau Claire–Menomonie, WI CSA Oshkosh–Neenah, WI MSA Appleton–Oshkosh–Neenah, WI CSA Sebastian–Vero Beach–West Vero Corridor, FL MSA Miami–Port St. Lucie–Fort Lauderdale, FL CSA Bloomington, IL MSA Bloomington–Pontiac, IL CSA Idaho Falls, ID MSA Idaho Falls–Rexburg–Blackfoot, ID CSA La Crosse–Onalaska, WI-MN MSA La Crosse–Onalaska–Sparta, WI-MN CSA Homosassa Springs, FL MSA Waterloo–Cedar Falls, IA MSA Odessa, TX MSA Midland–Odessa–Andrews, TX CSA Pueblo, CO MSA Pueblo–Cañon City, CO CSA Terre Haute, IN MSA Kenosha, WI MSA Chicago–Naperville, IL-IN-WI CSA Janesville–Beloit, WI MSA Madison–Janesville–Beloit, WI CSA Amherst Town–Northampton, MA MSA Springfield–Amherst Town–Northampton, MA CSA Kahului–Wailuku, HI MSA Bloomington, IN MSA Bloomington–Bedford, IN CSA Grand Junction, CO MSA Logan, UT-ID MSA Jackson, MI MSA State College, PA MSA State College–DuBois, PA CSA Decatur, AL MSA Huntsville–Decatur–Albertville, AL-TN CSA Chambersburg, PA MSA Washington–Baltimore–Arlington, DC-MD-VA-WV-PA CSA Santa Fe, NM MSA Albuquerque–Santa Fe–Los Alamos, NM CSA Bangor, ME MSA Traverse City, MI MSA Hattiesburg, MS MSA Hattiesburg–Laurel, MS CSA Florence–Muscle Shoals, AL MSA Florence–Muscle Shoals–Russellville, AL CSA Rapid City, SD MSA Rapid City–Spearfish, SD CSA Monroe, MI MSA Detroit–Warren–Ann Arbor, MI CSA Vineland, NJ MSA Philadelphia–Reading–Camden, PA-NJ-DE-MD CSA Hanford–Corcoran, CA MSA Fresno–Hanford–Corcoran, CA CSA Dothan, AL MSA Dothan–Enterprise–Ozark, AL CSA Wildwood–The Villages, FL MSA Orlando–Lakeland–Deltona, FL CSA Niles, MI MSA South Bend–Elkhart–Mishawaka, IN-MI CSA Valdosta, GA MSA Jefferson City, MO MSA Columbia–Jefferson City–Moberly, MO CSA Sherman–Denison, TX MSA Dallas–Fort Worth, TX-OK CSA Wichita Falls, TX MSA Winchester, VA-WV MSA Washington–Baltimore–Arlington, DC-MD-VA-WV-PA CSA Alexandria, LA MSA Rocky Mount, NC MSA Rocky Mount–Wilson–Roanoke Rapids, NC CSA Dalton, GA MSA Chattanooga–Cleveland–Dalton, TN-GA-AL CSA Sioux City, IA-NE-SD MSA Sioux City–Le Mars, IA-NE-SD CSA Texarkana, TX-AR MSA Albany, GA MSA Lebanon, PA MSA Harrisburg–York–Lebanon, PA CSA Flagstaff, AZ MSA Morgantown, WV MSA Hammond, LA MSA Baton Rouge–Hammond, LA CSA Bismarck, ND MSA Wausau, WI MSA Wausau–Stevens Point–Wisconsin Rapids, WI CSA Harrisonburg, VA MSA Harrisonburg–Staunton–Stuarts Draft, VA CSA Jonesboro, AR MSA Jonesboro–Paragould, AR CSA Wheeling, WV-OH MSA Springfield, OH MSA Dayton–Springfield–Kettering, OH CSA Manhattan, KS MSA Battle Creek, MI MSA Kalamazoo–Battle Creek–Portage, MI CSA Mount Vernon–Anacortes, WA MSA Seattle–Tacoma, WA CSA Napa, CA MSA San Jose–San Francisco–Oakland, CA CSA Albany, OR MSA Portland–Vancouver–Salem, OR-WA CSA Cleveland, TN MSA Chattanooga–Cleveland–Dalton, TN-GA-AL CSA Salisbury, MD MSA Salisbury–Ocean Pines, MD CSA Johnstown, PA MSA Johnstown–Somerset, PA CSA Ames, IA MSA Des Moines–West Des Moines–Ames, IA CSA Pittsfield, MA MSA Staunton–Stuarts Draft, VA MSA Harrisonburg–Staunton–Stuarts Draft, VA CSA Elizabethtown, KY MSA Louisville/Jefferson County–Elizabethtown, KY-IN CSA Missoula, MT MSA Wenatchee–East Wenatchee, WA MSA Bozeman, MT MSA Morristown, TN MSA Knoxville–Morristown–Sevierville, TN CSA Lawton, OK MSA Lawton–Duncan, OK CSA Sierra Vista–Douglas, AZ MSA Glens Falls, NY MSA Albany–Schenectady, NY CSA Mansfield, OH MSA Mansfield–Ashland–Bucyrus, OH CSA Twin Falls, ID MSA Lawrence, KS MSA Kansas City–Overland Park–Kansas City, MO-KS CSA San Angelo, TX MSA Farmington, NM MSA Goldsboro, NC MSA Altoona, PA MSA Altoona–Huntingdon, PA CSA St. Joseph, MO-KS MSA Kansas City–Overland Park–Kansas City, MO-KS CSA Sheboygan, WI MSA Brunswick–St. Simons, GA MSA Anniston–Oxford, AL MSA Lewiston–Auburn, ME MSA Portland–Lewiston–South Portland, ME CSA Longview–Kelso, WA MSA Portland–Vancouver–Salem, OR-WA CSA Owensboro, KY MSA Sandusky, OH MSA Cleveland–Akron–Canton, OH CSA Weirton–Steubenville, WV-OH MSA Pittsburgh–Weirton–Steubenville, PA-OH-WV CSA Williamsport, PA MSA Williamsport–Lock Haven, PA CSA Watertown–Fort Drum, NY MSA Muncie, IN MSA Indianapolis–Carmel–Muncie, IN CSA Michigan City–La Porte, IN MSA Chicago–Naperville, IL-IN-WI CSA Beckley, WV MSA Sebring, FL MSA Pinehurst–Southern Pines, NC MSA Fayetteville–Lumberton–Pinehurst, NC CSA Gettysburg, PA MSA Harrisburg–York–Lebanon, PA CSA Kankakee, IL MSA Chicago–Naperville, IL-IN-WI CSA Ithaca, NY MSA Ithaca–Cortland, NY CSA Mankato, MN MSA Mankato–New Ulm, MN CSA Sumter, SC MSA Columbia–Sumter–Orangeburg, SC CSA Fond du Lac, WI MSA Grand Forks, ND-MN MSA Gadsden, AL MSA Bay City, MI MSA Saginaw–Midland–Bay City, MI CSA Paducah, KY- IL MSA Paducah–Mayfield, KY-IL CSA Cheyenne, WY MSA Rome, GA MSA Atlanta–Athens-Clarke County–Sandy Springs, GA-AL CSA Lima, OH MSA Lima–Van Wert–Celina, OH CSA Decatur, IL MSA Hot Springs, AR MSA Hot Springs–Malvern, AR CSA Dubuque, IA MSA Victoria, TX MSA Victoria–Port Lavaca, TX CSA Corvallis, OR MSA Portland–Vancouver–Salem, OR-WA CSA Cape Girardeau, MO-IL MSA Cape Girardeau–Sikeston, MO-IL CSA Helena, MT MSA Fairbanks–College, AK MSA Pocatello, ID MSA Hinesville, GA MSA Savannah–Hinesville–Statesboro, GA CSA Grants Pass, OR MSA Medford–Grants Pass, OR CSA Parkersburg–Vienna, WV MSA Parkersburg–Marietta–Vienna, WV-OH CSA Columbus, IN MSA Indianapolis–Carmel–Muncie, IN CSA Great Falls, MT MSA Kokomo, IN MSA Indianapolis–Carmel–Muncie, IN CSA Midland, MI MSA Saginaw–Midland–Bay City, MI CSA Elmira, NY MSA Elmira–Corning, NY CSA Casper, WY MSA Grand Island, NE MSA Minot, ND MSA Lewiston, ID-WA MSA Walla Walla, WA MSA Kennewick–Richland- Walla Walla, WA CSA Enid, OK MSA Eagle Pass, TX MSA Carson City, NV MSA Reno–Carson City–Gardnerville Ranchos, NV-CA CSA == Notes and references==",
 "title": "United States metropolitan area"
}