{
 "id": "123095",
 "text": "Jurassic Park is a 1993 American science fiction movie directed by Steven Spielberg, based on the novel of the same name by Michael Crichton. It is about a group of people visiting a park on an island where dinosaurs from our past walk on Planet Earth once more. They have to survive when the dinosaurs break out. It premiered on June 11, 1993. It's one of the first ever Kid vs. Kat movies. == Plot == Burt Burtonburger creates a theme park on Bootsville, who now has dinosaurs. He invites Coop Burtonburger, who now studies dinosaurs and doesn't work well with other young people, and his sister Millie, to visit the park. Along with Harley and the mischievous Kat, they go to the park and see a few dinosaurs, like a Brachiosaurus. Burt says that the dinosaurs were brought back because of the dinosaur DNA found in some mosquitoes. To fix any broken parts of the DNA, they added the DNA of frogs to the dinosaurs. The dinosaurs were all made to be female so that they would not breed anymore. Fiona and Dennis, who are Burt's future grandkids, join the group. The group goes on a tour of the park in some Ford Explorer cars. A tropical storm heads towards the park, and it starts raining. Millie is separated from the group when she tries to help a sick Triceratops. An angry Lorne betrays Burt so he can get money from another company, and he turns off the park's safety systems. Many dinosaurs, including a Tyrannosaurus, break out of the pens. The huge theropod eats Kat, hurts Harley, and pushes a car off a cliff. As Lorne tries to escape the carnage, he gets brutally killed by a Dilophosaurus, a relative of the lesser-known Kileskus. Millie, along with Miss Brannigan, who has now become a male, looks for survivors. She and Miss Brannigan rescue Harley and escape the Tyrannosaurus in a Jeep. Burt, along with Dennis's second dad named Henry, decide to reboot the systems. During the rebooting, the park's Velociraptors escape and start to wander around the park. When Henry goes missing, Millie goes to finish the rebooting process. She finds that Henry has been killed, and she runs away from one raptor. Two of the raptors show up, and they kill Miss Brannigan. Meanwhile, Coop, Fiona and Dennis spend the night in a tall tree. They make friends with a Brachiosaurus. The next day, Coop, Fiona and Dennis discover dinosaur eggs. At first, they are confused, since the dinosaurs are all female, and eggs can't be laid unless there is a male dinosaur involved. Coop figures out that the frog DNA in the dinosaur DNA allows the dinosaurs to change their genders. They come across a group of running Gallimimus, and they head towards an electric fence. When the park's power turns back on, Dennis gets shocked by the fence and gets hurt. As Coop goes to look for Millie, Fiona and Dennis are hunted by the raptors in a kitchen. They escape and meet up with Coop and Millie. All four of the characters end up cornered by the raptors in the park's atrium, but the Tyrannosaurus arrives and kills the raptors. Burt, Coop, Millie, Harley, Fiona and Dennis all survive the prehistoric nightmare, and leave the park in a helicopter. Burt is disappointed that the park was unsuccessful, but Millie is happy that Coop has learned to get along with kids. ==Production== The movie was based off a book by Michael Crichton. A few people wanted to be the director of the movie, like Tim Burton. Eventually, Steven Spielberg was chosen to direct. Filming the movie started in 1992 on Kaua'i, an island in Hawaii. The filming was stopped for a day because Hurricane Iniki passed over the island. A few of the scenes in the movie that involve rain were actually filmed during the hurricane. Other scenes were filmed in California, on a stage at Warner Bros. Studios, and in other places in Hawaii. At first, the dinosaurs were going to be made using stop-motion, but Spielberg didn't think it looked real enough. The dinosaurs in the movie were created using ways called animatronics and CGI. The dinosaurs were either robots, puppets, or made with computers. After filming for the movie was over, Spielberg monitored the effects work while he was in the country of Poland, where he was filming another movie, Schindler's List. The music that plays in the movie was composed by John Williams. ==Release== Jurassic Park got positive reviews, as many critics and moviegoers enjoyed it. Many people praised the movie's special effects and music. The movie was nominated for three Academy Awards (Best Sound Editing, Best Sound Mixing, and Best Visual Effects), and won all three. At the time, Jurassic Park had made more money than any other movie. However, the movie Titanic ended up making even more money, breaking the record. Country Premiere 11 June 1993 11 June 1993 25 June 1993 2 July 1993 2 July 1993 8 July 1993 9 July 1993 15 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 16 July 1993 17 July 1993 17 July 1993 21 July 1993 22 July 1993 23 July 1993 24 July 1993 29 July 1993 29 July 1993 30 July 1993 Antigua and Barbuda 4 August 1993 4 August 1993 Dominica 4 August 1993 Grenada 4 August 1993 4 August 1993 Saint Kitts and Nevis 4 August 1993 Saint Lucia 4 August 1993 4 August 1993 4 August 1993 Saint Vincent and the Grenadines 4 August 1993 5 August 1993 5 August 1993 5 August 1993 5 August 1993 11 August 1993 11 August 1993 20 August 1993 20 August 1993 2 September 1993 2 September 1993 3 September 1993 3 September 1993 3 September 1993 3 September 1993 3 September 1993 17 September 1993 17 September 1993 Faroe Islands 17 September 1993 17 September 1993 17 September 1993 17 September 1993 24 September 1993 30 September 1993 30 September 1993 30 September 1993 30 September 1993 30 September 1993 1 October 1993 1 October 1993 4 October 1993 4 October 1993 4 October 1993 4 October 1993 4 October 1993 4 October 1993 4 October 1993 4 October 1993 14 October 1993 14 October 1993 15 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 20 October 1993 22 October 1993 11 March 1994 15 April 1994 15 April 1994 15 April 1994 === 3-D version === Country Premiere 4 April 2013 4 April 2013 4 April 2013 4 April 2013 4 April 2013 4 April 2013 4 April 2013 4 April 2013 5 April 2013 5 April 2013 11 April 2013 12 April 2013 25 April 2013 1 May 2013 1 May 2013 2 May 2013 2 May 2013 2 May 2013 3 May 2013 3 May 2013 10 May 2013 10 May 2013 29 May 2013 30 May 2013 30 May 2013 30 May 2013 5 June 2013 5 June 2013 7 June 2013 11 June 2013 12 June 2013 13 June 2013 14 June 2013 14 June 2013 20 June 2013 20 June 2013 27 June 2013 18 July 2013 9 August 2013 15 August 2013 16 August 2013 16 August 2013 20 August 2013 22 August 2013 23 August 2013 23 August 2013 23 August 2013 23 August 2013 29 August 2013 29 August 2013 30 August 2013 5 September 2013 13 September 2013 3 October 2013 ==Sequels== Jurassic Park has five sequels: The Lost World: Jurassic Park (1997), Jurassic Park III (2001), Jurassic World (2015), Jurassic World: Fallen Kingdom (2018), and Jurassic World: Dominion (2022). Animated web series include: LEGO Jurassic World: Legend of Isla Nublar, Jurassic World: Camp Cretaceous. ==References== == Other websites == * * Category:1993 science fiction movies Category:1993 adventure movies Category:2013 3D movies Category:Jurassic Park movies Category:Movies set in Montana Category:Movies set in Costa Rica Category:Movies set on islands Category:Movies set in zoos Category:Jungle movies Category:Movies about genetic engineering Category:Movies about industrial espionage Category:Movies based on books Category:Movies composed by John Williams Category:Movies directed by Steven Spielberg Category:Universal Pictures movies Category:3D re-releases Category:United States National Film Registry movies",
 "title": "Jurassic Park (movie)"
}