{
 "id": "123091",
 "text": "Larry Joe Bird (born December 7, 1956) is an American retired NBA basketball player. He won three NBA championships in 1981, 1984, and 1986 with the Boston Celtics. He has also won the NBA MVP award three times, in 1984, 1985, and 1986 as a Celtic. He played college basketball at Indiana State University where he developed a rivalry and friendship with Los Angeles Lakers star Magic Johnson when he faced him in the 1979 NCAA national championship game and three NBA championship series (1984, 1985 and 1987). He has been described as one of the greatest basketball players and greatest shooters of all time. Bird was nicknamed Larry Legend and The Hick from French Lick, after his hometown in Indiana. He was also called Kodak by his first NBA coach, Bill Fitch, because Bird could form pictures in his head of the plays on the basketball court. Finally, he was nicknamed The Great White Hope. In 1992, Bird was a member of the United States men's national basketball team. The team was one of the most famous teams in US Olympic history, known as \"The Dream Team.\" The team captured the gold medal after going undefeated. In 1997, Bird became the head coach of the Indiana Pacers. He was also President of the Pacers (2000-2012, 2013-2017). He was inducted into the Naismith Memorial Basketball Hall of Fame in 2006. He was also inducted into the American Basketball Hall of Fame in 2024. The induction ceremony was held on the campus of Oakland University in Rochester, Michigan. == References == ==Other websites== Category:1956 births Category:Living people Category:American basketball players Category:Boston Celtics players Category:Medalists at the 1992 Summer Olympics Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association coaches Category:National Basketball Association players with retired numbers Category:Olympic gold medalists for the United States Category:Power forwards Category:Small forwards Category:Sports executives and administrators Category:Sportspeople from Boston Category:Sportspeople from Indiana",
 "title": "Larry Bird"
}