{
 "id": "123223",
 "text": "Drosophila melanogaster is a small, common fly found near rotting fruit. It has been in use for over a century to study genetics and lends itself well to behavioral studies. == History == Thomas Hunt Morgan studied Drosophila early in the 1900s.Allen, Garland E. 1978. Thomas Hunt Morgan: the man and his science. Princeton University Press. He and his team were the first to discover sex-linkage and genetic recombination, which placed the small fly in the forefront of genetic research.Kohler, Robert E. 1994. Lords of the fly: Drosophila genetics and the experimental life. Chicago University Press. Due to its small size, ease of culture and short generation time, geneticists have been using Drosophila ever since. It is one of the organisms whose entire genome is known, and many hundreds of genes have been identified and studied. == Life == Fruit flies are easily obtained from the wild and most biological science companies carry a variety of different mutations. In addition these companies sell equipment to culture the flies. Costs are relatively low and most equipment can be used year after year. == Behaviour == === Vision === The fly's vision is its most important sense organ. Approximately two thirds of the Drosophila brain is dedicated to visual processing. Although their ability to distinguish fine detail is worse than that of humans, their ability to time things (such as flight) is about ten times better. The compound eye of the fruit fly contains 760 units or ommatidia, and are one of the most advanced among insects. Each ommatidium contains eight photoreceptor cells (R1–8), support cells, pigment cells, and a cornea (lens). Wild-type flies have reddish pigment cells, which serve to absorb excess blue light so the fly is not blinded by ambient light. === Flight === The wings of a fly are capable of beating at up to 220 times per second. Flies fly via straight sequences of movement interspersed by rapid turns called saccades. During these turns, a fly is able to rotate 90 degrees in fewer than 50 milliseconds. It was long thought that the characteristics of Drosophila flight were dominated by the viscosity of the air, rather than the inertia of the fly body. However, research has shown that flies perform banked turns, where the fly accelerates, slows down while turning, and accelerates again at the end of the turn. This indicates that inertia is the dominant force, as is the case with larger flying animals. ===Reproduction=== In order to mate with a female fruit fly, the male fruit fly has to do a special courting dance.Sokolowski, Maria B. The mating dance of the fruit fly. New York Times. This link shows some details not discussed in this accountMaynard Smith J. 1988. Did Darwin get it right? Essays on games, sex and evolution. London. Penguin, p176 on Drosophila subobscura. *First, he faces the female. *Then, he copies the female as she jigs in front of him. *Finally she raises her wings to signal her acceptance. *The male positions himself behind the abdomen of the female, licks her genitalia. *Finally, the male fruit fly attempts copulation by curling his abdomen under hers. The female can, however, kick the male away from it with her legs. The sexual intercourse usually lasts from about 15–20 minutes, in which several hundred relatively long sperm are released into the female’s body. The female then stores these sperm in her spermathecae, and then becomes pregnant. It only takes the female a few days to give birth to about five eggs. The stages are broadly similar between species. There are differences which presumably help keep the species distinct. Some reports have the wing vibration earlier in the procedure. In any event, there are some differences between even closely related species. == References == Category:Genetics experiments Category:Drosophila Category:Model organisms",
 "title": "Drosophila melanogaster"
}