{
 "id": "123393",
 "text": "The White Rose was a German group that opposed the Nazis in World War II. They distributed pamphlets denouncing Adolf Hitler's regime from June 1942 until February 1943. The group consisted of students from the University of Munich along with a professor. == Beginning of the White Rose, June-July 1942 == In June 1942, Alexander Schmorell and Hans Scholl, who were University students at the Ludiwg Maximilian University in Munich, began writing and distributing leaflets that spoke out against Hitler and Nazi Germany. They wrote four leaflets from June-July 1942. The leaflets called for passive resistance to the Nazi regime, and told of the horrors of the War against the Jews (in the second pamphlet, they talk about how “since the conquest of Poland, three hundred thousand Jews have been murdered in this country in the most bestial way.”) The White Rose leaflets were the only Resistance movement in Nazi Germany to speak out against the systematic Holocaust of the Jews. A couple hundred copies were made of each leaflet. Hans and Alexander then mailed them out to random addresses from phone books: “To set you at rest, we add that the addresses of the readers of the White Rose are not recorded in writing. They were picked at random from directories.” -Exerpt from fourth leaflet == The White Rose, November 1942-February 1943 == In July 1942, Alex and Hans, as well as their friend Willi Graf, were ordered to go to the Russian front over the Summer to serve as medics. The resistance activities were put on hold for three months. When Alex and Hans came back in November 1942 they threw themselves back into the Resistance Activities with renewed vigor. Between November 1942-January 1943, four new members joined the group: Willi Graf, Christoph Probst, Sophie Scholl, and Kurt Huber. These members made up the core of the White Rose group, although there were multiple other members who were in charge of distribution and recruiting for the White Rose. In January 1943, the fifth leaflet was published. Unlike the other four leaflets, the fifth leaflet had a couple thousand copies printed of it. On February 3, after hearing of the defeat of Stalingrad, Hans, Willi and Alexander snuck out that night to graffiti the University walls with slogans such as “Down with Hitler” and “Hitler the mass murderer.” They repeated these graffiti campaigns on February 8 and 15, going so far as to graffiti the Feldherrnhalle , the monument to the Nazis who were killed during Hitler’s failed Beer Hall Putsch. These graffiti campaigns put the Gestapo on red alert. == Capture and Execution of the White Rose Members == In early February, the sixth leaflet was published. Thousands of copies were made of this leaflet. There were so many copies that the White Rose members ran out of envelopes to place the leaflets in. Seeing this, Hans and Sophie decided to sneak into the University during classes and place the extra leaflets in the halls. They did not tell the other members of the plan. On February 18, 1943, Hans and Sophie carried two briefcases stuffed with pamphlets into the University. Hurriedly placing leaflets in the halls, they were about to leave when Sophie realized she still had leaflets lert in her briefcase. Hurrying up to the third floor, she began to place them along the hallways. What happened next is unclear, but something caused Sophie to grab the rest of the leaflets and throw them off the balcony and into the atrium. This spontaneous action was observed by Jakob Schmid, the university custodian who was also a Nazi Party fanatic. He alerted the Gestapo, who stormed the university and captured Sophie and Hans. Over the next four days, the Gestapo interrogated Sophie and Hans. The two of them gave up no names, but Hans had a handwritten draft for a new leaflet on him when he was captured. The draft of the leaflet was written by Christoph Probst, who was captured on February 20. On February 22, 1943, Hans, Sophie, and Christoph were put on trial. They were all sentenced to death by Guillotine. Their execution was that same day. Hans and Sophie were able to see their parents before they died. Christoph was not able to see any family. Over the next few weeks, more members were captured by the Gestapo. On April 19, 1943, the second trial of the White Rose members was held. In it, Willi Graf, Alexander Schmorell, and Kurt Huber were sentenced to death. Ten other members received prison sentences, and one alleged member was acquitted. Alexander Schmorell and Kurt Huber were executed on July 13, 1943. Willi Graf was held in solitary confinement for about six months as the Gestapo tried to get him to give out names of other members. When that failed, they executed him on October 12, 1943. He was the last of the six main members to be killed. == Legacy == Today, the White Rose members, especially Hans and Sophie Scholl, are well known in Germany. Three movies have been created about the White Rose: Fünf Letzten Tage (Five last days), released in 1982 Die Weisse Rose (The White Rose), released in 1982 Sophie Scholl:Die Letzen Tage (Sophie Scholl: The Final Days), released in 2005 == Members == The core of the White Rose was comprised of five students: Sophie Scholl, her brother Hans Scholl, Alexander Schmorell, Willi Graf, and Christoph Probst. All were between the ages of 21-25 years old. Kurt Huber, Sophie’s Philosophy teacher, was the sixth main member of the White Rose. There were also other members who were on the fringe of the inner circle of the White Rose. Some of these member include: Hans Hirzel Suzanne Hirzel Franz Joseph Muller Heinrich Guter Eugen Grimminger Dr. Heinrich Phillip Bollinger Helmut Karl Theodore August Bauer Dr. Falk Erich Walter Harnack Gisela Schertling Katherina Schüddekopf Traute Lafrenz *These names came from the second trial of the White Rose members, held on April 19, 1943. Over the course of the war, a total of 29 people were captured and accused of aiding the White Rose. 13 were given prison sentences, and 16 were executed.* == References == Category:1942 establishments in Europe Category:Nazi Germany Category:Rebellions in Europe Category:20th-century rebellions Category:1943 disestablishments in Europe Category:1940s establishments in Germany Category:1940s disestablishments in Germany Category:Resistance movements of World War II",
 "title": "White Rose"
}