{
 "id": "123388",
 "text": "This is a list of Oklahoma's state symbols, including official and unofficial. The official symbols are codified by statute. Many of the unofficial symbols are put in place by Oklahoma Senate of House of Representative resolutions. ==State symbols== Flora Flora Flora Floral emblem Mistletoe 25 O.S.3§92, 1893 Fruit Strawberry 25 O.S.3§98.10, 2005 Wildflower Indian Blanket Gaillardia pulchella 25 O.S.3§92.1, 1986 Tree Redbud Cercis canadensis 1971 Grass Indian Grass Sorghastrum nutans SCR72, 1972 Flower Oklahoma Rose 25 O.S.3§92, 2004 Vegetable Watermelon 2007 Fauna Fauna Fauna Bird Scissor-tailed Flycatcher Muscivora forficata 25 O.S.3§98, 1951 Reptile Collared Lizard (Mountain Boomer) Crotaphytus collaris) HCR1009, 1969 Mammal Buffalo Bison bison SCR101, 1972 Fish White bass (Sand bass) Morone chrysops 25 O.S.3§98.2, 1974 Furbearer Animal Common Raccoon Procyon lotor SCR25, 1989 Insect European honey bee Apis mellifera SCR75, 1992 Game Animal White-tail deer Odocoileus Virginians SCR24, 1990 Game Bird Wild Turkey Meleagris gallopavo 25 O.S.3§98.13,1990 Butterfly Black Swallowtail Papilio polyxenes HB2082, 1996 Amphibian Bullfrog Rana catesbeiana HCR1026, 1997 Fossil Saurophaganax Maximus 25 O.S.3§98.6, 2000 Flying Mammal Mexican free-tailed bat (Tadarida brasiliensis) 25 O.S.3§98.11, 2006 Dinosaur Acrocanthosaurus atokensis 25 O.S.3§98.14, 2006 Music Music Music waltz \"Oklahoma Wind\" SR42, 1982 Anthem \"Oklahoma!\" lyrics: Oscar Hammerstein II music: Richard Rodgers 25 O.S.3§94.1, 1953 Folk Song \"Oklahoma Hills\" by Woody Guthrie and Jack Guthrie 25 O.S.3§94.8, 2001 Musical instrument Fiddle Unknown Country and Western Song \"Faded Love\" by John Willis and Bob Wills SCR65, 1988 Folk Dance Square Dance SCR111, 1988 Percussive Musical Instrument Drum 25 O.S.3§98.3, 1993 Children's Song \"Oklahoma, My Native Land\" by Martha Kemm Barrett HB3000, 1996 Western Band The Sounds of the Southwest HCR1053, 1997 Other Other Other Cartoon Character GUSTY© 25 O.S.3§98.9, 2005 Colors Green and White 25 O.S.3§93, 1915 Rock Rose Rock (Barite rose) 25 O.S.3§98.1, 1968 State Monument Golden Driller SCR23, 1979 Theatre Lynn Riggs Players of Oklahoma, Inc. Unknown Poem \"Howdy Folks\" by David Randolph Milsten Unknown Pin \"OK\" pin Unknown Beverage Milk SCR, 1985 Soil Port Silt Loam Cumulic haplustolls Unknown Poet Laureate biennial gubernatorial appointment 1994 Tartan Oklahoma Tartan HCR1025, 1999 Stamp Oklahoma Statehood Stamp which celebrates the 100th birthday of Oklahoma's entry into the Union, November 16, 1907 Issued by the United States Postal Service ==Other websites== *Oklahoma Almanac-\"Tourism, Symbols, and Flags\" *USPS description of the Oklahoma Statehood Stamp * State symbols",
 "title": "List of Oklahoma state symbols"
}