{
 "id": "12333",
 "text": "The Republic of Liberia is a small country on the coast of West Africa. It has common borders with Sierra Leone, Guinea, and Ivory Coast. The country has a size of about by . As of 2021, there are about 5,000,000 people in Liberia. The capital city of Liberia is Monrovia. For ships, Liberia is a flag of convenience. == Geography == Liberia is a country in Southwest Africa, on the coast of the Atlantic Ocean. Except for the coast, most of Liberia is low mountains, with an altitude of to above sea level. The coastal region is full of swamps, and reaches to inland. After that, there's a plateau at an altitude of about . About 60% of the country is covered with rainforest. To the north, there are higher mountains. There are nine big plantations of rubber trees, which are important for the economy. There are mangrove swamps near the coast. In 2019, estimates are that close to 5 million people live in Liberia. About half of them live in the capital, Monrovia. There are 15 administrative divisions, called counties. The main environmental issues in Liberia are that endangered species are hunted and eaten. This kind of meat is called bushmeat. Some of the poached animals are also sold to neighbouring countries. A big part of Liberia is rainforest. Like in other rainforest countries, Slash-and- burn agriculture is a problem. Illegal logging also is. In Monrovia, there is a lot of pollution. == History == In 1822, White Americans created the American Colonization Society and bought the land in Africa that would become Liberia. They did not want black people who were not slaves to be in the United States. Because of this, they took some of them to Liberia. At the start of the American Civil War (in the 1860s) about 12,000 freed slaves lived in Liberia. The name of the country means \"Land of the Free\" in Latin. Liberia gained its independence on July 26, 1847. Joseph Jenkins Roberts was the first president of Liberia. European countries were quick to recognize Liberia as a country. The United States did not recognize it as a country until 1862. Many of the black people who were sent to Liberia were missionaries. Its official language today is English . In the 1990s and in the early 2000s, two civil wars badly affected the country. The country's constitution is similar to that of the United States. In the 2017 elections, George Weah became the twenty- fifth President of Liberia. The President before Weah was Ellen Johnson Sirleaf, the first African female president. ==References== Category:Least developed countries Category:English-speaking countries",
 "title": "Liberia"
}