{
 "id": "12334",
 "text": "The Central African Republic (CAR) (, , or Centrafrique ; Sango Ködörösêse tî Bêafrîka), formerly Ubangi-Shari, is a landlocked country in Central Africa. It is mostly a plateau or high, flat piece of land about 941 metres above the sea. The CAR covers a land area of about , and has an estimated population of about 4.4 million as of 2008. Bangui is the capital city. ==Background== There are thick forests in the south, and these are home to rare gorillas. This part of Africa also has Pygmies. Other important towns are Bouar, Zinga, and Ouadda. Its southern border is the Ubangi River. There are 3.8 million people in the C.A.R. Most of them belong to the Banda and Baya tribes. The main language is French but some people speak the national language of Sango. The people mostly grow their own food, but sometimes droughts (long spells without any rain) make this difficult. The C.A.R. also has diamond and uranium mines. It sells these, as well as cotton, coffee, and timber to other countries to make money. The currency used is the CFA Franc - 1 US Dollar is worth 590.3 CFA Francs. The country was ruled by France until 1960 when it became independent. The country has not been very stable since then, with multiple wars with itself, and corruption. In April 2022, the country made bitcoin a legal tender, becoming the second country in the world to adopt the cryptocurrency. ==Geography== The Central African Republic is a landlocked nation. It is bordered by the countries of Cameroon, Chad, Sudan, South Sudan, the Democratic Republic of the Congo and the Republic of the Congo. Much of the Central African Republic is flat, or rolling plateau savanna. It is typically about above sea level. Most of the northern half is in the World Wildlife Fund's East Sudanian savanna ecoregion. In the northeast are the Fertit Hills. There are scattered hills in the southwest part of the country. To the northwest is the Yade Massif, a granite plateau with an altitude of . At , the Central African Republic is the world's 42nd-largest country. It is about the size of Ukraine, and is somewhat smaller than the US state of Texas. Much of the southern border is formed by tributaries of the Congo River. The Mbomou River in the east merges with the Uele River to form the Ubangi River. In the west, the Sangha River flows through part of the country. The eastern border is along the edge of the Nile River watershed. Forest covers up to 8% of the land. The densest parts are in the south. The forest is highly diverse. It includes commercially important species of Ayous, Sapelli and Sipo.Sold Down the River (English) March 2001 , Forests Monitor The deforestation rate is 0.4% per year, and lumber poaching is commonplace. The Forests of the Congo Basin: State of the Forest 2006 . CARPE 13-July-07 ==Prefectures== The Central African Republic is divided into 14 administrative prefectures. There are also 2 economic prefectures and one autonomous commune. The prefectures are further divided into 71 sub-prefectures. The prefectures of the Central African Republic are: * Bamingui-Bangoran * Basse-Kotto * Haute-Kotto * Haut-Mbomou * Kémo * Lobaye * Mambéré-Kadéï * Mbomou * Nana-Mambéré * Ombella-M'Poko * Ouaka * Ouham * Ouham-Pendé * Vakaga The two economic prefectures are Nana-Grébizi and Sangha-Mbaéré. The commune is Bangui. ==Cities== The largest cities in the Central African Republic are: #Bangui - 622,771 (census 2006) #Bimbo - 124,176 #Berbérati - 76,918 #Carnot - 45,421 #Bambari - 41,356 #Bouar - 40,303 #Bossangoa - 36,478 #Bria - 35,204 #Bangassou - 31,553 #Nola - 29,181 ==Related pages== * The Central African Republic at the Olympics * Central African Republic national football team * Food of the Central African Republic * List of rivers of the Central African Republic ==References== ==Other websites== * Pygmy people Hunter-gatherer peoples from the Central African rain forest * * Category:French-speaking countries Category:Least developed countries",
 "title": "Central African Republic"
}