{
 "id": "123387",
 "text": "Facebook (sometimes shortened to FB) is a social networking service and website started in February 4, 2004. It was built by Mark Zuckerberg. It is owned by Meta, Inc. , Facebook has over one billion active users. Users may make a personal profile, add other users as friends, and send messages. Facebook users must register before using the site. The name of the service comes from the name for the book given to students at the start of the school year by some universities in the United States. These books help students get to know each other better. Facebook allows any users who are at least 13 years old to become users of the website. Facebook was started by Mark Zuckerberg with his college roommates and fellow computer science students Eduardo Saverin, Dustin Moskovitz and Chris Hughes. The website's membership was only for Harvard students at first. Later it included other colleges in the Boston area, the Ivy League, and Stanford University. It eventually opened for students at other universities. After that, it opened to high school students, and, finally, to anyone aged 13 and over. Based on ConsumersReports.org in May 2011, there are 7.5 million children under 13 with accounts. This breaks the website's rules. A January 2009 Compete.com study ranked Facebook as the most used social networking service by worldwide monthly active users. Entertainment Weekly put the site on its end-of-the-decade \"best-of\" list. It said, \"How on earth did we stalk our exes, remember our co-workers birthdays, bug our friends, and play a rousing game of Scrabulous before Facebook?\" Quantcast estimates Facebook had 138.9 million monthly different U.S. visitors in May 2011. According to Social Media Today, in April 2010 about 41.6% of the U.S. population had a Facebook account. Facebook's growth started to slow down in some areas. The site lost 7 million active users in the United States and Canada in May 2011 relative to previous statistics. India has the most Facebook users. == Criticism == Facebook has been involved in many controversies over privacy. Some of these controversies have been about people being able to see personal information that other people post, and others are about companies and advertisers being able to see users' personal information. Facebook has sent ads to people based on the persons gender, age, income, national origin and sexual orientation.Facebook to make jobs, credit advertisements searchable for all users Research published in the journal PLOS ONE has shown that Facebook may be responsible for spreading unhappiness through society as well as keeping people connected. Scientists found that the more time people spent on Facebook over a two-week period, the worse they subsequently felt. \"On the surface, Facebook provides an invaluable resource for fulfilling the basic human need for social connection. Rather than enhancing well-being, however, these findings suggest that Facebook may undermine it.\" === Facebook Gaming === In 2018, Facebook launched Facebook Gaming officially on June 1, 2018 with a pool of gaming streamers including Darkness429, Stonemountain64, ThePoolshark, and Alodia Gosiengfiao. Facebook Gaming or fb.gg is Facebook's take on gaming livestreams where gamers and fans interact. Facebook launched it as a tab on the Facebook app and a standalone app. It also has an In-stream Rewards feature where viewers are gifted in-game rewards while watching streams with Mobile Legends: Bang Bang being a part of pioneering the feature as mentioned by Jack Li, a Facebook Gaming representative, on Moonton Epicon held last July 18, 2019. In 2019, Jeremy \"DisguisedToast\" Wang was signed to Facebook Gaming in a surprise move from Twitch. Soon after, Facebook signed Super Smash Bros. star streamer Gonzalo \"ZerO\" Barrios. On February 18, 2020 Ronda Rousey performed her first live stream on Facebook Gaming, announcing that she will stream once per week. The details of her contract were not disclosed. On April 20, 2020 Facebook launched its gaming app in Playstore, named as Facebook Gaming. This app was actually planned to release in June 2020, but Facebook preponed on witnessing the community demand. ==References== ==Other websites== https://www.facebook.com/ Category:2004 establishments in the United States Category:American social networking websites Category:American technology companies Category:Websites established in 2004 Category:Meta Platforms applications",
 "title": "Facebook"
}