{
 "id": "123412",
 "text": "R. L. Burnside (born Robert Lee Burnside, November 23 1926 - September 1 2005) was a blues singer, songwriter, and guitarist who lived in Holly Springs, Mississippi. He played music for most of his life, but did not get popular till the 1990s. == Early life == Burnside was born in Harmontown, Mississippi, in Lafayette County. He spent most of his life working as a sharecropper and a fisherman, as well as playing guitar at weekend house parties. He was first inspired to play guitar in his early twenties, after hearing John Lee Hooker play. He learned music from Mississippi Fred McDowell, who lived nearby. He was also influenced by his cousin-in-law, Muddy Waters. During the 1950s, Burnside moved to Chicago, Illinois to get a better job, but things did not turn out as he had hoped. Within one month, his father, brother, and uncle were all murdered in the city. He used this tragedy to help him write music. He used it mostly for his interpretation of Skip James's \"Hard Time Killing Floor\", \"R.L.'s Story,\" and the opening and closing tracks on Burnside's 2000 album, Wish I Was In Heaven Sitting Down. Around 1959, he left Chicago and went back to Mississippi to work the farms and raise a family. ==Later life== After a heart attack in 2001, Burnside's doctor advised him to stop drinking; Burnside did, but said that change stopped him from playing. Members of his family continue to play blues in the Holly Springs area. His grandson, Cedric Burnside, tours with Kenny Brown, while his son Duwayne Burnside has played guitar with the North Mississippi Allstars. In 2004, the Burnside sons opened Burnside Blues Cafe, 30 miles southeast of Memphis in Holly Springs, Mississippi. == Career == His earliest recordings were made in the late 1960s by George Mitchell and released on Arhoolie Records. Another album was recorded that year and Hill Country Blues came after in the early 1980s. An album with only singles followed, released in Memphis, Tennessee. In the 1990s, he began recording for the Oxford, Mississippi, label Fat Possum Records, founded by Peter Redvers-Lee and Matthew Johnson. Burnside stayed with Fat Possum until his death, and he usually played with his friend and understudy, the slide guitarist Kenny Brown. ==Death== Burnside died at St. Francis Hospital on September 1, 2005 at 78 years old.“R.L. Burnside.” The South Reporter (September 15, 2005) http://www.southreporter.com/2005/wk37/obits.html (accessed: May 21, 2008) === Surviving family === *His wife: Alice Mae Taylor Burnside (They had been married almost 55 years.) McInerney, \"White man at the Door\"); *Daughters: Mildred Jean Burnside, Linda Jackson, Brenda Kay Brooks, and Pamela Denise Burnside; *Sons: Melvin Burnside, R.L. Burnside Jr., Calvin Burnside, Joseph Burnside, Daniel Burnside, Duwayne Burnside, Dexter Burnside, Garry Burnside, and Rodger Harmon *Sisters: Lucille Burnside, Verelan Burnside, and Mat Burnside *Brother: Jesse Monia *35 Grandchildren *32 Great-Grandchildren \"R.L. Burnside.” South Reporter“R.L. Burnside.” South Reporter(2005). == Prison time == Burnside was convicted of murder and sentenced to six months' in prison.McInerney, Jay. \"White man at the Door: One Man's Mission to Record the 'Dirty Blues\" -- before Everyone Dies.\" New Yorker (February 4, 2002): p. 55 Burnside's boss helped to keep the murder sentence short because he needed Burnside to work on the farm. \"I didn't mean to kill nobody,\" Burnside said. \"I just meant to shoot the sonofabitch in the head. Him dying was between him and the Lord.\" == Style == Burnside had a strong voice and played electric and acoustic guitars. He played in the style of North Mississippi hill country blues rather than Mississippi Delta blues. Many of his songs do not have chord changes, but use the same chord or bass line through the song. == Discography == * First Recordings (recorded in the late 1960s by George Mitchell; re- released by Fat Possum Records in 2003) * A Ass Pocket of Whiskey (1996, featuring the Jon Spencer Blues Explosion) * Burnside on Burnside (a critically acclaimed 2001 live album recorded in the Crystal Ballroom on Portland, Oregon's Burnside Street) * Come On In, Wish I Was in Heaven Sitting Down, and A Bothered Mind (three albums of remixed material, often featuring guest artists, released in 1998, 2000 and 2004, respectively) * Too Bad Jim (produced in 1992 by Robert Palmer) * Well, Well, Well (songs and interviews from 1986-1993, released in 2001 on MC Records) == Movies == *Deep Blues: A Musical Pilgrimage to the Crossroads (1991). Directed by Robert Mugge *American Patchwork: Songs and Stories of America, part 3: \"The Land Where the Blues Began\" (1990). Written, directed, and produced by Alan Lomax; developed by the Association for Cultural Equity at Columbia University and Hunter College. North Carolina Public TV; A Dibb Direction production for Channel Four. *You See Me Laughin': The Last of the Hill Country Bluesmen (2003; released by Fat Possum Records in 2005). Produced and directed by Mandy Stein. Oxford, Mississippi: Plain Jane Productions, Inc; Fat Possum Records. ==References== ==Other websites== * Allmusic.com artist page * Fat Possum artist website * Mabe, Ed. R. L. Burnside: One Badass Bluesman. Nov. 1999. Category:1926 births Category:2005 deaths Category:Singers from Mississippi Category:American guitarists Category:Blues guitarists Category:Musicians from Mississippi Category:People from Holly Springs, Mississippi",
 "title": "R. L. Burnside"
}