{
 "id": "123512",
 "text": "Tornado Alley is a colloquial term most often used to refer to the area of the United States in which tornadoes happen more than in any other part of the country. The 1974 super tornado outbreak with 148 tornadoes, took place in Georgia, Illinois, Indiana, Kentucky, Michigan, Mississippi, North Carolina, Ohio, South Carolina, Tennessee, Virginia, and West Virginia. States such as Minnesota, Wisconsin, Illinois, Indiana, and Ohio are sometimes included in Tornado Alley. Research suggests that tornadoes are happening more often in the northern parts of Tornado Alley where it reaches the Canadian prairies. == Tornado alley geographical area == Over the years, the location(s) of Tornado Alley have not been clearly defined. No definition of tornado alley has ever been officially chosen by the National Weather Service (NWS). Thus, differences in the place are because of the different criteria used. The National Severe Storms Laboratory (NSSL) FAQ says that \"Tornado Alley\" is a term used by the media as a reference to areas that have more tornadoes. A study of 1921–1995 tornadoes concluded almost one-fourth of all significant tornadoes happen in this area. No state has no tornadoes; however, they happen more often in the Central United States, between the Rocky Mountains and Appalachian Mountains. Another criterion for the location of Tornado Alley (or Tornado Alleys) can be where the strongest tornadoes happen more often. == Origin of the term == The term \"tornado alley\" was first used in 1952 by U.S. Air Force meteorologists Major Ernest J. Fawbush (1915–1982) and Captain Robert C. Miller (1920–1998). They used it as the title of a research project to study severe weather in parts of Texas and Oklahoma.See: # Jeremy Singer- Vine (May 23, 2011) \"How did \"Tornado Alley\" get its name?,\" Slate (on-line magazine). # John P. Gagan, Alan Gerard, and John Gordon (December 2010) \"A historical and statistical comparison of \"Tornado Alley\" to \"Dixie Alley\", \" National Weather Digest, vol. 34, no. 2, pages 146-155; see especially page 146. # \"Weather officers commended,\" Take-Off (newspaper of Tinker Air Force Base; Midwest City, Oklahoma), January 16, 1953. # Results of search of Google Books for \"tornado alley\". == How many tornadoes == The average tornado stays on ground for only 5 minutes. These figures, reported by the National Climatic Data Center for the period between 1991 and 2010, show the seventeen U.S. states with the most average number of tornadoes per per year. # Florida: 12.2 # Kansas: 11.7 # Maryland: 9.9 # Illinois: 9.7 # Mississippi: 9.2 # Iowa: 9.1 # Oklahoma: 9 # South Carolina: 9 # Alabama: 8.6 # Louisiana: 8.5 # Arkansas: 7.5 # Nebraska: 7.4 # Missouri: 6.5 # North Carolina: 6.4 # Tennessee: 6.2 # Indiana: 6.1 # Texas: 5.9 ==Canadian tornadoes== About half of all Canadian tornadoes hit the Canadian prairies and Northern Ontario as far east as Lake Superior. Together, these areas make up the northernmost border of the U.S. Tornado Alley. Tornadoes up to EF5 in strength have been found in this region.http://ec.gc.ca/meteo- weather/default.asp?lang=En&n;=6C5D4990-1#tornadoes Schools in Tornado Alley often have tornado drills, and many homes may have tornado shelters where people can go for safety. ==References== ==Other websites== * NSSL Tornado Climatology * Climatological Estimates of Local Daily Tornado Probability for the United States * Tornado hazards in the United States * Statistical modeling of tornado intensity distributions category:Regions of the United States Category:Tornadoes in the United States",
 "title": "Tornado Alley"
}