{
 "id": "123877",
 "text": "Theodor Seuss Geisel (; March 2, 1904 – September 24, 1991) was an American writer and cartoonist from Springfield, Massachusetts. He was better known by his pen name, Dr. Seuss. After World War I he was a sophomore in high school. He was not interested in sports. He pronounced his name , but it is often said as .A Seuss Shocker == Works == Geisel wrote more than 60 books. He got the ideas for his stories from the animal sounds from the nearby zoo, because he could hear them when he opened the window. Though most of them were published as Dr. Seuss, he also wrote 13 books as Theo. LeSieg and one as Rosetta Stone (a reference to the Rosetta Stone). Theodor Seuss Geisel is one of the most famous children's authors of all time. His books were known for catchy sentences. His books have sold over 222 million copies and they have been translated into more than 15 languages. In the years after his death in 1991, many books have been published based on his sketches and notes; these include Hooray for Diffendoofer Day! and Daisy-Head Mayzie. Though they were all published under the name Dr. Seuss, only My Many Colored Days, originally written in 1973, was entirely by Geisel. By the time of his death he had sold 200 million copies of his books. There is a museum devoted only for his books in Springfield, Mass. === As Dr. Seuss === * And to Think That I Saw It on Mulberry Street (1937) * The 500 Hats of Bartholomew Cubbins (1938) * The King's Stilts (1939) * The Seven Lady Godivas (1940) * Horton Hatches the Egg (1940) * McElligot's Pool (Caldecott Honor Book, 1947) * Thidwick the Big- Hearted Moose (1948) * Bartholomew and the Oobleck (Caldecott Honor Book, 1949) * If I Ran the Zoo (Caldecott Honor Book, 1950) * Scrambled Eggs Super! (1953) * Horton Hears a Who! (1954) * On Beyond Zebra! (1955) * If I Ran the Circus (1956) * How the Grinch Stole Christmas! (1957) * The Cat in the Hat (1957) * The Cat in the Hat Comes Back (1958) * Yertle the Turtle and Other Stories (1958) * Happy Birthday to You! (1959) * Green Eggs and Ham (1960) * One Fish Two Fish Red Fish Blue Fish (1960) * The Sneetches and Other Stories (1961) * Dr. Seuss's Sleep Book (1962) * Dr. Seuss's ABC (1963) * Hop on Pop (1963) * Fox in Socks (1965) * I Had Trouble in Getting to Solla Sollew (1965) * The Cat in the Hat Song Book (1967) * The Foot Book (1968) * I Can Lick 30 Tigers Today! and Other Stories (1969) * My Book about ME (Illustrated by Roy McKie, 1970) * I Can Draw It Myself (1970) * Mr. Brown Can Moo! Can You?: Dr. Seuss's Book of Wonderful Noises! (1970) * The Lorax (1971) * Marvin K. Mooney Will You Please Go Now! (1972) * Did I Ever Tell You How Lucky You Are? (1973) * The Shape of Me and Other Stuff (1973) * There's a Wocket in My Pocket! (1974) * Great Day for Up! (Illustrated by Quentin Blake, 1974) * Oh, the Thinks You Can Think! (1975) * The Cat's Quizzer (1976) * I Can Read with My Eyes Shut! (1978) * Oh Say Can You Say? (1979) * Hunches in Bunches (1982) * The Butter Battle Book (1984) * You're Only Old Once! : A Book for Obsolete Children (1986) * I Am NOT Going to Get Up Today! (Illustrated by James Stevenson, 1987) * Oh, the Places You'll Go! (1990) * Daisy-Head Mayzie (Posthumous, 1995) * My Many Colored Days (Posthumous, illustrated by Steve Johnson with Lou Fancher, 1996) * Hooray for Diffendoofer Day! (Posthumous, from notes, with Jack Prelutsky and Lane Smith, 1998) === As Theo LeSieg === * Ten Apples Up on Top! (Illustrated by Roy McKie, 1961) * I Wish That I Had Duck Feet (Illustrated by B Tobey, 1965) * Come over to My House (Illustrated by Richard Erdoes, 1966) * The Eye Book (Illustrated by Joe Mathieu/Roy McKie, 1968) * I Can Write (Illustrated by Roy McKie, 1971) * In a People House (Illustrated by Roy McKie, 1972) * Wacky Wednesday (Illustrated by George Booth, 1974) * The Many Mice of Mr. Brice (Illustrated by Roy McKie, 1974) * Would You Rather Be a Bullfrog? (Illustrated by Roy McKie, 1975) * Hooper Humperdink...? Not Him! (Illustrated by Charles E. Martin, 1976) * Please Try to Remember the First of Octember! (Illustrated by Art Cummings, 1977) * Maybe You Should Fly a Jet! Maybe You Should Be a Vet! (Illustrated by Michael J. Smollin, 1981) * The Tooth Book (Illustrated by Joe Mathieu/Roy McKie, 1989) === As Rosetta Stone === * Because a Little Bug Went Ka-choo (Illustrated by Michael Frith, 1975) == Death == Dr. Seuss died from oral cancer in La Jolla, California, aged 87. His ashes were scattered across the pacific ocean. == References == == Further reading == * Theodor Seuss Geisel: The Early Works, Volume 1 (Checker Book Publishing, 2005; ), Early Works Volume 1 is the first of a series collecting various political cartoons, advertisements, and various images drawn by Geisel long before he had written any of his world-famous books. * Dr. Seuss From Then to Now (New York: Random House, 1987; ) is a biographical retrospective published for the exhibit of the same title at the San Diego Museum of Art * Dr. Seuss & Mr. Geisel,a biography by close friends Judith and Neil Morgan (1995, Random House) * The Secret Art of Dr. Seuss by Audrey Geisel (New York: Random House, 1995; ) contains many full-color reproductions of Geisel's private, previously unpublished artwork. * Dr. Seuss Goes to War: The World War II Editorial Cartoons of Theodor Seuss Geisel, a selection with commentary by Richard Minnear (New Press, 2001; ). * Oh, the Places He Went, a story about Dr. Seuss by Maryann Weidt (Carolrhoda Books, 1995; ) * The Seuss, the Whole Seuss and Nothing But the Seuss: A Visual Biography of Theodor Seuss Geisel by Charles Cohen (Random House Books for Young Readers, 2004; ). * Dr. Seuss: American Icon by Philip Nel (Continuum Publishing, 2004; ) * The Annotated Cat: Under the Hats of Seuss and His Cats by Philip Nel (Random House, 2007; ) * The Tough Coughs as he Ploughs the Dough: Early Writings and Cartoons by Dr. Seuss, edited and with an introduction by Richard Marschall (also includes autobiographical material); * The Boy on Fairfield Street by Kathleen Krull. It tells about the childhood of Dr. Seuss and shows the sources of many of his inspirations. == Other websites == * Seussville site Random House * Dr. Seuss biography on Lambiek Comiclopedia * The Register of Dr. Seuss Collection UC San Diego * The Advertising Artwork of Dr. Seuss UC San Diego * Dr. Seuss Went to War: A Catalog of Political Cartoons UC San Diego * \"My Uncle Terwilliger on the Art of Eating Popovers\" Commencement poem at Lake Forest College (June 4, 1977) * Category:1904 births Category:1991 deaths Category:American children's writers Category:American military personnel of World War II Category:American poets Category:Cancer deaths in San Diego County Category:Deaths from oral cancer Category:Pen names Category:People from Springfield, Massachusetts Category:Writers from Massachusetts Category:American cartoonists",
 "title": "Dr. Seuss"
}