{
 "id": "123856",
 "text": "Disney's Nine Old Men were a group of animators who were very important names for Disney. They made many important works of Disney, from Snow White and the Seven Dwarfs to The Fox and the Hound. Although the men of the group were all young, Walt Disney called them Nine Old Men as a reference to Franklin D. Roosevelt calling the US Supreme Court nine old men. The Nine Old Men were: *Les Clark (November 17, 1907 - September 12, 1979), who joined Disney in 1927. He was best known for animating Mickey Mouse as he was the only one of the Nine Old Men to work on that character from its start with Ub Iwerks. Les did many scenes throughout the years, animating up until Lady And The Tramp. He moved into directing and made many animated featurettes and shorts. *Ollie Johnston (October 31, 1912 - April 14, 2008), who joined Disney in 1935, first worked on Snow White. He went on to write the animator's book The Illusion of Life with Frank Thomas. His work included Mr. Smee (in Peter Pan), the Stepsisters (in Cinderella), the District Attorney (in The Adventures of Ichabod and Mr. Toad), and Prince John (in Robin Hood). The book The Disney Villain, written by Johnston and Frank Thomas, says that Johnston also worked with Thomas on making characters such as Ichabod Crane (in The Adventures of Ichabod and Mr. Toad) and Sir Hiss (in Robin Hood). *Frank Thomas (September 5, 1912 - September 8, 2004) joined Disney in 1934. He went on to write the animator's book The Illusion of Life with Ollie Johnston. His work included the wicked Stepmother (in Cinderella), the Queen of Hearts (in Alice In Wonderland), and Captain Hook (in Peter Pan). *Wolfgang \"Woolie\" Reitherman (June 26, 1909 - May 22, 1985) joined Disney in 1933 as an animator and director. He directed all the animated Disney movies after Walt's death until his retirement. Some of his work includes the Crocodile (in Peter Pan), the Dragon (in Sleeping Beauty), and the Rat (in Lady And The Tramp). *John Lounsbery (March 9, 1911 - February 13, 1976) started in 1935 and, working with the name Norm 'Fergy' Ferguson, quickly became a star animator. Lounsbery, known as 'Louns' by the animators he worked with, was a strong draftsman whose work helped many animators over the years. His animation was noted for its squashy, stretchy feel. Lounsbery animated Ben Ali Gator in Fantasia; Father in Peter Pan; Tony, Joe, and some of the dogs in Lady And The Tramp; The Kings in Sleeping Beauty; The Elephants in The Jungle Book; and many, many others. In the 1970s, Louns became a Director and co-directed Winnie The Pooh And Tigger Too and his last movie, The Rescuers. *Eric Larson (September 3, 1905 - October 25, 1988) joined in 1933. One of the top animators at Disney, he animated well known characters such as Peg in Lady And The Tramp; the Vultures in The Jungle Book; Peter Pan's flight over London to Neverland; and Brer Rabbit, Brer Fox, and Brer Bear (in Song of the South). Because of the way he could train new talent, Larson was given the job to spot and train new animators at Disney in the 1970s. Many of the top talents at Disney today were trained by Eric in the '70s and '80s. *Ward Kimball (March 4, 1914 - July 8, 2002) joined Disney in 1934. His work includes Lucifer, Jaq and Gus, (in Cinderella), and the Mad Hatter and Cheshire Cat (in Alice in Wonderland). His work was often more 'wild' than the other Disney animators and was very unique. *Milt Kahl (March 22, 1909 - April 19, 1987) started in 1934 working on Snow White. His work included Shere Khan (in The Jungle Book), Edgar the butler (in The Aristocats), the Sheriff of Nottingham (in Robin Hood), and Madame Medusa (in \"The Rescuers\"). *Marc Davis (March 30, 1913 - January 12, 2000) started in 1935 on Snow White, and later he went on to work on the characters of Bambi and Thumper (in Bambi), Maleficent and the raven (in Sleeping Beauty), and Cruella DeVil (in One Hundred and One Dalmatians). Davis also did character design for both the Pirates of the Caribbean and Haunted Mansion attractions at Disneyland. By the time Robin Hood was released, only four of the Nine Old Men were still animating at Disney. They were Milt Kahl, John Lounsbery, Frank Thomas and Ollie Johnston, although Eric Larson and Wolfgang Reitherman were both working for Disney, but not as animators. Lounsbery died in 1976, Kahl retired the same year and died in 1987. Thomas and Johnston retired in 1978, and both later enjoyed cameo appearances in the Brad Bird-directed movies The Iron Giant (Warner Bros., 1999) and The Incredibles (Pixar, 2004). Thomas died shortly after that, in 2004, leaving Johnston as the last living \"Old Man.\" He died on April 14, 2008. ==References== #Canemaker, John. (2001). Walt Disney's Nine Old Men and the Art of Animation. New York, NY: Disney Editions. ISBN 0-7868-6496-6 Nine Old Men, Disney's",
 "title": "Disney's Nine Old Men"
}