{
 "id": "124026",
 "text": "Elite Beat Agents is a music video game made by iNiS and published by Nintendo for the Nintendo DS handheld game console. It's the spiritual sequel to Osu! Tatakae! Ouendan. The gameplay has the player tap and drag on spots on the touch screen in beat to the rhythm of the music to score points. It was released under the Touch! Generations label in North America. In South Korea, it's called Dowajweo! Rhythm Hero (; Help! Rhythm Hero). ==Track listing== ===Songs in the main story=== # Steriogram - \"Walkie Talkie Man\" (by Jason Paige) \"Trio of Mayhem! Love and Boyfriends!!\" # Sum 41 - \"Makes No Difference\" (by Vinn Lombardo) \"Red Carpet Premiere! Smash Hit or Box Office Crash!!\" # Avril Lavigne - \"Sk8er Boi\" (by Angela Michael) \"Hey, Taxi! To the Hospital, and Hurry!!\" # Freddie Mercury/Queen - \"I Was Born to Love You\" (by Paul Vician) \"Art and Beauty! Love and Happiness!?\" # Stray Cats - \"Rock This Town\" (by Mark Latham) \"Magic Meets Madness! The Show Must Go On!\" # Deep Purple - \"Highway Star\" (by Kaleb James) \"A Pug's Life! 400 Miles from Home!!\" # Village People - \"Y.M.C.A.\" (by TC Moses) \"Ahoy, Mates! Sunken Delights and Adventure!!\" # Earth, Wind and Fire - \"September\" (by TC Moses) \"Cry Wolf! Meteorology and Parenting!!\" # Jamiroquai - \"Canned Heat\" (by Jason Paige) \"Family Honor! Introducing the Secret-Weapon Ninja!!\" # Madonna - \"Material Girl\" (by Melissa Garber) \"Survive! Celebrity Lives and Desert Isles!!\" # Ashlee Simpson - \"La La\" (by Laura Jane) \"NURSE!! Gold Medal Hero or Zero!!\" # Chicago - \"You're the Inspiration\" (by Julian Miranda) \"A Christmas Gift\" # David Bowie - \"Let's Dance\" (by Delaney Wolff) \"Rags to Riches! Go East Wildcatter!\" # Good Charlotte - \"The Anthem\" (by Kevin Ridel) \"Batter Up! Home Run Hero Makes a Comeback!!\" # Hoobastank - \"Without a Fight\" (by Kevin Ridel) \"No More Music!? The Last Hope!!\" (part 1) # The Rolling Stones - \"Jumpin' Jack Flash\" (by Billy Fogarty) \"No More Music!? The Last Hope!!\" (part 2) ===Bonus songs=== # Cher - \"Believe\" (by Lynn Rose) \"Aspire! Dancing to the Limelight!!\" # Jackson Five - \"ABC\" (by TC Moses and Brittany Kertesz) \"Here, Kitty, Kitty! Baby Hijinks!!\" # Destiny's Child - \"Survivor\" (by April Harmony) \"The Last Laugh! Just a Peanut Matter!!\" ==References== Category:2006 video games Category:Cheerleader video games Category:Christmas video games Category:Music video games Category:Nintendo DS games Category:Nintendo DS- only games Category:Video games about alien invasions Category:Video games developed in Japan Category:Video games set in Italy",
 "title": "Elite Beat Agents"
}