{
 "id": "124148",
 "text": "The United States secretary of defense (SecDef) is the head of the United States Department of Defense (DoD), the executive department of the U.S. Armed Forces..DoDD 5100.1: Enclosure 2: a. The position was established in 1947 with the National Security Act, which aimed to unify and coordinate the various branches of the military under a single executive authority. The defense secretary serves as the principal defense policy advisor to the president and is responsible for overseeing the Department of Defense, making decisions on military strategy, personnel, and budgetary issues. The first person to hold this title was James Forrestal. Subject only to the orders of the president, the secretary of defense is in the chain of command and exercises command and control over all DoD-controlled service branches the Army, Marine Corps, Navy, Air Force, and Space Forceas well as the Coast Guard when its command and control is transferred to the Department of Defense.Joint Publication 1: II-9, II-10 & II-11. The chairman of the Joint Chiefs of Staff is the principal military adviser to the secretary of defense and the president. Over the decades, the role has changed significantly, especially during major conflicts such as the Korean War, the Vietnam War, and the wars in Iraq and Afghanistan. This role has increasingly emphasized not only military preparedness and operations but also the integration of defense with international relations and national security priorities. Pete Hegseth is the current secretary of defense. He was nominated by President-elect Donald Trump and confirmed by the Senate on January 25, 2025. == List of secretaries of defense == ; Parties ; Status ==References== ==Other websites== * – Includes the Secretary of Defense * More information on each position and biographies of the current Deputy Secretary (DepSecDef) and Under Secretaries (USDs) Category:1947 establishments in the United States",
 "title": "United States Secretary of Defense"
}