{
 "id": "124135",
 "text": "The Wario series is a series of games that star Wario and a spin-off of the Mario series. It started out with Wario Land: Super Mario Land 3, and has grown to have its new spin-off series with WarioWare, Inc.: Mega Microgame$! ==Characters== *Wario - the main character in the games who often tries to get more money. Even though he's very greedy, he's helped a lot of people out, mostly because of a reward. In the WarioWare series, Wario owns his own video game company. ===Wario Land=== *Captain Syrup - A female pirate who is Wario's first enemy besides Mario in Super Mario Land 2: 6 Golden Coins. She steals a Princess Peach statue in Wario Land: Super Mario Land 3, and Wario tries to steal it so that he can sell it to Mario and Peach. She later appears in Wario Land II and Wario Land: The Shake Dimension. *Rudy the Clown - Another enemy of Wario. He's a giant, ugly clown with floating hands. He first appears in Wario Land 3, but appears again in Dr. Mario 64 fighting Wario and Dr. Mario, and in Wario Land: The Shake Dimension. *Princess Shokora - A Princess in Wario Land 4 who gets turned into a cat by a woman called Golden Diva. *Golden Diva - A rich, evil woman who lives in a giant Pyramid in Wario Land 4. *Black Jewel - An evil jewel who takes over Wario's castle in Wario World and turns all his money into monsters. *Goodstyle - A talking wand who asks Wario to help him beat Count Cannoli in Wario: Master of Disguise. *Count Cannoli - A thief in Wario: Master of Disguise. *Carpaccio - A chemist and a thief in Wario: Master of Disguise. *Terrormisu - An evil demon sealed into a stone called a Wishstone in Wario: Master of Disguise. *Shay King - The villain of Wario Land: The Shake Dimension who steals a magic purse and a woman that makes a never-ending flow of gold, and Wario tries to defeat him to save the princess and steal the magic purse. ===WarioWare=== WarioWare adds many new characters who are employees of Wario's company, WarioWare. *Mona - A young girl who, while working for WarioWare, also does other jobs like delivering pizza, serving ice cream, cheerleading, and being a pop star. She rides on a vespa scooter and has a monkey, a pig, and an elephant to help her. *Jimmy T. - A dancer who's a fan of disco. He has a cell phone that he likes to play games on when he's not dancing. He has a blue afro, but it is also green and pink in WarioWare, Inc.: Mega Microgame$! He has four relatives - his parents are named Papa T. and Mama T., and he has a brother and sister named James T. and Jamie T. He also has a look-alike called Jimmy P. *Dr. Crygor - A scientist who helps Wario out often and makes inventions for him to use. *9-Volt and 18-Volt - 9-Volt and 18-Volt are two video game players in grade school. *5-Volt - 5-Volt is 9-Volt's mother. *Kat & Ana - Two ninja kindergarteners who fight evil monsters. *Orbulon - A very smart alien who crash lands on Earth, and often gets into trouble in space. *Dribble and Spitz - A dog and a cat who also work as taxi drivers. *Ashley - A young witch who casts spells and makes potions. She has a friend and pet called Red, a tiny demon. *Mike - A robot made by Dr. Crygor. He uses a microphone. *Penny Crygor - Dr. Crygor's daughter. She's also very smart. *Young Cricket and Master Mantis - A student and his master. They practice martial arts. *Wario-Man - Wario's super-hero form. Wario can become him in more than one way, but one way is that he eats bad garlic. ==Games== *Mario & Wario 1993, Super Nintendo Entertainment System *Wario Land: Super Mario Land 3 1994, Game Boy *Wario's Woods 1994, Nintendo Entertainment System and Super Nintendo Entertainment System *Wario Blast: Featuring Bomberman! 1994, Game Boy *Virtual Boy Wario Land 1995, Virtual Boy *Wario Land II 1998, Game Boy and Game Boy Color *Wario Land 3 2000, Game Boy Color *Wario Land 4 2001, Game Boy Advance *WarioWare, Inc.: Mega Microgame$! 2003, Game Boy Advance *Wario World 2003, Nintendo GameCube *WarioWare, Inc.: Mega Party Game$! 2003, Nintendo GameCube *WarioWare: Twisted! 2004, Game Boy Advance *WarioWare: Touched! 2004, Nintendo DS *WarioWare: Smooth Moves 2006, Wii *Wario: Master of Disguise 2007, Nintendo DS *Wario Land: The Shake Dimension 2008, Wii *WarioWare DIY 2009, Nintendo DS *Game & Wario 2013, Wii U *WarioWare Gold 2018, Nintendo 3DS *WarioWare: Get it Together! 2021, Nintendo Switch *WarioWare: Move It! 2023, Nintendo Switch ===Appearances in the Super Smash Bros. series=== The series' first appearance in the Super Smash Bros. series was in Super Smash Bros. Melee, but it was only as a collectible trophy. In Super Smash Bros. Brawl, Wario is a playable character, and can be in both his biker outfit from WarioWare or his plumber outfit from Wario Land. There is also a level based on WarioWare, collectible trophies and stickers from his series, and music from the WarioWare series. Category:Wario Category:WarioWare",
 "title": "Wario (series)"
}