{
 "id": "124166",
 "text": "The King of Queens was an American television series set in Queens, New York City. The series was shown for nine seasons, from 1998 to 2007. After the last episode was broadcast on May 14, 2007, The King Of Queens became the last American live action sitcom that began in the 1990s to end its run. == Characters == * Doug Heffernan (played by Kevin James): Doug is a driver for the package delivery company, IPS (International Parcel Service), a spin-off of UPS. His actions are often caused by acting like a little kid and his love of food. He often develop bizarre schemes to get what he wants and more than likely lies to his wife, Carrie, in the process. * Carrie Heffernan (played by Leah Remini): Carrie is Doug's wife. She never went to college, but works as a secretary for a law firm and later a real estate agency. Originally born as Simone Spooner, her name was traded for Carrie after her father lost it in a card game. She is known for being bossy and mean towards others, especially Doug. * Arthur Spooner (played by Jerry Stiller): Carrie's widowed father. After losing his home in a fire, Carrie decided to have him live in the Heffernan's basement from then on. * Deacon Palmer (played by Victor Williams): He is Doug's best friend, Deacon is the more responsible of the two. * Spence Olchin (played by Patton Oswalt): Spence is another friend of Doug's. He is often viewed as the nerd of the group and lives with his mother. * Danny Heffernan (played by Gary Valentine): Danny Heffernan is Doug's cousin. He is also seen hanging out with Doug, Spence, and Deacon. * Holly Shumpert (2001–2005, 2007) (played by Nicole Sullivan): Holly is a cheerful, yet insecure dog-walker. She was hired by Doug and Carrie to walk Arthur. * Richie Ianucchi (1998–2001) (played by Larry Romano): Was one of Doug's friends before leaving in the third season to go to another sitcom. == Other websites == * Category:1998 American television series debuts Category:2007 American television series endings Category:1990s American television series Category:2000s American television series Category:American sitcoms Category:CBS network shows Category:Television series set in New York City Category:English-language television programs",
 "title": "The King of Queens"
}