{
 "id": "124228",
 "text": "John Ronald Simm (born 10 July 1970 in Leeds, West Riding of Yorkshire) is an English actor and musician. He grew up mainly in Lancashire. His roles include two BAFTA award-winning BBC Wales dramas: as Sam Tyler in the drama Life on Mars and as the Master in the long-running science fiction series Doctor Who. He has appeared in many popular television dramas such as The Lakes, State of Play and two BAFTA award-winning serials; Clocking Off and Sex Traffic. His movie roles include Human Traffic and 24 Hour Party People. He was nominated for the Olivier and Theatergoer's Choice Award for the best Actor 2008. Besides acting, Simm was a founding member, songwriter and guitarist with the rock band Magic Alex. ==Personal life== Simm married actress Kate Magowan in April 2004 in the Forest of Dean. They have a son and a daughter. Simm is a strong supporter of Manchester United.My United: John Simm Manchester United Official Website 11/02/11 ==Filmography== ===Television=== Year Title Role Notes 1992 Rumpole of the Bailey Joby Jonson Series 7, Episode 4: \"Rumpole and the Reform of Joby Jonson\" 1993 Oasis Posh Robert Episodes 1, 4, 6, 7, 8, 9, and 10 Heartbeat Richard Francis Series 2, Episode 9: \"Wall of Silence\" The Bill Paul Jeffries Season 9, Episode 95: \"Blind Spot\" Men of the World Kendle Bains Series 1 and 2 1994 A Pinch of Snuff Clint Heppelwhite Meat Cecil 1995 Chiller Gary Kingston Series 1, Episode 3: \"Here Comes the Mirror Man\" Cracker Bill Nash Series 3, Episode 2: \"Best Boys\" 1997 The Locksmith Paul 1997–1999 The Lakes Danny Kavanagh Series 1 and 2, 14 episodes 2000 Forgive and Forget Theo Clocking Off Stuart Leach Series 1, Episode 1: \"The Leaches' Story\" Meet Ricky Gervais Himself Episode 6 Never Never John Parlour 2001 Spaced Stephen Edwards Series 2, Episode 1: \"Back\" 2002 Magic Hour Alex Crime & Punishment Raskolnikov White Teeth Mr. Hero Cameo 2003 State of Play Cal McCaffrey 6 episodes Canterbury Tales Ace The Knight's Tale 2004 The All Star Comedy Show Various characters London Friedrich Engels Imperium: Nerone Caligula Sex Traffic Daniel Appleton 2005 Blue/Orange Dr. Bruce Flaherty 2006–2007 Life on Mars Sam Tyler Nominated – BAFTA Award for Best Actor 2007 The Yellow House Vincent Van Gogh 2007 2008 The Devil's Whore Edward Sexby 2009 Skellig Dave 2009 Doctor Who The Master Episode: \"The End of Time, Part One\" 2010 Doctor Who The Master Episode: \"The End of Time, Part Two\" 2010 Moving On Moose / Mike Series 2, Episode 4: \"Malaise\" 2011 Mad Dogs Baxter 4 episodes Exile Tom Ronstadt 3 episodes Nominated – BAFTA Award for Best Actor 2012 Mad Dogs 2 Baxter 4 episodes 201? Mad Dogs 3 Baxter ===Movies=== Year Title Role Notes 1995 Boston Kickout Phil 1999 Human Traffic Jip Wonderland Eddie 2001 Understanding Jane Oz 2002 24 Hour Party People Bernard Miranda Frank 2008 Skellig Dave Tu£sday Silver 201? Seven Days Unknown Being filmed in real-time over a period of five years ===Theatre=== Year Title Role Theatre / Notes 1996 Goldhawk Road Colin Bush Theatre 2007 Elling Elling Bush Theatre Trafalgar Studios 1 2009 Speaking in Tongues Leon\"Speaking in Tongues, Duke of York's Theatre, London\", The Independent Duke of York's Theatre 2010 Hamlet Hamlet, The Independent 23 September 2010. Retrieved on 27 September 2010. Crucible Theatre 2012 Betrayal Jerry Crucible Theatre ==References== Category:1970 births Category:Living people Category:Actors from Lancashire Category:Actors from Yorkshire Category:English movie actors Category:English television actors Category:Musicians from Lancashire Category:Musicians from West Yorkshire Category:People from Leeds",
 "title": "John Simm"
}