{
 "id": "124661",
 "text": "Afghanistan {| border=\"0\" cellpadding=\"2\" cellspacing=\"0\" Afghanistan is in the middle of Asia. The country is landlocked and mountainous, and has most of the Hindu Kush mountains. There are four major rivers in the country: the Amu Darya, the Hari River, the Kabul River and the Helmand River. The country also contains a number of smaller rivers, lakes, and streams. ==Borders== Afghanistan has 5529 km of borders. They are with neighbouring countries: #Pakistan: 2,430 km, known as the Durand Line. This is in the south and southeast of Afghanistan. #Iran, to the west of Afghanistan. The border is 936 km long #Tajikistan has a border of 1,206 km with Afghanistan to the north #Turkmenistan has a border of 744 km #Uzbekistan has a border of 137 km #Afghanistan also has a disputed border with China. It is 76 km in length and is in the far northeast of the country. This is disputed by Pakistan and Tajikistan which both claim the area. The borders are called \"porous\". That means that in many places people can cross over with not much official control. ==Land== Afghanistan has a lot of rugged mountains known as the Hindu Kush as well areas of desert. ; Highest and lowest :* Lowest point: Amu Darya 258 m :* Highest point: Noshaq 7,492 m ; Natural hazards: : Damaging earthquakes occur in the Hindsh mountains; flooding and droughts in the south and south-west of the country. ; Natural resources Afghanistan's natural resources include: natural gas, petroleum, coal, copper, uranium, gold, silver, chromite, talc, barites, sulfur, lead, zinc, iron ore, salt, precious and semiprecious stones.Afghanistan, CIA World Factbook. Gold and copper discovered in AfghanistanUranium Mining Issues: 2005 Review16 detained for smuggling chromites , Pajhwok Afghan News.Afghanistan’s Energy Future and its Potential Implications, Eurasianet.org.Govt plans to lease out Ainak copper mine, Pajhwok Afghan News. ==Mountain systems== The Hindu Kush reaches a height of 7485 m. / 24,557 ft. at Nowshak, Afghanistan's highest peak. Of the ranges extending southwestward from the Hindu Kush, the Koh-i-Baba reaches the greatest height (Shah Fuladi, 5,142 m /16,870 ft). The Safed Koh range, which includes the Tora Bora area, dominates the border area southeast of Kabul. The area towards the Khyber Pass across the Safed Koh are in eastern Afghanistan; at the top the height is 1070 m. / 3,509 ft. at Landi Kotal. This area is near to Pakistan, the town of Torkham is five kilometres from Pakistan. ==References== ==Other websites== *Topographic map of Afghanistan (1 : 300 000) www.cesty.in *Persia (Iran), Afghanistan and Baluchistan is an old map, featuring Afghanistan, from 1897. It's written in English. *Afghanistan, Beloochistan, etc. is another old map, from 1893. It was published by the Methodist church.",
 "title": "Geography of Afghanistan"
}