{
 "id": "124859",
 "text": "Sexual arousal is the feeling humans and animals get when they are ready to have sexual intercourse. Someone who can only get sexually aroused after forming an emotional bond with someone is called a demisexual.McAlister, Jodi. \"‘That complete fusion of spirit as well as body’: Heroines, heroes, desire and compulsory demisexuality in the Harlequin Mills & Boon romance novel.\" Australasian journal of popular culture 3.3 (2014): 299-310. ==Sexual arousal in people== When people become sexually aroused, their bodies change in certain ways. In women: In men: *The breasts will get bigger. *Nipples may stiffen. *The vagina will become slippery so it is easier for the erect penis to go in. *Blood will fill the walls of the vagina. *The clitoris and labia will swell up. *The cervix and uterus will pull backwards. *The vagina will expand upwards. *The labia majora and labia minora will become red and swollen. *The penis will swell up and become stiff (erect) so it points outwards and upwards. This is the clearest sign of sexual arousal in men. *The veins in the penis will stand out. *Pre-ejaculatory fluid will leak from the end of the penis to help lubricate it. *The foreskin will slip back, exposing the glans penis. *The testicles will swell and be pulled upwards. *The scrotum will thicken as the testicles tighten. == Animals == Animal sexuality is not very well understood today, but scientists are sure that animals do get sexually aroused without having sexual intercourse. Dolphins and Bonobos both use sex as a \"social tool to strengthen and maintain bonds.\" \"Like humans and some chimpanzees, dolphins use sex for reasons other than procreation. Sex is as frequent as it is casual, a social tool used to strengthen and maintain bonds.\" ==Related pages== * Aphrodisiac * Human sexuality * Sex * Sexual attraction * Sexual intercourse * Sexual orientation == References == == Other websites == *Sex: The science of sexual arousal Category:Reproductive system Category:Human sexuality",
 "title": "Sexual arousal"
}