{
 "id": "125199",
 "text": "Miep Gies, née Hermine Santrouschitz (born 15 February 1909; died 11 January 2010), was one of the Dutch citizens who hid Anne Frank and her family from the Nazis during World War II. == Hiding Anne Frank == Gies found and kept Anne's diary after the Nazis found Anne and sent her to Bergen-Belsen concentration camp. Gies did not read the diary; she thought that would be rude. Instead, she gave it to Otto Frank, Anne's father, immediately after she found it in the annex where she hid the Franks. Otto Frank put together Anne's writings, and they were first published in 1947. Today, Anne Frank: The Diary of a Young Girl has sold tens of millions of copies. On her website, Gies stated: > I stand at the end of the long, long line of good Dutch people who did what > I did or more – much more – during those dark and terrible times years ago, > but always like yesterday in the hearts of those of us who bear witness. > Never a day goes by that I do not think of what happened then. Gies died in 2010 at the age of 100. == Righteous Among the Nations == On March 8, 1972, Yad Vashem recognized Miep and her husband, Jan Augustus Gies, as Righteous Among the Nations. == Related pages == * The Holocaust * World War II * Anne Frank * Righteous Among the Nations ==References== == Other websites == * Miep Gies's authorised website * * Quicktime movie. Miep Gies, in her former office at 263 Prinsengracht, talks about the war years * Quicktime movie. Miep Gies remembers how she met Anne Frank * Profile of Miep Gies by the Anne Frank House * 1998 interview with Miep Gies * Image of Miep's wartime identity card * Photo of Miep and Jai Gies, Bip Voskuijl, Victor Kuiler taken in 1970s * Holocaust Rescuers Bibliography with information and links to books about Miep Gies and other Dutch rescuers. * Miep Gies at Yad Vashem website Category:1909 births Category:2010 deaths Category:Dutch centenarians Category:Writers from Vienna Category:Recipients of the Decoration for Services to the Republic of Austria Category:Righteous Among the Nations Category:Anne Frank",
 "title": "Miep Gies"
}