{
 "id": "125114",
 "text": "Bangladesh Jamaat-e-Islami is the biggest Islamic political party in Bangladesh. The party started from Jamaat-e-Islami, made by Abul A'la Maududi in 1941. Before, Jamaat-e-Islami Pakistan did not want Bangladesh to be free from Pakistan. When Bangladesh became free in 1971, the new government stopped Jamaat-e-Islami and all religion-based parties. After Sheikh Mujibur Rahman was killed in 1975, the ban was removed. In 1979, Ziaur Rahman’s government allowed Jamaat-e-Islami to do politics again. In the 1980s, Jamaat joined a group of parties to bring back democracy against Hussain Muhammad Ershad. Later, it worked with the Bangladesh Nationalist Party (BNP), and its leaders became ministers in BNP governments (1991-1996 and 2001-2006). Awami League also worked with Jamaat in 1996 to get power. In 2008, Jamaat won two out of 300 seats in Parliament. In 2010, the Awami League government started trials for war crimes from the 1971 war. By 2012, two BNP leaders, one Jatiya Party leader, and eight Jamaat leaders were accused of war crimes. By March 2013, three Jamaat leaders were found guilty. On 1 August 2013, the Supreme Court of Bangladesh said Jamaat-e-Islami cannot join elections. On 1 August 2024, Sheikh Hasina’s government fully banned the party. But on 28 August 2024, after Sheikh Hasina’s government fell, the new government removed the ban. ==History== === Hindustan Period (1941 - 1947) === :See Jamaat-e-Islami Hind === Pakistan Period (1948 - 1971) === : See: Jamaat-e-Islami Pakistan In 1947 East Bengal became part of Pakistan (East Pakistan) - and the Jamaat-e-Islami was divided into separate Indian and Pakistani parties. The Jamaat-e-Islami Bangladesh originates from the East Pakistani party. The Jamaat were against Bangladesh becoming independent from Pakistan as they thought it was against Islam. However the Jamaat were unable to stop Bangladesh becoming independent of Pakistan. === Bangladesh Period (1978 - present) === Bangladesh Jamaat-e- Islami was banned after independence of Bangladesh. Jamaat was banned in Bangladesh due to its opposite stand against independent Bangladesh during independence war. Jamaat wished to see united Pakistan. After independence of Bangladesh, the top leaders of Jamaat moved to West Pakistan where Jamaat-e- Islami was born. Sheikh Mujibur Rahman, the first president of Bangladesh, also cancelled the citizenship of Golam Azam, the leader of Jamaat. Azam then moved to London, and some other leaders moved to the Middle East. However Sheikh Mujibur Rahman was assassinated in 1975 and army chief Ziaur Rahman seized power. Rahman allowed the Jamaat to be a political party again. Rahman also allowed Azam to return to Bangladesh as the leader of Jamaat. ==Election results== Election year Votes % of Percentage Seats +/– 1986 13,14,057 4.60% 1988 Boycotted 1991 4,117,737 12.2% 8 1996 3,653,013 8.6 15 2001 2,385,361 4.28 14 2008 3,186,384 4.6% 15 2014 Party banned in 2013 The Jamaat in parliamentary elections Year Results 1973 Party banned because of opposition to Bangladeshi independence, as it was an Islamist party and so was a threat to Secularism, and also collaboration of some of its members with the Pakistani army. 1979 Party legalized under the name \"Islamic Democratic League\" Together with larger Muslim League won 20 seats. 1986 10 seats. 1991 18 seats. 1996 3 seats. 2001 17 seats. (took part by forming alliance with 3 other parties.) 2008 2 seats. (took part by forming alliance with 3 other parties.) 2013 The Bangladesh Supreme Court declared the registration of the Jamaat-e- Islami illegal, ruling that the party is unfit to contest national polls. ==References== Category:Bangladesh Jamaat-e-Islami",
 "title": "Bangladesh Jamaat-e-Islami"
}