{
 "id": "125638",
 "text": "A variable star is a star that is sometimes brighter or dimmer. Most stars have only very small differences in brightness, like the Sun; but some stars can vary hugely. There are generally two types of variable stars: * A star being eclipsed, where the changes in brightness are from perspective, are called extrinsic variables. For example, in a solar eclipse the moon gets between the sun and Earth. Some binary star systems sometimes show eclipses, as do planetary systems with high-mass planets such as gas giants. * Stars whose brightness actually changes are called intrinsic variables. These stars appear to get bigger and smaller over time. Some pulsate at a constant rate, some do not. All of them change the rate at which energy is put out, which changes their appearance to us. == Intrinsic variable stars == There are a number of different types of variable stars. *Intrinsic variable stars: variation caused by changes in the physical properties of the stars themselves.Cox, John P., Theory of Stellar Pulsation, Princeton, (1980) Three subgroups: **Pulsating variables: stars whose radius expands and contracts as part of their natural evolutionary ageing processes. **Eruptive variables: stars who experience eruptions on their surfaces like flares or mass ejections. **Cataclysmic or explosive variables: stars which undergo a cataclysmic change, such as novae and supernovae. === Pulsating variables === ==== Cepheids and Cepheid-like ==== *Classical Cepheids include: Eta Aquilae, Zeta Geminorum, Beta Doradus, RT Aurigae, Polaris, and the namesake Delta Cephei. The North Star (Polaris) is the closest classical Cepheid, but it has many peculiarities and its distance is not certain. *Type II Cepheids include: W Virginis and BL Herculis. *Dwarf Cepheids include: Delta Scuti, SX Phoenicis. *RR Lyrae variables. Very common, used as absolute candles in globular clusters. RR Lyrae === Long period and semi-regular === * Mira. Typical of a class of stars with pulsation periods longer than 100 days. They are red giant stars in the very late stages of stellar evolution. They will expel their outer envelopes as planetary nebulae and become white dwarfs in a few million years. === Eruptive variables === Eruptive variables are caused by a star throwing something out, or sometimes by something falling in. ==== Protostars ==== Protostars are young objects that have not yet completed the process of contraction from a gas nebula to a true star. Most protostars show irregular brightness variations. ==== Giants and Supergiants ==== Large stars lose their matter relatively easily. Variability due to eruptions and mass loss is fairly common among giants and supergiants. === Cataclysmic or explosive stars === Supernovae are the most dramatic events in the universe. A supernova can briefly emit as much energy as an entire galaxy, brightening by more than 20 magnitudes (over one hundred million times brighter). Supernovae result from the death of an extremely massive star, many times heavier than the Sun. The supernova explosion is caused by a white dwarf or a star core reaching a certain mass/density limit, the Chandrasekhar limit. Then the star collapses in a fraction of a second. This collapse \"bounces\" and causes the star to explode and emit an enormous amount of energy. The outer layers of these stars are blown away at speeds of many thousands of kilometers an hour. The expelled matter may form nebulae called supernova remnants. A well-known example of such a nebula is the Crab Nebula, left over from a supernova that was observed in China and North America in 1054. The core of the star or the white dwarf may either become a neutron star (generally a pulsar) or disintegrate completely in the explosion. A supernova may also result from mass transfer onto a white dwarf from a star companion in a double star system. The infalling matter pushes the white dwarf over the Chandrasekhar limit. The absolute luminosity of this type of supernova can be calculated from its light curve, so these explosions can be used to fix the distance to other galaxies. One of the most studied supernovae is SN 1987A in the Large Magellanic Cloud. == Eclipsing variables == * Algol * β Lyrae * W Ursae Majoris == References == Category:Types of stars",
 "title": "Variable star"
}