{
 "id": "125866",
 "text": "The sand cat (Felis margarita) is a small wild cat in the Felinae subfamily. It is distributed over African and Asian deserts. Sometimes people call it \"desert cat,\" but that is really the name of a different animal. The sand cat does live in deserts, even the Sahara and Arabian Desert. It is also found in Iran and Pakistan. In zoos, this cat can live for up to 13 years. The sand cat is about 50 cm long, not including the tail. The tail is 30 cm long and has rings on it. It weighs about 2.7 kg (6 lbs). It has sand-colored fur and a wide head with ears that can point up, out or down. There is fur on its paws so that the hot sand does not hurt it. This cat finds shade or digs a burrow during the day and hides from the sunlight underground. It only lives in places where the sand or dirt is loose enough for it to dig. The sand cat looks for food at night. It eats rodents, lizards and insects. It can even hunt and kill snakes. It does not drink water, taking all its water from eating prey. It does not need to go near watering holes, so it can avoid bigger predators that might hurt it. Wolves, snakes, large birds and humans can hurt this cat. The sand cat does not fight with other sand cats over territory. Sometimes sand cats will take turns in the same burrow, but they will not share it at the same time. The sand cat lives alone except when looking for mates and when mothers are raising cubs. ==Distribution== The sand cat lives in both sandy and stony deserts. It prefers flat terrain with little grass or small bush. It avoids bare and moving sand dunes, where there is little prey. Sand cats live in the Moroccan Sahara, Algeria, Mali, Ténéré Desert, Egypt, Sinai peninsula, Saudi Arabia, Israel, Jordan, Syria, Iraq, Iran, Pakistan. ==Diet== In the Ténéré Desert, sand cats were seen hunting small rodents, young cape hare. They were also seen hunting greater hoopoe lark, desert monitor, sandfish, and venomous vipers. If they caught more than they could eat, they buried some to eat later. In Israel, pieces of the Egyptian spiny-tailed lizards were found near burrows used by sand cats. They were seen hunting jirds, Cairo spiny mouse, desert lark, and small reptiles. In central Iran, pieces of the Blanford's jerboa and Balochistan gerbil were found around the dens of sand cats. ==References== Category:Felines Category:Mammals of Pakistan Category:Mammals of Asia Category:Mammals of Africa",
 "title": "Sand cat"
}