{
 "id": "125886",
 "text": "The Government of India Act 1935 was the last constitution of British India which split Burma from it. It lasted until 1947, when British territory was split into Pakistan and India. Features of the act: * Detailed document with 321 sections and 10 schedules. * Divided powers between the Centre and units in terms of 3 lists: Federal list (59 items), Provincial list (54 items) and Concurrent list (36 items). * Gave Indian provinces much less independence. * Provision for the establishment of an All India Federation at the center, consisting of Provinces of British India and the Princely states. * For the first time direct elections were introduced. Women were also allowed to vote. * Sindh was separated from Bombay, Orissa was separated from Bihar, and Burma was separated from India. The number of provinces were increased to eleven by giving North West Frontier Province (NWFP) the status of fully-fledged province and creating two new provinces, Orissa and Sindh. * The System of Diarchy was dropped at the provincial level but introduced at the central government level. * Two Houses of Parliament at central government level were introduced with Council of State being the Upper House and Assembly being the Lower House. * Special Responsibilities and Safeguards vested in British Executive power in London * Introduced the Reserve bank of India to look after the cash flow and printing processes == Background == Despite the failure of round table conferences, in March 1933 the British government announced its proposals for how India should be governed. These were published in a 'white paper' (a discussion issued before a Bill is presented to the British parliament). After discussions by the British politicians and consultation with Indian delegates, nominated by the government to take part in the talks, a Bill was introduced before the British parliament in December 1934. In August 1935, the Government of India Act became law. This was the last major legislation that the British government passed before independence was granted. The act was an important point in the move towards formal Independence. It provided the basis for negotiations which resulted in the British leaving India. This act was opposed by both the Muslim League and Congress however both contested in the elections of 1937. Category:1930s in India",
 "title": "Government of India Act 1935"
}