{
 "id": "125846",
 "text": "The Asiatic lion (Panthera leo persica) is a subspecies of the lion. It survives in the wild today only in India, but has also been sighted in a few areas of Pakistan, especially in Pakistani Azad Kashmir.They once ranged from Southeast Europe to India, covering most of Southwest Asia, and hence it is also known as the Persian lion. It was the symbol of the Junagadh State. Under the 10th Nawab of Junagarh (r. 1911-1948), the Junagadh State developed a conservation effort in what is now the Gir National Park. This saved the Asiatic lion from almost certain extinction. Since the turn of the 20th century, the range of the Asiatic lion has included the Gir National Park and the surrounding areas in the Indian state of Gujarat. The population has steadily increased since 2010. In May 2015, the 14th Asiatic Lion Census was conducted over an area of about 20,000 km2 (7,700 sq mi); the lion population was estimated at 523 individuals, comprising 109 adult males, 201 adult females and 213 cubs. In August 2017, surveyors counted 650 wild lions. In June 2020, an estimation exercise counted 674 Asiatic lions in the Gir forest region, an increase of 29% over the 2015 census figure. In 2023, an Asiatic lion was spotted by forest officials in the Barda Wildlife Sanctuary in the state's Porbandar district for the first time since 1879.https://www.hindustantimes.com/india-news/asiatic-lion-spotted-in- gujarat-s-barda-1st-time-in- over-4-decades-101674187810284-amp.htmlhttps://www.outlookindia.com/national/gujarat- lion-spotted-in-barda-sanctuary-for-first-time-since-independence- news-255279/amp The Asiatic lion is smaller than the African lion. Male Asiatic lions are slightly bigger than females. The maximum recorded length of a male Asiatic lion in the Gir National Park is 115 inches (from head to tail). Like African lions, male Asiatic lions also have a mane at the top of their heads but the growth is shorter, making it possible to see the ears. The Asiatic lion’s tail tuft is larger than the African lion’s. A feature common in the species but absent in their African counterparts is the fold of skin on the belly.https://www.worldatlas.com/amp/articles/the-story-of-the-asiatic- lion-surviving-only-in-gujarat-india.html Although lions are social species, male Asiatic lions are generally solitary and may form a loose pride of up to three males. Females are more social and often have a strong pride of up to 12 females and their cubs. The pride of female lions will always share carcasses among themselves. Males and females often only associate for a short time during the mating season. Males have a large home range (56-89 square miles) compared to females (26-33 square miles). == Related pages == * Lion * Leopard * Hyena * Cheetah * Mountain lion == References == == Other websites == * *Asiatic Lion Information Centre (Includes an informative \"News\" section) *Asiatic Lion Protection Society (ALPS), Gujarat, India *Panthera leo (lion) from “Animal Diversity Web” * \"Vanishing Herds Foundation (VHF), India\" comes to the rescue of Asiatic Lion *Asiatic lions in online video (3 videos) Category:Lions Category:Mammals of Pakistan Category:National symbols of Iran",
 "title": "Asiatic lion"
}