{
 "id": "125912",
 "text": "John Wycliffe (lived from about 1320 to 1384 in England)Surname is also spelled Wyclif, Wycliff, Wiclef, Wycliffe, Wicliffe, or Wickliffe. was an English theologian. He was one of the first to translate the Christian Bible into English, the common language. His version is generally known as \"Wyclif's Bible\".Partridge A.C. 1973. English biblical translations. London: Andre Deutsch, The English Bible to Wyclif, 1932. A mission agency bearing his name, Wycliffe Bible Translators, still translates the scriptures into languages used around the world. Wycliffe wrote that papal claims of temporal power had no foundation in the scriptures and that the Bible alone should be the standard of Christian belief and practice. His family lived in a lower social class and did not live in great wealth but was not poor either. Later, after Wycliffe had grown up, he attended Oxford University, where he earned an arts degree. He became Master of Balliol College, Oxford, in 1361.The Master of Balliol is head of the College. He was also given a parish in Lincolnshire, which meant he had to give up the position of Master of Balliol. He lived at Oxford for a large portion of his life and worked as a rector, a member of the clergy, at local churches. Many other changes came to his life. Some of his ideas disagreed with the Church's, but he had the support and protection of John of Gaunt, who then ruled England.Richard II was a minor. Wycliffe encouraged the Church to benefit the sinners of the world by living a life of poverty, but not everyone agreed with his thoughts and ideas. In some of his later writings, he wrote that the Bible was the authority of the Christian religion, and it was not of the Church. In 1382, his followers, known as the Lollards, helped him translate the Bible. Early Protestants called him the first great reformer.Stockdale, Nancy. John Wycliffe. World History: Ancient and Medieval Eras. ABC-CLIO, 2013. Web. 27 Feb. 2013.John Wycliffe. Historic World Leaders. Gale, 1994. Biography In Context. Web. 27 Feb. 2013.Williams, Peter W. Wycliffe, John. World Book Advanced. World Book, 2013. Web. 27 Feb. 2013. == Related pages == *William Tyndale *Sola scriptura ==References== ==Other websites== *Wycliffe Bible Translators Category:1320s births Category:1384 deaths Category:Academics of the University of Oxford Category:Alumni of the University of Oxford Category:Bible translators Category:English philosophers Category:English Roman Catholic priests Category:English theologians Category:People excommunicated by the Catholic Church Category:People from North Yorkshire",
 "title": "John Wycliffe"
}