{
 "id": "126003",
 "text": "Colin Matthew Delaney (born September 7, 1986) is an American professional wrestler. He is best known for his time with WWE on its ECW brand. He has also wrestled for All Elite Wrestling (AEW) and for many independent promotions. These include Squared Circle Wrestling, Chikara, NWA Upstate, Combat Zone Wrestling and the International Wrestling Cartel. He has wrestled using the ring names Colin Olsen and the \"Extremely Cute Wrestler\" Colin Delaney. == Career == Delaney made his World Wrestling Entertainment debut as a jobber, seen wrestling on the ECW show. On August 15, Delaney was released by WWE. == Personal life == Colin has an older brother Ed who competes as \"Hangin' Tough\" Freddie Midnight, and younger brother Brian who competed as Mr. Bodacious. == Championships and accomplishments == * Absolute Intense Wrestling ** AIW Absolute Championship (1 time) ** AIW Tag Team Championship (6 times) – with Jimmy Olsen (1) and Cheech (5) * International Wrestling Cartel ** IWC Tag Team Championship (1 time) – with Keith Haught * NWA Empire ** NWA Empire Heavyweight Championship (1 time) ** NWA Empire Tag Team Championship (1 time) – with Mean Marcos ** NWA Empire Lord of the Dance Championship (1 time) ** NWA Southern Junior Heavyweight Championship (1 time) * NWA Upstate ** NWA Upstate Tag Team Championship (1 time) – with Jimmy Olsen * Pier 6 Wrestling ** P6W Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** PWI ranked #262 of the top 500 singles wrestlers in the PWI 500 in 2015 * Roc City Wrestling ** RCW Tag Team Championship (1 time) – with Jimmy Olsen * Squared Circle Wrestling ** 2CW Tag Team Championship (1 time) – with Jimmy Olsen * Southern Tier Wrestling ** STW Tag Team Championship (1 time) - with Cheech * Upstate Pro Wrestling ** UPW No Limits Championship (1 time) ** UPW Tag Team Championship (1 time) - with Cheech ** Upstate 8 Tournament (2018) - with Cheech * Xcite Wrestling ** Xcite Tag Team Championship (1 time) - with Cheech == References == == Other websites == * Official MySpace * Online World of Wrestling profile Category:1986 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Rochester, New York",
 "title": "Colin Delaney"
}