{
 "id": "126051",
 "text": "Songs About Jane is the first album by American pop rock group Maroon 5. It was released on June 25, 2002, under J Records in the United States. The album was re-released on October 14, 2003, under Octone Records. It was produced by Matthew Wallace. The album spawned the singles \"Harder to Breathe\", \"This Love\", and \"She Will Be Loved.\" The album peaked at number-six on the Billboard 200 albums chart selling a round-up of 3 million album sales. By the time 2004 concluded, the album was titled multi-platinum in sales in several different countries. ==10th year anniversary== On May 22, 2012, the band announced on their website that they would be celebrating the ten year anniversary of the album on by releasing a limited edition re-issue. The re- issue was released on June 5, 2012. 2 Disc CD Re-issue of 'Songs About Jane', featuring Original Demos, Unreleased Material and videos and a limited edition Lithograph incorporating original art inspired by each song and 'Songs About Jane' Album art. ==Track listing== All songs written by Jesse Carmichael and Adam Levine, except where noted. # \"Harder to Breathe\" – 2:53 # \"This Love\" – 3:26 # \"Shiver\" – 2:59 # \"She Will Be Loved\" (Levine, James Valentine) – 4:17 # \"Tangled\" (Levine) – 3:18 # \"The Sun\" (Levine) – 4:11 # \"Must Get Out\" – 3:59 # \"Sunday Morning\" – 4:06 # \"Secret\" – 4:55 # \"Through with You\" – 3:01 # \"Not Coming Home\" (Carmichael, Ryan Dusick, Levine) – 4:21 # \"Sweetest Goodbye\" (Levine) – 4:30 * _Bonus tracks_ Bonus tracks on the import release of Songs About Jane, manufactured for and distributed by BMG New Zealand Limited in 2004. # \"Rag Doll\" - 5:29 # \"Harder to Breathe (Acoustic)\" - 2:56 # \"This Love (Acoustic)\" - 4:01 # \"This Love (Kanye West Remix)\" - 3:38 == Music Videos == 2002-2003 2004-2005 2006 Harder to Breathe She Will Be Loved Must Get Out This Love Sunday Morning Category:2002 albums Category:Maroon 5 albums Category:Debut albums Category:Pop rock albums",
 "title": "Songs About Jane"
}