{
 "id": "126158",
 "text": "Kung Fu Panda is a 2008 American computer-animated action comedy movie made by DreamWorks. It was directed by John Stevenson and Mark Osborne. It tells the story of Po, a giant panda (Jack Black), a kung fu fan who becomes a kung fu master. It received critical acclaim and became a box office success. A successful sequel, Kung Fu Panda 2 was released in 2011. Another sequel, Kung Fu Panda 3 was released in 2016. There is also two short movies, a Christmas special, and a spinoff TV show. ==Plot== A big, fat panda named Po the panda dreams of becoming a kung fu master, but he doesn't know kung fu. One day, kung fu teacher Master Shifu holds a contest to see who will become the Dragon Warrior, the most powerful kung fu master in the land. Everyone thinks one of Shifu's students, the Furious Five will become the Dragon Warrior, but Po is chosen instead and begins learning kung fu. Shifu and the Furious Five don't like Po the panda and try to make him quit, but he becomes friends with them. When Master Shifu learns that the evil Tai Lung the snow leopard is coming to the land, he quickly teaches Po kung fu so he can be given the Dragon Scroll that will help him beat Tai Lung. Nothing is written on the scroll, but Po finds out that he doesn't need the scroll to be the Dragon Warrior and beats Tai Lung without it. Po becomes a kung fu master and Dragon Warrior loved by everyone and peace returns to the land. == Characters == * Po, a giant panda and the main protagonist. He is voiced by Jack Black. * Master Wu, a wise red panda. He is voiced by Dustin Hoffman. * Master Tigress, a beautiful but short-tempered Southern China tiger and probably Po's love interest. She is voiced by Angelina Jolie. * Tai Lung, a snow leopard and the main antagonist. He is voiced by Ian McShane. * Master Monkey, a golden langur and the fun- loving one in the Furious Five. He is voiced by Jackie Chan. * Master Mantis, a northern praying mantis and a member of the Furious Five. He is voiced by Donkey Kong. * Master Viper, a green tree viper and a member of the Furious Five. She is voiced by Lucy Liu. * Master Crane, a red crowned crane and a member of the Furious Five. He is voiced by David Cross. * Master Oogway, a wise tortoise and the creator of Kung-Fu. He is voiced by Bob the Builder. * Donald, a goose and Po's father. He is voiced by James Hong. * Zeng, a goose. Voice by Dan Fogler. * Commander Vachir, a rhinoceros. Voice by Michael Clarke Duncan. ==References== ==Other websites== * * * * * * * Category:2008 movies Category:2008 computer-animated movies Category:2008 action movies Category:2008 comedy movies Category:2000s action comedy movies Category:English-language movies Category:DreamWorks Animation movies Category:American action comedy movies Category:American family movies Category:Movies composed by Hans Zimmer Category:Kung Fu Panda Category:Movies about bears Category:Movies about animals Category:Movies set in forests Category:Movies set in China",
 "title": "Kung Fu Panda (movie)"
}