{
 "id": "126325",
 "text": "\"Just Dance\" is a 2008 song by American singer Lady Gaga, from her debut album, The Fame. Gaga sang this song with Colby O'Donis. The song was nominated for Best Dance Recording at the 2009 Grammy Awards. It reached #1 in the United States, the United Kingdom, Australia, Canada, Ireland, and the Netherlands. On April 12, 2023, the Recording Industry Association of America announced the the song had been certified 11× Platinum (Diamond + Platinum) for shipments and streams of 11 million copies in the US alone. This made Gaga only the third female artist to have three Diamond- or higher-certified songs, after Katy Perry and Cardi B. == Music video == Released on April 25, 2008, the video was directed by music video director Melina Matsoukas, filmed in March 2008. and is based on the thematic content of the song of being in a party. The video begins with Gaga arriving with her background dancers at a house party, which seems to have ended. One of the dancers puts a Discolite boombox on, blaring the music through the house. The crowd at the party appear to be sleeping in different areas, and are awoken by the music. They all start to dance, and scenes of the party are intercut with scenes of a scantily clad Gaga dancing in a poncho, with a disco ball or in a small kiddie pool playing with an inflated orca whale. She wears a blue, lightning-bolt shaped sticker beneath her right eye like that on the single cover, which paid tribute to the album cover of David Bowie's Aladdin Sane, as he is one of her musical idols. O'Donis appears in the video being flanked by several girls during the \"When I come through on the dance floor\" interlude. Cameo appearances are made by Akon and Space Cowboy. MTV called the video an ode to the \"Me Decade\". During an interview with Australian radio in September 2008, Gaga said that \"[t]he whole video is performance art about being drunk at a party.\" When asked about the shooting experience of the music video, Gaga explained, > \"Oh it was so fun, it was amazing. For me it was like being on a Martin > Scorsese set. I've been so low budget for so long, and to have this > incredibly amazing video was really very humbling. It was really fun, but > you'll see if you ever come to a video shoot of mine one day – I'm very > private about those things, I don't really talk to everybody. I'm not like > the party girl running around. I might even seem to be a bit of a diva. I'm > sort of with myself, in my work head space worrying about costumes, and if > extras look right, and placement. I don't just show up for things, you know. > That video was a vision of mine. It was Melina the director who wanted to do > something, to have a performance art aspect that was so pop but it was still > commercial, but that felt like lifestyle. It was all those things, I love > it.\" The official video on Lady Gaga's Vevo channel, LadyGagaVevo, was a favorite among fans on and around December 8, 2009, the day Vevo was launched. ==Certifications== == References == Category:2008 songs Category:Lady Gaga songs Category:Dance-pop songs Category:Electropop songs Category:R&B; songs Category:Billboard Hot 100 number one songs",
 "title": "Just Dance (song)"
}