{
 "id": "126307",
 "text": "Makran () is a partly-desert coastal strip in the south of Balochistan, in Iran and Pakistan. It is along the coast of the Arabian Sea and the Gulf of Oman. The Persian phrase Mahi khoran, fish-eaters (Mahi = fish + khor = eat) is believed to be the origin of the modern word Makran. The narrow coastal plain rises very rapidly into several mountain ranges. The coastline is 1,000 km, 750 km of this is in Pakistan. The climate is very dry with very little rainfall. ==History== According to the book Documents on the Persian Gulf's name \" and ENCYCLOPEDIA Iranika Makran also Mekran and Mokrān historically in persian and Arabic text was a vast area from Hormuz strait to the Sind River, also the body of water in that region was called Macran Sea. The name Makrān has found a popular etymology in māhi-ḵᵛorān “fish eaters,” but more probable is a connection with the name Magan, or Maka of the Old Persian. Until the early Islamic period, Makrān must have been within the sphere of Elamo- Dravidian or Brahui culture and language. On his way homewards from the Far East in 1290, Marco Polo (II, pp. 334-35) sailed along the Makrān coast, calling it KisMacoran (i.e. Tiz Makrān), considering it as independent and attributing to it a ruler of its own. In the early 14th century, Ebn Baṭṭuṭa (II, pp. 341-2) records that, after the death of the Il-Khanid sultan (i.e. after 736/1335), a certain Malek Dinār took power in Makrān. It was during these centuries that Makrān was colonized by Baluch nomads moving southeastwards from Persia, so that it is today mostly Baluch-speaking. The boundary between Persian Makrān and that part coming within the British Indian province of Baluchistan (the easternmost part forming the Native State of Las Bela) and after 1947 within Pakistan, was demarcated by an Anglo-Persian Boundary Commission in 1870-72. == Notes == Category:Landforms of Pakistan Category:Sistan and Baluchestan Province Category:Landforms of Iran",
 "title": "Makran"
}