{
 "id": "126421",
 "text": "The 1978–79 NHL season was the 62nd season of the National Hockey League. The 17 teams of the league played an 80-game season. The Montreal Canadiens beat the New York Rangers in the Stanley Cup finals four games to one for their fourth Cup in a row. ==Regular season== ===Final standings=== GP = Games Played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals For, GA = Goals Against, PIM = Penalties In Minutes Teams that qualified for the playoffs are highlighted in bold ====Prince of Wales Conference==== Adams Division GP W L T Pts GF GA PIM Boston Bruins 80 43 23 14 100 316 270 1222 Buffalo Sabres 80 36 28 16 88 280 263 1026 Toronto Maple Leafs 80 34 33 13 81 267 252 1440 Minnesota North Stars 80 28 40 12 68 257 289 1102 Norris Division GP W L T Pts GF GA PIM Montreal Canadiens 80 52 17 11 115 337 204 803 Pittsburgh Penguins 80 36 31 13 85 281 279 1039 Los Angeles Kings 80 34 34 12 80 292 286 1134 Washington Capitals 80 24 41 15 63 273 338 1312 Detroit Red Wings 80 23 41 16 62 252 295 1359 ====Clarence Campbell Conference==== Patrick Division GP W L T Pts GF GA PIM New York Islanders 80 51 15 14 116 358 214 1077 Philadelphia Flyers 80 40 25 15 95 281 248 1548 New York Rangers 80 40 29 11 91 316 292 1214 Atlanta Flames 80 41 31 8 90 327 280 1158 Smythe Division GP W L T Pts GF GA PIM Chicago Black Hawks 80 29 36 15 73 244 277 1254 Vancouver Canucks 80 25 42 13 63 217 291 1134 St. Louis Blues 80 18 50 12 48 249 348 1055 Colorado Rockies 80 15 53 12 42 210 331 838 ===Scoring leaders=== GP = Games Played, G = Goals, A = Assists, Pts = Points, PIM = Penalties In Minutes Player Team GP G A Pts PIM Bryan Trottier New York Islanders 76 47 87 134 50 Marcel Dionne Los Angeles Kings 80 59 71 130 30 Guy Lafleur Montreal Canadiens 80 52 77 129 28 Mike Bossy New York Islanders 80 69 57 126 25 Bob MacMillan Atlanta Flames 79 37 71 108 14 Guy Chouinard Atlanta Flames 80 50 57 107 14 Denis Potvin New York Islanders 73 31 70 101 58 Bernie Federko St. Louis Blues 74 31 64 95 14 Dave Taylor Los Angeles Kings 78 43 48 91 124 Clark Gillies New York Islanders 75 35 56 91 68 ==Stanley Cup playoffs== All dates in 1979 ===Playoff bracket=== ===Preliminary round=== Vancouver Canucks vs. Philadelphia Flyers Date Away Score Home Score Notes April 10 Vancouver 3 Philadelphia 2 April 12 Philadelphia 6 Vancouver 4 April 14 Vancouver 2 Philadelphia 7 Philadelphia wins best-of-three series 2 games to 1 Los Angeles Kings vs. New York Rangers Date Away Score Home Score Notes April 10 Los Angeles 1 New York 7 April 12 New York 2 Los Angeles 1 (OT) NY Rangers win best-of-three series 2 games to 0 Toronto Maple Leafs vs. Atlanta Flames Date Away Score Home Score Notes April 10 Toronto 2 Atlanta 1 April 12 Atlanta 4 Toronto 7 Toronto wins best-of-three series 2 games to 0 Pittsburgh Penguins vs. Buffalo Sabres Date Away Score Home Score Notes April 10 Pittsburgh 4 Buffalo 3 April 12 Buffalo 3 Pittsburgh 1 April 14 Pittsburgh 4 Buffalo 3 (OT) Pittsburgh wins best-of-three series 2 games to 1 ===Quarterfinals=== Chicago Black Hawks vs. New York Islanders Date Away Score Home Score Notes April 16 Chicago 2 New York 6 April 18 Chicago 0 New York 1 (OT) April 20 New York 4 Chicago 0 April 22 New York 3 Chicago 1 NY Islanders win best-of-seven series 4 games to 0 Toronto Maple Leafs vs. Montreal Canadiens Date Away Score Home Score Notes April 16 Toronto 2 Montreal 5 April 18 Toronto 1 Montreal 5 April 21 Montreal 4 Toronto 3 April 22 Montreal 5 Toronto 4 (OT) Montreal wins best-of-seven series 4 games to 0 Pittsburgh Penguins vs. Boston Bruins Date Away Score Home Score Notes April 16 Pittsburgh 2 Boston 6 April 18 Pittsburgh 3 Boston 4 April 21 Boston 2 Pittsburgh 1 April 22 Boston 4 Pittsburgh 1 Boston wins best-of-seven series 4 games to 0 New York Rangers vs. Philadelphia Flyers Date Away Score Home Score Notes April 16 New York 2 Philadelphia 3 (OT) April 18 New York 7 Philadelphia 1 April 20 Philadelphia 1 New York 5 April 22 Philadelphia 0 New York 6 April 24 New York 8 Philadelphia 3 NY Rangers win best-of-seven series 4 games to 1 ===Semi-finals=== New York Rangers vs. New York Islanders Date Away Score Home Score Notes April 26 Rangers 4 Islanders 1 April 28 Rangers 3 Islanders 4 (OT) May 1 Islanders 1 Rangers 3 May 3 Islanders 3 Rangers 2 (OT) May 5 Rangers 4 Islanders 3 May 8 Islanders 1 Rangers 2 NY Rangers win best-of-seven series 4 games to 2 Boston Bruins vs. Montreal Canadiens Date Away Score Home Score Notes April 26 Boston 2 Montreal 4 April 28 Boston 2 Montreal 5 May 1 Montreal 1 Boston 2 May 3 Montreal 3 Boston 4 (OT) May 5 Boston 1 Montreal 5 May 8 Montreal 2 Boston 5 May 10 Boston 4 Montreal 5 (OT) Montreal wins best-of- seven series 4 games to 3 ===Finals=== New York Rangers vs. Montreal Canadiens As of 2008, it is the last time two Pre-war clubs met in the Finals. Date Away Score Home Score Notes May 13 New York 4 Montreal 1 May 15 New York 2 Montreal 6 May 17 Montreal 4 New York 1 May 19 Montreal 4 New York 3 (OT) May 21 New York 1 Montreal 4 Montreal wins best-of-seven series 4 games to 1 ==NHL awards== Prince of Wales Trophy: Montreal Canadiens Clarence S. Campbell Bowl: New York Islanders Art Ross Memorial Trophy: Bryan Trottier, New York Islanders Bill Masterton Memorial Trophy: Serge Savard, Montreal Canadiens Calder Memorial Trophy: Bobby Smith, Minnesota North Stars Conn Smythe Trophy: Bob Gainey, Montreal Canadiens Frank J. Selke Trophy: Bob Gainey, Montreal Canadiens Hart Memorial Trophy: Bryan Trottier, New York Islanders Jack Adams Award: Al Arbour, New York Islanders James Norris Memorial Trophy: Denis Potvin, New York Islanders Lady Byng Memorial Trophy: Bob MacMillan, Atlanta Flames Lester B. Pearson Award: Marcel Dionne, Los Angeles Kings NHL Plus/Minus Award: Bryan Trottier, New York Islanders Vezina Trophy: Ken Dryden & Michel Larocque, Montreal Canadiens Lester Patrick Trophy: Bobby Orr ===All- Star teams=== First Team Position Second Team Ken Dryden, Montreal Canadiens G Glenn Resch, New York Islanders Denis Potvin, New York Islanders D Borje Salming, Toronto Maple Leafs Larry Robinson, Montreal Canadiens D Serge Savard, Montreal Canadiens Bryan Trottier, New York Islanders C Marcel Dionne, Los Angeles Kings Guy Lafleur, Montreal Canadiens RW Mike Bossy, New York Islanders Clark Gillies, New York Islanders LW Bill Barber, Philadelphia Flyers ==References== *Hockey Database *NHL.com Category:1979 in North America Category:National Hockey League seasons",
 "title": "1978–79 NHL season"
}