{
 "id": "126437",
 "text": "The 1972–73 NHL season was the 56th season of the National Hockey League. Sixteen teams each played 78 games. For the first time since the collapse of the Western Hockey League in 1926, the National Hockey League had serious competition. A new professional hockey league, the World Hockey Association, made its season debut with 12 new teams, many of which were based in the same cities as NHL teams. Unlike the Western Hockey League, though, the new World Hockey Association would not challenge for the Stanley Cup. In response to the new league, the NHL hastily added two new teams in an unplanned expansion, the New York Islanders and Atlanta Flames, in an attempt to exclude the WHA from newly constructed arenas in those markets. The first thing the WHA did was sign Bobby Hull, and the Chicago Black Hawks sued, claiming a violation of the reserve clause in NHL contracts. Others soon followed Hull to the WHA, including Bernie Parent, J.C. Tremblay, Ted Green, Gerry Cheevers and Johnny McKenzie. In the expansion draft, the New York Islanders and Atlanta Flames made their picks and eleven Islander players skipped off to the WHA. The California Golden Seals, chafing under the unorthodox ownership of the unpopular Charlie Finley, were also a victim of the WHA, losing eight key players. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes Note: Teams that qualified for the playoffs are highlighted in bold East Division GP W L T Pts GF GA PIM Montreal Canadiens 78 52 10 16 120 329 184 783 Boston Bruins 78 51 22 5 107 330 235 1097 New York Rangers 78 47 23 8 102 297 208 765 Buffalo Sabres 78 37 27 14 88 257 219 940 Detroit Red Wings 78 37 29 12 86 265 243 893 Toronto Maple Leafs 78 27 41 10 64 247 279 716 Vancouver Canucks 78 22 47 9 53 233 339 943 New York Islanders 78 12 60 6 30 170 347 881 West Division GP W L T Pts GF GA PIM Chicago Black Hawks 78 42 27 9 93 284 225 864 Philadelphia Flyers 78 37 30 11 85 296 256 1756 Minnesota North Stars 78 37 30 11 85 254 230 881 St. Louis Blues 78 32 34 12 76 233 251 1195 Pittsburgh Penguins 78 32 37 9 73 257 265 866 Los Angeles Kings 78 31 36 11 73 232 245 888 Atlanta Flames 78 25 38 15 65 191 239 852 California Golden Seals 78 16 46 16 48 213 323 840 ===Scoring leaders=== Player Team GP G A Pts PIM Phil Esposito Boston Bruins 78 55 75 130 87 Bobby Clarke Philadelphia Flyers 78 37 67 104 80 Bobby Orr Boston Bruins 63 29 72 101 99 Rick MacLeish Philadelphia Flyers 78 50 50 100 69 Jacques Lemaire Montreal Canadiens 77 44 51 95 16 Jean Ratelle New York Rangers 78 41 53 94 12 Mickey Redmond Detroit Red Wings 76 52 41 93 24 John Bucyk Boston Bruins 78 40 53 93 12 Frank Mahovlich Montreal Canadiens 78 38 55 93 51 Jim Pappin Chicago Black Hawks 76 41 51 92 82 ==Stanley Cup playoffs== ===Playoff bracket=== ==NHL awards== Prince of Wales Trophy: Montreal Canadiens Clarence S. Campbell Bowl: Chicago Black Hawks Art Ross Memorial Trophy: Phil Esposito, Boston Bruins Bill Masterton Memorial Trophy: Lowell MacDonald, Pittsburgh Penguins Calder Memorial Trophy: Steve Vickers, New York Rangers Conn Smythe Trophy: Yvan Cournoyer, Montreal Canadiens Hart Memorial Trophy: Bobby Clarke, Philadelphia Flyers James Norris Memorial Trophy: Bobby Orr, Boston Bruins Lady Byng Memorial Trophy: Gilbert Perreault, Buffalo Sabres Lester B. Pearson Award: Phil Esposito, Boston Bruins NHL Plus/Minus Award: Jacques Laperriere, Montreal Canadiens Vezina Trophy: Ken Dryden, Montreal Canadiens Lester Patrick Trophy: Walter L. Bush, Jr. ===All-Star teams=== First Team Position Second Team Ken Dryden, Montreal Canadiens G Tony Esposito, Chicago Black Hawks Bobby Orr, Boston Bruins D Brad Park, New York Rangers Guy Lapointe, Montreal Canadiens D Bill White, Chicago Black Hawks Phil Esposito, Boston Bruins C Bobby Clarke, Philadelphia Flyers Mickey Redmond, Detroit Red Wings RW Yvan Cournoyer, Montreal Canadiens Frank Mahovlich, Montreal Canadiens LW Dennis Hull, Chicago Black Hawks ==References== *Hockey Database *NHL.com Category:1972 in North America Category:1973 in North America Category:National Hockey League seasons",
 "title": "1972–73 NHL season"
}