{
 "id": "126406",
 "text": "The 1979–80 NHL season was the 63rd season of the National Hockey League. Twenty-one teams each played 80 games. This season saw the addition of four teams from the collapse of the World Hockey Association (WHA) the previous season as expansion teams. The Edmonton Oilers, Winnipeg Jets, New England Whalers (later renamed \"Hartford Whalers\" at the insistence of the Boston Bruins), and Quebec Nordiques joined the NHL bringing a new total of 21 teams. The other two WHA teams (Birmingham Bulls and Cincinnati Stingers) were paid to disband. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes Note: Teams that qualified for the playoffs are highlighted in bold ====Prince of Wales Conference==== Adams Division GP W L T Pts GF GA PIM Buffalo Sabres 80 47 17 16 110 318 201 967 Boston Bruins 80 46 21 13 105 310 234 1460 Minnesota North Stars 80 36 28 16 88 311 253 1064 Toronto Maple Leafs 80 35 40 5 75 304 327 1158 Quebec Nordiques 80 25 44 11 61 248 313 1062 Norris Division GP W L T Pts GF GA PIM Montreal Canadiens 80 47 20 13 107 328 240 874 Los Angeles Kings 80 30 36 14 74 290 313 1124 Pittsburgh Penguins 80 30 37 13 73 251 303 1038 Hartford Whalers 80 27 34 19 73 303 312 875 Detroit Red Wings 80 26 43 11 63 268 306 1114 ====Clarence Campbell Conference==== Patrick Division GP W L T Pts GF GA PIM Philadelphia Flyers 80 48 12 20 116 327 254 1844 New York Islanders 80 39 28 13 91 281 247 1298 New York Rangers 80 38 32 10 86 308 284 1342 Atlanta Flames 80 35 32 13 83 282 269 1048 Washington Capitals 80 27 40 13 67 261 293 1198 Smythe Division GP W L T Pts GF GA PIM Chicago Black Hawks 80 34 27 19 87 241 250 1325 St. Louis Blues 80 34 34 12 80 266 278 1037 Vancouver Canucks 80 27 37 16 70 256 281 1808 Edmonton Oilers 80 28 39 13 69 301 322 1528 Winnipeg Jets 80 20 49 11 51 214 314 1251 Colorado Rockies 80 19 48 13 51 234 308 1020 ===Scoring leaders=== Note: GP = Games played; G = Goals; A = Assists; Pts = Points Player Team GP G A Pts PIM Marcel Dionne Los Angeles Kings 80 53 84 137 32 Wayne Gretzky Edmonton Oilers 79 51 86 137 21 Guy Lafleur Montreal Canadiens 74 50 75 125 12 Gilbert Perreault Buffalo Sabres 80 40 66 106 57 Mike Rogers Hartford Whalers 80 44 61 105 10 Bryan Trottier New York Islanders 78 42 62 104 68 Charlie Simmer Los Angeles Kings 64 56 45 101 65 Blaine Stoughton Hartford Whalers 80 56 44 100 16 Darryl Sittler Toronto Maple Leafs 73 40 57 97 62 Blair MacDonald Edmonton Oilers 80 46 48 96 24 ==Stanley Cup playoffs== ===Playoff bracket=== ==NHL awards== Prince of Wales Trophy: Buffalo Sabres Clarence S. Campbell Bowl: Philadelphia Flyers Art Ross Memorial Trophy: Marcel Dionne, Los Angeles Kings Bill Masterton Memorial Trophy: Al MacAdam, Minnesota North Stars Calder Memorial Trophy: Ray Bourque, Boston Bruins Conn Smythe Trophy: Bryan Trottier, New York Islanders Frank J. Selke Trophy: Bob Gainey, Montreal Canadiens Hart Memorial Trophy: Wayne Gretzky, Edmonton Oilers Jack Adams Award: Pat Quinn, Philadelphia Flyers James Norris Memorial Trophy: Larry Robinson, Montreal Canadiens Lady Byng Memorial Trophy: Wayne Gretzky, Edmonton Oilers Lester B. Pearson Award: Marcel Dionne, Los Angeles Kings NHL Plus/Minus Award: Jim Schoenfeld, Buffalo Sabres & Jimmy Watson, Philadelphia Flyers Vezina Trophy: Don Edwards & Bob Sauve, Buffalo Sabres Lester Patrick Trophy: Bobby Clarke, Edward M. Snider, Frederick A. Shero ===All-Star teams=== First Team Position Second Team Tony Esposito, Chicago Black Hawks G Don Edwards, Buffalo Sabres Larry Robinson, Montreal Canadiens D Borje Salming, Toronto Maple Leafs Ray Bourque, Boston Bruins D Jim Schoenfeld, Buffalo Sabres Marcel Dionne, Los Angeles Kings C Wayne Gretzky, Edmonton Oilers Guy Lafleur, Montreal Canadiens RW Danny Gare, Buffalo Sabres Charlie Simmer, Los Angeles Kings LW Steve Shutt, Montreal Canadiens ==References== *Hockey Database *NHL.com Category:1979 in North America Category:1980s in North America Category:National Hockey League seasons",
 "title": "1979–80 NHL season"
}