{
 "id": "126507",
 "text": "Mutiny is a when a group of people get together to openly oppose, change, or remove the people or person in authority. It usually means a group of soldiers trying to remove their officers, or a group of sailors on a ship trying to remove the captain. The group of people that mutiny are called mutineers. During the Age of Discovery, mutiny meant open rebellion against a ship’s captain. This happened during Magellan’s journey and one mutineer was killed. Another mutineer was executed and 2 others were put on land and left there. After a mutiny on Henry Hudson’s Discovery, Hudson and several others were left in the ocean in a small boat. ==Penalty== Mutiny is still treated as a very bad crime. Mutineers are punished and may even get the death penalty. ==Famous Mutinies== ===17th century=== * Batavia was a ship of the Dutch East India Company (VOC), built in 1628 in Amsterdam, which was wrecked on its first trip. The sailors led a mutiny and killed many of the passengers. * Corkbush Field mutiny occurred on 1647, the Bishopsgate mutiny and Banbury mutiny of 1649 happened during the early part of the Second English Civil War. ===18th century=== * HMS Hermione was a 32-gun frigate (type of ship) of the British Royal Navy, built in 1782. It is famous for the mutiny which took place on the ship. The captain and 8 officers were killed by the crew. * The Mutiny on the Bounty, a British Royal Navy ship in 1789 has been made famous by several books and films. * Spithead and Nore mutinies were two big mutinies by sailors of the British Royal Navy in 1797. They wanted more pay and better living conditions. ===19th century=== * The Indian rebellion of 1857 was an armed uprising in India against British colonial power, and known in Britain as the Indian Mutiny. * The ship Sharon, a New England whaler, had many sailors leave the ship. There were many mutinies. The captain was finally killed and cut up into small pieces by 4 members of the crew. * The ship Somers built in 1842, had a mutiny on her first voyage. The 3 mutineers were executed. ===20th century=== * On the Russian battleship Potemkin, there was a rebellion by the crew against their officers in June 1905. This was part of the Russian Revolution of 1905. It was made famous by the film The Battleship Potemkin. * Curragh Incident of July 20, 1914 happened in the Curragh, Ireland, where British soldiers protested against the Home Rule Act 1914. * French Army mutinies in 1917. The failure of the Nivelle Offensive in April and May 1917 resulted in a big mutiny by many parts of the French Army. About 50 soldiers were executed and more than 500 were sent to prison. * Wilhelmshaven mutiny started in the German High Seas Fleet on 29 October 1918. The mutiny was one of the things that led to the end of the First World War, to the end of the Monarchy and to the start of the Weimar Republic. * Black Sea mutiny (1919) by sailors on the French dreadnoughts (big battleships) - Jean Bart and France. The ships had been sent to help the White Russians in the Russian Civil War. The leaders of the mutiny (including André Marty and Charles Tillon) were given long prison sentences. * Kronstadt rebellion was an unsuccessful rebellion by Soviet sailors. It was led by Stepan Petrichenko, against the government of the early Russian SFSR in the first weeks of March, 1921. It proved to be the last big rebellion against Bolshevik rule. * Invergordon Mutiny was a Strike action (stop work) by around 1000 sailors in the British Atlantic Fleet. It took place on 15-16 September 1931. For 2 days, the sailors at Invergordon were in mutiny. This was one of the few military strikes in British history. * Cocos Islands Mutiny was a failed mutiny by Sri Lankan soldiers on the then-British Cocos (Keeling) Islands during the Second World War. * Port Chicago mutiny happened on August 9 1944, 3 weeks after the Port Chicago disaster when 320 sailors were killed and 390 injured in an explosion. 258 out of the 320 African-American sailors in the supply part of the Navy would not load any ammunition because they thought it was not safe.The sailors were convicted of mutiny, though they simply refused to obey a lawful order. They did not try to take over which means it is not a real mutiny *Sonderborg Denmark mutiny on May 4, 1945 German sailors took over German minesweeper M612. The next day they were arrested and 11 executed. Their bodies were thrown into the sea. . ===After World War II=== * Post-World War II demobilization strikes happened in the Allied military forces stationed across the Middle East, India and Southeast Asia in the months and years following World War II. * The Royal Indian Navy Mutiny was a total strike and mutiny by the Indian sailors of the Royal Indian Navy on board ships and on shore at Bombay (Mumbai) harbour on 18 February 1946. * SS Columbia Eagle incident happened on 14 March, 1970 during the Vietnam War. Sailors on an American merchant ship mutinied and took the ship to Cambodia. * The Storozhevoy Mutiny happened on 9 November, 1975 in Riga, Latvia. The political officer locked up the Soviet Navy captain and sailed the ship toward Leningrad. * The Velos mutiny happened on 23 May, 1973 when the captain of HNS Velos, refused to go back to Greece after a NATO exercise. ==References==",
 "title": "Mutiny"
}