{
 "id": "126553",
 "text": "The 1951–52 NHL season was the 35th season of the National Hockey League. Six teams each played 70 games. The Detroit Red Wings won the Stanley Cup by sweeping the Montreal Canadiens four games to none. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes National Hockey League GP W L T Pts GF GA PIM Detroit Red Wings 70 44 14 12 100 215 133 694 Montreal Canadiens 70 34 26 10 78 195 164 661 Toronto Maple Leafs 70 29 25 16 74 168 157 841 Boston Bruins 70 25 29 16 66 162 176 601 New York Rangers 70 23 34 13 59 192 219 532 Chicago Black Hawks 70 17 44 9 43 158 241 627 ===Scoring leaders=== Note: GP = Games played, G = Goals, A = Assists, PTS = Points, PIM = Penalties in minutes Player Team GP G A PTS PIM Gordie Howe Detroit Red Wings 70 47 39 86 78 Ted Lindsay Detroit Red Wings 70 30 39 69 123 Elmer Lach Montreal Canadiens 70 15 50 65 36 Don Raleigh New York Rangers 70 19 42 61 14 Sid Smith Toronto Maple Leafs 70 27 30 57 6 ==Stanley Cup playoffs== In the playoffs, Detroit finished 8–0, the first time a team had gone undefeated in the playoffs since the 1934–35 Montreal Maroons. The Wings scored 24 goals in the playoffs, compared to a combined 5 goals for their opponents. : see 1952 Stanley Cup Finals ===Playoff bracket=== ==NHL awards== Prince of Wales Trophy: Detroit Red Wings Art Ross Memorial Trophy: Gordie Howe, Detroit Red Wings Calder Memorial Trophy: Bernie Geoffrion, Montreal Canadiens Hart Memorial Trophy: Gordie Howe, Detroit Red Wings Lady Byng Memorial Trophy: Sid Smith, Toronto Maple Leafs Vezina Trophy: Terry Sawchuk, Detroit Red Wings ===All-Star teams=== First team Position Second team Terry Sawchuk, Detroit Red Wings G Jim Henry, Boston Bruins Red Kelly, Detroit Red Wings D Hy Buller, New York Rangers Doug Harvey, Montreal Canadiens D Jimmy Thomson, Toronto Maple Leafs Elmer Lach, Montreal Canadiens C Milt Schmidt, Boston Bruins Gordie Howe, Detroit Red Wings RW Maurice Richard, Montreal Canadiens Ted Lindsay, Detroit Red Wings LW Sid Smith, Toronto Maple Leafs ==References== *Hockey Database *NHL.com Category:1951 in North America Category:National Hockey League seasons",
 "title": "1951–52 NHL season"
}