{
 "id": "126750",
 "text": "Mass Effect is an action role-playing game published by Microsoft and developed by BioWare. It was released for the Xbox 360 and later on the PC. The game takes place in the year 2183. Players control an elite human soldier called Commander Shepard and are able to explore the galaxy on his or her spacecraft, the SSV Normandy. == Plot and Universe == Mass Effect has a very detailed fictional universe, with many of the concepts based on real science. There are over 20 alien races the player can meet in Mass Effect, with more planned for the sequels. === Themes === The game has a science fiction setting and explores themes such as space, racism, religion and the state of humanity. The main plot of the game involves the classic science fiction idea of robots or AI that have got out of control. According to the lead writer of Bioware, Star Wars, Aliens and Blade Runner were all influences on the games setting and plot. === Setting === Mass Effect is set 180 years in the future in the year 2183. According to the back story humans discovered some ancient technology on Mars. This enabled them to build faster than light spacecraft. With this technology humans explored the whole Solar System. Twenty years before the game begins human explorers find that Pluto's moon Charon, is really a Mass Relay. Mass Relays are the only way to travel from one distant end of the galaxy to the other. Mass Relays are ancient technology created by the Protheans, the now exctict race that once ruled the galaxy. This enables spacecraft and people to be sent across the galaxy. == References == Category:2007 video games Category:Mass Effect Category:BioWare games Category:Electronic Arts video games Category:Action role-playing video games Category:Apocalyptic video games Category:LGBT-related video games Category:Microsoft video games Category:Military science fiction video games Category:PlayStation 3 games Category:Role-playing video games Category:Science fiction video games Category:Single-player video games Category:Video games about terrorism Category:Windows games Category:Xbox 360 games",
 "title": "Mass Effect"
}