{
 "id": "127051",
 "text": "Megalodon is an extinct species of shark and was the largest shark of all time, as far as we know. Its scientific name is Otodus megalodon (meaning \"Big ear-shapped tooth\"). It lived from the early Miocene to the Pliocene epochs, 23 to 3.6 million years ago (mya). It is a member of the family Otodontidae. When it was first described paleontologists thought it was the ancestor of the present-day great white shark (Carcharodon carcharias ), buy closer inspection distanced the 2 species. Megalodon had teeth, which are among the largest ever found, over long. Nicolaus Steno was the first to recognize the teeth as those of a giant shark. Paleontologists calculate that the shark was up to long with average length of 17 meters (56 feet). It weighed up to 48-103 metric tons. == Paleoecology == Fossil records of C. megalodon indicate that it occurred in deep to tropical latitudes. Before the formation of the Isthmus of Panama, the seas were relatively warmer. This would have made it possible for the species to live in all the oceans of the world. C. megalodon lived in many marine environments (i.e. continental shelf waters, coastal upwelling, swampy coastal lagoons, sandy littorals, and offshore deep water environments),Renz, Mark 2002. Megalodon: hunting the hunter. PaleoPress. and moved from place to place. Adult O. megalodon were not abundant in shallow water environments, and mostly lurked offshore. O. megalodon may have moved between coastal and oceanic waters, at different stages in its life. == Its prey == Megalodon hunted large and medium-sized whales, attacking the bony areas, such as chest, fins, or tail. This would stop the whale, or it could kill quickly with a fatal bite to the chest region. The megalodon bite is considered one of the strongest bites in the animal kingdom’s history. Its great size,Wroe S. et al. 2008. Three-dimensional computer analysis of white shark jaw mechanics: how hard can a great white bite?. Journal of Zoology 276 (4): 336–342. high-speed swimming capability,Arnold, Caroline 2000. Giant Shark: Megalodon, prehistoric super predator. Houghton Mifflin. pp 18–19 and powerful jaws coupled with formidable killing apparatus, made it an apex predator eating a range of fauna. Fossil evidence is that O. megalodon preyed on cetaceans (i.e., dolphins,Klimley, Peter; Ainley, David 1996. Great White Sharks: the biology of Carcharodon carcharias. Academic Press. small whales, and Odobenocetops, and large whales, (including sperm whales, bowhead whales, and rorquals pinnipeds, porpoises, sirenians, and giant sea turtles. Marine mammals were regular prey targets for megalodon. There have been almost no whale bones found with clear signs of large bite marks (deep gashes) made by teeth that match those of megalodon, and few excavations have revealed megalodon teeth lying close to any remains of whales, leading to speculation as to whether or not they truly lived. Fossil evidence of interactions between megalodon and pinnipeds also exist. In one interesting observation, a megalodon tooth was found lying very close to a bitten ear bone of a sea lion. == Relationships == The Megalodon is a member of the family Otodus and is not a related species of the great white shark (Carcharodon carcharias). Megalodon evolved from a shark called Palaeocarcharodon orientalis which evolved into Otodus (Carcharocles) auriculatus which evolved into Otodus sokolovi which evolved into Otodus (Carcharocles) angustidens which evolved into Otodus (Megaselachus) chubutensis which evolved into Otodus (Megaselachus) megalodon. However, this has been disproven by the egregious lack of missing links in the evolutionary process. There would be an abundance of fossils (guppies, adult sharks, et cetera) that show a slow progression from the formidable megalodon to the fierce great white of the modern day. == References == Category:Sharks Category:Extinct fish",
 "title": "Megalodon"
}