{
 "id": "127053",
 "text": "The \"Dust Bowl\" is a phrase that is used to describe prairie regions of the United States and Canada in the 1930s. The Dust Bowl spread from Saskatchewan and Manitoba, in the north, all the way to Oklahoma and parts of Texas and New Mexico, in the south. In those areas, there were many serious dust storms and droughts, which caused major damage to the local economies, ecology, and agriculture. The Dust Bowl was the worst artificial disaster in US history. Many dust storms happened for years. It was also suffered by many Canadians and probably by many Mexicans. ==Causes== The people who lived in the Dust Bowl area were mostly farmers. Many years of intensive farming without rain had left the soil dry. When strong winds blew, they covered cities, towns, and farms in dried, dusty soil and ruined the farmland. ==Effects== One famous storm on April 14, 1935, called \"Black Sunday,\" was so strong that it covered dozens of cities in black clouds of dust and made it impossible to see the sky or even a few feet ahead. The writer Timothy Egan stated that the Black Sunday storm \"carried away twice as much dirt as was dug out of the earth to create the Panama Canal.\" The Dust Bowl is still considered one of the worst environmental disasters in US history. Many thousands of people died from breathing in the dust or from starvation.Gazit, Chana; & Steward, David (Producers) (2007). American Experience: Surviving the Dust Bowl (DVD). PBS. (Full transcript available online. Transcript retrieved April 12, 2016. Many of those who survived lost everything they had and left the Dust Bowl to look for work in other parts of the country; they were called \"Dust Bowl refugees.\" In the days of the bison, grass was anchored into the ground, and its leaves were eaten. With farming, the plants were dug up wholescale. The seriousness of the disaster later led to greater use of crop rotation, reforesting and other techniques to preserve the quality and quantity of topsoil in American and Canadian farms. Many songs, books, and works of art were created to tell stories of the people affected by the dust storms. Some of the most famous works are the novels The Grapes of Wrath and Of Mice and Men by John Steinbeck; the songs of the folk music singer Woody Guthrie; and the photography of Dorothea Lange, who took pictures of many Dust Bowl refugees and their families. == Photo gallery == File:Dust Bowl winds pile up against barn in Kansas.jpg|Dust starting to bury a barn in Kansas File:Dust Storms, \"Dust Storm Near Beaver, Oklahoma\" - NARA - 195354.tif|An Oklahoma dust storm (1935) File:Dust storm approaching Stratford, Texas.jpg|A Texas dust storm covers homes (1935) File:Dust Bowl - Dallas, South Dakota 1936.jpg|Vehicles and machines buried in dust (South Dakota, 1936) File:Lange- MigrantMother02.jpg|Famous picture of Dust Bowl refugees (1936) ==References== Category:1930s in the United States Category:1930s in Canada Category:Forced migration Category:Weather by continent",
 "title": "Dust Bowl"
}