{
 "id": "127125",
 "text": "South Tyrol, also known by its Italian name Alto Adige (, , Southern Bavarian: Sidtiroul), is an autonomous province in northern Italy. Together with the province of Trento, it makes up the region of Trentino-Alto Adige/Südtirol. The province has an area of . About 511,750 people live there (2011). The capital of the province is the city of Bolzano. The borders are Graubünden and Lombardia in the west, Tyrol and Salzburg in the north, Trentino and Veneto in the south. Although it is part of Italy, most of the population speaks German. Around a quarter of the population speak Italian, most of whom live in the two largest cities (Bolzano and Merano). Italian and German are both official languages. In parts of the province, a third language, Ladin, is spoken and official as well. South Tyrol is the most common name for the province in ancient English.Cf. for instance Antony E. Alcock, The History of the South Tyrol Question, London: Michael Joseph, 1970; Rolf Steininger, South Tyrol: A Minority Conflict of the Twentieth Century, New Brunswick, New Jersey: Transaction Publishers, 2003; Georg Grote, Hannes Obermair, A Land on the Threshold. South Tyrolean Transformations, 1915–2015, Oxford/Bern/New York: Peter Lang. German and Ladin speakers usually refer to the area as Südtirol. The official name is the Province of Bolzano (in ; in ; in Ladin: Provinzia autonoma de Balsan/Bulsan – Südtirol). South Tyrol/Alto Adige is an autonomous province. It has its own legislature that makes many laws that are separate from those made by the Italian government. Luis Durnwalder has been the head of government since 1989. He belongs to the South Tyrolean People's Party, which has been governing since 1948. ==Name== The name Alto Adige comes from the river Adige. \"Alto\" means upper, because the upper part of the river flows through the province. The name was first created by the Napoleonic French to distinguish the Trentino area. It had then been reused by the Fascist regime from the 1920ies onwards. ==History== The region was originally populated by Raetian population who was then latinized in the time of the Roman Empire. A profound Germanisation process took place after the invasion by Franks and Bavarians, from the 6th century onwards. Only a small part of the Dolomite's area is still inhabited by Ladin population. The region was part of the Crown Land of Tyrol and belonged to the multi-ethnic Habsburg empire of Austria- Hungary. After the First World War, despite the fact that its inhabitants were almost entirely German-speaking, South Tyrol was assigned, against its will, to the Kingdom of Italy by the Treaty of Saint-Germain. The name was officially changed to Alto Adige. This happened on the basis of the wishes of the Italian irredentists, who considered the Alto Adige as a geographical territory of Italy. When Benito Mussolini's Fascist party came to power in 1922, a period of oppression and marginalisation of the German- and Ladin- speaking minorities began. German was replaced by Italian in the public sphere, the German language was banned from public life and schools. The fascist government favoured instead the industrialisation of the province to attract Italian immigrants and to further carry out its Italianisation politics. In 1939/40, the German and the Italian dictator, Mussolini and Hitler, came to terms and planned the resettlement of the non-Italian minorities into the Third Reich. In 1943, the German Wehrmacht occupied the region and established a regime of terror. After World War II, on May 8, 1945, the \"Südtiroler Volkspartei\" was founded. It soon became the ruling political party in South Tyrol, gaining an absolute or relative majority since 1947. In the 2011 census, about 63% of the population belong to the German-speaking group, about 23% to the Italian-speaking group, and about 4% to the Ladin- speaking group (another 10% are immigrants from outside Italy). ==References== ==Other websites== *Official website *Tourist information about South Tyrol Category:Autonomous areas",
 "title": "South Tyrol"
}