{
 "id": "127155",
 "text": "Nintendo Wi-Fi Connection (also known as WFC), was a service for the Wii and Nintendo DS. It was used on games that let a person play with people around the world. * On January 26, 2012, it was announced by Nintendo during an investors' meeting that it would be rebranded to Nintendo Network. * On June 27, 2013, WiiConnect24 was discontinued. * On May 20th, 2014, Nintendo Wi-Fi Connection was discontinued. Before Nintendo Wi-Fi Connection shut down, 6 other sub-services were discontinued. Wii no Ma closed on April 30, 2012. Then, the Kirby TV Channel closed in October 2012. The Forecast Channel, News Channel, Everybody Votes Channel, Nintendo Channel, and the Check Mii Out Channel closed on June 27, 2013 along with WiiConnect24 services. == Features == The Nintendo Wi-Fi Connection was announced to be \"easy to connect to, safe for everyone to use, and free\". Features included worldwide matches, leaderboards, and tournaments. More features were available between people who friended each other with Friend Codes. === Wii Shop Channel === The Wii Shop Channel allowed people to buy games or software with Wii Points. You could buy Wii Points with Nintendo Point Cards, Mastercard, and/or Visa cards online. People could browse the Virtual Console, WiiWare, or Wii Channel sections. Buying Wii Points was disabled on March 26th, 2018. Buying new games or software in the channel shut down on January 30th, 2019. However, people could still install previously bought games, Wii System Transfer Tool, and The Legend of Zelda: Skyward Sword Save Data Update Channel. Nintendo announced a way to buy DLC, called Pay & Play. Games in Japan had Pay & Play support as WiiWare titles such as Final Fantasy Crystal Chronicles: My Life as a King, Kotoba no Puzzle Mojipittan Wii, and LONPOS. Since January 30, 2019, the Wii Shop Channel and DS(i) Shop have been shut down forever. === DSi Shop === The DSi Shop allowed people to download apps and DSiware, like its Wii and DS equivalent. It shut down on March 31, 2017. Since March 31, the only thing available for download on the DSi Shop is the Nintendo 3DS Transfer Tool. Lots of software is also in this shop, such as Flipnote Hatena. Flipnote Hatena has since been discontinued. === Check Mii Out Channel === The Check Mii Out Channel is a channel that allows people to share their Mii. It was first available on November 11, 2007. People can post their own Miis in the Posting Plaza, or import Mii's into their own Mii Parade. In the contests, people can send their own Miis to compete in contests to fit a description (for example: Mario without his hat). After the time for submitting a Mii has ran out, the user can vote for three Miis featured on the panel, with ten random Miis being shown at a time. Once the judging is over, the results of the contest can be viewed. Their selection and/or submission's popularity in comparison to others is displayed, as well as the winning Mii and user. The Check Mii Out Channel sends messages to the Wii Message Board about recent contests. People in some contests can add their user and submitted Mii to a photo with a background related to the contest theme. This picture can then be sent to the Wii Message Board. The Check Mii Out Channel was shut down on June 28, 2013. === Nintendo Channel === The Nintendo Channel (also known as the Everybody's Nintendo Channel in Japan), is a Wii channel for the Wii. It was launched in Japan on November 27, 2007, North America on May 7, 2008,Nintendic » Nintendo Channel dated for US, WiiWare integrated Europe and Australia on May 30, 2008, and was shut down on June 28, 2013. It allowed people who had the Wii to watch videos such as interviews, trailers, commercials, and to download game demos for the Nintendo DS. The channel gave information on games and people could rate games that they played. There was a search feature that people used to find games or software easier. The channel could take the user directly into the Wii Shop Channel to buy the game. The Nintendo Channel was updated with different DS demos and new videos every week, but the actual day of the week varied across different international regions. An updated version of the Nintendo Channel was released in Japan on July 15, 2009, North America on September 14, 2009, and Europe on December 15, 2009. The update introduces a new interface and additional features, options, and statistics for users to view. The European version is missing some of these new additional features, such as options for choosing video quality. In addition, a weekly show known as Nintendo Week began airing exclusively on the North American edition of the channel, while another weekly show called Nintendo TV, is available on the UK version of the channel.News: ONM launches Nintendo TV. ComputerAndVideoGames.com (June 7, 2010). Retrieved on August 23, 2013. === Mario Kart Channel === Mario Kart Wii allows people to install the Mario Kart Channel. It allows people to check records and view tournaments. The channel works without the game disc inserted, but to compete in races and time trials, the game disc must be inserted. Tournaments existed in the channel and made people who participated to finish objectives as fast as possible. People could compare their own times to other people.Nintendo - News - Going global with Mario Kart Wii April 3, 2008 === Demae Channel === This channel allowed people to order food through Demae-Can. People could only get this channel in Japan. However, people have learned to sideload the channel by modding. When a person order something, a receipt gets sent to their Wii Message Board. People could use roulette mode in case someone couldn't find what they wanted to eat. The channel was released on May 26, 2009, and was discontinued on March 31, 2017. === Wii Room === A video channel was released in Japan on May 1, 2009, it was planned to be released in North America. The channel is built around a living room, where 8 Miis can interact with each other. The living room has a TV which shows the person various things. === Netflix === The Nintendo Wii had Netflix starting on March 27, 2010. It was only for American and Canadian owners, but a Netflix disc was required to use the software because of a deal with Microsoft to get Netflix on the Xbox 360. As of October 18, 2010, American and Canadian Wii owners could download Netflix as a channel without requiring a disc. Netflix has been discontinued for the Wii on January 30, 2019, along with the shut down of the Wii Shop Channel. === Internet Browser === The Nintendo Wii, DS and DSi can use the Internet with a downloadable web browser. The Nintendo Wii, DSi, and DS browsers runs on Opera. The Nintendo DS's web browser is ran off of a game card and requires a RAM expansion through the Game Boy Advance port. === Forecast Channel === The Forecast Channel first became available on December 19, 2006, and was shut down on June 28, 2013, due to the discontinuation of WiiConnect24 which it required. People were allowed to use the channel to see the current forecast, the UV index, today's overall weather, tomorrow's forecast, a 5-day forecast (only for the country you live in), and a laundry check (Japan only). Certain games like Madden NFL 07, Nights: Journey of Dreams, and Mario & Sonic at the Olympic Winter Games could use the Forecast Channel to put custom weather conditions in-game. === News Channel === The News Channel allows people to access news headlines and current events from the Internet. News articles are available on a globe view similar to the Forecast Channel, and on the sidebar. The News Channel became available in North America, Europe, and Australia on January 26, 2007. With the August 6, 2007 update, the News Channel shows an alert in the Wii Menu. However, not using the channel for some time will result in the alert not appearing, until the channel is opened. A December 20, 2007 update only released in PAL regions increased the number of news feeds to the channel, sourced from a larger number of news resources and agencies, providing more news that is available per country.GoNintendo » Blog Archive » Wii News Channel updated- What are you waiting for? As with the Forecast Channel, the News Channel is not available in South Korea. The News Channel was shut down on June 28, 2013, along with the Forecast Channel, due to both channels requiring the discontinued WiiConnect24 service. == Wii Message Board == The Message Board's online features are discontinued, along with the shutdown with WiiConnect24. People could leave messages, or other people on a calendar message board. Announcements of updates and video game news were posted by Nintendo. The Wii Message Board could be updated real-time by a game like Animal Crossing: City Folk. === Wii Speak === People that bought the Wii Speak microphone were able to use the Wii Speak Channel. The channel was for voice chatting. They could access one of four rooms (with no limit in these rooms). Every person's avatar was their Mii, which lip syncs their words. Sending voice messages to other people via the Wii Message Board was supported. The Wii Speak Channel was first released on December 5, 2008 in both North America and Europe. Animal Crossing: City Folk was one of the few games that used the accessory. == Games == The first Wi-Fi games were Mario Kart DS and Tony Hawk's American Sk8land for the Nintendo DS. Mario Kart DS released on November 14, 2005, and Tony Hawk's American Sk8land released on November 16, 2005. Some notable games that used the service include Super Smash Bros. Brawl, Pokémon Diamond and Pearl, Pokémon Black and White and Pokémon Black 2 and White 2, Animal Crossing: Wild World, and Animal Crossing: City Folk. == Connection options == === Nintendo DS === The Nintendo DS has a wireless adapter built in allowing the DS to access the internet with a wireless network. The DS only supports WEP. === Wii === The Wii has a wireless adapter built in. The Wii supports security protocols WEP, WPA, and WPA2. The Wii can also be connected by a ethernet cable (with a USB adapter). === Nintendo Wi-Fi USB Connector === If there isn't a compatible Wi-Fi network, the DS and Wii can connect through the Nintendo Wi-Fi USB Connector. People were able to buy it from the Nintendo Online Store. The product has been discontinued since. === Hotspots === Nintendo made deals with hotspot providers to allow free access for Nintendo DS users. In 2005, Nintendo made an agreement with Wayport, Inc. to provide access in McDonald's restaurants across the U.S. In Canada, Nintendo had partnered with FatPort to create free hotspots. == Shutdown == Nintendo Wi-Fi Connection was discontinued on May 20, 2014. The shutdown is caused by GameSpy's closing. The DSi Shop Channel has been discontinued as of March 31, 2017. People can continue to download the 3DS Transfer Tool to transfer their data to their Nintendo 3DS. The Wii Shop Channel has been discontinued as of January 31st, 2019, 6:00 PM UTC. The only downloads left are the Wii U Transfer Tool and The Legend of Zelda: Skyward Sword Save Data Update Channel. == Community restorations == Wiimmfi is a replacement service for Nintendo Wi-Fi Connection that opened 10 days before the shutdown. When it started, Mario Kart Wii was only supported. WiiLink24, a third-party service, restores WiiConnect24 functionality. == References == == Other websites == * Nintendo Wi-Fi Connection Official Site Category:Nintendo Category:Wii",
 "title": "Nintendo Wi-Fi Connection"
}