{
 "id": "127281",
 "text": "== Picasa == Picasa is a software application for organizing and editing photos. It was first created by Idealab. The name \"Picasa\" is a blend of the last name of Spanish painter Pablo Picasso, the phrase mi casa for \"my house\" and \"pic\" for pictures. In July 2004, Google purchased Picasa and began offering it as a free download. There was a version for Windows XP and Windows Vista, as well as a version for Linux. For Windows 98 and Windows Me, only an older version was available. There was also an iPhoto plugin or program for uploading photos available for Mac OS X 10.4 and later. On February 12, 2016, Google announced it was \"Moving on from Picasa\" and the Picasa desktop application would be discontinued on March 15, 2016. Google stated that the primary reason for retiring Picasa was that it wanted to focus its efforts \"entirely on a single photos service\" the cross-platform, web-based Google Photos. == Other Picasa applications == === Picasa Web Albums === Picasa Web Albums (PWA) was a photo-sharing web application created by Google and was similar to websites such as Flickr and Zooomr. Picasa Web Albums was first announced on June 6, 2006.Google Picasa Web Albums Coming? When introduced, it came with 250 MB free space. On March 7, 2007, it was upgraded to 1GB. Users with accounts at Google could store and share 1GB of photos for free. Users were able to purchase more storage space with these plans: Plans: no. of Gigabytes Cost per Year in US$ Cost of 1GB per Year in US$ 10 20 2.00 40 75 1.875 150 250 1.667 400 500 1.25 Users could upload pictures and videos by using either a web interface, through Picasa 2.5.0 or laterPicasa Web Albums on Microsoft Windows, using the Exporter for iPhoto, the Aperture to Picasa Web Albums plug-in, or Uploader on Mac OS X, or F-Spot on Linux. No ads were shown on Picasa Web Albums in either the free or paid accounts. The Terms of Service allowed Google to use the uploaded photos and videos to display on the website or via RSS feeds, and also for promoting Google services without needing to pay the users. On February 12, 2016, Google announced they would retire Picasa Web Albums (also called Picasaweb) so they could focus entirely on a single photo service called Google Photos. The retirement of Picasa Web Albums was effective on August 1, 2016. All photos and videos formerly in Picasa Web Albums were moved by Google to an archived platform called Album Archive. == Version history == === Windows === There are no versions of Picasa for Windows 95 or NT. The latest version offered for Windows 98/ME is 2.0.0 Build 18.84. The latest version for Windows 2000/XP/Vista/Windows 7 is 3.9 Build 141.259. * 1.618 Build 5.35 July 2004 – free download version offered since Google's acquisition of Picasa. * 2.0.0 Build 18.77 January 18, 2005 – many features including improved search functions, an automated photo collage maker, massively enhanced photo editing functions and further integration with Picasa's Hello and Google's Blogger services. * 2.0.0 Build 18.84 June 8, 2005 – bug fix release, latest release for Windows 98/ME. This version does not suffer from the \"picasa2\\runtime\\hlpsys.dll is not a valid windows image. Check installation disk.\" error, which some users have experienced. * 2.1.0 Build 27.60 September 19, 2005 – new features including international language support, one-click photo blogging, CD cover printing, improved RAW handling and improved support for external drives. * 2.2.0 Build 28.20 January 30, 2006 – 25 additional languages are supported, new network drive support, and bug fixes for IE7 support and CD Burning. * 2.5.0 Build 32.01 June 12 2006 – Beta versions including Picasa Web Albums support – last version (build 32.97) started rollout on November 14 2006. * 2.6 Build 35.94.0 December 7, 2006 – new autoupdate behavior for Windows Vista support, new CD/DVD-burning engine, improved upload reliability to Picasa Web Albums, and added support for 18 new languages. * 2.7 Build 36.37.0 April 24, 2007 – new RAW processing engine, new color engine for \"tuning\" fixes, added support for Google Photos Screensaver, and improved BlogThis! reliability. ** 2.7 Build 36.40 May 3, 2007 – support for more cameras, updated version number for international installs. ** 2.7 Build 36.60 26 June 2007 – added support for geotag, supposedly fixed problems with showing up some video files. ** 2.7 Build 37.23 21 August 2007 – support for more languages, fixes several bugs. ** 2.7 Build 37.29 13 September 2007 – Added support for RAW pictures from the Canon 40D, fixes several bugs. ** 2.7 Build 37.32 2 October 2007 – Fixed a case where corrupted AVI files could cause a crash. Fixed a case that would result in a \"This account is not enabled for Picasa Web Albums\" error. ** 2.7 Build 37.36 30 October 2007 – Added support for 11 additional languages: Bulgarian, Catalan, Filipino, Indonesian, Latvian, Lithuanian, Serbian, Slovak, Slovenian, Thai, Vietnamese. ** 2.7 Build 37.49 7 March 2008 - Improved performance for new Intel chips. Translation fixes for Hungarian and Chinese. Fixed a case that would result in an error when capturing images from webcams. ** 2.7 Build 37.64 21 August 2008 - *3.9.137 Build114; Mac: 3.9.137.163 March 7, 2014 - Changed Picasa from Maps v2 API to v3 API (this affected the Geo Panel in one-up mode). Bug fixes. Google+ auto backup (on Windows: 1.0.23.114, on Mac: 1.0.23.53) improvements **3.9.137 Build 118; Mac: 3.9.137? March 10, 2014 - Bug fixes **Google+ auto backup for desktop March 31, 2014 - Improvements in preserving RAW files in Auto Backup from Picasa **3.9 Build 137.141; Mac: 3.9.137.192 June 9, 2014 - Allowed upload of full size non-JPEG images without converting to JPEG. Bug fix in album sync. Google+ auto backup for desktop (on Windows: 1.0.25.141, on Mac: 1.0.25.184) improvements and bug fixes **3.9 Build 138.150; Mac: 3.9.138.201 August 12, 2014 - Numerous bug fixes. Google+ auto backup for desktop (on Windows: 1.0.26.150, on Mac: 1.0.26.201), improvements and bug fixes **3.9 Build 138.151; Mac 3.9.138.202 August 13, 2014 - When a video was uploaded to G+ Photos, the video file extension in G+ Photos became .JPG instead of the original extension **3.9 Build 139.161; Mac: 3.9.139.218 February 17, 2015 - Bug fixes of several potential security flaws in handling TIFF files **3.9 Build 140.239; Mac: 3.9.140.287 July 17, 2015 - Picasaweb.google.com no longer redirects to G+ Photos, text changes in popup for uploading and/or sharing, upload and sync of face tags from Picasa was disabled **3.9 Build 140.248; Mac: 3.9.140? September 3, 2015 - Security patches, Network fixes for OS X that affected Google Photos Backup and Picasa, Shop button and order prints function not functional **3.9 Build 141.255; Mac: 3.9.141? October 9, 2015 - Google Photos Backup v.1.1.1. Added patches for image handling, fixed various reported crashes, support for new Apple Photos library **3.9 Build 141.259 February 9, 2016 - Final version of Picasa for Windows XP, Windows Vista, Windows 7. Google ended support on March 15, 2016. The Picasa program continued to work on later versions of Windows but all online functions were disabled. See also version 2 release notes and version 3 release notes === Linux === * Around June 2006, Linux versions (2.2.2820-5) became available as free downloads for most distributions of the Linux operating system. It was not a native Linux program but an adapted Windows version that used the Wine libraries. * A Release Candidate of Picasa for Linux 2.7 (Build 37.3607,0) was released on 21 November 2007.Google-Labs- Picasa-for-Linux * Google added Picasa for Linux 2.7 (Build 37.3615, 0) to its Linux repository on 16 April 2008. === Mac OS X === Picasa for Mac was launched in 2008.Google Developing Mac Version Of Picasa, Due To Be Released This Year A plugin was available for iPhoto to upload to the Picasa Web Albums hosting service. There was also a standalone Picasa Web Albums uploading tools for OS X 10.4 or later. Using Darwine or similar compatibility layers, however, Picasa can run on Mac OS X. == Notes and references == P",
 "title": "Google Picasa"
}