{
 "id": "127346",
 "text": "In Major League Baseball, the All-Star Game is the game between the best players from the American League (AL) and the National League (NL). The game is held in July of each season. From 2003 to 2016, The winner of the game got home field advantage in the World Series. Prior to that, home field advantage alternated every year between the two leagues. Starting in 2017, the pennant winner with the better regular season record now gets home field advantage in the World Series. As of 2023, the American League has won 47 times, and the National League has won 44 times. There have been two ties. ==List of games and results== Date Winning League (All-Time Record) Score Venue Host Team Attendance MVP Winning Pitcher Losing Pitcher July 6, 1933 American (1–0–0 AL) 4–2 Comiskey Park Chicago White Sox 47,595 Lefty Gomez, New York (AL) Bill Hallahan, St. Louis (NL) July 10, 1934 American (2–0–0 AL) 9–7 Polo Grounds New York Giants 48,368 Mel Harder, Cleveland (AL) Van Mungo, Brooklyn (NL) July 8, 1935 American (3–0–0 AL) 4–1 Cleveland Stadium Cleveland Indians 69,812 Lefty Gomez, New York (AL) Bill Walker, St. Louis (NL) July 7, 1936 National (3–1–0 AL) 4–3 National League Park Boston Bees 25,556 Dizzy Dean, St. Louis (NL) Lefty Grove, Boston, (AL) July 7, 1937 American (4–1–0 AL) 8–3 Griffith Stadium Washington Senators 31,391 Lefty Gomez, New York (AL) Dizzy Dean, St. Louis (NL) July 6, 1938 National (4–2–0 AL) 4–1 Crosley Field Cincinnati Reds 27,067 Johnny Vander Meer, Cincinnati (NL) Lefty Gomez, New York (AL) July 11, 1939 American (5–2–0 AL) 3–1 Yankee Stadium New York Yankees 62,892 Tommy Bridges, Detroit (AL) Bill Lee, Chicago (NL) July 9, 1940 National (5–3–0 AL) 4–0 Sportsman's Park St. Louis Cardinals 32,373 Paul Derringer, Cincinnati (NL) Red Ruffing, New York (AL) July 8, 1941 American (6–3–0 AL) 7–5 Briggs Stadium Detroit Tigers 54,674 Eddie Smith, Chicago (AL) Claude Passeau, Chicago (NL) July 6, 1942 American (7–3–0 AL) 3–1 Polo Grounds New York Giants 34,178 Spud Chandler, New York (AL) Mort Cooper, St. Louis (NL) July 13, 1943 American (8–3–0 AL) 5–3 Shibe Park Philadelphia Athletics 31,938 Dutch Leonard, Washington (AL) Mort Cooper, St. Louis (NL) July 11, 1944 National (8–4–0 AL) 7–1 Forbes Field Pittsburgh Pirates 29,589 Ken Raffensberger, Philadelphia (NL) Tex Hughson, Boston (AL) July 10, 1945 Game canceled due to World War II-related travel restrictions. Game was originally scheduled to be held at Fenway Park in Boston, Massachusetts. July 9, 1946 American (9–4–0 AL) 12–0 Fenway Park Boston Red Sox 34,906 Bob Feller, Cleveland (AL) Claude Passeau, Chicago (NL) July 8, 1947 American (10–4–0 AL) 2–1 Wrigley Field Chicago Cubs 41,123 Spec Shea, New York (AL) Johnny Sain, Boston (NL) July 13, 1948 American (11–4–0 AL) 5–2 Sportsman's Park St. Louis Browns 34,009 Vic Raschi, New York (AL) Johnny Schmitz, Chicago (NL) July 12, 1949 American (12–4–0 AL) 11–7 Ebbets Field Brooklyn Dodgers 32,577 Virgil Trucks, Detroit (AL) Don Newcombe, Brooklyn (NL) July 11, 1950 National (12–5–0 AL) 4–3 (14) Comiskey Park Chicago White Sox 46,127 Ewell Blackwell, Cincinnati (NL) Ted Gray, Detroit (AL) July 10, 1951 National (12–6–0 AL) 8–3 Briggs Stadium Detroit Tigers 52,075 Sal Maglie, New York (NL) Ed Lopat, New York (AL) July 8, 1952 National (12–7–0 AL) 3–2 (5) Shibe Park Philadelphia Phillies 32,785 Bob Rush, Chicago (NL) Bob Lemon, Cleveland (AL) July 14, 1953 National (12–8–0 AL) 5–1 Crosley Field Cincinnati Reds 30,846 Warren Spahn, Milwaukee (NL) Allie Reynolds, New York (AL) July 13, 1954 American (13–8–0 AL) 11–9 Cleveland Stadium Cleveland Indians 69,751 Dean Stone, Washington (AL) Gene Conley, Milwaukee (NL) July 12, 1955 National (13–9–0 AL) 6–5 (12) County Stadium Milwaukee Braves 45,643 Gene Conley, Milwaukee (NL) Frank Sullivan, Boston (AL) July 10, 1956 National (13–10–0 AL) 7–3 Griffith Stadium Washington Senators 28,843 Bob Friend, Pittsburgh (NL) Billy Pierce, Chicago (AL) July 9, 1957 American (14–10–0 AL) 6–5 Busch Stadium St. Louis Cardinals 30,693 Jim Bunning, Detroit (AL) Curt Simmons, Philadelphia (NL) July 8, 1958 American (15–10–0 AL) 4–3 Memorial Stadium Baltimore Orioles 48,829 Early Wynn, Chicago (AL) Bob Friend, Pittsburgh (NL) July 7, 1959 National (15–11–0 AL) 5–4 Forbes Field Pittsburgh Pirates 35,277 Johnny Antonelli, San Francisco (NL) Whitey Ford, New York (AL) August 3, 1959 American (16–11–0 AL) 5–3 Memorial Coliseum Los Angeles Dodgers 55,105 Jerry Walker, Baltimore (AL) Don Drysdale, Los Angeles (NL) July 11, 1960 National (16–12–0 AL) 5–3 Municipal Stadium Kansas City Athletics 30,619 Bob Friend, Pittsburgh (NL) Bill Monbouquette, Boston (AL) July 13, 1960 National (16–13–0 AL) 6–0 Yankee Stadium New York Yankees 38,362 Vern Law, Pittsburgh (NL) Whitey Ford, New York (AL) July 11, 1961 National (16–14–0 AL) 5–4 (10) Candlestick Park San Francisco Giants 44,115 Stu Miller, San Francisco (NL) Hoyt Wilhelm, Baltimore (AL) July 31, 1961 TIE (16–14–1 AL) 1–1 Fenway Park Boston Red Sox 31,851 N/A N/A N/A July 10, 1962 National (16–15–1 AL) 3–1 D.C. Stadium Washington Senators 45,480 Maury Wills, Los Angeles (NL) Juan Marichal, San Francisco (NL) Camilo Pascual, Minnesota (AL) July 30, 1962 American (17–15–1 AL) 9–4 Wrigley Field Chicago Cubs 38,359 Leon Wagner, Los Angeles (AL) Ray Herbert, Chicago (AL) Art Mahaffey, Philadelphia (NL) July 9, 1963 National (17–16–1 AL) 5–3 Cleveland Stadium Cleveland Indians 44,160 Willie Mays, San Francisco (NL) Larry Jackson, Chicago (NL) Jim Bunning, Detroit (AL) July 7, 1964 National (17–17–1) 7–4 Shea Stadium New York Mets 50,850 Johnny Callison, Philadelphia (NL) Juan Marichal, San Francisco (NL) Dick Radatz, Boston (AL) July 13, 1965 National (18–17–1 NL) 6–5 Metropolitan Stadium Minnesota Twins 46,706 Juan Marichal, San Francisco (NL) Sandy Koufax, Los Angeles (NL) Sam McDowell, Cleveland (AL) July 12, 1966 National (19–17–1 NL) 2–1 (10) Busch Memorial Stadium St. Louis Cardinals 49,936 Brooks Robinson, Baltimore (AL) Gaylord Perry, San Francisco (NL) Pete Richert, Washington (AL) July 11, 1967 National (20–17–1 NL) 2–1 (15) Anaheim Stadium California Angels 46,309 Tony Pérez, Cincinnati Reds (NL) Don Drysdale, Los Angeles (NL) Catfish Hunter, Kansas City (AL) July 9, 1968 National (21–17–1 NL) 1–0 Astrodome Houston Astros 48,321 Willie Mays, San Francisco (NL) Don Drysdale, Los Angeles (NL) Luis Tiant, Cleveland (AL) July 23, 1969 National (22–17–1 NL) 9–3 RFK Stadium Washington Senators 45,259 Willie McCovey, San Francisco (NL) Steve Carlton, St. Louis (NL) Mel Stottlemyre, New York (AL) July 14, 1970 National (23–17–1 NL) 5–4 (12) Riverfront Stadium Cincinnati Reds 51,838 Carl Yastrzemski, Boston (AL) Claude Osteen, Los Angeles (NL) Clyde Wright, California Angels (AL) July 13, 1971 American (23–18–1 NL) 6–4 Tiger Stadium Detroit Tigers 53,559 Frank Robinson, Baltimore (AL) Vida Blue, Oakland (AL) Dock Ellis, Pittsburgh (NL) July 25, 1972 National (24–18–1 NL) 4–3 (10) Atlanta Stadium Atlanta Braves 53,107 Joe Morgan, Cincinnati (NL) Tug McGraw, New York (NL) Dave McNally, Baltimore (AL) July 24, 1973 National (25–18–1 NL) 7–1 Royals Stadium Kansas City Royals 40,849 Bobby Bonds, San Francisco (NL) Rick Wise, St. Louis (NL) Bert Blyleven, Minnesota (AL) July 23, 1974 National (26–18–1 NL) 7–2 Three Rivers Stadium Pittsburgh Pirates 50,706 Steve Garvey, Los Angeles (NL) Ken Brett, Pittsburgh (NL) Luis Tiant, Boston (AL) July 15, 1975 National (27–18–1 NL) 6–3 County Stadium Milwaukee Brewers 51,480 Bill Madlock, Chicago (NL) Jon Matlack, New York (NL) Jon Matlack, New York (NL) Catfish Hunter, New York (AL) July 13, 1976 National (28–18–1 NL) 7–1 Veterans Stadium Philadelphia Phillies 63,974 George Foster, Cincinnati (NL) Randy Jones, San Diego (NL) Mark Fidrych, Detroit (AL) July 19, 1977 National (29–18–1 NL) 7–5 Yankee Stadium New York Yankees 56,683 Don Sutton, Los Angeles (NL) Don Sutton, Los Angeles (NL) Jim Palmer, Baltimore (AL) July 11, 1978 National (30–18–1 NL) 7–3 San Diego Stadium San Diego Padres 51,549 Steve Garvey, Los Angeles (NL) Bruce Sutter, Chicago (NL) Rich Gossage, New York (AL) July 17, 1979 National (31–18–1 NL) 7–6 Kingdome Seattle Mariners 58,905 Dave Parker, Pittsburgh (NL) Bruce Sutter, Chicago (NL) Jim Kern, Texas (AL) July 8, 1980 National (32–18–1 NL) 4–2 Dodger Stadium Los Angeles Dodgers 56,088 Ken Griffey, Sr., Cincinnati (NL) Jerry Reuss, Los Angeles (NL) Tommy John, New York (AL) August 9, 1981 National (33–18–1 NL) 5–4 Cleveland Stadium Cleveland Indians 72,086 Gary Carter, Montreal (NL) Vida Blue, San Francisco (NL) Rollie Fingers, Milwaukee (AL) July 13, 1982 National (34–18–1 NL) 4–1 Olympic Stadium Montreal Expos 59,057 Dave Concepción, Cincinnati (NL) Steve Rogers, Montreal (NL) Dennis Eckersley, Boston (AL) July 6, 1983 American (34–19–1 NL) 13–3 Comiskey Park Chicago White Sox 43,801 Fred Lynn, California (AL) Dave Stieb, Toronto (AL) Mario Soto, Cincinnati (NL) July 10, 1984 National (35–19–1 NL) 3–1 Candlestick Park San Francisco Giants 57,756 Gary Carter, Montreal (NL) Charlie Lea, Montreal (NL) Dave Stieb, Toronto (AL) July 16, 1985 National (36–19–1 NL) 6–1 Hubert H. Humphrey Metrodome Minnesota Twins 54,960 LaMarr Hoyt, San Diego (NL) LaMarr Hoyt, San Diego (NL) Jack Morris, Detroit (AL) July 15, 1986 American (36–20–1 NL) 3–2 Astrodome Houston Astros 45,774 Roger Clemens, Boston (AL) Roger Clemens, Boston (AL) Dwight Gooden, New York (NL) July 14, 1987 National (37–20–1 NL) 2–0 (13) Oakland–Alameda County Coliseum Oakland Athletics 49,671 Tim Raines, Montreal (NL) Lee Smith, Chicago (NL) Jay Howell, Oakland (AL) July 12, 1988 American (37–21–1 NL) 2–1 Riverfront Stadium Cincinnati Reds 55,837 Terry Steinbach, Oakland (AL) Frank Viola, Minnesota (AL) Dwight Gooden, New York (NL) July 11, 1989 American (37–22–1 NL) 5–3 Anaheim Stadium California Angels 64,036 Bo Jackson, Kansas City (AL) Nolan Ryan, Texas (AL) John Smoltz, Atlanta (NL) July 10, 1990 American (37–23–1 NL) 2–0 Wrigley Field Chicago Cubs 39,071 Julio Franco, Texas (AL) Bret Saberhagen, Kansas City (AL) Jeff Brantley, San Francisco (NL) July 9, 1991 American (37–24–1 NL) 4–2 SkyDome Toronto Blue Jays 52,383 Cal Ripken Jr., Baltimore (AL) Jimmy Key, Toronto (AL) Dennis Martínez, Montreal (NL) July 14, 1992 American (37–25–1 NL) 13–6 Jack Murphy Stadium San Diego Padres 59,372 Ken Griffey Jr., Seattle (AL) Kevin Brown, Texas (AL) Tom Glavine, Atlanta (NL) July 13, 1993 American (37–26–1 NL) 9–3 Oriole Park at Camden Yards Baltimore Orioles 48,147 Kirby Puckett, Minnesota (AL) Jack McDowell, Chicago (AL) John Burkett, San Francisco (NL) July 12, 1994 National (38–26–1 NL) 8–7 (10) Three Rivers Stadium Pittsburgh Pirates 59,568 Fred McGriff, Atlanta (NL) Doug Jones, Philadelphia (NL) Jason Bere, Chicago (AL) July 11, 1995 National (39–26–1 NL) 3–2 The Ballpark in Arlington Texas Rangers 50,920 Jeff Conine, Florida (NL) Heathcliff Slocumb, Philadelphia (NL) Steve Ontiveros, Oakland (AL) July 9, 1996 National (40–26–1 NL) 6–0 Veterans Stadium Philadelphia Phillies 62,670 Mike Piazza, Los Angeles (NL) John Smoltz, Atlanta (NL) Charles Nagy, Cleveland (AL) July 8, 1997 American (40–27–1 NL) 3–1 Jacobs Field Cleveland Indians 44,916 Sandy Alomar Jr., Cleveland (AL) José Rosado, Kansas City (AL) Shawn Estes, San Francisco (NL) July 7, 1998 American (40–28–1 NL) 13–8 Coors Field Colorado Rockies 51,267 Roberto Alomar, Baltimore (AL) Bartolo Colón, Cleveland (AL) Ugueth Urbina, Montreal (NL) July 13, 1999 American (40–29–1 NL) 4–1 Fenway Park Boston Red Sox 34,187 Pedro Martínez, Boston (AL) Pedro Martínez, Boston (AL) Curt Schilling, Philadelphia (NL) July 11, 2000 American (40–30–1 NL) 6–3 Turner Field Atlanta Braves 51,323 Derek Jeter, New York (AL) James Baldwin, Chicago (AL) Al Leiter, New York (NL) July 10, 2001 American (40–31–1 NL) 4–1 Safeco Field Seattle Mariners 47,364 Cal Ripken Jr., Baltimore (AL) Freddy García, Seattle (AL) Chan Ho Park, Los Angeles (NL) July 9, 2002 TIE (40–31–2 NL) 7–7 (11) Miller Park Milwaukee Brewers 41,871 N/A N/A N/A July 15, 2003 American (40–32–2 NL) 7–6 U.S. Cellular Field Chicago White Sox 47,609 Garret Anderson, Anaheim (AL) Brendan Donnelly, Anaheim (AL) Éric Gagné, Los Angeles (NL) July 13, 2004 American (40–33–2 NL) 9–4 Minute Maid Park Houston Astros 41,886 Alfonso Soriano, Texas (AL) Mark Mulder, Oakland (AL) Roger Clemens, Houston (NL) July 12, 2005 American (40–34–2 NL) 7–5 Comerica Park Detroit Tigers 41,617 Miguel Tejada, Baltimore (AL) Mark Buehrle, Chicago (AL) John Smoltz, Atlanta (NL) July 11, 2006 American (40–35–2 NL) 3–2 PNC Park Pittsburgh Pirates 38,904 Michael Young, Texas (AL) B. J. Ryan, Toronto (AL) Trevor Hoffman, San Diego (NL) July 10, 2007 American (40–36–2 NL) 5–4 AT&T; Park San Francisco Giants 43,965 Ichiro Suzuki, Seattle (AL) Josh Beckett, Boston (AL) Chris Young, San Diego (NL) July 15, 2008 American (40–37–2 NL) 4–3 (15) Yankee Stadium New York Yankees 55,632 J. D. Drew, Boston (AL) Scott Kazmir, Tampa Bay (AL) Brad Lidge, Philadelphia (NL) July 14, 2009 American (40–38–2 NL) 4–3 Busch Stadium St. Louis Cardinals 46,760 Carl Crawford, Tampa Bay (AL) Jonathan Papelbon, Boston (AL) Heath Bell, San Diego (NL) July 13, 2010 National (41–38–2 NL) 3–1 Angel Stadium of Anaheim Los Angeles Angels of Anaheim 45,408 Brian McCann, Atlanta (NL) Matt Capps, Washington (NL) Phil Hughes, New York (AL) July 12, 2011 National (42–38–2 NL) 5–1 Chase Field Arizona Diamondbacks 49,033 Prince Fielder, Milwaukee (NL) Tyler Clippard, Washington (NL) C. J. Wilson, Texas (AL) July 10, 2012 National (43–38–2 NL) 8–0 Kauffman Stadium Kansas City Royals 40,933 Melky Cabrera, San Francisco (NL) Matt Cain, San Francisco (NL) Justin Verlander, Detroit (AL) July 16, 2013 American (43–39–2 NL) 3–0 Citi Field New York Mets 45,186 Mariano Rivera, New York (AL) Chris Sale, Chicago (AL) Patrick Corbin, Arizona (NL) July 15, 2014 American (43–40–2 NL) 5–3 Target Field Minnesota Twins 41,048 Mike Trout, Los Angeles (AL) Max Scherzer, Detroit (AL) Pat Neshek, St. Louis (NL) July 14, 2015 American (43–41–2 NL) 6–3 Great American Ball Park Cincinnati Reds 43,656 Mike Trout, Los Angeles (AL) David Price, Detroit (AL) Clayton Kershaw, Los Angeles (NL) July 12, 2016 American (43–42–2 NL) 4–2 Petco Park San Diego Padres 42,386 Eric Hosmer, Kansas City (AL) Corey Kluber, Cleveland (AL) Johnny Cueto, San Francisco (NL) July 11, 2017 American (43–43–2) 2–1 (10) Marlins Park Miami Marlins 37,188 Robinson Canó, Seattle (AL) Craig Kimbrel, Boston (AL) Wade Davis, Chicago (NL) July 17, 2018 American (44–43–2 AL) 8–6 (10) Nationals Park Washington Nationals 43,843 Alex Bregman, Houston (AL) Edwin Diaz, Seattle (AL) Ross Stripling, Los Angeles (NL) July 9, 2019 American (45–43–2 AL) 4–3 Progressive Field Cleveland Indians 36,747 Shane Bieber, Cleveland (AL) Masahiro Tanaka, New York (AL) Clayton Kershaw, Los Angeles (NL) July 14, 2020 Game canceled due to a delay in the start of the 2020 season as a result of the COVID-19 pandemic. Game was originally scheduled to be held at Dodger Stadium in Los Angeles, California. July 13, 2021 American (46–43–2 AL) 5–2 Coors Field Colorado Rockies 49,184 Vladimir Guerrero Jr., Toronto (AL) Shohei Ohtani, Los Angeles (AL) Corbin Burnes, Milwaukee (NL) July 19, 2022 American (47–43–2 AL) 3–2 Dodger Stadium Los Angeles Dodgers 52,518 Giancarlo Stanton, New York (AL) Framber Valdez, Houston (AL) Tony Gonsolin, Los Angeles (NL) July 11, 2023 National (47–44–2 AL) 3–2 T-Mobile Park Seattle Mariners 47,159 Elías Díaz, Colorado (NL) Camilo Doval, San Francisco (NL) Félix Bautista, Baltimore (AL) July 16, 2024 Globe Life Field Texas Rangers July 2026 Citizens Bank Park Philadelphia Phillies American League National League Notes Wins 47 44 Ties: 2 (1961, 2002) Runs 383 377 Most total runs: 21 (1998) Category:Major League Baseball Category:All-star games",
 "title": "Major League Baseball All-Star Game"
}