{
 "id": "127457",
 "text": "The Mail on Sunday is a British newspaper. Over six million people read it every week. It was first published in 1982 by Lord Northcliffe. It sells the second biggest amount of Sunday newspapers in Britain afterThe News of the World. The Daily Mail was launched nearly a century before(1896) and is The Mail on Sunday's sister paper. They are both owned by Associated Newspapers, but the editorial staff are completely separate. ==History== The Mail on Sunday was first launched on 2 May 1982, to go with the Daily Mail. The first story ever printed on the front page was the RAF's bombing of Port Stanley airport in the Falklands. The Daily Mail and General Trust(DMGT)came up with some tough targets for the paper to reach. Initially DMGT wanted to sell 1.25 million copies a week. But the launch of The Mail on Sunday was not a success. After six weeks, sales were only around 700,000 copies. Lord Rothermere then brought in the Daily Mail's editor David English (later Sir David). He helped redesign and re-launch The Mail on Sunday. In the first three and a half months, Sir David managed to stop the fall in sales. The circulation then increased to 840,000. Three new sections were introduced: *The first was a sponsored partwork the first of which was a cookery book. *The second was a colour comic supplement (something new to the British Sunday newspaper market). *The third was a magazine called You magazine. Today (2008)the circulation is around 2.3 million, an increase of more than 1.5 million. The newspaper's reputation developed thanks to Stewart Steven. Its circulation grew from around 1 million to almost 2 million during his time in charge. The editor who followed him was Jonathan Holborow and the current editor is Peter Wright. ==Sections== *Financial Mail on Sunday - now incorporated into the main section of the paper, it includes the award winning Financial Mail Enterprise, focusing on small business. *You - You magazine is a women's magazine featured in the Mail on Sunday. 3 million women and 2.3 million men read it every week. *Live - this magazine is aimed at men although it also includes the TV listings section. The main features are columns that well- known people write, such as Piers Morgan. It also has a particular stance towards gadgets, and was criticised for brand favouritism. *Mail on Sunday 2 - this includes review, including articles on the arts, books and culture. *Sportsmail - on the back pages of the Mail. It features a variety of sports and sometimes has an emphasis on alternative sports such as darts and snooker. *Football Mail on Sunday - reviews the Premier League, the Championship and the Football League games from Saturday as well as most international games. ==References== == Other websites == * Mail Online Category:Newspapers published in the United Kingdom Category:1982 establishments in the United Kingdom",
 "title": "The Mail on Sunday"
}