{
 "id": "127988",
 "text": "Premature birth is when a baby is born before the normal end of pregnancy. In humans, a pregnancy normally lasts for about nine months or 266 days. Babies who are born before 37 complete weeks of pregnancy (calculated from the last menstrual period) are said to be premature. In the United States, about 12% of the babies are born prematurely (that is about one in every eight babies).Martin J.A. et al 2006. Births: final data for 2004. National Vital Statistics Reports. 55, #1.National Center for Health Statistics. In 2003, there were over 490,000 premature births. Worldwide rates of prematurity are more difficult to get. In developing countries, there is often no professional medical care for these babies. This makes it difficult to tell how far along the pregnancy really was. For this reason, the World Health Organization tracks rates of low birth weight instead. In 2000, 16.5% of babies born in developing countries were of low birth weight. About one-third of these low birth weight deliveries are due to premature delivery. == Complications == The risk of having a problem (called a complication) is higher in shorter pregnancies. Babies born prematurely die more often in their first year of life than others. Most such deaths occur in the first month of life, which is called neonatal mortality. Worldwide, prematurity causes 10% of neonatal mortality, or around 500,000 deaths per year.Child Health Research Project Special Report.1999. \"Reducing Perinatal and Neonatal Mortality.\" Meeting Report. 3, #1. Baltimore, Maryland. In the U.S., where many infections and other causes of neonatal death have been markedly reduced, prematurity is the leading cause of neonatal mortality at 25%.Mathew T.J. and MacDorman M.F. 2006. Infant mortality statistics from the 2003 periodlLinked birth/infant death data set. National Vital Statistics Reports. 54 #16. Hyattsville, Maryland: National Center for Health Statistics. Prematurely born infants are also at greater risk of developing serious health problems, such as cerebral palsy, chronic lung disease, gastrointestinal problems, mental retardation, vision loss, or hearing loss.March of Dimes. 2006. The Growing Problem of Prematurity They are also more likely to have depression as teenagers.The Age 2004.Depression linked to premature birth. Nearly half of all premature births have no known cause. When conditions permit, doctors may attempt to stop premature labor, so that the pregnancy can have a chance to continue to full term. This will increase the baby's chances of health and survival. In the United States, the rate of premature births has increased 30% in the past two decades.Mayo Clinic 2006. Premature Birth == Special care for babies born early == In developed countries, many hospitals have special facilities for prematurely born infants. This type of hospital unit is usually called a neonatal intensive care unit (NICU, pronounced \"NICK-you\"). In the NICU, premature babies are kept warm in incubators or other warming machines. They are enclosed in plastic with equipment which keeps them warm and keeps germs away from them. Modern neonatal intensive care involves sophisticated measurement of temperature, respiration, heart function, oxygen supply, and brain activity. Treatments may include fluids and nutrition given through intravenous catheters; oxygen, breathing support; and medications. In developing countries, where advanced equipment may not be available or reliable, simple measures such as kangaroo care (skin-to-skin warming), encouraging breastfeeding, and basic infection control measures help reduce death rate and illness. == Chances of survival == The earliest time in the pregnancy where the infant has at least a 50% chance of survival is called the limit of viability. In countries with good health care, viability has been reduced to about 24 weeks. — in particular see TABLE 1 Survival and neurologic disability rates among extremely premature infants Rare survivors have been documented as early as 21 weeks, but this date is controversial because the pregnancy was measured from the date of conception rather than the date of her mother's last menstrual period. This makes gestation appear 2 weeks less than if calculated by the more common method. Risk of brain damage and developmental delay is significant at that early time. Even if the infant lives, there are ethical controversies over the care given to such infants. The limit of viability has also become a factor in the abortion debate. == Related pages == * Birth induction * Mother == References == Category:Pregnancy and childbirth Category:Babies Category:Obstetrics and gynecology",
 "title": "Premature birth"
}