{
 "id": "127980",
 "text": "In Christianity, the Second Coming is a time when Jesus Christ will come back to earth. The Apostles Creed and the Nicene Creed state that \"Christ will come again\". This coming is to judge the living and the dead. Throughout history, there have been different ideas about the details of this event. These disagreements are related to the Millennium which is described in the Book of Revelation as a 1,000 year reign of Christ on the earth. There are four primary views about the return of Jesus Christ among believing Christians. https://www.christianbook.com/four-views-of-the-end- times/9781596364240/pd/364240?srsltid=AfmBOopNAkJyzPGPde3IOP2X9tfxIDK9fV5G9o7yzWH16slEjLgRm6PjSome Christians, called Amillennialists, believe that the millennial reign of Christ began at the cross and will continue until a period of rebellion against God, which will be followed by the final resurrection and judgment of all people and God's eternal kingdom. In this view, the removal of Christians from the earth, the judgment of the wicked, and Christ's literal return are all viewed as one single event. Others, called Postmillennialists think that Jesus will return physically to earth only after Christianity has been predominant for the 1,000 years. This may be a real 1,000 years or an indefinitely long time. This postmillennial view was common among America's Founding Fathers. In recent times, many Christians, especially in the United States, have believed that there will be a Rapture of the Christians. This means that at a certain time all Christians will go up to heaven to be with Jesus. After seven years of trouble on earth, Jesus will return with all the Christians to defeat the Antichrist and rule on earth for 1,000 literal years. Others who believe in the rapture put it at in the middle or at the end of the seven years (the latter view is known as historic premillennialism because many of the Early Church Fathers believed it). These different views come mainly from the Book of Revelation, but other Old Testament and New Testament books, including the Book of Daniel and Jesus' Olivet Discourse in Matthew 24, Mark 13 and Luke 21, are also used to develop the different views. Since the Book of Revelation uses highly symbolic language, it can be understood in different ways. All Christians agree that Jesus Christ will return to earth literally and physically, end all evil, and establish a world order based on righteousness. ==References== ==Related pages== *Acts *Book of Revelation Category:Christian eschatology Category:Jesus",
 "title": "Second Coming"
}