{
 "id": "128035",
 "text": "The Daily Mirror is a British newspaper. Founded in 1903, it became a very popular tabloid in the United Kingdom. Though it is less popular today, the Mirror is still published daily. ==History== ===Creation=== The Daily Mirror was launched on 2 November 1903 by Alfred Harmsworth (later Lord Northcliffe) as a newspaper for women, run by women. Harmsworth intended the newspaper to be \"a mirror of feminine life ... entertaining without being frivolous, and serious without being dull\".Daily Mirror No. 1 (2 November 1903) page 3 Along with women, he invited men to read the paper, which cost one penny. === The Daily Illustrated Mirror === The newspaper was not an immediate success. In 1904, Harmsworth decided to turn it into a pictore newspaper. He changed the header to The Daily Illustrated Mirror and made Hamilton Fyfe editor; Fyfe then fired all the women journalists.Albion (1973) Vol 5, 2-page 150 The paper ran as The Daily Illustrated Mirror from 26 January to 27 April 1904 (issues 72 to 150), then reverted to The Daily Mirror. === The new Daily Mirror === Unlike the old Daily Mirror, the new version's first issue did not have advertisements on the front page. Instead it featured news text and engraved pictures of a traitor and an actress, with the promise of photographs inside.Daily Mirror issue 72, 26 January 1904 Two days later, the price was dropped to one halfpenny, and the tagline \"A paper for men and women\" was added to the newspaper's masthead (header).Daily Illustrated Mirror issue 74, 28 January 1904 This combination was more successful: by issue 92, the guaranteed circulation was 120,000 copies,Daily Illustrated Mirror issue 92, 18 February 1904 and by issue 269, it had grown to 200,000:Daily Mirror issue 269, 13 September 1904 In 1913 Harmsworth sold the newspaper to his brother Harold Harmsworth (called Lord Rothermere beginning in 1914). Four years later, its price increased back to one penny.Daily Mirror issue 4163, 26 February 1917 Circulation continued to grow: in 1919, some issues sold more than 1 million copies a day, making The Daily Mirror the largest daily picture paper in the United Kingdom.Daily Mirror issue 4856, 19 May 1919 === Changes in the 1930s === By the mid 1930s, the Mirror was struggling. With the Mail, it had been a main casualty of the early 1930s circulation war that saw the Daily Herald and the Daily Express establish circulations of more than two million. In response, Rothermere sold his shares in the company. In the late 1930s the paper moved from being a conservative, middle-class newspaper into a left-wing paper for the working class. It became the first British newspaper to adopt the visual style of New York tabloids like the New York Post. By 1939, The Daily Mirror was selling 1.4 million copies a day. === During World War II === The paper was threatened with closure during World War II after Winston Churchill thought one of its cartoons made fun of the British navy. The cartoon showed a sailor clinging to a piece of wreckage. In fact, the cartoon was attacking the waste of petrol and other goods that sailors were trying to bring across the Atlantic while avoiding Nazi Germany's submarines. === The 1950s to 2000 === Thanks to its working-class readership, the Mirror grew into the United Kingdom's best-selling daily tabloid newspaper. In 1960 the Mirror bought Odhams Press, a British publishing company, acquiring the Daily Herald (the popular daily paper of the labour movement). This was one of a series of takeovers which created the International Publishing Corporation (IPC). The Mirror's management did not want the Herald competing with the Mirror for readers. In 1964, they relaunched the Herald as a mid-market paper, now named the Sun. When it failed to win readers, the Sun was sold to Rupert Murdoch — who immediately relaunched it as a more populist and sensationalist tabloid that competed directly with the Mirror. In 1978, the Sun overtook the Mirror in circulation, and in 1984 the Mirror was sold to Robert Maxwell. After Maxwell's death in 1991, the Mirror went through a protracted crisis. Eight years later, it merged with the regional newspaper group Trinity to form Trinity Mirror. Trinity Mirror now prints the daily and Sunday Mirror at Watford and Oldham. ===21st century=== In 2002, the Mirror changed its masthead logo from red to black, because the term \"red top\" is a name for a sensationalist mass-market tabloid. At times the logo was blue. On 6 April 2005, the red top came back. Under then-editor Piers Morgan, the Mirror opposed the 2003 invasion of Iraq and ran many front-page articles that criticized the war. It also gave financial support to the 15 February 2003 anti-war protest, paying for a large screen and providing thousands of placards. On 4 November 2004, after George W. Bush was re-elected as United States President, the Mirror ran a front-page headline titled \"How can 59,054,087 people be so DUMB?\". It gave a list of states and their average IQs, claiming that states which voted for Bush (except Virginia) were below average, while states that voted for Kerry were average or above. The article cited The Economist as the source for this information, while in fact the list was published as a hoax. After Piers Morgan resigned in 2004, Richard Wallace became the paper's editor. He was followed by Peter Willis (2012-2018) and Allison Phillips (2018 - present). In recent years, the paper's circulation has been overtaken by the Daily Mail's. == Editors == :1903-1904: Mary Howarth :1904-1907: Hamilton Fyfe :1907-1915: Alexander Kenealy :1915-1916: Ed Flynn :1916-1931: Alexander Campbell :1931-1934: Leigh Brownlee :1934-1948: Cecil Thomas :1948-1953: Silvester Bolam :1953-1961: Jack Nener :1961-1971: Lee Howard :1971-1974: Tony Miles :1974-1975: Michael Christiansen :1975-1985: Mike Molloy :1985-1990: Richard Stott :1990-1991: Roy Greenslade :1991-1992: Richard Stott :1992-1994: David Banks :1994-1985: Colin Myler :1995-2004: Piers Morgan :2004-2012: Richard Wallace :2012-2018: Peter Willis :2018-present: Allison Phillips Source: Tabloid Nation p. 248\\. == Other websites == * * ==References== Category:Newspapers published in the United Kingdom Category:1903 establishments in the United Kingdom",
 "title": "Daily Mirror"
}