{
 "id": "128139",
 "text": "is a prefecture of Japan in the Kyūshū region of Japan on the island of Kyūshū. The capital city is Saga.Nussbaum, Louis-Frédéric. (2005). \"Saga prefecture\" in Japan Encyclopedia, p. 804; Japan External Trade Organization (JETRO), Saga Prefecture, Regional Information; retrieved 2012-4-6. ==History== The area of Nagasaki Prefecture and Saga Prefecture was formerly called Hizen Province.Nussbaum, \"Provinces and prefectures\" at p. 780. The current name dates from the Meiji Restoration. In the Edo period this area was called the . ===Seven Wise Men of Saga=== \"The Seven Wise Men of Saga\" is the name for seven men from Saga. Each of them was important to the development of modern of Japan. They began changing the country around the end of the Tokugawa Shogunate. They continued modernizing Japan during the Meiji Restoration. * Lord Naomasa Nabeshima was lord of the Nabeshima clan. He brought in European technology and culture. * Sano Tsunetami started the Japanese Red Cross. * Shima Yoshitake explored Hokkaidō. * Soejima Taneomi was a Diet member, Foreign Minister, and Minister of Domestic Affairs. He was also a well-known writer and poet. * Ōki Takatō was Minister of Civil Affairs, Education, and Legal Affairs. He was a Diet member. * Eto Shimpei, also once a Minister of Legal Affairs He was a Diet member and started Japan's system of courts and judges. * Ōkuma Shigenobu was Prime Minister of Japan. He also started Waseda University. ===Timeline=== * November 19, 1274 (Bun'ei 11, 20th day of the 10th month): Battle of Bun'eiDavis, Paul K. (2001). 100 decisive battles: from ancient times to the present, pp. 145-147; the noun \"Bun'ei\" means the Japanese era name (nengō) for a time period started in February 1264 and ended in April 1275 * August 15, 1281 (Kōan 4, 30th day of the 7th month): Battle of KōanDavis, p. 147; the noun \"Kōan\" means the Japanese era name for a time period which started in February 1278 and ended in April 1288. * 1716 Hagakure, a famous Bushido manual is compiled * 1874 (Meiji 7): Saga Rebellion.Nussbaum, \"Saga no Ran\" at Japan Encyclopedia, p. 804. * 1975 (Shōwa 50): Genkai Nuclear Power Plant begins operation \"Saga governor apologizes over remark on Genkai power plant,\" Mainichi Shimbun. 3 August 2011; retrieved 2011-11-19. * 2011 (Heisei 23):Kyūshū Shinkansen opensKyūshū Shinkansen, Information from JR Kyushu ; retrieved 2011-11-19. ==Geography== Saga is the smallest prefecture on Kyūshū. It is bordered by the Genkai Sea and the Tsushima Strait to the north and the Ariake Sea to the south. Nagasaki Prefecture is on its western border. Fukuoka Prefecture and Kumamoto Prefecture are east of Saga. ===Cities=== *Imari *Kanzaki *Karatsu *Kashima *Ogi :*Saga (capital) :*Takeo :*Taku :*Tosu :*Ureshino ===Towns=== *Fujitsu District ::Tara *Higashimatsuura District ::Genkai *Kanzaki District ::Yoshinogari *Kishima District ::Kōhoku ::Ōmachi ::Shiroishi *Miyaki District ::Kamimine ::Kiyama ::Miyaki *Nishimatsuura District ::Arita ===National Parks=== National Parks are established in about 11% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\"; retrieved 2012-3-13. ==Shrines and Temples== Yodohime jinja and Chiriku Hachiman-gū are the chief Shinto shrines (ichinomiya) in the prefecture.Picken, Stuart. (2004). Sourcebook in Shinto: Selected Documents, p. 377; \"Nationwide List of Ichinomiya,\" p. 3 ; retrieved 2012-8-23. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Sagan Tosu * Kyushu Ceramic Museum ==References== ==Other websites== * http://www.pref.saga.lg.jp/web/saga-english.html , * http://www.city.saga.lg.jp/en/ , *SagaJET website",
 "title": "Saga Prefecture"
}