{
 "id": "128231",
 "text": "The July Ultimatum was a demand issued by Austria-Hungary to the Royal Serbian Government at 6 pm on 23 July 1914, after the Assassination of Archduke Franz Ferdinand of Austria. Austria-Hungary's government did not directly accuse Serbia for the assassination but for \"doing nothing to suppress\" the subversive anti-Austro-Hungarian movement in Serbia which grew beyond Serbia's borders and which was responsible for acts of terrorism, assassination attempts and murders. Serbia refused to accept one of the ten items of the ultimatum, and so Austria-Hungary mobilized their army. This, along with a chain of Alliances in Europe (Triple Entente and Central Powers) helped cause World War I. == The Ultimatum Requests == The Ultimatum requested Serbia to pledge itself for the following: # to suppress every publication which shall incite to hatred and contempt of the Monarchy, and the general tendency of which shall be directed against the territorial integrity of the latter; # to proceed at once to the dissolution of the Narodna Odbrana to confiscate all of its means of propaganda, and in the same manner to proceed against the other unions and associations in Serbia which occupy themselves with propaganda against Austria-Hungary; the Royal Government will take such measures as are necessary to make sure that the dissolved associations may not continue their activities under other names or in other forms; # to eliminate without delay from public instruction in Serbia, everything, whether connected with the teaching corps or with the methods of teaching, that serves or may serve to nourish the propaganda against Austria-Hungary; # to remove from the military and administrative service in general all officers and officials who have been guilty of carrying on the propaganda against Austria-Hungary, whose names the Imperial and Royal Government reserves the right to make known to the Royal Government when communicating the material evidence now in its possession; # to agree to the cooperation in Serbia of the organs of the Imperial and Royal Government in the suppression of the subversive movement directed against the integrity of the Monarchy; # to institute a judicial inquiry against every participant in the conspiracy of the twenty-eighth of June who may be found in Serbian territory; the organs of the Imperial and Royal Government delegated for this purpose will take part in the proceedings held for this purpose; # to undertake with all haste the arrest of Major Vojislav Tankosić and of one Milan Ciganović, a Serbian official, who have been compromised by the results of the inquiry; # by efficient measures to prevent the participation of Serbian authorities in the smuggling of weapons and explosives across the frontier; to dismiss from the service and to punish severely those members of the Frontier Service at Schabats and Losnitza who assisted the authors of the crime of Sarajevo to cross the frontier; # to make explanations to the Imperial and Royal Government concerning the unjustifiable utterances of high Serbian functionaries in Serbia and abroad, who, without regard for their official position, have not hesitated to express themselves in a manner hostile toward Austria-Hungary since the assassination of the twenty-eighth of June; # to inform the Imperial and Royal Government without delay of the execution of the measures comprised in the foregoing points. == Russian Memorandum of Advice to Serbia == The Russian Empire asked Austria-Hungaria to extend the ultimatum deadline which would allow the Governments of the Great Powers to become acquainted with and to investigate the documents on the Sarajevo crime. == The Serbian Response == The Royal Government binds itself further: # During the next regular meeting of the Skuptschina to embody in the press laws a clause, to wit, that the incitement to hatred of, and contempt for, the Monarchy is to be most severely punished, as well as every publication whose general tendency is directed against the territorial integrity of Austria-Hungary. It binds itself in view of the coming revision of the constitution to embody an amendment into Art. 22 of the constitutional law which permits the confiscation of such publications as is at present impossible according to the clear definition of Art. 12 of the constitution. # The Government possesses no proofs and the note of the I. and R. Government does not submit them that the society _Narodna_ _Odbrana_ and other similar societies have committed, up to the present, any criminal actions of this manner through any one of their members. Notwithstanding this, the Royal Government will accept the demand of the I. and R. Government and dissolve the society _Narodna_ _Odbrana_, as well as every society which should set against Austria-Hungary. # The Royal Serbian Government binds itself without delay to eliminate from the public instruction in Serbia anything which might further the propaganda directed against Austria-Hungary provided the I. and R. Government furnishes actual proofs of this propaganda. # The Royal Government is also ready to dismiss those officers and officials from the military and civil services in regard to whom it has been proved by judicial investigation that they have been guilty of actions against the territorial integrity of the Monarchy; it expects that the I. and R. Government communicate to it for the purpose of starting the investigation the names of these officers and officials, and the facts with which they have been charged. # The Royal Government confesses that it is not clear about the sense and the scope of that demand of the I. and R. Government which concerns the obligation on the part of the Royal Serbian Government to permit the cooperation of officials of the I. and R. Government on Serbian territory, but it declares that it is willing to accept every cooperation which does not run counter to international law and criminal law, as well as to the friendly and neighbourly relations. # The Royal Government considers it its duty as a matter of course to begin an investigation against all those persons who have participated in the outrage of June 28th and who are in its territory. As far as the cooperation in this investigation of specially delegated officials of the I. and R. Government is concerned, this cannot be accepted, as this is a violation of the constitution and of criminal procedure. Yet in some cases the result of the investigation might be communicated to the Austro-Hungarian officials. # The Royal Government has ordered on the evening of the day on which the note was received the arrest of Major Voislar Tankosic. However, as far as Milan Ciganovitch is concerned, who is a citizen of the Austro- Hungarian Monarchy and who has been employed till June 28th with the Railroad Department, it has as yet been impossible to locate him, wherefore a warrant has been issued against him. The I. and R. Government is asked to make known, as soon as possible for the purpose of conducting the investigation, the existing grounds for suspicion and the proofs of guilt, obtained in the investigation at Sarajevo. # The Serbian Government will amplify and render more severe the existing measures against the suppression of smuggling of arms and explosives. It is a matter of course that it will proceed at once against, and punish severely, those officials of the frontier service on the line Shabatz-Loznica who violated their duty and who have permitted the perpetrators of the crime to cross the frontier. # The Royal Government is ready to give explanations about the expressions which its officials in Serbia and abroad have made in interviews after the outrage and which, according to the assertion of the I. and R. Government, were hostile to the Monarchy. As soon as the I. and R. Government points out in detail where those expressions were made and succeeds in proving that those expressions have actually been made by the functionaries concerned, the Royal Government itself will take care that the necessary evidences and proofs are collected. # The Royal Government will notify the I. and R. Government, so far as this has not been already done by the present note, of the execution of the measures in question as soon as one of those measures has been ordered and put into execution. ==References== Category:1914 in Europe Category:1910s in Austria Category:20th century in Hungary Category:20th century in Serbia Category:World War I",
 "title": "July Ultimatum"
}