{
 "id": "128229",
 "text": "Van Diemen's Land was the name used by Europeans for Tasmania before it was known it was an island. Tasmania is now a state of Australia. The Dutch explorer Abel Tasman was the first European to chart some coasts of Tasmania. He named the land Anthoonij van Diemenslandt after Anthony van Diemen, the Governor-General of the Dutch East Indies. Van Diemen had sent Tasman to explore the extent of the presumed south land in 1642. In 1803, the island was settled by the British as a penal colony. It was called Van Diemen's Land, and became part of the British colony of New South Wales. In 1824, Van Diemen's Land became an independent colony with George Arthur as the first Governor. In 1856 Britain changed the name to Tasmania, an alternative name that had been shown on some maps and used by the community for decades. It was formally changed at the request of its citizens. Britain also gave the colony the right to govern itself. Later that year it had its own parliament. ==Penal colony== From the 1830s to 1853, Van Diemen's Land was the main penal colony in Australia. When Britain stopped sending prisoners to New South Wales, all convicts were sent to Van Diemen's Land. About 75,000 convicts were sent to Van Diemen's Land, approximately 40% of all convicts sent to Australia. Male convicts got paid for being servants or farm workers to free settlers, or in work groups on public works. Only the most difficult convicts were sent to the Tasman Peninsula prison known as Port Arthur. Convicts who committed more crimes were also sent there. Female convicts worked as servants in free settler's houses or were sent to a female factory (women's workhouse prison). There were 5 female factories in Van Diemen's Land. Convicts who had finished their time in prison or had been well behaved and given a ticket-of-leave often left Van Diemen's Land. Many went to the new free colony of Victoria. The free settlers in towns such as Melbourne did not like the ex-convicts coming to their town. During the Victorian gold rush a lot of settlers from Van Diemen's Land (called Vandemonians) went to the Victorian gold fields, such as Ballarat, or Bendigo. Britain stopped sending convicts to Tasmania in 1853. ==The name== Anthony Trollope used the word Vandemonian:quoted by Patsy Adam Smith p.248 of Smith, Patsy Adam and Woodberry, Joan (1977)Historic Tasmania Sketchbook Rigby > They are (the Vandemonians) united in their declaration that the cessation > of the coming of convicts has been their ruin > (The Vandemonians agree that stopping the convicts from coming has made them > poor) Because the name Van Diemen's Land was seen to be tied up with convicts and it sounded like the word \"demon\", the citizens petitioned the name change, which was granted in 1855: effective 1 January 1856. It was called Tasmania after Abel Tasman. The last penal settlement in Tasmania at Port Arthur finally closed in 1877.Australian Government, National Heritage site. Port Arthur Historic Site ==Popular culture== ===Music=== * Van Diemen's Land is mentioned in the Australian folk song \"The Wild Colonial Boy\". * Van Diemen's Land is often mentioned in the music of Flogging Molly, such as in the song \"Every Dog Has Its Day.\" * Irish folk songs that mention Van Diemen's Land are \"The Black Velvet Band\", \"Back Home in Derry\", and \"Van Diemen's Land\". * \"Van Diemen's Land\", also called \"The Gallant Poachers\", is a traditional English folk song, and also a traditional Scottish one as well. * Steeleye Span sings the traditional English folk song on their album They Called Her Babylon * \"Van Diemen's Land\" is the name of the second song from the rock band U2's album Rattle and Hum. The words were written and sung by The Edge. The song remembers a Fenian poet named John Boyle O'Reilly. He was sent to Australia because of his poetry.From the liner notes on the U2 album \"Rattle and Hum\" *The chorus to the English folk song \"Maggie May\" says \"They've sent you to Van Diemen's cruel shore.\" *Van Diemen's Land is mentioned in the Irish song, \"Back home in Derry\". The music was written by Canadian song writer Gordon Lightfoot and the words by the famous Irish Republican Bobby Sands. It is was sung by the Irish singer Christy Moore. *Shirley Collins and the Albion Country Band record a version of \"Van Diemen's Land\" on the album No Roses (1971) *Carla Bruni sings the poem 'If You Were Coming In The Fall', by Emily Dickinson on her album No Promises. The song mentions Van Diemen's land: \"subtracting till my fingers dropped; into Van Diemen's Land\". ===Books=== *Gould's Book of Fish: A Novel in Twelve Fish by Richard Flanagan (published 2002). It tells the story of a convict who is sent to Van Diemen's Land. He gets into trouble with the local (and crazy) people in charge. *Cormac McCarthy's book Blood Meridian, has a character, a \"Vandiemenlander\" named Bathcat, in 1850s Mexico. *In Edgar Allan Poe's book Narrative of A. Gordon Pym the main character stops at Van Diemen's Land on his way to the South Pole. *Van Diemen's Land is mentioned in Umberto Eco's book \"The Island of the Day Before\" (\"L'isola del giorno prima\", 1994), a story about a 17th century Italian trapped at an island at the International Date Line. *Van Diemen's Land is mentioned in Emily Dickinson's \"If You Were Coming in the Fall\" *\"The Potato Factory\" by Bryce Courtenay (1995): uses a quote from Emily Dickinson's Poem \"If You Were Coming In The Fall\". *In Gulliver's Travels by Jonathan Swift (1726), the country of Lilliput is said to be “to the north-west of Van Dieman's Land” [sic]. *In the book The Convicts by Iain Lawrence, young Tom Tin is sent to Van Diemen's Land on charges of murder. *In James De Mille's A Strange Manuscript Found in a Copper Cylinder, a manuscript (letter) has been written by British sailor who lost his way after taking convicts to Van Dieman's Land. *The Terror by Dan Simmons (2007), a book about the trip by HMS Erebus and HMS Terror to discover the Northwest Passage. The ships left England in May 1846 and were never heard from again. Van Diemen's Land is mentioned in the chapters about Francis Crozier. *In Peter Carey's book, True History of the Kelly Gang, Van Diemen's Land is the place where Ned Kelly's parents suffered on their way to Victoria. *English Passengers by Matthew Kneale (2000) tells the story of 3 mad English men. In 1857 they set sail for Van Diemen's Land looking for the Garden of Eden. *Christopher Koch's novel \"Out of Ireland\" tells what being a convict in Van Dienem's Land was like. *Wild Orchards by Isabel Dick (1955) tells the story of a young Englishwoman who marries a man from Van Dieman’s Land (Tasmania) and their struggles to build a home in the wilderness, with some history of the ill treatment of the aboriginal population and the difficulties ensuing from England’s use of the island as a penal colony. ==Related pages== * Tasmania * Abel Tasman * Port Arthur, Tasmania ==Notes== ==References== * Alexander, Alison (editor) (2005)The Companion to Tasmanian History. Centre for Tasmanian Historical Studies, University of Tasmania, Hobart. . * Robson, L.L. (1983) A history of Tasmania. Volume 1. Van Diemen's Land from the earliest times to 1855 Melbourne, Oxford University Press. . * Robson, L.L. (1991) A history of Tasmania. Volume II. Colony and state from 1856 to the 1980s Melbourne, Oxford University Press. . ==Other websites== * Constitution Act 1855, starting an elected parliament in the colony Category:History of Tasmania Category:Former colonies in Oceania",
 "title": "Van Diemen's Land"
}