{
 "id": "128474",
 "text": "Tinker Bell is a Disney movie based on the character from Peter Pan. It was released on DVD and Blu-ray Disc on October 28, 2008. Unlike the other two Disney movies of Peter Pan, this movie was animated completely using computer animation. This was also the first time that the Disney version of Tinker Bell talked. The original name of the movie was Tinker Bell and the Ring of Belief. The movie was directed by Bradley Raymond.\"Director Frank Nissen on Cinderella III\". Animated-Views.com. January 23, 2007. Retrieved January 28, 2007. == Cast == * Mae Whitman as Tinker Bell * Raven-Symone as IridessaFirst Look: 'Tinker Bell' will fly solo, straight to DVD, USA Today, May 28, 2008 * America Ferrera as Fawn * Lucy Liu as Silvermist * Kristin Chenoweth as Rosetta * Anjelica Huston as Queen Clarion * Jesse McCartney as Terrence * Pamela Adlon as Vidia * Kathy Najimy as the Minister of Summer * Rob Paulsen as Bobble * Jane Horrocks as Fairy Mary * Steve Valentine as the Minister of Spring * Jeff Bennett as Clank * Richard Portnow as the Minister of Autumn * America Young as Wendy Darling * Gail Borges as the Minister of Winter * Cameron Bowen * Zach Shada * Loreena McKennitt as the Narrator == Soundtrack == The movie's soundtrack was released on October 14, 2008, a week before the DVD release and contains songs from and inspired by the movie. # \"To the Fairies They Draw Near\" - Lorena McKennitt # \"Fly to Your Heart\" - Selena Gomez # \"How to Believe\" - Ruby Summer # \"Let Your Heart Sing\" - Katharine McPhee # \"Be True\" - Jonatha Brooke # \"To the Fairies They Draw Near, Part II\" - Lorena McKennitt # \"Shine\" - Tiffany Giardina # \"Fly With Me\" - Kari Kimmell # \"Wonder of It All\" - Scottie Haskell # \"End Credit Score Suite\" - Joel McNeely == Video game == Disney Fairies: Tinker Bell is an adventure game loosely based on the movie. == Release == In April 2008, Disney announced that the movie would be released on DVD and Blu-ray Disc on October 28, 2008.http://corporate.disney.go.com/news/corporate/2008/2008_0408_animation_roll_out.html Disney Animation plans 2008-2012 Contrary to the previous announcement of the suspension of direct-to-video sequels, they also announced three direct-to-DVD sequels to follow this movie, also digitally animated: * Tinker Bell and the Lost Treasure (fall 2009) * Tinker Bell: A Midsummer Storm (working title, summer 2010) * Tinker Bell: A Winter Story (working title, summer 2011) The movie saw an exclusive theatrical release at the El Capitan Theatre between September 19 and October 2nd. It was also premiered on Disney Channel in November as part of \"New in November.\" == References == == Other websites == * * Category:2008 movies Category:Disney animated movies Category:Disney direct- to-video movies Category:Direct-to-video movies",
 "title": "Tinker Bell (movie)"
}