{
 "id": "12848",
 "text": "Volkswagen (VW; )English: , . is a car company from Germany. The word volkswagen means \"People's car\" in German. Its headquarters are in Wolfsburg, Lower Saxony. It was started in the 1930s, at the request of the country's leader, Adolf Hitler, to produce a car designed by Ferdinand Porsche. 1935 == History == In the 1930s Adolf Hitler was looking for someone who could make a cheap car that the common German worker could afford. At the same time, Ferdinand Porsche had been working for years on a cheap car that could hold a family and would drive like a real car, not a micro car. He had already designed and built small cars with rear engines and shaped like a beetle (for better aerodynamics). At this time, owning a car in Germany was something only for the rich people, and most car companies were not interested in making a low-cost car. Porsche's company, also called Porsche, only made designs for others at that time. So Porsche could not find anyone to make the small car that he wanted. Though Hitler never learned to drive, he was very interested in cars (he also created the autobahn, which led to the U.S. interstate highways). Hitler wanted the car to hold four people. It was to be cooled by oil instead of water. The car needed to be able to travel at least 100 km/h, or about 60 mph, and use no more than 7 liters of gasoline for 100 kilometers (about 34 mpg). The car companies in Germany at the time didn't want to make this new low-cost car, so Hitler formed a new company, run by the government. The first name given to the car was \"KdF-Wagen.\" \"KdF\" stood for Kraft durch Freude, or \"Strength through Joy.\" Some were made, but by the time the factory was finished in 1938, World War II started. The factory then built jeep-like cars for the German military instead. After the war, people from the United Kingdom and the United States reopened the factory and started making cars again. The factory was in ruins from the war and could only make a few cars at a time. The British military were in charge of this section of Germany. At first they tried to find another car company to rebuild the factory. Henry Ford was offered the company for free. After looking it over, his adviser said \"Mr. Ford, what we are being offered here is not worth a damn!\" So the Volkswagen company went ahead by itself to make the car. The man who led the Volkswagen company during this time was Heinz Nordhoff. At first they only made one type of car, the Volkswagen Beetle. (It was simply called the Type 1 Sedan by the company, it also had the nickname \"Bug\" in the U.S. and other nicknames elsewhere). In 1950, the Type 2 (the bus) was introduced, also built with an engine in the back of the vehicle. The cars became popular and well- known all over the world. The Beetle later became one of the best selling cars in history. It was built for many years afterward in factories in Germany, Brazil and Mexico. The last original Volkswagen Beetle to be built was built in Mexico. It was built in July 2003. Volkswagen has a new car called the \"New Beetle.\" which began selling in 1997, It looks like the old car, but is built quite differently. It is faster, safer, and has an engine in the front, not the back, and is water-cooled (using a radiator). It is much more suited to today's modern world in terms of design and security. Volkswagen is currently involved in an emissions test scandal. In November 2024 workers at Volkswagen's Osnabrück plant in Germany threatened strike action as part of ongoing regional protests over wage disputes. The strikes were organized by the IG Metall union. The plant, reportedly a potential target for closure under Volkswagen's restructuring and cost-cutting plans, operates under unique labor contract terms allowing strikes before December, unlike other Volkswagen plants in western Germany. IG Metall has called for a 7% wage increase, contrasting with an offer of a 3.6% raise over 27 months from employers' associations, who have described the union's demands as unrealistic. == Recent vehicles == Some of Volkswagen's popular cars are the Golf, Jetta, Polo,Beetle and the Passat. VW's as they are commonly known, have also entered the off-road segment with cars like the Touarag, and the commercial segment with the Touran. This year sees VW's 21st anniversary since the Golf 1 went on sale in the 1980s. Since its birth VW has sold over 315,000 units of the Golf 1 alone. 2006 saw the entry of the fifth generation of the Golf. The flagbearer - the GTI - is powered by a 147Kw 2.0l 4 cylinder turbo charged engine,with VW DSG and FSI technology. The Golf GTI has evolved a long way since the 80's but the fifth generation GTI is criticised by some as it does not live up to the expectations and standards set by the legendary Mk1 GTI, which was fitted with an 1600, 8 valve motor. == Passenger vehicles == Body style Model Current generation Platform Vehicle description Image Name(s) Introduction ( year) Introduction Main markets Hatchback Golf 1974 2019 Global MQB Evo C-segment hatchback. ID.3 2019 2019 Europe and China MEB Battery electric C-segment hatchback. Polo 1975 2009 Global (except North America and India) PQ26 B-segment hatchback or supermini. Two generations (Mk5 and Mk6) are currently produced alongside each other for certain markets. 2017 MQB A0 Sedan/ liftback Arteon 2017 2017 Global (except India) MQB D-segment fastback or four-door coupe. Successor to the Volkswagen CC. 180px Bora 1999 2018 China MQB Sister model to the Lavida. Exclusively manufactured by FAW-Volkswagen. ID.7 2023 2023 Europe, China and North America MEB Battery electric D-segment liftback. Built above a dedicated vehicle platform MEB platform. Jetta/ Sagitar/ Vento 1979 2018 Americas, China and Middle East (except Turkiye and Israel) MQB A1 Compact sedan (C-segment). Historically a sedan version of the Golf. Sold as the Vento in Argentina and Uruguay. The Sagitar is the Chinese version of the Jetta with longer wheelbase. Polo 2020 2020 Central Asia PQ25 Based on the Škoda Rapid. Only produced between 2020 and 2022 but stock is continued to be offered outside of Russia. Lamando 2014 2022 China MQB Evo A four-door coupe or a low-roof sedan for the Chinese market in the same segment as the Sagitar. Exclusively manufactured by SAIC-Volkswagen. Lavida 2008 2018 China MQB A1 Sister model to the Bora. Has been Volkswagen's best selling model in China and typically the best selling sedan of all brands in China. Exclusively manufactured by SAIC-Volkswagen. Magotan 2005 2024 China MQB Evo The Chinese version of the Passat B9 with a longer wheelbase. Passat 1973 2024 China MQB Evo A sedan developed for the Chinese market, different from the European Passat. Exclusively manufactured by SAIC-Volkswagen. Virtus / Polo Sedan / Lavida XR 2017 2017 Latin America, India and China MQB A0 Sedan version of the Polo Mk6. Currently produced and marketed in Latin America, India, Central Asia and China. Station wagon Arteon Shooting Brake 2020 2020 Europe, China and others MQB Shooting brake version of the Arteon. Golf Variant/ Sportwagen 1993 2020 Europe, etc. MQB Evo Station wagon version of the Golf. The Alltrack model being the crossover-inspired version. ID.7 Tourer 2024 2024 Europe MEB Station wagon version of the ID.7. Passat 1973 2023 Europe, Turkiye and Israel MQB Evo The European market Passat, only available as a station wagon since 2023. Crossover SUV Atlas/ Teramont 2017 2017 Americas, Middle East (except Turkiye and Israel) and China MQB Three-row mid-size crossover SUV for the North American and Chinese markets. Also sold in select other LHD markets including Latin America and Middle East. Atlas Cross Sport / Teramont X 2019 2019 Americas and China MQB Two-row versions of the regular Atlas/Teramont with a sloping rear roof. ID.4 2020 2020 Global MEB C-segment full-electric crossover SUV built above a dedicated electric vehicle platform (MEB platform). ID.5 2021 2021 Europe, Australasia and some others MEB Coupe crossover SUV version of the ID.4. ID.6 2021 2021 China MEB Three-row D-segment full-electric crossover SUV built above a dedicated electric vehicle platform (MEB platform). ID. UNYX 2024 2024 China MEB C-segment full-electric crossover SUV, rebadged Cupra Tavascan with minor cosmetic changes, only sold in China. T-Cross/ Tacqua/ Taigun/ Tharu XR 2019 2019 Global (except North America) MQB A0 B-segment crossover SUV built above the MQB A0 platform. Global product but not sold in North America. T-Roc 2017 2017 Europe, China, Turkiye, Israel and others MQB A1 C-segment crossover SUV. Mainly available in Europe and China, but also sold in Turkiye and Israel. Taos/Tharu 2018 2018 China and Americas MQB A1 Compact crossover SUV (C-segment) built above the MQB A1 platform. Related to the Jetta VS5, SEAT Ateca and Škoda Karoq. Called the Tharu in China and Taos in the Americas. Tera 2025 2025 Latin America and India MQB A0 IN Subompact crossover SUV (B-segment) built above the MQB A0 IN Taigo/Nivus 2020 2020 Europe, Turkiye, Israel, South Africa and Latin America MQB A0 Low-slung crossover SUV heavily based on the Polo Mk6. It is badged Taigo in Europe and Nivus in Brazil. Talagon 2021 2021 China MQB Evo Three-row full-size crossover SUV for the Chinese market above the Tavendor. Exclusively manufactured by FAW-Volkswagen. Tavendor 2022 2022 China MQB Evo Two-row full-size crossover SUV for the Chinese market below the Talagon. Exclusively manufactured by FAW- Volkswagen. Tayron 2018 2018 China MQB A2 Sister model to the Tiguan. Exclusively manufactured by FAW-Volkswagen. 2024 Global MQB Evo Mid-Size crossover SUV. Successor to the Tiguan Allspace. Tayron X 2020 2020 China MQB A2 Coupe crossover SUV version of the Tayron. Tiguan 2008 2023 Global MQB Evo Compact crossover SUV (C-segment) built on the MQB A2 platform. Tiguan X 2020 2020 China MQB A2 Coupe crossover SUV version of the Tiguan. Exclusively manufactured by SAIC-Volkswagen. Touareg 2002 2018 Global (except North America, Japan and India) MLB Evo First crossover SUV ever built by Volkswagen. A flagship luxury SUV model built above the MLB Evo platform. MPV minivan Caddy Life 2007 2020 Europe, Turkiye, Israel and others MQB Passenger version of the Caddy. Caravelle 1950 2024 Europe, Turkiye, Israel and others Ford Pro D-segment/Large MPV based on the Ford Transit Custom (since 2024), passenger variant of the Transporter. ID. Buzz 2022 2022 Europe, Turkiye, Israel, North America and others MEB Battery electric minivan built above the MEB platform. Multivan 1990 2021 Europe, Turkiye, Israel and others MQB Evo D-segment/Large MPV based on MQB Evo, previously based on Transporter. Touran 2003 2015 Europe, Turkiye, Israel and Japan MQB Three-row compact MPV. Currently being phased out in several markets. Viloran 2020 2020 China MQB A2 Three-row full-size minivan with sliding doors for the Chinese market. Exclusively manufactured by SAIC-Volkswagen. === Volkswagen Commercial Vehicles === Body style Model Current generation Platform Vehicle description Image Name(s) Introduction ( year) Introduction Main markets Van Caddy 1990 2020 Europe, etc. MQB Leisure activity vehicle or small van. Available as a windowed van (Caddy Life) or panel van. Caddy California 2020 2020 Europe, etc. MQB Campervan based on the Caddy. California 1989 2024 Europe, etc. MQB Evo Campervan based on the T7 Multivan. Grand California 2019 2019 Europe, etc. MNB (Modular Light Commercial Vehicle platform) Campervan based on the Crafter. Crafter 2006 2017 Europe, etc. MNB (Modular Light Commercial Vehicle platform) Large van. Also sold as the MAN TGE. ID. Buzz Cargo 2022 2022 Europe, etc. MEB Panel van version of ID. Buzz. Transporter 1949 2024 Europe, etc. Ford Pro Mid-size van. Available as a panel van. Pickup truck Amarok 2010 2010 Latin America Unknown Mid-size pickup truck. First and second generations are currently produced alongside each other for certain markets. 2022 Europe, Australia and Africa Ford T6 Saveiro 1983 2023 Latin America PQ24 Compact pickup truck based on the Gol. == Former models == ===Aircooled models=== * Volkswagen 181 (1961–1983, also sold as Kurierwagen, Trekker, Thing, Safari) * Volkswagen 411/412 (Type 4) (1967–1973) * Volkswagen 1500/1600 (Type 3) (1961–1973) * Volkswagen Beetle (Type 1) (1938–2003) * Volkswagen Brasília (1973–1982) * Volkswagen Country Buggy (1967–1969) * Volkswagen Gacel (1983–1991) * Volkswagen Hebmüller Cabriolet (1949–1953) * Volkswagen Karmann Ghia (1955–1974, also sold as Type 34 Karmann Ghia, 1500 Karmann Ghia Coupe) * Volkswagen Kommandeurswagen (1941–1944) staff car for Wehrmacht * Volkswagen Kübelwagen (1940–1945) light military vehicle * Volkswagen Schwimmwagen (1942–1944) * Volkswagen Senda (1991–1994) * Volkswagen SP1/SP2 (1973–1976) * Volkswagen Type 18A (1949–?) * Volkswagen Type 147 Kleinlieferwagen (1964–1974) * Volkswagen-Porsche 914 (1969–1976, also sold as Porsche 914) ===Watercooled models=== * Volkswagen Ameo (2016–2020) * Volkswagen Apollo (1990–1992) * Volkswagen Atlantic (1981–1984) * Volkswagen Beetle (2011–2019) * Volkswagen C-Trek (2016–2018) * Volkswagen Cabrio (1979–2002) * Volkswagen Cabriolet (1979–2002) * Volkswagen Carat (1987–1991) * Volkswagen Caribe (1977–1987) * Volkswagen Citi Golf (1984–2009) * Volkswagen Clásico (2010–2014) * Volkswagen Corrado (1988–1995) * Volkswagen Corsar (1984–1988) * Volkswagen Dasher (1974–1982) * Volkswagen Derby (1977–1985), (1995–2009, also sold as Polo Classic) * Volkswagen Eos (2006–2016) * Volkswagen Fox (2003–2021) * Volkswagen Gol (1980–2023) * Volkswagen Golf Plus (2004–2014) * Volkswagen Golf Sportsvan (2014–2020) * Volkswagen Iltis (1978–1988) * Volkswagen Jetta King (1997–2010) * Volkswagen Jetta Pioneer (2010–2013) * Volkswagen K70 (1968–1972) * Volkswagen Logus (1993–1997) * Volkswagen Lupo (1998–2005) * Volkswagen New Beetle (1997–2011) * Volkswagen New Jetta (2013–2020) * Volkswagen Parati (1982–2013) * Volkswagen Passat NMS (2011–2022) * Volkswagen Passat Lingyu (2005–2011) * Volkswagen Phaeton (2002–2016) * Volkswagen Phideon (2016–2023) * Volkswagen Pointer (1994–1996) * Volkswagen Polo Playa (1996–2006) * Volkswagen Polo (Russia) (2020–2022) * Volkswagen Quantum (1982–1988) * Volkswagen Rabbit (1975–1984) * Volkswagen Routan (2008–2014) * Volkswagen Scirocco (1974–2017) * Volkswagen Sharan (1995–2022) * Volkswagen SpaceCross (2014–2019) * Volkswagen Santana (1981–2022) * Volkswagen Suran/SpaceFox (2006–2019) * Volkswagen Taro (1989–1997) * Volkswagen Tiguan Allspace (2018–2024) * Volkswagen Vento/Polo Sedan (2010–2022) * Volkswagen Voyage (1983–2023) * Volkswagen Up (2011–2023) * Volkswagen XL1 (2015–2016) == References == == Other websites == * Volkswagen Global * Volkswagen Germany (in German) * Volkswagen México - History * Volkswagen USA official website Category:Volkswagen Category:Wolfsburg",
 "title": "Volkswagen"
}