{
 "id": "128406",
 "text": "The 1975–76 NHL season was the 59th season of the National Hockey League. Eighteen teams each played 80 games. The Montreal Canadiens set records in wins with 58 and points with 127, beginning a four-year stretch where they would dominate the league in the regular season and win four straight Stanley Cup titles. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes Note: Teams that qualified for the playoffs are highlighted in bold ====Prince of Wales Conference==== Adams Division GP W L T Pts GF GA PIM Boston Bruins 80 48 15 17 113 313 237 1195 Buffalo Sabres 80 46 21 13 105 339 240 943 Toronto Maple Leafs 80 34 31 15 83 294 276 1368 California Golden Seals 80 27 42 11 65 250 278 1058 Norris Division GP W L T Pts GF GA PIM Montreal Canadiens 80 58 11 11 127 337 174 977 Los Angeles Kings 80 38 33 9 85 263 265 1022 Pittsburgh Penguins 80 35 33 12 82 339 303 1004 Detroit Red Wings 80 26 44 10 62 226 300 1922 Washington Capitals 80 11 59 10 32 224 394 951 ====Clarence Campbell Conference==== Patrick Division GP W L T Pts GF GA PIM Philadelphia Flyers 80 51 13 16 118 348 209 1980 New York Islanders 80 42 21 17 101 297 190 1277 Atlanta Flames 80 35 33 12 82 262 237 928 New York Rangers 80 29 42 9 67 262 333 911 Smythe Division GP W L T Pts GF GA PIM Chicago Black Hawks 80 32 30 18 82 254 261 944 Vancouver Canucks 80 33 32 15 81 271 272 1122 St. Louis Blues 80 29 37 14 72 249 290 1274 Minnesota North Stars 80 20 53 7 47 195 303 1191 Kansas City Scouts 80 12 56 12 36 190 351 984 ===Scoring leaders=== Note: GP = Games played; G = Goals; A = Assists; Pts = Points Player Team GP G A Pts PIM Guy Lafleur Montreal Canadiens 80 56 69 125 36 Bobby Clarke Philadelphia Flyers 76 30 89 119 136 Gilbert Perreault Buffalo Sabres 80 44 69 113 36 Bill Barber Philadelphia Flyers 80 50 62 112 104 Pierre Larouche Pittsburgh Penguins 76 53 58 111 33 Jean Ratelle Boston Bruins / New York Rangers 80 36 69 105 18 Pete Mahovlich Montreal Canadiens 80 34 71 105 76 Jean Pronovost Pittsburgh Penguins 80 52 52 104 24 Darryl Sittler Toronto Maple Leafs 79 41 59 100 90 Syl Apps, Jr. Pittsburgh Penguins 80 32 67 99 24 ==Stanley Cup playoffs== ===Playoff bracket=== ===Finals=== The two-time defending Stanley Cup Champions, the Philadelphia Flyers, once again made it to the finals, but lost in four games to the Montreal Canadiens. Montreal Canadiens vs. Philadelphia Flyers Date Visitors Score Home Score Notes May 9 Philadelphia 3 Montreal 4 May 11 Philadelphia 1 Montreal 2 May 13 Montreal 3 Philadelphia 2 May 16 Montreal 5 Philadelphia 3 ==NHL awards== Prince of Wales Trophy: Montreal Canadiens Clarence S. Campbell Bowl: Philadelphia Flyers Art Ross Memorial Trophy: Guy Lafleur, Montreal Canadiens Bill Masterton Memorial Trophy: Rod Gilbert, New York Rangers Calder Memorial Trophy: Bryan Trottier, New York Islanders Conn Smythe Trophy: Reggie Leach, Philadelphia Flyers Hart Memorial Trophy: Bobby Clarke, Philadelphia Flyers Jack Adams Award: Don Cherry, Boston Bruins James Norris Memorial Trophy: Denis Potvin, New York Islanders Lady Byng Memorial Trophy: Jean Ratelle, New York Rangers/Boston Bruins Lester B. Pearson Award: Guy Lafleur, Montreal Canadiens NHL Plus/Minus Award: Bobby Clarke, Philadelphia Flyers Vezina Trophy: Ken Dryden, Montreal Canadiens Lester Patrick Trophy: Stan Mikita, George A. Leader, Bruce A. Norris ===All-Star teams=== First Team Position Second Team Ken Dryden, Montreal Canadiens G Glenn Resch, New York Islanders Denis Potvin, New York Islanders D Borje Salming, Toronto Maple Leafs Brad Park, Boston Bruins D Guy Lapointe, Montreal Canadiens Bobby Clarke, Philadelphia Flyers C Gilbert Perreault, Buffalo Sabres Guy Lafleur, Montreal Canadiens RW Reggie Leach, Philadelphia Flyers Bill Barber, Philadelphia Flyers LW Rick Martin, Buffalo Sabres ==References== *Hockey Database *NHL.com Category:1976 in North America Category:National Hockey League seasons",
 "title": "1975–76 NHL season"
}