{
 "id": "128823",
 "text": "Last of the Summer Wine is a British sitcom. It ran longer than any other comedy show in the UK and longer than any other sitcom in the world. It airs on the television channel BBC One. Roy Clarke writes the show and Alan J. W. Bell produces and directs it. It started as an episode of the television show Comedy Playhouse and originally aired on 4 January 1973. The first series of episodes started airing on 12 November 1973. The show had broadcast its 30th series in 2009 and the 31st and final series was shown in 2010. Last of the Summer Wine was filmed in and around Holmfirth, West Yorkshire, England. It features three older men who never get old and act like they are children. The three originally were Norman Clegg (Peter Sallis), Cyril Blamire (Michael Bates), and Compo Simmonite (Bill Owen). After two years, Blamire left the show. In his place, Brian Wilde joined as Foggy Dewhurst. The current cast is Russ Abbot as Hobbo Hobdyke, Burt Kwouk as Entwistle, and Brian Murphy as Alvin Smedley. Some think the show is not as good as it used to be. Many people continue watching it, though, and praise it for portraying older people well and for its family-friendly humour. Members of the British Royal Family enjoy the show. The show has been nominated for some awards and won the National Television Award for Most Popular Comedy Programme in 1999. There have been many holiday specials, two television movies, and a documentary movie about the series. Last of the Summer Wine has inspired other adaptations, including a television prequel,Bright and Ross (2000), p. 160 several novelisations,Bright and Ross (2000), p. 24 and a stage adaptation.Bright and Ross (2000), pp. 24–25 == Notes == == Reference == ==Other websites== *Last of the Summer Wine at BBC Comedy *Last of the Summer Wine at UKTV Drama. *Last of the Summer Wine at phill.co.uk *Last of the Summer Wine at Nostalgia Central. *Last of the Summer Wine tourism Category:1973 television series debuts Category:2010 British television series endings Category:1970s British sitcoms Category:1980s British sitcoms Category:1990s British sitcoms Category:2000s British sitcoms Category:2010s British sitcoms Category:BBC television sitcoms Category:Television series about friendship Category:Television shows set in Yorkshire Category:West Yorkshire Category:Works about old age Category:English-language television programs",
 "title": "Last of the Summer Wine"
}