{
 "id": "129150",
 "text": "The 1968–69 NHL season was the 52nd season of the National Hockey League. Twelve teams each played 76 games (two more than in 1967–68). For the second time in a row, the Montreal Canadiens faced the St. Louis Blues in the Stanley Cup finals. Montreal won for their second Stanley Cup in a row as they swept the Blues in four, which was exactly the same result of the previous season. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes Note: Teams that qualified for the playoffs are highlighted in bold East Division GP W L T Pts GF GA PIM Montreal Canadiens 76 46 19 11 103 271 202 780 Boston Bruins 76 42 18 16 100 303 221 1297 New York Rangers 76 41 26 9 91 231 196 806 Toronto Maple Leafs 76 35 26 15 85 234 217 961 Detroit Red Wings 76 33 31 12 78 239 221 885 Chicago Black Hawks 76 34 33 9 77 280 246 842 West Division GP W L T Pts GF GA PIM St. Louis Blues 76 37 25 14 88 204 157 838 Oakland Seals 76 29 36 11 69 219 251 811 Philadelphia Flyers 76 20 35 21 61 174 225 964 Los Angeles Kings 76 24 42 10 58 185 260 698 Pittsburgh Penguins 76 20 45 11 51 189 252 677 Minnesota North Stars 76 18 43 15 51 189 270 862 ===Scoring leaders=== Note: GP = Games played, G = Goals, A = Assists, PTS = Points, PIM = Penalties in minutes Player Team GP G A PTS PIM Phil Esposito Boston Bruins 74 49 77 126 79 Bobby Hull Chicago Black Hawks 74 58 49 107 48 Gordie Howe Detroit Red Wings 76 44 59 103 58 Stan Mikita Chicago Black Hawks 74 30 67 97 52 Ken Hodge Boston Bruins 75 45 45 90 75 Yvan Cournoyer Montreal Canadiens 76 43 44 87 31 Alex Delvecchio Detroit Red Wings 72 25 58 83 8 Red Berenson St. Louis Blues 76 35 47 82 43 Frank Mahovlich Detroit Red Wings 76 49 29 78 38 Jean Ratelle New York Rangers 76 32 46 78 26 ==Stanley Cup playoffs== ===Playoff bracket=== ==NHL awards== Prince of Wales Trophy: Montreal Canadiens Clarence S. Campbell Bowl: St. Louis Blues Art Ross Memorial Trophy: Phil Esposito, Boston Bruins Bill Masterton Memorial Trophy: Ted Hampson, Oakland Seals Calder Memorial Trophy: Danny Grant, Minnesota North Stars Conn Smythe Trophy: Serge Savard, Montreal Canadiens Hart Memorial Trophy: Phil Esposito, Boston Bruins James Norris Memorial Trophy: Bobby Orr, Boston Bruins Lady Byng Memorial Trophy: Alex Delvecchio, Detroit Red Wings NHL Plus/Minus Award: Bobby Orr, Boston Bruins Vezina Trophy: Glenn Hall & Jacques Plante, St. Louis Blues Lester Patrick Trophy: Robert M. Hull ===All- Star teams=== First Team Position Second Team Glenn Hall, St. Louis Blues G Ed Giacomin, New York Rangers Bobby Orr, Boston Bruins D Ted Green, Boston Bruins Tim Horton, Toronto Maple Leafs D Ted Harris, Montreal Canadiens Phil Esposito, Boston Bruins C Jean Beliveau, Montreal Canadiens Gordie Howe, Detroit Red Wings RW Yvan Cournoyer, Montreal Canadiens Bobby Hull, Chicago Black Hawks LW Frank Mahovlich, Detroit Red Wings ==References== *Hockey Database *NHL.com *hickoksports.com Category:1968 in North America Category:1969 in North America Category:National Hockey League seasons",
 "title": "1968–69 NHL season"
}