{
 "id": "129248",
 "text": "The 1964–65 NHL season was the 48th season of the National Hockey League. Six teams each played 70 games. Jean Beliveau was the winner of the newly introduced Conn Smythe Trophy as the most valuable player during the playoffs. The Montreal Canadiens won their first Stanley Cup since 1960 as they were victorious over the Chicago Black Hawks in a seven-game final series. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes National Hockey League GP W L T Pts GF GA PIM Detroit Red Wings 70 40 23 7 87 224 175 1121 Montreal Canadiens 70 36 23 11 83 211 185 1033 Chicago Black Hawks 70 34 28 8 76 224 176 1051 Toronto Maple Leafs 70 30 26 14 74 204 173 1068 New York Rangers 70 20 38 12 52 179 246 760 Boston Bruins 70 21 43 6 48 166 253 946 ===Scoring leaders=== Note: GP = Games played, G = Goals, A = Assists, PTS = Points, PIM = Penalties in minutes Player Team GP G A PTS PIM Stan Mikita Chicago Black Hawks 70 28 59 87 154 Norm Ullman Detroit Red Wings 70 42 41 83 70 Gordie Howe Detroit Red Wings 70 29 47 76 104 Bobby Hull Chicago Black Hawks 61 39 32 71 32 Alex Delvecchio Detroit Red Wings 68 25 42 67 16 ==Stanley Cup playoffs== For the third straight playoffs, it was Montreal vs. Toronto and Detroit vs. Chicago in the first round. The Canadiens came beat the Leafs in six games, while the Hawks beat the Wings in seven. ===Playoff bracket=== ==NHL awards== 1964–65 NHL awards Prince of Wales Trophy: Detroit Red Wings Art Ross Memorial Trophy: Stan Mikita, Chicago Black Hawks Calder Memorial Trophy: Roger Crozier, Detroit Red Wings Conn Smythe Trophy: Jean Beliveau, Montreal Canadiens Hart Memorial Trophy: Bobby Hull, Chicago Black Hawks James Norris Memorial Trophy: Pierre Pilote, Chicago Black Hawks Lady Byng Memorial Trophy: Bobby Hull, Chicago Black Hawks Vezina Trophy: Johnny Bower & Terry Sawchuk, Toronto Maple Leafs ===All-Star teams=== First Team Position Second Team Roger Crozier, Detroit Red Wings G Charlie Hodge, Montreal Canadiens Pierre Pilote, Chicago Black Hawks D Bill Gadsby, Detroit Red Wings Jacques Laperriere, Montreal Canadiens D Carl Brewer, Toronto Maple Leafs Norm Ullman, Detroit Red Wings C Stan Mikita, Chicago Black Hawks Claude Provost, Montreal Canadiens RW Gordie Howe, Detroit Red Wings Bobby Hull, Chicago Black Hawks LW Frank Mahovlich, Toronto Maple Leafs ==References== * Hockey Database * NHL.com Category:1964 in the United States Category:1965 in the United States Category:National Hockey League seasons",
 "title": "1964–65 NHL season"
}