{
 "id": "129267",
 "text": "WrestleMania III was the third yearly WrestleMania professional wrestling pay- per-view event made by the World Wrestling Federation (WWF). The event was held on March 29, 1987 at the Pontiac Silverdome in Pontiac, Michigan. The event is particularly notable for the record attendance of 93,173, the largest recorded attendance for a live indoor sporting event in North America. Though differing numbers have been argued, the event is considered to be the pinnacle of the 1980s wrestling boom. Almost one million fans watched the event at 160 closed circuit locations in North America. The number of people watching via pay-per-view was estimated at several million, and pay-per-view revenues were estimated at $10 million. == Results == # Results Stipulations Times 1 The Can-Am Connection (Rick Martel and Tom Zenk) defeated Bob Orton and The Magnificent Muraco (with Mr. Fuji). Tag team match 05:37 2 Billy Jack Haynes and Hercules (with Bobby Heenan) fought to a double countout. Singles match 07:44 3 Hillbilly Jim, The Haiti Kid and Little Beaver defeated King Kong Bundy, Little Tokyo and Lord Littlebrook by disqualification. Mixed tag team match 03:23 4 Harley Race (with Bobby Heenan and The Fabulous Moolah) defeated The Junkyard Dog. Loser Must Bow match 04:22 5 The Dream Team (Greg Valentine and Brutus Beefcake) (with Johnny Valiant and Dino Bravo) defeated The Fabulous Rougeaus (Jacques and Raymond). Tag team match 04:03 6 Roddy Piper defeated Adrian Adonis (with Jimmy Hart). Hair vs. Hair match 06:54 7 The Hart Foundation (Bret Hart and Jim Neidhart) and Danny Davis (with Jimmy Hart) defeated The British Bulldogs (Davey Boy Smith and The Dynamite Kid) and Tito Santana. 6-man tag team match 08:52 8 Butch Reed (with Slick) defeated Koko B. Ware. Singles match 03:39 9 Ricky Steamboat (with George Steele) defeated Randy Savage (c) (with Miss Elizabeth). Singles match for the WWF Intercontinental Championship 14:35 10 The Honky Tonk Man (with Jimmy Hart) defeated Jake Roberts (with Alice Cooper). Singles match 07:04 11 The Iron Sheik and Nikolai Volkoff (with Slick) defeated The Killer Bees (Brian Blair and Jim Brunzell) by disqualification. Tag team match 05:44 12 Hulk Hogan (c) defeated André the Giant (with Bobby Heenan). Singles match for the WWF Championship 12:01 == References == == Other websites == *Official website for WrestleMania III Category:1987 in sports WrestleMania 03 Category:1987 in the United States Category:1980s in Michigan",
 "title": "WrestleMania III"
}