{
 "id": "129370",
 "text": "Technical specifications Serial Attached SCSI Performance Full-duplex with link aggregation (wide ports at 24 Gbit/s) 3.0 Gbit/s at introduction, 6.0 Gbit/s, 12.0 Gbit/s, 22.2 Gbit/s planned Connectivity 8 meter external cable 128 device port expanders (16K + total devices) SAS-to-SATA compatibility Availability Dual-port HDDs Multi-initiator point-to-point Driver Software- transparent with SCSI Serial Attached SCSI (SAS) is a technology designed to move data to and from computer storage devices such as hard drives and tape drives. It is a point-to-point serial protocol that replaces the parallel SCSI. SCSI first appeared in the mid 1980s in corporate data centers. SAS uses the standard SCSI command set. At present it is slightly slower than the final parallel SCSI implementation, but in 2009 it will double its present speed to 6 Gbit/s. This will permit much higher speed data transfers. The protocol is \"downwards\"-compatible with second generation SATA drives. These drives may be connected to SAS backplanes (controllers), but SAS drives can not be connected to SATA backplanes. The SAS protocol is developed and maintained by the T10 technical committee of the International Committee for Information Technology Standards (INCITS) and promoted by the SCSI Trade Association (SCSITA). ==SAS (Serial Attached SCSI) vs parallel SCSI== * The SAS bus is point-to-point while the SCSI bus is multidrop. Each SAS device is connected by a dedicated link to the initiator, unless an expander is used. If one initiator is connected to one target, there is no opportunity for contention; with parallel SCSI, even this situation could cause contention. * SAS has no termination issues and does not require terminator packs like parallel SCSI. * SAS eliminates clock skew. * SAS supports up to 16,384 devices through the use of expanders while Parallel SCSI is limited to 8, 16, or 32 devices (including the SCSI controller) on a single channel. * SAS supports a higher transfer speed (1.5 OR 3.0 Gbit/s) than most parallel SCSI standards. The speed is realized on each initiator-target connection, hence higher throughput whereas in parallel SCSI the speed is shared across the entire multidrop bus. * SAS controllers are required by the standard to support SATA devices. * Both SAS and parallel SCSI use the SCSI command-set. ==SAS vs SATA== * SATA devices are uniquely identified by their port number connected to the Host bus adapter while SAS devices are uniquely identified by their World Wide Name (WWN). * Most SAS drives provide Tagged Command Queuing, while most newer SATA drives provide Native Command Queuing, each of which has its pros and cons. * SATA follows the ATA command set and thus only supports hard drives and CD/DVD drives. In theory, SAS also supports numerous other devices including scanners and printers. However, this advantage could also be moot, as most such devices have also found alternative paths via such buses as USB, IEEE 1394 (FireWire), and Ethernet. * SAS hardware allows multipath I/O to devices while SATA (prior to SATA II) does not. Per specification, SATA II makes use of port multipliers to achieve port expansion. Some port multiplier manufacturers have implemented multipath I/O leveraging port multiplier hardware. * SATA is marketed as a general-purpose successor to Parallel ATA and is now common in the consumer market, while the more expensive SAS is marketed for critical server applications. * SAS error recovery and reporting utilize SCSI commands which have more functionality than the ATA SMART commands used by SATA drives. * SAS uses higher signaling voltages (800-1600 mV TX, 275-1600 mV RX) than SATA (400-600 mV TX, 325-600 mV RX). When SAS is mixed with SATA, the SAS drives run at SATA-voltages. One reason for this higher voltage is so SAS may be used in server backplanes. * Because of its higher signaling voltages, SAS can use cables up to 8 m (25 ft) long, SATA is limited to 1 m (3 ft). ==Connectors== The SAS connector is much smaller than traditional parallel SCSI connectors allowing for the small drives. SAS supports point data transfer speeds up to 3 Gbit/s, but is expected to reach 12 Gbit/s by the year 2012. The physical SAS connector is available in several different variants: Image Codename Also known as Ext/int # of pins # of devices Comment SFF 8482 SATA connector Internal 1 Form factor compatible with SATA: allows for SATA drives to connect to a SAS backplane, which obviates the need to install an additional SATA controller just to attach a DVD-writer, for example. Note that SAS drives are not usable on a SATA bus and have their physical connector keyed to prevent any plugging into a SATA backplane. The pictured connector is a drive side connector. SFF 8484 Internal 32 (19) 4 (2) Hi-density internal connector, 2 and 4 lane versions are defined by the SFF standard SFF 8485 Defines SGPIO (extension of SFF 8484) - a serial link protocol used usually for LED indicators SFF 8470 Infiniband connector External 32 4 Hi-density external connector (also used as an internal connector) SFF 8087 Internal mini-SAS Internal 4 Molex iPASS reduced width internal 4x connector with future 10 Gbit/s support SFF 8088 External mini-SAS External 32 4 Molex iPASS reduced width external 4x connector with future 10 Gbit/s support ==Other websites== *T10 committee *SCSI Trade Association * Category:Storage devices",
 "title": "Serial Attached SCSI"
}