{
 "id": "129546",
 "text": "A Biblical manuscript is any handwritten copy of a portion of the text of the Bible. They vary in size from tiny scrolls containing individual verses of the Jewish scriptures to huge polyglot codices containing both the Hebrew Bible (Tanakh) and the New Testament, as well as other works. ==Hebrew Bible (or Tanakh) manuscripts== The Aleppo Codex (c. 920 AD) and Leningrad Codex (c. 1008 AD) were the oldest Hebrew language manuscripts of the Tanakh. The 1947 find at Qumran of the Dead Sea scrolls pushed the manuscript history of the Tanakh back a millennium from the two earliest complete codices. Before this discovery, the earliest extant manuscripts of the Old Testament were in Greek in manuscripts such as Codex Vaticanus and Codex Sinaiticus. Out of the roughly 800 manuscripts found at Qumran, 220 are from the Tanakh. Every book of the Tanakh is represented except for the Book of Esther; however, most are fragmentary. Notably, there are two scrolls of the Book of Isaiah, one complete (1QIsa), and one around 75% complete (1QIsb). These manuscripts generally date between 150 BC to 70 AD.F.F. Bruce. \"The Last Thirty Years\" . Story of the Bible. ed. Frederic G. Kenyon Retrieved June 19, 2007 Ancient Jewish scribes developed many practices to protect copies of their scriptures from error. == New Testament manuscripts == Parts of the New Testament have been preserved in more manuscripts than any other ancient work. There are over 5,800 complete or fragmented Greek manuscripts, 10,000 Latin manuscripts and 9,300 manuscripts in various other ancient languages, such as Syriac, Slavic, Gothic, Ethiopic, Coptic and Armenian. The dates of these manuscripts range from about 125 AD (the Ryland manuscript, P52; containing fragments of the oldest copy of John) to the introduction of printing in Germany in the 15th century. Most of these manuscripts date after the 10th century. Although there are more manuscripts that preserve the New Testament than there are for any other ancient writing, the text preserved in these later, numerous manuscripts may not be the same as the text as it existed in antiquity. Textual scholar Bart Ehrman wrote: :\"It is true, of course, that the New Testament is abundantly attested in the manuscripts produced through the ages, but most of these manuscripts are many centuries removed from the originals, and none of them perfectly accurate. They all contain mistakes - altogether many thousands of mistakes. It is not an easy task to reconstruct the original words of the New Testament....\".The New Testament: an historical introduction to the early Christian writings, Bart Ehrman p. 449 In reference to the textual evidence for the New Testament, Bruce M. Metzger wrote, :\"In evaluating the significance of these statistics...one should consider, by way of contrast, the number of manuscripts which preserve the text of the ancient classics. Homer's Iliad...is preserved by 457 papyri, 2 uncial manuscripts, and 188 minuscule manuscripts. Among the tragedians the witnesses to Euripides are the most abundant; his extant works are preserved in 54 papyri and 276 parchment manuscripts, almost all of the later dating from the Byzantine period...the time between the composition of the books of the New Testament and the earliest extant copies is relatively brief. Instead of the lapse of a millennium or more, as is the case of not a few classical authors, several papyrus manuscripts of portions of the New Testament are extant which were copies within a century or so after the composition of the original documents\".Metzger, Bruce 1992. The text Of the New Testament: its transmission, corruption & restoration, 1992, 3rd ed, 33-35As a footnote to his comments, Metzger also said, \"Lest, however, the wrong impression be conveyed from the statistics given above regarding the total number of Greek manuscripts of the New Testament, it should be pointed out that most of the New Testament papyri are relatively fragmentary and that only about fifty manuscripts contain the entire New Testament\". Every year, several New Testament manuscripts handwritten in the original Greek format are discovered. == References == == Other websites == *Carm Category:Biblical manuscripts",
 "title": "Biblical manuscript"
}