{
 "id": "129569",
 "text": "Seth Aaron Rogen (born April 15, 1982) is a Canadian actor, comedian, director, producer, and writer. ==Early life== Rogen was born on April 15, 1982, in Vancouver, British Columbia. His parents are Sandy Belogus and Mark Rogen. ==Filmography== Year Title Role Notes 1999 Freaks and Geeks (TV series) Ken Miller Series cast 2001 Undeclared (TV series) Ron Garner Series cast, writer Donnie Darko Ricky Danforth 2004 Anchorman: The Legend of Ron Burgundy Eager Cameraman Extra 2005 The 40-Year-Old Virgin Cal Supporting role, co- producer 2006 You, Me and Dupree Neil Supporting role 2007 Shrek the Third Ship Captain Voice only Knocked Up Benjamin Stone Lead role, executive producer Superbad Officer Michaels Supporting role, writer, executive producer 2008 The Spiderwick Chronicles Hogsqueal Voice only Drillbit Taylor Writer Horton Hears a Who! Morton Voice only Kung Fu Panda Master Mantis Voice only Step Brothers Sporting Goods Manager Cameo role Pineapple Express Dale Denton Co-headlining role, writer, executive producer Fanboys Admiral Seasholtz/The Pimp/Star Journey alien 3 different small roles\"Life on 'Mars'\" ; Schwartz, Missy; May 9, 2006; Entertainment Weeklys' EW.com Zack and Miri Make a Porno Zack Co-headlining role 2009 Funny People Ira Lead role, executive producer Monsters vs. Aliens B.O.B. Voice only Observe and Report Ronnie Barnhardt Lead role Deliverance co-lead role 2010 The Green Hornet Britt Reid/The Green Hornet Lead role, co-writer 2011 Kung Fu Panda 2 Master Mantis Voice only 2013 This Is the End himself Lead role, director 2014 The Interview Aaron Rapaport Lead role, director Bad Neighbours Mac Radner Lead role 2016 Kung Fu Panda 3 Master Mantis Voice only Bad Neighbours 2: Soroitiy Rising Mac Radner Lead role 2019 The Lion King Pumbaa Voice only == References == Category:1982 births Category:Living people Category:Actors from Vancouver Category:Canadian comedians Category:Canadian Jews Category:Canadian movie actors Category:Canadian movie directors Category:Canadian movie producers Category:Canadian screenwriters Category:Canadian television actors Category:Canadian television directors Category:Canadian television producers Category:Canadian television writers Category:Canadian voice actors Category:Jewish actors Category:Writers from British Columbia",
 "title": "Seth Rogen"
}