{
 "id": "129573",
 "text": "The Office is an Emmy and Peabody Award-winning American television sitcom airing on National Broadcasting Company (NBC) and developed by Greg Daniels. It is an American adaptation of the BBC series with the same name. It is set in Scranton, Pennsylvania. ==Characters== *Michael Scott is played by Steve Carell *Dwight Schrute is played by Rainn Wilson *Andy Bernard is played by Ed Helms *Pam Halpert is played by Jenna Fischer *Jim Halpert is played by John Krasinski *Stanley Hudson is played by Leslie David Baker *Phyllis Lapin-Vance is played by Phyllis Smith *Angela Martin is played by Angela Kinsey *Kevin Malone is played by Brian Baumgartner *Oscar Martinez is played by Oscar Nunez *Erin Hannon is played by Ellie Kemper *Ryan Howard is played by B. J. Novak *Meredith Palmer is played by Kate Flannery *Creed Bratton is played by Creed Bratton *Toby Flenderson is played by Paul Lieberstein *Kelly Kapoor is played by Mindy Kaling *Darryl Philbin is played by Craig Robinson *Nellie Bertram is played by Catherine Tate *Karen Filippelli is played by Rashida Jones *Holly Flax is played by Amy Ryan *Robert California is played by James Spader *Jo Bennett is played by Kathy Bates *Gabe Lewis is played by Zach Woods *Hank the security guard is played by Hugh Dane *Jan Levinson is played by Melora Hardin *David Wallace is played by Andy Buckley Category:2005 American television series debuts Category:2013 American television series endings Category:2000s American sitcoms Category:2000s American workplace television series Category:2000s satirical television series Category:2010s American sitcoms Category:2010s American workplace television series Category:2010s satirical television series Category:American satirical television series Category:American television series based on British television series Category:American workplace comedy television series Category:Emmy Award winning programs Category:NBC network series Category:Office comedy television series Category:Peabody Award winners Category:Pennsylvania in fiction Category:Scranton, Pennsylvania Category:Screen Actors Guild Award winners Category:English-language television programs",
 "title": "The Office (American TV series)"
}