{
 "id": "129685",
 "text": "The University of Minnesota, Twin Cities (U of M or The U) is a public university. Most of the buildings are in Minneapolis, and some more buildings are about 3 miles (4.8 km) away near Saint Paul. These two parts are called the Twin Cities campus, and together they are the oldest and largest part of the University of Minnesota system. The Twin Cities campus is the flagship of the system. The University of Minnesota is one of the Public Ivy universities in America, which is like saying they can give people an experience in college similar to the Ivy League. The University of Minnesota was started in 1851, and they are now in the Association of American Universities. There are lots of students and teachers at the University of Minnesota. Some of them have won Nobel Prizes and Pulitzer Prizes. Some famous people who went to the University of Minnesota are Hubert Humphrey, Walter Mondale, and Bob Dylan. The nickname of the University of Minnesota is the Golden Gophers. == Areas of Study == === Structure === The University of Minnesota is structured into different units that study specific things. There are 19 units: * Center for Allied Health Programs * College of Biological Sciences * College of Continuing and Professional Studies * School of Dentistry * College of Design * College of Education and Human Development * Extension * College of Food, Agricultural and Natural Resource Sciences * Graduate School * Law School * College of Liberal Arts * Carlson School of Management * Medical School * School of Nursing * College of Pharmacy * Hubert H. Humphrey School of Public Affairs * School of Public Health * College of Science and Engineering * College of Veterinary Medicine The University of Minnesota also has some smaller parts made up of people from across the units working together: * Center for Cognitive Sciences * Consortium on Law and Values in Health, Environment, and the Life Sciences * Institute for Advanced Study at University of Minnesota * Institute for Translational Neuroscience * Institute on the Environment * Minnesota Population Center ==== Discoveries ==== * Gravity waves — the University of Minnesota has led studies to learn about gravity — the force that moves us toward the center of the earth — and how gravity moves like a wave. People who study gravity shared this discovery in February 2016. * Gopher — the University of Minnesota made a tool called Gopher, which came before the World Wide Web. It used links to connect computers together. People liked the World Wide Web better though, because it was easier to share with people, and it worked with more stuff than just text. The University of Minnesota keeps the Charles Babbage Institute, a place that stores important examples of computer history. They started early with Seymour Cray who made powerful computers. == Campuses == === Kinds of People === The campus is made up of more than 50,000 people, so the University of Minnesota is the sixth largest in the United States. There are many kinds of people that are part of the University of Minnesota, from a lot of different places and groups. As of Fall 2017, there are 31,535 people who are studying for an undergraduate degree — that is, a level of learning that someone can get after high school. Of that number, 5,858 are new to the University of Minnesota trying to get a degree for the first time. There are also 12,614 people trying to get a degree that's even higher than an undergraduate degree, like becoming a doctor. === Minneapolis Campus === The campus started near the Saint Anthony Falls on the Mississippi River, but people moved about 1 mile (1.6 km) over to the place it is today. The old site is now a small park. They closed during the American Civil War, but they opened again in 1867 when John S. Pillsbury gave some money. They were bigger by 1869, so they stopped being called preparatory school and started being called a college instead. Today there are so many buildings, there are some on both sides of the Mississippi River. The part with buildings on the east side of the river is called the \"East Bank\", and the part with buildings on the west side of the river is called the \"West Bank\". ==== East Bank ==== The University of Minnesota has many buildings on the east side of the Mississippi River. To help people find their way around, these buildings are divided into several areas: the Knoll area, the Mall area, the Health area, the Athletic area, and the Gateway area. The Knoll area is the oldest part of the University of Minnesota, and it's in the northwestern corner. Some buildings in this area are over 100 years old. The Mall area, or Northrop Mall is in the middle. It was based on a drawing by Cass Gilbert, but that drawing was too hard to follow. There are many buildings in the Mall area that are important. The Health area is in the southeast corner. Some buildings are part of a hospital. There's also some buildings where students live, which called a residence hall. The Athletic area is near the health area. Some buildings are for students who want to stay healthy to use like a gymnasium. There are also stadiums and arenas for people in sports to use in student athletics. The Gateway area is on the east side. Most of these buildings are for offices, but there are also some buildings for people who are learning about medicine and living things. ==== West Bank ==== The University of Minnesota has some buildings on the west side of the Mississippi River. Some are for people to learn about theatre, dance, music, and art. There's also a big library and some buildings for people to learn about social science. === Saint Paul Campus === The place people call the Saint Paul Campus is not in Saint Paul. It's in a city called Falcon Heights, about 3 miles (4.8 km) away from the Minneapolis campus. Most of the buildings are for people to about farming and natural resources. There are also fields and quiet spots. The Saint Paul Campus is next to the Minnesota State Fairgrounds, where Minnesota has a big party every year. == Student Life == === Clubs === Many students at the University of Minnesota are part of clubs. Some clubs are fraternities and sororities— that is, a group of students who have things in common and are close together. There are also clubs for people who are studying the same thing, or for people who want to help like a charity. === Media === ==== Print ==== The Minnesota Daily is a newspaper made all by students. It was first made on May 1, 1900. It gets made twice a week, except in the summer when it's made once a week. There's another newspaper called The Wake Student Magazine, made all by students. It was first made in November, 2001. === Athletics === Minnesota's sports teams mostly play in the Big Ten Conference. The women's ice hockey team plays in the Western Collegiate Hockey Association (WCHA); the men's ice hockey team also played in the WCHA until 2013, when the Big Ten began a men's ice hockey league. ==References== Category:Colleges and universities in Minnesota Category:Association of American Universities Category:Big Ten Conference Category:Western Collegiate Hockey Association Category:1851 establishments in the United States Category:1850s establishments in Minnesota Territory",
 "title": "University of Minnesota"
}