{
 "id": "129783",
 "text": "WikiLeaks is a non-profit organization which uses its website to publish governmental, private data, corporate or religious documents that had previously been secret. The website was started in 2006 by Julian Assange. It had over 1.2 million documents in its database by the time one year had passed. Usually, it does not give out the names and addresses of people who post documents. The site is based in Sweden. Though its name is similar to Wikipedia, it is not related to Wikipedia or the Wikimedia Foundation. The name was chosen because WikiLeaks used a wiki model at first, where people could edit the site, but it has since changed and is no longer open for editing. ==History== In July 2010, WikiLeaks was in the news for publishing over 76,900 documents related to the War in Afghanistan. In October that same year, WikiLeaks posted almost 400,000 documents that were about the War in Iraq. This was the largest ever leak of documents about the US Army. It reported mainly on deaths of civilians, soldiers, and sightings of homemade bombs or armed civilians. On 28 November 2010, WikiLeaks and five major newspapers - from Spain (El País), France (Le Monde), Germany (Der Spiegel), the United Kingdom (The Guardian), and the United States (The New York Times) - all began to publish the first 291 of 251,287 confidential diplomatic cables from 274 embassies dated from 1966–2010. WikiLeaks plans to release all of the cables in phases over several months. This leak was widely covered by the international media, as many of the leaks contained information that affected countries other than the United States. Some leaks were published by other news organizations like Fairfax Media.Dorling, Philip (11 December 2010). \"How I Met Julian Assange and Secured the American Embassy Cables\". The Sydney Morning Herald. Retrieved 13 December 2010. White House Press Secretary Robert Gibbs said that an \"open and transparent government is something that the President believes is truly important. But the stealing of classified information and its dissemination is a crime\". Secondary source coverage is extensive, i.e., Time, USA Today, etc. In August 2016, WikiLeaks posted more than 20,000 emails from the Democratic National Committee (DNC) that showed they tried to undermine Bernie Sanders. ==Related pages== * Cryptography ==References== == Other websites == * WikiLeaks Fan Club * WikiLeaksNews.org (An unofficial WikiLeaks news resource & social network) Category:Websites established in 2006 Category:Non-profit organizations of Europe Category:Controversies Category:Organizations based in Sweden",
 "title": "WikiLeaks"
}