{
 "id": "129874",
 "text": "Brother Bear 2 is a 2006 American animated direct-to-video road movie and the sequel to the animated feature Brother Bear, which was released on August 29, 2006. Melissa Etheridge contributed three songs to the movie. In the movie, the adventures of bear brothers Kenai and Koda continue. While the first movie dealt with Kenai's relationship with Koda, this one focuses more on his bond with a young human of his past, Nita. Only five of the original characters return for the sequel (excluding Denahi): Kenai, Koda, Rutt, Tuke, and Tug, as Jason Raize died on February 3, 2005. Only four of those actors came back to do their original roles: Jeremy Suarez, Rick Moranis, Dave Thomas, and Michael Clarke Duncan. Producer Jim Ballantine was removed from the project and replaced with Carolyn Bates. Jason Marsden, as heard in the first trailer, was originally announced to voice Kenai, after being voiced by Joaquin Phoenix in the first film; Patrick Dempsey ultimately voiced the character. However, the end credits still note Marsden as one of the additional voices. ==Voice cast== * Patrick Dempsey as Kenai * Mandy Moore as Nita * Jeremy Suarez as Koda * Rick Moranis as Rutt * Dave Thomas as Tuke * Andrea Martin as Anda * Catherine O'Hara as Kata * Wanda Sykes as Innoko * Wendie Malick as Aunt Siqniq * Kathy Najimy as Aunt Taqqiq * Michael Clarke Duncan as Tug * Jim Cummings as Bering * Daran Norris as Chikoot * Jack Weber as Young Kenai. Weber is listed in the additional voices section. * Michaela Jill Murphy as Young Nita. Murphy is listed in the additional voices section too, and she's also credited as \"Jessie Flower\". * Tress MacNeille as Hoonah. MacNeille is listed in the additional voices section as well. * Jeff Bennett as Atka. Bennett is also listed in the additional voices. * Andre Stojka as Raccoon #2 (uncredited) * Frank Welker as Animals' vocal effects (also uncredited) Additional voices were provided by Wayne Allwine, Bob Bergen, Dave Foley, Bill Hader, Julie Kavner, Jason Marsden, Laraine Newman, Steve Purcell, Martin Short, Bobb'e J. Thompson, Erik von Detten and Owen Wilson. ==Reception== Brother Bear 2 did better in critical response than Brother Bear 1, with a higher rating of 50% in Rotten Tomatoes, indicating mixed-to-positive reviews. The consensus is \"the story seems lacking along with some annoying plot holes, but Brother Bear 2 is a worth-watching fun family film that will entertain kids and adults along the way\". ==Other websites== * Brother Bear 2 Official DVD xxxxxxxxxxincluding a sneak preview * * Category:2006 movies Category:2006 animated movies Category:Disney animated movies Category:Movies about bears Category:Movies about brothers Category:Direct-to-video movies Category:Disney direct-to-video movies Category:Movies set in prehistory Category:American movies",
 "title": "Brother Bear 2"
}