{
 "id": "129880",
 "text": "Wind power is the conversion of the energy in wind into a more useful form of energy, like electricity. It is a renewable source of energy that helps to cut down on the pollution of earth's air. Wind power capacity has expanded quickly to 336 GW in June 2014, and wind energy production was about 4% of total worldwide electricity usage, and growing fast. Wind power is widely used in European countries, and more recently in the United States and Asia.Global wind energy markets continue to boom – 2006 another record year (PDF).Global Wind Energy Council (2009). Global Wind 2008 Report , p. 9, accessed on January 4, 2010. In 2012, wind power accounted for approximately 30% of electricity generation in Denmark, 20% in Portugal and 18% in Spain.International Energy Agency (2013). IEA Wind Energy: Annual Report 2012 p. 5. ==How it works== Wind power stations use the wind to turn a turbine which turns a magnet inside a coil (a type of generator). The wind has kinetic energy (movement energy) which is changed into mechanical energy by the blades on the turbine. The turbine then turns a generator which creates electrical energy (voltage). The turbine is usually connected by a gearbox to help control the speed it turns the generator. ==Advantages== Wind power stations have the advantage over fossil fuel power stations as they do not produce any greenhouse gases such as carbon dioxide or water vapour. They also do not produce for gases that helps to make acid rain such as sulphur dioxide. They also make the environment safer and less pollution is caused. == Disadvantages == Wind turbines have to be carefully placed. They must be in positions where there is a constant, steady supply of wind. In fact, the wind must not become too strong or it may damage the turbine. Because wind is uncontrollable, so is the amount of power that wind turbines will produce, making them a possibly unreliable source of energy. Some people also consider wind turbines to be ugly and unsightly. Also, huge numbers of electricity pylons (\"transmission towers\") are built on land to carry the electricity to the electric company. These pylons in areas of natural beauty are a major reason for local people to object to wind farms and their consequences. ==Related pages== * List of large wind farms == Gallery== File:Wind turbine at Nigg.jpg|REpower 5 MW wind turbine under construction at Nigg fabrication yard on the Cromarty Firth File:London Array 02.jpg|The London Array under construction in 2009 Image:Wind power plants in Xinjiang, China.jpg|Wind farm in Xinjiang, China File:Wind turbines, Wind power, Mirny, Crimea.jpg|Wind turbines in Crimea File:Scrobysands04.11.2005.a.jpg|Scroby Sands wind farm from Great Yarmouth File:Wind turbine blade transport I-35.jpg|A wind turbine blade on I-35 near Elm Mott, an increasingly common sight in Texas Image:EnerconE70-Magedeburg 2005-Steinkopfinsel01.jpg|Erection of an Enercon E70-4 in Germany == References == == Other websites == * The Climate Change Guide easy-to- understand information on Wind power.",
 "title": "Wind power"
}