{
 "id": "130028",
 "text": "{{Infobox writer | name = Pierre Boulle | image = | imagesize = | alt = | caption = | pseudonym = | birth_name = | birth_date = | birth_place = Avignon, France | death_date = | death_place = Paris, France | occupation = Author | nationality = French | ethnicity = | citizenship = | education = | alma_mater = | period = 1950–1992 | genre = | subject = | movement = | notableworks = The Bridge over the River Kwai Planet of the Apes | spouse = | partner = | children = | relatives = | influences = | influenced = | awards = | signature = | website = | portaldisp = }} Pierre François Marie Louis Boulle (20 February 1912 – 30 January 1994) was a French writer. He was born in Avignon, France. Boulle wrote many novels and short stories in French. Two stories became popular English language movies: Planet of the Apes and The Bridge on the River Kwai. Boulle won the award for Best Adapted Screenplay and BAFTA Award for Best British Screenplay for The Bridge over the River Kwai. He is said to have given the shortest acceptance speech in Academy Award history, the single word, \"Merci\", which means \"Thank you\". Boulle served in the army in World War II. Boulle died in Paris on 30 January 1994, at age 81.\"Pierre Boulle, Novelist, Is Dead; Author of 'River Kwai' Was 81\", New York Times obituaries, 1 February 1994 ==Novels== *William Conrad (1950; tr. in 1955 as Not the Glory by Xan Fielding; also issued as Spy Converted) *Le sacrilège malais (1951; tr. in 1959 as Sacrilege in Malaya by Xan Fielding; also issued as S.O.P.H.I.A.) *Le Pont de la rivière Kwaï (1952; tr. in 1954 as The Bridge over the River Kwai by Xan Fielding) *Le Bourreau (1954; tr. in 1961 by Xan Fielding, US title: The Executioner, UK title: The Chinese Executioner) *L'épreuve des hommes blancs (1955; tr. in 1957 as The Test by Xan Fielding; also issued as White Man's Test) *La face (1956; tr. in 1956 as Saving Face by Xan Fielding; also issued as Face of a Hero) *Les voies du salut (1958; tr. in 1958 as The Other Side of the Coin by Richard Howard) *Un métier de seigneur (1960; tr. in 1960 as A Noble Profession by Xan Fielding; also issued as For a Noble Cause) *La planète des singes (1963; tr. in 1964 as Monkey Planet by Xan Fielding; later issued as Planet of the Apes) *Le jardin de Kanashima (1964; tr. in 1965 as Garden on the Moon by Xan Fielding) *Le Photographe (1967; tr. in 1967 by Xan Fielding, US title: The Photographer, UK title: An Impartial Eye) *Les Jeux de l'esprit (1971; tr. in 1973 as Desperate Games by Patricia Wolf) *Les Oreilles de jungle (1972; tr. in 1972 as Ears of the Jungle by Michael Dobry and Lynda Cole) - story of the Vietnam war told from the perspective of a North Vietnamese commander *Les Vertus de l'enfer (1974; tr. in 1974 as The Virtues of Hell by Patricia Wolf) *Le Bon Léviathan (1978; tr. in 1978 as The Good Leviathan by Margaret Giovanelli) *Les Coulisses du Ciel (1979; tr. in 1985 as Trouble in Paradise by Patricia Wolf) *L'Énergie du désespoir (1981) *Miroitements (1982; tr. in 1986 as Mirrors of the Sun by Patricia Wolf) *La Baleine des Malouines (1983; tr. in 1984 by Patricia Wolf, US title: The Whale of the Victoria Cross, UK title: The Falklands Whale) *Pour l'amour de l'art (1985) *Le Professeur Mortimer (1988) *Le Malheur des uns... (1990) *A nous deux, Satan! (1992) *L'Archéologue et le mystère de Néfertiti (2005; posthumous) ==Short story collections== *Contes de l'absurde (1953) *E=mc2 (1957) *Histoires charitables (1965) *Time Out of Mind: And Other Stories (1966; twelve stories from Boulle's first three collections tr. by Xan Fielding and Elisabeth Abbott) *Quia absurdum: sur la Terre comme au Ciel (1966; tr. in 1970 as Because It Is Absurd: On Earth as It Is in Heaven by Elisabeth Abbott) *Histoires perfides (1976; tr. in 1977 as The Marvelous Palace And Other Stories by Margaret Giovanelli) *L'enlèvement de l'obélisque (2007; posthumous) ==Non-fiction== *Le Siam (Walt Disney) (1955; tr. in 1958 as Walt Disney's Siam by Herbert Knapp) — in Walt Disney's \"Le Monde et ses habitants\"/\"The World and its Inhabitants\" series *L'étrange croisade de l'empereur Frédéric II (1963) *Aux sources de la rivière Kwaï (1966; tr. in 1967 by Xan Fielding, US title: My Own River Kwai, UK title: The Source of the River Kwai) — memoir *L'univers ondoyant (1987) *L'îlon (1990) — memoir ==Movies and television series based on Pierre Boulle books== *The Bridge on the River Kwai (1957) *Planet of the Apes (1968) *Beneath the Planet of the Apes (1970) *Escape from the Planet of the Apes (1971) *Conquest of the Planet of the Apes (1972) *Battle for the Planet of the Apes (1973) *Planet of the Apes (TV series) (1974) *Return to the Planet of the Apes (Animated TV Series) (1975) *Planet of the Apes (2001) *Rise of the Planet of the Apes (2011) ==References== Category:1912 births Category:1994 deaths Category:People from Avignon Category:BAFTA Award winners Category:French military people Category:French novelists Category:French people of World War II Category:Military personnel of World War II Category:Writers from Provence-Alpes-Cote d'Azur",
 "title": "Pierre Boulle"
}