{
 "id": "130418",
 "text": "In biology, the cell is the basic structure of organisms. All cells are made by the division of other cells. The environment outside the cell is separated from the cytoplasm inside the cell by the cell membrane. Inside some cells, parts of the cell stay separate from other parts. These separate parts are called organelles (like small organs). They each do different things in the cell. Examples are the nucleus (where DNA is), and mitochondria (where chemical energy is converted).Alberts B. et al. 2002. Molecular biology of the cell. 4th ed, Garland.Lodish H. et al. 2004. Molecular cell biology. 5th ed, WH Freeman: NY. == Kinds of cells == Cell can be divided into different types depending on the structure of the nucleus and the physiological function. In 1957 cells were divided into two types based on the structure of nucleus. These were the prokaryotic cell and the eukaryotic cell. Prokaryotes, such as bacteria and archaea, are simple cells that have no cell nucleus. They do have bacterial microcompartments. Eukaryotes are complex cells with many organelles and other structures in the cell. They are larger than prokaryote cells: they can be as much as 1000 times greater in volume. Eukaryotes store their genetic information (DNA) on chromosomes in the cell nucleus. Organisms (living things) which are made up of multiple cells are eukaryotes. Most cells are small, the largest just being seen by the human eye (egg cell). They need to be small in order to work as they should.Al-Khalili, Jim 2022. Secrets of size: atoms to supergalaxies. BBC series, 1.1. == Kinds of prokaryotic organisms == The only kinds of prokaryotic organisms are bacteria and archaea.Murat, Dorothee; Byrne, Meghan; Komeili, Arash 2010. Cell Biology of Prokaryotic Organelles. Cold Spring Harbor Perspectives in Biology. 2 (10): a000422. Prokaryotic organisms evolved before eukaryotic organisms, so at one point the world consisted of nothing but prokaryotic organisms. There are also viruses, which are biological organisms. They always reproduce inside the cells of other organisms. They cause some important diseases. Viruses are made of RNA, or DNA, and protein, and they reproduce themselves inside the cells of bacteria or eukaryotes. == Regions of prokaryotic cell == The prokaryotic cell has three regions namely the cell envelope, cytoplasmic region and flagella or pili. * Cell envelope: This consists of the plasma membrane covered by a cell wall. Some bacteria have a third layer called a capsule. Prokaryotes such as Mycoplasma and Thermoplasma only have a cell membrane layer. The envelope gives protection to the cell and separates the inside of the cell from its environment. * Cytoplasmic region: This region is found inside the cell and contains the genome (DNA), ribosomes and other cell inclusions. Since prokaryotes do not have a nucleus, the genetic material is free in the cytoplasm. * Flagella/Pili: These structures are not present in all prokaryotes. The flagella and pili extends from the surface of the cell, and they help in movement and communication between cellshttps://web.archive.org/web/20210307231908/https://web.archive.org/web/20130507094245/http://www.ncbi.nlm.nih.gov/About/primer/genetics_cell.html == Kinds of eukaryotic organisms == === Unicellular === Unicellular organisms are made up of one cell. Examples of unicellular organisms are: * Amoeba * Paramecium Unicellular organisms need to: * eat * respire (most use oxygen to make sugar into energy) All unicellular organisms must: * get rid of waste (discard) * reproduce (make more of itself) * grow Some may: * move * sense their environment * get their energy from the sun (e.g., cyanobacteria) * ferment (e.g., yeasts) * use anaerobic respiration (e.g. Clostridium botulinum) === Multicellular === Multicellular organisms are made from many cells. They are complex organisms. This can be a small number of cells, or millions or trillions of cells. All plants and animals are multicellular organisms. The cells of a multicellular organism are not all the same. They have different shapes and sizes, and do different work in the organism. The cells are specialised, this means they do only some kinds of work. By themselves, they cannot do everything that the organism needs to live. They need other cells to do other work. They live together, but cannot live alone. == Cell history == Cells were discovered by Robert Hooke (1635–1703). He used a compound microscope with two lenses to look at the structure of cork, and to look at leaves and some insects. He did this from about 1660, and reported it in his book Micrographica in 1665. He named cells after the Latin word cella, meaning room. He did this because he thought cells looked like small rooms. Many other naturalists and philosophers tried out the new instrument. The structure of plants was investigated by Nehemiah Grew (1641–1712) and Marcello Malpighi (1628–1694). Grew's major work was The anatomy of plants (1682).Harris H. 1999. The birth of the cell. Yale University Press, New Haven. It is not clear who first saw animal cells, Malpighi, Jan Swammerdam (1637–1680) or Antonie van Leeuwenhoek (1632–1723).p17 Leeuwenhoek's discoveries and drawings of 'little animalcules' opened up a whole new world for naturalists. Protozoa, and microorganisms generally were discovered, and the discoveries about them are still going on today. Christian Gottfried Ehrenberg's book Die Infusionsthierchen summarised what was known in 1838. Lorenz Oken (1779–1851) in 1805 wrote that infusoria (microscopic forms) were the basis of all life. The idea that cells were the basis of the larger forms of life came in the 18th century. Finding out who did the work has taken some time: :\"The work of the Czech Jan Purkyně (1787–1869) and his student and collaborator Gabriel Valentin (1810–1883) was unjustly denigrated by the nationalistic Germans. They have a claim to some priority in the cell theory\".Chapter 9 Johannes Müller (1801–1858) also made great contributions. \"It was, however, his student Theodor Schwann (1810–1882) and Matthias Schleiden (1804–1881) who got the credit for the cell theory, despite the fact that some of their observations were not correct, and their credits to previous workers were \"a travesty\".p97 The cell theory includes these important ideas: Gall J.G. & McIntosh J.R. (eds) 2001. Landmark papers in cell biology. Bethesda MD and Cold Spring Harbor NY: The American Society for Cell Biology and Cold Spring Harbor Laboratory Press. # All living things are made of cells. # The cell is the basic unit of structure and function in all organisms. # Every cell comes from another cell that lived before it. # The nucleus is the core element of the cell. == Cell reproduction == The body cells of metazoans divide by simple mitotic cell division. Sexual reproduction is ancestral in eukaryotes, and in metazoa it is carried out by specialised sex cells. They are produced by a process called meiosis. Prokaryotic cells reproduce using binary fission, where the cell simply splits in half. For both mitosis and binary fission the cell must replicate (copy) all its genetic information (DNA) so that each new cell will have a copy. == Related pages == *Cytology *Plant cell == References == Category:Plant anatomy",
 "title": "Cell"
}