{
 "id": "130712",
 "text": "The Extremaduran language () is the native language of Northwestern province of Cáceres. About 150,000 people speak it in Extremadura. This language is very similar to Leonese language and Asturian or Bable, spoken in other territories that once made up the Kingdom of León. Is called artu estremeñu (High extremaduran) too. Central and Low Extremaduran (Meyu estremeñu and Bahu estremeñu) are Spanish dialects with Extremaduran influences. ==Extremaduran/Spanish differences== {| class=\"wikitable\" Estremaduran Spanish English artu alto high cuasi casi almost leel leer to read flama llama flame hazel hacer to do hueu fuego fire izil decir to say == Literature == The language of Extremadura began to appear in documentation from the 13th century. In the 17th century, texts in the Talaveran subdialect appeared (1638). Extremaduran began to have more presence in literature with Vicente Barrantes and his Días sin sol of 1875. In 1984, José María Alcón Olivera published Requilorios, the first novel written in Extremaduran. It was not until the 2000s that new publications in Extremaduran were seen, in this case, in the El Rebollar variant, with El corral los mis agüelus, by José Benito Mateos Pascual. This was followed by the Primera Antología de Poesía Extremeña in 2005. In 2011, La nueva literatura en estremeñu was published, followed in 2012 by a second part. In 2012, Ismael Carmona García published the poetry collection Pan i verea. The siblings Miguel Herrero Uceda and Elisa Herrero Uceda published two books of short stories in Extremaduran: one in 2012, entitled Ceborrincho, relatos extremeños, and another in 2015, entitled Mamaeña, relatos extremeños. Other books in subsequent years include La huélliga by Marcos Cruz Díaz and El sol del lobu by Aníbal Martín. In 2025, Vicente Costalago published Euris estremeñus i sotras poemas, divided into three parts: the first with epic poems about various Extremaduran heroes; the second with religious poems; and the last with individual poems. ==Related pages== * Leonese language ==References== Category:Romance languages Category:Languages of Spain Category:Extremadura",
 "title": "Extremaduran language"
}