{
 "id": "13077",
 "text": "Tucumán is the smallest of the provinces of Argentina. It is in the northwest of the country and its capital is San Miguel de Tucumán, often shortened to Tucumán. The province has the nickname El Jardín de la República (The Garden of the Republic), as it is a highly productive agricultural area. ==Geography== The province of Tucumán has an area of and is surrounded by the provinces: * Salta to the north; * Santiago del Estero to the east; and * Catamarca to the south and west. Tucumán has two main different geographical regions. The east is associated with the Gran Chaco flat lands, while the west presents a mixture of the Sierras of the Pampas to the south and the canyons of the Argentine Northwest to the north. The highest peak in the province is the Cerro del Bolsón near the border with the Catamarca province. It has an elevation of . The main river of the province is the Dulce that flows through the province where is known as the Salí river. ===Climate=== San Miguel de Tucumán, with an elevation of , has a humid subtropical climate (subtype Cfa in the Köppen climate classification). The average temperature for the year in San Miguel de Tucumán is . The warmest month, on average, is January with an average temperature of . The coolest month on average is July, with an average temperature of . The average amount of precipitation for the year in San Miguel de Tucumán is . The month with the most precipitation on average is January with of precipitation. The month with the least precipitation on average is July with an average of . ==Population== The inhabitants of Tucumán are known, in Spanish, as Tucumanos (women: Tucumanas). The province of Tucumán has a population, in 2010, of 1,448,188; its population density is of inhabitants/km2. Evolution of the population in Tucumán Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:450 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:1500000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:200000 start:0 ScaleMinor = gridcolor:lightgrey increment:100000 start:0 BackgroundColors = canvas:sfondo BarData= bar:a text:1960 bar:b text:1970 bar:c text:1980 bar:d text:1991 bar:e text:2001 bar:f text:2010 PlotData= color:barra width:30 align:left bar:a from:0 till: 773972 bar:b from:0 till: 765962 bar:c from:0 till: 972665 bar:d from:0 till: 1142105 bar:e from:0 till: 1338523 bar:f from:0 till: 1448188 PlotData= bar:a at: 773972 fontsize:S text: 773,972 shift:(-12,5) bar:b at: 765962 fontsize:S text: 765,962 shift:(-16,5) bar:c at: 972665 fontsize:S text: 972,665 shift:(-16,5) bar:d at: 1142105 fontsize:S text: 1,142,105 shift:(-22,5) bar:e at: 1338523 fontsize:S text: 1,338,523 shift:(-22,5) bar:f at: 1448188 fontsize:S text: 1,448,188 shift:(-22,5) == Education == There are four universities in Tucumán: # Universidad Nacional de Tucumán (National University of Tucumán). # Facultad Regional Tucumán, part of the Universidad Tecnológica Nacional (National Technological University). # Universidad del Norte Santo Tomás de Aquino (Saint Thomas Aquinas University of the North). # Universidad San Pablo-T (Saint Paul-T University). ==Political division== The province is divided into 17 departments (). No. Department Capital Area (km²) Population (2010) Density 1 Burruyacú Burruyacú 2 Capital San Miguel de Tucumán 3 Chicligasta Concepción 4 Cruz Alta Banda del Río Salí 5 Famaillá Famaillá 6 Graneros Graneros 7 Juan Bautista Alberdi Juan Bautista Alberdi 8 La Cocha La Cocha 9 Leales Bella Vista 10 Lules Lules 11 Monteros Monteros 12 Rio Chico Aguilares 13 Simoca Simoca 14 Tafí del Valle Tafí del Valle 15 Tafí Viejo Tafí Viejo 16 Trancas Trancas 17 Yerba Buena Yerba Buena ==Gallery== File:Tucuman 1853d.JPG|Aerial view of San Miguel de Tucuman. File:FOTOGRAFÍA NOCTURNA -TEATRO SAN MARTÍN - SAN MIGUEL DE TUCUMÁN - ARGENTINA.JPG|San Martín theatre, San Miguel de Tucuman. File:TafidelValle Tucuman.JPG|Tafí del Valle. File:Tucuman Ingenio Cruz Alta.JPG|Cruz Alta Sugar Mill in Cruz Alta. ==References== ==Other websites== * Tucuman.gov.ar Tucuman Province Official Website * TucumanTurismo.gob.ar Tucuman Tourism Official Website",
 "title": "Tucumán Province"
}