{
 "id": "130802",
 "text": "Athletic Club, most often known in English as Athletic Bilbao, is a football club which plays in Spain. Athletic Bilbao's nickname is \"Los Leones\" (The Lions). This is because their stadium was built near a church named San Mamés. The church is named after Saint Mammes, an early Christian thrown to the lions by the Romans. The club formed from a merger of two football clubs ; Bilbao F.C. and Athletic Club in 1903. Athletic Bilbao is known for only utilizing players from the historic basque territory, which includes the Basque Country in Spain and France such as the region of Navarre. == Rivalries == Athletic Club has three major rivalries: Real Sociedad de San Sebastian, FC Barcelona and Real Madrid. The Rivalry with Real Sociedad is due to the location, because both teams are from the Basque Country. The rivalry also took place because of the rule to only sign players from the basque territory, yet Real Sociedad abondoned the rule in the 1980s. The rivalries with Real Madrid established itself because of the political circumstances. Both the Basque Country and Catalunya were had massive issues with the central goverment under Dictator Franco in Madrid, who forbid their language and traditions for a greater spanish empire. Franco heavily supported the capitals team, Real Madrid, which caused tensions with supporters of Athletic Club. The rivalry with FC Barcelona also is a result of the Franco-era. FC Barcelona, located in Catalunya, had the same issues with the central government such as the Basque Country. As a result of this circumstance, a rivalry between the Basque Country and Catalunya happened, which translated in football. As both Athletic Club and the FC Barcelona are the most important teams of their regions, they were the protagonists for this rivalry. Even with Spain being democratic since Franco's in 1975, both rivalries with Real Madrid and FC Barcelona are still on-going. == Honours == === National tournaments === *La Liga :Winners (8): 1929–30, 1930–31, 1933–34, 1935–36, 1942–43, 1955–56, 1982–83, 1983–84. :Runners-up (7): 1931–32, 1932–33, 1940–41, 1946–47, 1951–52, 1969–70, 1997–98. * Copa del Rey :Winners (23Note:The number of Copa wins Athletic Club have been credited with is disputed. The 1902 competition was won by Bizcaya, a team made up of players from Athletic Club and Bilbao FC. In 1903 these two clubs merged as Athletic Club. The 1902 cup is on display in the Athletic museum and the club includes it in its own honours list. . However LFP and RFEF official statistics do not include this as an Athletic win.): 1903, 1904, 1910, 1911, 1914, 1915, 1916, 1921, 1923, 1930, 1931, 1932, 1933, 1943, 1944, 1944–45, 1949–50, 1955, 1956, 1958, 1969, 1972–73, 1983–84. :Runners-up (13): 1905, 1906, 1913, 1920, 1942, 1948–49, 1952–53, 1965–66, 1966–67, 1976–77, 1984–85, 2008–09, 2011–12. *Supercopa de España :Winners (1): 1984*. :(* Won Copa del Rey and La Liga Runners-up (2): 1983, 2009 *Copa Eva DuarteNote:\"Eva Duarte Cup\" competition was the predecessor of the current \"Spanish Supercup\", because they face the league champion against the champion of the \"Copa del Rey\". :Winners (1): 1950.The Copa Eva Duarte was only recognized and organized with that name by the RFEF from 1947 until 1953, and therefore Athletic Bilbao's runners-up medal in the \"Copa de Oro Argentina\" of 1945 is not included in this count. :Runners-up (1): 1945 === International tournaments === * UEFA Europa League Runners-up: 2011-2012 == League position == Season League Position 2000/01 La Liga 12th 2001/02 La Liga 8th 2002/03 La Liga 7th 2003/04 La Liga 5th 2004/05 La Liga 9th 2005/06 La Liga 12th 2006/07 La Liga 17th 2007/08 La Liga 11th 2008/09 La Liga 13th === Former position === ==References== Category:Spanish football clubs Category:Bilbao Category:1898 establishments in Europe Category:1890s establishments in Spain",
 "title": "Athletic Bilbao"
}