{
 "id": "130919",
 "text": "Phagocytes are the white blood cells that protect the body by eating (phagocytosing) bacteria and dead or dying cells. They are important for fighting infections. They are also important for becoming immune. Phagocytes are present in all animals and are very complex in vertebrates.Delves P.J. et al 2006. Roitt's essential immunology. 11th ed, Malden, MA: Blackwell, p. 250/1. One liter of human blood has about six billion phagocytes.Hoffbrand A.V; Pettit J.E. & Moss P.A.H. 2005. Essential haematology. 4th ed, London: Blackwell, p. 331. == History == Their name comes from the Greek phagein, 'to eat or devour ', and kutos, 'hollow vessel'. Phagocytes were first seen in 1882 by Ilya Ilyich Mechnikov.Ilya Mechnikov, retrieved on November 28, 2008. From Nobel Lectures , Physiology or Medicine 1901–1921, Elsevier Publishing Company, Amsterdam, 1967. Phagocytes can be found in many animals. Macrophages move like amoebae, and are probably an ancient type of cell.Janeway, Charles A. 2001. Evolution of the innate immune system. In Janeway, Charles; Paul Travers, Mark Walport, and Mark Shlomchik. Immunobiology, p598. 5th ed, New York and London: Garland Science. == Professional phagocyte == Phagocytes of humans and other animals are called professional or non-professional, depending on how good they are at phagocytosis.Ernst J.D. & Stendahl O. (eds) 2006. Phagocytosis of bacteria and bacterial pathogenicity. New York: Cambridge University Press, p. 10, 186. The professional phagocytes are neutrophils, monocytes, macrophages, dendritic cells, and mast cells.Robinson J.P. & Babcock G.F. (eds) 1998. Phagocyte function a guide for research and clinical evaluation. New York: Wiley–Liss, p. 187. The reason they are called professional phagocytes is because they have receptors on their surfaces which can detect harmful objects, such as bacteria. Phagocytes are very important in fighting infections and in getting rid of dead and dying cells. == What a phagocyte does == When there is an infection, phagocytes move to the bacteria by sensing chemicals. These chemicals may come from bacteria or from other phagocytes that are already there. The phagocytes move by a way called chemotaxis. When bacteria touch a phagocyte, they bind to the receptors on the phagocyte and are eaten (phagocytosed).Janeway, Charles; Paul Travers, Mark Walport, and Mark Shlomchik 2001. Immunobiology. 5th ed. New York and London: Garland Science. Chapter: Induced innate responses to infection. When bacteria enter some phagocytes, the phagocytes use oxidants and nitric oxide to kill the pathogen. After phagocytosis, macrophages and dendritic cells can also do 'antigen presentation': this is when the phagocyte moves parts of the killed bacteria back to its surface. These parts are then shown to other cells of the immune system. Some phagocytes then move to the body's lymph nodes and show the bacterial parts to white blood cells called lymphocytes. This action is important in getting immunity.Janeway, Charles; Paul Travers, Mark Walport, and Mark Shlomchik 2001. Immunobiology. 5th ed. New York and London: Garland Science. Chapter: Antigen presentation to T lymphocytes. == Phagocyte evasion == Many bacteria have ways to not be eaten or killed by phagocytes. They may avoid contact by #growing in places phagocytes cannot reach, #putting out chemicals which make it difficult for phagocytes to get to an infection #interfering with the immune response which causes phagocytes to respond #tricking the immune system into treating them as \"self\", by coating themselves with a natural substance.Celli Jean & Finlay B. Brett 2002. Bacterial avoidance of phagocytosis. Trends Microbiol. 10 (5): 232–37. Todar, Kenneth. Mechanisms of bacterial pathogenicity: bacterial defense against phagocytes. == References == Category:Blood cells Category:Physiology Category:Immunology",
 "title": "Phagocyte"
}