{
 "id": "130911",
 "text": "Racism is the belief that one race is better than others.Racism Oxford Dictionaries\"Racism\" in R. Schefer. 2008 Encyclopedia of race, ethnicity and society. SAGE. p. 1113 It means judging or treating people badly for belonging to a certain race or ethnic group. ==Overview== Racism can affect many parts of society, like laws, cultures, and economies. In extreme cases, it can lead to genocides, especially the Holocaust, * * * * * * * * * * * during which Nazis in Germany believed that Jews and Roma people did not even deserve to exist. Due to such beliefs, they killed at least 6,000,000 Jews and 500,000 Roma. Yet, many anti-Jewish racists, known as antisemites, around the world have been denying or weaponizing the Holocaust against Jews. Distortion of the Holocaust refers, inter alia, to: * * * * * * ==History== Racism has caused wars, slavery, and the creation of nations. It was used by some powerful groups to justify their actions and biases. For example, during colonial times, Europeans used racism to exploit indigenous peoples and take their lands. In the Americas, white people treated black people as property, using racist ideas to make it seem okay. ==Forms== There are different forms of racism, some are very obvious, but others are more hidden. Everyday racism is the less obvious kind that happens in society. It's when people make others feel like they don't fully belong because of their race. This can happen through social interactions and behaviors based on racist beliefs. ==Race and ethnicity== Humans often sort themselves into groups by race or ethnicity. They do this based on ancestry, as well as visible traits like skin color and facial features. However, modern biology knows that humans do not really fit well into these groups. The DNA of people from different races is very similar. Evidence from genetics and archaeology suggests that all humans came from the same group of early humans in East Africa. ===Reverse racism=== Modern biologists see all humans as one race. Because White people historically had more power, some people call racism against whites reverse racism. ==Social Darwinism== In the second half of the 19th century, there were different ideas on how species change over time. Charles Dawin made the idea of evolution popular and spoke about natural selection. Herbert Spencer spoke about the survival of the fittest. Social darwinism is the idea that what applies to species also applies to human societies. Between the 1870s, and the end of WWII, these concepts were sometimes used to justify racist ideologies. ==Examples== * The Arab slave trade * The Atlantic slave trade * The Jim Crow laws in the United States, about 1890 to 1960 * The Nuremberg Laws and The Holocaust in Nazi Germany, 1935-45 * The Apartheid laws in South Africa, after 1948 * The White Australia policy in Australia * The Ku Klux Klan, a white supremacist group ==Ideologies deemed racist== ===European racism=== In the late 18th century, Europeans began using the term Aryan to refer to the original prehistoric Proto-Indo-Europeans and their descendants up to the present day (i.e., the Indo-European peoples). It was also assumed at the time, that, Aryans were a culturally superior people. By the late 19th century, some Europeans began to use the name Aryan for only the Nordic peoples of Europe (one branch of the Indo-European peoples), as a \"pure,\" \"noble\" and racially \"superior\" race they claimed were descended from the original Aryan tribes. The theory that the Aryans first came from Europe became especially popular in Germany and to a lesser degree in Austria and Hungary. ===Racism and colonialism === When Europeans came to the Americas, they killed thousands of Native Americans and when the European settlers got to Australia, they started killing off large numbers of Aboriginals. With the birth of their empires, many other native tribes suffered in Canada, New Zealand, China, Pakistan, Bangladesh and India. Japan also held similar beliefs about Chinese and Koreans in their colonies. ====Anglo-French racism==== Racism in the U.K., Ireland and France was usually about limiting the rights of Jews, Roma and minorities like the French Basques. As the colonies became independent after the 1950s, many migrated to the U.K. and France, but were discriminated against. Some British cafes and hotels would not welcome in Caribbean guests and the French made Arabs feel unwelcome in some French towns as well. Since the 1960s, India, Pakistani and Bangladeshi people have moved to the U.K. and been victimised and 'Paki-bashed'. 9/11, 2001, has heightened the French and British fears about Islam and Arabs in general. Polish and Brazilian migrant labours are also discriminated against in some places. Racist parties like the U.K.'s British National Party and National Front trade on these fears to get votes. ====Racism in Nazism==== Alleged scientific findings of racial differences were used by Nazi Germany to justify the racialist policy with its concept of \"Großdeutschland\" (Greater Germany) and the Nordic race idea. The Nazis were anti-Semitic and falsely blamed Jews for Germany's defeat in World War I and the Great Depression. The Nazis and some of their anti-Semitic allies, like Hungary, committed genocide against the Jews during the Holocaust of World War II. Both the Nazis and Romania's Iron Guard also persecuted the Roma people. During World War II, the Nazis embarked on a systematic attempt at genocide of the Roma, known as the Porajmos. The Nazis also knowingly killed of thousands of Slavs. ====Racism in Italy==== Fascist Benito Mussolini, in a 1919 speech to denounce Soviet Russia, claimed that Jewish bankers in London and New York City were bound by the chains of race to Moscow, and claimed that 80 percent of the Soviet leaders were Jews.Neocleous, Mark. Fascism. Minneapolis: University of Minnesota Press, 1997. Pp. 35. Many Italian fascists held anti-Slavic views, especially against neighbouring Yugoslav nations, who they saw as being in competition with Italy, which had laid claim to the Yugoslavia's region of Dalmatia.Benito Mussolini, Richard Washburn Child, Max Ascoli, Richard Lamb. My rise and fall. Da Capo Press, 1998. p. 106. Mussolini said Italy would get its own way and was willing to use force to settle arguments. An early example was Italy's bombardment of the Greek island of Corfu in 1923. Soon after he succeeded in setting up a puppet regime in Albania and crushed a rebellion in Libya, which had been an Italian colony since 1912. Italy, just as Germany, Austria and Hungary, regarded all Slavs and Roma as stupid, racially inferior due to the effects of Social Darwinism and undeserving of their basic rights. Anti-Arab discrimination was also used in parts of Libya. ====Racism in Romania==== The Iron Guard was an antisemitic fascist movement and political party in Romania from 1927 to 1941. They despised and denounced both Jews and the Romani people.Spicer, Kevin P. 2007. Antisemitism, Christian ambivalence, and the Holocaust. Indiana University Press on behalf of the Center for Advanced Holocaust Studies. p.142. (Describes the Romanian Iron Guard as a totalitarian nationalist and anti-Semitic movement.) ===Racism in the United States of America (USA)=== American racism has been a major issue in the country since before its founding. Historically dominated by European American settler society, race in the United States as a concept became significant in relation to other groups. Generally racist attitudes in the country have been most onerously applied to Native Americans, African Americans and some \"foreign-seeming\" action against Mexican immigrants among others. The Chinese, Japanese and Irish had trouble in America, during the 19th century, but the Blacks fell foul of the Jim Crow Laws which once racially separated some parts of America between Blacks and Whites. These first emerged in the late 19th Century and lasted to the mid 1960s and the Voting Rights Act of 1965. Millions of Africans were killed while they were held as prisoners or as slaves by the Europeans and Arabs. Some call this the Black Holocaust. The United States' legal system has been accused of racism. 40% of the prison population are black. 12% of the general population is black. The New York Police Department (NYPD) stop-and-frisk program has been accused of racial profiling. The book To Kill A Mockingbird is a well-known American novel largely focusing on race in the Jim Crow era, described earlier. In the 21st century, certain groups of non-white people hold the idea that all white people have advantages over them based on their skin color, with disregard to family background, personal history, or current situation. The Ku Klux Klan is an example of a racist hate group in the United States. ===Racism in the United Kingdom (UK)=== In the United Kingdom the two most popular nationalist political parties are the British National Party (BNP) and the UK Independence Party (UKIP). There is also a group called the English Defense League (EDL). They are thought to be racist by a lot of people. They are against unlimited immigration and colonization by Muslims. Although Muslims can be of any race, they are usually South Asian. In a 2013 poll, 27% of 1000 British people aged between 18 and 24 said that they did not trust Muslims. In the United Kingdom, most people are white. 7% are Asian and 3% are black. 4.83% of the British population are Muslims. ===Apartheid=== South African \"Apartheid laws\" were a system of racial segregation which was used to deny many rights of non-white people. They started in 1948. Black people had to carry special papers (passes) or have permission to live and work in particular areas. There were areas that Black people were almost never given permission to enter. Whites opposed intermarriage with non-whites. Other non-white people were also discriminated against, but not as badly as Black people. The Prohibition of Mixed Marriages Act of 1949 prohibited marriage between persons of different races and the Immorality Act of 1950 made sexual relations with a person of a different race a criminal offence.Alistair Boddy-Evans. African History: Apartheid Legislation in South Africa , About.Com. Accessed 5 June 2007. Black people suffered greatly and were banned from voting. Universal sufferage (letting most adults vote, including black ones) was granted in 1994. Nelson Mandela became South Africa's first black president in 1994. Mandela ended apartheid.https://www.washingtonpost.com/world/africa/racism-outlives-mandela-in-rural-south-africa/2013/12/14/8567b786-633c-11e3-a373-0f9f2d1c2b61_story.html Currently, racial quota laws discriminate against Whites in South Africa. Some people in South Africa publicly sing a song called \"Shoot the Boer\" (Xhosa: Dubul' ibhunu). Boers, also known as Afrikaners, are a race of White people in South Africa who are of Dutch descent. Former president Jacob Zuma sung the song in 2012. A website called \"genocidewatch.org\" has reported that White South Africans are facing genocide. ===The Imperial Rule Assistance Association of Japan=== The Imperial Rule Assistance Association (Taisei Yokusankai) was a coalition of fascist and nationalist political movements of Japan such as the Kōdōha (\"Imperial Way Faction\") and the Tōhōkai (\"Society of the East\"). It was formed under the guidance of Japanese Prime Minister Fumimaro Konoe Tsuzuki, Chushichi. The Pursuit of Power in Japan 1825-1995. Oxford University Press, 2000. P. 244.Nish, Ian. Japanese Foreign Policy. Routledge, 2001. P. 234. Prior to creation of the IRAA, Konoe had already effectively nationalized strategic industries, the media, and labour unions, in preparation for total war with China. Japan needed more land, minerals and colonies, so they annexed Korea and parts of China, such as Manchuria. Most imperialists in Japan regarded the Chinese, Koreans and Europeans as inferior races, to be crushed and exploited. ==A changing world== With the revelations of the holocaust, as well as worldwide antiracist efforts, old ideas about race changed and, more slowly, some prejudices about race faded. The civil rights movement tried to liberate persons of African origin from racist white supremacist rule in South Africa and the southern USA. Blacks could vote in South Africa after a 50-year ban. ==Related pages== * Antisemitism * White supremacy * Bosnian genocide * Rwandan genocide * Cambodian genocide * Rwandan genocide denial * Cambodian genocide denial ==References== Category:Bias Category:Culture Category:Society Category:Discrimination",
 "title": "Racism"
}