{
 "id": "131081",
 "text": "Linus Carl Pauling (February 28, 1901 – August 19, 1994) was an American scientist, peace activist, author and educator. He was one of the most important chemists in history. Pauling was one of the first scientists to work in quantum chemistry, molecular biology and orthomolecular medicine. He is one of a small group of people to have been given more than one Nobel Prize. He is one of only two people to receive them in different fields (the other person was Marie Curie) and the only person in that group to have been awarded each of his prizes without having to share it with another winner.Dunitz, p. 222. == Life and education == Pauling was born and grew-up in Oregon, USA. He went to Oregon Agricultural College and graduated in 1922 with a degree in chemical engineering. Pauling then went to the California Institute of Technology (Caltech), where he received his Ph. D in physical chemistry and mathematical physics in 1925. Two years later, he became an assistant professor at Caltech, and he completed his academic career there after many decades on the faculty. He was a Unitarian. == Work and awards == In 1932, Pauling came up with the idea of electronegativity and made a scale that would help predict the chemical bonding. Pauling kept doing this work while he also did work on the structure of the atomic nucleus. In 1954, Pauling was given the Nobel Prize in Chemistry for work that he did on the structure of DNA. This work led scientists in the UK to come up with the double helix of DNA. During the Second World War, Pauling worked on military research and development. But, after the war had ended he became worried about the making and future use of atomic weapons and with the destruction forced on the world by war. Ava Helen Pauling, Linus's wife, was a pacifist and in time he came to share her beliefs. Pauling then began to talk about his worries with the effects of nuclear fallout and in 1962, was awarded the Nobel Peace Prize for his work against above ground nuclear testing. == Work as author and teacher == Pauling was also an author and a teacher. His first book, The Nature of the Chemical Bond (1939), is still used today. his introductory textbook, General Chemistry (1949). Later in life, he became an advocate for greatly increased consumption of vitamin C and other nutrients. He generalized his ideas to define orthomolecular medicine, which is still regarded as unorthodox by conventional medicine. He popularized his concepts, analyses, research and insights in several successful but controversial books, such as How to Live Longer and Feel Better in 1986. == Death == Pauling died of prostate cancer on August 19, 1994, at 7:20 PM at home in Big Sur, California. He was 93 years old.Goertzel and Goertzel, p. 247.Linus Pauling dies at 93. The Oregonian, August 20, 1994. A grave marker for him is in Oswego Pioneer Cemetery in Lake Oswego, Oregon.Linus C. Pauling. Find A Grave. Retrieved December 4, 2007. == Honors and awards == Pauling received numerous awards and honors during his career. Following are awards and honors he has received. *1931 Langmuir Prize, American Chemical Society *1941 Nichols Medal, New York Section, American Chemical Society *1947 Davy Medal, Royal Society *1948 United States Presidential Medal for Merit *1952 Pasteur Medal, Biochemical Society of France *1954 Nobel Prize in Chemistry *1955 Addis Medal, National Nephrosis Foundation *1955 Phillips Memorial Award, American College of Physicians *1956 Avogadro Medal, Italian Academy of b,la *1957 Paul Sabatier Medal *1957 Pierre Fermat Medal in Mathematics *1957 International Grotius Medal *1961 Humanist of the Year, American Humanist Association *1962 Nobel Peace Prize *1965 Republic of Italy *1965 Medal, Academy of the Rumanian People's Republic *1966 Linus Pauling Medal *1966 Silver Medal, Institute of France *1966 Supreme Peace Sponsor, World Fellowship of Religion *1972 United States National Medal of Science *1972 International Lenin Peace Prize *1977 Lomonosov Gold Medal, USSR Academy of Science *1979 Medal for Chemical Sciences, National Academy of Science *1984 Priestley Medal, American Chemical Society *1984 Award for Chemistry, Arthur M. Sackler Foundation *1987 Award in Chemical Education, American Chemical Society *1989 Vannevar Bush Award, National Science Board *1990 Richard C. Tolman Medal, Southern California, Section, American Chemical Society *2008 \"American Scientists\" US stamp series, $0.41, for his sickle cell disease work == Notable Students == *Jerry Donohue *Martin Karplus *Matthew Meselson *Edgar Bright Wilson *William Lipscomb == Notes == Category:1901 births Category:1994 deaths Category:Unitarians Category:American biochemists Category:Time People of the Year Category:American activists Category:American Nobel Prize winners Category:Writers from Portland, Oregon Category:Scientists from Portland, Oregon Category:California Institute of Technology faculty",
 "title": "Linus Pauling"
}