{
 "id": "131122",
 "text": "StraboStrabo (\"squinty\") was a term employed by the Romans for anyone whose eyes were distorted or deformed. The father of Pompey was called \"Pompeius Strabo.\" A native of Sicily so clear-sighted that he could see things at great distance as if they were nearby was also called \"Strabo.\" (; 63/64 BC – ca. AD 24) was a Greek historian, geographer and philosopher. == Life == Strabo was born in a rich family from PontusGeography Book XII Chapter 3 Section 15, \"Amaseia, my fatherland.\" which had become part of the Roman Empire a short time before.Pontus fell to the Roman general Pompey in 63 BC and after the murder or suicide of Mithridates VI of Pontus was broken up into smaller provinces in 64 BC. Strabo in Book 12 Chapter 3 Section 41 states that the Romans took possession of Bithynia \"a little before my time\", setting the date of his birth to after 63 BC. His mother was Georgian. He studied under several geographers and philosophers. Later he made long travels to Egypt and Kush, among others. It is not known when his Geography was written, though comments within the work itself place the finished version within the reign of Emperor Tiberius. Strabo's History is nearly completely lost. Although Strabo quotes it himself, and other classical authors mention that it existed, the only surviving document is a fragment of papyrus now in possession of the University of Milan (renumbered [Papyrus] 46). Several different dates have been proposed for Strabo's death, but most of them place it shortly after 23. == The Geography == Strabo is mostly famous for his 17-volume work Geographica, which presented a descriptive history of people and places from different regions of the world known to his era. It is an important source of information on the ancient world. == Notes == == References == * Strabo in Greek, Teubner Edition. Downloadable Google Books at . == Other websites == * Biography of Strabo Category:60s BC births Category:24 deaths Category:Greek geographers Category:Ancient Greek historians",
 "title": "Strabo"
}