{
 "id": "131141",
 "text": "Identity theft is a type of fraud that involves using personal details belonging to the victim. This may be a passport, social security card, student pass, credit card etc. A person who has his or her identity stolen can end up owing money when the thief spends the person's money or uses the person's credit. Identity theft is a serious crime that affects thousands of people. Globally around 40% of the people have been targets of an identity theft crime at least once. With the pace of development in the online or the digital landscape, identity theft is becoming more sophisticated each day. As per statistics, there were 4.54 billion internet users in 2020 which is 59% of the world’s population. On average, there is a 7% rise in internet penetration annually. Meanwhile, there is a remarkable rise in online shopping, social media, and app usage. Accordingly, on average, people spend nearly 7 hours on the internet. With a wide online presence, identity theft has become inevitable in modern society. Out of all the countries, the USA has consistently topped the list with 16.7 million Identity theft victims reported in 2017 accounting for an overall loss estimated at more than USD 17 billion. Since there is a marked rise in identity theft every year, people should be more vigilant about the potential theft of their personal and financial information. Accordingly, it is highly advisable to safeguard one’s login credentials, create strong passwords and keep the virus guards up to date. It is prudent to constantly monitor your bank accounts for any dubious transactions. Besides, special caution needs to be taken when disposing of financial statements, receipts, and credit card bills. Five of The Most Common Types of identity theft: # Financial Identity Theft: This is the most common type of identity theft because cyber crime is an illegal business. The financial motivation is high. Cyber criminals will impersonate you so they can gain access to your money – whether it’s stealing and using your credit or debit card information, opening credit lines under your name, or finding ways to get access to your bank account details to drain it. # Medical Identity Theft: Cyber criminals use your personal information, such as your name, your social security number, and your health insurance information. Why? To either receive medical care in your name, get prescription drugs, buy medical devices, or even submit a claim to your medical insurance. #Criminal Identity Theft: Someone will commit a crime, posing as you when they get in trouble. They may use your name, data of birth, social security number and any other personal information during an investigation or arrest. Imagine if your data is added to the state criminal database or potentially the national database! # Child Identity Theft: This type of identity theft happens when a Cyber criminal uses a child’s sensitive personal information to obtain services or benefits such as applying for government benefits, healthcare coverage or nutrition assistance. It also applies to committing fraud (such as applying for a credit card or loan, signing up for utility services, or renting a living space by using your name, social security number, address, or date of birth.) # Synthetic Identity Theft: This form of identity theft combines real and fake information. It’s using your social security number with fake name or address, therefore creating a new identity. This form of identity theft is more impactful to financial institutions, lenders, insurances, and government agencies; however, if a Cyber criminal is using your social security number, even when the rest of the information is not yours, it could affect your credit score or haunt you in many ways. == References == == Related pages == * Impersonator Category:Fraud",
 "title": "Identity theft"
}