{
 "id": "131328",
 "text": "The discography of Soundgarden, an American rock band, consists of six studio albums, one live album, four compilation albums, seven extended plays, twenty- four singles and eighteen music videos. This list does not include material recorded by Soundgarden band members with Skin Yard, Temple of the Dog, Pearl Jam, Hater, Wellwater Conspiracy, or Audioslave. Soundgarden was formed in 1984 by vocalist Chris Cornell, guitarist Kim Thayil, and bassist Hiro Yamamoto. The band signed with the independent label Sub Pop and released the Screaming Life EP in 1987 and the Fopp EP in 1988. In 1988, the band signed with legendary punk record label SST Records and released its debut full- length album Ultramega OK. The band subsequently signed with A&M; Records, becoming the first grunge band to sign with a major label. In 1989, the band released its first album for a major label, Louder Than Love. In 1990, the band was joined by a new bass player, Ben Shepherd. They released Badmotorfinger in 1991. The album brought the band to a new level of commercial success, and Soundgarden found itself amidst the sudden popularity and attention being paid to the Seattle music scene. The band's next album was to be its breakthrough. Superunknown, released in 1994, debuted at number one on the Billboard 200 and launched several successful singles, including \"Spoonman\" and \"Black Hole Sun\". In 1996, the band released its fifth studio album, Down on the Upside; while successful, the album could not emulate the precedent set by Superunknown. In 1997, the band broke up because they could no longer agree on how their music sounded. The members worked on other projects for more than ten years. Soundgarden got back together in 2010. Two years later, they released their sixth studio album, King Animal. ==Studio albums== Year Album details Peak chart positions Certifications (sales thresholds) US AUS AUT BEL CAN GER NLD NOR NZ SWE UK 1988 Ultramega OK *Released: October 31, 1988 *Label: SST *Formats: CD, cassette (CS), LP — — — — — — — — — — — 1989 Louder Than Love *Released: September 5, 1989 *Label: A&M; *Formats: CD, CS, LP 108 — — — — — — — — — — 1991 Badmotorfinger *Released: October 8, 1991 *Label: A&M; *Formats: CD, CS, LP 39 — — — 50 — — — 16 — 39 1994 Superunknown *Released: March 8, 1994 *Label: A&M; *Formats: CD, CS, LP 1 1 19 — 2 13 11 5 1 3 4 1996 Down on the Upside *Released: May 21, 1996 *Label: A&M; *Formats: CD, CS, LP 2 1 12 18 4 15 12 6 1 3 7 \"—\" denotes albums that did not chart. ==Compilations== Year Album details Peak chart positions US AUS NZ UK 1990 Screaming Life/Fopp *Released: May 11, 1990 *Label: Sub Pop *Formats: CD, CS — — — — 1997 A-Sides *Released: November 4, 1997 *Label: A&M; *Formats: CD, CS 63 39 6 90 \"—\" denotes albums that did not chart. ==Extended plays== Year Album details 1987 Screaming Life *Released: October 1, 1987 *Label: Sub Pop *Formats: CS, LP 1988 Fopp *Released: August 1, 1988 *Label: Sub Pop *Format: LP 1990 Loudest Love *Released: October 1990 *Label: A&M; *Format: CD 1992 Satanoscillatemymetallicsonatas (SOMMS) *Released: June 23, 1992 *Label: A&M; *Format: CD with limited editions of Badmotorfinger 1995 Songs from the Superunknown *Released: November 21, 1995 *Label: A&M; *Format: CD ==Singles== Year Single Peak chart positions Album US Main US Mod AUS CAN GER IRE NLD NZ SWE UK 1987 \"Hunted Down\" — — — — — — — — — — Screaming Life EP 1989 \"Flower\" — — — — — — — — — — Ultramega OK \"Loud Love\" — — — — — — — — — 87 Louder Than Love 1990 \"Hands All Over\" — — — — — — — — — 82 \"Room a Thousand Years Wide\" — — — — — — — — — — Non-album single 1991 \"Jesus Christ Pose\" — — — — — — — — — 30 Badmotorfinger \"Outshined\" — — — — — — — — — 50 1992 \"Rusty Cage\" — — — — — — — — — 41 1994 \"Spoonman\" 3 9 23 12 — 23 37 10 37 20 Superunknown \"The Day I Tried to Live\" 13 25 — — — — — — — 42 \"Black Hole Sun\" 1 2 6 5 26 7 25 22 19 12 \"My Wave\" 11 18 50 66 — — — 46 — — \"Fell on Black Days\" 4 13 — 66 — 14 45 — — 24 1996 \"Pretty Noose\" 4 2 22 43 — — — 18 42 14 Down on the Upside \"Burden in My Hand\" 1 2 — 9 — — — — — 33 \"Blow Up the Outside World\" 1 8 — 89 — — — — — 40 1997 \"Ty Cobb\" — — — — — — — — — — \"Rhinosaur\" 19 — — — — — — — — — \"Bleed Together\" 13 32 — — — — — — — — A-Sides 2010 \"Spoonman (Live)\" — — — — — — — — — — Non album single \"—\" denotes singles that did not chart. ==Videos== Year Video details US peak chart position 1990 Louder Than Live *Released: May 22, 1990 *Label: A&M; *Format: VHS 15 1992 Motorvision *Released: November 17, 1992 *Label: A&M; *Format: VHS 25 ==Music videos== Year Title Director 1988 \"Flower\" Mark Miremont 1989 \"Loud Love\" Kevin Kerslake 1990 \"Hands All Over\" Kevin Kerslake 1991 \"Jesus Christ Pose\" Eric ZimmermanSoundgarden Rail Against the \"Jesus Christ Pose\" in New and Gripping Video. Levine Schneider Public Relations. October 30, 1991. 1991 \"Outshined\" Matt MahurinMacnie, Jim. \"Soundgarden Hyperventilate and See Stars: The Godfathers of Grunge Go Psychedelic\". Musician. April 1994. 1991 \"Outshined\" (Canadian version) 1992 \"Rusty Cage\" Eric Zimmerman 1994 \"Spoonman\" Jeffrey Plansker 1994 \"The Day I Tried to Live\" Matt Mahurin 1994 \"Black Hole Sun\" Howard Greenhalgh 1994 \"My Wave\" Henry ShepherdCross, Charles R. \"Soundgarden: The Home Team Wins the World Series\". The Rocket. December 21, 1994. Doug Pray 1994 \"Fell on Black Days\" Jake Scott 1996 \"Pretty Noose\" Frank KozikZogbi, Marina. \"Upshot on \"The Upside\" from Kim Thayil\". Metal Edge. August 1996. 1996 \"Pretty Noose\" (International version) Henry Shepherd 1996 \"Burden in My Hand\" Jake Scott 1996 \"Blow Up the Outside World\" Gerald CasaleGold, Jonathan. \"Chris Cornell: Great Voice. Great Face. Great Soul\". Details. December 1996. 2010 \"Get On the Snake\" ==Other appearances== Year Song Title Label 1986 \"Heretic\" \"Tears to Forget\" \"All Your Lies\" Deep Six C/Z 1988 \"Sub Pop Rock City\" Sub Pop 200 Sub Pop 1990 \"Ugly Truth\" (live) New Music Awards College Media, Inc. \"Fresh Deadly Roses\" Pave the Earth A&M; 1992 \"Birth Ritual\" Singles: Original Motion Picture Soundtrack Epic 1993 \"Show Me\" No Alternative Arista \"HIV Baby\" Born to Choose Rykodisc 1994 \"New Damage\" (with Brian May) Alternative NRG Hollywood 1995 \"Blind Dogs\" The Basketball Diaries: Original Motion Picture Soundtrack Island 1996 \"Kyle Petty, Son of Richard\" Home Alive: The Art of Self-Defense Epic ==References== ==Other websites== *Discography on the Unofficial Soundgarden Homepage * Category:Discographies of American artists Discography",
 "title": "Soundgarden discography"
}