{
 "id": "131337",
 "text": "List of Soundgarden awards Award Won Nominations ;Clio Awards ;Grammy Awards ;MTV Video Music Awards Total Awards Footnotes Soundgarden was an American rock band formed in Seattle, Washington in 1984 by lead singer and drummer Chris Cornell, lead guitarist Kim Thayil, and bassist Hiro Yamamoto. Matt Cameron became the band's permanent drummer in 1986 and bassist Ben Shepherd replaced Yamamoto permanently in 1990. Soundgarden released its debut album, Ultramega OK, in 1988 through SST Records. The album earned the band its first major award nomination, a Grammy Award, in 1990. In 1989, the band released its first album for a major label, Louder Than Love. The band's third studio album, Badmotorfinger, released in 1991, was nominated for a Grammy Award for Best Metal Performance in 1992. Soundgarden released its follow-up and breakthrough album, Superunknown, in 1994. The album was nominated for the Grammy Award for Best Rock Album in 1995. Two singles from Superunknown, \"Black Hole Sun\" and \"Spoonman\", won Grammy Awards, and the music video for \"Black Hole Sun\" won a MTV Video Music Award and a Clio Award. Superunknown was ranked number 336 on Rolling Stone magazine's list of the 500 greatest albums of all time, and \"Black Hole Sun\" was ranked number 25 on VH1's list of the 100 greatest songs of the '90s. The band released its fifth and final studio album, Down on the Upside, in 1996. In 1997, Soundgarden received another Grammy nomination, for the lead single \"Pretty Noose\". Soundgarden officially broke up in 1997. The band was placed at number 14 on VH1's list of the 100 greatest artists of hard rock. ==Clio Awards== The Clio Awards are awarded annually. Soundgarden has received one award from one nomination. |- |align=\"center\"| 1995 || \"Black Hole Sun\" || Silver Award - Alternative Music Video || ==Grammy Awards== The Grammy Awards are awarded annually by the National Academy of Recording Arts and Sciences. Soundgarden has received two awards from eight nominations. |- |align=\"center\"| 1990 || Ultramega OK || Best Metal Performance || |- |align=\"center\"| 1992 || Badmotorfinger || Best Metal Performance || |- |align=\"center\"| 1993 || \"Into the Void (Sealth)\" || Best Metal Performance || |- |rowspan=\"4\" align=\"center\"| 1995 ||rowspan=\"2\"| \"Black Hole Sun\" || Best Hard Rock Performance || |- | Best Rock Song || |- | \"Spoonman\" || Best Metal Performance || |- | Superunknown || Best Rock Album || |- |align=\"center\"| 1997 || \"Pretty Noose\" || Best Hard Rock Performance || |} ==MTV Video Music Awards== The MTV Video Music Awards are awarded annually by MTV. Soundgarden has received one award from one nomination. |- |align=\"center\"| || \"Black Hole Sun\" || Best Metal/Hard Rock Video || ==Miscellaneous awards and honors== Year Nominated work Award/honor Nominator 1989 \"Flower\" Singles of the Year (#31) Spex 1994 \"Black Hole Sun\" Singles of the Year (#15) Spex 1995 Superunknown The 100 Best Albums of 1991-1995 (#49) Muziekkrant OOR 1998 Badmotorfinger 100 Albums You Must Hear Before You Die (#25)\"100 Albums You Must Hear Before You Die\". Kerrang!. Kerrang! 1998 Superunknown 100 Albums You Must Hear Before You Die (#70) Kerrang! 1998 Superunknown The 90 Greatest Albums of the 90s (#18) Alternative Press 1999 Superunknown Top 90 Albums of the 90s (#70) Spin 2000 Soundgarden 100 Greatest Artists of Hard Rock (#14) VH1 2002 Badmotorfinger The 69 Greatest Metal Albums of All Time (#26)\"The 69 Greatest Metal Albums of All Time.\" Revolver. September/October 2002. Revolver 2002 \"Black Hole Sun\" 100 Greatest Singles of All Time (#49) Kerrang! 2002 \"Jesus Christ Pose\" 100 Greatest Singles of All Time (#95) Kerrang! 2003 \"Black Hole Sun\" The 1001 Best Songs Ever (#543) Q 2003 Superunknown The 500 Greatest Albums of All Time (#336) Rolling Stone 2005 \"Jesus Christ Pose\" The Ultimate Music Collection Q 2005 Superunknown 100 Greatest Albums, 1985–2005 (#84) Spin 2006 Badmotorfinger 100 Greatest Guitar Albums of All Time (#45)\"100 Greatest Guitar Albums of All Time\". Guitar World. October 2006. Guitar World 2006 \"Black Hole Sun\" 100 Hottest Guitar Solos (#56)\"100 Hottest Guitar Solos\". Total Guitar. May 2006. Total Guitar 2007 \"Black Hole Sun\" 100 Greatest Guitar Solos (#63)\"100 Greatest Guitar Solos\" . Guitar World. 2007. Guitar World 2007 \"Black Hole Sun\" 100 Greatest Songs of the '90s (#25) VH1 ==References== Awards Category:Music-related lists",
 "title": "List of Soundgarden awards"
}