{
 "id": "131334",
 "text": "Soundgarden is an American rock band. They began in Seattle, Washington in 1984. They first had three members: singer and drummer Chris Cornell, lead guitarist Kim Thayil, and bassist Hiro Yamamoto. At first, Cornell, played the drums while singing. In 1985 the band chose Scott Sundquist to be drummer, so Cornell could just be the singer.George-Warren, Holly, Patricia Romanowski, and Jon Pareles. The Rolling Stone Encyclopedia of Rock & Roll. Rolling Stone Press. 2001. . In 1986, Sundquist left the band to spend time with his wife and child. He was replaced by Matt Cameron, the drummer for Skin Yard, who became Soundgarden's permanent drummer. Yamamoto left the band in 1989, after recording the latest album. He went back to college to finish his Master's degree in physical chemistry.\"How Does Your Garden Grow?\". Sounds. October 21, 1989. He was replaced by former Nirvana guitarist Jason Everman. Everman was fired right after Soundgarden's tour to promote the Louder Than Love album. His only contribution for Soundgarden was the band's cover of The Beatles song \"Come Together\". In 1990, the band was joined by a new bassist, Ben Shepherd. After this, Soundgarden's line-up would not change until their break-up. In 1996, the group became unhappy while recording Down on the Upside. Thayil and Cornell seemed to not agree on a change from the heavy guitar riffs that had become the band's trademark.Colopino, John. \"Soundgarden Split\". Rolling Stone. May 29, 1997. In 1997, the band broke up. They had not been getting along during the past half year.Gilbert, Jeff. \"Sound of Silence\". Guitar World. February 1998. In January 2010, Cornell announced that Soundgarden would be getting back together. Two years later, they released their sixth studio album, King Animal. ==Band members== Current members * Chris Cornell – lead vocals, rhythm guitar (1984–97, 2010–2017), drums (1984–85) * Kim Thayil – lead guitar (1984–97, 2010–present) * Ben Shepherd – bass, backing vocals (1990–97, 2010–present) * Matt Cameron – drums, backing vocals (1986–97, 2010–present) Former members * Hiro Yamamoto – bass, backing vocals (1984–89) * Scott Sundquist – drums, backing vocals (1985–86) * Jason Everman – bass (1989–90) Touring members * Matt Chamberlain – drums (2014) ===Timeline=== == Gallery == Chris_Cornell_12-jul-09.JPG|Chris Cornell in Lisbon in 2009 File:Matt- Cameron_Pearl_Jam.jpg|Matt Cameron performing with Pearl Jam in 2009 Soundgarden_@_McCallum_Park_(522012).jpg|Kim Thayil performing live at Big Day Out Festival 2012 Ben_Shepherd_at_Brixton_Academy.jpeg|Ben Shepherd performing live with Soundgarden at Brixton Academy in 2013 ==References== * Category:Lists of musicians",
 "title": "List of Soundgarden band members"
}