{
 "id": "131378",
 "text": "Applied mathematics is a field of mathematics which uses mathematics to solve problems of other branches of science. The contrary notion is pure mathematics. There are many fields: *Approximation theory:Trefethen, L. N. (2019). Approximation theory and approximation practice. SIAM. Sometimes it is not possible to get an exact solution to a problem, because this might take too long, or it may not be possible at all. Approximation theory looks at ways to get a solution which is close to the exact one, and which can be obtained faster. *Numerical analysis and simulation: This field investigates various algorithms to get approximations for mathematical problems.Stoer, J., & Bulirsch, R. (2013). Introduction to numerical analysis. Springer Science & Business Media.Conte, S. D., & De Boor, C. (2017). Elementary numerical analysis: an algorithmic approach. Society for Industrial and Applied Mathematics.Greenspan, D. (2018). Numerical Analysis. CRC Press.Linz, P. (2019). Theoretical numerical analysis. Courier Dover Publications. The study of numerical linear algebraDemmel, J. W. (1997). Applied numerical linear algebra. SIAM.Ciarlet, P. G., Miara, B., & Thomas, J. M. (1989). Introduction to numerical linear algebra and optimization. Cambridge University Press.Trefethen, Lloyd; Bau III, David (1997). Numerical Linear Algebra (1st ed.). Philadelphia: SIAM. and validated numerics Tucker, Warwick (2011). Validated Numerics: A Short Introduction to Rigorous Computations. Princeton University Press.Rump, S. M. (2010). Verification methods: Rigorous results using floating-point arithmetic. Acta Numerica, 19, 287-449. are also included in this field. *Probability and Statistics:DeGroot, M. H., & Schervish, M. J. (2012). Probability and statistics. Pearson Education.Johnson, R. A., Miller, I., & Freund, J. E. (2000). Probability and statistics for engineers (Vol. 2000, p. 642p). London: Pearson Education.Walpole, R. E., Myers, R. H., Myers, S. L., & Ye, K. (1993). Probability and statistics for engineers and scientists (Vol. 5). New York: Macmillan. How likely is it that something will happen? - If a coin is flipped 100 times, and lands heads up 53 times, is this coin good for games of chance, or should another one be taken? *Optimization is about finding better solutions to problems.Intriligator, M. D. (2002). Mathematical optimization and economic theory. Society for Industrial and Applied Mathematics. *In ecology certain things are known about populations of animals or plants. This is usually called Population model. Biologists use them to tell how a population changes over time. ==References== ==Related pages== * Society for Industrial and Applied Mathematics (SIAM) * International Association for Mathematics and Computers in Simulation (IMACS) * International Congress on Industrial and Applied Mathematics * Japan Society for Industrial and Applied Mathematics (JSIAM, Japanese counterpart of SIAM) * Japan Society for Simulation Technology (JSST, Japanese counterpart of IMACS) ==Other websites== * * The Society for Industrial and Applied Mathematics (SIAM) is a professional society for promoting the interaction between mathematics and other scientific and technical communities. With organizing and sponsoring many conferences, SIAM is a major publisher of research journals and textbooks in applied mathematics. *The Applicable Mathematics Research Group at Notre Dame University *Centre for Applicable Mathematics at Liverpool Hope University *Applicable Mathematics research group at Glasgow Caledonian University",
 "title": "Applied mathematics"
}