{
 "id": "131475",
 "text": "This is a list of rivers in Pakistan ==Tributaries of the Indus River== The following rivers are tributaries of the Indus River: *The Astore River has two branches. One branch of this river is born in Deosai area and flowing to west, reaches Astore. The other branch flowing north from Rigu joins it at Astore. From Astore it flows north-west and finally empties into the Indus River at a place south of Bonji. **The Rupal River is an east-west glacial stream rising from the meltwater of the Rupal Glacier in northern Pakistan. The stream flows through the Rupal Valley, south of Nanga Parbat, before turning northeast to the village of Tarashing. The Rupal drains into the Astore River, which eventually reaches the Indus River near Jaglot. *The Gilgit River is in the Northern Areas of Kashmir, Pakistan. **Ghizar River ***Ishkuman River ***Yasin River **Hunza River ***Hispar River ***Khunjerab River ****Chapursan River ****Gujerab River ****Misgar River ****Shimshal River *The Gomal River **The Kundar River **The Zhob River *The Hanley River takes birth in the extreme south eastern frontiers of Ladakh region and then flowing north-west empties itself into Indus River. *Kabul River, or Kabal River **Kunar River (Kunar Rud) ***Peche River **Swat River ***Panjkora River *Kurrum River or Karam River **Tochi river, sometimes referred to as the Gambila River *Panjnad River **Chenab River ***Jehlum River or Jhelum River ****Kunhar ****Liddar ****Neelum *****Poonch River ****Pohru River ****Sind Stream ****Sandran River ****Sang-e-Sufaid Kol Stream ****Vishau River ***Manawar Tavi River ***Ravi River ****Ojh Nadi River ***Tawi River ***Wardwan River **Sutlej River ***Beas River *Shayok River - a tributary of the Indus River. It rises from the Karakoram range. It is a popular place for rafting. *Shigar River () - in Baltistan District, Northern Areas, Pakistan. The Shigar River is formed from the melt water of the Baltoro Glacier and Biafo Glacier. The river is tributary to the Indus River, meeting the Indus in the Skardu valley. *Shyok River **Chang Chen Mo River **Galwan River **Nubra River **Saltoro River *The Soan River () is a river in Punjab, Pakistan. *The Sohan is a river of northern Pakistan in Punjab province. It also forms the northern border of Bannu District. *The Suru River (Indus) is a river in Jammu and Kashmir that forms the western and northern boundary of the Zanskar Range, it takes birth from the waters of Nunkun peak in its skirts flows to the north of Kargil and empties into the Indus River. **The Dras River is the source of different branches of Dras river are various glaciers in western part of Zanskar. Flowing to the north it joins the Suru River near Kargil and empties into Indus River. **The Shingo River is a tributary of the Suru River, and flows through the Ladakh region of Indian controlled Kashmir. *The Swaan River () is the most important stream of the Pothohar region of Pakistan. It drains much of the water of Pothohar. It starts near a small village Bun in the foothills of Patriata and Murree. It provides water to Simblee Dam, which is reservoir of water for Islamabad. Near Pharwala Fort it cuts through a high mountain range and that is a wonderful phenomenon of nature. The place is called Swan Cut. No stream can cut such a high mountain. It proves the Swaan was there before the formation of this range. And when the mountain rose through millions of years, the stream continued its path by cutting the rising mountain. Ling stream, following a relatively long course though Lehtrar and Kahuta falls in the Swaan near Sihala. Islamabad Highway crosses this stream near Sihala where famous bridge Cock Pull is constructed over it. Another famous, Lai stream joins this stream near Swaan Camp. After walking a tortuous path and creating a big curve, the stream reaches Kalabagh where it falls into the Indus river. This relatively small stream is more than 250 kilometers long. Due to its mountainous course and shallow bed, it is hardly used for irrigation purposes. For grinding wheat, you can find ancient types of flour mills near Chakian. Fishing is not possible in this stream as a profession. Rohu is the main species of fish in this stream. Kingfisher birds hunt here too. **The Ling stream flows in the Pothohar region of Northern Pakistan. It starts in the foothills of Lhetrar area near Kahuta and flowing and cutting its way through the hilly area it meets the Swaan River near Sehala. The road that joins Islamabad and Azad Kashmir passes it twice. Kingfisher hunts its fish. *The Tangir River originates near frontiers of Gilgit and Pakistan, in Tanglu area it flows southwards and joins Indus River near Sazin the border town of Gilgit Agency *The Zanskar River has two branches of origin. One of them takes birth in Ropshu area and flowing west-ward reaches Zanskar town. The Zanskar Gorge is in the Zanskar region of Indian-administered Kashmir . Its walls are near vertical cliffs up to 600m high. The Zanskar River is only 5m wide in places. It provides an access route to the Zanskar Valley, but only in winter when the river is frozen. The other branch of the Zanskar River is formed from the waters of the glaciers of central Zanskar and flowing south- east reaches Padam. From this place it turns to the north and collecting the waters of the Khurna River empties into the Indus River. Another stream called Zora flowing to the north from the southern frontiers, also joins Zanskar river. **The Khurna River originates in the south eastern part of Zanskar valley and flowing to northwest, joins Zanskar Gorge and at last empties into the Indus River at a place between Stok and Sispal Gompa. ==Other rivers== *The Dasht River () is in Gwadar District, Balochistan, Pakistan. Mirani Dam is being built on the Dasht river to provide drinking water to Gwadar City. **The Kech River is a tributary of the Dasht River which flows from Iran into Balochistan, Pakistan. The city of Turbat is along this river and is used to irrigate the orchards and in vegetable farming. However the area is prone to flooding - in June 2007 the flood waters entered Turbat city after the river burst it banks, thousands were affected. *The Dashtiari River () is in Gwadar District, Balochistan, Pakistan. *The Haro is the name of a river and its valley in Abbottabad District in the Khyber Pakhtunkhwa province of northern Pakistan. *The Hingol River or Hungol River is in Makran, Balochistan *The Hub River () is in Lasbela, Balochistan, Pakistan. It forms the provincial boundary between Sindh and Balochistan, west of Karachi. Hub Dam is a large water storage reservoir constructed in 1981 on the Hub River in the arid plains north of Karachi. The reservoir supplies water for irrigation in the Lasbella district of Balochistan and drinking water for the city of Karachi. It is an important staging and wintering area for an appreciable number of waterbirds and contains a variety of fish species which increase in abundance during periods of high water. The Mahseer (Tor putitora), an indigenous riverine fish in the Hub River, grows up to 2m in length and provides for excellent angling. *The Lyari River () is a small ephemeral stream that flows through the Pakistani megacity of Karachi from north east to the center and drains into the Arabian Sea at the Monora channel. It is one of the two rivers of Karachi, the other one being the Malir River. The river is about 50 kilometres (30 miles) long. As a seasonal river it carries the collected water after the rains in the catchment area. **The Gujjar Nallah () is a stream in Karachi, Sindh, Pakistan. It passes through the city from northwest to the centre and merges with the Lyari before draining into the Arabian Sea. *Malir River () is in Karachi, Sindh, Pakistan. Malir River passes through the city of Karachi from North East to the Centre and drains into the Arabian Sea. Malir river is one of the two rivers passing through Karachi, the other is the Lyari River. It has two other tributaries: one is Thadho and other is Sukhan. In a rainy season this river has considerable flows. **Thadho **Sukhan *The Poonch River originates in the western foothills of Pir Panjal range, in the areas of Neel-Kanth Gali and Jamian Gali. It is called Siran in this area. It flows to the north west. A stream flowing from Mandi joins it and then in the west of Poonch city another == Ancient rivers == *The Ghaggar-Hakra River is an intermittent river in India and Pakistan that flows only during the monsoon season. While it is often identified with the Saraswati River, this is not a consensus view. *Saraswati River or Sarasvati River was one of the major rivers of Ancient India. The river no longer exists. == References == * Pakistan rivers Pakistan",
 "title": "List of rivers of Pakistan"
}