{
 "id": "131470",
 "text": "Adam Joseph Copeland (born October 30, 1973)Copeland, Adam. Adam Copeland On Edge (p.16) is a Canadian professional wrestler and actor. He is currently signed to All Elite Wrestling (AEW), where he performs under the ring name Cope. He became famous in the World Wrestling Federation/WWE from 1998–2023 under the ring name Edge. In WWE he became an an 11-time world champion and won 14 tag team championships (seven of those teaming with his real life friend Christian). He was forced into early retirement from professional wrestling in 2011 due to a injury to his neck. Copeland was inducted into the WWE Hall of Fame on March 31, 2012 by his best friend and tag team partner Christian. During his retirement, Copeland has appeared on the Syfy series Haven where he played the character Dwight Hendrickson. Edge made a shocking return to wrestling on January 26, 2020 at WWE's Royal Rumble, in the namesake Royal Rumble match. He then started a feud with his former tag team partner Randy Orton. In 2021, he became the third man to win the Royal Rumble match from the first position. In 2022, Edge turned heel and created the stable Judgment Day, adding Damian Priest and Rhea Ripley. After being attacked by them and removed from the group later that year, Edge feuded with them and their new members Finn Bálor and Dominik Mysterio. He left WWE in September 2023, after 25 years in the company. ==All Elite Wrestling== On October 1, 2023 at WrestleDream, Copeland made his debut with All Elite Wrestling (AEW). He rescued Sting from a beatdown from Christian Cage, Nick Wayne, and Luchasaurus. In the post-event media scrum, AEW owner Tony Khan announced that Copeland had signed a contract to compete full-time. On the October 10 episode of Dynamite, Copeland made his AEW in-ring debut. He defeated Luchasaurus to also get his first victory in AEW. At Worlds End, Copeland defeated Christian Cage in a no disqualification match to win the AEW TNT Championship, his first title in a big company outside WWE. Minutes after the match, Cage would immediately use the title shot that was earned by Killswitch earlier on the pre-show and Copeland lost the title back to Cage. Copeland won the title a second time in an \"I quit\" match on March 20, 2024. On May 26 at Double or Nothing, Copeland injured his leg in a title defense against Malakai Black, which was a barbed wire steel cage match. He was stripped of the title by AEW executive vice presidents The Young Bucks (Matthew and Nicholas Jackson) on the May 29 episode of Dynamite. On December 28 at Worlds End, Copeland returned and helped FTR (Cash Wheeler and Dax Harwood) in taking out the Death Riders (Jon Moxley, Claudio Castagnoli, and Wheeler Yuta). They formed the trio \"Rated FTR\". Four days later at Fight for the Fallen, Copleland changed his ring name to \"Cope\". ==Acting== ===Movies=== *Beyond the Mat - Himself (1999) (Uncredited) *Highlander: Endgame - Lachlan (2000) *Bending the Rules - Nick Blades (2012) *Interrogation (2016) *Money Plane - Jack Reese (2020) ===Television=== *Weakest Link - Himself (2002) *TV total - Himself (2003) *Mind of Mencia - Himself (2006) *Deal or No Deal - Himself (2007) *MADtv - Himself (2007) *Sanctuary - Thelo (2011) *Haven - Dwight Hendrickson (2011 – 2015) *The Flash - Albert Rothstein / Atom Smasher (2015) *Vikings - Kjetill Flatnose (2017 - 2020) *Trailer Park Boys: The Animated Series - Sledge (2020) (voice) *Percy Jackson and the Olympians - Ares (2024) ==Championships== *All Elite Wrestling **AEW TNT Championship (2 times) *Canadian Wrestling Association **CWA North American Championship (1 time) * Insane Championship Wrestling ** ICW Street Fight Tag Team Championship (2 times) (with Christian Cage (1) and Joe E. Legend (1)) ** ICW/MWCW Mid-West Unified Tag Team Championship (1 time) (with Joe E. Legend) *George Tragos/Lou Thesz International Wrestling Institute **Lou Thesz Award (2013) *Outlaw Championship Wrestling **OCW Tag Team Championship (1 time) (with Joe E. Legend) *Pro Wrestling Illustrated **PWI Comeback of the Year (2004) **PWI Feud of the Year (2005) (with Lita vs. Matt Hardy) **PWI Feud of the Year (2006) (vs. John Cena) **PWI Match of the Year (2000) (with Christian vs. The Dudley Boyz vs. The Hardy Boyz in a Triangle Ladder match at WrestleMania 2000) **PWI Match of the Year (2001) (with Christian vs. The Dudley Boyz vs. The Hardy Boyz in a Tables, Ladders, and Chairs match at WrestleMania X-Seven) **PWI Most Hated Wrestler of the Year (2006) **PWI Most Improved Wrestler of the Year (2001) **He was ranked #2 on the top PWI 500 singles wrestlers of 2007. * World Wrestling Federation/World Wrestling Entertainment/WWE ** WWE Championship (4 times) ** World Heavyweight Championship (7 times) ** WCW United States Championship (1 time)1 ** WWF/E Intercontinental Championship (5 times) ** World Tag Team Championship (12 times) (with Christian (7), Hulk Hogan (1), Chris Benoit (2), Randy Orton (1) and Chris Jericho (1)) ** WWE Tag Team Championship (2 times) (with Rey Mysterio (1) and Chris Jericho (1)) ** King of the Ring (2001) ** Money in the Bank (2005) ** Royal Rumble (2010, 2021)) ** Fourteenth Triple Crown Champion ** WWE Hall of Fame (Class of 2012) ** Slammy Award for Couple of the Year (2008) (with Vickie Guerrero) ** Slammy Award for \"Oh Snap\" Meltdown of the Year (2010) ** 2010 Bragging Rights Trophy (with Team SmackDown (Big Show, Rey Mysterio, Jack Swagger, Alberto Del Rio, Tyler Reks and Kofi Kingston)) *Wrestling Observer Newsletter **Match of the Year (2002) (with Rey Mysterio vs. Kurt Angle and Chris Benoit at No Mercy) **Tag Team of the Year (2000) (with Christian) **Worst Feud of the Year (2010) (vs. Kane) **Worst Worked Match of the Year (2008) (vs. Vladimir Kozlov and Triple H at Survivor Series) 1Edge won the championship during the Invasion storyline. ===Lucha de Apuestas record=== Wager Winner Loser Location Date Notes Hair Edge Kurt Angle Nashville, Tennessee May 19, 2002 Hair vs. hair match at Judgment DayCopeland, Adam. Adam Copeland On Edge (p.204) == References == * ==Other websites== * * * Category:1973 births Category:All Elite Wrestling people Category:Canadian professional wrestlers Category:Canadian movie actors Category:Canadian television actors Category:Former WWE wrestlers Category:Living people Category:Sportspeople from Ontario Category:WWE Hall of Fame Category:People from Asheville, North Carolina",
 "title": "Edge (wrestler)"
}