{
 "id": "131574",
 "text": "The 1959–60 NHL season was the 43rd season of the National Hockey League. The Montreal Canadiens were the Stanley Cup winners as they defeated the Toronto Maple Leafs four games to none for their fifth straight Stanley Cup. == Regular season == ===Final standings=== National Hockey League GP W L T Pts GF GA PIM Montreal Canadiens 70 40 18 12 92 255 178 756 Toronto Maple Leafs 70 35 26 9 79 199 195 859 Chicago Black Hawks 70 28 29 13 69 191 180 970 Detroit Red Wings 70 26 29 15 67 186 197 538 Boston Bruins 70 28 34 8 64 220 241 932 New York Rangers 70 17 38 15 49 187 247 850 ===Scoring leaders=== Note: GP = Games played; G = Goals; A = Assists; Pts = Points Player Team GP G A Pts Bobby Hull Chicago Black Hawks 70 39 42 81 Bronco Horvath Boston Bruins 68 39 41 80 Jean Beliveau Montreal Canadiens 60 34 40 74 Andy Bathgate New York Rangers 70 26 48 74 Henri Richard Montreal Canadiens 70 30 43 73 Gordie Howe Detroit Red Wings 70 28 45 73 Bernie Geoffrion Montreal Canadiens 59 30 41 71 Don McKenney Boston Bruins 70 20 49 69 Vic Stasiuk Boston Bruins 69 29 39 68 Dean Prentice New York Rangers 70 32 34 66 ===Leading goaltenders=== Note: GP = Games played; MIN = Minutes played; GA = Goals against; SO = Shut outs; AVG = Goals against average Player Team GP MINS GA SO AVG Jacques Plante Montreal Canadiens 69 4140 175 3 2.54 Glenn Hall Chicago Black Hawks 70 4200 179 6 2.56 Terry Sawchuk Detroit Red Wings 58 3480 155 5 2.67 Johnny Bower Toronto Maple Leafs 66 3960 177 5 2.68 Don Simmons Boston Bruins 28 1680 91 2 3.25 Harry Lumley Boston Bruin 42 2520 146 2 3.48 Gump Worsley New York Rangers 39 2301 135 0 3.52 == Stanley Cup playoffs == All dates in 1960 ===Playoff bracket=== === Semifinals === Chicago Black Hawks vs. Montreal Canadiens Date Away Score Home Score Notes March 24 Chicago Black Hawks 3 Montreal Canadiens 4 March 26 Chicago Black Hawks 3 Montreal Canadiens 4 (OT) March 29 Montreal Canadiens 4 Chicago Black Hawks 0 March 31 Montreal Canadiens 2 Chicago Black Hawks 0 Montreal wins best-of-seven series 4 games to 0 Detroit Red Wings vs. Toronto Maple Leafs Date Away Score Home Score Notes March 23 Detroit Red Wings 2 Toronto Maple Leafs 1 March 26 Detroit Red Wings 2 Toronto Maple Leafs 4 March 27 Toronto Maple Leafs 5 Detroit Red Wings 4 (3OT) March 29 Toronto Maple Leafs 1 Detroit Red Wings 2 (OT) April 2 Detroit Red Wings 4 Toronto Maple Leafs 5 April 3 Toronto Maple Leafs 4 Detroit Red Wings 2 Toronto wins best- of-seven series 4 games to 2 ===Finals === Toronto Maple Leafs vs. Montreal Canadiens Date Away Score Home Score Notes April 7 Toronto Maple Leafs 2 Montreal Canadiens 4 April 9 Toronto Maple Leafs 1 Montreal Canadiens 2 April 12 Montreal Canadiens 5 Toronto Maple Leafs 2 April 14 Montreal Canadiens 4 Toronto Maple Leafs 0 Montreal wins best-of-seven series 4 games to 0 ===Playoff leading scorers=== Note: GP = Games played; G = Goals; A = Assists; Pts = Points Player Team GP G A Pts Henri Richard Montreal Canadiens 8 3 9 12 Bernie Geoffrion Montreal Canadiens 8 2 10 12 Leonard \"Red\" Kelly Toronto Maple Leafs 10 3 8 11 Dickie Moore Montreal Canadiens 8 6 4 10 Alex Delvecchio Detroit Red Wings 6 2 6 8 Jean Beliveau Montreal Canadiens 8 5 2 7 Bert Olmstead Toronto Maple Leafs 10 3 4 7 ==NHL awards== 1959–60 NHL awards Prince of Wales Trophy: Montreal Canadiens Art Ross Memorial Trophy: Bobby Hull, Chicago Black Hawks Calder Memorial Trophy: Bill Hay, Chicago Black Hawks Hart Memorial Trophy: Gordie Howe, Detroit Red Wings James Norris Memorial Trophy Doug Harvey, Montreal Canadiens Lady Byng Memorial Trophy: Don McKenney, Boston Bruins Vezina Trophy: Jacques Plante, Montreal Canadiens ===All-Star teams=== First team Position Second team Glenn Hall, Chicago Black Hawks G Jacques Plante, Montreal Canadiens Doug Harvey, Montreal Canadiens D Allan Stanley, Toronto Maple Leafs Marcel Pronovost, Detroit Red Wings D Pierre Pilote, Chicago Black Hawks Jean Beliveau, Montreal Canadiens C Bronco Horvath, Boston Bruins Gordie Howe, Detroit Red Wings RW Bernie Geoffrion, Montreal Canadiens Bobby Hull, Chicago Black Hawks LW Dean Prentice, New York Rangers ==References== *Hockey Database *NHL.com Category:1959 in North America Category:1960 in North America Category:National Hockey League seasons",
 "title": "1959–60 NHL season"
}