{
 "id": "131637",
 "text": "Christopher Keith Irvine (born November 9, 1970), better known by his ring name Chris Jericho, is an American - Canadian professional wrestler, rock musician,actor, author, and radio host. He is currently signed to AEW, where he became the first ever AEW World Champion and a one-time FTW Champion. Jericho is also known for his appearances with the World Wrestling Federation/WWE, World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW) and internationally in Canadian, Mexican and Japanese promotions. As a part of WWE, he is credited as being the first-ever Undisputed WWF Champion. He also won the Intercontinental Championship a record nine times. Jericho is a six-time world champion, having won the WCW World Heavyweight Championship twice, the aforementioned Undisputed Championship, and the World Heavyweight Championship three times. He is also the Ninth Triple Crown Champion and Third Grand Slam Champion. Jericho is also the frontman of Fozzy, an American heavy metal band. Jericho uses the theme song \"Break The Walls Down\" as his entrance theme. On May 24, 2012, during a match against CM Punk in São Paulo, Brazil, Jericho dropped and kicked the flag of Brazil which is a crime in that country. The police went to the ring and threatened to arrest Jericho. Jericho apologized to the crowd and was suspended by the WWE for 30 days. Jericho returned on June 25 episode of Raw, his disappearance was explained by a European tour with his band Fozzy which happened to coincide with his suspension. On the June 30, 2014 episode of Raw, Jericho made a surprise return to the WWE and attacked The Miz who had also returned minutes earlier. Jericho was then attack by The Wyatt Family. He currently hosts weekly podcast called \"Talk Is Jericho\" on PodcastOne.com. ==Discography== *Fozzy (2000) *Happenstance (2002) *All That Remains (2005) *Chasing the Grail (2010) *Sin and Bones (2012) *Do You Wanna Start a War (2014) *Judas (2017) ==In wrestling== *Finishing moves **Breakdown (Full nelson facebuster) – 2001–2002 **Codebreaker (Double knee facebreaker, sometimes while springboarding) – 2007–present **Lion Tamer (Boston crab while kneeling on the opponent's back or neck) – 1996–present **Walls of Jericho (Elevated Boston crab) – 1996–present **Lionsault (Springboard moonsault) – 1996–2005; He used it as a signature move afterwards *Signature moves **Backbreaker submission **Backhand chop **Baseball slide **Diving double axe handle **Diving reverse elbow **Double underhook backbreaker **Double underhook powerbomb **Flashback (Sleeper slam, he sometimes used it as a counter to an oncoming opponent) – 1999–2000 **Flying forearm smash **Jericho Spike (Hurricanrana, sometimes from the top rope) **Multiple kick variations ***Missile drop ***Spinning heel ***Springboard drop to an opponent on the ring apron ***Standing, leg-feed or a running enzuigiri **Multiple powerbombs sometimes followed by a pin **Multiple suplex variations ***Belly to back ***Northern Lights ***Super ***Tiger ***Vertical **One-handed bulldog **Putting his foot on the opponent's chest in a pinning attempt, with theatrics **Running back elbow, sometimes while performing a corkscrew **Springboard plancha **Tilt-a-whirl backbreaker *Managers **Ralphus (part of \"Jericho Personal Security\") **The Jerichoholic Ninja (part of \"Jericho Personal Security\") **Viva Los Jericho (part of \"Jericho Personal Security\") **Mr. Hughes **Chyna **Stephanie McMahon **Lance Cade *Nicknames **\"Lionheart\" **\"The Man of 1,004 Holds\" **\"Y2J\" **\"The Ayatollah of Rock 'n' Rolla\" **\"The Sexy Beast\" **\"The (self-proclaimed) Living Legend\" **\"The King of the World\" **\"The Best In The World At What He Does\" *Entrance themes **\"Rock America\" by Danger Danger (SMW) **\"Soul-Crusher\" by White Zombie (ECW) **\"Electric Head, Pt. 2 (The Ecstasy)\" by White Zombie (ECW) **\"All The Days\" by Mammoth (WCW) **\"One Crazed Anarchist\" by Grunge City from the Aircraft Music Library (WCW) **\"Break the Walls Down\" by Adam Morenoff (WWF/E; August 9, 1999 – August 25, 2005; November 19, 2007 – September 27, 2010; January 2, 2012 – present) **\"King of My World\" by Saliva (WWF/E; 2002) **\"Don't You Wish You Were Me\" by Fozzy (WWE; 2004) **\"Crank the Walls Down\" by Maylene & The Sons of Disaster (WWE; July 31, 2009 – January 4, 2010; Used while teaming with Big Show) ==Accomplishments== *Canadian Rocky Mountain Wrestling **CRMW Heavyweight Championship (one time) **CRMW North American Tag Team Championship (two times) (with Lance Storm) *Consejo Mundial de Lucha Libre **NWA World Middleweight Championship (one time)1 *Extreme Championship Wrestling **ECW World Television Championship (one time) *Pro Wrestling Illustrated **PWI Feud of the Year (2008) (vs. Shawn Michaels) **PWI Most Hated Wrestler of the Year (2002) **He was ranked #2 of the 500 best singles wrestlers in the PWI 500 in 2009. *World Championship Wrestling **WCW Cruiserweight Championship (four times) **WCW World Television Championship (one time) *World Wrestling Federation/World Wrestling Entertainment **Undisputed WWF Championship (one time)5 **World Heavyweight Championship (three times) **WCW/World Championship (two times)2 **WWF/E Intercontinental Championship (nine times)3 **World Tag Team Championship (five times) (with Chris Benoit (one), The Rock (one), Christian (one), Edge (one) and The Big Show (one)) **WWE Tag Team Championship (two times) (with Edge (one) and The Big Show (one)) **WWF European Championship (one time) **WWF Hardcore Championship (one time) **Ninth Triple Crown Champion **Fourth Grand Slam Champion **Slammy Award for Superstar of the Year (2008) **Slammy Award for Tag Team of the Year (2009) (with The Big Show) **2009 Bragging Rights Trophy (as a member of Team SmackDown with Kane, R-Truth, Matt Hardy, Finlay and The Hart Dynasty (David Hart Smith and Tyson Kidd)) *Wrestle Association \"R\" **WAR International Junior Heavyweight Championship (one time) **WAR International Junior Heavyweight Tag Team Championship (one time) (with Gedo) *World Wrestling Association **WWA Tag Team Championship (one time) (with El Dandy) *Wrestling Observer Newsletter **Best on Interviews (2003, 2008, 2009) **Best on Interviews of the Decade (2000–2009) **Feud of the Year (2008) (vs. Shawn Michaels) **Match of the Year (2008) (vs. Shawn Michaels in a Ladder match at No Mercy) **Most Underrated Wrestler (1999, 2000) **Readers' Favorite Wrestler (1999) **Wrestler of the Year (2008, 2009) **Best Pro Wrestling Book (2011) (for Undisputed: How to Become the World Champion in 1,372 Easy Steps) **Wrestling Observer Newsletter Hall of Fame (Class of 2010) 1Even though it was still using the NWA initials, Consejo Mundial de Lucha Libre is no longer part of the National Wrestling Alliance. Due to this, the NWA does not recognize or sanction this championship. 2Both of his reigns were won during and were right after The Invasion with the second WCW Championship reign being the unification with the WWF Championship and becoming the first ever Undisputed WWF Champion. 3He held the championship jointly with Chyna during his second reign. 4When Edge suffered an injury, Jericho chose Big Show as a replacement partner to hold the championships with. WWE recognizes this occurrence as two separate reigns for Jericho. 5Jericho's reign occurred after unifying the WCW Championship and the WWF Championship, making him the first-ever Undisputed WWF Champion. == Notes == == Other websites == *Official Website * * *Talk Is Jericho on PodcastOne Category:1970 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Canadian professional wrestlers Category:Canadian movie actors Category:Canadian rock singers Category:Canadian television actors Category:Former WWE wrestlers Category:Sportspeople from Winnipeg Category:Singers from New York (state) Category:Sportspeople from New York (state)",
 "title": "Chris Jericho"
}