{
 "id": "131648",
 "text": "John Nance Garner IV nicknamed \"Cactus Jack\" (November 22, 1868 – November 7, 1967) was the 44th speaker of the United States House of Representatives (1931-1933) and the 32nd Vice President of the United States (1933-1941). Garner once described the Vice-Presidency as being \"not worth a bucket of warm spit.\" Also, he lived to be 98 years and 350 days old. That made him the longest-lived former vice president of the United States. Garner was born near the village of Detroit in Red River County in eastern Texas on November 22, 1868. His parents were John Nance Garner III and his wife, the former Sarah Jane Guest. Garner studied at Vanderbilt University in Nashville, Tennessee, for one semester before dropping out and returning home. He was a member of the Pi Kappa Alpha fraternity. He eventually studied law, was admitted to the bar in 1890, and began practice in Uvalde, Uvalde County, Texas. On the morning of Garner's 95th birthday on November 22, 1963, President John F. Kennedy called to wish the former vice president a happy birthday, just hours before his assassination in Dallas. ==Death== Garner died on November 7, 1967 in Uvalde, Texas from a heart attack, at the age of 98 years and 350 days, just 15 days before what would have been his 99th birthday. Since 1964, John Garner is the longest-lived vice president of the United States in the history, a record which was previously held by Benjamin Harrison's vice president, Levi P. Morton (who died in 1920, on his 96th birthday). He is interred in Uvalde Cemetery. ==References== ==Other websites== Category:1868 births Category:1967 deaths Category:Speakers of the United States House of Representatives Category:Politicians from Texas Category:Democratic Party (United States) politicians Category:20th-century American politicians Category:Minority leaders of the United States House of Representatives Category:Deaths from myocardial infarction Category:Vice presidents of the United States Category:Members of the Texas Legislature",
 "title": "John Nance Garner"
}