{
 "id": "131805",
 "text": "In the New Testament, Jesus is crucified, dies, is buried within a tomb, and resurrected (came back to life) three days later. Christians celebrate the resurrection at Easter. Easter and Christmas are the most important Christian holidays. Christians believe that Jesus is the Son of God. They believe that the best proof of this is that He came back to life after His death. In Christian theology, the death, resurrection, and return to heaven of Jesus are the most important events of the Christian faith. The Nicene Creed states: “On the third day he rose again in accordance with the Scriptures”.Updated version of the Nicene Creed added at First Council of Constantinople in 381 AD, in Norman Tanner, New Short History of the Catholic Church, p. 33 (Burns & Oates, 2011). According to Terry Miethe, a Christian philosopher at Oxford University, the question “ ‘Did Jesus rise from the dead?’ is the most important question regarding the claims of the Christian faith.”Terry Miethe in Did Jesus Rise from the Dead? The Resurrection Debate, ed. Terry Miethe (San Francisco: Harper and Row, 1987), xi. Quoted by Michael Martin, \"The Resurrection as Initially Improbable\". In According to John R. Rice, a Baptist evangelist, the resurrection of Jesus was part of Godʼs plan for forgiving people by paying the penalty for manʼs sin.John R. Rice, The Importance of Christ's Resurrection in the Christian Faith. In: Curtis Hutson (2000), Great Preaching on the Resurrection, pp. 55–56 The Catholic church teaches: Compared to other ancient stories of men or gods being resurrected from the dead, the historical evidence for the resurrection of Jesus is extensive and strong.https://www.desiringgod.org/articles/historical-evidence- for-the-resurrection All of these New Testament writers tell about the resurrection. *Gospel of Matthew Chapters 27-28 *Gospel of Mark Chapter 16 *Gospel of Luke Chapter 24 *Gospel of John Chapters 20-21 * In all of the Gospels, Jesus says that He will die and rise again. *Acts of the Apostles Chapter 1 and others *Paulʼs letters in many places * Writer to the Hebrews Chapter 13, verse 20 *Saint Peter 1st Peter, Chapter 1, verse 3 * Both Jesus and the Apostles said that the Old Testament told about the Messiah (Christ) rising from the dead. ==Importance== * It is the event that led to the beginning of Christianity. Matthewʼs Gospel (Chapter 28) says that after His resurrection Jesus told His followers to take His message to the whole world. Within 50 years, Christians were found in many parts of the Roman Empire. * Jesus is alive, and He is able to give power to His followers to live a godly life. The Apostle Paul taught that the believer took part in the death and resurrection of Jesus. He said, “I have been crucified with Christ. It is no longer I who live, but Christ who lives in me. And the life I now live in the flesh [body] I live by faith in the Son of God, who loved me and gave himself for me.” Epistle to the Galatians Chapter 2, verse 20, ESV * The Apostle Paul also says that the resurrection is proof that God has accepted the death of Jesus to allow for the forgiveness of sins. (1st Corinthians, chapter 15, verse 17) He also says that it proves that God will allow Jesus to judge the world in a future time. (Acts, chapter 17, verse 31) * Christians believe that the resurrection shows that all their dead will also come back to life when Jesus returns. They believe that the bodily resurrection is the coming back to life of a transformed body powered by spirit, as described by Paul and the Gospels. ==References== ; Printed sources * , 2nd ed. 2007* * * * * Category:Gospels Category:Jesus Category:Christian theology",
 "title": "Resurrection of Jesus"
}