{
 "id": "131953",
 "text": "Demetria Devonne Lovato (born August 20, 1992), known as Demi Lovato, is an American singer-songwriter, philanthropist, and actress. Lovato was first in Barney & Friends (2002–2004), but became more popular from being in the television movies Camp Rock (2008) and its sequel Camp Rock 2: The Final Jam (2010). One of the songs on the first Camp Rock movie was \"This Is Me\", which Lovato sang with Joe Jonas. This song was popular and was in the Billboard Hot 100. ==Early life== Demetria Devonne Lovato was born on August 20, 1992 in Albuquerque, New Mexico. She was the child of an engineer and musician Patrick Martin Lovato (March 12, 1951 – June 22, 2013) and former Dallas Cowboys cheerleader Dianna Lee Hart (born Dianna Lee Smith; August 8, 1962). Lovato has an older sister, Dallas (born February 4, 1988); a younger maternal half- sister, actress Madison De La Garza (born December 28, 2001), and an older paternal half-sister, Amber, to whom she first spoke to when she was 20. Lovato's parents divorced in the late summer of 1994, shortly after her second birthday. Lovato's father was of Mexican, Indigenous Mexican, Jewish, Portuguese and Spanish descent, and her mother is of Italian, English, Scottish and Irish ancestry. Patrick's patrilineal great-grandmother, Maria Cristina Perea, was a daughter of Civil War Union veteran Francisco Perea (1830–1913) and a great-granddaughter of Santa Fe de Nuevo México governor Francisco Xavier Chávez. She received her high-school diploma through homeschooling in April 2009. She began playing piano at age seven and guitar at ten,\"Biography Today\", p.105 when she also began dancing and acting classes. Lovato told Ellen DeGeneres that she was bullied so much that she asked for homeschooling. == Music == As a solo musical artist, Lovato released her first album, Don't Forget, on September 23, 2008. The album started at number two on the Billboard 200. It sold 89,000 copies in the first week. It has since shipped over 500,000 copies in the United States. This earned it a gold certification in the United States. Lovato released her second album, Here We Go Again, on July 21, 2009. The album started at number one on the Billboard 200. It sold 108,000 copies in the first week. Her third studio album, Unbroken, was released on September 20, 2011. It peaked at number four on the Billboard 200. Her fourth studio album is Demi. It reached #3 on the Billboard 200. Lovato released her third album, Unbroken, on September 20, 2011. Begun in July 2010, the album experimented with R&B; and featured less pop rock. The album and the stylistic change received mixed to positive reviews from critics, who saw a growth in musicianship because of her struggles and have praised Lovato's vocals but found the music more generic than her previous efforts. The record was a commercial success, peaking at number four on the Billboard 200, with sales exceeding 97,000 copies in its first week of release, and going on to sell over 500,000 copies in the United States, being certified Gold. The album's lead single, \"Skyscraper\", was acclaimed for its messages of self-worth and confidence, peaked at number 10 on the Billboard Hot 100, selling 176,000 downloads during the first week of release, becoming Lovato's highest first week sales, until the release of \"Heart Attack\" by Lovato in 2013. The song also Lovato's highest-peaked single since \"This Is Me\" reached number nine in August 2008. The song also debuted at number two on the Hot Digital Songs chart. \"Skyscraper\" received the Best Video with a Message award at the September 2012 MTV Video Music Awards. The album's second and final single, \"Give Your Heart a Break\", peaked Billboard Hot 100 at number 16, making Lovato's fourth highest peaking song. Also, it has peaked at number 12 on the US Adult Top 40 chart, number 1 on the US Pop Songs chart and became the longest climb by a female artist to #1 in the Pop Songs chart history. In April 2014, the song was certified three-times platinum by the RIAA; as of October 2014, it has sold 2.1 million digital copies. Lovato released her fourth studio album, Demi, on May 14, 2013. It became a top-three album in the US. The album’s first single, \"Heart Attack\", reached number ten on the Billboard Hot 100. The next two singles, “Neon Lights” and “Really Don’t Care” with British singer Cher Lloyd, reached the top 40 and were both certified platinum. Her fifth studio album, Confident, was her first album to have a Parental Advisory label. It entered the Billboard 200 album chart at number two and was released on October 16, 2015. Confident became her first album issued through Island Records and Safehouse, a label she formed with singer-actor Nick Jonas. The first single from Confident, “Cool for the Summer”, reached number 11 on the Billboard Hot 100. It was certified platinum in the US and became her first top-ten hit in the UK. The single “Confident” was performed at the 2016 Democratic National Convention in Philadelphia in support of Hillary Clinton. “Stone Cold” was issued as the third single from Confident. The album gave Lovato her first Grammy Award nomination when it was nominated for Best Pop Vocal Album. Lovato released her sixth studio album, Tell Me You Love Me, on September 29, 2017. It opened at number three on the Billboard 200 album chart in the US. It featured the single “Sorry Not Sorry”, which became her highest-charting song in the US when it reached number six on the Hot 100. It also reached number nine in the UK. Lovato performed this song at the 2017 MTV Video Music Awards. The promotional singles “Tell Me You Love Me” and “You Don’t Do It for Me Anymore” were also released from the album. Lovato released her sixth studio album, Dancing with the Devil… the Art of Starting Over, on April 2, 2021. ==Discography== *Don't Forget (2008) *Here We Go Again (2009) *Unbroken (2011) *Demi (2013) *Confident (2015) *Tell Me You Love Me (2017) *Dancing with the Devil… the Art of Starting Over (2021) ==Acting career== In 2007 and 2008, Lovato played Charlotte Adams on the Disney Channel short series As the Bell Rings. Lovato auditioned for the channel's television film Camp Rock and series Sonny with a Chance during the summer of 2007, and got both parts. Lovato played the lead character, aspiring singer Mitchie Torres, in Camp Rock. The film premiered on June 20, 2008 to 8.9 million viewers. Lovato's Disney Channel sitcom Sonny with a Chance, with her character Sonny Munroe the newest cast member of the show-within-a-show So Random!, premiered on February 8. Lovato's acting ability was described by Robert Lloyd of the Los Angeles Times as \"very good\", and he compared them favorably to Hannah Montana star (and friend) Miley Cyrus. That June, she co-starred as Princess Rosalinda with Selena Gomez in the Disney Channel film, Princess Protection Program. The film, the third highest-rated Disney Channel original movie, premiered to 8.5 million viewers. In May Lovato guest-starred as a teenage schizophrenic in the sixth-season Grey's Anatomy episode, \"Shiny Happy People\". Critics praised her versatility. Camp Rock 2: The Final Jam, with Lovato reprising her role as Mitchie Torres, premiered on September 3, 2010. The film premiered to eight million viewers, the number-one cable-television movie of the year by the number of viewers. That month Lovato also announced her departure from Sonny with a Chance, putting her acting career on hiatus and ending the series; she later said that she would return to acting when she felt confident doing so. Her departure led to the spin-off series So Random! with the Sonny cast, featuring sketches from the former show-within-a-show. The series was cancelled after one season. In May, she became a judge for the second season of the American version of The X Factor, with a reported salary of one million dollars. Joining Britney Spears, Simon Cowell and L.A. Reid, it was speculated that she were chosen to attract a younger audience. Mentoring the Young Adults category, her final act (CeCe Frey) finished sixth. At the Minnesota State Fair in August, Lovato announced that after a pre-show performance at the 2012 MTV Video Music Awards she would release a single by December. On December 24, she released a video on her YouTube account of themselves singing \"Angels Among Us\" dedicated to the victims of the Sandy Hook Elementary School shooting. In March she was confirmed as returning for The X Factors third season, with her salary reportedly doubling. ==Personal life== Lovato has an eating disorder and has been diagnosed with bipolar disorder. Lovato’s father, Patrick, died of cancer on June 22, 2013, at age 53. On October 17, 2017, Lovato released a YouTube documentary called Demi Lovato: Simply Complicated, in which she described her teenage use of cocaine and performing on American Idol while hungover. Lovato considers having the right support system to be lifesaving. === Health === On July 24, 2018, the Los Angeles Police Department arrived at Lovato's home for Lovato suffering an alleged drug overdose. She was later revealed to be in stable condition. In 2021, Lovato said that she had multiple health problems because of the overdose, including multiple strokes, a heart attack, and brain damage, which caused vision problems. === Sexuality, gender and relationships === She dated Joe Jonas, whom she first met while filming Camp Rock in 2007 through 2010. Lovato dated actor Wilmer Valderrama on-and-off from 2010 until 2016. On May 19, 2021, Lovato announced that she was nonbinary and her shift to using singular they pronouns. She later changed her pronouns to include she/her in April 2022. ==Filmography== Film Year Title Role Notes 2008 Camp Rock Mitchie Torres TV film (Disney Channel Original Movie) 2009 Jonas Brothers: The 3D Concert Experience Herself Concert film 2009 Princess Protection Program Princess Rosalinda/Rosie Gonzalez TV film (Disney Channel Original Movie) 2010 Camp Rock 2: The Final Jam Mitchie Torres TV film (Disney Channel Original Movie) 2017 Demi Lovato: Simply Complicated Herself YouTube documentary (also executive producer) 2020 Eurovision Song Contest: The Story of Fire Saga Katiana Lindsdóttir Streaming movie Television Year Title Role Notes 2002–04 Barney & Friends Angela Recurring role 2006 Prison Break Danielle Curtin 1 episode 2007–08 As the Bell Rings Charlotte Adams Main role (season 1) 2007 Just Jordan Nicole 1 episode 2008 Jonas Brothers: Living the Dream Herself 2 episodes 2009–11 Sonny with a Chance Allison \"Sonny\" Munroe Lead role; Disney Channel Original Series 2010–11 Extreme Makeover: Home Edition Herself 2 episodes 2010 Grey's Anatomy Hayley 1 episode 2011 Keeping Up with the Kardashians Herself 1 episode 2012 Punk'd Herself 1 episode 2012–13 The X Factor Herself Judge/mentor 2013–14 Glee Danielle \"Dani\" recurring role; season 5 2021 The Demi Lovato Show Herself Host ==References== == Other websites == * Official Website of Demi Lovato * Category:1992 births Category:Living people Category:Singers from New Mexico Category:Writers from Albuquerque, New Mexico Category:Actors from Dallas Category:American child actors Category:American child singers Category:American television actors Category:Writers from Dallas Category:Disney actors Category:Musicians from New Mexico Category:Actors from Albuquerque, New Mexico Category:People with bipolar disorder Category:Singers from Dallas Category:LGBT actors Category:LGBT singers Category:LGBT musicians Category:American LGBT writers Category:LGBT people from Texas Category:Non- binary people",
 "title": "Demi Lovato"
}