{
 "id": "131920",
 "text": "Prince Andrew, Duke of York, (Andrew Albert Christian Edward, born 19 February 1960) is a member of the British Royal Family, the second son of Queen Elizabeth II and Prince Philip. He has been titled Duke of York (as well as Earl of Inverness and Baron Killyleagh) since 1986, and is eighth in line to succession to the British throne. Andrew is the first in line to not be a descendant of the current reigning monarch. As Duke of York, Andrew undertook official duties and engagements on behalf of the Queen. He served as the UK's Special Representative for International Trade and Investment for 10 years until July 2011. Andrew resigned from his royal duties in November 2019. ==Early life== Prince Andrew was born at Buckingham Palace in London. He went to Heatherdown Preparatory School in Berkshire, England, and Gordonstoun in Scotland. == Military career == Prince Andrew did not go to university, he went to Britannia Royal Naval College instead. In the Navy, he served in the Falklands War, despite controversy due to the possibility amongst Parliament of the Queen’s son losing their life. He became a commander in 1999 and an honorary captain in 2001. == Marriage and children == In 1986, Prince Andrew married Sarah Ferguson, the younger daughter of Ronald Ferguson, the polo manager for the Prince of Wales. They have two daughters from the marriage: Princess Beatrice and Princess Eugenie. Andrew and Sarah separated in 1992, and divorced in May 1996. Their marriage, separation in 1992, and divorce in 1996 attracted extensive media coverage. ==Controversy== Andrew has been accused of child sexual abuse by Virginia Giuffre (née Roberts) who alleges that, at the age of 17, she was sex-trafficked to Andrew by financier and convicted sex offender Jeffrey Epstein. Andrew categorically denied said allegation. In November 2019, Prince Andrew was interviewed for the BBC television programme Newsnight on 16 November 2019. The interviewer talked about the Prince's friendship with the convicted child sex offender Jeffrey Epstein; They met thru Ghislaine Maxwell. The interview was very bad for the British royal family, because many people who saw the interview thought Prince Andrew was unsympathetic to Epstein's victims. Due to sexual abuse allegations, Andrew resigned from public roles in 2020. Andrew was the defendant in a sexual assault lawsuit by Giuffre in 2022, which Andrew settled out of court in February. ===Lawsuit and its end (2022)=== On 15 February 2022 a lawsuit against Andrew, was settled; The lawsuit never went to trial.https://www.bangkokpost.com/world/2276339/prince-andrew-sex-assault- case-formally-closed-after-settlement-paid. Bangkok Post. Retrieved 9 March 2022. \"Both parties filed a \"stipulation of dismissal\" of the case in federal court in New York, which was signed by Judge Lewis Kaplan on Tuesday\" Andrew [was] a defendant in a lawsuit - Virginia Giuffre v. Prince Andrew - at the lower courts of the federal court system of the United States. The civil lawsuit (see civil law), says that he had sex in 2001 with a female (Virginia Giuffre) that was 17 years old; Prince Andrew \"has strongly denied any wrongdoing\", media said.https://www.bbc.com/news/uk-59987935. Retrieved 13 January 2022 == Titles, styles, honours and arms == In 2022, he gave back his honorary military titles and royal patronages. He has the rank Vice-Admiral. === Titles and styles === * 19 February 1960 – 23 July 1986: His Royal Highness The Prince Andrew * 23 July 1986 – present: His Royal Highness The Duke of York * In Scotland His Royal Highness The Earl of Inverness * In Northern Ireland Baron of Killyleagh === Honours === * Commander of the Royal Victorian Order (CVO), 19 December 1979 * KCVO: Knight Commander of the Royal Victorian Order, 3 June 2003 * GCVO: Knight Grand Cross of the Royal Victorian Order, 21 February 2011 * South Atlantic Medal, with rosette, 1982 * Queen Elizabeth II Silver Jubilee Medal, 1977 * New Zealand 1990 Commemoration Medal, 1990 * Canadian Forces Decoration * Queen Elizabeth II Golden Jubilee Medal, 2002 * Commemorative Medal for the Centennial of Saskatchewan, 2005 * KG: Knight of the Garter, 23 April 2006 ==== Ranks in the military ==== * 1979–1981: Midshipman, Britannia Royal Naval College, HMS Seahawk * 1981–1984: Sub Lieutenant, Pilot, 820 NAS on HMS Invincible; * 1984–1992: Lieutenant, Pilot, 815 NAS on HMS Brazen; Helicopter Warfare Instructor, 702 NAS at RNAS Culdrose; Flight Commander, 829 NAS on HMS Campbeltown * 1992–1999: Lieutenant Commander, Captain, HMS Cottesmore; Senior Pilot, 815 NAS at RNAS Portland; Directorate of Naval Operations, British Ministry of Defence * 1999–2005: Commander, Diplomacy Section of the Naval Staff. Released from the active list in 2001. * 2005–2010: Honorary Captain * 2010–2015: Rear Admiral * 2015–: Vice-admiral ==== Appointments ==== He had military appointments: * Personal Aide-de-Camp to the Queen (1 February 1984 – 13 January 2022) ==== Honorary military appointments ==== In Canada he holds the following military appointments: * Colonel-in-Chief of the Canadian Airborne Regiment (disbanded) * Colonel-in-Chief of the Princess Louise Fusiliers * Colonel-in-Chief of the Queen's York Rangers (1st American Regiment) An earlier appointment was Colonel-in-Chief of the Royal Highland Fusiliers of Canada. In New Zealand he had military appointments: * Colonel-in-Chief of the Royal New Zealand Army Logistic Regiment In the UK he had military appointments: * Honorary Air Commodore of the Royal Air Force Lossiemouth * Commodore-in-Chief of the Fleet Air Arm * Colonel-in-Chief of the 9th/12th Royal Lancers (Prince of Wales's) * Colonel-in-Chief of the Royal Irish Regiment (27th (Inniskilling) 83rd and 87th and Ulster Defence Regiment) * Colonel-in-Chief of the Small Arms School Corps * Colonel-in-Chief of the Yorkshire Regiment (14th/15th, 19th and 33rd/76th Foot) * Royal Colonel of the Royal Highland Fusiliers, 2nd Battalion Royal Regiment of Scotland * Admiral of the Sea Cadet Corps === Arms === The Duke's personal coat of arms are those of the Royal coat of arms of the United Kingdom with a label for difference: Quarterly (by quarters): :1st and 4th, Gules three Lions passant guardant in pale Or (England). (The first and fourth quarters display the three lions, representing England.) :2nd quarter is of a lion rampant within a Double Tressure floury counterflory Gules (Scotland). (The second quarter, displays a red lion in a yellow field with a double border coloured red, this represents Scotland.) : 3rd, Azure a Harp Or stringed Argent (Ireland). (The third quarter shows a harp against a blue background, this represents Ireland.) The whole differenced by a Label of three points Argent the central point charged with an Anchor Azure. The anchor is in reference to his naval career. The arms are identical to those his grandfather George VI used when still Duke of York. ==Notes== == References == Category:1960 births Category:Living people Category:House of Windsor Category:British princes Category:Knights Grand Cross of the Royal Victorian Order Category:Knights of the Garter Category:Royalty from London York Category:Elizabeth II",
 "title": "Prince Andrew, Duke of York"
}