{
 "id": "131960",
 "text": "Parqués is a Colombian board game. The game is similar to those in the Cross and Circle family (the category that includes Pachisi). The game is described as a \"random thinking\" one: the moves depend on the roll of the dice but players must consider possible strategies before executing their move. The objective of the game is to advance all the pieces to the end. == Colombian origin == Parqués is the Colombian version of Pachisi, which originated in India. Although it could be argued that the game comes from Spain due to the similarity between the games, there is wide agreement in Colombia that the game is completely Colombian. Parqués stems directly from Pachisi in the same way as Parcheesi, Parchís or Ludo. There is no proof to the claim that it stems from a country other than India. Moreover, no Parqués game is played in any other countries. Parqués is a mixture of the original Indian game and the influences of local Colombian culture. Other Colombian variations also exist. In Colombia, people from all parts of the country play the game; it is very popular, played by both children and adults. Adults usually play the game by betting money on the first piece, on capturing pieces, or on winning the game, to make gameplay more interesting. There are boards for 4, 6 and 8 players. The boards usually contain pictures of soccer teams, singers, actors, or other cultural figures on the jail boxes. The board itself is usually placed on a box covered by glass. The use of glass is to allow dice to be thrown more easily. There are versions of the board that are made from paper to make it portable. ==Gameplay== Parqués is played with two dice; two to eight players can compete in the same match, depending on what type of game board is used. Each player is given four pieces and uses a specific colour. The most common colours are red, blue, yellow and green, usually arranged in that order. The game can also be played with fewer than four pieces The jail box is where the pieces are placed at the beginning of the match and is where they go whenever an opponent \"captures\" them. The player throws the dice three times and attempts to get a pair in order to \"free\" the pieces. Rolling different pairs or \"doubles\" allows more pieces to be \"freed\": *1-1 or 6-6: the player can free all his pieces *2-2, 3-3, 4-4, 5-5: the player can free 2 only pieces When the pieces are freed, they are placed in a special box next to the jail. This box is called \"Home\", or \"Salida\" (literally, \"exit\" in Spanish). If a player does not roll any pairs during his turn, he passes the dice to the player on his right. Otherwise, he frees the pieces and wins an extra turn to move them. He throws again and must move the values of the dice with his pieces. For example: The player rolls 5-3 *He can move 8 squares forward with one piece or *He can move 5 squares with one piece and 3 with another After he makes his move, he must pass his turn to the player on the right. The pieces cannot go backwards and they cannot be in any of the four boxes before their \"Home\" box. ==Throws and turns== Each player can throw the dice once. There are some exceptions to this rule: *If the player has all his pieces in jail, he can throw up to three times until he frees them with a pair. If doubles are not rolled in the three tries, he passes the turn. *If the player throws a pair during any turn, he wins an extra turn. One comes up to the player out in jail == Capturing pieces == The player can capture an opponent’s piece by placing his own piece on the same box as the other player’s piece. However, he cannot capture a piece that is on a SAFE or a HOME box. Capturing in Colombia is called “eating” (“comer” in Spanish). However, the player can capture pieces on his HOME box. When he frees any piece from jail, the pieces placed on his HOME are captured, that is, sent to its jail, losing all their advances. The player can avoid capturing the piece. On that case, an opponent has to accuse him and the piece that did not capture must go to jail. If nobody notices, nothing happens. == Special boxes == There are three types of special boxes. * Home: where the pieces are placed when freed. * Safe: the pieces cannot be captured on this box * Arrival: A player must move his pieces through nine boxes to progress in the game. The boxes are usually of the same color as that player's pieces. The ninth box is the last box in the game for each person. If a piece reaches the ninth box, it is removed from the game. When all of a player's pieces are out of the game, the player wins. ==Other websites== *Cyber Parqués, a game program based on Parqués Category:Board games de:Parqués",
 "title": "Parqués"
}