{
 "id": "132116",
 "text": "Hernando de Soto (Jerez de los Caballeros, Badajoz, Spain, c.1496/1497\"Hernando de Soto\", from Encyclopedia Britannica, Online edition. Full article freely available (3 pages: keep clicking \"Next page\" links).–May 21, 1542) was a Spanish explorer and conquistador. He led the first European expedition deep into the territory of the modern-day United States. He was trying to find gold and a way to China. The expedition explored the southern United States. De Soto was probably the first European to discover the Mississippi River. He died in 1542 on the banks of the Mississippi River at present-day Lake Village, Arkansas. ==Personal life== Hernando de Soto was born to parents who were hidalgos in Extremadura. In this region, there was a lot of poverty and hardship. For this reason, many young people looked for ways to seek their fortune elsewhere. De Soto’s parents were poor. Two towns, Badajoz and Jerez de los Caballeros, claim to be his birthplace. All that is known with certainty is that he spent time as a child at both places. In his will, he wanted to be buried at Jerez de los Caballeros, where other members of his family were also buried.Charles Hudson (1997). Page 39. ==Exploration== The Age of the Conquerors began right after of the Spanish reconquest of the Iberian peninsula from Islamic forces. After the Moors were defeated, Spain and Portugal were filled with young men begging for a chance to find military fame. After explorers discovered new lands to the West (which they thought was far East Asia), many more young men became explorers with the goal of earning wealth and glory. De Soto sailed to the New World in 1514 with the first Governor of Panama, Pedrarias Dávila. During the conquest of Central America, de Soto became known for his leadership, his strong loyalty, and his extortion of native villages for their captured chiefs. He gained fame as an excellent horseman, fighter, and tactician. However, he was also well known for his extreme brutality. De Soto was influenced by Juan Ponce de León, who discovered Florida; Vasco Núñez de Balboa, who discovered the Pacific Ocean (which he called the \"South Sea\" below Panama); and Ferdinand Magellan, who first sailed the Pacific Ocean to the Orient. == References == Category:1490s births Category:1542 deaths Category:Spanish explorers Category:People from Extremadura",
 "title": "Hernando de Soto"
}