{
 "id": "132123",
 "text": "The Dutch Grand Prix is a Formula One motor race held at Circuit Zandvoort, from 1952 to 1985. It was brought back in 2021. In 1985 the company that ran the circuit (CENAV) went out of business. This marked the end of Circuit Zandvoort. The municipality of Zandvoort took over ownership. Part of the grounds and track were sold in 1987 to Vendorado, a Bungalow park developer. == Winners of the Dutch Grand Prix == === Repeat Winners (drivers) === Wins Driver Years Won 4 Jim Clark 1963, 1964, 1964, 1967 3 Jackie Stewart 1968, 1969, 1973 Niki Lauda 1974, 1977, 1985 Max Verstappen 2021, 2022, 2023 2 Louis Rosier 1950, 1951 Alberto Ascari 1952, 1953 Jack Brabham 1960, 1966 James Hunt 1975, 1976 Alain Prost 1981, 1984 Events that were not part of the Formula One World Championship have a pink background. === Repeat winners (constructors) === # Wins Constructor Years Won Years Won 9 Ferrari 1949, 1952, 1953, 1961, 1971, 1974, 1977, 1982, 1983 6 Lotus 1963, 1964, 1965, 1967, 1970, 1978 4 McLaren 1976, 1984, 1985, 2024 3 Red Bull Racing 2021, 2022, 2023 2 Talbot-Lago 1950, 1951 BRM 1959, 1962 Brabham 1966, 1980 Matra 1968, 1969 Events that were not part of the Formula One World Championship have a pink background. Active constructors are in bold. === By year === Year Driver Constructor Location 2024 Lando Norris McLaren Zandvoort 2023 Max Verstappen Red Bull Racing Zandvoort 2022 Max Verstappen Red Bull Racing Zandvoort 2021 Max Verstappen Red Bull Racing Zandvoort 1986 - 2020 Not held (Cancelled in 2020 due to the COVID-19 pandemic) 1985 Niki Lauda McLaren Zandvoort 1984 Alain Prost McLaren Zandvoort 1983 René Arnoux Ferrari Zandvoort 1982 Didier Pironi Ferrari Zandvoort 1981 Alain Prost Renault 1980 Nelson Piquet Brabham 1979 Alan Jones Williams 1978 Mario Andretti Lotus Zandvoort 1977 Niki Lauda Ferrari Zandvoort 1976 James Hunt McLaren Zandvoort 1975 James Hunt Hesketh Zandvoort 1974 Niki Lauda Ferrari Zandvoort 1973 Jackie Stewart Tyrrell Zandvoort 1972 Not held 1971 Jacky Ickx Ferrari Zandvoort 1970 Jochen Rindt Lotus Zandvoort 1969 Jackie Stewart Matra Zandvoort 1968 Jackie Stewart Matra Zandvoort 1967 Jim Clark Lotus Zandvoort 1966 Jack Brabham Brabham Zandvoort 1965 Jim Clark Lotus Zandvoort 1964 Jim Clark Lotus Zandvoort 1963 Jim Clark Lotus Zandvoort 1962 Graham Hill BRM Zandvoort 1961 Wolfgang von Trips Ferrari Zandvoort 1960 Jack Brabham Cooper Zandvoort 1959 Jo Bonnier BRM Zandvoort 1958 Stirling Moss Vanwall Zandvoort 1957 Not held 1956 Not held 1955 Juan Manuel Fangio Mercedes-Benz Zandvoort 1954 Not held 1953 Alberto Ascari Ferrari Zandvoort 1952 Alberto Ascari Ferrari Zandvoort 1951 Louis Rosier Talbot-Lago Zandvoort 1950 Louis Rosier Talbot-Lago Zandvoort 1949 Luigi Villoresi Ferrari Zandvoort 1948 Prince Bira Maserati Zandvoort ==Broadcasting== ===United Kingdom=== Year Network Lap-by- lap Colour commentator(s) BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC One Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker BBC Two Murray Walker ITV Andrew Marriott BBC One Raymond Baxter BBC One Raymond Baxter BBC One Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter BBC Television Raymond Baxter Events that were not part of the Formula One World Championship have a pink background. Category:Formula One Grands Prix",
 "title": "Dutch Grand Prix"
}