{
 "id": "132106",
 "text": "The Singapore Grand Prix is a Formula One race staged in the Marina Bay area of Singapore, the race is Formula One's first night race. The first race was won by Spanish driver Fernando Alonso of the Renault F1 team on 28 September 2008. == Winners == === Formula One === ==== Multiple winners (drivers) ==== Wins Driver Years won 5 Sebastian Vettel 2011, 2012, 2013, 2015, 2019 4 Lewis Hamilton 2009, 2014, 2017, 2018 2 Fernando Alonso 2008, 2010 ==== Multiple winners (constructors) ==== Wins Constructor Years won 4 Mercedes 2014, 2016, 2017, 2018 3 Ferrari 2010, 2015, 2019 Red Bull 2011, 2012, 2013 ==== By year ==== Date of birth for the current source of the program that has been issued for the year of this race that had taken place in marina bay. Driver Constructor Class Location Report Sebastian Vettel Red Bull-Renault Formula One Marina Bay Report Sebastian Vettel Red Bull-Renault Formula One Report Fernando Alonso Ferrari Formula One Report Lewis Hamilton McLaren-Mercedes Formula One Report Fernando Alonso Renault Formula One Report 2013 Sebastian Vettel Red Bull-Renault 2014 Lewis Hamilton Mercedes 2015 Sebastian Vettel Ferrari 2016 Lewis Hamilton Mercedes 2017 Lewis Hamilton Mercedes 2018 Lewis Hamilton Mercedes 2019 Sebastian Vettel Ferrari 2020 Cancelled due to the COVID-19 pandemic 2021 Cancelled due to the COVID-19 pandemic 2022 Sergio Perez Red Bull-RBPT 2023 Carlos Sainz Ferrari === Pre Formula One years === ==== Multiple winners (drivers) ==== Number of wins Driver Years won 3 Graeme Lawrence 1969, 1970, 1971 Event that were not part of the Formula One World Championship have a pink background. ==== Multiple winners (constructors) ==== No team has won the grand prix more than once. ==== By year ==== Year Driver Constructor Class Location 1973 Vern Schuppan March-Hart Formula Libre Thomson Road 1972 Max Stewart Mildren-Waggott Formula Libre Thomson Road 1971 Graeme Lawrence Brabham-Ford Formula Libre Thomson Road 1970 Graeme Lawrence Ferrari Formula Libre Thomson Road 1969 Graeme Lawrence McLaren-Ford Formula Libre Thomson Road 1968 Garrie Cooper Elfin-Ford Formula Libre Thomson Road 1967 Rodney Seow Merlyn-Ford Formula Libre Thomson Road 1966 Lee Han Seng Lotus- Ford Formula Libre Thomson Road Event that were not part of the Formula One World Championship have a pink background. ==Broadcasting== ===United Kingdom=== Year Network Lap-by-lap Colour commentator(s) Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard BBC One Martin Brundle David Coulthard BBC One Jonathan Legard Martin Brundle BBC One Jonathan Legard Martin Brundle ITV James Allen Martin Brundle == Gallery == Image:singapore grand prix fullerton test.JPG|Esplanade stretch of the Marina Bay Street Circuit, one week before the 2008 race Image:Singapore grand prix day z.JPG|Bird's eye view of the Marina Bay Street Circuit, two days before the 2008 race == References == == Further reading == * * * == Other websites == * Singapore Grand Prix Official Website * Singapore confirms 2008 night race * Google Earth placemark of the circuit * 1966 Singapore Grand Prix newsreel Category:Events in Singapore Category:Formula One Grands Prix Category:Sport in Singapore",
 "title": "Singapore Grand Prix"
}