{
 "id": "132113",
 "text": "Hernando de Soto Polar (born June 2, 1941 in Lima) is an economist and politician from Peru. He has become known for what he wrote and said on the Informal economy and property rights. In 2020, he announced his candidacy for President of Peru for the 2021 general election. He came fourth in a race of 18 candidates. ==Main ideas== ===Private ownership is needed=== In his books, de Soto says that an economy cannot go past the stage of a subsistence economy if there is not a formal system of owning property (land or goods). Developing countries have informal ownership since no formal certificate says that land or goods really belong to a certain person. De Soto thinks the capitalist economies of the United States developed because they had a clear system of owning property. For the United States, the formal system of owning property came from it being a colony of England. Japan's formal system came after the Second World War. Because formal ownership systems do not exist in developing countries, the poor people in these nations cannot develop. They cannot use their land as a guarantee to the bank to get money to build something, for example. De Soto argues that this is the basis for enterpreneurship.\"Competitiveness of the Small and Medium Business, road to development\" Conference at Guatemala, 2004 In much of the developing world,famers therefore are left with subsistence agriculture. As such, he argues that this informal ownership should be made formal, for example by giving squatters in shanty towns land titles to the land they now live on. === Government bureaucracy is bad for the economy === De Soto also argues that government bureaucracy greatly hinders the ability for people to hold private property, for example: :\"In Haiti, one way an ordinary person can settle legally on government land is first to lease it from the government for five years and then buy it. Working with associates in Haiti, our researchers found that to obtain such a lease took 65 bureaucratic steps requiring, on average, a little more than two years. All for the privilege of merely leasing the land for five years.\" :\"In Egypt, the person who wants to acquire and legally register a lot on state-owned desert land must wind his way through at least 77 bureaucratic procedures at 31 public and private agencies. This can take anywhere from 5 to 14 years. To build a legal dwelling on former agricultural land would require 6 to 11 years of bureaucratic wrangling.\" Thus entrepreneurs are driven to form \"underground\" economies, but de Soto points out the serious disadvantages: :\"Extra legal businesses are taxed by the lack of good property law and continually having to hide their operations from the authorities. Because they are not incorporated, extralegal entrepreneurs cannot lure investors by selling shares; they cannot get low interest formal credit because they do not even have legal addresses. They cannot reduce risks by declaring limited liability or obtaining insurance coverage. In fact, the only 'insurance' available to them is that provided by their neighbors and the protection that local bullies or mafia are willing to sell them. Moreover, because extralegal entrepreneurs live in constant fear of government detection and extortion from corrupt officials, they are forced to split and compartmentalize their production facilities between many locations, thereby rarely achieving important economies of scale. With one eye always on the lookout for police, underground entrepreneurs cannot openly advertise to build up their clientele or make less costly bulk deliveries to customers.\" ==Thomas Sowell's review of his book== Thomas Sowell writes: :For the entire Third World and the former Communist countries, de Soto's calculation is that the total value of all the land held, but not legally owned, by the poor is more than 20 times all direct foreign investment in the Third World and more than 90 times all the foreign aid to all Third World countries over the past three decades. :The amount of wealth available within Third World countries themselves vastly exceeds anything that the prosperous countries have given them or are likely to give them. :Many American businesses were begun by someone who borrowed the money to get started, using his home as collateral.Thomas Sowell :The crucial theme of the book is that this vast amount of wealth cannot be used, as it is in the west, as investments to create still more wealth and rising standards of living. That is because real estate, businesses and other assets in the underground economies of the Third World cannot be used as collateral to raise capital to finance the growth of industry and trade. :Bureaucracy and legal systems which are too complicated often cause people to use illegal or informal ways to invest and buy property. It is bad for the whole country to not let every person have legal property rights because without these rights there will not be as much investment, hurting the economy. :People, including law professors, who think that only the rich should have the property rights should read this book. The poor need these rights more than anyone else, because it can help them stop being poor. ==Related pages== *List of scientists from South America ==References== Category:1941 births Category:Living people Category:Politicians from Lima Category:Economists",
 "title": "Hernando de Soto Polar"
}