{
 "id": "132124",
 "text": "The United States Grand Prix is a motor race which has been run on and off since 1908, when it was known as the American Grand Prize. The race later became part of the Formula One World Championship. From 2000 to 2007, the race was held at the Indianapolis Motor Speedway road course. the United States Grand Prix was dropped from the Formula One calendar starting in 2008. In 2010, the FIA announced that the race would return to the United States at a new circuit near Austin, Texas. The new track, known as the Circuit of the Americas, hosted its first U.S. Grand Prix in . == History == === Indianapolis Motor Speedway === Formula One returned to the United States in . The race was held at the Indianapolis Motor Speedway. A road course was built for the Formula one race. Part of the oval track was used, including the main straightaway and turn 4. The remaining part of the road course was built in the infield portion of the track. Even thought most American races run counter-clockwise, including the Indianapolis 500, the Formula One course was built to run clockwise. === Circuit of the Americas === A new race track is being built in the Austin area. This track is being designed and built for the use of Formula One racing and MotoGP, and will also host a round of V8 Supercars, an Australia-based touring car racing series. The track will be located southeast of Austin next to state highway 130. The track will be located on a 900 acre site. The location used to known as the Wandering Creek property. == Winners of the United States Grand Prix == ===Repeat winners (drivers)=== Drivers in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. Wins Driver Years won 6 Lewis Hamilton 2007, 2012, 2014, 2015, 2016, 2017 5 Michael Schumacher 2000, 2003, 2004, 2005, 2006 3 Graham Hill 1963, 1964, 1965 Max Verstappen 2021, 2022, 2023 Jim Clark 1962, 1966, 1967 2 David Bruce-Brown 1910, 1911 Jackie Stewart 1968, 1972 James Hunt 1976, 1977 Carlos Reutemann 1974, 1978 Ayrton Senna 1990, 1991 ===Repeat winners (constructors)=== Teams in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. Wins Constructor Years won 11 Ferrari 1975, 1978, 1979, 2000, 2002, 2003, 2004, 2005, 2006, 2018, 2024 8 Lotus 1960, 1961, 1962, 1966, 1967, 1969, 1970, 1973 McLaren 1976, 1977, 1989, 1990, 1991, 2001, 2007, 2012 6 Mercedes 1910, 2014, 2015, 2016, 2017, 2019 4 Red Bull 2013, 2021, 2022, 2023 3 Fiat 1908, 1911, 1912 BRM 1963, 1964, 1965 2 Peugeot 1915, 1916 Tyrrell 1971, 1972 ===Repeat winners (engine manufacturers)=== Manufacturers in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. Wins Manufacturer Years won 11 Ford * 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1976, 1977, 1980 Ferrari 1975, 1978, 1979, 2000, 2002, 2003, 2004, 2005, 2006, 2018, 2021 9 Mercedes ** 1910, 2001, 2007, 2012, 2014, 2015, 2016, 2017, 2019 4 Climax 1959, 1960, 1961, 1962, BRM 1963, 1964, 1965, 1966 Honda 1989, 1990, 1991, 2021 3 Fiat 1908, 1911, 1912 2 Peugeot 1915, 1916 * Built by Cosworth, funded by Ford ** Built by Ilmor in 2001, funded by Mercedes ===By year=== A pink background indicates an event which was not part of the Formula One World Championship. Year Driver Constructor Location Report 1908 Louis Wagner Fiat Savannah Report 1909 Not held 1910 David Bruce-Brown Benz Savannah Report 1911 David Bruce-Brown Fiat Report 1912 Caleb Bragg Fiat Milwaukee Report 1913 Not held 1914 Eddie Pullen Mercer Santa Monica Report 1915 Dario Resta Peugeot San Francisco Report 1916 Howdy Wilcox Johnny Aitken Peugeot Santa Monica Report 1917 – 1957 Not held 1958 Chuck Daigh Scarab-Chevrolet Riverside Report Bruce McLaren Cooper-Climax Sebring Report Stirling Moss Lotus-Climax Riverside Report Innes Ireland Lotus-Climax Watkins Glen Report Jim Clark Lotus-Climax Report Graham Hill BRM Report Graham Hill BRM Report Graham Hill BRM Report Jim Clark Lotus- BRM Report Jim Clark Lotus-Ford Report Jackie Stewart Matra-Ford Report Jochen Rindt Lotus-Ford Report Emerson Fittipaldi Lotus-Ford Report François Cevert Tyrrell-Ford Report Jackie Stewart Tyrrell-Ford Report Ronnie Peterson Lotus- Ford Report Carlos Reutemann Brabham-Ford Report Niki Lauda Ferrari Report James Hunt McLaren-Ford Report James Hunt McLaren-Ford Report Carlos Reutemann Ferrari Report Gilles Villeneuve Ferrari Report Alan Jones Williams-Ford Report 1981 – 1988 Not held Alain Prost McLaren-Honda Phoenix Report Ayrton Senna McLaren- Honda Report Ayrton Senna McLaren-Honda Report 1992 – 1999 Not held Michael Schumacher Ferrari Indianapolis Report Mika Häkkinen McLaren-Mercedes Report Rubens Barrichello Ferrari Report Michael Schumacher Ferrari Report Michael Schumacher Ferrari Report Michael Schumacher Ferrari Report Michael Schumacher Ferrari Report Lewis Hamilton McLaren-Mercedes Report 2008 – 2011 Not held Lewis Hamilton McLaren-Mercedes Austin Report Sebastian Vettel Red Bull-Renault Report Lewis Hamilton Mercedes Report Lewis Hamilton Mercedes Report Lewis Hamilton Mercedes Report Lewis Hamilton Mercedes Report Kimi Räikkönen Ferrari Report 2019 Valtteri Bottas Mercedes Report 2020 Cancelled 2021 Max Verstappen Red Bull Report 2022 Max Verstappen Red Bull Report 2023 Max Verstappen Red Bull Report 2024 Charles Leclerc Ferrari Report ==Broadcasting== ===United Kingdom=== Year Network Lap-by-lap Colour commentator(s) Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle F1 Digital+ Ben Edwards John Watson ITV James Allen Martin Brundle ITV Murray Walker Martin Brundle ITV2 Murray Walker Martin Brundle BBC Two Murray Walker James Hunt Eurosport Richard Nicholls John Watson BBC Two Murray Walker James Hunt Eurosport Richard Nicholls John Watson BBC Two Murray Walker James Hunt BBC One Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker == Other websites == * United States Grand Prix History * United States Grand Prix Statistics * Formula One Phoenix Circuit History * Formula One Fair Park Circuit History * Formula One United States Grand Prix in Austin == References == Category:Formula One Grands Prix",
 "title": "United States Grand Prix"
}