{
 "id": "132505",
 "text": "Franz Joseph Hermann Michael Maria von Papen zu Köningen (29 October 1879 - 2 May 1969) was a German nobleman, Catholic monarchist politician, General Staff officer, and diplomat. He was Chancellor of Germany in 1932 and as Vice Chancellor of Germany in 1933-1934. He was a member of the Catholic Centre Party of Germany until 1932. Papen was one the people who believed and said that they (the conservative elite and the military) could control Adolf Hitler when he becomes Chancellor of Germany; and was responsible for his rise to power along with Reich President Paul von Hindenburg, when he persuaded Hindenburg, that the other alternative to Hitler was Communist rule, which they saw as more dangerous. As a result, Hindenburg appointed Hitler as Chancellor on 30 January 1933. But von Papen's belief in controlling Hitler and his assurances to Hindenburg did not happen, because Hitler started to control them and gain more power. In March Hindenburg signed the Enabling Act of 1933 which gave special powers to Hitler and his government, and he became a dictator. Von Papen and the conservatives lost all influence, though most of them stayed as members in Hitler's cabinet with no powers, until the fall of the Third Reich. Before and during World War II he was an ambassador, from 1934 to 1938 in Austria, and from 1939 to 1944 in Turkey. Von Papen was one of the 24 people charged at the Nuremberg Trials. The court decided he was not guilty. Category:1879 births Category:1969 deaths Category:Chancellors of the Weimar Republic Category:Ambassadors of Germany Category:German military personnel of World War I Category:German Roman Catholics Category:Government ministers of Nazi Germany Category:German majors Category:Members of the Reichstag (Nazi Germany) Category:Members of the Reichstag (Weimar Republic) Category:Prime ministers of Prussia Category:Politicians from North Rhine- Westphalia Category:Politicians of the Nazi Party Category:Vice Chancellors of Germany",
 "title": "Franz von Papen"
}