{
 "id": "132529",
 "text": "This article is about the band called Editors. For help with editing Wikipedia, see Help:Editing. Editors redirects here. For other uses, see Editor. Editors are an indie rock band from England. They were formed in 2002. They were first called Pilot, then The Pride and also Snowfield. The band members are: * Tom Smith - lead vocals, rhythm guitar, piano * Chris Urbanowicz - lead guitar and synth * Russell Leetch - bass guitar and backing vocals * Ed Lay - drums, percussion and backing vocals. Editors have so far made two platinum albums, selling over two million copies around the world.Jon Perks, Editors Are Back In Town , Birmingham Post, 18 February 2008, Accessed 31 March 20082007 Sales Estimations, Worldwidealbums.net, 1 January 2008, Accessed 31 March 2008 Their first album, The Back Room, came out in 2005. It had hit songs such as \"Munich\" and \"Blood\" and the following year was nominated for the Mercury Prize. Their next album An End Has a Start went to number one in the UK Album Chart in June 2007. It was nominated for a BRIT Award for best British Band. The second album also had a Top 10 hit single, \"Smokers Outside the Hospital Doors\". After success in the charts, sold out tours and playing as the main act at many festivals, The Mail on Sunday newspaper said the Editors were the second biggest British band of the decade, after Arctic Monkeys.Nick Durden, Stop the press: Britain's hottest new band, Editors, Mail On Sunday, 15 February 2008 Accessed 31 March 2008 Their style of epic, sweeping, indie rock is often compared to the sound of bands such as Echo and the Bunnymen, Joy Division, Interpol and U2.Angsty young man, guardian.co.uk, 28 November 2005, Accessed 20 September 2008 == Studio albums == * The Back Room (2005) * An End Has a Start (2007) * In This Light and on This Evening (2009) * The Weight of Your Love (2013) * In Dream (2015) * Violence (2018) == References == Category:English rock bands",
 "title": "Editors (band)"
}