{
 "id": "132619",
 "text": "Nicaragua is a country in Central America. It is officially called the Republic of Nicaragua (). It has a size of 129,494 square kilometres. It is the largest country in Central America. It borders Honduras to the north and Costa Rica to the south. The capital of the country is Managua. Managua is the third-largest city in Central America. It is also the biggest city of Nicaragua. Almost a quarter of the population lives in the capital city. The population of Nicaragua is approximately 6 million. The population is multicultural. The population includes indigenous native tribes from the Miskito Coast, Europeans, Africans, and Asians. The main language is Spanish. Some native tribes on the eastern coast speak their native languages. Some of these languages are Miskito, Sumo, and Rama. Some people speak English Creole. Creole is a curious mix-match of English, Dutch, French, Portuguese and Spanish. It dates back to the days when pirates hid out among the islands and cays that make up the coastline. The mixture of cultures has created diversity in art and literature. Some famous Nicaraguan writers are Rubén Darío, Ernesto Cardenal, and Gioconda Belli. The International Poetry Festival held each February in Granada attracts poets and fans from all over the world. Unlike the majority of Latin American countries, Nicaraguans do not see soccer as their main sport. Baseball is king here, an influence from the years of United States occupation in the early 20th century. Music in Nicaragua is the same as elsewhere in the region. The traditional Latin styles like salsa and meringue rule. The Caribbean side has its own Caribbean Island vibe, as well as the traditional Garifuna Punta style. The biological diversity, warm tropical climate, and active volcanoes make Nicaragua an increasingly popular tourist destination. On 30 January 2025, following the approval of a constitutional reform, the country became a diarchy with Daniel Ortega and his wife Rosario Murillo becoming co-presidents.Nicaragua's Ortega expands power as reforms win final approval ==Notes== == References == Category:Spanish-speaking countries Category:Current dictatorships",
 "title": "Nicaragua"
}