{
 "id": "133053",
 "text": "\"Hallelujah\" is a folk-rock song by Canadian singer/guitarist Leonard Cohen. It was first released on his 1984 album Various Positions. Following its increased popularity after being featured in the movie Shrek (2001), it has been re-recorded by many different artists including Jeff Buckley, Anand Bhatt, Rufus Wainwright, Allison Crowe, k.d. lang, Tori Kelly, and Damien Rice. ==Background== The song draws references to David (\"there was a secret chord that David played and it pleased the Lord\", \"The baffled king composing Hallelujah\") and Bathsheba (\"you saw her bathing on the roof\") in its opening verses. \"Hallelujah\" experienced renewed interest following Cohen's death in November 2016 and appeared on multiple international singles charts, including entering the American Billboard Hot 100 for the first time. Cohen wrote around 80 draft verses for \"Hallelujah\", with one writing session at the Royalton Hotel in New York where he was reduced to sitting on the floor in his underwear, banging his head on the floor. ==Differences== Cohen sang a different version when he played the song in concert starting in 1988. A lot of other people who sing it mix lyrics from both versions, and occasionally make direct lyric changes; for example, in place of Cohen's \"holy dove\", Canadian-American singer Rufus Wainwright changed it to \"holy dark\", while Canadian singer-songwriter Allison Crowe sang \"holy ghost\". ==Meaning== Canadian singer k.d. lang said in an interview shortly after Cohen's death that she considered the song to be about \"the struggle between having human desire and searching for spiritual wisdom. It's being caught between those two places.\" Former Barenaked Ladies frontman Steven Page, who sang the song at Canadian politician Jack Layton's funeral, described the song as being \"about disappointing people\". ==Charts== Chart (1985–2016) Peak position Australia (ARIA) 59 France (SNEP) 1 Italy (FIMI) 66 New Zealand Heatseekers (RMNZ) 1 US Billboard Hot 100 59 ==References== ==Other websites== *1984 version lyrics, on The Leonard Cohen Files *1988 version lyrics, on The Leonard Cohen Files *BBC: Just whose hallelujah is it anyway? – article on writing and meaning of song * The Birth of kd lang's \"Hallelujah\" out of the 'Spirit of Music' Perfect Sound Forever online music magazine presents... 2011 article, by philosopher Babette Babich * BBC: Hallelujah! The rise and rise of Leonard Cohen's once-forgotten classic – 2012 report, by writer Alan Light * Guitar chords Category:1984 songs Category:Leonard Cohen songs Category:Bon Jovi songs Category:Jeff Buckley songs Category:Rock songs Category:Songs written by Leonard Cohen",
 "title": "Hallelujah (Leonard Cohen song)"
}