{
 "id": "133057",
 "text": "Jeffrey Scott \"Jeff\" Buckley (November 17, 1966 – May 29, 1997) was an American singer and guitarist. His father was Tim Buckley. He was also a musician. Buckley died after drowning in the Wolf River in Memphis at the age of 30. His body was found on 4 June. ==Life and death== Buckley was born in Anaheim, California. He was the only son of Mary Guibert, a Panama Canal Zonian and Tim Buckley (1947-1975). Buckley is of Greek, French, Irish and Panamanian descent. Buckley was known as Scott \"Scotty\" Moorhead as a child. This name was based on his middle name and his stepfather's surname. His father died when he was eight years old. Buckley died at the age of 30 on the evening of May 29, 1997. His death was ruled as an accidental drowning after he went missing after going swimming in the Wolf River Harbor which is a slackwater channel of the Mississippi River. His body was found floating on the surface on 4 June. ==Discography== ===Studio albums=== Year Album 1994 Grace ===Singles=== Year Album 1995 Grace 1995 Last Goodbye 1996 So Real 1998 Everybody Here Wants You 2004 Forget Her 2006 2007 2008 2009 Hallelujah ==Awards== *April 13, 1995 - \"Grand Prix International Du Disque\" by the Académie Charles Cros. *1995 - MTV Video Music Award for Best New Artist in a Video for \"Last Goodbye\" (nominated). *1995 - Rolling Stone magazine for Best New Artist (nominated). *1995 - #14 best song of 1995 in the world's largest voting competition for \"Last Goodbye\" by Triple J Hottest 100. *2006 - Grace was named the #1 Modern Rock Classic of all Time by Mojo. *1998 - Grammy Award for Best Male Rock Vocal Performance for \"Everybody Here Wants You\" (nominated). *2003 - Grace was ranked #303 of the 500 Greatest Albums by Rolling Stone. *2004 - His cover of \"Hallelujah\" was ranked #259 of the 500 Greatest Songs by Rolling Stone. *2008 - He was ranked #39 in Rolling Stone's 2008 list: The 100 Greatest Singers of All Time. *2009 - His version of \"Hallelujah\" was voted in 3rd place, Last Goodbye was 7th, Lover, You Should've Come Over was 56th and Grace came in 69th on the Triple J Hottest 100 of All Time. ==Other websites== *Jeff Buckley's Official website Category:Accidental deaths by drowning in the United States Category:American folk musicians Category:American guitarists Category:American rock musicians Category:Musicians from California Category:Singers from California Category:1966 births Category:Former Roman Catholics Category:1997 deaths",
 "title": "Jeff Buckley"
}