{
 "id": "133010",
 "text": "Heraclitus of EphesusAncient Greek: — , English Heraclitus the Ephesian or Herakleitos (c.535 – 475 BC) was a pre-Socratic Greek philosopher. He was a native of Ephesus, Ionia, on the coast of Asia Minor. His teaching, as we have it now, is a series of epigrams. This means his teachings are sayings and remarks, rather than systematic essays. Heraclitus is famous for his doctrine of change being central to the universe. His famous sayings, \"All is flux\", and \"You cannot step twice into the same river\" is still remembered today.Guthrie W.K.C. 1962. A history of Greek philosophy, vol 1, the earlier presocratics and the pythagoreans. Cambridge University Press. Chapter VII Heraclitus, p403. Another of his sayings appeals to some psychologists: *\"You cannot discover the depths of the psyche, even if you travelled every road to do so, such is the depth of its meaning\".Quoted in Hilgard E.R. 1986. Divided consciousness: multiple controls in human thought and action. Expanded edition, New York: John Wiley, p167. Often it is difficult to understand what he was trying to say. He believed in the unity of opposites, stating that \"the path up and down are one and the same\". *\"Good and bad are the same\".Fairbanks, Arthur 1898. The first philosophers of Greece. Kegan Paul, Trench, Trübner, London. #57, p39. In many of these 'opposite ends' pairs, if one never happened, then the other would be meaningless. His utterance that \"all things come to be in accordance with this logos,\" (literally, \"word,\" \"reason,\" or \"account\") has been the subject of many interpretations. Logos became a technical term in philosophy, beginning with Heraclitus, who used the term for a principle of order and knowledge.Cambridge Dictionary of Philosophy. 2nd ed, 1999. Heraclitus. Diogenes Laërtius states that Heraclitus' work was \"a continuous treatise On Nature, but was divided into three discourses, one on the universe, another on politics, and a third on theology.\" Theophrastus says (in Diogenes) \"... some parts of his work are half-finished, while other parts make a strange medley\".Laertius, Diogenes. 1925. Lives of the eminent philosophers. . Life of Heraclitus, translated by Robert Drew Hicks. ix, 6 Diogenes also tells us that Heraclitus deposited his book as a dedication in the great temple of Artemis, the Artemisium, one of the largest temples of the 6th century BC, and one of the Seven Wonders of the Ancient World. Ancient temples were regularly used for storing treasures, and were open to private individuals under exceptional circumstances. Many later philosophers refer to the work. == References == *Robinson T.M. 1987. Heraclitus: Fragments: a text and translation with a commentary. Toronto: University of Toronto Press. . Category:Presocratic philosophers",
 "title": "Heraclitus"
}