{
 "id": "133137",
 "text": "The Country Music Association Awards, also known as the CMA Awards, or the CMAs, are music awards voted on by business members of the Country Music Association. ==Major awards== Year Entertainer of the Year Male Vocalist of the Year Female Vocalist of the Year Song of the Year 2019 Garth Brooks Kacey Musgraves Ashley McBryde Luke Combs, Wyatt B. Durrette III, Robert Williford - \"Beautiful Crazy\" 2011 Taylor Swift Blake Shelton Miranda Lambert Kimberly Perry – \"If I Die Young\" 2010 Brad Paisley Blake Shelton Miranda Lambert Tom Douglas, Allen Shamblin – \"The House That Built Me\" 2009 Taylor Swift Brad Paisley Taylor Swift Jamey Johnson, Lee Thomas Miller, James Otto – \"In Color\" 2008 Kenny Chesney Brad Paisley Carrie Underwood Jennifer Nettles – \"Stay\" 2007 Kenny Chesney Brad Paisley Carrie Underwood Bill Anderson, Jamey Johnson, Buddy Cannon – \"Give It Away\" 2006 Kenny Chesney Keith Urban Carrie Underwood Craig Wiseman, Ronnie Dunn – \"Believe\" 2005 Keith Urban Keith Urban Gretchen Wilson Bill Anderson, Jon Randall – \"Whiskey Lullaby\" 2004 Kenny Chesney Keith Urban Martina McBride Craig Wiseman, Tim Nichols – \"Live Like You Were Dying\" 2003 Alan Jackson Alan Jackson Martina McBride Doug Johnson, Kim Williams – \"Three Wooden Crosses\" 2002 Alan Jackson Alan Jackson Martina McBride Alan Jackson – \"Where Were You (When the World Stopped Turning)\" 2001 Tim McGraw Toby Keith Lee Ann Womack Larry Cordle, Larry Shell – \"Murder on Music Row\" 2000 Dixie Chicks Tim McGraw Faith Hill Mark D. Sanders, Tia Sillers – \"I Hope You Dance\" 1999 Shania Twain Tim McGraw Martina McBride Beth Neilsen Chapman, Annie Roboff, Rob Lerner – \"This Kiss\" 1998 Garth Brooks George Strait Trisha Yearwood Steve Wariner, Billy Kirsch – \"Holes in the Floor of Heaven\" 1997 Garth Brooks George Strait Trisha Yearwood Matraca Berg, Gary Harrison – \"Strawberry Wine\" 1996 Brooks & Dunn George Strait Patty Loveless Vince Gill – \"Go Rest High on That Mountain\" 1995 Alan Jackson Vince Gill Alison Krauss Gretchen Peters – \"Independence Day\" 1994 Vince Gill Vince Gill Pam Tillis Alan Jackson, Jim McBride – \"Chattahoochee\" 1993 Vince Gill Vince Gill Mary Chapin Carpenter John Barlow Jarvis, Vince Gill – \"I Still Believe in You\" 1992 Garth Brooks Vince Gill Mary Chapin Carpenter Max D. Barnes, Vince Gill – \"Look at Us\" 1991 Garth Brooks Vince Gill Tanya Tucker Tim DuBois, Vince Gill – \"When I Call Your Name\" 1990 George Strait Clint Black Kathy Mattea Don Henry, Jon Vezner – \"Where've You Been\" 1989 George Strait Ricky Van Shelton Kathy Mattea Max D. Barnes, Vern Gosdin – \"Chiseled in Stone\" 1988 Hank Williams, Jr. Randy Travis K. T. Oslin K. T. Oslin – \"80's Ladies\" 1987 Hank Williams, Jr. Randy Travis Reba McEntire Paul Overstreet, Don Schlitz – \"Forever and Ever, Amen\" 1986 Reba McEntire George Strait Reba McEntire Paul Overstreet, Don Schlitz – \"On the Other Hand\" 1985 Ricky Skaggs George Strait Reba McEntire Lee Greenwood – \"God Bless the USA\" 1984 Alabama Lee Greenwood Reba McEntire Larry Henley, Jeff Silbar – \"Wind Beneath My Wings\" 1983 Alabama Lee Greenwood Janie Fricke Wayne Carson Thompson, Johnny Christopher, Mark James – \"Always on My Mind\" 1982 Alabama Ricky Skaggs Janie Fricke Wayne Carson Thompson, Johnny Christopher, Mark James – \"Always on My Mind\" 1981 Barbara Mandrell George Jones Barbara Mandrell Bobby Braddock, Curly Putman – \"He Stopped Loving Her Today\" 1980 Barbara Mandrell George Jones Emmylou Harris Bobby Braddock, Curly Putman – \"He Stopped Loving Her Today\" 1979 Willie Nelson Kenny Rogers Barbara Mandrell Don Schlitz – \"The Gambler\" 1978 Dolly Parton Don Williams Crystal Gayle Richard Leigh – \"Don't It Make My Brown Eyes Blue\" 1977 Ronnie Milsap Ronnie Milsap Crystal Gayle Roger Bowling, Hal Bynum – \"Lucille\" 1976 Mel Tillis Ronnie Milsap Dolly Parton Larry Weiss – \"Rhinestone Cowboy\" 1975 John Denver Waylon Jennings Dolly Parton John Denver – \"Back Home Again\" 1974 Charlie Rich Ronnie Milsap Olivia Newton-John Don Wayne – \"Country Bumpkin\" 1973 Roy Clark Charlie Rich Loretta Lynn Kenny O'Dell – \"Behind Closed Doors\" 1972 Loretta Lynn Charley Pride Loretta Lynn Freddie Hart – \"Easy Loving\" 1971 Charley Pride Charley Pride Lynn Anderson Freddie Hart – \"Easy Loving\" 1970 Merle Haggard Merle Haggard Tammy Wynette Kris Kristofferson – \"Sunday Mornin' Comin' Down\" 1969 Johnny Cash Johnny Cash Tammy Wynette Bob Ferguson – \"The Carroll County Accident\" 1968 Glen Campbell Glen Campbell Tammy Wynette Bobby Russell – \"Honey\" 1967 Eddy Arnold Jack Greene Loretta Lynn Dallas Frazier – \"There Goes My Everything\" ==References== Category:Music awards",
 "title": "Country Music Association Awards"
}