{
 "id": "133866",
 "text": "Mazda Motor Corporation is a car manufacturer based in Hiroshima, Japan. Mazda is the 15th largest car maker in the world, and 12th largest in U.S. sales. The company was started in 1920. Today it has about 44,000 employees. Sales are 2,057,614,000,000 yen. ==History== In 1920, Toyo Koruku Kogyo was established. In 1984, it changed its name to Mazda. The company is unique in using rotary engines in some of its cars. In 1991, the Mazda 787B (which had a rotary engine) won the 24 Heures du LeMans. From 1979 to 2010, Mazda had a partnership with Ford Motor Company. At one point, Ford owned 1/3 of Mazda's stock. Since 2000, Mazda has grown, especially in Europe and North America, and it is now completely separate from Ford. In 2015, Mazda and Toyota agreed to work together. ==Brand== Mazda produces cars only in Japan and Mexico, but 80% of its sales are outside of Japan. Mazda is the only company that produces cars which have rotary engines (but most of its cars do not have rotary engines). The cars are popular in Australia and Europe, especially Germany and U.K. Nowadays, Mazda's slogan is ZOOM-ZOOM. It is famous for the movie Only Strong. ZOOM-ZOOM comes from English-speaking children calling cars ZOOM-ZOOM. ==Name== Mazda's company name is derived from Matsuda Jujirou who was the founder of this company, and the Zoroastrian god, Ahura Mazda. Ahura Mazda is a symbol of wisdom, reason, and harmony. == Current production vehicles == Body style Model Current generation Vehicle description Image Name(s) Introduction ( year) Introduction ( year) Facelift Hatchback Mazda2 2002 2014 2023 Subcompact hatchback. Also marketed as the Demio in Japan until 2019. Mazda2 Hybrid 2021 2021 2024 Rebadged Toyota Yaris Hybrid (XP210) for the European market. Mazda3 2003 2019 – Compact hatchback. Also marketed as the Axela in Japan until 2019. Sedan Mazda2 2002 2014 2023 Sedan version of the Mazda2, sold in Asia-Pacific and Latin America. Mazda3 2003 2019 – Sedan version of the Mazda3. Mazda6 2002 2012 2018 Mid-size sedan and station wagon. Also marketed as the Atenza in Japan until 2019. Discontinued in the North American market after 2021 model year. EZ-6 2024 2024 – Mid-size electric and range extender sedan based on the Deepal L07 for the Chinese market. Station wagon Mazda6 2002 2012 2018 Station wagon version of the Mazda6. SUV/ crossover CX-3 2015 2015 2018 Subcompact crossover SUV based on the Mazda2. CX-30 2019 2019 – Subcompact crossover SUV. CX-5 2012 2017 2021 Compact crossover SUV. CX-50 2022 2022 – Compact crossover SUV for North America and China. CX-60 2022 2022 – Mid-size crossover SUV based on an RWD platform for Europe and Asia-Pacific. CX-70 2024 2024 – Mid-size Crossover SUV with two-row seating based on an RWD platform for North America and Australia. CX-8 2017 2017 2022 Mid-size crossover SUV with three-row seating for Asia-Pacific. CX-80 2024 2024 – Mid-size crossover SUV with three-row seating based on an RWD platform for Europe and Asia-Pacific. CX-9 2006 2016 – Mid-size crossover SUV with three-row seating. CX-90 2023 2023 – Full-size Crossover SUV with three-row seating based on an RWD platform for North America and Australia. MX-30 2020 2020 – All-electric and hybrid compact crossover SUV based on the CX-30. Roadster MX-5/ Roadster 1989 2015 2023 Front-engine, two-door, two-seater sports car. The best-selling two-seater convertible sports car in history. Pickup truck Bongo 1966 2020 – Pickup version of the Bongo. BT-50 2006 2020 – Compact pickup truck. Third generation is based on Isuzu D-Max. Kei vehicles Carol 1962 2021 – Low-roof hatchback kei car with hinged rear doors. Second generation onwards is a rebadged Suzuki Alto. Flair 2012 2017 – Low-roof hatchback kei car with hinged rear doors. Rebadged Suzuki Wagon R. Flair Crossover 2014 2020 – Crossover SUV-styled kei car. Rebadged Suzuki Hustler. Flair Wagon 2013 2017 – Semi tall-height wagon kei car with rear sliding doors. Rebadged Suzuki Spacia. Previous generation pictured. Scrum 1989 2013 – Cabover kei truck. Rebadged Suzuki Carry. Formerly the Autozam Scrum until 1998. Scrum 1989 2015 – Cabover cargo/passenger microvan with rear sliding doors. Rebadged Suzuki Every cargo van. Formerly the Autozam Scrum Van until 1998. Commercial vans Bongo Brawny 1983 2019 – Long-wheelbase version of the Bongo Van. Third generation is a rebadged H200-series Toyota HiAce. Bongo 1966 2020 – Cabover van. Fifth generation is a rebadged Daihatsu Gran Max. Familia Van (XP160) 2018 2018 – Light commercial van. Rebadged Toyota Probox. Commercial trucks Titan 1971 2023 – Medium-duty truck. Fourth generation onwards is a rebadged Isuzu Elf. Previous generation pictured. ==References== ==Other websites== * Mazda Global Web Site - includes links to Mazda operations worldwide * Mazda Dealerships - North America Category:Automobile companies of Japan Category:Organizations based in Hiroshima Category:1920 establishments in Asia Category:1920s establishments in Japan",
 "title": "Mazda"
}