{
 "id": "133962",
 "text": "The Ancient Olympic Games were a series of athletic competitions held between the city-states of Ancient Greece. They used to be called the Olympic Games (; Olympiakoi Agones) until the modern day Olympic Games started. The Ancient Olympic Games began in 776 BC in Olympia, Greece. Prizes at the games were olive wreaths, palm branches and woollen ribbons. The ancient Olympics were played in the honour of the God Zeus. There is no agreement on when the games officially ended, but many historians think it is 393 AD, when the Christian Roman emperor Theodosius I declared that all Pagan religious practices should end.However, Theodosius' decree contains no specific reference to Olympia (Crowther (2007), p. 54). Another date might be 426 AD, when the next emperor Theodosius II ordered the destruction of all Greek temples.Crowther (2007), p. 54 The stadium in Olympia got buried by landslides and other natural disasters. After the Olympics stopped, they were not held again until the modern Olympic Games were started in 1896 in Athens. Women were not allowed to compete, or even watch most events. According to Pausanias, any woman found on the site had to be thrown off the rock of Typhaion.Pausanias, V, 6, 7 and V, 13, 10 This only applied to married women (gunaikes), the only exception was the priestess of Demeter.Pausanias, VI, 20, 9. Unmarried women were allowed as spectators. It seems that only one woman was ever found, Kallipateira, a widow, who disguised as the person training her son. She was found when she jumped into the air when her son won.Pausanias, VI, 7, 2 She was spared the fate, but to avoid this happening again, all people competing, and the people training them had to be naked. Nevertheless, unmarried women attending as spectators was improbable. An exception to this were the equestrian events. Women were allowed to enter horses. Those contorolling the horses or chariots still had to be male. The chariot races also saw the first woman to win an Olympic event. The winner was deemed to be the wealthy benefactor or trainer that funded the team rather than those controlling the chariot (who could only be male). This allowed for horse trainer and Spartan princess Cynisca to be the first female Olympic victor.Millender, Ellen G., \"Spartan Women\" p. 500-525. In A Companion to Sparta, edited by Anton Powell, Vol. 1 of A Companion to Sparta. Hoboken, New Jersey: Wiley Blackwell, 2018. Because the winner was the benefactor, it was also possible for a particularly wealthy person to improve their odds by bringing multiple teams to the races. According to Plutarch, the record belongs to Alcibiades, who brought seven chariots to a single competition, winning the first, second, and either the third or fourth place at once.Plutarch, The Life of Alcibiades In 67, the Roman Emperor Nero competed in the chariot race at Olympia. He was thrown from his chariot and was thus unable to finish the race. Nevertheless, he was declared the winner on the basis that he would have won if he had finished the race. == Famous athletes == Here are athletes that competed at the Games: * from Athens: ** Aurelios Zopyros (Junior boxing) * from Sparta: ** Acanthus of Sparta (Running: diaulos) ** Chionis of Sparta (Running: stadium, diaulos. Long and Triple Jump) ** Cynisca of Sparta (first woman to be listed as an Olympic victor) * from Rhodes: ** Diagoras of Rhodes (Boxing 79th Olympiad, 464 BCE) and his sons Akusilaos and Damagetos (Boxing and Pankration) ** Leonidas of Rhodes (Running: stadium, diaulos and hoplitodromos) * from Croton: ** Astylos of Croton (Running: stadium, diaulos and hoplitodromos) ** Milo of Croton (wrestling) ** Timasitheos of Croton (wrestling) * from other cities: ** Koroibos of Elis (Stadion) ** Orsippus of Megara (Runner: diaulos) ** Theagenes of Thasos (Pankration) * non-Greek: ** Tiberius (steerer of a four-horse chariot)Tiberius, AD 1 or earlier - cf. Ehrenberg & Jones, Documents Illustrating the Reigns of Augustus and Tiberius [Oxford 1955] p. 73 (n.78) ** Nero (steerer of a ten-horse chariot) ** Varastades, Prince and future King of Armenia, (last known Ancient Olympic victor (boxing) during the 291st Olympic Games in the fourth century.369 according to Encyclopedia of Ancient Greece by Nigel Wilson, 2006, Routledge (UK) or 385 according to Classical Weekly by Classical Association of the Atlantic States ==Related pages== * Olympic Games == References == == Other websites == * The Ancient Olympic Games Virtual Museum (requires registration) * Ancient Olympics (General and detailed information) * The Ancient Olympics (A special exhibit) * The Real Story of the Ancient Olympic Games * The Origin of the Olympics * The Original Olympic Movement Since 776 B.C. * List of Macedonian Olympic winners (in Greek) * Webquest The ancient and modern Olympic Games Category:Olympic Games in Europe",
 "title": "Ancient Olympic Games"
}