{
 "id": "133927",
 "text": "was the 122nd emperor of Japan according to the traditional order of succession.Imperial Household Agency (Kunaichō), 明治天皇 (122). Retrieved 2011-10-16. His reign lasted from 1867 until his death in 1912.Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. He was Emperor of the Empire of Japan from 1867 to 1912 and he was the leader of Japan in the First Sino-Japanese War (1894–1895), the Boxer Rebellion (1899–1901) and the Russo-Japanese War (1904–1905), being rivals with the Qing dynasty, the Russian Empire and European Powers. He was involved in the Boxer Rebellion to stop Qing Empress Dowager Cixi. Emperor Meiji allied with Russia (led by Nicholas II), Germany (led by Kaiser Wilhelm II), Austria-Hungary (led by Franz Joseph I of Austria), France (led by Félix Faure and Émile Loubet), Britain (led by Robert Gascoyne-Cecil, 3rd Marquess of Salisbury) and the United States of America (led by William McKinley) to help General Yuan Shikai in the Boxer Rebellion (1899–1901). He was also involved in the Philippine-American War (1899–1902) along with Emperor Wilhelm II before the Russo-Japanese War in 1904. He was Emperor of Japan (1867–1912), Taiwan (1895–1912) and Korea (1910–1912). ==Events of Meiji's life== Meiji's reign was marked by many changes including the move of the Imperial court from Kyoto to Tokyo. ===Timeline 1852-1912=== A timeline of major events includes: * 1852 (Kaei 5): A son called Sachinomiya is born to Emperor Kōmei * 1860 (Ansei 7): Sachinomiya becomes official heir and his personal name (imina) becomes Mutsuhito. * 1867 (Keiō 3): Kōmei dies and the responsibility of the throne passes to Crown Prince Mutsuhito.Nussbaum, \"Kōmei Tennō\" at p. 553. * 1868 (Meiji 1): Official beginning of the emperor's reign and Japanese era name becomes the first year of Meiji.Nussbaum, \"Meiji\" at p. 624. * 1869 (meiji 2): Marriage to Ichijo Haruko, who becomes Empress Shoken.Nussbaum, \"Meiji Tennō\" at p. 624. * 1879 (meiji 12): Prince Yoshihito (the future Taisho Tenno) is born.Nussbaum, \"Taishō Tennō\" at p. 929. * 1889 (Meiji 22): Meiji Constitution is proclaimed * 1894 (Meiji 27): Sino-Japanese War * 1899-1901 Boxer Rebellion * 1904–1905 (Meiji 37-38):: Russo-Japanese War * 1912 (Meiji 45): The emperor dies ===After death=== He died in Tokyo. A detailed account of the state funeral in the New York Times concluded with an observation: \"The contrast between that which preceded the funeral car and that which followed it was striking indeed. Before it went old Japan; after it came new Japan.\" \"The Funeral Ceremonies of Meiji Tenno\" reprinted from the Japan Advertiser [Article 8—No Title], The New York Times. 13 October 1912. Retrieved 2011-10-16. The spirits of Emperor Meiji and his wife are honored at the in Tokyo.Japan-guide.com, Shrine\"; Meiji jingū, \"Introduction\". Retrieved 2012-6-13. ==Honors== * Order of the Garter, 1906 \"The Mikado's Garter,\" The New York Times. 28 July 1906. Retrieved 2011-10-16. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Meiji period * Meiji Seamount == References == ==Further reading== *Jansen, Marius. (1995). The Emergence of Meiji Japan. Cambridge: Cambridge University Press. ; ; OCLC 31515308 *Keene, Donald. (2002). Emperor of Japan: Meiji and His World, 1852–1912. New York: Columbia University Press. ; OCLC 46731178 == Other websites == Category:Emperors of Japan Category:Politicians from Kyoto Prefecture Category:1852 births Category:1912 deaths Category:19th-century Japanese monarchs",
 "title": "Emperor Meiji"
}