{
 "id": "133918",
 "text": "was the 269th emperor of Japan according to the traditional order of succession.Imperial Household Agency (Kunaichō), 大正天皇 (123); retrieved 2011-10-16. His reign started in 30 July 1912 and ended with his death in 1926.Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. He was Emperor of Japan from 1912-1926, and as head of state was involved in World War 1, fighting against the German Empire while allied with the British Empire, French Third Republic, Portuguese Empire, and Australia from 1914-1918 . Emperor Taisho was also involved in the Russian Civil War in the Siberian Intervention from 1918-1922, as well the 1918-1920 Revolt Of The Czechoslovak Legion, but had to withdraw the Imperial Japanese Army from the Russian Civil War in 1922. Emperor Taishō (meaning \"Great Justice\") was the name given to Yoshihito at the time of his coronation.Nussbaum, \"Taishō Tennō\" at p. 929. Emperors of Japan receive a new name at the time of their coronation, and people start using the new name, both to refer to the emperor himself and the name of the era during which he reigned. ==Events of Taishō's life== Taishō's early life was marked by many changes in the role of emperor; and his reign was a period of consolidation. ===Timeline=== A timeline of major events includes: * 1879 (Meiji 12): A son called Harunomiya (also named Yoshihito) is born to Emperor MeijiNussbaum, \"Meiji Tennō\" at p. 624. * 1900 (Meiji 33): Prince Yoshihito marries Kujō Sadako, who becomes Empress Teimei. * 1901 (Meiji 34): Prince Michinomiya (also named Hirohito) is born.Nussbaum, \"Hirohito\" at p. 318. * 1912 (Taishō 1): Prince Yoshihito became emperor; also, the Japanese era name becomes the first year of Taishō. * 1914-1918 (Taishō 3-7): World War I * 1921 (Taishō 10): Taishō's son Prince Hirohito became regent.Nussbaum, \"Shōwa Tennō\" at p. 889. * 1923 (Taishō 12): Great Kantō earthquakeHammer, Joshua. (2006). Yokohama Burning: the Deadly 1923 Earthquake and Fire that Helped Forge the Path to World War II, p. 43-44. * 1926 (Taishō 15): The emperor dies and the responsibility of the throne passes to Crown Prince Hirohito; also, the era name became the first year of Shōwa. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Taishō period == References == ==Further reading== * Bix, Herbert P. (2000). Hirohito and the Making of Modern Japan. New York: HarperCollins. ; OCLC 247018161 * Young, Arthur Morgan. (1928). Japan under Taisho Tenno: 1912-1926. London: George Allen & Unwin. OCLC 2158641 == Other websites == Category:Emperors of Japan Category:1879 births Category:1926 deaths Category:People from Kyoto Prefecture",
 "title": "Emperor Taishō"
}