{
 "id": "13403",
 "text": "The Republican Party, also known as the Grand Old Party (GOP) is one of the two biggest political parties in the United States. Since the mid-1850's, the party's main opponent has been the Democratic Party. Both political parties have controlled American politics ever since. The party sits at the right-wing of the American political spectrum, with the Democratic Party being positioned to their left. However, there also factions of the Republican Party that are center-right to far-right. Ideologically, Republicans favor fiscal and social conservatism. It opposes single-payer healthcare, abortion, euthanasia, labor unions, affirmative action, marijuana legalization, and a high minimum wage. It advocates for low taxes, limited government, gun rights, free markets, and free trade. It did, however, hold protectionist opinions during its early days, for example during Theodore Roosevelt’s presidency. It also held anti- free trade opinions during Donald Trump’s presidency. The symbol of the Republican party is the elephant. This symbol was first used in 1874 in a political cartoon by Thomas Nast.Cartoon of the Day: \"The Third-Term Panic\". Retrieved on 2008-09-01. The Republican National Committee, or the RNC, is the main organization for the Republican Party in all 50 states. The Republican Party is not the same political party as the Democratic-Republican Party. A state where most voters vote for Republican politicians is called a red state. ==History== The Republican Party was founded in Ripon, Wisconsin in 1853, with the help of Francis Preston Blair. The Republican Party was formed by people who did not like the Kansas-Nebraska Act of 1854, which would let each territory allow slavery. The Republican Party was founded by past members of the Free Soil Party and the Whig Party who wanted to stop the expansion of slavery. The founders of the Republican Party wanted to stop the expansion of slavery because they believed it was against the ideals of the Constitution and Declaration of Independence. Some founders of the Republican Party wanted to abolish slavery everywhere in the United States. The Republican Party's first candidate for president of the United States was John C. Frémont in 1856. As the Whig Party collapsed, the Republicans became one of two major political parties in the United States (the Democratic Party was the other major political party). In 1860 Abraham Lincoln, the first Republican president, was elected. For the rest of the second half of the 19th century, the country had mostly Republican presidents. From 1860 until 1912 the Republicans lost the presidential election just twice (non-consecutively to Democrat Grover Cleveland in 1884 and 1892). Republicans believed in protectionism (the belief that raising taxes on trades with other countries would protect the economy) during the second half of the 19th century and during the early half of the 20th century. After World War I, the 1920s had three Republican presidents: Warren Harding, Calvin Coolidge, and Herbert Hoover. It was called the Republican Decade for that reason. Harding and Coolidge made a plan for the economy which lowered taxes, made the government spend less money, and got rid of rules and laws that affected the economy. Near the end of the 1920s, the stock market crashed and the Great Depression began. During the Great Depression, the Republican Party became less popular. No Republicans were president between 1933 and 1953, when Dwight Eisenhower began his first of two consecutive terms as president (he was re-elected in 1956). Richard Nixon lost the election in 1960, but was elected president on the Republican ticket in 1968 and again in 1972. Ronald Reagan, an actor and conservative political activist, was elected as president in 1980. Ronald Reagan became the first Republican president who was a former member of the Democratic Party. Ronald Reagan served two terms and his successor George H.W. Bush served one term. Reagan wanted fewer laws to affect the economy, and wanted the military to be stronger. Bill Clinton (a Democrat) was elected president in 1992, and re-elected in 1996. However, a new Congress was elected in 1994, and Republicans gained control of both the House of Representatives and the Senate. They voted against many of Clinton's ideas and proposed ideas of their own such as a line-item veto and a balanced budget amendment. In 2000, George W. Bush was elected president, defeating Al Gore in a very close election. Bush was re-elected in 2004. After elections held in 2006, Republicans lost control of Congress. Democrat Barack Obama was elected in 2008 and re-elected in 2012. Republican John Boehner was elected the Speaker of the House of Representatives in 2010 and re-elected in 2012. In 2014, Republicans gained control of the Senate and the House. Boehner resigned in early October 2015 and was eventually succeeded by Paul Ryan of Wisconsin on October 29, 2015. On November 9, 2016, Donald Trump was elected president, defeating Democrat Hillary Clinton in the Electoral College. Trump was the first Republican to take office as president since January 20, 2001, when George W. Bush was inaugurated. The Republicans lost the House and won the Senate in 2018. Paul Ryan retired in 2019 and was succeeded by Nancy Pelosi, who is a member of the Democratic Party. In 2020, the Republicans lost the presidency when Joe Biden defeated Donald Trump. In 2022, they were able to get control back of the House of Representatives, but not the Senate. In 2024, the Republicans won the presidency again when Donald Trump defeated Kamala Harris. They were also able to hold their control of the House of Representatives, as well as gain control of the Senate. == Republican beliefs == Currently, the Republican Party is identified by classical liberalism, conservatism, and right-wing policies. Most Republicans believe in the same things, but generally, these are the things many Republicans support in all: *Small government *Federalism and subsidiarity * Capitalism, laissez-faire, and supply-side economics * Reduced government spending * Aiding the State of Israel, the United States' allies, and defending American interests in the Middle East. * Lower taxes * A strong military and strong national defense with increased military spending * The 2nd Amendment and allowing people to own guns * Educational choice, e.g. a voucher system such as the D.C. Opportunity Scholarship Program. * Oppose illegal immigration and support of deportation * Oppose government-run health care * Oppose letting students go to college or university for free * Oppose declaring Washington D.C. an official state. * Oppose abortion * Oppose homosexuals & Transgenders Most supporters for the Republican Party come from states in the Southern, Deep South, parts of the Midwest, and the rural Northeast areas of the US, as well as from Montana; though they come from all over the United States, including the northern portion of California. == List of Republican presidents == # President Portrait State Term start Term end Years in office 16 (1809–1865) Illinois March 4, 1861 April 15, 1865 18 (1822–1885) Ohio March 4, 1869 March 4, 1877 19 (1822–1893) Ohio March 4, 1877 March 4, 1881 20 (1831–1881) Ohio March 4, 1881 September 19, 1881 21 (1829–1886) New York September 19, 1881 March 4, 1885 23 (1833–1901) Indiana March 4, 1889 March 4, 1893 25 (1843–1901) Ohio March 4, 1897 September 14, 1901 26 (1858–1919) New York September 14, 1901 March 4, 1909 27 (1857–1930) Ohio March 4, 1909 March 4, 1913 29 (1865–1923) Ohio March 4, 1921 August 2, 1923 30 (1872–1933) Massachusetts August 2, 1923 March 4, 1929 31 (1874–1964) California March 4, 1929 March 4, 1933 34 (1890–1969) Texas January 20, 1953 January 20, 1961 37 (1913–1994) California January 20, 1969 August 9, 1974 38 (1913–2006) Michigan August 9, 1974 January 20, 1977 40 (1911–2004) California January 20, 1981 January 20, 1989 41 (1924–2018) Texas January 20, 1989 January 20, 1993 43 (born 1946) Texas January 20, 2001 January 20, 2009 45 (born 1946) New York/ Florida January 20, 2017 January 20, 2021 47 (born 1946) Florida January 20, 2025 Incumbent ==List of famous Republicans== *Buzz Aldrin (US astronaut) *Abraham Lincoln (US president) *Susan B. Anthony (women's rights activist, abolitionist activist) *Clara Barton (Union Army Civil War nurse, humanitarian, Red Cross founder) * Jeb Bush (Former governor of Florida, son of Former President George H. W. Bush and brother of Former President George W. Bush) * Jan Brewer (Former governor of Arizona) *Dr. Ben Carson (U.S. Secretary of HUD under President Trump, retired neurosurgeon) * Dick Cheney (Vice President under President George W. Bush) * Chris Christie (Former Governor of New Jersey) *Bing Crosby (American singer and actor) * Thomas Dewey (Presidential candidate in 1944 and 1948) * Bob Dole (presidential candidate in 1996, former Senator from Kansas) *Elizabeth Dole (former Senator from North Carolina, former U.S. Secretary of Labor under President George Bush, former U.S. Secretary of Transportation under President Reagan) *John Ford (American film director and producer) * Newt Gingrich (former speaker of the U.S. House of Representatives) * Rudy Giuliani (former mayor of New York City, former presidential candidate, former US attorney) * Barry Goldwater (presidential candidate in 1964, former Senator from Arizona) * Chuck Hagel (a former senator from Nebraska, former U.S. Secretary of Defense) *Nikki Haley (UN Ambassador, former Governor of South Carolina) *Sean Hannity (a well-known talk show host on Fox News) * Dennis Hastert (former speaker of the U.S. House of Representatives) *Orrin Hatch (former President Pro-tempore of the Senate) * Jack Kemp (vice-presidential candidate in 1996) *Jeane Kirkpatrick (former UN Ambassador, professor) * Henry Kissinger (former U.S. Secretary of State) * Rush Limbaugh (a radio talk show host) * Mia Love (former U.S. Representative) * Richard Lugar (former senator from Indiana) * John McCain (presidential candidate in 2008, former Senator from Arizona) * Mitch McConnell (Senate Majority Leader) * Sarah Palin (vice presidential candidate in 2008, former Governor of Alaska) *Dr. Rand Paul (Senator from Kentucky, physician) *Dr. Ron Paul (former U.S. Congressman from Texas, physician, author) * Colin Powell (general during Persian Gulf War, Secretary of State) *Paul Robeson (American singer, actor, and Civil Rights activist) * Nelson Rockefeller (Vice President under President Gerald Ford, former Governor of New York) * Mitt Romney (former Governor of Massachusetts, presidential candidate in 2012, Senator from Utah) * Paul Ryan (former Speaker of the US House of Representatives, vice presidential candidate in 2012, U.S. Congressman) * Condoleezza Rice (former U.S. Secretary of State) * Karl Rove (former strategist to President George W. Bush) * Donald Rumsfeld (U.S. Secretary of Defense under President George W. Bush) * Mark Sanford (Governor of South Carolina) *Arnold Schwarzenegger (American actor, former governor of California) *Elizabeth Cady Stanton (abolitionist activist, women's rights activist) * Kenneth Starr (U.S. prosecutor of Democrat Bill Clinton) * Michael Steele (Former chairman of the Republican National Committee) * Ted Stevens (Former Senator from Alaska) *Dr. Mary Edwards Walker (Union Army Civil War doctor and surgeon, abolitionist activist, women's rights activist) *John Wayne (American actor) == Notes == ==References== ==Other websites== * Category:1854 establishments in the United States Category:Conservative parties *[#]: Order of presidency",
 "title": "Republican Party (United States)"
}