{
 "id": "134001",
 "text": "Nevado del Ruiz is a volcano in Colombia. It is also called Mount Ruiz. It is about west of Bogotá, close to the town of Armero. It is the tallest active volcano in Colombia. The eruption of 1985 caused a lahar. About 23,000 people died when the mud from the lahar covered Armero. This makes it the most deadly lahar that is known. People who live near the volcano call it \"the Sleeping Lion\", because it was dormant or sleeping for nearly 150 years before the Armero lahar. == Features == Nevado del Ruiz is a broad, icy stratovolcano that covers more than . Three major parts, made of andesitic and dacitic lavas and andesitic pyroclastics, have built up since the beginning of the Pleistocene. The cone consists of a wide cluster of lava domes produced within the summit caldera. The 1-kilometer wide, Arenas crater is the summit. The prominent La Olleta pyroclastic cone is on the volcano's southwest flank and may also have been active in historical times. The mountain's flanks are lined by steep and massive landslides. Melting of its summit icecap during historical eruptions resulted in devastating lahars, including the famous eruption in 1985 that was the world's deadliest. There was an eruption in 2016. == Eruptions before 1985 == In 1595, a lahar flowed down along the valleys of the River Guali and the River Lagunillas, killing 636 people. In 1845, another massive lahar flooded the upper valley of the River Lagunillas, killing over 1,000 people. It continued for downstream before spreading across a plain in the lower valley floor. It is believed both of these formed from melting of the snow and ice that cover the summit. == 1985 eruption == Nevado del Ruiz was very active in the three months before it erupted. Italian volcanologists analyzed gas samples from the fumaroles along the Arenas crater floor. They were a mixture of carbon dioxide and sulfur dioxide, indicating a direct magmatic release. A very high lahar risk was stressed in the mission's report delivered on October 22, 1985 and various simple preparedness techniques were proposed to local authorities. During the following \"quiet\" period in October, the hydrothermal component of the vapor discharge steadily increased. The gases were super-saturated with elemental sulfur; their thermodynamic equilibration temperatures ranged from 200 to 600° Celsius. Gases and water from fumaroles and thermal springs on the flanks of the volcano are likely to be produced from a two-phase vapor-brine envelope within the volcano. Production of such gas over extended periods may account for the large amount of sulfur dioxide being released from the volcano in relation to the small amount of ejected solids. The destruction wrought by the 1985 eruption was partially due to the fact that many scientists did not say whether or not to evacuate the area. A group of scientists informed them that they faced imminent and almost certain death. The people in Armero thought that because the volcano had not erupted in 100 years, it had no reason to erupt. Scientists later looked back to the hours before the eruption and noticed that several long period earthquakes had occurred. Long-period earthquakes are those which start out strong and then die down very slowly. Volcanologist Bernard Chouet said that these earthquakes occur in the final hours before an eruption. According to Chouet, \"the volcano was screaming 'I'm about to explode',\" but scientists at the time doubted his theory. On November 13, 1985, at 9:08 pm, Nevado del Ruiz erupted; ejecting dacitic tephra more than 30 kilometers into the atmosphere. The amount of magma erupted from the volcano was 3% of that from Mount St. Helens in 1980. The eruption reached Volcanic Explosivity Index 3. The material ejected was described by scientists as \"unusually rich in sulfur dioxide\". Pyroclastic flows melted ice and snow at the summit, forming 4 thick lahars that rushed down the river valleys. As most lahars do, the mudflows began as flows of water, sand, and gravel, and mixed with clay along the way. The lahars were up to wide and six feet deep (2 m) and travelled more than . The lahars destroyed many houses and towns. The town of Armero was completely covered, killing approximately 21,000 people (three-fourths of the population), as well as affecting 13 other villages. The eruption caused an estimated 23,000 deaths, 5,000 injuries, and destroyed more than 5,000 homes. This was the second deadliest volcanic disaster in the 20th century, after the 1902 eruption of Mount Pelee, and the fourth deadliest eruption in recorded history. It is the deadliest lahar in recorded history, and Colombia's worst natural disaster. The disaster got some coverage because of a photograph taken by photographer Frank Fournier, of a young girl named Omayra Sánchez who was trapped beneath rubble for three days before she died.Picture power: Tragedy of Omayra Sanchez BBC, September 30, 2005 – Retrieved: July 9, 2007 In response to the eruption, the USGS Volcano Crisis Assistance Team was formed in 1986, and the Volcano Disaster Assistance Program. == Aftermath == The volcano erupted again in 1988 and 1991.In April 2008, it erupted again, and thousands were evacuated. Volcanologists were worried that this could be another \"Nevado del Ruiz\". Survivors who went to other towns in the area were gradually housed in new government schemes. Armero was not rebuilt because the old lahar traces were discovered, and the Colombian government declared the site \"holy ground\" so that no one would ever suffer again like Armero. Now a new system can detect lahars, giving people more warning to evacuate before they happen. The system uses Acoustic Flow Monitors which analyze ground shaking that could result in a lahar. These monitors are placed in the volcano and warn officials if there is a lot of shaking. They were tested on Mount Rainier in the United States. == Geology == The glaciers of Nevado del Ruiz were formed slowly over hundreds of years. Because of global warming, the glaciers are starting to melt. Since Ruiz became well-known after its eruption in 1985, scientists and government officials in Colombia are worried the glaciers might melt completely. The stratovolcano is in the Pacific Ring of Fire, an area of the earth's crust where the land is unstable. It encircles the Pacific Ocean, and houses some of the world's most active volcanoes. The volcano is the northernmost of several Colombian stratovolcanoes in the Andean Volcanic Belt of western South America. The Andean volcanic belt was produced by the eastward subduction of the oceanic Nazca plate beneath the South American continental plate. Normally, these type of stratovolcanoes generate explosive Plinian eruptions with associated pyroclastic flows that can melt snow and glaciers near the summit, producing devastating lahars. The volcano is part of the Ruiz-Tolima volcanic massif (or Cordillera Central), a group of five different icy stratovolcanoes. == References == Category:Andes Category:Volcanoes of South America Category:Caldas Department Category:Tolima Department",
 "title": "Nevado del Ruiz"
}