{
 "id": "13404",
 "text": "The Democratic Party, also known as the Democrats, is one of the two biggest political parties in the United States. Since the mid-1850's, the party's main opponent has been the Republican Party. Both political parties have controlled American politics ever since. ==Overview== The party sits at the center to center-left of the American political spectrum, with the Republican Party being positioned to their right. Every four years, the party holds a National Convention where they agree on their candidate for president. The Democratic National Committee coordinates most of the activities of the Democratic Party in all 50 United States. Since Andrew Jackson's inauguration in 1829, there have been 16 Democratic presidents. The most recent is Joe Biden who took office as the 46th president of the United States in January 2021. The Democratic Party represents a broad spectrum of liberal and left-wing ideologies, including but not limited to classical liberalism, social democracy, progressivism, and social modern liberalism. ==Philosophy== Democrats, also sometimes called the left, liberals or progressives make up one of the two main political parties in the United States. A mostly Democratic state is sometimes called a blue state. This comes from the party’s main color, which is blue, referring to a state supporting \"blue\" candidates. ===Role of government=== Democrats believe in a strong government with social assistance programs to help members of society. They prefer diplomatic solutions to conflicts, and take generally multilateralist views on trade, believing that trade must be free, but fair to protect American workers, consumers, local communities, and the environment. Some Democrats are economic centrists. ===Social issues=== Socially, most Democrats believe in sociocultural liberalism, taking pro-immigration, pro-marriage equality, and pro-choice views.* * * * ==Beliefs== Currently, the Democratic Party is identified by progressivism, liberalism, and left-wing policies. Not all Democrats hold the same beliefs, but generally these are the things many Democrats support: * Progressive income tax * Higher corporate taxes and recapturing income from overseas profits * Spending on business, education, infrastructure and clean energy * Expanding spending on government programs * Ending the death penalty * Expanding rights to abortion * Gun regulations to prevent citizens from hurting themselves and others with firearms * Support same-sex marriage * Universal healthcare * Declare Washington D.C. an official state * Helping students go to college or university for free without having to pay back the government * Believe in allowing undocumented immigrants to work for their U.S Citizenship in the U.S. to stay, pay taxes, and oppose mass deportation Most support for Democrats comes from states in the Northeast, Upper Midwest, and the Pacific Coast, as well as from the state of Hawaii. ==Symbols== The symbol of the Democratic Party is the donkey.see \"History of the Democratic Donkey\" Since the election of 2000, the color blue has become a symbol for Democrats. Historically, Thomas Jefferson, whom the party claims as its founder, has been often seen as symbols of the Democratic Party, particularly emphasized in the annual celebrations of Jefferson Day Dinners held since the days of Andrew Jackson. As such, the Democratic Party is also often referred to as the “Party of Jefferson.” ==List of Democratic presidents== # President Portrait State Term start Term end Years in office 7 Andrew Jackson (1767–1845) Tennessee March 4, 1829 March 4, 1837 8 Martin Van Buren (1782–1862) New York March 4, 1837 March 4, 1841 11 James K. Polk (1795–1849) Tennessee March 4, 1845 March 4, 1849 14 Franklin Pierce (1804–1869) New Hampshire March 4, 1853 March 4, 1857 15 James Buchanan (1791–1868) Pennsylvania March 4, 1857 March 4, 1861 17 Andrew Johnson (1808–1875) Tennessee April 15, 1865 March 4, 1869 22 Grover Cleveland (1837–1908) New York March 4, 1885 March 4, 1889 24 March 4, 1893 March 4, 1897 28 Woodrow Wilson (1856–1924) New Jersey March 4, 1913 March 4, 1921 32 Franklin D. Roosevelt (1882–1945) New York March 4, 1933 April 12, 1945 33 Harry S. Truman (1884–1972) Missouri April 12, 1945 January 20, 1953 35 John F. Kennedy (1917–1963) Massachusetts January 20, 1961 November 22, 1963 36 Lyndon B. Johnson (1908–1973) Texas November 22, 1963 January 20, 1969 39 Jimmy Carter (1924–2024) Georgia January 20, 1977 January 20, 1981 42 Bill Clinton (born 1946) Arkansas January 20, 1993 January 20, 2001 44 Barack Obama (born 1961) Illinois January 20, 2009 January 20, 2017 46 Joe Biden (born 1942) Delaware January 20, 2021 January 20, 2025 ==Select list of Democratic politicians== * Kamala Harris (California), Vice President and U.S. Senator from California * John Kerry (Massachusetts), former Secretary of State, former Senator, former presidential nominee * Patrick Leahy (Vermont), former President Pro Tempore, Senator, and Dean of the Senate * Hillary Clinton (New York), former Secretary of State, former Senator, former First Lady, former presidential nominee * Jim Clyburn (South Carolina), Representative and Assistant Democratic Leader * Howard Dean (Vermont), former Governor and former head of the Democratic National Committee, former presidential nominee * Christopher Dodd (Connecticut), former Senator * Mario Cuomo (New York), former Governor * Dick Durbin (Illinois), Senate Whip * George Moscone (California), former Mayor of San Francisco * Chuck Schumer (New York), Senator, former Senate Majority Leader * Harvey Milk (California), Member of the San Francisco Board of Supervisors * William M. Daley (Illinois), candidate for Governor of Illinois, former White House Chief of Staff * Frank Lautenberg (New Jersey), former Senator * Pat Quinn, Governor of Illinois * Paul Simon (Illinois), former Senator * Arlen Specter (Pennsylvania), former Senator * Bob Menendez (New Jersey), Senator * Richard M. Daley (Illinois), former Mayor of Chicago * Richard J. Daley (Illinois), former Mayor of Chicago * Al Gore (Tennessee), former presidential candidate and vice-president * John F. Kennedy, former President (Massachusetts) * Robert F. Kennedy, former Senator, former presidential candidate, and brother of John F. Kennedy * Daniel Inouye (Hawaii), former President Pro Tempore, former Senator, and former Dean of the Senate * Steny Hoyer (Maryland), House Minority Whip * Robert Byrd (West Virginia), former President Pro Tempore, former Senator, and former Dean of the Senate * Tim Kaine (Virginia), Governor, 2016 vice presidential nominee and former head of the Democratic National Committee * Dennis Kucinich (Ohio), Representative * Janet Napolitano (Arizona), Secretary of Homeland Security * Nancy Pelosi (California), Speaker of the House, former Speaker of the House. * Brian Schweitzer (Montana), former Governor * Harry Reid (Nevada), former Senate Minority Leader, former Majority Leader * Rahm Emanuel (Illinois), Mayor of Chicago, former White House Chief of Staff * Harry F. Byrd, Jr. (Virginia), former Senator * Bill Richardson (New Mexico), Governor * Debbie Wasserman Schultz (Florida), Representative and former head of the Democratic National Committee * Mark Warner (Virginia), Senator and former Governor * Elizabeth Warren, Senator from Massachusetts * Alexandria Ocasio-Cortez (New York), Representative * Hakeem Jeffries, House Minority Leader ==Independents who work with Democrats== * Bernie Sanders, Senator from Vermont * Angus King, Senator from Maine ==List of former Democrats== * Ronald Reagan (California), 40th president of the United States (1981–1989). Registered Democrat until 1962. * Condoleezza Rice (Alabama), 66th United States Secretary of State (2005–2009). Registered Democrat until 1982. * Rudy Giuliani (New York), 107th Mayor of New York City (1994–2001). Registered Democrat until 1975. * Rick Perry (Texas), 14th United States Secretary of Energy (2017–2019), 47th Governor of Texas (2000–2015). Registered Democrat until 1989. * Jesse Helms (North Carolina), United States Senator (1973–2003). Registered Democrat (1942–1970). * Donald Trump (New York), 45th and 47th President of the United States (2017–2021), (2025–present) Registered Democrat on and off until 2009. ==Related pages== * Libertarian Party * Democratic- Republican Party ==References== ==Other websites== * www.democrats.org Category:1828 establishments in the United States *[#]: Order of presidency",
 "title": "Democratic Party (United States)"
}