{
 "id": "134129",
 "text": "Vinnie Jones (born 5 January 1965) is a former English football player. He played for Wales national team. Jones is now an actor. He played Juggernaut in Marvel's X-Men: The Last Stand. Jones was a housemate in the 2010 UK series of Celebrity Big Brother. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Wealdstone 1984–85 Alliance Premier League 12 0 0 0 — 0 0 12 0 1985–86 26 2 1 0 — 0 0 27 2 Total 38 2 1 0 0 0 0 0 39 2 IFK Holmsund (loan) 1986 Division 3 Mellersta Norrland 22 1 0 0 — 0 0 22 1 Wimbledon 1986–87 First Division 22 4 4 1 2 0 0 0 28 5 1987–88 First Division 24 2 6 0 4 0 0 0 34 2 1988–89 First Division 31 3 4 0 5 0 1 0 41 3 Total 77 9 14 1 11 0 1 0 103 10 Leeds United 1989–90 Second Division 45 5 1 0 2 0 4 0 52 5 1990–91 First Division 1 0 0 0 0 0 0 0 1 0 Total 46 5 1 0 2 0 4 0 53 5 Sheffield United 1990–91 First Division 31 2 1 0 4 0 1 0 37 2 1991–92 First Division 4 0 0 0 0 0 0 0 4 0 Total 35 2 1 0 4 0 1 0 41 2 Chelsea 1991–92 First Division 35 3 4 1 1 0 5 2 45 6 1992–93 Premier League 7 1 0 0 0 0 0 0 7 1 Total 42 4 4 1 1 0 5 2 52 7 Wimbledon 1992–93 Premier League 27 1 0 0 0 0 0 0 27 1 1993–94 Premier League 33 2 0 0 2 0 0 0 35 2 1994–95 Premier League 33 3 2 0 2 0 0 0 37 3 1995–96 Premier League 31 3 3 0 2 0 0 0 36 3 1996–97 Premier League 29 3 7 0 2 0 0 0 38 3 1997–98 Premier League 24 0 3 1 1 0 0 0 28 1 Total 177 12 15 1 9 0 0 0 201 13 Queens Park Rangers 1997–98 First Division 7 1 0 0 0 0 0 0 7 1 1998–99 First Division 2 0 0 0 0 0 0 0 2 0 Total 9 1 0 0 0 0 0 0 9 1 Career total 446 36 36 3 27 0 11 2 520 41 ===International=== Date Location Host team Score Away team Competition Goals scored 14 December 1994 Cardiff 0–3 UEFA Euro 1996 qualifying 0 29 March 1995 Sofia 3–1 UEFA Euro 1996 qualifying 0 26 April 1995 Düsseldorf 1–1 UEFA Euro 1996 qualifying 0 7 June 1995 Cardiff 0–1 UEFA Euro 1996 qualifying 0 24 April 1996 Lugano 1–0 Friendly 0 9 November 1996 Eindhoven 7–1 1998 FIFA World Cup qualifier 0 14 December 1996 Cardiff 0–0 1998 FIFA World Cup qualifier 0 11 February 1997 Cardiff 0–0 Friendly 0 29 March 1997 Cardiff 1–2 1998 FIFA World Cup qualifier 0 Total Appearances 9 Goals 0 ==Honours== Wealdstone *Alliance Premier League: 1984–85 IFK Holmsund * Division 3 Mellersta Norrland: 1986 Wimbledon *FA Cup: 1987–88 Leeds United *Football League Second Division: 1989–90 ==Filmography== ===Film=== Year Title Role Notes 1998 Lock, Stock and Two Smoking Barrels Big Chris Won - Empire Award for Best Newcomer 2000 Gone in 60 Seconds The Sphinx 2000 Snatch Bullet Tooth Tony 2001 Swordfish Marco 2001 Night at the Golden Eagle Rodan 2001 Mean Machine Danny Meehan 2004 The Big Bounce Lou Harris 2004 Tooth The Extractor 2004 EuroTrip 'Mad' Maynard 2004 Survive Style 5+ Killer 2004 Blast Michael Kittredge 2005 Slipstream Winston Briggs 2005 Submerged Henry 2005 Hollywood Flies Sean 2005 Mysterious Island Bob TV film 2006 The Number One Girl Dragos Molnar 2006 Johnny Was Johnny Doyle 2006 She's the Man Coach Dinklage 2006 The Other Half Trainer 2006 Played Detective Brice 2006 X-Men: The Last Stand Cain Marko / Juggernaut 2006 Garfield: A Tail of Two Kitties Rommel Voice role 2007 The Condemned Ewan McStarley 2007 7–10 Split Roddy Nightengale 2007 The Riddle Mike Sullivan 2007 Strength and Honour 'Smasher' O'Driscoll AoFIFF - Best Supporting Actor (see awards) 2007 Tooth & Nail Mongrel 2008 Hell Ride Billy 'Wings' 2008 Loaded Mr. Black 2008 The Midnight Meat Train Mahogany 2 Noms - Best Supporting Actor (see awards) 2009 (Untitled) Ray Barko 2009 Year One Sargon 2009 Assault of Darkness Mr. Hunter 2009 The Heavy Edgar Dunn 2009 The Ballad of G.I. Joe Destro 2009 The Bleeding Cain 2010 Smokin' Aces 2: Assassins' Ball Finbar 'The Surgeon' McTeague 2010 Locked Down Anton Vargas 2010 Inversion Doug 2011 Kill the Irishman Keith Ritson 2011 Age of the Dragons Stubbs 2011 You May Not Kiss the Bride Brick 2011 The Liquidator Killer 2011 Blood Out Zed 2011 Cross Gunnar 2011 Not Another Not Another Movie Nancy Longbottom 2012 Madagascar 3: Europe's Most Wanted Freddie 'The Dog' Voice role 2012 Hijacked Joe Ballard 2012 Freelancers Sully 2012 The Diamond Heist Jack Varga 2012 Fire with Fire Boyd 2013 Company of Heroes Brent Willoughby 2013 Fractured Quincy 2013 Armed Response Tillinghast 2013 Escape Plan Drake 2013 Extraction Ivan Rudovsky 2013 Ambushed Vincent Camastra 2013 Blood of Redemption Campbell 2014 Redirected Golden Pole 2014 A Certain Justice Bennett 2014 Way of the Wicked John Eliott 2014 Beyond Justice Vincent De La Cruz 2014 Reaper Rob 2014 Gutshot Straight Carl 2014 The Calculator Yust Van Borg 2015 The Enforcer Renner 2015 Left to Die Sarge 2015 Mercenary: Absolution The Boss 2015 Rivers 9 Ray Kaplan 2015 Checkmate Lu 2015 6 Ways to Die John Doe 2015 Gridlocked Ryker 2015 Bite John 'Big John' 2016 2016 Kill Kane Ray Brookes 2016 Decommissioned Michael Price 2016 The Midnight Man Pearl 2017 Cross Wars Gunnar 2019 The Gandhi Murder Sir Norman Smith 2019 Madness in the Method Vinnie 2019 Cross: Rise of the Villains Gunnar 2020 Ron Hopper's Misfortune Ron Hopper 2020 I Am Vengeance: Retaliation Sean Teague 2020 The Big Ugly Neelyn 2021 Rise of the Footsoldier Origins Bernard O'Mahoney 2021 The Bezonians Willard Greb 2022 Bullet Proof Temple TBA Overtown Cutty Delayed TBA Hypnotized Completed TBA Cross 4 Gunnar Filming ===Television=== Year Title Role Notes 1993 Sean's Show Himself Episode: \"Great Socks\" 2003 Top Gear Himself Series 2, Episode 1, “Star in a Reasonably Priced Car” segment 2005 Extras Himself Episode: \"Ross Kemp & Vinnie Jones\" 2010 Chuck Karl Stromberg Episode: \"Chuck Versus the Three Words\" 2011 The Cape Dominic Raoul / Scales 6 episodes 2013 Elementary Colonel Sebastian Moran 2 episodes 2014 Psych Ronnie Ives Episode: \"Lock, Stock, Some Smoking Barrels and Burton Guster's Goblet of Fire\" 2014 The Musketeers Martin Labarge Episode: \"The Challenge\" 2014 Mind Games Isaac Vincent 2 episodes 2015–2018 Arrow Danny 'Brick' Brickwell 9 episodes 2015–2016 Galavant Gareth All 18 episodes 2015 Police Interceptors Himself 2016 MacGyver John Kendrick The Rising (MacGyver) 2018 Deception Gunter Gastafsen All 13 episodes 2019 NCIS Los Angeles Rick Dorsey Episode: \"A Bloody Brilliant Plan\" 2020 Harry's Heroes Himself 1 episode 2021 Law & Order: Organized Crime Albi Briscu 8 episodes 2023 Tracked Himself TBA The Gentlemen Geoff Seacombe Main cast; Filming ===Music videos=== *Westlife - “Bop Bop Baby” (2002) ** As Duke Vincent, the vilest man in the kingdom for money. The band members serve as Musketeers who are imprisoned in a dungeon by the Duke. *Steve Aoki & LOOPERS - \"Pika Pika\" (2018) **Originally filmed for Steve Aoki & Knife Party - \"Piledriver\", but the original video was unreleased and the footage was re-edited and reused ==Discography== ===Studio albums=== * 2002: Respect ===Singles=== * \"Wooly Bully\" (1993) ==Awards and nominations== Year Awards Category Nominated work Result Ref. 1999 4th Empire Awards Empire Award for Best Newcomer Lock, Stock and Two Smoking Barrels 2001 6th Empire Awards Empire Award for Best British Actor Snatch 2008 Action on Film International Film Festival, USA Best Supporting Actor Strength and Honour Fright Meter Awards The Midnight Meat Train 2009 Fangoria Chainsaw Awards 2020 UK Film Festival Outstanding Achievement - Best Actor The Big Ugly British Film Festival Best Stunt Performing Actors (shared) I Am Vengeance: Retaliation 2021 Lonely Wolf: London International Film Festival Outstanding Performance by an Actor in a Leading Role The Big Ugly Best Supporting Actor of the Year The Bezonians == References == Category:1965 births Category:Living people Category:Celebrity Big Brother contestants Category:English footballers Category:English movie actors Category:English television actors Category:Premier League players Category:Chelsea F.C. players Category:Leeds United F.C. players Category:Queens Park Rangers F.C. players Category:Sheffield United F.C. players Category:Conservative Party (UK) people Category:Actors from Hertfordshire Category:Musicians from Hertfordshire Category:Sportspeople from Hertfordshire Category:People from Watford",
 "title": "Vinnie Jones"
}