{
 "id": "134112",
 "text": "A Belly dance is an oriental dance, which is mostly performed by women. In the Arabic language, it is called raqs sharqi, which means \"oriental dance\". It is also called oriental dance. Performers usually use oriental-style music. They usually wear clothing that leaves the bellly free. The dance originated in Egypt. The dance has movements of the hips and torso. It is also called Middle Eastern dance or Arabic dance. There are many different forms depending on the country and region, both in costume and dance style.The styles and costumes of Egypt are the most recognized worldwide due to Egyptian cinema. Belly dancing in its various forms and styles is popular across the globe where it is taught by many schools of dance. Many boys and girls in countries where belly dancing is popular will learn how to do it when they are young. The dance involves movement of many different parts of the body; usually in a circular way. The term \"Belly dance\" is translated from the French language \"danse du ventre\". However, this dance is done by every part of the body. The most featured body part usually is the hips. Belly dancing is very different depending on country and region, both in costume and dance style. == History== Belly dancing came from the dances performed in the Middle East and North Africa. One theory is that belly dance may have come from Arabia, a dance when the pagan Arabs were worshipping a goddess before the rise of Islam. A third theory is that belly dance was always danced just for entertainment. Another theory is that belly dance was originally danced by women for women in the Levant, and North Africa.witnessed by the bellydancer Morocco in 1961, and described in her article \"Bellydancing and Childbirth\" The courtly pleasures of the Muslim Umayyad and Abbasid caliphs included belly dancing, soirée, and singing. Belly dancers and singers were sent from all parts of the vast Arab Empire to entertain. == Controversy == There have been restrictions on belly dancing in the past. At times, the dance was even outlawed. This is especially the case for countries where reigion plays an important role in society. In these countries, there are religious leaders who have a critical view on traditions that show body parts with little clothing. In most cases, this affects women. Often, there are discussins about such dances. Usually, the dances and dancers are taken as an exanple to show the decay of moral values in society. As a reaction to this, new forms of such dances developed. In these new forms, dancers are male. One of these dances is called Köcek In 2006, Hamas outlawed bellydancing. == References == Category:Dances",
 "title": "Belly dance"
}