{
 "id": "134290",
 "text": "Steely Dan is an American jazz rock band. The band was made by Donald Fagen and Walter Becker while they were students at Bard College in Annandale-on- Hudson, New York. They were active from 1971 to 1981. They reunited in 1993 to play their music live at concerts. Seven studio albums were released from 1972 to 1980 and two more were released from 2003 to 2006 after a 23 year break. The band has sold more than 40 million albums across the world and was added to the Rock and Roll Hall of Fame in March 2001. Walter Becker died on September 3, 2017. == History == === Formation and early years (1967-1972) === Becker and Fagen met in 1967 at Bard College. Fagen heard Becker practicing his electric guitar in a café, The Red Balloon, which Fagen liked and he asked Becker to join a band with him. They discovered that they enjoyed similar music and started writing songs together. They began playing locally, mostly covers of popular music but also some songs which they wrote. The two moved to Brooklyn together after Fagen graduated. Kenny Vance found their music interesting which lead to them working on the soundtrack of a low-budget film for him. This was only for money. Several songs, some of which were later used on official albums, from this time are available through multiple unauthorized collections. The band saw little success during this period. === Can't Buy a Thrill, Countdown To Ecstasy, and Pretzel Logic (1972-1974) === The band's first three studio albums were a resounding success and sold more than 2.5 million albums together. Countdown to Ecstasy preformed worse than the other two. This was because, according to Becker and Fagen, it was recorded while on tour. The singles Do It Again, Reelin' in the Years (both from Can't Buy a Thrill), and Rikki Don't Loose That Number (from Pretzel Logic) were hits. During this time, Becker and Fagen wanted to spend their time in the studio while other members wanted to continue touring. Due to this, members began to leave the band until only Becker and Fagen remained. From this point the 'band' consisted of only Becker and Fagen as constants and used many session musicians. === Katy Lied, The Royal Scam, and Aja (1975-1978) === Katy Lied was a commercial success but both Becker and Fagen hated the album due to perceived poor audio quality. The Royal Scam and Aja are both 'platinum' and Aja is the band's highest charting album. A documentary was released of Aja's production. During this time, the band produced an original song, FM (No Static at All), for the film FM; the song succeeded while the movie itself failed badly. === Gaucho and breakup (1978-1981) === The duo did not write songs for most of 1978 but returned to begin Gaucho. The album faced many challenges in production. These include: an important track, \"The Second Arrangement\", being erased; MCA Records preventing Steely Dan from changing labels; Becker being sued for $17 million and negative attention following; Becker being hit and injured by a taxi; and the band being sued by Keith Jarret for copyright violation. Despite these things, the album released in 1980 to major success, also being 'platinum'. === Break (1981-1993) === After the release of Gaucho, the band disbanded in June 1981 and remained apart until 1993. Fagen continued to make music, releasing The Nightfly in 1981 to great success. Becker moved to Maui, Hawaii and did some work as a producer on other's albums. Both preformed on Zazu, a 1986 album by Rosie Vela and produced by Steely Dan's former producer Gary Katz. In 1993, Becker produced Fagen's second solo album, Kamakiriad. === Reunion, Alive in America (1993-2000) === In 1993 Becker and Fagen reunited to tour and promote Fagen's Kamakiriad. Their touring band was much larger than their typical studio band. MCA released Citizen Steely Dan in 1994, a compilation containing the band's entire album discography and some non-album singles, a demo of \"Everyone's Gone to the Movies\", and a live recording of \"Bodhisattva\". The same year, Becker released his first solo album, 11 Tracks of Whack. In 1995, Alive in America was released, a compilation of live songs. They toured in the United States, Europe, and Japan during this time. === Two Against Nature and Everything Must Go (2000-2003) === The band released their first studio album in twenty years, Two Against Nature, in 2000. Also in this year, the band released the non-studio album Plush TV Jazz-Rock Party. This album was the first by Steely Dan to win the Grammy's Album of the Year award. Notably, Everything Must Go featured less session musicians than the band normally would and the song \"Slang of Ages\" had Becker singing for the first time on a Steely Dan studio album. === Touring (2003-2017) === For this time, the band released no new music and toured exclusively. Becker and Fagen both released solo music (Circus Monkey, Morph the Cat and Sunken Condos respectively). Becker preformed his last show in May 27, 2017 before his death. === After Becker's death (2017-present) === After the death of founding member and half of the band Walter Becker, Fagen continued to tour in order to \"keep the music we [Walter and Fagen] created together alive as long as I [Fagen] can with the Steely Dan band.\" Fagen completed promised shows after Becker's death and continues to tour with the Steely Dan name. ==Discography== === Studio albums === * Can't Buy a Thrill (1972) * Countdown to Ecstasy (1973) * Pretzel Logic (1974) * Katy Lied (1975) * The Royal Scam (1976) * Aja (1977) * Gaucho (1980) * Two Against Nature (2000) * Everything Must Go (2003) === Live albums and compilations === * Citizen Steely Dan (1994) * Alive in America (1995) * Plush TV Jazz-Rock Party (2000) Category:American rock bands Category:Jazz bands Category:Pop rock bands Category:Musical groups from New York (state)",
 "title": "Steely Dan"
}