{
 "id": "13422",
 "text": "The vice president of the United States (VPOTUS) is the second highest executive officer of the U.S. federal government after the president of the United States. The vice president ranks first in the presidential line of succession and is also the officer of the legislative branch, president of the Senate and the presiding officer of the Senate. JD Vance is the 50th and current vice president of the United States, in office since January 20, 2025. == Constitutional roles and duties == === President of the United States Senate === Article I, Section 3, Clause 4, gives the vice president the title President of the Senate, authorizing the vice president to preside over the Senate. The vice president is responsible for maintaining order, allowing members to speak, and explain the Senate's rules and practices. This position also has the authority to cast a tie-breaking vote. === Presiding over impeachment trials === As the president of the Senate, the vice president may preside over impeachment trials, although the Constitution does not specifically require it. When the president is on trial, the constitution requires that the chief justice of the United States must preside. No vice president has ever been impeached. === Presiding over electoral vote counts === The Twelfth Amendment allows the vice president, as the president of the Senate, receive the Electoral College votes and opens the sealed votes. The votes are counted during a joint session of Congress every four years on January 6.24 Stat. 373 (Feb. 3, 1887). === Presidential advisor === Lyndon B. Johnson, vice president under John F. Kennedy, helped Kennedy navigate complex legislative issues, especially civil rights. Johnson’s influence, with his decades of experience of the Senate, helped push through important legislation, including the Civil Rights Act of 1964. George H. W. Bush, vice president under Ronald Reagan, worked closely with Reagan, especially in foreign policy, and was often trusted to handle sensitive international relations, like the relationship with China and the Soviet Union. Al Gore, vice president under Bill Clinton, served as a key advisor to President Clinton on environmental issues, particularly on climate change. Additionally, Gore represented the U.S. abroad, attending international summits and strengthening diplomatic ties, during the Clinton administration's focus on global environmental policy. Dick Cheney, vice president under George W. Bush, was one of the most powerful vice presidents in U.S. history. He was a close advisor to President Bush, particularly in shaping foreign policy. Cheney played a crucial role in the decision-making process before the Iraq War, where he was seen as a strong influence on Bush's policies, especially regarding national security and defense. Joe Biden, vice president under Barack Obama, was deeply involved in the administration's policy discussions. He played a key role in foreign affairs and domestic policy, especially during the economic recovery following the 2008 financial crisis. His decades of experience in the Senate made him an important advisor, especially on matters of legislative strategy and foreign relations. Kamala Harris, vice president under Joe Biden, played a key role in advising Biden, especially in areas like social policy, racial equity, and health care. Her experience as a senator and attorney general has made her a crucial advisor on legal and policy matters. Additionally, she played a central role in helping Biden connect with diverse voters during the 2020 election. === Diplomatic representation === The vice president frequently represents the U.S. in diplomatic meetings with foreign leaders. In some cases, they act as a direct representative of the president, displaying U.S. policies, strengthening relationships, and advancing the country’s interests abroad. Joe Biden played a key role in strengthening U.S.-European Union relations during his trips to Europe, especially concerning economic issues and NATO. Vice presidents often meet with foreign officials to discuss mutual concerns and strengthen diplomatic ties. They may sign agreements, attend ceremonial events, or offer speeches aimed at boosting international relations. Kamala Harris traveled to Southeast Asia in 2021 to reaffirm U.S. commitment to the region, meet with leaders in Vietnam and Singapore to issues like trade, security, and climate change. On foreign trips, vice presidents are tasked with promoting U.S. interests, whether economic, political, or military. They might attend trade discussions, promote American business and culture, or engage in multilateral talks. Dick Cheney traveled extensively to strengthen U.S. allies in the Middle East and Europe during the Iraq War. Vice presidents sometimes visit U.S. military personnel deployed overseas to boost and offer support. Lyndon B. Johnson visited U.S. troops during the Cold War to offer support and assess the situation. One of the vice president’s primary roles on a foreign trip is to build and maintain relationships with foreign leaders. This can include private meetings, public speeches or participating in official ceremonies. Joe Biden traveled to Ukraine in 2011 to strengthen relations and offer support for democratic reforms. === Congressional liaison === The vice president is seen as an important liaison between the presidential administration and Congress. Joe Biden worked closely with Congress to pass major laws like the Affordable Care Act and economic recovery plans. Walter Mondale helped push important policies, such as creating the U.S. Department of Education and energy laws by working with Congress. === National Security Council member === Since 1949, the vice president has legally been a member of the National Security Council. The vice president is first in line to become president if the sitting president dies resigns, or becomes incapacitated, the vice president must stay well-informed about national security issues. The vice president often acts as a close advisor to the president. The NSC allows them to participate in discussions and decisions about the country's defense, intelligence, and foreign policy, which are critical to national security. The vice president has the opportunity to influence decisions on military strategy, foreign policy, and other national security concerns. == Eligibility and requirements == Article II, Section 1, Clause 5 of the constitution states for a person to serve as vice president must: * be a natural-born citizen of the United States. * be at least thirty-five years old. * be a permanent resident in the United States for at least fourteen years. == Election process == The vice president is elected by the people through the Electoral College to a four- year term, along with the presidential candidate or the incumbent president as their running mate. The presidential candidate or incumbent president must have at least 270 electoral college votes in order to win the election. == Vice President-elect of the United States == The vice president-elect of the United States is the candidate who has won the United States presidential election along with the presidential candidate and is awaiting inauguration to become the vice president. == Inauguration == The president elect, vice president-elect, or incumbent president and vice president immediately began their four-year team on inauguration day every four years on January 20. The original inauguration date was held on March 4, but was later changed in 1933. == Presidential line of succession == The vice president ranks first in the presidential line of succession, if the president dies, resigns, or is impeached. Only eight vice presidents have succeeded the president in resignation or death such as John Tyler, Millard Fillmore, Andrew Johnson, Chester A. Arthur, Theodore Roosevelt, Calvin Coolidge, Harry S. Truman, Lyndon B. Johnson and Gerald Ford. The speaker of the House ranks second in the presidential line of succession if the vice president dies, resigns or is impeached from office. John C. Calhoun and Spiro Agnew are the only U.S. vice presidents to have resigned from office. == Office of the Vice President == The Office of the Vice President includes personnel staff who directly support or advise the vice president of the United States. The main office is in the Eisenhower Executive Office Building. There are also offices for the vice president in the West Wing of the White House, United States Capitol, and in the vice president's residence. == Travel and Transportation == == Residence == Number One Observatory Circle is the official residence of the vice president and the second family of the United States. It has been the official residence of every U.S. vice president since Nelson Rockefeller in 1974. == Protection == The United States Secret Service is in charge of protecting the vice president and the second family at all times. As part of their protection, the vice president, second spouse and immediate family members are given Secret Service codenames. The use of codenames are used due to security and safety reasons. ==List of living former vice presidents== There are six current living former vice presidents. == References == Category:Federal government of the United States",
 "title": "Vice President of the United States"
}