{
 "id": "134312",
 "text": "The Church of Scotland is the national church of Scotland, established by law. It is Presbyterian. The Presbyterian Church of Scotland is distinguished from the Anglican Church in a number of ways. It does not have bishops or archbishops; nor is the British monarch its head. The leading minister is called the Moderator, who is the chair of the General Assembly for one year. Ministers of the Kirk, as it is called, may be called Rectors. The established kirk has suffered schism (breaks), and this has given rise to the \"Wee Frees\": the Free Church of Scotland, and (a further schism) the Free Church of Scotland (continuing) (the Wee Wee Frees); and the Free Presbyterian Church of Scotland (also, confusingly, called the Wee Wee Frees). The Scottish Presbyterian church was formed when it broke away from Rome in 1560. Its theology (beliefs) were based on the ideas of John Knox, a disciple of John Calvin. The free kirks tend to take the Bible more literally. About 10% of the people in Scotland are members of this church, but when asked in a census, 47% of people said this was their religion. In 2023 there were around 4500 churches in Scotland, but fewer people going to services, so there were plans to save money by closing many of them. ==God's Invitation== In 1992, the Kirk's ruling body (the General Assembly) approved the following simple summary of its beliefs. God's Invitation :God made the world :: and all its creatures :: with men and women made in His image. :By breaking His laws people have broken contact with God, :: and damaged His good world. :: This we see and sense in the world and in ourselves. :The Bible tells us the Good News that God still loves us :: and has shown His love uniquely in His Son, Jesus Christ. :: He lived among us :: and died on the cross to save us from our sin. :: But God raised Him from the dead! :In His love, this living Jesus invites us :: to turn from our sins :: and enter by faith into a restored relationship with God :: Who gives true life before and beyond death. :Then, with the power of the Holy Spirit remaking us like Jesus, :: we – with all Christians – :: worship God, :: enjoy His friendship :: and are available for Him to use :: in sharing and showing :: His love, justice, and peace :: locally and globally :: until Jesus returns! :In Jesus’ name :: we gladly share with you God's message for all people – :: You matter to God! ==References== Category:Presbyterianism Category:Establishments in Scotland Category:1560s establishments in Europe Category:16th century in Scotland",
 "title": "Church of Scotland"
}