{
 "id": "134585",
 "text": "Crich Tramway Village is an open-air museum of trams and tramways, in Crich, (), Derbyshire, England. It is the home of the National Tramway Museum. It is set up as an Edwardian village and has a street with shops which include a sweet shop, café and gift shop. Other buildings in the open-air museum are the Red Lion Pub from Stoke-on-Trent, Derby Assembly Rooms, Burnley Tramways Offices and the tram sheds and displays. There are tram lines which go out for about from the village. There is also a collection of old street furniture from around the United Kingdom. The trams that are in the museum used to run on tramlines along the streets of different towns and cities. Most of the trams at Crich were used in the United Kingdom before the 1960s. Some are from other countries. Many were saved and restored after the tram services in the cities stopped. ==History of the museum== Before World War II, tramways were an important type of public transport in many cities in the United Kingdom. (Trams pulled by horses began to be built in the late 19th century.) After World War II, they began to close. Many people thought that the trams and tramways got in the way of motor cars and buses and that fuel for buses was costing less than the cost of making electricity. Most tram networks in the United Kingdom had closed by 1962. Only one remained in use, the Blackpool tramway which still runs today. In 1948, a group of tramway enthusiasts decided to buy an open top tram that they had been on during the last tram ride of Southampton Tramways. For just £10, they bought Southampton No. 45, Although there were trams and locomotives in British museums, there were no working museums or heritage railways in Britain at this time, so at first the idea of amateurs running a tramway or railway seemed impossible. In 1955 the Tramway Museum Society was started and in 1959, the Society chose a place for the museum after a very long search. The site was found by the Talyllyn Railway Preservation Society when they were taking apart the old track from George Stephenson's railway for a project in Wales. In the 1840s, when Stephenson was building the North Midland Railway from Derby to Rotherham and Leeds, he found coal buried under the ground on the way to Clay Cross. He decided to mine it and make some money. Crich already had a limestone quarry when he started. Stephenson saw that he could use this limestone and coal to make burnt lime for agricultural use and then use his railway to move it. To link the quarry at Crich to the limekilns at Ambergate, a new metre gauge railway was built, which is said to be the first in the world. The museum is built on part of the old Cliff Quarry, which Stephenson's company bought. After the Tramway Museum Society's members visited the quarry, they bought part of the site and buildings. Since buying them, the society has gotten many trams, as well as getting track and power for the trams. Many of the tramcars were also repaired. In 1967, the society decided that they would start a village around the tramway, as trams did not run in limestone quarries. This was the start of Crich Tramway Village. The museum got lots of street furniture, and even some entire buildings. Many of these buildings have been changed to hold the museum's collections of books, pictures, and archives. In 1962 the Tramway Museum Society became a company and a year later it was listed as an educational charity. Since then, the society has grown with the help of people all over the world. The Secretary of State for Culture, Media and Sport said that the museum has a very good collection. It was one of the first 26 museums that was told this in 1995. Since the start of the 2000s, the work of the museum's volunteers and the income earned by visitors has been added to by grants from the Heritage Lottery Fund The museum is still an independent charity; this means that the government does not pay for it. In the early 1990s, the government of the United Kingdom decided that trams were a way of stopping the traffic problems in the UK. New light rail systems, or \"second generation tramways\", opened in cities like Manchester, Sheffield and Nottingham. Twenty years later more systems are being built, like the one in Edinburgh. ==Timeline== * 1948 - Southampton 45 is bought for £10, which starts British tramway preservation. * 1955 - The Tramway Museum Society (TMS) is formed. * 1959 - Crich is chosen as the place to house the National Tramway Museum. * 1960 - The museum's first tram shed opens on the site of the current Workshop Galleries. * 1963 - The first tram is run with \"Bonny\" the horse and Sheffield 15. * 1964 - The first electric tramcar service operates with Blackpool & Fleetwood 2, Glasgow 22, Blackpool 40, Blackpool & Fleetwood 40, Southampton 45, Blackpool 49, Blackpool 59, Sheffield 510 and Grimsby and Immingham 20 (now called Gateshead 5). * 1968 - The new tracks to Wakebridge open. The museum has its first \"Grand Transport Extravaganza\", a celebration. Prague 180 arrives during the celebration. * 1969 - The museum's purpose-built workshops open. * 1971 - The museum has its first full-time paid workers. * 1978 - Leicester 76 starts running at the museum. It is the first tramcar to be restored. * 1975 - The Duke of Gloucester becomes patron of the society. * 1978 - The scenic tramway to Glory Mine is opened. The electrical substation at Wakebridge is also opened. * 1982 - The first part of the museum library is opened. * 1983 - London County Council Tramways 106 starts running. * 1985 - The museum loans trams to Blackpool for their electric tram centenary. Blackpool Corporation loans Blackpool Boat 607 and Blackpool Balloon 710 to the museum. * 1988 - The museum loans trams for the Glasgow Garden Festival. * 1989 - MET 331 starts running, but it is called Sunderland 100. * 1990 - The museum loans trams for the Gateshead Garden Festival. Leeds 399 enters service. * 1991 - The exhibition hall, a large room that is used to display trams, is opened. * 1992 - The Bowes-Lyon Bridge is opened by the Secretary of State for Transport. The Exhibition Hall is re-opened with newly completed 'Tram at Night' scene and other displays. * 1993 - Liverpool 869 started running. Leamington & Warwick 1 arrives at the museum. * 1994 - Den Haag 1147 arrives (a Dutch tram). * 1995 - Sheffield 74 starts running. Oporto 273 and the Brill snow broom arrive. The President's Conference Committee (PCC) exhibition opens. * 1996 - Berlin 3006 arrives. * 1997 - The first specially converted \"AccessTram\", in the form of Berlin 3006, started running to let less able visitors have a ride on the line at the museum. Chesterfied 7 and London 1622 started running. * 1998 - The museum lends Blackpool & Fleetwood 2 and Blackpool 167 to Blackpool for the Fleetwood Tramroad centenary. * 2001 - Oporto 273 started running. It was restored with money from a Heritage Lottery Fund (HLF) grant. * 2002 - The workshop viewing gallery, workshop extension and Red Lion pub open. * 2003 - The library reading room and Archives Store is opened by the Duke of Gloucester. * 2004 - The woodland walk and sculpture trail is opened by the Duchess of Devonshire. * 2005 - The TMS is fifty years old, and there are several special events to celebrate it. Halle 902 arrives (a German tram). * 2008 - The museum receives a HLF grant for £900,000 to restore the Stone Workshop (pictured right) and turn it into an exhibition and education centre. * 2009 - Cardiff 131 started running. The Museum held three special events for their 50th Anniversary. They are known as \"Crich50\". The Museum's patron visits the museum and makes a speech from the platform of Cardiff 131. * 2010 - London Tramlink donated two old works vehicles to the museum. Blackpool Transport announced that it will donate six trams to the museum between 2010 and 2015. They are Balloon 712, Boat 607, Brush 630, Twin Set 672+682, Centenary 648 and Jubilee 762. The first to arrive was Balloon 712, on 27 March. The museum loaned three tramcars to the Blackpool tramway for its 125@th Anniversary Celebrations. These were Blackpool & Fleetwood 'Rack' 2, Blackpool Corporation 'Pantograph' 167 and Oporto 273. * 2011 - The Museum announced that it had turned down the offer of Centenary 648 and Twin Set 672+682 from Blackpool due to a lack of space to store the trams. Jubilee 762 became the second Blackpool tram to arrive at the Museum on 7 November, and Brush 630 was the third to arrive on 22 December. The tram was repainted before it left Blackpool. * 2025 - Birkenhead 20, Liverpool 762 and Wallasey 7 arrive at the Museum from the Merseyside Tramway Preservation Society (MTPS). ==Tramcar fleet== The museum has over 60 tramcars from places such as Berlin, Blackpool, Chesterfield, Den Haag, Derby, Douglas, Dundee, Edinburgh, Gateshead, Glasgow, Grimsby, Halle, Howth, Johannesburg, Leeds, Leicester, Liverpool, London, New York, Newcastle-upon-Tyne, Oporto, Paisley, Prague, Sheffield, Southampton and Sydney. Most of these tramcars are double-deckers and some have open-tops. The museum has about fifteen fully working tramcars. Every day that the museum is open, one to four of those trams are in service on the mile long line. Many of the trams can be seen at the museum. Some, such as Blackpool Dreadnought 59 and Blackpool OMO 5, are stored in the Museum's depot at Clay Cross. ==Methods of tramcar operation== The museum has trams using four different types of operation – horse, steam, diesel and electricity. Electricity is used for most of the service trams and works cars, but for one weekend each year a horse tram runs. The museum has five horse trams, Leamington & Warwick 1, Chesterfield 8, Oporto 9, Sheffield 15 and Cardiff 21, but only Sheffield 15 is used. The rest are on display. The museum also has a steam tram engine on display. Most systems have their overhead wire system built to operate with just one form of current collector (the part that gives the tram electricity). The museum has been built to use any of them, including trolley poles, bow collectors and pantographs. Conduit current collection is another form of current collection. Blackpool 4 uses this, and it was also used in London. ==Related pages== * Beamish Museum * Blackpool tramway * East Anglia Transport Museum * Light Rail Transit Association * Maley & Taunton * Scottish Tramway and Transport Society * Summerlee Heritage Park (Coatbridge) * The Trolleybus Museum at Sandtoft ==References== ==Other websites== * Official website * Topical pictures of the Museum * The London County Council Tramways Trust —- responsible for the restoration of London nos. 1, 106, 159, 1622 * The Tram Centre —- all sorts of information can be found here on all types of trams * Photographs and Information from Strolling Guides * Tram Travels: Crich Tramway Village Category:Tram transport in the United Kingdom Category:Open air museums Category:Museums in England Category:Buildings and structures in Derbyshire",
 "title": "Crich Tramway Village"
}