{
 "id": "134848",
 "text": "The 2005 civil unrest in France was a series of riots in October and November. Many cars and public buildings, for example schools were burnt. The riots started on October 25, 2005 in Clichy-sous-Bois, a suburb of Paris. Afterwards they spread to other parts of France. Together they lasted for about 3 weeks. The riots were a reaction to the accidental deaths of two teenage boys and the serious injuries of another. The three boys hid in a power substation and got an electric shock, after being chased by police. However the boys did not commit a crime. ==The event starting the riots== The New York Times said the event started at 17:20 on 27 October 2005 in Clichy-sous-Bois. They said they know this from a police report. The police were called to a construction site, because of a burglary. Three teenagers thought they were being chased by the police, so they climed a fence of a power substation. This was because the feared long questioning by the police. Another 6 teenagers were caught by the police for questioning by 17:50. At 18:12 at the local police station in Livry-Gargan the lights went out because of a blackout. This black-out was caused by the death of Zyed Benna and Bouna Traoré in the power station and the injury of the third boy. There is a controversy, if the boys were chased by police. The local prosecutor and Nicholas Sarkozy, who was minister of interior at that time said no. But the newspaper The Australian, who asked some of his friends, said yes. Before this event there had been in issues with unemployment and police brutality in this town. But after this event mobs of protesters gathered. The Associated Press quoted a protester with \"People are joining together to say we've had enough. We live in ghettos. Everyone lives in fear.\" ==Statistics== * Started: 17:20 on Thursday, 27 October 2005 in Clichy-sous-Bois. * Towns with riots: 274 (on November 7) * Property damage: 8,973 vehicles (Not including buildings). * Costs: Estimated at €200 million. * Arrests: 2,888 * Deaths: 1 (Jean-Jacques Le Chenadec) * Police and firefighters injured: 126 ===Statistics by night=== day Number of cars burned arrests places with riots sources 1\\. Friday October 28, 2005 NA 27 Clichy- sous-Bois 2\\. Saturday October 29, 2005 29 14 Clichy-sous-Bois https://news.yahoo.com/s/afp/20051029/wl_afp/franceriotpolice 3\\. Sunday October 30, 2005 30 19 Clichy-sous-Bois 4\\. Monday October 31, 2005 NA NA Clichy-sous-Bois, Montfermeil 5\\. Tuesday November 1, 2005 69 NA Seine- Saint-Denis 6\\. Wednesday November 2, 2005 40 NA Seine-Saint-Denis, Seine-et- Marne, Val-de-Marne Val-d’Oise, Hauts-de-Seine 7\\. Thursday November 3, 2005 315 29 Île-de-France, Dijon, Rouen, Bouches-du-Rhône Actualités en temps réel Le Nouvel Observateur 8\\. Friday November 4, 2005 596 78 Île-de-France, Dijon, Rouen, Marseille 9\\. Saturday November 5, 2005 897 253 Île-de-France, Rouen, Dijon, Marseille, Évreux, Roubaix, Tourcoing, Hem, Strasbourg, Rennes, Nantes, Nice, Toulouse, Bordeaux, Pau, Lille 10\\. Sunday November 6, 2005 1,295 312 Île-de-France, Nord, Eure, Eure-et-Loir, Haute-Garonne, Loire-Atlantique, Essonne. 11\\. Monday November 7, 2005 1,408 395 274 towns in total. Île-de- France, Hauts-de-France, Occitanie, Auvergne-Rhône-Alpes, Grand Est, Bourgogne-Franche-Comté. Actualités en temps réel Le Nouvel Observateur 12\\. Tuesday November 8, 2005 1,173 330 Paris region, Lille, Auxerre, Toulouse, Grand Est, Bourgogne-Franche-Comté 13\\. Wednesday 9 November 2005 617 280 116 towns in total. Paris region, Toulouse, Rhône, Gironde, Arras, Grasse, Dole, Bassens 14\\. Thursday November 10, 2005 482 203 Toulouse, Belfort http://today.reuters.co.uk/news/newsArticle.aspx?type=worldNews&storyID;=2005-11-10T073440Z_01_HO756911_RTRUKOC_0_UK- FRANCE-RIOTS1.xml&archived;=False 15\\. Friday November 11, 2005 463 201 Toulouse, Lille, Lyon, Strasbourg, Marseille 16\\. Saturday November 12, 2005 502 206 NA 17\\. Sunday November 13, 2005 374 212 Lyon, Toulouse, Carpentras, Dunkirk, Amiens, Grenoble 18\\. Monday November 14, 2005 284 115 Toulouse, Faches-Thumesnil, Halluin, Grenoble 19\\. Tuesday November 15, 2005 215 71 Saint-Chamond, Bourges 20\\. Wednesday November 16, 2005 163 50 Paris region, Arras, Brest, Vitry-le-François, Romans-sur-Isère TOTAL 20 nights 8,973 2,888 ==References== Category:2005 crimes Category:2005 in Europe Category:2000s crimes in Europe Category:2000s in France Category:2000s riots Category:Crime in France Category:October 2005 events Category:Riots in Europe Category:21st century in Paris Category:Politics of France",
 "title": "2005 French riots"
}