{
 "id": "134932",
 "text": "Cody Garrett Runnels Rhodes (né Runnels; born June 30, 1985) better known simply by his ring name Cody Rhodes, is an American professional wrestler and actor. He is currently signed to WWE, where he performs on the SmackDown brand and is a former Undisputed WWE Champion. He is nicknamed \"The American Nightmare\" and is one of the most popular face wrestlers today. The son of Dusty Rhodes and the half-brother of Dustin Rhodes, he is married to Brandi Rhodes. Rhodes started his wrestling career for World Wrestling Entertainment (WWE) in 2006, working there for the next ten years. During this time, he became a two-time Intercontinental Champion and a six-time tag team champion (three-time World Tag Team Champion and three-time WWE Tag Team Champion). From 2014–2016, he was known as Stardust. Rhodes was released from WWE in May 2016. After that he worked on the Independent circuit, for Ring of Honor (where he won the ROH World Championship, the ROH World Six-Man Tag Team Championship and the NWA World Heavyweight Championship, which was also won by his father), Total Nonstop Action Wrestling/Impact Wrestling and New Japan Pro-Wrestling (where he was an important member of the Bullet Club and a former IWGP United States Heavyweight Champion). On January 1, 2019, Rhodes joined the newly founded company All Elite Wrestling (AEW). There he was an executive vice president and a record-tying three-time TNT Champion (also being the first man to win the title). On February 15, 2022, he left AEW. That April he returned to WWE on the first night of WrestleMania 38, defeating Seth \"Freakin\" Rollins. He would go on to win the Undisputed WWE Tag Team Championship (his fourth Raw Tag Team Championship and his first SmackDown Tag Team Championship) and the Royal Rumble Match in 2023 and 2024, becoming the fourth wrestler to win that match twice in a row. On April 7, 2024, at night two of WrestleMania XL, Rhodes defeated Roman Reigns to win the Undisputed WWE Universal Championship. It was Rhodes' first world title in WWE and it also ended Reigns' record-setting 1,316-day reign. By winning, Rhodes also became a Triple Crown champion. == Acting career == Film Year Title Role Notes 2016 Scooby-Doo! and WWE: Curse of the Speed Demon Stardust 2017 The Jetsons & WWE: Robo-WrestleMania! 2023 American Nightmare: Becoming Cody Rhodes Himself Television Year Title Role Notes 2009 The Tonight Show with Conan O'Brien Himself Episode: \"Mike Tyson and Keith Berry\" 2010 Warehouse 13 Kurt Smoller Season 2, episode 8: \"Merge with Caution\" 2011 Food Network Challenge Himself Season 12, episode 11: \"WWE Wrestling Cakes\" 2014 Surprise Surprise Episode: \"Mothers Day Edition\" 2016–2018 Arrow Derek Sampson 7 episodes Credited as Cody Runnels 2018 WAGS Atlanta Himself 2021–2022 Go-Big Show Judge 2021 Rhodes to the Top Himself 2023 Captain Laserhawk: A Blood Dragon Remix Himself Web series Year Title Role Notes 2013–2015 The JBL and Cole/Renee Show Himself, Stardust Series regular 2015–2016 Swerved Two episodes 2016–2022 Being The Elite Himself Series regular == Championships and accomplishments == === Amateur wrestling === * Georgia State Tournament ** Sixth at weight class (2002) ** Champion at weight class (2003) ** Champion at weight class (2004) === Professional wrestling === * All Elite Wrestling ** AEW TNT Championship (3 times, first) ** AEW TNT Championship Tournament (2020) ** AEW Dynamite Award for Best Moment on the Mic (2021) – * Alpha-1 Wrestling ** A1 Tag Team Championship (1 time) – with Ethan Page * Bullet Proof Wrestling ** BPW Championship (1 time) * CBS Sports ** Promo of the Year (2019) – ** Smack Talker of the Year (2019) * ESPN ** ESPY Award – Best WWE Moment (2022) – ** Male Wrestler of the Year (2023) * Global Force Wrestling ** GFW NEX*GEN Championship (1 time) * National Wrestling Alliance ** NWA World Heavyweight Championship (1 time) * New Japan Pro-Wrestling **IWGP United States Heavyweight Championship (1 time) * New York Post ** Match of the Year (2022) – ** Promo of the Year (2023) – (February 13) * Northeast Wrestling **NEW Heavyweight Championship (1 time) * Ohio Valley Wrestling ** OVW Heavyweight Championship (1 time) ** OVW Television Championship (1 time) ** OVW Southern Tag Team Championship (2 times) – with Shawn Spears ** Fourth OVW Triple Crown Champion * Pro Wrestling Illustrated ** Match of the Year (2022) – ** Match of the Year (2019) – ** Most Improved Wrestler of the Year (2008) ** Ranked No. 6 of the top 500 singles wrestlers in the PWI 500 in 2022 ** Ranked No. 10 of the top 500 singles wrestlers in the PWI 500 in 2023 * Ring of Honor ** ROH World Championship (1 time) ** ROH World Six-Man Tag Team Championship (1 time) – with The Young Bucks ** ROH Year-End Award (2 times) *** Wrestler of the Year (2017) *** Feud of the Year (2018) – * Sports Illustrated ** Men's Wrestler of the Year (2018) ** Wrestler of the Year (2023) * What Culture Pro Wrestling ** WCPW Internet Championship (1 time) * Wrestling Observer Newsletter ** United States/Canada MVP (2023) ** Worst Gimmick (2015) * World Wrestling Entertainment/WWE ** Undisputed WWE Championship (1 time) ** WWE Intercontinental Championship (2 times) ** WWE (Raw) Tag Team Championship (4 times) – with Drew McIntyre (1), Goldust (2) and Jey Uso (1) ** WWE SmackDown Tag Team Championship (1 time) – with Jey Uso ** World Tag Team Championship (3 times) – with Hardcore Holly (1) and Ted DiBiase) (2) ** WWE Intercontinental Championship (2 times) ** Men's Royal Rumble (2023, 2024) ** WWE Tag Team Championship No. 1 Contender's Tournament (2012) – with Damien Sandow ** Slammy Award (2 times) *** Outstanding Achievement of Baby Oil Application (2010) *** Tag Team of the Year (2013) – == Footnotes == == References == == Other websites == * * Category:1985 births Category:Living people Category:All Elite Wrestling alumni Category:All Elite Wrestling executives Category:American professional wrestlers Category:People from Marietta, Georgia Category:Sportspeople from Georgia (U.S. state) Category:Total Nonstop Action Wrestling alumni Category:WWE wrestlers",
 "title": "Cody Rhodes"
}