{
 "id": "134950",
 "text": "The Flag of the United Mexican States or Mexico is a tricolor of green, white, and red with an eagle charged in the center of the white stripe, sitting on a cactus, eating a snake. While the meaning of the colors has changed over time, these three colors were adopted by Mexico following independence from Spain during the country's War of Independence. The current flag was adopted in 1968, but the design has been used since 1821. The current law of national symbols, Law on the National Arms, Flag, and Anthem, that governs the use of the national flag has been in place since 1984. Red, white, and green are the colors of the national liberation army in Mexico. The central emblem is the ancient Aztec symbol for Tenochtitlan (now Mexico City), the center of the Aztec Empire. It recalls the legend that inspired the Aztecs to settle on what was originally a lake-island. The form of the coat of arms was most recently revised in 1968. Aztec legend held that they should found their city on the spot where they saw an eagle on a cactus, eating a snake. There is a ribbon in the national colors at the bottom of the coat of arms. ==Design and symbolism== The meaning of the colors of the national flag are as follows: Name Color HEX Code Symbol Green #006847 Land White #FFFFFF Religion Red #C90016 Blood of the heroes The Mexican flag is a tricolor of green, white, and red with a national coat of arms inside the center. The ratio of the flag is 4:7. ===Other flags=== File:Flag of Mexico (reverse).svg|Reverse oficial flag. File:Bandera de Mexico uso civil.svg|Civil flag. File:Bandera de México Civil 2.svg|Flag with other tones. File:Mexican Presidential Standard.svg|Flag with gold coat of arms. == History == === Background === In the early 14th century, the Mexican people were a wandering tribe of nomads looking for a permanent settlement in modern day central Mexico. They survived by hunting and gathering and were often hired to fight as mercenaries for the city-states scattered throughout the region. According to legend, their god, Huitzilopochtli, told them to establish a city of their own at a site where they would find an eagle eating a snake on the top of a cactus. The legend relates that the people saw the eagle on a small, swampy island in the middle of the shallow mexico lake. The Mexicans invented a resourceful system of gardening, called chinampas, which allowed them to grow small gardens, eventually drying out the lake. In 1325, they completed construction of a city there. That city, which they called Tenochtitlan, became the capital of the Aztec Empire. While similar to the national flag that is used today, the eagle in these arms is not holding a serpent in his talons and a crown has been affixed to the head of the eagle to signify the Empire. Variants of this flag that appeared in this period also included a naval flag that had the tricolor pattern, but it only contained the eagle with the crown above its head. The military also used a similar square flag, but the eagle was larger than the one on the national flag. The national flag was officially decreed by Agustín de Iturbide in November 1821 and first officially used in July 1822. This flag was no longer used upon the abolishment of the empire. ===First flag=== The first national flag was established in 1821, the first year of Mexican recognized sovereignty. The imperial government that was set up chose a tricolor flag of green, white, and red and charged with the national coat of arms. The official decree stated that The second national flag was adopted after the establishment of the first federal republic in 1823. The new flag was chosen for the republic in April of that year, the only difference being the appearance of the central emblem. The crown was removed from the eagle's head and a serpent was placed in the eagle's right talon. Another addition to the flag is a branch of oak and laurel branches, a tradition that was carried over to the current flag. This flag was discontinued in 1864 upon the dissolution of the first federal republic. The third national flag was that of the Second Mexican Empire. Once again, the national flag used the green, white, and red tricolor pattern with the white stripe charged with the national arms. However, the ratio of the flag was changed from 4:7 to 1:2 and four eagles, which had crowns above their heads, were placed at each corner of the flag. The design, which was ordered by the Emperor Maximilian, gave the arms a look similar to the French Imperial arms, but he decided to add a bit of \"Mexican flavor\" to the flag. The current national flag was adopted on September 16, 1968, and was confirmed by law on February 24, 1984. The current version is an adaptation of the design approved by presidential decree in 1916 by Venustiano Carranza, where the eagle was changed from a front-facing to a side-facing position. Before adopting the current national flag, the government used official flags. All of these flags used the tricolor pattern, with the only difference being the changes in the coat of arms, which was still charged in the center of the white stripe. One possible reason for the 1968 flag and arms change was that Mexico City was the host of the 1968 Summer Olympic Games.Page 45 of Adventure Guides Mexico's Pacific Coast by Vivien Lougheed, Hunter Publishing, Around this same period, the plain tricolor flag that Mexico used as its merchant ensign was also legally abandoned. The reasoning is that without the coat of arms, the flag would become nearly identical to the Italian flag.Flags of the World page \"Mexico – Flag without arms\" (Archive page) There was also debate in 1984 about how the coat of arms would be depicted on the reverse of the flag. To solve this problem, a PAN deputy proposed a change to the Law of the National Arms, Flag, and Anthem that same year to allow for the eagle to face to the right when the reverse of the flag is displayed.Flags of the World page \"El reverso de la bandera de México y su simbolismo en la lucha por la independencia\" ==Protocol== There are two variants of the national flag that are mostly used by the state and federal governments, the difference between the national flag and the variants are the designs of the coat of arms. In the first variant, which is used by the President of Mexico and secretaries of federal bodies, the entire coat of arms is coloured gold, with the exception of the tricolour ribbon, which is green, white and red, and with the stone, lake and talons of the eagle coloured in silver. In the second variant, the entire coat of arms is coloured gold, even the ribbon, lake, stone and talons. The second variant is used mostly by the state governments and federal bodies who are not able to use the first variant.Flags of the World page \"Mexico – Coat of arms\" Mexico's first largest monumental flag was the one located at the Mirador del Obispado in Monterrey (northeast) with a pole of and in height. The flag measures and weighs , four times the size of most other monumental flags at the time. It is located at the top of the Cerro del Obispado (Bishopric Hill) at an altitude of above the sea level (city's altitude ).Secretariat of Interior article ===Variants=== File:Bandera Presidencial Mexico-comandante supremo.svg|Army flag from president. File:Bandera Presidencial Mexico-comandante supremo buques.svg|Suprsupreme commander flag from shipping. File:Naval jack of Mexico.svg|Naval jack from Mexico. ==International presence== Mexican flag is an United Nations members' national flags in New York City. ===Variants=== File:Seal of Texas (reverse).svg|Flag of Texas. ==Related pages== * Mexico * List of Mexican flags * Mexican coat of arms * Himno Nacional Mexicano == References == == Other websites == * The Flag of Mexico * * Presidency of Mexico – National Symbols * Artes e historia – Bandera de Mexico * Las Banderas de México A Través de Su Historia (Especial: Día de la Bandera) Mexico Category:National symbols of Mexico Category:Flags with green, red and white Category:Flags with coats of arms",
 "title": "Flag of Mexico"
}