{
 "id": "134998",
 "text": "Field Marshal Douglas Haig, 1st Earl Haig KT GCB OM GCVO KCIE ADC (born in Edinburgh, Scotland on 19 June 1861, died in London on 29 January 1928) was a British Army general in World War I. He was the senior commander of the British forces in France from 1915 until the end of the war. Most notably, he led them during the Battle of the Somme, the Third Battle of Ypres (Passchendaele), the Spring Offensive and the final Hundred Days Offensive. Historians have often argued over whether Haig was a good general. In the years after the war, he was popular. After his death, some historians and politicians wrote books criticising Haig. They argued he made mistakes that led to a lot of casualties among British troops, especially at the Somme and Passchendaele; he has been nicknamed 'Butcher Haig' or 'the Butcher of the Somme'. David Lloyd George, the Prime Minister during the later years of the war, also did not agree with Haig.Travers, Tim 1987. The killing ground: the British Army, the Western Front and the emergence of modern war 1900–1918. Allen & Unwin, London. One of the best known books criticising Haig was Alan Clark's book The Donkeys (1961). This is known as the 'lions led by donkeys' view: the idea that Britain had great soldiers but bad generals.Corrigan 2002, p213. All the same, some veterans, and academic historians have argued that Haig was a great general.Todman D. 2005 The Great War: myth and memory. London. pp73–120 For example, John Bourne notes that Haig helped the army use new weapons and technology.Bond 2009, p. 4. John Terraine argues that while the British Army lost a lot of men, this is not surprising given the size of the fighting, and other countries lost far more.Terraine 1980, p. 45 Likewise, Gordon Corrigan argues that as a percentage of the population, Britain lost half as many people in the war as France and Germany.Corrigan 2002, p. 55. == References == Category:1861 births Category:1928 deaths Category:British Army generals Category:People from Edinburgh Category:Knights Grand Cross of the Order of the Bath Category:Knights of the Thistle Category:Order of Merit Category:Knights Grand Cross of the Royal Victorian Order Category:Knights Commander of the Order of the Indian Empire",
 "title": "Douglas Haig, 1st Earl Haig"
}