{
 "id": "13520",
 "text": "A diagnosis (ancient Greek: δια-γνωστικος) is when a doctor finds out what makes someone sick. ==Overview== Sometimes, doctors can diagnose a sickness by asking the patient questions and looking at the patient's body. Sometimes, doctors do tests. Tests can mean taking a small bit of blood, urine or tissue which is sent to a hospital laboratory where it is tested. X-rays are another form of test.Tests are ways to see how the body is working. When a diagnosis has been made, the doctor may recommend treatments. ==Process== Diagnosis starts with the patient's examination in a medical institution or during a call to the doctor at the patient's place of residence. Diagnosis of the disease begins with the collection of medical history. After collecting the anamnesis, the doctor examines the patient, where the doctor performs percussion and auscultation of the patient, palpation of the disease, measures the patient's blood pressure, heart rate and respiration rate, which measures the patient's body temperature. ===Laboratory examinations=== Laboratory examination methods feature general clinical tests, including a blood test, urine test and, stool test. Laboratory methods of examination also include biochemical methods of examination, during which the levels of glucose, urea, bilirubin, creatinine, liver enzymes, blood lipids are determined; coagulogram, which analyzes the indicators of blood clotting, blood hormone tests; determination of tumor markers; tests of blood and body tissues for infectious diseases; allergological, toxicological, cytological and parasitological examinations. Instrumental examination methods include X-ray, endoscopic, ultrasound, methods of recording the electrical activity of organs, including but not limited to Electrocardiogram (ECG) and Electroencephalography (EEG), and a number of other examination methods. To diagnose disorders of some systems and organs, methods of recording the electrical activity of organs are used, particularly ECG and EEG. ==References== Category:Biology Category:Physics Category:Science Category:Medicine Category:Chemistry Category:Nuclear physics",
 "title": "Medical diagnosis"
}