{
 "id": "13538",
 "text": "South Dakota is a state in North America. South Dakota became a state on November 2, 1889. Its capital is Pierre and most populous is Sioux Falls. Other important cities are Rapid City, Sturgis and Aberdeen. Famous attractions include Mount Rushmore, the Black Hills, Crazy Horse mountain sculpture, The Sturgis Motorcycle Rally and the Corn Palace. About 890,000 people lived there in 2020. South Dakota is bordered to the north by North Dakota, to the south by Nebraska, to the east by Iowa and Minnesota, and to the west by Wyoming and Montana. There are nine Native American tribes that live in South Dakota. Most of South Dakota's land was bought in the Louisiana Purchase in 1803. South Dakota and North Dakota both became states in 1889. Many Democrats have represented South Dakota in Congress. However, most politicians in South Dakota are Republicans. More than 90% of the state legislature are Republicans. ==Cities and towns== File:Downtown Sioux Falls 61.jpg|Sioux Falls Rapid_City_Skyline_(2022).jpg|Rapid City AberdeenSD.JPG|Aberdeen Brookings_SD_3.jpg|Brookings Watertown Commercial HD4 NRHP 89000834 Codington County, SD.jpg|Watertown Sioux Falls is the largest city in South Dakota. In 2020, 192,517 people lived there. 281,958 people live in its metro area. The city was founded in 1856. It is in the southeast corner of the state. When the city was first founded, the economy was mostly agribusiness and quarrying. Today, retail, finance, and healthcare are most important to the city's economy.Thompson (ed.), p. 554. === Towns === Rapid City is the second-largest city in South Dakota. 74,703 lived there in 2020.144,558 people live in its metro area. It is located in the Black Hills, and was founded in 1876.Hasselstrom, p. 331. The biggest part of the city's economy is government services. The biggest employers include Ellsworth Air Force Base, the National Park Service, US Forest Service, and the Indian Health Service. Tourism is also a big part of Rapid City's economy. It is close to Mount Rushmore, Sturgis Motorcycle Rally, and Deadwood, and other attractions 10 largest cities in South Dakota 2022 rank City County Population in 2020 Sioux Falls Minnehaha Lincoln 192,517 Rapid City Pennington 74,703 Aberdeen Brown 28,495 Brookings Brookings 23,377 Watertown Codington 22,655 Mitchell Davison 15,660 Yankton Yankton 15,411 Huron Beadle 14,263 Pierre (the capital) Hughes 14,091 Spearfish Lawrence 12,193 ==Related pages== * Colleges and universities in South Dakota * List of counties in South Dakota == References == == Other websites == * The Official Home Page of South Dakota Category:1889 establishments in the United States",
 "title": "South Dakota"
}