{
 "id": "135414",
 "text": "Breastfeeding is when a mother feeds her baby with milk from her breasts. The baby puts its mouth onto their mother's nipple and sucks the milk out of the breast. Breastfeeding is the best food for most babies. Breastfeeding can also reduce the risk for certain health conditions for both babies and mothers. Baby formula is made of cow's milk. Breastmilk is able to help other parts of the baby's body grow. Most women can breastfeed their babies. In some situations a woman with AIDS, tuberculosis, drugs or some other sickness will need to talk to their doctor about the good things and bad things of breastfeeding the baby. There are many reasons to breastfeed. Babies that breastfeed have a reduced risk for some diseases. Breastfeeding is less expensive than formula feeding. In both developing and developed countries, breastfeeding and not giving the baby any other drinks leads to fewer deaths from diarrhea. The World Health Organization recommends that * mothers begin to breastfeed within one hour of birth; * babies should be only breastfed for the first six months. * breastfeeding should continue for up to two years or beyond. Only 1 in 4 infants are exclusively breastfed by the time they are 6 months old. Low rates of breastfeeding add more than $3 billion a year to medical costs for the mother and child in the United States. Three-quarters (74%) of Black infants are ever breastfed, which is below the national average of 83%. Almost all women can produce enough milk for their babies. The World Health Orgaization recommendations are for babies to be breastfed for at least 2 years. == Health effects == Breastfeeding lowers the risk of sickness such as: * Asthma * Obesity * Type 1 diabetes * Severe lower respiratory disease * Ear infections * Sudden infant death syndrome (SIDS) * Diarrhea and vomiting) Breastfed babies have higher test scores than babies that were given formula. Breastfeeding is good for the mother. It can prevent: * High blood pressure * Type 2 diabetes * Ovarian cancer * Breast cancer Breastfeeding also transfers parts of the mother's immune system to the baby helping it fight certain diseases. == Methods == Babies who want to breastfeed will move against their mother's breast. The baby will make sucking motions or will put their hands in their mouth. Even if a baby cannot breastfeed directly from the mother, the mother may hand express or pump the milk and give it to the baby later. === Nipple pain === Some mothers may have painful nipples while or after breastfeeding. The main cause of sore or cracked nipples is poor attachment. Nipples may be sensitive or tender as they adjust to breastfeeding. If nipples hurt at every feed, or if nipples start to crack or bleed, many people can help solve the problems. Help can be from a midwife, doctor or breastfeeding supporter. Changing position may help improve breastfeeding pain. === Expressed milk === A mother may express her milk (remove milk from the breasts) for storage and later use. The mother can express milk by hand or with a breast pump. A breast pump will help the milk come out of the breast. There are many different pumps available for this. Expressing milk by hand may feel better for some mothers who have pain when using a breast pump. It can relieve engorgement by taking some milk out of the breasts and help the baby to latch on. Expressing breastmilk encourages milk production early in lactation. Expressed breast milk can be stored in a cleaned container or in special breast milk storage bags. The breastmilk can be stored in the refrigerator until it is needed. Mothers take milk from their breasts for many reasons. Milk taken out of the breast can be fed to the baby at a later time. Breastmilk is good for premature babies. Premature babies may be fed maternal milk through tubes and bottles. Parents considering directed or informal milk sharing should discuss this option with their doctor, and they should be familiar with the donor's medical history and milk-handling practices. The use of informally-shared (unscreened, not pasteurized) milk from an anonymous donor is discouraged by the Academy of Breastfeeding Medicine. === Engorgement === Engorgement is when the breast fills with milk. This can lead to plugged ducts or a breast infection, so it is important to try to prevent it before this happens. Engorgement can also cause: * Breast swelling * Breast tenderness * Warmth * Redness * Throbbing * Flattening of the nipple * Low- grade fever There are things to do to help with engorgement. As long as the baby is latched onto the breast and sucking well, the baby can feed for as long as they like. * Breastfeed on the engorged breast to remove the milk. * Babies are not to use pacifiers or bottles before they are 3 or 4 weeks old. * Pump a little milk to soften the breast, areola, and nipple before breastfeeding. * Massage the breast. * Use cold cloths on the breast in between feedings to help ease the pain. * Get enough rest, proper nutrition, and fluids. * Wear a well-fitting, supportive bra that is not too tight. === Plugged milk duct === Plugged ducts are painful and common in breastfeeding mothers. A plugged milk duct feels like a sore lump in the breast. A plugged duct happens when a milk duct does not drain right and surrounding tissue gets red. A warm compress on the sore area can help with the pain. == Having enough milk == Most mothers make plenty of milk for their babies. But many mothers worry about having enough milk. Checking the baby's weight and growth is a way to make sure the baby gets enough milk. Other signs that can be monitored to see if the baby is getting enough milk are: *The baby passes enough clear or pale yellow urine. *The baby has enough bowel movements *The baby will have short sleeping periods and wakeful, alert periods. * The baby is content after being fed. * The breasts may feel softer after breastfeeding. * The baby gains weight. Many doctors say breastmilk should be the only food for the first six months of the baby's life. Breastfeeding is good even if the baby takes solid food. There are three types of breast milk. Colostrum is the first milk produced by the breasts right after birth. It is thick, light yellow full of nutrients the baby needs in the first few hours and days. Transitional milk is made when the breast milk starts to replace colostrum. Mature milk looks thinner than colostrum and it is full of nutrients. Mature milk will continue to change with the baby's needs. == When not to breastfeed == It is rare when a woman should not breastfeed. The doctor may say not to breastfeed. The doctor may tell the mother not to take medicine that can be harmful to babies. If the mother has a sickness like HIV or active tuberculosis she may be told not to breastfeed. Check with the doctor before starting to breastfeed. Talk to the baby's doctor if the baby has a reaction to breast milk. This could be diarrhea, crying, or sleepiness. == Weaning == Weaning is the time that the baby stops breastfeeding. It is changing a baby's diet from breast milk to other foods. The baby's health care provider can make sure that he or she is ready for weaning. Weaning after one year is effective in helping to prevent many health problems for the baby. Most mothers in the United States wean their babies by by one year old. Breastfeeding can continue past age one. When to wean is a personal decision and will be different for everyone. Each baby may be ready to wean at different ages. Some children will gradually start to show more interest in eating solid foods and less interest in breastfeeding. Others may want to stop breastfeeding more suddenly. Weaning over several weeks or more is recommended. As the mother slowly stops breastfeeding, she will stop making breast milk. Weaning gradually can help the baby get used to the new taste of infant formula (for a baby younger than twelve months old) or plain whole cow’s milk or fortified unsweetened soy beverage (for your child 12 months or older). The baby can adjust to drinking from a bottle or cup. Weaning can begin by replacing one breast milk feeding a day with a bottle of infant formula (for your child younger than 12 months old) or with a cup of plain whole cow’s milk or fortified unsweetened soy beverage (for your child 12 months or older). The mother can replace more breast milk feedings over time. It's rare for babies to wean themselves off the breast. When the baby suddenly refuses to breastfeed it might be what's called a nursing strike. A nursing strike is that something is different for the baby. During this time, a baby can be comforted. Keep offering the breast to the baby. A nursing strike is usually a short time. Before long, the baby will start breastfeeding again. == Related pages == * Latch * Infant formula == References == Category:Babies Category:Milk Category:Breasts",
 "title": "Breastfeeding"
}