{
 "id": "135411",
 "text": "Burrhus Frederic Skinner (March 20, 1904 – August 18, 1990) was a leading American psychologist and author. Skinner was the leading behaviorist in psychology; he built on the work of John B. Watson, and added the idea of operant conditioning. These two American psychologists paid no attention to mental states and \"thinking\" (terms that they thought were unscientific) but dealt only with visible behaviors. Skinner's work had effects on education (programmed learning) and on behavior therapy for various psychological problems. He was the Edgar Pierce Professor of Psychology at Harvard University from 1958 until his retirement in 1974, and then Emeritus Professor until 1990. Skinner was also a social philosopher who wanted to change society, and wrote a eutopian novel,B.F. Skinner 1948. Walden Two. in which the science of human behavior is used to eliminate poverty, sexual oppression, government as we know it, and create a lifestyle without war. He wrote poetry,B.F. Skinner 1970. On 'having' a poem talks about the poem, its publication, and contains the poem and a reply to it as well. Real Audio mp3 Ogg and three volumes of autobiography. == Life == Skinner was born in Susquehanna, Pennsylvania, to Grace and William Skinner.Ferguson, Kyle E. & William O'Donahue 2001. The Psychology of BF Skinner. Sage Publications. p16 His father was a lawyer. Skinner became an atheist after a liberal Christian teacher tried to assuage his fear of the Hell that his grandmother described. :\"Within a year I had gone to Miss Graves to tell her that I no longer believed in God. 'I know,' she said, 'I have been through that myself.' But her strategy misfired: I never went through it\".B.F. Skinner 1967. In E.G. Boring and G. Lindzey (eds) A History of Psychology in Autobiography. vol 5, 387-413, New York: Appleton Century-Crofts. Skinner attended Harvard University after receiving his B.A. in English literature in 1926. After graduation, he spent a year at his parents' home in Scranton and attempted to become a writer of fiction. He tried to become a writer in Greenwich Village. He soon became disillusioned with his literary skills and concluded that he had little world experience and no strong personal perspective from which to write. His encounter with John B. Watson's Behaviorism led him into graduate study in psychology and to the development of his own operant behaviorism. Skinner received a PhD from Harvard in 1931 and remained there as a researcher until 1936. He then taught at the University of Minnesota at Minneapolis and later at Indiana University, where he was chair of the psychology department from 1946 to 1947. He returned to Harvard in 1948 and stayed there for the rest of his career. In 1936, Skinner married Yvonne Blue. The couple had two daughters, Julie (m. Vargas) and Deborah (m. Buzan). He died of leukemia on August 18, 1990, and is buried in Mount Auburn Cemetery, Cambridge, Massachusetts.Bjork D.W. 1993. B.F. Skinner, a life. New York: Basic Books. == Awards == * 1968 National Medal of Science from President Lyndon B. Johnson * 1971 Gold Medal of the American Psychological Foundation. * 1972 Humanist of the Year Award. * 1990 Citation for Outstanding Lifetime Contribution to Psychology == Written Works == * 1938. The behavior of organisms: an experimental analysis. , * 1948. Walden Two. * 1953. Science and human behavior. * 1957. Schedules of reinforcement, with C.B. Ferster. * 1957. Verbal behavior. * 1961. The analysis of behavior: a program for self instruction, with James G. Holland. This self-instruction book is no longer in print, but the B.F. Skinner Foundation web site has an interactive version. * 1968. The technology of teaching. New York: Appleton-Century-Croft. * 1969. Contingencies of reinforcement: a theoretical analysis. * 1971. Beyond freedom and dignity. * 1974. About behaviorism. ; * 1978. Reflections on behaviorism and society. * 1980. Notebooks, edited by Robert Epstein. * 1982. Skinner for the Classroom, edited by R. Epstein. * 1983. Enjoy old age: a program of self-management. (with M.E. Vaughan) * 1987. Upon further reflection. * 1989. Recent issues in the analysis of behavior. * 1959, 1961, 1972 and 1999. Cumulative Record: a selection of papers, as Cumulative Record: definitive edition. This book includes a reprint of Skinner's October 1945 Ladies' Home Journal article, Baby in a Box, Skinner's original, personal account of the much-misrepresented 'Baby in a box' device. (paperback) === Autobiography === * Skinner B.F. 1976. Particulars of my life: Part 1 of an autobiography. * Skinner B.F. 1979. The shaping of a behaviorist: Part 2 of an autobiography. * Skinner B.F. 1983. A matter of consequences: Part 3 of an autobiography. , === Articles by B.F. Skinner === * Two types of conditioned reflex and a pseudo type (1935) Journal of General Psychology, 12, 66-77. * \"Superstition\" in the pigeon (1947) Journal of Experimental Psychology, 38, 168-172. * Are theories of learning necessary? Psychological Review,57, 193-216, 1950. == References == == Other websites == * National Academy of Sciences biography. * The B. F. Skinner Foundation. * B.F. Skinner profile, NNDB. Category:1904 births Category:1990 deaths Category:American atheists Category:American autobiographers Category:American psychologists Category:Harvard University alumni Category:Scientists from Pennsylvania Category:Writers from Pennsylvania Category:Harvard University faculty Category:Educators from Pennsylvania",
 "title": "B. F. Skinner"
}