{
 "id": "135566",
 "text": "John Broadus Watson (January 9, 1878 – September 25, 1958) was an American psychologist. He established the psychological school of behaviorism after he did research on animal behavior. This school was extremely influential in the mid-20th century, when B. F. Skinner developed it further. Watson was forced to resign his chair at Johns Hopkins University, Baltimore, because his affair with a graduate student became a public scandal. Watson then worked for many years for J. Walter Thompson, a leading American advertising agency. He is credited with popularizing the coffee break during an ad campaign for Maxwell House coffee.Hunt, Morton 1993. The story of psychology. New York: Doubleday. == Behaviorism == Watson founded behaviorism in the spring of 1913 with his paper Psychology as the behaviorist views it.Watson, John B. 1913. Psychology as the behaviorist views it. Psychological Review 20, 158–177 Boring, Edwin G. 1950. A history of experimental psychology. 2nd ed, Appleton-Century-Crofts, New York. p643 In that article, Watson outlined the major features of his new philosophy of psychology, called \"behaviorism.\" The first paragraph of the article concisely described his position: > Psychology as the behaviorist views it is a purely objective experimental > branch of natural science. Its theoretical goal is the prediction and > control of behavior. Introspection forms no essential part of its methods, > nor is the scientific value of its data dependent upon the readiness with > which they lend themselves to interpretation in terms of consciousness. The > behaviorist, in his efforts to get a unitary scheme of animal response, > recognizes no dividing line between man and brute. The behavior of man, with > all of its refinement and complexity, forms only a part of the behaviorist's > total scheme of investigation. In 1913, Watson viewed Ivan Pavlov's conditioned reflex as primarily a physiological mechanism controlling glandular secretions. He had already rejected Edward Thorndike's \"Law of Effect\" (a precursor to B. F. Skinner's principle of reinforcement) because of what Watson believed were \"unnecessary subjective elements.\" The article is also notable for its strong defense of the objective scientific status of applied psychology, which was then considered to be much inferior to the established experimental psychology. With his behaviorism, Watson put the emphasis on external behavior of people and their reactions on given situations, rather than the internal mental state of those people. In his opinion, the analysis of behaviors and reactions was the only objective method to get insight in the human actions. That outlook was thought to be extreme or radical behaviorism. == Views on child-rearing == Watson wrote the book Psychological care of infant and child in 1928, with help from his mistress turned wife, Rosalie Rayner. Rosalie later entitled a self-penned article I am a mother of behaviorist sons.Hergenhahn B.R. 2005. An Introduction to the history of psychology. Wadsworth: Cengage Learning. In the book, Watson explained that behaviorists were starting to believe that psychological care and analysis were required for infants and children. His slogan was \"not more babies but better brought up babies.\" Watson argued for the nurture side of the nature-nurture debate and claimed that the world would benefit from extinguishing pregnancies for twenty years while enough data was gathered to ensure an efficient child-rearing process. Watson’s description of a \"happy child\" was rather detached. It included ideas such as that the child can occupy himself through his problem-solving abilities, should cry only when in physical pain, and should stray from asking questions. Behavior analysis of child development as a field may have begun with the writings of Watson. Watson carried out controversial science experiments known as the Little Albert experiments in which he studied fear in infants. == Biographies of Watson and analysis of his work == Watson's views and life have been the subject of a number of works. * Buckley, Kerry W. 1989. Mechanical Man: John Broadus Watson and the beginnings of behaviorism. Guilford Press. * Buckley, Kerry W. 1994. Misbehaviorism: The case of John B. Watson's dismissal from Johns Hopkins University. In J.T. Todd & E.K. Morris (eds) Modern perspectives on John B. Watson and classical behaviorism. Greenwood Press. * Burnham, John C. 1994. John B. Watson: interviewee, professional figure, symbol. In J.T. Todd & E.K. Morris (eds) Modern perspectives on John B. Watson and classical behaviorism. Greenwood Press. * Coon, Deborah J. 1994 'Not a creature of reason': the alleged impact of Watsonian behaviorism on advertising in the 1920s. In J.T. Todd & E.K. Morris (eds) Modern perspectives on John B. Watson and classical behaviorism. Greenwood Press. * Harris, Ben. 1979. Whatever happened to little Albert? American Psychologist, 34, #2, pp. 151–160. (on- line ) * Hartley, Mariette & Commire, Anne. 1990. Breaking the silence. New York : Putnam's. (Mariette Hartley is John B. Watson's granddaughter. Hartley claims in her autobiography that Watson's theories on childrearing blighted her childhood.) * Mills, John A. 1998. Control: a history of behavioral psychology. New York: New York University Press. * Samelson, F. 1981. Struggle for scientific authority: the reception of Watson's behaviorism, 1913-1920. Journal of the History of the Behavioral Sciences 17, 399-425. * Todd, James T. 1994. What psychology has to say about John B. Watson: classical behaviorism in psychology textbooks, 1920-1989. In J.T. Todd & E.K. Morris, Modern perspectives on John B. Watson and classical behaviorism. Greenwood Press. * Todd, James T. & Morris, Edward K. 1986. The early research of John B. Watson: before the behavioral revolution. The Behavior Analyst 9, 71-88. * Todd, James T., & Morris, Edward K. Modern perspectives on John B. Watson and Classical Behaviorism. Greenwood Press, 1994. * Watson, John B. \"John Broadus Watson [Autobiography].\" In C. Murchison (ed) A history of psychology in autobiography (Vol. 3, pp. 271–81). Clark University Press, 1936. == Books by Watson == *1914. Watson, John B. Behavior: an introduction to comparative psychology. Henry Holt, New York. *1919. Watson, John B. Psychology from the standpoint of a behaviorist. Lippincott, Philadelphia. 2nd ed 1924. *1928. Watson, John B. Psychological care of infant and child. Norton, New York. *1930. Watson, John B. Behaviorism (revised edition). University of Chicago Press. == References == Category:1878 births Category:1958 deaths Category:American psychologists Category:Scientists from South Carolina Category:People from Greenville, South Carolina Category:Johns Hopkins University faculty",
 "title": "John B. Watson"
}