{
 "id": "135553",
 "text": "Mahmoud Abbas () (born 15 November 1935), also known by the Kunya Abu Mazen (), was elected President of the Palestinian National Authority (PNA) or State of Palestine on 9 January 2005. He took office on 15 January 2005. Abbas is a leading politician in Fatah. He served as the first Prime Minister of the Palestinian Authority from March to October 2003. He resigned because of a lack of support from Israel and the United States as well as \"internal incitement\" against his government. Before becoming Prime Minister, Abbas led the Negotiations Affairs Department of the Palestine Liberation Organization (PLO). He has served as Chairman of the PLO Executive Committee since 11 November 2004, after Yasser Arafat's death. Abbas is said to the an example of moderation in Palestine by Israel and the west. == Early years and education == Abbas was born in Safed. As a child, he and his family fled to Syria during the capture of the city by Jewish forces in May 1948. He graduated from the Faculty of Law of the University of Damascus and postgraduate studies at the University of Friendship of Peoples. Patrice Lumumba. In 1982 he defended his dissertation at the Moscow branch of the Institute of Oriental Studies of the USSR Academy of Sciences on \"The Secret Relationship between Nazism and Zionism\",Аббас на глиняных ногах (Коммерсант, Журнал «Власть», № 2(605) от 17.01.2005) the main ideas of which some sources interpreted as Holocaust denial.Вадим Горелік Як товариші Махмуд Аббас і Євген Примаков Голокост заперечували\" Was Abu Mazen a Holocaust Denier? By Brynn Malone, 4-28-03 The director of the institute, EM Primakov, appointed Abbas VI Kiselyov, a specialist in the history of Palestine, as the scientific supervisor. Based on his dissertation, Abbas wrote a monograph, The Other Side: The Secret Relations between the Nazis and the Zionist Leadership. In the \"Relevance of the Topic\" section of the dissertation, Abbas notes: \"As the overall decline of capitalism deepens, the decline of Zionist ideology becomes more and more apparent Expansionist and racist forms… Exposing reactionary ideology… is considered an urgent matter for the entire anti-imperialist camp… The immediate goal of all modern anti-imperialist forces is to defend the world, denouement, democracy and social progress. Abbas sees his task in this scholarly work in \"finding the connection between Zionism and Nazism of the Third Reich\" because \"Zionism flirted with Nazi Germany, so Zionist officials first established contacts with a regime that defined anti-Semitism as its own official state policy.\" And then \"Zionist favorites та made secret deals with the Nazi government to organize the resettlement of deliberately selected Jewish parties in Palestine… Mossad emissaries were given the right to visit concentration camps by the Nazis со to sort prisoners.Abu Mazen and the Holocaust by Tom GrossThe Abbas Doctrine — Selective Terrorism , by Itamar Marcus May 20, 2003 In his dissertation, Abbas exposes other Zionist conspiracies with the Nazis: in order to populate Palestine with Jews, under the so-called Haavar agreement for 1,000 pounds, the Nazis released any Jew who wanted to leave Germany. \"And in this the Zionists met with a favorable attitude of the authorities, which sought to cleanse Germany of Jews.\" Abbas notes \"the closeness of the ideological concepts of Zionism and Nazism in terms of national chauvinism and racism.\" According to Abbas, this \"mutually beneficial joint work\" lasted for 6 years — from 1933 to 1939. Two years later, at the Ibn Rashid publishing house in Amman, Jordan, Abbas published his own book in Arabic, The Hidden Relationships of Zionism and Nazism during World War II, an extended version of his dissertation, in which he rejected Zionist fabrications and the mythical heresy of the deaths of 6 million Jews — some of those who died suffered from a joint (Nazi-Zionist) conspiracy. He said: \"The exact number of Jews killed in the war was significantly less than 6 million, even less than a million. The task of the Zionists was to increase the number of victims among the Jewish people in order to arouse the sympathy of the international community.\" In fact, according to him, \"only 890 thousand Jews died, and crematorium furnaces were used only for the cremation of the bodies of the inhabitants of our planet who died of disease — to prevent the spread of infection.\" Abu Mazen said that saving the Jews for humanitarian purposes was not of interest to the Zionists, and therefore \"they did not make the slightest effort to persuade the West to accept Jewish refugees who had fled Nazi hell.\" He claims that the Zionists thwarted various intentions to support and promote salvation and hid information about the terrible participation of Euro-Jews \"so that they would not need to take the necessary, predictable measures.\" He writes that \"the Zionist movement was deliberately provoked against the Jews who lived on Nazi land in order to provoke dislike of the authorities and their group elimination\".American Thinker, Palestinian Peacemakers?, By Gabriel Latner. September 28, 2010Hamas Complains, So U.N. School Will Not Teach Gaza Students About Holocaust by Patrick Goodenough, September 03, 2009. CNS NewsFour questions for Mahmoud Abbas, by Abraham Cooper and Harold Brackman — The Washington Times ==Criticism== There are frequent accusations that Palestinian Authority (PA) officials, including Abbas, have been involved in stealing public money. During his testimony to the House Committee on Foreign Affairs, Subcommittee on Middle East and South Asia, Elliott Abrams mentioned that \"Corruption harms Palestinian finances and makes people lose trust in the entire political system. It has also made potential donors doubtful. I can share from my experience, as an American official seeking financial support for the Palestinian Authority from Gulf Arab countries, that I often heard, 'Why should we give them money when their officials will just take it?'\" In June 2021, many Palestinians protested against corruption and violence within the Abbas administration in central Ramallah, including at the president's headquarters. This came after anti- corruption activist Nizar Banat died while in government custody and a video of PA security forces beating and abducting him went viral online. In 2023, a poll conducted by the Palestinian Center for Policy and Survey Research (PSR) in the West Bank and the Gaza Strip shows that at least 80% palestinians want Abbas to resign. ==References== Category:1935 births Category:Living people Category:Palestinian Muslims Category:Palestine Liberation Organization Category:Fatah Category:Palestinian nationalists Category:Palestinian National Authority Category:Presidents of the Palestinian National Authority Category:Prime Ministers of the Palestinian National Authority Category:West Bank Category:Presidents of the State of Palestine Category:Palestinian politicians",
 "title": "Mahmoud Abbas"
}