{
 "id": "135534",
 "text": "Mahmud II (Ottoman Turkish: محمود ثاني Mahmud-ı sānī) (July 20, 1785 – July 1, 1839) was the 30th Sultan of the Ottoman Empire. Often described as the \"Peter the Great of Turkey\", he ruled from 1808 until his death. Mahmud was the son of Sultan Abdul Hamid I. His time as sultan is notable mostly for the major legal and military changes he caused. Mahmud instituted extensive administrative, military, and fiscal reforms. His disbandment of the conservative Janissary corps removed a major obstacle to his and his successors' reforms in the Empire. Mahmud's reign was also marked by further Ottoman military defeat and loss of territory as a result of nationalist uprisings and European intervention. Mahmud II was born in Istanbul. He was 23 years old when he came to the throne. He was an Islamic calligraphy artist, composer and poet. He wrote poems under the pseudonym \"Adli\". He was of a brave, patient and prudent temperament. He replaced the old military organization maintained by the governors of irregular auxiliaries (sekban - I Cedid). When the soldiers shortly after arose, he defeated them. The 1808 revolting insurgents killed Alemdar Mustafa Pasha. In 1812 the peace treaty was signed in Bucharest with the Russians. In 1813, with the help of Muhammed Ali Pasha, he defeated the Wahhabis, who desecrated the holy places and shrines in Mecca and Medina. * In 1821 the Greek War of Independence broke out and thousands were killed. * In the “Auspicious Incident” the corps of Janissaries was abolished and replaced by a conscription army. * In 1827 the war with Russia began again. * In 1829 the peace treaty was concluded in Edirne. * In the years 1831 and 1839, riots broke out in Egypt. In July of 1839 the Sultan Mahmud II died as the ill effects of life experienced by him calamitous events he was afflicted with tuberculosis and died. His body was buried in the Türbe in Divanyolu. Mahmud II was devoted to many works of the highest degree in any field. He opened many new schools, and ordered to build large buildings. All the great mosques of Istanbul were repaired in his time. The bridge was built in Unkapani his time. In Mecca, he had built a madrasa and mend the Great Mosque (Mescid-i Aksa) in the holy city of Jerusalem. The poet and Sümbülzâde Vehbi Kececizâde Izzet Molla died at this time. His sons: Abdulmejid I *, * Abdulaziz, 4 Sehzades names Ahmet, Bayezid, veliaht Abdulhamid, Suleyman, 2 Sehzades called Mehmed Murad Nizameddin, Abdullah Osman. His daughters: Emine Sultan, Sultan Hamide, Hayriye Sultan, Sultan Saw, * Saliha Sultan, Ayse Sultan, Sultan Atike *, 2 Fatma Sultan, Sultan Münire, Mihrimah Sultan *, * Adile Sultan. Category:1785 births Category:1839 deaths Category:Sultans of the Ottoman Empire",
 "title": "Mahmud II"
}