{
 "id": "135605",
 "text": "The nation state is a form of state that rules mainly one nation. The state is a political entity (the government, etc.); the nation is a cultural and/or ethnic entity. The term \"nation state\" means that both are on the same territory, which distinguishes the nation state from the other types of states that have existed.However, a unifying \"national identity\" can exist also in countries that have several ethnic or language groups. For example, Switzerland is constitutionally a confederation of cantons, and has four official languages, but it has also a Swiss national identity; a national history; and a classic national hero, Wilhelm Tell. (See: Thomas Riklin, 2005. Worin unterscheidet sich die schweizerische \"Nation\" von der Französischen bzw. Deutschen \"Nation\"? == Examples == Clear examples of nation states include: * Iceland: although the inhabitants of Iceland are ethnically related to other Scandinavian groups, the national culture and language are found only in Iceland. There are no cross-border minorities since the nearest land is too far away. * Japan: Traditionally seen as a good example of a nation-state, Japan includes minorities of ethnically distinct Ryūkyū peoples, Koreans; Chinese; and, on the northern island of Hokkaidō, the indigenous Ainu minority. See also Japanese Demographics . * Portugal: although surrounded by other lands and people, the Portuguese nation has occupied the same territory for almost 900 years. A long time ago, Portugal was formed from groups of people that were previously separate. They all passed through and settled in the area that later became Portugal. They included native Iberian peoples, Celts, ancient Mediterraneans (Greeks, Phoenicians, Romans), Germanic peoples like the Suebi and the Visigoths, the later invading Berbers and Arabs, and Jews.The creation of a new ethnicity from disparate elements is discussed at ethnogenesis. == Before nation-states == In Europe, in the 18th century, the classic non-national states were empires of many ethnicities, (Austria- Hungary, the Russian Empire, the Ottoman Empire, the French Empire and the British Empire). == Characteristics == * Nation states have a different attitude to their territory from dynastic monarchies. No nation would swap territory with other states simply, for example, because the king's daughter got married. * They have a different type of border that is mostly defined by where the cultural/ethnic (nation) group settles, but many nation states have also had borders based on geography like rivers and mountain ranges. * The most noticeable characteristic is how much nation states use the state as an instrument of national unity in economic, social and cultural life. == References == == Further reading == * Hobsbawm, Eric J. (1992). Nations and Nationalism Since 1780: Programme, Myth, Reality. 2nd ed. Cambridge University Press. . * White, Philip L. (2006). \"Globalization and the Mythology of the Nation State,\" In A.G.Hopkins, ed. Global History: Interactions Between the Universal and the Local Palgrave Macmillan, pp. 257–284. ==Related pages== * City-state * Ethnic group * Nation * Nationalism * Secession * Sovereignty * State == Other websites == * From Paris to Cairo: Resistance of the Unacculturated (Identity and the Nation state) Category:Political geography Category:Nationalism",
 "title": "Nation state"
}