{
 "id": "135697",
 "text": "Katheryn Elizabeth Hudson (born October 25, 1984), known by her stage name as Katy Perry, is an American singer, songwriter and television personality. She has released seven studio albums and two EPs. In 2001, she released her debut album, Katy Hudson. She has earned nine number-one singles on the Billboard Hot 100, five of which are from one album (she became the first female artist to achieve this record). She has also been nominated for 11 Grammy Awards. ==Early life== Katheryn Elizabeth Hudson was born on October 25, 1984, at Goleta Valley Cottage Hospital in Santa Barbara, California, to Maurice Hudson and Mary Hudson (née Perry), both pastors. She has an older sister, Angela, and a younger brother, David, who is also a musician. Perry has said that her upbringing was \"sheltered\" and that an example of this was that her family did not eat Lucky Charms cereal because her parents thought that luck was something that came from the devil. She also called deviled eggs \"angeled eggs\" growing up. ==Career== ===2000-2001: Katy Hudson=== Then known as Katy Hudson, she released a Christian album named after herself. It had the single \"Search Me\". She was discovered by Glen Ballard, who is known for his work with musician Alanis Morissette. This album did not perform well, and she was dropped from her record label, Red Hill, when the label was shut down. She struggled for six years before eventually signing with her current label, Capitol Records. ===2007–2009: One of the Boys=== After changing her last name to Perry (her mother's maiden name) so that she allegedly would not be confused with actress Kate Hudson, Katy released an EP album called Ur So Gay. This song has been criticized and labelled homophobic. On June 17, 2008, Perry released her first pop album called One of the Boys with singles including \"I Kissed a Girl\" (her first number-one hit), \"Hot N Cold\", and \"One of the Boys\". She co-wrote the single \"I Do Not Hook Up\" for singer Kelly Clarkson (the first winner of American Idol), along with the song \"Rock God\" for singer-actress Selena Gomez. ===2009–2012: Teenage Dream=== She started recording the album at the end of September 2009 Perry's third album, Teenage Dream, was released in August 2010 and included the singles \"California Gurls\", \"Teenage Dream\", and \"Firework\". She is the only female artist to get 5 number-one singles from one album on the US Billboard Hot 100. Along with the album's first three singles reaching the top, \"E.T.\" featuring Kanye West and \"Last Friday Night (T.G.I.F.)\" also hit number one. The only other artist to get 5 number-one songs from one album is Michael Jackson, with Bad. She was inspired by her then-engagement to British comedian and actor Russell Brand. At the Grammy Awards in 2012, Perry performed a new song, \"Part of Me\", that was released as the lead single from the re-release of Teenage Dream, called Teenage Dream: The Complete Confection. The song entered at number one on the Billboard Hot 100, becoming her seventh US number-one hit. The next single, \"Wide Awake\", reached number two in the US and topped the Canadian Hot 100. In July 2012, Perry released the concert film/biopic Part of Me in 3D. The movie shows her early life through the Teenage Dream era and her rise to fame. On November 30, 2012, Perry went to the 2012 Billboard Women in Music event. She was given the Woman of the Year Award there. ===2012–2016: Prism and other projects=== In 2012 Perry began the recording of her album In August 2013, Killer Queen, Perry's third fragrance, was released. Perry collaborated with fellow American pop star Britney Spears to write the song \"Passenger\" for Spears' eighth studio album, Britney Jean. Perry's fourth album, Prism, was released on October 18, 2013. It reached number one in 83 countries. The first single from the album, \"Roar\", was number one in Australia, Austria, Bulgaria, Canada, Croatia, Ireland, Israel, Lebanon, New Zealand,http://www.charts.org.nz/showitem.asp?interpret=Katy+Perry&titel;=Roar&cat;=s Scotland, South Korea, the United Kingdom, and the United States. Perry performed the song at the 2013 American Music Awards. On November 10, 2013, she performed the album's second single, \"Unconditionally\", at the 2013 MTV Europe Music Awards. On December 5, 2013, Perry's single \"Roar\" was nominated for the 2014 Grammy Awards for Song of the Year and Best Pop Solo Performance. She performed at The GRAMMY Nominations Concert Live! On May 7, 2014, Perry began the Prismatic World Tour in support of her fourth studio album, Prism. The album's third single, \"Dark Horse\", featuring rapper Juicy J, became Perry's ninth number-one single in the United States. It was the second-best performing single of 2014 there. In 2016, she released the single \"Rise\" in support of the Rio Olympics. Two music videos were released: one with an Olympic theme and one which depicts Perry with a red parachute. The song reached number one in Australia and the top twenty in the US and Canada. ===2016–2019: Witness and American Idol=== Between 2015 and 2016, the singer took a brief hiatus that lasted about a year and a half. On February 10, 2017, Perry released the single \"Chained to the Rhythm\", which reached the top five in many countries worldwide, including the US, UK, and Canada. It features the grandson of Bob Marley, Skip Marley, and was co-written by Australian singer- songwriter Sia. Two months later, the single \"Bon Appétit\" was made available for download. The hip-hop group Migos is featured on this song. \"Swish Swish\" featuring rapper Nicki Minaj and \"Hey Hey Hey\" were released as the album's third and fourth singles, respectively. \"Swish Swish\" became certified platinum in the US. In May 2017, Perry announced that her fifth studio album would be released on June 9 and is called Witness. She also announced Witness: The Tour, a concert tour that began in North America in September 2017. During the weekend of the release of Witness, Perry partnered with YouTube and held a 96-hour livestream event called \"Witness World Wide\". In the stream, Perry was recorded over four days throughout her daily life in a house she rented in Los Angeles. She held segments which featured celebrities, like British talk show host James Corden, Huffington Post founder Arianna Huffington, and YouTuber Gigi Gorgeous. Perry could also be seen crying in a therapy session. She claimed that she got rid of her long, dark hair in favor of a new, short and blonde hairdo at a time where she questioned whether she still wanted her fame and did not \"want to be Katy Perry anymore.\" The livestream gained over 49 million views on YouTube. In 2018, Perry became a judge in American Idol, a job she had previously refused. Katy Perry later recorded a cover of \"Waving Through a Window\" from Dear Evan Hansen to help promote the musical's national tour. The song was released in November 2018 as part of a special edition of the cast album. That same month, she also released a holiday song called \"Cozy Little Christmas.\" In addition, she recorded \"Immortal Flame\" for the game Final Fantasy Brave Exvius, where she also appeared as a playable character. Outside of music, Katy Perry made a cameo as herself in Zoolander 2, released in February 2016. In 2017, she launched her own shoe line called Katy Perry Collections, which is sold on its website and in stores like Dillard’s and Walmart. That August, she hosted the 2017 MTV Video Music Awards. In 2018, she became a judge on American Idol, earning a $25 million salary for the role. ===2019-2020: Smile=== At the 61st Annual Grammy Awards, Perry performed \"Here You Come Again\" with Dolly Parton and Kacey Musgraves, as part of a tribute to Parton. Four days later, she released a song called \"365\", with German DJ Zedd. In April, Perry was included on a remix of Daddy Yankee's song \"Con Calma\", featuring Snow. Later she released the singles \"Never Really Over\" on May 31, \"Small Talk\" on August 9, and \"Harleys in Hawaii\" on October 16. Perry made an appearance in the music video of Taylor Swift's \"You Need to Calm Down\" on June 2019. After the release of her single \"Never Worn White\" in March 2020, Perry revealed in the accompanying music video that she was expecting her first child with Bloom. The lead single from her sixth album, \"Daisies\", was released on May 15, 2020. The album's second single \"Smile\" was released two months later. The album of the same name was released on August 28, 2020. Two days before the album's distribution, gave birth to a daughter named Daisy Dove Bloom. The album received mixed reviews by critics, and debuted at number five in the United States. The album was later promoted with four compilation EPs: Camp Katy, Empowered, Scorpio SZN, and Cosmic Energy. These EPs were followed by the single \"Not the End of the World\" in December 21, 2020, which had a music video in which Zooey Deschanel impersonates Perry. Additionally, she collaborated with various artists to create two remixes of Smile album tracks. Tiësto remix of the promotional single, \"Resilient\", which features Aitana was released in November 2020, while Bruno Martini remix of \"Cry About It Later\" featuring Luísa Sonza was released in April 2021. === 2021–2023: Play residency === On January 20, 2021, Perry performed \"Firework\" at the Celebrating America concert during Joe Biden’s inauguration. Four months later, she released a new single, \"Electric,\" in collaboration with Pokémon for its 25th anniversary. Later that year, she teamed up with Swedish DJ Alesso for the song \"When I'm Gone,\" which made her the third person to top Croatia's ARC 100 chart in three different decades. In December 2021, Perry started hosting a concert residency called Play at Resorts World Las Vegas. Inspired by Honey, I Shrunk the Kids, Pee-wee's Playhouse, and Pee-wee's Big Adventure, the show received critical acclaim and earned $46.4 million by its conclusion in November 2023. Perry’s contract for the residency was worth $168 million. In September 2021, Perry was honored in Variety's \"Power of Women\" issue, discussing her career, motherhood, and philanthropy. On her 37th birthday, she guest-hosted The Ellen DeGeneres Show and starred in a Gap Inc. holiday ad. In January 2022, she co-founded De Soi, a company selling non- alcoholic apéritifs. Perry also recorded a duet with Thomas Rhett for his album Where We Started, released on April 1, 2022, and worked on the soundtrack for the animated film Melody. She became the face of various food delivery services, creating a new remix of their jingle. On June 8, 2022, she received the Key to Las Vegas, which was declared Katy Perry Day. Perry collaborated with Apple on an ad for their GarageBand music software, promoting remix sessions of her song \"Harleys in Hawaii.\" In May 2023, she performed at the Coronation Concert for King Charles III. Four months later, she sold her music rights to Litmus Music for $225 million. === 2024: 143 === In February 2024, Katy Perry announced she would be stepping away from American Idol after its 22nd season to concentrate more on her own music. She explained that she had been working in the studio and was eager to reconnect with her own creative rhythm, saying she wanted to \"feel that pulse to my own beat.\" Later that year, she released \"Woman's World,\" the lead single from her anticipated album, followed by additional tracks like \"Lifetimes\" and \"I'm His, He's Mine,\" which featured the artist Doechii. Her album, 143, was officially released on September 20, 2024. Perry described the project as vibrant and filled with energy, joy, love, and light. However, the album faced criticism upon release, with many critics giving it negative reviews. Additionally, Perry came under scrutiny for collaborating with Dr. Luke, a producer with whom she had worked on the album. This was particularly controversial due to the ongoing legal battle between Dr. Luke and singer Kesha, who accused him of sexual assault. Despite the backlash, Perry continued to make waves in the entertainment world. She was awarded the prestigious Michael Jackson Video Vanguard Award at the 2024 MTV Video Music Awards on September 11, 2024. She also performed at the Rock in Rio festival and later headlined the pre-game show for the 2024 AFL Grand Final. In December 2024, Katy Perry filmed a special titled Katy Perry: Night of a Lifetime, which aired on ITV, and as a gift to her fans, she released a deluxe version of her album, 1432, just in time for the holidays. == Artistry == Perry has a three-octave mezzo-soprano vocal range. Her voice has been misclassified and starting debates since her debut album. Perry's chest- dominant mix leads people to believe that she has a ‘weightier’ voice than she actually does. Her tessitura is not sky high, but her complete discomfort down low and ease (at least for her technique) in the upper 5th octave means she must be a soprano. == Achievements == Katy Perry has received several awards, including five American Music Awards, fourteen People's Choice Awards, four Guinness World Records, a Brit Award, and a Juno Award. In 2012, Billboard named her \"Woman of the Year.\" She spent 69 consecutive weeks in the top ten of the Billboard Hot 100 from May 2010 to September 2011. Her album Teenage Dream made history by producing five number-one singles, the most for a female artist, and the second overall after Michael Jackson's Bad. In the U.S., she has nine number-one singles, with \"Dark Horse\" being the latest, and holds the record for 18 consecutive number-one hits on the Billboard Dance Club Songs chart. Billboard ranks Katy Perry as the 15th most successful dance club artist ever. She is also listed fourth on their \"Greatest Pop Songs Artists\" list and twenty-fifth on the \"Greatest Pop Stars of the 21st Century\" list. Her albums Teenage Dream and Prism are included in the \"Greatest Billboard 200 Albums by Women\" list. Her song \"Dark Horse,\" which was ranked number 100 on the \"Greatest of All Time Hot 100 Songs\" list, was also recognised—\"E.T.,\" \"Firework,\" and \"California Gurls\"—on the magazine's list of the \"Greatest Hot 100 Songs by Women.\" In June 2015, her \"Dark Horse\" music video became the first by a female artist to hit 1 billion views on Vevo, and the following month, \"Roar\" reached the same milestone, making her the first artist with two videos at 1 billion views. Katy Perry has sold 143 million records worldwide, making her one of the best-selling music artists ever. In 2013, she was named the Top Global Female Recording Artist by the IFPI. In the U.S., she is the ninth top digital singles artist, with 121.5 million certified song units and 19 million certified album units, totaling 129.5 million certified units. In 2017, she became the first artist to have three songs—\"Dark Horse,\" \"Firework,\" and \"Roar\"—earn Diamond certifications from the RIAA. These songs, along with \"E.T.,\" \"California Gurls,\" and \"Hot N Cold,\" have each sold over 5 million digital copies. In 2023, \"California Gurls\" became her fourth Diamond- certified single, giving her the most Diamond singles by a female artist in the U.S. Teenage Dream is the first and only album ever to have four songs that have been certified diamond. Her albums One of the Boys, Teenage Dream, Prism, Witness, and Smile have each surpassed one billion streams on Spotify. In 2011, Forbes ranked Katy Perry third on their \"Top-Earning Women in Music\" list with $44 million, and she was fifth in 2012 with $45 million. She earned $39 million in 2013, ranking seventh, and $40 million in 2014, ranking fifth. In 2015, she topped the \"Top-Earning Women in Music\" list with $135 million and was also the highest-paid female celebrity that year. In 2016, her net worth was estimated at $125 million, and she earned $41 million, ranking sixth. The following year, she earned $33 million and was ranked ninth. In 2018, she was the highest-paid woman in music, earning $83 million, and ranked fourth on the \"Highest-Paid Female Celebrities\" list. In 2019, she earned $57.5 million, ranking fourth again. Over the decade, she earned $530 million, ranking her the ninth-highest-earning musician. In September 2023, Forbes estimated that her net worth was $340 million, which reportedly grew to $350 million by May 2024, earning her a spot on Forbes' list of \"America's Richest Self-Made Women.\" In 2024, Katy Perry's net worth is estimated to be over $500 million. This increase is largely due to her $225 million music catalog sale to Litmus Music and high earnings from her Las Vegas residency and American Idol role. She earned $168 million from her residency and $165 million from judging on American Idol since 2019. Her wealth is also supported by business ventures, endorsements, and investments in products like fragrances and beverages. ==Personal life== Perry married British comedian and actor Russell Brand on October 23, 2010. However, the two divorced in December 2011. She previously dated Gym Class Heroes lead singer Travie McCoy. She began dating English actor Orlando Bloom in 2016 and became engaged in 2019. On August 27, 2020, she gave birth to their daughter, Daisy Dove Bloom. The child is Perry's first and Bloom's second with whom he has a son, Flynn (born 2011) from his previous marriage, Australian model Miranda Kerr. ==Discography== * Katy Hudson (2001) * One of the Boys (2008) * Teenage Dream (2010) * Prism (2013) * Witness (2017) * Smile (2020) * 143 (2024) ==Tours and residency== Headlining tours * Hello Katy Tour (2009) * California Dreams Tour (2011–2012) * Prismatic World Tour (2014–2015) * Witness: The Tour (2017–2018) * The Lifetimes Tour (2025) Co-headlining tours * Strangely Normal Tour (with Phil Joel) (2001) Residency * Play (2021–2023) ==Filmography== * The Smurfs (2011) * Katy Perry: Part of Me (2012) * The Smurfs 2 (2013) * Brand: A Second Coming (2015) * Katy Perry: The Prismatic World Tour (2015) * Katy Perry: Making of the Pepsi Super Bowl Halftime Show (2015) * Jeremy Scott: The People's Designer (2015) * Zoolander 2 (2016) ==References== ==Other websites== * * Official site Category:1984 births Category:Living people Category:American LGBT rights activists Category:American pop singers Category:American television actors Category:Brit Award winners Category:Actors from Santa Barbara, California Category:Singers from Santa Barbara, California Category:Writers from Santa Barbara, California",
 "title": "Katy Perry"
}