{
 "id": "135769",
 "text": "The peregrine falcon (Falco peregrinus) is a cosmopolitan bird of prey in the family Falconidae. It can also be known just as the peregrine, and was once called the \"Duck hawk\" in North America. In Pakistan, it is officially the military iconic symbol of the PAF and the unofficial territory bird of Gilgit- Baltistan.In Pakistan, the Peregrine Falcon, or Shaheen Falcon is also associated with the symbolism of the poetry of the national poet Muhammad Iqbal The peregrine is a crow-sized falcon, with a blue-grey back, barred white underparts, and a black head and \"mustache\". It can go up to 322 km/h (200 mph) in a dive, which means it is the fastest animal in the world. As with other bird-eating raptors, the female is bigger than the male. There are 17–19 subspecies recorded, and each varies slightly in appearance and where they live. There is disagreement over whether the distinctive Barbary falcon is a subspecies of the Peregrine or just a different species. The peregrine falcon is the fastest animal on land, it's record-breaking dive which earns it its title, coming in at close to 390 km per hour. It is closely related to the gyrfalcon, which has a top speed of 209 km per hour. Although the falcon is the fastest flying animal, the fastest movement of a bird belongs to the hummingbird, its wing rotating 80 times a second. The use of certain pesticides, especially DDT was not good for the animals. It could be shown that in areas where DDT was used, the thickness of the shells of their eggs was reduced. This caused a dramatic decline in their numbers, in certain countries. Since the use of DDT has been forbidden in many countries, their numbers are increasing again. This recovery was helped because their nesting places were protected in many countries; some countries also bred these falcons in captivity and released them into the wild. The male and female falcons can sit on their eggs to keep them warm in conditions to hatch their newborns. The chicks of the peregrine falcon are known as “eyasses”. == Other websites == Conservation organizations: * European Peregrine Falcon Working Group * Peregrine Falcon Fund * The Canadian Peregrine Foundation * Falcon Research Group == References == Category:Falconiformes Category:Birds of Pakistan Category:Birds of Kashmir Category:National symbols of San Marino Category:National symbols of the United Arab Emirates",
 "title": "Peregrine falcon"
}