{
 "id": "135737",
 "text": "\"If I Were a Boy\" is a song by American singer Beyoncé, written by Toby Gad, BC Jean and Beyoncé Knowles for her third studio album, I Am... Sasha Fierce (2008). ==Music video== The music video for \"If I Were a Boy\" was directed by Jake Nava and portrays Knowles as an NYPD officer. It begins with Knowles and her husband reciting words such as \"honesty\" and \"commitment\". It later shows Knowles on patrol with her male partner. The video tells of the ways a both men and women hurt each other in a relationship. Knowles stated: \"It's about all of the little things that mean so much in a relationship[…] At the end of the clip, you realize that I was acting out his life, and it all starts over again. He was a cop and everything that happened was really him doing the same thing to me.\" ==Track Listing== ;Dance Mixes EP https://www.masterbeat.com/#release/bboy Dance Mixes EP #\"If I Were a Boy (Maurice Joshua Mojo Uk Main Mix)\" - 6:30 #\"If I Were a Boy (Maurice Joshua Mojo Uk Dub Mix)\" - 6:28 #\"If I Were a Boy (Karmatronic Main Mix)\" - 6:25 #\"If I Were a Boy (Dj Escape & Dom Capello Main Remix)\" - 8:28 #\"If I Were a Boy (Maurice Joshua Uk Radio Edit)\" - 3:14 #\"If I Were a Boy (Karmatronic Radio Edit)\" - 3:31 #\"If I Were a Boy (Dj Escape & Dom Castello Radio Edit)\" - 4:07 ;Dance Mixes EP Vol.2 #\"If I Were a Boy (Lost Daze Remix Main)\" - 5:08 #\"If I Were a Boy (Mark Picchiotti Remix Club)\" - 7:15 #\"If I Were a Boy (Mark Picchiotti Remix Dub)\" - 7:15 #\"If I Were a Boy (Chase Girls Club Mix)\" - 8:28 #\"If I Were a Boy (Lost Daze Radio Edit)\" - 3:05 #\"If I Were a Boy (Mark Picchiotti Radio Edit)\" - 3:42 #\"If I Were a Boy (Chase Girls Radio Edit)\" - 3:31 ;CD single #\"If I Were a Boy\" - 4:10 #\"Single Ladies (Put a Ring on It)\" - 3:13 ;Remixes CD #\"If I Were a Boy\" #\"If I Were a Boy (If I Were a Girl Remix) (feat. Lee Carr) - 4:09 ;Spanish Promo Only CD single #\"Si yo fuera un chico\" - 4:09 #\"If I Were a Boy\" - 4:10 == References == Category:2008 songs Category:2000s ballads Category:Beyoncé songs Category:Pop ballads Category:R&B; ballads Category:Songs with feminist themes Category:Reba McEntire songs",
 "title": "If I Were a Boy"
}