{
 "id": "135739",
 "text": "\"Single Ladies (Put a Ring on It)\" - is a song by American singer Beyoncé. It was written by The-Dream, Tricky Stewart and Beyoncé for her third album, I Am... Sasha Fierce (2008). == Music video == The music video for \"Single Ladies (Put a Ring on It)\" was shot on September 14, 2008 and directed by Jake Nava and released to major outlets on October 13, 2008. In the video, Knowles is performing as Sasha Fierce. The video features much choreography, showing Sasha with two other female dancers in all black leotards. The video is based upon a 1960s routine performed by Gwen Verdon. It was uploaded to YouTube on October 3, 2009. == Track listing == Digital Remix EP https://www.masterbeat.com/#release/bsingle Digital Remix EP # \"Single Ladies (Put a Ring on It)\" (Dave Aude Club Mix) - 8:24 # \"Single Ladies (Put a Ring on It)\" (Karmatronic Remix) - 5:58 # \"Single Ladies (Put a Ring on It)\" (Redtop Club Mix) - 6:59 # \"Single Ladies (Put a Ring on It)\" (Redtop Dub) - 7:05 # \"Single Ladies (Put a Ring on It)\" (DJ Escape & Tony Coluccio Club) - 6:58 # \"Single Ladies (Put a Ring on It)\" (DJ Escape & Tony Coluccio Dub) - 6:11 # \"Single Ladies (Put a Ring on It)\" (Lost Daze Dating Service Remix) - 6:52 # \"Single Ladies (Put a Ring on It)\" (Craig C's Master Blaster Radio Remix) - 8:19 US Promo Remixes EP # \"Single Ladies (Put a Ring on It)\" (Dave Aude Club) - 8:24 # \"Single Ladies (Put a Ring on It)\" (Dave Aude Radio) - 3:50 # \"Single Ladies (Put a Ring on It)\" (Karmatronic Club) - 5:58 # \"Single Ladies (Put a Ring on It)\" (Karmatronic Radio) - 3:47 # \"Single Ladies (Put a Ring on It)\" (Redtop Club) - 6:59 # \"Single Ladies (Put a Ring on It)\" (Redtop Dub) - 7:05 # \"Single Ladies (Put a Ring on It)\" (Redtop Radio) - 3:36 # \"Single Ladies (Put a Ring on It)\" (DJ Escape & Tony Coluccio Club) - 6:58 # \"Single Ladies (Put a Ring on It)\" (DJ Escape & Tony Coluccio Dub) - 6:11 # \"Single Ladies (Put a Ring on It)\" (DJ Escape & Tony Coluccio Radio) - 3:44 # \"Single Ladies (Put a Ring on It)\" (Lost Daze Dating Service Remix) - 6:52 # \"Single Ladies (Put a Ring on It)\" (Lost Daze Dating Service Radio) - 3:32 # \"Single Ladies (Put a Ring on It)\" (Craig C's Master Blaster Remix) - 8:19 # \"Single Ladies (Put a Ring on It)\" (Craig C's Master Blaster Radio) - 3:31 CD Single # \"Single Ladies (Put a Ring on It)\" (Main) - 3:13 # \"Single Ladies (Put a Ring on It)\" (Maurice Joshua Club Edit) - 3:44 # \"Single Ladies (Put a Ring on It)\" (Maurice Joshua Club Mix ) - 6:47 # \"Single Ladies (Put a Ring on It)\" (Instrumental) - 3:11 # \"If I Were a Boy\" - 4:10 UK CD Single # \"Single Ladies (Put a Ring on It)\" # \"Single Ladies (Put a Ring on It)\" (Redtop Remix) UK Promo CD Single # \"Single Ladies (Put a Ring on It)\" (Redtop Club) - 6:59 # \"Single Ladies (Put a Ring on It)\" (My Digital Enemy Remix) - 6:39 # \"Single Ladies (Put a Ring on It)\" (Olli Collins & Fred Portelli Remix) - 7:43 # \"Single Ladies (Put a Ring on It)\" (Japanese Popstars Remix) - 7:46 # \"Single Ladies (Put a Ring on It)\" (Craig C's Master Blaster Remix) - 8:19 # \"Single Ladies (Put a Ring on It)\" (Karmatronic Club) - 5:58 # \"Single Ladies (Put a Ring on It)\" (Main) - 3:13 == References == Category:2008 songs Category:Beyoncé songs Category:Dance-pop songs Category:R&B; songs Category:Billboard Hot 100 number one songs Category:Songs with feminist themes",
 "title": "Single Ladies (Put a Ring on It)"
}