{
 "id": "135812",
 "text": "James Carville (born October 25, 1944) is an American political consultant, commentator, actor, attorney, media personality and pundit. Known as the Ragin' Cajun, Carville gained national attention for his work as the lead strategist of the successful presidential campaign of then-Arkansas governor Bill Clinton. Carville was the co-host of CNN's Crossfire until its final broadcast in June 2005. Since its cancellation, he has appeared on CNN's news program, The Situation Room. As of 2008, he hosts a weekly program on XM Radio titled 60/20 Sports with Luke Russert, son of Tim Russert who hosted NBC's Meet The Press. He is married to Republican political consultant Mary Matalin. ==Career as author== Carville is also a best-selling author. With his wife, Republican Mary Matalin, and writer Peter Knobler, Carville co-wrote All's Fair: Love, War and Running for President, published in 1995. He later wrote: We're Right, They're Wrong: A Handbook for Spirited Progressives, published in 1996; ...And The Horse He Rode In On: The People vs. Kenneth Starr, published in 1998; With Paul Begala he co-wrote Stickin. Suck Up, Buck Up... and Come Back When You Foul Up, in 2001, which detailed strategies for fighting and winning in business, politics, and life. In 2004, Carville released a political banter book entitled Had Enough?, as well as a children's picture book, Lu and the Swamp Ghost, with co-author Patricia C. McKissack and illustrator David Catrow. In January 2006, he released another book co-written with Begala, Take It Back: Our Party, Our Country, Our Future. ==Film and television appearances== *Carville takes a lead role in The War Room, a documentary about Bill Clinton's 1992 presidential campaign, together with George Stephanopoulos. *He appeared in the 1996 film The People vs. Larry Flynt as attorney Simon Leis. *In the film Old School, Carville makes a cameo appearing as himself, brought in as a ringer at a college-level debate society meeting. Will Ferrell then inexplicably gives a complex answer regarding US biotechnology policy. When it comes to Carville's rebuttal, he only says, \"...We...(stumbles) have no response. That was perfect...\" *In the film Wedding Crashers, Carville makes a cameo appearance alongside Senator John McCain of Arizona. *He appeared as himself in Rachel Boynton's Our Brand Is Crisis, a documentary that goes behind-the-scenes to show the manipulation and orchestration that is involved in big-time political campaigning. Movie follows members of the consulting firm of Greenberg Carville Shrum to Bolivia, where they have been hired to help controversial candidate Gonzalo Sanchez de Lozada reclaim the presidency. *Carville appears as the Governor of Missouri, Thomas Crittenden, in the 2007 movie The Assassination of Jesse James by the Coward Robert Ford. *He was in a Coca-Cola ad during Super Bowl XLII in 2008, with former Republican Senator Bill Frist. *He appeared as himself in NBC's comedy 30 Rock, season 2 episode 8, where he advises numerous characters on how to deal with their problems \"Cajun style\". (\"Tryin' to steal candy from a vending machine? Here, let me show you how it's done...Cajun style.\") *Appeared in cartoon form in Season 2, Episode 10 of the Family Guy \"Running mates\". Carville was introduced as the ragin' cajun and was trying to save Peter Griffin's career as school president. *Starred in Steven Soderberg's HBO series 'K Street' along with his wife. ==Other websites== *The Office of James Carville *CNN Biography * Category:Writers from Georgia (U.S. state) Category:Television personalities from Georgia (U.S. state) Category:Democrats (United States) Category:American political commentators Category:Living people Category:1944 births",
 "title": "James Carville"
}