{
 "id": "135938",
 "text": "The United States Secretary of Homeland Security is the head of the United States Department of Homeland Security, the body concerned with protecting the American homeland and the safety of American citizens. The Secretary is a member of the President's Cabinet. The position was created following the terrorist attacks of September 11, 2001. == List of Secretaries of Homeland Security == ;Parties (5) (3) (4) ;Status Portrait Name Senate vote Term of office Term of office Term of office State of residence President President Portrait Name Senate vote Took office Left office Duration State of residence President President 1 94–0 January 24, 2003 February 1, 2005 (2001–2009) – – February 1, 2005 February 15, 2005 (2001–2009) 2 98–0 February 15, 2005 January 21, 2009 (2001–2009) 3 Voice vote January 21, 2009 September 6, 2013 (2009–2017) – – September 6, 2013 December 23, 2013 (2009–2017) 4 78–16 December 23, 2013 January 20, 2017 (2009–2017) 5 88–11 January 20, 2017 July 31, 2017 (2017–2021) – – July 31, 2017 December 6, 2017 (2017–2021) 6 62–37 December 6, 2017 April 10, 2019 (2017–2021) – – April 10, 2019 November 13, 2019 (2017–2021) – – November 13, 2019 January 11, 2021 (2017–2021) – – January 11, 2021 January 20, 2021 (2017–2021) – – January 20, 2021 February 2, 2021 (2021–2025) 7 56–43 February 2, 2021 January 20, 2025 (2021–2025) – – January 20, 2025 January 25, 2025 (2025–present) 8 59–34 January 20, 2025 Incumbent (2025–present) James Loy served as acting secretary in his capacity as Deputy Secretary of Homeland Security. Rand Beers served as acting secretary in his capacity as confirmed Undersecretary of Homeland Security for National Protection and Programs and Acting Deputy Secretary of Homeland Security; Beers was the highest ranking Senate-approved presidential appointee at the Department of Homeland Security. Elaine Duke served as acting secretary in her capacity as Deputy Secretary of Homeland Security. Kevin McAleenan served as acting secretary in his capacity as Commissioner of Customs and Border Protection. His tenure was ruled unlawful. Chad Wolf served as acting secretary in his capacity as Under Secretary of Homeland Security for Strategy, Policy, and Plans. His tenure was ruled unlawful. Peter Gaynor served as acting secretary in his capacity as Federal Emergency Management Agency Administrator. David Pekoske served as acting secretary in his capacity as Administrator of the Transportation Security Administration == References == Category:United States Secretaries of Homeland Security Category:2003 establishments in the United States",
 "title": "United States Secretary of Homeland Security"
}