{
 "id": "135902",
 "text": "The Cabinet of the United States (usually simplified as \"the Cabinet\") is composed of the most senior appointed officers of the executive branch of the federal government of the United States, and its existence dates back to the first American President (George Washington), who appointed a Cabinet of four people (Secretary of State, Thomas Jefferson; Secretary of the Treasury, Alexander Hamilton; Secretary of War, Henry Knox; and Attorney General, Edmund Randolph) to advise and assist him in his duties. Cabinet officers are nominated by the President and then presented to the United States Senate for confirmation or rejection by a majority. If approved, they are sworn in and begin their duties. Aside from Attorney General, and previously, the Postmaster General, they all receive the title Secretary. ==Current cabinet members== ===Cabinet=== The Cabinet officers are listed in rank order according to the United States presidential line of succession: Cabinet Office Incumbent Took office Vice President JD Vance January 20, 2025 Secretary of State Marco Rubio January 21, 2025 Secretary of the Treasury Scott Bessent January 28, 2025 Secretary of Defense Pete Hegseth January 25, 2025 Attorney General Pam Bondi February 5, 2025 Secretary of the Interior Doug Burgum February 1, 2025 Secretary of Agriculture Brooke Rollins February 13, 2025 Secretary of Commerce Howard Lutnick February 19, 2025 Secretary of Labor Lori Chavez-DeRemer March 11, 2025 Secretary of Health and Human Services Robert F. Kennedy Jr. February 13, 2025 Secretary of Housing and Urban Development Scott Turner February 5, 2025 Secretary of Transportation Sean Duffy January 28, 2025 Secretary of Energy Chris Wright February 4, 2025 Secretary of Education Linda McMahon March 3, 2025 Secretary of Veterans Affairs Doug Collins February 5, 2025 Secretary of Homeland Security Kristi Noem January 25, 2025 ===Cabinet-level officials=== The president may designate additional positions to be members of the Cabinet, which can vary under each president. They are not in the line of succession and are not necessarily officers of the United States. Cabinet-level officials Office Incumbent Term began Administrator of the Environmental Protection Agency Lee Zeldin January 29, 2025 Director of the Office of Management and Budget Russell Vought February 7, 2025 Director of National Intelligence Tulsi Gabbard February 12, 2025 Director of the Central Intelligence Agency John Ratcliffe January 23, 2025 Trade Representative Jamieson Greer February 27, 2025 Ambassador to the United Nations Dorothy Shea January 20, 2025 Administrator of the Small Business Administration Kelly Loeffler February 20, 2025 White House Chief of Staff Susie Wiles January 20, 2025 ==Related pages== * List of United States Cabinets ==References==",
 "title": "Cabinet of the United States"
}