{
 "id": "136188",
 "text": "Theodore Marvin DiBiase, Jr. (born November 8, 1982) is an American professional wrestler. He is best known for his time in WWE from 2007-2013, where he was a member of the stable The Legacy. He is a third-generation wrestler, as he is the grandso of wrestlers Iron Mike DiBiase and Helen Hild, and the son of \"The Million Dollar Man\" Ted DiBiase. His brother Brett is also a former wrestler. DiBiase is a former two-time World Tag Team Champion with Cody Rhodes. He also starred in the movie The Marine 2, the sequel to The Marine which starred John Cena. == Early life == DiBiase grew up in Clinton, Mississippi and graduated from Clinton High School in 2001. At Clinton, DiBiase was the football team's starting quarterback. He attended Mississippi College and was the starting wide receiver for the college's football team, before he left the squad after his freshman season. He graduated in 2005 with a Bachelor of Science and Bachelor of Business Administration. == Career == === Ealy career and The Legacy (2007–2010) === In July 2007, DiBiase signed a developmental contract with World Wrestling Entertainment (WWE) and debuted in their training territory Florida Championship Wrestling (FCW). He first appeared on WWE television on May 26, 2008, where he said he was going to become a champion like his father, Ted DiBiase, and challenged the World Tag Team Champions, Cody Rhodes and Hardcore Holly. At Night of Champions, DiBiase won the World Tag Team Championship in his first match in WWE, after Rhodes turned on Holly, and decided to team up with DiBiase under the team name Priceless. They held the titles for a month, but lost them to John Cena and Batista on August 4. The next week, DiBiase and Rhodes had a rematch, and won the titles back. DiBiase and Rhodes were joined by Manu later that year. but on the October 27, 2008 episode of Raw, DiBiase and Rhodes lost their championship to CM Punk and Kofi Kingston. DiBiase was then taken off television, so he could film the movie The Marine 2. He returned on January 12, 2009 and joined Rhodes' and Randy Orton's stable The Legacy. The group feuded with the McMahon family (Stephanie, Shane, and Mr. McMahon) and D-Generation X (Triple H and Shawn Michaels). In 2010 at the Royal Rumble, DiBiase and Rhodes accidentally cost Orton his chance to win the WWE Championship from Sheamus. On February 21, DiBiase entered the Elimination Chamber match at the first ever Elimination Chamber pay-per-view. He eliminated Orton from the match, but was evenutally eliminated by Kofi Kingston. The next night on Raw, The Legacy broke up after Orton turned on DiBiase and Rhodes. The three competed in a Triple Threat match at WrestleMania XXVI, which was won by Orton. The day before, DiBiase and his brother Brett inducted their father into the WWE Hall of Fame. === Singles competition (2010–2013) === On the April 5 episode of Raw, DiBiase debuted a new gimmick of an arrogant millionaire, similar to his father's old gimmick. He even redintroduced the Million Dollar Championship and was later managed by Virgil In June, he started a kayfabe relationship with Maryse. On the October 4 episode, Goldust attacked DiBiase Jr. and stole the Million Dolllar belt. On the November 8 episode, Aksana stole the belt from him. Goldust stole the belt back the following week and returned it to DiBiase's father. His son refused to take back the belt, so the Million Dollar Championship was reitred again. In December, Dibiase and Maryse became the pros of Brodus Clay on the fourth season of NXT. On January 25, 2011, they switched their rookies with Alberto Del Rio and Ricardo Rodriguez, therefore becoming the pros of Conor O'Brian. In the 2011 WWE draft on April 26, DiBiase was drafted to the SmackDown brand. He started teaming with Cody Rhodes again until August, when Rhodes attacked him, therefore DiBiase turned face. On August 26, 2013, he announced that he was not renewing his WWE contract, which expired on September 1. He then wrestled on the independent circuit until his retirement in 2017. == Championships and accomplishments == * Florida Championship Wrestling ** FCW Southern Heavyweight Championship (1 time) * Fusion Pro Wrestling ** Fusion Pro Tag Team Championship (1 time) – with Mike DiBiase II * Pro Wrestling Illustrated ** Ranked No. 34 of the best 500 singles wrestlers in the PWI 500 in 2010 * World Wrestling Entertainment ** Million Dollar Championship (1 time) ** World Tag Team Championship (2 times) – with Cody Rhodes == References == ==Other websites== * Category:1982 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Mississippi",
 "title": "Ted DiBiase Jr."
}