{
 "id": "136255",
 "text": "Delta Flag of Delta, BC Flag of Delta, BC the location of Delta in GVRD the location of Delta in GVRD Area Population 364 km² (140.5 sq mi) 108,455 created 1879 Province Region British Columbia Greater Vancouver Mayor Lois Jackson Time Zone Postal Code Area Code Pacific (UTC-8) V4C to V4G, V4K to V4M 604, 778 Delta is a place in British Columbia, Canada. Delta is a part of Metro Vancouver. Delta is next to the cities of; Richmond to the north, Surrey to the east, and New Westminster to the north east. Delta is also next to Point Roberts to the south, Point Roberts is a part of Whatcom County, Washington, USA. Delta is the biggest place in Metro Vancouver by how much land it has, Surrey is the second biggest. The mayor of Delta is Lois Jackson. Delta has three towns; Ladner, Tsawwassen, and North Delta. == About Delta == Delta was made in 1868 by two people named William and Thomas Ladner. In 1879 Delta turned into a municipality. In 1959, the George Massey tunnel was made and it connected Delta to Richmond. In 1986, the Alex Fraser bridge was made and it connected Delta to New Westminster. Four highways go through Delta; Highway 99, Highway 17, Highway 10, and Highway 91. The busy Tsawwassen Ferry Terminal is in Delta. Delta is also has a lot of farm land and the Burns Bog, which is the largest bog in North America. == Towns == Delta has three towns: * North Delta - most people who live in Delta live here. North Delta is next to Surrey by Scott Road to the east and 96th Avenue to the north. The first and only Krispy Kreme donut shop in British Columbia is in North Delta. North Delta is also has the Scottsdale Centre shopping mall. 52,000 people live in North Delta. * Ladner - a small town in north-west Delta. Ladner is the main centre of Delta. Ladner has a downtown centre. The Delta Municipal Hall, the Delta Hospital, the Delta Cable building, the Delta Museum, and the Delta School District head office are all in Ladner. Ladner also has an airport, which is called the Boundary Bay Airport. The main street in Ladner is Ladner Trunk Road, which turns into Highway 10. 25,000 people live in Ladner. * Tsawwassen - a place named after a First Nations tribe. The busy Tsawwassen Ferry Terminal, which has ferries that go to Victoria, Nanaimo, and the Gulf Islands, is in Tsawwassen. Tsawwassen is also has Delta's only border crossing, which goes to Point Roberts, Washington, USA. Tsawwassen also has a beach and two Indian reserves. The Tsawwassen Town Centre Mall, South Delta's only shopping mall, is also in Tsawwassen. The main street for Tsawwassen is 56th Street. 25,000 live in Tsawwassen. ==Other websites== *Official website Category:Cities in British Columbia Category:Settlements in Greater Vancouver",
 "title": "Delta, British Columbia"
}