{
 "id": "136282",
 "text": "Óscar Gutiérrez (born December 11, 1974), better known by his ring name Rey Mysterio, is an American professional wrestler. He is currently signed to WWE. He wrestles on the SmackDown brand. Mysterio is often said to be one of the greatest professional wrestlers of all time. He is credited for making cruiserweight wrestling popular. Mysterio is one of the world's most recognizable lucha libre wrestlers. Mysterio is the nephew of Rey Misterio Sr., He began his professional wrestling career in 1989 on the independent circuit. He was 14 years old. He signed with Asistencia Asesoría y Administración (AAA) in 1992. After a short time wrestling for Extreme Championship Wrestling (ECW), Mysterio went to work for World Championship Wrestling (WCW) in 1996. In WCW, Mysterio helped popularize lucha libre in the United States. This led to cruiserweight wrestling divisions being more popular. He won the WCW Cruiserweight Championship five times and the WCW World Tag Team Championship three times. He then wrestled for Consejo Mundial de Lucha Libre (CMLL). Mysterio joined World Wrestling Entertainment (WWE) in 2002. In WWE, Mysterio won the Cruiserweight Championship three times the World Heavyweight Championship and Intercontinental Championship twice, and the United States Championship three times. He also won the WWE Championship once and the WWE Tag Team Championship four times. He is WWE's 21st Triple Crown and Grand Slam champion, is a Royal Rumble match winner, and has headlined several WWE pay-per-view events. Mysterio left WWE in 2015 and wrestled for New Japan Pro-Wrestling (NJPW), Lucha Underground and AAA. Mysterio returned to WWE in 2018. He won the U.S. Championship twice and the SmackDown Tag Team Championship. His tag team partner was his son Dominik. On March 31, 2023, Mysterio was inducted into the WWE Hall of Fame by Konnan. ==AAA Return (2015–2017)== On March 3, 2015, it was announced that Mysterio resigned with Asistencia Asesoría y Administración (AAA). He made his return to the promotion at the 2015 Rey de Reyes (\"King of Kings\"). He teamed up with Myzteziz in the main event against El Hijo del Perro Aguayo and Pentagón Jr. On March 20, 2015, Mysterio teamed with Extreme Tiger to face El Hijo del Perro Aguayo and Manik. In the match, Mysterio used a headscissors takedown to throw Aguayo out of the ring. When Aguayo got back into the ring, Mysterio dropkicked him in the head to set up for his finisher, the 619 which caused Aguayo to land on the middle rope. Aguayo appeared to be limp while hanging on the middle rope. The match was finished when Mysterio pinned Manik. Aguayo was later brought out of the ring and was rushed to the Del Prado hospital. He was pronounced dead around 1:00am on March 21. Mysterio and Konnan were pallbearers at his funeral. == Championships and accomplishments == * Asistencia Asesoría y Administración / Lucha Libre AAA Worldwide ** Mexican National Trios Championship (1 time) – with Octagón and Super Muñeco ** Mexican National Welterweight Championship (1 time) ** Lucha Libre World Cup (2015) – with Myzteziz and El Patrón Alberto ** AAA Hall of Fame (Class of 2007) ** Técnico of the Year (2015) * Catch Wrestling Europe ** CWE World Grand Prix (2017) *Cauliflower Alley Club **Lucha Libre Award (2020) * The Crash ** The Crash Heavyweight Championship (1 time) * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * Destiny World Wrestling ** DWW Championship (1 time) * Hollywood Heavyweight Wrestling ** HHW Light Heavyweight Championship (1 time) * International Wrestling All-Stars ** IWAS Tag Team Championship (1 time) – with Konnan * Lucha Underground ** Lucha Underground Trios Championship (1 time) – with Dragon Azteca Jr. and Prince Puma * Pro Wrestling Illustrated ** Ranked No. 4 of the top 500 best singles wrestlers in the PWI 500 in 1999 ** Ranked No. 56 of the top 500 singles wrestlers of the \"PWI Years\" in 2003 * World Championship Wrestling ** WCW Cruiserweight Championship (5 times) ** WCW Cruiserweight Tag Team Championship (1 time) – with Billy Kidman ** WCW World Tag Team Championship (3 times) – with Billy Kidman (1), Konnan (1), and Juventud Guerrera (1) * World Wrestling Association ** WWA Lightweight Championship (3 times) ** WWA Tag Team Championship (1 time) – with Rey Misterio ** WWA Welterweight Championship (3 times) * World Wrestling Council ** WWC World Junior Heavyweight Championship (1 time) * World Wrestling Entertainment/WWE ** WWE Championship (1 time) ** World Heavyweight Championship (2 times) ** WWE Cruiserweight Championship (3 times) ** WWE Intercontinental Championship (2 times) ** WWE Tag Team Championship (4 times) – with Edge (1), Rob Van Dam (1), Eddie Guerrero (1), and Batista (1) ** WWE SmackDown Tag Team Championship (1 time) – with Dominik Mysterio ** WWE United States Championship (3 times) ** Royal Rumble (2006) **Championship Competition Tournament (2007) ** Bragging Rights Trophy (2010) – with Team SmackDown (Big Show, Jack Swagger, Alberto Del Rio, Edge, Tyler Reks and Kofi Kingston) **WWE Championship Tournament (2011) ** Twenty-first Triple Crown Champion ** Twenty-first Grand Slam Champion ** Bumpy Award (1 time) *** Tag Team of the Half-Year (2021) - with Dominik Mysterio * Wrestling Observer Newsletter ** Best Flying Wrestler (1995–1997, 2002–2004) ** Best Wrestling Maneuver (1995) Flip dive into a frankensteiner on the floor ** Match of the Year (2002) with Edge vs. Chris Benoit and Kurt Angle, for the WWE Tag Team Championship, WWE No Mercy, October 20 ** Most Outstanding Wrestler (1996) ** Rookie of the Year (1992) ** Worst Feud of the Year (2008) with Kane ** Wrestling Observer Newsletter Hall of Fame (Class of 2010) == References == ==Other websites== *Official website * Category:1974 births Category:Living people Category:American Roman Catholics Category:Sportspeople from San Diego Category:WWE Hall of Fame Category:WWE wrestlers",
 "title": "Rey Mysterio"
}