{
 "id": "136258",
 "text": "Surrey is a city in British Columbia, Canada. It is a part of Metro Vancouver, which is next to the cities of; Coquitlam, Port Coquitlam to the north, Pitt Meadows to the north east, Langley to the east, New Westminster to the north west, White Rock to the south, and Delta to the west. Surrey is also next to Blaine, Washington, USA to the south. Surrey has six town centres: Whalley, Newton, Guildford, Fleetwood, Cloverdale, and South Surrey. The mayor of Surrey is Brenda Locke. ==About Surrey== Surrey was made as a municipality in 1879, in the early 90s, more people started moving to Surrey and made it their home. In 1993, Surrey turned into a city. In 1937, the Pattullo Bridge was made, and connected Surrey to New Westminster. The bridge also caused more people to move to Surrey. In 1964, the Port Mann Bridge was built to connect from Surrey to Coquitlam. The Port Mann Bridge is a part of the famous Trans Canada Highway. Six highways run through Surrey, Highway 10, Highway 99, Highway 99A, Highway 15, Highway 1, and Highway 1A. Surrey is the location of the Peace Arch, which is a monument at the Canada-US border. Surrey is also the second biggest city in British Columbia by population and it is expected to beat Vancouver's population as the biggest city in the province by 2020. Surrey is one of the fastest growing cities in Canada and the fastest growing city in Metro Vancouver. The population in 2021 was 568,322. ==Town Centres== Surrey has six town centres: *Whalley - the city centre of Surrey is in Whalley. Whalley is the only town centre in Surrey to have SkyTrain services. The four SkyTrain stations in Whalley are; Scott Road, Gateway, Surrey Central, and King George. The SFU Surrey campus is also in Whalley. There are 78,500 people live in Whalley. There is a recreation centre, second biggest library of BC and a bus stop. *Newton - most people who live in Surrey live in Newton. The Surrey city hall and courthouse are in Newton. Newton is bordered with Delta to the west by Scott Road (120th Street). A Surrey public library and a Surrey RCMP station are in Newton. 91,595 people live in Newton. *Guildford - a town centre in north east Surrey. The world's tallest flagpole is in Guildford. The Guildford Town Centre Mall is in Guildford. 49,300 people live in Guildford. Guildford is connected by rail service to New Westminster. Businesses located in this are have good access.now more population in guild ford *Fleetwood - a town centre in East Surrey. Fleetwood was named after a World War I soldier named Thomas Fleetwood. A Surrey public library and Community Centre are in Fleetwood. 43,300 people live in Fleetwood. *Cloverdale - most famous for being the filming scene for many movies and TV shows, such as Hot Rod and Smallville. The City of Surrey Museum is in Cloverdale, as well as the Stetson Bowl Stadium, which is located in the Cloverdale Fairgrounds. Cloverdale has a rodeo and it is the second biggest rodeo in Canada after the Calgary Stampede. Cloverdale is bordered with Langley to the east by 196th Street. *South Surrey - is bordered with the city of White Rock to the south west and with Blaine, WA, USA to the south. The Peace Arch|Douglas Peace Arch border crossing is in South Surrey as well as the Peach Arch monument, which is on the border. South Surrey also has a beach called Crescent Beach and an Indian reserve. The Semiahmoo Shopping Centre is also in South Surrey. 53,980 people live in South Surrey. In 2020 a headline in the DailyHive said that \"Surrey is on pace to become Metro Vancouver's new downtown\" == References == Category:Cities in British Columbia Category:Settlements in Greater Vancouver",
 "title": "Surrey, British Columbia"
}