{
 "id": "136355",
 "text": "In cryptography, the Advanced Encryption Standard (AES), is a symmetric-key, block cipher algorithm that was selected by the National Institute of Standards and Technology (NIST) in 2001. It was selected for encrypting data. It is commonly used around the world. The Advanced Encryption Standard has replaced the Data Encryption Standard (DES). As of 2008, AES is one of the most popular algorithms used in symmetric key cryptography. It is available to programmers and the general public with various software packages. == History == AES is a type of Rijndael () block cipher developed by Belgian programmers, Vincent Rijmen and Joan Daemen. The National Institute of Standards and Technology held a competition for a publicly available symmetric-key encryption algorithm and started accepting entries in 1997. In 1998, fifteen algorithms were selected for the first round in the First AES Conference. After asking for comments, the NIST held the Second AES Conference where the top five algorithms were MARS, RC6, Rijndael, Serpent, and Twofish. By 2000 and the end of the Third AES Conference, the NIST selected Rijndael for the AES proposal. For AES, NIST selected three members of the Rijndael family, each with a block size of 128 bits, but three different key lengths: 128, 192 and 256 bits. The Advanced Encryption Standard (AES) was published as a Federal Information Processing Standard on November 26, 2001. == Details == AES has a fixed block sizes of 128 bits and three values of key size 128, 192, or 256 bits. > \"The design and strength of all key lengths of the AES algorithm (i.e., 128, > 192 and 256) are sufficient to protect classified information up to the > SECRET level. TOP SECRET information will require use of either the 192 or > 256 key lengths. The implementation of AES in products intended to protect > national security systems and/or information must be reviewed and certified > by NSA prior to their acquisition and use.\" AES is fast in both software and hardware, is relatively easy to implement, and requires little memory. == Standard == The Advanced Encryption Standard (AES) is defined in: * FIPS PUB 197: Advanced Encryption Standard (AES)http://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.197.pdf * ISO/IEC 18033-3: Block ciphers ==Related pages== * DES-X * Data Encryption Standard (DES) * Triple DES (TDES) ==References== Category:Cryptography",
 "title": "Advanced Encryption Standard"
}