{
 "id": "136759",
 "text": "The second lady of the United States or second gentleman is the title held by the hostess of the Number One Observatory Circle. This is usually the wife or husband of the vice president of the United States, during the vice president's term in office. Usha Vance is the current second lady of the United States, in role since January 2025 as the wife of Vice President JD Vance. == Second Lady-Second Gentleman Designate == The second lady-second gentleman designate is the wife or husband of the vice president-elect of the United States. The vice president-elect was the candidate who won the presidential election alongside the presidential candidate, but is awaiting the inauguration to become vice president. The second lady-second gentleman designate is also awaiting the inauguration to become the second spouse. The term corresponds to the term \"incoming second lady or second gentleman\", used for those wives of vice president-elects for the same period between their election and inauguration. Incumbent second spouses whose husband or wife have won re-election for a second term are not referred to as second lady-second gentleman designate, as they are already in office and are not waiting to become second spouse. == Origins and Role == The second lady or second gentleman is not elected by the people of the United States. There are no official jobs he or she is officially required to perform and they are not paid for being the second spouse. They are often involved in political campaigns and managements of the Number One Observatory Circle. They are involved in participating in social causes and representing the vice president at official and ceremonial occasions. They also accompany the vice president on foreign summits and events. == Office of the Second Lady == The Office of the Second Lady helps the second lady carry out their duties as the official hostess of the Number One Observatory Circle. They are also in charge of all social and ceremonial events of the vice presidents official residence. The second lady has her own staff that includes a Chief of Staff, Director of Public Engagement and Policy, Deputy Director for Scheduling, Communications Assistant, and Associate Director of Projects and Special Assistant. == Causes and initiatives == Since the early 2000s, a few second spouses have become public speakers, to promote public initiatives. A staff supports her or his agenda. * Lynne Cheney: History of the United States * Jill Biden: \"Joining Forces\"; military families * Karen Pence: Art therapy; military families * Doug Emhoff: Food security; climate change; combatting antisemitism ==List of second ladies and gentlemen== Abigail Adams · Ann Gerry · Hannah Minthorne Tompkins · Floride Calhoun · Letitia Christian Tyler · Sophia Dallas · Abigail Fillmore · Mary Cyrene Burch Breckinridge · Ellen Vesta Emery Hamlin · Eliza Johnson · Ellen Maria Colfax · Eliza Hendricks · Anna Morton · Letitia Stevenson · Jennie Tuttle Hobart · Edith Roosevelt · Cornelia Cole Fairbanks · Carrie Babcock Sherman · Lois Irene Marshall · Grace Coolidge · Caro Dawes · Mariette Rheiner Garner · Ilo Wallace · Bess Truman · Jane Hadley Barkley · Pat Nixon · Lady Bird Johnson · Muriel Humphrey Brown · Judy Agnew · Betty Ford · Happy Rockefeller · Joan Mondale · Barbara Bush · Marilyn Quayle · Tipper Gore · Lynne Cheney · Jill Biden · Karen Pence · Doug Emhoff · Usha Vance ==List of living former second spouses== There are six living former second spouses ==References== *",
 "title": "Second ladies and gentlemen of the United States"
}