{
 "id": "136972",
 "text": "The fire service in the United Kingdom operates under separate legislative and administrative arrangements in England, Northern Ireland, Scotland and Wales. ==Fire services== In England, there is a fire service for each county and large city, although some cover two counties. Wales is divided between three fire services. Scotland has had only one fire service since 2013. Northern Ireland has had only one fire service since 1973. Fire services are known as fire and rescue services, or fire services for short, or by the older phrase fire brigades. Most of them now have the name \"[Place] Fire and Rescue Service\", e.g. Oxfordshire Fire and Rescue Service. There are a few that do not: London Fire Brigade, Cleveland Fire Brigade and West Midlands Fire Service.Department for Communities and Local Government: Fire and Resilience (accessed 08 Dec 06) ==How fire services work== There are two main types of firefighter: *Wholetime firefighter: Those who work full-time as firefighters. They usually work during some days and during some nights. When they are on duty, they wait at the fire station to be called to an emergency. Wholetime firefighters are found in towns and cities. In the largest cities, all firefighters work wholetime. *Retained firefighter: Those who are called out to do firefighting work a few times a week, or less. They do not work full- time in the fire service, and many have full-time jobs somewhere else. However, they are paid some money. They spend long periods of time on call. When called to an emergency, they drive to the fire station in their cars and bring out the fire engine. In villages, all firefighters are retained. Some fire stations (especially in medium-sized towns) have both wholetime firefighters and retained firefighters. Some fire stations are day-crewed, meaning they are covered by wholetime firefighters during the day and by retained firefighters at night. A few places have volunteer firefighters, who are like retained firefighters but are not paid at all. Wholetime firefighters work as part of a 'watch'. This is a group of 5-15 firefighters who work the same hours at the same fire station. A fire station's watches are usually named with a colour (e.g. red watch, white watch, blue watch, green watch,etc). The fire service has ranks. In most fire services, these are, from lowest to highest: *Firefighter (FF) *Crew Manager (CM) *Watch Manager (WM) *Station Manager (SM) *Group/Area Manager (G/AM) *Assistant Chief Fire Officer (ACFO) *Deputy Chief Fire Officer (DCFO) *Chief Fire Officer (CFO) ==Notes== Category:Firefighting Category:Emergency services in the United Kingdom",
 "title": "Fire services in the United Kingdom"
}