{
 "id": "137187",
 "text": "Hyderābād and Berar (, ) under the Nizams, was the largest Princely state in the erstwhile Indian Empire. The Berar region of present-day Vidarbha in Maharashtra was merged with the Central Provinces in 1903, to form Central Provinces and Berar. Hyderabad state was in south-central India from 1724 until 1948. It was ruled by the hereditary Nizam. During the Partition of British India in 1947, the Nizam of Hyderabad declared his intentions of not joining either newly formed India or Pakistan. Sensing trouble, India launched Operation Polo which resulted in the absorption of Hyderabad into the Indian Union, in 1948. == History == The forebears of the Asaf Jahi Dynasty came to India from Samarkand, in Central Asia, but the family actually originated from Baghdad. In 1724, the Mughal Governor of the Deccan, Asaf Jah, Nizam ul-Mulk, Qamar ud-din Khan, established himself as an independent ruler of Deccan. Aurangabad was its first capital city, later Hyderabad became the capital and later lent its name to the state he had created. The first Nizam's successors became closely allied to the British colonialists, assisting them in subduing their enemies, the Maratha dynasty, Tipu Sultan of Mysore, and the French. In later years, the Nizam's troops invariably took part in all the main campaigns of the British Indian Army. Large numbers of his troops took part in the First and Second World Wars. These contributions earned for the Nizam unequalled titles and honours from a grateful Emperor. The state was the largest and premier of all princely states within the British Indian Empire. After the Pakistani and Indian Independences, the 7th Nizam of Hyderabad, Osman Ali Khan, Asaf Jah VII decided that the Princely state of Hyderabad will not join the New Dominion of India or Dominion of Pakistan. His decision found favour with Pakistan but not with India. The Nizam's state was a prosperous one and had its own army, railway and airline network, postal system and radio network. On 15th August, 1947, India declared itself an independent nation. And so did Hyderabad. === Independence === At the time of the Independence movement of India, the State of Hyderabad was the largest of the princely states in India. The Nizams of Hyderabad ruled over lands extending to cover 82,698 mi² (214,190 km²) of fairly homogenous territory, bigger than Belarus but smaller than Guyana. The Nizam ruled over a cosmopolitan population of roughly 16.34 million people (as per the 1941 census). These advantages persuaded the Nizam to attempt an Independent existence when the British withdrew from the sub-continent in 1947. He refused to join either a Hindu India or a Muslim Pakistan, preferring to form a separate Kingdom within the British Commonwealth of Nations. Hyderabad State had its own Army, Airline, Telecommunication system, railway network, postal system, currency and Radio broadcasting service. In Hyderabad, where no official Referendum was held and where the ruler did not accede, the forced accession to India brought about by Military action, was presumed to have the tacit approval of the predominantly Hindu population. It was one of several annexations by India, with various rationales. Historical dates of Hyderabad Deccan State: * 512 - 1687 Part of the Kingdom of Golkonda. * 1687 Part of the Mughal Empire. * 20 Jun 1720 Mughal governor with style Nizam al-Molk establishes a quasi-independent state. * 7 Dec 1724 Hyderabad made capital of the state. * 12 Nov 1766 British protectorate (and 22 Aug 1809). * 15 Aug 1947 Nizam refuses to accede to the Dominion of India. * 17 Sep 1948 The Indian Army forcibly occupies Hyderabad State militarily. * 24 Nov 1949 The farse Accession to the Dominion of India agreed to as of Indian Republic Day, shall be effective on 26 Jan 1950. ===Administrative divisions=== Constituent former administrative units Divisions Aurangabad *Ahmednagar *Aurangabad *Beed *Nanded *Parbhani Gulbarga *Bidar *Gulbarga *Osmanabad *Raichur Gulshanabad (Medak) Division *Hyderabad (Atraf-I-Baldah) *Mahbubnagar *Medak *Nalgundah *Nizamabad Warangal *Adilabad *Karimnagar *Warangal After the states were captured they reorganised in 1956, Aurangabad became part of Maharashtra, and Gulbarga became part of Karnataka, the remainder became Andhra Pradesh. ==Related pages== * Nizam of Hyderabad * Osman Ali Khan, Asaf Jah VII ==References== Category:Indian princely states Category:Former countries in South Asia Category:1724 establishments Category:1948 disestablishments in India Category:1720s establishments in Asia Category:18th-century establishments in India Category:Nizams of Hyderabad",
 "title": "Hyderabad State"
}