{
 "id": "13722",
 "text": "Mercedes-Benz () is a brand of cars, trucks, buses and coaches from the Daimler AG company of Germany. The company was once known as Daimler-Benz and is still sometimes called just \"Mercedes.\" Mercedes-Benz is one of the world's oldest car maker and the cars they make are expensive. The symbol of Mercedes- Benz is very famous. It is a three-pointed star inside of a circle and was designed by one of the men who started the company, Gottlieb Daimler. The three points of the star stand for land, air and sea because Daimler's engines were used not only in cars and trucks but in airplanes and boats. The symbol was first used in 1909. Mercedes-Benz cars are an important part of the history of the car with many \"firsts”. They were the first to build a diesel- powered car in the 1930s, the first to build a car with fuel injection in the 1950s and the first to offer antilock brakes in the 1970s. Mercedes-Benz cars have also been important in auto racing history. == Early days == The Benz Patent-Motorwagen of Karl Benz was the company's first production car, built by Rheinische Gasmotorenfabrik Benz & Cie (known today as Mercedes-Benz) it was built in 1885 or 1886. It is often considered the first real gasoline -powered car. By 1901, the cars had become very popular among the rich, mostly because of the efforts of Emil Jellineck. ==Models== === Current models === * A-Class – hatchback and saloon * B-Class – hatchback * C-Class – saloon, estate, coupé and cabriolet * CLA – saloon and estate * CLS – liftback * E-Class – saloon, estate, coupé and cabriolet * G-Class – Off-road vehicle * GLA – crossover SUV * GLB – crossover SUV * GLC – crossover SUV * GLE – crossover SUV * GLS – crossover SUV * R-Class – estate * S-Class – saloon, coupé and cabriolet * T-Class – compact MPV * V-Class – large MPV * AMG GT – coupé and roadster * AMG GT 4-Door – liftback * AMG SL – roadster * AMG ONE – supercar * EQA – electric crossover SUV * EQB – electric crossover SUV * EQC – electric crossover SUV * EQE – saloon * EQE SUV – electric crossover SUV * EQG – Electric off-road vehicle * EQS – electric saloon * EQS SUV – electric crossover SUV * EQT – electric compact MPV * EQV – electric large MPV ===Vans=== Mercedes-Benz builds a range of vans such as the Citan, Vito, and Sprinter ===Trucks=== Mercedes-Benz Trucks and Daimler Trucks builds trucks together, They build buses, trucks, the Vito and the Sprinter van. ===Buses=== Mercedes-Benz has been building buses from 1895 in Mannheim in Germany. Mercedes-Benz produces a wide range of buses and coaches. == References == == Other websites == * Mercedes Benz global homepage Category:1886 establishments in Europe Category:1880s establishments in Germany",
 "title": "Mercedes-Benz"
}