{
 "id": "137498",
 "text": "Vitiligo is a long term condition which causes white patches to develop on the skin. It can affect any area of skin, but it commonly happens on the face, neck and hands, and in skin creases. Viltigo occurs when the melanocytes cells that give skin their color, die or do not work. This means not enough melanin is produced. It is a problem because these cells protect against the light from the sun, so it's important to take extra care when in the sun and use a sunscreen with a high sun protection factor (SPF). This means the affected skin can become itchy in the sun. == Cause == Vitiligo is caused by the lack of a pigment called melanin in the skin. Melanin is produced by skin cells called melanocytes, and it gives skin its colour. In vitiligo, there are not enough working melanocytes to produce enough melanin in your skin. This causes white patches to develop on the skin or hair. The exact cause of vitiligo is complex and not fully understood. It may be caused by the immune system, genetic, and environmental factors, as well as problems during fetal development. Non-segmental vitiligo (the most common type) is thought to be caused the immune system not working propely (an autoimmune condition), leading the body to attack healthy cells and tissie in the body. Vitiligo is also associated with other autoimmune conditions, such as hyperthyroidism (an overactive thyroid gland), but not everyone with vitiligo will develop these conditions. People over 20 years old rarely develop this disease. These patches often occur to both sides symmetrically and may change shape. ==Symptoms== The areas of skin most commonly affected by vitiligo include: *mouth and eyes *fingers and wrists *armpits *groin *genitals *inside the mouth Vitiligo often starts as a pale patch of skin that gradually turns completely white. The centre of a patch may be white, with paler skin around it. If there are blood vessels under the skin, the patch may be slightly pink, rather than white. The edges of the patch may be smooth or irregular. They're sometimes red and inflamed, or there's brownish discolouration (hyperpigmentation). The condition varies from person to person. Some people only get a few small, white patches, but others get bigger white patches that join up across large areas of their skin. == Effects on the body == * color of the skin is lighter because there are no pigments * purple or golden brown patches on and around the eyes, nose, and mouth * puffiness of the middle layer of the eye * whitening or quicker graying of hair * more sensitive to sun This disease can also affect the mental state of the patient. == Cure == As of 2020, doctors do not understand what causes the disease, so right now, it can not be cured. Some things can be done to fight its effects, though. Makeup or cosmetics can cover up the parts of the skin with vitiligo. Also, staying out of the sun to prevent tanning is good. But the treatment given by most skin doctors is cortico steroid cream. Breakthrough discovery in 2004 allowed for the transplant of melanocytes to vitiligo affected areas, repigmenting the region. Rather than just concealing the patches, Ayurvedic treatment for vitiligo is way too harmonious. The Chikitsa procedure emphasizes a thorough analysis of the whole body constitution and varying root cause factors. It mainly involves: === Internal treatment procedure === * The incorporation of certain potent herbs such as Kutki, Neem, Guduchi, Manjistha, Haridra, Triphala, Sariva, Giloy, Khadira, and Yashtimadhu into the daily regime is advised to reclaim the health and glory of the skin. * A complete avoidance of Virudha ahaara is recommended as food for vitiligo to avoid. Which mainly involves non-vegetarian food, excessive dairy, citrus fruits, wheat, spicy, and processed items. Infusion of fresh and water-enriched fruits and vegetables is advised specifically in the form of salads, juices, or warm soups. * A great concentration is laid down on Maansik Shanti (mental calmness). Ayurveda acknowledges that if your mind and body are not in harmony, no medicines, or treatment can work. For such purpose, certain yoga asanas, and meditation therapy is made compulsory. === External treatment procedure === * The application of cow’s ghee, almond oil, virgin coconut oil, and other medicated ointments are instructed, especially to the affected areas in order to keep it nourished. * Panchakarma therapies such as Vamana (Therapeutic emesis), Virechan (purgation), Basti karma (detoxification through herbal decoctions), and Raktamokshana (blood cleansing) are also performed as per ayurvedic guidelines, catering to the disease pattern, and unique body Prakriti of each patient. * Accompanying other natural measures, oral medications are also made imperative in the form of vatti (tablets), churana (powder), and pastes prepared utilizing nature-derived substances. == Famous people with vitiligo == *Michael Jackson told Oprah in a 1993 interview that he had vitiligo. He is the most well known person to have had the disease. A lot of people thought that he was lying. He died in 2009, and his autopsy found that he was telling the truth. Apparently, when it got past the point where makeup could have hidden it, he chose to have the rest of the pigment removed.Pigment loss story *Jon Hamm got vitilgo when he was filmed acting for Mad Men because of stress. ==Related pages== *Albinism == References == Category:Skin problems",
 "title": "Vitiligo"
}