{
 "id": "137789",
 "text": "thumb|right| Oak apple or oak gall is a large, round, gall commonly found on species of oak, 2–5 cm in diameter. They are caused by chemicals injected by the larva of certain kinds of gall wasp in the family Cynipidae A gall is a growth on the surface of plants and other lifeforms. They are caused by various parasites, such as fungi, bacteria, insects and mites. Plant galls are abnormal growths of plant tissues similar to benign tumors or warts in animals. Merriam-Webster Online Dictionary, accessed Nov. 16, 2007 (\"an abnormal outgrowth of plant tissue usually due to insect or mite parasites or fungi and sometimes forming an important source of tannin\") What causes a plant gall can often be known without the actual agent being there. Many types of gall have typical structures. This is true of many galls produced by insects and mites. Insect galls on plants give some herbivorous insects their own microhabitat. They are plant tissue which is controlled by the insect. Galls are the habitat and food source for the maker of the gall. The gall may contain nutritious starch and other tissues.Larson K.C. and T.G. Whitham 1991. Manipulation of food resources by a gall-forming aphid: the physiology of sink-source interactions. Oecologia 88, 15–21. Galls often give the insect physical protection from predators.Weis A.E. and A. Kapelinski 1994. Variable selection on Eurosta’s gall size, II: a path analysis of the ecological factors behind selection. Evolution 48, 734–745.Stone, Graham N. and Schonrogge, Karsten 2003. The adaptive signiﬁcance of insect gall morphology. Trends in Ecology and Evolution 18(10): 512-522. . Insect galls are usually induced by chemicals injected by the larvae or the adults of the insects into the plants. After the galls are formed, the larvae develop inside until fully grown, when they leave. In order to form galls, the insects must seize the time when plant cell division occurs quickly. The growing season, spring in temperate climates, is longer in the tropics. == Human use == Galls can be used by humans, and have been since ancient times. One use is to collect the pigment which many galls make. The galls are rich in resins and tannins, from which dyes and inks can be made. Galls can be used to make a mordant for dyeing: mordants make the dye on the cloth permanent. Also, permanent black ink can be made from galls, and that has been done for a long time. The larvae inside the galls may be used as food or as fishing bait, and some galls have medicinal uses.Zhang J; Li L; Kim S.H; Hagerman A.E, Lü J. 2009. Anti-cancer, anti-diabetic and other pharmacologic and biological activities of penta- galloyl-glucose. Pharmaceutical Research 26(9): 2066–2080. . == References == ==Gallery== File:Diplolepis-rosae.jpg|Rose bedeguar gall on a wild rose in summer. File:Eikengallen op mannelijke bloeiwijze.jpg|Neuroterus albipes forma laeviusculus File:Rhododendron ferrugineum b.JPG|Leaf galls on Rhododendron ferrugineum File:Pineapple gall.JPG|Pineapple gall on Sitka spruce. Category:Plant tissues Category:Parasitism",
 "title": "Gall"
}