{
 "id": "137777",
 "text": "Richard Royce Schrock (born on January 4, 1945) is an American Professor of Chemistry. He was awarded the Nobel Prize for chemistry in 2005 for his work on the metathesis reaction used in organic chemistry. Professor Schrock was born in Berne, Indiana, and went to Mission Bay High School in San Diego, California. He was given a B.A. degree in 1967 from the University of California, Riverside and a Ph.D., in 1971, from Harvard University. At Harvard he was a student of J. A. Osborn. Between 1971 and 1972, he studied at the University of Cambridge with Lord Jack Lewis. In 1972, he began working for George Parshall in the Experimental Station of the E. I. du Pont de Nemours and Company in Wilmington, Delaware. He joined the faculty of the Massachusetts Institute of Technology in 1975 and became a professor in 1980. Schrock now works as the Frederick G. Keyes Professor of Chemistry, at the Massachusetts Institute of Technology (MIT). He has worked there since 1989. Schrock is a member of the American Academy of Arts and Sciences, National Academy of Sciences and was elected to the Board of Overseers of Harvard University in 2007. He married Nancy Carlson in 1971 and has two children, Andrew and Eric. Nancy Schrock is the Thomas F. Peterson, Jr. Conservator of Special Collections for the MIT Libraries. The family live in Winchester, Massachusetts. == Nobel prize == In 2005 Professor Schrock received the Nobel Prize in Chemistry, along with Robert H. Grubbs and Yves Chauvin, for his work on olefin metathesis, which is a method of organic synthesis. Schrock was the first scientist to make sense of 'black box' olefin metathesis. Olefin Metathesis is used when making petroleum and reduces the amount of dirty waste. Professor Schrock's work is continuing with metathesis as well as projects such as dinitrogen fixation and single molecule catalysts which make ammonia from dinitrogen, similar to nitrogenase enzymes in biology. Schrock carbenes are named after Schrock. === Publications === * Schrock, R. R. \"Reduction of Carbon Monoxide. Past Research Summary\", Massachusetts Institute of Technology (MIT), United States Department of Energy, (1982). * Schrock, R. R. \"Chemistry of Bimetallic Linked Cyclopentadienyl Complexes: Progress Report, 1 December 1986 --30 November 1989\", Department of Chemistry at the Massachusetts Institute of Technology (MIT), United States Department of Energy, (1989). * Schrock, R. R. \"Controlled Synthesis of Polyenes by Catalytic Methods. Progress Report, December 1, 1989 -- November 30, 1992\", Department of Chemistry at the Massachusetts Institute of Technology (MIT), United States Department of Energy, (1992). * Schrock, R. R. \"Controlled Synthesis of Polyenes by Catalytic Methods. Progress Report, December 1, 1992 -- November 30, 1993\", Massachusetts Institute of Technology (MIT), United States Department of Energy, (December 1993). == References == == Other websites == * Photograph and life story, from the Office of Scientific and Technical Information, United States Department of Energy * Schrock Research Group * Research Summary * Schrock wins Nobel Prize * http://www.chemistry.msu.edu/Lectureships/lectures.asp?series=DK&Year;=2001 * Richard R. Schrock Patents * UC Newswire story on Nobel Prize Category:American chemists Category:American Nobel Prize winners Category:Scientists from Indiana Category:Scientists from San Diego Category:1945 births Category:Living people",
 "title": "Richard R. Schrock"
}