{
 "id": "13773",
 "text": "Bhutan (officially called Kingdom of Bhutan) is a small landlocked country in the Himalaya mountains of South Asia. It is ruled by King Jigme Khesar Namgyel Wangchuck, who has been king since 2006. Bhutan was founded in 1644 by Shabdrung Ngawang Namgyel. The Bhutanese people are proud that they have always been an independent country. Bhutan's capital city is Thimphu. The official language is Dzongkha. About 700,000 people live in Bhutan. The people and government of Bhutan are proud of their culture which is based on Tibetan Buddhism. 97% of Bhutan's people are Buddhist. Until 1974, Bhutan was closed to the outside world. Now people can visit the country, but only in small numbers. The only airport is in Paro District. The country is bordered on the south by the Republic of India and on the north by China. The Indian state of Sikkim separates Bhutan and Nepal. The main export of Bhutan is hydroelectricity which is sold to India. The economy of Bhutan is very small but is growing quickly. The currency is the Ngultrum, which is pegged at par with the Indian rupee. Bhutan is the only carbon-neutral and carbon-negative country in the entire world. == National symbols of Bhutan == File:Corvus corax (NPS).jpg|National bird of Bhutan File:CupressusCashmerianaSochi.JPG|National tree of Bhutan File:Blue Poppy Meconopsis sp Pair 1000px.jpg|National flower of Bhutan == Landscape == File:082 - Gangkar Puensum - 7,570m (Dochula pass) (4677022812).jpg|Gangkhar Puensum, the highest mountain in Bhutan File:Himalayan Landscape.jpg|The Subalpine landscape common in Bhutan File:Himalayan peak from Bumthang.jpg|A Himalayan mountain seen from the town of Bumthang File:Jigme Dorji National Park, Bhutan.JPG|Jigme Dorji National Park File:HaaValley.jpg|The Haa Valley in Western Bhutan == Military == The Royal Bhutan Army is Bhutan's military service. It includes the Royal Bodyguard and the Royal Bhutan Police. Membership is voluntary, and the minimum age for recruitment is 18. The standing army numbers about 16,000 and is trained by the Indian Army. Being a landlocked country, Bhutan has no navy. It also has no air force or army aviation corps. The Army relies on Eastern Air Command of the Indian Air Force for air assistance. == Wildlife == More than 770 species of bird and 5,400 species of plants are known to occur throughout the kingdom. Bhutan has a rich primate life with rare species such as the golden langur. == Administrative divisions == Bhutan is divided into 20 districts. Locally these are named dzongkhags. The districts are: *Bumthang *Chhukha *Dagana *Gasa *Haa *Lhuentse *Mongar *Paro *Pema Gatshel *Punakha *Samdrup Jongkhar *Samtse *Sarpang *Thimphu *Trashigang *Trashi Yangtse *Trongsa *Tsirang *Wangdue Phodrang *Zhemgang ===Cities=== The major cities of Bhutan are: * Thimphu, the largest city and capital of Bhutan * Damphu, the administrative headquarters of Tsirang District * Jakar, the administrative headquarters of Bumthang District and the place where Buddhism entered Bhutan * Mongar, the eastern commercial hub of the country * Paro, site of the international airport * Phuentsholing, Bhutan's commercial hub * Punakha, the old capital * Samdrup Jongkhar The south eastern town on the border with India * Trashigang, administrative headquarters of Trashigang District the most populous district in the country * Trongsa, in central Bhutan which has the largest and the most magnificent of all the dzongs in Bhutan == Sports == Bhutan's national sport is archery. Competitions are held regularly in most villages. Cricket has gained popularity in Bhutan, particularly since the introduction of television channels from India. The Bhutan national cricket team is one of the more successful affiliate nations in the region. Football is also an increasingly popular sport. == Related pages == *Bhutan at the Olympics *Bhutan national football team *List of rivers of Bhutan == References == == Other websites == * * Category:Current monarchies Category:Monarchies of Asia",
 "title": "Bhutan"
}