{
 "id": "137849",
 "text": "Jeep is a brand of American automobiles that is a division of FCA US LLC (formerly Chrysler Group, LLC), a wholly owned subsidiary of Fiat Chrysler Automobiles. The former Chrysler Corporation acquired the Jeep brand, along with the remaining assets of its owner American Motors, in 1987. Jeep's current product range consists solely of sport utility vehicles and off-road vehicles, but has also included pickup trucks in the past. 1941 The original Jeep was the prototype Bantam BRC. Willys MB Jeeps went into production in 1941 specifically for the military. Arguably that makes them the oldest four- wheel drive mass-production vehicles now known as SUVs. The Jeep became the primary light 4-wheel-drive vehicle of the United States Army and the Allies during World War II. It remained so in the postwar period. The term became common worldwide in the wake of the war. Doug Stewart notes: :The spartan, cramped, and unstintingly functional jeep became the ubiquitous World War II four-wheeled personification of Yankee ingenuity and cocky, can-do determination.\" The first civilian models were produced in 1945. It inspired a number of other light utility vehicles, such as the Land Rover. Many Jeep variants serving similar military and civilian roles have since been designed in other nations. In 2007 Jeep began manufacturing crossover SUVs with its Compass and Patriot models. This led to the 2013 Jeep Cherokee midsize crossover. ==Current models== Body style Model Current generation Vehicle description Image Name(s) Introduction ( year) Model code Introduction ( year) Main markets Body-on-frame SUV Grand Wagoneer 2021 WS 2021 North America Full-size SUV (Wagoneer), full- size luxury SUV (Grand Wagoneer). Long-wheelbase version is known as the Wagoneer L and Grand Wagoneer L. Wagoneer Wrangler 1986 JL 2017 Global Compact SUV (2-door), mid-size SUV (Unlimited and 4-door). PHEV version available as the Wrangler 4xe. Wrangler Unlimited Crossover SUV Avenger 2022 JJ 2023 (JJ) Europe, etc. Subcompact SUV. Mild hybrid and BEV are available. Compass 2007 * MP * M1 * M4 * M6 2018 (MP) Global Compact crossover SUV smaller than the Cherokee. PHEV version is available. Commander/ Meridian 2021 * H1 * H6 2021 (H1/H6) Latin America, India Mid-size crossover SUV based on the Compass produced in Brazil and India. Named the Meridian in India. Grand Cherokee 1992 WL 2021 North America, etc. Mid-size crossover SUV. Long-wheelbase version is known as the Grand Cherokee L. PHEV version is available for the short-wheelbase model. Grand Cherokee L Renegade 2014 * BU * B1 * BQ 2014 Global Wagoneer S 2024 2024 North America, etc. BEV crossover SUV based on STLA Large platform. Pickup truck Gladiator 2019 JT 2019 Global Mid-size pickup truck based on the Jeep Wrangler (JL). ==Notes== == References == ==Other websites== Category:American automobile companies Category:Sport utility vehicles Category:1941 establishments in the United States Category:Companies based in Ohio Category:Toledo, Ohio Category:Stellantis",
 "title": "Jeep"
}