{
 "id": "137965",
 "text": "In cryptography, the International Data Encryption Algorithm (IDEA) is a block cipher designed by Xuejia Lai and James Massey of ETH Zurich in 1991. It was meant to be a replacement for the Data Encryption Standard. IDEA is much like an earlier cipher called Proposed Encryption Standard (PES), but with some improvements. Because of this, IDEA was first called IPES (Improved PES). The cipher was patented in a number of countries for a long period of time. The name \"IDEA\" is also a trademark. The patents expired in 2010–2011, so it is now free for everyone to use. IDEA was licensed worldwide by a company called MediaCrypt. IDEA was used in Pretty Good Privacy (PGP) v2.0 after the cipher used in v1.0, BassOmatic, was found to be breakable. IDEA can be used with the OpenPGP standard. == How it works == IDEA operates on 64-bit blocks, using a 128-bit key. It contains a series of eight identical transformations (rounds) and one output transformation (the half-round). It does this for a total of 8.5 rounds. The processes for encryption and decryption are similar. IDEA derives much of its security by interleaving operations from different groups — modular addition and multiplication, and bitwise eXclusive OR (XOR) — which are chosen to be \"algebraically incompatible\". Each of the eight round uses six sub-keys, while the half-round uses four; for a total of 52 sub-keys. Each sub-key is a 16-bit in length. The first eight sub-keys are extracted directly from the 128-bit key, with K1 being the lowest sixteen bits and K8 is the highest sixteen bits; further groups of eight keys are created by rotating the main key left 25 bits after the creation of the previous group; six rotations generate all sub-keys. === Security === The makers looked at IDEA to measure (look at the size of) its strength against differential cryptanalysis and found out that it is unsusceptible only under specific assumptions. No successful linear or differential attacks have been seen. Some types of weak keys have been found — like (Daemen et al., 1994) — but these are not very important, being so rare that they can be specifically avoided. As of 2007, the best attack which applies to all keys can break IDEA if reduced to 6 rounds (the full IDEA cipher uses 8.5 rounds). In 1996, Bruce Schneier wrote about IDEA, \"In my opinion, it is the best and most secure block algorithm available to the public at this time.\" (Applied Cryptography, 2nd ed.) However, by 1999 he was no longer recommending IDEA due to the presence of faster cryptographic algorithms, some progress in its cryptanalysis, and the problem of patents. == Availability == A patent application for IDEA was first used in Switzerland (CH A 1690/90) on May 18, 1990, then an international patent application was used under the Patent Cooperation Treaty on May 16, 1991. Patents were eventually given in Austria, France, Germany, Italy, the Netherlands, Spain, Sweden, Switzerland, the United Kingdom, (European Patent Register entry for European patent no. 0482154, asked May 16, 1991, given June 22, 1994 and stopped working on May 16, 2011), the United States (U.S. patent 5,214,703, given May 25, 1993 and stopped working January 7, 2012) and Japan (JP 3225440, stopped working on May 16, 2011). MediaCrypt AG has made a successor to IDEA and focuses on its new cipher (official release in May 2005) IDEA NXT, which was before this named FOX. ==References== * J. Daemen, R. Govaerts, and J. Vandewalle, Weak keys for IDEA , CRYPTO '93. pp224–231. * Hüseyin Demirci, Erkan Türe, Ali Aydin Selçuk, A New Meet in the Middle Attack on The IDEA Block Cipher, 10th Annual Workshop on Selected Areas in Cryptography, 2004. * Xuejia Lai and James L. Massey, A Proposal for a New Block Encryption Standard, EUROCRYPT 1990, pp389–404 * Xuejia Lai and James L. Massey and S. Murphy, Markov ciphers and differential cryptanalysis, Advances in Cryptology — Eurocrypt '91, Springer-Verlag (1992), pp17–38. * Eli Biham, Orr Dunkelman, Nathan Keller, A New Attack on 6-round IDEA, Fast Software Encryption Workshop, 2007. ==Other websites== * RSA FAQ on Block Ciphers * SCAN entry for IDEA * IDEA in 448 bytes of 80x86 * IDEA Applet Category:Cryptography",
 "title": "International Data Encryption Algorithm"
}