{
 "id": "138070",
 "text": "Sir Sultan Muhammed Shah, known as Aga Khan III, GCSI, GCMG, GCIE, GCVO, PC (2 November 1877–11 July 1957) was the 48th Imam of the Nizari Ismaili sect of Shia Islam. He was one of the founders and the first permanent president of the All-India Muslim League (AIML). He was nominated to represent India at the League of Nations in 1932 and served as President of the League of Nations from 1937 to 1938. He was born in Karachi during the British Raj in 1877. He was given a religious education. After Eton College, he went on to study at the University of Cambridge. The distinction of Knight Commander of the Indian Empire (KCIE) was conferred upon him by Queen Victoria in 1897. In 1934, he was made a member of the Privy Council. The Aga Khan travelled to distant parts of the world to receive the homage of his followers, with the objective either of settling differences or of advancing their welfare through financial help and personal advice and guidance. During his 72 years of Imamat (1885–1957), the community celebrated his Golden (1937), Diamond (1946), and Platinum (1954) Jubilees. To show their appreciation and affection, the community weighed their Imam in gold, diamonds, and, symbolically, platinum, respectively, the proceeds of which were used to further develop major social welfare and development institutions in Asia and Africa. Schools were set up in the remote northern areas of what is now Pakistan. == His choice of successor == Aga Khan III was succeeded as Aga Khan by his grandson Karim Aga Khan, who is the present Imam. == Marriages == *He married on November 2, 1896, in Pune, India, Shahzadi Begum. *He married in 1908, Cleope Teresa Magliano (1888–1926). They had two sons: Prince Giuseppe Mahdi Khan (d. February 1911) and Prince Aly Khan (1911–1960). She died in 1926, following an operation on December 1, 1926. *He married on 7 December 1929 (civil), in Aix- les-Bains, France, and 13 December 1929 (religious), in Bombay, India, Andrée Joséphine Carron (1898–1976). A co-owner of a dressmaking shop in Paris, she became known as Princess Andrée Aga Khan. By this marriage, he had one son, Prince Sadruddin Aga Khan (1933–2003). The couple was divorced in 1943. *He married on October 9, 1944, in Geneva, Switzerland, Yvonne Blanche Labrousse. She had been his social secretary. == Mausoleum == The Aga Khan's mausoleum is near the Nile at Aswan, Egypt. Category:1877 births Category:1957 deaths Category:Knights Grand Commander of the Order of the Indian Empire Category:Knights Grand Commander of the Order of the Star of India Category:Knights Grand Cross of the Order of St Michael and St George Category:Knights Grand Cross of the Royal Victorian Order Category:Leaders of All India Muslim League Category:Members of the Privy Council of the United Kingdom",
 "title": "Aga Khan III"
}