{
 "id": "138110",
 "text": "The flag of Azerbaijan () is one of the national symbols of Azerbaijan and consists of three equal horizontal bands, from top: blue, red, and green; a white crescent and an eight-pointed star are centered in the red band.Complete Flags of The World, 1997, page 172, Dorling Kindersley The official colours and size were adopted on February 5, 1991. The flag is used on land as the civil, state and war flag, and at sea as the civil, state and naval ensign and naval jack. The specific shades of the national flag were laid out in a 2004 law. The Cyan blue color at the top of the flag stands for Azerbaijan’s Turkic heritage, the red in the middle stands for Azerbaijan’s desire to create a modern society and the green at the bottom of the flag symbolizes Azerbaijan’s Islamic civilization. The eight point star on Azerbaijan’s flag stands for the eight original Turkic peoples - the Azerbaijani’s, Ottomans, Jagatais, Tatars, Kazakhs, Kipchaks, Seljuqs and the Turkmen. == History == The Azerbaijani flag was first created by the Azerbaijani nationalist Alī bay Huseynzada. He originally used it to promote Azerbaijani independence from the Tsarist Russian Empire. He exhorted his followers to “Turkify, Islamicize and Europeanize” in order to emphasize ethnic pride, religious devotion and modernization. The flag was first adopted by his Musavat party in 1917. The modern Azerbaijani flag was first adopted in 1918 and served as the flag of Azerbaijan from 1918 until the Bolshevik conquest of Azerbaijan in 1920. The flag then became popular again in early 1989, as a way of protesting against the failure of the soviet government to protect them from Armenian attacks on their territory. The flag was officially readopted on February 5, 1991 - it continued in use after Azerbaijan’s independence on August 30th, 1991. Note - both the 1st and 2nd Azerbaijani republics used the Turkish flag briefly == References == Category:Flags of Azerbaijan Flag Azerbaijan Category:Flags introduced in 1918",
 "title": "Flag of Azerbaijan"
}