{
 "id": "138290",
 "text": "American Dad! is an American adult animated sitcom produced by Underdog Productions, Fuzzy Door Productions and 20th Television. The series was first made by Seth MacFarlane, the creator of Family Guy, as well as two writers, Mike Barker and Matt Weitzman. It was distributed in the United States by Fox. It premiered on February 6, 2005. It was produced as part of Super Bowl XXXIX. The regular series began on May 1, 2005, after the season premiere of Family Guy. The series follows the events of CIA agent Stan Smith and his family. Stan Smith is a CIA agent who is very patriotic, as well as being part of the Christian right. Stan tries to be in charge of the family, but often the things he does don't work out. Stan has a wife, Francine, and two kids, Hayley and Steve. Hayley (Haylee) is in college and is much more liberal than her father. Steve is in high school and is always dreaming about girls. Rounding out the family is Klaus, a talking fish with a German athlete's brain; and Roger Smith the Alien. The show originally ran on Fox from 2005 to 2014, when the series moved to TBS for its eleventh and twelfth seasons. On Marches 22nd, 2025, It was revealed that the show was returning to Fox for its twentieth season. ==Voice cast== * Seth MacFarlane as Stan Smith, Roger Smith, Additional Voices * Wendy Schaal as Francine Smith * Rachael MacFarlane as Hayley Smith, Additional Voices * Scott Grimes as Steve Smith * Dee Bradley Baker as Klaus, Additional Voices * Kevin Michael Richardson as Principal Luis Brown, Additional Voices * Patrick Stewart as Avery Bullock * Jeff Fischer as Jeff Fischer Category:2005 American television series debuts Category:2000s American animated television series Category:2010s American animated television series Category:Adult animated television series Category:Adult Swim Category:2020s American animated television series Category:2010s American sitcoms Category:Fox television series Category:English-language television programs",
 "title": "American Dad!"
}