{
 "id": "138237",
 "text": "This list of sex positions is a list of different ways to have sexual intercourse and other sexual acts. == Intercourse == These positions involve a penis going into a vagina, or the anus. === On top with front entry === These positions are used for vaginal, or anal sex. The basic position is called the missionary position. In it, the receiving partner lies on their back with legs apart. The penetrating partner lies on top of the receiving partner, facing them. The penetrating partner enters so that the base of the penis rubs the clitoris. === From behind === Most of these positions can be used for either vaginal, or anal sex. The receiving partner is kneeling or on all four limbs. The penetrating partner inserts their penis from behind. This position is sometimes called as the doggy style position. === On top === Most of these positions can be used for either vaginal, or anal sex. The receiving partner is on their hands and knees with their bottom exposed. The penetrating partner then pumps away at the receiving partner's vagina or anus with his penis. === Sitting and kneeling === Most of these positions can be used for either vaginal, or anal sex. The penetrating partner sits down, with their legs stretched out. The receiving partner sits on top and wraps their legs around the penetrating partner. This is called pounding on the spot. === Standing === In the basic standing position, both partners stand facing each other and have vaginal sex. The shorter partner can stand on a stair if the partners are different heights. It may be easier if the person being penetrated has their back to a wall. Partners can also face the same direction while having sex. *The so-called Ekiben position is very similar, but the penetrating partner holds the receiving partner. In the reverse Ekiben position the receiver faces away from the penetrator. Ekiben is a Japanese word that usually refers to vendors who carry around boxes of food in the same way one partner carries the other in the sex position. *In other standing positions, one partner may sit or lie on something while the other stands. === Anal === Most of the above positions can be used for anal sex. * From behind. This position is good for thrusting. * On top with front entry. The penetrating partner is between the receiving partner's legs. This position is good for beginners, because it allows them to relax. === Less common positions === * The non-active partner is on the bottom. The active partner lies on top at a right angle to them. * The penetrating partner lies on their back, legs spread. The receiving partner is on their back on top of the penetrator, legs spread, facing the opposite direction. * The penetrator and the receiver lie on their backs, heads pointed away from one another. Each places one leg on the other's shoulder (as a brace) and the other leg out somewhat to the side. * The non-active partner lies on their back with knees up and legs apart. The active partner lies on their side at a right angle to the receiver, with their hips under the arch formed by their partner’s legs. Sometimes called the T-square. * The receiving partner's legs are together turning to one side while looking up towards the penetrator, who has spread legs and is kneeing straight behind the other's hips. The penetrator's hands are on the other's hips. This position can be called the Modified T-square.The Modified T-square is Position 17 at Sensual Interactive * The receiving partner lies on their back with the penetrating partner lying perpendicular. The receiving partner bends the knee closest to the penetrating partner's head enough so that there is room for the penetrating partner's waist to fit beneath it, while the penetrating partner's legs straddle the receiving partner's other leg. The in-and-out thrusting action will move more along a side-to-side rather than top-to-bottom axis. This position allows for breast stimulation during sex, for partners to maintain eye contact if they wish, and for a good view of both partners as they reach orgasm. * The penetrating partner sits on edge of a bed or chair with feet spread wide on floor. The receiving partner lays on their back on the floor and drapes their legs and thighs over the legs of the penetrating partner. The penetrating partner holds the knees of the receiving partner and controls thrusts. * The Seventh Posture in The Perfumed Garden is a rare position not talked about in other old sex manuals. The passive person lies on their side. The active person then faces them, sitting on their partner’s lower leg, and holds up their partner’s upper leg. Some people have called this position \"for acrobats and not to be taken seriously,\"Hooper, Anne J., \"Anne Hooper's Kama Sutra\". DK Publishing. 1st ed., 1998. ISBN 1-56458-649-9, 160 pages. while others have enjoyed it and said it is good for sex while pregnant. * The penetrator straddles one of the legs of the receiver, who is lying on their side. * The piledriver is a position sometimes seen in porn videos. It is described in many ways by different sources. In a straight context, the woman lies on her back, then raises her hips as high as possible, so that the man can enter her vagina or anus. The position is difficult because it is hard on the woman’s neck, so cushions should be used to support her. * Another postition has the man laying on his back with the woman on top of him on her back. * Another postition is both the man and woman lay on their backs away for each other but have pubic areas in contact with each other. ===Gallery=== File:Wiki-spoons-sp.png|Spooning position File:Wiki-Wiener- auster.png|Missionary position with bent knees file:Wiki-cowgirl.svg|Cowgirl position File:Wiki-T-square.png|T-square File:Doggy_style_from_behind.png|Doggy style sex viewed from behind File:Thomas Rowlandson (3).jpg|Standing sex, by Thomas Rowlandson File:Wiki- standing.png|Ekiben position File:Reverse Ekiben update.png|Reverse Ekiben position File:Seventh Posture.png|The “seventh posture” == Outercourse == Outercourse is sometimes part of foreplay, or to avoid intercourse. * Dry humping – similar to sex, but with clothes on. * Handjob – Rubbing a partner's penis. * Footjob – using the feet to rub the penis. * Mammary intercourse – using the breasts to rub the penis. * Armpit Sex - placing the penis on the axilla. === Genital-genital sex === Genital-genital sex, sometimes called GG rubbing, is when two people rub penises together (sometimes called frot, or frottage), or when two people rub vulvae together (sometimes called tribadism, or scissoring). == Oral sex == Oral sex is the term given to genital stimulation by the mouth. People may engage in oral sex as part of foreplay before intercourse, or during, or following intercourse. It may also be performed for its own sake. === Fellatio === Fellatio is a kind of oral sex that involves a person letting their penis be licked, or \"eaten\" by their partner. The person's partner can be any gender, or sex. There are several ways to have oral sex. * The person with male genitalia lies on their back while their partner kneels between their legs. * The person with male genitalia lies on their back while their partner lies off to the side of their legs. * The person with male genitalia sits in a chair and their partner kneels in front of them between their legs. * The person with male genitalia stands while their partner either kneels in front of them or sits (in a chair or on the edge of a bed, etc.) and bends forward. * The person with male genitalia's partner lies on their back with their mouth open and the person with male genitalia lies so that their penis is in their partner's mouth. Note: Fellatio doesn't have to involve two people. Some people with male genitalia have a long-enough penis and a good enough stretch to lick or put their own penis into their mouth. However, this is called autofellatio or autofellation. === Cunnilingus === Cunnilingus is oral sex involving a person's female genitals. There are several ways to have oral sex. * One partner lies on their back as in the missionary position. The active partner lies on their front between the first partner's legs. * The active partner sits. The other partner stands facing away and bends at the hips. * The active partner sits. The other partner stands or squats facing towards partner. * The partner sits on the bed with their legs open, the active partner kneels in front of them. * The active partner lies on their back while the other sits on the active partner's mouth. === 69 === Main article: 69 (sex position) Oral sex between two people at the same time is called 69. Partners can be lying side-by-side, lying one on top of the other, or standing with one partner holding the other upside down. === Anilingus === Positions for anilingus, also known as \"rimming\", \"anal-oral sex\", or \"rimjob\" are: * One partner is on all fours. The active partner is behind them. * A partner is on their back with their legs up. == Group sex == === More than one person with male genitalia === When three people have sex with each other, it is called a threesome. You can have: * One person giving oral sex to either of the other two partners while they engage in intercourse. * A person with male genitalia has vaginal or anal sex with one partner, while themselves being anally penetrated by another. * A participant has vaginal or anal sex with one partner, and both have oral sex with a third. ==== Multiple penetration ==== Multiple penetration, or double penetration means someone is penetrated in more than one place. Types of double penetration are: * Two penises in the anus. This is called double anal * Two penises in the vagina. This is called double vagina * One penis in the vagina and the other in the anus. This is called DP or double penetration * Simultaneous penetration of the mouth and either the vagina, or anus. If the penetrating objects are penises, this is sometimes called the spit roast. === With many people === * A group of people with male genitalia masturbating is called a circle jerk. * A group of people with male genitalia ejaculating on one person's face is called bukkake. * A group of at least two people, two or more of which are people with female genitalia, each having oral sex, is called a daisy chain. * Four or more parties is considered an orgy. ==Related pages== * Sex * Kama Sutra == Other websites == * sexinfo101.com - All sex positions Positions Category:Lists",
 "title": "List of sex positions"
}