{
 "id": "138424",
 "text": "Global apartheid is a term used to mean the worldwide control of resources, the economy, and government by an ethnic minority. The term comes from apartheid, a governmental system that ruled South Africa in which the Afrikaners, or \"whites\", controlled most of the resources and where non-whites were denied access to these resources. Apartheid or 'separate development' was introduced by the National Party after the 1948 election to protect European interests and identity by enforcing separation between the 'races'.Alexander, Titus (1996). Unravelling Global Apartheid: an Overview of World Politics. Cambridge: Blackwell Publishers ltd. p. 11 The term is often used to describe the gap between whites and nonwhites, and global socioeconomic inequality, the existence of which has been proven by statistics. As in South Africa, there is a hierarchy of group rights in the world: # citizens of the US, UK and France, with veto powers in the Security Council, NATO and IMF, World Bank and global economic regimes; # OECD and Western Alliance, who have the vote, access to courts and Western solidarity; # other independent states represented on a regional basis and party to human rights conventions # independent states which do not adhere to human rights conventions; # occupied territories and peoples without states; # refugees, asylum-seekers and stateless person. Although not explicitly classified by race, this hierarchy is banded by colour. Nationality laws of most countries, and the European Union, explicitly enshrine this ‘classification'. European countries control most of the world's technology and weapons, and 20% of the global population, the richest percentage, take in 71.3% of income. Although most people of the world are not white, thereby making whites a minority, this minority often holds power in society.Haviland, William (1993). Cultural Anthropology. Vermont: Harcourt Brace Jovanovich College Publishers. p. 250-252. Most Western countries have laws against racial discrimination and active anti-racist movements, however much Western thought, law and action are exclusive, operating through institutional and indirect discrimination rather than overt racism. Their system of exclusion are more sophisticated, this prevents the West from exercising unconditional power in international affairs.Alexander, Titus (1996). Unravelling Global Apartheid: an Overview of World Politics. Cambridge: Blackwell Publishers ltd. p. 6 The term apartheid was famously used by Thabo Mbeki, the then-President of South Africa, in a 2002 speech, drawing comparisons the modern-day status of the world's people, economy, and access to natural resources to the apartheid era. Mbeki got the term from the book Unravelling Global Apartheid (1996) by Titus Alexander, initiator of Charter 99, a campaign for global democracy, who was present at the UN Millennium Summit. ==References== Category:International politics",
 "title": "Global apartheid"
}