{
 "id": "138483",
 "text": "The Daily Show is an Emmy Award-winning news parody television program. It airs each Monday through Thursday on Comedy Central in the United States. The half-hour long program was first shown on Monday, July 22, 1996. It was first hosted by Craig Kilborn. Kilborn acted as its anchorman until December 1998. Jon Stewart took over as host in January 1999. Many changes were made to the program at that time. Stewart retired in 2015. The show will be hosted by South African comedian Trevor Noah in September 2015. Under Stewart, The Daily Show has become more strongly focused around politics and the national media. It is much different to the more character-driven comedy which was shown more during Kilborn's time on the program. Stewart's final broadcast aired on August 6, 2015. There have been many other on-air contributors to The Daily Show with some called \"correspondents\", including Dave Attell, Stephen Colbert, Steve Carell, Ed Helms, Rob Corddry, Susie Essman, Olivia Munn, Buck Henry, Lewis Black, Kristen Schaal, Larry Wilmore, and John Oliver. == Opening segment == Each episode begins with announcer Drew Birns announcing the date and the introduction, \"From Comedy Central's World News Headquarters in New York, this is The Daily Show with Trevor Noah\". Previously, the introduction was \"This is The Daily Show, the most important television program, ever.\" The host then opens the show with a monologue drawing from current news stories and issues. Previously, the show had divided its news commentary into sections known as \"Headlines\", \"Other News\", and \"This Just In\"; these titles were dropped from regular use on October 28, 2002, and were last used on March 6, 2003. Some episodes will begin with a 1–3 minute intro on a small story (or small set of stories) before fully transitioning into the main story of the night. == Correspondent segments == The monologue segment is often followed by a segment featuring an exchange with a correspondent, either at the anchor desk with the host or reporting from a false location in front of a greenscreen showing stock footage. They typically present absurd or humorously exaggerated takes on current events against the host's straight man. Some correspondent segments involve the show's members travelling to different locations to file comedic reports on current news stories and conduct interviews with people related to the featured issue. Correspondents are typically introduced as the show's \"senior\" specialist in the story's subject, and can range from relatively general (such as Senior Political Analyst) to absurdly specific (such as Senior Religious Registry Correspondent). The cast of correspondents is quite diverse, and many often sarcastically portray extreme stereotypes of themselves to poke fun at a news story, such as \"Senior Latino Correspondent\", \"Senior Youth Correspondent\" or \"Senior Black Correspondent\". Former correspondents John Oliver and Wyatt Cenac at the launch of Earth (The Book): A Visitor's Guide to the Human Race While correspondents stated to be reporting abroad are usually performing in-studio in front of a greenscreen background, on rare occasions, cast members have recorded pieces on location. For instance, during the week of August 20, 2007, the show aired a series of segments called \"Operation Silent Thunder: The Daily Show in Iraq\" in which correspondent Rob Riggle reported from Iraq. In August 2008, Riggle traveled to China for a series of segments titled \"Rob Riggle: Chasing the Dragon\", which focused on the 2008 Beijing Olympics. Jason Jones traveled to Iran in early June 2009 to report on the Iranian elections, and John Oliver traveled to South Africa for the series of segments \"Into Africa\" to report on the 2010 FIFA World Cup. In March 2012, Oliver traveled to Gabon, on the west African coast, to report on the Gabonese government's decision to donate $2 million to UNESCO after the United States cut its funding for UNESCO earlier that year. On July 19, 2016, Roy Wood Jr. reported live from the Republican National Convention and talked about Donald Trump's African-American support. Topics have varied widely; during the early years of the show, they tended toward character-driven human interest stories such as Bigfoot enthusiasts. Since Stewart began hosting in 1999, the focus of the show has become more political and the field pieces have come to more closely reflect current issues and debates. Under Kilborn and the early years of Stewart, most interviewees were either unaware or not entirely aware of the comedic nature of The Daily Show. However, as the show began to gain popularity—particularly following its coverage of the 2000 and 2004 presidential elections—most of the subjects now interviewed are aware of the comedic element. == Recurring segments == Main article: List of The Daily Show recurring segments Some segments have recurred periodically throughout different tenures, such as \"Back in Black\" (segments hosted by comedian Lewis Black) & \"Your Moment of Zen\". Since the 2003 invasion of Iraq, a common segment of the show has been dubbed \"Mess O' Potamia\", focusing on the United States' policies in the Middle East, especially Iraq. Elections in the United States were a prominent focus in the show's \"Indecision\" coverage throughout Stewart & Noah's time as host (the title \"InDecision\" is a parody of NBC News' \"Decision\" segment). Since 2000, under Stewart's tenure, the show went on the road to record week-long specials from the cities hosting the Democratic and Republican National Convention. For the 2006 U.S. midterm elections, a week of episodes was recorded in the contested state of Ohio. The \"Indecision\" & \"Democalypse\" coverage of the 2000, 2002, 2004, 2006, 2008, 2010, 2012, 2014, 2016 elections all culminated in live Election Night specials. With Noah as host, one new recurring segment has been \"What the Actual Fact\", with correspondent Desi Lydic examining statements made by political figures during speeches or events. Under Noah, the continuation of \"Democalypse\" and \"Indecision\" also took place with live shows after the Republican National Convention and Democratic National Convention. For the first time, under Noah, the show also went live after all three U.S. presidential debates in 2016. == Interviews == In the show's third act, the host conducts an interview with a celebrity guest. Guests come from a wide range of cultural sources, and include actors, musicians, authors, athletes, pundits, policy experts and political figures. During Stewart's tenure, the show's guests tended away from celebrities and more towards non-fiction authors and political pundits, as well as many prominent elected officials. In the show's earlier years it struggled to book high-profile politicians. (In 1999, for an Indecision 2000 segment, Steve Carell struggled to talk his way off Republican candidate John McCain's press overflow bus and onto the Straight Talk Express).[citation needed] However its rise in popularity, particularly following the show's coverage of the 2000 and 2004 elections, made Stewart according to a Rolling Stone (2006) article, \"the hot destination for anyone who wants to sell books or seem hip, from presidential candidates to military dictators\". Newsweek labeled it \"the coolest pit stop on television\". Prominent political guests have included U.S. President Barack Obama, Vice President Joe Biden, former Presidents Jimmy Carter and Bill Clinton, former British Prime Ministers Tony Blair and Gordon Brown, former Pakistani President Pervez Musharraf, former Liberian President Ellen Johnson Sirleaf, Bolivian President Evo Morales, Jordanian King Abdullah II, Estonian Prime Minister Taavi Roivas, Canadian Prime Minister Justin Trudeau and former Mexican President Vicente Fox. The show has played host to former and current members of the Administration and Cabinet as well as members of Congress. Numerous presidential candidates have appeared on the show during their campaigns, including John McCain, John Kerry, Barack Obama and Hillary Clinton. == Closing segment == In a closing segment, there is a brief segue to the closing credits in the form of the host introducing \"Your Moment of Zen\", a humorous piece of video footage without commentary that has been part of the show's wrap-up since the series began in 1996. The segment often relates to a story covered earlier in the episode, but occasionally is merely a humorous or ridiculous clip. Occasionally, the segment is used as a tribute to someone who has died. Sometimes, before the \"Your Moment of Zen\", this segment is used for quick promotions. The host might promote the show that follows right after their broadcast, such as promoting the show @midnight. This time has also been used to promote films, books or stand-up specials that are affiliated with the host. In October 2005, following The Colbert Report's premiere, a new feature (sometimes referred to as the toss) was added to the closing segment in which Stewart would have a short exchange with \"our good friend, Stephen Colbert at The Colbert Report\", which aired immediately after. The two would have a scripted comedic exchange via split-screen from their respective sets. In 2007, the \"toss\" was cut back to twice per week, and by 2009 was once a week before gradually being phased out. It was used on the 2014 mid-term election night and again just before the final episode of The Colbert Report on December 18, 2014, and returned upon the premiere of The Nightly Show with Larry Wilmore. Stewart then regularly tossed to Wilmore at the end of his Monday night episodes. Under Noah, the \"toss\" has been used for The Opposition with Jordan Klepper and Lights Out with David Spade. == Studio == Outside of the Daily Show studio, pictured in 2007, during Stewart's tenure The host sits at his desk on the elevated island stage in the style of a traditional news show. The show relocated from its original New York studio in late-1998 to NEP Studio 54 in New York City's Hell's Kitchen neighborhood, where it remained until 2005, when the studio was claimed by The Colbert Report. On July 11, 2005, the show premiered in its new studio, NEP Studio 52, at 733 11th Avenue, a few blocks west of its former location. The set of the new studio was given a sleeker, more formal look, including a backdrop of three large projection screens. The traditional guests' couch, which had been a part of the set since the show's premiere, was done away with in favor of simple upright chairs. The change was initially not well-received, spawning a backlash among some fans and prompting a \"Bring Back the Couch\" campaign. The campaign was mentioned on subsequent shows by Stewart and supported by Daily Show contributor Bob Wiltfong. The couch was eventually featured in a sweepstakes in which the winner received the couch, round-trip tickets to New York, tickets to the show, and a small sum of money. The sign over the entryway of the current Daily Show studio On April 9, 2007, the show debuted a new set. The projection screens were revamped (with one large screen behind Stewart, while the smaller one behind the interview subject remained the same), a large, global map directly behind Stewart, a more open studio floor, and a J-shaped desk supported at one end by a globe. The intro was also updated; the graphics, display names, dates, and logos were all changed. Outside of the Daily Show studio, pictured in 2019, during Noah's tenure On September 28, 2015, the show debuted a new set alongside the debut of Trevor Noah's tenure. According to Larry Hartman, Noah took a lot of inspiration from Stewart's set. A second on-stage 'jumbo-tron' was added and the colours of the set were made lighter. The graphics, intro, theme music, lower thirds, logo, etc. were also all revamped. On July 19, 2016, the set and graphics were given another change to reflect Democalypse 2016 and denote The Daily Show's RNC and DNC coverage (which was taped in the conventions' respective cities). The new temporary sets had a Washington theme, and was meant to show that Washington is \"a little broke\" and needs \"repair\". Though the studio was reverted to its former self after the election week in 2016, the changes to the graphics were kept. Since March 2020, due to the pandemic, the studio has been closed and the show has been filmed from Noah's apartment. == Production == The show's writers begin each day with a morning meeting where they review material that researchers have gathered from major newspapers, the Associated Press, cable news television channels and websites, and discuss headline material for the lead news segment. Throughout the morning they work on writing deadline pieces inspired by recent news, as well as longer-term projects. By lunchtime, Noah — who describes his role as that of the captain of a team — has begun to review headline jokes. The script is submitted by 3 pm, and at 4:15 there is a rehearsal. An hour is left for rewrites before a 6 pm taping in front of a live studio audience. The Daily Show typically tapes four new episodes a week, Monday through Thursday, forty-two weeks a year. The show is broadcast at 11 PM Eastern/10 PM Central, a time when local television stations show their news reports and about half an hour before most other late-night comedy programs begin to go on the air. The program is rerun several times the next day, including a 7:30 PM Eastern/6:30 PM Central prime time broadcast. == History == === Craig Kilborn's tenure (1996–1998) === The Daily Show was created by Lizz Winstead and Madeleine Smithberg and premiered on Comedy Central on July 22, 1996, having been marketed as a replacement for Politically Incorrect (a successful Comedy Central program that had moved to ABC earlier that year). Madeleine Smithberg was co-creator of The Daily Show as well as the former executive producer. A graduate of Binghamton University, she was an executive producer of Steve Harvey's Big Time and a talent coordinator for Late Night with David Letterman. Aiming to parody conventional newscasts, it featured a comedic monologue of the day's headlines from anchor Craig Kilborn (a well-known co-anchor of ESPN's SportsCenter), as well as mockumentary style on-location reports, in-studio segments and debates from regular correspondents Winstead, Brian Unger, Beth Littleford, and A. Whitney Brown. ==== Common segments ==== Common segments included \"This Day in Hasselhoff History\" and \"Last Weekend's Top-Grossing Films, Converted into Lira\", in parody of entertainment news shows and their tendency to lead out to commercials with trivia such as celebrity birthdays. Another commercial lead- out featured Winstead's parents, on her answering machine, reading that day's \"Final Jeopardy!\" question and answer. In each show, Kilborn would conduct celebrity interviews, ending with a segment called \"Five Questions\" in which the guest was made to answer a series of questions that were typically a combination of obscure fact and subjective opinion. These are highlighted in a 1998 book titled The Daily Show: Five Questions, which contains transcripts of Kilborn's best interviews. Each episode concluded with a segment called \"Your Moment of Zen\" that showed random video clips of humorous and sometimes morbid interest such as visitors at a Chinese zoo feeding baby chickens to the alligators. Originally the show was recorded without a studio audience, featuring only the laughter of its own off-camera staff members. A studio audience was incorporated into the show for its second season, and has remained since. ==== Differences between Kilborn's version and Stewart's version ==== The show was much less politically focused than it later became under Jon Stewart, having what Stephen Colbert described as a local news feel and involving more character-driven humor as opposed to news-driven humor. Winstead recalls that when the show was first launched there was constant debate regarding what the show's focus should be. While she wanted a more news-driven focus, the network was concerned that this would not appeal to viewers and pushed for \"a little more of a hybrid of entertainment and politics\". The show was slammed by some reviewers as being too mean-spirited, particularly towards the interview subjects of field pieces; a criticism acknowledged by some of the show's cast.[by whom?] Describing his time as a correspondent under Kilborn, Colbert says, \"You wanted to take your soul off, put it on a wire hanger, and leave it in the closet before you got on the plane to do one of these pieces.\" One reviewer from The New York Times criticized the show for being too cruel and for lacking a central editorial vision or ideology, describing it as \"bereft of an ideological or artistic center... precocious but empty.\" ==== Craig Kilborn's departure ==== There were reports of backstage friction between Kilborn and some of the female staff, particularly the show's co-creator Lizz Winstead. Winstead had not been involved in the hiring of Kilborn, and disagreed with him over what direction the show should take. \"I spent eight months developing and staffing a show and seeking a tone with producers and writers. Somebody else put him in place. There were bound to be problems. I viewed the show as content-driven; he viewed it as host-driven\", she said. In a 1997 Esquire magazine interview, Kilborn made a sexually explicit joke about Winstead. Comedy Central responded by suspending Kilborn without pay for one week, and Winstead quit soon after. In 1998, Kilborn left The Daily Show to replace Tom Snyder on CBS's The Late Late Show (Now Hosted by James Corden). He claimed the \"Five Questions\" interview segment as intellectual property, disallowing any future Daily Show hosts from using it in their interviews. Correspondents Brian Unger and A. Whitney Brown left the show shortly before him, but the majority of the show's crew and writing staff stayed on. Kilborn's last show as host aired on December 17, 1998, ending a 386-episode tenure. Reruns were shown until Jon Stewart's debut four weeks later. Kilborn made a short appearance on Jon Stewart's final edition of the Daily Show saying \"I knew you were going to run this thing into the ground.\" === Jon Stewart's tenure (1999–2015) === ==== Shift in content ==== Jon Stewart (right) hosting an episode of The Daily Show in 2010 with Admiral Michael Mullen Comedian Jon Stewart took over as host of the show, which was retitled The Daily Show with Jon Stewart, on January 11, 1999. Stewart had previously hosted Short Attention Span Theater on Comedy Central, two shows on MTV (You Wrote It, You Watch It and The Jon Stewart Show), as well as a syndicated late-night talk show, and had been cast in films and television. In taking over hosting from Kilborn, Stewart initially retained much of the same staff and on-air talent, allowing many pieces to transition without much trouble, while other features like \"God Stuff\", with John Bloom presenting an assortment of actual clips from various televangelists, and \"Backfire\", an in-studio debate between Brian Unger and A. Whitney Brown, evolved into the similar pieces of \"This Week in God\" and Stephen Colbert and Steve Carell's \"Even Stevphen\". After the change, a number of new features were developed. The ending segment \"Your Moment of Zen\", previously consisting of a random selection of humorous videos, was diversified to sometimes include recaps or extended versions of news clips shown earlier in the show. The show's theme music, \"Dog on Fire\" by Bob Mould, was re-recorded by They Might Be Giants shortly after Stewart joined the show. Stewart served not only as host but also as a writer and executive producer of the series. He recalls that he initially struggled with the Kilborn holdover writers to gain control of the show and put his own imprint on the show's voice, a struggle that led to the departure of a number of the holdover writers. Instrumental in shaping the voice of the show under Stewart was former editor of The Onion Ben Karlin who, along with fellow Onion contributor David Javerbaum, joined the staff in 1999 as head writer and was later promoted to executive producer. Their experience in writing for the satirical newspaper, which uses fake stories to mock real print journalism and current events, would influence the comedic direction of the show; Stewart recalls the hiring of Karlin as the point at which things \"[started] to take shape\". Describing his approach to the show, Karlin said, \"The main thing, for me, is seeing hypocrisy. People who know better saying things that you know they don't believe.\" Logo used for Stewart's tenure Under Stewart and Karlin The Daily Show developed a markedly different style, bringing a sharper political focus to the humor than the show previously exhibited. Then-correspondent Stephen Colbert recalls that Stewart specifically asked him to have a political viewpoint, and to allow his passion for issues to carry through into his comedy. Colbert says that whereas under Kilborn the focus was on \"human interest-y\" pieces, with Stewart as host the show's content became more \"issues and news driven\", particularly after the beginning of the 2000 election campaign with which the show dealt in its \"Indecision 2000\" coverage. Stewart himself describes the show's coverage of the 2000 election recount as the point at which the show found its editorial voice. \"That's when I think we tapped into the emotional angle of the news for us and found our editorial footing,\" he says. Following the September 11th attacks, The Daily Show went off the air for nine days. Upon its return, Stewart opened the show with a somber monologue, that, according to Jeremy Gillick and Nonna Gorilovskaya, addressed both the absurdity and importance of his role as a comedian. Commented Stewart: > They said to get back to work, and there were no jobs available for a man in > the fetal position. ...We sit in the back and we throw spitballs – never > forgetting the fact that it is a luxury in this country that allows us to do > that. ...The view from my apartment was the World Trade Center. Now it's > gone. They attacked it. This symbol of American ingenuity and strength and > labor and imagination and commerce and it is gone. But you know what the > view is now? The Statue of Liberty. The view from the south of Manhattan is > now the Statue of Liberty. You can't beat that. — Gillick and Gorilovskaya point to the September 11 attacks and the beginning of the wars in Afghanistan and Iraq as the point at which Jon Stewart emerged as a trusted national figure. Robert Thompson, the director of the Bleier Center for Television and Popular Culture at Syracuse University, recalled of this period, \"When all the news guys were walking on eggshells, Jon was hammering those questions about WMDs.\" ==== Broadening the role of the correspondent ==== During Stewart's tenure, the role of the correspondent broadened to encompass not only field segments but also frequent in-studio exchanges. Under Kilborn, Colbert says that his work as a correspondent initially involved \"character driven [field] pieces—like, you know, guys who believe in Bigfoot.\" However, as the focus of the show has become more news- driven, correspondents have increasingly been used in studio pieces, either as experts discussing issues at the anchor desk or as field journalists reporting from false locations in front of a green screen. Colbert says that this change has allowed correspondents to be more involved with the show, as it has permitted them to work more closely with the host and writers. ==== Popularity and critical respect ==== The show's 2000 and 2004 election coverage, combined with a new satirical edge, helped to catapult Stewart and The Daily Show to new levels of popularity and critical respect. Since Stewart became host, the show has won 23 Primetime Emmy Awards and three Peabody Awards, and its ratings steadily increased. In 2003, the show was averaging nearly a million viewers, an increase of nearly threefold since the show's inception as Comedy Central became available in more households. By September 2008, the show averaged nearly two million viewers per night. Senator Barack Obama's interview on October 29, 2008, pulled in 3.6 million viewers. ==== In the political spectrum ==== The move towards greater involvement in political issues and the increasing popularity of the show in certain key demographics have led to examinations of where the views of the show fit in the political spectrum. Adam Clymer, among many others, has argued that The Daily Show is more critical of Republicans than Democrats. Stewart, who voted Democratic in the 2004 presidential election, acknowledged that the show has a more liberal point of view, but that it is not \"a liberal organization\" with a political agenda and its duty first and foremost is to be funny. He acknowledges that the show is not necessarily an \"equal opportunity offender\", explaining that Republicans tended to provide more comedic fodder because \"I think we consider those with power and influence targets and those without it, not.\" In an interview in 2005, when asked how he responded to critics claiming that The Daily Show is overly liberal, Stephen Colbert, also a self-proclaimed Democrat, said in an interview during the Bush Administration, when the Republicans held a majority in the House and Senate: \"We are liberal, but Jon's very respectful of the Republican guests, and, listen, if liberals were in power it would be easier to attack them, but Republicans have the executive, legislative and judicial branches, so making fun of Democrats is like kicking a child, so it's just not worth it.\" Stewart is critical of Democratic politicians for being weak, timid, or ineffective. He said in an interview with Larry King, prior to the 2006 elections, \"I honestly don't feel that [the Democrats] make an impact. They have forty-nine percent of the vote and three percent of the power. At a certain point you go, 'Guys, pick up your game.'\" He has targeted them for failing to effectively stand on some issues, such as the war in Iraq, describing them as \"incompetent\" and \"unable... to locate their asses, even when presented with two hands and a special ass map.\" Karlin, then the show's executive producer, said in a 2004 interview that while there is a collective sensibility among the staff which, \"when filtered through Jon and the correspondents, feels uniform,\" the principal goal of the show is comedy. \"If you have a legitimately funny joke in support of the notion that gay people are an affront to God, we'll put that motherfucker on!\" On September 15, 2003, Senator John Edwards became the first candidate to announce that they were running for president on the show, causing Jon Stewart to jokingly inform him that their show was \"fake\" and he might have to reannounce elsewhere. On November 17, 2009, Vice President Joe Biden appeared on the show, making him the first sitting vice president to do so. On October 27, 2010, President Barack Obama became the first sitting U.S. president to be interviewed on the show, wherein Obama commented he \"loved\" the show. Obama took issue with Stewart's suggestion that his health care program was \"timid.\" After the United States Senate failed to pass and the media failed to cover the James Zadroga 9/11 Health and Compensation Act, which would provide health monitoring and financial aid to sick first responders of the September 11 attacks, Stewart dedicated the entire December 16, 2010, broadcast to the issue. During the next week, a revived version of the bill gained new life, with the potential of being passed before the winter recess. Stewart was praised by both politicians and affected first responders for the bill's passage. According to Syracuse University professor of television, radio and film Robert J. Thompson, \"Without him, it's unlikely it would've passed. I don't think Brian Williams, Katie Couric or Diane Sawyer would've been allowed to do this.\" ==== Writers' strike ==== Due to the 2007–08 Writers Guild of America strike, the show went on hiatus on November 5, 2007. Although the strike continued until February 2008, the show returned to air on January 7, 2008, without its staff of writers. In solidarity with the writers, the show was referred to as A Daily Show with Jon Stewart rather than The Daily Show with Jon Stewart, until the end of the strike. As a member of the Writers Guild of America, Stewart was barred from writing any material for the show himself which he or his writers would ordinarily write. As a result, Stewart and the correspondents largely ad-libbed the show around planned topics. In an effort to fill time while keeping to the strike-related restrictions, the show aired or re-aired some previously recorded segments, and Stewart engaged in a briefly recurring mock feud with fellow late-night hosts Stephen Colbert and Conan O'Brien. The strike officially ended on February 12, 2008, with the show's writers returning to work the following day, at which point the title of The Daily Show was restored. ==== Stewart's absence in 2013 ==== Starting in June 2013, Jon Stewart took a twelve-week break to direct Rosewater, a drama about a journalist jailed by Iran for four months. Show writer John Oliver replaced Stewart at the anchor desk for two months, to be followed by one month of reruns. Oliver received positive reviews for his hosting, leading to his departure from the show in December 2013 for his own show Last Week Tonight with John Oliver, which debuted April 27, 2014, on HBO. === Jon Stewart's departure === Barack Obama made his final appearance on the show with Jon Stewart as host on July 21, 2015 On February 10, 2015, Stewart announced that he would be leaving the show later in the year. Comedy Central indicated in a statement that The Daily Show would continue without Stewart, saying it would \"endure for years to come\". On June 25, 2015, Comedy Central announced that to lead up to Stewart's final episode, it would hold \"Your Month of Zen\"—an online marathon streaming every episode of Stewart's tenure from June 26 to August 6, 2015. On August 5, 2015, Stewart's longtime friend of 30 years comedian Louis C.K. was selected to be the last guest before the final Daily Show episode with Stewart helming the show. C.K. joked that he was there \"representing comedy to say good job\". On August 6, 2015, Stewart's final episode aired as an hour-long special in three segments. The first featured a reunion of a majority of the correspondents and contributors from throughout the show's history as well as a pre-recorded \"anti-tribute\" (mocking Stewart) from various frequent guests and \"friends\" of the show. This included Bill O'Reilly, Hillary Clinton, John McCain, Lindsey Graham, Chris Christie, John Kerry, and Chuck Schumer. The second segment featured a pre- recorded tour of the Daily Show production facility and studio introducing all of the show's staff and crew. The final segment featured a short farewell speech from Stewart followed by the final \"Moment of Zen\" (being 'his own' moment of zen): a performance of \"Land of Hope and Dreams\" and \"Born to Run\" by Bruce Springsteen and the E Street Band. === Trevor Noah's tenure (2015–present) === On March 30, 2015, it was announced that Trevor Noah would replace Stewart as host of The Daily Show. Shortly after his announcement, it was revealed that Amy Schumer, Louis C.K., Amy Poehler, and Chris Rock were all considered for the job. His first show was on September 28, 2015, with comedian Kevin Hart as his first guest. Noah's premiere episode was simulcast by Viacom on Comedy Central, the Nick at Nite block on Nickelodeon, Spike, MTV, MTV2, mtvU, VH1, VH1 Classic, BET, Centric, CMT, TV Land and Logo TV. On September 14, 2017, it was announced that Comedy Central had extended Trevor Noah's contract as host of The Daily Show for five years, through 2022. Ratings declined by about 37 percent at the start of Noah's tenure, and have gradually increased since then, only to once again fall down to the lowest ratings in 15 years in 2020. ==== Differences between Stewart's version and Noah's version ==== In addition to changes in the tone of the show,[clarification needed] Noah has also implemented stylistic changes to the show, with an updated set, new graphics and his monologue sometimes taking place while standing in front of a screen as opposed to sitting at the desk. Trevor also increased the usage of more millennial-based references, impersonations and characterizations for his comedy on the show, due to his younger demographic and his ability to speak in multiple accents and eight languages. The debut of The Daily Show with Trevor Noah brought along three new correspondents: Roy Wood Jr., Desi Lydic and Ronny Chieng. Additional correspondents were added in 2017. Michael Kosta became the Senior Constitutional Correspondent and Senior American Correspondent on July 11, 2017. Dulcé Sloan became the Senior Fashion Correspondent on September 7, 2017. In January 2016, The Daily Show with Trevor Noah started to use a modified version of the show's previous theme, remixed by Timbaland and King Logan. Noah also avoided talking too much about Fox News, as Stewart was previously known for. \"The Daily Show was based on an emerging 24 hour news cycle, that’s everything it was, that’s what inspired The Daily Show. Now you look at news and it’s changed. It’s no longer predicated around 24 hour news. There are so many different choices. Half of it is online now. Now you’ve got the Gawkers, the Buzzfeeds. The way people are drawing their news is soundbites and headlines and click-bait links has changed everything. The biggest challenge is going to be an exciting one I'm sure is how are we going to bring all of that together looking at it from a bigger lens as opposed to just going after one source—which was historically Fox News,\" Noah said at a press conference before the show's debut. ==== Stewart visits The Daily Show with Trevor Noah; Jordan Klepper guest hosts ==== On December 8, 2015, former host Jon Stewart returned to The Daily Show for the first time in an extended- length show to return attention to extending the James Zadroga 9/11 Health and Compensation Act, otherwise referred to as 9/11 First Responders Bill, which Stewart explained had been blocked by Paul Ryan and Mitch McConnell for political reasons. On October 20, 2016, Noah was unable to host a scheduled taping of The Daily Show due to illness, so correspondent Jordan Klepper guest hosted. On November 16, 2017, Stewart once again returned to The Daily Show, in part as a parody of the robocalls of fake Washington Post reporter \"Bernie Bernstein\" and to promote Night of Too Many Stars on HBO. ==== The Daily Social Distancing Show ==== During the COVID-19 pandemic in the United States, it was initially announced that starting March 16, 2020, the show would do away with the live audience, like all other live shows were starting to do. However, that day, Noah posted a short video explaining that they would not do that because of social distancing. On March 18, 2020, Noah did a modified version of The Daily Show from his own home for Comedy Central's website and The Daily Show's YouTube channel called The Daily Social Distancing Show with Trevor Noah. On March 21, 2020, it was announced that this format would be moving to linear television beginning March 23, 2020. The Daily Show won the 2020 Webby Award for Humor in the category Social. On June 15, 2021, it was announced that The Daily Social Distancing Show would go on a three-month hiatus beginning after the episode airing on June 17. According to a press release, it will resume on September 13 with a \"brand-new look\", but gave no other information beyond that, or any indication if the show would be returning to the studio. ==== Expansion to 45-minute format ==== Following the cancellation of Lights Out with David Spade, The Daily Show expanded into a 45-minute format beginning April 27, 2020. In July 2020, Comedy Central head Chris McCarthy told Vulture that there were plans to possibly extend the show to an hour-long format by the end of the year. == Correspondents, contributors and staff == Main articles: List of The Daily Show correspondents and List of The Daily Show writers The show's correspondents have two principal roles: experts with satirical senior titles that Noah interviews about certain issues, or hosts of field reporting segments which often involve humorous commentary and interviews relating to a current issue. The current team of correspondents collectively known as \"The World's Fakest News Team\" (formerly known as \"The Best F#@king News Team Ever\") includes Ronny Chieng, Michael Kosta, Desi Lydic, Dulcé Sloan, Roy Wood Jr. and Jaboukie Young-White. Contributors appear on a less frequent basis, often with their own unique recurring segment or topic. Current contributors are Lewis Black, Neal Brennan, and Gina Yashere. Ben Karlin says that the on-air talent contribute in many ways to the material they perform, playing an integral role in the creation of their field pieces as well as being involved with their scripted studio segments, either taking part early on in the writing process or adding improvised material during the rehearsal. The show has featured a number of well-known comedians throughout its run and is notable for boosting the careers of several of these. Scott Dikkers, editor-in-chief of The Onion, describes it as a key launching pad for comedic talent, saying that \"I don't know if there's a better show you could put on your resume right now.\" Steve Carell, who was a correspondent between 1999 and 2005 before moving on to a movie career and starring television role in The Office, credits Stewart and The Daily Show with his success. In 2005, the show's longest-serving correspondent, Stephen Colbert, became the host of the spin-off The Colbert Report, earning critical and popular acclaim. Colbert would host the program until he was chosen to replace David Letterman as host of CBS's Late Show in 2015. Ed Helms, a former correspondent from 2002 to 2006, also starred on NBC's The Office and was a main character in the 2009 hit The Hangover. After filling in as host during Stewart's two-month absence in the summer of 2013, John Oliver went on to host his own show on HBO, Last Week Tonight with John Oliver. In 2016, former correspondent Samantha Bee launched her own late-night talk show Full Frontal with Samantha Bee. Bee's husband Jason Jones, also a former correspondent, serves as executive producer for the show. Hasan Minhaj, the last correspondent hired during Stewart's tenure as host, left the show in 2018 to host Patriot Act with Hasan Minhaj on Netflix. In June 2010, actress- comedian Olivia Munn began a tryout period on the show as a correspondent. Her credentials were questioned by Irin Carmon of the website Jezebel, who suggested that Munn was better known as a sex symbol than as a comedian. Carmon's column was denounced by Munn and the Daily Show's female writers, producers, and correspondents, 32 of whom posted a rebuttal on the show's website in which they asserted that the description of the Daily Show office given by the Jezebel piece was not accurate. Munn appeared as a Daily Show correspondent in a total of 16 episodes, from June 2010 to September 2011. Wyatt Cenac had a tumultuous tenure on the show, revealing in a July 2015 interview on WTF with Marc Maron, that his departure stemmed in part from a heated argument he had with Jon Stewart in June 2011 over a bit about Republican presidential candidate Herman Cain. However, Cenac did return for Stewart's final episode to bid him farewell and the two exchanged an intentionally awkward conversation. === Guest hosts === * Samantha Bee and Jason Jones, 1 episode (October 7, 2014) * Steve Carell, 7 episodes (February 21, 2001, Mar. 27–29, 2001, Apr 2 & 4, 2001, and May 1, 2001) * Stephen Colbert, 11 episodes (January 24, 2001, Feb 20 & 22, 2001, Mar. 26–27, 2001, Apr 3 & 5, 2001, May 2–3, 2001, March 6, 2003, and July 6, 2004) * Rob Corddry, 1 episode (February 9, 2006) * Vance DeGeneres, 2 episodes (Feb. 26–27, 2001) * Jordan Klepper, 1 episode (October 20, 2016) * John Oliver, 33 episodes (June 10, 2013, to August 15, 2013, and November 13, 2014) * Mo Rocca, 1 episode (February 27, 2001) * Nancy Walls, 2 episodes (February 21, 2001, and March 29, 2001) Category:1996 American television series debuts Category:1990s American comedy television series Category:1990s satirical television series Category:2000s American comedy television series Category:2000s satirical television series Category:2010s American comedy television series Category:2010s satirical television series Category:American satirical television series Category:Emmy Award winning programs Category:English-language television programs",
 "title": "The Daily Show"
}