{
 "id": "138418",
 "text": "Springfield is a city in Massachusetts, United States. In the year 2020, 155,929 people lived in the city and 460,000 people lived in Metropolitan Springfield. Springfield is the largest city on the Connecticut River. It is at a natural crossroad where three rivers flow into the Connecticut River. ==History== One of Springfield's nicknames is \"The City of Firsts\" because many famous inventions came from there, like: * The sport of basketball was invented in Springfield in 1892. The James Naismith Memorial Basketball Hall of Fame is there. * The American car was invented there in 1893. * The American motorcycle was invented in Springfield in 1901. * The modern fire engine was invented there in 1905. * The commercial radio station was invented there in 1920. * The UHF TV station was invented in Springfield in 1950. ==Location== Springfield is near Hartford, Connecticut. The two cities are only 24 miles (38 km) apart. Airline service to Springfield and Hartford is provided from Bradley International Airport. Bradley is 12 miles (19 km) away from Springfield, and 12 miles (19 km) away from Hartford. ==People== Many famous people are from Springfield: Dr. Seuss, the author, is from there. John Brown, the abolitionist, started his abolitionism here. James MacNeill Whistler, the famous painter, lived there too. Timothy Leary, the LSD activist was born there. Milton Bradley, the game-maker made his games, like \"The Game of Life,\" and \"Chutes and Ladders\" there. Charles Goodyear, the man who invented vulcanized rubber, first made it in Springfield. ==Environment== Springfield's other nicknames are \"The City in a Forest,\" because it has a lot of trees in it, and \"The City of Homes\" because it has many big Victorian houses. ==Sports== Springfield has two professional sports teams, the Springfield Falcons AHL ice hockey team, and the Springfield Armor NBA D-League basketball team. Both teams play home games at the MassMutual Center on Main Street in Springfield. ==Transportation== Many trains and buses meet in Springfield, because it is close to big cities like New York City, Boston, Montreal, and Albany. It is also next to New England's largest river, the Connecticut River. Springfield has always been a city that has welcomed immigrants. ==Sightseeing== Springfield has the Basketball Hall of Fame, The Quadrangle museums - a group of art, science, and history museums around the Dr. Seuss sculptures. There is the Club Quarter, where there are many restaurants, bars, and discos. There is also Forest Park, where there is a zoo, different sports fields, and a lake. Category:County seats in Massachusetts",
 "title": "Springfield, Massachusetts"
}