{
 "id": "138592",
 "text": "WrestleMania IX was a professional wrestling pay-per-view show made by World Wrestling Federation (WWF). It was held on April 4, 1993 at Caesars Palace in Las Vegas, Nevada. It was the ninth WrestleMania event held by the WWF. The main event saw Yokozuna defeat Bret Hart to win the WWF Championship. Yokozuna won the match by pinfall after Yokozuna's manager Mr. Fuji threw salt in Hart's eyes. After the match, Hulk Hogan came down to the ring to check on Hart. Mr. Fuji challenged Hogan to face Yokozuna in a impromptu match and Hogan accepted. Hogan won the match and the championship in 22 seconds after he hit Yokozuna with the leg drop and pinned him. WrestleMania IX received negative criticism and was called a poorly booked event. John Powell of SLAM! Wrestling said that other than the Intercontinental and Tag Team Championship matches and the women that accompanied Lex Luger to the ring, the rest of the pay-per-view was not good. He also did not like some of the outfits that were worn at the event, most notably Jim Ross's toga and Giant Gonzalez's spray- painted suit. ==Results== # Matches Stipulations Times 1D Tito Santana defeated Papa Shango Singles match 8:00 2 Tatanka (with Sensational Sherri) defeated Shawn Michaels (c) (with Luna Vachon) by countout Singles match for the WWF Intercontinental Championship 18:13 3 The Steiner Brothers (Rick and Scott Steiner) defeated The Headshrinkers (Samu and Fatu) (with Afa) Tag team match 14:22 4 Doink the Clown defeated Crush Singles match 8:28 5 Razor Ramon defeated Bob Backlund Singles match 3:45 6 Money Inc. (Ted DiBiase and Irwin R. Schyster) (c) defeated The Mega-Maniacs (Hulk Hogan and Brutus Beefcake) (with Jimmy Hart) by disqualification Tag team match for the WWF Tag Team Championship 18:27 7 Lex Luger defeated Mr. Perfect Singles match 10:56 8 The Undertaker (with Paul Bearer) defeated Giant Gonzalez (with Harvey Wippleman) by disqualification Singles match 7:33 9 Yokozuna (with Mr. Fuji) defeated Bret Hart (c) Singles match for the WWF Championship 8:55 10 Hulk Hogan defeated Yokozuna (c) (with Mr. Fuji) Singles match for the WWF Championship 0:22 (c) – refers to the champion(s) heading into the match D – indicates that the match was a dark match ==References== ==Other websites== *Official WrestleMania IX website WrestleMania 09 Category:Sports in Las Vegas Category:1993 in the United States Category:20th century in Nevada Category:1993 in professional wrestling",
 "title": "WrestleMania IX"
}