{
 "id": "138547",
 "text": "WrestleMania V was the fifth annual WrestleMania professional wrestling pay- per-view event produced by the World Wrestling Federation (WWF). It took place on April 2, 1989 at the Trump Plaza in Atlantic City, New Jersey. == Results == # Results Stipulations Times 1 Hercules defeated King Haku (with Bobby Heenan) Singles match 06:57 2 The Twin Towers (Akeem and The Big Boss Man) (with Slick) defeated The Rockers (Shawn Michaels and Marty Jannetty). Tag team match 08:02 3 Brutus Beefcake and Ted DiBiase (with Virgil) fought to a double countout. Singles match 10:01 4 The Bushwhackers (Luke Williams and Butch Miller) defeated The Fabulous Rougeaus (Jacques and Raymond) (with Jimmy Hart). Tag team match 09:10 5 Mr. Perfect defeated The Blue Blazer. Singles match 05:38 6 Demolition (Ax and Smash) (c) defeated The Powers of Pain (The Warlord and The Barbarian) and Mr. Fuji. Handicap tag team match for the WWF Tag Team Championship 08:20 7 Dino Bravo (with Frenchy Martin) defeated Ronnie Garvin. Singles match 04:59 8 The Brain Busters (Arn Anderson and Tully Blanchard) (with Bobby Heenan) defeated Strike Force (Rick Martel and Tito Santana). Tag team match 09:17 9 Jake Roberts defeated André the Giant (with Bobby Heenan) by disqualification Singles match with special guest referee Big John Studd 09:44 10 The Hart Foundation (Bret Hart and Jim Neidhart) defeated The Honky Tonk Man and Greg Valentine (with Jimmy Hart). Tag team match 07:40 11 Rick Rude (with Bobby Heenan) defeated The Ultimate Warrior (c). Singles match for the WWF Intercontinental Championship 09:36 12 Jim Duggan and Bad News Brown fought to a double disqualification. Singles match 03:49 13 The Red Rooster defeated Bobby Heenan (with The Brooklyn Brawler). Singles match 00:32 14 Hulk Hogan defeated Randy Savage (c) Singles match for the WWF Championship 17:54 ==Other websites== *The Official Website of WrestleMania V WrestleMania 05 Category:Atlantic City, New Jersey Category:Sports in New Jersey Category:1989 in professional wrestling Category:1989 in the United States Category:1980s in New Jersey Category:1989 events Category:April events",
 "title": "WrestleMania V"
}