{
 "id": "138507",
 "text": "Aveyron () is a French department found in the northeast of the Occitanie region of southern France and named after the Aveyron river. Its prefecture is Rodez. ==History== Aveyron is one of the 83 French departments made during the French revolution, on 4 March 1790. It was created with most of the territory of the old province of Rouergue; in fact, the present flag of the department was the flag of Rouergue. The first known historical inhabitants of the region were the Rutenii tribe but, before them, the area was inhabited by people that built many prehistoric ruins including over 1,000 dolmens - more than any other department in France. In 1808, the old canton of Saint-Antonin-Noble-Val was transferred from Aveyron to the new department of Tarn-et-Garonne.Création du département de Tarn-et-Garonne ==Geography== Aveyron is part of the Occitanie region, in southern France, and is the 6th French department in area with . The department borders with 7 other departments: * Auvergne-Rhône-Alpes ** Cantal * Occitanie ** Hérault ** Gard ** Lozère ** Tarn ** Tarn-et-Garonne ** Lot Aveyron is in the southern half of the central plateau (Massif Central) of France. The mountainous areas (the Aubrac mountains, Palanges Levezou and Lacaune) cover little more than a third of the territory, with the highest point in Signal de Mailhe-Biau (the northwest peak, ) that is high and is in the region called Cazalets; the remaining two thirds are occupied by hills and plateaus (Ségala, Viadène, Lagast and Grands Causses), with a few valleys. The territory is crossed, among others, by the rivers Lot and Tarn, both tributaries of the Garonne river. The Aveyron river, which gives its name to the department, is a tributary of the Tarn river. The main rivers of Aveyron are the Lot in the north, the Aveyron in the centre and the Tarn in the south, all tributaries of the Garonne. They flow from east to west, following the general slope of the department, and divide it into four zones. ===Climate=== The climate of the Aveyron is subtropical with dry-summer, Csb (Mediterranean Climate) in the Köppen climate classification. The average temperature for the year in Millau is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The average amount of precipitation for the year in Millau is . The month with the most precipitation on average is September with of precipitation. The month with the least precipitation on average is July with an average of . ==Administration== Aveyron is part of the region of Occitanie. The department is managed by the Departamental Council of the Aveyron in Rodez. ===Administrative divisions=== There are 3 arrondissements (districts), 23 cantons and 286 communes (municipalities) in Aveyron. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 121 Millau Millau 70,995 3,467.3 97 122 Rodez Rodez 143,841 3,974.4 127 123 Villefranche-de-Rouergue Villefranche-de-Rouergue 63,808 1,293.4 62 Mairie de Millau.JPG|Millau city hall Rodez market.JPG|Rodez market Villefranche-de-Rouergue - Pont des Consuls -1.JPG|Pont des Consuls, Villefranche-de-Rouergue The following is a list of the 23 cantons of the Aveyron department (with their INSEE codes), in France, following the French canton reorganisation which came into effect in March 2015:Décret n° 2014-205 du 21 février 2014 portant délimitation des cantons dans le département de l'Aveyron # Aubrac et Carladez (1201) # Aveyron et Tarn (1202) # Causse-Comtal (1203) # Causses-Rougiers (1204) # Ceor-Ségala (1205) # Enne et Alzou (1206) # Lot et Dourdou (1207) # Lot et Montbazinois (1208) # Lot et Palanges (1209) # Lot et Truyère (1210) # Millau-1 (1211) # Millau-2 (1212) # Monts du Réquistanais (1213) # Nord-Lévezou (1214) # Raspes et Lévezou (1215) # Rodez-1 (1216) # Rodez-2 (1217) # Rodez-Onet (1218) # Saint- Affrique (1219) # Tarn et Causses (1220) # Vallon (1221) # Villefranche-de- Rouergue (1222) # Villeneuvois et Villefranchois (1223) ==Demographics== The inhabitants of Aveyron are known, in French, as Aveyronnais (women: Aveyronnaises). Aveyron has a population, in 2014, of 278,644, for a population density of inhabitants/km2. The arrondissement of Rodez, with 143,841 inhabitants, is by far the largest. The other two, Millau and Villefranche-de-Rouergue, have respectively 70,995 and 63,808 inhabitants. The city with more people living in it is the capital, Rodez (24,088). The subprefectures of Millau and Villefranche-de-Rouergue have, respectively, 22,064 and 11,822 inhabitants. Evolution of the population in Aude Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:300000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:25000 start:0 ScaleMinor = gridcolor:lightgrey increment:12500 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 281568 bar:1975 from:0 till: 278306 bar:1982 from:0 till: 278654 bar:1990 from:0 till: 270141 bar:1999 from:0 till: 263808 bar:2008 from:0 till: 275889 bar:2014 from:0 till: 278644 PlotData= bar:1968 at: 281568 fontsize:S text: 281,568 shift:(-12,5) bar:1975 at: 278306 fontsize:S text: 278,306 shift:(-18,5) bar:1982 at: 278654 fontsize:S text: 278,654 shift:(-18,5) bar:1990 at: 270141 fontsize:S text: 270,141 shift:(-18,5) bar:1999 at: 263808 fontsize:S text: 263,808 shift:(-18,5) bar:2008 at: 275889 fontsize:S text: 275,889 shift:(-18,5) bar:2014 at: 278644 fontsize:S text: 278,644 shift:(-18,5) The 10 most important cities in the department are: City Population (2014) Arrondissement Rodez 24,088 Rodez Millau 22,064 Millau Onet-le-Château 11,837 Rodez Villefranche-de-Rouergue 11,822 Villefranche-de-Rouergue Saint- Affrique 8,260 Millau Luc-la-Primaube 5,898 Rodez Decazeville 5,686 Villefranche-de-Rouergue Capdenac-Gare 4,558 Villefranche-de-Rouergue Espalion 4,460 Rodez Sévérac d'Aveyron 4,134 Millau ==Related pages== * Arrondissements of the Aveyron department * Communes of the Aveyron department ==References== ==Other websites== * Departamental Council website * Prefecture website * aveyron.com website * Aveyron tourism official website",
 "title": "Aveyron"
}