{
 "id": "138587",
 "text": "The AVN Awards are movie awards sponsored by and presented by the adult video industry magazine AVN. They began in January 1984. The awards are divided into over 100 categories. ==Categories== * Best Actor * Best Actress * Best Supporting Actor * Best Supporting Actress * Male Performer of the Year * Female Performer of the Year * Male Foreign Performer of the Year * Female Foreign Performer of the Year * Transgender Performer of the Year * Director of the Year * Best New Starlet * Best Director * Best Non-Sex Performance * Best Cinematography * Best All-Sex Video * Best Renting Title of the Year * Best Selling Title of the Year * Best Film * Best Video Feature * Best Foreign Feature * Best Tease Performance * Best All-Girl Sex Scene * Best All-Girl Feature * Best Newcomer – Gay Video * Best Bi-Sexual Video * Best Gay Video * Best Actor – Gay Video * Best Supporting Actor – Gay Video * Best Director – Bi-Sexual Video * Best Director – Gay Video * Best Screenplay – Gay Video * Best Sex Scene – Gay Video * Best Non-Sexual Performance – Bi, Gay, or Trans Video * Best Gay Alternative Video * Best Gay Solo Video * Best Gay Specialty Release * Best Videography – Gay Video * Best Alternative Adult Feature Film * Most Outrageous Sex Scene * Best Sex Comedy * Breakthrough Award * Best Performer of the Year – Gay Video * Best Male Newcomer * Best Director – Foreign Release * Best Classic Release * Best DVD * Best High Definition Production * Unsung Starlet of the Year * Best High-End All-Sex Release * Best All-Sex Release * Best MILF Release * Best Director – Feature * Best Director – Foreign Feature * Best Boy/Girl Scene * Best All-Girl Couples Sex Scene * MILF Performer of the Year == AVN Award winners == Listed below are the winners of the AVN Award in various major categories over the following years: == 1984–1989 == 1984 1985 1986 1987 1988 1989 Best New Starlet Rachel Ashley Ginger Lynn Angel Barbara Dare Samantha Strong Aja Best Actress (f) Sharon Mitchell Sexcapades Pamela Mann X Factor Sheri St. Claire Corporate Assets Colleen Brennan Getting Personal Krista Lane Deep Throat II Ona Zee Portrait of an Affair Best Actress (v) Ginger Lynn Project Ginger Nina Hartley Debbie Duz Dishes Shanna McCullough Hands Off Barbara Dare Naked Stranger Best Actor (f) Richard Pacheco Irresistible Eric Edwards X Factor Harry Reems Trashy Lady Mike Horner Sexually Altered States John Leslie Firestorm II Robert Bullock Portrait of an Affair Best Actor (v) Eric Edwards Dangerous Stuff Buck Adams Rockey X Robert Bullock Romeo and Juliet Jon Martin Case of the Sensuous Sinners Best Supporting Actress (f) Tiffany Clark Hot Dreams Lisa De Leeuw Dixie Ray, Hollywood Star Lisa De Leeuw Raw Talent Colleen Brennan Star Angel Tish Ambrose Firestorm II Nina Hartley Portrait of an Affair Best Supporting Actress (v) Jacqueline Lorains Beauty & the Beast Best Supporting Actor (f) Richard Pacheco Nothing to Hide John Leslie Firestorm Ron Jeremy Candy Stripers II Joey Silvera She's So Fine Michael Gaunt Firestorm II Jamie Gillis Pretty Peaches II Best Supporting Actor (v) Richard Pacheco Sensual Escape Best Non-Sex Performance Jose Duval Pillowman Best Director (f) Cecil Howard Scoundrels Anthony Spinelli Dixie Ray, Hollywood Star Cecil Howard Snake Eyes Cecil Howard Star Angel Richard Pacheco Careful, He May be Watching Alex de Renzy Pretty Peaches 2 Best Director (v) Henri Pachard Long Hard Nights Paul Vatelli Erotic Zones II Jerome Tanner Club Exotica Henri Pachard Talk Dirty to Me, Part V John Leslie Catwoman Best Cinematography Ken Gibb All American Girls Fred Andes Dixie Ray, Hollywood Star Larry Revene Raw Talent Sandy Beach Star Angel Elroy Brandy Firestorm II Mr. Ed Miami Spice II Best All-Sex Video C.T. (Coed Teasers) Unthinkable Ball Busters Wild Things Baby Face II Angel Puss Best Renting Title of the Year Traci, I Love You The Devil in Mr. Holmes Best Selling Title of the Year Traci, I Love You Miami Spice II Best Film Scoundrels Talk Dirty To Me Part III Raw Talent Devil In Miss Jones 3 Careful, He May Be Watching Pretty Peaches 2 Best Video Feature Blue Voodoo Long Hard Nights Dangerous Stuff Blame It on Ginger Romeo and Juliet The Catwoman Best Foreign Feature Grand Ecstasy The Arrangement Programmed For Pleasure The Comeback of Marilyn Forbidden Pleasures The Devil in Mr. Holmes == 1990–1994 == 1990 1991 1992 1993 1994 Best New Starlet Victoria Paris and Tori Welles (tie) Jennifer Stewart Savannah Alex Jordan Shayla LaVeaux Female Performer of the Year Ashlyn Gere Debi Diamond Male Performer of the Year Rocco Siffredi Jonathan Morgan Best Actress (f) (no award given) Hyapatia Lee The Masseuse Jeanna Fine Hothouse Rose Ashlyn Gere Chameleons Roxanne Blaze Justine Best Actress (v) Sharon Kane Bodies in Heat The Sequel Lauren Brice Married Women Ona Zee The Starlet Ashlyn Gere Two Women Leena Blinded By Love Best Actor (f) (no award given) Randy Spears The Masseuse Buck Adams Roxy Mike Horner The Seduction of Mary Mike Horner Justine Best Actor (v) Jon Martin Cool Sheets Eric Edwards The Last X-Rated Movie Tom Byron Sizzle Joey Silvera The Party Jonathan Morgan The Creasemaster Best Supporting Actress (f) (no award given) Deidre Holland Veil Britt Morgan On Trial Ona Zee The Secret Garden 1 & 2 Tianna Justine Best Supporting Actress (v) Viper Mystery of the Golden Lotus Nina Hartley The Last X-Rated Movie Selena Steele Sirens Melanie Moore The Party Porsche Lynn Servin' It Up Best Supporting Actor (f) John Martin Pretty Peaches 3 Jon Dough Brandy and Alexander Joey Silvera Face Dance, Parts I & II Steve Drake Whispered Lies Best Supporting Actor (v) Rick Savage Bedman and Throbbin Ron Jeremy Playin' Dirty Mike Horner Bite Tony Tedeschi Smeers Randy Spears Haunted Nights Best Non-Sex Performance Nick Random True Love Jose Duval Oh, What a Night Carl Esser On Trial J.B. Dirty Little Mind of Martin Fink Jonathan Morgan Haunted Nights Best Tease Performance Tracey Adams Adventures of Buttman Chantelle Bend Over Babes Tianna Indian Summer, Parts 1 & 2 Racquel Darrian Bonnie and Clyde Tianna Justine Best Director (f) Henri Pachard The Nicole Stanton Story, Parts 1 & 2 Andrew Blake House of Dreams John Stagliano Wild Goose Chase John Stagliano Face Dance, Parts I & II Paul Thomas Justine Best Director (v) Jean-Pierre Ferrand and Peter Davy Voodoo Lust Paul Thomas Beauty & the Beast 2 Scotty FoxThe Cockateer (Tie) Alex de RenzyTwo Women and Anthony Spinelli The Party Jim Enright Haunted Nights Best All-Girl Sex Scene (f) Chameleons Ashlyn Gere and Deidre Holland Hidden Obsessions Janine Lindemulder and Julia Ann Best All-Girl Sex Scene (v) True Love Barbara Dare and April West The New Barbarians Victoria Paris and Sabrina Dawn American Buttman in London Misty McCaine and Carrie Jones (no award given) Buttslammers 2 The Flashlight Orgy (Celeste, Felecia, Lia Baren, Sydney St. James and Tianna) Best Cinematography Night Trips Andrew Blake House of Dreams Andrew Blake Wild Goose Chase John Stagliano Face Dance, Parts I & II John Stagliano Hidden Obsession Andrew Blake Best All-Sex Video Hello Molly Buttman's Ultimate Workout Buttman's Ultimate Workout Realities 2 The Bottom Dweller Best All-Girl Feature Where the Boys Aren't Ghost Lusters Buttwoman Kittens III Buttslammers Best Renting Title of the Year The Nicole Stanton Story Pretty Peaches 3 The Masseuse Chameleons New Wave Hookers 3 Best Selling Title of the Year The Nicole Stanton Story House of Dreams New Wave Hookers 2 Chameleons Friday Night Delights Best Film Night Trips House of Dreams (Tie) On Trial and Wild Goose Chase Face Dance, Parts 1 & 2 Justine Best Video Feature Mad Love Beauty and the Beast Curse of the Catwoman The Party Haunted Nights Best Foreign Feature (no award given) (no award given) (no award given) (no award given) Private Video Magazine 1990 1991 1992 1993 1994 Best Newcomer Gay Video Ryan Yeager Jason Ross Danny Sommers B.J. Slater Zak Spears Best Bi- Sexual Video Bi and Beyond III The Last Good Bi Innocence Found Down Bi Law Valley of the Bi Dolls Best Gay Video Undercover More of a Man Jumper Kiss-Off Abduction 2 & 3 Best Actor Gay Video Tim Lowe Fratrimony Joey Stefano More of a Man, All Worlds Video Ryan Yeager Jumper Michael Brawn Kiss-Off Johnny Rey Romeo and Julian Best Supporting Actor Gay Video Ryan Yeager Stranded Jason Ross One Night Stands Wes Daniels Songs in the Key of Sex Zak Spears Total Corruption Best Director Bi-Sexual Video Paul Norman Bi and Beyond III Paul Norman Bi and Beyond IV Paul Norman Innocence Found Josh Eliot Down Bi Law Josh Eliot Valley of the Bi Dolls Best Director Gay Video John Travis Undercover Taylor Hudson The Rise Jean-Daniel Cadinot The Traveling Journeyman Chi Chi LaRue Songs in the Key of Sex Sam Abdul Romeo and Julian Best Screenplay Gay Video Jerry Douglas More of a Man Jim Steel Prince Charming Stan Mitchell Songs in the Key of Sex Jerry Douglas Honorable Discharge Best Sex Scene – Gay Video Heat in the Night Lon Flexxe and Bill Marlowe The Rise Ryan Yeager and Scott Bond Fetish Ryan Yeager and Jason Ross Scorcher Erik Houston and Chris Stone Romeo and Julian Johnny Rey and Grant Larson Best Non- Sexual Performance Bi, Gay, or Trans Video Chi Chi LaRue More of a Man Sharon Kane Majestic Knight Kenneth Weyerhaeuser Kiss-Off Gino Colbert Honorable Discharge Best Gay Alternative Video Chi Chi LaRue's Hardbody Video Magazine Best Gay Solo Video Straight to Bed Men Who Work It Alone The Beat Cop Pumping Fever Best Gay Specialty Release Male Genital Massage Best Videography Gay Video John Trennell Idol Eyes Mark Thomas Fetish Ellary Stag Disconnected Todd Montgomery Abduction 2 & 3 Best Alternative Adult Feature Film Beach Babes from Beyond == 1995–1999 == 1995 1996 1997 1998 1999 Best New Starlet Kylie Ireland Jenna Jameson Missy Johnni Black Alisha Klass Female Performer of the Year Asia Carrera Kaitlyn Ashley Missy Stephanie Swift Chloe Male Performer of the Year Jon Dough Rocco Siffredi T.T. Boy Tom Byron Tom Byron Best Actress (f) Ashlyn Gere The Masseuse 2 Jeanna FineSkin Hunger Melissa Hill Penetrator 2: Grudgefuck Day Dyanna Lauren Bad Wives Shanna McCullough Looker Best Actress (v) Ashlyn Gere Body & Soul Jenna JamesonWicked One Jeanna Fine My Surrender Stephanie Swift Miscreants Jeanna Fine Café Flesh 2 Best Actor (f) Buck Adams No Motive Mike HornerLessons in Love Jamie Gillis Bobby Sox Steven St. Croix Bad Wives James Bonn Models Best Actor (v) Steven St. Croix Chinatown Jon Dough Latex Jon Dough Shock Tom Byron Indigo Delta Michael J. Cox L.A. Uncovered Best Supporting Actress (f) Tyffany Million Sex Ariana Desert Moon Shanna McCullough Bobby Sox Melissa Hill Bad Wives Chloe The Masseuse 3 Best Supporting Actress (v) Kaitlyn Ashley Shame Jeanna Fine Dear Diary Juli Ashton Head Trip Jeanna Fine Miscreants Katie Gold Pornogothic Best Supporting Actor (f) Jon Dough Sex Steven St. Croix Forever Young Tony Tedeschi The Show Wilde Oscar Doin' the Ritz Michael J. Cox Models Best Supporting Actor (v) Jonathan Morgan The Face Alex Sanders Dear Diary Tony Tedeschi Silver Screen Confidential Dave Hardman Texas Dildo Masquerade Jamie Gillis Forever Night Best Non-Sex Performance E.Z. Ryder Erotika Veronica Hart Nylon Scotty Schwartz Silver Screen Confidential Jamie Gillis New Wave Hookers 5 Rob Black The Pornographer Best Tease Performance Christina Angel Dog Walker Christy Canyon Comeback Janine Extreme Close-Up Silvia Saintv Fresh Meat 4 Ava Lustra Leg Sex Dream Best Director (f) John Leslie Dog Walker Michael Zen Blue Movie Paul Thomas Bobby Sox Nic Cramer Operation Sex Siege Nic Cramer Looker Best Director (v) John Leslie Bad Habits Michael Ninn Latex Michael Ninn Shock Rob Black Miscreants John Leslie The Lecher 2 Best All-Girl Sex Scene (f) The Dinner Party Celeste, Debi Diamond and Misty Rain Fantasy Chamber Felecia, Jenteal and Misty Rain Dreams of Desire Melissa Hill and Jill Kelly Satyr Missy and Jenna Jameson White Angel Laura Palmer, Ruby, Charlie and Claudia Best All-Girl Sex Scene (v) Buttslammers 4 Felecia, Bionca and Debi Diamond Takin' It to the Limit 6 Traci Allen, Careena Collins, Felecia, Jill Kelly and Misty Rain Buttslammers the 13th Missy, Misty Rain and Caressa Savage Cellar Dwellers 2 Jeanna Fine, P. J. Sparxx and Tricia Devereaux Buttslammers 16 Caressa Savage, Roxanne Hall and Charlie Most Outrageous Sex Scene (v) Depraved Fantasies Debi Diamond, Bionca and Tammi Ann Private Video Magazine 20 Sex under the Eiffel Tower (Channone, David Perry and Jean-Yves Le Castel) Shock Shayla LaVeaux, T. T. Boy and Vince Vouyer My Girlfriend's Girlfriend Mila and Kiss Ass Artist Mila Best Cinematography Dog Walker Jack Remy Sex 2 Bill Smith Unleashed Andrew Blake Zazel: The Scent of Love Philip Mond Looker Jack Remy Best All-Sex Film The Dinner Party The Player Unleashed Zazel: The Scent of Love High Heels Best All-Sex Video Takin' It to the Limit 1 & 2 Bottom Dweller 33 John Leslie's Fresh Meat 3 John Leslie's Fresh Meat 4 John Leslie's Fresh Meat 5 Best All-Girl Feature Creme de Femme Buttslammers 10 The Violation of Missy Diva 4 Welcome To The Cathouse Best Renting Title of the Year John Wayne Bobbitt Uncut Latex Shock New Wave Hookers 5 Pam & Tommy Lee: Hardcore & Uncensored Best Selling Title of the Year John Wayne Bobbitt Uncut Latex (Tie) Shock and The World's Biggest Gangbang 2 Zazel: The Scent of Love Pam & Tommy Lee: Hardcore & Uncensored Best Film Sex Blue Movie Bobby Sox Bad Wives Looker Best Sex Comedy Risqué Burlesque The Show Cellar Dweller 2 The Pornographer Best Video Feature Shame Latex Shock Buda Café Flesh 2 Best Foreign Feature Virgin Treasures The Tower 1 & 2 The Pyramid The Fugitive, Pt. 1 Tatiana Breakthrough Award Steve Perry for Ben Dover series Steve Orenstein Alex Sanders 1995 1996 1997 1998 1999 Best Performer of the Year Gay Video Joey Stefano J.T. Sloan Kurt Young Jim Buck Best Newcomer Gay Video Steve Marks Ken Ryker Kurt Young Jim Buck Best Bi-Sexual Video Revenge of the Bi Dolls Remembering Times Gone Bi Switchhitters VIII Night of the Living Bi Dolls Best Gay Video Flashpoint Renegade Flesh and Blood Naked Highway Best Actor Gay Video Ryan Idol Idol Country Ken Ryker Renegade Kurt Young Flesh and Blood Jim Buck Naked Highway Best Supporting Actor Gay Video Scott Baldwin Flashpoint Johnny Rahm All About Steve Dino Phillips Happily Ever After Bo Summers Family Values Best Director Bi-Sexual Video Josh Eliot Revenge of the Bi Dolls James C. Stark Remembering Times Gone Bi Gino Colbert Switchhitters VIII Josh Eliot Night of the Living Bi Dolls Best Director Gay Video John Rutherford Flashpoint John Rutherford The Renegade Jerry Douglas Flesh and Blood Wash West Naked Highway Best Screenplay Gay Video Gender Idol Country Jerry Douglas The Diamond Stud Jerry Douglas Flesh and Blood Wash West Naked Highway Best Sex Scene Gay Video Flashpoint Trent Reed and Bryce Colby Jawbreaker Daryl Brock, Chip Daniels, Rod Majors, Ty Russell and Scott Russell Tradewinds Derek Cameron and Kurt Young Jeff Stryker's Underground Jeff Stryker and Derek Cameron Best Non-Sexual Performance Bi, Gay, or Trans Video Sharon Kane Conflict of Interest Lana Luster Driven Home Jeanna Fine Flesh and Blood Sharon Kane Family Values Best Gay Alternative Video Vivid Video A Gay Man's Guide to Safe Sex Siberian Heat Nighthawken Summer, The First Time Best Gay Solo Video (tie) 10 Plus, Vol. 2, Rob Lee's Private Moments Rex Chandler One on One Brad Posey's Hot Sessions 3 Titan Men Alone in the Backwoods Best Gay Specialty Release The New Pledgemaster Pissed Orgy Boys 1 & 2 Fallen Angel Best Videography Gay Video Bruce Cam and Kathy Mack Idol Country Todd Montgomery Big River Bruce Cam Desert Train Wash West Naked Highway Best Alternative Adult Feature Film Killer Looks Under Lock & Key Scoring Crash * From 1999 onwards, AVN Magazine began hosting the GayVN Awards, an annual adult movie award event for gay adult video. == 2000–2004 == 2000 2001 2002 2003 2004 Best New Starlet Bridgette Kerkove Tera Patrick Violet Blue Jenna Haze Stormy Female Performer of the Year Inari Vachs Jewel De'Nyle Nikita Denise Aurora Snow Ashley Blue Male Performer of the Year Lexington Steele Evan Stone Lexington Steele Lexington Steele Michael Stefano Transsexual Performer of the Year Vaniity Best Male Newcomer Nick Manning Ben English Best Actress (f) Chloe Chloe Taylor Hayes and Raylene (tie) Ginger Lynn Taken Taylor St. Claire Fashionistas Savanna Samson Looking In Best Actress (v) Serenity Double Feature! Serenity M Caught in the Act Sydnee Steele Euphoria Devinn Lane Breathless Julia Ann Beautiful Best Actor (f) James Bonn Chloe Evan Stone Adrenaline Anthony Crane Beast Brad Armstrong Falling From Grace Randy Spears Heart of Darkness Best Actor (v) Randy Spears Double Feature! Joel Lawrence Raw Mike Horner Euphoria Dale DaBone Betrayed By Beauty Evan Stone Space Nuts Best Supporting Actress (f) Janine Seven Deadly Sins Chloe True Blue Julie Meadows Fade To Black Belladonna The Fashionistas Dru Berrymore Heart of Darkness Best Supporting Actress (v) Shanna McCullough Double Feature! Midori West Side Ava Vincent Succubus Sydnee Steele Breathless Brooke Ballentyne Rawhide Best Supporting Actor (f) Michael J. Cox Seven Deadly Sins Randy Spears Watchers Herschel Savage Taken Mr. Marcus Paradise Lost Steven St. Croix Looking In Best Supporting Actor (v) Tom Byron LA 399 Wilde Oscar West Side Mike Horner Wild Thing Randy Spears Hercules Randy Spears Space Nuts Best Non-Sex Performance Anthony Crane Double Feature! Rob Spallone The Sopornos Paul Thomas Fade To Black Tina Tyler The Ozporns Allan Rene Opera Best Tease Performance Dahlia Grey Playthings Jessica Drake Shayla's Web Tera Patrick Island Fever Belladonna The Fashionistas Michelle Wild Crack Her Jack Best Director (f) Ren Savant Seven Deadly Sins James Avalon Les Vampyres Paul Thomas Fade To Black John Stagliano The Fashionistas Paul Thomas Heart of Darkness Best Director (v) Jonathan Morgan Double Feature! Nic Andrews Dark Angels Brad Armstrong Euphoria (Tie) Michael Raven Breathless and Rocco Siffredi The Ass Collector Michael Raven Beautiful Best Director Foreign Release Anita Rinaldi Return To Planet Sexxx Tanya Hyde Hell, Whores and High Heels Kovi The Splendor of Hell Anthony Adamo Private Gladiator Gazzman The Scottish Loveknot Best All-Girl Sex Scene (f) Seven Deadly Sins Janine Lindemulder and Julia Ann Les Vampyres Ava Vincent and Syren Bad Wives 2 Jail Cell Group The Fashionistas Belladonna and Taylor St. Claire Snakeskin Dru Berrymore and Teanna Kai Best All-Girl Sex Scene (v) Tampa Tushy Fest Alisha Klass and Chloe Dark Angels Sydnee Steele and Jewel De'Nyle Where The Girls Sweat 5 Chloe, Taylor St. Claire, Sindee Coxx and Felecia I Dream of Jenna Autumn, Nikita Denise and Jenna Jameson The Violation of Jessica Darlin Jessica Darlin, Brandi Lyons, Lana Moore, Hollie Stevens, Flick Shagwell, Ashley Blue and Crystal Ray Most Outrageous Sex Scene (v) Perverted Stories 22 Mila, Herschel Savage and Dave Hardman In Days of Whore Tyce Buné and Bridgette Kerkove Perverted Stories 31 Kristen Kane, Herschel Savage and Rave Autumn Haze vs. Son of Dong Autumn Haze Perverted Stories, The Movie Julie Night, Maggie Star and Mr. Pete Best Cinematography Search for the Snow Leopard Johnny English Jake Jacobs & Ralph Parfait Blond & Brunettes Andrew Blake The Villa Andrew Blake Hard Edge Andrew Blake Best All-Sex Film Playthings Erotica Porno Vision (no award given) Hard Edge Best All-Sex Video The Voyeur 12 Buttwoman vs. Buttwoman Buttwoman Iz Bella Bring 'Um Young 9 Fetish: The Dreamscape Best All-Girl Feature The Four Finger Club 2 Hard Love/How to Fuck in High Heels The Violation of Kate Frost The Violation of Aurora Snow Babes Illustrated 13 Best Classic Release Devil In Miss Jones 3 Chameleons The Opening of Misty Beethoven Pretty Peaches 2 Insatiable Best Renting Title of the Year Devil in Miss Jones 6 Dream Quest Island Fever Briana Loves Jenna The Fashionistas Best Selling Title of the Year The Houston 620 Dream Quest Snoop Dogg's Doggystyle Briana Loves Jenna Hustlaz: Diary of a Pimp Best Film Seven Deadly Sins Watchers Fade to Black The Fashionistas Heart of Darkness Best Sex Comedy Double Feature! M Caught In the Act Cap'n Mongo's Porno Playhouse Kung-Fu Girls Space Nuts Best Foreign Feature Amanda's Diary 2 Rocco: Animal Trainer 3 Christoph's Beautiful Girls Private Gladiator The Scottish Loveknot Best Video Feature Dark Garden Dark Angels Euphoria The Ass Collector (Tie) Rawhide and Beautiful Best DVD Cashmere Raw Unreal Euphoria The Fashionistas Best High Definition Production Rawhide == 2005–2009 == 2005 2006 2007 2008 2009 Best New Starlet Cytherea McKenzie Lee Naomi Russell Bree Olson Stoya Female Performer of the Year Lauren Phoenix Audrey Hollander Hillary Scott Sasha Grey Jenna Haze Male Performer of the Year Manuel Ferrara Manuel Ferrara Tommy Gunn Evan Stone James Deen Transsexual Performer of the Year Vicki Richter Gia Darling Buck Angel Allanah Starr Wendy Williams Best Male Newcomer Tommy Gunn Scott Nails Tommy Pistol Alan Stafford Anthony Rosano Unsung Starlet of the Year Mika Tan Gianna Michaels Amber Rayne Best Actress (f) Jenna Jameson The Masseuse Savanna Samson The New Devil in Miss Jones Jessica Drake Manhunters Penny Flame Layout Best Actress (v) Jessica Drake Fluff and Fold Janine Lindemulder Pirates Hillary Scott Corruption Eva Angelina Upload Jessica Drake Fallen Best Actor (f) Justin Sterling The Masseuse Randy Spears Eternity Randy Spears Manhunters Tom Byron Layout Best Actor (v) Barrett Blade Loaded Evan Stone Pirates Evan Stone Sex Pix Brad Armstrong Coming Home Evan Stone Pirates II: Stagnetti's Revenge Best Supporting Actress (f) Lezley Zen Bare Stage Jenna Jameson The New Devil in Miss Jones Kirsten Price Manhunters Kylie Ireland, Layout Best Supporting Actress (v) Ashley Blue Adore Stormy Daniels Camp Cuddly Pines Powertool Massacre Katsumi Fashionistas Safado: The Challenge Hillary Scott Upload Belladonna Pirates II: Stagnetti's Revenge Best Supporting Actor (f) Rod Fontana The 8th Sin Randy Spears Dark Side Kurt Lockwood To Die For Randy Spears Flasher Best Supporting Actor (v) Randy Spears Fluff and Fold Tommy Gunn Pirates Manuel Ferrara She Bangs Barrett Blade Coming Home Ben English Pirates II: Stagnetti's Revenge Best Director (f) Paul Thomas The Masseuse Paul Thomas The New Devil in Miss Jones Brad Armstrong Manhunters Paul Thomas Layout Best Director (v) David Stanley Pretty Girl Joone Pirates Eli Cross Corruption John Stagliano Fashionistas Safado: Berlin Joone Pirates II: Stagnetti's Revenge (feature); Eli Cross Icon (non-feature) Best Director Foreign Release Narcis Bosch Hot Rats Rocco Siffredi Who Fucked Rocco? Pierre Woodman Sex City Alessandro Del Mar Dangerous Sex Juan Carlos and Jesus Villaobos Jason Colt: Mystery of the Sexy Diamonds (feature); Christoph Clark Nasty Intentions 2 (non-feature) Best All-Girl Sex Scene (f) The Masseuse Jenna Jameson and Savanna Samson The New Devil in Miss Jones Jenna Jameson and Savanna Samson FUCK Clara G, Felecia, Jessica Drake and Katsumi Sex & Violins Faith Leon, Monique Alexander and Stefani Morgan Best All-Girl Sex Scene (v) The Violation of Audrey Hollander Ashley Blue, Audrey Hollander, Brodi, Gia Paloma, Kelly Kline and Tyla Winn Pirates Janine and Jesse Jane Island Fever 4 Jana Cova, Jesse Jane, Sophia Santi and Teegan Presley Babysitters Alektra Blue, Angie Savage, Lexxi Tyler, Sammie Rhodes and Sophia Santi Most Outrageous Sex Scene (v) Misty Beethoven: The Musical Chloe, Ava Vincent and Randy Spears Re-Penetrator Joanna Angel Girlvert 11 Amber Wild, Steve French and Ashley Blue Ass Blasting Felching Anal Whores Cindy Crawford, Rick Masters and Audrey Hollander Night of the Giving Head Nikki Rhodes, Alan Stafford, Chris Johnson, Claire Dames, Jack Vegas & Samantha Sin Best Cinematography Flirts Andrew Blake The New Devil in Miss Jones Ralph Parfait FUCK Francois Clousot Fashion Underground Paid Companions Best High-End All-Sex Release Broken Icon Best All-Sex Release Stuntgirl Squealer (Tie) Blacklight Beauties and Neu Wave Hookers G for Gianna Alexis Texas is Buttwoman Best All-Girl Feature The Connasseur Belladonna's Fucking Girls Belladonna: No Warning Girlvana 3 Girlvana 4 Best MILF Release It's a Mommy Thing The Cougar Club Best Classic Release Deep Throat Ginger Lynn The Movie Neon Nights Debbie Does Dallas Zazel: The Scent of Love Best Renting Title of the Year 1 Night in Paris The Masseuse Pirates Debbie Does Dallas...Again Cheerleaders Best Selling Title of the Year 1 Night in Paris 1 Night in China Pirates Pirates Cheerleaders Best Film The Masseuse The New Devil in Miss Jones Manhunters Layout Cry Wolf Best Sex Comedy Misty Beethoven: The Musical Camp Cuddly Pines Powertool Massacre Joanna's Angels 2 Operation Desert Stormy Not Bewitched XXX Best Foreign Feature Hot Rats Robinson Crusoe on Sin Island Porn Wars: Episode 1 Furious Fuckers: Final Race Jason Colt : The Mystery of the Sexy Diamonds Best Video Feature Bella Loves Jenna Pirates Corruption Upload Pirates 2: Stagnetti's Revenge Best DVD Fetish Circus Pirates Best High Definition Production Island Fever 3 Pirates Fashionistas Safado Fashionistas Safado: Berlin Pirates 2: Stagnetti's Revenge The category, introduced in 2007, was first called \"Underrated Starlet of the Year (Unrecognized Excellence)\". It has since been renamed to \"Unsung Starlet of the Year\". == 2010–2014 == 2010 2011 2012 2013 2014 Best New Starlet Kagney Linn Karter Gracie Glam Brooklyn Lee Remy LaCroix Mia Malkova Female Performer of the Year Tori Black Bobbi Starr Asa Akira Bonnie Rotten Male Performer of the Year Manuel Ferrara Evan Stone Manuel Ferrara James Deen Manuel Ferrara Transsexual Performer of the Year Kimber James Bailey Jay Bailey Jay Vaniity Eva Lin Best Male Newcomer Dane Cross Seth Gamble Xander Corvus Logan Pierce Ike Diezel Unsung Starlet of the Year Shawna Leneé Charley Chase Bridgette B Brandy Aniston Presley Hart Best Actress Kimberly Kane The Sex Files: A Dark XXX Parody Andy San Dimas This Ain't Glee XXX & India Summer An Open Invitation: A Real Swinger's Party in San Francisco Jessie Andrews Portrait of a Call Girl Lily Carter Wasteland Remy LaCroix The Temptation of Eve (New Sensations Erotic Stories) Best Actor Eric Swiss Not Married With Children XXX Tom Byron The Big Lebowski: A XXX Parody Dale DaBone Elvis XXX: A Porn Parody Steven St. Croix Torn Tommy Pistol Evil Head Best Supporting Actress Penny Flame Deep Throat Lexi Belle Batman XXX: A Porn Parody Jesse Jane Fighters Capri Anderson Pee-Wee's XXX Adventure: A Porn Parody Brandy Aniston Not The Wizard of Oz XXX Best Supporting Actor Tom Byron Deep Throat Evan Stone Batman XXX: A Porn Parody Xander Corvus Star Trek: The Next Generation - A XXX Parody Tom Byron Star Wars XXX: A Porn Parody Xander Corvus Underworld Female Foreign Performer of the Year Aletta Ocean Angel Dark Aleska Diamond Aleska Diamond Anissa Kate Male Foreign Performer of the Year Toni Ribas Rocco Siffredi Director of the Year Will Ryder Axel Braun Axel Braun Axel Braun Axel Braun Best Director Feature David Aaron Clark Pure Brad Armstrong Speed Graham Travis Portrait of a Call Girl Graham Travis Wasteland Brad Armstrong Underworld Best Director Foreign Feature Moire Candy (Louis Moire/Max Candy) Ritual & Paul Chaplin Black Beauty: Escape to Eden Paul Chaplin Department S, Mission One: City of Broken Angels Ettore Buchi Mission Asspossible Max Candy Inglorious Bitches Max Candy & Michael Ninn The Ingenuous Best Boy/Girl Scene Amy Ried, Ralph Long 30 Rock: A XXX Parody Kristina Rose, Manuel Ferrara Kristina Rose Is Slutwoman Manuel Ferrara, Lexi Belle The Bombshells 3 Nacho Vidal, Alexis Ford Darkside Riley Reid & Mandingo Mandingo Massacre Best All-Girl Couples Sex Scene Tori Black, Lexi Belle Field of Schemes 5 Jenna Haze, Monique Alexander Meow! Brooklyn Lee, Ruth Medina, Samantha Bentley Brooklyn Lee: Nymphomaniac Most Outrageous Sex Scene Bobbi Starr in \"Go Fuck Yourself\" from Belladonna: No Warning 4 Adrianna Nicole, Amy Brooke, Allie Haze in \"Enema Boot Camp\" from Belladonna: Fetish Fanatic 8 Brooklyn Lee, Juelz Ventura in \"Suck My Sack With a Straw\" from American Cocksucking Sluts Brooklyn Lee, Rocco Siffredi in \"Clothespin- Head\" from Voracious: The First Season MILF Performer of the Year Julia Ann Julia Ann India Summer Julia Ann India Summer Best All-Girl Release Evil Pink 4 Meow! Cherry 2 Dani Meow! 3 Best MILF Release It's a Mommy Thing! 4 Dirty Rotten Mother Fuckers 4 Seasoned Players It's a Mommy Thing! 6 MILF Revolution Lisa Ann & Jules Jordan Best Foreign Feature Billionaire Pure Play Media Alice: A Fairy Love Tale Mission Asspossible Ass Trapped Undercover The Ingenuous Best Sex Comedy Flight Attendants Couples Camp Grindhouse XXX Nurses 2 Band Sluts == 2015–2019 == 2015 2016 2017 2018 2019 Best New Starlet Carter Cruise Abella Danger Holly Hendrix Jill Kassidy Ivy Wolfe Female Performer of the Year Anikka Albrite Riley Reid Adriana Chechik Angela White Male Performer of the Year Mick Blue Markus Dupree Manuel Ferrara Transsexual Performer of the Year Venus Lux Venus Lux Aubrey Kate Aubrey Kate Chanel Santini Best Male Newcomer Rob Piper Brad Knight Ricky Johnson Juan “El Caballo” Loco Jason Luv Unsung Starlet of the Year Presley Hart Best Actress Carter Cruise Second Chances Penny Pax The Submission of Emma Marx: Boundaries Kleio Valentien Suicide Squad XXX: An Axel Braun Parody Sara Luvv The Faces of Alice Eliza Jane Anne: A Taboo Parody Best Actor Steven St. Croix Wetwork Tommy Pistol Stryker Xander Corvus The Preacher's Daughter Tommy Pistol Ingenue Seth Gamble Deadpool XXX: An Axel Braun Parody Best Supporting Actress Veronica Avluv Cinderella XXX: An Axel Braun Parody Kleio Valentien Batman v Superman XXX: An Axel Braun Parody Joanna Angel Cindy Queen of Hell Kristen Scott – Half His Age: A Teenage Tragedy Joanna Angel – A Trailer Park Taboo Best Supporting Actor Xander Corvus Holly...Would Steven St. Croix Peter Pan XXX: An Axel Braun Parody Brad Armstrong The Preacher's Daughter Small Hands – Half His Age: A Teenage Tragedy Charles Dera – Cartel Sex Female Foreign Performer of the Year Anissa Kate Misha Cross Jasmine Jae Anissa Kate Male Foreign Performer of the Year Rocco Siffredi Danny D Ryan Ryder Rocco Siffredi Director of the Year Mason Greg Lansky Kayden Kross Best Director Feature Brad Armstrong Aftermath Paul Deeb Marriage 2.0 Jacky St. James The Submission of Emma Marx: Exposed Axel Braun – Justice League XXX: An Axel Braun Parody Axel Braun – The Possession of Mrs. Hyde Best Director Foreign Feature Herve Bodilis Anissa Kate the Widow Dick Bush The Doctor John Stagliano Hard in Love Hervé Bodilis & Pascal Lucas – Revenge of a Daughter Best Boy/Girl Scene Aidra Fox & Ryan Madison Jean Fucking Abigail Mac & Flash Brown Black & White 4 Kendra Sunderland, Mick Blue Natural Beauties Angela White & Manuel Ferrara – Angela 3, AGW/Girlfriends Avi Love & Ramón Nomar The Possession of Mrs. Hyde Best All-Girl Couples Sex Scene Angela White, Alexis Texas & Anikka Albrite Angela 2 Serena Blair, Celeste Star & Alix Lynx AI: Artificial Intelligence Melissa Moore, Elsa Jean & Adria Rae Best New Starlets 2017 Ivy Wolfe, Eliza Jane & Jenna Sativa A Flapper Girl Story Most Outrageous Sex Scene Adriana Chechik, Erik Everhard, James Deen & Mick Blue \"Two's Company, Three's a Crowd\", from Gangbang Me Lea Lexis & Tommy Pistol \"Nightmare for the Dairy Council\" from Analmals Holly Hendrix, Adriana Chechik & Markus Dupree – \"Creamy Bottom Fun Ball Happy Time\" from Holly Hendrix's Anal Experience Viking Girls Gone Horny, Desire/Girlfriends; Leya Falcon & Ophelia Rain in \"Well There's ONE Place You Can Put an AVN Award\" Charlotte Sartre, Margot Downonme & Tommy Pistol in \"My First Boy/Girl/Puppet\" from The Puppet Inside Me MILF Performer of the Year India Summer Kendra Lust Cherie DeVille Best All-Girl Release Alexis & Asa, and Women Seeking Women 100 (tie) Angela Loves Women 3, AGW/Girlfriends Angela Loves Women 4, AGW/Girlfriends Best MILF Release Dirty Rotten Mother Fuckers 7 Dirty Rotten Mother Fuckers 10 MILF Performers of the Year 2017, Elegant Angel Productions MILF Performers of the Year 2018, Elegant Angel Productions Best Foreign Feature Anissa Kate the Widow The Doctor Sherlock: A XXX Parody Bulldogs A 40 Year Old Widow Best Sex Comedy Bikini Babes Are Shark Bait Love, Sex & TV News Cindy Queen of Hell Jews Love Black Cock Love in the Digital Age Best Web Retail Store DallasNovelty.com == 2020–2022 == 2020 2021 2022 Best New Starlet Gianna Dior Scarlit Scandal Blake Blossom Female Performer of the Year Angela White Emily Willis Gianna Dior Male Performer of the Year Small Hands Tommy Pistol Transsexual Performer of the Year Natalie Mars Aubrey Kate Casey Kisses Best Male Newcomer Will Pounder Alex Mack Anton Harden Best Actress Featurette Ivy Wolfe If It Feels Right Angela White Seasons Lacy Lennon - Black Widow XXX Best Actor Featurette DVD) Tommy Pistol Another Life Tommy Pistol - Second Chance Best Leading Actress Angela White Perspective Maitland Ward Muse Kenna James - Under the Veil Best Leading Actor Seth Gamble Perspective Seth Gamble A Killer on the Loose Tommy Pistol - Under the Veil Best Supporting Actress Maitland Ward Drive Kira Noir Primary Kira Noir - Casey: A True Story Best Supporting Actor Tommy Pistol The Gang Makes a Porno: A DP XXX Parody Xander Corvus The Summoning Tommy Pistol - Casey: A True Story Female Foreign Performer of the Year Little Caprice Clea Gaultier Little Caprice Male Foreign Performer of the Year Danny D Rocco Siffredi Alberto Blanco Director of the Year Kayden Kross Ricky Greenwood Best Director Comedic Will Ryder Love Emergency Casey Calvert & Eli Cross Cougar Queen: A Tiger King Parody Jules Jordan - Flesh Hunter 15 Best Director Dramatic Kayden Kross Drive Kayden Kross Muse Kayden Kross - Psychosexual Best Director Foreign Feature Alis Locanta Rebecca, An Indecent Story Hervé Bodilis A Perfect Woman Julia Grandi - Jia Best Boy/Girl Scene DVD) Maitland Ward & Pressure Higher Power (f. Mistress Maitland), Deeper/Pulse Gianna Dior & Troy Francisco - Psychosexual Part I, Blacked Raw/Vixen Best Girl/Girl Sex Scene Aidra Fox & Kristen Scott Teenage Lesbian Elsa Jean & Emily Willis Influence Elsa Jean, Tushy Vanna Bardot & Emily Willis - Light Me Up, Explicit Acts, Slayed Best All-Girl Group Sex Scene Riley Reid, Angela White & Katrina Jade I Am Riley Emily Willis, Riley Reid & Kristen Scott Paranormal Most Outrageous Sex Scene Cherie DeVille & Michael Vegas The Ghost Rocket (Future Darkly: The Complete Second Season) Victoria Voxxx, Julia Ann & Steve Holmes Move Over, Linda Blair Scarlet Chase, Anal Slime Bath, Secret Crush/Evil Angel MILF Performer of the Year Alexis Fawx Cherie DeVille Alexis Fawx Best All-Girl Series or Channel Women Seeking Women, Girlfriends Films Women Seeking Women, Girlfriends Films Women Seeking Women, Girlfriends Films Best MILF Production 40 Years Old, Temptations of a Married Woman Moms Teach Sex 26, Nubiles/Pulse Best Foreign Production Elements Impulses One Night in Barcelona, Dorcel/Pulse Best Comedy Love Emergency Best Web Retail Store adultempire.com Bellesa Boutique == Hall of Fame == === Reuben Sturman Award === * 2000 David Sturman, General Video of America West * 2001 Ed Powers, Ed Powers Productions * 2001 Mark Kernes, Senior Editor, AVN * 2002 Gloria Leonard, Past President, AVA and Free Speech Coalition * 2002 Elyse Metcalf, Retailer Elyse's Passion * 2003 Mel Kamins, General Video of America, Cleveland * 2005 Harry Mohney, Déjà Vu Showgirls * 2006 Robert and Janet Zicari, Extreme Associates * 2007 Paul Cambria, Clyde DeWitt and Louis Sirkin * 2011 John Stagliano * 2013 Lasse Braun ==Related pages== * Transgender Erotica Awards * Pornhub Awards * XBIZ Awards * Venus Award * Sexual Freedom Awards * SHAFTA Awards * F.A.M.E. Awards * XRCO Award ==References== ==Other websites== * * Adult Video News Awards at the Internet Movie Database * \"The History of the Porn Awards and Las Vegas\" Category:AVN Awards Category:Pornography Category:1984 establishments",
 "title": "AVN Awards"
}