{
 "id": "138533",
 "text": "WrestleMania IV was the fourth annual WrestleMania professional wrestling pay- per-view event produced by the World Wrestling Federation (WWF). It took place on March 27, 1988 at the Trump Plaza in Atlantic City, New Jersey. ==Results== # Results Stipulations Times 1 Bad News Brown defeated nineteen other participants by last eliminating Bret Hart.The other participants included were: Boris Zhukov, Brian Blair, Danny Davis, George Steele, Harley Race, Hillbilly Jim, Jacques Rougeau, Jim Brunzell, Jim Neidhart, Jim Powers, Junkyard Dog, Ken Patera, Nikolai Volkoff, Paul Roma, Raymond Rougeau, Ron Bass, Sam Houston, and Sika. 20-man battle royal 10:40 2 Ted DiBiase (with Virgil and André the Giant) defeated Jim Duggan. First round tournament match 04:54 3 Don Muraco (with Billy Graham) defeated Dino Bravo (with Frenchy Martin) by disqualification. First round tournament match 04:53 4 Greg Valentine (with Jimmy Hart) defeated Ricky Steamboat. First round tournament match 09:12 5 Randy Savage (with Miss Elizabeth) defeated Butch Reed (with Slick). First round tournament match 05:07 6 One Man Gang (with Slick) defeated Bam Bam Bigelow (with Oliver Humperdink) by countout. First round tournament match 02:56 7 Rick Rude (with Bobby Heenan) and Jake Roberts fought to a time-limit draw. First round tournament match 15:00 8 The Ultimate Warrior defeated Hercules (with Bobby Heenan). Singles match 04:29 9 Hulk Hogan and André the Giant (with Ted DiBiase and Virgil) fought to a double disqualification. Quarter-final tournament match 05:22 10 Ted DiBiase defeated Don Muraco (with Billy Graham). Quarter-final tournament match 05:44 11 Randy Savage (with Miss Elizabeth) defeated Greg Valentine (with Jimmy Hart) . Quarter-final tournament match 06:06 12 Brutus Beefcake defeated The Honky Tonk Man (c) (with Jimmy Hart and Peggy Sue) by disqualification. Singles match for the WWF Intercontinental Championship 06:30 13 The Islanders (Haku and Tama) and Bobby Heenan defeated The British Bulldogs (Davey Boy Smith and The Dynamite Kid) and Koko B. Ware. Six-man tag team match 07:30 14 Randy Savage (with Miss Elizabeth) defeated One Man Gang (with Slick) by disqualification. Semi-final tournament match 04:05 15 Demolition (Ax and Smash) (with Mr. Fuji) defeated Strike Force (c) (Rick Martel and Tito Santana). Tag team match for the WWF Tag Team Championship 12:33 16 Randy Savage (with Miss Elizabeth and Hulk Hogan) defeated Ted DiBiase (with André the Giant). Tournament finals match for the vacant WWF Championship 09:27 ==References== WrestleMania 04 Category:Atlantic City, New Jersey Category:Sports in New Jersey Category:1988 in professional wrestling Category:1988 in the United States Category:1980s in New Jersey Category:March events",
 "title": "WrestleMania IV"
}