{
 "id": "138573",
 "text": "WrestleMania VI was a professional wrestling pay-per-view show made by World Wrestling Federation (WWF). It was held on April 1, 1990 at SkyDome in Toronto, Ontario, Canada. It was the sixth WrestleMania event held by the WWF. It was the first WrestleMania to be held outside of the United States. It was up from the last WrestleMania's attendance which was 18,946. The event was known for \"The Ultimate Challenge\", a match where Hulk Hogan (WWF Champion) faced The Ultimate Warrior (WWF Intercontinental Champion), in which both championship titles were on the line. ==Results== # Matches Stipulations Times 1D Paul Roma defeated The Brooklyn Brawler Singles match N/A 2 Rick Martel defeated Koko B. Ware Singles match 3:51 3 Demolition (Ax and Smash) defeated The Colossal Connection (André the Giant and Haku) (c) (with Bobby Heenan) Tag team match for the WWF Tag Team Championship 9:30 4 Earthquake (with Jimmy Hart) defeated Hercules Singles match 4:52 5 Brutus Beefcake defeated Mr. Perfect (with The Genius) Singles match 7:48 6 Roddy Piper and Bad News Brown fought to a double countout Singles match 6:48 7 The Hart Foundation (Bret Hart and Jim Neidhart) defeated The Bolsheviks (Nikolai Volkoff and Boris Zhukov) Tag team match 0:19 8 The Barbarian (with Bobby Heenan) defeated Tito Santana Singles match 4:33 9 Dusty Rhodes and Sapphire (with Miss Elizabeth) defeated Randy Savage and Sensational Queen Sherri Mixed tag team match 7:52 10 The Orient Express (Sato and Pat Tanaka) (with Mr. Fuji) defeated The Rockers (Shawn Michaels and Marty Jannetty) by countout Tag team match 7:38 11 Jim Duggan defeated Dino Bravo (with Jimmy Hart and Earthquake) Singles match 4:15 12 Ted DiBiase (c) (with Virgil) defeated Jake Roberts by countout Singles match for the Million Dollar Championship 11:50 13 Big Boss Man defeated Akeem (with Slick) Singles match 1:49 14 Rick Rude (with Bobby Heenan) defeated Jimmy Snuka Singles match 3:59 15 Intercontinental Champion The Ultimate Warrior defeated WWF Champion Hulk Hogan Singles match for the WWF Intercontinental Championship and the WWF Championship 22:51 (c) – refers to the champion(s) heading into the match D – indicates that the match was a dark match ==References== ==Other websites== *Official WrestleMania VI website Category:Sport in Toronto WrestleMania 06 Category:1990 in professional wrestling Category:1990s in Canada Category:History of Toronto Category:April events",
 "title": "WrestleMania VI"
}