{
 "id": "138615",
 "text": "Susan Featherly (February 5, 1963) is an American actress. She is best known for her appearances in Cinemax television programs and adult movies such as Kama Sutra and Corporate Fantasy. Featherly was born in Syracuse, New York. ==Movies== Yr Movie Character 2004 Grave Tales The Girl 2002 Ted Bundy Bundy Victim 2002 Deviant Vixens 2 Emily Johnson 2001 Animal Attraction III Catherine (credited as Marie West) 2001 Sinful Temptations Claudia (credited as Marie West) 2001 Virtual Girl 2: Virtual Vegas Sharon 2001 Passion Crimes Heather (credited as Jen Dike) 2001 Just Can't Get Enough Kitchen Girl 2001 Stolen Kisses Jill 2001 Soul Desires Catherine 2000 House of Love Sunny (credited as Marie West) 2000 Fast Lane to Malibu Erika (credited as Marie West) 2000 Diary of Lust Niki (credited as Michelle Turner) 1999 The Awakening of Gabriella Gabriella 1999 Andromina: The Pleasure Planet Xula (credited as Michelle Turner) 1999 Dungeon of Desire Carrie (credited as Michelle Turner) 1999 Lip Service Linda (credited as Michelle Turner) 1999 Carnal Desires Kate 1999 Corporate Fantasy Tammy ==Television appearances== Yr Program Episode Character 2002 The Best Sex Ever Mystery Writer Theresa 2001 Lady Chatterley's Stories A Few Moments in Time Sharon (credited as Michelle Turner) 2001 Lady Chatterley's Stories One Night Stand Elise (credited as Michelle Turner) 2001 Passion Cove Ghostly Passion Grace (credited as Michelle Turner) 2000 Passion Cove Blind Date Elise (credited as Michelle Turner) 2000 Bedtime Stories Strangers Danielle 2000 Kama Sutra Carnal Heat Anne (credited as Michelle Turner) 2000 Kama Sutra Conduct of a Wife 2000 Kama Sutra Ménage à Trois Sarah (credited as Michelle Turner) 1998 Arli$$ The Cult of Celebrity Girl #1 1998 Erotic Confessions Savannah Gardens Violet 1996 Hot Line Sleepless Nights Cindy ==Other websites== Category:1963 births Category:Living people Category:American movie actors Category:American television actors Category:Actors from Syracuse, New York",
 "title": "Susan Featherly"
}