{
 "id": "138633",
 "text": "Peace Sells... but Who's Buying? is the second studio album by Megadeth. Megadeth is an American thrash metal band. It was released on September 19, 1986 by Capitol Records. Combat Records was going to release the album first, but Capitol bought the rights to it. Many band members had drug abuse problems while they were making the album. Guitarist Chris Poland and drummer Gar Samuelson were fired from the band after the album came out. A song from the album, \"Peace Sells\", was the band's first music video. The art on the album's cover shows Vic Rattlehead in front of the United Nations Headquarters. Peace Sells... but Who's Buying? is one of the first thrash metal albums. Many people think it made extreme metal more popular. It was put on 1001 Albums You Must Hear Before You Die. In 2004, the album was remixed by Megadeth frontman Dave Mustaine. It was remixed again in 2011 for the album's 25th anniversary. The album's front art shows Vic Rattlehead. He is standing in front of the United Nations Headquarters. The art was made by Ed Repka. Repka made more art for the band later. == Background == In December 1985, Dave Mustaine said that the band was making music for a second album. He also said that two songs (\"Black Friday\" and \"Bad Omen\") were done. Mustaine said that these songs were much faster than the music from Megadeth's first album, Killing Is My Business... and Business Is Good!. Mustaine and bassist David Ellefson wanted to change how people thought about heavy metal by making music with political lyrics. In early 1986, Megadeth had a short tour in the United States. At the tour's concerts, the band played music that was going to be on Peace Sells. Combat Records gave them $25,000 to record the album. Recording the album was very hard because of many problems. Mustaine and Ellefson were homeless. Chris Poland and Gar Samuelson did not show up to make music very much because they were using heroin. After the band finished recording the album, someone from Capitol Records asked Megadeth to join their record label. The band joined Capitol. The album was released with Capitol Records. == Track listing == All songs written by Dave Mustaine, except \"I Ain't Superstitous\" by Willie Dixon. ==Personnel== Information is from the album liner notes. Megadeth *Dave Mustaine – guitars, singing *David Ellefson – bass guitar, singing *Chris Poland – guitars *Gar Samuelson – drums Other People Casey McMackin - singing on Good Mourning/Black Friday and My Last Words Art *Edward J. Repka – cover art and album design *Dave Mustaine, Andy Somers – cover concept Production *Dave Mustaine – production *Randy Burns – production, engineering *Casey McMackin – engineering *Paul Lani – mixing *Stan Katayama – mixing 2004 remix *Dave Mustaine – production, mixing *Ralph Patlan – engineering, mixing *Lance Dean – engineering, editing *Scott \"Sarge\" Harrison – editing *Tom Baker – mastering ==Charts== ===Weekly charts=== Chart (1986) Peak position Chart (2011) Peak position Japanese Albums Chart (Oricon) 89 ===Year-end charts=== Chart (1987) Position US Billboard 200 92 ==Certifications== ==References== Category:Megadeth albums Category:1986 albums Category:Heavy metal albums Category:Capitol Records albums",
 "title": "Peace Sells... but Who's Buying?"
}