{
 "id": "138678",
 "text": "Bop It is a series of electronic battery-powered games made by Hasbro.Bop It! [Rules & Instructions]. Hasbro. 1997.Orbanes, Philip. The Game Makers: The Story of Parker Brothers From Tiddledy Winks to Trivial Pursuit and since 2008 the game has been directed under the direction of Dan Klitsner of KID Group.Harvard Business School Press. p.iv. 2004. ==Game rules and goals== The aim of the game is to respond quickly to the directions that come out of the game's speakers. These directions are given in a way that requires the player do use different devices on the machine, such as pull handles, twist cranks, spin wheels, or toggle switches. A beat is played during the game and the beat will get faster as the player scores more points, making it harder for the player to respond. In the most recent series of Bop It's, the players goal is to beat the game by scoring 100 points. In the 90's Extreme and 02's Extreme 2 version, the goal is to beat the game by scoring 250 points. In Bop It Smash, Bounce, Beats and Tetris, the goal is to score as many points as you can. The highest possible score ever achieved on Smash is 1073 and Tetris is 874. The highest possible score on Beats is 264 on Classic and 151 on DJ (only on the foreign versions on DJ Expert and Lights Only) since those game doesn't have a limit on the highest possible score. ==Versions== Bop It can be played by one to many people at a time and has been very popular as a children's game.Szymanski, Marianne. \"The Use of Focus Groups in Toy Testing \", Advertising & Marketing to Children. Vol.1. No.2. Winthrop Publications. p.162. 25 May 1999. It was designed, invented, patented by Dan Klistner and developed by other Hasbro designers, including Bob Welch who also provided the voice for the Original Bop It. The original version was released in 1996, and there have been several versions made since then. followed by an Extreme version one year later which was voiced by Scott Parkin, a dude character from California. The Extreme was one of the first versions for it to speak to the player when they mess up. In an Interview with some well known Bop It fans on YouTube, Scott said that the line \"Game over!\" was an idea from the 1986 film Aliens. The current Classic version was released in 2019, and to mark the 25th anniversary of the original game Hasbro teamed up with Super Impulse to make the Worlds Smallest Bop It. There was an updated version of the Bop It XT titled Bop It Extreme to mark the 25th anniversary. A single button based Bop It called the Bop It! Button was released as another way to celebrate 25 years of Bop It followed by an arcade version that was colaberated with Sega called the Bop It Arcade that used colors from the 2022 Bop It Extreme. The voice does not use the regular Buddy Rubino that Bop It players are used to hearing. ==Voice actors== Since 2008, the main voice actor in the games has been Buddy Rubino, who signed a contract with Hasbro and is only allowed to do voice acting for Hasbro, but in 2020 during the course of the COVID pandemic, he has been doing some videos with Dan for his social media. Dan has archived a lot of original Buddy Rubino recordings which he has used in some of his videos on his social media. He has recorded the voice for Bop It!, Bop It! XT, Bop It! Smash!, Bop It! Tetris Bop It! New Moves, Bop It Maker and the Bop It Button. He did not do the voice for Bop It Bounce, Bop It Beats and Bop It Download. Other voice actors include, Scott Parkin, who's been announced as the voice of Bop It Extreme, Bob Welch, the voice and designer of the original Bop It, and Adam Rossi, the 'go to' voice for all prototype models. It may also been revealed that the voice actor of Brock from Pokemon, Eric Stuart, may have been the voice of Bop It Extreme 2. ==Models== ;Re-Release Series (Featuring Buddy Rubino as the Main Voice for Bop It, Twist It Pull It Games) (2008+) * Bop It! Shout ( made in 2008 - released in 2009)http://www.hasbro.com/common/documents/87e9fbe8d56fe1124784f6d2788f8ce8/421AEB0819B9F36910B5745D91F913BF.pdf * Bop It! Bounce (made in 2009 - released in 2010)Bop It! Bounce [Rules & Instructions]. Hasbro 2009. * Bop It! XT (Made in 2010 - released in 2011)Bop It! XT [Rules & Instructions]. Hasbro. 2010. * Bop It! Smash (2012) * Bop It! Tetris (2013) * Bop It! Beats (2014) - released early in late 2013 in the US * Bop It! Micro (2014) * Bop It! R2D2 (2015) * Bop It! with 10 New Moves (Made in 2015 - released in (2016) * Bop It! BB8 (2016) * Bop It Maker (2017) *Bop It Classic (2019) *Bop It! Baby Yoda (2020) *Bop It Marvel Spider-Man *Worlds Smallest Bop It - 25th Anniversary Special - (Uses the same chip as the Bop It Classic 2019 3rd edition looks like an Original Bop It - says \"Refresh US 4\" on entering Test Mode) (2022) *Bop It! Extreme (2022) - An Amazon.com exclusive, uses the same programming as the Bop It XT, says \"XT Second Mask 4\" in the Test Mode, The Bop It button is now Purple and is designed for easy players. The command design is similar to the design of the 2016 Bop It Refresh. *The Bop It! Button (2022) - A game with just one button, with 2 commands to mark the 25th anniversary - Bop It! and Don't Bop It! Uses a variety of sounds from the past 25 years of Bop It and voice actors have re- recorded clips in the game. The button is avaliable excluseively at Bop It 4 Good.com. *Bop It Arcade (2022-2023) - an arcade themed Bop It ticket remdeption game/ ;Original Series (1996-2006) * Bop It (1997) *Bop It (Second Edition) (1999-2002) *Bop It Original Remake - (2002-2004) a smaller version of the Original that runs on AAA batteries and goes up to 200 like the Second Edition original, but the difference is that in the Solo mode, it will stop the music and announce the 200 points score with 2 pull it downward whistles before the victory celebration. * Bop It Extreme (1999) * Bop It Extreme 2 (2003) * Bratz Bop It (2004), a Bratz versionBratz Bop It Instructions. Hasbro. 2004. * Bop It Blast (2005)Bop It Blast Game Instructions. Hasbro. 2005. * Bop It Download (2007) ==Bop It Clones== Since the invention of Bop It became popular in the 90's, it lead other inventors and designers to come up with other electronic games. Besides the games mentioned below, there was a family of games called the Brain family by Tiger Electronics who made the games Brain Bash, Brain Warp and the Brain Shift. ===Zing It=== Zing It is a yo-yo version of Bop It. It tells commands that the player must follow along with. Like the original Bop It, there are three commands that may be said: \"Bop it!\" (requiring the player to press the purple button), \"Zing it!\" (requiring the player to drop the yo-yo downward and send it back up again), and \"Loop it!\" (requiring the player to do the \"'round the world\" yo-yo trick). Zing It has 3 modes: \"Vox Bop\" (as with Bop It), \"Beat Bop\" (again, as with Bop It), and \"Vox Bop Challenge\" (where the game will tell a series of commands which must be done in correctly). As with Bop It and Bop It Extreme, Zing It announces the score musically by sound effects. Different tones represent different point values. There is a maximum score of 250. ===Top It=== The Top It is a kendama-style version of Bop It made by Parker Bros. (under Hasbro) that also gives commands which a player must respond to with the right action. Commands include \"Top it!\" (requiring the player to catch the ball in the red top cup), \"Flop it!\" (requiring the player to catch the ball in one of the purple side cups), and \"Flip it!\" (requiring the player to catch the ball in the purple side cup on the other side). The command structure has slightly fewer variations than any other Hasbro game, since the \"Flip it!\" command can only be issued if the \"Flop it!\" command directly precedes it.Top It Rules. Hasbro. 1999. ===Super Click It=== The Super Click It was a game released during peacetime in 1999 by MGA Entertainment in the US and Marks and Spencer in the UK and it was bought by many fans of the original Bop It. The game has 5 commands - Squish It!, Twist It!, Crack It!, Zip It! and Blast It!. The game has 2 modes - voice and sounds. When the player hits the Squish It button, the American announcer voice yells “One player!” and gives a sample command, in this case “Squish It!” and if the player selects the sounds mode, it will say “One player!” followed by a Squish It sound effect. There is also an additional 2 player mode on which the voice will yell “Switch!” after 10 commands. If Player 1 messes up, the game goes to Player 2 and then player 2 has to score 100 points to win the game! Instead of using a generic scream to say the player got it wrong, it uses cartoon sound effects like a “sad trumpet - wah wah wah waaaaaah” or the classic banana skin slip up sound or a low pitch bending bass drum. If the player beats the game, they hear a special fanfare and the voice says “Way to go!” A game before called Click It was also released and it had similar programming. Unfornately, the Click It series by MGA got cancelled after the inventor of Bop It Dan Klitsner filing a lawsuit to MGA Entertainment asking to stop making Bop It clones as Click It was infringing the rights to Bop It. No further Bop It style games were made from the Click It brand from MGA, but a game called Mischeif Metldown was sold by Marks & Spencer which has similar \"It\" commands. ===Torx=== The Torx is a Bop It spin-off made by Big Monster Toys under Hasbro that was released in 2000. The game has two twistable circles and two bendable arms that can bend in different angles 90 degrees. The game has four modes - Follow My Command, Find My Shape, Torx Says and Pass Torx. In Follow my Command, the game plays like a Bop It but the commands can get more advanced. First the voice will say \"Twist me\" but then it can command the player to \"Twist me again\" or to \"Twist me back\". If it says \"Bend me\" it can command the player to \"Bend me back\", \"Bend the same side\" or \"Bend the other side\" or to \"Straighten me.\" After every 15 points, the game will announce \"Torx Challenge\" and give the player a pattern of commands to remember. The Challenge mode is similar to the one in Top It and Zing It and the player must start the sequence after Torx has given the last command. In Find My Shape, the game unit will tell the player how close they are to the shape that Torx wants to be. It will give out directions like \"Cooler\", \"Hotter\" and when the player is near Torx will say \"On fire!\" and a celebrationary sound effect will play if they find the shape. If the player is not near the correct shape, Torx will say \"Ice cold!\", \"Warm\" or \"Warmer\". In Torx Says, the game will produce 2 different tones. At the start of the game, Torx will say \"When you hear this sound (plays the sound) - you must follow my command.\" With a normal pitched Torx unit, if the player hears an F3 tone, they must follow the command. If they hear a B flat 4 tone they must not follow the command. The game is over if the player beats the game or fails to respond or hesitate. In game four, Pass Torx, the game will player like Game 1 but instead after a certain sequence of commands, the player will hear \"Pass Torx\". The maximum score in each game mode is 240. ===NuJam Guitar=== The NuJam Guitar was a game made by KID Group and Hasbro. KID made the soundtrack for the game, along with Gary Lexemburg. The idea of the name NuJam was taken from an app that Gary was working on before it eventually become an electronic pyshical Bop It guitar. It was released in 2002 in the US and UK and sold under the name Rock It Bop It Guitar. The game has 4 actions - Strum, Twist, Slide Left and Slide Right. It also has 4 game modes - Jam, Rhythm Jam, Group Jam and Free Jam. It also has 2 different playstyles - Rock and Funk. In the Jam mode, the player has to score 300 points to win the game. The game instructions gives an error saying that after 12 points the game changes octave, however it only changes octave on 12 on the first 2 times. After 176 moves, the game goes into Double Time which makes it twice as fast. The maximum score in Jam is 300. In the Rhythm Jam mode the game does a pattern of 4 most of the game, but the patterns mix from 6-9 in later rounds. There are multiple patterns sets for Rock and Funk. In the second part of the Funk mode, the patterns are all different. In the Group Jam mode, the game plays like the Jam mode but the announcer voice says “Who’s next?” and then after a rift it says “Let’s do this!”. A mobile app for NuJam Guitar is being planned and is to be released for PC (Windows and Mac) and mobile, (iOS and Android) titled NJ RockOut as a free to play app. The project is being organised by some YouTubers who created a discussion group called Bop It Rift. The app will be using a familiar voice that was used during the original NuJam Guitar project, Adam Rossi who provided the prototype voice, and some new lines such as \"YOU... ROCKED... OUT!\" when the player beats the game. ===Groove It=== Groove It is an audio game made by Hasbro whose instructions have been copyrighted in 2003. It was voiced by Adam Rossi. With similar game play to the Bop It games, Groove It employs photodetection technology to determine the player's hand position. As with Bop It games, Groove It issues voice commands, however in this case the commands are: \"the scratch\", \"the slide\", and \"the zoom\". The game is more tolerant of errors than the Bop It games, allowing as many as three missed commands in some modes. The game requires a score of 250 to win, has a maximum score of 300, and uses a ranking system.Groove It Play Guide. Hasbro. 2003. ==Video games== In 2009, EA Games made a video game called Hasbro Family Games Night 2. It had Bop It as one of the games that could be played. It is available for the Nintendo DS and the Nintendo Wii.Hasbro Family Game Night 2 Wii . IGN. Retrieved 2010-07-07. In 2011, EA Games made an iPhone application which played exactly like the handheld game. It has the same commands from the handheld games and added extra commands which were never invented on the handheld game. ==References== ==Other websites== * Bop It instructions * Zing It Instructions Category:Toys Category:Games",
 "title": "Bop It"
}