{
 "id": "138934",
 "text": "The Ford Fiesta is a subcompact car made by Ford Motor Company from 1976 to 2023. Until 1986, it was the smallest Ford vehicle until the arrival of the Festiva (a car made by Ford in a joint-venture with Mazda and Kia in markets where the Fiesta wasn't sold). The first generation was made from 1976 to 1983 and was sold in the US from 1978 to 1980, the second generation was made from 1983 to 1989 although this version is a heavily updated first generation car, it was unusual in offering 2 different dashboard designs for basic and higher- end models of it. The third generation arrived in early 1989 and was the first Fiesta to be sold with 5-doors alongside 3, it received updates in 1992, 1994 and 1995 when it became the Fiesta Classic, selling with the newer fourth generation car until production ended in early 1997. The fourth generation arrived in late 1995 and gained a rebadged version called the Mazda 121 in early 1996, although it wasn't as popular as the Fiesta itself, it was facelifted in late 1999 and was made until 2002 when UK production of it ended. The fifth generation arrived in Spring 2002, it was facelifted in late 2005 with new colours and interior and was produced until 2008. The sixth generation Fiesta arrived in late 2008 and is sold more globally than previous generations including the US where it arrived in Spring 2010 as a 2011 model. It was facelifted in early 2013 and as a 2014 model for the US, it was sold there until 2019. The seventh generation Fiesta arrived in July 2017 with a facelift in late 2021 and the 3-door model axed in 2022. Ford ended production of the Fiesta on 7 July 2023 because of their expanding SUV lineup. ==Generations== This shows how the Ford Fiesta has changed each generation. File:Ford Fiesta (early days) Garmisch-Partenkirchen.jpg|First Generation File:Fiestamk2.jpg|Second Generation File:Ford Fiesta MK3.jpg|Third Generation File:Ford Fiesta MK4 front 20070926.jpg|Fourth Generation File:Fordfiesta.jpg|Fourth Generation Facelift File:Fordfiesta2.jpg|Fifth Generation File:Ford Fiesta VII front 20091011.jpg|Sixth Generation File:2017 Ford Fiesta Zetec Turbo 1.0 Front.jpg|Seventh Generation == References == Category:1970s automobiles Category:1980s automobiles Category:1990s automobiles Category:2000s automobiles Fiesta Category:2010s automobiles",
 "title": "Ford Fiesta"
}