{
 "id": "138930",
 "text": "In common law legal systems, a precedent or authority is a legal case that establishes a principle or rule. This principle or rule is then used by the court or other judicial bodies use when deciding later cases with similar issues or facts. The use of precedent provides predictability, stability, fairness, and efficiency in the law. The Latin term stare decisis is the doctrine of legal precedent. The precedent on an issue is the body of judicially announced principles that a court should consider when interpreting the law. When a precedent establishes an important legal principle, or represents new or changed law on a particular issue, that precedent is often known as a landmark decision. Precedent is central to legal analysis and rulings in countries that follow common law like the United Kingdom and Canada (except Quebec). In some systems precedent is not binding but is taken into account by the courts. ==Types of precedent== === Binding precedent === Precedent that must be applied or followed is known as binding precedent (alternately mandatory precedent, mandatory or binding authority, etc.). Under the doctrine of stare decisis, a lower court must honor the findings of law made by a higher court that is within the appeals path of cases the court hears. By definition decisions of lower courts are not binding on each other or any courts higher in the system, nor are appeals court decisions binding on each other or on local courts that fall under a different appeals court. Courts must follow their own proclamations of law made earlier on other cases, and honor rulings made by other courts in disputes among the parties before them pertaining to the same pattern of facts or events, unless they have a strong reason to change these rulings. One law professor has described mandatory precedent as follows: :Given a determination as to the governing jurisdiction, a court is \"bound\" to follow a precedent of that jurisdiction only if it is directly in point. In the strongest sense, \"directly in point\" means that: (1) the question resolved in the precedent case is the same as the question to be resolved in the pending case, (2) resolution of that question was necessary to disposition of the precedent case; (3) the significant facts of the precedent case are also present in the pending case, and (4) no additional facts appear in the pending case that might be treated as significant.Marjorie D. Rombauer, Legal Problem Solving: Analysis, Research and Writing, pp. 22-23 (West Publishing Co., 3d ed. 1978). (Rombauer was a professor of law at the University of Washington.) In extraordinary circumstances a higher court may overturn or overrule mandatory precedent, but will often attempt to distinguish the precedent before overturning it, thereby limiting the scope of the precedent in any event. Precedent is not \"binding\" on a judge or “mandatory” in the same sense that laws are binding on citizens. A judge can't be jailed or fined for disagreeing with it. His oath is not to precedent, but at least for federal judges, is to \"the constitution and the laws of the United States\". The Canons of Judicial Ethics do not mention obedience to precedent, but to \"the federal Constitution and that of the state whose laws they administer.\" The Code of Judicial Conduct says nothing about precedent. In most cases, precedent is the most reasonable interpretation of the Constitution and laws, in which cases the oath to the constitution is most faithfully observed by following precedent. But when a judge finds the interpretation of the Constitution in a majority opinion unpersuasive, compared to the interpretation in the dissent, then following precedent may violate the judge's oath. In a ruling where Judge Roy Moore saw such a distinction, he acknowledged its authority as precedent, but said \"[The] interpretation of the Constitution [by the Supreme Court majority] is their interpretation. But nothing can conflict with a sworn officer's oath to the Constitution.\" Of course chaos is the consequence of careless disregard of precedent. Citizens trying to obey the law need a sense of what the law is. ===Non-binding / Persuasive precedent === Precedent that is not mandatory but which is useful or relevant is known as persuasive precedent (or persuasive authority or advisory precedent). Persuasive precedent includes cases decided by lower courts, by peer or higher courts from other geographic jurisdictions, cases made in other parallel systems (for example, military courts, administrative courts, indigenous/tribal courts, State courts versus Federal courts in the United States), and in some exceptional circumstances, cases of other nations, treaties, world judicial bodies, etc. In a case of first impression, courts often rely on persuasive precedent from courts in other jurisdictions that have previously dealt with similar issues. Persuasive precedent may become binding through the adoption of the persuasive precedent by a higher court. ===Custom=== Long-held custom, which has traditionally been recognized by courts and judges, is the first kind of precedent. Custom can be so deeply entrenched in the society at large that it gains the force of law. There need never have been a specific case decided on the same or similar issues in order for a court to take notice of customary or traditional precedent in its deliberations. ===Case law=== The other type of precedent is case law. In common law systems this type of precedent is granted more or less weight in the deliberations of a court according to a number of factors. Most important is whether the precedent is \"on point,\" that is, does it deal with a circumstance identical or very similar to the circumstance in the instant case? Second, when and where was the precedent decided? A recent decision in the same jurisdiction as the instant case will be given great weight. Next in descending order would be recent precedent in jurisdictions whose law is the same as local law. Least weight would be given to precedent that stems from dissimilar circumstances, older cases that have since been contradicted, or cases in jurisdictions that have different law. ==Critical analysis of precedent== ===Court formulations=== The United States Court of Appeals for the Third Circuit has stated: :A judicial precedent attaches a specific legal consequence to a detailed set of facts in an adjudged case decision, which is then considered as furnishing the rule for the determination of a subsequent case involving identical or similar material facts and arising in the same court or a lower court in the judicial hierarchy.Allegheny General Hospital v. NLRB, 608 F.2d 965, 969-970 (3rd Cir. 1979) (footnote omitted), as quoted in United States Internal Revenue Serv. v. Osborne (In re Osborne), 76 F.3d 306, 96-1 U.S. Tax Cas. (CCH) paragr. 50,185 (9th Cir. 1996). The United States Court of Appeals for the Ninth Circuit has stated: :Stare decisis is the policy of the court to stand by precedent; the term is but an abbreviation of stare decisis et non quieta movere — \"to stand by and adhere to decisions and not disturb what is settled.\" Consider the word \"decisis.\" The word means, literally and legally, the decision. Under the doctrine of stare decisis a case is important only for what it decides — for the \"what,\" not for the \"why,\" and not for the \"how.\" Insofar as precedent is concerned, stare decisis is important only for the decision, for the detailed legal consequence following a detailed set of facts.United States Internal Revenue Serv. v. Osborne (In re Osborne), 76 F.3d 306, 96-1 U.S. Tax Cas. (CCH) paragr. 50,185 (9th Cir. 1996). Precedents viewed against passing time can serve to establish trends, thus indicating the next logical step in developing interpretations of the law. For instance, if immigration has become increasingly restricted under the law, then the next legal decision on that subject may serve to restrict it further still. Scholars have recently attempted to apply network theory to precedents in order to establish which precedents are most important or authoritative, and how the court's interpretations and priorities have changed over time.James H. Fowler and Sangick Jeon, \"The Authority of Supreme Court Precedent,\" Social Networks (2007), doi:10.1016/j.socnet.2007.05.001 ===Super stare decisis=== Super-stare decisis is a term used for important precedent that is resistant or immune from being overturned, without regard to whether correctly decided in the first place. It may be viewed as one extreme in a range of precedential power,Sinclair, Michael. \"Precedent, Super-Precedent\" , George Mason Law Review (14 Geo. Mason L. Rev. 363) (2007) or alternately, to express a belief, or a critique of that belief, that some decisions should not be overturned. In 1976, Richard Posner and William Landes coined the term \"super-precedent,\" in an article they wrote about testing theories of precedent by counting citations.Landes, William & Posner, Richard. “Legal Precedent: A Theoretical and Empirical Analysis”, 19 Journal of Law and Economics 249, 251 (1976). Posner and Landes used this term to describe the influential effect of a cited decision. The term \"super-precedent\" later became associated with different issue: the difficulty of overturning a decision.Hayward, Allison. The Per Curiam Opinion of Steel: Buckley v. Valeo as Superprecedent? , Cato Supreme Court Review 195, 202, (2005-2006). In 1992, Rutgers professor Earl Maltz criticized the Supreme Court's decision in Planned Parenthood v. Casey for endorsing the idea that if one side can take control of the Court on an issue of major national importance (as in Roe v. Wade), that side can protect its position from being reversed \"by a kind of super-stare decisis.\"Maltz, Earl. \"Abortion, Precedent, and the Constitution: A Comment on Planned Parenthood of Southeastern Pennsylvania v. Casey\", 68 Notre Dame L. Rev. 11 (1992), quoted by Rosen, Jeffrey. So, Do You Believe in 'Superprecedent'?, NY Times (2005-10-30). The issue arose anew in the questioning of Chief Justice John G. Roberts and Justice Samuel Alito during their confirmation hearings before the Senate Judiciary Committee. Before the hearings the chair of the committee, Senator Arlen Specter of Pennsylvania, wrote in the New York Times referring to Roe as a \"super-precedent.\" He mentioned the concept (and made seemingly humorous references to \"super-duper precedent\") during the hearings, but neither Roberts nor Alito endorsed the term or the concept.Benac, Nancy. Roberts Repeatedly Dodges Roe v. Wade , Associated Press (2005-09-13): Specter asked, \"Would you think that Roe might be a super-duper precedent?\" ===Criticism of Precedent=== In a controversial 1997 book, attorney Michael Trotter blamed over-reliance by American lawyers on binding and persuasive authority, rather than the merits of the case at hand, as a major factor behind the escalation of legal costs during the 20th century. He argued that courts should ban the citation of persuasive precedent from outside their jurisdiction, with two exceptions: :(1) cases where the foreign jurisdiction's law is the subject of the case, or :(2) instances where a litigant intends to ask the highest court of the jurisdiction to overturn binding precedent, and therefore needs to cite persuasive precedent to demonstrate a trend in other jurisdictions.Michael H. Trotter, Profit and the Practice of Law: What's Happened to the Legal Profession (Athens, GA: University of Georgia Press, 1997), 161-163. == Related pages == * Test case (law) ==Notes== Category:Legal terms",
 "title": "Legal precedent"
}