{
 "id": "139042",
 "text": "The Lion King 1½ (known as The Lion King 3: Hakuna Matata in some countries) is a 2004 American theatrically animated comedy film and direct-to-video animated comedy film. It is based on The Lion King's Timon and Pumbaa and serves as a third installment, sidequel to The Lion King. It is a final installment in the trilogy and the sidequel to The Lion King. All three movies were made by The Walt Disney Company. This movie is about the fictional characters Timon and Pumbaa before they met Simba. ==Release== The Lion King was released on February 10, 2004. Internationally, it was titled The Lion King 3: Hakuna Matata. == The story == Timon and Pumbaa start to watch the original Lion King movie, but Timon keeps insisting to fast forward to when they come in, because they were not seen in the beginning of the story or anywhere until halfway through. Pumbaa suggests telling the audience their story, which begins before Simba's journey begins. Through this, we meet Timon's mother and Uncle Max, discover why he left his meerkat colony, where he learned Hakuna Matata, how he met Pumbaa, and the perils they encountered while searching for their dream home. ==Voice cast== Appearing but silent are Simba's father Mufasa, mother Sarabi and uncle Scar. == Soundtrack == The movie's soundtrack, The Lion King 1½: Songs From Timon and Pumbaa's Hilarious Adventure, was released on CD by Disney Records on February 10, 2004. It includes two songs from the original movie, \"That's All I Need\" and \"Hakuna Matata\", reperformed by Nathan Lane who took over the role of voicing the character Timon. The rest of the soundtrack includes various R&B; tracks, including remakes of the Kool and the Gang classic \"Jungle Boogie\" by artist French, and two instrumental pieces from film composer Don Harper. ;Track listing ==Awards== Year Award Category Nominees Result 2005 Annie Awards Best Home Entertainment Production The Lion King 1½ Music in an Animated Feature Production The Lion King 1½ DVD Exclusive Awards Best Animated Character Performance Nathan Lane (voice) Alexis Stadermann (animator) * For Timon Best Animated DVD Premiere Movie The Lion King 1½ Best Director (of a DVD Premiere Movie) Bradley Raymond Best Editing (of a DVD Premiere Movie) Joyce Arrastia Best Screenplay (for a DVD Premiere Movie) Tom Rogers Saturn Award Best DVD Release The Lion King 1½ == Video game == A video game version of the movie was published in 2003 for the Game Boy Advance. It had Timon and Pumbaa as the playable characters. == References == == Other websites == * * * * Category:2004 movies Category:2004 animated movies Category:American family movies Category:English-language movies Category:Sequel movies Category:Movies about lions Category:Movies set in Africa Category:The Lion King Category:Direct-to-video movies Category:Disney direct-to-video movies Category:Annie Award winners",
 "title": "The Lion King 1½"
}