{
 "id": "139024",
 "text": "Cinderella is a 1950 American animated musical fantasy movie produced by Walt Disney. It was released to theaters on February 15, 1950, by RKO Radio Pictures. It is the 12th movie in the Walt Disney Animated Classics series. It is based on the fairy tale Cendrillon by Charles Perrault. It was directed by Clyde Geronimi, Hamilton Luske and Wilfred Jackson. The songs in the movie were written by Mack David, Jerry Livingston, and Al Hoffman. Songs in the movie include \"A Dream Is a Wish Your Heart Makes\", \"Bibbidi-Bobbidi-Boo\", \"So This Is Love\", \"Sing Sweet Nightingale\", \"The Work Song\", and \"Cinderella\". A live-action re-imagining produced by Walt Disney Pictures, directed by Kenneth Branagh and starring Lily James as Cinderella, Richard Madden as Prince Charming, Cate Blanchett as Lady Tremaine, and Helena Bonham Carter as The Fairy Godmother, was released in 2015. It was a commercial success, and Branagh's highest-grossing film to date. This movie has a direct-to-video sequel called Cinderella II: Dreams Come True, was released in 2002. == Plot == This story is narrated by Betty Lou Gerson. The narrator tells the prologue in these words: Once upon a time in a faraway land, there was a tiny kingdom; peaceful, prosperous, and rich in romance and tradition. Here in a stately chateau, there lived a widowed gentleman, with his little daughter, Cinderella. Although he was a kind and devoted father, he gave his beloved child every luxury and comfort. Still, he felt she needed a mother's care. And so, he married again, choosing for his second wife, a woman of good family, with two daughters just Cinderella's age, by name: Anastasia and Drizella. It was upon the untimely death of this good man, however, that the stepmother's true nature was revealed: cold, cruel, and bitterly jealous of Cinderella's charm and beauty, she was grimly determined to forward the interests of her own two awkward daughters. Thus, as time went by, the chateau fell into disrepair, for the family fortunes were squandered upon the vain and selfish stepsisters while Cinderella was abused, humiliated, and finally forced to become a servant in her own house. And yet, through it all, Cinderella remained ever gentle and kind, for with each dawn she found new hope that someday her dreams of happiness would come true. Meanwhile, across town in the castle, the King determines that his son the Prince should find a suitable bride and provide him with a required number of grandchildren. So the King invites every eligible maiden in the kingdom to a fancy dress ball, where his son will be able to choose his bride. Cinderella has no suitable party dress for a ball, but her friends the mice, lead by Jaq and Gus, and the birds lend a hand in making her one, a dress the evil stepsisters, Anastasia and Drizella, immediately tear apart on the evening of the ball. After that the stepmother, Lady Tremaine, Anastasia and Drizella went to the ball and Cinderella cried in the garden. Her sadness finished after her Fairy Godmother by used the magic gave to her a coach, a coachman, horses, a footman and a light beautiful silver with diamonds ball gown with glass slippers, but the Godmother warns Cinderella must return before midnight because everything will turn in their true form. In the ball she and the Prince falls in love and the King believes Cinderella is the best daughter-in-law but at midnight Cinderella ran away because the Fairy Godmother's magic was ending. She forgot her one glass slipper after that the Prince search for her by all the young maids wear the slipper. When Cinderella learned that accidentally uncovered to Lady Tremaine who locked her in her room. But when the Duke came in the home and Anastasia and Drizella started to wear the slipper, while Jaq and Gus took the key and freed Cinderella after Lucifer gets chased away by Bruno and he jumps out of the tower's window. She wore the slipper and married the Prince to live with her love and friends happily ever after. As the book closes, the word \"The End\" appears and the movie ends. == Voice cast == * Ilene Woods as Cinderella. * Eleanor Audley as Lady Tremaine. * Verna Felton as Fairy Godmother. * Rhoda Williams as Drizella. * James MacDonald as Jaq, Gus, and Bruno. * Luis van Rooten as The King and Grand Duke. * Don Barclay as The Doorman. * Lucille Bliss as Anastasia. * William Phipps as Prince Charming. Mike Douglas provided his singing voice. * Marion Darlington as The Birds. * Earl Keen as Additional Bruno Vocal Effects. * Lucille Williams as Perla. * June Foray as Lucifer. * Thurl Ravenscroft as Bert. * Clint McCauley as Mert. * June Sullivan as Suzy. * Helen Seibert as Blossom. * Betty Lou Gerson as The Narrator. Additional voices were provided by Claire du Brey, Helene Stanley, Jeffrey Stone and John Woodbury. == References == == Other websites == * * * * Category:1950 romance movies Category:1950s family movies Category:American family movies Category:1950s American musical fantasy movies Category:1950s American romance movies Category:Disney animated movies Category:1950s English-language movies Category:Movies based on fairy tales Category:Movies composed by Oliver Wallace Category:Movies composed by Paul Smith Category:Movies about royalty Category:Movies about weddings Category:Movies about fairies and sprites Category:Movies about wish fulfillment Category:Movies about mice Category:Movies about birds Category:Movies set in castles Category:Movies set in the 1850s Category:Movies directed by Clyde Geronimi Category:Movies directed by Hamilton Luske Category:Movies directed by Wilfred Jackson",
 "title": "Cinderella (1950 movie)"
}