{
 "id": "139157",
 "text": "The Penguin (Oswald Chesterfield Cobblepot) is a fictional character and an enemy of Batman appearing in American comic books published by DC Comics. The character made his first appearance in Detective Comics #58 (December 1941) and was created by Bob Kane and Bill Finger. He is one of Batman's most oldest enemies and he and some other Batman villiains are Batman's rogues gallery. == Fictional character biography == Born Oswald Chesterfield Cobblepot, the Penguin was teased very much in his childhood due to his short stature, obesity, and bird-like nose. These traits made him an outcast in his rich, debutante family. Their rejection drove him to become evil. The Penguin is a Gotham City mobster who calls himself the \"Gentleman of Crime\". He is most often seen wearing a monocle, top hat, and tuxedo while carrying his umbrella as a weapon. The character appears most times as a short, fat man with a long nose. == Powers and abilities == The Penguin uses high-tech umbrellas as different tools. His umbrellas have been used as guns, gas guns, swords/knives, a mini-helicopter and many other unconventional tools. The Penguin owns and runs a nightclub called the Iceberg Lounge which provides a cover for his criminal activity. == In other media == The character has subsequently been adapted to different forms of media, including movies, tv shows and video games as well. He was played by Burgess Meredith in the 1960s television series Batman and in Batman: The Movie. He was played by Danny DeVito in Batman Returns, Robin Lord Taylor in the 2014 TV series Gotham. He was played by Colin Farrell in the 2022 movie The Batman and in the 2024 limited series The Penguin. The Penguin has repeatedly been named one of the best Batman villains and one of the greatest villains in comics. Penguin was ranked #51 in IGN's list of the Top 100 Comic Book Villains of All Time. ==References== Category:Batman characters Category:DC Comics characters Category:Fictional characters introduced in 1941 Category:Villains",
 "title": "Penguin (character)"
}