{
 "id": "139383",
 "text": "The pre-1600 Atlantic hurricane seasons talks about all known Atlantic tropical cyclones before to 1600. While info for every storm that happened is not available, some parts of the coastline had enough people to give info of hurricane happenings. Each season was an event in the annual cycle of tropical cyclone formation in the Atlantic basin. Most tropical cyclone formation occurs between June 1 and November 30. Atlantic hurricane seasons Pre-1600 1600s/10s 1620s/30s Observation info for years before 1492 is completely unavailable because record keeping was non-existent in the pre-Columbian era, and any records that may have once existed have long since been lost. Even info from the early years of the Columbian era is suspect and incomplete because the difference between a hurricane and an extratropical system was not drawn by Renaissance scientists and sailors and because European exploration and colonization of the regions affected by hurricanes did not begin in earnest until the mid-16th century. However, paleotempestological research allows reconstruction of pre- historic hurricane activity trends on timescales of centuries to millennia. A theory has been postulated that an anti-phase pattern exists between the Gulf of Mexico coast and the Atlantic coast. During the quiescent periods, a more northeasterly position of the Azores High would result in more hurricanes being steered towards the Atlantic coast. During the hyperactive period, more hurricanes were steered towards the Gulf coast as the Azores High—controlled by the North Atlantic Oscillation—was shifted to a more southwesterly position near the Caribbean. In fact, few major hurricanes struck the Gulf coast during 3000–1400 BC and again during the most recent millennium; these quiescent intervals were separated by a hyperactive period during 1400 BC and 1000 AD, when the Gulf coast was struck frequently by catastrophic hurricanes and their landfall probabilities increased by 3–5 times. On the Atlantic coast, chance of landfalling hurricanes has doubled in the recent millennium compared to the one and a half millennia before. ==Storms== ===Pre-1525=== Year Location Date Deaths Damage/Notes 1494 Hispaniola June 16 N/A Possible hurricane; could have been the first hurricane in the Western Hemisphere observed and reported by Europeans. 1495 West Indies N/A N/A 3 ships sunk, earliest definite report of a hurricane, came from Christopher Columbus; \"Nothing but the service of God and the extension of monarchy would expose me to such danger\" 1500 Bahamas July N/A 2 ships destroyed 1502 Hispaniola July 1 N/A 20 ships, all on board died 1502 Offshore Dominican Republic 11 July 500 N/A 1502 Honduras 16 September N/A 1 ship sunk, all drowned aboard 1504 North Coast of Colombia N/A 175 N/A 1508 Dominican Republic 12 August Many Destroyed entire population of Buenaventura 1509 Santo Domingo 29 July N/A Moderate damage 1515 Puerto Rico July Many natives N/A 1519 Jamaica N/A N/A Ship sunk, 18 survived 1520 Dominican Republic N/A N/A N/A 1523 Florida west coast N/A N/A 2 ships and their crews lost 1524 Cuba October 73 N/A ===1525-1549=== Year Location Date Deaths Damage/Notes 1525 Western Cuba Late October 73 N/A 1525 Honduras N/A N/A N/A 1526 Wilmington, North Carolina June N/A 1 Spanish ship lost 1527 Western Cuba October 70 Severe flooding 1527 near mouth of the Mississippi 23 October unknown possibly associated with previous storm; barges under Panifo de Narvaez tossed like driftwood 1527 Upper Texas Coast November 200 1 of only 2 November Texas hurricanes, Merchant fleet destroyed 1527 Dominican Republic N/A N/A made landfall at Santo Domingo 1529 Puerto Rico July 28–29 N/A made landfall at San Juan de Puerto Rico 1530 Puerto Rico Aug. 31 \"Uncounted number of deaths by drowning\" N/A 1533 Puerto Rico N/A Many slaves killed Possibly 3 hurricanes 1537 Puerto Rico N/A Many slaves drowned N/A 1537 Northwest Cuba N/A N/A 2 ships lost 1545 Dominican Republic Aug. 20 Many N/A 1545 Mexico N/A N/A 1 ship lost 1545 Cuba N/A N/A made landfall at Havana 1546 Dominican Republic N/A N/A N/A 1546 Puerto Rico Aug. 24 N/A made landfall at San Juan de Puerto Rico ===1550-1574=== Year Location Date Deaths Damage/Notes 1550 Florida Keys N/A N/A Ship lost near Havana 1551 Gulf of Honduras N/A Many One ship sunk, all drowned 1552 Dominican Republic Aug. 28–29 N/A made landfall at Santo Domingo 1552 Mexico Sep. 2–4 N/A made landfall at Vera Cruz 1552 Florida Sep. 3–6 N/A N/A 1553 Western Florida N/A 700 N/A 1553 Texas N/A Many drownings Sixteen ships lost 1554 Cuba November N/A One ship sank 1554 South Texas N/A N/A Three ships lost 1559 Western Florida August 20 500 N/A 1565 Offshore Eastern Florida September 22 N/A French ships lost at sea 1566 Eastern Florida September 13 N/A N/A 1566 Offshore Eastern Florida September 24 N/A N/A 1566 Gulf of Mexico N/A 5+ Four ships destroyed 1567 Near Dominica N/A N/A Six ships destroyed 1569 Bahamas Sep. N/A passed the Bahamas Channel 1571 Cuba/Jamaica Oct. 18–21 N/A N/A 1571 St. Augustine, Florida N/A N/A Heavy flooding, two ships lost ===1575-1599=== Year Location Date Deaths Damage/Notes 1576 Dominican Republic N/A N/A made landfall at Monte Cristi Province 1577 Cuba/Jamaica Aug./Sep. N/A N/A 1578 Dominican Republic N/A N/A made landfall at Ocoa 1578 Cuba/Jamaica Oct. N/A N/A 1579 Atlantic Ocean N/A N/A Spanish Armada's 600 ton Almirante sunk 1579 Jamaica N/A N/A N/A 1579 Bermudas Sep. 13 N/A N/A 1579 Bermudas Sep. 26 N/A N/A 1583 Dominican Republic Aug. 19 N/A made landfall at Santo Domingo 1586 Roanoke Island June 23- June 26 N/A First of many storms to hit the first colonial settlement 1586 Bahamas N/A N/A Nine ships lost, possibly related to above 1587 Roanoke Island August 31 N/A Sir Francis Drake took six days to regroup in Roanoke after the storm 1588 Roanoke Island N/A 116 Third of four hurricanes to hit the area in five years 1588 Cuba Sep. 20 N/A made landfall near Havanna 1588 Colombia Nov. 4–6 N/A made landfall near Cartagena de Indias 1589 Leeward Islands Aug. 7 N/A N/A 1589 Bahamas September 9 N/A four ships sank 1590 Gulf of Mexico \"Early 1590\" 1000 N/A 1591 Atlantic Ocean August 10 501 Waves and rain, twenty two ships lost 1591 Florida September N/A made landfall near Las Tortugas 1591 Puerto Rico September 21 N/A N/A 1591 Cuba September 24 N/A N/A 1594 Caribbean Sea N/A N/A One ship lost 1595 Cuba Aug. 29–30 N/A N/A 1599 Florida Sep. 22 N/A made landfall near St. Augustine ==Related pages== *List of Atlantic hurricane seasons ==References== ==Further reading== * * * * ==Other websites== *http://www.nhc.noaa.gov/pastdeadlyapp1.shtml *http://www.candoo.com/genresources/hurricane.htm *http://www.hpc.ncep.noaa.gov/research/roth/vahur.htm *http://www.srh.noaa.gov/lch/research/la18hu.php 1599 and before",
 "title": "Pre-1600 Atlantic hurricane seasons"
}