{
 "id": "139367",
 "text": "Yao Ming (; born September 12, 1980) is a Chinese former professional basketball player. He played for the Houston Rockets of the National Basketball Association (NBA). He was the tallest player in the NBA, at 7 foot, 6 inches. (2.29m). Yao Ming was born at Shanghai Sixth People's Hospital in Shanghai, He is only child by Yao Tzi Yuan and Fong Fengdi , There are professional basketball players by their family, He started with the Shanghai Sharks as a teenager and played on their senior team for five years in the Chinese Basketball Association (CBA). The team won a championship in his final year. Then he entered the 2002 NBA Draft. The CBA had to release him, and he was selected by the Houston Rockets to play on their team. He had also been chosen to play for the NBA All-Star Game for all six of his seasons. However, the Rockets have not advanced past the first round of the playoffs since he joined the team, and he has also had injuries in each of the past three seasons. On July 20, 2011, Yao Ming announced that he was retiring from basketball after many foot and ankle injuries. His father, Yao Zhiyuan, is in tall; his mother, Fengdi Fang, is in tall. She was captain of the Chinese national women's basketball team. Yao Ming's parents were the tallest couple in China when he was born. Yao Ming is married to Ye Li, who used to play for the China women's national basketball team. He is one of China's best-known athletes. He has sponsorships with several major companies, and he has been the richest celebrity in China for six straight years, earning US$51 million (CN¥357 million) in 2008. His rookie year in the NBA was the subject of a documentary film, The Year of the Yao, and in 2004 he wrote an autobiography titled Yao: A Life in Two Worlds. As well as his other book a in the previous year The Tao of Yao: Wit and Wisdom from the Moving Great Wall Yao Ming ==References== ==Other websites== *Yao Ming's NBA profile Category:1980 births Category:Living people Category:Autobiographers Category:Centers (basketball) Category:Chinese basketball players Category:Chinese philanthropists Category:Houston Rockets players Category:Naismith Memorial Basketball Hall of Fame inductees Category:Sportspeople from Shanghai",
 "title": "Yao Ming"
}