{
 "id": "13953",
 "text": "The Ku Klux Klan (KKK) is an American pale White supremacist hate group. A group of Confederate veterans created the original KKK in Pulaski, Tennessee on December 24, 1865. This was shortly after the Confederacy lost the American Civil War. The group quickly expanded among White people in the southern United States. There have been several versions of the Ku Klux Klan. The original Klan lasted till 1871, when the group was made illegal. In 1915 an Atlanta businessman named William J. Simmons started the Ku Klux Klan for a second time. The third KKK emerged in the 1950s and 1960s in response to the American Civil Rights Movement. The KKK's power and membership have greatly declined in recent years. In 2023 there were just 10 active Klan groups in the United States. ==Goals== The KKK's goal is to maintain 'white power' over minority groups. Most of their hatred is, and has always been, directed at African Americans. However, the KKK has also attacked Catholics, Jews and immigrants. It is a violent organization and was frequently involved with lynchings. ==Early years== A group of Confederate veterans, led by Nathan Bedford Forrest, created the original Ku Klux Klan shortly after the American Civil War ended, during Reconstruction. It began as a social club for former Confederate soldiers, who had fought to defend slavery. The Klan quickly became a terrorist organization. According to the Southern Poverty Law Center: > [The first] Ku Klux Klan [was] a vigilante group mobilizing a campaign of > violence and terror against the African American people that benefited from > the progress of Reconstruction. As the group gained members from all strata > of Southern white society, it used violent intimidation to prevent Black > Americans – and any white people who supported Reconstruction – from voting > and holding political office. When the KKK started, northern soldiers were occupying the former Confederate States of America. Klan members feared that white people in the South could lose their supremacy over black people. The Klan used violence and intimidation towards black voters to prevent them from voting. At times, Republicans were also attacked by the Klan. The Klan used threats and violence to terrorize black people. When they wanted a person to leave town, they would burn crosses or threaten violence in order to scare them away. If the person did not leave, the Klan would kill them. Increasingly, the Klan used and promoted violence. Klan members participated in lynching many black men. The growing violence promoted by the KKK led to many lynchings (executions without a fair trial, often by hanging). In 1871, the group was outlawed. Many KKK members were put in prison. Still, the group continued its efforts to maintain white supremacy. It disbanded after the Jim Crow Laws enforced segregation, achieving the Klan's goal to maintain white supremacy. By the time it disbanded, the original Ku Klux Klan had achieved many of its original goals. For instance, the United States government moved the troops occupying the Southern states into the West. The KKK also successfully prevented many black people from voting through violence, intimidation, and the threat of lynchings. ==The second Ku Klux Klan== In 1915, William J. Simmons, an Atlanta businessman, re-started the Ku Klux Klan. A movie called The Birth of a Nation had just been released. It portrayed African-American men (played by white actors in blackface) as stupid and sexually aggressive towards white women. It also showed the Ku Klux Klan as a heroic force. The movie proved to be an excellent recruitment tool for the KKK. The new KKK kept most of the original group's rituals and traditions. Any white Protestant man could join. This version of the Klan attacked not just African Americans but also Jews, Catholics, and Southern and Eastern European immigrants (like Italians, Russians, and Lithuanians), many of whom were Jewish or Catholic. In 1920, the Klan began attracting recruits from all over the nation. They promised better law enforcement, better government, better schools, and a return to traditional family values. The KKK's views were based on White supremacy: the belief that white people are superior to other racial groups and ought to rule them. There were a number of scandals within the second KKK, a great deal of internal feuding, and unhappiness among Klan members who were tiring of the group's violent image. ===Statistics=== The second KKK reached the height of its influence in the 1920s, with about 5 million members. However, the group's influence and membership declined quickly. By the 1930s there were just 30,000 Klan members in the country. The group was prosecuted for failure to pay federal income taxes and disbanded in 1944. In 86 years, the KKK killed an estimated 3,446 black people. Most of these murders were extrajudicial hangings where the victim had received no trial. These were acts of terrorism because the KKK used fear to control African Americans and take away their political rights. ==The third Ku Klux Klan== In 1954, the United States Supreme Court (the highest court in the US) decided Brown v. Board of Education of Topeka, Kansas, one of the most important court cases in American history. They ruled that it was unconstitutional to have different schools for black and white children. After this ruling, many independent Ku Klux Klan groups increased their attacks on African Americans. ===Civil Rights Movement=== In the summer of 1964, KKK member Edgar Killen killed three African Americans who participated in the civil rights movement. In his first trial, an all-white jury could not agree on whether Killen was guilty. This is called a hung jury. As a result, Killen was set free. These events were later discussed in a 1988 movie called Mississippi Burning. In 2005 Killen was tried again for the three murders, and this time he was found guilty. Killen, who was 80 years old at the time, was sentenced to prison for 60 years. He died on January 11, 2018 in prison in Parchman, Mississippi at age 92. ===Membership=== In 2011, the KKK was estimated to have as many as 5,000 members. ==Connections with other ideologies== ===Islamism=== ====2000s==== David Duke, who led the KKK between 1974 and 1980, has deep connections with Islamist groups, especially the Iranian regime. On December 11 – 13, 2006, Duke attended a Holocaust-denying conference in Iran after being invited by the Iranian government. There, he claimed that Zionists used the Holocaust to deny rights to Palestinians. He said: > The Holocaust is the device used as the pillar of Zionist imperialism, > Zionist aggression, Zionist terror and Zionist murder. Duke was one of the 70 participants at the conference. ====2010s==== On September 11, 2012, Duke was interviewed by the Iranian state television Press TV. During the interview, he claimed that \"the Jews created the 9/11 attack and Iraq War in the media, the government and international finance\". He repeated the claim in another Press TV interview in 2013, insisting that the \"Jews' control of the U.S. is the world's greatest single problem\". Duke was not the first to express this conspiracy theory. Henry Ford made this same accusation in the 1920s. Later, Adolf Hitler used the idea to justify World War II and the Holocaust. ====2020s==== In June 2024, Duke attended a pro- Palestine event along with radical traditionalist Catholics Nick Fuentes * * * * * and Jake Shields. * * * * * There they preached to Muslim attendees, making these claims: * The Jews had a plan to set up 'greater Israel' by war, revolution and subterfuge\" * Muslims and White nationalists share the same fight against \"Jewish supremacy\" * The \"Jews are genociding Palestinians in Gaza just as they are genociding White people in America\" ==Related pages== * Racism * Afrophobia * Antisemitism * Angry white male * White nationalism == References == Category:1865 establishments in the United States Category:1860s in the United States Category:20th century in the United States Category:21st century in the United States Category:African-American history Category:Crime in the United States Category:Discrimination Category:Cults Category:Gangs Category:Secret societies Category:White supremacists Category:Racism Category:Political organizations based in the United States",
 "title": "Ku Klux Klan"
}