{
 "id": "139611",
 "text": "Drôme () is a French department in southeastern France in the Auvergne-Rhône- Alpes region and named after the Drôme river. Its prefecture is the city of Valence. ==History== Drôme is one of the 83 French departments made during the French revolution, on 4 March 1790; it was made with part of the old French province of Dauphiné. It was divided in 6 districts: Romans, Valence, Die, Buis, Montélimar,and Crest. The capital was Chabeuil but in the same year the capital was moved to Valence. With the creation of the arrondissements, the 6 districts became four arrondissements: Valence, Die, Montélimar and Nyons. In 1926, the arrondissement of Montélimar was eliminated. ==Geography== Drôme is part of the Auvergne-Rhône-Alpes region, in southeastern France, with an area of . The department borders with 5 other departments in 2 regions: * Provence- Alpes-Côte d'Azur ** Hautes-Alpes (east) ** Alpes-de-Haute-Provence (southeast) ** Vaucluse (south) * Auvergne-Rhône-Alpes ** Ardèche (west) ** Isère ( north and east) There are 5 natural regions in Drôme; they are, from north to south: # A region with hills. # The plain of Valence to the west. # The Vercors Massif to the east. # The central part of the department formed by the valley of the Drôme river and the highest mountains in the department. # The Drôme provençale to the south. The highest point in the department is Rocher Rond, (). It is high; it is on the border with the Hautes-Alpes department. The main rivers of Drôme are: * Rhône, in the western part of the department; in the department, it is only long. * Drôme river, a tributary of the Rhône. * Isère river, another tributary of the Rhône. ===Climate=== The climate of the Drôme department, in the city of Valence, is an oceanic climate, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average temperature for the year in Valence, at an altitude of , is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The average amount of precipitation for the year in Valence is . The month with the most precipitation on average is September with of precipitation. The month with the least precipitation on average is February with an average of . ==Administration== Drôme is part of the region of Auvergne-Rhône-Alpes. The department is managed by the Departamental Council of the Drôme in Valence. ===Administrative divisions=== There are 3 arrondissements (districts), 23 cantons and 353 communes (municipalities) in Drôme. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 261 Die Die 42,955 2,286.9 113 262 Nyons Nyons 141,971 2,358.7 149 263 Valence Valence 314,233 1,884.4 105 The following is a list of the 19 cantons of the Drôme department (with their INSEE codes), in France, following the French canton reorganisation which came into effect in March 2015: # Bourg-de-Péage (2601) # Crest (2602) # Dieulefit (2603) # Le Diois (2604) # Drôme des collines (2605) # Grignan (2606) # Loriol-sur-Drôme (2607) # Montélimar-1 (2608) # Montélimar-2 (2609) # Nyons et Baronnies (2610) # Romans-sur-Isère (2611) # Saint-Vallier (2612) # Tain-l'Hermitage (2613) # Le Tricastin (2614) # Valence-1 (2615) # Valence-2 (2616) # Valence-3 (2617) # Valence-4 (2618) # Vercors-Monts du Matin (2619) ==Demographics== The inhabitants of Drôme are known, in French, as Drômois (women: Drômoises). Drôme has a population, in 2014, of 499,159, for a population density of inhabitants/km2. The arrondissement of Valence, with 314,233 inhabitants, is by far the largest. The other two, Nyons and Die, have respectively 141,971 and 42,955 inhabitants. The city with more people living in it is the capital, Valence (62,150 inhabitants). The subprefectures of Nyons and Die have, respectively, 6,641 and 4,516 inhabitants. Evolution of the population in Drôme Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:550000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:50000 start:0 ScaleMinor = gridcolor:lightgrey increment:25000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 342891 bar:1975 from:0 till: 361847 bar:1982 from:0 till: 389781 bar:1990 from:0 till: 414072 bar:1999 from:0 till: 437778 bar:2006 from:0 till: 468367 bar:2014 from:0 till: 499159 PlotData= bar:1968 at: 342891 fontsize:S text: 342,891 shift:(-12,5) bar:1975 at: 361847 fontsize:S text: 361,847 shift:(-18,5) bar:1982 at: 389781 fontsize:S text: 389,781 shift:(-18,5) bar:1990 at: 414072 fontsize:S text: 414,072 shift:(-18,5) bar:1999 at: 437778 fontsize:S text: 437,778 shift:(-18,5) bar:2006 at: 468367 fontsize:S text: 468,367 shift:(-18,5) bar:2014 at: 499159 fontsize:S text: 499,159 shift:(-18,5) The 10 most important cities in the department are: City Population (2014) Arrondissement Valence 62,150 Valence Montélimar 37,193 Nyons Romans- sur-Isère 33,366 Valence Bourg-lès-Valence 19,591 Valence Pierrelatte 13,071 Nyons Bourg-de-Péage 10,171 Valence Portes-lès-Valence 9,973 Valence Saint- Paul-Trois-Châteaux 8,944 Nyons Livron-sur-Drôme 8,927 Die Crest 8,211 Die ==Gallery== File:Valence cathedrale 2003-12-10 047.jpg|Valence cathedral. File:Dielavan.jpg|Lavender fields near Die. File:France Provence Grignan castle château.JPG|Grignan town and castle. File:Château de Suze la Rousse, Drôme, France-2005-10-23.jpg|Castle of Suze la Rousse. File:Montaulieu en Drôme provençale.JPG|Montaulieu in Drôme provençale. File:Vercors Glandasse.jpg|Vercors Plateau. ==Related pages== * Arrondissements of the Drôme department * Communes of the Drôme department ==References== ==Other websites== * Departamental Council website * Prefecture website * Drôme Tourisme",
 "title": "Drôme"
}