{
 "id": "139610",
 "text": "Doubs is a department in eastern France. It is in the Bourgogne-Franche-Comté region. It is named after the Doubs river. The largest city in the department, and its prefecture (capital), is the city of Besançon. ==History== Doubs is one of the original 83 departments created during the French Revolution on 4 March 1790 with Besançon as its capital. It was formed from part of the old province of Franche-Comté. It was divided in six districts: Besançon, Baume- les-Dames, Saint-Hippolyte, Pontarlier, Quingey and Ornans. In 1800, with the creation of the arrondissements in France, the six districts were changed into four arrondissements: Besançon, Baume-les-Dames, Pontarlier and Saint- Hippolyte. In 1816, the subprefecture of Saint-Hippolyte is moved to Montbéliard. After the Battle of Waterloo (18 June 1815), the department was occupied by the Austrian army from June 1815 to November 1818. On 10 September 1926, the arrondissement of Baume-les-Dames was eliminated. ==Geography== Doubs is part of the Bourgogne-Franche-Comté region. It has an area of . The department borders with 3 departments of the Bourgogne-Franche-Comté region (Jura, Haute-Saône and Territoire de Belfort) and 3 cantons of Switzerland (Vaud, Neuchâtel and Jura). The Doubs department is partially on the Jura Mountains, mainly the eastern part of the department on the border with Switzerland. The highest point in the department is Mont d'Or (), high; it is on the border between the communes Jougne and Longevilles-Mont-d'Or at about to the south of the city of Pontarlier. The lowest point is where the Ognon leaves the department, high. The main rivers in the department are the Doubs, that gives its name to the department, the Ognon and the Loue (tributary of the Doubs). ===Climate=== The Köppen climate classification type for the climate at Besançon is an \"Oceanic climate\" (also known as Marine West Coast Climate) and of the subtype Cfb. The average temperature for the year in Besançon is . The warmest month, on average, is July with an average temperature of . The coolest month, on average is January, with an average temperature of . The average amount of precipitation for the year in Besançon is . The month with the most precipitation on average is September with of precipitation. The month with the least precipitation on average is February with an average of . ==Administration== Doubs is managed by the Departmental Council of Doubs in Besançon. The department is part of the Bourgogne-Franche- Comté region. ===Administrative divisions=== There are 3 arrondissements (districts), 19 cantons and 578 communes (municipalities) in Saône-et-Loire. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 251 Besançon Besançon 248,199 1,942.2 260 252 Montbéliard Montbéliard 176,670 1,255.7 169 253 Pontarlier Pontarlier 109,841 2,034.7 149 The following is a list of the 19 cantons of the Doubs department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Audincourt (2501) # Baume-les-Dames (2502) # Bavans (2503) # Besançon-1 (2504) # Besançon-2 (2505) # Besançon-3 (2506) # Besançon-4 (2507) # Besançon-5 (2508) # Besançon-6 (2509) # Bethoncourt (2510) # Frasne (2511) # Maîche (2512) # Montbéliard (2513) # Morteau (2514) # Ornans (2515) # Pontarlier (2516) # Saint-Vit (2517) # Valdahon (2518) # Valentigney (2519) ==Demographics== The inhabitants of Doubs are known, in French, as Doubistes, or Doubiens (women: Doubiennes). Doubs had a population, in 2014, of 534,710, for a population density of inhabitants/km2. The arrondissement of Besançon, with 248,199 inhabitants, is the arrondissement with more inhabitants. Evolution of the population in Doubs Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:600000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:100000 start:0 ScaleMinor = gridcolor:lightgrey increment:50000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 426458 bar:1975 from:0 till: 471082 bar:1982 from:0 till: 477163 bar:1990 from:0 till: 484770 bar:1999 from:0 till: 499062 bar:2006 from:0 till: 516157 bar:2014 from:0 till: 534710 PlotData= bar:1968 at: 426458 fontsize:S text: 426,458 shift:(-13,5) bar:1975 at: 471082 fontsize:S text: 471,082 shift:(-18,5) bar:1982 at: 477163 fontsize:S text: 477,163 shift:(-18,5) bar:1990 at: 484770 fontsize:S text: 484,770 shift:(-18,5) bar:1999 at: 499062 fontsize:S text: 499,062 shift:(-18,5) bar:2006 at: 516157 fontsize:S text: 516,157 shift:(-18,5) bar:2014 at: 534710 fontsize:S text: 534,710 shift:(-18,5) The cities with more than inhabitants in the department are: City Population (2014) Arrondissement Besançon 116,690 Besançon Montbéliard 25,521 Montbéliard Pontarlier 17,413 Pontarlier Audincourt 14,131 Montbéliard Valentigney 9,970 Montbéliard Morteau 6,827 Pontarlier Seloncourt 5,906 Montbéliard Bethoncourt 5,729 Montbéliard Grand-Charmont 5,535 Montbéliard Valdahon 5,344 Pontarlier ==Places of interest== Some places of interest are: * The Citadel of Besançon. * The Royal Saltworks at Arc-et-Senans. * The castle of Montbéliard. * The Fort de Joux. * The village of Lods. ==Gallery== File:Besancon boucle Doubs.jpg|The citadel and the old town of Besançon in a meander of the Doubs. File:France arc et senas saline royal main building 1.jpg|Royal Saltworks at Arc-et-Senans. File:2009-05-03 Montbeliard 108.JPG|Montbéliard castle. File:Château de Joux - Vue du belvédère de la Fauconnière.JPG|Fort de Joux. File:0 Lods - Le village et la Loue (1).JPG|Lods, one of the most beautiful villages of France. File:Doubs Laissey.jpg|The Doubs river is the main river of the department. ==Related pages== * Arrondissements of the Doubs department * Communes of the Doubs department ==References== ==Other websites== * Departmental Council website * Prefecture website * Doubs Tourisme",
 "title": "Doubs"
}