{
 "id": "139607",
 "text": "Creuse () is a department in central France in the region of Nouvelle- Aquitaine. It is named after the Creuse river that flows through the department. ==History== Creuse is one of the 83 French departments made during the French revolution, on 4 March 1790. It was created mainly with lands of the old province of County of La Marche. The new department had seven districts: La Souterraine, Guéret, Boussac, Évaux, Felletin, Bourganeuf and Aubusson. The capital (now prefecture) was Guéret alternating with Aubusson, but soon only Guéret remained as capital. In 1800, with the creation of the arrondissements in France, the seven districts were changed into four arrondissements: Guéret, Aubusson, Bourganeuf and Boussac. On 10 September 1926, the arrondissements of Bourganeuf et Boussac were eliminated. ==Geography== Creuse is part of the Nouvelle-Aquitaine region. It has an area of . The department is surrounded by 6 departments in 3 regions: * Nouvelle- Aquitaine region ** Corrèze department ** Haute-Vienne department * Centre-Val de Loire region ** Cher department ** Indre department * Auvergne-Rhône-Alpes region ** Allier department ** Puy-de-Dôme department The department is in the northwestern part of the Massif Central; the Millevaches plateau is in the southeastern part of the department. The highest point is in Forêt de Châteauvert (), \"commune\" of Saint-Oradoux-de-Chirouze, southeastern of the department and in northeastern Massif Central; it is high; the lowest point is in the valley of the Creuse river, high. The main river in the department is the Creuse, a tributary of the Vienne river and that gives its name to this the deparment; it flows through the department from the southeast to the northwest. ==Administration== The department is managed by the Departamental Council of the Creuse in Guéret. Creuse is part of the region of Nouvelle- Aquitaine. ===Administrative divisions=== There are 2 arrondissements (districts), 15 cantons and 258 communes (municipalities) in Haute-Vienne. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 231 Aubusson Aubusson 37,123 2,538.8 118 232 Guéret Guéret 83,458 3,026.5 140 The following is a list of the 15 cantons of the Creuse department (with their INSEE codes), in France, following the French canton reorganisation which came into effect in March 2015: * Ahun (2301) * Aubusson (2302) * Auzances (2303) * Bonnat (2304) * Bourganeuf (2305) * Boussac (2306) * Dun-le-Palestel (2307) * Évaux-les-Bains (2308) * Felletin (2309) * Gouzon (2310) * Le Grand-Bourg (2311) * Guéret-1 (2312) * Guéret-2 (2313) * Saint- Vaury (2314) * La Souterraine (2315) ==Demographics== The inhabitants of Creuse are known, in French, as Creusois (women: Creusoises). Creuse has a population, in 2014, of 120,581, for a population density of inhabitants/km2. The arrondissement of Guéret, with 83,458 inhabitants, is by far the largest. The other arrondissement, Aubusson, has 37,123 inhabitants. Evolution of the population in Dordogne Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:200000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:40000 start:0 ScaleMinor = gridcolor:lightgrey increment:20000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 172702 bar:1975 from:0 till: 163515 bar:1982 from:0 till: 156876 bar:1990 from:0 till: 146214 bar:1999 from:0 till: 139968 bar:2006 from:0 till: 131349 bar:2014 from:0 till: 120581 PlotData= bar:1968 at: 172702 fontsize:S text: 172,702 shift:(-13,5) bar:1975 at: 163515 fontsize:S text: 163,515 shift:(-18,5) bar:1982 at: 156876 fontsize:S text: 156,876 shift:(-18,5) bar:1990 at: 146214 fontsize:S text: 146,214 shift:(-18,5) bar:1999 at: 139968 fontsize:S text: 139,968 shift:(-18,5) bar:2006 at: 131349 fontsize:S text: 131,349 shift:(-18,5) bar:2014 at: 120581 fontsize:S text: 120,581 shift:(-18,5) The main cities in the department are: City Population (2014) Arrondissement Guéret 13,342 Guéret La Souterraine 5,295 Guéret Aubusson 3,591 Aubusson Bourganeuf 2,725 Guéret Sainte-Feyre 2,470 Guéret Saint-Sulpice-le-Guérétois 1,987 Guéret Saint-Vaury 1,791 Guéret Felletin 1,700 Aubusson Gouzon 1,575 Guéret Ahun 1,466 Guéret ==Gallery== Gueret jardin public 78784 - panoramio.jpg|Garden in Guéret Creuse - Le Blanc (36) - Vue vers Ruffec - viaduc.jpg|The Creuse river Aubusson 04.JPG|Castle in Aubusson EgliseBoussacBourg.jpg|Church in Boussac-Bourg ==Related pages== * Arrondissements of the Creuse department ==References== ==Other websites== * Departamental Council website * Prefecture website * Tourism office of Creuse",
 "title": "Creuse"
}