{
 "id": "139743",
 "text": "Lot () is a French department in the Occitanie region of southern France named after the Lot river. Its prefecture and largest city is Cahors. ==History== Lot is one of the original 83 departments created during the French Revolution on 4 March 1790. It was created from the old province of Quercy. The new department had six districts: Cahors, Martel, Gourdon, Figeac, Montauban and Lazorte. The capital (now prefecture) was Cahors. In 1808, some of the original southeastern cantons were separated from it to form the department of Tarn-et-Garonne. It originally extended much farther to the south and included the city of Montauban. == Geography == Lot is part of the Occitanie region and has an area of . The department borders with 6 other departments in 3 regions: * Nouvelle-Aquitaine region ** Lot-et-Garonne ** Dordogne ** Corrèze * Auvergne-Rhône-Alpes region ** Cantal * Occitanie region ** Aveyron ** Tarn- et-Garonne The Lot river crosses the department from east to west with numerous meanders. The Dordogne river flows through the northern part of the department. There are seven natural regions in the department: # The Segala (northeast) occupies the eastern border of the Lot department. It is the part of the Massif Central that gets into the department and here is found the highest point of the Lot department in Labastide-du-Haut-Mont, with high. # The Limargue (center east) separates the Segala from the Causses of Quercy. This narrow strip of land is found between the valleys of the Dordogne and Lot rivers. It is known as Terrefort around the city of Figeac. # The Causses of Quency are several limestone plateaus crossed by the valleys of the Dordogne, Lot and Aveyron rivers. From north to south, they are the Causse of Martel, the Causse of Gramat and the Causse of Limogne. # The Bouriane (west). This area is covered with an abundant vegetation and is very different from the near arid plateaus of the Causses. # The Quercy Blanc (south) is formed by small white limestone plateaus along valleys where cereals, oilseeds (plants grown to produce vegetable oils), melons, plums and tobacco are grown. # The Valley of the Lot river (south), with many vineyards and vegetable crops. # The Valley of the Dordogne river (north), with its walnut groves and meadows. ===Climate=== The climate in Gourdon, in the north of the department at an altitude of above sea level, is an oceanic climate with relatively hot summers, mild winters and abundant rainfall, Cfb in the Köppen climate classification. The average amount of precipitation for the year in Gourdon is . The month with the most precipitation on average is May with of precipitation. The month with the least precipitation on average is February with an average of . There are an average of 168.0 days of precipitation, with the most precipitation occurring in January with 17.0 days and the least precipitation occurring in July with 10.0 days. The average temperature for the year in Gourdon is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . ==Administration== The department is managed by the Departamental Council of the Lot in Cahors. Lot is part of the Occitanie region. ===Administrative divisions=== There are 3 arrondissements (districts), 17 cantons and 326 communes (municipalities) in Lot. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (inh./km²) Communes 461 Cahors Cahors 76,216 2,179.3 129 462 Figeac Figeac 54,060 1,550.3 116 463 Gourdon Gourdon 43,372 1,486.9 81 The following is a list of the 17 cantons of the Lot department, following the French canton reorganisation which came into effect in March 2015: # Cahors-1 # Cahors-2 # Cahors-3 # Causse et Bouriane # Causse et Vallées # Cère et Ségala # Figeac-1 # Figeac-2 # Gourdon # Gramat # Lacapelle-Marival # Luzech # Marches du Sud- Quercy # Martel # Puy-l'Évêque # Saint-Céré # Souillac File:Cahors Chateau.jpg|Cahors chateau and vineyard File:Figeac Nt Dame Puy.jpg|Notre- Dame-du-Puy church, at Figeac File:Gourdon la mairie.jpg|Town Hall, Gourdon ==Demographics== The inhabitants of Lot are known, in French, as Lotois (women: Lotoises). Lot has a population, in 2014, of 173,648, for a population density of inhabitants/km2. The arrondissement of Cahors, with 76,216 inhabitants, is by far the largest. The other two, Figeac and Gourdon, have respectively 54,060 and 43,372 inhabitants. The city with more people living in it is the capital, Cahors (19,630). The subprefectures of Figeac and Gourdon have, respectively, 9,820 and 4,297 inhabitants. Evolution of the population in Lot Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:180000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 151198 bar:1975 from:0 till: 150778 bar:1982 from:0 till: 154533 bar:1990 from:0 till: 155816 bar:1999 from:0 till: 160197 bar:2008 from:0 till: 172796 bar:2014 from:0 till: 173648 PlotData= bar:1968 at: 151198 fontsize:S text: 151,198 shift:(-13,5) bar:1975 at: 150778 fontsize:S text: 150,778 shift:(-18,5) bar:1982 at: 154533 fontsize:S text: 154,533 shift:(-18,5) bar:1990 at: 155816 fontsize:S text: 155,816 shift:(-18,5) bar:1999 at: 160197 fontsize:S text: 160,197 shift:(-18,5) bar:2008 at: 172796 fontsize:S text: 172,796 shift:(-18,5) bar:2014 at: 173648 fontsize:S text: 173,648 shift:(-18,5) The cities in the department with more of 2,000 inhabitants are: City Population (2014) Arrondissement Cahors 19,630 Cahors Figeac 9,820 Figeac Gourdon 4,297 Gourdon Gramat 3,611 Gourdon Saint-Céré 3,503 Figeac Pradines 3,433 Cahors Souillac 3,366 Gourdon Prayssac 2,499 Cahors Biars-sur-Cère 2,033 Figeac Puy-l'Évêque 2,020 Cahors ==Gallery== File:Cahors - place François-Mitterrand -313.jpg|Cahors File:Cahors - Pont Valentré 03.jpg|Pont Valentré File:Rocamadour, Lot, Midi-Pyrénées, france.jpg|Rocamadour File:Le Lot Cahors 2.jpg|The Lot river ==Related pages== * Arrondissements of the Lot department * Communes of the Lot department ==References== ==Other websites== * Departamental Council website * Prefecture website * Lot Tourisme, Agence de Développement Touristique * Le Quercy sur le net * Société des Études du Lot",
 "title": "Lot (department)"
}