{
 "id": "139770",
 "text": "Puy-de-Dôme is a French department in the centre of France in the Auvergne- Rhône-Alpes region and named after the dormant volcano the Puy de Dôme. Its prefecture is the city of Clermont-Ferrand. ==History== Puy-de-Dôme was created in 1790 during the French Revolution, when the whole of France was divided into departments, replacing the old provinces. Puy-de-Dôme was formed with part of the old province of Auvergne. It was divided in eight districts: Ambert, Besse, Billom, Clermont-Ferrand, Issoire, Montaigu, Riom and Thiers, with Clermont-Ferrand as is capital. In 1800, with the creation of the arrondissements in France, the eight districts were changed into five arrondissements: Ambert, Clermont-Ferrand, Issoire, Riom and Thiers. On 10 September 1926, the arrondissement of Ambert was eliminated but, in 1942 Ambert became again an arrondissement of the department. ==Geography== Puy-de- Dôme is part of the Auvergne-Rhône-Alpes region, in east-central France, with an area of . The department borders with 2 other departments in 2 regions: * Nouvelle-Aquitaine region ** Corrèze (west) ** Creuse (west) * Auvergne-Rhône- Alpes region ** Allier (north) ** Loire (east) ** Haute-Loire (southeast) ** Cantal (southwest) The department is in the Massif Central and there are several mountain chains; some of the chains and mountains are: * Chaîne des Puys, to the northwest of the department; here is the Puy de Dôme, a dormant volcano. * Monts Dore, to the southwest of the department. Here is the highest mountain of the department and of the Massif Central: Puy de Sancy, an extinct volcano (); it is high. * Monts du Forez, to the east of the department * Livradois, to the south. * Massif des Bois Noirs, to the northeast. * Cézallier, to the southwest. ===Climate=== The climate of the Puy-de-Dôme department, in the city of Clermont-Ferrand, is an oceanic climate, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average temperature for the year in Clermont-Ferrand, at an altitude of , is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The average amount of precipitation for the year in Clermont-Ferrand is . The month with the most precipitation on average is May with of precipitation. The month with the least precipitation on average is January with an average of . ==Administration== Puy-de-Dôme is part of the region of Auvergne-Rhône-Alpes. The department is managed by the Departamental Council of the Puy-de-Dôme in Clermont-Ferrand. ===Administrative divisions=== There are 5 arrondissements (districts), 31 cantons and 467 communes (municipalities) in Puy-de-Dôme. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 631 Ambert Ambert 26,653 1,188.1 58 632 Clermont-Ferrand Clermont-Ferrand 375,518 1,796.5 75 633 Issoire Issoire 62,931 1,819.6 135 634 Riom Riom 121,158 2,299.7 155 635 Thiers Thiers 57,956 865.8 44 The following is a list of the 31 cantons of the Puy-de-Dôme department (with their INSEE codes), in France, following the French canton reorganisation which came into effect in March 2015: # Aigueperse (6301) # Ambert (6302) # Aubière (6303) # Beaumont (6304) # Billom (6305) # Brassac-les-Mines (6306) # Cébazat (6307) # Chamalières (6308) # Châtel-Guyon (6309) # Clermont-Ferrand-1 (6310) # Clermont-Ferrand-2 (6311) # Clermont-Ferrand-3 (6312) # Clermont-Ferrand-4 (6313) # Clermont-Ferrand-5 (6314) # Clermont-Ferrand-6 (6315) # Cournon-d'Auvergne (6316) # Gerzat (6317) # Issoire (6318) # Lezoux (6319) # Maringues (6320) # Les Martres-de-Veyre (6321) # Les Monts du Livradois (6322) # Orcines (6323) # Pont-du-Château (6324) # Riom (6325) # Saint-Éloy-les-Mines (6326) # Saint-Georges-de-Mons (6327) # Saint-Ours (6328) # Le Sancy (6329) # Thiers (6330) # Vic-le-Comte (6331) ==Demographics== The inhabitants of Puy- de-Dôme are known, in French, as Puydômois (women: Puydômoises). Puy-de-Dôme has a population, in 2014, of 644,216, for a population density of inhabitants/km2. The arrondissement of Clermont-Ferrand, with 375,518 inhabitants, is by far the largest. Evolution of the population in Puy-de-Dôme Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:700000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:50000 start:0 ScaleMinor = gridcolor:lightgrey increment:25000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 547743 bar:1975 from:0 till: 580033 bar:1982 from:0 till: 594365 bar:1990 from:0 till: 598213 bar:1999 from:0 till: 604266 bar:2008 from:0 till: 628485 bar:2014 from:0 till: 644216 PlotData= bar:1968 at: 547743 fontsize:S text: 547,743 shift:(-12,5) bar:1975 at: 580033 fontsize:S text: 580,033 shift:(-18,5) bar:1982 at: 594365 fontsize:S text: 594,365 shift:(-18,5) bar:1990 at: 598213 fontsize:S text: 598,213 shift:(-18,5) bar:1999 at: 604266 fontsize:S text: 604,266 shift:(-18,5) bar:2008 at: 628485 fontsize:S text: 628,485 shift:(-18,5) bar:2014 at: 644216 fontsize:S text: 644,216 shift:(-18,5) The most important cities in the department are: City Population (2014) Arrondissement Clermont-Ferrand 141,365 Clermont-Ferrand Cournon-d'Auvergne 19,515 Clermont-Ferrand Riom 18,749 Riom Chamalières 17,623 Clermont-Ferrand Issoire 14,578 Issoire Thiers 11,588 Thiers Beaumont 11,060 Clermont-Ferrand Pont-du-Château 10,655 Clermont-Ferrand Gerzat 10,487 Clermont-Ferrand Aubière 9,832 Clermont-Ferrand ==Gallery== File:Conseil départemental du Puy-de-Dôme.jpg|Departmental Council building. File:Clermont vu de Montjuzet.JPG|The black Clermont-Ferrand Cathedral. File:Ambert.jpg|Ambert. File:Issoire Place de la Republique.jpg|Place de la Republique, Issoire. File:Puy de dome 2001-12-15.jpg|The Puy de Dôme volcano. ==Related pages== * Arrondissements of the Puy-de-Dôme department * Communes of the Puy-de-Dôme department ==References== ==Other websites== * Departamental Council website * Prefecture website",
 "title": "Puy-de-Dôme"
}