{
 "id": "139741",
 "text": "Haute-Loire () is a département in the Auvergne-Rhône-Alpes region of south- central France. It is named after the Loire river. ==History== The department of Haute-Loire was created on 4 March 1790 with three districts: Le Puy, Brioude and Yssingeaux. The capital was Le Puy. The new department was formed with territories of three historic provinces: the Languedoc, the Auvergne and the Lyonnais. In 1800, with the creation of the arrondissements in France, the three districts were changed into three arrondissements: Le Puy, Brioude and Yssingeaux. On 10 September 1926, the arrondissement of Yssingeaux was eliminated but became again an arrondissement in 1942. On 18 March 1988, the name of Le Puy was changed to Le Puy-en-Velay. ==Geography== The Haute-Loire is part of the Auvergne-Rhône-Alpes region. It has an area of . The department is surrounded by 5 departments in 2 regions: * Auvergne-Rhône-Alpes region ** Loire (north) ** Puy-de-Dôme (north) ** Ardèche (east) ** Cantal (west) * Occitanie region ** Lozère (south) The highest point in the department is Mont Mézenc (); it is high. It is in the southeast of the department, on the border with the Ardèche department. The main rivers in Haute-Loire are: * Loire, that flows through the eastern part of the department and ends in the Atlantic Ocean. Its Drainage basin covers two-thirds of the eastern part of the department. * Allier, a tributary of the Loire that flows through the western part of the department. ===Climate=== The Köppen climate classification type for the climate at Le Puy-en-Velay is an \"Oceanic climate\" (also known as Maritime Temperate climate) and of the subtype Cfb. ==Administration== Haute- Loire is managed by the Departmental Council of Haute-Loire in Le Puy-en- Velay. The department is part of the Auvergne-Rhône-Alpes region. ===Administrative divisions=== There are 3 arrondissements (districts), 19 cantons and 257 communes (municipalities) in Haute-Loire. Arrondissements of the Haute-Loire INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 431 Brioude Brioude 45,848 1,886.8 111 432 Le Puy-en-Velay Le Puy-en-Velay 96,041 1,930.7 102 433 Yssingeaux Yssingeaux 84,676 1,159.7 44 The following is a list of the 19 cantons of the Haute-Loire department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Aurec-sur-Loire (4301) # Bas-en-Basset (4302) # Boutières (4303) # Brioude (4304) # Deux Rivières et Vallées (4305) # Emblavez-et-Meygal (4306) # Gorges de l'Allier-Gévaudan (4307) # Mézenc (4308) # Monistrol-sur-Loire (4309) # Pays de Lafayette (4310) # Plateau du Haut- Velay granitique (4311) # Le Puy-en-Velay-1 (4312) # Le Puy-en-Velay-2 (4313) # Le Puy-en-Velay-3 (4314) # Le Puy-en-Velay-4 (4315) # Saint-Paulien (4316) # Sainte-Florine (4317) # Velay volcanique (4318) # Yssingeaux (4319) ==Demographics== The inhabitants of Haute-Loire are known, in French, as Altiligériens (women: Altiligériennes). Haute-Loire had a population, in 2014, of 226,565, for a population density of inhabitants/km2. The arrondissement of Le Puy-en-Velay, with 96,041 inhabitants, is the arrondissement with more inhabitants. Evolution of the population in Haute-Loire Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:373 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:240000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 208337 bar:1975 from:0 till: 205491 bar:1982 from:0 till: 205895 bar:1990 from:0 till: 206568 bar:1999 from:0 till: 209113 bar:2006 from:0 till: 219484 bar:2014 from:0 till: 226565 PlotData= bar:1968 at: 208337 fontsize:S text: 208,337 shift:(-12,10) bar:1975 at: 205491 fontsize:S text: 205,491 shift:(-18,5) bar:1982 at: 205895 fontsize:S text: 205,895 shift:(-18,5) bar:1990 at: 206568 fontsize:S text: 206,568 shift:(-18,5) bar:1999 at: 209113 fontsize:S text: 209,113 shift:(-18,5) bar:2006 at: 219484 fontsize:S text: 219,484 shift:(-18,5) bar:2014 at: 226565 fontsize:S text: 226,565 shift:(-18,5) The communes in the department with more inhabitants are: City Population (2014) Arrondissement Le Puy-en-Velay 18,634 Le Puy-en-Velay Monistrol-sur- Loire 8,808 Yssingeaux Yssingeaux 7,105 Yssingeaux Brioude 6,700 Brioude Aurec-sur-Loire 6,035 Yssingeaux Sainte-Sigolène 5,952 Yssingeaux Bas-en- Basset 4,314 Yssingeaux Brives-Charensac 4,153 Le Puy-en-Velay Saint-Just- Malmon 4,153 Yssingeaux Langeac 3,758 Brioude ==Gallery== File:Le Puy-en- Velay, Église Saint-Laurent et Aiguilhe PM 48569.jpg|Le Puy-en-Velay File:Lavaudieu - Vieux pont -1.jpg|Lavaudieu File:Brioude - Basilique St- Julien - JPG1.jpg|Brioude File:France Lavoute Chilhac 01.jpg|Lavoûte-Chilhac File:Polignac - Château -1.jpg|Polignac ==Related pages== * Arrondissements of the Haute-Loire department * Communes of the Haute-Loire department ==References== ==Other websites== * Departmental Council website * Prefecture website",
 "title": "Haute-Loire"
}