{
 "id": "139729",
 "text": "Hérault () is a department in the region of Occitanie in southern France. It is named after the Hérault river. The inhabitants of Hérault are known, in French, as Héraultais (women: Héraultaises). ==History== Hérault was created in 1790 during the French Revolution, when the whole of France was divided into departments, replacing the old provinces. Aude was formed with part of the old province of Languedoc. It was divided in four districts: Montpellier, Béziers, Lodève and Saint-Pons, with Montpellier as is capital. In 1800, with the creation of the arrondissements in France, the four districts were changed into four arrondissements. On 10 September 1926, the arrondissements of Lodève and Saint-Pons were eliminated but on 1 June 1942 Lodève became again an arrondissement. ==Geography== Hérault has an area of . It is surrounded by the departments of Aude, Aveyron, Tarn, and Gard, with the Gulf of Lion (Mediterranean Sea) to the east and southeast. The main rivers in the department are the Orb and the Hérault which gives its name to the department. === Climate === The climate in Montpellier, in the northeast of the department near the Mediterranean coast, is a Mediterranean climate, a \"dry-summer subtropical\" climate, Csa in the Köppen climate classification. The average amount of precipitation for the year in Montpellier is . The month with the most precipitation on average is October with of precipitation. The month with the least precipitation on average is July with an average of . There are an average of 73.4 days of precipitation, with the most precipitation occurring in December with 9.2 days and the least precipitation occurring in July with 2.3 days. The average temperature for the year in Montpellier is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . ==Administration== The département is managed by the Departamental Council of the Hérault in Montpellier. Hérault is part of the region of Occitanie. ===Administrative divisions=== There are 3 arrondissements (districts), 25 cantons and 343 communes (municipalities) in Hérault. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 341 Béziers Béziers 312,443 2,986.8 152 342 Lodève Lodève 94,714 1,819.6 98 343 Montpellier Montpellier 700,241 1,294.6 93 The following is a list of the 25 cantons of the Hérault department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Agde (3401) # Béziers-1 (3402) # Béziers-2 (3403) # Béziers-3 (3404) # Cazouls-lès-Béziers (3405) # Clermont-l'Hérault (3406) # Le Crès (3407) # Frontignan (3408) # Gignac (3409) # Lattes (3410) # Lodève (3411) # Lunel (3412) # Mauguio (3413) # Mèze (3414) # Montpellier-1 (3415) # Montpellier-2 (3416) # Montpellier-3 (3417) # Montpellier-4 (3418) # Montpellier-5 (3419) # Montpellier - Castelnau-le-Lez (3420) # Pézenas (3421) # Pignan (3422) # Saint-Gély-du-Fesc (3423) # Saint-Pons-de-Thomières (3424) # Sète (3425) ==Demographics== The Hérault department has a population, in 2014, of 1,107,398, for a population density of inhabitants/km2. The arrondissement of Montpellier, with 700,241 inhabitants, is by far the largest. The other two arrondissements, Béziers and Lodève, have respectively 312,443 and 94,714 inhabitants. Evolution of the population in Hérault Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:1140000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:100000 start:0 ScaleMinor = gridcolor:lightgrey increment:50000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 591397 bar:1975 from:0 till: 648202 bar:1982 from:0 till: 706499 bar:1990 from:0 till: 794603 bar:1999 from:0 till: 896441 bar:2008 from:0 till: 1019798 bar:2014 from:0 till: 1107398 PlotData= bar:1968 at: 591397 fontsize:S text: 591,397 shift:(-13,5) bar:1975 at: 648202 fontsize:S text: 648,202 shift:(-18,5) bar:1982 at: 706499 fontsize:S text: 706,499 shift:(-18,5) bar:1990 at: 794603 fontsize:S text: 794,603 shift:(-18,5) bar:1999 at: 896441 fontsize:S text: 896,441 shift:(-18,5) bar:2008 at: 1019798 fontsize:S text: 1,019,798 shift:(-22,5) bar:2014 at: 1107398 fontsize:S text: 1,107,398 shift:(-22,5) The communes in the department with more of 10,000 inhabitants are: City Population (2014) Arrondissement Montpellier 275,318 Montpellier Béziers 75,701 Béziers Sète 44,136 Montpellier Agde 26,111 Béziers Lunel 24,873 Montpellier Frontignan 22,896 Montpellier Castelnau-le-Lez 19,157 Montpellier Mauguio 16,765 Montpellier Lattes 15,963 Montpellier Mèze 11,196 Montpellier ==Gallery== Hérault River, Agde 09.jpg|The Hérault river at Agde Rochelongue 282 Montpellier.JPG|Porte du Peyrou in Montpellier CathedraleBeziers.jpg|Béziers cathedral Roquebrun and Orb River 02.jpg|Roquebrun and Orb river ==Related pages== * Arrondissements of the Hérault department * Communes of the Hérault department ==References== ==Other websites== * Departamental council website * Prefecture website * The Hérault Tourist Board",
 "title": "Hérault"
}