{
 "id": "139799",
 "text": "Tarn-et-Garonne is a department in the southwest of France, in the Occitanie region. It is named after the Garonne river and its tributary Tarn. Its prefecture and largest city is Montauban. ==History== Tarn-et-Garonne is not one of the original 83 departments created during the French Revolution on 4 March 1790. It was created on 4 November 1808 during the First French Empire by Napoleon I. It was formed out of territories belonging to neighboring areas. More than half of the territory was taken from the Lot (including Montauban and Moissac), over one-third was taken from Haute-Garonne (including Castelsarrasin), and the rest from the departments of Lot-et-Garonne, Gers, and Aveyron. The new department had three arrondissements: Montauban, Castelsarrasin and Moissac. The prefecture was Montauban. On 10 September 1926, the arrondissement of Moissac was eliminated. ==Geography== Tarn-et- Garonne is part of the Occitanie region. It has an area of . The department borders with 6 departments: * Occitanie ** Lot (north) ** Aveyron (northeast) ** Tarn (east) ** Haute-Garonne (south) ** Gers (southwest) * Nouvelle- Aquitaine ** Lot-et-Garonne (northwest) The highest point in the department, at , is the Puech des Carts - Sommet Nord (), in the commune of Castanet. Even if Tarn-et-Garonne is one of the smallest departments of Metropolitan France, there is a great diversity of landscapes in the department; for example, the plains between the Tarn and Garonne rivers and in the valley of the Aveyron river, the hills of the Lomagne region (southwest of the department) and in the north, including the Causse (a limestone plateau) of the northeast. The main rivers in the department are the Garonne and its tributaries Tarn and Aveyron. ===Climate=== The climate of Montauban is an oceanic climate with template summers, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average amount of precipitation for the year in Montauban is . The month with the most precipitation on average is October with of precipitation. The month with the least precipitation on average is February with an average of . The average temperature for the year in Montauban is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . ==Administration== Tarn-et-Garonne is managed by the Departamental Council of Tarn-et-Garonne in Montauban. The department is part of the region of Occitanie. ===Administrative divisions=== There are 2 arrondissements (districts), 15 cantons and 195 communes (municipalities) in Tarn-et-Garonne. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 821 Castelsarrasin Castelsarrasin 76,822 1,601.5 103 822 Montauban Montauban 175,756 2,116.8 92 The following is a list of the 15 cantons of the Tarn-et-Garonne department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Aveyron-Lère (8201) # Beaumont-de-Lomagne (8202) # Castelsarrasin (8203) # Garonne-Lomagne-Brulhois (8204) # Moissac (8205) # Montauban-1 (8206) # Montauban-2 (8207) # Montauban-3 (8208) # Montech (8209) # Pays de Serres Sud- Quercy (8210) # Quercy-Aveyron (8211) # Quercy-Rouergue (8212) # Tarn-Tescou- Quercy vert (8213) # Valence (8214) # Verdun-sur-Garonne (8215) ==Demographics== The inhabitants of Tarn-et-Garonne are known, in French, as Tarn-et-Garonnais (women: Tarn-et-Garonnaises). , Tarn-et-Garonne had a population of 252,578, for a population density of inhabitants/km2. The arrondissement of Montauban, with 175,756 inhabitants, is the arrondissement with more inhabitants. The arrondissement of Castelsarrasin has 76,822 inhabitants. The city with more people living in it is the capital, Montauban (58,826). The subprefecture of Castelsarrasin has 13,765 inhabitants. Evolution of the population in Tarn-et-Garonne Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:300000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:30000 start:0 ScaleMinor = gridcolor:lightgrey increment:15000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 183572 bar:1975 from:0 till: 183314 bar:1982 from:0 till: 190485 bar:1990 from:0 till: 200220 bar:1999 from:0 till: 206034 bar:2008 from:0 till: 235915 bar:2014 from:0 till: 252578 PlotData= bar:1968 at: 183572 fontsize:S text: 183,572 shift:(-12,5) bar:1975 at: 183314 fontsize:S text: 183,314 shift:(-18,5) bar:1982 at: 190485 fontsize:S text: 190,485 shift:(-18,5) bar:1990 at: 200220 fontsize:S text: 200,220 shift:(-18,5) bar:1999 at: 206034 fontsize:S text: 206,034 shift:(-18,5) bar:2008 at: 235915 fontsize:S text: 235,915 shift:(-18,5) bar:2014 at: 252578 fontsize:S text: 252,578 shift:(-18,5) The cities with more than 5,000 inhabitants in the department are: City Population (2014) Arrondissement Montauban 58,826 Montauban Castelsarrasin 13,765 Castelsarrasin Moissac 12,408 Castelsarrasin Caussade 6,805 Montauban Montech 6,158 Montauban Nègrepelisse 5,511 Montauban Valence 5,194 Castelsarrasin ==Gallery== File:Auvillar garonne.JPG|The Garonne river seen from Auvillar File:Cathédrale Notre-Dame-de-l'Assomption de Montauban au coucher du soleil.JPG|Montauban Cathedral at sunset File:PortJYC.jpg|Port Jacques-Yves Cousteau, Castelsarrasin File:FR-82-Montauban05.JPG|Montauban - Place National ==Related pages== * Arrondissements of the Tarn-et-Garonne department * Communes of the Tarn-et-Garonne department ==References== ==Other websites== * Departamental Council website * Prefecture website * Arkheia History Review of Tarn-et-Garonne",
 "title": "Tarn-et-Garonne"
}