{
 "id": "139764",
 "text": "Nièvre is a department in the centre of France, in the Bourgogne-Franche-Comté region. It is named after the Nièvre river, a tributary of the Loire. Its prefecture and largest city is Nevers. ==History== Nièvre is one of the original 83 departments created during the French Revolution on 4 March 1790 with Nevers as its capital. It was formed from part of the old province of Nivernais and its name was written at first as Nyèvre. It was divided in nine districts: Nevers, Saint-Pierre-le-Moutier, Decize, Moulins-Engilbert, Château-Chinon, Corbigny, Clamecy, Cosne and La Charité. In 1800, with the creation of the arrondissements in France, the nine districts were changed into four arrondissements: Nevers, Château-Chinon, Clamecy and Cosne. On 10 September 1926, the arrondissement of Cosne was eliminated but in 1943 it became again an arrondissement of the department. ==Geography== Nièvre is part of the Bourgogne-Franche-Comté region. It has an area of . The highest point of the department is Mont Préneley (), high; it is in the commune Glux-en- Glenne. The department borders with six departments in three regions: * Bourgogne-Franche-Comté region ** Yonne (north) ** Côte-d'Or (east) ** Saône- et-Loire (southeast) * Auvergne-Rhône-Alpes region ** Allier (southwest) * Centre-Val de Loire region ** Cher (west) ** Loiret (nortwest) There are three main geographical zones in the department: # Eastern zone, with small hills covered with forests; here is the Parc Naturel Régional du Morvan (\"Morvan regional natural park\"). # Central zone, an agricultural zone. # Western zone, a zone organised along a north-south line formed by the valley of the Loire river; it is the zone of the department with higher population. The main rivers in the department are the Loire, that makes most of the western border, with its tributaries Allier and Aron; and the Yonne, with its tributary Cure. ===Climate=== The Köppen climate classification type for the climate at Nevers is an \"Oceanic climate\" (also known as Maritime Temperate climate) and of the subtype \"Cfb\". It rains in all seasons but precipitations are more important in the eastern zone, in the Morvan, and weaker in the Loire valley. ==Administration== Nièvre is managed by the Departmental Council of Nièvre in Nevers. The department is part of the Bourgogne-Franche-Comté region. ===Administrative divisions=== There are 4 arrondissements (districts), 17 cantons and 309 communes (municipalities) in Nièvre. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 581 Château-Chinon (Ville) Château-Chinon (Ville) 25,717 1,929.1 80 582 Clamecy Clamecy 24,993 1,464.0 84 583 Nevers Nevers 118,087 2,020.3 82 584 Cosne-Cours-sur-Loire Cosne-Cours-sur-Loire 44,772 1,403.3 63 The following is a list of the 17 cantons of the Nièvre department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # La Charité-sur-Loire (5801) # Château-Chinon (5802) # Clamecy (5803) # Corbigny (5804) # Cosne-Cours-sur-Loire (5805) # Decize (5806) # Fourchambault (5807) # Guérigny (5808) # Imphy (5809) # Luzy (5810) # Nevers-1 (5811) # Nevers-2 (5812) # Nevers-3 (5813) # Nevers-4 (5814) # Pouilly-sur-Loire (5815) # Saint-Pierre-le-Moûtier (5816) # Varennes-Vauzelles (5817) ==Demographics== The inhabitants of Nièvre are known, in French, as Nivernais (women: Nivernaises). Nièvre had a population, in 2014, of 213,569, for a population density of inhabitants/km2. The arrondissement of Nevers, with 118,087 inhabitants, is the arrondissement with more inhabitants. Evolution of the population in Nièvre Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:300000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:50000 start:0 ScaleMinor = gridcolor:lightgrey increment:25000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 247702 bar:1975 from:0 till: 245212 bar:1982 from:0 till: 239635 bar:1990 from:0 till: 233278 bar:1999 from:0 till: 225198 bar:2006 from:0 till: 222220 bar:2014 from:0 till: 213569 PlotData= bar:1968 at: 247702 fontsize:S text: 247,702 shift:(-13,5) bar:1975 at: 245212 fontsize:S text: 245,212 shift:(-18,5) bar:1982 at: 239635 fontsize:S text: 239,635 shift:(-18,5) bar:1990 at: 233278 fontsize:S text: 233,278 shift:(-18,5) bar:1999 at: 225198 fontsize:S text: 225,198 shift:(-18,5) bar:2006 at: 222220 fontsize:S text: 222,220 shift:(-18,5) bar:2014 at: 213569 fontsize:S text: 213,569 shift:(-18,5) The 10 communes with more inhabitants in the department are: City Population (2014) Arrondissement Nevers 34,485 Nevers Cosne-Cours-sur-Loire 10,553 Cosne- Cours-sur-Loire Varennes-Vauzelles 9,467 Nevers Decize 5,626 Nevers La Charité-sur-Loire 5,008 Cosne-Cours-sur-Loire Fourchambault 4,456 Nevers Clamecy 3,889 Clamecy Garchizy 3,835 Nevers Marzy 3,656 Nevers Coulanges-lès- Nevers 3,591 Nevers ==Gallery== File:F06.Nevers.Palais Ducal.1161.JPG|Ducal Palace in Nevers File:2012-07-21 20-23-03 3-33 3-49 4-03 4-12 4-23 4-34-PA00112826-La Charité sur Loire ShiftN.jpg|Notre-Dame of La Charité-sur- Loire File:Chateau-de-Villemolin-0484.jpg|Château de Villemolin, Anthien File:Abbaye St Leonard a Corbigny DSC 0414.jpg|Abbey of Corbigny File:Château- Chinon (vue depuis Dommartin).jpg|Château-Chinon (Ville): view from Dommartin File:Loire, Cosne-sur-Loire, verkeersbrug.JPG|Bridge over the Loire, at Cosne- Cours-sur-Loire ==Related pages== * Arrondissements of the Nièvre department * Communes of the Nièvre department ==References== ==Other websites== * Departmental Council website * Prefecture website * Agence de Développement Touristique de la Nièvre",
 "title": "Nièvre"
}