{
 "id": "139726",
 "text": "Haute-Garonne (\"Upper Garonne\"; ) is a department in the southwest of France named after the Garonne river. Its main city and prefecture of the department is Toulouse. ==History== Haute-Garonne is one of the original 83 departments created during the French Revolution on March 4, 1790. It was created from part of the former province of Languedoc. The department was originally larger than now because it included the district of Castelsarrasin which was transferred to the department of Tarn-et-Garonne when it was created in 1808. == Geography == Haute-Garonne has an area of . It is part of the Occitanie region. The department is not a historical region of France; this is an administrative division made from various pieces of Languedoc and Gascogne. The department is surrounded by the departments: * Ariège to the southeast * Aude to the east * Tarn to the northeast * Tarn-et-Garonne to the north * Gers to the west * Hautes-Pyrénées to the southwest and by Spain (provinces of Lleida and Huesca) to the south. The department is crossed by the upper course of the Garonne river (hence the name) for nearly . The borders of the department follow the river. The Garonne enters France from Spain at the town of Fos, goes through Toulouse and leaves the department. Two big canals cross the department from east to west: the Canal du Midi and the Canal de Garonne. There are three distinct geographical areas in the department: # The extreme south of the department lies in the Pyrenees mountain range and there are many mountains. The highest mountain is Peak of Perdiguère () that is above sea level. # A first plain, to the north of the Pyrenees, that extends from Montréjeau to Saint-Martory # A second plain, the vast plain of Toulouse, that extends from Saint-Martory to the northern border of the department. ===Climate=== The climate of the department is an oceanic climate with template summers, Cfb in the Köppen climate classification. ==Administration== The department is managed by the Departamental Council of the Haute-Garonne in Toulouse. The Haute-Garonne is part of the region of Occitanie. ===Administrative divisions=== There are 3 arrondissements (districts), 27 cantons and 589 communes (municipalities) in the Haute- Garonne. Arrondissements of the Haute-Garonne department INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 311 Muret Muret 215,606 1,639.0 126 312 Saint-Gaudens Saint-Gaudens 77,545 2,139.6 237 313 Toulouse Toulouse 1,024,517 2,530.7 226 The following is a list of the 27 cantons of the Haute-Garonne department (with their INSEE codes), in France, following the French canton reorganisation which came into effect in March 2015:Décret n° 2014-152 du 13 février 2014 portant délimitation des cantons dans le département de la Haute- Garonne # Auterive (3101) # Bagnères-de-Luchon (3102) # Blagnac (3103) # Castanet-Tolosan (3104) # Castelginest (3105) # Cazères (3106) # Escalquens (3107) # Léguevin (3108) # Muret (3109) # Pechbonnieu (3110) # Plaisance-du- Touch (3111) # Portet-sur-Garonne (3112) # Revel (3113) # Saint-Gaudens (3114) # Toulouse-1 (3115) # Toulouse-2 (3116) # Toulouse-3 (3117) # Toulouse-4 (3118) # Toulouse-5 (3119) # Toulouse-6 (3120) # Toulouse-7 (3121) # Toulouse-8 (3122) # Toulouse-9 (3123) # Toulouse-10 (3124) # Toulouse-11 (3125) # Tournefeuille (3126) # Villemur-sur-Tarn (3127) ==Population== The inhabitants of Haute-Garonne are known, in French, as Haut-Garonnais (women: Haut-Garonnaises). Haute-Garonne has a population, in 2014, of 1,317,668, for a population density of inhabitants/km2. The arrondissement of Toulouse, with 1,024,517 inhabitants, is by far the largest. The other two, Muret and Saint- Gaudens, have respectively 215,606 and 77,545 inhabitants. Evolution of the population in Haute-Garonne Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:1400000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:140000 start:0 ScaleMinor = gridcolor:lightgrey increment:70000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 690712 bar:1975 from:0 till: 777431 bar:1982 from:0 till: 824501 bar:1990 from:0 till: 925962 bar:1999 from:0 till: 1046338 bar:2008 from:0 till: 1217344 bar:2014 from:0 till: 1317668 PlotData= bar:1968 at: 690712 fontsize:S text: 690,712 shift:(-13,5) bar:1975 at: 777431 fontsize:S text: 777,431 shift:(-18,5) bar:1982 at: 824501 fontsize:S text: 824,501 shift:(-18,5) bar:1990 at: 925962 fontsize:S text: 925,962 shift:(-18,5) bar:1999 at: 1046338 fontsize:S text: 1,046,338 shift:(-24,5) bar:2008 at: 1217344 fontsize:S text: 1,217,344 shift:(-24,8) bar:2014 at: 1317668 fontsize:S text: 1,317,668 shift:(-24,5) The 10 cities with more people living in them in 2014 in the department are: No. City Population (2014) Arrondissement 1 Toulouse 466,297 Toulouse 2 Colomiers 38,541 Toulouse 3 Tournefeuille 26,674 Toulouse 4 Muret 24,975 Muret 5 Blagnac 23,416 Toulouse 6 Plaisance-du-Touch 17,278 Toulouse 7 Cugnaux 17,004 Toulouse 8 Balma 15,319 Toulouse 9 Ramonville-Saint-Agne 13,986 Toulouse 10 Castanet-Tolosan 12,640 Toulouse ==Gallery== File:Toulouse Capitole Night Wikimedia Commons.jpg|Capitole de Toulouse at night File:Laréole - Le chateau - Façade Nord Ouest.jpg|Château de Laréole File:Bagnères-de-Luchon vue Pyrénées.JPG|Pyrenees seen from Bagnères-de-Luchon File:Lac d'OO-01.jpg|Lac d'Oô ==Related pages== * Arrondissements of the Haute-Garonne department * Communes of the Haute-Garonne department ==References== ==Other websites== * Departamental Council website * Prefecture website * Tourism website * Photography Panoramics 360° website",
 "title": "Haute-Garonne"
}