{
 "id": "139746",
 "text": "Lozère () is a department in the region of Occitanie in southern France near the Massif Central. It is named after Mont Lozère. ==History== Lozère was created in 1790 during the French Revolution, when the whole of France was divided into departments, replacing the old provinces. Lozère was formed with part of the old province of Languedoc. Les Sources and Hautes-Cèvennes were two other names proposed for this department but they were not accepted. ==Geography== Lozère has an area of . It is surrounded by 5 departments belonging to 2 regions: * Auvergne-Rhône-Alpes region ** Ardèche ** Cantal ** Haute-Loire * Occitanie region ** Aveyron ** Gard. The Lozère is divided into four natural regions, covering four mountain ranges: # The Aubrac. It is a plateau in the northwest of the department that rises between and , with a cold humid climate. The highest point is Signal de Mailhebiau with . # The Margeride. Located in the northeast of the department, these mountains are of granite and well forested. The climate here is cold, but dryer than the climate in Aubrac. The highest point is Signal de Randon with . # The Causses. These are a series of very dry limestone plateaus in the south-west of the department. # The Cévennes, a southern part of the Massif Central and that is found in the south-east of the department. Here is the highest point in the department, Mont Lozère at . Three important rivers start in the department: * The Tarn, with its source on the Mont Lozère. * The Lot, with its source also on the Mont Lozère. * The Allier, with its source is in the mountainous region of Margeride. ==Administration== The département is managed by the Departamental Council of Lozère in Mende. Lozère is part of the region of Occitanie. ===Administrative divisions=== There are 2 arrondissements (districts), 13 cantons and 176 communes (municipalities) in Lozère. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (inh./km²) Communes 481 Florac Florac Trois Rivières 13,313 1,687.5 44 482 Mende Mende 63,047 3,479.4 132 The following is a list of the 13 cantons of the Lozère department (with their INSEE codes), following the French canton reorganisation which came into effect in March 2015: # Aumont-Aubrac (4801) # La Canourgue (4802) # Chirac (4803) # Le Collet-de-Dèze (4804) # Florac (4805) # Grandrieu (4806) # Langogne (4807) # Marvejols (4808) # Mende-1 (4809) # Mende-2 (4810) # Saint-Alban-sur-Limagnole (4811) # Saint-Chély-d'Apcher (4812) # Saint-Étienne-du-Valdonnez (4813) ==Demographics== The inhabitants of Lozère are known, in French, as Lozériens (women: Lozériennes). Lozère is the least populated French department. It has a population, in 2014, of 76,360, for a population density of inhabitants/km2. The arrondissement of Mende, with 63,047 inhabitants, is by far the largest. The other arrondissement, Florac, have 13,313 inhabitants. The only important city is Mende with 11,542 people living there in 2014. The subprefecture, Florac Trois Rivières, has 2,107 inhabitants. Evolution of the population in Lozère Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:80000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:10000 start:0 ScaleMinor = gridcolor:lightgrey increment:5000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2008 text:2008 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 77258 bar:1975 from:0 till: 74825 bar:1982 from:0 till: 74294 bar:1990 from:0 till: 72825 bar:1999 from:0 till: 73509 bar:2008 from:0 till: 76973 bar:2014 from:0 till: 76360 PlotData= bar:1968 at: 77258 fontsize:S text: 77,258 shift:(-12,5) bar:1975 at: 74825 fontsize:S text: 74,825 shift:(-18,5) bar:1982 at: 74294 fontsize:S text: 74,294 shift:(-18,5) bar:1990 at: 72825 fontsize:S text: 72,825 shift:(-18,5) bar:1999 at: 73509 fontsize:S text: 73,509 shift:(-18,5) bar:2008 at: 76973 fontsize:S text: 76,973 shift:(-18,5) bar:2014 at: 76360 fontsize:S text: 76,360 shift:(-18,5) The cities with more than 2,000 inhabitants in the department are: City Population (2014) Arrondissement Mende 11,542 Mende Marvejols 4,882 Mende Saint- Chély-d'Apcher 4,169 Mende Langogne 2,903 Mende Bourgs sur Colagne 2,136 Mende La Canourgue 2,108 Mende Florac Trois Rivières 2,107 Florac ==Gallery== Cévennes - Lozère.jpg|The Cévennes in Lozère. France Lozère Mont Lozère 2.jpg|Mont Lozère Cathedrale Mende.jpg|Cathedral of Mende. Chateau et clocher Florac.JPG|Castle and church of Florac. ==Related pages== * Arrondissements of the Lozère department * Communes of the Lozère department ==References== ==Other websites== * General Council of Lozère * Prefecture website * Comité Départemental du Tourisme en Lozère",
 "title": "Lozère"
}