{
 "id": "139952",
 "text": ":This article is about the basic notions. For advanced topics, see Group theory. In mathematics, a group is a kind of algebraic structure. A group is a set with an operation. The group's operation shows how to combine any two elements of the group's set to get a third element from the set in a useful way. A familiar example of a group is the set of integers with the addition operation. Instead of \"an element of the group's set\", mathematicians usually save words by saying \"an element of the group\". Mathematicians use capital letters to stand for groups. They often use G, H, or K. They also use lower- case letters to stand for group elements. For example, they would say \"a is in G\" to mean \"a is an element of G\". They write group operations with symbols like • or *, or by writing two elements next to each other. So \"a • b\", \"a * b\", and \"ab\" can all mean \"the element formed when the group's operation combines a and b\". ==Group axioms== Not every set and operation make a group. A group's set and operation must obey some special rules. These are called group axioms. The following list has each axiom in both words and mathematical symbols. *Closure: When a group's operation puts together two elements, the element that is made must also be part of the group. **For all a, b in G, **:a • b is also in G. *Identity element: One element of the group is special. It is called the identity element. If the operation puts together the identity element and any second element, the answer will be that second element. The identity element is usually written as e. Sometimes the identity element is written as 0 or 1 (it does not mean it is zero or one only, but has a similar purpose). **There exists e in G, so that for all a in G, **: e • a = a • e = a. *Associativity: When the operation is used twice to combine three elements, it does not matter in what order it is done, because the answer will be the same. **For all a, b and c in G, **: (a • b) • c = a • (b • c). *Inverse element: Every element in the group has another element in the group that is called its inverse. When the operation combines any element and its inverse, the answer is the identity element. Sometimes, the inverse is indicated by writing either a '-' in front, or by writing -1 in superscript, so the inverse of the element a is either -a or a-1 (it depends on how one writes the identity element; once again it is only a way of writing and does not say that elements must be numbers). **For each a in G, there must be b in G so that **: a • b = b • a = e, *: where e is identity element of G. ==Some more ideas== To name the group, one should say all three parts: (G, •, e). But when it is clear, one may just say that G is a group. For most groups, one can find two elements a and b such thata • b is different fromb • a. That means, maybea • b = c, butb • a = d. This is why we say thata • b andb • a are not the same. The number of elements in a group is called the group's order. ===Abelian groups=== For some special groups,a • b = b • a for every a and b in the group. These groups have a special name. They are called Abelian groups and their operation is said to be commutative. ===Subgroups=== Sometimes, part of the group is also a group. In that case, the part is called a subgroup. For example, the even numbers form a subgroup of the integers, when the operation is addition, because adding any two even numbers gives another even number. Another example is the group of isometries of a shape, which is the set of ways the shape can be moved, including rotating or mirroring it. Performing any two movements in a row gives another movement, so the set of movements forms a group. A subgroup of movements that do not rotate the shape, but only shift it to another place in space, form a subgroup. ==Examples of groups== ===Integers, addition, zero=== One everyday example of a group is the set of integers with the addition operation. It is easy to see that when adding two integers, the result is always an integer. So, closure is true. The identity element for this group is zero. Because the order of additions does not matter (in other words, a + (b + c) = (a + b) + c), associativity rule is also true. And the inverse of any integer is its opposite number (the inverse element of zero is zero). This group is also an abelian group. It is an infinite group (also called a group of infinite order) because it has an infinite number of elements: all the integers. The set of integers with the multiplication operation is not a group, because with multiplication, most integers have no inverse that is also an integer (inverse element is not in the set). ===Symmetries=== Another important kind of groups are groups of symmetries. Symmetry groups provide many examples of groups. It can be proved that every group of finite order is a group of symmetries. For this reason, group theory is called the mathematical study of symmetry. Objects are symmetric if keep some interesting features when changed. Those changes of objects (of any kind) are called symmetries. ; Symmetries of finite sets Sets only have elements in them, so they are one of the simplest objects to think of. Symmetries of a set are one-to-one functions that shuffle the elements of this set. Those functions change elements one with other but for example keep their amount the same as before shuffling. When such group is finite (has finite order), say it has n elements, one can think of this group as the set of those shuffles (one- to-one functions) of n elements. The symmetric group given on n elements is often written as S_n. Shuffles can be combined one after another—function composition is the operation of this group. Because making shuffling after shuffling is yet another shuffling, that means that there is closure. Also three shuffles can be combined in any of two ways: first two in the beginning to give a shuffle to combine with a third one, or last two in the beginning to give a shuffle to be combined with the first one (associavity). The identity element is the shuffle in which nothing changes. Any shuffle can be undone by reversing the change. That reverse is the inverse element. Because order of shuffling matters—it is important which of the shuffles go first—group of symmetries are almost never abelian. ; Symmetries in geometry Think of a square and (one-to-one) functions can that shuffle the place of points of the square but keep the square as a whole in one place. Interesting features are size and place of the square. Such symmetries are called (global) isometries (see congruence). Here are all of the isometries of a square: turn the square clockwise 90o, 180o, or 270o; turn the square counter-clockwise 90o, 180o, or 270o; reflect the image of the square in a vertical mirror, or in a horizontal mirror, or a diagonal mirror to the right or the left; or leave the square as it was. This is a finite group, or a group of (finite) order 8, because there are 8 different isometries in total. It is a non-abelian group because it makes a difference which order when making a turn and a reflection. This is not only kind of symmetry for this square. When position is not an interesting feature then there are many more symmetries. Then infinitely many moves are allowed. If the shape of a square is all that matters then there is even more symmetries of this square, those are similarities. This shows that it is important to say what one exactly mean by ‘symmetry’. What are interesting features of objects that keep the same during a change. Idea to study geometry by studying symmetries of figures goes back to XIX century. It is how mathematicians think of geometry today. They even use those methods when studying different objects and speak about ‘geometry’ and ‘symmetries’ of strange objects. ===Other groups=== Many things in mathematics are groups. This is mostly because groups help to benefit from a brilliant idea of ‘a change that keeps interesting feature unchanged\", which are called symmetries. For example, equations. The ways of solving equations can be a group. Physical things can be studied as groups. There are important symmetries about physical things which are groups (this can be place, turn, time, energy, electric charge). Many useful things can be proved about groups and their subgroups, which is a study called group theory. For example, the order (number of elements) of any subgroup is always a factor of the group's order. == Related pages == * Field (mathematics) * Ring (mathematics) == References == == Other websites == * Category:Group theory",
 "title": "Group (mathematics)"
}