{
 "id": "140054",
 "text": "The 2000 United States presidential election happened on November 7, 2000. George W. Bush, the Republican candidate who was the Governor of Texas and the eldest son of the 41st president, George H. W. Bush, won the election. He defeated the Democratic candidate, Al Gore, who was the Vice President. Incumbent Democratic President Bill Clinton was not eligible to serve a third term, and Vice President Gore was able to secure the Democratic nomination. Bush was seen as the early favorite for the Republican nomination, and despite a contentious primary battle with Senator John McCain and other candidates, secured the nomination by Super Tuesday. Many third-party candidates also ran, most prominently Ralph Nader. Bush chose former Secretary of Defense Dick Cheney as his running mate, and Gore chose Senator Joe Lieberman as his. Both candidates focused primarily on domestic issues, such as the budget, tax relief, and reforms for federal social insurance programs, though the foreign policy was not ignored. Clinton and Gore did not often campaign together, a deliberate decision resulting from the Lewinsky scandal two years prior. Bush narrowly won the November 7 election, with 271 electoral votes to Gore's 266. There was a disagreement over who won Florida's 25 electoral votes because the way Florida voted was different from other states. A recount happened in the state and the uncommon event that the winner got fewer popular votes than the loser. The Court's decision in Bush v. Gore announced on December 12, 2000, this ended the recounts, effectively awarding Florida's votes to Bush and granting him the victory. ==Background== Article Two of the United States Constitution says that for a person to be elected and serve as President of the United States, they must be a natural-born citizen of the United States, at least 35 years old, and a resident of the United States for a period of no less than 14 years. Candidates for the presidency typically seek the nomination of one of the various political parties of the United States, in which case each party devises a method (such as a primary election) to choose the candidate the party deems best suited to run for the position. The party's delegates then officially nominate a candidate to run on the party's behalf. President Bill Clinton was unable to seek re-election for a third term because of the Twenty-second Amendment to the United States Constitution, which states that a president may only serve up to two terms. His term as president ended at noon eastern standard time on January 20, 2001. ==Candidates== ===Democratic Party=== ====Nominees==== Democratic Party Ticket, 2000 for President for Vice President 45th Vice President of the United States (1993–2001) U.S. Senator from Connecticut (1989–2013) Campaign Campaign ====Withdrawn candidate==== *Bill Bradley, a former U.S. Senator from New Jersey withdrew on March 9, 2000 and endorsed Al Gore. File:Senator Bill Bradley (D-NJ).jpg|Former Senator Bill Bradley of New Jersey (Withdrew on March 9, 2000) ===Republican Party=== ====Nominees==== Republican Party Ticket, 2000 for President for Vice President 46th Governor of Texas (1995–2000) 17th U.S. Secretary of Defense (1989–1993) Campaign Campaign ====Withdrawn candidates==== File:John McCain.jpg|Senator John McCain of Arizona (Withdrew on March 9, 2000) File:Alan Keyes.jpg|Former U.S. ECOSOC Ambassador Alan Keyes of Maryland (Withdrew on July 25, 2000) File:Steve_Forbes.jpg|Businessman Steve Forbes of New Jersey (Withdrew on February 10, 2000) File:Orrin Hatch official photo.jpg|Senator Orrin Hatch of Utah (Withdrew on January 26, 2000) File:Elizabeth Dole official photo.jpg|Former Secretary of Labor Elizabeth Dole of North Carolina (Withdrew on October 20, 1999) File:Patrickjbuchanan.JPG|Publisher and author Pat Buchanan of Virginia (Withdrew on October 25, 1999) File:Dan Quayle crop.jpg|Former Vice President Dan Quayle of Indiana (Withdrew on September 27, 1999) File:Lamar Alexander black and white photo.jpg|Former Governor Lamar Alexander of Tennessee (Withdrew on August 22, 1999) File:Robert C Smith.jpg|Senator Robert C. Smith of New Hampshire (Withdrew in October 1999) File:John Kasich.jpg|Representative John Kasich of Ohio (Withdrew in July 1999) File: Herman Cain by Gage Skidmore 4.jpg|Businessman Herman Cain of Nebraska (Withdrew early in campaign) == References == Presidential election Category:2000 elections 2000 Category:2000s elections in the United States",
 "title": "2000 United States presidential election"
}