{
 "id": "140059",
 "text": "The 2004 United States presidential election happened on November 2, 2004. George W. Bush, the incumbent president and Republican candidate, won reelection. He defeated John Kerry, the Democratic candidate, who was the junior U.S. Senator from Massachusetts. Foreign policy was the biggest issue during the election mainly because of the War on Terrorism and the 2003 Invasion of Iraq. Since the last presidential election, there were concerns about voting. The winner was not determined until the following day when Kerry decided not to dispute Bush's win in the state of Ohio. The state held enough electoral votes to determine the winner of the presidency. Both Kerry and Democratic National Committee Chairman Howard Dean have stated their opinion that voting in Ohio did not proceed fairly and that, had it done so, the Democratic ticket might have won that state and therefore the election. Only three states changed which party to vote for. New Mexico and Iowa voted Democratic in 2000, but those states voted Republican in 2004. New Hampshire voted Republican in 2000 but the state voted Democratic in 2004. In the Electoral College, Bush received 286 electoral votes, and Kerry received 251 electoral votes. Kerry was supposed to have 252, but one electoral vote that was supposed to go for Kerry went for his running mate, John Edwards. ==Candidates== ===Republican=== ====Nominees==== Republican Party Ticket, 2004 for President for Vice President 43rd President of the United States (2001–2009) 46th Vice President of the United States (2001–2009) Campaign Campaign ===Democrats=== ====Nominees==== Democratic Party Ticket, 2004 for President for Vice President U.S. Senator from Massachusetts (1985–2013) U.S. Senator from North Carolina (1999–2005) Campaign Campaign ====Withdraw candidates==== *John Edwards, U.S. Senator from North Carolina (withdrew on March 2, 2004, and endorsed John Kerry) *Howard Dean, former Governor of Vermont (withdrew on February 18, 2004, and endorsed John Kerry) *Wesley Clark, retired U.S. General from Arkansas (withdrew on February 11, 2004, and endorsed John Kerry) *Dennis Kucinich, U.S. Representative from Ohio (withdrew on July 22, 2004, and endorsed John Kerry) *Al Sharpton, Reverend and civil rights activist from New York (withdrew on March 15, 2004, and endorsed John Kerry) *Joe Lieberman, U.S. Senator from Connecticut, 2000 US Election Democratic vice-presidential nominee (withdrew on February 3, 2004, and endorsed John Kerry) *Dick Gephardt, U.S. Representative from Missouri (withdrew on January 20, 2004, and endorsed John Kerry) *Carol Moseley Braun, former U.S. Senator from Illinois (withdrew on January 15, 2004, and endorsed Howard Dean. She then endorsed John Kerry) *Bob Graham, U.S. Senator from Florida (withdrew on October 6, 2003, and endorsed John Kerry) File:John Edwards, official Senate photo portrait.jpg| File:HowardDeanDNC-cropped.jpg| File:General Wesley Clark official photograph.jpg| File:Dennis Kucinich.jpg| File:Al Sharpton 20060109.jpg| File:Joe Lieberman official portrait 2 (cropped).jpg| File: Dick Gephardt.jpg| File: Carol Moseley Braun NZ.jpg| File:Bob Graham, official Senate photo portrait, color.jpg| File:Lyndon LaRouche.jpg|Political Activist Lyndon LaRouche of Virginia ==References== Category:2004 in the United States Category:2004 elections in the United States Category:2004 elections Category:John Kerry 2004 Category:2000s elections in the United States",
 "title": "2004 United States presidential election"
}