{
 "id": "140317",
 "text": "Digital signal processing (DSP) is concerned with the processing of digital signals or analog signals after converting from analog to digital format. DSP includes subfields like: communication signals processing, radar signal processing, sensor array processing, digital image processing, etc. DSP is used with real-world analog signals when this will work better than analog signal processing. The first step is usually to convert the signal from an analog to a digital form, by using an analog-to-digital converter. Often, the required output signal is another real-world analog signal, which requires a digital-to-analog converter. Digital signal processing algorithms can run on: # General purpose microprocessors and standard computers. # Specialized processors called digital signal processors (DSPs). # Purpose-built hardware such as application-specific integrated circuit (ASICs) and field-programmable gate arrays (FPGAs). # Digital Signal Controllers (mostly for industrial applications such as motor control). # Stream processing that works very well for traditional DSP or graphics processing applications (such as image, video). == Related pages== *Quadrature mirror filter * Automatic control * Computer Science * Data compression * Electrical engineering * Information theory * Telecommunication == References == ==Other websites== *Free Video Tutorials on Digital Signal Processing by Prof. Dutta Roy == Further reading == *Alan V. Oppenheim, Ronald W. Schafer, John R. Buck : Discrete-Time Signal Processing, Prentice Hall, *Boaz Porat: A Course in Digital Signal Processing, Wiley, *Richard G. Lyons: Understanding Digital Signal Processing, Prentice Hall, *Jonathan Yaakov Stein, Digital Signal Processing, a Computer Science Perspective, Wiley, *Sen M. Kuo, Woon-Seng Gan: Digital Signal Processors: Architectures, Implementations, and Applications, Prentice Hall, *Bernard Mulgrew, Peter Grant, John Thompson: Digital Signal Processing - Concepts and Applications, Palgrave Macmillan, *Steven W. Smith: Digital Signal Processing - A Practical Guide for Engineers and Scientists, Newnes, *Paul A. Lynn, Wolfgang Fuerst: Introductory Digital Signal Processing with Computer Applications, John Wiley & Sons, *James D. Broesch: Digital Signal Processing Demystified, Newnes, *John G. Proakis, Dimitris Manolakis: Digital Signal Processing - Principles, Algorithms and Applications, Pearson, *Hari Krishna Garg: Digital Signal Processing Algorithms, CRC Press, *P. Gaydecki: Foundations Of Digital Signal Processing: Theory, Algorithms And Hardware Design, Institution of Electrical Engineers, *Paul M. Embree, Damon Danieli: C++ Algorithms for Digital Signal Processing, Prentice Hall, *Anthony Zaknich: Neural Networks for Intelligent Signal Processing, World Scientific Pub Co Inc, *Vijay Madisetti, Douglas B. Williams: The Digital Signal Processing Handbook, CRC Press, *Stergios Stergiopoulos: Advanced Signal Processing Handbook: Theory and Implementation for Radar, Sonar, and Medical Imaging Real-Time Systems, CRC Press, *Joyce Van De Vegte: Fundamentals of Digital Signal Processing, Prentice Hall, *Ashfaq Khan: Digital Signal Processing Fundamentals, Charles River Media, *Jonathan M. Blackledge, Martin Turner: Digital Signal Processing: Mathematical and Computational Methods, Software Development and Applications, Horwood Publishing, *Bimal Krishna, K. Y. Lin, Hari C. Krishna: Computational Number Theory & Digital Signal Processing, CRC Press, *Doug Smith: Digital Signal Processing Technology: Essentials of the Communications Revolution, American Radio Relay League, *Henrique S. Malvar: Signal Processing with Lapped Transforms, Artech House Publishers, *Charles A. Schuler: Digital Signal Processing: A Hands-On Approach, McGraw-Hill, *James H. McClellan, Ronald W. Schafer, Mark A. Yoder: Signal Processing First, Prentice Hall, *Artur Krukowski, Izzet Kale: DSP System Design: Complexity Reduced Iir Filter Implementation for Practical Applications, Kluwer Academic Publishers, *John G. Proakis: A Self-Study Guide for Digital Signal Processing, Prentice Hall,",
 "title": "Digital signal processing"
}