{
 "id": "140423",
 "text": "Nicholas Jerry Jonas (born September 16, 1992) is an American singer- songwriter and actor. Jonas formed a band with his older brothers, Joe and Kevin, known as the Jonas Brothers. The group released their debut studio album It's About Time. The band became a Disney favorite and later starred in Camp Rock (2008) and its sequel Camp Rock 2: The Final Jam (2010) as well as two of their own series, Jonas Brothers: Living the Dream (2008–2010) and Jonas (2009–2010). In 2017, Jonas appeared in the adventure comedy movie Jumanji: Welcome to the Jungle. Jonas is married to Indian actress and singer Priyanka Chopra. In January 2022, the couple had their first child, via surrogacy. ==Television== * The Voice (2020-2021) - Coach ==Discography== Solo albums * Nicholas Jonas (2005) * Nick Jonas (2014) * Last Year Was Complicated (2016) * Spaceman (2021) with The Administration * Who I Am (2010) with the Jonas Brothers *It's About Time (2006) *Jonas Brothers (2007) *A Little Bit Longer (2008) *Lines, Vines and Trying Times (2009) *Happiness Begins (2019) ==Acting credits== ===Theatre=== Year Title Role Notes 2000 A Christmas Carol Tiny Tim 2001 Annie Get Your Gun Little Jake 2002 Beauty and the Beast Chip 2003 Les Misérables Gavroche 2003 The Sound of Music Kurt PaperMill Playhouse 2010 Les Misérables Marius Pontmercy June 21, 2010 – July 24, 2010; October 3, 2010 (25th Anniversary Concert) 2011 Hairspray Link Larkin August 5–7, 2011 at the Hollywood Bowl 2012 How to Succeed in Business Without Really Trying J. Pierrepont Finch Broadway, January 24 – May 20, 2012 ===Movies=== Film Year Title Role Notes 2009 Night at the Museum: Battle of the Smithsonian Cherub Voice 2015 Careful What You Wish For Doug Martin 2016 Goat Brett Land 2017 Jumanji: Welcome to the Jungle Jefferson \"Seaplane\" McDonough 2019 UglyDolls Lou Voice 2019 Midway Aviation Machinist Mate Bruno Gaido 2019 Jumanji: The Next Level Jefferson \"Seaplane\" McDonough 2021 Chaos Walking Davy Prentiss Jr. Concert/ Documentary Film Year Title Role Notes 2008 Hannah Montana and Miley Cyrus: Best of Both Worlds Concert Himself Concert Film 2009 Jonas Brothers: The 3D Concert Experience Himself Concert Film 2010 Les Misérables: 25th Anniversary Concert Marius Pontmercy Concert Film 2015 Taylor Swift: The 1989 World Tour Live Himself Concert film 2017 Demi Lovato: Simply Complicated Himself Documentary film 2019 Jonas Brothers: Chasing Happiness Himself Documentary film 2020 Happiness Continues: A Jonas Brothers Concert Film Himself Concert Film, Documentary film 2022 Jersey Boys Frankie Valli Musical Taping ===Television=== Television Year Title Role Notes 2007 Hannah Montana Himself Episode: \"Me and Mr. Jonas and Mr. Jonas and Mr. Jonas\" 2008 Camp Rock Nate Gray Television film 2009–2010 Jonas Nick Lucas 33 episodes 2010 Camp Rock 2: The Final Jam Nate Gray Television film 2011 Mr. Sunshine Eli White Episode: \"Employee of the Year\" 2011 Last Man Standing Ryan Vogelson Episode: \"Last Christmas Standing\" 2012 Smash Lyle West 2 episodes 2012 Submissions Only Lonely Dancer Episode: \"Another Interruption\" 2013–2015 Hawaii Five-0 Ian Wright 3 episodes 2014–2017 Kingdom Nate Kulina 40 episodes 2015 Scream Queens Boone Clemens 5 episodes 2020 Dash & Lily Himself Episode: \"New Year's Eve\" 2021 Calls Sam Episode: The Universe Did It Reality television Year Title Role Notes 2008–2010 Jonas Brothers: Living the Dream Himself 18 episodes 2008–2010 Extreme Makeover: Home Edition Himself \"The Akers Family\" (Season 6, Episode 2), \"The Heathcock Family\" (Season 7, Episode 17) 2008 Disney Channel Games Himself / Contestant 5 episodes; part of Red Team 2009 Band in a Bus Himself Reality DVD 2010 I Get That a Lot Himself May 19, 2010 episode 2010 The Biggest Loser Himself Season 10, Episode 13 2012 The X Factor Himself Your No. 1 Fansite and Exclusive Source for the Jonas Brothers \" 'X Factor': Nick Jonas Paired With Demi Lovato for Judge's House Round . JonasWorld.Org (August 28, 2012). (Judges Houses) 1, 2, 3 (October 10–11 & October 17) 2012–2013 Married to Jonas Himself 4 episodes 2016 CMT Crossroads Himself Summer 2016 performance with Thomas Rhett 2016 Running Wild with Bear Grylls Himself Location: Sierra Nevada 2019 Songland Himself Episode: \"Jonas Brothers\" 2015, 2020–2021 The Voice Himself Season 8 (The Battle Round), Season 18 and Season 20 coach 2021 Jonas Brothers Family Roast Himself Netflix Special 2022 Dancing With Myself Himself dance creators Guest appearances Year Title Artist Notes 2008 Studio DC: Almost Live Himself Second show 2009–2021 Saturday Night Live Himself 2009 (musical guest/sketches), 2016 (musical guest/sketches), 2019 (musical guest), 2021 (Host/musical guest) 2010 Live! with Regis and Kelly Himself (Host) January 8, 2010 episode 2010 Minute to Win It Himself May 12, 2010 episode 2012 Opening Act Himself Nick Jonas & Patrick TannerNick Jonas OPENING ACT STAR . oceanUP.com. 2013 Miss USA 2013 Himself Host and performer with Jonas Brothers 2015 2015 Kids' Choice Awards Himself (Host) First time hosting an awards show 2016 Maya & Marty Himself June 14, 2016 episode 2016–2019 Carpool Karaoke Himself May 16, 2016 episode alongside Demi Lovato March 7, 2019 episode alongside Joe and Kevin Jonas 2020 Dash & Lily Himself Performed Like It's Christmas alongside Joe and Kevin Jonas 2021 2021 Billboard Music Awards Himself (Host) Second time hosting an awards show 2021 My Life Himself Highlights show 2021 Olympic Dreams with Jonas Brothers Himself Special ===Web=== Web Year Title Role Notes 2009 KSM: Read Between the Lines Himself Episode: \"Hangin' with the Jonas Brothers\" 2021 Jonas Brothers: Moments Between The Moments Himself Mini Series ===Music videos=== Music video appearance Year Title Artist Notes 2011 \"My Time\" Gabrielle Giguere Producer, cameo 2015 \"OXO\" (Lyric Video) Olivia Somerlyn Cameo ==Tours== ;Headlining * Who I Am Tour (2010) * Nick Jonas 2011 Tour (2011) * Nick Jonas Live (2014) * Nick Jonas Live in Concert (2015) ;Co-headlining * Future Now Tour (with Demi Lovato) (2016) ;Opening act * Maroon V Tour (2015) * 24K Magic World Tour (2018) ==Awards and nominations== Year Title Award Nominated work Result 2009 Los Premios MTV Latinoamérica Best Fashionista (Most Fashionable) Himself 2010 Kids' Choice Awards Favorite TV Actor Himself Nickelodeon Mexico Kids' Choice Awards Favorite International Character Male Himself Teen Choice Awards Choice Music: Love Song \"Stay\" Choice Breakout Artist: Male Nick Jonas & The Administration Young Hollywood Awards Young Hollywood Artist of the Year Himself 2011 Kids' Choice Awards Favorite TV Actor Himself DRLC DREAM Award Himself 2012 Broadway Beacon Awards 2012 \"Contributions to the theater community\"Nick Jonas . Nick J Online.'Nick And Joe Jonas Are Such Sweeties!' . oceanUP.com. Your No. 1 Fansite and Exclusive Source for the Jonas Brothers \" Nick Jonas at the Broadway Beacon Awards . JonasWorld.Org (March 30, 2008). 2013 Teen Choice Awards Acuvue Inspire Award Himself 2014 Young Hollywood Awards Coolest Crossover Artist Himself MTV European Music Awards Artist on the Rise Himself 2015 Kids' Choice Awards Favorite Male Singer Himself Radio Disney Music Awards He's The One – Best Male Artist Himself XOXO – Best Crush Song \"Jealous\" Much Music Video Awards Favorite International Artist Himself Teen Choice Awards Choice Male Artist Himself Choice Song: Male Artist \"Jealous\" MTV Video Music Awards Best Male Video \"Chains\" MTV Europe Music Award Best US Act Himself American Music Awards Favorite Male Artist – Pop/Rock Himself 2016 People's Choice Awards Favorite Premium Cable TV Actor Kingdom Favorite Male Artist Himself Kids' Choice Awards Favorite Male Singer Himself Radio Disney Music Awards He's The One – Best Male Artist Himself iHeartRadio Music Awards Triple Threat Artist Himself Hal David Starlight Award Hal David Starlight Award Himself BMI Awards Pop Songwriter \"Jealous\" iHeartRadio Much Music Video Awards iHeartRadio International Artist of the Year Himself – \"Close\" Most Buzzworthy International Artist or Group Teen Choice Awards Choice Music: Male Artist Himself Choice Music Single: Male \"Close\" – Nick Jonas featuring Tove Lo Choice Music: Love Song \"Close\" – Nick Jonas featuring Tove Lo Choice Summer Music Star: Male Himself Choice Summer Tour \"Future Now Tour\" – Demi Lovato and Nick Jonas Choice Style: Male Himself MTV Video Music Awards Song of Summer \"Bacon\" 2017 People's Choice Awards Favorite Premium Series Actor Kingdom Radio Disney Music Awards He's The one – Best Male Artist Himself Stuck in Our Heads – Best Song To Lip Sync To Bacon I'm with the Band! – Radio Disney Favorite Tour Himself & Demi Lovato – Future now tour Hero Award Himself CMT Music Awards CMT Performance of the Year \"Close\" – with Thomas Rhett 2018 75th Golden Globe Awards Best Original Song – Motion Picture Home Guild of Music Supervisors' GMS Awards Best Song/Recording Created for a Film Home 2018 MTV Movie & TV Awards Best On-Screen Team Dwayne Johnson, Kevin Hart, Jack Black, Karen Gillan and Nick Jonas – Jumanji: Welcome to the Jungle 2018 Teen Choice Awards ChoiceSceneStealer Jumanji: Welcome to the Jungle as Jefferson \"Seaplane\" McDonough 2018 MTV Europe Music Awards Best World Stage Himself 2021 Streamy Awards Crossover Himself ==References== == Other websites == * * * Category:1992 births Category:Actors from Dallas Category:Actors from New Jersey Category:American R&B; musicians Category:American R&B; singers Category:American child singers Category:American drummers Category:American stage actors Category:American movie actors Category:American pianists Category:American pop musicians Category:American pop singers Category:American rock guitarists Category:American rock singers Category:American singer-songwriters Category:American television actors Category:American voice actors Category:Living people Category:Musicians from Dallas Category:Musicians from New Jersey Category:People from Wyckoff, New Jersey Category:Singers from Dallas Category:Singers from New Jersey Category:Writers from Dallas Category:Writers from New Jersey Category:Jonas Brothers members",
 "title": "Nick Jonas"
}