{
 "id": "140648",
 "text": "Zoophilia is a type of paraphilia. People who have it feel sexually or romantically attracted to animals. These people are called zoophiles. Richard von Krafft-Ebing first used the term 1886. In his work Psychopathia sexualis, Krafft-Ebing talks about the abuse of animals,which he also calls bestiality. He also talks about zoophilia erotica, which he defines as being sexually attracted to animal hide or fur. Today, the term bestiality is used to refer to sexual activity with animals. It is illegal in many countries. Zoophilia is a mental disorder in the DSM. ==Occurence== The Kinsey Reports, which were published in 1948 and 1953, found that 8% of males, and 3.7% of females had had sexual relations with animals. According to these reports, with people living on farms these numbers rose to between 40% and 50%.D. Richard Laws, William T. O’Donohue: Books.Google.co.uk Sexual Deviance. Guilford Press, 2008, ISBN 978-1-59385-605-2, S. 391. The problem with the Kinsey Reports is that most people who took part were convicts, the sample does not represent all of the population, which is known as selection bias. Martin Duberman, who continued Kinsey's work removed the convicts from the samples, but he didn't find a significant change in the results.Richard Duberman: The Nation, 3. November 1997, S. 40–43. Review of Alfred C. Kinsey: A Public/Private Life. By James H. Jones. In a 1974 study, 4.9% of males said they had had sexual interactions with animals.Hunt 1974 In 1974, the possibility to live with animals on a farm had decreased by 80%. The 1974 study found that the numbers almost halved: 4.9% of men indicated they had had sexual relations with animals, in comparison to the 8% of the Kinsey Reports of 1948; similarly, 1.9% of women indicated that choice, compared to the 3.6% of the Kinsey Reports of 1953. According to Miletski, this isn't due to less interest, but simply because people have less opportunity.Hunt 1974, cited and re-examined by Miletski (1999) In 1973, Nancy Friday published the book called My Secret Garden. In it, she describes about 190 sexual fantasies of women; 23 of these fantasies include sexual activities with animals. People who are hospitalized in a psychiatric hospital have a higher reported prevalence of zoosexuality/zoophilia than the normal population (55%; 45% real sexual contacts, 30% sexual fantasies, compared to the 10% in the control group and 15% of hospital staff). Having sexual fantasies about sex with animals also occur in people who do not show any interest in copulating with animals in real life. According to Nancy Friday this might be a way to flee from cultural expectations and limitations as to what kind of sexual activity is permissible in a society. Studies have found, that women watching movies which include Bonobos copulating have shown greater vaginal reactions than those who watched movies without such sexual stimuli. Zoophilia is a phenomenon that occurs in many different groups: It occurs with \"White people, black people, Asians, Mormons, Amish, Catholics, atheists, pagans, jews, men and women\". People who \"grow up in a region with animals dont become zoophile more often than those who grow up in a region without them, such as a city\". ==References== Category:Paraphilias",
 "title": "Zoophilia"
}