{
 "id": "140697",
 "text": "Child pornography or shortened as CP is pornography that shows children. It is against the law in many countries. Child pornography is made by taking pictures or videos, or more rarely sound recordings, of children who are wearing less clothing than usual, wearing no clothing, or having sexual relations. It can also be made using illustrations of children. Child pornography is called by some people \"child sexual abuse images\" due their belief that they are images (pictures) of a child who is being sexually abused. Child pornography can also be drawn, written, or created by a computer. In that case, it is called \"simulated child pornography\", \"virtual child pornography\", \"non-photographic child pornography\", or \"pseudo- photographic child pornography\": the child in the pornography is simulated, virtual, or drawn, meaning the child is not real. There are several possible reasons for a person to look at child pornography. The most common is that the viewer is a pedophile, hebephile, or ephebophile who finds minors sexually attractive and uses pornography featuring minors to induce arousal.Lanning, Kenneth V. (2001). \"Child Molesters: A Behavioral Analysis 4th ed\". National Center for Missing and Exploited Children. Viewers may be curious about the subject.U.S. Sentencing Commission (2012). \"Child Pornography Offender Behavior\". Report to the Congress: Federal Child Pornography Offenses (PDF). Or a person who plans to commit statutory rape may plan to show the pornography to a minor as a form of grooming to convince the minor that minors having sex with adults is normal. Mexico is the largest distributor of child pornography in the world. == Laws about child pornography == Between 2016 and 2018, many countries made their child pornography laws more similar, which let police from different countries work together more easily. In particular, the word \"child\" in the new child pornography laws is used as a synonym for legal minors under the age of 18. This can be confusing because \"child\" usually means a person who has not yet reached puberty. However, in 2007, the United States already had laws forbidding pornography with models under 18, and most people who were arrested for owning child pornography around that time had images of children who have not started puberty. Some countries consider virtual or non-photographic child pornography which depict children who are not real to be a type of child porn that is illegal, whereas other countries do not consider this type of child porn illegal. Making this type of child porn illegal has been controversial. This is due to multiple reasons: due to the opinion that it is pointless to protect children who are not real, the opinion that such laws remove people of their rights, a fear that these laws can cover harmless material, and the fear that it is possible to exploit such laws to charge harmless individuals with heavily disproportionate charges. Another criticism that is often given to the illegal nature of pornographic depiction of fictional children is the assertion that removing a potential a pedophile's ability to access an alternative to the \"real thing\" will encourage them abuse real children. Research on whether this is true or not has produced mixed results. In England due to a 2009 act, basically all non- photographic child pornography is illegal, even if it is something unrealistic, such as an anime drawing. However, charges for unrealistic non- photographic child porn possession or creation which do not involve real children tend to get dismissed by judges at trials and are not treated overly seriously. The Internet is a common place for people to share child pornography, especially on the dark web. When police officers find child pornography on the Internet, it is difficult for them to track down the molester and the other people who have looked at the recording. == Abuse and harm caused to the child == Child molestation is when an adult touches a child in the genital area (between the legs), buttocks, or breasts, or a child is made to touch an adult in those areas nonconsentually. An adult touching any part of a child's body is also sometimes called molestation. This kind of nonconsentual molestation is very harmful to children and can traumatize them for years or for the rest of their lives. An adult recording an instance of nonconsentual molestation as child pornography also harms the child. This harm from the recording is added to the harm from the nonconsentual molestation itself. Knowing that the nonconsentual molestation was recorded can slow down the child's healing from the abuse. The adult who has the recording can sell the recording, or threaten to share it with other adults to scare the child in the recording and make them obey the adult. == Related pages == * Child abuse * Child prostitution * Human trafficking == References == == Other websites == * Cyber Tipline * Stop It Now Category:Child sexual abuse Category:Pornography Category:Obscenity",
 "title": "Child pornography"
}