{
 "id": "140613",
 "text": "The Rashtriya Swayamsevak Sangh (RSS), (राष्ट्रीय स्वयंसेवक संघ, lit. \"National Volunteer Union\" or \"National Volunteer Corps\") is an Indian right- wing Hindu nationalist volunteer organization. It leads a group of affiliated organizations called the Sangh Parivar (\"Sangh family\"), which have a presence across Indian society. This network includes the Bharatiya Janata Party, the current ruling party under Prime Minister Narendra Modi. Mohan Bhagwat has been the Sarsanghchalak (सरसंघचालक, Chief leader) of the RSS since March 2009. The Rashtriya Swayamsevak Sangh (RSS) was founded on 27 September 1925 with the aim of providing character training and promoting \"Hindu discipline\" to unite the Hindu community and establish a Hindu Rashtra (Hindu nation). It works to spread the ideology of Hindutva and emphasizes the preservation of Indian culture and civilizational values. However, RSS has been a subject of debate and criticism. Some describe it as being founded on Hindu supremacy and have accused it of intolerance toward minorities, particularly in relation to anti-Muslim activities. The organization's role in Indian politics and society continues to be widely discussed and interpreted from different perspectives. The Rashtriya Swayamsevak Sangh (RSS) did not participate in the Indian independence movement and has been criticized for its ties to the British colonial administration. After India's independence, it grew into a major Hindu nationalist organization, establishing schools, charities, and affiliated groups to promote its ideology. The RSS was banned multiple times by the Indian government. The first ban was in 1948 after Nathuram Godse, a former RSS member, assassinated Mahatma Gandhi. It was banned again during the Emergency (1975–1977) and a third time following the demolition of the Babri Masjid in 1992.Today, the RSS is considered the world's largest far-right organization by membership. However, it has faced criticism, with scholars arguing that it spreads hatred and promotes violence. Its role in Indian politics and society remains a subject of ongoing debate. References Category:Nationalist organizations in India Category:Hinduism Category:Politics of India Category:1925 establishments in Asia Category:1920s establishments in India",
 "title": "Rashtriya Swayamsevak Sangh"
}