{
 "id": "140759",
 "text": "This page is an incomplete list of awards and nominations of Shahrukh Khan, an Indian actor. He has won 14 Filmfare Awards, 9 Star Screen Awards, 3 IIFA Awards, 8 Zee Cine Awards, 3 Bollywood Movie Awards, 2 Global Indian Film Awards & many other awards. He also has won all the Best Actor Awards at Star's Sabsey Favourite Kaun Awards. He was also honoured Rajiv Gandhi Award for Excellence in the Field of Entertainment in 2002 & Padma Shri, India's fourth highest civilian award from the Government of India in 2005. ==Filmfare Awards== * 1993 - Filmfare Best Debut Award for Deewana * 1994 - Filmfare Best Actor Award for Baazigar * 1995 - Filmfare Critics Award for Best Performance for Kabhi Haan Kabhi Naa * 1995 - Filmfare Best Villain Award for Anjaam * 1996 - Filmfare Best Actor Award for Dilwale Dulhania Le Jayenge * 1998 - Filmfare Best Actor Award for Dil To Pagal Hai * 1999 - Filmfare Best Actor Award for Kuch Kuch Hota Hai * 2001 - Filmfare Critics Award for Best Performance for Mohabbatein * 2003 - Filmfare Best Actor Award for Devdas * 2005 - Filmfare Best Actor Award for Swades * 2008 - Filmfare Best Actor Award for Chak De India * 2011 - Filmfare Best Actor Award forMy Name is Khan Special Awards * 2002 - Filmfare Special Award Swiss Consulate Trophy * 2004 - Filmfare Power Award * 2005 - Filmfare Power Award * 1994 - Filmfare Best Actor Award for Kabhi Haan Kabhi Naa * 1994 - Filmfare Best Villain Award for Darr * 1998 - Filmfare Best Actor Award for Yes Boss * 1999 - Filmfare Best Villain Award for Duplicate * 2000 - Filmfare Best Comedian Award for Baadshah * 2001 - Filmfare Best Actor Award for Mohabbatein * 2002 - Filmfare Best Actor Award for Kabhi Khushi Kabhie Gham * 2004 - Filmfare Best Actor Award for Kal Ho Naa Ho * 2005 - Filmfare Best Actor Award for Main Hoon Na * 2005 - Filmfare Best Actor Award for Veer Zaara * 2007 - Filmfare Best Actor Award for Kabhi Alvida Naa Kehna * 2007 - Filmfare Best Actor Award for Don - The Chase Begins Again * 2008 - Filmfare Best Actor Award for Om Shanti Om Shahrukh Khan has won 8 Filmfare Best Actor Awards in his 19 year career. ==Star Screen Awards== Winner *1996: Star Screen Award Best Actor for Dilwale Dulhaniya Le Jayenge *2002: Star Screen Award Jodi No. 1 (along with Kajol) for Kabhi Khushi Kabhie Gham *2003: Star Screen Award Best Actor for Devdas *2003: Star Screen Award Jodi No. 1 (along with Aishwarya Rai) for Devdas *2005: Star Screen Award Best Actor for Veer-Zaara *2005: Star Screen Award Jodi No. 1 (along with Preity Zinta) for Veer-Zaara *2007: Star Screen Award Jodi No. 1 (along with Rani Mukerji) for Kabhi Alvida Naa Kehna *2008: Star Screen Award Best Actor for Chak De India *2008: Star Screen Award Jodi No. 1 (along with Deepika Padukone) for Om Shanti Om Nominated *1998: Star Screen Award Best Actor for Dil To Pagal Hai *1999: Star Screen Award Best Actor for Kuch Kuch Hota Hai *2001: Star Screen Award Best Actor for Mohabbatein *2002: Star Screen Award Best Actor for Kabhi Khushi Kabhie Gham *2004: Star Screen Award Best Actor for Chalte Chalte *2006: Star Screen Award Best Actor for Paheli *2007: Star Screen Award Best Villain for Don - The Chase Begins Again ==International Indian Film Academy Awards== Winner *2003: IIFA Best Actor Award for Devdas *2005: IIFA Best Actor Award for Veer-Zaara *2008: IIFA Best Actor Award for Chak De India *2011: IIFA Best Actor Award for My Name Is Khan Nominated *2001: IIFA Best Actor Award for Mohabbatein *2002: IIFA Best Actor Award for Kabhi Khushi Kabhie Gham *2006: IIFA Best Actor Award for Paheli *2007: IIFA Best Actor Award for Don - The Chase Begins Again ==Zee Cine Awards== Winner *1998: Zee Cine Award Best Actor- Male for Dil To Pagal Hai *1999: Zee Cine Award Best Actor- Male for Kuch Kuch Hota Hai *2003: Zee Cine Award Best Actor- Male for Devdas *2004: Zee Cine Award Superstar of the Year- Male for Kal Ho Naa Ho *2005: Zee Cine Award Best Actor- Male for Veer-Zaara *2007: Fun Cinema Entertainer of the year for Don - The Chase Begins Again *2008: Zee Cine Award Best Actor- Male for Chak De! India *2008: Zee Cine Award Icon Award *2011: Zee Cine Award Best Actor - Male for My Name Is Khan *2012: Zee Cine Award Best Actor - Male for Ra.One *2013: Zee Cine Award Best Actor - Male for Jab Tak Hai Jaan *2014: Zee Cine Award Best Actor - Male for Chennai Express Nominated *2005: Zee Cine Award Best Actor- Male for Main Hoon Na *2005: Zee Cine Award Best Actor- Male for Swades *2006: Zee Cine Award Best Actor- Male for Paheli *2007: Zee Cine Award Best Actor- Male for Kabhi Alvida Naa Kehna *2007: Zee Cine Award Best Actor- Male for Don - The Chase Begins Again *2008: Zee Cine Award Best Actor- Male for Om Shanti Om Special Award * 2014: Zee Cine Special Most Influential Bollywood Personality on Social Media ==Bollywood Movie Awards== Winner *1999: Bollywood Movie Award - Most Sensational Actor for Dil Se *1999: Bollywood Faltu Movie Award - Best Actor for Kuch Kuch Hota Hai *2003: Bollywood Movie Award - Best Actor for Devdas *2005: Bollywood Movie Award - Best Actor for Veer-Zaara *2008: Bollywood Movie Award - Best Actor for Chak De! India ==Global Indian Film Awards== Winner *2004: GIFA Best Actor Award for Veer-Zaara *2004: GIFA Most Searched Male Actor on Internet Nominated *2006: GIFA Best Actor Award for Kabhi Alvida Naa Kehna ==Apsara Film & Television Producers Guild Awards== Winner *2008: Apsara Best Actor Award for Chak De India *2010: Apsara Best Actor Award for Rab Ne Banaa Di Jodi Nominated *2005: Apsara Best Actor Award for Swades ==Other Awards== *Ten Rupa Cinegoers Awards *Six Sansui Viewers Choice Movie Awards *Two AFJA Awards *One Aashirwad Award *One Disney Kids Channel Award *One MTV Immies Indian Music Excellence Awards *One Sports World movie Award *One Sahara One Sangeet Award - Best Actor Singer “Apun Bola” Josh - 2005SRK Awards Corner *Star's Sabsey Favourite Kaun Awards:* * * * * **2004: Sabsey Favourite actor **2005: Sabsey Favourite actor **2006: Sabsey Favourite actor **2007: Sabsey Favourite actor **2008: Sabsey Favourite actor *2007: HT Café Film Awards Best Actor Award for Chak De India. *Sexiest Man in Asia (Jade Magazine, October 2001) *Sexiest Asian Man (Eastern Eye, October 2007) ==National Honours== *2002 - Rajiv Gandhi Award for Excellence in the Field of Entertainment *2005 - Padma Shri, India's fourth highest civilian award from the Government India ==Other recognitions== In 2004, Time magazine in their third annual special on Asia's heroes selected him along with 19 other Asians as the \"20 Asian Heroes under the age of 40\". In 2005 he appeared on the cover of the Asian edition of National Geographic magazine dated February 2005. This was a rare honour extended by National Geographic since unlike many other magazines celebrities are not their natural choice for a cover image. He is the only Indian to receive UNESCO Pyramide con Marni award for his charity work in 2011. ==References== *Shahrukh Khan's awards and nominations - IMDB *indiaFM.com Category:Lists of awards and nominations Category:Indian actors",
 "title": "List of Shahrukh Khan's awards and nominations"
}