{
 "id": "140811",
 "text": "The Outsiders is a novel by S. E. Hinton, first published in 1967 by Viking Press. Hinton was 15 when she began writing the novel and 17 when it was published. The Outsiders is the life story of fourteen-year-old Ponyboy Michael Curtis. Hinton explores many themes in the story, such as friendship, and coming of age. They are seen by following two rival groups, the Greasers and the Socs (pronounced \"soashes\" by the author, short for Socials), who are separated by status. The book's story is set in Tulsa, Oklahoma. This is never said in the book. The book was made into a movie in 1983. It was also made into a television series in 1990. ==Summary== The Guthery Family was the inspiration for S.E. Hintons novel \"The Outsiders.\" & The Famous American Classic film Directed by Francis Ford Coppola. The author S.E.Hinton.was a famiy friend and neighbor as children in Tulsa, Oklahoma. The characters in the novel were based on Donnie Guthery, Terry Guthery, Bobbie Guthery & S.E Hilton’s cousin James. A wondeful thought provoking book & required reading in schools across the country. \\- Stay Gold- James,Terry, Donnie,and Bobbie, Photos of Donnie & Terry Guthery with S.E. Hinton coming soon. Ponyboy and Johnny ran away to the park, after Ponyboy was late for curfew and Darry hit him. Bob and Randy get drunk and find Ponyboy and Johnny then they try to kill Ponyboy and Johnny. Bob tries to drown ponyboy and then Johnny kills Bob. Ponyboy and Johnny go hide in a church in another town with the help of Dally. While they are at a restaurant with Dally the church catches on fire and Ponyboy and Johnny go inside of the burning church and save the kids who are trapped inside. Johnny breaks his back in the church and goes to the Hospital and dies a few days later. Dally is so sad that Johnny is dead, that he robs a store. He points an unloaded firearm at the police and gets shot and killed by the police, as Ponyboy and the rest of the Greasers watch. Ponyboy chooses to write his homework about the things that happened in the book. == References == Category:American young adult novels Category:1967 books",
 "title": "The Outsiders (novel)"
}