{
 "id": "140957",
 "text": "Mainstream is a term that refers to the common current of thought held by the majority, meaning that \"mainstream\" things are those that are currently popular with most people. What differentiates the term 'mainstream' from the term 'popular' is that, for something to become mainstream, it has to have gained a strong position in its market or field and is not expected to lose that position at any time. This includes: * something that is ordinary or usual; * something that is familiar to most people; * something that is available to the general public; * something that has ties to corporate or commercial entities. Be careful with confusing the word 'mainstream' with the word 'popular' though, and take care not to use it in the wrong context because in modern day, young people usually use the term 'mainstream' to describe popular/popularized products that have been made solely for the purpose of making as much money as possible. These are often products made with, disregard for safety, poor quality, low-density, cheap, fast and in large quantities. The 'mainstream' includes all popular culture but is not the same as popular culture. The term is sometimes used as a negative term. In the United States, Protestant denominations with a mix of conservative, moderate, and liberal theologies are sometimes referred to as 'mainstream.'Caldwell, John (September 2, 2003). \"Faith in school: as mainstream churches continue to wrestle with homosexuality, some religious colleges are taking an increasingly welcoming attitude toward gay students\", The Advocate.Baer, Hans A. (Dec 1988). \"Black Mainstream Churches; Emancipatory or Accommodative Responses to Racism and Social Stratification in American Society?\" Review of Religious Research 30 (2), pp. 162-76. == In movies == Mainstream movies can be defined as, \"movies that catch on with the bigger audience and have been in that position for such a long time that they have become a normality\". So you could argue the term 'mainstream' is irrelevant because it seems to have the same meaning and function as the word 'popular'. In modern day, young people usually use the term 'mainstream' to describe movies that have been made solely for the purpose of making as much money as possible. To pay the cost and make the profit, the movies are made in such a way that most people will want to pay to see them. They have a wide release to first-run theaters. Those are movie theaters that run mostly new movies from the major movie companies. After their time in first-run theaters, the movies are sold at popular stores. Hollywood, Bollywood and Disney movies are usually considered mainstream. An example of the opposite of mainstream movie is art films. == In literature == In literature, 'mainstream' refers to traditional realistic fiction, as opposed to genre fictions such as science fiction or mysteries. == In music == 'Mainstream music' refers to music that is familiar to and popular with the majority of people in their culture. This is called popular music or pop music. In other words, the term 'Mainstream' seems unnecessary and shouldn't be used in a musical context since the term 'Pop Music' already fulfills the same function. But the term 'mainstream music' is, just like with movies, used by the younger generations to refer to a product that is designed and made solely for the purpose of making as much money as possible, as fast as possible, with the least amount of risk possible. An example would be; \"The trend anno 2024 of turning popular games into movies or TV shows\". These movies are not made because some fan of game 'X' loved the game so much they really wanted to make a movie about it. These movies are made because the subject is well known, doesn't need a lot of marketing and was popular as a game so the initial development and production costs can be kept as low as possible....maximizing the profit. An idea designed in an office, by the office, for the office. Or a musical example; \"The trend that has been showing in the music industry since the 1990's\". Hire a few really good songwriters, put them in an office and tell them to just write songs. The company will then sell the songs to one of their artists or use the songs written to 'design and market' a new artist. Like Hillary Duff, Taylor Swift and all the other teen TV stars that have been made famous in music by big companies. There was little risk involved for the companies because the guys and girls where already famous from TV. Opposing pop music is the music of subcultures. These subcultures exist in most genres. Punk rock, for example, has set itself apart from other non-mainstream genres by self-asserting an active anti-mainstream social movement that resists commercialism and corporate control. The punk subculture usually does not appreciate major label bands that play punk music that denies the do it yourself (DIY) punk ethic. Indie rock that surfaced in the early 1990s underground took this same DIY ethic.\"Explore music by Genre: Indie Rock\". allmusic.com. Retrieved on November 11, 2008. ==Mainstream media== This term is often used to describe the 'popular' forms of media, like Newspapers, Radio, TV, News Websites from renowned broadcast companies, billboards and old-school news shouters. The term became used because people started to get their information from social media platforms and found this to be more to their liking. The concern being that the people who started taking their information solely from social media platforms would become brainwashed and isolated because of the algorithm only showing them news they agree with, have affinity with or news that just originated from the same cultural group and is therefore relevant to show to that specific consumer. Assuming that all the 'news' on social media is actually true, checked and/or made by a professional journalist and peer reviewed. (It mostly isn't). The concern stated above is still a widespread debate since a lot of social media newsreaders started to question the professional media companies. Those companies' news as well as their intentions. To voice their discontent the group of 'social media news consumers' coined the term 'mainstream media' to differentiate between the 'real' news (in their eyes the social media news), and the 'fake news' (in their eyes the news published on popular media outlets) like CNN, BBC or Fox for example. In other words, the group that coined the term 'mainstream media' invented it to add more value and weight to the social-media news posts and at the same time devaluate the popularity of all the other forms of media. Hence creating a rift in society that had all sorts of negative short term effects and will probably have a lot of negative long term effects too. On the other side, what is happening is that many anti- corporate and not-for-profit forms of alternative protest have surfaced in the punk underground, for example, self-made publications known as \"zines\", where there is greater freedom to discuss controversial political issues such as bigotry, LGBT community issues, feminism, militant atheism, and veganism. Although most people view this behavior as a youthful expression of rebellion, modern punk embodies a range of age groups who generally disagree with the perceived shared countercultural principals. It is not uncommon for middle- aged people to form punk houses (houses where people of the punk subculture live and open to others to stay, including touring bands) and resistance movements against what they see as the widespread, unfair use of human and animal rights for profit. This modern group is effectively voiced through the anarcho-punk and crust punk subcultures, in attempt to fight what is seen by those groups as a general devaluation of, and way to profit from, life. ==Mainstreaming in education== Mainstreaming refers to a type of education where children with a learning disability are mixed into classes with children without learning disabilities to help them learn better and to become comfortable with the 'mainstream' of student life and life in their community. == References == Category:Culture",
 "title": "Mainstream"
}