{
 "id": "141005",
 "text": "Lapis lazuli is a rock, and a gemstone. It is formed as a metamorphic rock of the limestone type. Lapis is famous for its beautiful blue colour: its name means \"stone of blue\". Lapis Lazuli has been used for many things. Its has been made into beads and used in jewellery since Prehistoric times. It can be carved into statuettes (little sculptures). The major use was as a pigment (colour) in artists' paint. During Medieval and Renaissance times, lapis was ground into powder, and mixed with oil. It was used as the colour for painting the sky, and blue clothes. It can be seen in the fresco paintings of Giotto and the tempera paintings of Fra Angelico. == Sources == Lapis lazuli is a metamorphic rock made from several minerals, but mainly Lazurite. Lazurite has been mined for over 6,000 years in Iran. It is also mined at Lake Baikal in Siberia; at Mount Vesuvius in Italy; in Burma; Canada; and the United States.Eastaugh, Nicholas et al 2004. The pigment compendium : optical microscopy of historical pigments. Oxford: Elsevier Butterworth-Heinemann. p. 219 Iran was the source of lapis for the ancient Egyptian and Mesopotamian civilizations, as well as the Ancient Greeks and Romans. During the height of the Indus Valley civilization about 2000 BC, the Harappan colony now known as Shortugai was established near the lapis mines.Bowersox, Gary W. & Chamberlin, Bonita E. 199. Tucson, AZ: Geoscience Press. In addition to the Persian deposits, lapis has been extracted for many years in the Andes (near Ovalle, Chile), the Lake Baikal region of Russia; Siberia; Angola; Argentina; Burma; Pakistan; Canada; India; and in the USA in California and Colorado. ===Alternatives=== Lapis lazuli is commercially \"synthesized\" (actually simulated) by a chemical process, using artificial ultramarine and hydrous zinc phosphates.Read, Peter 2005. Gemmology, Elsevier, p. 185. There are also various substitutes for lapis.Lapis lazuli , Gemstone Buzz. ==References== * Hurlbut, Cornelius S.; Klein, Cornelis, 1985, Manual of Mineralogy, 20th ed., Wiley, == Other websites == * Mindat with location data * Mineral galleries * Webmineral data Image:Egypte louvre 091 faucon.jpg|This piece of jewellery from ancient Egypt has the head of a ram and the body of a falcon. It has Lapis lazuli set in its wings. Image:Lapis.elephant.800pix.060203.jpg|This statuette carved in Lapis lazuli was possibly made in India. Image:Giotto Crucifixion.jpg|In this fresco by Giotto, the blue background and robe of the Virgin Mary were painted using Lapis lazuli. Category:Gemstones",
 "title": "Lapis lazuli"
}