{
 "id": "141037",
 "text": "Benozzo Gozzoli (4 October 1497) was an Italian Renaissance painter. He is most famous for a small chapel that he decorated with frescos of the Procession of the Magi. == Life == Benozzo was born in Florence in about 1420. Nothing is known about his parents, or how he started training as an artist. The first that is known of him is that in 1444 he was working with the famous sculptor Lorenzo Ghiberti, who was making the bronze doors for the Baptistry of Florence Cathedral. In 1447 he started working with the painter Fra Angelico. He went to Rome with Fra Angelico to help paint the Chapel of Pope Nicholas V in the Vatican. In 1449 he was working in his own studio. == Works == For many years Benozzo worked as an assistant to other artists. At that time, he had to make his style match the style of the master, so it is hard to tell his art works apart. When Benozzo painted on his own, his pictures are rich with many details in the clothing, the buildings and the landscape. He was extremely good at painting faces, and many of the people in his pictures seem to be portraits of real people. * In 1450 he had two important jobs. The first was to paint the Life of St Francis of Assisi in the town of Montefalco. * In Florence, a new palace had been built for Cosimo Medici. Benozzo got the job of decorating the walls with frescos. The paintings are a the Procession of the Magi. \"The Magi\" is a term used for the wise men who, in the Gospel of Matthew, came to visit Jesus as a young child. They are often also called \"The Three Kings\". The Palace is called the Riccardi-Medici Palace. :Benozzo painted a great procession going around the walls of the chapel, with well- known people painted as the Kings, and members of the Medici family and their friends in the procession. The painting is brightly coloured and full all many interesting details. It is his most famous work. *Benozzo also worked in the city of San Gimignano. In the Collegiate Church, where there were already many frescoes, he painted a picture of Saint Sebastian. :At St. Augustine's Church, he painted another picture of Saint Sebastian. Saint Sebastian was the saint who people asked to help when plague was making people in the town sick. :Benozzo then painted one of his most important works, a series of frescos in the \"chancel\" (main chapel) of the church, showing the life of Saint Augustine. There are 17 large pictures, each one telling a scene from the saint's life. == Gallery == Image:Montefalco z03.jpg|The Madonna and Child with St. Francis of Assisi and St. Bernadino Image:Benozzo Gozzoli, lorenzo il magnifico, cappella dei Magi.jpg|One of the Three Kings is Lorenzo Medici Image:Sant'agostino, cappella 2 s.g..jpg|One wall of the chapel showing stories of St. Augustine of Hippo. Image:TolleLege.jpg|St. Augustine studying the Bible ==Related pages== * List of Italian painters == References == * Rosella Vantaggi, San Gimignano, Town of the Fine Towers, Plurigraf (1979) * Diane Davies (editor), Harrap's Illustrated Dictionary of Art and Artists, Harrap (1990). * Ilan Rachum, The Renaissance, and Illustrated Encyclopedia, Octopus (1979). Category:1420 births Category:1498 deaths Category:15th- century Italian painters Category:People from Florence",
 "title": "Benozzo Gozzoli"
}