{
 "id": "141026",
 "text": "Controlled natural languages (CNLs) are artificial languages built by simplifying the grammar and reducing the number of words in the language to avoid ambiguity or complexity. There are two types of controlled languages: some designed to help non-native speakers of a language, and some designed to enable automatic semantic analysis. The first type of languages are often called \"simplified\" or \"technical\" languages. They are used by businesses or industries to improve the quality of technical writing. The standard terms simplify the semi-automatic translation to other languages. Examples are: the ASD Sim Technical English, Caterpillar Technical English, and IBM's Easy English. Simplified (or technical) languages guide the writer by general rules such as \"write short and simple sentences\", \"use the person's name (\"John Smith\" for example) instead of saying \"him\", and \"talk about who is doing something, rather than what is being done, unless you need to say what is being done\". The second type of languages have well defined rules for writing and understanding. These rules can be matched to formal languages, such as first-order logic. The languages can be analysed by computer. They can be checked to see they are correct. They can be searched for information easily. ==Languages== Existing controlled natural languages include: * Globish * Attempto Controlled English * Basic English * ClearTalk * Common Logic Controlled English * E-Prime * Gellish Formal English * ModeLang * Newspeak * Plain English * Processable English (PENG) * Semantics of Business Vocabulary and Business Rules * Special English ==Related pages== * Constructed language * Knowledge representation * Natural language processing ==References== ==Other websites== * Controlled Natural Languages (Macquarie University) * Overview of Controlled English and HyperSTE, customizable Controlled English checker * Simplus – Simplified English Checker * Freelance Translation * acrolinx® Information Quality Suite – Customizable controlled language checker for many authoring environments * PERMIS Policy Editor uses controlled English in its user interface * Akis, Jennifer Wells, and William R. Sisson. (2002) Improving Translatability: A Case Study at Sun Microsystems, Inc. Globalization Insider (Localization Industry Standards Association's e-magazine). * Kohl, John R. (2008) Language Quality-Assurance Software: Optimizing Your Documentation for a Global Audience.Intercom 55.5 (May), pp. 6–9. * Kohl, John R. (2007) Assisted Writing and Editing at SAS. ClientSideNews Magazine 7.8 (August): 7-10. Category:Constructed languages",
 "title": "Controlled language"
}