{
 "id": "141000",
 "text": "Santa Clara is one of the twenty-four barangays composing the municipality of Santa Maria, Bulacan, in the Philippines. It is bordered by Barangay Lalakhan on the southwest, Bagbaguin on the south, Poblacion on the east, Sta. Cruz on the north and Barangay Tambubong in Bocaue on the west. ==Geography== ===Area and Location=== Sta. Clara is the 17th largest barangay in Santa Maria with a land area of 214.70 hectares or 2.1470 km2, slightly smaller than the barangay of Poblacion. Sta. Clara is located on the south-west portion of Sta. Maria and thirty-three kilometers north from Manila. ===Climate=== The prevailing climatic conditions in the barangay are categorized into two types: dry and wet season. The annual mean temperature in the area is 27℃. The warmest month is May with a mean temperature of 29.9℃ while the coldest is January at 25.2℃. The mean annual relative humidity in the Barangay is 77% which is not high. The mean monthly relative humidity is lowest in March at 64% and highest in September at 84% ===Demographics=== As of 2022 census, Sta. Clara has a population of 14,535 people with a density of 4,682 person per km2. The projected population of the barangay by 2010 is 11,080 with a growth rate of 3.3% ===Population Projection=== This is the projected population of the barangay by the next few years: * 2008 - 10,384 * 2009 - 10,726 * 2010 - 11,080 * 2011 - 11,446 * 2012 - 11,824 * 2013 - 12,214 * 2014 - 12,617 * 2015 - 13,033 * 2020 - 15,330 * 2030 - 21,210 ==Barangay officials== * Danilo \"Anyeng\" Perez, Barangay Captain ;Members of the Sangguniang Barangay: * Orlando R. Salvador * Danilo C. Barcial * Manolito DR. Loreto * Reynaldo C. Sioson * Reynan C. Castillo * Juanito J. Lopez * Roberto A. Domingo * SK Juan Carlo C. Cruz * Sec. Abegail Marie SM. Del Rosario * Treas. Monina A. Babaan ===Vision Mission=== VISION: A self-reliant, industrialized, commercialized, environment friendly barangay, accessible roads, discipline and morally upright citizenhood and a place where you can say \"I BELONG\" MISSION: \"Discipline and Determination\" by discharging responsible services to the needs of people and continuing communication. ===Health Care=== Barangay Sta. Clara is a sub-center of RHU-I. This center serves the total population of 10,052 of the barangay. The Health Center is open daily except on Weekends. It is currently headed by Ms. Catalina C. Policarpio. ===Schools=== * Sta. Clara Elementary school * Global Seed Academy * Joseph Arimathea School * Estrella Academy of Sta. Clara Inc. ==Transportation and Communication== ===Transportation=== Public vehicles such as buses, jeepneys, and tricycles are the means of transportation in the barangay. Tricycles are available for 24 hours. ===Main roads=== * Narra St./J.P Rizal St. * Sta. Clara By-Pass Road * Tindalo St. * Yakal St./Luwasan ==Other websites== * Official Website of Barangay Sta. Clara SMB * Official Website of Santa Maria, Bulacan * NSCB Sta. Maria, Bulacan Category:Barangays Category:Bulacan",
 "title": "Barangay Santa Clara, Santa Maria, Bulacan"
}