{
 "id": "141239",
 "text": "{{Infobox settlement | official_name = Manchester | native_name = | nickname = \"Cottonopolis\", \"Warehouse City\", \"Madchester\", \"The Rainy City\" | settlement_type = City and metropolitan borough | motto = \"Concilio Et Labore\" \"By wisdom and effort\" | image_skyline = Manchester_Montage_2017.jpg | imagesize = 270px | image_caption = Clockwise from top: Skyline of Manchester City Centre, Beetham Tower, Manchester Civil Justice Centre, Midland Hotel, One Angel Square, Manchester Town Hall | image_flag = | flag_size = | image_seal = | seal_size = | image_shield = Arms of the City of Manchester.svg | shield_link = Symbols of Manchester | shield_size = | image_blank_emblem = | blank_emblem_type = | blank_emblem_size = | blank_emblem_link = | image_map = Manchester UK locator map.svg | mapsize = | pushpin_map = North West England#United Kingdom#Europe | pushpin_map_caption = Location of Manchester within the United Kingdom | map_caption = Manchester shown within Greater Manchester | mapsize1 = | map_caption1 = | image_dot_map = | subdivision_type = Sovereign state | subdivision_name = United Kingdom | subdivision_type1 = Constituent country | subdivision_name1 = England | subdivision_type2 = Region | subdivision_name2 = North West England | subdivision_type3 = City region | subdivision_name3 = Manchester | subdivision_type4 = Ceremonial county | subdivision_name4 = Greater Manchester | subdivision_type5 = Historic county | subdivision_name5 = Salford Hundred, Lancashire (north of River Mersey) Cheshire (south of River Mersey) | government_footnotes = | governing_body = Manchester City Council | government_type = Metropolitan borough | leader_title = Leadership | leader_name = Leader and Cabinet | leader_title1 = Executive | leader_name1 = | leader_title2 = Leader | leader_name2 = Sir Richard Leese | leader_title3 = Lord Mayor | leader_name3 = June Hitchen | leader_title4 = Chief Executive | leader_name4 = Joanne Roney | established_title = Founded | established_date = 1st century | established_title2 = Town charter | established_date2 = 1301 | established_title3 = City status | established_date3 = 29 March 1853 | seat_type = Administrative HQ | seat = Manchester (Town Hall) | area_magnitude = | unit_pref = | total_type = City | area_footnotes = | area_total_km2 = | area_rank = | area_land_km2 = | area_water_km2 = | area_total_sq_mi = | area_land_sq_mi = | area_water_sq_mi = | area_water_percent = | area_urban_km2 = 630.3 | area_urban_sq_mi = | area_metro_km2 = | area_metro_sq_mi = | area_blank1_title = | area_blank1_km2 = | area_blank1_sq_mi = | population_as_of = | population_total = | population_footnotes = | population_rank = | population_blank1_title = | population_blank1 = | population_density_km2 = | population_blank2_title = Ethnicity | population_blank2 = White groups (66.7% ) Asian (14.4%) Black (8.6%) Mixed (4.7%) Chinese (2.7%) Arab (1.9%) Other (1.2%) | population_density_sq_mi = | population_urban = 2,553,379 (2nd) | population_density_urban_km2 = 4051 | population_density_urban_sq_mi = | population_metro = 2,856,000 (List of metropolitan areas in Europe) | population_density_metro_km2 = | population_density_metro_sq_mi = | population_demonym = Mancunian Manc (colloq.) | timezone = Greenwich Mean Time | utc_offset = +0 | timezone_DST = British Summer Time | utc_offset_DST = +1 | coordinates = | elevation_footnotes = | elevation_m = 38 | elevation_ft = | blank_name_sec1 = GSS code | blank_info_sec1 = E08000003 | blank1_name_sec1 = NUTS 3 code | blank1_info_sec1 = UKD33 | blank2_name_sec1 = OS grid reference | blank2_info_sec1 = | blank3_name_sec1 = Motorways | blank3_info_sec1 = M56 M60 A57(M) A635(M) | blank4_name_sec1 = Trunk primary routes | blank4_info_sec1 = A5103 | blank5_name_sec1 = Major railway stations | blank5_info_sec1 = Manchester Airport (B) Manchester Oxford Road (C1) Manchester Piccadilly (A) Manchester Victoria (B) | blank6_name_sec1 = Tramways | blank6_info_sec1 = Metrolink | blank7_name_sec1 = International airports | blank7_info_sec1 = Manchester (MAN) | postal_code_type = Postcode areas | postal_code = M | area_code_type = Dialling code | area_code = 0161 | iso_code = GB-MAN | blank_name_sec2 = GDP | blank_info_sec2 = US$ 95.3 billion | blank1_name_sec2 = – Per capita | blank1_info_sec2 = US$ 38,233 | blank2_name_sec2 = MPs | blank2_info_sec2 = Graham Stringer (L) Lucy Powell (L) Afzal Khan (L) Jeff Smith (L) Mike Kane (L) | blank3_name_sec2 = Councillors | blank3_info_sec2 = 96 | blank4_name_sec2 = European Parliament | blank4_info_sec2 = North West England | blank5_name_sec2 = Police area | blank5_info_sec2 = Greater Manchester | blank6_name_sec2 = Fire service | blank6_info_sec2 = Greater Manchester | blank7_name_sec2 = Ambulance service | blank7_info_sec2 = North West | website = www.manchester.gov.uk | footnotes = }} Manchester is a city in North West England. In 2013 there were 514,417 people living there, which makes it the fifth largest city in the United Kingdom. By the 2021 Census there were 551,938 - the population went up by 0.96% a year. 173,189 were not born in the United Kingdom. It is a city and metropolitan borough of Greater Manchester, England. Manchester was given city status in 1853. The city is in the middle of the Greater Manchester Urban Area, which has 2,240,230 people, and is the United Kingdom's third largest built-up place. Manchester is a very important city in England, and is often called the \"Capital of the North\". • • Manchester has many places for the arts, places for learning, businesses providing media as well as lots of shops. In a poll of British managers in 2006, Manchester was named the best place in Britain to have a business. A report in 2007 said Manchester is a fast-growing city (meaning lots of jobs are being created). Manchester was the host of the 2002 Commonwealth Games. It has two well-known football teams, Manchester United and Manchester City.Note: Manchester United's ground is in Greater Manchester but outside Manchester city limits; it is in the borough of Trafford In 2023 Greater Manchester Police conducted an operation in the Cheetham Hill district near Strangeways Prison where there had long been a lot of criminal activity. Operation Vulcan shut down 100 shops in Manchester. 580 tonnes of items, including clothes, drugs and illicit tobacco, were confiscated from 207 shipping containers. They said this was the largest ever seizure of counterfeit goods in the UK. The city councils of Manchester and Salford are proposing a substantial redevelopment of the area. They would like to move the prison out of Strangeways. == Geography == Manchester is northwest of England's capital, London. The city has many canals and rivers which were important to its growth, especially in the 18th and 19th centuries. The largest open space in the city is Heaton Park. It has an area of about . Heaton Park is a place that attracts many people every year. People go there to see the many animals and the beauty of the countryside. Much of Manchester is built-up (or 'urbanised'). Much of Manchester's rain comes over from the Pennines, which are hills to the east of the city. The city is mainly urban areas but also has some areas which are mainly of farmland. To the south of the centre is Manchester Airport. This is the third largest airport in the United Kingdom. == In popular culture== A revival of the city's importance started in the 1980s. This was partly led by a vibrant music scene whose spirit was called 'Madchester'. It was led by bands such as The Happy Mondays and Joy Division. Indie band The Smiths also came from Manchester. The scene was partly fuelled by the number of students attending the universities and further education colleges in the city. Manchester has the most students in the United Kingdom in term time. The University of Manchester is the largest university in the UK. It has over 30,000 students. The city also has the UK's fourth largest university, the Manchester Metropolitan University. The city has two Premier League football teams, Manchester United and Manchester City. Football is a very important part of the culture of the city. Many of the people support or show interest in the sport. == Transport == Manchester and North West England are served by Manchester Airport. The airport has the most passengers in the UK outside London, with 22.1 million passengers in 2007. Planes fly to lots of destinations in Europe, North America, the Caribbean, Africa, the Middle East and Asia (with more destinations from Manchester than from London Heathrow). Manchester is very well served by train and in terms of passengers, Manchester Piccadilly was the busiest English train station outside London in 2005 and 2006. Northern Rail operates all over the north of England, and other operators include Virgin Trains. The Liverpool and Manchester Railway was the first passenger railway in the world. Greater Manchester has a very big railway network. The city centre has over a lot of park and ride sites. Manchester became the first city in the UK to get a new tram system when the Manchester Metrolink opened in 1992. There are lots of new lines being built. The city has one of the biggest bus networks outside London with over 50 bus companies operating in the Greater Manchester area around the city. First Manchester and Stagecoach Manchester are the main bus operators. First Manchester also operates three free bus services called Metroshuttle which carry workers around Manchester's business areas. The Rochdale Canal, the Ashton Canal and the Bridgewater Canal meet in Manchester. Today they are mainly used for leisure. The Manchester Ship Canal is open, but not many boats use it. • == Buildings == Manchester's buildings display many different types of building styles, from Victorian to contemporary architecture. The very common use of red bricks characterises the look of the city. Much Manchester's architecture dates back to its days as a global centre for the trade of cotton. Just outside the city centre is a large number of former cotton mills, some of which have been left mostly untouched since they were closed, while many others have been turned into apartment buildings and office spaces.Manchester Town Hall, in Albert Square, was built in the gothic revival style and is thought of by many to be one of the most important Victorian buildings in all of England.Robinson (1986), The Architecture of Northern England, p. 153 == Education == There are two universities in the city of Manchester. The University of Manchester, created in 2004 when Victoria University of Manchester and UMIST were combined, is the largest full-time non-collegiate university in the United Kingdom. The Manchester Business School, at the University of Manchester, was the first school to offer an MBA course in the United Kingdom in 1965. Manchester Metropolitan University was created as Manchester Polytechnic on the merger of three colleges in 1970. It was given university status in 1992, and in the same year, combined with Crewe and Alsager College of Higher Education, in South Cheshire. == Health == There are big differences in the health of people between the richer areas and the poorer parts of the city, A man from the richest area can expect to live eight years longer. == Twin cities == Manchester has twinning plans (or \"friendship agreements\") with lots of places. In addition, the British Council has a \"metropolitan centre\" in Manchester. Although not an official twin city, Tampere, Finland is known as \"the Manchester of Finland\" – or \"Manse\" for short. Also, Ahmedabad, India became the centre of a booming textile industry, and it got the nickname \"the Manchester of the East.\" Country Place County / District / Region / State Date Nicaragua Bilwi Puerto Cabezas n/a Germany ChemnitzAt the time of the twinning agreement, the city was in the German Democratic Republic and named Karl-Marx-Stadt. See Saxony 1983 Spain Córdoba Córdoba n/a Israel Rehovot Center District n/a Russia Saint Petersburg Northwestern Federal District 1962 China Wuhan Hubei 1986 Pakistan Faisalabad Punjab 1997 == References == == Further reading == * General ** ** ** ** ** ** * Culture ** ** ** ** ** ** == Other websites == * * * * * * Category:1st- century establishments in Europe Category:Establishments in England",
 "title": "Manchester"
}