{
 "id": "141442",
 "text": "Pahari-Pothwari is a dialect of Punjabi of Lahnda group, spoken on the Pothohar Plateau in the far north of Punjab, Pakistan, as well as in most of Pakistan-administered Azad Kashmir and in western border areas of Indian- occupied Jammu and Kashmir, is known by a variety of names, the most common of which are Pahari (; an ambiguous name also applied to other unrelated languages of India), and Pothwari/Pothohari. The language is transitional between Hindko and Majhi and is mutually intelligible with both. There have been efforts at cultivation as a literary language, although a local standard has not been established yet. The Shahmukhi script is used to write the language, such as in the works of Punjabi poet Mian Muhammad Bakhsh. Grierson in his early 20th-century Linguistic Survey of India assigned it to a so- called \"Northern cluster\" of Lahnda (Western Punjabi), but this classification, as well as the validity of the Lahnda grouping in this case, have been called into question. In a sense both Pothwari, as well as other Lahnda varieties, and Standard Punjabi are \"dialects\" of a \"Greater Punjabi\" macrolanguage. Due to effects of dominant languages in Pakistani media like Standard Punjabi and English and religious impact of Arabic and Persian, Pahari-Pothwari like other regional varieties of Pakistan are continuously expanding its vocabulary base with loan words. ==Places== Within Pakistan, it is spoken in the Pothohar Plateau and Azad Kashmir and overlaps between these two regions.Javaid, Umbreen. 2004. Saraiki political movement: its impact in south Punjab. Journal of Research (Humanities), 40(2): 55–65. Lahore: Faculty of Arts and Humanities, University of the Punjab. (This PDF contains multiple articles from the same issue.) ==Numbers== The numbering in Pahari-Pothwari is similar to that of other Punjabi dialects and varieties. Pahari-Pothwari uses trai for three, which is also found in some forms of Majhi and Hindko.Rahman, Tariq. 1997. Language and Ethnicity in Pakistan. Asian Survey, 1997 Sep., 37(9):833-839. # ikk # do # trai # chār # panj # chae # satt # att # nou # das == Notes == ==References== Category:Languages of Azad Jammu and Kashmir Category:Languages of Punjab (Pakistan) Category:Languages of Jammu and Kashmir Category:Languages of India Category:Indo-Aryan languages",
 "title": "Pahari-Pothwari"
}