{
 "id": "141533",
 "text": "Tina Turner (born Anna Mae Bullock; November 26, 1939 - May 24, 2023) was an American-born Swiss singer-songwriter, actress, dancer and entertainer. Her success, dominance, popularity and consistent contributions to the rock music genre got her the title, \"The Queen of Rock & Roll\". She is known worldwide for her overpowering and energetic stage presence, powerful vocals, ground- breaking concertshttp://tinaturner-fanclub.com/ Tina Turner International fanclub: Biography as well as for her long, well-proportioned legs that are considered the most famous in show business. == Music career == She retired from singing in 2009 after completing her \"Tina: 50th Anniversary Tour\". ==Personal life== Turner lived in a lake house Château Algonquin in Küsnacht, near to Zürich, since 1994. She was a Buddhist.Nichiren Buddhism In April 2013, Turner became a Swiss citizen and renounced her American citizenship. In 2013, three weeks after her wedding to Erwin Bach, she suffered a stroke and had to learn to walk again. In 2016, she was diagnosed with intestinal cancer. Turner used homeopathic remedies to treat her high blood pressure but caused kidney failure. Her chances of receiving a kidney were low, and she was urged to start dialysis. Turner wanted to commit assisted suicide, but her husband donated his kidney in April 2017. ==Death and legacy== Turner died on May 24, 2023 at the age of 83 at her home in Küsnacht, Switzerland after a long illness. She was listed on Rolling Stone's list The Immortals – The Greatest Artists of All Time. Turner is a Rock and Roll Hall of Fame inductee, and she is also represented in the Grammy Hall of Fame by two of her recordings: \"River Deep - Mountain High\" (1999) and \"Proud Mary\" (2003). Turner won eight Grammy Awards.https://www.grammy.com/grammys/artists/tina-turner == References == Category:1939 births Category:2023 deaths Category:Actors from Tennessee Category:African-American actors Category:African-American singers Category:Organ transplant recipients Category:American Buddhists Category:American movie actors Category:American pop singers Category:American R&B; singers Category:American rock singers Category:American dancers Category:American singer-songwriters Category:American autobiographers Category:American soul musicians Category:Swiss movie actors Category:Swiss singer-songwriters Category:Swiss musicians Category:Grammy Award winners Category:Singers from Tennessee Category:Writers from Tennessee Category:Musicians from Tennessee Category:Singers from Missouri Category:Musicians from Missouri Category:Writers from Missouri Category:Actors from Missouri Category:People who lost citizenship",
 "title": "Tina Turner"
}