{
 "id": "141570",
 "text": "The Grammy Award for Best Song Written for Visual Media has been awarded since 1988 for the best songs written for movies, television, video games and other visual media. The award name has been through several name changes over the years: * 1988 to 1999: Grammy Award for Best Song Written Specifically for a Motion Picture or Television * 2000 to 2011: Grammy Award for Best Song Written for a Motion Picture, Television or Other Visual Media * 2012 to present: Grammy Award for Best Song Written for Visual Media Years reflect the year in which the Grammy Awards were presented, for works released in the previous year. The award is presented to the songwriter(s). == 1980s == Year Recipient(s) Work (Performer(s) in brackets) Nominees (Performer(s) in brackets) Ref. 1988 James Horner, Barry Mann & Cynthia Weil \"Somewhere Out There\" from An American Tail (Linda Ronstadt & James Ingram) 1989 Phil Collins and Lamont Dozier \"Two Hearts\" (from Buster) (Phil Collins) == 1990s == Year Recipient(s) Work (Performer(s) in brackets) Nominees (Performer(s) in brackets) Ref. 1990 Carly Simon \"Let the River Run\" from Working Girl 1991 Alan Menken & Howard Ashman \"Under the Sea\" from The Little Mermaid (Various artists) 1992 Robert John \"Mutt\" Lange, Michael Kamen & Bryan Adams \"(Everything I Do) I Do It for You\" from Robin Hood: Prince of Thieves (Bryan Adams) 1993 Howard Ashman & Alan Menken \"Beauty and the Beast\" from Beauty and the Beast (Celine Dion & Peabo Bryson) 1994 Alan Menken & Tim Rice \"A Whole New World\" from Aladdin (Peabo Bryson & Regina Belle) 1995 Bruce Springsteen \"Streets of Philadelphia\" from Philadelphia (Bruce Springsteen) 1996 Alan Menken & Stephen Schwartz \"Colors of the Wind\" from Pocahontas (Vanessa Williams and Judy Kuhn) 1997 Diane Warren \"Because You Loved Me\" from Up Close & Personal (Celine Dion) 1998 R. Kelly \"I Believe I Can Fly\" from Space Jam (R. Kelly) 1999 James Horner & Will Jennings \"My Heart Will Go On\" from Titanic (Celine Dion) == 2000s == Year Recipient(s) Work (Performer(s) in brackets) Nominees (Performer(s) in brackets) Ref. 2000 Madonna & William Orbit \"Beautiful Stranger\" from Austin Powers: The Spy Who Shagged Me (Madonna) 2001 Randy Newman \"When She Loved Me\" from Toy Story 2 (Sarah McLachlan) 2002 John Flansburgh & John Linnell \"Boss of Me\" from Malcolm in the Middle (They Might Be Giants) 2003 Randy Newman \"If I Didn't Have You\" from Monsters, Inc. (Randy Newman) 2004 Christopher Guest, Eugene Levy & Michael McKean \"A Mighty Wind\" from A Mighty Wind (The Folksmen, Mitch & Mickey, and The New Main Street Singers) 2005 Annie Lennox, Howard Shore & Fran Walsh \"Into the West\" from The Lord of the Rings: The Return of the King (Annie Lennox) 2006 Glen Ballard & Alan Silvestri \"Believe\" from The Polar Express (Josh Groban) 2007 Randy Newman \"Our Town\" from Cars (James Taylor) 2008 Siedah Garrett & Henry Krieger \"Love You I Do\" from Dreamgirls (Jennifer Hudson) 2009 Peter Gabriel & Thomas Newman \"Down to Earth\" from WALL-E (Peter Gabriel) == 2010s == Year Recipient(s) Work (Performer(s) in brackets) Nominees (Performer(s) in brackets) Ref 2010 Gulzar, A. R. Rahman & Tanvi Shah \"Jai Ho\" from Slumdog Millionaire (A.R. Rahman, Sukhvinder Singh, Tanvi Shah, Mahalaxmi Iyer & Vijay Prakash) 2011 Ryan Bingham & T Bone Burnett \"The Weary Kind\" from Crazy Heart (Ryan Bingham) 2012 Alan Menken & Glenn Slater \"I See the Light\" from Tangled (Mandy Moore and Zachary Levi) 2013 T Bone Burnett, Taylor Swift, Joy Williams & John Paul White \"Safe & Sound\" from The Hunger Games (Taylor Swift featuring The Civil Wars) 2014 Adele Adkins & Paul Epworth \"Skyfall\" from Skyfall (Adele) 2015 Kristen Anderson-Lopez & Robert Lopez \"Let It Go\" from Frozen (Idina Menzel) 2016 Common, Che Smith & John Legend \"Glory\" from Selma (Common and John Legend) 2017 Max Martin, Shellback & Justin Timberlake \"Can't Stop the Feeling!\" from Trolls (Justin Timberlake, Anna Kendrick, Gwen Stefani, James Corden, Zooey Deschanel, Walt Dohrn, Ron Funches, Caroline Hjelt, Aino Jawo, Christopher Mintz-Plasse & Kunal Nayyar) 2018 Lin-Manuel Miranda \"How Far I'll Go\" from Moana (Auli'i Cravalho) 2019 Lady Gaga, Mark Ronson, Anthony Rossomando & Andrew Wyatt \"Shallow\" from A Star Is Born (Lady Gaga and Bradley Cooper) ==2020s== Year Recipient(s) Work (Performer(s) in brackets) Nominees (Performer(s) in brackets) Ref. 2020 Lady Gaga, Natalie Hemby, Hillary Lindsey & Aaron Raitiere \"I'll Never Love Again\" from A Star Is Born (Lady Gaga and Bradley Cooper) 2021 Billie Eilish O'Connell & Finneas O'Connell \"No Time to Die\" from No Time to Die (Billie Eilish) 2022 Bo Burnham \"All Eyes on Me\" from Bo Burnham: Inside (Bo Burnham) 2023 Lin-Manuel Miranda \"We Don't Talk About Bruno\" from Encanto (Carolina Gaitán, Mauro Castillo, Adassa, Rhenzy Feliz, Diane Guerrero, Stephanie Beatriz and Encanto Cast) 2024 Billie Eilish O'Connell & Finneas O'Connell \"What Was I Made For?\" from Barbie (Billie Eilish) 2025 Jon Batiste & Dan Wilson \"It Never Went Away\" from American Symphony (Jon Batiste) ==References== Song Written for a Motion Picture, Television or Other Visual Media",
 "title": "Grammy Award for Best Song Written for Visual Media"
}