{
 "id": "141679",
 "text": "The term Mother of the Nation refers to a female leader or female politician who led her country to independence or had a big, positive influence on her country, and who is highly honored by her country. ==List== The following women are still often called the \"Mother\" of their respective nations. Name Nation Title (native) Title (translation) Notes Vida Jane Mary Goldstein N/A Mother of the Nation She was one of four female candidates at the 1903 federal election, the first at which women were eligible to stand. Goldstein followed her mother into the women's suffrage movement and soon became one of its leaders, becoming known both for her public speaking and as an editor of pro-suffrage publications. Despite her efforts, Victoria was the last Australian state to implement equal voting rights, with women did not grant the right to vote until 1908. After women's suffrage was achieved, Goldstein remained prominent as a campaigner for women's rights and various other social reforms. She was an ardent pacifist during World War I; and helped found the Women's Peace Army, an anti-war organisation. Sheikh Fazilatunnesa Mujib Jatira Maa () Mother of the Nation Wife of the Founder of Bangladesh, and current Mother of the Prime Minister of Bangladesh. Adelaide Hoodless N/A Mother of the Nation A Canadian educational reformer and administrator who founded the international women's organization known as the Women's Institute. She is also credited with National Council of Women of Canada. Sarojini Naidu (Nightingale of India) In most Indian languages: ISAT:Rāśhțramatā Devanagari:राष्ट्रमाता Mother of the Nation This title was not an official title and has no records in the National Archives of India. Indian constitution (Art. 18) prohibits the State from conferring any titles. Dame Whina Cooper Te Whaea o te Motu Mother of the Nation She was elected first president of the new Maori Women's Welfare League. Miss. Fatima Jinnah Mādar-e Millat () & Khātūn-e Pākistān (Urdu: — \"Lady of Pakistan\") () Mother of the Nation/Leader of Pakistani Women Rights Stateswoman and Sister of the founder of Pakistan, leading member of the Muslim League and Campaigned for first Presidential elections of Pakistan in 1964, with the support of Jamaat- e-Islami Pakistan. Winnie Madikizela-Mandela Moeder van die nasie Mother of the Nation Late Wife of First President of post-apartheid South Africa, A member of the (ANC) political party, she served on the ANC's National Executive Committee and headed its Women's League. Queen Elizabeth The Queen Mother Queen Anne I the Unifier Late Mother of War Time Mother of the Nation, The Queen Mother First native Queen Elizabeth of Consort since the Tudor Times. (Treaty of Union) It was Anne I who finally achieved the Unification of England and Scotland in 1707 – something England had been chasing for centuries. Anne led England’s fight in the War of Spanish Succession, which lasted her entire reign. This 1706 – The Treaty of Union leads to the creation of Great Britain and a political unity between England, Wales and Scotland, which eventually led to the Sovereign state of the United Kingdom of Great Britain and Northern Ireland as an political entity power house (TOGETHER UNDER A SINGLE PARLIAMENT OF GREAT BRITAIN). There can be no doubting she was a Dutiful Loyal Queen, regularly attending Cabinet and Privy council meetings and being the last British monarch to Veto an Act of Parliament. Abigail Smith Adams First Lady Mother of the Nation. She is famous for her early advocacy of several divisive causes, including women’s rights, female education and the Abolition of slavery. == Related pages == * Father of the Nation ==References== Category:Nationalism Category:Women",
 "title": "Mother of the Nation"
}