{
 "id": "14175",
 "text": "The Hebrew language, also referred to as the Hebraic language, is a Northwest Semitic language. Hebrew was spoken by Israelites a long time ago, during the time of the Bible. After Judah was conquered by Babylonia, the Jews were taken captive (prisoner) to Babylon and started speaking Aramaic. Hebrew was no longer used much in daily life, but it was still known by Jews who studied halakha. In the 20th century, many Jews decided to make Hebrew into a spoken language again. It became the language of the new country of Israel in 1948. People in Israel came from many places and decided to learn Hebrew, the language of their common ancestors, so that they could all speak one language. Modern Hebrew is a bit different than biblical Hebrew, with some loanwords from different languages, mainly aramic. Modern Hebrew speakers can read the bible As of 2021, Hebrew has been the only dead language that had been made into a living language again. The Hebrew Bible was originally written in Biblical Hebrew. == Grammar == Hebrew is a Semitic language, like Arabic, a similar language. Hebrew words are made by combining a root with a pattern. In Israeli Hebrew, some words are translated from European languages like English, French, German, and Russian. Many words from the Old Testament were given new meanings in Israeli Hebrew. People learning Hebrew need to study the grammar first so that they can read correctly without vowels. In Israeli Hebrew, there is no verb \"to be\" in the present tense only in the future and the past tenses. In Biblical Hebrew, there are no tenses but only two aspects: imperfect and perfect. The imperfect is something like the future and the present tenses. The perfect is something like the past tense. Mishnaic Hebrew was spoken as well as Judeo-Aramaic at the time of Jesus and at the time of the Bar-Kokhba revolt (2nd century AD) until the Byzantine Empire of Justinian (6th century AD). The Hebrew alphabet has been adapted to write Yiddish, another Jewish language. However, Yiddish is different from Hebrew because Yiddish comes from a mix of German, Hebrew, and other languages. == Alphabet == The alphabet, also known as the Hebrew abjad, has 22 letters. Five of them change when they are at the end of a word. Hebrew is read and written from right to left. The first three letters, aleph, beth and gimel, are also used in mathematics in the context of transfinite numbers. The Hebrew alphabet is an abjad and so only the consonants are written, and readers must supply the vowels. Since that can be difficult, the vowels can be marked as dots called niqqud. In Modern Hebrew, some letters can denote vowels, which are called matres lectionis (mothers of the reading) since they greatly help reading. Vav can make the 'oo' sound (/u/ in IPA) like in food. Yod can make the 'ee' sound (/i/ in IPA) like in feed. Aleph Bet Gimel Dalet He Vav Zayin Het Tet Yod Kaph א ב ג ד ה ו ז ח ט י כ ך Lamed Mem Nun Samekh Ayin Pe Tsadi Qoph Resh Shin Tav ל מ נ ס ע פ צ ק ר ש ת ם ן ף ץ ==Notes== == Related pages == * Phoenician alphabet ==References==",
 "title": "Hebrew language"
}