{
 "id": "141778",
 "text": "Cloud computing is when computing services are provided by a company or place outside of where they are being used. It is like the way in which electricity is sent to users: they simply use the electricity that is sent to them and do not need to worry where the electricity is from or how it is made and brought to them. Every month, they pay only for what they use and nothing more. The idea behind cloud computing is similar: The user can simply use storage, computing power, or development environments, without having to worry how they work behind the scenes. The cloud is a metaphor for the Internet based on how it is described in computer network diagrams. Just as how in the real world, clouds hide parts of the sky from sight, the cloud in computing hides the complex infrastructure that makes the Internet work. It is a type of computing in which IT-related actions are provided “as a service”, allowing users to access these services through the Internet (\"in the cloud\"). They do not have to know or control the technologies behind them, preventing them from running into ethical and legal problems. According to the IEEE, cloud computing is a concept where information is placed on servers and sent over the Internet to other devices, such as computers, laptops, handhelds, and sensors.ORGs for Scalable, Robust, Privacy-Friendly Client Cloud Computing It includes the idea of having software as a service (SaaS), such as Web 2.0, that depend on the Internet to meet the needs of their users. For example, Google has made several office suite apps which are accessed from a web browser. Unlike other software that does the same tasks, including Microsoft Office, the software and data are stored on Google's servers, not on the machine in which they are used. == Brief == === Comparisons === Cloud computing is often confused with other ideas: * grid computing: a form of distributed computing whereby a \"super and virtual computer\" is composed of a cluster of networked, loosely- coupled computers, working together to perform very large tasks * utility computing: the packaging of computing resources, such as computation and storage are provided as a measured service that have to be paid similar to a traditional public utility such as electricity * autonomic computing: computer systems capable of self-management. Cloud computing often uses grid computing, has autonomic characteristics and is billed like utilities, but cloud computing can be seen as a natural next step from the grid-utility model.I.B.M. to Push ‘Cloud Computing,’ Using Data From Afar Some successful cloud architectures have little or no centralised infrastructure or billing systems including peer-to-peer networks like BitTorrent and Skype.ACM Ubiquity: Emergence of The Academic Computing Cloud === Architecture === The majority of cloud computing infrastructure currently consists of reliable services delivered through data centers that are built on computer and storage virtualization technologies. The services are accessible anywhere in the world, with The Cloud appearing as a single point of access for all the computing needs of consumers. Commercial offerings need to meet the quality of service requirements of customers and typically offer service level agreements. Open standards and open source software are also critical to the growth of cloud computing. === Characteristics === As customers generally do not own the infrastructure or know all details about it, mainly they are accessing or renting, so they can consume resources as a service, and may be paying for what they do not need, instead of what they actually do need to use. Many cloud computing providers use the utility computing model which is analogous to how traditional public utilities like electricity are consumed, while others are billed on a subscription basis. By sharing consumable and \"intangible\" computing power between multiple \"tenants\", utilization rates can be improved (as servers are not left idle) which can reduce costs significantly while increasing the speed of application development. A side effect of this approach is that \"computer capacity rises dramatically\" as customers do not have to engineer for peak loads. Adoption has been enabled by \"increased high-speed bandwidth\" which makes it possible to receive the same response times from centralized infrastructure at other sites. === Providers === Cloud computing is being driven by providers including Google, Amazon.com, and Yahoo! as well as traditional vendors including IBM, Intel,With Their Heads in the Clouds Microsoft,Microsoft Fueling Cloud Computing Initiatives HP and SAP. It can adopted by all kinds of users, be they individuals or large enterprises. Most internet users are currently using cloud services, even if they do not realize it. Webmail for example is a cloud service, as are Facebook and Wikipedia and contact list synchronization and online data backups. == History == The Cloud is a metaphor for the Internet,What cloud computing really means or more generally components and services which are managed by others. The underlying concept dates back to 1960 when John McCarthy expressed his opinion that \"computation may someday be organized as a public utility\" and the term Cloud was already in commercial use in the early 1990s to refer to large ATM networks. By the turn of the 21st century, cloud computing solutions had started to appear on the market,Internet Critic Takes on Microsoft though most of the focus at this time was on Software as a service. Amazon.com played a key role in the development of cloud computing when upgrading their data centers after the dot-com bubble and providing access to their systems by way of Amazon Web Services in 2002 on a utility computing basis. They found the new cloud architecture resulted in significant internal efficiency improvements 2007 observed increased activity, including Google, IBM and a number of universities starting large scale cloud computing research project,Google and I.B.M. Join in ‘Cloud Computing’ Research around the time the term started gaining popularity in the mainstream press. It was a hot topic by mid-2008 and numerous cloud computing events had been scheduled. In August 2008 Gartner observed that \"organizations are switching from company-owned hardware and software assets to per-use service-based models\" and that the \"projected shift to cloud computing will result in dramatic growth in IT products in some areas and in significant reductions in other areas\". == Political issues == Clouds cross many country borders and \"may be the ultimate form of globalisation\".Computers without borders As such it is the subject of complex geopolitical issues, whereby providers must satisfy many legal restrictions in order to deliver service to a global market. This dates back to the early days of the Internet, where libertarian thinkers felt that \"cyberspace was a distinct place calling for laws and legal institutions of its own\"; author Neal Stephenson envisaged this as a tiny island data haven in his science-fiction classic novel Cryptonomicon. Although there have been efforts to match the legal environment (such as US-EU Safe Harbor), providers like Amazon Web Services usually deal with international markets (typically the United States and European Union) by deploying local infrastructure and allowing customers to select their countries. However, there are still concerns about security and privacy for individual through various governmental levels, (for example the USA PATRIOT Act and use of national security letters and title II of the Electronic Communications Privacy Act, the Stored Communications Act). == Legal issues == In March 2007, Dell applied to trademark the term '\"cloud computing\" in the United States. It received a \"Notice of Allowance\" in July 2008 which was subsequently canceled on August 6, resulting in a formal rejection of the trademark application in less than a week later. In November 2007, the Free Software Foundation released the Affero General Public License (abbreviated as Affero GPL and AGPL), a version of GPLv3 designed to close a perceived legal loophole associated with Free software designed to be run over a network, particularly software as a service. According to the AGPL license application service providers are required to release any changes they make to an AGPL open source code. == Architecture == Cloud architecture is the systems architecture of the software systems involved in the delivery of cloud computing (e.g. hardware, software) as designed by a cloud architect who typically works for a cloud integrator. It typically involves multiple cloud components communicating with each other over application programming interfaces (usually web services). This is very similar to the Unix philosophy of having multiple programs doing one thing well and working together over universal interfaces. Complexity is controlled and the resulting systems are more manageable than their monolithic counterparts. Cloud architecture extends to the client where web browsers and/or software applications are used to access cloud applications. Cloud storage architecture is loosely coupled where metadata operations are centralized enabling the data nodes to scale into the hundreds, each independently delivering data to applications or users. == Key characteristics == * Capital expenditure minimized, therefore low barrier to entry as infrastructure is owned by the provider and does not need to be purchased for one-time or infrequent intensive computing tasks. Services are typically being available to or specifically targeting retail consumers and small businesses. * Device and location independence which enables users to access systems regardless of location or what device they are using (for example PC, mobile,... etc.). * Multitenancy enabling sharing of resources (and costs) among a large pool of users, allowing for: ** Centralization of infrastructure in areas with lower costs (e.g. real estate, electricity) ** Peak-load capacity increases (users need not engineer for highest possible load levels) ** Utilization and efficiency improvements for systems that are often used only 10-20%. * Performance is monitored and consistent but can be affected by insufficient bandwidth or high network load. * Reliability by way of multiple redundant sites, which makes it suitable for business continuity and disaster recovery, however IT and business managers are able to do little when an outage hits them. Historical data on cloud outages is tracked in the Cloud Computing Incidents Database .A New Resource, Born of a Cloud Feud * Scalability which meets changing user demands quickly, without having to engineer for peak loads. Massive scalability and large user bases are common but not an absolute requirement. * Security which typically improves due to centralization of data, increased security-focused resources, etc. but which raises concerns about loss of control over certain sensitive data. Accesses are typically logged but accessing the audit logs themselves can be difficult or impossible. * Sustainability through improved use of resources, more efficient systems and carbon neutrality. ==Security and privacy== Cloud computing poses privacy concerns because the service provider can access the data that is in the cloud at any time. It could accidentally or deliberately alter or delete information. Many cloud providers can share information with third parties if necessary for purposes of law and order without a warrant. That is permitted in their privacy policies, which users must agree to before they start using cloud services. Solutions to privacy include policy and legislation as well as end-users' choices for how data is stored. == Components == === Application === A cloud application influences The Cloud model of software architecture, often eliminating the need to install and run the application on the customer's own computer, thus reducing software maintenance, ongoing operations, and support. For example: * Peer-to- peer/volunteer computing (Bittorrent, SETI@home, Skype) * Web application (Facebook) * Software as a service (Google Apps, Salesforce) * Software plus services (Microsoft Online Services) === Client === A cloud client is computer hardware and/or computer software which relies on The Cloud for application delivery, or which is specifically designed for delivery of cloud services, and which is in either case essentially useless without a Cloud. For example: * Mobile (Android,Google's Open Source Android OS Will Free the Wireless Web iPhone,In Sync to Pierce the Cloud Windows MobileMicrosoft demos mobile cloud sync client) * Thin client (CherryPal,CherryPal brings cloud computing to the masses Zonbu gOS based systemsGOS cloud computing) * Thick client/Web browser (Google Chrome,Google Chrome Aims to Break Microsoft Windows Mozilla Firefox) === Infrastructure === Cloud infrastructure (e.g. Infrastructure as a service) is the delivery of computer infrastructure (typically a platform virtualization environment) as a service. For example: * Full virtualization (GoGrid, Skytap) * Grid computing (Sun Grid) * Management (RightScale) * Paravirtualization (Amazon Elastic Compute Cloud) === Platform === A cloud platform (e.g. Platform as a service) (the delivery of a computing platform and/or solution stack as a service) facilitates deployment of applications without the cost and complexity of buying and managing the underlying hardware and software layers.Google angles for business users with 'platform as a service' For example: * Web application frameworks ** Python Django (Google App Engine) ** Ruby on Rails (Heroku) * Web hosting (Mosso) * Proprietary (Azure, Force.com) === Service === A cloud service (e.g. Web Service) is \"software system[s] designed to support interoperable machine-to- machine interaction over a network\" which may be accessed by other cloud computing components, software (e.g. Software plus services) or end users directly.The Emerging Cloud Service Architecture For example: * Identity (OAuth, OpenID) * Integration (Amazon Simple Queue Service) * Mapping (Google Maps, Yahoo! Maps) * Payments (Amazon Flexible Payments Service, Google Checkout, PayPal) * Search (Alexa, Google Custom Search, Yahoo! BOSS) * Others (Amazon Mechanical Turk) === Storage === Cloud storage is the delivery of data storage as a service (including database-like services), often billed on a utility computing basis (e.g. per gigabyte per month).Google, Microsoft and Apple building online storage havens: you win For example: * Database (Amazon SimpleDB, Google App Engine's BigTable datastore) * Network attached storage (MobileMe iDisk component, Nirvanix CloudNAS) * Synchronisation (Live Mesh Live Desktop component, MobileMe push functions) * Web service (Amazon Simple Storage Service, Nirvanix SDN) Traditional storage vendors have recently begun to offer their own flavor of cloud storage, sometimes in conjunction with their existing software products (e.g. Symantec's Online Storage for Backup Exec ). Others focus on providing a new kind of back-end storage optimally designed for delivering cloud storage (EMC's Atmos), categorically known as Cloud Optimized Storage. == Roles == === Provider === A cloud computing provider or cloud computing service provider owns and operates cloud computing systems serve someone else. Usually this needs building and managing new data centers. Some organisations get some of the benefits of cloud computing by becoming \"internal\" cloud providers and servicing themselves, though they do not benefit from the same economies of scale and still have to engineer for peak loads. The barrier to entry is also significantly higher with capital expenditure required and billing and management creates some overhead. However, significant operational efficiency and quickness advantages can be achieved even by small organizations, and server consolidation and virtualization rollouts are already in progress. Amazon.com was the first such provider, modernising its data centers which, like most computer networks were using as little as 10% of its capacity at any one time just to leave room for occasional spikes. They opened it up to outsiders as Amazon Web Services in 2002 on a utility computing basis. A user is a consumer of cloud computing. The privacy of users in cloud computing has become of increasing concern.Google Privacy Practices Worse Than ISP Snooping, AT&T; Charges The rights of users is also an issue, which is being addressed via a community effort to create a bill of rights (currently in draft ). === Vendor === A vendor sells products and services that facilitate the delivery, adoption and use of cloud computing.List of Cloud Platforms, Providers and Enablers For example: * Computer hardware (Dell, HP, IBM, Sun Microsystems) ** Storage (3PAR, EMC, MogileFS) ** Infrastructure (Solace Systems, Layer 7 Technologies, F5 Networks) * Computer software (3tera, GigaSpaces, Hadoop) ** Operating systems (Windows Azure, Linux and Solaris) ** Platform virtualisation (Citrix, Microsoft, VMware, Sun xVM) == Standards == A cloud standard is one of a number of existing (typically lightweight) open standards that have facilitated the growth of cloud computing, including:The Cloud and Standards * Application ** Communications (HTTP, XMPP) ** Security (OAuth, OpenID, SSL/TLS) ** Syndication (Atom) * Client ** Browsers (AJAX) ** Offline (HTML 5) * Infrastructure ** Virtualization (OVF) * Platform ** Solution stacks (LAMP, Space-based architecture) * Service ** Data (XML, JSON) ** Web Services (REST) * Storage == References == == Other websites == * * Jones, M. Tim, Cloud Computing with Linux from IBM DeveloperWorks (2008-09-10). * Kaye, Russell, Cloud Computing (QuickStudy) from ComputerWorld (2008-05-08). * Martin & Hoover, Guide to Cloud Computing from InformationWeek (2008-07-21). * Cloud Computing Community Wiki is a \"new resource put together by several industry executives and bloggers\". * Cloud Computing Incidents Database (CCID) tracks and \"provides historical data on cloud outages\".",
 "title": "Cloud computing"
}