{
 "id": "141950",
 "text": "Saludos Amigos is a 1943 movie that takes place in Latin America, produced by Walt Disney Productions and released by RKO Radio Pictures. The sixth animated feature in the Disney animated features canon, it is made up of four different segments; Donald Duck stars in two of them and Goofy stars in one. It also features the first appearance of José Carioca. Saludos Amigos was popular enough for a sequel, The Three Caballeros, to be produced two years later. The movie premiered in Rio de Janeiro on August 24, 1942. It was released in the United States on February 6, 1943. It got mixed reviews and was only rereleased once, in 1949, when it was shown on a double bill with the first rerelease of Dumbo. Its title in Spanish means, \"Hello, Friends\". This was the first Disney animated feature to be shown in South America before it was shown in the USA. At 42 minutes, this is the shortest Disney feature to date. == Segments == The movie features four different parts, or segments. Each of them begin with different clips of the Disney artists roaming the country drawing cartoons of some of the local cultures and scenery: * In Lake Titicaca, American tourist Donald Duck visits the Lake Titicaca and meets with some of the local yokels, including a llama. * Pedro involves the title character, a small airplane from Chile, in his very first flight to pick up air mail from Mendoza, with almost disastrous results. * In El Gaucho Goofy, American cowboy Goofy gets taken mysteriously to the Uruguayan pampas to learn the ways of the native gaucho. This segment was later edited for the movie's video release, to get rid of one scene of Goofy smoking a cigarette.http://www.schnittberichte.com/schnittbericht.php?ID=1996 Schnittberichte.com - Mehr als 4000 detaillierte Zensurberichte zu Filmen, Spielen, Comics, Serien und Musikvideos * Aquarela do Brasil (or \"Watercolor of Brazil\"), the finale of the movie, involves a brand-new character, José Carioca, showing Donald Duck around South America and introducing him to the samba (to the tunes of \"Brazil\" and \"Tico-Tico no Fubá\"). == Cast == * Lee Blair - Himself * Mary Blair - Herself * Pinto Colvig - Goofy * Walt Disney - Himself * Norman Ferguson - Himself * Frank Graham - Himself * Clarence Nash - Donald Duck * José Oliveira - José Carioca * Fred Shields - Narrator * Frank Thomas - Himself == Titles in other languages == * * * * * (also known as ) * * Japanese: ラテン・アメリカの旅 (Raten Amerika no Tabi, Journey to the Latin America) * * * * (also known as ) == References == == Other websites == * * (Dead link) Category:1943 movies Category:Disney animated movies Category:American family movies Category:American musical movies Category:Movies composed by Edward H. Plumb Category:Movies composed by Paul Smith Category:Multilingual movies Category:Movies directed by Norman Ferguson Category:Movies directed by Wilfred Jackson Category:Movies directed by Hamilton Luske Category:1943 musical movies Category:Movies about birds Category:Movies about dogs Category:Movies set in Argentina Category:Movies set in Uruguay",
 "title": "Saludos Amigos"
}