{
 "id": "142099",
 "text": "Capparis decidua is commonly known as karir, kair, kirir, karril, Teent etc. It is either a small tree with many branches or a shrub of the Thar desert and other hot and dry regions in southern Asia. It has a lot of thin, leafless branches, the small leaves being found only on young shoots. It rarely grows above a height of 5 meters (15 feet). These unripe fruits were used as a major dietary food item by the majority of people due to its exceptional nutritional and medicinal properties. The berries can be eaten and mixed with sangri (beans from the tree Prosopis cineraria) form a vegetable dish called \"Kair sangri\" in Rajasthan, India, which is a delicacy to many.khair is also used for preparing pickle and can be stored for long time . They are highly tolerant to salinity of soil (8 mmhos) . These plants grow in extremely scarce condition of water ( xerophytes ) like ber . Capparis decidua, commonly known as karira, is a resilient and versatile plant species that thrives in harsh, arid environments. This hardy shrub or small tree, often found in the Indian subcontinent, Africa, and Saudi Arabia, has adapted to survive in regions with limited water availability. Its intricate network of slender, green branches, adorned with tiny, ephemeral leaves, creates a distinctive silhouette against the backdrop of barren landscapes. Despite its seemingly delicate appearance, C. decidua possesses remarkable drought tolerance and can withstand extreme heat and cold. Its deep root system enables it to access water from significant depths, while its ability to shed leaves during dry periods minimizes water loss. Beyond its ecological significance, C. decidua holds cultural and medicinal value in many regions. Various parts of the plant, including the roots, bark, leaves, flowers, and fruits, have been traditionally used in herbal remedies to treat a range of ailments, from digestive disorders to skin infections. The plant's culinary applications are equally diverse, with its young shoots and flower buds being prized ingredients in various cuisines. Whether as a source of food, medicine, or ecological restoration, Capparis decidua continues to play a vital role in the lives of communities inhabiting arid regions. ==References== Category:Capparaceae Category:Plants of Pakistan",
 "title": "Capparis decidua"
}