{
 "id": "142178",
 "text": "The Gambino crime family is one of the \"Five Families\" that controls organized crime activities based in New York City, United States, within the Mafia (or Cosa Nostra). It was named after Carlo Gambino. == Bosses of the Gambino crime family == * 1907–1917 — Pellegrino Morano (Brooklyn Camorra leader, jailed 1917, then deported) * 1916–1928 — Salvatore \"Toto\" D'Aquila (what was left of the Brooklyn Camorra aligned with the D'Aquila group, killed by Joe Masseria October 10 or 28, 1928) * 1928–1930 — Alfred \"Al Mineo\" Manfredi (killed during Castellammarese War November 5, 1930) * 1930–1931 — Francesco \"Frank/Don Cheech\" Scalise (demoted after Salvatore Maranzano was killed) * 1931–1951 — Vincenzo \"Vincent\" Mangano (recognized as the first official boss of the family which would be the Gambino Family, disappeared April 15, 1951, allegedly killed by Albert Anastasia) * 1951–1957 — Albert \"Mad Hatter\" Anastasia (former head of the infamous death-squad Murder Incorporated, stepped up after Mangano disappeared, killed October 25, 1957, on orders of his Underboss Carlo Gambino) * 1957–1976 — Carlo Gambino (family godfather, seized also the power of the commission and recognized as the most powerful boss during his entire regime from the late 1950s and all the way up to the mid 1970s, died October 15, 1976, of natural causes) * 1974–1976 — Paul \"Big Paul\" Castellano (acting boss) (Followed orders from his boss, Carlo Gambino, right upon his death in 1976) * 1976–1985 — Paul Castellano (originally a captain and Gambino's brother-in-law who was promoted by Gambino on his death bed, which triggered a small war between two of the family's factions, killed on the orders of rival John Gotti, December 16, 1985) * 1986–2002 — John Gotti (most infamous boss recognized in the media, stepped up with younger regimes, caused great rivalry between him and two other families, jailed from 1990 to 2002, officially recognized boss, died June 10, 2002, while incarcerated) * 1992–1996 — Ruling Committee/Panel (aides to acting boss) Nicholas \"Little Nick\" Corozzo 1992-96 (jailed), Leonard \"Lenny\" DiMaria 1992-96 (jailed), John \"Jackie Nose \"DAmico 1992-96 * 1996–2002 — Ruling Committee/Panel Jackie D'Amico 1996-98 (jailed), Peter \"One Eye\" Gotti 1996-1999 (promoted), Louis \"Big Lou\" Vallario 1996-2002, Stephen \"Stevie Coogan\" Grammauta 1996-2002, Michael \"Mikey Scars\" DiLeonardo 1996-2002 (jailed 2002, defected November 2002) (Committee/Panel disbanded 2002, with death of longtime Don and Godfather, John Gotti) * 1992–1999 — John A. Gotti Jr. also known as \"Junior\" Gotti (acting boss) (jailed 1999) * 1999–2002 — Peter \"One Eye\" Gotti (acting boss) * 2002–2003 — Peter Gotti (recognized as official boss, jailed 2002) * 2002–2005 — Arnold \"Zeke\" Squitieri (acting boss) * 2005–present — Jackie D'Amico (acting boss), Domenico \"Italian Dom\" Cefalu (acting underboss), Joseph \"Jo Jo\" Corozzo (consigliere) * 2005–2006 — Nicholas \"Little Nick\" Corozzo (possibly the official sitting boss) * 2006–2007 — Nicholas Corozzo (Boss), Jackie D'Amico (street boss/caporegime), Domenico \"Italian Dom\" Cefalu (underboss, arrested on violation of his parole, in custody), Arnold \"Zeke\" Squitieri (acting underboss), Joseph Corozzo (consigliere) * 2007–2008 — Nicholas Corozzo (Boss), Jackie D'Amico (street boss/caporegime), Leonard \"Lenny\" DiMaria (street boss/caporegime)On strict supervised release until 2008, Arnold Squitieri (acting underboss), Joseph Corozzo (consigliere) * 2008–present — Derek Gualtieri (Boss), Deion Gualtieri (acting boss), Arnold Squitieri (underboss), Joseph Corozzo (consigliere) (present regime-hierarchy 2008) == Current family leaders == * Nicholas \"Little Nick\" Corozzo - Capo, former rival of John Gotti and Boss of the Gambino crime family. Brother of Consigliere Joseph Corozzo and the current head of the caporegimes. Named as one of the main defendants in the Operation Old Bridge case, but was tipped off in advance and went for almost four months on the run. Pleaded guilty to enterprise corruption, incarcerated at the Metropolitan Correctional Center (MCC) on separate counts of conspiracy to commit murder. * John \"Jackie Nose\" D'Amico - Capo, took over the old John Gotti crew in the early 1990s, operated in Queens and Brooklyn with labor racketeering, loansharking, extortion and murder. Currently an alleged Street boss or Acting boss along with the Corozzo brothers. Named as one of the main defendants following the indictments from Operation Old Bridge, he pleaded guilty to an extortion operation at Staten Island and was in August sentenced to 2 years in prison. * Arnold \"Zeke\" Squitieri - Underboss, longtime caporegime in the Gambino crime family, used to operate in Manhattan, Queens and Brooklyn with drug trafficking during the 1980s. Now he's currently promoted to family Underboss. Squitieri was convicted of drug trafficking, illegal gambling and tax evasion in 2006, and is currently serving just over seven years in prison. * Joseph \"Jo Jo\" Corozzo - Current Consigliere and brother of Nicholas Corozzo, with alleged loansharking and illegal gambling operations in Manhattan and Queens. Held his position since 1992 as a former rival of John Gotti. Named in the Operation Old Bridge indictments along with his brother, Corozzo was arrested and put into custody on February 8 and was in August sentenced to 46 months in prison after pleading guilty to a racketeering conspiracy charge. == Current family Capos == * Nicholas \"Little Nick\" Corozzo - Capo and Boss of the Gambino crime family. Brother of Consigliere Joseph Corozzo, uncle of Joseph Jr. and the current head of the caporegimes. Became a fugitive for almost four months, currently incarcerated. * John \"Jackie Nose\" D'Amico - Capo, took over the old John Gotti crew in the early 1990s, operated in Queens and Brooklyn with labor racketeering, loansharking, extortion and murder. Currently an alleged street boss or acting boss along with the Corozzo brothers. Took a plead deal after the massive roundup of Gambino Family members and is serving a 2-3 year sentence. * Thomas \"Tommy\" Gambino - Capo, son of former family godfather Carlo Gambino and nephew to Paul Castellano. Crew originally based in Brooklyn, Queens and Manhattan, New York. Controls labor racketeering in the Garment District. * Leonard \"Lenny\" DiMaria - Capo, personal right-hand-man for Nicholas Corozzo since early 1970s. Operates in Brooklyn and Manhattan with racketeering and loansharking. Alleged racketeering operations in Florida. * Francesco \"Frank\" Cali - Capo, accordingly the official Gambino \"ambassador to the Sicilian Mafia\", Cali extorted money with Leonard DiMaria from Joseph Volleros trucking company on Staten Island. A major suspect in the drug trafficking between the Sicilian Mafia and the Gambinos, Cali is currently incarcerated. * Thomas \"Tommy Sneakers\" Cacciopoli - Capo in the New Jersey faction of the Gambinos. * Domenico \"Italian Dom\" Cefalu - Capo and former Underboss. Born in Italy, Cefalu is the Sicilian faction-leader of the family, along with Anthony Megale. Currently imprisoned on violation of his parole and due to the indictments from Operation Old Bridge. * Daniel \"Danny\" Marino - Capo of the Gambinos' Queens faction with labor and construction racketeering operations. A longtime rival of John Gotti, Marino was involved in the murder-conspiracy that killed Frank DeCicco instead of Gotti in 1986. * Anthony \"Sonny\" Ciccone - Capo. A legend on the Brooklyn waterfront and dock boss, now serving a long prison sentence. * Salvatore \"Vinny Papa\" Ricchiettore - Acting Capo and current dock boss on behalf of Anthony Ciccone on the Brooklyn waterfront. Longtime member of the Gambino crime family. * George \"Butters\" DeCicco - Capo and brother of former Gambino Underboss, Frank DeCicco. A loyalist to John Gotti, DeCicco has been operating out of the Staten Island and Brooklyn factions of the family with loansharking since the 1980s. Currently on trial. * Anthony \"Tony Genius\" Megale - Capo and co-leader of the Sicilian faction of the family with Domenico Cefalu, Megale was the former acting underboss of the Gambino family after Peter Gotti was sent to prison in 2002. Currently incarcerated. * Eugene \"Gene\" Gotti - Capo, imprisoned for drug-trafficking, loansharking, murder and extortion. Brother of John, Peter, Vincent Gotti and Richard. Gene Gotti is serving 50 years in prison, but is in charge of all Gambino family loansharking business in New York. * Richard \"Richie\" Gotti - Capo of the Manhattan side. Brother of John, Peter, Gene and Vincent. Controls loansharking, extortion and garbage routes. Waste management consultant in Manhattan. * Salvatore \"Fat Sally\" Scala - Capo with extortion, racketeering and loansharking operations based in the Queens faction. Former heroin-trafficker and recognized by Jerry Capeci as one of the designated shooters in the murders of Paul Castellano and Thomas Bilotti. * Louis \"Louie Bracciole\" Ricco - Caporegime, controls illegal gambling, loansharking and racketeering in one half of the Bronx, as well as operating out of the New Jersey and Brooklyn factions of the family. * Salvatore \"Tore\" LoCascio - Capo - Son of the imprisoned Consigliere, Frank \"Frankie Loc\" LoCascio. Control of the other half of the Bronx faction. Used to operate within pornography that earned so much as $350 million a year, until he was prosecuted in 2003. * Ronald \"One Armed Ronnie\" Trucchio - Capo with control of The Ozone Park Boys, used to operate in Queens with a $30 million-a-year illegal gambling operation. Sentenced to life imprisonment in 2005. * Stephen \"Stevie Coogan\" Grammauta - Capo in the Manhattan faction of the Gambino family. Recognized by Jerry Capeci as one of the real shooters in the murder of Albert Anastasia in 1957. Reportedly served as acting boss in the \"Ruling Panel\" from 1996 to 2002. * Louis \"Big Lou\" Vallario - Capo, served from 1996 to 2002 as acting boss in the Family's Ruling Committee/Panel. Took over the crew of Sam Gravano in the 1980s. One of the last aides to John Gotti. Controls crew in Bensonhurst, Brooklyn. * Joseph \"Sonny\" Juliano - Capo in the Brooklyn faction of the Gambino crime family with illegal gambling, loansharking, fraud and wire fraud activities. Used to manage and operate a multi-million-dollar illegal gambling ring in 30 different locations in New York City. * Vincent \"Vinny the Shrimp\" Corrao - Capo with illegal gambling and narcotics operations. Crew originally based in Brooklyn. * Vincent \"Little Vinny\" Artuso - Capo with control of the Palm Beach, Florida faction of the Gambino family. Former drug trafficker and recognized by Jerry Capeci as one of the four designated shooters in the murder of Paul Castellano in 1985. * Anthony \"Tony Pep\" Trentacosta - Caporegime in the South Florida faction of the family. Former friend of John Gotti, used to run a gasoline racket that cost the US government $1 billion in tax dollars during the 1980s. == References ==",
 "title": "Gambino crime family"
}