{
 "id": "142135",
 "text": "Sexual dimorphism is an idea in biology. It means that the male and the female of a species look different enough to see. The word comes from the Greek: di (two) and morphe (form). It is the most common type of polymorphism. It may be caused by sexual selection, that is, competition between members of the same species for partners to reproduce.Andersson, Malte B. 1994. Sexual selection. Princeton University Press. Sexual dimorphism is inherited, which means the differences between males and females help the animal stay alive in some way. The things that make the two sexes of a species different are called secondary sex characteristics. They are not directly part of the reproductive system. They are the product of sexual selection for traits which give an animal an advantage. By \"advantage\" is meant: more likely to stay alive and reproduce. In humans, beards are a secondary sex characteristic. Human beings do not use beards to make babies. A man can even shave off his beard and he will still be able to have children. But men grow beards and women do not, and they are easy to see. The difference between sexes can include: * Size: Males in some species have harems ('ownership' of a group of females). In this case the males are usually larger than the females, e.g. gorillas, lions. In other species, the female is larger, usually because she makes the eggs. E.g. some vultures and frogs. **Sexual dimorphism is extreme in rotifers, with the males (if present) always much smaller than the females. Even more extreme are the sea devils, whose tiny males physically fuse with the females to form a chimaera. * Sometimes, one sex has additional features (used in courtship): antlers of deer, breasts of women,.. ** Hair (males often have more hair, e.g. the Gorilla) ** Teeth: Asian elephants: only the males have tusks. African elephant: both sexes have tusks. pigs and walrusses: the males have very pronounced canines ** Horns or antlers are often carried only by males. * Colouring: sexual dimorphism in butterflies is common. Batesian mimicry is often seen only on females, while the males have the typical colours of their type. This is the usual explanation: females, often carrying the precious eggs, get the most benefit from looking like something that predators do not want to eat or by being hard to see at all. Males, which need to be recognised by females before mating takes place, need to be easy to see and recognise.Ruxton G.D; Sherratt T.N. and Speed M.P. 2004. Avoiding attack: the evolutionary ecology of crypsis, warning signals & mimicry. Oxford. p156 10.5.3 Why is Batesian mimicry often limited to one sex? \"Experimental evidence is widespread that males and females of the same species may experience different selective pressures with respect to predation\". [slightly edited] The main functions of sexual dimorphism are to improve the individual's chance of mating in various ways: # Mate selection. In this case, usually the males display, and the females select. # Territory defence. Males may signal to other males that they 'own' an area. # Fighting. If males carry weapons, they may use them to fight for mates. Weapons and size are multi- functional: they are used for defence against predators as well as against other males of their species. Some animals show these differences only during mating season.Bonduriansky, Russell 2007. The evolution of condition-dependent sexual dimorphism. The American Naturalist 169 (1): 9–19. Deer shed their antlers and peacocks shed their tails out of season. This minimises the key disadvantage of sexual dimorphism, which is, it makes the male much easier to be seen by predators. == References == Category:Anatomy Category:Evolutionary biology Category:Classical genetics Category:Zoology",
 "title": "Sexual dimorphism"
}