{
 "id": "142176",
 "text": "The Five Families are the five major Italian-American Mafia crime families which have controlled organized crime in New York City since the 1930s. The Five Families, under the suggestion of Salvatore Maranzano and Charles \"Lucky\" Luciano, were responsible for the establishment of The Commission, a council that changed how things worked with Mafia activities in the United States. The five families and their bosses are (currently): *Bonanno: Vincent \"Vinny Gorgeous\" Basciano (Salvatore Montagna is the acting boss) *Gambino: Nicholas \"Little Nick\" Corozzo and Jackie \"Nose\" D'Amico *Colombo: Carmine \"Junior\" PersicoGang Land News: Persico (Thomas Gioeli is the acting boss) *Genovese: Daniel \"Danny the Lion\" Leo *Lucchese: Vittorio \"Vic\" AmusoRaab, Selwyn. Five Families: The Rise, Decline, and Resurgence of America's Most Powerful Mafia Empires. New York: St. Martin Press, 2005. (Steven \"Wonderboy\" Crea is the acting boss) The Colombo family was once known as the Profaci Crime Family, until a coup caused a name change in the early 1960s. Former Godfather Joe Massino had wanted to change the name of the Bonanno Family to the Massino Family but since his arrest and defection it is unlikely to happen. The DeCavalcante crime family, based in nearby Elizabeth, NJ, also has ties to the five New York families. == In pop culture == *In The Godfather, five crime families control the Mafia of New York, but the families have different names. The Corleones, go to war with the other members of the Five Families, the Tattaglias, the Barzinis, the Cuneos, and the Straccis. *In The Sopranos, the DiMeo Crime Family of New Jersey have close business connections with the Lupertazzi Crime Family of Brooklyn, one of the five families in New York. Members of the DeCavalcante family believed themselves to be the ones used for the DiMeo family.\"New Charges for Mob Family as U.S. Indictment Names 20\", New York Times April 20, 2001 ==References==",
 "title": "Five Families"
}