{
 "id": "14220",
 "text": "Creationism is the belief that the universe was created in the way that religious books or creation myths describe. The Christian creation myth, expressed in Genesis, says that God created life from nothingness by fixing the chaos that existed. (This belief is known as creatio ex nihilo, which is the Latin name for creation from nothing.) Other religions have different creation myths. People who believe in these are called creationists. Creationism was a mainstream view for thousands of years. Many writers, like Augustine of Hippo, said that God created the world. 19th-century Fundamentalist Protestants founded creationism as it is known today. These fundamentalists opposed new scientific theories about geology and evolution. In the 20th century, creationist movements also started in Islam and Judaism. == Belief == Creationists do not believe that all of today's living things came about from simple organisms changing or evolving slowly over time. They believe that life was created much as it is today, and that one form of life cannot change into another. In response, biologists and paleontologists say that fossils are different from the life we see today, and can be put into order to show changes over time. == Christian Creationism == Creationists point to the perfection of Earth's size, shape, and distance as designed by God, and Earth's imperfections as proofs that the Earth is dirtied by humans' sin. The term creationism can be used with more than one meaning. #Sometimes creationism means that God created life and evolution did not happen.Why creationism is wrong and evolution is right #Other times creationism means that God created everything, but this could have happened long ago, and theistic evolution may have happened. Liberal Christians do not believe in Biblical inerrancy and say God used evolution to create mankind and other life. This idea is called theistic evolution. === Young Earth Creationism === Young Earth Creationism goes completely against conventional geochronology. It says that the Bible is literally true: that God created the world in six days (with God resting on the seventh), roughly 6,000 to 10,000 years ago. Young Earth Creationism says that Noah's flood is important to creationism. They argue that \"the first buried fossils of each group are complete and complex (complicated), strong support for the biblical concept (idea) that each kind of life was created well designed to multiply after its own kind.\" However, others argue that fossils appear in layers called strata. If earth's animals drowned in the flood, scientists think their fossils would be mixed together.Can Noah's flood account for the geologic and fossil record? Christian creationists say this happened because of the Noahic Flood, and point to fossils of animals that died quickly. Young Earth Creationists also point to: # Fossils that were buried quickly, as in Lagerstätten. One fossil Creationists cite shows that one fish was eating another fish when it was buried. # Polystrate fossils (fossils that go through multiple rock layers). Christian scientists say this can't happen if the rock layers were formed quickly # Bent rock layers (rock layers that are bent in a way that Christian scientists say can not happen over millions of years).YouTube - Bill Nye Debates Ken Ham HD (Official) === Old Earth Creationism === Other creationists believe God created everything between 13,000 and 14,000 million years ago. This is called Old Earth Creationism. == Islamic Creationism == Islamic creationism says that Allah created the universe (including humanity) just as written in the Qur'an. Currently, Islam takes religious texts literally. Many scholars say that Genesis is a corrupted version of God's message. There is also a creation myth in the Qu'ran, but it is more vague than Genesis. This allows for more interpretation. But there is also a growing movement of Islamic creationism. Like the movement in Christianity, Islamic creationists are concerned that the findings of evolutionary theory might contradict what is written in the Qu'ran. Some Muslims, like Adnan Oktar, have argued that one species cannot develop from a different species. === Evolutionary creationism === Many liberal Muslims believe in evolutionary creationism. Several liberal movements within Islam generally accept the scientific positions on the age of the earth, the age of the universe and evolution. Islam also has its own form of Theistic evolution, which says the Qu'ran supports mainstream scientific analysis of the origin of the universe. In 2004 Khalid Anees, president of the Islamic Society of Britain, said there is no contradiction between natural selection, survival of the fittest, and what is revealed in the Quran. There are several verses in the Qur'an which some modern writers have interpreted as being compatible with the expansion of the universe, Big Bang and Big Crunch theories:Harun Yahya, The Big Bang Echoes through the Map of the GalaxyMaurice Bucaille (1990), The Bible the Qur'an and Science, \"The Quran and Modern Science\", .A. Abd-Allah, The Qur'an, Knowledge, and Science , University of Southern California. > \"Do the disbelievers not realize that the heavens and earth were ˹once˺ one > mass then We split them apart? And We created from water every living thing. > Will they not then believe?\" > \"Then He turned towards the heaven when it was ˹still like˺ smoke, saying to > it and to the earth, ‘Submit, willingly or unwillingly.’ They both > responded, ‘We submit willingly.’\" > \"We built the universe with ˹great˺ might, and We are certainly expanding > ˹it˺.\" > \"On that Day We will roll up the heavens like a scroll of writings. Just as > We produced the first creation, ˹so˺ shall We reproduce it. That is a > promise binding on Us. We truly uphold ˹Our promises˺!\" == Baha'i creationism == The Bahá'í Faith considers the creation narratives in previous Abrahamic religions to be symbolic and not literal. Bahá'í Faith also accepts that the Earth is ancient. Baha'ullah existed at the same time as Charles Darwin, so was aware of Darwin's works. == Scientific criticism == In the United States, some religious communities have pushed schools to include supernatural explanations of the origins of life and the universe in their lessons. Evolution was not included in school textbooks until the 1960s. In 1987, the United States Supreme Court acknowledged that creationism is not scientific, and should not be taught in public schools.The National Center for Science Education's collection of statements by scientific societies in support of evolution. The National Center of Science Education and the Royal Society agree with this decision. == Related pages == * Human timeline * Life timeline * Nature timeline *Fundamentalism == References == == Other websites == * Stanford Encyclopedia of Philosophy entry on Creationism * How creationism works * Creation and Evolution Both? Examines whether Biblical creation and neo-darwinistic evolution can be reconciled. * Evolution, Creationism & ID Timeline Focuses on major historical and recent events in the scientific and political debate * Evolution Sciences versus Doctrines of Creationism and Intelligent Design * . A Guide for Museum Docents * What is creationism? from talk.origins. * The Creation/Evolution Continuum by Eugenie Scott. * Armies of the Night by Isaac Asimov. * Workers have stake in defending science a materialist statement on creationism by The Militant, 2005. * Edward J. Larson and Larry Witham Leading scientists still reject God in Nature, Vol. 394, No. 6691 (1998), p. 313\\. Online at Freethought-web.org * Creationism: The Hindu View * Biologos is a Christian organization that sees evolution as factual. * Evolution or God's creation? - Evolutionism – Microevolution and macroevolution. Reflections on evolutionism and creationism. Category:Intelligent design *",
 "title": "Creationism"
}