{
 "id": "142240",
 "text": "The Musée d'Orsay is an art museum in Paris. The building was built in 1900 and was first used as a railway station. In 1986, it became a museum, and it is still very famous today. The museum exhibits artworks of the 19th century including Impressionist paintings. The Impressionist paintings include works by Monet, Degas, Renoir, Cézanne, Manet, and Van Gogh. That's why the Orsay is called the 'Impressionism museum'. The museum holds mainly French art dating from 1848 to 1915, including paintings, sculptures, furniture, and photography. Its extensive collection of impressionist and post-impressionist masterpieces is the largest in the world. It features work by such painters such as Monet, Manet, Degas, Renoir, Cézanne, Seurat, Sisley, Gauguin, Van Gogh and many others. ==Collection== ===Paintings: major painters and works represented=== *Jean Auguste Dominique Ingres -- 4 paintings (the main collection of his paintings is in the Louvre) *Eugène Delacroix -- 5 paintings (the main collection of his paintings is in the Louvre) *Théodore Chassériau -- 5 paintings (the main collection of his paintings is in the Louvre) *Gustave Courbet -- 48 paintings including The Artist's Studio, A Burial at Ornans, Young Man Sitting, L'Origine du monde *Jean-François Millet -- 27 paintings including Spring, The Gleaners *Honoré Daumier -- 8 paintings *Eugène Boudin -- 33 paintings including Trouville Beach *Camille Pissarro -- 46 paintings including White Frost *Édouard Manet -- 34 paintings including Olympia, The Balcony, Berthe Morisot With a Bouquet of Violets, The Luncheon on the Grass *Berthe Morisot -- 9 paintings *Edgar Degas -- 43 paintings including The Parade, also known as Race Horses in front of the Tribunes, The Bellelli Family, The Tub, Portrait of Edouard Manet, Portraits, At the Stock Exchange, L’Absinthe *Paul Cézanne -- 56 paintings including Apples and Oranges *Claude Monet -- 86 paintings (the main collection of his paintings is in the Musée Marmottan Monet) including The Saint-Lazare Station, The Rue Montorgueil in Paris. Celebration of June 30, 1878, Wind Effect, Series of The Poplars, Rouen Cathedral. Harmony in Blue, Blue Water Lilies *Alfred Sisley -- 46 paintings including Inondation at Port-Marly *Pierre-Auguste Renoir -- 81 paintings including Bal au moulin de la Galette, Montmartre *Ferdinand Hodler -- Der Holzfäller (The Woodcutter) *Gustave Caillebotte -- 7 paintings including The Floor Planers *Édouard Detaille -- The Dream *Vincent van Gogh -- 24 paintings including Self Portrait, portrait of his friend Eugene Boch, The Siesta, The Church at Auvers, View from the Chevet, The Italian Woman, Starry Night Over the Rhone, Portrait of Dr. Gachet, Bedroom in Arles *Paul Gauguin -- 24 paintings including Tahitian Women on the Beach *Henri de Toulouse-Lautrec -- 18 paintings *Paul Signac -- 16 paintings including Women at the Well *Georges-Pierre Seurat -- 19 paintings including The Circus *Edouard Vuillard -- 70 paintings *Henri Rousseau -- 3 paintings *Pierre Bonnard -- 60 paintings including The Chequered Blouse *André Derain -- Charing Cross Bridge, also known as Westminster Bridge *Edvard Munch -- 1 painting *Gustav Klimt -- 1 painting *Piet Mondrian -- 2 paintings *James McNeill Whistler -- 3 paintings including Arrangement in Grey and Black: The Artist's Mother, also known as Whistler's Mother Category:Museums in Paris Category:Art museums in France",
 "title": "Musée d'Orsay"
}