{
 "id": "14265",
 "text": "{{Infobox comics character | character_name = Princess Diana of Themyscira | image =File:Lynda Carter Wonder Woman.JPG | caption = Lynda Carter as Wonder Woman. | publisher = DC Comics | debut = All Star Comics #8 (October 1941) | creators = |real_name = Princess Diana of Themyscira (Amazon identity) Diana Prince (civilian identity) |alliances = |homeworld = Themyscira |species = |partners = |aliases = |powers = {{collapsible list | titlestyle = background:transparent;text-align:left;font-weight:normal; |title = See list | *Superhuman strength, speed, stamina, durability, senses, agility, and reflexes *Flight *Divine lightning manipulation *Energy Absorption and projection (via channeling through her bracelets) *Magic *Astral Projection *Animal Empathy *Regenerative healing factor *Immortality *Master martial artist and hand-to-hand combatant *Weapon proficiency *Knowledge in Occult *Genius-level intellect *Utilizes Lasso of Truth, indestructible bracelets to deflect opposing weapons, projectile tiara, sword, shield, and invisible plane }} |cat = super |subcat = DC Comics |hero = |sortkey = Wonder Woman }} Wonder Woman is a superheroine who appears in comic books published by DC Comics. She is one of the first female superheroes in American comic books, and the most famous female superhero in the world. William Moulton Marston, a psychologist who believed that women could be as strong and powerful as men, created Wonder Woman. She was partly inspired by his wife, Elizabeth Holloway-Marston. Wonder Woman first appeared in All-Star Comics # 8, published in December 1941. Her first solo comic book, Wonder Woman # 1, was published in the summer of 1942. == Story == In the comic book, Wonder Woman's real name is Princess Diana of Themyscira, or by her civilian name Diana Prince. She is the daughter of Queen Hippolyta. Hippolyta is the ruler of the Amazons, a race of peace-loving women who lived on an island named Themyscira (also referred to as Paradise Island). During World War II, Steve Trevor, a US Air Force pilot, crash-lands on Paradise Island. Diana and the Amazons tend to his wounds and help him recover. Diana decides that she will bring him back to the United States. When she gets there, she becomes the superhero that the world calls Wonder Woman. Her best-known powers are superhuman strength, speed, and reflexes, as well as flight. She has a magic lasso that forces those bound by it to tell the truth, and unbreakable gauntlets that can deflect bullets. == Villains == Among her villains, the best known are: * Ares - the Greek god of war, whose energy and almost infinite powers are fueled by war and hatred among humans * Circe - an ancient sorceress who can transform men into animals * The Cheetah - a British archaeologist who has an ancient magical stone that turns her into a Cheetah-like were-woman with incredible speed, reflexes, strength, and thirst for blood * Silver Swan - a flying villainess whose main power is a very destructive sonic cry * Dr. Psycho - a powerful psychokinetic man that hates women * Devastation - a powerful villainess with powers similar to Wonder Woman's; she was created by the children of Chronus to destroy Wonder Woman and help take over Olympus == In other media == Wonder Woman also appeared in animated cartoons and a live-action television program in the 1970s with actress Lynda Carter. The series made the character very famous. In January 2001, producer Joel Silver asked Todd Alcott to write a Wonder Woman screenplay. Early rumours listed actresses such as Mariah Carey, Sandra Bullock, and Catherine Zeta-Jones to play the role of Wonder Woman. Leonard Goldberg, speaking in a May 2001 interview, named Sandra Bullock as a strong candidate for the project. Bullock said that she was asked to play the role. Lucy Lawless and Chyna were both interested in it. Many writers wrote different versions of the screenplay. By August 2003, Levens was replaced by screenwriter Laeta Kalogridis. In March 2005, Warner Bros. said that Joss Whedon would write and direct the movie version of Wonder Woman. Whedon was directing Serenity at the time. He needed time to learn Wonder Woman's background. So he did not start writing until late 2005. Silver wanted to film Wonder Woman in Australia once the script was finished. In May 2005, Whedon said that he would not cast Wonder Woman until he finished the script. Charisma Carpenter and Morena Baccarin said they were interested in the role. In February 2007, Whedon left the project. He said he could not agree with the studio about the script. Whedon said that since he was not doing the Wonder Woman project, he would focus on making his movie Goners. Gal Gadot played Wonder Woman in the 2016 action movie Batman v Superman: Dawn of Justice. She played the lead role in the 2017 superhero film Wonder Woman. She played the role again in Justice League (2017), Wonder Woman 1984 (2020), and Zack Snyder's Justice League (2021). ==Honors== On October 21, 2016, the United Nations named Wonder Woman a UN Honorary Ambassador for the Empowerment of Women and Girls. Many people did not like this, because they thought she was an \"overtly sexualized image\". They wanted the UN to use a real woman instead. Over 45,000 people signed a petition to remove her from the role. The character was dropped from the role two months later. ==Notes== == References == == Other websites == * Wonder Woman's Official Website * Wonder Woman's Origin @ DC Comics * Alan Kistler's History of Wonder Woman * Carol A. Strickland's Wonder Woman site Category:DC Comics adapted into movies Category:DC Comics superheroes Category:Justice League Category:Fictional characters introduced in 1941",
 "title": "Wonder Woman"
}