{
 "id": "142751",
 "text": "Strathaven (; ; from , meaning: valley of the Avon) is a small town in South Lanarkshire, Scotland. The town has was granted a Royal Charter in 1450, making the Town of Strathaven a Burgh of Barony. The current estimated population is 7,500. ==Location== The town is located on the edge of the strath of the Avon Water, around from Hamilton and from Glasgow. The A71, which connects Edinburgh and Kilmarnock passes through the town. In the 2001 census the town had a population of 7,700. Strathaven has one secondary school and three primary schools - Kirklandpark Primary, Wester Overton Primary, and St Patrick's Primary. It also has a grass airfield about to the north west on Lethame Road. == Strathaven railway stations == Strathaven had, at various times, three railway stations. * Strathaven station, the first station, was the terminus of the Hamilton and Strathaven Railway. The railway was taken over by the Caledonian Railway; and the station was replaced by Strathaven North railway station. * Strathaven North railway station, a terminal station on the Hamilton and Strathaven Branch of the Caledonian Railway, opened in October 1904, closed temporarily during World War I; and closed on 30 September 1945. * Strathaven Central railway station, on the line from Stonehouse to Drumclog, closed in June 1964. ==Sport== Strathaven is home to several sports clubs, which include: * Strathaven Dynamo AFC * Strathaven Rugby Club * Strathaven Golf Club * Strathaven Bowling Club * Avondale Bowling Club * Strathaven Tennis Club * Strathaven Badminton Club (Currently Meets in Larkhall due to the rebuilding of the sports centre). ==Famous Residents (Past and Present)== *Bertie Auld Footballer and one of the Lisbon Lions who played with Celtic *Stuart Braithwaite Singer and musician with the band Mogwai *William Craig Brownlee Clergyman, author and Professor of Languages at Rutgers University *Eric Caldow Scottish international footballer who played with Rangers *William Craig Surgeon and botanist, President of the Edinburgh Botanical Society and Fellow of the Royal Society of Edinburgh *David Fernández Spanish footballer who spent most of his career in Scotland playing at clubs including Celtic and Kilmarnock *James Mackinnon Fowler Australian politician and founding member of the Victorian Socialist League *Gordon Gibb Businessman, CEO of Flamingo Land Ltd and former chairman of Bradford City Football Club. *Sir Robert Giffen Financial editor of The Times newspaper and President of the Royal Statistical Society *Andy Kerr Labour Politician and former Scottish Executive Health Minister *Sir Harry Lauder Singer, comedian and music hall entertainer *Thomas Leiper Tobacco merchant *Barry Leitch Composer *Stuart McCall Scottish international footballer who played for Rangers, Everton and Bradford City *Una McLean Actress and comedian *Aileen Neilson Paralympian *Linda Fabiani (Scottish politician) SNP politician and former Scottish Executive Minister for Europe, External Affairs and Culture *Linda Ormiston Opera singer and actress *Corrie Scott Swimmer and bronze medalist at the 2014 Commonwealth Games *Stevie Starr Performance artist and contestant on Britain's Got Talent and America's Got Talent * Andy Stewart, Conservative MP from 1983-92 for Sherwood, and Chairman from 1992-8 of the Agricultural Training Board *Ricky Warwick Singer and guitarist with rock bands The Almighty and Circus Diablo currently new vocalist with Thin Lizzy *James Wilson Revolutionary leader who participated in the Scottish Insurrection of 1820 ==References== ==Other websites== *Strathaven castle Website *Town of Strathaven *Strathaven in Old Postcards *Scottish Gazetteer : Strathaven Category:Towns in South Lanarkshire",
 "title": "Strathaven"
}