{
 "id": "142811",
 "text": "The 1996 Pacific hurricane season was an event in tropical cyclone formation and the second least active Pacific hurricane season in recorded history, behind only 1977. It officially began May 15, 1996 in the eastern north Pacific and on June 1, 1996 in the central north Pacific. It ended on November 30, 1996. These dates conventionally delimit the period of each year when most tropical cyclones form in the northeastern Pacific Ocean. Few notable storms formed this season, however it was very eventful. Twelve tropical cyclones formed during this season, of which five made landfall and two other impacted land areas. Two tropical cyclones that formed in other basins entered the eastern north Pacific Ocean. Early in the season three tropical cyclones impacted Mexico in a ten-day span, while the first cyclone of the season formed before it officially began. Hurricane Douglas was the strongest storm, reaching Category 4 intensity on the Saffir-Simpson Hurricane Scale and had its beginnings in the Atlantic as Hurricane Douglas. ==Timelinə== ImageSize = width:815 height:200 PlotArea = top:10 bottom:80 right:20 left:20 Legend = columns:3 left:30 top:58 columnwidth:270 AlignBars = early DateFormat = dd/mm/yyyy Period = from:01/05/1996 till:01/12/1996 TimeAxis = orientation:horizontal ScaleMinor = grid:black unit:month increment:1 start:01/05/1996 Colors = id:canvas value:gray(0.88) id:GP value:red id:TD value:rgb(0.38,0.73,1) legend:Tropical_Depression_=_<39_mph_(0–62_km/h)_(TD) id:TS value:rgb(0,0.98,0.96) legend:Tropical_Storm_=_39–73_mph_(63–117 km/h)_(TS) id:C1 value:rgb(1,1,0.80) legend:Category_1_=_74–95_mph_(118–153_km/h)_(C1) id:C2 value:rgb(1,0.91,0.46) legend:Category_2_=_96–110_mph_(154–177_km/h)_(C2) id:C3 value:rgb(1,0.76,0.25) legend:Category_3_=_111–130_mph_(178–209_km/h)_(C3) id:C4 value:rgb(1,0.56,0.13) legend:Category_4_=_131–155_mph_(210–249_km/h)_(C4) id:C5 value:rgb(1,0.38,0.38) legend:Category_5_=_≥156_mph_(≥250_km/h)_(C5) Backgroundcolors = canvas:canvas BarData = barset:Hurricane bar:Month PlotData= barset:Hurricane width:10 align:left fontsize:S shift:(4,-4) anchor:till from:13/05/1996 till:16/05/1996 color:TS text:\"One-E (TS)\" from:15/05/1996 till:19/05/1996 color:TD text:\"Two-E (TD)\" from:20/06/1996 till:27/06/1996 color:C2 text:\"Alma (C2)\" from:27/06/1996 till:01/07/1996 color:C1 text:\"Boris (C1)\" from:01/07/1996 till:03/07/1996 color:TS text:\"Cristina (TS)\" from:04/07/1996 till:06/07/1996 color:TD text:\"Six-E (TD)\" from:29/07/1996 till:06/08/1996 color:C4 text:\"Cesar-Douglas (C4)\" from:14/08/1996 till:15/08/1996 color:TD text:\"Seventeen-W (TD)\" barset:break from:24/08/1996 till:25/08/1996 color:TD text:\"Dolly (TD)\" from:30/08/1996 till:06/09/1996 color:TS text:\"Elida (TS)\" from:10/09/1996 till:14/09/1996 color:C3 text:\"Fausto (C3)\" from:15/09/1996 till:20/09/1996 color:TD text:\"One-C (TD)\" from:27/09/1996 till:09/10/1996 color:TS text:\"Genevieve (TS)\" from:30/09/1996 till:04/10/1996 color:C1 text:\"Hernan (C1)\" from:07/11/1996 till:11/11/1996 color:TD text:\"Twelve-E\" bar:Month width:5 align:center fontsize:S shift:(0,-20) anchor:middle color:canvas from:01/05/1996 till:01/06/1996 text:May from:01/06/1996 till:01/07/1996 text:June from:01/07/1996 till:01/08/1996 text:July from:01/08/1996 till:01/09/1996 text:August from:01/09/1996 till:01/10/1996 text:September from:01/10/1996 till:01/11/1996 text:October from:01/11/1996 till:01/12/1996 text:November TextData = pos:(570,30) text:\"(From the\" pos:(617,30) text:\"Saffir–Simpson hurricane wind scale)\" ==Storms== ===Hurricane Alma=== Alma was the first of three consecutive storms to come close to, or make landfall on, the Pacific coast of Mexico during a ten-day span. Alma killed at least three people, and possibly twenty. Three were killed when a house near Lazaro Cardenas collapsed. There were unconfirmed reports that 17 people were killed by floods in Puebla from rains related to Alma. Trees were downed and power was knocked out to many places. Roads were flooded and covered with Debris. ===Hurricane Boris=== Hurricane Boris was the second consecutive storm to approach close to Mexico. It made landfall halfway between Acapulco and Lazaro Cardenas on June 29. It killed ten people. A flood caused by Boris on the San Jeronimo River left thousands homeless. ===Tropical Storm Cristina=== Cristina was the third cyclone to come close to Mexico in the space of ten days. It killed a fisherman when his boat was caught at sea off Oaxaca. At least 11 other fishing boats and 22 people were missing. Their fate is unknown. ===Hurricane Douglas=== Hurricane Douglas was a continuation of Atlantic Hurricane Cesar, which crossed Central America. Continuing Cesar's nearly due-west heading, it was still a tropical storm when it entered the Pacific on July 29, and quickly regained hurricane status.NOAA: Preliminary Report - Hurricane Douglas Douglas's strengthened over the next two days as it turned west-northwest, paralleling the coast of Mexico. It reached its peak intensity on August 1, with winds of and a central pressure of , making it the strongest hurricane of the season. Its slow weakening began on August 2 as it entered cooler waters, and it officially dissipated on August 6, though like many Pacific hurricanes, a remnant circulation could be tracked westward for several days afterward. ===Hurricane Fausto=== The precursor disturbance to Fausto was first noticed over Venezuela as early as August 31, and may have been related to the tropical wave that spawned Hurricane Fran. By September 4 the wave had crossed Central America into the Pacific; it steadily organized until it was upgraded to Tropical Storm Fausto on September 10.NOAA: Preliminary Report - Hurricane Fausto Fausto intensified rapidly after it reached hurricane intensity on the 12th, peaking with sustained winds of and a minimum central pressure of . The hurricane weakened as an approaching trough increased shear over the storm; this same trough also turned the storm north on the 13th, where it made landfall as a minimal hurricane Baja California that day. On September 14, the storm turned northeastward across the Gulf of California, and dissipated inland over the Sierra Madre range after its second landfall as a hurricane. Its extratropical remnants flared up briefly over northern Mexico and Texas, but otherwise soon lost their identity. Damage in Mexico was relatively minor, with only a single casualty caused by a downed power line. ===Hurricane Hernan=== Hurricane Hernan made landfall in a thinly- populated region of Mexico. It washed out roads, and knocked down power lines and telephone poles. There were 100 injuries but no deaths. ==References== Category:Pacific hurricane seasons Pacific hurricane season Pacific hurricane season",
 "title": "1996 Pacific hurricane season"
}