{
 "id": "142973",
 "text": "John Herbert Patrick Stanley Dillinger (June 22, 1903 – July 22, 1934) was an American bank robber in the American Midwest. ==Early years== Dillinger was born in Indianapolis, Indiana. He grew up in Mooresville, Indiana. His first robbery occurred in Mooresville in 1924. He went to prison until 1933. Later, he helped some convicts escape, and formed a gang of robbers with them.Wold Book Encyclopedia, volume 5. 2012. Scott, Foresman. p. 204 ==Criminal career== In 1934, Dillinger was accused of killing a policeman. He was transported from Arizona to Indiana. He escaped from jail. His flight across state lines in a stolen vehicle made him a fugitive from the FBI. He formed a gang and robbed banks. He had several gun battles with the men of the FBI. By the middle of 1934, he had robbed 10 banks in four midwestern states. ==Death== Dillinger was hiding in Chicago, Illinois, when he was betrayed by the madame of a brothel named Anna Sage. She accompanied him to the Biograph Theater wearing a red dress. This was done so the police could easily see her. Dillinger was gunned down by the FBI as he left the movie theater. Dillinger had chosen to see the Clark Gable gangster movie, Manhattan Melodrama. Anna Sage became known as \"The Lady in Red\". == Film depictions == * Humphrey Bogart's played the gang leader Duke Mantee in The Petrified Forest, {1936} a character based on Dillinger. * Lawrence Tierney starred in the first film dramatization of Dillinger's career; Dillinger (1945). * In a parody of Dillinger's escape with a phony gun, Woody Allen tries the same stunt [and fails} in his 1971 movie, Take the Money and Run. * Warren Oates's 1973's Dillinger. Another dramatization version of the Dillinger gang comparable to the 1969 movie \"Bonnie and Clyde\" * A TV movie Dillinger was released in 1991, starring Mark Harmon. * Director Michael Mann's 2009 film Public Enemies, is an adaptation of Bryan Burrough's book Public Enemies: America's Greatest Crime Wave and the Birth of the FBI, 1933-43 and features Johnny Depp as John Dillinger and Christian Bale as FBI agent Melvin Purvis. ==References== Category:1903 births Category:1934 deaths Category:American criminals Category:Criminals from Chicago Category:Criminals from Indiana Category:People shot and killed by law enforcement officers in the United States",
 "title": "John Dillinger"
}