{
 "id": "143027",
 "text": "Charlie and the Chocolate Factory (1964) is a children's book by British author Roald Dahl. This story of the adventures of young Charlie Bucket inside the chocolate factory of eccentric candymaker Willy Wonka is often considered one of the most beloved children's stories of the 20th century. It has been made into a movie not once but twice. == Plot == Only five children were to win a golden ticket and to be allowed inside the Willy Wonka's chocolate factory. Those who won the lottery would get a magical tour and see all the mysterious machinery in the factory where the world's most wonderful sweets are made. The lucky five were the greedy Augustus Gloop, the spoiled Veruca Salt, the gum-chewing Violet Beauregarde, the TV-loving Mike Teavee and the poor Charlie Bucket. One by one, the children break Wonka's rules by acting on a vice they possess, with Charlie ending up a hero of the story. The book teaches about sins and virtues. == Characters == === The main characters === * Willy Wonka: Wonka is the owner of the chocolate factory * Charlie Bucket: Charlie is the main character in the story. He enters a competition run by Wonka. * Grandpa Joe: Charlie's grandfather === The other children=== * Augustus Gloop: Gloop is a greedy boy, who is the first child to be sent away. He was not careful when he was drinking the Chocolate River. He fell into it as was sent to be made into strawberry-coated fudge. * Veruca Salt: Salt is a girl who likes to get everything that she wants. She goes to the nut room and is found to be a \"bad nut”. She is sent to the furnace. * Violet Beauregarde: Beauregarde is a girl who is always chewing gum. She tries Wonka's everlasting gum. She grows bigger and bigger and ends up becoming a giant blueberry. * Mike Teavee: Teavee is a boy who is likes to always watch television. He is shrunk by the Television Chocolate. ===Other characters=== * Oompa-Loompas: Midgets who work in the Factory. They are about high and they have strange hair cuts. They are paid in cacao beans. They come from Loompaland, which is a region of Loompa. Loompa is a small island in the Pacific Ocean. When the book was written, it said that they came from \"the very deepest and darkest part of the African jungle where no white man had been before\", but this was changed (see Problems section). They are the only people that Wonka trusts to work in the factory. When any of the children are taken away, the Oompa-Loompas sing a song about them. * Mr. Slugworth: In the book, Slugworth is a chololate maker who is one of Wonka's rivals. In the 1971 movie, Slug worth is finally shown to be one of Wonka's workers who has been testing the children's loyalty. * Prince Pondicherry: Wonka made a chocolate palace for the Prince. It melted in the sun. ==Problems== * In early editions of the book, the Oompa-Loompas are described as African pygmies. This caused controversy and criticism. In later editions of the book, they have white skin and golden hair. (In the 1971 movie, they have orange skin). == Sequel == The book has a sequel called Charlie and the Great Glass Elevator == Adaptations == In 1971, Mel Stuart and Warner Bros made the book into a movie called Willy Wonka & the Chocolate Factory. Then in 2004, there was a play called Roald Dahl’s Willy Wonka. Then in 2005, Tim Burton made a movie remake called Charlie and the Chocolate Factory. In 2010, Peter Ash wrote an opera called The Golden Ticket based on the book. In 2013, David Greig, Marc Shaiman and Scott Whitman wrote a Broadway musical called Charlie and the Chocolate Factory based on the book. In 2017, Warner Bros. and Turner Entertainment made a Tom and Jerry movie called Tom and Jerry: Willy Wonka and the Chocolate Factory which was a lot like the movie Willy Wonka & the Chocolate Factory but with Tom and Jerry as the main characters. == Prequel == In 2023, Warner Bros made a prequel movie called Wonka about the origin story of Willy Wonka. == References== ==Other websites and links== * Official Roald Dahl Website * The Willy Wonka Candy Company Category:1964 books Category:English children's books Category:Charlie and the Chocolate Factory (franchise)",
 "title": "Charlie and the Chocolate Factory"
}