{
 "id": "143193",
 "text": "Valley is a city in Chambers County, Alabama, United States. According to the 2020 census, there are 10,529 people living there. == Geography == Valley is located in the southeastern Chambers County at 32°48'41\" North, 85°10'41\" West (32.811387, -85.177938). According to the U.S. Census Bureau, it has a total area of , all land. It is located on the Alabama-Georgia state line. Valley is part of a larger area called the LaGrange Micropolitan Statistical Area. It consists of Chambers County and Troup County, Georgia. == Climate == Its climate usually has hot, humid summers and generally mild to cool winters. According to the Köppen Climate Classification system, Valley has a humid subtropical climate. It is often abbreviated \"Cfa\" on climate maps. == Demographics == === Population === As of the census of 2020, there were 10,529 people and 4,336 households in the city. Its population density was 817 people per square mile (315/km). There were 4,910 housing units at an average density of 381 per square mile (147/km). === Average income === In 2021, the median income for a household in the city was $51,476, and the median income for a family was $54,571. The per capita income for the city was $24,905. About 13.4% of the population were below the poverty line, including 18.6% of those under age 18 and 13.7% of those age 65 or over. == Media == Valley is served by the Columbus, Georgia Television Designated Market Area (DMA). == Notable people == * Jennifer Chandler, won a gold medal in diving at the 1976 Summer Olympics in Montreal * Josh Evans, former NFL player * Lemanski Hall, former NFL player * John Copeland, former NFL player * Bill McGhee, former player for the Philadelphia Athletics * Marcus Pollard, former NFL player * Mike Potts, former pitcher for the Milwaukee Brewers * K. Lee Scott, Christian composer * Jylan Ware, NFL player * Drew Ferguson, member of the United States House of Representatives from Georgia's 3rd congressional district * Matt Foster, pitcher for the Chicago White Sox == References == Category:Cities in Alabama",
 "title": "Valley, Alabama"
}