{
 "id": "143141",
 "text": "Céline Marie Claudette Dion, (; born March 30, 1956 or 1959) Is a Canadian singer. She is mostly known for the song \"My Heart Will Go On\", which was made for the film Titanic. This song won the Academy Award for Best Original Song. Dion became famous internationally in 1988 after winning the Eurovision Song Contest. ==Personal life== === Family === She was born in the town of Charlemagne, Quebec, Canada. She is the youngest of 14 children. Her parents were television personality Thérèse Dion (1927-2020) and businessman Adhémar Dion (1923–2003). === Marriage and children === On December 30, 1994, Dion married her manager René Angélil. They have three sons: René-Charles Angélil (born on January 25, 2001), and twins Eddy Angélil and Nelson Angélil (born on October 23, 2010). René died on January 14, 2016 from cancer. Her older brother, Daniel, died from cancer two days later, on what would have been Angélil's 74th birthday. == Career == When she was 12 years old, her brother sent a recording to a manager named René Angélil. With his help, she released her first album in 1981, and her first English album in 1990. Dion first had international recognition in the 1980s. She won both the 1982 Yamaha World Popular Song Festival and the 1988 Eurovision Song Contest where she represented Switzerland.Bliss, Karen. \"25 Years of Canadian Artists.\" Canadian Musician. March 1, 2004, p. 34. Her popularity continued through the 1990s. She recorded the song \"My Heart Will Go On\" for the film Titanic. In 2007, she performed a show with Elvis Presley, which was arranged on the computer with old images from Elvis shows. It had been arranged for the TV show American Idol. She has sold the most albums in the world for a female artist. For that, she received a special World Music Award in 2004.Celine Dion honoured by World Music Awards Canada.com Retrieved December 1, 2010World Music Awards to honor Celine Dion CTV News Retrieved December 1, 2010 She has also sold the most French albums with 7 million copies. Dion is the best-selling Canadian artist of all time.\"Dion Named All-time Best-selling Canadian Act \". (2000-1-06). Allbusiness. Retrieved October 12, 2009.Learn, Josh \"High Fidelity: Top Selling Canadian Artists \". The Brock Press. Retrieved October 12, 2009. In 2018, Dion released the song \"Ashes\", which appears on the soundtrack to the film Deadpool 2, starring fellow Canadian Ryan Reynolds. ==Discography== French-language studio albums *1969 or 1972: La voix du bon Dieu *1969 or 1972: Céline Dion chante Noël *1970 or 1973: Tellement j'ai d'amour... *1971 or 1974: Les chemins de ma maison *1971 or 1974: Chants et contes de Noël *1972 or 1975: Mélanie *1973 or 1976: C'est pour toi *1975 or 1978: Incognito *1991: Dion chante Plamondon *1995: D'eux *1998: S'il suffisait d'aimer *2003: 1 fille & 4 types *2007: D'elles *2012: Sans attendre English-language studio albums *1990: Unison *1992: Celine Dion *1993: The Colour of My Love *1996: Falling into You *1997: Let's Talk About Love *1998: These Are Special Times *2002: A New Day Has Come *2003: One Heart *2004: Miracle *2007: Taking Chances *2013: Loved Me Back to Life ==References== == Other websites == * operated by Sony Music Canada * Celine Dion YouTube Channel * * Celine Dion at WN *[ Celine Dion] at Allmusic * Celine Dion at Billboard.com * * FAO Goodwill Ambassador website Category:1968 births Category:Living people Category:Canadian pop singers Category:Canadian child singers Category:Eurovision Song Contest winners Category:Musicians from Quebec",
 "title": "Céline Dion"
}