{
 "id": "143123",
 "text": "Inner Mongolia (Mongolian: , Öbür mongul; ; occasionally romanized to Nei Mongol) is the Mongol autonomous region of the People's Republic of China in East Asia and lies in the north of the country. Inner Mongolia borders, from east to west, the provinces of Heilongjiang, Jilin, Liaoning, Hebei, Shanxi, Shaanxi, Ningxia Hui Autonomous Region, and Gansu, while to the north it borders Mongolia (Also known as Mongolia proper) and the Siberia region of Russia. It is the third-largest subdivision of China spanning almost 300 million acres or 12% of China's land area. It has a population of about 24 million. The capital is Hohhot. The majority of the population in the region are Han Chinese, with a large Mongol minority. The official languages are Standard Mandarin and Mongolian, the latter written in the classical alphabet. == Name == In Chinese, the region is known as \"Inner Mongolia\", where the terms of \"Inner/Outer\" come from Manchu dorgi/tulergi. Inner Mongolia is distinct from Outer Mongolia, which was a term used by the Republic of China and previous governments to refer to what is now the independent state of Mongolia plus the Republic of Tuva in Russia. In Mongolian, the region is known as öbör mongγol where öbör can mean south, inner, front, bosom, breast. == Demography == Han Chinese are the largest ethnic group, about 80% of the population. Mongols are the second largest ethnic group, about 17% of the population. There are more Mongols living in Inner Mongolia than in the independent nation of Outer Mongolia. Ethnic groups in Inner Mongolia, 2000 censusDepartment of Population, Social, Science and Technology Statistics of the National Bureau of Statistics of China (国家统计局人口和社会科技统计司) and Department of Economic Development of the State Ethnic Affairs Commission of China (国家民族事务委员会经济发展司), eds. Tabulation on Nationalities of 2000 Population Census of China (《2000年人口普查中国民族人口资料》). 2 vols. Beijing: Nationalities Publishing House (民族出版社), 2003. () Ethnic groups in Inner Mongolia, 2000 censusDepartment of Population, Social, Science and Technology Statistics of the National Bureau of Statistics of China (国家统计局人口和社会科技统计司) and Department of Economic Development of the State Ethnic Affairs Commission of China (国家民族事务委员会经济发展司), eds. Tabulation on Nationalities of 2000 Population Census of China (《2000年人口普查中国民族人口资料》). 2 vols. Beijing: Nationalities Publishing House (民族出版社), 2003. () Ethnic groups in Inner Mongolia, 2000 censusDepartment of Population, Social, Science and Technology Statistics of the National Bureau of Statistics of China (国家统计局人口和社会科技统计司) and Department of Economic Development of the State Ethnic Affairs Commission of China (国家民族事务委员会经济发展司), eds. Tabulation on Nationalities of 2000 Population Census of China (《2000年人口普查中国民族人口资料》). 2 vols. Beijing: Nationalities Publishing House (民族出版社), 2003. () Nationality Population Percentage Han Chinese 18,465,586 79.17% Mongol 3,995,349 17.13% Manchu 499,911 2.14% Hui 209,850 0.900% Daur 77,188 0.331% Evenks 26,201 0.112% Koreans 21,859 0.094% Russians 5,020 0.022% Excludes members of the People's Liberation Army in active service. == Tourism == In the capital city Hohhot: * Dazhao Temple is a Lamaist temple built in 1580. Dazhao Temple is known for three sites: a statue of Buddha made from silver, elaborate carvings of dragons, and murals. * Xiaozhao Temple, also known as Chongfu temple, is a Lamaist temple built in 1697 and favoured by the Qing Dynasty emperor Kangxi. * Xilituzhao Temple is the largest Lamaist temple in the Höhhot area, and once the center of power of Lamaism in the region. * Zhaojun Tomb is the tomb of Wang Zhaojun, a Han Dynasty palace lady-in-waiting who became the consort of a Xiongnu ruler. Elsewhere in Inner Mongolia: * The Mausoleum of Genghis Khan, the cenotaph of Genghis Khan, is located in Ordos City. * Bashang Grasslands, on the border close to Beijing, is a popular retreat for urban residents wanting to get a taste of grasslands life. * The Arshihaty Stone Forest/Hexigten UNESCO Geo Park, has magnificent granite rock formations formed from natural erosion. * Xiangshawan, or \"singing sands gorge,\" is located in the Gobi Desert and contains numerous tourist attractions including sand sledding and camel rides. * Five-pagoda Temple in the capital of Inner Mongolia Hohhot. It is also called Jingangzuo Dagoba, used to be one building of the Cideng Temple. == Notes and references == == Other websites == * Inner Mongolia Government website * Li Narangoa: The Commercialization of a Tamed Ethnicity * Southern Mongolian Human Rights Information Center",
 "title": "Inner Mongolia"
}