{
 "id": "143180",
 "text": "Martin Carthy MBE, is an English folk singer and guitarist. He was one of the first performers in the renewed interest in British folk music in the 1960s. He has inspired other musicians such as Bob Dylan, Paul Simon and Richard Thompson. He is seen as one of the most important people in English folk music. == Early life == Martin Carthy was born in Hatfield on 21 May 1941. He grew up in Hampstead, North London. After he left school he had a number of jobs. He worked behind the scenes at the open air theatre at Regent's Park as a prompter (helping actors who forgot their words). He later worked as an assistant stage manager (ASM) on a tour of The Merry Widow. He then worked at Theatre in the Round in Scarborough. He then sang in coffee bars. He became a resident (regular act) at The Troubadour Folk Club in Earls Court in the early 1960s. He joined Redd Sullivan's \"Thameside Four\" in 1961. He is a famous solo performer of traditional songs. He has a very special individual style of guitar playing on his old Martin Guitar. He uses different ways of tuning his guitar. He has a strongly percussive (drum like) picking style that brings out the melody. His first album, Martin Carthy, was released in 1965. It had Dave Swarbrick playing fiddle playing on some songs, although he was not named on the album cover. Carthy's way of playing the traditional song Scarborough Fair was used by Paul Simon on the Simon and Garfunkel album Parsley Sage Rosemary and Thyme in 1966. Simon did not admit that he had used Carthy's version. == Working with others == Carthy has also worked with many other musicians. He has sung with The Watersons since 1972. He been a member of the UK electric folk group Steeleye Span at two different times. He was a member of the famous Albion Country Band 1973 line-up. This had members from the band Fairport Convention and John Kirkpatrick. This group recorded the original and important album Battle of the Field. Carthy was part of the new and different band Brass Monkey which mixed brass instruments, Carthy's guitar and mandolin and John Kirkpatrick's accordion, melodeon and concertina. For many years Carthy has enjoyed a creating music with fiddle player Dave Swarbrick. He has also worked with his partner Norma Waterson and their daughter Eliza Carthy in a group called Waterson:Carthy. In June 1998 he was made an MBE in the Queen's Birthday Honours. He was named Folk Singer of the Year at the BBC Radio 2 Folk Awards in 2002 and again in 2005. In 2005 he also won the award for Best Traditional Track for 'Famous Flower of Serving Men'. In the 2007 Folk Awards Martin Carthy and Dave Swarbrick won \"Best duo\". == Recordings == ; Original / Studio albums (solo or with Dave Swarbrick) * Martin Carthy (1965) with Dave Swarbrick * Martin Carthy's Second Album (1966) with Dave Swarbrick * Byker Hill (1967) with Dave Swarbrick * But Two Came By (1968) with Dave Swarbrick * Prince Heathen (1969) with Dave Swarbrick * Because It's There (1971) * Crown of Horn (1971) * Out of the Cut (1971) * Sweet Wivelsfield (1971) * Shearwater (1972 reissue with extra tracks 2005) * Landfall (1972) * Right of Passage (1988) * Life and Limb (1990) with Dave Swarbrick * Skin and Bone (1992) with Dave Swarbrick * Signs of Life (1998) * Waiting for Angels (2004) * Straws in the Wind (2006) with Dave Swarbrick ; Collections and live albums: * Selections (1969) New Zealand and Australia only * This Is... Martin Carthy: The Bonny Black Hare and other songs (1971) with Dave Swarbrick * Selections (1971) with Dave Swarbrick * Round Up (circa early 1970s) with Dave Swarbrick * Brigg Fair (circa early 1970s) with Dave Swarbrick * Tales of Long Ago (circa early 1970s) with Dave Swarbrick * The Collection (1993) * Rigs of the Time (1993) * The Kershaw Sessions (1994) * A Collection (1999) * Both Ears and the Tail (2000, live recording from 1966) with Dave Swarbrick * The Carthy Chronicles (2001) 4x CD 83 track box set * The Definitive Collection (2003) * Martin Carthy at Ruskin Mill (2005) ; Releases on other formats: * No Songs (7\" vinyl EP 1967) with Dave Swarbrick * \"The Bonny Lass of Angelsey\" b/w \"Palaces of Gold\" (7\" vinyl single 1976) * 100 Not Out (Longform video 1992) with Dave Swarbrick * British Fingerstyle Guitar (Longform video 1993 reissued on DVD 2006) * Guitar Maestros (DVD 2006) ; As a member of the group Steeleye Span: * Please to See the King (1971) * Ten Man Mop (1971) * Storm Force Ten (1977) * Live at Last! (1978) * The Journey (1999) ; As a member of The Watersons and/or Waterson:Carthy * The Watersons: For Pence and Spicy Ale (1975) * The Watersons: Sound, Sound Your Instruments of Joy (1977) * The Watersons: Green Fields (1981) * Waterson:Carthy: Waterson:Carthy (1994) * Waterson:Carthy: Common Tongue (1996) * Waterson:Carthy: Broken Ground (1999) * Waterson:Carthy: A Dark Light (2002) * The Watersons: The Definitive Collection (2003) * Waterson:Carthy: Fishes & Fine Yellow Sand (2004) * The Watersons: Mighty River of Song (2004) 4x CD & 1x DVD box set of Watersons and related recordings * The Watersons: A Yorkshire Christmas (2005) * Waterson:Carthy: The Definitive Collection (2005) * Waterson:Carthy: Holy Heathens and the Old Green Man (2006) ; As a member of the group Brass Monkey: * Brass Monkey (1984) * See How It Runs (1986) * The Complete Brass Monkey (1993) compilation of the previous two albums * Sound and Rumour (1999) * Going and Staying (2001) * Flame of Fire (2004) * The Definitive Collection (2005) ; As a member of group Blue Murder: * No One Stands Alone (2002) ; Other important recordings: * Thamesiders & Davy Graham (1963) 7\" EP * Three City Four: Three City Four (1965) * Dave Swarbrick, Martin Carthy & Diz Disley: Rags Reel & Airs (1966) * Various Artists: Bright Phoebus: Songs by Lal & Mike Waterson (1972) * Albion Country Band: Battle Of The Field (1976) * John Kirkpatrick: Plain Capers (1976) * Albion Country Band: Larkrise To Candleford (1980) * Band of Hope: Rhythm And Reds (1994) * Wood, Wilson, Carthy: Wood, Wilson, Carthy (1998) * Dave Swarbrick: Swarb! (2003) 4CD box set career retrospective with numerous Carthy tracks * 4 Martins: Guitar Nights (2003) released on CD and DVD == Other websites == * Waterson:Carthy Official Website * Martin Carthy biography on the Waterson:Carthy website * Reinhard Zierke's unofficial website * John Crosby's 1993 Martin Carthy biography on Reinhard Zierke's website * BBC Folk database * discography on Slipcue e-zine Category:1941 births Category:Living people Category:British folk musicians Category:English singers",
 "title": "Martin Carthy"
}