{
 "id": "143293",
 "text": "In grammar, case changes what a noun, adjective or pronoun does in a sentence. It is a set of forms which depend on the syntax (how the words go together). Case is an example of inflection, which is often an affix, a part of a word that is added to other words, that signals a grammatical relationship. Long ago, Old English used several cases, but Modern English does not normally use cases except for in pronouns. == History of case == In Latin, nouns pack several ideas into one word: *Gender: nouns must be masculine (Latin: ends in -us), feminine (ends in -a) or neutral (ends in -um). Also, adjectives must agree with the nouns by changing their endings. English is one of the few European languages that does not usually have gender for nouns. *Case: nominative (subject), vocative (direct speech), accusative (object), genitive (of the noun), dative (to or for the noun), ablative (by, with, or from the noun). **The locative (at the noun) is a rare case form for some specific nouns. In many languages like Latin, German, Russian, Korean and Japanese, a noun's case changes the end of a word depending on the noun's role in the sentence. Nouns change their endings to show that they are doing something, something is done to them, they just happen to be there during the action, or they own something. Therefore, word order in those languages is less important than in English in which word order often affects a sentence's meaning. == Modern English == In Modern English, case is not used much. Instead, word order and auxiliary verbs (helpers) are more important. :\"The most important grammatical development [in English] was the establishment of a fixed pattern of word-order to express the relationship between clause elements\".Crystal, David 1995. The Cambridge encyclopedia of the English language. Cambridge University Press.p44 English has these cases for nouns and pronouns: common case and genitive (possessive).p202 Each may take a plural: *Nouns: Girl; girls; girl's; girls'. The last three cannot be distinguished in speech except by the context. *Pronouns: This is your hat; this hat is yours. A few pronouns have three cases and four forms: I (subject), me (object), my (genitive before noun), mine (independent genitive). English adjectives are unchanged: red hat, red hats. == References == Category:Linguistics Category:Grammar",
 "title": "Case (grammar)"
}