{
 "id": "143263",
 "text": "Imran Ahmed Khan Niazi () (born 5 October 1952) is a Pakistani politician, cricketer, and philanthropist. He was the 22nd Prime Minister of Pakistan from 2018 to 2022 and was the Founder and Chairman of the Pakistan Tehreek-e-Insaf from 1996 to 2023. Khan was born in Lahore and went to Aitchison College. He began having a skill for cricket in his school years. He started his cricket career in 1968 and played for international cricket for two decades in the late 20th century. He became captain for the Pakistan team in 1982, and led the victory in the 1992 World Cup. He created the Shaukat Khanum Memorial Cancer Hospital in 1994 as part of his philanthropy. He entered politics in 1996 by creating the Pakistan Tehreek-e-Insaf and was elected Prime Minister of Pakistan in 2018. As Prime Minister, he handled COVID-1 9 in Pakistan and launched welfare programs. He was removed from office in 2022. After being Prime Minister, he survived an assassination attempt, was arrested in 2023, and has been kept in prison on several charges. == Early life == He was born in Lahore on 5 October 1952. but some reports say he was born on 25 November 1952, and he has said that this is a mistake from his passport. He had four sisters and no brothers. His father was Ikramullah Khan Niazi, a civil engineer, and his mother was Shaukat Khanum. Khan was a quiet and shy boy when he was young, and grew up with his sisters in an upper middle-class situation. He went to school at the Aitchison College and Cathedral School in Lahore. In September 1971, Khan went to the Royal Grammar School Worcester in England, where he was skilled at cricket. ==Cricket career== Khan started his career as a first-class cricketer in Lahore in 1968. During his studies at the University of Oxford, he also played for their Blue's Cricket team. In 1971, he played his first international test match for Pakistan against England. In 1974, he played his first One-day international against England. He also became the second fastest all-rounder to reach the mark of 3000 runs and 300 wickets. He also has the second best batting average in test cricket at position 6. Khan became the captain of Pakistan side in 1982, becoming one of the most successful captains with 91 wins in tests and ODIs. In 1992, he led the Pakistan cricket team to victory at the world cup. His leadership as captain of the winning Pakistan team and the picture of him holding the world cup trophy for Pakistan was called “inspirational”. == Charity work == In 1991, he created the Shaukat Khanum Memorial Trust in memory of his mother, who died of cancer. In 1994, he built a cancer hospital called the Shaukat Khanum Memorial Cancer Hospital and Research Centre in Lahore to help thousands of cancer patients, it was Pakistan’s first cancer hospital. After this, he built another cancer hospital in Peshawar, and a third one in Karachi. ==Political career== === Early Career === Khan became a politician in 1996 by founding his political party Pakistan Tehreek-e-Insaf (PTI) in 1996. He supported president Pervez Musharraf from 1999. In 2007, he changed his view and then opposed Musharraf. === Prime Minister of Pakistan === On July 26, 2018, Khan was elected Prime Minister despite some opposition parties accusing Khan's campaign of rigging the election. Khan took oath as Prime Minister of Pakistan on 18 August 2018. As Prime Minister of Pakistan, Khan started an anti-corruption campaign and improved security. His government rebuilt minority religious sites. He also focused on education, improved health and began large welfare programs. The biggest welfare programs he launched were the Ehsaas Programme and Sehat Sahulat Program. His government also created the Zainab Alert Bill to increase the safety of women and children in Pakistan. He began the Plant for Pakistan project to help the environment. He also handled the COVID-19 Pandemic and helped revive the economy. While Khan was the prime minister, the collection of tax rose, austerity measures were taken and a worldwide economic recession due to COVID-19 happened. On April 3, 2022, he told President Arif Alvi to dissolve the National Assembly after a no-confidence motion against him failed. However, four days later on April 7, the Supreme Court later said what Khan did was illegal. A motion of no confidence was soon passed against Khan on April 10, 2022 becoming the first prime minister in Pakistan to be removed from office by a vote of no confidence. === After Being Prime Minister === On November 3, 2022, in Wazirabad, Punjab, Khan was shot while giving a speech, but he survived the assassination attempt. On May 9, 2023 Imran Khan was arrested for alleged corruption at the High Court in Islamabad. On January 30, 2024, he was sentenced to 10 years in prison for revealing state secrets. == References == === Footnotes === Category:1952 births Category:Living people Category:Assassination survivors Category:Pakistani cricketers Category:Politicians from Lahore Category:Prime ministers of Pakistan Category:Sportspeople from Lahore",
 "title": "Imran Khan"
}