{
 "id": "143398",
 "text": "White supremacy is the belief that white people are better than all other races. The words \"white supremacy\" are sometimes used to describe a political idea that shows the social and political dominance of whites. White supremacy is a form of racism. It is not to be confused with different political and moral differences that people of any race may hold. White supremacists also want racial separation, which means people of different races living apart. White supremacy has often caused anti-black racism and antisemitism (Anti- Jewish hate). Native Americans, Asians, multiracial people, Middle Eastern people, Muslims, mestizo or indigenous Mexicans, non-white Latinos and LGBTQ+ people are also hurt by white supremacists. The different groups who are in favour of white supremacy do not agree on who is white. They do not agree on which group is their worst enemy. White supremacists often think that Jews are the biggest danger to their cause. They think Jews are able to hide inside society more easily than other ethnic groups. ==History== Politically, socially and economically, white supremacy was common in the United States before the American Civil War and for many years after. This is also true for white supremacist regimes in South Africa and Rhodesia and of parts of Europe at different time periods. White supremacy was very important for Nazi Germany's Third Reich. How much white supremacy has influenced Western culture is still being argued about. The ways it has changed how society works are still being studied. In some parts of the United States, many people who were thought to be non-white could not vote and were not allowed to be part of the government. They were also not allowed to work in most government jobs. They were still not allowed to do this, even into the second half of the 20th century. White leaders in places like the United States and Australia often thought that Native Americans and Indigenous Australians kept society from going forward. They did not think of them as people who lived there in their own right. Many European-settled countries that are on the Pacific Ocean limited immigration from Asian and Pacific countries. Many U.S. states banned marriage between races, through \"anti-miscegenation laws\" until 1967, when these laws were changed. South Africa had a white supremacist regime, called Apartheid, until 1994. Rhodesia had a white supremacist regime until 1980. White supremacists have become linked with a racist part of the skinhead subculture. When the skinhead subculture first began in the United Kingdom in the late 1960s, it was mostly influenced by the Jamaican rude boys and British mods. But by the 1980s, a big white supremacist skinhead faction had formed. ==White supremacist movements and ideas== White supremacist groups can be found in most countries and regions with a large white population, including North America, Europe, Australia, New Zealand. They can also be found in areas where most people are not white, such as South Africa and Latin America. In all of these areas, their views are held by only a small part of the population. The number of people who are active in the groups is quite small. The militant (very forceful) approach taken by white supremacist groups has caused them to be watched closely by governments and police. Many of the things that white supremacists say can get some people to hurt or kill other people. This is called hate speech. Some countries have laws against hate speech. Some countries also have laws that stop or limit some white supremacist organizations. However, white supremacist groups are very different from each other. This means that it is hard to stop them all. ===Religious movements=== The Christian Identity movement, which is regarded by most other Christians as heretical is closely tied to white supremacy. The Ku Klux Klan's reasons for wanting racial segregation are not mainly based on religious ideas. But the Klan uses Christian symbols like a cross on fire in order to put fear in their victims. The Klan persecuted Catholics.Some white supremacists say that they follow the Odinist religion. Most Odinists do not accept white supremacy. White supremacists make up only a small part of those who support Odinism (belief in the gods of Norse mythology). Some white supremacist groups, such as the South African Boeremag, put parts of Christianity and Odinism together. The World Church of the Creator, now called the Creativity Movement, backs a racist religion called Creativity. The religion's purpose is 'a racial holy war\" and \"a bright and beautiful new world.\" This new world will come through a special \"holy war\" that they call \"RAHOWA\" (RAcial HOly WAr). They think that members of the white race must take steps to save their white race. They believe that all races are at war with each other for land and natural resources. They say that their war is a religious war. ==Related pages== * Apartheid, a system of rule by white people in South Africa * Master race, the belief that one race is or ought to be dominant * Antisemitism, racial and religious discrimination against Jews, especially by white supremacists * Anti-Mexican sentiment, many white supremacists are against mestizo and Indigenous Mexican immigration to the United States * Black supremacy * Racism * Racial discrimination == Footnotes == ==Further reading== * Dobratz, Betty A. and Shanks-Meile, Stephanie. \"White power, white pride!\": The white separatist movement in the United States (Twayne Publishers, NY, 1997). * Lincoln Rockwell, George. White Power (John McLaughlin, 1996). ==Other websites== *\"White Power\" by George Lincoln Rockwell *Anti-Defamation League article on white power music Category:Racism",
 "title": "White supremacy"
}