{
 "id": "143434",
 "text": "The M postcode area, also known as the Manchester postcode area,Royal Mail Address Management Guide Edition 4, (2004) is a group of lots of postal districts in Greater Manchester, England. The code covers three places: Manchester, Salford, and Sale. It covers parts of all Greater Manchester boroughs except for Stockport. All of Manchester is covered by the code, except for a small village called Ringway, which is in the WA postcode area. The postcode also includes nearly all of Salford and most of the borough of Trafford. ==Coverage== The code covers these districts: Postal district Post town Coverage Local authority M1 MANCHESTER Manchester central Manchester M2 MANCHESTER Manchester central Manchester M3 (Sectors 1, 2, 3, 4 and 9) MANCHESTER Manchester central Manchester M3 (Sectors 5, 6 and 7) SALFORD Salford Quays Salford M4 MANCHESTER Manchester central Manchester M5 SALFORD Seedley, Weaste Salford M6 SALFORD Claremont, Irlams O' Th' Height Salford M7 SALFORD Higher Broughton, Cheetwood Salford, Manchester M8 MANCHESTER Crumpsall, Cheetham Hill Manchester M9 MANCHESTER Harpurhey, Blackley Manchester M10 MANCHESTER Newton Heath Manchester M11 MANCHESTER Clayton, Openshaw Manchester M12 MANCHESTER Ardwick, Longsight, West Gorton Manchester M13 MANCHESTER Longsight Manchester M14 MANCHESTER Fallowfield, Moss Side, Ladybarn, Rusholme Manchester M15 MANCHESTER Hulme, Manchester Science Park Manchester M16 MANCHESTER Firswood, Moss Side, Old Trafford, Whalley Range Trafford, Manchester M17 MANCHESTER Trafford Park, The Trafford Centre Trafford M18 MANCHESTER Abbey Hey, Gorton Manchester M19 MANCHESTER Levenshulme, Burnage Manchester M20 MANCHESTER Didsbury, Withington Manchester M21 MANCHESTER Chorlton Cum Hardy, Firswood Manchester M22 MANCHESTER Wythenshawe, Northenden, Sharston Industrial Area Manchester M23 MANCHESTER Baguley, Roundthorn Industrial Estate Manchester M24 MANCHESTER Middleton, Alkrington Rochdale M25 MANCHESTER Prestwich Bury M26 MANCHESTER Radcliffe, Stoneclough Bury, Bolton M27 MANCHESTER Swinton, Clifton, Pendlebury, Wardley Salford M28 MANCHESTER Worsley, Walkden, Mosley Common, Wardley Industrial Estate Manchester, Salford M29 MANCHESTER Tyldesley, Astley Wigan M30 MANCHESTER Eccles Salford M31 MANCHESTER Carrington, Partington Trafford M32 MANCHESTER Stretford Trafford M33 SALE Sale, Brooklands Trafford M34 MANCHESTER Denton, Audenshaw Tameside M35 MANCHESTER Failsworth, Castle Industrial Estate Oldham M38 MANCHESTER Little Hulton Salford M40 MANCHESTER Collyhurst, Miles Platting, Moston, New Moston, Newton Heath Manchester M41 MANCHESTER Urmston Trafford M43 MANCHESTER Droylsden Tameside M44 MANCHESTER Irlam, Cadishead Trafford M45 MANCHESTER Whitefield Bury M46 MANCHESTER Atherton Wigan M50 SALFORD Salford Quays Salford M60 (Sectors 1 and 7) MANCHESTER Large user and PO Box (located geographically in M1) Manchester M60 (Sectors 2 and 8) MANCHESTER Large user and PO Box (located geographically in M2) Manchester M60 (Sectors 3 and 9) MANCHESTER Large user and PO Box (located geographically in M3) Manchester M60 (Sectors 4 and 0) MANCHESTER Large user and PO Box (located geographically in M4) Manchester M60 (Sectors 5 and 6) MANCHESTER Manchester X Manchester M60 (part of sector 9 only, i.e. M3) SALFORD Large user and PO Box Salford M90 MANCHESTER Manchester Airport Manchester M99 MANCHESTER Manchester X; JD Williams (located geographically in M1 and M3) Manchester ==References== ==Other websites== *Map of postcodes of Greater Manchester Category:Greater Manchester Category:Postal codes",
 "title": "M postcode area"
}