{
 "id": "143478",
 "text": "Princess Alice (25 April 1843 – 14 December 1878) was Grand Duchess of Hesse and by Rhine from 1877 until her death in 1878 as the wife of Grand Duke Louis IV. She was the third child and second daughter of Queen Victoria of the United Kingdom and Prince Albert of Saxe-Coburg and Gotha. She was the sister of Edward VII of the United Kingdom and German Empress Victoria and the mother of Alexandra Feodorovna of Russia. == Biography == === Early life === Alice was born on April 25, 1843 as Alice Maud Mary at Buckingham Palace in London.Packard, p. 25 Alice's birth prompted her parents to find a larger family home. In 1844, her parents purchased Osborne House on the Isle of Wight as a family holiday home. At Osborne, Alice and her siblings were taught skills such as housekeeping, cooking, gardening and carpentry, as well as daily lessons in learning English, French and German.Van der Kiste, p. 22 Alice was said to be fascinated with the world outside at Balmoral, where she visited the tenants living and working on the estate.Packard, p. 64 In 1854, during the Crimean War, Alice visited hospitals in London for wounded soldiers with her mother and her older sister.Van der Kiste, p. 28 === Marriage === Alice was engaged to Prince Louis of Hesse on April 30, 1861. On July 1, 1862, Alice and Louis got married in a private ceremony in the dining room of Osborne House. === Illness and death === On December 14, the 17th anniversary of her father's death, Alice became seriously ill with the diphtheria that she caught from her son. She died in the early morning hours, she was 35 years old.Packard, p. 167 Alice was buried on 18 December 1878 at the Grand Ducal mausoleum at Rosenhöhe outside Darmstadt.Noel, p. 241 == Honours == * 1 January 1878: Companion of the Order of the Crown of India * 26 June 1871: Cross of Merit for Women and Girls * Dame of the Order of Louise, 1st Division * 1864: Grand Cross of the Imperial Order of Saint Catherine == Issue == Name Birth Death Ref(s). Victoria Alberta Elisabeth Mathilde Marie 5 April 1863 24 September 1950 Elisabeth Alexandra Luise Alix 1 November 1864 18 July 1918 † Irene Louise Marie Anne 11 July 1866 11 November 1953 Mager, p. 27 Ernest Louis Charles Albert William 25 November 1868 9 October 1937 Friedrich William Augustus Victor Leopold Louis 7 October 1870 29 May 1873 Mager, pp. 45-46 Alix Viktoria Helene Luise Beatrix 6 June 1872 17 July 1918 † Marie Victoria Feodore Leopoldine 24 May 1874 16 November 1878 == References == Category:1843 births Category:1878 deaths Category:House of Saxe-Coburg and Gotha Category:19th-century British people Category:British princesses",
 "title": "Princess Alice of the United Kingdom"
}