{
 "id": "143449",
 "text": "Princess Louise, Duchess of Argyll (Louisa Caroline Alberta; 18 March 1848 – 3 December 1939) was the sixth child and fourth daughter of Queen Victoria and Prince Albert. As the wife of Governor General John Campbell, she was the Viceregal consort of Canada from 1878 to 1883. ==Biography== === Early life === Louise was born at Buckingham Palace, the main British royal home in London. Her mother was Queen Victoria, and her father was Prince Albert of Saxe-Coburg and Gotha. Louise spent much of her early life moving between the different royal homes that her parents stayed in. These included Buckingham Palace; Osborne House on the Isle of Wight; Windsor Castle in Berkshire; and Balmoral Castle in Scotland. Louise's education was similar to her brothers and sisters. She was given a basic education, as well as tasks such as cookery, carpentry and farming. She was good at art, especially sculpture. Hallam Tennyson, son of the poet Alfred Lord Tennyson, wrote that Louise could \"draw beautifully\". She was also good at acting and dancing. The Queen wrote that Louise \"danced the sword dance with more verve and accuracy than any of her sisters\". She wanted to know about a lot of things, which gave her the nickname \"Little Miss Why\" from members of the royal family. === Death of Prince Albert === Louise's father, Prince Albert, became ill with typhoid fever, and died on 14 December 1861. Queen Victoria was very sad after this happened, as she and Albert were a loving couple. While the Queen mourned, the court became morbid, and Louise quickly became fed up with it. On her 17th birthday, she asked if the ballroom could be opened for a dance, but Queen Victoria refused. Louise's irritation, in turn, irritated the Queen, who did not like Louise's arguments. The Queen never really got over Albert's death, but she made herself feel better by sticking to Albert's plans for her children's marriages. In 1862, Louise's sister, Princess Alice, married Prince Louis of Hesse; in 1863, Albert Edward, Prince of Wales married Princess Alexandra of Denmark; and in 1866, Princess Helena married Prince Christian of Schleswig-Holstein. With Louise's elder sisters now married, Louise was left to be the Queen's helper. Despite not being happy about it, the Queen agreed with this, and was surprised by the results. The Queen wrote: \"She is (and who would some years ago have thought it?) a clever dear girl with a fine strong character, unselfish and affectionate.\" In her new role, Louise was less bored by the court, because she had more things to do. === Titles and styles === *18 March 1848 – 21 March 1871 Her Royal Highness The Princess Louise. *21 March 1871 – 24 April 1900 Her Royal Highness The Princess Louise, Marchioness of Lorne. *24 April 1900 – 3 December 1939 Her Royal Highness The Princess Louise, Duchess of Argyll. ==References== *Darling Loosy: Letters to Princess Louise 1856 to 1939 (Weidenfeld & Nicolson, London, 1991) *Wake, Jehanne, Princess Louise: Queen Victoria's unconventional daughter (Collins, London, 1988) ==Other websites== *Stocker, Mark, ‘Louise, Princess, duchess of Argyll (1848–1939)’, Oxford Dictionary of National Biography, Oxford University Press, September 2004; online edition, January 2008. Retrieved on 23 January 2008 Category:1853 births Category:1939 deaths Category:British princesses Category:House of Saxe-Coburg and Gotha Category:British sculptors",
 "title": "Princess Louise, Duchess of Argyll"
}