{
 "id": "143854",
 "text": "George Andrew Romero (February 4, 1940 - July 16, 2017) was an American- Canadian director, writer, editor and actor. He is known for his horror movies with zombie themes. ==Life and work == Romero was born in the Bronx, New York City to a Cuban-American father of Spanish ancestry and a Lithuanian-American mother.The GENRE ONLINE.NET Interview - Writer and Director George A. Romero Romero went to Pittsburgh's Carnegie Mellon University. After graduating in 1960, he started directing short movies and commercials before moving onto horror movies. He and friends started a directing group called Image Ten Productions in the 1960s, and they made Night of the Living Dead (1968). The movie was directed by Romero and written with John A. Russo. It became a cult classic. Later, Romero made There's Always Vanilla (1971), Jack's Wife / Season of the Witch (1972) and The Crazies (1973), Martin (1977), and Creepshow (1982). His most well-known movies are Night of the Living Dead and Creepshow. In 1978, Romero made another zombie movie called Dawn of the Dead (1978). The movie made over $55 million and was named one of the top cult movies by Entertainment Weekly in 2003. Romero made a third zombie movie called Day of the Dead (1985), which was less popular. In the 1980s and 1990s, Romero made other movies such as Monkey Shines (1988) (about a killer helper monkey), Two Evil Eyes (1990), The Dark Half (1993) and Bruiser (2000) (about a man whose face becomes a blank mask). In 1998, Romero made a commercial for Resident Evil 2. Universal Studios made a remake of Dawn of the Dead in 2004, without Romero. Romero divorced his wife, Christine Forrest. They have two children together. Romero then married Suzanne Desrocher in 2011. He became a dual American -Canadian citizen in 2009. ==Death== Romero died of lung cancer on July 16, 2017 in Toronto, Ontario at the age of 77.George A. Romero, 'Night of the Living Dead' creator, dies at 77 == Favourite movies == Romero chose his favourite top ten movies of all time as: The Brothers Karamazov, Casablanca, Dr. Strangelove, High Noon, King Solomon's Mines (1950), North by Northwest, The Quiet Man, Repulsion, Touch of Evil, The Tales of Hoffman and Albert Boixadera Xalabarder, the movie. The Tales of Hoffman is Romero's \"favourite film of all time; the movie that made me want to make movies.\"BFI - Sight & Sound Top Ten Poll 2002 == Movies made == # Night of the Living Dead (1968) # There's Always Vanilla (1971) # The Crazies (1973) # Jack's Wife / Season of the Witch (1973) # The Winners (1973, television series) # O. J. Simpson: Juice on the Loose (1974) # Martin (1977) # Dawn of the Dead (1978) # Knightriders (1981) # Creepshow (1982) # Tales from the Darkside (1984, television series) # Day of the Dead (1985) # Monkey Shines (1988) # Two Evil Eyes (1990) # The Dark Half (1993) # Bruiser (2000) # Land of the Dead (2005) # Diary of the Dead (2008) # Island of the Dead (2009) # The Crazies (2010) == Books written == # Dawn of the Dead (with Susan Sparrow; movie tie-in), 1979 # Bizarro! by Tom Savini (foreword), 1984 # Martin (with Susan Sparrow; movie tie-in), 1984 # Book of the Dead edited by John Skipp and Craig Spector (foreword), 1989 # Toe Tags #1-6 (\"The Death of Death\"; DC Comics), 2004–2005 ==Critical studies== * Gagne, Paul R. The Zombies That Ate Pittsburgh: the Films of George A. Romero (New York: Dodd, Mead 1987) * Newman, Kim. Nightmare Movies: A Critical History of the Horror Film 1968-1988 (1988) * Williams, Tony. Knight of the Living Dead: The Cinema of George A. Romero (London: Wallflower Press 2003) ==References== == Other websites == * *Simon Pegg interviews George A. Romero *Homepage of the Dead - Romero Fan Site (information, forums, art gallery and fiction) Category:1940 births Category:2017 deaths Category:Actors from the Bronx Category:American cinematographers Category:American movie actors Category:American movie editors Category:American television directors Category:American television producers Category:Canadian movie actors Category:Canadian movie directors Category:Canadian movie producers Category:Canadian screenwriters Category:Canadian television directors Category:Canadian television producers Category:Cancer deaths in Ontario Category:Deaths from lung cancer Category:Movie directors from New York City Category:Movie producers from New York City Category:Naturalized citizens of Canada Category:Screenwriters from New York City Category:Writers from the Bronx",
 "title": "George A. Romero"
}