{
 "id": "143868",
 "text": "The Sino-Tibetan or Trans-Himalayan languages are a language family spoken in Asia. This includes Chinese and the Tibeto-Burman languages and some 250 other languages of East Asia. Kra-Dai languages and Hmong–Mien languages are also sometimes included. The largest language group within this family are the Chinese languages by far with over 1.3 billion native speakers. It is also the one with the oldest writing (hanzi) going back to the Jiahu symbols in 6600 BC. All these languages descend from a single proto-language. People are still working on what it sounded like. == Origins == Some researchers think the Sino-Tibetan languages very likely came from the Huanghe in North-Central China (Zhongyuan). Others think they came from much further west, in southwest China or even Northeast India. Zhang et al. (2019) did a study of 109 Sino- Tibetan languages to suggest a Sino-Tibetan homeland in northern China near the Huanghe basin. He found there was a split between Sinitic languages and the Tibeto-Burman languages approximately 4,200-7,800 years ago (with an average of 5,900 years ago). This is connected with the expansion of the Yangshao culture and Majiayao culture.Zhang, Meng-han (张梦翰); Yan, Shi (严实); Pan, Wuyun (潘悟云); & Jin, Li (金力). (2019). Phylogenetic evidence for Sino- Tibetan origin in northern China in the Late Neolithic. Nature, 569, 112–115. doi:10.1038/s41586-019-1153-z Others agree by using different data; they say it came from around 7,200 years ago, around the Cishan and early Yangshao culture.Sagart, Laurent, Guillaume Jacques, Yunfan Lai, Robin Ryder, Valentin Thouzeau, Simon J. Greenhill, and Johann-Mattis List (2019): Dated language phylogenies shed light on the history of Sino-Tibetan. PNAS. == Example languages == * Qiang language is spoken in Gansu. It is agglutinative like other Altaic languages. * Balti language (Balti is the biggest Sino Tibetan language in Pakistan. It's speakers number 0.5 million.) * Meitei language (Manipuri language) is the most widely spoken Sino Tibetan language in India. Various other Sino-Tibetan languages are also spoken in Northeast India.) * Tibetan is spoken by around 6 million people. * Burmese is the language of Myanmar and is spoken by around 33 million. == Evolution of language == Proto- Chinese and Proto-Tibeto-Burman had many different prefixes and suffixes. Proto-Chinese changed to Old Chinese around the Shang Dynasty. This is shown in the Book of songs. Nouns, verbs, and modifiers were all dependent on affixes (beginning of words) such as *s-, *p-, *-k. After the Warring State Period in China, Old Chinese started using tones. The suffix (end of words) *-s was also used. The typical word order in Sino-Tibetan languages is object- verb. Modern Chinese, Bai, Karenic, and Mruic are exceptions. SOV is likely the original word order. Over time Chinese became subject–verb–object. However, Chinese differs from almost all other VO languages in the world in placing relative clauses before the nouns they modify. == Relation to other language families == Sino-Tibetan may be related to the Altaic languages. Mang Mulin, a Mongolian linguistics professor at the Inner Mongolia Normal University, began studying the origin of Mongolian words in the late 1970s. There are links between Sino-Tibetan, Austroasiatic (from South China), and Austronesian (from Taiwan) languages. There may even be connections between Chinese and the native languages of the Americas (Na-Dene) and Western Eurasia (Yeniseian). == Related pages == *Chinese language ==References== Category:Sino-Tibetan languages Category:Language families of Pakistan",
 "title": "Sino-Tibetan languages"
}