{
 "id": "143979",
 "text": "A supercomputer is a computer with great speed and memory. This kind of computer can do jobs faster than any other computer of its generation. They are usually thousands of times faster than ordinary personal computers made at that time. Supercomputers can do arithmetic jobs very fast, so they are used for weather forecasting, code-breaking, genetic analysis and other jobs that need many calculations. When new computers of all classes become more powerful, new ordinary computers are made with powers that only supercomputers had in the past, while new supercomputers continue to outclass them. Electrical engineers make supercomputers that link many thousands of microprocessors. == Types == Supercomputer types include: shared memory, distributed memory and array. Supercomputers with shared memory are developed by using a parallel computing and pipelining concept. Supercomputers with distributed memory consist of many (about 100~10000) nodes. CRAY series of CRAYRESERCH and VP 2400/40, NEC의 SX-3 of HUCIS are shared memory types. nCube 3, iPSC/860, AP 1000, NCR 3700, Paragon XP/S, CM-5 are distributed memory types. An array type computer named ILIAC started working in 1972. Later, the CF-11, CM-2, and the Mas Par MP-2 (which is also an array type) were developed. Supercomputers that use a physically separated memory as one shared memory include the T3D, KSR1, and Tera Computer. === Supercomputing centers, organizations === Organizations * DEISA Distributed European Infrastructure for Supercomputing Applications, a facility integrating eleven European supercomputing centers. * NAREGI Japanese NAtional REsearch Grid Initiative involving several supercomputer centers * TeraGrid , a national facility integrating nine US supercomputing centers Centers * BSC Barcelona Supercomputing Center - Spanish national supercomputing facility and R&D; center * CESCA Supercomputing Centre of Catalonia - Centre de Supercomputacio de Catalunya * CESGA Galicia Supercomputing Center - Centro de Supercomputación de Galicia * CeSViMa Supercomputing and Visualization Center of Madrid * CINECA CINECA Interuniversity Consortium, Italy * CINES Centre Informatique National de l'Enseignement Superieur, France * CSAR UK national supercomputer service operated by Manchester Computing * EPCC Edinburgh Parallel Computing Centre. Based in the University of Edinburgh. * GSIC Global Scientific Information and Computing Center at the Tokyo Institute of Technology * HECToR UK national supercomputer service provided by a consortium of EPCC, Cray and Numerical Algorithms Group (NAG) * HPCx UK national supercomputer service operated by EPCC and Daresbury Lab * IRB * Minnesota Supercomputer Institute (Formerly Minnesota Supercomputer Center) operated by University of Minnesota * NASA Advanced Supercomputing facility * National Center for Atmospheric Research (NCAR) * National Center for Supercomputing Applications (NCSA) * National Energy Research Scientific Computing Center (NERSC) * Ohio Supercomputer Center (OSC) * Pittsburgh Supercomputing Center operated by University of Pittsburgh and Carnegie Mellon University. * San Diego Supercomputer Center (SDSC) * SARA (Stichting Academisch Rekencentrum Amsterdam), Amsterdam, The Netherlands * System X at Virginia Tech * Texas Advanced Computing Center (TACC) * DCSC Danish Centre for Scientific Computing. Based at the University of Copenhagen. * PSNC (Poznan Supercomputing and Networking Center), Poznan, Poland * NSC National Supercomputer Centre in Sweden at Linköping University, Sweden === Specific machines, general-purpose === * Linux NetworX press release: Linux NetworX to build \"largest\" Linux supercomputer * ASCI White press release * MCR @ LLNL Linux NetworX Supermicro based Supercomputer \"3rd largest supercomputer in 2004\" * Article about Japanese \"Earth Simulator\" computer * \"Earth Simulator\" website (in English) * NEC high-performance computing information * Superconducting Supercomputer * Blue Waters Petascale Computing System === Specific machines, special-purpose === * Papers on the GRAPE special-purpose computer * More special-purpose supercomputer information * Information about the APEmille special-purpose computer * Information about the apeNEXT special- purpose computer * Information about the QCDOC project, machines ==Related pages== * Cluster (computing) * Grid computing Category:Computers",
 "title": "Supercomputer"
}