{
 "id": "143948",
 "text": "Balti (بلتی) is Tibetic language spoken in the Baltistan region of Gilgit Baltistan in northeastern Pakistan occupied Kashmir and a few neighboring villages of the territory of Indian Kashmir. The language is an archaic dialect of the Tibetan language, but many of the consonants of Classical Tibetan that are silent in most modern Tibetan dialects are pronounced in Balti. == History & People == Greeks used the word Byaltae instead of Bal-ti, which in Tibetan means water gorge. The historian Ptolemy who was also a general in the army of Alexander the Great had named the region (Byaltae) in his book. Baltistan is the Persian translation of the native term Baltiyul meaning “The Homeland of Balti”. The people belonging to Balti nationality are settled on both banks of the river Indus from Turtuk (in the east) to Haramosh (in the west) and from Karakoram range (in the north) to Deosai plains (in the south). Majority of Balti language speakers are of Tibetan origin. However people from Indus Plains (Monpa's) and Central Asia (Horpa's) migrated to this area in different periods of ancient times, on account of different reasons and after merging in the prevailing Tibetan society, they also speak the Balti language, which is a branch of the ancient Tibetan language. Small pockets of Brokskat, Purgi, Changthang and Ladakhi also exist in Baltistan. The Balti people are a very forbearing, cheerful, brave and hospitable people. They ruled the area of Ladakh and Western Tibet under the Makpon reign (from 12th century to 1840 A.D.). There are several Balti communities in Pakistan's urban areas farther south, that is in Lahore, Islamabad, in Karachi and other places. == Evolution == The Balti language has kept many honorific words like all other Tibetan dialects and many other languages. Below are a few examples: Ordinary Balti Honorific Ladakhi Meaning Baba Father Zizi Mother Kacho Brother (elder) Zung Wife Jangmocho Maternal uncle Nenecho Aunt Bucho Son Nono Boy Apocho Grandfather Apicho Grandmother Ashcho Sister (elder) bjes Eat bjes Drink Shokhs Come Kasal-byung Speak/Say gZim tong Sleep (go to) Phyaq-laq/g Hand/Arm Yang/Yari-phyaqpo You Kanma gzok-po Leg == References == * Everson, Michael. ISO/IEC JTC1/SC2/WG2 N2985: Proposal to add four Tibetan characters for Balti to the BMP of the UCS . 2005-09-05 * Hussainabadi, Mohamad Yusuf. Balti Zaban. 1990. * Read, A.F.C. Balti grammar.London:The Royal Asiatic society, 1934. == Other websites == * Unicode * Koshur: The Balti Language * Tibetan script makes a comeback in Pakistan * Proposal to add four Tibetan characters for Balti to the BMP of the UCS * Tibetan Extensions 2 : Balti * Pakistan's Northern Areas dilemma * Northern Areas Development Gateway * Pakistan's Northern Areas Category:Languages of Pakistan Category:Languages of Gilgit-Baltistan Category:Sino-Tibetan languages Category:Languages of Jammu and Kashmir Category:Languages of India",
 "title": "Balti language"
}