{
 "id": "143980",
 "text": "A hydrogen car is a car that is a hydrogen vehicle. Other vehicles can use hydrogen in a similar way, such as an aircraft. ==Hydrogen energy== Hydrogen is the simplest and the most abundant element in the universe. Even though it is simple and there is so much of it, hydrogen does not occur naturally as a gas on Earth. It is always combined with other elements. Hydrogen has a large amount of energy. An engine that uses pure hydrogen as fuel makes almost no pollution. ===Advantages of hydrogen energy=== * Hydrogen comes from water by splitting it into oxygen and hydrogen, so supplies are almost limitless. * The only thing made from using hydrogen as fuel is water. Using hydrogen does not make the harmful gases that gasoline and diesel cars make, such as carbon dioxide.Schultz, M.G., Thomas Diehl, Guy P. Brasseur, and Werner Zittel. \"Air Pollution and Climate-Forcing Impacts of a Global Hydrogen Economy\", Science, October 24, 2003 302: 624-627 * Hydrogen is not poisonous. This means hydrogen is safer to use as fuel than any other gas. ===Disadvantages of hydrogen energy=== * It is hard to store the large amount of hydrogen that is needed to fuel a car. Hydrogen has a low energy density. This means it needs larger vessels and connections with high pressure. * Hydrogen is often taken from resources that are not renewable, such as fossil fuels. == Fuel cells == In principle, fuel cells are electrochemical devices similar to batteries that convert the chemical energy of a fuel directly and very efficiently into electricity (Direct current) and heat, thus doing away with combustion. Unlike a battery, a fuel cell does not run down or require recharging. It will produce energy in the form of electricity and heat as long as fuel is supplied. A fuel cell consists of two electrodes sandwiched around an electrolyte. Oxygen passes over one electrode and hydrogen over the other, generating electricity, water and heat. Layers of materials with distinct electrochemical properties are sandwiched together to form a single galvanic cell. At the heart lies a membrane that can only be crossed by charged molecules. Gas-permeable electrodes coated with a catalyst adhere to this membrane, adding a layer on either side. The electrodes are in turn connected to a device that can utilize electricity. Hydrogen gas flows into channels on one face of the cell and migrates through that electrode, while the same occurs with oxygen gas along the opposite electrode. Spurred by a catalyst, favorable chemistry causes the hydrogen to oxidize into hydrogen protons and give up its electrons to the neighboring electrode, which thereby becomes the anode. This buildup of negative charge then follows the path of least resistance via the external circuit to the other electrode. It is this flow of electrons through a circuit that creates electricity. ==By country== ===Norway=== In 2024, there were (less than two hundred, or) 141 hydrogen cars in Norway; However, in counties Akershus and Oslo, electric cars will be prohibited from using bus lanes for (at least) the next 3 years; However, hydrogen cars can continue to drive in bus-lanes.https://e24.no/energi-og- klima/i/QMoMo4/hydrogenbiler-beholder-fordel-haaper-dette-kan- inspirere?referer=https%3A%2F%2Fwww.vg.no. Retrieved 2024-05-11 ==Problem to solve for the practical use of hydrogen car== The most important problem involved is hydrogen storage materials. If it uses a fuel cell that generates electricity through reaction between hydrogen and oxygen, it does not matter. However, if the method is that hydrogen is sprayed to internal-combustion engine, it does matter. Now hydrogen storage tank with highest possibility is method using metal hydride. Metal hydride is that reversible reaction between metal and hydrogen make new form of compound. Now Hydrogen storing technology using Hydrogen storage compound metal comes to practical use step in the side of technical, however, hydrogen storing capacity per weight is no match for demand of user, so this technology is not widely used yet. Therefore, that problem should be solved. ==References== Category:Car classifications",
 "title": "Hydrogen car"
}