{
 "id": "143906",
 "text": "Alexander Elliot Anderson Salmond ( ; 31 December 1954 – 12 October 2024) was a Scottish politician, economist and television host. He was the First Minister of Scotland from 2007 to 2014. He was also the Leader of the Scottish National Party (SNP) from 2004 to 2014. He was an important figure in the Scottish independence movement. ==Early life== Salmond was born in Linlithgow, Scotland. He studied at the University of St Andrews. He became an economist at the Royal Bank of Scotland. In 1981, he married Moira McGlashan. ==Political career== Salmond became a Member of Parliament (MP) for the constituency of Banff and Buchan at the 1987 General Election. In 1990, Alex Salmond became the leader of the Scottish National Party. He became a Member of the Scottish Parliament (MSP) for Banff and Buchan at the 1999 Scottish Parliament Election and resigned as SNP leader in 2000. Salmond became the party leader again in 2004 and stood in the 2007 Scottish Parliament election for the constituency of Gordon. At this election, the SNP received the highest number of seats and the highest share of the vote in Scotland, but did not have enough seats to form a majority government. The SNP went on to form a minority government with Alex Salmond becoming First Minister. Alex Salmond was against the 2003 invasion of Iraq and was one of several MPs who called for Prime Minister Tony Blair to be impeached. At the 2010 General Election, Alex Salmond stood down as a Member of Parliament but argued against the BBC's decision not to allow the SNP on the televised Prime Ministerial Debates. On 19 September 2014, following the results of the independence referendum which confirmed a majority of the Scottish people had voted to remain as part of the United Kingdom, Salmond announced that he would be resigning as First Minister in November 2014. Salmond formally resigned as First Minister on 18 November 2014, with his deputy, Nicola Sturgeon taking office two days later. ==Death== Salmond died from a heart attack on 12 October 2024 after delivering a speech in Ohrid, North Macedonia at the age of 69. ==References== ==Other websites== * * * First Minister (Scotland.gov.uk) * Official biography (www.snp.org) * Guardian profile, Electoral history and profile (guardian.co.uk) * TheyWorkForYou.com * Voting Record — Alex Salmond MP, Banff & Buchan (10525) (The Public Whip) * Category:1954 births Category:2024 deaths Category:Calvinists Category:Deaths from myocardial infarction Category:Members of the British House of Commons for Scottish constituencies Category:Scottish National Party members of the Scottish Parliament Category:First Ministers of Scotland Category:Scottish National Party MPs Category:People from West Lothian Category:Alumni of the University of St Andrews",
 "title": "Alex Salmond"
}