{
 "id": "14411",
 "text": "Nepal is a country in South Asia between India and China. Mount Everest, the highest mountain in the world, and the central Himalaya Mountains are in Nepal. 12 of the world's highest mountain peaks are in Nepal. It is also the birthplace of Buddha. It has recently become a secular country, but before it was the only Hindu Kingdom in the world. Nepal is a very important pilgrimage place for both Hindus and Buddhists. The population of Nepal in 2021 was almost 29 million people.nations encyclopedia, nepal, 2013, http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Nepal.html Nepali is the official language of the country, but there are many other regional languages in Nepal. Many people in Nepal understand English and Hindi as well. The capital city of Nepal is Kathmandu, which has a population of over 1.4 million people. The second-largest city is Pokhara. Pokhara is a major tourist attraction of Nepal which is rich in natural beauty. Pokhara includes many lakes, Phewa Tal is one of them. == Geography == Nepal is a landlocked country, which means it is not next to any ocean, and it is surrounded by India and China. Eight of the ten tallest mountain peaks in the world, including Mount Everest, are in Nepal. Mount Everest is on the border Nepal shares with China. Nepal is a little smaller than Illinois and Bangladesh, but a little bigger than Kyrgyzstan. It also has the second- highest average elevation in the world at (10,715 ft), only behind Bhutan. == Economy == Nepal used to be an agricultural country until 1950. Since 1951 it entered the modern era and has made progress. Agriculture, however, is still a major economic activity. 80% of the people do agricultural works and it provides 37% of GDP. Only about 20% of the total area is cultivable while another 33% is covered by forest. Most of the remaining land is covered by mountains. Rice and wheat are the main food crops. The lowland Terai region produces a high amount of agricultural products. A part of those products is supplied to the hill areas, which produces less. China is the 2nd largest exporter to Nepal, but its imports from Nepal are zero. This burdens Nepal's monetary stability and monetary balance. India is the largest buyer of Nepal's goods.The yearly monsoon rain, or lack of it, strongly influences economic growth. From 1996 to 1999, real GDP growth averaged less than 4%. The growth rate recovered in 1999, rising to 6% before slipping slightly in 2001 to 5.5%. Nepal has 1/3 of its trade with India. ==Demographics== The people of Nepal belong to two main groups; Indo-Aryan group and Tibeto-Burman group. Indo- Aryans are mostly Hindus and Sikhs and they celebrate Hindu and Sikh festivals like Dashain, Tihar, Vaisakhi, Gurpurabs, Maghi, Hola, Bandi Chhor diwas, Teej, Magh Sankranti, Krishna Janmastami, Holi, Janai Purnima, Matatirtha Aunsi, Chhath, etc. Tibeto-Burmans are Buddhist and they celebrate Lhosar, Buddha Jayanti, etc. == Education == Modern education in Nepal started with the opening of the first school in 1853. This school was only for the members of the ruling families and their courtiers. Schooling for the general people began only after 1951. It was when a popular movement ended the autocratic Rana family regime and started a democratic system. In the past 50 years, there has been a big expansion of education facilities in the country. As a result, adult literacy (age 15+) of the country was reported to be 48.2% (female: 34.6%, male: 62.2%) in the Population Census, 2001, up from about 5% in 1952–54. In the beginning in 1951, there were about 300 schools and two colleges with around 10,000 students. Now, there are more than 26,000 schools (including higher secondary), 415 colleges, five universities, and two academies of higher studies. In total, 5.5 million students are studying in those schools and colleges who are taught by more than 150,000 teachers. Despite such examples of success, there are many problems and challenges. Education management, quality, usefulness, and access are some of the major issues of education in Nepal. Social differences based on gender, ethnicity, location, economic class, etc. are still there in some places. Lack of resources has always been a problem in education. These problems have made the goal of education for all a challenge for the country. ==Administrative subdivisions== Nepal has seven provinces. Each province has 8 to 14 districts. The districts have local units called municipalities. * Koshi Province * Madhesh Province * Bagmati Province * Gandaki Province * Lumbini Province * Karnali Province * Sudurpashchim Province ==Culture== The official calendar of Nepal is the Vikram Samvat, which is a Hindu calendar. Their new year begins in Baishakh, which is around mid-April. Nepal has 36 public holidays in the year. This makes Nepal the country with the most public holidays. The national cuisine of Nepal is Dhindo and Gundruk. Dhindo is a type of dough that is served very hot. Gundruk is a dish with fermented green vegetables. Association football is the most popular sport in Nepal. The Nepal national football team plays at Dasarath Rangasala Stadium in Tripureswar, Kathmandu, Nepal. ==National symbols of Nepal== The national symbols of Nepal, according to the Interim Constitution, are: File:Cow.jpg|Animal: (Cow) File:Monal I IMG 4002.jpg|Bird: (Lophophorus) File:Rhododendron_arboreumC.jpg|Flower: (Rhododendron arboreum) ==History== King Prithvi Narayan Shah of Gorkha invaded the Kathmandu Valley in 1786 and unified Nepal. Before the unification, Nepal was ruled by various Kirats, Lichchavis, Thakuris and Mallas. The history mentioned that Kirats ruled Nepal during the 7th century BC. Though much was not known about Kirats, the Lichchavi dynasty ruled after them. Lichchavi rule lasted from the 2nd to 9th century AD. After Lichchavis, Nepal was ruled by the Thakuris who were followed by the Mallas for two centuries. Nepal was divided into many principalities and small kingdoms in the fifth centuries of Malla rule. Jang Bahadur Rana the then Prime Minister of Nepal revolted against the royalty in 1844. The famous Kot Massacre took place during this period in which numbers of noblemen were killed. The Rana took absolute power but continued to maintain the Shah family in the palace. The 104 years regime of Ranas came to and end due to their autocratic rules. In November 1950, King Tribhuvan restored democracy overthrowing the Rana regime with large number of Nepalese people support. He restored Shah Regime again in Nepal. After his death King Mahendra had ruled in Nepal from 13 March 1955 to 31 January 1972. Birendra ruled Nepal from 31 January 1972 to 1 June 2001. He was known as a most noble and peaceful king of Nepal. The entire family of King Birendra was killed in June 2001 popularly Known as Royal Massacre 2001. Prince Dipendra was made King while he was on coma stage, later he died in hospital bed. After the death of Dipendra, Gyanendra Shah late King Birendra’s brother became the King of Nepal. King Gyanendra Shah was dethroned in 2006 after a decade long People’s revolution led by communist party of Nepal (Maoist) and several weeks protest by major political parties. After that, Federal Democratic Republic of Nepal was established. ==Related pages== * List of rivers of Nepal * Nepal at the Olympics * Nepal national football team * Nepali language * Theravada == References == * Glacial Lakes and Glacial Lake Outburst Floods in Nepal. - International Centre for Integrated Mountain Development, Kathmandu, March 2011 Category:Former monarchies of Asia Category:Least developed countries",
 "title": "Nepal"
}