{
 "id": "144154",
 "text": "Faro is the capital city of Algarve, Portugal. The city has a population of 58,305 people. ==History== Politically, Faro was founded in the 10th century by Moors who remained in the region for the following five centuries, until the Christian conquest. They were responsible for many of the structures in the region, such as the main castle, but also for the many names that dotted the region's toponymy, as well as the legends and myths that developed by its peoples. The village of Faro was taken from the Moors in 1249, during the reign of D. Afonso III, by Paio Peres Correia, Master of the Order of Santiago. The Christians gave thanks for their success to the Virgin Mary, and in an expansion of faith, Nossa Senhora da Alva (Our Lady of the Dawn) was named patron saint of Faro, as a result of the mythical legend of the Conquest of the Castle. Faro obtained a foral (charter) from 12 November 1280, issued by King Denis of Portugal in Estremoz, it was the first charter issued by the king in the Algarve. On 1 June 1504, King Manuel of Portugal reformed the diplomatic map issued by King Denis, and promoted the town with the title Nobre e Honrada (Noble and Honoured). Following the Restoration War, in the reigns of King Afonso VI and his brother, regent (then King) Peter II, the coastal lands were infested with Barbary pirates that anchored in the coastal coves and unprotected anchorages, then attacked and pillaged the local towns. Carrapateira was erected between two beaches, where pirates could easily disembark: Praia da Bordeira (to the north) and Praia do Amado (to the south). From these beaches, Barbary pirates targeted local homes, kidnapping many and selling them into slavery in the markets of Algiers. Similarly, in Arrifana, which formed a small cove protected by strong waves and easy access to the sea. Therefore, in the 17th century, they national government constructed the Fort of Arrifana; erected in 1635, rebuilt in 1635 and 1670, it was originally established to protect a fishing port that existed by 1516. Category:Cities in Portugal Category:Municipalities of Portugal Category:Faro District",
 "title": "Faro, Portugal"
}