{
 "id": "144294",
 "text": "The Kakapo (Strigops habroptilus) is the only parrot which cannot fly. It lives in grassland, scrubland and coastal regions of New Zealand, but is now so rare they can only be seen on protected offshore islands. Kakapo means 'night parrot' in the Māori language. Kakapos are most active at night (nocturnal) and like to be alone. To keep other kakapos out of their territory, they make a 'skraarking' sound. The Kakapo can live for about 60 years and likely to 100 == Diet == Kakapo are herbivores. They eat roots, seeds, leaves, small pine cones, fruit, and flowers. == Reproduction == Unlike other parrots, male kakapos gather together to compete with the other males and call females with a deep booming sound. There are 2 to 3 eggs in each set of eggs laid. The eggs are laid in a hollow part of a tree. The female incubates the eggs for 10 weeks. She only leaves the eggs when she leaves to find food. == Conservation == Kakapo had almost no natural animals that wanted to eat it on the islands of New Zealand where they live and lose the ability to fly. At one time, there were many kakapos. Now only about 150 kakapos still live in New Zealand. It is a critically endangered species. The decrease in the number of kakapo is mostly from predatory animals (for example, cats, dogs, stoats, ferrets, and rats) that settlers brought with them to New Zealand. The kakapo was also eaten by Māori and Europe settlers. Before humans brought mammals like cats and stoats, the main predator of the kakapo was flying birds of prey. Birds of prey find animals to eat by looking for them from above. The kakapo would stand very still, so the bird of prey would not find it. But cats and stoats can find animals to eat by smelling them. Standing still did not help the kakapo escape from cats and stoats. At one point, the kakapo was almost wiped out. Conservation efforts began in the 1890s but were not very successful until the Kakapo Recovery Plan in the 1980s. As of January 2009, surviving Kakapos have been kept on two predator- free islands, Codfish (Whenua Hou) and Anchor islands, where they are closely monitored. Two large Fiordland islands, Resolution and Secretary, have been prepared as self-sustaining ecosystems for the Kakapo. The conservation of the Kakapo has made the species well known. Many books and documentaries detailing the plight of the Kakapo have been produced in recent years, one of the earliest being Two in the Bush, made by Gerald Durrell for the BBC in 1962. A feature-length documentary, won two major awards at the Reel Earth Environmental Film Festival. Two of the most significant documentaries, both made by NHNZ, are Kakapo - Night Parrot (1982) and To Save the Kakapo (1997). The BBC's Natural History Unit also featured the Kakapo, including a sequence with Sir David Attenborough in The Life of Birds. It was also one of the endangered animals that Douglas Adams and Mark Carwardine set out to find for the radio series and book Last Chance to See. An updated version of the series has been produced for BBC TV, in which Stephen Fry and Carwardine revisit the animals to see how they are getting on almost 20 years later, and in January 2009, they spent time filming the Kakapo on Codfish Island.BBC 2: == References == Category:Birds of New Zealand Category:Parrots Category:Flightless birds",
 "title": "Kakapo"
}