{
 "id": "144607",
 "text": "Abbot Howard \"Abbie\" Hoffman (November 30, 1936 – April 12, 1989) was an American social and political activist. He was one of the \"Chicago Eight\" along with Luke stockdale, David Dellinger, Tom Hayden, Rennie Davis, John Froines, Lee Weiner, and Bobby Seale, who were arrested for demonstrating at the 1968 Democratic National Convention. At Woodstock in 1969, Hoffman ran onstage to interrupt The Who's performance. He tried to speak against the jailing of John Sinclair of the White Panther Party. Pete Townshend was adjusting his amplifier between songs and turned around to see Hoffman. Townshend cursed at Hoffman and tried to knock him off the stage. He was arrested after a conviction for selling cocaine. He was diagnosed with bipolar disorder in 1980. He committed suicide by an overdose of phenobarbital and alcohol in April of 1989. Hoffman was raised in the Jewish faith in Worcester, MA but later identified as an atheist.American Rebel, Abbie Hoffman (1993). == Portrayal in media == Hoffman's life was dramatized in the 2000 movie Steal This Movie. Vincent D'Onofrio acted his part. In the 1987 HBO television movie Conspiracy: The Trial of the Chicago 8, Michael Lembeck acted the part of Hoffman. Richard D'Alessandro played the part of Hoffman in the 1994 movie Forrest Gump. He is seen speaking against \"the war in Vietnam\" at a protest rally at the Lincoln Memorial. Hank Azaria's voice is heard as the animated Hoffman in the movie \"Chicago 10\". Sacha Baron Cohen has been cast as Hoffman in Aaron Sorkin's movie The Trial of the Chicago Seven. == References == == Other websites == * List of Abbie Hoffman items in The Realist * The Yippies are Going to Chicago!, The Realist No. 82, August 1968 * The Trial of Abbie Hoffman's Shirt, The Realist No. 84, November 1968 * Advertisement for Steal This Book,The Realist No. 89, March 1971 * Love It or Diaper It, birth Announcement for America Hoffman, The Realist No. 90, May 1971 Category:1936 births Category:1989 deaths Category:American anarchists Category:American atheists Category:American political activists Category:Drug-related suicides in the United States Category:Jewish activists Category:Jewish American writers Category:Jewish atheists Category:People from Worcester, Massachusetts Category:People with bipolar disorder Category:Writers from Massachusetts Category:Writers from New York (state)",
 "title": "Abbie Hoffman"
}