{
 "id": "144799",
 "text": "ABC Kids was an American television programming block produced by ABC Productions. It was distributed by Buena Vista Television Group, a division of Disney Media Networks, which aired on ABC. It broadcasted several different children’s television series. These series were all owned by Disney Media Networks, the owner of ABC Entertainment Group. Most of them were also shown on Buena Vista Television Group’s own network Disney Channel. ==History== On September 13, 1997, Disney's One Saturday Morning started out as a two-hour block on the ABC Saturday Morning lineup, and aired some of the former's shows. In 1999, it was extended to 5 hours. On September 6, 1999, a spin-off, Disney's One Too, aired on UPN and in syndication every weekday in the morning or afternoon and Sunday morning. One Saturday Morning last aired on September 7, 2002. On September 14, 2002, Disney renamed One Saturday Morning to ABC Kids. The block originally had new programs, but by the end, all of ABC Kids programs became repeats of Disney Channel originals. Power Rangers was previously aired on Fox Kids until halfway through the Wild Force season, when Power Rangers moved to ABC Kids for the 2002 Fall season due to the Fox Family Channel/Saban Entertainment purchase by Disney in 2001. Starting with the episode \"Unfinished Business\", the remainder of the Wild Force season premiered on ABC Kids. During its time on both Fox Kids and ABC Kids the entire Wild Force season also ran again later on ABC Family (in part both before the introduction of and during the ABC Family Action Block). The following Ninja Storm season also premiered on ABC Kids and then ran again later on the ABC Family Action Block. The Dino Thunder, S.P.D., Mystic Force, Operation Overdrive and Jungle Fury seasons were all shown on Jetix and then ran again on ABC Kids. The RPM season and broadcasts of the first season of Mighty Morphin, when revised, aired exclusively on ABC Kids. Power Rangers ended its run on ABC Kids on August 28, 2010, nationwide due to Haim Saban having bought back the intellectual rights to the franchise from Disney and giving airing rights to Nickelodeon in May 2010. Airings ended slightly earlier on August 14, 2010, on West coast affiliates caused by the 2010 Little League World Series and the E/I recovery that resulted from it. On September 4, 2010, the hour held by Power Rangers was returned to the local affiliates. After its completion on ABC Kids, Power Rangers moved to Nickelodeon. All new seasons (starting with the Samurai season) began to show on the main Nickelodeon channel on February 7, 2011. Repeats of new seasons and all previous seasons began airing on Nicktoons on February 11, 2011. With the rise of federally-mandated E/I programming rules, some of the network's partner groups, primarily Hearst Television and Allbritton Communications, refused to carry any show that did not meet E/I requirements (such as Kim Possible or the Power Rangers series during their time on ABC Kids) in order to instead free up time to air locally produced shows. However, some stations shifted the time these shows aired either to very early in the morning Saturday or to Sunday, often before local news, Good Morning America and/or that week's \"live\" portion of the ABC Kids block began. ABC Kids was aired for the final time on August 27, 2011. After that, ABC discontinued airing animated programming, making it the first time they did not air animated programs since September 1992, when NBC stopped airing animated programs to make room for TNBC. ===Litton's Weekend Adventure=== On May 24, 2011, ABC announced that it had reached a deal with broadcast syndication production company Litton Entertainment to produce original content for the Saturday morning block. The Litton's Weekend Adventure block launched on September 3, 2011, replacing ABC Kids. ===Former programming=== * The Buzz on Maggie (2005-2006) * The Emperor's New School (2006–2011) * Even Stevens (2005) * Fillmore! (2002–2005) * Hannah Montana (2006-2011) * Drama * Kim Possible (2002–2006) * Lizzie McGuire (2002–2005) * Lilo & Stitch: The Series (2003–2006) * NBA Inside Stuff (2002–2004) * Phil of the Future (2004–2006) * Pham Viet Dung * Power Rangers (2002-2010) * The Proud Family (2002-2006) * Recess (2002-2004) * The Replacements (2006-2011) * The Suite Life of Zack & Cody (2005-2011) * Teamo Supremo (2002–2003) * That's So Raven (2003–2011) * W.I.T.C.H. (2005) ===Disney's One Saturday Morning programming=== * 101 Dalmatians: The Series (1997–1999, TV-Y) * The Bugs Bunny & Tweety Show (1986–2000, TV-G) * Buzz Lightyear of Star Command (2000–2001, TV-Y7) * Disney's House of Mouse (2001–2002, TV-Y) * Disney's Doug (1996–2001, TV-Y) * DuckTales (1996–1999, TV-Y) * Even Stevens (on the Zoog hour, 2001–2002, TV-Y) * Garfield and Friends (2000-2001, TV-G) * Hercules: The Animated Series (1998–1999, TV-Y) * Jungle Cubs (1996–1998, TV-Y) * The Legend of Tarzan (2002, TV-Y) * Lizzie McGuire (on the Zoog hour, 2001–2002, TV-Y) * Lloyd In Space (2001–2002, TV-Y) * Mary-Kate and Ashley in Action! (2001–2002, TV-Y7) * Mickey Mouse Works (1999–2001, TV-Y7) * The New Adventures of Winnie the Pooh (1988–2002, TV-Y) * Pepper Ann (1997–2001, TV-Y) * The Proud Family (2002, TV-Y) * Recess (1997–2002, TV-Y) * Sabrina: The Animated Series (1999–2001, TV-Y7) * Schoolhouse Rock! (1973–2000, TV-G) * Science Court (1997–2000, later on known as Squigglevision, TV-Y) * Teacher's Pet (2000–2002, TV-Y) * Teamo Supremo (2002, TV-Y) * The Weekenders (1999–2002, TV-G) ==References== ==Other websites== * * Disney's One Saturday Morning official site * Blast From The Past 1990s ABC * A Tribute to Disney's One Saturday Morning * Category:American Broadcasting Company Category:Television programming blocks in the United States Category:1990s American children's television series Category:2000s American children's television series Category:2010s American children's television series",
 "title": "ABC Kids (TV programming block)"
}