{
 "id": "144850",
 "text": "In astronomy, stellar classification is a way of grouping stars by temperature. Star temperature can be measured by looking at its spectrum, the type of light that the star shines. Stars are also grouped into spectral types or classes by color. In general, a star's temperature determines its color, from red to blue-white. Spectral types are named with a letter. The seven main types are M, K, G, F, A, B and O. M stars are the coldest stars and O stars are the hottest. == Harvard spectral classification == The Harvard classification system is a one-dimensional classification scheme. Stars vary in surface temperature from about 2,000 to 40,000 kelvin. Physically, the classes indicate the temperature of the star's atmosphere and are normally listed from hottest to coldest, as is done in the following table: Note: The conventional color description describe only the peak of the stellar spectrum. However, the actual apparent colors the eye sees are lighter than the conventional color descriptions. Class Surface temperatureTables VII, VIII, Empirical bolometric corrections for the main-sequence, G.M.H.J. Habets and J.R.W. Heinze, Astronomy and Astrophysics Supplement Series 46 (November 1981), pp. 193–237, . Luminosities are derived from Mbol figures, using Mbol(☉)=4.75. (kelvin) Conventional color description Actual apparent color Mass (solar masses) Radius (solar radius) Luminosity (bolometric) Hydrogen lines Fraction of all main sequence stars LeDrew G. 2001. The real starry sky. Journal of the Royal Astronomical Society of Canada. 95, 1, 32–33. Note: Table 2 has an error and so this article will use 824 as the assumed correct total of main-sequence stars. O ≥ blue blue ≥ 16 M☉ ≥ 6.6 R☉ ≥ 30,000 L☉ Weak ~0.00003% B blue white deep blue white 2.1–16 M☉ 1.8–6.6 R☉ 25–30,000 L☉ Medium 0.13% A white bluish- white 1.4–2.1 M☉ 1.4–1.8 R☉ 5–25 L☉ Strong 0.6% F yellowish-white slightly whitish 1.04–1.4 M☉ 1.15–1.4 R☉ 1.5–5 L☉ Medium 3% G yellow orangish-white 0.8–1.04 M☉ 0.96–1.15 R☉ 0.6–1.5 L☉ Weak 7.6% K orange light orange 0.45–0.8 M☉ 0.7–0.96 R☉ 0.08–0.6 L☉ Very weak 12.1% M red orange ≤ 0.45 M☉ ≤ 0.7 R☉ ≤ 0.08 L☉ Very weak 76.45% The mass, radius, and luminosity listed for each class are appropriate only for stars on the main sequence portion of their lives and so are not appropriate for red giants and blue and red supergiants. The spectral classes O through M are subdivided by Arabic numerals (0–9). For example, A0 denotes the hottest stars in the A class and A9 denotes the coolest ones. The Sun is classified as G2. The Hertzsprung-Russell diagram is more often used in astronomy. It relates the absolute magnitude and the surface temperature. It is as important to astronomy as the periodic table is to chemistry. === Luminosity classes === Luminosity classes also exist and stars can be assigned to one based on their spectrum. The conventional classes are called the Yerkes system. Yerkes luminosity classes Class Description 0 or Ia+ Hypergiants Ia Very bright supergiants Iab Bright supergiants Ib Fainter supergiants II Bright giants III Giant stars IV Subgiants V Dwarf stars (main- sequence) VI Subdwarf stars VII White dwarfs Our Sun, a yellow dwarf, is G2V. Red giants are K to M and have luminosity class III. Blue supergiants are O to A with II to Ia, while red supergiants are K to M with II to Ia. ===Conventional and apparent colors=== The conventional color descriptions are traditional in astronomy, and represent colors relative to the mean color of an A-class star which is considered to be white. The apparent color descriptions are what the observer would see if trying to describe the stars under a dark sky without aid to the eye, or with binoculars.The Guinness book of astronomy facts & feats, Patrick Moore, 1992, 0-900424-76-1 The Sun itself is white, though it is sometimes called a yellow star. This is a natural consequence of the evolution of human optical senses: the response curve that maximizes the overall efficiency against solar illumination will by definition perceive the Sun as white, though there is some subjective variation between observers. === Class O === Type O stars are stars with temperatures of ~35,000 degrees Celsius or Kelvin. They are blue in color and can be more than 6.5 times bigger than the Sun. They are also very massive but, at the same time, very rare. Examples: * Mu Columbae (main sequence) * HD 269327 (hypergiant) === Class B === Type B stars are blue stars which have temperatures of ~25,000 degrees (Celsius or Kelvin). They are high in helium spectral lines and luminosity (brightness compared to the Sun), with moderately strong hydrogen lines. B type stars with Balmer lines in their spectra are part of the Be stars subtype. Examples: *VV Cephei B (main sequence) *Rho Leonis (giant) *Rigel (supergiant) *Pistol Star (hypergiant) === Class A === Type A stars are white stars which have the strongest hydrogen lines. They are some of the brightest stars in the sky. Temperatures ~10,000 degrees Celsius or Kelvin. Examples: *Sirius A (main sequence star) *Deneb (supergiant) === Class F === Type F stars are yellow stars that contain dominant calcium lines in their spectra. They have temperatures of ~7,500 degrees Celsius or Kelvin. Examples: *Procyon (dwarf) *Polaris (giant) *Arneb (supergiant) *Rho Cassiopeiae (hypergiant) === Class G === Type G stars are yellow stars with temperatures between 5,700-6,400 degrees Kelvin. Ionized calcium and iron are present in their spectra. Examples: * The Sun (G2 dwarf) * Capella (giant) * HD 269953 (hypergiant) === Class K === Type K stars are orange to orange-red stars with temperatures between 4,100-5,100 degrees. Molecules begin to appear in weak spectral lines. Examples: * Alpha Centauri B (dwarf) * Pollux (giant) * Zeta Cephei (supergiant) * HR 5171 (hypergiant) === Class M === Type M stars are the most common type of star in the universe. Red dwarfs, smaller than the sun, temperatures 3,000-4,000 degrees Kelvin and more common than red giants, which are old 3,100 degree Celsius stars in the last stages of their life. Red hypergiants are also the biggest stars, while red dwarfs, having a fully convective structure, exhaust their hydrogen fuel very slowly compared to other stars. These stars are cool enough to allow molecules to exist intact in their atmosphere; these leave many dark spectral lines. Examples: * Proxima Centauri (dwarf) * Mira A (giant) * Antares (supergiant) * VY Canis Majoris (hypergiant) Class S S-type stars are red giant stars with equal quantities of carbon and oxygen in its atmosphere. Below is a size comparison of all the known S-type stars with known radii. Name Radius (Solar radii) CIT 11 982 V384 Persei 937 S Cassiopeiae 930 R Cygni 825 IRAS 10176-5802 751.2 TT Centauri 744 Y Lyncis 580 WY Cassiopeiae 575 R Andromedae 476 NO Aurigae 439.4 R Geminorum 431 RR Andromedae 404 EP Vulpeculae 380 Chi Cygni 348 W Andromedae 332.47 T Ceti 275 CY Cygni 232.44 RS Cancri 225 BH Crucis 216 Omicron1 Orionis 214 DT Piscium 197 BQ Octantis 197 R Orionis 192.722 V597 Carinae 173.34 NGC 2682 FBC 3456 A 139.542 BD Camelopardalis A 135 57 Pegasi 126 HR Pegasi 125 V1139 Tauri 103.695 AA Camelopardalis 97.849 98 Herculis 85.39 HD 35155 80.61 TX Canum Venaticorum 50.92 HD 310 45.734 BS Cygni 44.94 Z Piscium 36.888 X Andromedae 33 == Related pages== *Hertzsprung-Russell Diagram == References == == Other websites == * Stellar classification (astrophysics) Citizendium Category:Stars Category:Astrophysics",
 "title": "Stellar classification"
}