{
 "id": "144859",
 "text": "Snow White and the Seven Dwarfs, also referred to as Snow White for short, is a 1937 American animated musical fantasy movie. It was made by Walt Disney Productions and released by RKO Radio Pictures. It is based on the German fairy tale Snow White by the Brothers Grimm. It is the first full-length cel animated movie and the first Walt Disney Animated movie. The story was adapted by storyboard artists Dorothy Ann Blank, Richard Creedon, Merrill De Maris, Otto Englander, Earl Hurd, Dick Rickard, Ted Sears and Webb Smith. David Hand was the supervising director, while William Cottrell, Wilfred Jackson, Larry Morey, Perce Pearce, and Ben Sharpsteen directed the movie's different sequences. Snow White was first shown at the Carthay Circle Theatre on December 21, 1937. It was released across the United States on February 4, 1938. With international earnings of $8 million when it first came out, the movie for a bit had the record of highest grossing sound movie anyone had made yet. The popularity of the movie has led to it being re-released theatrically many times, until its home video release in the 1990s. Adjusted for inflation, it is one of the top ten performers at the North American box office and the most successful animated movie that anyone has yet made. At the 11th Academy Awards, Walt Disney was awarded an honorary Oscar. The movie was nominated for Best Musical Score. It was added to the United States National Film Registry in 1989 and is ranked in the American Film Institute's list of the 100 greatest American films, who also named the movie as the greatest American animated movie of all time in 2008. Disney's take on the fairytale has had a huge cultural impact, resulting in popular theme park attractions, a video game, and a Broadway musical. == Story == An evil Queen has a mirror and asks \"Magic Mirror on the wall, who is the fairest one of all?\" The mirror answers \"Snow White\". Snow White is the princess of the kingdom and the evil Queen is her stepmother. The evil Queen is jealous of Snow White's beauty so she sends a Huntsman to kill her. However, he decides not to and lets Snow White escape. Snow White is lost in the woods, and comes across the home of seven little men, or Dwarfs named Doc, Grumpy, Happy, Sleepy, Bashful, Sneezy, and Dopey. She cleans their home, and they allow her to stay with them. The Queen eventually finds out that the Huntsman did not kill Snow White. The Queen, who is also a witch, transforms into an old hag. She goes to the dwarfs' cottage the next day while they're out and gets Snow White to bite into an apple with makes her fall dead. Suddenly, the dwarfs chase the old hag up a cliff and trap her. The hag tries to crush them with a boulder but lightning strikes the cliff and she falls off. Snow White is awakened by the kiss of a handsome Prince and they get married. == Production == Development on Snow White and the Seven Dwarfs began in early 1934, and in June 1934, Walt Disney announced the production of his first feature to the New York Times.Barrier, Michael (1999). Hollywood Cartoons. New York: Oxford University Press. pgs. 125-126. . Before Snow White, the Disney studio had been mainly involved in the production of highly successful animated shorts in the Mickey Mouse and Silly Symphonies series. Disney hoped to enlarge his studio's reputation and money by moving into features, and estimated that Snow White could be produced for a budget of $250,000 - ten times the budget of an average Silly Symphony. Walt Disney had to fight to get the movie produced. Both his brother Roy Disney and his wife Lillian attempted to talk him out of it, and the Hollywood movie industry mockingly referred to the movie as \"Disney's Folly\" while it was in production. He even had to mortgage his house to help finance the movie's production, which eventually ran up a total cost of just over $1.5 million, a huge sum for a movie in 1937. == Characters == === Snow White === Princess Snow White (voiced by Adriana Caselotti) was the daughter of a great king whose wife died when the daughter was born. Her evil stepmother forced her to work as a maid in the castle because she was afraid of Snow White one day will be fairer than her. Despite this, she is cheerful but naive and everyday wishes to has a beautiful life with her Prince Charming. One day who the magic mirror said Snow White is fairer than the Queen she sends a huntsman to kill the princess. At last that's very hard and the huntsman leaves her go to the forest. After her adventures in the forest she with the help of the forest animals she finds the cottage of the seven dwarfs and clean up that. After she went to sleep the seven dwarfs return and meet her. After the meeting they promised to protect her from the Queen and Snow White takes the role of their mother clean up the home and cook. After the Queen disguised to a peddler and went to Snow White with a poisoned apple. She finally eat the apple because the Queen said is a magical wishing apple. After the death of the Queen the dwarfs make for her a glass coffin. Years later her Prince came and said good bye to her with a kiss but that kiss was the only one thing who can break the spell and Snow White turned back to life. Said goodbye and kissed in the forehead the dwarfs and pleased all of them for their help and honesty and went with the prince in his Fairytale Castle in the Clouded Heaven. Virginia Davis, who starred in Disney's \"Alice\" series, was considered for the role of Snow White, but was turned down. Deanna Durbin was also considered, but was turned down because her voice was \"too mature\" for the role. === Evil Queen === The Evil Queen (voiced by Lucille La Verne) is the stepmother of Snow White. Once her magic mirror tells her that Snow White is fairer than she is, she tells a huntsman to kill her in the woods. After she finds out that Snow White did not die, she disguises herself as an old hag and uses a poisoned apple in order to kill Snow White. After she poisoned Snow White she started to run away because the dwarfs were hunting her and climbed in the cliff of a mount. In the cliff she was trying to fall a giant rock in the dwarfs and kill them, when she started to laugh a big thunderbolt fell on her and broke the cliff and the Queen fell in her wild deathly fate and after the rock fell on her and threshed her bones. Finally two wicked vultures who followed her went in her to eat her dead threshed body. === The Prince === The Prince (voiced by Harry Stockwell) Prince first sees Snow White to sings in her wishing well and fell in love with. After she saw him the Prince sang for her a romantic song and promised he will come back for her. After Snow White's death he returned and gave Snow White a kiss to say to her good bye but with the kiss broke the spell and with her returned in his Great Fairytale Castle in the Clouded Heaven. === The Dwarfs === * Roy Atwell as Doc, the wise yet scatter-brained leader of the seven dwarfs, who often gets his words mixed up. * Pinto Colvig as Grumpy, a grouchy and irritable member of the seven dwarfs, who initially dislikes Snow White, but grows to care for her. ** Colvig also voiced Sleepy, a drowsy and sluggish member of the seven dwarfs. * Otis Harlan as Happy, a cheerful and optimistic member of the seven dwarfs. * Scotty Mattraw as Bashful, a sentimental and shy member of the seven dwarfs. * Billy Gilbert as Sneezy, a member of the seven dwarfs who suffers from hay fever. * Eddie Collins as Dopey, a clumsy and childlike member of the seven dwarfs, who communicates through sounds and pantomime instead of speaking. === Other characters === * Moroni Olsen as The Magic Mirror: The Slave of the Magic Mirror appears as a green mask in clouds of smoke. The Queen always asks him who is the fairest in the land. * Stuart Buchanan as Humbert the Huntsman: The Huntsman is a kind-hearted person who cannot bear to kill Snow White, even when the Queen orders him to take the princess's heart. Unvoiced characters include Snow White's animal friends, the Queen's raven, and the vultures who follow the Witch. However, although the animals did not have human speaking voices, their natural calls were very lifelike, and were all voiced by champion whistler and animal mimic Purv Pullen (a.k.a. A. Purves Pullen), who would provide bird and animal calls for Disney movies (including numerous Pluto cartoons) for several decades. Pullen also produced the bird calls for the Enchanted Tiki Room attractions at Disney theme parks. During the 1940s and 1950s, he performed as \"Dr. Horatio Q. Birdbath\" with the comedy band Spike Jones & His City Slickers. Not only that, but Marion Darlington and George Magrill also provided vocal effects for the birds and the doves. == Crew == * A Walt Disney Feature production * Adapted from Grimms' fairy tales * Photographed in Technicolor * Distributed by Buena Vista Distribution Before the credits, there's a message by Walt Disney. It reads: \"My sincere appretiation to the members of my staff whose loyalty and creative endeavor made possible this production. Walt Disney\" * Supervising director: David Hand * Sequence directors: Perce Pearce, William Cottrell, Larry Morey, Wilfred Jackson and Ben Sharpsteen * Supervising animators: Hamilton Luske, Fred Moore, Vladimir Tytla and Norman Ferguson * Story adaptation: Ted Sears, Richard Creedon, Otto Englander, Dick Rickard, Earl Hurd, Merrill De Maris and Webb Smith * Character designers: Albert Hurter and Joe Grant * Music: Frank Churchill, Leigh Harline and Paul J. Smith * Art directors: Charles Philippi, Tom Codrick, Hugh Hennesy, Gustaf Tenggren, Terrell Stapp, Kenneth Anderson, McLaren Stewart, Kendall O'Connor, Harold Miles and Hazel Sewell * Backgrounds: Samuel Armstrong, Mique Nelson, Phil Dike, Merle Cox, Ray Lockrem, Claude Coats and Maurice Noble * Animators: Frank Thomas, Les Clark, Dick Lundy, Fred Spencer, Arthur Babbitt, Bill Roberts, Eric Larson, Bernard Garbutt, Milton Kahl, Grim Natwick, Robert Stokes, Jack Campbell, James Algar, Marvin Woodward, Al Eugster, James Culhane, Cy Young, Stan Quackenbush, Joshua Meador, Ward Kimball, Ugo D'Orsi, Woolie Reitherman, George Rowley and Robert Martsch == Release == Snow White and the Seven Dwarfs was first shown in cinemas on December 21, 1937. It was released across the United States on February 4, 1938. It has been re-released many times since. The first time was in 1944, in order to raise money for the Disney studio during World War II. This set a tradition of re-releasing Disney animated features every seven to ten years. Snow White was re-released to theaters in 1952, 1958, 1967, 1975, 1983, 1987 and 1993. == Reception == Disney's wife, Lillian, told him that no one will go pay anything to see a dwarf picture.Walt Disney: The Biography by Neal Gabler, 2007 Snow White and the Seven Dwarfs premiered at the Carthay Circle Theater on December 21, 1937 to a very impressed audience, many of the same people who called the movie \"Disney's Folly.\" The movie received a prasie from many child actors audience that included Charlie Chaplin and Paulette Goddard, Shirley Temple, Mary Pickford, Douglas Fairbanks, Jr., Judy Garland, Ginger Rogers, Jack Benny, Fred MacMurray, Clark Gable and Carole Lombard, Burns and Allen, Ed Sullivan, Milton Berle, John Barrymore, and Marlene Dietrich. Six days later, Walt Disney and the seven dwarfs appeared on the cover of Time magazine. The New York Times said \"Thank you very much, Mr. Disney.\" RKO Radio Pictures put the movie into general release on February 4, 1938, and it went on to become a huge box-office success, making more money than any other movie in 1938. In fact, for a short time, Snow White was the highest-grossing movie in American cinema history, until it was beat by Gone with the Wind in 1939. When taking inflation into account, and including rereleases, the movie still remains one of the top ten American movie moneymakers of all time.\"All-Time Box Office: Adjusted for Ticket Price Inflation\". Box Office Mojo. Snow White and the Seven Dwarfs was the first full-length animated feature movie made in English and Technicolor (not counting the Academy Award Review of Walt Disney Cartoons), and won an Academy Award for Walt Disney as a huge movie which has charmed millions and started a great new form of entertainment. Disney won a full-size Oscar statuette and seven small ones, given to him by 10-year-old child actress Shirley Temple. The movie was also nominated for Best Musical Score. \"Some Day My Prince Will Come\" has become a jazz standard that has been performed by numerous artists, including Buddy Rich, Lee Wiley, Oscar Peterson, and Miles Davis. Noted moviemakers such as Sergei Eisenstein and Charlie Chaplin praised the movie as a huge achievement in cinema.Culhane, John (July 12, 1987). \"'Snow White' at 50: undimmed magic.\" The New York Times. Retrieved May 10, 2007. The movie inspired Metro-Goldwyn-Mayer to produce its own fantasy movie, The Wizard of Oz in 1939. The 1943 Merrie Melodies short Coal Black and de Sebben Dwarfs, directed by Bob Clampett, parodies Snow White by presenting the story with an all-black cast singing a jazz score. In June 2008, the American Film Institute revealed its \"Ten top Ten\"—the best ten movies in ten \"classic\" American movie genres. After polling over 1,500 people from the creative community, Snow White and the Seven Dwarfs was acknowledged as the best movie in the animation genre. == Theme parks == Snow White's Scary Adventures is a popular theme park ride at Disneyland (an opening day attraction dating from 1955), Walt Disney World's Magic Kingdom, Tokyo Disneyland, and Disneyland Paris. Snow White, her Prince, and the Seven Dwarfs are also featured in parades and character appearances throughout the parks. == Video game == A video game was released for the Game Boy Color system. Snow White appears in the popular PlayStation 2 game Kingdom Hearts as one of the seven fabled Princesses of Heart. == 2025 remake == A live-action adaptation of the film titled Snow White will be released in 2025. It stars Rachel Zegler as Snow White, Gal Gadot as the Evil Queen and Martin Klebba as Grumpy. There have been a lot of controversies surrounding the remake for several reasons including the casting of non-little actors as the dwarfs, the changes made to Snow White's character as well as Rachel Zegler's negative opinions about the original film. ==Notes== == References == == Other websites == * * Walt's Masterworks: Snow White and the Seven Dwarfs at Disney.com * * * * * Category:1937 romance movies Category:1930s musical movies Category:American family movies Category:American musical movies Category:American romance movies Category:Disney animated movies Category:Movies based on fairy tales Category:United States National Film Registry movies Category:Movies directed by Wilfred Jackson Category:Movies composed by Frank Churchill Category:Movies composed by Leigh Harline Category:Movies composed by Paul Smith",
 "title": "Snow White and the Seven Dwarfs (1937 movie)"
}