{
 "id": "145464",
 "text": "The 2008 Formula One season was the 59th FIA Formula One World Championship season. It began on March 16 and was over on November 2 after eighteen races. Lewis Hamilton became the Drivers' World Champion while Scuderia Ferrari Marlboro won the Constructors' title. __TOC__ == Teams and drivers == The following teams and drivers competed in the 2008 FIA Formula One World Championship: Team Constructor Chassis Engine Tyre No. Race Drivers Test driver(s) Scuderia Ferrari Marlboro Ferrari Ferrari F2008 Ferrari Type 056 2.4 L V8 1 Kimi Räikkönen Luca Badoer Marc Gené Michael Schumacher Scuderia Ferrari Marlboro Ferrari Ferrari F2008 Ferrari Type 056 2.4 L V8 2 Felipe Massa BMW Sauber F1 Team BMW Sauber Sauber F1.08 BMW P86/8 2.4 L V8 3 Nick Heidfeld Christian Klien Marko Asmer BMW Sauber F1 Team BMW Sauber Sauber F1.08 BMW P86/8 2.4 L V8 4 Robert Kubica ING Renault F1 Team Renault Renault R28 Renault RS27 2.4 L V8 5 Fernando Alonso Lucas di Grassi Romain Grosjean Sakon Yamamoto ING Renault F1 Team Renault Renault R28 Renault RS27 2.4 L V8 6 Nelson Piquet, Jr. AT&T; Williams Williams Williams FW30 Toyota RVX-08 2.4 L V8 7 Nico Rosberg Nico Hülkenberg AT&T; Williams Williams Williams FW30 Toyota RVX-08 2.4 L V8 8 Kazuki Nakajima Red Bull Racing Red Bull Red Bull RB4 Renault RS27 2.4 L V8 9 David Coulthard Sébastien Buemi Red Bull Racing Red Bull Red Bull RB4 Renault RS27 2.4 L V8 10 Mark Webber Panasonic Toyota Racing Toyota Toyota TF108 Toyota RVX-08 2.4 L V8 11 Jarno Trulli Kamui Kobayashi Panasonic Toyota Racing Toyota Toyota TF108 Toyota RVX-08 2.4 L V8 12 Timo Glock Scuderia Toro Rosso Toro Rosso Toro Rosso STR2B * * * Toro Rosso STR3 Ferrari Type 056 2.4 L V8 14 Sébastien Bourdais Brendon Hartley Scuderia Toro Rosso Toro Rosso Toro Rosso STR2B * * * Toro Rosso STR3 Ferrari Type 056 2.4 L V8 15 Sebastian Vettel Honda Racing F1 Team Honda Honda RA108 Honda RA808E 2.4 L V8 16 Jenson Button Alexander Wurz Anthony Davidson Mike Conway Luca Filippi Honda Racing F1 Team Honda Honda RA108 Honda RA808E 2.4 L V8 17 Rubens Barrichello Super Aguri F1 Team Super Aguri Super Aguri SA08 Honda RA808E 2.4 L V8 18 Takuma Sato none Super Aguri F1 Team Super Aguri Super Aguri SA08 Honda RA808E 2.4 L V8 19 Anthony Davidson Force India Formula One Team Force India Force India VJM01 Ferrari Type 056 2.4 L V8 20 Adrian Sutil Vitantonio Liuzzi Force India Formula One Team Force India Force India VJM01 Ferrari Type 056 2.4 L V8 21 Giancarlo Fisichella Vodafone McLaren Mercedes McLaren McLaren MP4-23 Mercedes-Benz FO 108V 2.4 L V8 22 Lewis Hamilton Pedro de la Rosa Gary Paffett Ralf Schumacher Vodafone McLaren Mercedes McLaren McLaren MP4-23 Mercedes-Benz FO 108V 2.4 L V8 23 Heikki Kovalainen Team started the 2008 season with an updated version of their 2007 car. Super Aguri withdrew from the 2008 Formula One season on 6 May due to financial troubles. === Team changes === * Only a year after Spyker bought the Midland team, Indian businessman Vijay Mallya bought the team for €88 million. Mallya was allowed to change the team's name to Force India. * During the 2008 season on 6 May, the Super Aguri team folded and withdrew from Formula One. The team was in financial problems at the end of . The team did not receive payment on a sponsorship deal. === Driver changes === Changed teams * Fernando Alonso: Left McLaren and joined Renault F1 * Heikki Kovalainen: Left Renault F1 and Retired * Giancarlo Fisichella: Left Renault F1 and joined Force India * Nelson Piquet, Jr.: Left Renault F1 as a test driver and joined Renault F1 * Timo Glock: Came from racing in GP2 Series and as a test driver for BMW Sauber F1 and joined Toyota Racing * Vitantonio Liuzzi: Left Scuderia Toro Rosso and joined Force India as a test driver * Kazuki Nakajima: Came from racing in GP2 Series and WilliamsF1 as a test driver and joined WilliamsF1 * Alexander Wurz: Left WilliamsF1 and joined Honda Racing F1 as a test driver * Christian Klien: Left Honda Racing F1 as a test driver and joined BMW Sauber F1 as a test driver * Sakon Yamamoto: Left Spyker F1 and joined Renault F1 as a test and development driver. Entered F1 * Sébastien Bourdais: Came from Champ Car World Series and joined Scuderia Toro Rosso * Marko Asmer: Came from British Formula Three Championship and joined BMW Sauber F1 as a test driver. Exited F1 * Ralf Schumacher: Left Toyota Racing and started being test driver for McLaren.but. == 2008 Race Calendar == The FIA World Council approved the 2008 schedule on 24 October 2007. Singapore was Formula One's first ever night race. Round Official race title Grand Prix Circuit Date Time Local UTC 1 ING Australian Grand Prix Australian GP Albert Park Grand Prix Circuit, Melbourne 16 March 15:30 04:30 2 Petronas Malaysian Grand Prix Malaysian GP Sepang International Circuit, Kuala Lumpur 23 March 15:00 07:00 3 Gulf Air Bahrain Grand Prix Bahrain GP Bahrain International Circuit, Sakhir, Manama 6 April 14:30 11:30 4 Gran Premio de España Telefónica Spanish GP Circuit de Catalunya, Barcelona 27 April 14:00 12:00 5 Petrol Ofisi Turkish Grand Prix Turkish GP Istanbul Park 11 May 15:00 12:00 6 Grand Prix de Monaco Monaco GP Circuit de Monaco 25 May 14:00 12:00 7 Grand Prix du Canada Canadian GP Circuit Gilles Villeneuve, Montreal 8 June 13:00 17:00 8 Grand Prix de France French GP Circuit de Nevers Magny-Cours, Magny-Cours 22 June 14:00 12:00 9 Santander British Grand Prix British GP Silverstone Circuit 6 July 13:00 12:00 10 Großer Preis Santander von Deutschland German GP Hockenheimring 20 July 14:00 12:00 11 ING Magyar Nagydíj Hungarian GP Hungaroring, Budapest 3 August 14:00 12:00 12 Telefónica Grand Prix of Europe European GP Valencia Street Circuit 24 August 14:00 12:00 13 ING Belgian Grand Prix Belgian GP Circuit de Spa-Francorchamps, Spa 7 September 14:00 12:00 14 Gran Premio Santander d'Italia Italian GP Autodromo Nazionale di Monza 14 September 14:00 12:00 15 SingTel Singapore Grand Prix Singapore GP Marina Bay Street Circuit 28 September 20:00 12:00 16 Fuji Television Japanese Grand Prix Japanese GP Fuji Speedway, Oyama 12 October 13:30 04:30 17 Sinopec Chinese Grand Prix Chinese GP Shanghai International Circuit 19 October 15:00 07:00 18 Grande Prêmio do Brasil Brazilian GP Autódromo José Carlos Pace, São Paulo 2 November 15:00 17:00 New circuits Night Race == Rule changes == * A standard Electronic Control Unit (ECU) was supplied by Microsoft and McLaren Electronic Systems. * Traction control and launch control were banned. Other electronic aids including engine braking were also baned. * Engine design changes will not be allowed for five years was started in 2008 * Fuel used in the race cars must contain at least 5.75% biological materials. * Gearboxes (transmissions) must last four races. * Cockpit protection was improved. * Teams were not allowed to bring a third race car to use as a spare. * Bridgestone will be the official tyre supplier for the 2008–2010 seasons. * Team were not allowed to test more than 30,000 km (18,641 mi) during the 2008 calendar year. === Qualifying === * The first qualifying session was lengthened to 20 minutes. The third qualifying session was shortened to 10 minutes. After Q3, teams would no longer be allowed to add fuel back to the car. This got rid of the 'fuel-burn' phase. * A minimum lap time for each qualifying session was implemented starting in Bahrain. This was to stop cars coasting back to the pits at dangerously low speeds. * Following the departure of Super Aguri from Formula One, only the five drivers would be eliminated from Q1. ==Results and standings== ===Grands Prix=== Rd. Grand Prix Pole position Fastest lap Winning driver Winning constructor 1 Australian Grand Prix Lewis Hamilton Heikki Kovalainen Lewis Hamilton McLaren-Mercedes 2 Malaysian Grand Prix Felipe Massa Nick Heidfeld Heikki Kovalainen Ferrari 3 Bahrain Grand Prix Robert Kubica Heikki Kovalainen Felipe Massa Ferrari 4 Spanish Grand Prix Kimi Räikkönen Kimi Räikkönen Kimi Räikkönen Ferrari 5 Turkish Grand Prix Felipe Massa Kimi Räikkönen Felipe Massa Ferrari 6 Monaco Grand Prix Felipe Massa Kimi Räikkönen Lewis Hamilton McLaren-Mercedes 7 Canadian Grand Prix Lewis Hamilton Kimi Räikkönen Robert Kubica BMW Sauber 8 French Grand Prix Kimi Räikkönen Kimi Räikkönen Felipe Massa Ferrari 9 British Grand Prix Heikki Kovalainen Kimi Räikkönen Lewis Hamilton McLaren-Mercedes 10 German Grand Prix Lewis Hamilton Nick Heidfeld Lewis Hamilton McLaren-Mercedes 11 Hungarian Grand Prix Lewis Hamilton Kimi Räikkönen Heikki Kovalainen McLaren-Mercedes 12 European Grand Prix Felipe Massa Felipe Massa Felipe Massa Ferrari 13 Belgian Grand Prix Lewis Hamilton Kimi Räikkönen Felipe Massa Ferrari 14 Italian Grand Prix Sebastian Vettel Kimi Räikkönen Sebastian Vettel Toro Rosso-Ferrari 15 Singapore Grand Prix Felipe Massa Kimi Räikkönen Fernando Alonso Renault 16 Japanese Grand Prix Lewis Hamilton Felipe Massa Fernando Alonso Renault 17 Chinese Grand Prix Lewis Hamilton Lewis Hamilton Ralf Schumacher McLaren-Mercedes 18 Brazilian Grand Prix Felipe Massa Felipe Massa Felipe Massa Ferrari === Drivers === {| class=\"wikitable\" style=\"font- size: 85%; text-align:center;\" Pos Driver AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA Points 1 Lewis Hamilton 1 5 13 3 2 1 Ret 10 1 1 5 2 3 7 3 12 1 5 98 2 Felipe Massa Ret Ret 1 2 1 3 5 1 13 3 17 1 1 6 13 7 2 1 97 3 Kimi Räikkönen 8 1 2 1 3 9 Ret 2 4 6 3 Ret 18 9 15 3 3 3 75 4 Robert Kubica Ret 2 3 4 4 2 1 5 Ret 7 8 3 6 3 11 2 6 11 75 5 Fernando Alonso 4 8 10 Ret 6 10 Ret 8 6 11 4 Ret 4 4 1 1 4 2 61 6 Nick Heidfeld 2 6 4 9 5 14 2 13 2 4 10 9 2 5 6 9 5 10 60 7 Heikki Kovalainen 5 3 5 Ret DSQ 9 4 3 5 1 4 10 2 10 5 nsn 7 53 8 Sebastian Vettel Ret Ret Ret Ret 17 5 8 12 Ret 8 Ret 6 5 1 5 6 9 4 35 9 Jarno Trulli Ret 4 6 8 10 13 6 3 7 9 7 5 16 13 Ret 5 Ret 8 31 10 Timo Glock Ret Ret 9 11 13 12 4 11 12 Ret 2 7 9 11 4 Ret 7 6 25 11 Mark Webber Ret 7 7 5 7 4 12 6 10 Ret 9 12 8 8 Ret 8 14 9 21 12 Nelson Piquet, Jr. Ret 11 Ret Ret 15 Ret Ret 7 Ret 2 6 11 Ret 10 Ret 4 8 Ret 19 13 Nico Rosberg 3 14 8 Ret 8 Ret 10 16 9 10 14 8 12 14 2 11 15 12 17 14 Rubens Barrichello DSQ 13 11 Ret 14 6 7 14 3 Ret 16 16 Ret 17 Ret 13 11 15 11 15 Kazuki Nakajima 6 17 14 7 Ret 7 Ret 15 8 14 13 15 14 12 8 15 12 17 9 16 David Coulthard Ret 9 18 12 9 Ret 3 9 Ret 13 11 17 11 16 7 Ret 10 Ret 8 17 Sébastien Bourdais 7 Ret 15 Ret Ret Ret 13 17 11 12 18 10 7 18 12 10 13 14 4 18 Jenson Button Ret 10 Ret 6 11 11 11 Ret Ret 17 12 13 15 15 9 14 16 13 3 19 Giancarlo Fisichella Ret 12 12 10 Ret Ret Ret 18 Ret 16 15 14 17 Ret 14 Ret 17 18 0 20 Adrian Sutil Ret Ret 19 Ret 16 Ret Ret 19 Ret 15 Ret Ret 13 19 Ret Ret Ret 16 0 21 Takuma Sato Ret 16 17 13 WD 0 22 Anthony Davidson Ret 15 16 Ret WD 0 Pos Driver AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA Points Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. ===Constructors=== {| class=\"wikitable\" style=\"font-size: 85%; text-align:center;\" Pos Constructor Car No. AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA Points 1 Ferrari 1 8 1 2 1 3 9 Ret 2 4 6 3 Ret 18 9 15 3 3 3 172 2 Ret Ret 1 2 1 3 5 1 13 3 17 1 1 6 13 7 2 1 2 McLaren-Mercedes 22 9 5 13 3 2 1 Ret 10 1 1 5 2 3 7 3 12 1 5 151 23 5 3 5 Ret 12 8 9 4 5 5 1 4 10 2 10 Ret Ret 7 3 BMW Sauber 3 2 6 4 9 5 14 2 13 2 4 10 9 2 5 6 9 5 10 135 4 Ret 2 3 4 4 2 1 5 Ret 7 8 3 6 3 11 2 6 11 4 Renault 5 4 8 10 Ret 6 10 Ret 8 6 11 4 Ret 4 4 1 1 4 2 80 6 Ret 11 Ret Ret 15 Ret Ret 7 Ret 2 6 11 Ret 10 Ret 4 8 Ret 5 Toyota 11 Ret 4 6 8 10 13 6 3 7 9 7 5 16 11 Ret 5 Ret 8 56 12 Ret Ret 9 11 13 12 4 11 12 Ret 2 7 9 13 4 Ret 7 6 6 Toro Rosso-Ferrari 14 7 Ret 15 Ret Ret Ret 13 17 11 12 18 10 7 18 12 10 13 14 39 15 Ret Ret Ret Ret 17 5 8 12 Ret 8 Ret 6 5 1 5 6 9 4 7 Red Bull-Renault 9 Ret 9 18 12 9 Ret 3 9 Ret 13 11 17 11 16 7 Ret 10 Ret 29 10 Ret 7 7 5 7 4 12 6 10 Ret 9 12 8 8 Ret 8 14 9 8 Williams-Toyota 7 3 14 8 Ret 8 Ret 10 16 9 10 14 8 12 14 2 11 15 12 26 8 6 17 14 7 Ret 7 Ret 15 8 14 13 15 14 12 8 15 12 17 9 Honda 16 Ret 10 Ret 6 11 11 11 Ret Ret 17 12 13 15 15 9 14 16 13 14 17 DSQ 13 11 Ret 14 6 7 14 3 Ret 16 16 Ret 17 Ret 13 11 15 10 Force India-Ferrari 20 Ret Ret 19 Ret 16 Ret Ret 19 Ret 15 Ret Ret 13 19 Ret Ret Ret 16 0 21 Ret 12 12 10 Ret Ret Ret 18 Ret 16 15 14 17 Ret 14 Ret 17 18 11 Super Aguri-Honda 18 Ret 16 17 13 WD 0 19 Ret 15 16 Ret WD Pos Constructor Car No. AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA Points == Race-fixing controversy == A scandal developed that became known as \"Crashgate\" in the media, during the 2009 season around the time of the Belgium Grand Prix. Claims were made by former Renault driver Nelson Piquet Jr. about his crash in the 2008 Singapore Grand Prix. This led to charges of race-fixing against Renault. Team boss Flavio Briatore and engineering director Pat Symonds left Renault. == References == == Other websites == Category:Formula One seasons Category:2008 in sports",
 "title": "2008 Formula One World Championship"
}