{
 "id": "145696",
 "text": "Hurricane Nora was the first hurricane to cause a significant danger to the Continental United States since Kathleen in 1976. Part of a tropical wave that contributed to the formation of Hurricane Erika in the Atlantic moved into the Pacific and became Tropical Depression 16-E on September 16 and Tropical Storm Nora that same day. It became a hurricane on September 18 while moving northwest. Its motion then stalled over an upwelling of cooler water that weakened it. On September 20, Nora again started moving. It reached its peak intensity of 115 knots and 950 mb On September 21 and 22 it moved over the wake of Hurricane Linda. This weakened the storm back down to a Category 1. A trough developed that turned Nora to the northeast. This carried Nora over a favorable environment and towards Baja California. After restrengthening slightly, Nora made landfall as a Category 1 hurricane near Punta Eugenia and again south of San Fernando, both times as a hurricane. Nora stayed a tropical storm as it moved into the United States. Yuma reported sustained gale-force winds. Rains were heavy, sometimes exceeding the \"annual\" rainfall for the area. Nora weakened to a depression while over California, and it was over on September 26. Nora killed two people in Mexico. One was killed by a downed power line in Mexicali, and the other was a scuba diving in underwater currents. No one in the United States was directly killed by Nora. However, the California Highway Patrol said several traffic accident deaths were due to the weather. There was extensive damage to areas hit by Nora. Waves ruined dozens of homes. 350 to 400 people were left homeless in San Felipe, and winds uprooted trees and peeled roofs from homes in Puerto Peñasco. In the United States, thousands were left without power in California and Arizona, and 16 telephone poles were downed in Seeley. Streets flooded in San Diego, Indio, El Centro, and Palm Springs. The winds damaged trees and three homes in Utah. Total damages were \"several hundred million dollars\", as well as 40 million dollars to lemon trees. On September 24, Arizona Governor Jane Dee Hull activated an emergency response center to prepare the state's response to the flash flooding the storm would cause on the dry desert floor, and Yuma residents began to fill about 55,000 sandbags to contain the possible flooding. Hull also activated the state's National Guard, and sent drinking water and electric generators to Yuma. Farther inland, the National Weather Service issued flash flood watches for western Arizona, southeastern California, southwestern Colorado, southern Nevada and southern Utah on September 26. The Yuma radar indicated a small area of rainfall totals along the northern Gulf of California coast of Baja California. In the United States, the largest total rainfall was recorded at the Harquahala Mountains in Arizona, where of rainfall were recorded as a result of Nora, causing flash floods in western Arizona. Near Phoenix, rainfall from the storm caused the Narrows Dam, a small earthen dam, to fail. In other locations in Arizona, California, Nevada, and Utah, more than occurred in a few localized areas, sometimes comparable to the entire local yearly average rainfall. Flooding was also reported in Somerton, San Diego, El Centro, Palm Springs and Indio, while 12,000 people lost power in Yuma, as well as Los Angeles and southwestern Utah. Despite the damage, the World Meteorological Organization did not retire the name Nora during its meeting in the spring of 1998. As a result, it was used in the 2003 Pacific hurricane season and was on the list of names to be used in 2009. == References == Category:1997 in California Category:1997 events Category:1990s in Mexico Category:1990s in Arizona Category:1990s in weather Category:1997 Pacific hurricane season",
 "title": "Hurricane Nora (1997)"
}