{
 "id": "145858",
 "text": "Robert II (2 March 1316 - 19 April 1390) was King of Scotland from 1371 through 1390. He was the first king of the House of Stewart. He is known as Robert the Steward and succeeded the popular David II to the throne. He was crowned in 1371 and had 1 child, Robert III or \"Robert the Lame\" with Elizabeth Mure, he was mentally unstable and was born as John Stewart, he changed his name to Robert as he would be crowned John II recognizing John Balliol's claim as legitimate which would spark war. == Birth == He was born on 2 March 1316 in Paisley Abbey, Renfrewshire. He was the son of Walter Stewart and Marjorie Bruce. His mother died in childbith on 2 March and his father died 1326 and was buried in Paisley Abbey, where Robert II was born. == Reign == His reign began on 22 February 1371 upon his uncle's death (David II), he descended through Robert the Bruce and was crowned on March 26th of 1371. He wasn't a very popular king and died on 19 April 1390, he was succeeded by his son Robert III. == Marriage == He had 2 wives during his lifetime, his first wife Elizabeth Mure and his second wife Euphemia de Ross.King Robert II had more children than any other King of Scotland, in all 15 by his two marriages. By Elizabeth he had: (1) John, Earl of Carrick (later ROBERT III) c.1337-1406 (2) Walter Stewart c. 1338-1362 (3) Robert, Earl of Albany c. 1340-1420 (4) Margaret Stewart m. John Macdonald, Lord of the Isles (5) Alexander, Earl of Buchan 'The Wolf of Badenoch' c.1343-1405 (6) Marjorie Stewart m. (i) John Dunbar, Earl of Moray (ii) Alexander Keith (7) Jean Stewart m. (i) Sir John Keith (ii) Sir John Lyon (iii) Sir James Sandilands (8) Isabel Stewart m. (i) James Douglas, Earl of Douglas (ii) David Edmondstone (9) Katherine Stewart (10) Elizabeth Stewart m. sir Thomas Hay, Lord High Constable of Scotland By Ephemia he had: (11) David, Earl of Caithness d. before 1389 (12) Walter Stewart, Earl of Atholl d. 1437 (13) Margaret Stewart (14) Elizabeth Stewart m. David Lindsay, Earl of Crawford (15) Egidia Stewart m. Sir William Douglas of Nithsdale Robert II also had 8 illegitimate children by various mothers == Depictions/Paintings == File:Robert II of Scotland (James Roberts).jpg|Robert Stuart II by James Roberts. c. 1600 (print). File:Robert II, King of Scotland seal.png|Seal of Robert II. File:Robert II, King of Scotland.png|Depiction of Robert II (crooked eyes). File:Robert II of Scotland groat 1371 612678.jpg|Groat of Robert II. File:Robert II, King of Scotland from 1371 Wellcome L0010446.jpg|Seal of Robert II (depiction of the seal). File:Robert II Stewart.jpg|Print of Robert II with Euphemia de Ross. ==References== Category:Kings and Queens of Scotland Category:1316 births Category:1390 deaths Category:14th century in Scotland Category:People from Paisley, Renfrewshire",
 "title": "Robert II of Scotland"
}