{
 "id": "145916",
 "text": "Professional wrestling has accrued a considerable amount of slang, in- references and jargon. Much of it stems from the industry's origins in the days of carnivals, and the slang itself is often referred to as \"carny talk.\" Often wrestlers used this lingo in the presence of fans so as not to reveal the worked nature of the business. In recent years, widespread wrestling discussion on the Internet popularized the terms. == A == ;A-Show: A wrestling event where generally a company's biggest \"draws\" perform. ;A-Team: A group of a wrestling promotion's top stars who compete at a given event. (Compare \"B-Team\") ;Abortion (or abort): To discontinue a feud, angle, or \"gimmick\" suddenly, usually without explanation or due to a lack of fan interest. This is an older term, and used less frequently today as the word carries a connotation that some find objectionable. ;Agent (road agent): Management employee, often a former veteran wrestler, who helps wrestlers set up matches, plans storylines, and relays instructions from the bookers. Often acts as a liaison between wrestlers and higher-level management. Referred to as \"producers\" by WWE and \"coaches\" by AEW. Sometimes they help train and teach younger active wrestlers and give constructive criticism. ;Andre shot: A camera trick by which a wrestler is made to appear larger by placing a camera below the wrestler and shooting upward. Named for André the Giant, a frequent subject of such camera shots. ;Angle: A fictional storyline. An angle may be as small as a single match or a vendetta that lasts for years. It is not uncommon to see an angle become retconned due to it not getting \"over\" with the fans, or if one of the wrestlers currently involved in the angle is released from his contract. ;Apter mag: An old-style professional wrestling magazine that sticks to kayfabe and usually consists of made-up articles and interviews. The term refers to the magazines at one time connected to journalist Bill Apter, such as Pro Wrestling Illustrated. ;Attitude Era:Refers to a time period from 1997-2002 when the World Wrestling Federation product shifted from being family-oriented entertainment to being \"edgier,\" more crude, and dealing with more \"adult\" situations (frequently sexual in nature). == B == ;B-Show: a wrestling event featuring the middle and lower-level talent of a wrestling promotion. ;B-Team: group of wrestlers on a B-Show. Frequently, the B-Team will compete at a different venue the same night wrestlers on the A-Team are competing in a different event, although a promotion will sometimes schedule an event with B-Team wrestlers to test a new market. ;Babyface: a good guy. (Compare \"tweener\" and \"heel\") ;Backyard wrestling: the act of staging pro-style wrestling (not to be confused with sport wrestling or amateur wrestling) as a hobby rather than a job, usually (but not always) by untrained performers, predominantly teenagers. The term can also be used for an independent promotion that has very little, if any, notability. ;Beat down: when a wrestler or other performer is the recipient of a beating, usually by a group of wrestlers. ;Blade: a sharpened object used for \"blading\". The blade is usually concealed in tape on the hands or somewhere it can be utilized without being obvious.Harley Race, Ricky Steamboat, Les Thatcher. The Professional Wrestlers' Workout & Instructional Guide (p.106) ;Blading: the act of cutting ones self or another person open in order to bleed, usually done on the forehead. (Compare \"juicing\") ;Blind: when a referee has his back turned while the other side is cheating. Usually done by heels in order to gain the advantage in a match. ;Blind tag: a tag made in a tag team match where the wrestler on the apron, tags his partner unbeknownst to him or without his consent. It can also refer to such a tag where the tagger's opponent is unaware a tag has occurred, leaving him open to a blind-side attack. Most often occurs when the partner in the ring is thrown against the ropes or backed into their own corner. ;Blow off: the final match in a feud. While the involved wrestlers often move onto new feuds, sometimes it is the final match in the promotion for one or more of the wrestlers. ;Blown spot or botched spot: a spot that does not go as planned. ;Blue Eye: another term for a babyface. Used primarily in British wrestling. ;Booked: a term that refers to the predetermined nature of wrestling. For example, a booker will book a wrestler to win or lose a match, or a booker will book a wrestler to engage in a particular storyline. ;Booker: the person in charge of setting up matches and writing angles; referred to as the \"Creative Team\" by WWE. ;Booking: what a \"booker\" does. Booking is also the term a wrestler uses to describe a scheduled match or appearance on a wrestling show. ;Botch: an incident which went wrong. ;Bump: when a wrestler hits the mat or ground.Foley, Mick. Have A Nice Day: A Tale of Blood and Sweatsocks (p.65) ;Bury: refers to the worked lowering (relegation) of a popular wrestler's status in the eyes of the fans. Very common in WWE(Compare \"push\") ;Busted open: term used to describe a wrestler that is bleeding. (Compare \"juicing\") == C == ;Call: when one wrestler instructs the other of what is going to happen in the match. ;Canned heat: when cheers or boos are pumped into an arena via the sound system or added to a television show in post-production. ;Card: the lineup of the matches that will be staged at a given venue for a given performance. The card is generally performed in a roughly inverse order to the way in which it might be printed for posters or other promotional materials. The major matches between well-known opponents may be for \"titles\" and are said to be \"top of the card\" or \"headliners\" while the preliminary matches between lesser-known opponents are said to be the \"undercard.\" In Lucha libre, cards are generally five matches although big events might have more and smaller promotions might not run the full five match card. The first match is called the Primera Lucha, the second is called the Segunda Lucha, the third is usually the Combate Especial or the Lucha Especial, the fourth or second to last match is called the Lucha Semifinal, and the main event is called the Lucha Estelar or Lucha Estrella. ;Carny: A language used by wrestlers to talk to each other around people not associated with the business so they would not understand what they were saying, often used to keep the secrets of the business. ;Carry: the act of one wrestler doing most of the work (selling moves, calling spots) to make a match watchable. ;Championship: in kayfabe, a recognition of a wrestler being the best in his or her promotion or division in the form of a championship belt (also \"title\" or \"strap\"). Outside of kayfabe, championships are won/held by a wrestler whom the bookers believe will generate fan interest in terms of event attendance and television viewership. ;Cheap heat: when a wrestler (often a heel) incites a negative crowd reaction by insulting the crowd (by insulting the city or a local sports team) or by using a news event as part of his promo. ;Cheap pop: when a wrestler (often a face) incites a positive crowd reaction by \"kissing up\" to the crowd (for example, mentioning the name of the city or complimenting a local sports team). Mick Foley notoriously uses cheap pops by using the city's name and giving a \"thumbs-up\" to the camera. ;Cheap shot: when a wrestler uses a low blow or a foreign object to get an advantage over his opponent. ;Chemistry: when two wrestlers work well together by pulling off each other's moves well and telling the story well to the audience. ;Clean finish: when a match ends without cheating or outside interference, usually in the center of the ring. (Compare \"screwjob\") ;Closet champion: a current titleholder (usually a heel) who ducks top-flight competition, cheats to win (often by managerial interference), and—when forced to wrestle good opponents—deliberately causes himself to be disqualified (since titles often do not change hands by disqualification) to retain his title. ;Color: a term used by wrestlers and promoters to discuss the amount of bloodshed in a match.Stone Cold Steve Austin. The Stone Cold Truth (p.90) ;Color commentator: a member of the announcing team who assists the play-by-play announcer by filling in any time when play is not in progress, providing humor, and explaining storylines. Color commentators are often retired or inactive professional wrestlers, such as Matt Striker, Tazz, JBL, and Jerry Lawler of WWE. ;Cue: a term that lets other wrestlers know when something should happen, usually after a move. ;Curtain Call or The MSG Incident:the incident at Madison Square Garden in the spring of 1996, when WWE superstars Shawn Michaels, Diesel, Razor Ramon, and Triple H (The Kliq) broke kayfabe in front of a live sold out New York crowd, playing it out in a farewell to the crowd and a group hug. ;Curtain jerker: the first wrestler to walk out to the ring in the first match of the event, usually a jobber. == D == ;Dark match: a non-televised match at a televised show used to warm up the crowd (compare \"house show\"). A dark match before the show is usually used to test out new talent (often local to the event). A dark match after the show typically features main-event level wrestlers either to sell more tickets, or send the crowd home happy. ;Dead weight: when a wrestler goes limp in the middle of a move. This could be done intentionally, either to make his opponent look weak or just \"rib\" him, or unintentionally because the \"dead weight\" wrestler is unfamiliar with the cooperation needed to pull off a particular wrestling hold (or just not paying attention) or as a result of injury. See (Sandbag) ;Deathmatch wrestling: a vaunted form of hardcore wrestling in which many of the normal rules do not apply; lots of blood, graphic violence, and weapons such as barbed wire, panes of glass, fluorescent-light tubes, light bulbs, weed whackers, fire, C4 explosives, thumbtacks and mousetraps that will also strongly featured and strongly encouraged, typically leading to a bloody and more violent contest. See also Hardcore wrestling ;Decision: a decision simply refers to the result of a match, by whatever means it came about. ;Dirt sheet: an insider letter in the professional wrestling business.Stone Cold Steve Austin. The Stone Cold Truth (p.83) ;Disqualification: this happens when a wrestler performs a maneuver such as a hitting someone in the testes or hitting someone with a weapon (like a folding chair). The wrestler that performed such a move is disqualified or loses the contest. ;Diva: aside from the original meaning of a hard-to-work- with individual, this term was used, mainly by WWE, to refer to any woman involved in wrestling, either as \"eye candy\" or as a wrestler (or frequently both). ;Double turn: the rare occurrence when both the heel and the face switch roles during an angle or a match. An example of this is the Bret Hart/Steve Austin match at WrestleMania 13. ;Draw: a wrestler who is able to attract the attention of the audience; someone fans are willing to pay to see. ;Drawing power: having recognition with the fans as a star, with fans paying to see them. ;Drop: when a wrestler is booked to lose to a contender. (the loser agreed to drop the match to the winner) ;Drop the belt: When a champion is booked to lose to a challenger; thus having the title and belt change hands. It is usually seen as an honor to give another wrestler the championship; conversely those who refuse to drop the belt and hog the title are seen often unfavorably. ;Dud: a very poor, boring or otherwise uninteresting match. It can also be a match with morally objectionable elements. ;Dusty finish: an ambiguous finish to a match where either wrestler can be claimed the winner. The \"Dusty\" in the term refers to Dusty Rhodes, who booked many such finishes in NWA and later in WCW. == E == ;Enforcer: a wrestler who accompanies another to matches, and acts as a bodyguard. This term was invented by Arn Anderson, whose nickname was \"The Enforcer\". Another definition is an individual (usually a celebrity) who acts in a \"special guest referee\" capacity from outside the ring, usually favoring one wrestler over another (such as Chuck Norris at Survivor Series 1994 or Mike Tyson at WrestleMania XIV). ;Exótico: a male wrestler, typically a Mexican luchador, who performs in drag. ;Extreme wrestling: a style of wrestling based heavily on highspots and weapon attacks. See also Hardcore wrestling. ;Extremists: Term briefly used by WWE to refer to its ECW brand wrestlers to emphasize that they, and the ECW brand, are more \"extreme\" in comparison to the Raw and SmackDown superstars. == F == ;Face: short for \"babyface\", which means the good guy.Foley, Mick. Have A Nice Day: A Tale of Blood and Sweatsocks (p.2) ;Faction: see \"stable.\" ;Fall: usually, the ending of the match. A fall is obtained by gaining a decision in any manner. In a two out of three falls match, a wrestler must gain two decisions to win instead of only one. (See decision and near fall) ;False comeback: when a face mounts a brief offensive flurry before losing it to a heel wrestler after being dominated for several minutes. Usually, it occurs before the actual comeback. (Also known as hope spot.) ;Feud: a battle between two or more wrestlers or stables, often involving matches, promos, and angles. A feud usually lasts for several months. ;Fighting Champion: A champion who defends his title often. ;Finish: the planned end of a match. (See \"Dusty Finish\" and \"Clean Finish\") ;Finisher: a wrestler's trademark move that usually leads to a finish. ;Flair Flip or Flair Flop: a move, popularized by Ric Flair, where a wrestler is flipped upside down upon hitting the corner turnbuckle and often ends up on the other side of the ropes on his feet on the ring apron. ;Flat back bump: a bump in which a wrestler lands solidly on his back with high impact, spread over as much surface as possible. ;Foreign object: an object that is illegal to the match, such as a chair, brass knuckles, garbage can, etc. was called \"International Object\" in the 1980s, during a time when no one was to use the word \"foreign,\" but instead \"international.\"Foley, Mick. Have A Nice Day: A Tale of Blood and Sweatsocks (p.167) ;Freebird rule: an unofficial rule which allows any two members of a stable with three or more members to challenge for and defend a tag team championship. Named for the Fabulous Freebirds, who famously did this in Georgia Championship Wrestling. ;future endeavored: Fired or otherwise released from a promotion. Inspired by WWE's announcement of a wrestler's release, typically wishing the subject \"all the best in their future endeavors.\" == G == ;Gaijin: an American, or other foreign worker in Japanese promotions. This is not strictly a wrestling term, as it is a derogatory Japanese word for a foreigner. ;Garbage wrestling: \"hardcore\" matches or extremely spot heavy matches wherein wrestlers use nothing but weaponry or highly planned out spots to attack each other; the term also refers to outrageous gimmick matches that have no obvious elements of traditional in-ring competition. The term was coined by Giant Baba of All Japan Pro Wrestling when he referred to Atsushi Onita's FMW promotion (which used barbed wire and other such dangerous implements) as \"garbage.\" The term later evolved to encompass spotfests as well. ;Gas: 1. Steroids (see also juice and roids) or 2. Stamina (as in \"out of gas\", when a wrestler is tired and unable to perform properly) ;Gate: amount of money generated from ticket sales. Merchandise sales are often a part of \"the gate.\" ;Get over: a campaign designed by the bookers to make a wrestler (or a group of wrestlers) either popular or a credible threat; in other words, someone that an audience would pay to see. ;Gig: the blade a wrestler uses to cut himself. ;Gimmick: a wrestler's personality (the \"Evil Boss\" Vince McMahon), behaviour (the \"cocky\" Chris Jericho), attire (the \"Arabian\" Sabu), and/or other distinguishing traits while performing (the \"daredevil\" Jeff Hardy). It can also be an implement used to cheat (the guitar used by Jeff Jarrett to knock opponents out). In recent years, the emphasis has been on more realistic gimmicks (with rare exceptions such as The Undertaker) which portray the wrestler as an actual person, albeit with exaggerated personality traits, as opposed to previous years during which gimmicks could be best described as \"cartoonish\". A wrestler may be expected to portray many gimmicks during their career, most of which may be implausible or inconsistent. Sometimes a wrestler may undergo a complete change of on-screen personality from one week to the next, an example was Charlie Haas. ;Gimmick table: place where a (usually independent) wrestler sells his merchandise, usually by the concession stand. ;Go over: to beat someone. ;Gorilla Position: the staging area just behind the entrance curtain, where wrestlers wait before they come into view of the crowd. Named after Gorilla Monsoon, who established the position's importance and could often be found there. Known as the \"Jody Position\" in World Championship Wrestling after Jody Hamilton, and the \"Dusty Position\" in All Elite Wrestling after Dusty Rhodes. ;Green: refers to a wrestler (often called a green horn) who is in the early stages of their career and, as a result, may be prone to make mistakes because of their inexperience. ;Gusher: a deep cut that bleeds a lot, usually caused by a mistake while blading but can be intentional. == H == ;Hangman: when a wrestler twists the second rope over the third with his neck caught in-between, which results in the illusion of the wrestler hanging by his neck from the ropes. ;Hardcore wrestling: matches that focus on blood, real violence, the brutality of the attacks, and the use of weapons and other obstacles of various sorts such as chairs, chains, tables, kendo sticks, fireballs, ladders, crowbars, and tire irons, often combined with brawling all over the arena and/or anywhere, rather than minimal technical wrestling and traditional wrestling holds and techniques, also referred to by some as garbage wrestling. ;Heat: a wrestler getting a negative crowd reaction. (See \"cheap heat\" and \"canned heat\") ;Heat Magnet: A wrestling persona that draws a lot of heat from the crowd whenever cutting a promo or simply making his or her appearance. ;Head drop: a move which, as a result of a botch, causes the receiver to be dropped on their head, often resulting in a legit concussion or other injury such as a broken neck. Also, especially in puroresu, the term can refer to a bump which is intended to make a move appear as if the receiver landed on his/her head. In reality, the full force of the move is intended to be taken on the upper back and shoulders, though such moves still carry a high degree of legitimate risk with them. ;Heel: a bad guy. (Compare \"tweener\" and \"face\") ;Highspot: the top-ring rope moves and/or the series of maneuvers, along with fast motions among two or more wrestlers, that could perceived to both risky and very dangerous. ;Hooker: a wrestler with strong legitimate mat- wrestling abilities and an array of match-ending (or in extreme cases, career ending) holds known as \"hooks,\" hence the name. In the early 20th century, one who has worked for carnivals taking on \"all comers.\" Since these types of events are on the decline, this word is falling out of common usage. A hooker is the opposite of a pure performer. Examples include Lou Thesz. ;Hoss: a term used in the past by Jim Ross of WWE to refer to large wrestlers with a very limited move capacity, inspired by Hoss Cartwright of Bonanza. ;Hotshot: when a promoter or booker rushes to a feud, a climax of a feud, or books a big match on television instead of at a pay-per-view in order to get a short-term boost for business. Also applies to angles or turns that are done for shock value rather than acting as a part of an ongoing storyline. ;Hot tag: in a tag team match, when a face wrestler tags in a fresh partner after several minutes of being dominated by his opponents. Often the hot tag happens after several teases (where the other face is enticed into the ring, only to be stopped by the referee and the heels getting away with illegal tactics). ;House show: a non-televised show. (Compare \"dark match\") ;Hulking Up: when a wrestler begins to come back in a match by no-selling a wrestler's moves and fights back. Named for Hulk Hogan, who did this in many of his matches in America. (See \"Superhuman Comeback\") == I == ;Indy: short for \"independent promotion,\" refers to a wrestling group that is too small to compete on a national level. ;IWC: Internet wrestling community; the community of Internet users (some of them smarks on social media) who discuss professional wrestling online == J == ;Job: a scheduled loss. ;Jobber: a wrestler whose primary function is losing to better-known wrestlers. ;Jobber to the Stars: a mid-card wrestler who is fairly well-known and gains victories over lesser-known wrestlers on occasion, but is primarily used as a jobber to talent higher on the card than him. These are usually either former main eventers or mid carders who are no longer a serious draw, but can get an up-and-coming wrestler over due to their past credentials. ;joshi: short for joshi puroresu, Japanese women's professional wrestling. ;Juice: steroids. (See gas and roids). It can also mean blood, usually from the forehead. ;Juicing: bleeding (frequently, but not always, self-inflicted). (Compare \"blading\".) == K == ;Kayfabe: term used to describe the illusion (and up-keep of the illusion) that professional wrestling is not staged (i.e. that the on-screen situations between performers represent reality). Also used by wrestlers as a signal to close ranks and stop discussing business due to an uninformed person arriving in earshot.Stone Cold Steve Austin. The Stone Cold Truth (p.55) The term is said to have been loosely derived from the Pig Latin pronunciation of the word \"fake\" (\"akefay\"). == L == ;Legit: anything that is \"real\"; for example, a \"legit\" wrestler has a background in actual fighting, a \"legit\" event is one that actually took place (outside of kayfabe), a \"legit\" fight is when two wrestlers actually come to blows. Often used as a synonym for shoot. ;Legit heat: a real-life conflict between wrestlers. ;Lock up: a grapple at the beginning of a match.Foley, Mick. Have A Nice Day: A Tale of Blood and Sweatsocks (p.74) ;Low Blow: where a wrestler hits the other wrestler in the crotch. ;Luchacore wrestling (also known as Extreme Lucha Libre): a Mexican high-flying, hard-hitting version of hardcore wrestling that will emphasize the use of weapons (such as tables, ladders, chairs, chains, kendo sticks, fireballs, ladders, and tire irons) and weaponry-based strikes from Hardcore wrestling and the high-flying aerial wrestling moves of Mexican lucha libre. ;Lucha libre or Lucha : Mexican professional wrestling, which translates to \"Free Fighting\". It is used to describe the Mexican style of wrestling that consists of high-flying acrobatic wrestling moves. ;Luchador: a Mexican wrestler. Strictly applies only to male wrestlers; a female wrestler is called a luchadora. ;Lucharesu : A Japanese-inspired version of lucha libre style of pro wrestling that will emphasize the stiff strikes, suplexes, and power moves of Japanese puroresu (or Strong-style wrestling) and the high-flying aerial wrestling moves of Mexican lucha libre. : == M == ;Main eventer: a wrestler who is viewed by management to be one of the top draws on the roster and thus is promoted in Main Events. ;Manager: a performer assigned to accompany a wrestler to the ring and, usually, put them over in interviews. They are often used to help a heel cheat and incite the crowd. ;Mania Era: (also referred to as the Federation Years) refers to the time period spanning from 1984 to 1993 in WWF history when Vince McMahon took the company from being a regionally promoted business to a successful national business. The term \"Mania\" denoting the era is attributed to \"Hulkamania\" being the dominant aspect of the era. This time is also sometimes referred to as the Showtime Era, The Superstars Era, The Hulkamania Era, or the Federation Era. ;Mark: a slang term that describes a fan who believes that the characters and events of some or all of professional wrestling are real. The term can also be applied to a fan who idolizes a particular wrestler, promotion, or style of wrestling to a point some might consider excessive. (Compare \"smark\") ;married: To be paired with another wrestler (or tag team) in a long series of matches. ;Mid-carder: a wrestler who wrestles in the middle of programs, is seen as being high in seniority but less than a money draw, usually competing for the secondary title of a federation. ;Missed spot: a move in which the timing is off or it showed \"light\". Also referred to as a Blown Spot. ;Money match: a non-title match which was the most heavily promoted of the card that is placed near or at the end of a live event, which is the main reason fans attended the event or watched the event. ;Monster heel: a villain who is portrayed as unstoppable, usually to set up a feud with a promotion's lead face. Particularly applies to heels who are physically monstrous, grotesque, or just plain scary. ;Montreal Screwjob: an incident at Survivor Series in 1997 where referee Earl Hebner claimed that Bret Hart submitted to Shawn Michaels and Vince McMahon ordered the bell to be rung in order to take the WWF Championship title from Hart who was exiting the World Wrestling Federation for World Championship Wrestling. ;Mouthpiece: a manager who does the promos for a wrestler possessing little or no mic skills. For example, Paul Heyman. ;Muta scale: An informal measure among some fans of the amount of blood lost by a wrestler during a match. The scale begins at 0.0 Muta (no blood), with 1.0 Muta being equivalent to the blood loss of Great Muta during an infamous 1990 New Japan Pro-Wrestling match with Hiroshi Hase. == N == ;No-contest: a match which ends without a winner normally due to a legitimate injury where the wrestler can not continue, to prolong a feud or because of interference. Usually ended by injury on a surgically repaired bodypart. ;Near-fall: occurs when a wrestler's shoulders are pinned to the mat for a count of two, but the wrestler manages to escape before the referee's hand hits the mat a third time, which would signify a pinfall. ;No-sell: giving no reaction to another wrestler's offense or moves. (See Hulk Hogan and \"Hulking Up\") ;No-show: when a wrestler does not show up for a match. No-shows are usually staged, often for the purposes of a storyline. Legit no-shows are less frequent, since the wrestler (or other employee) is usually fired or suspended afterwards. Examples of legit no-shows include Ultimate Warrior in the summer of 1996 and Stone Cold Steve Austin in 2002. == O == ;Outlaw Rule: In a tag match involving more than two teams, teammates cannot pin each other in order to win a match. Named after the New Age Outlaws (Road Dogg and Billy Gunn), who pulled this off in a three-team tag match. ;Over: refers to a performer whom the fans care about (either positively or negatively) or the act of making someone look good, often by losing to them. Wrestlers can be over as either faces or heels. The term suggests that the fans are buying into what the wrestler is selling, meaning his character. One of the most common ways a wrestler can be \"put over\" is by winning a match. It's also possible to put someone over by taking bumps or selling a move. ;Over-sell: showing too much of a reaction to another wrestler's offense. For example, tumbling head over heels all the way across the ring from a simple punch would be an over-sell. == P == ;Paper: to give away a great number of free (comped) tickets to increase the size of the crowd for publicity. ;Paper Champion: a similar term to transitional champion, the name comes from the long strip of paper with a new champion's name printed on it, that is similarly colored to a championship belt to replace the former champion's nameplate. This can be either kept there in the interim while the new champion's nameplate is being engraved, or simply removed when a \"transitional champion\" loses the belt again to the former champion, saving the time and cost for a new nameplate engraving. ;Parts Unknown: Billing a wrestler as being from \"Parts Unknown\" (rather than from his real hometown or another actual place) is intended to add to a wrestler's mystique. In the post-kayfabe era, it is used less and less. ;Paying dues: the concept that newer or younger wrestlers must be hazed or punished in the early parts of their careers, both in and out of the ring. (See \"job\" and \"rib\") ;Phantom bump: when a wrestler or referee takes a bump even though the move they are selling was visibly botched or otherwise not present. ;Pillmanize: The act of \"breaking\" an opponent's ankle or arm by placing it between the seat and headrest of a steel chair and then stepping or jumping on the chair. Named for Brian Pillman, who suffered a severe ankle injury (in kayfabe) when attacked in this manner by Stone Cold Steve Austin. ;Plant: is a professional wrestling term for a trained wrestler or actor who poses as a fan, usually seated in the front row of an event. Plants are a good tool for a heel wrestler to gain heat from the crowd. Usually the \"plant\" is an unknown trained wrestler. (Note: not all attacks on fans are on \"plants\". Occasionally, a wrestler will start a legit attack on a real fan who has engaged in behavior such as spitting, cursing, or insulting the wrestler's family members.) Alternatively, to get over, some heels may do such actions as grab a fan's hat and throw it away. ;Play-by-play: the reporting of a sporting event with a voice over describing the details of the action of the match in progress. The play-by-play person is assisted by a color commentator. ;Pop: a sudden crowd reaction, either positive or negative. ;popcorn match: Originally described a post-intermission match seen as not important enough to keep fans from trips to the concession stands. Now describes a more lighthearted match that seeks to relieve dramatic tension. ;Promo : a promotional interview (as in \"cutting a promo\"). Often includes either an \"in-ring interview\" or (on television) a skit by wrestlers and other performers to advance a storyline or feud. ;Promotion: a group or company that organizes professional wrestling events. ;Puroresu: In the strict sense, a style of Japanese professional wrestling popularized by New Japan Pro-Wrestling. Also used broadly to refer to all Japanese professional wrestling. ;Put over: to allow oneself to be pinned or otherwise defeated by someone or to compliment them in an interview to get that person over. ;Psychology: the story of a match. It can be as simple as a wrestler going after someone's bad leg or trying to hit a move to which the wrestler knows they have a weakness. ;Push: when a wrestler gains popularity with wins and positive exposure. A push can be a sudden win over a major superstar, or becoming involved in a high-profile angle. (Compare \"bury\") == R == ;Rasslin': refers to a southern style of professional wrestling which emphasizes kayfabe and stiffness, with fewer squash matches and generally longer feuds. It was synonymous with the NWA-affiliated promotions. Rasslin' included TV tapings at smaller venues, as compared to the larger and more well-known arenas utilized by northern U.S. promotions such as the AWA and W(W)WF. The term is derived from a phonetic spelling of how the word \"wrestling\" sounds when spoken with a heavy Southern accent. It is also commonly used in a derogatory manner by non-Southern wrestling fans to describe that style of wrestling. When Ted Turner purchased Jim Crockett Promotions in 1988, he allegedly called Vince McMahon to tell him that he was now in the \"rasslin'\" business. McMahon is said to have made his company's style different by responding, \"That's great, Ted. I'm in the entertainment business.\" ;Ref bump: when the referee for a match is intentionally knocked out, generally to allow outside interference or other illegal act. ;Rest hold: a hold applied more lightly at a designated point in a match in order to save energy. ;Rib: practical jokes played by or on wrestlers. Owen Hart was known to pull ribs on the boys and Vince McMahon. Wrestlers spend a lot of time together in close quarters and often resort to practical jokes, either to break the monotony or to get revenge for real or imagined wrongs. ;Ribber: someone involved in the pro wrestling business who is well known for playing practical jokes. ;Ring: The area a match takes place. Unlike amateur wrestling rings, professional wrestling rings are square-shaped and placed above the ground, like a boxing ring. Wrestling rings are surrounded by four posts, connected by three ropes placed above each other. ;Ring general: someone who commands a match with drama, believability, and awe ;Ring psychology: wrestling a match properly so that the crowd becomes personally involved in the show. ;Ring rat: someone with amorous feelings for wrestlers and frequents wrestling events to flirt or pursue sexual liaisons with wrestlers.Laurer, Joanie. If They Only Knew, 192–193. ;Ring rust: when a wrestler is out-of- practice, and thus more prone to blow spots, as a result of a long period away from wrestling. ;Road agent: (see agent) ;Roid Rage: paranoia, depression, and explosive outbursts caused by steroid use. ;Roids: slang phrase for steroids. (See gas and juice) ;Run-in: occurs when one or more individuals who are not actively participating in a match run into the ring. Run-ins are almost always made by heels, typically to further a feud with a face. More often than not, a run-in will result in a \"beatdown\" in which the heel(s) pummel the face(s) until the script calls for the beating to stop, either from the heels' satisfaction with their handiwork, a retaliatory run-in by one or more faces, or (less often) the entrance of one or more authority figures (referees, agents, security personnel). Sometimes a run-in results from a face wanting to stop a heel from physically punishing a weaker opponent, usually to set up a feud. ;Rushed finish: when the end of a match is hurried, usually due to a botch, injury, or time constraints. == S == ;Sandbag: to not cooperate with a throw and to act as dead weight, which makes the moves the wrestler is attempting much harder, if not impossible to pull off. It's usually done in protest to something that the wrestler performing the move has done incorrectly earlier in the match, such as not protecting his/her opponent or working stiff. ;School: a school or gym that teaches students the necessary skills to become professional wrestlers. Students undergo strenuous physical conditioning while learning the basics of the wrestling industry, proper performance techniques, and character development. The courses are taught by qualified professional instructors who have usually worked for several years as professional wrestlers themselves. Some schools are affiliated with a specific promotion company, others are independent. An example is the WWE Performance Center. ; Screwjob: a match with a controversial or unsatisfying finish, often involving cheating or outside interference. A worked screwjob, is part of the storyline and the match is intended to end controversially. A shoot screwjob is extremely rare and occurs when a change is made without one of the participants knowing, creating an outcome that is contrary to what was supposedly planned for the storyline by the participants. The most famous example of a screwjob of this type is the Montreal Screwjob. ;Sell: reacting to an opponents attacks in a manner that suggests that the techniques are being applied at full-force. It is to make the action look real to the audience. ;Shoot: any \"real\" event in the world or wrestling (as in \"shoot interview\"). (Compare \"worked shoot\") ;Shooter: a wrestler who has a background in legitimate fighting (originally catch wrestling, now more often mixed martial arts), or otherwise has a reputation as a tough guy. One notch below a \"hooker\". ;Shootfighting: competitive full-contact mixed martial arts tournaments, used in comparison to the staged performances of professional wrestling. ;Signature move: a move performed by a wrestler on a regular basis for which the wrestler is well-known. ;South Philly: a term used that means a wrestler is doing something extreme or in an extreme way. Mostly used by professional wrestler Tazz ;Splash: Any move involving a very large wrestler dropping their full weight across the body of a smaller opponent. Originally coined by Big Daddy, a British professional wrestler from the 1970s and 1980s, as his signature move, the Daddy Splash. ;Sports Entertainment: a term invented by WWE to make its product different from traditional professional wrestling as an attempt to create interest from a wider audience. It refers to the mix of wrestling, scripted storylines, and concepts which borrow from other forms of pop-culture entertainment. ;Spot: the wrestling moves, planned/preplanned moves, any planned/preplanned actions or the series of actions and moves in a wrestling match. which is designed to get a particular audience reaction or determine the pace of the match. Spots can be anything from an Irish Whip at a certain time, to a series of spots, for example a succession of reversals. Wrestlers who choreograph their matches before the show will usually decide on an opening spot and an ending, as well as several spots to use throughout the match. The remainder of the match will be divided between transition moves and general offensive and defensive moves. (See \"high spot\" and \"blown spot\") ;Spotfest: a match which consists mainly or entirely of spots, as well as daredevilry and high impact moves, normally with little flow between moves and no logical transitions and with little bit actual story-telling. Referring to a match as a spotfest may have positive and negative connotations. A spotfest is normally a fast-paced, exciting match with constant displays of athleticism. When the term is used in a pejorative context, the match appears choreographed (for example, it may contain Spot shuffles, where wrestlers will put themselves in obvious danger). In addition, spotfests often contain many high risk moves (i.e. aerial maneuvers), and therefore endanger the health of the participants. Spotfests tend to be more common in cruiserweight matches. ;Spot monkey: A wrestler who is well known for focussing very heavily on cramming as many high spots into a single match without regard to in-ring psychology. More commonly found working in Cruiser weight or extreme style matches.Wrestling Booker.com (2008) Retrieved on 2008-04-11 It is mostly used as a pejorative term. ;Squash: an extremely one- sided match which is usually over quickly. ;Stable: is a group of wrestlers within a promotion who have a common element—friendships, either real or storyline, a common manager, or a common storyline—which puts them together as a unit. Stables can be small alliances of three to six wrestlers (such as D-Generation X, Evolution, and The Four Horsemen), or supergroups that include up to half the promotion's talent roster (such as the New World Order, the WCW/ECW Alliance, Planet Jarrett, and Sports Entertainment Xtreme). ;Stiff: when a wrestler puts excessive force into his attacks or maneuvers on his opponent, deliberately or accidentally. ;Stooge: although this sometimes means \"to tell on someone,\" it more often refers to a heel wrestler booked in the position of underling associate of another heel. The stooge will do his boss' dirty work, such as getting squashed in matches against a face (with whom the heel has a feud) to set up a run-in (and subsequent beatdown) and future match. ;Strongcore wrestling (also known as Extreme Strong Style) : a Japanese-inspired version of Hardcore wrestling which will emphasize the use of weapons (such as chairs, chains, fireballs, ladders, and tire irons) from Hardcore wrestling and the strong, stiff martial arts strikes, kicks, punches, takedowns and submission maneuvers and worked shoots from Strong-style wrestling, as well as stiff weaponry-based strikes and attacks. ;Strong Style : a Japanese-inspired professional wrestling style that is worked, yet aims to deliver realistic performances. The style emphasizes stiff attacks and worked shoots. ;Superhuman comeback: when one wrestler, usually a face, no-sells his opponent's offense, usually after several minutes of being dominated. This tactic usually sets up the finish and victory by the face wrestler. The most common example is Hulk Hogan, and most recently John Cena. ;Superstar: a term used by the WWF/WWE when talking about a wrestler instead of \"wrestler\". Recently TNA has started using the term as well. ;Swerve: a sudden change in the direction of a storyline to surprise the fans. Usually, but not always, it involves one wrestler turning on an ally, often to join someone who had been a mutual enemy to that point. These swerves almost always lead to the start of a new feud between the former friends. Another kind of swerve is when a booker does everything in their power to convince the fans that something specific is going to happen at a show or someone they're expecting is going to debut (or come back), only to then do something completely different. It is sometimes the result of a false report by a wrestler to the press. ;Spike: A term used for variations which target the neck and shoulders. An example is the Spike Vertical Suplex Powerbomb (Variation performed by Kenta Kobashi where he did not push the opponents as far out, so they landed on their neck and shoulders instead of their back). == T == ;Tag team: a pair of superstars working together in a tag team match (a match which pits two or more teams of wrestlers against one another). ;Talent: a catch-all term for wrestlers, managers, valets, announcers, commentators, kayfabe authority figures, and other on-screen personalities employed by a wrestling promotion ;Tap out: submitting to a submission maneuver by tapping on the mat. In kayfabe, it indicates that a wrestler is giving up because the submission maneuver they are in is too painful.Laurer, Joanie. If They Only Knew, 152. ;Tease: an action in a match, promo or angle that hints at a potential future match, feud and/or turn. ;Three-count: see pinfall. ;Titantron/Tron: a screen which is directly above the stage area of the arena used for showing entrance videos, other segments, and promos. Based on the naming convention of Sony's well- known JumboTron, a large video screen used primarily in stadiums, arenas, and other public venues, the TitanTron was introduced as part of WWE's Raw set and was named after the then-parent company of the World Wrestling Federation, Titan Sports. The -tron suffix has since been used to unofficially identify other big screens used in wrestling. ;Transitional champion: a holder of a traditionally-short title reign which bridges two \"eras\", long-running title reigns by usually-popular champions. ;Turn: when a wrestler switches from face to heel or vice versa. :;Hard turn: is when a wrestler becomes a heel or face in a sudden surprise plot twist (swerve). :;Soft turn: is a gradual switch to heel or face over an extended period of time. ;Tweener: a morally ambiguous wrestler, neither a bad guy or good guy (an inbetweener), who will fight anyone regardless of alignment (e.g. Stone Cold Steve Austin, Triple H, The Rock) and recently Randy Orton. This term is also used to describe wrestlers who use tactics typically associated with heels (e.g., cheating), yet are still cheered by fans in spite of (or because of) these antics (e.g. Eddie Guerrero, Ric Flair, and Becky Lynch). ;Two-and-a-half count: the count at which a wrestler is said to escape from a pinfall when a referee's hand comes very close to hitting the mat for a three-count. Other fractions are sometimes used for exaggeration or comedic effect—two and three quarters, two and seven eighths, etc. == U == ;Undercard: matches that happen early at a professional wrestling event. (See also Dark match). ;Unification: the act of combining two championships into one; the result of which is either an entirely new title or the consolidation of one title into another. ;Upset: when an underdog defeats someone who they realistically should not be able to, such as a new wrestler defeating a veteran. == V == ;Valet: a female performer accompanying a male performer to the ring. She functions as \"eye candy\" and plays the role of an agitator. ;Vignette: any piece of video footage featuring characters or events which is shown to the audience for the purposes of entertainment or edification. Usually, they are meant to either introduce a debuting character or to get a wrestler over before their TV wrestling debut. In WWE, wrestlers rarely acknowledge that they are being filmed, forcing the viewer to \"suspend disbelief\" as to why a camera operator would be allowed to witness and record an intimate or secretive situation. == W == ;Work (noun): an event booked to happen, from the carnival tradition of \"working the crowd.\" The opposite of a work is a shoot. ;Work (verb): to specifically and methodically attack, especially a single body part. To \"work\" on a body part (i.e. an arm) would be to repeatedly use force on that part, until it is damaged enough to be used in the finish of the match. ;Worker: a wrestler, manager, valet, referee or an announcer. ;Worked shoot: a scripted segment that takes place in a show with elements of reality being exposed, such as an off-screen incident between wrestlers being used as fuel for an on-screen rivalry between them. It can also be a segment that fans are meant to believe is a shoot, but is not. ;Workrate: a wrestler's use of \"work\" to develop a match. One's workrate is determined by his or her ability to \"work\" in an intelligent and productive manner. When used by critics, it is an analysis of the action in a match and the skill level exhibited. ;Wrestler's Court: the unofficial forum among WWE wrestlers for the policing of wrestlers that violate the rules and traditions laid down by the company. The punishments meted out can range from pranking to paying for other wrestlers' travel expenses. In Matt and Jeff Hardy's book Exist 2 Inspire, they mention an incident they had with The Court while it was still headed by The Undertaker, \"We got to the next house show and Bradshaw told us, 'You guys have been sentenced to Wrestler's Court. Your trial is set for next week at Raw.' Wrestler's Court is exactly what it sounds like. All the wrestlers gather in the locker room, and they hold a mock trial. Taker is the judge and Bradshaw is the prosecuting attorney. It's pretty scary, because once you get up there on the stand, everybody's against you.\" Judges for Wrestler's Court have included: The Undertaker, John Bradshaw Layfield, Hardcore Holly, and Brian Adams. == Z == ;Zamboni: a legit low-blow. == Notes == == References == * * * * == Other websites == * Midwest Independents * PWTorch Glossary * Total Wrestling Terms * Wrestling Booker's Glossary of pro wrestling terms Category:Sports lists Terms Professional wrestling",
 "title": "List of professional wrestling terms"
}