{
 "id": "145911",
 "text": "Thaksin Shinawatra (born July 26, 1949) is a former Prime Minister of Thailand and founder of the Thai Rak Thai Party. He was exiled after a 2006 coup. He returned to Thailand in 2023. He was put in jail, but got parole in February 2024.https://www.bangkokpost.com/thailand/politics/2724990. Retrieved 2024-01-20 == Heritage and early life == Thaksin's great-grandfather, Seng Saekhu (Khu Chun Seng 丘春盛), was an ethnic Chinese Hakka immigrant from Fengshun, Guangdong, China. He arrived in Siam in the 1860s and settled in Chiang Mai in 1908. His oldest son, Chiang Saekhu, was born in Chanthaburi in 1890. He married a local named Saeng Samana. Chiang's oldest son, Sak, took the Thai last name Shinawatra in 1938. He did this because of the country's pro-Central Thai movement. The rest of the family also got it. Seng Saekhu made his fortune by tax farming. Chiang Saekhu/Shinawatra later founded Shinawatra Silks. Then, he moved into finance and construction. Thaksin's father, Loet, was born in Chiang Mai in 1919. He married Yindi Ramingwong. Yindi's father, Charoen Ramingwong (born: Wang Chuan Cheng), was a Chinese Hakka immigrant. He married Princess Chanthip na Chiangmai, a less important member of the Lanna (Chiang Mai) royalty. In 1968, Loet Shinawatra entered politics and became an MP for Chiang Mai. Loet Shinawatra stopped politics in 1976. He opened a coffee shop and grew oranges and flowers in Chiang Mai's San Kamphaeng District. He also opened two cinemas, a gas station, and a car and motorcycle dealership. The Shinawatra family was one of the richest and most influential families in Chiang Mai when Thaksin was born. ==In the justice system== He has been at the Police General Hospital for most of his time in jail (except for \"a few hours\"). As of September 1, 2023, He has to stay in prison for one year.https://www.bangkokpost.com/learning/easy/2639986/royal- pardon-reduces-thaksins-jail-term-to-one-year. Bangkok Post.com. Retrieved 2023-09-03 In January 2024, the authorities told Thaksin that there was a warrant for him. It was for a crime (of Lese Majeste) that happened in May 2015.https://www.bangkokpost.com/learning/advanced/2737884/thaksin-faces-old- charge-of-lese-majeste. Retrieved 2024-02-07https://www.bangkokpost.com/thailand/special- reports/2636835/thaksins-transfer-raises-eyebrows. Bangkop Post. Retrieved 2023-08-28 Thaksin Shinawatra was charged with royal defamation on June 14. In July 2024, he asked for permission to leave the country; The authorities said \"No\".https://www.bangkokpost.com/thailand/politics/2885366/thaksin-shows-up- quietly-at-court?tbref=hp. Retrieved 2024-10-17 == Education == * High School- Montfort college, Chiang Mai, Thailand. * University- Armed Forces Academies Preparatory School * Master's Degree - Eastern Kentucky University, USA * Doctor's Degree - Sam Houston State University, USA ==Family== Shinawatra's sister, former prime minister Yingluck, went into hiding in 2017. People think she left the country to get away from the Supreme Court's Criminal Division for Holders of Political Positions' ruling in her rice-pledging trial. His daughter is the 31st and current Prime Minister Paetongtarn Shinawatra. ==References== Category:1949 births Category:Living people Thaksin Shinawatra",
 "title": "Thaksin Shinawatra"
}