{
 "id": "14612",
 "text": "Aramaic is a Semitic language. It has been written for 3100 yearsBeyer (1986: 11) suggests that written Aramaic probably dates from the 11th century BC, as it is established by the 10th century, to which he dates the oldest inscriptions of northern Syria (Beyer, Klaus 1986. The Aramaic language: its distribution and subdivisions. Vandenhoeck und Ruprecht. ISBN 3-525-53573-2). Heinrichs (1990: x) uses the less controversial date of the 9th century, for which there is clear and widespread attestation. (Heinrichs, Wolfhart, ed. 1990. Studies in Neo-Aramaic. Atlanta, Georgia: Scholars Press. ISBN 1-55540-430-8) and has been spoken for longer than that.Royal Aramaic inscriptions from the Aramean city-states date from 10th century BC, making Aramaic one of the world's oldest recorded living languages. Richard, Suzanne 2003. Near Eastern Archaeology: a reader. Eisenbrauns, p. 69. ISBN 978-1-57506-083-5 It is one of the Northwest Semitic languages. Other Semitic languages include Amharic, Hebrew, Arabic and many other languages. Aramaic words are written with the 22 characters of the Aramaic alphabet,Languages from the World of the Bible, ed. Holger Gzella (Berlin; Boston: Walter de De Gruyter, Inc., 2011), p. 131 which was widely adopted for other languages and is an ancestor to the Hebrew, Syriac and Arabic alphabets. ==History== Aramaic is the language of long parts of the two Bible books of Daniel and Ezra, it is the language of the Jewish Talmud. In the 12th century BC, the first speakers of Aramaic started to live in what is now Syria, Iraq and eastern Turkey. As the bureaucratic language of the Achaemenid Empire, it became the most important language in the Middle East. Jewish speakers took the language with them to North Africa and Europe. Christian speakers took the language with them to Persia, India and even China. In the 7th century AD, Aramaic stopped being the most important language in the Middle East. The Arabic language became the new important language. Aramaic is still spoken by scattered communities of Jews, Mandaeans and some Christians. Small groups of people still speak Aramaic in different parts of the Middle East. The wars of the last two centuries have made many speakers leave their homes to live in different places around the world. Today, between 500,000 and 850,000 people speak Aramaic languages. ==Dialects== Aramaic is not one language without any changes. Because many different people over many centuries spoke and wrote it, there are many different types of Aramaic languages, called dialects, but some of them are so different that they are like different languages. The different dialects make two groups: an Eastern group and a Western group. The division between them is around the River Euphrates. The dialects are divided also by time. Old Aramaic is the name of the oldest dialects, which only scholars learn. Middle Aramaic is the group of dialects, which are used not every day but for special things like writing and religion. Modern Aramaic is the group of dialects that is used every day by some groups. ==Related pages== * Judea * Assyria * Phoenicia ==References== ==Other websites== * Introduction to Aramaic, an alphabet * Aramaic Q&As;: The \"Family Tree\" of Aramaic dialects Category:West Asia Category:11th century BC Category:Semitic languages Category:History of Asia",
 "title": "Aramaic language"
}