{
 "id": "146419",
 "text": "The National symbols of Pakistan (Urdu:); Each Country of the world adopts some signs or emblems, which they regard as the representative of their country traits. Pakistan has several “Official National Symbols”. Pakistanis have several official National symbols including a historic document, a flag, an emblem, an anthem, a memorial tower as well as several national heroes. The symbols were adopted at various stages in the existence of Pakistan and there are various rules and regulations governing their definition or use. == Oldest symbol == The oldest symbol is the Lahore Resolution or \"Resolution of Pakistan\", adopted by the All India Muslim League on the 23rd of March in 1940, and which presented the formal demand for Greater Autonomy for Muslims in United India, and later led to the demand for a separate and Independent 'Pakistan'. The Minar-e-Pakistan memorial tower which was built in 1968 on the site where the Lahore Resolution was passed in 1940. The national flag was adopted just before independence was achieved on 14 August 1947. The national anthem and the state emblem were each adopted in 1954. There are also several other patriotic symbols including the national animal, bird, flower and tree; and some other things known as \"National Identity\". The “National symbols” and mostly national things of Pakistan are mentioned and listed here respectively. == National identity == The following section introduces you to the natural National Identity Elements of Pakistan. These symbols are intrinsic to the common “Pakistani national identity and heritage”. Pakistanis are known to be are proud of these patriotic National Symbols as they infuse a sense of pride and patriotism in every Pakistani's heart. They have been selected carefully to project the image of Pakistan at its best. These are chosen to reflect Pakistani culture and beliefs and also the positive attributes often associated with Pakistani customs and traditions and ideals that reflect the different aspects of the cultural life and history of the country respectively. These national symbols are mostly the national things from and relating to Pakistan of which are mentioned and listed portrayed elegantly in great detail here: ==Other Pakistani National and Official Symbols== 1\\. They exemplify the rich cultural fibre that resides at the core of the country. 2\\. Infuse a deep sense of pride in the hearts of Pakistani citizens. 3\\. Represent a quality unique to Pakistan and its citizens. 4\\. Popularize the object chosen. 5\\. Help to preserve the chosen national symbol for generations to come. Here is the detailed information about the National symbols of Pakistan. Symbol Name Image References National personification قومی شخصیت Pak Watan/Ali Faisal \"A term of Endearment for Pakistan,\"/\"Mumlikat-e-Khudadad\" ('God-Given State') National flag قومی پرچم Flag of Pakistan (\"Pārcham-e-Sitāra-o-Hilāl\") National emblem قومی مہر State emblem of Pakistan (\"Official Coat of Arms\") Great Leader (\"Quaid-e-Azam\") Baba-e-Quam, Mr. Muhammad Ali Jinnah (\"Bani-e- Pakistan\") بابائے قوم Mother of the Nation (\"Khatoon-e-Pakistan\") Madar-i-Millat, Miss. Fatima Jinnah مادرملت National Islamic patron saint قومی بزرگ Peer Baba Hazrat Fariduddin Ganjshakar بابا فرید الدین گنج شکر National Islamic hero قومی شہید ہیرو (\"The First Pakistani\") Martyr Muhammad bin Qasim محمد بن قاسم - پاکستان کے مسلمانوں میں ایک ہیرو کا اعزاز حاصل ہے National Poet (\"Spiritual Father of Pakistan\") Sir. Muhammad Iqbal محمد اقبال (\"Poet of the East\") قومی شاعر National anthem Qaumī Tarāna (\"Blessed Be The Sacred Pure-Land\") قومی ترانہ National song (\"Milli Naghma\") قومی نغمہ Is Parcham Ke Saye Talay Hum Aik Hain (\"Under This Banner, We are Oneǃ We are All Oneǃ\") پاکستان کا قومی مارچنگ پریڈ گانا National slogan/National Cry \"Pakistan Zindabad, Azadi Paendabad\" (\"Long Live the Pure Land, Victory to Pakistani Freedom\") قومی نعرہ National motto قومی اصول قومی مقصد Unity, Faith, Discipline ایمان، اتحاد، نظم National language قومی زبان Urdu اُردُو (\"Official Language\") upright=0.5 National days قومی دن Independence Day یوم آزادی Republic Day (Pakistan) قومی قرارداد دستاویز/یوم پاکستان Defence Day یوم دفاع Kashmir Solidarity Day یوم یکجہتی کشمیر National Official Map by Mian Mahmood Alam Suhrawardy. National Survey of Pakistan قومی نقشہ National epic قومی رزمیہ Hamzanama ہمزاناما National weapon قومی دفاع Islamic talwaar (\"Defender of Faith\") اسلام کا محافظ Islamic faith symbol مذہبی علامت Star and crescent چاند ستارہ (\"Official\") قومی نشان National book قومی کتاب Now or Never; Are We to Live or Perish Forever? اعلامیہ پاکستان (\"Unofficial\") Pakistan, the enigma of political development, by Lawrence Ziring, p. 67Iqbal, an illustrated biography Khurram Ali Shafique, p.131India-Pakistan in war & peace, Jyotindra Nath Dixit p. 10The Great Divide: Muslim Separatism and Partition By S.C. Bhatt, p. 70A history of Pakistan: past and present Muḥammad ʻAbdulʻaziz, p. 162 National colours قومی رنگنے پاکستان کے رنگ White خالص سفید رنگ and Dark Green گہرے سبز رنگ Lime green (sports) چونا سبز کھیلوں کا رنگ and Gold سونے کا رنگ National calendars قومی تقویم Islamic calendar اسلامی تقویم Desi calendar پنجابی کلینڈر (\"Unofficial\") Islamic Finder, Hijra calendar National passport Pakistani passport قومی شناخت National airline قومی طیارہ PIA پاکستان انٹرنیشنل ایئر لائنز (\"Flag Carrier\") پرچم بردار National currency Pakistani rupees (Rs. PKR) قومی زر فرمان/پاکستانی روپے National dress-code قومی لباس Shalwar Qameez شلوار قمیض (\"Unisex\") غیر جنسی Jinnah cap قراقلی ٹوپی (\"National headgear\") National media and film Industry Lollywood/Urdu & Punjabi cinema لالی وُڈ National flower قومی پھول Common Jasmine/Poet's Jasmine سفید چمیلی (\"Queen of Fragrance\" or \"Floral Queen\") خوشبو کی ملکہ National trees قومی درختوں Himalayan cedar دیودار/لکڑی کا بادشاہ (\"King of Timber\") قومی درخت Mango tree آم کا درخت (\"National tropical tree of pakistan\") پاکستان کا قومی اشنکٹبندیی درخت National fruits قومی پھلوں Mango (Summer) آم/قومی پھل - پھلوں کا بادشاہ (\"King of fruits\") Guava (Winter) امرود/ثانوی قومی پھل National vegetable قومی سبزی Okra بھنڈی (\"Official\") (\"Nutritious Edible Seed Pod\") متناسب خوردنی بیج پوڈ National dishes قومی آمدورفت (\"Traditional Pakistani Cuisine\") روایتی پاکستانی کھانا Biryani/Nihari نہاری اور بریانی/قومی پکوان National spice قومی مصالحہ Saffron Masala/Zafran زعفران مصالحہ Keay (2005), pp. 19-20. National herb قومی جڑی بوٹی Coriander/Dhania دھنیا بوٹی مسالا National cash crops قومی فصلیں Sugarcane قومی زرعی نقد فصل/Wheat قومی اسٹاک نقد فصل National beverages قومی مشروبات Sugarcane juice گنے کا رس (\"National Juice\") قومی مشروبات Rose syrup (\"National Syrup\") گلاب کا شربت Pakola (\"National Softdrink\") پاکولا National confectionery پاکستانی مٹھایاں Gulab jamun/Barfi گلاب جامن (\"Sweetest, Sweet of Sweets\") قومی مٹھائی National pets قومی پالتو جانور Pakistani cat/Himalayan Persian breed پاکستانی بلی/قومی پالتو جانور Rose-ringed parakeet گلابی گردن طوطا National dove/pigeon قومی کبوتروں Eurasian collared dove قومی کبوتر Pakistan Highflyer پاکستانی کبوتر National rabbit قومی خرگوش Pakistani Cashmere Lop قومی پاکستانی کشمری لوپ National guard dog قومی کتے کا نسل Bhagyari Kutta/Pakistani Shepherd Dog باگیاری کتا/پاکستانی شیفرڈ ڈاگ National horse breed قومی گھوڑے کا نسل Nukra Stallion/Hirzai پاکستانی گھوڑا/ہیرزئی National feral قومی گدھے کا نسل Pakistani donkey پاکستانی گدھا - اسپرکی 7|73\"> National poultry/fowl قومی مرغیاں کا نسل Pakistani cockerel/Desi Murgh پاکستانی دیسی مرغی 7|73\" /> National buffalo/cattle قومی بلیوں کا نسل Pakistani buffalo بھینس Pakistani cattle پاکستانی ساہیوال مویشی 7|73\" /> National sheep/goat قومی بکریاں کا نسل Cashmere goat/Pakistani Beetal Pashmina Bhakra قومی بکرا (\"White gold of Pakistan\") پاکستان کا سفید سونا Kajli sheep قومی بھیڑ National animal قومی جانور Markhor مارخور (\"Serpent-Killer\") سانپ مارنا (\"Insignia of ISI\") National bird قومی پرندہ Chukar pheasant چکور (\"Moon Gazer\") چاند نظریں National aquatic marine mammal (\"National Treasure\") قومی خزانہ Indus river dolphin بھولان قومی آبی میرین پریمال National social mammal قومی سماجی ستنداری Rhesus macaque رہیسس مکاک National predator قومی زمین کا شکار Snow leopard برفانی چیتا/ہمالیہ بندیدار برفیلی شیر National bird of prey Shaheen falcon شاہین (\"Insignia of PAF\") شکار کی قومی نسل National heritage animal Camel ورثہ جانور 7|73\" /> National heritage bird Asiatic peafowl ورثہ پرندہ Josef von Hammer-Purgstall Die Geisterlehre der Moslimen (the doctrin of spirits of muslims) 1852 original: Bayerische Staatsbibliothek digitalized: 22. July 2010 (german) National butterflies قومی تیتلیوں Indian purple emperor قومی تیتلی Common Asian peacock butterfly National insects قومی کیڑوں Tamarisk Leaf Beetle قومی کیڑے Asiatic Honey Bee شہد کی مکھی National aquatic bird قومی آبی چڑیا Cotton teal چٹی بطخ ٹیل National fish قومی مچھلی Himalayan Mahaseer/Golden Mahaseer سنہری مہاسیر National amphibians قومی ابھابیوں Indus Valley Bullfrog وادی انڈس بیل میڑک Indus Valley toad وادی سنڈو ٹاڈ/قومی امفابی National Oceanic creature قومی سمندری مخلوق Black finless porpoise لامتناہی پورپوائز National reptile قومی خزندہ Indus Crocodile انڈس مگر مچھ National hog creature قومی خنزیر کا نسل Central Asian boar عام یوریشی جنگلی سؤر 7|73\" /> National fossil قومی جیواشم Giant Giraffe Rhinoceros/The Near Beast of Pakistan وشال جراف گینڈے National river قومی دریا (\"Sacred River\") مقدس ندی Indus River دریائے سندھ (\"National Lifeline of Pakistan\") پاکستان کا شہ رگ National mountain قومی پہاڑ K2 کے ٹو (\"Shaan of Pakistan\") شان کا پاکستان National lake قومی جھیل Lake Saiful Muluk جھیل سیف الملوک http://windsweptwords.com/2013/04/27/the-legend-of-Saif-ul-Muluk-part-iv/ National mineral پاکستانی معدنیات Himalayan salt ہمالیہ لال نمک (\"Pink gold of Pakistan\") قومی معدنی/پاکستان کا گلابی سونا National gemstone قومی قیمتی پتھر Emerald زمرد (\"Pakistani Mineral\") پاکستانی رنگین معدنیات National sports قومی کھیلوں (\"Primary\") Field hockey فیلڈ ہاکی (\"Official\") قومی کھیل National game (\"Secondary\") Polo پولو (\"Traditional sport\") ثانوی قومی کھیل National dance قومی رقص Kathak (\"Traditional dance\") کتھک National instrument قومی سازوسامان Dafli/Daf (\"Persianate\") دفلی National Icon قومی آئکن Teen Talwar/The Three Swords تین تلواریں کا یادبود/قومی مقصد (\"National Motto\") National fort قومی قلعہ Shahi Qila شاہی قلعہ (\"Royal Fort\") National Islamic heritage (\"Cultural\") Badshahi Masjid (\"Imperial or Emperor's Great Mosque\") قومی اسلامی ورثہ National civilisational heritage (\"Historical\") Mohenjo-daro (\"Mound of the Dead Men\") قومی تاریخی ورثہ Aitzaz Ahsan 1997. Indus saga and the making of Pakistan Karachi: Oxford University Press. National mosque قومی مسجد Shah Faisal Masjid فیصل مسجد (\"Official\") National Garden Rose and Jasmine Garden (\"Islamabad\") قومی باغ National shrine of Pakistan Shrine of Hazrat Baba Farid (\"Pakpattan\") اسلامی درگاہ National Church of Pakistan قومی چرچ Sacred Heart Cathedral, Lahore (\"Pakistani Christians\") Pakistan Press International November 20, 2007 National sacred temples of Pakistan (\"Pakistanian Sacred Sites\") پاکستانی قومی مقدس مقامات Katas Raj Temples Complex (\"ہندو مذہب\") Takht-I-Bahi (\"بدھسٹ مذہب\") Gurdwara Darbar Sahib (\"سکھ مذہب\") Nagarparkar Jain Temples/Sardhara (\"جین مذہب\") National park Fatima Jinnah Park (Public) قومی عوامی پارک National mausoleum Jinnah Mausoleum قومی مزار National memorial Mazar-e-Iqbal قومی یادگار National towers قومی مینار (\"Towers of Pakistan\") پاکستان کا مینارِ Minar-e- Pakistan (\"Resolution of Pakistan\") قومی مینارِ Islamic summit minar اسلامی سمٹ مینار(\"Monument of Islamic Unity\") National monuments قومی یادگاریں Pakistan Monument یادبود پاکستان - Bab-e- Pakistan (\"Gateway of Pakistan\") باب پاكستان National residency Karachi Flagstaff House Museum سرکاری رہائش گاہ Shahid Husain, \" Quaid-e-Azam House Museum suffers due to water shortage\", The News International, 14 May 2009 National stadium قومی اسٹیڈیم Lahore Stadium قذافی اسٹیڈیم National library Quaid-e-Azam library قومی کتابیں گھر/قومی لائبریری National museum Lahore Museum قومی عجائب گھر National passageway روایتی راستہ (\"Traditional Gateway\") Bab-e-Khyber باب ای خائبر (\"National Passageway of Pakistan\") قومی گزرگاہ/ National beating retreat or the flags lowering ceremony (Since 1959) Wagah Border Defence Parade باب آزادی (\"Indo-Pak International Border\") سرکاری سرحد ==Related pages== * Provincial symbols of Pakistan == Notes == ==References== ==Other websites== * The Government of Pakistan * Jasmine: The National flower of Pakistan * Ministry of Information and Broadcasting * Ministry of Culture, Sports and Youth Affairs Category:National symbols of Pakistan",
 "title": "National symbols of Pakistan"
}