{
 "id": "146401",
 "text": "Quim Monzó (born in Barcelona, Spain, in 1952) is a Catalan writer of novels, short stories and discursive prose, mostly in the Catalan language. In the early 1970s, Monzó reported from Vietnam, Cambodia, Northern Ireland and East Africa for newspapers in Barcelona. His fiction is full of irony. His other prose maintains this humor. One collection of his essays, Catorze ciutats comptant-hi Brooklyn, is notable for its account of New York in the days immediately following September 11. ==Bibliography== ===Books in English=== * O'Clock, 1986. New York: Ballantine Books. Translated by Mary Ann Newman. * The enormity of the tragedy, 2007. London: Peter Owen Publishers. Translated by Peter Bush. * Gasoline, 2010. New York & Rochester: Open Letter. Translated by Mary Ann Newman. * Guadalajara, 2011, Rochester, NY: Open Letter. Translated by Peter Bush. ; * A thousand morons, 2013, Rochester, NY: Open Letter. Translated by Peter Bush. ; * Why, Why, Why?, 2019, Rochester, NY: Open Letter. Translated by Peter Bush. ; ===Books in Catalan=== ====Fiction==== * L'udol del griso al caire de les clavegueres, 1976.. * Self Service, 1977. In collaboration with Biel Mesquida. * Uf, va dir ell, 1978. * Olivetti, Moulinex, Chaffoteaux et Maury, 1980. * Benzina, 1983. * L'illa de Maians, 1985. * La magnitud de la tragèdia, 1989. * El perquè de tot plegat, 1993. * Guadalajara, 1996. * Vuitanta-sis contes, 1999. * El millor dels mons, 2001. * Mil cretins, 2007. ====Collected articles and essays==== * El dia del senyor, 1984. * Zzzzzzzz, 1987. * La maleta turca, 1990. * Hotel Intercontinental, 1991. * No plantaré cap arbre, 1994. * Del tot indefens davant dels hostils imperis alienígenes, 1998. * Tot és mentida, 2000. * El tema del tema, 2003. * Catorze ciutats comptant-hi Brooklyn, 2004. * Esplendor i glòria de la Internacional Papanates, 2004 == Other websites == *Website dedicated to Quim Monzó *Open Letter Publishing House *Peter Owen Publishers *More than twenty-five years of essays by Monzó in the Barcelonian newspaper La Vanguardia Category:1952 births Category:Living people Category:Writers from Barcelona",
 "title": "Quim Monzó"
}