{
 "id": "146914",
 "text": "Amborella trichopoda is a small, evergreen shrub. It occurs only in the moist, shaded understory of montane forests on the South Pacific island of New Caledonia. The genus is the only member of the family Amborellaceae and contains only this single species.Große-Veldmann, Bernadette et al 2011. Amborella trichopoda — cultivation of the most ancestral angiosperm in botanic gardens. Journal of Botanic Garden Horticulture 9: 143–155. Amborella is of great interest to plant systematists because molecular phylogenetic analyses put it at or near the base of the flowering plant lineage.Soltis, Pamela S. & Soltis, Douglas E. 2013. Angiosperm phylogeny: a framework for studies of genome evolution. In Leitch, Ilia J. et al Plant genome diversity. vol 2, Springer, pp. 1–11. Pillon, Yohan 2008. Biodiversité, origine et évolution des Cunoniaceae: implications pour la conservation de la flore de Nouvelle- Calédonie. (in French and English). University of New Caledonia. The Amborellaceae are distinctive. They are sprawling evergreen shrubs or small trees. Their tissue is different from any other Angiosperm. The xylem of Amborella contains only tracheids; vessel elements are absent.Carlquist S.J. & Schneider E.L. 2001. Vegetative anatomy of the New Caledonian endemic Amborella trichopoda: relationships with the Illiciales and implications for vessel origin. Pacific Science 55 (3): 305–312. Xylem of this form has long been regarded as a \"primitive\" feature of flowering plants.Simpson, M. (2006). Plant systematics. Amsterdam: Elsevier/Academic Press. Since Amborella is apparently basal among the flowering plants, the features of early flowering plants can be inferred. This is done by comparing derived traits shared by other angiosperms but not present in Amborella. These traits are assumed to have evolved after the divergence of the Amborella lineage. The Amborellaceae are a line of flowering plants that diverged very early on (about 130 million years ago) from all the other living species of flowering plants. Among living flowering plants, it is the sister group to all other flowering plants. == Its peculiarity == Amborella, an understory plant in the wild, is in contact with shade- and moisture-dependent organisms such as algae, lichens and mosses. Some horizontal gene transfer between these species is not surprising. But the scale of such transfer has caused great surprise. Sequencing the Amborella mitochondrial genome showed that for every gene of its own origin, it has about six versions from the genomes from other plants and algae growing with or upon it. The evolutionary and physiological significance of this is not yet clear. == References == Category:Flowering plants",
 "title": "Amborella"
}