{
 "id": "146964",
 "text": "Tajiks () are an Iranian ethnic group who are mostly found in Tajikistan, parts of Afghanistan, Uzbekistan, Pakistan and China. Alternative names for the Tajiks are Eastern Persian, Dehqan, and Farsiwan. After the Soviet invasion of Afghanistan in 1979, many Tajik refugees migrated to live in neighboring Iran and Pakistan. Most Tajiks are Sunni Muslims, but a few in remote mountain areas follow Ismailism. The name Tajik refers to the traditionally sedentary people who speak a form of Persian language called Tajiki in Tajikistan and Uzbekistan, Madaklashti in Pakistan and Dari in Afghanistan. It is generally accepted that the origin of the word Tajik is Middle Persian Tāzīk \"Arab\" (New Persian: Tazi), or an Iranian (Sogdian or Parthian) cognate word. Some Turks of Central Asia adopted a variant of this word, Täžik, to designate the Persian Muslims in the Oxus basin and Khorasan, who were the Turks' rivals. Historians believe that the Tajiks may be connected to ancient Aryans who lived in the region for thousands of years. They were the heirs and transmitters of the Central Asian sedentary culture that diffused in prehistoric times from the Iranian plateau into an area extending roughly from the Caspian Sea to the borders of China. The Aryans constituted the core of the ancient population of Khwarezm, Sogdiana and Bactria, which formed part of Transoxania. They were included in the empires of Persia and Alexander the Great, and they mixed with later invaders like the Mauryans, Kushans and Hepthalites. Over the course of time, the language that was used by these ancient people eventually gave way to Farsi, a western dialect now officially spoken in Iran, Afghanistan and Tajikistan. In the 13th century, Genghis Khan and his Mongol army settled in many of the popular Persian cities after wiping out the Persian population. These Mongols later adopted the Persian language and the religion of Islam, the Persian-speaking Hazaras claiming partial descent from them. Tajiks usually reject a Mongol or Turkic origin and claim to be descended from the ancient Iranians of Central Asia. However, historically, there has been heavy intermixing between the sedentary Turkic-speaking Central Asians and the Persian-speaking Central Asians == Related pages == * Persian people * Hazara people == References == * From the Alleyways of Samarkand to the Mediterranean Coast (The Evolution of the World of Child and Adolescent Literature,Tajikistan, Poopak Niktalab , printed 2019 , Faradid Publishing * TAJIK i. THE ETHNONYM: ORIGINS AND APPLICATION, Encyclopædia Iranica, Last Updated: July 20, 2009, www.iranica.com Category:Persian people Category:Ethnic groups in Afghanistan Category:Ethnic groups in Asia Category:Ethnic groups in Pakistan",
 "title": "Tajik people"
}