{
 "id": "147167",
 "text": "The British Rail Class 88 is an electro-diesel locomotive. It is designed to pull both passenger and freight trains. It was made by and later for use in the United Kingdom. The type is similar to the Class 68 diesel locomotive. The Class 88 has a smaller diesel engine and is powered by electricity from the overhead wires. The two locomotive types also share many parts with each other. == Background == In 2014, introduced the Class 68. These diesel locomotives proved to be highly effective machines. DRS then thought of an electric locomotive with an onboard diesel engine. This ability allowed the locomotive to run a short distance beyond the electric wires. The concept of an electro-diesel locomotive is not new in the UK. Before the Class 88, in the 1960s the Class 73 and Class 74 made their appearance. These machines use third rail in electric mode. The Class 88 uses overhead wires. It is also capable of hauling a train by just using the diesel engine. This makes the type a true electro-diesel locomotive. The Class 88s share a lot of parts with the Class 68s. These included driver's cabs, bodyshell, traction motors, bogies, and others. == Production and delivery == During September 2013, DRS announced that it had placed an order for ten locomotives. These were designated as Class 88. In April 2016, 88001, the first of its class, was sent to the Czech Republic. While in the Czech Republic, 88001 underwent a number of tests. Rail reported that the trials were deemed a success. During January 2017, 88002 Prometheus became the first of its class to arrive in the UK. It was brought to the Port of Southampton by ship. The locomotive was then transported by road to depot. In June 2017, the Class 88s had entered service. Not every driver was trained to operate the Class 88s. As a result, the use their onboard diesel engines went unused for a while. Vossloh was also making some small changes to the Class 88s at the time. == Operation == The Class 88 locomotives primarily served DRS's freight trains on electrified lines. This way, DRS did not have to hire electric locomotives from other operators. Before the delivery of the Class 88s, DRS borrowed Class 92 locomotives from to pull container trains on the West Coast Main Line. When the type entered service, DRS put the Class 88s on Daventry and freight trains on behalf of Tesco. The Class 88s would also replace diesel locomotives on trains that run under electric wires. == Names == All ten Class 88s received names. The names given are as follows: Number Name Operator 88001 Revolution 88002 Prometheus 88003 Genesis 88004 Pandora 88005 Minerva 88006 Juno 88007 Electra 88008 Ariadne 88009 Diana 88010 Aurora Eight of the Class 88s have names previously belonged to Class 76 and 77 electric locomotives. 88002 was named after Class 76 E26055. The other seven were named after the seven Class 77s. DRS did this to attract more railway enthusiasts. == References == == Other websites == * Category:British Rail electric locomotives Category:Bo-Bo locomotives",
 "title": "British Rail Class 88"
}