{
 "id": "147157",
 "text": "The British Rail Class 76, also known as Class EM1, is a class of 1.5 kV DC, Bo-Bo electric locomotive. These were designed for use on the now-closed in Northern England. The prototype was built in 1941, but the other 57 were built in the early 1950s. They served the Woodhead Line until its closure in 1981. Only one complete locomotive has been preserved. == Background == The Railways Agreement Act of 1936 allowed some railway electrification projects to start. The London and North Eastern Railway therefore started a plan to put wires over the Woodhead Line from Manchester to Sheffield. This particular railway saw lots of freight trains that had to go over steep terrain of the Pennines and through the Woodhead Tunnel. Since these were pulled by steam locomotives, they needed help from banking engines, including the unique Garratt locomotive. Work began to put up the wires after being approved in 1938. Then the Second World War happened, which put the project to a standstill in 1940. The project restarted after the war in 1946, and was completed in 1954. == Tommy — the prototype == The prototype locomotive was completed by Doncaster Works in 1941. It was numbered 6701 (later 6000 in 1946), and had been designed by . It was not classified as EM1 until September 1945. It was tested on the few sections of 1500 V DC lines owned by the LNER, but had not worked any great distance by 1947. That year in September, it was loaned to the Nederlandse Spoorwegen to help solve the shortage of its locomotives after the Second World War. While in the Netherlands, number 6000 was given the nickname Tommy. This name became official on 30 June 1952, when the locomotive returned to the UK. By then, 6000's number had been changed to 26000. Tommy was taken out of service in March 1970. It was scrapped at Crewe two years later. == Production locomotives == Between 1950 and 1953, 57 more locomotives were built by British Railways' Gorton Works. These were of the same design as the prototype. Likewise, they were classified as EM1. Metropolitan-Vickers provided the electrical equipment. They also helped assemble the engines at Dukinfield Works. The wires on the Woodhead line were not ready until 1952. As such, on 27 October 1950, the first two locomotives, nos. 26001 and 26002, were sent to Ilford depot in Essex. They were tested on the commuter line from London Liverpool Street to Shenfield, which had been electrified in 1949. This line had the same voltage as the Woodhead line, at 1.5 kV DC. The two engines were joined by numbers 26003-26010 in early 1951. In June 1951, power from Wath to Dunford Bridge was switched on. As a result, the ten locomotives were moved there. 24 more locomotives were planned to be built at Darlington Works, but were cancelled. The last ten EM1s created were fitted with roller bearings for passenger trains. This was because the order for 27 Class EM2s (later Class 77) was trimmed to just seven. == Liveries and names == When first delivered, the EM1s were painted black with red stripes. From 1956, the colour was changed to dark green with orange and black stripes. This was also worn by steam engines that hauled express passenger trains. The front and back ends of the locomotives were later painted yellow. The EM1s were then repainted light blue to match the new AC electrics that were being delivered for the West Coast Main Line. From the late 1960s, they were recoloured into a darker shade of blue with fully yellow ends. Other than 26000 Tommy, at first no other EM1s had names. Around 1960, 13 were named after Ancient Greek and Roman figures. These 13 engines had been fitted with steam heating boilers for use on passenger trains. Named Class 76 locomotives Loco Name Named 26046 Archimedes 26047 Diomedes 26048 Hector 26049 Jason 26050 Stentor 26051 Mentor 26052 Nestor 26053 Perseus 26054 Pluto 26055 Prometheus 26056 Triton 26057 Ulysses == Withdrawal == By the 1970s, the EM1s (now designated as Class 76) were some of the oldest engines in service with British Rail. Yet they were one of the most reliable classes thanks to its robust design. However, in July 1981, the Woodhead Line between Hadfield in the west and Penistone in the east closed. This resulted in all of the Class 76s being taken out of service. Numbers 76006 and 76014 hauled the last train over the Woodhead Line on 18 July 1981. The Woodhead Line had already being in decline until then. Passenger trains had stopped using the line in 1970. Coal had been transported over the Woodhead Line from the mines in South Yorkshire to a power station near Warrington. This was impacted negatively by the decline of the domestic mining industry and the switch to alternative energy sources. The few trains that still use the Woodhead Line could use alternate routes without much impact. One such line is the unelectrified . After withdrawal, the remaining Class 76s were taken to Reddish and Guide Bridge, where their fate was decided. In the end, they were taken to scrap merchants in Sheffield and Rotherham. == Preservation == Locomotive 26020 is on display at the National Railway Museum in York. This is the same engine that was on display at the 1951 on London's South Bank. One cab from another locomotive, 76048 Hector, was on display at the in Manchester. In 2023, it was moved to the in Rotherham. At this point, the number was changed to 76039. == Related pages == * British Rail Class 77 * British Rail Class EF1 * British Rail Class 506 == References == == Sources == * * * * * * == Other websites == * The LNER Electric Bo-Bo Class EM1 (BR Class 76) Locomotives - LNER Encyclopedia 76 Category:1500V DC locomotives",
 "title": "British Rail Class 76"
}