{
 "id": "147277",
 "text": "Over the years, Mario has become a famous video game character. He stars in many video games and even has his own series of video games and its spinoff series, the Donkey Kong, Yoshi, and Wario series. The following course of video games Mario has appeared in over the years is listed below: == Home consoles == === Nintendo Entertainment System === Title Developer Year Donkey Kong Nintendo EAD 1981 Donkey Kong Classics Nintendo EAD 1988 Donkey Kong Jr. Nintendo EAD 1982 Dr. Mario Nintendo EAD 1990 Golf Nintendo EAD 1984 Mario Bros. Nintendo EAD 1983 Mario's Time Machine Radical Entertainment 1994 NES Open Tournament Golf Nintendo EAD 1991 Pinball Nintendo EAD 1984 Punch Out!! Nintendo EAD 1987 Super Mario Bros. Nintendo EAD 1985 Super Mario Bros. 2 Nintendo EAD 1988 Super Mario Bros. 3 Nintendo EAD 1988 Tennis Nintendo EAD 1984 Tetris Nintendo EAD 1988 Wrecking Crew Nintendo EAD 1985 Yoshi Game Freak 1991 Yoshi's Cookie Bullet Proof Software 1992 === Super Nintendo Entertainment System === Title Developer Year Dr. Mario for SNES Nintendo EAD 1994 Mario & Wario Game Freak 1993 Mario is Missing! Software Toolworks 1993 Mario Paint Intelligent Systems 1992 Mario's Early Years! Fun with Letters Software Toolworks 1994 Mario's Early Years! Fun with Numbers Software Toolworks 1994 Mario's Early Years! Preschool Fun Software Toolworks 1994 Mario's Super Picross Jupiter 1995 Mario's Time Machine Software Toolworks 1993 Super Mario All-Stars Nintendo EAD 1993 Super Mario Kart Nintendo EAD 1992 Super Mario RPG: Legend of the Seven Stars Square Enix 1996 Super Mario World Nintendo EAD 1990 Super Mario World 2: Yoshi's Island Nintendo EAD 1995 Tetris Attack Intelligent Systems 1995 Wrecking Crew '98 Pax Softnica 1998 Yoshi's Cookie Bullet Proof Software 1993 Yoshi's Safari Nintendo EAD 1993 ===Nintendo 64=== Title Developer Year Dr. Mario 64 Nintendo EAD 2001 Mario Golf Camelot Software Planning 1999 Mario Kart 64 Nintendo EAD 1996 Mario Party Hudson 1998 Mario Party 2 Hudson 1999 Mario Party 3 Hudson 2000 Mario Tennis Camelot 2000 Paper Mario Intelligent Systems 2000 Super Mario 64 Nintendo EAD 1996 Super Smash Bros. 64 HAL Laboratories 1999 Yoshi's Story Nintendo EAD 1997 ===GameCube=== Title Developer Year Luigi's Mansion Nintendo EAD 2001 Super Smash Bros. Melee HAL Laboratory 2001 Super Mario Sunshine Nintendo EAD 2002 Mario Party 4 Hudson Soft 2002 Mario Party 5 Hudson Soft 2003 Mario Kart: Double Dash!! Nintendo EAD 2003 Mario Golf: Toadstool Tour Camelot Software Planning 2003 Paper Mario: The Thousand-Year Door Intelligent Systems 2004 Mario Party 6 Hudson Soft 2004 Mario Power Tennis Camelot 2004 Mario Superstar Baseball Namco, NOW Productions 2005 Mario Party 7 Hudson Soft, Nintendo SPD 2005 Super Mario Strikers Next Level Games 2005 ===Wii=== Title Developer Year Super Paper Mario Intelligent Systems 2007 Mario Party 8 Hudson Soft 2007 Mario Strikers Charged Next Level Game 2007 Mario & Sonic at the Olympic Games Sega Sports R&D; 2007 Super Mario Galaxy Nintendo EAD Tokyo 2007 Mario Kart Wii Nintendo EAD Group No. 1 2008 Mario Super Sluggers Namco Bandai Games, NOW Production 2008 Super Smash Bros. Brawl Ad hoc development team 2008 Mario Power Tennis (New Play Control range) Camelot 2009 Mario & Sonic at the Olympic Winter Games SEGA Sports R&D; 2009 New Super Mario Bros. Wii Nintendo EAD Group No. 4 2009 Super Mario Galaxy 2 Nintendo EAD Tokyo 2010 Super Mario All-Stars 25th Anniversary Edition Nintendo EAD 2010 Mario Sports Mix Square Enix, Nintendo SPD Group No.4 2010 Mario & Sonic at the London 2012 Olympic Games Sega Sports Japan 2011 Mario Party 9 Nd Cube 2012 ===Wii U=== Title Developer Year New Super Mario Bros. U Nintendo EAD 2012 Super Mario 3D World Nintendo EAD Tokyo, 1-UP Studio 2013 Mario & Sonic at the Sochi 2014 Olympic Winter Games Sega Sports R&D;, Nintendo SPD 2013 Dr. Luigi Arika, Nintendo SPD 2013 Mario Kart 8 Nintendo EAD 2014 Super Smash Bros. for Wii U Sora Ltd., Bandai Namco Games 2014 Mario Maker Nintendo EAD 2014 Mario Party 10 Nd Cube, Nintendo SPD 2015 Mario vs. Donkey Kong TBC TBC == Handheld consoles == === Game Boy === Title Developer Year Alleyway Nintendo EAD, Intelligent Systems 1989 Donkey Kong Nintendo EAD, Pax Softnica 1994 Dr. Mario Nintendo EAD 1990 Game & Watch Gallery TOSE 1997 Golf Intelligent Systems 1989 Mario's Picross Jupiter 1995 Picross 2 Jupiter 1996 Super Mario Land Nintendo EAD 1989 Tennis Nintendo EAD, Intelligent Systems 1989 Tetris Attack Intelligent Systems 1996 Wario Blast: Featuring Bomberman! Nintendo EAD 1994 Wario Land II Nintendo EAD 1998 Yoshi Game Freak 1991 Yoshi's Cookie Bullet Proof Software 1992 Super Mario Land 2: 6 Golden Coins Nintendo R&D1; 1992 Wario Land: Super Mario Land 3 Nintendo R&D1; 1994 Mario's Picross Jupiter, Nintendo 1995 Game & Watch Gallery 2 Nintendo 1997 ===Game Boy Color=== Title Developer Year Super Mario Bros. Deluxe Nintendo 1998 Game & Watch Gallery 3 Nintendo 1999 Mario Golf Camelot Software Planning 1999 Mario Tennis Camelot Software Planning 2001 ===Game Boy Advance=== Title Developer Year Mario Kart: Super Circuit Intelligent Systems 2001 Super Mario Advance Nintendo Entertainment Analysis and Development 2001 Super Mario Advance 2: Super Mario World Nintendo Entertainment Analysis and Development 2001 Yoshi's Island: Super Mario Advance 3 Nintendo Entertainment Analysis and Development 2002 Game & Watch Gallery 4 Nintendo 2002 Super Mario Advance 4: Super Mario Bros. 3 Nintendo EAD 2003 Mario & Luigi: Superstar Saga AlphaDream, Vanpool 2003 Donkey Kong Nintendo 2004 Classic NES Series: Super Mario Bros. Nintendo 2004 Classic NES Series: Dr. Mario Nintendo 2004 Mario vs. Donkey Kong Nintendo Software Technology 2004 Mario Golf: Advance Tour Camelot Software Planning 2004 Mario Pinball Land Fuse Games 2004 Mario Party Advance Hudson Soft 2005 Mario Tennis: Power Tour Camelot Software Planning 2005 Dr. Mario & Puzzle League Nintendo 2005 Yoshi Topsy Turvy Nintendo, Artoon 2005 ===Nintendo DS=== Title Developer Year Super Mario 64 DS Nintendo EAD Comprehensive Group 2004 Yakuman DS Nintendo SPD 2005 Mario Kart DS Nintendo EAD Group No. 1 2005 Mario & Luigi: Partners in Time AlphaDream 2005 Yoshi Touch & Go Nintendo EAD Group No. 4 2005 Super Princess Peach TOSE 2005 New Super Mario Bros. Nintendo EAD Group No. 4 2006 Mario Hoops 3-on-3 Square Enix 2006 Mario vs. Donkey Kong 2: March of the Minis Nintendo Software Technology 2006 Yoshi's Island DS Nintendo, Artoon 2006 Tetris DS Nintendo SPD 2006 Mario Party DS Hudson Soft 2007 Itadaki Street DS Enix, Square Enix 2007 Mario & Sonic at the Olympic Games Sega Sports R&D; 2007 Game & Watch Collection Nintendo 2008 Mario & Luigi: Bowser's Inside Story AlphaDream 2009 Mario & Sonic at the Olympic Winter Games SEGA Sports R&D; 2009 Game & Watch Collection 2 Nintendo 2010 Mario vs. Donkey Kong: Mini-Land Mayhem! Nintendo Software Technology 2010 ===Nintendo 3DS=== Title Developer Year Super Mario 3D Land Nintendo EAD Tokyo 2011 Mario Kart 7 Nintendo EAD Group No. 1, Retro Studios 2011 Mario & Sonic at the London 2012 Olympic Games Sega Sports Japan 2012 Mario Tennis Open Camelot Software Planning 2012 New Super Mario Bros. 2 Nintendo EAD Group No. 4 2012 Paper Mario: Sticker Star Nintendo, Intelligent Systems, Vanpool 2012 Luigi's Mansion: Dark Moon Next Level Games, Nintendo SPD 2013 Mario & Luigi: Dream Team AlphaDream, Good-Feel 2013 Mario Party: Island Tour Nd Cube 2013 Mario Golf: World Tour Camelot Software Planning 2014 Yoshi's New Island Arzest 2014 Super Smash Bros. for Nintendo 3DS Sora Ltd., Bandai Namco Games 2014 ==Digital Platforms== ===Nintendo e-Shop=== Title Developer Year Mario and Donkey Kong: Minis on the Move Nintendo Software Technology 2013 NES Remix Nintendo EAD Tokyo, indieszero 2013 NES Remix 2 Nintendo EAD Tokyo, indieszero 2014 ===WiiWare=== Title Developer Year Dr. Mario Online Rx Arika 2008 ===DSiWare=== Title Developer Year Dr. Mario Express Arika 2008 * Category:Video game lists",
 "title": "List of video games featuring Mario"
}