{
 "id": "14725",
 "text": "Windows Vista is the 6th version of the Microsoft Windows operating system from Microsoft. It is the successor to Windows XP. While it was being made, it was called Longhorn. On July 28, 2005, Microsoft gave out its real name, which was Windows Vista. The original release of Windows Vista was supported until April 13, 2010; every user of Windows Vista needs to install a Service Pack 1 in order to receive security patches and support after that date, and Service Pack 2 after July 12, 2011. With Service Pack 2 installed on Windows Vista, Microsoft ended mainstream support on April 10, 2012 and then stopped supporting Windows Vista as a whole on April 11, 2017. Microsoft had worked on Vista for more than five years, so it came with many new features, such as improved graphics, new built-in programs, and stronger defenses against malware. Windows Vista received mixed reviews. However, Windows Vista introduced many changes to the way the operating system worked, which caused some older programs to stop working. == Vista editions and system requirements == Vista was released in November 2006 for computer makers and January 30, 2007 for home users. The six main editions of Windows Vista are: *Home Basic Edition *Home Premium Edition *Starter Edition *Business Edition *Enterprise Edition *Ultimate Edition Some editions are meant for home use, while others are made mainly for businesses. Starter Edition is similar to Windows XP Starter Edition, as it is a low-budget edition that was only released in countries where computers were not as common. Enterprise Edition is for big companies that need computers that have good performance. Windows Vista needs at least 512 MB of RAM to run on all computers. Some new parts of Vista need 1 GB of RAM to work and for better stability and performance. Windows Vista system requirements Vista Capable Vista Premium Ready Processor 800 MHzWindows Vista minimum supported system requirements 1 GHz Memory 512 MB 1 GB Graphics card DirectX 9.0 capable DirectX 9.0 capable and WDDM 1.0 driver support Graphics memory 64 MB 128 MB HDD capacity 40 GB 80 GB HDD free space 15 GB Optical drives DVD-ROM driveAny optical drive that can read DVD-ROM media. (Only to install from DVD-ROM media) == Development == At first, a major version of Windows code-named Blackcomb was planned as the successor to Windows XP and Windows Server 2003. Features planned for Blackcomb included the Sidebar, an emphasis on looking for data, and an advanced storage system named WinFS. However, a minor release code-named Longhorn was announced for 2003, delaying the making of Blackcomb. By the middle of 2003, Longhorn had gotten some of the features meant for Blackcomb. After three major viruses exploited flaws in Windows operating systems within a short time in 2003, Microsoft changed its development priorities, putting some of Longhorn's major development work on hold while they made new service packs for Windows XP and Windows Server 2003. Development of Longhorn was reset in September 2004, and it was renamed to Windows Vista. A number of features were cut from Windows Vista as it was being remade. After Windows Vista was released, Microsoft announced a new plan for the next version of Windows, code-named Windows 7, in 2007. == Service Packs == Microsoft releases service packs to update software and fix problems to the operating system. === Service Pack 1 === Windows Vista Service Pack 1 (SP1) was released on February 4, 2008 alongside Windows Server 2008 to OEM partners, after a five-month beta test period. The first use of the service pack caused a number of machines to continually reboot, making them unusable. This caused Microsoft to temporarily stop release of the service pack until the problem was resolved. The same release date of the two operating systems showed the merging of the workstation and server kernels back into a single code base for the first time since Windows 2000. MSDN subscribers were able to download SP1 on February 15, 2008. SP1 became available to current Windows Vista users on Windows Update and the Download Center on March 18, 2008. Initially, the service pack only supported 5 languages - English, French, Spanish, German and Japanese. Support for the remaining 31 languages was released on April 14, 2008. === Service Pack 2 === Service Pack 2 for Windows Vista was released to manufacturing on April 28, 2009, Windows Vista SP2 RTM + Windows Vista SP1 Blocker Tool Removed and released to Microsoft Download Center and Windows Update on May 26, 2009. In addition to security and other fixes, a number of new features were added. However, it did not include Internet Explorer 8. == References == == Other websites == === Microsoft === * Microsoft Windows Vista — Microsoft Windows Vista homepage * Microsoft Windows Vista Upgrade Info — Windows Vista Upgrade planning * Microsoft Windows Vista Hardware Design — Hardware Design for Windows Vista — News for Driver Developers and Hardware Engineers * Microsoft Technet — Windows Vista: Resources for IT Professionals * MSDN — Windows Vista Developer Center on MSDN * The Windows Vista Blog — Official blog of the Windows Vista Team === Reviews and screenshots === * Windows Vista Screenshots Gallery — Collection of Vista Screenshots from Different Builds * Features of Windows Vista * Windows Vista 32-bit and 64-bit Performance Compared * Windows Vista Ultimate — CNET review * Windows XP vs. Vista: The Benchmark Rundown — Tom's Hardware Guide review Category:Microsoft operating systems",
 "title": "Windows Vista"
}