{
 "id": "147325",
 "text": "An interactive whiteboard is a large, interactive screen that connects a computer and a projector. The projector projects the computer's desktop onto the screen of the interactive whiteboard. The user can control the computer by using a special pen, finger or another tool to touch the screen of the interactive whiteboard. Normally, interactive whiteboards are fixed on walls. However, there are some mobile interactive whiteboards. Interactive whiteboards are used in many different places such as in classrooms, in work groups and in training rooms for professional coaching. Interactive whiteboards are the modern version of the traditional whiteboards used in schools. == Operation == The interactive whiteboard must be connected to a computer. Most whiteboards are connected to the computer's Serial port or to a USB port. Some newer systems can use a wireless connection to the computer. The summary of use the interactive whiteboard includes three words: controlling, translation and presentation. * Controlling the PC means you can use the projection field like the desktop of the PC, and the pen or the finger is the computer mouse. * Most whiteboards translate the hand written notes on the board into standard computer text, so you can see your text clearly and save it as a file. * Another use for interactive whiteboards is for presentations. You can start and control your presentation while standing in front of the whiteboard and you are not depending on a keyboard. == Using interactive whiteboards == Teachers: * They can write onto the board and save it as a document for use in the other lessons . You can also send the whole lesson or the documents via e-mail to pupils who were absent. * Interactive whiteboard makes it easy to demonsate how to use new software * Videos can be shown For students: * Fixing and changing ideas of a brainstorming easily is an resource which students can use to reach a success faster. When student can use modern technology they are more interested in learning. == Projection Systems == Front-projection: In this system the projector is placed in front of the whiteboard. Either the projector is fixed on the whiteboard or it hangs on the ceiling. Pros Compared to the rear projection this system is much cheaper Cons The teacher or the student must stand in front of the whiteboard and sometimes their body will cast a shadow. Rear-projection: In the rear- projection system the projector is placed behind the whiteboard. Pros The teacher does not cast a shadow and does not look into the projector light while speaking to the students. Cons This system is very expensive. Category:Display technology Category:Data input",
 "title": "Interactive whiteboard"
}