{
 "id": "147668",
 "text": "The Bloc Québécois (BQ) is a federal political party based in Canada that mainly believes and advocates Quebec can secede from Canada, also known as Quebec sovereignty. The Bloc was created by Members of Parliament (MPs) from the national Progressive Conservative Party and the Liberal Party. They were angry that the Meech Lake Accord could not pass. The party is considered to be centre-left. The leader of the party is currently Yves-François Blanchet. == History == The Bloc Québécois was founded in 1991 by Lucien Bouchard, who also became its first leader, in order to represent and advocate the Quebec sovereignty movement at the federal level in the Parliament of Canada. The Bloc was always the party with the biggest number of seats in Quebec between 1993 and 2011, and again since 2019. They are usually the second or third biggest party in the House of Commons. In the 2011 federal election, the party won only 4 seats. In the 2019 federal election, the party won 32 seats. In the 2021 federal election, the party won 32 seats in the House of Commons. ==Relationship with the Parti Québécois== The Parti Québécois is a provincial political party in Quebec to which it is allied. The Parti Québécois also wants sovereignty for Québec. Although the two political parties are separate organizations, they help each other during elections. == Party leaders == * Lucien Bouchard (1991–1996) * Gilles Duceppe (1996) temporary * Michel Gauthier (1996–1997) * Gilles Duceppe (1997–2011) * Vivian Barbot (2011) temporary * Daniel Paillé (2011–2013) * Mario Beaulieu (2014–2015) * Gilles Duceppe (2015) * Rhéal Fortin (2015–2017) temporary * Martine Ouellet (2017–2018) * Mario Beaulieu (2018–2019) temporary * Yves-François Blanchet (since 2019) ==References== ==Other websites== * Category:Nationalist organizations in North America Category:Social democratic parties Category:Political parties of Quebec Category:1991 establishments in Canada",
 "title": "Bloc Québécois"
}