{
 "id": "147775",
 "text": "James E. Hansen (born March 29, 1941 in Denison, Iowa) headed the NASA Goddard Institute for Space Studies in New York City, a part of the Goddard Space Flight Center in Greenbelt, Maryland, Earth Sciences Division until early 2013. He is currently an Adjunct Professor in the Department of Earth and Environmental Sciences at Columbia University. Hansen is best known for his research in the field of climatology, his testimony on climate change to congressional committees in the 1980s that helped raise broad awareness of the global warming issue, and his continuing advocacy of action to limit the impacts of climate change. He has been a critic of the Bill Clinton and George W. Bush Administration's stances on climate change. Hansen studied astronomy and physics in the 1960s at the University of Iowa. He did scientific research on the atmospheres of other planets, and later Earth's atmosphere. Hansen was elected to the National Academy of Sciences in 1996. He was elected a foreign member of the Academia Europaea in 1999. He received a US$250,000 Heinz Environment Award for his research on global warming in 2001. He was listed as one of Time Magazine's 100 Most Influential People in the Time 100 (2006) list and, in 2007, he shared the US$1 million Dan David Prize. On April 5, 2008, Dr. Hansen received the PNC Bank Common Wealth Award of Distinguished Service for his outstanding achievements in science. Hansen posited in a 2007 paper that 350 ppm (parts per million) of carbon dioxide in the atmosphere is a safe http://www.poptech.org/popcasts/dan_gilbert__poptech_2007 Why haven’t we rallied our collective power to solve global warning? by Daniel Gilbert (psychologist) upper limit to avoid a climate tipping point.http://www.bangordailynews.com/detail/124985.html“Fact sheet: The need for mitigation.” UNFCCC: United Nations Framework Convention on Climate Change. June 2009. (Retrieved 2009-09-01.)“350 Science,” 350.org (Retrieved 2009-09-01.)McKibben, Bill. “Remember This: 350 Parts Per Million,” The Washington Post. December 28, 2007. (Retrieved 2009-09-01.)Spyros, George. “350: The Most Important Number of Your Lifetime ,” Treehugger. April 14, 2008. (Retrieved 2009-09-01.) The current record level is 389 ppm of CO2, an almost 40-percent increase from the pre-industrial revolution level of 278 ppm.http://www.wmo.int/pages/mediacentre/press_releases/pr_868_en.htmlBlasing, T.J. “Recent Greenhouse Gas Concentrations ,” CDIAC: Carbon Dioxide Information Analysis Center. July 2009. (Retrieved 2009-09-01.) In 1988 the Earth's atmosphere surpassed the 350 ppm mark, while global CO2 emissions per capita rose. Hansens strong public opposition to the exploitation of oil sands and the :en:Keystone XL pipeline project created some controversy in the media.The Climate Scientist and the Pipeline March 8, 2013 The New York Times Storms of My Grandchildren is Hansen's first book about the climate change. In 2013, Hansen was co-author of an open letter saying \"continued opposition to nuclear power threatens humanity's ability to avoid dangerous climate change.\" == References == Category:NASA Category:American physicists Category:Scientists from Iowa Category:1941 births Category:Living people Category:Members of Academia Europaea",
 "title": "James Hansen"
}