{
 "id": "147725",
 "text": "The Clean Tech Revolution: The Next Big Growth and Investment Opportunity, is a 2007 book by Ron Pernick and Clint Wilder. They say that using clean technologies is a profitable enterprise that is moving steadily into mainstream business. Clean technologies are seen to be important for economic growth.Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution: The Next Big Growth and Investment Opportunity Collins, 320 pages, , Retrieved 14 December 2008. Pernick and Wilder highlight eight major clean technology areas: solar power, wind power, biofuels, green buildings, personal transportation, the smart grid, mobile applications (such as portable fuel cells), and water filtration.For investors, a heads-up on clean tech The Boston Globe, August 5, 2007. Retrieved 14 December 2008. Very large corporations such as GE, Toyota and Sharp, and investment firms such as Goldman Sachs are spending billions of dollars on clean technology. ==History of clean tech== Pernick and Wilder say that, in the 1970s, clean technology was considered “alternative”. Even at the start of the 21st century, the term clean tech was not yet widely used. But now, throughout much of the world, in trends large and small, there is \"the beginning of a revolution that is changing the places where we live and work, the products we manufacture and purchase, and the development plans of cities, regional governments, and nations around the globe.\"Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution (PDF) p. 3. ==Clean technology trends== Pernick and Wilder highlight eight major clean technology sectors: solar power, wind power, biofuels, green buildings, personal transportation, the smart grid, mobile applications, and water filtration. The authors explain how investors, entrepreneurs, and individuals can profit from technological innovation in these areas. Pernick and Wilder identify some specific clean technologies, companies, and regions that are leading the way.Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution (PDF) The book also explains that nuclear power and clean coal are not clean technologies. Apart from the risks associated with nuclear power, \"multibillion-dollar nuclear plants are simply not cost-effective when compared with other energy sources.\"Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution (PDF) p. 24. The authors also believe that clean coal is an oxymoron for a myriad of reasons, including the sheer number of coal mine-related deaths and the fact that coal-fired plants, even some cleaner ones, are major contributors to serious illnesses such as asthma, heart disease, and mercury poisoning.Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution (PDF) p. 25. Emerging clean tech cities are seen to include Copenhagen, where wind power generates 20 percent of Denmark's electricity, and Chicago, a leader in \"green\" buildings saving energy, heating and cooling costs. ==Six C's== Pernick and Wilder identify six major forces, which they call the six C’s, that are pushing clean technology into the mainstream and driving rapid growth and expansion: costs, capital, competition, China, consumers, and climate.Pernick, Ron and Wilder, Clint (2007). The Clean Tech Revolution (PDF) pp. 5–16. *Costs. \"Perhaps the most powerful force driving today’s clean-tech growth is simple economics. As a general trend, clean-energy costs are falling as the costs of fossil fuel energy are going up. The future of clean tech is going to be, in many ways, about scaling up manufacturing and driving down costs.\" *Capital. \"An unprecedented influx of capital is changing the cleantech landscape, with billions of dollars, euros, yen, and yuan pouring in from a myriad of public and private sector sources.\" *Competition. \"Governments are competing aggressively in the highstakes race to dominate in the clean-tech sector and build the jobs of the future.\" *China. \"Clean tech is being driven by the inexorable demands being placed on the earth not only by mature economies but also by the explosive demand for resources in China, India, and other developing nations. Their expanding energy needs are driving major growth in clean-energy, transportation, building, and water-delivery technologies.\" (See also, Renewable energy in China.) *Consumers. \"Savvy consumers are demanding cleaner products and services that use resources efficiently, reduce costs, and embrace quality over quantity.\" *Climate. \"The debate around climate change has gone from question mark to peer-reviewed certainty, and smart businesses are taking heed.\" ==Quotes== :\"The solar-power market offers perhaps one of the greatest opportunities among its clean-tech peers. Not only is the worldwide solar market growing by 30% to 50% per year, but the same technologies that enabled the semiconductor and computer revolution are now being leveraged in the solar market.\" (p. 20) :\"Wind energy has been expanding rapidly since the mid-1990s -- right up there with solar. From 1995 to 2006, global cumulative installed wind-power capacity expanded fifteenfold, from less than 5,000 MW to more than 74,000 MW.\" (p. 21) :\"Today, Brazil gets more than 30% of its automobile fuels from sugar cane-based ethanol. In the United States, ethanol is nearly a 5-billion-gallon-a-year industry, on target to reach 7.5 billion gallons (about 5% of total gasoline consumption) around 2010. One of the greatest opportunities will lie in distilling fuels and creating materials from cellulosic nonfood crops such as switchgrass and jatropha.\" (p. 21) :\"Today’s green buildings use some 30% less energy than their comparably sized nongreen counterparts (some save much more), and they’re generally brighter, healthier, and more aesthetically pleasing. Often built with little or no additional up-front cost, green offices, for instance, pay back not only in energy savings but also in greater employee retention, attendance, and productivity.\" (p. 21) :\"Since 2003, hybrid cars have gone from a tiny speck on the automotive landscape to one of the U.S. vehicle market’s fastest growing segments. Toyota doubled its flagship hybrid car’s allocation in North America in 2005, to 100,000, and started building hybrids on U.S. assembly lines in 2006. By the end of 2006 there were some 15 hybrid models on showroom floors, including hybrid models for such popular vehicles as the Honda Civic and Accord and the Toyota Camry.\" (p. 4) ==Recent developments== In a September 2007 article in Renewable Energy Access Wilder explains that, while some hurdles remain, the key solar trends mapped out in The Clean Tech Revolution—scaling up manufacturing and driving down costs—are coming to pass: > From the Nevada desert to the roofs of Wal-Mart stores to the legendary > plains of Spain, solar is entering a bold, bright new era. Each week, solar > seems to be winning new enthusiasts like Forbes, new investors of all > stripes, and new large-scale business users like Wal-Mart, Macy's and > Kohl's. Late last month, North Carolina Governor Mike Easley signed that > state's first renewable portfolio standard into law, which includes a solar > set-aside.A New Bold, Bright Era for Solar Renewable Energy Access, > September 12, 2007. Retrieved 14 December 2008. > Investment money is pouring in, production lines are humming and expanding, > the silicon shortage is being addressed, and the long-fought challenge of > bringing solar to scale (the title of a 2002 Clean Edge report) is finally > showing real hope. Last month, red-hot Chinese solar wafer supplier LDK > Solar (whose second-quarter revenue grew 700%) announced manufacturing > expansions that would raise its production capacity above 1,600 megawatts > (MW) by the end of 2009. German solar cell producer Ersol Solar Energy just > inked a contract for 1 billion euros to supply Germany PV module company > Solon AG for 11 years. Ernst & Young and Dow Jones VentureOne have reported that investments in clean technology companies in the first half of 2007 have reached $1.1 billion. The research found that clean technology investments are poised to increase by more than 35% in 2007 compared with 2006.Cleantech investments surge Socaltech.com, September 26, 2007. Retrieved 14 December 2008. Very large corporations such as GE, Toyota and Sharp, and investment firms such as Goldman Sachs are now making multi-billion dollar investments in clean technology. ==Related pages== *Clean Edge *Wind farms *Solar power stations *Renewable energy commercialization *State of the World *Winning the Oil Endgame ==References== ==Other websites== *The Business Benefits of Going Green *Eco-millionaires see boom times ahead *Oil Imports and Oil Prices Drive United States to Increase Renewable Energy Capacity *Giving London the green light *Investor Confidence in Cleantech Grows * CleanTech Venture Investments by US Firms Break Record in 2007 *Solar energy 'revolution' brings green power closer *Green-tech investment topped $5 billion in 2007 *Silicon Valley Rebounds, Led by Green Technology *Cafe Musings (or How Clean Tech is Becoming Ubiquitous) *Cleantech venture investments were $2 bln in Q2 Category:Energy Category:Technology Category:Non-fiction books Category:2007 books Category:Green politics",
 "title": "The Clean Tech Revolution"
}