{
 "id": "147833",
 "text": "Port Vale Football Club are an English football club currently playing in Football League Two. They are based in Burslem, Staffordshire — one of six towns that make up the city of Stoke-on-Trent. The club's rivals in the city are Stoke City, games between the two clubs are known as the \"Potteries derby\". Games against Crewe Alexandra are also called a derby, although Alex are in south Cheshire. Port Vale are not named after a place, which is unusual for an English league clubs. The two symbols on the clubs badge are a bottle kiln and the Stafford knot. == Name == * 1876-1911 Burslem Port Vale F.C. * 1911-present Port Vale F.C. == Stadiums == === The Old Recreation Ground === The Rec was Port Vale's home from 1913 to 1950. The Old Recreation Ground was in Hanley and stood on what is now the car park for the Potteries Shopping Centre. === Vale Park === Vale Park has been Port Vale's home ground since 1950. Vale Park has a capacity of around 22,000. Vale Park is not the oldest ground in the world, it has had several upgrades in its history. The original ground consisted of two stands (The Railway side and the Lorne Street main stand) with banks of terracing at the Bycars and Hamil ends of the ground. Stands were added behind each set of goals during the 1980s and 1990s as the ground began to be made more modern. The paddock at the front of the Railway Stand was also made into an all-seated area, with just the Lorne Street side now being left as a standing area. Vale fans stood for the last time on Lorne Street at the end of the 1997-98 season, with the stand being demolished before work began on a new £3,000,000 structure. Work has yet to been finished on this, due to low funds and a change in ownership of the club. However, once new owners V2001 had taken care of the financing, work was finally begun on finishing the second half of the stand. It is due to be completed sometime in 2008. == Robbie Williams == Among the club's famous fan base is singer Robbie Williams, who was raised in Stoke-on-Trent. He is now a major shareholder, having, in February 2006, bought £240,000 worth of the £250,000 worth of available shares in the club. Castle Comfort Stairlifts, the club's sponsors, at the same time bought the remainder for £10,000.\"Robbie buys into Vale\", BBC.co.uk, 27 February 2006 :\"Although I can't be at the Vale often, my investment is just to say that my heart is still there and I'm a huge supporter. I'm really excited about what we may be able to do with the club in the future.\" Robbie Williams speaking in 2006. For the computer game FIFA 2000, he provided an original theme song with It's Only Us, on the condition that Port Vale were included in the game, which they were, and are in the Rest of World section. This song was also featured on the only FIFA Soundtrack CD release by EMI. In 2005 Williams founded Los Angeles Vale F.C., a Super Metro League team in the United States, named for Port Vale and based at his L.A. home. == Honours and achievements == === League === Football League Division Three North: 2 * Champions: 1929-1930, 1953-54 * Runners-up: 1952–53not promoted Football League Division Four: 1 * Champions: 1958-1959 ==== Other promotions ==== * 1969-70: Football League Division Four - 4th (promotion to Football League Division Three) * 1982-83: Football League Division Four - 3rd (promotion to Football League Division Three) * 1985-86: Football League Division Four - 4th (promotion to Football League Division Three) * 1988-89: Football League Division Three - Play-off winners (promotion to Football League Division Two) * 1993-94: Football League Division Two - Runners Up (promotion to Football League Division One) * 2012-13 Npower League 2 - 3rd (promotion to Npower League 1) === Cups === Staffordshire Senior Cup: 1 * Winners: 2000-01 Anglo-Italian Cup * Runners-up: 1995-96 Debenhams Cup * Runners-up: 1976-77 === Trophies === Football League Trophy: 2 * Winners 1992-93, 2000-01 == League position == Season League Position 2000/01 Second Division 11th 2001/02 Second Division 14th 2002/03 Second Division 17th 2003/04 Second Division 7th 2004/05 League One 18th 2005/06 League One 13th 2006/07 League One 12th 2007/08 League One 23rd 2008/09 League Two 18th === Former position === == Statistics == === Club Records === Highest home attendance 30,000: vs Aston Villa, 20 February 1960, FA Cup R5 Largest league win 9-1: vs Chesterfield, 24 September 1932, Second Division Heaviest league defeat 0-10: vs Sheffield United, 10 December 1892, Second Division Largest cup win 7-1: vs Irthlingborough Town, 12 January 1907, FA Cup R1 Most capped player Christopher Birchall: 22, Trinidad and Tobago Most League appearances Roy Sproson: 761, 1950-1972 Most League goals Wilf Kirkham: 154, 1923-1933 Most goals in a season Wilf Kirkham: 38, 1926-27 (Second Division) Highest transfer fee paid £500,000: Gareth Ainsworth from Lincoln City, 11 September 1997 Highest transfer fee received £2,000,000: Gareth Ainsworth to Wimbledon, 29 October 1998 === Highest Football League finishes === Before the War: * 1930-31: Football League Division Two 5th After the War: * 1996-97: Football League Division One 8th === Best Cup runs === FA Cup * Semi Finalists: 1953-54 League Cup * Round 4: 2006–07 == Managers in the past == * 1876 Enoch Hood * 1896 Sam Gleaves * 1905 Tom Clare * 1911 A.S. Walker * 1912 H. Myatt * 1914 n/a (WWI) * 1919 Tom Holford * 1924 Joe Schofield * 1930 Tom Morgan * 1932 Tom Holford * 1936 Warney Cresswell * 1937 Tom Morgan * 1938 n/a (WWII) * 1945 Billy Frith * 1946 Gordon Hodgson * 1951 Freddie Steele * 1957 Norman Low * 1962 Freddie Steele * 1965 Jackie Mudie * 1967 Stanley Matthews * 1968 Gordon Lee * 1974 Roy Sproson * 1977 Bobby Smith * 1978 Dennis Butler * 1979 Alan Bloor * 1979 John McGrath * 1983 John Rudge * 1999 Brian Horton * 2004 Martin Foyle * 2007 Lee Sinnott * 2008 Dean Glover == Other websites == * Official site * News Coverage at BBC Sport * News Coverage at The Sentinel == References == Category:English football clubs Category:Organisations based in Stoke-on-Trent Category:1873 establishments in England",
 "title": "Port Vale F.C."
}