{
 "id": "147816",
 "text": "WWE Backlash is a series of professional wrestling pay-per-view and livestreaming events made by WWE. They are usually held in April or May, following WrestleMania. == History == The first event, which happened in 1999 was also supposed to be part of the In Your House series. From 2004 to 2006, only Raw superstars appeared at Backlash. The 2007 event was the first WWE PPV event since Judgment Day 2003 (other than the \"big four\" shows WrestleMania, SummerSlam, Royal Rumble, and Survivor Series) to feature all three brands (Raw, SmackDown! and ECW) after WWE stopped with brand-only events. After the 2009 edition, Backlash no longer took place, with its April/May slot being taken over by Extreme Rules in 2010. Backlash returned in 2016 (this was the only edition no to be held in spring) and has taken place yearly since (except in 2019). The 2016 and 2017 editions were exclusive to SmackDown. The 2021 and 2022 editions were titled WrestleMania Backlash. The following year's event, now simply called Backlash again, took place in San Juan, Puerto Rico. The 2024 event, titled Backlash France, was the first big WWE show in the country, taking place near Lyon. ==Events== Raw-branded event SmackDown-branded event # Event Date City Venue Main Event Ref. 1 Backlash (1999) April 25, 1999 Providence, Rhode Island Providence Civic Center \"Stone Cold\" Steve Austin (c) vs. The Rock in a No Holds Barred match for the WWF Championship with Shane McMahon as the special guest referee 2 Backlash (2000) April 30, 2000 Washington, D.C. MCI Center Triple H (c) vs. The Rock for the WWF Championship with Shane McMahon as the special guest referee 3 Backlash (2001) April 29, 2001 Rosemont, Illinois Allstate Arena The Two Man Power Trip (\"Stone Cold\" Steve Austin (WWF) and Triple H (Intercontinental)) vs. The Brothers of Destruction (The Undertaker and Kane) (Tag Team) in a Winners Take All match for the WWF Championship, WWF Intercontinental Championship, and WWF Tag Team Championship 4 Backlash (2002) April 21, 2002 Kansas City, Missouri Kemper Arena Triple H (c) vs. Hollywood Hulk Hogan for the Undisputed WWF Championship 5 Backlash (2003) April 27, 2003 Worcester, Massachusetts Worcester Centrum Goldberg vs. The Rock 6 Backlash (2004) April 18, 2004 Edmonton, Alberta, Canada Rexall Place Chris Benoit (c) vs. Shawn Michaels vs. Triple H in a triple threat match for the World Heavyweight Championship 7 Backlash (2005) May 1, 2005 Manchester, New Hampshire Verizon Wireless Arena Batista (c) vs. Triple H for the World Heavyweight Championship \" 8 Backlash (2006) April 30, 2006 Lexington, Kentucky Rupp Arena John Cena (c) vs. Edge vs. Triple H in a triple threat match for the WWE Championship 9 Backlash (2007) April 29, 2007 Atlanta, Georgia Philips Arena John Cena (c) vs. Edge vs. Randy Orton vs. Shawn Michaels in a fatal four-way match for the WWE Championship 10 Backlash (2008) April 27, 2008 Baltimore, Maryland 1st Mariner Arena Randy Orton (c) vs. John \"Bradshaw\" Layfield vs. John Cena vs. Triple H in a fatal-four-way elimination match for the WWE Championship 11 Backlash (2009) April 26, 2009 Providence, Rhode Island Dunkin' Donuts Center John Cena (c) vs. Edge in a Last Man Standing match for the World Heavyweight Championship 12 Backlash (2016) September 11, 2016 Richmond, Virginia Richmond Coliseum Dean Ambrose (c) vs. AJ Styles for the WWE World Championship 13 Backlash (2017) May 21, 2017 Rosemont, Illinois Allstate Arena Randy Orton (c) vs. Jinder Mahal for the WWE Championship 14 Backlash (2018) May 6, 2018 Newark, New Jersey Prudential Center Roman Reigns vs. Samoa Joe 15 Backlash (2020) June 14, 2020 Orlando, Florida WWE Performance Center Edge vs. Randy Orton 16 WrestleMania Backlash (2021) May 16, 2021 Tampa, Florida WWE ThunderDome at Yuengling Center Roman Reigns (c) vs. Cesaro for the WWE Universal Championship 17 WrestleMania Backlash (2022) May 8, 2022 Providence, Rhode Island Dunkin' Donuts Center Drew McIntyre and RK-Bro (Randy Orton and Riddle) vs. The Bloodline (Roman Reigns, Jey Uso, and Jimmy Uso) 18 Backlash (2023) May 6, 2023 San Juan, Puerto Rico Coliseo de Puerto Rico José Miguel Agrelot Cody Rhodes vs. Brock Lesnar 19 Backlash France May 4, 2024 Décines-Charpieu,France LDLC Arena Cody Rhodes (c) vs. AJ Styles for the Undisputed WWE Championship == References == == Other websites == * Official Backlash Website * Backlash results at Prowrestlinghistory.com Category:1999 establishments",
 "title": "WWE Backlash"
}