{
 "id": "148187",
 "text": "The British Rail Class 373 or TGV-TMST train is an electric multiple unit that operates Eurostar's high-speed rail service between Britain, France and Belgium via the Channel Tunnel. Part of the TGV family, it has a smaller cross-section to fit within the constrictive British loading gauge, was originally able to operate on the UK third rail network, and has a lot of fireproofing in case of fire in the tunnel. This is both the second- longest——and second-fastest train in regular UK passenger service. In 2015, the new Eurostar class 374 (e320’s) started being rolled out making the class 373’s going for scrap. As of 2017, 11 sets remain in service. In 1997, Great North Eastern Railway (GNER) ordered a few trains for use on the ECML and were retired in 2005. TGV hired these trains on their lines. As of 2016, all units remain in storage with no plans to return to service. These trains also ran on third rail towards London Waterloo. As of 2017, all but a few TGV TMST’s are in new Eurostar Blue livery. == Accidents and incidents == Further information: TGV accidents On 5 June 2000, 373101/102 on a Paris to London service derailed on LGV Nord near Arras, France at 180 mph (290 km/h). 14 people were treated for light injuries or shock, with no serious injures or fatalities. The articulated design was credited with maintaining stability during the incident and the train stayed upright. After investigation, the incident was blamed on a component of the transmission between the motors and axles coming loose. To reduce the unsprung mass, TGV trains have the motors attached to the train rather than the bogies. In order for the train to be able to go around curves a sliding \"tripod\" assembly is used, which became dislodged. There have been several minor incidents. In October 1994, there were teething problems relating to the start of operations. The first preview train, carrying 400 members of the press and media, was delayed for two hours by technical issues. On 29 May 2002 a set was accidentally routed towards Victoria instead of London Waterloo, causing it to arrive 25 minutes late. The signalling error that led to the incorrect routeing was stated to have caused \"no risk\" as a result. During the night of 18–19 December 2009, there was heavy snow causing widespread disruption to roads, railways and airports across northern Europe. Five trains (one of which was 373217 + 373218) broke down inside the Channel Tunnel because snow in the engine compartment was melted by warmer temperatures in the tunnel, the resulting water causing electrical and control system faults. Eurostar commissioned an independent report to evaluate what went wrong and how future events could be prevented or better managed. The report's recommendations included: * Increased number of diesel rescue locomotives with exhaust filtration to be on standby at each end of the tunnel. * Major changes to the power cars to prevent snow ingress into electrical compartments. * Better staff training. * Improved communication internally and with other stakeholders (Eurotunnel and emergency services). * Better information provision to passengers. The majority of the recommendations were implemented by 23 October 2012. == Technical details == === Power === Eurostar 373211/373212 on LGV Interconnexion Est, near Chennevières-lès-Louvres, Val d'Oise, France All Class 373 sets were built as tri-voltage, able to operate on 25 kV 50 Hz AC (LGVs, Eurotunnel, High Speed 1, UK overhead electrified lines) and 3 kV DC (Belgian classic lines) using pantographs, and 750 V DC (UK third rail network) using third-rail pickup shoes. The shoes were retracted when switching to overhead power. After the opening of High Speed 1in 2007, overhead electrification is used throughout and the third rail shoes had been removed. Five of the SNCF-owned sets are quadri-voltage, able to operate from 1,500 V DC (French lignes classiques) in the south of France, used on London–Avignon and ski services. A Class 373 passes Herne Hill; from 1994 until 2007, Eurostar ran its services to and from London Waterloo/Waterloo International, using the third rail network in Southern England The trains are powered by asynchronous traction motors. There are four powered axles in each power car and two powered axles in the outer bogie of the front passenger coach (a layout used on the original SNCF TGV Sud-Est (PSE) sets) giving 12 powered axles. Each set draws up to 16MW with 12 MW (16,000 hp) of traction power, but the lowest power-to-weight ratio in the TGV family. The class uses five different standards of overhead: domestic catenary in each of Belgium, France and the United Kingdom; fixed-height catenary on LGV lines and HS1; and taller catenary in the Channel Tunnel, designed to accommodate double-deck car-carrying trains and roll-on roll-off heavy goods vehicle trains. The driver must manually lower and then raise the pantograph during the transition between catenary systems. ==Notes== ==References== Category:High-speed trains 373",
 "title": "British Rail Class 373"
}