{
 "id": "14852",
 "text": "South Carolina is a state in the southeast United States. Its capital city is Columbia which with 137,300 people is the largest city in South Carolina by population. The population of the state is about 5.2 million people, ranked 23rd in the United States. South Carolina has an area of 32,030 square miles, making it the 40th largest state in the United States. Other important cities in South Carolina are Greenville, Spartanburg, Anderson, Sumter, and Florence. Major landforms include beaches, \"barrier islands\", salt marsh, sandhills , rolling piedmont, and the Blue Ridge Mountains. Because of its natural beauty, the state attracts many tourists, especially to Myrtle Beach, Charleston, and Hilton Head Island. South Carolina became a state in 1788. The economy was agriculture-based, known for cotton, rice, indigo, and tobacco by African American slaves. After the American Civil War, the state lost much of its political and economic power. Towards the end of the 20th century, the state began to strengthen its economy and add population. Today, the major industries are tourism, textiles (clothing materials), golf, and manufacturing. South Carolina has the second highest number of workers employed by international companies per capita in the United States. South Carolina is bounded to the north by North Carolina, to the south and west by Georgia, located across the Savannah River, and to the east by the Atlantic Ocean. ==History== The original inhabitants of South Carolina were Native Americans. At least 29 Native American tribes lived in South Carolina. The Native American population declined after the arrival of Europeans. https://www.sciway.net/hist/indians/ == Farming == Before the Civil War, South Carolina grew a lot of rice. African slaves worked on slave plantations in the state. == Participation In The Civil War & 1876-1966 Segregation == === The Civil War === South Carolina became the first of eleven states to secede from the union, on December 20, 1860, to protest the election of Republican Abraham Lincoln. It joined the Confederacy. The first battle of the Civil War took place at Fort Sumter, in Charleston. === 1876-1966 Segregation & Democratic Dominance === After the Civil War, African-Americans in South Carolina got to vote for some time, but soon black codes were enacted, and white-supremacist groups like the KKK were reborn, restricting African-Americans from voting. South Carolina thus became a Democratic stronghold. In fact, in 1904, Republican Theodore Roosevelt, who was running for president, won less than 5% of the vote in the state. The Democratic candidate won over 95% of the vote. This cult of fear disabled most African-Americans in South Carolina from voting till 1965, when President Johnson signed the Voting Rights Act. === Confederate Flag === For a long time, South Carolina had the Confederate flag hanging over its capital. This is no longer the case. == Famous People == U.S. President Andrew Jackson was born in South Carolina. ==Related pages== * Colleges and universities in South Carolina * List of counties in South Carolina ==References== Category:1788 establishments in the United States",
 "title": "South Carolina"
}