{
 "id": "14853",
 "text": "Rhode Island is the smallest state in the United States by area. The capital and largest city is Providence. It is called the \"Ocean state\" because of its bays and waterways. It was founded by Roger Williams for religious freedom. The Narragansett people lived there before Europeans came, but people like Roger Williams didn't respect them and used the land for their own reasons. The colonists fought a war against the native people and many of them were killed or ran away from the colonists. Rhode Island was one of the original Thirteen Colonies. It became very important to the economy because of the slave trade, and more slaves were taken to the thirteen colonies through Rhode Island than any of the others in the 18th century. Slavers would send ships from Newport to buy slaves from Africa and make money by trading goods with others involved in slavery. Rhode Island became a state (the last of the thirteen to agree to the new United States Constitution) in 1790. But despite it joined the United States in 1790, it was founded in 1776. Rhode Island is bordered on the north and east by Massachusetts, on the west by Connecticut, and on the south by Rhode Island Sound and the Atlantic Ocean. It shares a water border with New York. It is named for a large island in Rhode Island Sound, Rhode Island. Some thought the island looked liked Rhodes, an island in Greece. An executive order was signed by Governor Gina Raimondo on June 22, 2020 to remove \"Providence Plantations\" from the official state name due to its ties to slavery. Rhode Island moves to change its official name due to slavery ties Raimondo stated the change would go into effect \"as soon as practicable.\" Rhode Island moves to change official name over slavery ties In November 2020, the official name was voted to be changed to \"State of Rhode Island\". ==Related pages== * Colleges and universities in Rhode Island * List of counties in Rhode Island ==Notes== == References == ==Other websites== Category:1790 establishments in the United States",
 "title": "Rhode Island"
}