{
 "id": "14850",
 "text": "Virginia is a place in the United States. Its capital is Richmond and its largest city is Virginia Beach. The official name of Virginia is the Commonwealth of Virginia. About 8.6 million people lived there in 2020. == Geography == Virginia is bordered (touching) by West Virginia, Maryland, and the District of Columbia (across the Potomac River) to the north, by the Chesapeake Bay and the Atlantic Ocean to the east, by North Carolina and Tennessee to the south, and by Kentucky and West Virginia to the west. == History == Native Americans were the first people to settle in Virginia. Virginia became a state in 1788 after the American Revolution. Before it became a state of the United States, Virginia was one of the Thirteen Colonies of Great Britain. Virginia was founded (started) in 1607 in Jamestown, Virginia. The state of West Virginia was part of Virginia until the American Civil War. Virginia then left (seceded from) the United States and joined the Confederate States of America. The western counties of Virginia seceded from Virginia to form a new state which was loyal to the Union. After the end of the Civil War, Virginia became part of the United States again in 1870, but the counties that had left to start West Virginia did not join Virginia again. Virginia is the state where eight United States presidents were born. This is more than any other state. The first African-American slaves were sent to Virginia. == Economy == Virginia has many industries like local and national government, military, farming, technology and business. Many Virginians work for the government because it is next to Washington, D.C.. The Central Intelligence Agency, Department of Defense, as well as the National Science Foundation are in Northern Virginia. Farming is the largest industry in the state, making 334,000 jobs. Tomatoes, peanuts, tobacco, and hay are grown in Virginia. Technology is a fast growing industry. Virginia is 4th in technology workers after California, Texas, and New York. ==Related pages== * Colleges and universities in Virginia * List of counties in Virginia == References == == Other websites == * Virginia at Citizendium Category:1788 establishments in the United States",
 "title": "Virginia"
}