{
 "id": "15034",
 "text": "Ancient Egypt, or the Kingdom of Kemet, was a society that began around 3150 BC\"Chronology\". Digital Egypt for Universities, University College London. and lasted until 30 BC, when it was invaded by the Roman Empire. Egypt grew along the Nile River and was at its most powerful in the 2nd millennium BC. Its land stretched from the Nile Delta to Nubia, a kingdom located mostly in present-day Sudan. With the water from the Nile, crops were generally good. They were grown after the Nile flood water went down. The Egyptians created a way of writing using hieroglyphs. They also built huge temples and tombs, traded with other areas, and had a powerful army. Their religion had many gods, and its priests were powerful and rich. The Egyptian rulers, called pharaohs, were thought to be close to the gods. == History == === Farming begins === People have lived along the Nile for a very long time, according to archaeologists, who study objects left by ancient people. The fertile flood plains of the Nile allowed people to begin farming. By the 10th millennium BC, the people in Egypt had begun growing cereal grains like wheat and barley. Because they were farming, people stayed in one place instead of living a nomadic lifestyle. Because they were settled, their society became more complex. That was an important step in the history of human civilization.Shaw, Ian 2003. The Oxford history of Ancient Egypt. Oxford University Press. . This period in Egyptian history is called \"predynastic,\" as it happened before the large dynastic kingdoms were formed. === Cultures develop === By about 5500 BC, small tribes living in the Nile Valley had developed into a series of cultures. Each had begun farming crops and animals. Each had their own types of pottery and personal items, such as combs, bracelets, and beads. In Upper Egypt, the south part of the country, the Badarian was one of the earliest cultures. It is known for its high-quality pottery, stone tools, and its use of copper.Hayes W.C. 1964. Most ancient Egypt: Chapter III. The Neolithic and Chalcolithic communities of northern Egypt. JNES 23: 217–272 It was followed by the Amratian and Gerzian cultures.Childe, V. Gordon 1953. New light on the most ancient Near East. Praeger, N.Y. === Periods in history === The different periods of ancient Egyptian history are: * Predynastic Period (5500 – 3000 BC) * Early Dynastic Period (1st & 2nd Dynasties, 3000 – 2700 BC) * Old Kingdom (3rd to 6th Dynasties, 2700 – 2180 BC) * First Intermediate Period (7th to 11th Dynasties, 2180 – 2050 BC) * Middle Kingdom (11th to 14th Dynasties, 2080 – 1640 BC) * Second Intermediate Period (15th to 17th Dynasties, 1640 – 1560 BC; the Hyksos) * New Kingdom (18th to 20th Dynasties, 1560 – 1070 BC) * Third Intermediate Period (21st to 25th Dynasties, 1070 – 664 BC) * Late Period (26th to 31st Dynasties, 664 – 323 BC; the Persians) * Greco-Roman Egypt (323 – 30 BC; Ptolemaic to Roman) During some of the Intermediate periods, the traditional system broke down, the country was divided, or it was invaded by foreign rulers. During some periods, the Egyptian government was challenged and sometimes overthrown. Still, Egypt's culture and climate were relatively stable compared to those of other parts of the Middle East. == Government == === Districts === Ancient Egypt was divided into many different districts, called sepats. The first divisions were created during the Predynastic Period, but they became small city-states that ruled themselves. When the first pharaoh came to power, the sepats remained and were much like the counties in many countries today. They stayed basically the same for a long time. There were 42 of them, and each was ruled by a governor, chosen by the pharaoh. In later years. the districts were called nomes, and the governor was called a nomarch. === Taxes === Ancient Egypt had many different taxes, but there was no real money, so people paid each other with goods or work. The person who watched the tax collection was a scribe, and every tax collector in Egypt had to state every day how many taxes they had collected. Each person paid different taxes based on the work that they did: for example, craftsmen paid in goods while hunters and fishermen paid with food. Every household in the country paid a labour tax every year by helping with work for the country (like mining or working on canals). Many rich Egyptians paid poorer people to do that for them. == Language == Ancient Egyptian language developed within six time periods. === Archaic Egyptian (before 3000 BC) === This language was found on pottery carvings. Archaic means 'very old.' === Old Egyptian (3000 BC to 200 BC) === This language was used during the Old Kingdom and First Intermediate Period. It has been found in pyramids and Egyptian tombs. It was the first version of the language that had plural tense, which shows that people were discussing more than one object at a time. === Middle Egyptian (2000 BC to 1300 BC) === This language is called Classic Egyptian. It is found all over objects and tombs in Egypt, including Egyptian coffins. Books on science and society were written during this time, and many of the things that we know about religion of the time are written in Classic Egyptian. Even after people stopped speaking this kind of Egyptian, writers still used it when they wrote books. === Late Egyptian (1300 BC to 700 BC) === This is the language of the New Kingdom, which was the best time in Egypt's history. There was a lot of knowledge being shared during this time and so we have many very old books that were written in Late Egyptian. Many people believe that this version of the language was much like what the Egyptians spoke. === Demotic and Coptic === Demotic Egyptian was used from around 700 BC to 400 AD. Coptic Egyptian was used from around 300 AD to 1700 AD. == Writing == === Hieroglyphics === Egypt had writing called hieroglyphics, which is one of the two oldest written languages in history. (The other is Sumerian cuneiform). Hieroglyphic writing dates to c. 3200 BC and has around 500 symbols. A hieroglyph represents a word, a sound, or a symbol to show what the sign means. The same symbol can serve different purposes in different contexts. Hieroglyphs on stone monuments and in tombs were for public purposes. It was art and often propaganda. === Hieratic script === Priests used this script for everyday writing on papyrus, wood or cloth. It was a cursive form of writing, called hieratic, which was quicker and easier. Formal hieroglyphs may be read in rows or columns in either direction, but are typically written from right to left. Hieratic was always written from right to left, usually in horizontal rows. === Demotic script === This was the script that ordinary people used. It became the main writing style in ancient Egypt. This form of writing and formal hieroglyphs accompanies the Greek text on the Rosetta Stone. === Coptic script === The Coptic script is a modified Greek alphabet. The Coptic language is the last stage of the Egyptian language. (Today, Egyptians speak a dialect of Arabic). == Literature == Some ancient Egyptian literature has survived to the present day. There are teaching texts such as the Maxims of Ptahhotep, the Instructions of Amenemope, and the Ebers papyrus. The Ebers papyrus is one of the earliest medical texts ever found. There are also poems and stories. * The story of Sinuhe :An Ancient Egyptian murder mystery written around 1800 BC. * Ipuwer papyrus :A poem about the ruin of Egyptian society--some think it is about the story in Exodus, a book in the Jewish/Christian Bible. * Westcar papyrus :A series of stories about the Pharaoh Khufu told by his sons. * Papyrus Harris I :The longest papyrus ever found in Egypt. * Story of Wenamun :An ancient adventure story about a priest who goes to collect gifts from a king. == Religion == Religion was very important to Ancient Egyptians. The centre of any Egyptian town was the temple, a building that was used for everything from the town hall to a university in addition to its religious services. Because they were so religious, Egyptians created a lot of art depicting many different kinds of divine (holy) creatures, including the pharaoh, who was thought to be a god. The afterlife was also very important to Egyptians, who are known for mummifying their dead. The mummies are important to scientists today because they provide information about how the Egyptians lived. === Gods and goddesses === All of the gods were important, but some were more important than others. Isis was the goddess of the sky. Another major god was Ra, who was the god of the sun. The less well-known god of the Nile and crocodiles was named Sobek, which is a rather unusual name. Bastet was the goddess of cats, so the Ancient Egyptians mummified cats in her honour. She was also the goddess of protection, joy and families. == Agriculture == === Rich soil === The rich fertile soil came from annual floodings of the Nile River. The ancient Egyptians were able to produce plenty of food, which allowed the population to devote more time and resources to cultural, technological, and artistic pursuits. Ancient Egyptian taxes were assessed based on the amount of land a person owned.Manuelian, Peter Der 1998. Egypt: the world of the Pharaohs. Könemann Verlagsgesellschaft mbH. Cologne. . Most animals were kept as food. Some animals were kept as pets. All kinds of animals were important to Egypt. Ancient Egyptians understood the animals that they kept: goats, pigs, ducks, cows and geese. === Farming === Farming in Egypt was dependent on the cycle of the Nile. The Egyptians recognized three seasons: Akhet (flooding), Peret (planting), and Shemu (harvesting). The flooding season lasted from June to September. The flooding on the river's banks left a layer of mineral-rich silt ideal for growing crops. After the floodwaters had receded, the growing season lasted from October to February. Farmers plowed and planted seeds in the fields, which were irrigated with ditches and canals. Egypt receives little rainfall, so farmers relied on the Nile to water their crops.Nicholson, Paul T. et al. 2000. Ancient Egyptian materials and technology. Cambridge University Press. .p514 From March to May, farmers used sickles to harvest their crops, which were then threshed with a flail to separate the straw from the grain. Winnowing removed the chaff from the grain, which was then ground into flour, brewed to make beer, or stored for later use.p506 === Agricultural products === Flax plants were grown for the fibers of their stems. The fibers were split along their length and spun into thread, which was used to weave sheets of linen and to make clothing. Papyrus growing on the banks of the Nile River was used to make paper. Vegetables and fruits were grown in garden plots, close to homes and on higher ground. They had to be watered by hand. Vegetables included leeks, garlic, melons, squashes, pulses, lettuce, and other crops. In addition, grapes were made into wine.p577; 630 == Medicine == Ancient Egyptians had some advanced medical knowledge for their time. They performed surgery, set broken bones, and even used medicines like honey, breast milk, and gazelle's milk. These had medicinal benefits, but people also thought they kept evil spirits and demons away. The Edwin Smith papyrus is the world's oldest surviving surgical document, written around 1600 BC. The text provides detailed descriptions of anatomy and the examination, diagnosis, treatment, and prognosis of 48 types of medical problems. == Pyramids == Ancient Egyptian pyramids are shaped stone masonry structures. They are the best-known pyramid structures and are some of the largest ever buildings. Over 130 pyramids have been discovered in Egypt. Most were built on the western side of the Nile in desert areas. Egyptian pyramids are often contain chambers and passages and were built as the burial places of the Egyptian kings before the start of the Old Kingdom until the end of the Middle Kingdom. Because the Egyptians kept written records, we know about the building of some pyramids. The Great Pyramid, at Giza, is the largest and most famous pyramid. It was built for Pharaoh Khufu. is over 140 metres high, and took 20 years to build. It is listed as one of the Seven Wonders of the World. The step pyramid at Saqqara is the earliest pyramid that is still standing today. Built in 2630 BC, it was a burial place of the Pharaoh Djoser. Its architect was Imhotep. == Other achievements == Engineering was an important activity in Egypt. Engineers measured and surveyed the distance between two points. They designed and made the pyramids, which are nearly perfect geometrically. They also make cement and developed large irrigation networks. Science was also important. Mathematics was used, and the golden ratio was used in the construction of the pyramids. Another ability of the Egyptians was glassmaking. Archaeologists have found many pieces of beads, jars, figures, and ornaments in tombs across the nation. In 2005, the remains of an ancient glassmaking factory was found. == Timeline == === Predynastic === * 3500 BC: Senet, a board game, is invented * 3500 BC: Egyptian faience, the world's oldest earthenware, or pottery, is created. It is not the same as modern faience pottery. === Dynastic === * 3300 BC: Bronze works are first created * 3200 BC: Hieroglyphs are developed * 3100 BC: Decimal system in use * 3100 BC: Mining occurs on Mount Sinai * 3100 BC: Ships are built in Abydos, an Egyptian city * 3000 BC: Trading takes place between Egypt and Palestine * 3000 BC: Copper plumbing in use * 3000 BC: Papyrus, or ancient paper, is first used * 3000 BC: First documented use of medicine * 2900 BC: Perhaps the first steel use in the ancient world * 2700 BC: First surgery performed * 2700 BC: Surveying used by engineers * 2700 BC: Hieroglyphs no longer show only little pictures of words but become based on sounds * 2600 BC: The Great Pyramids of Giza created * 2600 BC: Shipping expeditions occur * 2600 BC: First use of barges * 2600 BC: Pyramid of Djoser created * 2600 BC: Menkaure's Pyramid and the Red Pyramid created * 2200 BC: Government in Egypt collapsed, meaning many different people tried to become pharaoh * 1900 BC: Possible Nile to Red Sea canal created * 1650 BC: The Rhind Mathematical Papyrus is written, which shows knowledge of geometry, arithmetic and algebra * 1600 BC: The Edwin Smith Papyrus is written, which shows knowledge of advanced medical techniques * 1550 BC: The Ebers Medical Papyrus is written, the first document on the topic of tumours * 1500 BC: Glassmaking * 1258 BC: First known peace treaty (Ramesses II) * 1160 BC: The Turin Papyrus is written, the first geologic and topographic map == Related pages == * Old Kingdom of Egypt * Middle Kingdom of Egypt * New Kingdom * Hatshepsut * Ramesses II * Cleopatra VII == References == *",
 "title": "Ancient Egypt"
}