{
 "id": "151086",
 "text": "The New Year Concert of the Vienna Philharmonic Orchestra is a concert of classical music that takes place each year on the morning of 1 January in Vienna, Austria. The concert hall where they are held is called the Wiener Musikverein. The music traditionally consists of waltzes, marches and polkas by the Strauss family. The concert is shown on television to about one billion people in 44 countries. == Music and setting == The music always includes pieces from the Strauss family (Johann Strauss I, Johann Strauss II, Josef Strauss and Eduard Strauss). The music consists mainly of waltzes, polkas, mazurkas and marches. Sometimes other Austrian composers are included. In 2009, for the first time, music by Joseph Haydn was played. It was the 4th movement of Haydn's Symphony No. 45, known as the \"Farewell Symphony\". It was performed because the year 2009 is the 200th anniversary of Haydn's death. These concerts have been held in the \"Großer Saal\" (Large Hall) of the Wiener Musikverein since 1939. Since 1980 the flowers that decorate the concert hall are a gift each year from the city of Sanremo, Liguria, Italy. On television the viewers can also see ballet dancers who dance to the music. These dancers are often dancing in Schönbrunn Palace, Schloss Esterházy, the Vienna State Opera or in the Wiener Musikverein itself. The concert always ends with three encores after the main programme. The first encore is a fast polka. The second encore is Johann Strauss II's Blue Danube Waltz. The audience start to clap as soon as the music for this famous waltz starts. The last encore is the Radetzky March. The audience like to clap along to the music. The concert was first performed in 1939. === Conductors === * Clemens Krauss, 1939, 1941–1945, 1948–1954 * Josef Krips, 1946–1947 * Willi Boskovsky, 1955–1979 * Lorin Maazel, 1980–1986, 1994, 1996, 1999, 2005 * Herbert von Karajan, 1987 * Claudio Abbado, 1988, 1991 * Carlos Kleiber, 1989, 1992 * Zubin Mehta, 1990, 1995, 1998, 2007 * Riccardo Muti, 1993, 1997, 2000, 2004 * Nikolaus Harnoncourt, 2001, 2003 * Seiji Ozawa, 2002 * Mariss Jansons, 2006, 2012 * Georges Prêtre, 2008, 2010 * Daniel Barenboim, 2009 * Franz Welser-Möst, 2011 Category:Concerts Category:January events",
 "title": "Vienna New Year's Concert"
}