{
 "id": "151486",
 "text": "North American Soccer League (NASL) was a soccer league with teams from the United States, Canada, and Puerto Rico. The league was founded in 2009 and began play in 2011. It is the second level of the soccer pyramid in both the U.S. and Canada, behind Major League Soccer. Puerto Rico has its own soccer league, but it plays at a level below the NASL. ==Teams== Club City Stadium Capacity First season Final season Fate Atlanta Silverbacks Atlanta, Georgia Atlanta Silverbacks Park 5,000 2011 2015 Folded California United FC Fullerton, California Titan Stadium 10,000 never played Withdrew from NPSL Founders Cup before playing (2019) FC Edmonton Edmonton, Alberta Clarke Stadium 5,000 2011 2017 Joined the CPL (2019) Fort Lauderdale Strikers Fort Lauderdale, Florida Central Broward Stadium 20,450 2011 2016 Folded Indy Eleven Indianapolis, Indiana Carroll Stadium 12,100 2014 2017 Joined the USL Championship Jacksonville Armada FC Jacksonville, Florida Hodges Stadium 9,400 2015 2017 Joined the NPSL Miami FC Miami, Florida Riccardo Silva Stadium 20,000 2016 2017 Joined the NPSL (2019); Joined the USL Championship (2020) Minnesota United FC Blaine, Minnesota (Minneapolis) National Sports Center 8,500 2011 2016 Joined MLS Montreal Impact Montreal, Quebec Saputo Stadium 13,034 2011 Joined MLS New York Cosmos Hempstead / Brooklyn, New York James M. Shuart Stadium / MCU Park 11,929 / 7,000 Fall 2013 2017 Joined the NPSL Founders Cup (2019) North Carolina FC Cary, North Carolina (Raleigh) Sahlen's Stadium at WakeMed Soccer Park 10,000 2011 2017 Joined the USL Championship Oklahoma City FC Yukon, Oklahoma (Oklahoma City) Miller Stadium 6,000 never played Abandoned Ottawa Fury FC Ottawa, Ontario TD Place Stadium 24,000 2014 2016 Joined the USL Championship (2017); Desanctioned in 2019. Franchise rights transferred to Miami FC. Puerto Rico FC Bayam贸n, Puerto Rico Juan Ram贸n Loubriel Stadium 22,000 Fall 2016 2017 Folded Puerto Rico Islanders Bayam贸n, Puerto Rico Juan Ram贸n Loubriel Stadium 22,000 2011 2012 Folded Rayo OKC Yukon, Oklahoma (Oklahoma City) Miller Stadium 6,000 2016 Folded San Antonio Scorpions San Antonio, Texas Toyota Field 8,296 2012 2015 Folded San Diego 1904 FC San Diego, California Torero Stadium 6,000 never played Tried but failed to join the USL. Joined the National Independent Soccer Association (NISA) in 2019. San Francisco Deltas San Francisco, California Kezar Stadium 10,000 2017 Folded Tampa Bay Rowdies St. Petersburg, Florida Al Lang Stadium 7,227 2011 2016 Joined the USL Championship Virginia Cavalry FC Ashburn, Virginia Edelman Financial Field 4,000 never played Abandoned Category:2009 establishments in North America Category:Soccer leagues in the United States Category:Soccer leagues in Canada",
 "title": "North American Soccer League"
}