{
 "id": "151626",
 "text": "Stanley Ann Dunham (November 29, 1942 – November 7, 1995), the mother of Barack Obama, the 44th President of the United States, was an American anthropologist. She was later known as Ann Dunham, Ann Obama, Ann Soetoro, Ann Sutoro (after her second divorce) and finally as Ann Dunham.Scott (2011), p. 6: > Anyone writing about Dunham's life must address the question of what to call > her. She was Stanley Ann Dunham at birth and Stanley as a child, but dropped > the Stanley upon graduating from high school. She was Ann Dunham, then Ann > Obama, then Ann Soetoro until her second divorce. Then she kept her > husband's name but modernized the spelling to Sutoro. In the early 1980s, > she was Ann Sutoro, Ann Dunham Sutoro, S. Ann Dunham Sutoro. In > conversation, Indonesians who worked with her in the late 1980s and early > 1990s referred to her as Ann Dunham, putting the emphasis on the second > syllable of the surname. Toward the end of her life, she signed her > dissertation S. Ann Dunham and official correspondence (Stanley) Ann Dunham. > > p. 363: > modernized the spelling: The spelling of certain Indonesian words changed > after Indonesia gained its independence from the Dutch in 1949, and again > under a 1972 agreement between Indonesia and Malaysia... Names containing > oe,... are now often spelled with a u... However, older spellings are still > used in some personal names... After her divorce from Lolo Soetoro, Ann > Dunham kept his last name for a number of years while she was still working > in Indonesia, but she changed the spelling to Sutoro. Their daughter, Maya > Soetoro-Ng, chose to keep the traditional spelling of her Indonesian > surname. Dunham spent her childhood in California, Oklahoma, Texas and Kansas. Dunham spent her teenage years in Mercer Island, Washington.Scott (2011), p. 108. Much of her adult life was spent in Hawaii. ==Early life== Dunham was born in Ascension Via Christi Hospital St. Francis in Wichita, Kansas. She is the only child of Madelyn Lee Payne and Stanley Armour Dunham. Wild Bill Hickok is her sixth cousin, five times removed.Boston Genealogical Society Confirms Obama and \"Wild Bill\" Hickok Are Cousins New England Historic Genealogical Society, 2008-07-30. Ancestry.com announced on July 30, 2012, after using a combination of old documents and yD1NA analysis, that Dunham's mother may have been descended from African John Punch, who was an indentured servant/slave in seventeenth-century colonial Virginia. ==Death== In 1995 in Hawaii, she died of uterine cancer which spread to her ovaries. Following a memorial service at the University of Hawaii, Obama and his sister spread their mother's ashes in the Pacific Ocean at Lanai Lookout on the south side of Oahu. Obama scattered the ashes of his grandmother (Madelyn Dunham) in the same spot on December 23, 2008, weeks after his election to the presidency. Obama talked about Dunham's death in a 30-second campaign advertisement (\"Mother\") arguing for health care reform. The ad featured a photograph of Dunham holding a young Obama in her arms as Obama talks about her last days worrying about expensive medical bills. The topic also came up in a 2007 speech in Santa Barbara: > I remember my mother. She was 52 years old when she died of ovarian cancer, > and you know what she was thinking about in the last months of her life? She > wasn't thinking about getting well. She wasn't thinking about coming to > terms with her own mortality. She had been diagnosed just as she was > transitioning between jobs. And she wasn't sure whether insurance was going > to cover the medical expenses because they might consider this a preexisting > condition. I remember just being heartbroken, seeing her struggle through > the paperwork and the medical bills and the insurance forms. So, I have seen > what it's like when somebody you love is suffering because of a broken > health care system. And it's wrong. It's not who we are as a people. ==References== Category:American anthropologists Category:Cancer deaths in Hawaii Category:Deaths from uterine cancer Category:Obama family Category:Scientists from Wichita, Kansas Category:Scientists from Washington (state) Category:1942 births Category:1995 deaths",
 "title": "Ann Dunham"
}