{
 "id": "151697",
 "text": "In biology, an organ system is a group of organs that work together to perform one or more functions. Each does a particular job in the body, and is made up of certain tissues. == Organs and their tissue systems == These specific systems are widely studied in anatomy. They are present in many types of animals. * Circulatory system: pumping and channeling blood to and from the body and lungs with heart, blood and blood vessels. * Integumentary system: The skin, hair, fat, and nails. * Skeletal system: structural support and protection with bones, cartilage, ligaments and tendons. * Reproductive system: the sex organs, such as ovaries, fallopian tubes, uterus, vagina, mammary glands, testes, vas deferens, seminal vesicles and prostate * Digestive system: digestion and processing food with salivary glands, esophagus, stomach, liver, gallbladder, pancreas, intestines, rectum and anus. * Urinary system: kidneys, ureters, bladder and urethra involved in fluid balance, electrolyte balance and excretion of urine. * Respiratory system: the organs used for breathing, the pharynx, larynx, bronchi, lungs and diaphragm. * Endocrine system: communication within the body using hormones made by endocrine glands such as the hypothalamus, pituitary gland, pineal gland, thyroid, parathyroid and adrenal glands. * Immune system: protects the organism from outside Organisms like bacteria, viruses, fungi, and toxins (chemicals made by toxic cells) with proteins called antibodies. ** Lymphatic system: the transfer of lymph between tissues and the blood stream; includes the lymph and the nodes and vessels. The system includes the functions of immune responses and the development of antibodies. * Muscular system: allows for manipulation of the environment, provides locomotion, maintains posture, and produces heat. Includes skeletal muscles, smooth muscles and cardiac muscle. * Nervous system: collecting, transferring and processing information with brain, spinal cord and peripheral nervous system.",
 "title": "Organ system"
}