{
 "id": "152310",
 "text": "A rocket engine is a device that produces a force by pushing gases at high speed out of a nozzle. Rocket engines usually burn chemicals such as petrochemicals and liquid oxygen at very high pressures and temperatures to turn their chemical energy into motion of the rocket. In some cases (such as the Rocketdyne F-1), the force created can be over . A garden hose shows how moving fluid can create a force. When a hose is turned up, the hose will snake around unless it is held still. The water which is leaving the hose, is creating a force on the hose just like how the gases coming out of a rocket engine push on the rocket engine. This principle can be explained by Newton's third law. == Liquids, solids and hybrids == Some rocket engines burn liquid fuels while some burn solid fuels. Solid fuel rocket engines are sometimes called \"solid rocket motors\". Liquid fuel rocket engines often require complex pumps and valves to properly move (and pressurize) the liquids from the fuel tank to the actual engine. These machines must work in extreme temperatures and pressures. Liquid oxygen is very cold (-223˚C) while the engine is very hot (3000˚C), and the pressure is oftentimes hundreds of times higher than the surrounding air pressure. Because of these conditions, liquid fuel rocket engines are often very complex, expensive, and require very specialised materials (metal alloys, ceramics, etc.). Solid fuel rocket motors have the fuel (called propellant) as a solid mixture of an oxidizer and fuel. An oxidizer supports the burning of fuel much like oxygen supports burning. The common oxidizer is powdered Ammonium Perchlorate, while the common fuel is powdered aluminum metal. The two powders are stuck together with a third component known as the binder. The binder is a rubbery solid that also burns as a fuel. Since their design is so simple, solid rocket engines are usually much cheaper than other rocket engines, but their main disadvantage is that they cannot be turned off, their control is very limited, and they are more likely to explode than liquid rocket engines. Solid rockets also provide a smaller specific impulse (a measure of efficiency for rocket engines), hence must be heavier to launch the same payload. Military missiles commonly use solid rockets because they can be kept ready for many years, unlike liquid rockets, which require a lot of expensive maintenance, are less reliable, and cannot be kept fully fueled for long periods of time. Many satellite and rocket launchers use solid rocket boosters when they start, but use liquid rockets for the rest of the flight. Hybrid rocket engines combine the two ideas. The two propellants are different states of matter, often with liquid oxidisers and solid fuels. They are not used very often, but may be safer than solid rocket motors or liquid rocket engines. Liquid rocket engine specifications RL-10 HM7B Vinci KVD-1 CE-7.5 CE-20 YF-75 YF-75D RD-0146 ES-702 ES-1001 LE-5 LE-5A LE-5B Country of origin Cycle Expander Gas-generator Expander Staged combustion Staged combustion Gas-generator Gas-generator Expander Expander Gas-generator Gas-generator Gas-generator Expander bleed cycle （Nozzle Expander） Expander bleed cycle （Chamber Expander） Thrust (vac.) 66.7 kN (15,000 lbf) 62.7 kN 180 kN 69.6 kN 73 kN 200 kN 78.45 kN 88.26 kN 98.1 kN (22,054 lbf) 68.6kN (7.0 tf)without nozzle 48.52kN (4.9 tf) 98kN (10.0 tf)without nozzle 66.64kN (6.8 tf) 102.9kN (10.5 tf) r121.5kN (12.4 tf) 137.2kN (14 tf) Mixture ratio 5.2 6.0 5.2 6.0 5.5 5 5 Nozzle ratio 40 100 80 80 40 40 140 130 110 Isp (vac.) 433 444.2 465 462 454 443 438 442 463 425without nozzle 286.8 425without nozzle 291.6 450 452 447 Chamber pressure :MPa 2.35 3.5 6.1 5.6 5.8 6.0 3.68 7.74 2.45 3.51 3.65 3.98 3.58 LH2 TP rpm 125,000 41,000 46,310 50,000 51,000 52,000 LOX TP rpm 16,680 21,080 16,000 17,000 18,000 Length m 1.73 1.8 2.2~4.2 2.14 2.14 2.8 2.2 2.68 2.69 2.79 Dry weight kg 135 165 280 282 435 558 550 242 255.8 259.4 255 248 285 == References and notes == Category:Rockets",
 "title": "Rocket engine"
}