{
 "id": "152811",
 "text": "The Montreal Screwjob was an incident that happened on November 9, 1997, at the World Wrestling Federation (WWF)'s Survivor Series professional wrestling show. It happened in Montreal, Quebec, Canada. It is called a screwjob, because in real life, the way the match would end was changed without one of the wrestlers knowing about it. The wrestler who was screwed was Bret Hart. The people who took part in the screwjob were Hart's opponent Shawn Michaels, WWF's owner Vince McMahon, and referee Earl Hebner. == Why the screwjob happened == Bret Hart had wrestled in the WWF for 14 years, since 1983. He was popular, wrestling alone or as part of a tag team. He became WWF Champion five times. He was WWF Champion when the screwjob happened. In 1996, he signed a contract that lasted 20 years. The contract was meant to last until he retired as a wrestler, and let him be part of WWF's backstage plans. This meant he would be paid a lot of money. At the same time World Championship Wrestling (WCW), another professional wrestling company, was getting more popular. WCW had become popular using wrestlers who left WWF, like Hulk Hogan, Scott Hall, and Kevin Nash. They were now more popular than WWF. This meant WWF could not make as much money. WWF had signed a 20-year contract with Hart because they did not want him to leave, go to WCW, and make them even more popular. But now they found it hard to pay Hart, so they had to promise to pay him later because they were in danger of running out of money. Bret Hart and Shawn Michaels did not like each other. Hart took professional wrestling very seriously, whilst Michaels liked to party. This meant they would argue a lot. One time, when Michaels said that Hart was cheating on his wife with Sunny, a woman wrestler, the two had a fight backstage. Michaels said that if he were champion, he would not agree to lose to Hart, even though Hart had agreed to lose to Michaels on any occasion except Survivor Series. The Survivor Series show took place in Canada, which is Hart's home country. Hart did not want to lose the championship to someone he disliked in his own home country. Bret also did not like how his character had changed in the WWF. He was being told to act like he hated America. At the start of November, Hart agreed to leave WWF and sign a new contract with WCW. His time in the WWF would end after Survivor Series. Because he was still WWF Champion, and he did not want to lose it in his final appearance, Vince McMahon was worried that Hart would bring the championship belt to WCW. This had happened before, when Debra Miceli, a wrestler who appeared as Alundra Blayze in WWF and Madusa in WCW, left WWF as WWF Women's Champion. She brought the belt on to WCW's TV show, WCW Monday Nitro, and dropped the belt in a trash can. The WWF Championship was the most important belt in WWF, so it would be even worse if Hart did something like that. McMahon and Hart agreed to a plan, where Hart would still be champion at the end of Survivor Series. The next night on WWF's TV show, Monday Night Raw, he would give up the belt. McMahon did not follow this plan. == The screwjob == At Survivor Series, the match between Hart and Michaels was the main event (final match) of the show. At the end of the match, Michaels had put Hart in a wrestling hold called the Sharpshooter. This was a hold that Hart liked to use, and won a lot of matches with. The ending of the match was supposed to have D-Generation X (a group of Shawn Michaels' on-screen friends) and The Hart Foundation (a group of Bret Hart's relatives and on-screen friends) run out to try and help. This meant the match would end without a winner. After that, Hart would give up the belt. Instead, Earl Hebner, the referee, called for the match to end. He acted like Bret Hart had given up in the hold, even though he had not. The bell rang and the match ended. This meant that Shawn Michaels was the new WWF Champion. Hart was angry because this was not what had been planned. He spat at McMahon, who had planned this. The fans were also angry, and booed McMahon and Michaels while cheering Hart. == After the screwjob == Bret Hart went to WCW, where he wrestled for two years until he retired. Because the fans hated McMahon for what he had done, he decided to act like a villain on-screen. He was shown as the owner of the WWF (before, he pretended others owned it) and played the role of an evil boss. He had a long storyline with Stone Cold Steve Austin, who was a very popular hero at the time. On the January 4, 2010 episode of Raw, Hart made up with Michaels by shaking his hand and hugging in the ring. == Footnotes == Category:1997 in professional wrestling Category:WWE Category:1997 in Canada Category:1990s in Quebec",
 "title": "Montreal Screwjob"
}