{
 "id": "152854",
 "text": "This is the complete discography of the Canadian Punk rock band Sum 41. ==Albums== ===Studio albums=== List of studio albums, with selected chart positions and certifications Title Album details Peak chart positions Certifications CAN AUS Peaks in Australia: * All top 50 peaks: \"Australian Album Charts Search for Sum 41\" australian-charts.com. Retrieved on February 4, 2009. * Below top 50 peaks except noted: * Order in Decline: * Heaven :x: Hell: AUT \"Austrian Album Charts Search for Sum 41\" austriancharts.at. Retrieved on April 10, 2024. BEL \"Belgian Album Charts Search for Sum 41\" ultratop.be. Retrieved on April 7, 2024. FRA \"French Album Charts Search for Sum 41\" lescharts.com. Retrieved on February 4, 2009. GER JPN SWI \"Swiss Album Charts Search for Sum 41\" hitparade.ch. Retrieved on February 4, 2009. UK \"Chart Log UK (1994–2008) DJ S – The System Of Life\" Zobbel. Retrieved on February 4, 2009. US All Killer No Filler *Released: May 8, 2001 *Label: Aquarius/Island 9 33 19 11 25 29 50 39 7 13 *MC: 3× Platinum *ARIA: Gold\"ARIA Charts - Accreditations - 2003 Albums\" Australian Recording Industry Association. Retrieved on February 4, 2009. *BPI: 2× Platinum\"BPI - Statistics - Certified Awards - Search for Sum 41\" British Phonographic Industry. Retrieved on November 18, 2023. *RIAA: Platinum\"RIAA Database Search for Sum 41\" Recording Industry Association of America. Retrieved on February 4, 2009. *RIAJ: Gold Does This Look Infected? *Released: November 26, 2002 *Label: Aquarius/Island 8 56 49 49 28 58 12 17 39 32 *MC: Platinum *BPI: Gold *IFPI SWI: Gold *RIAA: Gold *RIAJ: Platinum *SNEP: Gold Chuck *Released: October 12, 2004 *Label: Aquarius/Island 2 13 35 84 9 32 2 14 59 10 *MC: 2× Platinum *RIAA: Gold *RIAJ: GoldGold disc certification, Recording Industry Association of Japan. Retrieved on October 10, 2011. Underclass Hero *Released: July 24, 2007 *Label: Aquarius/Island 1 22 8 85 17 10 2 9 46 7 *MC: Gold *RIAJ: GoldGold disc certification, Recording Industry Association of Japan. Retrieved on October 10, 2011. Screaming Bloody Murder *Released: March 29, 2011 *Label: Island 9 16 23 75 25 23 7 21 66 31 13 Voices *Released: October 7, 2016 *Label: Hopeless 6 13 13 38 51 9 17 14 16 22 *IMPALA: 2× Gold Order in Decline *Released: July 19, 2019 *Label: Hopeless 13 55 11 21 29 9 43 7 29 60 Heaven :x: Hell * Released: March 29, 2024 * Label: Rise * Formats: CD, CS, LP, digital download 37 72 3 11 8 4 50 3 26 108 \"—\" denotes a recording that did not chart or was not released in that territory. ===Live albums=== List of live albums, with selected chart positions Title Album details JPN Does This Look Infected Too? *Released: 2003 *Label: Aquarius/Island 18 Go Chuck Yourself *Released: December 21, 2005 *Label: Aquarius/Island 19 Live at the House of Blues, Cleveland 9.15.07 *Released: August 9, 2011 *Label: Island — \"—\" denotes a recording that did not chart or was not released in that territory. ===Compilation albums=== List of compilation albums, with selected chart positions and certifications Title Album details Peak chart positions Certifications JPN US All the Good Shit: 14 Solid Gold Hits 2000–2008 *Release: March 17, 2009 *Label: Aquarius/Island 7 154 *RIAJ: Gold\"RIAJ - Certified Awards - Search for Sum 41\" Recording Industry Association of Japan. Retrieved on November 14, 2023 *BPI: Gold ===Demo tapes=== List of demo tapes Title Details Rock Out With Your C*ck Out' *Release: 1998 *Label: Self-released ==Extended plays== List of EPs, with selected chart positions and certifications Title EP details Peak chart positions Certifications JPN UK US Half Hour of Power *Released: June 27, 2000 *Label: Aquarius 62 143 176 *MC: Gold *BPI: Silver Chuck: Acoustic *Released: February 22, 2005 *Label: Universal — — — \"—\" denotes a release that did not chart. ==Singles== List of singles as lead artist, with selected peak chart positions and certifications Title Year Peak chart positions Certifications Album CAN Peak chart positions for singles on the Canadian chart: * For all except noted: * For \"Fat Lip\": * For \"In Too Deep\": * For \"Still Waiting\": * For \"Pieces\": CAN Rock Peak positions for Sum 41's singles on Canadian Rock chart: *For all execpt noted: *For \"Makes No Difference\": *For \"We're All to Blame\": *For \"Pieces\": *For \"Some Say\": AUS GER \"Chartverfolgung / Sum 41 / Single musicline.de. Retrieved on January 15, 2011. IRL \"Irish Singles Chart for Sum 41\" dutchcharts.nl. Retrieved on February 4, 2009. ITA \"Italian Singles Chart Search for Sum 41\" italiancharts.com. Retrieved on December 27, 2015. UK UK Rock \"Sum 41 Chart History: UK Official Charts\" US US Alt \"Makes No Difference\" 2000 — 26 — — — — — — — 32 Half Hour of Power \"Fat Lip\" 2001 33 x 58 42 16 30 8 2 66 1 *BPI: Platinum All Killer No Filler \"In Too Deep\" 20 x 29 69 12 — 13 1 — 10 *BPI: Platinum *FIMI: Gold \"Motivation\" 2002 — x — — 40 — 21 3 — 24 \"What We're All About\" — x 63 91 23 30 32 4 — — Music from and Inspired by Spider-Man \"Still Waiting\" 40 x 43 90 20 21 16 1 — 7 *BPI: Silver *FIMI: Gold *RIAJ: Gold\"RIAJ - Certified Awards - Search for Sum 41\" Recording Industry Association of Japan. Retrieved on November 14, 2023 *BVMI: Gold\"BVMI Database - Search for Sum 41\" Federal Music Industry Association. Retrieved on November 14, 2023 Does This Look Infected? \"The Hell Song\" 2003 — x 76 — 31 37 35 4 — 13 *RIAA: Gold \"Over My Head (Better Off Dead)\" — x 62 — — — — — — — \"We're All to Blame\" 2004 — 12 — — — — — — — 10 Chuck \"Pieces\" 2005 9 2 — 84 — — — — — 14 *FIMI: Gold \"Some Say\" — 14 — — — — — — — — \"Underclass Hero\" 2007 33 8 76 76 — — 188 — — 34 Underclass Hero \"Walking Disaster\" — 24 — — — — — — — 26 \"With Me\" 2008 37 35 — — — — — — — — \"Screaming Bloody Murder\" 2011 72 12 — — — — — 36 — 37 Screaming Bloody Murder \"Baby, You Don't Wanna Know\" — 23 — — — — — — — — \"Fake My Own Death\" 2016 — 45 — — — — — — — — 13 Voices \"War\" — 22 — — — — — — — — \"Out for Blood\" 2019 — 10 — — — — — — — — Order in Decline \"Never There\" — — — — — — — — — — \"Landmines\" 2023 — 1 — — — — — — — 1 Heaven :x: Hell \"Rise Up\" — — — — — — — — — — \"Waiting on a Twist of Fate\" 2024 — — — — — — — — — — \"Dopamine\" — 6 — — — — — — — — \"—\" denotes a release that did not chart. \"×\" denotes periods where charts did not exist or were not archived. ===Promotional singles=== List of singles as lead artist, with selected peak chart positions Title Year Peak chart positions Album CAN BEL \"Belgian Singles Chart Search for Sum 41\" ultratop.be. Retrieved on April 18, 2011. \"Handle This\" 2002 — — All Killer No Filler \"No Reason\" 2005 — — Chuck \"March of the Dogs\" 2007 47 — Underclass Hero \"Blood in My Eyes\" 2012 — — Screaming Bloody Murder \"God Save Us All (Death to Pop)\" 2016 — — 13 Voices \"Goddamn I'm Dead Again\" 2017 — — \"A Death in the Family\" 2019 — — Order in Decline \"45 (A Matter of Time)\" — — \"Catching Fire\" 2021 — — \"—\" denotes a release that did not chart. ==Other appearances== * \"Rock You\" - a cover of Helix from the movie soundtrack FUBAR: The Album. * \"Things I Want\" - with Tenacious D for the KROQ compilation Swallow My Eggnog. * \"Unwritten Christmas\" - with Unwritten Law for the KROQ compilation Swallow My Eggnog. * \"Little Know It All\" - guest performance with Iggy Pop, later released as a single for the record Skull Ring. * \"Get Back\" (Sum 41 rock remix) - a collaboration with Ludacris for the iTunes versions of Chuck and The Red Light District albums. * \"Killer Queen\" - a cover of Queen recorded for the Killer Queen: A Tribute to Queen album. * \"Attitude\" - a Misfits cover which was released only on the band's Myspace in 2006, during the recording sessions for Underclass Hero. * \"Loser\" - a song by DJ Yodah and Mötley Crüe drummer Tommy Lee, featuring Lil Wayne, Sparkdawg, Big Sean, Joell Ortiz, J-Son, & Sum 41 under Geffen Records. * \"Look at Me\" (extended version) - was leaked on the Internet. * \"Moron\" - was recorded for Rock Against Bush Vol 1. A re-recorded version later appeared as a bonus track on the Japanese edition of Chuck. * \"Morning Glory\" - an Oasis acoustic cover which Deryck has performed by himself. * \"How You Remind Me\" - a cover of Nickelback which was perform on MTV's 2001 New Year's Anniversary. * \"Paint It Black\" - a cover of The Rolling Stones which was performed during almost all of the 2010 tour dates with guitarist Tom Thacker singing lead vocals. A studio version of this cover has been officially released on Heaven :x: Hell. * \"Rebel Yell\" - a cover of Billy Idol which was performed during the early 2011 shows. * \"American Girl\" - a cover of Tom Petty and the Heartbreakers which was performed during the early 2011 shows. * \"Master of Puppets\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"Enter Sandman\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"For Whom the Bell Tolls\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"Motorbreath\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"Battery\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"Blackened\" - a cover of Metallica which the band has performed during the MTV Icon of Metallica in 2003, and again through the 2009–2010 tour dates, randomly. * \"Stone Cold Crazy\" - a cover of Queen * \"We Will Rock You\" - a cover of Queen ==Videos== ===Video albums=== Year Album details Certifications (sales thresholds) 2001 Introduction to Destruction *Released: 2001 *Label: Aquarius, Island *MC: Gold\"CRIA Database Search for Sum 41\" Canadian Recording Industry Association. Retrieved on February 4, 2009. 2002 Cross the T's and Gouge Your I's *Released: November 26, 2002 *Label: Island 2003 Sake Bombs and Happy Endings *Released: May 17, 2003 *Label: Aquarius, Universal *MC: Gold 2005 Rocked: Sum 41 in Congo *Released: 2005 *Label: War Child 2008 DeeVeeDee *Released: March 2008 *Label: Island ===Music videos=== Year Song Director(s) 2000 \"Makes No Difference\" Bradley Walsh 2001 \"Fat Lip\" Marc Klasfeld \"Pain for Pleasure\" \"In Too Deep\" 2002 \"Motivation\" Super America and Joseph Kahn \"It's What We're All About\" Marc Klasfeld \"Still Waiting\" \"The Hell Song\" 2003 \"Over My Head (Better Off Dead)\" Chris Hafner \"Little Know It All\" (Iggy Pop featuring Sum 41) Mike Piscitelli 2004 \"We're All to Blame\" Marc Klasfeld \"Pieces\" Brett Simon and Steve Jocz 2005 \"Some Say\" Sean Michael Turrell 2007 \"Underclass Hero\" Steve Jocz and Marc Klasfeld \"Walking Disaster\" Stephen Penta 2008 \"With Me\" Steve Jocz 2011 \"Screaming Bloody Murder\" (unreleased) \"Baby, You Don't Wanna Know\" Marc Klasfeld 2012 \"Blood in My Eyes\" Michael Maxxis 2016 \"Fake My Own Death\" Marc Klasfeld \"War\" Djay Brawner \"God Save Us All (Death to Pop)\" Blake Higgins at Blakeprimes Digital 2017 \"Goddamn I'm Dead Again\" Marc Klasfeld 2019 \"Out for Blood\" Lee Levin \"A Death in the Family\" Dale Resteghini \"Never There\" John Asher \"45 (A Matter of Time)\" Lewis Cater 2021 \"Catching Fire\" John Asher 2023 \"Landmines\" \"Rise Up\" 2024 \"Waiting on a Twist of Fate\" Ravi Dhar \"Dopamine\" ==Notes== ==References== Discography Category:Discographies of Canadian artists",
 "title": "Sum 41 discography"
}