{
 "id": "152825",
 "text": "WrestleMania X-Seven was the seventeenth yearly WrestleMania professional wrestling pay-per-view made by the World Wrestling Federation (WWF). It happened on April 1, 2001 at the Reliant Astrodome in Houston, Texas. The event was the first WrestleMania held in the state of Texas. The amount of people who went to the event broke the record for total number of people attending at the Reliant Astrodome. The total number of people was counted at of 67,925. It resulted in total receipt of $3.5 million. The event is often cited as the end of The Attitude Era. The main event was a No Disqualification match between Steve Austin and The Rock for the WWF Championship. During the match, Austin turned heel after he told Vince McMahon, a man that he had called his nemesis, to give him a chair. Austin hit The Rock with sixteen chair shots, which lead to Austin pinning The Rock and becoming the new WWF Champion. The PPV ended with Austin and McMahon shaking hands and sharing beers. The main matches on the undercard featured Triple H vs. The Undertaker, the second TLC match for the WWF Tag Team Championship, and Vince McMahon versus Shane McMahon in a Street Fight. ==Matches== # Matches Stipulations Times Sunday Night Heat X-Factor (Justin Credible and X-Pac) (with Albert) defeated Steve Blackman and Grand Master Sexay Tag team match 2:46 1 Chris Jericho (c) defeated William Regal Singles match for the WWF Intercontinental Championship 7:08 2 Tazz and The Acolytes Protection Agency (Bradshaw and Faarooq) (with Jacqueline) defeated Right to Censor (The Goodfather, Val Venis and Bull Buchanan) (with Steven Richards) Six-man tag team match 3:52 3 Kane defeated Raven (c) and Big Show Triple threat hardcore match for the WWF Hardcore Championship 9:17 4 Eddie Guerrero (with Perry Saturn) defeated Test (c) Singles match for the WWF European Championship 8:30 5 Kurt Angle defeated Chris Benoit Singles match 14:04 6 Chyna defeated Ivory (c) Singles match for the WWF Women's Championship 2:39 7 Shane McMahon defeated Mr. McMahon (with Stephanie McMahon-Helmsley) Street Fight with Mick Foley serving as special guest referee 14:12 8 Edge and Christian defeated The Dudley Boyz (Bubba Ray and D-Von) (c) and The Hardy Boyz (Matt and Jeff) TLC match for the WWF Tag Team Championship 15:47 9 The Iron Sheik won by last eliminating Hillbilly Jim 19-man Gimmick battle royal 3:07 10 The Undertaker defeated Triple H Singles match 18:57 11 Stone Cold Steve Austin defeated The Rock No Disqualification match for the WWF Championship 28:07 (c) – refers to the champion(s) heading into the match ===Battle Royal=== Elimination Wrestler Eliminated by Time 1 Repo Man Hayes 2 Gobbledy Gooker Tugboat 3 Tugboat Earthquake 4 Earthquake Kamala 5 Kim Chee Kamala 6 Bushwhacker Luke Cornette 7 Jim Cornette Hillbilly 8 Duke Droese Doink 9 The Goon Butch 10 Nikolai Volkoff Slaughter 11 Bushwhacker Butch Doink 12 Doink the Clown Kamala 13 Michael Hayes Gang 14 One Man Gang Kamala 15 Kamala Slaughter 16 Brother Love Slaughter 17 Sgt. Slaughter Hillbilly 18 Hillbilly Jim Sheik Winner The Iron Sheik - ==References== ==Other websites== *Official WrestleMania X-Seven website Category:2001 in professional wrestling Category:Sports in Houston WrestleMania 17 Category:WWF Attitude Era Category:2001 in American television Category:2000s in Houston",
 "title": "WrestleMania X-Seven"
}