{
 "id": "152840",
 "text": "Kanata is a large suburban area in the western part of Ottawa, Ontario, Canada. It has a population around 99,000 and is growing very fast. It is just west of the Greenbelt. It is an important area for Hi-tech Businesses. It was an independent town from 1978 to 2000. ==History== Kanata was originally part of the Township of March. It was settled by Europeans in the early 19th Century. It was mainly agricultural (farms) until the 1960s when it became the site of a lot of construction. Modern Kanata is largely the creation of Bill Teron, a developer and urban planner who purchased over 3,000 acres (12 km2) of rural land and set about building a model community. It was planned to have a mix of offices, residential(Housing) area, and green area. Kanata was divided into a number of communities. Each was intended to have its own Business Center and unique culture. These include Beaverbrook, Glen Cairn, Bridlewood, Katimavik, Hazeldean, Morgan's Grant, and Kanata Lakes. Kanata grew rapidly. In 1978 the Province of Ontario made Kanata a city separate from the Township of March. Kanata remained a city intil 2001 when it was merged with the city of Ottawa, along with many other cities. The city became an important hi-tech centre. DEC was one of the pioneer technology companies in Kanata. The DEC campus has been successively Digital, Compaq, and is now HP. Kanata remains home to many of the major hi-tech employers of Ottawa, such as Mitel, March Networks, Alcatel-Lucent, Dell Canada, Hewlett-Packard, Smart Technologies, Norpak, Nortel, MDS Nordion, Breconridge, AMCC, and Cisco Systems, Inc.. The hi-tech industry is clustered along March Road, in the Kanata North Business Park and Kanata Research Park, and along Eagleson Road, in the Kanata South Business Park. ==Location== Kanata is in the Ottawa Valley. It is about 22 km southwest of Downtown Ottawa. It is along the Highway 417. The northern end of Kanata is west of the Ottawa River. To the east, Kanata is separated from the former City of Nepean by the National Capital Commission's Greenbelt (Ottawa). The community of Bells Corners borders the inner side of the Greenbelt. Bells Corners is, like Kanata, a hi- tech suburb that was established around 1950. To the west of Kanata is Stittsville, Ontario. Stittsville first a farming community, then a village, then part of the township of Goulbourn. Stittsville is now a large suburb which was merged into the new City of Ottawa in 2001, and is largely employed by the hi-tech industry. To the south of Kanata is the former village of Richmond, Ontario which pre-dated what is now the City of Ottawa. ==Notable Buildings== *Scotiabank Place, 1000 Palladium Drive. Home arena of the Ottawa Senators of the National Hockey League and many large concerts. It has also been known as The Palladium (1996), and The Corel Centre (1996-2005). For several years before the merger, the Corel Centre was not in the City of Ottawa, but rather in the City of Kanata, which was in the Regional Municipality of Ottawa-Carleton. *The Kanata Recreation Complex, 100 Walter Baker Place. It Has two skating rinks and a toboggan hill. *The Kanata Leisure Centre and Wave Pool, 70 Aird Place *The Brookstreet Resort, 525 Legget Drive *The Kanata Centrum power centre; together with adjacent developments, Ottawa's third largest shopping centre. *The Royal Canadian Legion's national headquarters, located near the Kanata Leisure Centre and the bridge over Hwy. 417 which links Castlefrank Road and Kanata Avenue. The Department of National Defence named the Valour Bridge on 1 December 2006, in an official naming ceremony to honour Canada's Armed Forces. *Ron Maslin Playhouse, 1 Ron Maslin Place. The 350-seat theatre was completed in 1996, and was funded by an all- volunteer theatre company which was founded in 1968 in the homes of original Kanata residents and enthusiasts of live theatre. *Bell Sensplex, 1565 Maple Grove Road. Houses four ice rinks, one olympic sized, an indoor soccer pitch, a licensed restaurant upstairs and the new location of iPlay, formerly on Iber road in Stittsville. *AMC Kanata 24 Theatres, the largest movie theatre in Ottawa. The movie theatre itself is located in the Kanata Centrum. ==Schools== Major schools in Kanata: Elementary schools *Bridlewood Community Elementary School *Castlefrank Elementary School *École Élémentaire Publique Kanata *Glen Cairn Public School *Jack Donohue Public School *John Young Elementary School *Katimavik Elementary School *Roch Carrier Elementary School *Roland Michener Public School *Stephen Leacock Public School *W. Erskine Johnston Public School *W.O. Mitchell Elementary School French Catholic Schools: *École Roger- Saint-Denis *École Elisabeth-Bruyère Catholic Schools *Georges Vanier Catholic School *Holy Redeemer Catholic School *Holy Spirit Catholic School *St Isidore Catholic School *St Martin de Porres Catholic School French Immersion Catholic Schools: École elementaire publique Kanata *St James Catholic School *St Anne Catholic School Secondary schools *Earl of March Secondary School *A.Y. Jackson Secondary School *Holy Trinity Catholic High School *All Saints Catholic High School Private Schools *March Montessori School Category:Cities in Ontario Category:Former cities in Canada Category:Neighborhoods Category:Ottawa",
 "title": "Kanata, Ontario"
}