{
 "id": "155164",
 "text": "Earlington is a city of Kentucky in the United States. As of the 2020 census, the city had a population of 1,257. ==History== Earlington was founded by European Americans in 1870 around the area coal fields. Upon its incorporation a year later, it was formally named for John Baylis Earle, a lawyer who was central to developing the coal industry in the region. ==Geography== Earlington is located at (37.274050, -87.511388). According to the United States Census Bureau, the city has a total area of , of which is land and (4.1%) is water. ==Demographics== As of the census of 2020, there were 1,257 people living in the city. The population density was 445.6 people per square mile (172.0/km²). There were 722 housing units, and 226 of them were empty. The racial makeup of the city was 71.3% White, 19.6% Black or African American, 2.5% from other races, and 6.5% from two or more races. Hispanic or Latino of any race were 4.1% of the population. There were 496 households out of which 35.7% had children under the age of 18 living with them, 39.3% were married couples living together, 8.9% were unmarried couples living together, 33.5% had a female householder with no husband or partner, and 18.3% had a male householder with no wife or partner. 28.4% of all households were made up of individuals and 14.7% had someone living alone who was 65 years of age or older. The average household size was 2.53. Of the people in Earlington, 25.5% were under the age of 18, 8.8% were from 18 to 24, 24.4% were from 25 to 44, 25.1% were from 45 to 64, and 16.1% were 65 years of age or older. The median age was 37.2 years. For every 100 females there were 93 males. The median income for a household in the city was $42,969, and the median income for a family was $43,958. The per capita income for the city was $21,799. About 26.1% of families and 25.8% of the population were below the poverty line, including 47.2% of those under age 18 and 3.1% of those age 65 or over. ==References== Category:Cities in Kentucky",
 "title": "Earlington, Kentucky"
}