{
 "id": "15554",
 "text": "Death metal is a style of heavy metal that is very fast, mean and brutal. It has very angry and low singing that sounds like Cookie Monster from the TV show Sesame Street. Most death metal has very fast guitar and drum beats. Almost every death metal drummer plays with two bass drums (or a type of pedal that has two beaters on one bass drum), so that they can play the bass drum beats faster. It is a kind of music focused on the beat and low sounds more than anything. The lyrics in death metal sometimes involve topics such as death, war and pain. Some bands choose to write about thinking or God. Some bands try to write about things that other death metal bands do not write about such as ancient history. Some death metal singers don't just sing low like Cookie Monster, others scream really loud too. Some death metal bands focus on making very pretty sounds with the guitars, and others focus on making music that is very hard to play. Some death metal artists and groups: * Abnormality * Alastis * Amon Amarth * Ann-Tennath * Anvil of Doom * Atheist * Cannibal Corpse * Cattle Decapitation * Death * Deicide * Dismember * Decrepit Birth * Despised Icon * Dying Fetus * Entombed * Flesh Crawl * Grave * Hellhammer * Hypocrisy * Job for a Cowboy * Kataklysm * Morbid Angel * Napalm Death * Nile Black * Nile * Necrophagist * Obituary * Sepultura * Shadows Fall * Sinister * Soul Embraced * Spawn of Possession * Suffocation * Through the Eyes of the Dead * Tiamat ==Other kinds of death metal== * Melodic death metal, sometimes called melodeath – is slower and features screams instead of growls. It also has much more melody and clean vocals can even sometimes be heard. * Technical death metal, or progressive death metal – is a much more complex type of death metal. These songs usually are longer and have unique song structures. These bands pretty much combine progressive rock and jazz with death metal. * Death-doom – combines the dark atmosphere and slow tempos with growling vocals and double-kick drumming. * Goregrind, deathgrind and pornogrind – mixes the intensity of Grindcore with the complexity of death metal. Guitar solos are usually rare, and vocalists usually scream instead of growl. Also, the songs are usually shorter. * Blackened death metal – is a style that combines death metal with black metal. ==References== ==Other websites== * Category:Heavy metal subgenres",
 "title": "Death metal"
}