{
 "id": "155572",
 "text": "Culpeper (formerly Culpeper Courthouse, earlier Fairfax) is the only incorporated town in Culpeper County, Virginia, United States. The population was 20,062 at the 2020 census. It is the county seat of Culpeper County. ==Geography== Culpeper is located at (38.471915, −77.999168). According to the United States Census Bureau, the town has a total area of 7.3 square miles (19.0 km²), of which 7.3 square miles (18.9 km²) is land and 0.04 square mile (0.1 km²) (0.57%) is water. ==History== After forming Culpeper County, Virginia, in 1748, the Virginia House of Burgesses voted to establish the Town of Fairfax on February 22, 1759. The name honored Thomas Fairfax, 6th Lord Fairfax of Cameron. He was the proprietor of the Northern Neck, a vast domain north of the Rappahannock River. His territory was then defined as stretching from Chesapeake Bay to what is now Hampshire County, West Virginia. The original plan of the town called for ten blocks, which form the core of Culpeper's downtown area today. The original town was surveyed by a young George Washington. In 1795, the town received a post office under the name \"Culpeper Court House\" Most maps of the time, however, continued to show the Fairfax name. The confusion resulting from the difference in official and postal names was finally resolved when the Virginia Assembly formally renamed the town Culpeper in 1869 (Acts, 1869–1870, chapter 118, page 154). During the American Revolutionary War, the Culpeper Minutemen, a pro-independence militia, formed in the town of Culpeper. They organized in what was then known as \"Clayton's Old Field,\" near today's Yowell Meadow Park. During the Civil War, Culpeper was a crossroads for a number of armies marching through central Virginia, with both Union and Confederate forces occupying the town by turn. In the heart of downtown, the childhood home of Confederate General A.P. Hill stands at the corner of Main and Davis streets. One block north on Main St. (present location of Piedmont Realty) was the frame house where \"The Gallant Major\" John Pelham died after being wounded at the Battle of Kelly's Ford. Culpeper began to grow dramatically in the 1980s, becoming a \"bedroom community\" of more densely populated Northern Virginia and Washington, D.C. suburbs. A growing number of residents of the town and county of Culpeper once lived and continue to work in those areas. In 2011, East Davis Street in downtown Culpeper was named as a 2011 \"America's Great Place\" by the American Planning Association. == 2011 earthquake == Downtown Culpeper was one of the communities most affected by the August 23, 2011 Virginia earthquake. Several buildings along Main Street and East Davis Street suffered severe damage, and some have been condemned. The earthquake led to the temporary evacuation of the Packard Campus for Audio-Visual Conservation. At the time it was hosting a town hall event for U.S. Senator Mark Warner. In 2014 the Museum of Culpeper History moved into the town's historic train depot.Museum of Culpeper History web site ==Demographics== As of the 2020 Census, the racial makeup of the town was 52.5% White, 17.6% Black, 1.2% Native American, 2.4% Asian, 0.04% Pacific Islander, 15.1% from some other race, and 11.2% from two or more races. Hispanic or Latino of any race were 24.9% of the population. The town's population included 28.8% under the age of 18, 8.8% from 18 to 24, 28.4% from 25 to 44, 21.6% from 45 to 64, and 12.4% who were 65 years of age or older. The median age was 34 years. The gender makeup was 48.2% male and 51.8% female. As of 2022, the median yearly income for a household was about $86,940, and the median income for a family was about $91,841. The per capita income was about $36,432. About 2.5% of families and 10.5% of all people in Culpeper lived below the poverty line. This includes 13.3% of children under 18 years old and 6.4% of people over 65 years old. ==Climate== == References == Category:Towns in Virginia Category:County seats in Virginia Category:1750s establishments in Virginia",
 "title": "Culpeper, Virginia"
}