{
 "id": "155668",
 "text": "The black-legged dart frog, two-toned poison frog, black-legged poison frog, or two-toned arrow poison frog (Phyllobates bicolor), also known as the bicolored dart frog or Neari in Choco, is the second most toxic of the wild poison dart frogs. It lives in Colombia and Peru. ==Body== The adult male frog is about 32.1-39.5 mm long from nose to rear end and the adult female frog is about 35.7-42.7 mm long. The skin of the frog's back and sides and of the tops of the back legs are gold or orange in color. The tops of the front legs are black in color, sometimes with yellow or blue spots. The belly can be all black or black with orange, gold, or blue-green color. The eardrum is part black and part yellow-orange. The iris of the eye is red-brown in color. ==Young== The male frog calls to the female frogs from far away. When the female comes to him, he calls a different call. Then he leads her to a good place to lay eggs. She lays the eggs on the dead leaves on the ground. The male frog takes care of the eggs after the female lays them. He makes sure they do not become too dry. The eggs hatch into tadpoles after 14 days. Then the male frog carries the tadpoles to pools of water in streams. Young frogs are dark brown or black in color with two yellow stripes. ==Home== This frog is awake during the day. It lives in the dead leaves on the ground near streams. It lives in forests that are not too high up in the mountains. People have seen this frog between 400 and 1500 meters above sea level. ==Poison== Human beings who live where the frog lives, the Chocó Indians, have used the frog to poison arrows. The human can touch the arrow to the frog's back without killing it. Or the human can kill and heat the frog's body. The poison in the frog's skin is a chemical called batrachotoxin. The frog gets the poison from the ants and other insects that it eats. So frogs kept as pets do not have poison. Frogs that hatch and grow with humans do not make poison. Scientists say this is because the frog needs to eat ants, mites, or beetles to make the poison. Wild frogs that people catch still make poison even if they live with humans for a long time ==Threats== There are fewer of these frogs than there were. Scientisis think this could be because human beings change the places where the frog lives. Humans turn the forests into forms and take the trees for lumber. Human beings also catch these frogs to sell as pets. Fish that human beings brought to Colombia also kill and eat this frog. Scientists think the fungus Batrachochytrium dendrobatidis could kill this frog. Batrachochytrium dendrobatidis causes the fungal disease chitridiomycosis. Scientists do not think it is a problem now. At least one of the places this frog lives is a protected park: Tatamá National Park. ==References== Category:Poison dart frogs Category:Frogs of South America",
 "title": "Black-legged dart frog"
}