{
 "id": "155802",
 "text": "Elgin () is a city in Illinois in the United States. It is roughly northwest of Chicago on the Fox River. Most of Elgin lies within Kane County, Illinois, with a portion in Cook County, Illinois. As of the 2020 census, the city had a total population of 114,797. It is the sixth-largest city in Illinois. It is part of the Chicago metropolitan area. ==People from Elgin== ===Authors and academics=== * E.C. \"Mike\" Alft, historian, author, and former mayor of Elgin. * Nina Burleigh, journalist and best-selling author. * Paul Flory, chemist, Nobel Prize winner (1974). * Lloyd Hall, chemist. * Douglas J. Mink, astronomer, co-discover of the rings around the planet Uranus. * John Platt, computer scientist. * Tom Shales, journalist, Pulitzer Prize winner (1988). * Carleton Washburne, educator, author of the Winnetka Plan. ===Business and invention=== * Max Adler, vice-president of Sears & Roebuck, benefactor of Adler Planetarium. * Lawrence B. Hamlin, violator of the Pure Food and Drug Act on claiming that his family's patent medicine could cure cancer. * Lysander Hamlin, co-originator with John Austen Hamlin of Hamlin's Wizard Oil, father of Lawrence B. Hamlin. * Jimmy John Liautaud, founder of Jimmy John's, benefactor of UIC's Liautaud Graduate School of Business. * Earl \"Madman\" Muntz, marketer, car stereo and 4-track cartridge pioneer. * James Roche, former chairman of General Motors. ===Media and arts=== * Dan Andriano, musician. * Joe Becker, musician. * Bruce Boxleitner, actor. * BarlowGirl, Christian rock band. **Alyssa Barlow **Becca Barlow **Lauren Barlow * Chelsea Brummet, actress. * Josh Caterer, songwriter, musician, lead singer of indie rock band Smoking Popes. * Chuck Harder, radio talk show host. * John Austen Hamlin, magician, brother of Lysander Hamlin. * Matt Hoffman, Big brother 12. * Charles Ingalls, father of Laura Ingalls Wilder (Little House on the Prairie) spent part of his childhood in the nearby Campton Township. * Laurence Kaptain, international performer/recording artist, and Dean, College of Music and Dramatic Arts, Louisiana State University. * William LeBaron, playwright, movie producer. * David Otunga, Harvard educated lawyer, reality show contestant on VH1's I Love New York 2, fiance of singer/actress Jennifer Hudson. * Jane Peterson, painter and artist. * John Qualen, actor. *David Strackany, folk singer-songwriter aka Paleo, born in Elgin ===Military=== * Harry Chamberlin, Brigadier General, equestrian, Olympic gold medalist (1932). ===Politics=== * Ray Barnhart, Texas Republican politician * Peter Fitzgerald, United States Senator (R-IL). ===Sports=== * Charlene Barnett (1928-1979), All-American Girls Professional Baseball League player and member of three champion teams. * Brian Oldfield (born 1945), Olympic shot putter. * Flynn Robinson (born 1941), basketball player for the Cincinnati Royals, Chicago Bulls, Milwaukee Bucks, Los Angeles Lakers, and the Baltimore Bullets. ==References== Category:Cities in Illinois Category:Settlements in Cook County, Illinois",
 "title": "Elgin, Illinois"
}