{
 "id": "155915",
 "text": "Naperville is a city in Illinois in the United States. It is ranked the 4th biggest in Illinois. It was founded by Joseph Naper who founded it along with the DuPage River in 1831. Before any settlement, Naperville was home to Native American tribes. In 1641, the first Caucasian contact with Native Americans in Illinois. They were kicked out by the Potawami tribe that kicked out the Ilinewek tribe whom they had made contact with Native Americans. Naper arrived with his friends and family to what would be known as Napers Settlement. He was known for many things in Naperville as it was incorporated as a community in 1857. The county is named after the river, DuPage County. These churches were built by the early families of Naperville such as the Hobsons, Napers, and Scotts as they built seven churches. Naperville became an important stop from Chicago and Ottawa. By 1832, there were 180 residents living in Naperville whom they had built sawmills, stores, the Pre-Emption Hotel, and gristmills. Du-Page County was established in 1839 and Naperville became the county seat. Eight businesses in Naperville contributed to the building of the Southwest Plank Road. This was completed in 1851 and connected Chicago, Naperville, and Oswego. Naperville grew and grew for the next century as stone quarries flushed providing building materials for Chicago after the horrible fire of 1871. The Stenger Brewery shipped beer across the region. The Kroehler Manufacturing Company became Naperville’s largest employer which shipped furniture by rail into Chicago and many dominant markets. Naperville became a city in 1890 with a population of 2,629 from the 1900 census. It grew to 12,933 residents by 1960. Between 1890 and 1920, residents began to receive basic city services like water, sewers, electricity, and landlines. The suburban boom began in the western suburbs after the second world war, Naperville remained out of the range of growth until 1954, when plans for a transportation system began as it was announced as the East-West toll road. The route slirted the northern edge of Naperville and included an interchange which linked the city to downtown Chicago via the completed Eisenhower Expressway. As a result, residential, industrial, and retail services boomed in Naperville. The city expanded to 50 square miles in 1993, with a population of 128,358 in 2000. Among the area, only Aurora and Chicago were larger in size. Many new buisnesses attracted to the Naperville area were based in development and research. During the late 50s and 60s, Argonne National Laboratory, Northern Illinois Gas, AT&T; Bell Laboratories, etc were established in Naperville Harold Moser led the residential boom with his first subdivision in 1956. By 1965, Moser had subdivided 8,000 building lots and built 3500 homes in the Naperville area. According to the 2010 census, Naperville has an area of 39.323 square miles of which 38.77 square miles is land and 0.553 square miles is water. Portions of Naperville drain to the West of the Dupage River. As of the 2020 census, the population of Naperville would be 149,540 making it the fourth populous city in the state of Illinois with the largest employer being Edward Hospital with 4500 employees. Naperville is home to Moser Tower and Millennium Carillion, is one of the fourth largest in the world. It is home to extensive parks and forest preservation networks like Centennial Beach. Naperville has two school districts, 203 and 204. Naperville has had two major floods, one in 1996 and the other in 2013. ==References== Category:Cities in Illinois Category:Suburbs of Chicago Category:Settlements in DuPage County, Illinois",
 "title": "Naperville, Illinois"
}