{
 "id": "155997",
 "text": "Warsaw is a city in Hancock County, Illinois, United States. The population was 1,510 at the 2020 census. People know the city for its historic downtown and the Warsaw Brewery. ==History== The city of Warsaw began in 1814. Future president Zachary Taylor founded Fort Johnson on the eastern bank of the Mississippi River across from the mouth of the Des Moines River. Fort Johnson was occupied only for a few weeks before it was burned. In 1815 another military camp, Fort Edwards, was built nearby at a different location.\"Fort Edwards\", North American Forts, accessed 28 Dec 2010 Warsaw became an important fur trading post and one of the earliest European-American settlements in western Illinois. During the 1840s, Warsaw was one of the centers of opposition to the Mormons at Nauvoo. Thomas C. Sharp, who edited the Warsaw Signal at this time lead the anti-Mormons.Leonard, Glen M., Nauvoo: A Place of Peace, A People of Promise (Salt Lake City and Provo: Deseret Book and Brigham Young University Press, 2002), p. 107 The Mormons tried to set up a settlement at Warren, a site just south of Warsaw. In 1841 Willard Richards moved to Warsaw to oversee the settlement of Warren, but due to the public response to writings by Sharp and other problems, the Mormon settlement was abandoned in 1842.Leonard. Nauvoo. p. 186 In October 1844, a great gathering was announced in Warsaw. Although it claimed to be a \"wolf hunt,\" people knew that the \"wolves\" to be hunted were the Mormons. When Governor Thomas Ford heard about it, he sent militia troops to disperse the gathering. Most Mormons left the area for Utah in 1846. The city has a well-preserved downtown with a number of remaining historic businesses. Founded by German immigrants, the Warsaw Brewery opened in 1861 and operated for more than 100 years, ending production in 1971. The facility was renovated and reopened in 2006 as a bar and restaurant.Warsaw Brewery , accessed 2/16/08 ==Notable residents== * John Milton Hay, an American statesman, diplomat, author, journalist, and private secretary and assistant to Abraham Lincoln, was raised in Warsaw. He served as United States Secretary of State from 1898 to 1905 under presidents William McKinley and Theodore Roosevelt. * Illinois politician Benjamin F. Marsh represented the area and is buried in Warsaw. ==References== Category:Cities in Illinois",
 "title": "Warsaw, Illinois"
}