{
 "id": "156195",
 "text": "Avoca is a city in Pottawattamie County, Iowa, United States. In 2020, 1,683 people lived there. ==History== Avoca was created in 1869 when the Chicago, Rock Island and Pacific Railroad built a railroad near the area. It is named after Avoca in Ireland. It quickly became a regional service center for the nearby farms.Pottawatamie Count Historical Society article on Avoca ==Geography== Avoca is at (41.4790, -95.3373). The city is between the West Nishnabotna River and its East Branch. The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== In 2020, there were 1,683 people living in Avoca. These people made up 704 households. 92.0% of the people were White, 0.7% African American, 0.7% Native American, 0.8% Asian, 1.3% from other races, and 4.5% from two or more races. Hispanic or Latino of any race were 3.7% of the people. The median age in the city was 42.1 years old. 49.3% of the people were male, and 50.7% of the people were female. == Education == The community is served by the AHSTW Community School District.\"AHSTW .\" Iowa Department of Education. Retrieved on July 15, 2018. It used to be in the Hancock-Avoca Community School District until July 1, 1996. This was when the district merged into the A-H-S-T Community School District. In turn, that merged into AHSTW on July 1, 2016.\"REORGANIZATION & DISSOLUTION ACTIONS SINCE 1965-66 .\" Iowa Department of Education. Retrieved on July 20, 2018. ==Famous People== * Richard Beymer (born 1938), the actor best known as Tony, the lead role in West Side Story * Johnny Carson, the television comedian, lived in Avoca as a child until his family moved to Norfolk, Nebraska in 1936. * Edwin T. Meredith (1876–1928), Secretary of Agriculture under president Woodrow Wilson * Richard C. Turner (1927-1986), Iowa lawyer and politician, was born in Avoca.'U.S. Attorney Turner dies of heart attack,' Des Moines Register, Bob Shaw, September 29, 1986, pg. 1. 11A ==References== ==Other websites== * City of Avoca, Iowa * The Pottawattamie County Genealogical Society * Roadside America- Avoca Spider Bug * Farmall- Land Tractor Museum * City Data Comprehensive Statistical Data and more about Avoca Category:Cities in Iowa Category:19th-century establishments in Iowa Category:1869 establishments in the United States",
 "title": "Avoca, Iowa"
}