{
 "id": "15624",
 "text": "Copenhagen is the capital city of Denmark. It is also the largest city in Denmark. In 2014, 1,246,611 people lived in the urban area. Copenhagen is on the island of Zealand and the smaller island named Amager. Founded as a Viking fishing village. Copenhagen was built in the 12th century A.D. and got City rights in 1254. A few years later, it was destroyed nearly completely. In 1443, Copenhagen became the capital of Denmark. In 1801, there were more than 100,000 inhabitants in Copenhagen for the first time. In the 1960s, more than 700,000 people lived in Copenhagen Municipality, and today there are 528,000 inhabitants in the municipality. Near the city centre there is the famous Freetown Christiania. ==Districts== Copenhagen is divided into 10 districts. The districts are: *Indre By *Christianshavn *Vesterbro *Nørrebro *Østerbro *Frederiksberg *Amagerbro *Hellerup *Kastrup *Bispebjerg ==Famous people== * Søren Kierkegaard (d. 1855), philosopher * Niels Bohr (d. 1962), physicist *Ejnar Hertzsprung (d. 1967), chemist, astronomer * Victor Borge (d. 2000), entertainer *Carl-Henning Pedersen (d. 2007), painter * Jørn Utzon (d. 2008), architect *Klaus Rifbjerg (d. 2015), writer *Anker Jørgensen (d. 2016), prime minister * Kim Larsen (d. 2018), singer, guitarist, songwriter * Michael Laudrup, coach, footballer * Peter Schmeichel, footballer * Lars von Trier, movie director * Lars Ulrich, musician ==References== == Other websites == * Copenhagen Portal - Tourist & Visitors Guide to Copenhagen * Insider Travel Tips and Tourist Guides to Copenhagen * VisitCopenhagen.dk - Wonderful Copenhagen * Copenhagen for Partiers - Tourist Guide * WorldFlicks in Copenhagen: Photos and interesting places on Google Maps * Official website of the city of Copenhaguen (Danish, English) * Depiction of the City 1588 in Civitates orbis terrarum * Guide to information about Denmark, Sweden, Copenhagen, Malmö, and the Øresund region * Guide to popular attractions including Tivoli Gardens, Nyhavn, and Amalienborg Palace Category:11th-century establishments in Europe",
 "title": "Copenhagen"
}