{
 "id": "156405",
 "text": "Eldon is a city in Wapello County, Iowa, United States. The population when the 2020 census was taken was 783. It is the place of the small Carpenter Gothic house that came to be known as the American Gothic House. Artist Grant Wood used this home for the background in his famous 1930 painting American Gothic.American Gothic House Center | Home Eldon today is a regional tourist spot with tourists coming to see the American Gothic House, the Historic Rock Island Railway depot, and the Historic McHaffey Opera House. == History == Eldon got its start in the year 1870, after construction of the Keokuk and Des Moines Railway through the territory. It was incorporated in 1872. Roseanne Barr and Tom Arnold, who was born in nearby Ottumwa, operated Roseanne and Tom's Big Food Diner in Eldon from 1993 to 1995.\"Restaurants, Bars & Nightclubs\" . TV Acres. Retrieved December 30, 2012. Eldon is also the home of the Wapello County Fair which started in 1868. == Geography == Eldon is in the southeast corner of Wapello County eleven miles southeast of Ottumwa on the northeast bank of the Des Moines River across the river from the Soap Creek. Iowa Highway 16 goes through the community. The Eldon Water Management Area is across the river in adjacent Davis County two miles to the southwest along Soap Creek.Iowa Atlas & Gazetteer, DeLorme, 7th ed., 2021, pp. 59-60 According to the United States Census Bureau, the city has an area of , of which is land and is water. == Education == The Cardinal Community School District serves Eldon, which has its campus located 2.5 miles north of the town in rural Wapello County. Eldon is consolidated with the towns of Agency, Batavia, and the unincorporated communities of Selma and Bladensburg within the Cardinal Community School District. Cardinal Schools' mascot is the \"Comet\". The Cardinal athletic teams participate in the South Central Conference. == Demographics == === 2010 census === At the 2010 census 927 people, 406 households, and 260 families were living in the city. About 835.1 inhabitants lived there per square mile (322.4/km2). The 448 houses had a density of . The racial makeup of the city was 98.4% White, 0.1% African American, 0.2% Native American, 0.3% from other races, and 1.0% from two or more races. Hispanic or Latino of any race were 1.1%. Of 406 households, 31.8% had children under the age of 18 living with them, 49.5% were married couples living together, 11.3% had a female householder with no husband present, 3.2% had a male householder with no wife present, and 36.0% were non-families. 32.3% of households were made up of individuals, and 15% were one person aged 65 or older. The median household size was 2.28, and the average family size was 2.84. The median age was 42.3 years old. 24.1% of residents were under the age of 18; 7.3% were between the ages of 18 and 24; 22.8% were from 25 to 44; 26.4% were from 45 to 64; and 19.4% were 65 or older. The gender makeup of the city was 48.7% male and 51.3% female. === 2000 census === At the 2000 census 998 people, 438 households, and 275 families lived in the city. The population density was . The 470 houses had an average density of . The racial makeup of the city was 98.20% White, 0.40% from other races, and 1.40% from two or more races. Hispanic or Latino of any race were 1.50%. Of the 438 households 29.2% had children under the age of 18 living with them, 51.1% were married couples living together, 8.0% had a female householder with no husband present, and 37.0% were non-families. 31.7% of households were one person and 18.0% were one person aged 65 or older. The average household size was 2.28 and the average family size was 2.91. The age distribution was 25.3% under the age of 18, 6.0% from 18 to 24, 27.4% from 25 to 44, 24.2% from 45 to 64, and 17.1% 65 or older. The median age was 39 years. For every 100 females, there were 91.2 males. For every 100 females age 18 and over, there were 92.3 males. The median household income was $26,950 and the median family income was $37,250. Males had a median income of $29,261 versus $20,573 for females. The per capita income for the city was $14,495. About 11.4% of families and 15.5% of the population were below the poverty line, including 21.0% of those under age 18 and 15.9% of those age 65 or over. == National Register of Historic Places == In addition to the American Gothic House, the following properties are listed on the National Register of Historic Places: * Big 4 Fair Art Hall * Eldon Public Library * McHaffey Opera House == References == == Other websites == * American Gothic House Center site Has links to area attractions * City Data Comprehensive Statistical Data and more about Eldon * Cardinal Community School District Category:Cities in Iowa",
 "title": "Eldon, Iowa"
}