{
 "id": "15643",
 "text": "The Republic of Zambia is a country in southern Africa. It shares its borders with the Democratic Republic of the Congo to the north, Tanzania to the north- east, Malawi to the east, Mozambique, Zimbabwe, Botswana, and Namibia to the south, and Angola to the west. It used to be called Northern Rhodesia and it is currently named after the Zambezi River. Zambia is home to one of the seven natural wonders of the world, Victoria falls. Zambia has at least 72 spoken languages. The capital of Zambia is Lusaka, which is also the largest city in the country. Hakainde Hichilema is the current president. Its motto is One Zambia, One Nation and its national anthem is Stand and Sing of Zambia, Proud and Free. Its official language is English. == History == Zambia originated from Northern Rhodesia. In 1964 Zambia became an independent country. The first president was Kenneth Kaunda, who ruled Zambia for 27 years. Zambia was a one party state. His United National Independence Party was the only legal party and all other parties were banned. After protests, democratic elections were held in 1991. Kenneth Kaunda lost the elections and gave away his power in an orderly manner to his successor Frederick Chiluba, a former union leader. Zambia is now a multi-party democracy. It has had four democratic elections since 1991. The latest presidential election was in 2021, which was won by Hakainde Hichilema against Edgar Lungu. == Economy == In 1969, Zambia was making a lot of money because of the copper deposits that were mined in Copperbelt province. When copper became cheaper in the 1970s, the economy got worse because people in Zambia were not making as much money from selling copper. Today, Zambia is a poor country. It does not have many industries. Copper is still its main export. Commercial farming in Zambia is starting to make more money. == Provinces == Zambia is divided into ten provinces. Each province is divided into several districts. There are 117 districts all together. The provinces are: * Central * Copperbelt * Eastern * Luapula * Lusaka * Muchinga * Northern * North-Western * Southern * Western ===Cities=== The important places in Zambia are: Cities in Zambia Rank City Population Province Image Census 1980 Census 1990 Census 2000 Est. 2007 1\\. Lusaka 735,830 1,069,353 1,684,703 2,146,522 Lusaka 2\\. Ndola 297,490 367,228 397,757 467,529 Copperbelt 3\\. Kitwe 283,962 288,602 363,734 409,865 Copperbelt 4\\. Kabwe 127,422 154,318 176,758 193,100 Central 5\\. Chingola 130,872 142,383 147,448 148,469 Copperbelt 6\\. Mufulira 138,824 123,936 122,336 119,291 Copperbelt 7\\. Livingstone 61,296 76,875 97,488 113,849 Southern 8\\. Luanshya 113,422 118,143 115,579 112,029 Copperbelt 9\\. Kasama 36,269 47,653 74,243 98,613 Northern 10\\. Chipata 33,627 52,213 73,110 91,416 Eastern ==Related pages== * List of rivers of Zambia * Zambia at the Olympics * Zambia national football team ==References== Notes Category:Least developed countries Category:1964 establishments in Africa Category:Commonwealth member states Category:English-speaking countries",
 "title": "Zambia"
}