{
 "id": "156443",
 "text": "Fonda is a city in Pocahontas County, Iowa, United States. The population was 636 at the time of the 2020 census. == History == The city of Fonda was originally called Marvin. Marvin, however, was too similar to Manson, Iowa and since kept mail being mixed up, town officials changed the name to Fonda in 1874. The nearest municipality sharing the name, \"Fonda\", is Fonda, New York. == Geography == Fonda is located at (42.582819, -94.845810). The United States Census Bureau states that the city has a total area of , all land. The town is placed at the western edge of the Des Moines Lobe, the more recently glaciated section of Iowa. The Des Moines Lobe is part of the prairie pothole region of the Midwest. The topography is not normal in its softly rolling terrain. Wetlands, glacial erratics, bands of ridges, and large flat areas characterize the land surrounding Fonda. In its natural state, the land is poorly drained, although humans have added an extensive network of tiles to move water from the potholes to local tributaries. The tiles surrounding Fonda empty into Big Cedar Creek, a tributary of the Raccoon River. This waterway, which underwent channelization in the early 1900s, flows past the town on its west end. Evidence of its winding original path still exists, particularly in the Fonda Golf Course and in the schoolyard behind Our Lady of Good Counsel Catholic Church. Four miles (6 km) northwest of town, Sunken Grove Wildlife Management Area (WMA) exists as a reminder of the past. Large undrained wetlands are surrounded by forests and prairies. The area is home to large populations of migrating birds and permanent populations of wildlife. This public parcel has recently expanded and is adjacent to the Leo Shimon WMA. Together, the two areas comprise of land, a total of slightly less than two square miles. The remainder of the area surrounding Fonda is agricultural. Vast corn and soybean fields are interspersed by acreages and hog confinements (also known as a concentrated animal feeding operation). The vitality of the town and of the region have been influenced by the shift from a sustenance way of farming to an industrial model. Fewer farmers, less diversity in agricultural products, more agrochemicals, and more tillage have upset the economic system of the town and surrounding countryside. Fonda's AgPartners elevator is partially owned by Cargill. Many of the hog confinements around town are owned by corporations, such as New Fashion Pork, based in Jackson, Minnesota. Pocahontas County has seen a large decrease in the number of farms. In 1969, there were 1,369 farms. By 1997 the number had dropped to 778. The average farm size has increased from 265 to 459 acres (107 to 186 hectares) in that same time period. In 1969, 844 farms sold 176,705 hogs. In 1997, 162 farms sold 248,666 hogs. In 1982, 14 poultry farms housed 69,911 layers. By 1997, no farms and no layers existed. In 1982, there were of pastures and acreages in the county. By 1997, that amount had decreased to . Des Moines, which lies south and east of Fonda, receives a large portion of its drinking water from the Raccoon River (and thus Big Cedar Creek). From 1978 to 2004, contamination at its water intake plant due to nitrates (an agrichemical) has increased from 4.5 mg/L to 7.7 mg/L. Nitrate consumption is linked to blue baby syndrome. == Demographics == Fonda has seen a steady decrease in its population in recent decades. In 1980, the town had 863 residents, and in 1990 there were 731. === 2010 census === As of the census of 2010, there were 631 people, 259 households, and 157 families residing in the city. The population density was . There were 329 housing units at an average density of . The racial makeup of the city was 94.3% White, 0.5% African American, 0.3% Asian, 0.5% Pacific Islander, 2.5% from other races, and 1.9% from two or more races. Hispanic or Latino of any race were 8.7% of the population. There were 259 households, of which 29.0% had children under the age of 18 living with them, 49.0% were married couples living together, 5.4% had a female householder with no husband present, 6.2% had a male householder with no wife present, and 39.4% were non- families. 35.5% of all households were made up of individuals, and 18.9% had someone living alone who was 65 years of age or older. The average household size was 2.29 and the average family size was 2.97. The median age in the city was 46.1 years. 23.8% of residents were under the age of 18; 8.2% were between the ages of 18 and 24; 16.7% were from 25 to 44; 30.5% were from 45 to 64; and 20.9% were 65 years of age or older. The gender makeup of the city was 49.3% male and 50.7% female. === 2000 census === As of the census of 2000, there were 648 people, 288 households, and 160 families residing in the city. The population density was . There were 339 housing units at an average density of . The racial makeup of the city was 98.61% White, 0.31% African American, and 1.08% from two or more races. Hispanic or Latino of any race were 1.70% of the population. There were 288 households, out of which 23.6% had children under the age of 18 living with them, 44.4% were married couples living together, 7.3% had a female householder with no husband present, and 44.1% were non- families. 41.3% of all households were made up of individuals, and 26.4% had someone living alone who was 65 years of age or older. The average household size was 2.13 and the average family size was 2.89. Age spread: 22.8% under the age of 18, 4.5% from 18 to 24, 22.5% from 25 to 44, 17.7% from 45 to 64, and 32.4% who were 65 years of age or older. The median age was 45 years. For every 100 females, there were 91.2 males. For every 100 females age 18 and over, there were 90.1 males. The median income for a household in the city was $26,731, and the median income for a family was $37,500. Males had a median income of $26,597 versus $16,667 for females. The per capita income for the city was $15,626. About 7.1% of families and 11.1% of the population were below the poverty line, including 18.8% of those under age 18 and 10.7% of those age 65 or over. == Education == Fonda is served by the Newell-Fonda Community School District,\"Newell-Fonda .\" Iowa Department of Education. Retrieved on July 25, 2018. which operates Newell-Fonda High School in Newell. It was in the Fonda School District until July 1, 1993, when it consolidated into Newell-Fonda.\"REORGANIZATION & DISSOLUTION ACTIONS SINCE 1965-66 .\" Iowa Department of Education. Retrieved on July 20, 2018. == Notable people == * Henry A. Kelly (born 1934), distinguished research professor of English at UCLA * Jim Kelly (1893-1972), basketball head coach at DePaul University, track-and-field coach for University of Minnesota and 1956 U.S. Olympic team * Ruth Stafford Peale (1906–2008) writer, co-founder of Guideposts with husband Norman Vincent Peale * Nathan Post (1881–1938) 8th and 10th Governor of American Samoa == References == == Other websites == * Newell Fonda Schools * City of Fonda * * * City-Data Comprehensive Statistical Data and more about Fonda Category:Cities in Iowa",
 "title": "Fonda, Iowa"
}