{
 "id": "156427",
 "text": "Exira is a city in Audubon County, Iowa, United States, along the East Nishnabotna River and U.S. Route 71. The population was 787 at the time of the 2020 census. == History == The oldest town in Audubon County, Exira was founded in 1857. The town was named for Exira Eckman, daughter of Judge John Eckman from Ohio, who agreed to purchase a lot of property in the town if the town was named for his daughter. The main industries in and around Exira are agriculture and agribusiness. Exira has a school, completed in 1959. There are four churches in the town. On July 2, 1958, Exira was destroyed by the flooding of the East Nishnabotna River. Nineteen persons in the area died, 75 homes were destroyed and almost 20 businesses in the western part of Exira were damaged. Exira is well known for its Fourth of July parties, which have been celebrated since 1861. The morning parade and the evening fireworks draw thousands of visitors to the town. Other attractions in the area include the Plow in the Oak Park, south of Exira on Highway 71, and Littlefield Recreation Area, southeast of Exira, which features a lake, prairie restoration area and a live bison pair. == Geography == Exira is located at (41.591617, -94.878247). The United States Census Bureau states that the city has a total area of , all land. == Demographics == ===2020 census=== As of the census of 2020, there were 787 people, 358 households, and 188 families living in the city. The population density was 763.1 people per square mile (294.6/km2). There were 392 housing units at an average density of 380.1 per square mile (146.7/km2). The racial makeup of the city was 96.3% White, 0.1% Black or African American, 0.4% Native American, 0.1% Asian, 0.0% Pacific Islander, 0.0% from other races and 3.0% from two or more races. Hispanic or Latino people were 0.8% of the population. Of the 358 households, 22.1% of which had children under the age of 18 living with them, 41.9% had a married couple, 5.6% had an unmarried couple, 32.7% had a female householder without a partner and 19.8% had a male householder without a partner. 43.3% of all households were one person living alone, and, 24.6% had someone living alone who was 65 years old or older. The median age in the city was 49.3 years. 20.3% of the residents were under the age of 20; 4.4% were between the ages of 20 and 24; 20.7% were from 25 and 44; 24.0% were from 45 and 64; and 30.5% were 65 years of age or older. The gender makeup of the city was 46.4% male and 53.6% female. === 2010 census === At the time of the 2010 census there were 840 people, 381 households, and 217 families living in the city. The population density was . There were 422 housing units at an average density of . The racial makeup of the city was 98.6% White, 0.2% African American, 0.1% Native American, 0.4% Asian, and 0.7% from two or more races. Hispanic or Latino of any race were 1.4% of the population. There were 381 households, of which 21.0% had children under the age of 18 living with them, 42.8% were married couples living together, 10.0% had a female householder with no husband present, 4.2% had a male householder with no wife present, and 43.0% were non- families. 38.1% of all households were made up of individuals, and 20.2% had someone living alone who was 65 years of age or older. The average household size was 2.06 and the average family size was 2.63. The median age in the city was 49.7 years. 16.4% of residents were under the age of 18; 7.1% were between the ages of 18 and 24; 19.4% were from 25 to 44; 27.8% were from 45 to 64; and 29.3% were 65 years of age or older. The gender makeup of the city was 43.1% male and 56.9% female. === 2000 census === As of the census of 2000, there were 810 people, 362 households, and 211 families living in the city. The population density was . There were 394 housing units at an average density of . The racial makeup of the city was 98.64% White, 0.25% African American, 0.12% Native American, 0.49% Asian, and 0.49% from two or more races. Hispanic or Latino of any race were 0.86% of the population. There were 362 households, out of which 24.3% had children under the age of 18 living with them, 44.2% were married couples living together, 10.2% had a female householder with no husband present, and 41.7% were non-families. 38.1% of all households were made up of individuals, and 27.6% had someone living alone who was 65 years of age or older. The average household size was 2.08 and the average family size was 2.74. In the city, the population was spread out, with 21.9% under the age of 18, 4.6% from 18 to 24, 19.0% from 25 to 44, 20.9% from 45 to 64, and 33.7% who were 65 years of age or older. The median age was 49 years. For every 100 females, there were 73.1 males. For every 100 females age 18 and over, there were 69.7 males. The median income for a household in the city was $26,319, and the median income for a family was $32,222. Males had a median income of $25,917 versus $17,656 for females. The per capita income for the city was $15,124. About 9.9% of families and 11.7% of the population were below the poverty line, including 19.0% of those under age 18 and 13.0% of those age 65 or over. == Education == It is served by the Exira–Elk Horn–Kimballton Community School District.\"Exira-Elk Horn-Kimballton .\" Iowa Department of Education. Retrieved on June 21, 2018. It was in the Exira Community School District until it consolidated into Exira-EHK on July 1, 2014.\"REORGANIZATION & DISSOLUTION ACTIONS SINCE 1965-66 .\" Iowa Department of Education. Retrieved on July 20, 2018. == Notable people == * Ben F. Jensen (1892–1970) U.S. Representative for the former Iowa's 7th congressional district * Jack Pardee (1936–2013) NFL player and Head Coach The Thomas B. Thielen Student Health Center at Iowa State University is named after former Exira resident, Thomas B. Thielen. Thielen served as vice president for student affairs at Iowa State University from 1977 to 1997. The housing complex, Frederiksen Court, at Iowa State University is named for former Exira resident, Charles \"Chuck\" Frederiksen. His family moved to Exira, when he was three, where he attended and graduated from high school as valedictorian of his class. For nearly 50 years, Chuck had a distinguished career in the college and university housing profession. He became the Director of Residence in 1967 and retired in 1996. During his tenure at Iowa State, Chuck oversaw the construction, staffing and occupancy of many student housing and dining service facilities, including five residence halls and single and married family apartment complexes. Chuck received two significant recognitions during and following his retirement from ISU. The first was the establishment of the Frederiksen Leadership Award for student leaders living in university housing. The second recognition was the naming of a new housing complex, Frederiksen Court, in April 2002. Frederiksen Court currently houses more than 3,500 single undergraduate students in 29 buildings. == References == == Other websites == * Exira Community Schools * City-Data Comprehensive Statistical Data and more about Exira Category:Cities in Iowa",
 "title": "Exira, Iowa"
}