{
 "id": "15678",
 "text": "Nazi Germany (officially known as the German Third Reich from 1933 to 1943, later known as the Greater German Reich from 1943 to 1945), is the period when Adolf Hitler (the Nazi leader) and the Nazi Party controlled Germany. It is also sometimes called the Third Reich (), which means the 'Third Empire' or 'Third Realm'. The first German empire was the Holy Roman Empire which lasted from the year 800 or 962 until it collapsed in 1806 in the Napoleonic Wars. The second was the German Empire of 1871 to 1918 which collapsed in 1918 when Kaiser Wilhelm II was forced to abdicate the throne when the Weimar Republic was formed in 1918. The Nazis said they were making the third, even if itself never was the monarchy at all. However, the term 'Third Reich' was more popular in other countries. In Germany it was merely The Reich (pronounced 'rike') or the Greater German Reich (). Adolf Hitler led Nazi Germany until it was defeated in World War II in the Battle of Berlin, when he killed himself in 1945. The Nazi Party was destroyed in the same year. Its leaders ran away, were arrested, or killed themselves. Some were executed for war crimes by the Allied powers. Other leaders survived, and some of them got important jobs. However, their racial policies never again held power in Germany. The Nazi government was formed under the idea that the \"Aryan race\" (pure white Germans) deserved to rule over all other races. This idea gained respect after the Great Depression made many important Germans poor and powerless. Hitler blamed the problems on Jews, communists, liberals, and many others. He made many Germans feel like they were innocent victims who had to take charge over Europe. The Nazis also tried to make an empire with colonies, and used their ally Italy's colonies in Africa as a model. When the Nazi government was destroyed at the end of World War II, Germany was split into four \"occupation zones\" which later became East Germany and West Germany. ==History== The Nazis came to power in 1933 and made their power absolute with an \"Enabling Act of 1933\" and an unfair referendum. They centralized Germany, replacing local self-government. They strengthened the economy by doing business with the Soviet Union and foreign companies like General Motors and IBM. They put the Schutzstaffel in control of the local police, and started the Gestapo to find, jail, and kill political enemies. They immediately banned Jews from important jobs, and soon restricted them in other ways. After a few years they expanded the Wehrmacht and built the armed forces far beyond the limits of the Treaty of Versailles. They also cooperated and made agreements with Italy and Japan. ===World War II: 1939-1945=== On September 1st, 1939, German forces attacked Poland, which began World War II. With over a million troops, Hitler's army easily took over Poland, losing about 59,000 soldiers. Their country was also attacked by the Soviet Union from the east.Beevor, Antony 2012. The Second World War, p22 & 27/8. New York: Little, Brown. ISBN 978-0-316-02374-0 Poland lost over 900,000 soldiers. On October 12, 1939, Hitler sent a letter to the United Kingdom promising peace. The British continued the war. Hitler conquered France in the Battle of France. Then he sent the Luftwaffe to attack England. Winston Churchill, now Prime Minister of the United Kingdom, did not surrender. The Battle of Britain lasted from July to October 1940. When it failed, Hitler ordered the mass bombardment of London. That also failed, and Hitler decided to face east for his racial war of destroying the Slavs and Jews. This gave Britain time to regain power. In 1941, Hitler ordered \"Operation Barbarossa.\" It lasted from June 22, 1941 until December 5, 1941. Joseph Stalin, the leader of the Soviet Union, had weakened his army with his Great Purges, which had killed many Russian officers before the war. During Operation Barbarossa, many more Soviet soldiers died than Germans. At Stalingrad, however, about a million soldiers died on each side. While the Soviet Union could replace its losses, Germany could not. After Stalingrad, the Germans lost their momentum. The Soviets learned from the long campaigns, fought better, and gained many new weapons from very efficient factories. The United States, Britain, France, and the Soviet Union fought together, and pushed against the smaller German army. In May 1945, they took over Berlin to win the war. Many people from all sides of the war died fighting in Europe, including: * Around one million German soldiers. * About one million French, British, and American soldiers. While fighting in the Eastern Front: * About 5 million German soldiers, and soldiers from other fascist countries died. * About 7 million Soviet soldiers died fighting against them. * About 2 million Soviet soldiers died in Nazi concentration camps and prisoner of war camps from starvation, disease, freezing to death, and executions. ==See also== * Ustaše * Fascism * Germany * Genocide * Iași pogrom * Ante Pavelić * Antisemitism * Antiziganism * Ion Antonescu * The Holocaust * Kingdom of Romania * Odessa massacre (1941) * Jedwabne pogrom (1941) * Independent State of Croatia * Government of Nazi Germany * List of Nazi concentration camps * The Protocols of the Elders of Zion ==References== ==Notes== Category:Racism Category:Fascism Category:World War II Category:Antisemitism Category:1940s in Germany Category:20th century in Europe Category:1930s establishments in Germany Category:1945 disestablishments in Germany Category:States and territories established in the 20th century Category:States and territories disestablished in the 20th century",
 "title": "Nazi Germany"
}