{
 "id": "156866",
 "text": "Kenny Miller (born 23 December 1979) is a Scottish former football player. He was a centre forward. He is one of only five players to ever play for both Rangers and Celtic, and one of only two to ever cross the divide twice. ==Club career== ===Hibernian=== Kenny started his career at Hibernian, and made his debut in the 1997/98 season. He was loaned to Stenhousemuir where he scored 10 goals in 11 games. He spent four years at the club, and was the Scottish Premier League top scorer in season 1999/00 and received the Scottish Young Player of the Year award in 2000. ===Rangers=== Kenny signed for Rangers for £2 million in June 2000. He made his debut in a 4-1 win against FBK Kaunas on 26 July during a Champions League match. His first goal came on 5 August 2000 during an SPL match away to Kilmarnock, scoring the third in a 4-2 win. Three months later, Miller netted five goals (a Scottish Premier League record) during a 7-1 home defeat of St. Mirren. More goals against Monaco and Aberdeen meant he had ten goals from just fourteen games. However, until the end of the season, Miller only scored once more, against Brechin City in the Scottish Cup. In September 2001, he went to Wolverhampton Wanderers (Wolves) on a three-month loan, scoring two goals in his first two games. However, during his third match, Miller broke his shoulder in a fall. During the next two months, Wolves and Rangers had talks over his future. Wolves finally bought him on a permanent deal at a cost of £3 million. Miller had made a total of 38 appearances and scored 11 goals for Rangers. ===Wolverhampton Wanderers=== In 2002/03 Miller was playing most games for Wolves, but he had only managed six goals in 19 games. However, during the final six months of the season he scored 18 goals in his final 24 appearances. He equalled a club record of scoring in six consecutive games. That helped Wolves gain promotion into the English Premier League. In the summer of the 2005/06 season, the newly promoted Premiership team Sunderland wanted to sign Miller, but Wolves rejected their £1m and £1.2m offers and Miller began the new season as a Wolves player. Miller scored 12 goals, and ended the season as top scorer - the third time in Wolves last three seasons. Miller played more than 190 games for Wolves and scored more than 60 goals during his five years with the club. ===Celtic=== When Miller's contract finished at the end of that season, he transferred to Celtic for free under special rules, called the Bosman ruling. He signed an agreement in January after refusing to sign a new deal at Wolves a month earlier. Miller became only the third player since the war to have played for both sides of the Old Firm - following Alfie Conn and Maurice Johnston. Despite being praised by many for his overall performances, Miller failed to score in his first nine games for Celtic. He finally scored his first goal, against Old Firm rivals and former employers Rangers at Celtic Park in September 2006. He then went on to score in Celtic's 1–0 Champions League win against Copenhagen from the penalty spot and scored two in the 3–0 win over Benfica. By scoring in the 2006/07 Champions League season, Miller became the first player to score goals in the Champions League for both Rangers and Celtic. However, he ended the season with only four league goals. He did play in the 2007 Scottish Cup final, before being substituted because of an injury. Despite hints from the player himself that he would leave to get more first-team opportunities, Miller vowed to stay at the club and fight for his place at the club. Miller scored his first goal in his first appearance of the 2007/08 season in a 4–1 victory over Falkirk and added to his collection the following week by scoring against Aberdeen. He scored 11 goals in total for the club in 46 appearances. ===Derby County=== Miller signed a three year deal with newly promoted English Premier League club Derby County on 31 August 2007 for an undisclosed fee, thought to be around £3 million, but later confirmed by Derby County manager Paul Jewell to be closer to £2.25m. Miller started well at his new club, scoring in his first two home matches, including the winner on his league debut for the Rams against Newcastle United in a 1–0 win on 17 September 2007, a strike which won the club's Goal Of The Season award. However, following this initial success Miller netted just twice in his next 28 league fixtures. With Derby looking like they would be relegated Miller said he would like to move just over 6 months after joining the club - with a return to Rangers his preferred destination, though his manager Jewell insisted any move would have to be financially fair for Derby. ===Return to Rangers=== A fee of £2m was agreed between Rangers and Derby allowing Miller to move back to Ibrox. The deal was completed on 13 June. Miller's return to Ibrox means he is one of only a few players to cross the Old Firm divide twice.\"Miller to follow in 100-year-old footsteps\" DailyRecord.co.uk (28 May 2008) Miller made his second debut for the club on 30 July 2008 in a UEFA Champions League qualifier gainst FBK Kaunas.\"Rangers 0-0 FBK Kaunas\" BBC Sport website (30 July 2008) He scored in the first Old Firm game of the season on 31 August 2008.\"Celtic 2-4 Rangers\" BBC Sport website (31 August 2008) He followed this up with a further two goals against former employers Hibernian at Easter Road on 28 September 2008, then adding his sixth goal back in a Rangers shirt at Rugby Park in a 4-0 win over Kilmarnock. ==International career== Since making his Scotland national team debut in 2001, Miller has remained a player in the Scotland team under the management of Berti Vogts, Walter Smith and Alex McLeish. He has scored goals in crucial games against several teams, including Germany and Ukraine. In 2005, Miller scored in three consecutive internationals, with goals against Austria, Italy and Norway. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup League cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Hibernian 1997–98 Scottish Premier Division 7 0 0 0 0 0 — — 7 0 1998–99 Scottish First Division 7 1 0 0 1 0 — — 8 1 1999–2000 Scottish Premier League 31 11 5 1 2 1 — — 38 13 Total 45 12 5 1 3 1 0 0 0 0 53 14 Stenhousemuir (loan) 1998–99 Scottish Third Division 11 8 2 2 0 0 — — 13 10 Rangers 2000–01 Scottish Premier League 27 8 3 1 1 1 4Appearances in the UEFA Champions League and UEFA Cup. 1 — 35 11 2001–02 Scottish Premier League 3 0 0 0 0 0 0 0 — 3 0 Total 30 8 3 1 1 1 4 1 0 0 38 11 Wolverhampton Wanderers 2001–02 First Division 22 2 1 0 0 0 — 2 0 25 2 2002–03 First Division 43 19 4 3 2 1 — 3 1 52 24 2003–04 Premier League 25 2 3 2 2 1 — — 30 5 2004–05 Championship 44 19 2 0 1 1 — — 47 20 2005–06 Championship 35 10 2 0 2 2 — — 39 12 Total 169 52 12 5 7 5 0 0 5 1 193 63 Celtic 2006–07 Scottish Premier League 31 4 4 1 1 0 8Appearances in the UEFA Champions League. 3 — 44 8 2007–08 Scottish Premier League 2 3 0 0 0 0 0 0 — 2 3 Total 33 7 4 1 1 0 8 3 0 0 46 11 Derby County 2007–08 Premier League 30 4 3 2 0 0 — — 33 6 Rangers 2008–09 Scottish Premier League 30 10 5 3 1 0 2 0 — 38 13 2009–10 Scottish Premier League 33 18 6 2 1 1 5 0 — 45 21 2010–11 Scottish Premier League 18 21 0 0 1 0 6 1 — 25 22 Total 81 49 11 5 3 1 13 1 0 0 108 56 Bursaspor 2010–11 Süper Lig 15 5 0 0 — 0 0 0 0 15 5 Cardiff City 2011–12 Championship 43 10 0 0 5 1 — 2 0 50 11 Vancouver Whitecaps FC 2012 MLS 13 2 0 0 — — 1 0 14 2 2013 MLS 21 8 1 0 — — — 22 8 2014 MLS 9 3 0 0 — — 0 0 10 3 Total 43 13 1 0 0 0 0 0 1 0 45 13 Rangers 2014–15 Scottish Championship 27 7 3 0 2 0 — 10 2 42 9 2015–16 Scottish Championship 32 14 6 2 2 1 — 3 4 43 21 2016–17 Scottish Premiership 37 11 4 3 6 0 — — 47 14 2017–18 Scottish Premiership 18 3 2 0 1 1 2 1 — 23 5 Total 114 35 15 5 11 2 2 1 13 6 155 49 Livingston 2018–19 Scottish Premiership 2 0 0 0 5 1 — — 7 1 Dundee 2018–19 Scottish Premiership 33 8 2 0 0 0 — — 35 8 Partick Thistle 2019–20 Scottish Championship 21 5 2 0 6 3 — 3 2 32 10 Career total 670 216 60 22 42 15 27 6 24 9 823 268 === International === Appearances and goals by national team and year National team Year Apps Goals Scotland 2001 1 0 2002 — 2003 7 2 2004 9 0 2005 8 4 2006 4 3 2007 6 1 2008 5 1 2009 6 0 2010 5 1 2011 7 4 2012 7 1 2013 4 1 Total 69 18 :Scores and results list Scotland's goal tally first, score column indicates score after each Miller goal. List of international goals scored by Kenny Miller No. Date Venue Opponent Score Result Competition 1 29 March 2003 Hampden Park, Glasgow, Scotland 1–0 2–1 Euro 2004 qualification 2 7 June 2003 1–1 1–1 3 17 August 2005 Arnold Schwarzenegger Stadion, Graz, Austria 1–0 2–2 Friendly 4 3 September 2005 Hampden Park, Glasgow, Scotland 1–0 1–1 2006 World Cup qualification 5 7 September 2005 Ullevaal Stadion, Oslo, Norway 1–0 2–1 6 2–0 7 1 March 2006 Hampden Park, Glasgow, Scotland 1–2 1–3 Friendly 8 2 September 2006 Celtic Park, Glasgow, Scotland 4–0 6–0 Euro 2008 qualification 9 6 September 2006 Darius and Girėnas Stadium, Kaunas, Lithuania 2–0 2–1 10 13 October 2007 Hampden Park, Glasgow, Scotland 1–0 3–1 11 26 March 2008 1–1 1–1 Friendly 12 7 September 2010 1–1 2–1 Euro 2012 qualification 13 9 February 2011 Aviva Stadium, Dublin, Ireland 1–0 3–0 2011 Nations Cup 14 25 May 2011 2–1 3–1 15 3 September 2011 Hampden Park, Glasgow, Scotland 1–0 2–2 Euro 2012 qualification 16 11 November 2011 Antonis Papadopoulos Stadium, Larnaca, Cyprus 1–0 2–1 Friendly 17 11 September 2012 Hampden Park, Glasgow, Scotland 1–1 1–1 2014 World Cup Qualification 18 14 August 2013 Wembley Stadium, London, England 2–1 2–3 Friendly === Manager === Team From To Record Livingston 30 June 2018 19 August 2018 Falkirk (caretaker) 14 April 2022 4 May 2022 Total — == Honours == Wolverhampton Wanderers * Football League First Division play-offs: 2003 Celtic * Scottish Premier League: 2006–07 * Scottish Cup: 2006–07 Rangers * Scottish Premier League: 2008–09, 2009–10, 2010–11Miller left Rangers on 21 January 2011, but he made enough league appearances in 2010–11 to qualify for a winners' medal. * Scottish Championship: 2015–16 (second tier) * Scottish Cup: 2008–09 * Scottish League Cup: 2009–10 * Scottish Challenge Cup: 2015–16 Cardiff City * Football League Cup runner-up: 2011–12 Individual * SPFA Young Player of the Year: 1999–2000 * Scottish FA International Roll of Honour: 2010 * Scottish Premier League Player of the Month: April 2010, August 2010, September 2010 *Scottish Championship Player of the Month: January 2016 * Scottish Premier League Golden Boot: 2010–11 *Rangers FC Supporters' Player of the Year: 2016–17Player of the Year: Kenny Miller, Rangers FC, 24 April 2017 *Rangers FC Players' Player of the Year: 2016–17 *Rangers FC Goal of the Season: 2016–17 ==Notes== ==References== Category:1979 births Category:Living people Category:Cardiff City F.C. players Category:Derby County F.C. players Category:Footballers from Edinburgh Category:Premier League players Category:Scottish football managers Category:Vancouver Whitecaps FC players Category:Wolverhampton Wanderers F.C. players",
 "title": "Kenny Miller"
}