{
 "id": "157798",
 "text": "Ademir Marques de Menezes (8 November 1922 – 11 May 1996) was a Brazilian football player. He played for Brazil national team. Regarded as one of the best strikers in the world. A fast and powerful striker, with a strong shot in both feet, Ademir began his career as a left winger before moving to the centre, causing havoc in opposing defences with his skill and sublime finishing. People at the time considered him an unequalled ball juggler who knew every trick in the book. He used to wreak havoc among defences with his quick changes in tempo, fooling his opponents with deceptions carried out almost at lightning speed, his mastering of the ball in all situations and the ability to accelerate rapidly. His prominent underbite earned him the nickname \"Queixada\", which means \"jaw\". ==Club career== He came to football at the age of 14 in 1937. He first played at the youth level in the Pernambuco state championship for the Sport Recife team, where his father Antonio Rodriguez, a retired colonel, was on the board of directors. With the team in 1939, 1940 and 1941 Ademir became the champion of the competition. Among other players, the young mulatto stood out with excellent starting speed and \"jet\" breakthroughs with the ball, which the Brazilians called the English word \"rush\". Together with the Pernambuco team, in 1942 Ademir went on tour in Brazil. During the trip, the team met in matches with the strongest clubs in the country. And to the surprise of the organizers of friendly matches, in 16 games the national team won 10 victories. The match with Vasco da Gama turned out to be the most enchanting. At the beginning of the game, the Pernambuco team lost 0-3, but thanks to four goals Ademir was able to win with a score of 5-4. After the match, the owners of the defeated club could not be surprised by the skill of the striker and the same 1942 Ademir moved to \"Vasco da Gama\". He then became the first Brazilian footballer to receive money for a new team. He played for Vasco for three years, during which time he added another state title to his title, but now not to Pernambuco, but to Rio. The team won this title at the peak of its popularity in 1945. Vasco did not lose a single match in that championship. In 1946, Ademir moved to another club from Rio de Janeiro, Flamengo, for two years. And together with him he became the champion of the state of Rio. At that time, the striker was a real leader of his team, which beat thanks to his goals of both its main competitors - and \"Vasco da Gama\" and \"Botafogo\". And in 1948, Ademir returned to Vasco da Gama and played here until 1956, the end of his professional football career (next year he will play several matches in his first team - Sport Recife) - but only in the role of the amateur). As part of the team, he became the South American club champion in 1948, won the Rio State Championship three more times, and in 1949 and 1950 became the top scorer in the state championship. He had 30 and 25 goals, respectively. ==International career== Ademir has played for the national team for the first time in 1945. On January 21, he first appeared in a match against Colombia. He started playing as a left forward, and later the coach began to use him as a central striker. In 1949, together with the national team, Ademir became the champion of South America. He was considered such a dangerous player in those days that rival teams were forced to use a separate central defender to neutralize him. The striker gained his greatest fame at the 1950 World Cup, becoming the tournament's top scorer. However, he could thank his fellow defenders, who gave great passes. The attacker had only to lock them. But over the goal in the game with the Spaniards Ademir really \"sweated\". In the fight with defender Parra, he gained control of the ball and suddenly hit the goal. Goalkeeper Ramallets tried to save his team, but could not even touch the leather ball. Despite the victories, in the main, final match, the Brazilians lost to Uruguay 2-1. The defeat was a great grief for the succession of the whole country. But the celebration of Ademir's golden boot still became a spoonful of honey in a barrel of tar. The player was noted for his ability to use his moments, and his compatriot Didi compared Ademir to the Frenchman Just Fontaine. Didi said of both strikers that \"they are the ones who score nine of the ten goal moments.\" Ademir's greatest popularity in Brazil came in the late 1940s and early 1950s. It was so large that Brazilians named their newborns after him. The son of Brazilian defender Domingos da Guia also grew up with this name. In 1974, Ademir da Guia participated in the World Cup. It is known that during the 1950 World Cup, a man ran to the coach of the Brazilian national team, Flavio Costa, and began to ask him to release Ademir from the Casadas-Pedras camp for a few hours. The man explained that his son urgently needed surgery. And he does not want to agree to it until he sees Ademir. Flavio Costa made an exception and released his striker from the Brazilian camp to meet a stubborn little fan. Obviously, the meeting played a positive role and the operation was quite successful. Ademir was also preparing to participate in the 1954 World Cup. But an injury prevented him from playing. After that, the player decided to finish playing for the national team. His last match was against Uruguay on March 15, 1953. ==End of career and post-football life== In 1957, Ademir returned to the amateur club \"Sport Recife\", where he began his career. He played a few games here, but due to poor form he was forced to stop playing altogether. Until 1967, Ademir tried his hand at coaching, working at the Vasco da Gama club, but later began working in journalism. The former footballer contributed to the newspapers of Rio de Janeiro, and also worked as a football commentator for Radio Maua. Ademir died on May 11, 1996 at the age of 73. == International career statistics == |- |1945||9||7 |- |1946||6||1 |- |1947||2||0 |- |1948||0||0 |- |1949||5||7 |- |1950||9||14 |- |1951||0||0 |- |1952||5||2 |- |1953||3||1 |- !Total||39||32 |} ==Honours== ===Club=== ;Sport Recife *Campeonato Pernambucano: 1941, 1942 ;Vasco da Gama *Campeonato Carioca: 1945, 1949, 1950, 1952, 1956 *South American Championship of Champions: 1948 ;Fluminense *Campeonato Carioca: 1947 ===International=== ;Brazil *South American Championship: 1949 *Panamerican Championship: 1952 *FIFA World Cup Runner-up: 1950 *South American Championship Runner-up: 1945, 1946, 1953 *Copa Rio Branco: 1947, 1950 *Copa Rio Branco Runner-up: 1946, 1948 *Roca Cup: 1945 *Taça Oswaldo Cruz: 1950 ===Individual=== *Copa América Best Player: 1949 *FIFA World Cup Golden Boot: 1950 *FIFA World Cup All-Star Team: 1950 *IFFHS Brazilian Player of the 20th Century (18th place)IFFHS' Century Elections *IFFHS South American Player of the 20th Century (44th place) *Brazilian Football Museum Hall of Fame *France Football's World Cup Top-100 1930–1990: 28th place *68th Greatest Player of the 20th Century by Placar Magazine: 1999 *100 Greatest Players of the 20th Century by World Soccer Magazine: 1999 *1000 Greatest Sportsmen of the 20th Century by The Sunday Times *95th Greatest Player in the History of World Cups by Placar Magazine: 2006 *Vasco's Dream Team by Placar Magazine: 2006 *1950 FIFA World Cup (8 goals) *1941 Pernambuco Championship (11 goals) *1949 Carioca Championship (31 goals) *1950 Carioca Championship (25 goals) *1951 Rio-São Paulo Tournament (9 goals) == References == Category:1922 births Category:1996 deaths Category:1950 FIFA World Cup players Category:Footballers from Recife",
 "title": "Ademir de Menezes"
}