{
 "id": "15772",
 "text": "A pseudonym (soo-do-nim) or alias is a fake name which a person uses instead of their real name. Pseudonyms can include stage names, screen names, ring names, pen names, nicknames, aliases, superhero identities and code names. Many people use pseudonyms, including authors (pen names) and performers (stage names). Some use pseudonyms to hide their identity, gender, and/or race. Performers (like rappers) sometimes use pseudonyms to match their stage personalities better. Pseudonym comes from the Greek word (pseudṓnymon), which means \"false name\". ==Types of pseudonyms== === Pen names === Pen names are pseudonyms used by authors, usually to hide identity. Many famous books have been written by authors using pseudonyms. For example, Daniel Handler wrote A Series of Unfortunate Events under the pseudonym Lemony Snicket for two reasons. He wanted to make the author a character in the story, and he wanted to hide his real name. When she published The Outsiders, Susan Eloise Hinton used the initials S. E. because she did not want readers to guess her gender. The Brontë sisters (Anne, Emily and Charlotte) used pseudonyms to hide the fact that they based many of their characters on their neighbors. Other famous pen names include: * Dr. Seuss for children's author Theodor Seuss Geisel * George Orwell for Eric Arthur Blair, who wrote Nineteen Eighty-Four and Animal Farm * Mark Twain for American author Samuel Langhorne Clemens, who wrote Adventures of Huckleberry Finn * Lewis Carroll for British writer Charles Lutwidge Dodgson, who wrote Alice's Adventures in Wonderland * Voltaire for French Enlightenment writer and philosopher François-Marie Arouet === Stage names === Many musicians, actors and performers use stage names. These can hide the performer's identity; give them a more interesting name; make them stand out more; and/or create a unique artistic image. The rules of SAG-AFTRA, a major American performer's union, say: \"no member [may use] a professional name which is the same as, or resembles so closely as to tend to be confused with, the name of any other member.\" For this reason, a performer might need to adopt an \"alternate professional name\" before they can join SAG-AFTRA. Famous stage names include: * Banksy, an anonymous street artist * Bono for Paul Hewson, lead singer of U2 * Diddy for rapper Sean Combs (formerly called P Diddy and Puff Daddy) * Jamie Foxx for American actor and comedian Eric Marlon Bishop * Mata Hari for Dutch exotic dancer and spy Margaretha MacLeod === Usernames === Many people on the Internet use pseudonyms. There are many names for these pseudonyms, including usernames, user IDs and handles. These pseudonyms help people stay anonymous on the internet, and they also protect people from identity theft and phishing. When people log into an account on sites like Wikipedia, Reddit, or Facebook, their username helps identify them without entering their real name. If people used their real name instead of a username, it would create confusion for two people with the same name. Usernames make this simple, because people create their own usernames. Also, if someone used their real name, it would make it easier for people to guess their passwords and for other people to find them in real life. === Criminal pseudonyms === Sometimes criminals choose pseudonyms to hide their real names. In other cases, criminals take on nicknames given to them by others. Famous criminal pseudonyms include: * Billy the Kid for Henry McCarty, an American Old West outlaw * Butch Cassidy for Robert Parker, an American Old West outlaw * Lucky Luciano for Italian-American mobster Salvatore Lucania * Machine Gun Kelly for American gangster George Barnes * Soapy Smith for American gangster Jefferson Smith * Son of Sam for American serial killer Dave Berkowitz === Political pseudonyms === Political pseudonyms throughout history have included: * Caligula for Roman Emperor Gajus Julius Caesar Augustus Germanicus * Ho Chi Minh for Vietnamese communist leader Nguyễn Sinh Cung * Kim Il-Sung for former North Korean dictator Song-ju Kim * Leon Trotsky for Russian Marxist revolutionary Lev Bronstein * Papa Doc for former Haitian dictator François Duvalier * Pol Pot for Cambodian genocide leader Saloth Sar === Sports pseudonyms === Some sports players use nicknames or pseudonyms rather than their birth names. Famous examples include: * Pele for Brazilian footballer Edson Arantes do Nascimento * Rocky Marciano for American boxer Rocco Marchegiano * The Say Hey Kid for Willie Mays * Tiger Woods for American golfer Eldrick Woods ==Related pages== * Pen name * Stage name * Synonym * Nickname ==References==",
 "title": "Pseudonym"
}