{
 "id": "157774",
 "text": "is a former Japanese football player and manager. He played for the Japanese national team. He also managed the Japanese national team. ==Biography== Okada was born in Osaka on August 25, 1956. After graduating from Waseda University, he joined Japan Soccer League club Furukawa Electric in 1980. In 1982, the club won 1982 JSL Cup. In 1985/86 season, the club won Japan Soccer League and JSL Cup, and he was selected Best Eleven. The club also won 1986 Asian Club Championship. This is the first Asian champions as Japanese club. He retired in 1990. He played 189 games and scored 9 goals in the league. On June 9, 1980, Okada debuted for the Japan national team against Hong Kong. In 1982, he selected Japan for 1982 Asian Games. At Asian Games, he played 2 games and scored a goal against South Korea. He also played at 1980 Summer Olympics qualification and 1986 World Cup qualification. He played 24 games and scored 1 goal for Japan until 1985. After retirement, Okada started coaching career at Furukawa Electric (later JEF United Ichihara) in 1990. In 1995, he became an assistant coach for Japan national team. During 1998 World Cup qualification in October 1997, Japan's manager Shu Kamo was sacked and Okada named new manager. In November, Okada led Japan to won qualify for 1998 World Cup first time in Japan's history. At 1998 World Cup, Japan lost all 3 matches and he resigned after the World Cup. In 1999, Okada signed with J2 League club Consadole Sapporo. In 2000, he led the club to won J2 League and promoted the club to J1 League. He resigned end of 2001 season. In 2003, he signed with Yokohama F. Marinos. The club won the league champions and he was also selected \"Best Manager awards\" for 2 years in a row in 2003 and 2004. From 2005, the club performance was sluggish and he resigned in August 2006. In November 2007, Japan national team manager Ivica Osim was suffered a cerebral infarction. In December, Okada was named a new manager for Japan. In 2008, he selected new young player, Atsuto Uchida, Shinji Kagawa, Yuto Nagatomo, Keisuke Honda, Shinji Okazaki and so on. In 2009, Japan won to qualify for 2010 World Cup. Okada gained worldwide attention for leading Japan to ninth- place finish in the 2010 World Cup. He resigned after 2010 World Cup. In November 2010, he was selected \"AFC Coach of the Year awards\". In December 2011, Okada signed a contract from 2012 season with Chinese Super League side Hangzhou Greentown. He extended his contract for two years in the end of 2012 season. However, he resigned from Hangzhou end of 2013 season. In November 2014, he bought a majority stake in FC Imabari and became a chairman of the club. In March 2016, he became a vice-president of Japan Football Association and served until March 2018. In 2019, he was selected Japan Football Hall of Fame. ==Statistics== |- |1980||rowspan=\"10\"|Furukawa Electric||rowspan=\"10\"|JSL Division 1||14||0 |- |1981||17||0 |- |1982||18||0 |- |1983||15||1 |- |1984||17||0 |- |1985/86||22||4 |- |1986/87||21||1 |- |1987/88||22||1 |- |1988/89||21||1 |- |1989/90||22||1 189||9 189||9 |} Japan National Football Team Database |- |1980||3||0 |- |1981||5||0 |- |1982||2||1 |- |1983||7||0 |- |1984||4||0 |- |1985||3||0 |- !Total||24||1 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association Category:1956 births Category:Living people Category:Footballers from Osaka Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan Soccer League players Category:JEF United Chiba players Category:Japan national football team managers",
 "title": "Takeshi Okada"
}