{
 "id": "157773",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Kimura was born in Hiroshima on July 19, 1958. After graduating from Meiji University, he joined Nissan Motors (later Yokohama Marinos) in 1981. From 1982, he wore the number 10 shirt. He was selected \"Japanese Footballer of the Year\" awards in 1983 and 1984. The club also won 1983 and 1985 Emperor's Cup. From 1988 to 1990, the club won all three major title in Japan; Japan Soccer League, JSL Cup and Emperor's Cup for 2 years in a row. He was also selected \"Japanese Footballer of the Year\" awards again 1989. In 1990s, the club won 1990 JSL Cup, 1991 and 1992 Emperor's Cup. In Asia, the club won 1991–92 and 1992–93 Asian Cup Winners' Cup. He was a central player in golden era in club history. He retired in 1994. He played 251 games and scored 51 goals in the league. He was selected \"Japanese Footballer of the Year awards\" 3 times and Best Eleven 5 times. On May 31, 1979, when Kimura was a Meiji University student, he debuted for the Japan national team against Indonesia. He played at 1980 Summer Olympics qualification and 1982 World Cup qualification. From 1982, he played in all matches of Japan national team included 1982, 1986 Asian Games, 1984 Summer Olympics qualification and 1986 World Cup qualification. In 1985, he scored goals in six consecutive games. This is a record of continuous score in Japan national team. He played 54 games and scored 26 goals for Japan until 1986. Kimura became a manager for Yokohama F. Marinos in 2010. In 2011, although the club compete for the champions till half way, the club stalled in the late stages and finished at the 5th place. He was sacked end of 2011 season. In 2020, Kimura was selected Japan Football Hall of Fame. ==Statistics== |- |1981||rowspan=\"11\"|Nissan Motors||JSL Division 2||18||6||2||0||2||2||22||8 |- |1982||rowspan=\"10\"|JSL Division 1||18||0||2||2||0||0||20||2 |- |1983||18||5||5||2||4||6||27||13 |- |1984||17||8||4||2||0||0||21||10 |- |1985/86||21||6||4||3||4||3||29||12 |- |1986/87||20||2||4||1||5||1||29||4 |- |1987/88||14||1||3||1||1||0||18||2 |- |1988/89||22||8||5||1||5||4||32||13 |- |1989/90||22||8||5||0||4||1||31||5 |- |1990/91||10||3||4||2||4||2||18||7 |- |1991/92||22||3||5||1||3||1||30||5 |- |1992||rowspan=\"3\"|Yokohama Marinos||rowspan=\"3\"|J1 League||colspan=\"2\"|-||5||3||9||0||14||3 |- |1993||21||1||1||0||2||0||24||1 |- |1994||10||0||4||1||3||0||17||1 251||51||53||22||46||20||350||93 251||51||53||22||46||20||350||93 |} Japan National Football Team Database |- |1979||3||0 |- |1980||9||4 |- |1981||1||0 |- |1982||8||1 |- |1983||10||8 |- |1984||7||4 |- |1985||10||7 |- |1986||6||2 |- !Total||54||26 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association Category:1958 births Category:Living people Category:Footballers from Hiroshima Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:Yokohama F. Marinos players",
 "title": "Kazushi Kimura"
}