{
 "id": "157797",
 "text": "Leônidas da Silva (6 September 1913 – 24 January 2004) was a Brazilian football player. He played for Brazil national team. Leônidas was famous for his bicycle kicks and possessed good dribbling and pace. His nickname was the \"Rubber Man\" and \"Black Diamond\" because of his incredible agility. He is regarded as one of the most important football players in the first half of the 20th century and he is considered one of the greatest strikers of 1930s and 1940s. ==Early life== Born in São Cristóvão on September 6, 1913, he was the son of Manoel Nunes da Silva and Maria da Silva. He was a simple boy from São Cristóvão, a neighborhood in the residential and commercial area of Rio de Janeiro, where his mother lived in the house of his adoptive parents, a fan of Fluminense ,delighted that he was with the three-time champion carioca team from 1917-18 and 1918-19. Although he completed his primary studies and high school in schools in that neighborhood, Leônidas wanted to dedicate himself to football. At a very young age, he began to practice the sport, then an amateur in Brazil, in the nudes at Ponte dos Marinheiros. At the age of 13, he stood out as a juvenile of São Cristóvão. In 1926, he also started to defend other clubs in the neighborhood, such as Havanesa, then Barroso and Sul-Americano, in order to earn some money. ==Club career== In 1929, he played for Syrio and Libanez. In 1931, Leônidas moved to Bonsucesso, where he began his semi- professionalization by signing his first contract, for which he would receive four hundred thousand réis per month. At Bonsucesso, Leônidas also played basketball, having won the championship in this sport. A year later, he was already featured in Carioca football, having been called up to play in the Carioca National Team in a friendly against Ferencváros TC, then Hungarian champion, and scored a goal in the match. Also in 1931, he won the Brazilian State Team Championship. Still in 1934, he transferred to Peñarol, where he could not shine because of a knee injury. He returned to Rio de Janeiro to play for Vasco da Gama, who played one season and helped the club win the 1934 Campeonato Carioca. The following year, he changed clubs again, going to play for Botafogo, where he won Carioca that season. In 1936, he transferred to Flamengo, where he played until 1942, becoming Rio champion in 1939. This transfer would be remembered by Botafogo leader Carlito Rocha, more than thirty years later: \"Leônidas gave an interview in Rio Grande do Sul, stating that he was Flamengo at heart. When he returned, he confirmed the statements. I sent him away immediately and fixed the price of the pass at five contos [de réis], which was how much he owed the club's treasury. The next day, Flávio Costawent to the club and took Leonidas to Flamengo. I couldn't admit to Botafogo an athlete who publicly said that under his white shirt, a red-black heart beat. The mood in Flamengo was deteriorating, however. In early 1941, he refused to participate in a tour of Argentina due to an injury, in addition to his constant participation in advertisements, which led to problems with the directors. In the midst of this, he was arrested by the Army for using a false reservist certificate to get a public job, ending his time at Flamengo. In 1943, Leônidas moved to São Paulo. Its debut broke the attendance record at the Pacaembu stadium, with more than seventy thousand fans in attendance. He was recognised one of the biggest idols in the club's history, having been Champion Paulistain 1943, 1945, 1946, 1948 and 1949. The following year, the Rubber Man retired from football at the age of 37. ==International career== Taking advantage of an injury to the famous striker Nilo, Leônidas won an opportunity in the Brazilian National Team on December 4, 1932, which would face Uruguay at Estádio Centenário, for the Copa Rio Branco. Brazil won with two goals from young Leônidas da Silva. In 1934, he was one of those called up for the World Cup in Italy, having scored the only goal of the Brazilian team's only match in the competition. He was left out for Copa América in 1937, Still at the end of the 1930s, Leônidas was the biggest highlight of the Brazilian team in the 1938 World Cup, having been the top scorer in the competition, with eight goals. Brazil achieved its best participation in World Cups so far, taking third place. Subsequently, the Black Diamond was chosen the best player of that Cup. He participated during the Roca Cup when Brazil finished second against Argentina and also in 1940. He played in the Copa Rio Branco in 1940 and Brazil finished as runners-up against Uruguay. He was close to participate for Copa América in 1942 and 1945 but he wasn't able to be selected. He won the Roca Cup with Brazil against Argentina, Leonidas was selected to play for Copa América in 1946, It was the first and only time that he played for the Copa América, where Brazil finished second. ==After football career== After leaving the lawns in 1951, he was still connected to the sport. He was manager of São Paulo, soon after became a sports commentator, being considered by many a direct, tough and controversial commentator. He went on to win seven Roquette Pinto Trophies. He had a cameo in the Brazilian film Susana e o Presidente, from 1951. His broadcasting career had to be cut short in 1974 due to Alzheimer's Disease. For thirty years he lived in a home for the elderly in São Paulo until he died on January 24, 2004 at the age of 90, due to complications related to the disease. He was buried at Cemitério da Paz in São Paulo. ==International career statistics== RSSSF |- |1932||1||2 |- |1933||0||0 |- |1934||2||3 |- |1935||0||0 |- |1936||0||0 |- |1937||0||0 |- |1938||4||7 |- |1939||2||2 |- |1940||6||6 |- |1941||0||0 |- |1942||0||0 |- |1943||0||0 |- |1944||0||0 |- |1945||3||1 |- |1946||1||0 |- !Total||19||21 |} ==Honours== São Cristóvão *Campeonato Carioca de terceiros Quadros de: 1929 Syrio Libanêz *Campeonato Brasileiro de Seleções Estaduais: 1931 Vasco da Gama * Campeonato Carioca: 1934 Botafogo *Campeonato Carioca: 1935 *Torneio Aberto de Futebol do Rio de Janeiro: 1936 *Taça João Vianna Seilir: 1936 *Taça da Paz: 1937 Flamengo *Campeonato Brasileiro de Seleções Estaduais: 1938, 1940, 1942 *Campeonato Carioca: 1939 São Paulo * Campeonato Paulista: 1943, 1945, 1946, 1948, 1949 *Torneio Início Paulista: 1945 *Taça Cidade de São Paulo: 1944 *Taça dos Invictos: 1946, 1947 *Taça Amizade (São Paulo): 1946 *Torneio Pentagonal R. Monteiro: 1949, 1950 *Taça dos Campeões Estaduais de São Paulo e do Rio de Janeiro: 1943, 1945, 1946, 1948 *III Olimpíada Tricolor: 1944 *Taça Coletividade Brasileira, Paraguai: 1945 *Taça Cia Internacional de Capitalização: 1946 *Taça Argemiro Ribeiro de Oliveira, Barretos: 1946 *Taça Cid de Mattos Vianna, Minas Gerais: 1946 *Taça Amizade, Rio de Janeiro: 1946 *Taça Governador Octávio Mangabeira, Bahia: 1947 *Taça Castelões, Ribeirão Preto: 1947 *Taça Dr. José Ribeiro Fortez, São Joaquim da Barra: 1948 *Troféu Casanova, Barretos: 1948 *Taça Corante Wilson, Paraná: 1949. *Pentagonal Rio- São Paulo - Taça R. Monteiro: 1949 *Taça Presidente Cícero Pompeu de Toledo, Bauru: 1949 *Troféu Filhos de Araçatuba, Araçatuba: 1949 Brazil *FIFA World Cup: third-place 1938 *South American Championship Runner-up: 1946 *Copa Rio Branco: 1932 *Roca Cup: 1945 *Copa Rio Branco Runner-up: 1940 *Roca Cup Runner-up: 1939, 1940 ===Individual=== *FIFA World Cup Golden Boot: 1938 *FIFA World Cup Golden Ball: 1938 *FIFA World Cup All-Star Team: 1938 *IFFHS Brazilian Player of the 20th Century (8th place)IFFHS' Century Elections *IFFHS South American Player of the 20th Century (24th place) *IFFHS World Player of the 20th Century (36th place) *Best player in the Campeonato Paulista: 1943, 1945, 1946, 1948, 1949 *Top scorer and best player in the 1938 Campeonato Carioca (16 goals) *Top scorer and best player in the 1940 Carioca Championship (30 goals) *26th Best World Player of the 20th Century - Guerin Sportivo Magazine - 1999 *28th Best World Player of the 20th Century - Placar Magazine - 1999 *100 Greatest Players of All Time - World Soccer Magazine - 1999 *61st Best Player in the History of World Cups by - Placar Magazine - 2006 *Ideal selection in the history of São Paulo *Ideal selection in the history of Flamengo ==References== Category:1913 births Category:2004 deaths Category:Footballers from Rio de Janeiro",
 "title": "Leônidas"
}