{
 "id": "157755",
 "text": "Abbotsford is a city in the state of Wisconsin in the United States. It is in both Clark County, Wisconsin and Marathon County, Wisconsin. The city is a part of the Wausau, Wisconsin Metropolitan Statistical Area. According to the 2020 United States Census, there were 2,275 people living in Abbotsford. The city is named after Edwin H. Abbott. Abbott was in charge of the Wisconsin Central Railway. Abbotsford was incorporated in 1965. The public schools in Abbotsford are part of the Abbotsford School District. There is one elementary school, one middle and high school, and one alternative high school. ==Geography== The coordinates of Abbotsford are (44.946716, -90.318333). The United States Census Bureau says that the city's size is . All of this is land. Abbotsford does not have any rivers, lakes, or other kinds of standing water in it. ==Demographics== In 2020, there were 2,275 people, 855 households, and 557 families in Abbotsford. The population density was 767.8 people per square mile (296.5/km²). The breakdown by race was 65.9% White, 0.8% Asian, 0.6% Native American, 0.5% Black, 20.7% from one other race, and 11.4% from two or more races. Hispanics and Latinos made up 38.5% of the people. The median (middle) age was 37.0 years. The age breakdown was 26.8% under age 18, 57.0% from 18 to 65, and 16.2% over 65. The gender breakdown was 49.8% male and 50.2% female. Of the households, 32.0% had children under age 18, 45.0% had a married couple, 9.0% had an unmarried couple, 25.0% had a woman with no partner, 20.9% had a man with no partner, and 28.3% had one person living alone. The average household size was 2.60 people. File:2009-0620-Abbotsford-CH.jpg|City of Abbotsford Municipal Center, housing the library and city hall File:2009-0620-Abbotsford-FDPD.jpg|Fire and police departments == Sources == == Other websites == *City of Abbotsford Category:Cities in Wisconsin Category:Clark County, Wisconsin Category:Marathon County, Wisconsin Category:1965 establishments in the United States Category:1960s establishments in Wisconsin",
 "title": "Abbotsford, Wisconsin"
}