{
 "id": "157913",
 "text": "A county, in the United States, is a political subdivision and form of government that is right below the state. 48 out of the 50 states in the United States use counties. Louisiana calls its counties parishes while Alaska got rid of counties and only uses boroughs. Both of these are equal to the county. Connecticut has counties, but these no longer exist as statistical entities, having been replaced in 2022 by what the state calls \"councils of governments\". The list that the U.S. Census Bureau keeps that lists all of the counties in the United States says that there are 3,481 counties or other kinds of divisions that are equal to the county in the United States. The midwestern and northeastern states in the United States divide the county further into townships or towns, some of which have municipalities. The place where the county government and courts are is called the county seat (Alaska: \"borough seat\", Louisiana: \"parish seat\", Vermont: sometimes \"shire town\"). On average, a county in the United States has a population of around 100,000 people. The county that has the most people living in it is Los Angeles County, California, where over 10 million people live. The county that has the fewest people living in it is Loving County, Texas, where as of the 2020 United States Census, 64 people live. The average number of counties in each state is 62. Delaware has the fewest with only 3. Texas has the most counties with 254. These pages list all of the counties in each state: *254 – Texas *159 – Georgia *120 – Kentucky *115 – Missouri *105 – Kansas *102 – Illinois *100 – North Carolina *99 – Iowa *95 – Tennessee *95 – Virginia *93 – Nebraska *92 – Indiana *88 – Ohio *87 – Minnesota *83 – Michigan *82 – Mississippi *77 – Oklahoma *75 – Arkansas *72 – Wisconsin *67 – Pennsylvania *67 – Florida *67 – Alabama *66 – South Dakota *64 – Louisiana *64 – Colorado *62 – New York *58 – California *56 – Montana *55 – West Virginia *53 – North Dakota *46 – South Carolina *44 – Idaho *39 – Washington *36 – Oregon *33 – New Mexico *30 – Alaska *29 – Utah *24 – Maryland *23 – Wyoming *21 – New Jersey *17 – Nevada *16 – Maine *15 – Arizona *14 – Vermont *14 – Massachusetts *10 – New Hampshire *8 – Connecticut (see also: Councils of governments in Connecticut on the English Wikipedia) *5 – Rhode Island *5 – Hawaii *3 – Delaware == Notes == == References == == Other websites == * Geographic Areas Reference Manual by the United States Census Bureau * National Association of Counties * Cross-reference any State, County, City, ZIP Code in the U.S. * U.S. County Formation Maps 1643-Present – Cumulative animated graphics. *",
 "title": "County (United States)"
}