{
 "id": "158000",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Kamamoto was born in Kyoto on April 15, 1944. After graduating from Waseda University, he joined Japan Soccer League club Yanmar Diesel in 1967. He played all games in league from first season. In 1968, he became a top scorer in the league. The club won their 1st title 1968 Emperor's Cup with his winning goal in final. The club also won 1970 Emperor's Cup. In 1971, the club won their 1st league champions and he also became a top scorer Second time. In 1974 and 1975, the club won the league for 2 years in a row and also won 1974 Emperor's Cup. In 1978, he became a playing manager. The club won the league champions in 1980. In 1982, he ruptured his Achilles tendon 2 times. In 1984, when he was 40 years old, he retired and resigned a manager. He became a top scorer 7 times and was selected Best Eleven 14 times. He was also selected \"Japanese Footballer of the Year\" awards 7 times. On March 3, 1964, when Kamamoto was a Waseda University student, he debuted and scored a goal for the Japan national team against Singapore. In October, he was selected by Japan for 1964 Summer Olympics in Tokyo. He played all matches and scored 1 goal. In 1968, he also was selected Japan for 1968 Summer Olympics in Mexico City. Japan won Bronze Medal and he became a top scorer. He played all matches and scored 7 goals. In 2018, this team was selected Japan Football Hall of Fame. In the 1970s, after many Olympic players left national team, he continued being selected national team. He also played at 1966, 1970 and 1974 Asian Games. In 1977, he retired from national team. He played 76 games and scored 75 goals for Japan until 1977. In 1991, he signed with across town to the Yanmar Diesel rivals, Matsushita Electric (later Gamba Osaka). He resigned in 1994. Kamamoto was selected as a member of the House of Councillors in July 1995, then served until July 2001. Kamamoto was also served the vice-president of the Japan Football Association from July 1998 to July 2008. In 2005, he was selected Japan Football Hall of Fame. ==Statistics== |- |1967||rowspan=\"18\"|Yanmar Diesel||rowspan=\"18\"|JSL Division 1||14||14||3||7||colspan=\"2\"|-||17||21 |- |1968||14||14||3||5||colspan=\"2\"|-||17||19 |- |1969||12||10||3||7||colspan=\"2\"|-||15||17 |- |1970||14||16||3||5||colspan=\"2\"|-||17||21 |- |1971||14||11||3||5||colspan=\"2\"|-||17||16 |- |1972||14||11||4||5||colspan=\"2\"|-||18||16 |- |1973||16||17||2||0||colspan=\"2\"|-||18||17 |- |1974||18||21||4||3||colspan=\"2\"|-||22||24 |- |1975||17||9||3||2||colspan=\"2\"|-||20||11 |- |1976||18||15||3||2||1||0||22||17 |- |1977||18||20||4||4||3||2||25||26 |- |1978||18||15||3||4||3||4||24||23 |- |1979||18||7||3||2||2||1||22||11 |- |1980||18||10||2||0||3||2||23||12 |- |1981||18||11||2||0||0||0||20||11 |- |1982||8||1||0||0||0||0||8||1 |- |1983||2||0||0||0||0||0||2||0 |- |1984||0||0||3||0||0||0||3||0 251||202||48||51||12||9||311||262 251||202||48||51||12||9||311||262 |} Japan National Football Team Database |- |1964||2||1 |- |1965||3||3 |- |1966||7||6 |- |1967||5||11 |- |1968||4||7 |- |1969||0||0 |- |1970||6||3 |- |1971||6||8 |- |1972||8||15 |- |1973||3||2 |- |1974||5||5 |- |1975||7||5 |- |1976||16||9 |- |1977||4||0 |- !Total||76||75 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1944 births Category:Living people Category:Footballers from Kyoto Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan Soccer League players Category:Cerezo Osaka players Category:Footballers at the 1964 Summer Olympics Category:Footballers at the 1968 Summer Olympics Category:Olympic medalists in football Category:Olympic bronze medalists for Japan Category:Medalists at the 1968 Summer Olympics",
 "title": "Kunishige Kamamoto"
}