{
 "id": "158531",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Nagai was born in Saitama on April 16, 1952. After graduating from Saitama Urawa Minami High School, he joined Japan Soccer League club Furukawa Electric in 1971. The club won the league champions in 1976 and 1985/86. The club also won 1976 Emperor's Cup, 1977, 1982 and 1986 JSL Cup. He retired in 1988. He played 272 games and scored 63 goals in the league. It is the record for most appearances in Japan Soccer League Division 1. In 1976, he was selected \"Japanese Footballer of the Year\" awards. He was selected Best Eleven 5 times. On August 13, 1971, when Nagai was 19 years old, he debuted for the Japan national team against Iceland. He also played at 1972 Summer Olympics qualification in 1971. Although he did not play for Japan in 1972, he was selected Japan for 1974 World Cup qualification in 1973. He also played at 1974, 1978 Asian Games. In 1980, he was selected Japan for 1980 Summer Olympics qualification, Japan's failure to qualify for 1980 Summer Olympics. This qualification was his last game for Japan. He played 69 games and scored 9 goals for Japan until 1980. After retirement, Nagai became an assistant coach for Furukawa Electric (later JEF United Ichihara) in 1988. In 1989, he became a manager for Japan U-20 national team. In 1992, he returned to JEF United Ichihara and managed until 1993. In 1996, he signed with Japan Football League (JFL) club Fukushima FC and managed in 1 season. In 1998, he signed with JFL club Albirex Niigata. The club joined new league J2 League in 1999. In 2001, he moved to Yokohama FC. In 2006, he signed with his local Nadeshiko League club Urawa Reds Ladies. In 2012, Nagai was selected Japan Football Hall of Fame. ==Statistics== |- |1971||rowspan=\"17\"|Furukawa Electric||rowspan=\"17\"|JSL Division 1||10||2 |- |1972||10||0 |- |1973||18||2 |- |1974||18||5 |- |1975||18||7 |- |1976||18||5 |- |1977||18||14 |- |1978||18||1 |- |1979||18||6 |- |1980||17||3 |- |1981||15||6 |- |1982||10||1 |- |1983||12||1 |- |1984||14||5 |- |1985/86||22||3 |- |1986/87||14||0 |- |1987/88||22||2 272||63 272||63 |} Japan National Football Team Database |- |1971||4||1 |- |1972||0||0 |- |1973||5||0 |- |1974||4||1 |- |1975||11||1 |- |1976||17||2 |- |1977||5||0 |- |1978||12||1 |- |1979||9||3 |- |1980||2||0 |- !Total||69||9 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association Category:1952 births Category:Living people Category:Footballers from Saitama Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan Soccer League players Category:JEF United Chiba players Category:Yokohama FC managers",
 "title": "Yoshikazu Nagai"
}