{
 "id": "15886",
 "text": "The Democratic Socialist Republic of Sri Lanka (ශ්‍රී ලංකා in Sinhala, இலங்கை in Tamil) is a tropical island nation off the southeast coast of the Indian subcontinent. The capital of the country is Sri Jayawardenepura Kotte while the largest city is Colombo. Sri Lanka shares a sea boundary with the Maldives in the south-west part and India in the north-west. It was known as Ceylon before 1972, and Serendib and Sinhale, among other names, before that. It was South Asia's oldest democracy. == Ethnic make-up == Sri Lanka has three main ethnic groups. They differ in their religions and origins, and there has often been difficulties between the groups. The total population of the island is over 20 million people, and rapidly expanding. The largest of the three groups is the population of Sinhalese people. Most of them are Buddhist. Their language is Sinhala. They make up about 75% of the population. The second largest group is the Tamil people. They are mostly Hindu and most live in the north. There are about 2,271,000 Tamils in Sri Lanka. The Sri Lankan Civil War against Tamil separatists lasted 28 years. The third largest group is the Sri Lankan Moors. They are Muslim. There are over one and a half million people in this group. They use Tamil as their language today. Other than these three main groups, there are burghers (descendants of colonial ancestors), Malays and Chinese. In areas such as Dabana, Mahiyangaya ; lives the indigenous group called 'veddas' who are said to descend from Kuweni and Vijaya's son 'Jeewahaththa'. == History == Buddhist missionaries arrived from India in 250 BC during the time period of King Devanampiyatissa. The kings of the island, and eventually most of the Sinhalese people, became Buddhists. Legend has it that Buddha visited the island three times. The island was subject to waves of European settlement and eventually colonisation. The Portuguese in the 16th and 17th centuries, the Dutch in the 17th and 18th centuries, and lastly the British from 1796 to 1948. The British traded as the others had done, but also developed plantations of coffee and tea. Tea was planted after a fungus destroyed the coffee plantations in 1869. The tea plantations were the basis of Sri Lankan prosperity for a hundred years. Lastly, rubber plantations were started in the early 20th century. In 1965, Ceylon became the world's leading exporter of tea, with 200,000 tonnes of tea being shipped internationally annually. Independence from the British was got in 1948, together with Dominion status in the British Commonwealth of Nations. In 1972, Ceylon changed its name officially to the Republic of Sri Lanka, and is still a member of the Commonwealth.Dominion of Ceylon: definition of Dominion of Ceylon in the Free Online Encyclopedia. Encyclopedia2.thefreedictionary.com. In 2009 came the end of a long Sri Lankan Civil War between Sinhalese and Tamils. In the 2010s, tourism rapidly grew as a source of foreign investment and currency. An economic crisis in the early 2020s led to political violence. == National symbols of Sri Lanka == File:SriLanka Elephants (pixinn.net).jpg|National animal of Sri Lanka File:Thimindu 2009 09 04 Yala Sri Lanka Junglefowl 1.JPG|National bird of Sri Lanka - Ceylon Junglefowl File:MesuaFerrea IronWood.jpg|National tree of Sri Lanka File:Nymphaea nouchali - Manel123.jpg|National flower of Sri Lanka File:Flag of Sri Lanka.svg|National Flag of Sri Lanka ==Flag== The Sri Lanka flag is also known as the Lion flag because of the Lion on it. The Lion is holding a sword in its right paw. There is a crimson background with four leaves in each corner. There is a yellow border. On the left of the flag, there are the colors green and saffron. The lion represents bravery. The four leaves represent Karuna, Meththa, Muditha and Upeksha. The orange stripe represents the Sri Lankan Tamils and the green stripe represents the Sri Lankan Moors. == Provinces == Sri Lanka has 9 provinces. * Central * North Central *North * Eastern * North Western * Sabaragamuwa * Southern * Uva * Western ==Related pages== *List of rivers of Sri Lanka *Sri Lanka at the Olympics *Sri Lanka national football team *History of Sri Lanka *Burning of Jaffna library == Notes == ==References== ==Other websites== === Government=== * Official web portal of the Government of Sri Lanka * Office of the President of Sri Lanka * Ministry of Defence, Sri Lanka * Central Bank of Sri Lanka * World Terrorism Blog On Sri Lanka ===Business=== * Board of Investment of Sri Lanka * Sri Lanka Export Development Board * Colombo Stock Exchange * Sri Lankan Business Directory ===Other=== * Virtual Library Sri Lanka * The CIA World Factbook - Sri Lanka * Sri Lanka - UNESCO World Heritage Centre * Collection of slides of Sri Lanka, University of Pennsylvania library * NIGHANTAYA | The Environment Friendly E Community | Sri Lanka Category:1948 establishments in Asia Category:Commonwealth member states",
 "title": "Sri Lanka"
}