{
 "id": "158861",
 "text": "The Syrian hamster (Mesocricetus auratus), also known as the golden hamster, is a breed of hamster. They first lived in Syria. They are also known as golden hamsters because the first ones kept as pets were gold coloured. Now there are over 100 different colours because of selective breeding. Little is known about their life in the wild. They are kept as pets in many countries including the United States, Canada most countries in Asia and many more. ==Anatomy== A Syrian hamster's anatomy is similar to other rodents. It is very close to other hamsters. ===Skeleton=== ====Teeth==== Syrian hamsters have 16 teeth. There are 4 incisors and 12 molars. There is a space between the incisors and the molars. That space is called the diastema. ====Spine and tail==== The spine, like in other animals, is made up of several bones called vertebrae. A Syrian hamster has 43-44 vertebrae. Thirteen to fourteen of them are in the tail. ====Limbs==== All hamsters have short legs. Because of this, their legs have small bones which can get broken more easily. Obese hamsters are more likely to have problems with their legs. ===Sense organs=== Syrian hamsters have, like most animals, five senses. They can see, hear, touch, taste and smell. Although they don't see well in daylight, they are not colorblind: Syrian hamsters are nocturnal and can see blue-green colours but not red colours. They use their sense of smell to locate food, and their taste buds function in the same way as human tongues do. ==Breeding== Not much is known about Syrian hamster breeding in the wild. They have been bred well in captivity (i.e. in labs, by breeders and when kept as pets). People have learned a lot about their breeding. Breeding in captivity is probably the same as in the wild. Syrian hamsters are believed to have the shortest gestation period of any animal. Their gestation is 16 days. They also have a short ovulation period. Syrian hamsters come into heat once every 4 days for about 1-2 hours. == Lifespan == The lifespan of a Syrian hamster is typically 2 to 3 years; however, it can occasionally be 4 years. Their longevity is influenced by genetics, environment, diet, activity, veterinary treatment, and stress. Providing them with the best possible care, which includes a healthy diet, roomy living quarters, mental stimulation, and careful handling, will improve their general well-being and lengthen their stay with you. ==References== ==Other websites== Category:Hamsters Category:Syria Category:Mammals of Asia",
 "title": "Syrian hamster"
}