{
 "id": "158829",
 "text": "The luna moth (Actias luna) is a species of moth. It is in the family Saturniidae. The luna moth is thought to be North America's most beautiful insect.David L. Wagner (2005). Caterpillars of Eastern North America. Princeton University Press, Princeton, NJ. ==Description== The luna moth has a wingspan of 7.5 to 10.5 cm. The wings are lime-green. The bottom wings have long tails. There is a clear spot on each wing. There is a reddish-brown border on the top edge of the top wing. Some individuals have pinkish borders on the outer edge of both wings. Other individuals have yellowish borders instead. Adult luna moths have no mouth, and live on the fat they stored up at the larval stage.Charles V. Covell, Jr. 2005. Moths of Eastern North America. Virginia Museum of Natural History, Martinsville, VA. Because of this, they only live for about a week.Hazel Davies and Carol A. Butler 2008. Do butterflies bite?: Fascinating answers to questions about butterflies and moths pp24–25. Rutgers University Press, Piscataway, NJ. ==Distribution== The luna moth is found in North America. It is found from Nova Scotia, west to North Dakota, south to Texas, and east to Florida. The luna moth is found in habitats such as woodlands and forests. ==Flight period== The luna moth is seen from May to July in the northern part of its range. It is seen from March to September in the southern part of its range. ==Life cycle== The luna moth's eggs are brown. The caterpillar is green. It has bright red spots on its body. There are two yellow stripes that run down each side of the body. The caterpillar will grow to 6.5 cm long. The luna moth caterpillar is similar to the polyphemus moth (Antheraea polyphemus) caterpillar. The polyphemus moth caterpillar does not have yellow stripes on its body. The luna moth's cocoon is made of dead leaves on the ground. It overwinters (spends the winter) as a cocoon. The luna moth lays eggs once each year in the northern part of its range. It has three broods per year in the southern part of its range. == Food plants == The caterpillars feed on the following host plants: * Alnus – Alder * Betula – Birch * Carya and Annamocarya – Hickory * Diospyros – Persimmon * Juglans – Walnut * Liquidambar – Sweet gum * Nyssa sylvatica – Black gum * Rhus – Sumac ==References== Category:Saturniidae",
 "title": "Actias luna"
}