{
 "id": "159077",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Horiike was educated at, and played for, Shimizu Higashi High School. He won the national high school championship with his teammates, including Katsumi Oenoki and Kenta Hasegawa. He continued his study and football at Juntendo University. After graduating in 1988, he joined the Japan Soccer League team of Yomiuri. He played as a defensive midfielder, then as centre back, partnered with Hisashi Kato. When Japan's first professional league, the J1 League, started, Shimizu S-Pulse was founded in his local city. He joined the club in 1992 and re-united with his high school teammates Oenoki and Hasegawa. His position was a right side-back. After the end of the inaugural season, he was chosen as a member of the Best Eleven in 1993. He was transferred to Cerezo Osaka in 1998 and came back to Shimizu briefly in 1999 before resigning. On August 1, 1986, when Horiike was a Juntendo University student, he debuted for the Japan national team against Malaysia. He was mainly a right side-back for the national team. He was a member of the Japan team that won the 1992 Asian Cup and he played 4 matches in the competition. Under national coach Hans Ooft, Japan progressed to the Final round at 1994 World Cup qualification. Horiike was on the pitch when Japan's hope to play in the finals was dashed by an injury-time Iraqi equaliser in the last qualifier, the match that the Japanese fans now refer to as the \"Agony of Doha\" (ドーハの悲劇). He played 58 matches and scored 2 goals for the Japan until 1995. ==Statistics== |- |1988/89||rowspan=\"4\"|Yomiuri||rowspan=\"4\"|JSL Division 1||19||0||3||0||3||0||25||0 |- |1989/90||22||0||4||1||4||0||30||1 |- |1990/91||22||1||2||1||2||0||26||2 |- |1991/92||22||0||5||0||5||0||32||0 |- |1992||rowspan=\"7\"|Shimizu S-Pulse||rowspan=\"7\"|J1 League||colspan=\"2\"|-||3||1||11||1||14||2 |- |1993||36||1||4||0||1||0||41||1 |- |1994||44||2||1||0||1||0||46||2 |- |1995||40||0||1||0||colspan=\"2\"|-||41||0 |- |1996||30||0||3||0||16||0||49||0 |- |1997||29||0||0||0||6||0||35||0 |- |1998||1||0||0||0||9||0||10||0 |- |1998||rowspan=\"2\"|Cerezo Osaka||rowspan=\"2\"|J1 League||14||0||1||1||0||0||15||1 |- |1999||9||0||0||0||0||0||9||0 |- |1999||Shimizu S-Pulse||J1 League||0||0||0||0||2||0||2||0 288||4||29||4||58||1||375||9 288||4||29||4||58||1||375||9 |} Japan National Football Team Database |- |1986||2||0 |- |1987||11||0 |- |1988||1||0 |- |1989||11||1 |- |1990||6||0 |- |1991||2||0 |- |1992||7||0 |- |1993||16||1 |- |1994||0||0 |- |1995||2||0 |- !Total||58||2 |} ==References== ==Other websites== * Category:1965 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:J1 League players Category:Japan Soccer League players Category:Tokyo Verdy players Category:Shimizu S-Pulse players Category:Cerezo Osaka players Category:1995 King Fahd Cup players Category:1988 AFC Asian Cup players Category:1992 AFC Asian Cup players Category:AFC Asian Cup-winning players",
 "title": "Takumi Horiike"
}