{
 "id": "159091",
 "text": "The pan flute or pan pipe (also known as panflute or panpipes) is an old musical instrument that has five or more pipes of gradually increasing length (and, at times, girth). The pan flute has been a folk instrument, and is considered the first mouth organ, ancestor of both the pipe organ and the harmonica. == Name == The pan flute is named after Pan, the Greek god of nature and shepherds, who is often depicted playing this instrument. == Mythology == In Greek mythology, Pan fell in love with the nymph Syrinx, who transformed into reeds to escape him. Pan created the pan flute by cutting these reeds and binding them together. The instrument was known as Syrinx in honor of the nymph and also referred to as Pandean or Pan-pipes. == Structure == The pan flute consists of tubes that are closed at one end, producing lower notes than open pipes of the same length. Traditional tuning methods involve adding small objects like pebbles to adjust pitch. Contemporary makers may use wax or stoppers for tuning. == Acoustics == Sound is generated by blowing across the open end of the tubes. The length of each tube determines its pitch, with shorter tubes producing higher notes. The relationship between tube length and frequency is inversely proportional, allowing for calculations of pipe lengths based on desired pitches. == Playing == The pan flute is played by blowing horizontally across the pipe openings. Each pipe is tuned to a specific note, and players can create additional harmonics by adjusting their breath. The Romanian version of the pan flute has pipes arranged in a curved shape for easier access to notes. == Variations == There are different styles of pan flutes, including traditional instruments like the quills, played by some American musicians. Some variations are below. * Nai (Romania). Note that nai is also the Romanian word for the Middle Eastern reed flute ney. * Antara (Andes) * Paixiao (China) * So (Korea) * Syrinx * Zampoña (Andes) * Kuvytsi, Svyryli, Rebro (Ukraine) Category:Flutes Category:Early musical instruments",
 "title": "Pan flute"
}