{
 "id": "159073",
 "text": "Sunday Oliseh (born 14 September 1974) is a former Nigerian football player. He has played for Nigeria national team. He is widely regarded as one of the best African midfielders of all time. Physical yet technically gifted, Oliseh was a physical yet technically gifted midfielder. Although he essentially played as a defensive midfielder throughout his career, Jonathan Wilson noted in a 2013 article for The Guardian that he was an early example of a more creative interpreter of this role, who focussed more on ball retention and passing rather than solely looking to win back possession. Oliseh was a physical yet technically gifted midfielder. Although he essentially played as a defensive midfielder throughout his career, Jonathan Wilson noted in a 2013 article for The Guardian that he was an early example of a more creative interpreter of this role, who focussed more on ball retention and passing rather than solely looking to win back possession. ==Club career== Sunday Olise was born in Nigeria, in the town of Abavo near the city of Port Harcourt . Sunday started his football career at the age of 16 in the Julius Berger team. In 1990, Sunday moved to Belgium with his parents to play for Liège. In his new club, Olis played only 3 games in the first season. In the following seasons, Sunday appeared regularly for Liège, making 75 appearances and scoring 3 goals in four years. In 1994, Olise moved to the Italian \"Reggiana\" from the city of Reggio Emilia. In Serie A, Sunday played 29 matches and scored 1 goal. At the end of the 1994/1995 season, the team left the elite division, occupying the penultimate 17th place in the standings. Olis did not want to stay in the club, and in 1995 he moved to the German \"Cologne\". Having joined the middle-class team of the Bundesliga, Olise immediately got into the main team. Sunday spent two years in Cologne, making 54 appearances and scoring 5 goals. His game for \"Cologne\" did not leave the selectors of the Dutch \"Ajax\", to which he transferred in 1997, without attention. Oliseh was one of the best in the star team of Ajax, playing 54 matches and scoring 8 goals in two seasons in the Eredivisie. During this time, Sunday became the champion of the Netherlands in 1998 and a two-time winner of the Dutch Cup in 1998 and 1999. In 1999, Sunday moved to the Italian \"Juventus\", but could not establish himself in the main team, appearing in only 8 matches. In 2000, Olise moved to Borussia Dortmund, the transfer of the Nigerian player cost the Germans 6.8 million dollars. In his first season for Borussia, Sunday played 22 matches, and his team took third place in the 2000/2001 German championship and entered the draw for the Champions League cup. In the European Cup season 2001/2002, \"Borussia\" was supposed to meet with the Ukrainian \"Shakhtar\" in the third qualifying round. In the away match in Donetsk , \"Borussia\" won 2:0, and Olise scored a goal in the 73rd minute of the match. In the return match, \"Borussia\" won 3:1, Olise spent all 90 minutes on the field. Having passed \"Shakhtar\", \"Borussia\" entered the group stage in the same group with \"Liverpool\", \"Boavista\" and \"Dynamo\" from Kyiv. Sunday played 5 matches in the group of 6, but Borussia only finished 3rd in the group and was eliminated in the play-offs of the UEFA Cup. In the 2001/2002 UEFA Cup , Olise played 7 matches, and \"Borussia\" reached the final, where they lost to the Dutch \"Feyenoord\" 3:2, Sunday did not participate in the final. In the 2001/2002 German championship , Olise became the champion of Germany, playing 18 matches for the team and scoring 1 goal, \"Borussia\" just one point ahead of \"Bayer 04\". In 2002, Olise went on loan to another German club \"Bochum\", where, in 1.5 years, Sunday played 32 matches in which he scored 1 goal. But \"Bochum\" had to terminate the lease agreement due to the incident that took place after the match of the German championship against \"Hansa\", Olise quarreled with his Iranian teammate Vahid Hashemian, who broke his nose in a fight. After returning to Borussia, Oliseh played 11 matches, but the team's management decided to terminate his contract, which was valid until the summer of 2005. In 2005, as a free agent, Olisse moved from Borussia to the Belgian Genk, but Sunday played only 16 matches for Genk, after which he ended his career on January 23, 2006 for personal reasons. ==International career== Olise made his debut as part of the Nigerian national team in 1993, a year later Sunday won the 1994 African Cup of Nations, the cup was held in Tunisia. In the final, the Nigerian team defeated the Zambian team with a score of 2:1. In 1996, Olise became an Olympic champion as part of the Nigerian Olympic team; the football tournament was held in the USA in the cities of Orlando, Miami and Afense. During the tournament, the Nigerian national team was able to defeat the Brazilian national team with a score of 4:3 in the semi-finals. In the final on August 3, 1996, Nigeria defeated Argentina 3:2. At the 1998 World Cup , the Nigerian national team was placed in the same group with Bulgaria, Paraguay and Spain. Few people expected that the “Super Eagles” (the nickname of Nigeria) would be able to leave the group. But in the first match against the star team of Spain, Nigeria won a sensational victory with a score of 3:2; Olise scored the decisive third goal, shooting from 24 meters away. His goal was named one of the best in the tournament. Nigeria advanced from first place to the 1/8 finals, but lost there to Denmark 1:4. Sunday also took part in the 2000 and 2002 African Cup of Nations. Sunday served as captain in many matches for the national team. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League Division Apps Goals Liège 1990–91 Belgian First Division 3 0 1991–92 16 1 1992–93 30 2 1993–94 26 0 Total 75 3 Reggiana 1994–95 Serie A 29 1 FC Köln 1995–96 Bundesliga 24 0 1996–97 30 4 Total 54 4 Ajax 1997–98 Eredivisie 29 5 1998–99 25 3 Total 54 8 Juventus 1999–2000 Serie A 8 0 Borussia Dortmund 2000–01 Bundesliga 22 0 2001–02 18 1 2002–03 2 0 2004–05 11 0 Total 53 1 Bochum (loan) 2002–03 Bundesliga 11 0 2003–04 32 1 Total 75 3 Genk 2005–06 Belgian First Division 16 0 Career total 321 18 === International === Appearances and goals by national team and year National team Year Apps Goals Nigeria 1993 1 0 1994 11 0 1995 3 0 1996 1 0 1997 4 0 1998 7 2 1999 3 0 2000 10 0 2001 7 0 2002 7 0 Total 54 2 ==Honours== Ajax * Eredivisie: 1997–98 * KNVB Cup: 1997–98, 1998–99 Juventus * UEFA Intertoto Cup: 1999 Borussia Dortmund * Bundesliga: 2001–02 * UEFA Cup runner-up: 2001–02 Nigeria U23 * Olympic Gold Medal: 1996 Nigeria * African Cup of Nations: 1994 * Afro-Asian Cup of Nations: 1995 == References == Category:1974 births Category:Living people Category:Nigerian footballers Category:Nigerian football managers Category:Olympic gold medalists for Nigeria Category:Footballers at the 1996 Summer Olympics Category:1994 FIFA World Cup players Category:1995 King Fahd Cup players Category:1998 FIFA World Cup players Category:Medalists at the 1996 Summer Olympics Category:Olympic medalists in football Category:People from Delta State",
 "title": "Sunday Oliseh"
}