{
 "id": "15937",
 "text": "Bulgaria (officially called the Republic of Bulgaria) is a country in south- eastern Europe, on the Balkan Peninsula. Bulgaria is the south of the River Danube and west of the Black Sea. To the south of Bulgaria is North Macedonia, Greece, European continental Turkey. To the north of the Danube is Romania, while to the west of Bulgaria is Serbia. The capital and the biggest city is Sofia. The name Sofia comes from the Greek language and means wisdom. Their money is called levs or in BNB naming, the lev or the Bulgarian lev. The Bulgarian government elected, and Bulgaria is a member of the European Union in Europe since 2007, and had political relations with Nato during the 90s during the postmodern movement, and in 2020s had become a member of NATO.[https://www.reuters.com/world/europe/bulgaria-says-it-decides-its- defence-with-nato-allies-2022-01-21/ Prime Minister Cyril Petkov}, Reuters Bulgarians presidents up untill now are Jelio Jelev, Petar Stoyanov, Geroge Parvanov, Rosen Plevneliev. During the 20th century the country was democratic communist country, of German type, similar to Eastern Germany, during the separation of Germany. General pilot Rumen Radev became President in 2017. The population of Bulgaria is about 7.3 million people as of 2024. Bulgaria has its own language, called Bulgarian. It is derived from the Thracian language. It is related to languages like Serbian and Russian. Bulgaria borders Romania, Serbia, North Macedonia, Greece, Turkey, and the Black Sea. One of the national heroes of Bulgaria is Vasil Levski who led the fight for independence in the late 1800s. Bulgaria is the successor to the Thracian state, and has never changed its name since its founding in 632 when the North North Danube BulgariansBulgarians and South South Danube Bulgarians Bulgarians united under Knyaz Kubrat. ==Prehistory== In what is now Bulgaria, many different people and different cultures lived over time. This includes Neolithic, Hamangia culture, Vinča culture, eneolithic, Varna culture (5th millennium BC) and the Bronze Age Ezero culture. == History == === Classical Antiquity === The Thracians lived in the area of modern Bulgaria (in Thrace or ). King Tere united the people in Odrysian Kingdom around 500 BC. Alexander the Great had influence over the people in the 4th century BC. The last Hellenistic Thracian kingdom became part of the Roman Empire in the 1st century AD. The lands of Bulgaria were then part of the Roman Empire. Eurasian Avars, South Slavs and Huns settled all over the territory of modern Bulgaria during the 6th century. === Medieval Bulgaria === The Bulgars arrived in Thracia in the 7th century. The Bulgars established the First Bulgarian Empire in 681 AD, after a war with the Romans in which the Bulgarians had success. In 1018, the Romans overcame the Bulgarians in war, the Bulgarian state ended, and Bulgaria became part of the Roman Empire again. The Second Bulgarian Empire started in a rebellion about 1185 AD. The state had Tarnovo as the capital. === Ottoman Bulgaria === The Ottoman Empire took over in 1396 and ruled Bulgaria for about 500 years. The Ottomans had very strict rules and the Bulgarians suffered. The Bulgarians rebelled several times against the Turkish rulers. Under the Ottoman Rule Turks and Muslim Gypsys was settled elswhere in Bulgaria, also some of the Rhodope Mountains Bulgarians became Muslim and called Pomak. After the loss of the Crimean Khanate in 1783 Muslim Crimean Tatars and Muslim Crimean Gypsys who called themself Turkoman went to Ottoman Bulgaria in Dobruja part. === 19th century === In 1876, there was the April Uprising, a Bulgarian rebellion against the Ottoman Empire. In the Russo-Turkish War (1877–1878), the Russian Empire overcame the Ottomans. In 1878, Bulgaria became, in part, independent, although the Ottomans controlled its foreign policy. === 20th century === Bulgaria pulled away from Ottoman Empire's influence with the help of the Russian Empire who were already fighting the Ottomans. But it was not until 1908 that the whole country of Bulgaria was united as modern Bulgaria. Bulgaria joined the side of Germany in World War I and lost. Bulgaria had hoped to get part of the lands Bulgaria lost in the Balkan Wars. During the first year of World War II Bulgaria said it was neutral and refused to join sides with Nazi Germany or the Soviet Union. Bulgaria's military and economy were had a close connection with Germany. Bulgaria's leaders signed the Tripartite Pact with Germany in March 1941. This let German forces go through Bulgaria to reach Greece. Bulgaria's troops invaded Greece and Yugoslavia just after the governments of those countries surrendered. Bulgaria occupied the lands of modern North Macedonia and parts of Greece. (Both areas had been part of Bulgaria before the Balkan Wars.) The Bulgarian government also sent Jews to concentration camps and ghettoes in the Holocaust. The king of Bulgaria, Tsar Boris III, died after talking to Hitler in August 1943. Before the Tsar died, the Kingdom of Bulgaria had sent at least 11,343 Jews to the extermination camps. In 1944 when it became clear that the Allied Powers would win the war, Bulgaria had to find another solution. Their leaders declared that they withdrew from the Axis forces and helped the German army leave the Balkans through Bulgaria. The Soviet Union didn't respect Bulgaria's claim to be neutral. The Red Army invaded Bulgaria in September 1944. At the same time, a new pro-Soviet government took power in Sofia. At this point, the Jews were released from the ghettoes and concentration camps in Bulgaria. The new government joined the Allies, and the military started to attack the German army, which the Bulgarian government had helped to leave Bulgarian lands. The Soviets replaced the royal monarchy with Communism in 1947 before they withdrew from Bulgaria in 1949. For 40 years, under their leader Todor Zhivkov, Bulgaria was very close to the Soviet Union and followed their instructions. Bulgaria invaded Czechoslovakia to stop the Prague Spring in 1968. Shortly after the fall of the Berlin Wall, on 10 November 1989, the Bulgarian Communist Party gave up their rule and allowed the country to elect leaders of their own choice. In a few years, Bulgaria had serious money problems under the new socialist government. Since that time Bulgaria has managed to recover. ==Economy and Social Welfare== Bulgaria's economy was dependent on the COMECON market. This was a group of communist countries (Soviet Union, Bulgaria, Czechoslovakia, Hungary, Poland, and Romania) that agreed to work together. This group fell apart in 1989 with the fall of communism in Europe. While this was good for personal freedom, it was too much of a change for the businesses and jobs. Also, Yugoslavia, their neighbor, fell into a civil war as their country broke apart, and that did not help Bulgaria. Living standards fell by 40 percent as people lost their jobs and their savings were not worth much, and even some newborn babies were sent to orphanages when their parents could not take care of them. In 1994 Bulgaria had a short economic boom. But that slowed down in 1996 from bad finance deals and other banking problems. In 1997 there was high inflation (the money could not buy as much as it did before). Retired people had little income (their pension did not go up as fast as inflation did) and their savings were not worth very much. Many retired people were begging in the streets for food. But since then the economy has grown steadily. People from outside the country started putting money into businesses and houses, and Bulgarians learned how to make their own businesses. The state no longer has free healthcare. This system has been replaced by an insurance plan that people pay for, and drug costs are based on income. Private healthcare is encouraged nowadays. Help for people who lose their jobs is no longer automatic, but some help is available, based on family status and length of unemployment. The retirement age for men is 64 years and for women 61 years. It will be 63 years and 9 months for woman and 65 years and 3 months for man. ==Provinces== Since 1999, Bulgaria has been divided into 28 provinces or regions. Each province is named after its local capital. The provinces are divided into municipalities, there are 264 in total. Province Population (Census 2001)http://www.nsi.bg/EPDOCS/Census2011final.pdf Census 2011 PDFhttp://censusresults.nsi.bg/Welcome.aspx Census 2011 Population (Census 2011) Population growth (2001/2011) Land area (km²) Population density (/km²) Municipalities Blagoevgrad 341,173 323,552 -5.2% 6,478 49.95 14 Burgas 423,547 415,817 -1.8% 7,618 54.58 13 Dobrich 215,217 189,677 -11.9% 4,700 40.36 8 Gabrovo 144,125 122,702 -14.9% 2,053 59.77 4 Haskovo 277,478 246,238 -11.3% 4,033 61.06 11 Kardzhali 164,019 152,808 -6.8% 4,032 37.90 7 Kyustendil 162,534 136,686 -15.9% 3,027 45.16 9 Lovech 169,951 141,422 -16.8% 4,134 34.21 8 Montana 182,258 148,098 -18.7% 3,595 41.20 11 Pazardzhik 310,723 275,548 -11.3% 4,393 62.72 11 Pernik 149,832 133,530 -10.9% 2,377 56.18 6 Pleven 311,985 269,752 -13.5% 4,216 63.98 11 Plovdiv 715,816 683,027 -4.6% 5,973 114.35 18 Razgrad 152,417 125,190 -17.9% 2,648 47.28 7 Ruse 266,157 235,252 -11.6% 2,616 89.93 8 Shumen 204,378 180,528 -11.7% 3,365 53.65 10 Silistra 142,000 119,474 -15.9% 2,862 41.74 7 Sliven 218,474 197,473 -9.6% 3,646 54.16 4 Smolyan 140,066 121,752 -13.1% 3,532 34.47 10 Sofia-Capital 1,170,842 1,291,591 +10.3% 1,349 957.44 1 Sofia (province) 273,240 247,489 -9.4% 7,277 34.01 22 Stara Zagora 370,615 333,265 -10.1% 4,959 67.20 11 Targovishte 137,689 120,818 -12.3% 2,735 44.17 5 Varna 462,013 475,074 +2.8% 3,819 124.40 12 Veliko Tarnovo 293,172 258,494 -11.8% 4,684 55.19 10 Vidin 130,074 101,018 -22.3% 3,071 32.89 11 Vratsa 243,036 186,848 -23.1% 4,098 45.59 10 Yambol 156,070 131,447 -15.8% 4,209 31.23 5 ==Society== File: Downtown Sofia Boby Dimitrov 1.jpg| File: Tvarditsa wind turbines.jpg| File:Veleka-sinemorets-mouth-dinev.jpg| File:Dinevi marina at St Vlas resort.jpg| Development region Area (km2) Population (Census 2011) Most populous urban center Severen tsentralen 14,974 848,863 Rousse Severoiztochen 14,487 952,264 Varna Severozapaden 19,070 835,587 Pleven Yugoiztochen 19,798 1,059,359 Burgas Yugozapaden 20,306 2,199,712 Sofia Yuzhen tsentralen 22,365 1,455,449 Plovdiv Bulgaria 111,000 7,351,234 Sofia (1,359,520) There are 6 Bulgarian development regions of 27 smaller provinces. See List of settlements in Bulgaria for a list of all large locations. In Bulgaria there are 5,664,624 citizens of Christian Bulgarians and Muslim Pomaks, 1,200,000 citizens of Muslim Turks and Crimean Tatarians and 800,000 Citizens of Christian and Muslim Roma/Gypsies. Bulgaria is classified as a developing country by the EU. * Number of people living in Bulgaria: 7,351,234 * Female: 3,770,897 (51%) * Male: 3,580,337 (49%) * Those living in cities: 5,357,633 (73%) * Those living in villages: 1,993,601 (27%) * Number of dwellings (houses, apartments, summer house/villa, any place where people can live): 3,898,688 * Number of households (people living together - families, roommates, etc.): 2,826,740 ==Marine waters== The exclusive economic zone of Bulgaria in the Black Sea covers an area of 35,410 km2. The boundaries of the exclusive economic zone in the Black Sea between Bulgaria and Turkey were agreed in 1997. An agreement on the boundaries of the exclusive economic zone between Bulgaria and Romania in the Black Sea is yet to be signed. ==Related pages== * List of rivers of Bulgaria ==References== Category:Bulgaria Category:European Union member states",
 "title": "Bulgaria"
}