{
 "id": "159386",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. His brother Koichi Hashiratani also played for the Japan national team. ==Biography== Hashiratani was educated at and played for Kyoto Commercial High School and Kokushikan University. He played as defender and defensive midfielder. He joined Japan Soccer League side Nissan Motors in 1987. From 1988 to 1990, the club won all three major title in Japan; Japan Soccer League, JSL Cup and Emperor's Cup for 2 years in a row. In 1990s, the club won 1990 JSL Cup, 1991 and 1992 Emperor's Cup. In Asia, the club won 1991–92 Asian Cup Winners' Cup. He moved to Verdy Kawasaki in 1992 when professional league J1 League was founded. The club won the J1 League champions in 1993 and 1994. The club also won 1992, 1993, 1994 J.League Cup and 1996 Emperor's Cup. He was a central player in golden era in both clubs history. He retired in 1998. He was selected Best Eleven for 6 years in a row (1989/90-1995). Hashiratani was capped 72 times and scored 6 goals for the Japanese national team from 1988 to 1995. He was a member of the Japan team for the 1992 Asian Cup which Japan won. He was the captain when Japan's hope to play in the 1994 World Cup finals was dashed by a late Iraqi equaliser in the final qualifier, the match that the Japanese fans now refer to as the \"Agony of Doha\" (ドーハの悲劇). He succeeded Takeshi Okada as the manager of Consadole Sapporo at the beginning of the 2002 season. However, he was sacked after only seven matches. The club was relegated to J2 League that season. Then he coached Kokushikan University and Urawa Reds. He was an assistant coach at Tokyo Verdy from 2006 to 2007. He was promoted to the manager of the club in 2008 but fired by the Verdy after the season. He would later return in 2010 to coach Kokushikan University. He was called back to professional managing once more, as he was announced to lead Mito HollyHock from the 2011 season. After poor results leaving Mito in the relegation zone, he was sacked in the middle of the 2015 season. He was signed to manage J3 League-team Gainare Tottori from the 2016 season, but he lasted only season before signing for Japan Football League's Vanraure Hachinohe. He resigned end of 2017 season. He signed with Giravanz Kitakyushu as Hitoshi Morishita successor in June 2018. The club finished 2018 season at the bottom place of 17 club and he resigned end of 2018 season. ==Statistics== |- |1987/88||rowspan=\"5\"|Nissan Motors||rowspan=\"5\"|JSL Division 1||12||0||||||0||0||12||0 |- |1988/89||22||0||||||5||0||27||0 |- |1989/90||21||2||||||4||0||25||2 |- |1990/91||20||0||||||4||0||24||0 |- |1991/92||22||0||||||3||0||25||0 |- |1992||rowspan=\"7\"|Verdy Kawasaki||rowspan=\"7\"|J1 League||colspan=\"2\"|-||5||0||11||0||16||0 |- |1993||31||3||2||0||1||0||34||3 |- |1994||40||2||2||0||3||0||45||2 |- |1995||46||5||2||0||colspan=\"2\"|-||48||5 |- |1996||22||2||0||0||10||0||32||2 |- |1997||16||0||2||0||3||0||21||0 |- |1998||28||1||3||0||2||0||33||1 280||15||16||0||46||0||346||11 280||15||16||0||46||0||346||11 |} Japan National Football Team Database |- |1988||5||1 |- |1989||10||0 |- |1990||6||1 |- |1991||2||1 |- |1992||11||0 |- |1993||14||2 |- |1994||9||1 |- |1995||15||0 |- !Total||72||6 |} ==References== ==Other websites== * Category:1964 births Category:Living people Category:Footballers from Kyoto Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:Yokohama F. Marinos players Category:Tokyo Verdy players Category:1995 King Fahd Cup players Category:1992 AFC Asian Cup players Category:AFC Asian Cup-winning players",
 "title": "Tetsuji Hashiratani"
}