{
 "id": "159400",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Sorimachi was educated at and played for Shimizu Higashi High School and Keio University. At the high school, he won the national high school championship with his teammates Shigeo Sawairi and Tatsuya Mochizuki. Sorimachi began his senior career with Japan Soccer League side All Nippon Airways in 1987. He helped All Nippon Airways gain promotion to the top flight in 1988. When Japan's first-ever professional league J1 League started in 1992, All Nippon Airways was transformed to Yokohama Fl端gels for whom he continued to play. While at Fl端gels, he won the 1993 Emperor's Cup. He moved to Bellmare Hiratsuka in 1994. He helped the club to win the 1994 Emperor's Cup, and the 1995 Asian Cup Winners' Cup. Sorimachi was capped 4 times for the Japan national team between 1990 and 1991. His first international appearance came on July 27, 1990 in a friendly against South Korea. He also played at 1990 Asian Games. After retirement, in 2001, Sorimachi signed with J2 League club Albirex Niigata and became a manager. In 2003, the club won the champions and was promoted to J1 League. He resigned end of 2005 season. In July 2006, he became a manager for Japan U-23 national team. He also served as assistant coach for Japan football team under manager Ivica Osim and Takeshi Okada until July 2007. At 2008 Summer Olympics qualifiers, he led U-23 Japan to won qualify for 2008 Summer Olympics. However at 2008 Summer Olympics, Japan lost all 3 matches. In 2009, he signed with his former club Shonan Bellmare (former Bellmare Hiratsuka). In 2009, the club won the 3rd place in J2 and was promoted to J1. However the club finished at the bottom place in 2010 and was relegated to J2 in a year. In 2012, he moved to Matsumoto Yamaga FC which was promoted to J2 from 2012 season. In 2014, the club won the 2nd place and was promoted to J1. However the club was relegated to J2 in a year. In 2018, the club won the champions and was promoted to J1 again. However the club was relegated to J2 in a year and he resigned end of 2019 season. ==Statistics== |- |1987/88||rowspan=\"5\"|All Nippon Airways||JSL Division 2||25||11||||||4||0||29||11 |- |1988/89||rowspan=\"4\"|JSL Division 1||17||3||||||0||0||17||3 |- |1989/90||20||3||||||2||0||22||3 |- |1990/91||22||3||||||4||0||26||3 |- |1991/92||21||1||||||1||0||22||1 |- |1992||rowspan=\"2\"|Yokohama Fl端gels||rowspan=\"2\"|J1 League||colspan=\"2\"|-||2||1||5||0||7||1 |- |1993||26||1||3||1||6||2||35||4 |- |1994||rowspan=\"4\"|Bellmare Hiratsuka||rowspan=\"4\"|J1 League||25||0||2||0||1||0||28||0 |- |1995||21||3||2||0||colspan=\"2\"|-||23||3 |- |1996||14||1||1||0||1||0||16||1 |- |1997||22||4||1||1||1||0||24||5 213||34||11||3||25||2||249||39 213||34||11||3||25||2||249||39 |} Japan National Football Team Database |- |1990||2||0 |- |1991||2||0 |- !Total||4||0 |} ==References== ==Other websites== * Category:1964 births Category:Living people Category:Footballers from Saitama Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:Yokohama Fl端gels players Category:Shonan Bellmare players",
 "title": "Yasuharu Sorimachi"
}