{
 "id": "159507",
 "text": "The British Rail Class 465 \"Networker\" electric multiple units were made by Metro Cammell and BREL. It was made from 1991 to 1994. They were operated by Network South East in 1991, They're now operated by Southeastern. They are mostly used on suburban routes serving the South East of England. In 2025 unit 465908 was painted into Network South East livery and it was named after Chris Green who was the former managing director of Network South East, this was done for the 200th anniversary of the modern railway. ==Fleet details== Units: Class Operator Qty. Year built Cars per unit Manufacturer Unit nos. Notes 465/0 Southeastern 50 1991–1993 4 BREL/ABB 465001–465050 Includes 465301, built in 1992 as demonstrator for the Universal Networker; renumbered 465031 when placed in normal service. 465/1 Southeastern 47 1993–1994 ABB 465151–465197 465/2 Romic 1 1991–1993 Metro-Cammell 465237 Stored 15 465235–465236, 465238–465250 Scrapped 2 vehicles 465235 465/9 Southeastern 24 465901–465904, 465906–465914, 465916, 465919, 465922-465929, 465932, Converted from 465/2 units (465201–465234) 465/9 Stored 10 465905, 465915, 465917-465918, 465920-465921, 465930-465931, 465933-465934 Converted from 465/2 units (465201–465234) Vehicle number ranges: Class Motor vehicles Trailer vehicles 465/0 64759–64858 72028–72172 465/1 65800–65893 72900–72993 465/2 65734–65749, 65784–65799 72787–72818 465/9 65700–65733, 65750–65783 72719–72786 ==Gallery == File:465034 at Waterloo East.JPG|Class 465/0, no. 465034 at Waterloo East on 19 July 2003. This unit carries original Network SouthEast livery. File:MetCam and Brel at CX.jpg|A Metro-Cammell unit (left) coupled cab-to-cab with a BREL unit (right). BREL-built units have air vents above some saloon windows; Metro-Cammell units do not. File:465020 at Waterloo East.jpg|Class 465/0, no. 465020 at Waterloo East on 25 January 2003. This unit carries Connex Networker livery. File:465237 at Waterloo East.jpg|Class 465/2, no. 465237 at Waterloo East on 25 January 2003. This unit carries South Eastern Trains livery. ==Notes== ==References== ==Other websites== 465 465",
 "title": "British Rail Class 465"
}