{
 "id": "159600",
 "text": "Ion Victor Antonescu (15 June 1882 – 1 June 1946) was a Nazi-allied Prime Minister of Romania, who called himself Conducător and ruled from 4 September 1940 * * * * until 23 August 1944, * * * when he was toppled in a coup. He was executed for war crimes in 1946. * International Commission on the Holocaust in Romania. Final Report. President of the commission: Elie Wiesel. Edited by Tuvia Friling, Radu Ioanid, and Mihail E. Ionescu. Iași: Polirom, 2004. * Ioanid, Radu. The Holocaust in Romania: The Destruction of Jews and Roma under the Antonescu Regime, 1940–1944. Second edition. Published in association with the United States Holocaust Memorial Museum. Lanham, MD: Rowman & Littlefield, 2022. * Kruglov, Aleksander, and Kiril Feferman. “Bloody Snow: The Mass Slaughter of Odessa Jews in Berezovka Uezd in the First Half of 1941.” Yad Vashem Studies 47, no. 2 (2019): 15. * Solonari, Vladimir. A Satellite Empire: Romanian Rule in Southwestern Ukraine, 1941–1944. Ithaca, NY: Cornell University Press, 2019. * Zipperstein, Steven J. The Jews of Odessa: A Cultural History, 1794–1881. Stanford, CA: Stanford University Press, 1985. ==Role in the Holocaust== When he was in charge of Romania and southern Ukraine, he actively facilitated IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. the Holocaust for Nazi Germany. * * * * * As many as 400,000 Jewish deaths could be attributed to his orders. Particularly, some considered the Odessa massacre, which killed as many as 100,000 Jews and reduced Odessa's Jews by 98.7%, as the worst massacre of Jews in the Romanian- occupied zone during WWII. * * * The Holocaust in Romanian-occupied zone only stopped after he was toppled in a coup led by King Michael I of Romania on 23 August 1944. * * * ==Related pages== * Genocide * Iron Guard * Iași pogrom * Antisemitism * Kingdom of Romania ==References== Category:Racism Category:Fascism Category:Romania Category:Christianity Category:1882 births Category:World War II Category:1946 deaths Category:Antisemitism Category:20th century Category:The Holocaust Category:Anti-communists Category:Former dictators Category:Romanian generals Category:Holocaust perpetrators Category:Prime Ministers of Romania Category:People executed by firearm Category:Eastern Orthodox Christians Category:Recipients of the Knight's Cross Category:Military personnel of World War I",
 "title": "Ion Antonescu"
}