{
 "id": "160382",
 "text": "This page lists every electric-powered multiple unit allocated a TOPS classification or used on the mainline network since 1948 (i.e. British Railways and post-privatisation). British Rail operated a wide variety of electric multiple units for use on electrified lines. * AC units operate off 25 kV alternating current (AC) from overhead wires. Where clearances for the overhead wires on the Great Eastern Main Line and London, Tilbury and Southend railway routes were below standard, a reduced voltage of 6.25 kV AC was used. The Midland Railway units used 6.6 kV AC. Under the computer numbering, AC units (including mixed-voltage units that can also work off a DC supply) were given a class in the range 300-399. * DC units operate off 650-850 V direct current (DC) from a third rail on the Southern Region and North London, Merseyside and Tyneside networks. The Manchester-Bury Railway line used 1,200 V DC from a side-contact third rail. The Manchester South Junction & Altrincham and \"Woodhead\" and initially the Great Eastern Railway routes used 1,500 V DC from overhead wires. Under the computer numbering, DC units were given a class in the range 400-599. ==AC EMUs and dual-voltage EMUs== === First generation === TOPS class Pre-TOPS class Name or Information Image Ex-MR units Lancaster-Morecambe-Heysham Class 300 Proposed parcels units AM1 25kV AC prototype units Class 302 AM2 London-Tilbury-Southend Class 303 AM3 Strathclyde Class 304 AM4 Greater Manchester, Liverpool, Birmingham Class 305 AM5 Chingford, Enfield Class 306 AM6 Shenfield (inner-suburban) Class 307 AM7 Southend (outer-suburban) Class 308 AM8 Eastern Region lines Class 309 AM9 Clacton Express Class 310 AM10 Euston outer-suburban Class 311 AM11 Strathclyde ===Second generation=== TOPS class Built for Current Operator(s) Builder Number built Image Class 312 BR Eastern Region (Great Eastern and Great Northern suburban) and BR London Midland Region (Euston suburban) (out of service) BREL York 1966-74 49 x 4-car sets Class 313 BR Eastern Region (Great Northern suburban) London Overground, First Capital Connect BREL York 1975-78 64 x 3-car sets Class 314 BR Scottish Region (Argyle Line) First ScotRail BREL York 1979 16 x 3-car sets Class 315 BR Eastern Region (Great Eastern suburban) National Express East Anglia BREL York 1980-81 61 x 4-car sets Class 316 (I) (AC Networker prototype) (never used in passenger service, now out of service) converted from class 210 and 313 cars 1 x 4-car set Class 316 (II) (test unit) (never used in passenger service, now out of service) converted from class 307 1 x 3-car set Class 317 Network SouthEast ('Bedpan' and Great Northern lines) National Express East Anglia, First Capital Connect BREL York 1981-85 72 x 4-car sets Class 318 Provincial ScotRail (for Strathclyde PTE) First Scotrail BREL York 1985-87 21 x 3-car sets Class 319 Network SouthEast (Thameslink services) First Capital Connect, Southern, Northern BREL York 1985-88 86 x 4-car sets Class 320 Provincial ScotRail (for Strathclyde PTE) First ScotRail BREL York 1986 22 x 3-car sets Class 321 Network SouthEast (Great Eastern and Euston services); and Regional Railways (for West Yorkshire PTE) National Express East Anglia, Northern Rail, London Midland BREL York 1986-89 117 x 4-car sets Class 322 Network SouthEast (Stanstead Express service) First ScotRail BREL York 1988-90 5 x 4-car sets Class 325 Rail Express Systems (for Royal Mail) FirstGBRf ABB Derby 1995 16 x 4-car units ===Modern Generation=== These use electrical switching devices (thyristors and transistors) and have electronic power control. TOPS class Built for Current Operator(s) Builder Number Built Image Class 323 Regional Railways (for West Midlands PTE and Greater Manchester PTE) Northern Rail, London Midland Hunslet 1992-93 43 x 3-car sets Class 331 original classification of Class 332 - - - Class 332 Heathrow Express Heathrow Express Siemens/CAF 1997-2002 9 x 4-car sets 5 x 5-car sets Class 333 Arriva Trains Northern (for West Yorkshire PTE) Northern Rail Siemens/CAF 2001-03 18 x 4-car sets Class 334 Juniper ScotRail (for Strathclyde PTE) First ScotRail Alstom Birmingham 1999-2001 40 x 3-car sets Class 341 Networker proposed units for Crossrail - (never built) - Class 342 Networker proposed units for CTRL Domestic Services - (never built) Class 345 Aventra Crossrail Crossrail (TfL Rail) Bombardier Derby 2016-2019 70 x 9-car sets (initially 7-car sets until 2019) Class 350 Desiro Silverlink, Central Trains London Midland Siemens 2004-05 30 x 4-car sets Class 357 Electrostar LTS Rail c2c Adtranz/Bombardier Derby 1999-2002 74 x 4-car sets Class 360 Desiro First Great Eastern, Heathrow Connect National Express East Anglia, Heathrow Connect Siemens 2002-06 21 x 4-car sets 5 x 5-car sets Class 365 Networker Network SouthEast (Great Northern and South Eastern services) First Capital Connect ABB York 1994-95 41 x 4-car sets Class 371 Networker proposed units for Thameslink 2000 - (never built) - Class 375 Electrostar Connex South Eastern, South Eastern Trains Southeastern Adtranz/Bombardier Derby 1999-2004 10 x 3-car sets 102 x 4-car sets Class 376 Electrostar South Eastern Trains Southeastern Bombardier Derby 2004-05 36 x 5-car sets Class 377 Electrostar Southern Southern Bombardier Derby 2001-05 28 x 3-car sets 154 x 4-car sets Class 378 Capitalstar London Overground London Overground Bombardier Derby 2008-2011 Class 380 Desiro First ScotRail (not yet in service) Siemens (under construction) Class 381 Networker proposed Network SouthEast express units - (never built) - ===High Speed Trains=== TOPS class Built for Current Operator(s) Builder Number Built Image Class 370 APT-P prototype Advanced Passenger Train (out of service) BREL Derby 1979 6 x 7-car half sets 2 spare cars Class 373 TGV Eurostar Eurostar IZY various builders 1992-95 14 x 8-car half sets 64 x 10-car half sets 1 spare car Class 390 Pendolino Virgin West Coast Avanti West Coast Alstom Birmingham 2001-05 53 x 9-car sets Class 395 Javelin Southeastern Southeastern Hitachi2007-009 29 x 6-car sets ==DC EMUs== ===Southern Region units=== The Southern Railway and its successor, the Southern Region of British Rail, used three letter codes to classify their DC EMU fleets, as shown after the TOPS class numbers. ====Pre-Nationalisation==== TOPS class SR class Name or Information 2Nol 2SL South London 2Wim Wimbledon- Croydon 3Sub 4Buf 4DD Double Deck EMU 4Gri 4Lav 4Res 6Cit London Bridge- Brighton 6Pan Pantry units 6Pul Pullman London Victoria-Brighton Class 401 2Bil Class 402 2Hal 2Pan Class 403 5Bel Class 404 4Cor Class 405 4Sub ====Mark 1 and 2 Bodyshell==== TOPS class SR class Name or Information Class 410 4Bep Class 411 4Cep Class 412 4Bep Class 413 4Cap 2 x 2Hap permanently coupled Class 414 2Hap Class 415 4EPB Class 416 2EPB Class 418 2Sap 2Hap units with declassified 1st Class accommodation Class 419 MLV London-Dover/Folkestone boat trains Class 420 4Big Class 421 4Cig 3Cop 2 units still in use, on Lymington Branch Line Class 422 4Big 8Dig Class 423 4Vep 4Vop Class 427 4Veg First stock used for Gatwick Express Class 430 4Rep Class 431 6Rep Class 432 4Rep Class 438 3TC 4TC Class 480 8Vab Class 482 (I) 8Mig Class 488 Gatwick Express Trailers Class 489 GLV Gatwick Express driving trailers Class 499 TLV ====Tube stock==== TOPS class SR class Name or Information Image Class 482 (II) Waterloo & City Line sold to LU Class 483 Isle of Wight ex LU 1938 stock Class 485 4Vec ex LU Standard stock Class 486 3Tis ex LU Standard stock Class 487 Waterloo & City Line ====Modern EMUs==== TOPS class SR class Name or Information Image Class 424 Networker Classic Prototype Class 442 5Wes Wessex Express Class 444 5Des Desiro Class 445 4Pep Second Generation EMU prototype - 4 car Class 446 2Pep Second Generation EMU prototype - 2 car Class 447 Proposed Battersea Bullet Class 450 4Des Desiro Class 455 Class 456 Class 457 DC Networker prototype Class 458 4Jop Juniper Class 460 8Gat Juniper - Gatwick Express Class 465 Networker - 4 car Class 466 Networker - 2 car Class 471 Proposed Networker - Main Line Express ===Other DC units=== The 500 series classes were reserved for DC (third/fourth rail) EMUs not from the Southern Region. This included the DC (third/fourth rail) lines in North London, Merseyside and Greater Manchester. The DC electric network around Tyneside had been de-electrified by the time TOPS was introduced, and the stock withdrawn or transferred to the Southern Region. TOPS classes Class Info Image Class 501 North London stock Class 502 Liverpool-Southport-Ormskirk stock Class 503 Mersey-Wirral stock Class 504 Manchester-Bury stock Class 505 Manchester-Altrincham stock Class 506 Manchester-Hadfield/Glossop stock Class 507 Merseyside stock Class 508 Merseyside stock Class 510 Original classification of Class 455 Pre-TOPS classes * Ex-LNER Units (Tyneside stock) * Ex-LNWR Units (North London stock) * Ex-LYR Units (Manchester-Bury stock) ==Battery electric multiple unit (BEMU)== This was a one-off unit, withdrawn before the introduction of TOPS. * 79998/79999 ==Related pages== * British Rail locomotive and multiple unit numbering and classification * SR multiple unit numbering and classification * British Rail coach designations ==References== ==Other websites== * The Railway Centre * departmentals.com Classes Category:British railway-related lists",
 "title": "List of British Rail electric multiple unit classes"
}