{
 "id": "160423",
 "text": "The British Rail Class ES1 was a class of two electric locomotives commissioned by the North Eastern Railway in 1902. They were of steeplecab design. == History == There was a short railway from Trafalgar Yard in Manors East to Newcastle Quayside that was opened in 1870. Shaped like a horseshoe, it had tight corners, small tunnels and steep slopes. As steam locomotives and their crews found it hard, the NER wanted this railway electrified. Thus, on 5 June 1905, electric operations started. For this purpose, two electric locomotives were built. They were able to operate on both overhead wires and third rail. This is because third rail is dangerous for workers in yards to walk over, and the small tunnels did not have room for the overhead wires. Train crews found these electric engines too cold during early work shifts. This was because crews were used to the heat from steam locomotives. To fix this problem, heaters were added to the cab in 1906. The nose-fitted bow collector was changed to the roof-mounted pantograph sometime after the First World War. In 1945, both engines were properly known as class ES1. They were simply known as numbers 1 and 2 until then. The London and North Eastern Railway changed numbers for both locomotives to 6480 and 6481 in 1946. This was changed again by British Railways in 1948, this time to 26500 and 26501. In June 1961, number 26500 was recoloured from black to bright green. 26501 also received this same colour in March 1962. Both locomotives had this colour when built in 1904. On 29 February 1964, British Railways stopped using electric operations on the Quayside Branch. Class 03 diesels were used instead, until the line was closed on 16 June 1969. The two ES1 locomotives were then put aside at Hellifield sheds in January 1965. Number 26501 was thrown away and recycled in April 1966. 26500 ended up in the Leicester museum, which was closed in 1975. It was then moved to the National Railway Museum in York. It is on display at the Locomotion Museum in Shildon since October 2004 when the venue opened. == Related pages == * British Rail Class EE1 * British Rail Class EF1 * British Rail Class EB1 * NER electric units == Sources == === Books === * * * * == Other websites == * The NER Electric Bo-Bo Class ES1 Locomotives - LNER Encyclopedia ES1 Category:Bo-Bo locomotives",
 "title": "British Rail Class ES1"
}