{
 "id": "160485",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Sogahata was born in Kashima on August 2, 1979. He joined J1 League club Kashima Antlers based in his local from youth team in 1998. He debuted against Avispa Fukuoka on May 8, 1999 and played several matches until 2000. Although he could not play many matches behind Japan national team player Daijiro Takakuwa until 2000, Sogahata played in semifinals and final at 2000 J.League Cup and Antlers won the champions. He was also selected \"New Hero Awards\". In 2001, he became a regular goalkeeper instead Takakuwa and Sogahata played as regular goalkeeper for long time. Antlers won the champions in 2001 J1 League for 2 years in a row. In 2002 season, he was selected Best Eleven award. Antlers also won the champions in 2002 J.League Cup. In 2007, Antlers won the champions in J1 League for the first time in 6 years. Antlers also won the champions in 2007 Emperor's Cup. Antlers won the champions in J1 League for 3 years in a row (2007-2009). From 2010 season, Antlers won the champions 2010 Emperor's Cup, 2011 and 2012 J.League Cup. He also played all matches from 2008 season to 2014 season. He played for 244 consecutive matches until last match in 2014 season which is J1 League record. In 2015, although he could not play all matches in J1 League, Antlers won the champions in J.League Cup. In 2016, Antlers won the champions in J1 League and qualified for 2016 Club World Cup as host country champions. At Club World Cup, he played all 4 matches and won the 2nd place. In 2017, Antlers gained new goalkeeper Kwoun Sun-tae and Sogahata battles for the position with Kwoun Sun- tae. However Sogahata could not play many matches behind Kwoun Sun-tae from 2017. In 2018 AFC Champions League, he played 4 matches and Antlers won the champions first Asian title in the club history. He retired end of the 2020 season. On November 7, 2001, Sogahata debuted for the Japan national team against Italy. However he could not play many matches behind Yoshikatsu Kawaguchi and Seigo Narazaki. Sogahata was a member of Japan for 2002 World Cup. He played 3 games for Japan until 2003. In August 2004, Sogahata was selected the Japan U-23 national team as over aged player for 2004 Summer Olympics. At this tournament, he played full time in all 3 matches. ==Statistics== |- |1998||rowspan=\"23\"|Kashima Antlers||rowspan=\"23\"|J1 League||0||0||0||0||0||0||colspan=\"2\"|-||0||0 |- |1999||4||0||0||0||0||0||colspan=\"2\"|-||4||0 |- |2000||2||0||1||0||3||0||colspan=\"2\"|-||6||0 |- |2001||21||0||2||0||6||0||colspan=\"2\"|-||29||0 |- |2002||30||0||5||0||3||0||5||0||43||0 |- |2003||30||0||4||0||5||0||0||0||39||0 |- |2004||27||0||3||0||6||0||colspan=\"2\"|-||36||0 |- |2005||34||0||3||0||4||0||colspan=\"2\"|-||41||0 |- |2006||22||0||4||0||3||0||colspan=\"2\"|-||29||0 |- |2007||32||0||5||0||10||0||colspan=\"2\"|-||47||0 |- |2008||34||0||2||0||2||0||8||0||46||0 |- |2009||34||0||4||0||2||0||7||0||47||0 |- |2010||34||0||6||0||2||0||7||0||49||0 |- |2011||34||0||3||0||3||0||7||0||47||0 |- |2012||34||0||4||0||9||0||colspan=\"2\"|-||47||0 |- |2013||34||0||3||0||6||0||colspan=\"2\"|-||43||0 |- |2014||34||0||1||0||5||0||colspan=\"2\"|-||40||0 |- |2015||24||0||0||0||5||0||6||0||35||0 |- |2016||34||0||6||0||2||0||colspan=\"2\"|-||42||0 |- |2017||23||0||3||0||1||0||1||0||28||0 |- |2018||7||0||3||0||4||0||4||0||18||0 |- |2019||4||0||4||0||1||0||1||0||10||0 |- |2020||1||0||colspan=\"2\"|-||1||0||0||0||2||0 533||0||66||0||83||0||46||0||728||0 533||0||66||0||83||0||46||0||728||0 |} Japan National Football Team Database |- |2001||1||0 |- |2002||1||0 |- |2003||2||0 |- !Total||4||0 |} ==References== ==Other websites== * Category:1979 births Category:Living people Category:Footballers from Ibaraki Prefecture Category:Japan international footballers Category:J1 League players Category:Kashima Antlers players Category:2002 FIFA World Cup players Category:Footballers at the 2004 Summer Olympics",
 "title": "Hitoshi Sogahata"
}