{
 "id": "160425",
 "text": "The British Rail Class EE1 was an electric locomotive commissioned by the North Eastern Railway in 1922. Ownership passed to the London and North Eastern Railway in 1923 and to British Railways in 1948. == History == === Background === The main line between York and Newcastle upon Tyne was the North Eastern Railway's primary route. It was so busy that upgrades to the line were necessary. Doubling it would meet some challenges, so electrification was the solution. Electric traction presented a 26% cost decrease compared to steam locomotives. Additionally, the NER stated that five electric engines can do the work of 13 steam engines. === Construction and career === The design for a 1,800 hp locomotive was made in 1920. A year later, construction was ordered. In May 1922, locomotive No.13 emerged from Darlington Works. Metropolitan Vickers provided the electrical parts. The locomotive's body shape was similar to that of the EF1s working on the Shildon coal railway. Plans for the electrification of the York-Newcastle line was shelved in 1923. This was due to economic problems, and 's little enthusiasm in carrying on the project. With no use found for number 13, it was put into storage at Darlington Works. It was recoloured green for the centenary of the Stockton and Darlington Railway in 1925. The locomotive was sometimes brought out for a select few railway events as an exhibit. Eventually, the engine ended up at South Gosforth car sheds in 1947. Number 13 was not identified as class EE1 until 4 October 1945. In May 1946, the engine's number was changed to 6999. British Railways changed the number again to 26600 in 1948. On 21 August 1950, British Railways made its decision to throw away the sole EE1. The locomotive was towed by a steam locomotive to Rotherdam on 15 December. It was where the electric engine was scrapped. == Related pages == * British Rail Class ES1 * British Rail Class EF1 * British Rail Class EB1 * British Rail Class 76 * British Rail Class 77 == Notes == == Sources == * * * == Other websites == * The NER Electric 2-Co-2 Class EE1 Locomotive No. 13 - LNER Encyclopedia EE1 Category:1500V DC locomotives Category:Individual locomotives",
 "title": "British Rail Class EE1"
}