{
 "id": "160488",
 "text": "Guus Hiddink (born 8 November 1946) is a Dutch football player turned manager. == Russia == Hiddink is better known as a trainer. He is a very successful trainer. He trained the Russia national team, and Zenit St. Petersburg club. He also coached the Netherlands national team (Oranje, Orange) and won several tournaments. He is generally considered one of the greatest football trainers of all time. After he made the Russian National team almost World Champion (even defeating the renowned Dutch team) he became a national Russian hero. He got a statue in Moscow and several newborn boys in Russia were given \"Guus\" as a first name to honour him. == South Korea == Hiddink has coached the Korea Republic national team in the early 2000s. He managed to get the team in the semi-finals for the first time in South Korean football history. For this, the South Koreans built a stadium in his honour. It was build in the cityn of Gwangju and was named \"Guus Hiddink Stadium\". == Chelsea == Hiddink coached the British club Chelsea in 2009. He succeeded their former coach Luiz Felipe Scolari. He did a much better job and thanks to Hiddink Chelsea made many victories. Commentators said that Hiddink: \"had rejuvenated Chelsea following Scolari's departure\". Hiddink won the FA Cup with Chelsea that year, beating Everton 2-1 in the final. ==Managerial statistics== Team From To Record G W D L GF GA GD Win % Source PSV Eindhoven 16 March 1987 30 June 1990 Fenerbahçe 1 July 1990 13 March 1991 Valencia 1 July 1991 30 November 1993 Valencia 26 March 1994 30 June 1994 Netherlands 1 January 1995 12 July 1998 Real Madrid 10 July 1998 24 February 1999 Real Betis 1 February 2000 31 May 2000 South Korea 1 January 2001 8 July 2002 PSV Eindhoven 1 August 2002 30 June 2006 Australia 22 July 2005 9 July 2006 Russia 10 July 2006 30 June 2010 Chelsea 16 February 2009 31 May 2009 Turkey 1 August 2010 16 November 2011 Anzhi Makhachkala 17 February 2012 22 July 2013 Netherlands 1 August 2014 30 June 2015 Chelsea 19 December 2015 15 May 2016 China U21/U23 10 September 2018 20 September 2019 Curaçao 22 August 2020 9 September 2021 Total ==Honours== ===Player=== De Graafschap * Tweede Divisie: 1969 San Jose Earthquakes * North American Soccer League Southern Division: runner-up 1977 ===Manager=== PSV Eindhoven * Eredivisie: 1986–87, 1987–88, 1988–89, 2002–03, 2004–05, 2005–06 * KNVB Cup: 1987–88, 1988–89, 1989–90, 2004–05 * Johan Cruyff Shield: 2003 * European Cup: 1987–88 Netherlands * FIFA World Cup Fourth place: 1998 Real Madrid * Intercontinental Cup: 1998 South Korea * FIFA World Cup Fourth place: 2002 Russia * UEFA European Championship Semi-finalist: 2008 Chelsea * FA Cup: 2008–09 Individual * Order of Sport Merit: Cheongnyong Medal * AFC Coach of the Year: 2002 * World Soccer World Manager of the Year: 2002 * Dutch Sports Coach of the Year (all sports): 2002, 2005 * Rinus Michels Award: 2005, 2006 * Coach of the Year in Russia: 2008 * In 2005 Hiddink received an honorary doctorate by the University of Seoul * The De Graafschap mascot is named Guus in honor of Hiddink who was previously associated with the team as a player and as a manager. * The Gwangju World Cup Stadium was renamed the Guus Hiddink Stadium in honor of Hiddink's performance at the 2002 FIFA World Cup. * Hiddink was named an Honorary Citizen of South Korea after reaching the 2002 FIFA World Cup semi-finals. * Hiddink was named an honorary citizen of Seoul after reaching the 2002 FIFA World Cup semi-finals. * Hiddink was named an honorary citizen of Eindhoven after winning his sixth Eredivisie title with PSV in 2006. * Hiddink was put on a stamp by Australia Post following the 2006 FIFA World Cup. * Hiddink was given a lifetime achievement award by the Royal Dutch Football Association in 2007. It was only the third such award ever given following those received by Rinus Michels and Johan Cruijff. * Sports Illustrated Team of the Decade: 2009 == References == Category:1946 births Category:Living people Category:Dutch football managers Category:Dutch footballers Category:Sportspeople from Gelderland Category:Eredivisie managers Category:Fenerbahçe football managers Category:Real Madrid CF managers Category:Valencia CF managers Category:Netherlands at UEFA Euro 1996 Category:Netherlands at the 1998 FIFA World Cup Category:South Korea at the 2002 FIFA World Cup Category:Australia at the 2006 FIFA World Cup Category:Russia at UEFA Euro 2008",
 "title": "Guus Hiddink"
}