{
 "id": "160511",
 "text": "King Michael I of Romania\"Compression\" , Time, 12 January 1948\"Milestones\" , Time, 21 June 1948Genealogy of the Royal Family of Romania , retrieved 2 October 2006 (25 October 1921 – 5 December 2017), reigned as King of Romania for two periods., literally \"His Majesty Michael I King of Romanian\". He was king from 20 July 1927 to 8 June 1930, and again from 6 September 1940, until forced to abdicate by the Communist Party of Romania. The communists were backed up by orders of Stalin to the Soviet armies of occupation on 30 December 1947. He was one of the last surviving heads of state from World War II,World War II—\"60 Years After: Former Romanian Monarch Remembers Decision To Switch Sides\", Radio Free Europe, 6 May 2005Oliver North, “Looking for Leadership” , Human Events, 14 April 2006Peter Kurth, \"Michael of Romania\" Craig S. Smith, \"Romania’s King Without a Throne Outlives Foes and Setbacks\", The New York Times, 27 January 2007 the other one is Simeon II of Bulgaria.Simeon Saxecoburggotski, Encyclopædia Britannica He died 5 December 2017 of complications from leukemia in Aubonne, Switzerland at 96 years old.Romania: Ex-king Michael who ruled during WWII dies at 96, ABC News ==Titles, styles and honours== === Titles and styles === * 25 October 1921 – 28 December 1925: His Royal Highness Prince Michael of Romania, Prince of Hohenzollern-Sigmaringen * 28 December 1925 – 20 July 1927: His Royal Highness Crown Prince Michael of Romania, Prince of Hohenzollern-Sigmaringen * 20 July 1927 – 8 June 1930: His Majesty King Michael I of Romania, Prince of Hohenzollern-Sigmaringen * 8 June 1930 – 6 September 1940: His Majesty King Michael I, The Grand Prince of Alba Iulia, Prince of Hohenzollern-Sigmaringen * 6 September 1940 - 10 May 2011: His Majesty King Michael I of Romania, Prince of Hohenzollern-Sigmaringen * 10 May 2011 - 5 December 2017: His Majesty King Michael I of Romania ===Honours=== ====National==== * House of Romania: Sovereign Knight Grand Cross with Collar of the Order of Carol I ====Foreign==== * : Grand Cross of the Order of the Legion of Honour * Russia ** : Member of the Order of Victory * : Grand Officer of the Order of the Legion of Merit ==Ancestry== He was a paternal first cousin of King Peter II of Yugoslavia and maternal first cousin of Queen Alexandra, Queen Consort of Yugoslavia, King Constantine II of Greece and his elder sister Queen Sofía, Queen Consort of Spain. He was great-great-grandson of Queen Victoria I of the United Kingdom through both of his parents and was therefore a third cousin of Queen Margrethe II of Denmark, King Harald V of Norway, King Juan Carlos I of Spain, King Carl XVI Gustaf of Sweden, Queen Elizabeth II. == Referencecs == Category:1921 births Category:2017 deaths Category:Deaths from leukemia Category:House of Romania Category:Recipients of the Order of the Legion of Honour Category:Grand Crosses of the Order of the Legion of Honour Category:Knights Grand Cross of the Royal Victorian Order Category:Kings of Romania",
 "title": "Michael I of Romania"
}