{
 "id": "160693",
 "text": "Gatwick Express is the name of a fast train service that runs on the Brighton Main Line, a railway line between Victoria station in London and the city of Brighton and Hove in South East England, stopping at Gatwick Airport on the way. It is fast because it does not stop at any stations between London Victoria and Gatwick Airport. A Gatwick Express train leaves London Victoria station every 15 minutes and takes 30 minutes to get to Gatwick Airport station. After arriving at Gatwick Airport, at least every other train on weekdays and Saturdays continues non-stop to Brighton railway station. At peak hours, every train continues to Brighton, but makes two stops between Gatwick and Brighton. On Sundays, all trains end at Gatwick Airport; there are no trains to and from Brighton. Before June 2008, Gatwick Express was a train operating company (TOC) and was a franchise owned by Southern, another TOC that has trains on other routes. On 22 June 2008, the Gatwick Express TOC was closed. Now the Gatwick Express is directly operated by Southern, but it is still called Gatwick Express. ==Trains== The Gatwick Express service has used many types of trains over the years. Most of them were designed just for the service. 73201 at Clapham Junction.JPG|The first trains to be used on Gatwick Express services were hauled by Class 73 locomotives. 9107 at Wirksworth.jpg|The Class 73 locomotives hauled two types of carriages, the Class 488 and Class 489, which were in use until 2005. Unit 460008 at East Croydon.JPG|From 1999 to 2012, Class 460s were used. The design of the ends of these trains gave them the nickname \"Darth Vaders\". Gb-emudc460005.jpg|Another Class 460 train, this one waiting at Victoria station and marked with a Continental Airlines logo. SWT 442418 and 442413 at Poole 2005-07-16 04.jpg|From 2008 to 2016, Class 442 Wessex Electrics were used. These trains were built 20 years earlier, but were later refurbished. 2 Gatwick Express interior.jpg|Inside the Class 387 trains, which replaced the older trains in 2016. There is both \"Standard Class\" and \"First Class\" seating. ==Related pages== * Heathrow Express * Stansted Express * Airport rail link Category:West Sussex Category:Railway operators in London Gatwick Category:Defunct railway companies of the United Kingdom Category:1996 establishments in England Category:2008 disestablishments in England",
 "title": "Gatwick Express"
}