{
 "id": "160763",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Hasegawa was educated at and played for Shimizu Higashi High School. He won the national high school championship with his teammates including Katsumi Oenoki and Takumi Horiike. He continued his study and football at University of Tsukuba where he won the Kanto University League title in 1987. After graduating from the university in 1988, he joined Japan Soccer League side Nissan Motors. He contributed to the club winning the Emperor's Cup twice in 1988 and 1989. When Japan's first-ever professional league J1 League started, Shimizu S-Pulse was founded in his local city. He joined the club in 1992 and re-united with his high school teammates Oenoki and Horiike. He helped the club to win the J.League Cup in 1996. He retired as a Shimizu player after the club won the second stage of the J1 League 1999 season. He played 207 league matches and scored 45 league goals in 7 seasons at Shimizu. Hasegawa was capped 27 times and scored 4 goals for the Japanese national team between 1989 and 1995. His first international appearance came on January 20, 1989 in a friendly against Iran in Teheran. He was a member of the Japan squad who participated in the 1994 World Cup qualification. In the crucial last match, Hasegawa was substituted in the 59th minute by Masahiro Fukuda and watched from the bench as a late Iraqi equaliser dashed Japan's hope to qualify for the finals in the US, a match that the Japanese fans now refer to as the \"Agony of Doha\" (ドーハの悲劇). In 2005, Hasegawa became a manager for Shimizu S-Pulse. The club finished in second place in 2005, and finished as runners-up at the 2010 Emperor's Cup and 2008 J.League Cup. He resigned at the end of the 2010 season. In 2013, he signed with J2 League club Gamba Osaka, who were relegated to J2 for 2013. The club were J2 League champions in 2013 and were promoted to J1 League. In 2014, the club won all three major titles in Japan; J1 League, J.League Cup and Emperor's Cup. The club also were the winners of the 2015 Emperor's Cup. In 2018, he moved to FC Tokyo. In 2019, the club finished in second place in J1 League. In 2020, the club won the Emperor's Cup. == Career statistics== ===Club=== Club performance Club performance Club performance League League Cup Cup League Cup League Cup Total Total Season Club League Apps Goals Apps Goals Apps Goals Apps Goals Japan Japan Japan League League Emperor's Cup Emperor's Cup J.League Cup J.League Cup Total Total 1988/89 Nissan Motors JSL Division 1 18 4 18 4 1989/90 11 5 3 0 14 5 1990/91 4 0 4 0 8 0 1992 Shimizu S-Pulse J1 League - 3 0 10 2 13 2 1993 36 10 4 1 1 0 41 11 1994 44 9 1 1 1 0 46 10 1995 21 3 0 0 - 21 3 1996 24 7 3 2 16 7 43 16 1997 30 5 1 0 6 2 37 7 1998 31 9 5 2 5 0 41 11 1999 21 2 2 1 2 1 25 3 Total Total Total 240 54 19 7 48 12 307 73 ===International=== Japan national team Japan national team Japan national team Year Apps Goals 1989 11 2 1990 6 1 1991 0 0 1992 0 0 1993 5 0 1994 2 0 1995 3 1 Total 27 4 ===Managerial=== J.League Data Site Managerial record by team and tenure Team From To Record Shimizu S-Pulse 1 February 2005 31 January 2011 Gamba Osaka 1 February 2013 31 January 2018 FC Tokyo 1 February 2018 7 November 2021 Nagoya Grampus 1 February 2022 Present Total ==References== ==Other websites== * Category:1965 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:Yokohama F. Marinos players Category:Shimizu S-Pulse players Category:1995 King Fahd Cup players Category:Shimizu S-Pulse managers",
 "title": "Kenta Hasegawa"
}