{
 "id": "160776",
 "text": "The London, Midland and Scottish Railway and the London and North Eastern Railway both developed a system of identifying carriages by means of alphabetic codes. When British Railways was formed in 1948, it decided to adopt the former LNER method of carriage classification. == Basic principles == The codes are made up from a combination of letters, some of which can indicate more than one word; their meaning can only be determined according to their position, or the presence of other letters, in the code. The letters used are: Code Meaning B Brake van (prefix) B Buffet (suffix) B Battery (prefix for multiple unit vehicles) C Composite (i.e. more than one class of accommodation) D Driving vehicle (prefix) D Disabled accommodation (suffix) E Either class of accommodation E End vehicle (suffix) F First Class G Gangwayed (e.g. BG – Brake Gangwayed) G Griddle (when following R) H Handbrake HM Half- motor (prefix on multiple units) Used for vehicles with one traction motor where the Motor type vehicle in a class usually contained two K corridor K Kitchen (when following R) L Lavatory (usually shown only in non-gangwayed or diesel multiple unit codes) L Lounge (prefix) (but see SL) M Motor (powered) vehicle M Miniature or Modular (when following R) O Open (i.e. no compartments, or no kitchen in Restaurant cars); O not included in diesel multiple unit codes as all are Open o Semi-open (i.e. mix of compartments and open) P Pantograph (prefix for electric multiple units) P Pantry (suffix) P Pullman (prefix) P Parlour (suffix for Pullman cars) R Restaurant S Second (later Standard) Class SL Sleeper T Third Class T Trailer (prefix for multiple unit vehicles) T Trolley buffet (suffix) T Tourist (prefix for hauled carriages; indicates 2+2 seating) U Unclassified accommodation Y Four-wheeled vehicle* Z Six-wheeled vehicle* * If no such suffix is shown, the vehicle is an eight or twelve-wheeled vehicle. The latter were not common, and were usually special saloons or restaurant vehicles. * If no such suffix is shown, the vehicle is an eight or twelve-wheeled vehicle. The latter were not common, and were usually special saloons or restaurant vehicles. These letters (except for Y and Z) did not usually apply to the wide variety of passenger-rated but goods carrying vans (e.g. parcels vans, horse boxes, milk and fish vans). Their codes were an acronym of their traditional railway description, e.g. GUV for General Utility Vans. == List of codes used == The following list lists those codes that were actually used on British Railways, cross-referred to the comparable code used by the LMS, with the exception that the letter S (\"Second\", later \"Standard\") is used where until 1956 the letter T (\"Third\") is used. Suffix codes Y or Z are not shown, as these could apply to variants of any or all vehicle types. In the original LNER coding system, S stood for \"Second\", an intermediate class between First and Third (which later became Second). The original Second was more or less abolished in the 1870s (as a result of the Railway Regulation Act 1844), remaining only in limited use for special services, such as those meeting ships (which retained the three-class system from which railway classifications had originated). In the 1980s, BR renamed Second to Standard. Many of the classifications listed below are no longer used, and some did not survive until the designation \"Standard\". LNER Code Description LMS Code B Brake BC Brake Composite BCK Brake Composite Corridor CBB BCL Brake Composite Lavatory BCV BRUTE Carrying Van BDMBS Battery Driving Motor Brake Standard (Open) BDMSO Battery Driving Motor Standard Open BDTCL Battery Driving Trailer Composite (Open) Lavatory BFK Brake First Corridor E BFO Brake First Open BG Brake Gangwayed CBR BGP Brake Gangwayed Pigeon van BGZ Brake Gangwayed (6-wheels) CR BPOT Brake Post Office Stowage Van BS Brake Standard H BSK Brake Standard Corridor CH BSL Brake Standard Lavatory LH BSO Brake Standard Open VH BSOT Brake Standard Open Trolley BUO Brake Unclassified Open BZ Brake (6-wheels) R C Composite BC CCT Covered Carriage Truck CK Composite Corridor CBC CL Composite Lavatory LC CO Composite Open VC DBSO Driving Brake Standard Open DM Driving Motor DMB Driving Motor Brake DMBC Driving Motor Brake Composite (Open) DMBCL Driving Motor Brake Composite (Open) Lavatory DMBFL Driving Motor Brake First (Open) Lavatory DMBS Driving Motor Brake Standard (Open) DMBSK Driving Motor Brake Standard Corridor DMBSL Driving Motor Brake Standard (Open) Lavatory DMBSO Driving Motor Brake Standard Open DMC Driving Motor Composite (Open) DMCL Driving Motor Composite (Open) Lavatory DMLV Driving Motor Luggage Van DMPMV Driving Motor Parcels & Miscellaneous Van DMS Driving Motor Standard (Open) DMSK Driving Motor Standard Corridor DMSL Driving Motor Standard (Open) Lavatory DMSO Driving Motor Standard Open DTBS Driving Trailer Brake Standard DTBSO Driving Trailer Brake Standard Open DTCL Driving Trailer Composite (Open) Lavatory DTCoL Driving Trailer Composite Semi-Open Lavatory DTCOL Driving Trailer Composite Open Lavatory DTS Driving Trailer Standard (Open) DTSo Driving Trailer Standard Semi-Open DTSO Driving Trailer Standard Open DTSOL Driving Trailer Standard Open Lavatory DVT Driving Van Trailer F First L FK First Corridor CL FL First Lavatory LM FO First Open QL FOT First Open Trolley GUV General Utility Van HB Horse Box IFV Insulated Fish Van LFK Lounge First Corridor M Motor MBRSM Motor Brake Restaurant Standard Modular MBS Motor Brake Standard MBSK Motor Brake Standard Corridor MBSO Motor Brake Standard Open MFLRK Motor First (Open) Lavatory Restaurant Kitchen MLV Motor Luggage Van MS Motor Standard (Open) MSL Motor Standard (Open) Lavatory MSLRB Motor Standard Lavatory Restaurant Buffet MSO Motor Standard Open OCT Open Carriage Truck PCP Pullman Composite Parlour PCV Propelling Control Vehicle PFB Pullman First Brake PFK Pullman First Kitchen PFP Pullman First Parlour PMV Parcels & Miscellaneous Van POS Post Office Sorting Van POR POT Post Office Stowage Van PPR PSB Pullman Standard Brake PTSO Pantograph Trailer Standard Open RB Restaurant Buffet BRC RC Restaurant Composite Compo RKC RCO Restaurant Composite Open VC Dining RF Restaurant First First RKC RFB Restaurant First Buffet RFM Restaurant First Modular RFO Restaurant First Open QL Dining RG Restaurant Griddle RK Restaurant Kitchen KC RKB Restaurant Kitchen Buffet BRC RLO Restaurant Lounge Open RMB Restaurant Miniature Buffet RS Restaurant Standard Third RKC RSO Restaurant Standard Open QF Dining RU Restaurant Unclassified Common RKC RUB Restaurant Unclassified Buffet RUK Restaurant Unclassified Kitchen RUO Restaurant Unclassified Open S Standard F SCV Special Cattle Van SK Standard Corridor CF SLC Sleeper Composite CSC SLE Sleeper Either Class SLEP Sleeper Either Class with Pantry SLF Sleeper First SC SLSTP Sleeper Standard Twin-Berth with Pantry SCT SLO Standard Lavatory Open (within carriage) SO Standard Open QF TBCK Trailer Brake Composite Corridor TBF Trailer Brake First (Open) TBFK Trailer Brake First Corridor TBSK Trailer Brake Standard Corridor TBSL Trailer Brake Standard (Open) Lavatory TC Trailer Composite (Open) TCK Trailer Composite Corridor TCL Trailer Composite (Open) Lavatory TCoL Trailer Composite Semi- Open Lavatory TCOL Trailer Composite Open Lavatory TF Trailer First (Open) TFK Trailer First Corridor TFKRB Trailer First Corridor Restaurant Buffet TFL Trailer First (Open) Lavatory TFLRB Trailer First (Open) Lavatory Restaurant Buffet TFLRK Trailer First (Open) Lavatory Restaurant Kitchen TFOLH Trailer First Open Lavatory Handbrake TGS Trailer Guard Standard (Open) TRB Trailer Restaurant Buffet TRFB Trailer Restaurant First Buffet TRFM Trailer Restaurant First Modular TRSB Trailer Restaurant Standard Buffet TRUB Trailer Restaurant Unclassified Buffet TRUK Trailer Restaurant Unclassified Kitchen TS Trailer Standard (Open) TSK Trailer Standard Corridor TSL Trailer Standard (Open) Lavatory TSLRB Trailer Standard (Open) Lavatory Restaurant Buffet TSo Trailer Standard Semi-Open TSO Tourist Standard Open or Trailer Standard Open TSOL Trailer Standard Open Lavatory TSORB Trailer Standard Open Restaurant Buffet TSOT Tourist Standard Open Trolley TU Trailer Unclassified (Open) VFV Ventilated Fruit Van Note that in modern usage, composite semi-open vehicles are classified Cso – the s signifying that the Standard portion is open (implying that the First portion is compartments with corridor). * See also: British Carriage and Wagon Numbering and Classification Category:British Rail British Rail coach designations",
 "title": "British Rail coach designations"
}