{
 "id": "160791",
 "text": "Virgin Trains was a train operating company in the United Kingdom. They ran trains from London Euston to the North West, West Midlands and Scotland on the West Coast Main Line and trains on the East Coast Main Coast Mainline between London, Yorkshire, the North East and Scotland. Before 11 November 2007, they also run trains linking the south and south-west of England with the north of England through Manchester and Scotland, through Birmingham, under the CrossCountry franchise. Although it is branded as part of Virgin Group, Virgin's share in the company is only 51%, with the remaining 49% owned by Stagecoach. Virgin's share in Virgin Trains East Coast is only 10% with 90% being owned by Stagecoach, although the company is also branded under the Virgin name. The East Coast franchise was transferred to London North Eastern Railway in 2019, and the West Coast franchise to Avanti West Coast. ==New trains== Their first trains, formerly owned by British Rail, were very old and broken down, but were replaced by new trains in 2002 on the West Coast and CrossCountry lines. New trains were built for their East Coast operations. ==Gallery== Image:Virgin railways 82114 glasgow.jpg|Virgin Trains 82114 Driving Van Trailer Platform 1 Glasgow Central Station, Scotland July 2000. Image:PIC 0339.JPG|Virgin Trains, Class 221 SuperVoyager, 221109 \"Marco Polo\" at Chester station. File:Virgin Mk 2 carrage 2001...png|A Virgin trains Mk2 coach at Banbury in 2001. All of Virgin's old slam door stock was scraped in 2003, after safety issues on such carriages. Most are now in private collections or scrapped. Image:Virgin Voyager 220003 2005-06-09 03.jpg|A Class 220 Voyager at Bristol. File:VT at Crewe station 2000.png|A picture of a Virgin Trains' MK 3 carriage at Crewe station in the year 2000. It is in its former Inter City livery. Most are now either renovated or scrapped. They were too old to use. Image:Virgin Trains class 87 & train.jpg|Class 87 electric locomotive and Mark 3 coaches franchised by Virgin Trains, now in use elsewhere. Image:Virgin Trains Class 390 Pendolino Standard Class Interior.JPG|The interior of Standard Class aboard a Class 390 Pendolino. Image:Virgin Trains Class 390 Pendolino First Class Interior.JPG|The interior of First Class aboard a 390 Pendolino. Image:Virgin WC British Breakfast.JPG|The complimentary breakfast was served to passengers in First Class aboard the Class 390 Pendolino trains before the improved service was launched in January 2009. File:Virgin Trains East Coast refreshed Mk3 interior.jpg|Virgin Trains East Coast InterCity 125 interior ==Related pages== *Megatrain *National Rail ==References== ==Other websites== *Department for Transport *Virgin Trains |- |- Category:Post-privatisation British railway companies Category:Virgin Group",
 "title": "Virgin Trains"
}