{
 "id": "161399",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. His son Yuta Tsunami is also a footballer. ==Biography== Tsunami was born in Setagaya, Tokyo on August 14, 1961. He joined Yomiuri (later Verdy Kawasaki) from their youth team in 1980. The club won the champions in Japan Soccer League 5 times, JSL Cup 3 times and Emperor's Cup 3 times. This was golden era in club history. He was also selected Best Eleven 3 times (1982, 1983 and 1984). In 1992, Japan Soccer League was folded and founded new league J1 League. However he lost opportunity to play after that. Toward the end of his career, he played for Avispa Fukuoka (1996–1997) and Bellmare Hiratsuka (1997–1998). He retired in 1998. He played 267 games and scored 5 goals in the league. In December 1980, Tsunami was selected the Japan national team for 1982 World Cup qualification. At this qualification, he debuted against Singapore on December 22. He also played at 1984 Summer Olympics qualification, 1988 Summer Olympics qualification and 1986 World Cup qualification. After 1988 Summer Olympics qualification in 1987, he ceased to be selected Japan. In May 1992, Tsunami was selected Japan for the first time in 5 years. He was a member of the Japan team that won the 1992 Asian Cup. He played all the Japan games except one for which he wasn't eligible due to suspension. He also played all matches at 1994 World Cup qualification in spring 1993. However he injured his left ankle in domestic league match in May. So, he could not play any game in the final round that was centrally held in Doha, Qatar in October. Japan's hope to qualify for the finals was dashed by a stoppage time Iraqi equaliser in the last qualifying match. The Japanese fans now refer to this match as the \"Agony of Doha\" (ドーハの悲劇), and his absence was one of the main reasons why Japan's campaign ended up unsuccessful. He played 78 games and scored 2 goals for the Japan until 1995. After the retirement, Tsunami started coaching career at Verdy Kawasaki (later Tokyo Verdy) in 1999. He mainly served as manager for the youth team. In 2005, he moved to Vegalta Sendai and became a top team manager. In 2006, he returned to Verdy and became an assistant coach for top team under manager Ruy Ramos. In 2007, he moved to Cerezo Osaka and became a manager. However the club results were sluggish and he was sacked in May. In 2008, he signed with Yokohama FC and managed the club in 1 season. ==Statistics== |- |1980||rowspan=\"12\"|Yomiuri||rowspan=\"12\"|JSL Division 1||12||2||3||0||2||1||17||3 |- |1981||18||1||5||0||1||0||24||1 |- |1982||17||0||3||0||1||0||21||0 |- |1983||18||0||3||0||3||0||24||0 |- |1984||18||1||5||0||0||0||23||1 |- |1985/86||21||0||2||0||4||1||27||1 |- |1986/87||19||0||3||0||1||0||23||0 |- |1987/88||10||0||4||0||1||0||15||0 |- |1988/89||21||0||3||0||3||1||27||1 |- |1989/90||10||0||4||0||4||0||18||0 |- |1990/91||21||1||2||0||2||0||25||1 |- |1991/92||21||0||4||1||5||0||30||1 |- |1992||rowspan=\"4\"|Verdy Kawasaki||rowspan=\"4\"|J1 League||colspan=\"2\"|-||3||0||11||1||14||1 |- |1993||5||0||0||0||0||0||5||0 |- |1994||8||0||2||1||0||0||10||1 |- |1995||16||0||0||0||colspan=\"2\"|-||16||0 |- |1996||rowspan=\"2\"|Avispa Fukuoka||rowspan=\"2\"|J1 League||21||0||1||0||11||0||33||0 |- |1997||0||0||0||0||0||0||0||0 |- |1997||rowspan=\"2\"|Bellmare Hiratsuka||rowspan=\"2\"|J1 League||6||0||0||0||0||0||6||0 |- |1998||5||0||0||0||4||0||9||0 267||5||47||2||53||4||367||11 267||5||47||2||53||4||367||11 |} Japan National Football Team Database |- |1980||3||0 |- |1981||7||0 |- |1982||8||0 |- |1983||10||0 |- |1984||5||0 |- |1985||7||0 |- |1986||5||2 |- |1987||10||0 |- |1988||0||0 |- |1989||0||0 |- |1990||0||0 |- |1991||0||0 |- |1992||10||0 |- |1993||10||0 |- |1994||0||0 |- |1995||3||0 |- !Total||78||0 |} ==References== ==Other websites== * Category:1961 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan international footballers Category:Cerezo Osaka managers Category:J1 League players Category:Japan Soccer League players Category:Tokyo Verdy players Category:Avispa Fukuoka players Category:Shonan Bellmare players Category:1995 King Fahd Cup players Category:1992 AFC Asian Cup players Category:AFC Asian Cup-winning players",
 "title": "Satoshi Tsunami"
}