{
 "id": "161484",
 "text": "A graphics processing unit (GPU) is the processor on a graphics card. It makes images, animations, graphics and then displays them on the computer’s screen. A strong GPU is able to process complex animations and graphics smoothly and efficiently. Images which GPUs make may be 2D or 3D. For most applications, the GPU has to make two dimensional (2D) pictures. Some applications use 3D pictures to simulate three-dimensionality. == Origin == The first graphics processors were used in the 1970s in arcade machines. Graphics processors were not used for consumer products until the 1980s because they were too expensive to make. During the mid 1990s, graphics processors became common in arcade games, computer games and console games. The first GPU for personal computers was the Nvidia GeForce 256, released in 1999. It could calculate geometric objects in space and some lighting effects. General Processing Unit ranges from different prices. == Modern Uses == Nowadays, GPUs are always in personal computers, mobile telephones and video game systems. Most CPUs come with an internal GPU built-in. Those internal GPUs can make the visual effects of modern graphical user interfaces such as shadows, semi-transparent backgrounds and animations. However, for newer video games a more powerful additional dedicated GPU is usually needed. Other devices such as virtual reality headsets and driverless cars also use GPUs. The tasks a GPU can do include technical calculations, Artificial Intelligence problem solving, photo editing and other applications. === History of Multi-GPU systems === The first attempts in Multi-GPU Systems were done by now defunct company 3Dfx in the late 1990s, which was bought by Nvidia later. Their Voodoo video cards, which were 3D only accelerators, could be hooked up to a second Voodoo video card to gain more performance. This was called SLi. Theoretically the performance would double, practically it increased far less, depending on the video game. Later, 3Dfx built even four GPUs on one unreleased video card. == References == Category:Computer hardware Category:Computer graphics",
 "title": "Graphics processing unit"
}