{
 "id": "161403",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. His brother Kazuyoshi Miura also played for the Japan national team. ==Biography== Miura was born in Shizuoka on July 15, 1965. After graduating from Shizuoka Gakuen High School, through Brazilian club Santos, he joined Yomiuri (later Verdy Kawasaki) in 1986. The club won the champions in Japan Soccer League 3 times, JSL Cup 1 times and Emperor's Cup 2 times. In Asia, the club also won 1987 Asian Club Championship. In 1992, moved to new club Shimizu S-Pulse based in his local Shizuoka in 1992. In 1996, he returned to Verdy Kawasaki. The club won 1996 Emperor's Cup. However his opportunity for play has decreased, he moved to Avispa Fukuoka in 1999. He played as regular player at the club. However the club was relegated to J2 League in 2001 and he moved to Vissel Kobe in 2002. He retired in 2003. He was 38 years old. On October 4, 1993, Miura debuted for the Japan national team against Ivory Coast. He played as left side-back on behalf of regular player Satoshi Tsunami who could not play for injury. Miura also played at 1994 World Cup qualification in Doha. However Japan failed to qualify for the 1994 World Cup. It was known as the \"Agony of Doha\" (ドーハの悲劇) in Japan. He played 3 games for Japan in 1993. After retirement, Miura became a manager for J2 League club Giravanz Kitakyushu in 2011. Although Giravanz was at the bottom place in 2010 season, Miura led Giravanz to the 8th place in 2011 season. In 2012 season, Giravanz finished at the 9th place. In 2013, he moved to J2 club Tokyo Verdy which Miura played for long time. However the club results were bad and Miura was sacked in September 2014 when the club was at the 20th place of 22 clubs. In 2015, Miura moved to Thailand and signed with Chiangmai. However he was sacked for poor performance in July. In 2016, he signed with J3 League club Kataller Toyama. He moved to J3 club Kagoshima United FC in 2017. In 2018, he led the club to the 2nd place and the club was promoted to J2 first time in the club history. However he resigned end of 2018 season. ==Statistics== |- |1986/87||rowspan=\"6\"|Yomiuri||rowspan=\"6\"|JSL Division 1||6||1||1||0||4||0||11||1 |- |1987/88||13||1||1||0||4||0||18||1 |- |1988/89||15||2||3||0||3||0||21||2 |- |1989/90||19||0||3||0||4||0||26||0 |- |1990/91||22||1||2||0||2||0||26||1 |- |1991/92||7||0||5||0||5||0||17||0 |- |1992||rowspan=\"4\"|Shimizu S-Pulse||rowspan=\"4\"|J1 League||colspan=\"2\"|-||2||1||11||0||13||1 |- |1993||19||1||4||0||4||0||27||1 |- |1994||37||2||1||0||1||0||39||2 |- |1995||48||2||1||0||colspan=\"2\"|-||49||2 |- |1996||rowspan=\"3\"|Verdy Kawasaki||rowspan=\"3\"|J1 League||19||1||5||2||15||0||39||3 |- |1997||21||0||1||0||5||0||27||0 |- |1998||16||0||2||0||2||1||20||1 |- |1999||rowspan=\"3\"|Avispa Fukuoka||rowspan=\"3\"|J1 League||23||4||2||1||3||0||28||5 |- |2000||25||1||2||1||1||0||28||2 |- |2001||26||0||1||0||4||0||31||0 |- |2002||rowspan=\"2\"|Vissel Kobe||rowspan=\"2\"|J1 League||7||0||1||0||1||0||9||0 |- |2003||17||0||0||0||5||0||22||0 340||16||43||5||68||1||451||22 340||16||43||5||68||1||451||22 |} Japan National Football Team Database |- |1993||3||0 |- !Total||3||0 |} ==References== ==Other websites== * Category:1965 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:Tokyo Verdy players Category:Shimizu S-Pulse players Category:Avispa Fukuoka players Category:Vissel Kobe players",
 "title": "Yasutoshi Miura"
}