{
 "id": "161632",
 "text": "Methane hydrate, also called methane ice or methane clathrate, consists of methane, which is enclosed in frozen water. The water molecules completely surround the methane. Methane hydrate is a common constituent of the shallow marine (ocean) geosphere. In 1971, it was first discovered in Black Sea. ==Definition and characteristics== Methane hydrate consists of methane gas trapped inside cage-like crystal structures made up of water molecules. These “cages” have a size of atoms and molecules, far too small to see with the naked eye. Under normal temperature and pressure, one litre of methane hydrate is equal to 168 litres of methane gas. == Origin of methane hydrate == Methane hydrate is thought to be formed by dead organic matter trapped between the earth's layers, and then broken down by microorganisms and the earth's heat. The process is similar to the one that produces methane when organic waste is dumped at a garbage pit and covered with earth, except that it occurs deep below the earth's surface. The organisms which produce methane by a process of fermentation are the methaneogen Archea. ==Natural resources== Areas where natural methane hydrate is thought to exist are generally areas under the ocean where continental plates meet. In depths between 500 to 1000 meter, where pressure is high and temperature low enough. ==Possible mining methods== ===Thermal recovery method=== * In this method, a well is drilled to the methane hydrate-bearing layer, and methane hydrate is dissociated by heating using a fluid (hot water or steam) heated at the surface in a boiler or similar device and circulated down through the well. This causes methane hydrate to decompose and generates methane gas. The methane gas mixes with the hot water and returns to the surface, where the gas and hot water are separated. ===Depressurization method=== * As with geological formation, methane hydrate bearing layers are subject to be pressurized by the combined overburden weight of seawater and the formation pressure. In drilling for formations subjected to such pressures, it is customary to use a drilling mud with a specific gravity higher than this pressure. Conversely, the depressurization method lowering the pressure inside the well and encouraging the methane hydrate to dissociate. (Methane hydrate dissociates into methane gas and water when depressurized.) ===Inhibitor injection method=== * In this method, inhibitor such as methanol is injected from surface down to methane hydrate-bearing layers. This method enables methane hydrate dissociation without changing the pressure or temperature of the methane hydrate-bearing layer. ==Importance and danger of methane hydrate== ===Importance of methane hydrate=== * Many suggest that deposits are located all over the world, which will have twice as much energy than we ever had with oil, gas and coal together. This could be the energy alternative we are looking for as a transitional solution; until such a time as the use of fossil fuels and nuclear energy is no longer necessary. ===Danger of methane hydrate=== * Methane is a powerful greenhouse gas. The sudden release of large amounts of natural gas from methane hydrate deposits has been hypothesized as a cause of past and possible future climate changes. ==References== * http://geology.usgs.gov/connections/mms/joint_projects/methane.htm * http://gsc.nrcan.gc.ca/gashydrates/mallik2002/index_e.php * http://www.mh21japan.gr.jp/english/index.html Category:Chemical compounds Category:Greenhouse gases",
 "title": "Methane hydrate"
}