{
 "id": "161793",
 "text": "Nyssa is a fictional character in the long-running British science fiction television series Doctor Who. She is played by Sarah Sutton. Nyssa came from the planet Traken. Nyssa was created by writer Johnny Byrne for the Fourth Doctor serial The Keeper of Traken, but the production team later decided that she should join the Doctor on his travels. She returned in the next serial Logopolis, in which the Fourth Doctor regenerated, and remained as a companion of the Fifth Doctor. She was a regular in the programme from 1981 to 1983. Sutton was the youngest female actor to play a companion in the series. ==Character history== Nyssa is a alien from the planet Traken, the daughter of Tremas (a consul of the Traken Union) and stepdaughter of Kassia. She helps the Doctor and Adric to defeat Master. During her journeys with Tegan and Adric aboard the TARDIS, Nyssa finds herself trapped in a mathematical equation by the Master – whom she hates as he is, of course, now using \"that face\" (her father's). She also encounters a race of androids and their insane ruler, helps foil the genocidal plans of a wounded Terileptil and incidentally start the Great Fire of London, and discovers her remarkable resemblance to Ann Talbot. ==Appearances in other media== Nyssa's fate after she leaves the TARDIS is not known, although the spin-off novel Asylum, by Peter Darvill- Evans, reveals that she eventually leaves Terminus and settles down as an academic in a university on an unspecified planet. In Asylum, Nyssa shares an adventure with the Fourth Doctor from a time before he met her, leaving the Doctor with the knowledge that he will have to be extremely careful dealing with Nyssa when they eventually meet to avoid changing history. Since then, Sutton has also voiced Nyssa in several audio plays alongside Peter Davison as the Fifth Doctor, produced by Big Finish Productions. ==List of appearances== ===Television=== ;Season 18 *The Keeper of Traken *Logopolis ;Season 19 *Castrovalva *Four to Doomsday *Kinda *The Visitation *Black Orchid *Earthshock *Time-Flight ;Season 20 *Arc of Infinity *Snakedance *Mawdryn Undead *Terminus ;Season 21 *The Caves of Androzani (cameo) ;30th anniversary special *Dimensions in Time ===Audio dramas=== *The Land of the Dead *Winter for the Adept *The Mutant Phase *Primeval *Spare Parts *Creatures of Beauty *The Game *Circular Time *Renaissance of the Daleks *Return to the Web Planet *The Haunting of Thomas Brewster *The Boy That Time Forgot *Time Reef & A Perfect World *The Darkening Eye ===Novels=== ;Virgin Missing Adventures *Goth Opera by Paul Cornell *The Sands of Time by Justin Richards *Cold Fusion by Lance Parkin ;Past Doctor Adventures *Zeta Major by Simon Messingham *Divided Loyalties by Gary Russell *Asylum by Peter Darvill-Evans *Fear of the Dark by Trevor Baxendale *Empire of Death by David Bishop ===Comics=== *\"On The Planet Isopterus\" by Glenn Rix (Doctor Who Annual 1983) *\"Blood Invocation\" by Paul Cornell and John Ridgway (Doctor Who Magazine Yearbook 1995) ==Other websites== * Nyssa at The TARDIS Index File website * Nyssa on the BBC's Doctor Who website Category:Doctor Who characters",
 "title": "Nyssa (Doctor Who)"
}