{
 "id": "161720",
 "text": "Tapestry is art made with threads. It is woven by hand on a vertical loom. It is weft-faced weaving. This means all the warp threads (the ones that go up and down) are hidden in the completed work. In normal cloth weaving both the warp and the weft threads can be seen. In this way, a colourful pattern or image is made. Most weavers use a natural warp thread such as linen or cotton. The weft threads, which will be seen, are usually wool or cotton. They can also be made of silk, gold, silver, or other things. Both craftsmen and artists have made tapestries. The 'blueprints' on cardboard (also known as 'tapestry cartoons') were made by artists, while actual weaving of the tapestries was done by craftsmen. ==Function== The success of decorative tapestry can be partially explained by its portability (Le Corbusier once called tapestries \"nomadic murals\"). Kings and noblemen could roll up and transport tapestries from one residence to another. In churches, they were displayed on special occasions. Tapestries were also draped on the walls of castles for insulation during winter, as well as for decorative display. The famous Bayeux tapestry is not actually a tapestry, but a decorated cloth. And it was probably designed and made in England by Anglo-Saxon artists.Wilson, David M. 1985. The Bayeux tapestry. London: Thames and Hudson, 201–227. ==Gallery== File:The Hunters Enter the Woods (from the Unicorn Tapestries) MET DP118981.jpg|\"The Hunters Enter the Woods\" File:The Hunt of the Unicorn Tapestry 1.jpg|\"The Unicorn Purifies Water\" File:The Unicorn is Attacked (from the Unicorn Tapestries) MET DP118985.jpg|\"The Unicorn Crosses a Stream\" File:The Unicorn Defends Itself (from the Unicorn Tapestries) MET DP118987.jpg|\"The Unicorn Defends Himself\" File:The Mystic Capture of the Unicorn (from the Unicorn Tapestries) MET DP155501.jpg|The two Fragments of \"The Unicorn Surrenders to a Maiden\" File:The Unicorn is Killed and Brought to the Castle (from the Unicorn Tapestries) MET DP118989.jpg|\"The Hunters Return to the Castle\" The Unicorn in Captivity - Google Art Project.jpg|\"The Unicorn Rests in a Garden\" (Toulouse) Le toucher (La Dame à la licorne) - Musée de Cluny Paris.jpg|Touch, (Toulouse)_Le_Goût_(La_Dame_à_la_licorne)_-_Musée_de_Cluny_Paris.jpg|Taste. (Toulouse)_L'Odorat_(La_Dame_à_la_licorne)_-_Musée_de_Cluny_Paris.jpg|Smell (Toulouse) L'Ouïe (La Dame à la licorne) - Musée de Cluny Paris.jpg|Hearing, (Toulouse) Le Vue (La Dame à la licorne) - Musée de Cluny Paris.jpg|Sight, The_Lady and the unicorn Desire.jpg| Desire == References == Category:Weaving",
 "title": "Tapestry"
}