{
 "id": "162226",
 "text": "Paraceratherium previously called Indricotherium or Baluchitherium or just Indricothere is an extinct genus of mammal. It was a large rhinoceros without a horn. It lived in Eurasia during the late Oligocene epoch of the Tertiary period, (34-23 million years ago). Paraceratherium was one of the largest ever land mammals. Palmer D. ed 1999. The Marshall Illustrated Encyclopedia of Dinosaurs and Prehistoric Animals. London: Marshall Editions, p262–263. ISBN 1-84028-152-9 Its exact size is unclear because of the incompleteness of the fossils. The size of adults was about tall at the shoulder, about in length. Estimates of its weight have varied greatly. == Lifestyle == It was a herbivore that stripped leaves from trees. It had a long, low, hornless skull and long frontal and nasal bones. Its front teeth had a single pair of incisors in either jaw. They were round, pointed, and so large that they looked like small tusks. The upper incisors pointed straight downwards, while the lower ones jutted outwards. The upper lip was evidently extremely mobile. The neck was very long, the body big and strong, and the limbs long and thick, column-like.Prothero D. 2013. Rhinoceros giants: the palaeobiology of Indricotheres. Indiana: Indiana University Press. == Size == Its exact size is unclear because of the incompleteness of the fossils. Estimates have been based on skull, teeth, and limb bone measurements. However, the known bone elements are from individuals of different sizes. All skeletal reconstructions are composite extrapolations. This resulted in weight estimates from 11 to 20 tonnes.Fortelius M. & Kappelman J. 1993. The largest land mammal ever imagined. Zoological Journal of the Linnean Society 108: 85–101. Tsubamoto T. 2012. Estimating body mass from the astragalus in mammals. Acta Palaeontologica Polonica, 259–265. Its shoulder height has been estimated as . Its length was about from front to back. As explained, such figure are only approximations. These figures are for the largest of the three species in the genus. == Ecology == They lived in a huge rainforest floodplain in the area which is now Kazakhstan, India, and southwest China. They lived further inland throughout northern and central Asia as well. This area was a rainforest before the Himalayan uplift changed the climate. == References == Category:Extinct mammals Category:Fossils",
 "title": "Paraceratherium"
}