{
 "id": "162946",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. He also managed Japan women's national team. ==Biography== Ikeda was born in Shizuoka Prefecture on January 5, 1962. After graduating from Shizuoka Gakuen High School, he joined Japan Soccer League club Nissan Motors in 1980. The club won the 1983 and 1985 Emperor's Cup. From 1988 to 1990, the club won all three major titles in Japan: the Japan Soccer League, the JSL Cup, and the Emperor's Cup, for two years in a row. The club also won the 1989 Emperor's Cup. He moved to Matsushita Electric in 1990. The club won the 1990 Emperor's Cup. He retired in 1992. On June 4, 1985, Ikeda debuted for the Japan national team against Malaysia. After retirement, Ikeda started coaching career at Gamba Osaka (former Matsushita Electric) in 1992. In 1998, he became a manager for Nadeshiko League club Matsushita Electric Panasonic Bambina and managed until 1999. In 2000, he became a manager for Japan women's national team. He managed at 2001 AFC Women's Championship and Japan won the 2nd place. He managed until April 2002.Japan Football Association He also managed Japan U-20 women's national team for 2002 U-19 Women's World Championship. After that, he managed Gunma FC Horikoshi (2003-2004) and Zweigen Kanazawa (2007-2008). ==Statistics== |- |1980||rowspan=\"10\"|Nissan Motors||JSL Division 1||0||0 |- |1981||JSL Division 2|||| |- |1982||rowspan=\"8\"|JSL Division 1||1||0 |- |1983||11||0 |- |1984||16||0 |- |1985/86||14||0 |- |1986/87||11||0 |- |1987/88||15||0 |- |1988/89||1||0 |- |1989/90||0||0 |- |1990/91||rowspan=\"2\"|Matsushita Electric||rowspan=\"2\"|JSL Division 1||3||0 |- |1991/92||0||0 72+||0+ 72+||0+ |} Japan National Football Team Database |- |1985||1||0 |- !Total||1||0 |} ==References== ==Other websites== * Category:1962 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:Japan Soccer League players Category:Yokohama F. Marinos players Category:Gamba Osaka players Category:Japan women's national football team managers",
 "title": "Shinobu Ikeda"
}