{
 "id": "162921",
 "text": "Pseudomonas is a gram-negative bacteria. It is a genus belonging to the Pseudomonadaceae family. There are about 144 species in this genus. Most of the Pseudomonas species are saprotrophic, meaning they release enzymes that break down big substances into small ones. ==History== Pseudomonas is one of the earliest found bacteria. It was first called 'Bacterium aeruginosm' by Schroter in 1872. However, in 1894, German botanist Walter Migula classified it as Pseudomonas aeruginosa. In Greek, pseudo means false and monas means “unit”. This bacteria is associated with many chronic infections and is considered dangerous due to its resistance to many antibiotics. There has been an increase in the number of species discovered year by year. In 2013, 10 species have been found and 6 more in the subsequent year. Pseudomonas was well-classified 100 years later by a Canadian scientist, Roger Stanier. The classification was based on the physiological and biochemical properties. ==Phylogeny== The basic tool which is used to classify Pseudomonas is the 16S rRNA gene. However, it is hard to differentiate closely related Pseudomonas species, thus genes such as atpD, gyrB, rpoB, recA, and rpoD are also used in the taxonomy of Pseudomonas.Using gyrB and rpoD in phylogenetic analysis, Pseudomonas came from two predominant clusters; intrageneric cluster I (IGC I) and intrageneric cluster II (IGC II). IGC I consists of two sub clusters, the ‘Pseudomonas aeruginosa complex’ comprises of Pseudomonas aeruginosa, Pseudomonas alcaligenes, Pseudomonas citronellolis, Pseudomonas mendocina, Pseudomonas oleovorans and Pseudomonas pseudoalcaligenes, and the ‘Pseudomonas stutzeri complex’, comprises of Pseudomonas balearica and Pseudomonas stutzeri. IGC II consists of three subclusters, the ‘Pseudomonas syringae complex’, the ‘Pseudomonas fluorescens complex’ and the ‘Pseudomonas putida complex’. The ‘Pseudomonas syringae complex’ are phytopathogens and pathovars. The former encompasses Pseudomonas amygdali, Pseudomonas caricapapayae, Pseudomonas cichorii, Pseudomonas ficuserectae and Pseudomonas viridiflava and the latter consists of Pseudomonas savastanoi and Pseudomonas syringae. The ‘Pseudomonas fluorescens complex’ is divided into two subpopulations, the ‘Pseudomonas fluorescens lineage’ and the ‘Pseudomonas chlororaphis lineage’. The ‘Pseudomonas fluorescens lineage’ contains Pseudomonas fluorescens biotypes A, B and C, Pseudomonas azotoformans, Pseudomonas marginalis pathovars, Pseudomonas mucidolens, Pseudomonas synxantha and Pseudomonas tolaasii, while the ‘Pseudomonas chlororaphis lineage’ includes Pseudomonas chlororaphis, Pseudomonas agarici, Pseudomonas asplenii and Pseudomonas corrugata. The ‘Pseudomonas putida complex’ comprises of Pseudomonas putida and Pseudomonas fulva. == Clinical manifestations == More than 25 species of Pseudomonas cause diseases in humans. Species such as Pseudomonas aeruginosa, Pseudomonas fluorescens, Pseudomonas putida, Pseudomonas cepacia, Pseudomonas stutzeri, Pseudomonas maltophilia, and Pseudomonas putrefaciens are said to cause opportunistic infections in humans. Opportunistic infections more commonly affect people with weak immune systems compared to the ones with stronger immune system. Only two of the species are known to cause specific disease. These are Pseudomonas mallei and Pseudomonas pseudomallei which cause glanders and melioidosis respectively. However, the most common species involved in clinical problems is Pseudomonas aeruginosa. The common clinical problems caused by Pseudomonas aeruginosa is shown in the following bullet points. * Bone and joint infections (BJI): It has been noted that Pseudomonas aeruginosa infections are the most difficult to treat compared to other BJIs. ** Osteomyelitis ** Implant-associated bone infections (IABI) * Cardiovascular (CV) infections ** Pseudomonal infectious endocarditis (IE) ** Constrictive Pericarditis * Central Nervous System (CNS) infections ** Brain Abscess ** Community-acquired Pseudomonas aeruginosa meningitis: It commonly occurs after surgery. * Ear infections ** Otitis media and Otitis externa ** Chronic suppurative otitis media * Eye infections ** Endophthalmitis ** Keratitis ** Ophthalmia neonatorum: It is rare and the complications are eyelid edema, erythema, and purulent discharge causing corneal perforation, endophthalmitis, blindness, and also death if not treated properly. * Gastro-intestinal(GI) infections ** Epidemic diarrhoea: Pseudomonas aeruginosa causes enterocolitis in children. One of the common symptoms of enterocolitis is diarrhoea. ** Necrotising enterocolitis ** Neutropenic Enterocolitis (Typhlitis): It commonly affects immunocompromised patients. ** Shanghai fever * Genitourinary(GU) infections ** Epididymitis ** Urinary tract infections (UTIs): Pseudomonas aeruginosa is the common cause of nosocomial UTIs. It is difficult to distinguish from other bacterial UTIs. * Respiratory infections ** Cystic fibrosis (CF) ** Ventilator-associated pneumonia (VAP) * Sepsis * Skin and soft tissue infections ** Ecthyma gangrenosum (EG): It is rare but has very high mortality rate ranging from 38%-77%. ** Dermatitis: It is a form of mild cutaneous infection. ** Necrotizing fasciitis: It is rare with only 12 cases recorded so far. == Biotechnology == Pseudomonas strains have been useful in the biotechnology field. The table below shows the Pseudomonas strains and their respective uses. Some of pseudomonas species and their uses in biotechnology Scientific name of the strains Uses Pseudomonas aeruginosa Treatment of rice blast disease Pseudomonas syringae Production of frozen foods Pseudomonas putida Control black root rot disease of tobacco and the production of biosynthetic chemicals and drugs Pseudomonas fluorescens Used in the food and leather industries Pseudomonas oleovorans Used in the production of polyesters == References == Category:Gram-negative bacteria",
 "title": "Pseudomonas"
}