{
 "id": "162952",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Ogasawara was born in Morioka on April 5, 1979. After graduating from Ofunato High School, he joined J1 League club Kashima Antlers in 1998. He debuted in April 1998 and played many matches as offensive midfielder from 1999. In 2000, he became a regular midfielder and Antlers won the champions all three major title in Japan; J1 League, J.League Cup and Emperor's Cup first time in J1 League history. At the 2000 Emperor's Cup final, he scored 2 goals and contributed to won the champions. The club also won the champions 2001 J1 League for 2 years in a row. In 2002 J.League Cup final, he scored a winning goal and Antlers won the champions. He was also selected MVP award. He was also selected Best Eleven award in J1 League for 5 years in a row (2001-2005). In August 2006, Ogasawara moved to Italy and signed with Serie A club Messina Peloro on loan. However he could not play many matches. In July 2007, Ogasawara returned to Antlers. He played many matches as defensive midfielder and Antlers won the champions in 2007 J1 League for the first time in 6 years. Antlers also won the champions in 2007 Emperor's Cup. Antlers won the champions in J1 League for 3 years in a row (2007-2009). In 2009, he was selected J.League MVP award. From 2010 season, Antlers won the champions 2010 Emperor's Cup, 2011, 2012 and 2015 J.League Cup. He was also MVP award in 2015 J.League Cup. In 2016, Antlers won the champions in J1 League and qualified for 2016 Club World Cup as host country champions. At Club World Cup, he played 3 matches and won the 2nd place. Antlers also won the champions in 2016 Emperor's Cup. From 2017, his opportunity to play decreased. In 2018, Antlers won the champions in AFC Champions League first Asian title in the club history. He retired end of 2018 season. In April 1999, Ogasawara was selected the Japan U-20 national team for 1999 World Youth Championship. At this tournament, he played all 7 matches as offensive midfielder and Japan won the 2nd place. On March 21, 2002, Ogasawara debuted for the Japan national team under manager Philippe Troussier against Ukraine. In June, he was selected Japan for 2002 World Cup. He played a match against Tunisia. Japan qualified to the knockout stage first time in Japan's history. After 2002 World Cup, Ogasawara played many matches as starting member under new manager Zico. He was selected Japan for 2003 Confederations Cup and 2004 Asian Cup. At 2004 Asian Cup, although he played only 2 matches, Japan won the champions. In 2005, he was selected Japan for 2005 Confederations Cup and played all 3 matches. In 2006, he was selected Japan for 2006 World Cup. Although he played 2 matches, Japan was eliminated in the group stages. After 2006 World Cup, Ogasawara was not selected Japan for generational change. In February 2010, he was selected Japan by manager Takeshi Okada. He played for Japan for the first time in 4 years. He played 55 games and scored 7 goals for Japan until 2010. ==Statistics== |- |1998||rowspan=\"9\"|Kashima Antlers||rowspan=\"9\"|J1 League||5||0||2||1||0||0||2||1||9||2 |- |1999||15||4||1||0||5||0||colspan=\"2\"|-||21||4 |- |2000||28||3||5||4||5||2||4||1||42||10 |- |2001||24||7||3||2||3||0||colspan=\"2\"|-||30||9 |- |2002||27||4||5||0||3||1||6||0||41||5 |- |2003||27||7||4||3||3||1||3||0||37||11 |- |2004||28||7||3||0||2||0||colspan=\"2\"|-||33||7 |- |2005||30||11||2||0||0||0||colspan=\"2\"|-||32||11 |- |2006||20||3||0||0||2||1||colspan=\"2\"|-||22||4 |- |2006/07||Messina Peloro||Serie A||6||1||2||0||colspan=\"2\"|-||colspan=\"2\"|-||8||1 |- |2007||rowspan=\"12\"|Kashima Antlers||rowspan=\"12\"|J1 League||14||4||5||1||3||1||colspan=\"2\"|-||22||6 |- |2008||24||5||0||0||2||0||7||1||33||6 |- |2009||32||3||4||0||2||1||7||1||45||5 |- |2010||33||3||5||0||2||1||6||1||46||5 |- |2011||31||1||1||0||3||0||6||0||41||1 |- |2012||31||2||4||0||7||0||colspan=\"2\"|-||42||2 |- |2013||33||2||3||0||5||0||colspan=\"2\"|-||41||2 |- |2014||33||2||1||0||4||0||colspan=\"2\"|-||38||2 |- |2015||29||1||0||0||5||0||5||0||39||1 |- |2016||30||0||6||0||4||0||colspan=\"2\"|-||40||0 |- |2017||17||0||3||0||2||0||4||0||26||0 |- |2018||14||0||2||0||1||0||6||0||23||0 525||69||57||11||63||8||56||5||701||93 6||1||2||0||colspan=\"2\"|-||colspan=\"2\"|-||8||1 531||70||59||11||63||8||56||5||709||94 |} Japan National Football Team Database |- |2002||8||0 |- |2003||8||0 |- |2004||12||2 |- |2005||15||4 |- |2006||10||1 |- |2007||0||0 |- |2008||0||0 |- |2009||0||0 |- |2010||2||0 |- !Total||55||7 |} ==References== ==Other websites== * Category:1979 births Category:Living people Category:Footballers from Iwate Prefecture Category:Japan international footballers Category:J1 League players Category:Kashima Antlers players Category:2002 FIFA World Cup players Category:2006 FIFA World Cup players Category:2003 FIFA Confederations Cup players Category:2005 FIFA Confederations Cup players",
 "title": "Mitsuo Ogasawara"
}