{
 "id": "16295",
 "text": "The Commonwealth of the Northern Mariana Islands, usually shortened to the Northern Mariana Islands, is a group of islands in the Pacific Ocean that are a political division controlled by the United States. Its capital is Saipan. Spain owned the islands until 1899 and sold them to the German Empire. Germany lost them to Japan in World War I and the United States took them in World War II. ==Geography== The Northern Mariana Islands, together with Guam to the south, compose the Mariana Islands. The southern islands are limestone, with level terraces and fringing coral reefs. The northern islands are volcanic, with active volcanos on Anatahan, Pagan and Agrihan. The volcano on Agrihan has the highest elevation at . Anatahan Volcano is a small volcanic island north of Saipan. It is about long and wide. Anatahan began erupting suddenly from its east crater on May 10, 2003, at about 6 p.m. (0800 UTC). It has since alternated between eruptive and calm periods. On April 6, 2005, approximately of ash and rock were ejected, causing a large, black cloud to drift south over Saipan and Tinian. ==People== In 2020, 47,329 people lived on the Northern Mariana Islands. This was down from 69,221 in 2000.2020 Census Population of the Commonwealth of the Northern Mariana Islands: Municipality and Village, U.S. Census Bureau. The official languages on the Northern Mariana Islands are English, Chamorro, and Carolinian. Only a few people speak the Tanapag language. Many people also speak Philippine languages, Chinese, and other Pacific island languages. Many people still have Spanish family names, but the people do not often speak Spanish, as they did in the past. Most people in the Northern Mariana Islands are Roman Catholic. There are also communities of Buddhist and Protestant people. Many people have traditional beliefs, also referred to as folk religion. According to the Pew Research Center, 2010: * Roman Catholic 64.1% * Protestants 16% * Buddhists 10.6% * Folk religions 5.3% * Other Christians 1.2% * Other religions 1.1% * Unaffiliated 1.0% * Eastern Orthodox <1% * Hindu <1% * Muslim <1% * Jews <1% The Church of Jesus Christ of Latter-day Saints reported 865 members in the Northern Mariana Islands. == References == == Other websites == * * *Northern Mariana Islands official government website *The CNMI Covenant *The CNMI Constitution *CNMI Office of Resident Representative Pedro A. Tenorio *H.R. 873 - the Northern Mariana Islands Delegate Act *H.R. 5550 - The United States-Commonwealth of the Northern Marianas Human Dignity Act *U.S. Census Bureau: Island Areas Census 2000 * * Category:Micronesia",
 "title": "Northern Mariana Islands"
}