{
 "id": "163014",
 "text": "The State Anthem of the Russian Federation is the name of the national anthem of Russia. First used in 2001, the song's music is the same as that of the former State Anthem of the Soviet Union, which was composed by Alexander Alexandrov in 1938. The words were newly written by Sergey Mikhalkov in 2000, who also wrote the words for the Soviet national anthem back in 1943.Russia – nationalanthems.meFederal Constitutional Law on the National Anthem of the Russian Federation (2000-12-25) == History of Russian anthems == What is today the Russian Federation has had several different anthems over the years. The earliest of these, called \"Let the Thunder of Victory Rumble!\" was used in the late 18th to early 19th century. In 1816, the Russian Empire adopted \"The Prayer of the Russians\", whose melody was that of the British anthem \"God Save the King\". This anthem was used until 1833, when a new composition called \"God Save the Tsar!\" was chosen by Nicholas I, but did not became popular until 1837. Its melody became used in classical music such as Beethoven's Wellington's Victory and Tchaikovsky's 1812 Overture. \"God Save the Tsar!\" continued to be the national anthem until the February Revolution in March 1917, when an adaptation of the French national anthem, known as the \"Worker's Marseillaise\", was used for a short time. Later that year, when the October Revolution happened, the Bolsheviks adopted a Russian translation of \"The Internationale\", which became the national anthem of the Soviet Union when it was founded in 1922. This was replaced by the State Anthem of the Soviet Union with Alexandrov's music and Mikhalkov's lyrics in 1944. The lyrics were removed in 1953 after the death of Joseph Stalin, but a new set of lyrics were added in 1977. While the republics of the Soviet Union had their own anthems during this time, the Russian SFSR did not, instead using the Soviet national anthem. However, in 1990, the Russian SFSR adopted a composition by Mikhail Glinka, known as \"The Patriotic Song\" as its state anthem. There were never any official words to this song. After the Soviet Union broke down in 1991, the president of the newly-formed Russian Federation, Boris Yeltsin, continued to use \"The Patriotic Song\" as the country's national anthem. When he was replaced by Vladimir Putin in 2000, the new president began to push for the melody of the old Soviet anthem to be brought back. Finally, in December of that year, the State Duma voted in favour of the music of the Soviet anthem, together with new lyrics by Mikhalkov, to be adopted as the national anthem, and the new anthem was performed for the first time during a ceremony at the Great Kremlin Palace just before the New Year.https://archive.today/20120907171727/http://www.montreal.mid.ru/inf_symb_e.html# Consulate-General of the Russian Federation in Montreal, Canada] ==Lyrics== Words of the song in RussianУказ Президента Российской Федерации от 30.12.2000 N 2110. Kremlin.ru. Spelling of these words written in the Latin alphabet Pronunciation of these words using the IPA Words of the song in English Россия – священная наша держава, Россия – любимая наша страна. Могучая воля, великая слава – Твоё достоянье на все времена! Припев: Славься, Отечество наше свободное, Братских народов союз вековой, Предками данная мудрость народная! Славься, страна! Мы гордимся тобой! От южных морей до полярного края Раскинулись наши леса и поля. Одна ты на свете! Одна ты такая – Хранимая Богом родная земля! Припев Широкий простор для мечты и для жизни Грядущие нам открывают года. Нам силу даёт наша верность Отчизне. Так было, так есть и так будет всегда! Припев Rossija – svjaščennaja naša deržava, Rossija – ljubimaja naša strana. Mogučaja volja, velikaja slava — Tvojo dostojanje na vse vremena! Pripev: Slavjsja, Otečestvo naše svobodnoje, Bratskih narodov sojuz vekovoj, Predkami dannaja mudrostj narodnaja! Slavjsja, strana! My gordimsja toboj! Ot južnyh morej do poljarnovo kraja Raskinulisj naši lesa i polja. Odna ty na svete! Odna ty takaja — Hranimaja Bogom rodnaja zemlja! Pripev Širokij prostor dlja mečty i dlja žizni Grjaduščije nam otkryvajut goda. Nam silu dajot naša vernostj Otčizne. Tak bylo, tak jestj i tak budet vsegda! Pripev [rɐ.ˈsʲi.ja svʲɪɕ.ˈɕɛn.na.ja ˈna.ʂa dʲɪr.ˈʐa.va ǀ] [rɐ.ˈsʲi.ja lʲʉ.ˈbʲi.ma.jɐ ˈna.ʂa stra.ˈna ‖] [ma.ˈɡu.t͡ɕa.jɐ ˈvo.lʲa vʲɛ.ˈlʲi.ka.jɐ ˈsɫa.va ǀ] [tva.ˈjɵ das.tɐ.ˈja.nʲjɛ nɐ‿fsʲɛ vrʲɛ.mʲɪ.ˈna ‖] [prʲɪ.ˈpʲef] [ˈsɫafʲ.sʲa a.ˈtʲɛ.t͡ɕɪst.va ǀ ˈna.ʂɛ sva.ˈbod.na.jɛ ǀ] [ˈbrat.skʲix nɐ.ˈro.daf sɐ.ˈjuz‿vʲɛ.ka.ˈvoj ‖] [ˈprʲɛt.ka.mʲi ˈdan.na.ja ǀ ˈmu.drasʲtʲ na.ˈrod.na.ja ǀ] [ˈsɫafʲ.sʲa strɐ.ˈna ǀ mɨ ɡɐr.ˈdʲim.sʲa tɐ.ˈboj ‖] [at‿ˈjuʐ.nɨx mɐ.ˈrʲɛj dɐ‿pɐ.ˈlʲar.na.vɐ ˈkra.ja ǀ] [rɐs.ˈkʲi.nu.lʲɪsʲ ˈna.ʂɨ lʲɪ.ˈsa i pɐ.ˈlʲa ‖] [ɐd.ˈna tɨ nɐ‿ˈsvʲɛ.tʲɛ ‖ ɐd.ˈna tɨ tɐ.ˈka.ja ǀ] [xrɐ.ˈnʲi.ma.jɐ ˈbo.ɡam rɐd.ˈna.ja zʲɪm.ˈlʲa ‖] [prʲɪ.ˈpʲef] [ʂɨ.ˈro.kʲij prɐ.ˈstor dlʲa mʲɪt͡ɕ.ˈtɨ i dlʲɐ‿ˈʐɨzʲ.nʲɪ ǀ] [ɡrʲɪ(ɐ).ˈduɕ.ɕi.jɪ nam at.krɨ.ˈva.jud‿ɡa.ˈda ‖] [nɐm‿ˈsʲi.ɫu dɐ.ˈjɵt ˈna.ʂa ˈvʲɛr.nasʲtʲ ɐt.ˈt͡ɕizʲ.nʲɪ ǀ] [tɐɡ‿ˈbɨ.ɫa tɐk jɛsʲtʲ i tɐɡ‿ˈbu.dʲɛt fsʲɪɡ.ˈda ‖] [prʲɪ.ˈpʲef] Russia is our holy and mighty country, Russia is our beloved country. Your undying will is of such great glory, Your dignity will last for eternity! Chorus: O Land of the free, glorious may you be, The old union of folks brotherly. Your ancestral wisdom is our legacy, Of you we're proud, so blossom, o country! From the southern seas to the polar tundras, Aspread are our forests and fields and taigas. You are unique – the one and only on Earth — Protected by God, o native land of worth! Chorus Spaces far and wide for dreams and for living Have welcomed us by the ages coming. Our fealty to you gave us vitality. So it was, so it is, so it shall e'er be! Chorus ===In regional languages=== Because Russia has so many different languages, the anthem has been translated into many of them. Due to the small amount of space, only the anthem's chorus in some of these languages is shown. Tatar Chechen Chuvash Bashkir Sakha Buryat Udmurt Avar Mordovian Ossetian Mari Karachay-Balkar ==References== anthem Category:Songs in Russian",
 "title": "National anthem of Russia"
}