{
 "id": "16317",
 "text": "William McKinley (January 29, 1843September 14, 1901) was an American politician who served as the 25th president of the United States from 1897 until his assassination in 1901. Before becoming president, he was the 39th governor of Ohio from 1892 to 1896. During his presidency, he successfully led the U.S. in the Spanish–American War, during the period of American expansionism with the annexations of Puerto Rico, Guam, the Philippines, and Hawaii. ==Presidency== McKinley was inaugurated in 1897. This was the first presidential inauguration to be filmed, making McKinley the first U.S. president to be filmed. When the USS Maine was sunk, the public wanted war. Congress declared war against Spain in Latin America. This was the Spanish- American War. It started the era of imperialism for the United States. During his presidency, McKinley also supported higher tariffs (taxes on countries which trade with the US). During his term, the United States annexed Hawaii, Cuba, the Philippines, and Wake Island. McKinley was elected to a second term as president in 1900. His second term did not last very long. ==Death== McKinley was shot by an anarchist named Leon Czolgosz on September 6, 1901. His abdominal gunshot wounds became infected and resulted in gangrene. He died eight days later and Czolgosz said that the President committed war crimes in the Philippines and was an enemy of the people. Czolgosz was executed in the electric chair on October 29, 1901. McKinley was the third American president to be assassinated. After McKinley's death, his vice president Theodore Roosevelt became president. == Praise == McKinley's biographer, H. Wayne Morgan remarks that McKinley died the most beloved president in history.Morgan, H. Wayne 2003. William McKinley and his America. Kent, Ohio: The Kent State University Press (revised ed.) ISBN 978-0-87338-765-1 Kenneth F. Warren emphasizes the national commitment to a pro-business, industrial, and modernizing program, represented by McKinley. ==Notes== == References == == Other websites == * William McKinley's White House biography Category:1843 births Category:1901 deaths Category:Deaths from gangrene Category:Assassinated presidents of the United States Category:Murders by firearm in New York (state) Category:People from Canton, Ohio Category:People murdered in New York (state) Category:Politicians from Ohio Category:Presidents of the United States Category:20th-century American politicians Category:19th-century American politicians Category:Republican Party (United States) politicians Category:Nationalists Category:20th-century presidents of the United States Category:19th-century presidents of the United States Category:National presidents assassinated in the 20th century",
 "title": "William McKinley"
}