{
 "id": "163210",
 "text": "Cloud Cult is an indie rock band from Minneapolis, Minnesota that is led by singer and songwriter Craig Minowa. Their name came from the old sayings of the Native Americans. == History == The band was made in 1995, when Minowa got other musicians together to help out with some of his solo music, or music made by himself. The band's early music was liked by many record labels. The labels made many offers to sell Cloud Cult's music, but the band decided to self-publish instead, which means that they make their albums themselves without the help of a company. As the band became more popular and started playing live more often, Connie Minowa and Scott West started painting onstage during shows. In 1997, Craig Minowa started Earthology Records on his organic farm. The new record company now sells the bands' music. The band's newest album, Feel Good Ghosts (Tea-Partying Through Tornadoes) was released on April 8, 2008. The album is their most popular album yet. Also in 2008, a documentary about the band was made. After the album was released, Craig Minowa said that it might be the last Cloud Cult album ever. Raihala, Ross. \"The Band: Cloud Cult.\" _St. Paul Pioneer Press_ 6 Apr. 2008: E8. The band is currently taking a break, so the members can focus on their families. In October of 2008, the band had a song in an animated Esurance commercial. The band is shown playing their instruments while floating on clouds. After making the commercial, the band put a few songs on Esurance's website. The songs are available to freely download. == Band members == * Craig Minowa - singer/songwriter * Arlen Peiffer - drums * Sarah Young - cello * Shannon Frid - violin * Shawn Neary - bass/trombone * Connie Minowa - visual artist * Scott West - visual artist/trumpet * Allan Wetzel - visual artist/keyboard == Studio albums == * The Shade Project (1995) * Who Killed Puck? (2001) * They Live on the Sun (2003) * Aurora Borealis (2004) * Advice from the Happy Hippopotamus (2005) * The Meaning of 8 (2007) * Feel Good Ghosts (Tea-Partying Through Tornadoes) (2008) * Light Chasers (2010) * Love (2013) * The Seeker (2016) == References == == Other websites == * *Cloud Cult info (PDF) *Cloud Cult performing on The Current in March 2007 *Cloud Cult Interview at REDEFINE Magazine, June 2006 *Cloud Cult feature with Craig Minowa at groundcontrolmag.com, March 2007 Category:American rock bands Category:Indie rock bands Category:Musical groups from Minnesota Category:Musicians from Minneapolis Category:Musical groups established in 1995",
 "title": "Cloud Cult"
}