{
 "id": "163212",
 "text": "The Aristocats is a 1970 American animated musical adventure-romantic comedy movie. It was produced by Walt Disney Productions and released by Buena Vista Distribution. It is the 20th Disney animated movie. The movie is based on a story by Tom McGowan and Tom Rowe. It is about a family of aristocratic cats. They are kidnapped by their greedy butler, Edgar. Edgar wants to gain the fortune that the cats' owner has left to them in her will. An alley cat named Thomas O'Malley helps them make their way back home. O'Malley also helps them defeat Edgar. In the end, O'Malley becomes a part of the family. The movie was directed by Wolfgang Reitherman. It features the voices of Eva Gabor, Hermione Baddeley, Phil Harris, Dean Clark, Sterling Holloway, Scatman Crothers and Roddy Maude-Roxby. In 1962, The Aristocats began as an original script for a two-part live-action episode of Walt Disney's Wonderful World of Color. It was developed by writers Tom McGowan and Tom Rowe and producer Harry Tytle. Following two years of re-writes, Walt Disney said that the project would be better made as an animated movie. The project was placed in turnaround as The Jungle Book continued production. When The Jungle Book was nearly complete, Disney appointed Ken Anderson to develop preliminary work on The Aristocats. It was the last movie project to be approved by Walt Disney before his death on December 15, 1966. The Aristocats was the first Disney animated movie to be released under the Rating System. In this case, The Aristocats was Disney's first G-rated animated movie. The Aristocats was released on December 11, 1970. It received positive reception and was a box office success. ==Plot== The movie takes place in Paris in 1910. A retired opera singer named Madame Adelaide Bonfamille arrives at home with her cats: a mother cat named Duchess and her three kittens, Marie, Berlioz and Toulouse. Duchess, Toulouse, Marie and Berlioz are going to receive their owner's fortune when she dies. But Edgar, their English butler, does not like this and plans to send the cats away. He places sleeping tablets in their dinner. At night, he plans on dropping them off in the countryside. Two hound dogs, Napoleon and Lafayette, attack him and the cats are now stranded. In the morning, they meet an alley cat named Thomas O'Malley. He helps them on their way back home. He even lets them stay at his \"pad\" (the place where he and his \"gang\", or friends, stay). They finally make their way back home, but Edgar re-catches them in a sack and plans to send them to Timbuktu, Africa. O'Malley, Scat Cat and his gang, Roquefort the Mouse and Frou-Frou the Horse all fight Edgar. Roquefort frees Duchess and the kittens. In the end, Edgar is kicked into the trunk, locked inside, and sent to Timbuktu himself. Madame Adelaide's will is re-written to not include Edgar and instead include O'Malley. She also starts a charity foundation. This foundation gives a home to all the creatures in Paris. ==Cast== * Eva Gabor as Duchess - Madame Adelaide's cat and mother of three kittens. She has to choose between loyalty to Madame and her own attachment to Thomas O'Malley, until the end of the movie. Robie Lester provided the singing voice for Duchess. * Phil Harris as Thomas O'Malley (full name: Abraham de Lacy Giuseppe Casey Thomas O'Malley) – An alley cat who befriends Duchess and her kittens. He becomes a father figure to the kittens and falls in love with Duchess. * Liz English as Marie - the middle kitten. She is something of a singer. * Gary Dubin as Toulouse - the oldest kitten. He idolizes all alley- cats, especially Thomas. He is also a talented painter and is loosely based on French painter Henri de Toulouse-Lautrec. * Dean Clark as Berlioz - the youngest kitten. He is somewhat shy. He is also a talented pianist and is loosely based on French pianist Hector Berlioz. * Roddy Maude-Roxby as Edgar Balthazar - Madame Adelaide's dim-witted butler. He tries to get rid of the cats in order to gain her fortune. He speaks English with an English accent. * Scatman Crothers as Scat Cat - Thomas's best friend and leader of a gang of jazz-playing alley cats. Scat Cat plays the trumpet. * Sterling Holloway as Roquefort - A house mouse and also a friend of the cats. He helps the animals defeat Edgar. * Paul Winchell as Shun Gon - a Chinese cat in Scat Cat's gang. Plays the piano and drums made out of pots. He speaks Chinese with a Chinese accent. * Lord Hudson as Hit Cat - an English cat in Scat Cat's gang. Plays acoustic guitar. He speaks English with an English accent. * Vito Scotti as Peppo - an Italian cat in Scat Cat's gang. Plays the accordion. He speaks Italian with an Italian accent. * Thurl Ravenscroft as Billy Boss - a Russian cat in Scat Cat's gang. Plays the double bass. He speaks Russian with a Russian accent. * Pat Buttram as Napoleon - a bloodhound who attacks Edgar when he intrudes in the farm where Napoleon lives. Napoleon insists, whenever cohort Lafayette makes a suggestion, that he is in command, then adopts Lafayette's suggestion as his own. He speaks in the US Southern with the US Southern accent. * George Lindsey as Lafayette - a basset hound and Napoleon's companion. He sometimes proves smarter than Napoleon, but is also more shy. He also speaks in the US Southern with the US Southern accent too. * Hermione Baddeley as Madame Adelaide Bonfamille - a former opera singer and owner of Duchess and her kittens. * Charles Lane as Georges Hautecourt - Madame Bonfamille's lawyer. He is an eccentric, lively old man who provides comic relief by attempting stairs too steep for himself. He speaks Canadian with a Canadian accent. * Nancy Kulp as Frou-Frou - Roquefort's horse companion, who subdues Edgar. Ruth Buzzi provided her singing voice. * Monica Evans as Abigail Gabble - a goose who befriends the cats. She speaks British with a British accent. * Carole Shelley as Amelia Gabble - Abigail's twin sister. She also speaks British with a British accent too. * Bill Thompson as Uncle Waldo - the drunken gander uncle of Abigail and Amelia. * Jimmy MacDonald as Frog * Peter Renaday as French Milkman/Le Petit Cafe Cook/Truck Movers ==Release== ===Home media=== The Aristocats was released on VHS in Europe on January 1, 1990. It was first released on VHS in North America in the Walt Disney Masterpiece Collection series on April 24, 1996. In January 2000, Walt Disney Home Video launched the Walt Disney Gold Classic Collection, with The Aristocats re-released on VHS and DVD on April 4, 2000. The DVD contained the movie in its 1.33:1 aspect ratio and 2.0 Dolby surround sound. The Gold Collection release was quietly discontinued in 2006. A new Special Edition DVD was released on February 5, 2008. Disney released the movie for the first time on Blu-ray on August 21, 2012. The 2-disc Special Edition Blu-ray/DVD combo (both in Blu-ray and DVD packaging) features a new digital transfer and new bonus material. A single disc DVD edition was also released on the same day. == Soundtrack == # \"The Aristocats\" - Maurice Chevalier \"The Aristocats\" is the title song from the movie. It was written by Robert and Richard M. Sherman at the end of their eight years with Walt Disney Productions. Maurice Chevalier came out of retirement to sing this song for the movie's soundtrack. He recorded it in English as well as in French translation (\"\"). # \"Scales and Arpeggios\" - Liz English, Gary Dubin, Dean Clark, Robie Lester # \"Thomas O'Malley Cat\" - Phil Harris # \"Everybody Wants to Be a Cat\" - Phil Harris, Scatman Crothers, Thurl Ravenscroft, Vito Scotti, Paul Winchell, Liz English, Lord Tim Hudson and Robie Lester; This song is sung by Scatman Crothers as Scat Cat, Phil Harris as Thomas O'Malley Cat, Robie Lester as Duchess's singing voice, Lord Tim Hudson as Hit Cat, Liz English as Marie, Vito Scotti as Peppo the Italian Cat and Thurl Ravenscroft as Billy Boss the Russian Cat. It was also released as a 45 rpm single, in a version sung only by Phil Harris. That version doesn't have the cartoon voices of the other release. The soundtrack CD released in 1996 has an edited version of the song. The now politically incorrect lines sung by \"Chinese Cat\" voiced by Paul Winchell are removed. # \"She Never Felt Alone\" - Robie Lester # \"Ev'rybody Wants to Be a Cat (reprise)\" - Phil Harris, Scatman Crothers, Thurl Ravenscroft, Vito Scotti, Paul Winchell, Ruth Buzzi, Bill Thompson, Lord Tim Hudson Classic Disney: 60 Years of Musical Magic includes \"Thomas O'Malley Cat\" on the purple disc and \"Everybody Wants to Be a Cat\" on the orange disc. Disney's Greatest Hits includes \"Ev'rybody Wants to Be a Cat\" on the red disc. ==References== ==Other websites== * * * * (dead link) Category:American family comedy movies Category:1970s animated movies Category:1970s family movies Category:1970 romantic comedy movies Category:American musical comedy movies Category:American romantic comedy movies Category:American animated romance movies Category:American animated musical movies Category:Disney animated movies Category:Movies about cats Category:Movies set in Paris Category:Movies composed by George Bruns Category:Movies about mice Category:Movies about horses Category:Movies about old age Category:Movies directed by Wolfgang Reitherman Category:Movies set in the 1910s Category:1970s English-language movies Category:1970 adventure movies Category:1970s American adventure movies Category:Adventure comedy movies Category:Movies about families Category:Movies about inheritances Category:1970s American musical movies Category:1970 musical movies",
 "title": "The Aristocats"
}