{
 "id": "163554",
 "text": "Jordan Galland is a singer-songwriter and an award winning movie-maker from New York City. He has worked with Sean Lennon,Romantics:Dopo Yume Wear their Hearts on Their Sleeves www.fashionfollower.com and Mark Ronson *Galland's band, Domino, released an EP in 2006 and signed a contract with Mark Ronson's Allido Records label. Galland's band Dopo Yume played shows with Jason Schwartzman 's band Phantom Planet. *Galland was a co-writer on some of Daniel Merriweather's songs on his album Love and War produced by Mark Ronson In 2005, Galland appeared with actors Lindsay Lohan, Carrie Fisher, and Jordana Brewster in Sean Lennon's independent movie Friendly Fire. *Galland's first full-length movie, Rosencrantz and Guildenstern Are Undead, was filmed in New York City during December 2007 and debuted at the 2009 Slamdance Film Festival.\"Slamdance: Rosencrantz and Guildenstern Are Undead's Jordan Galland\", Alicia Van Couvering, Filmmaker Magazine, January 19, 2009. This movie is premiering in Canada during Canada Music Week. *Galland used the Red Camera,www.filmmakermagazine.com Spring issue 2008 a new cutting edge technology in movies. ==Trivia== *Galland's band Dopo Yume was a semifinalist in a nation wide AOL contest, beating out thousands of applicants *Actress Milla Jovovich appeared briefly as a boxhead character in his movie \"Smile for the Camera\"; they had met when Jordan was a teenager and had snuck into a bar. *in the November 2007 issue of Vogue (magazine),of Vogue Magazine article Jordan and band mate Domino Kirke were part of a feature modeling clothing in a contest featuring up and coming clothing designers. == List of credits == * Galland co-wrote the song \"Spectacle\", which appeared in Lennon's movie \"Friendly Fire\". * Domino's song \"Tropical Moonlight\" is on the soundtrack of the movie 21. *Numerous song contributions in National Lampoons' Adam and Eve. * Another band of Galland's, Dopo Yume, had a song on The O.C., in the episode \"The Day After Tomorrow\". *Galland played the electric piano on Mark Ronson's album Version * Galland's band Domino opened for Lily Allen in New York in 2006 ==Filmography== Year Title Comments 2005 Green Umbrella Writer/actor 2008 'Day of the Dead (2008 movie) Writer of the song \"Coolest Boy on Earth\" 2007 Rosencrantz and Guildenstern are undead Executive Producer 2008 Coin Locker Babies Screen Writer 2008 21 (movie) song on soundtrack by band Domino \"Tropical Moonlight\" == References == ==Other websites== * Category:1980 births Category:Living people Category:Singer-songwriters from New York (state) Category:American rock guitarists Category:American movie actors Category:Singers from New York City Category:Actors from New York City Category:Singers from Connecticut Category:Actors from Connecticut Category:American movie directors",
 "title": "Jordan Galland"
}