{
 "id": "163881",
 "text": "Thirty Seconds to Mars (commonly stylized as 30 Seconds to Mars) are an American rock band from Los Angeles, California, formed in 1998 by the band consists of brothers Jared Leto (lead vocals) and Shannon Leto (drummer). During the course of its existence, it has undergone various line-up changes with the Leto brothers being the only consistent members. ==History== ===Formation and first years (1998―2000)=== Created in 1998 by the actor Jared Leto and his brother Shannon, Thirty Seconds to Mars began as a small family project. Matt Wachter later joined the band as bassist and keyboard player. After working with two guitarists, Kevin Drake and Solon Bixler, the band auditioned Tomo Miličević to join the band. According to an interview from Virgin Records, the band's name; > \"Actually comes from a thesis that the band found online that was written by > a former Harvard professor. And one of the subsections of the thesis was > titled \"Thirty Seconds to Mars\" and he goes on to talk about the exponential > growth of technology that relates to humans and saying that we are quite > literally thirty seconds to mars. What it means to us is, we thought it best > described our music, in short.\" Even if Jared Leto is a major Hollywood actor, he prefers not to use this information to \"sell\" the band and he refuses to play shows where they use his name to promote the band. ===Debut album (2001―2004)=== Thirty Seconds to Mars retreated to the isolation of Wyoming's countryside in 2001 to record their debut album, working with producers Bob Ezrin and Brian Virtue. They contacted Ezrin because they grew up listening to his work with Pink Floyd, Kiss and Alice Cooper and they felt he was the only one who could help them capture the size and scope of what they wanted to accomplish on their debut recording. The band chose an empty warehouse lot on 15,000 acres (6,100 hectares), striving for the precise location that would enhance their sound. Even before the album was released, Puddle of Mudd invited Thirty Seconds to Mars to open a six-week tour for them in the spring of 2002. The band later embarked on a North American tour to support Incubus and began a club tour in August. The band released their first studio album, 30 Seconds to Mars, on August 27, 2002 by Immortal Records and Virgin Records, produced by Bob Ezrin and Brian Virtue. The first single, \"Capricorn (A Brand New Name)\", peaks at number 31 an the Billboard's Mainstream Rock Tracks. In the music video, the band members are in a desert where people are digging in mud pits. The band is playing in a ditch where others are watching them. The second single is \"Edge of the Earth\". The music video is created by a series of live clips of Thirty Seconds to Mars. It represents when Tomo Miličević joined in the band. ===A Beautiful Lie (2004―2008)=== Their second album, A Beautiful Lie, was released on August 30, 2005 by Immortal Records and Virgin Records, produced by Josh Abraham. The first single, \"Attack\", brought Thirty Seconds to Mars to world success. The video for the song was filmed in an abandoned hotel in Hollywood. In January 2006 this album was certified platinum by the Recording Industry Association of America for distribution of over one million albums. In March 2006 the band began their first tour from headliner, called Forever Night, Never Day. In October 2006 the band began their Welcome to the Universe Tour, sponsored by MTV2. The second single from the album is \"The Kill\", and it follows the success of the precedent single. It spent 52 weeks on the Billboard's Modern Rock Tracks. The music video is based on the American film Shining. This single won the MTV2 Award at the MTV Video Music Awards, Best Single at the Kerrang! Awards, Best Live Action at the MTVu Woodie Awards, Video of the Year and Best Rock Video at the MTV Australian Music Awards and Best Video Inspired By Film at the Fuse Chainsaw Awards. This single was also at number 18 on MTV Italy's list of Top 100 Hits of 2007. On March 1, 2007, while on tour in El Paso, Texas, Jared Leto announced to the arena that was the last concert of Thirty Seconds to Mars with Matt Wachter. He dedicated the final song of the show, \"R-Evolve\", to Matt. They are also played in various festivals as Roskilde, Rock am Ring, Pinkpop, Give It A Name and Download. The third single from the album is \"From Yesterday\" and it is a success too. The music video is based on the Italian film The Last Emperor. It is the first American rock video ever shot in its entirety in the People's Republic of China. This single peaks at number 1 on Billboard's Modern Rock Tracks, and also in Europe, Bolivia and Latvia Singles Chart. At this time, Thirty Seconds to Mars won also Best Artist at the TRL Awards Italy, Best Rock Artist at the MTV Europe Music Awards, Best of 2007 at the Fuse Awards and Best International Artist at the Bandit Rock Awards. The fourth single from the album is \"A Beautiful Lie\" and it is very success. The video is a montage of images of the Greenland, with scenes of the band playing on an iceberg. The single won the Video Star at the MTV Asia Awards and at the MTV Europe Music Awards, and in 2009 it was certified gold by MTV International. In April 2008, Thirty Seconds to Mars released only in Argentina the fifth single from the album, \"The Story\". Thirty Seconds to Mars in 2008 won Best Single for \"From Yesterday\" and Best International Band at the Kerrang! Awards, Best Rock Artist International at the MTV Latin America Awards and Best Rock Artist at the MTV Europe Music Awards where were one of the hosts. ===EMI lawsuit and This Is War (2008―2011)=== In August 2008, Virgin Records filed a $30 million lawsuit, claiming the band refused to deliver three albums as required by its contract. According to the lawsuit, the band \"repudiated\" a 1999 contract in July. On February 11, 2009 issue of Kerrang!, the working title for the new album is said to be This Is War. On Twitter, Jared released a bit of information about his trip to Haiti, and recorded a song called \"Hurricane\" with Kanye West and Brandon Flowers of The Killers. On April 28, they returned from EMI and the lawsuit was annulled. Soon after the announcement of the lawsuit settlement, Thirty Seconds to Mars told MTV News have promised to release This Is War by October 2009. According to their Twitter,30 Seconds to Mars on Twitter they have at least four songs done for their new album on May 27. Although these dates have been changed many times, Thirty Seconds to Mars have announced that This Is War will be released December 8, 2009. ===Love, Lust, Faith and Dreams (2012―2015)=== Thirty Seconds to Mars took a break from touring in 2012 and spent most of the year recording their fourth album, entitled Love, Lust, Faith and Dreams. The album was produced by Jared Leto with previous collaborator Steve Lillywhite. Leto said that the band took a new direction with Love, Lust, Faith and Dreams. He explained that the album \"is more than an evolution, it's a brand new beginning. Creatively, we've gone to an entirely new place, which is exciting, unexpected, and incredibly inspiring.\" In September 2012, Artifact, a documentary about the band's legal battle against the record label EMI and the making of This Is War, premiered at the Toronto International Film Festival and won the People's Choice Documentary Award. In February 2013, it was announced that \"Up in the Air\" would be the first single from the fourth album. In partnership with NASA, Thirty Seconds to Mars launched the first copy of \"Up in the Air\" aboard the Dragon spacecraft on SpaceX CRS-2. The mission was launched atop a Falcon 9 rocket on March 1, 2013, sending the first ever commercial copy of music into space. On March 18, 2013, the single premiered from the International Space Station, after a Q&A; session with the band and Expedition 35 flight engineer Tom Marshburn, while Annise Parker, mayor of the city of Houston, proclaimed the Thirty Seconds to Mars Day. \"Up in the Air\" made its radio debut on March 18 and became commercially available for downloading the following day. The song reached number three on the US Alternative Songs chart and experienced success in international markets. Thirty Seconds to Mars released Love, Lust, Faith and Dreams on May 21, 2013, through Universal in the United States. The album received generally positive reviews and reached the top ten in more than fifteen countries, including the United Kingdom and the United States. The band began their Love, Lust, Faith and Dreams Tour in June, which included festival dates at Rock Werchter, Pinkpop, Rock in Rio, and Rock am Ring. The second single from the album, \"Do or Die\", achieved a level of play on modern rock radio, while \"City of Angels\", the third single, was released to rave reviews from critics and eventually reached number eight on the Alternative Songs chart in the US. At the 2013 MTV Video Music Awards, held on August 25, \"Up in the Air\" won the award for Best Rock Video. Thirty Seconds to Mars announced on April 25, 2014 that they have parted from Virgin Records after tumultuous years with the label, with Leto telling Billboard, \"We're free and clear and excited about the future. It's the most wonderful place to be.\" In August 2014, the group embarked on a double-headline tour, dubbed the Carnivores Tour, with American rock band Linkin Park, visiting arenas and stadiums throughout North America. Thirty Seconds to Mars then launched a music festival called Camp Mars. The first edition took place in Malibu, California, in August 2015 and included a series of activities in a semi- rustic setting and several DJ sets. ===America and the departure of Miličević (2015―2021)=== On November 3, 2015, it was announced that Thirty Seconds to Mars was working on their fifth studio album. In August 2016, the band revealed to have signed to Interscope Records. The group later unveiled that they would embark on a North American tour with Muse and PVRIS, which took place from May to September 2017. In August 2017, \"Walk on Water\" was announced as the lead single from the band's fifth album. Thirty Seconds to Mars then performed the song at the 2017 MTV Video Music Awards featuring special guest Travis Scott. During the ceremony, Jared Leto received media attention for his tribute to musicians Chester Bennington and Chris Cornell, who both died earlier that year. On January 25, 2018, Thirty Seconds to Mars released \"Dangerous Night\" as the second single from their upcoming fifth studio album. In February 2018, the band officially announced the Monolith Tour with Walk the Moon, Misterwives, K. Flay, Joywave, and Welshly Arms. Thirty Seconds to Mars later confirmed America as title of their fifth album, which was released on April 6, 2018. The album received polarized reviews from critics and debuted at number two on the Billboard 200, becoming the band's highest entry on the chart. America also reached the top ten in seventeen other countries, including number one in Germany and Austria. During the first leg of the Monolith Tour, it was announced that Miličević would be taking a break from touring due to personal matters. On June 11, 2018, he officially announced his departure from the band. ===It's the End of the World but It's a Beautiful Day (since 2021)=== On October 5, 2021, Leto announced that he would be featured in a song with Illenium called \"Wouldn't Change a Thing\". On August 27, 2022, Thirty Seconds to Mars announced a commemorative 20th- anniversary version of its debut album. On February 22, 2023, it was announced that the band would be playing at When We Were Young on October 22. On May 8, Thirty Seconds to Mars released \"Stuck\", the lead single from their upcoming sixth studio album, It's the End of the World but It's a Beautiful Day, which was released on September 15. The second track of the album, \"Life Is Beautiful\", was released as promotional single on June 9. ==Band members== ===Current members=== * Jared Leto – lead singer, rhythm guitar, bass guitar, lyrics producer * Shannon Leto – drums, percussion ===Former members=== * Matt Wachter – bass guitar, keyboard/synth * Solon Bixler – guitar * Tomo Miličević - lead guitar ===Touring musicians=== * Tim Kelleher – bass guitar, keyboard/synth * Kevin Drake – guitar ===Timeline=== TimeAxis = orientation:horizontal format:yyyy ImageSize = width:750 height:250 PlotArea = width:700 height:200 bottom:20 left:20 Colors = id:canvas value:rgb(0.97,0.97,0.97) id:grid1 value:rgb(0.86,0.86,0.86) id:grid2 value:gray(0.8) id:bars value:rgb(0.96,0.96,0.6) id:bg value:white id:2color value:rgb(1,1,0.6) BackgroundColors = canvas:bg Period = from:1998 till:2022 ScaleMajor = unit:year increment:1 start:1998 gridcolor:grid1 BarData= barset:Bandmembers PlotData= # set defaults width:20 fontsize:m textcolor:black align:left anchor:from shift:(10,-4) color:bars barset:Bandmembers from:1998 till:2022 text:\"Jared Leto\" color:2color from:1998 till:2022 text:\"Shannon Leto\" from:1999 till:2001 text:\"Kevin Drake\" color:2color from: 2000 till:2003 text:\"Solon Bixler\" from:2001 till:2007 text:\"Matt Wachter\" color:2color from: 2003 till:2018 text:\"Tomo Miličević\" from:2007 till:2010 text:\"Tim Kelleher\" ==Discography== ===Studio albums=== * 2002 - 30 Seconds to Mars * 2005 - A Beautiful Lie * 2009 - This Is War * 2013 - Love, Lust, Faith and Dreams * 2018 - America * 2023 - It's the End of the World but It's a Beautiful Day ===Singles=== * 2002 - Capricorn (A Brand New Name) * 2003 - Edge of the Earth * 2005 - Attack * 2006 - The Kill * 2006 - From Yesterday * 2007 - A Beautiful Lie * 2009 - Kings and Queens * 2010 - This Is War * 2010 - Closer to the Edge * 2010 - Hurricane (featuring Kanye West) * 2013 - Up in the Air * 2013 - Do or Die * 2013 - City of Angels * 2017 - Walk on Water * 2018 - Dangerous Night * 2018 - Rescue Me * 2023 - Stuck * 2023 - Seasons ===EPs=== * 2002 - Acoustic Live Radio Show ===Other songs=== * 2003 - Echelon ==Concert tours== * Forever Night, Never Day Tour (2006) * Welcome to the Universe Tour (2006) * A Beautiful Lie Tour (2007–08) * Into the Wild Tour (2010–11) * Love, Lust, Faith and Dreams Tour (2013–15) * Carnivores Tour (2014) * Monolith Tour (2018–19) * Seasons Tour (2024) ==Awards== ==References== ==Other websites== * 30 Seconds to Mars Official website * ABeautifulLie.org Category:1998 establishments in California Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American hard rock bands Category:Post-grunge bands Category:Musical groups from Los Angeles Category:American alternative rock bands Category:Musical groups established in 1998",
 "title": "Thirty Seconds to Mars"
}