{
 "id": "163837",
 "text": "A cilium (plural cilia) is an organelle found in eukaryotic cells. Cilia are slender protuberances that project from the much larger cell body. There are two types of cilia: #motile cilia, which beat against fluid outside the cell. #non-motile, or primary cilia, which typically serve as sensory organelles. In eukaryotes, cilia and flagella together make up a group of organelles known as undulipodia. A Dictionary of Biology , 2004, accessed 2010-04-06. Eukaryotic cilia are structurally identical to eukaryotic flagella, although distinctions are sometimes made according to function and/or length. Motile cilia are found on protist ciliates like Paramecium. They are how Paramecium moves around. They are also found on the epithelial cells of many internal organs of metazoans, such as the digestive system and the trachea of the lungs. == Cilia in metazoa == Non-motile (or primary) cilia usually occur one per cell; nearly all mammalian cells have a single non-motile primary cilium. In addition, examples of specialized primary cilia can be found in human sensory organs such as the eye and the nose: * The outer segment of the rod photoreceptor cell in the human eye is connected to its cell body with a specialized non- motile cilium. * The dendritic knob of the olfactory neuron, where the odorant receptors are located, also contains non-motile cilia (about 10 cilia per dendritic knob). == Status of cilia == Cilia are structurally almost identical with the much larger flagella. So much so that it has been proposed protists bearing either should be unified in the Phylum Undulipodia.Margulis L & Dolan M.F. 2002. Early life: evolution on the Precambrian Earth. 2nd ed, Jones & Bartlett, Boston. p89 Previously, Margulis had proposed that the Ciliates alone should be placed in a Phylum Ciliophora.Margulis L. Schwartz K.V. & Dolan M. 1999. Diversity of life: the illustrated guide to the five kingdoms. Jones & Bartlett, Boston, p94. In this work the authors propose 19 phyla for the Protista, and call this 'Kingdom' the 'Protoctista', a term which is unfortunately almost unpronounceable. Admittedly, the Protista is a collection of disparate single-celled forms, but while a more sophisticated taxonomy is in flux (changing), Protista is still a useful term. Cilia and flagella are cell organelles, specialised units which carry out well-defined functions, like mitochondria and plastids. It is fairly certain now that all or most of these organelles have their origin in once-independent prokaryotes (bacteria or archaea), and that the eukaryote cell is a 'community of micro-organisms' working together in 'a marriage of convenience'.Margulis L. and McMenamin 1990. Marriage of convenience. The Sciences 30, 31-36. == References == Category:Ciliates Category:Organelles",
 "title": "Cilia"
}