{
 "id": "164122",
 "text": "This is a list of the tallest buildings in New York City. ==Tallest buildings in New York City== Rank Name Image Height ft (m) Floors Year Notes 1 One World Trade Center 1,776 ft. (541m) 104 2014 Is the 6th-tallest building in the world and the tallest building in the United States since its topping out on May 10, 2013. It is also the tallest building in the Western Hemisphere and the tallest all-office building in the world. Completed 13 years after the 9/11 attacks, it stands just feet away from where the original Twin Towers stood which was made into a memorial with two pools outlining the old towers. 2 432 Park Avenue* 1,400 ft.(426m) 96 2015 Tallest residential building in the Western Hemisphere; 15th-tallest building in the world; 3rd-tallest building in the United States. Topped out on October 10, 2014. 3 30 Hudson Yards 1,296 ft. (395m) 85 2019 Opened March 15, 2019, it has the highest outdoor observation deck in the western hemisphere that includes an area of all glass floor where you can look straight down at the street below you. 4 Empire State Building 1,250 ft. (381 m) 1,454 ft.(to the top of the spire) 102 1931 25th-tallest building in the world, 5th-tallest in the United States; the first building in the world to contain over 100 floors. The spire was not an original part of the building but was actually added later on which is why some architects don't count it when talking about the building's height. The building was built in just 14 months during the Great Depression, it was the tallest building in the world from its completion in 1931 until the World Trade Center was completed in 1972, and was again New York City's tallest building from 2001 until 2013 after the World Trade Center was destroyed in the terrorist attacks of September 11, 2001.One World Trade Center surpassed the Empire State Building by on April 30, 2012, at 2:12 PM EDT 5 Bank of America Tower 1,200 ft. (366m) 55 2009 30th-tallest building in the world, 6th-tallest in the United States; first skyscraper to receive a Platinum LEED certification 6= Chrysler Building 1,046 ft. (319m) 77 1930 57th-tallest building in the world, 8th-tallest in the United States; the first building in the world to rise higher than ; stood as the tallest building in the world from 1930 until 1931 until the Empire State Building was built; tallest steel-framed brick building in the world 6= The New York Times Building 1,046 ft. (319m) 52 2007 66th-tallest building in the world, 8th- tallest in the United States; also known as the Times Tower 8 One57 1,005 (306) 75 2014 Topped out in June 2012; will become the tallest mixed-use (residential and hotel) skyscraper in the city upon completion81st-tallest building in the world 9 Four World Trade Center 978 ft. (298m) 74 2013 Also known as 150 Greenwich Street, part of the rebuilding of the World Trade Center, topped out on June 24, 2012, opened on November 13, 2013 10 70 Pine Street 952 ft. (290m) 66 1932 20th-tallest building in the United States; formerly known as the American International Building and the Cities Service Building 70 Pine is being transformed into a residential skyscraper with 644 rental residences, 132 hotel rooms and 35,000 square feet of retailCuozzo, Steve. \"New plans for downtown’s 70 Pine St. are sky-high\" New York Post (October 29, 2013) 11 The Trump Building 927 (283) 70 1930 24th-tallest in the United States; was world's tallest building for less than two months in 1930; formerly known as the Bank of Manhattan Trust Building; currently known as the Trump Building, a more permanent name is 40 Wall Street 12 Citigroup Center 915 (279) 59 1977 Formerly Citicorp Center and now known as 601 Lexington Avenue 13 8 Spruce Street 870 (265) 76 2011 Also known as Beekman Tower and New York by Gehry; 14 Trump World Tower 861 (262) 72 2001 Third-tallest all- residential building in the city; tallest residential building in the world from 2000 until 2003 15 GE Building 850 (260) 70 1933 Formerly known as the RCA Building; colloquially referred to as \"30 Rock\" for its address, 30 Rockefeller Center; houses the Top of the Rock, the second-highest observation deck in New York 16 CitySpire Center 814 (248) 75 1987 Tallest mixed-use (residential and commercial) skyscraper in the city 17 One Chase Manhattan Plaza 813 (248) 60 1961 18 Condé Nast Building 809 (247) 48 1999 Also known as Four Times Square 19 BlackRock Building 808 (246) 59 1963 Formerly known as the Pan Am Building 20 731 Lexington Avenue 806 (246) 54 2005 21 Woolworth Building 792 (241) 57 1913 Tallest building in the world from 1913 until 1930 22 One Worldwide Plaza 778 (237) 50 1989 23 Carnegie Hall Tower 757 (231) 60 1991 24 383 Madison Avenue 755 (230) 47 2001 Formerly known as Bear Stearns World Headquarters 25 1717 Broadway 753 (229) 68 2013 Tallest hotel in the western hemisphere 26 AXA Equitable Center 752 (229) 54 1986 Formerly known as the Equitable Building and Equitable Center West 27= One Penn Plaza 750 (229) 57 1972 27= Exxon Building 750 (229) 54 1971 Also known as 1251 Avenue of the Americas 27= Time Warner Center South Tower 750 (229) 55 2004 27= Time Warner Center North Tower 750 (229) 55 2004 31 200 West Street 749 (228) 44 2010 Also known as Goldman Sachs World Headquarters 32= 60 Wall Street 745 (227) 55 1989 Also known as Deutsche Bank Building 32= One Astor Plaza 745 (227) 54 1972 34 One Liberty Plaza 743 (226) 54 1973 Formerly known as the U.S. Steel Building 35= 20 Exchange Place 741 (226) 57 1931 Formerly known as the City Bank-Farmers Trust Building 35= 7 World Trade Center 741 (226) 52 2006 37 200 Vesey Street 739 (225) 51 1986 Also known as American Express Tower 38 Bertelsmann Building 733 (223) 42 1990 39 Times Square Tower 726 (221) 47 2004 40 Metropolitan Tower 716 (218) 77 1987 41 500 Fifth Avenue 709 (216) 60 1931 42 JP Morgan Chase World Headquarters 707 (215) 52 1960 43 General Motors Building 705 (215) 50 1968 44 Metropolitan Life Insurance Company Tower 700 (213) 50 1909 Tallest building in the world from 1909 until 1913 45 Americas Tower 692 (211) 50 1992 46 Solow Building 689 (210) 50 1974 47 HSBC Bank Building 688 (210) 52 1967 Also known as Marine Midland Building 48= 55 Water Street 687 (209) 53 1972 48= 277 Park Avenue 687 (209) 50 1962 50 Morgan Stanley Building 685 (209) 42 1989 Also known as the Morgan Stanley World Headquarters 51 Random House Tower 684 (208) 52 2003 52 Four Seasons Hotel New York 682 (208) 52 1993 Tallest all-hotel building in the city 53 McGraw-Hill Building 674 (205) 51 1969 Also known as 1221 Avenue of the Americas 54= Lincoln Building 673 (205) 55 1930 54= Barclay Tower 673 (205) 56 2007 56 Paramount Plaza 670 (204) 48 1971 57 Trump Tower 664 (202) 58 1983 58 One Court Square 658 (201) 50 1990 Tallest building in New York City outside of Manhattan; tallest building on Long Island and in the Borough of Queens; formerly known as the Citigroup Building 59 1 Wall Street 654 (199) 50 1931 60= 599 Lexington Avenue 653 (199) 50 1986 60= Silver Towers I 653 (199) 60 2009 Also known as River Place 60= Silver Towers II 653 (199) 60 2009 Also known as River Place 63 712 Fifth Avenue 650 (198) 52 1990 64 Chanin Building 649 (198) 56 1930 65 245 Park Avenue 648 (198) 44 1966 66 Sony Tower 647 (197) 37 1984 Formerly known as the AT&T; Building 67 225 Liberty Street 645 (197) 44 1987 68= 1 New York Plaza 640 (195) 50 1969 68= 570 Lexington Avenue 640 (195) 50 1931 Also known as the General Electric Building 70 MiMA 638 (195) 55 2011 71 345 Park Avenue 634 (193) 44 1969 72 400 Fifth Avenue — 631 (192) 57 2010 73= W. R. Grace Building 630 (192) 50 1971 73= Home Insurance Plaza 630 (192) 45 1966 73= 1095 Avenue of the Americas 630 (192) 40 1974 Also known as Verizon World Headquarters 73= W New York Downtown Hotel and Residences 630 (192) 57 2010 77 101 Park Avenue 629 (192) 49 1982 78= One Dag Hammarskjold Plaza 628 (191) 49 1972 78= Central Park Place 628 (191) 56 1988 78= 888 7th Avenue 628 (191) 46 1971 81= Waldorf Astoria New York 625 (191) 47 1931 81= Burlington House 625 (191) 50 1969 83 Trump Palace Condominiums 623 (190) 54 1991 84= Olympic Tower 620 (189) 51 1976 84= Mercantile Building 620 (189) 48 1929 Also known as 10 East 40th Street 86= 425 Fifth Avenue 618 (188) 55 2003 86= One Madison 618 (188) 51 2010 88= 919 Third Avenue 615 (187) 47 1971 88= New York Life Building 615 (187) 40 1928 88= 750 7th Avenue 615 (187) 40 1989 88= The Epic 615 (187) 58 2007 92= Eventi 614 (187) 54 2010 92= Tower 49 614 (187) 45 1985 93 Gotham point 612(186.5) 57 2023 94 Calyon Building 609 (186) 45 1964 95 Baccarat Hotel and Residences* — 606 (185) 48 2014 This building was topped out on August 23, 2013. 96 250 West 55th Street — 605 (184) 39 2013 This building was topped out in mid-2012. 97 The Orion 604 (184) 58 2006 98 590 Madison Avenue 603 (184) 41 1983 Also known as the IBM Building 99 11 Times Square 601 (183) 40 2010 Also known as Times Square Plaza 100 1166 Avenue of the Americas 600 (183) 44 1974 ===Tallest buildings by pinnacle height=== This lists ranks buildings in New York City based on pinnacle height measurement, which includes antenna masts. Standard architectural height measurement, which excludes non- architectural antennas in building height, is included for comparative purposes. An equal sign (=) following a rank indicates the same height between two or more buildings. The \"Year\" column indicates the year in which a building was completed. Pinn. Rank Std. Rank Name Pinnacle height ft (m) Standard height ft (m) Floors Year Sources 1 1 One World Trade Center 1,776 (541) 104 2014 2 3 Empire State Building 102 1931 {{|date=October 2019}} 3 2 432 Park Avenue 96 2015 4 4 Bank of America Tower 55 2009 5 17 Condé Nast Building 809 (247) 48 1999 6= 5= Chrysler Building 77 1931 6= 5= New York Times Building 52 2007 8 7 One57 75 2014 9 8 4 World Trade Center 977 (298) 977 (298) 72 2013 10 9 70 Pine Street 952 (290) 952 (290) 66 1932 11 19 Bloomberg Tower 941 (287) 54 2005 |} ===Tallest buildings in each borough=== This lists the tallest building in each borough of New York City based on standard height measurement. The \"Year\" column indicates the year in which a building was completed. Borough Name Height ft (m) Floors Year Source Bronx Harlem River Park Towers I & II 404 (123) 44 1975 Brooklyn 388 Bridge Street 590 (180) 53 2013 Manhattan One World Trade Center 104 2014 Queens One Court Square 658 (201) 50 1990 Staten Island Church at Mount Loretto 225 (69) 1 1894 == References == == Other websites == * Emporis.com - New York City High-rise Buildings New York City Category:Buildings and structures in New York City Category:Lists of buildings in the United States",
 "title": "List of tallest buildings in New York City"
}