{
 "id": "164166",
 "text": "was a Japanese football player and manager. He played for the Japan national team. He also managed Japan national team. ==Biography== ===Playing career=== Okano was born in Taito, Tokyo on August 28, 1931. His parents ran a well- established confectionery shop in Tokyo’s Ueno district. During the war his family escaped from the American air raids to Gunma Prefecture, but Okano stayed to attend a high school. In April 1949 he enrolled to the University of Tokyo and joined a football club there. In 1953 his team won the first national university championships. In 1955, he was selected the Japan national team. He played 2 games for Japan in 1955. ===Coaching career=== In March 1957, Okano graduated in psychology from the Faculty of Letters, and in early 1961 spent three months in West Germany to train as a football coach. Upon return he was appointed as a Japan national team assistant coach under manager Ken Naganuma, he also served as an interpreter for German coach Dettmar Cramer. In 1968 Summer Olympics, Japan won the bronze medals. In 2018, this team was selected Japan Football Hall of Fame. In 1970, he was promoted to the manager as successor Naganuma. He managed at 1970 Asian Games. However, at 1972 Summer Olympics qualification in 1971, following Japan's failure to qualify for 1972 Summer Olympics, Okano resined. In October 1974 he joined the Japan Football Association (JFA). Soon after that he became executive director of the Japanese Olympic Committee (JOC); in 1977 he was appointed as its general secretary and in 1989 as its executive director. In September 1990 he became a member of the IOC, and in 1995 of the FIFA Olympic Tournaments' Organizing Committee. He also served as 9th president of JFA (1998-2002) and 1st president of East Asian Football Federation (2004-2006). In 2005, Okano was selected Japan Football Hall of Fame. On February 2, 2017, Okano died of lung cancer in Tokyo Metropolis at the age of 85. ==Statistics== Japan National Football Team Database |- |1955||2||0 |- !Total||2||0 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1931 births Category:2017 deaths Category:Footballers from Tokyo Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan national football team managers Category:Cancer deaths in Japan Category:Deaths from lung cancer",
 "title": "Shunichiro Okano"
}