{
 "id": "164554",
 "text": "Armageddon (2008) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on December 14, 2008 at the HSBC Arena in Buffalo, New York. It was the ninth and last Armageddon event held by WWE. The following year, the company created TLC: Tables, Ladders & Chairs as their December PPV. Seven matches took place on the card. == Background == The main rivalry on the Raw brand was between John Cena and Chris Jericho, with the two fighting over the World Heavyweight Championship. At Survivor Series, Cena returned to the WWE after a neck injury and defeated Jericho to win the championship. On the November 24 episode of Raw, Jericho defeated Randy Orton and Batista (David Bautista) in a Triple Threat match to earn a championship match against Cena at Armageddon. The main rivalry on the SmackDown brand was between Edge, Triple H and Jeff Hardy over the WWE Championship. At Survivor Series, Edge returned to the WWE after a three-month absence after being announced as a replacement for Hardy, who was originally scheduled to face the defending champion Triple H and Vladimir Kozlov in a Triple Threat match for the championship, but was found unconscious in his hotel and did not compete in the match. Edge pinned Triple H and won the championship. On the November 29 edition of SmackDown, General Manager Vickie Guerrero announced a Beat the Clock Sprint tournament, where the one of the three competitors (Triple H, Hardy, and Kozlov) would face Edge at Armageddon for the WWE Championship. Both Triple H and Hardy beat their opponents at twelves minute and thirteen seconds. The next week, Vickie Guerrero announced that WWE board members had decided Edge would have to defend the title against both Triple H and Jeff Hardy. ECW's main rivalry was between ECW Champion Matt Hardy and Vladimir Kozlov. After Hardy had stopped Kozlov from being able to beat his brother's time in the Beat the Clock Sprint, Kozlov would gain revenge in the following weeks on SmackDown and ECW by assaulting Hardy, finally challenging him to a match, in which Hardy accepted. Another match that took place at Armageddon was the finals of a 8-man tournament for a WWE Intercontinental Championship title shot against the current champion, William Regal. On the November 11th Edition of Raw Stephanie McMahon ordered a tournament to determine who would be the next person to receive a shot at the title. The first round saw four standard matches: Kofi Kingston (Kofi Mensah) advance over Kane, due to Kane getting disqualified. CM Punk defeated Snitsky (Gene Snitsky) by pinning him following a GTS (Go To Sleep). John Morrison (John Hennigan) defeated Finlay (Dave Finlay) following a pin after an Enzuigiri. The final match of the opening round saw Rey Mysterio defeat The Miz (Mike Mizanin). The second round was started by Punk defeating John Morrison with the GTS, and Mysterio defeated Kingston by pinning him with an Oklahoma roll. As a result, CM Punk would wrestle Rey Mysterio in the finals of the tournament. Intercontinental Championship Tournament == Results == No. Results Stipulations Times 1 John Morrison and The Miz defeated Jesse and Festus Tag team match N/A 2 Vladimir Kozlov defeated Matt Hardy Singles match 9:02 3 CM Punk defeated Rey Mysterio Singles match for a future WWE Intercontinental Championship match 12:15 4 Finlay defeated Mark Henry (with Tony Atlas) Belfast Brawl 9:38 5 Batista defeated Randy Orton (with Cody Rhodes and Manu) Singles match 16:41 6 Maria, Kelly Kelly, Mickie James and Michelle McCool defeated Maryse, Jillian Hall, Victoria and Natalya Eight-Diva Santa's Little Helper tag team match 4:33 7 John Cena (c) defeated Chris Jericho Singles match for the World Heavyweight Championship 12:43 8 Jeff Hardy defeated Edge (c) and Triple H Triple Threat match for the WWE Championship 17:19 ==Related pages== * List of WWE pay-per- view events == References == == Other websites == * The official website of WWE Armageddon Category:2008 in professional wrestling Category:WWE Armageddon Category:Sports in Buffalo, New York Category:2008 in New York (state) Category:21st century in Buffalo, New York",
 "title": "Armageddon (2008)"
}