{
 "id": "164674",
 "text": "The rural district Zwickau is a district in west Saxony. It was founded at August 1, 2008. It consists of the (former) Chemnitzer Land Rural District and Zwickauer Land Rural District. It is the smallest district of Saxony but also the district with the highest population density of Saxony. == History == The district was formed on August 1, 2008. This was the result of an administration reform in Saxony. The rural district Zwickau was built up by the Chemnitzer Land Rural District, Zwickauer Land Rural District and the town of Zwickau. The county seat of the district is the biggest city Zwickau. However, the former county seats of the different districts were kept as outpost. Those are namely Glauchau, Limbach-Oberfrohna, Werdau and Hohenstein- Ernstthal. == Economy == In July 2008, there were 25,026 people jobless. That means there was a rate of unemployment of 11.1 percent. It was the lowest jobless rate of the Regierungsbezirk Chemnitz. Because of the end of the schoolyear the unemployment rate of pupils rose up.Dörfelt, Frank: Arbeitslosigkeit an 25.000er Grenze. Nach Ausbildungsende mehr Jugendliche arbeitslos. In: WochenSpiegel Werdau/Crimmitschau, Nr. 32 vom 6. August 2008, S. 3. == Education == In the rural district Zwickau is one Study Academy (called: Berufsakademie Glauchau) nine vocational schools and some grammar schools. Overall there are 124 schools. In Chemnitz and Zwickau are different Universities. == Politics == The Kreistag was elected on 8 June 2008.Result of the Kreistagswahl 2008 The current chief administrative officer of the Zwickau Rural District is Christoph Scheurer. Party Votes (%) Seats CDU 37,1 38 Die Linke 20,9 21 FDP 10,6 11 SPD 10,2 10 FW 9,0 9 Unabhängige Liste (UL) 3,8 3 NPD 3,3 3 Bündnis 90/Die Grünen 3,3 3 == Towns and municipalities == Towns Towns Municipalities Municipalities #Crimmitschau #Glauchau #Hartenstein #Hohenstein-Ernstthal #Kirchberg #Lichtenstein, Germany #Limbach-Oberfrohna # * Meerane #Oberlungwitz #Waldenburg #Werdau #Wildenfels #Wilkau-Haßlau #Zwickau #Bernsdorf #Callenberg #Crinitzberg #Dennheritz #Fraureuth #Gersdorf #Hartmannsdorf bei Kirchberg #Hirschfeld #Langenbernsdorf #Langenweißbach # * Lichtentanne #Mülsen #Neukirchen #Niederfrohna #Oberwiera #Reinsdorf #Remse #Sankt Egidien #Schönberg == References == == Other websites == * www.landkreis-zwickau",
 "title": "Zwickau (district)"
}