{
 "id": "164958",
 "text": "Philip IV (French: Philippe IV; 23 June 1268 — 29 November 1314) nicknamed the Fair (French: le Bel), the Handsome (French: le Beau), and the Iron King (French: le Roi Fer) was the King of France from 1285 until his death in 1314. As a result of his marriage to Queen Joan I of Navarre, he was also the King of Navarre and Count of Champagne (as Philip I) from their marriage in 1284 until Joan's death in 1305. He was the second son of King Philip III of France and Isabella of France. As the second son, he was never expected to become king. However, his older brother Louis died in 1276 when Philip was eight years old. Therefore, Philip became the Dauphin. In 1285, his father died and Philip became king. Philip, seeking to reduce the wealth and power of the nobility and clergy, relied instead on skillful civil servants, such as Guillaume de Nogaret and Enguerrand de Marigny, to govern the kingdom. The king, who sought an uncontested monarchy, compelled his upstart vassals by wars and restricted their feudal privileges, paving the way for the transformation of France from a feudal country to a centralized early modern state. Internationally, Philip’s ambitions made him highly influential in European affairs, and for much of his reign he sought to place his relatives on foreign thrones. Princes from his house ruled in Hungary, and he tried and failed to make another relative the Holy Roman Emperor. The most notable conflicts of Philip's reign include a dispute with the English over King Edward I's fiefs in southwestern France, and a war with the County of Flanders, who had rebelled against French royal authority and humiliated Philip at the Battle of the Golden Spurs in 1302. The war with the Flemish resulted in Philip's ultimate victory, after which he received a significant portion of Flemish cities, which were added to the crown lands along with a vast sum of money. Domestically, his reign was marked by struggles with the Jews and the Knights Templar. In heavy debt to both groups, Philip saw them as a \"state within the state\" and a recurring threat to royal power. In 1306 Philip expelled the Jews from France, followed by the total destruction of the Knights Templar the next year in 1307. To further strengthen the monarchy, Philip tried to tax and take control of the French clergy, leading to a violent dispute with Pope Boniface VIII. The ensuing conflict saw the pope's residence at Anagni attacked in September 1303 by French forces with the support of the Colonna family. Boniface was captured and held hostage for a number of days. This eventually resulted in the transfer of the papal court to the enclave of Avignon in 1309. His final year saw a scandal amongst the royal family, known as the Tour de Nesle affair, in which Philip's three daughters- in-law were accused of adultery. His three sons were successively kings of France: Louis X, Philip V, and Charles IV. Their rapid successive deaths without surviving sons of their own would compromise the future of the French royal house, which had until then seemed secure, precipitating a succession crisis that would eventually lead to the Hundred Years' War (1337–1453). Philip was a successful king. His long struggle with the Roman papacy ended with the transfer of the Curia to Avignon, France, beginning the Avignon Papacy (1309–77). He also secured French royal power by wars on barons and neighbours and by restriction of feudal usages. He was, by all accounts, an impressive ruler. Some Italian writers detested him and his line, but most contemporaries acknowledged his piety and good intentions, although many of them disapproved of his wars, his taxes, and his influential advisers. He left behind a stable and a powerful country. Category:1268 births Category:1314 deaths Category:Kings of France Category:People from Fontainebleau",
 "title": "Philip IV of France"
}