{
 "id": "165188",
 "text": "Metamorphoses (Metamorphoseon libri, \"Books of Changes\") is a literary work by Ovid. ==Overview== The Metamorphoses was written between 1 AD and 8 AD. The work consists of 15 books of between 700 and 900 verses of hexameters. Therein, Ovid describes the history of the world as it was seen by Roman and Greek mythology. Ovid selects those stories which happened often, a lower deity or a human is changed into an animal, a plant, or a star. The story starts with the beginning of the world, the flood. Only one couple survives the flood, Ducalion and Phyrrha. It ends with the change of the soul of Cesar into a star. ==Related pages== * Aesop * Homer * Paganism * The Odyssey * Roman Empire * Ancient Greece * Classical antiquity ==Other websites== * Latin text with English translation * Ovid Metamorphosen (Latin text, 2.300 illustrations) ** Ovid Illustrated: The Renaissance Reception of Ovid in Image and Text (An elaborate environment allowing simultaneous access to Latin text, English translations, commentary from multiple sources along with wood cut illustrations by Virgil Solis.) ** Metamorphoses in Latin edition and English translations (From Perseus with hyperlinked commentary, mythological, and grammatical references) * Latin text ** University of Virginia: Metamorphoses ** The Latin Library: P. OVIDI NASONIS OPERA * English translation ** By A. S. Kline, 2000 *** Poetry in Translation: Ovid: Metamorphoses . (Enhanced viewer with links and notes. Can be downloaded in different formats.) *** Mythology: Metamorphoses ** By Sir Samuel Garth, John Dryden et al., 1717 *** Internet Classics Archive: Ovid's Metamorphoses *** Ovid's Metamorphoses ** By Others: *** Elizabethan Authors: Ovid's Metamorphoses, trans. by Arthur Golding, 1567. *** Ovid's Metamorphoses trans. by George Sandys, 1632. *** Ovid's Metamorphoses trans. by Brooke Moore, 1922. *** TextKit: Ovid's Metamorphoses, Books I–IV , trans. Rev. Dr. Giles, a learning translation/crib in PDF graphic format. * Insight and commentary ** The Ovid Project: Metamorphising the Metamorphoses (Illustrations by Johann Whilhelm Baur (1600–1640) and anonymous illustrations from George Sandys's edition of 1640.) ** A Honeycomb for Aphrodite by A. S. Kline ** Ovid's Metamorphoses, An introduction and commentary by Larry A. Brown. ** An Analytical Onomasticon to the Metamorphoses of Ovid (Concordance and narrative index.) * Audio Readings ** Ovid ~ Metamorphoses ~ 08-2008 Selections from Metamorphoses, read in Latin and English by Rafi Metz. Approximately 4 1/2 hours. Category:Greek mythology Category:Roman mythology Category:1st-century books",
 "title": "Metamorphoses"
}