{
 "id": "16530",
 "text": "Mulan is a 1998 American animated musical adventure movie produced by Walt Disney Feature Animation. It is the 36th movie in the Walt Disney Animated Classics series. It is set in old-time China and based on local legend. The movie stars the voices of Ming-Na Wen and Eddie Murphy. Mulan was a success with its fans because it was different from Disney's other movies in terms of music and artistic design. It features original songs written by Matthew Wilder and David Zippel, and an original musical orchestral score composed and conducted by Jerry Goldsmith, who also wrote the music for another animated movie, 1982's The Secret of NIMH. Christina Aguilera sang Reflections or the movie's soundtrack. A direct-to-video sequel, Mulan II, was released on February 1, 2005. In 2018, Disney announced that they were making a live action remake. It was released on Disney+ in 2020 for a premium fee of $29.99. It got a lot of criticism for not being like the original and its' historical accuracies. == Story == An army of Huns, led by Shan Yu, their leader, arrive and try to invade China. The Chinese army recruits each man from every family for them to start a war. Mulan's father suffers an injury and he cannot fight. Mulan disguises herself as a boy and enters the army. A dragon named Mushu accompanies her. At first, Mulan is not taken seriously by the other soldiers but during training, eventually proves that she is better than what they thought. Mulan secretly falls in love with the commander, Li Shang. The army is attacked by the Huns in the snowy mountains. Mulan uses a cannon to start an avalanche which buries and kills the Huns. Mulan is hurt by a sword, and the doctor who examines her finds that she is not a boy but a girl. Li Shang and the Chinese army leave Mulan alone in the mountains. The Chinese Army arrives at the Emperor's palace in the Imperial City for victory celebrations. Mulan sees that several Huns, including Shan Yu, have survived the avalanche. She goes to Imperial City to tell Li Shang but nobody believes her because they are celebrating the end of the war. Shan Yu and the Huns attack the palace and capture the Emperor. Mulan and her soldier friends dress up as palace women so that they can get inside and rescue the Emperor. Shan Yu is left trapped on the palace roof and dies in a firework display. The Emperor thanks Mulan and she returns home. The Emperor tells Li Shang to follow her if he loves her. Li Shang arrives at Mulan's town and is invited to have dinner with the family. == Cast == * Miguel Ferrer as Shan-Yu * Harvey Fierstein as Yao * Freda Foh Shen as Fa Li * June Foray as Grandmother Fa * James Hong as Chi Fu * Miriam Margolyes as the Matchmaker * Pat Morita as the Emperor * Eddie Murphy as Mushu * Marni Nixon as Grandmother Fa's singing voice * Soon- Tek Oh as Fa Zhou * Donny Osmond as Shang's singing voice * Lea Salonga as Mulan's singing voice * James Shigeta as General Li * George Takei as the First Ancestor * Jerry S. Tondo as Chien-Po * Gedde Watanabe as Ling * Frank Welker as Khan and Cri-Kee * Ming-Na Wen as Mulan * Matthew Wilder as Ling's singing voice * B. D. Wong as Shang * Mary Kay Bergman and Corey Burton as two other Ancestors * Julianne Buescher as the Young Bride's singing voice * Mitch Carter as a Muscular Guard * Robert Clotworthy as Hun * Beth Fowler as Bather * Sandie Hall as Chorus * Richard S. Orvitz as a Chinese Soldier * Patrick Pinney as Fa Deng, the Second Hun Twin and the Parade Leader Additional voices were provided by Tom Amundsen, Arminae Austen, Bob Bergen, Susan Boyd, Steve Bulen, Rodger Bumpass, Cam Clarke, Cooper Cowgill, David Cowgill, Debi Derryberry, Sally Dworsky, Bill Farmer, Don Fullilove, Elisa Gabrielli, Jack Gilpin, John Goodman, Jess Harnell, Linda Kerns, Matthew Labyorteaux, Conan Lee, Dana Lee, Edie Lehmann-Boddicker, Luisa Leschin, Sherry Lynn, Christina Ma, Danny Mann, Susan McBride, Edie McClurg, Mickie McGowan, Sean Cameron Michael, Haunani Minn, Edie Mirman, Mark Moseley, Paul Pape, Phil Proctor, Jan Rabson, Peter Renaday, Maurita Thornburgh-Phillips, John Walcutt, Claudette Wells and Joe Whyte. == References == == Other websites == * Official Site * * * Category:1998 movies Category:1998 animated movies Category:American family movies Category:1990s American musical movies Category:1990s English-language movies Category:Movies set in China Category:Movies set in palaces Category:Movies composed by Jerry Goldsmith Category:Mulan (Disney) Category:Multilingual movies",
 "title": "Mulan (1998 movie)"
}