{
 "id": "165435",
 "text": "Donald Jacob \"Jake\" Hager Jr. (born March 24, 1982) is an American professional wrestler and former mixed martial artist. He most recently wrestled for All Elite Wrestling (AEW). Hager has previously worked for WWE under the ring name Jack Swagger and Lucha Underground as Jake Strong. During his time with WWE, he won the World Heavyweight Championship, the United States Championship and the ECW Championship once each, as well as the Money in the Bank ladder match at WrestleMania XXVI in 2010. He was the last holder of the Lucha Underground Championship and the Lucha Underground Gift of the Gods Championship . == Career == === Early career === Hager was recruited to the University of Oklahoma as a two-sport athlete, playing as a defensive tackle in football and a heavyweight wrestler. During his junior year, he met Jim Ross, who was then World Wrestling Entertainment's Head of Talent Relations, and Ross encouraged Hager to contact him after graduating. In 2006, as an All-American wrestler, he set the single season record for most pins at 30, and graduated from the University of Oklahoma with a Bachelor's Degree in Finance. === World Wrestling Entertainment (2006–2019) === ==== Developmental territories (2006–2008) ==== In 2006, Hager had a WWE tryout in Deep South Wrestling, and in September 2006, Hager made his in-ring debut for Deep South Wrestling defeating Antonio Mestre in a dark match. He competed mainly in dark matches, before being moved to Ohio Valley Wrestling in January 2007. He started for OVW, by defeating Atlas DaBone, and in the following months began a rivalry with K.C. James Hager began teaming with a multitude of opponents to feud with James and his tag team partner Cassidy James. In August 2007, Hager went back to Florida Championship Wrestling, where he began a rivalry with TJ Wilson. On February 15, 2008, Hager defeated Ted DiBiase, Jr. in Tampa, Florida at the Florida State Fair to become the first-ever FCW Florida Heavyweight Champion. Earlier in the night, DiBiase and Hager were the final two men remaining in a 23-man battle royal to determine the two championship contenders. On March 22, 2008, Hager went against the FCW Southern Heavyweight Champion Heath Miller, in New Port Richey, Florida, to determine the true Heavyweight Champion. Both titles were on the line and Hager defeated Miller to become the undisputed heavyweight champion in Florida Championship Wrestling. His first loss came in the form of a Raw dark match, at the TV taping on August 18, 2008 when he lost to William Regal. ==== ECW brand (2008–2009) ==== On September 9, 2008, Hager made his start on the ECW brand under the ring name Jack Swagger, winning a match against a local wrestler. He quickly made himself a villain when he did not let the referee hold up his arm after the win, and later started a rivalry with Tommy Dreamer by attacking him after Dreamer had saved Chase Stevens from Mike Knox. He later defeated Dreamer in a wrestling match and an \"All American Challenge\" competition. After weeks of fighting, the two ended their rivalry in an Extreme Rules match, which Swagger won to extend his undefeated streak. He then set his sights on Matt Hardy's ECW Championship, and was named the number one contender on the December 30, 2008 edition of ECW. On the January 13, 2009 episode of ECW, Swagger defeated Hardy to win the ECW Championship, which is his first title in WWE. His undefeated streak in singles matches ended on the February 3 episode of ECW, when he lost to Finlay. ==== World Heavyweight Championship run and SmackDown (2010) ==== On the March 1 episode of Raw, Swagger beat Santino Marella to wrestle in the Money in the Bank ladder match at WrestleMania XXVI. At WrestleMania, Swagger won the Money in the Bank ladder match, winning a contract for any WWE world championship that he could use at any time over the next year. On the episode of Raw after WrestleMania, Swagger tried to cash in his Money in the Bank contract on John Cena, but changed his mind when he saw that Cena was not hurt enough for Swagger to beat. As the match had never started, Swagger kept the contract for use at a future date. Swagger cashed in his Money in the Bank contract during the SmackDown taping on March 30, 2010, after the World Heavyweight Champion Chris Jericho had been speared by Edge. Swagger went on to defeat Jericho to win the World Heavyweight Championship for the first time. after his championship win, Swagger changed into a more serious Swagger which was different from his last persona, where he was known for doing pushups and beating his chest during his ring entrance. He defended his championship against Edge and Jericho in a triple threat match on the April 16 episode of SmackDown, and against Randy Orton in an Extreme Rules match at the Extreme Rules pay-per-view. At Over the Limit, Swagger kept the title against The Big Show by disqualifying himself. At the Fatal 4-Way pay-per-view on June 20, he lost the championship to Rey Mysterio in a fatal four-way match, which also had CM Punk and The Big Show. == In wrestling == * Finishing and signature moves ** As Jack Swagger *** Falling gutwrench powerbomb *** Red, White and Blue Thunder Bomb (Spin–out powerbomb pin) – 2008 *** Abdominal stretch *** Corner slingshot splash *** Double leg takedown *** Gutwrench roll *** Lariat *** Leg whip takedown *** Multiple suplex variations **** Belly to back suplex **** Gutwrench suplex **** Northern lights suplex **** Side belly to belly suplex *** Running knee lift ** As Jake Hager *** Hager–Meister (Tilt–a–whirl slam – FCW or a swinging cradle suplex – OVW) *** Gutwrench suplex *** Overhead belly to belly suplex *** Running knee lift == Championships and accomplishments == === Amateur wrestling === * National Collegiate Athletic Association ** University of Oklahoma single-season record for most pins in the weight class (30) ** 2006 Collegiate All-American === Professional wrestling === * 5 Star Wrestling ** 5 Star Wrestling Championship (1 time) * All Elite Wrestling ** Dynamite Award (2 times) *** \"Bleacher Report PPV Moment of the Year\" (2021) – Stadium Stampede match (The Elite vs. The Inner Circle) – Double or Nothing (May 23) *** \"Biggest Beatdown\" (2021) – The Inner Circle jumping Orange Cassidy – Dynamite (June 10) * All Star Wrestling ** All Star Wrestling Heavyweight Championship (1 time) * The Baltimore Sun ** Most Improved Wrestler of the Year (2010) * Florida Championship Wrestling ** FCW Florida Heavyweight Championship (1 time) ** FCW Southern Heavyweight Championship (1 time) * Imperial Wrestling Revolution ** IWR Heavyweight Championship (1 time) * Lucha Underground ** Lucha Underground Championship (1 time, last) ** Lucha Underground Gift of the Gods Championship (1 time, last) * Northeast Wrestling ** NEW Heavyweight Championship (1 time) * Pennsylvania Premiere Wrestling ** PPW Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Faction of the Year (2021) – with The Inner Circle ** Ranked No. 18 of the top 500 singles wrestlers in the PWI 500 in 2009 * World Class Revolution ** WCR Heavyweight Championship (1 time) * World Wrestling Entertainment / WWE ** ECW Championship (1 time) ** World Heavyweight Championship (1 time) ** WWE United States Championship (1 time) ** Money in the Bank (2010) ** Bragging Rights Trophy (2010) – with Team SmackDown (Big Show, Rey Mysterio, Kofi Kingston, Alberto Del Rio, Edge and Tyler Reks) == References == == Other websites == * * WWE Universe Profile * Online World of Wrestling Profile * Jake Hager's biography & profile Category:1982 births Category:Living people Category:All Elite Wrestling alumni Category:American mixed martial artists Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Oklahoma",
 "title": "Jake Hager"
}