{
 "id": "165538",
 "text": "Orthodox Judaism is the more traditional form of Judaism in the modern world. ==Overview== Orthodox Judaism holds that both the scripture of the Torah and oral traditions later written down in the Talmud etc., were actually and literally given by God, and that past rabbis handed them over without change and were always faithful in deciding how they applied to reality. Because of this, Orthodox Judaism is very careful in holding to the tradition of past rabbis, and is very conservative on how current rabbis may decide what the law is in new cases. Orthodox Jews consider themselves as the only truly faithful Jews and reject all the new non-Orthodox forms of Jewish thought, religious or secular, that came to be in the last 250 years, since the Jewish community lost its powers to enforce people, and Jews began to be citizens of the modern state. Even so, they are a product of new times just like everyone else: Their community organizations were created so they could separate from other Jews because those stopped being religious. The Orthodox also had to make very new ways of thinking and acting to deal with the big changes. ==Today== As of 2001, Orthodox Jews and Jews affiliated with an Orthodox synagogue, accounted for about 50% of British Jews (150,000), 25% of Israeli Jews (1,500,000) and 13% of American Jews (529,000).American Jewish Religious Denominations , United Jewish Communities Report Series on the National Jewish Population Survey 2001-01, (Table 2, pg. 9) Among those affiliated to a synagogue body, Orthodox Jews represent 70% of British Jewry and 27% of American Jews. Orthodox Jews usually have to follow these rules: * Circumcision for men * Not to commit murder and idolatry * Observe the shabbat and do not work on the day * Not to engage in certain sexual practices banned by the Bible * Eat only certain food. These dietary laws are known as Kashrut * Taharat Hamishpacha, the laws of family purity, restricting sexual relations for a prescribed time around menstruation and after childbirth ==Related pages== * Yiddish * Mizrahi Jews * Haredi Judaism * Sephardic Jews * Ashkenazi Jews * Ladino language * Conservative Judaism ==Other websites== * Your Complete Guide to Brochos * Origins of Orthodox Judaism * The different Orthodox Jewish groups * The State of Orthodox Judaism Today * Orthodox Judaism in Israel * Orthodox Jewish population growth and political changes * Information on Orthodox Jewish culture ==References== Category:Judaism Category:Religion Category:Jewish people Category:Jewish culture Category:Jewish denominations",
 "title": "Orthodox Judaism"
}