{
 "id": "165590",
 "text": "Oleg Aleksandrovich Prudius (; , Oleh Oleksandrovych Prudius; born April 27, 1969) is an Ukrainian-American actor and professional wrestler. He is currently signed to Total Nonstop Action Wrestling (TNA) under his real name. Prudius became famous for his work in World Wrestling Entertainment (WWE) from 2006 to 2011 under his ring name Vladimir Kozlov. He is trained in freestyle wrestling, rugby, American football, sambo, kickboxing, judo, and mixed martial arts. Prudius has also worked as a stage and screen actor, having a small part in Spike Lee's 25th Hour. He also had a role in Grindhouse, appearing in the \"Werewolf Women of the SS\" trailer; he was credited under his real name and his WWE persona for the appearance. He is a former Ohio Valley Wrestling Heavyweight Champion. On December 8, 2009, Prudius became a United States citizen. == Career == === Pre-wrestling === Prudius has won numerous achievements, becoming the 2005 USA Open Heavyweight Sambo Champion and a United States Kick-Boxing Association (USKBA) International Heavyweight Grappling Champion. He has also played American football for the Ukrainian National Team as well as Santa Barbara City College. === Total Nonstop Action Wrestling (2005) === Prudius accompanied Jerry Jarrett to the ring at Slammiversary in 2005. === World Wrestling Entertainment (2006-2011) === On January 17, 2006, World Wrestling Entertainment announced that Prudius had signed a developmental deal and was sent to Deep South Wrestling. On April 7, 2006 he started wrestling under his real name \"Oleg Prudius\" and had his first match in DSW against Tommy Suede. On May 5, 2006, Prudius had his first untelevised WWE match during a house show in San Jose, California, defeating Rob Conway. The next night, at another house show in Sacramento, California, Matt Striker cut a promo on Prudius, calling him a \"filthy immigrant,\" causing Prudius to attack him. Prudius then picked up the microphone and said he that he is \"proud to be in America.\" On the December 18, 2006 episode of Raw, Prudius was introduced in an interview as the newest Russian WWE Superstar named Vladimir Kozlov. For the next several weeks, Kozlov was interviewed on WWE TV, saying he loved \"Double Double E\" (WWE). But he also said he could beat all of the WWE Superstars, becoming a heel. ==== Ohio Valley Wrestling (2007-2008) ==== On July 28, 2007 in Louisville, Kentucky, he won the OVW Heavyweight Championship by defeating Paul Burchill, but gave up the Championship the same night to Michael W. Kruel due to an agreement they made before. ==== Main roster (2008-2011) ==== On the April 4, 2008 episode of SmackDown, Kozlov made his official WWE debut as a heel, with no entrance music and video – his \"entrance\" was completely dark except for a spotlight following him to the ring. He defeated Matt Bentley in his first match, and over the following weeks, Kozlov would win many matches in a row. On the July 11, 2008 episode of SmackDown, Kozlov got an entrance theme and video and defeated Stevie Richards. In the following weeks, as Kozlov continued to easily win matches, he wanted \"better competition\". On the September 12, 2008 edition of SmackDown, he attacked Jeff Hardy. Over the following weeks, Kozlov would continue attacking both Hardy and the WWE Champion Triple H, eventually starting a loose rivalry between the three of them over the WWE title. Kozlov earned a match against Triple H for the WWE Championship at Survivor Series by defeating The Undertaker by disqualification on the November 6 episode of SmackDown. Edge was added to a match right in the middle of it, and pinned Triple H to win the match. This is because Jeff Hardy was originally supposed to compete, but was found unconscious in a Boston stairwell. At Armageddon, Kozlov gained his first pay-per-view win by defeating then-ECW Champion Matt Hardy in a non-title match. Kozlov competed in the 2009 Royal Rumble match, entering at number 6, but was eliminated by Triple Hafter eliminating three other superstars including The Great Khali, MVP, and Carlito. His first singles loss on SmackDown came against The Undertaker on March 13. On April 13, 2009, Kozlov was drafted to the ECW brand as part of the 2009 WWE draft. After the ECW brand ended in 2010, Kozlov made his debut for the Raw brand on March 8, in a handicap gauntlet match with John Cena competing against Kozlov, Mr. McMahon, Batista, Mark Henry, Drew McIntyre and Jack Swagger. That year, Kozlov formed a tag team with Santino Marella. On the December 6 episode of Raw, Kozlov and Marella won the WWE Tag Team Championship by defeating the defending champions Heath Slater and Justin Gabriel, Mark Henry and Yoshi Tatsu, and The Usos in a four-way elimination tag team match. They lost the tag team titles back to Slater and Gabriel at Elimination Chamber 2011. On March 8, Kozlov became the pro of Conor O'Brian on NXT Redemption. Kozlov's last WWE match was on the August 5 episode of SmackDown, where he lost to Mark Henry. After the match, Henry (kayfabe) broke Kozlov's left leg before Sheamus came down to the ring and saved him from Henry. On the same day, WWE announced that Kozlov was released from his WWE contract. === Return to Impact/Total Nonstop Action Wrestling === On October 12, 2023, Prudius returned to Impact Wrestling. He would attack Champagne Singh, Eric Young, and Jake Something to help Dirty Dango win. == Other media == Prudius has made many television appearances. He appeared in the second season of the HBO drama series The Wire, as well as Roksalana and It's Not To Easy on Ukrainian TV. In 2002, he appeared in Spike Lee's film 25th Hour, playing a Russian mafia enforcer. He appeared in the Russian military theatre play Victory Day and a Ukraine University play Three Musketeers. == In wrestling == * Finishing and signature moves ** Backbreaker rack drop – OVW / WWE; 2007–Early 2008 ** Battering ram to a charging or diving opponent – WWE ** One–handed chokelift dropped into a kneeling spinebuster – WWE ** Scoop lift dropped into an inverted DDT – WWE ** Fallaway slam ** Fireman's carry takeover ** Kick to the chest of an opponent draped horizontally over the top turnbuckle ** Overhead / Side belly to belly suplex ** Over the shoulder arm drag ** Pushing big boot to the chest of an opponent ** Scoop powerslam ** Single leg Boston crab ** Spinebuster * Nicknames ** \"The Moscow Mauler\" ** \"The Ruthless Russian\" ** \"The Russian Wrangler\" ==Championships and accomplishments== === Martial arts === * Sambo ** USA Open Heavyweight Sambo Champion (2005) * Kickboxing ** United States Kick-Boxing Association International Heavyweight Grappling Champion === Professional wrestling === * Ohio Valley Wrestling ** OVW Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 53 of the top 500 singles wrestlers in the PWI 500 in 2009 * World Wrestling Entertainment/WWE ** WWE Tag Team Championship (1 time) – with Santino Marella ** Slammy Award (1 time) *** Breakout Star of the Year (2008) * Wrestling Observer Newsletter ** Most Overrated (2008) ** Worst Worked Match of the Year (2008) == References == == Other websites == * * Gerweck.net Profile * onlineworldofwrestling.com Profile * Category:1969 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sambo practitioners Category:Total Nonstop Action Wrestling people Category:Ukrainian actors",
 "title": "Vladimir Kozlov"
}