{
 "id": "165693",
 "text": "Total Drama Island is a Canadian animated television show created by Jennifer Pertsch and Tom McGillis, produced by FreshTV and Cartoon Network Studios and first shown on June 7, 2008 on Cartoon Network. It is shown in Canada on Teletoon. It is the first season of the Total Drama series, followed by Total Drama Action, and Total Drama World Tour. == About the Show == The game is an animated reality show where twenty-two 16-year-olds are divided into two groups of eleven each (the \"Killer Bass\" and the \"Screaming Gophers\") set in the summer camp \"Wakanakwa\" which is on an island in an unspecified zone in Muskoka, Ontario. The show spoofs many other reality shows, taking on elements of Survivor, Fear Factor and Iron Chef. Every week, both teams compete in a challenge. The winning team becomes immune to getting kicked off the show (called \"invincibility\"), while the losing team has to do an internal vote to select who is eliminated. That night, the losing team meets around a campfire, where Chris Mclean, the show's producer, gives each camper a marshmallow. The camper with the least votes for leaving gets the first marshmallow, the camper with the second least votes gets the second marshmallow, and so on, until the camper with the most votes for elimination is left. The camper that got the most votes is eliminated then, and must walk down the \"Dock of Shame\" to the \"Boat of The Losers\". == Characters == There are the twenty two participants who get selected for the reality show Total Drama Island: Position Camper's Name Team Status Usual Outfit Moment 22 Ezekiel The Killer Bass 1ºst Eliminated in \"Not So Happy Campers\" Part 2 Green/beige/gray hoodie, white t-shirt, turquoise-blue jeans, white socks, green/beige/gray winter boots, turquoise and blue woolen hat He's been home-schooled his whole life and raised by freaky prairie people 21 Noah The Screaming Gophers 2ºnd Eliminated in \"Dodgebrawl\" White cotton sweatshirt, dark blue denim t-shirt, red woolen vest, medium length green and beige corduroy pants, white socks, white-brown- beige-green-orange sneakers 20 Justin The Screaming Gophers 3ºrd Eliminated in \"Not Quite Famous\" Dark green t-shirt, long turquoise jeans, brown and beige sandals, necklace 19 Katie The Killer Bass 4ºth Eliminated in \"The Sucky Outdoors\" Black top blouse with white thin horizontal stripes, pink corduroy pants, pink wedge shoes, small black earrings 18 Tyler The Killer Bass 5ºth Eliminated in \"Phobia Factor\" Red sports tracksuit, white socks, white sneakers, white and red headband 17 Cody The Screaming Gophers 6ºth Eliminated in \"Paintball Deer Hunter\" Gray and beige sweatshirt, light yellow t-shirt, turquoise corduroy pants, white socks, beige-brown-green-yellow sneakers 16 Beth The Screaming Gophers 7ºth Eliminated in \"If You Can't Take The Heat\" Green t-shirt, light green vest, pink corduroy pants, white sneakers, thick glasses, colorful buttons, orthodontic applience 15 Sadie The Killer Bass 8ºth Eliminated in \"Who Can You Trust?\" Black top blouse with white thin horizontal stripes, pink corduroy pants, pink wedge shoes, small black earrings 14 Courtney The Killer Bass 9ºth Eliminated in \"Basic Straining\" White shirt, gray blouse, green medium length pants, dark green wedge shoes 13 Harold The Killer Bass 10ºth Eliminated in \"X-treme Torture\" Pink sweatshirt, blue t-shirt, green corduroy pants, white knee-highs, white yellow blue and green sneakers, glasses 12 Eva The Killer Bass 11ºth Eliminated in \"No Pain, No Game\" Dark blue cotton tank top, dark blue cotton shorts, white cotton knee socks, black and white sneakers 11 Trent The Screaming Gophers 12ºth Eliminated in \"Seek and Do Not Destroy\" Elbow-length camo sweatshirt, meringue green t-shirt, dark gray denim pants, leather belt, white socks, meringue green sneakers 10 Bridgette The Killer Bass 13ºth Eliminated in \"Hide and be Sneaky\" Blue sweatshirt, short two-tone gray shorts, brown leather sandals 9 Lindsay The Screaming Gophers 14ºth Eliminated in \"That's Off the Chain\" Blue headscarf, red and brown top, orange miniskirt, brown cowboy boots 8 DJ The Killer Bass 15ºth Eliminated in \"Hook, Line, and Screamer\" Dark green t-shirt, gray corduroy shorts, dark brown leather sandals, white cap 7 Izzy The Screaming Gophers 16ºth Eliminated in \"Wakanakwa Gone Wild\" Green top, green skirt-pants, green shoes, plastic bracelet 6 Geoff The Killer Bass 18ºth Eliminated in \"Trial by Tri-Armed Triathlon\" Pink cotton shirt, medium blue corduroy shorts, medium blue sandals, green and beige hat, gold metal necklace, gray bracelet 5 LeShawna The Screaming Gophers 18ºth Eliminated in \"After the Dock of Shame\" Beige blouse, gray and blue shorts, brown leather sandals, large beige and round earrings 4 Duncan The Killer Bass 19ºth Eliminated in \"Are We There YET,Yeti?\" Beige and yellow sweatshirt, black t-shirt, turquoise ankle-length pants, yellow socks, red and yellow sneakers, piercing earrings, spiked necklace, black bracelet 3 Heather The Screaming Gophers 20ºst Eliminated in \"I Triple Dog Dare You!\" Dark pink top, gray and beige corduroy shorts, black leather belt, red and black platform shoes 2 Gwen The Screaming Gophers Runner Up in \"The Very Last Episode, Really!\" Dark green blue and medium green blouse, black and turquoise skirt, dark green tights, knee-high black leather military boots, small black necklace 1 Owen The Screaming Gophers Winner in \"The Very Last Episode, Really!\" White t-shirt, medium green shorts, white socks, white aquamarine sneakers. === Elimination Reason === *Ezekiel: because of his sexist comments, all of the girls on his team vote against him. *Eva (First): because of the disaster when Heather stole her MP3 player. *Noah: because he didn't work in the dodgeball challenge. *Justin: because Heather convinced Owen, Lindsay, Beth and Izzy to vote against him. *Katie: because she got lost in the forest eating berries. *Tyler: because he could not overcome his fear in Phobia Factor. *Izzy (First): she left the encampment after the Royal Canadian Mounted Police appeared, finding her. *Cody: because a bear attacked him and he was considered useless for another challenge. *Beth: after everyone discovers that she cursed her team with a voodoo-like statue from the \"Bone Island\". *Sadie: because she threw too many apples to Courtney so Courtney convinced everyone to vote against her. *Courtney: because Harold changed the votes for revenge against Duncan. *Harold: he was near the win when Heather's skirt broke, and he was distracted by this; this happened in the last challenge and his distraction cost his team the victory. *Eva (Second): for the same reason as before and because her presence intimidates the other campers. *Trent: because when Heather kissed him, Gwen told LeShawna. Then LeShawna told the others to vote for either Trent or Heather. After that, Heather won invincibility, so it was good-bye for Trent. *Bridgette: because the boy's alliance considered her to be a threat, and every one of them voted against her (except Geoff). *Lindsay: because she was the last camper to cross the finish line in a challenge, but only because the other campers (except Heather who placed first) were disqualified from the race in the first place. *DJ: because he was the camper that got scared most in a challenge. *Izzy (second): because she could not shoot at animals for a challenge. *Geoff: because Duncan's vote resulted in him being eliminated from the challenge. *LeShawna: because the eliminated campers accidentally said her name once which can be considered a vote and then she was eliminated. *Duncan: his aggressive personality made Chef Hatchet angry. *Heather: she refused to cut her hair in the week's challenge. *Gwen: because she lost a race against Owen. == Episodes == == Voices == Character English Voice Actor Spanish Voice Actor Chris McLean Christian Potenza Johnny Torres Chef Hatchet Clé Bennett Carlos Vitale Beth Sarah Gadon Mariana Gamboa Bridgette Kristin Fairlie Lidya Abboud Cody Peter Oldring Paolo Campos Courtney Emilie-Claire Barlow Yasmil López DJ Clé Bennett Jesús Núñez Duncan Drew Nelson Joel Gonzales Eva Julia Chantrey Elena Díaz Toledo Ezekiel Peter Oldring Jorge Marín Geoff Dan Petronijevic Juan Guzmán Gwen Megan Fahlenbock María José Estévez Harold Brian Froud Rolman Bastidas Heather Rachel Wilson Melanie Henriquez Izzy Katie Crown Yensi Rivero Justin Adam Reid José Granadillo Katie Stephanie Anne Mills Rebeca Aponte Leshawna Novie Edwards Liliana Chacón Lindsay Stephanie Anne Mills Karina Parra Noah Carter Hayden Eder La Barrera Owen Scott McCord Gonzalo Fumero Trent Scott McCord Hector Indriago Tyler Peter Oldring Víctor Díaz Sadie Lauren Lipson Anabell Peña == Elimination Table == Place Name Teams 1* 2 3 4 5 6 7 8 9 10 11 12 13 14^ 15M 16 17 18 19 20 21+ 22+ 23* 24 25 26 1 Owen Gophers IN WIN WIN IN IN WIN WIN IN IN IN WIN WIN WIN WIN IN LOW IN IN IN IN IN IN LOW LOW WIN 1st 2 Gwen Gophers IN WIN WIN IN IN WIN WIN IN IN IN WIN WIN WIN IN IN IN IN IN WIN WIN4 LOW IN IN WIN WIN 2nd 3 Heather Gophers IN WIN WIN IN LOW WIN WIN IN LOW LOW WIN WIN WIN IN LOW WIN IN WIN IN IN IN IN IN WIN OUT 4 Duncan Bass IN IN IN WIN WIN IN IN WIN WIN WIN IN IN LOW WIN IN IN LOW IN IN IN IN IN IN OUT 5 LeShawna Gophers IN WIN WIN IN IN WIN WIN IN IN IN WIN WIN WIN IN WIN IN WIN IN IN IN IN OUT 6 Geoff Bass IN IN IN WIN WIN IN IN WIN WIN WIN IN IN IN WIN IN IN IN IN IN IN OUT 7 Izzy Gophers IN WIN WIN IN IN WIN WIN LEFT2 Returns in episode 153 IN IN IN IN IN OUT 8 DJ Bass IN IN IN WIN WIN IN IN WIN WIN WIN IN IN IN WIN IN IN IN IN OUT 9 Lindsay Gophers IN WIN WIN LOW IN WIN WIN LOW IN IN WIN WIN WIN IN IN IN IN OUT 10 Bridgette Bass IN IN IN WIN WIN IN IN WIN WIN WIN IN IN IN IN IN IN OUT 11 Trent Gophers IN WIN WIN IN IN WIN WIN IN IN IN WIN WIN WIN WIN IN1 OUT 12 Eva Bass IN IN1 OUT Returns in episode 153 OUT 13 Harold Bass IN IN LOW WIN WIN IN IN1 WIN WIN WIN LOW LOW6 OUT 14 Courtney Bass IN LOW IN WIN WIN IN LOW WIN WIN WIN IN OUT 15 Sadie Bass IN IN IN WIN WIN LOW IN WIN WIN WIN OUT 16 Beth Gophers IN WIN WIN IN IN WIN WIN IN IN OUT 17 Cody Gophers IN WIN WIN IN IN WIN WIN IN OUT 18 Tyler Bass IN IN IN WIN WIN IN OUT 19 Katie Bass IN IN IN WIN WIN OUT 20 Justin Gophers IN WIN WIN IN OUT 21 Noah Gophers IN WIN WIN OUT 22 Ezekiel Bass IN OUT ===Table Key=== Section Box Description Winners 1st This camper won first place and $100,000. 2nd This camper was the runner-up. Genders Name This camper's gender is male. Name This camper's gender is female. Teams Gophers This camper was pre-decided to be on the team of The Screaming Gophers. Bass This camper was pre-decided to be on the team of The Killer Bass. Challenges WIN This camper won the challenge for their team. WIN This camper won the episode's challenge for themselves only. WIN This camper was on the winning team. Campfire Ceremony IN This camper is still competing as of that episode, and had their name called at the campfire ceremony. LOW This camper is still competing as of that episode, but had their name called last at the campfire ceremony. Eliminations OUT This camper was voted off. OUT This camper was eliminated. OUT This camper was not voted off, but was eliminated from the show via the challenge. OUT This camper was unintentionally voted off by unwarranted circumstances. LEFT This camper was not voted off, but left the show. TDA Qualifiers PASS This camper met the qualifications in Total Drama Island to advance to the next season and become a cast-mate of Total Drama Action. FAIL This camper did not meet the qualifications in Total Drama Island to advance to the next season. Other N/A This camper was inactive during the episode. ===Notes=== Section Tag Description Episodes * This episode had no winners or eliminations. ^ This episode had no eliminations. + This episode had no winners. Campers 1 This camper was not shown at the campfire ceremony, despite losing the challenge (a goof in the episode). 2 Izzy left the game before the final marshmallow in this episode was supposed to be given (either to Izzy or Lindsay) after she was hunted down by the Royal Canadian Mounted Police. 3 Eva and Izzy returned in Episode 15 to compete again after being out of the game, but neither of them had automatic invincibility. 4 Although Gwen won invincibility, her name was called last at the campfire ceremony. 5 Courtney did not originally make the qualifiers of Total Drama Action, but she was able to advance to the next season and become a cast-mate of Total Drama Action after she won a lawsuit against the producers. 6 Harold would have been voted off, but he tampered with the votes, eliminating Courtney instead. Campers M This Episode is the merge (Every camper for him/herself) == Transmission == ===International broadcast=== Country Channel Canada Teletoon United States Cartoon Network France Télétoon Brazil Cartoon Network (Brazil) México Cartoon Network (Latin America) Venezuela Ecuador Colombia Costa Rica Poland Cartoon Network (Europe) Hungary Romania Russia Norway Cartoon Network (Nordic) Sweden Denmark UK Jetix (UK & Ireland) Netherlands Jetix (Netherlands) Japan Jetix (Japan) Australia ABC1 Israel Children's Channel Italy K-2 Cartoon Network has broadcast the show in many parts of Europe due to the Pan-European feed. Jetix has been broadcasting the show in The Netherlands, and the UK. ==Related pages== *Reality show ==Other websites== *Official Page *Total Drama Wiki Category:American animated television series Category:Canadian animated television series",
 "title": "Total Drama Island"
}