{
 "id": "165759",
 "text": "Gary Leonard Oldman (born 21 March 1958) is a British actor and filmmaker. He is known for his starring role in the 1992 movie Dracula and as Prime Minister Winston Churchill in the 2017 movie Darkest Hour. His other roles include Sid Vicious in \"Sid and Nancy\", Sirius Black in the Harry Potter movies, George Smiley in Tinker Tailor Soldier Spy, Jean-Baptiste Emmanuel Zorg in The Fifth Element, Egor Korshunov in Air Force One, Norman Stansfield in Léon: The Professional, and as James Gordon in The Dark Knight Trilogy. In 2018, for his role as Churchill, Oldman was awarded a Golden Globe Award, a BAFTA Award, a Satellite Award, a Screen Actors Guild Award and an Academy Award. ==Early life== Oldman was born in New Cross, London on 21 March 1958. He is the son of housewife Kathleen (née Cheriton; born 28 November 1919), and Leonard Bertram Oldman (21 May 1921 – October 1985), a former sailor who also worked as a welder. Oldman has stated that his father was an alcoholic who left the family when Oldman was 7 years old. Oldman attended West Greenwich School in Deptford, leaving school at the age of 16 to work in a sports shop. ==Career== Oldman has earned renown for his classical acting style and diversity, being hailed by famous movie critics such as Roger Ebert and Peter Travers as one of cinema's great actors. Peer Colin Firth described him as \"a very strong candidate for the world’s best living actor\". An Academy Award nominee, Oldman has won two BAFTA Awards and a Saturn Award, as well as Emmy Award, Screen Actors Guild Award, and Palme d'Or nominations. ===Influence=== Oldman's performances during his career have provided inspiration for younger actors who would go on to enjoy successful Hollywood careers: Tom Hardy has described Oldman as his \"absolute complete and utter hero\", and \"hands down, the greatest actor that's ever lived\"; Brad Pitt, Daniel Radcliffe, Benedict Cumberbatch and Ryan Gosling have also cited Oldman as their favourite actor. Other actors such as Christian Bale,Acceptance speech for Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role. 17th Screen Actors Guild Awards. 30 January 2011. \"There's so many different performances that inspire me, from different people...Gary Oldman, a friend of mine, who I think is one of the finest.\" Shia LaBeouf, Joseph Gordon-Levitt, Johnny Depp, Chris Pine, Jason IsaacsIGN Interview: Jason Isaacs. \"The Harry Potter villain on his new miniseries, The State Within\". By Eric Goldman. 15 February 2007. \"Gary Oldman is a total hero of mine. I've always thought he was one of the best screen actors I've ever seen.\" and Michael Fassbender have praised Oldman as well. ==Personal life== Oldman married his first wife, Lesley Manville, in 1987 but left her in 1989 three months after their son, Alfie, was born. He met American actress Uma Thurman on the set of State of Grace, and they were married in 1990, but the marriage ended two years later.\"Uma Thurman to wed again\", The Seattle Times, 28 June 2008. Oldman then settled into a relationship with actress and model Isabella Rossellini. The couple were rumoured to be engaged in July 1994 but separated two years later. Oldman was married to Donya Fiorentino from 1997 to 2001 and they have two sons, Gulliver Flynn (b. 20 August 1997) and Charlie John (b. 11 February 1999). On 31 December 2008, Oldman married English jazz singer Alexandra Edenborough in Santa Barbara, California in a private, formal ceremony. Oldman currently lives in Los Angeles with his family.Gary Oldman Relates to Jim Gordon @ JustPressPlay == References == == Other websites == * * * Interview with Gary Oldman on his directorial debut – Nil by Mouth * Wolf in Sheep’s Clothing: The Strange Career of Gary Oldman Category:1958 births Category:Living people Category:British Academy Award winning actors Category:Actors from London Category:BAFTA Award winning actors Category:English movie actors Category:English movie directors Category:English movie producers Category:English screenwriters Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Satellite Award winners Category:Saturn Award winners Category:Writers from London",
 "title": "Gary Oldman"
}