{
 "id": "165788",
 "text": "is a Japanese former professional footballer. He played for the Japan national team, for which he served as captain. ==Biography== Hasebe was born in Fujieda on January 18, 1984. After graduating from Fujieda Higashi High School, he joined J1 League club Urawa Reds in 2002. He became a regular palyer in the 2003 season. He played mainly as a defensive midfielder with Keita Suzuki. Urawa won the J1 League for the first time in 2006, the first time the team won the title. He won the first Asian title of the 2007 AFC Champions League. In January 2008, he moved to German Bundesliga club Wolfsburg. The club were the champions in the 2008–09 season. He played 135 matches for the club. In the summer of 2013, he moved to Nürnberg. However the club was relegated to 2. Bundesliga at the end of the 2013–14 season. In summer 2014, he moved to Eintracht Frankfurt. On February 10, 2006, he debuted for the Japan national team against United States. Although he could not play at all in 2007, he played again in May 2008 after Takeshi Okada became the new manager. After that, he became a regular player as a defensive midfielder with Yasuhito Endo. Hasebe was selected for Japan for the 2010 World Cup. He played all four matches as the team's captain. Japan qualified for the knockout stage. In 2011, he participated in the 2011 Asian Cup. He played all six matches and Japan were the champions. From late 2013, Hasebe played as a defensive midfielder with Hotaru Yamaguchi instead of Endo. He also played at the 2014 World Cup and 2015 Asian Cup. In 2018, he was selected for the Japan for the 2018 World Cup. He played all four matches as a defensive midfielder with Gaku Shibasaki and Japan qualified to the knockout stage. After the 2018 World Cup, he retired from the national team. He played 114 games and scored two goals for Japan from 2006 to 2018. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Urawa Red Diamonds 2002 J1 League 0 0 0 0 1 0 – – 1 0 2003 28 2 1 1 9 1 – – 38 4 2004 27 5 4 2 8 2 – 2 0 41 9 2005 31 2 5 2 9 2 – – 45 6 2006 32 2 4 1 6 0 – 1 0 43 3 2007 31 1 1 0 2 0 17 3 – 51 4 Total 149 12 15 6 35 5 17 3 3 0 219 26 VfL Wolfsburg 2007–08 Bundesliga 16 1 1 0 – – – 17 1 2008–09 25 0 2 0 – 6 1 – 33 1 2009–10 24 1 1 0 – 8 0 – 33 1 2010–11 23 0 1 0 – – – 24 0 2011–12 23 1 1 0 – – – 24 1 2012–13 23 2 4 0 – – – 27 2 2013–14 1 0 – – – – 1 0 Total 135 5 10 0 – 14 1 – 159 6 1\\. FC Nürnberg 2013–14 Bundesliga 14 0 – – – – 14 0 Eintracht Frankfurt 2014–15 Bundesliga 33 0 2 0 – – – 35 0 2015–16 32 1 4 0 – – – 36 1 2016–17 22 1 3 0 – – – 25 1 2017–18 24 0 5 0 – – – 29 0 2018–19 28 0 1 0 – 14 0 1 0 44 0 2019–20 23 0 3 0 – 13 0 – 39 0 2020–21 29 0 0 0 – – – 29 0 2021–22 18 0 1 0 – 6 0 – 25 0 2022–23 18 0 5 0 – 4 0 0 0 27 0 2023–24 2 0 1 0 – 1 0 – 4 0 Total 229 2 25 0 – 38 0 1 0 293 2 Career total 527 19 50 6 35 5 69 4 4 0 685 34 ===International=== Appearances and goals by national team and year National team Year Apps Goals Japan 2006 6 0 2007 0 0 2008 10 0 2009 11 1 2010 10 0 2011 15 1 2012 11 0 2013 14 0 2014 6 0 2015 12 0 2016 9 0 2017 2 0 2018 8 0 Total 114 2 :Scores and results list Japan's goal tally first, score column indicates score after each Hasebe goal. List of international goals scored by Makoto Hasebe No. Date Venue Opponent Score Result Competition 1 18 November 2009 Hong Kong Stadium, Hong Kong 1–0 4–0 2011 AFC Asian Cup qualification 2 13 January 2011 Qatar SC Stadium, Doha, Qatar 1–0 2–1 2011 AFC Asian Cup ==Honours== Urawa Red Diamonds * AFC Champions League: 2007 * J1 League: 2006 * J1 League 2nd Stage: 2004 * Emperor's Cup: 2005, 2006 * J.League Cup: 2003 * Japanese Super Cup: 2006 VfL Wolfsburg * Bundesliga: 2008–09 Eintracht Frankfurt * DFB-Pokal: 2017–18 * UEFA Europa League: 2021–22 Japan * AFC Asian Cup: 2011 * Kirin Cup: 2008, 2009, 2011 Individual * J.League Best XI: 2004 * J.League Cup New Hero Award: 2004 * AFC Asian International Player of the Year: 2018 * UEFA Europa League Squad of the Season: 2018–19 * VDV Team of the Season: 2018–19 * kicker Bundesliga Team of the Season: 2018–19 ==References== Category:1984 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:J1 League players Category:Urawa Red Diamonds players Category:2010 FIFA World Cup players Category:2014 FIFA World Cup players Category:2018 FIFA World Cup players Category:2013 FIFA Confederations Cup players",
 "title": "Makoto Hasebe"
}