{
 "id": "165770",
 "text": "Leathermouth (also spelled as LeATHERMØUTH) is an American hardcore punk band. The band was started in 2007 by My Chemical Romance's guitarist Frank Iero. On January 2009, the band released their first album, XO.Shultz, Brian. \"Epitaph Details Leathermouth (My Chemical Romance) Debut\" Alternative Press. Retrieved on February 8, 2009. ==History== Leathermouth started in 2007 by some friends of My Chemical Romance's rhythm guitarist Frank Iero. Iero heard a few demo songs from the band, and wanted to sign the band to his own independent label. He later joined the band after the first lead singer did not write any lyrics to the songs. As a member of Leathermouth, this is the first band where he writes the lyrics and does lead vocals.Harris, Chris. \"Frank Iero Says My Chemical Romance Fans Will Be 'Bummed Out' By Leathermouth\" MTV.com. Retrieved on February 8, 2009. Iero uses the band as a way to express about the way he sees the worldArtist Info - LeATHERMOUTH Epitaph.com. Retrieved on February 8, 2009. and also to let out his personal problems with depression and anxiety.Manley, Brandan (2009). \"In-Store Session with Vocalist Frank Iero\". Alternative Press. 247, 104. Leathermouth played their first shows in the summer of 2008 alongside Warship for the Fall 2008 Reggie and the Full Effect \"Farewell Tour\".Shultz, Brian. \"Reggie and the Full Effect Announce Final Tour; Leathermouth (My Chemical Romance) and Warship (ex-From Autumn to Ashes) Supporting\" Alternative Press. Retrieved on February 8, 2009. Iero hopes to tour with Leathermouth when he is not working with My Chemical Romance.\"Leathermouth Debut XO in January\" Epitaph.com. Retrieved on February 8, 2009. In October 2008, Leathermouth signed to Epitaph Records,Karan, Tim. \"Leathermouth Sign to Epitaph\" Alternative Press. Retrieved on February 8, 2009. rather than to Frank Iero's label as originally planned. Iero thought that it would be hard to advertise the album himself if it was released through his own label, with his current responsibilities to My Chemical Romance and the other bands signed to his label. Epitaph Records president, Brett Gurewitz, was impressed with the band's \"intensity and songwriting of the music.\"\"Epitaph to Release Leathermouth Debut Album 26th January 2009\" Altsounds. Retrieved on February 8, 2009. Leathermouth released their first studio album, XO on January 27, 2009 through Epitaph. Even though the album did not become listed on the Billboard 200, it did reach #21 on the Top Heatseekers chart.\"Artist Chart History - Leathermouth - Albums\" Billboard.com. Retrieved on February 8, 2009. ==Members== * Frank Iero – Vocals * Rob Hughes – Guitar * Ed Auletta - Guitar * John McGuire - Bass * James Dewees - Drums ==Discography== * 2009: XO ==References== ==Other websites== * Leathermouth Official Website * Leathermouth Official MySpace Page * FaNATICMOUTH, a LeATHERMOUTH fanpage Category:Post-hardcore bands Category:Musical groups from New Jersey Category:Musical groups established in 2007 Category:2000s establishments in New Jersey Category:2007 establishments in the United States",
 "title": "Leathermouth"
}