{
 "id": "166086",
 "text": "is a prefecture in the Kantō region of Japan on the island of Honshu.Nussbaum, Louis-Frédéric. (2005). \"Kanagawa\" in Japan Encyclopedia, p. 466; \"Kantō\" at p. 479. The capital city is Yokohama.Nussbaum, \"Yokohama\" at pp. 1054-1055. ==History== Kanagawa was created from the lands of Sagami Province and Musashi Province.Nussbaum, \"Provinces and prefectures\" at p. 780. In 1853, Commodore Matthew Perry landed at Kanagawa. In 1854, the Japanese-American Convention of Kanagawa opened Japanese ports to the United States. In 1923, the center of the Great Kantō earthquake was deep beneath Izu Ōshima Island in Sagami Bay.Hammer, Joshua. (2006). Yokohama Burning: the Deadly 1923 Earthquake and Fire that Helped Forge the Path to World War II, p. 278. ==Geography== Kanagawa is in the southeastern corner of the Kantō Plain. The prefecture is between Tokyo on the north, the foothills of Mount Fuji on the northwest, and the Sagami Bay and Tokyo Bay on the south and east. The western border is shared with Yamanashi Prefecture and Shizuoka Prefecture. ===Cities=== There are nineteen cities in Kanagawa Prefecture: *Atsugi *Ayase *Chigasaki *Ebina *Fujisawa *Hadano *Hiratsuka *Isehara *Kamakura *Kawasaki *Minamiashigara *Miura *Odawara *Sagamihara *Yamato *Yokohama (capital) *Yokosuka *Zama *Zushi ===Towns and villages=== *Aikō District **Aikawa **Kiyokawa *Ashigarakami District **Kaisei **Matsuda **Nakai **Ōi **Yamakita *Ashigarashimo District **Hakone **Manazuru **Yugawara *Kōza District **Samukawa *Miura District **Hayama *Naka District **Ninomiya **Ōiso ===National Parks=== National Parks are established in about 23% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\". Retrieved 2012-3-13. ==Shrines and Temples== Samukawa jinja and Hikawa jinja are the chief Shinto shrines (ichinomiya) in the prefecture.\"Nationwide List of Ichinomiya,\" p. 2 . Retrieved 2012-3-14. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Kawasaki Frontale * Shonan Bellmare * Yokohama F.C. ==References== ==Other websites==",
 "title": "Kanagawa Prefecture"
}