{
 "id": "166189",
 "text": "In World War II, the Battle of France, also called the Fall of France, was the German invasion of France and the Low Countries from 10 May 1940 that ended the Phoney War. The battle was made up of two parts. In the first part, called Fall Gelb in German (\"Case Yellow\" in English), German tank units pushed through the Ardennes to circle the Allied units that moved into Belgium. Most of the British Expeditionary Force and many French soldiers escaped to England from Dunkirk during Operation Dynamo. The second part of the battle, called Fall Rot in German (\"Case Red\" in English), started on 5 June, when German armed forces circled the Maginot Line to attack the rest of France. Italy got into the war and started its own invasion of France, in the southeast of the country, on 10 June. The French government left Paris for Bordeaux, and the Germans took Paris on 14 June. After the French Second Army Group's surrender on 22 June, Philippe Pétain signed an armistice on 25 June. The campaign was a major victory for the Axis Powers.. The French Third Republic ended. France was split into a German-occupied part in the north and west, a small Italian- occupied part in the southeast, and a satellite state part in the south that was called Vichy France. Southern France was invaded by Germany on 10 November 1942. France began to be freed by the Allies at the Battle of Normandy in 1944. The Low Countries were freed later in 1944 and in 1945. ==Related pages== *Blitzkrieg *Battle for Holland *Vichy France *Western Front ==Notes== ==References== *Churchill, Winston S. The Second World War: Their Finest Hour (Volume 2). Houghton Mifflin Company, Cambridge, 1949 *Durand, Yves. La Captivite, Histoire des prisonniers de guerre francais 1939 - 1945, Paris, 1981. Best available study of the French prisoners of war in German captivity. *Frieser, Karl-Heinz Blitzkrieg-Legende—Der Westfeldzug 1940. Oldenbourg, 2005. *Gunsburg, Jeffrey A., 'The Battle of the Belgian Plain, 12-14 May 1940: The First Great Tank Battle', The Journal of Military History, Vol. 56, No. 2. (Apr., 1992), pp. 207–244. *Harman, Nicholas. (1980) Dunkirk; the necessary myth. London: Hodder and Stoughton. *Hooton, E.R. (2007). Luftwaffe at War; Blitzkrieg in the West. London: Chervron/Ian Allen. . *Jackson, Julian T.. The Fall of France: The Nazi Invasion of 1940. Oxford UP, 2003. * Krause, M. and Cody, P. (2006) Historical Perspectives of the Operational Art. Center of Military History Publication. *Taylor, A.J.P. and Mayer, S.L., eds. A History Of World War Two. London: Octopus Books, 1974. . *Weal, John (1997). Junkers Ju 87 Stukageschwader 1937-41. Oxford: Osprey. *Weinberg, Gerhard L. A World at Arms: A Global History of World War II. Cambridge UP, 1995. *Martin, J. and Martin, P. Ils étaient là: l’armée de l’Air septembre 39 - juin 40. Aero-Editions, 2001. ==More reading== * Alexander, Martin. Republic in Danger, General Maurice Gamelin and the Politics of French Defence, 1933-1940, Cambridge: Cambridge University Press, 1992. An examination of Gamelin’s career and French military preparations during the 1930s. Highly complimentary work stressing French rational preparations for the war. * This was the first detailed account of the B.E.F. in France. The fight for survival finished with the return from France in the little ships * Bloch, Marc. Strange Defeat, A Statement of Evidence Written in 1940, Hopkins, New York: W.W. Norton & Co., 1968. Written in 1940 by a veteran of the campaign. Considered one of the early key works on understanding how the French saw this defeat. Writer killed in 1943 by Gestapo due to resistance work. * Six nations locked in aerial combat - September 1939 to June 1940. *Doughty, Robert Allan. The Seeds of Disaster: The Development of French Army Doctrine, 1919-1939, Archon, 1986. Examination of errors the French made in military doctrine during the inter-war years and how this, not defeatism or lack of quality equipment, led to the defeat of 1940. *Doughty, Robert Allan. The Breaking Point: Sedan and the Fall of France, 1940. Archon, 1990. Classic study on the events of 13 and 14 May. * Gerard, Lt. Robert M. Tank-Fighter Team, 1943 *Horne, Alistair. To Lose a Battle, 1940, Boston: Little Brown and Co., 1969. Narrative account of the Fall of France in 1940. Very readable but also dated in terms of its non-critical acceptance of the defeatism argument. *Keisling, Eugenia C. Arming Against Hitler: France and the Limits of Military Planning. UP of Kansas, 1996. Study stressing the weaknesses of the French reserve, mobilization and training system. Rejects the defeatism interpretation. *Maier, Klaus A. Germany and the Second World War: Germany's Initial Conquests in Europe. Oxford UP, 1991. English translation of a thorough collective German academic study, giving a detailed account of all events. *May, Ernest R. Strange Victory: Hitler's Conquest of France. Hill & Wang, 2001. A modern account for the general public focusing on politics, strategy and intelligence. *Mosier, John. The Blitzkrieg Myth: How Hitler and the Allies Misread the Strategic Realities of World War II. HarperCollins, 2003. Strongly revisionist interpretation, denying that the concept of Blitzkrieg can even be applied to this campaign. *Shepperd, Alan. France 1940, Blitzkrieg in the West; Osprey Campaign Series #3, Osprey Publishing, 1990. *Shirer, William L.. Berlin Diary: The Journal of a Foreign Correspondent, 1934-1941. Johns Hopkins UP, 2002. In the period just before the surrender, Shirer worked for CBS News under Edward R Murrow, moving around Europe as events dictated. This is his written account of the period. * Young, Robert J. In Command of France: French Foreign Policy and Military Planning, 1933-1940, Cambridge: Harvard University Press, 1978. == Other websites == *BBC - History - WW2: Fall of France Campaign (Flash animation of the campaign) * Official German account of the Battle of France (as published in 1940) * Battle of France *Armistice Agreement Between Germany and France, 22 June 1940 Category:1940 in France Category:1940 events France France France France France France France France France Category:May 1940 events Category:June 1940 events",
 "title": "Battle of France"
}