{
 "id": "166208",
 "text": "William Jason \"Jay\" Reso (born November 30, 1973) is a Canadian professional wrestler and actor. He is currently working for All Elite Wrestling (AEW) under the ring name Christian Cage. He is a former two-time AEW TNT Champion. Reso became famous under the ring name Christian in the World Wrestling Federation/WWE, where was a former World Heavyweight Champion, two time ECW Champion, four-time Intercontinental Champion and nine-time World Tag Team Champion (seven times teaming with his real-life friend Edge). He is also known for his time in Total Nonstop Action Wrestling (TNA) as Christian Cage from 2005 to 2008, where he won the NWA World Heavyweight Championship twice during his time in TNA (making him a five-time world champion overall), and was the last official holder of that title under the TNA name. Reso also hosted a weekly podcast with Adam \"Edge\" Copeland known as “E&C;’s Pod of Awesomeness”. It ran from March 2017 until September 27, 2019. ==Career== ===All Elite Wrestling=== On March 7, 2021 at Revolution, Cage made his surprise debut for All Elite Wrestling (AEW). It was announced by AEW president Tony Khan in the post-event media scrum that Cage had signed a multi-year contract with the company. He made his in-ring debut for AEW at Double or Nothing on May 30. He competed in the Casino Battle Royale, lasting until the end before being eliminated by Jungle Boy. On the September 23 episode of Collision, Cage won the AEW TNT Championship after competing in a three-way match against Luchasaurus and Darby Allin. Cage had claimed Luchasaurus' TNT Championship as his own in the months leading up to the match. At Worlds End, Cage would lose the title to his former friend Adam Copeland in an no disqualification match. Minutes after the match, Cage would use the title shot that was earned by Killswitch (previously Luchasaurus) earlier on the preshow and win his second TNT Championship. ==Acting== ===Movies=== *Shoot 'Em Up - Senator's guard (2007) *Dark Rising: Bring Your Battle Axe - Ricky (2007) *Bloodstained Memoirs - Himself (2009) *Medium Raw: Night of the Wolf - Officer Pete Gallant (2010) *SuperGrid - Kurtis (2018) *Cagefighter: Worlds Collide - Stephen Drake (2018) (also executive producer) ===Television=== *Casino Cinema - Christian Cage (2006) *House - Christian Cage (1 episode) *Haven - McHugh (2014-2015) *Murdoch Mysteries - Leonard Stoker (2017) *Knight Fight - Himself (2017 (Host) ==Championships== *All Elite Wrestling **AEW TNT Championship (two times) *East Coast Wrestling Association **ECWA Heavyweight Championship (one time) *Insane Championship Wrestling **ICW Street Fight Tag Team Championship (one time) (with Sexton Hardcastle) *International Wrestling Alliance **IWA Tag Team Championship (one time) (with Earl The Orderly) *Pennsylvania Championship Wrestling **PCW Heavyweight Championship (one time) *Pro Wrestling Illustrated **Match of the Year (2000) (vs. The Dudley Boyz and The Hardy Boyz in a Triangle Ladder match at WrestleMania 2000) **Match of the Year (2001) (vs. The Dudley Boyz and The Hardy Boyz in a TLC match at WrestleMania X-Seven) **He was ranked #7 of the 500 best singles wrestlers in the PWI 500 in 2007. *Total Nonstop Action Wrestling **NWA World Heavyweight Championship (two times) *World Wrestling Federation/World Wrestling Entertainment/WWE **World Heavyweight Championship (two times) **ECW Championship (two times) **WWF/E Intercontinental Championship (four times) **WWF Light Heavyweight Championship (one time) **WWF Hardcore Championship (one time) **WWF European Championship (one time) **World Tag Team Championship (nine times) (with Edge (seven), Lance Storm (one) and Chris Jericho (one) **Twenty Third Triple Crown Champion **Eleventh Grand Slam Champion *Wrestling Observer Newsletter **Tag Team of the Year (2000) (with Edge) **Worst Worked Match of the Year (2006) (TNA Reverse Battle Royal on the October 26, 2006 episode of TNA Impact!) == References == == Other websites == * * Category:1973 births Category:Living people Category:Actors from Kitchener, Ontario Category:All Elite Wrestling people Category:Canadian movie actors Category:Canadian television actors Category:Canadian professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Kitchener, Ontario Category:Total Nonstop Action Wrestling alumni",
 "title": "Christian Cage"
}