{
 "id": "166398",
 "text": "Pirna is a Große Kreisstadt in the rural district of Sächsische Schweiz- Osterzgebirge in the Free State of Saxony, Germany. ==Geography== Pirna is located at the beginning of the Elbtalkessel, where the Wesenitz and the Gottleuba flow in the Elbe. In the south of Pirna is the Osterzgebirge. Pirna is named Tor zur Sächsischen Schweiz (door to the Sächsische Schweiz). ===Nearby towns=== Direct in the north of Pirna is the capital of Saxony, Dresden. Nearby towns are Bad Gottleuba-Berggießhübel, Bahretal, Dohma, Dohna, Dürrröhrsdorf-Dittersbach, Heidenau, Lohmen, Stadt Wehlen and Struppen. All these towns are in the rural districts of Sächsische and Schweiz- Osterzgebirge. ==History== ===Stone Age=== The first relics of human settlers are from the last ice age. In the neolithic age, farmers lived in this region. In the 6th century the Sorbs settled in Pirna. ===Middle Ages=== With the foundation of the Mark Meißen in the 10th century, it became possible to confirm when the Pirna area had been settled. The castle of Prina was built during the 12th century. Henry III, Margrave of Meissen established the rights of the town of Pirna officially. At this time, the river Elbe was important for trade. The town was first mentioned in writing in 1233. Wenceslaus II of Bohemia bought the town in 1293, so the town was Bohemian until 1405. In 1307, a convent, a complex where nuns lived, was founded in the district. ==Population change== The table below lists the population change of Pirna since 1300. Since 1960 the population was counted on December 31 every year.Statistisches Landesamt Sachsen statistics til 1899 * 1300 - 1,500 * 1550 - 3,538 * 1801 - 4,397 * 1834 - 5,556 * 1871 - 8,905 * 1875 - 10,581 * 1880 - 11,670 * 1890 - 13,852 1900 til 1989 * 1910 - 19,525 * 1925 - 30,460 * 1933 - 33,656 * 1939 - 36,325 * 1946 - 37,426 1 * 1950 - 38,676 2 * 1960 - 41,111 * 1981 - 48,387 * 1984 - 47,601 since 1990 * 1995 - 39,194 * 1998 - 42,728 * 2000 - 42,108 * 2002 - 40,853 * 2004 - 40,259 * 2005 - 40,110 * 2006 - 39,751 * 2007 - 39,438 ==Notes== == Other websites == * Homepage of Pirna (german) * The historical old town of Pirna (german) * board of trustees (german) * The history of the town (von Hugo Jensch) (german) Category:Sächsische Schweiz- Osterzgebirge Rural District",
 "title": "Pirna"
}