{
 "id": "16631",
 "text": "The Allies, (formally referred to as the United Nations from 1942-1945) were a group of nations that fought against the Axis countries in World War II. They were successful in defeating the Axis nations. The war ended in 1945. The group of nations was later named the United Nations by U.S. President Franklin Roosevelt. The main great powers, sometimes called \"The Big Three\", were the United Kingdom, the United States, and the Soviet Union. Sometimes China was added to the list, making a \"Big Four\". == 1939-1941 == Poland was invaded by Germany on 1 September 1939, so Britain and France declared war two days later. Many more countries joined the alliance after Germany invaded them. France fell after a German invasion from May - June 1940 and a puppet state was put in place, so the British and the remaining forces of the exiled governments later invaded the Vichy french territories. These freed lands were called Free France Germany invaded the Soviet Union on 22 June 1941 and the Soviets allied with the British and the other allies. The United States joined the war after the Japanese bombed Pearl Harbor. == Declaration by the United Nations == The alliance was formalised in the Declaration by United Nations signed on 1 January 1942. There were the 26 original signatories of the declaration; the Big Four were listed first: * United States * United Kingdom * Soviet Union * China * Australia * Belgium * Canada * Costa Rica * Cuba * Czechoslovakia * Dominican Republic * El Salvador * Greece * Guatemala * Haiti * Honduras * India * Luxembourg * Netherlands * New Zealand * Nicaragua * Norway * Panama * Poland * South Africa * Yugoslavia == Major Allied Powers == * * * * * == Other Allied Powers == * Albania * * * * * * * * * * * * * * * * * * == Client and occupied states == === British === * * * === Soviet sphere === * Bulgaria * * * * == Co-belligerent states == * * == 1942-1945 == Advances in Eastern Europe and North Africa in late 1942 changed the course of the war and continued on other fronts until the war ended. (there were also slow advances in the pacific) The allies invaded italy in 1943, after driving the axis out of Africa. And so Italy changed sides on 8 September 1943. and with German forces staying, a civil war began. The Soviet Red Army continued advances against the axis, ending the siege of Leningrad, liberating Crimea, and invading Romania. On June 22 1944, operation Bargration was launched advancing to the Hungarian border and to Warsaw. Meanwhile in Western Europe, D-Day was launched on June 6 1944 and the allies started advancing rapidly in august. Romania changed sides in August after the Soviets were advancing. Bulgaria changed sides in September with the Soviets invading. Finland also changed sides in September. The allies had advances in the Pacific. In the Solomon Islands, in Burma, and other Pacific islands. On May 7 1945, Germany surrendered after 5 years and 8 months of fighting. In the Pacific, the allied liberated Burma and advanced in China, the Philippines, and Borneo. Atomic bombs were dropped on Japan and around the same time, the Soviets invaded Manchuria (a Japanese puppet state) and Japan surrendered on September 2 1945, ending World War II. == United Nations == The United Nations was formed on 24 October 1945, with France, China, The United Kingdom, The United States, and The USSR as the five permanent members of the United Nations Security Council (which met for the first time on 17 January 1946). === Members === These are the original 51 signatories (UNSC permanent members are asterisked): * Argentine Republic * Commonwealth of Australia * Kingdom of Belgium * Republic of Bolivia * United States of Brazil * Byelorussian Soviet Socialist Republic * Dominion of Canada * Republic of Chile * Republic of China* * Republic of Colombia * Republic of Costa Rica * Republic of Cuba * Czechoslovak Republic * Kingdom of Denmark * Dominican Republic * Republic of Ecuador * Kingdom of Egypt * Republic of El Salvador * Ethiopian Empire * French Republic* * Kingdom of Greece * Republic of Guatemala * Republic of Haiti * Republic of Honduras * British Raj * Imperial State of Iran * Kingdom of Iraq * Lebanese Republic * Republic of Liberia * Grand Duchy of Luxembourg * United Mexican States * Kingdom of the Netherlands * Dominion of New Zealand * Republic of Nicaragua * Kingdom of Norway * Republic of Panama * Republic of Paraguay * Republic of Peru * Commonwealth of the Philippines * Republic of Poland * Kingdom of Saudi Arabia * Union of South Africa * Syrian Republic * Republic of Turkey * Ukrainian Soviet Socialist Republic * Union of Soviet Socialist Republics* * United Kingdom of Great Britain and Northern Ireland* * United States of America* * Oriental Republic of Uruguay * United States of Venezuela * Democratic Federal Yugoslavia ==Summary table== ===The Big Three=== * (from September 1939) * (from June 1941) * (from December 1941) ===Allied combatants with governments-in-exile=== * Free FranceFrance declared war on Germany on 3 September 1939, two days after the German invasion of Poland. It was a member of the Allies until its defeat in the German invasion of France in June 1940. Unlike the other governments-in-exile in London, which were legitimate governments that had escaped their respective countries and continued the fight, France had surrendered to the Axis. The \"Free French Forces\" were a section of the French army which refused to recognize the armistice and continued to fight with the Allies. They worked towards France being seen and treated as a major allied power, as opposed to a defeated and then liberated nation. They struggled with legitimacy vis-a-vis the German client state \"Vichy France\", which was the internationally recognized government of France even among the Allies. A National Liberation Committee was formed by the Free French after the gradual liberation of Vichy colonial territory, which led to the full German occupation of Vichy France in 1942. This started a shift in Allied policy from trying to improve relations with the Vichy regime into full support to what was now the Provisional Government of the French Republic. * The Polish Underground State was allied with United Kingdom and United States. It fought against Axis Powers (mostly Germany), Soviet Union and the Polish Committee of National Liberation (PKWN). However the PKWN was allied with the Soviet Union and fought against Germany and the Polish Underground State. * CzechoslovakiaEdvard Beneš, president of the First Czechoslovak Republic, fled the country after the 1938 Munich Agreement saw the Sudetenland region annexed by Germany. In 1939 a German sponsored Slovak Republic seceded from the post- Munich Second Czechoslovak Republic, providing justification for the establishment of a German protectorate over the remaining Czech lands (the rump Carpathian Ruthenia region being annexed by Hungary). Following the outbreak of war later the same year, Beneš, in his exile, formed a Czechoslovak National Liberation Committee which after some months of negotiations regarding its legitimacy became regarded as the Czechoslovak government-in-exile by the Allies. * * Luxembourg * Netherlands * Norway * Greece * * EthiopiaThe Ethiopian Empire was invaded by Italy on 3 October 1935. On 2 May 1936, Emperor Haile Selassie I fled into exile, just before the Italian occupation on 7 May. After the outbreak of World War II, the United Kingdom recognized Haile Selassie as the Emperor of Ethiopia in July 1940 and his Ethiopian exile government cooperated with the British during their invasion of Italian East Africa in 1941. Through the invasion Haile Selassie returned to Ethiopia on 18 January, with the liberation of the country being completed by November the same year. * Philippines ===Other Allied combatant states=== * * * * * * * * * * Nigeria * Malta * * * * * * * * * * * * * * * * * * * * Costa Rica * * * * * * * * Oman * French Indochina * * * ===Former Axis powers=== * (from January 1943) * (from September 1943) * (from August 1944) * (from September 1944) * (from September 1944) * (, 1945) == Cold War == Despite the successful creation of the United Nations, the alliance of the Soviet Union with the United States and with the United Kingdom ultimately broke down and evolved into the Cold War, which took place over the following half-century. == Timeline of allied nations entering the war == The following list denotes dates on which states declared war on the Axis powers, or on which an Axis power declared war on them. The Indian Empire had a status less independent than the Dominions. === 1939 === * (September 1 1939) * (September 3 1939) * (September 3 1939) ** * (September 3 1939) * (September 3 1939) * (September 4 1939) * (September 6 1939) * (September 10 1939) * Oman (September 10 1939) === 1940 === * (April 8 1940) * (April 9 1940) * (May 10 1940) * (May 10 1940) * (May 10 1940) * (October 28 1940) === 1941 === * (April 6 1941) * (June 22 1941) * (December 7 1941) * (December 8 1941) ** * (December 8 1941) * (December 8 1941) * (December 8 1941) * (December 8 1941) * (December 8 1941) * (December 8 1941) * China (December 9 1941) * (December 9 1941) * (December 9 1941) Provisional governments or governments-in exile that declared war against the Axis in 1941 * Provisional Government of the Republic of Korea (December 10 1941) * Czechoslovakia (government-in-exile) (December 16 1941) === 1942 === * (May 22 1942) * (August 22 1942) * ( December 14 1942) === 1943 === * (January 16 1943) - former axis power * (April 7 1943) * (July 26 1943) * (September 9 1943) * (October 10 1943) - former axis power === 1944 === * (January 27 1944) * (August 25 1944) - former axis power * (September 9 1944) - former axis power * (December 30 1944) - former axis power === 1945 === * (February 2 1945) * (February 7 1945) * (February 12 1945) * (February 15 1945) * (February 15 1945) * (February 23 1945) * (February 24 1945) * (February 26 1945) * (February 27 1945) * (March 1 1945) * (March 3 1945) - former ally of Germany in the Continuation War. Finland retroactively declared war on Germany from 15 September 1944. * (March 27 1945) * (April 11 1945) * (August 10 1945) == References == Category:World War II Category:Military alliances",
 "title": "Allies of World War II"
}