{
 "id": "166475",
 "text": "Zhang Ziyi (, born February 9, 1979) is a Chinese actress, former dancer, and model. On-screen, she is known for playing independent and strong-willed characters.https://borrowers-ojs- azsu.tdl.org/borrowers/article/download/171/340/701 Born and raised in Beijing, Zhang was admitted to the Central Academy of Drama in 1996. That year, she made her acting debut in the television film Touching Starlight (1996). After her breakout role in Zhang Yimou's The Road Home (1999), which won her the Best Actress Award at the 2000 Hundred Flowers Awards, she gained international recognition for her performance in the wuxia martial arts film Crouching Tiger, Hidden Dragon (2000). She went on to star in the well- received films Hero (2002), 2046 (2004), House of Flying Daggers (2004), Princess Raccoon (2005), Dangerous Liaisons (2012), and The Grandmaster (2013). https://www.rottentomatoes.com/celebrity/zhang_ziyi Her other notable films include Rush Hour 2 (2001), which marked her Hollywood debut, Memoirs of a Geisha (2005), and My Lucky Star (2013), among others. == Early life == Zhang was born and raised in Beijing, China on 9 February 1979. Zhang began studying dance when she was 8 years old; at 11, she joined the Beijing Dance Academy at her parents' suggestion.\"Zhang Ziyi, The One that Loves You Most Is Me\" . Hao Rizi Magazine. March 2002. Retrieved 11 May 2010. At the age of 15, Zhang won the national youth dance championship and also appeared in a handful of TV commercials and began appearing in television commercials in Hong Kong.\"Ziyi Zhang Biography – Yahoo! Movies\" . Yahoo!. 11 May 2010. At the Beijing Dance Academy, she studied folk dance for six years. In 1994, she won the performance award in the National Taoli Cup Dance Competition. In 1996, Zhang entered the Central Academy of Drama in Beijing at the age of 17.https://www.britannica.com/biography/Zhang- Ziyi#:~:text=Zhang%20Ziyi%20(born%20February%209,propelled%20her%20to%20international%20fame. == Influence and public image == Having starred in some of the most celebrated martial arts films of all time, Zhang is widely considered one of the greatest martial arts stars in the history of cinema. https://www.slashfilm.com/818895/zhang-ziyi-had-some-unique-training-for-her- house-of-flying-daggers-role/ Zhang is regarded as one of the Four Dan actresses of China, along with Xu Jinglei, Zhao Wei and Zhou Xun.https://www.scmp.com/lifestyle/entertainment/article/3267221/6-best- female-martial-arts-stars-michelle-yeoh-zhang-ziyi-and-lady-kung-fu One of the most recognisable Asian actresses in the Western world, Time called her \"China's gift to Hollywood\" in 2005. The same year, Time named her one of the 100 Most Influential People. In 2021, Douglas Parkes of South China Morning Post (SCMP) described Zhang as \"surely the most important Chinese actress of her generation\".https://www.scmp.com/magazines/style/celebrity/article/3121024/chinese- actress-zhang-ziyis-5-best-performances-crouching Outside her acting career, she has modeled for multiple high-end fashion brands.https://www.businessoffashion.com/people/zhang-ziyi/ == Personal life == Zhang credits learning Kung-fu with making her \"stronger, both mentally and physically.\"https://kungfukingdom.com/profile-zhang-ziyi/amp/ In May, 2015, Zhang married Chinese rock musician Wang Feng. They have two children: a daughter (born December 2015) and a son (born January 2020), both born in the United States.Rui, Zhang (3 January 2020). \"Zhang Ziyi gives birth to second child on New Year's Day\" . China.org.cn. Retrieved 12 September 2020.Tan, Kendra (4 January 2020). \"Zhang Ziyi Gives Birth To A Baby Boy\" Today Online. Retrieved 12 September 2020. On October 23, 2023, Zhang and Wang announced their divorce on Weibo. ==References== ==Other websites== * * ZiYi Zhang's album Category:1979 births Category:Chinese movie actors Category:Living people",
 "title": "Zhang Ziyi"
}