{
 "id": "166946",
 "text": "A Fountain is an arrangement, usually made by man; in it, the water from a source is captured in some way. Most often, it is used to fill a basin of some kind. Sometimes there are many basins, and water runs from one into the next. It is also common to have sculptures in fountains. https://dictionary.cambridge.org/us/dictionary/english/fountain Sometimes jets are used to make the water go high into the air, using pressure. == History == Ancient civilizations built stone basins to capture and hold precious drinking water. A carved stone basin, dating to around 700 BC, was discovered in the ruins of the ancient Sumerian city of Lagash in modern Iraq. The ancient Assyrians constructed a series of basins in the gorge of the Comel River, carved in solid rock, connected by small channels, descending to a stream. The lowest basin was decorated with carved reliefs of two lions. The ancient Egyptians had ingenious systems for hoisting water up from the Nile for drinking and irrigation, but without a higher source of water it was not possible to make water flow by gravity, There are lion-shaped fountains in the Temple of Dendera in Qena. == Drinking Fountains == A water fountain or drinking fountain is designed to provide drinking water and has a basin arrangement with either continuously running water or a tap. The drinker bends down to the stream of water and swallows water directly from the stream. Modern indoor drinking fountains may incorporate filters to remove impurities from the water and chillers to reduce its temperature. In some regional dialects, water fountains are called bubblers. Water fountains are usually found in public places, like schools, rest areas, libraries, and grocery stores. Many jurisdictions require water fountains to be wheelchair accessible (by sticking out horizontally from the wall), and to include an additional unit of a lower height for children and short adults. The design that this replaced often had one spout atop a refrigeration unit. In 1859, The Metropolitan Drinking Fountain and Cattle Trough Association was established to promote the provision of drinking water for people and animals in the United Kingdom and overseas. More recently, in 2010, the FindaFountain campaign was launched in the UK to encourage people to use drinking fountains instead of environmentally damaging bottled water. ==References==",
 "title": "Fountain"
}