{
 "id": "166913",
 "text": "Specialized English is a controlled version of the English language used for radio broadcasting, easier for non-native speakers of English. It is based on Voice of America (VoA) Special English. Specialized English was set up initially by Feba Radio in the UK. Feba now uses Specialized English with US radio companies Words of Hope and Back to God Ministries International. All three are Christian, but Specialized English is not used for religious preaching programs. Its main use is in the features service program 'Spotlight', which is widely broadcast on over sixty outlets globally. Scripts and audio are also available freely on the Spotlight website. == Design and usage == Specialized English sounds the same as Special English, and it almost is the same. Both use a 1500 word core vocabulary, short sentences, and slow delivery (about 90 words per minute). Special English was used from about 1959 by Voice of America. Specialized was written in the late 1990's, independently of Voice of America. The basic design is identical, but there is a slight difference in the vocabulary, and Specialized is more international. VoA is a federal US government department, so it doesn't make Special English programs for anything other than VoA's own use. Specialized English was designed by the civil society, and the developers try to make programs for several purposes. The developers of Specialized felt they should choose a name to show both the similarity and the difference. The reason that Specialized was based on Special English is related to their respective usage. They are not primarily teaching tools (even though they are popular as an aid to learning) but communication tools. The choice of words in the 1500 word list depends to a degree on what is to be communicated. Most of the words are the most frequently learned, most commonly used English words. Both tools use these words. But many words are chosen for the intended purpose. For example, Special English uses words a US government news service might need, such as Congress, federal, administration, capitalism and recession. Specialized replaces some of these words with words used for religious subjects, such as blessing, prayer, miracle, and faith. The Specialized English word list has been revised in 2000 and 2007, in the light of experience. Still, the overlap of the two vocabularies is 91.3%. The Specialized English word list allows greater breadth of meaning in some of the words used in both lists. For example, the word 'joint': Special: joint – ad. shared by two or more Specialized: joint – ad. shared by two or more; n. the place where two parts or things are fixed together. Specialized also allows more prefixes and suffixes, which has allowed some words to be removed from the core list. (e.g.: wonderful not needed in the list because it can be built from wonder+ful) As well as the 1500 word core vocabulary, both Special and Specialized English also generally allow: inflections of the core words, numbers up to a million, pronouns, proper nouns, and any words whose meaning can be communicated in real time (in a radio broadcast) using the core vocabulary. The following table lists some differences between the two methods. Property Special English (VoA) Specialized English (Feba et al.) Date developed 1959 originally, with later revisions. 1998 cloned from VoA Special English, with mods and revisions. Core vocabulary 1493 words 1508 words Extra words (appendices) 117 words 89 words Principal uses Radio news and features, esp. US. Radio features, international. Broadcast context VoA outlets, usually with other English broadcasts. Independent outlets, mostly Christian, usually in non-English language services. Use of English US English US and UK English. Voices US International, but mostly US and UK Use of music and sound effects Sparing Extensive Production centers 1 US 2 US, 1 UK Words in one core list, but not the other. (However, the way that Special/ized English works means that the presence/absence of a word in the core list is not the only guide to whether it is used in the programs). In 'Special' list only: administration, agency, aggression, agriculture, air force, album, amend, anarchy, arms, artillery, astronaut, astronomy, asylum, automobile, ballot, boycott, budget, cabinet, campaign, capitalism, careful, case (1 of 2), ceasefire, chairman, children, civil rights, civilian, clergy, coalition, colony, committee, congress, conservative, container, convention, co-operate, curfew, customs (port), deaf, deficit, delegate, denounce, deploy, dictator, diplomat, disarm, dissident, extremist, federal, fireworks, government, grind, guarantee, halt, headquarters, hijack, inflation, jail, lamb, legislature, liberal, manufacture, mayor, media, militant, missile, mob, movie, nominate, offensive, our, oust, parachute, postpone, profession, professor, propaganda, publication, radar, railroad, realistic, recession, relations, repress, sabotage, senate, sickness, stab, submarine, substitute, subversion, succeed, supervise, swear in, telescope, them, transportation, treason, troops, truce, us, veto, wonderful In Specialized list only: achieve, address, advantage, alliance, amaze, arrow, attitude, authority, bag, basic, behave, behavior, bend, birth, bless, blessing, bow, bow, branch, breath, camel, cassette, cent, chapter, character, class, coat, coin, column, concentrate, conscience, corner, courage, cousin, crown, curtain, death, decay, deserve, devote, dictate, divorce, donkey, else, envy, excite, faith, favorite, fever, gate, generation, global, greed, image, Internet, joy, king, layer, leaf, lock, lord, lot, manage, master, medical, messenger, miracle, national, negative, notice, orange, origin, particular, persuade, pleasant, positive, poverty, prayer, print, product, promise, proud, railway, refrigerator, relate, rent, replace, respect, rid, royal, shame, shirt, smile, snake, solution, song, student, success, sword, symbol, table, tempt, tent, those, toilet, translate, triangle, trousers, truth, verse, virgin, wine, wing, witness. Category:English language",
 "title": "Specialized English"
}