{
 "id": "167226",
 "text": "The Chinese zodiac is a mathematical cycle of 12 animals. Each animal represents one year. People are associated with the zodiac animal for the year that they are born. The 12 animals in order are: Rat, Ox, Tiger, Rabbit, Dragon, Snake, Horse, Goat, Monkey, Rooster, Dog, and Pig. Although it is called the Chinese zodiac, this system is also used in several other countries in Asia such as Korea, Japan, and Vietnam. The animals in the zodiac vary in different cultures. In Vietnam, the cat replaces the rabbit and the buffalo replaces the ox. Some countries replace the pig with the boar, and in Thailand, there is a naga instead of a dragon. ==Personality== Some Chinese people believe that each zodiac animal has a personality, and people born in the same year may have similar personalities.Theodora Lau, The Handbook of Chinese Horoscopes, pp. 2–8, 30–5, 60–4, 88–94, 118–24, 148–53, 178–84, 208–13, 238–44, 270–78, 306–12, 338–44, Souvenir Press, New York, 2005 Rat years: 1924, 1936, 1948, 1960, 1972, 1984, 1996, 2008, 2020 Honest, freedom, hard working, charming. Can be selfish, ruthless, controlling, scheming. Ox years: 1925, 1937, 1949, 1961, 1973, 1985, 1997, 2009, 2021 Smart, calm, patient, inspiring, modest. Can be stubborn, narrow-minded, demanding, rigid. Tiger years: 1926, 1938, 1950, 1962, 1974, 1986, 1998, 2010, 2022 Aggressive, rebellious, strong, daring, generous. Can be restless, clumsy, hot-temper, impatient. Rabbit years: 1927, 1939, 1951, 1963, 1975, 1987, 1999, 2011, 2023 Kind, sensitive, elegant, artistic, cautious. Can be moody, shy, lazy, opportunistic. Dragon years: 1928, 1940, 1952, 1964, 1976, 1988, 2000, 2012, 2024 Strong, proud, direct, eccentric, show off. Can be arrogant, violent, brash, controlling. Snake years: 1929, 1941, 1953, 1965, 1977, 1989, 2001, 2013, 2025 Wise, graceful, calm, mystic, shrewd. Can be a loner, bad communicator, possessive, distrustful. Horse years: 1930, 1942, 1954, 1966, 1978, 1990, 2002, 2014, 2026 Cheerful, popular, talkative, witty, earthly, responsible. Can be fickle, rude, gullible, stubborn. Goat years: 1931, 1943, 1955, 1967, 1979, 1991, 2003, 2015, 2027 Righteous, honest, shy, artistic, understanding. Can be moody, a worrier, a complainer, and soft. Monkey years: 1932, 1944, 1956, 1968, 1980, 1992, 2004, 2016, 2028 Witty, curious, flexible, sociable, smart. Can be vain, clumsy, trickster, snobbish. Rooster years: 1933, 1945, 1957, 1969, 1981, 1993, 2005, 2017, 2029 Neat, organized, alert, scientific, responsible. Can be critical, egotistical, rough, opinionated. Dog years: 1934, 1946, 1958, 1970, 1982, 1994, 2006, 2018, 2030 Honest, smart, loyal, sense of justice, affectionate. Can be lazy, cold, stubborn, quarrelsome. Pig years: 1935, 1947, 1959, 1971, 1983, 1995, 2007, 2019, 2031 Simple, hard working, strong, peace-loving, trusting. Can be naive, gullible, materialistic, clingy. ==Hours== In the old days, China, Korea and Japan used a 12-hour system to tell the time of day and night (unlike the 24 hour system used today). The 12 hour system divides the day of 24 hours into 12 hours, each of which has a sign of the zodiac: *11:00 PM to 1:00 AM is the hour of the Rat. *1:00 AM to 3:00 AM is the hour of the Ox. *3:00 AM to 5:00 AM is the hour of the Tiger. *5:00 AM to 7:00 AM is the hour of the Rabbit. *7:00 AM to 9:00 AM is the hour of the Dragon. *9:00 AM to 11:00 AM is the hour of the Snake. *11:00 AM to 1:00 PM is the hour of the Horse. *1:00 PM to 3:00 PM is the hour of the Goat. *3:00 PM to 5:00 PM is the hour of the Monkey. *5:00 PM to 7:00 PM is the hour of the Rooster. *7:00 PM to 9:00 PM is the hour of the Dog. *9:00 PM to 11:00 PM is the hour of the Pig ==Directions== The Chinese and Japanese would call the different directions (North, Northeast, Northwest, East, South, Southeast, Southwest, West), based on the names of the zodiac animals. # Rat (Water, North) # Ox (Earth, North-Northeast) # Tiger (Wood, East-Northeast) # Rabbit (Wood, East) # Dragon (Earth, East-Southeast) # Snake (Fire, South-Southeast) # Horse (Fire, South) # Goat (Earth, South-Southwest) # Monkey (Metal, West-Southwest) # Rooster (Metal, West) # Dog (Earth, West- Northwest) # Pig (Water, North-Northwest) ==References== ==Other websites== Category:Asian mythology",
 "title": "Chinese zodiac"
}