{
 "id": "167276",
 "text": "The England cricket team represents England and Wales in international cricket.Until 1992 it also represented Scotland Since 1 January 1997 it has been governed by the England and Wales Cricket Board (ECB), having been previously governed by Marylebone Cricket Club (MCC) from 1903 until the end of 1996. == Executive Management Team == Executive body members directly report to CEO: * Richard Gould - Chief Executive Officer * Rob Andrew - Managing Director, Professional Game * Vikram Banerjee - Director of Business Operations * Meena Botros - General Counsel * Clare Connor CBE - Deputy CEO & Managing Director * Leshia Hawkins - Managing Director, Recreational Game * Rob Key - Managing Director, England Men * Kate Miller - Chief Communications Officer * Zoë Reynolds - HR Director * Tony Singh - Chief Commercial Officer * Nimesh Kataria - Chief Financial Officer * Neil Snowball - Managing Director, Competitions and major events. == History == England and Australia were the first teams to play a Test match (between 15 and 19 March 1877). These two countries plus South Africa formed the Imperial Cricket Conference on 15 June 1909. This was the predecessor to today's International Cricket Council. England and Australia also played the first One Day International (ODI) on 5 January 1971. England's first Twenty20 International (T20I) was played on 13 June 2005, once more against Australia. == Achievements == As of 25 January 2021, England has played 1,030 Test matches, winning 376 and losing 305 (with 349 draws). The team has won The Ashes on 32 occasions, the same number as their opponents Australia. England has also played 752 ODIs, winning 378, and its record in major ODI tournaments includes finishing as runners-up in three Cricket World Cups (1979, 1987 and 1992), and two ICC Champions Trophy (2004 and 2013). The team has played 126 T20Is, winning 64. They won the ICC World Twenty20 in 2010, and were runners-up in 2016. England are currently ranked fourth in Tests, first in ODIs and first in T20Is by the ICC. == References == Category:Cricket teams in England and Wales Category:1877 establishments in the United Kingdom Category:National sports teams of England Category:Test cricket teams Category:Men's national cricket teams",
 "title": "England men's cricket team"
}