{
 "id": "167304",
 "text": "Theodor Eicke (17 October 1892 in Hampont, Alsace–Lorraine, Germany (Today part of France) – 26 February 1943 near Lozova, Ukraine, Soviet Union) was an SS-Obergruppenführer of the SS and General of the Waffen-SS. He worked for the Bavarian Army from 1909-1919 before and after World War I in the German Empire which was led by Kaiser Wilhelm II (Emperor/Kaiser ; 1888-1918). He joined the Schutzstaffel (aka the SS) in 1930 during the Weimar Era Germany and was later commandant of Dachau from June 1933-July 1934 and together with his adjutant Michael Lippert (1897-1969). In December 1934, Eicke met Rudolf Höss. He also was one of the executioners of SA chief Ernst Röhm during the Night of the Long Knives purge taking orders from Reichsführer-SS Heinrich Himmler and SS- Obergruppenfuhrer Reinhard Heydrich in Nazi Germany. In 1939 Eicke became commander of the SS Division Totenkopf of the Waffen-SS lead the division during World War 2 in the Battle of France in 1940 on the Western Front, the Invasion Of Yugoslavia (1941) and Operation Barbarossa in 1941 and the Third Battle Of Kharkov in 1943 on the Eastern Front. He died in a plane crash when his plane was shot down during the Third Battle Of Kharkov of 1943, 24-days after the Battle Of Stalingrad in the RSFSR, Soviet Union and just a year after Nazi Offical Fritz Todt died in a Plane Crash in February 1942. He was the commander of the concentration camp of Dachau. During the World War II was he the leader of the Totenkopf Division. Eike was on behalf of the Nazi Party a member of the Reichstag. He was also a member of the SA. Promotions in the Schutzstaffel (1930-1943) SS-Mann ; private and SS-Truppfuhrer ; Sergeant First Class,SS-Sturmfuhrer ; Second Lieutenant (1930) SS-Sturmbannfuhrer ; Major and Standartenfuhrer ; Colonel (1931) SS-Oberfuhrer ; Colonel (1932-1934),SS-Brigadefuhrer ; Major General (1934) SS-Gruppenfuhrer ; Lieutenant-General (1934-1941) SS-Obergruppenfuhrer ; General (1942-1943) Category:1892 births Category:1943 deaths Category:German war criminals Category:Holocaust perpetrators Category:Members of the Reichstag (Nazi Germany) Category:People from former German territories Category:Politicians of the Nazi Party Category:Sturmabteilung people Category:SS officers Category:Waffen-SS generals",
 "title": "Theodor Eicke"
}