{
 "id": "167617",
 "text": "Hermann Wilhelm Göring (January 12, 1893 – October 15, 1946) was a German war criminal, politician, and military leader in Nazi Germany. He was one of the most powerful leaders of the Nazi Party (NSDAP). Göring was responsible for creating the Nazi concentration camps. He also created the Gestapo (the Nazi secret police), which he handed over to SS chief Heinrich Himmler. In 1941, he gave Reinhard Heydrich the order to arrange the Final Solution to kill at least 6,000,000 of Jews. Göring was one of the 25 people charged at the Nuremberg Trials. He was found guilty, and hours before his execution, he killed himself in Nuremberg, Bavaria, Germany. ==Early life== ===Birth=== Göring was born in Rosenheim, Upper Bavaria, Bavaria, Germany on 12 January 1893. His parents were Ernst Heinrich Göring and Franziska Göring (born Franziska Tiefenbrunn). Hermann Göring had two brothers, Albert and Karl Ernst, and two sisters, Olga Therese Sophie and Paula Elisabeth Rosa. Göring's father was a judge. In 1885 the German chancellor, Otto von Bismarck, made Ernst Göring the first Reichskommissar (Governor-General) of South West Africa (which is now Namibia). When Göring was born, his father was serving as consul general in Haiti. His mother came home to give birth to Hermann and stayed for six weeks. Then she left the six-week-old baby with a friend in Bavaria. Neither of Hermann Göring's parents saw him until they returned to Germany three years later. ===Childhood=== Starting in 1901, Hermann Göring lived with a man named Hermann Epenstein, a wealthy doctor and businessman whose father was Jewish. Göring's father had met Epenstein in Africa. The Görings lived in his house, and later in one of his mansions. Epenstein and Göring's mother began an affair, which they continued for 15 years. Epenstein became Göring's godfather. Göring attended the grammar schools in Fürth and Ansbach. In the games he played as a child, the story was always about war. ===Teenage=== In 1905, he went to a military school in Karlsruhe. He got his Abitur, and an officer exam, in 1912. He was assigned to the Bavarian Prinz Wilhelm Regiment (112th Infantry) in Mulhouse. ==First World War== When the First World War started, Göring was a Lieutenant. He had served in the infantry. In 1915, because of his rheumatism, he had to go to a hospital. His friend, Bruno Loerzer, got him to join the air force. In France, he flew as an observer, a person who looked for targets and enemy planes. In 1915, he was awarded the Iron Cross First Class for his work. In 1916, he was trained to fly a plane. On 14 March of that year, he shot down his first bomber. The following year, he became the leader of the 27th Flying Group. In 1918, after he shot down his 19th enemy plane, Göring was awarded the highest air force award in Germany: the Pour le Mérite (also called \"The Blue Max\"). After the death of Manfred von Richthofen, a German fighter pilot, he became the leader of the flying group \"The Red Baron\". ==Weimar Republic== Between 1919 and 1921, Göring worked as a stunt pilot in Scandinavia. In November 1922, he met Adolf Hitler and later became a member of the National Socialist German Workers' Party (NSDAP). In 1923 he married Carin von Kantzow in Stockholm, Sweden on 3 February 1923. Also, while leading the SA (Oberste SA-Führer), Göring participated in the Beer Hall Putsch with Hitler and was wounded. Afterward he went to Austria, but continued to have chronic pain from his injury. A doctor prescribed morphine, but Göring became dependent on it. Between 1925 and 1926, he was treated twice at the Långbro mental hospital in Sweden. He came back to Germany in 1927. In 1928, he became a member of the Reichstag of the Weimar Republic. He remained a member until the end of the Second World War. In 1932, the NSDAP became the most powerful party of the Reichstag. Göring then became speaker of the Reichstag.Between 1932 and 1945, he was President of the German Reichstag and also a minister of the Third Reich under Adolf Hitler. In the Second World War, he was the Commander-in-Chief of the German air force. Göring became President of the German Reichstag in 1932. The following year, Hitler became chancellor of the Weimar Republic. He made Göring a minister of the Reich without a specific area of responsibility. This meant that Göring did not lead any particular ministry. Then, on 30 August 1933, Paul von Hindenburg made Göring a General. Between 1934 and 1935 he became minister of several agencies. His wife had died in 1931, and in 1935 he married Emmy Sonnemann in Berlin. In 1936, he sent the German Condor Legion to Spain to help Francisco Franco. After the Kristallnacht in 1938, he was in charge of removing Jewish businessmen from the German economic system. } ==World War II== In 1940, Hitler made Göring Reichsmarschall (Marshal of the Empire) The following year, Göring ordered Heydrich to make a plan for the Holocaust. In 1942, he gave Fritz Sauckel the order to use the Russian population for industry-work. On 20 April 1945, he left Hitler's birthday party and went to Berchtesgaden. He told Hitler that he had very important things to do in south Germany. From Berchtesgaden, Göring sent a telegram to Hitler in Berlin. In the telegram Göring asked about taking over the affairs of state. ===Demotion=== Towards the end of the war, after the telegram, Göring started to talk with the Allies. Hitler found out. On 29 April 1945, in the last days of the war, Hitler ordered Göring's arrest. He also removed Göring from all of his leadership positions and kicked him out of the Nazi Party. On 8 May 1945, Nazi Germany officially surrendered and World War II ended in Europe. The next day, Göring surrendered to the Americans in Bavaria. ==Post War== ===The Nuremberg Trials=== The Nuremberg Trials started on 20 November 1945. On 18 March 1946, Göring was questioned by the Allies. After this, he was imprisoned in Nuremberg. Göring was the highest-ranking Nazi official tried at Nuremberg. He was tried for four crimes: # Crimes against peace # War crimes # Crimes against humanity # Conspiracy to commit crimes against peace, war crimes, and crimes against humanity He was found guilty on all four charges, and on 1 October 1946 he was sentenced to death by hanging. ===Death=== One day before his execution, Göring committed suicide by taking a tablet of cyanide. Historians do not know how Göring got the cyanide or how long he hid it. One story claims he got the cyanide from an American soldier who was in love with a German woman. At the Nuremberg trials, Göring said: > Of course the people don't want war. But after all it's the leaders of the > country who determine the policy, and it's always a simple matter to drag > the people along whether it's a democracy, a fascist dictatorship, or a > parliament, or a communist dictatorship. Voice or no voice, the people can > always be brought to the bidding of the leaders. That is easy. All you have > to do is tell them they are being attacked, and denounce the pacifists for > lack of patriotism, and exposing the country to greater danger. ==Related pages== * Nazism * Fascism * Genocide * Nazi Germany * The Holocaust * The Final Solution * List of Nazi concentration camps ==References== ===Bibliography=== * * * * == Other websites == * * * * * Category:1893 births Category:1946 deaths Category:German aviators Category:Suicides by poison Category:Suicides in Germany Category:German war criminals Category:Sturmabteilung people Category:Holocaust perpetrators Category:Antisemitism in Germany Category:Politicians from Bavaria Category:Prime ministers of Prussia Category:Nazis who committed suicide Category:Politicians of the Nazi Party Category:German generals of World War II Category:Recipients of the Knight's Cross Category:Politicians who committed suicide Category:Government ministers of Nazi Germany Category:Members of the Reichstag (Nazi Germany) Category:German military personnel of World War I Category:Members of the Reichstag (Weimar Republic) Category:People who committed suicide in prison custody",
 "title": "Hermann Göring"
}