{
 "id": "167681",
 "text": "WWE No Mercy, known as NXT No Mercy since 2023, is a a series of professional wrestling pay-per-view and livestreaming shows made by WWE. The video game WWF No Mercy is based on the series. The event aired yearly from 1999 to 2008 and was was succeeded by WWE Hell in a Cell in 2009. It was bought back in 2016 and 2017 as a main roster event, and in 2023 for the NXT brand. ==Events== Raw-branded event SmackDown-branded event NXT-branded event # Event Date City Venue Main Event Ref. 1 No Mercy (UK) May 16, 1999 Manchester, England Manchester Evening News Arena Stone Cold Steve Austin (c) vs. The Undertaker vs.Triple H in an Anything Goes Triple Threat match for the WWF Championship 2 No Mercy (1999) October 17, 1999 Cleveland, Ohio Gund Arena Triple H (c) vs. Stone Cold Steve Austin in an Anything Goes match for the WWF Championship 3 No Mercy (2000) October 22, 2000 Albany, New York Pepsi Arena The Rock (c) vs. Kurt Angle in a No Disqualification match for the WWF Championship 4 No Mercy (2001) October 21, 2001 St. Louis, Missouri Savvis Center Stone Cold Steve Austin (c) vs. Kurt Angle vs. Rob Van Dam in a Triple Threat match for the WWF Championship 5 No Mercy (2002) October 20, 2002 North Little Rock, Arkansas Alltel Arena Brock Lesnar (c) vs. The Undertaker in a Hell in a Cell match for the WWE Championship 6 No Mercy (2003) October 19, 2003 Baltimore, Maryland 1st Mariner Arena Brock Lesnar (c) vs. The Undertaker in a Biker Chain match for the WWE Championship 7 No Mercy (2004) October 3, 2004 East Rutherford, New Jersey Continental Airlines Arena John \"Bradshaw\" Layfield (c) vs. The Undertaker in a Last Ride match for the WWE Championship 8 No Mercy (2005) October 9, 2005 Houston, Texas Toyota Center Batista (c) vs. Eddie Guerrero for the World Heavyweight Championship 9 No Mercy (2006) October 8, 2006 Raleigh, North Carolina RBC Center King Booker (c) vs. Bobby Lashley vs. Batista vs. Finlay in a Fatal four-way match for the World Heavyweight Championship 10 No Mercy (2007) October 7, 2007 Rosemont, Illinois Allstate Arena Triple H (c) vs. Randy Orton in a Last Man Standing match for the WWE Championship 11 No Mercy (2008) October 5, 2008 Portland, Oregon Rose Garden Chris Jericho (c) vs. Shawn Michaels in a Ladder match for the World Heavyweight Championship 12 No Mercy (2016) October 9, 2016 Sacramento, California Golden 1 Center Bray Wyatt vs. Randy Orton 13 No Mercy (2017) September 24, 2017 Los Angeles, California Staples Center Brock Lesnar (c) vs. Braun Strowman for the WWE Universal Championship 14 NXT No Mercy (2023) September 30, 2023 Bakersfield, California Mechanics Bank Arena Becky Lynch (c) vs. Tiffany Stratton in an Extreme Rules match for the NXT Women's Championship 15 NXT No Mercy (2024) September 1, 2024 Denver, Colorado Ball Arena Ethan Page (c) vs. Joe Hendry for the NXT Championship == References == Category:WWE No Mercy",
 "title": "WWE No Mercy"
}