{
 "id": "167741",
 "text": "Juan Carlos I (,In other languages of Spain, the name of the King Juan Carlos is adapted as: * , * , * , * , * , full name: Juan Carlos Alfonso Víctor María de Borbón y Borbón-Dos Sicilias, born 5 January 1938) is a member of the Spanish royal family. He was the King of Spain from 1975 until his abdication in 2014. In Spain, since his abdication, Juan Carlos has usually been referred to as the ('King Emeritus'). During most of his 39-year reign, he was very popular. When he became king in 1975, he transformed Spain from dictatorship to democracy this made people consider him the champion of democracy. He was a popular king and was considered Spain's hero and savoir. He ruled effectively and that the Spanish people loved him. He made Spain more modern and improved relations with many countries. The Spaniards would always experience prosperity. However in 2012, Juan Carlos' popularity started to decline as posted a photo of him hunting with an elephant in Botswana. During this time, many Spaniards were struggling to make ends meet and when Juan Carlos posted this photo, his popularity started to decline. He also had a sex relationship with Corinna zu Sayn-Wittgenstein, his former mistress. One of the Spanish royal family members was also involved in a crime. All of this made him unpopular and he eventually abdicated the throne two years later in 2014 in favor of his son, Crown Prince Felipe who became king Felipe VI. In 2020, Juan Carlos fled the country and is now living in Abu Dhabi in the UAE. == Titles and styles == * 5 January 1938 – 21 July 1969: His Royal Highness The Infante Juan Carlos of Spain * 15 January 1941 – 22 November 1975: His Royal Highness The Prince of Asturias * 21 July 1969 – 22 November 1975: His Royal Highness The Prince of Spain * 22 November 1975 – 18 June 2014: His Majesty The King of Spain * 18 June 2014 – : His Majesty King Juan Carlos I of Spain == Notes == == References == Category:1938 births Category:Living people Category:Recipients of the Order of the Legion of Honour Category:Grand Crosses of the Order of the Legion of Honour Category:Recipients of the Order of the Lion of the Netherlands Category:Knights Grand Cross of the Order of the Lion of the Netherlands Category:Bailiffs Grand Cross of the Order of St John Category:House of Bourbon Category:Spanish monarchs Category:People from Rome Category:Princes and Princesses of Asturias Category:21st-century Spanish monarchs",
 "title": "Juan Carlos I of Spain"
}