{
 "id": "167859",
 "text": "Survivor Series, also known as Survivor Series: WarGames since 2022, is a yearly professional wrestling pay-per-view and livestreaming event made by WWE. It takes place in November around the American Thanksgiving. The pay-per- view is part of WWE's \"Big Four\", along with WrestleMania, SummerSlam, and the Royal Rumble.Ian Hamilton. Wrestling's Sinking Ship: What Happens to an Industry Without Competition (p.160) The event's signature match originally was the Survivor Series elminination match, where teams of four or five wrestlers (sometimes up to seven) competed under elimination rules. All other standard rules applied, and team members were able to tag in and out in any order. From 2016 to 2021, this match took place between wrestlers of the Raw and SmackDown brands, with the NXT brand also competing at the 2019 event. The 2002 event also featured the first ever Elimination Chamber match. Since 2022, the event is based around the WarGames match, a team-based steel cage match where the cage surrounds two rings next to each other. This type of match was previously featured in the National Wrestling Alliance, World Championship Wrestling, and on the NXT TakeOver shows before Survivor Series. The change was announced by Triple H on September 19. Each event featured a men's and a women's WarGames match since. == Survivor Series dates and venues == Event Date City Venue Main Event Survivor Series (1987) November 26, 1987 Richfield, Ohio Richfield Coliseum André the Giant, Butch Reed, King Kong Bundy, One Man Gang, and Rick Rude vs. Bam Bam Bigelow, Don Muraco, Hulk Hogan, Ken Patera, and Paul Orndorff in a 5-on-5 Survivor Series match Survivor Series (1988) November 24, 1988 Akeem, Big Boss Man, Haku, Ted DiBiase, and The Red Rooster vs. Hercules, Hillbilly Jim, Hulk Hogan, Koko B. Ware, and Randy Savage in a 5-on-5 Survivor Series match Survivor Series (1989) November 23, 1989 Rosemont, Illinois Rosemont Horizon The Heenan Family (Bobby Heenan, André the Giant, Arn Anderson, and Haku) vs. The Ultimate Warriors (The Ultimate Warrior, Jim Neidhart, Marty Jannetty, and Shawn Michaels) in a 4-on-4 Survivor Series match Survivor Series (1990) November 22, 1990 Hartford, Connecticut Hartford Civic Center Hulk Hogan, The Ultimate Warrior, and Tito Santana vs. Hercules, Paul Roma, Rick Martel, The Warlord, and Ted DiBiase in a 3-on-5 Grand Finale Survivor Series match Survivor Series (1991) November 27, 1991 Detroit, Michigan Joe Louis Arena The Legion of Doom (Hawk and Animal) and Big Boss Man vs. The Natural Disasters (Earthquake and Typhoon) and Irwin R. Schyster (with Jimmy Hart) in a 3-on-3 Survivor Series match Survivor Series (1992) November 25, 1992 Richfield, Ohio Richfield Coliseum Bret Hart (c) vs. Shawn Michaels for the WWF Championship Survivor Series (1993) November 24, 1993 Boston, Massachusetts Boston Garden The All-Americans (Lex Luger, The Undertaker, Rick Steiner and Scott Steiner) (with Paul Bearer) vs. The Foreign Fanatics (Yokozuna, Crush, Ludvig Borga and Quebecer Jacques) (with Jim Cornette, Johnny Polo and Mr. Fuji) in a 4-on-4 Survivor Series match Survivor Series (1994) November 23, 1994 San Antonio, Texas Freeman Coliseum The Undertaker (with Paul Bearer) vs. Yokozuna (with Mr. Fuji and Jim Cornette) in a Casket match with Chuck Norris as the Special Guest Enforcer Survivor Series (1995) November 19, 1995 Washington, D.C. USAir Arena Diesel (c) vs. Bret Hart in a No Disqualification match for the WWF Championship Survivor Series (1996) November 17, 1996 New York, New York Madison Square Garden Shawn Michaels (c) (with Jose Lothario) vs. Sycho Sid for the WWF Championship Survivor Series (1997) November 9, 1997 Montreal, Quebec Molson Centre Bret Hart (c) vs. Shawn Michaels for the WWF Championship Survivor Series (1998) November 15, 1998 St. Louis, Missouri Kiel Center The Rock vs. Mankind for the vacant WWF Championship Survivor Series (1999) November 14, 1999 Detroit, Michigan Joe Louis Arena Triple H (c) vs. Big Show vs. The Rock in a Triple Threat match for the WWF Championship Survivor Series (2000) November 19, 2000 Tampa, Florida Ice Palace Steve Austin vs. Triple H in a No Disqualification match Survivor Series (2001) November 18, 2001 Greensboro, North Carolina Greensboro Coliseum Team WWF (The Rock, Chris Jericho, The Undertaker, Kane and Big Show) vs. Team Alliance (Steve Austin, Kurt Angle, Booker T, Rob Van Dam and Shane McMahon) in a 5-on-5 Survivor Series match Survivor Series (2002) November 17, 2002 New York, New York Madison Square Garden Triple H (c) vs. Booker T vs. Chris Jericho vs. Kane vs. Rob Van Dam vs. Shawn Michaels in the first Elimination Chamber match for the World Heavyweight Championship Survivor Series (2003) November 16, 2003 Dallas, Texas American Airlines Center Goldberg (c) vs. Triple H (with Ric Flair) for the World Heavyweight Championship Survivor Series (2004) November 14, 2004 Cleveland, Ohio Gund Arena Team Orton (Randy Orton, Chris Benoit, Chris Jericho and Maven) vs. Team Triple H (Triple H, Edge, Batista and Snitsky) in a 4-on-4 Survivor Series match Survivor Series (2005) November 27, 2005 Detroit, Michigan Joe Louis Arena Team Raw (Big Show, Carlito, Chris Masters, Kane, and Shawn Michaels) vs. Team SmackDown! (Batista, Bobby Lashley, John \"Bradshaw\" Layfield, Randy Orton, and Rey Mysterio) in a 5-on-5 Survivor Series match Survivor Series (2006) November 26, 2006 Philadelphia, Pennsylvania Wachovia Center King Booker (c) vs. Batista for the World Heavyweight Championship Survivor Series (2007) November 18, 2007 Miami, Florida American Airlines Arena Batista (c) vs. The Undertaker in a Hell in a Cell match for the World Heavyweight Championship Survivor Series (2008) November 23, 2008 Boston, Massachusetts TD Banknorth Garden Chris Jericho (c) vs. John Cena for the World Heavyweight Championship Survivor Series (2009) November 22, 2009 Washington, D.C. Verizon Center John Cena (c) vs. Triple H vs. Shawn Michaels for the WWE Championship Survivor Series (2010) November 21, 2010 Miami, Florida American Airlines Arena Randy Orton (c) vs. Wade Barrett in a Pinfall-and-submissions-only match for the WWE Championship with John Cena as the special guest referee Survivor Series (2011) November 20, 2011 New York, New York Madison Square Garden The Rock and John Cena vs. Awesome Truth (The Miz and R-Truth) Survivor Series (2012) November 18, 2012 Indianapolis, Indiana Bankers Life Fieldhouse CM Punk (c) vs. John Cena vs. Ryback in a Triple Threat Match for the WWE Championship Survivor Series (2013) November 24, 2013 Boston, Massachusetts TD Garden Randy Orton (c) vs. Big Show for the WWE Championship Survivor Series (2014) November 23, 2014 St. Louis, Missouri Scottrade Center Team Cena (John Cena, Dolph Ziggler, Big Show, Erick Rowan and Ryback) vs. Team Authority (Seth Rollins, Kane, Mark Henry, Rusev and Luke Harper) in a 5-on-5 Survivor Series match Survivor Series (2015) November 22, 2015 Atlanta, Georgia Philips Arena * Roman Reigns vs. Dean Ambrose for the vacant WWE World Heavyweight Championship * Roman Reigns (c) vs. Sheamus for the WWE World Heavyweight Championship in Sheamus' Money in the Bank contract cash-in match Survivor Series (2016) November 20, 2016 Toronto, Ontario, Canada Air Canada Centre Brock Lesnar vs. Goldberg Survivor Series (2017) November 19, 2017 Houston, Texas Toyota Center Team Raw (Braun Strowman, Finn Bálor, Kurt Angle, Samoa Joe, and Triple H) vs. Team SmackDown (Bobby Roode, John Cena, Randy Orton, Shane McMahon, and Shinsuke Nakamura) in a 5-on-5 Survivor Series elimination match Survivor Series (2018) November 18, 2018 Los Angeles, California Staples Center Brock Lesnar vs. Daniel Bryan Survivor Series (2019) November 24, 2019 Rosemont, Illinois Allstate Arena Bayley vs. Becky Lynch vs. Shayna Baszler in a triple threat match Survivor Series (2020) November 22, 2020 Orlando, Florida WWE ThunderDome at Amway Center Drew McIntyre vs. Roman Reigns Survivor Series (2021) November 21, 2021 Brooklyn, New York Barclays Center Big E vs. Roman Reigns Survivor Series: WarGames (2022) November 26, 2022 Boston, Massachusetts TD Garden The Bloodline (Roman Reigns, Jey Uso, Jimmy Uso, Solo Sikoa, and Sami Zayn) vs. The Brawling Brutes (Sheamus, Ridge Holland, and Butch), Drew McIntyre, and Kevin Owens in a WarGames match Survivor Series: WarGames (2023) November 25, 2023 Rosemont, Illinois Allstate Arena Cody Rhodes, Seth \"Freakin\" Rollins, Jey Uso, Sami Zayn, and Randy Orton vs. The Judgment Day (Damian Priest, Finn Bálor, \"Dirty\" Dominik Mysterio, and JD McDonagh) and Drew McIntyre in a WarGames match Survivor Series: WarGames (2024) November 30, 2024 Vancouver, British Columbia, Canada Rogers Arena Roman Reigns, The Usos (Jey and Jimmy Uso), Sami Zayn, and CM Punk vs. The Bloodline (Solo Sikoa, Jacob Fatu, Tama Tonga, and Tonga Loa) and Bronson Reed in a WarGames match == References == Category:World Wrestling Entertainment pay-per-view events",
 "title": "Survivor Series"
}