{
 "id": "167867",
 "text": "A spiral is a special curve in mathematics. This curve starts at a point, and then goes around the point, but gets farther and farther away from it. This is different from a circle (which is always at the same distance) or an ellipse. A spiral is an \"open\" curve, unlike circles and ellipses which are closed curves. ==Two-dimensional spirals== A two-dimensional spiral may be described most easily using polar coordinates. There the radius r is a continuous monotonic function of angle θ (theta). The circle would be regarded as a degenerate case. With the circle, the function would not be strictly monotonic, but constant. Some of the more important sorts of two-dimensional spirals include: * The Archimedean spiral: r = a + bθ * The Euler spiral, Cornu spiral or clothoid * Fermat's spiral: r = θ1/2 * The hyperbolic spiral: r = a/θ * The lituus: r = θ-1/2 * The logarithmic spiral: r = abθ; approximations of this are found in nature * The Fibonacci spiral and golden spiral: special cases of the logarithmic spiral * The Spiral of Theodorus: an approximation of the Archimedean spiral composed of contiguous right triangles Image:Archimedean spiral.svg|Archimedean spiral Image:Cornu Spiral.svg|Cornu spiral Image:Fermat's spiral.svg|Fermat's spiral Image:Hyperspiral.svg|hyperbolic spiral Image:Lituus.svg|lituus Image:Logarithmic spiral.svg|logarithmic spiral Image:Spiral of Theodorus.svg|spiral of Theodorus ==Three-dimensional spirals== For simple 3-d spirals, a third variable, h (height), is also a continuous, monotonic function of θ. For example, a conic helix may be defined as a spiral on a conic surface, with the distance to the apex an exponential function of θ. The helix and vortex can be viewed as a kind of three-dimensional spiral. For a helix with thickness, see spring (math). ==In nature== The study of spirals in nature have a long history, Christopher Wren found out that many shells form a logarithmic spiral. Jan Swammerdam observed the common mathematical characteristics of a wide range of shells from Helix to Spirula and Henry Nottidge Moseley described the mathematics of univalve shells. D’Arcy Wentworth Thompson's On Growth and Form gives extensive treatment to these spirals. He describes how shells are formed by rotating a closed curve around a fixed axis, the shape of the curve remains fixed but its size grows in a geometric progression. In some shell such as Nautilus and ammonites the generating curve revolves in a plane perpendicular to the axis and the shell will form a planer discoid shape. In others it follows a skew path forming a helico-spiral pattern. Thompson also studied spirals occurring in horns, teeth, claws and plants. 2nd ed 1942. Spirals in plants and animals are frequently described as whorls. A model for the pattern of florets in the head of a sunflower was proposed by H Vogel. This has the form :\\theta = n \\times 137.5^{\\circ},\\ r = c \\sqrt{n} where n is the index number of the floret and c is a constant scaling factor, and is a form of Fermat's spiral. The angle 137.5° is related to the golden ratio and gives a close packing of florets. The spiral also represents infinity. Starting at a single point, and revolving outwardly until the end of the universe. Because of this, some civilizations believe that the Spiral is a pathway to the afterlife. ==As a symbol== The spiral plays an important role in symbolism. It appears in megalithic art, notably in the Newgrange tomb or in many Galician petroglyphs such as the one in Mogor. See also triple spiral. Scholars are still talking about the subject, but many of them now believe that the simple spiral in Chinese art may be a symbol of the sun. Roof tiles from the Tang Dynasty with this symbol have been found west of the ancient city of Chang'an (modern-day Xian). The spiral is the most ancient symbol found on every civilized continent. Because it appears at burial sites across the globe, the spiral most likely represented the \"life-death-rebirth\" cycle. Similarly, the spiral symbolized the sun, as ancient people thought the sun was born each morning, died each night, and was reborn the next morning. Spirals are also a symbol of hypnosis. This most likely comes from the cliché of people and cartoon characters being hypnotized by staring into a spinning spiral (One example being Kaa in Disney's The Jungle Book). They are also used as a symbol of dizziness, where the eyes of a cartoon character, especially in anime and manga, will turn into spirals to show they are dizzy or dazed. The spiral symbolizes the double helix structure of DNA, representing biological evolution, and the spiral structure of a galaxy. ==References== Category:Mathematics",
 "title": "Spiral"
}