{
 "id": "167876",
 "text": "Royal Rumble (2007) was the twentieth yearly Royal Rumble professional wrestling pay-per-view event made by World Wrestling Entertainment (WWE). It took place on January 28, 2007 at the AT&T; Center in San Antonio, Texas. ==Results== # Results Stipulations Times Dark match JTG (with Shad Gaspard) defeated Lance Cade (with Trevor Murdoch) Singles match 08:42 1 The Hardys (Matt and Jeff) defeated MNM (Joey Mercury and Johnny Nitro) (with Melina) Tag team match 15:27 2 Bobby Lashley (c) defeated Test by countout Singles match for the ECW World Championship 07:18 3 Batista (c) defeated Mr. Kennedy Singles match for the World Heavyweight Championship 10:29 4 John Cena (c) defeated Umaga (with Armando Alejandro Estrada) Last Man Standing match for the WWE Championship 23:09 5 The Undertaker last eliminated Shawn Michaels 2007 Royal Rumble match 56:18 ===Royal Rumble entrances and eliminations=== Order entered Name Brand Order eliminated Eliminated by Time in Match Ric Flair Raw Edge 05:40 Finlay SD! 12 Shawn Michaels 32:32 Kenny Dykstra Raw Edge 04:05 Matt Hardy SD! Randy Orton 18:55 Edge Raw 28 Shawn Michaels 44:02 Tommy Dreamer ECW Kane 06:41 Sabu ECW Kane 05:27 Gregory Helms SD! King Booker 06:50 Shelton Benjamin Raw 14 Shawn Michaels 22:22 10 Kane SD! 11 King Booker 13:21 11 CM Punk ECW 22 The Great Khali 27:16 12 King Booker SD! 10 Rob Van Dam & Kane 09:23 13 Super Crazy Raw Edge and Randy Orton 04:32 14 Jeff Hardy Raw Edge 03:38 15 ECW King Booker 00:13 16 Randy Orton Raw 27 Shawn Michaels 27:14 17 Chris Benoit SD! 19 The Great Khali 17:52 18 Rob Van Dam ECW 21 The Great Khali 16:30 19 Viscera Raw 13 Rob Van Dam, Edge, CM Punk, Chris Benoit, Johnny Nitro, Shelton Benjamin, Hardcore Holly & Kevin Thorn 06:22 20 Johnny Nitro Raw 15 Chris Benoit 06:18 21 Kevin Thorn ECW 16 Chris Benoit 06:15 22 Hardcore Holly ECW 18 The Great Khali 10:21 23 Shawn Michaels Raw 29 Undertaker 24:11 24 Chris Masters Raw 17 Rob Van Dam 03:32 25 Chavo Guerrero SD! 24 The Great Khali 06:24 26 Montel Vontavious Porter SD! 26 Undertaker 07:31 27 Carlito Raw 23 The Great Khali 03:19 28 Raw 25 Undertaker 03:45 29 SD! 20 The Great Khali 00:07 30 SD! Winner 13:15 # King Booker returned to the ring after being eliminated and eliminated Kane. # Kane made his eleventh appearance in a Royal Rumble match, breaking his own and Rikishi's record for most Royal Rumble appearances. It was also his ninth- consecutive appearance, also billed as a record for Kane. # This Royal Rumble set a new record for the most wrestlers involved in an elimination, taking 8 men to throw Viscera over the top rope. This beat the previous record set in the 1994 Royal Rumble when it took 7 men to eliminate Viscera (then known as Mabel). # The Undertaker was the first wrestler to win the Royal Rumble match at number 30. ==References== Category:Royal Rumble Category:Sports in San Antonio, Texas Category:2007 in professional wrestling Category:2007 in Texas Category:21st century in San Antonio, Texas pl:Royal Rumble (2007)",
 "title": "Royal Rumble (2007)"
}