{
 "id": "167853",
 "text": "WWE Extreme Rules was a yearly professional wrestling pay-per-view and livestreaming show made by WWE from 2009 to 2022. The matches during Extreme Rules events usually centered around hardcore wrestling, called \"Extreme Rules matches\" by the company since the start of their ECW brand. The event was originally known as One Night Stand from 2005 to 2008. The 2005 and 2006 editions were reunion events for the original Extreme Championship Wrestling (ECW) promotion. The 2007 and 2008 editions already had \"Extreme Rules\" as a subtitle. In 2009, Extreme Rules was established as its own pay-per-view, replacing One Night Stand. The 2017 event was the only Extreme Rules event to feature only one brand, being exclusive to Raw. The 2020 edition was called The Horror Show at Extreme Rules. The last Extreme Rules event happened in 2022, as its October slot was given to Fastlane the following year. This came after WWE's Chief Content Officer Triple H said he no longer wanted to have some of the gimmick events. == Events == Raw-branded event # Event Date City Venue Main Event 1 Extreme Rules (2009) June 7, 2009 New Orleans, Louisiana New Orleans Arena Edge (c) vs. Jeff Hardy in a Ladder match for the World Heavyweight Championship Jeff Hardy (c) vs. CM Punk for the World Heavyweight Championship in Punk's Money in the Bank cash-in match 2 Extreme Rules (2010) April 25, 2010 Baltimore, Maryland 1st Mariner Arena John Cena (c) vs. Batista in a Last Man Standing match for the WWE Championship 3 Extreme Rules (2011) May 1, 2011 Tampa, Florida St. Pete Times Forum The Miz (c) vs. John Cena vs. John Morrison in a Triple Threat Steel Cage match for the WWE Championship 4 Extreme Rules (2012) April 29, 2012 Rosemont, Illinois Allstate Arena Brock Lesnar vs. John Cena in an Extreme Rules match 5 Extreme Rules (2013) May 19, 2013 St. Louis, Missouri Scottrade Center Brock Lesnar vs. Triple H in a Steel Cage match 6 Extreme Rules (2014) May 4, 2014 East Rutherford, New Jersey Izod Center Daniel Bryan (c) vs. Kane in an Extreme Rules match for the WWE World Heavyweight Championship 7 Extreme Rules (2015) April 26, 2015 Rosemont, Illinois Allstate Arena Seth Rollins (c) vs. Randy Orton in a Steel Cage match for the WWE World Heavyweight Championship 8 Extreme Rules (2016) May 22, 2016 Newark, New Jersey Prudential Center Roman Reigns (c) vs. AJ Styles in an Extreme Rules match for the WWE World Heavyweight Championship 9 Extreme Rules (2017) June 4, 2017 Baltimore, Maryland Royal Farms Arena Bray Wyatt vs. Finn Bálor vs. Roman Reigns vs. Samoa Joe vs. Seth Rollins in a Fatal Five-way Extreme Rules match for a WWE Universal Championship match at Great Balls of Fire 10 Extreme Rules (2018) July 15, 2018 Pittsburgh, Pennsylvania PPG Paints Arena Dolph Ziggler (c) vs. Seth Rollins in a 30-minute Iron Man match for the WWE Intercontinental Championship 11 Extreme Rules (2019) July 14, 2019 Philadelphia, Pennsylvania Wells Fargo Center Seth Rollins (c) and Becky Lynch (c) vs. Baron Corbin and Lacey Evans in a Last Chance Winners Take All Extreme Rules mixed tag team match for the WWE Universal Championship and WWE Raw Women's Championship Seth Rollins (c) vs. Brock Lesnar for the WWE Universal Championship in Lesnar's Money in the Bank cash-in match 12 The Horror Show at Extreme Rules July 19, 2020 Orlando, Florida WWE Performance Center1 Braun Strowman vs. Bray Wyatt in a Wyatt Swamp Fight 13 Extreme Rules (2021) September 26, 2021 Columbus, Ohio Nationwide Arena Roman Reigns (c) vs. \"The Demon\" Finn Bálor in an Extreme Rules match for the WWE Universal Championship 14 Extreme Rules (2022) October 8, 2022 Philadelphia, Pennsylvania Wells Fargo Center Matt Riddle vs. Seth \"Freakin\" Rollins in a Fight Pit match with Daniel Cormier as the special guest referee. 1 The Wyatt Swamp Fight, was filmed at an unknown location about two hours outside of Orlando on July 16–17. == References == == Other websites == * Official website of Extreme Rules Category:WWE Extreme Rules Category:World Wrestling Entertainment pay-per-view events",
 "title": "WWE Extreme Rules"
}