{
 "id": "167866",
 "text": "Nicholas Theodore \"Nic\" Nemeth (born July 27, 1980) is an American professional wrestler. He is currently signed to Total Nonstop Action Wrestling (TNA) and is the current TNA World Champion in his first reign. He also makes appearances for the New Japan Pro-Wrestling (NJPW) promotion. Nemeth is best known for his time in WWE where he performed from 2004 until 2023. Nemeth signed a contract with the WWE in 2004 and competed in their developmental territory, Ohio Valley Wrestling (OVW). He debuted on the main roster in 2005 and played the role of Kerwin White's caddy. He was sent back down to OVW and later called back up where he was a member of The Spirit Squad, performing under the ring name Nicky. After being sent back to OVW and then competing in FCW, he returned to the main roster and got the ring name Dolph Ziggler, which he then used for the next 15 years. In WWE, Nemeth is a two-time World Heavyweight Champion, one-time NXT Champion, four-time Tag Team Champion, six-time Intercontinental Champion, and a two-time United States Champion. He also became Mr. Money in the Bank in 2012, and the 22nd Triple Crown Champion. He joined New Japan Pro-Wrestling in 2024 as Nic Nemeth, and in his first match with the promotion won the IWGP Global Heavyweight Championship. On January 13, 2024 at Hard To Kill, Nemeth made his debut for Total Nonstop Action Wrestling (TNA). At Slammiversary on July 20, he won the TNA World Championship, his first world championship outside WWE. ==Championships== * Florida Championship Wrestling ** FCW Florida Tag Team Championship (2 times) – with Brad Allen (1) and Gavin Spears (1) *Lucha Libre AAA Worldwide **AAA Mega Championship (1 time) *New Japan Pro-Wrestling ** IWGP Global Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 9 of the top 500 singles wrestlers in the PWI 500 in 2013 * Rolling Stone ** Wrestler of the Year (2014) ** Worst Storyline (2015) – with Rusev, Summer Rae and Lana * Squared Circle Expo ** SCX Championship (1 time, current)cite web|url=https://www.cagematch.net/?id=5&nr;=5960 * Total Nonstop Action Wrestling ** TNA World Championship (1 time * WrestleCrap ** Gooker Award (2015) – feud with Rusev, Summer Rae and Lana * Wrestling Observer Newsletter ** Most Improved (2011) ** Most Underrated (2011) * World Wrestling Entertainment/WWE ** World Heavyweight Championship (2 times) ** NXT Championship (1 time) ** WWE Intercontinental Championship (6 times) ** WWE United States Championship (2 times) ** WWE Raw Tag Team Championship (2 times) – with Drew McIntyre (1) and Robert Roode (1) ** WWE SmackDown Tag Team Championship (1 time) – with Robert Roode ** World Tag Team Championship (1 time) – with Johnny, Kenny, Mikey, and Mitch ** Money in the Bank (2012 – World Heavyweight Championship contract) ** 22nd Triple Crown Champion ** Slammy Award (2 times) *** Best Twitter Handle or Social Champion (2014) – @HEELZiggler *** Match of the Year (2014) – ===Lucha de Apuesta record=== Wager Winner Loser Location Date Notes Money in the Bank contract Dolph Ziggler Alberto Del Rio Fresno, California Jericho wagered his WWE contract in the match == Footnotes == == References == ==Other websites== *Official website * Category:1980 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Cleveland Category:Total Nonstop Action Wrestling people",
 "title": "Dolph Ziggler"
}