{
 "id": "168078",
 "text": "Vickie Lynn Benson (formerly Guerrero, née Lara;Guerrero, Eddie. Cheating Death, Stealing Life: The Eddie Guerrero Story, p. 53. born April 16, 1968) is an American former professional wrestling authority figure and manager. She is best known for her time with WWE and All Elite Wrestling (AEW). She is the widow of professional wrestler and WWE Hall of Famer Eddie Guerrero. During her time in WWE, she was known for yelling the catchphrase \"Excuse Me!\" which received negative reactions from the fans. She was also an occasional wrestler. On the June 23, 2014 episode of Raw, Guerrero was fired after she lost a pudding match against Stephanie McMahon with her job on the line. McMahon won with help from Alicia Fox, Layla, and Rosa Mendes. Guerrerogott revenge on McMahon by throwing her into mud pool. She then pointed to the sky, said \"this was for you\"; as a tribute to her late husband, Eddie, and did Eddie's taunt before leaving. On December 11, 2019, Guerrero appeared as a guest commentator for the taping of AEW Dark, which aired on December 17 on YouTube. On July 15, 2020, at Fight for the Fallen, Guerrero was revealed as Nyla Rose's manager. On the special Friday June 4, 2021, edition of Dynamite, she introduced Andrade El Idolo to AEW. On April 6, 2023, Guerrero's roster page was removed from AEW's website. == Awards and accomplishments == * The Baltimore Sun ** Non-Wrestler of the Year (2008) * World Wrestling Entertainment / WWE ** Miss WrestleMania (1 time) ** Slammy Award for Couple of the Year (2008) – with Edge * Wrestling Observer Newsletter ** Best Non- Wrestler (2009, 2010) ==References== ==Other websites== *Official website * Category:1968 births Category:Living people Category:All Elite Wrestling alumni Category:Female professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Professional wrestling managers and valets Category:Professional wrestling referees Category:Sportspeople from El Paso, Texas Category:Twitch (service) streamers",
 "title": "Vickie Guerrero"
}