{
 "id": "168002",
 "text": "Night of Champions (2009) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on July 26, 2009 at the Wachovia Center in Philadelphia, Pennsylvania. It was the third Night of Champions event held by WWE. Similar to the previous two events, the concept of the show was that every championship in the company would be defended. It featured talent from the Raw, SmackDown, and ECW brands. Eight matches were performeded on the card. == Background == Night of Champions featured professional wrestling matches with different wrestlers from the Raw, SmackDown, and ECW brands. Wrestlers played the role of a villain or a hero. All wrestlers were part of WWE's Raw, SmackDown, and ECW brands—a storyline division in which WWE employees are assigned to a television program of the same name. The main rivalry from SmackDown for Night of Champions was between CM Punk and Jeff Hardy in their battle over the World Heavyweight Championship. One month before the show, at Extreme Rules, Punk used his guaranteed title match he earned by winning the Money in the Bank ladder match against Hardy; he beat him, and won the World Heavyweight title. The two had many confrontations about it which lead to The Bash and a match that saw Punk get disqualified for kicking the referee. Then, Hardy attacked Punk because Hardy thought Punk kicked the referee on purpose. On the July 2 episode of Superstars fans were told that Punk had suffered a storyline eye injury. Punk's reasoning to Hardy's accusation was that he kicked the referee on accident due to his inability to clearly see Jeff, who he was really trying to kick. To settle the dispute on to who the rightful champion was, SmackDown general manager, Theodore Long, announced another match between the two at Night of Champions, which was accepted by both competitors. Raw was represented by Randy Orton defending the WWE Championship. After beating Triple H at The Bash, Orton did not have a contender for the championship, so on the June 29 episode of Raw, special guest host of the week, as well as onscreen matchmaker, Batista, said that the title would be defended at Night of Champions against the winner of a single-elimination tournament. The first two matches of the four-person tournament were that night with Triple H beating Montel Vontavious Porter (MVP) and John Cena beating The Miz. Triple H and Cena wrestled each other the next week on Raw, but Orton's allies, Cody Rhodes and Ted DiBiase, interfered in the match, attacking both Cena and Triple H. Because of that, it was announced Orton would defend the title against both Triple H and Cena in a triple threat match. == Results == No. Matches Stipulations Times 1 Cryme Tyme (Shad Gaspard and JTG) defeated The Hart Dynasty (Tyson Kidd and David Hart Smith) Tag team match 5:13 2 Jeri-Show (Chris Jericho and Big Show) (c) defeated The Legacy (Cody Rhodes and Ted DiBiase) Tag team match for the Unified WWE Tag Team Championship 9:32 3 Christian defeated Tommy Dreamer (c) Singles match for the ECW Championship 8:28 4 Kofi Kingston (c) defeated Montel Vontavious Porter, The Miz, Carlito, Jack Swagger and Primo Six-Pack Challenge for the WWE United States Championship 8:35 5 Michelle McCool (c) defeated Melina Singles match for the WWE Women's Championship 6:12 6 Randy Orton (c) defeated Triple H and John Cena Triple Threat match for the WWE Championship 22:19 7 Mickie James defeated Maryse (c) Singles match for the WWE Divas Championship 8:36 8 Rey Mysterio (c) defeated Dolph Ziggler (with Maria) Singles match for the WWE Intercontinental Championship 14:20 9 Jeff Hardy defeated CM Punk (c) Singles match for the World Heavyweight Championship 14:56 ==Related pages== * WWE Night of Champions * List of WWE pay-per-view events == References == Category:WWE Night of Champions Category:Sports in Philadelphia Category:2009 in Pennsylvania Category:2000s in Philadelphia Category:July 2009 events es:WWE Night of Champions#2009",
 "title": "Night of Champions (2009)"
}