{
 "id": "168243",
 "text": "The Northrop Grumman B-2 Spirit, also called the Stealth Bomber, is an American strategic bomber. It has a lot of stealth technology, and it is designed to get through many anti-aircraft defenses. It can drop both conventional and nuclear weapons. Two people fly the bomber, and it can drop up to 80 -class JDAM GPS-guided bombs, or sixteen B83 nuclear bombs. The bomber began being designed as the \"Advanced Technology Bomber\" (ATB) during the Carter administration. The designing of the ATB continued during the Reagan administration. The bomber was designed and is made by Northrop Grumman, with help from Boeing. Each aircraft cost US$737 million (in 1997 dollars).\"B-2 Bomber: Cost and Operational Issues Letter Report, 14 August 1997, GAO/NSIAD-97-181.\" United States General Accounting Office (GAO). Retrieved: 13 September 2009. Because the bomber is very expensive, the project was controversial in the U.S. Congress. The end of the Cold War meant that the bomber was not really needed anymore. Congress wanted to buy 132 bombers, but during the late 1980s and 1990s, Congress reduced this to 21. In 2008, a B-2 was destroyed in a crash shortly after takeoff. The crew got out safely.Rolfsen, Bruce. \"Moisture confused sensors in B-2 crash.\" Air Force Times, 9 June 2008. Retrieved: 13 September 2009. 20 B-2s are being used by the United States Air Force. Although the B-2 was supposed to be a mainly bomber, it was first used in combat to drop normal bombs on Serbia during the Kosovo War in 1999. It was used during the Iraq War and it was used in the war in Afghanistan.\"B-2 Spirit Fact Sheet.\" U.S. Air Force, April 2008. Retrieved: 6 July 2008. In 2023, it landed for the first time on the European mainland; The plane is expected to leave Norway after training with air forces in Europe.https://www.nrk.no/trondelag/lander-northrop-b-2-spirit-i- norge-1.16533803. NRK.no. Retrieved 2023-08-30 In 2025 B-2's were deployed to an airbase in the Indian Ocean in response to military tensions in the area. == References == == Other websites == * B-2 Spirit fact sheet and gallery on U.S. Air Force site * B-2 Spirit page on Northrop Grumman site * B-2 Spirit Stealth bomber on airforce-technology.com * B-2 Stealth Bomber article on How It Works Daily * B-2 Spirit page at GlobalSecurity.org Category:United States Air Force aircraft",
 "title": "Northrop Grumman B-2 Spirit"
}