{
 "id": "168289",
 "text": "University College London (UCL) is a large university in London. It is the largest college of the federal University of London. As well as undergraduate teaching, it is one of the largest research universities in the country.The Carnegie Classification of Institutions of Higher Education describes it as a \"research university\". UCL was founded in 1826 as 'University College'. It was the first university institution to be founded in London and the first in England to be established on an entirely secular (non-religious) basis.At the time, both Oxford and Cambridge universities required all students and dons to be members of the Church of England. It admits students regardless of their religious beliefs. UCL was also the first admit women on equal terms with men. University College became one of the two founding colleges of the University of London in 1836. UCL has over 100 departments, institutes and research centres in eight faculties. Its main campus is in the Bloomsbury area of central London. There are also a number of institutes and teaching hospitals elsewhere in central London. It has grown through mergers. These include the Institute of Neurology (in 1997), the Royal Free Hospital Medical School (in 1998), the Eastman Dental Institute (in 1999), the School of Slavonic and East European Studies (in 1999), the School of Pharmacy (in 2012) and the Institute of Education (in 2014). == History == The original University College was based largely on ideas of Jeremy Bentham (1748–1832), a lawyer, social philosopher and free-thinker. Bentham believed in libertarianism, utilitarianism, women's suffrage, and the separation of church and state. These are beliefs of liberalism. The college was unique in that it was secular, and was called \"that Godless institution in Gower Street\".Quotation was by Thomas Arnold, the Head of Rugby School and a religious zealot. University College was founded on 11 February 1826, under the name London University, as a secular alternative to the strictly Anglican universities of Oxford and Cambridge. It was founded from the beginning as a university, not a college or institute. However, its founders got such strong opposition from the Church of England that it prevented them from getting the Royal Charter needed for the award of degrees. King's College London was specifically founded to provide an Anglican rival to UCL. It was not until 1836, when the latter-day University of London was established, that University College was legally recognised and granted the power to award degrees of the University of London. == Research == UCL has over 7,000 academic and research staff and 840 professors, the highest number of any British university. There are currently 56 Fellows of the Royal Society, 51 Fellows of the British Academy, 15 Fellows of the Royal Academy of Engineering and 121 Fellows of the Academy of Medical Sciences amongst UCL academic and research staff. UCL is a major centre for biomedical research; it is part of three of the 12 biomedical research centres established by the NHS in England and is a founding member of UCL Partners, the largest academic health science centre in Europe. For the period 1999 to 2009 it was the 13th most-cited university in the world (and the most-cited in Europe). There has been at least one Nobel Prize winner from UCL every decade since the establishment of the Nobel Prizes in 1901. There are 29 Nobel Prize winners and three Fields Medalists amongst UCL’s alumni and current and former staff, the most recent being Sir Charles Kao, who received the Nobel Prize for Physics in 2009. According to a ranking of universities produced by SCImago Research Group, UCL is ranked 12th in the world (and 1st in Europe) in terms of total research output. According to data released in July 2008 by ISI Web of Knowledge, UCL is the 13th most-cited university in the world (and most- cited in Europe). The analysis covered citations from 1 January 1998 to 30 April 2008, during which 46,166 UCL research papers attracted 803,566 citations. The report covered citations in 21 subject areas and the results revealed some of UCL's key strengths, including: Clinical Medicine (1st outside North America); Immunology (2nd in Europe); Neuroscience & Behaviour (1st outside North America and 2nd in the world); Pharmacology & Toxicology (1st outside North America and 4th in the world); Psychiatry & Psychology (2nd outside North America); and Social Sciences, General (1st outside North America). UCL is a member of the G5, the League of European Research Universities, the Russell Group, and other national and international groups. It forms part of the 'Golden Triangle' of British universities. *UCL had a total income of £762 million in 2009/10, of which £275 million was from research grants and contracts. *The UCL School of Energy and Resources is based in Adelaide, Australia. *UCL includes world-renowned centres for architecture (UCL Bartlett) and fine art (UCL Slade School) == References == Category:1826 establishments in Europe Category:University of London Category:Buildings and structures in the London Borough of Camden Category:1820s establishments in England",
 "title": "University College London"
}