{
 "id": "168338",
 "text": "The following is a listing of well-known bastides; it is not complete. * Ariège : Campagne-sur-Arize, La Bastide-de-Besplas, La Bastide-de-Bousignac, La Bastide-de-Lordat, La Bastide-du-Salat, La Bastide-de-Sérou, La Bastide- sur-l'Hers, Mazères, Mirepoix, Montjoie-en-Couserans, Rimont, Roquefixade, Tarascon-sur-Ariège, Villeneuve-d'Olmes, Villeneuve-du-Bosc, Villeneuve-du- Paréage. * Aude : Arques, Belpech, Carcassonne, Castelnaudary, Chalabre, Labastide-d'Anjou, Labastide-de-Coulomat, Labastide-d'en-Richard, Labastide- en-Val, Labastide-Esparbairenque, Lignairolles, Molandier, Ribouisse, Saint- Denis, Saint-Louis, Salles-sur-l'Hers. * Aveyron : La Bastide-l'Évêque, Najac, Réquista, Sauveterre-de-Rouergue, Villecomtal, Villefranche-de-Panat, Villefranche-de-Rouergue, Villeneuve-d'Aveyron. * Cantal : Aurillac, Maurs, Montsalvy (Sauvetés). * Charente-Maritime : Talmont-sur-Gironde. * Dordogne : Beaumont-du-Périgord, Beauregard-et-Bassac, Bénévent, Domme, Eymet, Fonroque, Lalinde, Molières, Monestier, Monpazier, Puyguilhem, Roquepine, Saint-Aulaye, Saint-Barthélemy-de-Bellegarde, Saint-Louis-en-l'Isle, Tocane, Vergt, Villefranche-de-Lonchat, Villefranche-du-Périgord. * Haute-Garonne : Aignes, Alan, Beauchalot, Blajan, Bouloc, Boulogne-sur-Gesse, Boussens, Buzet-sur- Tarn, Calmont, Carbonne, Cazères, Gaillac-Toulza, Grenade, Labastide-Beauvoir, Labastide-Clermont, Lavelanet-de-Comminges, Le Fousseret, Le Plan, Léguevin, Lestelle-de-Saint-Martory, Mondilhan, Montastruc-la-Conseillère, Montesquieu- Volvestre, Montgeard, Montmaurin, Montréjeau, Nailloux, Nénigan, Palaminy, Plagne, Plaisance-du-Touch, Revel, Rieumes, Saint-Félix-Lauragais, Saint-Lys, Saint-Sulpice-sur-Lèze, Salles-sur-Garonne, Valentine, Villefranche-de- Lauragais, Villeneuve-de-Rivière, Villenouvelle. * Gers : Aujan, Aurimont, Barcelonne-du-Gers, Barran, Bassoues, Beaucaire, Beaumarchés, Cazaubon, Cologne, Fleurance, Fourcès, Gimont, Jegun, Labastide-Savès, Lannepax, Lias-d'Armagnac, Marciac, Marguestau, Masseube, Miélan, Miradoux, Mirande, Monfort, Monguilhem, Montréal-du-Gers, Mourède, Pavie, Plaisance, Réjaumont, Saint-Clar, Seissan, Solomiac, Valence-sur-Baïse, Villefranche-d'Astarac. * Gironde : Blasimon, Cadillac, Créon, Libourne, Monségur, Pellegrue, Sainte- Gemme, Sainte-Foy-la-Grande, Sauveterre-de-Guyenne. * Landes : Arouille, Betbezer-d'Armagnac, Bonnegarde, Buanes, Cazères-sur-l'Adour, Coudures, Duhort-Bachen, Geaune-en-Tursan, Grenade-sur-l'Adour, Hastingues, Hontanx, Labastide-Chalosse, Labastide-d'Armagnac, Mauvezin-d'Armagnac, Miramont- Sensacq, Montégut, Montfort-en-Chalosse, Pimbo, Port-de-Lanne, Rondebœuf, Roquefort, Saint-Gein, Saint-Justin, Saint-Sever, Sarron, Sorde-l'Abbaye, Souprosse, Toulouzette, Villenave, Villeneuve-de-Marsan. * Lot : Beauregard, Bretenoux, Castelfranc, Cazals, Labastide-du-Haut-Mont, Labastide-du-Vert, Labastide-Marnhac, Labastide-Murat, Montcabrier, Montfaucon, Puybrun, Rudelle. * Lot-et-Garonne : Aiguillon, Castelnaud-de-Gratecambe, Castelnau-sur-Gupie, Castillonnès, Caudecoste, Damazan, Durance, Francescas, Granges-sur-Lot, Hautesvignes, Labastide-Castel-Amouroux, Lagruère, Lamontjoie, Laparade, Lavardac, Lévignac-de-Guyenne, Miramont-de-Guyenne, Monclar-d'Agenais, Monflanquin, Montpezat, Montpouillan, Nicole, Puymirol, Sainte-Livrade-sur- Lot, Saint-Pastour, Saint-Pé-de-Boulogne, Saint-Sardos, Saint-Sauveur-de- Meilhan, Sérignac-sur-Garonne, Tournon-d'Agenais, Vianne, Villefranche-du- Queyran, Villeneuve-sur-Lot, Villeréal. * Pyrénées-Atlantiques : Ainhoa, Asson, Bellocq, Bougarber, Bruges, Cardesse, Etcharry, Gan, Garlin, Navarrenx, La Bastide-Clairence, Labastide-Monréjeau, Labastide-Villefranche, Lestelle- Bétharram, Montaut, Navarrenx, Nay, Rébénacq. * Hautes-Pyrénées : Castelbajac, Lannemezan, Lubret-Saint-Luc, Montgaillard, Peyrouse, Rabastens-de-Bigorre, Saint-Martin, Sère-Rustaing, Tournay, Trie-sur-Baïse, Vidalos. * Tarn : Arthès, Beauvais, Brens, Briatexte, Castelnau-de-Lévis, Castelnau-de- Montmiral, Cordes, Damiatte, Florentin, Labastide-de-Lévis, Labastide-Dénat ou Labastide-Dupuy, Labastide-Rouairoux, Labastide-Saint-Georges, Labessière- Candeil, Lisle-sur-Tarn, Pampelonne, Réalmont, Saint-Gauzens, Saint-Sulpice- la-Pointe, Saint-Urcisse, Técou, Valence-d'Albigeois, Villefranche-d'Albigeois, Villeneuve-sur-Vère, Viterbe, Viviers-les-Montagnes. * Tarn-et-Garonne : Albias, Angeville, Beaumont-de-Lomagne, Castelsagrat, Caumont, Cordes-Tolosannes, Donzac, Dunes, Labastide-Saint-Pierre, Labastide- du-Temple, Lafrançaise, Larrazet, Mirabel, Molières, Monclar-de-Quercy, Montalzat, Montech, Montjoi, Nègrepelisse, Réalville, Saint-Sardos, Septfonds, Valence-d'Agen, Verdun-sur-Garonne, Verfeil-sur-Seye, Verlhac-Tescou. * Haute- Vienne : Masléon Category:France-related lists *",
 "title": "List of Bastides"
}