{
 "id": "168383",
 "text": "Offa was the King of Mercia from 757 until his death in July 796. Many historians regard Offa as the most powerful Anglo-Saxon king before Alfred the Great. Offa died in 796 and was succeeded by his son, Ecgfrith, who reigned for less than five months before Coenwulf of Mercia became king. == King of Mercia == Offa was the son of Thingfrith, a descendant of Eowa of Mercia.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 257 Eowa was a king of Mercia who ruled along with his more famous brother Penda of Mercia. In 757 the king of Mercia,Athelbald, was murdered. There was a short civil war between others claiming the throne.Peter Hunter Blair, Roman Britain and Early England 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 216 An ealdorman named Beornred took the throne of Mercia but Offa drove him out of Mercia and became king himself that same year. The alliances Athelbald had formed fell apart when Offa came to power. Offa had very little power outside of Mercia for the first several years of his reign.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 206 == Bretwalda (overlord) == The Anglo-Saxon Chronicle makes no mention of Offa for the years between 757—777. No Mercian chronicles from this time period have survived. Charters are the only records that give any idea of Offa's power outside of Mercia. But he proved to be ruthless, bold and creative in bringing Kent, Sussex and Essex under his control.John Cannon; Ralph Griffiths, The Oxford Illustrated History of the British Monarchy (Oxford; New York: Oxford University Press, 1998), p. 26 Aethelbert the king of Kent was apparently under Offa's influence before he died in 762. In 794 another Aethelbert, a king in East Anglia was beheaded at Offa's command.Peter Hunter Blair, Roman Britain and Early England 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 218 When Egbert of Wessex made a bid for the throne of Wessex in 786 Offa had him banished from England. He made Beorhtric king of Wessex instead. Egbert was welcomed at the court of Charlemagne for at least three years.James Panton, Historical Dictionary of the British Monarchy (Lanham, MD: Scarecrow Press, 2011), p. 389 In charters Offa issued in Kent, East Anglia, Sussex and Middlesex he simply used the style Rex Merciorum (Latin for king of Mercia).F. M. Stenton, 'The Supremacy of the Mercian Kings', The English Historical Review, Vol. 33, No. 132 (Oct., 1918), p. 444 Only in three church charters does he expand his title to indicate he is overlord of all of England. Offa had diplomatic relations with Charlemagne. He was one of the few Anglo-Saxon monarchs to have dealings with continental rulers.Roger Collins, Early Medieval Europe; 300–1000, Second Edition (New York: St. Martin's Press, 1999), p. 192 Letters and presents were exchanged. But when Offa sought a marriage of his son to one of Charlemagne's daughters, relations were quickly cut off. Charlemagne had all Frankish ports closed to British ships. Offa, very involved in church affairs, presided over church councils personally in 786-7.John Cannon; Ralph Griffiths, The Oxford Illustrated History of the British Monarchy (Oxford; New York: Oxford University Press, 1998), p. 22 In 787 he convinced the pope to create the position of archbishop of Lichfield in Mercia.John Cannon; Ralph Griffiths, The Oxford Illustrated History of the British Monarchy (Oxford; New York: Oxford University Press, 1998), p. 23 He wanted his own archbishop who was closer at hand than the Archbishop of Canterbury. He reorganized the defenses of his kingdom. One of these defenses, Offa's Dyke was a massive earthworks between Mercia and the Welsh kingdoms to the west. Offa died in 796. His son, Ecgfrith, lasted only 141 days as king. Mercia was never again as powerful as it was during Offa's reign. == Notes== == References == Category:796 deaths Category:Kings and Queens of Mercia Category:730s births",
 "title": "Offa of Mercia"
}