{
 "id": "168454",
 "text": "Klemens Wenzel, Prince von Metternich (German: Klemens Wenzel Nepomuk Lothar, Fürst von Metternich-Winneburg zu Beilstein) (May 15, 1773 – June 11, 1859) was an Austrian politician. He is thought of as one of the most important diplomats of all time. Metternich was Foreign Minister for Austria from 1809 to 1848. He got Austria out of a bad treaty with Napoleon, which forced Austria to fight for France. Metternich then helped to build a system in Europe that kept the peace for most of the next 100 years. In 1809, when Metternich became foreign minister, Napoleon had control of most of Europe. France had taken over some of the closest countries directly. In more distant countries like Austria and Prussia, Napoleon forced them to sign treaties that would make them fight on his side in wars. Metternich thought that was bad for Austria. When Napoleon declared war and raised a huge army for the French invasion of Russia, Metternich told the Russians that Austria would not attack but only defend. Napoleon lost badly in Russia, and Metternich used that excuse to get out of the treaty. In 1814, troops of the Quadruple Alliance (Prussia, Russia, Austria and the United Kingdom) had entered France, and Napoleon had lost the war. For the next year, diplomats from all over Europe met at the Congress of Vienna to decide the future after Napoleon. Metternich believed that the best way to keep Europe peaceful was to create a balance of power, with no country being strong enough to beat all the other countries. To make sure that happened, he made some countries stronger so that other countries, especially France, would think twice about going to war. For example, he added Belgium and Luxembourg to the Netherlands, he turned 300 small countries of Germany into a group of larger countries, and he put together some countries in what we call Italy today. After making that new order, Metternich also did a lot to keep it together. For example, he Alexander I of Russia Alexander wanted to send troops to Greece to protect Orthodox Christians there fighting the Greek War of Independence against the Ottoman Empire, which was Muslim. The Ottomans had become weak, and Alexander would probably have won. Metternich was afraid that if the Ottoman Empire fell apart, all of the powerful countries in Europe would start fighting to get its land. That would upset Metternich's balance and start a huge war. Also, Russia might get too big and too powerful. Therefore, Metternich convinced the Alexander attacking now would make the Ottomans would fall apart before Alexander was ready to take it for himself, and the United Kingdom and France would get most of it. Alexander agreed to help keep the Ottoman Empire going so that Russia could later take all of it. Also, he was talked out of sending troops to Greece. Metternich kept peace in Europe for a long time, but there were still some revolts in Europe. Finally in 1848, many revolts happened at the same time. One of them was in Austria, and the rebels had Metternich taken out of office. After he was gone, Otto von Bismarck in Prussia managed to become powerful, take over the German Confederation and start a big German country, which still exists. Having one big Germany, however, upset Metternich's balance and helped to cause World War I. == Other websites == Category:1773 births Category:1859 deaths Category:Ambassadors of Austria Category:Government ministers of Austria Category:People from Koblenz Category:Politicians from Rhineland-Palatinate",
 "title": "Klemens Wenzel von Metternich"
}