{
 "id": "168462",
 "text": "WrestleMania XXIV was the twenty-sixth yearly WrestleMania professional wrestling pay-per-view event made by World Wrestling Entertainment (WWE). It took place on March 28, 2010 at the University of Phoenix Stadium in Glendale, Arizona. Eleven matches took place on the card. The main event saw The Undertaker defeat Shawn Michaels in a No Disqualification Streak vs. Career match. Therefore, Michaels was forced to retire from wrestling and The Undertaker won his 18th match in his undefeated streak. In other matches, Chris Jericho defeated Edge to keep his World Heavyweight Championship, John Cena defeated Batista to win his seventh WWE Championship, Triple H defeated Sheamus, and Jack Swagger won the sixth yearly Money in the Bank ladder match. This was the last WrestleMania event to feature the latter match type, because the Money in the Bank pay-per-view event was established that July. ==Production== Global Spectrum, University of Phoenix Stadium's operator, had worked in past years with World Wrestling Entertainment (WWE) to get the event to its venue. On January 18, 2008, Global Spectrum publicly announced that it wants to hold WrestleMania in 2010. The event became more widely known weeks prior when a photo of Wayne Gretzky wearing a shirt showing the event was seen in the Swedish newspaper Expressen. A press conference happened on February 24, 2009 at the University of Phoenix Stadium to officially tell people about the event for Glendale, Arizona at the University of Phoenix Stadium; this event is the first time WrestleMania would happen in the state of Arizona. Tickets for the event went on sale November 7, 2009 at 10:00am MST. Advertisements telling people about the date tickets would go on sale used the song \"Welcome to the World\" by Kevin Rudolf. Along with WrestleMania, a group of events known as \"WrestleMania Week\" was held in the week before the event. The third yearly WrestleManiArt, an art show and auction featuring work by WWE superstars, was held on March 24. WrestleMania's yearly fan convention, WrestleMania Axxess, was held from March 25 through to March 27. On March 27, WWE hosted its yearly WWE Hall of Fame ceremony at the Dodge Theater, where the class of 2010 was inducted. == Results == ==Related pages== * List of WWE pay-per-view events ==References== ==Other websites== * The Official Website of WrestleMania XXVI WrestleMania 26 Category:2010 in professional wrestling Category:Sports in Glendale, Arizona Category:2010s in Arizona Category:March 2010 events",
 "title": "WrestleMania XXVI"
}