{
 "id": "168772",
 "text": "A drill is a tool for making round holes. Cutting a hole with a drill is called \"drilling a hole\". A hole cut by a drill is a \"drilled hole\". A rotary drill (cutter)The word \"drill\" is commonly used to refer both to the larger tool and the cutter(s) it uses. This page will refer to the former as drills, and the latter as cutters or bits. is the most common type of cutter. It functions by pressing a rotating cutter into the stock.Stock refers to the piece of material (such as metal, plastic, or wood) to be cut. The cutter on a drill can have one or more teeth, and the teeth are arranged to cut efficiently when the cutter is rotated about its axis. Almost all drills have a mechanism to rotate the cutter. Some very simple drills have no moving parts. They must be rotated manually by gripping a handle. Most drills use drill bits. Drill bitsDrill bits can be referred to as \"bits\", for short are long, thin cutters with teeth at one end. The bits are held in the drill by a circular clamp called a chuck. Because a single chuck can accept many different sizes of bits, different sizes and types of bits can be used in the same drill. Changing the bit in a chuck is fast and easy. The smallest drill bits look like needles, while the largest drill bits can be as big as a truck. Most drill bits are between a toothpick and a big marker in size. The end of the bit that attaches to the chuck is called the shank. The shank provides a stable surface for the chuck to grip. The cross sectionThe cross section of the bit is the shape of the bit when viewed along its length. of the shank can be circular, triangular, or hexagonal. When drilling, it is possible for a circular shank to slip in the chuck. Triangular or hexagonal shanks cannot slip in the chuck, which is an advantage. Opposite the shank, the other end of the bit is called the point. The cutting teeth are on the point. When the bit is pushed into material and spun, the sharp teeth of the bit cut off many chips.Chips are pieces of the material that have been cut off by the cutter. A drill will cut a hole that is equal to the width of the cutter or bit. Because there is no extra space between the bodyThe body is the main portion of the bit. It spans from the point to the end of the flutes/beginning of the shank. of the bit and the sides of the hole, if the chips are not removed when drilling a deep hole the drill will jam.A bit jams when the resistance from the chips is too much for the drill to keep turning. Excessive chip interference also generates significant heat. For this reason, many drill bits are shaped like spirals. The hollow paths in the spiralThe hollow channels in the body of the bit are referred to as flutes. form a screw that carries the chips away from the cutting teeth and out of the hole. The cordless drill is a common type of drill. They are small enough to be held and used in one hand. They are powered by electricity from a battery. Electricity flows from the battery to an electric motor inside the drill. The electric motor drives\"Driving\" the gearbox in this case means the motor is rotating the input shaft of the gearbox with mechanical force. a gearbox. The gearbox drives the chuck, and the chuck is holding the bit. The mechanical advantage of the gearbox makes the chuck rotate at a slower speed than the electric motor, but the mechanical advantage also rotates the chuck with more torque.torque = rotational force More torque on chuck means more torque on the bit. More torque on the bit means there is more force pushing the cutting teeth through the material. More force pushing the cutting teeth allows cuts to be made faster and into harder materials. Without a gearbox, a hand-held electric drill would spin very fast, but it would only be able to drill through very soft materials. The battery is where cordless drills get their name, because they don't need to plug a cord into the wall to get electricity (they are without a cord, or cord-less). When the battery runs out of energy, it can be removed and recharged in a plug-in charger. A second fully charged battery can then be placed in the drill, and drilling can continue while the first battery is recharging. == Notes == == References == Category:Cutting tools Category:Woodworking tools",
 "title": "Drill"
}