{
 "id": "168918",
 "text": "Philosophy of mind is one part of philosophy that works with the mind. It is about thinking how the mind works, and how it relates to the world. It also deals with consciousness, which is also researched in psychology and physics. ==Mind-body problem== The mind-body problem is the main problem that is talked about in philosophy of mind. It is the problem of how our minds and our bodies are related, and what exactly the mind is. Many different answers have been come up with to solve the mind-body problem. Most of them fall into the two groups of dualism and monism. === Dualism as an answer to the mind-body problem === Dualism is the belief that minds and bodies are separate things. One of the main dualist views comes from René Descartes and is named Cartesian dualism, or substance dualism. Descartes thought that minds and bodies were two completely different substances (like matter) in the world. He argued that consciousness was different from the brain. One reason to believe dualism is that when you ask most people what the mind is, they would say it is their personality or their soul. They would almost certainly deny that the mind simply is the brain, or vice versa, finding the idea that there is just one ontological thing at play to be too machine-like. Mental events have a subjective quality, whereas physical events do not. So, for example, one can ask what a blue sky looks like, or what nice music sounds like to a person. But it is odd, to ask what an increase in chemicals in your brain feels like. These subjective aspects of mental events are called \"qualia\" by philosophers. But if it is true that the mind can exist without the brain, dualists must explain how a non-physical mind can affect physical reality. This remains a problem for dualism. === Monism as an answer to the mind-body problem === Monism is the opposite of dualism because it is the belief that minds and bodies are not separate things. Many monist views are called materialism because they think that minds are not anything different from matter just like bodies. In the early 20th century, a popular answer was behaviorism. Behaviorism says that a person's inner mental life is unpredictable. Only behaviors we can see are useful for scientists and philosophers. This view became unpopular in the second half of the century, during the \"cognitive revolution\", which saw psychology, linguistics, computer science, anthropology, neuroscience, and philosophy combine together to find ways to study the mind scientifically. After behaviorism failed, materialist philosophers invented type physicalism. These philosophers thought that, if mental states are something material, but not behavioral, then mental states are probably identical to a brain states. In very simplified terms: For example, the mental state \"desire for a cup of coffee\" is actually just the \"firing of certain neurons in certain brain regions\". However, other philosophers saw that type physicalism could not explain an idea called multiple realizability. Multiple realizability means that a mental state can be created by different brain states. For example, a dog has a different brain and nervous system for a person. However, both can experience the mental state of \"pain\". This view led to a different kind of monism called functionalism, and compared the mind to a computer. Many functionalists think the mind is like software, and the brain is hardware. One problem with functionalism is the Chinese room thought experiment by John Searle. Searle tells a story of a man that only speaks English locked inside a room. Inside the room are Chinese symbols and a rule book in English on moving the symbols around. Other people outside communicate with him in Chinese writing. The man can reply in perfect Chinese by following the rules, but does that mean the man knows any Chinese? Searle does not think so, and this means that thinking must happen at a higher level than following rules like a computer. === Panpsychism as an answer to the mind-body problem === Panpsychism is the belief that mental aspects are basic and everywhere in the world. This could mean conscious experience, or thought, is everywhere. It has a long history in both Western and Eastern philosophy. It is becoming popular again in recent times. Panpsychism is a \"middle way\" between dualism and monism. A panpsychist might say that humans have a very rich experience, horses less, mice even less, and plants even less. They would say that experiences reduce down to the most basic levels of reality, perhaps electrons are quarks. In this way, there could be a small amount of consciousness in the universe that can combine into the kind of experience humans have. Philosopher and mathematician Bertrand Russell endorsed this view of Russellian or neutral monism. Like dualism and monism, there are many other types of panpsychism, each with their own strengths and weaknesses. One problem with all types of panpsychism is the \"combination problem\": how does this small amount of consciousness combine to form a \"big\" conscious subject? Most philosophers at the moment do not think there is a good answer to the combination problem. Panpsychism has only recently been taken seriously in philosophy and neuroscience, so an explanation of the combination problem may be decades or hundreds of years away. === Mysterianism === Mysterianism is an idea that there are no answers to the mind-body problem. There are many different types of mysterianism. The strongest types say that there will never be an answer because our mind has limits. A weaker type of mysterianism might say that we will not be able to answer the mind- body problem until we have more scientific knowledge, or even a paradigm shift. A paradigm shift means that the basic ideas in our science and the way we explain the world all must change. ==References== ==Related pages== *Epistemology *Theory of mind *Thought Category:Branches of philosophy",
 "title": "Philosophy of mind"
}