{
 "id": "168953",
 "text": "Evolutionary psychology is a branch of psychology that investigates behavior which has evolved. It is similar in this respect to ethology, which has always used ideas from evolutionary biology. ==Abstract== This field seeks to identify which human psychological traits are evolved adaptations, that is, functional products of natural selection or sexual selection. Evolutionary psychology usually focuses on behavior most people share. Sex and social behavior are some of the more common areas that evolutionary psychology focuses on.Ardrey, Robert 1961. African genesis; a personal investigation into the animal origins and nature of Man. New York: Atheneum. Fontana Morris, Desmond. 1967. The naked ape: a zoologist's study of the human animal. New York: McGraw-Hill. ; Wright, Robert 1994. The moral animal: why we are the way we are: the new science of evolutionary psychology. Vintage. Events like violent behavior need explanation in evolutionary terms.Ardrey, Robert 1966. The territorial imperative: a personal inquiry into the animal origins of property and nations. London: Collins. ISBN 978-0002118194Lorenz, Konrad 1966. On aggression. London: Methuen. Wilson E.O. [1978] 2004. On human nature. Harvard University Press. Evolutionary psychology is related to other fields of science like sociobiology, social psychology, and sociocultural anthropology. Evolutionary psychologists argue that much of human behavior is the result of adaptations that evolved to solve recurrent problems in human ancestral environments.Confer et al. 2010. Evolutionary psychology American PsychologistBuss, David M. 2011. Evolutionary psychology: the new science of the mind. Pearson, Boston.Durrant R. & Ellis B.J. 2003. Evolutionary psychology. In M. Gallagher & R.J. Nelson (eds) Comprehensive Handbook of Psychology, volume III: Biological psychology, 1–33. New York: Wiley & Sons.Pinker, Steven 2002. The blank slate: the modern denial of human nature. New York, N.Y: Viking. Tooby, John & Leda Cosmides 2005. Conceptual foundations of evolutionary psychology. In D.M. Buss (ed) The handbook of evolutionary psychology (pp. 5–67). Hoboken, NJ: Wiley. Full text The adaptationist approach is steadily increasing as an influence in the general field of psychology.Wright, Robert C.M. 1995. The moral animal: evolutionary psychology and everyday life. Introduction: Darwin and us. New York: Vintage Books. Evolutionary psychologists hold that behaviors or traits that occur universally in all cultures are good candidates for evolutionary adaptations.Schacter, Daniel L; Daniel Wegner and Daniel Gilbert 2007. Psychology. Worth Publishers.26-27 This includes our ability to infer others' emotions, discern kin from non-kin, identify and prefer healthier mates, and cooperate with others. They report successful tests of theoretical predictions related to such topics as infanticide, intelligence, marriage patterns, promiscuity, perception of beauty, bride price and parental investment.\"Despite this difficulty, there have been many careful and informative studies of human social behaviour from an evolutionary perspective. Infanticide, intelligence, marriage patterns, promiscuity, perception of beauty, bride price, altruism, and the allocation of parental care have all been explored by testing predictions derived from the idea that conscious and unconscious behaviours have evolved to maximize inclusive fitness. The findings have been impressive\". In 'Social behaviour, animal. Encyclopædia Britannica. Encyclopædia Britannica Online. Encyclopædia Britannica, 2011. Web. 23 Jan. 2011. . :\"The recognition that psychological mechanisms are evolved adaptations connects evolutionary biology to psychology in the strongest possible fashion, allowing everything we know about the study of adaptations to be applied to the study of psychological mechanisms\". == Books == *Barkow, Jerome H; Cosmides, Lena & Tooby, John (eds) 1992. The adapted mind: evolutionary psychology and the generation of culture. Oxford University Press. *Buss, David 2011. Evolutionary psychology: the new science of the mind. 4th ed, Pearson. == Related pages == *Adaptive unconscious *Sociobiology *The Expression of the Emotions in Man and Animals == References == == Other websites == * Frans de Waal 2012 Moral behavior in animals Category:Branches of psychology Category:Evolutionary biology",
 "title": "Evolutionary psychology"
}