{
 "id": "168957",
 "text": "Ageism is when a person is treated badly only because of their age and a highly damaging social construct. Ageism can be bias and discrimination by one person or by a part of society as a group. Discrimination is when a person is left out or abused by somebody who does not like something about them. For example, their facial features, their height or their skin. There have been many issues at the British broadcasting company, BBC, dealing with people saying that they have issues with ageism. Ageism is often common in the entertainment industry and journalism where what a person looks like is felt by many to be important, although ageism can be directed at people working in their industry even in their private life. There are two targets for age discrimination: old people (also called senior citizens) and young people. Discrimination against old and young people can happen at places like job interviews. For example, a company might hire a worker who is about 30 years old instead of someone who is about 50 years old, or someone who is around 20 years old, regardless of skill level. Another common example of ageism is not allowing \"minors\", or young people, to vote, drive, work, marry, or give sexual consent. Age discrimination is the result of actions taken to deny or limit opportunities to people based on age. These are usually actions taken as a result of one's ageist beliefs and attitudes. Age discrimination occurs on both a personal and institutional level.Quadagno, J. (2008). The field of social gerontology. In E. Barrosse (Ed.), Aging & the life course: An introduction to social gerontology (pp. 2–23). New York: McGraw-Hill. On a personal level, an older person may be told that they are too old to engage in certain physical activities, like an informal game of basketball between friends and family. They may also be told (most common in today's Western society) that they are too old to date or to be sexually attractive to much younger people and to have a much younger partners, or encounter prejudices against age-differences in general, whether the relationship is sentimental/sexual or even platonic (this particular form of ageist bigotry and discrimination is even more relevant today or in recent times on social media). A relevant example of the latter case is the infamous \"Half your age plus seven rule\". Although this relatively recent theory supposedly originated in the West is recognized as bigoted, outdated and ageist and without actual valid basis, one \"rule of thumb\" to determine whether an age difference is \"socially acceptable\" holds that a person should never date someone whose age is less than half their own plus seven years. According to this \"rule\", a 28-year-old would date no one younger than 21 (half of 28, plus 7) and a 50-year-old would date no one younger than 32 (half of 50, plus 7). == Notes == ==References== Category:Discrimination",
 "title": "Ageism"
}