{
 "id": "169055",
 "text": "The Jack Russell Terrier is a small dog with a white coat that can be smooth or rough-coated. Some have a broken coat that is also called \"wire-haired\". This terrier is good at fox hunting. == History == The Jack Russell terrier were originally bred in England by the Reverend John Russell from about 1819. The Jack Russell is sturdier than the standard terrier. It is a fast runner, has a great nose and can hunt the fox even when it goes underground. It can also be used as a work dog. :\"Difficulty in telling the terrier from the creature it was bolting out of its den brought about the desire for a more white-bodied dog. In all probability the English Black and Tan Terrier was crossed with the Old English White Terrier (both now extinct) to achieve the type of coat and colouring we have today in our Jack Russell Terriers\". == Variants == As with other domesticated animals, there are numerous variations. Differences in naming were caused by the different regulations of different kennel clubs. Some dog clubs make a difference between what they call \"Parson Jack Russell Terriers\", which are over 12\" (inches) at the shoulders, and \"Jack Russell Terriers\" which are under 12\" in height. Other clubs do not. They are broadly the same type of dog. It is easy to change the height of dogs by selective breeding, and the reason working dogs come in different sizes is to make them better at a particular job. Taller terriers were used for hunting foxes, and smaller terriers were used for hunting rabbits and rodents. :\"So historically the Jack Russell and the Parson are the same breed with their breed standards written by different groups of enthusiasts in different countries. Today, the only actual difference is leg length\".Jane Dogs. Fox Terriers and Jack Russells == References == == Other websites == ; Jack Russell Terrier Clubs * Jack Russell Terrier Club of America * Jack Russell Terrier Club of Canada ; Other websites * A Pictorial History of Working Terriers * Terrier Work Basics * Jack Russell Rescue Australia, the only Jack Russell Terrier Rescue group in Australia * Jack Russell Terrier Pictures & Info * Jack Russell Training and Raising Information Category:Terriers Category:FCI breeds Category:Dog breeds originating in England",
 "title": "Jack Russell Terrier"
}