{
 "id": "169206",
 "text": "Blank slate, or tabula rasa (which means the same thing) was a philosophical idea of John Locke. It had, like much of philosophy, a history which went as far back as Aristotle, but it was Locke who made it known to our modern world: :\"Let us then suppose the mind to be, as we say, white paper void of all characters, without any ideas. How comes it to be furnished? ... To this I answer, in one word, from EXPERIENCE\".Locke, John 1690. An essay concerning human understanding. Humans, when born, are thought not have mental experience or knowledge, and that everything is learned after they grow. In particular, Locke thought all knowledge came from sense data, and the mind is empty at the beginning. By 'sense data' is meant the process of hearing, seeing, touching etc. Locke's idea was immediately picked up by others: :\"Children are a sort of raw material put into our hands... [Their minds are] like a sheet of white paper\". :\"Our virtues and our vices may be traced to the incidents which make the history of our lives, and if these incidents could be divested of every improper tendency, vice would be extirpated [cut out] from the world\".—The economist and social liberal William Godwin (1756–1836), who argued for human perfectibility and enlightenment.Godwin, William 1793. Enquiry concerning political justice and its influence on modern morals and manners. London. Many have held similar views. The founder of behaviourism, John B. Watson (1878–1938): :\"Give me a dozen healthy infants, well-formed, and my own specified world to bring them up in and I'll guarantee to take any one at random and train him to become any type of specialist I might select – doctor, lawyer, artist, merchant-chief and, yes, even beggar-man and thief, regardless of his talents, penchants, tendencies, abilities, vocations, and race of his ancestors\".Watson J.B. 1930. Behaviorism. 2nd ed, Chicago: University of Chicago Press. p82 Throughout the 20th century the influence of evolution and genetics ran against these liberal ideas. Ethology proved that much animal behaviour was inherited, instinctual, (innate and permanent). Konrad Lorenz argued that the aggression so obvious in the history of mankind was a playing out of behaviour which had evolutionary advantage in our past. The field of evolutionary psychology set out to examine the role played by evolution on our mental life. If humans share a common evolutionary history with the other animals, it is likely that we inherit mental traits from our evolution.Stevenson Leslie & Haberman, David L. Ten theories of human nature. 5th ed, Oxford University Press. Chapter 10: Darwinian theories of human nature. The human ability to learn a language is inherited, and is of huge practical importance. Very important also (though less obvious) is the way that our unconscious mind helps us get through life. The apparatus which performs that mental activity is certainly inherited.Wilson, Timothy D. 2002. Strangers to ourselves: discovering the adaptive unconscious. Harvard University Press. These are some reasons why a number of recent publications have rejected Locke's idea.Pinker, Steven 2002. The blank slate: the modern denial of human nature. New York, N.Y: Viking. Gladwell, Malcolm 2005. Blink: the power of thinking without thinking. Little, Brown, New York. & == Related pages == *Adaptive unconscious *Behaviourism *Empiricism *Human nature *Nature versus nurture *Psychological nativism *Sociobiology == References == Category:Psychology Category:Philosophical anthropology",
 "title": "Blank slate"
}