{
 "id": "169652",
 "text": "Terence Ian \"Terry\" Butcher (born 28 December 1958 in Singapore) is the manager of the Scottish Premier League side Inverness Caledonian Thistle. He was once a professional player. He played as defender with Ipswich Town and Rangers in the 1980s. He was also a captain of England and won 77 caps in his career of ten years. ==Early life== He was born in Singapore but spent his childhood in Lowestoft, Suffolk. There he attended The Denes High School. He also met his wife Rita there. He got a chance to join Norwich City youth team, but refused it. ==Playing career== ===Club career=== Butcher made his debut for Ipswich against Everton in the First Division on 15 April 1978. Over the next eight seasons, he became the club's central defender. His good performance was noticed by then England coach Ron Greenwood. He gave him his debut in a friendly against Australia in 1980. In 1981, Butcher played in the Ipswich side that won the UEFA Cup under Bobby Robson. That year the club cape close to its first League title since 1962. However Aston Villa defeated them and won the title. In 1986, Butcher left Ipswich when they were relegated. He became one of the first 'English invasion' players to join Scottish club Rangers. This was after Graeme Souness became its manager. Souness, the former Liverpool player, paid Ipswich £725,000 for him in July 1986. As captain, he led them to three League titles in four seasons. They also won two Scottish League Cups. In November 1987 he broke his leg during Scottish Premier Division fixture against Aberdeen. He could not play for the rest of the season. Before he was injured, Butcher was close to signing a £1million return to England with Manchester United. His injury cancelled this signing. United manager Alex Ferguson signed Norwich City's Steve Bruce instead. His last Rangers game came in September 1990. Rangers lost 2-1 league against Dundee United in the match. His performance in that match was bad and he was dropped from the side. Leeds United manager Howard Wilkinson talked with Graeme Souness about bringing Butcher back to England, but when Butcher did depart from Ibrox it was in a £400,000 deal to become player-manager of Coventry City on 15 November 1990. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Ipswich Town 1977–78 First Division 3 0 3 0 1978–79 21 2 1 0 2 0 24 2 1979–80 36 2 4 0 2 0 4 0 46 2 1980–81 40 4 7 0 5 0 12 2 64 6 1981–82 27 1 1 0 6 0 2 0 36 1 1982–83 42 0 3 0 2 0 2 1 49 1 1983–84 34 1 2 0 4 0 40 1 1984–85 42 2 5 0 9 0 56 2 1985–86 27 4 5 0 2 2 34 6 Total 272 16 28 0 32 2 20 3 352 21 Rangers 1986–87 Scottish Premier Division 43 2 1 0 5 0 6 0 55 2 1987–88 11 1 0 0 3 0 4 0 18 1 1988–89 34 2 8 0 5 0 4 1 51 3 1989–90 34 3 2 0 5 0 2 0 43 3 1990–91 5 0 0 0 3 1 1 0 9 1 Total 127 8 11 0 21 1 17 1 176 10 Coventry City 1990–91 First Division 6 0 1991–92 0 0 Total 6 0 Sunderland 1992–93 First Division 38 0 Clydebank 1993–94 Scottish First Division 3 0 Career total 446 24 ===Managerial=== Team League (s) From To Record Record Record Record Record Record G W D L Win % Coventry City English Division One 14 November 1990 6 January 1992 Sunderland Championship 5 February 1993 26 November 1993 Motherwell Scottish Premier League 24 April 2002 17 May 2006 Sydney Australian A-League 17 May 2006 8 February 2007 Brentford English League Two 7 May 2007 11 December 2007 Inverness CT Scottish First Division Scottish Premiership 27 January 2009 11 November 2013 Hibernian Scottish Premiership 12 November 2013 10 June 2014 Newport County English League Two 2 May 2015 1 October 2015 Total Total Total Total ==Honours== ===Player=== Ipswich Town * UEFA Cup: 1980–81 Rangers * Scottish Football League Premier Division: 1986–87, 1988–89, 1989–90 * Scottish League Cup: 1986–87, 1988–89 Individual *Ipswich Town Player of the Year: 1984–85, 1985–86 * Rangers Hall of Fame: inducted 2000 *Ipswich Town Hall of Fame: Inducted 2010 * Scottish Football Hall of Fame: inducted 2011 *English Football Hall of Fame: Inducted 2021 ===Manager=== Inverness Caledonian Thistle * Scottish First Division (second tier): 2009–10 Individual *Scottish Premiership Manager of the Month: February 2004, September 2004, March 2006, October 2010, November 2012, August 2013 ==References== Category:1958 births Category:Living people Category:English footballers Category:English football managers Category:Ipswich Town F.C. players Category:Sportspeople from Suffolk Category:Sunderland A.F.C. managers Category:1982 FIFA World Cup players Category:1986 FIFA World Cup players Category:1990 FIFA World Cup players",
 "title": "Terry Butcher"
}