{
 "id": "169688",
 "text": "The Additions to Daniel are three chapters that have been held by the Roman Catholic, Eastern Catholic, Oriental Orthodox and Eastern Orthodox churches since the council of Rome (380). These books were removed in most Christian Bibles since Martin Luther's decision to include them in his bible as \"Apocrypha\" due to the supposed contradiction of the Hebrew Old Testament (the Apostles and Early Church onward using the Septuagint). The chapters are listed in Article VI of the Thirty-Nine Articles of the Church of England as good but not sacred reading. Most Protestant Bibles do not have these chapters because most Protestant churches believe these chapters are apocryphal. The Additions to Daniel are not found in the Hebrew or Aramaic text of Daniel. These stories are in the Greek Septuagint and a translation by the writer Theodotion. However, most Protestant Bibles use only the text in the Hebrew and Aramaic manuscripts, so they do not have these chapters. The additions are: * The Prayer of Azariah and Song of the Three Holy Children : Azariah prays for God's protection. Later on, he and his friends sing a prayer of thanks. These prayers make up Daniel 3:24-90, put between verses 23 and 24 (v. 24 becomes v. 91). * Susanna and the Elders : Two men want to have sex with Susanna but she does not want to. The men lie to other people and make them want to kill her. A boy named Daniel shows that the men lied, and they are killed instead. This story is found before Daniel 1:1 as a prologue in very old Greek texts. It is found as chapter 13 in the Vulgate and modern Catholic Bibles. * Bel and the Dragon : This chapter has three stories about how Daniel fights against the worship of idols, and how he escapes from lions. These stories come after Daniel 12:13 in the Greek texts, and they make up chapter 14 in the Vulgate. ==References== ==Other websites== * NRSV: Prayer of Azariah * NRSV: Susanna * NRSV: Bel and the Dragon * Old Greek and Septuagint translations and text notes from NETS * * * * The Unity of the Old English Daniel * * * * Daniel, Additions to Category:2nd-century BC books",
 "title": "Additions to Daniel"
}