{
 "id": "170181",
 "text": "The square meter is the SI-derived unit of area. It has a symbol m² (33A1 in Unicode). It is defined as the area of a square whose sides measure exactly one meter. The square meter is derived from the SI base unit of the meter, which in turn is defined as the length of the path travelled by light in absolute vacuum during a time interval of \\frac{1}{299792458} of a second. Adding SI prefixes creates multiples and submultiples. However, as the unit is squared, the order of magnitude difference between units doubles from their comparable linear units. For example, a kilometer is one thousand times the length of a meter, but a square kilometer is one million times the area of a square meter. A \"square meter\" is not the same thing as a \"meter square\" \\- although it is true that exactly 1 square meter is exactly 1 meter square. But that only works for the number 1; no other. For example, a square that is 2 meters long and 2 meters wide has 4 square meters of area. 2m*2m=4m^2 But a square that is 4 meters squared would have 4 meters on each side. This means it would have 16 square meters of area. 4m*4m=16m^2 That is, (4m)^2 is 4 meters squared, whereas 4m^2 is 4 square meters. == SI prefixes applied to the square meter == The square meter may be used with all SI prefixes used with the meter. Multiple Name Symbol Multiple Name Symbol 100 square meter (centiare) m² 100 square meter (centiare) m² 102 square decameter (are) dam² 10−2 square decimeter dm² 104 square hectometer (hectare) hm² 10−4 square centimeter cm² 106 square kilometer km² 10−6 square millimeter mm² 1012 square megameter Mm² 10−12 square micrometer µm² 1018 square gigameter Gm² 10−18 square nanometer nm² 1024 square terameter Tm² 10−24 square picometer pm² 1030 square petameter Pm² 10−30 square femtometer fm² 1036 square exameter Em² 10−36 square attometer am² 1042 square zettameter Zm² 10−42 square zeptometer zm² 1048 square yottameter Ym² 10−48 square yoctometer ym² ==Conversions== A square meter is equal to: * 0.000 001 square kilometer (km²) * 10,000 square centimeters (cm²) * 0.000 1 hectares (ha) * 0.01 ares (a) * 1 centiare (ca) * 0.000 247 105 381 acres * 1.195 990 square yards * 10.763 911 square feet * 1,550.003 1 square inches ==Related pages== *SI *SI prefix *1 E0 m² *Conversion of units *Orders of magnitude == Notes == == Other websites == *BIPM (SI maintenance agency) (home page) *BIPM brochure (SI reference) Category:Units of area Category:SI derived units",
 "title": "Square meter"
}