{
 "id": "170259",
 "text": "Reddit () is a website where online users share links to online articles and other media. ==Overview== Reddit is a forum made up of user-generated content and discussion boards. It is organized into subreddits, communities within which discussions take place. The links being shared can be voted on, while links with the highest number of votes are shown on the front page, sometimes known as the instant feed, of the forum. ==History== Reddit was founded in 2005 by Steve Huffman and Alexis Ohanian, and is also available in other languages. Some Reddit users call themselves redditors, while subreddit moderators mods. Subreddits are directed towards all sort of things, like education, being funny, cute pictures of animals, internet memes, etc. ===Subreddits=== Discussions on Reddit are organized into user-created areas of interest called \"subreddits\", with individual moderators (any user can be one) holding sweeping powers to ban users and dictate content with a range of tools, particularly automated filters. ==Controversies== Reddit has been a subject of controversy as it has many subreddits run by those distributing disinformation and explicit materials, including subreddits r/Creepshots, r/jailbait, and r/greenandpleasant. Reddit has also been long been criticized for uncontrolled antisemitism. * * * * * Antisemites, especially Holocaust deniers, * * * * * across the political spectrum are active on Reddit. On February 20, 2025, an independent journalist announced his findings that over 110 subreddits were controlled by around 30 users who took advantage of the forum's loopholes to systematically distribute antisemitic disinformation for terrorist groups.The Hamas, Hezbollah, and Palestinian Islamic Jihad. The methods involve \"vote brigading, subreddit moderation, and content manipulation\". Reportedly, the compromised subreddits include r/Documentaries (20M members), r/therewasanattempt (7.2M), r/PublicFreakout (4.7M), r/Fauxmoi (4.3M), r/MorbidReality (1.1M), r/ToiletPaperUSA (440K), r/Thatsactuallyverycool (277K), r/Palestine (270K), r/ENLIGHTENEDCENTRISM (184K) and r/boringdystopia (94K), from which misinformation was funnelled to smaller subreddits and beyond Reddit to influence public opinion, while alerts to the company were repeatedly ignored. In particular, the journalist noted: ==Notes== ==References== Category:Websites established in 2005 Category:American technology companies Category:Companies based in San Francisco Category:American social networking websites",
 "title": "Reddit"
}