{
 "id": "17056",
 "text": "thumb|right|Joseph Smith, Jr. (circa 1842) Joseph Smith, Jr. (December 23, 1805 – June 27, 1844) was the founder and first president of The Church of Jesus Christ of Latter-day Saints. He and five associates formally organized the Church in Fayette, New York on April 6, 1830. He presided over the Church until his was martyred. Joseph Smith married Emma Hale on January 18, 1827. They were married 17 years, they were the parents of 11 children, 2 were adopted. Joseph and Emma's first 3 children passed away shortly after their birth. In 1831, they adopted twins, one of which, a boy, died before his first birthday. Over the next 12 years, Emma gave birth to six sons, four of them survived infancy and their youngest child was born five months after Joseph's death. Joseph and his older brother Hyrum were shot to death on 27 June 1844 by a mob of 150 to 200 men. They had been imprisoned in an Illinois jail on false charges of riot and treason after surrendering themselves to the law. Joseph was 38; Hyrum was 44. On 28 June, the bodies of Joseph and Hyrum were prepared and laid out for the estimated 10,000 mourners to view, and on the following day were buried secretly to avoid further attacks or desecration by mobs. == Book of Mormon == When Joseph Smith was 17 years old, an angel named Moroni. appeared to him one night and told him about a hidden record containing the sacred history of an ancient American civilization. Shortly after Joseph married Emma Hale an angelic messenger entrusted Joseph with gold plates and an Urim and Thummim to aid in the translation of the Book of Mormon. God provided a Urim and Thummim to His prophets in ancient times (see Exodus 28:30; 1 Samuel 28:6; Ezra 2:63). When the Book of Mormon was almost finished, the Lord instructed Joseph Smith to formally organize a church. The Church of Jesus Christ of Latter Day Saints, was established on April 6, 1830. Joseph published the Book of Mormon, which is a compilation of ancient scripture and is comparable to the Bible. == Mormon Church == On April 6, 1830, he started The Church of Jesus Christ of Latter-day Saints. It is often called the Mormon Church. Joseph Smith said that God wanted him to be a prophet and teach other people the things that he learned from God. This church still exists today, with millions of members around the world. Joseph Smith taught some things that some people did not like. He said that other churches were only partly true. He also said that men could have more than one wife if God commanded them, just like was taught in the Old Testament of the Bible. The Mormons also did not always get along with their neighbors. ==Death== Joseph and his older brother Hyrum were shot to death on 27 June 1844 by a mob of 150 to 200 men. They had been imprisoned in an Illinois jail on false charges of riot and treason after surrendering themselves to the law. Joseph was 38; Hyrum was 44. On 28 June, the bodies of Joseph and Hyrum were prepared and laid out for the estimated 10,000 mourners to view, and on the following day were buried secretly to avoid further attacks or desecration by mobs. ==References== Category:1805 births Category:1844 deaths Category:American Latter Day Saint leaders",
 "title": "Joseph Smith"
}