{
 "id": "171059",
 "text": "Malcolm III of Scotland (also called Malcolm Canmore), King of Scots was the first of a dynasty of kings who ruled Scotland for over two centuries. == Career == Malcolm was born in 1031, the son of king Duncan I of Scotland and his wife; a cousin of Siward, Earl of Northumberland.The Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, ed. James Balfour Paul, Vol. I (Edinburgh: David Douglas, 1904), pp. 1-2 When his father was killed in 1040 Malcolm did not succeed to the throne. At the time the system alternated between different lines of the same royal family. So the king chosen from a different royal line was Macbeth, who had killed Duncan I in battle.J. D. Mackie, A History of Scotland, Second Edition, ed. Bruce Lenman; Geoffrey Parker (London; New York: Penguin Books, 1978), p 33 Malcolm killed Macbeth in battle in 1057, but Lulach, Macbeth's stepson was selected as king.J. D. Mackie, A History of Scotland, Second Edition, ed. Bruce Lenman; Geoffrey Parker (London; New York: Penguin Books, 1978), p 34 This broke the pattern of alternate selection. Lulach ruled only ruled a few months until he was killed.Agnes Mure Mackenzie, The Foundations of Scotland (London; Edinburgh: W. & R. Chambers, Ltd., 1938), p. 106 Malcolm finally succeeded Lulach and changed the succession to his own sons and their descendants. This made Scotland like other European countries in keeping the same dynasty on the throne. == King of Scots == Malcolm was in his late twenties when he finally became king.Agnes Mure Mackenzie, The Foundations of Scotland (London; Edinburgh: W. & R. Chambers, Ltd., 1938), p. 120 Malcolm would lead a total of five raids into England starting in 1061.Israel Smith Clare, Library of Universal History, Vol. VII: Mediæval history (New York; Chicago: Union Book Co., 1906), p. 2362 The Norman Conquest of England caused many to leave England. Malcolm welcomed several into Scotland. These included Edgar Atheling, his sisters Margaret and Christina as well as their mother. Raised at the court of St. Stephen of Hungary she was beautiful, wise, and very religious.Agnes Mure Mackenzie, The Foundations of Scotland (London; Edinburgh: W. & R. Chambers, Ltd., 1938), p. 126 Malcolm was at once taken with her and asked her to marry him. She said no because she and her sister were going to be nuns. But after a time she finally accepted. By his marriage to Margaret he gained an interest in the English throne.J. D. Mackie, A History of Scotland, Second Edition, ed. Bruce Lenman; Geoffrey Parker (London; New York: Penguin Books, 1978), p 35 Edgar Atheling joined the uprising in the North of England in 1069 but it failed. William the Conqueror sacked York as punishment. Malcolm joined in but too late as Edgar left England on a Danish ship.Agnes Mure Mackenzie, The Foundations of Scotland (London; Edinburgh: W. & R. Chambers, Ltd., 1938), p. 127 Malcolm had long claimed Cumbria and Northumberland and made another raid on Bamburgh. He took so many captives that it was said there was an English slave in every house in Scotland. In 1071 William came north with a large army. He came as far as Abernethy but Malcolm wanted peace. William agreed to give him twelve English manors and pay a yearly fee. Malcolm had to give his son Malcolm as a hostage but this made him a vassal of the English king. Edgar Atheling returned to Scotland the next year.Agnes Mure Mackenzie, The Foundations of Scotland (London; Edinburgh: W. & R. Chambers, Ltd., 1938), p. 129 He had been offered land on the border near Normandy by the French king. Malcolm told him to take it and settle down. He then gave Edgar gold and silver and sent him off to live in France. But Edgar soon returned having been shipwrecked on his journey. This time Malcolm advised him to make peace with king William of England. Edgar did and received a castle as a residence in England. In 1079 William and his son Robert were fighting in Normandy. Malcolm raided into England again being welcomed in Northumberland. But William sent his brother Odo, Bishop of Bayeux north to punish Northumberland and Robert to raid into Scotland. Once more Robert and Malcolm settled their differences and were at peace again. In 1092, during the reign of William Rufus Malcolm raided England yet again. Peace was again renewed with William Rufus. But William failed in one of his promises to Malcolm, so in 1093 the Scots invaded England again.Israel Smith Clare, Library of Universal History, Vol. VII: Mediæval history (New York; Chicago: Union Book Co., 1906), p. 2363 This time Malcolm III died while fighting at Alnwick Castle. His son Edward died there also. Margaret, his queen died of grief after hearing the news of the death of her husband and their son. == Family == About 1059 he married Ingibjorg, the widow of Thorfinn Sigurdson, Earl of Orkney. She was the daughter of Earl Finn Arnason.The Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, ed. James Balfour Paul, Vol. I (Edinburgh: David Douglas, 1904), p. 2 Together they had: * Duncan, eventually succeeded his father as king Duncan II. * Donald, (died 1085). He married secondly Margaret of Wessex . They had eight children; six sons and two daughters, including: * Edward (died 1093). * Edmund, Prince of Cumbria and later a monk. * Ethelred, Earl of Fife and abbot of Dunkeld. * Edgar of Scotland, afterwards king. * Alexander, later king of Scots as Alexander I. * David, later king of Scots as David I. * Matilda, married Henry I of England. * Mary, married (1102) to Eustace, Count of Boulogne. Their daughter, Matilda, was the wife of Stephen, king of England. == Notes == == References == Category:1031 births Category:1093 deaths Category:Kings and Queens of Scotland Category:11th century in Scotland",
 "title": "Malcolm III of Scotland"
}