{
 "id": "171258",
 "text": "A gigasecond (symbol: Gs) is one billion seconds. That is about 31.7 years. It can be written as 109 seconds. 3.16 Gs is about 1 century (100 years). 31.6 Gs is about 1 millennium (1000 years). This page lists times of between 1 and 1000 gigaseconds, or between 31.7 and 31,700 years. * Shorter times * 351 years – half-life of californium-249 * years – time since the Taj Mahal was built * years – age of the King James Bible * 418 years – half life of silver-108 * 432.2 years – half life of americium-241 * years – time since Christopher Columbus reached the New World * years – time since the printing of the first Gutenberg Bible * 680 years – half life of niobium-91 * 790 years – amount of time the Zhou Dynasty lasted, the longest dynasty in Chinese history * 898 years – half life of californium-251 * 969 years – alleged age of Methuselah at death * 1000 years – one millennium = 3.16 x 1010 seconds * years – time since the volcanic destruction of Pompeii * years – time since the birth of Jesus Christ, according to Dionysius Exiguus * years – time since the assassination of Julius Caesar * years – time since the death of Alexander the Great * years – time since the death of Socrates * years – age of the Parthenon * years – time since Rome was founded, according to legend * 3,200 years—time since the Greek Dark Ages and the beginning of the Iron Age * 3,800 years—time since alphabetic writing started * 4,200 years—time since the completion of Stonehenge. * 4,569 years—time since the building of the Great Pyramid at Giza. * 4,851 years—age of oldest living plant, a bristle-cone pine named Methuselah * 5,715 years -- half-life of Carbon-14 * 6,500 years—time since the invention of the wheel * 7,370 years—half life of americium-243 * 8,500 years—half life of curium-245 * 11,000 years—time since city of Jericho was founded * 12,000 years—time since end of Pleistocene Epoch * 12,000 years—time since beginning of Holocene Epoch * 12,000 years—time since beginning of Neolithic Age * 20,300 years -- half life of niobium-94 * 21,000 years—time since the Last Glacial Maximum * 24,110 years -- half life of plutonium-239 * 29,000 years—time since the extinction of Homo neanderthalensis. * Longer times == References == Category:Orders of magnitude Category:Units of time",
 "title": "Gigasecond"
}