{
 "id": "171224",
 "text": "Catherine Ada Kelly (12 July 1863 – October 1898), known as Kate Kelly, was a younger sister of Australian bushranger Ned Kelly. ==Early life== Kate Kelly was born in Beveridge, Victoria, Australia, in a house built by her parents, John \"Red\" Kelly and Ellen Quinn. Kate was their seventh child. The family moved to Avenel soon after her birth, where another child, Grace, was born. John Kelly died of dropsy when Kate was four years old. Ellen Kelly then moved the family to her sister's house at Greta. One year later, the family moved again, to a two-room hut on their own land at Eleven Mile Creek. Kate helped her mother bring up the family, which included three more children by Ellen's second husband, George King. ==The Fitzpatrick incident== The Kellys had already had a long history of trouble with the police. Alexander Fitzpatrick, a young policeman, went to the house on 15 April 1878. He was drunk, and said he wanted to arrest Dan Kelly for horse stealing. He sexually assaulted Kate, and her family tried to help her. Historians can not agree on what really happened next. Fitzpatrick went back to Benalla Police Station and said that Ellen Kelly had hit him on the head with shovel. He also said that Dan Kelly had hit him, and Ned Kelly had tried to shoot him. William Skillion, Kate's brother-in-law, and William Williamson a neighbour of the Kellys, were also said to have hurt him. Ned Kelly said that he was not at the house, but working on a farm 400 miles away, though most historians believe he was at the house with Joe Byrne. Ellen Kelly was sent to prison for three years for trying to kill Fitzpatrick; Williamson and Skillion were sent for six year. Ned and Dan Kelly hid at Bullock Creek, in the Wombat Ranges, so the police could not find them. On the 25 October 1878, at Stringybark Creek, they met four policemen who had been sent to arrest them. Three of the policemen were killed. Ned, Dan, Joe Byrne and Steve Hart were made outlaws, and turned to bank robbery. ==Brave Kate Kelly== With their mother in prison, and their brothers being hunted by the police, Kate Kelly and her sister Margaret looked after the younger children. Kate also helped trick the police, leading the police away when they got close to her brothers. She supplied the Kelly Gang with food, ammunition, and news about the police hunt. The folk song, \"Ye Sons of Australia\" has a part about Kate helping the Kelly Gang; ::The daring Kate Kelly how noble her mien ::::::(The brave Kate Kelly who looked like a queen) ::As she sat on her horse like an Amazon queen, ::She rode through the forest revolver at hand ::Regardless of danger, who dare bid her stand. ::::::(She did not care about danger, who would try and stop her) The song places Kate Kelly at the siege at Glenrowan; ::The daring Kate Kelly came forth from the crowd ::::::(The brave Kate Kelly came out of the crowd) ::And on her poor brother she called out aloud, :::::: (And to her poor brother she called out loudly) ::\"Come forth my dear brother, and fight while you can\" ::But a ball had just taken the life of poor Dan ::::::(But a bullet had just killed poor Dan) Historians now think that many of the actions thought to have been carried out by Kate, was really gang member Steve Hart in a dress. ==Ned Kelly's capture== Following Ned's arrest, Kate would often visit him in prison, as well as raising money for legal costs. She got people to sign petitions asking for mercy for Ned. Kate begged on her knees in front of the Governor, His Excellency the Marquis of Normanby, to save her brother's life. Ned was hanged on 11 November 1880. ==Life after Ned== On the night of the hanging, Kate and her brother Jim Kelly, went on stage at the Appollo Hall in Melbourne. People paid one shilling to see them sitting on the stage. Kate and Jim went to Sydney and continued to appear on stage, with Jim riding Ned Kelly's horse. The police stopped the shows. She was seen performing as \"Ada\" in a Sydney \"Wild West Show\", and then in Adelaide under the names Ada Hennessey and Kate Ambrose. She stopped performing due to ill health. She worked for a short time at Hill Scott's Hotel in Adelaide, before her poor health forced her to return home to Greta. She worked as a servant in Wangaratta, and a maid in Lanceby. On 25 November 1888, she married William Henry Foster, a blacksmith, and lived in the town of Forbes. They had six children, though three died when they were still babies. On 6 October 1898, Kate was reported missing. She was found drowned eight days later, in a swamp near Forbes. Some historians think that she may have taken her own life because she had depression, brought on by the death of her sister, Maggie, two years earlier. She was buried in the Forbes Cemetery, aged 35. ==Descendants== After her death, her three children, Frederick Arthur, Gertrude Eileen Ada, and Ethel Maude, went to live with Ellen Kelly at Eleven Mile Creek. Frederick Arthur became a beekeeper in the town of Myrrhee and died in World War I. Gertrude married Arthur Cavanagh, a builder. They lived in Wangaratta and looked after Ellen Kelly in her old age. Ethel married Albert Hibbert, and also looked after Ellen Kelly. ==Kate Kelly in movies, art and music== * Australian artist, William Patrick Maroney, painted a picture of Kate Kelly which is kept in the National Library of Australia * The Kate Kelly Project by writer Merrill Findlay and composer Ross Carey. This will be a community based music theatre event. *In the 2003 movie Ned Kelly, Kate is played by Irish actor Kerry Condon. *The Whitlams' song \"Kate Kelly\", from their album, Torch the Moon, is about Kate Kelly. ==References== Category:1863 births Category:1898 deaths Category:Ned Kelly Category:People from Victoria (Australia) Category:Australian crime victims Category:Sexual abuse victims",
 "title": "Kate Kelly"
}