{
 "id": "171281",
 "text": "An order of magnitude describes the link between two different amounts. The difference between each amount step is usually 10, with each order being either 10 times greater or 10 times smaller than the next amount. This makes the scale easy to manipulate using logarithms. For time units, the difference between the smallest limit of time, the Planck time, and the next order of magnitude is larger than 10. A second is 60 t, a minute is 60 seconds, an hour is 60 minutes, a day is 24 hours, a week is 7 days, a month is 4 weeks, a year is 12 months, a millennium is 1,000 years, etc... ==Seconds== Orders of magnitude in seconds (time) Factor (in seconds) Time Unit Multiples: Time Unit Symbol: Time Unit Definition: Comparative examples & common units of time: Orders of magnitude: 10−44 seconds 1 Planck Time tP Planck Time is the time required for light to travel a distance of 1 Planck length in vacuum. - - 10−30 seconds 1 quectosecond qs Quectosecond, (quecto + second), is one nonillionth (in the short scale) of a second. - 1 qs and less, 10 qs, 100 qs 10−27 seconds 1 rontosecond rs Rontosecond, (ronto + second), is one quintillionth (in the long scale) or one octillionth (in the short scale) of a second. 300 rs: Average lifetime of W and Z bosons 1 rs, 10 rs, 100 rs 10−24 seconds 1 yoctosecond ysThe American Heritage Dictionary of the English Language: Fourth Edition. 2000. Available at: http://www.bartleby.com/61/21/Y0022100.html . Accessed December 19, 2007. note: abbr. ys or ysec Yoctosecond, (yocto + second), is one quadrillionth (in the long scale) or one septillionth (in the short scale) of a second. 0.3 ys: mean life of the W and Z bosons. 1 ys: time for top quark decay. 1 ys: time taken for a quark to emit a gluon. 91 ys: half-life of lithium-4. 1 ys, 10 ys, 100 ys 10−21 seconds 1 zeptosecond zs Zeptosecond, (zepto + second), is one sextillionth of a second. 7 zs: half- life of helium-9's outer neutron in the second nuclear halo. 17 zs: approximate period of electromagnetic radiation at the boundary between gamma rays and X-rays. 247 zs: The experimentally-measured travel time of a photon across a hydrogen molecule 300 zs: approximate typical cycle time of X-rays, on the boundary between hard and soft X-rays 1 zs, 10 zs, 100 zs 10−18 seconds 1 attosecond as Attosecond is one quintillionth of a second. 100 attoseconds: shortest measured period of time. 1 as, 10 as, 100 as 10−15 seconds 1 femtosecond fs Femtosecond is one quadrillionth of a second. cycle time for 390 nanometre light, transition from visible light to ultraviolet 1 fs, 10 fs, 100 fs 10−12 seconds 1 picosecond ps Picosecond is one trillionth of a second. 1 ps: half-life of a bottom quark 4 ps: Time to execute one machine cycle by an IBM Silicon-Germanium transistor (supercomputer) 1 ps, 10 ps, 100 ps 10−9 seconds 1 nanosecond ns Nanosecond is one billionth of a second. 1 ns: Time to execute one machine cycle by an Intel Pentium 4 1 GHz microprocessor 1 ns: Light travels 12 inches (30 cm) 1,000,000,000 nanoseconds: 1 second 1 ns, 10 ns, 100 ns 10−6 seconds 1 microsecond µs Microsecond is one millionth of a second. sometimes also abbreviated µsec 1 µs: Time to execute one machine cycle by an Intel 80186 microprocessor 4-16 µs: Time to execute one machine cycle by an older minicomputer 1 µs, 10 µs, 100 µs 10−3 seconds 1 millisecond ms Millisecond is one thousandth of a second. 50-80 ms: The time taken to blink an eye 1 ms, 10 ms, 100 ms 10−2 seconds 1 centisecond cs Centisecond is one hundredth of a second. - 1 cs, 10 cs, 100 cs 10−1 seconds 1 decisecond ds Decisecond is one tenth of a second. - 1 ds, 10 ds 100 seconds 1 second s - 1 second (s): \"One Mississippi\" said aloud 60 seconds (s): 1 minute 1 second, 10 seconds, 100 seconds 101 seconds 1 decasecond (10 seconds) das Decasecond is ten seconds. 6 decaseconds (das): 1 minute 101 seconds 102 seconds 1 hectosecond (1 minute and 40 seconds) hs Hectosecond is one hundred seconds. 3 hectoseconds (hs): 5 minutes 102 seconds 103 seconds 1 kilosecond (16 minutes and 40 seconds) ks Kilosecond is one thousand seconds. 3.6 kiloseconds (ks): 3,600 seconds or 1 hour 86.4 kiloseconds (ks): 86,400 seconds or 1 day 604.8 kiloseconds (ks): 1 week 103 seconds, 104 seconds, 105 seconds 106 seconds 1 megasecond (11 days, 13 hours, 46 minutes, and 40 seconds) Ms Megasecond is one million seconds. 1.21 megaseconds (Ms): one fortnight (1.21 × 106 seconds) 2.6 megaseconds (Ms): one month (2.6 × 106 seconds) 31.6 megaseconds (Ms): one year (107.50 seconds ≈ π × 107 seconds) 106 seconds, 107 seconds, 108 seconds 109 seconds 1 gigasecond (31.7 years) Gs Gigasecond is one billion seconds. 3.16 gigaseconds (Gs): one century ( ≈ π seconds) 31.6 gigaseconds (Gs): one millennium ( ≈ π seconds) 109 seconds, 1010 seconds, 1011 seconds 1012 seconds 1 terasecond (31,700 years) Ts Terasecond is one trillion seconds. 31.6 teraseconds (Ts): one megaannum/eon ( ≈ π seconds) 1012 seconds, 1013 seconds, 1014 seconds 1015 seconds 1 petasecond (31.7 million years) Ps Petasecond is one quadrillion seconds. 31.6 petaseconds (Ps): one gigaannum/aeon ( ≈ π seconds) 143 petaseconds (Ps): 1.43 × 1017 seconds ≈ 4.5 billion years, the approximate age of the Planet Earth 144 petaseconds (Ps): 1.44 × 1017 seconds ≈ 4.6 billion years, the approximate age of the Solar System and the Sun 158 petaseconds (Ps): 1.58 seconds ≈ 5 billion years, the estimated time it'd take for the Sun to expand into a Red giant. 429 petaseconds (Ps): 4.29 × 1017 seconds ≈ 13.6 billion years, the approximate age of the Milky Way Galaxy 440 petaseconds (Ps): 4.4 × 1017 seconds ≈ 14 billion years, the approximate age of the Universe 1015 seconds, 1016 seconds, 1017 seconds 1018 seconds 1 exasecond (31.7 billion years) Es Exasecond is one quintillion seconds. 0.44 exaseconds (Es) ≈ the best estimate of the age of the Universe 1018 seconds, 1019 seconds, 1020 seconds 1021 seconds 1 zettasecond (31.7 trillion years) Zs Zettasecond is one sextillion seconds. - 1021 seconds, 1022 seconds, 1023 seconds 1024 seconds 1 yottasecond (31.7 quadrillion years) Ys Yottasecond is one septillion seconds. - 1024 seconds, 1025 seconds, 1026 seconds 1027 seconds 1 ronnasecond (31.7 quintillion years) Rs Ronnasecond is one octillion seconds. - 1027 seconds, 1028 seconds, 1029 seconds 1030 seconds 1 quettasecond (31.7 sextillion years) Qs Quettasecond is one nonillion seconds. - 1030 seconds, 1031 seconds, 1032 seconds and more ==Years== Orders of magnitude (time) Factor (ina) Multiples: Common Units: Orders of magnitude: 10−50 Planck time, the shortest physically meaningful interval of time ≈ , 1.71 a 10−50 a 10−30 1 quectoannum - 1 qa and less, 10 qa, 100 qa 10−27 1 rontoannum - 1 ra, 10 ra, 100 ra 10−24 1 yoctoannum - 1 ya, 10 ya, 100 ya 10−21 1 zeptoannum - 1 za, 10 za, 100 za 10−18 1 attoannum - 1 aa, 10 aa, 100 aa 10−15 1 femtoannum - 1 fa, 10 fa, 100 fa 10−12 1 picoannum 1 sjjhj shjh = 3.17 × 10−11 a 1 pa, 10 pa, 100 pa 10−9 1 nanoannum 1 second = 3.17 × 10−8 a ≈ 10-7.50 a 1 na, 10 na, 100 na 10−6 1 microannum 1 brainly = 1.00 × 10−6 a 1 minute = 1.90 × 10−6 a 1 hour = 1.40 × 10−4 a 1 ua, 10 ua, 100 ua 10−3 1 milliannum 1 yummi = 1.00 × 10−3 a 1 day = 2.73 × 10−3 a 1 week = 1.91 × 10−2 a 1 ma, 10 ma, 100 ma 100 1 year year = 1 annum decade = 10 anna score = 20 anna century = 100 anna 1 a, 10 a, 100 a 103 1 kiloannum millennium = 1000 anna 103 a, 104 a, 105 a 106 1 megaannum epoch = 1,000,000 anna 106 a, 107 a, 108 a 109 1 gigaannum aeon = 1,000,000,000 anna 14 Ga = 1.4 × 1010 a ≈ 14 billion years, the approximate age of the Universe 109 a, 1010 a, 1011 a 1012 1 teraannum 1,000,000,000,000 years 1012 a, 1013 a, 1014 a 1015 1 petaannum 1,000,000,000,000,000 years 1015 a, 1016 a, 1017 a 1018 1 exaannum 1,000,000,000,000,000,000 years 1018 a, 1019 a, 1020 a 1021 1 zettaannum 1,000,000,000,000,000,000,000 years 1021 a, 1022 a, 1023 a 1024 1 yottaannum 1,000,000,000,000,000,000,000,000 years 1024 a, 1025 a, 1026 1027 1 ronnaannum 1,000,000,000,000,000,000,000,000,000 years 1027 a, 1028 a, 1029 1030 1 quettaannum 1,000,000,000,000,000,000,000,000,000,000 years 1030 a, 1031 a, 1032 and more ==References== Category:Units of time",
 "title": "Orders of magnitude (time)"
}