{
 "id": "171428",
 "text": "The descendants of Charles II of England, Stuart monarch of the Kingdom of England, Kingdom of Scotland and Kingdom of Ireland, are numerous; lines of his many illegitimate children exist to this day. Though Charles's wife Catherine of Braganza was barren, he stayed with her but had numerous mistresses. Some of Charles's illegitimate children were born before his marriage. This article deals with the most senior figures who were descended from Charles' illegitimate male children; the names of his daughters are also mentioned. Although some of Charles' children made claims to the throne, most notably his first son James Scott, 1st Duke of Monmouth, their illegitimacy meant that after Charles' death, his brother James, Duke of York became king instead. Over the years several of Charles' senior descendants have made names for themselves, including Augustus FitzRoy, 3rd Duke of Grafton who became Prime Minister of Great Britain, cricket pioneer Charles Lennox, 1st Duke of Richmond, and parliamentary reformer Charles Lennox, 3rd Duke of Richmond. Diana, Princess of Wales was descended from two of Charles' illegitimate sons; Henry Fitzroy, 1st Duke of Grafton and Charles Lennox, 1st Duke of Richmond. This means should her son Prince William, Prince of Wales, take to the British throne as he is expected to, William would become the first blood descendant of Charles II to do so. William is part of the royal House of Windsor, rather than the House of Stuart. == Child by Lucy Walter == === James Scott, 1st Duke of Monmouth === : Descendant Portrait Birth Marriages Death James Scott, 1st Duke of Monmouth 1649–1685 9 April 1649 Rotterdam son of Charles II of England and Lucy Walter Anne Scott, 1st Duchess of Buccleuch 20 April 1663 7 children 15 July 1685 Tower Hill aged 36 James Scott, Earl of Dalkeith 1685–1705 23 May 1674 son of James Scott, 1st Duke of Monmouth and Anne Scott, 1st Duchess of Buccleuch Henrietta Scott, Countess of Dalkeith 2 January 1693 6 children 14 March 1705 London aged 31 Francis Scott, 2nd Duke of Buccleuch 1705–1751 11 January 1694 son of James Scott, Earl of Dalkeith and Henrietta Scott, Countess of Dalkeith Lady Jane Douglas 5 April 1720 1 child Alice Powell 4 September 1744 No children 22 April 1751 aged 57 Henry Scott, 3rd Duke of Buccleuch 1751–1812 2 September 1746 son of Francis Scott, Earl of Dalkeith and Caroline Campbell, Baroness Greenwich Elizabeth Montagu 2 May 1767 7 children 11 January 1812 aged 66 Charles Montagu-Scott, 4th Duke of Buccleuch 1812–1819 24 May 1772 London son of Henry Scott, 3rd Duke of Buccleuch and Elizabeth Montagu Harriet Katherine Townshend 24 March 1795 7 children 20 April 1819 Lisbon aged 47 Walter Montagu-Douglas-Scott, 5th Duke of Buccleuch 1819–1884 25 November 1806 Dalkeith son of Charles Montagu-Scott, 4th Duke of Buccleuch and Harriet Katherine Townshend Charlotte Anne Thynne 13 August 1829 7 children 16 April 1884 Bowhill aged 78 William Montagu-Douglas-Scott, 6th Duke of Buccleuch 1884–1914 9 September 1831 Montagu House son of Walter Montagu-Douglas-Scott, 5th Duke of Buccleuch and Charlotte Anne Thynne Lady Louisa Jane Hamilton 22 November 1859 8 children 5 November 1914 aged 83 John Montagu-Douglas-Scott, 7th Duke of Buccleuch 1914–1935 30 March 1864 son of William Montagu-Douglas-Scott, 6th Duke of Buccleuch and Lady Louisa Jane Hamilton Lady Margaret Bridgeman 30 January 1893 8 children 19 October 1935 Bowhill aged 71 Walter Montagu-Douglas-Scott, 8th Duke of Buccleuch 1935–1973 30 December 1894 son of John Montagu-Douglas-Scott, 7th Duke of Buccleuch and Lady Margaret Bridgeman Vreda Esther Mary Lascelles 21 April 1921 3 children 4 October 1973 aged 38 John Scott, 9th Duke of Buccleuch 1973–2007 28 September 1923 son of Walter Montagu-Douglas-Scott, 8th Duke of Buccleuch and Vreda Esther Mary Lascelles Jane McNeill 10 January 1953 5 children 4 September 2007 aged 84 Richard Scott, 10th Duke of Buccleuch 2007–present 14 February 1954 son of John Scott, 9th Duke of Buccleuch and Jane McNeill Lady Elizabeth Marian Frances Kerr 31 October 1981 4 children == Children by Catherine Pegge == Catherine Pegge and Charles II also had a daughter together called Catherine FitzCharles but she died young or became a nun. === Charles FitzCharles, 1st Earl of Plymouth === Descendant Portrait Birth Marriages Death Charles FitzCharles, 1st Earl of Plymouth 1657–1680 1657 son of Charles II of England and Catherine Pegge Bridget Osborne 19 September 1678 No children 17 October 1680 Tangier aged 31 == Children by Barbara Villiers Palmer == Barbara Palmer, 1st Duchess of Cleveland was perhaps the most notorious of Charles' mistresses. Some of the children claimed by Palmer as belonging to Charles are in doubt. Anne Lennard, Countess of Sussex was claimed to be Charles' and he recognised her, though some sources regard Roger Palmer as her father. Palmer claimed Lady Barbara FitzRoy was Charles' daughter, however he never recognised her and most sources consider John Churchill, 1st Duke of Marlborough her likely father. Palmer and Charles had a daughter together Charlotte Lee, Countess of Lichfield and three sons who were recognised by Charles, their lines are featured below. === Charles FitzRoy, 2nd Duke of Cleveland === Descendant Portrait Birth Marriages Death Charles FitzRoy, 2nd Duke of Cleveland 1662–1730 18 June 1662 London son of Charles II of England and Barbara Palmer, Countess of Castlemaine Mary Wood 1671 No children Anne Pulteney 1694 6 children 9 September 1730 St. James's Square aged 68 William FitzRoy, 3rd Duke of Cleveland 1730–1774 19 February 1698 son of Charles FitzRoy, 2nd Duke of Cleveland and Anne Pulteney Lady Henrietta Finch 22 January 1731 No children 18 May 1774 Raby Castle aged 76 Henry Vane, 2nd Earl of Darlington 1774–1792 1726 son of Lady Grace FitzRoy and Henry Vane, 1st Earl of Darlington Margaret Lowther 22 January 1731 3 children 8 September 1792 Raby Castle aged 66 William Henry Vane, 1st Duke of Cleveland 1792–1842 27 July 1766 son of Henry Vane, 2nd Earl of Darlington and Margaret Lowther Lady Catherine Powlett 17 September 1787 8 children Elizabeth Russell 27 July 1813 No children 29 January 1842 aged 76 Henry Vane, 2nd Duke of Cleveland 1842–1864 6 August 1788 son of William Henry Vane, 1st Duke of Cleveland and Lady Catherine Powlett Lady Sophia Poulett 16 November 1809 No children 18 January 1864 Raby Castle aged 75 William John Frederick Vane, 3rd Duke of Cleveland 1864 3 April 1792 son of William Henry Vane, 1st Duke of Cleveland and Lady Catherine Powlett Lady Grace Lowther 3 July 1815 No children 6 September 1864 Raby Castle aged 72 Harry Powlett, 4th Duke of Cleveland 1864–1891 19 April 1803 son of William Henry Vane, 1st Duke of Cleveland and Lady Catherine Powlett Lady Catherine Stanhope 2 August 1854 No children 21 August 1891 Cleveland House aged 88 Francis William Forester 1891–1942 7 September 1860 son of William Henry Forester and Eleanor Alexandrina Fraser Aline Laura Milbank 10 April 1894 4 children 20 September 1942 aged 82 Henry William Forester 1942–? 19 July 1899 son of Francis William Forester and Aline Laura Milbank Helen Foss 1930 1 child unknown Barbara Laura Forester unknown 1934 daughter of Henry William Forester and Helen Foss Gordon Scott Vinson 1957 B F Austin unknown === Henry FitzRoy, 1st Duke of Grafton === Descendant Portrait Birth Marriages Death Henry FitzRoy, 1st Duke of Grafton 1663–1690 28 September 1663 son of Charles II of England and Barbara Palmer, Countess of Castlemaine Isabella FitzRoy, Duchess of Grafton 1 August 1672 2 children 9 October 1690 aged 27 Charles FitzRoy, 2nd Duke of Grafton 1690–1757 25 October 1683 son of Henry FitzRoy, 1st Duke of Grafton and Isabella FitzRoy, Duchess of Grafton Lady Henrietta Somerset 30 April 1713 7 children 6 May 1757 aged 74 Augustus FitzRoy, 3rd Duke of Grafton 1757–1811 28 September 1735 son of Augustus FitzRoy and Elizabeth Cosby Anne Liddell 29 January 1756 3 children Elizabeth Wrottesley 24 June 1769 6 children 14 March 1811 aged 76 George FitzRoy, 4th Duke of Grafton 1811–1844 14 January 1760 son of Augustus FitzRoy, 3rd Duke of Grafton and Anne Liddell Charlotte Maria Waldegrave 16 November 1784 1 child 28 September 1844 aged 84 Henry FitzRoy, 5th Duke of Grafton 1844–1863 10 February 1790 son of George FitzRoy, 4th Duke of Grafton and Charlotte Maria Waldegrave Mary Caroline Berkeley 20 June 1812 5 children 26 March 1863 aged 73 William FitzRoy, 6th Duke of Grafton 1863–1882 5 August 1819 son of Henry FitzRoy, 5th Duke of Grafton and Mary Caroline Berkeley Marie Anne Baring 10 February 1858 No children 21 May 1882 aged 63 Augustus FitzRoy, 7th Duke of Grafton 1882–1918 22 June 1821 son of Henry FitzRoy, 5th Duke of Grafton and Mary Caroline Berkeley Anna Balfour 9 June 1847 4 children 4 December 1918 aged 97 Alfred FitzRoy, 8th Duke of Grafton 1918–1930 3 March 1850 son of Henry FitzRoy, 5th Duke of Grafton and Mary Caroline Berkeley Margaret Rose Smith 27 April 1875 3 children Susanna Mary Stewart 8 January 1916 2 children 10 January 1930 aged 80 John FitzRoy, 9th Duke of Grafton 1930–1936 1 August 1914 son of William Henry FitzRoy and Auriol Margaretta Brougham never married 4 August 1936 Euston Hall aged 22 Charles FitzRoy, 10th Duke of Grafton 1936–1970 4 June 1892 son of Charles Edward FitzRoy and Ismay FitzRoy Doreen Maria Buxton 24 January 1918 2 children Lucy Eleanor Barnes 6 October 1924 1 child Rita Carr-Ellison 18 July 1944 No children 11 November 1970 aged 78 Hugh FitzRoy, 11th Duke of Grafton 1970–present 3 April 1919 Cape Town son of Charles FitzRoy, 10th Duke of Grafton and Doreen Maria Buxton Fortune FitzRoy, Duchess of Grafton 12 October 1946 5 children === George FitzRoy, 1st Duke of Northumberland === Descendant Portrait Birth Marriages Death George FitzRoy, 1st Duke of Northumberland 1665–1716 28 December 1665 Oxford son of Charles II of England and Barbara Palmer, Countess of Castlemaine Catherine Wheatley 1686 No children Mary Dutton 1715 No children 28 June 1716 Epsom aged 51 == Child by Nell Gwyn == === Charles Beauclerk, 1st Duke of St Albans === Descendant Portrait Birth Marriages Death Charles Beauclerk, 1st Duke of St Albans 1670–1726 8 May 1670 son of Charles II of England and Nell Gwynne Diana de Vere 13 April 1694 8 children 10 May 1726 aged 56 Charles Beauclerk, 2nd Duke of St Albans 1726–1751 6 April 1696 son of Charles Beauclerk, 1st Duke of St Albans and Diana de Vere Lucy Werden 13 December 1722 2 children 27 July 1751 aged 55 George Beauclerk, 3rd Duke of St Albans 1751–1786 25 June 1730 son of Charles Beauclerk, 2nd Duke of St Albans and Lucy Werden Jane Roberts 23 December 1752 No children 1 February 1786 aged 56 George Beauclerk, 4th Duke of St Albans 1786–1787 5 December 1758 son of Col. Charles Beuclerk and Elizabeth Jones never married 10 February 1787 aged 29 Aubrey Beauclerk, 5th Duke of St Albans 1787–1789 3 June 1740 son of Vere Beauclerk, 1st Baron Vere and Mary Chambers Catherine Ponsonby 4 May 1763 5 children 4 September 1789 aged 49 Aubrey Beauclerk, 6th Duke of St Albans 1789–1815 21 August 1765 son of Aubrey Beauclerk, 5th Duke of St Albans and Catherine Ponsonby Mary Moses 9 July 1788 1 child Louisa Grace Manners 15 August 1802 1 child 12 August 1815 aged 50 Aubrey Beauclerk, 7th Duke of St Albans 1815–1816 7 April 1815 son of Aubrey Beauclerk, 6th Duke of St Albans and Louisa Grace Manners never married 19 February 1816 aged 10 months William Beauclerk, 8th Duke of St Albans 1816–1825 18 December 1766 son of Aubrey Beauclerk, 5th Duke of St Albans and Catherine Ponsonby Charlotte Thelwall 20 July 1791 No children Maria Janetta Nelthorpe 4 March 1799 7 children 17 July 1825 aged 59 William Beauclerk, 9th Duke of St Albans 1825–1849 24 March 1801 son of William Beauclerk, 8th Duke of St Albans and Maria Janetta Nelthorpe Harriet Mellon 16 June 1827 No children Elizabeth Catherine Gubbins 29 May 1839 2 children 27 May 1849 aged 48 William Beauclerk, 10th Duke of St Albans 1849–1898 15 April 1840 son of William Beauclerk, 9th Duke of St Albans and Elizabeth Catherine Gubbins Sybil Mary Grey 20 June 1867 3 children Grace Osborne 2 January 1874 5 children 10 May 1898 aged 58 Charles Beauclerk, 11th Duke of St Albans 1898–1934 26 March 1870 son of William Beauclerk, 10th Duke of St Albans and Sybil Mary Grey never married 19 September 1934 aged 64 Osborne Beauclerk, 12th Duke of St Albans 1934–1964 16 October 1874 son of William Beauclerk, 10th Duke of St Albans and Grace Osborne Beatrix Frances Petty-Fitzmaurice 19 August 1918 No children 2 March 1964 aged 90 Charles Beauclerk, 13th Duke of St Albans 1964–1988 16 August 1915 son of Aubrey Topham Beauclerk and Gwendolen Loftus Hughes Nathalie Chatham Walker 21 March 1938 1 child Suzanne Marie Adèle Fesq 19 March 1947 4 children 8 October 1988 aged 73 Murray Beauclerk, 14th Duke of St Albans 1988–present 19 January 1939 son of Charles Beauclerk, 13th Duke of St Albans and Nathalie Chatham Walker Rosemary Frances Scoones 31 January 1963 2 children Cynthia Theresa Howard 1974 No children == Child by Louise de Kérouaille == === Charles Lennox, 1st Duke of Richmond === Descendant Portrait Birth Marriages Death Charles Lennox, 1st Duke of Richmond 1672–1723 29 July 1672 son of Charles II of England and Louise de Kérouaille, Duchess of Portsmouth Anne Brudenell 10 January 1692 3 children 27 May 1723 aged 51 Charles Lennox, 2nd Duke of Richmond 1723–1750 18 May 1701 Goodwood son of Charles Lennox, 1st Duke of Richmond and Anne Brudenell Sarah Cadogan 4 December 1979 3 children 8 August 1750 Godalming aged 49 Charles Lennox, 3rd Duke of Richmond 1750–1806 22 February 1735 son of Charles Lennox, 2nd Duke of Richmond and Sarah Cadogan Mary Bruce 1 April 1757 No children 29 December 1806 aged 71 Charles Lennox, 4th Duke of Richmond 1806–1819 9 December 1764 Gordon Castle son of Lord George Lennox and Lady Louisa Kerr Charlotte Gordon 20 September 1768 14 children 28 August 1819 Canada aged 55 Charles Gordon-Lennox, 5th Duke of Richmond 1819–1860 3 August 1791 Richmond House son of Charles Lennox, 4th Duke of Richmond and Charlotte Gordon Lady Caroline Paget 6 June 1817 8 children 21 October 1860 London aged 69 Charles Gordon-Lennox, 6th Duke of Richmond 1860–1903 27 February 1818 Whitehall son of Charles Gordon-Lennox, 5th Duke of Richmond and Lady Caroline Paget Frances Harriett Greville 10 April 1817 8 children 27 September 1903 aged 85 Charles Gordon-Lennox, 7th Duke of Richmond 1903–1928 27 December 1845 Portland Place son of Charles Gordon-Lennox, 6th Duke of Richmond and Frances Harriett Greville Amy Mary Ricardo 10 November 1868 5 children Isabel Sophie Craven 3 July 1882 2 children 18 December 1928 Goodwood aged 83 Charles Gordon-Lennox, 8th Duke of Richmond 1928–1935 30 December 1870 son of Charles Gordon-Lennox, 7th Duke of Richmond and Amy Mary Ricardo Hilda Madeleine Brassey 8 June 1893 5 children 7 May 1935 aged 65 Frederick Gordon-Lennox, 9th Duke of Richmond 1935–1989 5 February 1904 son of Charles Gordon-Lennox, 8th Duke of Richmond and Hilda Madeleine Brassey Elizabeth Grace Hudson 15 December 1927 2 children 2 November 1989 aged 85 Charles Gordon-Lennox, 10th Duke of Richmond 1989–present 19 September 1929 son of Frederick Gordon-Lennox, 9th Duke of Richmond and Elizabeth Grace Hudson Susan Monica Grenville-Gray 26 May 1951 4 children == Child by Moll Davis == The two had one daughter; Lady Mary Tudor. Mary went on to marry Edward Radclyffe, 2nd Earl of Derwentwater; after Edward's death, she married Henry Graham, and upon his death she married James Rooke. == References == Category:House of Stuart",
 "title": "Descendants of Charles II of England"
}