{
 "id": "171481",
 "text": "The Drug Enforcement Administration (DEA) is a law enforcement agency that works for the United States Department of Justice that enforces the United States drug laws. The DEA is the agency with the most responsiblility for drug enforcement in the U.S. and also shares its responsibilities with the Federal Bureau of Investigation. It also has complete responsibility (duty to do something) for U.S. drug enforcement investigations in other countries. == History == The Drug Enforcement Administration was created on 1 July 1973, by Reorganization Plan No. 2 of 1973, signed by President Richard Nixon on 28 March 1973. It suggested a single federal agency to enforce the federal drug laws as well as to join together and to organize the government's drug control efforts. In 1999, the DEA opened the Drug Enforcement Administration Museum in Arlington, Virginia. In February 2003, the DEA started a Digital Evidence Laboratory in its Office of Forensic Sciences. == Organization == The DEA is run by an Administrator of Drug Enforcement who is given the job by the President of the United States and confirmed by the U.S. Senate. The Administrator's direct boss is the Attorney General through the Deputy Attorney General. It has its own training centre called the DEA Academy on the United States Marine Corps base at Quantico, Virginia with the FBI Academy. It has 21 domestic divisions inside the U.S. with 227 field offices and 86 foreign offices in 62 countries. With a budget of over 2.415 billion U.S. dollars, the DEA employs over 10,800 people, including over 5,500 Special agents. == Narcotics registration == The DEA has a system in place which allows doctors and other people, such as dentists, physician assistants, and nurse practitioners, to prescribe medicines, researchers and manufacturers access to \"Schedule I\" drugs, as well as Schedules 2, 3, 4 and 5. ==Related pages== * List of United States federal law enforcement agencies == References == == Other websites == * DEA official web site * The History of the DEA from 1973 to 1998 * List of former DEA Administrators * Agency of Fear - The History of the origins of the DEA in the Nixon White House * Results of Prohibition The financial costs of drug use and drug prohibition in the U.S., impact on levels of drug use and prices. * A response to the DEA web site * * Major Studies of Drugs and Drug Policy Full text of major government commission reports on the effects of drug enforcement * The Drug Hang-Up by Rufus King A history of the drug laws with special emphasis on the predecessors to the DEA * DEA Watch - A dissenting view of the DEA * Drug Enforcement Administration Meeting Notices and Rule Changes from The Federal Register RSS Feed * DEA Lookup.com Commercial DEA number database search service * Office of Diversion Control *Reorganization Plan No. 2 of 1973 - Appendix to Title 5, U.S. Code * Get Smart About Drugs - A DEA Resource for Parents * DEA Demand Reduction - Street Smart Prevention Category:1973 establishments in the United States Category:Federal law enforcement agencies of the United States Category:Drug control law",
 "title": "Drug Enforcement Administration"
}