{
 "id": "171432",
 "text": "Athelwulf, also spelled Æthelwulf or Ethelwulf (–858) was a West Saxon nobleman. He conquered the territories of Kent, Sussex and Essex for his father in 825. That same year he was appointed the king of Kent. In 839 he succeeded his father as King of Wessex. == Early career == Athelwulf was born . He was the oldest son of King Egbert of Wessex and his Frankish wife Redburga. He may have been born in Francia (France) while his father was in exile there.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 316 In 824 his father sent him at the head of an army into Kent.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 231 There Athelwulf drove Baldred, the Mercian puppet king, out of Kent. His father appointed Athelwulf King of Kent which included Essex, Surrey and Sussex. Athelwulf ruled as a sub-king of Wessex. ==King of Wessex== Athelwulf succeeded his father to the throne of Wessex in 839.Roger Collins, Early Medieval Europe, 300–1000, Second Edition (New York: St. Martin's Press, 1999), p. 195 His father Egbert had done everything he could so that his son would be king after him. He appointed Athelwulf his sub-king; ruler of the subordinate kingdom of Kent. This gave Athelwulf experience that made him the leading candidate for king after his father. In turn, Athelwulf did the same for his sons to insure they would follow him to the throne. One of the first things he did as king was to appoint his son Athelstan, King of Kent.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 236 Under Athelwulf's rule the ealdormen, the most important leaders after the king, became very important. In the 840s when viking raids became more frequent it was his ealdormen who led various local armies against the invaders. In 851 there were three large raids in southern England. The largest had over three hundred ships. They attacked at a place called Acleah in Surrey. Athelwolf and his son Athelbald met the Danes (vikings) in battle and defeated them. After this victory Athelwulf was considered the leading Anglo-Saxon king in England.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 245 In 852 Burghred of Mercia, a vassal king, asked for Athelwulf's help against Wales.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 317 Athelwulf did help and together they defeated Cyngen ap Cadell. Shortly afterward his daughter, Athelswith, became Burgred's wife and queen. By early 854 Athelwulf's wife, Osburgh, died. His eldest son Athelstan died about this same time.Eleanor Shipley Duckett, Alfred the Great: The King and His England (Chicago: University of Chicago Press, 1957), p. 36 In 855 Athelwulf went on a pilgrimage to Rome. He took his youngest son Alfred with him. He left the kingdom in the care of Athelbald, his second son. After spending a year in Rome he traveled to the court of Charles the Bald, King of the West Franks. There he spent the summer and fall of 856. In October 856 he wed the king's young daughter, Judith. She could not have been any older than thirteen at the time. The marriage was at best a diplomatic alliance. Both men were suffering from Viking attacks, and formed a common alliance. Charles insisted that his daughter be consecrated queen.Jennifer Ward, Women in England in the Middle Ages (London: Continuum International Publishing Group, 2006), p. 120 When Athelwulf returned to Wessex there was opposition to his remaining king. To avoid a civil war he agreed to take the sub-kingship of Kent, held by Ethelbald. He let Ethelbald become king of Wessex. Athelwulf died in 858 as the King of Kent. Ethelbald took his father's young wife Judith as his own wife, apparently without a major scandal. == Family == Athelwulf married Osburh, daughter of Oslac, Athelwulf's butler.Asser's Life of King Alfred, Trans. L.C. Jane (London: Chatto & Windus, 1926), p. 3 Together they had: * Ethelstan (died 851), King of Kent.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 78 * Ethelbald ( 834 - 860), King of Kent, King of Wessex. * Ethelbert (died 866), King of Wessex. * Ethelred ( 845/848 - 871), King of Wessex. * Alfred (849–899), King of Wessex, King of the Anglo-Saxons. * Ethelswith (died 888), 'Lady of Mercia', married Burghred, King of Mercia, at his death she ruled as Queen in her own right. * Judith, married Eticho, Count in Ammergau & Breisgau. ==Notes== ==References== == Other websites == * Britannia: Kings of Wessex Category:795 births Category:858 deaths Category:Kings of Wessex Category:People buried in Winchester Cathedral Category:People from Aachen",
 "title": "Athelwulf of Wessex"
}