{
 "id": "171575",
 "text": "Fire and Ice is the second book in the first series of Warriors: Warriors: The Prophecies Begin. It was written by Kate Cary under the pen name of Erin Hunter. The book was published by HarperCollins Publishers on 1 June 2003. The book takes place in a fictional forest populated by feral cats, who live in groups called Clans. The four Clans are ThunderClan, ShadowClan, WindClan, and RiverClan. The cats that live in these Clans call themselves warriors. == Plot summary == Fireheart and Graystripe, warriors of ThunderClan, must go on a journey to save WindClan, which was chased from its territory by ShadowClan. They succeed in doing this. Fireheart then receives his first apprentice (a cat he must train how to hunt and fight so that it can become a warrior). His apprentice's name is Cinderpaw. On a hunting trip with Cinderpaw and Graystripe, Graystripe falls into a river and almost drowns, but a RiverClan cat named Silverstream saves him. Over time, Graystripe and Silverstream fall in love and meet secretly (which is against the rules the Clans live by), much to Fireheart's dismay. Tigerclaw, a warrior of ThunderClan with evil plans, sets a trap by a road. He wants Bluestar, the leader of ThunderClan, to be hit by a car and die, so that he can become leader. However, Cinderpaw falls for this trap instead, and is hit by a car, which breaks her leg and gives her a permanent limp. She is prevented from becoming a warrior because of this. Fireheart later reunites with his sister, Princess, who is a house cat that lives with humans. She gives him her son, Cloudkit, who is taken into ThunderClan. Later, there is a battle against Brokenstar, the former leader of ShadowClan, who was exiled for committing crimes, and some of his followers. Brokenstar loses the battle, and he is blinded and taken prisoner by ThunderClan. It is revealed that Yellowfang, the medicine cat (healer) of ThunderClan, is his mother. The book ends with a battle against RiverClan and ShadowClan, who have allied in hopes of driving WindClan out again. ThunderClan fights on the side of WindClan. Fireheart is attacked by a RiverClan warrior named Leopardfur, and Tigerclaw doesn't help Fireheart. Fireheart later is unable to fight Silverstream, knowing how much she means to Graystripe. ThunderClan and WindClan win the battle. However, Tigerclaw and Fireheart are now suspicious of each other. Each one suspects the other of being a traitor. == References == Category:2003 books Category:Warriors books",
 "title": "Fire and Ice (Warriors)"
}