{
 "id": "172535",
 "text": "Stan Lee (born Stanley Martin Lieber ; December 28, 1922 – November 12, 2018) was an American comic book writer, editor, and publisher. Lee was known for being Marvel Comics' creative leader for almost 21 years. With his work alongside co-writer/artists Jack Kirby and Steve Ditko, he co-created many popular fictional characters, including superheroes Spider-Man, the X-Men, Iron Man, Thor, the Hulk, the Fantastic Four, Black Panther, Daredevil, Doctor Strange, Captain America, and Ant-Man. After he retired from Marvel in the 1990s, he was still the public face of the company, and made cameo appearances in movies based on Marvel characters. Meanwhile, he continued independent creative works into his 90s, until his death in 2018. Lee was added into the comic book industry's Will Eisner Award Hall of Fame in 1994 and the Jack Kirby Hall of Fame in 1995. He received the NEA's National Medal of Arts in 2008 from President George W. Bush. ==Early life== Lee was born on December 28, 1922, in Manhattan, New York City, in the apartment of his Romanian-born Jewish immigrant parents. His parents were Celia (née Solomon) and Jack Lieber, at the corner of West 98th Street and West End Avenue. His father, trained as a dress cutter, worked only sporadically after the Great Depression,Lee & Mair 2002, p. 5 His family moved further uptown in Manhattan, in Washington Heights, Manhattan. Lee had one younger brother named Larry Lieber. At an early age, Lee was inspired by books and movies, especially those with Errol Flynn playing heroic roles. By the time Lee was in his teens, the family was living in an apartment in The Bronx. Lee described it as \"a third-floor apartment facing out back\". Lee and his brother shared the bedroom, while their parents slept on a foldout couch. Lee attended DeWitt Clinton High School in the Bronx.Lee and Mair, p. 17 He enjoyed writing, and had dreams of one day writing the \"Great American Novel\". He said that in his youth he worked such part-time jobs as writing obituaries for newspapers for the National Tuberculosis Center. He delivered sandwiches for the Jack May pharmacy to offices in Rockefeller Center, worked at the Rivoli Theater on Broadway, and sold subscriptions to the New York Herald Tribune newspaper. He graduated from high school early in 1939 and joined the WPA Federal Theatre Project.Lee and Mair, p. 18 ==Early career== With the help of his uncle Robbie Solomon, Lee became an assistant in 1939 at the new Timely Comics division of pulp magazine and comic-book publisher Martin Goodman's company. By the 1960s, they would evolve into Marvel Comics. His first role in the comics were, as Lee described in 2009: \"In those days [the artists] dipped the pen in ink, [so] I had to make sure the inkwells were filled...I went down and got them their lunch, I did proofreading, I erased the pencils from the finished pages for them\". Lee made his comic-book debut with the text filler \"Captain America Foils the Traitor's Revenge\" in Captain America Comics #3 (May 1941). This is where he first used the pseudonym Stan Lee, which years later he would become his legal name. Lee later explained that he was so embarrassed that he used a pen name so that nobody would associate his real name with comics when he some day wrote the Great American Novel.The 'Amazing Fantastic Incredible' life of Stan Lee, now in comic form - MPR News Lee's first superhero co-creation was the Destroyer, in Mystic Comics #6 (August 1941). Other characters he co- created during this period, which was called the Golden Age of Comic Books, include Jack Frost and Father Time. In 1941, Lee, just under 19 years old, became interim editor.Sanderson \"1940s\" in Gilbert (2008), p. 19 He soon became the comic-book division's editor-in-chief, as well as art director for much of that time, until 1972, when he became publisher. Lee entered the United States Army in early 1942. He was a member of the Signal Corps, repairing telegraph poles and other communications equipment. He was later transferred to the Training Film Division, where he worked writing manuals, training movies, slogans, and cartooning. The army classified Lee as a \"playwright\", making him one of the nine men in the U.S. Army were given that title. Lee returned from his World War II military service in 1945. In the mid-1950s, the company was known as Atlas Comics, Lee wrote stories of many genres including romance, Westerns, humour science fiction, medieval adventure, horror and suspense. By the end of the decade, Lee was not happy with his career and thought about quitting the field. ==Marvel Comics== In the late 1950s, DC Comics created the Justice League making comic book superheros more popular. In response, publisher Lee was hired to come up with a new superhero team. Lee's wife, Joan, said that he experiment with stories he liked, since he was planning on changing careers and had nothing to lose. Lee followed his wife's advice and created a set of heroes with character flaws because many heroes before were seen as nearly perfect beings.Noted comic-book writer Alan Moore described the significance of this new approach in a radio interview on the BBC Four program Chain Reaction, transcribed at The first superheroes Lee and artist Jack Kirby created together were the Fantastic Four. They became popularDeFalco, Tom \"1960s\" in Gilbert (2008), p. 84: \"It did not take long for editor Stan Lee to realize that The Fantastic Four was a hit...the flurry of fan letters all pointed to the FF's explosive popularity.\" which led Lee and Marvel's illustrators to create new heroes. Again working with Kirby, Lee co-created the Hulk,DeFalco \"1960s\" in Gilbert (2008), p. 85: \"Based on their collaboration on The Fantastic Four, [Stan] Lee worked with Jack Kirby. Instead of a team that fought traditional Marvel monsters however, Lee decided that this time he wanted to feature a monster as the hero.\" Thor,DeFalco \"1960s\" in Gilbert (2008), p. 88: \"[Stan Lee] had always been fascinated by the legends of the Norse gods and realized that he could use those tales as the basis for his new series centered on the mighty Thor...The heroic and glamorous style that...Jack Kirby [had] was perfect for Thor.\" Iron Man,DeFalco \"1960s\" in Gilbert (2008), p. 91: \"Set against the background of the Vietnam War, Iron Man signaled the end of Marvel's monster/suspense line when he debuted in Tales of Suspense #39...[Stan] Lee discussed the general outline for Iron Man with Larry Lieber, who later wrote a full script for the origin story.\" and the X-Men;DeFalco \"1960s\" in Gilbert (2008), p. 94: \"The X-Men #1 introduced the world to Professor Charles Xavier and his teenage students Cyclops, Beast, Angel, Iceman, and Marvel Girl. Magneto, the master of magnetism and future leader of the evil mutants, also appeared.\" with Bill Everett, Daredevil;DeFalco \"1960s\" in Gilbert (2008), p. 100: \"Stan Lee chose the name Daredevil because it evoked swashbucklers and circus daredevils, and he assigned Bill Everett, the creator of the Sub-Mariner to design and draw Daredevil #1.\" and with Steve Ditko, Doctor StrangeDeFalco \"1960s\" in Gilbert (2008), p. 93: [Stan Lee] decided his new superhero feature would star a magician. Since Lee was enjoying his collaborations with Steve Ditko on The Amazing Spider-Man, he decided to assign the new feature to Ditko, who usually handled at least one of the backups in Strange Tales. and Marvel's most successful character, Spider-Man.DeFalco \"1960s\" in Gilbert (2008), p. 87: \"Deciding that his new character would have spider-like powers, [Stan] Lee commissioned Jack Kirby to work on the first story. Unfortunately, Kirby's version of Spider-Man's alter ego Peter Parker proved too heroic, handsome, and muscular for Lee's everyman hero. Lee turned to Steve Ditko, the regular artist on Amazing Adult Fantasy, who designed a skinny, awkward teenager with glasses.\" As a result, Lee created a shared universe between the fictional heroes.Wright, p. 218 Lee and Kirby combined several of their newly created characters together into the team title The Avengers.DeFalco \"1960s\" in Gilbert (2008), p. 94: \"Filled with some wonderful visual action, The Avengers #1 has a very simple story: the Norse god Loki tricked the Hulk into going on a rampage ... The heroes eventually learned about Loki's involvement and united with the Hulk to form the Avengers.\" Lee's revolution extended beyond the characters and storylines to the way in which comic books engaged the readership and built a sense of community between fans and creators. He introduced the practice of regularly including a credit panel on the splash page of each story, naming not just the writer and penciller but also the inker and letterer. Regular news about Marvel staff members and upcoming storylines was presented on the Bullpen Bulletins page, which (like the letter columns that appeared in each title) was written in a friendly, chatty style. Lee remarked that his goal was for fans to think of the comics creators as friends, and considered it a mark of his success on this front that, at a time when letters to other comics publishers were typically addressed \"Dear Editor\", letters to Marvel addressed the creators by first name (e.g. \"Dear Stan and Jack\"). Abstract only; full article requires payment or subscription In the 1960s, Lee wrote, drew and edited most of Marvel's series and wrote a monthly column called \"Stan's Soapbox\". He wrote endless promotional copy, often signing off with his trademark motto, \"Excelsior!\". Lee would brainstorm a story with the artist and then prepare a short synopsis rather than a full script. Based on the synopsis, the artist would fill the number of pages left by determining and drawing the panel-to-panel storytelling. After Ditko's left Marvel in 1966, John Romita Sr. became Lee's collaborator on The Amazing Spider-Man. Within a year, it overtook Fantastic Four to become the company's top seller. Lee and Romita's stories focused as much on the social and college lives of the characters as they did on Spider-Man's adventures. The stories talked about issues at the time such as the Vietnam War,Manning \"1960s\" in Gilbert (2012), p. 39: The Amazing Spider-Man #47 (April 1967) \"Kraven's latest rematch with Spidey was set during a going-away party for Flash Thompson, who was facing the very real issue of the Vietnam War draft.\" political elections,Manning \"1960s\" in Gilbert (2012), p. 43: The Spectacular Spider-Man #1 (July 1968) \"Drawn by Romita and Jim Mooney, the mammoth 52-page lead story focused on corrupt politician Richard Raleigh's plot to terrorize the city.\" and student activism.Manning \"1960s\" in Gilbert (2012), p. 46: The Amazing Spider-Man #68 (January 1969) \"Stan Lee tackled the issues of the day again when, with artists John Romita and Jim Mooney, he dealt with social unrest at Empire State University.\" Lee created the Black Panther, an African king who would be mainstream comics' first black superhero.DeFalco \"1960s\" in Gilbert (2008), p. 117: Stan Lee wanted to do his part by co-creating the first black super hero. Lee discussed his ideas with Jack Kirby and the result was seen in Fantastic Four #52. Lee and artist John Buscema created The Silver Surfer series in August 1968.DeFalco \"1960s\" in Gilbert (2008), p. 131: \"When Stan Lee was told to expand the Marvel line, he immediately gave the Surfer his own title...Since Jack Kirby had more than enough assignments, Lee assigned John Buscema the task of illustrating the new book.\"Daniels, p. 139: \"Beautifully drawn by John Buscema, this comic book represented an attempt to upgrade the medium with a serious character of whom Lee had grown very fond.\" The following year, Lee and Gene Colan created the Falcon, comics' first African-American superhero in Captain America #117 (September 1969).DeFalco \"1960s\" in Gilbert (2008), p. 137: \"The Black Panther may have broken the mold as Marvel's first black superhero, but he was from Africa. The Falcon, however, was the first black American superhero.\" Then in 1971, Lee helped change the Comics Code.Wright, p. 239 The U. S. Department of Health, Education and Welfare had asked Lee to write a comic-book story about the dangers of drugs. As a result, Lee created a three-issue story in The Amazing Spider-Man #96–98 (cover-dated May–July 1971), in which Peter Parker's best friend becomes addicted to prescription drugs. The Comics Code Authority did not approve of this because the stories depicted drug use. However, Lee had the story published without the seal of approval from the authority. The comics sold well and Marvel had positive reviews for its focus on mature social issues. Lee supported using comic books to criticize social events about the real world, often talking about racism and bigotry. Biography linked to NEA press release \"White House Announces 2008 National Medal of Arts Recipients\", August 26, 2009. In 1972, Lee stopped writing monthly comic books to become publisher. His final issue of The Amazing Spider-Man was #110 (July 1972)Manning \"1970s\" in Gilbert (2012), p. 61: \"Stan Lee had returned to The Amazing Spider-Man for a handful of issues after leaving following issue #100 (September 1971). With issue #110. Lee once again departed the title into which he had infused so much of his own personality over his near 10-year stint as regular writer.\" and his last Fantastic Four was #125 (August 1972).Sanderson \"1970s\" in Gilbert (2008), p. 157 ==Later career== Lee became a public face for Marvel Comics. He made appearances at comic book conventions around America, teaching at colleges and participating in panel discussions. Lee created the Spider-Man newspaper comic strip on January 3, 1977.Saffel, \"An Adventure Each Day\", p. 116: \"On Monday January 3, 1977, The Amazing Spider-Man comic strip made its debut in newspapers nationwide, reuniting writer Stan Lee and artist John Romita.\" Lee's final work with Jack Kirby, The Silver Surfer: The Ultimate Cosmic Experience, was published in 1978.Sanderson \"1970s\" in Gilbert (2008), p. 187: \"[In 1978], Simon & Schuster's Fireside Books published a paperback book titled The Silver Surfer by Stan Lee and Jack Kirby...This book was later recognized as Marvel's first true graphic novel.\" Lee and John Buscema produced the first issue of The Savage She-Hulk (February 1980).DeFalco \"1980s\" in Gilbert (2008), p. 197: \"With the help of artist John Buscema, [Stan] Lee created Jennifer Walters, the cousin of Bruce Banner.\" Lee moved to California in 1981 to work on Marvel's television and movie properties. Lee was briefly president of the entire company, but soon stepped down to become publisher instead. Lee said that being president of the company was too much about numbers and finance and not enough about the creative process he enjoyed. Lee stepped away from regular duties at Marvel in the 1990s. He continued to receive an annual salary of $1 million as Chairman Emeritus. In 1998 he and Peter Paul began a new Internet-based superhero creation, production, and marketing studio, Stan Lee Media. After legal issues, Stan Lee Media filed for bankruptcy in February 2001. Following the success of Fox Studio's 2000 X-Men movie and Sony's then-current Spider-Man movie, Lee sued Marvel in 2002. He sued company because he believed they failed to pay him the 10% he was due under the terms of his contract for movies featuring the characters he had co-created. They settled in 2005 for an unknown amount of money. At the 2012 San Diego Comic-Con International, Lee announced his YouTube channel, Stan Lee's World of Heroes, which airs programs created by Lee, Mark Hamill, Peter David, Adrianne Curry and Bonnie Burton, among others. Lee wrote the book Zodiac, released in January 2015, with Stuart Moore. At the 2016 Comic-Con International, Lee introduced his digital graphic novel Stan Lee's God Woke. Additional on December 22, 2016. (WebCitation page requires text-blocking to make text visible) The print-book version won the 2017 Independent Publisher Book Awards' Outstanding Books of the Year Independent Voice Award. Lee was an executive producer on most Marvel movie and television shows beginning with the 1990 direct-to-video Captain America movie. He had cameo appearances in many Marvel movies and television shows, especially those within the Marvel Cinematic Universe. ==Personal life== In a 2002, survey of whether he believed in God, he said: \"Well, let me put it this way... [Pauses.] No, I'm not going to try to be clever. I really don't know. I just don't know\".Lee in From 1945 to 1947, Lee lived in Manhattan. He married Joan Clayton Boocock on December 5, 1947,Lee, Mair, p. 69 and in 1949, the couple bought a house on Long Island, living there through 1952. Their daughter Joan Celia \"J. C.\" Lee was born in 1950. Another child, daughter Jan Lee, died three days after delivery in 1953.Lee, Mair, p. 74 Lee lived in the Long Island town of Hewlett Harbor, New York, from 1958 to 1980. They also owned a condominium in Manhattan from 1975 to 1980. He moved in Los Angeles in 1981, they bought a home in West Hollywood, California. In September 2012, Lee had surgery to add a pacemaker. On July 6, 2017, his wife of 69 years, Joan, died of complications from a stroke, aged 95. In April 2018, The Hollywood Reporter said that Lee was a victim of elder abuse. == Death == Lee died at the age of 95 on November 12, 2018 at Cedars-Sinai Medical Center in Los Angeles, California. The cause was respiratory and congestive heart failure. Earlier that year, Lee publicly said that he had pneumonia in February and was rushed to the hospital for worsening conditions at around the same time. ==Awards== Year Award Nominated work Result 1974 Inkpot Award rowspan=\"5\" 1994 The Will Eisner Award Hall of Fame 1995 Jack Kirby Hall of Fame 2002 Saturn Award The Life Career Award 2008 National Medal of Arts 2009 Hugo Award Hugo Award for Best Dramatic Presentation- Iron Man rowspan=\"1\" Scream Awards Comic-Con Icon Award rowspan=\"6\" 2011 Hollywood Walk of Fame 2012 Visual Effects Society Awards Lifetime Achievement Award Producers Guild of America Vanguard Award 2017 National Academy of Video Game Trade Reviewers Performance in a Comedy, Supporting ==More reading== * * * ==References== ==Other websites== * * Stan Lee at the Unofficial Handbook of Marvel Comics Creators * * * Stan Lee at Web of Stories * The Last Word – Video (05:26) (New York Times; November 12, 2018) * Category:1922 births Category:2018 deaths Category:Deaths from congestive heart failure Category:Deaths from respiratory failure Category:American comics writers Category:American movie actors Category:American television actors Category:American voice actors Category:American comics artists Category:American video game actors Category:American autobiographers Category:American novelists Category:American military personnel of World War II Category:American editors Category:Marvel Comics Category:American television writers Category:Actors from New York City Category:Movie producers from New York City Category:Screenwriters from New York City Category:Businesspeople from New York City Category:Television personalities from New York City Category:Writers from New York City Category:Military people from New York (state) Category:Comics creators",
 "title": "Stan Lee"
}