{
 "id": "172538",
 "text": "Reinhard Tristan Eugen Heydrich (born ; 7 March 1904 ; Halle an der Salle,Prussia, Germany- died ; 4 June 1942 ; Prague,Nazi-German Occupied Czechoslovakia). He was a high-ranking German Nazi SS-Gestapo officer before and during World War 2. Heydrich was an officer in the German Navy of the Reichswehr from 1922 to 1931 when he was expelled. He later became the most and feared Nazi officer in the SS Paramilitary and the Gestapo Secret Police in Germany. Like other members of the SS, Reinhard Heydrich wore black from 1933-1939, grey from 1938-1942 and feldgrau (gray-green from 1941-1942. He also wore blue in the Wehrmacht’s Luftwaffe Air Force from 1935-1941. His enemies in Czechoslovakia gave him various nicknames: (The Hangman, The Butcher of Prague, The Blond Beast, Himmler's Evil Genius, Young Evil God Of Death). Adolf Hitler called him \"The Man With The Iron Heart\". He executed Jewish people and children. He ordered the Waffen-SS and the Einsatzgruppen to execute people in Prague,Czechoslovakia (Today : Czech Republic). He also ordered Adolf Eichmann to organise transport during the Holocaust. His younger brother, Heinz Heydrich, a journalist, helped many Jews to escape the Holocaust after Reinhard's death. == Biography == In 1922 he joined the Reichsmarine, the German Navy of the Weimar Era. Early in 1931 he was dismissed from the Reichswehr’s Navy by Admiral Erich Raeder for ungentlemanly behavior, namely breech of promise to marry. He had already met another woman, a Nazi who could get him a job with the Nazi Party. As soon as he was out of the Navy he joined the party and soon joined the SS (led by Heinrich Himmler). Later that year, he married his Nazi girlfriend. He also joined the Gestapo in 1933 when Adolf Hitler came to power and the Luftwaffe later. In June 1934 he was involved in Night of the Long Knives (1934) to kill Ernst Röhm the head of the SA and was promoted the Head Of The Gestapo afterwards. He was also involved in the Spanish Civil War in 1936-1939 in the Luftwaffe and as well as Night Of The Broken Glass (1938) after Anschluss (1938). During World War II he was involved in the Invasion of Poland (1939) and the German Invasion Of Denmark and Norway in 1940 and the Battle of France. He flew a fighter plane in Operation Barbarossa (1941) but was shot down by Soviet Anti-aircraft warfare. Lastly, he was sent to Prague to execute people and crush the Czech resistance in Prague. Heydrich became German SS-Obergruppenführer (General) of the Sicherheitsdienst in 1933 .The SD was the security and intelligence section of the Gestapo. He was the head of the RSHA, which included the police and the Gestapo in 1941 .Clark, Alan 1960. Barbarossa. London: Weidenfeld & Nicolson, p470. He was one of those responsible for the Holocaust in 1941. == Assassination == In 1941 Hermann Göring gave Heydrich the order to arrange the \"Final Solution\". Heydrich also governed Bohemia and Moravia. He was attacked in Prague on 27 May 1942 by Czech and Slovak soldiers trained by the British Special Operations Executive (SOE). They had been sent (with a small support team) by the Czechoslovak government-in-exile. Heydrich died a week later in the hospital from sepsis caused by his injuries. Afterwards the Germans killed the male population of the village Lidice for helping the assassins. Ernst Kaltenbrunner replaced Heydrich after his death. Reinhard Heydrich was depicted in fiction: * Hangmen Also Die (1943) * The Man With The Iron Heart (2017) * Conspiracy (2001 Film) * Anthropoid (2016 Film) * Lidice (2011 Film) and * the TV series The Man In The High Castle. == References == Category:1904 births Category:1942 deaths Category:Assassinated German politicians Category:Directors of the Reichssicherheitshauptamt Category:Former Roman Catholics Category:German aviators Category:German military personnel of World War II Category:German war criminals Category:Gestapo people Category:Holocaust perpetrators Category:Members of the Reichstag (Nazi Germany) Category:Military people killed in World War II Category:Nazi leaders Category:People from Halle, Saxony-Anhalt Category:Politicians from Saxony- Anhalt Category:Politicians of the Nazi Party Category:SS officers",
 "title": "Reinhard Heydrich"
}