{
 "id": "172631",
 "text": "Helena Bonham Carter CBE (born 26 May 1966) is an Oscar-nominated British actress. She is famous for her appearances in blockbuster movies and period dramas. Bonham Carter is also known for appearing in many movies alongside Tim Burton (her ex-partner) and Johnny Depp. She made her first appearance on screen in the K.M. Peyton movie, A Pattern of Roses, before appearing in her first starring role in Lady Jane. Some of her most famous roles include: Marla Singer in the movie Fight Club, Bellatrix Lestrange in four Harry Potter movies, Elizabeth, the Queen Mother in The King's Speech, the Red Queen in Alice in Wonderland and Princess Margaret in The Crown. She was made Commander of the Order of the British Empire (CBE) in the 2012 New Year Honours for services to drama. == Early life == Bonham Carter was born on 26 May 1966 in Golders Green, London, England. Her mother, Elena, is a psychotherapist. Her father, Raymond Bonham Carter, was a banker and his maternal grandfather was H. H. Asquith, a former Prime Minister of the United Kingdom. Helena Bonham Carter's maternal grandfather, Eduardo Propper de Callejón, was half Spanish and half Jewish. Carter has two brothers: Edward and Thomas. She is a distant cousin of fellow actor, Crispin Bonham-Carter, who played Mr. Bingley in the BBC's production of Pride and Prejudice in 1995. Carter is related to Jane Bonham Carter, the Baroness of Yarnbury. Carter attended the South Hampstead High School, a girls' school, in Hampstead, London. She later went to Westminster School near the Palace of Westminster. She was rejected from King's College, Cambridge University because they feared she would leave mid- year to follow her acting career.The Scotsman, 23 July 2005, Gillian Welsh, \"Scruffs up nicely\" After the rejection, Carter decided to fully concentrate on acting instead of going to school. Carter speaks French fluently. When Carter was five years old, her mother had a serious mental breakdown, which took her three years to recover from. After recovery, Carter's mother decided to become a psychotherapist. Carter now pays her mother to read scripts and provide her opinion of the characters' psychological motivations.\"'English rose' blossoms into other roles,\" Liam Lacey, 18 January 1996, The Globe and Mail, D1 A few years after her mother's recovery, Carter's father became deaf in one ear while on holiday in Greece. He was diagnosed with acoustic neuroma, and underwent an operation to remove a benign tumor. However, the surgery went very wrong; after 9 hours in surgery, Raymond, at 50 years of age, had a stroke that left him half-paralyzed and confined to a wheelchair.\"How Helena Grew Up In a Violet Shadow,\" Valerie Grove, The Times, 10 May 1996 With Carter's two older brothers away at college, she alone was left to help her mother deal with issues. == Career == Bonham Carter has not received any formal training in acting. In 1979 she won a national writing contest and used the prize money to pay for her entry into the actors directory 'Spotlight'. She made her first appearance at the age of 16 in a television commercial. She also had a minor part in a TV movie, A Pattern of Roses in 1983. Her first starring role was in Lady Jane in 1984, which received mix reviews. She played the Queen of England when she was cast as Anne Boleyn in the ITV1 mini-series, Henry VIII. She was restricted in acting since she was pregnant with her first child at the time of filming. Her breakthrough performance was in A Room with a View in 1985, when she played Lucy Honeychurch. Carter also appeared in episodes of Miami Vice as Don Johnson's love interest during the 1986-87 season. She auditioned for the role of Nancy Spungen in Sid and Nancy in 1986, but lost the role to Chloe Webb. These early roles led her to be typecast as a \"corset queen\", and \"English rose.\" She expanded her acting range in more recent movies like Fight Club, Wallace & Gromit: The Curse of the Were-Rabbit, and in Tim Burton's Charlie and the Chocolate Factory, Corpse Bride, Big Fish, and Sweeney Todd. Bonham Carter played Bellatrix Lestrange in Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, and Harry Potter and the Deathly Hallows parts 1 and 2. She received good reviews as Lestrange, as she was described as a \"shining but underused talent.\" She then played Mrs. Lovett in Sweeney Todd, which was also released in 2007. In May of 2006, Bonham Carter launched her own fashion line called, \"The Pantaloonies,\" with swimwear designer Samantha Sage. The first collection is called \"Bloomin' Bloomers\" and is a Victorian style selection of camisoles, mop caps and bloomers. The two are now working on Pantaloonies customized jeans which Carter describes as \"a kind of scrapbook on the bum.\" Carter plans to return to the West End with an appearance in \"Rubenstein's Kiss.\" However, the play was delayed because of her busy schedule. The production was set to open in November of 2004 but was postponed. In September 2008, Wild Target director, Johnathan Lynn, confirmed that Carter had dropped out of his movie due to filming difficulties. He then went on to say that she had joined the cast of Tim Burton's 2010 movie, Alice in Wonderland, where she portrayed the Red Queen. In that movie, she starred with actors Johnny Depp, Anne Hathaway, Christopher Lee, and Alan Rickman (who also co-starred in the Harry Potter films with her). Bonham Carter and Hathaway played two dueling sisters, the Red and White Queens. In early 2009, Bonham Carter was named on of The Times newspaper's top 10 British Actresses of all-time. She appeared on the list with fellow British actresses Julie Andrews, Helen Mirren, Judi Dench, and Audrey Hepburn. Bonham Carter played well-known author Enid Blyton in the BBC4 TV biography movie, Enid, showing the author's life. This movie aired on 16 November 2009. Carter starred with Matthew Macfadyen and Denis Lawson. == Personal life == In October of 2001, Bonham Carter began her current relationship with director Tim Burton. She met Burton while he was engaged to and living with actress Lisa Marie. Bonham Carter and Burton met while filming Planet of the Apes. Burton tends to cast Bonham Carter in many of his movies. The couple lives in Belsize Park, London, England, in next-door houses with a hallway connecting the two homes. Each house is decorated to fit their own tastes and personality, because they felt the could not live 'together' but did not want to live apart. They purchased the house when Bonham Carter became pregnant with the couple's first child, a son named Billy Ray Burton, who was born on 4 October 2003.\"Helena Bonham Carter- Biography\". Yahoo.com. Retrieved 7 May 2012 The couple maintain a close relationship with actor Johnny Depp, who also regularly appears in Burton's movies. Depp is Billy Ray's godfather. At the age of 41, Bonham Carter gave birth to the couple's second child, a daughter named Nell Burton, who was born on 15 December 2007 in Central London. Bonham Carter says she named her daughter Nell after all the \"Helens\" in her family's past. In 2008, four of her relatives were killed in a safari bus crash in South Africa. She was given indefinite leave from filming Terminator Salvation, and returned later to complete the rest of the filming. Also in 2008, Carter and Burton both put up their American apartments for sale. The apartments are located in the Greenwich Village in New York City. The apartments were sold for $8.75 million. In October of 2008, it was released that Bonham Carter had become a patron of the charity, \"Action Duchenne\"\"Action Duchenne patron honoured with CBE\" . Action Duchenne. Retrieved 7 May 2012 the national charity established to support parents and sufferers of Duchenne Muscular Dystrophy. She released the statement: In December of 2008, Bonham Carter used her voice in a MTV domestic violence public service announcement (PSA), reciting a passage about love from the book of Corinthians in the Bible. The 60-second commercial features a troubled couple in a domestic environment. The commercial is silent except for Carter's voice and accompanying music. She recorded her voice in a single take for the ad, which aired on 2 December 2008 on MTV in the UK and Europe as a part of MTV's Staying Alive campaign. MTV will also make the ad available online, and is considering playing it in movie theaters. In early 2009, Bonham Carter joined fellow actors Ewan McGregor, Kate Winslet, Liam Neeson, Helen Mirren and others, in leaving an imprint of her lips on a card and signing it. The kiss prints, which were featured in the window of Newcastle's Fenwick store, will be auctioned off for a charity. In 2019, Bonham Carter began dating academic Rye Dag Holmboe == Filmography == === Movies === Year Title Role Notes 1983 A Pattern of Roses Netty 1985 A Room with a View Lucy Honeychurch 1986 Lady Jane Lady Jane Grey 1987 Maurice Lady at Cricket Match Cameo A Hazard of Hearts Serena Staverley 1988 The Mask Iris Six Minutes with Ludwig The Star 1989 Francesco Chiara Offreduccio Getting It Right Lady Minerva Munday 1990 Hamlet Ophelia The Early Life of Beatrix Potter Beatrix Potter 1991 Where Angels Fear to Tread Caroline Abbott Brown Bear's Wedding White Bear (voice) 1992 Howards End Helen Schlegel 1994 Mary Shelley's Frankenstein Elizabeth Frankenstein Fatal Deception: Mrs. Lee Harvey Oswald Marina Oswald Butter Dorothy Short film 1995 Mighty Aphrodite Amanda Weinrib Margaret's Museum Margaret MacNeil Jeremy Hardy Gives Good Sex Herself (voice) 1996 Twelfth Night: Or What You Will Olivia Portraits chinois Ada French-language role 1997 The Wings of the Dove Kate Croy Keep the Aspidistra Flying Rosemary The Petticoat Expeditions Narrator (voice) 1998 Sweet Revenge Karen Knightly Also known as The Revengers' Comedies The Theory of Flight Jane Thatchard 1999 Carnivale Milly (voice) Fight Club Marla Singer Women Talking Dirty Cora The Nearly Complete and Utter History of Everything Lily 2001 Planet of the Apes Ari Novocaine Susan Ivey Football Mum Short film 2002 The Heart of Me Dinah Till Human Voices Wake Us Ruby 2003 Big Fish Jennifer Hill / The Witch 2004 Lemony Snicket's A Series of Unfortunate Events Beatrice Baudelaire Uncredited cameo 2005 Charlie and the Chocolate Factory Mrs. Bucket Conversations with Other Women Woman Wallace & Gromit: The Curse of the Were-Rabbit Lady Tottington (voice) Corpse Bride Emily, the Corpse Bride (voice) 2006 Sixty Six Esther Reubens 2007 Sweeney Todd: The Demon Barber of Fleet Street Mrs. Lovett Harry Potter and the Order of the Phoenix Bellatrix Lestrange 2009 Harry Potter and the Half-Blood Prince Bellatrix Lestrange Terminator Salvation Dr. Serena Kogan / Skynet The Gruffalo Mother Squirrel (voice) Short film 2010 Alice in Wonderland Red Queen / Iracebeth of Crims The King's Speech Queen Elizabeth Harry Potter and the Deathly Hallows – Part 1 Bellatrix Lestrange 2011 Harry Potter and the Deathly Hallows – Part 2 Bellatrix Lestrange The Gruffalo's Child Mother Squirrel (voice) Short film 2012 Dark Shadows Dr. Julia Hoffman A Therapy Patient Short film Great Expectations Miss Havisham Les Misérables Mme. Thénardier 2013 The Lone Ranger Red Harrington The Young and Prodigious T.S. Spivet Dr. Clair 2014 Night Will Fall Narrator Documentary film 2015 Cinderella The Fairy Godmother Suffragette Edith Ellyn 2016 Alice Through the Looking Glass Red Queen / Iracebeth of Crims 2017 Poles Apart Nanuk (voice) Short film 55 Steps Eleanor Riese 2018 Sgt. Stubby: An American Hero Margaret Conroy (voice) Ocean's 8 Rose Weil 2020 Dragonheart: Vengeance Siveth (voice) Direct-to-video Tintoretto: A Rebel in Venice Narrator Documentary film Enola Holmes Eudoria Holmes 2022 The House Jen (voice) Enola Holmes 2 Eudoria Holmes Three Minutes: A Lengthening Narrator === TV shows === Year Show Role Other notes 1987 Miami Vice Dr. Theresa Lyons Two Episodes — Theresa & Savage 1991 Jackanory Reader Five Episodes — The Way to Sattin Shore (1–5) 1994 Absolutely Fabulous Dream Saffron One Episode — Hospital 1996 The Great War and the Shaping of the 20th Century Vera Brittain Unknown Episodes 2011 Life's Too Short Herself Cameo 2016 Love Nina Georgia 5 episodes 2019 The Crown Margaret 2021 The Cleaner Sheila 1 Episode 2022 Harry Potter 20th Anniversary Herself Documentary === Stage productions and radio shows === Year Production Role Other notes 1985 The Reluctant Debutante Unknown Performed on BBC Radio 4 1987 The Tempest Unknown Performed at Oxford Playhouse 1988 The Woman in White Laura Fairlie Performed at Greenwich Theatre, London 1989 The Happiest of All Princesses Unknown Performed on BBC Radio 4 The Chalk Garden Unknown Performed at Windsor/Yvonne Arnaud Theatre, Guildford 1991 The House of Bernarda Alba Magdalena Performed at Nottingham Playhouse 1992 The Barber of Seville Rosina Performed at Palace Theatre, Watford Trelawney of the Wells Imogen Parrot Performed at Comedy Theatre, London 1993 The Secret Garden Narrator by Frances Burnett The Whales' Song Narrator by Dyan Sheldon 1994 The Seagull Nina Mikhailovna Zarechnaya Performed on BBC Radio 4 A Dog So Small Narrator by Philippa Pearce The Way to Sattin Shore Narrator by Philippa Pearce 1995 Song of Love Unknown Performed on BBC Radio 4 Remember Me Narrator 1996 I Capture the Castle Rose Performed on BBC Radio 4 1997 A House by the Sea Unknown Performed on BBC Radio 4 The Diary of Anne Frank Narrator 1998 Lantern Slides Violet Bonham Carter Performed on BBC Radio 4 2000 As You Like It Rosalind Performed on BBC Radio 4 2004 The Rubenstein Kiss Unknown Postponed 2010 Private Lives Amanda Performed on BBC Radio 4 === Video games === Year Game Role Other notes 2005 Wallace & Gromit: The Curse of the Were- Rabbit Lady Campanula Tottington 2008 Fable II Daphne / Kamilla ==References== Category:1966 births Category:Living people Category:Actors from London Category:British movie actors Category:British radio actors Category:British stage actors Category:British television actors Category:British voice actors Category:People educated at Westminster School, London",
 "title": "Helena Bonham Carter"
}