{
 "id": "172940",
 "text": "Austria national football team is the national football team of Austria. It is controlled by the Austrian Football Association (German: Österreichischer Fußballbund - ÖFB). ==History before the Second World War== The first official match took place on 12th October 1902 in Vienna when a team from Cisleithanien (Austrian part of the Austrian-Hungary Empire) played versus Hungary. (5:0) The team reached in the 1930s the best time. It was the time of the so-called \"Wunderteam\" (miracle team) when Austria was one of the leading teams in Europe. The Wunderteam was the first from the continent to defeat Scotland. In 1934 the team was took part in the FIFA world cup for the first time and reached the 4th place. 1936 Austria won the silver medal at the Olympic games in Berlin. Due to the occupation through Germany in 1938 there was no team between 1938 and 1945. The national team was dissolved and the players like Matthias Sindelar became part of the German team. ==1945 to 1962== Soon after the end of the war the Austrian team played their first matches versus Hungary in Budapest. On December 6th, 1945 the first homematch took place in the renovated Praterstadion (now Ernst-Happel-Stadion). France was beaten by 4:1. Soon Austria was as successful as before the war. In 1951 Scotland was beaten in his own stadium by 1:0. Austria was the first team from the continent to do so. The FIFA World cup 1954 was the most successful ever. A legendary match was the quarterfinal against Switzerland which won Austria 7:5. It is still till today the Worldcup match with the most goals scored. Austria reached the semifinals and was beaten by the later world champion Germany by 1:6. The match for the 3rd place was won by 3:1 versus Uruguay. Players like Gerhard Hanappi, Walter Zeman and Ernst Ocwirk were playing in the FIFA world team. A 0:6 versus the Czech team marked the end of Austrias golden periode. ==1962 to present== The next years Austria was an average team but surprised through notable wins. On was on 20 October 1965 when Austria won in England 3:2. Austria was the third team to do so. In the same year however Austria failed to qualify for the 1966 World Cup. Also the qualification for 1970 was a failure. The qualification for 1974 was missed after a 1:2 versus Sweden in a decider. After 20 years Austria could qualify for the 1978 FIFA World Cup. The last match versus Turkey was won 1:0 through a goal by the later team coach Herbert Prohaska. In the tournament Austria won the groupstage. But after two lost matches versus Netherlands and Italy they failed to reach the final round. The last match was versus Germany in Cordoba. Austria won 3:2 through two goals by Hans Krankl and an own goal by Bertie Vogts. In Austria this is a legendary match. In the 1982 World Cup Austria also played. After two matches with wins versus Algeria and Chile a narrow loss against Germany was enough. Germany had to win to promote to the final round. The match ended 1:0 for Germany and especially in Algeria there were manipulation reproaches. After the 1982 Cup a lot of players ended their career, so Austria failed to reach the 1986 FIFA World Cup. Under coach Josef Hickersberger Austria could qualify for the 1990 World Cup. He called back old players like Herbert Prohaska and mixed them with new players like Andreas Herzog who had only three league matches played before the Championship. After losses versus Italy and Czechoslovakia and a win versus USA they failed in the first round. Shortly after the World Cup Hickersberger resigned after a 0:1 versus the Faroe Islands in Landskrona, Sweden. On the islands there was no stadium with grass and all the players were pure amateurs. This match was a great disgrace for Austrians team. The last appearance of an Austrian team in a World Cup tournament was 1998 in France. Austria failed in the qualifing round versus Italy, Chile and Cameroon. As host Austria was qualified for the UEFA Euro 2008 and played versus Poland, Croatia and Germany. After losses versus Germany and Croatia and a draw versus Poland Austria could not qualify for the quarter finals. Austria failed to qualify for the World Cup 2006 and 2010 and also for the UEFA Euro 2012. ==Notable team players== *Andreas Herzog:with 103 matches he holds the record of matches for the national team *Robert Sara:was voted to the All-Star-Team of the FIFA World Cup 1978 *Walter Zeman:World goal keeper 1953 *Herbert Prohaska:played in the 1990 and 1982 team and was coach of the 1998 squad for the World Cups *Hans Krankl: he was the star of the 1978 match versus Germany and Europs best scorer *Matthias Sindelar: player of the \"Wunderteam\" one of Austrias best players ever *Toni Polster:with 44 goals best scorer of the Austrian team ==Team of the century== To mark the turn of the century, the Kronen Zeitung called for an election for the national team of the (20th) century in 1999. Walter Zeman Robert Sara – Ernst Happel – Bruno Pezzey Gerhard Hanappi – Herbert Prohaska – Ernst Ocwirk – Andreas Herzog Hans Krankl – Matthias Sindelar – Toni Polster ==Statistics== *as 16 October 2023Football in Austria (German) ===Team matches=== **825 **Won:346 **Drawn:176 **Lost:303 **Goals1456: 1279 +177 **The highest victory was a 9:0 versus Malta in a qualifing match for the FIFA World Cup 1978. **Top scorer in single match:Hans Krankl 6 versus Malta **The highest defeat was a 1:11 versus England on 8th June 1908 in Vienna. **Most matches:versus Hungary 136 **Best result in Fifa World Cup:1954 3rd **Visitors: 30.10.1960 Austria - Spain 3:0 91000austriasoccer.at ===Matches=== #Marko Arnautovic 108 #Andreas Herzog 103 # David Alaba 101 #Aleksandar Dragovic 100 # Anton Polster 95 #Gerhard Hanappi 93 # Karl Koller 86 #Julian Baumgartlinger 84 # Friedrich 'Friedl' Koncilia 84 # Bruno Pezzey 84 # Herbert Prohaska 83 # Christian Fuchs 78 #Sebastian Prödl 73 #Marc Janko 70 # Johann Krankl 69 # Heribert Weber 68 # Martin Harnik 68 # Martin Hinteregger 67 # Peter Stöger 65Fußball in Österreich (German) ===Top scorer=== # Anton Polster 44 # Johann Krankl 34 # Johann Horvath 29 # Erich Hof 28 # Anton Schall 27 # Matthias Sindelar 26 # Andreas Herzog 26 # Karl Zischek 24 # Walter Schachner 23 # Theodor Wagner 22 ==Manager history== Name Nationality From To P W D L GF GA Win%Win% is rounded to two decimal places Notes Hugo Meisl 22 December 1912 3 October 1914 6 3 1 2 11 9 50.00 Heinrich Retschury 4 October 1914 1 August 1919 22 8 3 11 45 47 Hugo Meisl 1 August 1919 17 February 1937 127 68 29 30 326 206 Created the Wunderteam. 4th place at the 1934 World Cup. Winners of the 1932 Central European International Cup. Runners-up of the 1930 and 1935 Central European International Cup. Heinrich Retschury 22 May 1937 24 October 1937 5 2 1 2 10 10 40.00 Qualified for the 1938 World Cup. From 1938 to 1945 there was no national team due to Anschluss. Karl Zankl 19 August 1945 3 October 1945 2 0 0 2 2 7 0.00 Died while in the position of national coach. Edi Bauer 3 October 1945 4 March 1948 11 4 0 7 26 28 Eduard Frühwirth 4 March 1948 1 September 1948 5 3 0 2 9 9 60.00 Walter Nausch 1 September 1948 15 November 1954 47 21 10 16 119 87 3rd place at the 1954 World Cup. Hans Kaulich 15 November 1954 28 March 1955 1 0 0 1 2 3 0.00 Josef Molzer 29 March 1955 3 September 1955 3 1 1 1 6 8 Karl Geyer 3 September 1955 21 April 1956 5 2 0 3 8 14 40.00 Josef Argauer Josef Molzer 21 April 1956 9 August 1958 18 7 6 5 37 27 Qualified for the 1958 World Cup. Alfred Frey Franz Putzendopler Egon Selzer Josef Molzer 9 August 1958 15 October 1958 2 0 0 2 4 6 0.00 Karl Decker 16 October 1958 28 February 1964 36 16 3 17 60 67 Josef Walter Béla Guttmann 7 March 1964 11 October 1964 5 3 1 1 6 5 60.00 Eduard Frühwirth 20 November 1964 13 January 1967 15 4 3 8 12 23 Erwin Alge Hans Pesser 13 January 1967 24 June 1968 10 3 2 5 18 19 30.00 Leopold Šťastný 1 July 1968 30 September 1975 49 15 16 18 58 62 Branko Elsner (caretaker) 6 October 1975 19 November 1975 2 1 0 1 6 3 50.00 Helmut Senekowitsch 1 March 1976 30 June 1978 26 14 4 8 40 26 Qualified for the 1978 World Cup. Karl Stotz 1 August 1978 14 December 1981 24 13 6 5 43 25 Qualified for the 1982 World Cup. Georg Schmidt Felix Latzke 5 February 1982 2 July 1982 8 5 1 2 11 7 Erich Hof 7 September 1982 21 November 1984 15 6 3 6 22 20 Branko Elsner 15 January 1985 18 November 1987 18 5 5 8 20 28 Josef Hickersberger 1 January 1988 14 September 1990 29 10 7 12 36 39 Qualified for the 1990 World Cup. Alfred Riedl 15 September 1990 10 October 1991 8 1 3 4 6 16 Dietmar Constantini (caretaker) 10 October 1991 13 November 1991 2 0 0 2 1 4 0.00 Ernst Happel 1 Januar 1992 14 November 1992 9 2 3 4 18 17 Dietmar Constantini (caretaker) 15 November 1992 18 November 1992 1 0 1 0 0 0 Herbert Prohaska 8 January 1993 29 March 1999 51 25 9 17 96 73 Qualified for the 1998 World Cup. Otto Barić 13 April 1999 21 November 2001 22 7 6 9 31 35 Hans Krankl 21 January 2002 28 September 2005 31 10 10 11 47 46 Willibald Ruttensteiner Andreas Herzog Slavko Kovacic (caretakers) 30 September 2005 December 2005 2 1 0 1 2 1 50.00 Josef Hickersberger 1 January 2006 23 June 2008 24 5 8 11 29 40 Karel Brückner 25 July 2008 2 March 2009 6 1 2 3 9 13 Dietmar Constantini 4 March 2009 1 November 2009 20 7 2 11 ? ? Marcel Koller 1 November 2009 9 October 2017 54 25 13 16 ? ? Qualified for the Euro 2016. Franco Foda 14 November 2017 30 March 2022 46 27 5 14 ? ? Qualified for the Euro 2020. Ralf Rangnick 29 April 2022 8 3 1 4 ? ? ==Gallery== File:Hugo Meisl.jpg|Hugo Meisl-coach of the \"Wunderteam\" File:Alfred Riedl, Fußballtrainer, Österreich (02).jpg|Alfred Riedl (1990/91) File:Herbert Prohaska.jpg|Herbert Prohaska File:2019-03-30 Fußball, Männer, 1. Bundesliga, RB Leipzig - Hertha BSC StP 3875 LR10 by Stepro.jpg|Ralf Rangnick current team coach File:Andreas Herzog.jpg|Andreas Herzog 103 matches for Austria File:Toni Polster, ROMY 2009.jpg|Toni Polster-44 goals for Austrias team ==References== ==Other websites== * Austrian teammatches (1902 bis present-German) * Current team players *List of Austrian national team players (German Wikipedia) Category:European national football teams Category:Football in Austria Category:1902 establishments in Europe Category:1900s establishments in Austria Category:National sports teams of Austria",
 "title": "Austria national football team"
}