{
 "id": "173042",
 "text": "The Antikythera mechanism is a mechanical calculator. It was an Ancient Greek analogue computer and orrery. It was discovered in 1902 in a shipwreck off the coast of Antikythera, Greece.Palazzo, Chiara (17 May 2017). \"What is the Antikythera Mechanism? How was this ancient 'computer' discovered?\". The Telegraph. A number of gears worked together, much like they do in a mechanical clock. The device could predict astronomical positions, eclipses, the motions of the sun, the moon and probably some of the planets. This makes it possible to use the device as a calendar.The Antikythera Mechanism Research Project \", The Antikythera Mechanism Research Project. Retrieved 2007-07-01 Quote: \"The Antikythera Mechanism is now understood to be dedicated to astronomical phenomena and operates as a complex mechanical 'computer' which tracks the cycles of the Solar System\".Price, Derek J. de Solla 1975. Gears from the Greeks: The Antikythera mechanism: a calendar computer from ca. 80 BC. New York: Science History Publications. . There were three big dials, and three small ones. Used as a calendar the main functions were: *A solar calendar showing days and months, as well as the Babylonian zodiac *A Lunisolar calendar showing the months *A calendar, showing eclipse cycles: past and future eclipses of the sun and the moon *A calendar, showing the years in which there would be panhelllenic games (or Olympics) The device was found on a shipwreck, near the island of Antikythera, between the Peloponnese and Crete. Different coins were also found on the wreck. There are coins from Pergamon, dating between 86 BC and 67 BC, and coins from Ephesus, dating between 70 BC and 60 BC. This means that the ship sunk between 70 and 60 BC. This device is the most complex device known in Antiquity. Only in the 14th century did people again have the knowledge to build similar devices. The device is now on display in the Bronze Collection of the National Archaeological Museum of Athens. When the mechanism was found, it consisted of corroded metal plates. Before x-rays could be used to show what was \"inside\", it was very difficult to judge what the mechanism did.Marchant, Jo 2008. Decoding the heavens: solving the mystery of the world's first computer. London: Heinemann. Many of the parts that make up the mechanism were lost either during the roughly 2000 years it had laid on the sea floor, or shortly after discovery. Many gears have not \"survived\" in one piece. None of the scales is complete, and only one indicator survived as a fragment. The Antikythera Research project has produced a reconstruction; it added seven gears that were probably part of the device. There are 35 gears, and seven displays. There are many hints that the device was also used to calculate and show the movement of stars, even though none of the necessary gears or displays have been found. ==Mechanism of operation== There were 82 parts in total. With the parts found it is not possible to get the mechanism with all displays and dials fully operational. It is also not possible to know how many parts have been lost. In total, 30 gears were found. One gear is probably part of a planetary display, that has been lost. To make the reconstructed displays work, another eight gears would be necessary, but they have been lost. There are two crown gears, all the other gears found are normal gears (that require a special alignment of the axes). The gear was a primitive one, and the transmission was not uniform. The mechanism was repaired at least once, which shows that it must have been used often. == References == == Other websites == * The Antikythera Mechanism Research Project *Antikythera.org - Website with collected information Category:History of technology Category:1st-century BC works",
 "title": "Antikythera mechanism"
}