{
 "id": "173205",
 "text": "Hanukkah is a Jewish holiday which celebrates the victory of the Maccabees over the larger Greek army. It also celebrates a miracle that happened during this time, where just a day's supply of oil allowed the menorah (Hanukkiah or Hanukkah Menorah) in the rededicated Temple in Jerusalem to remain lit for eight days. Therefore, Jewish people celebrate Hanukkah for eight days. Hanukkah begins on the 25th day of Kislev according to the Hebrew calendar, which on the Gregorian calendar is late November or December. For example, in 2013 it started on November 27. The Hebrew word means rededication. The hanukiah (or hanukkah menorah) is a candle holder, an important Hanukkah symbol. It has nine branches. Traditionally, one candle is separated from the rest, usually by being higher than the other eight. On the first night, only one candle is lit, on the right side of the hanukiah. On the second night, a second candle is added, and they are lit from left to right -- but the Hanukkiah is filled from right to left. This continues for all eight nights. The candles are never lit directly - instead, the higher candle, (called a shamash, meaning \"attendant\") is lit first, and then used to light the rest of the candles. While the candles are lit, blessings are said over them. Jewish children often play a game called dreidel. The dreidel is a four-sided spinning top, each side having a Hebrew letter. The four letters (nun, gimel, hey, and shin) stand for the Hebrew phrase, \"Nes gadol haya shaam,\" meaning, \"A great miracle happened there.\" In Israel, by contrast, the dreidel reads \"Po\" instead of \"shaam,\" meaning \"here.\" So in Israel the phrase is, \"a great miracle happened here.\" ==History of Hanukkah== Approximately 2,200 years ago, there was a war between the Greeks and the Jews. The Greeks won and forced their culture on the Jews. A group of Jewish people called the Maccabees led by someone named Matityahu revolted against the Greeks and after he died his son Judah Maccabee beat them and liberated Jerusalem. The Maccabees found their Temple defiled. They wanted to rededicate it to God, as the Greeks had been worshipping Zeus there. As part of the rededication, they needed to relight the menorah, whose source of fuel was olive oil. According to the Talmud, the Jewish people only found a single jar of undefiled oil, and that oil was only enough to last a single day. The Jewish people took a leap of faith and relit the menorah. To their surprise, the menorah stayed lit for eight days, which was seven more days than they expected. The Jewish people attributed the surprising amount of time that the oil lasted to God (a miracle). Hanukkah is an eight-day celebration, and each day commemorates each day that the oil lasted. On each day, a branch of the nine-branch Hanukkah menorah is lit with the shamash (\"helper\" candle), which sits on the middle branch. == Dates == * 2017: 12-20 December * 2018: 2-10 December * 2019: 22-30 December * 2020: 10-18 December * 2021: 28 November-6 December * 2022: 18-26 December * 2023: 7-15 December ==References== == Other websites == * * * *\"Chanukah: Connecting to the Hidden Light Within\"",
 "title": "Hanukkah"
}