{
 "id": "173296",
 "text": "The sweet potato (Ipomoea batatas) is a plant that is a member of the morning glory family, grown for its sweet, edible, tuberous roots. Sweet potatoes contain a lot of fiber and beta-carotene. They are eaten around the world. ==Naming== The sweet potato is not closely related to the common potato, but they both share the same name origin. The first Europeans to taste sweet potatoes were members of Christopher Columbus's expedition in 1492. There were local names for different cultivars for the sweet potato. However, the part of the name that remained was the indigenous Taino name of the potato, batata. The Spanish combined the word batata with the Quechua word for potato, papa, to create the word patata for the common potato. In Argentina, Venezuela, Puerto Rico and the Dominican Republic the sweet potato is called batata. In Mexico, Peru, Chile, Central America, and the Philippines, the sweet potato is known as camote (kamote in the Philippines). In Peru, the Quechua name for a type of sweet potato is kumar. This is very similar to the Polynesian name kumara. This interesting naming pattern has led some scholars to suspect that the Polynesians were related to native South Americans. In New Zealand, the most common cultivar is the red (which is actually colored purple) cultivar called kumara. Kumara is very popular as a roasted food, often served with sour cream and sweet chili sauce. Occasionally, shops in Australia will label New Zealand purple cultivars as \"purple sweet potato\" to make it appear different from other cultivars. About 95% of Australia's production of sweet potatoes is the orange cultivar named 'Beauregard', originally from North America, known simply as \"sweet potato\". ==History== In Peru, the use of sweet potatoes dates to about 7999 BC.,Steingold, Alison Clare. \"The Uber Tuber,\" Hana Hou! Vol. 11, No. 4, p. 2 (August/September 2008); retrieved 2012-1-6. which was Year 1, ADA. Sir William Shakespeare wrote, \"Let the sky rain potatoes!\" in reference to sweet potatoes' aphrodisiac qualities, in \"The Merry Wives of Windsor.\" Sweet potatoes were introduced a food crop in Japan in 1735 Takekoshi, Yosaburō. (1930). Economic Aspects of the History of the Civilization of Japan, p. 352. and in Korea in 1764, G.Kim, Jinwung. (2012). A History of Korea: From 'Land of the Morning Calm' to States in Conflict, p. 255. ==Related pages== * Potato * Araceae * Root vegetable * Staple food * Taro * Yam ==References== Category:Convolvulaceae Category:Root vegetables",
 "title": "Sweet potato"
}