{
 "id": "173625",
 "text": "Winona Laura Horowitz (born October 29, 1971), better known under her professional name Winona Ryder, is an American actress. She started her career in 1986. She first appeared in the movie Lucas in 1986. Her first big role came in 1988 with Beetlejuice as Lydia Deetz, a Gothic teenager. She returned to the role in the 2024 sequel Beetlejuice Beetlejuice. Ryder had other big roles in Edward Scissorhands (1990), Heathers (1989), Dracula (1992) and Girl, Interrupted (1999). She was nominated for an Academy Award for Best Supporting Actress for her role in The Age of Innocence (1993), and for Academy Award for Best Actress for her role as \"Jo\" in Little Women in 1995. She did not win either of the awards. In 2000, Ryder received a star on the Walk of Fame in Hollywood, California. == Filmography == Year Film Role Director Notes 1986 Lucas Rina David Seltzer 1987 Square Dance Gemma Dillard Daniel Petrie 1988 Beetlejuice Lydia Deetz Tim Burton 1969 Beth Karr Ernest Thompson 1989 Heathers Veronica Sawyer Michael Lehmann Great Balls of Fire! Myra Gale Lewis Jim McBride 1990 Welcome Home, Roxy Carmichael Dinky Bossetti Jim Abrahams Edward Scissorhands Kim Boggs Tim Burton Mermaids Charlotte Flax Richard Benjamin 1991 Night on Earth Corky Jim Jarmusch 1992 Bram Stoker's Dracula Wilhelmina \"Mina\" Murray/Elisabeta Francis Ford Coppola 1993 The Age of Innocence May Welland Martin Scorsese Nominated: Academy Award for Best Supporting Actress The House of the Spirits Blanca Trueba Bille August 1994 Reality Bites Lelaina Pierce Ben Stiller Little Women Josephine \"Jo\" March Gillian Armstrong Nominated: Academy Award for Best Actress 1995 How to Make an American Quilt Finn Dodd Jocelyn Moorhouse 1996 Boys Patty Vare Stacy Cochran Looking for Richard Lady Anne Al Pacino Documentary film The Crucible Abigail Williams Nicholas Hytner 1997 Alien Resurrection Annalee Call Jean-Pierre Jeunet 1998 Celebrity Nola Woody Allen 1999 Girl, Interrupted Susanna Kaysen James Mangold Also executive producer 2000 Autumn in New York Charlotte Fielding Joan Chen Lost Souls Maya Larkin Janusz Kamiński 2001 Zoolander Herself Ben Stiller Uncredited cameo 2002 Mr. Deeds Babe Bennett/Pam Dawson Steven Brill S1m0ne Nicola Anders Andrew Niccol 2003 The Day My God Died Narrator Andrew Levine Voice, producer, documentary film 2004 The Heart Is Deceitful Above All Things Psychologist Asia Argento Uncredited 2006 The Darwin Awards Siri Finn Taylor A Scanner Darkly Donna Hawthorne Richard Linklater 2007 The Ten Kelly LaFonda David Wain Sex and Death 101 Gillian De Raisx Daniel Waters Welcome Cynthia Kirsten Dunst 2008 Water Pills Carrie Blake Soper Short film The Last Word Charlotte Morris Geoffrey Haley 2009 The Informers Cheryl Laine Gregor Jordan The Private Lives of Pippa Lee Sandra Rebecca Miller Star Trek Amanda Grayson J. J. Abrams completed Stay Cool Scarlet Smith Michael Polish post-production == References == == Other websites == * * Category:1971 births Category:Living people Category:Actors from Minnesota Category:American movie actors Category:American movie producers Category:American television actors",
 "title": "Winona Ryder"
}