{
 "id": "173988",
 "text": "Virginia Elizabeth \"Geena\" Davis (born January 21, 1956) is an Academy Award, Golden Globe-winning and Emmy-nominated American actress, film producer, writer, former fashion model. Geena Davis is also a member of Mensa International. == Personal life == From 1982 until 1983, Geena Davis was married to Richard Emmolo. From 1987 until 1990, she was married to Jeff Goldblum. From 1993 until 1998, she was married to Renny Harlin. On September 1, 2001, she married Reza Jarrahy. They have three children, daughter Alizeh Keshvar Davis Jarrahy (born on April 10, 2002) and twin sons Kian William Davis Jarrahy and Kaiis Steven Davis Jerrahy (born on May 6, 2004). ==Filmography== ===Film=== Year Title Role Notes 1982 Tootsie April Page 1985 Fletch Larry Transylvania 6-5000 Odette 1986 Veronica \"Ronnie\" Quaife 1988 Beetlejuice Barbara Maitland Earth Girls Are Easy Valerie Gail Muriel Pritchett Academy Award winner: Best Supporting Actress 1990 Quick Change Phyllis Potter 1991 Thelma & Louise Thelma Dickinson Academy Award nomination: Best Actress 1992 Dottie Hinson Hero Gale Gayley 1994 Angie Angie Scacciapensieri Speechless Julia Mann Producer 1995 Cutthroat Island Morgan Adams 1996 Samantha Caine / Charlene \"Charly\" Baltimore 1999 Stuart Little Mrs. Eleanor Little 2002 Stuart Little 2 2005 Stuart Little 3: Call of the Wild Voice 2009 Accidents Happen Gloria Conway 2013 In a World... Katherine Huling 2014 When Marnie Was There Yoriko Sasaki Voice 2016 Me Him Her Mrs. Ehrlick 2017 Marjorie Prime Tess Don't Talk to Irene Herself 2018 This Changes Everything Herself Documentary; executive producer 2020 Ava Bobbi ===Television=== Year Title Role Notes 1983 Knight Rider Grace Fallon Episode: \"K.I.T.T. the Cat\" 1983 - 1984 Buffalo Bill Wendy Killian 26 episodes 1984 Fantasy Island Patricia Grayson Episode: \"Don Juan's Lost Affair\" Riptide Dr. Melba Bozinsky Episode: \"Raiders of the Lost Sub\" 1984 - 1986 Family Ties Karen Nicholson 3 episodes 1985 Secret Weapons Tamara Reshevsky / Brenda Television movie Remington Steele Sandy Dalrymple Episode: \"Steele in the Chips\" Sara Sara McKenna 13 episodes 1989 Trying Times Daphne Episode: \"The Hit List\" 1990 The Earth Day Special Kim Television special 2000 - 2001 The Geena Davis Show Teddie Cochran 22 episodes 2004 Will & Grace Janet Adler Episode: \"The Accidental Tsuris\" 2005 - 2006 Commander in Chief President Mackenzie Allen 18 episodes 2009 Exit 19 Gloria Woods Television movie 2012 Coma Dr. Agnetta Lindquist 2-episode miniseries 2013 Untitled Bounty Hunter Project Mackenzie Ryan Unsold TV pilot Doc McStuffins Princess Persephone (voice) Episode: \"Sir Kirby and the Plucky Princess\" 2014 - 2018 Grey's Anatomy Dr. Nicole Herman 13 episodes 2015 Annedroids Student Episode: \"Undercover Pigeon\" 2016 The Exorcist Angela Rance 10 episodes 2019 She-Ra and the Princesses of Power Huntara (voice) 3 episodes GLOW Sandy Devereaux St. Clair 6 episodes == Other websites == * * Category:1956 births Category:Living people Category:American Academy Award winning actors Category:Golden Globe Award winning actors Category:American movie actors Category:Models from Massachusetts Category:Actors from Massachusetts",
 "title": "Geena Davis"
}