{
 "id": "173971",
 "text": "The Streamlined System for the Romanization of Bulgarian is a system of transliteration of the Bulgarian alphabet created by Lyubomir Ivanov in the Institute of Mathematics and Informatics at the Bulgarian Academy of Sciences in 1995,L.L. Ivanov, Toponymic Guidelines for Antarctica, Antarctic Place- names Commission of Bulgaria, Sofia, 1995.Inventaire des outils de romanisation. Bibliothèque et Archives Canada. Ottawa 2006. (2019 edition, in English)G. Selvelli. Su alcuni aspetti ideologici dei sistemi di traslitterazione degli alfabeti cirillici nei Balcani. Studi Slavistici XII (2015). pp. 159–180. (in Italian) which is defined by the following table:M. Gaidarska, The Current State of the Transliteration of Bulgarian Names into English in Popular Practice, Contrastive Linguistics, XXII, 1998, 112, pp. 69-84. L.L. Ivanov, On the Romanization of Bulgarian and English, Contrastive Linguistics, XXVIII, 2003, 2, pp. 109-118. ; Errata, id., XXIX, 2004, 1, p. 157.Andreev A., I. Derzhanski eds. Bulgarian Academy of Sciences: Institute of Mathematics and Informatics, founded 1947. Sofia: Multiprint Ltd., 2007. 64 pp. (Bilingual publication in Bulgarian and English) А A Б B В V Г G Д D Е E Ж ZH З Z И I Й Y К K Л L М M Н N О O П P Р R С S Т T У U Ф F Х H Ц TS Ч CH Ш SH Щ SHT Ъ A Ь Y Ю YU Я YA ==Origins and usage== The system was originally developed to serve for the Romanization of Bulgarian geographical names in Antarctica. It was adopted by the Antarctic Place-names Commission of Bulgaria on 2 March 2005. An early explanation of the Streamlined System was made in 1997 to the US and UK Antartcic place-naming authorities.L.L. Ivanov. Comments on the English Transliteration of Bulgarian Names. Sofia, 1997. They had noticed the difference from their 1952 BGN/PCGN romanization of Bulgarian. The new system became subject to comparative study at the Department of English and American Studies at Sofia University. Subsequently, the system was chosen by the Bulgarian Government.Regulations for the issuing of Bulgarian identity documents, State Gazette #14 of 2000. (in Bulgarian)Ministry of Regional Development and Public Works, Ordinance #3 of 26 October 2006 on the Transliteration of the Bulgarian Geographical Names in Latin Alphabet, State Gazette # 94, 21 November 2006. (in Bulgarian)United Nations Document E/CONF.98/CRP.71. 17 August 2007. It is the official transliteration system to be used in all identity documents, road signs, street names, official information systems, databases, local authorities’ websites etc. Eventually, the Streamlined System became part of Bulgarian law by way of the Transliteration Law passed in 2009.State Gazette # 19, 13 March 2009. (in Bulgarian) The Streamlined system was adopted also by UN in 2012,Bulgarian. Report on the Current Status of United Nations Romanization Systems for Geographical Names. Compiled by the UNGEGN Working Group on Romanization Systems. Version 4.0, February 2013. and for official US and UK use, by BGN and PCGN in 2013.Romanization System for Bulgarian: BGN/PCGN 2013 System. National Geospatial-Intelligence Agency, September 2014. Ivanov proposes using his Romanization approach in the case of Cyrillic alphabets of other Slavic languages, notably Russian.Ivanov, L. Streamlined Romanization of Russian Cyrillic. Contrastive Linguistics. XLII (2017) No. 2. pp. 66-73. ==Basic principles== The Streamlined System was designed with the aim of striking an optimal balance between the following partly overlapping and partly conflicting priorities: * First, the primary purpose of this system is to ensure a plausible phonetic approximation of Bulgarian words by English speaking users, including those having no knowledge of the Bulgarian language and no available additional explanations; * Second – and of lesser priority, the system should allow for the retrieval of the original Cyrillic spellings as much as feasible; * Third, transliterated Bulgarian words should fit an English language environment i.e. not be perceived as too ‘un-English’; and * Fourth, transliterated word forms should be streamlined and simple. Exceptions: * Authentic Roman spellings of names of non-Bulgarian origin have priority, for instance James Bourchier, Émile de Laveleye and Wellington and not Dzheyms Baucher, Emil dyo Lavele or Uelingtan. * Word-final -ИЯ is transliterated as IA rather than IYA (exception introduced in 2006).Regulations for the issuing of Bulgarian identity documents (Amendment), State Gazette #83 of 2006. (in Bulgarian) It had been proposed to modify the Streamlined System so that Bulgarian letters Ъ and Ц were transliterated as Ă and TZ respectively.V. Stankov, ed. New Orthographic Dictionary of Bulgarian Language. Bulgarian Academy of Sciences and Hazel Publishers, 2002. p.51. (in Bulgarian)V. Murdarov, P. Kostadinova. National standard for the transliteration of Bulgarian Cyrillic personal names with Latin characters (Problems and proposed solutions). Bulgarian Language Journal, No. 4, 2005. (in Bulgarian) However, those proposals failed to gain wider acceptance, and were not adopted for official usage.M. Dimitrova. Comprehensible Bulgaria. Culture Weekly, 23 March 2006. (in Bulgarian) ==Illustration== :Example (Article 1 of the Universal Declaration of Human Rights): Всички хора се раждат свободни и равни по достойнство и права. Те са надарени с разум и съвест и следва да се отнасят помежду си в дух на братство. Vsichki hora se razhdat svobodni i ravni po dostoynstvo i prava. Te sa nadareni s razum i savest i sledva da se otnasyat pomezhdu si v duh na bratstvo. ==Invertibility== The system is not invertible, for А, Ж, Й, Ц, Ш, Щ, Ю, Я are transliterated in the same way as are Ъ, ЗХ, Ь, ТС, СХ, ШТ, ЙУ, ЙА respectively. An auxiliary, invertible variant of the system without the ИЯ-exception rule is proposed by L. Ivanov, D. Skordev and D. Dobrev to be used in those special cases when the exact retrieval of Bulgarian words from their Romanized forms is a priority, with Cyrillic letters and combinations of letters Ъ, Ь, ЗХ, ЙА, ЙУ, СХ, ТС, ТШ, ТЩ, ШТ, ШЦ transliterated as `A, `Y, Z|H, Y|A, Y|U, S|H, T|S, T|SH, T|SHT, SH|T, SH|TS respectively.L. Ivanov, D. Skordev and D. Dobrev. The New National Standard for the Romanization of Bulgarian. Mathematica Balkanica. New Series Vol. 24, 2010, Fasc. 1-2. pp.121-130. In order to ensure full invertibility of the system, including the case of the ИЯ-exception rule, one may transliterate word-final -ИА as I|A rather than IA. The plain streamlined transliteration word form could be retrieved from its invertible variant by simply removing the additional symbols ` and |. ==Comparison with other systems== The Streamlined System is based on an English-oriented transliteration, taking advantage of the global lingua franca role of English. A similar shift towards English-oriented transliteration is observed in the case of other Cyrillic alphabets such as RussianOrdinance N 1047 of 31.12.2003, Ministry of Interior of the Russian Federation. (in Russian) and Ukrainian,Resolution of the Ukrainian Commission on the Issue of Legal Terminology. Record No. 2 of 19.04.1996. (in Ukrainian)Ordinance N 55 of the Cabinet of Ministers of Ukraine “Regulation of the Latin transliteration of the Ukrainian alphabet” of 27 January 2010. (in Ukrainian) and to some extent Macedonian.D. Georgievski, How to Romanize the Cyrillic alphabet, Globus Weekly, issue 70, 19 August 2008. (in Macedonian)Omniglot: Macedonian language, alphabet and pronunciation The Streamlined System is similar to the old 1952 BGN/PCGN System for the Romanization of Bulgarian, which had been official in the USA and the United Kingdom until 2013. The latter however transliterates the Cyrillic letters Х, Ь and Ъ as KH, ’ (apostrophe) and Ŭ, while the former uses H, Y and A instead.USBGN, Romanization Systems and Roman-Script Spelling Conventions, 1994, pp.15-16. Another similar system not adopted for official use in Bulgaria is that of A. Danchev, M. Holman, E. Dimova and M. Savova, which transliterates the Cyrillic letters У and Ъ by OU and U respectively, while the Streamlined System uses U and A for this purpose. Furthermore, the latter system transliterates the digraphs АЙ•ай, ЕЙ•ей, ОЙ•ой and УЙ•уй by AI•ai, EI•ei, OI•oi and OUI•oui instead of AY•ay, EY•ey, OY•oy and UY•uy respectively.A. Danchev, M. Holman, E. Dimova, M. Savova. An English Dictionary of Bulgarian Names: Spelling and Pronunciation. Sofia, Nauka i Izkustvo Publishers, 1989. 288 pp. ==Related pages== * Transliteration * Bulgarian language * Cyrillic alphabet == References == Bulgarian",
 "title": "Romanization of Bulgarian"
}