{
 "id": "174272",
 "text": "Jeffrey Lynn Goldblum (; born October 22, 1952) is an American actor and musician. He has starred in some of the highest-grossing movies of his era. These include Jurassic Park (1993) and Independence Day (1996). Goldblum's first movie role was in Death Wish (1974). His early roles include California Split (1974), Nashville (1975), and Annie Hall (1977). He got wider attention for his roles in Invasion of the Body Snatchers (1978), The Big Chill (1983), and The Fly (1986). In 1996 he was nominated for an Academy Award for Little Surprises. Jeff Goldblum was nominated for a Primetime Emmy Award for a guest appearance on Will & Grace. He also appeared in Friends, Portlandia and Inside Amy Schumer. In 2023, he was the host of his own series The World According to Jeff Goldblum (2019 - present). His jazz band released their first album, The Capitol Studios Sessions, in 2018. ==Movies== Year Title Role Notes 1974 Death Wish Freak #1 California Split Lloyd Harris 1975 Nashville Tricycle Man 1976 Next Stop, Greenwich Village Clyde Baxter St. Ives Hood #3 Special Delivery Snake 1977 The Sentinel Jack Annie Hall Lacey Party Guest Between the Lines Max Arloft 1978 Remember My Name Mr. Nudd Thank God It's Friday Tony Di Marco Invasion of the Body Snatchers Jack Bellicec 1981 Threshold Aldo Gehring Nominated - Genie Award for Best Performance by a Foreign Actor 1983 The Big Chill Michael Gold The Right Stuff Recruiter 1984 The Adventures of Buckaroo Banzai Across the 8th Dimension New Jersey Terror in the Aisles Jack Bellicec 1985 Into the Night Ed Okin Silverado \"Slick\" Calvin Stanhope Transylvania 6-5000 Jack Harrison 1986 The Fly Seth Brundle Won - Saturn Award for Best Actor Nominated - National Society of Film Critics Award for Best Actor (2nd place) New York Film Critics Circle Award for Best Actor (3rd place) 1987 Beyond Therapy Bruce 1988 Vibes Nick Deezy Earth Girls Are Easy Mac 1989 The Tall Guy Dexter King El Sueño del Mono Loco Dan Gillis 1990 Mister Frost Mr. Frost 1991 The Favour, the Watch and the Very Big Fish Pianist 1992 Fathers & Sons Max The Player Himself Cameo Deep Cover David Jason Nominated - Independent Spirit Award for Best Supporting Male Chicago Film Critics Association Award for Best Supporting Actor Shooting Elizabeth Howard Pigeon 1993 Jurassic Park Dr. Ian Malcolm Nominated - Saturn Award for Best Supporting Actor 1995 Hideaway Hatch Harrison Nine Months Sean Fletcher Powder Donald Ripley 1996 The Great White Hype Mitchell Kane Independence Day David Levinson Nominated - Saturn Award for Best Actor Little Surprises Director; short movie Nominated - Academy Award for Best Live Action Short Film Mad Dog Time Mickey Holliday 1997 The Lost World: Jurassic Park Dr. Ian Malcolm Nominated - Blockbuster Entertainment Award for Favorite Actor - Sci-Fi 1998 Holy Man Ricky Hayman The Prince of Egypt Aaron Voice Welcome to Hollywood Himself Cameo 2000 Beyond Suspicion John Nolan Chain of Fools Avnet One of the Hollywood Ten Herbert Biberman 2001 Perfume Jamie Also executive producer Cats & Dogs Professor Brody 2002 Run Ronnie Run! Himself Uncredited cameo Igby Goes Down D.H. Banes 2003 Dallas 362 Bob Spinning Boris George Gorton 2004 Incident at Loch Ness Party Guest Cameo The Life Aquatic with Steve Zissou Allistair Hennessey Nominated - Broadcast Film Critics Association Award for Best Cast Boston Society of Film Critics Award for Best Ensemble 2006 Mini's First Time Mike Rudell Fay Grim Agent Fulbright Pittsburgh Himself Also producer Man of the Year Stewart 2008 Adam Resurrected Adam Stein 2010 The Switch Leonard Morning Glory Jerry Barnes 2012 Tim and Eric's Billion Dollar Movie Chef Goldblum Zambezia Ajax Voice 2013 Le Week-End Morgan Nominated - British Independent Film Award for Best Supporting Actor 2014 The Grand Budapest Hotel Deputy Vilmos Kovacs Nominated - Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Unity Narrator Voice Documentary 2015 Mortdecai Milton Krampf 2016 Independence Day: Resurgence David Levinson 2017 Guardians of the Galaxy Vol. 2 Grandmaster Closing credits cameo Thor: Ragnarok Grandmaster Miyubi The Creator Short movie 2018 Isle of Dogs Duke Voice Jurassic World: Fallen Kingdom Dr. Ian Malcolm Hotel Artemis Niagara (The Wolf King) The Mountain Dr. Wallace Fiennes 2021 The Boss Baby: Family Business Dr. Erwin Armstrong Voice 2022 Jurassic World Dominion Dr. Ian Malcolm 2023 Asteroid City Post - production 2024 Wicked: Part One The Wizard Filming == References == Category:1952 births Category:Living people Category:Actors from Pennsylvania Category:American movie actors Category:American television actors Category:Extras Category:Jewish American actors Category:Musicians from Pennsylvania Category:American jazz musicians",
 "title": "Jeff Goldblum"
}