{
 "id": "174367",
 "text": "Harry Houdini (March 24, 1874 - October 31, 1926) was a Hungarian-born American magician and escapologist. He also investigated fake spiritualists and was a skeptic. ==Life and career== He was born in Budapest to Jewish parents and was named Ehrich Weiss, but changed his name to Harry Houdini when he became a professional magician. At first he did not have much success in his career. In 1899 his acts got better when he met his manager Martin Beck. Mr Beck was impressed with Houdini's handcuff stunts and within a year Houdini was famous. Houdini also appeared in several early movies and made many early airplane flights. He made the first successful airplane flight in Australia, on 18 March 1910, in Victoria. ==Death== Houdini died in Detroit, Michigan, on October 31, 1926. Two weeks before his death, a college student approached Houdini and asked him if he could withstand a punch in the stomach, a challenge which Houdini often took, and the former punched him several times. Houdini became sick afterwards, but continued to perform. Houdini's official cause of death was peritonitis (inflammation in the abdomen). Some speculate that it was caused by a ruptured appendix from that incident. ==In Popular Culture== *In 1953 there was a popular but fictionalized movie \"Houdini\" (with Tony Curtis as Houdini); its ending is that Houdini accidentally drowns trying to escape from a escape proof water trap. *A running gag in TV is that an evil magician is trying to steal Harry Houdini's \"Magic Secrets\": **In the TV show \"Simon & Simon\" \"Grand Illusion\" Season 3 episode 1 9/29/1983 is the theme of stolen Notes of Harry Houdini and a ghostly magician **In the cartoon The Real Ghostbusters episode \"The Cabinet of Calamari\" 9/30/1987 The Ghostbusters capture the ghost of Harry Houdini who keeps escaping from their traps; in a twist ending Houdini ghost not only rescuses Peter Venkman from a ghostly dimension but also help capture a dishonest magician who stole Houdini magic Secrets! ==References== ==Other websites== * *Houdini Tribute 400+ Photos, videos, multimedia, and hear Houdini's voice. * * in 2010 *Harry Houdini: His Life and His Art * *Wild About Harry—Website devoted to what's new in the world of Houdini; books, DVDs, auctions, movies, events, and pop culture references. Category:1874 births Category:1926 deaths Category:American aviators Category:Deaths from appendicitis Category:Deaths from peritonitis Category:Disease-related deaths in Michigan Category:Entertainers from Budapest Category:Hungarian Jews Category:Jewish American entertainers Category:Magicians Category:Naturalized citizens of the United States Category:Vaudeville performers",
 "title": "Harry Houdini"
}