{
 "id": "174760",
 "text": "The Asociación PuntuLLI (dot LLI) is an association that promotes the creation of a Top Level Domain for the Leonese Language and Culture. Similar campaigns started in Scotland (dot SCO), Wales (dot CYM), Berlin (dot Berlin) or New York (dot New York). PuntuLLI is recognised by cityTLD City Top Level Domain Web as a Top Level Domain official initiative. ==Origins== The campaign for reaching a .lli domain started on January 2007 looking for the support of associations and institutions. Between the organizations that support this requirement to the ICANN there are associations about culture, language, sport or nature. ==Objectives== This association promotes the creation of a .lli domain in Internet, according to the ICANN policy of giving Top Level Domains for the languages and cultures. In this sense, puntuLLI promotes a Leonese language and cultural domain. ==Activities== In 2008 PuntuLLI have collaborated with other initiatives for promoting the Leonese language like an sponsor, specially the Armwrestling World Championship, developed in Llión, the Leonese Country Pipe Bands Championship. Leonese City Council selected puntuLLI as official developer of the Internet activities in the III Leonese Language Day. ==Supports== There are more than 800 people added and 44 organisations that support the campaign, via web, for reaching a Top Level Domain for Leonese language and culture webs.March, 2009 ==Similar campaigns== Actually there are campaigns for reaching TLDs for languages and cultures in Scotland, Wales, Brittany, Galicia, Basque Country, England, Quebec and Cornwall. Similar campaigns, requesting a TLD for cities, are developed in Berlin, London, New York and Paris. ==Related pages== *Leonese language *Kingdom of León *ICANN *Top Level Domain ==References== ==Sources== * Pardo, Abel \"El Llïonés y las Tics\". Mikroglottika Year Book 2008. Peter Lang. Frankfurt am Main. 2008. * Diario de León: \"La Plataforma puntuLLI registra ya 6.000 visitas y más de 400 apoyos\". January 31, 2007 ==Other websites== * puntuLLI Association in Leonese language, English, Italian, Catalan and many other languages Category:Requested top-level domains Category:Leonese language associations",
 "title": "PuntuLLI"
}