{
 "id": "175046",
 "text": "The list of the worst disasters at nuclear power plants and other nuclear facilities all over the world is presented below: One of the worst nuclear accidents to date was the Chernobyl disaster which occurred in 1986 in Ukraine. That accident killed 30 people directly, as well as damaging approximately $7 billion of property. A study published in 2005 estimates that there will eventually be up to 4,000 additional cancer deaths related to the accident among those exposed to significant radiation levels.Benjamin K. Sovacool. A preliminary assessment of major energy accidents, 1907–2007, Energy Policy 36 (2008), pp. 1802-1820. Radioactive fallout from the accident was concentrated in areas of Belarus, Ukraine and Russia. Approximately 350,000 people were forcibly resettled away from these areas soon after the accident. Some of the most serious nuclear and radiation accidents by death toll in the world have involved nuclear submarine mishaps. To-date, all of these were units of the former Soviet Union. ==Normal accidents== Normal Accidents is a 1984 book by Yale sociologist Charles Perrow, which provides a detailed analysis of complex systems from a social sciences perspective. It was the first to characterize complex technological systems such as nuclear power plants according to their riskiness. Perrow says that multiple and unexpected failures are built into society's complex and tightly-coupled systems. Such accidents cannot be designed around. The inspiration for Perrow's books was the 1979 Three Mile Island accident, where a nuclear accident resulted from an unanticipated interaction of multiple failures in a complex system. The event was an example of a normal accident because it was \"unexpected, incomprehensible, uncontrollable and unavoidable\".Perrow, C. (1982), \"The President’s Commission and the Normal Accident\", in Sils, D., Wolf, C. and Shelanski, V. (Eds), Accident at Three Mile Island: The Human Dimensions, Westview, Boulder, pp.173–184. Perrow's argument rests on three principles. Firstly, people make mistakes, even at nuclear plants. Secondly, big accidents almost always escalate from very small beginnings. Thirdly, many failures are those of organizations more than technology. Each of these principles is still relevant today. ==Nuclear power== Nuclear power plant accidents and incidents with multiple fatalities and/or more than US$100 million in property damage, 1952-2011Benjamin K. Sovacool. A Critical Evaluation of Nuclear Power and Renewable Electricity in Asia Journal of Contemporary Asia, Vol. 40, No. 3, August 2010, pp. 393–400.Benjamin K. Sovacool (2009). The Accidental Century - Prominent Energy Accidents in the Last 100 Years Date Location of accident Description of accident Dead Cost ($US millions 2006 ) INES ScaleTimeline: Nuclear plant accidents BBC News, 11 July 2006. Sellafield, Cumberland, United Kingdom A fire at the British atomic bomb project destroyed the core and released radioactive material into the environment. 0 5 Idaho Falls, Idaho, United States Explosion at SL-1 prototype at the National Reactor Testing Station. All 3 operators were killed when a control rod was removed too far. 3 22 4 Frenchtown Charter Township, Michigan, United States Partial core meltdown of the Fermi 1 Reactor at the Enrico Fermi Nuclear Generating Station. 0 132 Lucens reactor, Vaud, Switzerland Loss-of-coolant accident, leading to a partial core meltdown and massive radioactive contamination of the cavern, which was then sealed. 0 4 Sosnovyi Bor, Leningrad Oblast, Russia There was reportedly a partial nuclear meltdown in Leningrad nuclear power plant reactor unit 1. Greifswald, East Germany Electrical error causes fire in the main trough that destroys control lines and five main coolant pumps 0 443 3 Jaslovské Bohunice, Czechoslovakia Malfunction during fuel replacement. Fuel rod ejected from reactor into the reactor hall by coolant (CO2).:cs:Havárie elektrárny Jaslovské Bohunice A-1 2 4 Jaslovské Bohunice, Czechoslovakia Severe corrosion of reactor and release of radioactivity into the plant area, necessitating total decommission 0 1,700 4 Three Mile Island, Pennsylvania, United States Loss of coolant and partial core meltdown due to operator errors. There is a small release of radioactive gases. 0 2,400 5 Athens, Alabama, United States Safety violations, operator error, and design problems force a six-year outage at Browns Ferry Unit 2. 0 110 Athens, Alabama, United States Instrumentation systems malfunction during startup, which led to suspension of operations at all three Browns Ferry Units 0 1,830 Plymouth, Massachusetts, United States Recurring equipment problems force emergency shutdown of Boston Edison’s Pilgrim Nuclear Power Plant 0 1,001 Chernobyl disaster, Ukrainian SSR Overheating, steam explosion, fire, and meltdown, necessitating the evacuation of 300,000 people from Chernobyl and dispersing radioactive material across Europe 56 direct; 4,000 to 985,000 cancerChernobyl: Consequences of the Catastrophe for People and the Environment 6,700 7 Hamm-Uentrop, Germany Experimental THTR-300 reactor releases small amounts of fission products (0.1 GBq Co-60, Cs-137, Pa-233) to surrounding area 0 267 Delta, Pennsylvania, United States Peach Bottom units 2 and 3 shutdown due to cooling malfunctions and unexplained equipment problems 0 400 Lycoming, New York, United States Malfunctions force Niagara Mohawk Power Corporation to shut down Nine Mile Point Unit 1 0 150 Lusby, Maryland, United States Inspections at Calvert Cliff Units 1 and 2 reveal cracks at pressurized heater sleeves, forcing extended shutdowns 0 120 Sosnovyi Bor, Leningrad Oblast, Russia An accident at the Sosnovy Bor nuclear plant leaked radioactive gases and iodine into the air through a ruptured fuel channel. Waterford, Connecticut, United States Leaking valve forces shutdown Millstone Nuclear Power Plant Units 1 and 2, multiple equipment failures found 0 254 Crystal River, Florida, United States Equipment malfunction forces shutdown and extensive repairs at Crystal River Unit 3 0 384 Ibaraki Prefecture, Japan Tokaimura nuclear accident killed two workers, and exposed one more to radiation levels above permissible limits. 2 54 4 Oak Harbor, Ohio, United States Severe corrosion of control rod forces 24-month outage of Davis-Besse reactor 0 143 3 Fukui Prefecture, Japan Steam explosion at Mihama Nuclear Power Plant kills 4 workers and injures 7 more 4 9 1 Forsmark, Sweden An electrical fault at Forsmark Nuclear Power Plant caused one reactor to be shut down 0 100 2 Fukushima, Japan A tsunami flooded and damaged the 5 active reactor plants drowning two workers. Loss of backup electrical power led to overheating, meltdowns, and evacuations. One man died suddenly while carrying equipment during the clean-up. 7 12 September 2011 Marcoule, France One person was killed and four injured, one seriously, in a blast at the Marcoule Nuclear Site. The explosion took place in a furnace used to melt metallic waste. 1 ==Nuclear submarines== Some of the most serious nuclear and radiation accidents by death toll in the world have involved nuclear submarine mishaps. To-date, all of these were units of the former Soviet Union. Reactor accidents that resulted in core damage and release of radioactivity from nuclear-powered submarines include: * K-8, 1960, loss-of-coolant accident; substantial radioactivity released. * K-14, 1961, reactor compartment replaced due to unspecified \"breakdown of reactor protection systems.\" * K-19, 1961, loss-of- coolant accident resulting in 8 deaths and more than 30 other people being over-exposed to radiation.Strengthening the Safety of Radiation Sources p. 14. The events on board the submarine are dramatized by the film K-19: The Widowmaker. * K-11, 1965, both reactors damaged during refueling while lifting the reactor vessel heads; reactor compartments scuttled off the east coast of Novaya Zemlya in the Kara Sea in 1966. * K-27, 1968, experienced reactor core damage to one of its reactors, resulting in 9 fatalities and 83 other injuries; scuttled in the Kara Sea in 1982. * K-140, 1968, reactor damaged following an uncontrolled, automatic increase in power during shipyard work. * K-429, 1970, an uncontrolled start up of the ship's reactor led to a fire and the release of radioactivity * K-116, 1970, loss-of-coolant accident in the port reactor; substantial radioactivity released. * K-64, 1972, failure of the first Alfa-class liquid-metal cooled reactor; reactor compartment scrapped. * K-222, 1980, Papa-class submarine had a reactor accident during maintenance in the shipyard while the ship's naval crew had left for lunch. * K-123, 1982, Alfa-class submarine reactor core damaged by liquid-metal coolant leak; the sub was forced out of commission for eight years. * K-431, 1985, a reactor accident while refueling resulted in 10 fatalities and 49 other people suffered radiation injuries. * K-219, 1986, suffered an explosion and fire in a missile tube, eventually leading to a reactor accident; a 20-year old enlisted seaman, Sergei Preminin, sacrificed his life to secure one of the onboard reactors. The submarine sank three days later. * K-192, 1989, loss-of- coolant accident; reclassified from K-131. ==Radiotherapy accidents== Year Type Accident ARS fatalities ARS survivors Location 1957 alleged crime Nikolay Khokhlov assassination attempt 0 1 Frankfurt, West Germany 1962 orphan source radiation accident in Mexico City 4 ? Mexico City, Mexico 1985 radiotherapy Therac-25 radiation overdose accidents 3 3 1984 orphan source radiation accident in Morocco 8 3 Mohammedia, Morocco 1987 orphan source Goiânia accidentThe Radiological Accident in Goiania p. 2. 4 ? Goiânia, Brazil 1990 radiotherapy radiotherapy accident in ZaragozaStrengthening the Safety of Radiation Sources p. 15. 11 ? Zaragoza, Spain 1996 radiotherapy radiotherapy accident in Costa Rica 7 to 20 46 San José, Costa Rica 2000 orphan source Samut Prakan radiation accident 3 7 Samut Prakan Province, Thailand 2000 radiotherapy Instituto Oncologico Nacional accident 3 to 7 ? Panama City, Panama 2006 crime Poisoning of Alexander Litvinenko 1 0 London, United Kingdom 2010 orphan source Mayapuri radiological accident 1 7 Mayapuri, India ==Related pages== * Nuclear or Not? ==References== Category:Nuclear accidents Category:Nuclear energy",
 "title": "Nuclear and radiation accidents"
}