{
 "id": "175198",
 "text": "Torture in the United States includes cases of torture reported in the United States and outside the country by U.S. government workers. == Torture and the War on Terror == The United States and other countries involved in the War on Terror have used torture to get information from suspected terrorists. Some of the best-known cases of torture involving the United States are the Abu Ghraib scandal and Guantanamo Bay. === Abu Ghraib Prison === Starting in 2004 there were reports that American soldiers had abused prisoners at Abu Ghraib prison in Iraq. In May 2004 a New Yorker article described the abuse and included pictures taken by the torturers. According to an investigation by the Department of Defense called the , the military had been investigating the abuse since 2003. Eventually nine soldiers were discharged from the military and sent to prison. === Guantanamo Bay === Human rights organizations like Amnesty International have said CIA agents used waterboarding and other inhumane methods to get information out of prisoners at Guantanamo Bay. Because of the abuse, President Barack Obama ordered the base to be closed down. ==Slavery== See the main article: Slavery in the United States Before the Thirteenth Amendment ended slavery in 1865, black people were enslaved throughout the United States. People living as slaves were controlled by legally authorized violence. On large plantations, slave overseers were allowed to whip and brutalize noncompliant slaves. Slave codes authorized, indemnified, or even required the use of violence. Abolitionists criticized the codes' brutality. Slaves and free Blacks were regulated by the . Their movements were controlled by patrollers and slave catchers: conscripts from the white population who were allowed to use summary punishment against escaped slaves. Maiming or killing escapees was allowed. === Lynching === See the main article: Lynching in the United States Lynching is \"the public killing of a person who has not received any due process.\" Lynchings took place in all but four states, but happened most often in the Southern United States' Cotton Belt. They were most common from the mid-19th to the mid-20th centuries. Carried out by crowds of people, lynchings were used as a form of mob violence and social control. For example, many lynching victims were black men who were accused of having sex with white women. Torturing and murdering them publicly was a way to terrorize other black men into having relationships only with other African Americans. The victims also included black men who were accused of acting uppity (not obedient enough) towards white people, assaulting them, having sex with them, or raping them. By killing these men, lynch mobs warned every black person in the area that they could be killed for disobeying social rules. Victims got no trial or chance to defend themselves before they were lynched. They were mutilated, tortured, and murdered (usually by hanging and burning). Forms of violence and torture also included genital mutilation, strangulation, and maiming or severing limbs. Most lynchings were inspired by unsolved crime, racism, and innuendo. Police, lawmakers, and (later) federal agents were frequently complicit in lynching while affiliated with Ku Klux Klan groups, releasing prisoners to lynch mobs and/or refusing to prosecute the people who committed a public act of murder. Despite numerous attempts, federal anti-lynching legislation was consistently defeated.Robin D.G. Kelley, \"'Slangin' Rocks ... Palestinian Style,'\" chapter 1 of Police Brutality, Jill Nelson (ed.), 2000. The United States finally recognized lynching as a federal hate crime in 2022. There is documentation about the lynchings of 4,743 people in the United States between 1882 and 1968. Of these, 3,446 were African Americans. There were likely many more victims during and after this period whose murders were not reported. This influenced the Great Migration of 6.5 million African Americans away from southern states. A lynching site found in Noxubee County, Mississippi, a location central to regional mob violence, shows that lynching was still being used as a torture method in the 1970s. === Torture abroad during the Cold War === American officials were involved in counter-insurgency programs in which they encouraged their allies, such as the ARVN, to use torture. Additionally, they actively participated in torture during the 1960s to the 1980s. From 1967 to at least 1972, the Central Intelligence Agency coordinated the , which targeted the infrastructure of the Communist National Front for the Liberation of South Vietnam (\"Viet Cong\"). The program killed 26,000 Viet Cong and captured over 60,000.Counterinsurgency Lessons from Vietnam for the Future, (PDF), Military Review, March–April 2006 Critics argued that many of the victims were civilians, not Viet Cong, but were nevertheless tortured by the South Vietnamese Army under CIA supervision. During the 1970s and 1980s, as part of , American officials supported the internal security apparatus of the regimes in South America's southern cone while those regimes carried out kidnappings, \"disappearances\", torture, and assassinations.J. Patrice McSherry. Predatory States: Operation Condor and Covert War in Latin America. Rowman & Littlefield Publishers, 2005. p. 36. Greg Grandin (2011). The Last Colonial Massacre: Latin America in the Cold War. University of Chicago Press. p. 75. Walter L. Hixson (2009). The Myth of American Diplomacy: National Identity and U.S. Foreign Policy. Yale University Press. p. 223. The United States provided similar support to right-wing governments in Central America, particularly in the 1980s. Many people who participated in these abuses were trained by the U.S. Army School of the Americas.\"Graduates of the School of the Americas include military officers and leaders implicated in torture and mass murder in Guatemala, El Salvador, Chile, Argentina and Haiti, among other Latin American countries.\" Miles Schuman, \"Abu Ghraib: the rule, not the exception ,\" Globe and Mail (Toronto), May 14, 2004. In San Salvador, El Salvador's capital city, Americans were present as supervisors at Mariona Prison, which was well known for a wide variety of forms of torture.Miles Schuman, \"Abu Ghraib: the rule, not the exception ,\" Globe and Mail (Toronto), May 14, 2004. One author, , concluded: > A review of the materials [about Central America] leads relentlessly to just > one conclusion: that the CIA and related U.S. intelligence agencies have > since their [creation] engaged in the widespread practice of torture, either > directly or through well-paid proxies.Harbury, Jennifer (2005), Truth, > Torture, and the American Way: The History and Consequences of U.S. > Involvement in Torture, Beacon Press In 2014, a report by Brazil's asserted that the United States government taught torture techniques to the Brazilian military government of 1964–85.Adam Taylor (10 December 2014). Brazil's torture report brings a president to tears. The Washington Post. Retrieved 12 December 2014. == References == Category:Torture Category:Human rights abuses in the United States",
 "title": "Torture in the United States"
}