{
 "id": "175236",
 "text": "The Central Valley (also called the Great Central Valley) is a very large valley in the middle of California, in the United States. The valley covers about . It is about the size of the state of Tennessee. It is made up of two connected, differently named valleys, the Sacramento Valley and the San Joaquin Valley. The Sierra Nevada Mountains border the valley on the east side. The Coast Range borders it on the west side. The Sacramento River flows through the north part of the Central Valley. This part of the valley is also called the Sacramento Valley. The San Joaquin River flows through the larger south part of the Central Valley. That part is also called the San Joaquin Valley. Both rivers merge eventually and empty into the Pacific Ocean through San Francisco Bay. The capital of California, Sacramento, is in the north part of the Central Valley. The Central Valley is around long. The Central Valley has 18 California counties. Fifteen of these counties are among the 25 most productive farmland counties in California. Overall, the Central Valley economy depends on farming. This has led to serious environmental damages, such as pesticides and selenium and other bad materials being washed into the rivers and polluting the San Francisco Bay. == Geography == The valley floor is a flat, smooth land area covering about . It is long and wide. It covers 19 California counties. These counties are: * Shasta * Tehama * Glenn * Butte * Colusa * Sacramento * El Dorado * Sutter * Yuba * Yolo * Placer * San Joaquin * Solano * Stanislaus * Merced * Madera * Fresno * Kings * Tulare * Kern -from north to south. === Mountain ranges === The Sierra Nevada mountains are on the east side of the valley. These mountains are very tall and steep. Many rivers and streams flow off the Sierra Nevada. The highest mountain in the Sierra Nevada is Mount Whitney (14,495') which is also the tallest mountain in California and the rest of the Contiguous United States. On the west side, there is the California Coast Ranges, an extension of the Pacific Coast Ranges. Its highest point is approximately . === Rivers === The Sacramento River begins in the Cascade Range, but most of it is in the Central Valley. The river flows south about to San Francisco Bay. Some of its tributaries are the Pit River, Feather River, and American River. All these rivers come off the Sierra Nevada. The San Joaquin River begins at the south Sierra Nevada, and flows west and north into the Central Valley and to San Francisco Bay. Altogether, its length is sone . The San Joaquin is more polluted than the Sacramento, and about of it is actually dry. Together, the Sacramento-San Joaquin river system is the water supply of 22-23 million people in California. == Climate == The climate of the Sacramento Valley (north Central Valley) and San Joaquin Valley are very different. The Sacramento Valley has a Mediterranean climate. This means that it has warm, dry summers and cool, wet winters. The San Joaquin Valley is much hotter and drier. Most of it is Mediterranean steppe, which is similar to Mediterranean except that it is warmer and drier. Some of it, however, can be close to desert climate. This section of the Central Valley is said to have the worst air quality in California. == Population and economy == === Population centers === The Central Valley is home to about 6.5 million people. The ten largest cities in or near the valley are, by population: * Sacramento (2,042,283) * Fresno (1,002,284) * Bakersfield (756,825) * Stockton (664,116) * Modesto (505,505) * Visalia (410,874) * Merced (241,706) * Chico (214,185) * Redding (179,904) * Yuba City (165,080) === Population density === However, since most of the land area of the Central Valley is devoted to farming, the population density (amount of people divided by land area) is actually quite low. The population density of the Central Valley is 155 people per square mile (60 people per square kilometer).Calculated by dividing population (6,500,000) by land area (42,000 square miles or 108,779 square km), and rounding to nearest whole number. In contrast, the population density of Los Angeles, the biggest city in California, is 25,904 people per square mile.Calculated by dividing population (12.9 million) by land area (498 square miles) and rounding to nearest whole number. === Economy and agriculture === Farming (agriculture) has always been the main economy of the Central Valley. Except for the city of Sacramento, where the focus is on the government, the rest is mostly agricultural. Immigrants provide a large amount of the work done in farms in the Central Valley. Overall, 12.3% of jobs in the Central Valley are directly agriculture related. Not including Sacramento County, the percentage is 16%. == Transportation == The main road transport routes through the Central Valley are Interstate 5 and California State Route 99. These two highways run from north to south. Interstate 5 is the larger of the two, and carries more traffic. Highway 99 is older than Interstate 5. The Highway 99 separates from Route 5 at the south end of the Central Valley, and joins again at the north end of the valley. The Burlington Northern Santa Fe Railway (BNSF) and the Union Pacific Railroad (UP) go through the Central Valley as well. Some of their branch lines include: * BNSF: ** BNSF Bakersfield Subdivision ** BNSF Stockton Subdivision * UP: ** Union Pacific Railroad Martinez Subdivision ** Fresno Subdivision Amtrak is one of the main rail service providers in the Central Valley, and is also popular in much of the rest of California. == Water supply == The 715-mile (1,150 km) California Aqueduct, the longest aqueduct in California, runs through the Central Valley. Water from the northern Central Valley and the Sierra Nevada goes into this aqueduct. The Central Valley Project is another major water supply project in the Central Valley. This project includes: * Shasta Dam and Shasta Lake (reservoir) * Delta Cross Channel * Delta-Mendota Canal * Friant Dam * Madera Canal * Friant-Kern Canal * Contra Costa Canal * Folsom Dam == Notes ==",
 "title": "Central Valley"
}