{
 "id": "175310",
 "text": "\"Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo\" is a sentence that uses correct grammar. It is often used as an example of how homonyms and homophones can be used to create confusing, hard-to-understand sentences. It has been talked about since 1967, when the sentence was used by Dmitri Borgmann in his book Beyond Language. Later, in 1972, the sentence was used by William J. Rapaport. Rapaport is a professor at the University at Buffalo in Buffalo, New York.Rapaport, William J. 19 February 1992. \"Message 1: Re: 3.154 Parsing Challenges \". linguistlist.org. Retrieved on 14 September 2006. The sentence does not have punctuation. It uses three different meanings of the word \"buffalo\". They are: * noun adjunct (a noun used as an adjective): the city of Buffalo, New York. * noun: the animal called buffalo in the plural form. They are also known as bison. * verb: the word \"buffalo\", which means to confuse or intimidate (to scare somebody). It can be broken down to \"Buffaloa buffalon Buffaloa buffalon buffalov buffalov Buffaloa buffalon\", where \"a\" is adjective, \"n\" is noun, and \"v\" is verb. It means, \"Bison from Buffalo, which other bison from Buffalo confuse, confuse the bison from Buffalo.\" * The first two words, \"Buffalo buffalo,\" mean bison from Buffalo in the same way that \"Florida man\" means a man from Florida. * The next three words, \"Buffalo buffalo buffalo,\" mean \"which other bison from Buffalo confuse.\" We don't need the word which in the original sentence, just like how \"a man which the woman loved\" means the same thing as \"a man the woman loved.\" * The last three words, \"buffalo Buffalo buffalo,\" mean \"confuse the bison from Buffalo.\" Other words can be used to make sentences like this one. These include police, fish, and people. For example, \"Fish fish fish fish fish\". Other times, similar words that are spelled differently can be used: \"Foul fowl foul fowl foul foul foul fowl\". There is a city named Police in Poland. It is therefore possible to form a sentence \"Police police Police police police police Police police\", meaning \"Cops from Police, whom other policemen from Police, Poland, are watching, watch yet other cops from Police, Poland\". ==Why it is confusing to read== The sentence is very confusing because: *Most people do not use the word \"buffalo\" as a verb. *The plural form of the noun \"buffalo\" can be \"buffaloes\" or \"buffalo\". In this sentence, the second form is used, which is spelled the same way as the verb. *There is no punctuation. *Having no words such as that or which makes the sentence harder to follow. *The only distinction between uppercase and lowercase letters is the use of capital B whenever Buffalo is used as a noun or an adjective. Lowercase b is used as a verb. *By saying the word over and over again, it is confusing to read, as most words can't be used like the buffalo sentence. ==References== Category:Grammar Category:Buffalo, New York",
 "title": "Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo"
}