{
 "id": "175465",
 "text": "The Almoravids were a Berber MuslimGlick, Thomas F. Islamic And Christian Spain in the Early Middle Ages. (2005) Brill Academic Publishers page 37 dynasty from Morocco that ruled over a wide area of northwestern Africa and the Iberian Peninsula during the 11th century. Under this dynasty the Western Islamic empire included present-day Morocco, Western Sahara, Mauritania, Gibraltar, Tlemcen (in Algeria) and a great part of what is now Senegal and Mali in the south, and Spain and Portugal to the north in Europe. At its greatest extent, the empire stretched 3,000 kilometres from Zaragoza in the north to Senegal in the south (an all-time latitude spanner until Spanish America). The Almoravids originated as a Sunni Islamic revivalist movement in present-day northern Mauritania and gradually evolved into a military confederation. The Almoravids started to subjugate Senegal and then started expanding northwards. They first captured southern and central Morocco and then took Marrakesh and started to proclaim themselves as an Islamic caliphate. They gathered many soldiers from the Tuareg tribe of Berbers. They then completed the conquest of Morocco by conquering the northern tip of Morocco and reached Ceuta. After conquering Morocco, they established their power base in Morocco rather than their original home, Mauritania. This was due to the isolation of Mauritania and the urbaneness of Morocco perfect for ruling empires. They then began to rule from Morocco after completing the conquest of the country and continued to further expand. Due to calls of help from the Andalusian taifas in Iberia, they expanded into Iberia and conquered the territory of the Islamic taifas there. After their conquest, they implemented Sharia law in all of their conquered territories. They proclaimed a jihad against the Christian Iberian kingdoms and met them at the Battle of Sagrajas where they decisively crushed the Christian army turning the tide of the Reconquista. The Almoravids veiled themselves below the eyes with a tagelmust, a custom they adapted from southern Sanhaja Berbers. (This can still be seen among the modern Tuareg people, but it was unusual further north.) Although practical for the desert dust, the Almoravids insisted on wearing the veil everywhere, as a badge of \"foreignness\" in urban settings, partly as a way of emphasizing their nomadic origins. It served as the uniform of the Almoravids. They wore the veil covering their entire face with the exception of their eyes due to their nomadic desert Saharan origins. The empire reached its territorial extent under the reigns of Yusuf ibn Tashfin and Ali ibn Yusuf. == Rulers == * Abdallah ibn Yasin (1040-1059) * Yusuf ibn Tashfin (1061–1106) * Ali ibn Yusuf (1106–42) * Tashfin ibn Ali (1142–46) * Ibrahim ibn Tashfin (1146) * Ishaq ibn Ali (1146–1147) ==Related pages== * History of Islam * History of Spain == References == * General History of Africa, Africa from the Seventh to the Eleventh Century, Ed. M. Elfasi, Ch. 13 I.Hrbek and J.Devisse, The Almoravids (pp. 336–366), UNESCO, 1988 * == Other websites == * Historical maps of Almoravid Dynasty Maps to be combined and compared * Almoravids Dynasty Berber dynasty Category:Former empires Category:Former countries in Africa Category:Former countries in Europe Category:Royal dynasties Category:12th-century disestablishments in Africa Category:12th-century disestablishments in Europe Category:11th-century establishments in Africa Category:11th-century establishments in Europe Category:1140s disestablishments",
 "title": "Almoravid dynasty"
}