{
 "id": "175757",
 "text": "The Almohad Caliphate (From Arabic al-Muwahhidun, i.e., \"the monotheists\" or \"the Unitarians\"), was a Sunni Muslim empire that was founded in the 12th century, and conquered all of northern Africa as far as Libya, together with Al-Andalus (Moorish Iberia). == History == Between 1130 and his death in 1163, Abd al-Mu'min al-Kumi, a Berber from the Masmuda tribe, defeated the ruling Almoravids and became ruler over all northern Africa as far as Libya. He became Emir of Marrakech in 1149 and conquered Al-Andalus, Moorish Iberia. In 1170 the Almohads transferred their capital to Seville. But by 1212 Muhammad III, \"al-Nasir\" (1199–1214) was defeated by an alliance of the four Christian princes of Castile, Aragón, Kingdom of Navarre and Portugal, at the Battle of Las Navas de Tolosa in the Sierra Morena. The Almohads lost nearly all of the Moorish dominions in Iberia soon after. The great Moorish cities of Córdoba and Seville fell into Christian possession in the first half of the 13th century. The Almohads continued to rule in Africa for some time, but they lost a lot of their territory. The last representative of the line, Idris II, had only Marrakech left. There he was murdered by a slave in 1269. == Muwahhadi (Almohad) Caliphs,1121–1269 == * Ibn Tumart 1121-1130 * Abd al-Mu'min 1130–1163 * Abu Ya'qub Yusuf I 1163–1184 * Abu Yusuf Ya'qub al-Mansur 1184–1199 * Muhammad an-Nasir 1199–1213 * Abu Ya'qub Yusuf II 1213–1224 * Abd al-Wahid I 1224 * Abdallah al-Adil 1224–1227 * Yahya 1227–1235 * Idris I 1227–1232 * Abdul-Wahid II 1232–1242 * Ali 1242–1248 * Umar 1248–1266 * Idris II 1266–1269 == Culture == Sufi writers. * Sidi Abu Madyan Choaïb ben al- Houssein al-Ansari (1126-1198) * Ali ibn Harzihim (m.1164) * Abi Mohammed Salih (1153-1234) * Abu Abdallah ibn Harzihim (m.1235) * Abu-l-Hassan ash- Shadhili (1197-1258) * Abdelwahid al-Marrakushi (b. 1185) historian and writer * Salih ben Sharif al-Rundi (1204-1285) ==Related pages== * History of Islam * History of Spain * Nasrid * Reconquista == References == * History of the Almonades, Reinhart Dozy, (second edition, 1881) * Mica Enciclopedie de Istorie Universala, Marcel D. Popa, Horia C. Matei, (Bucharest, Editura Politica 1988) == Other websites == * Historical maps of Almohad Dynasty Maps to be combined and compared * Almohads Dynasty Berber dynasty Category:Former countries in Europe Category:Former countries in Africa Almohad dynasty Category:Former empires Category:1120s establishments Category:1260s disestablishments Category:12th-century establishments in Europe Category:12th-century establishments in Africa Category:Disestablishments in Europe Category:Disestablishments in Africa Category:11th century in Africa Category:12th century in Africa Category:13th century in Africa",
 "title": "Almohad"
}