{
 "id": "175981",
 "text": "Bose–Einstein condensate (BEC) is what happens to a dilute gas when it is made very cold, near absolute zero (0 K which equals −273.15 °C or −459.67 °F). It forms when the particles that make it up have very low energy. Only bosons can make a Bose–Einstein condensate. The gas has an extremely low density, about one-hundred-thousandth the density of normal air. A Bose–Einstein condensate is a change of state. When matter is in the BEC state it has zero viscosity. Superfluidity and superconductivity are both closely connected with the BEC state of matter. == Theory == Particles have energy. They can have a lot of energy and bounce wildly like in gases; have less energy and flow like a liquid; or have even less energy like a solid. If you take enough of the particle's energy away you get to the tiniest or the smallest amount of energy possible. This is a Bose–Einstein condensate. This makes all of the particles exactly the same and instead of bouncing around randomly in all different directions, they all bounce up and down in exactly the same way, forming something called a 'giant matter wave'. == History == The Bose-Einstein Condensate was first suggested by Satyendra Nath Bose and Albert Einstein in 1924–25. Seventy years later, its existence was proved.Levi, Barbara Goss 2001. Cornell, Ketterle, and Wieman Share Nobel Prize for Bose–Einstein Condensates. Physics Today online. Eric Cornell and Carl Wieman made the first Bose–Einstein condensate in 1995 at the University of Colorado. Cornell, Wieman,and Wolfgang Ketterle at MIT were then given the 2001 Nobel Prize in Physics. == Experiments == Usually, to get anything cold enough to make a Bose–Einstein condensate you must first trap the boson using magnets, then, by bouncing lasers off them, take all of their energy away (Laser cooling). But, this still doesn't get it cold enough. Some of the particles will still be bouncing around a lot, and only some will be lying down as needed, so the magnetic field is slowly lowered bit by bit, to let the faster bouncing particles out. This leaves the coldest and slowest atoms inside. == References == Category:Quantum mechanics Category:States of matter",
 "title": "Bose–Einstein condensate"
}