{
 "id": "176105",
 "text": "The Los Angeles River (also called: El Rio De Nuestra Senora La Reina De Los Angeles De Porciuncula or Porciuncula River; Spanish: River of the Angels; informally LA River) is a river flowing through Los Angeles County, California, in the United States. About long, it flows from Canoga Park south and west to its end at the Long Beach Harbor, in San Pedro Bay, part of the Pacific Ocean. The basin is rimmed by the San Gabriel Mountains, Santa Monica Mountains and Santa Susana Mountains, as well as several smaller mountain ranges. Much of the water that flows in the Los Angeles River flows in from tributaries that come from the mountains.The Los Angeles River: Its Life, Death, and Possible Rebirth. Blake Gumprecht. Baltimore and London: Johns Hopkins University Press, 1999. . The river was once free-flowing, winding across a floodplain that occupied much of the Los Angeles Basin. With its frequent floods, it often changed course, causing erosion and depositing silt in other places. When the city of Los Angeles had its first settlers around the 1850s, the river was its main water source. With the opening of the Los Angeles Aqueduct in 1913, the Los Angeles River was no longer needed as a water source. Today, the Los Angeles River runs in a fixed course through a concrete channel for nearly its whole length. It is heavily polluted. The primary source of water during summer and fall is the Donald C. Tillman Water Reclamation Plant in Van Nuys. Plans for restoration of the river are being discussed. == Watershed == The watershed of the Los Angeles River covers 834 square miles (2,135 square kilometers). The Santa Monica Mountains and smaller Simi Hills border it on the east side. On the west side lies the San Gabriel Mountains and Santa Susana Mountains. Seven major tributaries flow into the Los Angeles River: Burbank Western Channel, Aliso Wash, Tujunga Wash, Verdugo Wash, Arroyo Seco, Compton Creek, and Rio Hondo. 360 square miles (920 square kilometers) of the watershed are open space, while the remaining 474 square miles (1,215 square kilometers) are highly developed with all kinds of land uses. The river officially begins in a place called Canoga Park, in the San Fernando Valley. Bell Creek and Calabasas Wash (Arroyo Calabasas or Calabasas Creek; Calabasa is Spanish for \"pumpkin\") flow from opposite sides of the valley to a point () where the Los Angeles River officially begins. At this point, the river already flows in a concrete channel. In times of flood, the channel can move between per hour to up to or even per hour. Tujunga Wash, Aliso Wash, and Brown's Canyon Wash join the river from the left. The river flows on to a basin called the Sepulveda basin, controlled by a dam at its southeastern end. This basin is incredibly rich in wildlife and plants. Normally, there wouldn not be a year-round flow of water here. But because of 75 million gallons of water flowing into the river every day from the Donald C. Tillman Water Reclamation Plant, there is an year-round flow of water. This water is not suitable to be drinking water, but is safe to touch. An important tributary, Verdugo Wash, flows in from the left. The Verdugo Wash begins in the Verdugo Hills and flows west to the Los Angeles River. Uniquely, the intersection of Interstate 5 and Route 134 is located right above this point. The Los Angeles River makes a great bend west around Griffith Park, a big park in the middle of Los Angeles. Here, the river has an earthen bottom, which is unique because most of the river is covered with concrete. Further downstream, there is a place uniquely named \"Frogtown\" because of the many frogs once found in the river there. Downstream from this place, the river picks up another important tributary, Arroyo Seco, on the left. (The name \"Arroyo Seco\" means \"dry creek\" in Spanish.) The Arroyo Seco begins in the San Gabriel Mountains and flows south to the Los Angeles River. One important feature of the Arroyo Seco is the giant Devil's Gate Dam. The Arroyo Seco is free-flowing in many places. After flowing a few more miles, the Los Angeles River becomes very wide. The final large tributary, Rio Hondo (Spanish for \"deep river\") flows in from the left, in the city of South Gate. Notably, the sediment here is over deep. Here, the threat of floods is always present. In fact, in a flood in 1992, the water was only a few inches below the top of the riverbank. As the river approaches San Pedro Bay and eventually the Pacific Ocean, it passes by the RMS Queen Mary, a retired ocean liner now a museum and hotel. == History == === Original river === The Los Angeles River was originally a free- flowing river, running across a wide basin that would periodically flood. The river would have heavy flows in the winter and spring (rainy season) and little to no flow in the summer and fall (dry season). However, water being forced out of an aquifer below the Los Angeles Basin gave parts of the river an year-round flow. This phenomenon can still be seen today, most notably in a place called Griffith Park where water rises out of the ground and feeds the river. === Native American era to Spanish settlement === The river was used for hundreds of years by pre Columbian natives as a source of drinking water and food. When Spanish explorers came to the area in the 1760s, they named the river the Porciuncula, seeing that it was a good site for a settlement. The full name they gave the river was actually El Río de Nuestra Señora La Reina de Los Ángeles de Porciúncula, which translated to English means: The River of Our Lady Queen of the Angels of Porciúncula. (Porciuncula is a small church in Italy.) But they were to soon find out, the Los Angeles River had, and still has, a long history of floods. Many times when the river flooded, it would change course from Ballona Creek, a stream flowing into Santa Monica Bay on the northeast; to its original channel flowing into San Pedro Bay. One big flood in 1825, it left Ballona Creek and flowed into its old channel, and Ballona Creek became a separate, long waterway. It still is that way today. === Late 1800s to early 1900s === The city of Los Angeles rose beside the Los Angeles River, inland at the site of the old Spanish settlement. In 1889, San Pedro Bay, the place where the river flows into, was chosen as the city harbor. A series of railroads were needed to connect the city with the port. The most logical route was beside the river, since that was the smoothest land. With the railroads came industry, which rose up all along the lower Los Angeles River. With its disastrous flood history, and the fact that it was too shallow for boats, the river was finally forced into a concrete channel beginning in 1938. === Los Angeles Flood of 1938 === 1938 was the same year that a terrible flood struck the region. From February 27 to March 1, 1938, a storm approached the California coast. Over 4.4 inches (11 cm) of rain fell. That was the equivalent of one-fourth the average yearly rainfall in the area. Finally, on 5:45 AM on March 4, the rain ended, and the flood slowly dropped in level. it seemed similar to the earlier flood in 1934. Everyone thought that it was already over, but it was not. 15 hours later, another storm hit Southern California, dumping another 6-10 inches (15–25 cm) of rain. The soils of the region could not take in any more water from the rains of the past few days. The three major rivers in the region, the Los Angeles, San Gabriel, and the Santa Ana, burst their levees and flooded three California counties. It was the 5th largest flood in the recorded history of the area. 5,601 houses were destroyed, 1,500 houses were damaged, and 800 cars were trapped in the mud. But Los Angeles County was not as affected as neighboring Riverside County and Orange County, for it was those two counties that suffered the worst floods. However, the flood was not as bad as it could have been. Fourteen flood control dams in the mountains and around the Los Angeles area held back huge amounts of water, which would otherwise add to the flood. These dams included the Hansen Dam, Big Tujunga Dam, and San Gabriel No. 1 and No. 2. At its peak, the Los Angeles River's flow was about 38,000 cubic feet (1,076 cubic meters) per second. The nearby San Gabriel River's flow, though, approached 100,000 cubic feet (2,832 cubic meters) per second. Most flooded of all was the \"crazy-mad\" Santa Ana River, which looked like a \"slightly smaller version of the Mississippi.\" === Restoration === Many restoration efforts to convert the river from a concrete-lined channel back to its natural state have been proposed recently. Also, some river conservation groups, most notably Friends of the Los Angeles River (FoLAR) have been created. The Los Angeles River Master Plan was created in 1991 as a plan to restore a large stretch of the river and one of its large tributaries, the Tujunga Wash. Part of the incentive for the project is because the Great Wall of Los Angeles, one of the largest murals in the world, is painted on the wall of the Tujunga Wash. Other than that, the plan seeks to improve recreation, health, property value, environment, and education in the communities surrounding the river; by building a series of parks. This helps to increase the open space available in Los Angeles; its open space percentage is uncharacteristically low. For example, the city of Boston has 9% open space, over twice as much as Los Angeles' 4% open space. Notably, the City of Los Angeles agreed in 2007, by a 12-0 vote, to spend some $2 billion USD over the next 50 years. The money will be used to fund over 200 separate projects, including parks, walkways, and pedestrian bridges; along a stretch of the river. Some factories and other buildings near the river will be removed so houses can be built closer to the river. == Riverside communities == The biggest city beside the Los Angeles River is Los Angeles. There are many other cities and towns that lie beside the river. * Canoga Park * Reseda * Van Nuys * Sherman Oaks * Studio City * Universal City * Toluca Lake * Burbank * Glendale * Los Feliz * Atwater Village * Elysian Valley * Glassell Park * Cypress Park * Chinatown * Lincoln Heights * Boyle Heights * Vernon * East Los Angeles * South Central Los Angeles * Maywood * Commerce * Bell * Bell Gardens * Cudahy * South Gate * Lynwood * Paramount * Compton * Long Beach == Crossings == Bridges that cross the Los Angeles River. Crossings are listed from south to north.National Bridge Inventory * Queensway Bay Bridge (1969) * Ocean Boulevard (1959) * Shoreline Drive (connection to Interstate 710 - Long Beach Freeway) (1963) * Anaheim Street (1954) * State Route 1 - Pacific Coast Highway (1957) * Willow Street (1946) * Wardlow Road (1950) * Interstate 405 - San Diego Freeway (1963) * Railroad (Metro Blue Line) * Railroad * Del Amo Boulevard (1958) * Long Beach Boulevard (1946) * Artesia Boulevard (1949) * State Route 91 - Artesia Freeway (1971) * Atlantic Avenue (1937) * Alondra Boulevard (1958) * Somerset Boulevard (1976) * Rosecrans Avenue (1951) * Interstate 105 - Glenn Anderson Freeway including the Metro Green Line (1990) * Imperial Highway (1951) * Interstate 710 - Long Beach Freeway (1955) * Railroad * Firestone Boulevard (1950) * Railroad * Clara Street (1939) * Florence Avenue (1948) * Gage Avenue (1940) * Railroad * Slauson Avenue (1942) * Atlantic Boulevard (1931) * Railroad * Downey Road (1931) * Bandini Boulevard (1969) * Soto Street (1928) * 26th Street (2000) * Railroad * Railroad (Redondo Flyover for Metrolink's Orange County Line, 91 Line, and Amtrak's Pacific Surfliner) * Washington Boulevard (1931) * Railroad * Olympic Boulevard (1925) * Interstate 10 - Santa Monica Freeway (1959) * 7th Street (1927) * Whittier Boulevard (1932) * 4th Street (1930) * 1st Street (1929) * U.S. Route 101 - Santa Ana Freeway (1944) * Cesar E. Chavez Avenue (1926) * Railroad (crossing for Metrolink's San Bernardino Line and Riverside Line) * Railroad * Main Street (1910) * Spring Street (1928) * North Broadway Bridge (1909) * Railroad (Metro Gold Line) * State Route 110 northbound - Figueroa Street Viaduct (1937) * State Route 110 southbound - Los Angeles River Bridge (1943) * Railroad (crossing for Metrolink's Antelope Valley Line and Ventura County Line) * Dayton Avenue Bridge (1939) * Interstate 5 - Elysian Viaduct (1962) * State Route 2 - Glendale Freeway (1961) * Fletcher Drive (1927) * Glendale Boulevard (1929) * Los Feliz Boulevard (1925) * Colorado Street (1957) * State Route 134 - Ventura Freeway (1962) * Interstate 5 - Golden State Freeway (1957) * Riverside Drive (1938) * State Route 134 - Ventura Freeway (1957) * Avon Street * Barham Boulevard (1935) * Cahuenga Boulevard and Lankershim Boulevard (1940) * U.S. Route 101 - Hollywood Freeway (1957) * Vineland Avenue (1930) * Tujunga Avenue (1949) * Colfax Avenue (1956) * Private road in the CBS Studio Center * Radford Avenue (1950) * Laurel Canyon Boulevard (1951) * Laurelgrove Ave [Pedestrian Bridge] (1996) * Whitsett Avenue (1950) * Coldwater Canyon Avenue (1951) * Fulton Avenue (1951) * Moorpark Street (1952) * Woodman Avenue (1952) * Hazeltine Avenue (1960) * U.S. Route 101 - Ventura Freeway (1959) * Van Nuys Boulevard (1952) * Kester Avenue (1972) * Sepulveda Boulevard (1928) * Interstate 405 - San Diego Freeway (1958) * Burbank Boulevard (1974) * Balboa Boulevard (1941 and 1964) * Busway (Metro Orange Line) * White Oak Avenue (1960) * Lindley Avenue (1957) * Victory Boulevard (1963) * Reseda Boulevard (1955) * Wilbur Avenue (1957) * Tampa Avenue (1957) * Corbin Avenue (1957) * Winnetka Avenue (1958) * Vanowen Street (1958) * Mason Avenue (1958) * De Soto Avenue (1958) * Railroad * Canoga Avenue (1956) * Owensmouth Avenue (1958) == Nearby rivers == === North along coast === * Ballona Creek === South along coast === * San Gabriel River == References == == Other websites == * Friends of the Los Angeles River * Photo Tour of the Los Angeles River (from Canoga Park to South Gate) * Los Angeles River Revitalization Master Plan Index * Los Angeles River Railroads Category:Rivers of Los Angeles County, California Category:Geography of Los Angeles",
 "title": "Los Angeles River"
}