{
 "id": "176378",
 "text": "Ragdoll Productions Limited, or simply Ragdoll, is a British television production company founded in 1984 by Anne Wood, who had previously worked for Yorkshire Television and TV-am. It is located in Stratford-upon-Avon, Warwickshire, and has produced a number of children's programmes, most notably Pob's Programme, Teletubbies, Rosie and Jim, Brum, Boohbah, Tots TV, and In the Night Garden..., most of which are now owned by WildBrain. == Pre-Ragdoll productions == The following are some of Ragdoll's productions before the company was founded, accompanied by a brief description and vital statistics: * Puzzle Party - first broadcast in 1977. Hosted by Gyles Brandreth and featuring characters Gnigel and Gnu, the show was one of Anne Wood's earliest TV shows for the BBC. * The Book Tower - first broadcast in 1979, hosted by Tom Baker and Stephen Moore. * Ragdolly Anna - first broadcast in 1982, based on the children's books by Jean Kenward. * Roland Rat - first broadcast in 1983. ==Productions== Ragdoll's programmes produced between 1990 and 2017 (excluding Pob's Programme, BOOM! and Storytime) are currently owned by WildBrain (formerly known as DHX Media). === Ragdoll Productions === Title Year(s) Network Notes/Sources Pob's Programme 1985–1990 Channel 4 Currently distributed by Channel 4 Distribution Playbox 1987–1992 ITV (Central) Currently owned by ITV Studios The Magic Mirror 1989 ITV Co-production for The Kellogg Company Ragdoll's first animated production BOOM! 1990–1991 Channel 4 Ragdoll's first non-puppet live-action production Currently distributed by Channel 4 Distribution Rosie and Jim 1990-2000 ITV (Central) Brum 1991, 1994 2001–2002 BBC One (Children's BBC/CBBC) CBeebies Tots TV 1993–1998 ITV (Central) Co-produced with Carlton Television in later seasons Rights co-owned with ITV Studios Open a Door 1994–2003 BBC Two (Children's BBC/CBBC) CBeebies An international short film series co-produced with other companies. Storytime 1995–1997 BBC Two Series 5-6 only Teletubbies 1997–2001 BBC Two (Children's BBC/CBBC) Original series, revivals/reboots are produced by DHX Media. Badjelly the Witch 2000 BBC One Television special/movie Co-produced with Norma Farnes Management Teletubbies Everywhere 2002 CBeebies Short form series Boohbah 2003–2006 ITV (CITV and GMTV) Co-produced with GMTV Blips 2005–2006 ITV (CITV) What Makes Me Happy 2005 Five (Milkshake!) Co- produced with The Ragdoll Foundation Series of six short films Twirlywoos 2015–2017 CBeebies Co-produced with DHX Media What Shall We Do With The Angry Monster? 2018 YouTube Short film Co-produced for Disney UK B.O.T. and the Beasties 2021 CBeebies Short form series Distributed by Cake Entertainment Untitled Chris Wood/Andrew Davenport series 2025 CBeebies Co-produced with Foundling Bird === Ragdoll Worldwide === Title Year(s) Network Notes/Sources In the Night Garden... 2007–2009 CBeebies Tronji 2009–2010 CBBC Dipdap 2011 CBeebies Short form series The Adventures of Abney & Teal 2011–2012 CBeebies ==Notes and references== == Other websites == *Ragdoll's Web site Category:Television production companies Category:British entertainment companies",
 "title": "Ragdoll Productions"
}