{
 "id": "176398",
 "text": "Ray Comfort (born December 5, 1949) is a New Zealand-born American Christian minister and evangelist of Jewish descent.www1.cbn.com He started Living Waters Publications and The Way of the Master, with Kirk Cameron, and has written many books. ==Publications== * You Can Lead an Atheist to Evidence, But You Can't Make Him Think. WND Books (February 12, 2009) * The Charles Darwin Bible (HCSB) (2009) * The Atheist Bible (HCSB) (2009) * Comfort Food (2008) * World Religions in a Nutshell: A Compact Guide to Reaching Those of Other Faith (2008) * 101 of the Dumbest Things People Have Done (2008) * Evolution: A Fairy Tale for Grownups (2008) * How to Know God Exists: Scientific Proof of God (2008) * Hollywood Be Thy Name. Bridge-Logos Publishers (July 1, 2007) * Intelligent Design vs. Evolution - Letters to an Atheist (2006), a collection of correspondence between Comfort and James D. Franz, an American atheist. * Springboards for Budding Preachers (2006), a transcript of Comfort open-air preaching with his son-in-law Emeal \"EZ\" Zwayne. * The Way of the Master. Genesis Publishing Group (2006) (previously 2004 by Tyndale House) * The Way of the Master Minute. (co-author Kirk Cameron) Bridge-Logos Publishers (April 8, 2006) * How to Live Forever ... Without Being Religious (2006), a version of the Gospel of John with Comfort's commentary. * Whitefield Gold: Pure. Refined. (compiled by Comfort) (2006) * Spurgeon Gold: Pure. Refined. (compiled by Comfort) (2005) * Overcoming Panic Attacks. Bridge-Logos (July 11, 2005) * What Did Jesus Do? A Call to Return to the Biblical Gospel (2005) * How to Bring Your Children to Christ ... and Keep Them There (2005) * What Hollywood Believes: An Intimate Look at the Faith of the Famous. Genesis Pub. (August 25, 2004) * Hell's Best Kept Secret. Whitaker House (December 1989, updated 2004) * Scientific Facts in the Bible: 100 Reasons to Believe the Bible is Supernatural in Origin. Bridge-Logos Publishers (October 15, 2001) * The School of Biblical Evangelism Textbook (2004) * 101 Things Husbands Do to Annoy Their Wives (2004) * Out of the Comfort Zone: The Authorized Autobiography. Bridge-Logos Publishers (May 2004) * God Doesn't Believe in Atheists (1993, 2001) * The Mystery (2000) * How to Win Souls and Influence People. Bridge-Logos Publishers (October 1999) == References == == Other websites == * LivingWaters.com, the ministry of Ray Comfort – official website. * Ray Comfort Food – official blog * The Way of the Master – the website for his ministry with Kirk Cameron. * * Christian Evangelist's Book Ranked Bestselling 'Atheist' Item at The Christian Post Category:1949 births Category:Living people Category:American Evangelicals Category:American Christian clergy Category:American Christian writers Category:Naturalized citizens of the United States Category:Oceanic Jews Category:People from Christchurch",
 "title": "Ray Comfort"
}