{
 "id": "176458",
 "text": "In mathematics, hyperbolic geometry is a non-Euclidean geometry, meaning that the parallel postulate that defines Euclidean geometry isn't true. On a hyperbolic plane, lines that started out parallel will become further and further apart. Replacing this rule means that hyperbolic geometry is different from ordinary flat plane geometry. For example, triangles will have angles that add up to less than 180 degrees, meaning that they are too pointy and will look like the sides are sinking into the middle. Many real objects look like hyperbolic planes. For example, some types of coral and lettuce are shaped like pieces of hyperbolic planes. Other people say that it's easier to draw a map of the Internet when your map isn't flat, because there are a lot of computers around the edges but very few in the center. Some physicists even think our universe is a little bit hyperbolic. ==Formal definition== The parallel postulate in Euclidean geometry says that in two dimensional space, for any given line l and point P not on l, there is exactly one line through P that does not intersect l. This line is called parallel to l. In hyperbolic geometry there are at least two such lines through P. As they do not intersect l, the parallel postulate is false. Models have been constructed within Euclidean geometry that obey the axioms of hyperbolic geometry. These models prove that the parallel postulate is independent of the other postulates of Euclid. Because there is no hyperbolic analogue to Euclidean parallel lines, the hyperbolic use of parallel and related terms varies among writers. In this article, the two limiting lines are called asymptotic and lines that have a common perpendicular are called ultraparallel. The simple word parallel may apply to both. == Non-intersecting lines == An interesting property of hyperbolic geometry follows from the occurrence of more than one parallel line through a point P: there are two classes of non-intersecting lines. Let B be the point on l such that the line PB is perpendicular to l. Consider the line x through P such that x does not intersect l, and the angle θ between PB and x counterclockwise from PB is as small as possible; i.e., any smaller angle will force the line to intersect l. This is called an asymptotic line in hyperbolic geometry. Symmetrically, the line y that forms the same angle θ between PB and itself but clockwise from PB will also be asymptotic. x and y are the only two lines asymptotic to l through P. All other lines through P not intersecting l, with angles greater than θ with PB, are called ultraparallel (or disjointly parallel) to l. Since there are an infinite number of possible angles between θ and 90 degrees, and each one will determine two lines through P and disjointly parallel to l, there exist an infinite number of ultraparallel lines. Thus we have this modified form of the parallel postulate: In hyperbolic geometry, given any line l, and point P not on l, there are exactly two lines through P which are asymptotic to l, and infinitely many lines through P ultraparallel to l. The differences between these types of lines can also be looked at like this: the distance between asymptotic lines run to zero in one direction and grows without bound in the other; the distance between ultraparallel lines increases in both directions. The ultraparallel theorem states that there is a unique line in the hyperbolic plane that is perpendicular to each of a given pair of ultraparallel lines. In Euclidean geometry, the angle of parallelism is a constant; that is, any distance \\lVert BP \\rVert between parallel lines yields an angle of parallelism equal to 90°. In hyperbolic geometry, the angle of parallelism varies with the \\Pi(p) function. This function, described by Nikolai Ivanovich Lobachevsky, produces a unique angle of parallelism for each distance p = \\lVert BP \\rVert. As the distance gets shorter, \\Pi(p) approaches 90°, whereas with increasing distance \\Pi(p) approaches 0°. Thus, as distances get smaller, the hyperbolic plane behaves more and more like Euclidean geometry. Indeed, on small scales compared to \\frac{1}{\\sqrt{-K}}, where K\\\\! is the (constant) Gaussian curvature of the plane, an observer would have a hard time determining whether he is in the Euclidean or the hyperbolic plane. == History == For centuries, geometers tried to prove the parallel postulate. They failed, but their efforts gave birth to hyperbolic geometry. The theorems of Alhacen, Khayyam on quadrilaterals, were the first theorems on hyperbolic geometry. Their works on hyperbolic geometry had an influence on its development among later European geometers, including Witelo, Alfonso and John Wallis. In the nineteenth century, hyperbolic geometry was explored by János Bolyai and Nikolai Ivanovich Lobachevsky, after whom it sometimes is named. Lobachevsky published in 1830, while Bolyai independently discovered it and published in 1832. Karl Friedrich Gauss also studied hyperbolic geometry, describing in a 1824 letter to Taurinus that he had constructed it, but did not publish his work. In 1868, Eugenio Beltrami provided models of it, and used this to prove that hyperbolic geometry was consistent if Euclidean geometry was. The term \"hyperbolic geometry\" was introduced by Felix Klein in 1871. For more history, see article on non-Euclidean geometry. == Models of the hyperbolic plane == There are three models commonly used for hyperbolic geometry: the Klein model, the Poincaré disc model, and the Lorentz model, or hyperboloid model. These models define a real hyperbolic space which satisfies the axioms of a hyperbolic geometry. Despite the naming, the two disc models and the half-plane model were introduced as models of hyperbolic space by Beltrami, not by Poincaré or Klein. # The Klein model, also known as the projective disc model and Beltrami-Klein model, uses the interior of a circle for the hyperbolic plane, and chords of the circle as lines. # The Poincaré half-plane model takes one- half of the Euclidean plane, as determined by a Euclidean line B, to be the hyperbolic plane (B itself is not included). #* Hyperbolic lines are then either half-circles orthogonal to B or rays perpendicular to B. #* Both Poincaré models preserve hyperbolic angles, and are thereby conformal. All isometries within these models are therefore Möbius transformations. #* The half-plane model is identical (at the limit) to the Poincaré disc model at the edge of the disc #*This model has direct application to special relativity, as Minkowski 3-space is a model for spacetime, suppressing one spatial dimension. One can take the hyperboloid to represent the events that various moving observers, radiating outward in a spatial plane from a single point, will reach in a fixed proper time. The hyperbolic distance between two points on the hyperboloid can then be identified with the relative rapidity between the two corresponding observers. == Visualizing hyperbolic geometry == M. C. Escher's famous prints Circle Limit III and Circle Limit IV illustrate the conformal disc model quite well. In both one can see the geodesics. (In III the white lines are not geodesics, but hypercycles, which run alongside them.) It is also possible to see quite plainly the negative curvature of the hyperbolic plane, through its effect on the sum of angles in triangles and squares. In the Euclidean plane, their angles would sum to 450°; i.e., a circle and a quarter. From this we see that the sum of angles of a triangle in the hyperbolic plane must be smaller than 180°. Another visible property is exponential growth. In Circle Limit IV, for example, one can see that the number of angels and demons within a distance of n from the center rises exponentially. The demons have equal hyperbolic area, so the area of a ball of radius n must rise exponentially in n. There are several ways to physically realize a hyperbolic plane (or approximation thereof). A particularly well- known paper model based on the pseudosphere is due to William Thurston. The art of crochet has been used to demonstrate hyperbolic planes with the first being made by Daina Taimina. In 2000, Keith Henderson demonstrated a quick-to- make paper model dubbed the \"hyperbolic soccerball\". == Other websites == * Visions of Infinity: Tiling a hyperbolic floor inspires both mathematics and art Science News: Dec. 23, 2000; Vol. 158, No. 26/27, p. 408 * Java freeware for creating sketches in both the Poincaré Disk and the Upper Half-Plane Models of Hyperbolic Geometry University of New Mexico * \"The Hyperbolic Geometry Song\" A short music video about the basics of Hyperbolic Geometry available at YouTube. * * * More on hyperbolic geometry, including movies and equations for conversion between the different models University of Illinois at Urbana-Champaign *, interactive instructional website. == References == == Literature == * Coxeter, H. S. M. (1942) Non-Euclidean geometry, University of Toronto Press, Toronto * Nikolai I. Lobachevsky, Pangeometry, Translator and Editor: A. Papadopoulos, Heritage of European Mathematics Series, Vol. 4, European Mathematical Society, 2010. * Milnor, John W. (1982) Hyperbolic geometry: The first 150 years, Bull. Amer. Math. Soc. (N.S.) Volume 6, Number 1, pp. 9–24. * Reynolds, William F. (1993) Hyperbolic Geometry on a Hyperboloid, American Mathematical Monthly 100:442-455. * Stillwell, John. (1996) Sources in Hyperbolic Geometry, volume 10 in AMS/LMS series History of Mathematics. * Samuels, David. (March 2006) Knit Theory Discover Magazine, volume 27, Number 3. * James W. Anderson, Hyperbolic Geometry, Springer 2005, Category:Fields of geometry",
 "title": "Hyperbolic geometry"
}