{
 "id": "17641",
 "text": "Santa Claus, also called Father Christmas, Saint Nick, Saint Nicholas, Kris Kringle, or Santa, is a magical being from legends and folklore who is said to bring gifts to children on Christmas Eve. He is usually depicted as a fat, happy man with a white beard who wears a red suit with white trim. He is said to live in his workshop at the North Pole with his wife Mrs. Claus, Christmas elves who make the gifts for the kids, and flying reindeer who pull his sleigh through the sky, which is how he travels the world. ==Santa Claus' home== In the Nordic version, Santa is said to live in a small hill called Korvatunturi in Lapland, Finland. There is a theme park in Rovaniemi, which is near Korvatunturi, called Santa Claus Village. The saint who inspired the legend of Sinterklaas (and thus, Santa Claus) is Saint Nicholas, who lived in the 4th Century AD and had a reputation for secret gift-giving, especially to the poor and needy, such as putting coins in the shoes of those who left them out for him. He lives at the top of the world at the North Pole with his wife Mrs. Claus, elves, and reindeer. As his home and workshop are fictional, there is no definite geographical location as to where the home or workshop is located. ==Santa tracking, Santa websites, and email to and from Santa== Over the years, there have been a number of websites created by various organizations that have purported to track Santa. Some, such as NORAD Tracks Santa, the Airservices Australia Tracks Santa Project, the Santa Update Project, and the MSNBC and Bing Maps Platform Tracks Santa Project have endured. Others, such as the Dallas/Fort Worth International Airport's Tracks Santa Project, the Santa Retro Radar – Lehigh Valley Project, and the NASA Tracks Santa Project, have fallen out of use. The NORAD Tracks Santa program began in the United States in 1955, when a Sears Roebuck store in Colorado Springs, Colorado gave children a telephone number to call a \"Santa hotline.\" The number was mistyped, resulting in children calling the Continental Air Defense Command on Christmas Eve instead. Colonel Harry Shoup, the Director of Operations, received the first call for Santa and responded by telling children there were signs on the radar that Santa was indeed heading south from the North Pole. A tradition began which continued under the name NORAD Tracks Santa when in 1958, the United States and Canada jointly created the North American Air Defense Command (NORAD). This tracking can now be done through the Internet and NORAD's website. Many local television stations in the United States and Canada claimed to have tracked Santa in their own metropolitan areas through the stations' meteorologists. In December 2000, the Weather Channel built upon these local efforts to provide a national Christmas Eve Santa tracking effort called SantaWatch in cooperation with NASA, the International Space Station, and Silicon Valley-based new multimedia firm Dreamtime Holdings. In the 21st century, most local television stations in the United States and Canada rely upon outside established \"Santa tracking\" efforts, such as NORAD Tracks Santa. Many other websites became available year-round, devoted to Santa and pretend to keep tabs on his activities in his workshop. Many of these websites also include email addresses which allow children to send email to Santa. Most of these websites use volunteer living people as \"elves\" to answer email sent to Santa. However, some websites, such as Santa's page on Microsoft's Windows Live Spaces, have used or still use \"bots\" to compose and send email replies, with occasional unfortunate results. One particular website called emailSanta.com was created when a 1997 Canada Post strike prevented a man named Alan Kerr (credited as the \"Head Elf\")'s young niece and nephews from sending their letters to Santa; in a few weeks, over 1,000 emails to Santa were received and had received 1,000 emails a day one year later. In addition to providing holiday-themed entertainment, \"Santa tracking\" websites raise interest in space technology and exploration, serve to educate children in geography. and encourage them to take an interest in science. ==In popular culture== By the end of the 20th century, the reality of mass mechanized production became more fully accepted by the Western public. Elves had been portrayed as using assembly lines to produce toys early in the 20th century. That shift was reflected in the modern depiction of Santa's residence—now often humorously portrayed as a fully mechanized production and distribution facility, equipped with the latest manufacturing technology, and overseen by the elves with Santa and Mrs. Claus as executives and / or managers.Nissenbaum, chap. 2; Belk, 87–100 An excerpt from a 2004 article, from a supply chain managers' trade magazine, illustrates this: In cartoons Santa has been voiced by many people, including Ed Asner, Stan Francis, Mickey Rooney, John Goodman, and Keith Wickham. Santa has been described as a positive male cultural icon: Many television commercials, comic strips and other media depict this as a sort of humorous business, with Santa's elves acting as a sometimes mischievously disgruntled workforce, cracking jokes, making riddles, and pulling pranks on their boss. For instance, a Bloom County story from December 15, 1981 through December 24, 1981 has Santa rejecting the demands of PETCO (Professional Elves Toy-Making and Craft Organization) for higher wages, a hot tub in the locker room, and \"short broads,\" with the elves then going on strike. Ronald Reagan steps in, fires all of Santa's helpers, and replaces them with out-of-work air traffic controllers (an obvious reference to the 1981 air traffic controllers' strike), resulting in a riot before Santa vindictively rehires them in humiliating new positions such as his reindeer. In an episode of The Sopranos titled \"...To Save Us All from Satan's Power,\" Paulie Gualtieri says he \"used to think Santa and Mrs. Claus were running a sweatshop over there... The original elves were ugly, traveled with Santa to throw bad kids a beatin', and gave the good ones toys.\" In Kyrgyzstan, a mountain peak was named after Santa, after a Swedish company had suggested it would be a more efficient starting place for present-delivering journeys all over the world, than Lapland. In the Kyrgyz capital Bishkek, a Santa Claus Festival was held on December 30, 2007, with government officials attending. 2008 was officially declared the Year of Santa Claus in the country. The events are seen as moves to boost tourism in Kyrgyzstan.Kyrgyzstan: Central Asian Country Welcomes Santa Claus To His New Home. Radio Free Europe/Radio Liberty, 30 December 2007 The Guinness World Record for the largest gathering of Santa Clauses is held by Thrissur, Kerala, India, where on December 27, 2014, 18,112 Santas came overtaking the current record of Derry City, Northern Ireland. On September 9, 2007, where a total of 12,965 people dressed up as Santa or Santa's helpers which previously brought down the record of 3,921, which was set during the Santa Dash event in Liverpool City Center in 2005.guinness world records http://www.guinnessworldrecords.com/records/amazing_feats/mass_participation/largest_gathering_Santa_Claus.aspx A gathering of Santas in 2009 in Bucharest, Romania attempted to top the world record, but failed with only 3,939 Santas. ==References== Category:Christmas",
 "title": "Santa Claus"
}