{
 "id": "176405",
 "text": "An endorheic basin, also called an internal drainage system, is a drainage basin, or watershed, that does not flow to one of the Earth's major oceans. This is unlike normal basins that collect in rivers and flow to the ocean. Endorheic basins usually end in a saline lake or a salt flat. They can be found in all parts of the world, but usually in desert locations. ==List of major endorheic basins== ===Antarctica=== Endorheic lakes in Antarctica are located in the McMurdo Dry Valleys, Victoria Land, Antarctica, the largest ice-free area in Antarctica. *Don Juan Pond in Wright Valley is fed by groundwater from a rock glacier and remains unfrozen throughout the year. *Lake Vanda in Wright Valley has a perennial ice cover, the edges of which melt in the summer allowing flow from the longest river in Antarctica, the Onyx River. The lake is over 70 m deep and is hypersaline. *Lake Bonney is in Taylor Valley and has a perennial ice over and two lobes separated by the Bonney Riegel. The lake is fed by glacial melt and discharge from Blood Falls. Its unique glacial history has resulted in a hypersaline brine in the bottom waters and fresh water at the surface. *Lake Hoare, in Taylor Valley, is the freshest of the Dry Valley lakes receiving its melt almost exclusively from the Canada Glacier. The lake has an ice cover and forms a moat during the Austral summer. *Lake Fryxell, in adjacent to the Ross Sea in Taylor Valley. The lake has an ice cover and receives its water from numerous glacial meltwater streams for approximately 6 weeks out of the year. Its salinity increases with depth. ===Asia=== Much of western and Central Asia is a single, giant inland basin. It contains several lakes, including: * The Central Asian Internal Drainage Basin, the largest of the three major basins covering Mongolia. * The Caspian Sea, the largest lake on Earth. In fact, a large part of Eastern Europe drained by the Volga River also belongs to its basin. * The Aral Sea, whose tributary rivers have been diverted, leading to a dramatic shrinkage of the lake. The resulting ecological disaster has brought the plight faced by internal drainage basins to public attention. * Lake Balkhash (Kazakhstan) * Lop Nur Basin, in the southeastern portion of Xinjiang Uygur Autonomous Region in northwestern China * Issyk-Kul, Son-Kul and Chatyr-Kul lakes in Kyrgyzstan * Sistan Basin covering areas of Iran and Afghanistan * Tarim Basin in Xinjiang Uyghur Autonomous Region * Uvs Nuur basin, Mongolia, Tuvan Republic of Russia * The Dead Sea, the lowest surface point on Earth and one of its saltiest bodies of water, lies between Israel and Jordan. * Sambhar Lake in Rajasthan, north-western India, is also the terminal point of an endorheic basin. * Lake Van in Turkey is one of the world's largest endorheic lakes. ===Australia=== Australia, being very dry and having exceedingly low runoff ratios due to its ancient soils, has a great prominence of variable, endorheic drainages. The most important are: * Lake Eyre Basin, which drains into the highly variable Lake Eyre and includes Lake Frome. * Lake Torrens, to the west of the Flinders Ranges in South Australia. * Lake Corangamite, a highly saline crater lake in western Victoria. * Lake George, formerly connected to the Murray-Darling Basin ===Africa=== * Lake Turkana in Kenya * The Okavango Delta, an endorheic inland delta in the Kalahari Desert of Botswana * Lake Ngami in Botswana * Lake Chad (between Chad and Cameroon), fed by the Chari and Logon rivers * Etosha pan in Namibia’s Etosha National Park * Qattara Depression in Egypt * Chott Melrhir in Algeria * Lake Chilwa in Malawi * Afar Depression in Eritrea, Ethiopia and Djibouti * Chott el Djerid in Tunisia ===North and Central America=== * Lago de Atitlán, in the highlands of Guatemala; * Bolsón de Mapimí, in northern Mexico * Crater Lake in Oregon * Devil's Lake (North Dakota) * Devil's Lake (Wisconsin) * The Great Basin, which covers much of Nevada and Utah, includes: ** The Black Rock Desert in Nevada, location of the Thrust2 and ThrustSSC landspeed record runs, and the annual home to the Burning Man festival **Death Valley in California and Nevada, the lowest land point in the United States ** Groom Dry Lake in Nevada, location of the secret Area 51 base ** Utah’s Great Salt Lake, the largest terminal lake in the Western Hemisphere ** Salton Sea in California, a lake accidentally created in 1905 when irrigation canals ruptured, filling a desert endorheic basin and recreating an ancient saline sea ** Utah’s Sevier Lake ** Pyramid Lake in Nevada ** Mono Lake in California * The Great Divide Basin in Wyoming, a small endorheic basin that straddles the Continental Divide. *Guzmán Basin, in northern Mexico and the southwestern United States; *Little Manitou Lake in Saskatchewan *New Mexico has a number of desert endorheic basins including: ** The Tularosa Basin, a rift valley; ** Zuni Salt Lake, a maar; *Rogers Lake, at Edwards Air Force Base in California *Tulare Lake, an endorheic basin at the southern end of the San Joaquin Valley fed by the Kings River, Tule River and Kaweah River; since the late 19th century the lake bed has been reclaimed and used as farmland, though it occasionally floods when rainfall is especially heavy * The Valley of Mexico. In Pre- Columbian times, the Valley was substantially covered with five lakes, including Lake Texcoco, Lake Xochimilco, and Lake Chalco. Many small lakes and ponds in North Dakota and Manitoba are endorheic; some of them have salt encrustations along their shores. ===Europe=== * Neusiedlersee/Fertő tó in Austria and Hungary * Lake Trasimeno in Italy * Lake Velence in Hungary * Lake Prespa between Albania, Greece and the Republic of Macedonia * Rahasane turlough, in Co. Galway, Republic of Ireland, is the county's largest and covers about 2.5 square kilometres. All these lakes are drained, however, either through manmade canals or via karstic phenomena. Minor additional endorheic lakes exist throughout the Mediterranean countries Spain (e.g. Laguna de Gallocanta), Italy, Cyprus (Larnaca and Akrotiri salt lakes) and Greece. ===South America=== *Altiplano basin, one of the largest and second highest in the world. *Lake Valencia (Spanish: Lago de Valencia) the second largest lake in Venezuela. *Salar de Atacama, Atacama Desert, Chile (although close to the Altiplano it is not part of it) *Northwest Pampas Basins in the Dry Pampas of Argentina *Southwest Pampas Basins in the Dry Pampas of Argentina *Meseta Somuncura in the Patagonia region of Argentina ===Ancient=== Some of the Earth’s ancient endorheic systems include: * The Black Sea, until its merger with the Mediterranean * The Mediterranean Sea itself and all its tributary basins, during its Messinian desiccation (5 m.y. BP aprox.) as it became disconnected from the Atlantic Ocean. * Lake Lahontan in the western US * Ebro and Duero basins, draining most of northern Spain during the Neogene and perhaps Pliocene. * Lake Bonneville (Utah) == Related pages == *Inland sea ==References== Category:Drainage basins Category:Lakes",
 "title": "Endorheic basin"
}