{
 "id": "176555",
 "text": "The rock dove (Columba livia, also occasionally known as rock pigeon, common pigeon or just the Pigeon) is a member of the bird family Columbidae. Rock doves are now rare in the wild, only found on remote islands and rocky cliffs in the far west and south of Europe east to central Asia. Domesticated birds which have become feral, most often called feral pigeons or simply pigeons, can however be found in cities, towns and villages all over the world, picking up dropped food in streets and parks, and begging food from people. Domesticated pigeons are also kept as poultry for food, and as homing pigeons, for the sport of pigeon racing. The wild rock dove is very distinct, with a light grey back and body with two black stripes on its wings, and a dark blue- grey head with shiny feathers on the side of the neck which reflect green and purple light. Domesticated birds are much more variable, with a wide range of colours, including white, pink, and brown not seen in wild birds. == Relationship to humans == Rock doves have been domesticated for several thousand years, giving rise to the domestic pigeon (Columba livia domestica). They have been domesticated as long as 5,000 years ago. There are many breeds of pigeons, with many sizes and colours. Domesticated pigeons are used as homing pigeons as well as food and pets. They were in the past also used as carrier pigeons. == Feral Pigeons == Many domestic birds have got lost, escaped or been released over the years and have been made feral pigeons. These show a variety of colour and size, but many have the same pattern as does the rock dove. Feral pigeons are found in cities and towns all over the world. The rareness of the wild species is somewhat due to breeding with feral birds. == Life == File:Columba_livia_MHNT.ZOO.2010.11.73.7.jpg|link=https://en.wikipedia.org/wiki/File:Columba_livia_MHNT.ZOO.2010.11.73.7.jpg|alt=Two eggs in the collection of the Muséum de Toulouse File:Rock_dove_egg.jpeg|link=https://en.wikipedia.org/wiki/File:Rock_dove_egg.jpeg|alt=Egg, measured in centimetres File:Columba_livia_nest_2_eggs.jpg|link=https://en.wikipedia.org/wiki/File:Columba_livia_nest_2_eggs.jpg|alt=Nest with two eggs File:Columba_livia_1_day_old.jpg|link=https://en.wikipedia.org/wiki/File:Columba_livia_1_day_old.jpg|Babies, one day File:Stadttaube_kueken.jpeg|link=https://en.wikipedia.org/wiki/File:Stadttaube_kueken.jpeg|Babies, five days File:Feral_Rock_Dove_nest_with_chicks.jpg|link=https://en.wikipedia.org/wiki/File:Feral_Rock_Dove_nest_with_chicks.jpg|Babies, about 10 days File:Rock_dove_18_days_old_in_its_nest_and_one_egg.jpg|link=https://en.wikipedia.org/wiki/File:Rock_dove_18_days_old_in_its_nest_and_one_egg.jpg|alt=18 days old in its nest and one egg|18 days old File:Columba_livia_22_days_old.jpg|link=https://en.wikipedia.org/wiki/File:Columba_livia_22_days_old.jpg|Young bird, 22 days File:Pigeons_courting_(71062).jpg|link=https://en.wikipedia.org/wiki/File:Pigeons_courting_(71062).jpg|Feral pigeons in courtship ==References== Category:Columbiformes",
 "title": "Rock dove"
}