{
 "id": "176511",
 "text": "San Juan is a Dominican province, in the western part of the country. Its capital city is San Juan de la Maguana. ==Name== The province is named after its capital city, San Juan de la Maguana. San Juan is short for San Juan Bautista (Saint John the Baptist). ==History== Since colonial times, the territory was part of Azua province until the dictator, Rafael Trujillo, made this province in 1938 with the name Benefactor with the municipalities of Las Matas de Farfán y El Cercado. Bohechío was made a municipality in 1974, Vallejuelo in 1978 and Juan de Herrera in 1992. In 1998, Matayaya became a municipal district; Pedro Corto in 2000; Sabaneta, Arroyo Cano and Yaque in 2004; Carrera de Yeguas, Sabana Alta, El Rosario, Hato del Padre, Guanito, La Jagua, Derrumbadero and Batista in 2005; Las Maguanas-Hato Nuevo, Las Charcas de María Nova, Jinova and Jorjillo in 2006; and Las Zanjas in 2007. ==Location== The San Juan province has Santiago Rodríguez and Santiago provinces to the north, Azua province (and a short part of La Vega) to the east, Baoruco province to the south and Elías Piña province to the west. ==Population== In (last national census), there were people living in the San Juan province, and 139,620 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 11th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 226,484 inhabitants. The largest city of the province is San Juan de la Maguana, its head municipality or capital, with an urban population (in ) of 71,494 inhabitants. ==Geography== The San Juan province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 1st (out of 31 plus the National District) largest province. The altitude of the provincial capital, San Juan de la Maguana, is above sea level. ===Mountains=== The Cordillera Central (\"Central mountain chain\") is in the northern part of the province, and the Sierra de Neiba runs across the southern half. The area between those two mountain ranges is the San Juan valley, which the Taínos call Maguana, meaning \"small valley\". The highest mountain in the province is Pico Duarte, with 3,087 m. It is the highest mountain in the West Indies and is on the border with Santiago province. ===Rivers=== The main rivers of the province are the San Juan and Yaque del Sur rivers. ===Climate=== The climate of the province is a tropical climate, hot most of the year, but it is cooler in the mountains. ==Municipalities== There are 6 municipalities and 17 municipal districts (M.D.) in the province. Municipalities of the San Juan province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) San Juan de la Maguana (220101) San Juan de la Maguana (220101) 78,313 248.6 418 Pedro Corto (220102) 6,891 146.3 506 Sabaneta (220103) 5,621 480.4 706 Sabana Alta (220104) 3,241 31.4 368 El Rosario (220105) 7,426 204.9 381 Hato del Padre (220106) 5,811 58.8 470 Guanito (220107) 3,670 83.3 384 La Jagua (220108) 3,855 69.2 592 Las Maguanas-Hato Nuevo (220109) 5,192 72.1 523 Las Charcas de María Nova (220110) 3,166 86.8 545 Las Zanjas (220111) 8,991 246.0 79 San Juan de la Maguana (220100) San Juan de la Maguana (220100) 132,177 1,728.0 Bohechío (220201) Bohechío (220201) 2,394 1.5 519 Arroyo Cano (220202) 3,109 61.3 625 Yaque (220203) 4,182 343.3 512 Bohechío (220200) Bohechío (220200) 9,685 406.1 El Cercado (220301) El Cercado (220301) 13,611 169.6 825 Derrumbadero (220302) 4,918 62.8 915 Batista (220303) 2,314 45.6 976 El Cercado (220300)) El Cercado (220300)) 20,843 278.0 Juan de Herrera (220401) Juan de Herrera (220401) 8,235 46.5 514 Jínova (220402) 4,827 46.4 478 Juan de Herrera (220400)) Juan de Herrera (220400)) 13,062 92.9 Las Matas de Farfán (220501) Las Matas de Farfán (220501) 34,481 350.3 445 Matayaya (220502) 4,267 115.8 409 Carrera de Yeguas (220503) 5,415 170.9 490 Las Matas de Farfán (220500)) Las Matas de Farfán (220500)) 44,163 637.1 Vallejuelo (220601) Vallejuelo (220601) 9,725 151.5 643 Jorjillo (220602) 2,678 70.2 829 Vallejuelo (220600)) Vallejuelo (220600)) 12,403 221.7 San Juan (220000) San Juan (220000) 3,363.8 ==Economy== The main economic activity of the province is farming; the main products are rice, maize, peanut, sorghum and beans. ==References== Category:Provinces of the Dominican Republic Category:1938 establishments in the Dominican Republic",
 "title": "San Juan Province (Dominican Republic)"
}