{
 "id": "177122",
 "text": "The Attitude Era was a period in the World Wrestling Federation and professional wrestling history. It occurred in response to the Monday Night Wars with World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW). It officially started on November 9, 1997 at Survivor Series 1997, with the Montreal Screwjob and debut of the \"WWF Attitude\" scratch logo, culminated with the conclusion of the Monday Night Wars in 2001, and ended on May 6, 2002 when WWF rebranded to WWE with the \"Get the 'F' Out\" marketing campaign. The Attitude Era professional, like the 1980s wrestling boom, made wrestling more popular in the United States from the late 1990s to early 2000s. Television ratings and pay-per-view reached their highest points. The Attitude Era was different from the more traditional WWF programming. It tried to attract the young adult demographic. It did this by making the product into a more controversial \"shock value\" form of entertainment. This was similar to the \"Trash TV\" genre popularized in the 1990s. ==Notable moments== *November 9, 1997 – At the 1997 Survivor Series, just before the match between Shawn Michaels and WWF Champion Bret \"The Hitman\" Hart for the WWF Title, a video promo aired featuring the debut of the \"WWF Attitude\" scratch logo. Towards the end of the match, Michaels locked Bret Hart into Bret's own submission, The Sharpshooter. Vince McMahon was at ringside, and told referee Earl Hebner to ring the bell. The events after the match came were controversial because in the storyline Bret did not tap out when locked into submission, and he was not supposed to lose at all. Due to the fact it took place in Montreal, Canada, the event has been called the Montreal Screwjob. This was also known to be Bret Hart's last match in the WWF. *December 8, 1997 – During this episode of Raw, Stone Cold Steve Austin knocks WWF Chairman Vince McMahon off the ring, thus entering the Austin/McMahon saga. *March 29, 1998 – The Undertaker beats Kane at WrestleMania XIV, making Kane the seventh opponent whom Taker had beaten. Later that night \"Stone Cold\" Steve Austin wins the WWF Championship from Shawn Michaels. *March 30, 1998 – With Shawn Michaels out because of back injury, Triple H calls himself the leader of DX, which he adds the New Age Outlaws and X-Pac to the group. *April 6, 1998 – In this episode of Raw, DX goes to \"war\" with WCW when they invaded a WCW Monday Nitro show in the Scope in Norfolk, Virginia. For the first time since June 17, 1996, Raw won over WCW's Monday Nitro in the ratings. *May 11, 1998 – D-Generation X actually invades WCW headquarters. *June 28, 1998 – At the 1998 King of the Ring, Mankind loses against The Undertaker in the third Hell in a Cell match. In the first moments of the match, the Undertaker threw Mankind off the roof of the cage. Later that night, Kane won his first major title from Stone Cold Steve Austin. *June 29, 1998 – Stone Cold Steve Austin wins the WWF Championship back from Kane *July 27, 1998 – Triple H and X-Pac face each other for the first time in a Triple Threat Match, against The Rock. *October 5, 1998 – On this episode of Raw, Mankind visits an injured Vince McMahon. During this part, Mankind introduces Mr. Socko, a hand-drawn sock puppet. Mr. Socko became so popular that it became a part of Mankind. A few moments later, in another part, Stone Cold Steve Austin pretends to be a doctor. He starts to attack McMahon. From this date until Nitro's last episode on March 26, 2001, Raw took the lead in the \"ratings war\". Nitro never passed it since (except on October 26, 1998). *November 23, 1998 – After his return, Shawn Michaels turned on D-Generation X. He joined Vince McMahon’s Corporation after hitting X-Pac with Sweet Chin Music. *December 7, 1998 – The Undertaker has his druids chain Stone Cold Steve Austin to his \"Undertaker Symbol\" and raised high into the arena in the entrance. This caused controversy within religious groups because it physically showed Austin being crucified. *January 4, 1999 – Shawn Michaels turns against The Corporation and joins DX once again. After joining DX again, the Corporation attacks Michaels. It says he is definitely out. Later that night, Mankind won his first World Title from The Rock. *March 28, 1999 – The Undertaker beats Big Boss Man in the fifth Hell in a Cell match at WrestleMania XV. This made Boss Man the eighth opponent to lose against the Undertaker at the pay-per-view event. After the match, Taker (kayfabe) hung Boss Man from the cell. It is also the same WrestleMania that Triple H turns against X-Pac and joins The Corporation. *May 23, 1999 – At the 1999 WWF Over the Edge event, Owen Hart was going under the name The Blue Blazer. He was fighting against The Godfather for the IC Title. Owen fell to his death when he was lowering himself from the rafters, but let go too early. WWF officials decided to continue the show after the accident, a decision that attracted widespread criticism and subsequent debate. *July 25, 1999 – X-Pac and Road Dogg beat Chyna and Billy Gunn for the rights of D-Generation X. *August 9, 1999 – \"Y2J\" Chris Jericho made his first WWF appearance. *August 26, 1999 - WWF SmackDown! made its season television network premiere on UPN. *September 23, 1999 – Road Dogg and Billy Gunn beat the New Age Outlaws to win the WWF Tag Team titles from the Rock 'n' Sock Connection. *September 27, 1999 – In this episode of Raw, Mankind hosted the famous This is Your Life segment, for The Rock. This part alone had the highest rating for any professional wrestling segment on television (8.4) to date. *November 1999 – August 2000: Triple H left DX when he \"married\" Stephanie McMahon. Billy Gunn was soon kicked out, and Road Dogg and X-Pac soon split up after a short time as a tag team. *March 26, 2001 – Vince McMahon told the world on Monday Night Raw that he bought WCW. Later in the night during a live Raw/Nitro simulcast, Shane McMahon appeared on WCW Monday Nitro and (kayfabe) announced that it was he who had in fact bought WCW. He also said he wanted to go into competition against his father. *April 1, 2001 – The Undertaker beats Triple H at WrestleMania X-Seven. This was his ninth victory at WrestleMania. Stone Cold Steve Austin beat The Rock with the help of Vince McMahon. This event and WWF's purchase of WCW days ago are considered by many to be both the peak of the Attitude Era and the start of its decline. *May 28–November 18, 2001 – The Invasion angle took over the WWF as couple of WCW and ECW stars invading the WWF after their organizations were shutdown. This rivalry between The Alliance vs Team WWF was spent seven months until the Survivor Series pay per view. Where The Rock and his team defeated The Alliance where they won the battle. Also on that night, every championship from WWF and WCW got unified as well. *December 9, 2001 – Chris Jericho won his first undisputed championship at Vengeance where he defeated both The Rock and Stone Cold Steve Austin to reclaim both WWF and WCW World Heavyweight Championships. *January 7, 2002 – After 8 months, Triple H returns to the WWF Raw in Madison Square Garden after he accidentally torn his quadriceps. *February 17, 2002 – The nWo (Hulk Hogan, Scott Hall, and Kevin Nash made their return to the WWF after the demise of WCW) made their WWF debut at No Way Out. *March 17, 2002 – The Icon vs Icon match between Hulk Hogan and The Rock took place in Toronto, Canada at WrestleMania X8. *March 25, 2002 – The very first draft lottery as the beginning of the Brand Extension took place at Raw in Pennsylvania State University as WWF superstars went to their separate brands between Raw and SmackDown. *May 6, 2002 – The WWF (World Wrestling Federation) changed its name to the WWE (World Wrestling Entertainment), due to a lawsuit between the company and the World Wildlife Fund. Many cited this moment to be the official end of the Attitude Era. ==References== ==Other websites== *WWE.com *\"Attitude Era\" WWE Fan Nation on WWE.com *\"Attitude 4 Ever\" WWE Fan Nation on WWE.com Category:Timelines Category:WWF Attitude Era",
 "title": "The Attitude Era"
}