{
 "id": "177268",
 "text": "Apostasy in Islam is when a follower of Islam tries to change or reject their religion. When someone tries to reject their religion, this is called apostasy. The three traits listed below are what is needed for apostasy to be taken seriously. * The follower of Islam must be an adult, the rules usually do not apply to children. * The follower of Islam must be sane. Insane people cannot make decisions in Islam. * The follower must change their religion because they want to. Being forced to change their religion is not apostasy.Apostasy a Capital Crime in Islam?\" Islam Online, 26 April 2006an Apostate Be Put to Death?\" www.islam.ca, 27 March, 2006 This means if a Muslim is a child, insane, or being forced, their action does not count as apostasy. Most Sunni Islam and the Twelvers Shi'a Islamic schools of thought agree that apostasy is a sin. There is a difference between harmful apostasy and harmless apostasy\"Apostasy Major and Minor\" , Qaradawi, 13 April 2006 (also known as major and minor apostasy). According to Wael Hallaq, none of the apostasy laws are based on the Qur'an,Encyclopedia of the Quran, Apostasy although the jurist al-Shafi'i interpreted the Qu'ranic verse 2:217 as proof that apostasy is outlawed. This provided the main evidence for apostasy being a capital crime in Islam.W. Heffening, in Encyclopedia of Islam Sharia --Islamic law-- says the punishment for apostasy should be death, but the Qu'ran does not have any instructions for punishing apostasy. Some Islamic juristsAbdullah Saeed and Hassan Saeed (2004), Freedom of Religion, Apostasy and Islam, p. 85, Ashgate Publishing, .Mohammad Hashim Kamali (1998), \"Punishment in Islamic Law: A Critique of the Hudud Bill of Kelantan, Malaysia\", Arab Law Quarterly 13 (3): 203-234, Brill Publishers.Grand Mufti Ali Gomaa, Gomaa's Statement on Apostasy , The Washington Post, July 25, 2007.Nashwa Abdel-Tawab, 'Whosoever will, let him disbelieve' , Al-Ahram Weekly, Issue No. 857, 9-15 August 2007.Grand Ayatollah Hossein-Ali Montazeri: \"Not Every Conversion is Apostasy\", by Mahdi Jami, In Persian, BBC Persian, February 2, 2005, retrieved April 25, 2006 argued or issued fatwas that the changing of religion is not punishable or is only punishable under restricted circumstances.What Islam says on religious freedom, by Magdi Abdelhadi, BBC Arab affairs analyst, 27 March 2006, retrieved April 25, 2006Fatwa on Intellectual Apostasy , Text of the fatwa by Sheikh Yusuf Al-QaradawiS. A. Rahman in \"Punishment of Apostasy in Islam\", Institute of Islamic Culture, Lahore, 1972, pp. 10-13The punishment of apostasy in Islam , View of Dr. Ahmad Shafaat on apostasy. Some groups within Islam, such as the Shi'a Ismaili, reject death for apostasy altogether. == Examples == *Salman Rushdie was condemned to death in 1989 by Ayatollah Khomeini,On this day: February 14, 1989; BBC News, accessed March 17, 2009 (ruler of Iran at the time) for his book The Satanic Verses *Abdul Rahman, an Afghan convert to Christianity, was arrested and jailed on the charge of rejecting Islam in 2006 but later released as 'insane'.\"Afghan convert freed from prison\", BBC News, March 28, 2006, retrieved April 11, 2006 ==References== Category:Islam",
 "title": "Apostasy in Islam"
}