{
 "id": "177541",
 "text": "US Airways Flight 1549 was an airplane flight that landed in the Hudson River in New York City on January 15, 2009. The plane was on a commercial flight with 155 people on board and had left LaGuardia Airport six minutes earlier, but it had to land after a flock of birds hit its engines. The event was remarkable because no one died. Because of this, the event was called the Miracle on the Hudson. In 2016, a movie was made recreating the crash. The movie is named Sully, after the plane's main pilot Chesley \"Sully\" Sullenberger. ==Accident== The plane took off from LaGuardia Airport at 3:26 pm. It was going to fly to Charlotte, North Carolina, and then it would fly onwards to Seattle, Washington state. Two minutes after the plane left the ground, it flew into a flock of Canada geese. Some of the geese were sucked into the plane's two engines. Both engines stopped working. The pilots, Chesley Sullenberger and Jeffrey Skiles realized that they needed to land the plane as soon as possible. They thought about heading back to LaGuardia Airport or trying to land at Teterboro Airport in New Jersey. They decided that they could not land at an airport and instead, they would have to land the plane in the river. This was also dangerous for two reasons. Firstly, the plane would break apart if it hit the water too quickly or if it hit something else. Secondly, the passengers would drown if they were not rescued quickly, as it would be hard to swim in the cold river. The pilots landed the plane in the river at 3:31 pm. Unfortunately, because a passenger opened a rear emergency exit door, the plane started to slowly fill with water and sink. The passengers climbed out onto the wings and life rafts of the plane. Sullenberger had landed the plane near some boats, and the first boats reached the plane a few minutes after the landing. The boats rescued the passengers and crew. By 3:55 pm, everyone had been rescued. They were taken to both sides of the river. 24 passengers and two rescuers had to go to a hospital, but most of them left the hospital before the end of the day. ==Aftermath== The National Transportation Safety Board investigated the event. In May 2010, they released a report which said that Sullenberger had made the right decision. The plane is now on display in the Sullenberger Aviation Museum in Charlotte. Category:Aviation accidents and incidents in 2009 Category:2000s in New York City Category:2009 in New York (state) Category:Hudson River",
 "title": "US Airways Flight 1549"
}