{
 "id": "177632",
 "text": "The Canadian Armed Forces (CAF; French: Forces armées canadiennes, FAC) are the military of Canada, with land, sea and air commands such as the Army, Navy and Air Force, all commanded by a single structure, unlike the United States. Under the National Defence Act, \"The Canadian Forces are the armed forces of Her Majesty raised by Canada and consist of one Service called the Canadian Armed Forces.\" The Commander in Chief of the Canadian Forces is the Head of State of Canada, Queen Elizabeth II, represented by the Governor General of Canada, Mary May Simon. The Chief of the Defence Staff (or CDS), the senior professional member of the service, is General Thomas J. Lawson. The CDS answers to a politician, the Minister of National Defence, who is currently Anita Anand of the Liberal Party. == Structure == The Canadian Forces is composed of 67,000 personnel (soldiers, sailors, and airmen/airwomen). Every unit accepts male and female soldiers, if they qualify for the position. The CF is divided into seven main branches, which are called commands. === Main Branches === The Environmental branches (called Commands) are mainly administrative structures. They manage the personnel, the equipment and the facilities, but not the operations. There are three commands in the Canadian Forces, because there are no Marines. All the commands work very closely with each other, for example, the Air Force provides helicopters to the Navy and the Army. These commands also each have a reserve element, made of part-time employees. ==== Land Forces Command (LFCOM) ==== Land Forces Command (LFCOM) is the first branch of the Canadian Forces. This is the Canadian Army and the largest branch of the CF. It uses tanks and other armoured vehicles, such as the LAV III, as well as artillery, engineering vehicles, and a variety of weapons, such as the Colt Canada C7 rifle. 37,000 ==== Maritime Command (MARCOM) ==== Maritime Command (MARCOM) is the second branch of the Canadian Forces. This is the navy of Canada. It has 33 active warships including submarines, frigates and destroyers. ==== Air Command (AIRCOM) ==== Air Command (AIRCOM) is the Air Force and third branch of the Canadian Forces. It operates a variety of helicopters and airplanes to support the army and the navy, and also has CF-18 fighters. === Operational Branches === The Operational commands are responsible for specific types of operations or for conducting exercises or deployments. There are four operational commands. ==== Special Operations Forces Command (CANSOFCOM) ==== The CANSOFCOM is responsible for providing special forces and asymmetric warfare capabilities to Canada. It is the smallest command of the Canadian Forces, and is composed of four joint units that do not answer to either the Army, Navy or Air Force. These units are the Joint Task Force 2, the Canadian Special Operations Regiment, the 427th Special Aviation Squadron and the Canadian Joint Incident Response Unit (CBRN). ==== Expeditionary Force Command (CEFCOM) ==== This is the command responsible for managing foreign operations and deployments outside of Canada, such as Canada's contribution to the War in Afghanistan. ==== Canada Command (CANCOM) ==== Canada Command works with the United States Northern Command to ensure national security and the defence of the North American continent. CANCOM also is responsible for emergency management, such as when the Army is needed to respond to disasters in Canada. ==== Operational Support Command (CANOSCOM) ==== This command is responsible for supporting all the other commands with things such as logistics, engineering, health services, and the military police. == Defence Policy == From the second half of the 20th century, the defence policy of Canada is made of these objectives : * The defence of the country * The defence of North America, with the United States Military * Contributing to international security During the Cold War, a major focus of the Canadian Forces was helping with the defence of Europe against the threat posed by the Soviet Union. Some Canadian soldiers lived in Europe during that time. Today, the Canadian Forces goals are based on the Canada First Defence Strategy,Department of National Defence \"Canada First Defence Strategy\" introduced by the conservative government of Stephen Harper. The new goals and objectives are being able to do the following : * Make regular domestic operations, in the Arctic and to support NORAD * Help with the security of a major national event, such as the 2010 Winter Olympics * Respond to a major terrorist attack * Help citizens in case of a natural disaster * Lead or make a major international mission during a long time * Send soldiers to respond to an international crisis for a short time == Notes == Category:Military of Canada",
 "title": "Canadian Armed Forces"
}