{
 "id": "177709",
 "text": "A driver's license, driver license, driver licence, or driving licence is an official document which states that a person may drive a motorized vehicle, such as a motorcycle, car, truck, or a bus. ==History== In 1888, Karl Benz, the inventor of the modern car, got a written \"Genehmigung\" (permit) from Grand Ducal authorities to use his car on public roads because people would complain about the noise and smell of his Motorwagen. Up until the start of the 20th century, European authorities would give permits like these to drive vehicles if they needed to. Sometimes, they just did not. == Laws controlling driver's licenses == Different countries have different laws as to whether or not a person can have a driver's license. In some places, a person must pass a driving test before he or she is given a driver's license, while in other places, a driving license is given before the person starts driving. In Victoria, Australia (for example), to get a driving licence a person must: * be at least 18 years old * live in Victoria * pass an eye test * pass a Hazard Perception Test (done on a computer) * pass a practical Driving Test to show they can drive safely, control the car, follow road rules, and cooperate with other road users. There are payments to be given to do the driving tests, and if successful, there are more fees to be paid for the licence. Many people get a learner's permit before getting a license. The first licence may be a Provisional Licence, which has certain limitations on what a driver can do. After four years, the driver will qualify for a full, minimum licence. If the partaker is under-aged, but passed the leaner's permit, they would have to wait 8 months to get a professional driver's license. == Origin == In 1901, California laws authorized all cities and counties to give licenses for bicycles, tricycles, automobiles, horse carriages, and similar wheeled vehicles. ==References== Category:Road transport law",
 "title": "Driver's license"
}