{
 "id": "177708",
 "text": "The visual cortex is a part of the brain that allows vision. It is relatively thin – between 1.5mm and 2mm in humans. In monkeys and apes the visual cortex takes up much of their brain. Physically, the visual cortex is at the back of the brain in the occipital lobe. David Hubel and Torsten Wiesel did research on the visual cortex for many years. They won the 1981 Nobel Prize in Physiology or Medicine for their discoveries about information processing in the visual system. #Their work in the 1960s and 1970s was on how the visual system developed. They worked on parts of the visual cortex of the brain which get signals from the right or left eye. #Their work describing how signals from the eye are processed by the brain to generate edge detectors, motion detectors, stereoscopic depth detectors and colour detectors. These are building blocks of the visual scene. Research on the primary visual cortex can involve recording action potentials from electrodes within the brain of cats, ferrets, rats, mice, or monkeys. Alternatively, signals can be recorded outside the animal by EEG, MEG, or fMRI. These techniques gather information without invading the brain. == Primary visual cortex == The primary visual cortex (V1) is the best studied visual area in the brain. This is where the messages arrive from the lateral geniculate nuclei, which are relay stations for information from the retina. Each lateral geniculate nucleus gets signals from the opposite visual field. Each V1 sends information to two primary pathways, called the ventral stream and the dorsal stream. * The ventral stream begins with V1, goes through visual area V2, then through visual area V4, and to the inferior temporal cortex (IP cortex). The ventral stream, sometimes called the \"What Pathway\", is associated with form recognition and object representation. It is also associated with storage of long-term memory. * The dorsal stream begins with V1, goes through visual area V2, then to the dorsomedial area (DM/ V6) and Visual area MT (middle temporal/ V5) and to the posterior parietal cortex. The dorsal stream, sometimes called the \"Where Pathway\" or \"How Pathway\", is associated with motion, representation of object locations, and control of the eyes and arms, especially when visual information is used to guide eye movements or reaching.Goodale M.A. 2011. Transforming vision into action. Vision Res. 51 (14): 1567–87. == References == Category:Vision Category:Anatomy of the brain",
 "title": "Visual cortex"
}