{
 "id": "177900",
 "text": "Vexillology is the study of flags. The word comes from both the Latin word vexilla \"little sail\" for flag plus the Greek suffix-ology that means \"study of\". The vexillum was a particular kind of flag used by the Roman legions. Vexillology is a kind of study of symbols related to heraldry. A person who studies flags is a vexillologist, and a person who designs flags is a vexillographer. Because they are flown outside, where they move with the wind, flags are usually designed with bold images and bright, basic colors. Flag design also follows a historical process, where later flag designs are based on earlier flag designs. This means that many flags in an area may look similar because they are all based on one historical flag. Examples include the Pan-African colors, Pan-Arab colors, and the Nordic Cross. ==Flag Identification System (FIS)== The Flag Identification System was created by Whitney Smith and adopted by Fédération internationale des associations vexillologiques (FIAV). The first row is for use on land and the second row is for use on water, each divided into private (civil), government (state), and military (war) use. Usage Private Use Government Use Military Use Land Use Civil Flag State Flag War Flag Sea Use Civil Ensign State Ensign War Ensign There are 63 symbols that can describe the flag, including: FIS Text mode Description Usage C**/*** Civil Flag by private person on land *S*/*** State Flag by state offices on land **W/*** War Flag by military on land (army) ***/C** Civil Ensign on private ships (merchant ensign) ***/*S* State Ensign on state owned ships ***/**W War Ensign by military ships (navy) CS*/*** Civil and State Flag by private person and state on land *SW/*** State and War Flag by state services and military on land CSW/*** National Flag for all purposes on land ***/CSW National Ensign for all purposes on ships CSW/CSW National Flag and Ensign for all purposes on land and sea Other symbols are used to describe other uses of the flag, such as official status and which side of the flag is shown. The symbols in common use are: * Normal or de jure version of flag, or obverse (front) side * Design proposed but not officially adopted * Design is a reconstruction * Reverse (back) side of flag * Design is a variant (a different form of the same flag) * Alternative (different) version of flag * De facto (unofficial but in actual use) version of flag * Flag has different designs on its front and back * Obverse (front) side meant to be hoisted (raised) with pole on the right * Design approved by the government to represent a nation * Design used in the past, but now abandoned (This symbol was not part of Smith's original set.) * Reverse side is mirror image of obverse side * Reverse side is the obverse side flipped * Information about the reverse side is not known * Flag can be hung vertically by hoisting on a normal pole and then turning the pole 90° * Flag can be hung vertically by rotating the design first * Vertical hoist method is unknown * Design has no element that can be rotated * Flag can only be hoisted vertically Category:Heraldry",
 "title": "Vexillology"
}