{
 "id": "17800",
 "text": "Charles Cornwallis, 1st Marquess Cornwallis (31 December 1738 – 5 October 1805) was a British Army officer, Whig politician and colonial administrator. In the United States and United Kingdom, he is best known as one of the leading British general officers in the American War of Independence. His surrender in 1781 to a combined Franco-American force at the siege of Yorktown ended significant hostilities in North America. Cornwallis later served as a civil and military governor in Ireland, where he helped bring about the Act of Union; and in India, where he helped enact the Cornwallis Code and the Permanent Settlement. Born into an aristocratic family and educated at Eton and Cambridge, Cornwallis joined the British army in 1757, seeing action in the Seven Years' War. Upon his father's death in 1762 he succeeded to his peerage and entered the House of Lords. From 1766 until 1805, he was colonel of the 33rd Regiment of Foot. Cornwallis next saw military action in 1776 in the American War of Independence. Active in the advance forces of many campaigns, in 1780 he inflicted a major defeat on the Continental Army at the Battle of Camden. He also commanded British forces in the March 1781 Pyrrhic victory at Guilford Court House. Cornwallis surrendered his army at Yorktown in October 1781 after an extended campaign through the Southern colonies, marked by disagreements between him and his superior, Sir Henry Clinton. Despite this defeat, Cornwallis retained the confidence of successive British governments and continued to enjoy an active career. Knighted in 1786, he was in that year appointed to be Governor-General and commander-in-chief in India. There he enacted numerous significant reforms within the East India Company and its territories, including the Cornwallis Code, part of which implemented important land taxation reforms known as the Permanent Settlement. From 1789 to 1792 he led British and Company forces in the Third Anglo-Mysore War to defeat the Mysorean ruler Tipu Sultan. Returning to Britain in 1794, Cornwallis was given the post of Master-General of the Ordnance. In 1798 he was appointed Lord Lieutenant and Commander-in-chief of Ireland, where he oversaw the response to the 1798 Irish Rebellion, including a French invasion of Ireland, and was instrumental in bringing about the Union of Great Britain and Ireland. Following his Irish service, Cornwallis was the chief British signatory to the 1802 Treaty of Amiens and was reappointed to India in 1805. He died in India not long after his arrival because of a fever. Category:1738 births Category:1805 deaths Category:33rd Regiment of Foot officers Category:Alumni of Clare College, Cambridge Category:Ambassadors of the United Kingdom to France Category:Commanders-in-Chief, Ireland Category:Diplomatic peers Category:British Army generals Category:British Army people of the American Revolutionary War Category:British Army people of the French Revolutionary Wars Category:British Army people of the Seven Years' War Category:British Commanders-in-Chief of India Category:British military people of the Third Anglo-Mysore War Category:Burials in Ghazipur Category:Constables of the Tower of London Charles Category:Governors-general of India Category:Grenadier Guards officers Category:King's Shropshire Light Infantry officers Category:Knights of the Garter Category:Lord-lieutenants of the Tower Hamlets Category:Lords Lieutenant of Ireland 1 Category:People educated at Eton College Category:People of the Irish Rebellion of 1798 Category:Philadelphia campaign Category:Military people from Somerset Category:Suffolk Regiment officers Category:People from Ghazipur Category:Military people from the City of Westminster Category:Barons Cornwallis",
 "title": "Charles Cornwallis"
}