{
 "id": "178089",
 "text": "2020 (MMXX) was a leap year starting on Wednesday in the Gregorian calendar, the 2020th year of the Common Era (CE) and Anno Domini (AD) designations, . == Events == === January === ** January 2 – The government of New South Wales, Australia, declares a state of emergency and the government of Victoria, Australia declares a state of disaster because of large bushfires that had killed up to 500 million animals. * January 3 — A U.S. airstrike near Baghdad International Airport kills Iranian military general Qasem Soleimani, fueling the Persian Gulf crisis. * January 5 – Second Libyan Civil War: Turkish President Recep Tayyip Erdoğan announces that Turkish troops will be deployed to Libya on behalf of the United Nations. * January 7 ** Persian Gulf crisis: 56 people are reported killed and over 200 are crushed on by others at the funeral of Qasem Soleimani in the city of Kerman, Iran. ** Sebastian Kurz becomes the Chancellor of Austria for a second time following a coalition agreement with the environmentalist faction of the Austrian Parliament. * January 8 — A plane bound for Ukraine crashes just after taking off from Tehran, Iran, killing all 176 on board. It was later announced that Iran accidentally shot down the plane. * January 9 — ISIL militants assault a Nigerien military base at Chinagodrar, killing at least 89 Nigerien soldiers. * January 10 — The Sultan of Oman, Qaboos bin Said, dies aged 79. He is replaced by Haitham bin Tariq. * January 16 – The impeachment trial of the President of the United States, Donald Trump, starts in the U.S. Senate.'Not Guilty': Trump Acquitted On 2 Articles Of Impeachment As Historic Trial Closes by Philip Ewing, NPR, February 5, 20204:33 PM ET * January 18 – Yemeni Civil War: 111 Yemeni soldiers and five civilians are killed in a drone and missile attack on a military camp near Ma'rib. * January 26 – Five-time NBA champion Kobe Bryant, his 13 year-old daughter Gianna and seven others are killed in a helicopter crash in Calabasas, California. * January 28 — President Donald Trump and Israeli Prime Minister Benjamin Netanyahu announce the Trump peace plan. * January 30 — The World Health Organization declared the 2019–20 coronavirus outbreak a public and national health emergency and concern. * January 31 — The United Kingdom and Gibraltar leave the European Union. === February === * February 5 ** Academy Award-winning actor Kirk Douglas died in Los Angeles, aged 103. ** President Donald Trump is found innocent during his impeachment trial by the U.S. Senate. * February 11 — 2019–20 coronavirus outbreak: The World Health Organization (WHO) names the disease COVID-19. * February 13 — NASA publishes a detailed study of Arrokoth, the most distant body ever explored by a spacecraft, which New Horizons passed by on its journey through the Kuiper Belt. * February 19 — Shootings in Hanau, Germany, leaves eleven people dead and five others wounded. * February 27 – The Dow Jones Industrial Average plunges by 1,190.95 points, or 4.4%, to close at 25,766.64, its largest one-day points decline in history. This follows several days of large falls, marking the worst week for the index since 2008, triggered by fears of the spreading coronavirus. This would cause a massive global stock market crash. * February 28 – Ambassadors of all 29 NATO Allies meet in the North Atlantic Council expressing solidarity with Turkey after 33 Turkish soldiers were killed in an air strike by the Syrian government forces during the ongoing Syrian civil war.NATO – News: NATO expresses strong solidarity with Turkey at special meeting of the North Atlantic Council, 28-Feb.-2020 * February 29 ** A truce is signed between American troops, Afghan troops, and the Taliban. ** Luxembourg becomes the first country in the world to make all public transport free to use. === March === * March 3 ** Several tornadoes tear through Nashville, Tennessee, killing 25.'The incredible spirit of Nashville': Grit and hope amid the grief after deadly Tennessee tornadoes USA Today, 5 March 2020 ** Adisumarmo International Airport in Solo (Surakarta), Java, Indonesia, is closed after the eruption of Mount Merapi volcano.Indonesia shuts airport after Java volcano erupts Reuters, 3 March 2020 * March 4 – Former Secretary-General of the United Nations and Prime Minister of Peru Javier Pérez de Cuéllar dies at the age of 100. * March 5 – The I.C.C. approves the Afghanistan War Crimes Inquiry to begin, allowing for the first time for U.S. citizens to be investigated. * March 8 – Italy places 16 million people in quarantine, more than a quarter of its population, trying to stop the spread of coronavirus. * March 9 – Share prices fall sharply around the world due to an oil price war between Russia and Saudi Arabia, caused by the 2019–20 coronavirus pandemic. The Dow Jones Industrial Average fell more than 2,000 points. Oil prices fell by as much as 30% in early trading. * March 11 – 2019–20 coronavirus pandemic: The World Health Organization declares the COVID-19 outbreak a pandemic. * March 12 – Global stock markets crash three days after Black Monday due to continued concerns over COVID-19 and the U.S. travel ban on the Schengen Area. The Dow Jones Industrial Average went into free fall, closing at over -2,300 points. * March 13 – The Government of Nepal announced that Mount Everest would closed off from the public and climbers for the rest of the season over concerns rising from the coronavirus pandemic. * March 14 – Spain goes into lockdown after the country is hard-hit by the COVID-19 pandemic the day before declaring the Alarm Status. * March 15 – New Zealand cancels the mass gathering marking the first anniversary of the 2019 Christchurch Mosque massacre due to 2019–20 coronavirus pandemic. * March 16 – Oil prices fall into the $20 range, down 10 percent from the previous day amid the coronavirus pandemic, as The Fed cuts interest rates to zero. * March 17 ** The Iranian government says that \"millions\" may die from the coronavirus if people keep ignoring health guidelines and continue traveling. Two major shrines were closed on March 16 after fiathful pushed into the courtyards. 90% of the 18,000 coronavirus cases in the Middle East have taken place in Iran; 988 people have died in the country. ** European leaders close the EU's external and Schengen borders for at least 30 days, in an effort to slow the COVID-19 pandemic. ** 2019–20 coronavirus pandemic: UEFA postpones the Euro 2020 association football tournament until summer 2021. * March 18 – The Eurovision Song Contest 2020 would be cancelled due to 2019–20 coronavirus pandemic in Europe. It's the first in the history of the contest to be cancelled. * March 20 ** 2019–20 coronavirus pandemic: The worldwide death toll from COVID-19 passes 10,000 as the total number of cases reaches a quarter of a million. ** Country music singer Kenny Rogers dies at the age of 81. * March 23 – 2019–20 coronavirus pandemic: The International Baccalaureate cancels the May 2020 IB Exams, affecting 200,000 students worldwide. * March 24 ** 2019–20 coronavirus pandemic: 2.6 billion people, a third of the world's population, face some form of movement restrictions as India goes into lockdown for 21 days to curb the spread of COVID-19. ** 2019–20 coronavirus pandemic: Chinese Premier Li Keqiang reports that \"the spread of domestically transmitted epidemic has been basically blocked\" and the outbreak has been controlled in China. ** 2019–20 coronavirus pandemic: The United Kingdom goes into lockdown for three weeks to contain COVID-19. ** 2019–20 coronavirus pandemic: Japan suspends the Summer Olympics until 2021. * March 25 – American FBI official Robert Levinson was declared dead by his family after being missing for nearly thirteen years while on a CIA mission. It is believed he died while being held captive by the Iranian government. * March 26 ** 2019–20 coronavirus pandemic: Global COVID-19 cases reach 500,000, with nearly 23,000 deaths confirmed. The United States surpasses China and Italy in total number of known COVID-19 cases, with at least 81,321 cases and more than 1,000 deaths. ** China temporarily suspends entry for foreign nationals with visas or residence permits, effective midnight March 28. ** Militants in the Philippines, Syria, Yemen, and Libya agree to U.N. Secretary-General António Guterres's call for a cease fire; some accept medical aid for themselves and the noncobatants in their communities. Guterres also asked wealthy countries to provide $2 billion to aid in fighting the virus. Colombia and Venezuela discussed a common response to the globabl pandemic, and the UAE has airlifted aid to Iran.Trading handguns for handwipes Christian Science Monitor, 26 Mar 2020 * March 27 ** North Macedonia becomes the 30th country to join NATO. ** Hamed Karoui, who was Prime Minister of Tunisia for ten years, dies at the age of 92. * March 30 ** 2019–20 coronavirus pandemic: The number of deaths in Spain, 7,340, passes those in China.Coronavirus: Spain surpasses China COVID-19 cases as deaths rise to 7,340 by Alex Culbertson, Sky News, 30 March 2020 ** 2020 Russia–Saudi Arabia oil price war: The price of Brent Crude falls 9% to $23 per barrel, the lowest level since November 2002.Coronavirus: Oil costs hit 2002 low as markets digest surge in infections by James Sillars, Sky News, 30 March 2020 ** 2020 Summer Olympics: The International Olympic Committee announced of rescheduled Olympics will be July 23 to August 8, 2021. ** Former Premier of the Republic of China General Hau Pei-tsun dies of multiple organ failure, aged 100. === April === * April 1 – Former Prime Minister of Somalia Nur Hassan Hussein dies of COVID-19, aged 82. * April 2 – 2019–20 coronavirus pandemic: Over 1,000,000 cases of COVID-19 are confirmed worldwide. * April 3 – 2019–20 coronavirus pandemic: Prime Minister of Singapore Lee Hsien Loong announced a much stricter set of rules called \"Circuit Breaker\", starting 7 April until at least 4 May. All non-essential workplaces will be closed during this period. Schools will move to home-based learning, and preschools will close. * April 5 ** 2019–20 coronavirus pandemic: The first case of COVID-19 in a zoo animal is reported; a four-year-old female Malayan tiger at the Bronx Zoo in New York.Bronx Zoo tiger infected with COVID-19 By Jeanna Bryner, Live Science, 5 Apr 2020 ** Mahmoud Jibril, interim Libyan Prime Minister who oversaw the 2011 civil war and the fall of Muammar Gaddafi, dies of COVID-19 at aged 67. * April 7 – 2019–20 coronavirus pandemic: Japan declares a state of emergency in response to COVID-19, and passes a stimulus package worth 108 trillion yen ($990 billion), equal to 20% of the country's GDP. * April 8 – 2019–20 coronavirus pandemic: China ends the lockdown in Wuhan, with people allowed to leave the city for the first time in 76 days. * April 10 – 2019–20 coronavirus pandemic: The death toll from COVID-19 exceeds 100,000 globally, a ten-fold increase from March 20. * April 12–13 – At least thirty people are killed in an Easter Sunday tornado outbreak in the Southeastern United States. * April 13 – 2019–20 coronavirus pandemic: Spain partially stops some lockdown rules, allowing around 300,000 non-essential workers, such as construction and manufacturing industries to return to their jobs. * April 15 ** 2019–20 coronavirus pandemic: The number of confirmed cases of COVID-19 passes 2 million worldwide. ** 2019–20 coronavirus pandemic: Denmark partially lift some of its lockdown rules, allowing children up to age 11 returned to school. * April 17 ** 2019–20 coronavirus pandemic: China fixes the coronavirus death toll upward in Wuhan, where the virus originated, adding 1,290 more fatalities to bring the country's reported deaths from COVID-19 to 4,632. ** 2019–20 coronavirus pandemic: Europe passes the 100,000 deaths mark. * April 18–April 19 – At least 23 people are killed at random at several places in Nova Scotia, Canada. It was the deadliest attack of its kind in Canadian history. * April 20 – Oil prices reach a record low, falling into negative values, due to the ongoing coronavirus pandemic and the Russia–Saudi Arabia oil price war. * April 24 – 2019–20 coronavirus pandemic: Ecuador revises its total confirmed cases to 22,719, doubled from previous day, caused by increased test capacity and presentation of delayed results. * April 25 – 2019–20 coronavirus pandemic: The death toll from COVID-19 exceeds 200,000 globally. The U.K. becomes the fifth country to report 20,000 deaths. * April 26 ** 2019–20 coronavirus pandemic: The number of cases in Iran passes 90,000. ** 2019–20 coronavirus pandemic: Spain further partially eases its lockdown rules, allowing children up to 14 to go outside their home for at most one hour. * April 27 – 2019–20 coronavirus pandemic: The number of confirmed cases of COVID-19 passes 3 million worldwide, while the number of confirmed cases of COVID-19 in the United States passes 1 million. * April 28 – 2019–20 coronavirus pandemic: Russia's 87,147 COVID-19 cases passes the 84,341 in China. === May === * May 1 ** In the aftermath of the 2020 Nova Scotia attacks, Canada bans assault-style weapons. ** 2019–20 coronavirus pandemic: U.S. Food and Drug Administration authorizes emergency remdesivir use to treat the sickest COVID-19 patients. ** 2019–20 coronavirus pandemic: The total number of recovered COVID-19 patient reached 1 million worldwide, according data from Johns Hopkins University. * May 2 – 2019–20 coronavirus pandemic: Spain further eases the nationwide lockdown, allowing adults to go outside their homes from 6 to 10am and 8 to 11pm. * May 3 – 2019–20 coronavirus pandemic: Brazil reports 100,000 cases of infection and 7,000 deaths. This is the ninth highest number of cases in the world, passing Iran. * May 4 – COVID-19 pandemic: Italy begins slowing down some of its lockdown measures. Italians can now exercise outside of their home, visit relatives at the same regions, be part of a funeral with a 15 attendees minimum, and visit bike and scooter shops. Schools, cinemas, and most shops remain closed. * May 5 – 2019–20 coronavirus pandemic: The UK death toll from COVID-19 becomes the highest in Europe at 32,313 after exceeding the death toll of 29,029 in Italy. * May 6 ** 2019–20 coronavirus pandemic: New evidence indicates that an Algerian-born French fishmonger who had not traveled to China and did not have contact with any Chinese nationals was treated for pneumonia from an unknown source, now identified as COVID-19, on December 27, 2019. ** Astronomers announce the discovery of the first black hole located in a star system visible to the naked eye. * May 9 ** Several Chinese and Indian soldiers are injured in a cross-border clash at the Nathu La crossing. About 150 troops participated in the face-off, which involved fistfights and stone-throwing. ** Rock and Roll pioneer Little Richard dies at the age of 87. * May 10 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 4 million worldwide. ** COVID-19 pandemic: Wuhan, the original epicenter of the pandemic, reports its first coronavirus cases in more than a month. A 89-year- old man was confirmed positive, but his wife and several member of the community were recorded as asymptomatic cases. * May 12 ** Gunmen storm a maternity hospital and kill 24 people, including two newborn babies in a majority-Shia neighborhood of Kabul, Afghanistan. ** Former Laotian Vice President and Prime Minister Sisavath Keobounphanh dies aged 92. * May 14 ** COVID-19 pandemic: *** The global death toll from COVID-19 exceeds 300,000. *** The UN warns of a global mental health crisis caused by isolation, fear, uncertainty and economic turmoil. * May 16 – Félicien Kabuga, a Rwandan businessman responsible for supporting the Rwandan genocide, is arrested in Asnières-sur-Seine, France after 26 years as a fugitive. * May 21 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 5 million worldwide, with 106,000 new cases recorded over the past 24 hours, the highest single-day figure so far. * May 22 ** Pakistan International Airlines Flight 8303 crashes in Karachi, killing 97 people, leaving two survivors from the plane and eight injuries on the ground. ** COVID-19 pandemic: Brazil overtakes Russia to become the country with the second highest number of COVID-19 cases, with over 330,000 reported. President Jair Bolsonaro continues to dismiss the threat of the virus. * May 26 ** Same-sex marriage becomes legal in Costa Rica, becoming the first Central American country to do so. ** Massive riots and protests break out in the United States following the police killing of George Floyd in Minneapolis, Minnesota. * May 27 ** U.S. Secretary of State Mike Pompeo says that Hong Kong is \"no longer autonomous\", as China backs a new security law that would make it a crime to undermine Beijing's authority in the territory. ** COVID-19 pandemic: The U.S. death toll passes 100,000 – more Americans then were killed in the Vietnam and Korean wars combined, and approaching that of the First World War, when 116,000 Americans died in combat. The total number of cases continues to rise, although the rate is slowing. * May 29 ** Taiwan decriminalises adultery. ** Abderrahmane Youssoufi, who was Prime Minister of Morocco for four years, dies of lung cancer at aged 96. * May 30 – The first crewed flight of the Dragon 2 (initially scheduled for May 27 but delayed due to weather) is launched from Cape Canaveral, Florida, the first manned spacecraft to take off from U.S. soil since 2011. * May 31 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 6 million worldwide. === June === * June 1 ** COVID-19 pandemic: The annual Tiananmen Square memorial in Hong Kong is banned for the first time since 1990 because of health concerns due to COVID-19. ** Kivu Ebola epidemic: The World Health Organization reports six new cases of Ebola, and UNICEF reports five deaths, in a renewed outbreak of the disease the Democratic Republic of the Congo. ** Killing of George Floyd: After a week of rioting, U.S. President Donald Trump officially labels Antifa as a terrorist organisation. * June 2 – A US$5 billion lawsuit is filed against Alphabet Inc. and Google, saying that the company violates users' right to privacy by tracking them in Chrome's private browsing Incognito mode. * June 3 ** Prime Minister Boris Johnson says the United Kingdom will change immigration laws to offer a pathway to UK citizenship for all Hong Kong citizens. ** Severe Cyclonic Storm Nisarga makes landfall south of Mumbai as a Category 1 hurricane. This is the first time a tropical cyclone has targeted the megacity since 1891. About 100,000 people have been evacuated. ** SpaceX successfully launches and deploys 60 satellites into a low Earth orbit from Cape Canaveral Air Force Station. This brings the total number of Starlink satellites in orbit to 482. ** Russian President Vladimir Putin declares a state of emergency after 20,000 tons of oil leaked near Siberia within the Arctic Circle on May 26, 2020. * June 4 – The interim government of Libya says they are in full control of the capital, Tripoli, after army forces loyal to Khalifa Haftar retreat from the territory after months of intense fighting in the city. * June 7 – COVID-19 pandemic: The global death toll from COVID-19 exceeds 400,000. * June 8 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 7 million worldwide. ** President of Burundi Pierre Nkurunziza, who ruled the country for fifteen years, dies of a heart attack while in office, aged 55. * June 9 – COVID-19 pandemic: A Harvard University study suggests that COVID-19 may have been spreading in China as early as August 2019, based on hospital car park usage and web search trends. * June 15 – At least 20 Indian soldiers and over 40 Chinese forces are killed or injured in skirmishes, the largest escalation along the Sino-Indian border in five decades. * June 16 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 8 million worldwide. ** North Korea destroys the Inter-Korean Liaison Office with South Korea in Kaesong, created in 2018 to improve relations. * June 18 – Kenya, Mexico, India, Ireland and Norway are elected as non-permanent members to the United Nations Security Council for the 2021 session. * June 20 – Three people are killed and three more are injured during a terrorist knife attack at Forbury Gardens in Reading, Berkshire. * June 21 – An annular solar eclipse occurs. It is visible mainly in countries in Asia and Africa. * June 22 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 9 million worldwide. * June 23 ** A 7.5-magnitude earthquake strikes the coast of Oaxaca, Mexico and kills at least four people. It is felt more than away in Mexico City. ** Lazarus Chakwera is elected President of Malawi in a rerun election, defeating incumbent Peter Mutharika.https://twitter.com/BonfasiaMapunda/status/1276486593596006403 The 2019 election was found to have been rigged and a new election was ordered. * June 27 – Micheál Martin succeeded Leo Varadkar as Taoiseach of Ireland in a three-party coalition government.Micheál Martin elected Taoiseach as head of Fianna Fáil, Fine Gael and Green coalition Irish Times, 2020-06-27 * June 28 ** COVID-19 pandemic: *** The number of confirmed cases of COVID-19 passes 10 million worldwide. The U.S. continues to have the highest number of any country as it reaches 2.5 million, a quarter of all cases globally. *** The global death toll from COVID-19 exceeds 500,000. * June 29 – Four gunmen attack on the Pakistani Stock Exchange killing four people in Karachi. === July === * July 1 – Russian voters support a constitutional amendment that would allow Vladimir Putin to seek two further six-year terms when his current term ends in 2024, potentially allowing him to remain in power until 2036. * July 2 – A landslide in Myanmar results in at least 162 deaths. * July 3 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 11 million worldwide. * July 4 – After record breaking rain, a massive flood occurs in the prefectures of Kumamoto and Kagoshima in the southern Japanese island of Kyushu, killing 49 people. * July 7 – In China, 21 people are killed and 16 were injured in a bus crash in Anshun, Guizhou. * July 8 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 12 million worldwide. ** At least 180 bodies are found in mass graves in Burkina Faso, where soldiers are fighting jihadists. It is suspected that the government forces were involved in mass executions. * July 10 ** The European Central Bank accepts Bulgaria and Croatia into the European Exchange Rate Mechanism, a mandatory stage for countries that wish to adopt the euro. This is the currency bloc's first major expansion in half a decade. ** The Turkish government orders the Hagia Sophia to be turned back into a mosque following a supreme court annulment of a 1934 presidential decree that made it a museum. ** In Singapore, Prime Minister Lee Hsien Loong is re-elected with a super majority and 61.24% of the vote. * July 12 ** 2020 Polish presidential election: Conservative incumbent President Andrzej Duda narrowly wins re-election against socially liberal challenger Rafał Trzaskowski. ** At least sixteen people are killed in border clashes between Armenian and Azerbaijani armed forces. * July 13 – C/2020 F3 (NEOWISE) can be seen by the naked eye and becomes one of the brightest visible to observers in the northern hemisphere since Comet Hale–Bopp in 1997. * July 14 – The United States government passes the Hong Kong Autonomy Act. * July 15 – The Twitter accounts of well known political figures, CEOs, and celebrities are hacked to promote a bitcoin scam. * July 19 – Flooding of the Brahmaputra River kills 189 and leaves 4 million homeless in India and Nepal. * July 21 – European leaders agree to create a €750 billion ($858 billion) recovery fund to rebuild EU economies impacted by the COVID-19 pandemic. * July 22 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 15 million worldwide. * July 24 – Television host Regis Philbin dies at the age of 88. * July 25 ** COVID-19 pandemic: North Korean leader Kim Jong-un held an emergency meeting after a suspected case of COVID-19 detected on North Korean town of Kaesong. Then the city was put on lockdown. ** Hurricane Hanna makes 2 landfalls in South Texas with 90 mph winds (145 km/h) mainly in Kennedy County, Texas. * July 26 – Academy Award-winning actress Olivia de Havilland died in Paris, aged 104. * July 28 – Former Prime Minister of Malaysia Najib Razak found guilty on all seven counts of abuse of power, money laundering and criminal breach of trust, becoming the first Prime Minister of Malaysia to be convicted of corruption. * July 30 – Successful launch of NASA's Mars 2020 mission to study the habitability of Mars in preparation for future human missions. === August === * August 3 – Former King of Spain Juan Carlos I goes into voluntary exile following a financial scandal. * August 4 – Multiple explosions caused by unsafely stored ammonium nitrate kill over 220 people, injure thousands, and severely damage the port of Beirut, Lebanon. Damage is said to be worth at $10–15 billion, and at least 300,000 people are left homeless. * August 5 ** U.S. Secretary of Health and Human Services Alex Azar travels to Taiwan, the highest U.S. official visit to the country in 40 years. The PRC condemns the visit. ** COVID-19 pandemic: The worldwide death toll from COVID-19 passes 700,000. * August 7 – Air India Express Flight 1344 crashes after overrunning the runway at Calicut International Airport in Kerala, India killing 19 of the 191 persons on board. * August 9 – President Alexander Lukashenko is controversially re-elected, with many saying the election system was rigged and unfair. Opposition candidate Sviatlana Tsikhanouskaya declared victory, however fled to Lithuania due to fears of being arrested. Many protest the election results. * August 10 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 20 million worldwide. ** In the aftermath of massive explosions in Beirut, Prime Minister Hassan Diab announced his resignation along with his government. * August 11 - COVID-19 pandemic: Russian President Vladimir Putin announces that Russia has approved the world's first COVID-19 vaccine. * August 12 ** It is reported that Britain's gross domestic product (GDP) fell by 20.4% in the second quarter of 2020, the biggest quarterly decline since records began in 1955, and the worst economic figure of any G7 nation. ** A train derailment kills three people near Stonehaven in Aberdeenshire, Scotland caused by heavy rain triggering a landslide. It is the worst rail derailment in the United Kingdom in over a decade. * August 13 - Israel and the UAE controversially agree to fix their national relations, marking the third Israeli–Palestinian peace deal. * August 18 - A mutiny in a military base by soldiers of the Malian Armed Forces develops into a coup d'état. President Ibrahim Boubacar Keïta and Prime Minister Boubou Cissé, among other senior governmental and military officers, are arrested. * August 19 - The Special Tribunal for Lebanon convicts in absentia Salim Ayyash, a member of Hezbollah for the 2005 assassination of former Prime Minister Rafic Hariri. * August 22 - COVID-19 pandemic: The worldwide death toll from COVID-19 passes 800,000. * August 24 - Two bombings in Jolo, Sulu kills fourteen people and injuring 75. * August 25 - Africa is declared free of wild polio, the second virus to be eradicated from the continent since smallpox 40 years previously. * August 26 - Amazon CEO Jeff Bezos becomes the first person in history to have a net worth of $200 billion, according to Forbes. * August 28 ** Japanese Prime Minister Shinzo Abe announced his resignation from the office due to bad health. ** Black Panther actor Chadwick Boseman dies of colon cancer at age 43. * August 30 - COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 25 million worldwide. India continues to record the highest daily increase of cases. * August 31 - Former President of India Pranab Mukherjee dies from COVID-19, aged 84. ===September=== * September 3 ** Sudanese Prime Minister Abdalla Hamdok announced a signed agreement to transition the country into a secular state. ** The skeletons of 200 mammoths and 30 other animals are unearthed at a construction site for the Mexico City Santa Lucía Airport. It is the largest find of mammoth bones to date. * September 4 ** Pope Benedict XVI becomes the longest-lived pope at 93 years, four months, and 16 days, surpassing Pope Leo XIII, who died in 1903. ** The La Línea highway tunnel, the longest road tunnel in South America at a length of 8.65 kilometres (5.37 mi), is opened in Colombia after 14 years of construction and several delays. ** Kosovo and Serbia announce that they will normalize economic relations. The two countries will also move their Israeli embassies to Jerusalem, becoming the third and fourth countries to recognize Jerusalem as Israel's capital. * September 10 - COVID-19 pandemic: The worldwide death toll from COVID-19 passes 900,000. * September 14 – The Royal Astronomical Society announces the detection of phosphine in Venus' atmosphere, which is known to be a strong predictor for the presence of microbial life. * September 15 - Israel, the United Arab Emirates and Bahrain sign agreements to formally normalise diplomatic relations. * September 16 - Yoshihide Suga is elected to replace Shinzo Abe as the next Prime Minister of Japan following the LDP leadership election. * September 17 - France, Germany, and the United Kingdom issue a joint note verbale to the United Nations rejecting China's claims to the South China Sea. * September 18 ** Associate Justice of the U.S. Supreme Court and feminist icon Ruth Bader Ginsburg dies of pancreatic cancer, aged 87. ** Former Canadian Prime Minister John Turner who supported free trade between Canada and the United States during his two and a half month tenure as prime minister, dies at 90.John Turner, PM and Liberal leader who battled free trade with U.S., dead at 91 * September 19 - A 1634 edition of The Two Noble Kinsmen, the last play by English playwright William Shakespeare, is discovered in Salamanca, Spain. It is believed to be the oldest copy of any of his works in the country. * September 20 - A collection of 2,657 documents are released describing over 200,000 suspicious transactions valued at over trillion that occurred from 1999 to 2017 across multiple global financial institutions. * September 21 - Microsoft agrees to buy video game holding company ZeniMax Media, including Bethesda Softworks and their following subsidiaries for US$7.5 billion, in what is the biggest and most expensive takeover in the history of the video game business. * September 27 - Deadly clashes erupt in Nagorno-Karabakh between armed forces of Armenia and Azerbaijan forces. * September 29 ** COVID-19 pandemic: The worldwide death toll from COVID-19 passes one million. ** Kuwait's Emir Sabah Al-Ahmad Al- Jaber Al-Sabah dies at an American hospital, aged 91. Nawaf Al-Ahmad Al-Jaber Al-Sabah replaces him as Kuwait's Emir. ===October=== * October 1 - The EU launches legal action against the UK, accusing it of breaking international law by overriding sections of the Brexit withdrawal agreement. * October 4 – A referendum was held for a possible chance of independence for New Caledonia. Independence was rejected, with 53.26% of voters against. * October 5 – Massive protests breakout in Kyrgyzstan following accusations that the 2020 parliamentary election was \"unfair\". * October 6 – Van Halen guitarist Eddie Van Halen dies of throat cancer at age 65. * October 10 – Armenia and Azerbaijan agreed to stop military action for a short time in the ongoing Nagorono-Karabakh conflict. * October 15 ** The Government of Thailand declared a \"severe\" state of emergency with many arrests in response to the intense protesting. ** Following the intense protests in Kyrgyzstan, President Sooronbay Jeenbekov announces his resignation. * October 17 – Prime Minister of New Zealand Jacinda Ardern wins in a landslide victory for second term in office in the general election. * October 19 – Luis Arce is elected President of Bolivia in the general election, replacing interim President Jeanine Áñez. * October 20 – NASA's OSIRIS-REx spacecraft briefly touches down on Bennu, becoming the agency's first probe to retrieve samples from an asteroid, with its cargo due for return to Earth in 2023. * October 22 – Protests break out in Poland over the country's controversial decision to making abortions illegal. * October 26 ** NASA confirms the existence of molecular water on the sunlit side of the Moon at concentrations of up to 412 parts per million. ** Wavel Ramkalawan is elected the 5th President of Seychelles, becoming the first Opposition Leader elected to the presidency. * October 29 – Three people are stabbed to death in Nice, France. An attempted stabbing attack also happened in Avignon, no one was killed. President Emmanuel Macron said the stabbings were an example of Islamic terrorism. * October 30 – A 7.0 magnitude earthquake and tsunami strikes parts of Turkey and Greece killing at least 100 people and injuring 1,000 people. * October 31 ** Academy Award-winning actor Sir Sean Connery died at his home in The Bahamas, aged 90. ** Typhoon Goni makes landfall in the Philippines as a category 5 super typhoon and became the strongest landfalling tropical cyclone on record with winds reaching up to 315 km/h (195 mph). ===November=== * November 1 – Former Prime Minister Maia Sandu and incumbent President Igor Dodon advance into the second-round of the presidential election in Moldova. * November 2 ** A mass shooting spree across many locations in Vienna, Austria kills one civilian and multiple people are injured. The attack is described as a terrorist attack by Austrian Chancellor Sebastian Kurz. ** Three gunmen killed twenty-two people at Kabul University's main campus in Kabul, Afghanistan. The Islamic State of Iraq and the Levant claimed responsibility for the attacks. * November 3 – In the United States, incumbent President Donald Trump faces off former Vice President Joe Biden in the 2020 presidential election with no winner declared on election night. * November 4 ** The United States formally leaves the Paris Agreement on climate change. ** An armed conflict in the Tigray Region of Ethiopia break out over conflicts with policies of Prime Minister Abiy Ahmed and a surprise armed attacked by Tigray security forces. * November 7 – Former Vice President Joe Biden defeats President Donald Trump in the 2020 presidential election and will become the 46th President of the United States on January 20, 2021. U.S. Senator from California Kamala Harris will become the country's first female, African-American and Asian-American Vice President, becoming the highest- ranking female elected official in American history. * November 8 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 50 million worldwide. ** Long-time Jeopardy! host Alex Trebek dies after battling stage-4 pancreatic cancer. * November 9 ** COVID-19 pandemic: The first successful phase III trial of a COVID-19 vaccine is announced by drug companies Pfizer and BioNTech, able to prevent 90% of infections. ** A Russian-backed peace treaty between Armenia and Azerbaijan is signed in Moscow, ending the Nagorno- Karabakh war the following day. ** Massive protests break out in Peru after the country's congress voted to impeach President Martín Vizcarra. * November 10 ** Former President Amadou Toumani Touré, who ruled Mail for ten years until being overthrown in a coup d'état in 2012, dies in Turkey at aged 72. ** President of Peru Martín Vizcarra is removed from the presidency after the Congress of Peru found him \"morally corrupt\". President of the Congress, Manuel Merino became the country's next president. * November 11 ** Bahrain's first and only Prime Minister since 1971, Prince Khalifa bin Salman Al Khalifa, dies in the United States at aged 84. ** China issued a decision ordering to disqualify four Hong Kong legislators. * November 12 ** Jerry Rawlings, military leader who led Ghana from 1980 to 2001 and became the country's first president, dies of COVID-19 at aged 73. ** Hong Kong pro- democracy lawmakers resign in response to four lawmakers disqualification made by the government. ** The PlayStation 5 is released in North America, Australia, New Zealand, Japan, Singapore, and South Korea. ** Opposition Leader Johnny Briceño is elected Prime Minister of Belize, beating Patrick Faber and his party. * November 15 ** The Regional Comprehensive Economic Partnership (RCEP) is signed by 15 Asia-Pacific countries to form the world's largest free-trade bloc, covering a third of the world's population. ** Following the mass protests in Peru, President Manuel Merino resigns from the presidency only five days after assuming it. ** Former Prime Minister Maia Sandu defeats incumbent President Igor Dodon in the presidential election.Pro- EU candidate Sandu leads in Moldova presidential election run-off - exit poll Reuters, 15 November 2020 ** NASA and SpaceX launch the SpaceX Crew-1 mission from the Kennedy Space Center to the ISS, the first operational flight of the Crew Dragon capsule. * November 16 ** Francisco Sagasti is elected Peru's Congressional President and later becomes the country's 87th president following the resignation of Manuel Merino. ** COVID-19 pandemic: Moderna's mRNA vaccine is proven to be 94.5% effective against COVID-19 based on interim results, including severe illnesses. The vaccine is easier to distribute as no ultra-cold storage is required. * November 17 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 55 million worldwide, with around a million cases recorded every two days on average. * November 18 ** COVID-19 pandemic: Pfizer and BioNTech have completed trials on their COVID-19 vaccine, with an overall effectiveness rate of 95% without adverse events. ** The Federal Aviation Administration allows the Boeing 737 MAX to fly in the United States after they are modified; this follows a 20-month ban caused by two accidents. * November 19 ** The National Science Foundation announces the decommission of the Puerto Rican radio telescope Arecibo Observatory. ** The Brereton Report into Australian war crimes during the War in Afghanistan is released. * November 20 – Irinej, the 45th Patriarch of the Serbian Orthodox Church since 2010, dies of COVID-19 at aged 90. * November 22 - The United States withdraws from the Treaty on Open Skies. * November 23 - COVID-19 pandemic: AstraZeneca's AZD1222 vaccine, developed in partnership with Oxford University, is shown to be 70% effective in protecting against COVID-19. The efficacy can be raised to 90% if an initial half dose is followed by a full dose a month later, based on interim data. * November 25 ** Argentine footballer and FIFA World Cup champion Diego Maradona dies of a heart attack at aged 60. ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 60 million worldwide. ** Ingrida Šimonytė is selected by a coalition party in the Seimas to be the 14th Prime Minister of Lithuania, becoming the second woman to hold this office. * November 27 - Iran's top nuclear scientist, Mohsen Fakhrizadeh, is assassinated near Tehran. * November 28 - Boko Haram jihadists attack a farm in the Borno State in Nigeria and killed at least 110 people. * November 30 ** A penumbral lunar eclipse occurs; the last of four total lunar eclipses in 2020. ** Protein folding, one of the biggest mysteries in biology, is solved by artificial intelligence company DeepMind. ===December=== * December 1 – The Arecibo Telescope of the Arecibo Observatory collapses, just weeks after the announcement of its planned demolition. * December 2 ** COVID-19 pandemic: The United Kingdom approves Pfizer's BNT162b2 vaccine, being the first country in the world to do so. ** Valéry Giscard d'Estaing, France's 20th President who oversaw the country's oil crisis and modernised the country, dies of COVID-19 at aged 94. * December 3 – The United Nations Commission on Narcotic Drugs votes to remove cannabis from a list of dangerous drugs in recognition of its medical value, although some controls will remain. * December 4 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 65 million worldwide, with the global death toll passing 1.5 million. Over 10,000 people worldwide have died on average every day, with one death every nine seconds. According to the World Health Organization, COVID-19 had caused more deaths in 2020 than tuberculosis in 2019, as well as four times the number of deaths than malaria. ** Somali Civil War: The United States announces its withdrawal from the conflict over the next month. ** Zdravko Krivokapić becomes the Prime Minister of Montenegro, becoming the first Independent politician to do so.\"Krizu prevazići reformama i znanjem\", Radio Televizija Crne Gore (RTCG), 2 December 2020 * December 5 ** COVID-19 pandemic: Russia begins mass vaccination against COVID-19 with the Sputnik V candidate. ** Hayabusa2 returns to Earth with samples from the asteroid 162173 Ryugu. * December 6 ** Tabaré Vázquez, who was President of Uruguay twice in the 21st century, dies at aged 80. ** In Venezuela, the United Socialist Party of Venezuela kept their majority in the National Assembly, despite many organizations saying the elections were unfair and possibly illegal. * December 7 – Incumbent Nana Akufo-Addo is re-elected President of Ghana, defeating former President John Mahama with a 51% to 47% margin. * December 8 ** COVID-19 pandemic: The United Kingdom becomes the first nation to begin a mass vacination, fully tested vaccine. ** A report into the 2019 Christchurch mosque shootings is released to the public. ** Nepal and China officially agree on Mount Everest's actual height, which is 8,848.86m. * December 10 ** COVID-19 pandemic: The United States and Saudi Arabia approve Tozinameran for emergency use, while Argentina approves Sputnik V. ** Israel and Morocco normalise diplomatic relations and the United States supports recognition of Moroccan sovereignty over the Western Sahara and announces plans to build a consulate there. ** The corruption trial of former President of France Nicolas Sarkozy ends in Paris. * December 11 – The European Union agrees to reduce greenhouse gas emissions by 55% over the next decade. * December 12 ** Iran executes Telegram journalist Ruhollah Zam, aged 42, over treason-related charges over his activism during the 2017–2018 Iranian protests. ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 70 million worldwide. ** Bhutan and Israel normalise diplomatic relations. * December 13 – Incumbent Prime Minister of Eswatini Ambrose Mandvulo Dlamini dies from COVID-19, aged 52. * December 14 ** COVID-19 pandemic: The United States and Canada begin mass vaccination with Tozinameran. ** The United States removes Sudan from its list of state sponsors of terrorism. ** The United States places sanctions on Turkey in retaliation for their purchase of a missile system from Russia, making the first time they have sanctioned a NATO ally. ** A total solar eclipse is visible from parts of the South Pacific Ocean, southern South America, and the South Atlantic Ocean. * December 15 – The International Criminal Court accuses the Philippines of crimes against humanity in its war on drugs. * December 16 ** Flavio Cotti, the 80th President of the Swiss Confederation, dies from COVID-19 at aged 81. ** The United States formally accuses Switzerland and Vietnam of currency manipulation. * December 17 - Pierre Buyoya, the 3rd President of Burundi and the country's second longest serving president at thirteen years, dies of COVID-19 at aged 71. * December 18 ** COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 75 million worldwide. ** Andorra's first Prime Minister Òscar Ribas Reig dies at aged 84. * December 20 – COVID-19 pandemic: A highly infectious new strain of SARS-CoV-2 beginning in the U.K. spreads to Europe and Australia, causing international border closures. * December 21 ** COVID-19 pandemic: 36 cases are reported in Antarctica, marking the first infections in the last continent to report infections. ** A great conjunction of Jupiter and Saturn occurs, with the two planets separated in the sky by 0.1 degrees. This is the closest conjunction between the two planets since 1623. * December 24 – The United Kingdom and the European Union agree to a free trade agreement before the end of the transition period. * December 25 – In the United States, a possible suicide bombing explode in downtown Nashville, Tennessee. * December 27 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 80 million worldwide. * December 29 ** Italian-born French fashion designing icon Pierre Cardin dies at aged 98. ** In Croatia, a 6.4 seismic earthquake strikes Petrinja, killing seven people and injuring 26 people. * December 30 – An attack on the Aden International Airport in Aden, Yemen kills twenty-five people and injures over 100 people. * December 31 – Following the United Kingdom's departure from the European Union, the current transition period for negotiations on a future relationship expires. == Births == * May 10 – Prince Charles of Luxembourg == Deaths == ===January=== * January 1 – David Stern, American businessman and NBA commissioner (b. 1942) * January 2 – John Baldessari, American conceptual artist (b. 1931) * January 3 ** Abu Mahdi al-Muhandis, Iraqi-Iranian military commander (b. 1954) ** Qasem Soleimani, Iranian general (b. 1957) * January 5 ** Anri Jergenia, 4th Prime Minister of Abkhazia (b. 1941) ** Hans Tilkowski, German football goalkeeper and manager (b. 1935) * January 6 – Luís Morais, Brazilian football player (b. 1930) * January 7 ** Silvio Horta, American screenwriter and television producer (b. 1974) ** Neil Peart, Canadian drummer and lyricist (b. 1952) ** Elizabeth Wurtzel, American writer and journalist (b. 1967) * January 8 ** Edd Byrnes, American actor (b. 1932) ** Buck Henry, American actor, screenwriter and television producer (b. 1930) ** Infanta Pilar de Borbón, Spanish royal (b. 1936) * January 9 – Mike Resnick, American science fiction author (b. 1942) * January 10 ** Neda Arnerić, Serbian film actress (b. 1953) ** Marino Bollini, former Captain Regent of San Marino (b. 1933) ** Guido Messina, Italian racing cyclist (b. 1931) ** Qaboos bin Said, Sultan of Oman (b. 1940) * January 12 – Roger Scruton, British philosopher and writer (b. 1944) * January 15 ** Rocky Johnson, Canadian professional wrestler (b. 1944) ** Christopher Tolkien, British academic and editor (b. 1924) * January 16 – Efraín Sánchez, Colombian footballer and manager (b. 1926) * January 19 ** Jimmy Heath, American jazz saxophonist (b. 1926) ** Shin Kyuk- ho, South Korean businessman (b. 1921) * January 21 ** Hédi Baccouche, 6th Prime Minister of Tunisia (b. 1930) ** Terry Jones, Welsh actor and comedian (b. 1942) ** Tengiz Sigua, 2nd Prime Minister of Georgia (b. 1934) * January 23 ** Frederick Ballantyne, 7th Governor-General of Saint Vincent and the Grenadines (b. 1936) ** Gudrun Pausewang, German writer (b. 1928) * January 24 – Rob Rensenbrink, Dutch footballer (b. 1947) * January 26 ** Kobe Bryant, American professional basketball player (b. 1978) ** Louis Nirenberg, Canadian-American mathematician (b. 1925) * January 30 ** John Andretti, American race car driver (b. 1963) * January 31 ** Mary Higgins Clark, American novelist (b. 1927) ** Janez Stanovnik, 12th President of SR of Slovenia (b. 1922) ===February=== * February 1 – Andy Gill, English musician (b. 1956) * February 2 – Mike Moore, 34th Prime Minister of New Zealand (b. 1949) * February 3 – George Steiner, French-American literary critic and essayist (b. 1929) * February 4 ** José Luis Cuerda, Spanish filmmaker, screenwriter, and producer (b. 1947) ** Daniel arap Moi, 2nd President of Kenya (b. 1924) * February 5 ** Stanley Cohen, American Nobel biochemist (b. 1922) ** Kirk Douglas, American actor, director, and producer (b. 1916) * February 6 – Jhon Jairo Velásquez, Colombian hitman and drug dealer (b. 1962)Pablo Escobar's former hitman \"Popeye\" has died at 57 cbsnews.com * February 7 ** Orson Bean, American actor, comedian, and producer (b. 1928) ** Li Wenliang, Chinese ophthalmologist (b. 1986) ** Nexhmije Pagarusha, Albanian singer and actress (b. 1933) * February 8 – Robert Conrad, American actor (b. 1935) * February 9 – Mirella Freni, Italian soprano (b. 1935) * February 11 – Joseph Shabalala, South African musician (b. 1940) * February 12 – Geert Hofstede, Dutch social psychologist (b. 1928) * February 13 – Rajendra K. Pachauri, Indian scientist (b. 1940) * February 14 – Lynn Cohen, American actress (b. 1933) * February 15 – Caroline Flack, English television and radio presenter (b. 1979) * February 16 ** Zoe Caldwell, Australian actress (b. 1933) ** Larry Tesler, American computer scientist (b. 1945) * February 17 ** Mário da Graça Machungo, 1st Prime Minister of Mozambique (b. 1940) ** Kizito Mihigo, Rwandan gospel singer, organist and peace activist (b. 1981) ** Andrew Weatherall, English music DJ and producer (b. 1963) ** Sonja Ziemann, German actress (b. 1926) * February 18 ** José Bonaparte, Argentine paleontologist (b. 1928) * February 19 – Pop Smoke, American rapper (b. 1999) * February 22 – Kiki Dimoula, Greek poet (b. 1931) * February 24 ** Clive Cussler, American author (b. 1931) ** Katherine Johnson, American mathematician (b. 1918) ** Diana Serra Cary, American child actress (b. 1918) * February 25 ** Mario Bunge, Argentine philosopher (b. 1919) ** Hosni Mubarak, 41st Prime Minister and 4th President of Egypt (b. 1928) ** Dmitry Yazov, Soviet and Russian marshal (b. 1924) * February 26 – Nexhmije Hoxha, Albanian politician (b. 1921) * February 28 – Freeman Dyson, British-born American physicist and mathematician (b. 1923) * February 29 ** Éva Székely, Hungarian swimmer, Olympic champion (b. 1927) ** Luis Alfonso Mendoza, Mexican voice actor, voice director and announcer (b. 1964) ===March=== * March 1 ** Ernesto Cardenal, Nicaraguan poet and priest (b. 1925) ** Jack Welch, American business executive and writer (b. 1935) * March 2 – James Lipton, American writer, lyricist and actor (b. 1926) * March 3 – Stanisław Kania, Polish head of state, First Secretary of the Polish United Workers' Party (b. 1927) * March 4 ** Javier Pérez de Cuéllar, 137th Prime Minister of Peru and 5th United Nations Secretary-General (b. 1920) ** Robert Shavlakadze, Georgian high jumper (b. 1933) * March 6 ** Henri Richard, Canadian Hall of Fame ice hockey player (b. 1936) ** McCoy Tyner, American jazz pianist (b. 1938) * March 8 – Max von Sydow, Swedish-French actor (b. 1929) * March 11 ** Charles Wuorinen, American composer (b. 1938) ** Michel Roux, French chef and restaurateur (b. 1941) * March 12 – Tonie Marshall, French-American actress, screenwriter, and film director (b. 1951) * March 13 – Dana Zátopková, Czech javelin thrower (b. 1922) * March 14 – Genesis P-Orridge, English singer-songwriter, musician, poet, and occultist (b. 1950) * March 16 – Stuart Whitman, American actor (b. 1928) * March 17 ** Eduard Limonov, Russian writer, poet, publicist, and political dissident (b. 1943) ** Roger Mayweather, American professional boxer and trainer (b. 1961) ** Manuel Serifo Nhamadjo, Acting President of Guinea- Bissau (b. 1958) ** Betty Williams, Northern Ireland Nobel peace activist (b. 1943) * March 18 ** Catherine Hamlin, Australian obstetrician and gynaecologist (b. 1924) ** Alfred Worden, American astronaut (b. 1932) * March 20 ** Amadeo Carrizo, Argentine footballer (b. 1926) ** Kenny Rogers, American country singer and songwriter (b. 1938) * March 21 – Lorenzo Sanz, Spanish sports executive (b. 1943) * March 23 – Lucia Bosè, Italian actress and beauty pageant winner (b. 1931) * March 24 ** Manu Dibango, Cameroonian saxophonist (b. 1933) ** Stuart Gordon, American film director (b. 1947) ** Terrence McNally, American playwright (b. 1938) ** Albert Uderzo, French comic book artist (b. 1927) * March 26 ** Princess María Teresa of Bourbon-Parma, Spanish-French royal (b. 1933) ** Michel Hidalgo, French footballer and manager (b. 1933) * March 27 – Hamed Karoui, 7th Prime Minister of Tunisia (b. 1927) * March 29 ** Philip W. Anderson, American Nobel physicist (b. 1923) ** Yuri Bondarev, Soviet and Russian writer and screenwriter (b. 1924) ** Krzysztof Penderecki, Polish composer and conductor (b. 1933) * March 30 ** Manolis Glezos, Greek politician and resistance fighter (b. 1922) ** Hau Pei- tsun, 13th Premier of the Republic of China (b. 1919) ** Bill Withers, American singer-songwriter (b. 1938) ** Joachim Yhombi-Opango, 4th President and 12th Prime Minister of the Republic of the Congo (b. 1939) * March 31 – Abdul Halim Khaddam, Acting President of Syria (b. 1932) === April === * April 1 ** Nur Hassan Hussein, 12th Prime Minister of Somalia (b. 1937) ** Ellis Marsalis Jr., American jazz pianist (b. 1934) ** Adam Schlesinger, American singer-songwriter and guitarist (b. 1967) * April 2 – William Frankland, British immunologist (b. 1912) * April 4 – Rafael Leonardo Callejas Romero, 31st President of Honduras (b. 1943) * April 5 ** Honor Blackman, English actress (b. 1925) ** Margaret Burbidge, English-born American astrophysicist (b. 1919) ** Shirley Douglas, Canadian actress and civil rights activist (b. 1934) ** Mahmoud Jibril, former Prime Minister of Libya (b. 1952) ** Pentti Linkola, Finnish deep ecologist and writer (b. 1932) * April 6 – James Drury, American actor (b. 1934) * April 7 – John Prine, American singer-songwriter (b. 1946) * April 8 ** Abdul Momin Imambari, Bangladeshi Islamic scholar (b. 1930) ** Valeriu Muravschi, 1st Prime Minister of Moldova (b. 1949) * April 10 ** Enrique Múgica, Spanish politician (b. 1932)Muere Enrique Múgica, ex ministro de Justicia y Defensor del Pueblo. La Razón, 11 April 2020 ** Nobuhiko Obayashi, Japanese filmmaker (b. 1938) * April 11 ** John Horton Conway, English mathematician (b. 1937) ** Edem Kodjo, 3rd Prime Minister of Togo (b. 1938) * April 12 ** Stirling Moss, English F1 driver (b. 1929) ** Chung Won-shik, 21st Prime Minister of South Korea (b. 1928) ** Tim Brooke- Taylor, English comic performer (b. 1940) * April 13 ** Ryo Kawasaki, Japanese jazz fusion guitarist and composer (b. 1947) ** Landelino Lavilla, Spanish politician (b. 1934) * April 15 ** Brian Dennehy, American actor (b. 1938) ** Lee Konitz, American jazz composer and alto saxophonist (b. 1927) * April 16 ** Gene Deitch, American-Czech animator and film director (b. 1924) ** Luis Sepúlveda, Chilean writer (b. 1949) * April 17 ** Filipe Duarte, Portuguese actor (b. 1973) ** Norman Hunter, English international footballer (b. 1943) * April 21 ** Abdurrahim El-Keib, Acting Prime Minister of Libya (b. 1950) ** Laisenia Qarase, 6th Prime Minister of Fiji (b. 1941) ** Florian Schneider, German electronic musician (b. 1947) * April 22 ** Hartwig Gauder, German Olympic champion (b. 1954) ** Shirley Knight, American actress (b. 1936) * April 25 – Per Olov Enquist, Swedish author (b. 1934) * April 27 – Dragutin Zelenović, 1st Prime Minister of Serbia (b. 1928) * April 28 – Robert May, Baron May of Oxford, Australian scientist (b. 1936) * April 29 ** Trevor Cherry, English footballer (b. 1948) ** Denis Goldberg, South African social campaigner (b. 1933) ** Yahya Hassan, Danish poet and political activist (b. 1995) ** Irrfan Khan, Indian actor (b. 1967) ** Jānis Lūsis, Latvian Olympic champion (b. 1939) ** Giacomo dalla Torre del Tempio di Sanguinetto, 80th Prince and Grand Master of the Sovereign Military Order of Malta (b. 1944) ** Maj Sjöwall, Swedish writer (b. 1935) * April 30 ** Tony Allen, Nigerian drummer, composer, and songwriter (b. 1940) ** Rishi Kapoor, Indian actor (b. 1952) ===May=== * May 1 – Tun Tin, 6th Prime Minister of Burma (b. 1920) * May 2 – Idir, Algerian singer (b. 1949) * May 5 ** Didi Kempot, Indonesian prominent singer-songwriter of campursari genre (b. 1966) ** Millie Small, Jamaican singer-songwriter (b. 1946) * May 8 – Roy Horn, German-American magician (b. 1944) * May 9 – Little Richard, American musician (b. 1932) * May 10 – Betty Wright, American soul singer (b. 1953) * May 11 – Jerry Stiller, American comedian (b. 1927) * May 12 ** Sisavath Keobounphanh, 13th Prime Minister of Laos (b. 1928) ** Astrid Kirchherr, German photographer and artist (b. 1938) ** Michel Piccoli, French actor, producer and film director (b. 1925) * May 13 ** Rolf Hochhuth, German author and playwright (b. 1931) ** Chedli Klibi, 4th Secretary General of the Arab League (b. 1925) * May 15 ** Lynn Shelton, American filmmaker (b. 1965) ** Fred Willard, American actor and comedian (b. 1933) * May 17 – José Cutileiro, 8th Secretary General of the Western Europe Union (b. 1934) * May 19 – Ravi Zacharias, Indian-born Canadian-American Christian apologist (b. 1946) * May 20 ** Adolfo Nicolás, Spanish priest (b. 1936) ** Gianfranco Terenzi, former Captain Regent of San Marino (b. 1941) * May 21 – Oliver E. Williamson, American Nobel economist (b. 1932) * May 22 ** Ashley Cooper, Australian tennis player (b. 1936) ** Mory Kanté, Guinean singer and musician (b. 1950) ** Luigi Simoni, Italian football player and manager (b. 1939) ** Jerry Sloan, American basketball player and head coach (b. 1942) * May 23 – Hana Kimura, Japanese professional wrestler (b. 1997) * May 24 – Jimmy Cobb, American jazz drummer (b. 1929) * May 25 ** Hyun Soong-jong, 22nd Prime Minister of South Korea (b. 1919) ** Balbir Singh Sr., Indian field hockey player and manager (b. 1923) ** Vadão, Brazilian football manager (b. 1956) * May 26 – Stanley Ho, Hong Kong-Macau business magnate, investor and philanthropist (b. 1921) * May 27 – Larry Kramer, American author and LGBT rights activist (b. 1935) * May 29 – Abderrahmane Youssoufi, 12th Prime Minister of Morocco (b. 1924) * May 30 ** Yawovi Agboyibo, 8th Prime Minister of Togo (b. 1943) ** Bobby Morrow, American athlete (b. 1935) * May 31 – Christo, Bulgarian-American artist (b. 1935) ===June=== * June 2 ** Carlo Ubbiali, Italian motorcycle road racer (b. 1929) ** Wes Unseld, American basketball player and coach (b. 1946) * June 4 – Pete Rademacher, American Olympic heavyweight boxing champion (b. 1928) * June 5 – Boris Gaganelov, Bulgarian footballer and manager (b. 1941) * June 8 ** Tony Dunne, Irish footballer (b. 1941) ** Pierre Nkurunziza, 8th President of Burundi (b. 1964) * June 11 ** Emmanuel Issoze-Ngondet, 10th Prime Minister of Gabon (b. 1961) ** Dennis O'Neil, American comic book writer (b. 1939) ** Rosa Maria Sardà, Spanish actress (b. 1941) * June 13 – Jean Raspail, French author and explorer (b. 1925) * June 14 ** Aarón Padilla Gutiérrez, Mexican footballer (b. 1942) ** Sushant Singh Rajput, Indian actor (b. 1986) ** Keith Tippett, British pianist and composer (b. 1947) * June 16 – Edén Pastora, Nicaraguan politician and guerrilla (b. 1937) * June 17 ** Marlene Ahrens, Chilean athlete (b. 1933) ** György Kárpáti, Hungarian water polo player (b. 1935) * June 18 ** Tibor Benedek, Hungarian water polo player (b. 1972) ** Dame Vera Lynn, English singer (b. 1917) ** Jules Sedney, 5th Prime Minister of Suriname (b. 1922) * June 19 ** Sir Ian Holm, English actor (b. 1931) ** Carlos Ruiz Zafón, Spanish novelist (b. 1964) * June 20 ** Ema Derossi- Bjelajac, 6th President of the Presidency of the SR of Croatia (b. 1926) ** Pedro Lima, Portuguese actor (b. 1971) * June 21 ** Ahmed Radhi, Iraqi footballer and manager (b. 1964) ** Zeev Sternhell, Polish-born Israeli historian and political scientist (b. 1935) * June 22 – Joel Schumacher, American film director (b. 1939) * June 26 – Milton Glaser, American graphic designer (b. 1929) * June 27 ** Belaid Abdessalam, 7th Prime Minister of Algeria (b. 1928) ** Linda Cristal, Argentine actress (b. 1931) ** Ilija Petković, Serbian footballer and manager (b. 1945) * June 29 – Carl Reiner, American actor, film director and comedian (b. 1922) * June 30 – Ida Haendel, Polish-born English violinist (b. 1928) ===July=== * July 1 ** Emmanuel Rakotovahiny, 15th Prime Minister of Madagascar (b. 1938) ** Everton Weekes, Barbadian cricketer (b. 1925) * July 3 – Saroj Khan, Indian choreographer (b. 1948) * July 5 ** Willi Holdorf, German athlete and Olympic champion (b. 1940) ** Volodymyr Troshkin, Soviet and Ukrainian footballer (b. 1947) * July 6 ** Charlie Daniels, American country singer-songwriter and musician (b. 1936) ** Ennio Morricone, Italian composer, orchestrator and conductor (b. 1928)E' morto Ennio Morricone. Il compositore premio Oscar aveva 91 anni, la Repubblica * July 8 ** Amadou Gon Coulibaly, 10th Prime Minister of Ivory Coast (b. 1959) ** Finn Christian Jagge, Norwegian alpine skier and Olympic champion (b. 1966) ** Alex Pullin, Australian Olympic snowboarder (b. 1987) ** Naya Rivera, American actress, model and singer (b. 1987) * July 9 – Miloš Jakeš, 5th General Secretary of the Communist Party of Czechoslovakia (b. 1922) * July 10 ** Jack Charlton, English footballer and manager (b. 1935) ** Paik Sun-yup, South Korean military officer (b. 1920) ** Lara van Ruijven, Dutch short track speed skater (b. 1992) ** Olga Tass, Hungarian gymnast and Olympic champion (b. 1929) * July 12 ** Hassan Abshir Farah, 9th Prime Minister of Somalia (b. 1945) ** Kelly Preston, American actress and model (b. 1962) ** Wim Suurbier, Dutch footballer (b. 1945) ** Lajos Szűcs, Hungarian footballer (b. 1943) * July 13 ** Grant Imahara, American electrical engineer, roboticist, and television host (b. 1970) ** Hasan al-Lawzi, Acting Prime Minister of Yemen (b. 1952) * July 15 - Toke Talagi, 5th Premier of Niue (b. 1951) * July 17 ** Zizi Jeanmaire, French ballet dancer (b. 1924) ** John Lewis, American civil rights leader and politician (b. 1940) ** Silvio Marzolini, Argentine footballer (b. 1940) ** Ron Tauranac, British-Australian engineer and racing car designer (b. 1925) * July 18 ** Juan Marsé, Spanish novelist, journalist and screenwriter (b. 1933) ** Haruma Miura, Japanese actor (b. 1990) * July 19 ** Sapardi Djoko Damono, Indonesian poet and literary figure (b. 1940) ** Seydou Diarra, 4th Prime Minister of Ivory Coast (b. 1933) ** Nikolai Tanayev, 8th Prime Minister of Kyrgyzstan (b. 1945) * July 21 ** Francisco Rodríguez Adrados, Spanish philologist (b. 1922) ** Annie Ross, Scottish-American singer and actress (b. 1930) * July 23 – Jean Brankart, Belgian racing cyclist (b. 1930) * July 24 ** Ben Jipcho, Kenyan athlete, Olympic silver medallist (b. 1943) ** Benjamin Mkapa, 3rd President of Tanzania (b. 1938) * July 25 – Peter Green, English blues rock singer- songwriter (b. 1946) * July 26 – Dame Olivia de Havilland, British-American actress (b. 1916) * July 27 – Owen Arthur, 5th Prime Minister of Barbados (b. 1949) * July 28 ** Bent Fabric, Danish pianist and composer (b. 1924) ** Gisèle Halimi, Tunisian-French lawyer and feminist (b. 1927) * July 30 – Lee Teng-hui, 13th President of the Republic of China (b. 1923) * July 31 ** Alan Parker, English filmmaker (b. 1944) ** Stephen Tataw, Cameroonian footballer (b. 1963) ===August=== * August 1 – Wilford Brimley, American actor and singer (b. 1934) * August 2 ** Leon Fleisher, American pianist (b. 1928) ** Zhaksylyk Ushkempirov, Kazakh Olympic wrestling champion (b. 1951) * August 3 ** Ernesto Brambilla, Grand Prix motorcycle road racer (b. 1934) ** John Hume, Northern Irish Nobel Peace laureate politician (b. 1937) * August 4 – Frances Allen, American computer scientist (b. 1932) * August 6 – Bernard Stiegler, French philosopher (b. 1952) * August 7 ** Lê Khả Phiêu, 10th General-Secretary of the Communist Party of Vietnam (b. 1931) ** Adin Steinsaltz, Israeli rabbi and philosopher (b. 1937) * August 8 – Pedro Casaldáliga, Spanish-Brazilian prelate and human rights activist (b. 1928) * August 9 ** Martin Birch, British music producer and engineer (b. 1948) ** Franca Valeri, Italian actress and playwright (b. 1920) * August 10 – Vladica Popović, Serbian footballer and manager (b. 1935) * August 11 – Trini Lopez, American singer and actor (b. 1937) * August 14 ** Julian Bream, English classical guitarist and lutenist (b. 1933) ** Ewa Demarczyk, Polish singer and poet (b. 1941) * August 17 – Mário de Araújo Cabral, Portuguese Formula One driver (b. 1934) * August 18 ** Ben Cross, English actor (b. 1947) ** Cesare Romiti, Italian manager and businessman (b. 1923)Cesare Romiti, who steered Fiat through strikes and domestic terrorism, dies at 97, The Washington Post * August 20 – Branko Kostić, acting President of the Presidency of Yugoslavia (b. 1939) * August 21 – Ken Robinson, English educationalist and author (b. 1950) * August 24 – Pascal Lissouba, 6th President and 2nd Prime Minister of the Republic of Congo (b. 1931) * August 28 – Chadwick Boseman, American actor and playwright (b. 1976) * August 31 ** Nina Bocharova, Soviet and Ukrainian Olympic gymnast (b. 1924) ** Pranab Mukherjee, 13th President of India (b. 1935) ===September=== * September 1 ** Vladislav Krapivin, Soviet and Russian children's literature writer (b. 1938) ** Erick Morillo, Colombian-American DJ and music producer (b. 1971) * September 2 ** David Graeber, American anthropologist and anarchist author (b. 1961) ** Kang Kek Iew, Cambodian prison commander and war criminal (b. 1942) * September 4 ** Annie Cordy, Belgian actress and singer (b. 1928) ** Joe Williams, 5th Prime Minister of the Cook Islands (b. 1934) * September 5 – Jiří Menzel, Czech film director, actor and screenwriter (b. 1938) * September 6 ** Vaughan Jones, New Zealand mathematician (b. 1952) ** Dragoljub Ojdanić, Serbian military officer and war criminal (b. 1941) * September 7 - Abdul Qadir Bajamal, 5th Prime Minister of Yemen (b. 1946) * September 8 ** Ronald Harwood, South African-born English screenwriter (b. 1934) ** Alfred Riedl, Austrian football player and manager (b. 1949) * September 9 – Shere Hite, American-born German feminist and sex educator (b. 1942) * September 10 – Diana Rigg, English actress (b. 1938) * September 11 - Toots Hibbert, Jamaican singer and songwriter (b. 1942) * September 15 ** Momčilo Krajišnik, Bosnian Serb political leader and war criminal (b. 1945) ** Moussa Traoré, 2nd President of Mali (b. 1936) * September 17 – Terry Goodkind, American novelist (b. 1948) * September 18 – Ruth Bader Ginsburg, American jurist, and gender equality pioneer (b. 1933) * September 19 – John Turner, 17th Prime Minister of Canada (b. 1929) * September 20 – Michael Chapman, American cinematographer and film director (b. 1935) * September 21 ** Arthur Ashkin, American Nobel physicist (b. 1922) ** Tommy DeVito, American musician and singer (b. 1928) ** Michael Lonsdale, French actor (b. 1931) * September 22 – Agne Simonsson, Swedish footballer and manager (b. 1935) * September 23 ** Juliette Gréco, French singer and actress (b. 1927) ** Gale Sayers, American gridiron football player (b. 1943) * September 24 ** Dean Jones, Australian cricketer (b. 1961) ** Corine Rottschäfer, Dutch model and beauty contestant (b. 1938) * September 25 ** S. P. Balasubrahmanyam, Indian playback singer (b. 1946) ** Goran Paskaljević, Serbian film director (b. 1947) * September 27 ** John D. Barrow, English cosmologist, theoretical physicist and mathematician (b. 1952) ** Yūko Takeuchi, Japanese actress (b. 1980) * September 29 ** Mac Davis, American singer-songwriter and actor (b. 1942) ** Helen Reddy, Australian singer and actress (b. 1941) ** Sabah Al-Ahmad Al-Jaber Al-Sabah, Emir of Kuwait (b. 1929) * September 30 ** Ali Bozer, Acting Prime Minister of Turkey (b. 1925) ** Quino, Argentine cartoonist (b. 1932) ===October=== * October 2 – Bob Gibson, American baseball player (b. 1935) * October 4 – Kenzō Takada, Japanese-born French fashion designer (b. 1939) * October 6 ** Johnny Nash, American singer-songwriter (b. 1940) ** Eddie Van Halen, Dutch-American musician and songwriter (b. 1955) * October 7 – Mario Molina, Mexican Nobel chemist (b. 1943) * October 8 ** Whitey Ford, American baseball player (b. 1928) ** Ali Khalif Galaydh, 8th Prime Minister of Somalia (b. 1941) ** Charles Moore, American athlete and Olympic champion (b. 1929) ** Mohammad- Reza Shajarian, Iranian classical singer (b. 1940) * October 12 - Litokwa Tomeing, 4th President of the Marshall Islands (b. 1939) * October 14 ** Rhonda Fleming, American actress (b. 1923) ** Kuniwo Nakamura, 6th President of Palau (b. 1943) * October 18 – René Felber, 81st President of the Swiss Confederation (b. 1933) * October 19 – Spencer Davis, Welsh musician (b. 1939) * October 20 ** Bruno Martini, French footballer (b. 1962) ** James Randi, Canadian-American magician and skeptic (b. 1928) ** Irina Skobtseva, Soviet and Russian actress (b. 1927) * October 21 – Marge Champion, American actress and dancer (b. 1919) * October 25 ** Izzat Ibrahim al-Douri, 6th Vice President of Iraq (b. 1942) ** Diane di Prima, American poet, playwright and activist (b. 1934) ** Lee Kun-hee, South Korean electronics executive (b. 1942) * October 28 – Anthony Soter Fernandez, Malaysian Roman Catholic cardinal (b. 1932) * October 29 – Angelika Amon, Austrian-American molecular and cell biologist (b. 1967) * October 30 ** Robert Fisk, English writer and journalist (b. 1946) ** Nobby Stiles, English footballer and manager (b. 1942) ** Mesut Yılmaz, 21st Prime Minister of Turkey (b. 1947) ** Amfilohije Radović, 50th Metropolitan of Montenegro and the Littoral (b. 1938) * October 31 ** Sean Connery, Scottish actor (b. 1930) ** MF Doom, British-American rapper (b. 1971) ===November=== * November 2 ** Ahmed Laraki, 6th Prime Minister of Morocco (b. 1931) ** Gigi Proietti, Italian actor and comedian (b. 1940)Morto Gigi Proietti, addio al grande mattatore della scena italiana, la Repubblica * November 4 – Ken Hensley, English singer and songwriter (b. 1945) * November 6 ** Jim Marurai, 8th Prime Minister of the Cook Islands (b. 1947) ** Fernando Solanas, Argentine film director and politician (b. 1936) * November 8 – Alex Trebek, Canadian-American game show host (b. 1940) * November 9 – Tom Heinsohn, American basketball player and coach (b. 1934) * November 10 ** Saeb Erekat, Palestinian diplomat (b. 1955) ** Amadou Toumani Touré, 3rd President of Mali (b. 1948) * November 11 ** Khalifa bin Salman Al Khalifa, 1st Prime Minister of Bahrain (b. 1935) ** Jorge Llopart, Spanish athlete (b. 1952) * November 12 ** Masatoshi Koshiba, Japanese Nobel physicist (b. 1926) ** Jerry Rawlings, President of Ghana (b. 1947) * November 13 – Peter Sutcliffe, English serial killer (b. 1946) * November 14 ** Armen Dzhigarkhanyan, Soviet, Armenian and Russian actor (b. 1935) ** Peter Florjančič, Slovene inventor and athlete (b. 1919) ** Hasan Muratović, 4th Prime Minister of Bosnia and Herzegovina (b. 1940) ** Des O'Connor, English television presenter, comedian and singer (b. 1932) * November 15 ** Soumitra Chatterjee, Indian actor (b. 1935) ** Ray Clemence, English football goalkeeper (b. 1948) ** Raúl Eduardo Vela Chiriboga, Ecuadorian cardinal (b. 1934) * November 16 ** Henryk Gulbinowicz, Polish cardinal (b. 1923) ** Walid Muallem, Syrian diplomat (b. 1941) ** Bruce Swedien, American audio engineer and record producer (b. 1934) * November 18 - Umar Ghalib, 7th Prime Minister of Somalia (b. 1930) * November 20 – Irinej, Serbian Patriarch (b. 1930) * November 22 ** Sidi Ould Cheikh Abdallahi, 7th President of Mauritania (b. 1938) ** Mustafa Nadarević, Bosnian-Croatian actor (b. 1943) * November 23 – Anele Ngcongca, South African footballer (b. 1987) * November 24 – Mamadou Tandja, 7th President of Niger (b. 1938) * November 25 ** Diego Maradona, Argentine football player and manager (b. 1960) ** James Wolfensohn, 9th President of the World Bank Group (b. 1933) * November 26 ** Sadiq al-Mahdi, 7th Prime Minister of Sudan (b. 1935) ** Tevita Momoedonu, 5th Prime Minister of Fiji (b. 1946) ** Daria Nicolodi, Italian actress and screenwriter (b. 1950) * November 27 – Mohsen Fakhrizadeh, Iranian nuclear physicist and academic (b. 1958) * November 28 – David Prowse, English bodybuilder and actor (b. 1935) * November 29 – Papa Bouba Diop, Senegalese footballer (b. 1978) ===December=== * December 1 ** Eduardo Lourenço, Portuguese philosopher and writer (b. 1923) ** Arnie Robinson, American athlete (b. 1948) * December 2 ** Valéry Giscard d'Estaing, 20th President of France (b. 1926) ** Zafarullah Khan Jamali, 15th Prime Minister of Pakistan (b. 1944) ** Rafer Johnson, American decathlete and actor (b. 1934) ** Pat Patterson, Canadian–American professional wrestler and producer (b. 1941) * December 5 – Viktor Ponedelnik, Soviet and Russian footballer and manager (b. 1937) * December 6 – Tabaré Vázquez, 39th and 41st President of Uruguay (b. 1940) * December 7 – Chuck Yeager, American Air Force officer and test pilot (b. 1923) * December 8 – Alejandro Sabella, Argentine football player and manager (b. 1954) * December 9 ** Vyacheslav Kebich, 1st Prime Minister of Belarus (b. 1936) ** Paolo Rossi, Italian footballer (b. 1956) * December 10 ** Tommy Lister Jr., American actor and professional wrestler (b. 1958) ** Barbara Windsor, English actress (b. 1937) * December 11 ** Kim Ki-duk, South Korean director and screenwriter (b. 1960) ** James Flynn, New Zealand intelligence researcher (b. 1934) * December 12 ** John le Carré, English author (b. 1931) ** Charley Pride, American singer, musician, and guitarist (b. 1934) ** Fikre Selassie Wogderess, 9th Prime Minister of Ethiopia (b. 1945) ** Jack Steinberger, German-born American Nobel physicist (b. 1921) * December 13 – Ambrose Mandvulo Dlamini, 10th Prime Minister of Eswatini (b. 1968) * December 14 – Gérard Houllier, French footballer and manager (b. 1947) * December 15 – Saufatu Sopoanga, 8th Prime Minister of Tuvalu (b. 1952) * December 16 – Flavio Cotti, 80th President of the Swiss Confederation (b. 1939) * December 17 – Pierre Buyoya, 3rd President of Burundi (b. 1949)Burundi ex-president Pierre Buyoya dies from Covid-19 * December 18 ** Michael Jeffery, 24th Governor-General of Australia (b. 1937) ** Òscar Ribas Reig, 1st Prime Minister of Andorra (b. 1936) * December 19 – Mekere Morauta, 7th Prime Minister of Papua New Guinea (b. 1946) * December 20 – Doug Anthony, 2nd Deputy Prime Minister of Australia (b. 1929) * December 22 – Muhammad Mustafa Mero, 62nd Prime Minister of Syria (b. 1941) * December 23 Kay Purcell, English actress (b. 1963) * December 24 ** John Cremona, Acting President of Malta (b. 1918) ** Ivry Gitlis, Israeli violinist (b. 1922) * December 25 – K. C. Jones, American basketball player and coach (b. 1932) * December 26 ** George Blake, British spy and double agent (b. 1922) ** Brodie Lee, American professional wrestler and actor (b. 1979) * December 28 – Armando Manzanero, Mexican singer-songwriter (b. 1935) * December 29 – Pierre Cardin, Italian- born French fashion designer (b. 1922) * December 30 – Eugene Wright, American jazz bassist (b. 1923) * December 31 – Tommy Docherty, Scottish footballer and manager (b. 1928) == Nobel Prizes == * Chemistry – Emmanuelle Charpentier and Jennifer Doudna * Economics – Paul Milgrom and Robert B. Wilson * Literature – Louise Glück * Peace – World Food Programme * Physics – Roger Penrose, Reinhard Genzel and Andrea M. Ghez * Physiology or Medicine – Harvey J. Alter, Michael Houghton and Charles M. Rice == References ==",
 "title": "2020"
}