{
 "id": "178183",
 "text": "Wahhabi () or Wahhabism is a conservative form of Sunni Islam practised in Saudi Arabia and Qatar. It derives its origins in Salafism which aims to imitate the Salaf (three best generations of Muslims) as much as possible. The name 'Wahhabi' or 'Wahhabism' comes from Muhammad ibn Abd-al-Wahhab, an 18th century scholar, who popularised a form of Islam that calls for the return to the Qur'an and Hadith as the basis of an Islamic way of life. In the 18th century, Muhammad ibn Abd al-Wahhab made an alliance with Muhammad bin Saud, a local ruler. Their partnership helped spread Wahhabism across Arabia and later led to the creation of the Kingdom of Saudi Arabia in 1932. Wahhabism became the official form of Islam in the country. Today, Wahhabism is still practiced, but its influence is slowly decreasing as Saudi Arabia makes changes to modernize the country. Some definitions or uses of the term Wahhabi Islam include: * \"a corpus of doctrines, but also a set of attitudes and behaviour\". Gilles Kepel. * \"pure Islam that does not deviate from Sharia law in any way and should be called Islam and not Wahhabism\". Prince Salman bin Abdul Aziz, the governor of the Saudi capital Riyadh. == Name and Definition == Wahhabism is a religious movement in Islam. It is named after its founder, Muhammad ibn Abd al-Wahhab (1703-1792), an 18th-century scholar from the Najd, today’s Saudi Arabia. The followers of Wahhabism do not call themselves “Wahhabi” but prefer to be called Al-Muwahhidun (“The Unitarians”). This shows their focus on the oneness of God (known as tawhid). Wahhabism is defined as an 18th-century Arabian reform movement. It aimed to purify Islam by returning to its original teachings- the Qur’an and the Sunnah. It is generally considered to be a strict movement within Sunni Islam, which is centered on the concept of tawhid (absolute oneness of God). Wahhabis believe that many Islamic practices, such as visiting shrines or praying at tombs, are wrong. They say it is shirk (associating partners with God). == Beliefs == Wahhabis believe that the Qur'an and sayings of the Prophet Muhammad must be followed to the fullest extent. They also forbid the building of shrines and other similar structures. This is due to shrines being seen as a way that forms of polytheism are performed. Wahhabis discourage taqlid if it is done out of a person's desires to do something. == History == === Early Years === Muhammad ibn Abd al-Wahhab was born in the region of Najd, central Arabia in 1703. He studied Islam in multiple cities and believed that the religious practices were not part of true Islam. These practices included tombs and shrines, which according to al-Wahhab violated the core principles of Islam. For this reasons, he wanted to bring people back to original Islam, focusing only on worshipping god and following the Qur’an teachings of Prophet Muhammad. === Alliance with Ibn Saud === In 1744, Muhammad ibn Abd al-Wahhab created important an agreement with Muhammad bin Saud, the local ruler of small town Dir‘iyyah. They agreed to work together and formed a pact, under which Ibn Saud would militarily and politically support Wahhabism. In return, Ibn Abd al-Wahhab and his followers would legitimize and religiously support the rule of Ibn Saud. Together, they began to take control of parts of Arabia and spread Wahhabism, while destroying shrines, tombs, and other places that were un-Islamic. === First Saudi State (1744-1818) === This alliance led to the creation of the First Saudi State, centered in Diriyah (1744-1818). It was also called the Emirate of Diriyah. Many Muslims, especially those who followed Sufi traditions, did not agree with Wahhabism and saw it as too strict and harsh. The Ottoman Empire, which ruled most of the Muslim world during the 18th and 19th centuries, saw the rise of the Wahhabi movement as a threat to its religious and political authority. The Wahhabis expanded their influence across the Arabian Peninsula. They captured the holy cities of Mecca and Medina, which alarmed the Ottoman leadership. In response, they instructed commander Muhammad Ali Pasha in Egypt to take military action. In 1811, Muhammad Ali sent his son Ibrahim Pasha to crush the Wahhabi movement. Egyptian forces destroyed Diriyah in 1818, ending the First Saudi State. === Second Saudi State (1824-1891) === A few years after the fall of the First Saudi State, the Saud family returned to power and established the Second Saudi State (1824-1891). It was also known as Emirate of Nejd with capital centered in city of Riyadh. The Second Saudi State was smaller and weaker than the First Saudi State, but it still followed Wahhabi beliefs. The religious scholars from Ibn Abd al-Wahhab’s family, known as Al ash-Sheikh, played a key role in leading Wahhabism. However, the Second Saudi State faced many challenges. After internal conflicts and wars with rival tribes such as Rashids, the Second Saudi State collapsed in 1891. === Kingdom of Saudi Arabia (1932-present) === In the early 1900s, Abdulaziz Ibn Saud, a descendant of earlier Saudi rulers, started to reclaim territories and restore his family’s rule. In 1902, he successfully took over Riyadh. By 1932, Abdulaziz had unified most of the central and western parts of Arabia and created the Kingdom of Saudi Arabia. Wahhabism became the official way of practicing Islam in the country. Religious leaders from the family of Ibn Abd al-Wahhab were given power in courts and schools. They helped guide the country’s laws and education based on Wahhabi teachings. === Wahhabism in the 20th Century === In the 20th century, especially after oil was discovered in Saudi Arabia, the country became very wealthy. During the oil boom in the 1970s, the Saudi government used its money to spread Wahhabism to other parts of the world. They built mosques, schools, and printed religious books. Wahhabism spread to many countries, especially in Africa, Asia, and the Middle East. == Wahhabism Today == Wahhabism is still practiced today, mainly in Saudi Arabia and Qatar. However, in recent years, the Saudi government has reduced the power of Wahhabi religious leaders. They are trying to make the country more modern by changing schools, allowing women to drive, and opening up to tourism and entertainment. Saudi Arabia is also giving less financial support for religious projects and is focusing on its economy and national identity. == Related pages == * Salafi == Other websites == * Wahhabism -Citizendium == References == Category:Sunni Islam",
 "title": "Wahhabi"
}