{
 "id": "178187",
 "text": "A bell tower (also belfry or campanile) is a tower which contains one or more bells, or which is designed to hold bells, even if it has none. They are usually built at a height that allows the sound to be heard at some distance.Russell Sturgis; Francis A. Davis, Sturgis' Illustrated Dictionary of Architecture and Building: An Unabridged Reprint of the 1901-2 Edition, Vol. I, (Newburyport: Dover Publications, 2013), p. 287 There are different ways to make the bells in a bell tower ring. In many cases, the bell is rung by pulling on a rope that is joined to the bell, making it swing on a hinge and the clapper hit the bell. Another way is to use a keyboard called a carillon. Sometimes, the bells are controlled by a clock mechanism or a computer. This lets them ring at certain times without the need for a human to do it. == History == There are no examples of bell towers in antiquity. The first to use a bell tower in a church was Paulinus of Nola, about the start of the 5th century.James Cargill Guthrie, The Vale of Strathmore: Its Scenes and Legends (Edinburgh: W. Paterson, 1875), p. 465 Bell towers in Italy have almost always been plain vertical towers not attached to a building (). From the beginning, bell towers in northern Europe have been attached to churches. They were known of in England at least by the time of Bede. When Hilda, Abbess of Whitby died (680 AD), a nun reported hearing the sound of a bell. Bell towers are repeatedly mentioned during the 8th century. One was the campanile of St. Peter's Basilica at Rome. === Bernini's bell towers === Gian Lorenzo Bernini was Pope Urban XIII's choice to design and build twin bell towers on the front of St. Peter's.Sarah McPhee. Bernini and the Bell Towers: Architecture and Politics at the Vatican (New Haven: Yale University Press, 2002), pp. 1–2 His first tower shifted and large cracks appeared. Work on the second tower stopped. Bernini was blamed and called incompetent. When Pope Urban died in 1644 it was not decided what to do about the tower disaster. It was a major setback for Bernini's career and for the future of church bell towers. It was later discovered the ground under the towers was not stable. The towers were torn down. Bernini went on to have an otherwise brilliant career. == References == Category:Bells Category:Towers",
 "title": "Bell tower"
}