{
 "id": "178201",
 "text": "The 7 July 2005 London bombings (also called 7/7) were suicide bomb attacks on public transport in London. British Muslim extremists did the attacks during the morning rush hour. At 08:49, three bombs exploded within fifty seconds of each other on three London Underground trains. A fourth exploded an hour later at 09:47 on a bus in Tavistock Square. The bombs were homemade. They were carried in rucksacks and set off by the bombers. There were many memorials and services in the United Kingdom and elsewhere. The memorials remembered those who died in the attacks, including a memorial in Hyde Park. There were 56 people who died from the attacks, and over 700 people were hurt in the attack. == Attacks == ===London Underground=== Starting at 8:49am, on 7 July 2005, three bombs were set off on London Underground trains within 50 seconds of each other: # The first bomb exploded on a train that was travelling below the ground, going towards the east between Liverpool Street and Aldgate. The train had left King's Cross St Pancras about eight minutes before. When the explosion happened, the train's third carriage was about 100yards (90m) along the tunnel from Liverpool Street. The parallel track of the Hammersmith & City line between Liverpool Street and Aldgate East was also damaged in the blast. # The second bomb exploded on another train. It had just left platform 4 on Edgware Road and was travelling west towards Paddington. The train had left King's Cross St Pancras about eight minutes before. There were some other trains nearby at the time of the explosion. Another train was going by at the time of the explosion and was damaged slightly by the blast. Two other trains were at Edgware Road and were damaged by the explosion. # A third bomb went off on a Underground train going south from King's Cross St Pancras to Russell Square. The bomb exploded about a minute after the train had left King's Cross, by which time it had gone about 500yards (450m) from the station. The explosion happened behind the first carriage of the train, causing a lot of damage to the back of the carriage as well as the front of the second one. The surrounding tunnel was also damaged. A code amber alert was declared at 9:19am. London Underground began to stop the network's operations, ordering trains to continue only to the next station and stopping all services. The effects of the explosions varied according to the differing designs of the tunnels in which each happened: * The Circle line is a \"cut and cover\" below ground tunnel, about 7m (21ft) deep. The tunnel has two parallel tracks, which apparently reduced the destructive effect of the explosion. * The Piccadilly line is a deep-level tunnel, up to 30m (100ft) below the surface and with narrow (3.56m, or 11ftin) single-track tubes and just 15cm (6in) clearances. This confined space reflected the blast force, making the damage worse. ===Tavistock Square bus=== A fourth bomb exploded almost an hour after the attacks on the London Underground. It exploded on the deck of a number 30 double-decker bus. The bus was a Dennis Trident 2 from Stagecoach London. It was following the route from Marble Arch to Hackney Wick. At its final destination, the bus turned around and started the return route to Hackney Wick. The bus left Marble Arch at 9:00am and arrived at Euston bus station, the destination, at 9:35am, where crowds of people had been evacuated from the tube and went on buses as a different way of transport. The explosion at 9:47am in Tavistock Square caused the roof to come off and destroyed the back part of the bus. The explosion took place near BMA House, the headquarters of the British Medical Association, on Upper Woburn Place. A number of doctors and medical staff in or near that building were able to provide immediate emergency help. People who saw the explosion reported seeing \"papers and half a bus flying through the air\". BBC Radio 5 Live and The Sun later reported that two injured bus passengers said that they saw a man exploding the bomb in the bus. The position of the bomb inside the bus meant the front of the bus remained mostly undamaged from the explosion. Most of the passengers at the front of the top deck remained in the same condition as before, as did those near the front of the lower deck, including the driver. However, those at the back of the bus had more serious injuries, with a few people being blown away from the bus. The level of the damage caused to the victims' bodies resulted in a longer delay in announcing the death amount from the bombing while the police looked at how many bodies were there and whether the bomber was one of them. A few people nearby the bus were also hurt by the explosion and the surrounding buildings were damaged by debris. The bombed bus was then covered with tarpaulin and removed so that they could look at the forensics at a secure Ministry of Defence site. The vehicle was later returned to Stagecoach and scrapped on 15 October 2009. A replacement bus, a new Alexander Dennis Enviro400, was named Spirit of London. ===Victims=== 784 people were injured and 52 people were killed by the bombers, not including the deaths of the bombers. The people who died were of many different backgrounds. Some of them were from places outside the United Kingdom. All those who died were UK residents, including exchange students. Because of train delays before the attacks and transport problems after attacks caused by them, a few people died aboard trains and buses they would not normally have taken. The people who died differed in age: the youngest was 20 and the oldest was 60 years old. The average age was 34. Seven of the people were killed at Aldgate, six at Edgware Road, 26 at King's Cross and 13 at Tavistock Square. 784 people were injured by the attacks. Martine Wright, who lost her legs in the attack, would later play in the 2012 Summer Paralympics. Police officers and other emergency services workers helped those who were injured. == Attackers == The four suicide bombers were: * Mohammad Sidique Khan: aged 30. Khan exploded his bomb just after leaving Edgware Road tube station on a train travelling toward Paddington, at 8:50am. Khan lived in Beeston, Leeds, with his wife and young child. He worked as a learning assistant at a primary school there. The blast killed seven people, including Khan himself. * Shehzad Tanweer: aged 22. He exploded a bomb aboard a train going between Liverpool Street station and Aldgate tube station, at 8:50am. He lived in Leeds with his mother and father, working in a fish and chip shop. Eight people, including Tanweer, were killed by the explosion. * Germaine Lindsay: aged 19. He exploded his bomb on a train travelling between King's Cross and Russell Square tube stations, at 8:50am. He lived in Aylesbury, Buckinghamshire, with his pregnant wife and young son. The blast killed 27 people, including Lindsay himself. * Hasib Hussain: the youngest of the four at 18, Hussain exploded his bomb on the top deck of a double-decker bus at 9:47am. He lived in Leeds with his brother and sister-in- law. Fourteen people, including Hussain, died in the explosion in Tavistock Square. All four of them were associated with Al Qaeda. Three of the bombers were born in the United Kingdom, sons of Pakistani immigrants; Lindsay was a convert born in Jamaica. Charles Clarke, Home Secretary when the attacks happened, described the bombers as \"cleanskins\" before their role in the attacks. This was a new word: it meant \"unknown to the government\". On the day of the attacks, all four had went to Luton, Bedfordshire, by automobile. The group then went to London by train. They were recorded on CCTV arriving at King's Cross station at about 8:30am. ===Recorded reasonings=== Two of the bombers made recordings describing their reasons for becoming what they called \"soldiers\". In a taped broadcast by Al Jazeera on 1 September 2005, Mohammad Sidique Khan, described his motivation. The tape had been edited and mentioned al-Qaeda members Osama Bin Laden, Ayman al-Zawahiri and Abu Musab al-Zarqawi, calling them \"today's heroes\". Khan's tape said: The tape continued: On 6 July 2006, a recorded statement by Shehzad Tanweer was broadcasted by Al-Jazeera. The video was thought to include statements and thoughts by al-Zawahiri. In the video, Tanweer said: Tanweer thought that the people who weren't Muslims in Britain deserved to be attacked because they voted for a government which \"continues to oppress our mothers, children, brothers and sisters in Palestine, Afghanistan, Iraq and Chechnya\".; a transcript of the tape is ==Effects and response == ===Early reports=== Early reports suggested that a power surge on the Underground power grid had caused explosions in power circuits, but this was later found out to not be true. Some people suggested that the explanation had been made because of bomb damage to power lines along the tracks. The damage to the power lines caused power surges. A couple of hours after the bombings, Home Secretary Charles Clarke confirmed the incidents were terrorist attacks. ===Safety alerts=== Although there were safety and police alerts at many areas across the United Kingdom, no terrorist attacks took place outside central London. Suspicious packages were found and removed in areas around the United Kingdom. The Times reported on 17 July 2005 that police sniper units were following many people thought to be part of al- Qaeda in Britain. The teams with guns were told to shoot to kill if there was proof that suggested that a person thought to be a terrorist had a bomb on them and didn't want to surrender when asked by police. A person part of the Metropolitan Police's Specialist Firearms Command said that they had been used more often to look at people who might be terrorists. ===Transport and communications problems=== Vodafone reported that its telephone network reached the most it could at about 10am on the day of the bombings, and it was forced to start emergency plans to put emergency calls first. Other phone providers also said they had problems. The BBC thought that the telephone system may have been shut down by security services to prevent the possibility of mobile phones being used to trigger bombs. However, it was actually due to a higher amount of texts and calls being made by people. ACCOLC was working only in a area around Aldgate Tube Station because key emergency workers did not have mobile phones with ACCOLC. The problems with communication when the emergency was happening caused discussion about how to make London's emergency communications system better. Some people said there needed to be better ways to speak between emergency services. For most of the day, central London's public transport system was largely out of service following the complete closure of the Underground and the Zone 1 bus network. The day after the attacks, most London Underground lines would open again. Most of the Zone 1 bus network would open again too. In August 2005, it was reported that when public transport opened again it lost 30% of passengers that were travelling before, with more people walking to where they want to go instead of using public transport. Most of the Underground, apart from the stations that were damaged by the bombs, opened again the next morning. On 2 August, the Hammersmith & City line was reopened. The Piccadilly line started serving customers again on 4 August. On 4 August, the Circle line was reopened again. Before this, Circle line stations continued to have passengers as they were on other lines. ===Mayor of London=== Ken Livingstone, the Mayor of London, was in Singapore when he heard about the bombings, after London won their bid to hold the 2012 Summer Olympics. Due to how big the attacks were, he gave a quickly made speech. In his speech, he said the attack was bad and \"cowardly\". ===In the media=== The first reports about the explosions were at 9:16am by Sky News, about half an hour after the first explosion. Sky News would also report the final explosion on the bus a few minutes after it happened. The reporter said that he thought a bomb had exploded on the bus. BBC News received 1billion total attempts to access the website during the course of the day (including all images, text and HTML). At top times during the day there were 40,000-page requests per second for the BBC News website. The BBC also received complaints from unhappy people about images they showed when covering the attacks, and the BBC would say sorry for it. On 12 July, the British National Party made leaflets showing images of the 'No. 30 bus' after it was destroyed in the attacks. The slogan, \"Maybe now it's time to start listening to the BNP\" was written down next to the image. Home Secretary Charles Clarke described it as an attempt by the BNP to use the attacks to improve how well they did in politics. Some news outside the UK complained that many British governments had treated radical Islamist armed groups too well, as long as they weren't involved in attacking the UK. Most United Kingdom newspapers and many worldwide newspapers would have stories and photos of the attacks on their front page. The Independent used statements from people who saw the attack happened or were on the transport when it happened. Some people thought that the attacks caused a 'tipping point' in journalism. The Guardian said that the attacks helped start citizen journalism, and received images from citizens about the attacks. BBC News said that they received 22,000 texts and e-mails from people about the attacks and over 300 images, and said that these played a very important part in how they reported the attacks. ===Effect on the economy=== There were only a few reactions to the attack in the world economy as measured by financial market and exchange rate action. The value of the British pound to the U.S. dollar went down. The FTSE 100 Index fell by about 200 points during the two hours after the first attack, being the largest decrease since the invasion of Iraq. After the market closed, it had recovered to only 71.3 points (1.36%) down on the previous day's high. US market values went up a bit, partly because how much the dollar went up compared to the pound and the euro. The Dow Jones Industrial Average went up from 31.61 to 10,302.29. The S&P; 500 went up 2.93 points to 1,197.87 after going down as much as 1%. On 9 July, the Bank of England, HM Treasury and the Financial Services Authority revealed that they had made plans to help stop the economy becoming extremely damaged. They did this immediately after the attacks to make sure that the UK financial markets could continue trading. ===Claims of people helping the bombers=== Even before the who the bombers were became known, former Metropolitan Police commissioner Lord Stevens said he believed that the bombers were most likely born or based in Britain, and would likely not fit the usual description of a suicide bomber. Some newspapers in Iran blamed the bombing on British or American governments looking to have reason to continue the War on Terror, and claimed that the plan that included the bombings also involved more harassment of Muslims in Europe. On 13 August, using what the police and MI5 sources, The Independent reported that the bombers did the attacks without help from al- Qaeda from somewhere outside the UK. On 1 September, it was reported that al- Qaeda officially claimed that they did the attacks in a recording shown by Al Jazeera. However, an official investigation by the British government reported that the tape claiming that al-Qaeda did it had been edited after the attacks. The British government also said that the bombers did not have direct help from al-Qaeda. Zabi uk-Taifi, an al-Qaeda laeder arrested in Pakistan in January 2009, may have been involved in planning the bombings, according to the Pakistani government. Documents found by the German government on a person thought to be a terrorist arrested in Berlin in May 2011 have suggested that Rashid Rauf, a British al Qaeda member, played a very important role in planning the attacks. A second claim of being behind the attack was posted on the internet by another al-Qaeda related group, Abu Hafs al-Masri Brigades. This claim was questioned, as the group had previously falsely claimed that they were behind events that were the result of technical problems. They had previously claimed they were behind the 2003 London blackout and the US Northeast blackout of 2003. ===Conspiracy theories=== A poll of 500 British Muslims by Channel 4 News in 2007 found that 24% of them believed the four bombers that were behind the attacks did not actually carry them out. There have been many different conspiracy theories proposed about the bombings, including the suggestion that the bombers were 'patsies', based on claims when the bombings of the trains happened, supposed explosions below the trains, and allegations of the faking of the one time labelled and dated photograph of the bombers at Luton station. Claims made by one theorist in the Internet video 7/7 Ripple Effect were looked at by the BBC documentary series The Conspiracy Files, in an episode named \"7/7\" first shown on 30 June 2009, which debunked many of the video's claims as false. On the day of the bombings, Peter Power of Visor Consultants gave interviews on BBC Radio 5 Live and ITV saying that he was working on an attack management simulation drill, in the City of London. It was based on a situation in which multiple bombs were exploded at the same time, when he heard that an attack was going on in real life. He described this as a coincidence. After a few days he said it was a \"spooky coincidence\" on Canadian TV. Alexander Litvinenko, a former officer of Russia's Federal Security Service, was asked who he thought the people who carried out the attacks were, in an interview. Litvinenko stated, \"You know, I have spoken about it earlier and I shall say now, that I know only one organization, which has made terrorism the main tool of solving of political problems. It is the Russian special services.\" Some of the conspiracy theories, such as those saying that there was a 5th bomber, were debunked after an official independent investigation. == Investigation == === Early results === Numbers of deaths Numbers of deaths Aldgate 8 Edgware Road 7 King's Cross 27 Tavistock Square 14 Total deaths 56 Early on, there was a lot of confusion about what happened in the attacks. Police thought early on that military level plastic explosives were used. As the explosions were thought to happen at the same time, bombs with timed fuses might have been used. What the police thought changed as more information became available. Home-made organic peroxide-based explosives were used, according to a May 2006 report from the British government's Intelligence and Security Committee. The explosive was triacetone triperoxide. Fifty-six people, including the four suicide bombers, were killed by the attacks. About 700 people were injured, and about 100 stayed in hospital after treatment. The incident was one the most deadly terror attacks in the United Kingdom. Police looked at about 2,500 items of CCTV footage and forensic evidence from where the attacks took place. In the London Underground bombings, police said they believed the bombs were probably placed on the floors of the trains. The bombings were the first ever suicide attack in the British Isles. Vincent Cannistraro, former head of the Central Intelligence Agency's anti-terrorism centre, said to The Guardian \"two unexploded bombs were found as well as a device of a timer\". This claim was mainly rejected by London's Metropolitan Police Service. ===Police raids=== West Yorkshire Police raided six buildings in the areas near and in Leeds on 12 July: two houses in Beeston, two in Thornhill, one in Holbeck and one in Alexandra Grove in Hyde Park, Leeds. One man was arrested. Officers also raided a house on Northern Road in the Buckinghamshire town of Aylesbury on 13 July. The police said a large amount of stuff that could be used as bombs was found in the Leeds raids and a controlled explosion was carried out at one of the houses. Explosives were also found in the vehicle associated with one of the bombers, Shehzad Tanweer, at Luton railway station. They were exploded in a controlled explosion by the police. ===March 2007 arrests=== On 22 March 2007, three men were arrested as they were believed to have been involved with the bombings. Two of the men were arrested at 1pm at Manchester Airport, trying to go on a flight to Pakistan. They were arrested by officers who work against terrorism and had been following the men as part of an investigation. A third man was arrested in the Beeston area of Leeds at a home on the street where one of the suicide bombers had lived before the attacks. The three arrested were thought to be friends of the bombers, living in the same area as them and going to the same mosque. They were put in court twice because of what they were thought to have done. This was because the jury in the first trial did not agree whether they were guilty or not. In the second trial, they were found to not have helped the bombers attack London, but the two arrested at the airport were later went to prison for 7 years for being taught in terrorism by al-Qaeda. ===May 2007 arrests=== On 9 May 2007, police made four more arrests, three in Yorkshire and one in Selly Oak, Birmingham. The widow of Mohammed Sidique Khan, the person thought to be leader of the bombers, was one of those arrested for helping the terrorists. Three of those arrested, including Khan's widow, were released on 15 May. The fourth person who was arrested, Khalid Khaliq, an unemployed father of three children, was charged on 17 July 2007 with having an al-Qaeda training book, but the charge was not related to the 2005 London attacks. These charges usually carry a maximum prison sentence of 10 years. ===Reports of warnings=== No warnings were given before 7 July bombings. The following are sometimes quoted as warnings either of the events to come or of some knowledge of future events. * One of the London bombers, Mohammad Sidique Khan, was looked at and investigated for a short time by the MI5 who believed that he was not a likely threat and he was not put under surveillance. * Some news stories a few hours after the attacks questioned the British government's statement that there had been no warning. It was reported by CBS News that a top Israeli government member said that British police told the Embassy of Israel in London minutes before the explosions that they had received warnings of possible terror attacks in London. An AP report used by a number of news sites, including The Guardian, said the early report of a warning was by an Israeli \"Foreign Ministry official, speaking on condition of anonymity\". It said about Foreign Minister Silvan Shalom's later denial on Israel Defense Forces Radio: \"There was no early information about terrorist attacks\". A similar report on the website of right-wing Israeli paper Israel National News/Arutz Sheva said the story came from \"Army Radio quoting unconfirmed reliable sources\". * In an interview with the Portuguese newspaper Público a month after the 2004 Madrid train bombings, Syrian military leader Omar Bakri Muhammad warned that \"a very well-organised\" London-based group which he called \"al-Qaeda Europe\" was about to launch a big attack. In December 2004, Bakri said that, if Western governments did not change their policies, Muslims would give them \"a 9/11, day after day after day.\" By this, he meant that there would be big terrorist attacks day after day. * According to a 17 November 2004 post on the Newsweek website, the US government in 2004 had proof that terrorists were planning a possible attack in London. The article also stated that that fears of terrorist attacks caused FBI agents based in the U.S. embassy in London to try to stop travelling using public transport. ===Anwar al-Awlaki=== The Daily Telegraph said that extreme imam Anwar al-Awlaki had inspired the bombers. The bombers also listened and wrote down what they heard al-Awlaki saying in lectures. His teachings were found in the ownership of people who were accused of helping the suicide bombers. Al-Awlaki was killed by a U.S. attack using drones in 2011. ===Independent investigation=== In 2006, the government said they wouldn't hold a public investigation, saying that it would be silly. Prime Minister Tony Blair said an independent investigation would lower support for MI5. The leader of the opposition, David Cameron, said only a full investigation would \"get to the truth\". In reaction to discoveries about how big the security and police investigations into the bombers before the attack, the Shadow Home Secretary, David Davis, said: \"It is becoming more and more clear that the story presented to the public and Parliament is at odds with the facts.\" After David Cameron became Prime Minister in 2010, an independent coroner's investigation of the bombings started. Lady Justice Hallett was appointed to hear the investigation, which would consider how each victim died and if the MI5, if it had worked better, could have prevented the attack, and also improved the emergency service response. After seven months of looking at and talking about proof, the investigation was released and read in the Houses of Parliament on 9 May 2011. It decided that the 52 people who the bombers killed had been illegally killed. It also said their deaths could not have been prevented, and they would probably have died no matter how much the emergency services tried to save them. Hallett said the that MI5 had not made every possible improvement since the attacks but that it was not \"right or fair\" to say more attention should have been paid to leader of the bombers Mohammad Sidique Khan before 7 July. She also decided that there should be no public investigation. ===Alleged newspaper phone hacking=== It was reported in July 2011 that families of some of the victims of the bombings may have had their telephones accessed by the News of the World after the attacks. The discoveries added to the then ongoing controversy over phone hacking. The dads of two of the people killed in the bombings, one in the Edgware Road explosion and another at Russell Square, told the BBC that police officers looking into the alleged hacking had warned them that their contact details were found on a target list. A person who used to be a firefighter who helped hurt passengers get away from Edgware Road also was told by police who were looking into the hacking allegations. It later turned out he had been hacked multiple times by News of the World. A few of survivors from the bombed trains also told the media that police had warned them their phones may have been accessed and their messages seen by hackers. In some cases police officers suggested that they should change security codes and PINs. Two of the survivors of the attacks as well as the mum of one of the people who died sued News of the World for hacking their phones. ==Memorials== Since the bombings, the United Kingdom and other nations have remembered the victims in many different ways. Most of these memorials have included moments of silence, religious remembrance services and the laying of flowers at the attack sites. Foreign leaders have also remembered the dead by asking for their flags to be flown at half-staff. They also signed books showing that they were also sad about the attacks at embassies of the UK, and gave statements of support to the British people. ===United Kingdom=== It was asked that the Union Flag be put at half- staff by the government. A permanent memorial was opened on 7 July 2009 by Prince Charles to remember the fourth anniversary of the bombings. On the ninth anniversary of the bombings, graffiti was found on the memorial. It would be removed soon after being found. During the opening ceremony of the 2012 Summer Olympics, there was a memorial to the people who were killed by the bombings. A remembrance religious service was held in St. Paul's Cathedral on 7 July 2015. This was shown on BBC One. ===International=== US President George W. Bush went to the British embassy the day after the bombings, after he came back from the G8 summit in Scotland. He signed a book saying that he was sad about the attacks. In Washington, D.C., the US Army band played \"God Save the Queen\". This was an idea that US Army veteran John Miska suggested to Vice Chief of Staff General Cody, outside the British embassy in the city. A similar memorial had been made by the Queen in the days after the September 11 attacks in 2001 where the Star Spangled Banner was played at Buckingham Palace's Changing the Guard. On 12 July, a Detroit Symphony Orchestra band group played the British national anthem during the before game celebrations of the Major League Baseball All-Star Game at Comerica Park in Detroit. It was ordered that flags fly at half-staff across New Zealand and Canada. Moments of silence took place in the European Parliament, the Polish parliament and by the Irish parliament on 14 July. The British national anthem was played at Plaza de Oriente in Madrid to remember the people who died from the attacks. The British ambassador to Spain and people in the Spanish Royal Family went there. ==Planned anniversary attack== Mohammed Rehman and Sana Ahmed Khan were sent to life in prison on 29 December 2015 for preparing an act of terrorism. The plan was for it to be on the tenth anniversary of the 7 July 2005 London attacks. They had 10kg of urea nitrate to make bombs. Rehman called himself the 'silent bomber' and asked his Twitter followers to choose between the Westfield shopping centre or the London Underground as the place where the planned suicide bombing would take place. He was found by the police because of his posts on Twitter. Rehman was found and arrested a few days before the planned attacks. == References == Category:2005 crimes Category:2005 in England Category:2000s building bombings Category:2000s disasters in the United Kingdom 7 July 2005 bombings Category:2000s murders in Europe 7 July 2005 bombings Category:Attacks on buses Category:Attacks on railway systems Category:Attacks on transport in the United Kingdom Category:Building bombings in England 7 July 2005 bombings Category:Islamic terrorist incidents in the 2000s Category:Islamic terrorist incidents in the United Kingdom Category:July 2005 events 7 July 2005 bombings Category:Mass murder in the 2000s Category:Massacres in the United Kingdom Category:Murder-suicides in Europe Category:Suicide bombings in Europe Category:Suicide in the 2000s 7 July 2005 bombings",
 "title": "7 July 2005 London bombings"
}