{
 "id": "178206",
 "text": "Al-Masjid al-Ḥarām (, ), is the largest mosque in the world. It is in the city of Mecca, Saudi Arabia. It is considered the holiest place on Earth by Muslims. It surrounds the Kaaba (a building which Muslims face while offering daily prayers). Besides the Kaaba, the mosque also contains other important sites, such as the Black Stone (which is a part of the Kaaba), the Zamzam Well, Maqam Ibrahim (footprint of Abraham) and the hills of Safa and Marwa. The mosque is also known as the Grand Mosque or the Great Mosque of Mecca. Masjid al-Haram is also the most expensive building on earth. The mosque has been controlled by a lot of rulers. They all made contributions to the mosque in the form of expansions, renovations and decorations. Today, the mosque is under the rule of the King of Saudi Arabia. The latest major expansion was during King Fahd's reign. Further expansion was planned by the former ruler, King Abdullah. This mosque has nine minarets and three large domes. Like Masjid al-Nabawi in Medina, it also has undergone many renovations and expansions. == History == === Before Abraham === Muslims believe that the first Kaaba was built by angels. It was made out of red ruby. After that, Allah (God in Islam) ordered Adam to rebuild the Kaaba. The Kaaba of Adam was later destroyed in the Great Flood during Noah's era. === Time of Abraham and Ishmael === According to Muslims, Abraham was ordered by Allah to construct the Kaaba at the place where Adam had previously built it. He, along with his son Ishmael, rebuilt the Kaaba. As they laid the bricks, Abraham realized that the walls of the Kaaba were too high for him to reach. So, he took a large rock and stood over it. As the wall gets higher, the rock also miraculously grows bigger to allow Abraham to reach the top of the walls. The rock, with the footprint of Abraham, is the \"Maqam Ibrahim\". After they have finished building, Allah sent down a white-colored stone from the Paradise down to Earth. The stone was placed on the corner of the Kaaba. This white stone became black because of the sins of the people that touched it.Saying of the Prophet, Collection of Tirmizi, VII, 49 This stone is known as the \"Hajar al- Aswad\", which means \"Black Stone\". Following that, Abraham received a revelation that ordered him to call everyone to perform pilgrimage to the Kaaba. === Time of Quraysh and Muhammad === Mecca experienced very bad weather, heavy rains and floods. This heavily damaged the Kaaba. So, the Quraysh (tribe that ruled Mecca) decided to renovate the Kaaba. When it was time to put the Black Stone back to its original place, many people fought with each other to decide who should place the Black Stone. To prevent killing, they all decided that the first person to go through the 'Banu Shayba Gate' will determine who will place the stone. The person happened to be Muhammad. So, Muhammad came up with an idea. He placed the stone on a piece of cloth. Then, he asked a representative of each tribe to hold one of the edges of the cloth and raise it to its place. After that, he picked it up with his own hands and put it to its original place. In the end, everyone was satisfied. == References == Category:Mecca Category:Mosques in Saudi Arabia Category:7th-century buildings and structures",
 "title": "Masjid al-Haram"
}