{
 "id": "178475",
 "text": "Debra Lynn Messing (born August 15, 1968) is an American actress. She has been nominated eight times for Golden Globe Awards. Her work includes acting as Grace Adler in the NBC television series Will & Grace, and Molly Kagan in the USA television series The Starter Wife. == Early life == Messing was born in the Brooklyn borough of New York City.Stated in an interview on Inside the Actors Studio She is the daughter of Sandra (née Simons), who has worked as a professional singer, banker, travel agent and real estate agent, and Brian Messing, a sales executive for a costume jewelry packaging manufacturer.Debra Messing Biography (1968-) The Messing family is Jewish, and descends from Russia and Poland.JewishJournal.com When Messing was three, she moved with her parents and her older brother, Brett, to East Greenwich, a small town outside Providence, Rhode Island. During her high school years, Messing acted and sang in a number of high school productions. For example, she was a main character in the musicals Annie and Fiddler on the Roof. Messing took lessons in dance, singing, and acting. While her parents encouraged her dream of becoming an actress, they also urged her to finish a liberal arts education before deciding on acting as a career. Following their advice, Messing attended Brandeis University in Waltham, Massachusetts. During her junior year, she studied theater at the well-known London-based British European Studio Group program. This experience made her sure that she wanted to be an actress. In 1990, Messing graduating from Brandeis University with a bachelor's degree in theater arts She then gained admission to the Graduate Acting Program at New York University. This was a very hard thing to do, because the program only accepts around fifteen new students every year. She earned a Master's Degree in Fine Arts there after three years. == Career == In 1993, Messing was praised for her acting in the pre-Broadway workshop production of Tony Kushner's play Angels in America: Perestroika. After that, she appeared in several episodes of the television series NYPD Blue during 1994 and 1995. In 1995, Messing made her film debut in Alfonso Arau's A Walk in the Clouds. She was playing the unfaithful wife of main character Paul Sutton (Keanu Reeves). Fox Network thought she did well, so they made her the co-star of the television sitcom, Ned and Stacey. The series lasted for two seasons, from 1995 to 1997. In 1996 and 1997, Messing appeared as Jerry Seinfeld's date in two episodes of the series Seinfeld. Messing turned down a starring role in another television sitcom so she could appear in Donald Margulies's two- character play Collected Stories. The play opened at the Off-Broadway Manhattan Theater Club. She also co-starred in McHale's Navy in 1997. In 1998, Messing played a lead role as the bio-anthropologist Sloan Parker on ABC's dramatic science fiction television series Prey. During this time, her agent want to her with the script for the first episode of the television show Will & Grace. Messing was at first wanted to take some time off, but the script get her interest. She auditioned for the role of Grace Adler. She got the part, beating out Nicollette Sheridan. Sheridan later guest-starred on the show as a romantic rival of Grace's. Will & Grace became a ratings success, and Messing gained fame. In 2002, Messing was named one of the \"50 Most Beautiful People in the World\" by People Magazine. TV Guide picked her as its \"Best Dressed Woman\" in 2003. Messing was cast by director Woody Allen in a small role in his 2002 film Hollywood Ending. Her film roles since then include a happily married but ill-fated wife in the thriller The Mothman Prophecies (2002) and a supporting role in Along Came Polly (2004). The Wedding Date (2005) was Messing's first leading role in a high-profile film. It received mixed reviews but performed fairly well at the box office. Messing was featured as a judge on the season finale of the second season of Bravo's reality show, Project Runway. She also starred in the television mini-series The Starter Wife, which was nominated for ten Emmy awards including one for Messing for Outstanding Lead Actress in a Miniseries or Movie. Messing returned to her role as Molly Kagan in a second season of ten episodes of The Starter Wife in 2008. In February 2009, USA Network announced that The Starter Wife will not be back for another season. == Personal life == Messing met actor and screenwriter Daniel Zelman, on their first day as graduate students at NYU in 1990. They married on September 3, 2000, and live in New York City. On April 7, 2004, Messing gave birth to a son, Roman Walker Zelman.The Debra Messing Picture Pages == Filmography == Year Title Role Other notes 1995 A Walk in the Clouds Betty Sutton 1995 Ned & Stacey Stacey Colbert TV Series 1997 McHale's Navy Lt. Penelope Carpenter 1998 Will & Grace Grace Adler TV Series 1999 Jesus Mary Magdalene TV Movie 2002 The Mothman Prophecies Mary Klein 2002 Hollywood Ending Lori Fox 2004 Along Came Polly Lisa Kramer 2004 Garfield Arlene Voice only 2005 The Wedding Date Kat Ellis 2006 Open Season Park Ranger Beth Voice only 2007 Lucky You Suzanne Offer 2007 The Starter Wife Molly Kagan TV miniseries 2007 Purple Violets Kate 2008 The Women Edith Potter 2008 The Starter Wife Molly Kagan TV series 2008 Nothing Like the Holidays Sarah == Awards == === Golden Globe Awards === * 2000: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2001: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2002: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2003: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2004: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2005: nominated - Best Actress in a Television Series Musical or Comedy - Will & Grace * 2008: nominated - Best Actress in a Miniseries or Television Film - The Starter Wife * 2009: nominated - Best Actress in a Television Series Musical or Comedy - The Starter Wife === Emmy Awards === * 2000: nominated - Outstanding Lead Actress in a Comedy Series - Will & Grace * 2001: nominated - Outstanding Lead Actress in a Comedy Series - Will & Grace * 2002: nominated - Outstanding Lead Actress in a Comedy Series - Will & Grace * 2003: won - Outstanding Lead Actress in a Comedy Series - Will & Grace * 2006: nominated - Outstanding Lead Actress in a Comedy Series - Will & Grace * 2007: nominated - Outstanding Lead Actress in a Miniseries or Movie - The Starter Wife === Screen Actors Guild Awards === * 2001: nominated - Outstanding Performance by an Actress in a Comedy Series - Will & Grace * 2001: won - Outstanding Performance by an Ensemble in a Comedy Series - Will & Grace * 2002: nominated - Outstanding Performance by an Ensemble in a Comedy Series - Will & Grace * 2003: nominated - Outstanding Performance by an Ensemble in a Comedy Series - Will & Grace * 2004: nominated - Outstanding Performance by an Actress in a Comedy Series - Will & Grace' * 2004: nominated - Outstanding Performance by an Ensemble in a Comedy Series - Will & Grace * 2005: nominated - Outstanding Performance by an Ensemble in a Comedy Series - Will & Grace * 2008: nominated - Outstanding Performance by a Female Actor in a Television Movie or Miniseries - The Starter Wife === Teen Choice Awards === * 2001: nominated - Choice TV Actress: Comedy - Will & Grace * 2002: nominated - Choice TV Actress: Comedy - Will & Grace * 2006: nominated - Choice TV Actress: Comedy - Will & Grace ==References== == Other websites == * Debra Messing's official website * * * Newsweek interview (2005) * USA Today interview (May 3, 2002) Category:Actors from Brooklyn Category:American movie actors Category:American television actors Category:American television producers Category:American voice actors Category:Emmy Award winning actors Category:Jewish American actors Category:New York University alumni Category:1968 births Category:Living people",
 "title": "Debra Messing"
}