{
 "id": "178441",
 "text": "Mário Jorge Lobo Zagallo (; 9 August 1931 – 5 January 2024) was a Brazilian professional football player and manager, who played as a forward. Zagallo was regarded as one of the best football players of all time and was considered to be one of the greatest world's managers. Physically limited by his low stature, Zagallo began his career as a left midfielder and then moved also due to excessive competition in the role in the role of pure winger, characterized by his usefulness in defensive recoveries and in midfield as well as for his effective attacks on the offensive front. == Early life == Zagallo was born in Atalaia on 9 August 1931. As a young man, he worked as a soldier, working at the Maracanã Stadium when Uruguay defeated Brazil in the 1950 World Cup Final. ==Club career== Zagalo in Botafogo. He started his career in America (Rio de Janeiro) in 1948. In 1950 he moved to Flamengo . He was part of the \"red and black\" team that won three consecutive Campeonato Carioca titles (1953, 1954, 1955). In 1955, the team won the Rio-Sao Paulo Intercity Cup. Since there was no national championship at the time, Flamengo regularly participated in various friendly tournaments in addition to the city, and in Peru, Argentina and Israel. In total, in all tournaments, he played 217 matches, in which he scored 30 goals. In 1958, Flamengo experienced financial problems and sold Zagallo against the player's wishes. Mario becomes part of Botafogo, as his wife is a teacher and will lose her job when moving to another city. Along with Garrincha, Didi and Nílton Santos, Zagallo became an important part of the team and won the Campeonato Carioca in 1961 and 1962, as well as the Rio-Sao Paulo Champions Cup in 1961 and the Rio-Sao Paulo Inter- City Tournament in 1962 and 1964. ==International career== Zagallo was called up to the Brazilian national team on the eve of the 1958 World Cup and was considered as a replacement for Pepe, who in those years was the best Brazilian football player in his position. However, just before the start of the tournament, Pepe was injured, and his place was taken by Zagallo, who played in all matches of the tournament (which became victorious for the Brazilians), and scored a goal against the Sweden national team in the final. Four years later, Mario helped his team defend the world title, playing in six matches and scoring one goal and two assists. In total, he played 33 matches for the national team and scored 5 goals. ==Coaching career== Zagallo started his coaching career at Botafogo, the club he had finished his career with, managing them alongside the Brazil national team. Zagallo won the World Cup as a manager in 1970, and as assistant coach in 1994, both with Brazil. He was the first person to win the World Cup both as a player and as a manager. Winning the World Cup in 1970 at the age of 38, he is also the second youngest coach to win a World Cup, after Alberto Suppici, who won aged 31 with Uruguay in 1930. ==Death== In July 2022, Zagallo was hospitalized with a respiratory tract infection. In August 2023, he was hospitalized for 22 days for a urinary tract infection. He died on 5 January 2024 from multiple organ failure at a hospital in Rio de Janeiro, aged 92. ==Honours== ===Player=== Flamengo * Rio de Janeiro State Championship: 1953, 1954, 1955 Botafogo * Rio-São Paulo Tournament: 1962, 1964 * Rio de Janeiro State Championship: 1961, 1962 Brazil * FIFA World Cup: 1958, 1962 * Copa América runner-up: 1959 * Copa Oswaldo Cruz: 1958, 1961, 1962 * O'Higgins Cup: 1959, 1961 * Roca Cup: 1960, 1963 * Atlantic Cup: 1960 ===Manager=== Botafogo * Taça Brasil: 1968 * Rio de Janeiro State Championship: 1967, 1968 Flamengo * Copa dos Campeões: 2001 * Rio de Janeiro State Championship: 1972, 2001 Brazil * FIFA World Cup: 1970; runner- up: 1998 * FIFA Confederations Cup: 1997 * Copa América: 1997; runner-up: 1995 * CONCACAF Gold Cup runner-up: 1996; third place: 1998 Kuwait * AFC Asian Cup runner-up: 1976 Individual * IFFHS World's Best National Coach: 1997 * World Soccer Magazine 9th Greatest Manager of All Time: 2013 * FourFourTwo 27th Greatest Manager of All Time: 2020 ==References== * Roberto Assaf, Clóvis Martins. Campeonato carioca: 96 anos de história, 1902–1997. Irradiação Cultural (1997). ==Other websites== !colspan=\"3\" style=\"background:#C1D8FF;\"| World Cup-winners status |- |- !colspan=\"3\" style=\"background:#C1D8FF;\"| World Cup Finals Category:1931 births Category:2024 deaths Category:Deaths from multiple organ failure Category:Brazilian football managers Category:Footballers from Alagoas Category:1958 FIFA World Cup players Category:1962 FIFA World Cup players Category:Association football forwards Category:Brazil at the 1958 FIFA World Cup Category:Brazil at the 1962 FIFA World Cup Category:Brazil at the 1970 FIFA World Cup Category:Brazil at the 1974 FIFA World Cup Category:Brazil at the 1998 FIFA World Cup Category:Al Hilal SFC managers",
 "title": "Mário Zagallo"
}