{
 "id": "178516",
 "text": "Altron is a Japanese video game developer and publisher founded in 1983. It has developed or published games for the Nintendo 64, PlayStation, Sega Saturn, Super Nintendo, Sega Mega Drive, Nintendo Entertainment System, Nintendo DS, Game Boy and Game Boy Color video game systems as well as for the PC. == Games == Year Title Platforms JP NA EU AU 1984 Paperboy DOS, Game Boy 1986 Super Sprint Atari ST, NES 1989 The Chessmaster Game Boy, SNES 1991 The Hunt for Red October Game Boy The Untouchables NES Home Alone Game Boy, SNES https://ia800604.us.archive.org/view_archive.php?archive=/1/items/World_of_Spectrum_June_2017_Mirror/World%20of%20Spectrum%20June%202017%20Mirror.zip&file;=World%20of%20Spectrum%20June%202017%20Mirror/sinclair/magazines/ACE/Issue53/Pages/ACE5300083.jpg Tom & Jerry NES, DOS 1992 Attack of the Killer Tomatoes Game Boy Redline: F1 Racer SNES Tom & Jerry Game Boy, Game Boy Color 1993 Lingo: 5 mal 5 Game Boy Little Magic SNES, Game Boy Color Pink Goes to Hollywood SNES http://download.abandonware.org/magazines/Player%20One/playerone_numero041/Player%20One%20n%B041%20(Avril%201994)%20-%20Page%20106.jpg Tom and Jerry: Frantic Antics! Game Boy The Hunt for Red October SNES The New Chessmaster Game Boy Tom and Jerry SNES Super Slap Shot Harley's Humongous Adventure 1994 Tom and Jerry: Frantic Antics! Sega Genesis 1995 The Chessmaster 3-D PlayStation Missland Bass Masters Classic Sega Genesis, SNES Tadaima Wakusei Kaitakuchū! PlayStation, SEGA Saturn 1996 Robo Pit Cleopatra's Fortune PlayStation, Windows Mighty Hits SEGA Saturn, PlayStation 1997 Elf o Karu Monotachi SEGA Saturn https://www.famitsu.com/cominy/?m=pc&a;=page_h_title&title;_id=16768 Elf o Karu Monotachi: Kanzenban PlayStation https://www.famitsu.com/cominy/?m=pc&a;=page_h_title&title;_id=16768 Robo-Pit 2 Elf o Karu Monotachi: Hanafuda-hen PlayStation, SEGA Saturn https://www.famitsu.com/cominy/?m=pc&a;=page_h_title&title;_id=16768 1998 Jung Rhythm SEGA Saturn Elf o Karu Monotachi II SEGA Saturn, PlayStation https://www.famitsu.com/cominy/?m=pc&a;=page_h_title&title;_id=16768 Waku Waku Monster SEGA Saturn Bust-A-Move 4 PlayStation, Windows Sorvice SEGA Saturn Rox PlayStation, Game Boy Color Honkaku Hanafuda SEGA Saturn, PlayStation Missland 2 PlayStation 1999 Mighty Hits Special https://www.jeuxvideo.com/articles/0000/00000486_test.htm Shin Honkaku Hanafuda Dreamcast Backgammon Game Boy Color 64 Hanafuda: Tenshi no Yakusoku Nintendo 64 2000 Honkaku Hanafuda GB Game Boy Color K.O.: The Pro Boxing Elevator Action EX http://www.pockett.net/t618_Game_Boy_Color_Elevator_Action_EX_US Sgt. Rock: On the Frontline Dexter's Laboratory: Robot Rampage 2001 Puzznic PlayStation Pocky & Rocky with Becky Game Boy Advance, Wii U http://www.gamescollection.it/reviews/show/341 Hot Wheels: Burnin' Rubber Game Boy Advance 2002 Hey Arnold! The Movie Virtua Tennis The Fairly OddParents!: Enter the Cleft https://web.archive.org/web/20021225061928/http://gameboy.gamezone.com/gzreviews/r20293_GBA.htm 2003 Rocket Power: Zero Gravity Zone The Simpsons: Road Rage Tower & Shaft: Aleck Bordon no Fuyukai na Nakamatachi Arcade, Game Boy Advance 2004 Scooby- Doo 2: Monsters Unleashed Game Boy Advance http://www.acegamez.co.uk/reviews_gba/Scooby_Doo_2_Monsters_Unleashed_GBA.htm Nicktoons: Freeze Frame Frenzy All Grown Up! Express Yourself Finding Nemo: The Continuing Adventures 2005 Bratz: Rock Angelz Tak: The Great Juju Challenge Nintendo DS Zoo Tycoon DS http://gamefreaks365.com/review.php?artid=729 Hi Hi Puffy AmiYumi: Kaznapped! Game Boy Advance 2006 Finding Nemo: Escape to the Big Blue Nintendo DS, Nintendo 3DS Danny Phantom: The Ultimate Enemy Game Boy Advance Danny Phantom: Urban Jungle Game Boy Advance, Nintendo DS Alex Rider: Stormbreaker Nintendo DS http://palgn.com.au/article.php?id=5249&sid;=c84b8c24b7b3c63eb84a60a8d00ee292 Flushed Away Game Boy Advance https://www.metacritic.com/game/flushed- away/critic-reviews/?platform=game-boy-advance 2007 SpongeBob's Atlantis SquarePantis Meet the Robinsons Nintendo DS SpongeBob's Atlantis SquarePantis Enchanted Drawn to Life: SpongeBob SquarePants Edition 2008 Tak: Mojo Mistake Bolt https://www.jeuxvideo.com/articles/0001/00010314-volt- star-malgre-lui-test.htm 2009 Phineas and Ferb Up SpongeBob's Truth or Square Jonas 2010 Sonny With a Chance Phineas and Ferb: Ride Again Phineas and Ferb: Across the 2nd Dimension 2012 Transformers Prime: The Game 2013 Disney Infinity: Toy Box Challenge Nintendo 3DS 2015 PokePet Android, iPad 2017 Next Generation Solitaire Next Solitaire iPad, iPhone 2019 Zanzan Android, iPad 2019 DongDong Island Android, iPhone 2019 Twin Card ==References== == Other websites == *Official website Category:1983 establishments in Japan Category:Video game companies of Japan",
 "title": "Altron"
}