{
 "id": "179477",
 "text": "Roberto Rivellino (also Rivelino, born 1 January 1946) is a Brazilian football pundit and retired footballer. He was one of the stars of Brazil's 1970 FIFA World Cup winning team. Rivellino currently works as a pundit for Brazilian TV Cultura.Rivellino assina com a TV Cultura at TV Cultura He is the son of Italian immigrants. As a footballer, Rivelino (his football name only had one L) was known for his hard shots, long-range free kicks, long balls and huge mustache. He also invented his own action: the Elástico, nowadays also called the flip-flap or aka and copied by Ronaldinho and Zlatan Ibrahimović, among others. Rivelino is often regarded to be one of the best midfielders the world has ever known. Many people consider him the fourth best Brazilian footballer of all time, after Pelé, Garrincha and Zico. According to many football pundits, he is considered as the best player in the history of Corinthians and Fluminense. ==Early personal life== Rivelino was born on New Year's Day 1946 as the son of Italian immigrants from Macchiagodena in the metropolis of São Paulo, where he grew up in poor conditions. He played football from an early age: first in the backyards (“peladas”) of his neighborhood and later indoor football (futsal). In 1962, the 16-year-old caught the eye of those in charge of the first division club Palmeiras, who invited him to a trial session. Rivelino's entire family were supporters of this club (the club has traditionally been supported by Italian immigrants ) but he was denied a contract. Furious, he tried it a little later at the city rival Corinthians, who recognized his talent and committed him. “Corinthians welcomed me with open arms and allowed me to achieve everything I have achieved in life. The club was my second home,” Rivelino later said. ==Club career== In 1965, at the age of 19, Rivelino was promoted to the senior squad. He quickly became one of the top performers in the team and was considered one of the most hopeful players in the country. Rivelino was a classic playmaker who excelled with great ball handling, technique and long-range shots. The dark mustache and hard-hitting free-kicks became his trademarks. He quickly became a fan favorite, who nicknamed him O Reizinho do Parque (Little King of the Park). But titles and successes were a long time coming. During Rivelino's time at Corinthians, the club endured 23 years in the league without a title win. One title could still be won: the Rio-Sao Paulo tournament in 1966, which went to the four semi-finalists Corinthians, Botafogo FR, FC Santos and CR Vasco da Gama due to serious scheduling problems. In 1974, Corinthians lost the Sao Paulo championship final 0-1 to Palmeiras. From then on, Rivelino was presented by the supporters as a scapegoat for the repeated failure of the team. \"That was the saddest moment of my life,\" he later explained and, when admiration turned to rejection, he decided to leave the club after nine years. The elegant left-footed player joined Fluminense in Rio de Janeiro. With \"Flu\" it quickly became clear that a good catch had been made with him. He won the Rio State Championship with Fluminense in 1975 and 1976. Here he played under coach Mário Travaglini, who had turned him down at Palmeiras. After the 1978 World Cup, the now 32-year-old turned his back on Brazil. He signed a well- paid contract with Al-Hilal in Saudi Arabia and ended his career there. In 1981 he ended his active career. ==International career== Rivelino made his debut for the Seleção in 1965, but it would be three years before he established himself as a regular in the team. Although Rivelino is now considered one of the most admired players in Brazil, he had to fight hard for a place in the national team as there were many candidates for the playmaker position. It was only when Mário Zagallo became national coach that Rivelino's playing times increased. Zagallo wanted to form a team that included all the ball magicians in the country. From then on, Rivelino was used in left midfield. He was left out for the World Cup in 1966, In 1970, Rivelino was part of Brazil 's World Cup squad. He was part of the outstanding offensive series around Pelé, Tostão, Jairzinho and Gérson, who understood each other almost blindly and constantly swapped positions. At the tournament in Mexico, Brazil's style of play became synonymous with efficient and beautiful football. The team played the best football and advanced to the final, in which Italy was defeated 4-1. Rivelino played a good tournament, scoring three times (against Czechoslovakia, Peru and in the semifinals against Uruguay). This world title is Rivelino's most important sporting success. After Pelé's retirement from the national team in 1971, Rivelino took over his jersey number 10. Brazil held the 1972 Taça Independência , an international tournament in which Rivelino participated and which Brazil won. Brazil traveled to West Germany as defending champions for the 1974 World Cup ; great hopes were pinned on Rivelino. Despite being the best player in his team (three goals), the team underperformed and ended up fourth. The 1978 World Cup in Argentina should have been Rivelino's big career finale. As captain, he led Brazil into the tournament. But after disputes with coach Cláudio Coutinho, he was replaced by Leão and was no longer used in the further preliminary round and the first intermediate round games. Only in the last intermediate round game against Poland and in the game for third place against Italy was he substituted on again. His international career ended in third place after 92 games with 26 goals. In 1989 he was awarded Best Player and Top Scorer at the Pelé Cup for senior teams (over 34). ==Career statistics== ===Club=== Club Season Saudi Pro League King Cup Crown Prince Cup AFC Champions League Other Total Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Assist Al-Hilal 1978–79 10 3 13 1979–80 8 5 2 4 17 1980–81 7 2 9 Career total 25 10 2 4 39 ==Managerial statistics== J.League Data Site Team From To Record G W D L Win % Shimizu S-Pulse 1994 1994 Total ==Honours== ===Club=== ;Corinthians * Torneio Rio – São Paulo: 1966 ;Fluminense * Campeonato Carioca: 1975, 1976 ;Al Hilal * Kings Cup (Saudi Arabia): 1980 ===International=== ;Brazil * FIFA World Cup: 1970 * FIFA World Cup: 1974 fourth place * FIFA World Cup: 1978 third place * Copa Roca: 1967 * Copa Río Branco: 1968 * Copa Oswaldo Cruz: 1968, 1976 * Brazil Independence Cup: 1972 * Copa del Atlántico: 1976 ===Individual=== * FIFA World Cup All-Star Team player: 1970 * Bola de Prata Brazilian Championship All-Star Team: 1971 * CONMEBOL All-Star Team: 1973CONMEBOL All-Star Team Retrieved on 17 November 2015 * Bronze ball South American Footballer of the Year: 1973,\"South American Player of the Year 1973\" Retrieved on 17 November 2015 1976\"South American Player of the Year 1976\" Retrieved on 17 November 2015 * Silver ball South American Footballer of the Year: 1977\"South American Player of the Year 1977\" Retrieved on 17 November 2015 * FIFA 100 Greatest Living Footballers: 2004 * Premio Golden Foot Award (Football Legend Award): 2005 * The Best of The Best – Player of the Century: Top 50\"The Best of The Best\" Retrieved on 17 November 2015 * World Soccer: 38th Greatest Player of the 20th Century * IFFHS Brazilian Player of the 20th Century (12th place)IFFHS' Century Elections * Brazilian Football Museum Hall of Fame *France Football's World Cup Top-100 1930–1990: 76th place ==References== ==Other websites== * * Rivellino Sport Center * Rivellino from the Confederação Brasileira de Futebol * * * * Category:1946 births Category:Living people Category:Footballers from São Paulo Category:Brazilian football managers Category:1970 FIFA World Cup players Category:1974 FIFA World Cup players Category:1978 FIFA World Cup players Category:Association football midfielders Category:Shimizu S-Pulse managers Category:South American Footballer of the Year winners Category:Association football forwards Category:Al Hilal SFC players",
 "title": "Rivellino"
}