{
 "id": "179557",
 "text": "The Viking Age was a period of time in Northern European and Scandinavian history from the 8th to the 11th centuries.The Viking Age from the Norway article at Encyclopædia BritannicaThe Viking Age from the Denmark article atEncyclopædia BritannicaThe Viking Age from the Sweden article at Encyclopædia Britannica Scandinavian Vikings, also called Norsemen, explored the oceans and rivers of Europe through trade and warfare. The Vikings also reached Iceland, Greenland, Newfoundland and Anatolia. Some Vikings are believed to have settled at L'Anse aux Meadows, an archaeological site on the northernmost tip of the island of Newfoundland, Canada, which is believed to be a place that they called Vinland. == Start == In England, the Viking Age began dramatically on June 8, 793, when Norsemen destroyed the abbey on Lindisfarne. Monks were killed in the abbey, thrown into the sea to drown or carried away as slaves along with the church's wealth. The Viking devastation of Northumbria's Holy Island shocked and alerted the royal courts of Europe. \"Never before has such an atrocity been seen\", declared the Northumbrian scholar Alcuin of York. More than any other single event, the attack on Lindisfarne cast a shadow on the perception of the Vikings for the next 1100 years. In the 1890s, scholars outside Scandinavia began to rethink the achievements, artistry, technological skills and seamanship of the Vikings.Palmer, Alan. Northern Shores. p. 21. Until Victoria's reign in Britain, Vikings were portrayed as violent and bloodthirsty. The stories from mediaeval England had always portrayed them as \"wolves among sheep\". During the 19th century, public opinions changed. The first challenges to the many anti-Viking images in Britain emerged in the 17th century. Some scholarly works on the Viking Age became available to readers in Britain. Archaeologists began to dig up Britain's Viking past. Linguists started to work on identifying Viking-Age origins for rural idioms and proverbs. The new dictionaries of Old Norse enabled the Victorians to study some of the Icelandic Sagas. During the second half of the 18th century, the Icelandic Sagas were still used as important historical sources, but the Viking Age was regarded as a barbaric and uncivilised period in the history of the Nordic countries. Until recently, what was known about the history of the Viking Age was based on the Icelandic Sagas, the history of the Danes written by Saxo Grammaticus, the Russian Primary Chronicle and the Irish The War of the Irish with the Foreigners. Few scholars still accept these texts as reliable sources; historians nowadays rely more on archaeology and numismatics, which have helped people understand the period.Sawyer, Peter. The Oxford Illustrated History of the Vikings == Background == The Norsemen were explorers, colonisers, traders and plunderers. The Vikings from Norway explored the North Atlantic and settled Iceland, the Faroe Islands; Shetland and Orkney Islands, Caithness, Scotland; Greenland and (briefly) North America. The Vikings from Denmark raided ports and coastal towns along the coasts of Britain and the rest of Europe. The Vikings from Sweden pushed east into areas that are now in Russia and Ukraine and established trade connections with the Middle East and beyond. By the 9th century, a strong central authority had been established in Jutland, and the Danes were looking beyond their own territory for land, trade and plunder. Norway had been settled over many centuries by Germanic peoples from Denmark and Sweden that made farming and fishing communities around its coasts and lakes. The area's mountains and fjords formed strong natural boundaries. The communities remained independent of one another, unlike the situation in Denmark, which is lowland. By 800, there were 30 small kingdoms in Norway. The sea was the easiest way of communicating between the Norwegian kingdoms and the outside world. In the 8th-century Scandinavians began to build war ships and to send them on raids. The Viking longships were capable of travel on the open seas but had a very shallow draft and so could sail into shallower bays and farther up rivers than other ships of their time. That led to the term Viking, which came from the Old Norse word vīk (meaning inlet or bay).\"Viking\". American Heritage Dictionary, 4th ed. A person who went on raids was said to go \"viking\". What triggered the Vikings' expansion and conquests is unknown. The era was at the same time as the Medieval Warm Period (800 – 1300) and ended with the start of the Little Ice Age (1250 – 1850). The lack of pack-ice during their time may have allowed the Norsemen to go \"a-viking\" or \"raiding\". It is believed that the heathen Norsemen suffered from unequal trade practices by Christian merchants, who were given preference by a Christian network of traders. A two-tiered system of pricing existed among merchants who secretly traded with the Norse heathens. Viking raids occurred both separately and together with regular trading expeditions. Historians also suggest that there too many Scandinavians on the peninsula and that there were not enough crops to feed everyone. That led to a hunt for more land to feed the ever-growing Viking population. Internal conflicts, especially during the period of conquest and settlement that followed the early raids, caused the progressive centralisation of power into fewer hands. The lower classes that did not want to be oppressed by greedy kings therefire went in search of their own lands. Those who settled Iceland created Europe's first modern republic with a yearly assembly of elected officials, called the Althing. == Overview == The earliest date given for a Viking raid is 787 AD, when, according to the Anglo-Saxon Chronicle, a group of men from Norway sailed to the Isle of Portland, in Dorset. There, a royal official mistook them for merchants. They killed him when he tried to lead them to the king's manor to pay a trading tax on their goods. The beginning of the Viking Age in the British Isles is, however, often given as 793. It was recorded in the Anglo-Saxon Chronicle that the Norsemen raided the important island monastery of Lindisfarne: > \"AD. 793. This year came dreadful fore-warnings over the land of the > Northumbrians, terrifying the people most woefully: these were immense > sheets of light rushing through the air, and whirlwinds, and fiery dragons > flying across the firmament. These tremendous tokens were soon followed by a > great famine: and not long after, on the sixth day before the ides of > January in the same year, the harrowing inroads of heathen men made > lamentable havoc in the church of God in Holy-island (Lindisfarne), by > rapine and slaughter.\" -Anglo Saxon Chronicle In 794, according to the Annals of Ulster, there was a serious attack on Lindisfarne's mother-house of Iona, which was followed in 795 by raids on the northern coast of Ireland. From bases there, the Norsemen attacked Iona again in 802, caused great slaughter to the Céli Dé Brethren and burned the abbey to the ground. The end of the Viking Age is traditionally marked in England by three major events: the failed invasion by Harald Hardrada, who was defeated by Saxon King Harold Godwinson in 1066 at the Battle of Stamford Bridge; in Ireland, the capture of Dublin by Strongbow and his Hiberno-Norman forces in 1171; and in Scotland by the defeat of King Hákon Hákonarson at the Battle of Largs in 1263. Harold Godwinson was subsequently defeated within a month by William, Duke of Normandy, who was another descendant of Vikings. Normandy had been acquired by the Normans (Norsemen) in 911. Scotland took its present form when it regained territory from the Norse between the 13th and the 15rg centuries. Most Scandinavian historians and archaeologists give a different definition. Instead, the Viking Age is said to have ended with the establishment of royal authority in the Scandinavian countries and the adoption of Christianity as the dominant religion, which is usually considered to be sometime in the early 11th century in all three Scandinavian countries. The end of the Viking Age in Norway is marked by the Battle of Stiklestad in 1030. Norway was then proclaimed to be a Christian nation, and Norwegians could no longer be called Vikings. The Kingdom of the Franks under Charlemagne was especially troubled by the Viking, who would sail down the Seine without much difficulty. Near the end of Charlemagne's reign and throughout those of his sons and grandsons, a string of Viking raids began, which led to a conquest by the Scandinavians and the settlement of the region now known as Normandy. In 911, Charles the Simple, King of the Franks, made an agreement with the Viking warleader Rollo, a chieftain of either Norwegian or Danish origin.The material suggesting a Norwegian origin identifies Rollo with Hrolf Gangr, also known as Rolf the Walker. Charles gave Rollo the title of duke and granted him the possession of Normandy. In return, Rollo swore fealty to Charles, converted to Christianity and swore to defend region from raids by other Viking groups. Several generations later, the Norman descendants of those Viking settlers identified themselves as French and brought their variant of the French language and culture to England in 1066. With the Norman Conquest, they became the ruling aristocracy of Anglo-Saxon England and cause the change from Old English to Middle English. == Religion == At the start of the Viking Age, the polytheistic Vikings believed in the Norse religion. They believed in a large number of gods and goddesses, as well as Valhalla, a heaven for warriors. The lower class of society would go to a place called hel, similar to life on earth. The Vikings believed that their chieftains would please their war-gods by their bravery and become \"worth-ship\"; that is, the chieftains would earn a \"burial at sea\". The Vikings also performed land burials, which often still included a ship, treasure, weapons, tools, clothing and even slaves and women buried alive with the dead chieftain for his journey to Valhalla and the adventure in the afterlife. Poets composed sagas about the exploits of these chieftains to keep their memories alive. Freyr and his sister Freya were gods of fertility and made sure that the people had many children and that the land produced plenty of crops. Some farmers even called their fields after Freyr in the hope that would ensure a good harvest. Toward the end of the Viking Age, more and more Scandinavians were converted to Christianity, often by force. The introduction of Christianity did not immediately end Viking voyages but may have been a factor that helped the Viking Age to an end. == Trade centres == Some of the most important trading ports during the period were both existing and ancient cities such as Jelling (Denmark), Ribe (Denmark), Roskilde (Denmark), Hedeby (Denmark, now Germany), Aarhus (Denmark), Vineta (Pomerania), Truso (Poland), Kaupang (Norway), Birka (Sweden), Bordeaux (France), Jorvik (England), Dublin (Ireland) and Aldeigjuborg (Russia). == Settlements outside Scandinavia == ;Britain * Jórvík (Yorkshire) * Danelaw * Hjaltland ;Eastern Europe * Bjarmland * Garðaríki * Serkland * Miklagard ;Atlantic * Faroe Islands * Greenland * Helluland * Iceland * Markland * Vinland ==In fiction and theatre== In the late 1800s, Richard Wagner and other artists in the Romantic period made operas and other artwork about ancient Germanic culture. They liked the Vikings for not being Greeks or Romans and came up with the idea of Vikings wearing fur clothes and helmets with wings or horns on them and drinking out of hollowed-out animal horns. Some ancient Germanic peoples wore helmets with horns on them, but real Vikings did not. The artists deliberately dressed the actors in the opera Ring des Nibelungen to look like ancient Germanic tribes and so the audience would feel like modern Germans came from mediaeval Vikings. ==Related pages== * Viking == Notes == == References == *Carey, Brian Todd. “Technical marvels, Viking longships sailed seas and rivers, or served as floating battlefields”, Military History 19, no. 6 (2003): 70-72. *Downham, Clare. Viking Kings of Britain and Ireland: The Dynasty of Ívarr to A.D. 1014. Edinburgh: Dunedin Academic Press, 2007 *Forte, Angelo. Oram, Richard. Pedersen, Frederik. Viking Empires. Cambridge: Cambridge University Press, 2005 *Henry, Francoise. Irish Art in the Early Christian Period. London: Methuen & Co. Ltd., 1940 *Hudson, Benjamin. Viking Pirates and Christian Princes: Dynasty, Religion, and Empire in North America. Oxford: Oxford University Press, 2005. *Maier, Bernhard. The Celts: A history from earliest times to the present. Notre Dame, Indiana: University of Notre Dame Press, 2003. *TimeRef - Viking Invasions of England == Other websites == * Jorvik and the Viking Age (866 AD - 1066 AD) * Old Norse literature from «Kulturformidlingen norrøne tekster og kvad» Norway. * BBC - History - Blood of the Vikings * All About Vikings * Viking memories in Oslo Category:History of Europe Category:Periods and ages in history",
 "title": "Viking Age"
}