{
 "id": "179667",
 "text": "Wilson da Silva Piazza (born 25 February 1943) is a former Brazilian football player. He has played for Brazil national team. He played as defensive midfielder or centre-back, in particular with Cruzeiro E.C.. He was a member of the Brazilian team that won the 1970 World Cup. He was a member of the Cruzeiro team which won the 1976 Copa Libertadores.1976 Copa Libertadores at RSSSF Considered as one of the greatest Brazilian centre-backs in world football. He was known as a great man-marker, and had the ability to anticipate the ball very well, he was also renowned for his speed and defensive attributes on the pitch, he was known for his perfomances at the 1970 FIFA World Cup in Mexico, his class of defensive man-marking task helped him to be named in the All-Star Team. ==Early life== Wilson Piazza was born on February 25, 1943 in Ribeirão das Nevis, Minas Gerais, the son of José Piazza and Regina Da Silva Piazza. The family was not rich, and therefore, at the age of 15, Piazza left school to go to work. He got a job in the office of the company Avinida Antonio Carlos, which was engaged in the production of tires. The company had its own team, in which Piazza quickly became a leader. After several years of work in Avinida, he went to work at the Mercantil de Minas Gerais bank, having already begun to think about quitting football in favor of a career as a bank employee, but still the love of football did not let go of Piazza: for some time he had to play football to noon, and from 12 to 9 pm to work in a bank, where he was responsible for balancing the daily bank balance. Sometimes there was so much work that Piazza stayed at the bank until midnight and even slept in the bank, unable to go home with him saying: “I wanted to be a professional. Even if I had to play for the worst team in the world, I would make this dream come true.\" ==Club career== At the age of 18, Piazza began playing for the Renascensa club, at that time an amateur club, where he spent 3 seasons, becoming one of the strongest midfielders in the state. At the same time, Piazza worked in a bank, from which he left only after moving to Cruzeiro, which took place in 1965, making his debut in a match with Santos, led by Pelé. The game ended with a score of 4:3 in favor of Cruzeiro. In the first year, Piazza, together with the team, won the state championship and then the Brazilian Cup. A year later, the club won its second title of the best team in the state, and in total won 10 Mineiro leagues. True, 1968 passed almost without Piazza’s participation; he broke his leg in the national team’s match with Uruguay in Maracana, receiving a blow from Luis Cubilla. The atmosphere in the club was almost brotherly, all the players, with the exception of one, were from the state of Minas Gerais, which helped the team play. In total, Piazza played 559 games and scored 39 goals for Cruzeiro from 1964 to 1979. ==International career== In 1967, Piazza was called up to the Brazilian national team, which was looking for new players after the failure in England. In the national team, he won a place in the base, forming a duo of central midfielders with Gérson. But with the appearance of Clodoaldo in the national team, Piazza was offered a place in the center of defense, which he refused. But still, in order to play as part of the national team, Piazza was forced to give in to the team's head coach Mário Zagallo and go on the defensive. The transfer of the talented midfielder to defense caused heated debate in the Brazilian press, even the footballer’s mother asked on the pages of newspapers for her son to return his traditional place on the field. The biggest problem for the football player himself was his small stature, which, in the fight against the world champions, the British, could lead to fatal consequences for the team. At the World Cup itself, Piazza's fears were not justified, the only problem was the match with England, which fouled several times, but Piazza refused to take revenge on the founders of football, focusing on the game. Piazza also played several matches at the tournament in the position of central midfielder, replacing Clodoaldo. Piazza went to the 1974 World Cup as a reserve player and played only 3 games. In total, Piazza played 51 matches for the national team and scored only one goal. ==Club career statistics== |- |1971||rowspan=\"9\"|Cruzeiro||rowspan=\"9\"|Série A||21||0 |- |1972||26||1 |- |1973||39||0 |- |1974||6||0 |- |1975||28||0 |- |1976||1||0 |- |1977||0||0 |- |1978||0||0 |- |1979||0||0 121||1 121||1 |} ==International career statistics== |- |1967||2||0 |- |1968||4||0 |- |1969||5||1 |- |1970||7||0 |- |1971||4||0 |- |1972||10||0 |- |1973||8||0 |- |1974||11||0 |- |1975||4||0 |- !Total||51||1 |} ==Honours== Cruzeiro E.C. * Taça Brasil: 1966 * Campeonato Brasileiro de Futebol; runner-up: 1967 * Copa Libertadores 1976 * Copa Libertadores 1977: runner-up * Campeonato Mineiro (Minas Gerais State championship): 1965, 1966, 1967, 1968, 1969, 1972, 1973, 1974, 1975, 1977 ===International=== Brazil * FIFA World Cup: 1970; 1974: Fourth place * Rio Branco Cup: 1968 * Roca Cup: 1971 * Copa América: 1975; Third place ===Individual=== * FIFA World Cup All-Star Team: 1970 * Brazilian Silver Ball: 1972 ==References== Category:1943 births Category:Living people Category:Footballers from Minas Gerais",
 "title": "Wilson Piazza"
}