{
 "id": "179637",
 "text": "Monseñor Nouel is a province of the Dominican Republic. It is in the central part of the country. Its capital city is Bonao. The province was created in 1982. It was a municipality of the La Vega province before being elevated to the category of province. ==Name== The province was named after Archbishop Adolfo Alejandro Nouel, who was President of the Dominican Republic in 1912-1913. ==History== The valley where is the province was named by the Spanish conquistadors as Sabana de Bonao (\"Bonao Savanna\"; Bonao was the Taíno name of the region. Bartholomew Columbus, younger brother of Christopher Columbus, founded here a fort in 1495-1497 and Bonao became one of the most important city of the Hispaniola island during the first years of the Spanish colony. Later, the city was abandoned and was founded again during the Haitian occupation with the name of \"Paraje del Yuna\". In 1859, it became a military post in the municipality of La Vega. In 1936, it became a municipality of La Vega province under the name of Monseñor Nouel. The province was created in 1982 with the municipality of Monseñor Nouel and the municipal districts of Piedra Blanca and Maimón. In 2005, the name of the municipality of Monseñor Nouel was changed to Bonao even if the name had been changed since 1960. In 1982, Maimón became a municipality and in 1991 Piedra Blanca became the third municipality of the province. Villa Sonador became a municipal district in 1999, Sabana del Puerto in 2000, Juan Adrián in 2001, Juma Bejucal in 2004, and Arroyo Toro-Masipedro and Jayaco in 2006. ==Location== The Monseñor Nouel province is bordered to the north and the west by the La Vega province, to the east by the Juan Sánchez Ramírez and Monte Plata provinces and to the south by the San Cristóbal and San José de Ocoa provinces. ==Population== In (last national census), there were people living in the Monseñor Nouel province, and 112,305 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 17th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 171,040 inhabitants. The largest city of the province is Bonao, its head municipality or capital, with a population (in ) of 76,241 inhabitants. ==Geography== The Monseñor Nouel province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 24th (out of 31 plus the National District) largest province. The altitude of Bonao, provincial capital, is above sea level. The province is mainly in a valley surrounded by mountains: the Cordillera Central (\"Central mountain range\" by the north, west and south, and by the Sierra de Yamasá (\"Yamasá mountain range\"), a branch of the Cordillera Central, by the east. The most important river is the Yuna, one of the largest of the Dominican Republic and of the Hispaniola island. ===Climate=== The climate of the province is a tropical climate, hot most of the year. ==Municipalities== There are three municipalities and seven municipal districts (M.D.) in the province. Municipalities of the Monseñor Nouel province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) Bonao (280101) Bonao (280101) 76,241 142.8 176 Sabana del Puerto (280102) 10,049 133.1 147 Juma Bejucal (280103) 22,545 72.2 181 Arroyo Toro - Masipedro (280104) 2,851 103.1 922 Jayaco (280105) 8,051 29.5 184 La Salvia - Los Quemados (280106) 5,601 197.4 452 Bonao (280100) Bonao (280100) 125,338 678.1 Maimón (280201) Maimón (280201) 18,952 82.6 124 Maimón (280200)) Maimón (280200)) 18,952 82.6 Piedra Blanca (280301) Piedra Blanca (280301) 10,615 117.6 220 Villa de Sonador (280302) 7,028 53.2 190 Juan Adrián (280303) 3,291 60.5 391 Piedra Blanca (280300)) Piedra Blanca (280300)) 20,934 231.4 Monseñor Nouel (280000) Monseñor Nouel (280000) 992.0 ==Economy== The main economic activities in the province are farming and mining (mainly surface mining of nickel). It is a province with an important production of rice. Cattle raising is also important, mainly for milk. ==References== Category:Provinces of the Dominican Republic Category:1982 establishments in North America Category:1980s establishments in the Dominican Republic",
 "title": "Monseñor Nouel Province"
}