{
 "id": "179672",
 "text": "Paulo César Lima (born 16 June 1949) is a former Brazilian football player. He has played for Brazil national team. He was a striker who could kick the ball with trajectories that few goalkeepers could predict. On the pitch he loved spectacularity: he often did not score easy goals for the sake of trying an amazing shot. Widely considered as one of the best Brazilian football players of all time. ==Career== He was revealed by Botafogo and played for the club from the late 1960s to the early 1970s. In 1967, at the age of 18, Paulo Cézar made his dream come true once and for all, when he became a player of Botafogo's first team and participated in his first season at Glorioso. His skillful and provocative football was catching the attention of the football public. In a short time, he became known in his home state. Still in 1967, Paulo Cézar was called up for the first time for the Brazilian National Team. He was champion of the Guanabara Cup in 1967, when he scored three goals in the decisive game, against America. That same year, he was also champion of Rio de Janeiro, whose titles he repeated in 1968, in addition to the 1968 Taça Brasil. The nickname caju, which became almost a surname, came about when he returned from the United States in 1968 with his hair dyed red. The red painting of his hair was done as a way to demonstrate his support for the Black Panther movement, with which the player identified himself politically. At the age of 21, he played, as a reserve for the Brazilian national team, in the 1970 World Cup, in Mexico. Coach Zagallo, at first, tried to fit him into the team, but later realized that, with the scheme he intended to use, he and Pelé could not play together. [6] On his return from Mexico, he told a television station, \"We don't want to know about Botafogo,\" which caused unease at the club, but was circumvented after the player said he had given the statement to get rid of the reporter. With the loss of the Rio title to Fluminense in 1971, Paulo Cézar was blamed for the defeat and had to leave Botafogo. The reason for the discord was a move he made in a match held when his club had a good advantage in the table, with a few games to go: Paulo Cézar made embassies in front of his markers, which was understood as an attitude of contempt towards the other opponents of Botafogo, who until then accepted the superiority of the team. From then on, the matches became much more difficult, with the black and white team losing important points, until finally being overcome by Fluminense, who would be crowned champion. In 1972, Paulo Cézar transferred to Flamengo, a team for which he played until 1974. In the 1974 World Cup, in Germany, he was a starter for the Brazilian national team, having underwhelming performances. In the Brazilian national team, he made 77 appearances and scored 17 goals. He would only make a really good contract when he was sold to Olympique de Marseille, from France, after the 1974 World Cup. \"I always changed teams for professional interests,\" he told Placar magazine in 1979. \"And I think it should be like that, because the career is short. Today, my financial situation is only reasonable, contrary to what many may think. I only made an exceptional contract with Olympique. The others were just good.\" At Olympique, in 1975, he was national runner-up, with 18 goals. He would also play for Fluminense, where he was part of the legendary team that became known as Máquina Tricolor (in 1975), having been two-time champion of Rio de Janeiro in 1975 and 1976, semifinalist of the Brazilian championships in these years and winning several friendly international tournaments in this period. His debut was on June 10, 1975, in a friendly match where Fluminense won 1-0 against Bayern Munich, two-time European champion at the time. He had a first spell at Grêmio, between 1978 and 1979. He left the club from Rio Grande do Sul and also went through Vasco da Gama and Corinthians, who made an advertising appeal to their fans to raise money for the signing. He returned to the tricolor gaucho, where he was champion of the Intercontinental Cup in 1983. ==Club career statistics== |- |1971||Botafogo||Série A||6||1 |- |1972||rowspan=\"3\"|Flamengo||rowspan=\"3\"|Série A||23||4 |- |1973||17||2 |- |1974||0||0 |- |1974-75||Olympique Marseille||Division 1||31||16 |- |1975||rowspan=\"3\"|Fluminense||rowspan=\"3\"|Série A||22||9 |- |1976||17||2 |- |1977||0||0 |- |1977||rowspan=\"2\"|Botafogo||rowspan=\"2\"|Série A||17||4 |- |1978||11||0 |- |1979||Grêmio||Série A||5||1 |- |1980||Vasco da Gama||Série A||0||0 |- |1981||Corinthians Paulista||Série A||0||0 |- |1982-83||Aixoise||Championnat National||21||3 |- |1983||Grêmio||Série A||0||0 118||23 52||19 170||42 |} ==International career statistics== |- |1967||1||0 |- |1968||5||1 |- |1969||2||0 |- |1970||6||1 |- |1971||2||2 |- |1972||3||0 |- |1973||9||3 |- |1974||10||1 |- |1975||3||0 |- |1976||6||2 |- |1977||10||0 |- !Total||57||10 |} ==Honours== ===Botafogo=== * Campeonato Brasileiro Série A: 1968 * Campeonato Carioca: 1967 and 1968 ===Flamengo=== * Campeonato Carioca: 1972 and 1974 ===Fluminense=== * Campeonato Carioca: 1975 and 1976 * Tournoi de Paris: 1976 * Teresa Herrera Trophy: 1977 ===Grêmio=== * Campeonato Gaúcho: 1979 and 1980 * Copa Intercontinental: 1983 ===Vasco da Gama=== * Trofeo Colombino: 1980 ===Brazil=== * FIFA World Cup: 1970 * Roca Cup: 1967, 1971 * Brazil Independence Cup: 1972 * Copa Rio Branco: 1967, 1968 ==References== Category:1949 births Category:Living people Category:Footballers from Rio de Janeiro Category:Brazil at the 1970 FIFA World Cup Category:Brazil at the 1974 FIFA World Cup",
 "title": "Caju (footballer, born 1949)"
}