{
 "id": "179683",
 "text": "Clodoaldo (born 26 September 1949) is a former Brazilian football player. He has played for Brazil national team. Considered by many as one of the best defensive midfielders of all time. He was known as a skillful midfielder, who was fast and strong. He played equally well in attack and defense, had good dribbling skills to beat the opponents and gave a lot of assists. He was a playmaker and possessed good passing ability. He was also known for his positioning and stamina. ==Club career== Clodoaldo played alongside many of his childhood idols. A Santista since childhood, he began his career in Vila Belmiro at the age of thirteen, when he began to work in the club's youth categories. Clodoaldo is considered by many to be a skilled midfielder, who scored well on both sides of the field and was efficient in supporting the attack. He played most of his career at Santos, where he scored thirteen goals in 510 matches. His first games for Santos' first team, in 1966, were during a tour of South America. As early as 1967, at just seventeen years old, he became the team's starter by replacing Zito. In the thirteen years in which he played for Santos, Clodoaldo helped Santos to win five Paulista Championships: (1967, 1968, 1969, 1973 and 1978 Championship), the 1968 Brazilian Championship, the 1968 Intercontinental Champions Supercopa Sudamericana and the 1968 Intercontinental Champions Cup. He was regarded to be one of the most successful football players. ==International career== Clodoaldo made his debut for the national team in 1969. He was called up for the 1970 World Cup, he was a starter and champion, In the semi-final against neighboring Uruguay, he scored the equalizer, later Jairzinho and Roberto Rivellino scored the winning goals. In the final, he contributed to the famous goal of Carlos Alberto Torres, by dribbling past four Italian players which put the 4-1 victory on the board. In the next edition, in 1974, he ended up cut before the final list of entries due to injury, and midfielder Mirandinha replaced him. ==International career statistics== |- |1969||1||0 |- |1970||14||1 |- |1971||4||0 |- |1972||5||0 |- |1973||8||0 |- |1974||4||0 |- !Total||38||1 |} ==Honours== ===Club=== Santos * Campeonato Paulista: 1967, 1968, 1969, 1973, 1978 * Campeonato Brasileiro Série A: 1968 * Intercontinental Champions' Supercup: 1968 Nacional * Campeonato Amazonense: 1981 ===International=== Brazil * FIFA World Cup: 1970 * Roca Cup: 1971 * Brazil Independence Cup: 1972 ==References== Category:1949 births Category:Living people Category:Footballers from Sergipe",
 "title": "Clodoaldo"
}