{
 "id": "17961",
 "text": "Windows XP (stylized as WindowsXP) is a version of the Microsoft Windows operating system for personal computers. The letters \"XP\" stand for \"eXPerience\". Microsoft released Windows XP on October 25, 2001. Windows XP replaced Windows 2000 and Windows ME, which helped bring the NT and 9x versions of Windows together. It was replaced by Windows Vista in 2006. Windows XP was the second most used computer operating system in the world as late as April 2012. Following the release of Windows XP, many computer makers including (but not limited to) Dell, Hewlett Packard, Acer, IBM, Compaq, and Toshiba changed their computers (mostly laptops) to Windows XP from Windows 2000. A person can tell a laptop from that time was initially sold with Windows 2000 if the Windows (WIN) key on the keyboard has the previous Windows logo. Microsoft stopped supporting Windows XP on April 8, 2014 (except some security updates e.g. in 2019, to address ransomware threats, and to address major malware threats, such as BlueKeep) and Microsoft and authorities warn users against using Windows XP. However, Windows XP remained a popular operating system around the world for a long time. On July 31, 2019, Microsoft Internet Games Services on Windows XP and Windows ME stopped working, and on January 22, 2020 Microsoft Internet Games Services stopped working on Windows 7, for Windows 8 and Windows 8.1 – on April 5, 2021. By August 2019, Microsoft (and others) had ended support for games on Windows XP. As of June 2021, 0.6% of Windows PCs run Windows XP. Windows XP became the most popular operating system from 2001 to 2007, the operating system, individually and pre- installed, selling over 500 million copies. Windows XP's RTM-SP3 build number is: 2600 or Build 2600.xpsp_sp3_gdr.090804-1435 aka Service Pack 3. == Editions == Home Edition is an edition that was made for home users. Professional was made for business users, as well as power users. It had advanced management features like backup recovery, Group Policy and could support two Central processing units. Media Center Edition was for people who liked to use their computer as a television box. It has in basics the same features as Windows XP Professional but included Windows Media Center, a program which could manage TV shows and play music, and even Netflix. Tablet PC Edition was for users with pen-based laptops and early tablet PCs. 64-bit Edition was for computers that ran on Intel's 64-bit Itanium platform. This should not be confused with Windows XP x64 Edition, as x64 and Itanium are completely different architectures. Unlike Windows XP x64 Edition, 64-bit Edition has fewer features than Windows XP Professional. Some of these features included NTVDM and Windows on Windows, which means that 16-bit MS-DOS applications will not be able to run. It also was missing Windows Media Player features, but Windows XP 64-bit Edition Version 2003, released in March 2003, added back these media features. Unlike other editions of Windows XP, Windows XP 64-bit edition was discontinued and unsupported on June 30, 2005. Professional x64 Edition was for users with 64-bit x86-based computers. It has the same features as Windows XP Professional except for NTVDM, and introduced Windows on Windows 64, which lets 32-bit applications run on a 64-bit operating system and processor. Starter Edition was sold mostly in developing countries. The price was low because Microsoft wanted to fight the high software piracy rate in those countries. It could only be bought with a new computer. == System requirements == The system requirements for Windows XP Home and Professional editions are: Minimum Recommended Processor 233 MHz 300 MHz or higher Memory 64 MB RAM (may limit performance and some features) 128 MB RAM or higher Video adapter and monitor Super VGA (800 x 600) Super VGA (800 x 600) or higher resolution Hard drive disk free space 1.5 GB 1.5 GB or higher Drives CD-ROM or DVD-ROM CD-ROM or DVD-ROM Devices Keyboard Keyboard and mouse Others Sound card, speakers, and headphones Sound card, speakers, and headphones == Related pages == * List of operating systems == References == == Other websites == * * Windows XP end of support in April: Three more questions answered === Service Pack 2 === * Windows XP Service Pack 2 * Download - Windows XP Service Pack 2 from Windows Update for Home Users * Download - Windows XP Service Pack 2 Network Installation Package for IT Professionals * Order Windows XP Service Pack 2 on CD for the cost of shipping and handling * Support - Windows XP Service Pack 2 Support Site for Home Users * Support - Windows XP Service Pack 2 Support Site for IT Professionals * Changes to Functionality in Microsoft Windows XP Service Pack 2 === Service Pack 3 === * Download - Windows XP Service Pack 3 from Windows Update for Home Users * Windows XP Service Pack 3 - The Washington Post == Further reading == * Category:Microsoft operating systems",
 "title": "Windows XP"
}