{
 "id": "179644",
 "text": "Monte Cristi is a province in the north-west of the Dominican Republic. The capital city is San Fernando de Monte Cristi (usually simply Monte Cristi). The spelling Montecristi is also seen. ==Name== When Christopher Columbus visited for the first time the northern coast of the Hispaniola island, he saw on 4 January 1493 a mountain with the shape of a dromedary and named it as Monte Cristo or Monte Christi (\"Mountain of Christ\") to this mountain now known as El Morro, close to the city of San Fernando de Monte Cristi. ==History== Nicolás de Ovando founded a small fishing hamlet in the place where is now Monte Cristi. In 1533, Juan de Bolaños brought a group of 60 families from the Canary Islands to live in the place. In 1545, other 30 families to live here. The town was destroyed in 1606 by order of the Spanish Crown and the inhabitants were moved, together with the inhabitants of Puerto Plata inhabitants, away from the northern coast to form the new town of Monte Plata. In 1751, Monte Cristi was founded again by order of Ferdinand VI, king of Spain. Monte Cristi was made as a Maritime District (a special administrative category similar to a province and that has been abandoned) in 1879. The 1907 Dominican Constitution changed its status to province. It was part of the Santiago province before being elevated to the category of province. Guayubín is a municipality since 1855, Villa Vásquez since 1938, Pepillo Salcedo since 1949, Castañuelas since 1974 and Las Matas de Santa Cruz since 1985. Villa Elisa and Hatillo Palma became municipal districts in 1997, Cana Chapetón in 1999 and Palo Verde in 2002. ==Location== The Monte Cristi province is bordered to the north and est by the Atlantic Ocean, to the east by the Puerto Plata and Valverde provinces and to the south by the Dajabón and Santiago Rodríguez provinces. ==Population== In (last national census), there were people living in the Monte Cristi province, and 58,224 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 21st (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 114,624 inhabitants. The largest city of the province is Monte Cristi, its head municipality or capital, with a population (in ) of 24,644 inhabitants. ==Geography== The Monte Cristi province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 9th (out of 31 plus the National District) largest province. The altitude of San Fernando de Monte Cristi, provincial capital, is above sea level. The Monte Cristi province is in the northwestern part of the Cibao Valley; this part is also called the Yaque del Norte Valley or Línea Noroeste and is very dry because it does not rain much here. The most important river in the province is the Yaque del Norte, the longest river of the Dominican Republic. Other rivers are Guayubín and Maguaca, tributaries of the Yaque del Norte. The Cordillera Septentrional (\"Northern mountain range\") runs along the northern coast of the province; there are not high mountains, only low hills. At the western end of this mountain range is the \"El Morro\" mountain, forming a headland or a small peninsula. ===Climate=== The climate of the province is a tropical climate, hot most of the year. ==Municipalities== There are six municipalities and four municipal districts (M.D.) in the province. Municipalities of the Monte Cristi province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) San Fernando de Monte Cristi (150101) San Fernando de Monte Cristi (150101) 24,644 517.4 16 Monte Cristi (150100) Monte Cristi (150100) 24,644 517.4 Castañuelas (150201) Castañuelas (150201) 9,468 50.6 21 Palo Verde (150202) 5,453 36.1 17 Castañuelas (150200) Castañuelas (150200) 14,921 86.8 Guayubín (150301) Guayubín (150301) 12,464 263.3 39 Villa Elisa (150302) 7,430 215.4 87 Hatillo Palma (150303) 8,802 133.3 71 Cana Chapetón (150304) 7,227 222.0 60 Guayubín (150300) Guayubín (150300) 35,923 834.0 Las Matas de Santa Cruz (150401) Las Matas de Santa Cruz (150401) 10,559 71.9 46 Las Matas de Santa Cruz (150400) Las Matas de Santa Cruz (150400) 10,559 71.9 Pepillo Salcedo (150501) Pepillo Salcedo (150501) 9,136 151.2 11 Pepillo Salcedo (150500) Pepillo Salcedo (150500) 9,136 151.2 Villa Vásquez (150601) Villa Vásquez (150601) 14,424 224.6 40 Villa Vásquez (150600) Villa Vásquez (150600) 14,424 224.6 Monte Cristi (150000) Monte Cristi (150000) 1885.8 == Economy == The main economic activity in the province is farming and banana and rice are grown here. Fishing and salt production is also important in the capital city of San Fernando de Monte Cristi. ==References== Category:Provinces of the Dominican Republic Category:1879 establishments in North America Category:19th-century establishments in the Spanish West Indies",
 "title": "Monte Cristi Province"
}