{
 "id": "179698",
 "text": "Orlando Peçanha de Carvalho (20 September, 1935 – 10 February, 2010) is a former Brazilian football player. He has played for Brazil national team. With the Brazilian national team he became world champion in 1958. At club level, he has played in Brazil with CR Vasco da Gama and FC Santos and in Argentina with Boca Juniors great achievements. With his powerful style of play and ability to read the game, he is regarded as one of the best defenders in Brazilian football history. ==Club career== Orlando started his professional career in 1953 with the Vasco da Gama club where he played until 1961, winning 2 Rio championships and the Rio São Paulo tournament. In February 1961, he made his debut with Boca Juniors, in which he played 119 matches (105 in the league and 14 in the Copa Libertadores ), but did not score a single goal. With Boca, the team that he took to the field with the captain's armband, he won 3 Argentine championships. In 1965, Orlando returned to Brazil and began playing for Santos. With Santos, Orlando won 4 Paulista championships, Rio São Paulo tournament, Copa Brazil, Roberto Gómez Pedrosa and Recopa Sudamericana Tournament Orlando ended his career in 1970, playing for his first club, Vasco da Gama, for three months. ==International career== In May 1958, Orlando Peçanha also made his national team debut. In São Paulo, the Seleção won 3-1 against Bulgaria. A month later he was taken on a trip to Sweden for the 1958 FIFA World Cup. There Orlando Peçanha, together with Bellini, formed the defensive backbone of the Seleção, who impressed the world with the brilliant attacking players Garrincha, Didi, Vavá, Zagallo and the 17-year-old Pelé and brought the title to Brazil for the first time with a brilliant 5-2 final victory over Sweden. In 1959 he took part in the Copa America in Argentina with Brazil. When the score was 0-1, he was dismissed from the field in the game against Uruguay along with another Brazilian and two Uruguayans. Brazil ended up winning 3-1. Overall, it was only enough for second place behind the hosts. In 1960 he won the Taça do Atlântico with the Seleção, in which the national teams of Argentina, Uruguay and Paraguay also took part that year. He was not considered for the 1962 FIFA World Cup in Chile because he played abroad. 1966 FIFA World Cup, Orlando Peçanha was again in Brazil's squad. But he was only used once. Deputizing for Bellini, he was captain of the Brazilian team that lost the decisive group game against Portugal with players like Eusébio and Mário Coluna 3-1 and thus had to say goodbye to the tournament. With his only defeat in the national jersey, his international career ended at this point. In total he made 31 appearances for Brazil. == Club career statistics == |- |1961||rowspan=\"5\"|Boca Juniors||rowspan=\"5\"|Primera División||26||0 |- |1962||28||0 |- |1963||20||0 |- |1964||30||0 |- |1965||1||0 105||0 105||0 |} == International career statistics == |- !Total||31||0 |} ==Honours== ===Club=== ;Vasco da Gama *Copa Internacional Rivadavia: 1953 *Campeonato Carioca: 1956, 1958 *Torneio Internacional de Paris: 1957 *Torneio Internacional do Chile: 1957 ;Boca Juniors *Campeonato Argentino: 1962, 1964 ;Santos *Campeonato Paulista: 1965, 1967 *Taça Brasil de Futebol: 1965 ===International=== ;Brazil *FIFA World Cup: 1958 *Taça Oswaldo Cruz: 1958, 1961, 1962 *South American Championship: 1959 *Taça Bernardo O'Higgins: 1959 *Taça do Atlântico: 1960 *Roca Cup: 1960, 1963 ===Individual=== *FIFA World Cup All-Star Team: 1958 *World Soccer World XI: 1965 == References == Category:1935 births Category:Footballers from Niterói",
 "title": "Orlando Peçanha"
}