{
 "id": "179645",
 "text": "Monte Plata is a province of the Dominican Republic; its capital city has the same name, Monte Plata. It was split from San Cristóbal in 1982. ==Name== The province was given the name of the capital city, Monte Plata. In colonial times, people from Monte Cristi and Puerto Plata came to live to this region by orders of the Spanish king and gave to the town a new name that comes from the two original towns, Monte Plata. ==History== After the Dominican independence from Haiti in 1844, this region was part of the old Santo Domingo Province. During the Restoration War against Spain (1861 - 1865), there were several important battles in the region. In 1932, the region was made part of the new San Cristóbal province and then it was made a province with the name of Monte Plata but soon the name was changed to Monseñor Meriño after the Archbishop Fernando Arturo de Meriño, who was President of the Dominican Republic in 1880-1882. Then, in 1944, the province was made part of the San Cristóbal province again until 1982 when the new Monte Plata province was created with the municipalities of Monte Plata, Sabana Grande de Boyá, Yamasá and Bayaguana. In 2004, Peralvillo became a municipality. Don Juan became a municipal district in 1987, Gonzalo in 1997, Los Botados in 1998, Majagual in 2001, Chirino in 2002, Boyá in 2004 and Mamá Tingó in 2010. ==Location== The Monte Plata province is in the centre of the country. To the north, it has the Sánchez Ramírez, Duarte and Samaná provinces; to the east, the Hato Mayor and San Pedro de Macorís; to the south, the Santo Domingo province; and to the west, the San Cristóbal and Monseñor Nouel provinces. ==Population== In (last national census), there were people living in the Monte Plata province, and 91,838 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 15th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 189,166 inhabitants. The largest city of the province is Bayaguana, with an urban population (in ) of 20,303 inhabitants. The capital of the province, Monte Plata, has an urban population of 16,115 inhabitants. ==Geography== The Monte Plata province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 5th (out of 31 plus the National District) largest province. The altitude of Monte Plata, provincial capital, is above sea level. The Sierra de Yamasá is found to the east and north of the province. Los Haitises is a karstic region found in the northwestern part of the province; most of it is now a national park. The river Ozama is the most important river in the province. Other rivers are Yabacao, Yamasá, Comate, Mijo and Guanuma, all tributaries of the Ozama. ===Climate=== The Monte Plata province has a tropical wet climate with no dry or cold season as it is constantly moist. ==Municipalities== There are five municipalities and seven municipal districts (M.D.) in the province. Municipalities of the Monte Plata province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) Monte Plata (290101) Monte Plata (290101) 26,192 264.4 53 Don Juan (290102) 7,313 102.9 61 Chirino (290103) 7,951 127.2 20 Boyá (290104) 5,267 136.7 91 Monte Plata (290100) Monte Plata (290100) 46,723 631.1 Bayaguana (290201) Bayaguana (290201) 31,889 873.0 50 Bayaguana (290200) Bayaguana (290200) 31,889 873.0 Sabana Grande de Boyá (290301) Sabana Grande de Boyá (290301) 23,630 216.9 286 Gonzalo (290302) 5,222 207.7 295 Majagual (290303) 2,244 102.6 211 Sabana Grande de Boyá (290300)) Sabana Grande de Boyá (290300)) 31,096 527.3 Yamasá (290401) Yamasá (290401) 29,198 260.3 52 Los Botados (290402) 16,228 68.5 106 Mamá Tingó (290403) 9,922 105.5 137 Yamasá (290400)) Yamasá (290400)) 55,348 434.2 Peralvillo (290501) Peralvillo (290501) 20,900 136.0 121 Peralvillo (290500)) Peralvillo (290500)) 20,900 136.0 Monte Plata (290000) Monte Plata (290000) 2,601.6 ==Economy== The most important economic activity of the province is farming. Some important crops are sugar cane, cacao and fruits like orange. Cattle raising is also very important. ==References== Category:Provinces of the Dominican Republic Category:1982 establishments in North America Category:1980s establishments in the Dominican Republic",
 "title": "Monte Plata Province"
}