{
 "id": "179763",
 "text": "San Cristóbal is a province of the Dominican Republic. It is along the south coast of the country. Its capital city has the same name, San Cristóbal. ==Name== The province has the name of the capital city, San Cristóbal, but it was created with the name Trujillo, after the dictator Rafael Trujillo, who was born in that city. ==History== The province of San Cristóbal was created on 1932 with the municipalities of San Cristóbal, Baní, Monte Plata, Yamasá, Villa Mella, La Victoria, San José de Ocoa and Bonao; its capital was the city of San Cristóbal. In 1934, the name was changed to Provincia Trujillo with the municipalities of San Cristóbal, Baní, Monte Plata, Yamasá, Villa Mella, La Victoria, Guerra and Bayaguana. In 1961, the name was changed again to the present one, Provincia San Cristóbal. When the Monte Plata province was created in 1982, the San Cristóbal province had the municipalities of San Cristóbal, Villa Altagracia, Bajos de Haina and Yaguate, and the municipal districts of Cambita Garabitos and Sabana Grande de Palenque. Cambita Garabitos became a municipality in 1987, Sabana Grande de Palenque in 1997, San Gregorio de Nigua in 2001 and Los Cacaos in 2004. In 2004, Hato Damas became a municipal district; El Carril in 2001; San José del Puerto, Medina and La Cuchilla in 2002; and Cambita el Pueblecito in 2005. ==Location== The San Cristóbal province is in the southern part of the country. It is bordered to the north by the Monseñor Nouel province, to the northeast by the Monte Plata province, to the east by the Santo Domingo province and to the west by the Peravia and San José de Ocoa province. The Caribbean Sea is to the south. ==Population== In (last national census), there were people living in the San Cristóbal province, and 295,539 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 4th (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 611,677 inhabitants. The largest city of the province is San Cristóbal, its head municipality or capital, with an urban population (in ) of 138,455 inhabitants. ==Geography== The San Cristóbal province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 19st (out of 31 plus the National District) largest province. The altitude of the city of San Cristóbal, provincial capital, is above sea level. The most important rivers are: #Haina, in the eastern border of the province; #Nigua, that crosses the provincial capital city; and #Nizao, in the western border of the province. ==Municipalities== There are 8 municipalities and 6 municipal districts (M.D.) in the province. Municipalities of the San Cristóbal province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) San Cristóbal (210101) San Cristóbal (210101) 216,875 153.6 49 Hato Damas (210102) 15,894 59.1 143 San Cristóbal (210100) San Cristóbal (210100) 232,769 212.6 Sabana Grande de Palenque (210201) Sabana Grande de Palenque (210201) 15,466 30.0 19 Sabana Grande de Palenque (210200) Sabana Grande de Palenque (210200) 15,466 30.0 Bajos de Haina (210301) Bajos de Haina (210301) 83,582 12.7 2 El Carril (210302) 40,611 27.0 52 Bajos de Haina (210300) Bajos de Haina (210300) 124,193 39.7 Cambita Garabitos (210401) Cambita Garabitos (210401) 20,655 136.9 182 Cambita el Pueblecito (210402) 10,402 35.8 192 Cambita Garabitos (210400) Cambita Garabitos (210400) 31,057 172.8 Villa Altagracia (210501) Villa Altagracia (210501) 53,576 173.6 198 San José del Puerto (210502) 14,493 124.7 273 Medina (210503) 7,066 31.9 78 La Cuchilla (210504) 9,177 95.9 444 Villa Altagracia (210500) Villa Altagracia (210500) 84,312 426.2 Yaguate (210601) Yaguate (210601) 42,325 122.3 54 Yaguate (210600) Yaguate (210600) 42,325 122.3 San Gregorio de Nigua (210701) San Gregorio de Nigua (210701) 30,268 51.1 8 San Gregorio de Nigua (210700) San Gregorio de Nigua (210700) 30,268 51.1 Los Cacaos (210801) Los Cacaos (210801) 9,540 185.9 555 Los Cacaos (210800) Los Cacaos (210800) 9,540 185.9 San Cristóbal (210000) San Cristóbal (210000) 1,240.6 ==References== Category:Provinces of the Dominican Republic Category:1932 establishments in North America Category:1930s establishments in the Dominican Republic",
 "title": "San Cristóbal Province"
}