{
 "id": "179833",
 "text": "The cross product is a mathematical operation which can be done between two three-dimensional vectors. It is often represented by the symbol \\times. After performing the cross product, a new vector is formed. The cross product of two vectors is always perpendicular (it makes a corner-shaped angle) to both of the vectors which were \"crossed\". This means that cross product normally works only in three-dimensional space; that is, anywhere where you can go up or down, left or right, and forward or backwards. ==Information about vectors== A vector is information that describes two things: which way (direction), and how much (magnitude). Usually, the simplest vector can be an arrow. How long is the line, and which way does the line and the pointed end of the arrow go? ==Importance of the cross product== Being a vector operation, the cross product is extremely important in all sorts of sciences (particularly physics), engineering, and mathematics. One important example of the cross product involves torque (pushing or pulling in a circle, like twisting off a bottle cap.) or moment. Another important application involves the magnetic field. ==Visualizing the cross product in three dimensions== The cross product of \\vec{a} and \\vec{b} is a vector that we shall call \\vec c: : \\vec{c}=\\vec{a} \\times \\vec{b} The vector \\vec a\\times\\vec b is perpendicular to both \\vec a and \\vec b. The direction of \\vec a\\times\\vec b is determined by a variation of the right-hand rule. By holding your right hand as shown in the picture, your thumb points in the direction of \\vec c (the cross product of \\vec a and \\vec b), with the index finger pointing in the direction that \\vec a points, and the middle finger pointing in the direction that \\vec b points. If the angle between the index (your pointer finger) and middle (second finger away from your thumb) fingers is greater than 180°, then you need to turn the hand upside down. ==How to calculate the cross product in vector notation== Like most mathematical operations, the cross product can be done in a straightforward way. ===Two dimensions=== Since cross products usually only work for three-dimensional vectors, the calculation of cross product in two dimensions thinks of the vectors as if they are on a flat surface (like a sheet of paper) in three dimensions (like a room or a large cube). More specifically, if \\vec{a} = \\langle a_1,a_2 \\rangle and \\vec{b} = \\langle b_1,b_2 \\rangle then \\vec{a} \\times \\vec{b} = (a_1b_2-a_2b_1)\\hat{k} or \\vec{a} \\times \\vec{b} = \\vec{c} and \\vec{c} = \\langle 0,0,a_1b_2-a_2b_1 \\rangle = (a_1b_2-a_2b_1)\\hat{k} where \\hat{k} is just a symbol indicating that the new vector is pointing up (in the z-direction). If one \"crosses\" two vectors which are both in the xy-plane, then the product, being perpendicular to both vectors, must point in the z direction. If the value of a_1b_2-a_2b_1 is positive, then it points out of the page; if its value is negative, then it points into the page. ===Three dimensions=== There are two ways to find the cross product of two 3D vectors: with coordinate notation or with an angle. ====Coordinate notation==== Given vectors \\vec a and \\vec b, where \\vec{a} = \\langle a_1, a_2, a_3 \\rangle and \\vec{b} = \\langle b_1, b_2, b_3 \\rangle Then the cross product of \\vec a and \\vec b is: \\vec{a} \\times \\vec{b} = \\langle a_2 b_3 - a_3 b_2, a_3 b_1 - a_1 b_3, a_1 b_2 - a_2 b_1 \\rangle. ====With an angle==== Given vectors \\vec a and \\vec b, where \\vec{a} = \\langle a_1, a_2, a_3 \\rangle and \\vec{b} = \\langle b_1, b_2, b_3 \\rangle Then the cross product of \\vec a and \\vec b is: \\vec{a} \\times \\vec{b} = \\left\\| \\mathbf{a} \\right\\| \\left\\| \\mathbf{b} \\right\\| \\sin (\\theta) \\ \\mathbf{n}, where \\theta is the angle between \\vec a and \\vec b, ‖a‖ and ‖b‖ are the magnitudes of vectors \\vec{a} and \\vec{b}, and n is a unit vector perpendicular to the plane containing \\vec{a} and \\vec{b}. ==Basic properties of the cross product== * Anti-commutativity: \\vec{a} \\times \\vec{b} = -\\vec{b} \\times \\vec{a} * Distributivity over addition: \\vec{a} \\times (\\vec{b} + \\vec{c}) = \\vec{a} \\times \\vec{b} + \\vec{a} \\times \\vec{c} * Scalar commutavity: c(\\vec{a} \\times \\vec{b}) = (c\\vec{a})\\times\\vec{b} = \\vec{a}\\times(c\\vec{b}) == Related pages == * Cartesian product * Dot product == References == Category:Linear algebra Category:Vectors",
 "title": "Cross product"
}