{
 "id": "180295",
 "text": "José Carlos Bauer (21 November 1925 – 4 February 2007) was a former Brazilian football player. He has played for the Brazilian national team. He was widely considered as one of the greatest midfielders of all time. He was known as a skillful playmaker who was a good passer on the ball and was also renowned for his marking and tackling. He was also renowned of his pinpoint passing, covering, dribbling, physical power and his intelligence. His nicknames were \"The Maracanã Monster\" and \"The Giant of Maracanã\" because of his peformances during the 1950 FIFA World Cup. ==Early life== Born in São Paulo on 21 November 1925, he was the son of a Swiss father and an African-Brazilian mother. He asked to play football and his parents wanted him to be a footballer, he joined São Paulo youth academy in 1938. ==Club career== At the club level, Bauer's career was linked to the São Paulo team, with whom he played for 13 years, winning six state championships, with 429 matches and 16 goals. Here he formed together with Zarzur and Noronha and then with Rui and Noronha a famous and appreciated trio of midfield reproposed also in the national team, whose members were renamed \"The three musketeers\". Bauer was a player who had a lot of skill with the ball and, therefore, acted as a midfielder. Although physically strong, he played classic and elegant football. In 1956 he had two fleeting experiences with Garrincha and Nílton Santos' Botafogo and with Portuguesa, and then ceased his competitive activity with São Bento in 1958. ==International career== While at São Paulo, Bauer was called up for the Brazilian national team he took part in the victory of the Copa América in 1949. The following year he participated in the World Cup that Brazil organized at home, losing the final against Uruguay. Bauer was considered by critics as one of the best players in the competition together with his compatriot Zizinho and his good performances combined with his playing style earned him the nickname \" Gigante do Maracanã \", attributed to him by radio commentators and he was included in the Team of the tournament. With the Seleção also won the Pan American Championship in 1952. During the Copa América in 1953 Bauer made a formidable midfield trio with Bigode and Danilo, he showed one of his best style of play and Brazil finished as runners-up. He was one of the few among those called up for that edition to participate in the next World Cup in 1954, when he held the role of team captain. He retired from international football in 1955 after he won the Taça Oswaldo Cruz with Brazil, he turned down a chance to participate at the 1956 Copa América. He played in 29 matches and scored just once. ==International career statistics== |- |1949||6||0 |- |1950||10||0 |- |1951||0||0 |- |1952||2||0 |- |1953||6||1 |- |1954||4||0 |- |1955||1||0 |- !Total||29||1 |} ==Managerial career== As a coach he directed several Brazilian and foreign teams, with experiences in Colombia, Mexico and Portugal, achieving particular success. Later he also received an invitation to coach in Japan. During this phase of his career he also had the opportunity to discover first of all Eusébio 's talents. When he was sitting on the Ferroviária bench in 1960, Bauer took part in a tour in Mozambique, during which he noticed the future Golden Ball. The coach pointed him out to Béla Guttman, his coach at the time of São Paulo, then moved to Benfica, who took him to Lisbon. ==Death== Bauer died on February 4, 2007 at the age of 81 in São Paulo due to Alzheimer's disease. He was buried in the Ras cemetery near Morumbi ==Honours== ===Club=== As Player São Paulo *Campeonato Paulista: 1943, 1945, 1946, 1948, 1949, 1953 *Small World Cup: 1955 As Coach Atlas *Copa México: 1962 *Campeón de Campeones: 1962 ===International=== Brazil *South American Championship: 1949 *Panamerican Championship: 1952 *FIFA World Cup Runner-up: 1950 *South American Championship Runner-up: 1953 *Copa Rio Branco: 1950 *Taça Oswaldo Cruz: 1950, 1955 *O'Higgins Cup: 1955 ===Individual=== *FIFA World Cup All- Star Team: 1950 *IFFHS Brazilian Player of the 20th Century (25th place) *IFFHS South American Player of the 20th Century (45th place) *Brazilian Football Museum Hall of Fame == References == Category:1925 births Category:2007 deaths Category:Footballers from São Paulo",
 "title": "Bauer (footballer)"
}