{
 "id": "180297",
 "text": "Oswaldo da Silva (14 January 1926 – 25 March 1997), commonly known as Baltazar, was a Brazilian footballer. He has played for Brazil national team. He was given the nickname Cabecinha de Ouro (Golden Head) by fans. Baltazar played as a striker. He was consecrated as a player for Corinthians Paulista team from São Paulo, his main characteristic was the header of the ball to the goal. Baltazar came to recognize that he was so good technically, but according to the player himself, with his head, not even Pelé was as efficient as he was. He scored 267 goals, of which 71 with his head, which earned him the nickname \"Cabecinha de Ouro\" (Golden Head) by his fans because of his skill in the air. Widely considered as one of the best strikers of all time. He was renowned for his finishing, speed, acceleration and ability to read the game. ==Club career== He started his professional career at União Monte Alegre and then Jabaquara, with his good performances and goals he soon drew the attention of a great club in the capital, Corinthians Paulista. Baltazar arrived at Corinthians in 1945, he started as a right midfielder, but soon moved to a center forward, a position in which he established himself. He played for Corinthians for 12 years, until 1957. He was present in the Rio-São Paulo titles in 1950, 1953 and 1954; and also in the two-time São Paulo championship in 1951 and 1952 and in the conquest of the São Paulo 4th Centenary of the City of São Paulo in 1954. In 1957, at the end of his career, he moved to Juventus, returned to Jabaquara and ended his career at União Paulista in 1959. ==International career== Baltazar was a Brazilian international and took part in the 1950 and 1954 World Cups. The 1950 World Cup on home soil was tragic: in the decisive game, a draw would have been enough for Brazil to win the title, but they lost to Uruguay 2-1 but he did not play. Baltazar scored twice in the tournament, was among four players remaining in the Brazil squad in 1954. In Brazil's qualification for the 1954 World Cup, he scored five of Brazil's eight goals. Baltazar scored once at the 1954 World Cup in Switzerland. Brazil were eliminated by top favorites Hungary in the quarterfinals. The game in the Wankdorf Stadium was canceled due to numerous unsportsmanlike behaviors during and after the game Battle of Bern in World Cup history. Two years later he was selected to play for Brazil in the Copa América 1956 but the national team did not perform well. He played 31 matches and scored 17 goals for the national team. ==Death== He died in 1997 at the age of 71. ==Honours== ; Corinthans *Torneio Rio–São Paulo: 1950, 1953, 1954 *Campeonato Paulista: 1951, 1952, 1954 ; Brazil *Panamerican Championship: 1952 *Copa América Runner-up: 1953 *FIFA World Cup runner-up: 1950 ==References== Category:1926 births Category:1997 deaths Category:Footballers from Santos, São Paulo Category:Brazil at the 1950 FIFA World Cup Category:Brazil at the 1954 FIFA World Cup",
 "title": "Baltazar (footballer, born 1926)"
}