{
 "id": "180298",
 "text": "José Lázaro Robles (11 February 1924 – 7 May 1996) is a former Brazilian football player. He has played for Brazil national team. He is regarded as one of the best football players of all time. He first played as a midfielder, on the left wing, but when he moved to Vasco he was advanced to the left winger position. He had among his strong points the precision in the shot, usually made with the left foot. Considered one of the best left-footed players ever, who was renowned for scoring goals, dribbling and a skillful player on the ball. ==Club career== Pinga started his career with Portuguesa, which at the time had one of the strongest teams in club history with players such as Djalma Santos, Brandãozinho, Simão and Julinho. In 1952 the club won the prestigious Torneio Rio-São Paulo. After this he switched to Vasco da Gama from the then capital Rio de Janeiro and would play there for 8 years. He also won the Torneio Rio-São Paulo, twice the Campeonato Carioca and in 1957 the Tournoi de Paris. He was also the club's top scorer for five seasons. From the 1960s, his career deteriorated sharply. In the season, he scored only once. He ended his career at Juventus. ==International career== In 1950, he was called up for the first time to the Brazilian national team, although he was a reserve team, called up for the Oswaldo Cruz Cup, against Paraguay. Pinga scored three of Brazil's five goals (2–0 win and 3–3 draw) and helped the national team to be champions. Many of the players in this selection ended up being called up by coach Flávio Costa to compete in the 1950 World Cup, but Pinga was left out. He also played for the national team. In 1952 he won the 1952 Pan American Football Championship with the Seleção. A year later, he played at the 1953 South American Championship, where he scored twice in the 8-1 win over Bolivia. A year later he also played at the 1954 FIFA World Cup. Here he scored the 3-0 and 4-0 against Mexico in the opening game. ==Death== Pinga died on May 7, 1996 due brain tumor, he was only 72. Category:1924 births Category:1996 deaths Category:Footballers from São Paulo",
 "title": "Pinga (footballer, born 1924)"
}