{
 "id": "180236",
 "text": "Santo Domingo is a Dominican province. It is in the southern part of the country, on the Caribbean coast. Its capital city is Santo Domingo Este. ==Name== The Santo Domingo province is named after the city of Santo Domingo, which has been always the capital city of the country. ==History== The province was created on 16 October 2001. It was part of the Distrito Nacional (National District) before being elevated to the category of province with most of the territory of the old Distrito Nacional. The new province had the municipalities of Santo Domingo Este, Santo Domingo Oeste, Santo Domingo Norte and Boca Chica. San Antonio de Guerra became a municipality in 2004, and Pedro Brand and Los Alcarrizos in 2005. The municipal districts of the province were created in: * 2001: La Victoria * 2004: Hato Viejo, San Luis and La Caleta * 2005: Palmarejo-Villa Linda, Pantoja, La Guáyiga and La Cuaba ==Location== The Santo Domingo province is bordered to the north by the province of Monte Plata, to the east by the San Pedro de Macorís province, to the south by the Caribbean Sea and to the west by San Cristóbal. ==Population== In (last national census), there were people living in the Santo Domingo province, and 2,084,651 () living in towns and cities. The population density was persons/km². Its population represents of the total population of the country and the province is ranked as the 1st (out of 31 plus the National District) more populated province. , the total estimated propulation of the province is 2,702,028 inhabitants. The largest urban area of the province is Santo Domingo Este, its head municipality or capital, with an urban population (in ) of 851,853 inhabitants. ==Geography== The Santo Domingo province has a total area of . It has of the area of the Dominican Republic and it is ranked as the 16th (out of 31 plus the National District) largest province. The altitude of the provincial capital, Santo Domingo Este, is above sea level. The Santo Domingo province is in the \"Llano Costero del Caribe\" (\"Caribbean Coastal Plain\"), a large plain in southeastern Dominican Republic. There are not mountains in the province, only some low hills. The most important rivers are Haina, that makes the western border of the province, and the Ozama with its tributary La Isabela and that separates the province from the Distrito Nacional. ===Climate=== The climate of the province is a tropical climate, hot most of the year. ==Municipalities== There are 7 municipalities and 8 municipal districts (M.D.) in the province. Municipalities of the Santo Domingo province Municipality (code) Municipal Districts (code) Population (2010) Area (km2) Density Altitude (m) Santo Domingo Este (320101) Santo Domingo Este (320101) 891,952 123.3 35 San Luis (320102) 56,933 45.9 15 Santo Domingo Este (320100) Santo Domingo Este (320100) 948,885 169.2 Santo Domingo Oeste (320201) Santo Domingo Oeste (320201) 363,321 54.0 25 Santo Domingo Oeste (320200) Santo Domingo Oeste (320200) 363,321 54.0 Instituto (320102) 56,933 45.9 15 Santo Domingo Norte (320301) Santo Domingo Norte (320301) 468,468 172.1 35 La Victoria (320302) 60,922 215.8 20 Santo Domingo Norte (320300) Santo Domingo Norte (320300) 529,390 387.9 Boca Chica (320401) Boca Chica (320401) 78,882 106.5 1 La Caleta (320402) 63,137 34.3 12 Boca Chica (320400) Boca Chica (320400) 142,019 140.9 San Antonio de Guerra (320501) San Antonio de Guerra (320501) 38,215 228.8 22 Hato Viejo (320502) 5,748 54.9 20 San Antonio de Guerra (320500) San Antonio de Guerra (320500) 43,963 283.7 Los Alcarrizos (320601) Los Alcarrizos (320601) 206,557 31.8 53 Palmarejo-Villa Linda (320602) 16,099 7.2 38 Pantoja (320603) 50,120 6.2 39 Los Alcarrizos (320600) Los Alcarrizos (320600) 272,776 45.2 Pedro Brand (320701) Pedro Brand (320701) 40,970 54.6 69 La Guáyiga (320702) 23,222 26.9 46 La Cuaba (320703) 9,824 139.9 92 Pedro Brand (320700) Pedro Brand (320700) 74,016 221.4 Santo Domingo (320000) Santo Domingo (320000) 1,302.2 ==Economy== It is the province of highest economic activity in the country, with many industries and companies in its territory. Tourism is an important activity in Boca Chica because there is a beach with white sand. ==References== Category:Provinces of the Dominican Republic Category:2001 establishments in the Dominican Republic",
 "title": "Santo Domingo Province"
}