{
 "id": "180286",
 "text": "Dino Sani (born 23 May 1932) is a former Brazilian football player. He has played for Brazil national team. Right half-winger and playmaker, Sani was a true beacon of midfield, being gifted with a remarkable vision of the game, the result of his innate instinct, which allowed him to always identify the best placed man to direct his unmarked throws. He was known for his skill with the ball at his feet, his technique, intelligence in passing and creativity in setting up plays. In possession of great ball control, he was considered to be one of the greatest midfielders in São Paulo and Milan history and he is regarded as one of the best football players of all time. He was particularly skilled in fast and tight rallies, thus compensating for a certain basic togetherness. Far from being an individualist, he was a true team player. ==Early life== He was born on May 23, 1932 in Sao Paulo to Gaetano Sani and Maria Gabrielli. ==Club career== A pupil of the football school of the club \"Palmeiras\". He began his adult football career in 1949 in the main team of the same club. Gino Orlando began his career with him at Palmeiras. He then performed at the Antarctic Park, 15 Di Jau and Commercial (Sao Paulo) clubs. With his game for the last team, he attracted the attention of the coaching staff of the club \"Sao Paulo\" , which he joined in 1956, repeating the path of his teammate Gino Orlando, who a year earlier moved to the club from Sao Paulo and achieved significant success. He played for the team from Sao Paulo for the next five seasons of his playing career. Most of his time with Sao Paulo, he was a key player for the team. As part of Sao Paulo, he was one of the team's top scorers, averaging 0.34 goals per game. In 1957 he won the Paulista League. In São Paulo, he played with Zizinho and Canhoteiro, and later became recognized one of the best midfielders in the club's history. In 1959, Boca Juniors bought Dean's contract from Sao Paulo for $ 1 million, and the player became the sixth Brazilian in the Argentine club at the time (including Paulo Valentino). In 1961, when Boca Juniors began to consider him a veteran, he was sold to Milan, and a few days later he made his debut in a Roso-Nero shirt in a match against Juventus, ousting the Englishman from challenging character, Jimmy Greaves. Since then, and until the end of the championship, in which Milan celebrated the \"Scudetto\" in the 1961/62 season, he came on the field several times. Considered the successor of Gunnar Gren, Sani with the Milan club also won the European Champions Cup in 1963. Playing for Milan, he also mostly played for the main team. At the end of the 1963/64 season, he was forced to return to Brazil to recover from an illness that Dino began suffering from while performing in Italy. Sani signed a contract with Corinthians Paulista, for which he played during 1964–1966. During this time, he played twice as many matches as in \"Milan\", and also scored twice as many goals as in the shirt of the Italian club. ==International career== In 1957 he made his debut in official matches as part of the Brazilian national team. During his career in the national team, which lasted 9 years, he played only 15 matches for the national team, scoring 1 goal (in addition, he played 9 matches in unofficial friendly matches and scored 3 goals). As part of the national team he participated in the 1957 South American Championship in Peru, where he won silver with the team, the 1958 World Cup in Sweden (he played the first two matches in the tournament, then replaced by Zito), winning the title that year world champion, and the 1959 South American Championships in Argentina, where he won silver with the team. During his performances in Italy, he received an invitation to the Italian national team to participate in the 1962 FIFA World Cup, but Dino refused, waiting for a call to the Brazilian national team. He was left out for the 1966 FIFA World Cup. ==Managerial career== He began his coaching career, immediately after the end of the player's career, in 1969 at Corinthians, but the team was disqualified due to \"doubtful\" matches. His work was not very noticeable, as under his leadership the team won regional trophies, but the Brazilian federation was positive and on the eve of the 1970 World Cup he was offered to replace the disgraced coach Joao Soldane at the helm of the Brazilian national team. But due to friendly relations with the latter, Dino Sani refused this offer. Returning to football after a short break, in 1971, heading the coaching staff of the club \"International\". For three years in a row, he and his team won the championship, which he recalls was Dino's best experience in his coaching career. In 1975 he became the head coach of the Palmeiras team, coaching the team from Sao Paulo for only one year. In 1978, he won the Uruguayan Championship with Peñarol, and then coached the Qatari national team, which had a salary of about sixty million lire a month and almost led it to the 1990 World Cup. Later, in 1981, he headed the coaching staff of the club \"Flamengo\". In 1982 he accepted an offer to work at the Fluminense club. He left the team from Rio de Janeiro in 1982. For one year, starting in 1983, he was the head coach of the International team. In 1984 he was invited by the management of Boca Juniors to lead his team, with which he worked for one year. During his coaching career, he also led the teams of Goiás and Coritiba. Currently, the last place of coaching was the club \"Gremio\", whose head coach was Dino Sani during 1991. ==Honours== ===Club=== ;Milan *Serie A: 1961–62 *European Cup: 1962–63 ===International=== ;Brazil *FIFA World Cup: 1958 *Copa América Runner-up: 1957, 1959 *Taça Oswaldo Cruz: 1958, 1961, 1962 *Roca Cup: 1957, 1960, 1963 *O'Higgins Cup: 1959, 1961 ===Individual=== *A.C. Milan Hall of Fame *São Paulo FC Hall of Fame ==References== Category:1932 births Category:Living people Category:Footballers from São Paulo Category:Brazilian football managers Category:Boca Juniors managers",
 "title": "Dino Sani"
}