{
 "id": "180346",
 "text": "Pragmatism is a way of thinking that sees language and ideas as tools to help us predict outcomes, solve problems, and take action, instead of simply describing or reflecting reality. Pragmatists believe that many big questions, like what knowledge, language, meaning, belief, and science are, should be understood based on their practical use and success. Pragmatism started in the United States in the 1870s, with key figures like Charles Sanders Peirce, William James, and John Dewey. In 1878, Peirce explained it with his \"pragmatic maxim,\" which says that to understand an idea, we should consider what practical effects it could have. This approach to ideas and actions is the core of pragmatism.Peirce, C.S. (1878), \"How to Make Our Ideas Clear\", Popular Science Monthly, v. 12, 286–302. Reprinted often, including Collected Papers v. 5, paragraphs 388–410 and Essential Peirce v. 1, 124–141. See end of §II for the pragmatic maxim. See third and fourth paragraphs in §IV for the discoverability of truth and the real by sufficient investigation. The term \"pragmatic\" comes from a Greek word meaning \"action\" or \"deed.\" Peirce is credited with developing the idea of pragmatism, and James was the first to use the term in print in 1898. Other early contributors, like Chauncey Wright and Nicholas St. John Green, helped shape the movement. Peirce believed that inquiry is only real when there is genuine doubt, and that understanding an idea means knowing the practical consequences of the object related to that idea. His focus was on how ideas could be tested and verified, which set pragmatism apart from other ways of thinking at the time. In the early 20th century, Peirce wanted to make his own version of pragmatism clear, calling it \"pragmaticism\" to show it was different from others’ ideas. While he agreed with other pragmatists on some points, like rejecting the idea that everything is predetermined, he also had key differences, particularly about truth and infinity. Pragmatism became popular again in the 1960s when philosophers like Quine and Sellars used it to challenge earlier ideas in philosophy. Later, thinkers like Richard Rorty continued to develop it. Today, there are different types of pragmatism, with some sticking closely to the ideas of Peirce, James, and Dewey, and others adapting it in new ways. ==Main ideas of pragmatism== * How We Know Things (Epistemology - Justification): Pragmatists believe that knowledge isn’t based on one core belief or fact that everything else depends on. Instead, they think that knowledge is more like a web where beliefs support each other. No single belief is more special than the others, which is different from other philosophies that believe in a solid foundation for all knowledge. * What Truth Is (Epistemology - Truth): Pragmatists have different ideas about truth. Some say that when we call something “true,” we aren’t saying it has some special “truth” property. Others say something is true if it is useful to believe. * What the World Is (Metaphysics): Pragmatists believe there are many ways to understand the world, not just one correct way. * How Science Works (Philosophy of Science): Pragmatists think that scientific ideas and theories should be judged by how well they help us explain and predict things, not by how perfectly they describe reality. * How Language Works (Philosophy of Language): Pragmatists don’t believe that language simply represents or mirrors the world. Instead, they think that the meaning of words and ideas comes from how they influence actions, behavior, and the connections between ideas. * Other Important Ideas: Pragmatists also often believe in things like empiricism (knowledge from experience), fallibilism (the idea that we can always be wrong), and verificationism (the belief that ideas must be tested). Some pragmatists also believe that truth and knowledge are relative, meaning they can change based on different perspectives, though this is debated among them. * Against Fixing Concepts as Unchangeable: John Dewey criticized philosophers for treating certain ideas, like the difference between mind and body, as fixed and absolute. He believed these ideas were created to solve problems and should not be treated as unchangeable truths. * Connecting Philosophy with Science: Pragmatists wanted to reform philosophy to be more scientific. They argued that other philosophers made human knowledge seem too disconnected from science. They believed that philosophy should focus on the relationship between what we know and the real world, rather than looking for absolute truths that go beyond science. * Doubting Intuition: C.S. Peirce, one of the founders of pragmatism, argued against the idea of intuition (knowing something instantly without reasoning). He believed that all knowledge comes from some kind of reasoning or inference, not from direct, unexplainable insight. * Critique of Traditional Philosophy: Richard Rorty and W.V. Quine criticized traditional philosophy for trying to find absolute certainty in knowledge, which they believed was unrealistic and separated from scientific practice. They thought philosophy should be more connected to how science works, focusing on inquiry and evidence instead of chasing after perfect knowledge. ==Theory of Truth and Knowledge== Pragmatism looks at knowledge in a different way from earlier philosophies. Some earlier thinkers, like Schopenhauer, thought that what is useful for survival might be different from what is actually true. They saw truth as something above and separate from how we deal with the world. Pragmatists disagree, saying that knowledge is tied to how organisms (including humans) interact with their environment. \"Real\" and \"true\" are ideas that make sense only when we think about them in the context of this interaction. Pragmatism recognizes there is an external world we must deal with, but it doesn't treat truth as something separate from our experiences and inquiries. William James, a key pragmatist, was often misunderstood when he said things like \"truth's cash value\" and that the \"true is only the useful in our thinking.\" Critics made it sound like he believed anything useful was true, which wasn't accurate. James clarified that the idea was more complex. He, along with other pragmatists like Dewey, believed that while something may feel useful or pleasant in the short term, that doesn't make it true. For example, believing a cheating spouse is faithful may make someone feel better in the moment, but it's not useful in the long term because it's not based on facts. ==Pragmatism in Different Fields== Pragmatism began as a way to understand the meaning of ideas, but it grew into a broader philosophy with effects across many areas of thought. Even though different pragmatists have their own approaches, they all share a common way of thinking. ==Philosophy of Science== In science, pragmatists often follow instrumentalism, which means that scientific ideas are seen as tools rather than perfect descriptions of reality. Instrumentalists think scientific progress is about better explaining and predicting things, not necessarily about finding absolute truth. This doesn't mean truth doesn't matter, but it changes how we think about truth in science. C. I. Lewis, a pragmatist, argued that science doesn't just mirror reality—it uses concepts that help us investigate the world. These concepts are chosen because they are useful for inquiry, not because they perfectly match reality. Logical positivists, like Charles W. Morris and Rudolf Carnap, were influenced by pragmatism and included some of its ideas in their work, but they didn't fully embrace the broader views of pragmatists. In 1951, W. V. Quine challenged some key ideas of the logical positivists in a famous essay. He criticized the idea that there are two kinds of statements: those that are always true (like \"all bachelors are unmarried\") and those that are true depending on facts in the world. He also disagreed with the belief that statements get their meaning only from direct experiences. Quine's ideas connect with earlier pragmatist views, like Peirce's belief that basic principles aren't absolute truths but need to be tested in the real world. ==Logic== Later in life, the philosopher F.C.S. Schiller became known for his attacks on formal logic in his book Formal Logic. Schiller’s pragmatism was closest to everyday language philosophy, arguing that words only have meaning when used in context. He tried to show that formal logic—rigid rules for thinking—wasn't really possible because words need context to make sense. In his less famous book Logic for Use, he proposed a new kind of logic that focuses more on how people discover ideas and test them, rather than following strict formal rules. Unlike Schiller, most pragmatists don't reject formal logic entirely. Instead, they see it as one useful tool among many. C.I. Lewis, for instance, saw logic as just one way of thinking. C.S. Peirce created different methods for formal logic, showing there isn't just one way to use it. Stephen Toulmin's book The Uses of Argument also influenced studies in informal logic and argumentation, even though it was mostly about knowledge. ==Metaphysics (Study of Reality)== William James and John Dewey believed that experience—what we go through in life—is the most important test of reality. They didn't like traditional empiricism (which focuses on individual sensations) because they thought it ignored the connections and meanings we find in experience. Instead, they believed in something called radical empiricism, which says that experience includes not only raw sensations but also meaning and value. Dewey called this \"Immediate Empiricism\" and wanted to recognize meaning as part of reality, not just an added feeling. James gave an example to explain this problem in philosophy: A young graduate felt that the everyday world, full of complexity and confusion, was completely separate from the clean, neat, and simplified world taught in philosophy classes. James argued that philosophy often failed to explain the real world because it ignored its messiness and contradictions. Schiller’s first book, Riddles of the Sphinx, was written before he knew about the American pragmatist movement. In this book, Schiller argued for a middle ground between two extremes: materialism (everything is physical) and abstract metaphysics (which focuses on unchanging, higher ideas). Schiller believed that both approaches were flawed. Materialism couldn't explain things like free will or consciousness, while metaphysics couldn't explain the imperfections of the physical world. He thought metaphysics could be useful, but only if it helped explain things. In the late 20th century, philosopher Stephen Toulmin said that we only need to distinguish between reality and appearance when we're trying to explain things. So, there's no point in asking what \"ultimate reality\" really is. Similarly, philosopher Daniel Dennett argues that to understand the world, we need to consider both the physical aspects of reality (like atoms) and its meanings and values. Radical empiricism addresses questions about the limits of science, the nature of meaning and value, and whether complex things can be reduced to simple physical phenomena. These ideas are important in debates about science and religion, where it’s often assumed that science reduces everything to \"just\" physical facts. Pragmatists disagree with this view and believe that science doesn't have to eliminate meaning. ==Philosophy of Mind== John Dewey and Richard Rorty argued that many debates about the mind and body are caused by confusion. They believed we don't need to think of the mind as a separate \"thing.\" Pragmatists disagree on how to approach the mind-body problem. Some, like Rorty, think it's not a real problem and should be ignored. Others believe it's a real issue that can be studied and understood through science. ==Ethics== Pragmatists believe that practical decisions and theoretical thinking are not separate, and there’s no deep difference between facts and values. Their approach to ethics is human-centered, focusing on what matters to us as humans. Good values are those we have good reasons for. William James believed that ethics involves a degree of trust or faith, and that we can't always wait for complete proof when making moral decisions. He argued that society functions because people trust each other to do their part, and that faith in others is essential for cooperation. John Dewey wrote a lot about morality and democracy. He believed that moral thinking should integrate different perspectives—what is right, virtuous, and good—but that conflicts between them aren't always easy to resolve. Dewey also criticized the idea of separating means (how we do something) from ends (the goal). He argued that work and education should be meaningful, not just a means to an end. In bioethics, pragmatism was embraced by thinkers like John Lachs and Glenn McGee, who applied it to debates on genetic engineering. They challenged the dominant views in medical ethics and argued for a more practical approach. Todd Lekan, a recent pragmatist, argued that morality is a rational but fallible practice. He believed that rules and theories arise to make ethical practices more intelligent, but they are not the foundation of morality. ==Aesthetics (Philosophy of Art)== John Dewey believed that art is an important part of everyday life, not just for a select group of artists. In his book Art as Experience, he argued that art should be accessible to everyone and that the audience plays an active role in appreciating it. Dewey moved away from the idea that art is something unique and separate from regular life. Joseph Margolis, a modern pragmatist, sees art as something that emerges from human culture. He believes that artworks are complex and that no single interpretation can fully explain them. ==Philosophy of Religion== Dewey and James both explored the role of religion in modern society. William James believed that something is true if it works. For example, believing that prayer is heard might help someone feel better, but it might not lead to the actual results they pray for. Pragmatism doesn’t reject religion but also doesn’t defend it blindly. James thought that beliefs in transcendent realities (like God) might be valid because they can have a positive impact on a person's life, even if they can't be proven true or false. Joseph Margolis made a distinction between things that \"exist\" (which physically affect us) and things that are \"real\" (which can still influence us but might not physically exist). He suggested that God might be \"real\" in the sense that belief in God affects people's behavior, even if God does not \"exist\" in a physical sense. ==Education== Pragmatic education focuses on teaching students practical knowledge and helping them grow into better people. John Dewey is a key figure in this approach, emphasizing that education should prepare students for life and be meaningful in itself, not just a step towards something else. ==Neopragmatism== Neopragmatism refers to modern thinkers who take ideas from classical pragmatists but also differ from them. These thinkers may use different methods or ideas. For example, philosopher Richard Rorty didn't agree with Peirce, and C.I. Lewis disagreed with Dewey. Important neopragmatists include Richard Rorty (who developed it in his book Philosophy and the Mirror of Nature), Hilary Putnam, W.V.O. Quine, and Donald Davidson. Roberto Unger is a radical pragmatist who believes we can deeply change society and culture, not just improve them bit by bit. Some neopragmatists stay closer to classical pragmatism, like Sidney Hook and Susan Haack. Isaac Levi applies pragmatist ideas to decision-making, while Nicholas Rescher supports a version of pragmatism that connects truth with practical effectiveness. Not all pragmatists fit into one clear category. Some, like Daniel Dennett and Stephen Toulmin, are influenced by pragmatism but don't fully commit to it. Mark Johnson, for instance, shares similar ideas with pragmatism in his \"embodied philosophy.\" French pragmatists like Michel Callon and Bruno Latour challenge traditional French philosophy and have influenced American sociology and anthropology. Philosophers John Shook and Tibor Solymosi suggest that each generation reinvents pragmatism by using practical methods to solve current problems. ==Legacy and Contemporary Relevance== In the 20th century, two movements—logical positivism and ordinary language philosophy—had similarities to pragmatism. Like pragmatism, logical positivism focused on verifying ideas through evidence but didn’t emphasize action as much. Pragmatists didn’t dismiss metaphysical ideas (like theories about reality) completely but tried to improve them with evidence. Ordinary language philosophy is closer to pragmatism because it focuses on how language works in real situations, rather than abstract connections between language and reality. Pragmatism also connects with process philosophy, especially in discussions with thinkers like Henri Bergson and Alfred North Whitehead. Pragmatism influenced psychology and sociology, such as behaviorism and functionalism, because thinkers like James, Dewey, and Mead studied these areas. Pragmatism emphasizes the link between thought and action and has been applied to fields like public administration, political science, and conflict resolution. ==Effects on Social Sciences== In the early 20th century, symbolic interactionism, a major theory in social psychology, was influenced by pragmatists like Mead, Cooley, Peirce, and James. Pragmatism is also gaining attention in other social sciences because it offers a flexible and practical approach to understanding knowledge. ==Effects on Public Administration== Classical pragmatists like Dewey, James, and Peirce influenced public administration. Public administrators work to make government programs function well in complex, diverse societies. Dewey’s ideas about democracy are useful in this work, and James’s idea that theories should solve real problems helps administrators find solutions. There is debate over whether classical pragmatism or neopragmatism is more useful for public administration. The debate began when Patricia M. Shields introduced Dewey’s idea of the “Community of Inquiry,” which Hugh Miller criticized for relying too much on science. Pragmatism also influences public administration topics like charter schools, outsourcing, financial management, and urban planning. However, some argue that health sector administrators’ focus on results, or \"outcomes,\" can overlook citizens' needs. David Brendel believes that pragmatism’s focus on practical solutions and including different perspectives makes it useful for addressing health sector issues. ==Effects on Feminism== Since the mid-1990s, feminist philosophers have rediscovered classical pragmatism as a valuable source for feminist ideas. Thinkers like Seigfried, Duran, Keith, and Whipps have explored the connections between feminism and pragmatism. These connections were forgotten for a while because pragmatism was overshadowed by a different philosophical movement called logical positivism during the mid-20th century. Feminists today appreciate pragmatism for its criticism of rigid scientific methods, its focus on values in facts, and its emphasis on real-life experiences over abstract analysis. It also highlights the relationship between theory and action and challenges power structures in society. Feminists recognize Jane Addams, a key advocate for women's rights, as an important figure in classical pragmatism. Mary Parker Follett was also a feminist pragmatist who worked on ideas about organizations in the early 20th century. Dewey, Mead, and James had ideas that align with feminist principles, and they worked together on projects like the Hull House, which promoted women's rights. ==Criticisms== Pragmatism has faced several criticisms. In 1908, Arthur Oncken Lovejoy criticized pragmatists for not clearly distinguishing between the truth of an idea and belief in that idea. He identified 13 different positions all labeled as pragmatism, showing how unclear the term could be. In 1936, Celestine Bittle argued that William James's version of pragmatism made truth too subjective, meaning that truth became whatever was useful to a person. Bittle believed this was a misuse of language and that truth should instead be about aligning with reality. He said pragmatism failed to address the intellectual problem of knowing the truth and contradicted itself by using objective facts to deny objective truth. British philosopher Bertrand Russell also criticized James and Dewey in his book A History of Western Philosophy. While he agreed with them in some areas, he ridiculed their views on truth and inquiry. Later, philosophers like Hilary Putnam and Tom Burke argued that Russell misrepresented James and Dewey's ideas. Neopragmatism, especially Richard Rorty’s version, has been criticized for being too relativistic (meaning that it suggests truth is entirely relative or subjective). Rorty himself acknowledged that his later work was more like literary criticism than philosophy, and this shift attracted criticism from both other neopragmatists and analytic philosophers. ==Related pages== *William James *John Dewey *Charles Sanders Peirce ==References== ==Sources== * Baldwin, James Mark (ed., 1901–1905), Dictionary of Philosophy and Psychology, 3 volumes in 4, Macmillan, New York. * Dewey, John (1900–1901), Lectures on Ethics 1900–1901, Donald F. Koch (ed.), Southern Illinois University Press, Carbondale and Edwardsville, 1991. * Dewey, John (1910), How We Think, D.C. Heath, Lexington, MA, 1910. Reprinted, Prometheus Books, Buffalo, NY, 1991. * Dewey, John (1929), The Quest for Certainty: A Study of the Relation of Knowledge and Action, Minton, Balch, and Company, New York. Reprinted, pp. 1–254 in John Dewey, The Later Works, 1925–1953, Vol. 4: 1929, Jo Ann Boydston (ed.), Harriet Furst Simon (text. ed.), Stephen Toulmin (intro.), Southern Illinois University Press, Carbondale and Edwardsville, 1984. * Dewey, John (1932), Theory of the Moral Life, Part 2 of John Dewey and James H. Tufts, Ethics, Henry Holt and Company, New York, 1908. 2nd ed., Holt, Rinehart, and Winston, 1932. Reprinted, Arnold Isenberg (ed.), Victor Kestenbaum (pref.), Irvington Publishers, New York, 1980. * Dewey, John (1938), Logic: The Theory of Inquiry, Henry Holt and Company, New York, 1938. Reprinted, pp. 1–527 in John Dewey, The Later Works, 1925–1953, Vol. 12: 1938, Jo Ann Boydston (ed.), Kathleen Poulos (text. ed.), Ernest Nagel (intro.), Southern Illinois University Press, Carbondale and Edwardsville, 1986. * James, William (1902), \"Pragmatic and Pragmatism\", 1 paragraph, vol. 2, pp. 321–322 in J.M. Baldwin (ed., 1901–1905), Dictionary of Philosophy and Psychology, 3 volumes in 4, Macmillan, New York. Reprinted, CP 5.2 in C.S. Peirce, Collected Papers. * * * * Peirce, C.S., Collected Papers of Charles Sanders Peirce, vols. 1–6, Charles Hartshorne and Paul Weiss (eds.), vols. 7–8, Arthur W. Burks (ed.), Harvard University Press, Cambridge, MA, 1931–1935, 1958. Cited as CP vol.para. * Peirce, C.S., The Essential Peirce, Selected Philosophical Writings, Volume 1 (1867–1893), Nathan Houser and Christian Kloesel (eds.), Indiana University Press, Bloomington and Indianapolis, 1992. * Peirce, C.S., The Essential Peirce, Selected Philosophical Writings, Volume 2 (1893–1913), Peirce Edition Project (eds.), Indiana University Press, Bloomington and Indianapolis, 1998. * * ** * * * ** * * ==Further reading== Surveys * John J. Stuhr, ed. One Hundred Years of Pragmatism: William James's Revolutionary Philosophy (Indiana University Press; 2010) 215 pages; Essays on pragmatism and American culture, pragmatism as a way of thinking and settling disputes, pragmatism as a theory of truth, and pragmatism as a mood, attitude, or temperament. Primary texts Note that this is an introductory list: some important works are left out and some less monumental works that are excellent introductions are included. * C.S. Peirce, \"The Fixation of Belief\" (paper) * C.S. Peirce, \"How to Make Our Ideas Clear\" (paper) * C.S. Peirce, \"A Definition of Pragmatism\" (paper as titled by Menand in Pragmatism: A Reader, from Collected Papers of Charles Sanders Peirce v. 8, some or all of paragraphs 191–195.) * William James, Pragmatism: A New Name for Some Old Ways of Thinking (especially lectures I, II and VI) * John Dewey, Reconstruction in Philosophy * John Dewey, \"Three Independent factors in Morals\" (lecture published as paper) * John Dewey, \"A short catechism concerning truth\" (chapter) * W.V.O. Quine, \"Two Dogmas of Empiricism\". (paper) Secondary texts * Cornelis De Waal, On Pragmatism * Louis Menand, The Metaphysical Club: A Story of Ideas in America * Hilary Putnam, Pragmatism: An Open Question * Abraham Edel, Pragmatic Tests and Ethical Insights * D.S. Clarke, Rational Acceptance and Purpose * Haack, Susan & Lane, Robert, Eds. (2006). Pragmatism Old and New: Selected Writings. New York: Prometheus Books. * Louis Menand, ed., Pragmatism: A Reader (includes essays by Peirce, James, Dewey, Rorty, others) * For a discussion of the ways in which pragmatism offers insights into the theory and practice of urbanism, see: Aseem Inam, Designing Urban Transformation New York and London: Routledge, 2013. . Criticism * Edward W. Younkins, Dewey's Pragmatism and the Decline of Education. * Pragmatism, Ayn Rand Lexicon. * Albert Schinz, Anti- Pragmatism: An Examination into the Respective Rights of Intellectual Aristocracy and Social Democracy. Boston: Small, Maynard and Company, 1909. ==Other websites== General sources * * * Journals and organizations There are several peer-reviewed journals dedicated to pragmatism, for example * Contemporary Pragmatism, affiliated with the International Pragmatism Society * European Journal of Pragmatism and American Philosophy, affiliated with the Associazione Culturale Pragma (Italy) * Nordic Studies in Pragmatism, journal of the Nordic Pragmatism Network * Pragmatism Today, journal of the Central European Pragmatist Forum (CEPF) * Transactions of the Charles S. Peirce Society, journal of the Charles S. Peirce Society * William James Studies, journal of the William James Society Category:Epistemology Category:Philosophical movements and positions",
 "title": "Pragmatism"
}