{
 "id": "180302",
 "text": "Ely do Amparo (14 May 1921 – 9 March 1991) is a former Brazilian football player. He has played for Brazil national team. Regarded as one of the best players in the history of the Vasco da Gama club. He was known for being a strong player who stood out for his leadership and tackling opponents. ==Club career== Eli began his career in the America club in 1939, and a year later he moved to the Canto do Rio club from the city of Niteroi, for whom he played for 5 years. In 1945, Eli moved to the Vasco da Gama club, where he became one of the leaders of the team, which was nicknamed the \"Victoria Express\", which won 5 state championships and the Libertadores Cup in 1948, Eli formed the central midfield axis in this team, along with Danilo and Jorge, who was considered one of the strongest in those years in Brazilian football. In 1955, Eli was bought by the president of the Sport Recife club, Adelmar da Costa Carvalho, the club celebrated its 50th anniversary that year and the Brazilian football star was supposed to help the club win the state championship. \"Sport\", together with \"Nautico\" finished the championship with the same number of points, it was decided, by mutual agreement, to hold three decisive matches, in the first \"Sport\" won 2:0, and in the second with a score of 0:0, Eli was seriously injured - Ivanildo hit his head above the eye, as a result of which his face was covered with blood, the doctor of \"Sport\" suggested the player to go to the locker room, but the player refused and courageously played the match to the end. In the third game, Ivanildu, with a score of 1: 1, again injured the best player of \"Sport\" Eli, breaking his head with his elbow, he could not even play for some time, but soon returned to the field with a bandage on his head and finished the match, in the end, with the score 2:2, scoring the winning goal. After the game, Sport fans carried Eli in their arms. ==International career== Ely do Amparo made his international debut for the Brazilian national team on 3 April 1949 in the opening game of the 1949 Copa America, a 9–1 win against Ecuador. As the tournament progressed, he made four more appearances, mostly alongside Danilo and Noronha, including in the decider to win the title, when a 7-0 win against Paraguay won the continental championship for the third time. A year later, Ely was part of the Brazilian squad for the World Cup on home soil. During the tournament in which the title was in the last and decisive group game, the Maracanaço went down in history was lost to Uruguay, Ely only featured in the preliminary round in a 4-0 win over the Mexicans. A month before the tournament started, he was a regular when Uruguay were defeated in three games in the Copa Río Branco. Two years later, Ely took part with the national team in the inaugural Pan American Championship and even acted as captain in the game against Panama. In the 4-2 win against archrival Uruguay he was sent off the field for the only time in his international career. This competition was also won by Brazil with a 3-0 win in the last group match against Chile. Ely's last international appearances came in the 1953 Copa América, but he did not play in the decider against Paraguay, which ended in a 3-2 defeat. At the 1954 World Cup in Switzerland Ely was again in the Brazil squad, but was not used during the tournament by national coach Zezé Moreira. The Brazilian team lost 4-2 to Hungary in the quarter-finals in the Battle of Bern . After a total of 19 senior international matches and numerous other appearances in unofficial games, his international career was over. ==Death== Ely died on March 9, 1991 at the of 69 due lung infection. Category:1921 births Category:1991 deaths Category:Footballers from Rio de Janeiro (state)",
 "title": "Ely (footballer)"
}