{
 "id": "180320",
 "text": "Friaça (October 20, 1924 – January 12, 2009) is a former Brazilian football player. He has played for Brazil national team. He played as a forward, more precisely as a right winger. He was known for his speed and the violence of his shot, for his skill in hitting set pieces and also for the accuracy of his usually very tense crosses. Considered as one of the best football players of his time. Friaça was a fast right winger with a strong kick. ==Club career== Friaça was discovered when he was playing in a small club in Carangola, the Ipiranga, he was noticed by the Vasco managers when his team defeated the most titled opponents with two of his goals. The coach Ondino Viera thus decided to hire him, and in 1945 he was part of the nucleus on which the Expresso da Vitória, the Vasco team that won several titles at state level and the South American Champions Cup, was founded; with four goals he was his team's top scorer during that competition. He was also the last of the winners of that trophy to die. During his time in the club, he particularly bonded with Jair, who, according to Friaça himself, helped him improve his shooting. Once the cycle of victories was over he was sold to São Paulo, in which he played from 1 April 1949 to 27 March 1951, scoring almost fifty goals and winning the title of state champion. Precisely because of his good performance, Vasco bought him again, keeping him in his ranks until 1952. Later he played for Ponte Preta and Guarani, retiring at the age of 34. ==International career== Friaça was called up for Brazil national team in 1947, Two years later Brazil won the Copa América in 1949, he was nearly unselected, Because of his good performances at Saõ Paulo, he was chosen to play for the tournament. Friaça was called up for the 1950 World Cup tournament. The team of Brazil, sure of the title, played great matches, beating other rivals. In the final round, the teams from Brazil and Uruguay played in the decisive game. In the 47th minute, Friaça scored the first goal of the game for Brazil. It was his only goal in the tournament and in the national team appearances in general. However, Brazil sensationally lost 2-1. With representation, he won the gold medal at the 1952 Pan-American Games in Buenos Aires, twice the Copa Rio Branco in 1947 and 1950, and the Taça Oswaldo Cruz in 1950. He turned down a chance to play for Copa América in 1953 and the FIFA World Cup in 1954. ==Later life and death== The former striker owned a building materials store, run by his children. Friaça was always a happy man, but he was weakened mainly by the death of one of his sons in a hang gliding accident in the mid-1990s. After the tragedy, he never stopped smoking and drinking, which damaged his health. He died on January 12, 2009 of multiple organ failure at Hospital São José do Avaí, in Itaperuna Rio de Janeiro, where he was hospitalized for 45 days. He left his wife and three children. The municipality of Itaperuna declared a three-day mourning period. ==Honours== ===Club=== ;Vasco da Gama *Campeonato Carioca: 1945, 1947 *Torneio Relâmpago: 1946 *Torneio Municipal: 1946, 1947 *South American Championship of Champions: 1948 ;São Paulo *Campeonato Paulista: 1949 ===International=== ;Brazil *Copa Rio Branco: 1947, 1950 *Copa Rio Branco Runner-up: 1948 *South American Championship: 1949 *FIFA World Cup Runner-up: 1950 *Taça Oswaldo Cruz: 1950 *Panamerican Championship: 1952 Category:1924 births Category:2009 deaths Category:Footballers from Rio de Janeiro (state)",
 "title": "Friaça"
}