{
 "id": "180316",
 "text": "Moacir Barbosa Nascimento (27 March 1921 – 7 April 2000) was a Brazilian football player. He played for the Brazil national team. He was regarded as one of the best goalkeepers in the world in the 1940s and 1950s. He was known for not wearing gloves because he wanted to feel the ball with his bare hands. He was a confident and elastic goalkeeper with an excellent sense of placement, who was never afraid to dive into the feet of his opponents. Although he won many trophies, he is most remembered for the Maracanazo, when host country Brazil lost to Uruguay in the 1950 FIFA World Cup Final. He died of a heart attack at the age of 79 and was buried in the Praia Grande Municipal Cemetery in São Paulo. ==Club career== He started his career with the small club ADCI and in 1942 made the move to CA Ypiranga, a mid-sized player from São Paulo. There he was noticed by Vasco da Gama and went there for ten years in 1945. With this club he won the Campeonato Carioca six times, once the Torneio Rio-São Paulo and in 1948 the Campeonato Sul-Americano de Campeões, which is considered the first edition of the Copa Libertadores. After his time at Vasco, he played for Bonsucesso and Santa Cruz and then back for Vasco. He ended his career at Campo Grande. ==International career== Barbosa made his debut for the Brazilian national team in 1945 during the Copa América where Brazil finished as runners-up. He was selected to play for the Roca Cup and he won the Cup, and he was selected to play for 1947 and 1950 Copa Rio Branco and Brazil won. Barbosa also won the South American Championship in 1949. In the final, Brazil beat Paraguay 7-0. At the World Cup in his own country a year later, the title was decided via a group stage. The third game between Brazil and Uruguay was decisive. Brazil needed a draw to become world champions and was a huge favorite. Not only because they were the home country, but also because they scored much faster than the Uruguayans. Friaça gave the Brazilians the lead, but a badly playing Bigode was dribbling past twice by Alcides Ghiggia, who then also passed goalkeeper Barbosa. The loss was a national drama and Barbosa was one of the scapegoats and he was blamed along with Bigode and Juvenal. He would carry this drama with him for the rest of his life. In an interview shortly before his death in 2000, he stated that the maximum prison sentence in Brazil is 30 years, but that he was sentenced to 50 years for something he was not even responsible for. In 1993 the Brazilian federation banned him from commenting on an international match and he was also once sent off from a training session for the national team because he could bring bad luck. ==Honours== ===Club=== ;Vasco da Gama *Campeonato Sul-Americano de Campeões: 1948 *Torneio Rio-São Paulo: 1958 *Campeonato Carioca: 1945, 1947, 1949, 1950, 1952, 1958 *Torneio Intercontinental Octogonal Rivadavia Correa Meyer: 1953 *Torneio Quadrangular do Rio: 1953 *Torneio Internacional de Santiago de Chile: 1953 ===International=== ;Brazil *Copa América: 1949 *Copa Roca: 1945 *Copa Río Branco: 1947, 1950 *FIFA World Cup Runner-up: 1950 *Panamerican Championship: 1952 *Taça Oswaldo Cruz: 1950, 1955 *Copa Río Branco Runner-up: 1946, 1948 *Copa América Runner-up: 1945, 1946, 1953 *Copa América Third Place: 1959 ===Individual=== *IFFHS Brazilian Keeper of the 20th Century: (3rd place)IFFHS' Century Elections *IFFHS South American Keeper of the 20th Century: (11th place)IFFHS' Century Elections *FIFA World Cup: All-Star Team: 1950 (reserve) == References == Category:1921 births Category:2000 deaths Category:Brazilian association football goalkeepers Category:Footballers from Campinas",
 "title": "Moacir Barbosa"
}