{
 "id": "180327",
 "text": "Rui Campos (born 2 August 1922 – 2 January 2002) was a retired Brazilian football player. He has played for Brazil national team. He played as a defender, more precisely as a free, at the beginning of his career and had good technique, but following his transfer to the São Paulo, he turned into a midfielder, a role he played with a certain offensive propensity, which allowed him to score several goals. He formed an excellent understanding with Bauer and Noronha, nicknamed the \"Golden Trio,\" which made the São Paulo midfield one of the best in the world at the time. Rui was regarded as one of the best ever football players. ==Club career== After starting his career in Bonsucesso, he moved to Fluminense, where he remained for two years; on 1 May 1944, he arrived at São Paulo, where thanks to his skills, he first formed part of the defense and then of the midfield, making himself decisive in both positions. He is remembered as one of the club's greatest idols. He left São Paulo in 1952, passing through Bangu and Palmeiras, retiring from the activity with the shirt of the latter team. ==International career== Rui played with the Brazilian national team from 1944 to 1950. With the national team, he won the Copa Roca in 1945, two Rio Branco Cups, and the South American Championship in 1949. In 1950, Rui was a team member that reached the final of the World Cup, however, the Brazilians lost to Uruguay. Like many participants in the final, Rui did not volunteer for the national team after this match. ==Death== Rui died on January 2, 2002, at the age of 79. ==Honours== ===Club=== São Paulo *Campeonato Paulista: 1945, 1946, 1948, 1949 ===International=== Brazil *Copa Roca: 1945 *Copa Rio Branco: 1947, 1950 *Taça Oswaldo Cruz: 1950 *South American Championship: 1949 *FIFA World Cup Runner- up: 1950 *South American Championship Runner-up: 1945, 1946 *Copa Rio Branco Runner-up: 1946, 1948 Category:1922 births Category:2002 deaths Category:Footballers from São Paulo",
 "title": "Rui Campos"
}