{
 "id": "180319",
 "text": "Danilo Alvim (3 December 1920 – 16 May 1996) is a former Brazilian football player. He has played for Brazil national team. He was a member of the ill- fated Brazilian 1950 World Cup team. He is widely regarded as one of the greatest world's centre-halves during his time, he was renowned as a very sophisticated and elegant player who possessed fine ball control and accurate long range passing, marking opponents and he was extremely fast. He was never sent off from the field. He was known as \"Prince\" due to the characteristic elegance of his style of play. ==Early years== Danilo Alvim was born on 3 December 1920 in Rio de Janeiro. ==Club career== Danilo Alvim began his career at the age of 19 at the America club from his hometown of Rio de Janeiro. He got into the club's first team thanks to Flavio Costa, the coach of the Rio national team, who noticed the boy on the training field in Campo Celes, saying that he might play for the Rio national team. But the very next year, he was seriously injured: Danilo, who was trying to jump into a moving tram, was hit by a car, and he received 39 fractures, most of which fell on his legs and was rushed to the hospital. But even such an injury did not stop Danilo, he was treated for about 18 months, and later he trained hard and entered the field in 1942 again. After several matches for America, Alvim was sent on loan to Canto do Rio. Danilo had to change the team because of the head coach of the club, Zhentil Cardozo, who arrived from the USA, who did not see the player in the squad. In Kanto, he began to show a high class of play. Upon returning to America, Danilo has already become a strong player. He quickly became a leader, and the leading clubs in the state began to “hunt” for him. In 1946, Danilo moved to the Vasco da Gama club, who paid 300 thousand reais for the transfer of a football player and undertook to play 3 friendly matches with America. Initially, he was not seen as a central midfielder, where Danilo was accustomed to playing in America. He was placed on the right flank of midfield, but his style of play, incredible playmaker, elegant passing and dribbling soon forced the team bosses to transfer him to the center of the field. He became part of the famous \"Victoria Express\", the so-called \"Vasco\" of the mid-1940s - early 1950s, which won four state championship titles and one South American club championship. And the next year, Alvim had another joy, he married to his wife Selinda. In 1954, Danilo moved to the Botafogo club, but played only 2 seasons there. After leaving Botafogo, Danilo moved to the Uberaba club as a free agent, where he began to act as a playing coach. Alvim played 2 matches for Uberaba, the last game he played against Sao Paulo, after which he decided to \"hang up his boots\". In 1957, Alvim became the one for whom Zizinho moved to end his career at Uberaba. ==International career== Danilo made his international debut during Copa América 1945 when Brazil finished second and also in 1946. He won the Roca Cup with Brazil national team in 1945. His first international goal was against Uruguay in 1948. Danilo won the 1949 Copa América and scored once, he said that the tournament was the best of his life. He was a starter for the famous 1950 World Cup team, unjustly remembered for losing the last game to Uruguay, despite being one of Brazil's best ever squads. Brazil only needed to draw Uruguay to win the 1950 FIFA World Cup at the Maracanã stadium. Uruguay came from a goal down to win the match 2-1. This defeat is remembered today as the Maracanaço. After the match Danilo was sad and he was consoled by his teammates and opponents, although he was not blamed for the defeat, his teammates has stated that he had a good match. It is considered Brazil's worst disaster in history. Danilo is, till today, considered one of Brazil's most complete centre-halves and, by some, a top 10 among Brazil's craques. Just as Ademir, Zizinho, Jair and others on the 1950 team, he would likely be regarded even more highly if it were not for that one day in the Maracanã stadium. In 1952 he returned to the Brazil national team after being absent for 2 years and he won the Panamerican Championship, In 1953 Danilo was selected to play for the Copa América and he formed with Bauer and Bigode a formidale midfield trio, he was a true playmaker during the tournament and the Seleção ended up as runners-up. He retired after the tournament. He played 27 games with 2 goals between 1945 and 1953. He also won the Roca Cup in 1945, Copa Rio Branco in 1947 and 1950 and Taça Oswaldo Cruz in 1950. ==International career statistics== |- |1945||1||0 |- |1946||1||0 |- |1947||2||0 |- |1948||2||1 |- |1949||3||1 |- |1950||9||0 |- |1951||0||0 |- |1952||3||0 |- |1953||5||0 |- !Total||27||2 |} ==Managerial career== After he retired, Danilo worked with many teams, but the biggest success for him was the victory with the Bolivian national team in the South American Championship in 1963. In 1968, Danilo became the head of the Remo club and in the first season made the team a state champion. And a year later he led the team to victory in the tournament of the North of Brazil, in the final defeating the rival \"Remo\" with a score of 5-1 and 4-1. Before the 1970 season, Danilo demanded an increase in his wages from the club - 10 thousand cruzeiro for a contract extension, 2,5 thousand monthly, plus living expenses for Danilo himself and his family. The club agreed to these conditions, but Remo could not repeat the success of previous years, and the coach fired himself. ==Death== Danilo died on May 16, 1996 from pneumonia while visiting in a homeless shelter in Rio de Janeiro 5 days after his teammate Ademir died, he was buried few days later. After his death he was still considered as one of the best defensive midfielders. ==Honours== ===As player=== Vasco da Gama * Southamerican Club Championship: 1948 * Campeonato Carioca: 1947, 1949, 1950, 1952 * Rivadavia Corrêa Meyer Octagonal Tournament: 1953 Brazil * Roca Cup: 1945 * South American Championship: 1949 * South American Championship runners-up: 1945, 1946, 1953 * Panamerican Championship: 1952 * Taça Oswaldo Cruz: 1950 * Copa Rio Branco: 1947, 1950 * Copa Rio Branco Runner-up: 1946, 1948 * FIFA World Cup runner-up: 1950 ===As coach=== *South American Championship: 1963 *Para State Champion: 1968 *Campeonato Paraense: 1968, 1969 Individual * IFFHS Brazilian Player of the 20th Century (24th place)IFFHS' Century Elections * IFFHS South American Player of the 20th Century (44th place) * IFFHS Legends * Brazilian Football Museum Hall of Fame ==References== Category:1920 births Category:1996 deaths Category:Footballers from Rio de Janeiro Category:Brazilian football managers",
 "title": "Danilo Alvim"
}