{
 "id": "180314",
 "text": "Augusto da Costa (22 October 1922 – 1 March 2004) was a former Brazilian football player. He has played for Brazil national team. He was regarded as one of Brazil's finest defenders. He was known as a strong defender, for marking opponents and was also renowned for blocking shots and tackling and his leadership. ==Club career== Augusto began his career at São Cristóvão in 1936 and played for this team for 8 years. But Augusto achieved the greatest success with the Vasco da Gama club, for which the footballer played from 1944 to 1954, and for some time was the team captain. With Vasco, Augusto won 5 state championships, as well as several exhibition tournaments in South America, in total, Augusto played 297 matches with 22 goals for the club and he was considered to be one of the best players ever. ==International career== Augusto played for the Brazilian national team from 1946 to 1950, having played 20 matches (14 wins, 3 draws and 3 losses) and scored 1 goal. He was a participant in two South American championships, in the second of which he won the league title, as well as the 1950 World Cup, in which the Brazilians lost in the decisive match to Uruguay, and Augusto, as team captain retired from the national team, he was consoled by Roque Máspoli. Augusto also played several matches for the Rio national team. ==After football== After completing his playing career, Augusto tried himself as a coach, but unsuccessfully. Later, he worked in the special military police of Rio de Janeiro, where he rose to the rank of lieutenant colonel and commander of the special forces guard. He died on March 1, 2004 at the age of 83 due to kidney failure. ==Honours== ===Club=== ;Vasco da Gama *South American Championship of Champions: 1948 *Campeonato Carioca: 1945, 1947, 1949, 1950 and 1952 *Rivadávia Corrêa Meyer Octagonal Tournament: 1953 ===International=== ;Brazil *Copa Rio Branco: 1947, 1950 *Copa Rio Branco Runner-up: 1946, 1948 *South American Championship Runner-up: 1946 *South American Championship: 1949 *Taça Oswaldo Cruz: 1950 *FIFA World Cup Runner-up: 1950 Category:1920 births Category:2004 deaths Category:Footballers from Rio de Janeiro",
 "title": "Augusto da Costa"
}