{
 "id": "180318",
 "text": "Francisco Aramburu (7 January 1922 – 1 October 1997) known as Chico was a former Brazilian football player. He has played for Brazil national team. He possessed an extremely high running speed and very powerful kicks from both legs. Regarded as one of the legends of the Vasco da Gama football club, he is considered the best number 11s in the history of the club. Chico was widely considered as one of the greatest wingers of all time. He was known as a goalscorer, he was an extremely fast left winger, he kicked hard with both feet. ==Club career== Chico began his footballing career in 1939 as a 17-year- old in his hometown on the Argentine border with EC Ferro Carril. A year later he was able to move to Gremio in the state capital of Porto Alegre, where he was able to showcase his talent at a higher level. As early as 1942 he was brought to the then national capital of Rio de Janeiro by CR Vasco da Gama. The traditional club with the Maltese cross in their coat of arms was only number five in the metropolis behind Fluminense, Botafogo, Flamengo and America FC. At the same time as Chico, the successful Uruguay coach Ondino Viera, who had already won five championships with Argentinian club CA River Plate and Flamengo, also started working for the club. This not only introduced the diagonal sash - inspired by River Plate - that has since become typical on Vasco jerseys, but also introduced tactical innovations. The former boxer Mário Américo also joined Vasco da Gama in 1942 as a masseur and physical therapist - from 1950 he was to accompany the national team through seven world championships as a physical therapist and as a factotum himself gain worldwide fame. By 1945 Ondino Viera managed to put together a powerful team that had no fear of comparison and the club conquered the sixth state championship in the club's history unbeaten. The Expresso da Vitória (“Victory Express”), as which the team went down in history from 1945 to 1952, benefited above all from its attack series Ademir, top scorer Lelé, Isaías, Jair and Chico on the left wing. He had by then gained a reputation as a hard-hitting, quick, two-footed dribbler with a sharp shot and was soon being considered for the national team. ==International career== In 1945 he made his debut in official matches as part of the Brazilian national team. During his career in the national team, which lasted 5 years, he played 21 matches in its form, scoring 8 goals. As part of the national team was a participant in the South American Championship in 1946 in Argentina, where he and his team won \"silver\". Chico was selected to be in Brazil squad that took part for the 1949 Copa América. The following year he was one of the main strikers of the Brazilian national team at the home World Cup in 1950. In the final group of the tournament he took an active part in the defeat of the teams of Sweden and Spain, scoring two goals in the goal of each of them. But in the decisive game against Uruguay, which determined the world champion and in which the Brazilians were considered favorites, he could not excel, and his team unexpectedly lost 2-1 and received only silver medals and won the Bronze Boot. Chico retired from the Seleção after the final match. ==Death== Chico died on October 1, 1997 due heart attack at the age 75. ==Honours== Vasco da Gama * Southamerican Club Championship: 1948 * Campeonato Carioca: 1945, 1947, 1949, 1950, 1952 Brazil * Roca Cup: 1945 * South American Championship Runner-up: 1946 * South American Championship: 1949 * Taça Oswaldo Cruz: 1950 * Copa Rio Branco: 1947, 1950 * FIFA World Cup runner-up: 1950 *Copa Rio Branco Runner- up: 1946, 1948 Individual * IFFHS Brazilian Player of the 20th Century (22nd place)IFFHS' Century Elections * IFFHS South American Player of the 20th Century (30th place) * FIFA World Cup Bronze Boot: 1950 * Brazilian Football Museum Hall of Fame * Player of the Year: Vasco da Gama's best player in the 1943 and 1953 seasons. == References == Category:1922 births Category:1997 deaths Category:Footballers from Rio Grande do Sul Category:Brazil at the 1950 FIFA World Cup",
 "title": "Chico (footballer, born 1922)"
}