{
 "id": "180328",
 "text": "Zizinho (14 September 1921 – 8 February 2002) was a former Brazilian football player. He has played for Brazil national team. He reached the final of the FIFA World Cup with Brazil in 1950. Zizinho's performance at the tournament did ensure that he was voted the best player of the World Cup afterwards. Yet he never received the recognition that, for example, Pelé or Zico did. He is widely regarded by many as one of the best football players of all time. He was lauded as a complete player, with an array of offensive skills such as his dribbling, passing, and shooting ability with both feet, as well as his accuracy from dead ball situations and extraordinary vision. He was nicknamed \"Maestro Ziza\". Pele called him the best player he had ever seen: \"Zizinho was a complete player. He was strong in the build-up and, most importantly, he had no fear of the brutal defenders\". In 1999, Zizinho finished in fourth place in the IFFHS - organized election of the Brazilian Footballer of the 20th Century. ==Club career== From an early age, Zizinho's dream was to become a football player at America FC. He was told after a trial training that he had not been hired. The coaching staff was not convinced because he was of small build. Zizinho then took his chances at Flamengo, where he was allowed to play a test match against the main squad. Ten minutes before the end, he replaced the injured Leônidas da Silva and then scored two goals. Trainer Flávio Costa would have said afterwards: \"Get your hair cut and come back tomorrow\". At Flamengo, Zizinho went on to become one of the best players in the history of Brazilian football. Flamengo won the Campeonato Carioca in 1942, 1943 and 1944. After ten seasons, during which Zizinho had become Brazil's best player, he left Flamengo after being sold to Bangu without his knowledge. Bangu had left a small fortune for Zizinho. He is said to have said to club president: if you are willing to pay that much for me, then you must appreciate my game.\" In the first game against his former employer, Zizinho got his revenge by scoring two goals in the 6-0 win over Flamengo Zizinho also left his mark on the game in his seven years under contract with Bangu. At the age of 35, Zizinho moved to São Paulo, where he helped the club move to the Campeonato Paulista during his final season. In 1962, Zizinho ended his career with Chilean Audax Italiano at the age of 40. ==International career== He played his first international match on January 17, 1942 in a 2-1 loss against Argentina at the 1942 South American Championship. On February 3, 1946, he led the Brazilian team for the first time as captain, scoring 4 goals in a 5-1 win over Chile. He acted 18 times as captain. He also scored 2 goals in Brazil's highest international victory, the 10-1 win over Bolivia on April 10, 1949. After taking the first international prize with the Brazilian national team in 1949 in the form of the Copa America, Zizinho made his appearance at the 1950 FIFA World Cup. Brazil hosted the tournament and built the Maracanã, at the time the largest stadium in the world, especially for this purpose. They played a good tournament with Zizinho as the star. The Italian sports newspaper La Gazzetta dello Sport described Zizinho as the footballing Leonardo da Vinci: \"he created works of art with his feet on the immense field of the Maracanã\". Sports journalist Hugo Meisl wrote after the match between Brazil and Spain: \"We are not talking about simply a good footballer who you meet in various parts of the world. This is a genius. A man who has all the qualities that a footballer wishes to approach perfection.\" The divine Canaries reached the final, but the nearly 175,000 in attendance at the Maracanã saw Brazil lose 2-1 to Uruguay, which had been previously favorited. Although Zizinho was named the best player of the World Cup afterwards, the tournament was the biggest disappointment of his career but he was not blamed for the defeat at all. Years later, Zizinho indicated that he had never been able to handle the disappointment about the lost final. After the World Cup, Zizinho toyed with the idea of giving up football altogether. After three years of absence, he returned to the Brazilian selection in 1953. During that period, however, he came into conflict with columnist Jose Lins do Rego, who criticized the Brazilian players after they lost the final of the Campeonato Sul-Americano. Zizinho parried the criticism, but it is said that his outspokenness cost him his participation in the 1954 World Cup as he was not invited by national team coach Zezé Moreira. This sparked a national debate in Brazil, but the exact reasons Zizinho was not called up have never been revealed. In 1958, when Zizinho was 36 years old, he was selected to participate four days before Brazil was to travel to Sweden for the 1958 World Cup. However, he declined and said afterwards: \"I couldn't accept it. I wasn't the youngest anymore. It wouldn't have been right because there were already players in training. I just regret that I was never able to realize my wish to play with Pele\". Zizinho won in total 53 caps, scoring 30 goals. ==Coaching career== In addition to the aforementioned stay at the Chilean Audax Italiano, where Zizinho served as player-coach, the Brazilian also coached America from São Paulo, Bangu, Vasco da Gama and the Brazil Olympic team, with which he won the 1967 Pan American Games. His coaching career was not as successful as his playing one. ==Death== Zizinho died at the age of 80 at his daughter's house in Niterói. He had been suffering from a heart condition for years. == International career statistics == |- |1942||4||2 |- |1943||0||0 |- |1944||0||0 |- |1945||9||4 |- |1946||7||6 |- |1947||0||0 |- |1948||0||0 |- |1949||7||5 |- |1950||7||3 |- |1951||0||0 |- |1952||0||0 |- |1953||5||1 |- |1954||0||0 |- |1955||1||2 |- |1956||7||5 |- |1957||6||2 |- !Total||53||30 |} ==Honours== ===Club=== *Campeonato Carioca: 1942, 1943, 1944 *Campeonato Paulista: 1957 ===International=== *FIFA World Cup runner-up: 1950 *South American Championship: 1949 *South American Championship runner-up: 1945, 1946, 1953, 1957 *South American Championship third place: 1942 *Taça do Atlântico: 1956 *Roca Cup: 1945, 1957 *Copa Rio Branco: 1947, 1950 *Taça Oswaldo Cruz: 1950, 1955, 1956 *Copa Rio Branco Runner-up: 1946, 1948 ===Individual=== *FIFA World Cup Golden Ball: 1950 *FIFA World Cup All-Star Team: 1950 *IFFHS Brazilian Player of the 20th Century (4th place)IFFHS' Century Elections *IFFHS South American Player of the 20th Century (10th place) *IFFHS World Player of the 20th Century (47th place) *Brazilian Football Museum Hall of Fame === Records === *South American Championship / Copa América all-time top goalscorer: 17 goals (shared with Norberto Méndez) == References == Category:1922 births Category:2002 deaths Category:Footballers from Niterói",
 "title": "Zizinho"
}