{
 "id": "180326",
 "text": "Alfredo Eduardo Barreto de Freitas Noronha (25 September 1918 – 27 July 2003) was a former Brazilian football player. He played for Brazil national team. Considered as one of the legends of the São Paulo club and is regarded to be one of the best players ever in his position, who was known for his defending skills and marking, tackling and his short and long passes. He played as a midfielder and as a left side defender. He formed with Bauer and Rui the midfield trio of the São Paulo multi-winner of the Paulista championship of the 1940s; he had great skills in leading the team, a good technique and a particular ability in the head shots. His nickname was \"Cabrinha\". ==Club career== Noronha began his career in 1935 at the Gremio club, where he played until 1941, winning 4 state championships with the team. Then Noronha played for Vasco da Gama for a year, from whom he moved to Sao Paulo. As part of the Sao Paulo club, Noronha made his debut on July 10, 1942 and played for the team for 9 years, having played the last game on October 17, 1951. With São Paulo, Noronha won 5 São Paulo championships. Together with Bauer and Rui, he made up the so-called \"Golden Trio\", which was the backbone of the team. He later played for Portuguesa Desportos, Gremio and Ypiranga clubs. ==International career== Noronha played 16 matches for the Brazilian national team, he was the winner of the South American Championship in 1949, having played 7 games in the tournament, and a year later at the World Cup in 1950, where he played one match against Switzerland with a draw 2-2. ==Death== On July 17, 2003, Noronha was admitted to the Heart Institute of the University of São Paulo, and 10 days later on July 27, 2003, he died of heart failure. Noronha was buried the very next day. ==Honours== ===Club=== *Campeonato Paulista: 1943, 1945, 1946, 1948, 1949 ===International=== ;Brazil *South American Championship: 1949 *FIFA World Cup: Runner-up 1950 *Roca Cup: 1945 *Copa Rio Branco: 1947, 1950 *Copa Rio Branco Runner-up: 1946, 1948 *Copa Oswaldo Cruz: 1950 == References == Category:1918 births Category:2003 deaths Category:Footballers from Porto Alegre",
 "title": "Noronha (footballer)"
}