{
 "id": "180406",
 "text": "Domingos Antônio da Guia (born in Rio de Janeiro, November 19, 1912 – died in Rio, May 18, 2000) is a former Brazilian football player. He has played for Brazil national team. He is regarded as one of the best defenders of all time. He is considered one of the greatest idols in the history of Flamengo and Corinthians and the best central defender in Brazil in the 1930s. Nicknamed \"The Divine Master\". The way he played he led a revolution in football, he liked to keep the ball next to his foot and he never punted away. Watching him was true entertainment, and if isn't enough, he was solid and consistent in his marking. ==Early days== Domingos was born into a very humble family in the Bangu neighborhood. He worked for a few years in a textile factory before starting to play for Bangu in the Rio de Janeiro tournament. ==Club career== He quickly gained fame as one of the main players (central defender) of Bangu between the years 1929-1932. Despite the fact that Bangu had a history of black players (Francisco Carregal was the first in 1905) Domingos witnessed racism in soccer as he grew up. Seeing the brutality some of the black players received is believed to have inspired Domingo's extraordinary ability to dribble the ball around defenders, a trait Brazilians would become famous for around the world. After Bangu, Domingos moved to Uruguay 's National Football Club for just one season, after brief spells at Vasco da Gama (Brazil), in the Club Atlético Boca Juniors (Argentina) and then finding a home in Flamengo (between the years 1935-1943). A brief spell at Corinthians saw Domingos return to his beloved Bangu in 1947 where he would stay until his retirement in 1950. ==International career== In the Brazilian national team, Domingos played 30 matches, of which the team won 19, drew 3 and lost 8. He made his debut for the national team on July 2, 1931, when the Brazilian national team defeated Ferencváros 6-1. He wasn't selected to play for the 1934 FIFA World Cup. He was left out to be in the Brazilian squad that took part for the Copa América in 1937. He played in the 1938 FIFA World Cup, with Brazil taking third place. With the national team as a team captain and he was selected as one of the best defenders during that tournament, he won the Rio Branco Cup in 1931 and 1932, and the Roca Cup in 1945 as team captain. And he participated in three Copa América tournaments in 1942 when Brazil finished third, 1945 and 1946 when Brazil finished as runners-up. ==Honours== ===Club=== *Uruguayan League: 1933 *Rio de Janeiro State League: 1934, 1939, 1942, 1943 *Argentine League: 1935 ===International=== *Copa Río Branco: 1931, 1932 *Roca Cup: 1945 *FIFA World Cup Third place: 1938 *South American Championship Third place: 1942 *South American Championship Runner-up: 1945, 1946 *Roca Cup Runner-up: 1939, 1940 *Copa Río Branco Runner-up: 1940, 1946 ===Individual=== *FIFA World Cup All-Star Team: 1938 *South American Championship Player of the tournament: 1945 *IFFHS South American Player of the 20th Century (43rd place) *IFFHS Brazil Player of the 20th Century (17th place) *IFFHS World Player of the 20th Century (49th place)Copa América Best Players ==References== Category:1912 births Category:2000 deaths Category:Deaths from stroke Category:Footballers from Rio de Janeiro",
 "title": "Domingos da Guia"
}