{
 "id": "18060",
 "text": "The prime minister of the United Kingdom or British prime minister is the head of government in the United Kingdom. The prime minister controls the Government of the United Kingdom through the cabinet. The prime minister is the chairman of the British cabinet and a member of the Privy Council. It is normal for the prime minister to be the leader of the political party which has a majority in the House of Commons. The prime minister is not the head of state, but is the most important politician in Parliament. By tradition, the monarch of the United Kingdom chooses the prime minister. The monarch chooses the leader of the political party with enough votes to get laws passed in Parliament.Technically, it is expressed as: \"the Parliament of the United Kingdom's approval for the British monarch's speech from the throne\". Keir Starmer (Labour) became prime minister on 5 July 2024. ==Background== The Prime Minister (PM) is usually the leader of the political party which wins most seats in the House of Commons after a general election. There are 650 available seats in the Commons. In each general election the UK electorate vote for their own local member of parliament (MP) to represent their constituency, not for the prime minister. MPs represent their local constituency in the chamber to vote for bills which eventually become laws or statutes, if successful. The prime minister is a member of parliament. The first prime minister was Robert Walpole in 1721. He was known as the \"First Lord of the Treasury\". The first person to be use the title \"prime minister\" officially was Henry Campbell-Bannerman in 1905. Well-known prime ministers in the 20th century included David Lloyd George, Stanley Baldwin, Winston Churchill, Clement Attlee, Margaret Thatcher, and Tony Blair. The prime ministers usually live and work at 10 Downing Street or Chequers while in office. Chequers was donated to the country by Winston Churchill. There are several other official residences, some owned by the government, others held by trusts. The Chevening House estate, in Kent is an example. Dorneywood is another.It is an 18th-century house near Burnham in South Buckinghamshire. ==Living former prime ministers== There are eight living former British prime ministers: == Related pages == *List of prime ministers of the United Kingdom *Deputy Prime Minister of the United Kingdom == References ==",
 "title": "Prime Minister of the United Kingdom"
}