{
 "id": "180711",
 "text": "An anglerfish is a marine fish that belongs to the order Lophiiformes. Anglerfish are noted for having a bait-like appendage in front of their heads, right above their mouths. The appendage, which resembles a fishing pole, is attached to the end of the dorsal fin's front spine, which is separated from the rest of the fin. Anglerfish light their rod with bioluminescence (their own light) and then wiggle it to mimic a small marine animal. When other creatures come to eat the small marine animal, the anglerfish eats them. They are called anglerfish because they catch fish with bait, just like anglers, who use a rod and line (rather than nets). One of the families, the Ceratiidae, has an extraordinary mating system where the male actually fuses into the female. ==Evolution== A mitochondrial genome phylogenetic study suggested that anglerfishes diversified in a short period of the Lower Cretaceous, between 130 and 100 million years ago. Miya M.et al. 2010. Evolutionary history of anglerfishes (Teleostei: Lophiiformes): a mitogenomic perspective. BMC evolutionary biology 10: 58. PMID 20178642 == Description == These carnivorous beasts can be dark brown in color and 2–18 cm long. They have sharp teeth angled inward for gripping prey efficiently. === The appendage === Anglerfish have a special appendage called the esca (derived from Latin ēsca, meaning \"bait\"). It is used to lure prey to their mouths. Then the anglerfish simply chomp them down. == Species info == === Humpback anglerfish === The humpback anglerfish is a black seadevil discovered and named after James Yate Johnson. === Two-rod anglerfish === The two-rod anglerfish has a unique feature; instead of just one rod, it has \"two\" rods, hence its name. It lives in the Indo-Pacific. === Atlantic footballfish === The Atlantic footballfish is called that because of its globose shape, which is like a soccer ball. It is not literally limited to the Atlantic Ocean. == Human uses == === Usage as food === Anglerfish is eaten in western Europe, eastern North America, Africa, and East Asia. It is also a good source of collagen. == Related pages == * Monkfish ==References== == Other websites == * YouTube: First footage of deep-sea anglerfish pair Category:Teleosts Category:Bioluminescent animals",
 "title": "Anglerfish"
}