{
 "id": "180883",
 "text": "Bethnal Green railway station is in the London Borough of Tower Hamlets in Bethnal Green in east London. The station, and all trains serving it, are operated by London Overground, on the West Anglia Main Line, and it is in Travelcard Zone 2. The station was formerly called Bethnal Green Junction until Junction was removed from the name and was also served by trains on the Great Eastern Main Line. It should not be confused with Bethnal Green tube station nearby. ==Services== The typical off-peak service is: *8tph (trains per hour) to London Liverpool Street *4tph to Chingford *2tph to Cheshunt *2tph to Enfield Town Oyster card (pay as you go) on National Rail is accepted at the station from 2 January 2008. ==History== In 1872 the Great Eastern Railway opened a new branch to Hackney Downs to serve this branch a new junction was built to the west of Cambridge Heath Road. It also replaced a station called Mile End which was located on the eastern side of Cambridge Heath Road with a station immediately to the west of the new junction called Bethnal Green Junction. It served both of the Great Eastern Railway routes and had four platforms. In 1946 this station stopped serving the Great Eastern main line to Shenfield and two platforms were closed, though the remains of the Shenfield down platform are still visible. The Shenfield up (London-bound) platform was demolished and the tracks rearranged, coinciding with the swapping of services from the former fast tracks onto the former slow (resulting in the arrangement we see today). It is not known for certain when the station's name was changed, possibly when it ceased serving the Shenfield line. ==Gallery== Image:Bethnal Green railway stn look east.JPG|Platforms looking east Image:Bethnal Green railway stn look west.JPG|Platforms looking west Image:Bethnal Green railway stn Great Eastern look east.JPG|Great Eastern main line looking east Image:Bethnal Green railway stn Great Eastern look west.JPG|Great Eastern main line looking west Image:Bethnal Green railway stn look east to junction.JPG|Bethnal Green East Junction Image:Bethnal Green railway stn signage.JPG|Platform signage, with NEEA logo == References == ==Other websites== Category:Railway stations opened in 1872 Category:Railway stations served by National Express East Anglia Category:1872 establishments in England Category:Railway stations in the London Borough of Tower Hamlets",
 "title": "Bethnal Green railway station"
}