{
 "id": "181303",
 "text": "Helmut Haller (; 21 July 1939 – 11 October 2012) was a German footballer who played as a forward. At international level, he represented West Germany at three World Cups. At club level, he played in both Germany and Italy, and won Italian league titles with Bologna and Juventus. He suffered of dementia and Parkinson's disease. == Style of play == Both a playmaker and goalscorer, Haller was noted for his exceptional technique and finesse as a striker, yet also for his weight problems, which troubled him throughout his career. In Italy Haller is considered one of the greatest wingers and player of Bologna in the sixties. He currently remains famed for his \"irresistible dribbling, his innate genius, his great eye for goal, his charisma.\" == Personal life == On Boxing Day 2006, Haller suffered a serious heart attack and was reported to be recovering well after treatment. Later he also suffered from dementia and Parkinson's disease. Haller died on 11 October 2012. He was survived by his third wife, the native Cuban Noraimy Rodriguez Guiterrez, whom he married in 2003 when she was aged just 21, two sons and a daughter. Haller was also an uncle of Christian Hochstätter, a long-serving Borussia Mönchengladbach player and twice West German international. ==Honours== ===Club=== Bologna * Serie A: 1963–64 Juventus * Serie A: 1971–72, 1972–73 * European Cup: Runner-up: 1972–73 * Inter-Cities Fairs Cup: Runner-up: 1971 * Coppa Italia: Runner-up: 1972–73 Augsburg * Regionalliga Süd: 1973–74 ===International=== Germany *FIFA World Cup: Runner-up 1966, Third-place 1970 ==References== == Other websites == * * * Category:1939 births Category:2012 deaths Category:Deaths from Parkinson's disease Category:Deaths from dementia Category:German footballers Category:FC Augsburg players Category:1962 FIFA World Cup players Category:1966 FIFA World Cup players Category:1970 FIFA World Cup players Category:Association football forwards",
 "title": "Helmut Haller"
}