{
 "id": "181451",
 "text": "List of episodes of the animated series of Police Academy. ==Season 1== # Original airdate Title ShortSummary Villains 01 - 101 September 10, 1998 \"The Good, The Bad & The Bogus\" When Captain Harris bungles an operation to catch the infamous Clown Gang, he is punished by being sent back to the Police Academy to train new recruits. Our favorite grads also return to the Academy under the watchful eye of Harris, but what happens when the Clown Gang enrolls as the Captain's new recruits? The Clown Gang 02 - 102 September 11, 1998 \"Puttin' On The Dogs\" To help combat a string of cat burglaries throughout the city, Commandant Lassard welcomes the latest addition to the Police Academy family, a group of police dogs known as the K-9 Corps. When the infamous Claw crashes a masquerade party and steals the Queen's crown during her royal visit, it's up to Mahoney and the gang to save the day, while trying to avoid Harris' and Proctor's attempts to shut down Lassard's pet project. The Claw 03 - 103 September 19, 1998 \"Phantom of the Precinct\" More and more officers are being scared into taking extended leave, following ghostly encounters with the crooked Phantom. Captain Harris thinks this would be a great way to rid the force of a few certain individuals, and puts Mahoney and friends on the case. But when Sweetchuck is kidnapped by the Phantom, the team follows the trail to Hearse Castle, where they have to deal with a barrage of the Phantom's magic tricks to try and save their comrade. However, the secret to catching this ghastly ghoul might just rest with Sweetchuck himself. The Phantom 04 - 104 October 1, 1998 \"Cops & Robots\" Captain Harris cooks up a hairbrained scheme to induct the Professor's new robots as police officers, replacing Mahoney and crew. But when Kingpin and his men abduct the Professor and force him to re- program the robots to aid his criminal activities, it's up to our heroes to make things right once again. Kingpin 05 - 105 October 2, 1998 \"Police Academy Blues\" When the London Bridge Gang swipes the Professor's Supercar during a police parade, Lassard is forced to step down as Commandant of the Academy, making way for his replacement - Commandant Harris. The British police call our favorite Academy grads for help, as they set out in search of the Supercar, in high hopes of getting their beloved former leader reinstated. The London Bridge Gang 06 - 106 October 7, 1998 \"A Blue Knight At The Opera\" When the opera is plagued by numerous accidents, the team is called to protect opera singer Mademoiselle Diva. Mahoney's advances are rejected, as Diva is enamored with Tackleberry instead. During a performance attended by the Police Chief, Diva is kidnapped by the Phantom of the Opera. Lassard and House try to cover, making their stage debuts in the process. The Phantom At The Opera 07 - 107 October 24, 1998 \"Worth Her Weight In Gold\" Callahan, Hooks and Zed are forced to pose as women wrestlers to combat alleged gold heist mastermind, strongwoman Phoenix Amazona; though our heroes' efforts may be jeopardized by Sweetchuck's apparent crush on the women's champion. Phoenix Amazona 08 - 108 October 24, 1998 \"For Whom The Wedding Bells Toll\" A wealthy entrepreneur is intent on forcing his daughter to marry his business partner. While on duty at the reception, the grads meet Mahoney's childhood friend Ben, now the hired help, whom bride-to-be Debbie has fallen in love with instead. Ben's plans to save Debbie from her arranged marriage turn nasty, when the actors originally hired for a faux kidnapping decide to carry it out for real. George and Lenny 09 - 109 November 4, 1998 \"Westward Ho Hooks\" Feeling stressed, overworked and underappreciated at the precinct, Hooks applies for, and lands, a new job as sheriff of an old western town. Upon arriving, she learns the town has been overrun by Seedy McLeech and his gang of assorted bandits. The Academy grads have their hands full as they saddle up to go after these crims, while trying to win Hooks back in the process. Seedy McLeach 10 - 110 November 10, 1998 \"My Mummy Lies Over The Ocean\" To put an end to a curse, a museum curator seeks the help of the Academy grads to escort the mummy of an ancient Egyptian king, as it is shipped back to its rightful resting place, via a cruise liner. Our heroes also have to deal with not only a group of thugs who are trying to steal the mummy, but with the mummy itself who comes to life, causing panic on the cruise ship! The Mummy 11 - 111 December 1, 1998 \"Numbskull's Revenge\" During a bank robbery, the thick-headed Numbskull is caught by the equally cranial Captain Harris. However, Numbskull escapes from jail, seeking payback on Harris for his confinement. Harris is on the evening TV news, promising to catch Numbskull again, when a note from Numbskull hints at pulling off the biggest bank heist the city has seen yet. Will Harris be able to back up his words, or will he be eating them instead? Numbskull 12 - 112 December 17, 1998 \"Proctor, Call A Doctor!\" When Harris is injured and hospitalized, Proctor becomes Acting Captain for a day, and is forced to deal with a hostage crisis. The mayor has been kidnapped by Mr Sleaze, who wants his goons released from prison. The chase leads our heroes to an amusement park, where they scurry through loads of roller coasters, dodgem cars and haunted houses, in hot pursuit of the thugs. Mr. Sleaze 13 - 113 December 18, 1998 \"Little Zed & Big Bertha\" When Zed tracks down the infamous Highway Robbers, he discovers them to be his long lost cousins, under the guidance of his Aunt Bertha. After they beat him up for being a cop, Zed suffers amnesia, and joins his family gang. Bertha sets out plans to rob an airplane full of money. But, when Sweetchuck & the team track them down, how will Zed respond? The Highway Robbers 14 - 114 January 8, 1999 \"Curses On You!\" The PA grads have their hands full with a gang of notorious gypsies known as the Land Pirates, while also becoming victims of a string of curses set by the Pirates' fortune teller, Madame Zelda. When Mahoney gives Sweetchuck a 'magical orb' to offset the jinx, their luck seems to take a turn for the better, but is that really the case? Madame Zelda and the Land Pirates 15 - 115 January 8, 1999 \"Lights, Action, Coppers!\" Assigned to night duty at Galaxy Studios, movie buff House becomes caught up in a phony film director's plot to steal a giant animatronic robot of Awesome Ape, causing chaos throughout the city as the bad guys pull a string of heists using the monster movie star. Mr. Kranz 16 - 116 January 15, 1999 \"Camp Academy\" Commandant Lassard opens a new summer camp for underprivileged inner city youths, attended by the likes of rebellious teen Bobby & friends. Mahoney and crew have a difficult time gaining the youngsters' trust, but they have to unite as a team in order to stop a group of neighborhood criminals from trying to sabotage the camp's activities. 17 - 117 January 15, 1999 \"The Tell Tale Tooth\" When a massive diamond -- The Cyclops' Eye -- is brought to town for an exhibition, Harris is in charge of a security team protecting the diamond case, which can only be opened using a combination of three keys. Harris gives one to the Police Chief for safekeeping, one to Commandant Lassard, and keeps the third himself. But the Magnificent Mystopholes hypnotises Hightower under the pretense of curing his fear of dentists, while actually using him to steal the three keys to unlock the Cyclops' Eye diamond case, aiding his twisted plot of mass hypnosis. The Magnificent Mystopholes 18 - 118 January 16, 1999 \"Mr. Sleaze Versus Lockjaw\" Lt. Callahan becomes the object of affection for one Lockjaw, who is also embroiled in a bitter turf war with Mr. Sleaze after muscling in on his territory. When Sleaze captures Callahan so he can blackmail Lockjaw into handing him all of his stolen loot, it's up to our heroes to save Debbie (and the day, once again). Mr. Sleaze 19 - 119 January 22, 1999 \"Spaced Out Space Cadets\" Along with Proctor, Harris is accidentally locked on board a space shuttle with our heroes, whom Harris has enrolled in a nine month space program. But moments after takeoff, the shuttle's controls are overridden by an unknown source. They are forced to land in the Amazon jungle, where Harris & Proctor, while looking for answers, are taken captive by mysterious tribesmen. 20 - 120 January 22, 1999 \"Sweetchuck's Brother\" Sweetchuck hides from his FBI agent brother Doug when he comes to the Academy looking for assistance in nabbing a wanted spy. The grads discover Sweetchuck's insecurities, as Doug is bigger, stronger, more confident, and seemingly better at everything than his older brother. Dressed as criminals, Mahoney, Jones, Tackleberry & House set up a mock robbery in hopes that Sweetchuck will capture them, showing his brother just how tough he really is. But when their plans go awry, Doug is captured by the spy he's been looking for, and Sweetchuck finds himself in a very real situation. The Ninjas and Father 22 - 121 February 2, 1999 \"Karate Cop\" Jones finds help from his old karate teacher Master Shiro, after his karate skills seem to be diminished, following a botched encounter with some Japanese bad guys at the local power plant. Master Shiro's former student Flung Hi (I kid you not) is carrying out his plans to harness various energy sources, in his ultimate quest to take over the city. Jones must train harder to regain his confidence, as he prepares to face his nemesis in the inevitable showdown. Flung Hi 23 - 122 February 3, 1999 \"The Hang Ten Gang\" While shopping for a new goldfish for Commandant Lassard's birthday, Sweetchuck discovers that Zed has a fear of water. An eavesdropping Proctor eagerly relays this news to Captain Harris, who says this information is all he needs to oust Zed from the force. But first, they have to deal with a group of hoverboard riding burglars known as the Hang Ten Gang. After making off with both a ton of cash and Zed's girlfriend, the chase leads our heroes over land, air and (gasp)...water! Can Zed face his fear and beat these surfer dudes at their own game? Or will he have to endure the sounds of Harris and Proctor singing 'Goodbye'? The Hang Ten Gang 23 - 123 February 9, 1999 \"Nine Cops And A Baby\" Mahoney plays babysitter for the day, when asked to take care of the new neighbor's baby, Nellie. What he does not know is that high-tech criminals are trying to steal top-secret transistors hidden in Nellie's rattle, before Aunt Mona delivers them to the government. But when baby Nellie wanders out of the building with the rattle, a wild goose chase involving both crooks and cops ensues throughout the city. One must wonder, which poses a bigger challenge for the P.A. grads; nailing bad guys, or changing diapers? 24 - 124 February 9, 1999 \"Fish & Microchips\" When a suspected space lab burglar, Mr. Glitch, is taken in for questioning, he drops a stolen microchip into a goldfish bowl, where it is swallowed by Lassard's pet goldfish Finnegan. After Glitch is let go for lack of evidence, it's a race between cops and robbers to find the chip, after Finnegan is accidentally sent down the drain. Mr. Glitch and Cratchit 25 - 125 March 5, 1999 \"Precinct of Wax\" Wax museum curator Waxen Wayne has a special formula that allows him to mold his face to look like anyone. Along with Kingpin, they devise a fiendish plot to do away with the governor, so that Kingpin can be free to do as he pleases throughout the city. After the governor is kidnapped and replaced with a lookalike (Waxen Wayne in disguise), the police are shocked to hear what the \"\"governor\"\" really wants -- no more cops! To make matters worse, Sweetchuck and Zed are also captured, as Kingpin prepares to transform the three into wax statues... permanently! Kingpin 26 - 126 March 5, 1999 \"Cop Scouts\" Kingpin's people have stolen the crown jewels of Ruritania, hiding them in an Edsen car that is shipped to the city. However, Kingpin does not know which car contains the merchandise, so he hires teenagers to steal every Edsen in the city, until they can find the goods. Meanwhile, young Billy and his friends are the first to join Lassard's new Cop Scout program. Their mission is to help Mahoney and friends infiltrate the car theft ring, and bring the criminals to justice. Kingpin ==Season 2== # Original airdate Title ShortSummary Villains 27 - 201 October 5, 2000 \"Professor Jekyll And Gangster Hyde\" The Professor invents a formula that turns criminals into honest people and vice-versa and some criminals use it to turn him into one of them. Professor Jekyll And Gangster Hyde 28 - 202 October 12, 2000 \"Operation Big House\" Kingpin with Claw, Amazona, Numbskull, Shark and Mr. Sleaze stonel the gold from the world big train. Kingpin, The Claw, Amazona, Numbskull, Shark and Mr. Sleaze 29 - 203 October 12, 2000 \"Ship Of Jewels\" King Neptune 30 - 204 October 15, 2000 \"Zillion Dollar Zed\" Zed wins 50.000.000 of dollars. Ace, Queen of Hearths and Chester 31 - 205 October 19, 2000 \"The Comic Book Caper\" The Comic Book Caper 32 - 206 October 19, 2000 \"The Monkey Trial\" Falcon 33 - 207 November 1, 2000 \"Rolling For Dollars\" Big Mary 34 - 208 October 2, 2000 \"K-9 Corps And The Peking Pooch\" The K-9 Corps missing the peking pooch, stonled by the infame Fox. Fox 35 - 209 October 6, 2000 \"Santa With A Badge\" Mr. Watso and Waldo 36 - 210 November 3, 2000 \"Suitable For Framing\" Mahoney is innocent. Lady Tina is the responsible of jewels stonel. Lady Tina 37 - 211 December 2, 2000 \"Rock Around The Cops\" Jones used to be rock star. Skull Ned and his rock gang 38 - 212 December 3, 2000 \"Prince And The Copper\" Sheik and the Guards 39 - 213 December 23, 2000 \"Now You Steal It, Now You Don't\" The Incredible Shandar 40 - 214 January 10, 20001 \"Mad Maxine\" Maxine 41 - 215 January 10, 2000 \"Trading Disgraces\" Krutz 42 - 216 January 13, 2001 \"Champ\" The Mexican Gang 43 - 217 January 17, 2001 \"Wheels of Fortune\" Zed, at the arrive of his Aunt Bertha and his the cousin, Mr. Sleaze stonel the mayor car. Mr. Sleaze 44 - 218 January 17, 2001 \"The Wolf Who Cried Boy\" Slik and his gang 45 - 219 February 7, 2001 \"Snow Job\" Pop Corn and Family 46 - 220 February 24, 2001 \"A Bad Knight For Tackleberry\" Tackleberry start to battle with an black knight. The Black Knight and his gang 47 - 221 February 24, 2001 \"Supercop Sweetchuck\" Sweetchuck, after the Supercop's video, his favourite hero, his crush by accident, during the stonel at Jewels from the Humongo Twins. Sweetchuck used to be as the real Supercop. The Twin Humongo and Professor Philper/Bates 48 - 222 March 2, 2001 \"Deja Voodoo\" Mahoney, Jones, Sweetchuck and Zed stopped Jaguar the voodoo and his gang. Jaguar the voodoo 49 - 223 March 31, 2001 \"Flights Of The Bumbling Blues\" With Captain Harris, the gang go in fright for save Lassad's fish Finnergan by Mr. Shee and his gang. Nr. Shee, Pack, Squitty and Fufy the crocodile 50 - 224 March 31, 2001 \"Big Burger\" House miss to the stopping the infame Big Burger that terrorized the fast foods. Big Burger 51 - 225 April 1, 2001 \"Fat City\" Mr. Ego and Charles 52 - 226 April 7, 2001 \"Elementary, My Dear Coppers!\" Zed, along with Sweetchuck, dress the role of Sherlock Holmes, for save Samantha from infame prof. Pherryl. Prof. Pherryl and Pack 53 - 227 January 7, 1989 \"Dr. Deadstone, I Presume\" Dr. Deadstone 54 - 228 January 7, 1989 \"The Hillbilly Blues\" The Hillbilly Sheriff 55 - 229 January 14, 1989 \"Survival Of The Fattest\" 56 - 230 January 14, 1989 \"The Junkman Ransoms The Ozone\" The Junkman 57 - 231 January 18, 1989 \"Grads On Tour\" Mob Balsom 58 - 232 January 28, 1989 \"Like Coppers, Like Son\" One of the officer has an son. 59 - 233 January 14/4 February, 1989 \"Ten Little Cops\" Mahoney and his gang start on the small difference. Kingpin 60 - 234 January 14, 1989 \"Big Top Cops\" Mahoney and his gang, used to be the circus clowns. 61 - 235 January 21, 1989 \"Alpine K-9s\" The K-9 Corps, along with the cadets, saves the mountains. 62 - 236 January 21, 1989 \"The Legend Of Robin Good\" The cadets, indagas the legend of Robin Good. Robin Good 63 - 237 January 21, 1989 \"Hawaii Nine-0\" Mahoney and his gang saves the Hawaii. 64 - 238 January 28/September 2, 1989 \"Thieves Like Us\" Mahoney and his gang, arrest the real thieves that want terrorizer the town. Tex and Mulgrew Category:Lists of animated television series episodes *",
 "title": "List of Police Academy episodes"
}