{
 "id": "181466",
 "text": "Backstreet Boys, also known as BSB, are an American vocal group and pop boy band that became popular during the 1990s and 2000s. They are the highest selling boy band of all time with 130 million records sold. The members are AJ McLean, Howie Dorough, Nick Carter, Kevin Richardson and Brian Littrell. Kevin Richardson left the group in 2006 and rejoined in 2012. == History == The Backstreet Boys originated in Orlando, Florida and were formed on April 20, 1993 by Lou Pearlman with the help of a producer, Lil’ Shy. The early line-up of the group were Howie Dorough (19), AJ McLean (15), Nick Carter (13), Sam Licata and Charles Edwards. However Licata and Edwards left in early 1993 for personal reasons. In April 1993, Kevin Richardson along with his cousin Brian Littrell completed the group. After series of tours and the failure of possible Mercury Records, the Backstreet Boys was finally spotlighted in Cleveland, Ohio by Jive Records in February 1994. They recorded their very first single, “We’ve Got it Goin’, written by Denniz PoP and included in Backstreet Boys’ first self-titled album that was released in summer of 1996. == Members == * Howie Dorough was born in Orlando, Florida on August 22, 1973. He started his entertainment career at a tender age of six when he participated in an Orlando Production, The Wizard of Oz. As he grew old, he became more active in their school choir and theater. Howie has also performed in various Nickelodeon productions and other movies. *AJ McLean was born in West Palm Beach, Florida on January 9, 1978. Like Howie, he was also a product of Nickelodeon and Disney Productions. AJ joined the group after a series of auditions with original co-members, Howie Dorough and Nick Carter. * Nick Carter was born in Jamestown, New York on January 28, 1980. Being the youngest member of Backstreet Boys, Nick at his very young age of 12 hit the music industry along with his co-members with his rasping but melodic voice. True artist at heart, he also auditioned in several acting roles and appeared in the popular in 1990, the Edward Scissorhands. Nick together with AJ McLean and Howie Dorough was recruited by Lou Pearlman in his forming group. Nick Carter is the elder brother of singer Aaron Carter. * Kevin Richardson was born in Lexington, Kentucky, USA on October 3, 1971. Kevin grew up in a farm with his parents and two siblings. After graduating in high school, Kevin left his family to pursue his dream of becoming an actor and a singer. He along with his older brother went to Orlando, Florida to try his luck. He became a model, tour guide at Walt Disney World and a dance instructor. At age 21, he joined Backstreet Boys and convinced his cousin, Brian Littrell to also join the group. Kevin left the group on June 23, 2006 and rejoined on April 29, 2012. * Brian Littrell completed the Backstreet Boys group as its fifth member in 1993 after a phone audition to Lou Pearlman. Brian is the cousin of Kevin Richardson. Born on February 20, 1975 in Lexington, Kentucky USA, Brian began singing as a child in a nearby church. He went to Orlando, Florida and completed the group on April 20,1993. == Charts == Year Title US Peak US Weeks UK Peak UK Weeks Album 2005 Just Want You To Know 70 3 8 2 Never Gone Incomplete 13 20 8 15 Never Gone 2001-2002 Drowning 28 80 4 7 Greatest Hits: Chapter 1 2001 More Than That 27 20 12 5 Black & Blue The Call 56 2 8 5 Black & Blue 2000 Shape of My Heart 9 20 4 9 Black & Blue The One 30 15 8 8 Millennium Show Me the Meaning of Being Lonely 6 24 3 12 Millennium 1999 Larger Than Life 25 19 5 14 Millennium I Want It That Way 6 45 1 14 Millennium 1998-1999 All I Have to Give 5 21 2 12 Backstreet Boys/Backstreet's Back 1998 I'll Never Break Your Heart 35 2 8 11 Backstreet Boys/Backstreet's Back Everybody (Backstreet's Back) 4 22 8 11 Backstreet Boys/Backstreet's Back 1997 As Long As You Love Me - - 3 19 Backstreet's Back Quit Playin' Games (With My Heart) 2 43 2 10 Backstreet Boys/Backstreet's Back Anywhere For You - - 4 8 Backstreet Boys 1996 Get Down (You're the One For Me) - - 14 8 Backstreet Boys 1995 We've Got It Goin' On 69 20 3 8 Backstreet Boys == Discography == Comprehensive list of the recordings made. === Albums === Date Title 2019 DNA 2013 In A World Like This 2009 This Is Us 2007 Unbreakable 2005 Never Gone 2000 Black & Blue 1999 Millennium 1997 Backstreet's Back 1996 Backstreet Boys === Singles === Date Title 2019 No Place 2018 Chances 2018 Don't Go Breaking My Heart 2013 Show 'Em (What You're Made Of) 2013 In a World Like This 2012 It's Christmas Time Again 2009 Bigger 2009 Straight Through My Heart 2007 Helpless When She Smiles 2007 Inconsolable 2005 I Still... 2005 Crawling Back to You 2005 Just Want You to Know 2005 Incomplete 2001 Drowning 2001 More than That 2001 The Call 2000 Shape of My Heart 2000 The One 1999 Show Me the Meaning of Being Lonely 1999 Larger than Life 1999 I Want It That Way 1998 All I Have to Give 1997 As Long as You Love Me 1997 Everybody (Backstreet's Back) 1997 Anywhere for You 1996 Quit Playing Games (with My Heart) 1996 Get Down (You're the One for Me) 1995 I'll Never Break Your Heart 1995 We've Got It Goin' On == Influences == * Richard Marx * Boyz II Men * Take That * Wham * Spice Girls * 2Pac * Madonna * Michael Jackson * New Kids on the Block == Other websites == * Backstreet Boys Official Site * Backstreet.net Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American boy bands Category:American pop music groups Category:American R&B; bands Category:Musical groups established in 1993 Category:1993 establishments in Florida Category:Musical groups from Orlando, Florida Category:Musical quintets Category:Musical groups disestablished in 2001 Category:2001 disestablishments in the United States Category:2000s disestablishments in Florida Category:Musical groups established in 2004 Category:2004 establishments in Florida",
 "title": "Backstreet Boys"
}