{
 "id": "181564",
 "text": "Jill Tracy Jacobs Biden (born June 3, 1951) is an American educator who served as the first lady of the United States from 2021 to 2025 as the wife of Joe Biden, the 46th U.S. president. Before becoming first lady, she was the second lady from 2009 to 2017 when her husband was vice president. She has a bachelor's degree in English and a doctoral degree in education from the University of Delaware, as well as master's degrees in education and English from West Chester University and Villanova University. Biden taught English and reading in high schools for thirteen years and instructed teens with emotional disabilities. She is the founder of the Biden Breast Health Initiative, a non-profit organization. She is also the co-founder of the Book Buddies program and the Biden Foundation and active in Delaware Boots on the Ground. With Michelle Obama, she is the co-founder of Joining Forces. Biden has written a memoir and two books for children and has been socially active in the Beau Biden Foundation. == Biography == === Early life and education === Jill Tracy Jacobs was born on June 3, 1951, in Hammonton, New Jersey, to Bonny Jean Godfrey Jacobs and Donald Carl Jacobs. The oldest of five daughters, Jacobs grew up in Willow Grove, Pennsylvania, just outside of Philadelphia. Jacobs graduated from Upper Moreland High School in 1969, then graduated from the University of Delaware with a bachelor's degree in English in 1975. === Career === In 1976, Jacobs began teaching English at St. Mark’s High School in Wilmington, Delaware. She then became a reading specialist at Claymont High School. At that time, she was also pursuing a Master of Education with a specialty in reading from West Chester University. Jacobs completed her first master's degree in 1981. Biden taught English at Rockford Center psychiatric hospital while also earning a Master of Arts in English from Villanova University. In 1993, she started teaching at Delaware Technical Community College. During that same year, Biden's began advocating for cancer and education. After four of her friends were diagnosed with breast cancer, she launched the Biden Breast Health Initiative to educate high school girls about the importance of early detection of breast cancer and prevention efforts. In 2007, she received a Doctor of Education from the University of Delaware. In 2009, when her husband became vice president, her family moved to DC, where she began teaching at Northern Virginia Community College. === Marriage and family === As early as 1972, Jill Biden met Joe Biden when she and her first husband worked on Biden’s senatorial campaign. According to Bill Stevenson, they began an affair before Joe Biden’s first wife died in a car accident. Stevenson states that Joe could often be seen driving around in Jill’s car. When Joe Biden’s two sons were recovering from their injuries, Jill often visited them in the hospital. Joe and Jill were finally married at the United Nations in New York City on June 17, 1977, and she became the stepmother of his two sons, Beau and Hunter. Their daughter, Ashley Biden was born in June 1981. === 2008 presidential election === During the 2008 presidential election, then-Illinois U.S senator Barack Obama announced that Biden would be his running mate for vice president. She began campaigning again. She wore a Blue Star Mothers Club pin in recognition of Beau Biden's deployment to Iraq. She also made some joint appearances with Michelle Obama. Throughout the time her husband was running for vice president, Biden continued to teach four days a week at Delaware Technical & Community College during the fall 2008 semester and then campaigned over the long weekend while grading class papers on the campaign bus. Biden was officially nominated for vice president in August 2008 at the Democratic National Convention. In November 2008, her husband was elected as the 47th U.S. vice president. == Second lady of the United States (2009–2017) == Biden became the second lady of the United States when her husband was sworn-in as the 47th U.S. vice president on January 20, 2009. She was the first Italian-American second lady in U.S. history. As second lady, Biden focused on advocating for community colleges, military families, education of women and girls around the world and planned to keep teaching. In January 2009, she began teaching two English courses as an adjunct professor at the Alexandria campus of Northern Virginia Community College, the second largest community college in the country. She was the first second lady to hold a paying job while her husband was vice president. In White House announcements and by her preference, she was referred to as \"Dr. Jill Biden\". In May 2009, Obama announced that Biden would be in charge of an initiative to raise awareness about the value of community colleges. She continued teaching two English reading and writing classes at NOVA in fall 2009. In Fall 2009 she received a two-year appointment as a full-time faculty member, and in Fall 2011 she was given permanent position as an associate professor. In this role she was teaching three English and writing composition courses two days per week. In April 2011, Biden launched Joining Forces with First Lady Michelle Obama, a White House initiative to support service members, veterans, their families, caregivers, and survivors.. During her term as second lady, she traveled to nearly forty countries, visiting military bases, hospitals, and refugee camps, and advocating for education for women and girls. == Subsequent activities (2017–2021) == After her husband's vice presidency ended on January 20, 2017, they launched the Biden Foundation in February 2017, with the focus on preventing violence against women, his moonshot initiative, and her interests in community colleges and military families. In May 2019, her memoir Where the Light Enters: Building a Family, Discovering Myself was published, where the book focused on aspects of family. Biden did some book signings to help promote the work. Biden continued to teach full-time at NOVA after her husband left office, with a salary of close to $100,000. She was selected to give the keynote address at a commencement for Milwaukee Area Technical College in May 2017. She gave the keynote address at a California teachers summit in July 2017, where she spoke about the importance of communities supporting their teachers given the emotional and stresses they have to deal with. === 2020 presidential election === On April 25, 2019, her husband announced his candidacy for president for the 2020 presidential election. During the 2020 election, Biden was heavily involved in her husband's presidential campaign throughout 2019 and 2020. She appeared in multiple states campaigning with her husband and giving speeches to their supporters. She delivered a speech on the second night of the convention from the classroom at Brandywine High School in Wilmington, Delaware, where she had taught English from 1991 through 1993. Biden's speech was focused on both family and education. She talked about the ongoing COVID-19 pandemic and how it had impacted education, families and the economy. Biden also spoke about the personal death that her husband had experienced such as the deaths of his first wife, Neilia Hunter Biden, and first born and infant daughter Naomi Christina Biden, who both died in a car crash in 1972, and the death of his son Beau Biden, who died from brain cancer in May 2015. On November 7, 2020, her husband was elected as the 46th U.S. president. == First lady of the United States (2021–2025) == Biden became the first lady of the United States when her husband was sworn-in as the 46th U.S. president on January 20, 2021. She is the oldest woman to serve the role, and is also the first Italian American first lady. Biden is the first woman since Barbara Bush to hold both titles as second and first lady, and is also the first woman since Pat Nixon to serve both titles non-consecutively. She resumed teaching at NOVA, at first on a remote basis over Zoom due to the COVID-19 pandemic. This has made her the first wife of a sitting U.S. president to hold a paying job outside the White House. For security reasons and for students who are looking to add a class taught by Biden, her classes at NOVA were taught by her staff. She has stayed up late in the White House quarters to review assignments she has given her students. In September 2021 she returned to in-person teaching at NOVA. Security for her classes became tighter than it had been as second lady, with students having to go through a metal detector and getting a security briefing === Domestic initiatives and activities === During her tenure, Biden visited 34 military installations and worked with Joining Forces to hold over 70 events for military families focusing on employment, entrepreneurship and other issues.References: * * * In September 2021, the Office of the First Lady joined the U.S. National Security Council in launching the Joining Forces Interagency Policy Committee to secure proposals across the federal government to support military families. In November 2021, the Joining Forces program joined Elizabeth Dole Foundation and Wounded Warrior Project in launching Hidden Helpers Coalition, an initiative designed to create supportive programming for 2.3 million children of wounded, ill or injured service members or veterans. Biden is an advocate for women's rights. In March 2023, she hosted a Women's History Month event where she call on men to step up and fight to protect women's rights. Biden, with Secretary of State Antony Blinken, hosted the annual International Women of Courage Award, which were given by the U.S. Department of State to acknowledge women “who have demonstrated exceptional courage, strength, and leadership in advocating for peace, justice, human rights, gender equity and equality, and the empowerment of women and girls”, at White House.References: * * * * In October 2023, in honor of the International Day of the Girl Child, Biden, along with the White House Gender Policy Council, hosted the first-ever “Girls Leading Change” celebration to recognize the profound impact young women are having on their communities across the United States. In February 2024, Biden announced the White House Initiative on Women's Health Research, a $100 million federal funding for research and development into women's health, which was led by the White House Gender Policy Council. Biden planned an restoration of the White House public tour to make the tour more accessible for visitors. In the past, the tour allowed visitors only a quick look at some of the most famous rooms in the White House and emphasized the White House's antiques and artwork. The Office of the First Lady worked on the $5 million project for two years with the National Park Service, the White House Office of the Curator, the White House Historical Association, presidential libraries and the History Channel. In October 2024, Biden unveiled the upgrade of the tour. The new tour also includes digital displays that commemorate all eras of American history and five new 3D models of the White House that portray the building as it evolved from 1792 to 2024. The tourists also had a greater access to the White House rooms that were previously closed to the public. The tour also accommodates blind tourists. === Foreign trips and activities === In June 2021, the Biden's visited Cornwall in the United Kingdom to attend the 47th G7 summit. Biden and the Duchess of Cambridge visited primary school students and participated in a roundtable discussion focusing on early childhood education. In July 2021, Biden visited Tokyo in her first solo trip abroad as the first lady. There, she met Japanese Prime Minister Yoshihide Suga with his wife Mariko Suga at Akasaka Palace and met Emperor Naruhito at Tokyo Imperial Palace. She also visited American athletes at the 2020 Summer Olympic Games and attended the Olympics opening ceremony at the Olympic Stadium. In October 2021, the Bidens visited Vatican City. There, the couple met Pope Francis at the Apostolic Palace to discuss world poverty and climate change. In the same month, they visited Rome to attend the G20 Leaders' Summit. Biden met Serena Cappello, wife of Italian Prime Minister Mario Draghi at Chigi Palace and Brigitte Macron, wife of French President Emmanuel Macron at Il Marchese restaurant. She also visited the families of American troops in Naples. In May 2022, during the 2022 Russian invasion of Ukraine, Biden made a trip to Romania and Slovakia, visiting with Ukrainian women and children refugees and asking questions of workers from aid organizations. During this, she made an unannounced trip across the Slovakia–Ukraine border to Uzhhorod, Ukraine, where she met with displaced Ukrainian schoolchildren, as well as with Ukrainian first lady Olena Zelenska. It was the first visit to a war zone by a U.S. first lady without her husband since Laura Bush went to Afghanistan in 2008, and it was the first appearance in public for Zelenska since the invasion started. At a 2022 Madrid summit, Biden and several other first ladies made a commitment to helping Ukrainian refugees. In the same month, Biden visited Ecuador, Panama, and Costa Rica. At each stop, she engaged in public appearances and diplomatic discussions that emphasized the value that partnership with the United States brought in by addressing a variety of issues within those countries. While Biden had visited the continent of Africa five times as second lady, her initial visit there as first lady came in February 2023 with a trip to Namibia and Kenya. In Windhoek, she delivered a speech on democracy and women's empowerment. While in Kenya's Kajiado County, she witnessed the effects of the ongoing 2020–2023 Horn of Africa Drought. In May 2023, Biden and her step-granddaughter, Finnegan, were the representatives of the U.S. government at the coronation of King Charles III and Queen Camilla, making her the first first lady to ever attend a British coronation. In June 2023, Biden and her daughter Ashley attended the wedding of Crown Prince Hussein of Jordan and Rajwa Al Saif. In the same month, she visited Egypt, Morocco and Portugal to highlight her advocacy for youth empowerment and arts. In July 2023, Biden visited Paris to give a speech to mark the official return of the United States to UNESCO. In July 2024, Biden led the American delegation at the opening ceremony of the 2024 Summer Olympic Games in Paris, France. She also visited American athletes at an Olympic training center in Paris. In October 2024, she led the American delegation to the inauguration of Claudia Sheinbaum as Mexico's first female president. In December 2024, Biden conducted final foreign trip as the first lady. She visited Italy, United Arab Emirates, Qatar and France. In Italy, she visited US military personnel in Catania to delivering remarks on behalf of the Joining Forces program. She also visited her paternal family's ancestral hometown of Gesso, Messina. In the United Arab Emirates, she toured the Cleveland Clinic Abu Dhabi as part of the Biden Cancer Moonshot program and attended the Milken Institute's Middle East and Africa Summit. She also met Sheikha Fatima bint Mubarak Al Ketbi, mother of the UAE president Sheikh Mohamed bin Zayed Al Nahyan in Abu Dhabi. In Qatar, Biden visited to the Qatar Foundation and Weill Cornell Medicine-Qatar to highlight the two countries' interests in education and health. She also attended a dinner banquet hosted by Sheikha Moza bint Nasser Al-Missned to celebrate the wedding of Sheikh Khalifa bin Hamad Al Thani and Sheikha Fatima bin Nasser bin Hassan Al Thani at the Al-Wajba Palace in Doha. Biden was the keynote speaker at the 2024 Doha Forum. After visiting Qatar, Biden and her daughter Ashley attended the reopening ceremony of the Notre-Dame Cathedral in Paris. == Post-White House activities (2025–present) == After her husband's presidency ended on January 20, 2025, the Bidens moved back to Wilmington, Delaware. ==References== == Writings == === Books === * Jacobs-Biden, Jill (2006). Student Retention at the Community College: Meeting Students' Needs (Newark, DE: University of Delaware) * Biden, Jill (2012). Don't Forget, God Bless Our Troops (New York: Simon & Schuster) * * ==Official websites== * * * * * Category:1951 births Category:Living people Category:American teachers Category:First Ladies of the United States Category:Second Ladies of the United States Category:Joe Biden Category:Educators from New Jersey Category:Educators from Wilmington, Delaware Category:People from Ocean City, New Jersey",
 "title": "Jill Biden"
}