{
 "id": "181888",
 "text": "Vauxhall station is an important railway station in the London district of Vauxhall. It is a National Rail, London Underground and London Buses interchange station. Its position is at the Vauxhall Cross road junction, opposite the southern approach to Vauxhall Bridge. The station is on the boundary of zones 1 and 2 of the London Travelcard area. The bus station is at ground level across the road from the rail station. It is the second busiest London bus station, after that at Victoria. It has a photovoltaic roof supplying much of its electricity. == Services == Vauxhall underground is served by the Victoria Line and is between Pimlico and Stockwell. Vauxhall rail station is served by South West Trains services to and from London Waterloo. The typical off-peak service is: *29tph to London Waterloo *4tph to Chessington *4tph to Dorking *1every two hours to Guildford via Cobham *8tph to Guildford via Epsom *2tph to Hampton Court *2tph round the Hounslow loop via Hounslow and Richmond, returning to Waterloo *2tph round the Hounslow loop via Richmond and Hounslow, returning to Waterloo *2tph round the Kingston loop via Kingston and Richmond, returning to Waterloo *2tph round the Kingston loop via Richmond and Kingston, returning to Waterloo *2tph to Shepperton *2tph to Windsor & Eton Riverside *2tph to Woking London buses routes 2, 36 (24 hour service), 77, 87, 88 (24 hour service), 156, 185, 196, 344 (24 hour service), 360, 436 and Night Bus routes N2, N87, N136 serve the station. Vauxhall railway station - London - 240404.jpg|Vauxhall railway station platforms from the western end Clapham Junction, Stewarts Lane, Lavender Hill & Longhedge RJD 17.jpg|A 1914 Railway Clearing House map of lines around Vauxhall station ==References== == Other websites == *Plan of the mainline station Category:London Travelcard zone 1 Category:London Travelcard zone 2 Category:Railway stations in London Category:Victoria line stations",
 "title": "Vauxhall station"
}