{
 "id": "182066",
 "text": "Darius Campbell Danesh (19 August 1980 – 11 August 2022) was a Scottish singer, artist and West End stage actor. His father is Iranian and his mother is Scottish. ==Career== He was an auditionee in television music talent show Popstars in early 2001. He rose to fame on series 1 of Pop Idol. Darius' first single was \"Colourblind\". It entered the UK singles chart at number 1. The album went platinum in 2004. He was a contestant in series 1 of Popstar to Operastar in early 2010. ==Personal life== Campbell Danesh was married to Canadian actress Natasha Henstridge. Campbell Danesh and Henstridge married in a secret ceremony in February 2011. The couple filed for divorce in July 2013. The divorce was finalised in February 2018. ==Death== It was announced in a statement from his family on 16 August 2022 that Campbell Danesh was found unresponsive on 11 August 2022 in his apartment in Rochester, Minnesota and was pronounced dead later that day. His family reported there were no suspicious circumstances or signs of attack surrounding his death. A small private funeral was held for Campbell Danesh on 25 August 2022 at a church in the Glasgow suburb of Bearsden, which only included family members and close friends. An autopsy report which was released on 10 September 2020, concluded that he died after accidentally inhaling chloroethane (a medicinal drug used to treat pain), which he used for his chronic neck pain after a car accident in 2010. ==Discography== ===Studio albums=== Title Details Peak chart positions Certifications UK SCO Dive In * Released: 2 December 2002 * Label: Mercury * Formats: CD, digital download 6 3 * BPI: Platinum Live Twice * Released: 25 October 2004 * Label: Mercury * Formats: CD, digital download 36 10 ===Video albums=== Title Details Darius: The Story So Far * Released: 28 February 2005 * Format: DVD * Label: ===Singles=== Title Year Chart positions Certifications Album UK AUS IRE SCO \"Colourblind\" 2002 1 61 13 1 * BPI: Gold Dive In \"Rushes\" 5 — — 2 \"Incredible (What I Meant to Say)\" 2003 9 — 21 7 \"Girl in the Moon\" 21 — — 13 \"Kinda Love\" 2004 8 — — 2 Live Twice \"Live Twice\" 2005 7 — 24 4 \"—\" denotes a recording that did not chart or was not released in that territory. ==References== Category:1980 births Category:2022 deaths Category:British television personalities Category:Musicians from Glasgow Category:Reality television participants Category:Scottish pop musicians Category:Scottish singers Category:Scottish stage actors",
 "title": "Darius Campbell Danesh"
}