{
 "id": "182022",
 "text": "Karl Anthony Malone (born July 24, 1963) is an American retired professional basketball player. He spent his entire NBA career with the Utah Jazz, except for the last year of his career, where he played for the Los Angeles Lakers. He is 2nd place on the list of basketball players who have scored the most points all time. Before entering the NBA, he played college basketball at Louisiana Tech University where he earned the nickname, The Mailman for his consistency and his work in the post. Some people think he is the greatest player who did not win an NBA championship, while others argue it could be teammate John Stockton, Charles Barkley or Patrick Ewing. Malone had a professional wrestling match at World Championship Wrestling (WCW)'s Bash at the Beach in 1998, where he teamed with Diamond Dallas Page to face Hollywood Hogan and Dennis Rodman. In 1999 NBA season he won MVP award. In 1998, it was reported by The Globe that Malone had allegedly fathered three children: two by Bonita Ford and a one with Gloria Bell, who was 13 when she gave birth. Malone was not charged with statutory rape. Malone was confirmed by a judge in a lawsuit to have fathered Bell's child.Fantin, Linda. Spirit vs. Letter of Law in Malone Paternity Suits. The Salt Lake Tribune, July 19, 1998. In 1998, Malone accepted his paternity of the Ford twins and repaired his relationship with his son former NFL player Demetress Bell in 2014. Siegel, Lee. Kay Malone Brings Message of Love To Families Panel; Keynote speaker enlivens conference with Mailman household anecdotes; Family The Focus at Utah Conference. The Salt Lake Tribune, November 8, 1998. ==References== ==Other websites== *NBA legends profile * Category:1963 births Category:Living people Category:African-American basketball players Category:American basketball players Category:College basketball coaches Category:Los Angeles Lakers players Category:Medalists at the 1992 Summer Olympics Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association players with retired numbers Category:Olympic gold medalists for the United States Category:Power forwards Category:Sportspeople from Louisiana Category:Utah Jazz players",
 "title": "Karl Malone"
}