{
 "id": "182841",
 "text": "Eurostar is a high-speed train service in Western Europe connecting London and Kent in the United Kingdom with Paris and Lille in France, and Brussels in Belgium. All Eurostar trains cross the English Channel through the Channel Tunnel. The service is operated by 18-carriage Class 373 trains at up to 300 km/h (186 mph) on a network of high-speed lines. Since Eurostar began in 1994, new lines have been built in Belgium (HSL 1) and Southern England (High Speed 1) to the same standard as the LGV Nord line originally used in France, reducing journey times. The two-stage Channel Tunnel Rail Link project was completed on 14 November 2007, when the London terminus of Eurostar transferred from Waterloo International to St Pancras International station. ==Fleet== ===Fleet details=== Class Image Top speed Number in use Unit numbers Routes operated Built km/h mph International Eurostar e300 300 186 11 1992–1996 Eurostar e320 320 200 17 2011–2018 Europe PBA 320 200 9 4532–4540 1996 PBKA 320 200 17 1997 ===Past fleet=== Class Image Type Top speed Number operated Notes mph km/h Class 37 Diesel locomotive 90 145 12 They're used to be used on sleeper services in Britain. Eurostar has three locomotives for the rescue of failed trains, route learning and driver training, In November 2007 they were sold to Direct Rail Services Class 73 Electro-diesel locomotive 90 145 2 Were used to rescue failed trains.. Class 92 Electric locomotive 87 140 7 They were meant to operate the Nightstar sleeper services but Eurostar never used them and sold them in 2007. Class 373 Eurostar e300 EMU 186 300 38 11 in operation, 10 in storage, 17 scrapped, 4 power cars preserved. ===Past fleet=== Class Image Type Top speed Number operated Notes mph km/h Class 37 Diesel locomotive 90 145 12 Intended to operate sleeper services over non-electrified parts of the railway network in Britain. Eurostar retained three locomotives for the rescue of failed trains, route learning and driver training, but sold them to Direct Rail Services when the new Temple Mills Depot opened in November 2007. Class 73 Electro-diesel locomotive 90 145 2 Were used primarily to rescue failed trains. Eurostar operated two of these from its North Pole depot until 2007, when they were loaned to a pair of educational initiatives having become redundant following the move to Temple Mills. Class 92 Electric locomotive 87 140 7 Intended to operate the Nightstar sleeper services. Eurostar owned seven units of this class, which never saw service until they were sold in 2007 to Europorte 2. Class 373 Eurostar e300 EMU 186 300 38 11 in operation, 10 in storage, 17 scrapped, 4 power cars preserved. ==References== Category:High-speed rail Category:Rail transport in Europe",
 "title": "Eurostar"
}