{
 "id": "183139",
 "text": "Skins is a controversial and two time BAFTA-winning British teen drama about a group of English teenagers growing up in Bristol. Mainly ages 16–18, the characters go to a fictional school called Roundview College. The show was created by television writers Bryan Elsley and Jamie Brittain, and was first shown on E4 on 25 January 2007. There are seven seasons with 61 episodes. There are also mini episodes of Skins that can only be watched online. It was also shown on Channel 4. On 12 March 2009 it was announced on the official Skins website that a fourth season of Skins was planned. The last episode was 5 August 2013. An American adaptation was made. The remake made in the USA was shown on MTV in 2011. It was not very popular and was accused of child pornography and being a bad influence on teenagers, so a second season was not made. It had the same characters as UK Skins apart from Maxxie, who was replaced with a lesbian called Tea Marvelli. == Characters == === First generation === These characters were in the first two seasons. * Anthony \"Tony\" Stonem is played by Nicholas Hoult. He is the older brother of Effy. He goes out with Michelle at the start of series 1. He cheats on her with Abbie and Maxxie. In the last episode of series 1 Tony is ran over by a bus. In series 2 he has subdural hematoma because of this. He and Effy and their mother Anthea lived with his abusive father named Jim in 2007-2008. * Sid Jenkins is Tony's best friend. He is played by Mike Bailey. He is a virgin at the start of the first season. He has low self-esteem and his best friend Tony is his role model. His respect for Tony lessens throughout the two seasons. In the remake, Sid got called Stanley. * Michelle Richardson is Tony's girlfriend. She is played by April Pearson. She describes Jal as her best friend. * Cassie Ainsworth is a weird girl who self-harms and has anorexia. She is played by Hannah Murray. She is romantically interested in Sid from the first episode, Later they start dating. * Christopher \"Chris\" Miles is played by Joe Dempsie. He has an affair with his psychology teacher Angie. He is expelled from college. He dies unexpectedly in series 2 of a brain hemorrhage. * Jalander \"Jal\" Fazer is a black musician. She is played by Larissa Wilson. * Maxxie Oliver is openly gay. His best friend is Anwar. He is played by Mitch Hewer. He was the only character not to appear in the American adaptation of the show. * Anwar Kharral is a Muslim. This conflicts with his friendship with Maxxie, who is gay. Anwar says that being gay is against his religion. But he eats pork, takes drugs at parties, and has premarital sex. He is played by Dev Patel. * Lucy \"Sketch\" is a Welsh girl who stalks Maxxie in series 2. She is played by Aimee-Ffion Edwards. When Maxxie is not interested in her she has sex with his best friend Anwar. === Second generation === At the end of the second season of Skins, it was announced that the old characters were being replaced with new ones. The only characters from the \"original\" season to come back are Effy Stonem (who is Tony's little sister), and Effy's best friend from season two, Pandora Moon. * Elizabeth \"Effy\" Stonem is the younger sister of Tony Stonem. She is the lead character of the series. She is played by Kaya Scodelario. She is popular but quiet. * Pandora \"Panda\" Moon is played by Lisa Backwell. Thomas is her boyfriend. * James Cook, known as Cook, is played by Jack O'Connell. He reappears in series 7. He is an outgoing 'party animal'. * Frederick \"Freddie\" Mclair is played by Luke Pasqualino. Cook and JJ are his best friends. They call themselves The Three Musketeers. He falls in love with Effy. * JJ Jones has Asperger syndrome. He is a virgin at the start of the series but he becomes more confident. He is played by Ollie Barbieri. In series 4 he becomes close friends with Thomas. Thomas helps him get a girlfriend, Lara. * Emily and Katherine \"Katie\" Fitch are identical twin sisters. They are played by real-life twins Megan and Kathryn Prescott. They are very different. Katie refers to herself as a WAG because she has a footballer boyfriend. Emily goes out with Naomi. * Naomi Campbell is played by Lucy Loveless. She goes out with Naomi and cheats on her. She reappears in season seven. She develops breast cancer and dies. * Thomas Tomone is an immigrant from the Democratic Republic of the Congo. He is played by Merveille Lukeba. Panda is his girlfriend. === Third generation === * Francesca \"Franky\" Fitzgerald is played by Dakota Blue Richards. * Richard \"Rich\" Hardbeck is Alo's best friend. He is played by Alexander Arnold. He is a fan of metal music. Grace becomes his girlfriend. * Grace Violet Blood is played by Jessica Sula. She is played by Jessica Sula. In the sixth series she is killed in a car crash. * Matthew \"Matty\" Levan is played by Sebastian de Souza. * Olivia \"Liv\" Malone is played by Laya Lewis. She is best friends with Mini and Grace. She is impulsive and likes to party. * Aloysius \"Alo\" Creevey is played by Will Merrick. He spends most of his time hanging out with Rich in his van. * Alexander \"Alex\" Henley is played by Sam Jackson. He appears in the sixth series. He is gay. * Nicholas \"Nick\" Levan is played by Sean Teale. He is Matt's brother. Mini and Franky are his ex-girlfriends. * Minerva \"Mini\" McGuiness is played by Freya Mavor. She is a 'queen bee'. == References == == Other websites == *E4's official Skins website * Category:2007 British television series debuts Category:2013 British television series endings Category:2000s British drama television series Category:2000s LGBT television series Category:2000s teen television series Category:2010s British drama television series Category:2010s LGBT television series Category:2010s teen television series Category:BAFTA Award winning programmes Category:Bristol Category:British LGBT television programmes Category:British teen television series Category:LGBT drama television series Category:British teen drama television series Category:English-language television programs",
 "title": "Skins (TV series)"
}