{
 "id": "183215",
 "text": "The President of Serbia is the head of state of the Republic of Serbia. Prior to the title of President, head of state which ruled Serbia was called a King. Presently serving as the head of state is President of Serbia, Aleksandar Vučić. President Tadic was elected for a second term with a 50.31% majority in the 2008 Serbian presidential election.Web site of the Serbian Government Tomislav Nikolić was President after winning the 2012 election. Aleksandar Vučić is the current President since winning the 2017 election. ==Socialist Republic of Serbia (1944–1992)== SR Serbia within Democratic Federal Yugoslavia and Socialist Federal Republic of Yugoslavia. President President President Election Term of office Term of office Term of office Party Notes Portrait Name Election Took office Left office Time in office Party Notes President of the Anti-fascist Assembly for the National Liberation of Serbia Siniša Stanković — 12 November 1944 7 April 1945 Communist Party President of the Presidium of the People's Assembly 1 Siniša Stanković — 7 April 1945 20 November 1946 Communist Party 2 Aćim Grulović — 20 November 1946 23 December 1948 Communist Party 3 Isa Jovanović — 23 December 1948 December 1953 5 years Communist Party League of Communists Presidents of the People's Assembly 4 Petar Stambolić — December 1953 April 1957 3 years, 4 months League of Communists 5 Jovan Veselinov — April 1957 26 June 1963 6 years, 2 months League of Communists 6 Dušan Petrović Šane — 26 June 1963 6 May 1967 League of Communists 7 Miloš Minić — 6 May 1967 6 May 1969 League of Communists 8 Dragoslav Marković — 6 May 1969 19 April 1974 League of Communists 9 Živan Vasiljević — 19 April 1974 6 May 1974 League of Communists Presidents of the Presidency Dragoslav Marković — 6 May 1974 5 May 1978 League of Communists 10 Dobrivoje Vidić — 5 May 1978 5 May 1982 League of Communists 11 Nikola Ljubičić — 5 May 1982 5 May 1984 League of Communists 12 Dušan Čkrebić — 5 May 1984 5 May 1985 League of Communists 13 Ivan Stambolić — 5 May 1985 14 December 1987 League of Communists 14 Petar Gračanin — 14 December 1987 20 March 1989 League of Communists Ljubiša Igić — 20 March 1989 8 May 1989 League of Communists 15 Slobodan Milošević — 8 May 1989 11 January 1991 League of Communists Socialist Party of Serbia President of the Republic Slobodan Milošević 1990 11 January 1991 28 April 1992 Socialist Party of Serbia ==Republic of Serbia (1992–2006)== Republic of Serbia within Federal Republic of Yugoslavia and the State Union of Serbia and Montenegro. President President President Election Term of office Term of office Term of office Party Notes Portrait Name Election Took office Left office Time in office Party Notes 1 Slobodan Milošević 1992 28 April 1992 23 July 1997 Socialist Party of Serbia Dragan Tomić — 23 July 1997 29 December 1997 Socialist Party of Serbia Acting 2 Milan Milutinović 1997 29 December 1997 29 December 2002 Socialist Party of Serbia Nataša Mićić — 29 December 2002 27 January 2004 Civic Alliance of Serbia Acting Dragan Maršićanin — 4 February 2004 3 March 2004 Democratic Party of Serbia Acting Vojislav Mihailović — 3 March 2004 4 March 2004 Serbian Renewal Movement Acting Predrag Marković — 4 March 2004 11 July 2004 G17 Plus Acting 3 Boris Tadić 2004 11 July 2004 5 June 2006 Democratic Party ==List of presidents== (2) (4) (2) (1) (1) (1) Order Head of State Head of State Head of State Lifespan Took office Left office Party 1 Slobodan Milošević Слободан Милошевић 1941–2006 11 January 1991 23 July 1997 Socialist Party of Serbia N/A Dragan Tomić Драган Томић 1936–2022 23 July 1997 29 December 1997 Socialist Party of Serbia 2 Milan Milutinović Милан Милутиновић born 1942 29 December 1997 29 December 2002 Socialist Party of Serbia N/A Nataša Mićić Наташа Мићић born 1965 29 December 2002 4 February 2004 Liberal Democratic Party N/A Dragan Maršićanin Драган Маршићанин born 1950 4 February 2004 3 March 2004 Democratic Party N/A Vojislav Mihailović Војислав Михаиловић born 1951 3 March 2004 4 March 2004 Movement for the Restoration of the Kingdom of Serbia N/A Predrag Marković Предраг Марковић born 1955 4 March 2004 11 July 2004 G17 Plus 3 Boris Tadić Борис Тадић born 1958 11 July 2004 5 April 2012 Democratic Party N/A Slavica Đukić Dejanović Славица Ђукић Дејановић born 1951 5 April 2012 31 May 2012 Socialist Party of Serbia 4 Tomislav Nikolić Томислав Николић born 1952 31 May 2012 31 May 2017 Serbian Progressive Party (formally independent) 5 Aleksandar Vučić Александар Вучић born 1970 31 May 2017 (Inaugurated on 23 June 2017) Incumbent Serbian Progressive Party ==Living former presidents== Name Term Date of birth Boris Tadić 2004–2012 Tomislav Nikolić 2012–2017 The most recent President to die was Milan Milutinović, who died on July 2, 2023. ==References== Category:Government of Serbia",
 "title": "President of Serbia"
}