{
 "id": "183488",
 "text": "The Portuguese Empire (Portuguese: Império Português) was the first global empire in history. It spread from South America to Africa, India and South East Asia. It began with the Portuguese exploration of the world during the 15th century and it lasted longer than all the other modern European empires. It lasted 486 years, longer than the Spanish, British, and French Empires. The Portuguese Empire had trade with the following areas *Goa, Malacca and Southeast Asia *China and Japan *Spice Islands (Moluccas) and the Treaty of Zaragoza *South Asia, Persian Gulf and Red Sea *Sub-Saharan Africa The 1890 British Ultimatum was an ultimatum by the British government that was delivered on 11 January 1890 to Portugal. The ultimatum forced the retreat of Portuguese military forces from areas in Africa that had been claimed by the Portuguese but were occupied by the British. == Fall == The Portuguese Empire, like the British, French and German Empires, was fatally damaged by the two world wars in the 20th century. The European powers were pressured by the Soviet Union and the United States and by independence movements inside the colonial territories. By the end of the 20th century, all of those colonial empires had been history. The rise of Soviet influence in the working class and the cost of the Portuguese Colonial War (1961–1974) led to the collapse of the Portuguese Second Republic (Estado Novo) in 1974. The National Salvation Junta (Junta de Salvação Nacional) ended the wars and made Portugal leave its African colonies. Civil wars soon broke out in Angola and Mozambique. That was a cause for thousands of Portuguese refugees to come from the former African colonies. Portugal gave Macau, its last colony, back to China in 1999. == Legacy == The seven former colonies of Portugal have Portuguese as their official language and are members of the Community of Portuguese Language Countries with Portugal. Portuguese is now one of the world's major languages. It is the language of Brazil, which is the largest country in South America. == References == * * Category:History of Portugal",
 "title": "Portuguese Empire"
}