{
 "id": "18345",
 "text": "General Charles André Joseph Marie de Gaulle (22 November 1890 - 9 November 1970) was a French military and political leader. He was president of France from 1959 to 1969. He was a founding member and leader of the French Resistance during the Second World War. De Gaulle chaired the Provisional Government of the French Republic from 1944 to 1946 in order to re-establish democracy in France. In 1958, he came out of retirement: the Algerian War was happening. He rewrote the Constitution of France and founded the Fifth Republic after it was approved by a referendum. He was elected President of France later that year, a position to which he was re-elected in 1965 and held until his resignation in 1969. The National Assembly brought him back to power in May 1958. He granted independence to Algeria. 900,000 French people in Algeria (called les pieds-noire) left for France. The Organisation armée secrète (OAS) tried to kill him. Frederick Forsyth used this incident as a basis for his novel The Day of the Jackal. After the Algerian conflict, de Gaulle wanted to improve the French economy, and have an independent foreign policy. This was called by foreign observers the \"politics of grandeur\" (politique de grandeur). See Gaullism. The French economy recorded high growth rates. In 1964, for the first time in nearly 100 years, France's GDP overtook that of the United Kingdom. This period is still remembered in France with some nostalgia as the peak of the Trente Glorieuses (\"Thirty Glorious Years\" of economic growth between 1945 and 1974). De Gaulle had many admirers, but he was also one of the most hated men in modern French history.Jackson, Julian. 1999. General de Gaulle and his enemies: Anti-Gaullism in France since 1940. Transactions of the Royal Historical Society 6th Ser., vol. 9, pp. 43–65. JSTORE Berstein, Serge, and Peter Morris. The Republic of de Gaulle 1958–1969 (The Cambridge History of Modern France) (2006) excerpt and text search *His most famous saying was: \"L'etat? c'est moi!\", roughly \"The State? it's me!\" == Death == De Gaulle died in Colombey-les-Deux-Églises in 1970 while playing cards because of a brain aneurysm. == References == Category:1890 births Category:1970 deaths Category:French generals Category:French people of World War II Category:Prime ministers of France Category:People from Lille Category:Presidents of France Category:Time People of the Year Category:People from Haute-Marne Category:Anti-communists Category:Politicians from Hauts-de- France Category:20th-century presidents of France Category:Heads of state of France",
 "title": "Charles de Gaulle"
}