{
 "id": "18372",
 "text": "Pol Pot (born Saloth Sâr; May 19, 1925 – April 15, 1998) was a Cambodian National Communist politician who was the dictator of Cambodia from 1975 to 1979. He was also the leader of the Khmer Rouge, who were radical members of the country's Communist Party. Pol Pot's government consisted of armed peasants. His government killed between 1.7 and 2.2 million people in the Cambodian genocide. He has been called one of the most brutal dictators in world history. Pol Pot was thrown out of power in January 1979, when the North Vietnamese military liberated Kampuchea. However, he remained active in politics and in the Khmer Rouge. In 1997, Pol Pot was put under house arrest and died the following year. ==Early life== Pol Pot was born on May 19, 1925. His village was around 2 miles (3.2 km) from the capital city of the Kompong Thom province. At that time, Cambodia was a colony of France (part of French Indochina). Pol Pot's father was a landowner named Pen Saloth. His mother was named Sok Nem, and the family had nine children. Around age 5 or 6, Pol Pot was sent to live with an older brother in Phnom Penh, where he received an education. Pol Pot's family had connections with the Cambodian royal family. His brother, Loth Suong, was a palace clerk. His cousin was married to Prince Sisowat Monivong and had a son named Kossarak. These connections helped Pol Pot get a scholarship to France. In 1949, he went to Paris, France, and studied radio electronics. However, he got distracted by Marxism, a form of communism. He didn't study, and his scholarship was taken away. In 1953, he went back to Cambodia and became a communist. The following year, Cambodia gained its independence from France and became the Kingdom of Cambodia. ==Revolution== In 1962, Pol Pot became the leader of the Communist Party in Cambodia. This party was illegal and hidden, because Prince Sihanouk did not like Pol Pot nor the Communists. Pol Pot went to the jungle and created a guerrilla force called the Khmer Rouge. (The Khmer are the main ethnic group in Cambodia, and rouge is French for \"red\", the colour of communism). As guerilla fighters, they hid and ambushed people rather than being visible and directly attacking their enemies. They were the source of Pol Pot's power. Most Khmer Rouge members were teenagers. In 1970, the U.S. got rid of Prince Sihanouk and unknowingly made Pol Pot more popular. They also made Prince Sihanouk angry, so he joined Pol Pot, but that alliance only gave Pol Pot an advantage. This created a lot of confusion and only made Pol Pot even more popular. During the Vietnam War, the United States tried to defeat the communist North Vietnamese, but only drove them deeper into the countryside. Some hid in Cambodia. Between 1969-1973 the U.S. bombed these Cambodian hiding places. Many peasants fled to cities to escape. ==Government== On April 17, 1975, Pol Pot entered Phnom Penh, Cambodia's capital city, and took control. He planned for a \"super great leap forward\", inspired by Mao Zedong's Great Leap Forward in China. But Pol Pot also had portraits of himself just like Adolf Hitler,Benito Mussolini,Hideki Tōjō,Vladimir Lenin,Joseph Stalin,Mao Zedong as well as Enver Hoxha,Walter Ulbricht,Erich Honecker,Nicolae Ceaușescu,and Kim Il Sung and Kim Jong-il,including the infamous Francisco Macías Nguema . Though mainly Lenin,Stalin and Mao Pol Pot and the Khmer Rouge forced all of the people in Cambodia's cities towards fields in the countryside. Many people died on the way to the fields. The people who survived had to do forced labor from dawn until dusk. Even more died in the fields from hunger, thirst, overwork, and sickness. They were harvesting fruits and rice, but got only a 180-gram can of rice every day. Every tenth day was a rest day, and there were festival days. The Khmer Rouge government closed banks, made money illegal, and closed free markets. They also made religion illegal. Teenagers had to join the army, and children learned how to set land mines and make booby traps. People were not allowed to gather in groups. Only two people were allowed to see each other at a time. People were forced to marry in big groups, and they could not choose who they married. After the Vietnamese and underground Cambodian parties got Pol Pot out of power on January 7, 1979, he went to a zone near Thailand called Pailin. There, he tried to get control of Cambodia again by fighting a ten-year-long guerilla war. The war was not successful, and the Khmer Rouge broke up in the early 1990s. ===Scale of the genocide=== Pol Pot was responsible for the Cambodian genocide. Kiernan, Ben 2003. The demography of genocide in Southeast Asia: the death tolls in Cambodia, 1975–79, and East Timor, 1975–80. Critical Asian Studies. 35 (4): 585–97.Heuveline, Patrick 2001. The Demographic Analysis of Mortality Crises: The Case of Cambodia, 1970–1979. Forced Migration and Mortality. National Academies Press. p. 124. ISBN 978-0-309-07334-9. This was the planned, organized persecution and genocide of Cambodians that the Khmer Rouge regarded as enemies. The genocide, malnutrition, and poor medical care killed between 1.5 and 2 million people (around one in every four people in Cambodia). Pol Pot's second in command, Noun Chea (also called Brother Number Two) later said that these mass killings were a mistake. ==Death== On the evening of April 15, 1998, Pol Pot died of a possible heart attack in his hut in the jungle. This was just just 2 days before the anniversary of Khmer Rouge's takeover of Cambodia. Nate Thayer believed that Pol Pot killed himself with diazepam (Valium) and chloroquine to avoid trial. He was cremated without any ceremony. ==Notes== ==References== Category:1925 births Category:1998 deaths Category:Former dictators Category:Cambodian genocide Category:Communist Party of Kampuchea politicians",
 "title": "Pol Pot"
}