{
 "id": "184088",
 "text": "Crowded House are a New Zealand-Australian rock group. They formed in 1985 in Melbourne, led by New Zealand singer-songwriter Neil Finn.McFarlane (1999) Finn is the main songwriter and creative director of the band. He has led it through several changes. The band has people from a few different countries: from New Zealand (Neil and his brother, Tim Finn and Eddie Rayner), Australia (Paul Hester, Nick Seymour, Peter Jones and Craig Hooper) and the United States (Mark Hart, and Matt Sherrod).\"Neil Finn and Nick Seymour\" Australian Broadcasting Corporation – 16 July 2007 Crowded House are referred to as The Crowdies by Australian fans. Originally active from 1985 to 1996, the band has had consistent commercial and critical success in Australia and New Zealand (NOTE: Used for Australian Singles and Albums charts from 1974 until ARIA created their own charts in mid-1988. In 1992, Kent back calculated chart positions for 1970–1974)\"Discography Crowded House\" australiancharts.com\"Discography Crowded House\" charts.org.nz and international chart success in two phases, beginning with their self-titled debut album, Crowded House, which reached number twelve on the US Album Chart in 1987 and provided the Top Ten hits, \"Don't Dream It's Over\" and \"Something So Strong\".[ \"Crowded House > Charts & Awards > Billboard Singles\"] Allmusic[ \"Crowded House > Charts & Awards > Billboard Albums\"] Allmusic Further international success came in the UK and Europe with their third and fourth albums, Woodface and Together Alone and the compilation album Recurring Dream, which included the hits \"Fall at Your Feet\", \"Weather with You\", \"Distant Sun\", \"Locked Out\", \"Instinct\" and \"Not the Girl You Think You Are\".Bourke (1997)\"Artists > Crowded House\" Chart Stats Founding drummer Hester left in May 1994, citing family reasons, but returned for their Farewell to the World concerts in Melbourne and Sydney in 1996. Neil Finn had decided to end the band to concentrate on his solo career and the Finn Brothers project with Tim. On 26 March 2005 Hester committed suicide, aged 46.Bernard Zuel, Nassim Khadem, Patrick Donovan, James Button \"Farewell to the clown prince\" The Sydney Morning Herald – 29 March 2005 In 2006, the group re-formed with new drummer Matt Sherrod. They have since released three albums, \"Time on Earth\" (2007), \"Intriguer\" (2010) and \"Dreamers Are Waiting\" (2021). ==References== Category:1985 establishments in Australia Category:1980s Australian music groups Category:1990s Australian music groups Category:2000s Australian music groups Category:2010s Australian music groups Category:Australian rock bands Category:Musical groups from Melbourne Category:Musical groups established in 1985",
 "title": "Crowded House"
}