{
 "id": "184095",
 "text": "Amy Jean Klobuchar (born May 25, 1960) is an American politician and lawyer. She is the senior United States Senator from Minnesota since 2007. She is a member of the Democratic Party. She is the first elected female senator from Minnesota and the second female senator in the state after Muriel Humphrey Brown. She was a lawyer in Minneapolis until being elected county attorney for Hennepin County in 1998, making her responsible for all criminal prosecution in Minnesota's most populous county. Klobuchar was first elected to the Senate in 2006, becoming Minnesota's first elected female United States Senator, and was reelected in 2012 and 2018. In 2009 and 2010, she was called a \"rising star\" in the Democratic Party. In February 2019, she announced her candidacy for President of the United States in 2020. ==Early life== Klobuchar was born in Plymouth, Minnesota. She is the daughter of Rose Katherine (née Heuberger) and James John \"Jim\" Klobuchar, a columnist for the Star Tribune. Klobuchar was a valedictorian at Wayzata High School. She received her B.A. degree in political science in 1982 from Yale University.1982 Yale Banner, p. 394. During her time at Yale, Klobuchar spent time as an intern for Senator Walter Mondale. Klobuchar received her Juris Doctor degree from the University of Chicago. ==Law career== Klobuchar was elected Hennepin County attorney in 1998, and reelected in 2002. In 2001 Minnesota Lawyer named her \"Attorney of the Year\". Klobuchar was President of the Minnesota County Attorneys Association from November 2002 to November 2003. ==U.S. Senate== In early 2005, Senator Mark Dayton announced that he would not seek re-election to the U.S. Senate. She was seen as a favorite for the DFL nomination for the 2006 election. In the general election, Klobuchar faced Republican candidate Mark Kennedy. On March 30, 2008, Klobuchar announced her endorsement of Senator Barack Obama in the Democratic presidential primary, promising her unpledged superdelegate vote for him. Klobuchar faced State Representative Kurt Bills and won a second term in the U.S. Senate in 2012. In late 2016, Klobuchar was known to have passed more legislation than any other senator. In February 2017, she called for an independent, bipartisan commission like the 9/11 Commission to investigate ties between Russia and U.S. President Donald Trump and his administration. She maintained high approval ratings throughout 2017, with the Star Tribune's Minnesota Poll announcing in April 2017 that her approval rating was 72%. In October 2017, Morning Consult listed Klobuchar in the Top 10 of their list of senators with the highest approval rating. In 2017, Klobuchar and Bernie Sanders represented the Democratic Party in a televised debate on healthcare policy and the possible repeal of the Affordable Healthcare Act on CNN. ==2020 presidential campaign== On February 6, 2019, Klobuchar announced on her Twitter that she will announce her candidacy for President of the United States on February 10 in Minneapolis. On February 10, 2019, Klobuchar announced that she is running for President in the 2020 United States presidential election. Klobuchar's allegedly harsh treatment of her Senate staff received some coverage before her announcement.\"Sen. Amy Klobuchar's abuse of staff scared off candidates to manage her presidential bid,\" The Huffington Post, Feb. 6, 2019 \"Staffers, Documents Show Amy Klobuchar’s Wrath Toward Her Aides,\" BuzzFeed, Feb. 8, 2019 She ended her campaign on March 2, 2020 after losing the first four Democratic primary contests. ==Personal life== In 1993, Klobuchar married John Bessler. They have a daughter. She is a member of the United Church of Christ. In September 2021, she announced that she was diagnosed with breast cancer seven months before. ==References== ==Other websites== * Senator Amy Klobuchar official U.S. Senate site * Amy Klobuchar for Senate * * * * \"The Audacity of Minnesota: Senator Amy Klobuchar,\" Elle, Lisa DePaulo, March 30, 2010 * Collected coverage from Minnesota Public Radio — Campaign 2006: Amy Klobuchar Category:1960 births Category:Living people Category:2020 United States presidential candidates Category:American Calvinists Category:Lawyers from Minnesota Category:Congregationalists Category:United States senators from Minnesota Category:University of Chicago alumni Category:Democratic Party (United States) politicians Category:Yale University alumni",
 "title": "Amy Klobuchar"
}