{
 "id": "184205",
 "text": "Weston-on-Trent is a village and parish in Derbyshire. It is to the north of the River Trent. At the 2004 census there were about 800 people in the village aged sixteen to seventy-four years. The Domesday Book: \"Weston-on-Trent is spelt as Westune or Westone in the Domesday Book.Domesday Book: A Complete Transliteration. London: Penguin, 2003. p.1422 Weston is listed amongst the small proportion of manors that are owned directly by the king. In 1086, the book notes that > \"In Weston-On-Trent\" with its Ælfgar, (Earl of Mercia) had ten of land and > two and a half to the . There is land for as many ploughs. There are now > three ploughs in and twenty four and six having twelve ploughs and for rent- > paying tenants paying sixteen shillings. There are two churches and a priest > and a mill rendering ten shillings and four pence and a fishpond and a ferry > rendering thirteen shillings and four pence and fifty one acres of meadow > and a pasture half a league long and three furlongs broad. Value sixteen > pounds (TRETRE in Latin is Tempore Regis Edwardi. This means in the time of > King Edward before the Battle of Hastings. eight pounds)\"Domesday Book: A > Complete Translation. London: Penguin, 2003. p.743 — Note: Berewicks (outlying estates) of this manor, at that time, included Aston-on-Trent and Shardlow. Earlier evidence dated 1009 place Weston on Trent at the head of an estate which went as far as the Derwent and included not only Shardlow and Aston but also Wilne.Weston on Trent in 2000 A.D - A Souvenir Weston Local History Society 2000 In 1009 Æþelræd Unræd (King Ethelred the Unready) signed a document which agreed the size of Weston. The document shows that Weston owned the crossings of the River Trent. These crossings were for one of the roads going up or down England. The land was at Weston upon Trent and at Morley, Smalley, Ingleby, Crich and Kidsley. This land was given to Morcar, the King's chief minister. Morcar could decide a person's life or death without the King.Charter of Æthelred, The Great Council, 1009, accessible at Derby records ==References== Category:Villages in Derbyshire",
 "title": "Weston-on-Trent"
}