{
 "id": "184220",
 "text": "Catherine II (, romanized: Yekaterina II, born Sophie of Anhalt-Zerbst; 21 April 1729 — 6 November 1796) most commonly known as Catherine the Great (Russian: Екатерина Великая, romanized: Yekaterina Velikaya) was the Tsarina of Russia from 1762 until her death in 1796. She came to power after overthrowing her husband, Peter III. During her long 34-year-reign, Russia experienced a renaissance of culture and sciences, which led to the founding of many new cities, universities, and theatres, along with large-scale immigration from the rest of Europe and the recognition of Russia as one of the great powers of Europe. She was one of Russia's greatest monarchs. == Early life == Catherine was born in Stettin, which was a part of the Kingdom of Prussia at the time. She was the daughter of Prince Christian August of Anhalt-Zerbst and Princess Johanna Elizabeth of Holstein-Gottorp. She had five brothers and sisters. She married her cousin Peter III (who, like Catherine, was German) at age fifteen, and became empress of Russia at age 32. She was educated in three languages (Russian, German and French). She grew up as a Lutheran (Protestant). When she married Peter, she changed to the Russian Orthodox church. == Marriage == Catherine's marriage was said to be unfaithful and distraught. Peter and Catherine were each said to have several lovers. After they had been married nine years, Catherine bore a son, Paul. Paul was born on . Both parents accepted him as legitimate, even though there had been rumors about Catherine having been unfaithful. Catherine also had a daughter Anna, born in 1757. Anna died in 1759. Catherine and Peter had a very difficult relationship. When Peter died, Catherine was left to rule Russia on her own. Catherine had many lovers, probably because of the difficult marriage; over twenty lovers are known. A few of these seem to be more important: * Count Serge Saltykov was her first lover, and was probably the father of Paul * Count Stanisław August Poniatowski was made king of Poland, because of Catherine's help * Count Grigory Orlov was one of the leading figures of the coup against Peter III, together with his brother Alexey Grigoryevich Orlov. They also gave Catherine the Orlov diamond as a gift. This diamond was later put into the Russian sceptre. * Prince Grigory Potyomkin was very successful in the military forces. He started the Black Sea Fleet, founded cities such as Sevastopol or Kherson. He is said to have been Catherine's true love. The two are said to even have married in secret. * Count Platon Zubov was her last love. When she died, aged 67, he was not even 40 years old. == Reign == Six months after Peter took the throne, Catherine led a palace coup to overthrow him. The question of who killed him and why is still much discussed. Catherine was greatly admired by the public. She was much involved in foreign affairs, including successful Russo-Turkish wars which conquered new territories for Russia. == Death == Catherine suffered a stroke on 1. Due to the stroke, she lost consciousness. She died in her bed at 9:20 the following evening, while she was still unconscious. Catherine was buried at the Peter and Paul Cathedral in Saint Petersburg. Category:Russian Orthodox saints Category:Emperors and Empresses of Russia Category:House of Holstein-Gottorp-Romanov Category:18th century in Russia Category:People from Szczecin Category:1729 births Category:1796 deaths",
 "title": "Catherine II of Russia"
}