{
 "id": "184307",
 "text": "Grand Theft Auto IV is a 2008 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the sixth main entry in the Grand Theft Auto series, following 2004's Grand Theft Auto: San Andreas, and the eleventh instalment overall. Set in the fictional Liberty City, based on New York City, the single-player story follows Russian war veteran Niko Bellic and his attempts to escape his past while under pressure from high-profile criminals. The open world lets players freely roam Liberty City, consisting of three main islands, and the neighbouring state of Alderney, which is based on New Jersey. Its successor, Grand Theft Auto V, was released in 2013. == Gameplay == Grand Theft Auto IV has the same basic gameplay from the earlier games in the series. The player can walk, run, swim, climb, jump and use weapons and basic hand-to-hand combat. Players can steal and drive many types of cars, boats, helicopters and motorcycles. Players can explore and choose how they want to play the game. Players can complete missions, but these are not needed to get farther into the game to open content. When the player does a crime and the police see it, they will start to follow the player and try to catch him. == Random characters == There are 14, 3 and 3 Random characters in GTA IV, TLaD and TBoGT meet all over the city. ===GTA IV=== * Brian Meech (Justin Reinsilber) * Real Badman (Seeborn†) * Mel (Larry Fleischman) * Ilyena Faustin (Marcy McGuigan) * Hossan Ramzy (Sean T. Krishnan) * Sara (Deborah Yates) * Pathos (David S. Shaw) * Jeff Harlingford (Harry Chase) * Cherise Glover (Ja'Tovia Gary) * Marnie Allen (Reyna de Courcy) * Eddie Low (Victor Verhaeghe) * Ivan Bytchkov (Lev Gorn) * Clarence Little (Jerry Clicquot) * Gracie Ancelotti (Rebecca Benhayon) ===TLaD=== * Dave Grossman (Jay Patterson) * Malc (Walter Mudu) * Brian Jeremy (Adrian Martinez) ===TBoGT=== * Arnaud (Simon Jutras) * Margot Summers (Sarah Clements) * Daisy Cash-Cooze (Elizabeth Jasicki) == Reception == Grand Theft Auto IV was praised for having more realistic graphics and story. ==Notes== == References == Category:2008 video games Category:Grand Theft Auto Category:Rockstar Games games Category:Action- adventure games Category:Episodic video games Category:Open-world video games Category:Organized crime video games Category:PlayStation 3 games Category:Video games about the illegal drug trade Category:Windows games Category:Xbox 360 games",
 "title": "Grand Theft Auto IV"
}