{
 "id": "184461",
 "text": "The Pala Empire was a dynasty in control of the northern and eastern Indian subcontinent, mainly the Bihar and Bengal regions, from the 8th to the 12th century. The name Pala (Modern পাল pal) means \"protector\" and was used as an ending to the names of all Pala monarchs. == History == === Establishment === After the Gauda kingdom fell, Bengal was in a state of anarchy and there was no central authority, and there was constant fighting between minor chieftains. Gopala ascended the throne as the first Pala king during these times. === Expansion === Gopala's empire was greatly expanded by his son Dharmapala and his grandson Devapala. At first, Dharmapala was defeated by the Pratihara ruler Vatsaraja. Later, the Rashtrakuta Emperor Dhruva defeated both Dharmapala and Vatsaraja. After Dhruva returned to the Deccan, Dharmapala built a powerful empire in northern India. Soon, Dharmapala's expansion was stopped by Vatsaraja's son, Nagabhata II, who took control of Kannauj and defeated Chakrayudha. Nagabhata II then moved towards Munger and defeated Dharmapala in a fierce battle. Dharmapala had to surrender and seek help from the Rashtrakuta emperor Govinda III, who then invaded Northern India and defeated Nagabhata II. Dharmapala was then succeeded by his son Devapala. During the reign of Devapala, the Pāla Empire reached its greatest extent. Devapala is known for subjugating the Dravidas (Pandyan Empire), the Gurjaras (Gurjara Pratihara Dynasty), the Utkalas of Odisha, the Pragjyotishas of Assam, and the Hunas and Kambojas in the northwest, as recorded in his inscriptions and the inscription that records of his reign. Dharmapala's eldest son, Rajyapala, died before him, so his next son, Mahendrapala, became king. Mahendrapala likely kept control of his father's large empire and fought against the Utkalas and Hunas.Bhattacharya, Suresh Chandra, Pāla Kings in the Badal Praśasti — A Stock-Taking, Journal of Ancient Indian History, University of Calcutta, Vol. XXIV, 2007-08, pp. 73-82. He passed the empire to his younger brother Shurapala I, who ruled over Bengal, Bihar, and Uttar Pradesh, as confirmed by his Mirzapur copperplate. What happened during the rule of Shurapala's son, Gopala II, remains unknown. After Gopala II, Dharmapala's lineage ended, and the throne was taken by the descendants of Dharmapala's younger brother, Vakapala. == List of rulers == ==References==",
 "title": "Pala Empire"
}