{
 "id": "184417",
 "text": "The National Capital Region () is an official federal name for the Canadian capital of Ottawa, Ontario, and neighbouring Gatineau, Quebec, and the area near them. The National Capital Region covers an area of 3,171 square kilometres (1,224 square miles). It has a population of 1,308,490. The Ottawa part of the region is part of the eastern subregion of Ontario. There is also a larger metropolitan area, called the Ottawa-Gatineau CMA. It is the only CMA in Canada to include parts of two provinces. It has an area of 8,047 square kilometres (3,107 square miles) and a population of 1,488,307. The National Capital Region is not a separate political jurisdiction, although the National Capital Commission is deeply involved in political, cultural, and land use planning matters in the National Capital Region. Proposals have sometimes been made to separate the National Capital Region from its two respective provinces, and transform it into a separate capital district, like the District of Columbia in the United States or the Australian Capital Territory. Such proposals have never come close to passage, and there does not currently appear to be any political will or necessity to pursue this option. == Cities, towns, and populations within Ottawa-Gatineau CMA == Ottawa - Gatineau CMA 2021 population by census subdivision Ottawa - Gatineau CMA 2021 population by census subdivision Ottawa - Gatineau CMA 2021 population by census subdivision Ottawa - Gatineau CMA 2021 population by census subdivision Name Province Type 2021 Population Arnprior Ontario Town Beckwith Ontario Township Bowman Quebec Municipality Cantley Quebec Municipality Carleton Place Ontario Town Chelsea Quebec Municipality Clarence-Rockland Ontario City Denholm Quebec Municipality Gatineau Quebec Ville La Pêche Quebec Municipality L'Ange-Gardien Quebec Municipality Lochaber Quebec Township Lochaber-Partie-Ouest Quebec Township Mayo Quebec Municipality McNab/Braeside Ontario Township Mississippi Mills Ontario Town Mulgrave-et-Derry Quebec Municipality North Grenville Ontario Municipality Notre-Dame-de-la-Salette Quebec Municipality Ottawa Ontario City Pontiac Quebec Municipality Russell Ontario Township Thurso Quebec Ville Val- des-Bois Quebec Municipality Val-des-Monts Quebec Municipality Total CMA -- -- == References == == Other websites == *National Capital Commission - Commission de la capitale nationale Category:Regions of Canada Category:Ottawa",
 "title": "National Capital Region (Canada)"
}