{
 "id": "184504",
 "text": "The Grote of Martinikerk, or the Grote Kerk, is a Protestant church in the Frisian village of Sneek (Snits in West-Frisian) built in the 11th century and made of tuff. Around 1300, the church was enlarged and got three towers in a Romanesque west facade. A wooden clock house was also added. The current church dates from 1498. The sacristy on the south side is from the 16th century and is now used as a vestry. In 1681, the Romanesque west front collapsed, bringing with it the middle of the three towers; the other two towers were demolished. The heavily damaged church was rebuilt, but the towers were not. The places where these towers were located can be seen in the old cemetery. In 1925, the foundations of the pillars were renewed to prevent further subsidence of the church. The church also received electric lighting that year. The church was thoroughly restored in the 1970s and 1980s. During the last restoration, the plaster ceiling was removed from the church, and an oak barrel vault was installed in the church again. The church is located on a mound in the center of Sneek; it is a three-aisled hall church. The church is now used for the worship services of the Protestant congregation in Sneek. The church building can be visited in the summer in the afternoon and sometimes also in the evening. In the summer, there are organized concerts on Monday evenings, except during the Sneekweek. As a result of the Reformation, the church passed into Protestant hands in 1580. The interior was austere; altars and statues disappeared, and the organ was no longer allowed to be used. An organ as an accompaniment instrument did not come into vogue again until the end of the 17th century. Until then, the psalms were sung, supported by a cantor. In the 17th century, the church was also decorated with paintings and text plates. In 1795 the Batavian Revolution took place, which was about \"Liberty, equality ,and fraternity\". The stained -lass windows were replaced by clear glass, tand he 'grand' mourning boards and family coats of arms on the benches were removed. The weapons were also chiseled out of the tombstones in many places. On four sides is a portal to enter the church: * On the east side is the oldest entrance with a gate from 1652. This is the main entrance and is located on the side of the town hall. * On the south side is a small wooden entrance for the poor and orphans. * A large entrance has been made on the north side, in classicist style. * A toilet group has been built in under the balcony on the west side. In the years 1710–1711, an organ was built on the division between the church and the choir by the famous organ builder Arp Schnitger on a new gallery. The organ had a main work, back work, chest work, and a free pedal. At that time, it was one of the largest and most modern organs in Friesland. Over the years, the disposition was slightly modified, and in 1870, the organ survived total construction. In 1898 he organ was rebuilt by the organ builders Van Dam. The legendary freedom fighter Pier Gerlofs Donia is buried there. Category:Churches in Europe Category:Buildings and structures in the Netherlands Category:Protestantism in the Netherlands Category:Súdwest-Fryslân Category:14th-century buildings and structures",
 "title": "Grote of Martinikerk"
}