{
 "id": "184660",
 "text": "Joan Waste (1534 - 1 August 1556) was a blind woman who was burned in Derby because she would not stop being a Protestant.The History of the County of Derby, Stephen Glover, Thomas Noble, 1829, accessed 23 February 2009John Foxe's Book of Martyrs, 1563, republished 2006, accessed February 2009 She had bought a Bible so that friends could read to her. ==Biography== Waste was blind when she was born in 1534. Her parents were William and Joan Waste. William's job was to cut people's hair and make rope. By the age of twelve, Joan had learned to make ropes and clothes. In 1553, Queen Mary came to the throne and it was made illegal to hold Protestant views. Mary condemned 277 people for not having the right sort of religion. This crime was called heresy.Mary Tudor, Catholic Encyclopedia, accessed February 2009 Joan Waste was taken to court for breaking the law. The judge was a man employed by the bishop. She had to defend her views and was told she would die. She had not liked the fact that the church services were being read in the language of Latin. She was to die for being a Protestant and for refusing to agree with the Catholic Church. She bought a Bible in English, but the Catholic Church wanted them to only be in Latin. She asked friends to read to her for a penny.A Martyr in the Parish , St Peters Derby, accessed February 2009 Her trial took place at All Saints Church. This main building has been rebuilt, but the tower was built in 1530. This tower is now part of Derby's cathedral. On the day of her death she walked arm-in-arm with her twin brother to be burned. Her death took place at the Windmill Pit on the Burton Road in Derby. She was hanged over the fire with a rope. She fell into the fire when the rope burned through. The judge was Antony Draycot. He went home to his meal.Gordon Goodwin, ‘Draycot, Anthony (d. 1571)’, rev. Andrew A. Chibi, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 28 Feb 2009 The place where Joan Waste was killed is now the site of a church.A History of the Life, Trial, & Execution of Joan Waste, who was burnt in Windmill Pit near Derby in the year 1556 , Foxes Book of Martyrs, 1563 When Elizabeth I of England became queen in 1559 she removed Ralph Baines from the job of Bishop of Coventry and Lichfield.Bishops', Fasti Ecclesiae Anglicanae 1541-1857: volume 10: Coventry and Lichfield diocese (2003), pp. 1-5. URL: Date accessed: 20 February 2009.> Baines was sent to be a prisoner of the Bishop of London. The judge was also sent to be a prisoner. He died after being released in 1571. ==References== Category:1534 births Category:1556 deaths Category:Blind people Category:English Protestants Category:Executed English people Category:People from Derby",
 "title": "Joan Waste"
}