{
 "id": "184780",
 "text": "Commerzbank Tower is a skyscraper in Frankfurt am Main, Hessen, Germany. At 259 meters, or 850 feet (300 meters with antenna included), it is Germany's tallest skyscraper and the third tallest building in Europe. It was completed and opened in 1997. Commerzbank Tower is located in Frankfurt's district Innenstadt in the centre of the city. It is home to the headquarters of the second largest German bank, Commerzbank. == History == From 1970 onwards, the previous head offices were centralised in Frankfurt am Main, where the legal seat has also been located since 1990. In the early 1990s, Commerzbank sought to build a new skyscraper in the center of Frankfurt am Main. The aim was to consolidate a large part of the rented locations in the city. The extraordinary skyscraper was designed by Lord Norman Foster. Since 1997, the tower has been a prominent feature of the Frankfurt skyline and is regarded as a model for environmentally friendly and energy-saving architecture. == Architecture == The floor plan forms a triangle with slightly outwardly curved sides. The tower appears open and transparent due to the atrium, also triangular. A double-skin facade encloses the building. The stepped top of the tower creates a striking building termination and sets an expressive sign for the banking district. The building was constructed from 1994 to 1997 and cost 600 million DM. It has 56 floors and an area of 109,200 square metres. The architect who designed the building is Norman Foster. The skyscraper weighs about 200,000 tonnes and contains 18,800 tonnes of steel - twice as much as the Eiffel Tower in Paris. == Green Building == The architect and his client worked together to make the Commerzbank tower innovatively environmentally- and climate-friendly. Natural ventilation and environmentally-friendly air conditioning create a long-term contribution to climate protection. The tower has been supplied entirely with \"green\" electricity since the beginning of 2008 and - like all Commerzbank buildings - is cleaned exclusively with biodegradable cleaning products. In 2009 the city of Frankfurt awarded the Commerzbank tower the \"Green Building Frankfurt\" award. == Present == The magnificent building at the Kaiserplatz in Frankfurt is the Commerzbank's Head Office, and 2.800 people work there. == References == Category:Buildings and structures completed in the 1990s Category:Skyscrapers in Frankfurt Category:1997 establishments in Germany",
 "title": "Commerzbank Tower"
}