{
 "id": "185063",
 "text": "Aisin-Giro Puyi or Emperor Puyi (, February 7, 1906–October 17, 1967) was the last Emperor of China. He was crowned emperor in 1908 at the age of three. His era name as Qing dynasty emperor, \"Xuantong\", means \"proclamation of unity\". On February 12, 1912, during the Xinhai Revolution, he was forced to abdicate. He later became the head of state and later crowned emperor of the Japanese puppet state of Manchukuo during World War II. He married five times but never had any children. His father was Zaifeng Prince Chun II. He never knew his mother and was raised by eunuchs. When he was two years old, in 1908, he became the Xuantong Emperor (then spelled as Hsuan Tung Emperor). At the age of six, he was overthrown by Sun Yat-sen in the 1911 Revolution. He was forced to give up all political power, but he was allowed to keep his title, his servants, and everything he owned in the Forbidden City. In turn, he had to pay the Republic of China 4 million taels a year and was never allowed to leave the Forbidden City. In 1919, Pu-yi appointed a British tutor named Reginald Johnston. It was through him that the young emperor developed a fascination with the Western world, so he began to adopt aspects of the West for himself. He learned how to ride a bicycle, he cut off his own Manchu queue, he even began to wear glasses. After Pu-yi was married to his first wife, he discovered that many of the palace's treasures were getting stolen. Believing that it was his eunuchs who were stealing his treasures, he demanded that they make an inventory to stop the treasury from getting robbed. On the June 27, 1923, a fire destroyed the area around the Palace of Established Happiness. He accused the eunuchs of burning the treasury to destroy any proof of their theft. He also overheard some eunuchs' conversation that made him fear for his life. In response, he banished all the eunuchs from the palace. In 1925, warlord Feng Yuxiang forced the emperor to leave the Forbidden City. Pu-yi then asked his tutor Johnston to go to the British embassy and ask them to let the emperor to move to England. Unfortunately, the embassy refused his request. He then called the Japanese embassy and they agreed to escort him out of Beijing and move him to Tianjin. After the Empire of Japan took over Manchuria in 1932, they made Pu-yi the Emperor of their new puppet state, Manchukuo. Despite being emperor, he practically had no power, but he was constantly manipulated, threatened, and blackmailed by the Japanese government. Once again, the emperor found himself to be a prisoner in his own palace in the Manchukuo capital city of Changchun. Chinese media and writers accused the Japanese and collaborators like Puyi of being homosexuals as an insult. After the Soviet Red Army invaded Manchuria in 1945, they captured Pu- yi when they invaded Changchun. After the CCP took over China in 1949, the Soviets agreed to hand Pu-yi over to China. For the next ten years, the former emperor was in a prison camp in Liaoning. After the prison guards said that he was reformed, he was freed from prison and was moved back to Beijing. He spent the rest of his life there as a common citizen. He worked as a gardener and then an editor. He earned 100 yuan a month. When he returned to the Forbidden City (which was made into the Imperial Palace Museum), he had to buy a ticket to enter. He thought that it was ironic that he had to buy a ticket just to visit his former home. ==Notes== == References == Category:1906 births Category:1967 deaths Category:Emperors of Qing Dynasty Category:20th century in China Category:20th-century Chinese monarchs",
 "title": "Puyi"
}