{
 "id": "18520",
 "text": "A cartoon is a type of visual art that is usually drawn based on real things. Cartoons are sometimes animated. The word cartoon has meant a lot of different things but now it means but the either: an image or series of images created to be funny or a movie with Illustrations that are animated. Someone who creates the first kind of cartoon is called a cartoonist. Someone who makes the second kind of cartoon is sometimes called a cartoonist but is also called an animator. The concept originated in the Middle Ages, and first described a preparatory drawing for a piece of art, such as a painting, fresco, tapestry, or stained glass window. In the 19th century, beginning in Punch magazine in 1843, cartoon came to refer – ironically at first – to humorous artworks in magazines and newspapers. Then it also was used for political cartoons and comic strips. When the medium developed, in the early 20th century, it began to refer to animated films that resembled print cartoons. ==Types of cartoons== ===Cartoon for an artwork=== The oldest meaning is a drawing that is a full-sized design for a finished artwork. The cartoon might be a drawing for a painting that was going to be put onto a wall or ceiling in fresco. The cartoon would be pinned against the wall and its design marked onto the plastered of the wall. Cartoons were also made to design tapestry. The most famous cartoons of this kind are a set by Raphael which show the \"Life of St Peter\". The cartoons are in the Victoria & Albert Museum. The finished tapestries belong to the Vatican and were made for the Sistine Chapel. ===Political cartoon=== In the 1700s, artists such as William Hogarth often made sets of humorous (funny) drawings that were about political subjects, such as poverty, elections, war and riots. The drawings were made into prints and were sold cheaply. These prints were not called cartoons at that time, but they led to the idea of modern political cartoons in newspapers. Nowadays many newspapers publish a different political cartoon in the paper, every day. The word \"cartoon\" was first used in this way in 1843 in an English magazine called Punch. A political cartoon does not always show real people. Sometimes it may use a personification of a country or organization as a person, an animal, or a monster. For example, Britain might be shown as a woman holding a baby Australia in her arms. Russia might be shown as a baby bear or a dolphin. The United States might be shown as a Bald Eagle. ===Comic strips=== Political cartoons were often drawn to show several different stages of the same story. Many of Hogarth's famous political cartoons do this. From this came the idea of telling funny stories in a series of pictures. Comic strips are a type of \"cartoon\" that is published in newspapers, but they are usually just called \"comic strips\". Comic books assemble many strips in a book. The book may tell a long story, longer than a newspaper would want to print, or several stories. Comic strips posted on the internet are web comics. Some use animation and sound for special effects. Like comic books they may be large, and most offer a large collection of earlier strips for new readers, so longer stories can be told. Many webcomics are published (shown to people) by independent artists. ===Movie Cartoons and TV Show Cartoons=== * Main article: Animated cartoon From the beginning of the movie industry, some artists began experimenting with making animated drawings that seemed to move. These moving drawings also became known as \"cartoons\". They often depict \"anthropomorphic\" animals rather than humans. They were often just for fun, but sometimes, particularly during World War II, were used for political reasons, just like the cartoons in newspapers. At first, movie cartoons were quite short. When a person bought a movie ticket, they would see a news program, two or three cartoons in black and white and a movie. Walt Disney then totally got the idea to tell a long story as a \"cartoon\" and \"animated cartoon\". The first example made was Snow White and the Seven Dwarfs (1937). Movie cartoons soon became a popular type of entertainment. Modern animated features are created using computer graphics, rather than hand-drawn animation. The famous iconic animated cartoon characters from the golden age include Felix the Cat, Mickey Mouse, Donald Duck, Betty Boop, Popeye, Bugs Bunny, Daffy Duck, Looney Tunes, Tom and Jerry, and Woody Woodpecker. There are some cartoons that were on television, including The Flintstones, Scooby-Doo, and SpongeBob SquarePants. == References ==",
 "title": "Cartoon"
}