{
 "id": "18531",
 "text": "The Academy Awards, commonly known as the Oscars, are the best-known movie awards in the United States. The awards have been given by the Academy of Motion Picture Arts and Sciences since 1929. The awards ceremony takes place each year in late February or early March in Los Angeles, California. ==History== At the end of the 1920s, the American film industry was in a crisis. When the radio was invented, people didn't go to the cinema as often as they used to. The owners of the studios had problems. They had to pay the workers a good salary, but that was impossible at that time. Many people fought for a good salary and a good working time. The director of the successful Metro-Goldwyn-Mayer-Studios, Louis B. Mayer, met two good friends because he wanted to speak about the problem. ==Oscar statue== ===Naming=== In the first years of the award, the trophy was called the Academy Award of Merit. The origin of the name Oscar is not clear. It is certain that the name was used in 1931. There may be up to four people that the \"Oscar\" is named after. The former board secretary of the Academy Margaret Herrick said: \"He looks like my uncle Oscar!\" Bette Davis said that the statue looked like her first husband Harmon \"Oscar\" Nelson. The film columnist Sidney Skolsky said that he was the name-giver, and the fourth person was Walt Disney. It is said that Oscar is not the official name of the statue, but the nickname is trademark-protected. ===Trophy=== The statue is around 13 inches tall and weighs about 8 pounds. == Categories == Current Awards * Best Picture – since 1928 * Best Actor – since 1928 * Best Actress –since 1928 * Best Supporting Actor – since 1936 * Best Supporting Actress – since 1936 * Best Animated Feature – since 2001 * Best Art Direction – since 1928(also called Interior or Set Decoration) * Best Cinematography – since 1928 * Costume Design – since 1948 * Directing since 1928 * Documentary Feature since 1943 * Documentary Short Subject since 1941 * Film Editing – since 1935 * Best Foreign Language Film – since 1947 * Makeup – since 1981 * Original Music Score- since 1934 * Best Song- since 1934 * Animated Short Film – since 1931 * Live Action Short Film since 1931 * Academy Award for Sound Mixing since 1930 * Best Sound Effects Editing – since 1963 * Best Visual Effects – since 1939 * Best Adapted Screenplay – since 1928 * Best Original Screenplay – since 1940 * Academy Award, Scientific or Technical – since 1931, presented at three levels Retired Awards * Best Assistant Director – 1933 to 1937 * Best Dance Direction – 1935 to 1937 * Comedy Direction – 1928 only * Engineering Effects – 1928 only * Academy Award for Best Original Music or Comedy Score \\- 1995-1999 * Academy Award for Best Original Story – 1928 to 1956 * Academy Award for Best Score- Adaptation or Treatment – 1962 to 1962 and 1973 * Best Short Film - Color – 1936 and 1937 * Best Short Film - Live Action - 2 Reels – 1936 to 1956 * Short Film - Novelty – 1932 to 1935 * Best Title Writing – 1928 only * Unique and Artistic Production – 1928 only ==Records== ===The most successful films=== Gone with the Wind from 1939 was the most successful film for a long time with ten Oscars. Then, in 1960, Ben-Hur won eleven Oscars. In 1998, Titanic also won eleven Oscars, so they were in a tie. Six years later, The Lord of the Rings: The Return of the King won eleven Oscars. The five categories 'Best Picture', 'Best Director', 'Best Actor', 'Best Actress' and 'Best Original Screenplay' are the most important categories, and they are called the 'Big Five'. There are only three films that won all of these categories: It Happened One Night, One Flew Over the Cuckoo's Nest and The Silence of the Lambs. All About Eve, Titanic and La La Land all hold the record for the highest number of nominationsː 14 nominations. ===The most successful film workers=== Katharine Hepburn (1907–2003) has the most awards as a performer with 4 Oscars in the category of 'Best Actress'. Meryl Streep has the most nominations among performers with 21 Oscar nominations. Jack Nicholson, Daniel Day-Lewis, and Walter Brennan (1894–1974) have three Academy Awards each, the most for men. Nicholson also has the nomination record for men with 12 nominations. The person who has the most Academy Awards is Walt Disney (1901–1966) with 26, including 4 Honorary Oscars and 37 nominations. Moreover, he won 4 awards in 1954, so he got the most awards in one year. The woman who has the most Oscars is the costume designer Edith Head (1897–1981). She has 8 Oscars and 27 nominations. The living people with the most Oscars are the composer Alan Menken (8 Oscars) and special effects artist Dennis Muren (8 Oscars for best visual effects, plus one for technical achievement and 15 nominations). The cartoon characters Tom and Jerry are the cartoon movie stars with have the most awards with 7. == Other websites == * * * Website of the Academy of Motion Picture Arts and Sciences * Official Academy Awards Database (searchable) * . Category:Los Angeles",
 "title": "Academy Award"
}