{
 "id": "185592",
 "text": "The Man from Earth is a 2007 movie written by Jerome Bixby. The movie tells the story of John Oldman. All of the movie takes place in a small house and its porch, where Oldman tells his friends that he is a 14,000 year old Cro- Magnon caveman. == Plot == The movie begins with the protagonist John Oldman packing up his belongings onto his truck. John Oldman is getting ready to move to a different place to live. This is when his friends come over to give him a farewell party. From their conversations we learn that John Oldman and his friends are all professors in a university. After a bit of conversation, the group of friends moves into John Oldman’s house. John’s friends keep asking why he decided to “run off” so quickly. John Oldman does not answer clearly at first, but gradually becomes drawn to telling his friends what is really on his mind. He begins to tell his friends about who he really is, a 14,000 year old Cro-Magnon caveman who has survived until the present. His friends aren’t convinced, but rather constantly question John Oldman in order to prove him wrong. The talk goes on as John Oldman’s friends try to prove him wrong, in biological, historical, and religious terms. The conversations are driven by John Oldman’s claims of his past. His claims include the following: * That he moves on every ten years or so, when people start to notice that he doesn’t age. This, he says, is the reason why he decided to leave his friends so suddenly. * That he had a chance to sail with Christopher Columbus, but did not, because he then still believed that the world was flat, and was afraid of falling off the edge of the world. * That he was a friend of Vincent van Gogh and even received a picture from him as a present. * That he studied with the Buddha in India. * That he came back to Europe and attempted to teach what he learned from the Buddha. Such attempt became the roots of Christianity, and John Oldman is the Jesus of the Christian Bible. Afterwards Christianity became distorted and was manipulated by churches. Ultimately, today, Christianity has become something that he has never intended it to become. * That he has ten doctorates, including that of everyone in the conversation except for Dr. Will Gruber, the psychologist. == Cast == * David Lee Smith as John Oldman * Tony Todd as Dan * John Billingsley as Harry * Ellen Crawford as Edith * Annika Peterson as Sandy * William Katt as Art Jenkins * Alexis Thorpe as Linda Murphy * Richard Riehle as Dr. Will Gruber * Robbie Bryan as Police Officer == Reception == Liberal online magazine Fadewblogs included the film in their list of must-watch films for atheists. IGN gave it an 8 out of 10 score. ==References== == Other websites == * * * Film Trailer * * The Man from Earth on Myspace Category:2007 science fiction movies Category:2000s psychological movies Category:American science fiction movies Category:American independent movies Category:Movies directed by Richard Schenkman Category:Movies about religion",
 "title": "The Man from Earth"
}