{
 "id": "185579",
 "text": "The Schulze method is a way of voting that is used to fill a single vacant position in an election. It was developed in 1997 by Markus Schulze. It is also known as Schwartz Sequential Dropping (SSD), Cloneproof Schwartz Sequential Dropping (CSSD), Beatpath Method, Beatpath Winner, Path Voting, and Path Winner. It is used by several organizations including Debian, Gentoo, BerryTube, and the KDE team. Wikimedia used to use it before switching to the simpler score voting. == How it works == Voters rank the candidates in the order from the one that they most want to win to the one they least want to win. The same preference (how much the voters want the candidate to win or lose) can be given to more than one candidate, and candidates can be given no number (they are interpreted as the worst). Next, for every pair of two candidates, the two are compared: ignoring all other candidates, which of the two in the pair is preferred by most voters? How many voters agree with the majority decision is noted. More calculations take place. Given two candidates A and K, A is said to beat K with strength t if t voters prefer A to B, t voters prefer B to C, and so on, and t voters prefer J to K. The winner W is the candidate which beats any other candidate X with strength t, but X does not beat W with strength t. == References == Markus Schulze, A new monotonic, clone-independent, reversal symmetric, and condorcet-consistent single-winner election method , Social Choice and Welfare, volume 36, number 2, page 267–303, 2011. Preliminary version in Voting Matters, 17:9-19, 2003. === General === * Proposed Statutory Rules for the Schulze Single-Winner Election Method by Markus Schulze * A New Monotonic, Clone-Independent, Reversal Symmetric, and Condorcet-Consistent Single-Winner Election Method by Markus Schulze === Books === * Christoph Börgers (2009), Mathematics of Social Choice: Voting, Compensation, and Division, SIAM, * Saul Stahl and Paul E. Johnson (2006), Understanding Modern Mathematics, Sudbury: Jones and Bartlett Publishers, * Nicolaus Tideman (2006), Collective Decisions and Voting: The Potential for Public Choice, Burlington: Ashgate, === Research papers === * A Continuous Rating Method for Preferential Voting by Rosa Camps, Xavier Mora, and Laia Saumell * Voting Systems by Paul E. Johnson * Test Run: Group Determination in Software Testing by James D. McCaffrey * Distance from Consensus: a Theme and Variations by Tommi Meskanen and Hannu Nurmi * Descriptions of voting systems by Warren D. Smith * Election Systems by Peter A. Taylor * Personalisierung der Verhältniswahl durch Varianten der Single Transferable Vote by Martin Wilke * Objective Measures of Preferential Ballot Voting Systems by Barry Wright * Approaches to Constructing a Stratified Merged Knowledge Base by Anbu Yue, Weiru Liu, and Anthony Hunter == Other websites == * Schulze-Methode A tutorial by the University of Stuttgart Category:Voting systems Category:Debian",
 "title": "Schulze method"
}