{
 "id": "186007",
 "text": "Lao or Laotian is a language and is the official language of Laos. It is also spoken in the northeast part of Thailand. Lao, like the other languages of Laos, is written in an abugida writing system. The languages has variations, but the Vientiane dialect is considered the standard written form of Lao.E K Brown; Sarah Ogilvie, Concise Encyclopedia of Languages of the World (Amsterdam, Netherlands; Boston, MA: Elsevier, 2009), p. 639 Lao and Thai are both Tai languages and are very similar to each other. In fact, speakers of northern Thai dialects and Lao claim that they can largely understand each other, making the dialects mutually intelligible. == History == Lao is one of the Tai languages, spoken in what is now northern Vietnam and southern China. Mongol invaders and expansion in China pushed the Tai people south towards India. Their language was influenced by other languages in the region like the Mon-Khmer and the Austronesian languages. The written form of Lao originally came from the Pali language in India. The script form was brought to the region by Buddhists about two thousand years ago. Lao script is based on the Khmer script and is very similar to Thai script. However, the writing system was simplified several times, both during the French rule and the communist rule, to make it easier for native Lao speakers to read aloud written Lao. ==Vocabulary== Lao has mainly native Lao words. Because of Buddhism, however, it has been influenced by other languages that contributed mostly religious terms. Lao has influenced Khmer and Thai and vice versa. The writing has many foreign loanwords, very similar to how Latin and Greek have influenced other European languages. For politeness, pronouns (and more formal pronouns) are used, as well as ending statements with ແດ່ (dè ) or ເດີ້ (deu ). Negative statements are made more polite by ending with ດອກ (dok ). The following are formal register examples. * (khop chai lai lai deu, ) Thank you very much. * (khanoi hét bo dai dok, ) I cannot. * (khai pa too hai dè, ) Open the door, please. == References == == Other websites == * Laotian Language 101, YouTube * Learn Basic Lao Language * Linguistics of Tonal Languages, YouTube Category:Kradai languages Category:Laotian culture Category:Languages of Thailand",
 "title": "Lao language"
}