{
 "id": "186143",
 "text": "Street dance is term applied to dances that were invented by the general public in the 1970’s and later in (largely African-related) urban cultures. The term itself comes from the fact that the dances were made in urbanised cities. There are no rules to “street dance” as improvisation and freestyle is emphasized. It is hard to define, but it is basically freely expressing music with one’s body. == Street dance genres == There are many different genres of street dance. It is often divided into old school and new school, with 1984 as the dividing year (due to technological effects on the world's cities and youth cultures). In the old school section, there are categories like tap, locking, popping, and break dancing. In new school, there is hip hop, house, and techno. There are lots of famous dance moves such as: ===Old school=== * Tap dance - Invented by the Irish and African-Americans in the early 19th century, tap is considerably one of the first 'street dances' to take form, whereby the term 'street dance' was used to describe the opposition to the 'folk dance' and 'tribal dance style movements of earlier vernacular dances. There is also swing and traditional Jazz dances that are street dance (as opposed to modern dance). * Locking - It was first made in 1970 by funk dancers in various clubs, with one of the first dancers being Don Campbell (who supposedly invented the 'lock' that the whole locking dance is now named after). It was very popular in the 1970s and the dance itself is known to be relatively comic and lively. Basic moves include the up lock, down lock, wrist rolls, points, and hand claps. Similarly, the Hustle evolved out of disco, but a lot of Hustle moves come under the Locking category. * Popping - Originating from the west coast of the United States of America, popping involves sudden freezes of the muscles to maximize the moves. It uses this basic principle, and mixes it with styles such as waving, ticking and the puppet. It is not known what persons specifically invented the dance style, however, there is some history on the robot dance that it is thought to have evolved from. * Breakdancing - It began in the early 70’s, when DJ Kool Herc first used breaking beats. Hip hop music was originally based on applying looped breakbeats over disco music records at a block party. Dancers began to apply new dances to this new form of music style, which, after the breakbeats, became known as 'breakdancing'. The dance has floorwork similar to the British northern soul and the loft dance. Break dancers are called b-boys and b-girls, respectively of their gender. The dance includes two types of steps: power moves and style moves. Power moves include the windmill and headspin, while style moves include the freezes and footwork. Newer forms evolved from breakdancing, such as uprock and toprock, which are danced upright, especially before entering the actual downrock (or floorwork). * Hip Hop - As one of the most famous street dance genres, there are many theories on how hip hop actually started. Since Hip Hop is a culture beyond dancing that includes art, music, poetry and fashion, it is even harder to define when hip hop dancing actually started. Along with the mindset of street dance, there are no rules to hip hop, and Freestyle Hip Hop is very famous as well. Hip hop when named as a dance genre refers to mainly the commercialised forms of Breakdance, Locking and popping that is popular also in pop and club dance culture. Nowadays, hip hop dance culture involves massively collecting fellow dancers into crews for competitions, which theoretically, helps prevents physical violence between gangs since such people perform dance battles instead of actual fights for territory. The music genres gangsta rap and nu soul (contemporary R&B;) often depict the everyday violence in urban and suburban culture, with hip hop aiding (especially youths) by providing a constructive thing to do as a hobby between work/school. * House - Born in Chicago, it began to become popular in clubs in New York in the beginning of the 80s. It was first influenced by dances like jacking and lofting. Later, steps from various genres like hip hop were mixed into it. Lastly, the style was completed with a hopping feel to the moves, making the dance highly energetic and expressive as house music became more upbeat. Basic steps of house include the sidewalk, happy feet, scribble feet, and skating. One popular form of house dance is 'waacking'. Waacking (or punking) is known to be first danced by mainly just gays, and was officially introduced to the mainstream by Tyrone Proctorm. From the 1980s, it began to mix with other genres, and now it is often mixed in with girl’s hip-hop and tecktonik. * Techno - During the early 80s, industrial and synthpop music started to influence the sound of hip hop and house greatly by the use of European electronic music sounds reflecting the fact the urban world was slowly becoming more and more technologically based. One of the first of the electronic dances was the electric boogaloo (depicted in breakin 2: electric noogaloo), which is highly based on breakdancing being applied to electro rhythms. Techno dance became popular from the appliance of new street dances to electro music, as electro music steadily moved away from its parent 'hip hop culture' to initialise rave and modern nightclub culture. Nowadays Europe has taken on street dance culture in the form of house and techno dance. Although techno refers to most electronic dance genres, it also can refer to the Detroit techno dance styles and music genre which never became that popular. In Australia, dance parties saw the birth of the Melbourne shuffle (based off hip hop, house, tap, Malaysian folk dance, etc.), and Europe has invented its own dances such as hakken, candy walk, jumpstyle, etc. Techno dance in its modern form makes competition redundant and is usually opposed to battling and caters dancing for the feel of the music, instead (alike early locking). == References == * * Category:Dance types Category:Hip hop",
 "title": "Street dance"
}