{
 "id": "186400",
 "text": "Culture shock is a feeling that people have when they are in a different place or experiencing a culture that is different from their own. Many times, the feelings that come with culture shock are confusion, feeling out of place, anxiety, and homesickness. These feelings come from adjusting to the new culture or place, which can be very difficult for some people. Adjustment is especially hard when the change of environment and culture is in a foreign country. It is difficult for people to know what is appropriate and what is not in an unfamiliar place. == Signs and symptoms == * Frustration * Tiring easily and sleeping a lot * Feelings of loneliness and not being motivated * Negative attitude towards host culture * Extreme homesickness == Dealing with culture shock == It is important to understand and identify the symptoms of culture shock so that it can be worked through. The feelings and symptoms that are a result of culture shock are not always caused by one event alone. Many times, it is more than one event over time that leads to overwhelming feelings and emotions. Sometimes it is difficult to identify feelings and emotions as symptoms of culture shock because they can often be confused with other things. There are some different strategies for coping and working through culture shock. Keeping active, making friends with the host country’s locals, and staying positive are all good methods to improve the ability to deal with culture shock. == Reverse culture shock == Reverse culture shock is like culture shock but is experienced when someone returns to their original home after being away for a long period of time. Reverse culture shock can be unexpected because people expect their home to be the same as when they left. This makes it harder for someone to readjust to the change in their home culture and environment. Usually, a longer period of time spent away from home means a longer adjustment period after returning home. Reverse culture shock can be worked through by talking with others, doing things that are a reminder of the foreign place or culture, and staying positive. == References == Culture shock",
 "title": "Culture shock"
}