{
 "id": "186423",
 "text": "El Clásico (, ) is a football match between two Spanish rival football clubs, FC Barcelona and Real Madrid, in the Spanish football league La Liga. It is one of the most famous football matches in the world.The biggest win against the two giants is 11-1 (Real Madrid vs FC Barcelona). The last match between the two was the 2025 Copa del Rey Final, with Barça winning, 3-2 off a winning goal scored by Jules Kounde in extra time. == History == The rival match is also well-known due to its history. Historically, Catalonia was oppressed and disrespected by the dictatorship. Thus, the only way the citizens could take revenge to the government was to defeat the football club representing Madrid (the capital city and the central government in Spain). Real Madrid leads in Official Matches 104 wins to 100 FC Barcelona. As early as the 1930s, Barcelona \"had developed a reputation as a symbol of Catalan identity, opposed to the centralising tendencies of Madrid\". FC Barcelona has won the last 4 El Clásicos - 2-1 in a friendly, 4-0 in LaLiga, 5-2 in Supercopa de España, and 3-2 (a.e.t) in Copa del Rey. == Achievements == Barcelona and Real Madrid are two of the best football clubs in history, dominating LaLiga from the start of the competition. Real Madrid has won 36 La Ligas, 20 Copa del Reys, 13 Supercopa de Españas, 15 UEFA Champions Leagues, and 5 FIFA Club World Cups. FC Barcelona has won 27 La Ligas, 31 Copa del Reys, 15 Supercopa de Españas, 5 UEFA Champions Leagues, 3 FIFA Club World Cups. == Players == Barça and Madrid, of course, being two of the best clubs in the world, have had some of the best players in the world, including prolific forwards, midfielders, defenders, and goalkeepers. Goalkeepers: FC Barcelona: Ter Stegen, Valdes; Real Madrid: Courtois, Casillas Defenders: FC Barcelona: Pique, Kounde, Araujo, Koeman, Puyol, Alves; Real Madrid: Ramos, Roberto Carlos, Pepe, Marcelo Midfielders: FC Barcelona: Iniesta, Deco, Cruyff, Xavi, Busquets; Real Madrid: Modric, Bellingham, Zidane, Kroos, Casemiro Forwards: FC Barcelona: Messi, Neymar, Suarez, Lewandowski, Raphinha, Yamal, Ronaldinho, Ronaldo; Real Madrid: C. Ronaldo, Bale, Benzema, Ronaldo, Di Stefano, Puskas == Famous Matches == Some of the most famous matches have come in the Messi-Ronaldo era of the rivalry. Barcelona 5-0 Real Madrid (November 29, 2010) (FCB: Goals: Xavi 10' / Pedro 18' / Villa 55', 58' / J. Suarez 90+1' | RMA: Red Cards: Ramos 90+3') Real Madrid 3-4 Barcelona (March 23, 2014) (RMA: Goals: Benzema 20', 24' / Ronaldo 55' (pen.); Red Cards: Ramos 63' | FCB: Iniesta 7' / Messi 42', 65' (pen.), 82' (pen.) Real Madrid 2-5 Barcelona (January 12, 2025) (RMA: Goals: Mbappe 5' / Rodrygo 60' | FCB: Goals: Yamal 22' / Lewandowski 36' (pen.) / Raphinha 39', 48' / Balde 45+10' | Red cards: Szczęsny 56') Barcelona 3-2 Madrid (April 26, 2025) (FCB: Goals: Pedri 28' / Torres 84' / Kounde 116' | RMA: Goals: Mbappé 70' / Tchouméni 77'; Red Cards: Rüdiger 120+3' / Vazquez 120+3' / Bellingham 120+4') == References == Category:Football in Spain",
 "title": "El Clásico"
}