{
 "id": "186640",
 "text": "Nell (Hangul: ) is a South Korean alternative rock band. They formed in 1999, but debuted in 2001. It consists of Kim Jong-wan, Lee-Jae-kyung and Lee Jung- hun. Jung Jae-won was the fourth member, but he left the band in June 2003. The band's name comes from a 1994 movie of the same name. Nell is one of the few rock bands who gained mainstream popularity in South Korea. They also have been nominated for several musical awards. == History == Nell was formed in 1999. They began playing at live clubs around Hongik University, and were spotted by Seo tai ji, who signed them to his private record company. In July 2006, Nell left Seo Tai Ji Company and joined Woolim Entertainment. Nell is one of the few rock bands that have achieved mainstream success in the country. Their 2007 'Welcome Home' tour sold out in two minutes. Nell has also participated in the annual ETPFEST in 2002, and the Myspace Secret Show November 28th, 2008. The band stopped performing after their nomination at the Golden Disk Awards on December 11th, 2008, because of the members' departure for the compulsory South Korean military service. The band got back together with \"Slip Away\" when their term was over. == Members == Current members *Kim Jong-wan () – vocals, guitar, keyboard, drums *Lee Jae-kyung () – lead guitar *Lee Jung-hoon () – bass guitar, tambourine, keyboard, chorus Past members *Jung Jae-won () – drums == Discography == === Studio albums === Indie * Reflection of (Jan 2001) * Speechless (Sept 2001) Major * Let It Rain (2003) * Walk Through Me (2004) * Healing Process (2006) * Separation Anxiety (2008) * Slip Away (2012) * Newton's Apple (2014) * C (2016) * Let's Part (2018) * Colors in Black (2019) * Moments in Between (2021) === Extended plays === * Let's Take a Walk (Re-arranged album) (2007) * The Trace (Live album) (2008) * Escaping Gravity (2013) === Single albums === * Holding onto Gravity (2012) === Soundtrack appearances === * Run (Two Weeks OST) (2013) * Waiting for You (Beautiful Gong Shim movie OST) (2016) * Breath (The Good Wife OST) (2016) * Blue Moon (Tale of the Nine Tailed OST) (2020) == References == * biography on Naver.com * biography on Woolliment.com == Other websites == * Official Website(Korean) * Official Fansite(Korean) * Official Myspace Category:1999 establishments in South Korea Category:Alternative rock bands Category:Musical groups established in 1999 Category:Musical quartets Category:Indie rock bands Category:South Korean rock bands",
 "title": "Nell"
}