{
 "id": "18674",
 "text": "Wichita is the largest city in the U.S. State of Kansas. It is the county seat of Sedgwick County. It is the 51st most populous city in the United States. In 2020, 397,532 people lived there. Wichita is the main city of the Wichita metropolitan area; it had an estimated 652,939 people living there in 2023. It is in Sedgwick County, which is in the south-central part of the state. Many parts of airplanes are made in Wichita. Wichita State University is in the city. ==History== Archaeological evidence says that people have lived near the confluence of the Arkansas and Little Arkansas Rivers (where Wichita is) since 3000 B.C. In 1541, a Spanish trip led by explorer Francisco Vázquez de Coronado found the area populated by the Quivira (or Wichita) people. Fighting with the Osage in the 1750s forced the Wichita people further south. Before Americans came to live in the region, the area was part of the territory of the Kiowa people. The area was part of France as part of Louisiana. It was later bought by the United States with the Louisiana Purchase in 1803. It became part of Kansas Territory in 1854. It became part of the state of Kansas in 1861. The Wichita came back in 1863. They came back because they were forced to leave their land in Indian Territory by Confederate forces in the American Civil War. The Wichita people created a settlement on the banks of the Little Arkansas River. In 1868, trader James R. Mead created another trading post in the area. Surveyor Darius Munger built a house to use as a hotel, community center, and post office. ==Geography== Downtown Wichita is at (37.688888, −97.336111). It has an elevation of . Wichita is in south-central Kansas. It is at the junction of Interstate 35 and U.S. Route 54. It is part of the Midwestern United States. It is north of Oklahoma City, southwest of Kansas City, and east-southeast of Denver. The city is on the Arkansas River. It is near the western edge of the Flint Hills. It is in the Wellington- McPherson Lowlands region of the Great Plains. The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Wichita is in North America's humid subtropical climate area (Köppen Cfa). Wichita usually has hot, humid summers and cold, dry winters. The average temperature in the city is . ==People== Wichita is the biggest city in Kansas, and it is the 51st largest city in the United States. It is racially more similar to the rest of the United States than any other major city. ===2020 census=== The 2020 census says that there were 397,532 people, 158,851 households, and 96,134 families living in Wichita. Of the households, 57.5% owned their home and 42.5% rented their home. The median age was 35.7 years. Of the people, 63.4% were White, 11.0% were Black, 5.1% were Asian, 1.3% were Native American, 0.1% were Pacific Islanders, 7.4% were from some other race, and 11.7% were two or more races. Hispanic or Latino of any race were 18.3% of the people. ===2010 census=== The 2010 census says that there were 382,368 people, 151,818 households, and 94,862 families living in Wichita. ===Metropolitan Area=== Wichita is the main city of both the Wichita Metropolitan Statistical Area (MSA) and the Wichita-Arkansas City-Winfield Combined Statistical Area (CSA). The Wichita MSA includes Sedgwick County, Butler County, Harvey County, and Sumner County. In 2023, 652,939 people lived there. This would make it the 90th largest metropolitan area in the United States. ==Economy== Famous restaurants such as White Castle and Pizza Hut were created in Wichita. Wichita's biggest industrial sector is manufacturing. Manufacturing was 21.6 percent of the employment in 2003. Aircraft manufacturing has been the main part of the local economy for a long time. It is so important, that can influence the economic health of the entire region. Kansas gives tax breaks and other incentives to aircraft manufacturers. Healthcare is Wichita's second-biggest industry. It employs about 28,000 people in the area. Since healthcare needs remain fairly consistent regardless of the economy, this field was not subject to the same pressures that affected other industries in the early 2000s. The Kansas Spine Hospital opened in 2004. A critical care tower at Wesley Medical Center also opened in 2004. In July 2010, Via Christi Health, which is the largest provider of healthcare services in Kansas, opened a hospital that will serve the northwest area of Wichita. Via Christi Hospital on St. Teresa is the system's fifth hospital to serve the Wichita community.\"Hospital ready for visitors\" , Wichita Eagle and Kansas.com, July 18, 2010. Koch Industries and Cargill, the two largest privately held companies in the United States, both have headquarters in Wichita. ==Culture== ===Arts=== Wichita is a cultural center for Kansas. It has several art museums and performing arts groups. The Wichita Art Museum is the biggest art museum in Kansas. It has over 7,000 works of art. The Ulrich Museum of Art at Wichita State University is a modern and contemporary art museum. It has over 6,300 works of art. ===Music=== Music Theatre Wichita, Wichita Grand Opera,Who knew Wichita was such a talent pipeline to Broadway?\" March 29, 2017, Wichita Eagle. Retrieved April 3, 2017. and the Wichita Symphony Orchestra perform often at the Century II Convention Hall. It is downtown. Concerts happen often by the schools of music at Wichita's two biggest universities.Leiker, Amy Renee, \"Opera singer Sam Ramey to coach vocal music at WSU,\" August 29, 2012, Wichita Eagle. Retrieved April 3, 2017. ==Sports== Wichita has several professional, semi-professional, non- professional, and collegiate sports teams. Professional teams include the Wichita Thunder ice hockey team, the Wichita Force indoor football team, and the Wichita Wind Surge Minor League Baseball team. The city hosts the Air Capital Classic. It is a professional golf tournament of the Web.com Tour. It was first played in 1990. ===Professional=== Team League Sport Wichita Thunder ECHL Ice hockey Wichita Force CIF Indoor football Wichita Wind Surge PCL Baseball ===College=== School School Nickname Level # of Teams Wichita State University Shockers NCAA Division I 15 Newman University Jets NCAA Division II 16 Friends University Falcons NAIA 15 ==Government== According to Kansas law, Wichita is a city of the first class. Since 1917, it has had a council-manager form of government. Wichita is in Kansas's 4th U.S. Congressional District. For the Kansas Legislature, Wichita is in the 16th, 25th32nd districts of the Kansas Senate. It is in the 81st, 83rd101st, 103rd, and 105th districts of the Kansas House of Representatives. ==Education== ===Primary and secondary education=== Wichita Public Schools (US$259) is the largest school district in Kansas. It has over 50,000 students. It has more than 90 schools in Wichita. It includes 10 high schools, 16 middle schools, 61 elementary schools, and more than a dozen special schools and programs. There are more than 35 private schools in Wichita. ===Colleges and universities=== Three universities are in Wichita. The biggest is Wichita State University (WSU). WSU has more than 14,000 students. It is the third-biggest university in Kansas. WSU's main campus is in northeast Wichita. They have other campuses around the Wichita area. Friends University is a private Christian university. It has its main campus in west Wichita. Newman University is a private Catholic university. It is also in west Wichita. ===Libraries=== The Wichita Public Library is Wichita's library system. It has a main facility. It is called the Advanced Learning Library, and it is in Delano. It also has six locations in other neighborhoods around Wichita. The library has several free programs for the public. It includes special events, technology training classes, and programs specifically for adults, children, and families. In 2009, it had more than 1.3 million books and 2.2 million items total. ==Media== The Wichita Eagle is Wichita's major daily newspaper. It started in 1872. The Wichita Business Journal is a weekly newspaper that covers local business events and developments. Several other newspapers and magazines, many of which focus on something specific, are also published in Wichita. These include: The Community Voice, a weekly African American community newspaper; El Perico, a monthly Hispanic community newspaper;Horwath, Bryan in \"Hispanic community could be sleeping giant for Wichita economy,\" March 09, 2016, Wichita EagleAssociated Press in \"Communications firms cater to Wichita’s Hispanic market,\" May 25, 2003, Lawrence Journal-World The Liberty Press, monthly LGBT news; Splurge!, a monthly local fashion and lifestyle magazine; The Sunflower, the Wichita State University student newspaper. The Wichita radio market includes Sedgwick County, Butler County, and Harvey County. Six AM radio stations and many FM radio stations are in Wichita. Wichita is the main city of the Wichita-Hutchinson, Kansas television market. That market covers the western two-thirds of Kansas. All of the market's network affiliates broadcast from Wichita. The ABC, CBS, CW, FOX and NBC affiliates serve the wider market through networks of other stations. The city also hosts a PBS member station, a Univision affiliate, and several low-power stations. ==Infrastructure== ===Flood control=== Wichita has had bad floods of the Arkansas River in 1877, 1904, 1916, 1923, 1944, 1951 and 1955. In 1944, Wichita flooded 3 times in 11 days. Because of the 1944 flood, Wichita built the Wichita-Valley Center Floodway in 1958. It makes the water go around Wichita. ===Utilities=== Westar Energy gives electricity. Cox Communications and Spectrum offer cable television. AT&T; U-Verse offers IPTV. Those three companies also offer home telephone and broadband internet service. Kansas Gas Service provides natural gas. ==Transportation== ===Bus=== Wichita Transit has 53 buses. There are 18 bus routes in Wichita. They say there are over 2 million trips per year (5,400 trips per day) on its routes. Wichita Transit also has a paratransit service. It has 320,800 passenger trips every year. ===Air=== The Wichita Airport Authority manages the city's two main public airports. The airports are Wichita Dwight D. Eisenhower National Airport and Colonel James Jabara Airport. Wichita Dwight D. Eisenhower National Airport is in western Wichita. It is the city's main airport. It is also the biggest airport in Kansas. ===Railroad=== Two Class I railroads, BNSF Railway and Union Pacific Railroad (UP), operate freight rail lines through Wichita. The closest Amtrak station is in Newton. It is north. Amtrak offers service on the Southwest Chief line between Los Angeles and Chicago. Wichita has not had passenger rail service since 1979. ==Sister cities== * Cancún, Quintana Roo, Mexico - November 25, 1975 * Kaifeng, Henan, China - December 3, 1985 * Orléans, Loiret, France - August 16, 1944, through Sister Cities International * Tlalnepantla de Baz, State of Mexico, Mexico ==Notes== == References == == Other websites == Official sites * City of Wichita * Wichita Metro Chamber of Commerce * Greater Wichita Convention & Visitors Bureau * 360Wichita.com (directory of local business and entertainment) * Wichita Mid-Continent Airport * The Wichita Eagle (local newspaper) More information * City of Wichita-History, on city-administered web page . * History of the Wichita Beat poets and artists . * LASR: Wichita Kansas Attractions, Events and Recreation. Category:1868 establishments in Kansas Category:County seats in Kansas",
 "title": "Wichita, Kansas"
}