{
 "id": "186749",
 "text": "The International Chess Federation or World Chess Federation, or FIDE is the world chess organisation. All national federations are members. It decides matters like World Championships and changes in rules of the game. FIDE was founded on 20 July 1924 in Paris, France. However, it had little influence until the end of World War II. The reigning world champion at that time, Alexander Alekhine, did not want to have anything to do with it. He regarded the world title as his personal property. This only changed when he died with the title, in 1946 (no other champion has ever died while holding the title). It was obvious that some method was needed to find a new champion. FIDE stepped in and, with Russian backing, put forward a solution. The strong Soviet Chess Federation only joined FIDE in 1946. It had a great influence, with resources and many young strong players. == After WW II == In 1948 a tournament was organized to determine which of the world top players was entitled to call himself World Champion. The death of Alekhine had left a vacuum. Two previous champions, Emanuel Lasker and José Raúl Capablanca had died in the late 1930s. It was clear that a new champion would come from the younger players. The six players chosen by FIDE were: * Mikhail Botvinnik, Paul Keres and Vassily Smyslov from the Soviet Union. * Samuel Reshevsky and Reuben Fine from the United States. * Max Euwe from the Netherlands. In the end, Reuben Fine dropped out, and the other five contested the event. Mikhail Botvinnik won the tournament and became the new world champion. === FIDE World Champions (1948 - 1993) FIDE World Champions=== * 1948 - 1957 : Mikhail Botvinnik * 1957 - 1958 : Vasily Smyslov * 1958 - 1960 : Mikhail Botvinnik * 1960 - 1961 : Mikhail Tal * 1961 - 1963 : Mikhail Botvinnik * 1963 - 1969 : Tigran Petrosian * 1969 - 1972 : Boris Spassky * 1972 - 1975 : Robert Fischer * 1975 - 1985 : Anatoly Karpov * 1985 - 1993 : Garry Kasparov In 1950 the FIDE awarded its first IM (International Master) and GM (International Grandmaster) titles. However it was not until 1957 that FIDE formulated clear criteria to award these titles. In 1970 a new ranking system, the Elo-rating, was introduced. == Later years == With the collapse of the Soviet Union FIDE lost a powerful partner. This resulted in a long period of trouble. In 1993 worldchampion Gary Kasparov and his challenger Nigel Short left FIDE. They founded their own organisation for professional top players, the PCA (Professional Chess Association). So now there were two worldchampions: one from FIDE and one from the PCA. It was not until 2006 that the dust settled down and a re-unification match between Vladimir Kramnik and Veselin Topalov took place. === FIDE World Champions (1993 to present) === * 1993 - 1999 : Anatoly Karpov * 1999 - 2000 : Alexander Khalifman * 2000 - 2002 : Viswanathan Anand * 2002 - 2004 : Ruslan Ponomariov * 2004 - 2005 : Rustam Kasimdzhanov * 2005 - 2006 : Veselin Topalov * 2006 - 2007 : Vladimir Kramnik * 2007 - 2013 : Viswanathan Anand * 2013 - 2023 : Magnus Carlsen * 2023 - 2024 : Ding Liren * 2024 - .......Dommaraju Gukesh In 1999 FIDE was recognised by the International Olympic Committee. In 2001 FIDE played by anti-doping rules, trying to make chess for like a candidate for the Olympic Games. == Women's World Chess Championship Women's World Chess Championship == Years Name 1927 - 1944 Vera Menchik - - 1950 - 1953 Lyudmila Rudenko 1953 - 1956 Elisaveta Bykova 1956 - 1958 Olga Rubtsova 1958 - 1962 Elisaveta Bykova 1962 - 1978 Nona Gaprindashvili 1978 - 1991 Maia Chiburdanidze 1991 - 1996 Xie Jun 1996 - 1999 Susan Polgar 1999 - 2001 Xie Jun 2001 - 2004 Zhu Chen 2004 - 2006 Antoaneta Stefanova 2006 - 2008 Xu Yuhua 2008 - 2010 Alexandra Kosteniuk 2010 - 2012 Hou Yifan 2012 - 2013 Anna Ushenina 2013 - 2015 Hou Yifan 2015 - 2016 Mariya Muzychuk 2016 - 2017 Hou Yifan 2017 - 2018 Tan Zhongyi 2018 - ....... Ju Wenjun == List of FIDE presidents List of FIDE presidents== * 1924-1939 Alexander Rueb, * 1939-1946 Augusto de Muro, * 1946-1949 Alexander Rueb, * 1949-1970 Folke Rogard, * 1970-1978 Max Euwe, * 1978-1982 Friðrik Ólafsson * 1982-1995 Florencio Campomanes, * 1995-2018 Kirsan Ilyumzhinov, Kalmykia, * 2018-.......Arkady Dvorkovich, ==References== Category:1924 establishments in France Category:Chess Category:Organizations based in France",
 "title": "FIDE"
}