{
 "id": "186737",
 "text": "Novak Djokovic (born 22 May 1987) is a Serbian professional tennis player. Djokovic has won a record 24 Grand Slam singles titles: the 2008, 2011, 2012, 2013, 2015, 2016, 2019, 2020, 2021 and 2023 Australian Open, the 2016, 2021 and 2023 French Open, the 2011, 2014, 2015, 2018, 2019, 2021 and 2022 Wimbledon Championships as well as the 2011, 2015, 2018, and 2023 US Open. He is the first player since Rod Laver in 1969 to hold all four Grand Slam tournaments at the same time. He is the third player after Roy Emerson and Rod Laver to win each Grand Slam tournament at least two times, and the first to win each at least three times. Djokovic holds the record for most time ranked No. 1 in the world, with 428 weeks. He was ranked No. 1 in the world for the first time on 4 July 2011. His longest streak at No. 1 was 122 weeks, from 7 July 2014 until 6 November 2016. He won the ATP Tour Finals in 2008, 2012, 2013, 2014, 2015, 2022, and 2023, and helped Serbia win the Davis Cup in 2010. He won a gold medal in men's singles at the 2024 Summer Olympics and a bronze medal at the 2008 Summer Olympics. He has won a record 40 Masters 1000 series titles, and a single season record six Masters 1000 titles in 2015. Many tennis critics and former and current players consider Djokovic to be among the greatest tennis players of all time. Djokovic was named the Laureus World Sportsman of the Year in 2012, 2015, 2016 and 2019. == Grand slam record == This table shows Djokovic's performance in each Grand Slam tournament in singles. Year Australian Open French Open Wimbledon US Open 2005 Round 1 Round 2 Round 3 Round 3 2006 Round 1 Quarterfinal Round 4 Round 3 2007 Round 4 Semifinal Semifinal Final 2008 Winner Semifinal Round 2 Semifinal 2009 Quarterfinal Round 3 Quarterfinal Semifinal 2010 Quarterfinal Quarterfinal Semifinal Final 2011 Winner Semifinal Winner Winner 2012 Winner Final Semifinal Final 2013 Winner Semifinal Final Final 2014 Quarterfinal Final Winner Semifinal 2015 Winner Final Winner Winner 2016 Winner Winner Round 3 Final 2017 Round 2 Quarterfinal Quarterfinal Absent 2018 Round 4 Quarterfinal Winner Winner 2019 Winner Semifinal Winner Round 4 2020 Winner Final Not held Round 4 2021 Winner Winner Winner Final 2022 Absent Quarterfinal Winner Absent 2023 Winner Winner Final Winner 2024 Semifinal Quarterfinal Final == References == ==Other websites== * Djokovic's official site * Djokovic at ATP site Category:1987 births Category:Living people Category:Australian Open champions Category:Male tennis players Category:Olympic gold medalists for Serbia Category:Olympic bronze medalists for Serbia Category:Serbian tennis players Category:US Open (tennis) champions Category:Wimbledon champions Category:World No. 1 tennis players",
 "title": "Novak Djokovic"
}