{
 "id": "186874",
 "text": "Brave is the sixth studio album by American singer and entertainer Jennifer Lopez. It was released on October 6, 2007 by Epic Records. It is Lopez's fifth English-language studio album. It debuted at number twelve on the U.S. Billboard 200 with 53,000 copies sold in its first week. It became Lopez's least successful album to date, selling just 600,000 units worldwide to date. ==Track listing== # \"Stay Together\" (Jonathan Rotem, Chasity Nwagbara, Evan \"Kidd\" Bogart) – 3:31 # \"Forever\" (Balewa Muhammad, Candice Nelson, Ezekiel \"Zeke\" Lewis, Patrick \"j.Que\" Smith, Chauncey Hollis) – 3:38 # \"Hold It Don't Drop It\" (Kevin Risto, Waynne Nugent, Jennifer Lopez, Allen Phillip Lees, Tawana Dabney, Janet Sewell, Cynthia Lissette, Dennis Lambert, Brian Potter) – 3:55 #* Contains a sample of Tavares' \"It Only Takes a Minute\" (Dennis Lambert, Brian Potter) # \"Do It Well\" (Ryan Tedder, Leonard Caston, Anita Poree, Frank Wilson) – 3:05 #* Contains a sample of Eddie Kendricks' \"Keep on Truckin'\" (Leonard Caston, Anita Poree, Frank Wilson) # \"Gotta Be There\" (Adam Gibbs, Michael Chesser, Crystal Johnson, Travis Cherry, Leon Ware, Arthur Ross) – 3:57 #* Contains a sample of Michael Jackson's \"I Wanna Be Where You Are\" (Leon Ware, Arthur Ross) # \"Never Gonna Give Up\" (Michelle Lynn Bell, Peter Wade Keusch, Lopez) – 4:21 # \"Mile in These Shoes\" (Chasity Nwagbara, Onique Williams) – 3:16 # \"The Way It Is\" (Bell, Keusch, Lopez, Rhonda Robinson, Gennaro Leone, Bruce Rudd) – 3:07 #* Contains a sample of Great Pride's \"She's a Lady\" (Gennaro Leone, Bruce Rudd) # \"Be Mine\" (Bell, Keusch, Robinson, John Hill, Caleb Shreve, Lopez, Bobby Hebb) – 3:20 #* Contains a sample of Paul Mauriat's \"Sunny\" (Bobby Hebb) # \"I Need Love\" (Bell, Keusch, Robinson, Hill, Shreve, Lopez, Bill Withers) – 3:52 #* Contains a sample of Bill Withers' \"Use Me\" (Bill Withers) # \"Wrong When You're Gone\" (Lewis, Smith, Muhammad, Nelson, Keri Hilson) – 3:58 # \"Brave\" (Christian Karlsson, Pontus Winnberg, Lewis, Smith, Muhammad, Nelson) – 4:21 ;Bonus tracks * \"Do It Well\" (featuring Ludacris) (bonus track on all editions) – 3:34 * \"Do It Well\" (Monto Blanco Radio Mix) (iTunes bonus track in some countries) – 3:03 * \"Do It Well\" (Ashanti Boyz Remix) (iTunes bonus track in some countries) – 3:42 * \"Frozen Moments\" (Bell, Keusch) (Canadian iTunes bonus track)Beyond Beautiful Jennifer Lopez, \"BB Interview- Lynn & Wade, Producers on Jennifer Lopez's Album 'Brave'\" , Beyond-Beautiful.org, September 14, 2007. – 3:45 ;Deluxe edition bonus DVD # \"Get Right\" (featuring Fabolous) (Video) – 3:52 # \"Hold You Down\" (featuring Fat Joe) (Video) – 4:32 # \"Qué Hiciste\" (Video) – 4:17 # \"Me Haces Falta\" (Video) – 3:33 ;Target edition Includes exclusive fan package with T-shirt. ;Circuit City edition Includes exclusive free calendar. ==Personnel== * Pedro Alfonso – Violin, Viola * Jim Annunziato – Engineer * Scott Barns – Make-Up * Michelle Lynn Bell – Producer, Vocal Arrangement * Michelle Bell – Vocals (bckgr) * Big D – Producer * Chuck Brody – Producer * CFOS – Mixing Assistant * Travis Cherry – Producer * Clutch – Producer * Brandon Creed – A&R; * Alec Deruggiero – Engineer * Warren \"Oak\" Felder – Producer * William Garrett – Keyboards, Engineer * Larry Gold – Conductor, String Arrangements * Alexei Hay – Photography * John Hill – Producer, Mixing * Keri Hilson – Vocals (bckgr) * Hit Boy – Programming, Producer, Instrumentation * Peter Wade Keusch – Synthesizer, Programming, Producer, Engineer, Vocal Arrangement * Gelly Kusuma – Assistant Engineer, Mixing Assistant * Jennifer Lopez – Executive Producer * Manny Marroquin – Mixing * Julie Ann Marsibilio – A&R; * Josh McDonnell – Guitar, Engineer * Keith Naftaly – A&R; * Candice Nelson – Vocals (bckgr) * Chasity Nwagbara – Vocals (bckgr) * Ken Paves – Hair Stylist * Philosophy – Producer * Herb Powers – Mastering * Julio C. Reyes – Engineer, String Arrangements, Vocal Producer * Jared Robbins – Mixing Assistant * Corey Rooney – Executive Producer, Brass Arrangement, Vocal Producer * José Juan Sánchez – Engineer * Ryan Santomauro – A&R; * Sizzler Ponderosa – Vocals (bckgr) * Chris Soper – Mixing Assistant * Corey Stocker – Engineer * Bruce Swedien – Mixing * Ryan Tedder – Programming, Producer, Instrumentation * Mike Tschupp – Assistant Engineer, Mixing Assistant * Peter Wade – Synthesizer, Guitar, Programming, Mixing * Chasity Wagbara – Vocals (bckgr) * Bruce Waynne – Producer, Engineer * Daniel Werner – A&R; * Monique Williams – Vocals (bckgr) ==Charts== Chart (2007) Peak position Australian ARIA Albums Chart\"Jennifer Lopez - Brave worldwide chart positions and trajectories\" . aCharts.us. Retrieved October 23, 2007. 46 Austrian Albums Chart 35 Belgian Ultratop 50 Albums (Flanders) 36 Belgian Ultratop 50 Albums (Wallonia) 18 Canadian Albums Chart 13 Dutch Albums Chart 24 French SNEP Albums Chart 28 German Albums Chart 41 Greek International Albums Chart 2 Greek Albums Chart 5 Hungarian Mahasz Albums Chart 17 Italian FIMI Albums Chart 10 Japanese Oricon Albums Chart 6 Mexican Albums Chart 36 Polish Albums Chart 31 Spanish Albums Chart\"Spanish Top 100 Albums\" 21 Swedish Albums Chart 59 Swiss Albums Chart 6 UK Albums Chart 24 U.S. Billboard 200 12 ==Sales and certifications== Chart Sales (certification) Europe 300,000+ France 15,000+ Italy 21,000+ (silver) Japan 70,000+ Russia 40,000 (2× platinum) United Kingdom 30,000 United States 250,000 Worldwide 600,000+ ==Release history== Region Date Poland October 4, 2007 Germany October 5, 2007 United States October 9, 2007 Canada October 9, 2007 Mexico October 9, 2007 Israel October 9, 2007 Greece October 10, 2007 Japan October 10, 2007 Thailand October 11, 2007 Australia October 13, 2007 United Kingdom October 15, 2007 Europe October 15, 2007 Philippines October 16, 2007 Brazil October 19, 2007 Russia October 20, 2007 Cuba October 25, 2007 ==References== Category:Jennifer Lopez albums Category:2007 albums Category:Pop albums Category:Funk albums Category:R&B; albums Category:Epic Records albums",
 "title": "Brave (Jennifer Lopez album)"
}