{
 "id": "186912",
 "text": "A MacBook Pro is a type of laptop computer made by Apple Inc. It replaced the PowerBook G4 and was the second Intel model to be released. It runs macOS and comes with a built in webcam and microphone and a power adapter that is attached by magnets. MacBook Pros are housed in aluminum metal and are currently available in 13\", 14\" and 16\" models. == History == The MacBook Pro was first introduced on January 2006 at the Macworld Expo. In June 2020, at the WWDC, Apple announced that Macs will be transitioning from Intel processsors to Apple silicon. === Models === The first MacBook Pro was the 15\" model, but a 17\" model was released later that year. New models were released in late 2006, late 2007, early 2008, late 2008, and early 2009. In June 2009, a 13\" model was added and the other sizes were also updated. The next updates happened in April 2010 and February 2011. Another update was released in June 2012, in which a new 15\" model was introduced with a much higher display resolution (dubbed the Retina Display, meaning that it can display more pixels, creating a smoother image). However, Apple stopped making the 17\" model. In September 2016, Apple released the MacBook Pro with Touch Bar, a strip that replaces function keys. It came in 13\" and 15\" models. Updates followed in mid 2017, mid 2018 and mid 2019. The 16-inch MacBook Pro, featuring Intel Core i7 or i9 processors, was released in November 2019. It replaced 15-inch MacBook Pro. In early 2020, 13-inch model had been updated with new 10th gen Intel Core and Intel Iris Plus graphics. In November 2020, Apple made a move from Intel processors to Apple Silicon with 13-inch MacBook Pro. It features an 8-core CPU, 8-core graphics and 16-core Neural Engine. The battery life has been extended to 20 hours. However, Apple continued selling Intel-based MacBook Pro until October 2021, when the new 14- and 16-inch MacBook Pro with either M1 Pro or M1 Max processor has been released. == Features == The new MacBook Pro has several features: ===Aluminum unibody=== The aluminum unibody case makes the MacBook Pro lighter, polished, and stronger. On the left side of the computer, there is a button next to many indicator lights. This button will turn on the lights. They say how much battery power the computer has left. More lights on means more battery. ===Battery=== A built-in battery gives around 10 to 11 hours of power to Intel-based models and around 17 to 21 hours of power to Apple silicon models of the computer. This battery can be recharged up to 1,000 times, whereas typical notebooks can only be recharged 200 to 300 times. ===Keyboard=== The keyboard has curved and backlit keys. ===Glass trackpad=== The trackpad is the part of the laptop that is touch-sensitive. It allows the use to move the cursor on the screen by using their finger. The entire trackpad is also the trackpad button, adding more space to the trackpad. Right-click can be done with two fingers or using a right-click area. Some gestures (involving 2 or more fingers at once) are: * Use two fingers to scroll up and down a page. * Pinching with two fingers to zoom in and out. * Rotate an image by turning two fingers. * Swipe with four fingers to show the user’s desktop, view all open windows or switch applications. ===Storage=== The 13-inch models have 256 GB SSD, all the way up to 2 TB. The 14-inch and 16-inch models have 512 GB SSD, all the way up to 8 TB. ===Processors=== The CPUs in the computers are either Apple M1, Apple M1 Pro or Apple M1 Max. Previously, The MacBook Pro used Intel Core chips. An SD card slot in the early 13\" and 15\" MacBook Pros, as well as the new 14\" and 16\" MacBook Pros, can be used to import photos from a camera or camcorder. ===Graphics=== The GPU is intergrated into either Apple M1, Apple M1 Pro or Apple M1 Max chips. Previously, the MacBook Pro used Intel UHD Graphics, Intel Iris Plus or AMD Radeon Pro graphics. ===Ports=== The 13\" MacBook Pro have 2 Thunderbolt 4 ports. The 14\" and 16\" MacBook Pro have three Thunderbolt 4 ports, Magsafe 3 and HDMI 2.0 ports, and a SD card reader and a 3.5 mm headphone jack. == Environmental impact == === Features to reduce environmental impact === The MacBook Pros have the following environmentally- friendly features: * They have arsenic-free display glass. * They are BFR- free. * They have a mercury-free LED-backlit display glass. * They have PVC- free internal cables. * Their enclosure is made from highly recyclable aluminum and glass. * Their packaging has been reduced. * They meet Energy Star 5.0 requirements. * They are rated EPEAT Gold. ==Related pages== *MacBook == References == == Other websites == *MacBook Pro website *Fix My Apple Category:MacBook Category:Apple hardware Category:Laptops",
 "title": "MacBook Pro"
}