{
 "id": "186991",
 "text": "Galen of Pergamum (129–199/217 AD) was a prominent Greek physician and philosopher from Pergamon, a Greek city in western Asia Minor. He was an important medical researcher in the Roman Empire and his theories influenced Western medical science for over a thousand years. ==Biography== Galen was the son of Aelius Nicon, a Greek architect and builder.. Galen invented the 'Theory of Opposites' based on Hippocrates' Four Humours' theory, which helped develop medicine in the Roman age and again in the Middle Ages to include more natural-based medicine (rather than just religious medicine). Some of the observations he made in his books were wrong as he could only dissect animals (mostly pigs and apes) and compare them to humans due to the Roman ban on dissecting human corpses. Later in the Renaissance period, people such as Andreas Vesalius wrote books showing that some of what Galen said was wrong. He was most famous for his discovery that proved that arteries carry blood and his dissection of a pig proved that the larynx nerves control the voice. He also proved that the brain controls the body and not the heart. Galen was vital in the beginnings of natural medicine and is called the \"Father of Anatomy\". He is also called the \"Father of Medicine\" second to Hippocrates. ==Gallery== File:Galen detail.jpg|A 19th century lithograph of Galen by Pierre Roche Vigneron. File:Claudius Galenus (1906) - Veloso Salgado.png|Galen dissecting a monkey as imagined by Veloso Salgado in 1906. File:Statue of Galen of Pergamon.jpg|Modern statue of Galen in his hometown, Pergamon. ==References== ===Citations=== ===Sources=== * * * * * * * * * * * ==Other websites== *Galen - A Biographical Sketch (Medicina Antiqua) *Galen (Encyclopædia Britannica) *Galen (Internet Encyclopedia of Philosophy) *Works by Galen (Corpus Medicorum Graecorum) *Works by Galen (Perseus Digital Library) Category:Greek physicians Category:Ancient Greek philosophers Category:Ancient Roman philosophers Category:Anatomists Category:120s births Category:190s deaths Category:2nd-century writers",
 "title": "Galen"
}