{
 "id": "186953",
 "text": "Hinduism is the second largest religion in Bangladesh after Islam. It is followed by 8.5% of the population. In terms of population, Bangladesh has the third-largest Hindu population after the Republic of India and Nepal. In nature, Bangladeshi Hinduism closely resembles the forms and customs of Hinduism practiced in the neighboring Indian state of West Bengal, with which Bangladesh (at one time known as East Bengal) was united with that country until the Partition of India in 1947. The river Ganges is a sacred holy river that flows into the country from India. Image: Bara Shiva Temple, Puthia (Front).jpg|The Temple at Puthia, Rajshahi Image: Bangladesh Hindu Map.png|Distribution of Hindus by percentage. Image: Durga puja in Dhakeshwari temple.jpg|Puja celebrations in Dhakeshwari Temple is the national temple of Bangladesh ==Demography== Bangladesh population is 149,772,364 of which, hindu population according to 2011 census of Bangladesh is 12,730,651 constituting 8.54% of the country's population. However, at certain times different leaders and the Bangladesh Bureau of Statistics have given different numbers estimation based on their research. Number of Bengali Hindus residing in Bangladesh (2013-2021 est.) Source/claimed by Population (%) Year 2019 report on International religious freedom: Bangladesh 15,280,000 (10%) 2013 Claimed Bangladesh Bureau of Statistics 15,500,000 (10.3%) 2014 Claimed Bangladesh Bureau of Statistics 17,000,000 (10.7%) 2016 Claimed by Ravindra Ghosh, Chairman of Bangladesh Hindu Janajagruti Samiti 18,000,000 (11.04%) 2019 Claimed by KMS leader Akhil Gogoi 19,000,000 (11.65%) 2019 Claimed by Bangladesh grand Hindu alliance leader Govinda Pramanik 25,000,000 (15.7%) 2019 Claimed by Bangladesh official introduction article page 27,000,000 (16%) 2021 * Note: This was just their claim based on their estimation research and is not related to any government census authority. ==References== ==Further reading== *Blood, Archer K. (2005). The cruel birth of Bangladesh: Memoirs of an American diplomat. Dhaka: University Press. *Benkin, Richard L. (2014). A quiet case of ethnic cleansing: The murder of Bangladesh's Hindus. New Delhi: Akshaya Prakashan. *Dastidar, S. G. (2008). Empire's last casualty: Indian subcontinent's vanishing Hindu and other minorities. Kolkata: Firma KLM. *Kamra, A. J. (2000). The prolonged partition and its pogroms: Testimonies on violence against Hindus in East Bengal 1946-64. *Taslima Nasrin (2014). Lajja. Gurgaon, Haryana, India: Penguin Books India Pvt. Ltd, 2014. *Rosser, Yvette Claire. (2004) Indoctrinating Minds: Politics of Education in Bangladesh, New Delhi: Rupa & Co. . *Mukherji, S. (2000). Subjects, citizens, and refugees: Tragedy in the Chittagong Hill Tracts, 1947-1998. New Delhi: Indian Centre for the Study of Forced Migration. *Sarkar, Bidyut (1993). Bangladesh 1992: This is our home: Sample Document of the Plight of our Hindu, Buddhist, Christian, and Tribal Minorities in our Islamized Homeland: Pogroms 1987-1992. Bangladesh Minority Hindu, Buddhist, Christian, (and Tribal) Unity Council of North America. Category:Bangladeshi culture Bangladesh Bangladesh",
 "title": "Hinduism in Bangladesh"
}