{
 "id": "187076",
 "text": "Gyeongju (경주) is a coastal city in the southeastern corner of North Gyeongsang province in South Korea. It is the second largest city in the province. It is large, with 269,343 people living in the city, according to the 2008 census. From southeast, Gyeongju is away from Seoul, and from the east, away from the provincial capital, Daegu. Cheongdo and Yeongcheon are on the west side of the city. Ulsan is to the south side, and Pohang is to the north. On the east there is the coast of the Sea of Japan (East Sea). Many low mountains are around the city. They are part of the Taebaek range. Gyeongju was the capital of the ancient kingdom of Silla (57 BC – 935 AD). Silla ruled most of the Korean Peninsula between the 7th and 9th centuries, and many archaeological sites from that time are still in the city. This is why Gyeongju is often called \"the museum without walls\".Robinson et al. 2007. p.187 For example, Gyeongju Historic Areas and Yangdong Folk Village were made World Heritage Sites by UNESCO. The many important historical sites have helped Gyeongju become one of the most popular places in Korea for tourists. In 1995, the city of Gyeongju and Gyeongju County were put together. There are 53 other small and medium-sized cities with about 300,000 or less people in South Korea. Today, Gyeongju is not only influenced by its history–it is influenced by the economic, demographic and social changes in South Korean culture. Its economy is mostly based on tourism. Manufacturing has also developed because Gyeogju is near large industrial cities such as Ulsan and Pohang. It is also connected to railways and highways that are often used by tourists.Tamásy & Taylor, (2008) p.129 == Notes == == References == *Breen, Michael (1999) The Koreans: who they are, what they want, where their future lies Macmillan, *Cherry, Judith (2001), Korean multinationals in Europe, Routledge Advances in Korean Studies, Routledge, *Cumings, Bruce (1997). Korea's place in the sun: A modern history. New York: Norton. *Kang, Bong W. (2002). A study of success and failure in the water management of the Buk Chun in Kyongju, Korea. Paper delivered at the Eighteenth Congress of the International Commission on Irrigation and Drainage. (Electronic Version). *Kang, Jae-eun; Lee, Suzanne. (2006) The land of scholars: two thousand years of Korean Confucianism Homa & Sekey Books, *Kim, Chang-hyun (August, 2008), The Position and the Administration System of Donggyeong in Koryeo Dynasty, (in Korean) Dongguk University, Silla Culture, issue 32, pp. 1–43 *Kim, Chong-un; Fulton, Bruce, (1998) A ready-made life: early masters of modern Korean fiction, University of Hawaii Press, pp. 107–120, *Kim, Deok-muk, (2003) 전국의 기도터와 굿당 (Jeon-gukui gidoteo wa gutdang. Tr. \"Sites of Buddhist prayer and shamanic practice nationwide\"), (in Korean), 한국민속기록보존소 *Kim, Won-yong. (1982). Kyŏngju: The homeland of Korean culture. Korea Journal 22(9), pp. 25–32. *Kookmin University, Department of Korean History (2004) \"경주문화권 (Gyeongju Munhwagwon. The Gyeongju cultural area)\", Seoul:역사공간 *Korean Overseas Information Service, (2003), Handbook of Korea (11th ed.), Seoul, Hollym, *Lee, Ki-baek; Tr. by E.W. Wagner & E.J. Schulz, (1984), A new history of Korea (rev. ed.), Seoul, Ilchogak, *Nilsen, Robert, South Korea, Moon Handbooks, *Oppenheim, Robert. (2008) Kyǒngju things: assembling place, University of Michigan Press, *Ring, Trudy; Robert M. Salkin, Paul E Schellinger, Sharon La Boda (1996) International Dictionary of Historic Places: Asia and Oceania Taylor & Francis, *Robinson, Martin; Ray Bartlett, Rob Whyte (2007), Korea Lonely Planet, pp. 197–209, *Rutt, Richard; Hoare, James. (1999) Korea: a historical and cultural dictionary, Durham East-Asia series. Routledge. *Sundaram, Jomo Kwame. (2003) Manufacturing competitiveness in Asia: how internationally competitive national firms and industries developed in East Asia, Routledge, *Tamásy, Christine; Taylor, Mike. (2008) Globalising Worlds and New Economic Configurations, Ashgate Publishing, Ltd., *Yi, Sŭng-hwan; Song, Jaeyoon (translation) (2005) A topography of Confucian discourse: politico- philosophical reflections on Confucian discourse since modernity, Homa & Sekey Books, *Yu, Hong-jun; (translation) Mueller, Charles M., (1999) Smiles of the baby Buddha: appreciating the cultural heritage of Kyǒngju, Changbi (창비), ==Other websites== *Gyeongju City Government website *Gyeongju City Council website *Gyeongju City-Transportation System website Category:Cities in South Korea Category:Capital of Korea Category:Former national capitals",
 "title": "Gyeongju"
}