{
 "id": "187989",
 "text": "Kennel cough or tracheobronchitis is a very easily caught dog illness. The dogs have swelling and pain of the upper breathing passages. It can be caused by viral infections such as canine distemper, canine adenovirus, canine parainfluenza virus, or canine respiratory coronavirus, or bacterial infections such as Bordetella bronchiseptica. It is called kennel cough because the infection can spread very quickly among dogs, who live together as in a kennel or an animal shelter. ==Infection== Both viral and bacterial causes of kennel cough are spread through the air by infected dogs sneezing and coughing. It can also be spread through contact with things that have the bacteria or virus on them. It can still be spread days or weeks after symptoms disappear. Symptoms usually begin about 3 to 5 days after the dog is around the infected animal or object. The disease can turn into pneumonia. ==Symptoms== Symptoms can include a harsh, dry coughing, retching, sneezing, snorting (noise made with the nose), gagging or vomiting in response to light pressing of the trachea or after excitement or exercise. The symptoms are caused by the inflammation of the airways. It can increase after excitement or exercise because of the quick breathing that takes place which causes the nerves of airway to become more stimulated. A fever is not always present. The disease can last 10–20 days and can come back when the dog is put into a stressful situation which puts stress on the dog's immune system. Medical diagnosis is made by seeing these symptoms, having a history of exposure is also helpful but not always found as kennel cough is easily spread through contact with the ground, toys, sidewalks, dog parks. ==Treatment and prevention== Antibiotics are given to treat any bacterial infection present. Cough suppressants are used if the cough is not productive (nothing is being coughed up). The usual outcome is good. Prevention is by vaccinating for canine adenovirus, distemper, parainfluenza, and Bordetella. In kennels, the best prevention is to keep all the cages clean. Most kennels will not board dogs without proof of vaccination. ==Related pages== *Bronchitis ==References== ==Other websites== *Kennel Cough Home Remedy *Kennel Cough from The Pet Health Library *Merck Veterinary Manual Entry on Kennel Cough *Kennel Cough Category:Dogs Category:Animal diseases",
 "title": "Kennel cough"
}