{
 "id": "188032",
 "text": "Sachin Ramesh Tendulkar (born 24 April 1973 in Mumbai) is a former Indian cricketer. He is widely regarded as one of the greatest batsman in the history of cricket. He has the highest number of runs in both Test cricket and One Day Internationals. He also has the highest number of centuries in both formats of the game. He always honoured better players than him like Garfield Sobers or Don Bradman. Sachin Tendulkar is one the richest cricketer of India. ==100th international century== Tendulkar scored his much awaited 100th international hundred on 16 March 2012 against Bangladesh in the Asia Cup. He became the first person in history to achieve this feat. Incidentally, it was Tendulkar's first ODI hundred against Bangladesh. He said \"It's been a tough phase for me ... I was not thinking about the milestone, the media started all this, wherever I went, the restaurant, room service, everyone was talking about the 100th hundred. Nobody talked about my 99 hundreds. It became mentally tough for me because nobody talked about my 99 hundreds.\" == National honours of sachin == * 1994 - Arjuna Award, by the Government of India in recognition of his outstanding achievement in sports. * 1997-98 - Rajiv Gandhi Khel Ratna, India's highest honour given for achievement in sports. * 1999 - Padma Shri, India's 'fourth' highest civilian award. * 2001 - Maharashtra Bhushan Award, Maharashtra State's highest Civilian Award. * 2008 - Padma Vibhushan, India's second highest civilian award. * 2014 - Bharat Ratna, India's highest civilian award. ==Gallery== File:Cricket Partnership.jpg File:Tendulkar's.jpg File:Tendulkar shot.JPG File:Tendulkar closup.jpg File:Tendulkar batting against Australia, October 2010 (1), cropped.jpg File:Sachin Tendulkar at MRF Promotion Event.jpg == References == ==Other websites== * Official website * Full Information about sachin in simple Category:1973 births Category:Living people Category:Indian cricketers Category:Marathi people Category:Sportspeople from Mumbai",
 "title": "Sachin Tendulkar"
}