{
 "id": "188017",
 "text": "Oliver Twist; or, The Parish Boy's Progress (1838) is Charles Dickens's second novel. It was first published as a book by Richard Bentley in 1838. It tells the story of an orphan boy and his adventures among London's slums. Oliver is captured by, and forced to work among, pickpockets and thieves until redeemed by a gentleman who has taken an interest in him. Characters include Fagin, Nancy, Bill Sykes, and the Artful Dodger. The book is one of the earliest examples of the social novel. It draws the reader's attention to evils such as child labour, the recruitment of children as criminals, and the presence of street children. The novel may have been inspired by the story of Robert Blincoe, an orphan whose account of hardships as a child labourer in a cotton mill was widely read in the 1830s. It is likely that Dickens's own early youth as a child labourer contributed to the story's development. The book influenced American writer Horatio Alger, Jr. and his stories of poor boys living on the streets of nineteenth-century New York City. The book has been adapted to a popular musical play called Oliver! and several movies, notably a 1948 production starring Alec Guinness as Fagin. A Disney animated feature about alley cats called Oliver & Company has also been released. == Plot Summary == Oliver mc Twist is born into a life of poverty. He is raised in a workhouse in the fictional town of Mudfog. He is orphaned by his father's odd absence and his mother's death in childbirth. His mother was welcomed only in the workhouse and robbed of her gold name locket (a small case worn round someone's neck). Oliver is not well provided for under the Poor Law and spends nine years living in the \"care\" of a woman named Mrs Mann, who embezzles much of the money given to her to take care of the babies by the parish. Oliver is brought up with little food. Around the time of Oliver's ninth birthday, Mr Bumble, the parish beadle, removes Oliver from the baby farm and puts him to work picking and weaving oakum (loose fibre from untwisting old rope) at the main workhouse. Oliver, who works very hard, and has very little food,stays in the workhouse for six months. One day, the very hungry boys decide to draw lots; the loser must ask for more food. This task falls to Oliver, who at the next meal begs the master for food with his famous request: \"Please, sir, I want some more\". The board of well-fed gentlemen who manage the workhouse offer £5 to any person wishing to take on Oliver as an apprentice. Mr Gamfield, a brutal chimney sweep, almost claims Oliver. However, when Oliver begs not to be sent away with \"that dreadful man\", a kind magistrate lets Oliver not be taken away by Mr Gamfield. Later, Mr Sowerberry, an undertaker employed by the parish, takes Oliver into his service. He treats Oliver better and, because of Oliver's sad face, uses him as a mourner at children's funerals. Mr Sowerberry is in an unhappy marriage, and his wife looks down on Oliver and misses few opportunities to give him less food and treat him badly. He also suffers at the hands of Noah Claypole and Charlotte, the Sowerberrys' maidservant, who is in love with Noah. Wanting to bait Oliver, Noah insults Oliver's mother, calling her \"a regular right-down bad 'un\". Angry, Oliver assaults. Mrs Sowerberry takes Noah's side, helps him to punch and beat Oliver. Once Oliver is sent to his room for the night, he cries. The next day Oliver runs away from the Sowerberrys' house and later decides to run away to London to seek a better life. Nearing London, Oliver sees Jack Dawkins, a pickpocket, known by the nickname the \"Artful Dodger\", and his sidekick, a funny boy named Charley Bates. Oliver's innocent and trusting nature fails to see any bad in their actions. The Dodger provides Oliver with a free meal and tells him of a gentleman in London who will \"give him lodgings(a place to live) for nothing, and never ask for change\". Grateful for the assistance, Oliver follows the Dodger to the \"old gentleman's\" house. In this way, Oliver falls in with an Jewish criminal known as Fagin. Not able to run away, Oliver lives with Fagin and his gang of juvenile pickpockets at Saffron Hill for some time, unaware of their criminal occupations. He believes they make wallets and handkerchiefs. He is also does not know about Fagin's lessons with the boys, whereupon he pretends to be an English gentleman browsing shops, and the boys must pick everything from his pockets while staying out of sight. Oliver considers this a strange game. Fagin has Oliver in this training until he successfully picks everything off him. Fagin rewards Oliver with a shilling and orders him out on the street with Charley Bates and the Artful Dodger. Oliver follows the pair to \"make handkerchiefs\", only to learn that their real mission is to pick pockets. The Dodger and Charley steal the handkerchief of an old gentleman named Mr. Brownlow and then flee. When he finds his handkerchief missing, Mr. Brownlow turns round, sees Oliver running away in fright, and pursues him, thinking he was the thief. Others join the chase, capture Oliver, and bring him before the magistrate. Curiously, Mr. Brownlow has second thoughts about the boy – he seems not to believe he is a pickpocket. To the judge's evident disappointment, a bookstall holder who saw the Dodger commit the crime clears Oliver, who, by now actually ill, faints in the courtroom. Mr. Brownlow takes Oliver home and, along with his housekeeper Mrs. Bedwin, cares for him. While recovering, both Mrs. Bedwin and Mr. Brownlow notice how Oliver bears a striking resemblance to a painting of a woman who was the wife of a dead friend of Mr. Brownlow's. Oliver stays with Mr. Brownlow, recovers quickly. His bliss is interrupted when Fagin, fearing Oliver might tell the police about his criminal gang, decides that Oliver must be brought back to his hideout. When Mr. Brownlow sends Oliver out to pay for some books, one of the gang, a young woman named Nancy, whom Oliver had previously met at Fagin's, approached him with help from her abusive lover, the robber Bill Sikes, and Oliver is quickly bundled back to Fagin's lair. The thieves take the five-pound note Mr. Brownlow had entrusted to him, and strip him of his new clothes. Oliver, shocked, flees and attempts to call for police assistance, but is dragged back by the Artful Dodger, Charley, and Fagin. Nancy, alone, is sympathetic towards Oliver and saves him from beatings by Fagin and Sikes. In a renewed attempt to draw Oliver into a life of crime, Fagin forces him to participate in a burglary. Nancy reluctantly assists in recruiting him, all the while assuring the boy that she will help him if she can. Sikes, after threatening to kill him if he does not cooperate, puts Oliver through a small window and orders him to unlock the front door. The robbery goes wrong, and the people in the house shoot Oliver in his left arm. After being abandoned by Sikes, the wounded Oliver makes it back to the house and ends up under the care of the people he was supposed to rob: Miss Rose and her guardian Mrs. Maylie. The mysterious man Monks plots with Fagin to destroy Oliver's reputation. The two of them agree on a plan to make sure he does not find out about his past. Monks is apparently related to Oliver in some way. Back in Oliver's hometown, Mr Bumble has married Mrs Corney, the matron of the workhouse where the story first began, only to find himself in an unhappy marriage, constantly arguing with his wife. After one such argument, Mr Bumble walks to a pub where he meets Monks, who questions him about Oliver. Bumble informs Monks that he knows someone who can give Monks more information for a price, and later Monks meets secretly with the Bumbles. After Mrs Bumble tells Monks all she knows for a price, Monks takes the locket and ring proving Oliver's parentage, and drops them into the river flowing under his place. Monks tells these events to Fagin, not knowing that Nancy is eavesdropping on their conversations and plans to inform Rose Maylie and Mrs Maylie. Mr Brownlow returns to London, where Oliver sees him, and brings him to meet the Maylies. Now ashamed of her role in Oliver's kidnapping and worried for his safety, Nancy goes to Rose Maylie, staying in London. She knows that Monks and Fagin are plotting to get their hands on the boy again, and offers to meet again any Sunday night on London bridge. Rose tells Mr Brownlow, and the two then make plans with all their party in London. The first Sunday night, Nancy tries to leave for her walk, but Sikes do not give permission when she does not say exactly where she is going. Fagin realizes that Nancy is up to something and resolves to find out what her secret is. Meanwhile, Noah has fallen out with the undertaker Mr Sowerberry, stolen money from him, and fled to London with Charlotte. Using the name \"Morris Bolter\", he joins Fagin's gang for protection and becomes a practicer of \"the kinchin lay\" (robbing of children), and Charlotte is put with the girls. Fagin sends Noah to watch the Artful Dodger on trial, after he is caught with a stolen silver snuff box; the Dodger is convicted while showing his style, with a punishment of transportation to Australia. Next, Noah is sent by Fagin to spy on Nancy, and discovers her meeting with Rose and Mr Brownlow on the bridge, hearing their discussion of why she did not appear the prior week and how to save Oliver from Fagin and Monks. Fagin passes the information on to Sikes angrily, making the story to make it sound as if Nancy had informed on him, when she had not. Believing Nancy to be a traitor, Sikes beats her to death. He then escaped to the countryside. There, Sikes is haunted by visions of Nancy and alarmed by news of her murder spreading across the countryside. He returns to London to find a hiding place and intends to steal money from Fagin and flee to France, only to die by accidentally hanging himself while attempting to lower himself from a rooftop to flee from a mob angry at Nancy's murder. === Resolution === While Sikes is running away the mob, Mr Brownlow forces Monks to listen to the story connecting him, once called Edward Leeford, and Oliver as half-brothers, or to face the police for his crimes. Their father, Edwin Leeford, was once friends with Brownlow. Edwin had been in a sad marriage that produced Monks, only to have Monks' mother separate. Edwin had associated with an older gentleman who was friends to him and Mr. Brownlow, who had had two daughters, one who was a girl of seventeen and the other a toddler. Edwin fell in love with the elder daughter, Agnes, but their relationship had been secretive. Edwin had to help a dying friend in Rome, and then died there himself, leaving Agnes, \"his guilty love\", in England, whereupon she died after giving birth to Oliver. Mr Brownlow has a picture of Agnes and had begun asking questions when he noticed a marked resemblance between her and Oliver. Monks had hunted his brother to destroy him, to gain all in their father's will. Meeting with Monks and the Bumbles in Oliver's native town, Brownlow asks Oliver to give half his inheritance to Monks to give him a second chance; Oliver is more than happy to comply. Monks moves to \"the new world\", where he dies in prison. Fagin is arrested, tried and condemned to the gallows. On the eve of Fagin's hanging, Oliver, accompanied by Mr Brownlow in an emotional scene, visits Fagin in Newgate Prison, in hope of retrieving papers from Monks. Fagin is lost in a world of his own fear of death. On a happier note, Monks revealed that Rose was the younger sister of Agnes, and thus Oliver's aunt. She marries her sweetheart Harry Maylie, who gives up his political ambitions to become a parson, drawing all their friends to settle near them. Oliver lives happily with Mr Brownlow, who adopts him. Due to Noah's cooperation with the law during the pursuit of Fagin, he is granted immunity and becomes a paid, semi- professional police informer. The Bumbles lose their positions and are reduced to poverty, ending up in the workhouse themselves. All the members of Fagin's gang suffer unhappy endings, with one exception. Charley Bates, horrified by Sikes' murder of Nancy, becomes an honest citizen, moves to the country, and eventually becomes rich. The novel ends with the tombstone of Oliver's mother on which is written only one name: Agnes. Category:1830s books Category:Books by Charles Dickens Category:Books first published in serial form Category:English novels",
 "title": "Oliver Twist"
}