{
 "id": "188107",
 "text": "The Tibetan Muslims, also known as the Kachee (Kache) in Tibet, are Tibetans who follow the religion of Islam. They are a minority in Tibet. The Tibetan word Kachee literally means Kashmir and Kashmir was known as Kachee Yul (Yul = Country) to the Tibetans. Islam in Tibet came through Kashmir. Despite being in small number, Tibetan Muslims live throughout Tibet. Many of them can be found in Lhasa and Shigatse. Some also live outside the Tibet Autonomous Region. Ethnic groups such as the Baltipa and Purigpa are Tibetans too, and are known as Tibetan Muslims as well. These other groups, however, are mainly found in the Baltiyul, and Ladakh areas of Pakistan/India. Extensive trade with Kashmir, Ladakh, and Baltistan also brought Muslims to Tibet especially after the adoption or growing presence of Islam in these regions starting from the fourteenth century. The ongoing growth of Muslims continued as an effect of the Tibetan-Ladakhi treaty of 1684 in which the Tibetan government allowed trade missions from Ladakh to enter Lhasa every three years. Many Kashmiri and Ladakhi Muslims joined these missions with some settling in Tibet. During the reign of the Dalai Lama Ngawang Lobsang Gyatso (1617–1682), a permanent Muslim community settled down in Tibet. They were permitted to elect their own council of representatives, settle their group's legal disputes with Islamic law, and some land was donated to them for the construction of a mosque close to Lhasa. The community soon adopted aspects of Tibetan culture like dress, diet, and the Tibetan language. == Gallery == File:Diva of Hope - Nasr Rahman.jpg|link=|An old Balti Tibetan woman praying in a mosque in Khaplu, Pakistan File:Dalai Lama with Tibetan Muslims.jpg|link=|Dalai Lama with Tibetan Muslims. File:A new Muslim Mosque in Lhasa.jpg|link=|A Tibetan mosque in Lhasa. File:Muslim family of Amdo with Tibetan-style hats.jpg|link=|Amdo Tibetan Muslims photographed in Tibet, China File:Songpan.mosquee.jpg|link=|Songpan Mosque in Tibet, China. File:Large balcony Chaqchan Mosque, Khaplu.jpg|link=|Balcony of the 700 years old Chaqchan Gonma (Mosque) in Khaplu, Baltistan. File:The wooden basket making in North Pakistan Gilgit Baltistan Pakistan.jpg|link=|An old Balti Tibetan man in Khaplu making traditional wooden basket. File:Lhasa mosque2.jpg|link=|One of the biggest mosques in Tibet, the Lhasa Mosque. == Related pages == * Islam in China * Balti people, Muslims of Tibetan ancestry that live in Baltistan, Pakistan * Purigpa, Muslims of Tibetan ancestry that live in Ladakh, Upper Indus Valley == References == Category:Tibetan people Category:Ethnic groups in China Category:Islam by country",
 "title": "Tibetan Muslims"
}