{
 "id": "18848",
 "text": "The Supreme Court of the United States is the highest court in the United States of America. Because of this, the Court leads the Judicial Branch of the United States Federal Government. It is the only U.S. court established by the United States Constitution. Its decisions are supposed to be followed by all other courts in the United States. Since 1935, the Court has met in its own building in Washington, D.C.; before that, it met in the United States Capitol. ==Background== There are 9 justices on the court now: one Chief Justice and eight Associate Justices. Courts (a set of all justices of the court while one Chief Justice is serving) are unofficially named for the Chief Justice; the current Court is called the \"Roberts Court\" after Chief Justice John Roberts. The Supreme Court chooses which cases it will decide on, by choosing to give a writ of certiorari or not. Almost 7,000 people, known as petitioners, ask the Supreme Court to decide their cases every year, but the court only gives a writ to about 100 or less. For the Supreme Court to decide a case, the case must be about: federal law, the Constitution of the United States, disagreements between states or their residents, or another court's decision that differs from what the Supreme Court has decided on a similar case. Cases must first be decided by a federal district court and a federal court of appeals or by a state supreme court. Even after that, the Supreme Court can choose not to decide a case for any reason. Cases about disagreements between states or their residents sometimes can only be decided by the Supreme Court, but those are rare. The justices serve for life unless they retire or are impeached. If a justice retires, he or she can still be asked to serve as a judge on a federal Court of Appeals. New justices are nominated (picked) by the President of the United States, and then must be approved by the United States Senate. The most recent justice to be chosen is Ketanji Brown Jackson, who was nominated by President Joe Biden in February 2022, to replace retiring Justice Stephen Breyer. After the Senate approved her, Jackson became the first female African American justice. ==The current Court== Justice / birthdate and place Justice / birthdate and place Appointed by SCV Age at Age at Start date / length of service Previous position or office Replaced Justice / birthdate and place Justice / birthdate and place Appointed by SCV Start Present Start date / length of service Previous position or office Replaced Buffalo, New York 78-22 50 Judge of the United States Court of Appeals for the District of Columbia Circuit (2003–2005) Rehnquist Pin Point, Georgia 52–48 43 Judge of the United States Court of Appeals for the District of Columbia Circuit (1990–1991) Marshall Trenton, New Jersey 58-42 55 Judge of the United States Court of Appeals for the Third Circuit (1990–2006) O'Connor The Bronx, New York 68-31 55 Judge of the United States Court of Appeals for the Second Circuit (1998–2009) Souter Manhattan, New York 63-37 50 Solicitor General of the United States (2009–2010) Stevens Denver, Colorado 54–45 49 Judge of the United States Court of Appeals for the Tenth Circuit (2006–2017) Scalia Washington, D.C. 50-48 53 Judge of the United States Court of Appeals for the District of Columbia Circuit (2006–2018) Kennedy New Orleans, Louisiana 52–48 48 Judge of the United States Court of Appeals for the Seventh Circuit (2017–2020) Ginsburg Washington, D.C. 53-47 51 Judge of the United States Court of Appeals for the District of Columbia Circuit (2021–2022) Breyer Source: Source: Source: Source: Source: Source: Source: Source: Source: ==Living former justices== Retired justices of the Supreme Court Justice Birthdate and place Justice Birthdate and place Appointed by Retired under Age at Age at Age at Tenure Tenure Tenure Justice Birthdate and place Justice Birthdate and place Appointed by Retired under Start Retirement Present Start date End date Length Sacramento, California 51 82 Stephen Breyer San Francisco, California 55 83 ==References== Category:Supreme Court of the United States *[SCV]: U.S. Senate confirmation vote",
 "title": "Supreme Court of the United States"
}