{
 "id": "18862",
 "text": "Holocaust denial, Distortion of the Holocaust refers, inter alia, to: * * * * * or Holocaust distortion, refers to the false claim that the Holocaust did not happen or was not as bad as commonly believed. Historians agree that the Nazis killed at least 6,000,000 Jews (67% of pre-war European Jews) in the Holocaust, * * * * * * * * * mostly in Nazi concentration camps within occupied territories across Europe back then. ==Background== ===Definition of the Holocaust=== As per the Holocaust Encyclopedia, run by the United States Holocaust Memorial Museum (USHMM), According to Yad Vashem: As per the Holocaust Memorial Day Trust: According to the International Holocaust Remembrance Alliance (IHRA): ==Recent trend== A trend of Holocaust denial, some state-sponsored, is seen in other European countries, including Austria, Croatia, * * * * * Czechia, Hungary, * * * Germany, Italy and Poland. * Robert Rozett, “Competitive Victimhood and Holocaust Distortion,” The Israel Journal of Foreign Affairs, XVI (2022); “Distorting the Holocaust and Whitewashing History: Toward a Typology,” XIII: 1 (2019); Yehuda Bauer, “Creating a “Usable” Past: On Holocaust Denial and Distortion,” XIV: 2 (2022); and Jan Grabowski, “The Holocaust and Poland's 'History Policy'” X: 3 (2016). * Joanna Beata Michlic, “The Politics of the Memorialisation of the Holocaust in Poland: Reflections on the Current Misuses of the History of Rescue,” Jewish Historical Studies—Transactions of the Jewish Historical Society of England, LIII: 1 (2022); Piotr Forecki, Po Jedwabnem: Anatomia pamięci funkcjonalnej (Kraków, 2018); Jan Gross, Neighbors: The Destruction of the Jewish Community in Jedwabne (Princeton, 2001). * Piotr Forecki, “Domestic ‘Assassins of Memory’: Various Faces of Holocaust Revisionism in Contemporary Poland,” presentation at a symposium in honor of Professor Antony Polonsky called “The Holocaust in Eastern Europe: sources, memory, politics,” March 16, 2021, UCL, London. * * Antony Polonsky and Joanna Beata Michlic (eds.), The Neighbors Respond: The Controversy over the Jedwabne Massacre in Poland (Princeton, 2009) and Laurence Weinbaum, “Amnesia and Antisemitism in the ‘Second Jagiellonian Age,’” Anti-Judaism, Antisemitism, and Delegitimizing Israel, Robert Wistrich (ed.) (Lincoln, 2016). * “Professors Engelking and Grabowski case: Victory in the Warsaw Court of Appeal,” International Jewish Lawyers, https://www.ijl.org/engelking-and-grabowski-case13. For the full judgement, see https://www.ijl.org/grabowski_engelking-full. * In the book Decoding Antisemitism, co-author Hagen Troschke said that the common strategies of such denial consisted of: # Making some Holocaust perpetrators look better than they were # Reducing the Holocaust responsibility to a small group of perpetrators # Doubting the scientifically proven death tollLitvak, Meir, and Esther Webman. 2009. From Empathy to Denial. Arab Responses to the Holocaust. New York: Columbia University Press. # Blaming Jews for the Holocaust # Equating the Holocaust with other crimes against humanity, which is common in academia. * * * * Some scholars said that Holocaust denial had gone mainstream * * * amid the rise of nationalism across Europe, where Jews were sometimes equated with the disliked Soviet communists against whom the Holocaust was considered \"a reaction\". Some described the phenomenon with the concept mnemonic politics, where nationalist governments distorted the Holocaust by framing their ethnic majority as the victims rather than the Jews or Roma.Kónczal, Kornelia, and Moses, A. Dirk. 2022. “Patriotic Histories in Global Perspective.” Journal of Genocide Research 24 (2): 153–157. CrossRef Google Scholar Such denial is sometimes rooted in the conspiracy theory that the mainstream Holocaust historiography's focus on Jews is an EU plot to suppress national identitySoroka, George, and Krawatzek, Félix. 2019. “Nationalism, Democracy, and Memory Laws.” Journal of Democracy 30 (2): 157–171. CrossRef Google Scholar and promote \"cosmopolitanism\" and \"multiculturalism\".Ray, Larry, and Kapralski, Sławomir. 2019. “Introduction to the Special Issue – Disputed Holocaust Memory in Poland.” Holocaust Studies 25 (3): 209–219. CrossRef Google Scholar ==Definition== Contrary to public misconceptions, Holocaust denial does not simply mean denying that the Holocaust happened. Instead, it also includes the following acts: > # Intentional efforts to excuse or minimize the impact of the Holocaust or > its principal elements, including collaborators and allies of Nazi Germany; > # Gross minimization of the number of the victims of the Holocaust in > contradiction to reliable sources; # Attempts to blame the Jews for causing > their own genocide; # Statements that cast the Holocaust as a positive > historical event. Those statements are not Holocaust denial but are closely > connected to it as a radical form of antisemitism. > IHRA Working Definition of Antisemitism : * Calling for, aiding, or > justifying the killing or harming of Jews in the name of a radical ideology > or an extremist view of religion. * Making mendacious, dehumanizing, > demonizing, or stereotypical allegations about Jews as such or the power of > Jews as collective — such as, especially but not exclusively, the myth about > a world Jewish conspiracy or of Jews controlling the media, economy, > government or other societal institutions. * Accusing Jews as a people of > being responsible for real or imagined wrongdoing committed by a single > Jewish person or group, or even for acts committed by non-Jews. * Denying > the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the > genocide of the Jewish people at the hands of National Socialist Germany and > its supporters and accomplices during World War II (the Holocaust). * > Accusing the Jews as a people, or Israel as a state, of inventing or > exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal > to Israel, or to the alleged priorities of Jews worldwide, than to the > interests of their own nations. * Denying the Jewish people their right to > self-determination, e.g., by claiming that the existence of a State of > Israel is a racist endeavor. * Applying double standards by requiring of it > a behavior not expected or demanded of any other democratic nation. * Using > the symbols and images associated with classic antisemitism (e.g., claims of > Jews killing Jesus or blood libel) to characterize Israel or Israelis. * > Drawing comparisons of contemporary Israeli policy to that of the Nazis. * > Holding Jews collectively responsible for actions of the state of Israel. > They may suggest that the Holocaust did not go far enough in accomplishing > its goal of “the Final Solution of the Jewish Question”; # Attempts to blur > the responsibility for the establishment of concentration and death camps > devised and operated by Nazi Germany by putting blame on other nations or > ethnic groups. For instance, someone acknowledging that the Holocaust happened while denying the Nazi use of poison gas in the death camps is also a Holocaust denier. Whether like-minded people see the person as denying the Holocaust is irrelevant. ==Denialist claims== Below is a summary of usual claims made by Holocaust deniers. Type Rhetoric Common * They say the Nazis \"did not use death camps or gas chambers to kill Jews\". * Holocaust deniers say the Nazi regime was \"only trying to deport Jews, not to kill all of them\". They say there was \"no official Nazi policy to kill Jews\", and that \"no Nazi leader ever gave an order to kill all of the Jews\".Mathis, Andrew E. Holocaust Denial, a Definition, The Holocaust History Project, July 2, 2004, Retrieved 6 March 2013 * History experts agree that the Nazis killed at least 6,000,000 Jews during the Holocaust.Mathis, Andrew E. Holocaust Denial, a definition , The Holocaust History Project, July 2, 2004, Retrieved 6 March 2013 Holocaust deniers say that far fewer Jews actually died. They also claim that many of these victims died of diseases, like typhus, instead of being murdered by the Nazis.Michael Shermer & Alex Grobman. Denying History: : who says the Holocaust never happened and why do they say it?, University of California Press, 2000, , p. 106 * They say that evidence about the Holocaust is fake. * They say there are errors and differences in stories told by Holocaust survivors and so the stories cannot be believed. Other * They say the allies treated enemy prisoners of war just as badly as the Nazis treated the Jews. * They say that after being taken prisoner, many Nazis gave confessions about having committed war crimes. Holocaust deniers say these people said things that were not true because they were tortured. * They say that during World War II, \"the Allies made up fake stories about the Holocaust to make Germans look evil\" * Jews and the Allies \"spread these fake stories as part of a bigger plan\" to create a Jewish homeland in Palestine * Jews continue to spread these stories to get sympathy and to get support for the state of Israel. ==Tactics== ===Just Asking Questions=== Just Asking Questions (JAQ) is a pseudoskepticalFaking as being neutral about a topic to hide one's bias. * * * tactic often employed by Holocaust deniers to promote lies about the Holocaust by phrasing them as questions. * * * * * Holocaust deniers tend to claim that they are \"only asking questions\" about the Holocaust while rejecting the abundant amount of evidence that proves that the Holocaust happened. Writing for the Slate magazine, Johannes Breit, a German historian, stated that JAQ used to be seen frequently in posts made by Holocaust deniers in Reddit's r/AskHistorian subreddit (2.2M subscribers), which prompted its moderators to ban them from participation in 2018, while Reddit has been long been criticized for uncontrolled antisemitism. * * * * * American historian Deborah Lipstadt (1947 – ) commented on JAQ's potential impact: The Institute for Historical Review (IHR), a self-declared academic group that has been promoting Holocaust denial since 1978, uses JAQ in many of their publications. The Counter Extremism Project summarized IHR's activities as follows: While lying about being neutral, the IHR advances the antisemitic trope that the Holocaust was \"invented\" by Jews to \"further Jewish-Zionist interests.\" The IHR also pushed the myth that \"Nazi Germany actively supported Zionism\" by presenting relevant history without context. IHR's Holocaust distortion has had a considerable impact across the political spectrum. Former London mayor Ken Livingstone (1945 – ), who was a British Labour Party member until 2018, promoted the myth. So did the Palestinian Authority's leader * * * * * * and American Trotskyist activist writer Lenni Brenner (1937 – ), who published a book endorsing the myth. * * * * * * * * * * Since then, Brenner has denied encouraging Holocaust distortion, despite the book's content being cited extensively by antisemites on both the far right and far left to trivialize the Holocaust and demonize the vast majority of diaspora Jews who support Israel's right to exist. ===Sealioning=== As a similar concept to JAQ, sealioning refers to the act of repeating the same questions that have already been answered while faking ignorance and politeness. * * * It is also a common tactic among Holocaust deniers on online forums and social media. * * * * * ===Doubting Holocaust uniqueness=== Some well-educated antisemites are more skillful at promoting Holocaust denial. * * * * * They do not deny that the Holocaust happened, but they cast doubt on the Holocaust's nature, ignore the historical context leading up to the Holocaust, and abusively compare the Holocaust to other historical events. They do this to whitewash the Holocaust and dehumanize Holocaust victims so as to whitewash Nazi antisemitism and justify the mass murder of Jews. Such behavior is rejected by mainstream historians, including Emil Fackenheim, Yehuda Bauer, Deborah Lipstadt and Daniel Goldhagen. Some of them also accuse Jews of \"owning the Holocaust\" or \"extorting compensation from European governments\", and rewrite the Holocaust's history to inflate Jewish collaboration with Nazi Germans so as to blame Jews for their own suffering. * * * These false claims are common on social media, especially Reddit and English Wikipedia. ==Rebuttal== Historians agree that the Holocaust happened and that Holocaust deniers use bad research, get things wrong, and sometimes make facts up to support their claims. Many things together prove that the Holocaust did happen: * Written documents, like laws, newspaper articles, speeches made by Nazi leaders, and confessions from Nazi prisoners of war. The Nazis kept careful records, and many of them still exist. Even during World War II, many Germans knew about the Holocaust, and some tried to help save Holocaust victims. * Eyewitness testimony from people who saw what the Nazis did. That includes Holocaust survivors, like people who survived the Nazi concentration camps. There is specific testimony about the gas chambers from Jewish Sonderkommandos (concentration camp inmates who helped load bodies from the gas chambers to the crematoria because this gave them a chance to survive). It also includes the word of Nazi leaders, Nazi concentration camp guards, and Allied soldiers who discovered the camps. * The camps. Pieces of Nazi concentration camps, death camps, and work camps still exist. * Other evidence, like population statistics. ==Holocaust deniers== Holocaust deniers usually call themselves Holocaust revisionists to make themselves look good.Lipstadt, Deborah, Denying the Holocaust: The Growing Assault on Truth and Memory, Penguin, 1993, , p. 25 Their usual claim is that the Holocaust is \"a hoax made up by Jewish people working together.\"Mathis, Andrew E. Holocaust Denial, a definition , The Holocaust History Project, July 2, 2004, Retrieved 6 March 2013Michael Shermer & Alex Grobman. Denying History: : who says the Holocaust never happened and why do they say it?, University of California Press, 2000, , p. 106 It is a crime to deny the Holocaust in Israel and in many European countries, especially in Germany. Some Holocaust deniers, like Ernst Zündel, have been charged with crimes. ===Prominent Holocaust deniers=== Name Birth Death Origin Affiliations Ali Khamenei * * * * * * April 19, 1939 Mashhad, Iran Supreme Leader of Iran David Irving * * * * * March 24, 1938 Hutton, Essex, England A \"historian\" who is an alumnus of the ICL and UCL Ernst Zündel\"Holocaust denier in Germany sentenced to five years in prison – Europe – International Herald Tribune\", The New York Times, February 15, 2007. Retrieved November 14, 2009 April 24, 1939 August 5, 2017 A German graphic artist Hutton Gibson August 26, 1918 May 11, 2020 Peekskill, New York, United States Opus Dei member Jean-Marie Le Pen\"Le Pen Convicted for Racial Hatred\", Associated Press, June 2, 1999. Retrieved November 14, 2009. June 20, 1928 January 7, 2025 La Trinité-sur-Mer, Morbihan, France Founder of the National Front Louis Farrakhan * * * * * * * * * * * * * * May 11, 1933 The Bronx, New York Leader of Black nationalist religious movement Nation of Islam (NOI) Paul Rassinier March 18, 1906 July 28, 1967 Bermont, France A French Resistance fighter who survived a Nazi concentration camp Pierre Guillaume * * * December 22, 1940 July 11, 2023 France An anarcho-Marxist Richard Williamson * * * * * March 8, 1940 January 29, 2025 Buckinghamshire, England, United Kingdom Society of Saint Pius X Robert Faurisson * * * * January 25, 1929 October 21, 2018 Shepperton, England University of Lyon professor of literature Roger Garaudy\"Writer fined for Holocaust writings\", BBC News, February 27, 1998. Retrieved November 15, 2009. July 17, 1913 June 13, 2012 Marseille, France A former French Communist Party member ==Related pages== * Holodomor denial * Bosnian genocide denial * Rwandan genocide denial * Armenian genocide denial * Cambodian genocide denial ==Footnotes== ==References== Category:The Holocaust Category:Genocide denial Category:History of Europe Category:Conspiracy theories Category:Antisemitism in Europe Category:History of the United States",
 "title": "Holocaust denial"
}