{
 "id": "188899",
 "text": "Eugen Jochum (; 1 November 1902 – 26 March 1987) is an German conductor. Jochum was born in Babenhausen, near Augsburg, in the south of Germany. He soon showed musical talent and was playing the organ for church services when he was eight. He studied at the Augsburg Conservatory and then the Munich National Theatre and at Mönchen-Gladbach. He became conductor of the Kiel Opera where, during three years, he conducted more than 50 operas in several German cities. Then, in 1934, he followed Karl Böhm and Karl Muck as the conductor of the Hamburg Staatsoper. He stayed there until 1949. He also was guest conductor in Amsterdam with the Concertgebouw Orchestra and later he became chief conductor. After World War II, Jochum became the first chief conductor of the Bavarian Radio Symphony Orchestra in 1949. He often conducted in London with the London Philharmonic Orchestra and the London Symphony Orchestra. In 1975, the LSO gave him the title of conductor laureate. He appeared regularly at Salzburg and, from 1953, Bayreuth. The first opera he conducted there was Wagner's Tristan und Isolde. Jochum is remembered especially for his warm, romantic performances of Anton Bruckner's symphonies. He often conducted the passions of Bach and music by composers such as Beethoven, Brahms, Mozart, Haydn, Schumann, Wagner and Carl Orff. Jochum died in Munich, Germany at the age of 84. ==Discography== ===Studio albums=== Year Album details 1995 Haydn: The Creation; Missa Bervis Sti; Missa Sti Nicolai * Release date: April 11, 1995 * Label: Philips Classics Records 1997 Wagner: Overtures and Preludes * Release date: October 1, 1997 * Label: Deutsche Grammophon 2001 Beethoven: Piano Concertos Nos. 2 & 5 * Release date: December 21, 2001 * Label: Deutsche Grammophon 2005 Bach: Mass in B minor * Release date: May 24, 2005 * Label: EMI Classics 2009 Beethoven, Mozart: Piano Concertos * Release date: November 17, 2009 * Label: BR Klassik ==References== Category:1902 births Category:1987 deaths Category:German conductors",
 "title": "Eugen Jochum"
}