{
 "id": "188999",
 "text": "2021 (MMXXI) was a common year starting on Friday in the Gregorian calendar, the 2021st year of the Common Era (CE) and Anno Domini (AD) designations, . ==Events== ===January=== * January 1 ** The African Continental Free Trade Area comes into effect. ** Cuba formally unifies its dual currency system after 27 years, with Cuban convertible peso (CUC) leaving and making the Cuban peso (CUP) the only national currency. ** Munster Technological University is opened in Cork, and Tralee, Ireland. * January 4 ** A British judge blocks the extradition of Julian Assange to the United States and Mexico offers him political asylum. ** Central African Republic President Faustin-Archange Touadéra is re-elected to a second term, winning 54% of the vote. ** The border between Qatar and Saudi Arabia reopens. * January 6 ** Protesters supporting outgoing U.S. President Donald Trump storm inside the United States Capitol while congress was certifying the results of the 2020 presidential election. The Democratic Party officially gains control of the United States Senate, now controlling both chambers of the United States Congress. ** 2019–20 Hong Kong protests: Hong Kong police arrest over 50 democracy activists under the national security law. * January 7 - 2019–2021 Persian Gulf crisis: Iraq issues an arrest warrant for U.S. President Donald Trump over the drone strike killing of Qasem Soleimani. * January 9 – Sriwijaya Air Flight 182 is declared missing after the plane dropped 10,000 ft within a minute north of Jakarta, Indonesia. The plane crashed, carrying over 60 passengers. A search and rescue team were deployed. * January 10 – Kim Jong-un is elected as the General Secretary of the ruling Workers' Party of Korea, taking the title from his late father Kim Jong-il, who died in 2011. * January 11 – COVID-19 pandemic: The number of confirmed cases of COVID-19 passes 90 million worldwide. * January 13 ** In Lyon, France, the first transplant of both arms and shoulders is performed on an Icelandic patient at the Édouard Herriot Hospital. ** U.S. President Donald Trump is impeached for a second time following the storming of the United States Capitol. He is the only president of the United States to be impeached twice. ** Prime Minister of Estonia Jüri Ratas resigns following a criminal investigation into the Estonian Centre Party. * January 14 – Ugandan President Yoweri Museveni is re- elected winning 58.64% of the vote, defeating Bobi Wine. * January 15 ** An earthquake occurs in Sulawesi, Indonesia, killing over 100 people. ** COVID-19 pandemic: The global death toll from the virus passes two million. ** Dutch Prime Minister Mark Rutte and his government resign as a result of a childcare benefits scandal. * January 17 – LauncherOne becomes the first liquid-fueled aircraft launched rocket to reach orbit. * January 20 – Joe Biden is inaugurated as the 46th President of the United States with Kamala Harris as the 49th Vice President of the United States. * January 21 - Governor General of Canada Julie Payette announced her resignation following allegations of a \"toxic workplace\" environment. * January 23 – In Russia, police arrest more than 3,000 people who were protesting in support of opposition leader Alexei Navalny who was also arrested. * January 24 – President of Portugal Marcelo Rebelo de Sousa is re-elected in a landslide victory winning 60.7% of the vote. * January 25 – Prime Minister of Italy Giuseppe Conte resigned following a loss of confidence from the coalition government that originally backed him in 2018. * January 26 ** COVID-19 pandemic: The number of confirmed COVID-19 cases pass 100 million worldwide. ** Kaja Kallas becomes the 19th Prime Minister of Estonia following a coalition government, becoming Estonia's first female prime minister. * January 27 ** The Polish Constitutional Tribunal rules that abortion for fetal defects is unconstitutional and resulting in a near-total ban of the practice in Poland. ** GameStop short squeeze: Investment funds report major losses after GME stock prices raised 900 times their record low. * January 28 – GameStop short squeeze: American financial services company Robinhood restricts the trade of stocks of several companies, including GameStop, causing outrage online. * January 31 – Nguyễn Phú Trọng is re-elected as General Secretary of the Communist Party of Vietnam for a third five-year term of top leader in Vietnam. ===February=== * February 1 ** A coup d'état in Myanmar removes Aung San Suu Kyi from power and restores military rule with Min Aung Hlaing as state leader. ** COVID-19 pandemic: Over 100 million vaccinations have been given to people worldwide. * February 2 – Jeff Bezos steps down as CEO of Amazon and names AWS CEO Andy Jassy as his replacement.Jeff Bezos to Step Down as Amazon C.E.O., New York Times, February 2, 2021. Retrieved February 2, 2021. * February 3 - Canada becomes the first country to name the Proud Boys as a terrorist organization. * February 4 - U.S. President Joe Biden announces that the United States will stop providing weapons to Saudi Arabia and the United Arab Emirates for use in the Yemeni Civil War. * February 7 ** A glacial burst in Uttarakhand, India kills at least 36 people and over 200 people are missing. ** In American football, the Tampa Bay Buccaneers defeat the Kansas City Chiefs with a 31 to 9 point margin at Super Bowl LV.Tom Brady Leads Tampa Bay Buccaneers To Super Bowl Win Over Kansas City Chiefs 31-9 * February 9 ** COVID-19 pandemic: A joint WHO-China investigation into the source of the outbreak is concluded with experts saying a Wuhan laboratory leak to be \"extremely unlikely\", with a \"natural reservoir\" in bats being a more likely origin. ** The United Arab Emirates' Hope spacecraft becomes the first Arabian mission to successfully enter orbit around Mars. * February 10 – China's Tianwen-1 is launched to Mars to learn about the planet's environmental quality. * February 11 – In Fort Worth, Texas, United States, at least nine people were killed in an accident involving 133 vehicles on a highway; affected by the weather conditions left by a snowstorm system. * February 12 – Former Prime Minister Yoshirō Mori, who was picked in 2014 to be in charge of the 2020 Summer Olympics in Tokyo, resigned from the Olympic committee after sexist comments he made. * February 13 ** A winter storm in North America begins which would cause 70 deaths and several million others without clean water or power. ** Former U.S. President Donald Trump is found not-guilty by the United States Senate for causing the storming of the United States Capitol during his second impeachment trial. ** Mario Draghi is appointed as the Prime Minister of Italy, a month after the resignation of Giuseppe Conte due to a failed coalition government. * February 15 – Nigerian-American economist Ngozi Okonjo-Iweala is picked as the first woman and first African to be Director-General of the World Trade Organization. * February 17 – 27 students and staff members at a school in Nigeria's Niger State are kidnapped by armed gunmen, killing one student. After government negotiations, all 27 were released on February 27. * February 18 – NASA's Mars 2020 mission lands on Mars after seven months of travel. * February 19 ** Porfirije becomes the 46th Patriarch of the Serbian Orthodox Church, replacing Irinej who died of COVID-19 in November 2020. ** The United States officially rejoins the Paris Agreement, 107 days after leaving. * February 20 ** COVID-19 pandemic: The number of vaccinations given worldwide pass 200 million. ** 2020–21 H5N8 outbreak: 7 people test positive for H5N8 bird flu at a poultry farm in southern Russia, making them the first human cases. * February 21 – Naomi Osaka and Novak Djokovic win the Women's and Men's Singles respectively at the Australian Open. * February 22 – COVID-19 pandemic: The United States becomes the first country to pass half a million deaths from the virus. * February 24 – COVID-19 pandemic: Ghana becomes the first country to receive vaccines through the COVAX vaccine-sharing initiative. * February 25 ** COVID-19 pandemic: The global death toll from COVID-19 passes 2.5 million. ** The Armenian military calls for Prime Minister Nikol Pashinyan to resign and Pashinyan accuses the military of attempting a coup d'état. * February 26 – More than 300 schoolgirls are kidnapped by unidentified gunmen from a school in Nigeria's Zamfara State. ===March=== * March 1 – Former French President Nicolas Sarkozy is found guilty of corruption and sentenced to three years in prison. * March 2 – Microsoft acknowledges a series of data breaches and cyberattacks, affecting about 250,000 servers globally. * March 3 - The Russo-Ukrainian crisis begins as Russia supported rebel groups near Ukraine to \"destruct\" the country. * March 5 – Moldova becomes the first country in Europe to receive coronavirus vaccines through COVAX. * March 6 – Pope Francis meets with Grand Ayatollah Ali al-Sistani in An Najaf, Iraq making it the first meeting between a pope and a grand ayatollah. * March 7 ** A series of explosions in Bata, Equatorial Guinea kills over 100 people and injures more than 600. ** In a referendum, Switzerland approved a nationwide ban on the burqa. * March 8 ** Prime Minister of Ivory Coast Hamed Bakayoko dies from cancer after being hospitalized with COVID-19, aged 56. Patrick Achi is nominated to replace him. ** COVID-19 pandemic: The number of vaccinations passed 300 million worldwide. ** In the United States, the murder trial of the four police officers involved in the murder of George Floyd begins in Minneapolis, Minnesota. * March 11 – 30 students and several staff members are kidnapped by unidentified gunmen from a school in Kaduna State, Nigeria. * March 13 – Former interim Bolivian President Jeanine Áñez is arrested on charges of terrorism, sedition and conspiracy over her actions during the 2019 coup of then-President Evo Morales. * March 16 – A mass shooting kills eight people in Atlanta, Georgia, with most of the victims being Asian American women. The attack is being called a hate crime against Asian-Americans mainly due to the COVID-19 pandemic. * March 17 ** Mathematicians Avi Wigderson of Hungary and László Lovász of Israel both win the Abel Prize for their work in complexity theory and graph theory. ** Dutch Prime Minister Mark Rutte's People's Party for Freedom and Democracy (VVD) wins the general elections, with liberal parties gaining seats. ** President of Tanzania John Magufuli dies in office from heart failure, aged 61. Vice President Samia Suluhu Hassan replaces him the following day, becoming the country's first female president. * March 18 ** COVID-19 pandemic: The number of vaccinations given worldwide are 400 million. ** In Australia, floods in New South Wales cause the evacuation of over 18,000 people and three killed.Thousands evacuated in Australia as 'life-threatening' floods inundate New South Wales by Jessie Yeung and Helen Reagan, CNN. 22 March 2021. * March 20 – Turkish President Recep Tayyip Erdoğan announced his country's withdrawal from the Istanbul Convention by a presidential decree, becoming the first country to withdraw from it. * March 22 ** A mass shooting kills ten people at a supermarket in Boulder, Colorado, United States. The suspect is shot and arrested by police. ** A fire breaks out at a Rohingya refugee camp near Cox's Bazar in Bangladesh, killing 15 people and injuring over 500 people. * March 23 ** The Israeli general elections take place, the fourth Knesset election in two years, with Likud winning the most seats. ** Ever Given, one of the largest container ships in the world, loses control and causes a major blockage in the Suez Canal causing a large disruption of global trade. * March 24 – Over twenty people are killed and 35,000 flee when Islamist rebels take the city of Palma in Cabo Delgado Province, Mozambique. The Islamic State of Iraq and the Levant claimed responsibility for the attack. * March 25 – COVID-19 pandemic: The number of vaccinations administered worldwide exceeds 500 million. * March 28 – Former President of Madagascar Didier Ratsiraka dies of problems caused by influenza in Antananarivo, aged 84. * March 30 – A series of riots break out in loyalist areas of Derry in Northern Ireland. * March 31 – Alfred Aho of Canada and Jeffrey Ullman of the United States win the Turing Award for their work in programming language compilers.ACM Turing Award Honors Innovators Who Shaped the Foundations of Programming Language Compilers and Algorithms. Retrieved March 31, 2021. ===April=== * April 2 ** At least 51 people are killed in a train derailment in Taiwan after a truck fell onto the track. ** Russia warns NATO against sending any troops to aid Ukraine, amid reports of a large Russian military build-up on its borders. * April 4 ** In Bulgaria, the conservative-populist GERB party led by Prime Minister Boyko Borisov wins the majority of seats in the parliamentary elections. ** Vjosa Osmani is elected the fifth President of Kosovo by the Assembly of Kosovo, becoming the second woman to hold this position. * April 6 – Cyclone Seroja makes landfall in Indonesia and East Timor, killing at least 160 people. * April 9 ** Naomi Mataʻafa is elected the 7th and first female Prime Minister of Samoa, after defeating the incumbent Tuilaepa Aiono Sailele Malielegaoi. ** La Soufrière, a Caribbean volcano in Saint Vincent, erupts which forced over 20,000 people to evacuate. ** Prince Philip, Duke of Edinburgh, the royal consort of Queen Elizabeth II, dies at Windsor Castle at aged 99. * April 10 – Banker and former Governor of Guayas Guillermo Lasso is elected the 47th President of Ecuador, defeating socialist candidate Andrés Arauz. * April 11 - Iran accuses Israel of \"nuclear terrorism\" and vows revenge, after a large explosion destroys the internal power system of the Natanz uranium enrichment plant, a nuclear power plant. * April 13 - Japan's government approves the dumping of radioactive water of the Fukushima Daiichi Nuclear Power Plant into the Pacific Ocean over the course of 30 years, with full support of the International Atomic Energy Agency. * April 15 – Scientists announce they successfully injected human stem cells into the embryos of monkeys, creating chimera-embryos. * April 17 – COVID-19 pandemic: The global death toll from COVID-19 passes 3 million. * April 18 ** Twelve football clubs, including the \"big six\" from the Premier League and leading clubs from the Serie A and La Liga, agree to join a new breakaway European Super League, despite condemnation from UEFA, FIFA and politicians including British Prime Minister Boris Johnson. ** Ulisses Correia e Silva is re-elected Prime Minister of Cape Verde. * April 19 ** NASA's Ingenuity helicopter, part of the Mars 2020 mission, performs the first powered flight on another planet in history. ** Raúl Castro resigns as First Secretary of the Cuban Communist Party, ending more than 62 years of rule by the Castro brothers in Cuba. President Miguel Díaz-Canel is picked as his replacement. * April 20 ** President Idriss Déby is killed during a rebel attack in North Chad, aged 68. ** The Mars Oxygen ISRU Experiment on the Perseverance rover creates oxygen from carbon dioxide in the Martian atmosphere. * April 21 – COVID-19 pandemic: With global case numbers approaching a second peak, India reports 315,000 infections within 24 hours, the highest one-day tally recorded anywhere in the world to date. * April 22 - World leaders mark Earth Day by hosting a virtual summit on climate change hosted by U.S. President Joe Biden, during which more targets for greenhouse gas emission reductions are proposed, including a 50% cut by 2030 for the United States. * April 24 ** Following an international search and rescue effort, the Indonesian navy reports the sinking of KRI Nanggala with 53 crew members, the largest loss of life aboard a submarine since 2003. ** COVID-19 pandemic: The number of vaccinations administered worldwide passes 1 billion. Half of these doses have been administered in just three countries. ** A hospital fire in Baghdad, where COVID-19 patients were being treated during the pandemic in Iraq, kills 82 people with 110 people injured. * April 25 ** Edi Rama is re-elected Prime Minister of Albania with his Socialist Party winning a narrow majority of 74 seats. ** Nomadland wins the Academy Award for Best Picture with its director (Chloé Zhao) and leading actress (Frances McDormand) winning Best Director and Best Actress respectively. Youn Yuh-jung, Anthony Hopkins and Daniel Kaluuya also won the awards for Best Supporting Actress, Best Actor and Best Supporting Actor, respectively. * April 28 ** The European Union approves of a major trade agreement with the United Kingdom following their exit from the European Union. ** After members of the Democratic Unionist Party (DUP) issue a motion of no confidence, DUP Leader and First Minister of Northern Ireland Arlene Foster announced her resignation effective the following month. ** American astronaut Michael Collins, the command module pilot for Apollo 11, dies at the age of 90. ** Clashes on the Kyrgyzstan–Tajikistan border leave at least 46 people dead and 30,000 civilians displaced. * April 29 - China launches the Tianhe space station module, the first module in the upcoming Tiangong space station. * April 30 - In Israel, at least 45 people are crushed to death with over 150 injured at a religious festival on Mount Meron. ===May=== * May 1 ** In horse racing, Medina Spirit wins the Kentucky Derby, the record seventh victory for trainer Bob Baffert. ** A ceasefire is declared following a border conflict between Kyrgyzstan and Tajikistan. * May 2 ** The SpaceX Crew-1 mission ends, returning four crewmembers of Expedition 64 and 65 to Earth from the International Space Station aboard Crew Dragon Resilience. ** Nationwide protests in Colombia against proposed tax increases to fund a basic income program result in at least six dead. President Iván Duque announced his withdrawal of the tax increase. * May 3 ** An elevated section of the Mexico City Metro overpass collapses, killing 26 people and injuring 70. ** Mark Selby wins the World Snooker Championship, defeating Shaun Murphy. * May 5 – SpaceX successfully flies, lands, and recovers a Starship prototype for the first time, after four unsuccessful previous attempts. * May 6 ** Former President of the Maldives Mohamed Nasheed is injured in a car bombing which has been described as an attempted assassination. ** In Brazil, at least twenty-five people are killed in a police raid shootout in Rio de Janeiro. ** In the United Kingdom, the Conservative Party win the majority of local elections, gaining some seats from the Labour Party. * May 8 ** Sadiq Khan of the Labour Party is re-elected Mayor of London winning 55% of the vote against Conservative Shaun Bailey. ** In Afghanistan, a bombing near a school in Kabul kills at least 85 people and injures 147 more. * May 11 ** Israel hits the Gaza Strip with airstrikes as Hamas increases rocket fire. ** Seven students and two adults are killed, and at least 21 more people are wounded, in a mass shooting at a school in Kazan, Tatarstan, Russia. * May 14 ** The China National Space Administration lands its Zhurong rover on Mars, making China the fourth country to land a spacecraft on the planet and only the second to land a rover. ** In India, Cyclone Tauktae makes landfall, leaving 87 people dead and over 80 people are missing. On the same day, the country also reported that 4,329 deaths from COVID-19, the highest number of COVID-related deaths in a single-day. * May 15 ** Fighting between Israeli forces and Palestinian militants continues to escalate, as the death toll exceeds 150. A high-rise office in Gaza occupied by Associated Press, Al Jazeera and other media outlets is destroyed by an Israeli airstrike. ** Leicester City wins the FA Cup and Manchester City wins the Premier League. * May 17 – Darwin's Arch, a rock formation in the Galápagos Islands, collapses because of natural erosion. * May 18–22 – The Eurovision Song Contest 2021 is held in Rotterdam, Netherlands, after the cancellation of the 2020 contest due to the COVID-19 pandemic. The 2021 contest is won by Italian entrants Måneskin with the song \"Zitti e buoni\". * May 20 - After international pressure and nearly 250 deaths, Israel agrees a ceasefire deal to end the conflict with Gaza militants, effective the next day at 2:00 AM local time. * May 22 - In Samoa, Prime Minister Tuilaepa Aiono Sailele Malielegaoi refuses to acknowledge his defeat and locks Naomi Mataʻafa from the Legislative Assembly causing a constitutional crisis. * May 23 ** Phil Mickelson wins the PGA Championship, becoming the oldest major championship winner in golf history at aged 50. ** In Peru, a militant communist group kills 18 people as protest against the presidential candidacy of conservative Keiko Fujimori just two weeks before the general election run-off. ** 14 people are killed in the cable car crash near Lake Maggiore in Italy. ** In Belarus, journalist and opposition activist Roman Protasevich is arrested after his Ryanair Flight 4978 is forced to land at Minsk National Airport under the orders of President Alexander Lukashenko. * May 24 - Members of the Malian Armed Forces captured and arrest President Bah Ndaw and Prime Minister Moctar Ouane in a coup d'état. Military leader Assimi Goïta becomes the interim president shortly afterwards. * May 26 ** Bashar al-Assad is re-elected President of Syria, winning 95% of the vote even though the votes cast for Assad was higher than the total population of Syria. ** The second-shortest total lunar eclipse of the 21st century occurs, with totality lasting for 14 minutes. The eclipse was visible over the Pacific Ocean, Oceania, Antarctica and parts of Asia and the Americas. ** Shell becomes the first company to be legally mandated to cut its carbon emissions and follow the Paris climate accord, following a landmark court ruling in the Netherlands. * May 27 - Poul Schlüter, Denmark's Prime Minister for over a decade and introduced the krone to the European Union, dies at aged 92. * May 29 ** In Canada, a mass grave with the remains of 215 children are found on the grounds of a former Indian residential school in British Columbia. ** Chelsea defeats Manchester City in the final of the UEFA Champions League. * May 30 - Brazilian driver Hélio Castroneves wins the Indy 500 for the fourth time. ===June=== * June 2 ** The Iranian oil fleet IRIS Kharg catches fire and sinks near the Gulf of Oman. No deaths were reported. ** Former Opposition Leader Isaac Herzog is elected as the 11th President of Israel defeating educator Miriam Peretz. ** The X-Press Pearl sinks near Colombo, Sri Lanka leaking many tons of nitric acid and oil into the Indian Ocean, causing the country's worst marine ecological disaster. The ship had been on fire for the past two weeks. ** The first daughter of Prince Harry, Duke of Sussex and Meghan, Duchess of Sussex is born in the United States in Santa Barbara, California. Lilibet Mountbatten-Windsor is eighth in the line of succession to the British throne. ** French writer David Diop wins the 2021 International Booker Prize for his novel At Night All Blood Is Black. * June 3 - Sir Anerood Jugnauth, who was Mauritius's Prime Minister for a total of twenty-years and its President for a decade, dies at aged 91. * June 4 ** Twitter's operations in Nigeria would be \"suspended\" permanently, with Nigeria arguing that the company causes activities that \"are capable of undermining Nigeria’s corporate existence. This comes after the company deleted tweets by President Muhammadu Buhari who was sending messages threatening violence. ** At least 152 people are killed in attacks on two villages in Burkina Faso. The attack lasted until the early hours of June 5. * June 5 - The G7 agrees on a global minimum corporate tax rate of 15% meant to stop world's richest people from not paying taxes. * June 6 ** In Canada, four Muslims are killed after being attacked by a truck in London, Ontario in what Prime Minister Justin Trudeau described as a \"terrorist attack\" caused by Islamophobia. ** The United States wins the first edition of the CONCACAF Nations League, defeating Mexico in the final by a scoreline of 3–2 after overtime. * June 7 ** Two trains crash in Ghotki District in Sindh, Pakistan, killing 65 people and injuring another 150. ** The Juno spacecraft performed its only flyby of Jupiter's moon Ganymede. It was the first flyby of the moon by any spacecraft in over twenty years. * June 9 ** Former Prime Minister Ukhnaagiin Khürelsükh is elected the 6th President of Mongolia, winning 72% of the vote. ** El Salvador becomes the first country to make Bitcoin as legal tender. * June 10 – An annular solar eclipse is visible from parts of the Northeast United States, Canada, Greenland, the North Pole, and the Russian Far East. * June 11 ** Rural farmer and teacher Pedro Castillo is elected the 63rd President of Peru, defeating conservative candidate Keiko Fujimori. ** The New York Times wins the 2021 Pulitzer Prize for Journalism for their coverage of the COVID-19 pandemic. ** World leaders meet at the 47th G7 summit, hosted by the United Kingdom, with topics of discussion including the COVID-19 pandemic, climate change, and the corporate taxation. ** The UEFA Euro 2020 and the 2021 Copa América begins, after being delayed due to the COVID-19 pandemic. * June 13 - Naftali Bennett becomes the 13th Prime Minister of Israel following a coalition agreement, ending Benjamin Netanyahu's twelve-year tenure as prime minister. * June 14 ** Enrique Bolaños, Nicaragua's president pushed for radical conservative policies, dies at aged 93. ** COVID-19 pandemic: Novavax announces 90.4% overall efficacy in its Phase 3 United States and Mexico trial. * June 16 - COVID-19 pandemic: CureVac announces an overall efficacy of just 47% of their vaccine based on an analysis of Phase III clinical trial. * June 17 ** Kenneth Kaunda, Zambia's first president and nation's founding father, dies at aged 97. ** China's Shenzhou 12 launches the first crew for the Tiangong space station. * June 19 - Chief Justice Ebrahim Raisi is elected the 8th President of Iran in a landslide victory. * June 20 ** Prime Minister Nikol Pashinyan is re-elected after his party, Civil Contract, wins the majority of seats in the National Assembly. ** Jon Rahm of Spain wins the 121st U.S. Open. * June 23 ** In cricket, New Zealand defeats India in the first ICC World Test Championship. ** Hours after Spain approved of his extradition to the United States for tax crimes, computer programming entrepreneur John McAfee commits suicide in his prison cell. * June 24 ** Former President of the Philippines Benigno Aquino III, who improved the country's economy, dies at aged 61. ** In the United States, a condominium in Miami, Florida collapses killing 97 people with 8 people reported missing. ** Apple Daily, a pro-democracy newspaper, is forced to shutdown for violating a national security law in Hong Kong. ** Former Prime Minister of South Vietnam General Trần Thiện Khiêm, who helped plan and execute coup that led to the assassination of Ngo Dinh Diem, dies at aged 95.Cựu Đại Tướng Trần Thiện Khiêm Qua Đời Tại California Hưởng Thọ 95 Tuổi * June 25 ** 751 unmarked graves are found near the former site of an indigenous peoples residential school in Saskatchewan, Canada. Prime Minister Justin Trudeau calls on Pope Francis to apologize for the Catholic church run boarding schools. ** Former police officer Derek Chauvin is sentenced to over 22 years for the murder of George Floyd, an unarmed African American man in Minneapolis, Minnesota. * June 28 – Tigray War: The Tigray Defense Force seizes the Tigrayan capital Mekele shortly after the Ethiopian government declares a ceasefire. * June 29 ** COVID-19 pandemic: The number of vaccinations given worldwide passes 3 billion. ** Former President of South Africa Jacob Zuma is sentenced to 15 months in prison for contempt of court. * June 30 - An extreme heat wave kills 600 people in the Pacific Northwest of North America. ===July=== * July 3 ** The United Nations announce that recent fighting in the Tigray region of Ethiopia has resulted in a famine that is now affecting more than 400,000 people. ** Over 130 wildfires, caused by lightning strikes, burn through Western Canada following a record-breaking heatwave in North America. * July 4 - In the Philippines, a plane crashes in Sulu, killing at least 53 people. * July 5 ** More than 1,000 Afghan soldiers flee to neighboring Tajikistan after clashing with Taliban militants. ** Gunmen kidnap 140 schoolchildren in Kaduna State, Nigeria. * July 6 ** Mary Simon is nominated to be the 30th Governor General of Canada. ** In Russia, a plane crashes in Kamchatka Krai, killing 28 people. * July 7 ** President of Haiti Jovenel Moïse is assassinated at aged 53. Interim Prime Minister Claude Joseph becomes acting president. ** Tampa Bay Lightning defeat the Montreal Canadiens in the Stanley Cup Finals. * July 8 - COVID-19 pandemic: The global death toll from COVID-19 passes 4 million. * July 10 ** Argentina beats Brazil with 1–0 in the final of the 2021 Copa América. ** The 2021 CONCACAF Gold Cup is held in the United States. * July 11 ** Euro 2020: Italy defeats England to win the UEFA European Championship final at Wembley Stadium. ** Nobel Peace Prize winner Abiy Ahmed is re-elected Prime Minister of Ethiopia in a landslide victory.Ethiopia's ruling party wins national election in landslide ** Virgin Galactic's Unity 22 mission launches with six people, including Virgin Galactic founder Richard Branson. ** Ashleigh Barty and Novak Djokovic win the respective women's and men's singles tournaments at Wimbledon.WIMBLEDON 2021 FINALS AS THEY HAPPENED - NOVAK DJOKOVIC SINKS MATTEO BERRETTINI, ASH BARTY BEATS KAROLINA PLISKOVA ** In Cuba, a large anti-government protests break-out because of food and medicine shortages caused by the government's mishandling of the COVID-19 pandemic. ** In Moldova, the Party of Action and Solidarity wins the majority of seats in the parliament. ** In Bulgaria, the There Is Such a People party wins the majority of seats in the National Assembly. * July 12 - Severe floods across Western Europe leave at least 90 people dead and 1,300 others missing. * July 13 ** Sher Bahadur Deuba becomes the 43th Prime Minister of Nepal after court order found that KP Sharma Oli tenure as prime minister was against the law. ** Over 70 people are killed during riots in South Africa following the arrest of former South African president Jacob Zuma in connection to a corrupt arms deal. * July 14 - Former President of Pakistan, Mamnoon Hussain, who led the country's polio eradication program dies at aged 80.Former Pakistan president Mamnoon Hussain Passes Away in Karachi * July 15 - Dutch journalist Peter R. de Vries dies after being shot multiple times in Amsterdam, aged 64. * July 17 ** Serial killer Michael Gargiulo, also known as the \"Hollywood Ripper\", is sentenced to death for two murders. ** Floods and landslides caused 56 deaths in Henan, China and leaving over 2 million evacuated or homeless. * July 18 - A report found that human rights activists, journalists and lawyers around the world have been targeted with a phone malware sold to authoritarian governments by an Israeli surveillance firm. * July 19 - Blue Origin successfully conducts its first human test flight, with a reusable New Shepard rocket delivering four crew members into space - founder Jeff Bezos, his brother Mark, 18-year-old Oliver Daemen (the youngest person to ever go into space), and 82-year-old Wally Funk (the oldest person to go into space). * July 20 ** Ariel Henry becomes the 23rd Prime Minister of Haiti and soon after becomes acting president following the resignation of acting Prime Minister and President Claude Joseph and the assassination of Jovenel Moïse. ** The Milwaukee Bucks defeat the Phoenix Suns to win the 2021 NBA Finals, their first championship win in fifty years. ** Women are permitted to attend without a male guardian (mehrem) provided they go in a trustworthy group during the Day of Haji. * July 21 ** Liverpool Maritime Mercantile City is removed from its UNESCO World Heritage Site status because of modern developments. ** The International Olympic Committee awards Brisbane the right to host the 2032 Summer Olympics. * July 22 - A flood in Maharashtra, India kills over 250 people. * July 23 - The 2020 Summer Olympics began in Tokyo, Japan, a year after being postponed due to the COVID-19 pandemic. * July 25 - Tunisian President Kais Saied fires Prime Minister Hichem Mechichi and freezes the Assembly of Representatives, causing a political crisis in Tunisia. * July 28 ** Wildfires in Turkey have killed at least six people and injured more than 400. ** Philip Pierre is elected the 8th Prime Minister of Saint Lucia. ** The first direct observation of light from behind a black hole is reported, confirming Albert Einstein's theory of general relativity. * July 29 ** The International Space Station temporarily spun out of control, moving the ISS 45 degrees out of altitude, following an engine malfunction. ** Oil tanker Mercer Street is attacked off coast of Oman, killing two crew members. ===August=== * August 1 - Myanmar coup leader Min Aung Hlaing forms a caretaker government, making himself the 13th Prime Minister of Myanmar, six months after the coup d'état against Aung San Suu Kyi. * August 3 ** Wildfires in Greece begin, killing three people.UK sends firefighters to Greece to help the battle against wildfires ** Lithuania sees an increase in illegal immigrants (mostly Iraqis) via Belarus as part of the 2021 Lithuanian migrant crisis.In Lithuania, Migrants Find Themselves Caught in a Geopolitical Battle ** Oil tanker Asphalt Princess is attacked off the coast of Oman. * August 4 ** Two trains crash into each other in the Czech Republic killing three people and injuring over 60 people. ** Belarusian sprinter Krystsina Tsimanouskaya travels to Poland to look for refuge after saying Belarus was forcing her to be part of the 2020 Summer Olympics. ** COVID-19 pandemic: The number of confirmed COVID-19 cases passes 200 million worldwide.World’s Coronavirus Infection Total Passes Staggering Figure: 200 Million * August 5 – Tigray War: The Tigray Defense Forces take control of the UNESCO World Heritage Site of Lalibela. * August 6 – Natalia Gavrilița is elected the 15th Prime Minister of Moldova. * August 8 ** The 2020 Summer Olympics ended in Tokyo, Japan with the United States winning the most gold medals and medals in total overall. ** Taliban members capture the Afghan city of Kunduz, Sar-e Pol and Taloqan as part of the 2021 Taliban offensive. * August 9 - The Intergovernmental Panel on Climate Change releases the first part of its report, which says that the effects of human-caused climate change are now \"widespread, rapid, and intensifying\". * August 10 – 2021 Taliban offensive as part of the War in Afghanistan: The Taliban seize the regional capitals Farah, Faizabad and Puli Khumri. * August 12 ** 2021 Taliban offensive as part of the War in Afghanistan: The Taliban seize the regional capitals Ghazni, Herat, Qala e Naw and Kandahar. ** Businessman Hakainde Hichilema is elected the 7th President of Zambia, beating incumbent President Edgar Lungu. ** A man kills five people in a mass shooting in Plymouth, Devon, England. He then kills himself. * August 13 – 2021 Taliban offensive as part of the War in Afghanistan: The Taliban seize the regional capitals Chaghcharan and Lashkar Gah. * August 14 – A 7.2-magnitude earthquake hits Haiti, killing more than 300 people. * August 15 – 2021 Taliban offensive as part of the War in Afghanistan: The Taliban captures Kabul causing the Afghan government to collapse with Afghan President Ashraf Ghani going into exile and leaving the country. * August 16 – Prime Minister of Malaysia Muhyiddin Yassin resigns after losing support from coalition parties. * August 21 ** Former Deputy Prime Minister of Malaysia Ismail Sabri Yaakob becomes the 9th Prime Minister after a coalition government fails to support Muhyiddin Yassin. ** In the United States, flash floods caused by heavy rain in Tennessee killed over 22 people with over 20 missing. * August 24 ** The 2020 Summer Paralympics are held in Tokyo, Japan after being postponed because of the COVID-19 pandemic. ** Former President and Prime Minister of Chad Hissène Habré, who was convicted of war crimes in 2016, dies of COVID-19 at aged 79. * August 26 ** During evacuations, a suicide bombing occurs at Hamid Karzai International Airport in Kabul, Afghanistan, killing over 180 people and injuring over 150. The Islamic State of Iraq and the Levant claimed responsibility for the explosion. ** The World Food Programme says that the food crisis in Madagascar is the first famine caused by climate change and not an armed conflict. * August 27 – The United States Air Force launches an airstrike, killing the Islamic State member who is believed to have planned the Kabul airport bombing. * August 29 – Hurricane Ida makes landfall in Lafourche Parish, Louisiana near the Gulf of Mexico as a 150 mph Category 4 hurricane, making it the 17th tropical cyclone of the decade to make landfall in the United States. * August 30 ** The United Nations announces that leaded petrol in road vehicles has been phased out globally, a hundred years after its introduction. ** Evacuations in Afghanistan end amid the Taliban taking control of the country, ending the War in Afghanistan.Afghanistan Live Updates: The United States Occupation Is Over ===September=== * September 3 - Prime Minister of Japan Yoshihide Suga announces his resignation as Liberal Democratic Party leader. * September 5 ** Guinean President Alpha Condé is detained and removed from power by an elite military unit led by Mamady Doumbouya, who claimed to have taken power. ** The 2020 Summer Paralympics ends in Tokyo with China winning the most gold medals and medals overall. * September 6 - Carlos Vila Nova is elected the 5th President of São Tomé and Príncipe.São Tomé and Príncipe ex-minister wins presidency * September 7 ** El Salvador becomes the first country in the world to accept Bitcoin as an official currency. ** The Mexican Supreme Court rules to legalize abortion in Mexico. * September 8 - A prison fire in Tangerang, Indonesia kills 44 prisoners and injures 77 others. * September 10 ** Aziz Akhannouch is elected the Prime Minister of Morocco, beating incumbent Saadeddine Othmani. ** A new government is formed in Lebanon with Najib Mikati chosen as the new Prime Minister, replacing Hassan Diab. * September 11 - Tennis players Emma Raducanu of the United Kingdom and Daniil Medvedev of Russia win the US Open.Qualifier to champion: Britain’s Raducanu, 18, wins US Open * September 13 ** In Norway, the Labour Party led by Opposition Leader Jonas Gahr Støre wins the most seats in the Storting, beating the Conservative Party led by Prime Minister Erna Solberg. ** Prime Minister Ismail Sabri Yaakob and Opposition Leader Anwar Ibrahim sign a confidence and supply agreement ending a 18-month political crisis that has caused the fall of two governments in Malaysia. * September 14 ** North Korea shoots two short-range ballistic missiles that land just outside Japan's territorial waters; and then only hours later South Korea fires its first submarine-launched ballistic missile. ** The first season of the Europa Conference League begins.Watch: Declan Rice Dribbles From Own Half And Scores Stunning Solo Goal For West Ham * September 15 ** A trilateral security pact between Australia, the United Kingdom, and the United States is formed, to fight against China, allowing Australia to build its first nuclear-powered submarine. ** Several ministers of the Argentine President Alberto Fernández's cabinet resigns after the government's defeat in the primary elections, causing a political crisis in the country. * September 16 - SpaceX launches Inspiration4, making it the first all-civilian orbital spaceflight. * September 17 ** Abdelaziz Bouteflika, who was the 8th President of Algeria for twenty years and resigned after mass protests against his presidency in 2019, dies at aged 84.Former Algerian President Abdelaziz Bouteflika dies at 84 ** Philip \"Brave\" Davis is elected Prime Minister of the Bahamas after his party wins the most seats in the parliament, beating incumbent Hubert Minnis. * September 19 - The Cumbre Vieja located in the La Palma island of the Canary Islands erupts. * September 20 ** The Liberal Party of Canada won 155 seats in the federal election, re-electing Justin Trudeau as Prime Minister and allowing the party to form a minority government again. ** In Rwanda, Paul Rusesabagina is convicted on terrorism charges for the actions of his political party PDR-Ihumure. ** At least six people are killed when a gunman shot students at Perm State University in Russia. * September 21 ** The European Court of Human Rights rules that Russia was responsible for the poisoning of Alexander Litvinenko in 2006. ** Egyptian general Mohamed Hussein Tantawi, who led the country as Supreme Council of the Armed Forces after President Hosni Mubarak resigned, dies at aged 85. * September 23 - Scientists discover human footprints which are about 23,000 years old at White Sands National Park in the United States, making the idea that humans arrived in North America at least 10,000 years earlier than previously thought.Footprints in New Mexico are oldest evidence of humans in the Americas * September 24 - Two Canadian citizens are released from detention in China after Huawei executive Meng Wanzhou is released from house arrest in Canada. * September 25 - The Independence Party of Iceland led by Bjarni Benediktsson win the most seats in the Althing; however Prime Minister Katrín Jakobsdóttir is expected to govern a coalition. * September 26 - The Social Democratic Party (SDP) led by Olaf Scholz win the most seats in the Bundestag. * September 29 ** Former Minister for Foreign Affairs Fumio Kishida is elected to replace Yoshihide Suga as the 100th Prime Minister of Japan. ** Najla Bouden Romdhane is selected to become the Prime Minister of Tunisia by President Kais Saied; making her the first female prime minister in Tunisia and the Arab world. ** 116 inmates are killed during a prison riot in Guayaquil, Ecuador, the deadliest prison violence in the country's history. ===October=== * October 1 ** Coup military leader Mamady Doumbouya is sworn-in as the interim President of Guinea after removing Alpha Condé from power last month.Guinea swears in coup leader Mamady Doumbouya as interim president ** The 2020 World Expo in Dubai begins, as it was originally scheduled for 20 October 2020 but was delayed because of the COVID-19 pandemic. * October 3 – The International Consortium of Investigative Journalists and other media outlets publish a set of 11.9 million documents leaked from 14 financial services companies known as the Pandora Papers, revealing offshore financial activities that involve multiple current and former world leaders. * October 4 ** Armenian-American molecular biologist Ardem Patapoutian and American physiologist David Julius are awarded the Nobel Prize in Physiology or Medicine for their work on human receptors and molecular mechanisms of pain sensation and heat. ** Former Foreign Minister Fumio Kishida is officially voted by the National Diet as the 100th Prime Minister of Japan, replacing Yoshihide Suga. ** Facebook, Instagram and WhatsApp have become inaccessible because of a major outage. * October 5 ** Roscosmos launches the Soyuz MS-19 mission, carrying two Channel One Russia crewmembers to the International Space Station to make a movie. ** Japanese-American meteorologist Syukuro Manabe, German oceanographer Klaus Hasselmann and Italian physicist Giorgio Parisi are awarded the Nobel Prize in Physics for their works on modeling climate change patterns and its effects. * October 6 ** German chemist Benjamin List and Scottish-born chemist David MacMillan win the 2021 Nobel Prize in Chemistry for their work on the development of organocatalysis. ** The 2021 UEFA Nations League Finals is held in Italy as they were originally scheduled for June 2021, but were moved following the rescheduling of UEFA Euro 2020 to June and July 2021 due to the COVID-19 pandemic. ** Children across most of Africa are to be vaccinated against malaria, the first vaccine approved by the World Health Organization. * October 7 ** A 5.9 magnitude earthquake kills 20 people and injures over 300 others in Balochistan, Pakistan. ** Tanzanian-British novelist and refugee Abdulrazak Gurnah wins the 2021 Nobel Prize in Literature for his novels about colonialism and its impacts on refugees. * October 8 ** Filipino journalist Maria Ressa and Russian journalist Dmitry Muratov win the 2021 Nobel Peace Prize for their work on freedom of expression. ** A suicide bombing carried out by the Islamic State of Iraq and the Levant at a Shia mosque in Kunduz, Afghanistan kills over 100 people while injuring over 140 others. * October 9 ** Abolhassan Banisadr, the first democratically elected President of Iran following the Islamic Revolution, dies in Paris, France at aged 88. ** Czech Prime Minister Andrej Babiš wins 72 seats against his main opponent Petr Fiala's 71 seats in the Chamber of Deputies. ** Sebastian Kurz announces his resignation as Chancellor of Austria after a corruption investigation is opened against him. Alexander Schallenberg replaced Kurtz as chancellor on two days later. * October 11 - Canadian-American labour economist David Card, Israeli-American economist Joshua Angrist and Dutch-American economist Guido Imbens win the 2021 Nobel Memorial Prize in Economic Sciences. * October 13 ** Star Trek actor William Shatner becomes the oldest person to go into space, at age 90, on board a Blue Origin spacecraft. ** Five people are killed and two others are injured inside a supermarket after being attacked by bow and arrows in Kongsberg, Norway. * October 14 - A building fire in Kaohsiung, Taiwan, kills at least 46 people and injures 41 others.46 dead, 41 injured after Kaohsiung 'ghost building' fire * October 15 ** A suicide bombing by the Islamic State at a Shia mosque in Kandahar, Afghanistan kills 65 people and injures over 70 others. ** British Member of Parliament Sir David Amess is stabbed to death in Leigh-on-Sea, Essex, England, aged 69. * October 16 - The Lucy spacecraft is launched by NASA, the first mission to explore the Trojan asteroids. * October 17 - Former Prime Minister José Maria Neves is elected the 5th President of Cape Verde, beating former Prime Minister Carlos Veiga. * October 20 - Dame Sandra Mason is elected the 1st President of Barbados. * October 21 - Dame Cindy Kiro becomes the 22nd Governor-General of New Zealand, the first Māori woman to hold the position. * October 24 - Shavkat Mirziyoyev is re-elected President of Uzbekistan in a landslide victory, winning 80% of the vote. * October 25 - The Sudanese military launches a coup against the government with Prime Minister Abdalla Hamdok placed under house arrest and President Abdel Fattah al-Burhan taking power as head of state, declaring a state of emergency and dissolution of the government. * October 26 - Roh Tae- woo, South Korea's 6th President, first to be democratically elected in a post-military rule and was found guilty for treason, mutiny and corruption for his role in two coups, dies at aged 88.Roh Tae-woo, South Korean Leader During Move Toward Democracy, Dies at 88 * October 31 ** In Japan, the Liberal Democratic Party led by Prime Minister Fumio Kishida won the most seats in the House of Representatives. ** The COP26 Summit is held in Glasgow, Scotland where world leaders attempt to limit global warming temperatures to 1.5 °C (2.7 °F). ===November=== * November 1 - COVID-19 pandemic: The number of recorded deaths from COVID-19 passes 5 million. * November 2 ** Tennis player Peng Shuai accuses Senior Vice Premier of the People's Republic of China Zhang Gaoli of sexual harassment. She later is censored by the Chinese government and disappears. ** The Atlanta Braves beat the Houston Astros to win the World Series. * November 3 – COVID-19 pandemic: The World Health Organization gives emergency use listing to the Covaxin COVID-19 vaccine, the third non–Western vaccine to be authorized. * November 4 - South African playwright and novelist Damon Galgut wins the 2021 Booker Prize. * November 5 ** At least 99 people are killed and over 100 others injured in a fuel tanker explosion in Freetown, Sierra Leone. ** In the United States, nine people are crowd crushed to death with over 300 injured at a music festival in Houston, Texas. * November 7 ** Prime Minister of Iraq Mustafa Al-Kadhimi survives an assassination attempt in Baghdad when an explosive drone attacks his private home. ** Daniel Ortega is re-elected to a fourth term as President of Nicaragua, winning almost 76% of the vote. * November 10 - Cristina Peri Rossi of Uruguay wins the 2021 Miguel de Cervantes Prize. * November 11 ** F. W. de Klerk, the last apartheid-era President of South Africa and Nobel Peace Prize winner, dies at the age of 85. ** SpaceX launches a third mission, which carried four crewmembers to the International Space Station. * November 14 ** A car bombing using a taxi outside a women's hospital in Liverpool, England, kills the bomber and injures the driver. ** Rumen Radev is re-elected President of Bulgaria after winning 49% of the vote.New anti-corruption party breaks Bulgaria’s political deadlock; Rumen Radev set for second term as president * November 16 - Russia is criticized after doing an anti-satellite weapon test that creates a cloud of space debris, threatening the International Space Station. * November 19 - The longest partial lunar eclipse in 580 years occurs, visible in northern and western Europe, parts of Asia and the westernmost parts of Africa. * November 21 ** Abdalla Hamdok becomes Prime Minister of Sudan again after an agreement is made following a coup d'état that occurred the last month which removed Hamdok from office. ** In the United States, during a Christmas parade in Waukesha, Wisconsin an SUV broke through barricades and killed six people with over 40 others injured. * November 23 ** Chun Doo-hwan, South Korea's 5th President and military strongman for almost eight years, dies at aged 90. ** 45 North Macedonians are killed in a bus crash in Pernik Province, Bulgaria. * November 24 ** NASA successfully launches the Double Asteroid Redirection Test as a defense system against Near-Earth objects. ** 27 illegal immigrants are killed in the English Channel when an inflatable boat flips over. * November 25 ** Nicolae Ciucă is elected the 70th Prime Minister of Romania. ** Over 50 people are killed in a mining accident in Kemerovo Oblast, Russia. * November 26 - The World Health Organization officially recognizes the SARS-CoV-2 Omicron variant. * November 28 ** Former First Lady Xiomara Castro is elected the 62nd President of Honduras, becoming the country's first female president. ** Political scientist Petr Fiala becomes the 13th Prime Minister of the Czech Republic after defeating then-current Prime Minister Andrej Babiš.On Day 1, new Czech prime minister turns west * November 29 ** Magdalena Andersson is elected Sweden's first female Prime Minister by the Riksdag. ** Barbados officially becomes a republic with Sandra Mason becoming the country's first president.How will Barbados move on as the Queen is removed as head of state? ===December=== * December 1 - The farm protests in India end when the country repeal a controversial agricultural act.Farm laws: India PM Narendra Modi repeals controversial reforms * December 4 ** Mount Semeru erupts in East Java, Indonesia killing 46 people and injuring 104 others. ** Adama Barrow is re-elected President of the Gambia winning 53% of the vote.Gambia elections: Adama Barrow declared presidential election winner ** Fourteen civilians are killed by Indian Special Forces officials in a failed ambush in Nagaland, India.Nagaland: Indian state tense after killing of 14 civilians * December 6 ** The United States, Canada, the United Kingdom, and Australia announce a diplomatic boycott of the 2022 Winter Olympics in Beijing in response to China's human rights record. ** COVID-19 pandemic: The United States becomes the first country to pass 50 million COVID-19 cases.Omicron seems to cause milder illness, Fauci says, as study shows evasion of antibodies - The Washington Post ** Former State Counsellor of Myanmar and Nobel Peace Prize winner Aung San Suu Kyi is sentenced to prison on charges of causing dissent.Aung San Suu Kyi: Myanmar court sentences ousted leader in widely criticised trial ** Karl Nehammer is sworn-in as the Chancellor of Austria after Alexander Schallenberg resigned from the position on 2 December. * December 7 - A prison fire kills at least 38 inmates and injures over 69 others in Burundi.Burundi prison fire kills at least 38 in Gitega * December 8 ** Olaf Scholz replaces Angela Merkel as the Chancellor of Germany. ** Fourteen people are killed in a helicopter crash in Tamil Nadu, India, including General Bipin Rawat. * December 9 - At least 54 illegal immigrants are killed when the truck in which they are being smuggled crashes in Chiapas, Mexico.Mexico truck crash: At least 54 people killed as trailer overturns * December 10 - In the United States, a tornado outbreak in the country's Southern States and Ohio Valley regions kills at least 88 people.More than 70 killed in Kentucky's worst ever tornadoes * December 12 ** COVID-19 pandemic: Russia becomes the fifth country to pass 10 million COVID-19 cases after the United States, India, Brazil and the United Kingdom. ** New Caledonia rejects independence from France in a referendum vote by 96.5%.‘Tonight France is more beautiful’: Macron hails New Caledonia’s rejection of independence * December 13 - Kiril Petkov is elected the 56th Prime Minister of Bulgaria. * December 14 ** A fuel tanker explosion kills over 60 people and injured over 100 others in Cap-Haïtien, Haiti.Haiti fuel tanker blast kills dozens in Cap-Haïtien ** Floods in Malaysia kills at least 37 people. * December 15 - Siaosi Sovaleni is elected the 18th Prime Minister of Tonga, replacing Pohiva Tuʻiʻonetoa. * December 17 ** A building fire caused by a suspected arsonist in Osaka, Japan kills 25 people and injures three others. ** Typhoon Rai kills at least 200 people in the southern part of the Philippines and one person near Vietnam. * December 19 - Gabriel Boric is elected the 36th President of Chile, defeating José Antonio Kast in the run-off general election with a 55.87% to 44.13% margin.Gabriel Boric, a Former Student Activist, Is Elected Chile’s Youngest President * December 20 - At least 64 people are killed and 24 others are missing in a shipwreck off the northeast coast of Madagascar. * December 24 - At least 39 people are killed and over 70 others injured in a ferry fire in Jhalokati, Bangladesh. * December 25 - The James Webb Space Telescope, a replacement for the Hubble Space Telescope is launched. * December 26 - Nobel Peace Prize-winning South African archbishop and anti-apartheid activist Desmond Tutu dies at aged 90. * December 28 - In cricket, Australia wins The Ashes after winning the first three Tests against England. * December 29 ** The Supreme Court of Russia orders the closure of Memorial, Russia's oldest human rights group, for violations of the country's foreign agent law.Russian court shuts down Memorial Human Rights Center, day after sister group ordered closed ** Jeffrey Epstein's former associate, socialite Ghislaine Maxwell is found guilty of sex trafficking of a child and three counts of conspiracy for transporting minors for sexual activities.Jury finds Ghislaine Maxwell guilty of sex trafficking a minor for Jeffrey Epstein and four other charges ** Pro- democratic news website Stand News closes down after its staff are arrested by Hong Kong police officials for sedition. * December 31 - American actress and comedian Betty White dies at aged 99. == Births == * March 26 – Prince Julian, Duke of Halland * June 4 – Lilibet Mountbatten-Windsor == Deaths == === January === * January 1 – Dame Elmira Minita Gordon, 1st Governor-General of Belize (b. 1930) * January 2 ** Modibo Keita, 8th Prime Minister of Mali (b. 1942) ** Michael McKevitt, Irish republican paramilitary leader (b. 1949)Former Real IRA leader Michael McKevitt dies following illness Belfast Telegraph, 2021-01-02 * January 3 – Gerry Marsden, English musician (b. 1942) * January 4 ** Martinus J. G. Veltman, Dutch Nobel theoretical physicist (b. 1931) ** Albert Roux, French chef and restaurateur (b. 1935) * January 5 – Colin Bell, English footballer (b. 1946) * January 7 – Michael Apted, English filmmaker (b. 1941) * January 11 ** Sheldon Adelson, American businessman and casino magnate (b. 1933) ** Kathleen Heddle, Canadian Olympic rower (b. 1965) * January 13 – Siegfried Fischbacher, German-born American magician (b. 1939) * January 16 – Phil Spector, American record producer and convicted murderer (b. 1939) * January 18 – Jean-Pierre Bacri, Algerian-born French actor (b. 1951) * January 20 - Justin Lekhanya, Chairman of the Military Council of Lesotho (b. 1938) * January 23 – Hal Holbrook, American actor (b. 1925) * January 27 ** Cloris Leachman, American actress (b. 1926) ** Mehrdad Minavand, Iranian footballer and manager (b. 1975) * January 28 ** Paul J. Crutzen, Dutch Nobel atmospheric chemist (b. 1933) ** Vasily Lanovoy, Soviet and Russian actor (b. 1934) ** Cicely Tyson, American actress (b. 1924) * January 29 - Hilton Valentine, English guitarist (b. 1943) === February === * February 1 – Edward Babiuch, 5th Prime Minister of the Polish People's Republic (b. 1927) * February 2 – Fausta Morganti, Captain Regent of San Marino (b. 1944)Addio a Fausta Morganti, bandiera della sinistra sammarinese Corriereromagna.it * February 3 – Tony Trabert, American tennis player and commentator (b. 1930) * February 4 – Millie Hughes-Fulford, American astronaut and molecular biologist (b. 1945) * February 5 ** Christopher Plummer, Canadian actor (b. 1929) ** Leon Spinks, American professional boxer (b. 1953) * February 6 – George Shultz, American politician, diplomat and economist (b. 1920) * February 7 – Giuseppe Rotunno, Italian cinematographer (b. 1923) * February 8 ** Jean-Claude Carrière, French novelist and screenwriter (b. 1931) ** Mary Wilson, American singer (b. 1944) * February 9 – Chick Corea, American jazz keyboardist (b. 1941) * February 11 – Isadore Singer, American mathematician (b. 1924) * February 12 – Milford Graves, American jazz drummer, percussionist, and free jazz pioneer (b. 1941) * February 13 – Yury Vlasov, Soviet and Russian weightlifter and writer (b. 1935) * February 14 – Carlos Menem, 44th President of Argentina (b. 1930) * February 15 – Leopoldo Luque, Argentine footballer (b. 1949) * February 16 ** Bernard Lown, Lithuanian- American Nobel cardiologist and inventor (b. 1921) ** Joan Margarit, Spanish poet (b. 1938) ** Gustavo Noboa, 42nd President of Ecuador (b. 1937) * February 17 – Rush Limbaugh, American radio personality (b. 1951) * February 18 – Andrey Myagkov, Soviet and Russian actor (b. 1938) * February 19 – Đorđe Balašević, Serbian recording artist and singer-songwriter (b. 1953) * February 21 – Zlatko Saračević, Croatian handball player and coach (b. 1961) * February 22 – Lawrence Ferlinghetti, American poet and publisher (b. 1919) * February 23 – Fausto Gresini, Italian motorcycle racer and team manager (b. 1961)Il team annuncia: Fausto Gresini ci ha lasciato, Gazzetta dello Sport * February 24 ** Philippe Jaccottet, Swiss poet and translator (b. 1925) ** N'Singa Udjuu, First State Commissioner of Zaire (b. 1934) * February 25 ** Hannu Mikkola, Finnish rally driver (b. 1942) ** Sir Michael Somare, 1st Prime Minister of Papua New Guinea (b. 1936) === March === * March 1 ** Zlatko Kranjčar, Croatian football player and manager (b. 1956) ** Ian St John, Scottish footballer (b. 1938) * March 2 ** Chris Barber, English jazz musician (b. 1930) ** Bunny Wailer, Jamaican reggae singer and songwriter (b. 1947) * March 6 – Lou Ottens, Dutch inventor (b. 1926) * March 9 ** James Levine, American conductor and pianist (b. 1943) ** John Polkinghorne, English theoretical physicist and Anglican priest (b. 1930) * March 10 ** Hamed Bakayoko, 11th Prime Minister of Ivory Coast (b. 1965) ** Ali Mahdi Muhammad, 4th President of Somalia (b. 1939) ** Manuel Saturnino da Costa, 6th Prime Minister of Guinea-Bissau (b. 1942) * March 12 – Goodwill Zwelithini, king of the Zulu nation (b. 1948) * March 13 ** Marvelous Marvin Hagler, American boxer (b. 1954) ** Murray Walker, British motor racing commentator (b. 1923) * March 16 ** Moudud Ahmed, 7th Prime Minister of Bangladesh (b. 1940) ** Sabine Schmitz, German motor racer and television presenter (b. 1969) * March 17 – John Magufuli, 5th President of Tanzania (b. 1959) * March 20 – Peter Lorimer, Scottish international footballer (b. 1946) * March 21 ** Nawal El Saadawi, Egyptian feminist writer (b. 1931) ** Adam Zagajewski, Polish poet, essayist and translator (b. 1945) * March 22 – Johnny Dumfries, Scottish peer and racing driver (b. 1958) * March 23 – George Segal, American actor (b. 1934) * March 24 – Jessica Walter, American actress (b. 1941) * March 25 ** Beverly Cleary, American author (b. 1916) ** Larry McMurtry, American author (b. 1936) ** Bertrand Tavernier, French film director and actor (b. 1941) * March 28 – Didier Ratsiraka, 3rd President of Madagascar (b. 1936) * March 29 – Bashkim Fino, 29th Prime Minister of Albania (b. 1962) * March 31 – Kamal Ganzouri, 46th Prime Minister of Egypt (b. 1933) === April === * April 1 – Isamu Akasaki, Japanese Nobel physicist (b. 1929) * April 2 – Christian Tumi, Cameroonian cardinal (b. 1930) * April 4 – Robert Mundell, Canadian Nobel economist (b. 1932) * April 5 – Marshall Sahlins, American anthropologist (b. 1930) * April 6 – Hans Küng, Swiss Catholic priest, theologian and author (b. 1928) * April 9 ** DMX, American rapper, songwriter and actor (b. 1970) ** Prince Philip, Duke of Edinburgh (b. 1921) * April 14 ** Yıldırım Akbulut, 20th Prime Minister of Turkey (b. 1935) ** Bernie Madoff, American investment advisor, financier and convicted fraudster (b. 1938) * April 16 ** Charles Geschke, American businessman and computer scientist (b. 1939) ** Andrew Peacock, Australian politician (b. 1939) * April 19 ** Walter Mondale, 42nd Vice President of the United States (b. 1928) ** Jim Steinman, American rock lyricist and composer (b. 1947) ** Willy van der Kuijlen, Dutch footballer (b. 1946)PSV-icoon Willy van der Kuijlen (74) overleden - AD * April 20 – Idriss Déby, 6th President of Chad (b. 1952) * April 23 – Milva, Italian singer and actress (b. 1939) * April 24 – Christa Ludwig, German mezzo-soprano (b. 1928) * April 26 – Tamara Press, Soviet Olympic shot put and discus thrower (b. 1937) * April 28 ** Michael Collins, American astronaut (b. 1930) ** Federico Salas, 136th Prime Minister of Peru (b. 1950) === May === * May 1 – Olympia Dukakis, American actress (b. 1931) * May 3 – Lloyd Price, American singer- songwriter and businessman (b. 1933) * May 4 – Simon Achidi Achu, 6th Prime Minister of Cameroon (b. 1934) * May 6 ** Humberto Maturana, Chilean philosopher and biologist (b. 1928) ** Kentaro Miura, Japanese manga artist (b. 1966) * May 7 – Martín Pando, Argentine footballer (b. 1934) * May 8 ** Lee Han-dong, 33rd Prime Minister of South Korea (b. 1934) ** Helmut Jahn, German-born American architect (b. 1940) ** Spencer Silver, American chemist and inventor (b. 1941) * May 9 – José Manuel Caballero Bonald, Spanish poet and novelist (b. 1926) * May 10 – Svante Thuresson, Swedish jazz musician (b. 1937) * May 11 – Norman Lloyd, American actor, producer and director (b. 1914) * May 15 ** Đorđe Marjanović, Serbian pop rock singer (b. 1931) ** Eva Wilma, Brazilian actress (b. 1933) * May 16 – Rildo da Costa Menezes, Brazilian footballer (b. 1942) * May 18 ** Franco Battiato, Italian singer-songwriter, composer and filmmaker (b. 1946)È morto Franco Battiato, la Repubblica ** Charles Grodin, American actor and comedian (b. 1935) * May 19 – Lee Evans, American Olympic athlete (b. 1947) * May 20 ** Francisco Brines, Spanish poet (b. 1932) ** Abubakar Shekau, Nigerian Islamic leader and militant (b. 1965, 1969 or 1975) * May 21 ** Tahir Salahov, Soviet, Azerbaijani and Russian painter and draughtsman (b. 1928) ** Sunderlal Bahuguna, Indian environmentalist (b. 1927) * May 22 ** Francesc Arnau, Spanish footballer (b. 1975) ** Robert Marchand, French racing cyclist (b. 1911) ** Yuan Longping, Chinese agronomist (b. 1930) ** André Ribeiro, Brazilian racing driver (b. 1966) * May 23 ** Eric Carle, American children's writer and illustrator (b. 1929) ** Cristóbal Halffter, Spanish classical composer and conductor (b. 1930) ** Ron Hill, English marathon runner (b. 1938) ** Paulo Mendes da Rocha, Brazilian architect (b. 1928) ** Max Mosley, British racing driver and lawyer (b. 1940) * May 26 – Tarcisio Burgnich, Italian footballer and manager (b. 1939) * May 27 ** Carla Fracci, Italian ballet dancer and actress (b. 1936) ** Cornelis de Jager, Dutch astronomer (b. 1921) ** Poul Schlüter, 22nd Prime Minister of Denmark (b. 1929) * May 30 – Rick Mitchell, Australian sprinter (b. 1955) === June === * June 1 – Prince Amedeo, Duke of Aosta (b. 1943) * June 3 – Sir Anerood Jugnauth, 2nd Prime Minister and 4th President of Mauritius (b. 1930)Mauritius former prime minister Sir Anerood Jugnauth dies aged 91 * June 4 ** Richard R. Ernst, Swiss Nobel chemist (b. 1933) ** Friederike Mayröcker, Austrian poet (b. 1924) * June 5 – T. B. Joshua, Nigerian televangelist (b. 1963) * June 6 ** Revaz Gabriadze, Georgian filmmaker, painter and playwright (b. 1936) ** Ei-ichi Negishi, Japanese Nobel chemist (b. 1935) ** Mansour Ojjeh, French Saudi Arabian entrepreneur (b. 1952) * June 7 ** Yoo Sang-chul, South Korean footballer (b. 1971) ** Ali Akbar Mohtashamipur, Iranian Shia cleric and terrorist (b. 1947) * June 9 ** Gottfried Böhm, German architect and sculptor (b. 1920) ** Edward de Bono, Maltese physician, psychologist and philosopher (b. 1933) * June 10 – Buddhadeb Dasgupta, Indian director and poet (b. 1944) * June 11 – Paola Pigni, Italian middle-distance runner (b. 1945) * June 13 – Ned Beatty, American actor (b. 1937) * June 14 ** Enrique Bolaños, 29th President of Nicaragua (b. 1928) ** Markis Kido, Indonesian badminton player (b. 1984) * June 15 – Vladimir Shatalov, Soviet and Russian cosmonaut (b. 1927) * June 17 – Kenneth Kaunda, 1st President of Zambia (b. 1924) * June 18 ** Giampiero Boniperti, Italian footballer (b. 1928) ** Milkha Singh, Indian athlete (b. 1929) * June 20 – Luis del Sol, Spanish footballer (b. 1935) * June 23 – John McAfee, English-born American computer programmer and businessman (b. 1945) * June 24 ** Benigno Aquino III, 15th President of the Philippines (b. 1960) ** Trần Thiện Khiêm, 7th Prime Minister of South Vietnam and army officer (b. 1925) * June 26 – Mir Hazar Khan Khoso, Acting Prime Minister of Pakistan (b. 1929) * June 29 – Donald Rumsfeld, American politician and government official (b. 1932) * June 30 – Bonfoh Abass, Acting President of Togo (b. 1948) === July === * July 1 – Louis Andriessen, Dutch composer (b. 1939) * July 2 – Nikolai Slichenko, Soviet and Russian singer and actor (b. 1934) * July 4 – Richard Lewontin, American evolutionary biologist (b. 1929) * July 5 ** Raffaella Carrà, Italian singer, TV presenter and actress (b. 1943) ** Richard Donner, American film director (b. 1930)Hipes, Patrick (July 5, 2021), \"Richard Donner Dies: 'Superman', 'Lethal Weapon' And 'The Goonies' Director Was 91\", Deadline. ** Vladimir Menshov, Soviet and Russian actor and film director (b. 1939) * July 6 ** Djivan Gasparyan, Armenian musician and composer (b. 1928)Ghazanchyan, Siranush (6 July 2021),\"Legendary Armenian duduk player Jivan Gasparayn dies aged 92\", Public Radio of Armenia. ** Patrick John, 1st Prime Minister of Dominica (b. 1938) * July 7 ** Ahmed Jibril, Palestinian militant (b. 1938) ** Dilip Kumar, Indian actor, film producer and philanthropist (b. 1922) ** Jovenel Moïse, 42nd President of Haiti (b. 1968) ** Carlos Reutemann, Argentine Formula One driver and politician (b. 1942) * July 9 ** Frank Lui, 3rd Premier of Niue (b. 1935) ** Paul Mariner, English football player and manager (b. 1953) * July 10 – Esther Béjarano, German singer and Holocaust survivor (b. 1924)\"Holocaust survivor, singer Esther Bejarano dies, aged 96\", DW. * July 13 – Shirley Fry, American tennis player (b. 1927)\"Tennis Hall of Famer Shirley Fry Irvin dies at 94\", AP, July 14, 2021. * July 14 ** Mamnoon Hussain, 12th President of Pakistan (b. 1940)\"Former president Mamnoon Hussain passes away in Karachi\", Geo News, 14 July 2021. ** Kurt Westergaard, Danish cartoonist (b. 1935) * July 16 – Surekha Sikri, Indian actress (b. 1945) * July 17 – Pilar Bardem, Spanish actress and activist (b. 1939) * July 19 – Arturo Armando Molina, 36th President of El Salvador (b. 1927)\"Fallece expresidente salvadoreño Arturo Armando Molina, a los 93 años\", July 19, 2021 . * July 22 – Boris Chochiev, Acting Prime Minister of South Ossetia (b. 1957) * July 23 ** Toshihide Maskawa, Japanese Nobel theoretical physicist (b. 1940) ** Steven Weinberg, American Nobel theoretical physicist (b. 1933) * July 25 – Otelo Saraiva de Carvalho, Portuguese military official and politician (b. 1936) * July 26 ** Albert Bandura, Canadian-American psychologist (b. 1925) ** Joey Jordison, American drummer (b. 1975) ** Ivan Toplak, Serbian footballer and manager (b. 1931) * July 28 ** Roberto Calasso, Italian writer and publisher (b. 1941) ** Dusty Hill, American musician and singer-songwriter (b. 1949) ** Shahrum Kashani, Iranian-American singer (b. 1974) ===August=== * August 1 – Abdalqadir as-Sufi, Scottish Islamic scholar and writer (b. 1930) * August 3 – Arthur Dion Hanna, 7th Governor-General of the Bahamas (b. 1928) * August 5 – Yevhen Marchuk, 4th Prime Minister of Ukraine (b. 1941) * August 8 – Jaan Kaplinski, Estonian poet and philosopher (b. 1941) * August 9 ** Sir Lester Bird, 2nd Prime Minister of Antigua and Barbuda (b. 1938) ** Sergei Kovalev, Russian human rights activist (b. 1930) * August 10 – Eduardo Martínez Somalo, Spanish cardinal (b. 1927) * August 13 ** Carolyn S. Shoemaker, American astronomer (b. 1929) ** Gino Strada, Italian surgeon and human rights activist (b. 1948)Obituary: Gino Strada believed health care was a human right, The Economist * August 14 – Carlos Correia, 5th Prime Minister of Guinea-Bissau (b. 1933) * August 15 ** Abdelhamid Brahimi, 3rd Prime Minister of Algeria (b. 1936) ** Gerd Müller, German footballer (b. 1945) * August 16 – Volodymyr Holubnychy, Soviet and Ukrainian race walker and Olympic champion (b. 1936) * August 17 – Adnan Abu Walid al-Sahrawi, leader of the Islamic State in the Greater Sahara (b. 1973) * August 18 – Jill Murphy, British author and illustrator (b. 1949) * August 19 – Sonny Chiba, Japanese actor and martial artist (b. 1939) * August 21 ** Don Everly, American musician (b. 1937) ** Marie, Princess of Liechtenstein (b. 1940) * August 23 ** Jean-Luc Nancy, French philosopher (b. 1940) ** Rosita Quintana, Argentine-Mexican actress, singer, and songwriter (b. 1925) * August 24 ** Hissène Habré, 1st Prime Minister and 5th President of Chad (b. 1942) ** Wilfried Van Moer, Belgian footballer (b. 1945) ** Charlie Watts, English drummer (b. 1941) * August 25 – Mohsin Ahmad al-Aini, 7th Prime Minister of Yemen (b. 1932) * August 27 – Edmond H. Fischer, American-Swiss Nobel biochemist (b. 1920) * August 29 ** Ed Asner, American actor (b. 1929) ** Lee \"Scratch\" Perry, Jamaican record producer and singer (b. 1936) ** Jacques Rogge, Belgian Olympic sailor and 8th President of the International Olympic Committee (b. 1942) * August 31 – Francesco Morini, Italian footballer (b. 1944) === September === * September 1 – Syed Ali Shah Geelani, Kashmiri separatist leader (b. 1929) * September 2 – Mikis Theodorakis, Greek composer and politician (b. 1925) * September 5 ** Ivan Patzaichin, Romanian Olympic canoeist (b. 1949) ** Živko Radišić, 2nd Chairman of the Presidency of Bosnia and Herzegovina (b. 1937) * September 6 – Jean-Paul Belmondo, French actor (b. 1933) * September 8 – Dietmar Lorenz, German Olympic judoka (b. 1950) * September 9 – Danilo Popivoda, Slovenian footballer and manager (b. 1947) * September 10 ** Charles Konan Banny, 6th Prime Minister of the Ivory Coast (b. 1942) ** Jorge Sampaio, 18th President of Portugal (b. 1939) ** Saadi Yacef, Algerian independence fighter, politician and actor (b. 1928) * September 11 – Abimael Guzmán, Peruvian Terrorist Maoist leader and militant (b. 1934) * September 13 ** Antony Hewish, English Nobel radio astronomer (b. 1924) ** Borisav Jović, 12th President of the Presidency of Yugoslavia (b. 1928) * September 14 ** Norm Macdonald, Canadian comedian, actor, and screenwriter (b. 1959) ** Yuriy Sedykh, Soviet and Russian track and field athlete and Olympic champion (b. 1955) * September 16 ** Silas Atopare, 7th Governor-General of Papua New Guinea (b. 1951) ** Casimir Oyé-Mba, 3rd Prime Minister of Gabon (b. 1942) ** Sir Clive Sinclair, English entrepreneur and inventor (b. 1940) * September 17 ** Abdelaziz Bouteflika, 7th President of Algeria (b. 1937) ** Mario Camus, Spanish film director and screenwriter (b. 1935) * September 19 ** Sylvano Bussotti, Italian composer, poet and theatre director (b. 1931) ** Jimmy Greaves, English footballer (b. 1940) * September 21 – Mohamed Hussein Tantawi, Egyptian field marshal, Chairman of the Supreme Council of the Armed Forces (b. 1935) * September 22 ** Abdelkader Bensalah, Acting Head of State of Algeria (b. 1941) ** Orlando Martínez, Cuban boxer and Olympic champion (b. 1944) * September 25 – Théoneste Bagosora, Rwandan military officer and convicted war criminal (b. 1941) * September 27 – Roger Hunt, English footballer (b. 1938) * September 30 – Koichi Sugiyama, Japanese composer, conductor, and orchestrator (b. 1931) === October === * October 2 – Umer Shareef, Pakistani director, producer and artist (b. 1960) * October 3 ** Jorge Medina, Chilean cardinal (b. 1926) ** Budge Patty, American tennis player (b. 1924) ** Lars Vilks, Swedish visual artist (b. 1946) * October 9 – Abolhassan Banisadr, 1st President of Iran (b. 1933) * October 10 – Abdul Qadeer Khan, Pakistani nuclear physicist and engineer (b. 1936) * October 14 – Lee Wan-koo, 39th Prime Minister of South Korea (b. 1950) * October 17 – Ahmad Shah Ahmadzai, Acting Prime Minister of Afghanistan (b. 1944) * October 18 ** Edita Gruberová, Slovak soprano (b. 1946) ** János Kornai, Hungarian economist (b. 1928) ** Colin Powell, American politician, diplomat and general (b. 1937) * October 19 – Leslie Bricusse, British composer, lyricist and playwright (b. 1931) * October 20 – Mihaly Csikszentmihalyi, Hungarian-American psychologist and academic (b. 1934) * October 21 – Bernard Haitink, Dutch conductor and violinist (b. 1929) * October 22 – Vyacheslav Vedenin, Soviet and Russian cross-country skier and Olympic champion (b. 1941) * October 26 ** Walter Smith, Scottish footballer and manager (b. 1948) ** Roh Tae-woo, 6th President of South Korea (b. 1932) * October 29 ** Clément Mouamba, 16th Prime Minister of the Republic of Congo (b. 1943) ** Puneeth Rajkumar, Indian actor, playback singer and producer (b. 1975) * October 30 – Igor Kirillov, Soviet and Russian news presenter, announcer and actor (b. 1932) * October 31 – Dame Catherine Tizard, 16th Governor-General of New Zealand (b. 1931) === November === * November 1 ** Aaron T. Beck, American psychiatrist (b. 1921) ** Nelson Freire, Brazilian pianist (b. 1944) * November 6 ** Cissé Mariam Kaïdama Sidibé, 12th Prime Minister of Mali (b. 1948) ** Yukhym Zvyahilsky, Acting Prime Minister of Ukraine (b. 1933) * November 7 – Dean Stockwell, American actor (b. 1936) * November 11 ** F. W. de Klerk, 7th and last State President of South Africa and Nobel laureate (b. 1936) ** Graeme Edge, English drummer, songwriter and poet (b. 1941) * November 12 ** Bob Bondurant, American racing driver (b. 1933) ** Matthew Festing, 79th Prince and Grand Master of the Sovereign Military Order of Malta (b. 1949) ** Ron Flowers, English footballer (b. 1934) * November 13 – Wilbur Smith, Zambian-born South African novelist (b. 1933) * November 14 – Bertie Auld, Scottish footballer (b. 1938) * November 15 – László Z. Bitó, Hungarian physiologist and writer (b. 1934) * November 23 ** Chun Doo-hwan, 5th President of South Korea (b. 1931) ** Sir James Fitz-Allen Mitchell, 2nd Prime Minister of Saint Vincent and the Grenadines (b. 1931) * November 26 – Stephen Sondheim, American composer and lyricist (b. 1930) * November 28 ** Virgil Abloh, American fashion designer and entrepreneur (b. 1980) ** Alexander Gradsky, Soviet and Russian singer, songwriter and rock musician (b. 1949) ** Norodom Ranariddh, 31st Prime Minister of Cambodia (b. 1944) ** Sir Frank Williams, English businessman, Formula One team owner and mechanic (b. 1942) * November 29 – Kinza Clodumar, 7th President of Nauru (b. 1945) * November 30 – Ray Kennedy, English footballer (b. 1951) === December === thumb|100px|Vicente Fernández * December 3 ** Lamine Diack, Senegalese businessman, sports administrator and athlete (b. 1933) ** Horst Eckel, German footballer (b. 1932) * December 5 – Jacques Tits, Belgian-born French mathematician (b. 1930) * December 6 – Kåre Willoch, 30th Prime Minister of Norway (b. 1928) * December 7 – Mustafa Ben Halim, 3rd Prime Minister of Libya (b. 1921) * December 8 – Robbie Shakespeare, Jamaican musician (b. 1953) * December 9 ** Otar Patsatsia, 3rd Prime Minister of Georgia (b. 1929) ** Carmen Salinas, Mexican actress and politician (b. 1939) ** Lina Wertmüller, Italian film director and screenwriter (b. 1928) * December 10 – Michael Nesmith, American musician and television personality (b. 1942) * December 11 ** Anne Rice, American author (b. 1941) ** Manuel Santana, Spanish tennis player (b. 1938) * December 12 ** Sir Paulias Matane, 8th Governor-General of Papua New Guinea (b. 1931) ** Vicente Fernández, Mexican singer and actor (b. 1940) * December 13 – Verónica Forqué, Spanish actress (b. 1955) * December 15 – Fayez Tarawneh, 31st Prime Minister of Jordan (b. 1949) * December 18 – Lord Richard Rogers, Italian–born British architect (b. 1933) * December 19 – Robert H. Grubbs, American Nobel chemist (b. 1942) * December 21 – Sir Carlyle Glean, 5th Governor-General of Grenada (b. 1932) * December 23 – Joan Didion, American writer (b. 1934) * December 25 ** Wayne Thiebaud, American painter (b. 1920) ** Jean-Marc Vallée, Canadian filmmaker and screenwriter (b. 1963) * December 26 ** Karolos Papoulias, 6th President of Greece (b. 1929) ** Desmond Tutu, South African Anglican archbishop, activist and Nobel laureate (b. 1931) ** E. O. Wilson, American biologist and writer (b. 1929) * December 31 – Betty White, American actress (b. 1922) ==Nobel Prizes== * Chemistry – David MacMillan and Benjamin List * Economics – David Card, Joshua Angrist and Guido Imbens * Literature – Abdulrazak Gurnah * Peace – Maria Ressa and Dmitry Muratov * Physiology or Medicine – Ardem Patapoutian and David Julius * Physics – Klaus Hasselmann, Syukuro Manabe and Giorgio Parisi ==Related pages== * 2021 in association football == References ==",
 "title": "2021"
}