{
 "id": "188972",
 "text": "The National Health Service is a government run health care organisation that provides health and medical services to citizens and residents of the United Kingdom. It was started in 1948 and intended by its creators to be \"free at the point of service\". This meant that people who use the NHS would not be required to pay for services each time they used them. == History == National Insurance started in 1912, and the workers who paid their National Insurance could visit a General practitioner and get medicine they were prescribed without paying. But this did not include their families. There was free healthcare for schoolchildren from local government and for the poor through the Poor Law. People could join a Friendly Society, which gave them a sort of health insurance which often paid for spectacles and dentistry. == Costs == The NHS is paid for out of employee contributions - National Insurance - from their wages and also from general government money raised in the form of taxes. The promise of a health service that would be free at the point of service was broken in 1952 with the start of prescription charges. When the NHS started it turned out to be a lot more expensive (about £179 million in 1947) than expected. In 1948 it had gone up to £305 million a year. In 1956 the Guillebaud Report - Enquiry into the Cost of the National Health Service - reported that the costs as a % of GDP had actually gone down. Since 1947 there have been a lot of new valuable but expensive drugs invented. The cost for a year rose from £35 billion in 1980 to £164 billion (in 2021-22 prices). There is widespread agreement that the budget needs to increase about 4% a year to keep up with the cost of new treatment, longer lives and larger population. ==Systems== The NHS is made up of four systems: NHS England, Health and Social Care (Northern Ireland), NHS Scotland and NHS Wales. Each system is run by its government. NHS England is run by the Department of Health and Social Care. The systems are run in different ways in each country within the United Kingdom. For instance, there are no charges for prescriptions in Scotland or Wales, but there are in England. It is said to be \"the most reorganised health system in western Europe\". ==Services== The service provides dental services and prescription eyeglasses, hearing aids, prosthetic limbs and other services. There are charges at the point of service for these services unless one lives in a no-charge country. Children (aged up to 18, or up to 21 if you are a student), pregnant women or the elderly do not pay for most of these. The NHS Low Income Scheme is to help poor people. == Staffing == There were 1,376,190 people working in the NHS in England in May 2022. From April to June 2022 almost 35,000 left their jobs. It was short of about 133,400 full-time workers in September 2022. In 2021-22 more than £2.5 billion was spent on temporary workers. In 2023 it was the 8th biggest employer in the world. ==Problems== Since 2010 the money the Conservative government has put into the NHS has not been enough to keep up with demand. On 29 September 2013 around 50,000 people protested in Manchester. They set up a stage with banners saying things like 'Save Our NHS' around it. NHS hospitals can now earn up to 50% of their income from private work. The number of people waiting a long time for tests or operations has gone up, so more people are paying for them to be done privately. The 2019 Conservative election campaign included the New Hospitals Programme, a pledge to build 48 new hospitals. By 2023 only 2 had been finished. It wasnt clear exactly they meant by new hospitals. Some were repairs or extra bits on old hospitals. Many hospitals need repair or rebuilding. some have had ceilings collapse and no work could be done while they were repaired. ==Access== The NHS has been criticized for working through a 'postcode lottery', meaning that access to quality treatment depends on where you live. The percentage of diabetics getting the recommended levels of care ranged from 6% to 69% depending on where they lived in 2012. The National Institute for Health and Care Excellence was set up to make judgements about which treatments should be paid for. There have been particular difficulties in mental health services for many years. Under the Equality Act 2010 health services should make reasonable adjustments to ensure that people with severe mental illness are not disadvantaged compared with the general population. In reality money for mental health services has never been enough to provide services at the same level. There is supposed to be parity of esteem - that is equality, between mental and physical services. In 2023 there were still large numbers of out of area placements - that is people sent to mental hospitals a very long way from home, often for months at a time, something that very rarely happens with other services. ==References==",
 "title": "National Health Service"
}