{
 "id": "189004",
 "text": "2025(MMXXV) is a common year starting on Wednesday in the Gregorian calendar, the 2025th year of the Common Era (CE) and Anno Domini (AD) designations, . It is the current year. == Events == === January === * January 1 ** Poland takes over the Presidency of the Council of the European Union after Hungary. ** Bulgaria and Romania join the Schengen Area, lifting land border controls. ** Liechtenstein becomes the 39th country to legalize same-sex marriage. ** Ukraine halts the transportation of Russian gas supplies through the country, following the expiration of a five-year transit deal, while also becoming a state party in the International Criminal Court the same day. ** In the United States, fifteen people are killed, including the perpetrator, and over 35 others are injured during a vehicle-ramming and shooting attack in New Orleans, Louisiana. ** Thirteen people are killed and four more injured in multiple shootings in Cetinje, Montenegro. * January 4 – Austrian Chancellor Karl Nehammer announces his resignation. * January 6 ** Indonesia is officially made a full member state of BRICS. ** Prime Minister of Canada Justin Trudeau announces his resignation as Leader of the Liberal Party. * January 7 ** A 7.1 magnitude earthquake strikes Tibet Autonomous Region of Southwest China. Killing at least 95 people, whilst another 130 are injured. ** A series of wildfires erupt in Southern California, forcing more than 30,000 people to evacuate and kills five people. * January 8 – An attack on the presidential palace by Boko Haram in N'Djamena, Chad kills 20 people. * January 9 – General Joseph Aoun is elected President of Lebanon by the country's parliament, following a two-year vacancy of the presidency. * January 10 **Incumbent Venezulan President Nicolás Maduro is sworn in for a third term amid an ongoing crisis after the disputed elections in the country. **The European Copernicus Climate Change Service reports that 2024 was the world's hottest year on record, and the first calendar year to pass the symbolic threshold of 1.5°C of global warming. *January 12 – President of Croatia Zoran Milanović is re-elected to a second term. * January 13 – President of the International Court of Justice Nawaf Salam is nominated by the Parliament of Lebanon to become prime minister. *January 14 – The 2025 World Men's Handball Championship begins in Croatia, Denmark and Norway. *January 15 ** President of South Korea Yoon Suk Yeol is arrested for his role in the 2024 martial law crisis. ** Israel and Hamas agree to a three-phase ceasefire proposal to end their 15 months of conflict. ** American filmmaker and actor David Lynch dies at the age of 78. * January 16 ** A series of attacks by the National Liberation Army in Colombia leaves more than 80 people dead. ** Rosen Zhelyazkov is confirmed as the Prime Minister of Bulgaria by the National Assembly. ** Blue Origin successfully launches its heavy-lift launch vehicle, New Glenn, on its first attempt. * January 17 – Minister of State of Monaco Didier Guillaume dies in Nice, France at the age of 65 and Isabelle Berro-Amadeï is appointed as the acting Minister of State. * January 18 ** Two Sharia judges are assassinated and two other people are injured in a mass shooting at the Supreme Court of Iran in capital Tehran. ** Ninety-eight people are killed in a fuel tanker explosion near Suleja, Nigeria. * January 19 ** A ban on TikTok in the United States goes into effect, however it was quickly reversed within 24 hours. ** A ceasefire between Israel and Hamas goes into effect. * January 20 – Donald Trump is sworn in as the 47th President of the United States, becoming the second president in American history to serve non-consecutive terms. * January 21 ** Seventy-eight people are killed after a fire breaks out in a hotel ski resort in Bolu Province, Turkey. ** Former President of El Salvador Mauricio Funes, who was convicted of tax evasion and corruption, dies while in exile in Nicaragua at the age of 65. * January 22 ** The first recorded blizzard in the Gulf Coast of the United States results in at least thirteen deaths and more than $14 billion in damage. ** Thailand becomes the 40th country to legalize same-sex marriage. * January 23 – For the second time, Micheál Martin is elected Taoiseach of Ireland. * January 24 – Storm Éowyn hits Ireland and the United Kingdom. Record high wind speeds of are recorded in Ireland, while over a million homes are left without power. * January 25 ** Several artifacts are stolen from the Drents Museum in Assen, Netherlands, including the Helmet of Coțofenești. ** The March 23 Movement captures Goma in the Democratic Republic of the Congo. * January 26 – Alexander Lukashenko is re-elected as President of Belarus, after banning opposition candidates. * January 28 – Miloš Vučević resigns as Prime Minister of Serbia after an anti-corruption protests over the Novi Sad railway station canopy collapse. * January 29 ** Ahmed al-Sharaa is appointed as the 20th President of Syria of the transitional government, nearly two months after the Fall of the Assad regime. ** A helicopter collides with an American Eagle jet over the Potomac River in Washington, D.C., United States, killing all 67 people onboard both the helicopter and the jet. ** A Beechcraft 1900 crashes in South Sudan, killing 20 of the 21 people onboard. *January 30 – Following the approval of a constitutional reform, Nicaragua becomes a diarchy with Daniel Ortega and Rosario Murillo as co-presidents.Nicaragua's Ortega expands power as reforms win final approval * January 31 – A Learjet 55 crashes into multiple buildings and houses in Philadelphia, Pennsylvania, United States, killing at least seven people and injuring over 19 others. ===February=== * February 1 – Horst Köhler, former President of Germany and director of the International Monetary Fund, dies in Berlin at the age of 81. * February 3 – Antwerp Mayor Bart De Wever is appointed the Prime Minister of Belgium, replacing Alexander De Croo. * February 4 ** The United States imposes a 10% tariff on all Chinese imports with China responding to retaliatory tariffs. ** Aga Khan IV, the 49th Imam of Nizari Ismaili, dies in Lisbon, Portugal at the age of 88. His son, Aga Khan V, replaces him as the 50th Imam. ** At least 11 people are killed in a mass shooting at an adult education centre in Örebro, Sweden. * February 8 – Sam Nujoma, the 1st President of Namibia, dies in Windhoek at the age of 95. * February 9 ** In American football, the Philadelphia Eagles defeat the Kansas City Chiefs to win the Super Bowl. ** In the first round of voting of the Ecuadorian general election, incumbent President Daniel Noboa advances to the run-off, facing former National Assembly member and 2023 presidential runner-up Luisa González. ** Brigitte Haas is elected the first female Prime Minister of Liechtenstein. * February 10 – A bus falls off a bridge over a river in Guatemala City, Guatemala, killing at least 56 people and injuring several others more. * February 12 ** President of Romania Klaus Iohannis resigns with Senate President Ilie Bolojan becoming acting president. ** Former Parliament Speaker Konstantinos Tasoulas is elected President of Greece by the Hellenic Parliament in the fourth and final round of voting. * February 13 – A car rams into a crowd at a trade union protest in Munich, Germany resulting in 28 people being injured. * February 15 – Djibouti Foreign Affairs Minister Mahamoud Ali Youssouf is elected as the Chairman of the African Union Commission, defeating former Kenyan Prime Minister Raila Odinga. * February 16 – In the Democratic Republic of the Congo, the March 23 Movement captures Bukavu, the capital of South Kivu province. * February 17 – A Delta Connection jet flips on landing at the Toronto Pearson International Airport, with 21 of the 80 occupants injured. * February 18 ** Russian President Vladimir Putin announces that Russia and the United States have officially agreed to restore diplomatic relations. ** Archaeologists announce that the empty tomb Wadi C-4 discovered in 2022 was that of the pharaoh Thutmose II. * February 19 – Croatia completes the process of joining the European Economic Area.https://www.efta.int/about-efta/legal- documents/eea-legal-texts * February 19 – March 9 – The 2025 ICC Champions Trophy are held in Pakistan and Dubai.https://www.icc- cricket.com/tournaments/champions-trophy-2025 * February 21 – In Peru, the roof of a shopping center collapses, leaving at least eight people dead and 84 injured. * February 23 – In the German federal election, the CDU/CSU (Union), led by Friedrich Merz, wins the most seats in the Bundestag, while the far- right AfD comes in second and the SPD led by Chancellor Olaf Scholz comes in third. * February 25 – A Sudanese Air Force plane crashes near an air base in Omdurman, killing at least 46 people. * February 26 – American actor Gene Hackman is found dead alongside his wife in New Mexico at the age of 95. * February 27 – Russian chess player and former World Chess Champion Boris Spassky dies in Moscow at the age of 88. * February 28 – An altercation between Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump in the Oval Office causes ongoing negotiations between the countries to break down. ===March=== * March 2 ** Firefly Aerospaces Blue Ghost successfully lands on the Moon as part of the Commercial Lunar Payload Services program. ** At the Academy Awards, Anora wins five awards, including Best Picture. *March 8 – Mahmoud Khalil, a student activist involved in pro- Palestinian protests at Columbia University, is taken from his New York apartment by ICE agents. *March 18 – Israel strikes Gaza after a 2-month ceasefire. At least 404 are killed, including children. At least 660 others are also injured. *March 28 – At least 5,400 are killed and more than 7,860 injured when a 7.7 magnitude earthquake occurs in Southeast Asia with its epicenter in Myanmar, but with destruction taking place as far away as Bangkok, Thailand. Tremors were felt as far west in Delhi, India and as far east in Ho Chi Minh City, Vietnam. === April === * April 2 – US President Donald Trump issues sweeping trade tariffs on many countries. * April 8 – During a concert by Rubby Pérez in Santo Domingo, a nightclub roof collapses, killing at least 221 people, including Pérez, and injures more than 255 others. * April 13–October 13 – Expo 2025 is held in Osaka, Japan. * April 14 – Abdullah Ahmad Badawi, former Prime Minister of Malaysia, dies at 85. * April 17 – The atmosphere of K2-18b, a water world located 124 light-years away, is found to contain large amounts of both dimethyl sulfide and dimethyl disulfide – two compounds that, on Earth, are only known to be produced by life. While requiring further proof, it is described as \"the strongest evidence to date for a biological activity beyond the Solar System\". * April 19-20 - WWE WrestleMania 41 takes place over two nights at Allegiant Stadium in Las Vegas. The event marks John Cena's final WrestleMania, as he plans to retire from wrestling in 2025. * April 21 – Pope Francis, 266th Pope of the Catholic Church dies at 88. * April 22 – Militants affiliated with The Resistance Front open fire on a group of tourists at the Baisaran Valley in Jammu and Kashmir, India, killing 28 and injuring at least 20. * April 26 ** The funeral of Pope Francis is attended by representatives from 164 different countries of the world, including 82 leaders, and 250,000 other people. ** An explosion in the Port of Shahid Rajee, Bandar Abbas, Iran, killed more than 40 people and injured more than 1200 people. ** A vehicle-ramming attack occurred at the Lapu Lapu Day festival, a public event honouring Filipino heritage in Vancouver, Canada. * April 28 – The 2025 Canadian federal election is held. === May === * May 9 – May 25 – The 2025 IIHF World Championship is held in Stockholm, Sweden and Herning, Denmark. * May 11 – The 2025 Albanian parliamentary election is held. * May 12 – The 2025 Philippine general election is held. * May 13–17 – The Eurovision Song Contest 2025 is held in Basel, Switzerland. * May 18 – The 2025 Polish presidential election is held; incumbent president Andrzej Duda is ineligible for re-election. * May 25 – The 2025 Surinamese general election is held. == Predicted & Scheduled events == * June 15 – July 13 – The 2025 FIFA Club World Cup will take place in the United States. * June 25–28 – The Glastonbury Festival, near Pilton, Somerset in the United Kingdom. * July 1 – Bulgaria is expected to adopt the euro and become the 21st member state of the eurozone. * July 11 – August 3 – The 2025 World Aquatics Championships will take place in Singapore. * August 7–17 – The 2025 World Games will take place in Chengdu, China. * August 17 – The 2025 Bolivian general election is scheduled to be held. * September 8 – The 2025 Norwegian parliamentary election is scheduled to be held. * September 12–28 – The 2025 FIVB Men's Volleyball World Championship will take place in Pasay and Quezon City in the Philippines. * September 13–21 – The 2025 World Athletics Championships will take place in Tokyo, Japan. * October 3 – Henri, Grand Duke of Luxembourg will abdicate the throne in favor of his son Guillaume, who will reign as Guillaume V. * October 20 – If not triggered earlier, the 2025 Canadian federal election will be held no later than this date. * October 26 – The 2025 Argentine legislative election is scheduled to be held. * October 27 – The 2025 Irish presidential election will be held no later than this date. Incumbent president Michael D. Higgins is ineligible for re-election. * November 21 – December 7 – The 2025 FIFA Futsal Women's World Cup will take place in the Philippines. * November 23 ** The 2025 Chilean general election is scheduled to be held. ** If not triggered earlier, the 2025 Singaporean general election will be held no later than this date, with the current Parliament to be dissolved no later than August 24. *November 27 – December 14 – The 2025 World Women's Handball Championship will take place in Germany and the Netherlands. === Unknown dates === * The Giant Magellan Telescope is expected to be completed. * Voyager 2 might stop transmitting. == Deaths == == Related pages == * 2025 in association football == References ==",
 "title": "2025"
}