{
 "id": "189003",
 "text": "2024 (MMXXIV) was a leap year starting on Monday in the Gregorian calendar, the 2024th year of the Common Era (CE) and Anno Domini (AD) designations, . Over 80 countries held national elections in 2024, and all developed democracies' ruling parties lost vote share. The year saw the continuation of major wars, including the Russian invasion of Ukraine and the Israel-Hamas War. == Events == ===January=== * January 1 ** Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates become BRICS members. ** The Republic of Artsakh is formally dissolved as Nagorno-Karabakh unifies with Azerbaijan. ** A 7.5 Mww earthquake strikes Noto Peninsula on the western coast of Japan, killing over 230 people and injuring nearly 1,300 others. ** Ethiopia announces an agreement with Somaliland to use the port of Berbera. Ethiopia also says that it will eventually recognize Somaliland's independence, becoming the first country to do so. * January 2 ** South Korean Opposition Leader Lee Jae-myung is stabbed in the neck while visiting a construction site in Gadeokdo, Busan. ** The Legislature of the Marshall Islands elects Hilda Heine as President of the Marshall Islands for a second non-consecutive term. ** A Japan Airlines plane with passengers on board catches fire at Haneda Airport in Tokyo when it crashes with a Japan Coast Guard (JCG) plane which was carrying aid relief to areas affected by the Noto earthquake. Five out of a total of six people from the JCG plane died. ** Senior Hamas leader and Al- Qassam Brigades founder Saleh al-Arouri is killed in an Israeli airstrike in Dahieh, Beirut, Lebanon. * January 3 – During a ceremony marking the third anniversary of the assassination of Qasem Soleimani in Kerman, Iran, two bombs explode in the city, killing 91 people and injuring over 170 others. The next day, the Islamic State claim responsibility for the attack. * January 6 – The Iranian-backed Houthi movement launch a drone attack on the USS Laboon in the Red Sea. * January 7 – The Awami League led by Prime Minister of Bangladesh Sheikh Hasina win the most seats in the Jatiya Sangsad during the general election. * January 8 ** United Launch Alliance's Vulcan Centaur rocket successfully launches the Peregrine lunar lander, making it the first mission on NASA's Commercial Lunar Payload Services program. Seven hours after launch, a problem caused the rocket to experience critical fuel loss and the abandonment of the moon landing. ** Ecuadorian President Daniel Noboa declares a state of emergency following the escape of a drug cartel leader from prison, deploying the country's military onto the streets and into prisons, while setting a national nighttime curfew. * January 9 **Gabriel Attal is appointed Prime Minister of France, replacing Élisabeth Borne, becoming the youngest and first openly gay person to hold the office. **The Houthis launch a series of attacks in the Red Sea, which is responded to by the navies of the United States and United Kingdom. * January 11 ** The Iranian Navy seizes control of the Marshall Islands-flagged, United States-controlled and Greek-operated civilian oil tanker St Nikolas. ** The United States seizes control and later sinks an Iranian dhow, which was transporting supplies to the Houthis. The operation resulted in the entire crew of the vessel being captured as well as two U.S. Navy SEALs being lost at sea. ** Riots break out in Port Moresby and Lae, Papua New Guinea, after a possible rounding error causes pay cuts in police officers and soldiers. * January 12 – A coalition, consisting of the United States, United Kingdom, Australia, Bahrain, Canada and the Netherlands, launch a large-scale missile attack against the Houthis in Yemen. * January 13 **Vice President Lai Ching-te is elected President of Taiwan with 40% of the vote. **The USS Carney launches missiles towards and destroyed a Houthi radar facility at the al-Dailami Air Base in Yemen. * January 14 ** Crown Prince Frederik of Denmark ascends the throne as King Frederick X, following the planned abdication of his mother Margrethe II. ** The Houthis launch another attack on the USS Laboon, eight days after the previous attack. ** Azali Assoumani is re-elected as President of the Comoros. * January 15 ** Bernardo Arévalo is inaugurated as the 52nd President of Guatemala following a delay by the Congress of Guatemala. ** North Korean Supreme Leader Kim Jong Un says that Korean reunification is \"no longer possible\" and asks the Supreme People's Assembly to formally recognize South Korea as a separate country. ** The Houthis launch an attack on the Marshall Islands-flagged, United States- owned and operated bulk carrier Gibraltar Eagle. ** The Islamic Revolutionary Guard Corps (IRGC), a branch of the Iranian military, launched ballistic missiles towards the United States Consulate in Erbil, Kurdistan Region, Iraq as well as an alleged Mossad spy headquarters. ** The Iranian government extends Nobel Peace Prize laureate Narges Mohammadi's jail sentence of 12 years for 'spreading propaganda'. * January 16 – The Houthis attacked the Maltese-flagged bulk carrier Zografia in the southern Red Sea. * January 19 - Japan Aerospace Exploration Agency's SLIM lunar module successfully lands on the moon. * January 20 – An airstrike kills five elite Iranian Revolutionary Guards in a building in Damascus with Iran blaming Israel. * January 22 – Joseph Boakai is inaugurated as the 26th President of Liberia. * January 23–24 – Over 40 people are killed in Mangu, Plateau State, Nigeria.At least 43 killed in Nigeria clashes in Mangu * January 24 ** A Russian Ilyushin Il-76 military transport plane carrying 65 Ukrainian prisoners of war, six crew members and three guards, crashes in Russia's Korochansky District, killing everybody on board. ** A fire kills 39 people in Yushui, Xinyu, Jiangxi, China. * January 26 ** Israel–Hamas war: The UN's International Court of Justice in its first ruling on South Africa's genocide case against Israel, rules that, Israel must take all measures to prevent genocidal acts in Gaza, but stops short of ordering an immediate stopping of operations or ceasefire. ** Prime Minister of Tuvalu Kausea Natano loses reelection to Parliament. A month later, Feleti Teo was elected prime minister. * January 27 - Three gunmen kill nine Pakistani labourers in Saravan, Sistan and Baluchestan province, Iran. * January 28 ** Two Islamic State gunmen kill a Turkish man in a Roman Catholic church in Istanbul, Turkey. ** Former Prime Minister Alexander Stubb is elected the 13th President of Finland. ** An Islamic Resistance in Iraq drone attack kills three American soldiers in Rukban, Mafraq Governorate, Jordan. * January 30 – Imran Khan, former prime minister of Pakistan, is sentenced to 10 years in prison for revealing state secrets. * January 31 – Sultan of Johor Ibrahim Iskandar ascends to the throne as the 17th Yang di-Pertuan Agong of Malaysia. ===February=== * February 1–5 – Over 130 people are killed by wildfires in Chile. * February 2 – The United States Air Force launches a series of airstrikes against the Iranian military and their supporters in Iraq and Syria. * February 3 – 4 – Thirty-seven people are killed in Abyei. * February 4 – Nayib Bukele is re-elected president in the 2024 Salvadoran general election. * February 6 ** The Revolutionary People's Liberation Party/Front kill one person in a mass shooting in Istanbul, Turkey. ** Ten people are killed in a quadruple bombing in Mogadishu, Somalia. ** Former President of Chile Sebastián Piñera is killed in a helicopter crash in Lake Ranco, Los Ríos Region, Chile. * February 7 ** Two Islamic State motorcycle bombings kill about 30 people in Pishin and Killa Saifullah Districts in Balochistan, Pakistan. ** Ilham Aliyev is re-elected president in the 2024 Azerbaijani presidential election. * February 8 – 2024 Pakistani general election. * February 16 – Russian opposition leader Alexei Navalny dies in FKU IK-3, a prison in Kharp, Yamalo-Nenets Autonomous Okrug, Russia. * February 17 – A man kills 12 people in a mass shooting in Faryab County, Kerman province, Iran. * February 22 – At least ten people are killed in a fire at an apartment block in Valencia, Spain. * February 25 – 2024 Belarusian parliamentary election. * February 29 – Soldiers of the Israeli Forces open fire on a crowd of civilians in Gaza City, killing more than a hundred people, as the Palestinian casualties of the war exceed 30,000. ===March=== * March 7 – Sweden became the 32nd member of NATO. * March 10 – 2024 Portuguese legislative election takes place. * March 11 – Haitian Prime Minister and President Ariel Henry announces his resignation. * March 15–17 – 2024 Russian presidential election: Incumbent Vladimir Putin is re-elected for a fifth term as President of Russia. * March 22 – At least 133 people killed and more than 140 injured in a shooting in the Crocus City Hall music venue in Moscow. The building is reportedly on fire after an explosion; The Islamic State claimed responsibility for the attack. * March 25 – The UN Security Council passes a resolution calling for an \"immediate ceasefire\" in Gaza and demanding the immediate and unconditional release of all hostages. ===April=== *April 1 – The Iranian embassy in Damascus, Syria was struck by a missile, killing at least eleven people, including IRGC Brig. Gen. Mohammad Reza Zahedi. *April 19 – June 1 – 2024 Indian general election. ===May=== ===June=== * June 2 – 2024 Mexican general election: Claudia Sheinbaum is the first woman to be elected as President of Mexico. === July === * July 13 – Former President Donald J. Trump survives an assassination attempt at a rally near Butler, Pennsylvania. * July 26 – August 11 – 2024 Summer Olympics were held in Paris, France. === August === * August 28 – September 8 - 2024 Summer Paralympics are held in Paris, France. === September === * September 5 – September 8: Typhoon Yagi hits Vietnam and China, causing lots of damage in that area, after the typhoon is gone in Vietnam, Phong Chau Bridge had collapse near Hanoi. * September 7 – 2024 Algerian presidential election. === October === * October 27 – 2024 Japanese general election. === November === * November 5 – 2024 United States presidential election: Donald Trump is elected to a second non-consecutive term. === December === * December 1 – 2024 Romanian parliamentary election: The incumbent National Coalition for Romania wins a plurality of votes, with far-right parties making substantial gains. * December 3 – South Korean President Yoon Suk Yeol declares martial law during a late-night address broadcast live on YTN television, accusing the country's main opposition Democratic Party of sympathizing with North Korea and engaging in anti-state activities. * December 4 **2024 French political crisis: Michel Barnier becomes the first prime minister of France to lose a motion of no-confidence since Georges Pompidou in 1962. ** Brian Thompson, CEO of UnitedHealthcare, is shot and killed by a lone gunman in Midtown Manhattan, sparking debate and criticism of the health insurance industry in the United States. * December 6 – 2024 Romanian presidential election: The Constitutional Court of Romania annuls the results of the first round, amid accusations of Russian interference after the unexpected advancement of pro-Russian candidate Călin Georgescu to the runoff. * December 7 ** 2024 Ghanaian general election: John Mahama of the NDC is elected president for a second non-consecutive term. ** The Notre-Dame Cathedral reopens to the public after previously being damaged by a structural fire in 2019. * December 8 – Syrian civil war: President of Syria Bashar al-Assad leaves Damascus after being overthrown, ending his presidency and the Ba'athist Syria regime after a total of 61 years. The Syrian opposition forms the Syrian Transitional Government as a provisional government. * December 11 – FIFA announces that Morocco, Portugal and Spain will jointly host the 2030 World Cup, with anniversary matches to be held in Argentina, Paraguay and Uruguay, while Saudi Arabia is confirmed as the host for 2034. * December 12 – Indian chess prodigy Gukesh Dommaraju defeats former world champion Ding Liren in the 2024 World Chess Championship, breaking the previous age record of 22 set by Garry Kasparov by becoming champion at 18 years, 195 days old. * December 14 ** 2024 Georgian presidential election: Mikheil Kavelashvili of People's Power is elected unopposed. ** South Korean President Yoon Suk Yeol's powers and duties are suspended after MPs vote to impeach him, following his martial law declaration the previous week. ** Cyclone Chido makes landfall in Mayotte, causing at least 172 deaths and bringing devastating damage to the island. * December 17 – The capital of Vanuatu, Port Vila, suffers extensive damage after a 7.3 earthquake. At least 16 people are killed. * December 19 ** The Hungarian government of Viktor Orbán has granted political asylum to Polish MP of Law and Justice Marcin Romanowski, who is wanted on the European Arrest Warrant for being accused of defrauding 100 million zł from the (Justice Fund) when he was deputy minister of justice during the PiS government. ** Mazan rapes trial: The Judicial Court in Avignon, France, finds Dominique Pelicot guilty of the aggravated rape of his ex-wife Gisèle Pelicot and imposes the maximum sentence of 20 years in prison. The 50 other defendants in the case are also convicted of crimes ranging from attempted rape to aggravated rape, and receive prison sentences ranging from three to 15 years. * December 20 – Five people are killed, while another 235 are injured, after a car is driven into a crowd at a Christmas market in Magdeburg, Germany. * December 24 ** The 2025 Jubilee in the Catholic Church begins. ** The Parker Solar Probe breaks the previous record set in 2018 for the closest artificial object to the Sun by 6.1 million kilometers (3.8 million miles), becoming the closest and first man-made object to approach and \"touch\" the Sun. * December 25 – Azerbaijan Airlines Flight 8243, an Embraer ERJ-190AR, crashes in Kazakhstan. Twenty-nine out of the 67 on board survive the crash. * December 27 – Acting President of South Korea Han Duck-soo is impeached by MPs for failing to promulgate two bills related to president Yoon's legal proceedings. He is succeeded by deputy prime minister Choi Sang-mok. * December 29 ** Jeju Air Flight 2216, a Boeing 737-800 passenger flight from Bangkok Suvarnabhumi Airport in Bangkok, Thailand, to Muan International Airport in Muan, South Korea, veers off the runway at Muan International Airport and crashes into a barrier, killing 179 people. Two injured survivors are reported. ** Former President of the United States and Nobel Peace Prize laureate Jimmy Carter dies at the age of 100. ==Deaths== ==References==",
 "title": "2024"
}