{
 "id": "189334",
 "text": "Lisa Marie Presley (February 1, 1968 – January 12, 2023) was an American singer-songwriter. She was the only child of singer and actor Elvis Presley and actress Priscilla Presley. She was the owner of Graceland. It is the mansion her father lived in. She had released three albums. ==Early life== Presley was born in Baptist Memorial Hospital-Memphis in Memphis, Tennessee. She was the only daughtor of singer and actor Elvis Presley and actress Priscilla Presley. She grew up with Presley Family in Graceland until the death of her father in 1977. Presley was born nine months, to the day, after the wedding of her parents. After her parents divorced, she lived with her mother in Los Angeles, California but often lived with her father at Graceland in Memphis, Tennessee. When her father died in August 1977, nine-year-old Presley became heir to his estate with her grandfather Vernon Elvis Presley and her great-grandmother Minnie Mae Hood Presley. Vernon died in 1979 and Minnie Mae died in 1980. This made her the only heir and she inherited Graceland. On her 25th birthday in 1993, she inherited the estate. It had grown to about $100 million. In 2004, Presley sold 85% of her father's estate. In the late 1970s, soon after the death of her father, she attended her first rock concert. It was the English band Queen at The Forum in Inglewood, California. She gave Freddie Mercury a scarf after the show. The scarf had belonged to her father. She also said that she loved the theatrics of the show. Her parents had divorced when she was four years old. Lisa was nine years old when her father died, She was one of the first people to see her father dead on the bathroom floor at Graceland. Shortly after her father's death, her mother began dating actor Michael Edwards. Lisa Marie was reportedly sexually abused by Edwards when she was between 12 and 15 years old. In an interview with Playboy magazine in 2003, Presley said that Edwards had the habit of going into her private room while drunk. She said that he was inappropriate with her. ==Personal life== Presley had been married four times. She was married to musician Danny Keough from 1988 until 1994. In 1994, she married pop icon, Michael Jackson. They divorced in 1996. Actor Nicolas Cage was married to Presley from 2002 until 2004. She was married from 2006 until 2016 to guitarist, Michael Lockwood. She had four children. She had two children with Keough and twins with Lockwood. == Death == Presley died on January 12, 2023, at the age of 54 after suffering from a cardiac arrest. Two days before she died, Presley was at the 80th Golden Globe Awards with her mother. She was seen having trouble walking and needed to be helped by her talent manager and friend Jerry Schilling. Later that month, on January 22, a funeral was held for her. Her funeral was attended by her mother and three daughters, Sarah, Duchess of York, Austin Butler, Billy Corgan, and Axl Rose. Presley was laid to rest next to her son, Benjamin Keough, who died in July 2020 by suicide, in the Meditation Garden at Graceland. In July 2023, her autopsy report said that Presley died of small bowel obstruction caused by weight loss surgery she recently had. ==References== Category:1968 births Category:2023 deaths Category:American singer-songwriters Category:Elvis Presley Category:Singers from Memphis, Tennessee Category:Deaths from bowel obstruction Category:Deaths from surgical complications Category:Deaths from cardiac arrest",
 "title": "Lisa Marie Presley"
}