{
 "id": "189540",
 "text": "The Joy of Giving Week (JGW), planned for Sept 27 - Oct 3, 2009 as a national movement, aims at engaging at least one crore Indians in different \"acts of giving\" - money, time, resources and skills- spanning the corporate, NGO and government sectors, schools, colleges and the general public. The idea is to create a \"festival of philanthropy\" that can, over the years, become a part of the Indian ethos, with the Week being celebrated every year covering Gandhi Jayanti. The Week is designed as a \"public platform\" and is being co-ordinated by GiveIndia, a non for profit organization whose mission is to promote Giving. GiveIndia has earlier initiated public giving activities like the Mumbai and Delhi marathons and runs the largest Payroll Giving programme in the country across 40 companies. ==Launch== The Joy of Giving Week was launched in Mumbai on June 3 in front of the media and was covered by 22 news channels and over 40 publications and a press meet was scheduled in Chennai on June 30. And soon, the campaign would launched before media in Hyderabad and various other cities. ==Activities== Several corporates, celebrities and organisations have already finalized their efforts towards awareness, volunteering and fundraising events that they will organize during the Joy of Giving Week. A brief outline on some of the initiatives that are taking place during the Week. ===Design for Giving School Contest=== :The Design for Giving School Contest will inspire children aged 10-13 from over 10,000 private and government schools all over India to design solutions to India's problems and implement them during the Week. Presented by Riverside School in Ahmedabad, NID, Stanford Design School and IDEO (the world's #1 design firm), in partnership with hundreds of educational NGOs and schools across India. ===Clothes Collection Drive=== :Goonj runs a unique Vastradaan initiative that provides clothes and other amenities to the far flung villages, collecting on an average 20,000 kg or about 1.2 lac units of clothing every month, process it and distribute it through a unique clothes for work program. For the Joy of Giving Week, Goonj is undertaking a massive Clothes Collection Drive in over 25 cities, targeting to collect at least 1 crore units of clothing during the Week. ===College Joyfest=== :A \"College Joyfest\" that hopes to have 300+ college campuses in India partner with local NGOs to hold cultural festivals that promote awareness and sensitivity among youth, while also being fundraisers for the partner NGOs. The initiative is being led by JAM Magazine and is being supported by MTV. ===7Days7Gifts=== :7Days7Gifts , a simple idea where people will be encouraged to do random acts of kindness to people they don’t know for every day of the week. The 7 Day gifting challenge aims to take the focus away from you on to others. The only real condition here is that each gift should be meaningful and some thought should have gone into it. ===Pay-it-forward=== :Pay-it-forward chain encourages people to carry forward the message of ‘giving’. The person who starts this chain can write his act of kindness on the chain and then pass it on to the person receiving the kindness, thus motivating him/her to pay it forward. ===Battle of the Buffet=== :\"Battle of the Buffet\" events by the 5 star Hotels in Chennai and Hyderabad, where they provide their most lavish spreads free of cost to NGOs of the city, who work together as a city and sell donor passes to raise funds for their work. ===Organ Donation Campaign=== :A large organ donation campaign by Apollo Hospitals and a campaign to engage children in Giving by leading FMCG company are on the cards. The Park Hotels group will host fundraising events at all their hotels free of cost, as will the Oxford Bookstore chain. Companies like Makemytrip, Canon, Google, Oriental Cuisines, ITC and many others have committed support. ===Donations for Wildlife Conservation Trust=== :The Wildlife Conservation Trust has agreed to match all donations made for certain wildlife conservation projects during the Week, up to Rs 1 crore. ===Celebrities Support for the Week=== :Celebrities like Sachin Tendulkar, Saif, AR Rahman, Ayesha Takia, Mini Mathur, South Indian stars like Madhavan & Khushboo, as well as directors like Imtiaz Ali, Anurag Kashyap, etc. have promised to support the initiative. ==Other websites== * Joy Of Giving Week * GiveIndia * JGW Blog * 7Days7Gifts * Design for Giving School Contest Category:Charity events Category:Indian culture",
 "title": "Joy of Giving Week"
}