{
 "id": "189885",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Nanami was born in Fujieda on November 28, 1972. After graduating from Juntendo University, he joined Júbilo Iwata in 1995. From first season, he played as regular player and became a most central player in golden era in club history. The club won the champions 1997 J1 League and 1998 J.League Cup. He was also selected Best Eleven for 3 years in a row (1996-1998). In Asia, the club won 1998–99 Asian Club Championship. In July 1999, he moved to Serie A club Venezia on loan. However the club was relegated to Serie B in 2000. In September 2000, he returned to Júbilo Iwata. He hurts his knees in 2001 and he reduced opportunities to play in the match after that. The club won the champions at 2002 J1 League and 2003 Emperor's Cup. This was golden era in the club history and he was one of the central player in golden era. In 2006, his opportunity to play decreased and he moved to Cerezo Osaka in August 2006. In 2007, he moved to J2 League club Tokyo Verdy. In 2008, he returned to Júbilo Iwata and announced his retirement in November 2008 after being dogged by a knee injury in recent years. On August 6, 1995, Nanami debuted and scored a goal for Japan against Costa Rica. From 1996, he became a central player and wore the number 10 shirt. In 1996, he played all matches for Japan included 1996 Asian Cup. At 1998 World Cup qualification in 1997, Japan won the qualify for 1998 World Cup first time Japan's history. In 1998, he played all matches included World Cup. He also played at 1999 Copa América and 2000 Asian Cup. At 2000 Asian Cup, he played full time in all matches and scored 3 goals. Japan won the champions and he was selected MVP Awards. After he hurts his knees in 2001, he did not play for Japan. He played 67 games and scored 9 goals for Japan until 2001. In September 2014, Nanami became a manager for Júbilo Iwata as Péricles Chamusca successor. Júbilo played in J2 League in 2014 season and aimed to return to J1 League. However Júbilo finished at 4th place in 2014 and missed promotion to J1. In 2015, Júbilo won the 2nd place and promoted to J1 League. Although Júbilo finished 13th place in 2016, Júbilo gained Shunsuke Nakamura and rose at 6th place in 2017. However the club results were bad from 2018. Although Júbilo finished at 16th place of 18 clubs in 2018 and remained J1, he resigned in June 2019 when Júbilo was at the bottom place. ==Statistics== |- |1995||rowspan=\"5\"|Júbilo Iwata||rowspan=\"5\"|J1 League||51||3||2||0||colspan=\"2\"|-||colspan=\"2\"|-||53||3 |- |1996||30||3||1||0||14||1||colspan=\"2\"|-||45||4 |- |1997||21||5||2||1||2||0||colspan=\"2\"|-||25||6 |- |1998||33||7||3||0||2||0||colspan=\"2\"|-||38||7 |- |1999||15||4||0||0||2||0||colspan=\"2\"|-||17||4 |- |1999/00||Venezia||Serie A||24||1||7||1||colspan=\"2\"|-||colspan=\"2\"|-||31||2 |- |2000||rowspan=\"7\"|Júbilo Iwata||rowspan=\"7\"|J1 League||5||1||2||0||0||0||colspan=\"2\"|-||7||1 |- |2001||17||1||0||0||4||0||colspan=\"2\"|-||21||1 |- |2002||24||1||0||0||5||0||colspan=\"2\"|-||29||1 |- |2003||27||3||5||1||5||0||colspan=\"2\"|-||37||4 |- |2004||29||3||3||0||5||0||3||1||40||4 |- |2005||26||1||2||0||2||0||3||0||33||1 |- |2006||10||0||0||0||4||0||colspan=\"2\"|-||14||0 |- |2006||Cerezo Osaka||J1 League||13||2||0||0||0||0||colspan=\"2\"|-||13||2 |- |2007||Tokyo Verdy||J2 League||17||0||1||0||colspan=\"2\"|-||colspan=\"2\"|-||18||0 |- |2008||Júbilo Iwata||J1 League||13||0||2||0||3||0||colspan=\"2\"|-||18||0 331||34||22||2||48||1||6||1||407||38 24||1||7||1||colspan=\"2\"|-||colspan=\"2\"|-||31||2 355||35||29||3||48||1||6||1||438||40 |} Japan National Football Team Database |- |1995||2||2 |- |1996||13||1 |- |1997||21||3 |- |1998||11||0 |- |1999||6||0 |- |2000||12||3 |- |2001||2||0 |- !Total||67||9 |} ==References== ==Other websites== * Category:1972 births Category:Living people Category:Footballers from Shizuoka Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:J2 League players Category:Júbilo Iwata players Category:Cerezo Osaka players Category:Tokyo Verdy players Category:1998 FIFA World Cup players Category:1996 AFC Asian Cup players Category:2000 AFC Asian Cup players Category:AFC Asian Cup-winning players",
 "title": "Hiroshi Nanami"
}