{
 "id": "190066",
 "text": "Fully Loaded was a yearly WWF event, which started in July 1998 and was held for another two years. In 2001, the event was replaced by Invasion, which was replaced by Vengeance in 2002. == Fully Loaded dates and venues == __NOTOC__ Event Date City Venue Fully Loaded: In Your House July 26, 1998 Fresno, California Selland Arena Fully Loaded (1999) July 25, 1999 Buffalo, New York Marine Midland Arena Fully Loaded (2000) July 23, 2000 Dallas, Texas Reunion Arena == Results == === 1998 === Fully Loaded: In Your House took place on July 26, 1998 at the Selland Arena in Fresno, California. * Val Venis beat Jeff Jarrett (with Tennessee Lee) (7:41) ** Venis pinned Jarrett with a roll- up. * D'Lo Brown (with The Godfather) beat X-Pac (with Chyna) (8:26) ** Brown pinned X-Pac with a Sky High. * Faarooq and Scorpio beat Terry Funk and Justin Bradshaw (6:51) ** Scorpio pinned Funk after a Scorpio Splash. * Mark Henry beat Vader (5:03) ** Henry pinned Vader after a Big Splash. * The Disciples of Apocalypse (8-Ball and Skull) (with Paul Ellering) beat L.O.D. 2000 (Hawk and Animal) (8:50) ** DOA won when Animal was pinned. * Owen Hart beat Ken Shamrock (with Dan Severn as Special Guest Referee) in a Dungeon match (4:53) ** Owen won when he knocked Shamrock out with a dumbbell and lifted his arm in a tap out motion. ** This match was taped days earlier in the Hart family Dungeon.WWF Fully Loaded * WWF Intercontinental Champion The Rock fought Triple H (with Chyna) to a time limit draw in a Two out of Three falls match match (30:00) ** Rock pinned Triple H after a Rock Bottom (20:21) ** Triple H pinned Rock after Chyna interfered and hit a DDT (25:23) ** The time limit was reached right after Triple H hit a Pedigree, Rock kept the title (30:00) * Jacqueline beat Sable (with Jerry Lawler as Emcee) in a Bikini contest ** Sable originally won the match, but was later disqualified for not wearing a bikini top (she had hand prints painted on each breast). * The Undertaker and Steve Austin beat Kane and Mankind to win the WWF Tag Team Championship (17:28) ** Undertaker pinned Kane after a Tombstone Piledriver. === 1999 === Fully Loaded (1999) took place on July 25, 1999 at the Marine Midland Arena in Buffalo, New York. * Sunday Night Heat match: Val Venis beat Joey Abs (3:16) ** Venis pinned Abs. * Sunday Night Heat match: The Godfather beat Meat (2:06) ** Godfather pinned Meat. * Sunday Night Heat match: Christian beat Viscera (2:43) ** Christian pinned Viscera. * Jeff Jarrett (with Debra) beat Edge to win the WWF Intercontinental Championship (13:22) ** Jarrett pinned Edge after a Stroke. * The Acolytes (Faarooq and Bradshaw) beat Michael Hayes and The Hardy Boyz (Matt and Jeff) in a Handicap match to win the WWF Tag Team Championship (9:32) ** Bradshaw pinned Hayes after a Double Powerbomb. * D'Lo Brown beat Mideon to win the WWF European Championship (7:11) ** Brown pinned Mideon after a 'Lo Down. * The Big Boss Man beat Al Snow to win the WWF Hardcore Championship (10:11) ** Boss Man pinned Snow after hitting him with a metal rod. * The Big Show beat Kane (with Hardcore Holly as special guest referee) (8:13) ** Big Show pinned Kane after a Chokeslam. * Ken Shamrock beat Steve Blackman in a Iron Circle match (4:19) ** Shamrock won by KO after choking Blackman out with a steel chain. ** This match took place in a parking garage where Shamrock and Blackman fought within a circle of cars. * Road Dogg and X-Pac beat Mr. Ass and Chyna (11:44) ** Road Dogg pinned Mr. Ass after a Pumphandle Drop to win the rights to the DX name. * Triple H beat The Rock in a Strap match (19:21) ** Triple H pinned Rock after a Pedigree to earn a WWF Championship match at SummerSlam. * Steve Austin beat The Undertaker in a First Blood match to keep the WWF Championship (15:31) ** Austin won after hitting the Undertaker with a television camera following interference from X-Pac. As a result, Vince McMahon could no longer appear on WWF television. ** If Austin would have lost he could never wrestle for the WWF Championship again. === 2000 === Fully Loaded (2000) took place on July 23, 2000 at the Reunion Arena in Dallas, Texas. * The Hardy Boyz (Matt and Jeff) and Lita beat T & A (Test and Albert) and Trish Stratus in a Mixed Tag Team match (13:12) ** Lita pinned Stratus after a moonsault. * Tazz beat Al Snow (5:20) ** Tazz forced Snow to submit with the Tazzmission. * Perry Saturn (with Terri) beat Eddie Guerrero (with Chyna) to win the WWF European Championship (8:10) ** Saturn pinned Guerrero after a Diving elbow drop. * The Acolytes (Faarooq and Bradshaw) beat WWF Tag Team Champions Edge and Christian by disqualification (5:29) ** Edge and Christian were disqualified after Edge hit Faarooq with a tag title belt, Edge and Christian kept the titles. * Val Venis beat Rikishi in a Steel cage match to retain the WWF Intercontinental Championship (14:10) ** Venis pinned Rikishi after Tazz hit Rikishi with a TV camera. * The Undertaker beat Kurt Angle (7:34) ** Undertaker pinned Angle after a Last Ride. * Triple H beat Chris Jericho in a Last Man Standing match (23:11) ** Triple H won when Jericho could not get up after being suplexed through an announce table. * The Rock beat Chris Benoit to retain the WWF Championship (22:09) ** Rock pinned Benoit after a Rock Bottom. ** The title could change hands by disqualification. However, Rock was disqualified, meaning Benoit won the title, but Commissioner Mick Foley came out and restarted the match. == References == Category:History of Fresno, California Category:World Wrestling Entertainment pay-per-view events Category:Sports in Buffalo, New York Category:20th century in Dallas Category:1998 in California Category:1999 in the United States Category:1990s in New York (state) Category:2000 in the United States Category:20th century in Buffalo, New York Category:July events",
 "title": "WWF Fully Loaded"
}