{
 "id": "190144",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Tokunaga was born in Unzen on September 25, 1983. When he played for Waseda University, he also played for J1 League club FC Tokyo in 2003 and 2004. FC Tokyo won the champions in 2004 J.League Cup first major title in the club history. After graduating from Waseda University, he joined FC Tokyo in 2006. He became a regular player as right side back as Akira Kaji successor soon and played many matches every season for a long time. Although his original position is right side back, he also played as many defensive position. FC Tokyo won the champions in 2009 J.League Cup. In 2010, he played many matches as defensive midfielder instead Takuji Yonemoto, who was injured. However FC Tokyo finished at the 16th place of 18 clubs in 2010 season and was relegated to J2 League. In 2011, he returned to right side back and FC Tokyo won the champions and was returned to J1 in a year. FC Tokyo also won the champions in 2011 Emperor's Cup. He played as regular right side back until 2017. In 2018, he moved to his local club V-Varen Nagasaki which newly was promoted to J1 from 2018. He played many matches as right back of three backs defense. However V-Varen finished at the bottom place in 2018 season and was relegated to J2 in a year. He retired end of the 2020 season. In November 2003, Tokunaga was selected the Japan U-20 national team for 2003 World Youth Championship. At this tournament, he played full-time in all 5 matches as right side midfielder. Tokunaga was part of the Japan U-23 national team for 2004 Summer Olympics. He played 2 matches as right side midfielder and right side back. On October 8, 2009, Tokunaga debuted for the Japan national team against Hong Kong at 2011 Asian Cup qualification under manager Takeshi Okada. He played many matches as right side back while battling with Atsuto Uchida for the position until early 2010. However he was not select for 2010 World Cup. In July 2012, Tokunaga was selected Japan U-23 national team as over aged player for 2012 Summer Olympics. He played 5 matches as left side back and Japan reached the semi-finals where they lost to eventual gold medalists, Mexico, and then lost the bronze medal play-off match to South Korea. In July 2013, Tokunaga was selected Japan under manager Alberto Zaccheroni for 2013 East Asian Cup for the first time in 3 years. At the tournament, he played 2 matches as left side back and Japan won the champions. This tournament is his last game for Japan. He played 9 games for Japan until 2013. ==Statistics== |- |2003||rowspan=\"14\"|FC Tokyo||rowspan=\"7\"|J1 League||8||0||0||0||2||0||colspan=\"2\"|-||10||0 |- |2004||6||0||0||0||4||0||colspan=\"2\"|-||10||0 |- |2006||32||1||2||0||5||0||colspan=\"2\"|-||39||1 |- |2007||33||0||3||0||7||0||colspan=\"2\"|-||43||0 |- |2008||30||1||4||0||8||0||colspan=\"2\"|-||42||1 |- |2009||34||0||0||0||10||0||colspan=\"2\"|-||44||0 |- |2010||30||0||5||0||7||0||colspan=\"2\"|-||42||0 |- |2011||J2 League||37||3||6||0||colspan=\"2\"|-||colspan=\"2\"|-||43||3 |- |2012||rowspan=\"6\"|J1 League||31||1||0||0||2||0||7||1||40||2 |- |2013||34||1||5||0||5||0||colspan=\"2\"|-||44||1 |- |2014||34||0||3||0||3||1||colspan=\"2\"|-||40||1 |- |2015||33||0||2||0||7||0||colspan=\"2\"|-||42||0 |- |2016||30||0||1||0||2||0||7||0||40||0 |- |2017||24||0||1||0||7||0||colspan=\"2\"|-||32||0 |- |2018||rowspan=\"3\"|V-Varen Nagasaki||J1 League||27||0||2||0||0||0||colspan=\"2\"|-||29||0 |- |2019||rowspan=\"2\"|J2 League||31||1||1||0||2||0||colspan=\"2\"|-||34||1 |- |2020||10||1||colspan=\"2\"|-||colspan=\"2\"|-||colspan=\"2\"|-||10||1 464||9||35||0||71||1||14||1||1||0||584||11 464||9||35||0||71||1||14||1||1||0||584||11 |} Japan National Football Team Database |- |2009||5||0 |- |2010||2||0 |- |2011||0||0 |- |2012||0||0 |- |2013||2||0 |- !Total||9||0 |} ==References== ==Other websites== * Category:1983 births Category:Living people Category:Footballers from Nagasaki Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:FC Tokyo players Category:V-Varen Nagasaki players Category:Footballers at the 2004 Summer Olympics Category:Footballers at the 2012 Summer Olympics",
 "title": "Yuhei Tokunaga"
}