{
 "id": "190178",
 "text": "The V-2 rocket () was the world's first ballistic missile and first human object to fly in space.Peenemuende, Walter Dornberger, Moewig, Berlin 1985. . All modern rockets are based on the V2 design.NOVA science program(s). Sputnik declassified. Public Broadcasting Service (PBS). 2008. The first successful launch was from Peenemünde on 3 October, 1942, reaching a height of 192 km. The V2 was designed by Nazis to bomb London, Antwerp and other European cities. It travelled at four times the speed of sound so was impossible to shoot down. The first V-2 used as a weapon exploded in Paris on 8 September 1944, with a second rocket exploding in London later that day. Over 3,000 V-2s were used by the German Wehrmacht against Allied targets in World War II, resulting in the death of about 7,250 military personnel and civilians. The victors used captured V-2 rockets to start their space and missile programs. In the United States they were helped by the team of German rocket scientists from Peenemünde, led by Wernher von Braun. They had surrendered to the US at the end of the war. The first US-assembled V-2, made from parts captured in Germany, was launched from White Sands, New Mexico, in April 1946. There were 66 V-2 rocket flights, the last on October 29, 1951. ==Development== In the late 1920s, a young Wernher von Braun bought a copy of Hermann Oberth's book, Die Rakete zu den Planetenräumen (The Rocket into Interplanetary Spaces).Wernher von Braun#Early life. Starting in 1930, he attended the Technical University of Berlin, where he assisted Oberth in liquid-fueled rocket motor tests. In 1933 he went to work for the Army designing and building rockets. The final, biggest rocket was the A-4, later called V-2. ==Production== On 22 Dec. 1942, Hitler signed the order for mass production, when Speer assumed final technical data would be ready by July 1943. However, many issues still remained to be solved even by the autumn of 1943. Around this time, production was shifted to the concentration camp of Dora-Mittelbau where an estimated 20,000 prisoners died producing V-1s and V-2s. Test launch was recovered by Polish resistance on 30 May 1944# (Polish) Michał Wojewódzki, Akcja V-1, V-2, Warsaw 1984, and rocket from Blizna was transported to the UK during Operation Most III. == References == ===References=== * 24,000 fighters could have been produced instead of the inaccurate V-weapons. * * ==Further reading== * * Huzel, Dieter K. (ca. 1965). Peenemünde to Canaveral. Prentice Hall Inc. * ==Other websites== * * * History of Peenemünde and the discovery of the German missile development by the Allies * \"Chute Saves Rockets Secrets\", September 1947, Popular Science article on US use of V-2 for scientific research} * Reconstruction, restoration & refurbishment of a V-2 rocket, spherical panoramas of the process and milestones. Category:Wernher von Braun Category:Missiles",
 "title": "V-2"
}