{
 "id": "190475",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Matsumoto was born in Utsunomiya on November 3, 1941. After graduating from Waseda University, he joined Toyo Industries in 1964. In 1965, Toyo Industries joined new league Japan Soccer League. The club won league champions in 1965, 1966, 1967, 1968 and 1970. The club also won 1965, 1967 and 1969 Emperor's Cup. He retired in 1973. He played 88 games and scored 31 goals in the league. He was selected Best Eleven in 1966. In December 1966, Matsumoto was selected the Japan national team for 1966 Asian Games. At this competition, on December 10, he debuted against India. In 1968, he was selected Japan for 1968 Summer Olympics in Mexico City. He played 4 matches and Japan won Bronze Medal. In 2018, this team was selected Japan Football Hall of Fame. He played 11 games and scored 1 goal for Japan until 1969. After retirement, Matsumoto became a manager for Toyo Industries as Kenzo Ohashi successor in 1976. He also named a manager for Japan U-20 national team. He managed at 1979 World Youth Championship in Japan. In April 1999, he signed with J2 League club Kawasaki Frontale. He led the club to won the champions and promoted to J1 League. In 2004, he signed with Sagan Tosu and managed in 3 seasons. In 2009, he was selected Japan Football Hall of Fame. In 2010, he became a manager for Sagan Tosu again. In September 2013, when he was 71 years old, he signed with his local club, Tochigi SC. He became the first manager for the 70s in J.League. ==Statistics== Japan National Football Team Database |- |1966||4||1 |- |1967||3||0 |- |1968||2||0 |- |1969||2||0 |- !Total||11||1 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1941 births Category:Living people Category:Footballers from Tochigi Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan Soccer League players Category:Sanfrecce Hiroshima players Category:Footballers at the 1968 Summer Olympics Category:Olympic medalists in football Category:Olympic bronze medalists for Japan Category:Medalists at the 1968 Summer Olympics",
 "title": "Ikuo Matsumoto"
}