{
 "id": "190575",
 "text": "First Capital Connect was a train company in England. It ran the Thameslink railway line between Brighton and Bedford and it ran services along the East Coast Main Line from King's Cross and Peterborough, Cambridge, and King's Lynn from 1 April 2006 to 13 September 2014. It was owned by First Group. On 14 September 2014, the franchise was taken over by Govia Thameslink Railway, and it became part of the larger Thameslink, Southern and Great Northern franchise. ==Rolling stock== First Capital Connect took on a fleet of Class 319 units from Thameslink. It also took on a fleet of Class 313, 317 and 365 units from WAGN on the Great Northern routes. Class Image Type Top speed Number Routes operated Built mph km/h Class 03 Diesel Locomotive 28 46 1 Shunting 1957–1961 Class 313 EMU 75 120 44 Inner suburban Great Northern (Moorgate - //) 1976–1977 Class 317/1 100 160 12 Fast & Semi Fast Great Northern London King's Cross to Peterborough & Cambridge 1981–1982 Class 317/7 2 Used to provide cover for Class 365 units undergoing refurbishment. Withdrawn at end of franchise. Class 319 84 Thameslink (Brighton - Bedford, Sutton - Luton and Kentish Town - Sevenoaks) 1987–1988 1990 Class 321 13 Fast & Semi Fast Great Northern London King's Cross to Peterborough & Cambridge 1989–1990 Class 365 Networker Express 40 Fast & Semi Fast Great Northern London King's Cross to Peterborough & King's Lynn via Cambridge 1994–1995 Class 377/2 Electrostar 11 Thameslink (Brighton - Bedford and peak services: Bedford - Ashford International/Rochester) Class 377/2s sub-leased from Southern. 2003–2004 Class 377/5 Electrostar 23 Thameslink (Brighton - Bedford and peak services: Bedford - Ashford International/Rochester) Class 377/2s sub-leased from Southern. 2008–2009 ===Depots=== First Capital Connect operated two depots: *Bedford Cauldwell - code BF *Hornsey - code HE ==References== ==Other websites== * |- Category:Defunct railway companies of the United Kingdom Category:2006 establishments in England Category:2014 disestablishments in the United Kingdom",
 "title": "First Capital Connect"
}