{
 "id": "190647",
 "text": "TSV 1860 Munich (German: T.S.V. 1860 München, Bavarian: TSV 1860 Minga) also known as Sechzig (German: Sechzig, Bavarian: Sechzga, 'sixty') is a football club which plays in the second-division tier German Fußball-Bundesliga. ==History== The club was founded in 1860, the football section was founded on 25 April 1899. The first match they played was 1902 versus 1. Münchner FC 1896. The match was lost 2:4. 1911 they built a football field on the Grünwalder Straße. In 1926 a stadium was built which offered 40 000 places. 1931 the team reached the final of the championship for the first time but was beaten by Hertha BSC with 3:2. During the Nazi rule in Germany 1860 München had close relations to the Nazi government.Anton Löffelmeier: Die „Löwen“ unterm Hakenkreuz: Der TSV von 1860 München im Nationalsozialismus. Verlag Die Werkstatt, 2009, In 1963 the club was one of the founders of the German Bundesliga. 1964 they won the German Cup. That year they also reached the final of the UEFA Cup winners cup but lost toWest Ham United. In the 1964/65 season they became for the first and last time German football champion. Till today they often played in the second league but sometimes in the Bundesliga. ==Ground== TSV 1860 München plays in the Allianz Arena which they share with their rival Bayern München. If they play the skin of the Arena is blue. Originally they played at the Grünwalder Straße which they also shared with Bayern between 1925 and 1972. ===Current squad=== ==Notable players== *Rudi Brunnenmeier scored between 1960 and 1968 139 goals in the Bundesliga. *Peter Grosser was captain of the championsquads and played two times in Germanys national football team. *Bernd Patzke was member of Germanys squad for the FIFA World Cup in 1966. *Petar Radenković was goalkeeper in the 1960s and is known for his \"trips\" to the opponents penalty area. *Harald Cerny is with 263 league matches record holder for TSV 1860. *Thomas Häßler was member of the German national football team. ==Honours== ===League=== * German championship (Bundesliga) ** Champions: 1966 ** Runners-up: 1931, 1967 * Oberliga Süd (I) ** Champions: 1963 * Gauliga Bayern (I) ** Champions: 1941, 1943 * 2nd Bundesliga Süd (II) ** Champions: 1979 ** Runners-up: 1977 * 2nd Oberliga Süd (II) ** Champions: 1955, 1957 * Bayernliga (III) ** Champions: 1984, 1991, 1993 **Runners-up: 1986, 1990 == League position == Season League Position 2000/01 Bundesliga 11th 2001/02 Bundesliga 9th 2002/03 Bundesliga 10th 2003/04 Bundesliga 17th 2004/05 2. Bundesliga 4th 2005/06 2. Bundesliga 13th 2006/07 2. Bundesliga 8th 2007/08 2. Bundesliga 11th 2008/09 2. Bundesliga 12th === Former position === == References == Category:1860 establishments in Europe Category:1860s establishments in Germany Category:Football clubs in Bavaria Category:Football in Munich Category:Organizations based in Munich",
 "title": "TSV 1860 Munich"
}