{
 "id": "190930",
 "text": "{{Infobox Writer | name =Alfred Tennyson | image = Alfred Lord Tennyson 1869.jpg | image_size = 240px | caption =1869 Carbon print by Julia Margaret Cameron | birth_date = | birth_place = Somersby, Lincolnshire, England, UK | death_date = | death_place = Haslemere, Surrey, England | occupation = Poet laureate | resting_place = Westminster Abbey | movement = | website = }} Alfred Tennyson, 1st Baron Tennyson, FRS (6 August 1809 – 6 October 1892) was Poet Laureate of the United Kingdom in the Victorian era. He remains one of the most popular poets in the English language. Tennyson was excellent at writing short lyrics like In the valley of Cauteretz, Break, break, break, The Charge of the Light Brigade, Tears, idle tears and Crossing the Bar. Much of his verse like The Lotus Eaters was based on classical mythological themes. Tennyson also wrote some notable blank verse including Idylls of the King, Ulysses, and Tithonus. During his career, Tennyson attempted drama, but his plays were not very successful. == Red in tooth and claw == In Memoriam A.H.H. was a poem by Tennyson, written in memory of his best friend Arthur Hallam. Hallam was a fellow poet and classmate at Trinity College, Cambridge. He had been engaged to Tennyson's sister, but died from a cerebral hemorrhage before they could get married. The poem was published after Tennyson had read a pro-evolution book by Robert Chambers. The fundamentalist idea of Biblical inerrancy was in conflict with science. Tennyson expressed the difficulties evolution raised for faith in \"the truths that never can be proved\". The poem is too long to quote in full, but this shows how he was thinking of the living world: :Are God and Nature then at strife, :That Nature lends such evil dreams? :So careful of the type she seems, :So careless of the single life; :That I, considering everywhere :Her secret meaning in her deeds, :And finding that of fifty seeds :She often brings but one to bear. The much-quoted phrase comes soon after, in section 56. It refers to humanity: :Who trusted God was love indeed :And love Creation's final law :Tho' Nature, red in tooth and claw :With ravine, shriek'd against his creed. The phrase Nature, red in tooth and claw was taken up as a metaphor for life in general, even before Darwin's Origin of species was published. == Tis better to have loved and lost... == The poem has another, perhaps even better-known stanza: :I hold it true, whate'er befall; :I feel it when I sorrow most; : 'Tis better to have loved and lost :Than never to have loved at all. == References == 2\\. DGM News \"The Life and Works \". Category:1809 births Category:1892 deaths Category:English poets Category:United Kingdom Barons Category:People from Lincolnshire Category:People buried in Westminster Abbey Category:British poets laureate",
 "title": "Alfred, Lord Tennyson"
}