{
 "id": "191060",
 "text": "Creed is an American christian rock band from Florida. The members of this band were vocalist Scott Stapp, guitar player Mark Tremonti, drum player Scott Phillips, and bass guitar player Brian Marshall. ==History== ===My Own Prison (1997-1998)=== Creed released an album in 1997, called My Own Prison. It sold over 1 million copies. ===Human Clay (1999-2000)=== In 1999, they released the album Human Clay. Popular songs from that album were Higher and With Arms Wide Open. ===Weathered, controversial concert and hiatus (2001-2003)=== They released another album in 2001, called Weathered. The song My Sacrifice from the album was the most successful. The December 29, 2002 concert at the Allstate Arena in Rosemont, Illinois is the reason the band went on a hiatus then broke up the first time back in 2004. ===first break-up, Alter Bridge, reunion, Full Circle and second break-up (2004-2012)=== In 2004, they split up. Tremonti, Phillips and Marshall helped start a new band called Alter Bridge. Creed got back together in 2009. The released a new album called Full Circle. They split up again in 2012. ===Second reunion (2023–present)=== On July 19, 2023, the band announced that they had reunited and would be headlining the Summer of '99 cruise in April 2024. ==Awards and nominations== ;Grammy Awards The Grammy Awards are awarded annually by the National Academy of Recording Arts and Sciences of the United States. Creed has won one award out of three nominations. Year Nominated work Award Result 2001 \"With Arms Wide Open\" Best Rock Performance by a Duo or Group with Vocal Best Rock Song 2003 \"My Sacrifice\" Best Rock Performance by a Duo or Group with Vocal ;American Music Awards The American Music Awards is an annual music awards ceremony in the United States. Creed has received four American Music Award from six nominations. Year Nominated work Award Result 2001 Creed Favorite Alternative Artist Favorite Pop/Rock Band/Duo/Group Human Clay Favorite Pop/Rock Album 2003 Creed Favorite Alternative Artist Favorite Pop/Rock Band/Duo/Group Fan Choice Award ;MTV Video Music Awards The MTV Video Music Awards are presented annually by MTV. They honor accomplishments in the music video medium. Creed has received two nominations. Year Nominated work Award Result 2000 \"Higher\" Best Rock Video 2002 \"My Sacrifice\" ==Discography== ;Studio albums * My Own Prison (1997) * Human Clay (1999) * Weathered (2001) * Full Circle (2009) ==Notes== ==References== Category:1994 establishments in the United States Category:1990s American music groups Category:1990s establishments in Florida Category:2000s American music groups Category:2010s American music groups Category:2012 disestablishments in the United States Category:American rock bands Category:American heavy metal bands Category:Musical groups established in 1994 Category:Musical groups disestablished in 2012 Category:Musical groups from Florida Category:People from Tallahassee, Florida Category:Christian rock bands Category:Post-grunge bands Category:American Music Awards",
 "title": "Creed (band)"
}