{
 "id": "191316",
 "text": "Deborah Ann \"Debby\" Ryan (born May 13, 1993, in Huntsville, Alabama) is an American actress, singer, and songwriter. She is best known for her role as Bailey in The Suite Life on Deck and the titular character in Jessie (2011 TV series) . == Career == Debby Ryan is known as Bailey Pickett on The Suite Life on Deck. She has an older brother Chris Ryan who has an alternative rock band. She loves to hang with friends and says, she could not be happier. She is a singer, her main music genres are alternative rock, country music. She was set to perform on a tour in the summer of 2009, but was cancelled due to schedule conflicts. She is set to star as Kimberly in What If. And is Abby Jenson on 16 Wishes. Ryan is also known for her role in \"Longshots\". She is a singer, as shown above, and she was scheduled to release her new single, \"Adios\" on the Terrific Teen Tour, but the tour had been cancelled. She said it would be her \"big break\" in her singing career, and she has many fans out there who support her through everything. She stars in the Disney Channel Original Movie \"Radio Rebel\" as Tara the Radio Rebel. This movie has only just aired in the UK but has aired in the US for a long time. She also stars in the Disney Channel show, Jessie. Ryan plays as a nanny named Jessie. ==Awards and nominations== Year Award Category Work Result Ref. 2008 Celebrity Love Awards Favorite Actress The Suite Life on Deck 2009 Celebrity Love Awards Favorite Actress The Suite Life on Deck 2009 Poptastic Awards Favorite Television Actress The Suite Life on Deck 2009 Poptastic Awards Female Newcomer The Suite Life on Deck 2010 Celebrity Love Awards Favorite Actress The Suite Life on Deck 2010 Hollywood Teen TV Awards Teen Pick Actress: Comedy The Suite Life on Deck Hollywood Teen TV Awards hollywoodtentv.com. Accessed July 13, 2010. 2010 Body Peace Award Outstanding Advocate The Suite Life on Deck 2010 Jetix Awards Best Television Star The Suite Life on Deck 2010 Poptastic Awards TV Actress The Suite Life on Deck 2010 Nickelodeon UK Kids' Choice Awards Best Television Actress The Suite Life on Deck 2010 Italy Kids Choice Awards Favorite TV Star The Suite Life on Deck 2010 Italy Kids Choice Awards Favorite International Star The Suite Life on Deck 2011 Young Artist Award Best Performance in a TV Movie, Miniseries or Special Leading or Supporting Young Actress 16 Wishes Young Artist Awards youngartistawards.org/. Accessed February 19, 2011. 2012 Popstar Awards TV Actress Jessie 2012 Popstar Awards Female Style Idol Herself 2012 Teen Icon Awards \"Iconic Heart\" Herself 2014 Kids' Choice Awards Favorite TV Actress Jessie 2014 Teen Choice Awards Choice TV Actress: Comedy Jessie 2015 Kids' Choice Awards Favorite TV Actress Jessie == References == == Other websites == * *Debby Ryan at the Internet Movie Database Category:1993 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American child actors Category:Singers from Huntsville, Alabama Category:American guitarists Category:Disney actors Category:Disney singers Category:Writers from Huntsville, Alabama Category:Musicians from Huntsville, Alabama Category:Actors from Huntsville, Alabama",
 "title": "Debby Ryan"
}