{
 "id": "191549",
 "text": "The 2009 Formula One season was the 60th FIA Formula One World Championship season. There were ten teams signed up to compete in the championship. Jenson Button became the Drivers' World Champion and Brawn GP won the Constructors' title. The season was scheduled to take place over 17 rounds, and started with the Australian Grand Prix on 29 March 2009. It would end on 1 November 2009 with the Abu Dhabi Grand Prix, which was included on the race calendar for the first time, to be held at the new Yas Marina Circuit. The French and Canadian Grands Prix, which were both included in the 2008 championship, have been dropped. Several rule changes will be implemented by the FIA, in a bid to cut costs due to the global financial crisis and to improve the on-track spectacle. New rules governing tyres, aerodynamics and Kinetic Energy Recovery Systems (KERS), among others, are some of the biggest changes in the Formula One regulations for several decades. FIA initially declared a change in deciding the World Driver's Championship, with the driver winning the most races to be declared as the champion. However, this decision was later reversed following protests from Formula One Teams Association. ==Teams and drivers== Team Constructor Chassis Engine Tyre No. Race Drivers Vodafone McLaren-Mercedes McLaren MP4-24 Mercedes-Benz FO 108W 2.4 V8 1 Lewis Hamilton Vodafone McLaren-Mercedes McLaren MP4-24 Mercedes-Benz FO 108W 2.4 V8 2 Heikki Kovalainen Scuderia Ferrari Marlboro Ferrari F60 Ferrari Type 056 2.4 V8 3 Felipe Massa Scuderia Ferrari Marlboro Ferrari F60 Ferrari Type 056 2.4 V8 3 Luca Badoer Scuderia Ferrari Marlboro Ferrari F60 Ferrari Type 056 2.4 V8 3 Giancarlo Fisichella Scuderia Ferrari Marlboro Ferrari F60 Ferrari Type 056 2.4 V8 4 Kimi Räikkönen BMW Sauber F1 Team BMW Sauber F1.09 BMW P86/9 2.4 V8 5 Robert Kubica BMW Sauber F1 Team BMW Sauber F1.09 BMW P86/9 2.4 V8 6 Nick Heidfeld ING Renault F1 Team Renault F1 Team Renault R29 Renault RS27 2.4 V8 7 Fernando Alonso ING Renault F1 Team Renault F1 Team Renault R29 Renault RS27 2.4 V8 8 Nelson Piquet Jr. ING Renault F1 Team Renault F1 Team Renault R29 Renault RS27 2.4 V8 8 Romain Grosjean Panasonic Toyota Racing Toyota TF109 Toyota RVX-09 2.4 V8 9 Jarno Trulli Panasonic Toyota Racing Toyota TF109 Toyota RVX-09 2.4 V8 10 Timo Glock Panasonic Toyota Racing Toyota TF109 Toyota RVX-09 2.4 V8 10 Kamui Kobayashi Scuderia Toro Rosso Toro Rosso STR4 Ferrari Type 056 2.4 V8 11 Sébastien Bourdais Scuderia Toro Rosso Toro Rosso STR4 Ferrari Type 056 2.4 V8 11 Jaime Alguersuari Scuderia Toro Rosso Toro Rosso STR4 Ferrari Type 056 2.4 V8 12 Sébastien Buemi Red Bull Racing Red Bull RB5 Renault RS27 2.4 V8 14 Mark Webber Red Bull Racing Red Bull RB5 Renault RS27 2.4 V8 15 Sebastian Vettel AT&T; Williams Williams FW31 Toyota RVX-09 2.4 V8 16 Nico Rosberg AT&T; Williams Williams FW31 Toyota RVX-09 2.4 V8 17 Kazuki Nakajima Force India Formula One Team Force India VJM02 Mercedes FO 108W 2.4 V8 20 Adrian Sutil Force India Formula One Team Force India VJM02 Mercedes FO 108W 2.4 V8 21 Giancarlo Fisichella Force India Formula One Team Force India VJM02 Mercedes FO 108W 2.4 V8 21 Vitantonio Liuzzi Brawn GP F1 Team Brawn BGP 001 Mercedes FO 108W 2.4 V8 22 Jenson Button Brawn GP F1 Team Brawn BGP 001 Mercedes FO 108W 2.4 V8 23 Rubens Barrichello ==Formula One 2009 Race Calendar== Round Official Race Title Grand Prix Circuit Date Time Local UTC 1 ING Australian Grand Prix Australian GP Melbourne Grand Prix Circuit 29 March 17:00 06:00 2 Petronas Malaysian Grand Prix Malaysian GP Sepang International Circuit, Kuala Lumpur 5 April 17:00 09:00 3 Chinese Grand Prix Chinese GP Shanghai International Circuit 19 April 15:00 07:00 4 Gulf Air Bahrain Grand Prix Bahrain GP Bahrain International Circuit, Sakhir, Manama 26 April 15:00 12:00 5 Gran Premio de España Telefónica Spanish GP Circuit de Catalunya, Barcelona 10 May 14:00 12:00 6 Grand Prix de Monaco Monaco GP Circuit de Monaco, Monte Carlo 24 May 14:00 12:00 7 ING Turkish Grand Prix Turkish GP Istanbul Park 7 June 15:00 12:00 8 Santander British Grand Prix British GP Silverstone Circuit 21 June 13:00 12:00 9 Großer Preis Santander von Deutschland German GP Nürburgring 12 July 14:00 12:00 10 ING Magyar Nagydíj Hungarian GP Hungaroring, Budapest 26 July 14:00 12:00 11 Telefónica Grand Prix of Europe European GP Valencia Street Circuit 23 August 14:00 12:00 12 ING Belgian Grand Prix Belgian GP Circuit de Spa-Francorchamps, Spa 30 August 14:00 12:00 13 Gran Premio Santander d'Italia Italian GP Autodromo Nazionale Monza 13 September 14:00 12:00 14 SingTel Singapore Grand Prix Singapore GP Marina Bay Street Circuit 27 September 20:00 12:00 15 Fuji Television Japanese Grand Prix Japanese GP Suzuka Circuit, Suzuka 4 October 14:00 05:00 16 Grande Prêmio Petrobras do Brasil Brazilian GP Autódromo José Carlos Pace, São Paulo 18 October 14:00 16:00 17 Etihad Airways Abu Dhabi Grand Prix Abu Dhabi GP Yas Marina Circuit 1 November 17:00 13:00 ==Results and standings== ===Grands Prix=== Rd. Grand Prix Pole position Fastest lap Winning driver Winning constructor Report 1 Australian Grand Prix Jenson Button Nico Rosberg Jenson Button Brawn-Mercedes Report 2 Malaysian Grand Prix Jenson Button Jenson Button Jenson Button Brawn-Mercedes Report 3 Chinese Grand Prix Sebastian Vettel Rubens Barrichello Sebastian Vettel Red Bull-Renault Report 4 Bahrain Grand Prix Jarno Trulli Jarno Trulli Jenson Button Brawn-Mercedes Report 5 Spanish Grand Prix Jenson Button Rubens Barrichello Jenson Button Brawn-Mercedes Report 6 Monaco Grand Prix Jenson Button Felipe Massa Jenson Button Brawn-Mercedes Report 7 Turkish Grand Prix Sebastian Vettel Jenson Button Jenson Button Brawn-Mercedes Report 8 British Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 9 German Grand Prix Mark Webber Fernando Alonso Mark Webber Red Bull- Renault Report 10 Hungarian Grand Prix Fernando Alonso Mark Webber Lewis Hamilton McLaren-Mercedes Report 11 European Grand Prix Lewis Hamilton Timo Glock Rubens Barrichello Brawn-Mercedes Report 12 Belgian Grand Prix Giancarlo Fisichella Sebastian Vettel Kimi Räikkönen Ferrari Report 13 Italian Grand Prix Lewis Hamilton Adrian Sutil Rubens Barrichello Brawn-Mercedes Report 14 Singapore Grand Prix Lewis Hamilton Fernando Alonso Lewis Hamilton McLaren- Mercedes Report 15 Japanese Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault Report 16 Brazilian Grand Prix Rubens Barrichello Mark Webber Mark Webber Red Bull-Renault Report 17 Abu Dhabi Grand Prix Lewis Hamilton Sebastian Vettel Sebastian Vettel Red Bull-Renault Report ===Drivers=== {| class=\"wikitable\" style=\"font-size:85%; text-align:center;\" Pos Driver AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU Points 1 Jenson Button 1 1 3 1 1 1 1 6 5 7 7 Ret 2 5 8 5 3 95 2 Sebastian Vettel 13† 15† 1 2 4 Ret 3 1 2 Ret Ret 3 8 4 1 4 1 84 3 Rubens Barrichello 2 5 4 5 2 2 Ret 3 6 10 1 7 1 6 7 8 4 77 4 Mark Webber 12 6 2 11 3 5 2 2 1 3 9 9 Ret Ret 17 1 2 69.5 5 Lewis Hamilton DSQ 7 6 4 9 12 13 16 18 1 2 Ret 12† 1 3 3 Ret 49 6 Kimi Räikkönen 15† 14 10 6 Ret 3 9 8 Ret 2 3 1 3 10 4 6 12 48 7 Nico Rosberg 6 8 15 9 8 6 5 5 4 4 5 8 16 11 5 Ret 9 34.5 8 Jarno Trulli 3 4 Ret 3 Ret 13 4 7 17 8 13 Ret 14 12 2 Ret 7 32.5 9 Fernando Alonso 5 11 9 8 5 7 10 14 7 Ret 6 Ret 5 3 10 Ret 14 26 10 Timo Glock 4 3 7 7 10 10 8 9 9 6 14 10 11 2 DNS 24 11 Felipe Massa Ret 9 Ret 14 6 4 6 4 3 DNS 22 12 Ralf Schumacher 4 6 5 12 Ret Ret 14 Ret 8 5 4 6 6 7 11 12 4 25 13 Nick Heidfeld 10 2 12 19 7 11 11 15 10 11 11 5 7 Ret 6 Ret 5 19 14 Robert Kubica 14† Ret 13 18 11 Ret 7 13 14 13 8 4 Ret 8 9 2 10 17 15 Giancarlo Fisichella 11 18† 14 15 14 9 Ret 10 11 14 12 2 9 13 12 10 16 8 16 Sébastien Buemi 7 16† 8 17 Ret Ret 15 18 16 16 Ret 12 13† Ret Ret 7 8 6 17 Adrian Sutil 9 17 17† 16 Ret 14 17 17 15 Ret 10 11 4 Ret 13 Ret 17 5 18 Kamui Kobayashi PO 9 6 3 19 Sébastien Bourdais 8 10 11 13 Ret 8 18 Ret Ret 2 20 Heikki Kovalainen Ret 12 Ret Ret 13 15† 12 11 12 9 18 13 10 9 15 Ret 13 22 21 Nelson Piquet, Jr. Ret 13 16 10 12 Ret 16 12 13 12 0 22 Vitantonio Liuzzi Ret 14 14 11 15 0 23 Romain Grosjean 15 Ret 15 Ret 16 13 18 0 24 Jaime Alguersuari 15 16 Ret Ret Ret Ret 14 Ret 0 25 Luca Badoer 15 14 0 Pos Driver AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU Points Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. Half points were awarded at the Malaysian as less than 75% of the scheduled distance was completed. ===Constructors=== {| class=\"wikitable\" style=\"font- size:85%; text-align:center;\" Pos Constructor Car No. AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU Points 1 Brawn-Mercedes 22 1 1 3 1 1 1 1 6 5 7 7 Ret 2 5 8 5 3 172 23 2 5 4 5 2 2 Ret 3 6 10 1 7 1 6 7 8 4 2 Red Bull-Renault 14 12 6 2 11 3 5 2 2 1 3 9 9 Ret Ret 17 1 2 153.5 15 13 15 1 2 4 Ret 3 1 2 Ret Ret 3 8 4 1 4 1 3 McLaren- Mercedes 1 DSQ 7 6 4 9 12 13 16 18 1 2 Ret 12† 1 3 3 Ret 71 2 Ret Ret 5 12 Ret Ret 14 Ret 8 5 4 6 6 7 11 12 11 4 Ferrari 3 Ret 9 Ret 14 6 4 6 4 3 DNS 17 14 9 13 12 10 16 70 4 15 14 10 6 Ret 3 9 8 Ret 2 3 1 3 10 4 6 12 5 Toyota 9 3 4 Ret 3 Ret 13 4 7 17 8 13 Ret 14 12 2 Ret 7 59.5 10 4 3 7 7 10 10 8 9 9 6 14 10 11 2 DNS 9 6 6 BMW Sauber 5 14 Ret 13 18 11 Ret 7 13 14 13 8 4 Ret 8 9 2 10 36 6 10 2 12 19 7 11 11 15 10 11 11 5 7 Ret 6 Ret 5 7 Williams-Toyota 16 6 8 15 9 8 6 5 5 4 4 5 8 16 11 5 Ret 9 34.5 17 Ret 12 Ret Ret 13 15 12 11 12 9 18 13 10 9 15 Ret 13 8 Renault 7 5 11 9 8 5 7 10 14 7 Ret 6 Ret 5 3 10 Ret 14 26 8 Ret 13 16 10 12 Ret 16 12 13 12 15 Ret 15 Ret 16 13 18 9 Force India-Mercedes 20 9 17 17 16 Ret 14 17 17 15 Ret 10 11 4 Ret 13 Ret 17 13 21 11 18 14 15 14 9 Ret 10 11 14 12 2 Ret 14 14 11 15 10 Toro Rosso-Ferrari 11 8 10 11 13 Ret 8 18 Ret Ret 15 16 Ret Ret Ret Ret 14 Ret 8 12 7 16 8 17 Ret Ret 15 18 16 16 Ret 12 13 Ret Ret 7 8 Pos Constructor Car No. AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU Points ==References== ==Other websites== * Official Formula One website Category:Formula One seasons Category:2009 in sports",
 "title": "2009 Formula One World Championship"
}