{
 "id": "191663",
 "text": "Henry Alfred Wolfgang Kissinger (born Heinz Alfred Wolfgang Kissinger; May 27, 1923 – November 29, 2023), , was a German-American political scientist, diplomat, and winner of the Nobel Peace Prize. He served as both National Security Advisor and later as Secretary of State in the Nixon Administration and the Ford Administration. ==Early life== Kissinger was born in Germany in 1923. As a German Jew, it was not safe for him to stay in Germany after Adolf Hitler came to power, and he left for the United States in 1933. He fought for the US against the Nazis in World War II. ==Nixon administration== Kissinger was Richard Nixon's most trusted advisor on foreign affairs. He was in government during the Cold War and promoted what he called \"realpolitik\" in dealing with the Soviet Union and Communist China. He was a major force behind the 1973 ceasefire in the Vietnam War. Under Kissinger, the US opened up relations to China, which is considered one of his biggest successes. He also supported détente, an easing of the rivalry with the Soviets. ==Nobel Prize== Kissinger and Lê Đức Thọ were jointly offered the 1973 Nobel Peace Prize for their work on the Paris Peace Accords which lead to the withdrawal of American forces from the Vietnam War. Lê Đức Thọ declined to accept the award saying that peace had not actually been achieved in Vietnam. Kissinger donated his prize money to charity, did not attend the award ceremony and later offered to return his prize medal after the fall of South Vietnam to North Vietnamese forces 18 months later. ==Later years== In his later years, Kissinger — along with William Perry, Sam Nunn, and George Shultz — called upon governments to reduce nuclear weapons, and in three Wall Street Journal articles proposed a program of urgent steps to that end. The four have created the Nuclear Security Project to advance this cause.Maclin, Beth (2008-10-20) \"A Nuclear weapon-free world is possible, Nunn says\", Belfer Center, Harvard University. Retrieved on 2008-10-21. Kissinger died at the age of 100 on November 29, 2023, at his home in Kent, Connecticut. The cause of death was congestive heart failure. ==Legacy== His legacy is often debated by historians. Some people criticize him, even calling him a criminal, for his tactics during the Cold War, notably supporting a military junta in Chile and backing Pakistan during the Bangladesh War. Many people, however, consider Kissinger a great figure in modern American history who ended the Vietnam War, opened up China, and supported peace in the Cold War. == References == ==Other websites== *Annotated Bibliography for Henry Kissinger from the Alsos Digital Library for Nuclear Issues *Official Website of Henry A. Kissinger * *\"Charlie Rose\" A conversation with Henry Kissinger, December 16, 2008 *Henry Kissinger speaks at the Asia Society, NYC, February 2007 *Kissinger's political donations *NPR: Kissinger Speech at National Press Club . Towards the end [55:55], he responds to Hitchens. Category:1923 births Category:2023 deaths Category:20th-century American politicians Category:American autobiographers Category:American centenarians Category:American military personnel of World War II Category:American Nobel Prize winners Category:American political scientists Category:Chancellors of the College of William & Mary Category:German Jews Category:Harvard University alumni Category:Jewish American politicians Category:Jewish American writers Category:Jewish centenarians Category:Jewish Nobel Prize winners Category:Naturalized citizens of the United States Category:Nobel Peace Prize winners Category:People of the Vietnam War Category:Politicians from Bavaria Category:Republicans (United States) Category:Time People of the Year Category:United States Secretaries of State Category:German Nobel Prize winners Category:Deaths from congestive heart failure Category:Burials at Arlington National Cemetery",
 "title": "Henry Kissinger"
}