{
 "id": "191713",
 "text": "Microsoft Bing (or just Bing) is a search engine. It used to be called Windows Live Search and MSN Search. Microsoft calls it a \"decision engine\", meaning that Bing tries to interpret search queries and give people better search results compared to a typical search engine, helping the user make better decisions. Bing concentrates on four major areas: shopping, travel, local and health. A preview version was made available for everyone to use on June 1, 2009, and the website was fully launched on June 3, 2009. The website quickly became popular after a few weeks. On July 29, 2009, Microsoft and Yahoo! announced that Bing would power Yahoo! Search.Microsoft and Yahoo seal web deal. All Yahoo! Search global customers and partners will be shifted to Bing by early 2012.\"When will the change happen? How long will the transition take?\", help.yahoo.com, March 23, 2011 In October 2011, Microsoft announced \"Tiger\", a new internal search computer program for Bing. When it was finished, Bing delivered faster and more relevant search results for users. It has been incorporated into Bing since August 2011.\"Bing Unleashing Tiger to Speed Search Results\", Search Engine Watch, October 3, 2011 On February 7, 2023, Microsoft launched a preview version of its Bing search engine, which is powered by OpenAI's artificial intelligence model. The new version of Bing is called \"the new Bing\" and is customized for search. It includes a chatbot called Microsoft Copilot. == Features == Bing includes the listing of search suggestions as queries are entered. It lists related searches (called \"Explore pane\") based on semantic technology from Powerset that Microsoft purchased in 2008. Every day, Bing.com displays a different picture that users can click on parts of to learn more about. These pictures can be about different places around the world, or nature, or even sometimes things in outer space. === Media features === * Video thumbnail Preview where, by hovering over a video thumbnail, the video automatically starts playing * Image search with continuous scrolling images results page that has adjustable settings for size, layout, color, style and people.Limit Image Results to Color or Black and White Images . * Video search with adjustable setting for length, screen size, resolution and source == References == == Other websites == * Bing * Bing for Mobile * Discover Bing * Decision Engine * Bing Community * Bing Webmaster Center * Bing Developer Center Category:2009 establishments in the United States Category:Microsoft websites Category:American search engines",
 "title": "Microsoft Bing"
}