{
 "id": "192000",
 "text": "Buxton is a spa town in Derbyshire, England. It is the highest market town in England.Buxton - in pictures, BBC Radio Derby, accessed July 2009 Buxton is near to Cheshire and Staffordshire. Buxton is described as \"the gateway to the Peak District National Park\". Buxton is also close to Manchester. Poole's Cavern, a limestone cavern, and St Ann's Well are in Buxton. Also in the town is an Opera House. ==History== The Romans developed the town when it was called Aquae Arnemetiae (or the spa of the goddess of the grove). Roman coins have been found in Buxton.About Buxton , History of Buxton, accessed June 2009 The town largely grew in importance in the late 18th century when it was developed by the Dukes of Devonshire, with a second revival a hundred years later as the people visited to use the healing properties of the waters. The Dukes of Devonshire have been helping Buxton since 1780, when the Duke used his money from his copper mines to develop the town as a spa like Bath. Bess of Hardwick had taken one of her four husbands, the Earl of Shrewsbury, to \"take the waters\" at Buxton shortly after he became the jailer of Mary, Queen of Scots, in 1569. Dr. Erasmus Darwin recommended the waters at Buxton to Josiah Wedgwood. The Wedgwood family often went to Buxton on holiday. Two of Charles Darwin's half-cousins, Edward Levett Darwin and Reginald Darwin also settled there.Darwin, Charles, Frederick Burkhardt and Sydney Smith. The Correspondence of Charles Darwin, Cambridge University Press, Cambridge, 1985 ==Notable architecture== *The Crescent (1780–1784) was based on Bath's Royal Crescent. The crescent has a grand assembly room with a painted ceiling. *Buxton Opera House was designed in 1903 and is the highest in the country. It is attached to the Pavilion Gardens, Octagonal Hall and the smaller Paxton Theatre. The Pavilion Gardens are 23 acres of gardens. ==Economy== Buxton is twinned with two other towns—Oignies in France and Bad Nauheim in Germany. ==Famous Buxtonians== *Vera Brittain (1893–1970): author of Testament of Youth and mother of Shirley Williams *Tim Brooke-Taylor: comedy actor and one of The Goodies *Dave Lee Travis: former BBC DJ ==References== Category:Spa towns in the United Kingdom Category:Towns in Derbyshire",
 "title": "Buxton"
}