{
 "id": "192001",
 "text": "Alice's Adventures in Wonderland by Lewis Carroll is an 1865 childrens’ story written by Charles Dodgson and illustrated by John Tenniel. Dodgson used Lewis Carroll as a pen name when writing poetry and fiction. The story is more well known as Alice in Wonderland and is the basis for many adaptations in films, art and music. One of the very commonly used phrases today - “down the rabbit hole” - comes from the beginning of the story. Alice is a young girl who, while falling asleep outside on a golden afternoon, sees a white rabbit and follows it into a rabbit hole. When she falls down the rabbit hole, she begins her fantastical adventures in Wonderland. Her adventures include distortions of time and proportion. Throughout the story she shrinks and grows repeatedly as she meets characters of all kinds and sizes, including the iconic Caterpillar who asks “Who are you?” and Cheshire Cat who asks her “Where do you want to go?” ==Characters== * Alice (main character) * The White Rabbit (always in a hurry) * Dodo (stupid bird) * Caterpillar (VERY wise and old) * The Duchess * Her Cook * Cheshire Cat (knows the way through the wicked forest) * Mad Hatter (funny and crazy as it seems, likes tea very much) * March Hare (friend of the Mad hatters) * Dormouse (friend of the Mad hatters) * King, Queen, and Knave of Hearts (queen of heats and her guards with her husband) * Mock turtle * Dinah (Alice's cat) == Story == The story starts with Alice sitting with her sister beside a lake. Suddenly, a white rabbit runs by. Alice runs after him. She finds his rabbit hole. She falls through the hole. She meets many characters underground and has some amazing adventures. She grows larger or smaller by eating different things like cakes and mushrooms. At the end, she enters a lovely garden. The Knave of Hearts is charged with stealing some tarts. A trial is held. Alice thinks the trial is ridiculous. She says so. Everyone is offended. There is a great commotion. Alice suddenly wakes up. She is back where she started, sitting with her sister beside the lake. ==Background== The story was told on a summer outing to three little girls. One of them was named Alice Liddell. Alice asked Dodgson to write the story down. Dodgson accepted the task. It took two years. The story was first called Alice's Adventures Under Ground. When Dodgson prepared the Alice story for publication, he added more events, such as the Mad Hatters's Tea Party, new characters, such as the Cheshire Cat, and changed the title to Alice's Adventures in Wonderland. The story was so popular that Dodgson, (under the pen name Lewis Carroll), wrote a sequel called Through the Looking-Glass. The Alice stories, often known as Alice in Wonderland, are popular in music, movies and plays. ==Adaptations== The book has been adapted many times to movies and television. These adaptations include: * Tim Burton's 2010 movie version, Alice in Wonderland, starring Johnny Depp, Mia Wasikowska, Anne Hathaway, and Helena Bonham Carter. * Director Jonathan Miller's 1962 version with Anne-Marie Mallik as Alice, Finlay Currie as Dodo, Sir Michael Redgrave as Caterpillar, and John Gielgud as Mock Turtle * Disney's 1951 animated movie Alice in Wonderland with Kathryn Beaumont voicing Alice ==Other websites== * Text with illustrations at the University of Adelaide Category:Books by Lewis Carroll Category:1865 books",
 "title": "Alice's Adventures in Wonderland"
}