{
 "id": "192019",
 "text": "Douglas Robert Jardine (Bombay, Indian Empire 1900 – Montreux, Switzerland 1958) was an English cricketer and captain of the England cricket team from 1931 to 1933–34.When describing cricket seasons, the convention used is that a single year represents an English cricket season, while two years (e.g. 1933–34) represent a southern hemisphere cricket season because it takes place over two calendar years (e.g. September to February). A right-handed batsman, he played 22 Test matches for England, captaining the side in 15 matches, winning nine, losing one and drawing five. == The 'bodyline' tour == Jardine is best known for captaining the English team during the 1932–33 Ashes tour of Australia. There, his team used 'bodyline' tactics against Donald Bradman and other opposing Australian batsmen. A bodyline delivery was one where the cricket ball was pitched short so as to rise towards the body of the opposing batsman on the line of the leg stump. The plan was to get legside deflections that could be caught by one of several fielders on the leg side. This tactic was considered by many to be intimidatory and physically threatening. Jardine is widely regarded by commentators and writers as the person responsible for that strategy.Frith, David 2002. Bodyline autopsy: the full story of the most sensational Test cricket series: Australia v England 1932–33. London: Aurum Press. The spearhead of the England attack was the coal miner's son Harold Larwood, the fastest bowler of the day.Hamilton, Duncan 2009. Harold Larwood. London: Quercus. Larwood's partner was Bill Voce, also a top-class fast bowler. Ranged against them was the great Don Bradman, then averaging over 100 in Test matches. A controversial figure among cricketers, Jardine was well known for his dislike of Australian players and crowds. In return, he was unpopular in Australia, for his manner and the bodyline strategy. Many of his players thought him an excellent captain, though not everyone thought him as good at managing people. == Career in WWII == Jardine joined the British Army in August 1939. Once World War II began, he was commissioned into the Royal Berkshire Regiment and went with the British Expeditionary Force to France. He served at Dunkirk, where he was fortunate to escape but suffered some injuries.Douglas, Christopher (2002). Douglas Jardine: Spartan cricketer. London: Methuen, p201/3. After serving as staff captain at St. Albans, he was posted to India for the remainder of the war. He served in Quetta, and then Simla, as a major. He became fluent in the Hindustani language. He gave lectures and played some cricket while in India. He left the army in 1945. == References == Category:1900 births Category:1958 deaths Category:British military personnel of World War II Category:English and Welsh cricketers Category:Majors in the British Army Category:British Indian Army officers",
 "title": "Douglas Jardine"
}