{
 "id": "192880",
 "text": "{{Infobox settlement | name = Luxembourg | native_name = | other_name = | settlement_type = Province of Belgium | image_flag = Official flag of the Arelerland.svg | flag_size = 120x80px | image_shield = Coat of arms of the Province of Luxembourg.svg | shield_size = 100x90px | coordinates = | image_map = Province de Luxembourg in Belgium.svg | subdivision_type = Country | subdivision_name = | subdivision_type1 = Region | subdivision_name1 = | seat_type = Capital | seat = Arlon | leader_title = Governor | leader_name = Olivier Schmitz | area_total_km2 = 4459 | area_footnotes = | population_total = 291,143 | population_footnotes = | population_as_of = 1 January 2022 | population_density_km2 = 65 | blank_name_sec2 = HDI (2019) | blank_info_sec2 = 0.899 · 10th of 11 | website = }} Luxembourg Official name is Province de Luxembourg (French). (, , , , ) is the southernmost province of Belgium and Wallonia. The capital is Arlon, in the southeast of the province. The province is also called \"Belgian Luxembourg\" and should not be confused with the Grand Duchy of Luxembourg. ==Geography== It borders on (clockwise starting from the east) the Grand Duchy of Luxembourg, France in the south, and the Belgian provinces of Namur in the west and Liège in the north. Neither Luxembourg nor neighboring Namur border Flanders. It has the smallest population of all the Belgian provinces, about 291,000 in 2022. With , it is the largest province of Belgium. It is also significantly larger and significantly less populous than the neighbouring Grand Duchy of Luxembourg. The main natural regions in the province are Belgian Lorraine in the southern part, the Ardennes in the centre and northern part, and the Famenne and Condroz in the very northwestern part of the province. With , the Baraque de Fraiture in the municipality of Vielsalm is the highest point of the province. Second is the Galata with in the municipality of Saint-Hubert. The main rivers in the province of Luxembourg are: * Semois, a right tributary of the Meuse river, that flows from east to west in the south of the province * Sauer (German, Luxembourgish) or Sûre (French), a left tributary of the Moselle river, flowing to the country of Luxembourg in the east * Lesse, another right tributary of the Meuse river, flowing to near the city of Dinant in the west * Ourthe, another right tributary of the Meuse river, flowing to the city of Liège in the north ==History== The province was separated from the neighbouring Luxembourg by the Third Partition of Luxembourg in 1839, after the Belgian Revolution, and declared to remain a part of Belgium. During World War I, Luxembourg was occupied by the German Empire. The Battle of the Bulge, a German counter-attack against the Allied offensive in the Ardennes in the winter of 1944/45, took also place in the province of Luxembourg. ==Language== Most of the residents of Luxembourg speak French, but there is a small Luxembourgish-speaking minority, in Arelerland (the eastern part of Belgian Lorraine: Arlon and surroundings), near the border with the Grand Duchy of Luxembourg in the southeast. The dialect of Luxembourg (although slightly spoken) is Walloon. In the western part of Belgian Lorraine people speak Gaumais (the region is called the Gaume). Both are Romance languages. ==Administrative division== The province of Luxembourg is divided into 5 arrondissements and a total of 43 municipalities. Municipalities by arrondissements, with their numbers in the map Arlon Bastogne Marche-en-Famenne * Arlon (1) * Attert (2) * Aubange (3) * Martelange (26) * Messancy (28) * Bastogne (4) * Fauvillers (13) * Gouvy (15) * Houffalize (19) * Sainte-Ode (35) * Vaux-sur-Sûre (41) * Vielsalm (42) * Durbuy (10) * Erezée (11) * Hotton (18) * La Roche-en-Ardenne (20) * Manhay (24) * Marche-en-Famenne (25) * Nassogne (30) * Rendeux (33) * Tenneville (39) Neufchâteau Virton * Bertrix (6) * Bouillon (7) * Daverdisse (9) * Herbeumont (17) * Léglise (21) * Libin (22) * Libramont-Chevigny (23) * Neufchâteau (31) * Paliseul (32) * Saint-Hubert (36) * Tellin (38) * Wellin (44) * Chiny (8) * Étalle (12) * Florenville (14) * Habay (16) * Meix-devant-Virton (27) * Musson (29) * Rouvroy (34) * Saint-Léger (37) * Tintigny (40) * Virton (43) ==Population by arrondissement== Population x 1,000 (on 1 January since 1980).Institut national de statistique - Direction générale Statistique et information économique Arrondissement 1970 1980 1990 2000 2010 2020 Arlon 48 49 49 52 58 63 Bastogne 35 36 37 41 45 49 Marche-en-Famenne 40 42 46 50 54 57 Neufchâteau 53 52 53 56 60 64 Virton 42 44 45 48 52 54 Province of Luxembourg 217 222 231 247 269 287 ==References== ==Other websites== * Official site of the province * Tourist Information in Belgian Luxembourg - Official website",
 "title": "Luxembourg (Belgium)"
}