{
 "id": "192801",
 "text": "The least skipper (Ancyloxypha numitor) is a butterfly in the family Hesperiidae. It is native to North America. They have a weak, bouncy flight.Rick Cech and Guy Tudor 2005. Butterflies of the East Coast. Princeton University Press, Princeton, NJ. Jim P. Brock and Kenn Kaufman 2003. Butterflies of North America. Houghton Mifflin, New York, NY. The least skipper can be found in damp or wet habitats with tall grasses. In the northern part of the its range, adults may be seen from May to September. In the southern part of its range, adults can be found from February to December. It may be seen all year in southern Florida.David C. Iftner, John A. Shuey, and John V. Calhoun 1992. Butterflies and Skippers of Ohio. College of Biological Sciences and The Ohio State University. ==Description== The least skipper has rounded wings and a skinny body. Their antennae are checkered and have no hooks. Male least skipper do not have stigmata.A stigma (plural, stigmata) is a thickening of the wing membrane on the upper side of the top wing. The upper side of the top wing is dark brown, sometimes having orange on it. The bottom wing is orange with a dark brown border around it. The underside of the wings is bright orange. The bottom wing's veins are a whitish color. Its wingspan (length of the wings) is ¾ to 1 inch.Ernest M. Shull 1987. The butterflies of Indiana. Indiana Academy of Science. ==Life cycle== Males find females by looking for them in tall grasses. Females lay their eggs one at a time on the caterpillar's host plant (the plant that the caterpillar feeds on). The eggs are pale yellow.James A. Scott 1986. The Butterflies of North America. Stanford University Press, Palo Alto, CA. The caterpillar makes a nest of grass and silk. The caterpillar is green. It has four pairs of white wax glands on the abdomen near the underside. The head is brown or tan. It is usually darker in the center. The collar (the area between where the head and the body connect) has a white stripe and a black stripe.David L. Wagner 2005. Caterpillars of Eastern North America. Princeton University Press, Princeton NJ. Thomas J. Allen, Jim P. Brock and Jeffrey Glassberg 2005. Caterpillars in the field and garden. Oxford University Press, New York. The chrysalis is a cream color and has brown markings. The caterpillar will hibernate in the winter. The least skipper has 2-4 broods each year. ==Host plants== Here is a list of host plants that the least skipper caterpillar feeds on: * cogongrass, Imperata sp. * rice cutgrass, Leersia oryzoides * cultivated rice, Oryza sativa * Panicum sp. * bluegrass, Poa sp. * Setaria sp. * cordgrass, Spartina sp. * marsh millet, Zizaniopsis miliacea ==Similar species== There are some species of butterflies that are similar to the least skipper. They are the European skipper (Thymelicus lineola), the tropical least skipper (Ancyloxypha arene), the orange skipperling (Copaeodes aurantiaeca), and the southern skipperling (Copaeodes minima).Jeffrey Glassberg 2007. A swift guide to the butterflies of Mexico and Central America. Sunstreak Books. ==References== Category:Hesperiidae",
 "title": "Ancyloxypha numitor"
}