{
 "id": "19315",
 "text": "Seychelles is an African country in the Indian Ocean. Its capital city is Victoria. The official languages are Creole, English, and French. It is a republic is made up of 115 islands. Seychelles and the islands to the south, Madagascar and Mauritius, all had legal slavery and were part of the slave trade. Most of the people are descendants of freed slaves, who make up about 90% of the population. Many of them also are descended from slave owners who abused their ancestors. There are small minorities of immigrants from Europe, China and India. Most people are Roman Catholics, about 90% of them. About 8% are Protestants. Other nearby island countries and territories include Zanzibar to the west, Mauritius, Rodrigues, Agalega and Réunion to the south, and Comoros and Mayotte to the southwest. Seychelles has an estimated population of 86,525. It is the smallest population of any African state. == History == It is thought that Arab sailors first saw the islands in the 7th century. Portuguese explorer Vasco da Gama discovered the islands in 1502, and called them Three Brothers (), but he did not visit the islands. The British East India Company visited the islands, but they did not settle there. ==Geography== Seychelles is to the northeast of Madagascar and about east of Kenya. The number of islands in the archipelago is often given as 115 but the Constitution of the Republic of Seychelles lists 155. According to the president of Nauru, the Seychelles has been ranked the ninth most endangered nation due to flooding from climate change. Some of the districts in Seychelles include: Anse Boileau, Takamaka and Cote D’Or. == Subdivisions == Seychelles is divided into twenty-five administrative regions. Eight of the districts make up the capital of Seychelles. They are called Greater Victoria. Another 14 districts are considered the rural part of the main island of Mahé. There are two districts on Praslin and one on La Digue which also include satellite islands. The rest of the Outer Islands are not considered part of any district. ;Mahé *Bel Air *La Rivière Anglaise (English River) *Les Mamelles *Mont Buxton *Mont Fleuri *Plaisance *Roche Caiman *Saint Louis *Victoria *Anse aux Pins *Anse Boileau *Anse Etoile *Au Cap *Anse Royale *Baie Lazare *Beau Vallon *Bel Ombre *Cascade *Glacis *Grand'Anse Mahé *Pointe La Rue *Port Glaud *Takamaka ;Praslin *Baie Sainte Anne (Anse Volbert) *Grand'Anse Praslin (Grande Anse) ;La Digue and remaining Inner Islands *La Digue (Anse Réunion) == Economy == During the plantation era, cinnamon, vanilla, and copra were the main exports. In the 1960s, about 33% of the working population worked at plantations, and 20% worked in the public or government sector. In 1971, with the opening of Seychelles International Airport, tourism became a serious industry. == Flora and fauna == Like many fragile island ecosystems, the Seychelles had loss of biodiversity during early human history. This included the disappearance of most of the giant tortoises from the granitic islands. There was also the extinction of species such as the chestnut flanked white eye, the Seychelles Parakeet, the Seychelles Black Terrapin and the saltwater crocodile. However, extinctions were far fewer than on islands such as Mauritius or Hawaii. This was partly due to a shorter period of human occupation being only since 1770. The Seychelles today is known for success stories in protecting its flora and fauna. The rare Seychelles Black Parrot, the national bird of the country, is now protected. The granitic islands of Seychelles are home to about 75 endemic plant species. There are a further 25 or so species in the Aldabra group. Particularly well-known is the Coco de Mer, a species of palm that grows only on the islands of Praslin and neighbouring Curieuse. The jellyfish tree is to be found in only a few locations on Mahe. This strange and ancient plant is in a genus of its own (Medusagynaceae). Other unique plant species include the Wright's Gardenia Rothmannia annae found only on Aride Island Special Reserve. The freshwater crab genus Seychellum is endemic to the granitic Seychelles. There are a further 26 species of crabs and 5 species of hermit crabs that live on the islands. The Aldabra Giant Tortoise now lives on many of the islands of the Seychelles. The Aldabra population is the largest in the world. These unique reptiles can be found even in captive herds. There are several unique varieties of orchids on the Islands. The marine life around the islands, especially the more remote coral islands, can be spectacular. More than 1,000 species of fish have been recorded. Since the use of spearguns and dynamite for fishing was banned in the 1960s, the wildlife is unafraid of snorkelers and divers. Coral bleaching in 1998 has damaged most reefs, but some reefs show healthy recovery. The main natural resources of the Seychelles are fish, copra, cinnamon, coconuts, salt and iron. ==References== == Other websites== * Pictures of Seychelles Category:English-speaking countries Category:French-speaking countries Category:Gondwana Category:1976 establishments in Africa Category:Commonwealth member states",
 "title": "Seychelles"
}