{
 "id": "193282",
 "text": "Rowan Sebastian Atkinson (born 6 January 1955) is an English actor, comedian and writer. He is best known for his characters of Mr. Bean and Blackadder. He has also been in films such as The Lion King, voicing Zazu, the red-billed hornbill and Johnny English. He has been listed in The Observer as one of the 50 funniest actors in British comedy,\"The A-Z of laughter (part one)\", The Observer, 7 December 2003. Retrieved 7 January 2007. and amongst the top 50 comedians ever in a 2005 poll of fellow comedians. ==Marriage and children== Rowan Atkinson first met Sunetra Sastry in the late 1980s, when she was working as a make-up artist with the BBC. he got married at the Russian Tea Room in New York City on 5 February 1990. They have two children and lived in Oundle, Northamptonshire as well as in Ipsden, Oxfordshire and in Highbury, London.\"Rowan Atkinson upsets neighbours with plans to replace 1930s country house with 'futuristic petrol station' home\". Daily Mail. Retrieved 14 July 2012 The couple separated in 2014 and divorced in 2015. Atkinson was formerly in a relationship with actress Leslie Ash. ==Television appearances== * Canned Laughter (1979), an experimental sitcom pilot for LWT * The Secret Policeman's Ball (1979), a charity special for Amnesty International * Not the Nine O'Clock News (1979–1982) * Peter Cook & Co (1980) * The Innes Book of Records (1980), guest appearance * Blackadder as Prince Edmund (The Black Adder); Lord Blackadder (Blackadder II); Edmund Blackadder (Blackadder III); Ebenezer Blackadder (Blackadder's Christmas Carol); and Captain Blackadder (Blackadder Goes Forth) (1983–1989) * Saturday Live as guest host (1986) * Mr. Bean as Mr. Bean (1990–2009 various times) * Rowan Atkinson Live as assorted characters (1992) (VHS of live sketches) * Bernard and the Genie as Bernard's Boss (1991) (TV movie) * Funny Business (1992), a documentary about the craft of comedy * A Bit Of Fry And Laurie (1992), guest appearance * The Thin Blue Line as Inspector Raymond Fowler (1995–1996) * The Story of Bean as himself (1997) * Blackadder: Back and Forth as Black Adder (2000) * Mr. Bean (animated TV series) as Mr. Bean, voice (2002) * The Comic Relief \"Red Nose Day\" telecasts, including appearances in: ** Blackadder: The Cavalier Years as Edmund Blackadder (1988) ** Nosenight sketches (1989) ** Mr Bean's Red Nose Day as Mr. Bean (1991) ** (I Wanna Be) Elected as Mr. Bean (1992) ** Blind Date with Mr Bean as Mr. Bean (1993) ** Torvill and Bean as Mr Bean (1995) ** Doctor Who and the Curse of Fatal Death as The Doctor (1999) ** Popsters as Nasty Neville (2001) ** Lying to Michael Jackson as Martin Bashir (2003) ** Spider-Plant Man as Peter Piper and Spider-Plant Man (2005) ** Mr Bean's Wedding as Mr. Bean (2007) ** The Greatest Worst Bits of Comic Relief as himself (2007) * We Are Most Amused (2008), a special show to celebrate Prince Charles' 60th birthday * Blackadder Rides Again as himself (2008) * Not Again: Not the Nine O'Clock News as himself (2009) * Bondi Rescue as Mr Bean (2010) * Summer Olympics opening ceremony as himself/Derek (2012) * Live from Lambeth Palace sketches: Archbishop of Canterbury (The Comic Relief \"Red Nose Day\") (2013) * Horrible Histories: Henri VIII (2015) * Mr. Bean - Funeral (\"Red Nose Day\") (2015) * Maigret as Jules Maigret (2016 + 2017) * Red Nose Day Actually as Rufus (2017) * Handy Bean as Mr. Bean (2018-2020) * One Red Nose Day and a Wedding as Father Gerald (2019) ==Guest appearances== * Wogan (1988, 1991) * Children in Need (1988), guest appearance as Mr. E. Blackadder * Noel's House Party, guest appearance as Blackadder * Going Live, guest appearance as Mr. Bean * This Morning (1995), guest appearance as Mr. Bean * Big Breakfast * Parkinson (2003) * Blue Peter (2004, 2007), guest appearance as Mr. Bean * London Tonight (2005) * BBC Breakfast (2007) * Richard & Judy (2007) * The Dame Edna Treatment (2007), guest appearance as Mr. Bean * Top Gear (2011) ==Filmography== Year Title Role Notes 1979 The Secret Policeman's Ball Various roles Solo skits, plus with Monty Python 1982 Fundamental Frolics Himself 1982 The Secret Policeman's Other Ball Himself & various roles 1983 Dead on Time Bernard Fripp 1983 Never Say Never Again Nigel Small-Fawcett a spy film based on the James Bond novel Thunderball 1989 The Appointments of Dennis Jennings Dr. Schooner Short Film 1989 The Tall Guy Ron Anderson 1990 The Witches Mr. Stringer 1991 The Driven Man Himself TV Also Writer 1993 Hot Shots! Part Deux Dexter Hayman 1994 Four Weddings and a Funeral Father Gerald 1994 The Lion King Zazu Voice Only 1997 Bean Mr. Bean Also Writer/Executive Producer 2000 Maybe Baby Mr. James 2001 Rat Race Enrico Pollini 2002 Scooby-Doo Emile Mondavarious 2003 Johnny English Johnny English 2003 Love Actually Rufus Nominated – Phoenix Film Critics Society Award for Best Ensemble Acting 2005 Keeping Mum Reverend Walter Goodfellow 2007 Mr. Bean's Holiday Mr. Bean Also Writer & Producer 2011 Johnny English Reborn Johnny English Also Executive Producer 2017 Huan Le Xi Ju Ren Mr. Bean Cameo appearance 2018 Johnny English Strikes Again Johnny English 2023 Wonka Father Julius ==References== Category:1955 births Category:Living people Category:Actors from County Durham Category:Actors who played in James Bond movies Category:Alumni of the University of Oxford Category:British stand-up comedians Category:Commanders of the Order of the British Empire Category:English comedians Category:English movie actors Category:English radio actors Category:English stage actors Category:English television actors Category:English television writers Category:English voice actors",
 "title": "Rowan Atkinson"
}