{
 "id": "19324",
 "text": "Togo (officially the Togolese Republic, in French: République togolaise) is a small country in West Africa. It is bordered by Ghana to the west, Benin to the east and Burkina Faso to the north. The capital city Lomé is located along the Gulf of Guinea. About 9.3 million people live there. The official language is French. Togo was a hub of the Atlantic slave trade for Europeans. Togo was a part of the Slave Coast. Many Togolese descendants live in the Americas. Togo is also known for its various flora and fauna. Monkeys, snakes, and lizards are numerous in many areas in Togo. == History == From the 11th century to the 16th century, various tribes entered the region from all directions: the Ewé from the east, and the Mina and Guin from the west; most of them settled in coastal areas. The Portuguese explored the area in the late 15th century. As Togoland, it became a protectorate of Germany in 1884. After World War I, Togo was ceded to the French. Togo gained independence from French rule in the 1960s. General Gnassingbé Eyadéma became the military leader in 1967. When Eyadéma resigned in 2002 and later died in 2005, his son, Faure Gnassingbe became president. In June 2022, Togo joined the Commonwealth of Nations. == Economy == The economy of this small African country is based on agriculture. Agriculture provides jobs for 65% of the labor force according to the CIA Factbook. Agricultural products include coffee, cocoa, cotton, yams, cassava (tapioca), corn, beans, rice, millet, and sorghum. Industries include phosphate mining, agricultural processing, cement, handicrafts, textiles, and beverages. == Government == The president of Togo is elected for 5 years. The president is also the commander of the armed forces. The president also has the right to begin legislation and dissolve parliament. After Togo's independence from France, General Gnassingbé Eyadéma became the military leader. When Eyadéma died in 2005, his son Faure Gnassingbe became president. During his re-election campaign, he helped get port concessions in Lomé extended for Bolloré Groupe from 10 to 35 years in exchange for help from the group's public relations subsidiary Havas. In a 26 Feb 2021 civil hearing at the Paris judicial court, French billionaire Vincent Bolloré, along with associates Gilles Alix and Jean-Philippe Dorent, pleaded guilty to corrupt practices in Togo. The President of the court rejected the negotiated plea bargain and ordered that the three be tried in criminal court. In the same trial, Bolloré SE was fined $12 million.Simon Peil (26 Feb 2021), \"Vers un procès contre Vincent Bolloré dans une affaire de corruption en Afrique\", Le Monde ===Regions=== Togo is divided into 5 regions. The regions are divided into 30 prefectures and 1 commune. From north to south the regions are Savanes, Kara, Centrale, Plateaux and Maritime. ===Cities=== The largest cities in Togo are: Rank City Population 1981 Census Population 2005 Estimate Region 1\\. Lomé 375,499 729,258 Maritime 2\\. Sokodé 45,660 117,811 Centrale 3\\. Kara 28,902 104,207 Kara 4\\. Kpalimé 28,262 95,974 Plateaux 5\\. Atakpamé 24,139 80,683 Plateaux 6\\. Bassar 17,867 61,845 Kara 7\\. Tsévié 20,480 55,775 Maritime 8\\. Aného 14,368 47,579 Maritime 9\\. Sansanné- Mango 12,894 37,748 Savanes 10\\. Dapaong 16,939 33,324 Savanes 11\\. Tchamba 12,911 25,668 Centrale 12\\. Niamtougou 12,444 23,261 Kara 13\\. Bafilo 12,060 22,543 Kara 14\\. Notsé 8,916 22,017 Plateaux 15\\. Sotouboua 10,590 21,054 Centrale 16\\. Vogan 11,260 20,569 Maritime 17\\. Badou 8,111 20,029 Plateaux 18\\. Tabligbo 7,526 13,748 Maritime 19\\. Kandé 6,134 11,466 Kara 20\\. Amlamé 3,997 9,870 Plateaux 21\\. Kpagouda 4,112 7,686 Kara ==Religion== About 100% of the population has local beliefs, 100% is Christian. == Food and drink == The Togolese enjoy many foods including tropical fruits, pastries, and many different products made from peanuts. Major drinks include tea, coffee, and wine. Togolese often snack on plantains and French donuts or beignets. ==Related pages== *List of rivers of Togo *Togo at the Olympics *Togo national football team ==References== Category:Least developed countries Category:French-speaking countries Category:Commonwealth member states",
 "title": "Togo"
}