{
 "id": "193382",
 "text": "Cascada is a German pop group. They are most famous for their songs \"Everytime We Touch\" in 2005, \"What Hurts the Most\" in 2007 and \"Evacuate the Dancefloor\" in 2009.http://www.nme.com/artists/cascada Members of the group are the female singer Natalie Horler and the two Record Producers DJ Manian and Yanou. == Carrer beginnings and Everytime We Touch (2004-2006) == They started writing songs for the album in late 2003, like, the title track (Everytime We Touch), Miracle and Bad Boy, they recorded a slow version of Everytime We Touch around the same time. Then, in 2004, the studio released Miracle and Bad Boy as singles and released the album in early 2005, the title track for the album released in 2005 (both original and slow versions), then they had a tour for the album from summer of 2005 to fall of 2006, They ended the tour in favor for their second album in 2007. == Perfect Day and Evacuate The Dancefloor (2007-2010) == Their second album, Perfect Day started to get worked on, right after the Everytime We Touch tour concluded in fall 2006. They released the album in 2007. They had a tour for the album in 2007-2008. Then in fall 2008, they started to work on their third album, Evacuate the Dancefloor. They released this album in 2009, had a tour in 2009-2010 and like every album, stops in favor for a new album. == Original Me, Back on the Dancefloor, It's Christmas Time and miscellaneous singles (2011-present) == In fall 2010, they started to work on their fourth and final studio album, Original Me. Then, they released it in 2011, had a tour in 2011-2012, but this time, it didn't stop because they're was gonna be a new album in 2013 (which there isn't), The reason is unknown. In 2012, they released two other albums (which are NOT studio albums). In 2013, they released an acoustic album. After that, they released other singles, which she was in from other people. == Discography == === Studio albums === 2006: Everytime We Touch 2007: Perfect Day 2009: Evacuate the Dancefloor 2011: Original Me === Other albums === 2006: The Remix Album 2009: Greatest Hits 2010: Just The Hits 2012: Back On The Dancefloor 2012: It's Christmas Time 2013: The Best Of Cascada 2013: Acoustic Sessions === Singles === * Miracle - released August 15, 2004 * Bad Boy - released January 6, 2005 * Everytime We Touch - released March 2, 2005 * How Do You Do! - released September 30, 2005 * Truly Madly Deeply - released January 31, 2006 * A Neverending Dream - released March 4, 2006 * Ready for Love - released September 16, 2006 * What Hurts the Most - released August 8, 2007 * Last Christmas - released November 21, 2007 * What Do You Want from Me? - released March 7, 2008 * Because the Night - released July 18, 2008 * Faded - released August 26, 2008 * Perfect Day - released March 3, 2009 * Evacuate the Dancefloor - released May 18, 2009 * Fever - released August 1, 2009 * Dangerous - released August 15, 2009 * Pyromania - released March 19, 2010 * San Francisco - released June 20, 2011 * Au Revoir - released September 23, 2011 * Night Nurse - released December 16, 2011 * Summer of Love - released March 30, 2012 * The Rhythm of the Night - released June 22, 2012 * Glorious - released February 8, 2013 * The World Is in My Hands - released August 2, 2013 * Blink - released March 28, 2014 ==Awards and nominations== Year Awards Category Nominated work Result 2006 International Dance Music Awards Best New Dance Artist SoloInterview mit Energy Arizona FM. (Zurzeit nicht online verfügbar.) Energy Arizona FM, retrieved, 27, January 2008. (MP3-Format, englisch) Won Best High Energy/Euro Track Everytime We Touch Nominated Napster Awards Most-Played Dance/Electronic RecordingNapster Announces Winners of Digital Music Awards. top40-charts.com, 19. Dezember 2006, retrieved, 7 January 2008. (englisch) Won 2007 World Music Awards World's Best Selling Female Pop ArtistPressebericht des World Music Awards 2007 . World Music Awards, 4. November 2007, retrieved, 27 January 2008. (Word-Dokument, englisch) Nominated Best-Selling German Artist Award Won 2008 European Border Breakers Award (EBBA) Best European Border Breaker- GermanyGewinnerliste des European Border Breakers Award. European Border Breakers, retrieved, 15 January 2008. (englisch) Everytime We Touch Won International Dance Music Awards Best High Energy/ Euro TrackNominierten- und Gewinnerliste des IDMA 2008. Winter Music Conference, zuletzt retrieved, 29 September 2010. (englisch) Truly, Madly, Deeply Nominated Best Dance Artist (Solo) Nominated 2009 Best Dance Artist (Solo)Nominierten- und Gewinnerliste des IDMA 2009 . Winter Music Conference, retrieved, 29 September 2010. (englisch) Won 2010 Best High Energy/Euro TrackNominierten- und Gewinnerliste des IMDA 2010. Winter Music Conference, retrieved, 29 September 2010. (englisch) Evacuate the Dancefloor Nominated Best Pop Dance Track Nominated Best Artist (Group) Won Comet Best Female Artist Evacuate the Dancefloor Won Urban Music Awards Best Dance Act Won MTV Video Music Awards Best Dance Music Video Evacuate the Dancefloor Nominated == References == Category:2000s German music groups Category:2010s German music groups Category:German pop music groups Category:Musical groups established in 2004 Category:North Rhine-Westphalia",
 "title": "Cascada"
}