{
 "id": "19330",
 "text": "Graffiti (plural; singular: graffiti or graffito, however graffito is rarely used except in archeology) is marks, scratching or drawings made on a surface on a public place. It is often created with paint or spray paint (paint that is sprayed from a can). A single mark could be called a graffito but the word graffiti is usually used, meaning that there is more than one mark. The word comes from Greek (graphein) meaning \"to write\". Graffiti can take the form of art, drawings or words. When done without a property owner's permission it can be considered vandalism. Sometimes it is just a person's name or a rude word. Sometimes it is a public political protest because graffiti is illegal without permission. == Types == There are lots of different types of graffiti, and some people call some things graffiti that other people would not. In some kinds of graffiti, people write their name in different ways. It is usually not their real name. Sometimes people write the name of their crew, which is a group of friends who write together. Small writing like a signature is called a tag. Bigger writing that is very round and has an outline is called a throw up. A graffiti writing with lots of detail is called a piece, which is short for masterpiece. Some graffit is made of pictures. This can be a small picture or a large mural. Graffiti can be legal or illegal. Some towns have walls that anyone is allowed to paint on. Sometimes the government or a business will pay someone to paint, to attract tourists or advertise something. Some graffiti artists like Keith Haring became very famous. == History == Paintings were done on cave walls over 40,000 years ago in Australia. The oldest graffiti that used writing was in the Roman Empire, people wrote messages on walls. It wasn't considered vandalism, instead people saw it as just a way to talk to one another. In the 1700s and 1800s in the United States, some people began to write \"monikers\" on trains. Monikers were pictures and fake names. One famous moniker was Bozo Texino. Modern graffiti was made famous in New York City in the early 1960s and 1970s by the children of the working class. They called it \"writing\" and called themselves \"writers.\" At first they wrote on trains, but when the New York Subway started to make it harder, writers moved into the city to write on walls instead. In a 1971 New York Times article, Norman Mailer first used the term \"graffiti\" was first used to refer to the new kind of art people were painting on trains. This period of the early 1970s is known as the \"Original School.\" Later in the 1980s, the next generation of graffiti artists is known as \"Old School.\" == References == == Other websites == * Graffiti.CX Online Graffiti Contest * Graffiti art on train * Graffiti.org.br * Walls & bridges from south Belgium * How to remove graffiti? * Remove Graffiti From Different Surfaces? * Graffiti art or vandalism",
 "title": "Graffiti"
}