{
 "id": "193530",
 "text": "Johan Neeskens (15 September 1951 - 6 October 2024) was a Dutch football player. He played for Netherlands national team. He is considered to be one of the greatest midfielders of his generation. He is regarded as one of the best Dutch players of all time. Neeskens was a complete and continuous player, capable of adapting to play almost anywhere on the pitch. He possessed remarkable athletic skills. His passes and high-precision shots enhanced the qualities of his colleagues. Neeskens perfectly expressed what Michels and Kovacs preached in the Netherlands: \"a player must be complete and continuous, able to adapt to play in any area of the pitch\". He was also good at heading and penalties. His roughness came to light with the expulsion in the semi- final of the 1976 European Championships against Czechoslovakia. His determination on the pitch also made him a true leader. ==Club career== He started in the RCH youth academy. At 19 he won his first Eredivisie with Ajax. On the eve of the German World Cup Neeskens had signed for Barcelona, with his old teacher Rinus Michels. Neeskens became an idol of the Barça fans. This was not only for his qualities as a footballer but also for his willingness to identify with the club and with the Catalan nation. In Spain he won a King's Cup, a Cup Winners' Cup and 219 games with 53 goals. In 1979 he was in the spectacular final in Basel against Fortuna Düsseldorf. It ended 4-3 in extra time. Like other great champions of his generation, in the late 1970s Neeskens continued his career in the North American league, with NY Cosmos. After the New York experience, he went home to Groningen for a season. He went back to the United States to South Florida Sun, a United Soccer League team. They won the 1985 championship. In America he also played in indoor soccer, playing in the KC Comets. He returned to Europe to end his competitive career in Switzerland in 1991. ==International career== He made his senior international debut at the age of 19 on 11 November 1970 against East Germany. He was in the 1974 FIFA World Cup. In the first group stage he scored two goals from penalties in the 4-1 win against Bulgaria. In the second group stage he scored 2, opening the scoring against East Germany and Brazil. The last goal, scored with a precise diagonal, was celebrated by the whole Dutch team. The Netherlands reached the final where they faced the hosts of West Germany. It was Neeskens who scored the penalty caused by a foul of Uli Hoeneß on Cruyff, giving him the advantage in the second minute of play. The match ended 2-1 for the Germans. Neeskens closed the world championship as top scorer with 5 goals. Two years later Neeskens took part in the 1976 European Championships. The Netherlands qualified for the second round only thanks to the better goal difference than Poland. The match won against the Poles, finished 3-0. Neeskens opened the scoring. Also scoring in the 5-0 against Belgium in the quarter-finals, Neeskens was sent off during the semi-final against Czechoslovakia for a bad reaction to a foul by Pollak. His national team was eliminated, They won third place in extra time without Neeskens and Cruijff who returned early to Barcelona. At Argentina 1978 Neeskens, Rensenbrink and Rep lea the national team to the final which they lost 3-1 in extra time against the hosts. Neeskens ended his career as his country's representative with a total of 49 competitive matches and scored 17 goals. ==Death== Neeskens died while in Algiers, Algeria on 6 October 2024 from a heart attack, at the age of 73. == Club career statistics == |- |1968–69||rowspan=\"2\"|Heemstede||rowspan=\"2\"|Eerste Divisie||34||0 |- |1969–70||34||1 |- |1970–71||rowspan=\"4\"|Ajax||rowspan=\"4\"|Eredivisie||33||1 |- |1971–72||28||10 |- |1972–73||32||7 |- |1973–74||31||15 |- |1974–75||rowspan=\"5\"|Barcelona||rowspan=\"5\"|La Liga||27||7 |- |1975–76||32||12 |- |1976–77||33||9 |- |1977–78||18||2 |- |1978–79||31||5 |- |1979||rowspan=\"6\"|New York Cosmos||rowspan=\"6\"|NASL||13||4 |- |1980||17||4 |- |1981||6||2 |- |1982||17||0 |- |1983||23||2 |- |1984||18||5 |- |1984–85||Groningen||Eredivisie||7||0 |- |1985–86||Minnesota Strikers|||||| |- |1986||Fort Lauderdale Sun|||||| |- |1987–88||rowspan=\"3\"|Baar||1.Liga||9||1 |- |1988–89||||13||4 |- |1989–90||||1||0 |- |1990–91||Zug||1.Liga||1||0 199||34 141||35 104||17 24||5 468||91 |} == International career statistics == |- |1970||2||0 |- |1971||3||0 |- |1972||4||5 |- |1973||5||1 |- |1974||13||9 |- |1975||3||1 |- |1976||4||1 |- |1977||3||0 |- |1978||8||0 |- |1979||2||0 |- |1980||0||0 |- |1981||2||0 |- !Total||49||17 |} ==Honours== Ajax * Eredivisie: 1971–72, 1972–73 * KNVB Cup: 1970–71, 1971–72 * European Cup: 1970–71, 1971–72, 1972–73 * Intercontinental Cup: 1972 * European Super Cup: 1972, 1973 Barcelona * Copa del Rey: 1977–78 * European Cup Winners' Cup: 1978–79 Netherlands *FIFA World Cup runner-up: 1974, 1978 *UEFA European Championship third place: 1976 Individual *1974 FIFA World Cup Silver Boot *1974 FIFA World Cup All-Star Team *1978 FIFA World Cup All-Star Team *Don Balón Award (La Liga Foreign Player of the Year): 1975–76 *FIFA 100 *Ballon d'Or Dream Team (Bronze): 2020 == References == Category:1951 births Category:2024 deaths Category:Dutch footballers Category:Dutch football managers Category:Sportspeople from North Holland Category:FC Barcelona players Category:Deaths from myocardial infarction",
 "title": "Johan Neeskens"
}