{
 "id": "193575",
 "text": "Samuel Timothy \"Tim\" McGraw (born May 1, 1966) is an American actor, singer and songwriter. Between 1994 and 2016, he had number one songs on Billboard's Country Airplay music chart. His father is of Bohemian Czech, Dutch, English, French Huguenot, German, Irish, Northern Irish (Scotch-Irish) and Scottish descent and His mother is of Italian and Irish descent. He is well known for his singles \"I Like It, I Love It\", \"Please Don't Take the Girl\", \"Grown Men Don't Cry\", and \"Live Like You We're Dying\". McGraw had 11 consecutive albums debut at Number One on the Billboard albums charts. Twenty-one singles hit No. 1 on the Billboard Hot Country Songs chart. He has won 3 Grammys, 14 Academy of Country Music awards, 11 Country Music Association (CMA) awards, 10 American Music Awards, and 3 People's Choice Awards. ==Marriage and family== He has been married to Faith Hill since 1996. They have three daughters: Gracie Katherine (born May 1997), Maggie Elizabeth (born August 1998), and Audrey Caroline (born December 2001). ==Discography== ;Singles *\"Everywhere\" (1997) *\"Just to See You Smile\" (1997) *\"One of These Days\" (1998) ;Studio albums *Tim McGraw (1993) *Not a Moment Too Soon (1994) *All I Want (1995) *Everywhere (1997) *A Place in the Sun (1999) *Set This Circus Down (2001) *Tim McGraw and the Dancehall Doctors (2002) *Live Like You Were Dying (2004) *Let It Go (2007) *Southern Voice (2009) *Emotional Traffic (2012) *Two Lanes of Freedom (2013) ==Filmography== Movie Year Movie Role Notes 2004 Black Cloud Sheriff Cliff Powers Friday Night Lights Charles Billingsley Nominated – MTV Movie Award – Best Male Breakthrough Performance 2006 Flicka Rob McLaughlin Nominated – Critics Choice Award for Best Song: \"My Little Girl\" 2007 The Kingdom Aaron Jackson 2008 Four Christmases Dallas 2009 The Blind Side Sean Tuohy 2010 Country Strong James Canter 2011 Dirty Girl Danny Television Year Movie Role Notes 1997 The Jeff Foxworthy Show Lionel one episode; \"Feud for Thought\" 2008 Saturday Night Live Host Hosted November 22, 2008 2011 Who Do You Think You Are? (U.S. TV series) Himself Season 2, Episode 2 ==Awards== Year Awards Award 1994 Country Music Television Male Video Artist of the Year American Music Awards Album of the Year – Not a Moment Too Soon American Music Awards Top New Male Vocalist Billboard Awards Top New Country Artist Billboard Magazine Top New Country Album – Not a Moment Too Soon 1995 American Music Awards Favorite Country New Artist 1997 Billboard Magazine Single of the Year – \"It's Your Love\" (with Faith Hill) Country Music Television Video of the Year – \"It's Your Love\" (with Faith Hill) Country Music Television Male Artist of the Year Playgirl Magazine Top Ten, Sexiest Men of the Year CMA Vocal Event – \"It's Your Love\" (with Faith Hill) 1998 Billboard Awards Country Single of the Year – \"Just To See You Smile\" CMA Album of the Year – Everywhere Academy of Country Music Single of the Year – \"It's Your Love\" (with Faith Hill) Academy of Country Music Song of the Year – \"It's Your Love\" (with Faith Hill) Academy of Country Music Video of the Year – \"It's Your Love\" (with Faith Hill) Academy of Country Music Top Vocal Event – \"It's Your Love\" (with Faith Hill) 1999 Academy of Country Music Male Vocalist Academy of Country Music Vocal Collaboration – \"Just to Hear You Say That You Love Me\" (with Faith Hill) CMA Male Vocalist CMA Album of the Year – A Place in the Sun 2000 CMA Male Vocalist National Fatherhood Initiative Father of the Year Academy of Country Music Male Vocalist Billboard Awards Male Artist of the Year 2001 American Music Awards Favorite Male Country Artist Grammy Awards Vocal Collaboration – \"Let's Make Love (with Faith Hill) CMA Entertainer of the Year Billboard Awards Country Artist Billboard Awards Male Country Artist Billboard Awards Country Albums Artist Billboard Awards Country Single Artist Billboard Awards Country Album – Greatest Hits 2002 American Music Awards Best Country Album – Set This Circus Down American Music Awards Favorite Male Country Artist 2003 American Music Awards (January) Favorite Country Male Artist Radio Music Awards (January) Country Male Artist American Music Awards (November) Favorite Country Male Artist 2004 People's Choice Awards Favorite Country Male Artist Radio Music Awards Country Male Artist CMA Single of the Year – \"Live Like You Were Dying\" 2005 American Music Awards Album of the Year -Live Like You Were Dying American Music Awards Male Artist (country genre) Academy of Country Music Song of the Year -\"Live Like You Were Dying\" Academy of Country Music Single of the Year -\"Live Like You Were Dying\" People's Choice Awards Favorite Country Male Artist Grammy Award Best Male Country Vocal Performance – \"Live Like You Were Dying\" Country Music Television Most Inspiring Video – \"Live Like You Were Dying\" 2006 People's Choice Awards Top Male Performer Grammy Award Country Vocal Collaboration – \"Like We Never Loved At All\" (with Faith Hill) ==References== Category:1967 births Category:Living people Category:Country musicians from Louisiana Category:Singers from Louisiana Category:American movie actors Category:Actors from Louisiana Category:People's Choice Award winners Category:American Grammy Award winners Category:Big Machine Records artists",
 "title": "Tim McGraw"
}