{
 "id": "193508",
 "text": "Gilbert's potoroo (Potorous gilbertii) is an Australian marsupial, sometimes called a rat-kangaroo. It has a pointed face and it is about the size of a rabbit.Coatney, Caryn. \"Rare critters in a wild world down under.\" Christian Science Monitor 89.165 (22 July 1997): 14. Once thought to be extinct, it is listed as being critically endangered.Friend, T. & Burbidge, A. (2008). Potorous gilbertii. 2008 IUCN Red List of Threatened Species. IUCN 2008. Retrieved on 29 December 2008. Database entry includes justification for why this species is listed as critically endangered That area is called Two People’s Bay Nature Reserve.It is the most endangered mammal and marsupial in the whole of Australia. There are only about 40 of the animals now left in the world. Gilbert's potoroo is one of the world's rarest mammals.Gilbert's potoroo. Australian Geographic [serial online]. October 2007;88:116-116. Available from: Academic Search Complete, Ipswich, MA. Accessed April 29, 2009. They live in a small area, about , on the southwest coast near Albany, Western Australia. This area is in the Two Peoples Bay Nature Reserve.Groves, C. (2005-11-16). Wilson, D. E., and Reeder, D. M. (eds). ed. Mammal Species of the World (3rd edition ed.). Johns Hopkins University Press. pp. 58. . Gilbert's Potoroos have been released on nearby Bald Island, and are breeding successfully. == Discovery == The first scientific discovery of the Gilbert’s potoroo happened in 1840, and it was named in 1841 after the English naturalist and explorer John Gilbert.KRAJEWSKI, CAREY. BETTONGS, POTOROOS AND THE MUSKY RAT-KANGAROO. Australian Natural History Series. Quarterly Review of Biology 83.4 2008: 419-419. Gilbert had collected several animals at King George Sound in Australia, including this potoroo. Gilbert’s potoroo was not seen again for many years, even though many people had searched for them in the 1970s. The species was believed to be extinctA gap in nature: discovering the world's extinct animals. Australian Artist 18.6 (Dec. 2001): 2. Apr. 2009 for 120 years before it was re-discovered in 1994 in Two Peoples Bay Nature Reserve. Liz Sinclair had been studying wallabies and caught the potoroo in one of her traps.\"Potoroo's return.\" New Scientist 144.1956 (17 Dec. 1994): 12. 14 Apr. 2009 == Habitat == Potoroos live under thick bushes and shrubs. They have made tunnels and paths through the bush so they can get around easily. When moving slowly they use all four legs, but to move quickly they can hop like a kangaroo. Potoroos are nocturnal and they spend their days hiding. They only come out into the open very often. They live in small groups of between three to five animals. They eat different kinds of truffles and fungi.Stephen Jackson. Natural history of potoroos and bettongs: reproduction, biology, diet, and conservation. Journal of Mammalian Evolution 15.3 2008: 203-204. Australia has many different kinds of truffles and potoroos like to eat many of them.Nguyen V.P., Needham A.D. and Friend J.S. 2005. A quantitative dietary study of the critically endangered Gilbert’s potoroo, Potorous gilbertii. Australian Mammalogy 27: 1-6 Potoroos have sharp three toed claws that help them dig into the ground to find the truffles growing in the soil. After eating them, the potoroos help spread the seeds of the truffles through their wastes.Hoke, Franklin. POTOROOS IN THE OUTBACK. Environment 32.5 1990: 21-21. Scientists have found 40 different types of fungi in the waste from a Gilbert Potoroo. == Reproduction == The female potoroos can have two babies in a year, but only carry one at a time. They can keep a second embryo in a state of diapause while the first embryo is growing. If the first baby does not survive, the second baby can start growing right away. It is not known how long gestation is for Gilbert’s potoroo, but it is thought to be the same as the long-nosed potoroo; about 38 days.Friend, Tony. Gilbert's otoroo. Nature Australia 27.9 2003. The baby potoroo is only about long when it is born. It lives in its mother's pouch for about 4 months. == Saving the potoroo == When Gilbert’s potoroo was rediscovered, more animals were captured to start a breeding program. This would help increase the numbers of potoroos. A few young were born in the first couple of years, but then breeding just stopped. Many studies have looked at what they eat, and how they live, but they still cannot get the potoroos to breed in captivity. In 2001, a group was formed called the Gilbert’s potoroo Action Group (GPAG).Bald Island home to two more Gilbert’s potoroos. 2007. Retrieved on 2007-10-07. This group helps educate and tell people about the potoroo. It also helps with raising money for more study and captive breeding programs for Gilbert’s potoroo. Three potoroos, one male and two females, were moved to Bald Island in August 2005. This island is free from other animals, like cats and foxes, that would eat the potoroos. Since then, four more potoroos have been sent to start a breeding colony. There is a lot of danger for the survival of Gilbert's potoroo. Because of the small area where they live, they could be lost in a bushfire. Foxes and cats could easily kill all the potoroos. There may not be enough potoroos to give them enough genetic differences to survive a virus. There is not enough natural bushland at Two Peoples Bay, and there is too much cleared land next to the nature reserve. == References == == Other websites == *Gilbert's Potoroo at Western Australia Department of Environment and Conservation *Gilbert's Potoroo (Potorous gilbertii) recovery plan *Gilbert's Potoroo Action Group Category:Marsupials of Australia Category:Critically endangered species",
 "title": "Gilbert's potoroo"
}