{
 "id": "193696",
 "text": "Insomniac Games is an American video game developer founded in 1994. The company has created many games, including the first three Spyro the Dragon titles for the PlayStation, most of the Ratchet & Clank games for the PlayStation 2 and PlayStation 3, and the Resistance series for the PlayStation 3. Their first game was Disruptor, released for the PlayStation. To date, they have sold 32 million copies of their games and received numerous awards. Since 2005, Insomniac Games has earned eight \"best workplace\" awards. ==Company== Insomniac started in 1994, and is now based in Burbank, California. Its first game, a first-person shooter called Disruptor, was released on November 20, 1996 for the PlayStation. It was given very good reviews by critics, but did not sell many copies. After this game, they made the Spyro the Dragon for the PlayStation. This series was very successful, and Insomniac made the first three games in the series. After Insomniac lost the license to the Spyro series to Universal Interactive, they began working on a game called Girl with a Stick. The developers at Insomniac didn't like this game, so they decided to make the Ratchet & Clank series instead. The first game in the series, Ratchet & Clank, was released on November 4, 2002. It got very high reviews, and Insomniac have made six more Ratchet & Clank games since. Ratchet & Clank games have so far sold 25 million copies. In 2006, Insomniac released their first PlayStation 3 game, Resistance: Fall of Man, and released Resistance 2 in 2008. Resistance 3 was released in 2011. ==People== *Ted Price (President & CEO) *Alex Hastings (Chief Technology Officer) *Brian Hastings (Chief Creative Officer) *Chad Dezern (North Carolina Studio Director) *See also: Team members ==Games== Game name US Release Date Platform Disruptor November 20, 1996 PlayStation Spyro the Dragon September 10, 1998 PlayStation Spyro 2: Ripto's Rage! November 2, 1999 PlayStation Spyro: Year of the Dragon October 11, 2000 PlayStation Ratchet & Clank November 7, 2002 PlayStation 2 Ratchet & Clank: Going Commando November 11, 2003 PlayStation 2 Ratchet & Clank: Up Your Arsenal November 2, 2004 PlayStation 2 Ratchet: Deadlocked October 25, 2005 PlayStation 2 Resistance: Fall of Man November 17, 2006 PlayStation 3 Ratchet & Clank Future: Tools of Destruction October 23, 2007 PlayStation 3 Ratchet & Clank Future: Quest for Booty August 21, 2008 PlayStation 3 Resistance 2 November 4, 2008 PlayStation 3 Ratchet & Clank Future: A Crack in Time October 27, 2009 PlayStation 3 Resistance 3 September 6, 2011 PlayStation 3 Ratchet & Clank: All 4 One October 18, 2011 PlayStation 3 Ratchet & Clank Collection June 29, 2012 PlayStation 3 Outernauts July 2012 Facebook Ratchet & Clank: Full Frontal Assault November 27, 2012 PlayStation 3, PlayStation Vita Fuse March 2013 PlayStation 3, Xbox 360 ==Other developers== ===High Impact Games=== High Impact Games is a game developer made by people who used to work at Insomniac. They made two Ratchet & Clank games for the PlayStation Portable, called Ratchet & Clank: Size Matters and Secret Agent Clank. They also made a PlayStation 2 version of Ratchet & Clank: Size Matters. They made a Jak and Daxter game, called Jak and Daxter: The Lost Frontier, for the PlayStation 2 and PlayStation Portable. It is the first Jak and Daxter game not made by Naughty Dog, who are also close friends of Insomniac Games. ==References== Category:Video game companies of the United States Category:Companies based in Burbank, California Category:1994 establishments in California",
 "title": "Insomniac Games"
}