{
 "id": "193884",
 "text": "ITV Yorkshire (originally Yorkshire Television) is an ITV franchise based in Leeds. ITV Yorkshire broadcasts to Yorkshire and Lincolnshire. ITV Yorkshire has made successful programmes such as Emmerdale, Heartbeat, The Beiderbecke Trilogy, Rising Damp, Harry's Game, The Darling Buds of May, Only When I Laugh and Duty Free. Yorkshire Television also produces the Calander news programme. The headquarters of ITV Yorkshire are at The Leeds Studios in the Burley area of Leeds. == Identity == For almost 35 years, Yorkshire Television's on-screen identity always revolved around the use of the station logo: the chevron. This yellow symbol was seen on nearly all of Yorkshire Television's idents and presentation. The first symbol used was a black and white chevron, formed by slit-scan techniques and accompanied by an orchestral version of the tune \"On Ilkla Moor Baht 'at\", a famous Yorkshire folk song. This music was later to become the station's jingle. This ident continued until Yorkshire Television officially commenced their colour broadcasts in November 1969. Contains videos of all of the YTV idents. Contains images of the idents The new colour ident featured the yellow chevron on a black background with the still caption card \"Yorkshire Television Colour Production\", along with a simplified version of \"On Ilkla Moor Baht 'at\". This ident was modified in 1981, so that the caption \"Colour Production\" was changed to \"In Colour\", and in 1982 the colour caption was removed altogether. The new version of the jingle was at a lower pitch than was previously composed. Supplementing the ident throughout this period were idents promoting the station's coverage, with the slogan \"Serving Six Million Viewers\". One version, in 1983 featured a giant chevron logo, made up out of smaller chevrons, and another in 1986 featured the view zooming in from space, to the Yorkshire TV region, which then flipped over, becoming the chevron. This last version was computer animated, with 3D-style lettering and chevron. On 5 January 1987, Yorkshire Television introduced a new ident, entitled \"Liquid Gold\", featuring a pool of liquified gold, with the chevron rising up from it, and rotating into the sky, where the station name joins it. This ident features a fully orchestrated version of the theme tune and reportedly cost £40,000 to make. This was occasionally supplemented by a large rotating chevron over a gradient-ed blue background, used over continuity. On 1 September 1989, Yorkshire Television adopted the first ITV generic look, featuring the large ITV logo, addition ident was also used where a static chevron on the same background as the main ident. On 7 January 1991, the ident was revised to allow the Chevron to appear full screen instead of being a segment of the 'V' which the company used until 23 October 1994. The whole package was used by Yorkshire Television, and an adapted version, where the whole chevron appeared in the V segment before moving into centre screen, was used before regional programming. ===1990s=== Upon YTV ending their use of the ITV generic look on 24 October 1994, a new ident was introduced, featuring a textured background with a central strip containing images of the region itself, with the chevron placed in the centre of said strip. The most noticeable thing about this ident set was the smooth nature of the chevron's appearance and, like the previous look, did not feature the \"On Ilkla Moor Baht 'at\" jingle, instead favouring a smooth orchestral jingle. The background was later changed from a cream to a light blue, and variations on the theme for special occasions and yearly themes were also introduced. Yorkshire-Tyne Tees Television adopted a new branding package, based on the concept of Channel 3. The new look was fully implemented in the Tyne Tees region on 2 September 1996, where all on-screen branding was replaced by giant numeral '3', and the Tyne Tees brand became secondary to 'Channel 3 North East, however the look was only partially implemented in the Yorkshire region a month after Tyne Tees's revamp. The entirety of Yorkshire's Channel 3 look included an ident which was later introduced on 4 November 1996 at the same year, where the chevron span against a light blue background with numeral '3's covering the background. Another ident featured the chevron with the '3' numeral embossed on the side, which would zoom into view, before revealing a spinning numeral 3, which in turn had YTV chevron on the middle of the 3 and when zoomed into, the chevron re-appeared spinning against the background. The look also heralded the return of the \"On Ilkla Moor Baht 'at\" tune, which was now noticeably higher in pitch. The Channel 3 look was dropped on 9 March 1998, following Granada's acquisition of Yorkshire-Tyne Tees Television, with the look returning to a spinning chevron against a misty blue background, light blue during the day and dark blue in the evenings. On 8 November 1999, Yorkshire Television adopted the second generic look, based on the theme of hearts, which was used for the entirety of the branding period before network programming. However, for local programming, Yorkshire created their own ident featuring a background of spinning chevrons, with pictures of the region featuring inside a central box. ===2000s=== On 28 October 2002, the brand was dropped in favour of a national ITV1 identity, in which local regional identities were dropped except before local programming, when the Yorkshire name appeared below the ITV1 logo only. These regional idents however were dropped by 2006. === Continuity announcers === * Redvers Kyle (1968–1993) * Bob Preedy (late 1980s – 2002) * John Crosse (senior announcer, early 1970s – 1998) * Graham Roberts (c. 1970s – 1993) * Kerrie Gosney (2000–2002) * Earl Richmond (1968 – c.1970s) * Neil Didsbury (2001–2002) * Pete Haslam (promo voiceover and continuity announcer, 1999 – c.2007) * Peter Lewis (late 1960s) * Keith Martin * Maggie Mash (1988–2002) * Nick Oliver * Karen Petch * Paul Lally (c.1968 – 1990s) * Ian de Stains (1968–1970) * Paul Kaye (c.1970s – 1980) * Helen Aitken (1995–2002) * Roger Tilling (1998–2002) * Colin Weston (freelancer) * Stephen Whitlock (1992–2004) == References == Category:ITV (TV network)",
 "title": "ITV Yorkshire"
}