{
 "id": "193991",
 "text": "Barthold Fles (February 7, 1902 – December 19, 1989) was a Dutch-American who worked as a literary agent, helping writers find publishers to print their books. He also wrote books and articles, edited texts, translated books from German to English, and published poetry books. ==Life== Barthold Fles was born in Amsterdam on February 7, 1902. His family was Jewish but did not keep Jewish laws. His father, Louis Fles, thought that it was wrong for Jews and other people to be religious. Louis Fles imported typewriters and sold them, in addition to other office products, in several stores that he owned and to other stores. Barthold was his oldest son so his father wanted him to help him at work. Barthold did not want to work for his father. He only wanted to read. Barthold read in Dutch, German, English, and French. He read a lot and very fast. Barthold found a job at De Lange publishers. In 1923 he left for the United States. In New York Fles first worked as a violinist, painting apartments, selling vacuum cleaners and for publishers. In 1933 he started his own business, a literary agency, in Manhattan, New York. As a literary agent he mostly helped writers find publishers. He also sold stories for films or magazines and would find a writer to make a book that a publisher wanted. When Barthold started working as a literary agent, many of his clients were people who left Germany for the United States because of the Nazism in Germany. He held meetings for these writers in New York so that they could learn about publishing books and stories in the United States. Later, however, most of the writers he worked with were born in the United States. In 1936 Barthold married Ruth Grünwald, a dancer at the Metropolitan Opera who had been just one year in the United States. Ruth helped Barthold with his work. Later she left him. Although he had no children of his own, Barthold Fles wrote two books for kids: Slavonic rhapsody: the life of Antonín Dvořák (in 1948) and East Germany (in 1973). He also wrote many articles and introductions to story collections. He translated three books from German to English. One of these books, Bambi's Children by Felix Salten, was also a book for children. In 1986, when he was 84 years old, Fles stopped working. He went back to the Netherlands, and lived three years in a home for retired artists. He died on December 19, 1989 at the age of 87. ==Books== ===Written=== * 1948 - Slavonic rhapsody: The life of Antonín Dvořák * 1973 - East Germany * 1993 - Briefwechsel mit Barthold Fles, 1942-1949 (with Heinrich Mann; editor Madeleine Rietra) ===Compiled === * 1948 - The best short stories from Collier's * 1949 - Seven short novels from the Woman's Home Companion * 1951 - The Saturday Evening Post western stories ===Translated=== * 1939 - Ernst Krenek: Music here and now * 1939 - Felix Salten: Bambi’s children * 1943 - Hans Natonek: In search of myself ===Published=== These German poetry books were published by Barthold Fles Verlag, New York * 1941 - Max Herrmann-Neisse: Letzte Gedichte * 1941 - Barthold Viertel: Fürchte dich nicht! Neue Gedichte * 1942 - Hans Sahl: Der hellen Nächte, Gedichte Aus Frankreich * 1942 - Max Hermann-Neisse: Mir bleibt mein Lied, Auswahl aus unveröffentlichten Gedichten (posthumous publication) ==Articles== ===Written=== * 1928-09-15 - Chávez lights new music with old fires. Musical America 48 (22): 5 & 21.Oja CJ: Making Music Modern: New York in the 1920s. Oxford: Oxford University Press, 2000, page 445. .Stevenson R: \"Carlos Chávez's United States Press Coverage\". Aztlán 14 (1) (Spring 1983): 21-33. * 1932-05-18 - The Price of Being Sensible. The Nation 134 (3489): 576. * 1934-07-04 - Now as a Story Teller. The New Republic: 216. (book review of Kaleidoscope by Stefan Zweig) * 1935-03-10 - In Holland Writers Favor the Exotic. The New York Times: BR 8 & ?. * 1935-10-27 - Van Gogh Letters and Other Dutch Books. The New York Times: BR 8 & ?. * 1935-12-24 - The Literary Scene In Holland. The New York Times: 61. * 1935-11-02 - Rococo Italy in a Picaresque Novel. The Saturday Review of Literature 8 (1): 12. * 1936 - Literature in Exile. Story 9: 8, 101-102. * 1936-08-23 - Holland Turns to the Historical Novel. The New York Times: BR 8. * 1945-07-28 - What Has Happened to Them Since? Reply. Publishers Weekly: 307. * 1950-06-04 - A Literary Letter about Holland. The New York Times: BR 11. * 1951-10 and 11 - The Literary Agent. The Writer 64 (10): 319-323, (11): 361-365. (also included in the book Briefwechsel mit Barthold Fles) ===Translated=== * 1935 - Nettie Sutro: Biographical Note on the author in Ignazio Silone: Mr. Aristotle ==References== Category:1902 births Category:1989 deaths Category:Businesspeople from New York City Category:Jewish American writers Category:American translators Category:Writers from Amsterdam Category:Writers from Manhattan",
 "title": "Barthold Fles"
}