{
 "id": "19398",
 "text": "The United States House of Representatives is a part of the United States (U.S.) Congress. Congress is the legislature of the U. S. government and makes federal laws. The other part of Congress is the U. S. Senate. There are maximum 435 members in the United States House of Representatives. These members are called U. S. Representatives or just representatives. All representatives are elected every two years. Every 10 years, the United States Census Bureau counts the population of the United States. States can gain or lose Representatives based on the count. The House of Representatives is in one of the two wings in the U.S. Capitol building. The other wing is for the Senate. Sometimes the House of Representatives is informally called the House. The chairman/chairperson in the U.S. House of Representatives is called the Speaker of the House. According to the U.S. Constitution, all bills about raising revenue, which includes taxes, must start in the House of Representatives. Also, only the House of Representatives has the power to impeach certain officials, such as the president or federal judges. == Members == Every state has members of the House. The Constitution says every state must have at least one, but almost all states have more. The number is based on how many people live in that state. There are 435 total people who are members of the House of Representatives. Each member serves for 2 years (one term), but they can serve for more if they are elected again. Elections happen every 2 years, and half of them take place on the same day as elections for the President. Those take place every 4 years. They are usually elected with Plurality Voting, but states can choose the method and some states choose other ones. After each election, Congress has a period of time called a term. These last for 2 years. There are 2 groups of members, also called Political Parties. These groups aren't just in the House, though, they are also big in the Senate, Presidency, State governments, and more. The groups are the Democratic Party and the Republican Party. In the infobox to the right is a chart showing what party the members are a part of. Blue is the Democrats, and Red is the Republicans. According to the U.S. Constitution, the House of Representatives can kick out, or impeach, one of its representatives by a vote of at least two-thirds of its members. This most recently happened with George Santos. == Speaker of the House == At the beginning of every term, the House members vote on a leader. This leader is called the Speaker of the House. They control the schedule of when the members speak. ==Notes== ==References== ==Other websites== * **Clerk of the House of Representatives ** Chief Administrative Office of the House ** Office of the majority leader ** Office of the speaker of the House ** Official list of current members ** Rules of the House * Legislative information and archives for US House and Senate, via Congress.gov * Biographical Directory of the United States Congress, 1774 to Present * A New Nation Votes: American Election Returns 1787–1825 * Complete Downloadable List of U.S. Representative Contact Information, via AggData LLC] * Information about U.S. Congressional Bills and Resolutions == References ==",
 "title": "United States House of Representatives"
}