{
 "id": "194035",
 "text": "Steve Nash, OC, OBC (born February 7, 1974) is a Canadian retired professional basketball player. He was an eight-time NBA All-Star and won the NBA Most Valuable Player Award twice. He played with the Dallas Mavericks alongside Dirk Nowitzki, the Phoenix Suns where he was a star player, and last played for the Los Angeles Lakers. Although he was born in South Africa, he considers himself Canadian; he moved to Canada with his family when he was 18 months old. His family first lived in Regina, Saskatchewan and then in Vancouver before settling in Victoria, British Columbia, where he grew up. His family left South Africa when he was young because of apartheid in South Africa. Nash has won two NBA MVP awards, in 2005 and 2006, but has never won an NBA title. He was one of the people who lit the Olympic Torch at the 2010 Winter Olympics in Vancouver. Nash is regarded as one of the best passers of all time, as well as one of the best pure shooters in basketball history, as highlighted by being a four-time member of the 50-40-90 club. Relations & Ethnicity He has a variety off different families stretching all around the world in locations such as, South Africa, Canada, Denmark and England He often refers to his rough up bringing, while his mother was in rehab. Being passed from relative to relative, a couple off the people he credit to helping in his successful basketball career are John Nash (his father), Jean Nash (his mother), Jean Farrow (his mother’s cousin) and Lola nash (his aunty) He is currently the 4th top assists leader in the history of the NBA, only behind John Stockton, Jason Kidd and Mark Jackson. Nash is a co-owner of the Vancouver Whitecaps FC professional soccer team and also owns Steve Nash Sports Club, a fitness club. On March 21, 2015, Nash announced that he was retiring from professional basketball after a 19-year NBA career. On September 3, 2020, Nash became the head coach of the Brooklyn Nets. After controversy around the team, mainly from Kyrie Irving, Nash and the Nets agreed to part ways. == Teams he has played for == * Dallas Mavericks 1998-2004 * Phoenix Suns 1996-98, 2004-2012 * Los Angeles Lakers 2012-2015 ==References== ==Other websites== *NBA profile * Category:1974 births Category:Living people Category:Canadian basketball players Category:Canadian philanthropists Category:Dallas Mavericks players Category:Los Angeles Lakers players Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association coaches Category:National Basketball Association players with retired numbers Category:Naturalized citizens of Canada Category:Phoenix Suns players Category:Point guards Category:Sportspeople from Johannesburg Category:Sportspeople from Victoria, British Columbia",
 "title": "Steve Nash"
}