{
 "id": "194122",
 "text": "The Milgram experiment is the name for a number of controversial experiments in psychology. They were done by Stanley Milgram in the 1960s. Milgram wanted to find out how easy it was to get someone to follow orders, even if the orders went against their conscience. In his experiment, a test subject was ordered by a scientist to inflict electric shocks on another person, though the shocks were faked. To his surprise, most subjects did as they were told until the very end of the experiment, though many found it difficult. There have been many repetitions and variations of the experiment, with similar results.Milgram, Stanley 1963. Behavioral study of obedience. Journal of Abnormal and Social Psychology 67 (4): 371–8. Milgram, Stanley 1974. Obedience to authority: an experimental view. Harpercollins. == The experiment == Participants were told they would be helping out in a \"learning experiment\". The participant played the role of a \"teacher\" in which they had to ask questions to the \"learner\". Every time the learner got a question wrong or failed to answer, the teacher had to press a switch to give the learner an electric shock. The voltage increased each time. In the original version of the experiment, the teacher and learner were in separate rooms, but could talk to each other through the wall. In fact, the electric shocks were faked. The \"learners\" were actually actors, who only pretended to be in pain. As the \"shocks\" increased, their cries of pain grew louder. They protested, banged the wall and stopped answering the questions. The shocks eventually reached levels that would have been deadly had they been real. At this point, the learner fell silent. Much was done to trick the subjects into thinking it was real. When they arrived, they were told that the actor was another volunteer and that the \"teacher\" and \"learner\" roles would be decided at random by drawing slips of paper. In fact, both slips of paper said \"teacher\", so the actor pretended to have picked \"learner\". The electric shock machine made buzzing noises and could give an actual mild shock of 45 volts. The teacher would try this out before the experiment began. If at any time the subject (\"teacher\") wanted to stop the experiment, the experimenter had instructions on what to say to them. These were known as \"verbal prods\". The prods the experimenter had to use were, in this order: #Please continue. #The experiment requires that you continue. #It is absolutely essential that you continue. #You have no other choice, you must go on. There were a few other things the experimenter was allowed to say. For example, if the subject asked about whether the learner would be badly hurt, the experimenter could say \"Although the shocks may be painful, there is no permanent tissue damage, so please go on.\" If the subject still wished to stop after the four main prods had been used, the experiment was halted. Otherwise, it was halted after the subject had given the maximum \"450-volt\" shock three times in succession. == Results == Before Milgram did his experiment, he asked fourteen Yale University psychology students what they thought the results would be. On average, the students thought that 1.2% of the \"teachers\" would give the biggest electric shock of 450 volts. In fact, in Milgram's first set of experiments, 65 percent (26 of 40) of participants gave the final massive 450-volt shock, and all gave a shock of at least 300 volts. Milgram found that the \"teachers\" showed signs of stress and nervousness in the experiment. Signs of this included sweating, trembling, stuttering and groaning. All of them stopped to question the experiment at some point. Most continued once they were reassured by the experimenter. Other psychologists did their own versions of Milgram's experiment and found very similar results. == Variations == After repeating the original experiment, Milgram and other scientists tried different variations. These included: * The further away the subject was from the learner, the more likely the subject was to obey. In variations where the learner was in the same room, the subject was less likely to obey. * The further away the subject was from the experimenter, the less likely the subject was to obey. If the experimenter gave the orders over the telephone, only around 21% of subjects obeyed until the end. Some only pretended to obey. * The original version used only men as subjects. Later versions found that women were as obedient as men, though they showed more signs of stress.. * Another version took place in a backstreet office, rather than the famous Yale University. Subjects were less likely to obey, but not much less. * Several variations tried putting more people in the room: ** The subject was joined by another actor, who played the role of an obedient assistant. This made the subject more likely to obey. ** Another variation did the opposite. The subject was joined by an actor who played the role of an assistant who questioned and turned against the experimenter. This made the subjects less likely to obey. ** In another, the subject was given a minor task while an actor performed the electric shocks. Subjects who did this role were very likely to obey. ==Interpretations== Milgram wrote about the experiment in his book Obedience to Authority: an experimental view. It was published in 1974. Milgram offered two theories: * The first is the theory of conformism. The idea is that people tend to do what other people around them are doing. * The second is the agentic state theory. This is the idea that people become obedient when they see themselves as being \"agents\" who are doing the work of another person. One of the main reasons why many subjects continued with the experiment was that they were told that would not be held responsible for any damage that was done to the learner. Other factors might partly explain the Milgram experiments: :\"[People] have learned that when experts tell them something is all right, it probably is, even if it does not seem so. In fact, it is worth noting that in this case the experimenter was indeed correct: it was all right to continue giving the \"shocks\" — even though most of the subjects did not suspect the reason\". Some researchers argued that the experiments do not fully answer the question as to why apparently normal people commit atrocities in wartime. For example, the subjects were being told that the shocks would cause no major harm to the learner, whereas those who caused events like the Holocaust knew full well that they were committing murder. == Pop culture == The experiment has been mentioned numerous times in pop culture. In the graphic novel V for Vendetta Dr. Surridge said that she lost faith in humanity because of the experiment. In 2013 there was a conference about it at Nipissing University in Canada. The Milgram effect was mentioned in the movie I Care A Lot in passing, ==References== Category:Psychology experiments",
 "title": "Milgram experiment"
}