{
 "id": "194285",
 "text": "Benjamin Netanyahu (born 21 October 1949) is an Israeli politician. He is the Prime Minister of Israel since 2022. He was prime minister before from 1996 to 1999 and from 2009 to 2021. He is chair of the Likud party. Netanyahu is the longest-serving prime minister in Israel's history, having served a total of over 17 years. In October 2023, Israel was attacked by Hamas-led Palestinian groups, triggering the Israel–Hamas war. Netanyahu has been criticized for his role in not preventing the attack and then for his response to the attack. His government faced protests calling for his removal. Netanyahu's government has been accused of genocide and war crimes. In May 2024, the International Criminal Court announced their plans to apply for an arrest warrant for Netanyahu, and other members of his cabinet, for war crimes and crimes against humanity, as part of the ICC investigation in Palestine. In November 2024, the International Criminal Court issued an arrest warrant for Netanyahu along with Yoav Gallant and Mohammed Deif. ==Corruption charge== On February 28, 2019, Netanyahu was indicted on bribe and fraud charges in three different cases. If Netanyahu is convicted, he could face up to 10 years in prison for bribery and a maximum of three years for fraud and breach of trust. He is the first sitting prime minister in Israel's history to be charged with a crime. ==2020 election== On April 20 April 2020, Opposition Leader Benny Gantz and Netanyahu announced an agreement on a unity government had been reached following the 2020 legislative election. The deal would involve both parties splitting power and Gantz and Netanyahu taking turns being prime minister. The deal said that Gantz would be Vice Prime Minister until October 2021, by then he would replace Netanyahu to become Prime Minister. ==Fifth term== In May 2021, Hamas fired rockets on Israel from Gaza, which caused Netanyahu to act Operation Guardian of the Walls, lasting eleven days. After the 2021 Israel-Palestine crisis, Israeli politician and leader of the Yamina alliance Naftali Bennett announced that he has agreed to a deal with Yair Lapid to forge a coalition government that would remove Netanyahu from his Prime Minister position. This is after the 2021 March election. ==Sixth term== After the 2022 election, Netanyahu was sworn in as Prime Minister again. He officially started his sixth term on 29 December 2022. The first months of Netanyahu's sixth term focused on reforms in the judicial branch. His critics said his reforms would have a negative effect on the separation of powers. After weeks of public protests, Minister of Defense Yoav Gallant spoke against the reform on 25 March. He was removed from his post by Netanyahu the following day. On May 20, 2024 the International Criminal court Prosecutor Karim Ahmad Khan, who was later accused of repeated sexual abuse and witness intimidation, * * * * * applied for an arrest warrant for the arrest of prime minister Binyamin Netanyahu. Charges brought by Karim Khan include but are not limited to: * Starvation of civilians as a method of warfare * Intentionally directing attacks against a civilian population In November 2024, the International Criminal Court issued an arrest warrant for Netanyahu along with Yoav Gallant and Mohammed Deif. ==Army career== Netanyahu was a captain in the Israel Defense Forces. He fought in the raid on Lebanon in 1968. He also fought in the raid on Yarden in 1968. His brother Yonatan (1946, New York City – 1976, Entebbe) commanded the special reconnaissance unit Sayeret Matkal. ==Books and articles== Books: Through the years Netanyahu authored six books, three of which focus on counter-terrorism. The books he wrote himself include: * International Terrorism: Challenge and Response (The Jonathon Institute, 1980) () * Terrorism: How the West Can Win (Farrar Straus & Giroux, 1986) () * A Place Among the Nations (Bantam, 1993) () * Fighting Terrorism: How Democracies Can Defeat Domestic and International Terrorism (Diane Pub Co, 1995) () * A Durable Peace: Israel and Its Place Among the Nations (Warner Books, 2000) () * Bibi: My Story (Threshold Editions [Simon&Schuster;], November, 2022) == Related pages == * Fourth Netanyahu Government * Netanyahu-Gantz Government (Fifth Netanyahu Government) * Yonatan Netanyahu ==Notes== ==References== == Other websites == * Official website * Biography of Benjamin Netanyahu at Zionism and Israel Information Center Biography Section * Website of supporters of Benjamin Netanyahu * Benjamin Netanyahu on the definition of terror (BBC, 5 min.) * Benjamin Netanyahu Profile on Israeli Lexicon (Ynetnews) * Netanyahu: Pullout will worsen Israel's security . The Jerusalem Post, 5 August 2005 *Cheltenham High School Hall of Fame Biography *Netanyahu’s Fortification Plan *The 32nd Government, official Knesset website *Sara Netanyahu , Sara Netanyahu biography and photos Category:1949 births Category:Living people Category:Ambassadors of Israel Category:Ambassadors to the United Nations Category:Deputy government ministers of Israel Category:Government ministers of Israel Category:Israeli military people Category:Israeli opposition leaders Category:Jewish Israeli politicians Category:Jewish Israeli writers Category:Jewish military people Category:Likud politicians Category:Massachusetts Institute of Technology alumni Category:Members of the Knesset Category:Military people from Tel Aviv Category:Politicians from Tel Aviv Category:Writers from Tel Aviv Category:Israeli political scientists Category:Prime ministers of Israel Category:War criminals Category:Racism against Arabs",
 "title": "Benjamin Netanyahu"
}