{
 "id": "19434",
 "text": "Hungarian is a Uralic language of the Ugric branch. The Hungarian name for the language is Magyar. The Finno-Ugric languages also include Finnish, Estonian, Lappic (Sámi) and some other languages spoken in Russia. Khanty and Mansi are the most closely-related languages to Hungarian. Although Hungarian is not an Indo-European language, unlike most other European languages, it has a vocabulary with many words from Slavic and Turkic languages and also from German. == Speakers == Hungarian is spoken by approximately 13 million people. Most of them live in Hungary (around 10 million) and Romania (around 1.5 million), but there are also speakers in Slovakia, northern Serbia (Vojvodina), Ukraine and other countries. Hungarian is the official language of Hungary and one of the official languages of the European Union (EU). It is also an official language of the Autonomous Republic of Vojvodina (Serbia) and of some places in the Republic of Slovenia. Hungarian has several dialects, but people can easily understand one another. The Csángó dialect in Romania, however, is archaic and has changed less than the other dialects. Hungarian literary language is based on the Northeastern dialect. Although Hungarian is not an Indo-European language, its vocabulary has many words from Slavic and Turkic languages and also from German. == Grammar == Hungarian grammar is very different from that of Indo-European languages like English. Hungarian has no grammatical gender. For example, there are no separate words for \"he\" and \"she\", but there is one pronoun (ő). Instead of prepositions, (like \"from\" or \"with\"), Hungarian uses suffixes (particles at the end of main words). For example, \"from Budapest\" becomes Budapestről, and \"with Alexandra\" becomes Alexandrával. Another Hungarian feature is vowel harmony: suffixes change according to (harmonise with) the vowel of the main word. If they have a in the word, the suffix normally has a as well (fa \"tree\" and fával \"with a tree\"), and if they have e, the suffix will change to have e as well' (teve \"camel\" and tevével \"with a camel\"). Hungarian words have the accent on the first syllable. == Writing == The Hungarian alphabet is based on the Latin alphabet. Some letters have diacritics (dots or commas above them) and so Hungarian has 44 letters, more than the 26 of English. Since Hungarian writing is mostly phonetic, words can easily be written from their pronunciation. == History == The earliest-known written Hungarian words are to be found in a Latin document, the Foundation Charter of the Abbey of Tihany (1054). The Funeral Oration and Prayer (1192-95) and the Old Hungarian Lament of Mary (13th century) are the earliest-known continuous Hungarian texts. In the 16th century, the first printed Hungarian texts were published. The modern literary language appeared in the 18th and the 19th centuries. Hungarian replaced Latin as the official language of Hungary between 1844 and 1849 and then again in 1867. ==References== == Other websites == * Collection of Hungarian Dictionaries * SZTAKI szótár * Dicfor (DICtionary FOR you) szótár Category:Uralic languages Category:Hungarian culture Category:Languages of Austria Category:Languages of Croatia Category:Languages of Romania Category:Languages of Serbia Category:Slovak culture Category:Languages of Slovenia Category:Languages of Ukraine",
 "title": "Hungarian language"
}