{
 "id": "194331",
 "text": "Fisting is a sexual activity. The fister puts their hand into the vagina or rectum. The fingers are then clenched into a fist or kept straight. Fisting may be done with or without a partner. Fistees is another form of fisting. It is for the more experienced. It may take two fists. This is called double fisting. Double fisting pleasure depends more on stretching of the anus or vagina rather than thrusting with an in-and-out movement of the hands.Herrman 1991, p. 58 Fisting can cause lacerations to the vagina, perineum, rectum, and/or colon. This may result in serious injury.Cohen, C.E., Giles, A., Nelson, M. Sexual trauma associated with fisting and recreational drugs. Sex Transm Infect 2004; 80:469-70. These lacerations may even lead to death.Preuss, J. Death after anal \"fisting\". Arch Kriminol 2008; 221:28-35.Torre, C. Delayed death from fisting. Am J Forens Med Pathol 1987; 8:91.Fain, D.B.; McCormick, G.M. Vaginal \"fisting\" as a cause of death Am J Forens Med Pathol 1989; 10:73-5.Reay, D., Eisele, J. Sexual abuse and death of an elderly lady by \"fisting\". Am J Forens Med Pathol 1983; 4:347-9. Sexual activities that cause air to enter the vagina can lead to a fatal air clot. The risk is probably even higher during pregnancy.Kaiser, R.T.Air embolism death of a pregnant woman secondary to orogenital sex. Acad Emerg Med 1994; 1:555-8. ==Risks== Fisting can cause cutting or tearing or of the vagina, perineum, rectum, and/or colon, resulting in serious injury and even death. In general, sexual activities that cause air to enter the vagina can lead to a fatal air clot, and the risk is probably even higher during pregnancy. Anal fisting carries risks of colorectal tearing; people doing it should use latex gloves and lubricant, and have a safeword, which they can say when they want it to stop immediately. The practice, along with the insertion of hard objects into the anus or the vagina has been significantly related to the traumatization of the vaginal or rectal mucosa in increasing the likelihood of infection, including Hepatitis B virus.\"AIDS and behavior: an integrated approach\", Judith Auerbach. National Academies Press, 1994. , . p. 49 == References == == Other sources == * Donovan B; Tindall B; Cooper D. Brachioproctic eroticism and transmission of retrovirus associated with acquired immune deficiency syndrome (AIDS). Genitourin Med. 1986 Dec;62(6):390-2. * Medical terminology and some information on risks were taken from The Intelligent Man's Guide To Handball, a guide to man-on-man fisting. * * * Category:Sexual acts",
 "title": "Fisting"
}