{
 "id": "194352",
 "text": "Samuel Kuffour (born 3 September 1976) is a former Ghanaian football player. He has played for Ghana national team. He mostly played as a central defender, but was also used as a right full-back from time to time. He had his greatest successes with FC Bayern Munich, with whom he won, among other things, the Champions League once and the German championship and the DFB Cup several times. Known for his physical power, He was a rocky central defender, he was physically strong and skilled in tackling. Regarded as one of the best African defenders of all time, he is also considered to be one of the most decorated players in African football history. ==Club career== Kuffour played for Fantomas Kumasi in his hometown from the age of seven to fourteen and moved to local rivals King Faisal Babes in 1990. In 1991, he got the chance to move abroad and joined the youth department of Torino FC. He played there for two years until FC Bayern Munich signed him. From 1993 to 2005 he played for the German record champions, and from 1994 in the first team. On October 29, 1994, Kuffour made his debut in a 2-2 home game against VfB Stuttgart, against whom he also scored his first Bundesliga goal on October 15, 1997 with the goal to make it 3-3. In retrospect, Kuffour described leaving his homeland early as a difficult step. Shortly before the second half of the 1995/96 season he was loaned to the second division club 1. FC Nürnberg until the end of the season. In January 2001, FC Barcelona showed great interest in the then 24-year-old, but Bayern manager Uli Hoeneß described the Ghanaian as “not for sale”. Kuffour achieved his greatest successes with FC Bayern: He lost the Champions League final against Manchester United in 1999, but won it in Milan in 2001 against FC Valencia. In the following World Cup game against their counterpart from South America, Boca Juniors , Kuffour contributed to the title win with his goal to make it 1-0 after extra time. He also won six German championships, the DFB Cup four times and the League Cup five times. In 175 Bundesliga games, the Ghanaian scored seven times in the opposing goal. After the signing of Lúcio in the summer of 2004, Kuffour was only the number five central defender behind Robert Kovač, Martin Demichelis, Thomas Linke and the Brazilian world champion. So an imminent departure became apparent. In December 2004, Middlesbrough FC 's interest in Kuffour became known, but a move did not materialize. For the 2005/06 season, Kuffour moved to the Italian first division club AS Roma, where he received a three-year contract. After a good start that saw Roma fans compare him to the Brazilian icon Aldair, things quickly went downhill. Kuffour played the 2006/07 season on loan at league rivals AS Livorno. He last played for Livorno in the European Cup. After half a year without playing for AS Roma, Kuffour moved to the first division club Ajax Amsterdam in January 2008, where he was intended to replace the resigned Jaap Stam. Kuffour was unable to close the gap and left Ajax after just two appearances in six months. After a month without a club, the move to FK Khimki in the Russian Premier League was announced as fixed, which, however, turned out to be a newspaper duck ; As a result, Kuffour's agent Giuseppe dello Russo announced Kuffour's end to his career at the beginning of September 2008. Kuffour himself explained that he had just taken a break and was still looking for a new club. In April 2009 he signed a contract with Asante Kotoko, the then champions of the Ghana Premier League, where he finally ended his career after the three-month contract period had expired. Kuffour was known for his consistency and reliability. On good days he was a world-class defender, on great days he was a threat to the team's success. ==International career== Kuffour played his first game for Ghana at the age of 17 against Sierra Leone . From March 5th to 20th, 1993 he took part in the U-20 World Cup in Australia, played six games until the final, which was lost 2-1 to Brazil, and scored on March 9th in the second group game (at 2:2 draw against Germany ) took the 1-0 lead and thus his only goal of the tournament. From August 21 to September 4, 1993, Kuffour took part in the U-17 World Cup in Japan. He played all games except the quarter-finals (1-0 win over Australia), but lost the final 1-2 against Nigeria. Kuffour took part in the Olympic football tournament with the Olympic team in 1992 and 1996. In the first tournament, in the game for third place (1-0 win over Australia), he won the bronze medal with the team. He also took part in the African Championships in 1996, 1998, 2000 ( captain of the senior national team since 1999 ), 2002, 2006, with fourth place in 1996 being the national team's greatest success to date. Kuffour also took part in the 2006 World Cup, where he made such a serious mistake in the first group game against Italy that he was then replaced in his position by Illiasu Shilla. When passing back to the own goalkeeper, the ball unfortunately reached striker Vincenzo Iaquinta, who was ready to take a shot, who made it 2-0 in the 83rd minute and gave his team the preliminary decision. ==Club career statistics== |- |1993–94||rowspan=\"2\"|Bayern Munich||rowspan=\"2\"|Bundesliga||0||0 |- |1994–95||9||0 |- |1995–96||Nürnberg||2. Bundesliga||12||1 |- |1996–97||rowspan=\"9\"|Bayern Munich||rowspan=\"9\"|Bundesliga||22||0 |- |1997–98||17||2 |- |1998–99||15||0 |- |1999–00||18||2 |- |2000–01||23||1 |- |2001–02||21||0 |- |2002–03||20||1 |- |2003–04||23||1 |- |2004–05||7||0 |- |2005–06||Roma||Serie A||21||0 |- |2006–07||Livorno||Serie A||18||0 |- |2007–08||Ajax||Eredivisie||2||0 187||8 39||0 2||0 228||8 |} ===International=== Ghana Ghana Ghana Year Apps Goals 1994 5 0 1995 3 0 1996 9 0 1997 5 1 1998 5 0 1999 2 0 2000 8 2 2001 2 0 2002 1 0 2003 2 0 2004 5 0 2005 1 0 2006 6 0 Total 54 3 ====International goals==== Scores and results list Ghana's goal tally first. Score column indicates score after each Kuffour goal. # Date Venue Opponent Score Result Competition 1 13 July 1997 Accra Sports Stadium, Accra, Ghana 2–1 2–1 1998 African Cup of Nations qualification 2 8 April 2000 Sheikh Amri Abeid Memorial Stadium, Arusha, Tanzania 1–0 1–0 2002 FIFA World Cup qualification 3 23 April 2000 Ohene Djan Stadium, Accra, Ghana 1–0 3–2 ==Honours== ===Club=== ;Bayern Munich * Bundesliga: 1996–97, 1998–99, 1999–2000, 2000–01, 2002–03, 2004–05 * DFB- Pokal: 1997–98, 1999–2000, 2002–03, 2004–05 * DFB-Ligapokal: 2000, 2004 * UEFA Champions League: 2000–01 * Intercontinental Cup: 2001 ===International=== ;Ghana Youth * FIFA U-17 World Championship: 1991 * Summer Olympic Games: Bronze medal 1992 ===Individual=== * CAF Top 30 Best African Players of All Time * Ghana Player of the Year: 1998, 1999, 2001 * Intercontinental Cup Most Valuable Player of the Match Award: 2001 * BBC African Footballer of the Year: 2001 * Africa Cup of Nations: Team of All Tournaments * IFFHS All-time Africa Men's Dream Team: 2021 ==References== Category:1976 births Category:Living people Category:Ghanaian footballers",
 "title": "Samuel Kuffour"
}