{
 "id": "194557",
 "text": "was a Japanese football player and manager. He played for the Japan national team. He also managed the Japan national team. ==Biography== Mori was born in Fukuyama on November 24, 1943. He played for Waseda University. He won 1963 and 1966 Emperor's Cup at the university. After graduating from Waseda University, he joined Mitsubishi Motors (later Urawa Reds) in 1967. The club won Japan Soccer League champions in 1969 and 1973. The club also won 1971 and 1973 Emperor's Cup. He retired in 1977. He played 146 games and scored 28 goals in the league. He was selected Best Eleven 5 times. In October 1964, when Mori was a Waseda University student, he was selected the Japan national team for 1964 Summer Olympics in Tokyo. But he did not play in the match. On December 16, 1966, he debuted against Singapore at 1966 Asian Games. In 1968, he was selected Japan for 1968 Summer Olympics in Mexico City. He played in all matches and Japan won Bronze Medal. In 2018, this team was selected Japan Football Hall of Fame. In 1970, he also played at 1970 Asian Games. He played 56 games and scored 2 goals for Japan until 1976. After retirement, in November 1980, Mori became an assistant coach for the Japan national team under new manager Saburo Kawabuchi. Mori was promoted to manager in April 1981. He managed at 1982 Asian Games and 1984 Summer Olympics qualification. At 1986 World Cup qualification in 1985, Japan defeated Singapore, North Korea and Hong Kong to reach the final round of the East Asian zone to play South Korea. Japan lost 1-3 on aggregate. Mori then led the team to the 1986 Asian Games in Seoul and resigned following the team's failure to reach the second round. In 1992, Mori became a manager for Urawa Reds. However, Urawa Reds finished at the bottom place in 1993 season and he resigned end of the season. In 1998, he signed with Avispa Fukuoka and he managed the club in 1 season. In 2006, Mori was selected to the Japan Football Hall of Fame. On July 17, 2011, he died of renal pelvis cancer in Meguro, Tokyo at the age of 67. That day was the day Japan women's national team won 2011 Women's World Cup, Japan won the world champions for the first time through men and women teams. ==Statistics== |- |1967||rowspan=\"11\"|Mitsubishi Motors||rowspan=\"11\"|JSL Division 1||14||3 |- |1968||14||3 |- |1969||14||2 |- |1970||14||6 |- |1971||10||1 |- |1972||14||0 |- |1973||18||1 |- |1974||18||8 |- |1975||12||4 |- |1976||18||0 |- |1977||0||0 146||28 146||28 |} Japan National Football Team Database |- |1966||4||0 |- |1967||5||1 |- |1968||4||0 |- |1969||4||0 |- |1970||13||0 |- |1971||3||0 |- |1972||8||0 |- |1973||1||1 |- |1974||1||0 |- |1975||9||0 |- |1976||4||0 |- !Total||56||2 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1943 births Category:2011 deaths Category:Footballers from Hiroshima Prefecture Category:Japan international footballers Category:Avispa Fukuoka managers Category:Japan Soccer League players Category:Urawa Red Diamonds players Category:Japan national football team managers Category:Footballers at the 1964 Summer Olympics Category:Footballers at the 1968 Summer Olympics Category:Olympic medalists in football Category:Olympic bronze medalists for Japan Category:Medalists at the 1968 Summer Olympics Category:Urawa Red Diamonds managers",
 "title": "Takaji Mori"
}