{
 "id": "194608",
 "text": "is a former Japanese football player and manager. ==Biography== Sekizuka was born in Funabashi on October 26, 1960. After graduating from Waseda University, he joined Japan Soccer League club Honda in 1984. In the 1984 season, he was selected \"Rookie of the Year award\" and Best Eleven. He played 112 games and scored 36 goals in Japan Soccer League. He retired at the end of the 1990–91 season. After his retirement, Sekizuka became an assistant coach for Kashima Antlers under manager Masakatsu Miyamoto in 1993. In 1995, he moved to Shimizu S-Pulse with Miyamoto. In 1996, he returned to Kashima and coached until 2003. In July 1998 and August 1999, he also managed the club as caretaker manager. In 2004, he moved to J2 League club Kawasaki Frontale and became a manager. In his first season, he led the club to the champions and the club was promoted to the J1 League. In April 2008, he resigned for health reasons. In 2009, he returned the club as manager, but he resigned at the end of the 2009 season. In September 2010, he became a manager for the Japan U-23 national team for the 2012 Summer Olympics and an assistant coach for Japan national team. At the 2012 Summer Olympics, he led Japan to fourth place. From 2013, he managed Júbilo Iwata (2013) and JEF United Chiba (2014-2016). ==Statistics== ===Playing statistics=== |- |1984||rowspan=\"7\"|Honda||rowspan=\"7\"|JSL Division 1||18||11 |- |1985–86||22||10 |- |1986–87||12||0 |- |1987–88||6||0 |- |1988–89||18||4 |- |1989–90||21||8 |- |1990–91||15||1 112||34 112||34 |} ===Managerial statistics=== J.League Data Site Team From To Record G W D L Win % Kashima Antlers 1998 1998 Kashima Antlers 1999 1999 Kawasaki Frontale 2004 2008 Kawasaki Frontale 2009 2009 Júbilo Iwata 2013 2013 JEF United Chiba 2014 2016 Total ==References== ==Other websites== * Category:1960 births Category:Living people Category:Footballers from Chiba Prefecture Category:Kashima Antlers managers Category:Japan Soccer League players Category:Honda FC players",
 "title": "Takashi Sekizuka"
}