{
 "id": "194637",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Takamatsu was born in Ube on September 8, 1981. After graduating from Tatara Gakuen High School, he joined J2 League side Oita Trinita in 2000. He played 6 games and scored 1 goal in his first season. In 2001, he became a regular playing 22 league games and scored 8 goals. The club won the champions in 2002 and was promoted to J1 League. He became a center player of the team with the growing number of young players, Shusaku Nishikawa, Masato Morishige, Mu Kanazaki, Hiroshi Kiyotake and also served captain from 2008. In 2008, although he did not play many matches for injury, the club won the J.League Cup their first major title. At the J.League Cup final, he scored a winning goal and he was selected MVP award. However the club was relegated to J2 League end of 2009 season. Although many main players left the club for financial strain, he remained the club. He moved to FC Tokyo on loan in 2011. He returned to Oita in 2012. He played many matches as substitutes and the club was promoted to J1 League in 2013. However the club was relegated to J2 League in 2014 and J3 League in 2016. In 2016, the club won the champions and was promoted to J2 League in a year. However he could hardly play in the match and retired end of 2016 season. In August 2004, Takamatsu was selected the Japan U-23 national team for 2004 Summer Olympics. He played all 3 matches and scored a goal against Italy. In November 2006, he was selected the Japan national team for 2007 Asian Cup qualification. At this qualification, he debuted against Saudi Arabia on November 15. He played 2 games for Japan until 2007. ==Club statistics== Oita Trinita Club performance Club performance Club performance League League Cup Cup League Cup League Cup Total Total Season Club League Apps Goals Apps Goals Apps Goals Apps Goals Japan Japan Japan League League Emperor's Cup Emperor's Cup J.League Cup J.League Cup Total Total 2000 Oita Trinita J2 League 6 1 1 0 0 0 7 1 2001 22 8 0 0 2 1 24 9 2002 33 6 3 0 - 36 6 2003 J1 League 26 4 0 0 3 1 29 5 2004 24 8 2 0 2 1 28 9 2005 21 5 1 0 3 1 25 6 2006 29 12 2 0 5 1 36 13 2007 30 8 2 2 4 1 36 11 2008 16 0 0 0 5 2 21 2 2009 21 3 1 1 0 0 22 4 2010 J2 League 18 3 1 0 - 19 3 2011 FC Tokyo J2 League 5 0 0 0 - 5 0 2012 Oita Trinita J2 League 32 5 1 0 - 33 5 2013 J1 League 28 5 1 0 1 0 30 5 2014 J2 League 24 3 2 1 - 26 4 2015 22 3 0 0 - 22 3 2016 J3 League 8 1 0 0 - 8 1 Career total Career total Career total 365 75 17 4 25 8 407 87 ==National team statistics== Japan national team Japan national team Japan national team Year Apps Goals 2006 1 0 2007 1 0 Total 2 0 ==References== ==Other websites== * Category:1981 births Category:Living people Category:Footballers from Yamaguchi Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:J3 League players Category:Oita Trinita players Category:FC Tokyo players Category:Footballers at the 2004 Summer Olympics",
 "title": "Daiki Takamatsu"
}