{
 "id": "194619",
 "text": "was a Japanese football player. He played for the Japan national team. ==Biography== Yaegashi was born in Daejeon, Empire of Japan on March 24, 1933, but raised in Hanamaki. After playing at Chuo University, he moved to Waseda University. After graduating from Waseda University, he joined Furukawa Electric in 1958. In 1963, he was selected \"Japanese Footballer of the Year awards\". In 1965, Furukawa Electric joined new league Japan Soccer League. He retired in 1969. He played 51 games and scored 14 goals in the league. He was also selected Best Eleven 3 times (1966, 1967 and 1968). In June 1956, when Yaegashi was a Waseda University student, he was selected the Japan national team for 1956 Summer Olympics qualification. At this qualification, on June 3, he debuted against South Korea. In November, he played at 1956 Summer Olympics in Melbourne. He also played at 1964 Summer Olympics in Tokyo and 1968 Summer Olympics in Mexico City. At 1968 Olympics, he played as a captain in first match against Nigeria, he was replaced for injury in the 78minuts. This match is his last match for Japan. After the match, Although he could not play, he supported Japan team and Japan won bronze medal. In 2018, this team was selected Japan Football Hall of Fame. He also played at 1958, 1962 and 1966 Asian Games. He played 45 games and scored 11 goals for Japan until 1968. In 1967, when Yaegashi played for Furukawa Electric, he became a playing manager as Ryuzo Hiraki successor for the club and managed in 1 season. After retirement, he also managed for Fujitsu 2 times (1977–1981 and 1985–1989). In 2005, Yaegashi was selected Japan Football Hall of Fame. On May 2, 2011, he died of cerebral infarction in Tama at the age of 78. ==National team statistics== Japan national team Japan national team Japan national team Year Apps Goals 1956 3 0 1957 0 0 1958 2 0 1959 5 0 1960 1 0 1961 7 2 1962 7 3 1963 5 4 1964 2 2 1965 4 0 1966 2 0 1967 3 0 1968 4 0 Total 45 11 ==Awards== * Japanese Football Player of Year: 1963 * Japan Soccer League Best Eleven: 1966, 1967, 1968 * Japan Football Hall of Fame: Inducted in 2005 ==References== ==Other websites== * * Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1933 births Category:2011 deaths Category:Footballers from Iwate Prefecture Category:Japan international footballers Category:Japan Soccer League players Category:JEF United Chiba players Category:Footballers at the 1956 Summer Olympics Category:Footballers at the 1964 Summer Olympics Category:Footballers at the 1968 Summer Olympics Category:Olympic medalists in football Category:Olympic bronze medalists for Japan Category:Medalists at the 1968 Summer Olympics",
 "title": "Shigeo Yaegashi"
}