{
 "id": "194766",
 "text": "Sulley Muntari (born 27 August 1984) is a former Ghanaian football player. He played for Internazionale Milano and the Ghanaian national team. A former left-back, Muntari later developed into a powerful, experienced, hard-working, and tenacious midfielder; although he is primarily known for his physical strength and combative playing style, he was also able to make notable improvements to his technical skills throughout his career. He also possesses a good left foot, a powerful shot from outside the area, and is a solid passer of the ball. Widely considered as one of the best Ghana's midfielders in his prime. ==Club career== For the 2002/03 season, the then 18-year-old Muntari moved from Liberty Professionals from Ghana to Serie A club Udinese Calcio. In the summer of 2006, he wanted to move to the Premier League, preferably to Manchester United. In the winter of 2007, several English and Italian clubs, such as AC Milan, showed interest in the Ghanaian midfielder. However, Udinese Calcio rejected an offer of over eleven million euros in the winter. In the summer of 2007, Muntari moved to Portsmouth FC for the equivalent of ten million euros. He signed a contract until 2012. In 2008, he won the FA Cup with Portsmouth. In the summer of 2008, Muntari returned to Italy to join Inter Milan for 14 million euros. He signed a five-year contract. After Muntari was no longer able to progress beyond the role of a substitute at Inter, he was loaned to AFC Sunderland for six months in January 2011. There he met John Mensah and Asamoah Gyan, with whom he also plays in the Ghanaian national team. On 31 January 2012, Inter Milan loaned Muntari to AC Milan until the end of the season. He was later given a two-year contract until 30 June 2014. On 30 June 2015, it was announced that Muntari's contract with AC Milan was terminated by mutual consent. He has been under contract with Ittihad FC since July 27, 2015. His contract there is for two years. However, the contract was terminated in July 2016. Muntari was looking for a club until January 2017, before joining Italian first division club Delfino Pescara 1936. He only made 9 appearances for the second division club. After another long period without a club, he signed with Deportivo La Coruña on 22 February 2018. In 2019, he was briefly under contract with Albacete Balompié. In 2022, he returned to his homeland and signed a contract with Accra Hearts of Oak. ==International career== Muntari made his debut for the Ghanaian national team on May 17, 2002 in a friendly match against Slovenia. At the 2006 World Cup in Germany he scored in the important 2-0 win against the Czech Republic, but was unable to play in the 2-1 win against the USA due to his second yellow card. Nevertheless, he played a huge part in Ghana reaching the round of 16, which they lost to Brazil. In the opening match of the 2008 African Cup of Nations against Guinea, Muntari scored the decisive 2-1 goal for Ghana in extra time and took his national team to third place. He was not considered for the 2010 Africa Cup of Nations for disciplinary reasons. During a test match before the 2010 World Cup against the Netherlands (1:4), there was a dispute on the field between Muntari and Hans Sarpei, who urged Muntari to play more as a team. At the 2010 World Cup, Muntari only played for thirteen minutes in the first two group matches against Australia. After he became abusive to the coach, he was briefly banned from the squad before the last group match. After Muntari apologized, however, this decision was reversed and he made a brief appearance in the round of 16 victory over the USA. In the quarter-final against Uruguay, he then made his first start and scored the interim 1:0. Nevertheless, Ghana were unfortunately eliminated in the penalty shootout and thus missed the chance to become the first African team to advance to a World Cup semi-final. On 13 May 2014, he was called up to the squad of the Ghana national football team for the 2014 World Cup. After an argument with an association official, he was suspended indefinitely by the Ghana FA on 26 June 2014 and removed from the squad. ==Career statistics== ===Club=== Club Season League National Cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Udinese 2002–03 Serie A 12 0 2 0 — — 14 0 2003–04 Serie A 23 0 4 0 1 0 — 28 0 2004–05 Serie A 33 2 6 0 2 0 — 41 2 2005–06 Serie A 29 3 0 0 11 0 — 40 3 2006–07 Serie A 28 3 2 1 — — 30 4 Total 125 8 14 1 14 0 — 153 9 Portsmouth 2007–08 Premier League 29 4 4 1 — — 33 5 Internazionale 2008–09 Serie A 27 4 3 0 7 1 1 1 38 5 2009–10 Serie A 27 2 5 0 9 0 1 0 42 2 2010–11 Serie A 8 1 1 0 3 0 1 0 13 1 2011–12 Serie A 4 0 0 0 0 0 — 4 0 Total 66 7 9 0 19 0 3 1 97 8 Sunderland (loan) 2010–11 Premier League 9 1 0 0 — — 9 1 Milan (loan) 2011–12 Serie A 13 3 1 0 0 0 — 14 3 Milan 2012–13 Serie A 15 1 1 0 2 1 — 18 2 2013–14 Serie A 26 5 0 0 8 1 — 34 6 2014–15 Serie A 16 2 1 0 — — 17 2 Total 70 11 3 0 10 2 — 83 13 Al-Ittihad 2015–16 Saudi Professional League 18 2 3 0 5 1 3 0 29 3 Pescara 2016–17 Serie A 9 1 0 0 — — 9 1 Deportivo La Coruña 2017–18 La Liga 8 0 0 0 — — 8 0 Albacete 2018–19 Segunda División 2 0 0 0 — — 2 0 Hearts of Oak 2021–22 Ghana Premier League 11 1 3 0 0 0 1 0 15 1 Career total 347 35 36 2 48 3 7 1 438 41 ===International=== Appearances and goals by national team and year National team Year Apps Goals Ghana 2002 2 2 2003 1 0 2004 5 1 2005 6 2 2006 11 3 2007 8 2 2008 12 4 2009 6 2 2010 6 2 2011 10 1 2012 8 1 2013 5 2 2014 4 0 Total 84 20 :Scores and results list the Ghana's goal tally first, score column indicates score after each Muntari goal. List of international goals scored by Sulley MuntariSulleyman Ali \"Sulley\" Muntari - Goals in International Matches - RSSSF Goal Date Venue Opponent Score Result Competition 1 20 June 2004 Baba Yara Stadium, Kumasi, Ghana 1–0 3–0 2006 FIFA World Cup qualification 2 14 November 2005 King Fahd International Stadium, Riyadh, Saudi Arabia 2–1 3–1 Friendly 3 8 October 2005 Estádio da Várzea, Praia, Cape Verde 2–0 4–0 2006 FIFA World Cup qualification 4 29 May 2006 Walkers Stadium, Leicester, England 3–0 4–1 Friendly 5 4 June 2006 Easter Road, Edinburgh, Scotland 2–0 3–1 Friendly 6 17 June 2006 RheinEnergieStadion, Cologne, Germany 2–0 2–0 2006 FIFA World Cup 7 7 February 2007 Wembley Stadium, London, England 4–0 4–1 Friendly 8 24 March 2007 UPC-Arena, Graz, Austria 1–1 1–1 Friendly 9 20 January 2008 Ohene Djan Stadium, Accra, Ghana 2–1 2–1 2008 Africa Cup of Nations 10 28 January 2008 Ohene Djan Stadium, Accra, Ghana 2–0 2–0 2008 Africa Cup of Nations 11 9 February 2008 Baba Yara Stadium, Kumasi, Ghana 1–0 4–2 2008 Africa Cup of Nations 12 22 June 2008 Ohene Djan Stadium, Accra, Ghana 2–0 2–0 2010 World Cup qualification 13 12 August 2009 Brisbane Road, London, England 3–0 4–1 Friendly 14 6 September 2009 Ohene Djan Stadium, Accra, Ghana 1–0 2–0 2010 World Cup qualification 15 3 March 2010 Koševo Stadium, Sarajevo, Bosnia and Herzegovina 1–1 1–2 Friendly 16 2 July 2010 Soccer City, Johannesburg, South Africa 1–0 1–1 2010 FIFA World Cup 17 27 March 2011 Stade de la Revolution, Brazzaville, Congo 3–0 3–0 2012 Africa Cup of Nations qualification 18 1 June 2012 Baba Yara Stadium, Kumasi, Ghana 1–0 7–0 2014 World Cup qualification 19 7 June 2013 Al-Merrikh Stadium, Omdurman, Sudan 3–1 3–1 2014 World Cup qualification 20 15 October 2013 Baba Yara Stadium, Kumasi, Ghana 5–1 6–1 2014 World Cup qualification ==Honours== Portsmouth * FA Cup: 2007–08 Inter Milan *Serie A: 2008–09, 2009–10 *Coppa Italia: 2009–10 *Supercoppa Italiana: 2008, 2010 *UEFA Champions League: 2009–10 *FIFA Club World Cup: 2010 Hearts of Oak * President's Cup: 2022 * Ghanaian FA Cup: 2022 Ghana U20 * African Youth Championship runner-up: 2001 * FIFA U-20 World Cup runner-up: 2001 Ghana * Africa Cup of Nations third place: 2008 Individual *CAF Team of the Year: 2008 *Africa Cup of Nations Team of the Tournament: 2008 *Calcio Trade Ball Lifetime Achievement Award: 2022 == References == Category:1984 births Category:Living people Category:Ghanaian footballers Category:Ghanaian Muslims Category:Portsmouth F.C. players Category:Premier League players Category:Sunderland A.F.C. players Category:2006 FIFA World Cup players Category:2010 FIFA World Cup players Category:2014 FIFA World Cup players",
 "title": "Sulley Muntari"
}