{
 "id": "194981",
 "text": "Millionaires is an American electronic trio from Los Angeles, California. It was started in 2007 by three girls, Melissa Marie Green, Allison Green, and Dani Artaud. They are very popular on MySpace. The girls are notable for their mostly negative reaction from other people. They also performed one show for the TV show Double Shot at Love with the Ikki Twins. ==History== Millionaires started in August 2007, when Melissa Marie and Allison made a song on their new laptop with GarageBand. They named the song \"I Like Money\", and decided they needed a name for themselves to make a MySpace profile for the song. Melissa Marie and Allison decided on Millionaires, to go with the name of the song. Soon after, Dani came in the mix, and they made their second song, \"Hoe Down.\" After a few months, they began to perform shows locally and traveled only small distances for shows. They got spots in music festivals such as Rockin Roots,Bamboozle Left 2008,and Audio Overload 2008. By July 2008, they were ready to tour and they went out on their first tour co-headlining with another band, Breathe Carolina across the West coast. Later in July, they headlined the GET F$CKED UP tour. In July 2008, they performed on MTV's TRL as part of On The Radar, a show where popular bands not signed to a record label perform. The girls returned in January and February 2009 on their Just Got Paid, Let's Get Laid tour, which sold out every date. They made a short song titled \"Ooh Uh Huh\", which became the theme song for MTV's reality show \"A Double Shot At Love\" with the Ikki twins. Their song \"Hey Rich Boy\" was also used as the theme for MTV's Teen Cribs. ===Decaydance controversey=== Before Millionaires were to release their second EP, Just Got Paid, Let's Get Laid, it was rumored that the Millionaires were signed to Decaydance after Gabe Saporta from Cobra Starship convinved Pete Wentz to sign them on to the label. Later Wentz sent a message saying that Millionaires were not signed to Decaydance, and that Crush management had asked them to produce hard copies of their EP. ==Tours== *They co-headlined a tour across the west coast with Breathe Carolina in July 2008. *They headlined the \"GET F$CKED UP\" tour in July-August 2008 with Hyper Crush, BrokeNCYDE, And Then There Were None, and The Arrival. *They headlined the \"Just Got Paid, Let's Get Laid\" tour in January-February 2009 with Cash Cash, I Set My Friends On Fire, and Watchout! There's Ghosts. *They were on every date of the 2009 Vans Warped Tour, playing on the Skull candy and Hurley.com stages. On the tour, they received a strong negative reaction from Warped Tour crowds, including having things thrown at them from the stands. They also have been accused of lip syncing at shows on the tour. ==Discography== ===EPs=== Date of Release Title Label July 2, 2008 Bling, Bling, Bling! Self-Released June 23, 2009 Just Got Paid, Let's Get Laid Decaydance ===Unreleased Songs=== *Prom Dress *Ooh Uh Huh *Take Your Shirt Off *Up in My Bubble *The Weekend ==References== ==Other websites== *Myspace Page Category:Musical groups from Huntington Beach, California Category:2007 establishments in California Category:Musical groups established in 2007",
 "title": "Millionaires (group)"
}