{
 "id": "195255",
 "text": "Giza Necropolis (also called the Giza pyramid complex) is a necropolis on the Giza Plateau near the city of Cairo, Egypt. It is about 8 kilometres (5 mi) inland into the desert from the ancient town of Giza on the Nile, and about 25 kilometres (15 mi) southwest of Cairo city centre. The Great Pyramid is the only remaining monument of the Seven Wonders of the World. Construction is thought to have taken 20,000 workers and 20 years. == Major parts of the complex == * Pyramid of Khufu * Pyramid of Khafre * Pyramid of Menkaure * Great Sphinx * Khufu ship == Construction of the Great Pyramid == There have been many theories to explain how the pyramids were built. These theories include: * the use of external or outside ramps * the use of cranes * the use of an internal or inside ramp. This idea was developed by Jean-Pierre Houdin, a French architect. He has also made detailed computer models of the Great Pyramid. Houdin says that the ramp spirals upward. There is evidence in the notched corners of the pyramid. Not only was the spiraling internal ramp used, but an external ramp was probably used to move the bigger blocks. These are in the lower half of the pyramid and probably used simple cranes to lift them. == More reading == * Lehner, Mark 1997. The Complete Pyramids. Thames & Hudson, 1997. * Manley, Bill (ed) The Seventy Great Mysteries of Ancient Egypt. Thames & Hudson. * Mysteries of Egypt National Geographic Society, 1999. . * Rhys- Davies, John 1995. Riddles of the monument builders: Who built the Sphinx? Time-Life Video, 1995. * Hai, Paul 2007. Raising Stone 1: Paul Hai's racks & pinions theory. . * Wirsching, Armin 2009. Die Pyramiden von Giza - Mathematik in Stein gebaut, 2nd ed. == Other websites == * Wiki Satellite view of Giza Plateau at WikiMapia * 3D model of the pyramids for use in Google Earth * Aerial view of Giza pyramids at Windows Live Local * - QTVR fullscreen panoramas on Giza Plateau (DevalVR plugin needed) * Pyramids in Giza Pictures of Giza Pyramids published under Creative Commons License * Pyramids of Giza, the virtual tour Category:Buildings and structures in Ancient Egypt Category:Seven Wonders of the World Category:Pyramids Category:Archaeological sites in Egypt Category:World Heritage Sites in Egypt Category:3rd millennium BC buildings and structures Category:Giza Governorate",
 "title": "Giza Necropolis"
}