{
 "id": "195291",
 "text": "Bisexual pornography is a genre of pornography which generally shows one woman and two men, all perform sex acts with each other. Bisexual pornography is separate from threesome pornography, which shows one man and two women. As most pornography is marketed to men, most bisexual porn is advertised to straight or bisexual men. Very few customers of bi-porn say they are gay. Producers who use the term \"bisexual porn\" are usually showing what a bisexual or bi-curious man might wish to see. Sex acts between a man and a woman, as well as between two men. A common way that these are shown in a single scene is with one woman and two men performing together. == Pornographic movie industry == Images and videos showing male bisexuality have been more popular since the start of internet pornography. However the area is still a very small grouping of the pornographic DVD market. For example, at porn seller HotMovies.com, there are only 655 bisexual movies out of a showing of more than 90,000 movies. Bisexual DVDs sell much better online than in adult video stores. This may be because customers in stores feel embarrassed to buy them. Most bisexual porn is made by small companies rather than the major studios. Actors are mostly new at porn. Any well-known actors in bisexual porn usually are from the gay pornography industry, although they may not be gay or even bisexual in their personal life. Heterosexual actors and actresses who have appeared in bisexual porn, for example Kurt Lockwood, have had their sexual orientation doubted, and have been accused by the gay community of being in denial about their homosexuality. == Sex acts depicted == Bisexual pornography may include any of the following: * The female performer may encourage the two men to engage in sex acts together. She may do this by talking to them, or by masturbating as she watches them. In some videos, the woman may demand that her \"straight\" husband or boyfriend do sex acts with the other man as \"punishment\" for cheating (see Cuckold). Usually the \"husband\" performs oral sex on the other man, or receives anal sex from him. * The performers may create a \"daisy chain,\" in which all three participants perform and receive oral sex at the same time. * A man and woman have vaginal intercourse (from behind or reverse cowgirl), while a third person performs oral sex on the woman and/or on the man. * The two men may perform anal sex, with the woman masturbating or sucking the receiving man. * The two men may perform anal sex, with the woman receiving cunnilingus from one or both of them. * The two men may perform anal sex, while the bottom man has vaginal intercourse with the woman. The man in the middle is referred to with the slang term \"Lucky Pierre\". * The woman may perform anal sex on one of the men using a strap-on, while the other man receives anal from that man, or performs frot with him, or performs anal on the woman. * Two of the performers may engage in intercourse, while the third urinates on them. == References == Category:Pornography Category:Bisexuality",
 "title": "Bisexual pornography"
}