{
 "id": "195285",
 "text": "Power Rangers is a superhero media franchise created by Haim Saban, that is currently owned by Hasbro. The seasons are adapted from Japanese Super Sentai shows. It was owned by Saban Entertainment from 1993 until The Walt Disney Company bought the franchise in September 2001. Disney sold the franchise back to Saban in May 2010. In May 2018, Saban sold the franchise to Hasbro. == Plot == In each series, a group of young people gain super powers to protect citizens and fight evil. Throughout the series, the Power Rangers learn the importance of teamwork and perseverance as they battle progressively harder- to-defeat villains. The rangers have a mentor, teaching figure to help lead, and mechanical machines known as Zords to help fight the villains. Each series is connected in the same fictional universe and most series have a theme. ==Main franchise== === Television series === Year Series Title Network Episodes 1993 1 Mighty Morphin Power Rangers Fox Kids 60 1994 2 52 1995 3 33 1996 Spin-off Mighty Morphin Alien Rangers 10 4 Power Rangers Zeo 50 1997 5 Power Rangers Turbo 45 1998 6 Power Rangers In Space 1999 7 Power Rangers Lost Galaxy 2000 8 Power Rangers Lightspeed Rescue 40 2001 9 Power Rangers Time Force 2002 10 Power Rangers Wild Force ABC Kids 2003 11 Power Rangers Ninja Storm 2004 12 Power Rangers Dino Thunder 38 2005 13 Power Rangers S.P.D. Toon Disney 2006 14 Power Rangers Mystic Force 32 2007 15 Power Rangers Operation Overdrive 2008 16 Power Rangers Jungle Fury 2009 17 Power Rangers RPM ABC Kids 2010 18 Power Rangers Squadron Blitz Nickelodeon 32 2011 19 Power Rangers Samurai 23 2012 20 Power Rangers Super Samurai 2013 21 Power Rangers Megaforce 2014 22 Power Rangers Super Megaforce 2015 23 Power Rangers Dino Charge 2016 24 Power Rangers Dino Super Charge 2017 25 Power Rangers Ninja Steel 2018 26 Power Rangers Super Ninja Steel 2019 27 Power Rangers Beast Morphers 2020 28 2021 29 Power Rangers Dino Fury 2022 30 Netfix 2023 31 Power Rangers Cosmic Fury 10 === Movies === Year Title Director Distributor Box office 1995 Mighty Morphin Power Rangers: The Movie Bryan Spicer 20th Century Fox $66,433,194 1997 Turbo: A Power Rangers Movie David Winning & Shuki Levy $9,615,840 2023 Mighty Morphin Power Rangers: Once & Always Dean Israelite Netflix $66,433,194 TBA Untitled Power Rangers second reboot movie TBA Netflix ==Other movies== * Power Rangers Super Samurai, The Movie: Clash of the Red Rangers (2011) * Power Rangers (2017) ==Power Rangers RPG web series== * Power Rangers Hyperforce * Power Rangers Day of Destiny ==Colors== Series Rangers Mighty Morphin Alien Rangers Zeo Turbo In Space Lost Galaxy Lightspeed Rescue Time Force Wild Force Ninja Storm Dino Thunder S.P.D. Mystic Force Operation Overdrive Jungle Fury RPM Samurai and Super Samurai Megaforce Super Megaforce Dino Charge and Dino Super Charge Ninja Steel and Super Ninja Steel Beast Morphers Dino Fury Cosmic Fury == Video games == * 1994 - Mighty Morphin Power Rangers (Released for Sega Genesis, Super Nintendo Entertainment System, Game Boy, Game Gear, and Sega CD) * 1995 - Mighty Morphin Power Rangers: The Movie (Released for Sega Genesis, Super Nintendo Entertainment System, Game Boy, and Game Gear) * 1995 - Mighty Morphin Power Rangers: The Fighting Edition (Released for Super Nintendo Entertainment System) * 1996 - Power Rangers Zeo: Battle Racers (Released for Super Nintendo Entertainment System) *1996 - Power Rangers Zeo: Full Tilt Battle Pinball (Released for PlayStation) *1996 - Power Rangers Zeo vs. The Machine Empire (Released for Microsoft Windows, Macintosh, and Bandai Pippin) *2000 - Power Rangers Lightspeed Rescue (Released for Game Boy Color, Macintosh, Nintendo 64, PlayStation, and Microsoft Windows) *2001 - Power Rangers Time Force (Released for Game Boy Color, Game Boy Advance, PlayStation, and Microsoft Windows) *2002 - Power Rangers Wild Force (Released for Game Boy Advance) *2003 - Power Rangers Ninja Storm (Released for Game Boy Advance, and Microsoft Windows) *2004 - Power Rangers Dino Thunder (Released for Game Boy Advance, GameCube, and PlayStation 2) *2005 - Power Rangers S.P.D. (Released for Game Boy Advance) *2007 - Power Rangers: Super Legends (Released for Nintendo DS, PlayStation 2, and Microsoft Windows) *2011 - Power Rangers Samurai (Released for Wii, and Nintendo DS) *2012 - Power Rangers Super Samurai (Released for Xbox 360) *2013 - Power Rangers Megaforce (Released for Nintendo 3DS) *2014 - Power Rangers Super Megaforce (Released for Nintendo 3DS) *2015 - Power Rangers Dash (Released for iOS, and Android) *2015 - Power Rangers Unite (Released for iOS, and Android) *2015 - Power Rangers Dino Charge Rumble (Released for iOS, and Android) *2017 - Mighty Morphin Power Rangers: Mega Battle (Released for PlayStation 4) *2017 - Power Rangers: Legacy Wars (Released for iOS, and Android) *2018 - Power Rangers: All Stars (Released for iOS, and Android) *2019 - Power Rangers: Battle for the Grid (Released for PlayStation 4, Xbox One, Nintendo Switch, PC, and Stadia) *2022 - Power Rangers Morphin Legends (Released for iOS, and Android) *2024 - Power Rangers It's Morphing Time (Released for PlayStation 4) *2024 - Mighty Morphin Power Rangers: Rita Rewind (Released for PlayStation 4) Aditionally, the 2015 indie tactical RPG Chroma Squad is inspired by Power Rangers. == Other websites == * Official website Category:American television series Category:Media franchises Category:Superhero television shows Category:Mighty Morphin Power Rangers",
 "title": "Power Rangers"
}