{
 "id": "19530",
 "text": "A politician (from Classical Greek πόλις, \"polis\") can be anyone who seeks to get power in any bureaucratic institution. It is most used for a person active in party politics, or a person holding or seeking office in government. In democratic countries, politicians seek elective positions within a government through elections or, at times, temporary appointment to replace politicians who have died, resigned or have been otherwise removed from office. In non- democratic countries, they employ other means of reaching power through appointment, bribery, revolutions and intrigues. Some politicians are experienced in the art or science of government. Politicians propose, support and create laws or policies that govern the land and, by extension, its people. The word politician is sometimes replaced with the word statesman. Politicians have always used language, as in speeches or campaign advertisements. They use common themes to develop their political positions in terms familiar to the voters.Jonathan Charteris-Black, Politicians and rhetoric: The persuasive power of metaphor (Palgrave-MacMillan, 2005) Politicians become experts at using the media Ofer Feldman, Beyond public speech and symbols: Explorations in the rhetoric of politicians and the media (2000). With the rise of mass media in the 19th century they made heavy use of newspapers, magazines, and pamphlets, as well as posters.Robert J. Dinkin, Campaigning in America: A History of Election Practices (1989) online The 20th century brought radio and television, and television commercials became the single most expensive part of an election campaign.Kathleen Hall Jamieson and Keith Spillette, The Press Effect: Politicians, Journalists, and the Stories that Shape the Political World (2014) In the 21st century, they have become increasingly involved with social media based on the Internet and smartphones.Nathaniel G. Pearlman, Margin of Victory: How Technologists Help Politicians Win Elections (2012) online == Common political offices == * Alderman * Assemblyman * Chancellor * City manager * Congressperson * Councillor * County executive * Governor ** Lieutenant governor * Mayor ** Deputy mayor * Member of Parliament * Minister * President ** Vice President * Prime Minister * Representative * Senator == References == == Other websites == * Noam Chomsky - Why Do Politicians Lie? YouTube * Professor Colin Hay on 'Why we hate politics'; YouTube Category:Occupations",
 "title": "Politician"
}