{
 "id": "195533",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Soejima was born in Saga on July 26, 1959. After graduating from Saga Commercial High School, he joined Japan Soccer League club Yanmar Diesel in 1978. After reserve team in 2 season, he was promoted top team in 1980. In 1980, the club won the champions in Japan Soccer League and he was selected Best Eleven. The club also won 1983 JSL Cup and 1984 Emperor's Cup. He played 167 matches for the club until 1991. In 1991, he moved to Division 2 club Sumitomo Metal and played in 1 season. He retired in 1992. On June 9, 1980, Soejima debuted for the Japan national team against Hong Kong. He played 3 games for Japan in 1980. After retirement, Soejima started coaching career at Kashima Antlers (former Sumitomo Metal) in 1992. He moved to Gamba Osaka in 1996. In 1998, he returned to Cerezo Osaka (former Yanmar Diesel) and became a manager in 2000. He was sacked in August 2001. He managed his local club Sagan Tosu in 2002 and Vissel Kobe in 2003. In 2005, he returned to Cerezo Osaka and managed youth team until 2008. He moved to Kataller Toyama and became an assistant coach. In 2010, he moved to Thespa Kusatsu and managed until 2012. ==Statistics== |- |1980||rowspan=\"11\"|Yanmar Diesel||rowspan=\"11\"|JSL Division 1||18||0 |- |1981||11||1 |- |1982||18||0 |- |1983||2||0 |- |1984||18||0 |- |1985/86||22||0 |- |1986/87||20||1 |- |1987/88||21||0 |- |1988/89||19||4 |- |1989/90||11||0 |- |1990/91||7||0 |- |1991/92||Sumitomo Metal||JSL Division 2||15||0 182||6 182||6 |} Japan National Football Team Database |- |1980||3||0 |- !Total||3||0 |} ==References== ==Other websites== * Category:1959 births Category:Living people Category:Footballers from Saga Prefecture Category:Japan international footballers Category:Cerezo Osaka managers Category:Japan Soccer League players Category:Cerezo Osaka players Category:Kashima Antlers players",
 "title": "Hiroshi Soejima"
}