{
 "id": "195716",
 "text": "Derwent Valley Mills is the UNESCO World Heritage Site in Derbyshire, England.UNESCO, \"Derwent Valley Mills\". Retrieved 2012-4-23. The site covers several factory communities which were built in the 18th and 19th centuries in a valley of the River Derwent, upstream from Derby. ==History== Industrial development in the area started with the Silk Mill which was built in Derby in 1721 by John and Thomas Lombe. In 1771, Richard Arkwright built a water- powered spinning mill at Cromford. In 1776-1777, a larger mill was built nearby. The \"factory system \"evolved from these two cotton mills. Arkwright's inventions were first put into industrial-scale production. The workers' housing was near the mills. The mills and houses make up an architectural record of the development of the area. * Cromford's mills include Masson Mill, Upper Mill (1771) and Lower Mill (1776). There buildings with various original functions: warehouses, workshops, a loom shop, mill managers' houses, etc. The Cromford Canal was built in the 1790s as part of a route to Manchester. * Belper's mills were Belper North Mill (1804) and East Mill (1912). Its houses are built from gritstone or locally made brick and roofed with Welsh slate. * Milford's factory buildings have been taken down, but much of the housing survives. Many of the houses are in rows because of the hilly nature of the area. The public buildings established by the Strutts include schools, churches, and public houses. * Darley Abbey had five water-powered mills - a paper mill, a corn mill, two flint mills (for porcelain production) and a leather mill. The changes in the valley, including the creation of workers' housing, were important in the Industrial Revolution. == Related pages == * List of World Heritage Sites of the United Kingdom ==References== ==Other websites== * Derwent Valley Miils website at DerwentValleyMills.org * Derwent Valley Mills at WorldHeritageSite.org Category:Buildings and structures in Derbyshire Category:World Heritage Sites in the United Kingdom Category:1721 establishments Category:1720s establishments in Europe Category:18th-century establishments in England",
 "title": "Derwent Valley Mills"
}