{
 "id": "195720",
 "text": "The Très Riches Heures du Duc de Berry or simply the Très Riches Heures (The Very Rich Hours of the Duke of Berry) is a richly decorated Book of Hours. Such books contained prayers to be said by lay faithful at each of the canonical hours of the day. The book was commissioned by Jean, Duc de Berry around 1410. It is probably the most important illuminated manuscript of the 15th century, \"le roi des manuscrits enluminés\" (\"the king of illuminated manuscripts\"). The Très Riches Heures has 416 pages. 131 of them have large miniatures, many more have border decorations or historiated initials. These artworks are among the high points of International Gothic painting, even though they are very small. There are 300 decorated capital letters. The book was worked on, over a period of nearly a century, in three main campaigns, led by the Limbourg brothers, Barthélemy van Eyck, and Jean Colombe. The book is now Ms. 65 in the Musée Condé, Chantilly, France. ==References== *Bober, Harry. \"The Zodiacal Miniature of the Tres Riches Heures of the Duke of Berry: Its Sources and Meaning.\" Journal of the Warburg and Courtauld Institutes 11, no. 1948 (1948). *Cazelles, Raymond, and Johannes Rathofer. Book Title Illuminations of heaven and earth : the glories of the Très riches heures du duc de Berry. New York: H.N. Abrams, 1988. *Longnon, John, Raymond Cazelles, and Millard Meiss. The Tres Riches Heures of Jean, Duke of Berry. New York: G. Braziller, 1969. *Manion, Margaret M. \"Psalter Illustration in the Très Riches Heures of Jean de Berry.\" Gesta (International Center of Medieval Art) 34, no. 2 (1995): 147–161. * Michael Camille. “The Très Riches Heures: An Illuminated Manuscript in the Age of Mechanical Reproduction.” Critical Inquiry 17 (Autumn 1990). 72–107. Category:Illuminated manuscripts Category:French literature Category:Religion in France Category:15th-century books Category:15th century in art",
 "title": "Très Riches Heures du duc de Berry"
}