{
 "id": "19599",
 "text": "The Gabonese Republic, or Gabon, is a country in Africa. It is located on the equator. It has borders with Equatorial Guinea, Cameroon, and the Republic of the Congo. Its capital is Libreville, which is also the largest city in the country. Gabon has an area of almost . About 2.3 million people live in Gabon. Gabon was a colony of France. It became a new country on August 17, 1960. Since 1960, the country has had only 3 presidents. At first it had one-party rule. In the early 1990s, the country switched to a multi-party government. Gabon is one of the richest countries in Sub-Saharan Africa. It has 4th highest HDI and third highest GDP per capita (PPP) in the region. Gabon has high levels of income inequality, and there are significant amounts of poverty in the country. ==History== Not much is known about the history of Gabon before European contact. The first people who lived in the country were pygmies. Later, Bantu people took over the area after moving down from the North. Not much is known of the local culture, other than tribal art that exists. In the 15th century, the Portuguese were first Europeans to visit the area. At that time, the coast of Gabon was ruled by the Kingdom of Loango. That was a state that included parts of what is today Angola and Republic of Congo. The Portuguese first settled on the islands of São Tomé, Príncipe, and Fernando Pó. But they visited the coast of Gabon regularly. The Portuguese named Gabon region after their word gabão which means a coat with sleeve and hood. Starting from the 16th century, the coast was used for slave trade. In the 19th century, the French made Gabon part of their Colonial empire. At this time much exploration was done of Gabon's dense jungles. The explorer Pierre Savorgnan de Brazza was one of the most famous to do so. In 1849, freed slaves founded Libreville, which later became the capital. In 1910 Gabon was one of the French colonies which formed French Equatorial Africa (together with Congo, Central African Republic and Chad). French Equatorial Africa lasted to 1959. On 17 August 1960, Gabon became a new country. Since 1960, Gabon has only had 3 presidents. In 1961 Léon M'ba became the first president. In 1967 after his death Omar Bongo became the president and ruled the country to 2009. In 2009, Omar Bongo died and his son Ali Bongo Ondimba took over as president. In June 2022, Gabon joined the Commonwealth of Nations. ==Geography== Gabon is on the Atlantic coast of central Africa. It is on the equator. Gabon generally has an equatorial climate. Rainforests cover 85% of the country. There are three distinct regions: the coastal plains (ranging between 20 and 300 km from the ocean's shore), the mountains (the Cristal Mountains to the northeast of Libreville, the Chaillu Massif in the centre, culminating at 1575 m with Mont Iboundji), and the savanna in the east. The coastal plains form a large section of the World Wildlife Fund's Atlantic Equatorial coastal forests ecoregion and contain patches of Central African mangroves especially on the Muni River estuary on the border with Equatorial Guinea. Gabon's largest river is the Ogooué which is 1200 km long. Gabon has three karst areas where there are hundreds of caves in the dolomite and limestone rocks. Some of the caves include Grotte du Lastoursville, Grotte du Lebamba, Grotte du Bongolo, and Grotte du Kessipougou. Many caves have not been explored yet. A National Geographic Expedition visited the caves in the summer of 2008 to document them (Expedition Website ). ==Politics== The first Gabonese president was Leon Mba. His successor was Omar Bongo, from 1967 until his death in 2009. Under his governance Gabon had just one political party between 1968 and 1990. It was called PDG. ===Provinces and departments=== Gabon is divided into nine provinces. The provinces are divided into departments. The provinces are: # Estuaire # Haut-Ogooué # Moyen-Ogooué # Ngounié # Nyanga # Ogooué-Ivindo # Ogooué-Lolo # Ogooué-Maritime # Woleu-Ntem ==Economics== Gabon has nine states. The soil of Gabon is rich in the metals uranium, manganese, and petrolium. Therefore, these three elements, such as metal exploited in Port- Gentil, uranium in Munana, and the manganese in Franceville. ==Culture== Gabon has a wide culture. Before colonialism, Gabon's people believed their ancestral spirit as religion, like bwiti, mvett, djobi. After colonialism, others religions such as Christianity and Islam came to be added to the first animist believers. The Gabon national football team has represented the nation since 1962. Gabon were joint hosts, along with Equatorial Guinea, of the 2012 Africa Cup of Nations. They were the only hosts of the competition's 2017 tournament. Gabon has excellent recreational fishing. It is considered one of the best places in the world to catch Atlantic tarpon. == Books about Gabon == * Maria Petringa, Brazza, A Life for Africa (2006) ==Related pages== * Gabon at the Olympics * Gabon national football team * List of rivers of Gabon ==References== Category:Members of the Organisation of Islamic Cooperation Category:1960 establishments in Africa Category:Commonwealth member states Category:French-speaking countries",
 "title": "Gabon"
}