{
 "id": "19594",
 "text": "Windows 98 is an operating system for computers. Released on June 25, 1998 by Microsoft, it is the successor of Windows 95. It came before Windows Me. Support for Windows 98 ended on July 11, 2006. Windows 98 was seen by many as a small upgrade to Windows 95, rather than a rebuilt version of Windows. The biggest changes were: * Internet Explorer (a web browser) was made part of the GUI (what the user sees) and the file manager. This had already happened in the last versions of Windows 95 that were released. This is called 'web integration'. *Larger disk partitions (separations) were allowed. *New tools were added to help make the computer run the way a user wants it to. System Configuration Utility is a tool that lets users turn off programs they do not need to use the computer. Disk Cleanup let users delete old files the computer made. *Some add-ons that were made for Windows 95 were included with Windows 98, such as the changes to the shell from Microsoft Plus! for Windows 95. Because Microsoft made Internet Explorer such an important part of Windows 98, the company was taken to court by the United States government. This was because they felt it was unfair to other companies who made web browsers. It is not supported anymore, but many people still use it on older computers that will not run Windows XP or later versions of Windows. ==Press demonstration== Before the release of Windows 98, there was a press demonstration at Comdex in April 1998. Microsoft CEO Bill Gates was highlighting the operating system's ease of use and enhanced support for Plug and Play (PnP). When presentation assistant Chris Capossela plugged a scanner in and attempted to install it, Windows 98 displayed a Blue Screen of Death. Gates remarked after applause and cheering from the audience, \"That must be why we're not shipping Windows 98 yet.\" Video footage of this event became a popular Internet phenomenon.Computer users on Windows 98: It's not revolutionary == Second Edition == Windows 98 Second Edition (SE) was released in 1999. This was an official upgrade to Windows 98 which allowed people to use more types of computer hardware, like monitors and printers, and also let more than one machine on a network use the same Internet connection. ==References== ==Other websites== *Windows 98 Homepage. Microsoft. Retrieved on April 22, 2006. *HPC:Factor Windows 98 / 98SE Patches & Updates Guide *A discussion board at MSFN containing links to unofficial upgrades and patches for this system. *Windows 98 System Requirements *GUIdebook: Windows 98 Gallery - A website dedicated to preserving and showcasing Graphical User Interfaces *Windows 98/98SE UpgradePack - Accumulative patch for recent Windows 98 updates *BBC News: BBC News: Microsoft shuts down Windows 98 *PC World: The shut down of Windows 98 is a cause for concern *Daylight Saving Time (DST) Fix *Windows 98 Generic USB Mass Storage Device Drivers - enables Windows98 to support most modern USB flash drives. Category:Microsoft operating systems",
 "title": "Windows 98"
}