{
 "id": "196427",
 "text": "Peruvian Air Lines S.A, operating as Peruvian Airlines, is a Peruvian airline. Having received a permit from the Ministry of Transport and Communications (MTC) to operate commercial aircraft for a period of four years, the airline operates 4 domestic flights. ==History== Peruvian Airlines was founded in November 2007. On August 7, 2009, the airline received its Air Operator Certificate (AOC) from Peru's aviation authority. The airline commenced operations on October 29, 2009. The airline was shut down by the government on August 19, 2011 due to two incidents occurring in the previous months. It is apparently a 90 day suspension. ==Destinations== Peruvian Airlines serves the following destinations: *Perú **Arequipa - Rodríguez Ballón International Airport **Cusco - Alejandro Velasco Astete International Airport **Iquitos - Crnl. FAP Francisco Secada Vignetta International Airport **Lima - Jorge Chávez International Airport Base **Piura - Cap. FAP Guillermo Concha Iberico International Airport [begins 29 October] **Tacna - Crnl. FAP Carlos Ciriani Santa Rosa International Airport ==Fleet== Peruvian Airlines operates the following aircraft (at March 27, 2010):Peruvian Airlines Fleet Peruvian Airlines Fleet Aircraft In Fleet Passengers Notes Boeing 737-200 5 120 2 stored at LIM Boeing 737-300 3 TBA 2 Stored at LIM 1 Stored at GIG In early 2010, Peruvian Airlines purchased a Boeing 737-300 from Brazilian carrier Oceanair. == Peruvian Pass == Pass is the frequent- flyer program Peruvian Airlines created to reward the loyalty of our travelers with many benefits. The card identifying him as members of the Peruvian Pass allows them to accumulate and earn miles for each trip in a Peruvian Airlines routes. Whenever the partner travel Peruvian Airlines, will add miles to your account will accrue Frequent Flyer. They let you get miles for free award tickets on any of our roads. Status Peruvian Pass Peruvian Pass Classic Peruvian Pass Gold Peruvian Pass Platinum Conditions to entry Membres from 0 to 21,999 miles Membres from 22.000 to 34.999 miles Membres from 35.000 or more miles source: == Major competitors Peruvian == In terms of domestic flights, here are the major competitors of Peruvian Airlines: _Competitors domestic Peru only_ * Lan Perú * LC Busre * Star Perú * TACA Perú ==References== ==Other websites== *Peruvian Airlines Category:Airlines of South America Category:Organizations based in Lima Category:Establishments in Peru Category:2007 establishments in South America",
 "title": "Peruvian Airlines"
}