{
 "id": "196580",
 "text": "Ephebophilia is when an adult is sexually attracted to post-pubescent teenagers or adolescents but still under age of consent—usually those in the age range 15–19. Adults with this attraction are called ephebophiles. Ephebophilia is not just the sexual attraction to teenage partners but is when an adult prefers such sexual partners. Specific words are used by scientists for chronophilias, which is when people are mostly or only sexually attracted to specific age groups. Along with ephebophilia, another example is hebephilia, which means that a person is mostly or only sexually attracted to younger pubescent people. The word pedophilia means that a person is mostly or only sexually attracted to pre-pubescent children; but the term pedophilia is commonly misused to refer to any sexual interest in legally minors under the average legal age of majority of 18 even if they're post-pubescent, and this is also due to the fact that the age of majority (in the states where it is 18 but in other cases it can be higher or lower) and the age of consent are very often confused in the West as the same also due to the fact that in some states they can both coincide (confusion perpetuated also by media, including entertainmentIn the season 6 episode \"Obscene\" of Law & Order: Special Victim Unit, for example, Cragen tells Stabler about the legal marriage between Marquez and Jessie (this latter legally emancipated since she was 14) that \"Marquez is 40, Jessie is 16. It's legal pedophilia.\" This is incorrect, since pedophilia has always been by definition the primary or exclusive attraction to prepuberty, while ephebophilia, instead, is the primary or exclusive attraction to mid-to-late adolescents and biological adults aged 15 and 16 to 18 and 19, which was also accurately clarified by Dr. George Huang in the series.), and this confusion and misuse of the words can cause not only serious cases of ageism but also severe legal repercussions involving slander or/and defamation. Also, unlike pedophilia, ephebophilia is not classified as a psychiatric diagnosis or disorder. ==Related pages== * Pedophilia * Hebephilia * Teleiophilia * Parthenophilia ==References== Category:Human sexuality",
 "title": "Ephebophilia"
}