{
 "id": "196706",
 "text": "WrestleMania is a yearly professional wrestling pay-per-view and livestreaming event made by WWE since 1985. It is the company's biggest show of the year so it has nicknames like: * \"The Showcase of the Immortals\" * \"The Granddaddy of 'em All\" * \"The Grandest Stage of Them All\"' WrestleMania is equal to the National Football League's Super Bowl and Major League Baseball's World Series. The fortieth edition of the event took place on April 6 and 7, 2024, at Lincoln Financial Field in Philadelphia, Pennsylvania. ==Events== # Event Date City Venue Claimed attendance Main event match(es) Ref. 1 New York City Madison Square Garden 19,121 Hulk Hogan and Mr. T vs. Roddy Piper and Paul Orndorff with Muhammad Ali and Pat Patterson as the special guest referees 2 Uniondale, New York Nassau Coliseum 16,585 Hulk Hogan (c) vs. King Kong Bundy in a Steel Cage match for the WWF Championship Rosemont, Illinois Rosemont Horizon 9,000 Los Angeles, California Los Angeles Memorial Sports Arena 14,500 3 Pontiac, Michigan Pontiac Silverdome 93,173 Hulk Hogan (c) vs. André the Giant for the WWF Championship 4 Atlantic City, New Jersey Historic Atlantic City Convention Hall 18,165 Randy Savage vs. Ted DiBiase in a tournament final for the vacant WWF Championship 5 18,946 Randy Savage (c) vs. Hulk Hogan for the WWF Championship 6 Toronto, Ontario, Canada SkyDome 67,678 Hulk Hogan (WWF) vs. The Ultimate Warrior (Intercontinental) in a Winner Takes All match for the WWF Championship and the WWF Intercontinental Heavyweight Championship 7 Los Angeles, California Los Angeles Memorial Sports Arena 16,158 Sgt. Slaughter (c) vs. Hulk Hogan for the WWF Championship 8 Indianapolis, Indiana Hoosier Dome 62,167 * Ric Flair (c) vs. Randy Savage for the WWF Championship * Hulk Hogan vs. Sid Justice 9 Paradise, Nevada Caesars Palace 16,891 Bret Hart (c) vs. Yokozuna for the WWF Championship Yokozuna (c) vs. Hulk Hogan for the WWF Championship 10 New York City Madison Square Garden 19,444 Yokozuna (c) vs. Bret Hart for the WWF Championship with Roddy Piper as the special guest referee 11 Hartford, Connecticut Hartford Civic Center 16,305 Bam Bam Bigelow vs. Lawrence Taylor with Pat Patterson as the special guest referee 12 Anaheim, California Arrowhead Pond of Anaheim 18,853 Bret Hart (c) vs. Shawn Michaels in a 60-minute Iron Man match for the WWF Championship 13 Rosemont, Illinois Rosemont Horizon 18,197 Sycho Sid (c) vs. The Undertaker in a No Disqualification match for the WWF Championship 14 Boston, Massachusetts FleetCenter 19,028 Shawn Michaels (c) vs. Stone Cold Steve Austin for the WWF Championship with Mike Tyson as the special outside enforcer 15 Philadelphia, Pennsylvania First Union Center 19,514 The Rock (c) vs. Stone Cold Steve Austin in a No Disqualification match for the WWF Championship with Mankind as the special guest referee 16 Anaheim, California Arrowhead Pond 18,034 Triple H (c) vs. The Rock vs. Big Show vs. Mick Foley in a Fatal Four-Way Elimination match for the WWF Championship 17 Houston, Texas Reliant Astrodome 67,925 The Rock (c) vs. Stone Cold Steve Austin in a No Disqualification match for the WWF Championship 18 Toronto, Ontario, Canada SkyDome 68,237 Chris Jericho (c) vs. Triple H for the Undisputed WWF Championship 19 Seattle, Washington Safeco Field 54,097 Kurt Angle (c) vs. Brock Lesnar for the WWE Championship 20 New York City Madison Square Garden 20,000 Triple H (c) vs. Chris Benoit vs. Shawn Michaels in a Triple Threat match for the World Heavyweight Championship 21 Los Angeles, California Staples Center 20,193 Triple H (c) vs. Batista for the World Heavyweight Championship 22 Rosemont, Illinois Allstate Arena 17,159 John Cena (c) vs. Triple H for the WWE Championship 23 Detroit, Michigan Ford Field 80,103 John Cena (c) vs. Shawn Michaels for the WWE Championship 24 Orlando, Florida Florida Citrus Bowl 74,635 Edge (c) vs. The Undertaker for the World Heavyweight Championship 25 Houston, Texas Reliant Stadium 72,744 Triple H (c) vs. Randy Orton for the WWE Championship 26 Glendale, Arizona University of Phoenix Stadium 72,219 The Undertaker vs. Shawn Michaels in a No Disqualification Streak vs. Career match 27 Atlanta, Georgia Georgia Dome 71,617 The Miz (c) vs. John Cena for the WWE Championship 28 Miami Gardens, Florida Sun Life Stadium 78,363 John Cena vs. The Rock 29 East Rutherford, New Jersey MetLife Stadium 80,676 The Rock (c) vs. John Cena for the WWE Championship 30 New Orleans, Louisiana Mercedes-Benz Superdome 75,167 Randy Orton (c) vs. Batista vs. Daniel Bryan in a Triple Threat match for the WWE World Heavyweight Championship 31 Santa Clara, California Levi's Stadium 76,976 Brock Lesnar (c) vs. Roman Reigns vs. Seth Rollins in a Triple Threat match for the WWE World Heavyweight Championship 32 Arlington, Texas AT&T; Stadium 101,763 Triple H (c) vs. Roman Reigns for the WWE World Heavyweight Championship 33 Orlando, Florida Camping World Stadium 75,245 The Undertaker vs. Roman Reigns in a No Holds Barred match 34 New Orleans, Louisiana Mercedes-Benz Superdome 78,133 Brock Lesnar (c) vs. Roman Reigns for the WWE Universal Championship 35 East Rutherford, New Jersey MetLife Stadium 82,265 Ronda Rousey (Raw) vs. Charlotte Flair (SmackDown) vs. Becky Lynch in a Winner Takes All Triple Threat match for the WWE Raw Women's Championship and WWE SmackDown Women's Championship 36 Orlando, Florida WWE Performance Center 0 The Undertaker vs. AJ Styles in a Boneyard match Brock Lesnar (c) vs. Drew McIntyre for the WWE Championship 37 Tampa, Florida Raymond James Stadium 25,675 Sasha Banks (c) vs. Bianca Belair for the WWE SmackDown Women's Championship Roman Reigns (c) vs. Edge vs. Daniel Bryan in a Triple Threat match for the WWE Universal Championship Tampa, Florida Raymond James Stadium 38 Arlington, Texas AT&T; Stadium 77,899 Kevin Owens vs. Stone Cold Steve Austin in a No Holds Barred match 78,453 Brock Lesnar (WWE) vs. Roman Reigns (Universal) in a Winner Takes All match for the WWE Championship and the WWE Universal Championship 39 Inglewood, California SoFi Stadium 80,497 The Usos (Jey and Jimmy Uso) (c) vs. Kevin Owens and Sami Zayn for the Undisputed WWE Tag Team Championship 81,395 Roman Reigns (c) vs. Cody Rhodes for the Undisputed WWE Universal Championship 40 Philadelphia, Pennsylvania Lincoln Financial Field 72,543 The Bloodline (The Rock and Roman Reigns) vs. Cody Rhodes and Seth \"Freakin\" Rollins 72,755 Roman Reigns (c) vs. Cody Rhodes in a Bloodline Rules match for the Undisputed WWE Universal Championship 41 Paradise, Nevada Allegiant Stadium 61,467 Roman Reigns vs. CM Punk vs. Seth Rollins in a Triple Threat match 63,226 Cody Rhodes (c) vs. John Cena for the Undisputed WWE Championship 42 WrestleMania 42 April 11, 2026 New Orleans, Louisiana Caesars Superdome TBA April 12, 2026 TBA ==Related pages== * List of WWE pay-per-view events ==Footnotes== ==References== ==Further reading== * ==Other websites== * Category:1985 establishments in the United States",
 "title": "WrestleMania"
}