{
 "id": "196744",
 "text": "In Your House was a series of professional wrestling pay-per-view (PPV) and livestreaming shows first made by the World Wrestling Federation (WWF, now called WWE) from 1995 to 1999. The original idea was in months where the WWF was not producing a major PPV event (WrestleMania, King of the Ring, SummerSlam, Survivor Series, and Royal Rumble which ran for three hours) they would produce a two hour PPV event for a lower price of $19.95. When World Championship Wrestling (WCW) started producing three hour PPV's on a monthly basis, the WWF was forced to drop the concept. The events were numbered numerically (example: In Your House 1, 2) until the seventh event where specific subtitles were added which usually referred to the main event, starting with In Your House 7: Good Friends, Better Enemies (refers to the Shawn Michaels vs. Diesel match). Starting with the 17th event (Ground Zero), \"In Your House\" became the subtitles (example: Unforgiven: In Your House). Later PPV's No Way Out, Backlash, Fully Loaded, Judgment Day, Bad Blood and Unforgiven all came from the In Your House series. In 2020, 21 after the last event, WWE started using the In Your House name for its developmental brand NXT. The 2020 and 2021 were called NXT TakeOver: In Your House. The 2022 event, which was the last one so far, was simply called NXT In Your House because the TakeOver series ended in November 2021. ==In Your House dates and venues== NXT-branded event # Event Date City Venue Main Event Ref. 1 In Your House May 14, 1995 Syracuse, New York Onondaga County War Memorial Diesel (c) vs. Sycho Sid for the WWF Championship 2 In Your House 2 July 23, 1995 Nashville, Tennessee Nashville Municipal Auditorium Diesel (c) vs. Sycho Sid for the WWF Championship in a Lumberjack match 3 In Your House 3 September 24, 1995 Saginaw, Michigan Saginaw Civic Center Two Dudes with Attitudes (Diesel (c-WWF) and Shawn Michaels (c-Intercontinental)) vs. Yokozuna and The British Bulldog (c-Tag Team) in a Winners Take All match for the WWF Championship, WWF Intercontinental Championship, and WWF Tag Team Championship 4 In Your House 4 October 22, 1995 Winnipeg, Manitoba, Canada Winnipeg Arena Diesel (c) vs. The British Bulldog for the WWF Championship 5 In Your House 5 December 17, 1995 Hershey, Pennsylvania Hersheypark Arena Bret Hart (c) vs. The British Bulldog for the WWF Championship 6 In Your House 6 February 18, 1996 Louisville, Kentucky Louisville Gardens Bret Hart (c) vs. Diesel in a Steel Cage match for the WWF Championship 7 In Your House 7: Good Friends, Better Enemies April 28, 1996 Omaha, Nebraska Omaha Civic Auditorium Shawn Michaels (c) vs. Diesel in a No Holds Barred match for the WWF Championship 8 In Your House: Beware of Dog May 26, 1996 Florence, South Carolina Florence Civic Center Shawn Michaels (c) vs. The British Bulldog for the WWF Championship 8 In Your House: Beware of Dog May 28, 1996 North Charleston, South Carolina North Charleston Coliseum Goldust (c) vs. The Undertaker in a Casket match for the WWF Intercontinental Championship 9 In Your House 9: International Incident July 21, 1996 Vancouver, British Columbia, Canada General Motors Place Camp Cornette (Vader, Owen Hart, and The British Bulldog) vs. The People's Posse (Shawn Michaels, Sycho Sid, and Ahmed Johnson) 10 In Your House 10: Mind Games September 22, 1996 Philadelphia, Pennsylvania CoreStates Center Shawn Michaels (c) vs. Mankind for the WWF Championship 11 In Your House 11: Buried Alive October 20, 1996 Indianapolis, Indiana Market Square Arena The Undertaker vs. Mankind in a Buried Alive match 12 In Your House 12: It's Time December 15, 1996 West Palm Beach, Florida West Palm Beach Auditorium Sycho Sid (c) vs. Bret Hart for the WWF Championship 13 In Your House 13: Final Four February 16, 1997 Chattanooga, Tennessee UTC Arena Bret Hart vs. Stone Cold Steve Austin vs. The Undertaker vs. Vader in a Four Corners Elimination match for the vacant WWF Championship 14 In Your House 14: Revenge of the 'Taker April 20, 1997 Rochester, New York Rochester County War Memorial Stone Cold Steve Austin vs. Bret Hart for a WWF Championship match 15 In Your House 15: A Cold Day in Hell May 11, 1997 Richmond, Virginia Richmond Coliseum The Undertaker (c) vs. Stone Cold Steve Austin for the WWF Championship 16 In Your House 16: Canadian Stampede July 6, 1997 Calgary, Alberta, Canada Saddledome The Hart Foundation (Bret Hart, Jim Neidhart, Owen Hart, The British Bulldog, and Brian Pillman) vs. Stone Cold Steve Austin, Ken Shamrock, Goldust, and The Legion of Doom (Hawk and Animal) 17 Ground Zero: In Your House September 7, 1997 Louisville, Kentucky Louisville Gardens The Undertaker vs. Shawn Michaels 18 Badd Blood: In Your House October 5, 1997 St. Louis, Missouri Kiel Center The Undertaker vs. Shawn Michaels in a Hell in a Cell match for a WWF Championship match at Survivor Series 19 D-Generation X: In Your House December 7, 1997 Springfield, Massachusetts Springfield Civic Center Shawn Michaels (c) vs. Ken Shamrock for the WWF Championship 20 No Way Out of Texas: In Your House February 15, 1998 Houston, Texas Compaq Center Stone Cold Steve Austin, Owen Hart, Cactus Jack, and Chainsaw Charlie vs. Triple H, Savio Vega, and The New Age Outlaws (Billy Gunn and Road Dogg) 21 Unforgiven: In Your House April 26, 1998 Greensboro, North Carolina Greensboro Coliseum Complex Stone Cold Steve Austin (c) vs. Dude Love for the WWF Championship 22 Over the Edge: In Your House May 31, 1998 Milwaukee, Wisconsin Wisconsin Center Arena Stone Cold Steve Austin (c) vs. Dude Love in a No Disqualification Falls Count Anywhere match for the WWF Championship with Mr. McMahon as the special guest referee 23 Fully Loaded: In Your House July 26, 1998 Fresno, California Selland Arena Kane and Mankind (c) vs. The Undertaker and Stone Cold Steve Austin for the WWF Tag Team Championship 24 Breakdown: In Your House September 27, 1998 Hamilton, Ontario, Canada Copps Coliseum Stone Cold Steve Austin (c) vs. The Undertaker vs. Kane in a triple threat match for the WWF Championship 25 Judgment Day: In Your House October 18, 1998 Rosemont, Illinois Rosemont Horizon The Undertaker vs. Kane for the vacant WWF Championship with Stone Cold Steve Austin as the special guest referee 26 Rock Bottom: In Your House December 13, 1998 Vancouver, British Columbia, Canada General Motors Place Stone Cold Steve Austin vs. The Undertaker in a Buried Alive match for a spot in the 1999 Royal Rumble match 27 St. Valentine's Day Massacre: In Your House February 14, 1999 Memphis, Tennessee Pyramid Arena Stone Cold Steve Austin vs. Mr. McMahon in a Steel Cage match for a WWF Championship match at WrestleMania XV 28 Backlash: In Your House April 25, 1999 Providence, Rhode Island Providence Civic Center Stone Cold Steve Austin (c) vs. The Rock in a No Holds Barred match for the WWF Championship with Shane McMahon as the special guest referee 29 NXT TakeOver: In Your House (2020) June 7, 2020 Winter Park, Florida Full Sail University Charlotte Flair (c) vs. Io Shirai vs. Rhea Ripley in a Triple Threat match for the NXT Women's Championship 30 NXT TakeOver: In Your House (2021) June 13, 2021 Orlando, Florida Capitol Wrestling Center at WWE Performance Center Karrion Kross (c) vs. Adam Cole vs. Kyle O'Reilly vs. Johnny Gargano vs. Pete Dunne in a fatal five-way match for the NXT Championship 31 NXT In Your House (2022) June 4, 2022 WWE Performance Center Bron Breakker (c) vs. Joe Gacy for the NXT Championship ==Related pages== *List of WWE pay-per-view events == References == Category:World Wrestling Entertainment pay-per-view events",
 "title": "In Your House"
}