{
 "id": "196829",
 "text": "The Dâmboviţa River is a river in Romania. It starts at the joining of the headwaters Valea Vladului and Boarcăşu. The source of the river is in the Făgăraş Mountains. It flows south. It passes through Bucharest and flows into the Argeş River 258 kilometers from its source. This is near Budeşti, which is in Călăraşi County. The Romanian county of Dâmboviţa County is named after this river. ==Settlements== These are the communes, towns and cities that the Dâmboviţa River flows through: *Dragoslavele *Malu cu Flori *Cândeşti *Vulcana-Băi *Voineşti *Măneşti *Dragomireşti *Lucieni *Nucet *Conteşti *Lunguleţu *Bucharest (city) *Plătăreşti *Vasilaţi *Budeşti (town) ==Tributaries== These are the tributaries of the Dâmboviţa River: Left: Valea Vladului, Berevoescu, Luţele Mari, Luţele Mici, Valea lui Aron, Valea Comisului, Valea Nemţoaicelor, Răchita, Valea lui Stanciu, Valea Turcilor, Tămaşul, Valea Dragoslăvenilor, Valea lui Ivan, Valea Largă, Valea Seacă, Valea Speriatei, Valea Gruiului, Berila, Dâmbovicioara, Valea Orăţiilor, Cheia, Ghimbav, Valea Luncii, Valea Caselor, Valea Hotarului, Olăneasca, Valea Runcului, Valea Jocii, Bădeni, Valea Grecului, Pârâul lui Coman, Valea Chiliilor, Valea Pleşei, Valea Măgurii, Valea Vlazilor, Valea Ulmului, Valea Largă, Râul Alb, Valea Satului, Ilfov, Colentina, Pasărea Right: Boarcăşu, Colţii lui Andrei, Izvorul Foişorului, Valea Barbului, Izvorul Hotarului, Valea lui Aron, Bălţatul, Dracsin, Cascue, Râul Căciulelor, Valea Şaului, Clăbucet, Oncioaia, Valea Jugii, Valea Arşiţei, Râuşorul, Frasinu, Stoeneasca, Valea Cheii, Muscel, Aninoasa, Grui ==Gallery== Río Dambovita, Bucarest, Rumanía, 2016-05-29, DD 62.jpg|Dâmboviţa in Bucharest. Image:Sistematizare Dâmboviţa 1881-1886.jpg|Sistematization of Dâmboviţa in Bucharest. Image:Preziosi - Dâmboviţa la Bucureşti, 1868.jpg|Dâmboviţa in Bucharest, an aquarelle by Amedeo Preziosi. Category:Rivers of Romania Category:Geography of Bucharest Category:Argeș County Category:Dâmbovița County Category:Ilfov County Category:Călărași County",
 "title": "Dâmbovița (river)"
}