{
 "id": "196946",
 "text": "The Quebec Nordiques were an ice hockey team who played in both the National Hockey League (NHL) and the World Hockey Association (WHA). This is a list of the head coaches they had during their existence. The franchise moved to Denver, Colorado, in 1995, and became the Colorado Avalanche. Michel Bergeron coached the most games and won the most points all-time with the Nordiques, with 634 games and 616 points. Maurice Filion and Michel Bergeron were the only coaches to have three terms with the Nordiques. Marc Crawford was the only Nordiques coach to win the Jack Adams Award. ==Key== # Number of coaches GC Games coached W Wins L Losses T Ties Pts Points * Spent entire NHL coaching career with the Nordiques ==WHA coaches== # Name Term Regular season Playoffs Awards won Reference GC W L T Pts GC W L 1 Maurice Richard 1972–1973 2 Maurice Filion 1972–1973 3 Jacques Plante 1973–1974 4 Jean-Guy Gendron 1974–1976 5 Marc Boileau 1976–1978 – Maurice Filion 1977–1978 ==NHL coaches== # Name Term Regular season Playoffs Awards won Reference GC W L T Pts GC W L 1 Jacques Demers 1979–1980 80 25 44 11 61 — — — 2 Michel Bergeron 1980–1981 74 29 29 16 74 5 2 3 3 Maurice Filion* 1981 6 1 3 2 4 — — — – Michel Bergeron 1981–1987 480 224 193 63 511 63 29 34 4 Andre Savard* 1987 24 10 13 1 21 — — — 5 Ron Lapointe* 1987–1989 89 33 50 6 72 — — — 6 Jean Perron 1989 47 16 26 5 37 — — — – Michel Bergeron 1989–1990 80 12 61 7 31 — — — 7 Dave Chambers* 1990–1991 98 19 64 15 53 — — — 8 Pierre Page 1991–1994 230 98 103 30 225 6 2 4 9 Marc Crawford 1994–1995 48 30 13 5 65 — — — 1995 Jack Adams Award winner ==Notes== * A running total of the number of coaches of the Nordiques. Thus any coach who has two or more separate terms as head coach is only counted once. *Maurice Filion's six games coached with the Nordiques were in the middle of the season, not in the end of the season. ==Related pages== *List of NHL head coaches *Head Coaches of the Colorado Avalanche ==References== Category:National Hockey League lists Category:Lists of sportspeople",
 "title": "List of Quebec Nordiques head coaches"
}