{
 "id": "197081",
 "text": "Neil Gordon Kinnock, Baron Kinnock, PC, (born 28 March 1942) is a Welsh politician. He was a Member of Parliament from 1970 to 1995. From 1983 to 1992 he was the Leader of the Opposition and the leader of the Labour Party. In the general election in 1992 he was beaten. After this he gave up his post of leading the Labour Party (and sitting in Parliament). He was a British politician in the European Commission from 1995 until 2004, and is now Chairman of the British Council and President of Cardiff University. He was introduced to the House of Lords on 31 January 2005. He was created Baron Kinnock, of Bedwellty in the County of Gwent.House of Lords Journal 238 (Session 2004–05) , Monday, 31 January 2005; p. 142 ==Personal life== He is married to Glenys Kinnock. She was Britain's Minister for Africa and the United Nations from 2009 to 2010, and a Labour Member of the European Parliament (MEP) from 1994 to 2009. She was made a life peer in 2009. They became one of the few couples to both hold titles in their own right. The two met while studying at University College, Cardiff. They married on 25 March 1967. In 2008 they moved to Tufnell Park, London, to be closer to their daughter and grandchildren.Camden New Journal, 10 January 2008, p.10. They have a son, Stephen and a daughter, Rachel. Neil Kinnock is a lifelong Cardiff City F.C. fan and regularly attends matches. Kinnock is an agnostic. In 2011 Kinnock took part in the BBC Wales programme Coming Home about his Welsh family history. The programme was broadcast on 30 November 2011. ==References== Category:1942 births Category:Living people Category:European Commissioners Category:Labour Party (UK) MPs Category:Members of the British House of Commons for Welsh constituencies Category:Leaders of the Labour Party (UK) Category:Leaders of the Opposition (United Kingdom) Category:Labour Life Peers Category:Members of the Privy Council of the United Kingdom Category:UK MPs 1970–1974 Category:UK MPs 1974 Category:UK MPs 1974–1979 Category:UK MPs 1979–1983 Category:UK MPs 1983–1987 Category:UK MPs 1987–1992 Category:UK MPs 1992–1997",
 "title": "Neil Kinnock"
}