{
 "id": "197100",
 "text": "The Samlesbury witches were three women who were accused of being witches, murderers and cannibals. They were put on trial in the village of Samlesbury in Lancashire, England, and were found not guilty. This was one of the most famous witch trials in English history. The three women's names were Jane Southworth, Jennet Bierley, and Ellen Bierley. A 14-year-old girl, Grace Sowerbutts, had accused them of practising witchcraft. The women were also accused of other crimes, including cannibalism and the murder of children. The case against them collapsed \"spectacularly\" when the judge showed that Sowerbutts (the main witness) was \"the perjuring tool of a Catholic priest\". Their trials on 19 August 1612 were part of a two-day series of witch trials. Unlike the Samlesbury witches, other people tried around the same time (like the Pendle witches) were accused of maleficium: causing harm by witchcraft. These trials were unusual for England at the time for two reasons. First, there is a first-hand account of the trials: Thomas Potts, the court's clerk, described them in his The Wonderfull Discoverie of Witches in the Countie of Lancaster. Secondly, a high number of people were found guilty and hanged: ten at Lancaster and another at York. Some of the accused were burnt alive and hanged. Nevertheless, the three Samlesbury women were found not guilty of witchcraft. The witch trials of the 16th and 17th century resulted from the religious struggles of the time, according to many historians (like Hugh Trevor-Roper). During this time, both the Catholic and Protestant Churches wanted to eliminate what they saw as heresy. The trial of the Samlesbury witches is an example of these efforts; it has been described as \"largely a piece of anti-Catholic propaganda\". A trial would show that Lancashire, a wild and lawless area, was being cleared not only of witches but also of \"popish plotters\", that is, Catholics. ==Background== James I became the King of England in 1603. He was greatly influenced by the strict Scottish Reformation, and was very interested in witchcraft. By the early 1590s, he was convinced that Scottish witches were plotting against him. In his 1597 book, Daemonologie, he urged his followers to report and prosecute anyone who supported or practiced witchcraft. In 1604, the English Parliament passed a new witchcraft law called \"An Act against Conjuration, Witchcraft and dealing with evil and wicked spirits\". It ordered the death penalty for anyone who caused harm by using magic or exhuming corpses. However, James did not believe some of the evidence presented in witch trials. He even pointed out inconsistencies in the testimonies presented against some accused witches. At the end of the 16th century, the government thought that Lancashire County was a wild and lawless area, \"fabled for its theft, violence and sexual laxity, where the church was honoured without much understanding of its doctrines by the common people\". After Queen Mary died and her half-sister Elizabeth became Queen 1558, Catholic priests were forced to hide, but in Lancashire they were still able to celebrate Mass in secret. In early 1612, the year of the trials, each justice of the peace in Lancashire was ordered to make a list of the recusants in their area—those who refused to attend the services of the Church of England, which was a criminal offence at that time. ===Southworth family=== During the 16th-century English Reformation, the Church of England broke away from the rule of the Pope and the Catholic Church. This event split the Southworth family of Samlesbury Hall. Sir John Southworth, head of the family until his death in 1595, was a leading recusant. He was arrested many times for not giving up his Catholic faith. The rest of the family also remained strict Catholics, except for the eldest son, John Singleton. His widow, Jane Southworth, was one of the three accused Samlesbury witches. Jane Southworth (born Jane Sherburne) and John Singleton were married around 1598. They lived in Samlesbury Lower Hall and had seven children. After he joined the Church of England, John was disinherited by his father, Sir John Southworth. Sir John even refused to pass by his son's house if he could keep clear of it, and he believed Jane would probably kill his son. John Singleton died only a few months before Jane's trial for witchcraft in 1612. ==Investigations== On 21 March 1612, Alizon Device, who lived near Pendle Hill just outside the Lancashire village of Fence, met John Law, a pedlar from Halifax. She asked him for some pins, which he refused to give to her. A few minutes later, Law suffered a stroke, for which he blamed Device. Along with her mother Elizabeth and her brother James, Device was called before local magistrate Roger Nowell on 30 March 1612. Based on the \"evidence\" and confessions he obtained, Nowell sent Device and ten others to Lancaster Gaol, to be tried for maleficium. Other Lancashire magistrates learned of Nowell's discovery of witchcraft in the county. On 15 April 1612, JP Robert Holden began investigations in his own area of Samlesbury. As a result, eight people were sent to trial, including Jane Southworth, Jennet Bierley, and Ellen Bierley. They were accused of using witchcraft on Grace Sowerbutts, Jennet's granddaughter and Ellen's niece. ==Trial== The Samlesbury trial was held on 19 August 1612 before Sir Edward Bromley, a judge who wanted a promotion to a circuit court nearer London. He may have wanted to impress King James, the head of the judiciary. Before the trial, Bromley ordered the release of five of the eight defendants from Samlesbury, with a warning about their future conduct. Jane Southworth, Jennet Bierley, and Ellen Bierley were accused of using \"diverse devilish and wicked Arts, called Witchcrafts, Inchauntments, Charmes, and Sorceries, in and upon one Grace Sowerbutts\", to which they pleaded not guilty. Fourteen-year-old Grace was the chief prosecution witness. Grace was the first to give evidence. She said that her grandmother, Jennet Bierley, and her aunt, Ellen Bierley, had: * Changed themselves into dogs * \"Haunted and vexed\" Grace for years * Transported Grace to the top of a hayrick by her hair * Tried to make Grace drown herself * Took Grace to the home of Thomas Walshman and his wife, from whom they stole a baby to suck its blood * Dug up the baby's body after it was buried at Samlesbury Church and took it home * Cooked and ate some of the baby's body * Used the rest of the baby's body to make an ointment that let them change themselves into other shapes * Attended secret sabbaths every Thursday and Sunday night at Red Bank, on the north shore of the River Ribble, where they ate, drank, and had sex with \"foure black things, going upright, and yet not like men in the face\" Thomas Walshman, the father of the baby allegedly killed and eaten by the accused, was the next to give evidence. He confirmed that his child had died of unknown causes around the age of 1. He added that Grace Sowerbutts was discovered lying as if dead in his father's barn on about 15 April, and did not recover until the following day. Two other witnesses, John Singleton and William Alker, confirmed that Sir John Southworth (Jane Southworth's father-in-law) avoided passing his son's house because he thought Jane was an \"evil woman, and a Witch\". ===Examinations=== The evidence convinced many people in the court that the accused women were guilty, according to Thomas Potts, the court clerk who wrote about the trials. According to Potts, when the judge asked the women if they had anything to say in their defense, they \"humbly fell upon their knees with weeping tears\", and \"desired him [Bromley] for Gods cause to examine Grace Sowerbutts\". Immediately \"the countenance of this Grace Sowerbutts changed\". The witnesses \"began to quarrel and accuse one another\", and eventually admitted that Grace had been coached in her story by a Catholic priest they called Thompson. Bromley then ordered two Justices of the Peace, William Leigh and Edward Chisnal, to question Grace. Under questioning, Grace readily admitted that her story was untrue. She said she had been told what to say by Jane Southworth's uncle by marriage, Christopher Southworth (also known as Thompson). He was a Jesuit priest and Samlesbury Hall chaplain who was in hiding in the Samlesbury area. Leigh and Chisnal questioned the three accused women in an attempt to discover why Christopher might have fabricated evidence against them, but none could offer any reason other than that each of them \"goeth to the [Anglican] Church\". After the statements had been read out in court, Bromley ordered the jury to find the defendants not guilty. He said: Potts finished his book with the words: \"Thus were these poore Innocent creatures, by the great care and paines of this honourable Judge, delivered from the danger of this Conspiracie; this bloudie practise of the Priest laid open\". ==The Wonderfull Discoverie of Witches in the Countie of Lancaster== Almost everything that is known about the trials comes from Potts's report. The trial judges told Potts to write his account of the trial. By 16 November 1612, Potts had completed the work. Bromley revised and corrected the manuscript before its publication in 1613, and said it was \"truly reported\" and \"fit and worthy to be published\". Although written as an apparently verbatim account, the book is not a report of what was actually said at the trial, but instead a reflection on what happened. Nevertheless, according to a 2002 book by Marion Gibson: > Potts \"seems to give a generally trustworthy, although not comprehensive, > account of an Assize witchcraft trial, provided that the reader is > constantly aware of his use of written material instead of verbatim > reports\". In his introduction to the trial, Potts writes: \"Thus have we for a time left the Graund Witches of the Forest of Pendle, to the good consideration of a very sufficient jury.\" By then, Bromley had heard the cases against the three Pendle witches, who had confessed to their guilt. However, he had not yet dealt with the other accused people, insisted that they were innocent. Bromley knew that the only testimony against them would come from a nine-year-old girl, and that King James had cautioned judges to examine carefully the evidence presented against accused witches, warning against credulity. In his conclusion to the account of the trial, Potts says that it was interposed in the expected sequence \"by special order and commandment\", presumably of the trial judges. After having convicted and sentenced to death three witches, Bromley may have been keen to avoid any suspicion of credulity by presenting his \"masterful exposure\" of the evidence presented by Grace Sowerbutts, before turning his attention back to the remainder of the Pendle witches. ==Modern interpretation== Potts wrote that \"this Countie of Lancashire ... now may lawfully bee said to abound as much in Witches of divers[e] kinds as Seminaries, Jesuites, and Papists\", and describes the three accused women as having once been \"obstinate Papists, and now came to Church\". At the time, Catholic recusants and witchcraft were viewed as the \"two big threats to Jacobean order in Lancashire\". The judges would have wanted King James (the head of the judiciary) to approve of how they dealt with Samlesbury Hall, the Southworths' family home. Authorities suspected that it was a refuge for Catholic priests, and it was under secret government surveillance for some considerable time before the trial of 1612. JP Robert Holden may have been motivated in his investigations, at least partially, by a desire to \"smoke out its Jesuit chaplain\", Christopher Southworth. The English experience of witchcraft was somewhat different from the European one, with only one really mass witch hunt, that of Matthew Hopkins in East Anglia during 1645. Of all the people executed in England for witchcraft between the early 15th and mid-16th century, 20% were killed in the Hopkins witch hunt. The English legal system also differed significantly from the inquisitorial model used in Europe. It required people to accuse their neighbours of some crime. The accused's guilt or innocence was decided by a jury of their peers. English witch trials of the period \"revolved around popular beliefs, according to which the crime of witchcraft was one of... evil-doing\", for which tangible evidence had to be provided. Potts wrote several pages criticizing the evidence presented in Grace Sowerbutts' statement. This provides insight into the differences in how the early-17th century Protestant establishment and the common people viewed witchcraft. Everyday people may have been influenced by the more continental views of Catholic priests like Christopher Southworth. Unlike their European counterparts, the English Protestant elite believed that witches kept familiars, or companion animals, and so it was not considered credible that the Samlesbury witches had none. Grace's story of the sabbath, too, was unfamiliar to the English at that time, although belief in such secret gatherings of witches was widespread in Europe. Most demonologists of the period, including King James, said that only God could perform miracles, and he had not given the Devil's followers the power to go against the laws of nature. Hence Potts dismisses Sowerbutts' claim that Jennet Bierley transformed herself into a black dog, saying: \"I would know by what means any Priest can maintain this point of Evidence\". He equally lightly dismisses Grace's claims that she attended a sabbath where she met with \"foure black things ... not like men in the face\". He writes: \"The Seminarie [priest] mistakes the face for the feete: For Chattox [one of the Pendle witches] and all her fellow witches agree, the Devill is cloven-footed: but Fancie [Chattox's familiar] had a very good face, and was a proper man.\" It is perhaps unlikely that the accused women would have failed to draw the examining magistrate's attention to their suspicions concerning Grace Sowerbutts' motivations when first examined, only to do so at the very end of their trial when asked by the judge if they had anything to say in their defence. The trial of the Samlesbury witches in 1612 may have been \"largely a piece of anti-Catholic propaganda\" or even a \"show-trial\", whose purpose was to demonstrate that Lancashire was being purged not only of witches, but also of \"popish plotters\". ===Aftermath=== Bromley achieved his desired promotion to the Midlands Circuit in 1616. In 1615 Kim James gave Potts the keepership of Skalme Park, which involved breeding and training the king's hounds. In 1618, he was given responsibility for \"collecting the forfeitures on the laws concerning sewers, for twenty-one years\". Jane Southworth's eldest son, Thomas, eventually inherited his grandfather's estate of Samlesbury Hall. ==References== ;Notes ;Bibliography * * * :Facsimile reprint of Davies' 1929 book, containing the text of the The Wonderfull Discoverie of Witches in the Countie of Lancaster by Potts, Thomas (1613) * * * * * * * * * ==Other websites== * (1597) * (1849) * (1613) Category:Witchcraft Category:People from Lancashire Category:17th century in England",
 "title": "Samlesbury witches"
}