{
 "id": "197188",
 "text": "A wedgie is when a person's underwear is forcibly pulled up their buttocks. A wedgie can be given by bullies to humiliate their target, or as a prank between friends. Wedgies can be given from the front (\"melvins\") and in many other ways. They can cause the underwear to rip. They are painful and are used in many situations. They are also very commonly shown in Low Comedy. There are many forms of wedgies. Wedgies can be given along with a spanking. A hanging wedgie is when the underwear is hung on a hook. A bra connection wedgie is when a girl's underwear is hooked in her bra. \"Atomic wedgies\" are when the underwear is pulled over the victim's head. A \"messy wedgie\" is when food or other substances are put down the pants of the victim while wedgied. A \"squeaky clean wedgie\" is when the victim's underwear is pulled up at the front then the back creating friction. In a \"bouncing wedgie\", the person is bounced while in the wedgie. == Reactions to Wedgies == In 2002, a man named Daniel Strouss shot someone named Eric Kassoway for having given him a wedgie. Strouss was put in jail for attempted murder since the court said he was mentally ill but not legally insane. In 2005, a teacher named Mark Holley was arrested for giving a ten year old student a wedgie. In 2006, a High School Principal named Eric Messerli was suspended for six days for giving a student a wedgie. In 2007, an eight year old boy named Justin Serovich and his twin brother Jared Serovich gave each other wedgies so they decided to invent wedgie-proof underwear. == Dangers == In 2004, a 10 year old boy in England was given a wedgie by his friends after they had watched The Simpsons and ended up needing surgery at a hospital. In 2015, a man accidentally killed his stepfather by giving him an “Atomic Wedgie”. == Other websites == * Wedgie, American Heritage Dictionary of the English Language, Retrieved March 2024 via Dictionary.com * No More Bullies, School Counsellor Resources * At School, A Most Uncomfortable Subject, Archive.org * Emergency Operation after School Prank, Yorkshire Post, Archived from the Original * Gwyneth and the Atomic Wedgie/ The attempt to prove the actress wrong after she slams America dinner party chatter proves beyond a disaster, SFGate * The Wedgies’ Pop Culture Pull Proves Irresistible, USAToday. * Man Allegedly Tries to Kill Friend Who Gave Him a Wedgie at a Concert poconrecord.com * Messy Wedgie, Urban Dictionary * Man Accused of Attempted Murder in Wedgie Case, CNN * The Wedgie Made Me Do It, smokinggun.com * Strouss vs Fireman Fund Insurance Company, casetext.com * Note to self no more wedgies to be given out. Arstechnica.com * Weird but True, The New York Post * Answer to Wedgies Enjoys Brief Fame, The Columbus Dispatch * Wedgie-Proof Underwear, jalash.wordpress.com * Necessity, Wedgies, The Mother of Invention, The Oregonian * Twins Invent Wedgie Proof Undies, headsup.scoutlife.org * 8 Year Old Twins Saving the World, One Wedgie at a Time pictureimperfect.net * Ohio Twins Gain Fame for Anti-Wedgie Underwear Design, Fox News * 8 Year Old Ohio Twins Have No Idea What Terror Awaits, NPR * Emergency Operation After School Prank, The Yorkshire Post * Teacher Accused of Giving Student Wedgie Arrested, wmfynews * Wedgie-associated radiculitis in a Quinquagenarian, National Institute of Health * Off Duty Marine Veteran was Sentenced to 30 Years for Killing his Stepfather with an Atomic Wedgie, Military.com * Principal Suspended for Giving Kid a ‘Wedgie’, NBCNews Category:Bullying",
 "title": "Wedgie"
}