{
 "id": "197337",
 "text": "Rita Mae Brown (born November 28, 1944) is an American writer. She is best known for her first novel Rubyfruit Jungle. It was published in 1973 and was a story about a young lesbian woman. At the time, it was quite unusual for novels to be about lesbian themes. Brown is also a mystery writer and an Emmy- nominated screenwriter. ==Early life== Brown was born in Hanover, Pennsylvania, and grew up in Florida. In 2004 she was living outside Charlottesville, Virginia. In the 1960s, Brown went to the University of Florida but transferred.Related by Brown in Starting from Scratch, Rita Will, and her website bio , retrieved May 24, 2007. She allows that the University administration denies that it had anything to do with integration. She moved to New York and went to New York University, where she got a degree in classics and English. Later she got another degree in cinematography from the New York School of Visual Arts. She also got a doctorate in political science from the Institute for Policy Studies in Washington, D.C.Related by Brown in her autobiography Rita Will and Starting from Scratch. ==Activism== In the 1960s, Brown started to get involved in politics. She became active in the American Civil Rights Movement, the anti-war movement, the Gay Liberation movement and the feminist movement. She helped start the Student Homophile League and claims to have participated in the Stonewall riots(pg 243 of the 1997 edition of \"Rita Will\": \"There stood Martha Shelley and I in a sea of rioting gay men...'Martha, we'd better get the hell out of here.'\") in New York City, along with Martha Shelley. Ms. Shelley states that she was not in the bar with Ms. Brown at the time, and was simply passing by the riots, thinking they were an antiwar demonstration. Brown joined the new National Organization for Women, but left in February 1970 when Betty Friedan said anti-gay things and the organization tried to distance itself from lesbian organizations. In the 1970s, she became helped start The Furies Collective, a lesbian feminist newspaper collective which said that heterosexuality was the cause of all oppression.Related by Brown in her autobiography Rita Will. She has said, \"I don't believe in straight or gay. I really don't. I think we're all degrees of bisexual.\" ==Personal life== Brown is openly lesbianhttp://www.randomhouse.com/book/19940/rita-will-by-rita-mae-brown and has had relationships with tennis player Martina Navratilova, actress-writer Fannie Flagg, socialite Judy Nelson, and politician Elaine Noble. Brown enjoys American fox hunting and is master of her Fox Hunt Club. She has also played polo, and started the women-only Blue Ridge Polo Club.Rita Mae Brown Website Bio , retrieved May 24, 2007. ==References== ==Other websites== *Official website Category:1944 births Category:Living people Category:American autobiographers Category:American LGBT rights activists Category:American novelists Category:Screenwriters from Florida Category:Lesbian feminists Category:LGBT people from Florida Category:American LGBT writers",
 "title": "Rita Mae Brown"
}