{
 "id": "197312",
 "text": "The Spanish Inquisition was a tribunal started in 1478 in Spain. It was started by Ferdinand II of Aragon and Isabella I of Castile, with the assistance of Tomás de Torquemada. ==Overview== During the Spanish Inquisition many people were burnt in front of crowds on the streets. In practice, the Spanish Inquisition served to stabilize power in the monarchy of the newly unified Spanish kingdom, while it achieved that end via infamously brutal means. * * * * * * * * * * ==Background== The rulers of Spain asked the Pope to start the Inquisition to hunt for Jews who converted to Catholic Christianity accused (often falsely) of being disloyal to their Christian faith. In 1492, they demanded all morisco to leave Spain. Many left, but many stayed and claimed to be Christians. The Inquisition became busy deciding which ones were truthful. In 1502, the Muslims were also ordered out. Some parts of Spain actually enforced this order. When Protestants appeared, the Inquisition said they were faking as Christians. Most trials ended with the defendant giving up his beliefs and being let go. The Inquisition became less active in later years and was completely abolished in 1834. ==Denial== ===The Vatican=== In 2004, the Roman Catholic Church (RCC) published findings that the judges of the Inquisition were \"not as brutal as previously believed\". * * * The RCC also denied that most trials were carried out by Catholic courts, while claiming that the victims put on trial were often \"tortured for only 15 minutes in the presence of doctors\". ===Spain=== For the past decade, movements within Spain have emerged to rewrite the history of the Spanish Inquisition. Members of the movements released a series of books, films, TV programs and mobile exhibitions to beautify the Inquisition-associated Spanish history. ==Related pages== * Supersessionism * Antisemitism in Europe ==Other websites== * The Catholic Church * The Secret of the Inquisition * 12 Anti- Semitic Radical Traditionalist Catholic Groups * Antisemitism in History: From the Early Church to 1400 * Foundations of Holocaust: From Inquisition to “Purity of Blood” * The Ustaše and the Roman Catholic Church in the Independent State of Croatia ==References== Category:Spain Category:Racism Category:Massacres Category:Catholicism Category:Antisemitism Category:Discrimination Category:Spanish Empire Category:History of Spain Category:History of Europe Category:15th century in Spain Category:16th century in Spain Category:17th century in Spain Category:18th century in Spain Category:19th century in Spain Category:15th century in Europe Category:16th century in Europe Category:17th century in Europe Category:18th century in Europe Category:19th century in Europe Category:Antisemitism in Europe Category:Establishments in Spain",
 "title": "Spanish Inquisition"
}