{
 "id": "197882",
 "text": "The 3 classes of United States senators are made up of 33 or 34 senators. Senators that are a part of the same class are elected at the same time every 6 years. Each state has 2 classes of senators. ==Classes== ===Class 1=== Class 1 is made up of the 33 senators who were elected in 2018. The senators elected in 2024 will serve starting in 2025. The next elections are in 2030. States with a Class 1 senator: Arizona, California, Connecticut, Delaware, Florida, Hawaii, Indiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Jersey, New Mexico, New York, North Dakota, Ohio, Pennsylvania, Rhode Island, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, and Wyoming.http://www.senate.gov/pagelayout/reference/two_column_table/Class_I.htm Current Class I, (senate.gov) ===Class 2=== Class 2 is made up of the 33 senators who were elected in 2020. The next elections are in 2026 States with a Class 2 senator: Alabama, Alaska, Arkansas, Colorado, Delaware, Georgia, Idaho, Illinois, Iowa, Kansas, Kentucky, Louisiana, Maine, Massachusetts, Michigan, Minnesota, Mississippi, Montana, Nebraska, New Hampshire, New Jersey, New Mexico, North Carolina, Oklahoma, Oregon, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Virginia, West Virginia, and Wyoming.http://www.senate.gov/pagelayout/reference/two_column_table/Class_II.htm Current Class II, (senate.gov) ===Class 3=== Class 3 is made up of the 34 senators who were elected in 2022. The next elections are in 2028. States with a Class 3 senator: Alabama, Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Missouri, Nevada, New Hampshire, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, South Carolina, South Dakota, Utah, Vermont, Washington, and Wisconsin.http://www.senate.gov/pagelayout/reference/two_column_table/Class_III.htm Current Class III, (senate.gov) ==References== Category:United States Senate",
 "title": "Classes of United States senators"
}