{
 "id": "197888",
 "text": "Nvidia Corporation (, ) is an American multinational corporation. It is based in Santa Clara, California. They make graphical processing technologies for computers and mobile devices like smartphones. The company supplies electronic chips for motherboard chipsets, smartphone graphic controllers, graphics processing units, and game consoles. Nvidia product lines include: GeForce, Quadro, and nForce (chipsets). In 2023 it was said to be the world’s most valuable chipmaker. Demand for its artificial intelligence (AI) chips more than doubled its income in 2023. Its stock market value jumped to more than $1 trillion. In June 2024, Nvidia became the world's largest public company. == Name == \"Nvidia\" is a combination of two parts: n (usually used as a mathematical variable) and video (Latin: to \"see\"). == History == Nvidia was started in 1993 by Jen-Hsun Huang, Curtis Priem, and Chris Malachowsky. In 2000 Nvidia took intellectual possession of 3dfx, one of the biggest GPU producers in the 1990s. On December 14, 2005, Nvidia bought ULI. At that time ULI supplied 30% Southbridge parts for chipsets to ATI), Nvidia's competitor. In March 2006, Nvidia bought the company Hybrid Graphics.The Register Hardware news: Nvidia acquires Hybrid Graphics On January 5, 2007, the company announced their acquisition of PortalPlayer, Inc.Press Release: acquires PortalPlayer, dated January 5, 2007. In December 2006, Nvidia, along with its main rival in the graphics industry Advanced Micro Devices (AMD), received subpoenas from the Justice Department. This was regarding possible antitrust violations in the graphics card industry. Forbes magazine called Nvidia \"Company of the Year for 2007\" for accomplishing its company goals in the last 5 years. == Products == * NV1 – Nvidia's first product; based on quadratic surfaces * RIVA 128 and RIVA 128ZX – DirectX 5 support, OpenGL 1 support; Nvidia's first DirectX-compliant hardware * RIVA TNT, RIVA TNT2 – DirectX 6 support, OpenGL 1 support; the series that made Nvidia a market-leader * Nvidia GeForce – desktop graphics acceleration solutions * Nvidia Quadro – high-quality workstation solutions * Nvidia Tesla – dedicated GPGPU processing for High Performance Computing systems * Nvidia GoForce – media processors for PDAs, smartphones, and mobile phones featuring nPower technology * H100 AI processor * GPUs for game consoles: ** Xbox – GeForce 3-class GPU (on an Intel Pentium III/Celeron platform) ** PlayStation 3 – RSX 'Reality Synthesizer' ==Footnotes== === References === === Notes=== == Other websites == * * Nvidia Developer website Category:American computer hardware manufacturers Category:1993 establishments in California Category:Companies based in the San Francisco Bay Area Category:Santa Clara, California",
 "title": "Nvidia"
}