{
 "id": "197912",
 "text": "Survivor Series (2008) was a professional wrestling pay-per-view (PPV) event made by World Wrestling Entertainment (WWE). It took place on November 23, 2008 at the TD Banknorth Garden in Boston, Massachusetts. It was the 22nd Survivor Series event held by WWE and was also the first Survivor Series event to be broadcast in high definition. Six matches happened on the card. The main event was for the World Heavyweight Championship. John Cena beat the champion, Chris Jericho, to win the title for the first time (and his fourth world championship overall in WWE). SmackDown's main event saw Edge defeat Vladimir Kozlov, and the champion Triple H, in a Triple Threat match to win his third WWE Championship (his sixth world championship overall in WWE). Both Cena and Edge returned from absence at this event. ==Results== No. Results Stipulations Times 1 The Brian Kendrick defeated Kung Fu Naki Singles match N/A 2 Team HBK (Shawn Michaels, Rey Mysterio, Cryme Tyme (Shad and JTG), and The Great Khali (with Ranjin Singh) defeated Team JBL (John \"Bradshaw\" Layfield, Kane, Montel Vontavious Porter, John Morrison and The Miz) Five-on-five Survivor Series Elimination match 18:13 3 Team Raw (Beth Phoenix, Mickie James, Kelly Kelly, Candice Michelle, and Jillian Hall) (with Santino Marella) defeated Team SmackDown (Michelle McCool, Victoria, Maria, Maryse, and Natalya) Five-on-five Divas Survivor Series Elimination match 9:39 4 The Undertaker defeated Big Show Casket match 12:45 5 Team Orton (Randy Orton, Shelton Benjamin, William Regal, Cody Rhodes, and Mark Henry) (with Layla, Manu and Tony Atlas) defeated Team Batista (Batista, CM Punk, Kofi Kingston, Matt Hardy, and R-Truth) Five- on-five Survivor Series Elimination match 16:13 6 Edge defeated Triple H (c) and Vladimir Kozlov Triple Threat match for the WWE Championship 14:22 7 John Cena defeated Chris Jericho (c) Singles match for the World Heavyweight Championship 21:19 ===Survivor Series Traditional Elimination Matches=== Elimination Wrestler Team Eliminated by Elimination move Time 1 JTG Team HBK MVP Drive-By Kick 1:41 2 MVP Team JBL Khali Khali chop 1:54 3 Kane Team JBL Mysterio Khali Chop by Khali and an Aided splash with Khali 3:26 4 Shad Team HBK The Miz Reality Check 6:30 5 The Miz Team JBL Mysterio 619 followed by a Frog Splash 11:45 6 JBL Team JBL - Counted out 17:57 7 Morrison Team JBL Michaels Sweet Chin Music 18:13 Survivor(s): Shawn Michaels, Rey Mysterio and The Great Khali (Team HBK) Elimination Wrestler Team Eliminated by Elimination Move Time 1 Victoria Team SmackDown Kelly Kelly Roll-up 2:54 2 Kelly Team Raw Maryse Backbreaker 3:23 3 McCool Team SmackDown James Mickie-DTT 5:07 4 James Team Raw Maryse Roll-up 5:26 5 Natalya Team SmackDown Candice Spear 6:45 6 Jillian Team Raw Maria Roll-up 7:44 7 Maria Team SmackDown Candice Northern lights suplex 7:55 8 Candice Team Raw Maryse Inverted figure-4 leglock 8:38 9 Maryse Team SmackDown Phoenix Glam Slam 9:39 Survivor(s): Beth Phoenix (Team Raw) Elimination Wrestler Team Eliminated by Elimination Move Time 1 Regal Team Orton Punk Go To Sleep 0:11 2 R-Truth Team Batista Benjamin Paydirt 7:38 3 Kingston Team Batista Orton Rope hung DDT 10:45 4 Punk Team Batista Rhodes Silver Spoon DDT 13:06 5 Hardy Team Batista Henry World's Strongest Slam 14:22 6 Henry Team Orton Batista Spear 14:32 7 Benjamin Team Orton Batista Batista Bomb 15:06 8 Batista Team Batista Orton RKO 16:13 Survivor(s): Randy Orton and Cody Rhodes (Team Orton) ==Related pages== *Survivor Series *List of WWE pay- per-view events ==References== ==Other websites== *Official Survivor Series 2008 website Category:2008 in American television Category:2008 in professional wrestling Category:Sports in Boston Category:Survivor Series Category:2008 in Boston",
 "title": "Survivor Series (2008)"
}