{
 "id": "198144",
 "text": "Orrin Grant Hatch (March 22, 1934 - April 23, 2022) was an American politician and lawyer. He was a U.S. Senator from Utah from 1977 until 2019. He was a Republican and a Mormon. After the Republicans won control of the Senate in the 2014 elections, Hatch became President pro tempore on January 6, 2015.Hatch named President pro tempore-designate - Salt Lake Tribune Hatch ran for President of the United States in 2000, but he dropped out of the race after losing the first primary election. He was seen as a possible candidate for the United States Supreme Court. On January 2, 2018, Hatch announced his retirement from the Senate after low approval ratings. ==Early life== Hatch was born in Homestead, Pennsylvania on March 22, 1934 to Jesse Hatch and Helen Frances. He was raised in Pittsburgh, Pennsylvania. Hatch studied at Brigham Young University and at the University of Pittsburgh. He worked as an attorney in Pittsburgh and in Utah. ==United States senator (1977–2019)== In 1976, in his first run for public office, Hatch was elected to the United States Senate. He defeated Democrat Frank Moss, who had been a Senator for three terms, or 18 years. During the campaign, Hatch said that Moss had been in the Senate too long. He joked, \"What do you call a Senator who's served in office for 18 years? You call him home.\" Hatch argued that many Senators, including Moss, had lost touch with the people who voted for them. Hatch himself held office for 42 years. In 1995 Hatch was the leading figure behind the Senate's anti-terrorism bill. This bill was passed in response to the Oklahoma City Bombing. As a senior member of the Senate Select Intelligence Committee, Hatch was also important in the 2008 extension of the Foreign Intelligence Surveillance Act. He said, \"This bipartisan bill will help defeat terrorism and keep America safe. No, the legislation is not perfect, but it ensures that the increased expansion of the judiciary into foreign intelligence gathering doesn’t unnecessarily hamper our intelligence community.” Hatch has been a longtime advocate of amending the United States Constitution to require that total spending of the federal government for any fiscal year not exceed total receipts. He proposed the DREAM Act, which would provide a pathway to citizenship for the children of undocumented immigrants, who were children when their parents came to the United States. Senator Hatch co-sponsored the Restoring the 10th Amendment Act (S. 4020 111th Congress), which would strengthen state rights under the 10th Amendment. The bill would provide special standing for state officials in challenging proposed regulations. In 2018, Hatch announced that he would retire after seven terms in the Senate. ==Supreme Court== Hatch has long expressed interest in serving on the U.S. Supreme Court, but due to his age decided not to express any interest anymore. It was reported that he was on Ronald Reagan's short list of candidates to succeed Lewis F. Powell, Jr. on the United States Supreme Court, but was passed over at least in part because of the Ineligibility Clause. Despite that, he vocally supported Robert Bork, who was chosen instead. ==2000 presidential campaign== In 2000, Hatch made a failed bid for the Republican presidential nomination, losing to then-Texas Governor George W. Bush. During the first Republican debate, Hatch made web usability a campaign issue, a first for a presidential candidate. He claimed his website was more user- friendly than Bush's. At least one web usability expert agreed.Don't Make Me Think, by Steve Krug; Que Publishing, 2000; ==Personal life== Hatch married Elaine Hansen on August 28, 1957. They had six children. Hatch was a member of The Church of Jesus Christ of Latter-day Saints. Hatch served as a member of the board of directors of the United States Holocaust Memorial Museum. In November 2018, Hatch received the Presidential Medal of Freedom from President Donald Trump. Hatch played the piano, violin and organ. Hatch had written songs for many. He co-authored \"Everything And More\", sung by Billy Gilman. Hatch earned over $10,000 as an LDS music recording artist while he was senator. Hatch died on April 23, 2022 in Salt Lake City, Utah from problems caused by a stroke. He was 88 years old. ==References== ==Other websites== * * * Collected news and commentary at The Salt Lake Tribune * Profile at SourceWatch Category:1934 births Category:2022 deaths Category:Presidential Medal of Freedom recipients Category:American Latter Day Saints Category:Politicians from Pittsburgh Category:Presidents pro tempore of the United States Senate Category:United States senators from Utah Category:Republican Party (United States) politicians Category:2000 United States presidential candidates Category:Lawyers from Pittsburgh Category:Lawyers from Utah Category:Writers from Pittsburgh Category:Writers from Utah Category:Deaths from stroke",
 "title": "Orrin Hatch"
}