{
 "id": "198218",
 "text": "The Return of Jafar (also known as Aladdin: The Return of Jafar or simply Aladdin 2) is a 1994 American direct-to-video animated movie, released on VHS by Buena Vista Pictures, and the sequel to the 1992 Disney animated movie Aladdin. The movie is about Jafar trying to get revenge on Aladdin. It is also the first direct-to-video sequel produced by Disney. == Cast == * Jason Alexander as Abis Mal * Jeff Bennett as a Thief * Val Bettin as Sultan (originally voiced by Douglas Seale) * Liz Callaway as Jasmine's singing voice (originally provided by Lea Salonga) * Dan Castellaneta as Genie (originally voiced by Robin Williams) * Brian Cummings as Jack the Hermit Crab * Jim Cummings as Razoul (his name is inspired by animator Rasoul Azadani) * Jonathan Freeman as Jafar * Linda Gary as Marry the Dolphin * Gilbert Gottfried as Iago * Brad Kane as Aladdin's singing voice * Maurice LaMarche as Jafar the Genie * Linda Larkin as Jasmine * B. J. Ward as a street woman * Scott Weinger as Aladdin * Frank Welker as Abu Additional voices were provided by Carlos Alazraqui, Jack Angel, Bob Bergen, Rodger Bumpass, Corey Burton, Cam Clarke, Grey DeLisle, Debi Derryberry, Paul Eiding, Bill Farmer, Jessica Gee- George, Jess Harnell, Phil LaMarr, Sherry Lynn, Mona Marshall, Mickie McGowan, Laraine Newman, Nolan North, Patrick Pinney, Phil Proctor, Jan Rabson, Peter Renaday, Michelle Ruff, Kath Soucie, Holland Taylor, Kari Wahlgren, Jim Ward, Joe Whyte and Wally Wingert. == Crew == *Produced by: Walt Disney Television Animation *Producers: Tad Stones and Alan Zaslove *Directors: Toby Shelton, Tad Stones and Alan Zaslove *Story by: Duane Capizzi, Douglas Langdale, Mark McCorkle, Robert Schooley and Tad Stones *Written by: Kevin Campbell, Mirith J. S. Colao, Flip Kobler, William Motz, Steve Roberts, Thomas J. Rogers, Devin Ross, Bob Roth, Jan Strnad and Brian Swenlin *Based on the characters from Aladdin created by: Ronald S. Clements, Ted Elliott, John Musker and Terry Rossio *With the voice talents of: See Cast section for more info. *And the additional voices of: See Cast section for more info. It's the paragraph that starts with: \"Additional voices were provided by...\" *Associate producers: Francis Glebas and Maia Mattise *Voice casting director: Jamie Thomason *Voice director: Ginny McSwain *Animation directors: Dale Case, John Kimball, Marshall P. Lamore, Kazuo Terada, Saburo Hashimoto, Rick Leon, Ian Harrowell, Steven Trenbirth and Takamitsu Kawamura *Storyboard: Kurt Anderson, Ryan Anthony, Vic T. Cook, William Finn, John Flagg, Denise Koyama, Lonnie Lloyd, Sue C. Nichols, Dave Aloysius Prince, Christopher Rutkowski, Wendell Washer and Phil Weinstein *Character design: Dan Haskett, Dana Landsberg and Kenny Thompkins *Key layout design: Derek Carter, Paul A. Felix, Dennis Greco, Carol Police and Robert St. Pierre *Prop design: Greg Guler, Terence Hudson and Marty Warner *Key background stylists: Paro Hozumi and Bill Lorencz *Color key stylists: Debra Jorgensborg, Jill Stirdivant and Brittany J. Teegarden *Storyboard revisions: Shawna Cha, Llyn Hunter, Craig Kemplin, Todd Kurosawa and Albert Ring *Production manager: Selma Gladney *Continuity coordinators: Vonnie Batson, James C. Finch and Brian Sintay *Talent coordinator: Dan Pensiero *Original music and andaptations by: Mark Watters *Adaptations based on music by: Alan Menken Arabian Nights *Words by: Howard Ashman *Music by: Alan Menken Arabian Nights *Produced and arranged by: Bruce Rowland *Performed by: Brian Hannan I'm Looking Out for Me *Words and music by: Randy Petersen and Kevin Quinn *Performed by: Gilbert Gottfried Nothing in the World (Quite Like a Friend) *Words and music by: Dale Gonyea and Michael Silversher *Performed by: Liz Callaway, Dan Castellaneta and Brad Kane Forget About Love *Words and music by: Michael Silversher and Patty Silversher *Performed by: Liz Callaway, Gilbert Gottfried and Brad Kane You're Only Second Rate *Words and music by: Randy Petersen and Kevin Quinn *Performed by: Jonathan Freeman *Songs arranged by: Bill Elliott *Associate producer of music: Bambi Moè *Additional music by: Harvey Cohen, Jake Givens, Carl Johnson, Eric Schmidt and Thom Sharp *Music mixers: Bruce Botnick and Al Snelling *Supervising music editor: Pattie Carlin *Music editors: Dominick Certo, Mark Perlman, Liz Lachman and Charlie H. Paley *Music contractors: Sandra J. de Crescent, Reggie Wilson and Peter Willison *Featured musicians: Tom Boyd (Oboe soloist), Skaila Kanga (Harp), Jon K. Snowden (Flute), Derek Watkins (Trumpet) and William Liston Animation production provided by Walt Disney Animation Australia (credited as Walt Disney Animation (Australia) Pty, Inc.) *Assistant directors: Janey Dunn, Mickie Cassidy, Ryan O'Loughlin and Di Rudder *Animators: Gairden Cooke, Kanglin Zhu, Andrew Collins, Dick Dunn, Helen McAdam, Michael Stapleton, Marek Kochout, Andrew Brooks, Peter Candeland, Paul Newell, Dwayne Labbe, Christopher Bradley, Ian White, Marten Coombe, Nilo Santillan, Georges Abolin, Troy Saliba, Mike Chavez, Kristina Reay, Lianne Hughes, Carol Seidl, Ariel Ferrari, Morris Lee, Steven Taylor, Wal Micati, Stephen Cooper, Warwick Gilbert, Lily Dell, Manny Banados, Mac Monks, Tyler Bosco, Simon Brown, Joe Szekeres, Leesa Tynan, Adam Murphy, Oscar Perez, Murray Debus, David MacDougall, Christian J. Derochie and Stephen Grant *Layout supervisors: Alex Nicholas and John Hill *Layout artists: Yosh Barry, Kevin Wotton, David Skinner, Kevin Spill, Nicholas Pill, Bruce Pedersen, Margaret Parkes and Kelly Baigent *Background supervisor: Beverly McNamara *Background artists: Barry Dean, Paul Pattie, Felice Ferrer, Kenneth L. Wright, Gerald Liew, Helen Steele, George Humphrey and Milana Borkert *Ink and paint supervisors: Angela Bodini, Robyn Drayton, Christine O'Connor and Liz Lane *Painters: Ania Kornacki, Liz Coleman, Barrie Hines, Danuta Jelenkowska, Christopher McManus, Melinda Dixon, Anna Hall, Agnes Forster, Francesca de Celis, Murray Swift, Leanne Kornacki, Sammie C. Magri, Terese Nam, Mark Sonntag, Alister Grant, Benjamin Wolfe, Megan Hitchens, John Barrett, Jessica Khachan, Gavin Stone, David Lumley and Zsa Petrovic *Additional painters: Donene Bailey, Elizabeth Jamsek, Fran Smith, Jacky Neville, Jenny North, Kerry Martin, Samia Johnston, Marie Dale, Katherine O'Brien, Babetta Latooy, Margaret Thompson, Gail Brooks, Karen Clarke, Jay Hawke, Diana Mathews, Michelle Walker and Klara Osust *Clean-up assistant animators: Manuk Chang, Noel Domingo, Georgina Santos, Rizaldy Jones, Sophia Ruo Liu, Peter Eastment, Deborah M. Cramb, Lindy Catchlove, Sonny Esquillon, Neville Ryan, Adam Tekani Marr, Natalie Holmes, Terence J. O'Toole, Theresa Armstrong, Daryl Brougham, Guy Matthew Pascoe, Phoebe Middleton, Michael Comino and Ian Young *Clean-up additional assistant animators: Eva Helischer, Sally Woods, Sylvia Lee, Eva Harris, Tony Davis, Susan L. Tanner, Max Gunner, Milan Zahorasky, Deborah Cameron, James Shah, Stuart Keith Cunningham, Peggy Orr, Dominique Audard, Janine Dawson and Suk-Hee Parks *Inbetweeners: Rowen Avon-Smith, Ding Zhiqiang, Amanda Earle, Kaylene Bradley, Gregory Farrugia, John F. Horvath, Bernard Derriman, Anna Dimezza, Randall Glusac-Thompson, Enrique Gallardo, Chis Wahl, Anthony Quelch, Mauro di Constanzo, Martin Dingle-Wall, Fe Ventura, Silvio M. Arlenghi, Sean Arnold Steinmuller, Jeanette Williamson, Danielle Latta-Freeman, Ben Lee, Simon F. Ashton, Antony Bunyan, Gerard Hannagan, Stewart Griffiths, William Bourke, Mike Comino, Guy Pascoe, Jie Yuan, Sidney Ahearne, Kay-Janine Svoronos, Eli Braga, Tony Anselmo, Rowena Hamlyn-Aspden, Richard Pace, Dorian Reid, Kevin Comty, Ian Young, Roger Clarke and Celine Jackson *Production manager: Terry W. Smith *Checking supervisor: Dan Forster *Checking: Mark Evans and Gary Page *Camera: Fernando Letteri, Robert Letteri, Carole Salter, José Barreiros and Elias Macute *Inbetweening supervisor: Mickie Cassidy *Clean-up supervisor: Janey Dunn Animation production by Walt Disney Animation Japan (credited as Walt Disney Animation (Japan), Inc. *Animation supervisor: Shigeru Yamamoto *Animation directors: Takeshi Atomura, Hisashi Wada, Makoka Yasue, Hiroshi Kawamata, Kazuyoshi Takeuchi and Masaaki Kudo *Animators: Kōichi Maruyama, Miyuki Hoshikawa, Mitsuko Otaku, Yoshiaki Matsuda, Kiyomi Miyakawa, Kenichi Tsuchiya, Manao Torii, Yuko Matsuo, Yuri Takasaki, Heihachiro Tanaka, Isamitsu Kashima, Kazue Yamanaka, Sachiko Wakabayashi, Osamu Tanihata, Hideaki Kurakawa and Kōji Fukuoka *Assistant animators: Shizuka Okumoto, Kazumi Sagawa, Harumi Nakamura, Chie Arai, Rie Arai, Roy Sato and Yurika Fujisawa *Inbetween checker: Ryoko Hishimoto *Inbetweeners: Mami Shimizu, Toru Sotobori, Kazue Shigenobu, Yukiko Furukawa, Takanobu Hatada, Mika Ohara, Junpei Tatenaka, Yūji Ushijima and Taizou Sengoku *Background artists: Masayoshi Banno, Michiko Taniguchi, Naomi Sakimoto, Shuuichi Hirowatari, Satoshi Matsudaira, Jinzaburo Kaiho, Tachiko Kimura and Masumi Nose *Cutter: Makoto Arai *Additional production facilities: Nakamura Productions, Takahashi Productions, Studio Robin, Studio Cats and Light Foot *Animation camera operator: Elias Macute *Production associate: Elzbieta Araszkiewicz *Post-production manager: Cheryl Murphy *Post-production supervisor: Joseph Hathaway *Post-production coordinator: John Royer *Sound dubbing supervisors: Christopher Keith and Mark von der Heide *Supervising editor: Rob Birchard *Film editors: Elen Orson and Julie A. Lau *Assistant film editors: Susan Edmunson, Shannon Scudder-Pudleiner and Christopher Gee *On-line editor: David Klandrud *Track reading: Skip Craig and Christine Craig *Title design: Susan Bradley *End credit compositing: Buena Vista Imaging *Digital ink and paint software: Toon Boom Animation *Digital film services: E-Film *Colorists: Timothy Peeler and Brian Linse *Color timer: Dale Grahn *Negative cutter: Kevin Henry *Produced and distributed on: Eastman Film *Prints by: Technicolor *Supervising sound editor: Stephen Flick, M.P.S.E. *Supervising ADR editors: Christopher Gee and Judee Flick, M.P.S.E. *Sound editors: Dean Beville, Jim Christopher, Mike Chock, John Dunn, Teresa Eckton, M.P.S.E., Donald Flick, Avram Dean Gold, M.P.S.E. and R. J. Kizer *Assistant sound editor: Jeena M. Phelps *Sound effects editor: Bruce Stubblefield *Sound mixer: James Twomey *Production sound mixer: Deb Adair *Foley recorded by: Ezra Dweck *Foley by: Joan Rowe and Cathrine Rowe *Additional sound design: Mark Mangini *Re-recording mixers: Terry Porter, C.A.S., Mel Metcalfe and David T. Huddson *Assistant producer: Jessica Koplos-Miller *Production assistants: Jodey Kaminski and Frøydis Bøe *Script coordinators: Susan McElroy and Leona Jernigan *Art coordinator: Michael Gracey *Production secretaries: Regina Dixon and Cricket Luke *Administrative coordinator: Johanne Beaudoin *Script supervisors: Carolyn Scully and Anita Lish *Story coordinator: Nanci Battelle *Post-production assistants: Jason Spratt, Steve Werner and Keith Yeager *Shipping coordinator: Craig Simpson The producers wish to thank the artists and animators of the original motion picture for their guidance, inspiration and support. This picture made under the jurisdiction of IATSE, affiliated with A.F.L.-C.I.O.-C.L.C. (c) 1994 The Walt Disney Company - All rights reserved. In a post-credits scene, Abis Mal, still dangling from the tree, realizes he'll never get his third wish. Category:1994 animated movies Category:Aladdin (Disney) Category:Disney animated movies Category:Disney direct-to-video movies Category:Direct-to-video movies Category:English- language movies",
 "title": "The Return of Jafar"
}