{
 "id": "198281",
 "text": "O'Shea Jackson Sr. (born June 15, 1969), better known by his stage name Ice Cube, is an American rapper and actor. He was a member of the well-known rap group N.W.A. He is best known for popularizing the gangsta rap genre with the album \"Straight Outta Compton\" in 1988. After leaving N.W.A in December of 1989, he began his solo work. ==Discography== ;Studio albums * AmeriKKKa's Most Wanted (1990) * Death Certificate (1991) * The Predator (1992) * Lethal Injection (1993) * War & Peace Vol. 1 (The War Disc) (1998) * War & Peace Vol. 2 (The Peace Disc) (2000) * Laugh Now, Cry Later (2006) * Raw Footage (2008) * I Am the West (2010) * Everythang's Corrupt (2018) ==Filmography== ===Films=== Year Film Functioned as Role Director Producer Screenwriter Actor 1991 Boyz n the Hood Darin \"Doughboy\" Baker 1992 Trespass Savon 1993 CB4 Himself (cameo) 1994 The Glass Shield Teddy Woods 1995 Higher Learning Fudge Friday Craig Jones 1997 Dangerous Ground Vusi Madlazi Anaconda Danny Rich 1998 The Players Club Reggie I Got the Hook Up Gun runner 1999 Three Kings Sgt. Chief Elgin Thicker Than Water Slink 2000 Next Friday Craig Jones 2001 Ghosts of Mars James 'Desolation' Williams 2002 All About The Benjamins Bucum Barbershop Calvin Palmer Friday After Next Craig Jones 2004 Torque Trey Wallace The N-Word Himself Barbershop 2: Back in Business Calvin Palmer 2005 Are We There Yet? Nick Persons Beauty Shop Sierra Leone's Refugee All Stars XXX: State of the Union Darius Stone / XXX 2007 Are We Done Yet? Nick Persons 2008 First Sunday Durell Washington The Longshots Curtis Plummer 2009 Janky Promoters Russell Redds 2010 Lottery Ticket Jerome \"Thump\" Washington 2011 Rampart Kyle Timkins 2012 21 Jump Street Capt. Dickson 2014 Ride Along Detective James Payton 22 Jump Street Capt. Dickson The Book of Life The Candle Maker (voice role) 2015 Straight Outta Compton 2016 Ride Along 2 Detective James Payton Barbershop: The Next Cut Calvin Palmer 2017 XXX: Return of Xander Cage Darius Stone / XXX Fist Fight Strickland 2020 The High Note Jack Robertson ===Television=== Year Film Functioned as Role Notes Producer Screenwriter Director Actor 1994 The Sinbad Show Himself Episode: The Mr. Science Show 2002 The Bernie Mac Show Himself Episode: Goodbye Dolly 2005 BarberShop: The Series WrestleMania 21 Himself 2006 Black. White. 2007 Friday: The Animated Series 2010 30 for 30 Episode: Straight Outta L.A. 2010–2013 Are We There Yet? Terrence Kingston Recurring Role; 20 Episodes 2014 The Rebels Pilot of unproduced series 2017 The Defiant Ones Himself Documentary == Other websites == * Official website * Category:1969 births Category:Living people Category:Actors from Los Angeles Category:African-American actors Category:African-American movie producers Category:African-American musicians Category:American movie actors Category:American Muslims Category:American screenwriters Category:American television actors Category:American television producers Category:American voice actors Category:Gangsta rappers Category:Movie producers from Los Angeles Category:Rappers from California Category:Screenwriters from Los Angeles",
 "title": "Ice Cube"
}