{
 "id": "198693",
 "text": "Fujian (; ) is a province on the southeast coast of China. The capital is Fuzhou. Most of Fujian is administered by the People's Republic of China. However some Fujian areas like Kinmen (also called Quemoy) and Matsu are under the control of the Republic of China. The PRC however, still claim that Kinmen and Matsu to be part of Fujian Province of the PRC. == Geography == Fujian is separated from Taiwan by the 180km wide Taiwan Strait. Some of the small islands in the strait are also part of the province. Small parts of the province, namely the islands of Kinmen and Matsu, are under the administration of the Republic of China. The area of Fujian is about 121,400 square kilometers. * Administrative divisions The People's Republic of China controls most of the province, and divides it into nine prefecture-level divisions. Map # Name Hanzi Pinyin Type 1 Fuzhou 福州市 Fúzhōu Shì Prefecture-level city 2 Xiamen 厦门市 Xiàmén Shì Sub-provincial city 3 Longyan 龙岩市 Lóngyán Shì Prefecture-level city 4 Nanping 南平市 Nánpíng Shì Prefecture-level city 5 Ningde 宁德市 Nánpíng Shì Prefecture-level city 6 Putian 莆田市 Pútián Shì Prefecture-level city 7 Quanzhou 泉州市 Quánzhōu Shì Prefecture-level city 8 Sanming 三明市 Sānmíng Shì Prefecture-level city 9 Zhangzhou 漳州市 Zhāngzhōu Shì Prefecture-level city All of these cities except Longyan, Sanming, and Nanping are found along the coast. == Economy == Fujian is one of the powerhouses in Chinese economy. In 2008, Fujian's nominal GDP rose by 13% from the previous year. With year-over- year growth rate of ~10% in past years, Fujian's 2017 GDP reached 3.23 trillion Yuan (1 Yuan is about 0.66 US $ in 2017).This puts Fujian in No. 10 spot among Chinese provinces by GDP ranking. == Demographics == The population is 34.71 million (2000 population census). Han Chinese make up most of the population.In 2018, the population increased to 39.11 million. == Famous people == *Huang Qiaoshan (871–953), Vice-Minister of Works, Tang dynasty. *Zheng Qiao (1108–1166), historian. *Zhu Xi (1130–1200), Confucian philosopher. *Lin Zexu (1785–1850), scholar and official. *Lin Shu (1852–1924), translator. === Dialects === * There are several local dialects spoken by people from different regions in Fujian. People from the South (Xiamen, Quanzhou, etc.) speak Min, also known as Hokkien. ==Related pages== * Fujian Province, Republic of China == References == == Other websites == *Fujian Government website",
 "title": "Fujian"
}