{
 "id": "19870",
 "text": "Somaliland (; , ), officially the Somaliland Protectorate (, ) is a de facto country that used to be the former protectorate of British Somaliland. Djibouti lies to the west of Somaliland, the Federal Republic of Ethiopia lies to the south and west and Somalia lies to the east and south.Hoehne, Markus Virgil. \"The rupture of territoriality and the diminishing relevance of cross‐cutting ties in Somalia after 1990.\" Development and Change 47.6 (2016): 1379-1411. The area used to be the Somaliland protectorate, which was part of the British empire along with Jubaland, once called Trans-juba. The British granted its independence on 26 June 1960 upon which it called the \"Somaliland Republic\". Shortly after, the leaders of Somaliland and Somalia agreed to form a unified state. In May of 1991, after a brutal war waged by the government of Siad Barre, Somaliland proclaimed and regained its independence. Currently, Somaliland's international position fulfills the requirements to be considered an independent country according to the Montevideo Convention. The government of Somalia, however, still considers Somaliland to be a part of Somalia. Somaliland has a republican government with free elections. The capital is Hargeisa. Berbera is a beautiful city on the coast. About 55% of the people of Somalilands are nomads. Most Somalis are Sunni Muslims. Some people are part of Sufi orders. A territory in the west, called Khatumo State has been disputed between Somaliland and Puntland. ==Demographics== ===Language=== Most people in Somaliland speak Somali and Arabic. Article 6 of the Constitution of 2001 says the official language of Somaliland is Somali, but Arabic is a mandatory subject in school. English is also spoken and taught in schools. The main Somali dialect is Standard Somali. Standard Somali is spoken in most of Somalia and in countries that are next to it. Standard Somali is used by almost all of the media in the Somaliland region. ===Religion=== Almost all Somalilanders are Muslims. This is because Islam is the state religion, and promoting a religion other than Islam is against the law. Small amounts of non-Islamic traditions exist in Somaliland, but Islam is very important to the Somali sense of national identity. ==References== == Other websites == * Somaliland's official website Category:States of Somalia",
 "title": "Somaliland"
}