{
 "id": "199195",
 "text": "The Girl Scouts of the USA is a not-for-profit organization that is a branch of the Scouting movement, similar to the Boy Scouts of America, except it is for girls. It was founded in 1912 by Juliette Gordon Low and first was called the Girl Guides of America, after the Girl Guides in the United Kingdom. Girl Scouts do many activities, which they often earn patches or \"merit badges\" for. They are best known for selling Girl Scout cookies every year to raise money. ==Levels== There are different levels for Girl Scouts, based on age. Different levels do different activities. Today those levels are: * Daisies ** Kindergarten and first grade girls, 5 to 7 years old. ** These girls earn \"Petal\" patches and learn about being part of the Girl Scouts. These girls are the first level of Girl Scouts. * Brownies ** Second and third grade girls, 7 to 9 years old. ** These girls earn \"Try-it\" patches and try out new activities. * Juniors ** Fourth and fifth grade girls, 9 to 11 years old. ** These girls earn badges in activities by becoming good at them, not just trying them. They may also work towards earning other awards. * Cadettes ** Sixth, seventh and eighth grade girls, 11 to 14 years old. ** These girls work on Interest Projects, which involve more complex activities to earn a badge. They also may work towards other awards. These girls are supported to act as leaders. * Seniors ** Ninth and tenth grade girls, 14 to 16 years old. ** These girls do many of the same things as cadettes. They usually also work on projects related to being leaders and lead activities for younger Girl Scouts. * Ambassadors ** Eleventh and twelfth grade girls, 16 to 18 years old. ** These girls do many of the same things as seniors, because Ambassador is a new level that used to be part of the senior level. These girls are the highest level of Girl Scouts. ==Adult members== There are also adult members of Girl Scouts who volunteer and help the organization. Adult members might be college students who became too old to be Girl Scouts, or they might be older adults. Both men and women are allowed to be adult members and volunteer. == References == Category:Scouting Category:Girl Guiding and Girl Scouting Category:Organizations based in New York City",
 "title": "Girl Scouts of the USA"
}