{
 "id": "199375",
 "text": "The Great Leap Forward () was a plan to improve China's economy and industry. The Communist leader Chairman Mao Zedong started the Great Leap Forward in 1958, and it ended in 1962. The Great Leap Forward did not bring industrialization. It created a famine that killed millions of people. Some people think it is biggest famine in history. == Agriculture and farms == Mao wanted China to make enough food to feed the country and still have enough to export. He also wanted China to produce a lot of goods. To achieve this, he started the Great Leap Forward. This plan forced some people to give their land to the government. Many people had to work for the government on farms called agricultural cooperatives or people's communes. Later, these cooperatives were joined together to involve thousands of people. In 1958, ninety-eight percent (98%) of farm workers were in these cooperatives. In 1958, there was a good harvest. However, this began to change the year after. People believed it was helpful to plant crops close together. In fact, this made the crops grow worse, and the country could not grow enough grain in 1959. Resources were not used well, which made future harvests worse. This lasted at least until 1961. == Industry == Mao wanted China's industry to grow very quickly. He wanted the country to have more industry than Great Britain within fifteen years. Later, he shortened this deadline to one year. People who did not agree with Mao's plans were usually killed. By 1958, five thousand people had already been killed because they disagreed with the government. Because the government spent a lot of money on industry, China built up more debt. Workers were required to meet production goals. They were often required to build furnances in their backyards, where they had to smelt iron into steel for tools. However, this did not work very well. The furnaces did not produce good steel, and people ended up melting good things, which just made them unusable. == Famine == Leaders competed with each other to see who could make the most products. This led the farms to be forgotten. Leaders would also lie about the amount of crops being grown. They would tell the government that they were making more than they actually were. In 1959, the country began running out of food. This happened because they sold their grain to other countries. Farms were producing less, which made the problem worse. Also, people were also not allowed to leave their areas to look for food in other places. In some villages, one out of every three or four people died. Girls and old people were especially underfed. Infants and the very old were the first to die. Historians think the famine killed between 16.5 million and 40 million people. This was one of the deadliest famines in history - perhaps the deadliest. == Aftermath == Mao's government tried to stop the famine by cancelling orders for technology and importing food for people to eat. However, this did not help China's economy. It kept worsening after the Great Leap Forward ended. Workers were stressed and exhausted, and the Soviet Union stopped supporting China. Mao used the Cultural Revolution to punish the people he thought had caused the famine. ==Related pages== *Cultural Revolution *Famine *Mao Zedong *History of China *Industrialization == References == Category:1958 in Asia Category:1959 in Asia Category:1960 in Asia Category:1961 in Asia Category:1950s in China Category:1960s in China",
 "title": "Great Leap Forward"
}