{
 "id": "19951",
 "text": "Kyiv or Kiev () is the capital and largest city in Ukraine. It is in north- central Ukraine on the Dnieper River. Over three million people live there. It is not a part of any oblast. However, it is surrounded by Kyiv Oblast, and is the headquarters of Kyiv Oblast. The city hosted the UEFA Euro 2012 final. Kyiv also hosted the Eurovision Song Contest in 2017. Kyiv has a humid continental climate (Dfb in the Köppen climate classification). == Notable people == * Saint Anthony of Kyiv (c. 983–1073), founder of the Kyiv Pechersk Lavra * Mikhail Bulgakov, Russian writer and playwright * Boris Grinchenko (1863–1910), Ukrainian writer, linguist, and ethnographer, an important figure in Ukrainian national revival * Oleksandr Dovzhenko (1894–1956), a pioneering filmmaker and writer in Soviet and Ukrainian cinema * Volodymyr Horowitz (1903–1989), a prominent classical pianist * Serhiy Korolyov (1907–1966), a prominent aerospace engineer and the chief designer of the Soviet space program * Les Kurbas (1887–1937), Ukrainian theater director and innovator in modernist theater, founder of the Berezil Theater * Valeriy Lobanovskyi (1939–2002), football player and coach, who led FC Dynamo Kyiv to international success * Kazimir Malevich (1879–1935), Kyiv-born renowned avant-garde artist and founder of Suprematism * Peter Mohyla (1596–1647), religious and cultural leader, who founded the Mohyla Academy in Kyiv * Kira Muratova (1934–2018), Kyiv-born Soviet and Ukrainian film director and screenwriter * Saint Olga of Kyiv (c. 890–969), Regent of Kievan Rus’ and one of the first rulers to convert to Christianity * Symon Petliura (1917–1921), Ukrainian political and military leader during the Ukrainian War of Independence * Igor Sikorsky (1889–1972), Kyiv-born aviation pioneer who developed the world’s first mass-produced helicopter * Natan Sharansky (b. 1948), Kyiv-born human rights activist and an Israeli politician, a key figure in the Soviet dissident movement * Andriy Shevchenko (b. 1976), Ukrainian footballer and coach, who played in Dynamo Kyiv and AC Milan. * Victor Skumin, Russian professor, philosopher, writer, psychologist, psychiatrist, psychotherapist, and medical doctor * Prince Vladimir the Great (c. 958–1015), Grand Prince of Kyiv, known for the Christianization of Kievan Rus’ in 988 * Prince Yaroslav the Wise (c. 978–1054), a key figure in the cultural and legal development of Kievan Rus’, who established the first legal code, Russkaya Pravda ==References== Notes Category:5th-century establishments in Europe Category:Establishments in Ukraine Category:480s establishments",
 "title": "Kyiv"
}