{
 "id": "199660",
 "text": "Jean-Baptiste Pierre Antoine de Monet, Chevalier de la Marck, usually known as Lamarck, (1 August 1744 – 18 December 1829) was a French soldier, naturalist and member of the French Academy. He was one of the first people to suggest that organisms changed in accordance with natural laws. This is known as evolution. == Life == Jean-Baptiste was the 11th child of Philippe Jacques de Monet de La Marck and Marie-Françoise de Fontaine de Chuignolles. His parents were nobles, but they were not well-off. His parents wanted him to become a priest. Starting at age eleven, he attended a Jesuit school in Amiens. After his father's death in 1759, Jean-Baptiste joined the army. slay. Lamarck fought in the Pomeranian War with Prussia, and was awarded a medal for bravery on the battlefield.University of California Museum of Paleontology, Berkeley: biography of Lamark During his service, he was stationed in different forts in France, mostly at the eastern border, and the Mediterranean coast. At his post in Monaco, Lamarck became interested in natural history and resolved to study medicine. In 1766, he was injured. He retired from the army in 1768 and returned to his medical studies. He worked at a bank in Paris. From 1770 to 1774, he studied medicine at the university, but did not finish his studies with a degree. During this time, he met some of the well-known scientists of his day, such as the botanists Bernard and Antoine-Laurent de Jussieu, and the naturalist Buffon. Lamarck developed a particular interest for botany, and later, after he published a three-volume work Flora française, he gained membership of the French Academy of Sciences in 1779. Lamarck became involved in the Jardin des Plantes and was appointed to the Chair of Botany in 1788. When the Muséum national d'Histoire naturelle was founded in 1793, Lamarck was appointed as a professor of zoology. In 1801, he published Système des animaux sans vertèbres, a major work on the classifications of invertebrates. In an 1802 publication, he became one of the first to use the term biology in its modern sense.The term \"biology\" was also introduced independently by Karl Friedrich Burdach (in 1800) and Gottfried Reinhold Treviranus (Biologie oder Philosophie der lebenden Natur, 1802). Lamarck continued his work as a top authority on invertebrate zoology. In the modern era, Lamarck is remembered mainly for a theory of the inheritance of acquired characters, called soft inheritance or Lamarckism. His major work on this subject was Philosophie zoologique, Paris 1809. His idea of soft inheritance was a reflection of the folk wisdom of the time, accepted by many natural historians. Lamarck's contribution to evolutionary theory was an early, perhaps the first, theory of evolution.Though some think Erasmus Darwin anticipated him. In Lamarck's theory, an alchemical complexifying force drove organisms up a ladder of complexity. A second environmental force adapted them to local environments through use and disuse of characteristics, making them different from other organisms. Since these ideas cannot be reconciled with what we know about genetics, they are now history. Lamarck died in Paris in 1829. When he died, his family was so poor they had to apply to the Academie for financial assistance. Lamarck's books and the contents of his home were sold at auction, and he was buried in a temporary lime-pit. == Controversy with Cuvier == Lamarck came into conflict with the widely respected palaeontologist Georges Cuvier, who was not a supporter of evolution: :\"[Cuvier] ridiculed Lamarck's theory of transformation and defended the fixity of species.\" Bowler.Bowler P.J. 2003. Evolution: the history of an idea. California. p110Burkhart R.W Jr 1970. Lamarck, evolution, and the politics of science. J. Hist Biol 3, 275–296. :\"Cuvier was clearly hostile to the materialistic overtones of current transformist theorizing, but it does not necessarily follow that he regarded species origin as supernatural; certainly he was careful to use neutral language to refer to the causes of the origins of new forms of life, and even of man.\" Rudwick.Rudwick M.S.J. 1997. Georges Cuvier, fossil bones, and geological catastrophes: new interpretations of primary texts. Chicago. p83 After his death, Cuvier used the forum of a eulogy to denigrate Lamarck: :\"His [Cuvier's] éloge of Lamarck is one of the most deprecatory and chillingly partisan biographies I have ever read—though he was supposedly writing respectful comments in the old tradition of de mortuis nil nisi bonum.\" Gould.Gould, Stephen J.1993. Forward to Georges Cuvier: an annotated bibliography of his published works. Compiled by Jean Chandler Smith. Smithsonian, Washington. == Later opposition to his ideas == Opposition to Lamarck's theories became stronger when Mendel's genetics was rediscovered, but there were always common-sense doubts. Particular criticism came from Alfred Russel Wallace and August Weismann later in the 19th century. Here is an example: :\"The modern advocates of Lamarkism content themselves with such simple cases as the strengthening or enlarging of organs by use, the hardening of the soles of the feet by pressure, or the enlarging of the stomach by the necessity of consuming large quantities of less nutritious food. These, and many other modifications, may doubtless be explained by the direct action of conditions if we admit that the change produced in the individual is transmitted to the offspring. That such changes are transmitted has, however, not yet been proved; and a considerable body of naturalists reject such transmission as improbable in itself, and at all events not to be assumed without full and sufficient proof. But even if accepted it will not help to explain the very great number of important adaptations which, like those already referred to, are quite unrelated to any direct action of the environment\".Wallace A.R. 1895. The method of organic evolution. Fortnightly Review, London, February and March. Reprinted in Wallace A.R. Studies scientific and Social. 1900. Macmillan, London. 2 vols, volume I, Chapter 17, p351–352 Wallace's argument in short is: #There is no proof that the changes made during life are inherited. #Many adaptations are in no way connected to any direct action of the environment. == References == Category:1744 births Category:1829 deaths Category:Evolutionary biologists Category:French naturalists",
 "title": "Jean-Baptiste de Lamarck"
}