{
 "id": "199793",
 "text": "John Ray (29 November 1627 – 17 January 1705) was an English naturalist, sometimes referred to as the father of English natural history.Robert W.T. Gunther (ed) 1928. Further Correspondence of John Ray. Ray Society, London. p16 Ray was the son of a village blacksmith who got to Cambridge University on a scholarship. This was in 1644, when the Puritans were making war against Charles I. When he got his bachelor's degree in 1648, he continued as a Fellow of Trinity College. Ray was a Protestant dissenter who had accepted the return of Charles II. He was ordained as a priest of the Church of England, in London in 1660. By then, Charles II insisted that all priests sign an affadavit against the Puritan party. The Act of Uniformity of 1662 made the Book of Common Prayer compulsory in religious services, which was opposed by those of Puritan beliefs. Ray would not sign the affidavit, so he was forced to resign his Fellowship, and could not work as a priest. Ray returned to his native village of Black Notley, near Braintree in Essex. After Ray joined up with a former student, Francis Willughby, the pair spent three years in continental Europe, discovering what the latest scientific ideas were.Green, John C. 1959. The death of Adam: evolution and its impact on western thought. Ames, Iowa: Iowa University Press, p1-3. When he returned to England in spring 1666, he joined the new Royal Society, and devoted himself to the study of natural history. His most important scientific works were supported financially by the Royal Society, whose President at a critical time in the 1680s was Samuel Pepys. Ray published important works on plants, animals, and natural theology. His classification of plants in his Historia Plantarum, was an important step towards modern taxonomy. Ray rejected the system by which species were classified according to an either/or type system. Instead he classified plants by observation according to similarities and differences. Thus he advanced scientific empiricism against the deductive rationalism of the scholastics. He was the first person to give a biological definition of the term species.Historia plantarum generalis 1686, Tome I, Libr. I, Chap. XX, page 40 (Quoted in Mayr, Ernst. 1982. The growth of biological thought: diversity, evolution, and inheritance. Cambridge, Mass.: Belknap Press: p256) :\"Ray sweeps away the litter of mythology and fable... and always insists upon accuracy of observation and description and the testing of every new discovery\".p10 == Ray's works == Ray published about 23 works, depending on how one counts them. The biological works were usually in Latin, the rest in English. For ease of reading, the titles below are in English.Keynes, Sir Geoffrey [1951] 1976. John Ray, 1627–1705: a bibliography 1660–1970. Van Heusden, Amsterdam. *1660: Catalogue of Cambridge plants. *1668: Tables of plants *1668: Catalogue of English plants plus Fasiculus (an *appendix) *1670: Catalogue of English proverbs. *1673: Observations in the Low Countries and Catalogue of plants not native to England. *1674: Collection of English words not generally used. *1675: Trilingual dictionary, or nomenclator classicus. *1676: Willughby's Ornithologia. \"In fact, the book was Ray's, based on preliminary notes by Francis Willughby\".p52 Raven, Charles E. 1942. John Ray, naturalist: his life and works. Cambridge.Chapter 12 \"Willughby and Ray laid the foundation of scientific ornithology\".Newton, Alfred 1893. Dictionary of birds. Black, London *1682: New method of plants. *1686: History of fishes +frontis & 187 engraved plates. Plates subscribed by Fellows of the Royal Society. Samuel Pepys, the President, subscribed for 79 of the plates. *1686–1704: History of plants. 3 vols, vol 1 1686, vol 2 1688, vol 3 1704. The third volume lacked plates, so his assistant James Petiver published Petiver's Catalogue in parts, 1715–1764, with plates. The work on the first two volumes was supported by subscriptions from the President and Fellows of the Royal Society. *1690: Synopsis of British plants. *1691: The wisdom of God. 2nd ed 1692, 3rd ed 1701, 4th ed 1704 (each enlarged from the previous edition). This was his most popular work. It was in the vein later called natural theology, explaining the adaptation of living creatures as the work of God. It was heavily plagiarised (copied) by William Paley in his Natural theology of 1802.p92 p452 *1692: Miscellaneous discourses concerning the dissolution and changes of the world. This includes some important discussion of fossils. Ray insisted that fossils had once been alive, in opposition to his friends Martin Lister and Edward Llwyd. \"These [fossils] were originally the shells and bones of living fishes and other animals bred in the sea\". Raven commented that this was \"The fullest and most enlightened treatment by an Englishman\" of that time.p426 **1713 Three Physico-theological discourses. This is the 3rd edition of Miscellaneous discourses, the last by Ray before his death, and delayed in publication. Its main importance is that Ray recanted his former acceptance of fossils, apparently because he was theologically troubled by the implications of extinction.Bowler P.J. 2003. Evolution: the history of an idea. 3rd ed, California.p37 Robert Hooke, like Nicolas Steno, was in no doubt about the biological origin of fossils. Hooke made the point that some fossils were no longer living, for example Ammonites: this was the source of Ray's concern.Hooke, Robert 1705. The posthumous works of Robert Hooke. London. repr. 1969 Johnson N.Y.p327 *1693: Synopsis of animals and reptiles. *1693: Collection of travels. *1694: Collection of European plants. *1695: Plants of each county (Camden's Brittania). *1696: Brief dissertation. *1700: A persuasive to a holy life. *1705. Method and history of insects. (Post-mortem and unedited) *1713: Synopsis of birds and fishes. === Libraries holding Ray's works === Including the various editions, there are 172 works of Ray, of which most are rare. The only libraries with substantial holdings are all in England.p153 The list in order of holdings is: :The British Library, Euston, London. Holds over 80 of the editions. :The Bodleian Library, University of Oxford. :The University of Cambridge Library. :Trinity College Library, University of Cambridge. :The Natural History Museum Library, South Kensington, London. == References == Category:1627 births Category:1705 deaths Category:English naturalists Category:English botanists Category:English science writers",
 "title": "John Ray"
}