{
 "id": "199822",
 "text": "Theodosius Grygorovych Dobzhansky (; ; January 25, 1900 – December 18, 1975) was a noted geneticist and an evolutionary biologist. Dobzhansky was born in Ukraine (then part of Imperial Russia) and emigrated to the United States in 1927. He was a central figure in the field of evolutionary biology for his work on the fruit-fly Drosophila. He did research on these flies in California, mostly on populations of Drosophila pseudoobscura. Dobzhansky was important in the modern evolutionary synthesis, which was the synthesis of evolutionary biology with genetics. == Ukraine and Russia == At school Dobzhansky collected butterflies and beetles, and studied biology at Kiev University. After graduation he moved to St Petersburg (then called Leningrad), and studied under Yuri Filipchenko, who had a Drosophila lab. Dobzhansky collected Coccinellidae (ladybird beetles) in the wild, and explored their genetics. == America == Dobzhansky emigrated to the United States in 1927. He worked with Thomas Hunt Morgan at Columbia University, who had pioneered the use of fruit flies (Drosophila melanogaster) in genetics experiments. He followed Morgan to the California Institute of Technology from 1930 to 1940. Dobzhansky took fruit fly research out of the laboratory and into the field. He discovered that regional varieties of flies were more similar to each other genetically than to flies from other regions. In 1937 Dobzhansky published one of the major works of the modern evolutionary synthesis, entitled Genetics and the Origin of Species.Dobzhansky T. Genetics and the Origin of Species. Columbia, N.Y. First ed 1937; second ed 1941; 3rd ed 1951. He defined evolution as \"a change in the allele frequency within a gene pool\". It is through changes in the proportion of alleles in a population that evolution takes place. Also in 1937, he became a naturalized citizen of the United States. During this time he had a falling out with one of his Drosophila collaborators, Alfred Sturtevant, based perhaps on professional competition. Dobzhansky returned to Columbia University from 1940 to 1962. He was one of the signatories of the 1950 UNESCO statement The Race Question. He then moved to the Rockefeller University) until his retirement in 1971. == Other key publications == * Nothing in biology makes sense except in the light of evolution The American Biology Teacher 35: (March): 125-129. * Genetics of the evolutionary process. Columbia University Press, New York 1970. * Dobzhansky's Genetics of Natural Populations I-XLIII. R.C. Lewontin, J.A. Moore, W.B. Provine & B. Wallace, eds. Columbia University Press, New York 1981. (reprints the 43 papers in this series, all but two of which were authored or co-authored by Dobzhansky) == References == Category:1900 births Category:1975 deaths Category:American evolutionary biologists Category:American zoologists Category:Ukrainian scientists Category:American geneticists Category:Naturalized citizens of the United States Category:Rockefeller University faculty Category:Columbia University faculty Category:California Institute of Technology faculty",
 "title": "Theodosius Dobzhansky"
}