{
 "id": "199951",
 "text": "A mycorrhiza (Greek for fungus roots) is a symbiotic association between a fungus and the roots of a plant.Kirk P.M. et al 2001. Ainsworth and Bisby’s dictionary of the fungi. 9th ed. CAB, Wallingford UK. In a mycorrhiza, the fungus lives inside the plant roots, and in the earth. The fungal hyphae are more efficient than plant roots at absorbing nutrients. Mycorrhizas are important for plant growth in many ecosystems. At least 80% of all land plant species (and over 90% of families) have mycorrhiza.Wang B. and Qiu Y-L 2006. Phylogenetic distribution and evolution of mycorrhizas in land plants. Mycorrhiza 16: 299-363. They depend on it for survival.Trappe J.M. 1987. Phylogenetic and ecologic aspects of mycotrophy in the angiosperms from an evolutionary standpoint. In Safir G.R. (ed) Ecophysiology of VA mycorrhizal plants CRC Press, Florida They are the most common symbionts in the plant kingdom: they involve about 6000 species of fungi and 240,000 species of plants. Mycorrhizas are divided onto two main types: ectomycorrhiza and endomycorrhiza. The hyphae of ectomycorrhizal fungi do not penetrate individual cells within the root, while the hyphae of endomycorrhizal fungi penetrate the cell wall and invaginatepush into, but do not penetrate. the cell membrane. The mycorrhizal symbiosis is ancient, dating to at least 400 million years ago. Wood Wide Web is a term used for mycorrhizal networks in forests. == How it works == This mutualism gives the fungus sugars, such as glucose and sucrose produced by the plant in photosynthesis. The carbohydrates move from their source (usually leaves) to the root and then to the fungal partner. In return, the plant gains the use of the mycelium's very large surface area to absorb water and mineral nutrients from the soil, especially phosphorus. The mechanisms of increased absorption are both physical and chemical. Mycorrhizal mycelia are much smaller in diameter than the smallest root. They can explore a greater volume of soil, providing a larger surface area for absorption: \"It is estimated that every kilogram of soil contains at least 200 km of fungi strands\".S. Bonneville et al. 2009. Plant-driven fungal weathering: early stages of mineral alteration at the nanometer scale. Geology 37, 615-618 == Advantages == Mycorrhizal plants are often more resistant to diseases, such as those caused by microbial soil-borne pathogens, and are also more resistant to the effects of drought. These effects are perhaps due to the improved water and mineral uptake in mycorrhizal plants. Mycorrhiza is especially advantageous to the plant in nutrient-poor soils. Plants grown in sterile soils and growth media often perform poorly without the addition of spores or hyphae of mycorrhizal fungi to colonise the plant roots and aid in the uptake of soil mineral nutrients.Root fungi turn rock into soil Planet Earth Online 3 July 2009 The absence of mycorrhizal fungi can also slow plant growth in harsh areas. The fungal partners may also help plant-to-plant transfer of sugars and other nutrients. Such mycorrhizal communities are called common mycorrhizal networks.Kennedy, Peter 2005. Common mycorrhizal networks. Some species live inside the tissues of roots, stems, and leaves, in which case they are called endophytes. Similar to mycorrhiza, endophytic colonization by fungi may benefit both partners.Endophyte: here, a more general term for fungi living in plants. Endophytes of grasses give their host more resistance to grazers and get food and shelter from the plant in return. == Bacteria in mycorrhiza == Mycorrhizal roots offer excellent ecological niches for other microbes. Mycorrhizal fungi may host bacteria that complete their life cycles within fungal cells. One of the best known is Geosiphon pyriforme, which can host cyanobacteria inside characteristic bladders.Schüssler A. & Kluge M. 2001. Geosiphon pyriforme, an endocytosymbiosis between fungus and cyanobacteria, and its meaning as a model system for arbuscular mycorrhizal research. In Hock B. (ed) Mycota IX: Fungal Associations. Springer, Berlin. 151–161 Arbuscular mycorrhiza (AM) fungi are unique in hosting bacteria in their cytoplasm. Intracellular structures very similar to bacteria were first described in the 1970s. Research later identified them as true bacteria.Bianciotto V. et al. 1996. An obligately endosymbiotic fungus itself harbors obligately intracellular bacteria. Appl. Environ. Microbiol. 62, 3005–3010. == References == Category:Fungi Category:Plants Category:Botany Category:Symbiosis",
 "title": "Mycorrhiza"
}