{
 "id": "200271",
 "text": "The Croatian Wikipedia is the Croatian language edition of Wikipedia. This edition was introduced in February 2003. As of October 2015, it was the 41st largest edition of Wikipedia by number of articles.Wikimedia list of Wikipedias and their statistics.. Retrieved 25 October 2015. ==Far-right takeover scandal== ===2009–21=== In September 2013, complaints of far-right bias on the Croatian Wikipedia began to capture the spotlight when the Facebook page Razotkrivanje sramotne hr.wikipedije (\"Exposing the disgraceful Croatian Wikipedia\") revealed the issues. As per Jurica Pavičić, a professor at the University of Split, far-right administrators were found to have blocked dozens of rule-abiding users since 2009 for removing false content related to Croatia's politics and WWII history. * * * Meanwhile, Robert Kurelić, a history professor at the Juraj Dobrila University of Pula, commented that the Croatian Wikipedia Notably, the war crimes of the pro-Nazi Ustaše-ruled Independent State of Croatia (NDH) were censored by the far-right administrators. Željko Jovanović, the Minister of Science of Croatia back then, also advised against the use of the Croatian Wikipedia. The most serious violation by the far-right administrators was their anti-historical designation of the Jasenovac concentration camp, in which 77,000–99,000 were killed, * * * * * as a \"collection camp\". These were condemned by scholars, officials, advocacy groups and media critics as antisemitic IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. Holocaust denial. * * * * * * * * * * ===2021=== Following a year-long investigation by the Wikimedia Foundation, several complicit editors and administrators were either banned or demoted, with one of the administrators found to have consolidated his or her power with 80 sockpuppet accounts. Meanwhile, the incident yet again showed the systemic issues of Wikipedia which have left it vulnerable to organized disinformation. Many critics claimed that it was unacceptable for the matter to have taken over 10 years to be resolved. To this day, the Wikimedia Foundation is still criticized for its passivity towards organized disinformation. ===2023=== In the 57-page article Wikipedia’s Intentional Distortion of the History of the Holocaust published in The Journal of Holocaust Research, Prof. Jan Grabowski and Dr. Shira Klein remarked, ==Current status== As of July 2024, around 135 editors were reportedly making 5+ edits per month. ==Related pages== * Ante Pavelić * Antiziganism * Antisemitism in Europe == References == Category:Wikipedias Category:Websites established in 2003",
 "title": "Croatian Wikipedia"
}