{
 "id": "200339",
 "text": "was a Japanese football player. He played for the Japan national team. ==Biography== Miyamoto was born in Hiroshima on December 26, 1940. After graduating from Sanyo High School, he joined Yawata Steel (later Nippon Steel) in 1959. The club won 1964 Emperor's Cup. In 1965, Yawata Steel joined new league Japan Soccer League. In 1967, he was selected \"Japanese Footballer of the Year\" awards. He retired in 1976. He played 138 games and scored 68 goals in the league. He was selected Best Eleven for 6 years in a row (1966-1971). In June 1961, Miyamoto was selected the Japan national team for 1962 World Cup qualification. At this qualification, on June 11, he debuted against South Korea. He was selected Japan for 1964 Summer Olympics in Tokyo and 1968 Summer Olympics in Mexico City. He played all matches at both Olympics and Japan won the bronze medal 1968 Olympics. In 2018, 1968 Olympics team was selected Japan Football Hall of Fame. He also played at 1962, 1966 and 1970 Asian Games. At 1972 Summer Olympics qualification in 1971, Japan's failure to qualify for 1972 Summer Olympics. This qualification was his last game for Japan. He played 58 games and scored 19 goals for Japan until 1971. In 1976, when Miyamoto played for Nippon Steel, he became a playing manager. He managed until 1979. On February 2, 2000, Miyamoto died of heart failure in Kitakyushu at the age of 59. In 2006, he was selected Japan Football Hall of Fame. ==Statistics== Japan National Football Team Database |- |1961||5||3 |- |1962||7||1 |- |1963||5||2 |- |1964||2||0 |- |1965||4||1 |- |1966||5||3 |- |1967||5||5 |- |1968||4||0 |- |1969||3||2 |- |1970||12||1 |- |1971||6||1 |- !Total||58||19 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1968 Olympics) at Japan Football Association Category:1940 births Category:2000 deaths Category:Footballers from Hiroshima Prefecture Category:Japan international footballers Category:Japan Soccer League players Category:Nippon Steel Yawata SC players Category:Footballers at the 1964 Summer Olympics Category:Footballers at the 1968 Summer Olympics Category:Olympic medalists in football Category:Olympic bronze medalists for Japan Category:Medalists at the 1968 Summer Olympics",
 "title": "Teruki Miyamoto"
}