{
 "id": "200598",
 "text": "Yaw Preko (born 8 September 1974) is a former Ghanaian football player. He has played for Ghana national team. ==Club career== Preko is a member of the Hearts of Oak club from his hometown, Accra . He made his debut in this team in 1991 in the Ghanaian league , but he played there only for a season and in 1992 he became a player of RSC Anderlecht , where he joined the national team, Nii Lamptey and Isaac Asare . Preko made his debut in the Eerste Klasse in the 1992/1993 season. He played 5 matches then, and had a small part in Anderlecht winning the Belgian championship. He also played little in the 1993/1994 season and was only a reserve for the goal-scoring pair of forwards John Bosman - Luc Nilis , who were the main authors of another national championship. In the summer of 1994, Nilis left for PSV Eindhoven and Preko became a player in the first eleven. He scored 9 goals in the league and also played in the Champions League. At the end of the season, Anderlecht won their third consecutive championship. In 1995, Yaw's friend from his time at Hearts, Samuel Johnson, came to the Brussels club and both of them played in the capital club for two more seasons, but did not achieve much success. In 1997, Preko moved to Turkey and joined Gaziantepspor . The team finished 15th, remaining in the Turkish Premier League, and after the season, Johnson joined Yaw. In the 1998/1999 season, both were among the best players of the team that finished the season in 7th place, and their performance did not go unnoticed by Fenerbahçe SK coach, Zdenek Zeman, who brought both players to Istanbul. Preko, although he played in the starting eleven, turned out to be less effective than his rivals, Elvir Bolić and Viorel Moldovan, so after the season he unexpectedly left for Yozgatspor. In 2001, he finished 7th with this club, and his team included his compatriots Kwame Ayew and Joachim Yaw Acheampong. In 2002, he returned to Gaziantepspor, with whom he took 4th place twice and played with Johnson again, but due to chronic injuries he played in only 12 matches. In the winter of 2004, Preko went to Sweden and became a player of Halmstads BK. That season he became the national vice-champion and played in attack with Markus Rosenberg. In 2005, his partner was the Icelander Gunnar Heiðar Þorvaldsson. In 2006, the Ghanaian left the club and joined the Saudi Al-Ittifaq from the city of Dammam, and in 2007 he was a player of the Vietnamese team Hoàng Anh Gia Lai, where he ended his career. ==International career== Preko made his debut for the Ghana national team in 1992. It was then that he was called up to the Olympic team of the \"Black Stars\" for the Olympic Games in Barcelona, where, alongside Kwame Ayew, Nii Lamptey, Samuel Kuffour and Mohammed Gargo, he was one of the stars of the team and contributed to Ghana winning the bronze medal. In the same year, he also played in the African Cup of Nations in Senegal and won the African runner-up title with Ghana. He played his last match for the national team in 2001. He played in a total of 25 matches and scored 5 goals. ==Statistics== ===Club career statistics=== |- |1992–93||rowspan=\"5\"|Anderlecht||rowspan=\"5\"|First Division||5||0 |- |1993–94||11||1 |- |1994–95||28||9 |- |1995–96||20||11 |- |1996–97||28||6 |- |1997–98||rowspan=\"2\"|Gaziantepspor||rowspan=\"2\"|First League||33||9 |- |1998–99||25||7 |- |1999–00||Fenerbahçe||First League||22||7 |- |2000–01||rowspan=\"2\"|Yimpaş Yozgatspor||First League||28||13 |- |2001–02||Süper Lig||27||8 |- |2002–03||rowspan=\"2\"|Gaziantepspor||rowspan=\"2\"|Süper Lig||4||1 |- |2003–04||8||0 |- |2004||rowspan=\"2\"|Halmstad||rowspan=\"2\"|Allsvenskan||26||7 |- |2005||23||4 92||27 147||45 49||11 288||83 |} ===International career statistics=== |- |1992||7||0 |- |1993||1||0 |- |1994||2||3 |- |1995||3||0 |- |1996||3||0 |- |1997||3||0 |- |1998||1||0 |- |1999||3||1 |- |2000||5||1 |- |2001||3||0 |- !Total||31||5 |} ==References== Category:1974 births Category:Living people Category:Ghanaian footballers",
 "title": "Yaw Preko"
}