{
 "id": "200681",
 "text": "Volgograd, formerly called Tsaritsyn (1589–1925) and Stalingrad (1925–1961) is an industrial city of great importance, and the administrative center of Volgograd Oblast, Russia. It is 80 km long, north to south, on the western bank of the Volga River and has a population of over 1.011 million people. The city was made famous for its heroic resistance and bloody siege during the Battle of Stalingrad taking place during World War II. == History == Volgograd developed from the fortress of Tsaritsyn in 1589. The fortress was at the meof the Tsaritsa and Volga Rivers. During the Russian Civil War the city was the scene of heavy fighting. Bolshevik forces occupied it during 1918, but were attacked by White forces. It was renamed as Stalingrad in 1925. Under Stalin, the city became heavily industrialized as a centre of heavy industry and trans-shipment by rail and river. During World War II, Stalingrad became the center of the Battle of Stalingrad as well as a turning point in the war against Germany. Essentially, the German offensive was stopped at Stalingrad. The Battle of Stalingrad lasted from August 21, 1942 to February 2, 1943, where 1.7 million to 2 million Axis and Soviet soldiers were killed, wounded or captured, in addition to over 40,000 civilians killed. The city was reduced to rubble during the fierce fighting, but reconstruction began soon after the Germans were expelled from the city. Nikita Khrushchev renamed the city because of de-Stalinization in 1961. == International relations == === Twin towns — Sister cities === As of 2008, Volgograd has 21 sister cities:Friendly relationship at Official website of Volgograd * Coventry, England, United Kingdom (1943) * Ostrava, Czech Republic (1948) * Kemi, Finland (1953) * Liège, Belgium (1959) * Dijon, France (1959) * Turin, Italy (1961) * Port Said, Egypt (1962) * Chennai, India (1966) * Hiroshima, Japan (1972) * Cologne, Germany (1988) * Chemnitz, Germany (1988) * Cleveland, Ohio, United States (1990) * Toronto, Canada (1991) * Jilin, China (1994) * Yerevan, Armenia (1998) * Chengdu, China (1998) * Kruševac, Serbia (1999) * Ruse, Bulgaria (2001) * Huntingdon, Pennsylvania, United States (2003) * Orlando, Florida, United States (2008) * Baku, Azerbaijan (2008) Executive power of Baku city A number of communities in France and Italy have streets or avenues named after Stalingrad, hence Place de Stalingrad in Paris and the Paris Métro station of Stalingrad. == Gallery == Image:Volgograd 44.67670E 48.66724N.jpg|Volgograd from Space Image:Volgograd districts all.svg| Map of Volgograd's City Districts Image:Volgograd leninsquare.jpg|Underground station of Volgograd metrotram — Lenin's Square Image:Volgograd Alleja Gerojev.jpg|Volgograd State Medical University (left) and New Experimental Theater of Volgograd == References == == Other websites == * Official website of Volgograd * Official website of Volgograd * Volgograd.ru — City Web Portal, Local Business and Web Directory, News, Press, Webcams, 3D Mamayev Kurgan * Over 2,000 original German WWII soldier photographs from the Eastern Front * Sights of Volgograd * Photo Gallery from Volgograd * Stalingrad - Bilder einer erbitterten Schlacht (German) Category:Capitals of oblasts of Russia Category:Volgograd",
 "title": "Volgograd"
}