{
 "id": "200749",
 "text": "Spike Lee (born March 20, 1957) is an American movie director, producer, screenwriter, and actor. He also teaches movie at New York University and Columbia University. Lee has acted in many of his own movies. ==Early life== Lee was born Shelton Jackson Lee in 1957 in Atlanta, Georgia. His mother was a teacher, and his father was a jazz musician.Spike Lee biography at filmreference.com When Lee was very young, the family moved to live in Brooklyn, New York City. His mother gave him the nickname \"Spike\". ==Career== The first movie Lee directed was She's Gotta Have It. Lee directed the two music videos for Michael Jackson's single \"They Don't Care About Us\". In 2002 Lee won the Special Award at the BAFTAs. Lee's movies Do the Right Thing, Malcolm X, 4 Little Girls, and She's Gotta Have It were picked by the Library of Congress to be remembered forever in the National Film Registry for being \"culturally, historically, or aesthetically significant\". ==Films== ===Acting roles=== Year Film Role 1986 She's Gotta Have It Mars Blackmon 1988 School Daze Half-Pint 1989 Do the Right Thing Mookie 1990 Mo' Better Blues Giant Lonely in America Himself 1991 Jungle Fever Cyrus 1992 Malcolm X Shorty 1994 Crooklyn Snuffy Drop Squad Himself 1995 Clockers Chucky 1996 Girl 6 Jimmy 1999 Summer of Sam John Jeffries 2000 Lisa Picard Is Famous Himself 2001 3 A.M. Filmmaker 2012 Red Hook Summer Mookie ==References== ==Other websites== * Category:1957 births Category:Living people Category:Actors from Atlanta Category:Actors from New York City Category:African-American actors Category:African-American movie directors Category:African-American movie producers Category:African-American screenwriters Category:American movie actors Category:American television directors Category:American television producers Category:Movie directors from Georgia (U.S. state) Category:Movie directors from New York City Category:Movie producers from New York City Category:Screenwriters from New York City Category:Writers from Georgia (U.S. state) Category:New York University faculty",
 "title": "Spike Lee"
}