{
 "id": "201245",
 "text": "Li Lianjie (Chinese: 李連杰; born April 26, 1983), better known by his stage name Jet Li, is a Chinese-born Singaporean martial artist, actor, and philanthropist best known for his martial arts and action films. He is widely regarded as one of the most iconic Chinese film stars, one of the most renowned martial arts stars of his generation, and one of the greatest martial arts stars in the history of cinema. == Early life and martial arts career == Li began practising Wushu at the age of eight. Between 1974 and 1979, he won the title of Men's All-Around National Wushu Champion five times. Li is a master of several styles of Wushu, especially Chángquán (Northern Longfist Style) and Fānziquán (Tumbling Fist). He has mastered Wushu's main weapons, such as the Sanjiegun (Three Section Staff), Gùn, Dao (Broadsword), and Jian (Straight Sword). He has also studied other arts including Baguazhang (Eight Trigram Palm), Taijiquan (Supreme Ultimate Fist), Xing Yi Quan (Shape Intent Fist), Zui Quan (Drunken Fist), Ying Zhao Quan (Eagle Claw Fist) and Tanglangquan (Praying Mantis Fist). == Film career == After retiring from competitive Wushu at age 18, Li went on to win great acclaim as an actor. He made his debut with the Chinese-Hong Kong martial arts film Shaolin Temple (1982), which instantly catapulted him to stardom in East Asia. Though continued success followed after two sequels (Kids From Shaolin) and (Martial Arts of Shaolin), Li had a major breakthrough across Asia with the Tsui Hark- produced Once Upon a Time in China film series (1991–1993), where he portrayed Chinese folk hero Wong Fei-hung. He starred in his directorial debut film Born to Defence (1986), which saw Li, for the first time, playing a character in a period setting. Many of his 1990s martial arts films are regarded as classics of the genre, particularly Swordsman II (1992), Fong Sai-yuk (1993), and Fist of Legend (1994). Before transitioning to Hollywood in the late 1990s, Li reinvented himself from a period kung fu movie star to a modern action hero, appearing in several contemporary Hong Kong action films which fused guns and kung fu (Gun fu), most notably High Risk (1995), Black Mask (1996), and Hitman (1998). Li made his Hollywood debut as a villain in the 1998 buddy cop action film Lethal Weapon 4. His first leading role in a Hollywood film was as Han Sing in Romeo Must Die (2000). He went on to star in many international action films, including in French cinema with the Luc Besson-produced films Kiss of the Dragon (2001) and Unleashed (2005). He continued to be active in Chinese and Hong Kong cinema, appearing in the critically acclaimed film Hero (2002), Fearless (2006), which marked his final wushu martial arts film, and The Warlords (2007). For the latter, he became the highest paid actor in a Chinese-language movie, previously holding the record for his part in Hero. In 2008, he portrayed the title character villain in The Mummy: Tomb of the Dragon Emperor and starred in The Forbidden Kingdom, which marked his first collaboration with fellow martial arts star Jackie Chan.http://www.china.org.cn/entertainment/2008-03/19/content_13081465.htm From 2010 to 2014, he appeared in the first three films in the ensemble action film series The Expendables. == Philanthropy == After a long movie career, in 2007 Li turned to philanthropy. He founded the One Foundation, an independent fundraising foundation in mainland China which mainly focuses on natural disaster relief, environmental protection, medical treatment, education and poverty problems. Since the start of the foundation, Li has been involved with recovery efforts in seven disasters, including the 2008 Sichuan earthquake, the 2008 Typhoon Morakot in Taiwan, and the 2013 Lushan earthquake in Ya’an, Sichuan. Li also subsequently founded Taiji Zen, an online health and wellness program providing instruction in meditation and Tai chi. ==Influence and cultural impact== Li is regarded as one of the most iconic Chinese film stars, one of the most renowned martial arts stars of his generation, and one of the greatest martial arts stars in the history of cinema. Li appeared on the cover of Time in both 2002, in which he appeared on the cover as a superstar in Hero, and 2008, in which he appeared on the cover as the founder of his charity, One Foundation. In 2010, Li was named by Time as one of the 100 Most Influential People. Li's movie career in China is credited with revitalising the Shaolin Temple (Shaolin Monastery) in Dengfeng, as the popular 1982 film Shaolin Temple is considered to be the film which sparked its rebirth. The film also spawned a revival of popularity in mainstream martial arts in China. Li is also credited with reviving wushu in Hong Kong martial arts films during the 1990s. Li is also noted for his contribution to making new wuxia films popular internationally during his career. Li’s career has crossed numerous cultural and geographic boundaries outside mainland China and Hong Kong, such as Hollywood and France. Many martial artists and filmmakers have cited Li as an inspiration, such as Tony Jaa, Robin Shou, Mark Dacascos, Yayan Ruhian, Iko Uwais, Chad Stahelski, Daniel Wu, Jason Scott Lee, Jaden He Jingde, Lester Pimentel, Janice Hung, Cung Le, Zara Phythian, Silvio Simac, Kevin Lee, Gareth Evans, Israel Adesanya, Michael Page, Aung La Nsang, Rahul Raju, Song Yadong, Giga Chikadze, Ricky Turcios, Enkh-Orgil Baatarkhuu, John Albert, Cody Hackman, and Brandon Kahn. Li has also been listed as an influence on the John Wick series, the fictional video game character Johnny Gat, and Turnstile's Glow On.https://volition.tumblr.com/post/99916966762/interview-with-doug- nelson-senior-designer-on == Personal life == Li stands at a height of 5 ft 6 in. He weighs 145 lbs. == Filmography == Year Title Chinese Title Role Notes 1982 Shaolin Temple \"Jueh Yuan\" 1983 Kids From Shaolin \"San Lung\" 1986 Born to Defence \"Jet\" Director Jet Li's directorial debut Martial Arts of Shaolin \"Zhi Ming\" aka Shaolin Temple 3: Martial Arts of Shaolin 1988 Dragon Fight \"Jimmy Lee\" 1989 The Master \"Jet\" 1991 Once Upon a Time in China \"Wong Fei Hung\" Swordsman II \"Ling Wu Chung\" 1992 Once Upon a Time in China II \"Wong Fei Hung\" 1993 Tai Chi Master \"Zhang Sanfeng\" Producer aka Twin Warriors (USA) Fong Sai Yuk \"Fong Sai Yuk\" Producer aka The Legend Fong Sai Yuk II \"Fong Sai Yuk\" Producer aka The Legend 2 Kung Fu Cult Master \"Cheung Mo-Kei\" Producer aka The Evil Cult aka Lord of the Wu Tang aka Kung Fu Master Last Hero in China \"Wong Fei Hung\" Producer aka Claws of Steel aka Deadly China Hero Once Upon a Time in China III \"Wong Fei Hung\" aka The Invincible Shaolin 1994 The Bodyguard from Beijing \"Allan Hui Ching Yeung\" / \"John Chang\" Producer aka The Defender aka Zhong Nan Hai bao biao Fist of Legend \"Chen Jun\" Producer The New Legend of Shaolin \"Hung Hei-Kwun\" Producer aka Legend of the Red Dragon 1995 High Risk \"Kit Li\" aka Meltdown My Father Is a Hero \"\"Kung Wei\" aka The Enforcer aka Letter To Daddy 1996 Black Mask \"Michael\" / \"Simon\" / \"Tsui Chik\" / \"Black Mask\" released 1999 in US Dr. Wai in \"The Scripture with No Words\" \"Chow Si Kit\" aka Adventure King aka The Scripture With No Words 1997 Once Upon a Time in China and America \"Wong Fei Hung\" aka Once Upon A Time In China VI 1998 Hitman \"Fu\" aka The Hitman aka The Contract Killer Lethal Weapon 4 \"Wah Sing Ku\" 2000 Romeo Must Die \"Han Sing\" 2001 The One \"Gabe Law\" / \"Gabriel Yulaw\" / \"Lawless\" Kiss of the Dragon \"Liu Jian\" Associate Producer 2002 Hero \"Nameless\" Released 2004 in US 2003 Cradle 2 the Grave \"Su\" 2005 Unleashed \"Danny\" Producer aka Danny the Dog 2006 Fearless \"Huo Yuanjia\" Producer Presenter 2007 The Warlords \"Pang Qing Yun\" War \"Rogue\" aka \"Victor Shaw\" aka Rogue Assassin or Rogue 2008 The Forbidden Kingdom \"Sun Wukong the Monkey King\" / \"Silent Monk\" The Mummy: Tomb of the Dragon Emperor \"Emperor Han\" 2009 The Founding of a Republic \"Chen Shaokuan\" aka Jian Guo Da Ye (lit. The Great Cause of China's Foundation) aka Founding of the Nation aka Lofty Ambitions of Nation Building 2010 Ocean Heaven \"Sam Wong\" The Expendables \"Yin Yang\" 2011 The Sorcerer and the White Snake \"Reverend Fahai\" 2011 Flying Swords of Dragon Gate \"Chow Wai-On\" 2012 The Expendables 2 \"Yin Yang\" 2013 Badges of Fury (The One Detective) Huang Feihong 2014 The Expendables 3 \"Yin Yang\" 2016 League of Gods \"Jiang Ziya\" 2017 Gong Shou Dao Old Servant Also producer 2020 Mulan The emperor of China ==References== == Other websites == * Category:1983 births Category:Chinese martial artists Category:Chinese movie actors Category:Chinese television actors Category:Chinese voice actors Category:Living people Category:People who lost Chinese citizenship",
 "title": "Jet Li"
}