{
 "id": "201463",
 "text": "Mullah Muhammad Umar (1959 - 23 April 2013) was the founder of the Taliban in Afghanistan. He was usually called Mullah Omar. He came from a religious family of Islamic scholars near Kandahar. After Afghanistan was invaded by the Soviet Union in 1979, he joined the Afghan mujahideen to fight in the Soviet–Afghan War. He served as an important military general during several skirmishes, losing his right eye in an explosion. Between 1996 and 2001, he was Afghanistan's de facto head of state. Three states officially recognised him under the title of 'Head of the Supreme Council'. He was born in 1959 in Kandahar Province of Afghanistan.Rashid, Taliban, (2001) p.23 He held the title Commander of the Faithful from the Islamic Emirate of Afghanistan. The United States put him on their most wanted list. They believe he sheltered Osama bin Laden, and some of his al-Qaeda group, directly before and after they committed the September 11 attacks. He was believed to be directing the Taliban in their war against Hamid Karzai's Government and foreign NATO troops in Afghanistan.CNN.com - Source: Mullah Omar in Pakistan - Sep 9, 2006 Many people considered him to be a major terrorist. Despite his political rank, and his high status on the FBI's wanted list, not much was publicly known about Omar. There are very few photos of him. A picture that was used by the media in 2002, shows another Taliban official, but not Omar. It is also debated how authoritative the images that exist really are.Who is the real Mullah Omar? Daily Telegraph, 22 December 2001 Omar's right eye was missing as the result of a war wound. People described him as being tall.Griffiths, John, C. \"Afghanistan: A History of Conflict\", 1981. Second Revision 2001.Christian Science Monitor, The reclusive ruler who runs the Taliban He was described as shy and untalkative with foreigners.Afghanistan: Taliban Preps for Bloody Assault, Newsweek, 5 March 2007 When he was Emir of Afghanistan, Omar stayed in Kandahar most of the time and rarely met outsiders. He sent his Foreign Minister, Wakil Ahmed Muttawakil, to represent him, on most occasions. News media claimed that he was killed by a drone strike in 2008.'US strike' kills Taleban leader. BBC News In 2012, it was revealed that an individual claiming to be Omar sent a letter to President Barack Obama in 2011, expressing slight interest in peace talks. ==Death== On 29 July 2015, the Afghan government and state intelligence sources said that Omar had died in April 2013 two years previously in Karachi, Pakistan, of tuberculosis. Some Taliban sources denied that he had died; other sources considered the report to be speculative, designed to destabilise peace negotiations in Pakistan between the Afghan government and the Taliban. A Taliban spokesman said that they would issue a statement. Abdul Hassib Seddiqi, the spokesman for Afghanistan's National Directorate of Security, claimed: \"We confirm officially that he is dead\". It was later learned that he died in Afghanistan, not Pakistan. == References == * Category:1959 births Category:2013 deaths Category:Deaths from tuberculosis Category:Pashtun people Category:Taliban Category:Heads of the Islamic Emirate of Afghanistan Category:Former dictators Category:Kandahar Province Category:21st-century Afghan people Category:20th-century Afghan people",
 "title": "Mullah Omar"
}