{
 "id": "201852",
 "text": "Jefferson Beauregard \"Jeff\" Sessions III (born December 24, 1946) is an American politician and attorney. He was the 84th United States Attorney General serving from February 9, 2017 to November 7, 2018. Before being Attorney General, he was the junior United States Senator from Alabama. He is a member of the Republican Party. At the time of his senate career, he ranked 15th in seniority in the United States Senate. He was the most senior junior Senator upon the retirement of Barbara Boxer in January 2017 to February 2017. In November 2019, Sessions announced that he would run for his old Senate seat in 2020. He lost the Republican nomination to Tommy Tuberville. ==Early life== Sessions was born in Selma, Alabama on December 24, 1946. He was the son of Jefferson Beauregard Sessions, Jr., and the former Abbie Powe. He was raised in Camden, Alabama. Sessions earned B.A. Degree from Huntingdon College and a J.D. Degree from the University of Alabama. ==Early career== From 1981 to 1993, he was U.S. Attorney for the Southern District of Alabama. Sessions was elected Attorney General of Alabama in 1994. ==United States senator (1997-2017)== Sessions was elected to the U.S. Senate in 1996 and re-elected in 2002, 2008, and 2014. Sessions was considered one of the most conservative members of the U.S. Senate. As a senator, he is known for being against illegal immigration and for reducing legal immigration. He supported the major legislative efforts of the George W. Bush administration, including the 2001 and 2003 tax cut packages, the Iraq War, and a proposed national amendment to ban same-sex marriage. He opposed the establishment of the Troubled Asset Relief Program, the 2009 stimulus bill, the Patient Protection and Affordable Care Act, and the Don't Ask, Don't Tell Repeal Act. As the ranking Republican on the Senate Judiciary Committee, he opposed all three of President Barack Obama's nominees for the Supreme Court. An early supporter of Donald Trump's 2016 presidential campaign, Sessions was considered as a possible Vice Presidential nominee, but Trump finally chose Indiana governor Mike Pence. Sessions resigned from the senate to become the United States Attorney General on February 8, 2017. ==United States Attorney General (2017-2018)== On November 18, 2016, it was announced that President-elect Donald Trump planned to nominate Sessions for United States Attorney General. On January 10, 2017, the Senate Judiciary Committee hearings on his nomination began. The committee approved his nomination February 1 on a straight party-line vote, 11 to 9. The senate narrowly confirmed his nomination on February 8, 2017. He was sworn-in by Vice President Mike Pence on February 9. On May 7, 2018 he announced a new morally questionable policy that separated children from their mothers at the border. As U.S. Attorney General, Sessions overturned a memo delivered by Eric Holder to reduce mass incarceration by avoiding mandatory sentencing, and ordered federal prosecutors to begin seeking the maximum criminal charges possible. Sessions allowed law enforcement to seize the property of those suspected but not charged with crimes. A critic of illegal immigration, Sessions adopted a hard-line on so-called sanctuary cities and told reporters that cities that did not follow federal immigration policy would lose federal funding, but failed. As Attorney General, Sessions supported allowing the Department of Justice to prosecute providers of medical marijuana.. On November 7, 2018, President Trump fired Sessions as Attorney General in a tweet.Donald J. Trump on Twitter ==2020 United States Senate race== In October 2019, Sessions began exploring a potential candidacy for his old Senate seat in the 2020 election. He announced his Senate run on November 7, 2019. Sessions lost the Alabama Senate Primary to Tommy Tuberville on July 14, 2020. A Washington Post headline read, \"Sessions loses runoff in Alabama as Trump helps end career of key supporter he came to despise.\" ==Personal life== Sessions and his wife Mary have three children and six grandchildren. The family is United Methodist. He teaches at Sunday School to children in Mobile, Alabama. ==References== ==Other websites== * Senator Jeff Sessions official U.S. Senate site * Jeff Sessions for Senate * * * Collected news and commentary from Politico Category:1946 births Category:Living people Category:United States Attorneys General Category:People from Selma, Alabama Category:Republican Party (United States) politicians Category:United States senators from Alabama Category:Lawyers from Alabama",
 "title": "Jeff Sessions"
}