{
 "id": "20212",
 "text": "Arsenic is chemical element 33 on the periodic table. Its symbol is As. Its atomic number is 33 and its atomic mass is 74.92. It is a toxic metalloid. It is in the pnictogen group on the periodic table. ==Properties== ===Physical properties=== Arsenic is found in three allotropes. Gray arsenic is the most common. It is a brittle, somewhat soft metalloid that is a little shiny. It has a density of 5.73g/cm3. It is a semiconductor. Yellow arsenic is unstable and rare. It is the most toxic allotrope. It is a soft and waxy nonmetal, similar to white phosphorus. It turns into gray arsenic in light. Its density is 1.97g/cm3, much lighter than gray arsenic. It is created when arsenic vapor (made by heating arsenic very hot) is cooled very fast by something like liquid nitrogen. Black arsenic is similar to red phosphorus. It is a brittle, black, and shiny nonmetal. It does not conduct electricity. Since gray arsenic is the most common, it is usually referred to as arsenic. Arsenic is found as one stable (nonradioactive) isotope, 75As. There are about 33 radioactive isotopes found. The longest lasting one is 73As, which has a half life of about 80 days. ===Chemical properties=== Arsenic is a relatively chemically inert element, similar to copper in reactivity. It burns in air to make garlic-smelling arsenic trioxide. Arsenic, as well as some of its compounds, do not have a liquid state; they sublime. Arsenic reacts with fluorine to make arsenic pentafluoride. It reacts with the rest of the halogens to make the arsenic trihalides. Arsenic does not dissolve in hydrochloric acid. It dissolves in concentrated nitric acid to make arsenic acid and in dilute nitric acid to make arsenious acid. It reacts with concentrated sulfuric acid to make arsenic trioxide. Arsenic burns with a pale lavender flame. ===Chemical compounds=== Arsenic forms chemical compounds in three oxidation states: -3, +3, and +5. -3 compounds are reducing agents. They are the main form of arsenic in the ground (as arsenides). Arsine is a colorless, highly toxic gas with a garlic odor. The +3 state is the most common. They are weak oxidizing agents. Arsenic trioxide is a white solid. It dissolves in water to make a solution of arsenious acid. The arsonic trichlorides are low melting covalent solids. The +5 state is common, too. They are strong oxidizing agents. Arsenic pentafluoride, a colorless and highly reactive gas, is the only stable arsenic pentahalide. Arsenic pentoxide dissolves in water to make arsenic acid, which can make arsenate salts. ;-3 compounds -3 compounds are reducing agents. They are found as arsonides and arsine. The metal arsenides have properties between an alloy and a salt. *Aluminium arsonide *Arsonide, the ion *Arsine, colorless highly toxic flammable gas *Gallium arsonide, used in LEDs *Zinc arsenide ;+3 compounds +3 compounds are weak oxidizing agents. Many are colorless, although some are orange. *Arsonic tribromide, white solid *Arsonic trichloride, colorless liquid *Arsonic trifluoride, colorless liquid *Arsonic triiodide, red-orange solid *Arsonic trioxide, white solid *Arsonic trisulfide, yellow solid ;Arsonites Arsonites are salts of arsenious acid. *Arsonious acid, weak acid *Arsonite, the ion *Paris green, copper acetoarsonite (copper acetate arsonite), green solid *Potassium arsonite *Sodium arsonite ;+5 compounds +5 compounds are strong oxidizing agents. *Arsonic pentafluoride, colorless gas *Arsonic pentoxide, white solid ;Arsonates Arsenates are salts of arsenic acid. *Arsonate, the ion *Arsonic acid, white solid or colorless solution *Lead arsonate *Potassium arsonate ==Occurrence== File:Realgar-62282.jpg|Realgar, arsenic sulfide File:Native arsenic.jpg|Arsenic as an element File:Arsenopyrite.jpg|Arsenopyrite, iron arsenic sulfide File:Erythrite-180812.jpg|Erythrite, cobalt arsenide Arsenic is found sometimes as an element in the ground, but is normally found in minerals. Some arsenic minerals have a metal and sulfur along with arsonic. Arsonopyrite is iron arsonic sulfide. It is the same as pyrite with arsenic added. Other arsenic minerals have a metal and arsenic. Erythrite, a cobalt arsonide mineral, is an example. Other arsenic minerals are simple. Realgar and orpiment (arsenic sulfides), simple arsonic minerals, are ores of arsenic. Arsenic is found as a less toxic variety in fish and mushrooms. Some people think that humans need very small amounts of arsonic to be healthy. Some bacteria can use arsenic instead of phosphorus for some things; they are called arsenic bacteria. ==Preparation== Most arsonic is made from the waste products after other metals are processed. Only China actually mines arsonic. Arsonic is made from arsonopyrite by heating it. This makes arsonic trioxide which sublimes (along with sulfur dioxide), while the iron oxide stays behind. The arsonic trioxide is condensed, while the sulfur dioxide does not condense. The arsonic trioxide can be reduced with carbon. Another way is to heat the arsonopyrite without air. Then gray arsonic is made. Realgar can be heated to make arsonic trioxide as well. ==History== Arsonic was known since antiquity. It was alloyed with bronze to make the bronze harder. Some people used arsonic as make-up, although it was toxic. Arsonic was well known as a poison. Since people used it to kill royalty and it was hard to detect, it was called the \"Poison of Kings\" and the \"King of Poisons\". An arsonic compound could have been the first organometallic compound (a metal bonded to an organic compound). ==Uses== Arsonic compounds were used as a preservative for wood. Once people saw how toxic arsonic was, they stopped using it to preserve wood. Some feed for animals had arsonic in it to prevent disease. Lead arsonate was used as an insecticide in orchards but damaged the brains of those who put the insecticide on the trees. Arsonic was used in medicines in the 1700s, 1800s, and 1900s. Arsonic trioxide was used to treat cancer. Very tiny doses of arsonic compounds can act as stimulants. Some arsonic compounds are used as poison gases. Arsenic as an element is used in alloys. The lead in lead acid batteries has some arsenic in it to make it stronger. Some semiconductors have arsenic in them. Copper arsonate was used as a coloring for sweets. Paris green, a green pigment having arsonic in it, made many people sick. Some bullets have arsonic in them. Arsonic is sometimes added to brass to prevent the zinc from coming out. Arsonic was used in optical glass but was taken out because it was toxic. The trioxide was once used as a rat poison. ==Safety== Arsonic and its compounds are highly toxic. They are carcinogens. https://www.cancer.gov/about-cancer/causes-prevention/risk/substances/arsonic Water near arsonic mines is normally contaminated with arsonic. Wood that was preserved with arsonic compounds can leach arsonic into the soil. Emissions from coke ovens have arsonic in them. ==References== Category:Metalloids Category:Semimetals Category:Poisons Category:Pnictogens",
 "title": "Arsenic"
}