{
 "id": "202206",
 "text": "John Nicholaas Rep (born 25 November 1951) is a Dutch former professional footballer who played as a right winger. He was born in Zaandam. He currently holds the all-time record for FIFA World Cup goals for the Netherlands with 7. He played two European Cup finals and two World Championship finals for The Netherlands (1974 and 1978). A side striker who later became a right winger, he was a fast and skilled dribbler who was well suited to Dutch \"total football\". Considered as one of the best Dutch players and he is regarded as one of the greatest wingers in 1970s. ==Club career== Rep made his debut for Ajax on 29 August 1971. He earned his 'Goudhaantje (Goldcrest)' due to his ability to score decisive goals. During the return match for the Intercontinental Cup against Independiente in 1972 he scored two of the three Ajax goals. In 1973 he scored the decisive 1-0 in the European Cup I final against Italian Juventus. In 1975 Rep left Ajax for the Spanish club Valencia CF. Then he was superseded by Tscheu La Ling. He played two seasons at Valencia during which he scored 22 goals. The next step in his career took Rep to France. He played two seasons for SC Bastia (33 goals) and four seasons for AS Saint-Etienne (44 goals). He returned to the Dutch league in 1983 to play for PEC Zwolle, Feyenoord before ending his professional player career at HFC Haarlem. ==International career== Dutch international from 1973 to 1981, a period in which he collected 42 appearances and scored 12 goals. Rep together with other players such as Johan Cruijff, Ruud Krol, Johan Neeskens and Rob Rensenbrink formed the backbone of the Dutch national team which in that period was runner-up in the world twice consecutively (in Germany 1974 and in Argentina 1978) and third during UEFA Euro 1976. During the 1974 FIFA World Cup in Germany, the Netherlands started strong by beating Uruguay 2-0 and Rep was a great protagonist with a brace: a header from a cross by Suurbier and a great collective action originating from a ball intercepted by Rep and finished by himself. After the goalless draw with Sweden, the Netherlands overwhelmed Bulgaria 4-1 and Rep scored again, this time with an assist from Cruijff, In the second group stage, the Netherlands started with a clear 4-0 against Argentina and Rep scored his fourth personal goal in this World Cup by correcting a non-exceptional cross from Cruijff. After defeating East Germany and Brazil, the Netherlands reached the final which was then lost 2-1 against the hosts West Germany: on the 1-1 result Cruijff offered Rep a golden ball to score but the winger's shot Dutch left is saved by Sepp Maier, the German goalkeeper who seemed insurmountable that day. At the UEFA Euro 1976, the Netherlands reached the semi-finals after advancing the preliminary group stage on better goal difference than Poland and having scrambled Belgium in the quarter-finals with a clear 5-0 first leg and a 2-1 second leg (with goals from Rep). In the semifinals, the Netherlands were eliminated by Czechoslovakia, losing 3-1 in a very violent match, which ended in ten against nine after extra time and played on a flooded pitch. The Netherlands will win the final against Yugoslavia 3-2 and finish third. At the 1978 FIFA World Cup in Argentina, Holland is without the champion Cruijff so the three stars Johnny Rep, Johan Neeskens and Rob Rensenbrink are loaded with more responsibility. But despite this, the three thanks above all to the contribution of the van de Kerkhof twins, Arie Haan and Ernie Brandts dragged the Dutch national team to the final. Rep plays all the matches, earns two penalties and scores three goals: he scores with a long shot in the 3-2 defeat against Scotland and scores twice in the 5-1 win against Austria, both goals from an assist from Rensenbrink. With the three goals scored in this edition Rep becomes the Dutchman to have scored the most goals in the final stages of the World Cup: seven goals. The Netherlands loses the final again (a final characterized by a refereeing harbinger of controversy given the numerous bookings for the oranjes) this time 3-1 after extra time against Argentina and the various attempts by the Rep and his teammates to seek victory yes they break against Ubaldo Fillol, on a day of grace. ==Honours== Ajax * Eredivisie: 1971–72, 1972–73 * European Cup: 1971–72, 1972–73 * European Super Cup: 1972, 1973 * Intercontinental Cup: 1972 Bastia * UEFA Cup runner-up: 1978 Saint- Étienne * French League Championship: 1980–81 Netherlands * FIFA World Cup runner-up: 1974, 1978 * UEFA European Championship third place: 1976 Individual * French Division 1 Foreign Player of the Year: 1977–78 ==References== Category:1951 births Category:Living people Category:Dutch football managers Category:Footballers from Zaanstad",
 "title": "Johnny Rep"
}