{
 "id": "202455",
 "text": "Monty Kip Sopp (born November 11, 1963 in Orlando, Florida), better known by his ring name Billy Gunn, is an American professional wrestler. He is currently signed to All Elite Wrestling (AEW), where he won the AEW World Trios Championship once with Max Caster and Anthony Bowens. Gunn is best known for his time with World Wrestling Federation/Entertainment (WWE), where he was en eleven-time tag team champion and the 1999 King of the Ring. He also worked as a trainer for WWE's developmental territory NXT and wrestled for Total Nonstop Action Wrestling (TNA). Gunn is also known for being a tag team wrestler and was a part of The Smokin' Gunns with on-screen brother Bart Gunn, the New Age Outlaws with Road Dogg, Billy and Chuck with Chuck and D-Generation X. His sons Austin and Colten Gunn also wrestle in AEW in the tag team The Gunns. ==Career== ===All Elite Wrestling=== At All In, Gunn and The Acclaimed defeated the House of Black (Malakai Black, Brody King, and Buddy Matthews) to win the AEW World Trios Championship. This was Gunn's first championship in AEW. ==Championships== Gunn held many championships during his professional wrestling career: *All Elite Wrestling ** AEW World Trios Championship (1 time) (with Max Caster and Anthony Bowens) *American Pro Wrestling Alliance **APWA American Championship (one time) *Bad Boys of Wrestling Federation **BBFW Aruba Championship (one time, current) *International Wrestling Federation **IWF Tag Team Championship (two times) (with Brett Colt) *Legends Pro Wrestling **XWF/LPW Hall of Fame (August 18, 2007) *Maryland Championship Wrestling **MCW Tag Team Championship (one time) (with B.G. James) *Pro Wrestling Illustrated **He was ranked #39 of the best 500 singles wrestlers of the year in the PWI 500 in 1999 **PWI Tag Team of the Year (1998) (with Road Dogg) **PWI Tag Team of the Year (2002) (with Chuck) **He was ranked #43 of the Top 100 Tag Teams of the PWI Years in 2003 (with Road Dogg) *TWA Powerhouse **TWA Tag Team Championship (one time) (with B.G. James) *World Pro Wrestling **WPW World Heavyweight Championship (one time) *World Wrestling Federation / World Wrestling Entertainment / WWE **WWF Hardcore Championship (two times) **WWF Intercontinental Championship (one time) **WWE Tag Team Championship (one time) (with Road Dogg) **WWF/E World Tag Team Championship (ten times) (with Bart Gunn (3), Road Dogg (6) and Chuck (2)) **King of the Ring (1999) *Wrestling Observer Newsletter awards **Worst Worked Match of the Year (2006) (TNA Reverse Battle Royal on TNA Impact!) == Footnotes == == References == ==Other websites== * * Category:1963 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Orlando, Florida Category:Total Nonstop Action Wrestling alumni Category:WWE Hall of Fame",
 "title": "Billy Gunn"
}