{
 "id": "202697",
 "text": "Liebeck v. McDonald's Restaurants is also known as the \"McDonald's coffee case\". It was a lawsuit between Stella Liebeck and McDonald's. Stella Liebeck was badly injured by hot coffee. She had bought the coffee from a McDonald's restaurant. A jury awarded her $2.86 million, but in the end she only got $640,000. == What happened to Stella Liebeck? == The accident with the hot coffee happened on February 27, 1992. Stella Liebeck was 79 years old. She bought a cup of coffee from the drive-through window of a McDonald's restaurant. When she opened the cup to add cream and sugar, she spilled the coffee on her lap. She was taken to the hospital and they found that she had bad burns. She had to stay in the hospital for eight days. She got skin grafting: they moved healthy skin to replace the burned skin. She lost a lot of weight. Her daughter had to care for her for 3 weeks when she came out of the hospital. The accident changed her body forever. She was disabled for 2 years. == What did she want? == Stella Liebeck wanted $20,000 from McDonald's. She needed to pay the hospital and her daughter. McDonald's offered only $800. Then Liebeck hired an attorney, Reed Morgan. Morgan said that the coffee was dangerous and asked for $90,000, but McDonald's refused. That is why they needed a trial. == How did the trial go? == The attorney, Reed Morgan, showed examples of what McDonald's did wrong: * Coffee from McDonald's had burned 700 people already. * A doctor said that colder coffee causes less burns and that the McDonald's coffee is too hot to drink. * Other restaurants in the city serve colder coffee. Then on August 18, 1994 the jury decided. They said that McDonald's was 80% wrong and Stella Liebeck was 20% wrong. The warning on the coffee cup was too small. Stella Liebeck got $160,000 to pay the hospital and her daughter. She also got $2,7 million so that McDonald's would not do it again. But the judge made it $640,000. == What happened then? == * Some people said that it was wrong that Stella Liebeck wanted a lawsuit. They said that it was wrong that she got so much money. But most of the money was to make McDonald's not do it again. * McDonald's did not make their coffee colder. * Stella Liebeck died on August 5, 2004. She was 91 years old. She paid a nurse with the money from the lawsuit. * HBO made a film about this story: Hot Coffee. Category:United States law Category:1994 in the United States Category:1990s in law",
 "title": "Liebeck v. McDonald's Restaurants"
}