{
 "id": "20284",
 "text": "Henry Jaynes Fonda (May 16, 1905 – August 12, 1982) was an American actor in many movies and plays. He usually played a character that was an \"everyman\" (a humble and ordinary protagonist). Fonda was born on May 16, 1905 in Grand Island, Nebraska.Henry Fonda. YahooMovies.com. Retrieved on January 11, 2007. He studied at the University of Minnesota. Fonda played in his first Hollywood movie in 1935. He became very popular from his movies. He was in many popular movies like Jezebel (1938), Jesse James (1939) and Young Mr. Lincoln (1939). He was given a nomination for Academy Award for Best Actor for playing Tom Joad in The Grapes of Wrath (1940). In 1941, Fonda was an actor with Barbara Stanwyck in the movie classic The Lady Eve. After being in World War II, he played in 2 popular Western movies. These were The Ox-Bow Incident (1943) and My Darling Clementine (1946). My Darling Clementine was directed by John Ford. He also was in in Ford's Western Fort Apache (1948). After that, Fonda, became a stage actor for many years. He played in Mister Roberts in 1955. In 1956, Fonda played Manny Balestrero in Alfred Hitchcock's movie The Wrong Man. In 1957, Fonda starred as Juror 8 in 12 Angry Men. He earned a BAFTA award for Best Foreign Actor for this movie. Fonda played many characters in his later career. He was a villain in Once Upon a Time in the West (1968). He was the lead in the romantic comedy Yours, Mine and Ours with Lucille Ball. He also acted as military people in Battle of the Bulge (1965) and Admiral Nimitz in Midway (1976). Fonda's last movie was in 1981's On Golden Pond. Fonda won the Academy Award for Best Picture at the 54th Academy Awards for this movie. The movie co-starred Katharine Hepburn and his daughter Jane Fonda. He was too sick to attend this year's Academy Awards. Fonda died 5 months later on August 12, 1982. He died from from heart disease in Los Angeles, California. He was 77. In 1999, he was called the sixth-Greatest Male Screen Legend of the \"Classic Hollywood Era\" by the American Film Institute. Fonda was the father in a family of actors. His daughter Jane Fonda, son Peter Fonda, granddaughter Bridget Fonda and grandson Troy Garity were all actors. == Personal life == Then he was married to Frances Ford Seymour from 1936 until her death in 1950. Then he was married to Susan Blanchard Fonda was married 5 times. He also had 3 children. One of them was adopted. He was married to Margaret Sullavan in 1931. They divorced in 1932. In 1935, Fonda started dating the singer and actress Shirley Ross. By the end of 1935, many people, such as columnist Ed Sullivan, discovered that they were engaged. However, in January 1936 they separated. It was then reported that Fonda was dating the actress Virginia Bruce. However, Fonda and Frances Ford Seymour Brokaw had met later that year. They had 2 children after they married in 1931. These were Jane (b. 1937) and Peter (19402019). They both became successful actors. Jane has won two Best Actress Academy Awards. Peter was nominated for two Oscars. In 1949, Fonda announced that he wanted to divorce Frances. Frances was very sad at this announcement. Frances went to the Craig House Sanitarium in January 1950 for treatment. She committed suicide there on April 14. Later in 1950, Fonda married Susan Blanchard from 1950 until they divorced in 1956. Then he was married to Afdera Franchetti from 1957 until they divorced in 1961. Then he was last married to Shirlee Mae Adams from 1965 until his death in 1982. == Movies == Fonda was in 106 movies, TV programs, and shorts. He was in many classics such as 12 Angry Men and The Ox-Bow Incident. He was nominated for an Academy Award for Best Actor for The Grapes of Wrath. He won an Academy Award for Best Actor in 1981 for On Golden Pond. Fonda was also in many westerns and war movies. == Theatre == Broadway stage performances * The Game of Love and Death (November 1929 – January 1930) * I Loved You, Wednesday (October – December 1932) * New Faces of 1934 (Revue; March – July 1934) * The Farmer Takes a Wife (October 1934 – January 1935) * Blow Ye Winds (September – October 1937) * Mister Roberts (February 1948 – January 1951) * Point of No Return (December 1951 – November 1952) * The Caine Mutiny Court-Martial (January 1954 – January 1955) * Two for the Seesaw (January 1958 – October 1959) * Silent Night, Lonely Night (December 1959 – March 1960) * Critic's Choice (December 1960 – May 1961) * A Gift of Time (February – May 1962) * Generation (October 1965 – June 1966) * Our Town (November – December 1969) * Clarence Darrow (March – April 1974; March 1975) * First Monday in October (October – December 1978) == Awards and nominations == Awards Year Category Work Result Academy Awards 1940 Best Actor The Grapes of Wrath Academy Awards 1957 Best Picture 12 Angry Men Academy Awards 1980 Academy Honorary Award Academy Awards 1981 Best Actor On Golden Pond BAFTA Awards 1958 Best Actor 12 Angry Men BAFTA Awards 1981 On Golden Pond Primetime Emmy Awards 1973 Outstanding Lead Actor in a Limited Series or Movie The Red Pony Primetime Emmy Awards 1975 Outstanding Lead Actor in a Limited Series or Movie Clarence Darrow Primetime Emmy Awards 1980 Outstanding Lead Actor in a Limited Series or Movie Gideon's Trumpet Golden Globe Awards 1958 Best Actor – Motion Picture Drama 12 Angry Men Golden Globe Awards 1980 Cecil B. DeMille Award Golden Globe Awards 1982 Best Actor – Motion Picture Drama On Golden Pond Grammy Awards 1977 Best Spoken Word Album Great American Documents Tony Awards 1948 Best Actor in a Play Mister Roberts Tony Awards 1975 Clarence Darrow Tony Awards 1979 Special Tony Award AFI Awards 1978 Life Achievement Award ==References== == Bibliography == * * * * * * * * * * * * * == Other websites == * Retrieved on 2008-07-26 * Retrieved on 2008-07-26 * Retrieved on 2008-07-26 * Henry Fonda as found in the 1910 US Census, 1920 US Census, 1930 US Census, 1931 Maryland Marriages, and Social Security Death Index. * Literature on Henry Fonda Category:1905 births Category:1982 deaths Category:American Academy Award winning actors Category:Actors from Nebraska Category:American movie actors Category:American radio actors Category:American stage actors Category:American television actors Category:American voice actors Category:Kennedy Center honorees Category:Deaths from heart disease Category:20th-century American actors Category:Agnostics Category:Beekeepers Category:Democrats (United States) Category:American Grammy Award winners Category:Liberalism Category:Actors from Omaha, Nebraska Category:American military personnel of World War II",
 "title": "Henry Fonda"
}