{
 "id": "203094",
 "text": "The Iller-Lech Plateau () or Upper Swabian Plateau (Oberschwäbische Hochebene), is one of the natural regions of Germany. == Neighboring Natural Regions == In the northwest: the Swabian Jura (D60 on the map); The river Danube is roughly the border between the two natural regions. In the extreme northeast: the Franconian Jura (D61 on the map); The river Danube is roughly the border between the two natural regions. In the east: the Lower Bavarian Uplands and the Isar-Inn Gravel Plateaus (D65 on the map); The river Lech is roughly the border between the two natural regions in parts. In the south: the Southern Alpine Foreland (D66 on the map); The terminal moraines of the Würm glaciation are roughly the border between the two natural regions. == Sub- divisions of the Iller-Lech Plateau == 1: Danube-Ablach Plateaus: Old Drift landscape (in Baden-Württemberg) 2: Danube Valley between Mengen and Ulm, Lower Riß Valley: valleys (in Baden- Württemberg) 3: Federsee Ried: (in Baden-Württemberg) 4: Western Plain of the Lower Riß: Tertiary hills and ice age gravel deposits (in Baden-Württemberg) 5: Eastern Plain of the Lower Riß: Tertiary hills and Old Drift ice age gravel deposits (in Baden-Württemberg) 6: Holzstöcke: Tertiary hills (in Baden-Württemberg) 7 and 8: Western and Eastern Riß-Aitrach Plateaus: Old Drift landscape (in Baden-Württemberg) 9 and 10: Higher Plains of the Lower Iller Valley (south of Memmingen) and Lower Plains of the Lower Iller Valley (north of Memmingen): large valley, filled by gravel during and after the ice ages (in Baden-Württemberg and Bavaria) 11 and 12: Upper and Lower Iller-Lech Gravel Plateaus: Tertiary hills with valleys formed by river systems flowing from south to north (in Bavaria) 13: Donauried: Large fen plain by the Danube; Würm Ice Age formed (in Baden- Württemberg and Bavaria) 14 / 15: Zusam Plateau and Stauffenberg Region / Stauden Plateau (Stauden) (together: Augsburg-Westliche Wälder Nature Park): Tertiary hills with valleys formed by river systems flowing from south to north (in Bavaria) 16: Lech Valley: large valley, filled by gravel during and after the ice ages (in Bavaria) 17: Aindlingen Terrace: Tertiary hills and High gravel plateau (in Bavaria) 18 and 20: Lower and Upper Lech-Wertach Plain: Divided into lower terrace landscape by the Wertach and Gennach rivers (in Bavaria) 19: Landsberg Plateau: High gravel plateau rising from north to south (in Bavaria) 21: Sachsenried and Denklingen Rotwald: pure forest landscape; in the north: high terrace gravels of the Lech; in the south: Old Drift landscape (in Bavaria) == References == * Bayernviewer at the Bavarian Measurement Office: http://www.geodaten.bayern.de/BayernViewer/index.cgi * Map of the BfN's Landscapes in Germany: http://www.bfn.de/geoinfo/landscapes/ and the information pages of the individual sub-divisions of the Iller-Lech Plateau Category:Geography of Bavaria Category:Swabia (Bavaria)",
 "title": "Iller-Lech Plateau"
}