{
 "id": "203536",
 "text": "was a Japanese football player and manager. He played for the Japan national team. He also managed the Japan national team. ==Biography== Takenokoshi was born in Usuki on February 15, 1906. He played for Tokyo Imperial University LB which was consisted of his alma mater Tokyo Imperial University players and graduates. He also played for Tokyo OB Club and won 1933 Emperor's Cup with Shiro Teshima and Teiichi Matsumaru. In May 1925, when Takenokoshi was a Tokyo Imperial University student, he was selected the Japan national team for Far Eastern Championship Games in Manila. At this competition, on May 20, he debuted against Republic of China. He also played at 1927 in Shanghai and 1930 Far Eastern Championship Games in Tokyo. At 1927 Far Eastern Championship Games, on August 29, he scored a goal against Philippines and Japan won this match. This is Japan national team first victory in \"International A Match\". At 1930 Far Eastern Championship Games, he led Japan to the champions as captain. He played 5 games and scored 1 goal for Japan until 1930. In 1934, Takenokoshi was named manager for the Japan national team for the 1934 Far Eastern Championship Games in Manila. In 1936, he served as assistant coach under manager Shigeyoshi Suzuki for 1936 Summer Olympics in Berlin. Japan completed a come-from-behind victory against Sweden. The first victory in Olympics for the Japan and the historic victory over one of the powerhouses became later known as \"Miracle of Berlin\" (ベルリンの奇跡) in Japan. In 2016, this team was selected Japan Football Hall of Fame. He also managed Japan from 1938 to 1940. After World War II, in 1951, Takenokoshi became a manager for Japan as Hirokazu Ninomiya successor again. He managed at 1954 Asian Games and 1956 Summer Olympics. He resigned after 1956 Summer Olympics. In 1958, he became a manager for Japan as Taizo Kawamoto successor again. However, in December 1959, at 1960 Summer Olympics qualification, following Japan's failure to qualify for 1960 Summer Olympics, he stepped down as manager. On October 6, 1980, Takenokoshi died of stroke in Bunkyo, Tokyo at the age of 74. In 2005, he was selected Japan Football Hall of Fame. ==Statistics== Japan National Football Team Database |- |1925||1||0 |- |1926||0||0 |- |1927||2||1 |- |1928||0||0 |- |1929||0||0 |- |1930||2||0 |- !Total||5||1 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association *Japan Football Hall of Fame (Japan team at 1936 Olympics) at Japan Football Association Category:1906 births Category:1980 deaths Category:Footballers from Oita Prefecture Category:Japan international footballers Category:Japanese football managers Category:Japan national football team managers",
 "title": "Shigemaru Takenokoshi"
}