{
 "id": "20364",
 "text": "Ruth Elizabeth \"Bette\" Davis (; April 5, 1908 – October 6, 1989) was an American actress for stage, movies, and television. She was born in Lowell, Massachusetts. She was nicknamed \"The Queen of Hollywood\" or the \"First Lady of the American Screen\" and \"The Fifth Warner Brother\" during her career. She is thought to be one of the greatest actresses in Hollywood. She was able to play many mean and cynical characters. She also played in many different movie genres. Her most successful roles were ones in romantic dramas. She won the Academy Award for Best Actress twice. Davis had the most Academy Award nominations for acting (with 10) until Katharine Hepburn took her place with twelve. She was the first woman to have a Lifetime Achievement Award from the American Film Institute. In 1999, Davis was second on the American Film Institute's list of the greatest female stars of classic Hollywood cinema. Bette Davis was in over 100 films across 60 years. Some of the most popular movies were Of Human Bondage (1934), Marked Woman (1937), Jezebel (1938), Dark Victory (1939), The Letter (1940), The Little Foxes (1941), Now, Voyager (1942), Watch on the Rhine (1943), Mr. Skeffington (1944), All About Eve (1950), The Virgin Queen (1955), The Catered Affair (1956), Pocketful of Miracles (1961), What Ever Happened to Baby Jane? (1962), Death on the Nile (1978) and The Whales of August (1987). In 1981 Kim Carnes sang the hit song \"Bette Davis Eyes\". Davis liked the song. Carnes gave Davis a gold record. Davis hung the gold record on a wall. The Kennedy Center honored Davis in 1987. She died of breast cancer in Neuilly-sur-Seine, France. == Academy Awards == Davis had many Academy Awards in her life. She also had many Oscar milestones. She was the first person to earn five Academy Award nominations in a row for acting. All of these nominations were in the Best Actress category (1938–1942). Her record has only been matched by one other person. Greer Garson also earned five nominations in a row in the Best Actress category (1941–1945). In three of these years, both actresses were nominated. In 1962, Bette Davis was the first person to have 10 Academy Award nominations for acting. Since then, only 3 people have had more nominations than her. Meryl Streep (with 21 nominations and three wins), Katharine Hepburn (12 nominations and 4 wins), and Jack Nicholson (12 nominations and 3 wins). Laurence Olivier also matched her (10 nominations and 1 win). Steven Spielberg bought two of Davis's Oscars. The first Oscar was sold for $207,500. The oscar was for the movie Dangerous (1935). The second Oscar was sold for $578,000. That Oscar was for the movie Jezebel (1938).\"Classic Movie Scrapbook: Dangerous.\" Reel Classics.com. Accessed May 24, 2008.\"Spielberg buys Bette Davis' Oscar.\" BBC.co.uk. July 20, 2001. Accessed May 24, 2008. Year Category Film Result 1934 Best Actress Of Human Bondage (Write-in) 1935 Dangerous rowspan=\"2\" 1938 Jezebel 1939 Dark Victory rowspan=\"8\" 1940 The Letter 1941 The Little Foxes 1942 Now, Voyager 1944 Mr. Skeffington 1950 All About Eve 1952 The Star 1962 What Ever Happened to Baby Jane? ==Important movies== == References == == Other websites == * - operated by the Estate of Bette Davis * * * * * * * * * Portraits from \"The Little Foxes\", 1941 by Ned Scott * Kathryn Sermak recounts living with Bette Davis, interview October, 2017, News-Sentinel, accessed October 25, 2017. Category:Actors from Massachusetts Category:American movie actors Category:American stage actors Category:American television actors Category:Cancer deaths in France Category:Deaths from breast cancer Category:Kennedy Center honorees Category:1908 births Category:1989 deaths Category:People from Lowell, Massachusetts",
 "title": "Bette Davis"
}