{
 "id": "20368",
 "text": "The Nobel Prize in Literature is one of many Nobel Prizes given in honor of Alfred Nobel. Every year, a writer is chosen by the Swedish Academy to receive the Nobel Prize in Literature. They choose someone who they think has written something that has great value. The prize was awarded the first time in 1901 to Sully Prudhomme of France. == List of laureates == List of Nobel Prize laureates (winners) in Literature from 1901 to the present date. Year Name Reason Country Language(s) 1901 Sully Prudhomme \"in special recognition of his poetic composition, which gives evidence of lofty idealism, artistic perfection and a rare combination of the qualities of both heart and intellect\" France French 1902 Theodor Mommsen Germany German 1903 Bjørnstjerne Bjørnson Norway Norwegian 1904 Frédéric Mistral France Occitan José Echegaray y Eizaguirre Spain Spanish 1905 Henryk Sienkiewicz Poland Polish 1906 Giosuè Carducci Italy Italian 1907 Rudyard Kipling United Kingdom English 1908 Rudolf Christoph Eucken Germany German 1909 Selma Lagerlöf Sweden Swedish 1910 Paul Heyse Germany German 1911 Count Maurice Maeterlinck Belgium French 1912 Gerhart Hauptmann Germany German 1913 Rabindranath Tagore India Bengali 1915 Romain Rolland France French 1916 Verner von Heidenstam Sweden Swedish 1917 Karl Adolph Gjellerup Denmark Danish Henrik Pontoppidan Denmark Danish 1919 Carl Spitteler Switzerland German 1920 Knut Hamsun Norway Norwegian 1921 Anatole France France French 1922 Jacinto Benavente Spain Spanish 1923 William Butler Yeats Ireland English 1924 Władysław Reymont Poland Polish 1925 George Bernard Shaw Ireland English 1926 Grazia Deledda Italy Italian 1927 Henri Bergson France French 1928 Sigrid Undset Norway Norwegian 1929 Thomas Mann Germany German 1930 Sinclair Lewis United States English 1931 Erik Axel Karlfeldt Sweden Swedish 1932 John Galsworthy United Kingdom English 1933 Ivan Alekseyevich Bunin Russia (in exile) Russian 1934 Luigi Pirandello Italy Italian 1936 Eugene O'Neill United States English 1937 Roger Martin du Gard France French 1938 Pearl S. Buck United States English 1939 Frans Eemil Sillanpää Finland Finnish 1944 Johannes Vilhelm Jensen Denmark Danish 1945 Gabriela Mistral Chile Spanish 1946 Hermann Hesse Switzerland German 1947 André Gide France French 1948 T. S. Eliot United States/United Kingdom English 1949 William Faulkner United States English 1950 Bertrand Russell United Kingdom English 1951 Pär Lagerkvist Sweden Swedish 1952 François Mauriac France French 1953 Sir Winston Churchill United Kingdom English 1954 Ernest Hemingway United States English 1955 Halldór Laxness Iceland Icelandic 1956 Juan Ramón Jiménez Spain Spanish 1957 Albert Camus France French 1958 Boris Pasternak (declined the prize) Russia Russian 1959 Salvatore Quasimodo Italy Italian 1960 Saint-John Perse France French 1961 Ivo Andric Yugoslavia Serbo- Croat 1962 John Steinbeck United States English 1963 Giorgos Seferis Greece Greek 1964 Jean-Paul Sartre (declined the prize) France French 1965 Michail Sholokhov Russia Russian 1966 Shmuel Yosef Agnon Israel Hebrew Nelly Sachs Germany German 1967 Miguel Ángel Asturias Guatemala Spanish 1968 Yasunari Kawabata Japan Japanese 1969 Samuel Beckett Ireland English/French 1970 Aleksandr Solzhenitsyn Russia Russian 1971 Pablo Neruda Chile Spanish 1972 Heinrich Böll Germany (West) German 1973 Patrick White Australia English 1974 Eyvind Johnson Sweden Swedish Harry Martinson Sweden Swedish 1975 Eugenio Montale Italy Italian 1976 Saul Bellow Canada/United States English 1977 Vicente Aleixandre Spain Spanish 1978 Isaac Bashevis Singer United States Yiddish 1979 Odysseas Elytis Greece Greek 1980 Czesław Miłosz Lithuania/Poland/United States Polish 1981 Elias Canetti United Kingdom German 1982 Gabriel García Márquez Colombia Spanish 1983 William Golding United Kingdom English 1984 Jaroslav Seifert Czechoslovakia Czech 1985 Claude Simon France French 1986 Akinwande Oluwole Soyinka Nigeria English 1987 Joseph Brodsky Russia/United States Russian/English 1988 Naguib Mahfouz Egypt Arabic 1989 Camilo José Cela Spain Spanish 1990 Octavio Paz Mexico Spanish 1991 Nadine Gordimer South Africa English 1992 Derek Walcott St. Lucia English 1993 Toni Morrison United States English 1994 Kenzaburo Oe Japan Japanese 1995 Seamus Heaney Ireland English 1996 Wisława Szymborska Poland Polish 1997 Dario Fo Italy Italian 1998 José Saramago Portugal Portuguese 1999 Günter Grass Germany German 2000 Gao Xingjian France/China Chinese 2001 Vidiadhar Surajprasad Naipaul United Kingdom English 2002 Imre Kertész Hungary Hungarian 2003 John Maxwell Coetzee South Africa English 2004 Elfriede Jelinek Austria German 2005 Harold Pinter United Kingdom English 2006 Orhan Pamuk Turkey Turkish 2007 Doris Lessing United Kingdom English 2008 J. M. G. Le Clézio France French 2009 Herta Müller Germany German 2010 Mario Vargas Llosa Peru Spanish 2011 Tomas Tranströmer Sweden Swedish 2012 Mo Yan People's Republic of China Chinese 2013 Alice Munro Canada English 2014 Patrick Modiano France French 2015 Svetlana Alexievich Belarus Russian 2016 Bob Dylan United States English 2017 Kazuo Ishiguro United Kingdom English 2018 Olga Tokarczuk Poland Polish 2019 Peter Handke Germany German 2020 Louise Glück United States English 2021 Abdulrazak Gurnah Tanzania English 2022 Annie Ernaux France French 2023 Jon Fosse Norway Norwegian 2024 Han Kang South Korea Korean == Related pages == * List of Nobel Prize winners by country * List of Nobel Prize winners in Chemistry * List of Nobel Prize winners in Economics * List of Nobel Prize winners in Physics * List of Nobel Prize winners in Physiology or Medicine * List of Nobel Peace Prize winners ==References== == Other websites == * The Nobel Prize in Literature - Laureates * Nobel Prize Winners in Literature * The Nobel Prize * Written in Stone - Burial locations of literary figures. Literature *",
 "title": "List of Nobel Prize winners in Literature"
}