{
 "id": "203872",
 "text": "New Year's Revolution is a series of professional wrestling shows held by WWE in January. The event first took place from 2005 to 2007 and aired on pay-per- view (PPV). All three events during this time were exclusive to the Raw brand. The show was no longer on the WWE schedule starting in 2008 when they removed more PPVs per year. After thirteen years, WWE brought back the New Year's Revolution name for a house show tour in 2020. Four years later, WWE used the name for a television special for the SmackDown brand. == Events == === Pay- per-view and televised events (2005–2007, 2024) === Raw-branded event SmackDown-branded event # Event Date City Venue Main Event Ref. 1 New Year's Revolution (2005) January 9, 2005 San Juan, Puerto Rico Coliseo de Puerto Rico Triple H vs. Batista vs. Randy Orton vs. Chris Jericho vs. Chris Benoit vs. Edge in an Elimination Chamber match for the vacant World Heavyweight Championship with Shawn Michaels as the special guest referee 2 New Year's Revolution (2006) January 8, 2006 Albany, New York Pepsi Arena * John Cena (c) vs. Carlito vs. Chris Masters vs. Kane vs. Kurt Angle vs. Shawn Michaels in an Elimination Chamber match for the WWE Championship * John Cena (c) vs. Edge for the WWE Championship in Edge's Money in the Bank cash-in match 3 New Year's Revolution (2007) January 7, 2007 Kansas City, Missouri Kemper Arena John Cena (c) vs. Umaga for the WWE Championship 4 New Year's Revolution (2024) January 5, 2024 Vancouver, British Columbia, Canada Rogers Arena LA Knight vs. AJ Styles vs. Randy Orton to determine the #1 contender for the Undisputed WWE Universal Championship at the Royal Rumble === New Year's Revolution Tour (2020) === The New Year's Revolution Tour was originally scheduled to be a tour of nine WWE Live shows, however, the final show was canceled because of the COVID-19 pandemic. These house shows were supershows, featuring wrestlers from both the Raw and SmackDown brands. # Date City Venue Main Event Ref. 1 January 4 Cape Girardeau, Missouri Show Me Center Roman Reigns, Braun Strowman, and Big E vs. King Corbin and The Revival (Scott Dawson and Dash Wilder) 2 January 5 Springfield, Missouri JQH Arena Roman Reigns, Braun Strowman, and The New Day (Big E and Kofi Kingston) vs. King Corbin, Shinsuke Nakamura, and The Revival (Scott Dawson and Dash Wilder) 3 January 11 Dayton, Ohio Nutter Center Roman Reigns vs. King Corbin in a Loser Eats Dog Food match 4 January 12 Corbin, Kentucky The Corbin Arena 5 February 8 Oakland, California Oakland Arena Roman Reigns vs. King Corbin 6 February 9 Fresno, California Save Mart Center Drew McIntyre vs. Seth Rollins 7 February 15 Eugene, Oregon Matthew Knight Arena Roman Reigns vs. King Corbin 8 February 16 Kennewick, Washington Toyota Center == Results == === 2024 === New Year's Revolution (2024) took place on January 5, 2024, at the Rogers Arena in Vancouver, British Columbia, Canada, and aired as a special episode of Friday Night SmackDown on Fox. It featured wrestlers from the company's SmackDown brand. === WWE United States Championship #1 Contender Tournament === ==See also== *List of WWE pay-per-view events *Elimination Chamber ==References== ==Other websites== *Official Website Category:World Wrestling Entertainment pay-per-view events Category:2005 establishments Category:January events",
 "title": "WWE New Year's Revolution"
}