{
 "id": "20412",
 "text": "Saint Lucia is a tropical island country in the eastern Caribbean Sea. It is a part of the Lesser Antilles island group, and it is north of the islands of Saint Vincent and the Grenadines and south of Martinique. As of 2010 there are about 174,000 people. The official language is English. Saint Lucian Creole French (Kwéyòl), which is a French-based Creole is spoken by 95% of the people. About 70% of the people are Roman Catholic. Two Nobel laureates, Arthur Lewis, an economist, and Derek Walcott, a poet and playwright, have come from the island. Saint Lucia is a full and participating member of the Caribbean Community (CARICOM), Organisation of Eastern Caribbean States (OECS) and La Francophonie. Saint Lucia is the only country in the world to be named after a woman, Saint Lucy. == History == The first proven inhabitants of the island, the Arawaks, are believed to have first settled in AD 200–400. Around 800 AD, the island would be taken over by the Kalinago. The French were the first Europeans to settle on the island, and they signed a treaty with the native Caribs in 1660. England took control of the island in 1663. In ensuing years, England and France fought 14 times for control of the island, and the rule of the island changed frequently. Eventually, the British took full control in 1814. In 1979, Saint Lucia peacefully gained independence from the United Kingdom but kept Elizabeth II as Head of State. ==Geography== The volcanic island of Saint Lucia is more mountainous than many other Caribbean islands. The highest point is Mount Gimie, at above sea level. Two other mountains, the Pitons, form the island's most famous landmark. They are between Soufrière and Choiseul on the western side of the island. Saint Lucia is also one of the few islands in the world that has a drive-in volcano. It is also famous for clear seas and sandy beaches. The capital city of Saint Lucia is Castries. Over one third of all the people live in the capital. Major towns include Gros Islet, Soufrière and Vieux Fort. The local climate is tropical. They have northeast trade winds. There is a dry season from December 1 to May 31, and a wet season from June 1 to November 30. === Quarters === Saint Lucia has 11 quarters, or parishes of the island. # Anse la Raye # Castries # Choiseul # Dauphin # Dennery # Gros Islet # Laborie # Micoud # Praslin # Soufrière # Vieux Fort ===Cities=== The cities in Saint Lucia are: *Anse La Raye *Bocage *Castries - Capital *Canaries *Choiseul *Dennery *Desruisseaux *Gros Islet *Laborie *Micoud *Mon Repos *Praslin *Ravine Poisson *Rodney Bay *Soufrière *Ti Rocher *Vieux Fort == Politics == Saint Lucia is a constitutional monarchy, which means that the monarch (King Charles III) has no power in how the country is ruled. The King is represented by a viceroy. The Parliament is split into two \"houses\". The House of Assembly had 17 members who are elected by the people. The leader of the party with the most seats becomes the Prime Minister, who leads the government. ==Economy== Tourism is important to Saint Lucia's economy. There are more tourists during the dry season (January to April). Saint Lucia tends to be popular due to its tropical weather and scenery and its many beaches and resorts. Other tourist attractions include a drive-in volcano, Sulphur Springs, the Botanical Gardens, the Majestic twin Peaks \"The Pitons\", a world heritage site, the rain forests, and Pigeon Island National Park. Most tourists visit Saint Lucia as part of a cruise. Most of their time tends to be spent in Castries, although Soufriere, Marigot Bay and Gros Islet are popular locations to visit. ==Sport== The Windward Islands cricket team includes players from Saint Lucia. They play in the West Indies regional tournament. Darren Sammy is the first Saint Lucian to represent the West Indies. He is the current captain. ==Related pages== *List of rivers of Saint Lucia *List of Saint Lucian people *Saint Lucia at the Olympics *Saint Lucia national football team ==References== Category:Commonwealth realms Category:English-speaking countries Category:Current monarchies Category:Caribbean Community",
 "title": "Saint Lucia"
}