{
 "id": "204326",
 "text": "== Descrpition == Edaphosaurus was a genus of non-reptilian pelycosaur (early Synapsida) that lived during the later Carboniferous and early Permian, around 303.4 million-272.5 million years ago. It was a herbivorous relative of the well-known Dimetrodon. Both had a large, thermal regulating sail on the back. Fossils of Edaphosaurus have been found in Europe and North America. Edaphosaurus species measured from to almost in length and weighed over 300 kilograms (660 lb). It was slightly taller and stockier than Dimetrodon, but like its pelycosaur relatives had a small head, and a long tail. == Skull == The head of Edaphosaurus was rather small for its body size. The deep lower jaw likely had powerful muscles and the teeth along the front and sides of its jaws could crop bite-sized pieces from tough plants. The roof of the mouth and the inside of the lower jaw had batteries of peg-like teeth. They were a crushing and grinding surface. Early descriptions suggested that Edaphosaurus fed on molluscs, which it crushed with its teeth plates. However, paleontologists now think that Edaphosaurus ate plants. Lack of wear on the teeth suggests \"limited processing of food\". Earlier members of the Edaphosauridae lacked tooth plates, and ate insects. == Sail == Unlike Dimetrodon's sail, Edaphosaurus had a sail that was wider than its body. Edaphosaurus was possibly the first synapsid to regulate its own body temperature by using the sail on it's back. Dimtrodon probably evolved the sail for a similar reason. == Pelycosaur cousin == Edaposaurus was related to the much larger Dimetrodon. Growth and metabolism Unlike it's pelycosaurid cousin (Dimetrodon), Edaposaurus \"grew distinctly more slowly\" than it's cousin. Edaposaurus probably had a lower metabolism rate than Dimetrodon. This probably made Edaphosaurus really slow. This indicated that Edaphosaurus was cold-blooded. By using its sail and trapping heat from the sun, Edaphosaurus could use this way as regulating its own body temperature. Same with Dimetrodon. == Reference == category:Pelycosaurs",
 "title": "Edaphosaurus"
}