{
 "id": "204324",
 "text": "Hurricane Juan was a category 2 hurricane that hit Halifax and the Nova Scotia area on September 29th, 2003, just after midnight. It caused hundreds of people to have to evacuate their homes as part of a local state of emergency, and there were hurricane warnings issued for the people of Nova Scotia and Prince Edward Island. == How it formed == Hurricane Juan started out as a Tropical Depression near Bermuda. Around 6 hours later it was upgraded to a Tropical Storm. 18 hours after that, it became what we know as the devastating Hurricane Juan. The cause of the hurricane was the temperature of the Atlantic Ocean. Normally, the cool waters of the Atlantic Ocean cause hurricanes to dissipate as they head north, but that day, the water had been 3°C warmer than the average temperature, causing the hurricane to instead, speed up and accelerate, which caused it to hit Halifax and other parts of Nova Scotia with unusually strong gusts of wind reaching over 188 km/h, heavy rain, flying debris, and surf. == Damages == Hurricane Juan killed eight people (directly and indirectly), left over $200 million in damages, and had 800,000 - 900,000 people without power for just under 2 weeks (13 and a half days). Point Pleasant Park lost roughly 70% of its trees due to the strong wind gusts that swept them away. == Retirement == Because of the damage that Juan caused, the name was retired. It was the first time Canada had put in a request to retire a storm name. In the 2009 storm season, Juan was replaced with Joaquin. === Resources === https://novascotia.ca/natr/forestry/programs/ecosystems/juan/#:~:text=The%20Category%202%20hurricane%20hit,sustained%20gusts%20of%20185%20kmph. https://www.nbcnews.com/id/wbna3088270 https://www.ec.gc.ca/ouragans- hurricanes/default.asp?lang=en&n;=B1A7B85A-1 https://www.cbc.ca/news/canada/nova-scotia/hurricane-juan-remembered-as- violent-destructive-storm-1.1871225 https://globalnews.ca/news/3776504/a-look- back-at-hurricane-juan-14-years-after-it-tore-through-atlantic-canada/ Category:2003 Atlantic hurricane season Category:Category 2 Atlantic hurricanes Category:2003 in Canada Category:Retired tropical cyclone names",
 "title": "Hurricane Juan"
}