{
 "id": "204816",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Yonashiro was born in São Paulo, Brazil on November 28, 1950. He joined Japan Soccer League Division 2 club Yomiuri in 1972. The club was promoted to Division 1 in 1978. In 1979, the club won first title JSL Cup. The club won the league champions in 1983 and 1984. The club also won 1984 Emperor's Cup and 1985 JSL Cup. He retired in 1986. He played 239 games and scored 93 goals in the league. He was selected Best Eleven 5 times. In January 1985, Yonashiro obtained his Japanese citizenship. In October, when he was 34 years old, he was selected the Japan national team for 1986 World Cup qualification. At this competition, on October 26, he debuted against South Korea. He played 2 games for Japan in 1985. After retirement, Yonashiro became a manager for Yomiuri in 1986. He led the club to won 1986/87 Japan Soccer League. The club also won 1986 and 1987 Emperor's Cup. In Asia, the club won 1987 Asian Club Championship. He resigned in 1990. In September 1994, he became a manager for Kyoto Purple Sanga as Seishiro Shimatani successor. In June 1996, he became a manager for Kyoto Purple Sanga again as Oscar Bernardi successor. In 2004, he signed with Prefectural Leagues club FC Ryukyu. He promoted the club to Regional Leagues in 2005 and Japan Football League (JFL) in 2006. In 2007, he moved to Regional Leagues club Giravanz Kitakyushu. He promoted the club to JFL in 2008 and J2 League in 2010. He resigned end of 2010 season. In 2013, he signed with JFL club Blaublitz Akita. He promoted the club to new league J3 League in 2014. He resigned end of 2014 season. ==Statistics== |- |1972||rowspan=\"14\"|Yomiuri||rowspan=\"6\"|JSL Division 2||9||5||colspan=\"2\"|-||colspan=\"2\"|-||9||5 |- |1973||18||15||colspan=\"2\"|-||colspan=\"2\"|-||18||15 |- |1974||18||13||||||colspan=\"2\"|-||18||13 |- |1975||18||6||colspan=\"2\"|-||colspan=\"2\"|-||18||6 |- |1976||16||7||2||1||4||0||22||8 |- |1977||17||7||3||1||2||1||22||9 |- |1978||rowspan=\"8\"|JSL Division 1||18||5||2||1||6||2||26||8 |- |1979||18||7||2||2||4||0||24||9 |- |1980||18||4||3||0||2||0||23||4 |- |1981||15||10||5||2||1||0||21||12 |- |1982||18||5||3||0||1||0||22||5 |- |1983||18||2||3||1||3||1||24||4 |- |1984||17||5||4||2||2||1||23||8 |- |1985–86||21||1||2||1||4||2||27||3 239||92||29||11||29||6||297||109 239||92||29||11||29||6||297||109 |} Japan National Football Team Database |- |1985||2||0 |- !Total||2||0 |} ==References== ==Other websites== * Category:1950 births Category:Living people Category:Footballers from São Paulo Category:Brazilian-Japanese footballers Category:Japan international footballers Category:Japanese football managers Category:Japan Soccer League players Category:Tokyo Verdy players",
 "title": "George Yonashiro"
}