{
 "id": "205183",
 "text": "Kingdom Hearts is a role-playing game video game franchise made by Square Enix. The series is a crossover between Square Enix and Disney. Games in the franchise include Kingdom Hearts, Kingdom Hearts: Chain of Memories, Kingdom Hearts II, Kingdom Hearts coded, Kingdom Hearts 358/2 Days, Kingdom Hearts Birth by Sleep, Kingdom Hearts 3D: Dream Drop Distance and Kingdom Hearts III. The reissues for all games were released on PlayStation 4 and Xbox One. == Titles == === Kingdom Hearts === Kingdom Hearts is the first game of the series for the PlayStation 2. It was released in Japan on March 28, 2002 and in North America on September 17, 2002. In the game, Sora, Riku and Kairi end up going separate ways, when their island is invaded by Heartless (monsters who steal people's hearts). Sora wields a Keyblade, teams up Donald Duck and Goofy, and travel around the universe for each worlds, including Alice in Wonderland, The Little Mermaid and The Nightmare Before Christmas. Sora learns that Riku is possessed by Ansem, the creator of Heartless, who unsuccessfully kidnap seven Princesses of Heart (including Kairi), in order to reveal the Keyhole. While Kairi stays at Destiny Islands, Riku and Mickey Mouse are trapped in the Realm of Darkness, and Sora seals the door to prevent Ansem from using it. Kingdom Hearts Final Mix is a reissue of the game that was released only in Japan on December 26, 2002. It has more features than the original, including a battle with Roxas. === Chain of Memories === Kingdom Hearts: Chain of Memories is the second game in the series for Game Boy Advance. It was released in Japan on November 11, 2004 and in North America on December 7, 2004. In the game, Sora arrives at Castle Oblivion and visits each recreations of aforementioned worlds. Each are on different floors, and the old memory is replaced by a new ons. When Sora forgets Kairi, she is replaced by Naminé. Sora meets Organization XIII, the enemy group attempting to erase his memory. Naminé puts Sora to sleep, in order for him to restore all memories for the next year. While following the same path like Sora, Riku attempts to control his ego under Ansem's influence. Kingdom Hearts Re:Chain of Memories is a reissue of the game made for PlayStation 2. It has additional cutscenes and battles. It was released together with Kingdom Hearts II Final Mix + in Japan on March 29, 2007, and was released as a standalone title in North America on December 2, 2008. === Kingdom Hearts II === Kingdom Hearts II is the third game of the series for PlayStation 2. It was released in Japan on December 22, 2005, in North America on March 28, 2006 and in Europe on September 29, 2006. The game begins with Roxas, Hayner, Pence and Olette, living in Twilight Town and planning a summer vacation. As Roxas confronts Axel, Naminé and DiZ, Roxas realizes that the memory will change so he can become whole. Before disappearing, Roxas finds Sora in suspended animation. Sora, Donald and Goofy wake up, and resume their mission on finding Mickey and Riku. They meet the remaining members of Organization XIII and learn that they are beings called Nobodies. When a Heartless steals someone's heart, that person also becomes a Heartless, but if their heart is strong, it becomes a Nobody. Nobodies have no emotions, but want to have hearts again. Xemnas, the leader of Organization XIII, attempts to summon Kingdom Hearts, by defeating the Heartless to release the hearts they hold and allow the Nobodies to retrieve them. This is the reason the Organization wanted Sora to join them. It is later revealed that Roxas and Naminé are the Nobodies of Sora and Kairi, when they lost each hearts from the beginning. Xemnas is the Nobody of Xehanort and Ansem is Xehanort's Heartless. After defeating Xemnas, Sora and his friends return to Destiny Islands. Kingdom Hearts II Final Mix + is a reissue of the game released only in Japan on March 29, 2007. It has more features, including new areas, battles and a secret ending. === coded === Kingdom Hearts coded is the fourth game of the series for mobile phones. It was released in episodes with the first being released only in Japan on November 18, 2008. The game follows Mickey, Donald, Goofy and Jiminy Cricket, discovering a mysterious sentence in the journal and digitizing the contents to find the one responsible. Kingdom Hearts Re:coded is a reissue of the game made for Nintendo DS. It was released in Japan on October 7, 2010, January 11, 2011 in North America, and on January 14, 2011 in Europe. It has additional scenes and a secret ending. === 358/2 Days === Kingdom Hearts 358/2 Days is a fifth game for the Nintendo DS. It was released in Japan on May 30, 2009, and in North America on September 29, 2009. The game begins with Roxas and Organization XIII. Xion, a Nobody created by the Organization and from Sora. Roxas abandons the organization and defeats Xion. The game uses wi-fi for other players to battle each other. Each of them can choose characters for battles. === Birth by Sleep === Kingdom Hearts Birth by Sleep is the sixth game of the series for PlayStation Portable. It was released in Japan on January 9, 2010, and in North America on September 7, 2010. The game is set ten years before Sora begins his journey. It follows a shared path between Terra, Ventus and Aqua, the apprentices of Eraqus and Xehanort. They set out to stop Vanitas, the creator of Unversed. Kingdom Hearts Birth by Sleep Final Mix is a reissue of the game was released only in Japan on January 20, 2011. It has content from the English version and new features, such as a playable Secret Episode and a hint at a possible Kingdom Hearts Birth by Sleep -Volume Two- ===Kingdom Hearts III=== Kingdom Hearts III is the seventh game of the series for PlayStation 4, and Xbox One in 2019. It was originally planned to be released on PlayStation 3 but still cancelled. ===Kingdom Hearts: Melody of Memory=== Kingdom Hearts: Melody of Memory is a rhythm game set after Kingdom Hearts III for Nintendo Switch, PlayStation 4 and Xbox One. It was released on October 14, 2020. === Kingdom Hearts IV === Kingdom Hearts IV is the next upcoming entry in the franchise. == Voice cast == === Japanese Version === ==== Kingdom Hearts (2002) ==== Japanese Voice Actor Role Mayuko Aoki Selphie Tilmitt Takashi Aoyagi King Mickey Mouse Kaori Aso Jasmine Mika Doi Alice, Daisy Duck Yuko Doi Sally, Shock Yuriko Fuchizaki Wendy Darling Tessho Genda Tigger Banjo Ginga Clayton Hiroshi Hatanaka Oogie Boogie Masachika Ichimura Jack Skellington Minoru Inaba Dale Miyu Irino Sora Hideo Ishikawa Squall Leonhart Taro Ishira King Triton Mitsuo Iwata Peter Pan Akira Kamiya Iago Yumi Kakazu Yuffie Kisaragi Jurota Kosugi Tarzan Takehiro Koyama Doorknob Kaneta Kimotsuki Jiminy Cricket Kiyoshi Komiyama Piglet Kazuo Kumakura Geppetto, Mr. Smee Kujira Ursula Yasunori Matsumoto Hercules Sheigeo Matsuzawa Barrel Shinichiro Miki Aladdin Yuji Mitsuya Dr. Frinklestien Mamoru Miyano Riku Yuko Mizutani Minnie Mouse Toshiyuki Morikawa Sephiroth Masakazu Morita Tidus Shuichiro Moriyama Flotsam, Jetsam Ichiro Nagai Philoctetes Kazuya Nakai Wakka Toru Ohira Mayor of Halloween Town Akio Otsuka Ansem Chikao Otsuka Captain Hook Sumie Ozawa Queen of Hearts Maaya Sakamoto Aerith Gainsborough Takahiro Sakurai Cloud Strife Toshiko Sawada Maleficent Kyusaku Shimada Hades Yu Shimaka Goofy Shintaro Sonooka Lock Mayumi Suzuki Jane, Ariel Akira Takarada Jafar Roko Takizawa Chip Yuki Tokiwa Flounder, Pinocchio Risa Uchida Kairi Shigeru Ushiyama White Rabbit Koichi Yamadera Donald Duck, Beast, Genie, Sebastian, Mushu Shun Yashiro Pooh of the Bear ==== Kingdom Hearts: Chain of Memories (2004) ==== Japanese Voice Actor Role Keiji Fujiwara Axel Tatsuya Kando Vexen, Marluxia, Lexaeus Rieko Katayama Larxene === English Version === ==== Main Characters ==== ===== Main Square Enix Characters ===== ====== Kingdom Hearts Birth by Sleep (2010) ====== English Voice Actor Role Jason Dohring Terra Willa Holland Aqua Jesse McCartney Ventus Leonard Nimoy Master Xehanort Haley Joel Osment Vanitas Mark Hamill Master Eraqus ====== Kingdom Hearts (2002) ====== English Voice Actor Role Haley Joel Osment Sora David Gallagher Riku Hayden Panettiere Kairi Billy Zane Ansem, Seeker of Darkness ====== Kingdom Hearts Re:Chain of Memories (2008) ====== English Voice Actor Role Haley Joel Osment Sora David Gallagher Riku Meaghan Martin Namine Richard Epcar Ansem, Seeker of Darkness ====== Kingdom Hearts 358/2 Days (2009) ====== English Voice Actor Role Jesse McCartney Roxas Quinton Flynn Axel Alyson Stoner Xion David Gallagher Riku ====== Kingdom Hearts II (2006) ====== English Voice Actor Role Haley Joel Osment Sora David Gallagher Riku Hayden Panettiere Kairi Jesse McCartney Roxas Brittany Snow Namine ====== Kingdom Hearts Re:Coded (2011) ====== English Voice Actor Role Haley Joel Osment Data- Sora David Gallagher Data-Riku Jesse McCartney Data-Roxas Meaghan Martin Data- Namine ====== Kingdom Hearts 3D Dream Drop Distance (2012) ====== English Voice Actor Role Haley Joel Osment Sora David Gallagher Riku Quinton Flynn Lea Ben Diskin Young Xehanort ====== Kingdom Hearts III (2019) ====== English Voice Actor Role Haley Joel Osment Sora David Gallagher Riku Jesse McCartney Roxas ===== Main Disney Characters ===== ====== Kingdom Hearts Birth by Sleep (2010) ====== English Voice Actor Role Bret Iwan King Mickey Mouse ====== Kingdom Hearts (2002) ====== English Voice Actor Role Wayne Allwine King Mickey Mouse Tony Anselmo Donald Duck Bill Farmer Goofy ====== Kingdom Hearts Re:Chain of Memories (2008) ====== English Voice Actor Role Wayne Allwine King Mickey Mouse Tony Anselmo Donald Duck Bill Farmer Goofy ====== Kingdom Hearts II (2006) ====== English Voice Actor Role Wayne Allwine King Mickey Mouse Tony Anselmo Donald Duck Bill Farmer Goofy ====== Kingdom Hearts Re:coded (2011) ====== English Voice Actor Role Bret Iwan King Mickey Mouse Tony Anselmo Donald Duck Bill Farmer Goofy Phil Snyder Jiminy Cricket ==== Supporting Characters ==== ===== Supporting Disney Characters ===== ====== Classic Disney Characters ====== English Voice Actor Role Russi Taylor Queen Minnie Mouse Tress MacNeille Daisy Duck, Chip Bill Farmer Pluto the Dog Corey Burton Dale ====== Alice in Wonderland ====== English Voice Actor Role Kathryn Beaumont Alice Tress MacNeille Queen of Hearts Corey Burton White Rabbit, Doorknob ====== Hercules ====== English Voice Actor Role Sean Astin Hercules (Kingdom Hearts) Robert Costanzo Philoctetes James Woods Hades ====== Tarzan ====== English Voice Actor Role Tony Goldwyn Tarzan Naia Kelly Jane Porter Brian Blessed Clayton Audrey Wasilewski Terk ====== Winnie the Pooh ====== English Voice Actor Role Jim Cummings Winnie the Pooh, Tigger John Fielder Piglet (Kingdom Hearts) Travis Oates Piglet (Kingdom Hearts II) Ken Sansom Rabbit Andre Stojka Owl Gregg Berger Eeyore Jimmy Bennett Roo Tress MacNeille Kanga Michael Gough Gopher ====== Aladdin ====== English Voice Actor Role Scott Weinger Aladdin Dan Castellaneta Genie Linda Larkin Jasmine Jonathan Freeman Jafar Gilbert Gottfried Iago Frank Welker Abu ====== Pinocchio ====== English Voice Actor Role Seth E. Adkins Pinocchio Tony Pope Geppetto Eddie Carroll Jiminy Cricket (Kingdom Hearts) ====== The Little Mermaid ====== English Voice Actor Role Jodi Benson Ariel Kenneth Mars King Triton Kevin Michael Richardson Sebastian Eli Russell Linnetz Flounder Pat Carroll Ursula Corey Burton Flotsam, Jetsam ====== The Nightmare Before Christmas ====== English Voice Actor Role Chris Sarandon Jack Skellington Kath Soucie Sally, Shock Jeff Bennett Mayor of Halloween Town (Kingdom Hearts), Barrel Jess Harnell Dr. Finklestein, Lock Ken Page Oogie Boogie Glenn Shadix Mayor of Halloween Town (Kingdom Hearts II) ====== Peter Pan ====== English Voice Actor Role Christopher Steele Peter Pan Corey Burton Captain Hook Jeff Bennett Mr. Smee Kathryn Beaumont Wendy Darling == References == Category:Action role-playing video games Category:Dark fantasy video games Category:Superhero video games",
 "title": "Kingdom Hearts"
}