{
 "id": "205208",
 "text": "The Jim Crow laws were a number of laws requiring racial segregation in the Southern United States. These laws were enforced in different states between 1876 and 1965. Jim Crow laws provided a systematic legal basis for segregating and discriminating against African Americans and sometimes Native Americans. The laws first appeared after the Civil War and the Reconstruction Era and were enforced through the mid-20th century. They were about segregating black and white people in all public buildings. ==Overview== Jim Crow was a racist term for a black-looking person. Black people were usually treated worse than white people. This segregation was also done in the armed forces, schools, restaurants, on buses and in what jobs blacks got. In 1954, the US Supreme Court ruled that such segregation in state-run schools was against the US Constitution. The decision is known as Brown v. Board of Education. The other Jim Crow laws were abolished by the Civil Rights Act of 1964Civil Rights Act of 1964 and the Voting Rights Act of 1965. The National Association for the Advancement of Colored People (NAACP) fought against the Jim Crow laws. ==Background== After the Civil War, the U.S. government tried to enforce the rights of ex-slaves in the South through a process called Reconstruction. However, in 1876, Reconstruction ended. By the 1890s, the Southern states' legislatures were all-white again. Southern Democrats, who did not support civil rights for blacks, completely ruled the South. This gave them a lot of power in the United States Congress. For example, Southern Democrats were able to make sure that laws against lynching did not pass. ==Laws against Black Americans== Starting in 1890, Southern Democrats began to pass state laws that took away the rights African Americans had gained. These racist laws became known as Jim Crow laws. For example, they included: * Laws that made it impossible for blacks to vote (this is called disenfranchisement). Since they could not vote, blacks also could not be on juries.Perman, Michael (2001). Struggle for Mastery: Disfranchisement in the South, 1888–1908. University of North Carolina Press. Koussecr, J. Morgan (1974). The Shaping of Southern Politics: Suffrage Restriction and the Establishment of the One-Party South. Yale University Press. * Laws that required racial segregation – separation of blacks and whites. For example, blacks could not: ** Go to the same schools, restaurants, or hospitals as whites ** Use the same bathrooms as whites or drink from the same water fountain In 1896, the United States Supreme Court ruled in a case called Plessy v. Ferguson that these laws were legal. They said that having things be \"separate but equal\" was fine. In the South, everything was separate. However, places like black schools and libraries got much less money and were not as good as places for whites.Logan, Rayford W. (1997). The Betrayal of the Negro from Rutherford B. Hayes to Woodrow Wilson. Da Capo Press. pp. 97-98. Things were separate, but not equal. ==Photo gallery== File:Punta Gorda FL ACL depot doors02.jpg|Door to the \"white\" bathroom at a railroad station (Florida) File:BilliardHallForColored.jpg|Billiard Hall \"for colored\" only (Memphis, 1939) File:Lewis Mountain Negro Area.jpg|\"Negro\" area in Shenandoah National Park (Virginia, 1930s) File:\"Colored\" drinking fountain from mid-20th century with african-american drinking.jpg|\"Colored\" drinking fountain (Oklahoma, 1939) File:Hotel Clark, Beale Street, Memphis TN.jpg|Blacks and whites were not allowed to stay in the same hotels (Memphis, 1939) File:Segregated cinema entrance3.jpg|A black man going into a segregated movie theater through the \"colored\" entrance (Mississippi, 1939) File:WhiteDoorColoredDoor.jpg|\"White\" and \"colored\" doors at a café (North Carolina, 1940) File:North Carolina Jim Crow Laws.JPG|North Carolina law said African-Americans had to sit in the back of buses File:Clinic for Colored, Greenville Mississippi.jpg|Clinic \"for colored\" (Mississippi, 1966) ==References== * \"Jim Crow Laws\". Gale Encyclopedia of U.S. History: Government and Politics. Detroit: Gale, 2009. Student Resources In Context. Web. November 7, 2013. Category:African-American history Category:Racism Category:United States law",
 "title": "Jim Crow laws"
}