{
 "id": "205686",
 "text": "is a former Japanese football player and manager. He played for the Japan national team. ==Biography== Sakakura was educated at and played for Yokkaichi Chuo Technical High School and Juntendo University. After finishing the university, he joined Japan Soccer League side Furuawa Electric (later JEF United Ichihara). In 1992, Japan Soccer League was folded and the club joined new league, J1 League. He moved to Nagoya Grampus Eight in 1995, then Japan Football League side Brummell Sendai in 1996. He finished his playing career in 1998 at his home town club Mind House TC, a Regional Leagues side, after playing for them for one season. On July 27, 1990, Sakakura debuted for the Japan national team against South Korea. He was selected Japan for 1990 Asian Games and played 2 matches. He played 6 games for Japan until 1991. He was also a member of the Japan which won the 1992 Asian Cup, but did not play in the tournament. After the retirement, Sakakura started coaching career at new club Yokohama FC in 1999. He served as an assistant coach. He also managed the club as caretaker in 2001. In 2005, he moved to Kyoto Purple Sanga (later Kyoto Sanga FC) and served as a manager for the youth team. In 2008, he moved to Tochigi SC. He mainly served as assistant coach for top team. In 2014, he was promoted to a manager. He resigned in July 2015. In 2016, he signed with Shimizu S-Pulse and served as a assistant coach. In 2018, he moved to AC Nagano Parceiro and served as a assistant coach. In June, he became a manager and managed the club until end of 2018 season. ==Statistics== |- |1990/91||rowspan=\"2\"|Furukawa Electric||rowspan=\"2\"|JSL Division 1||20||0||||||5||0||25||0 |- |1991/92||12||1||||||1||0||13||1 |- |1992||rowspan=\"3\"|JEF United Ichihara||rowspan=\"3\"|J1 League||colspan=\"2\"|-||||||9||0||9||0 |- |1993||25||0||0||0||0||0||25||0 |- |1994||8||0||0||0||2||0||10||0 |- |1995||Nagoya Grampus Eight||J1 League||18||0||0||0||colspan=\"2\"|-||18||0 |- |1996||rowspan=\"2\"|Brummell Sendai||rowspan=\"2\"|Football League||26||0||3||0||colspan=\"2\"|-||29||0 |- |1997||26||0||2||0||5||0||33||0 135||1||5||0||22||0||162||1 135||1||5||0||22||0||162||1 |} Japan National Football Team Database |- |1990||5||0 |- |1991||1||0 |- !Total||6||0 |} ==References== ==Other websites== * Category:1967 births Category:Living people Category:Footballers from Mie Prefecture Category:Japan international footballers Category:Japanese football managers Category:J1 League players Category:Japan Soccer League players Category:JEF United Chiba players Category:Nagoya Grampus players Category:Vegalta Sendai players Category:1988 AFC Asian Cup players Category:1992 AFC Asian Cup players Category:AFC Asian Cup-winning players Category:Yokohama FC managers",
 "title": "Yuji Sakakura"
}