{
 "id": "20619",
 "text": "Rocky is a 1976 American sports drama movie. It was written by, and starred, Sylvester Stallone. The movie is about a man living in Philadelphia, Pennsylvania, who is trying to become a great boxer. It won three Academy Awards and was ranked #78 in AFI's 100 Years... 100 Movies list. It was followed by 5 sequels, the most recent came out in 2006. The movie was made on a budget of less than $1 million. It was shot in 28 days. Many people liked the movie. It turned Stallone into a major star. ==Cast== * Sylvester Stallone as Robert \"Rocky\" Balboa, Sr., an enforcer for a loan shark by day and a semi- pro boxer by night. He is given the chance at the heavyweight title. * Talia Shire as Adrian Pennino, Rocky's love interest; a quiet pet store clerk who falls in love with Rocky and supports him through his training. * Burt Young as Paulie Pennino, Adrian's brother; a meat-packing plant worker by trade, Paulie lets Rocky train in the freezer. * Carl Weathers as Apollo Creed, Rocky's opponent and heavyweight champion. The character was based on real- life boxing great Muhammad Ali. * Burgess Meredith as Mickey Goldmill: Rocky's manager and trainer, a former bantamweight fighter from the 1920s and the owner of the local boxing gym. * Thayer David as George Jergens: the fight promoter who has \"promoted fights all over the world\". * Joe Spinnell as Tony Gazzo, loan shark and Rocky's employer. Boxer Joe Frazier has a cameo appearance in the movie. Due to the movie's low budget, members of Stallone's family played minor roles. Michael Dorn made his acting debut as Creed's bodyguard. ==Awards== Rocky received ten Academy Awards nominations in nine categories, winning three: Award Result Nominee Best Picture Robert Chartoff and Irwin Winkler Best Director John G. Avildsen Best Actor Sylvester Stallone Best Actress Talia Shire Best Original Screenplay Sylvester Stallone Best Supporting Actor Burgess Meredith Best Supporting Actor Burt Young Best Film Editing Richard Halsey and Scott Conrad Best Music (Original Song) for Gonna Fly Now Bill Conti Carol Connors Ayn Robbins Best Sound Mixing Harry Warren Tetrick (posthumous) William McCaughey Lyle J. Burbridge Bud Alper The Directors Guild of America awarded Rocky its annual award for best movie of the year. It was nominated for the BAFTA Award for Best Screenplay. The Writers Guild of America Award selected it as the 78th best screenplay of all time. ==Sequels== * Rocky II (1979) * Rocky III (1982) * Rocky IV (1985) * Rocky V (1990) * Rocky Balboa (2006) * Creed (2015) * Creed II (2018) ==References== ==Other websites== * Category:1976 drama movies Category:1970s sports movies Category:American sports drama movies Category:Best Picture Oscar Category:Movies set in Philadelphia Category:United States National Film Registry movies Category:Movies directed by John G. Avildsen Category:Screenplays by Sylvester Stallone Category:Rocky movies Category:Movies set in the 1970s",
 "title": "Rocky"
}