{
 "id": "206132",
 "text": "Elizabeth Helen Blackburn is an Australian-American molecular biologist who won the Nobel Prize in Physiology or Medicine in 2009. == Work == Blackburn won the Nobel Prize with Americans Jack Szostak and Carol Greider for their work on chromosomes. They researched the way that telomeres protect the chromosomes in cells. Chromosomes are the part of the cell that carries genetic information. Telomeres are the ends of chromosomes. Blackburn outlined the DNA sequence of an organism called Tetrahymena. Blackburn discovered that telomeres can help prevent cancer and other diseases. Blackburn is the first Australian woman to win a Nobel Prize. She also received the Albert Lasker Basic Medical Research Award in 2006.\"Blackburn, Elizabeth Helen.\" World Book Advanced, World Book, 2017. Accessed 12 Apr. 2017.\"Elizabeth H. Blackburn.\" Scientists: Their Lives and Works, UXL, 2006. Student Resources in Context, link.galegroup.com/apps/doc/K2641500021/SUIC?u=palo88030&xid=18a6d07d. Accessed 12 Apr. 2017. == Life == Blackburn was born in Hobart, Tasmania on November 26, 1948. She was the daughter of Harold and Marcia Blackburn. She went to Broadford girls school in Launceston, and later Melbourne University High School. She studied biochemistry at the University of Melbourne, completed her PhD at the University of Cambridge, Darwin College, and did postdoctoral work at Yale University. She is now Professor of Biology and Physiology at the University of California, San Francisco. She married John W. Sedat in 1975, and has one child, Ben Sedat. She became a United States citizen in 2003. == Achievements == She won the Nobel Prize in Physiology or Medicine in 2009. On January 26, 2010, the Australian Government made Blackburn a Companion of the Order of Australia. In 2007, she won the Albert Lasker Medical Research Award in Basic Medical Research in 2007, and was named one the top 100 most influential people by Time magazine.\"Elizabeth Blackburn.\" Newsmakers, vol. 1, Gale, 2010. Student Resources in Context. Accessed 12 Apr. 2017. == References == Category:1948 births Category:Living people Category:Australian biologists Category:Australian Nobel Prize winners Category:Order of Australia Category:People from Hobart Category:American biologists Category:American molecular biologists",
 "title": "Elizabeth Blackburn"
}