{
 "id": "206474",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Takagi was born in Yasu on November 21, 1980. After dropped out from Kyoto Sangyo University, he joined J1 League club Shimizu S-Pulse in June 2000. However he could hardly play in the match until 2002. In 2003, he played many matches as left side back until summer. However he could not play many matches from summer 2003. In August 2004, he moved to Vissel Kobe on loan. He became a regular player as center back of three backs defense. In 2005, he returned to Shimizu S-Pulse. He became a regular player as defensive midfielder and played with Teruyoshi Ito for the position. From summer 2005, he became a regular player as center back. He played with mainly Toshihide Saito or Ryuzo Morioka for the position and the club won the 2nd place at the Emperor's Cup. From 2006, he played as center back with Naoaki Aoyama for 3 seasons and the club won the 2nd place at the 2008 J.League Cup. In 2009, he moved to Gamba Osaka. In 2009, although he could not play many matches in league competition, he played many matches in Emperor's Cup and won the champions. In 2010, he became a regular player and played many matches as center back with Sota Nakazawa. The club also won the 2nd place in J1 League. However his opportunity to play decreased behind Satoshi Yamaguchi in 2011. In 2012, he moved to Vissel Kobe again. However he could not play many matches and the club was relegated to J2 League end of 2012 season. In 2013, he moved to Oita Trinita. Although he played many matches as center back of three backs defense, the club was relegated to J2 from 2014. In 2014, he became a captain and played many matches as regular center back. In 2015, he moved to J2 club FC Gifu and played many matches as center back. In 2016, he moved to J1 club Júbilo Iwata. However he could hardly play in the match. In 2017, he moved to Thailand and joined Air Force Central. In 2018, he returned to Japan and joined his locals club MIO Biwako Shiga in Japan Football League. He retired end of 2018 season. On August 20, 2008, Takagi debuted for Japan national team against Uruguay. He played 5 games for Japan until 2009. ==Statistics== |- |2000||rowspan=\"5\"|Shimizu S-Pulse||rowspan=\"5\"|J1 League||0||0||0||0||0||0||colspan=\"2\"|-||0||0 |- |2001||5||0||0||0||0||0||colspan=\"2\"|-||5||0 |- |2002||0||0||0||0||3||0||colspan=\"2\"|-||3||0 |- |2003||16||0||4||0||1||0||3||2||22||2 |- |2004||2||0||0||0||1||0||colspan=\"2\"|-||3||0 |- |2004||Vissel Kobe||J1 League||13||0||1||0||0||0||colspan=\"2\"|-||14||0 |- |2005||rowspan=\"4\"|Shimizu S-Pulse||rowspan=\"4\"|J1 League||33||1||5||0||8||1||colspan=\"2\"|-||46||2 |- |2006||32||0||3||0||6||0||colspan=\"2\"|-||41||0 |- |2007||34||0||3||0||5||0||colspan=\"2\"|-||42||0 |- |2008||34||1||2||1||7||1||colspan=\"2\"|-||43||3 |- |2009||rowspan=\"3\"|Gamba Osaka||rowspan=\"3\"|J1 League||9||0||5||0||0||0||2||0||16||0 |- |2010||31||2||3||0||2||0||7||0||43||2 |- |2011||13||1||1||0||2||0||3||0||19||1 |- |2012||Vissel Kobe||J1 League||9||0||1||0||6||0||colspan=\"2\"|-||16||0 |- |2013||rowspan=\"2\"|Oita Trinita||J1 League||21||0||2||0||1||0||colspan=\"2\"|-||23||0 |- |2014||J2 League||40||1||1||0||colspan=\"2\"|-||colspan=\"2\"|-||41||1 |- |2015||FC Gifu||J2 League||29||2||0||0||colspan=\"2\"|-||colspan=\"2\"|-||29||2 |- |2016||Júbilo Iwata||J1 League||0||0||3||1||3||0||colspan=\"2\"|-||29||2 |- |2018||MIO Biwako Shiga||Football League||25||2||2||0||colspan=\"2\"|-||colspan=\"2\"|-||27||2 346||10||36||2||45||2||15||2||442||16 346||10||36||2||45||2||15||2||442||16 |} Japan National Football Team Database |- |2008||3||0 |- |2009||2||0 |- !Total||5||0 |} ==References== ==Other websites== * Category:1980 births Category:Living people Category:Footballers from Shiga Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:Shimizu S-Pulse players Category:Vissel Kobe players Category:Gamba Osaka players Category:Oita Trinita players Category:FC Gifu players Category:Júbilo Iwata players",
 "title": "Kazumichi Takagi"
}