{
 "id": "206640",
 "text": ", also known as NJPW, is Japanese professional wrestling promotion.Cagematch.de, New Japan Pro Wrestling ; retrieved 2012-2-29. NJPW is the largest wrestling promoter in Japan. NJPW has working agreements with other promoters, including: World Wrestling Entertainment, World Championship Wrestling, Total Nonstop Action Wrestling, and PRIDE Fighting Championships. ==History== NJPW was founded in 1972 by Kanji Inoki. Since 1999, Tatsumi Fujinami has been president. In 2012, Inoki continued to be known for innovation in the business. On December 23, 2023, former NJPW president Takami Ohbari stepped down from the role of president. It was then announced that Hiroshi Tanahashi would become the new President and Representative Director of New Japan Pro-Wrestling. == Champions == === Current champions === ==== Men's ==== Championship Current champion(s) Date won Reign Notes IWGP World Heavyweight Championship Zack Sabre Jr. October 14, 2024 1 Defeated Tetsuya Naito at King of Pro-Wrestling. IWGP Global Heavyweight Championship Yota Tsuji January 4, 2025 1 Defeated David Finlay at Wrestle Kingdom 19. IWGP Junior Heavyweight Championship El Desperado January 4, 2025 5 Defeated Douki at Wrestle Kingdom 19. NEVER Openweight Championship Konosuke Takeshita January 4, 2025 1 Defeated Shingo Takagi in a Winner Takes All match, also for Takeshita's AEW International Championship at Wrestle Kingdom 19. Strong Openweight Championship Gabe Kidd May 11, 2024 1 Defeated Eddie Kingston at Resurgence. NJPW World Television Championship El Phantasmo January 4, 2025 1 Defeated Ren Narita, Jeff Cobb, and Ryohei Oiwa in a four-way match at Wrestle Kingdom 19. ==== Women's ==== Championship Current champion(s) Date won Reign Notes IWGP Women's Championship Mayu Iwatani April 23, 2023 1 Defeated Mercedes Moné at All Star Grand Queendom. Strong Women's Championship Mercedes Moné June 30, 2024 1 Defeated Stephanie Vaquer in a Winner Takes All match also for Moné's AEW TBS Championship at Forbidden Door. ==== Tag team ==== Championship Current champion(s) Date won Reign Notes IWGP Tag Team Championship The Young Bucks January 5, 2025 2 Defeated United Empire (Great-O-Khan and Jeff Cobb) and Los Ingobernables de Japon (Tetsuya Naito and Hiromu Takahashi) in a three-way tag team match to win the vacant titles at Wrestle Dynasty. IWGP Junior Heavyweight Tag Team Championship Ichiban Sweet Boys ) January 4, 2025 1 Defeated Intergalactic Jet Setters (Kevin Knight and Kushida), Catch 2/2 (TJP and Francesco Akira), and Bullet Club War Dogs (Clark Connors and Drilla Moloney) in a Four-way Tokyo Terror ladder match at Wrestle Kingdom 19. Strong Openweight Tag Team Championship West Coast Wrecking Crew December 15, 2024 1 (1, 1) Defeated Grizzled Young Veterans (James Drake and Zack Gibson) at Strong Style Evolved. NEVER Openweight 6-Man Tag Team Championship Hiroshi Tanahashi, Toru Yano and Oleg Boltin June 16, 2024 2 (6, 6, 2) Defeated Los Ingobernables de Japón (Yota Tsuji, Bushi and Hiromu Takahashi) at New Japan Soul: Night 1. ==== Tournaments ==== Tournament Winner Date won Location Notes G1 Climax Zack Sabre Jr. August 18, 2024 Tokyo Defeated Yota Tsuji in the finals. ==Related pages== * Sports in Japan * New Japan Pro Wrestling roster ==References== ==Other websites== * New Japan Pro Wrestling website Category:1972 establishments in Japan Category:New Japan Pro-Wrestling el:Αντόνιο Ινόκι#New Japan Pro Wrestling",
 "title": "New Japan Pro-Wrestling"
}