{
 "id": "207269",
 "text": "The Green Mile is a 1999 American drama movie. It was released on December 10, 1999 in the United States. It stars Tom Hanks, David Morse, Bonnie Hunt, and Michael Clarke Duncan. It was directed by Frank Darabont. ==Plot summary== In Louisiana in 1935, inmates at the Cold Mountain Correctional Facility call Death Row \"The Green Mile\" because of the dark green linoleum that tiles the floor. Paul Edgecomb (played by Tom Hanks) is the head guard on the Green Mile when a new inmate arrives: John Coffey (played by Michael Clarke Duncan), who is to be executed for the murder of two young girls. Despite his size and the fearsome crimes for which he's serving time, Coffey seems to be a kind and well-mannered person who behaves more like an innocent child than a hardened criminal. Soon Edgecomb and two of his fellow guards, Howell (played by David Morse) and Stanton (played by Barry Pepper), notice something odd about Coffey: he's able to perform what seem to be miracles of healing, like bringing a dead mouse back to life, leading them to wonder just what sort of person he could be, and if he could have done the crimes with which he was charged. == Etymology == The word \"Green mile\" is said to metaphorically represent the short distance of land (therefore the use of the word \"mile\") that a prisoner needs to walk before he or she is executed .green mile - from the Urban dictionary == Awards== 1999 Academy Awards\"The 72nd Academy Awards.\" The New York Times - Breaking News, World News & Multimedia. . *Nominated - Best Performance by an Actor in a Supporting Role — Michael Clarke Duncan *Nominated - Best Picture — David Valdes, Frank Darabont *Nominated - Best Sound Mixing — Robert J. Litt, Elliot Tyson, Michael Herbick, Willie D. Burton *Nominated - Best Adapted Screenplay — Frank Darabont 2000 Academy of Science Fiction, Fantasy & Horror Films *Won - Best Supporting Actor — Michael Clarke Duncan *Won - Best Supporting Actress — Patricia Clarkson *Won - Best Action/Adventure/Thriller Film *Nominated - Best Director — Frank Darabont *Nominated - Best Music — Thomas Newman 2000 Broadcast Music Incorporated Film & TV Awards *Won - Film Music Award — Thomas Newman 2000 Black Reel Awards *Won - Theatrical - Best Supporting Actor — Michael Clarke Duncan 2000 Blockbuster Entertainment Awards *Won - Favorite Actor - Drama — Tom Hanks *Nominated - Favorite Supporting Actor - Drama — Michael Clarke Duncan *Nominated - Favorite Supporting Actress - Drama — Bonnie Hunt 2000 Bram Stoker Awards *Nominated - Best Screenplay — Frank Darabont 2000 Broadcast Film Critics Association Awards *Won - Best Screenplay, Adaptation — Frank Darabont *Won - Best Supporting Actor — Michael Clarke Duncan *Nominated - Best Film 2000 Chicago Film Critics Association Awards *Nominated - Best Supporting Actor — Michael Clarke Duncan *Nominated - Most Promising Actor — Michael Clarke Duncan 2000 Directors Guild of America *Nominated - Outstanding Directorial Achievement in Motion Pictures — Frank Darabont 2000 Golden Globe Awards *Nominated - Best Supporting Actor - Motion Picture — Michael Clarke Duncan 2000 NAACP Image Awards *Nominated - Outstanding Supporting Actor in a Motion Picture — Michael Clarke Duncan 2000 MTV Movie Awards *Nominated - Best Breakthrough Male Performance — Michael Clarke Duncan 2000 Motion Picture Sound Editors (Golden Reel Awards) *Nominated - Best Sound Editing - Dialogue and ADR — Mark A. Mangini, Julia Evershade *Nominated - Best Sound Editing - Effects and Foley — Mark A. Mangini, Aaron Glascock, Howell Gibbens, David E. Stone, Solange S. Schwalbe 2000 People's Choice Awards *Won - Favorite All- Around Motion Picture *Won - Favorite Dramatic Motion Picture 2001 Science Fiction and Fantasy Writers of America (Nebula Award) *Nominated - Best Script — Frank Darabont 2000 Screen Actors Guild Awards *Nominated - Outstanding Performance by a Cast *Nominated - Outstanding Performance by a Male Actor in a Supporting Role — Michael Clarke Duncan ==References== == Other websites == *Official website * *The Green Mile Script * Category:1999 crime drama movies Category:American crime drama movies Category:1990s American fantasy movies Category:American prison movies Category:1990s English-language movies Category:Movies based on books Category:Movies set in Louisiana Category:Movies set in the 1930s Category:Movies about capital punishment Category:People's Choice Award winners Category:Warner Bros. movies",
 "title": "The Green Mile (movie)"
}