{
 "id": "207230",
 "text": "Guadalajara is a city in Mexico. Over three and a half million people live there. It is the third-largest city in Mexico. It is the capital of the Mexican state of Jalisco. It is in Western Mexico and is over above sea level. Guadalajara is a major Latin American city in terms of industry, tourism, and culture. A famous soccer team called Chivas Guadalajara plays there. In 2011 Guadalajara hosted the Panamerican Games and Plans to bid for the 2028 Summer Olympic Games. In 2005 Guadalajara was called the City of Culture 2005. Guadalajara is home to a largely celebrated culture of \"New Modern Mexico\". Guadalajara is also known for Mariachi (a form of folk music) and Baile Folklórico, traditional Mexican dances. ==Etymology== The first name comes from Nahuatl, Atemaxac by Atemajac Valley and means \"place of the down waters\". Site when was founded Guadalaxara by Spaniards. The municipal seat is the city of Guadalaxara, although both the town and municipality are commonly referred to as simply \"Guadalajara\". The city is named after Guadalajara, Spain, is Moorish arabic etymology. The conquistador named the city in honor of the conqueror of western Mexico, , who was born in , Spain, which is derived from Moorish Arabic (), which means 'Valley of the Stones', or 'Fortress Valley'. == History == It spans a period of 475 years. After the victory at Tonalá (which occurred on March 25, 1530), Nuño de Guzmán enjoyed the tribute and homage of all the communities in the Atemajac Valley, where the capital of Jalisco is located today. The conquistador even aspired to be named by Charles I of Spain as the first Marquis of the Tonalá Valley. However, the city had four settlements before settling in the capital. Initially, it was in Nochistlán, in the place known as El Zapote, today called San Juan. It was founded by Cristóbal de Oñate on January 5, 1532, who had been commissioned by Nuño de Guzmán to establish a city that would serve to secure his conquests. The Villa de Guadalajara was founded by 42 residents; the name Guadalajara was taken in memory of the Spanish city of the same name, the birthplace of Nuño de Guzmán. The town didn't last long on this site. With the consent of Guzmán, Juan de Oñate (son of Cristóbal de Oñate), Miguel de Ibarra, and Sancho Ortiz, they planned to move it on May 19, 1533. Thus, by August 8, 1533, Guadalajara was in its second settlement. == Geography == ===Climate=== Guadalajara City is in the tropics. But because its elevation is so high, it has a subtropical highland climate (Cwb in the Köppen climate classification). This means temperatures are warm or mild year-round. It is a lot wetter in the summer than in the winter. Some parts of the city get frost in the winter. == Education == The University of Guadalajara, founded in 1791, is one of the highest ranking universities in Latin America. The public schools and public universities: * Universidad de Guadalajara The city hosts campuses of several private schools, including: * Universidad La Salle * Universidad Panamericana * Universidad UNIVER * ITESO, Jesuit University of Guadalajara * Monterrey Institute of Technology and Higher Education * * Universidad del Valle de México * * * Universidad del Valle de Atemajac == Culture == The cultural movement in Guadalajara is one of the strongest in the Americas. The city has one of the most extensive cultural agendas on the continent, in addition to the interest of the government, the university, and private institutions in exploiting the city's cultural attributes. The city exhibits works by international artists and is a showcase for international cultural events whose sphere of influence reaches most countries in the Americas, as well as the southwestern United States. Guadalajara is characterized as one of Mexico's iconic cities. This means that its identity has given the country a certain iconographic image, even though mariachi, charrería, and tequila do not originate in Guadalajara, but rather from nearby locations or regions. Over time, however, the city has been stereotyped as the land of these cultural manifestations and has adopted them in its role as the capital of the state of Jalisco. However, Guadalajara is the birthplace of cultural expressions such as the \"syrup dance\" (also known as \"syrup dance\"), created from flamenco influences in both dance and costume acquired during the Viceroyalty of New Spain. It is also considered one of the richest Mexican cities in artisanal and gastronomic diversity (and formerly in the textile sector). == Sports == The city has two first division soccer teams: Club Deportivo Guadalajara (Chivas) and Club Atlas (known as Rojinegros or Zorros). In the Mexican Second Division, there are Club Deportivo Oro and Club Leones Negros of the University of Guadalajara. In the third division, there is Club Deportivo Nacional. In the past, it had other teams, such as the now-defunct Club Social y Deportivo Jalisco. ==Related pages== * Jalisco ==References== == Other websites ==",
 "title": "Guadalajara"
}