{
 "id": "207332",
 "text": "Headscarves are scarves covering most or all of the top of a woman's hair and her head. Headscarves may be worn for a variety of purposes, such as for warmth, for sanitation, for fashion or social distinction; with religious significance, to hide rampant baldness, out of modesty, or other forms of social convention. == Types of headscarves == Headscarves may have specific religious significance. Observant married Orthodox Jewish women, for example, are required to cover their hair, often employing scarves (or sometimes wigs) for the purpose. Headscarves were also worn by married Christian women in Medieval Europe, and even among some of the unmarried. This headcovering habit is better known as a wimple in English. Islamic law says that women should dress in a special way. This dress code applies to women and adolescent girls, but not to children. Headscarves and veils used for Muslim religious dress include: * burqa * chador * niqab * dupatta * See also List of types of sartorial hijab Note that the Arabic word hijab refers to modest behaviour in general, and pertains to men and women, but it is sometimes used in other languages to describe the Muslim headscarf, also known as a khimar. Some English speakers use the word \"babushka\" (grandma in Russian) to indicate the headscarf tied below the chin, as commonly worn in Eastern Europe. In most parts of Eastern Europe, headscarves are used mainly by elderly women (grandmothers) and this led the incorrect use of the \"babushka\" term. In Russia they are worn by women when they go to church to show their convictions to Russian Orthodoxy. A plain red or scarlet headscarf was worn by female commissars and other women aligning themselves with Bolshevism in times of Russian Revolution and civil war. A head tie is a west and southern African women's head scarf, specifically an elaborate ornamental head covering. The Keffiyeh is commonly used by Muslim men. Ancien Egyptiant men wore a Nemes headcloth. ==Pictures of headscarfs== Image:Casol square silk scarf as head scarf.jpg|New York fashion model wearing a square silk Foulard type scarf by French designer Casol. Image:Åmlibunad skaut.jpg|A scarf worn as part of a Norwegian national costume. Image:Bandana.jpg|A Portuguese soccer fan wears a kerchief both as bandana and an expression of her club loyalty. Image:Khotan- melikawat-chicas-d02.jpg|A Uyghur woman from the Xinjiang province of China wears a scarf in the popular 'Italian' fashion, with the ends tied behind her head. Image:Khotan-mercado-chicas-d01.jpg|Uyghur girls in Khotan,Xinjiang, China. The scarves are longer than the European ones and cover both their heads and shoulders. Image:Girls in Kargil.jpg|A group of girls in Kargil, Ladakh. Image:Iraqi girl smiles.jpg|An Iraqi girl near Basra. Image:Kalkan market 2.JPG|A woman wearing traditional headscarf in the 'babooska' style, in Kalkan, Turkey. Image:Jaipur-India_n001.jpg|Women from Jaipur, India wearing Salwar kameez and dupatta. File:Izabela_Tomița_3542m.jpg|A Romanian woman in traditional dress. Image:Mpondo Lady.jpg|A Mpondo woman from South Africa. Image:Simphiwe Dana Wien2007b.jpg|South African Dana Wien in a headscarf. Image:On the beach galleryfull.jpg|Gambian women in their traditional head ties. Image:Prokudin-Gorskii-08.jpg|Russian girls in their traditional head scarfs. Image:Gorskii 03964u.jpg|Bashkirian woman in traditional costume, photographed by Sergey Prokudin-Gorsky. Image:Chemotherapy with acral cooling.jpg|A cancer victim in a head scarf after losing her hair due to Chemotherapy. Image:Moksha girls.jpg|Scarved Moshka girls in traditional costumes. File:Komi peoples.jpg|Scarved Komi girls in traditional costumes. They, like the Russians, Bashkirians and Moshka need to keep their heads warm in the winter weather. ==Related pages== * Hijab * chador * Niqab * Morphsuits ==References== Category:Headgear Category:Islamic dress",
 "title": "Head scarf"
}