{
 "id": "207553",
 "text": "Count Dracula is the title character of Bram Stoker's 1897 horror novel Dracula. He was a very strong influence on vampires in later works of fiction. Aspects of the character are believed by some to have been inspired by the 15th-century Wallachian prince Vlad the Impaler, who was also known as Vlad Dracula, and by Sir Henry Irving, an actor for whom Stoker was a personal assistant. One of Dracula's most famous powers is that he can turn others into vampires by biting them. == Meeting Jonathan Harker == At the beginning of the book, Dracula tricks a lawyer named Jonathan Harker into coming to Transylvania and signing things saying he can own land in London. When Harker cuts himself shaving, Dracula tries to drink his blood but runs away when he sees Harker has a cross. Dracula locks Harker in his castle, kidnaps a child and feeds it to three women and feeds the child’s mother to wolves when she comes back for her child. When Harker writes to his fiancée Mina, to tell her, Dracula steals and burns the letter. Dracula also dresses up as Harker so he can do horrible things and have people think it’s Harker who did them. Harker realizes that Dracula sleeps during the day so he tries to kill Dracula with a shovel during the day but Dracula survives. Then Harker escapes Dracula’s castle. == The Demeter == Dracula has himself buried in dirt inside of crates so he can be taken to England in a ship called the Demeter. Dracula transforms into a wolf and kills the crew before escaping the ship and going to England. == Murdering Lucy Westenra == Dracula transforms into a bat and bites a woman named Lucy Westenra. Dracula also tells R.M. Renfield that he’ll feed him all the bugs he wants if Renfield will be his sidekick. Dracula flies through Lucy’s window and drinks her blood every night so Dr. Abraham Van Helsing keeps her alive with Blood transfusions. Van Helsing keeps Lucy’s window closed so Dracula steals a wolf from the zoo and has it destroy Lucy’s window so he can get into her house. Lucy’s mother has a heart attack and dies. Dracula runs away from Lucy because she has garlic. Lucy dies of having lost too much blood. Lucy then turns into an Undead monster called a vampire that Dracula controls. == Attacking Mina Harker == Dracula tells Renfield that he’ll feed him all the bugs and mice he wants if he invites him into Dr. John Seward’s house and Renfield does. Then Dracula goes to Dr. Seward’s house and secretly bites Mina Harker. When Renfield realizes that Dracula bit Mina, he attacks Dracula but Dracula wins. Then Dracula attacks Mina in front of her husband Jonathan Harker, bites her, cuts his own chest and makes her drink his blood to turn her into a vampire. Then Dracula turns into a bat and flies away. == Running away from Van Helsing == Dracula uses Mina to spy on Dr. Van Helsing and the others since he can see what she sees and know what she knows but then Mina figures out she can use the same power to spy on him. Jonathan Harker finds out Dracula is using the alias Count de Ville and finds and destroys most of Dracula’s boxes. When the Harkers and Van Helsing find Dracula, Dracula threatens them but jumps out a window but the Sun comes up so Dracula can’t transform. Dracula puts on a straw hat to protect himself from daylight and gets a ship to take him back to Transylvania. == Return to Transylvania == Dracula is taken back to Transylvania in a box of dirt but as soon as someone opens the box, he kills him. Dracula also tricks a group of Gypsies into taking his box (with him inside it) back to the castle and fighting anyone who tries to stop them. == Death == When Van Helsing and Mina go to Transylvania, Dracula sends the Weird Sisters to convince Mina to help them kill Van Helsing but then the Sun rises and they teleport to their graves. Van Helsing stabs each of them through the heart and cuts their heads off so they can die. Van Helsing’s American friend Quincy Morris is badly hurt opening Dracula’s box but the Gypsies run away when they realize there’s a person inside it. Dracula starts to wake up but then Jonathan Harker cuts Dracula’s head off and Quincy stabs Dracula’s heart. Dracula dies and turns to dust. Then Quincy dies but is happy that Dracula is dead. == Origin Story == Van Helsing says he believes that Dracula is “the Voivode Dracula who won his name against the Turk” and that Dracula beat the Turks by going to the Scholomance and learning magic and because of that he was cursed that after he died, he had to come back as an Undead being called a Nosferatu or a vampire and he lost some (but not all) of his memories from when he was alive. And because of the curse, he stopped caring about trying to be good instead of evil and he could only learn from experience. == Adaptations == In the movie Dracula, he was played by Béla Lugosi. A lot of later versions of Dracula were based on Lugosi’s version. Category:Fictional characters",
 "title": "Count Dracula"
}