{
 "id": "207591",
 "text": "Civil law, as a system of law, is different from common law, which is another system of law. The origin of the civil law system of law is ancient Rome. The civil law system is used in countries such as Germany, France, many countries which were colonies of those European countries before, and in many Asian countries. It also been adopted in Latin America as well as in many parts of Asia and many African countries. There are about 150 countries worldwide that use mainly civil law systems. About 80 countries use the common law system. == History == Civil law's very name indicates where it started. Called is was the civil law during the Roman Republic and the later Roman Empire., pp. 3–5 It started in the 2nd century BC. By the end of the Republic, about 27 BC, a number of experts in the law called jurists (not to be confused with judges) became prominent. They were mostly members of the upper classes. Jurists provided their services to counsel people and advise judges who presided over trials. An important feature of Roman law was it did not depend on legal precedent by earlier cases but on the facts and merits of the current case. In the 6th century, Justinian compiled the Corpus Juris Civilis, a simplified code of Roman laws. It was used by the Byzantine Empire. The medieval Church based much of its Canon law on Roman law. Germanic law, known as leges barbarorum, written between the 5th and 9th centuries borrows from the Roman civil law. Civil law developed in Europe during the middle age, about the same time common law developed in England. During the Renaissance, England's common law system borrowed from civil law. While the common law was the traditional law system in England by this time, Equity is based on civil law. Other features were borrowed and used in maritime law and in wills, trusts and estates. The Napoleonic Code, which borrowed much from Roman law, influenced many of the legal systems in Europe and was the foundation for Prussian civil law. == Features == Civil law is based on rules and concepts that come from Roman law. The rules and principles of civil law are found in codes which are available to both citizens and legal professionals. These legal codes clearly explain everyone's rights and duties. Unlike common law, in civil law judges have a different role. In criminal cases they establish the facts of a case and use the applicable codes. In many countries, judges also bring the formal charges. Unlike common law, legal precedent is not used to rule in later cases. In this system the legislature passes statutes that are then applied by the courts. Judges look to the statutes instead of precedent in deciding a case. == Subgroups == The term civil law comes from English legal scholarship and is used in English-speaking countries to lump together all legal systems of the jus commune tradition. However, legal comparativists and economists promoting the legal origins theory prefer to subdivide civil law jurisdictions into four distinct groups: * Napoleonic: France, Italy, the Netherlands, Spain, Chile, Belgium, Luxembourg, Portugal, Brazil, Mexico, other CPLP countries, Macau, former Portuguese territories in India (Goa, Daman and Diu and Dadra and Nagar Haveli), Malta, Romania, and most of the Arab world[which?] when Islamic law is not used. Former colonies include Quebec (Canada) and Louisiana (U.S.). *Germanistic: Germany, Austria, Switzerland, Latvia, Estonia, Roman-Dutch, Czech Republic, Russia, Lithuania, Croatia, Hungary, Serbia, Slovenia, Slovakia, Bosnia and Herzegovina, Greece, Ukraine, Turkey, Japan, South Korea, Taiwan and Thailand *Nordic: Denmark, Finland, Iceland, Norway, and Sweden == Related pages == * Biblical law * Roman law * Sharia law * Canon law * Napoleonic Code * Maritime law == References == == Other websites == * Civil Law vs. Common Law * Egypt: Law and the Legal System in Ancient Egypt * Ancient Greek law system * The Oldest Known Tablet Containing a Legal Code (2,100 BCE – 2,050 BCE) Category:Types of law",
 "title": "Civil law"
}