{
 "id": "207756",
 "text": "Twitter, officially known as X since July 2023, is a social networking and microblogging service. Users of any device with an internet connection and a web browser can send and read messages, called \"tweets\", on X. For years, tweets could be up to 140 characters long, then doubled to 280 characters in November 2017. Tweets appear on the user's profile webpage. Tweets can usually be read by anyone, but senders can also keep messages private. Private tweets only go to their list of friends. Users may subscribe to tweets from other people. This is called following, and subscribers are known as followers. As of late 2009, users can also follow lists of authors. All users can send and receive tweets using the X website. They can also use other applications that work with X on smartphones. Twitter by Short Message Service (SMS) is available in certain countries. Using X is free, but sending or getting tweets by SMS may cost money. The website is based in San Francisco, California. X also has servers and offices in San Antonio, Texas and Boston, Massachusetts, and soon in Salt Lake City, Utah. As Twitter, the service became very popular worldwide since Jack Dorsey created it in 2006. It had more than 126 million active users as of 2019. It is sometimes described as the \"SMS of the Internet\". On April 25, 2022, the Twitter board of directors agreed to Elon Musk's US$44 billion offer to buy the company. On October 27, 2022, Elon Musk took control of the company and fired CEO Parag Agarwal along with other top executives. ==History== Twitter started at a podcasting company Odeo. The company board members had a \"daylong brainstorming session\". During the meeting, Jack Dorsey introduced the idea of one person using an SMS service to communicate with a small group. At first, they called this project \"twttr\". It fit the five-character length of American SMS short codes and sounded like \"Flickr\". At first, the developers planned to use \"10958\" as a short code. Later they changed it to \"40404\" because it was easier to remember and type. Dorsey sent the first Twitter message at 9:50 PM Pacific Standard Time (PST) March 21, 2006. The first tweet was, \"just setting up my twttr.\" The first version of Twitter was only for Odeo employees to use. They opened the full version for anyone to use on July 15, 2006. In October 2006, Biz Stone, Evan Williams, Dorsey, and other members of Odeo started a new company called Obvious Corporation. Obvious Corporation bought Odeo and all of its property–including Odeo.com and Twitter.com–from the investors and shareholders. Twitter became its own separate company in April 2007. Twitter started becoming very popular after the 2007 South by Southwest (SXSW) festival. During the event, Twitter usage increased from 20,000 tweets per day to 60,000. The Twitter company set up two very large computer screens in the hallways at the conference. These screens only showed Twitter messages. Hundreds of people at the conference checked on what each other were doing by looking at the many tweets. Panelists and speakers talked about Twitter. Bloggers at SXSW described it to others in a very positive way. Reaction at the festival was very good. Blogger Scott Beale said that Twitter \"absolutely rul[ed]\" SXSW. Social software researcher Danah Boyd said Twitter \"own[ed]\" the festival. Twitter staff won the festival's Web Award prize. They said, \"we'd like to thank you in 140 characters or less. And we just did!\" right|200px|thumb|Previous Twitter logo, used until September 14, 2010 On September 14, 2010, Twitter changed the site design and added a new logo. On June 5, 2012, the Twitter logo was modified slightly and the text in the Twitter logo was removed. On October 4, 2010, Evan Williams announced that he would not be CEO any more. Dick Costolo became the new CEO. He had been COO of Twitter. Williams will stay with the company and work on plans for the future of Twitter. In April 2022, Elon Musk became the company's owner after buying it for USD $44 billion. On July 24, 2023, Musk announced that he was changing the name of Twitter to X. He replaced the blue bird logo with an X. On October 27, 2023, X (formerly Twitter) introduced new Premium subscription tiers: Basic, Premium, and Premium+, offering features like editing posts, verification, reduced ads, ad revenue sharing, and an ad-free experience. ==Overview== Technology author Steven Johnson described the basic way Twitter works. He called it \"remarkably simple.\" Following is an important part of Twitter as a social network. Users' Twitter home pages show all of the tweets from people they follow. The tweets appear from newest to oldest. Johnson said: ===People who use Twitter=== In 2009, Twitter was mainly used by older adults who might not have used other social sites before Twitter. Jeremiah Owyang studies social media. He said, \"Adults are just catching up to what teens have been doing for years.\" Only 11% of Twitter's users were 12 to 17 years old in September 2009. This may be because Twitter first gained popularity in businesses and news media that attract more older people. Many famous people such as Shaq, Britney Spears, and Ashton Kutcher are Twitter users. In June 2009, more women than men used Twitter—53% women; 47% men. Only 5% of users made 75% of all tweets. Also, New York City had the most Twitter users. This is a brief summary of Twitter users in September 3, 2009. *Total users: 27 million *Age: 63% of Twitter users were less than 35 years old *Race: 60% of Twitter users were Caucasian. 16% were African American. That is higher than other Internet sites. Hispanic users were 11%. *Income: 58% of Twitter users had a total household income of at least $60K. The United States has the most Twitter users, followed by Japan, India and Brazil. African Americans are more likely to use Twitter more than any other racial group.Why Social Media is a Source of Strength for Black Americans ===Popularity=== Twitter is one of the 10 most visited websites in the world. It had more than 100 million users as of April 2010. At the start of February 2019, Twitter had 126 million users who used the service daily. ===Logging in=== People can use software from other companies to access Twitter. These programs are called third-party applications. The Twitter company changed the way this works on August 31, 2010. Now applications must use OAuth to connect to Twitter. This method means that users do not have to give their passwords to the third-party applications. Changing the login system to OAuth did cause some problems. Using OAuth had been optional and programs used to be able to ask for usernames and passwords. However, now third-party applications that try to use a username and password do not work at all. The Twitter company said that using OAuth will give users \"increased security and a better experience.\" ==Technology== ===Interface=== On April 30, 2009, Twitter changed the way it looks on the web. They added a search bar and a space on the right side of the page with \"Trending Topics\". That space shows the most common phrases appearing in messages. Biz Stone explained that all messages are instantly indexed and explained the results of the change. The Trending Topics has made Twitter something \"unexpectedly important — a discovery engine for finding out what is happening right now.\" ===Service problems=== Sometimes Twitter users experience a problem with the service and cannot access the website. They cannot read or write tweets but only see the Fail Whale image created by Yiying Lu, Twitter worked well approximately 98% of the time in 2007. That is about six full days of no service. The problems were particularly noticeable during events popular with the technology industry such as the 2008 Macworld Conference & Expo keynote address. *May 2008, Twitter's new engineering team made changes to the structure of Twitter to handle the amount of growth. Problems with stability caused the service to stop working sometimes and forced Twitter to cancel some features for a short time. *August 2008, Twitter stopped free SMS services for users in the United Kingdom and for approximately five months instant messaging support via a XMPP bot was listed as being \"temporarily unavailable\". *June 12, 2009, there was a serious problem with the unique number that identifies each tweet. This was called a possible \"Twitpocalypse\". (This is a combination of Twitter and apocalypse). The number that labels each tweet went beyond the limit of 32-bit signed integers. That limit was 2,147,483,647 messages. While Twitter itself was not affected, some third-party clients could not access recent tweets. Software developers made Patches quickly. However, some iPhone applications had to wait for approval from the App Store. *September 22, 2009, the identifier went past the limit for 32-bit unsigned integers (4,294,967,296 total messages). This broke some third-party applications again. *August 6, 2009, Twitter and Facebook both suffered a denial-of-service attack. This stopped the Twitter website from working for several hours. The attacks were actually directed at one pro-Georgian user around the anniversary of the 2008 South Ossetia War, rather than the sites themselves. *December 17, 2009, a hacking attack replaced the website's welcoming screen for almost one hour. Users saw an image of a green flag and the words \"This site has been hacked by Iranian Cyber Army\". So far there is no proof of any connection between the hackers and the government of Iran. ===Open source=== Twitter developed several software projects to improve their own service. The company shared these as open source software. Some of these software projects are related to databases, such as the Gizzard Scala framework and a distributed graph database called FlockDB. ==t.co== t.co is a service created by Twitter to make URLs shorter. It can only be used for links that people post to Twitter. It is not available for other uses. Eventually all links on Twitter will use t.co. The company hopes that the service will protect users from harmful websites. They will also use it to keep a record of people clicking on links in tweets. ===History of t.co=== Twitter had used the services from other sites such as TinyURL and bit.ly. They began trying their own way of making URLs shorter for direct messages in March 2010. They used the domain, twt.tl, before they bought the t.co domain. The company is using these accounts to test the service on the main site: @TwitterAPI, @rsarver, and @raffi. On September 2, 2010, Twitter sent an email message to users to explain that they were starting to open the service to them. ==Other== Twitter can also be used as an amateur and professional news source. ==Related pages== * Censorship by Twitter ==Notes== == References == == Other websites == * ; Official blog Category:2006 establishments in the United States Category:Companies based in San Francisco Category:Twitter Category:American software companies Category:Microblogging services Category:Meta Platforms applications",
 "title": "Twitter"
}