{
 "id": "208078",
 "text": "The 2008-09 NHL season was the 91st season of the National Hockey League. It was the first season since before to the 2004-05 lockout in which every team played each other at least once during the season, following three seasons where teams only played against two divisions in the other conference (one division at home and one on the road.) It began on October 4, with the regular season ending on April 12. The Stanley Cup playoffs ended on June 12, with the Pittsburgh Penguins taking the championship. The Montreal Canadiens hosted the 57th NHL All-Star Game at the Bell Centre on January 25, 2009, part of the Canadiens' 100th season celebration.Montreal to host '09 All-Star Game ==Regular season== ===Final standings=== GP = Games Played, W = Wins, L = Losses, OTL = Overtime/Shootout Losses, GF = Goals For, GA = Goals Against, Pts = Points. ====Eastern Conference==== ====Western Conference==== ====Conference standings==== =====Tiebreaking procedures===== In the event of a tie in points in the standings at the end of the season, ties are broken using the following tiebreaking procedures. The higher ranked team is the one with: # The greater number of games won. # The greater number of points earned in games between the tied clubs. # The greater differential between goals for and against for the entire regular season. ===Statistical leaders=== ====Scoring leaders==== GP = Games played; G = Goals; A = Assists; Pts = Points; +/- = Plus/Minus; PIM = Penalty Minutes Player Team GP G A Pts +/- PIM Pittsburgh Penguins 82 35 78 113 +17 80 Washington Capitals 79 56 54 110 +8 72 Pittsburgh Penguins 76 33 70 103 +3 76 Detroit Red Wings 81 32 65 97 +34 22 New Jersey Devils 82 45 49 94 +30 24 Atlanta Thrashers 79 43 48 91 -12 50 Anaheim Ducks 81 25 66 91 +5 121 Calgary Flames 81 35 54 89 -2 37 Boston Bruins 82 25 63 88 +25 70 Washington Capitals 82 22 66 88 +16 46 ====Leading goaltenders==== GP = Games Played; TOI = Time On Ice (minutes); W = Wins; L = Losses; OT = Overtime/Shootout Losses; GA = Goals Against; SO = Shutouts; Sv% = Save Percentage; GAA = Goals Against Average Player Team GP TOI W L OT GA SO Sv% GAA Boston Bruins 54 3,258:49 36 11 7 114 5 .933 2.10 Columbus Blue Jackets 60 3,604:58 33 19 7 135 10 .917 2.25 Minnesota Wild 71 4,088:03 37 24 8 159 8 .923 2.33 Anaheim Ducks 45 2,446:26 23 15 1 95 4 .920 2.33 Vancouver Canucks 54 3,181:05 33 13 7 124 9 .920 2.34 Nashville Predators 52 2,999:12 29 15 4 119 7 .917 2.38 Chicago Blackhawks 41 2,407:15 24 8 7 96 2 .917 2.39 New Jersey Devils 40 2,355:56 25 13 1 94 2 .917 2.39 New Jersey Devils 31 1,813:35 19 9 3 73 5 .916 2.41 St. Louis Blues 57 3,214:54 27 21 7 129 6 .916 2.41 ==Playoffs== ===Playoff seeds=== After the regular season, the standard of 16 teams qualified for the playoffs. The San Jose Sharks won the Presidents' Trophy for having the best record in the league, at 117 points. Division champions maintain their relative ranking during the entire playoffs while the remaining teams get reseeded below them after each round. ====Eastern Conference==== # Boston Bruins - Northeast Division and Eastern Conference regular season champions, 116 points # Washington Capitals - Southeast Division champions, 108 points # New Jersey Devils - Atlantic Division champions, 106 points # Pittsburgh Penguins - 99 points (45 wins) # Philadelphia Flyers - 99 points (44 wins) # Carolina Hurricanes - 97 points # New York Rangers - 95 points # Montreal Canadiens - 93 points* *Montreal finished with exactly the same record as the Florida Panthers (including number of wins), but garnered more points (the Canadiens with six, the Panthers with three) in the four game season series between them, to earn the 8th spot. ====Western Conference==== # San Jose Sharks - Pacific Division champions and Western Conference regular season champions; President's Trophy winners, 117 points # Detroit Red Wings - Central Division champions, 112 points # Vancouver Canucks - Northwest Division champions, 100 points # Chicago Blackhawks - 104 points # Calgary Flames - 98 points # St. Louis Blues - 92 points (10 points head-to-head) # Columbus Blue Jackets - 92 points (3 points head-to-head) # Anaheim Ducks - 91 points ===Playoff bracket=== In each round, the highest remaining seed in each conference is matched against the lowest remaining seed. The higher-seeded team is awarded home ice advantage. In the Stanley Cup Finals, home ice is determined based on regular season points. Each best-of-seven series follows a 2-2-1-1-1 format: the higher- seeded team will play at home for games 1 and 2 (plus 5 and 7 if necessary), and the lower-seeded team will be at home for game 3, 4 and 6 (if necessary). ==NHL awards== Presidents' Trophy: San Jose Sharks Prince of Wales Trophy: Pittsburgh Penguins Clarence S. Campbell Bowl: Detroit Red Wings Art Ross Trophy: Evgeni Malkin, Pittsburgh Penguins Bill Masterton Memorial Trophy: Steve Sullivan, Nashville Predators Calder Memorial Trophy: Steve Mason, Columbus Blue Jackets Conn Smythe Trophy: Evgeni Malkin, Pittsburgh Penguins Frank J. Selke Trophy: Pavel Datsyuk, Detroit Red Wings Hart Memorial Trophy: Alexander Ovechkin, Washington Capitals Jack Adams Award: Claude Julien, Boston Bruins James Norris Memorial Trophy: Zdeno Chara, Boston Bruins King Clancy Memorial Trophy: Ethan Moreau, Edmonton Oilers Lady Byng Memorial Trophy: Pavel Datsyuk, Detroit Red Wings Lester B. Pearson Award: Alexander Ovechkin, Washington Capitals Maurice 'Rocket' Richard Trophy: Alexander Ovechkin, Washington Capitals NHL Plus/Minus Award: David Krejci, Boston Bruins Roger Crozier Saving Grace Award: Tim Thomas, Boston Bruins Vezina Trophy: Tim Thomas, Boston Bruins William M. Jennings Trophy: Tim Thomas and Manny Fernandez, Boston Bruins Lester Patrick Trophy: Mark Messier, Mike Richter and Jim Devellano NHL Lifetime Achievement Award: Jean Beliveau ===NHL All Star Team=== First All-Star Team * Forwards: Alexander Ovechkin • Evgeni Malkin • Jarome Iginla * Defencemen: Mike Green • Zdeno Chara * Goaltender: Tim Thomas Second All-Star Team * Forwards: Zach Parise • Pavel Datsyuk • Marian Hossa * Defencemen: Nicklas Lidstrom • Dan Boyle * Goaltender: Steve Mason ===NHL All-Rookie team=== * Forwards: Patrik Berglund • Kris Versteeg • Bobby Ryan * Defencemen: Drew Doughty • Luke Schenn * Goaltender: Steve Mason ==Related pages== * Season structure of the NHL * 2009 Stanley Cup playoffs * 2008 NHL Entry Draft * 2007-08 NHL season * 2008-09 NHL transactions * 2009 NHL Winter Classic * 57th National Hockey League All-Star Game * 2008 in sports * 2009 in sports * Victoria Cup ==References== * ==Other websites== Category:National Hockey League seasons",
 "title": "2008–09 NHL season"
}