{
 "id": "20817",
 "text": "Yasser ArafatAlso spelled Yassir Arafat (). He was born Mohammed Abdel-Raouf Arafat al-Qudwa al-Husseini (). He is also known by the kunya Abu `Ammar (). (24 August 1929 – 11 November 2004) Is well known as the first leader of the Palestinian people. He was Chairman of the Palestine Liberation Organization (PLO) from 1969 to 2004. In 1993, he also became president of the Palestinian National Authority (PA). Arafat was born in Jerusalem, Gaza or Cairo.Most sources indicate Cairo as Arafat's place of birth, but others list his birthplace as Jerusalem or Gaza. See here and here for more information. He studied civil engineering at Cairo University. He worked as an engineer in Kuwait. In 1994, Yasser Arafat won the Nobel Peace Prize along with two others.The others were Yitzhak Rabin and Shimon Peres. They got the prize for their peace efforts in the Middle East when Palestinian National Authority was formed.NobelPrize.org, \"Yasser Arafat\"; retrieved 2012-9-19. The views of him are somewhat divided. Some people see him as a hero, who fought for the cause of the Palestinian people. Others see him as a terrorist, who promoted the use of violence to reach his goals. Still others think he was a charismatic leader, but he made too many concessions to the Israeli government. Yasser died in Paris from a cerebral hemorrhage. The next day he was buried at his compound, with a hasty funeral in Ramallah on November 12. He was reburied on November 13, about 3:30 am. He was buried in a special casket, with the hope of being reburied in Jerusalem one day when an independent State of Palestine with East Jerusalem as its capital would be established. ==Related pages == * List of Nobel Prize winners by country ==Notes== ==References== == Other websites == * Life in Palestine after Arafat, Situation worse, not what Bush and Sharon planned * The Real Obstacle to Peace was Ariel Sharon, not Yasser Arafat * Death of Arafat, burial and reburial November 13 2004 * .theguardian.com/world/2012/nov/01/israel-acknowledges-killing-palestinian- deputy Israel acknowledges killing Yasser Arafat's deputy Khalil al-Wazir in 1988 raid Category:1929 births Category:2004 deaths Category:Asian military people Category:Civil engineers Category:Palestinian Muslims Category:Palestinian nationalists Category:Presidents of the Palestinian National Authority Category:Politicians from Cairo Category:Presidents (government) Category:Time People of the Year Category:Cairo University alumni Category:Presidents of the State of Palestine Category:20th-century presidents in Asia",
 "title": "Yasser Arafat"
}