{
 "id": "208210",
 "text": "Hapoel Tel Aviv Football Club () is an Israeli Football club based in Tel Aviv and created in 1926. Their city rival is Maccabi Tel Aviv F.C.. The club is second behind Maccabi Tel Aviv in the number of national titles. They play in the Bloomfield Stadium. ==History== The club was founded on 31 May 1927. There were two other attempts to found the club. In 1927 they united with Allenby F.C and created the club in its modern form. The club is part of the Hapoel Sport Organisation, which is connected with the Histadrut trade union. Until the independence of Israel in 1948 the club often won the Palestine League (5 titles). After the independence Hapoel joined the Israeli League. In 1988-1989 they were relegated to the second league for the first time of their existence. Next year they came back. Since 1948 they have won 8 national titles. Overall they have won 13 national titles and 13 State Cups. They have had many big successes in international football, for example the victory in the first Asian Club Championship in 1967, beating Red Bull Salzburg and Benfica in the 2010-11 Champions League, and finishing first in their group in the 2010-11 Europa League. ==Honours== ===Domestic=== *Israeli Championships **Winners: 1934, 1935, 1938, 1940, 1943, 1957, 1966, 1969, 1981, 1986, 1988, 2000, 2010 *State Cup **Winners: 1928, 1934, 1937, 1938, 1939, 1961, 1972, 1983, 1999, 2000, 2006, 2007, 2010 2011, 2012 *Toto Cup **Winners: 2002 ===International=== *Asian Club Championship **Winners 1967 *UEFA Champions League **Group Stage: 2010-11 *UEFA Europa League **Knockout Round: 2009-10 ==Current squad== As of 30 January 2020 ===Foreigners 2019–20=== Only up to six non-Israeli nationals can be in an Israeli club, but only five can play at the same time on the pitch. Those with Jewish ancestry, married to an Israeli, or have played in Israel for an extended period of time, can claim a passport or permanent residency which would allow them to play with Israeli status. * Marvin Peersman * Emmanuel Boateng * Felipe Rodríguez * Michael Olaha ==References== Category:Israeli football clubs Category:Tel Aviv Category:1926 establishments in Asia Category:1920s establishments in Israel",
 "title": "Hapoel Tel Aviv F.C."
}