{
 "id": "208398",
 "text": "Silvio Spann (born 21 August 1981) is a former Trinidad and Tobago football player. He played for Wrexham and Trinidad and Tobago national team. ==Club statistics== Club performance Club performance Club performance League League Cup Cup Total Total Season Club League Apps Goals Apps Goals Apps Goals Trinidad and Tobago Trinidad and Tobago Trinidad and Tobago League League Trinidad and Tobago Cup Trinidad and Tobago Cup Total Total 2000 Doc's Khelwalaas Pro League 2001 W Connection Pro League Italy Italy Italy League League Coppa Italia Coppa Italia Total Total 2001–02 Perugia Serie A 0 0 0 0 2002–03 Sambenedettese Serie C1 3 0 3 0 Trinidad and Tobago Trinidad and Tobago Trinidad and Tobago League League Trinidad and Tobago Cup Trinidad and Tobago Cup Total Total 2003 W Connection Pro League 2004 Croatia Croatia Croatia League League Croatian Cup Croatian Cup Total Total 2004/05 Dinamo Zagreb Prva HNL 0 0 0 0 Japan Japan Japan League League Emperor's Cup Emperor's Cup Total Total 2005 Yokohama FC J2 League 20 3 0 0 20 3 Trinidad and Tobago Trinidad and Tobago Trinidad and Tobago League League Trinidad and Tobago Cup Trinidad and Tobago Cup Total Total 2006 W Connection Pro League 2007 England England England League League FA Cup FA Cup Total Total 2007–08 Wrexham League Two 9 1 1 0 10 1 2008–09 Conference 13 0 2 0 15 0 2009–10 Country Trinidad and Tobago Trinidad and Tobago Country Italy Italy 3 0 3 0 Country Croatia Croatia 0 0 0 0 Country Japan Japan 20 3 0 0 20 3 Country England England 22 1 3 0 25 1 Total Total Total 45 4 3 0 48 4 ==National team statistics== Trinidad and Tobago national team Trinidad and Tobago national team Trinidad and Tobago national team Year Apps Goals 2002 3 0 2003 7 0 2004 8 1 2005 9 0 2006 2 0 2007 5 1 2008 1 0 2009 6 0 Total 41 2 ===International goals=== :Scores and results list T&T;'s goal tally first. # Date Venue Opponent Score Result Competition 1 2004-12-12 Tortola, British Virgin Islands 4–0 4–0 Digicel Caribbean Cup 2005 2 2007-06-07 California, United States 1–0 1–2 2007 CONCACAF Gold Cup ==References== Category:1981 births Category:Living people Category:Trinidad and Tobago footballers",
 "title": "Silvio Spann"
}