{
 "id": "20854",
 "text": "PHP (PHP: Hypertext Preprocessor; used to stand for Personal Home Page) is a scripting language that helps people make web pages more interactive by allowing them to do things that can't be done with technologies running on the visitors computer. PHP code is run on the web server (the website's computer). It is called a 'preprocessor because it builds the information before sending it to the computer that visits the web page. A website programmed with PHP can have pages that are password protected. A website without PHP or similar technologies can't do this, as the visitor can find a way to access the page. For example, by finding where the password is stored. Standard PHP file extensions are (but not only): .php, .php3, and .phtml, but a web server can be set up to use any extension.http://www.w3schools.com/php/php_intro.asp Retrieved on 30 October, 2007 Its structure was influenced by many languages like C, Perl, Java, C++, and even Python. It is considered to be free software by the Free Software Foundation. Multiple PHP frameworks are available today, such as Laravel, Symfony, CodeIgniter, and Phalcon, which offer developers a more structured approach via pre-built components and the ability to streamline the process. Laravel is currently the only PHP framework used in the the development of more than 1,723,068 websites globally. == History == PHP was first created by Rasmus Lerdorf in 1995. It is now developed and improved by a large team of people. Its name at first stood for Personal Home Page, but it was later changed to PHP: Hypertext Preprocessor; using its old acronym . == Example == An example Hello World program: It is common to put PHP code inside a HTML document (or any other type of data), for example: Hello World '; ?> == References == == Other websites == * Official PHP website * PHP Tutorial for beginners * PHP Tutorial for beginners *[./Https://webtopfree.blogspot.com/2021/07/php-what-is-php-in-hindi- technology.html https://webtopfree.blogspot.com/2021/08/How-to-learn-PHP.html ] what is PHP * PHP.orgPHP tutorials for beginners Category:Object-oriented programming languages Category:Web design Category:Cross-platform software",
 "title": "PHP"
}