{
 "id": "208541",
 "text": "Lester Bowles \"Mike\" Pearson (April 23, 1897 – December 27, 1972) was the eighteenth Prime Minister of Canada from 1963 to 1968. He won the Nobel Peace Prize in 1957 for organizing the first peacekeeping force. As Prime Minister, Pearson's government created universal health care and the Canada Pension Plan. They also created the Canada Student Loan Program, the Order of Canada, and changed the flag of Canada to the one with maple leaves. Pearson kept Canada from fighting in the Vietnam War and de facto stopped capital punishment from being used in Canada. Many people think he is one of the most important Canadians of the 20th century.MacDonald, L. Ian. \"The Best Prime Minister of the Last 50 Years — Pearson, by a landslide\", Policy Options, June–July 2003. Accessed 3 April 2014.S. Azzi, N. Hillmer. \"Ranking Canada's best and worst prime ministers\",Maclean's, October 2016. Accessed 27 May 2017 == Early life == Pearson was born in Newtonbrook, Ontario, the son of Edwin Arthur Pearson, a Methodist minister and Anne Sarah Bowles. He went to the University of Toronto and Oxford University. Pearson was ambassador to the United States and the United Nations. He played for the Oxford University Ice Hockey Club while on a scholarship at Oxford University. == Political career == Pearson entered politics in 1948, as Minister of External Affairs in the Liberal government of Louis St. Laurent. He became leader of the Liberal Party in 1958. He lost two elections as leader, until winning a third to become Prime Minister in 1963. His government brought in social programs and new standards for workers. Pearson signed the Canada-United States Automotive Agreement, also called the Auto Pact. He retired in 1968. The next Prime Minister was Pierre Trudeau. ==Death== Pearson died from liver cancer in Ottawa, Canada, aged 75. ==References== ==Other websites== Category:1897 births Category:1972 deaths Category:Canadian ice hockey players Category:Presidents of the United Nations General Assembly Category:Canadian Nobel Prize winners Category:Ice hockey people from Ontario Category:Officers of the Order of the British Empire Category:Order of Canada Category:Politicians from Toronto Category:Privy Councillors (Canada) Category:Leaders of the Opposition (Canada)",
 "title": "Lester B. Pearson"
}