{
 "id": "208577",
 "text": "Drosophila is a genus of small flies, belonging to the family Drosophilidae They are often called called fruit flies, vinegar flies or wine flies. Many species linger around overripe or rotting fruit. There are many species in this genus, and the genus is split down into sub-genera. The adults may feed on nectar, and may lay their eggs on or near decaying fruit. The details differ greatly from species to species. == Species == Their distribution is world-wide. In Britain alone more than 5000 species have been recorded.Shorrocks B. 1972. Drosophila. London: Ginn, p79. ISBN 0-602-21665-6 The largest number of species is in the Hawaiian Islands. Several species of Drosophila (in particular, D. melanogaster) were used in genetics research. It is a common model organism in developmental biology. The genus has more than 1,500 species,Bächli G. 1999–2006. TaxoDros : The database on taxonomy of Drosophilidae. and has varied appearance, behaviour, and breeding habitats. Other species which have been widely investigated include D. pseudoobscura (used by Dobzhansky in field research) and D. subobscura, used in the UK as a laboratory Drosophila. Sturtevant at one time had 42 species of Drosophila in his lab for examination.Sturtevant A.H. 1939. On the subdivisions of the genus Drosophila. Genetics 25, 137. == Life cycle == Drosophila vary widely in their reproductive capacity. Those such as D. melanogaster that breed in large, scarce resources have ovaries that mature 10–20 eggs at a time, and can be laid together in one place. Others, which breed in common but less nutritious places (such as leaves), may only lay one egg each day. The eggs have one or more respiratory filaments near the front end; the tips of these extend above the surface and allow oxygen to reach the embryo. Larvae feed not on vegetable matter but on the yeasts and microorganisms present on the decaying surface of leaves or fruits. Development time varies widely between species (between seven and more than 60 days) and depends on factors such as temperature, breeding substrate, and crowding. == Related genera == Drosophila has a number of close relatives, and some may actually be within its genus. *Lordiphosa is a genus which is very similar to Drosophila.Hu Y.-g.; Toda M.J.; Watabe H-a. 1999. A revision of the Lordiphosa tenuicauda species-group, with descriptions of eight new species from China (Diptera: Drosophilidae). Entomological Science 2: 105–119. Its origin seems to be in S.E. Asia, probably China or Sri Lanka. *Scaptomyza is a genus which has most probably evolved from Drosophila on the Hawaiian islands.Kaneshiro K.Y; Gillespie R.G. & Carson, H.L. 1995. Chromosomes & male genitalia of Hawaiian Drosophila, in Evolution on a hot spot archipelago (eds Wagner W.L. & Funk V.A.) Smithsonian, p57. ISBN 1-56098-463-5 \"The Hawaiian Drosophilidae are monophyletic\".DeSalle R. 1995. Molecular approaches to biogeographic analysis of Hawaiian Drosophilidae. In Evolution on a hot spot archipelago (eds Wagner W.L. & Funk V.A.) Smithsonian, p7289. There are a large number of species (at least 270 have been described). This suggests the species evolved on some of the earlier islands in the Hawaiian chain which are no longer above water. == References == == Other websites == * Fly Base. FlyBase is a comprehensive database for information on the genetics and molecular biology of Drosophila. It includes data from the Drosophila Genome Projects and data from publications. * Berkeley Drosophila Genome Project *D. melanogaster *D. pseudoobscura *D. simulans",
 "title": "Drosophila"
}