{
 "id": "208882",
 "text": "Shaquille Rashaun \"Shaq\" O'Neal (born March 6, 1972 in Newark, New Jersey) is an American retired professional basketball player. He had a 19 year career in the National Basketball Association (NBA) for the Orlando Magic, Los Angeles Lakers, Miami Heat, Phoenix Suns, Cleveland Cavaliers and Boston Celtics. He is often considered one of the most well-known players in the history of the NBA. He stands at and weighs , making him one of the heaviest players to ever play in the NBA. He has recently gotten his jersey retired by the Orlando Magic, making him one of the only players to have 3 jerseys retired. ==Basketball career== Before playing in the NBA, O'Neal played college basketball at Louisiana State University. Throughout his 18 year career, O'Neal has used his size and strength to help him play well. O'Neal won a scoring title, an MVP and three championships with the Los Angeles Lakers; he later won a championship with the Miami Heat. He first played for the Orlando Magic and later for the Phoenix Suns. O'Neal won a gold medal with the 1996 Dream Team. O'Neal is currently the oldest player in the NBA and is the only one of the 50 Greatest NBA players, as chosen in 1996, to still be playing in the NBA. He has scored the most points of anyone still in the NBA, and the fifth-most of any NBA player ever. He also one of the best shooters in the history of the NBA, and has led the league in that category ten times. He has been named All-NBA and an All-Star quite a few times. He retired from the NBA on June 1, 2011 and held a press conference on June 3, 2011 to officially announce his retirement. After Shaq's college career he had 1 child. ==Music, TV and movie career== O'Neal has appeared in several films and music videos, often as himself. As an actor, O'Neal starred in movies such as Blue Chips and Kazaam. As a rapper, he released five studio albums and 1 compilation album. His first album, Shaq Diesel, was released in 1993. It received platinum certification from the RIAA. He rapped on the song \"2 Bad\" on Michael Jackson's album HIStory. He later performed three songs on the Kazaam soundtrack. O'Neal also rapped on Aaron Carter's 2001 hit single \"That's How I Beat Shaq\". He has hosted two TV shows, one where he helps kids lose weight and another where he competes against athletes from other sports. ==Personal life== O'Neal is a Muslim. ==References== ==Other websites == *Profile on Cavaliers official website * Category:1972 births Category:Living people Category:Actors from Jersey City, New Jersey Category:Actors from Newark, New Jersey Category:African-American actors Category:African-American basketball players Category:African-American musicians Category:African-American wrestlers Category:All Elite Wrestling people Category:American basketball players Category:American dance musicians Category:American DJs Category:American electronic musicians Category:American movie actors Category:American movie producers Category:American Muslims Category:American professional wrestlers Category:American television producers Category:Boston Celtics players Category:Businesspeople from Jersey City, New Jersey Category:Businesspeople from Newark, New Jersey Category:Centers (basketball) Category:Cleveland Cavaliers players Category:Interscope Records artists Category:Los Angeles Lakers players Category:Medalists at the 1996 Summer Olympics Category:Miami Heat players Category:Musicians from Jersey City, New Jersey Category:Musicians from Newark, New Jersey Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association broadcasters Category:National Basketball Association players with retired numbers Category:Olympic gold medalists for the United States Category:Orlando Magic players Category:Participants in American reality television series Category:Phoenix Suns players Category:Rappers from New Jersey Category:Sportspeople from Jersey City, New Jersey Category:Sportspeople from Newark, New Jersey Category:Television personalities from New Jersey",
 "title": "Shaquille O'Neal"
}