{
 "id": "209185",
 "text": "The Lyside Sulphur or Guayacan SulphurJames A. Scott (1986). The Butterflies of North America. Stanford University Press, Stanford, CA. (Kricogonia lyside) is a North American and South American butterfly. It is in the family Pieridae. In seasons with heavy monsoons, this butterfly is seen in large migrations. These migrations are common in Texas. They are less common in the southwest. It sometimes lives in southern Florida. == Description == The coloring of the Lyside Sulphur varies. The upper side of the wings is pale yellow. It usually has a black bar on the top edge of the hind wing (the bottom wing). There is normally a bright yellow patch near the base (where the wing connects to the body) of the fore wing (the top wing). Some individuals also have black borders along the top edges of the fore wing. The underside of the wings varies. They vary from a greenish color to bright yellow to almost white.Jim P. Brock and Kenn Kaufman (2003). Butterflies of North America. Houghton Mifflin, New York, NY. Greener individuals have a whitish vein in the center of the hind wing. The fore wing has a bright yellow basal patch.Rick Cech and Guy Tudor (2005). Butterflies of the East Coast. Princeton University Press, Princeton, NJ. The wingspan is 1.5 to 2.38 in. (3.8 to 6 cm.).\"Lyside Sulphur,\" http://www.butterfliesandmoths.org/species?l=1446 == Similar species == Similar species in the Lyside Sulphur's range include Queen Alexandra's Sulphur (Colias alexandra), the Cloudless Sulphur (Phoebis sennae), and the Statira Sulphur (Phoebis statira). Queen Alexandra's Sulphur has more yellow on the underside of the fore wing. It has a whitish spot in the center of the hind wing.Bob Stewart, Priscilla Brodkin, and Hank Brodkin (2001). Butterflies of Arizona. West Coast Lady Press. The Cloudless Sulphur is larger. It is much more yellow. The Statira Sulphur has a more yellowish upper side. The underside of the wings is pale greenish to white. Females have light pinkish markings. == Flight period == This butterfly is seen almost all year in southern Texas. It is seen from early July to mid November in Arizona. In Florida, there have been scattered sightings from July to October. == Habitat == The Lyside Sulphur may be found in open, subtropical scrub habitats. == Life cycle == The caterpillar varies often. It's varies from green to blackish-green. It may have markings or may not have markings. Marked individuals normally have stripes on the top and sides of their bodies. It is the only caterpillar to feed on Guaiacum sanctum.Thomas J. Allen, Jim P. Brock, and Jeffrey Glassberg (2005). Caterpillars in the Field and Garden. Oxford University Press, New York, NY. The chrysalis is a bluish-green color. The Lyside Sulphur can grow from egg to adult in as little as 13 days. It has 3 or more broods per year in southern Texas. == Host plants == Here is a list of host plants that the Lyside Sulphur caterpillar eats: * Guaiacum angustifolium - Texas lignum-vitae * Guaiacum sanctum - Lignum vitae == References == Category:Pieridae",
 "title": "Kricogonia lyside"
}