{
 "id": "209505",
 "text": "Michael Kevin \"Mick\" Taylor (born 17 January 1949) is an English musician best known as a former member of John Mayall's Bluesbreakers and The Rolling Stones. He is well known for his skills as a slide guitar player. He also plays piano, bass and drums. ==Life== Taylor was born in Welwyn Garden City. He was raised in Hatfield. He formed his first band The Gods in 1965. He played together with Ken Hensley (later with Uriah Heep). Other musicians were Greg Lake (later with Emerson, Lake and Palmer) and John Glascock. 1966 he left the band and joined John Mayall´s Bluesbreakers. He replaced there Peter Green. In June 1969 the Rolling Stones looked for a new guitarist and they found Mick Taylor. His first gig as band member of the Stones was the concert in Hyde Park on 5 July 1969 . The concert was in memory of the late Brian Jones. Like Bill Wyman he was never the show man on stage. Due to Richards drug problem he did a lot of guitar work for the albums. Jagger and Taylor recorded Sway, Moonlight Mile, Winter, Till the Next Goodbye and Time Waits For No One. But Taylor never earned money for this work. As Richards critizied his guitar playing he decided in December 1974 to leave the Stones. Taylor's onstage presence with the Rolling Stones is preserved on the album Get Yer Ya- Yas Out!, recorded in New York and Boston in November 1969; in the documentary films Stones in the Park (released on DVD in 2001), Gimme Shelter (released in 1970) and Cocksucker Blues (unreleased); and in the concert film Ladies and Gentlemen: The Rolling Stones (shown in cinemas in 1974). Bootleg recordings from the Rolling Stones' tours from 1969 through 1973 also document Taylor's concert performances with the Rolling Stones. Compared to the Rolling Stones time his solo career was not very successful. After leaving the Stones he formed together with Jack Bruce, Carla Bley and Bruce Gary the Jack Bruce Band. The project failed due to musical differences between Bruce and Taylor. But despite the split Taylor was often guitar player on solo projects of Rolling Stones members. For example he played om Richards album \"Talk is cheap\" from 1988. The Rock and Roll Hall of Fame inducted Mick Taylor along with the Rolling Stones in 1989.In the early 1990s he played for Bill Wyman´s Rhythm Kings. ==Discography== ===With John Mayall's Bluesbreakers=== *Crusade (Decca, 1967/LP, 1987/CD) *Diary of a Band Volume 1 & 2 (Decca, 1968/LP) *Bare Wires (Decca, 1968/LP, 1988/CD ) *Blues from Laurel Canyon (Decca, 1968/LP, 1989/CD) *Primal Solos (Decca, 1969/LP) *Back to the Roots (Decca, 1971/LP, 2001 on 2CD) *Return Of The Bluesbreakers (AIM, 1985/LP, 1993/CD) *The 1982 Reunion Concert (Repertoire records, 1994/CD) with John Mayall, Mick Taylor, Colin Allen and John McVie *Wake Up Call (1993) *Silver Tones - The Best of John Mayall & The Bluesbreakers (Silvertone Records, 1998) *Along For The Ride (2001) *Rolling With The Blues (2003) - selection of live recordings '72-'82 *Essentially John Mayall (Eagle Rock Records, 2007) 5 CD Box Set ===With The Rolling Stones=== *Through the Past, Darkly (Big Hits Vol. 2) (1969) (compilation) :Taylor plays on \"Honky Tonk Women\" *Let It Bleed (1969) :Taylor plays on \"Country Honk\" and \"Live With Me\" *Get Yer Ya-Yas Out! (1970) *Sticky Fingers (1971) *Hot Rocks, 1964-1971 (1972) (compilation) *Exile on Main St. (1972) *Goats Head Soup (1973) *It's Only Rock 'n Roll (1974) *Made in the Shade (1975) (compilation of hits 1971-1974) *Metamorphosis (1975) :Taylor plays on \"I Don't Know Why\" and \"Jiving Sister Fanny\". *Sucking in the Seventies (1981) (compilation of hits, album cuts and outtakes 1974-1981) *Tattoo You (1981) :Taylor plays on \"Tops\" and \"Waiting on a Friend\", both tracks recorded in 1972 during the Goats Head Soup sessions. *Rewind (1971-1984) (1984) (compilation of hits 1971-1983) *Singles Collection: The London Years. (1989) (compilation of singles 1963-1971) *Jump Back: The Best of The Rolling Stones (1993) (compilation of hits 1971-1989) *Forty Licks (2002) (compilation 1964-2002) *Rarities 1971-2003 (2005) :Taylor plays on \"Let It Rock\" (live 1971) and the 1974 b-side \"Through The Lonely Nights\". Non-Rolling Stones work with Rolling Stones members: *Pay, Pack and Follow (John Phillips, first official release by Eagle Rock Records, 2001) :from 1973-1979 recording sessions in London aka \"Half Stoned\" sessions :produced by Mick Jagger and Keith Richards *I've Got My Own Album to Do (Ronnie Wood solo album) (1974) * Now Look (Ronnie Wood solo album) (July 1975) *Talk Is Cheap (Keith Richards solo album) (1988) ===With Jack Bruce=== *Live on the Old Grey Whistle Test (Strange Fruit, 1995). Tracks from several Whistle Test shows recorded between '75 and '81. Seven of the songs feature Taylor on guitar. *Live at the Manchester Free Trade Hall (2 CD, Polydor, 2003) ===With Bob Dylan=== *Infidels (1983) *Real Live (In Europe, 1984) (1984) *Empire Burlesque (1985) *The Bootleg Series Volumes 1–3 (Rare & Unreleased) 1961–1991 (1991) ===Solo discography=== *Mick Taylor (1979) US #119 [5 wks on top 200] *Stranger in This Town (1990) (Recorded Live, Produced by Mick Taylor and Phil Colella) *Arthur's Club-Geneve 1995 (Mick Taylor & Snowy White) (Promo CD/TV Especial) *A Stone's Throw (2000) *Coastin' Home aka Live at the 14 Below (1995) re-issued 2002 *14 Below (2003) *Shadow Man (2003) ===With Carla Olson=== *Too Hot For Snakes (Live at the Roxy) (1991 live album) *Within An Ace (1993) *Reap The Whirlwind(1994, Virgin Records Europe) *Special - The best of Carla Olson (1995, Virgin Records Sweden) *The Ring of Truth (2001) *Too Hot For Snakes plus (2008, Collectors' Choice) 2-CD set of the Roxy album plus \"You Gotta Move\" and a 2nd disc of 13 studio tracks 1993 - 2004 including a previously unreleased version of \"Winter\" and \"Think I'm Goin' Mad\" from the Carla-produced Barry Goldberg album Stoned Again. ===Other session work=== * \"Slim's Got His Thing Goin' On\" (Sunnyland Slim) (World Pacific Records 1969) *Tubular Bells Premiere Mike Oldfield (June '73) Queen Elizabeth Hall *Tubular Bells (Mike Oldfield) Telecast Tubular Bells Part One and Tubular Bells Part Two. Recorded at BBC Broadcasting House November 1973 and aired in early '74 and June '74. Available on Oldfield's Elements DVD. *The Tin Man Was A Dreamer (Nicky Hopkins) (1973) *\"London Underground\" (Herbie Mann 1974) *Live European Tour Billy Preston - (A&M; Records, 1974). Recorded with Stones Mobile Studio during the '73 tour. Preston opened up for the band with Mick Taylor on guitar. released on CD (A& M - Japan, 2002) *Have Blues Will Travel (Speedo Jones) (Integrity Records, 1988) *Reggae II (Herbie Mann) (Atlantic, 1976) *Just A Story From America (Elliott Murphy) (Columbia 1977) *Waiting for Columbus (Little Feat) (1978) double CD released 2002 *Expresso II (Gong) (1978) *Downwind (Pierre Moerlen's Gong) (1979) lead guitar on What you know *Alan Merrill (Alan Merrill)'s solo album (Polydor, 1985) recorded in London in 1977 *Vinyl (Dramarama) (1991) *Burnin' Blues (Coupe De Villes) (1992) *Once in a Blue Moon (Gerry Groom) (1993) *Cartwheels (Anthony Thistlethwaite) (1993) *Hecho en Memphis (Ratones Paranoicos, Sony Music) (1993) *Let's get stoned (The Chesterfield Kings) (Mirror Records,1994) *Crawfish and Caviar (Anthony Thistlethwaite) *Blue Night (Percy Sledge, Virgin Records, 1994) *Mick & I (2001) Miyuki & Mick Taylor *From Clarksdale to Heaven (BlueStorm, 2002) John Lee Hooker Tribute Album. *Stoned Again (Barry Goldberg, Antone's Records, 2002) *Meaning Of Life (Todd Sharpville) (Cathouse/Universal, 2003) *Key To Love (Debbie Davies) (Shanachie Records, 2003) *Shadow Man (re-release of a Sasha album from '96) (2003) Originally released by Alpha Music in 1996, this \"Mick Taylor featuring Sasha\" album should have read \"Sasha featuring Mick Taylor\", but the company felt it would sell better under a household name. It features Mick Taylor on guitar, but is basically a Sasha Gracanin album. *Treasure Island (Nikki Sudden) (Secretly Canadian, 2004) * Unterwegs (Crazy Chris Kramer) (2009) ===Music DVDs=== * Blues Alive video (RCA/Columbia Pictures 1983), recorded at Capitol Theatre, NJ 1982 * Jamming with the Blues Greats - DVD release from the 1983 video, featuring John Mayall's Bluesbreakers (Mick Taylor, Colin Allen, John McVie) and special guests Albert King, Etta James, Buddy Guy, Junior Wells and Sippie Wallace (Lightyear/Image Entertainment 2005) * The Stones in the Park Hyde Park concert video (Granada Television, 1969) :released on DVD (VCI, 2001) * Gimme Shelter (Maysles Films, 1970) music documentary film by Albert and David Maysles, shot at the Rolling Stones concerts at Madison Square Garden, NY on 27/28 November and Altamont, CA on 6th Dec December 1969. :restored and released on DVD (Criterion, 2000) * John Mayall, the Godfather of British Blues documentary about John Mayall's life and career (Eagle Rock, 2004. Region 1: 2005) * 70th Birthday Concert (Eagle Rock, 2004. Region 1: 2005). Bluesbreakers Charity Concert (Unite for UNICEF) filmed in Liverpool, July 2003. John Mayall & the Bluesbreakers with special guests Chris Barber, Eric Clapton and Mick Taylor. * \"Stones In Exile\" 2010 * \"Ladies & Gentlemen The Rolling Stones\" 2010 \\---- Music DVDs - Unofficial * Cocksucker Blues ==References== == Other websites == * Official Homepage * Fansite * Mick Taylor’s Complete Works 1964 – Present * Video Interview with Mick Taylor - 2010 Category:1949 births Category:Living people Category:English rock guitarists Category:English songwriters Category:Musicians from Hertfordshire Category:The Rolling Stones members",
 "title": "Mick Taylor"
}