{
 "id": "209594",
 "text": "Dom Pedro II of Brazil (complete name: Pedro de Alcântara João Carlos Leopoldo Salvador Bibiano Francisco Xavier de Paula Leocádio Miguel Gabriel Rafael Gonzaga; Rio de Janeiro, December 2, 1825 — Paris, December 5, 1891), known as O Magnânimo (The Magnanimous) (),, was the second and last de facto Brazilian Emperor. He was the seventh son of Pedro I and the archduchess Maria Leopoldina of Austria. Pedro II succeeded his father in the Brazilian Throne when he was 16 years of age. Pedro I had to return to Portugal in order to rule over the country as an Emperor and this action made him abdicate from the Brazilian Throne in favor of his son. But, when in Portugal, Pedro I renounced the Portuguese Throne, in favor of his eldest daughter Dona Maria da Glória. Pedro II was nephew of Miguel I (father's part), Napoleon Bonaparte (mother's part) and cousin of Emperors Napoleon II, Franz Joseph I and Maximilian I of Mexico. He was Maria da Glória's youngst brother and uncle of kings Pedro V and Luís I. ==Issue== Name Portrait Lifespan Notes By Pedro II of Brazil (2 December 1825 – 5 December 1891; married by proxy in 30 May 1843) By Pedro II of Brazil (2 December 1825 – 5 December 1891; married by proxy in 30 May 1843) By Pedro II of Brazil (2 December 1825 – 5 December 1891; married by proxy in 30 May 1843) By Pedro II of Brazil (2 December 1825 – 5 December 1891; married by proxy in 30 May 1843) Afonso, Prince Imperial of Brazil 23 February 1845 – 11 June 1847 Prince Imperial of Brazil from birth to his death in 1847. Isabel, Princess Imperial of Brazil 29 July 1846 – 14 November 1921 Princess Imperial of Brazil and Countess of Eu due to her marriage to Prince Gaston d'Orléans. She had 3 sons from this marriage. She also acted as Regent of the Empire while her father was traveling abroad. Princess Leopoldina of Brazil 13 July 1847 – 7 February 1871 Married Prince Ludwig August of Saxe-Coburg-Kohary with 4 sons resulting from this marriage. Pedro, Prince Imperial of Brazil 19 July 1848 – 9 January 1850 Prince Imperial of Brazil from birth to his death in 1850. ==References== Category:Brazilian royalty Category:Emperors and empresses Category:1825 births Category:1891 deaths Category:People from Rio de Janeiro",
 "title": "Pedro II of Brazil"
}