{
 "id": "209598",
 "text": "Barry Manilow (born Barry Alan Pincus; June 17, 1943 in Brooklyn, New York City)Barry Manilow at jewishvirtuallibrary.org is an American singer- songwriter, actor and musician. Early in his career, he started by writing commercial jingles for major companies. He is best known for songs such as \"Could It Be Magic\", \"Mandy\", \"Can't Smile Without You\", and \"Copacabana (At the Copa)\". ==Studio albums== Year Album details Chart positions Sales Certifications (sales thresholds) US UK http://www.theofficialcharts.com/artist/_/barry%20manilow/ 1973 Barry Manilow *Released: July 7, 1973 *Label: Bell / Arista (Re-release) 28 — *US: Platinum 1974 Barry Manilow II *Released: October 1974 *Label: Bell / Arista (Re- release) 9 — *US: 2× Platinum 1975 Tryin' to Get the Feeling *Released: October 1975 *Label: Arista 5 — *US: 3× Platinum *CAN: Gold 1976 This One's for You *Released: August 1976 *Label: Arista 6 — *US: 3× Platinum *CAN: Gold 1978 Even Now *Released: February 1978 *Label: Arista 3 12 *US: 3× Platinum *UK: Silver 1979 One Voice *Released: September 25, 1979 *Label: Arista 9 18 *US: 2× Platinum *UK: Gold *CAN: Platinum 1980 Barry *Released: November 19, 1980 *Label: Arista 15 5 *US: Platinum *UK: Platinum *CAN: Gold 1981 If I Should Love Again *Released: September 1981 *Label: Arista 14 5 *US: Platinum *UK: Platinum 1982 Here Comes the Night *Released: November 1982 *Label: Arista 32 7 *US: Platinum *UK: Platinum 1984 2:00 AM Paradise Cafe *Released: November 15, 1984 *Label: Arista 28 40 *US: Platinum *UK: Silver 1985 Manilow *Released: 1985 *Label: RCA 42 40 1987 Swing Street *Released: 1987 *Label: Arista 70 — *US: Gold 1989 Barry Manilow *Released: May 2, 1989 *Label: Arista 64 — *US: Gold *UK: Silver 1990 Because It's Christmas *Release: September 25, 1990 *Label: Arista 40 — *US: Platinum 1991 Showstoppers *Released: September 24, 1991 *Label: Arista 68 53 1994 Singin' with the Big Bands *Released: October 11, 1994 *Label: Arista 59 54 *US: Gold 1996 Summer of '78 *Released: November 19, 1996 *Label: Arista 82 66 *US: Gold 1998 Manilow Sings Sinatra *Released: November 10, 1998 *Label: Arista 122 72 2001 Here at the Mayflower *Released: November 13, 2001 *Label: Concord 90 18 2002 A Christmas Gift of Love *Released: November 12, 2002 *Label: Concord Jazz / Columbia 55 — *US: Gold 2004 Scores *Released: September 28, 2004 *Label: Concord 47 — 2006 The Greatest Songs of the Fifties *Released: January 31, 2006 *Label: Arista 1 12 *US: Platinum *UK: Gold *CAN: Gold The Greatest Songs of the Sixties *Released: October 31, 2006 *Label: Arista 2 56 *US: Gold *UK: Gold 2007 The Greatest Songs of the Seventies *Released: September 17, 2007 *Label: Arista 4 27 *US: Gold In the Swing of Christmas *Released: November 26, 2007 *Label: Arista / Hallmark 127 — *US: Gold 2008 The Greatest Songs of the Eighties *Released: November 21, 2008 *Label: Arista 14 22 *US: Gold 2010 The Greatest Love Songs of all Time *Released: January 22, 2010 *Label: Arista 5 26 *US: Gold 2011 15 Minutes *Released: June 14, 2011 *Label: STILETTO / Fontana (US) Rhino (UK) 7 20 \"—\" means releases that did not chart. ==Awards== * 1977 Emmy for Outstanding Special – Comedy, Variety or Music – The Barry Manilow Special * 1977 Special Tony Award – Barry Manilow on Broadway * 1978 American Music Awards – Best Pop/Rock Male Artist * 1979 Grammy – Copacabana Best Pop Male Vocal Performance * 1979 American Music Awards – Best Pop/Rock Male Artist * 1980 American Music Awards – Best Pop/Rock Male Artist * 2002 Songwriter's Hall of Fame * 2006 Emmy for Outstanding Individual Performance in a Variety or Music Program – Barry Manilow: Music And Passion * 2007 RIAA – Plaque commemorating worldwide record sales of 75 million * 2009 Clio Awards Honorary award for prior work with commercial jingles ==Selected TV and movie appearances== * Donny & Marie in 1977. * ABC special The Stars Salute Israel At 30 on May 8, 1978. * May 8, 1982, Goldie & Kids a special where he acted in skits and sang \"One Voice\" and \"I Am Your Child\" with hostess Goldie Hawn. * In 1985 Barry wrote and starred in the Television movie Copacabana (musical), which was inspired by his 1978 song Copacabana. * On September 17, 1987, he was in the star-studded CBS special We The People 200: The Constitutional Gala taped at the Philadelphia Civic Center in Philadelphia, Pennsylvania to debut his song \"Let Freedom Ring\". * On May 17, 1989, made first of eight appearances as a guest on The Arsenio Hall Show over five years. * On May 17, 1993, Manilow made a guest appearance on the CBS show Murphy Brown. On the show, Candice Bergen's character often said she doesn't like Manilow's music. After she became a mother, Manilow appeared to sing her a sweet version of his tune \"I Am Your Child\", winning her over with the song about a parent's bond with a child. Later that year he was in England on Surprise! Surprise! with Cilla Black where he performed the new single he had recorded with Cilla of \"You'll Never Walk Alone\". * Guest appearance in a 2001 episode of Ally McBeal. He played both a hallucination of Ally's and himself on stage at the end of the show. * Played himself in a cameo in the 2002 dark comedy Unconditional Love starring Kathy Bates and Rupert Everett where \"Can't Smile Without You\" also played a key role in the plot. * On December 11, 2003, Manilow was on the NBC show Will & Grace as himself backstage between tour stops. The name of the episode is \"Fanilow\" as in \"a fan of Manilow\". * On April 20–21, 2004, Manilow got back together with Debra Byrd. She was his backup singer and was a vocal coach at American Idol. He was a guest judge for season three. The contestants sang his songs as the theme for the week. * On December 8, 2004, he was a guest on the NBC special A Clay Aiken Christmas, hosted by the former Idol runner-up. * On March 21–22, 2006, Manilow returned to American Idol in season five. 1950s music was the theme. He again helped the top eleven finalists to fine tune their performances and again sang on the results show. * In November 2006, he was on Logo's reality show Jacob and Joshua: Nemesis Rising as himself in Las Vegas for a recording session with the twins. * On November 23, 2006, Manilow was live on a float in the Macy's Thanksgiving Day Parade. He sang the song \"What the World Needs Now\" on the television broadcast of the parade. * On December 2, 2006, Manilow was the celebrity guest and theme for the week on The X Factor. * On December 12, 2006, he was live at the 2006 Royal Variety Performance and performed a selection from his latest album. * The Tonight Show with Jay Leno on October 31, 2007, on November 17, 2008, and on July 12, 2011. * He guest starred on Family Guy in \"Back to the Woods\" on February 17, 2008 * On December 4, 2008, he was the main guest on UK's The Graham Norton Show. * He guest starred on Strictly Come Dancing on December 7, 2008 * Barry narrated and wrote original music for the Ocean Spray Christmas special \"Cranberry Christmas\". * He was a guest on Friday Night with Jonathan Ross (UK) on September 11, 2009. * On October 2, 2009, he was on BBC Radio 4's Desert Island Discs. * He was a guest on The Jay Leno Show (US) on December 10, 2009. * He was a guest on The Tonight Show with Conan O'Brien (US) on January 21, 2010. He mentioned that, before he became famous, he wrote advertising jingles, including two well- known jingles for Band-Aid and State Farm. Also, he commented on his diet of \"forgetting to eat\". * On February 6, 2010, he was a guest on Jimmy Kimmel Live! where Jimmy showed a photo of him in the 1970s and discussed his new album. * On December 11, 2010, he ended the Nobel Peace Prize concert in Oslo, Norway singing four of his most known and popular songs. The Nobel Peace Prize was awarded to the Chinese dissident Liu Xiaobo. * On June 15, 2011, he was on \"Good Morning America\" performing his new album, \"Fifteen Minutes\". * On June 23, 2011, he was on CNN's Piers Morgan Tonight. * On June 24, 2011, he was on the UK's Paul O'Grady Live. * On October 28, 2011, he was the star of the UK's show An Audience With... Barry Manilow. * On December 11, 2011, he was on ITV's Text Santa: The Launch * On December 14, 2011, he was on the royal variety show on ITV. ==Personal life== Manilow officially came out as gay in April 2017, telling People that he had kept his sexual orientation quiet out of concern that it would disappoint his largely female fan base, but when his fans learned of the marriage, they were supportive. ==References== Category:1943 births Category:Living people Category:American pop singers Category:Gay men Category:LGBT musicians Category:LGBT people from New York City Category:LGBT singers Category:Musicians from Brooklyn Category:Singer- songwriters from New York City Category:Emmy Award winners Category:American Grammy Award winners Category:Clio Award winners Category:American Music Awards",
 "title": "Barry Manilow"
}