{
 "id": "209780",
 "text": "Wijerd Jelckama (1490 – July 7 1523) was a Frisian freedom fighter, legendary warrior, warlord, rebel and pirate. ==Early life and family== Jelckama was born in the year 1490 in a large family of farmers and petty noblemen. He was descended from knights who had participated in the Crusades. One of his ancestors from his father's side of the family had died at the Siege of Antioch.J.J. Kalma. Grote Pier Van Kimswerd (1970), p. 51. . Jelckama married a woman named Fokel in an unknown year. She survived for longer than her husband, but died in 1553. Before Jelckama's death in 1523, he and Fokel had two daughters and a son. Their son was named Janco Douwes Jelckama (1514-1587). Their daughters were Bonga (1516-1575) and Fokel (1517-1546). Historians have identified Jelckama's grandchildren and great-grandchildren. A great-granddaughter who died in 1625 probably ended Jelckama's official bloodline. ==Rebellion== Together with Pier Gerlofs Donia, Jelckama fought against the Saxon warriors that occupied their homeland of Frisia. He battled the Saxons at the capture of Medemblik and in the siege of Middelburg Castle. Jelckama served as Donia's lieutenant for five years. After Donia died in 1520, Jelckama took command of the armies. He had been the commanded the Arumer Black Heap and led the Frisian rebellion against the House of Habsburg since as early as 1519. ==Strength== Author Wopke Eekhoff compared Jelckama to his own uncle, who was at least 7 feet tall and once lifted a 1000-pound horse above his head. Jelckama was 7 feet tall and was reportedly strong enough to lift a horse high over his shoulders. ==Death== After a series of defeats, Jelckama and what was left of the Frisian army were captured in 1523 and taken to the city of Leeuwarden in Frisia. There they were executed in public. It took the executioner four blows to sever Jelckama's head from his extremely thick neck. With the death of Jelckama and the rebels, the independence of Frisia came to an end. It was the last successful revolt in Frisian history and is remembered as such to this day. ==Notes and references== Category:1490 births Category:1523 deaths Category:Dutch military people Category:People executed by decapitation Category:People from Friesland Category:Pirates",
 "title": "Wijerd Jelckama"
}