{
 "id": "209930",
 "text": "Smallville is a Superman prequel television show about a teenaged version of the comic book character Clark Kent. He later becomes Superman and has to stop his enemy Lex Luthor. This show is produced by Tollin/Robbins Productions, Millar Gough Ink, DC Comics and Warner Bros. Television Studios. It first premiered on October 16, 2001, which aired on The WB. == Overview == Smallville is based on the popular DC Comics character, Superman. The series follows the life of a teenage Clark Kent living in the town of Smallville, Kansas that is set at the start of the 21st century. It shows Clark Kent coping with adolescence while he is developing super powers (X-ray vision, super speed, etc.), exploring his extraterrestrial origins, and struggling to find his destiny. Best shown at the beginning of season 5 and 8, Smallville is said to be a show of 3 chapters: Chapter 1 is the High School year of Clark Kent (Seasons 1-4) featuring villains Lionel Luthor, Roger Nixon and Jason and Genevieve Teague. Chapter 2 is known as Clark's training begins and Lex Luthor's descension to darkness (Seasons 5-7) featuring new heroes and villains like Brainiac, Bizarro and Lex Luthor. The final chapter is known as The Final Trials of Clark Kent: Doomsday, General Zod, and Darkseid (Season's 8-10) and features the rise of the Justice League, Lex Luthor's return, and Clark's rise to Superman. The series often deals with the people in Clark Kent's life: his adoptive human parents, Jonathan Kent and Martha Kent; his peers, Chloe Sullivan, Pete Ross; his on-again, off-again love interest, Lana Lang; his Daily Planet cohort, Lois Lane and especially his friendship with a young Lex Luthor. The mineral kryptonite is used as a recurring plot device throughout the series. Kryptonite is shown to have bizarre and lingering effects on human physiology and the young superhero often encounters mutated and psychotic villains who have developed bizarre powers, such as psychic abilities, shape shifting, and other paranormal abilities. (For this reason, the show is often criticized as being predominately a \"freak of the week\" series.) On a Kryptonian like Clark, though, kryptonite has very different effects; the general idea is that Clark is virtually invincible except when around the kryptonite rocks. Different colors affect Clark differently: Green Kryptonite physically weakens him and could possibly kill him if he is exposed to it for too long. Red Kryptonite causes him to set aside moral standings and act out on his impulses and dark desires. Black Kryptonite splits Clark into (and merges him back together from) two separate beings that exhibit his two personalities (Clark Kent and the darker Kal-El). Silver Kryptonite (which is solely the creation of Milton Fine in the show) causes him extreme paranoia. Blue Kryptonite takes away his abilities, but doesn't cause him pain like green kryptonite is often seen to. Lastly, Gold Kryptonite can permanently damage or scar a Kryptonian and take away their powers permanently. Viewers will often observe allusions in the form of dialogue, guest stars, character wardrobe, and scenic design used throughout the series to the Superman comic books and movies. Category:2001 American television series debuts Category:2011 American television series endings Category:2000s American television series Category:2010s American television series Category:American teen drama television series Category:Superman Category:WB network shows Category:English-language television programs Category:The WB original programming Category:Star World India programmes",
 "title": "Smallville"
}