{
 "id": "209944",
 "text": "The Pieridae are a large family of butterflies. It has about 76 genera and 1,100 species. They are mostly from tropical Africa and Asia.DeVries P.J. in Levin S.A. (ed) 2001. The Encyclopaedia of Biodiversity. Academic Press. Most pierid butterflies are white, yellow or orange with black spots. The pigments are a characteristic of this family.Carter, David, Butterflies and Moths (2000) The name \"butterfly\" may have come from a member of this family, the Brimstone Gonepteryx rhamni. It was called the \"butter-coloured fly\" by early British naturalists. The caterpillars of some species, such as Pieris brassicae and Pieris rapae, are often seen in gardens. They are agricultural pests because they feed on brassicas. Males of many species feed on salts from moist soil. They do this in groups. This behavior is known as 'mud-puddling' or 'puddling'. ==Classification== The Pieridae have the radial vein on the forewing with 3 or 4 branches (rarely 5) . The fore legs are well developed in both sexes. The tarsal claws are bifid (bifid means split into two parts).Borror D.J., Triplehorn C.A., & Johnson N.F. 1989. An introduction to the study of insects, 6th ed. Philadelphia: Saunders College Publishers. Like the Papilionidae, Pieridae also have their chrysalids held at an angle by a silk girdle. The girdle runs around the first abdominal segment unlike the thoracic girdle seen in the Papilionidae. ==Subfamilies== The Pieridae are divided into the following four subfamilies: *Dismorphiinae (6 genera) They are mostly neotropical. This group includes many mimetical species. The host plants are in the family Fabaceae. *Pierinae (55 genera) This subfamily includes the whites and orange-tips. Many of these species are strongly migratory. Their host plants are in the families Capparidaceae, Brassicaceae, Santalaceae, and Loranthaceae. *Coliadinae (14 genera) This subfamily includes the sulphurs and yellows. Many of these species are sexually dimorphic. Some species, such as in the genus Colias, have wing patterns that are visible only under ultraviolet light. *Pseudopontiinae The main species in this subfamily is Pseudopontia paradoxa. It is endemic to West Africa. == References == ==Other websites== *TOL *Pteron In Japanese but binomial names. 3 pages of images. *Holarctic Pieridae * Pontia protodice, checkered white on the UF / IFAS Featured Creatures Web site Category:Pieridae",
 "title": "Pieridae"
}