{
 "id": "210128",
 "text": "The Barcelona Metro (Catalan and Spanish: Metro de Barcelona), part of the public transportation system of Barcelona, Spain is an extensive network of electrified railways that run underground in central Barcelona and above ground into the city's suburbs. There are 189 stations with 12 lines together with 166 km of total track line. The network length is 170 kilometres, with 183 stations, as of November 2021. == Lines == Line Number Termini Operator Current Length Approved Length Current Stations Approved Stations Year of Opening Image:L1 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 1 desc none Hospital de Bellvitge - Fondo TMB 20,700 km 29,758 km 29 38 1929 Image:L2 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 2 desc none Paral·lel - Badalona Pompeu Fabra TMB 13,100 km 18,466 km 17 34 1959 Image:L3 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 3 desc none Zona Universitària - Trinitat Nova TMB 18,400 km 20,024 km 26 36 1924 Image:L4 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 4 desc none Trinitat Nova - La Pau TMB 16,700 km 18,916 km 22 26 1926 Image:L5 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 5 desc none Cornellà Centre - Vall d'Hebron TMB 16,700 km 19,168 km 23 27 1959 Image:L6 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 6 desc none Pl. Catalunya - Sarrià FGC 5,384 km 8,198 km 9 12 1863 Image:L7 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 7 desc none Pl. Catalunya - Av. Tibidabo FGC 4,634 km 4,634 km 7 7 1954 Image:L8 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 8 desc none Pl. Espanya - Molí Nou-Ciutat Cooperativa FGC 11,266 km 11,266 km 11 11 1883 File:L9 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 9 desc none La Sagrera - Can Zam Zona Universitària - Aeroport T1 TMB 3'9 km 47'9 km 6 52 2009 File:L10 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 10 desc none La Sagrera - Gorg Collblanc - ZAL – Riu Vell TMB 4 2010 Image:L11 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 11 desc none Trinitat Nova - Can Cuiàs TMB 2,109 km - km 5 - 2003 L12 Sarrià - Reina Elisenda ==The metro network in 2030== Line Termini Operator Open in Length (km) Stations File:L1 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 1 desc none El Prat Estació - Badalona Pompeu Fabra TMB 1926 29,758 38 File:L2 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 2 desc none Aeroport T1 - Badalona Pompeu Fabra TMB 1995 18,466 36 File:L3 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 3 desc none Sant Feliu Centre- Trinitat Vella TMB 1924 20,024 36 File:L4 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 4 desc none Trinitat Nova - La Sagrera TMB 1926 18,916 26 File:L5 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 5 desc none Cornellà Centre - Vall d'Hebron TMB 1959 19,168 27 File:L6 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 6 desc none Plaça de Catalunya - Finestrelles Sant Joan de Déu FGC 1929 5,384 12 File:L7 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 7 desc none Plaça de Catalunya - Avinguda Tibidabo FGC 1954 4,634 7 File:L8 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 8 desc none Gràcia - Molí Nou Ciutat Cooperativa FGC 1912 11,266 11 File:L9 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 9 desc none Aeroport T1 - Can Zam TMB 2009 to 20141 42,976 39 File:L10 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 10 desc none Pratenc - Gorg TMB 2010 to 2014 38,638 33 File:L11 barcelona.svg|25x25px rect 0 0 500 500 Barcelona Metro line 11 desc none Trinitat Nova - Can Cuiàs TMB 2003 2,109 5 Total 240,186 296 == References ==",
 "title": "Barcelona Metro"
}