{
 "id": "210755",
 "text": "Pit bull is a word used to describe several breeds of dog. This includes the American Pit Bull Terrier, American Staffordshire Terrier, American Bully and Staffordshire Bull Terrier, and dogs with a mix of these breeds. In some locations, the modern American Bulldog and Bull Terrier are described as a \"pit bull-type dog\". Pit bull can also mean dogs that were known as \"bull terriers\" before the development of the modern Bull Terrier in the early 20th century. These dogs were bred by crossing bulldog breeds and terriers. Pit bulls are very strong and can pull many times their weight. They were also bred for dog fighting. The place where such dogs fought was called a pit. As such dogs can be dangerous, very often a special permit is needed to breed or to own them. Some places or countries may have forbidden their use. Best Friends Animal Society says pit bulls are good family pets if raised in a loving home and trained well. They say that then they are loyal, intelligent, loving, playful and very obedient pets. Pediatric trauma experts differ. They say pit bulls should not be around children. Pit bulls cause the most serious dog attack injuries and the most deaths from dog attacks Over 30 countries have varying degrees of laws regulating pit bull ownership. Insurance companies often charge higher premiums for owners of pit bulls. == Citations == == References == === Medical Studies, Ordered by Date === Patterson et al., 2022 study, \"Pediatric dog bite injuries in the USA: a systematic review\" Refer to this with: * Essig 2019 study, \"Dog bite injuries to the face: Is there risk with breed ownership? A systematic review with meta-analysis\" * Golinko's 2016 study, \"Characteristics of 1616 Consecutive Dog Bite Injuries at a Single Institution\" * O'Brien et al., 2015 study, \"Dog bites of the head and neck: an evaluation of a common pediatric trauma and associated treatment\" * Bini's 2011 study, \"Mortality, mauling, and maiming by vicious dogs\", Annals of Surgery * Kaye et al.'s 2009 study, \"Pediatric Dog Bite Injuries: A 5-Year Review of the Experience at The Children’s Hospital of Philadelphia\" * === Books === D. Caroline Coile 2020 book, Pit Bulls For Dummies * === Opinion Articles === * Opinion article from Dr. David Billmire, who has 30 years of practice in pediatric plastic and reconstructive surgery. Category:Terriers Category:Dog breeds originating in England Category:Dog breeds originating in the United States",
 "title": "Pit bull"
}