{
 "id": "210718",
 "text": "The Texas Revolution was a fight for Texas, in which Texas fought for independence from Mexico. == Background == \"The Texas Revolution (October 2, 1835 – April 21, 1836) Texas has the largest area of any state in the continental United States. But Texas wasn't always as large as it is today. During the early 1830s, when Texas was a part of Mexico, Texas only included the eastern half of the present-day state. The rest of the present-day state of Texas was split between the Mexican territory of New Mexico and several other Mexican states, including Coahuila and Chihuahua. The countries of Spain and Mexico claimed Texas for much of the 1700s and 1800s. However, a powerful Native American tribe called the Comanche (kuh-MAN-chee) controlled much of the area. Today, historians call the territory that the Comanche controlled Comanchería (kuh-man-chuh-REE-uh). The Comanche wanted to keep settlers out of Comanchería. So the Comanche took horses and other supplies from areas that historians call raiding zones. # Raiding zones were outside Comanchería's borders. The Cherokee lived in the eastern part of Texas. Many had moved there from the southeastern United States during the 1810s. Later on, when Texas fought for its independence from Mexico, some Texan leaders asked for Cherokee support. When Texas became part of Mexico in 1821, most of the people in Texas belonged to Native American groups such as the Comanche. The population of Texas changed a lot over the next 15 years, though. In the 1820s and 1830s, the population of Texas included these groups: * Tejanos (tay-HAH-nose), or people of Mexican descent living in Texas * Anglos, * or white people from the United States living in Texas * Native * Americans, * made up of hundreds of different tribes. Over its history, many different groups of people have chosen to settle in Texas. Today, Texas is one of the most diverse states in the United States. In other words, people in Texas come from many different backgrounds just Tejano, Anglo, or Native American. Because of its time as a part of Mexico, Texas is filled with Mexican-inspired culture. Over time, Tejano culture blended with Anglo culture to create new forms of food, music, and ways of life that are uniquely Texan. Other groups, like immigrants from central Europe, have also contributed to the culture of Texas. Mexico gained its independence from Spain in 1821. The new Mexican government wanted Texas to have more people who would support Mexico. The Mexican government believed having more loyal people in Texas would protect Mexican citizens from Comanche raids. The Mexican government agreed to contracts with businessmen called empresarios. An empresario recruited Anglos, or white settlers from the United States, to move to Texas. He or she offered settlers inexpensive land and the chance to make money on farms and ranches. Empresarios' contracts required them to do certain things: * make sure that the people they brought to Texas would follow the law, learn Spanish, and practice the Catholic faith * separate the land that the Mexican government gave them into smaller shares for the settlers they brought to Texas The Mexican government believed that making the settlers speak the same language and practice the same religion as Mexican citizens would make them loyal to Mexico. If an empresario brought enough families to Texas, he or she would get a large piece of land for himself. The most successful empresario was Stephen F. Austin. His father had agreed to an empresario contract with the Spanish government in 1820 but died before he could begin. Stephen continued his father's work and introduced thousands of Anglo settlers to Texas during the 1820s and 1830s. While Texas was a part of Mexico, Austin was the most widely respected leader in Texas. Austin wanted a good relationship with the Mexican government. But Austin was arrested and spent nearly a year in prison because the government suspected him of not being loyal. Austin is often called \"The Father of Texas.\" Tejanos, or those of Mexican descent living in Texas Anglos, or settlers from the United States in Texas * practiced the Catholic faith * opposed slavery * were Spanish-speaking * had conflicts with Native Americans * mostly lived in towns in the western part of Texas * practiced Protestant faiths * supported or accepted slavery * were English-speaking * had conflicts with Native Americans * mostly lived on farms and ranches in the eastern part of Texas The annexation of Texas by the United States was a major cause of the later U.S.-Mexican War. Colonized in the eighteenth century by the Spanish, the Republic of Texas declared its independence from Mexico on March 2, 1836. The Republic of Texas was not recognized by the United States until a year later in 1837. In the 1820s, landowning empresarios led immigrants, mostly from the United States, to Texas, which was part of Mexico, for cheap land. At first, the Mexican government was happy to fill the land, which had only Native Americans, but most Texans were soon from the US. Mexico began to worry about losing Texas to the United States and so decided to stop all immigration from there. To make things worse, Mexico had a new president, Antonio López de Santa Anna, who got rid of the Mexican Constitution and made himself president for life. People in several places, especially in northern Mexico, joined together to fight him and the Mexican Army and to secede from Mexico. Most Texans wanted independence, and one reason was that they refused to accept a new Mexican law that banned slavery and was declared on April 8th, 1830. Many immigrants were from the Southern United States and saw slavery as a way of life. They brought enslaved African Americans to work as field hands to produce cotton, corn, and sugar.\" == Course of war == The war in Texas started when Mexican soldiers tried to take a cannon from the city of Gonzales on October 5, 1835. A famous battle in the war was the Battle of the Alamo in which about 200 Texans were killed, and hardly any of them survived the Mexican victory. Texas lost because many Mexicans did not want to fight for the central government, and Texas got many US volunteers. The war ended on April 21, 1836 with the Battle of San Jacinto. Texas was declared an independent country and called itself the Republic of Texas. == Aftermath == Texas remained an independent country for ten years since most of the Northern United States did not want another slave state and feared war with Mexico. In 1845, the United States Congress voted to admit Texas as a slave state, which made it the country's 28th state. Mexico opposed that and so the Mexican–American War began, in which the US won. == References == Category:1835 in the United States Category:1836 in the United States Category:1830s in Texas Category:19th century in Mexico Category:Wars of independence Category:19th-century conflicts",
 "title": "Texas Revolution"
}