{
 "id": "210822",
 "text": "Aubrey Drake Graham (born October 24, 1986) is a Canadian rapper, singer, and actor. who has sold over five million album copies. He was born in Toronto, Ontario. He was the character Jimmy Brooks for eight seasons on the television show Degrassi: The Next Generation (2001–2008). He is of Jewish and Black/Afro-American descent. Drake has worked with a lot of other musicians. Drake collaborated with Rihanna on the number-one singles \"What's My Name?\" (2010) and \"Work\" (2016). He also rapped on \"Moment 4 Life\" (2011) by Nicki Minaj. \"Moment 4 Life\" was nominated for a 2012 Grammy Award in the category Best Rap Performance. His third album Take Care won the award for Best Rap Album at the 2013 Grammy Awards. In 2012, Drake along with his producer 40 and manager Oliver El-Khatib started the OVO Sound record label. On September 30, 2013, he was named as the \"global ambassador\" for the Toronto Raptors of the National Basketball Association (NBA). On March 14, 2019, the Raptors renamed their practice facility to the OVO Athletic Centre after Drake's brand. In 2016, he released Views, an album that was only on iTunes at first. His single \"One Dance\" became his first number-one single on the US Billboard Hot 100 as a main artist. Drake went on the 54-show Summer Sixteen Tour alongside American rapper Future to promote Views, Future's fourth studio album Evol, and the two's collaborative mixtape What a Time to Be Alive. The tour earned $84.3 million which made it the highest grossing hip-hop tour of all time. On March 18, 2017, Drake released More Life, which he referred to as a \"playlist\" instead of an album. The singles \"Fake Love\" and \"Passionfruit\" reached the top ten in countries worldwide. In 2018, Drake worked with Travis Scott and published \"Sicko Mode\". It was nominated for the Grammy Awards for Best Rap Song and Best Rap Performance. Drake's single, \"God's Plan\", from the EP Scary Hours, entered at the top of the US Billboard Hot 100. After 11 weeks at number one, the single \"Nice for What\" also entered at number one, making Drake the first artist to have a number-one entry replace another number-one entry at the top of the chart. \"Nice for What\" became Drake's fifth American chart-topper. Drake released the single \"I'm Upset\" in May 2018 and announced he was going to release his next album, Scorpion, in June. Despite rumors, particularly a beef with rapper Pusha T, Drake revealed in the album that he has a child, a son named Adonis, with French artist Sophie Brussaux. On April 2, 2020, Drake released the single \"Toosie Slide\", based on the dance of the same name that had been posted to social media app TikTok. It became his third number-one entrance on the Billboard Hot 100, tying him with Mariah Carey as having the most songs enter at the top. It became his seventh US number-one single overall. On October 31, 2023, Drake released the song \"First Person Shooter\" which also featured J. Cole. The song debuted number one on the US Billboard Hot 100. This gave Drake his thirteenth number-one single and Cole's first number-one. By earning number one, Drake tied the record with Michael Jackson for most number-one singles by a male solo artist. The song also started a feud with rapper Kendrick Lamar after Cole rapped about Drake, Cole and Lamar being the \"Big 3\" of hip hop. On August 2, 2024, Drake made an unannounced appearance at PartyNextDoor's concert. He performed and then said that Party and he were working on an album together. On February 3, 2025, Drake officially revealed the title of the album as Some Sexy Songs 4 U and set a release date of February 14. == Early life == Aubrey Drake Graham was born on October 24, 1986, in Toronto, Ontario. His parents are Sandra, a school teacher, and Dennis Graham, an African-American musician from Memphis, Tennessee. Drake's parents got a divorce when he was five years old. He spent most of his time at his mother's house in the Weston Road area of Toronto while he also made summer visits to his father's house in Memphis. Drake's uncles are also part of the music business. His uncle Larry Graham was a bassist for Sly and the Family Stone and his other uncle Mabon \"Teenie\" Hodges was a guitarist and songwriter who wrote hit songs such as \"Take Me to the River\" and \"Here I Am (Come and Take Me)\" for soul singer Al Green. He attended Forest Hill Collegiate Institute for high school, and attended Vaughan Road Academy in Toronto. At Vaughan Road, Drake took part in their Interact program and was classmates with actor Elliot Page. He dropped out because it took too much time away from his music and he was getting bullied for his race but he eventually earned his high school diploma in 2012. == Career == Early in his music career, Drake was in a hip hop group called The Renaissance with Grammy Award-winning singer Melanie Fiona. The first recorded song he put out was called \"Do What You Do\" on The N Soundtrack for the The N. He uploaded music to his MySpace account including a demo track of a song called \"Brand New\" which was first meant for another artist. On February 14, 2006, Drake self-released his first mixtape Room for Improvement. It sold around 6,000 copies. After this, Drake performed at his first huge concert, opening for Ice Cube in Toronto at the Kool Haus nightclub on August 19, 2006. Around this time, Drake created his own record label called October's Very Own. He released his next mixtape, Comeback Season, on September 1, 2007. The mixtape included the single \"Replacement Girl\" with American R&B; singer Trey Songz. On the set of the music video for \"Replacement Girl\", Drake met his future producer Noah \"40\" Shebib. In 2008, Drake began to focus more on his music career after his character Jimmy Brooks along with many others were written out of Degrassi: The Next Generation. Drake befriended Jas Prince and through his connections, Prince ended up playing Drake's music for American rapper Lil Wayne. Wayne was impressed and brought Drake along with him on his Tha Carter III tour. On February 13, 2009, Drake released his third mixtape So Far Gone. The album was successful, with the singles \"Best I Ever Had\" and \"Successful\" both entering the Billboard Hot 100 chart and both reaching Platinum status by the Recording Industry Association of America (RIAA). The album was later re-released as an extended play on September 15. The EP version won Rap Recording of the Year at the 2010 Juno Awards. Around this time, Drake released the song \"Forever\" featuring the American rappers Lil Wayne, Kanye West, and Eminem for the 2008 Lebron James documentary More than a Game. After the success of the albums, a bidding war took place between record labels to sign him. Drake eventually signed with Lil Wayne's label Young Money Entertainment on June 29, 2009. On June 15, 2010, Drake released his first studio album Thank Me Later. The album featured the singles \"Over\", \"Find Your Love\", \"Miss Me\", and \"Fancy\". It was certified 4× Platinum by the Recording Industry Association of America (RIAA). It sold 447,000 copies in its first week. To promote the album, Drake went on the 4-leg, 79 city Away from Home Tour. The tour was very successful and Drake started his own festival called OVO Festival in 2010. Drake released his second studio album Take Care on November 17, 2011. The album featured the singles \"Marvins Room\", \"Headlines\", \"Make Me Proud\", \"The Motto\", \"Take Care\", \"HYFR (Hell Ya Fucking Right)\", and \"Crew Love\". It was certified 8× Platinum by the Recording Industry Association of America (RIAA). It sold 631,000 copies in its first week. The album saw Drake perform more melodically and featured him singing more than his last album. It featured artists such as Rihanna, The Weeknd, and Lil Wayne. Drake won Best Rap Album for Take Care at the 55th Annual Grammy Awards. To promote the album, Drake went on the 3-leg, 65 city Club Paradise Tour. The tour was very successful. It made $42 million and was also the most successful tour in 2012. The tour was opened by Kendrick Lamar and A$AP Rocky. The same year, Drake provided the voice of Ethan in the movie Ice Age: Continental Drift. ==Discography== Solo studio albums * Thank Me Later (2010) * Take Care (2011) * Nothing Was the Same (2013) * Views (2016) * Scorpion (2018) * Certified Lover Boy (2021) * Honestly, Nevermind (2022) * For All the Dogs (2023) Collaborative studio albums * Her Loss (with 21 Savage) (2022) * Some Sexy Songs 4 U (with PartyNextDoor) (2025) ==Tours== ===Headlining=== * Away from Home Tour (2010) * Club Paradise Tour (2012) * Would You Like a Tour? (2013–2015) * Boy Meets World Tour (2017) * Assassination Vacation Tour (2019) * Anita Max Win Tour (2025) ===Co-headlining=== * America's Most Wanted Tour (2009) * Drake vs. Lil Wayne (2014) * Summer Sixteen Tour (2016) * Aubrey & the Three Migos Tour (2018) * It's All a Blur Tour (2023–2024) ==Filmography== ===Movie=== Year Film Role Notes 2007 Charlie Bartlett A/V Jones Minor role 2008 Mookie's Law Chet Walters Short film 2011 Breakaway Himself Cameo 2012 Ice Age: Continental Drift Ethan Voice role 2013 Anchorman 2: The Legend Continues Ron Burgundy fan Cameo 2014 Think Like a Man Too Himself 2017 6ix Rising Noisey documentary The Carter Effect Documentary, also executive producer 2019 Remember Me, Toronto Documentary by Mustafa the Poet 2022 Black Ice Documentary, executive producer 2023 For Khadija ===Television=== Year Title Role Notes 2001 Blue Murder Joey Tamarin Episode: \"Out-of-Towners: Part 1\" 2001–2008 Degrassi: The Next Generation James \"Jimmy\" Brooks Main role; 100 episodes 2002 Soul Food Fredrick Episode: \"From Dreams to Nightmares\" 2002 Conviction Teen Fish Television film 2005 Best Friend's Date Dater Episode: \"Season Finale\" 2005 Instant Star Himself Episode: \"Personality Crisis\" 2008 The Border PFC Gordon Harvey Episode: \"Stop Loss\" 2009 Being Erica Ken Episode: \"What I Am Is What I Am\" 2009 Sophie Ken Episode: \"An Outing with Sophie\" 2009 Beyond the Break Himself Episode: \"One 'Elle' of a Party\" 2010 When I Was 17 Episode: \"Drake, Jennie Finch & Queen Latifah\" Drake: Better Than Good Enough Himself MTV documentary 2011 Juno Awards Host Television special Saturday Night Live Himself (musical guest) Episode: \"Anna Faris/Drake\" 2012 Punk'd Himself Episode: \"Drake/Kim Kardashian\" 2014, 2016 Saturday Night Live Himself (host/musical guest) Episode: \"Drake\" 2018 The Shop Himself Episode 2 2018 The Egos Himself Episode: \"OMP: Drake\" 2019– Euphoria Executive producer 2019–2023 Top Boy Executive producer 2021–2022 Chillin' Island Executive producer 2023 Saint X Executive producer == Personal life == Drake is a father to a son named Adonis with French artist Sophie Brussaux. In March 2020, Drake contracted COVID-19. He became one of the first high-profile celebrities to contract the virus. He mentioned that the virus had caused him to lose his hair which later came back. He later had to postpone some Young Money reunion shows with Lil Wayne and Nicki Minaj because he had contracted COVID-19 again. In October 2023, Drake signed a letter along with other artists which called for a ceasefire in the Israel–Hamas war. ==References== == Other websites == * * Category:1986 births Category:Living people Category:21st-century Canadian singer- songwriters Category:African-American rappers Category:Brit Award winners Category:Canadian businesspeople Category:Canadian child actors Category:Canadian hip hop singers Category:Canadian Jews Category:Canadian movie actors Category:Canadian rappers Category:Canadian television actors Category:Canadian voice actors Category:Canadian philanthropists Category:Canadian pop singers Category:Canadian songwriters Category:Trap musicians Category:Urban pop musicians Category:Canadian Grammy Award winners Category:Jewish actors Category:Jewish musicians Category:Jewish writers Category:Pop rappers Category:R&B; singers Category:Writers from Toronto",
 "title": "Drake (musician)"
}