{
 "id": "211010",
 "text": "Hedy Lamarr (9 November 1914 – 19 January 2000) was an Austro-Hungarian-born American film actress and inventor. She was a film star during Hollywood's golden age. After a brief film career in Europe, including Ecstasy (1933), Lamar moved to the United States. She became a film star with her performance in Algiers (1938). Her MGM films include Lady of the Tropics (1939), Boom Town (1940), H.M. Pulham, Esq. (1941), and White Cargo (1942). Her greatest success was as Delilah in Samson and Delilah (1949). She also acted on television before the release of her final film, The Female Animal (1958). She was honored with a star on the Hollywood Walk of Fame in 1960. At the beginning of World War II, she and avant-garde composer George Antheil developed a radio guidance system for Allied torpedoes that used spread spectrum and frequency hopping technology to defeat the threat of jamming by the Axis powers. ==Life== Hedy Lamarr was born as Hedwig Eva Maria Kiesler in Vienna. She was the daughter of a bank director and a concert pianist. She studied ballet and piano at age 10. Later, the famous director Max Reinhard in Berlin said she was the most beautiful woman in Europe. She worked in movies and in her third movie played her first title role (Man braucht kein Geld or No Money Needed). The 1933 movie Ecstasy was considered a scandal as it showed her bathing naked and running through a wood naked. Later that year, she married, but left her husband in 1937. She signed a contract with MGM in London and went to the USA, where she became a film star and spent the rest of her life. With a musician friend she patented a torpedo to be controlled by spread spectrum radio signals. She became a US citizen in 1953. She died in Altamonte Springs, Florida. ==Filmography== *Das Geld liegt auf der Straße (Money on the Street, 1930) *Die Frau von Lindenau (Storm in a Water Glass, 1931) *Die Abenteuer des Herrn O. F. (The Adventures of Mr. O. F., 1931) *Man braucht kein Geld (We Need No Money, 1932) *Ekstase / Symphonie der Liebe (Ecstasy, 1933) *Algiers (1938) (download or play it) *Hollywood Goes to Town (1938) (short subject) *Screen Snapshots: Stars at a Charity Ball (1939) (short subject) *Lady of the Tropics (1939) *I Take This Woman (1940) *Boom Town (1940) *Comrade X (1940) *Come Live With Me (1941) *Ziegfeld Girl (1941) *H.M. Pulham, Esq. (1941) *Tortilla Flat (1942) *Crossroads (1942) *White Cargo (1942) *Show Business at War (1943) (short subject) *The Heavenly Body (1944) *The Conspirators (1944) *Experiment Perilous (1944) *Her Highness and the Bellboy (1945) *The Strange Woman (1946) (download or play it) *Dishonored Lady (1947) (download or play it) *Let's Live a Little (1948) *Samson and Delilah (1949) *A Lady Without Passport (1950) *Copper Canyon (1950) *My Favorite Spy (1951) *The Eternal Female (1954) (unfinished) *Loves of Three Queens (1954) *The Story of Mankind (1957) *The Female Animal (1958) *Instant Karma (1990) [archive footage] ==References== ==Other websites== * Category:1914 births Category:2000 deaths Category:Actors from Vienna Category:American autobiographers Category:American inventors Category:American movie actors Category:American television actors Category:Austrian movie actors Category:Austrian television actors Category:Naturalized citizens of the United States",
 "title": "Hedy Lamarr"
}