{
 "id": "211005",
 "text": "Michael John \"Mike\" Myers, (born 25 May 1963) is a Canadian actor, comedian, director, producer and screenwriter. He was a comedian on Saturday Night Live from 1989 to 1995. He has acted in movies including: Wayne's World, Austin Powers: International Man of Mystery, Austin Powers: The Spy Who Shagged Me, Austin Powers in Goldmember, Shrek and The Love Guru. Myers was born to English parents (from Ancoats, Manchester) and raised in Scarborough, Toronto, Ontario, Canada. He holds three citizenships: Canadian, British and American. ==Filmography== Year Title Role Notes 1992 Wayne's World Wayne Campbell Also writer 1993 So I Married an Axe Murderer Charlie McKenzie / Stuart McKenzie Wayne's World 2 Wayne Campbell Also writer 1997 Austin Powers: International Man of Mystery Austin Powers / Dr. Evil Also writer and producer 1998 54 Steve Rubell Tim Broderick Pete's Meteor Pete 1999 Austin Powers: The Spy Who Shagged Me Austin Powers / Dr. Evil / Fat Bastard Also writer and producer Mystery, Alaska Donnie Shulzhoffer 2001 Shrek Shrek (voice) 2002 Austin Powers in Goldmember Austin Powers / Dr. Evil / Fat Bastard / Goldmember Also writer and producer 2003 Nobody Knows Anything! 'Eye' Witness The Cat in the Hat View from the Top John Witney 2004 Shrek 2 Shrek (voice) 2006 Home Himself Documentary 2007 Shrek the Third Shrek (voice) 2008 Guru Maurice Pitka / Himself Also writer and producer 2009 Inglourious Basterds Gen. Ed Fenech 2010 Shrek Forever After Shrek (voice) 2012 Oscar Etiquette Sir Cecil Worthington Short film 2013 Being Canadian, Sometimes Himself Documentary Supermensch: The Legend of Shep Gordon Himself Documentary; also director 2015 I Am Chris Farley Himself Documentary 2018 Terminal Clinton / Mr. Franklyn Bohemian Rhapsody Ray Foster TBA Zootopia 2 Tadashi Gorki (voice) === Television === Year Title Role Notes 1975 King of Kensington Ari Episode: \"Scout's Honour\" 1977 Range Ryder and the Calgary Kid Himself 1979 The Littlest Hobo Tommy Episode: \"Boy on Wheels\" 1980 Bizarre Various 1985 John and Yoko: A Love Story Delivery Boy Uncredited Television film 1986–1987 Wide Awake Club Sound Asleep Club 2 episodes 1987 Meet Julie Ship Captain (voice) Television film 1987 It's Only Rock & Roll Various 13 episodes 1987 110 Lombard Street Mike Television pilot 1989 Elvis Stories Cockney Man Television short 1989–2015 Saturday Night Live Various 121 episodes; also writer 1991 Saturday Night Live: Halloween Special Wayne Campbell Television special 1992 Saturday Night Live: All the Best for Mother's Day Himself 1997 1997 MTV Movie Awards Himself (host) 2007 Shrek the Halls Shrek Voice Television special 2008 2008 MTV Movie Awards Himself (host) Television special 2008 Saturday Night Live: The Best of Mike Myers Himself Television special 2010 Scared Shrekless Shrek Voice Television special 2014 Monty Python Live (Mostly) Himself Television special 2015 Last Week Tonight with John Oliver Himself Episode: \"Canada\" Saturday Night Live 40th Anniversary Special Wayne Campbell Television special 2017–2018 The Gong Show Tommy Maitland (host) 20 episodes; also executive producer 2018 The Tonight Show Starring Jimmy Fallon Dr. Evil 2 episodes 2022 The Pentaverate Various roles Also creator, writer, voice actor and executive producer; 6 episodes == References == == Other websites == * Category:1963 births Category:Living people Category:Actors from Toronto Category:American game show hosts Category:American movie actors Category:American movie producers Category:American screenwriters Category:American television actors Category:American television personalities Category:American television writers Category:American voice actors Category:British game show hosts Category:British movie actors Category:British movie producers Category:British screenwriters Category:British television actors Category:British television personalities Category:British television writers Category:British voice actors Category:Canadian movie actors Category:Canadian movie producers Category:Canadian screenwriters Category:Canadian television actors Category:Canadian television writers Category:Canadian voice actors Category:Canadian comedians Category:Naturalised citizens of the United Kingdom Category:Naturalized citizens of the United States Category:Order of Canada Category:Writers from Toronto",
 "title": "Mike Myers"
}