{
 "id": "211180",
 "text": "The animals of New Zealand have an unusual history. The main thing to know is that the islands were part of Gondwana, from which they separated 84 million years (mya) ago. New Zealand has some animals and plants which survive from that time, and birds which flew there much later. The islands are well known for their terrestrial birds, some of which were large species (the moas). For millions of years the islands did not have any native mammalian carnivores, and the moas' only predators were other birds, such as the giant Haast's eagle. ==History== Humans arrived in New Zealand less than 1,300 years ago. New Scientist Webpage: Rat remains help date New Zealand's colonisation. Accessed 2008-06-23 At that time the country's only mammals were bats (which flew there), and pinnipeds and sea lions (which swam there). This meant that all the ecological niches occupied by mammals in other lands were occupied in New Zealand by either insects or birds. Because of this, the country has an unusually large number of flightless birds, of which only the kiwi, and the kakapo survive. Because of the lack of predators, even the bats spend most of their time on the ground. There are also about 60 species of lizard (30 of gecko and 30 of skink), and four species of frog (all rare and endangered). There are two species of tuatara, Sphenodon, the only surviving reptile in its order. These living fossils are reptiles of a type which flourished as long ago as 200 million years. Russell, Matt 1998. Tuatara, relics of a lost age. Cold Blooded News. Colorado Herpetological Society. While mapping its genome, it has been discovered that the species has between five and six billion base pairs of DNA sequence.Tuatara genome mapping | Otago Daily Times Online News The reptile now lives only on the islands in the Cook Strait and the Bay of Plenty. Humans brought with them the Polynesian Rat (Kiore) and the dog. Europeans later brought their domesticated animals. Of these, the rats, ferrets, cats, stoats and dogs have all had serious effect on the original New Zealand animals. They have driven many species to extinction. Possums were later introduced from Australia for a fur industry, and deer from Europe as animals to be hunted. Both seriously damaged the forest habitat of many birds. In recent years people made efforts to remove mammals from off shores either the animals are big or small. In some parts of the mainland, mammals are being completely eliminated inside fenced areas to create \"ecological islands\". Examples are the Karori Wildlife Sanctuary in Wellington City, from which about a ton of dead possums was removed after the installation of a mammal-proof fence, and the Maungatautari Restoration Project. ==References== ==Other websites== * Native animals of New Zealand - Department of Conservation. * Animals of New Zealand - children's learning aid.",
 "title": "Animals of New Zealand"
}