{
 "id": "211163",
 "text": "The Wannsee Conference was a meeting of senior Nazi officials during World War II. It was organized by Adolf Eichmann and Reinhart Heydrich, and took place in the Berlin suburb of Wannsee on 20 January 1942. At the Conference, the officials (from various government departments that dealt with Jews) worked together to plan the Holocaust. They predicted that 11,000,000 Jews would be killed or deported under their proposed plan. == Attendees == Many important Nazi officials attended the Wannsee Conference. They were all expected to agree with the plans discussed in the meeting. === Schutzstaffel (SS) officials === ==== Context ==== The SS was a Nazi paramilitary organization that played a key role in implementing the Holocaust by: * Mass-murdering Jews * Leading death squads called Einsatzgruppen * Running concentration camps like Dachau and Buchenwald * Running extermination camps (death camps) like Auschwitz ==== SS Attendees ==== SS officers Adolf Eichmann and Reinhart Heydrich organized and ran the Wannsee Conference. Eichmann had been put in charge of finding a \"Final Solution to the Jewish question.\" Both he and Heydrich played central roles in planning the Holocaust. Other SS officials who attended were: * Heinrich Müller, who led the Gestapo (the Nazi secret police) * Rudolf Lange and Karl Schöngarth, who led Einsatzgruppen death squads in German-occupied Latvia * Otto Hofmann, head of the Race and Settlement Main Office === Representing agencies of the state === The following people represented agencies or departments of the Nazi government: * Martin Luther, a diplomat in the Foreign Office of Germany * Wilhelm Stuckart, who co-wrote the Nuremberg Laws * Josef Bühler, who helped lead the General Government (German-occupied Poland) * Georg Leibbrandt and Alfred Meyer, who worked in the Reich Ministry for the Occupied Territories * Erich Neumann, who was working on a four-year plan to improve the German economy * Roland Freisler, the State Secretary of the Reich Ministry of Justice * Reich Chancellory officials Friedrich Wilhelm Kritzinger and Gerhard Klopfer == Proposed plan == Heydrich presented a plan for killing or deporting 11,000,000 Jews from Europe and French-controlled North Africa (Morocco, Algeria, and Tunisia). Previously, the Nazi government was allowing Jews to emigrate to countries outside Nazi Germany. However, according to a rare transcript of the Conference: “Due to the war, the emigration plan has been replaced with deportation of the Jews to the east, in accordance with the Führer’s [Adolf Hitler's] will.” Under Heydrich's plan, people who were not healthy enough to do forced labor would be deported to concentration camps. People who could work would be deported eastward to build roads. However, it was expected that they would be worked to death; if not, they would be executed once the projects were finished. The Nazis' ultimate goal was to have no Jews in any Nazi-controlled area in the world. This effort to exterminate the Jewish people is called the Holocaust. == Effects & legacy == The Wannsee Conference is viewed as a key event in the planning of the Holocaust. As a result of the meeting, the Nazis built a network of extermination camps. In these camps alone, 1.7 million Jews were murdered between 1942-1943. The Wannsee House, where the Conference was held, is now a Holocaust Memorial due to the efforts of historian Joseph Wulf. == References== Category:Nazism Category:The Holocaust",
 "title": "Wannsee Conference"
}