{
 "id": "211132",
 "text": "An ecological niche is the part of the environment into which a species fits, and to which it is adapted.In general use 'niche' means a recess in a wall to hold a small statue, a nook or cranny. A shorthand definition of niche in biology is how an organism makes a living in a place. However, the term has been used in different ways. Pocheville, Arnaud et al 2015. The ecological niche: history and recent controversies. In Heams, Thomas (ed) Handbook of evolutionary thinking in the sciences. Dordrecht: Springer. pp. 547–586. ISBN 978-94-017-9014-7 Three variants of ecological niche are described by It is not only a place but a way of life. For example, grazers, insectivores, scavengers and predators can all live their different lifestyles in the same forest. A niche can be occupied by different species in different places even though they 'earn their living' in roughly the same way. Thus the 'bird of prey eating small mammals' niche would in grasslands include the kestrel, but in an oak wood it would be filled by the tawny owl.McFarland, David 1981. The Oxford companion to animal behaviour. Oxford University Press, Oxford. 411 The idea of a niche in natural history is ancient: many writers noticed that animals and plants live in places where they are well adapted to live. The word niche was first used in biology by naturalist Roswell Johnson,Johnson R.H. 1910. Determinate evolution in the color-pattern of the lady-beetles. Washington WC: Carnegie Institution of Washington. but in 1917 Joseph Grinnell was the first to use it in a research program.Grinell J. 1917. The niche- relationships of the California thrasher. Auk 34, 427–433 Later, he described the niches of a variety of species.Grinnell J. & Storer T.I. 1924. Animal life in the Yosemite: an account of the mammals, birds, reptiles, and amphibians in a cross-section of the Sierra Nevada. Berkeley: University of California Press. Grinnell was the first to offer the \"exclusion principle\" in which only one species could occupy a particular niche at any one time.Grinnell J. 1928. Presence and absence of animals. University of California Chronicle, 30 , 429–450.Gause G.F. 1934. The struggle for existence. Baltimore: Williams & Wilkins. Scientists who study the interactions between living things, such as animals and their environment are called ecologists, and their branch of science is called ecology. A niche is a term which describes a position or opportunity into which some organism fits well. Thus, an ecological niche is a place in nature that is filled by an animal or plant because it is well suited to do so.Mayr, Ernst 2001. What evolution is. Weidenfeld & Nicolson, London. p152Hutchinson G.E. 1978. An introduction to population ecology. New Haven: Yale University Press.Merrell, David J. 1981. Ecological genetics. U of Minnesota Press, 248-250. . == Invasions == When a niche is left open, for example by extinction, other organisms may fill that position. Also, invasive species of plants and animals in a new land often take over all or part of the niches of native organisms. Sometimes the loss results in the extinction of the natives.Elton C.S. 1958. The ecology of invasions by animals and plants. Chapman & Hall, London. ==Niche differentiation== In ecology, niche differentiation (also known as niche segregation, niche separation and niche partitioning) is how competing species use the environment differently in a way that helps them to coexist.Niche differentiation: Jessica Harwood, Douglas Wilkin (August, 2018). \"Habitat and Niche\". Retrieved from https://www.ck12.org/biology/habitat-and-niche/lesson/Habitat-and-Niche-MS- LS/. ==Related pages== *Habitat == References == Category:Habitats",
 "title": "Ecological niche"
}