{
 "id": "21161",
 "text": "Formula One (F1) is a motorsport championship controlled by the Fédération Internationale de l'Automobile. Teams compete in a series of Grand Prix races, held in different countries around the world. Some of the most popular races are held in Monaco, Singapore, Italy and Britain. The Formula One cars are very fast, they reach speeds of up to 351.7 km/ hour (218.5 mph). The championship has been won by many different teams, including McLaren, Ferrari and Williams. Teams can have as many as 600 people. The teams all come together every race weekend. They use the expertise of each member try to win the race. The winning driver and team each get twenty-five points towards the Drivers' and Constructors' Championship. Teams consist of drivers, test drivers, a team principal, mechanics, engineers, and designers. Winning a race is affected by a good starting position, strategy, skill in pitstops and a fast car. The person with the most pole positions (fastest time set in qualifying) during a season gets a trophy. This was added in 2014. One of the longest tracks raced on was the Nürburgring, which is not used anymore. The body that runs Formula One, the Fédération Internationale de l'Automobile (FIA), is based in France. Although Formula One is a 'billion dollar business', a drop in viewership and attendance figures at races has caused the FIA to make rule changes in recent years. These changes are meant to make the races more interesting, so more people watch F1 on television. == Safety == Drivers are paid large salaries to risk their lives every time they drive an F1 car. Like all types of motor racing, the dangers with Formula One are great. Because of this, there are many safety measures. Drivers wear 4 layers of flameproof overalls. They are made of a fire resistant material called Nomex. A drivers helmet must be able to resist an 800 °C flame for at least 45 seconds. They must also resist high G-forces. The helmets are very strong as well, even being able to withstand a truck driving over it. == Cars == Carbon fibre is the ideal material for the body of Formula One cars, because it is light and strong. Because of this, the cars are very expensive to build and repair. The design of cars differs from team to team. Each team has two entries into the championship. This means that each team must built and maintain two cars . F1 currently uses Pirelli tires (5 compounds of slick tyres and 2 compounds of non-slick tyres for wet weather) Differing weather conditions need different tires. Wet weather driving is considered a skill in Formula One. In 2021, The specifications of an F1 car is 786kg minimum weight, 18 inch wheels and tires. Engines must be 1.6L V6 turbo hybrid intercooled and must reach higher than 3000rpm. The engine must be 4 stroke (Intake, Compression, Combustion and exhaust) and have a 90 degree angle between the V shape. ==Related pages== * Formula One racing * List of Formula One broadcasters == References == Category:1950 establishments in Europe",
 "title": "Formula One"
}