{
 "id": "211714",
 "text": "== Winners == === Repeat winners (drivers) === Drivers in bold are competing in the Formula One championship in the current season. Wins Driver Years won 5 Lewis Hamilton 2014, 2015, 2019, 2020, 2021 4 Sebastian Vettel 2012, 2013, 2017, 2018 3 Fernando Alonso 2005, 2006, 2010 2 Felipe Massa 2007, 2008 2 Max Verstappen 2023, 2024 === Repeat winners (constructors) === Teams in bold are competing in the Formula One championship in the current season. Wins Constructor Years won 7 Ferrari 2004, 2007, 2008, 2010, 2017, 2018, 2022 6 Mercedes 2014, 2015, 2016, 2019, 2020, 2021 4 Red Bull Racing-Honda-RBPT 2012, 2013, 2023, 2024 2 Renault 2005, 2006 === Repeat winners (engine manufacturers) === Manufacturers in bold are competing in the Formula One championship in the current season. Wins Manufacturer Years won 7 Ferrari 2004, 2007, 2008, 2010, 2017, 2018, 2022 7 Mercedes 2009, 2014, 2015, 2016, 2019, 2020, 2021 4 Renault 2005, 2006, 2012, 2013 2 Honda-RBPT 2023, 2024 === Year by year === Year Driver Constructor Configuration Report Ferrari Sakhir Grand Prix Circuit Report Renault Report Renault Report Ferrari Report Ferrari Report Brawn-Mercedes Report Ferrari Sakhir Endurance Circuit Report Cancelled due to 2011 Bahraini uprising Report Red Bull-Renault Sakhir Grand Prix Circuit Report Red Bull-Renault Report Mercedes Report Mercedes Report Mercedes Report Ferrari Report Ferrari Report Mercedes Report Mercedes Report Mercedes Report Ferrari Report Red Bull-Honda RBPT Report Red Bull-Honda RBPT Report Sources: Sources: Sources: Sources: Sources: ==Broadcasting== ===United Kingdom=== Year Network Lap-by-lap Colour commentator(s) Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle Channel 4 Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard Sky Sports F1 David Croft Martin Brundle BBC One Ben Edwards David Coulthard BBC One Jonathan Legard Martin Brundle BBC One Jonathan Legard Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ITV James Allen Martin Brundle ==References== Category:Formula One Grands Prix Category:Sport in Bahrain Category:2004 establishments in Asia",
 "title": "Bahrain Grand Prix"
}