{
 "id": "212078",
 "text": "Brawn GP Brawn GP Full name Brawn GP F1 Team Team leader Ross Brawn 2009 Formula One season 2009 Formula One season Race drivers 22 Jenson Button 23 Rubens Barrichello Car name Brawn BGP 001 2009 position 1st (172 points) The Brawn GP Formula One Team was a Formula One motor racing team. Brawn GP started on 6 March 2009 when Ross Brawn, the old team leader for Honda, Ferrari and Benetton, bought the team after Nick Fry, the commercial manager, convinced him into it for £1. On 17 March 2009 the FIA agreed to change the name from Honda Racing F1 Team to Brawn GP. Even though the team was just the Honda team with a new name, the FIA considered Brawn GP to be a new team, but agreed to let them join F1 for free instead of the usual price. Brawn GP first raced at the 2009 Australian Grand Prix on 28 March 2009, where they took 1st and 2nd place in qualifying. The team went on to win the top two positions in their debut Grand Prix race on 29 March 2009, with Jenson Button winning the race and Rubens Barrichello coming in second. The team used Mercedes-Benz engines and its cars were driven by the old Honda team of Jenson Button and Rubens Barrichello, which been together for 3 years prior. In the early part of the season, several other sponsors were signed, including Virgin, M I G Investments, Henri Lloyd and PerkinElmer. On 18 October 2009, at the Brazilian Grand Prix, Button won the 2009 Drivers' Title in his first season for Brawn GP. He and teammate Barrichello secured Brawn GP enough points to win Brawn the Constructors' Championship in its first and only season. As a result, Brawn GP is the only F1 Team to win 100% of the seasons it has competed in. The following month, Mercedes bought major stakes in Brawn GP, renaming themselves Mercedes AMG Petronas, making Mercedes the owners but allowing Ross Brawn and Nick Fry to continue working in their positions till the pair left in 2013. Nick left before the season began and Brawn on 31 December. Category:Formula One constructors",
 "title": "Brawn GP"
}