{
 "id": "212171",
 "text": "Red Bull Racing is a Formula One racing team owned by Austrian beverage company Red Bull. Red Bull also own another F1 team: Visa Cash App RB F1 Team. The Red Bull team is based in Milton Keynes in the UK but holds an Austrian licence. The team is managed by Christian Horner who is also the boss of the Arden International, which participates to the GP2 Series and to the Formula Renault 3.5 Series. == Formula One World Championship results == (Bold indicates championships won.) Year Name Car Engine Tyres No. Drivers Points Position Red Bull Racing RB1 Cosworth TJ2005 3.0 V10 14. 15. 15\\. David Coulthard Christian Klien Vitantonio Liuzzi 34 7th Red Bull Racing RB2 Ferrari 056 2.4 V8 14. 15. 15\\. David Coulthard Christian Klien Robert Doornbos 16 7th Red Bull Racing RB3 Renault RS27 2.4 V8 14. 15\\. David Coulthard Mark Webber 24 5th Red Bull Racing RB4 Renault RS27 2.4 V8 9. 10\\. David Coulthard Mark Webber 29 7th Red Bull Racing RB5 Renault RS27 2.4 V8 14. 15\\. Mark Webber Sebastian Vettel 153.5 2nd Red Bull Racing RB6 Renault RS27-2010 2.4 V8 5. 6\\. Sebastian Vettel Mark Webber 498 1st Red Bull Racing RB7 Renault RS27-2011 2.4 V8 1. 2\\. Sebastian Vettel Mark Webber 650 1st Red Bull Racing RB8 Renault RS27-2012 2.4 V8 1. 2\\. Sebastian Vettel Mark Webber 460 1st Infiniti Red Bull Racing RB9 Renault RS27-2013 2.4 V8 1. 2\\. Sebastian Vettel Mark Webber 596 1st Infiniti Red Bull Racing RB10 Renault Energy F1-2014 1.6 V6 t 1. 3\\. Sebastian Vettel Daniel Ricciardo 405 2nd Infiniti Red Bull Racing RB11 Renault Energy F1-2015 1.6 V6 t 3. 26\\. Daniel Ricciardo Daniil Kvyat 187 4th Red Bull Racing RB12 TAG Heuer 1.6 V6 t 3. 26. 33\\. Daniel Ricciardo Daniil Kvyat Max Verstappen 468 2nd Red Bull Racing RB13 TAG Heuer 1.6 V6 t 3. 33\\. Daniel Ricciardo Max Verstappen 368 3rd Aston Martin Red Bull Racing RB14 TAG Heuer 1.6 V6 t 3. 33\\. Daniel Ricciardo Max Verstappen 419 3rd Aston Martin Red Bull Racing RB15 Honda RA619H 1.6 V6 t 10. 23. 33\\. Pierre Gasly Alex Albon Max Verstappen 417 3rd Aston Martin Red Bull Racing RB16 Honda RA620H 1.6 V6 t 23. 33\\. Alex Albon Max Verstappen 319 2nd Red Bull Racing Honda RB16B Honda RA621H 1.6 V6 t 11. 33\\. Sergio Pérez Max Verstappen 585.5 2nd Oracle Red Bull Racing RB18 Red Bull RBPTH001 1.6 V6 t 1. 11\\. Max Verstappen Sergio Pérez 759 1st Oracle Red Bull Racing RB19 Honda RBPTH001 1.6 V6 t 1. 11\\. Max Verstappen Sergio Pérez 860 1st Oracle Red Bull Racing RB20 Honda RBPTH001 1.6 V6 t 1. 11\\. Max Verstappen Sergio Pérez 512* 3rd* * Season still in progress. ===Drivers' Champions=== The following drivers won the Formula One Drivers' Championship for Red Bull: * Sebastian Vettel (, , , ) * Max Verstappen (, , , ) == References == Category:Formula One constructors Category:Formula One current Category:Red Bull",
 "title": "Red Bull Racing"
}