{
 "id": "21243",
 "text": "The Isle of Man () is an island in the Irish Sea, off the coast of Great Britain (of which it is a crown dependency). Douglas is the capital city. It also has a flag with a red background and 3 armoured legs joined together - \"whichever way you throw us, we always land on our feet\". It has a Parliament called Tynwald which is over 1,000 years old. This makes it the longest running parliament in the world. ==Government== The Isle of Man is a Crown dependency. Foreign affairs, defence, and good government are handled by the British government, but in all other matters the island is independent. The Isle of Man Government is the executive branch and proposes laws to the legislature, Tynwald. Laws passed by Tynwald are given royal approval by the Lieutenant Governor unless the British Minister of Justice says they do not help the good government of the island. ==Geography== The Isle of Man is an island in the Irish Sea, northwest of the European continent. It is between the United Kingdom and Ireland. The island is 22 kilometres (km) wide and 52 km long, with a total area of 572 km².Geography: Physical Geography . Isle of Man Public Services (2010). Retrieved 3 June 2010. It has a total of 160 km of coastline, but no important bodies of water. Apart from the island itself, the Isle of Man also includes some nearby islands. The most important of these islands are Calf of Man, St Patrick's Isle, and St Michael's Isle. The island's terrain is varied. It has mountains in the north and south. A valley is more or less in the center of the island, between the cities of Douglas and Peel. The northern part of the island is very flat. Snaefell is the Isle of Man's highest mountain. Its peak is 621 meters above sea level. Scotland, England, Ireland and Wales are visible from the top of the mountain.Travelling on the Snaefell Mountain Railway. Isle of Man Guide. Retrieved 30 August 2009. ==Weather== The Isle of Man generally has mild weather. Summers are cool and winters are mild and rainy. On average, the island gets about as much rainfall as the other British Isles. However, elevated parts of the Isle of Man get more rainfall, especially Mount Snaefell. The northern and southern parts of the island are not as rainy as the rest.Climate. Isle of Man Guide. Retrieved 3 June 2010. The island's temperature is normally cool. The highest temperature ever registered is 28.9° C (84° F) in Ronaldsway. The Isle of Man is not very sunny, but it is less cloudy than other parts of the British Isles; strong winds around the island help keep clouds in constant movement. == Geology == The island's geology of is notable for the Iapetus Suture, which runs almost unseen right through the rocks of the island. The suture is the remnant of a once huge ocean, the Iapetus Ocean, which was lost about 420 million years ago as three continents came together. ==Environment== The Isle of Man became separated from Ireland and the British Isles about 8500 years ago. Between the melting of glaciers and the rise of sea level, there was a short period that allowed a small number of species to colonize the island by land. People heavily deforested the island in the Middle Ages, which weakened its environment. Some land is now protected by the government to help preserve its wildlife. Curraghs Wildlife Park, in the wetlands, is home to many species of animals and plants. ===Plant life=== A lot of the Isle of Man's plant life, or flora, is composed of shrubs (bushes) and other short plants. Several species of flowering plants, grass, and moss also live there. Mosses on the island contribute to the formation of peat in wet areas. Common trees include ashes, elms, pines, willows, and hawthorns. Bogs are home to ferns and orchids.Creatures Great and Small - Cretooryn Mooarey's Beggey. Isle of Man Government (2010). Retrieved 3 June 2010.Tree Gallery . Isle of Man Woodland Trust. Retrieved 3 June 2010.Nature Trail . Isle of Man Government (2010). Retrieved 3 June 2010. === Birds === The Peregrine Falcon, Merlin, European Robin, Willow Warbler, Song Thrush, Dunnock, Swan and a subspecies of Winter Wren are possibly native to the island and nest in the curraghs. The Chough is also in the Isle of Man, and is more common there than in other parts of Europe.Manx Wildlife . Isle of Man Government (2010). Retrieved 3 June 2010. Some farming methods have decreased the bird population of the island. The Northern Lapwing is now rarely found, and the Yellowhammer is now extinct on the island.Manx Bird life prepares to celebrate twelfth birthday. BBC (16 February 2010). Retrieved 3 June 2010. === Insects and animals === 18 species of butterfly and 250 species of moth also live on the Isle of Man. Most of them live in the wetlands during different seasons.The Butterfly Trail . Isle of Man Government (2010). Retrieved 3 June 2010. The Manx cat originated on the Isle of Man.Hall, Marion (1995). \"The Manx Cat\". Cat Fanciers' Almanac. Alliance, Ohio, US: Cat Fanciers' Association. This breed is known for having short or no tails due to a genetic mutation. === Curraghs === Many species live in \"curraghs\" (wetlands in the northeast of the island). Curraghs are protected by the Government of the Isle of Man. During the winter, curraghs are the second largest nesting ground of the Hen Herrier in Europe. Curraghs Wildlife Park is a major zoo and protected area in these wetlands. ==References== ==Other websites== *Manx Government Website A comprehensive site covering many aspects of Manx life from fishing to financial regulation *Google Maps Satellite Photo * *Isle of Man Guide Large website about the island *Information on places in the Isle of Man *Tynwald.org Hansards, Order Papers and Background to the Manx Government. *Manx Radio The Government/commercial funded radio station for the Isle of Man *Birching in the Isle of Man 1945-1976 Article about the use of the birch as a judicial punishment in the Isle of Man. *Manx Notebook Manx History Archive.",
 "title": "Isle of Man"
}