{
 "id": "212753",
 "text": "André René Roussimoff (May 19, 1946 – January 27, 1993) better known by his ring name, André the Giant, was a French professional wrestler and actor. He was best known for wrestling with World Wrestling Federation (WWF). He also wrestled for New Japan Pro Wrestling (NJPW) and All Japan Pro Wrestling (AJPW). His size was caused by gigantism, that was caused by excess growth hormone and would later result in acromegaly. His size led to him being called \"The Eighth Wonder of the World\". During his professional wrestling career, he was a one time WWF champion and a one time WWF World Tag Team champion with Haku. In the WWF, he was managed by Bobby \"The Brain\" Heenan and had a well- known feud with Hulk Hogan. He beat Hogan on The Main Event in 1988 to win his first and only WWF Championship. In 1993, He became the first superstar to be inducted into the WWE Hall of Fame. His best known acting role was as Fezzik in the 1987 movie The Princess Bride. On January 27, 1993, he died of congestive heart failure while he was sleeping in his Paris hotel room. He was in Paris to go to his father's funeral. ==Championships== * Championship Wrestling from Florida ** NWA Florida Tag Team Championship (one time) (with Dusty Rhodes) * International Pro Wrestling ** IWA World Tag Team Championship (one time) (with Michael Nador) * New Japan Pro Wrestling ** International Wrestling Grand Prix (1985) ** MSG League (1982) ** MSG Tag League (1981) (with Rene Goulet) ** Sagawa Express Cup (1986) * NWA Tri-State ** NWA United States Tag Team Championship (Tri-State version) (one time) (with Dusty Rhodes) * Professional Wrestling Hall of Fame and Museum ** Class of 2002 * Pro Wrestling Illustrated ** PWI Most Popular Wrestler of the Year (1977, 1982) ** PWI Match of the Year (1981) (vs. Killer Khan on May 2) ** PWI Match of the Year (1988) (vs. Hulk Hogan at The Main Event) ** PWI Most Hated Wrestler of the Year (1988) ** PWI Editor's Award (1993) ** He was ranked #3 of the 500 best singles wrestlers of the \"PWI Years\" in 2003. * Stampede Wrestling ** Stampede Wrestling Hall of Fame * World Championship Wrestling (Australia) ** NWA Austra-Asian Tag Team Championship (one time) (with Ronald Miller) * World Wrestling Federation ** WWF Championship (one time) ** WWF Tag Team Championship (one time) (with Haku) ** Slammy Award for Bobby \"The Brain\" Heenan Scholarship Award (1987) (with Haku, Tama, Hercules, King Kong Bundy, and Harley Race) ** WWF Hall of Fame (Class of 1993) * Wrestling Observer Newsletter awards ** Feud of the Year (1981) (vs. Killer Khan) ** Most Embarrassing Wrestler (1989) ** Worst Feud of the Year (1984) (vs. Big John Studd) ** Worst Feud of the Year (1989) (vs. The Ultimate Warrior) ** Worst Worked Match of the Year (1987) (vs. Hulk Hogan at WrestleMania III) ** Worst Worked Match of the Year (1989) (vs. The Ultimate Warrior on October 31) ** Worst Tag Team (1990, 1991) (with Giant Baba) ** Worst Wrestler (1989, 1991, 1992) ** Wrestling Observer Newsletter Hall of Fame (Class of 1996) ==References== ==Other websites== * Official website * Andre the Giant's profile on WWE.com Category:1946 births Category:1993 deaths Category:Deaths from heart failure Category:Former WWE wrestlers Category:Actors from Auvergne-Rhône-Alpes Category:Sportspeople from Auvergne-Rhône-Alpes Category:People from Grenoble Category:WWE Hall of Fame",
 "title": "André the Giant"
}