{
 "id": "213197",
 "text": "The Tōkaidō Shinkansen () is a high speed railway line of Central Japan Railway Company (JR Central) in Japan. It is also the first high speed railway line in the world, and it marked the start of the Shinkansen technology. ==Trains== There are three types of trains serving this route. When the Tōkaidō Shinkansen started operations in 1972, only Hikari and Kodama were serving this line. Among the two trains types, Kodama trains stop at all stations, while the Hikari trains skip some of the stations to make the travel shorter. In early 1990s, Nozomi was added to the service. Nozomi trains skips even more stations then the Hikari, which is now the fastest service on this route. ==Station== Station in Japanese Ward / City Distance (km) (from Tokyo) Transfers Tokyo 東京 Chiyoda, Tokyo 0.0 JR East: Tōhoku Shinkansen, Jōetsu Shinkansen, Hokuriku Shinkansen, Yamanote Line, Chūō Main Line, Sōbu Main Line, Keihin-Tōhoku Line, Tōkaidō Main Line, Tōhoku Main Line, Takasaki Line, Jōban Line, Keiyō Line, Yokosuka Line Tokyo Metro: ○Marunouchi Line (M-17) Shinagawa 品川 Minato, Tokyo 6.8 JR East: Yamanote Line, Keihin-Tōhoku Line, Tōkaidō Main Line, Yokosuka Line Keihin Electric Express Railway: Main Line Shin-Yokohama 新横浜 Kōhoku-ku, Yokohama 25.5 JR East: Yokohama Line Yokohama Municipal Subway ■Blue Line (No. 3 Line) Odawara 小田原 Odawara, Kanagawa 76.7 JR East: Tōkaidō Main Line Odakyū Electric Railway: Odawara Line, Izu-Hakone Railway: Daiyuzan Line, Hakone Tozan Railway: Hakone Tozan Line Atami 熱海 Atami, Shizuoka 95.4 JR East: Tōkaidō Main Line (for Tokyo), Ito Line, JR Central: Tōkaidō Main Line (for Maibara) Mishima 三島 Mishima, Shizuoka 111.3 JR Central: Tōkaidō Main Line Izu-Hakone Railway: Sunzu Line Shin-Fuji 新富士 Fuji, Shizuoka 135.0 (no railway) Shizuoka 静岡 Aoi-ku, Shizuoka 167.4 JR Central: Tōkaidō Main Line Shizuoka Railway: Shizuoka-Shimizu Line (Shin-Shizuoka Station) Kakegawa 掛川 Kakegawa, Shizuoka 211.3 Central JR: Tōkaidō Main Line Tenryū-Hamanako Railway: Tenryū Hamanako Line Hamamatsu 浜松 Hamamatsu, Shizuoka 238.9 JR Central: Tōkaidō Main Line Enshu Railway: Enshu Railway Line (Shin-Hamamatsu Station) Toyohashi 豊橋 Toyohashi, Aichi 274.2 JR Central: Tōkaidō Main Line, Iida Line Nagoya Railroad (Meitetsu): Nagoya Main Line, Toyohashi Railroad: Atsumi Line (Shin-Toyohashi Station), Azumada Main Line (tramway, Ekimae Station) Mikawa- Anjō 三河安城 Anjō, Aichi 312.8 JR Central: Tōkaidō Main Line Nagoya 名古屋 Nakamura- ku, Nagoya 342.0 JR Central: Tōkaidō Main Line, Chūō Main Line, Kansai Main Line, Takayama Main Line Nagoya Subway: ■Higashiyama Line (H08), ■Sakura-dori Line (S02), Nagoya Railroad (Meitetsu): Nagoya Main Line (Meitetsu Nagoya Station), Kintetsu: Nagoya Line (Kintetsu Nagoya Station), ■Nagoya Seaside Rapid Railway: Aonami Line (AN01) Gifu-Hashima 岐阜羽島 Hashima, Gifu 367.1 Nagoya Railroad (Meitetsu): Meitetsu Hashima Line (Shin-Hashima Station) Maibara 米原 Maibara, Shiga 408.2 JR Central: Tōkaidō Main Line (for Atami), JR West: Tōkaidō Main Line (for Kyoto), Hokuriku Main Line Ohmi Railway: Main Line Kyoto 京都 Shimogyo-ku, Kyoto 476.3 JR West: Tōkaidō Main Line, Kosei Line, San'in Main Line, Nara Line Kintetsu: Kyoto Line, Kyoto Municipal Subway: ■Karasuma Line (K11) Shin-Ōsaka 新大阪 Yodogawa-ku, Osaka 515.4 JR West: Sanyō Shinkansen (runs through to Hakata Station), Tōkaidō Main Line Osaka Municipal Subway: ■Midōsuji Line (M13) ==Other websites== Category:Shinkansen Category:1972 establishments in Japan",
 "title": "Tōkaidō Shinkansen"
}