{
 "id": "213199",
 "text": "Manuel Peter Neuer (German pronunciation: [ˈmaːnu̯eːl ˈnɔʏ.ɐ, -ɛl -]; born 27 March 1986) is a German footballer. He is the goalkeeper for FC Bayern Munich and Germany national team. == Career == Neuer started playing for the youth teams of Schalke 04 when he was five years old. On 19 August 2006 he played his first match in the Bundesliga. Because he was very good, he replaced Frank Rost as Schalke's number one. Rost left Schalke in 2007 and plays now for the New York Red Bulls. On 1 June 2011 Schalke and Bayern Munich announced that Neuer would move to Bayern Munich in July 2011. There he signed a five-year contract that will last until June 2016. The transfer was worth €18 million, therefore making him the third most expensive goalkeeper of all time. During the 2014 FIFA World Cup Neuer made some world class saves and only conceded a few goals during the tournament, but in the European qualifiers he conceded 2 major goals in a 2-0 loss to Poland. Despite injuries in the 2017 - 2018 season, he was picked to be Germany's number one goalkeeper at the 2018 World Cup until their early exit following a 2-0 loss to South Korea. The result led to Germany’s earliest World Cup exit since the 1930s loss to Switzerland. Neuer has also played for all of the youth teams of the Germany national football team from the Under-18 team and on. On 2 June 2009, he played for the first time in the senior team against the United Arab Emirates. Neuer was selected as Germany's number one for the 2010 FIFA World Cup. The star goalkeeper is considered one of the world’s best goalkeepers as he won the IFFHS World’s Best Goalkeeper from 2013 to 2016. He also won the FIFA best goalkeeper award following Germany’s victory at the 2014 FIFA World Cup. In addition, he also finished third behind Cristiano Ronaldo and Lionel Messi at the 2014 FIFA Ballon d’Or Award. The following season, his power saving skills helped Schalke to advance to the quarter-finals of the UEFA Champions League; thus emerging UEFA Club Goalkeeper of the Year. Given the captain band of the Schalke team in 2010, Manuel led the team to the Champions League semi-final that year and after the 2011/12 season, he ended his career with Schalke. Joining Bayern Munich in June 2011, Manuel Neuer has been the first choice goalkeeper for the club and has led the team to win several championships. == Career statistics == === Club === Club Season League Cup Continental Other Total Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Schalke 04 II 2003–04 1 0 — — — 1 0 2004–05 24 0 — — — 24 0 2006–07 3 0 — — — 3 0 2008–09 1 0 — — — 1 0 Totals 29 0 — — — 29 0 — Schalke 04 2005–06 0 0 0 0 0 0 0 0 0 0 2006–07 27 0 0 0 0 0 0 0 27 0 2007–08 34 0 3 0 10Appearances in the UEFA Champions League. 0 3Appearances in the DFL-Ligapokal. 0 50 0 2008–09 27 0 2 0 5Appearances in the UEFA Europa League. 0 — 34 0 2009–10 34 0 5 0 — — 39 0 2010–11 34 0 6 0 12 0 1Appearances in the DFL-Supercup. 0 53 0 Totals 156 0 16 0 27 0 4 0 203 0 — Bayern Munich 2011–12 33 0 5 0 14 0 — 52 0 2012–13 31 0 5 0 13 0 1 0 50 0 2013–14 31 0 5 0 12 0 4Appearances in the DFL-Supercup, UEFA Super Cup, and FIFA Club World Cup. 0 52 0 2014–15 32 0 5 0 12 0 1 0 50 0 2015–16 34 0 5 0 11 0 1 0 51 0 2016–17 26 0 4 0 9 0 1 0 40 0 2017–18 3 0 0 0 1 0 0 0 4 0 2018–19 26 0 3 0 8 0 1 0 38 0 2019–20 27 0 4 0 7 0 1 0 39 0 Totals 243 0 36 0 87 0 10 0 376 0 — Career totals 428 0 52 0 114 0 14 0 608 0 — === International === Germany Germany Germany Year Apps Goals 2009 2 0 2010 13 0 2011 10 0 2012 11 0 2013 8 0 2014 13 0 2015 6 0 2016 11 0 2017 0 0 2018 10 0 2019 8 0 Total 92 0 == References == == Other websites == * Manuel Neuer's website (in German) * Manuel Neuer on fussballdaten.de (in German) Category:1986 births Category:Living people Category:2010 FIFA World Cup players Category:2014 FIFA World Cup players Category:German association football goalkeepers Category:Sportspeople from Gelsenkirchen Category:FC Bayern München players Category:2022 FIFA World Cup players Category:Association football goalkeepers",
 "title": "Manuel Neuer"
}