{
 "id": "2132",
 "text": "The European Union (abbreviation: EU) is a union of 27 member countries in Europe. It was created by the Maastricht Treaty in 1993. It is a unique political organisation; in some ways, it acts like a federation, and in other ways, it acts like a confederation. (Political scientists call the EU a \"sui generis\" organisation, which means the EU is so unique that it is hard to compare it to anything else.) The EU grew out of the European Economic Community (EEC), which was formed by the Treaty of Rome in 1957. It has created a common economic area with Europe-wide laws, allowing the citizens of EU countries to move and trade in other EU countries almost the same as they do in their own. Nineteen of these countries also share the same type of money: the euro. The Treaty of Lisbon is the most recent treaty that explains how the Union is run. Every member state signed it, to show that they each agreed with what it says. Most importantly, it says which jobs (’powers’) the Union should do for the members and which jobs they should do themselves. The members decide how the Union should act by voting for or against proposals. The objective of the EU is to bring its member states closer together, while also respecting human rights and democracy. It does this by helping its members to decide on common rules for many things, like law enforcement, passports, and how to trade fairly with each other. Most members share a common currency (the euro) and most allow people to travel from one country to another without having to show a passport. == History == After World War II, most countries in Europe wanted to live peacefully together and help one another's economies. Instead of fighting each other for coal and steel, the first member countries-- (West) Germany, France, Italy, Belgium, Netherlands, and Luxembourg-- created the European Coal and Steel Community in 1952. Its job was to make rules for how to trade coal and steel in a fair way, and to make sure its members were following the rules. In 1957, in the Italian city of Rome, the member countries signed another treaty that made the European Economic Community (ECC). Now it was a community for trading all sorts of things, not just coal and steel. In 1993, with the Treaty of Maastricht, the ECC joined together with a few other international organizations in Europe to form the European Union. Now it would help its member countries work together in many different ways; not only with trade, but also with money, justice (laws), and foreign affairs. In 1995, the EU created the Schengen Area, and 22 member countries of the EU opened their borders to each other. This means that people can now travel from one country to the other without a passport or identity card. In 1999, the EU created its own currency, which is called the euro. Many of its member states got rid of their old currencies, and now use the euro. However, a few countries, like Denmark and Poland, chose to keep their own currency. Over time, more countries have joined the EU. In 2004, ten new countries became part of the EU: Cyprus, Czechia, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia. In 2007, two more countries, Bulgaria and Romania, joined the EU. Most recently, Croatia joined the EU in 2013. Then, in 2020, the United Kingdom left the EU. As of 2025, there are 27 member countries. The EU is now the world's largest single market, with a population of about 450 million people. If the EU were a single country, it would be the world's third largest country. In 2025 there were United States tariffs against the European Union. In April, the EU informed that from April 15, there would be 25% tariffs on some U.S. goods.https://e24.no/boers-og-finans/i/PpAaOX/eu-banker-gjennom-tollsvar-mot- usa?referer=https%3A%2F%2Fwww.vg.no. Retrieved 2025-04-09 The situation is sometimes called a trade war. == Free movement == A person who is a citizen of the European Union can live and work in any of the 27 member states without needing a work permit or visa. For example, a French person can move to Greece to work there, or just to live there, and he or she does not need permission from an authority in Greece. Products made in one member country can be sold in any other member country without any special permissions or extra taxes. For this reason, the members agree to rules about product safety - they want to know that a product made in another country will be as safe as it would be if it had been made in their own. == Main institutions == Institutions of the European UnionConsolidated version of the Treaty on European Union/Title III: Provisions on the Institutions European Parliament \\- Legislative (lower house) - European Council \\- Sets impetus and direction - Council of the European Union \\- Legislative (upper house) - European Commission \\- Executive - * Acts together with the council as a legislator * Elected by the people every five years * Works with the Council to decide what the general budget of the EU should be; the Parliament gets the final say * Exerts the democratic control over EU institutions including the European Commission and appoints the Commission members * based and plenary sessions in Strasbourg, General Secretariat in Luxembourg, primarily meets in Brussels * summit of the Heads of Government, chaired by the President of the European Council) * gives the necessary impetus for the development and sets out general objectives and priorities * will not legislate * based in Brussels, Belgium * Consists of government ministers from member states * Acts together with the Parliament as a legislator * Exerts together with the Parliament the budgetary power * Ensures coordination of the broad economic and social policy and sets out guidelines for the Common Foreign and Security Policy (CFSP) * Conclude international agreements * Based in Brussels, Belgium * Is the \"government\" * Has one member from each member state * Submits proposals for new legislation to the Parliament and to the Council * Implements EU policy and administers the budget * Ensures compliance with EU law * Negotiates international treaties * Based in Brussels, Belgium Court of Justice of the European Union \\- Judiciary - European Court of Auditors \\- Financial auditor - European Central Bank \\- Monetary executive (central bank) - * Ensure uniformity of interpretation of European law * Has the power to decide legal disputes between EU member states, EU institutions, businesses and individuals * Based in Luxembourg * Shall examine the proper use of revenue and expenditure of the EU institutions * Based in Luxembourg * Forms together with the national central banks the European System of Central Banks and thereby determining the monetary policy of the EU * Ensures price stability of the Euro by controlling the money supply of participating countries * Based in Frankfurt am Main, Germany === Council of the European Union === The Council of the European Union is the main decision-making group. The cabinet ministers of the member countries meet (Ministers for Foreign affairs, for Agriculture, for Justice, etc...) and discuss issues that are important to them. Before the Treaty of Lisbon (written in 2007, implemented in 2008) each member state took a turn at being President of the council for six months. For example, from January 2007 until July 2007, Germany held the presidency. The six months before that, Finland held the presidency. Now the President of the European Union chairs the council summits. The President of the council is the organiser and manager and is voted into office for a duration of two and a half years. He or she does not have the power to make decisions about the European Union like the President of the United States does for that country. Member countries with a large population (Germany, France, United Kingdom, etc.) have more votes than countries with small populations (Luxembourg, Malta, etc.) but a decision cannot be made if enough countries vote against the decision. Twice a year, the heads of government (Prime Ministers) and/or the heads of state (Presidents) meet to talk about the main issues and make decisions on different issues. This meeting is different and not as formal. It is known as a European Council. :Note: This is not the same thing as the Council of Europe, which is not part of the European Union. === European Commission === The European Commission runs the day-to-day running of the EU and writes laws, like a government. Laws written by the commission are discussed and changed by the European Parliament and the Council of the European Union. The commission has one President and 27 Commissioners, selected by the European Council. The Commission President is appointed by the European Council with the approval of the European Parliament. The commission operates like a cabinet government. There is one Commissioner per member state, though Commissioners are bound to represent the interests of the EU as a whole rather than their home state. === European Parliament === The Parliament has a total of 720 members (called Members of the European Parliament, or MEP). They are elected in their countries every five years by the citizens of the European Union member countries. The Parliament can approve, reject or change proposed laws. It can also sack the European Commission. In that case, the entire commission would have to give up their jobs. == Politics == There are many discussions in the EU about how it should develop and change in the future. The main reasons why European countries came together are political and economic: * The need to prevent another European war after World War I and World War II. * The need to respect human rights, rule of law and democracy more affirmed by Council of Europe. * The need to have a common economic area. == Member states == In 1951, six countries made the European Coal and Steel Community, a basic version of what the EU is now. These six then went further and in 1957 they made the European Economic Community and the European Coal and Steel Community. The UK and others decided not to join, and then when the UK changed its mind it was stopped from joining by French President Charles de Gaulle. When he was no longer President, the UK and others started to join. Today there are 27 members but the idea that more should join is not seen as a good one by everyone. ;Founders in 1957 * * * (later just Germany)East Germany and West Germany became one country in 1990. Since then the whole of Germany is an EU member country. * * * ;Joined in 1973 * * * ;Joined in 1981 * ;Left in 1985 * Greenland joined as part of Denmark, but was given some power to rule itself afterwards. With this power, it decided to leave the EEC. ;Joined in 1986 * * ;Joined in 1995 * * * ;Joined in 2004 * Although Northern Cyprus is officially part of Cyprus (and the EU), it is not actually controlled by the Government of Cyprus and its passports are not accepted by EU members. * * * * * * * * * ;Joined in 2007 * * ;Joined in 2013 * Left in 2020 * Serbia, Montenegro, North Macedonia, Turkey and Iceland are \"candidate countries\"; they are being considered for membership. Albania, Bosnia and Herzegovina and Kosovo are expected to follow. However, since there have been many political problems happening in Turkey recently, especially with President Edrogan's arresting of tens of thousands of political rivals since the failed coup attempt on July 15, 2016, it is unlikely that it would be allowed to part of the EU anytime soon because EU members believe that the current Turkish government is not respecting human rights, rule of law, or democracy. ==Motto== United in diversity (or together with many types of people in Simple English), is the motto of the European Union. The motto in other languages: * * * * * * * * * * * * * * * * * * * * * * * == Brexit == On June 23, 2016, the UK held a referendum on whether it should stay in the EU or leave it. The majority [52% to 48%] favored leaving. Britain leaving the EU is commonly known as Brexit. The government of the UK invoked \"Article 50\" of the Treaty of European Union (the Treaty of Lisbon) on 29 March 2017. This began negotiations with fellow members of the EU on the terms of exit. The timetable for these negotiations was two years, which meant that the UK would remain a member of the EU until at least March 2019. This deadline was later extended to October 31st 2019 at the request of the British Government. The United Kingdom left the European Union on the 31 of January 2020 at 23:00 (Greenwich Mean Time). Following that, the transition period expired on December 31, 2020 and ended on January 1, 2021. ==Related pages== * Citizenship of the European Union * European Union law * Multilingualism * Brexit * Robert Schuman ==References== == References == == Other websites == * European Union online portal * Lithuania's EU Council Presidency * 'Your Europe' information website * Europe of cultures 50 years of artistic creation and cultural life from the 27 countries of the European Union Category:1952 establishments in Europe Category:G7 nations Category:G8 nations",
 "title": "European Union"
}