{
 "id": "213373",
 "text": "Mi Fu (1051–1107)Barnhart: 373. Mi Fu's style name was Yuanzhang (元章) with several sobriquets: Nangong (南宫), Lumen Jushi (鹿门居士), Xiangyang Manshi (襄阳漫士), and Haiyue Waishi (海岳外史) (also known as Mi Fei) was a Chinese painter, poet, and calligrapher. He was born in Taiyuan, Shanxi, during the Song Dynasty in 1051, and died 1107. ==Life== Mi Fu was born in 1051, in Taiyuan, during the Song Dynasty. His mother was employed as a midwife, and in 1048 delivered the future Emperor Shenzong and served as his wet nurse. Emperor Shenzong ruled from 1067 to 1085. Mi Fu was especially familiar with the imperial family and lived in a privileged place near the royal palaces. He disregarded proper art lessons but appeared to have natural skill in writing, painting, and drawing. He eventually became one of the four best calligraphers in the Song Dynasty,Mi Fu's calligraphy at ChinaPage.com, accessed November 2009 and was regarded for his exceptional technique involving the creation of landscapes. Despite the lack of formal training, his style was quite sophisticated and incorporated large dots of ink applied with a flat edge brush. Some major influences on his work include Li Bai and Wang Xizhi. Mi Fu was known for his eccentricity, sometimes referred to as \"Madman Mi\" due to his affinity for stone collecting, once having said a particular stone was his brother.Mi Fu and his Calligraphy Gallery at China Online Museum He was a heavy drinker. == Career == Mi Fu became a civil servant with mixed success. He was initially a book editor in the Emperor's library, then worked in several posts in Henan province. At the Emperor's palace in 1103, he was given the position of Professor\"Professor\" in ancient China is not a doctorate; it is a government official post. of Painting and Calligraphy, which allowed him to select which paintings and works of calligraphy were good enough to belong to the Emperor. He later became secretary to the Board of Rites, then was appointed governor of Huaiyang in Jiangsu province. == Style == He specialized in painting misty landscapes. The \"Mi Fu\" style uses large wet dots of ink applied with a flat brush. Mi Fu's poetry followed the style of Li Bai and his calligraphy that of Wang Xizhi. == Legacy == Mi Fu died in 1107. He had five sons and eight daughters. Mi Fu is widely considered the best of all the calligraphers of the Song dynasty. One of his works was sold for nearly $4-million (U.S.).art virtue, accessed November 2009 ==Related pages== *List of Chinese painters ==References== Category:Chinese poets Category:Chinese painters Category:1051 births Category:1107 deaths Category:People from Shanxi Category:11th-century Chinese artists Category:12th-century Chinese artists Category:11th-century Chinese writers",
 "title": "Mi Fei"
}