{
 "id": "213370",
 "text": "Shanxi (山西) is a province of the People's Republic China. It is in northern China. The Yellow River flows through it.An Introduction to Chinese Provinces, china.org.cn, accessed November 2009 The name Shanxi means \"mountain's west\" or \"west of the mountains\", as it is west of the Taihang Mountains. Origin of the Names of China's Provinces , People's Daily Online. Its major cities are its capital Taiyuan, Datong, Changzhi, and Yangquan. The abbreviation of Shanxi is Jin (晋), since there is another province, Shandong (山东), that has the word \"Shan\" (山) in it, meaning \"mountain\" in Chinese, exactly, it's Tai Mountain. During the Zhou Dynasty, there was a Jin (晋) state located in present-day Shanxi, later, many states and dynasties with similar positions also adopted this name. This is the origin of its abbreviation. Although in pinyin, the name of the neighboring province to the west, \"Shaanxi\", is spelled exactly the same as \"Shanxi\", the only difference in how the two words are pronounced is that the first syllable in \"Shanxi\" is said using the first tone in Mandarin, while the first syllable in \"Shaanxi\" is said with the third tone. Since tone markers are not usually used to show how to pronounce the two different names, the first word in \"Shaanxi\" is spelled using the Gwoyeu Romatzyh method instead, which indicates tones by adding extra letters to a syllable. == Notable residents == Note: Not only people borned here, but also include people lived here or its ancestors lived here. === Ancient === ==== Myth or very ancient history ==== Pu Yi, Yao's teacher Yao, Shun, and Yu, three emperors of ancient times in Chinese mythology and legend ==== Before Qin Dynasty ==== Jizi, the founder of Jizi Joseon (Korea) Ji Chonger, Prince Wen of Jin Jie Zitui, follower of Prince Wen of Jin during his wandering Zhao Dun, minister of Jin Lin Xiangru, a minister of Zhao and a diplomat Xunzi (Xuncius), thinker, philosopher, educator, representative of Confucian school Li Bing, he and his son presided over the construction of the Dujiangyan water conservancy project is the most famous ==== Dynasty Han and Three Kingdoms ==== Wei Qing and Huo Qubing, two great generals of Han, successfully resisted the attack of the Xiongnu Huo Guang, Huo Qubing's brother Ban Jieyu, Chinese female writer of Western Han Dynasty, Ban Gu's grandaunt, but she said that women should abide by etiquette and comply with female virtues Guan Yu, great general of the late Eastern Han Dynasty, borned in Xie Zhou Town, Yanhu District, Yuncheng City Zhang Liao, great general, too Pei Xiu, famous minister and cartographer Diaochan, One of the four beauties of ancient China. It is said that Diaochan was born Ren Hongchang, a village girl in Shanxi Province ==== Dynasty Jin (晋) ==== Wei Shuo (Mrs. Wei), famous artist Shi Le, statesman, military strategist, the founding emperor of Later Zhao Shi Hu, Shi Le's nephew. Wei Jie, metaphysician, official, one of the four beautiful men in ancient China ==== The Northern and Southern Dynasties ==== Tuoba Gui (the founder), Tuoba Tao, and Tuoba Hong, three emperors of Northern Wei Gao Huan, minister of Eastern Wei, created a foundation of Northern Qi Gao Yang, founder of Nothern Qi Dugu Xin, a great general ==== Sui and Tang dynasties ==== Pei Shiqing, official, Sui sent him to Japan Wu Shiyue, Wu Zetian's father, founding heroes of the Tang Dynasty Wang Ji, poet Weichi Gong (Weichi Jingde), late Sui and early Tang general Wang Fangyi, general of Tang Wang Bo, famous poet Kuiji, famous monk in the Tang and the founder of the Only Knowledge School, the common family name is Weichi, and known as the \"Benevolent Master\" Pei Xingjian, famous minister of Tang Xue Rengui, great general of early Tang, attacked Goguryeo Pei Yan, prime minister of Tang Wu Chengsi, Wu Zetian's nephew Di Renjie, Tang Dynasty statesman and prime minister of Wuzhou Wu Zetian (real Wu Zhao or original Wu Mei), Tang to Wuzhou stateswoman, the founder of Zhou (or Wuzhou, r. 690-705, often included in Dynasty Tang), the only female emperor in Chinese history Wu Sansi, Wu Zetian's nephew Song Zhiwen, poet and official Xue Ji, artist and poet Xue Yao, minister of Tang Xue Ne, Xue Rengui's son, famous general Zhang Shougui, An Lushan's adoptive father, famous general of Tang Wang Zhihuan, famous poet Pei Yaoqing, prime minister of Tang Wang Han, famous poet Wang Hong, Wang Fangyi's grandson Wang Wei, famous poet Wang Changling, famous poet Lu Lun, famous poet Liu Zongyuan, famous poet Bai Juyi, famous poet Pei du, politician and literary figure Zhang Yanyuan, minister of Tang and painter Lü Dongbin, one of the Eight Immortals of Taoism Liu Mian, a relative of Liu Zongyuan, author of the old and new Tang Books Wen Tingyun, a famous poet and lyricist of late Tang Zhang Guolao, one of the Eight Immortals of Taoism Yang Yuhuan, palace dancer and musician, the favored concubine of Emperor Xuanzong of Tang, Li Longji, one of the four great beauties of ancient China ==== Five Dynasties ==== Li Keyong, warlords from the late Tang Dynasty to the Five Dynasties and Ten Kingdoms Li Cunxu, the founder of Later Tang, Li Keyong's son Li Siyuan, emperor of Later Tang, Li Keyong's adopted son Shi Jingtang, founding emperor of Later Jin, Li Siyuan's son-in-law Liu Chong (or Liu Min), founding emperor of the Northern Han Liu Chengjun, the second emperor of Northern Han Li Jun, famous general ==== Dynasty Song ==== Sima Guang, during the Northern Song Dynasty, famous politician, historian, and writer Mi Fu, artist and poet ==== Dynasty Jin (金) and Dynasty Yuan ==== Yang Yunyi, literati and official of Jin Yuan Haowen, literati and historian Guan Hanqing, one of the Four Great Masters of Yuan Opera Bai Pu, one of the Four Great Masters of Yuan Opera Sa Dula, famous poet and painter in Yuan ==== Dynasty Ming ==== Luo Guanzhong, famous writer, author of Three Kingdoms. ==== Dynasty Qing ==== Yu Chenglong, famous minister in early Qing Chen Tingjing, poet and minister, Emperor Kangxi's teacher === Modern and Contemporary Times === ==== Revolutionaries ==== Gao Junyu, Xu Fanting, He Chang, Bo Yibo, Peng Zhen, Fu Zuoyi, Hua Guofeng, Li Xuefeng, Ji Chaozhu, Ji Dengkui, Ji Pengfei, Cheng Zihua, Chai Zemin, Chang Zhiqing ==== Founding generals of PRC ==== Marshal: Xu Xiangqian; Generals: Zhao Erlu, Dong Qiwu; Major General: Chang Qiankun; Major Generals: Wang Xiao, Wang Zhan, Wang Lanlin, Wang Qingsheng, Che Minjian, Niu Mingzhi, Shi Jinqian, Shi Jingban, Baiyun, Lv Yishan, Liu Su, Liu Ren, Liu Jinghai, Xu Zhifen, Li Wenyi, Li Maozhi, Yang Wen'an, Wu Xiaomin, Gu Jingsheng, Zhang Zheng, Zhang Zizhen, Zhang Ziming, Zhang Zhongru, Zhang Wenzhou, Zhang Shizhen, Zhang Tingzhen, Zhang Yingming, Zhang Zhuguo, Zhang Zizhen, Zhang Xiankui, Fan Fushan, Hu Shangli, Hu Ronggui, Ru Fuyi, Duan Shikai, Chai Qikun, Gao Dexi, Yan Jiesan, Liang Zhongyu, Zhishengyuan, Xue Kezhong, He Ming, Feng Zi ==== Generals ==== Fu Quanyou, Xu Xiaoyan, Zhang Gong, Zhang Zhijian, Pei Huailiang, Xing Yongning, Xu Chunyang, Wang Zuoyi, Zhang Qinsheng, Wang Jitang, Li Maifu, Wang Wei, Liu Yahong, Wang Jilian, Huo Ling, Zhang Xueyi, Bai Lv ==== Political circle ==== Ren Jianxin, Liu Yunshan, Wang Qishan, Li Yizhong, Hu Fuguo, Li Ligong, Ling Hu'an, Wang Jun, Liu Jing, Wang Yunlong, Zhao Qinping, Gao Hucheng, Jiao Huancheng, Huo Shilian, Zhi Shuping, Wang Wanbin, Zheng Weiping, Wang Xinxian, Shi Taifeng [14], Yin Hejun, Wang Weizhong, Ma Xiaowei [35], Hu Yuting [38] [39] ==== Social science ==== Fan Shoushan, Niu Hanben, Ren Zhigong, Li Jinghai, Ma Hong, Hu Naiwu, Li Fanggui, Zhang Gaoli, Zhang Cuiping ==== Model workers ==== Li Shunda, Guo Fenglian, Chen Yonggui, Shen Jilan, Chen Buliang, Li Shuangliang, Song Liying, Che Ankui ==== Painting and Calligraphy ==== Ma Wenwei, Dong Shouping, Ma Quan, Li Qi, Li Qun, Wang Chaorui, Yao Tianmu, Cheng Zhaoxing, Ren Lisheng ==== Writers ==== Zhao Shuli, Chai Yong, Shi Pingmei, Ma Feng, Xirong, Li Jianwu, Hu Zheng, Zhao Yu, Zhang Ping, Zhao Bingyu, Zheng Yuanjie, Zhang Xingjian, Han Shishan, Tang Dynasty, Li Rui, Zhong Zhongyang, Cao Naiqian, Gong Liu, Di An, Wang Hanxing, Chen Peng, Jiang Yun, Liang Heng, Liu Cixin ==== Directors ==== Jia Zhangke, Zhang Jigang, Niu Chaoyang, Ning Hao, Zhang Yongshou, Pi San, Wang Yi, Yu Shui, Hao Yun, Wang Weinian ==== Performers ==== Zhao Ziyue, Zhang Yongshou, Xing Jiadong, Cheng Taishen, Zhang Aijia, Cui Yan, Nie Xin, Zhang Yan, Shi Yao, He Gang, Jia Yumeng, Zhou Qiqi, Bian Xiaoxiao, Zhao Tao, Gao Ziqi, Wang Luyun, Qi Fang, Yuan Jun, Zhao Wenhao, Meng Yao, Han Xiao, Gao Ren, Wang Heming ==== Music ==== Zhang Yadong, Guo Feng, Wang Huiqiang ==== Singers ==== Guo Lanying, Ma Yutao, Guan Guimin, Nie Jianhua, Yu Shuqin, Shan Xiurong, Yan Weiwen, Tan Jing, Lu Xiumei, Niu Baolin, Shaanxi Army, Cheng Fangyuan, Abao, Xin Lisheng, Gao Baoli, Shi Zhanming, Wang Rong, Zhao Yan, Zhang Lin, Du Zhiwen, Wang Xinping, Tao Yanqing, Cui Tan, Wang Yunyi ==== Traditional opera ==== Ding Guoxian, Niu Guiying, Guo Lanying, Wang Aiai, Tian Guilan, Guo Fengying, Cheng Yuying, Hua Yanjun, Ma Yulou, Zhang Mingqin, Song Zhuanzhuan, Guo Caiping, Zhang Aizhen, Wu Guohua, Zhang Baoping, Guo Ming'e, Fu Yongliang, Chen Suqin, Zhang Zhiming, Guo Xiaoming, Du Yumei, Li Aimei ==== Sports World ==== Zhou Xiaolan, Jiang Zhujiu, Song Ligang, Zhang Jinsong, Wang Tao, Xi Enting, Yuan Xiaochao, Zhao Yan ==== IT ==== Robin Lee, Zhang Yaqin, Jia Yueting, Chen Nian, Shi Lirong, Huang Zhihua, Liu Wenbin, Li Yuebin, Feng Xin, Liu Xingliang ==== Media ==== Xing Zhibin, Chai Jing, Ren Zhihong, Li Wenjing, Moon Sister, Wei Chenxia, Zhang Lei, Zhang Tengyue, Qiang Qiang, Yu Fei, Shi Qiang, Guo Tao, Ren Yuxiang, Liu Xingyu, Miao Kai, Zhang Shixuan ==== Business community ==== Sun Hongbin, Chen Feng, Qin Xiao, Sun Yulin, Hao Hongfeng ==== Scientific community ==== Yin Hejun, Zhang Jie, Xie Kechang, Zhao Qinping, Guan Qiao, Guo Chengji, Peng Kunchi, Miao Jianming, Yang Jinlong, Li Xiaoying, Jing Haipeng, Liu Wang ==== Other ==== Kong Xiangxi, Yan Xishan, Cheng Zhiqiang, Jing Haipeng, Liu Wang, Chen Baoguo, Wang Fu == References ==",
 "title": "Shanxi"
}