{
 "id": "213304",
 "text": "The Mandelbrot set is a famous example of a fractal in mathematics. It is named after Benoît Mandelbrot, a Polish-French-American mathematician. The Mandelbrot set is important for chaos theory, as points in its equation can be very chaotic. The boundary of the set shows a self-similarity, which is perfect, but because of the minute detail, it looks like it evens out. The Mandelbrot set can be made with the equation z_{n} = z^{\\ \\ \\ \\ \\ \\, 2}_{n-1} + c . In that equation, c and z are complex numbers and n is zero or a positive integer (natural number). Starting with z_0 = 0, c is in the Mandelbrot set if the absolute value (distance from zero) of z_n never becomes larger than 2, no matter how large n gets. The two is because any point whose absolute value is bigger will go to infinity. Mandelbrot was one of the first to use computer graphics to create and display fractal geometric images, leading to his discovering the Mandelbrot set in 1979. That was because he had access to IBM's powerful (for their time) computers. He was able to show how visual complexity can be created from very simple rules. He said that things typically considered to be \"rough\", a \"mess\", or \"chaotic\", like clouds or shorelines, actually had a calculable \"degree of order\". The equation z = z^{\\ \\ \\ \\ \\ \\, 2}_{n-1} + c, though, was known long before Benoit Mandelbrot used a computer to visualize it. Images are created by applying the equation to each pixel in an iterative process (repeated process), using the pixel's position in the image for the number 'c'. 'c' is obtained by mapping the position of each pixel in the image as a point in the complex plane. The shape of the Mandelbrot Set is represented in black in the image on this page. For example, if c = 1 then the sequence is 0,1,2,5,26,\\ldots which goes to infinity. Therefore, 1 is not in the Mandelbrot set, and thus is not coloured black. On the other hand, if c is equal to the square root of -1, also known as i, then the sequence is 0,i,(-1+i),-i,(-1+i),-i,\\ldots which does not go to infinity and so it belongs to the Mandelbrot set. When graphed to show the entire Set, the resulting image is striking, pretty, and quite iconic and recognizable. A lot of this detail is determined by the colors about the boundary of the set. These are obtained by determining how many iterations it takes for the Z value go out of a radius-2 circle on the complex plane, from which it is known that the point escapes. The colors account for much of the set's detail, and the color scheme can be changed to any colors. There are many variations of the Mandelbrot set, such as the Multibrot sets, The Buddhabrot, and The Nebulabrot. The Multibrot is a generalization that allows any exponent: z_{n} = z^{\\ \\ \\ \\ \\ \\, {d}}_{n-1} + c . These sets are called Multibrot sets. The Multibrot set for d = 2 is the Mandelbrot set, though it is usually not referred to as a Multibrot. The Buddhabrot is a variant of the Mandelbrot set where each value of the sequence is colored, whether escaping or not. It looks a bit like a ghost. A Nebulabrot is a combination of multiple Buddhabrots imposed on top of each other, but each Buddhabrot has a different color, and the sequence lengths are different. == References == Category:Fractals",
 "title": "Mandelbrot set"
}