{
 "id": "213349",
 "text": "Euphoria (from Ancient Greek , from εὖ (eu), \"well\", and φέρω (pherō), \"to bear\") is a mental and emotional condition which makes a person feel extremely happy, excited, and carefree.Euphoria - RightDiagnosis.com These feelings are much stronger and more intense than what a human would normally feel. However, some natural human behaviors can cause brief states of euphoria. For example, people may feel euphoric for a short time after orgasm, when in love, or after a very important athletic achievement. Sometimes, people can also feel euphoria during certain religious or spiritual rituals, or while meditating.\"Psychophysical Correlates of the Practice of Tantric Yoga Meditation\". Corby, Roth, Zarcone, & Kopell. Archives of General Hackett, 1978. More often, euphoria is caused by certain psychoactive drugs, mental illnesses, or medical problems. Euphoria is the opposite of dysphoria. ==Causes== ===Drugs=== Euphoria can be caused by psychoactive drugs like cocaine and alcohol methamphetamines. Some of the drugs that can cause euphoria are: *Alcohol: People may feel euphoria soon after they begin drinking alcohol (especially in the first 10–15 minutes after they begin to drink).Christopher J. Morgan and Abdulla A.-B. Badawy. \"Alcohol-induced euphoria: exclusion of serotonin.\" Alcohol and Alcoholism (2001) 36 (1): 22-25. *Passion Flower (Passiflora incarnata): A sedative that calms the nervous system and acts as a sleep aid. One compound in this herb, called harmine, may cause euphoria. *Cannabis: Cannabis contains tetrahydrocannabinol (THC), which can cause euphoria as well as relaxation and sedation. Marijuana and hashish are both made from cannabis plants. *Stimulants: Stimulant drugs can cause euphoria as well as high energy, hyperactivity, and lack of appetite. There are different types of stimulants. Amphetamines (including methamphetamine) are the best known drugs in this category.Alan W. Cuthbert \"stimulants\" The Oxford Companion to the Body. Ed. Colin Blakemore and Sheila Jennett. Oxford University Press, 2001. Oxford Reference Online. Oxford University Press. 28 July 2011 *MDMA: Commonly called Ecstasy, MDMA causes strong feelings of euphoria as well as rushes of energy. MDMA and MDEA (\"Eve\") are popular drugs among young adults.\"ecstasy\" World Encyclopedia. Philip's, 2008. Oxford Reference Online. Oxford University Press. 28 July 2011 *Opium: A drug made from the unripe seed-pods of the opium poppy. It can cause euphoria and drowsiness, and can decrease pain. Heroin, morphine, and codeine are made from opium. \"opium\" World Encyclopedia. Philip's, 2008. Oxford Reference Online. Oxford University Press. 28 July 2011 ===Mental Illness=== Euphoria can be a symptom of some mental illnesses. For example, euphoria is a common symptom of mania, an extreme, high-energy mood state which can happen with bipolar disorder and other mental health conditions. ===Medical Illness=== Euphoria can also be a symptom of some medical problems. It is a common symptom of hypoxia. It is a dangerous symptom, because it can make a hypoxic person feel so good and carefree that they do not realise that they are not getting enough oxygen. Euphoria can be a symptom of hyperthyroidism. It can also be caused by head injuries or conditions which affect the central nervous system, like syphilis and multiple sclerosis.Rhodri Hayward \"euphoria\" The Oxford Companion to the Body. Ed. Colin Blakemore and Sheila Jennett. Oxford University Press, 2001. Oxford Reference Online. Oxford University Press. 28 July 2011 ===Exercise=== Sometimes, people feel euphoria when exercising. A well-known example is \"runner's high,\" a state of euphoria and high energy that runners sometimes experience, especially during intense workouts. According to recent studies, intense exercise can cause the brain to release endorphins. These endorphins attach to the same brain receptors as opioid drugs, so they can cause the same euphoric effects as those drugs do. Unfortunately, this means that a person could get chemically addicted to consistent exercise, just as he or she might get addicted to opiates. ==References== Category:Emotions",
 "title": "Euphoria"
}