{
 "id": "213554",
 "text": "Jillian Faye Hall (born Jillian Faye Fletcher; September 6, 1980 in Ashland, Kentucky) is an American retired female professional wrestler and singer. She is best known for her time with World Wrestling Entertainment (WWE) where she competed under the ring name Jillian Hall. She released a Christmas album titled A Jingle with Jillian, which was sung completely in her character of a terrible singer. The album reached #20 on the UK Holidays Top 100 shortly after its release. During her time in the WWE, She was a one-time WWE Divas Champion. On November 19, 2010, her WWE contract expired and WWE announced that they were not going to renew it. After being released, she wrestled on the independent circuit until announcing her retirement on January 21, 2014. == Personal life == As a teenager, Hall was a cheerleader and also took gymnastics classes. After graduating from High School, Hall attending college, but dropped out in order to train as a professional wrestler. At nineteen, she legally change her last name from Fletcher to Hall when she married Tim Hall (an independent wrestler name Tiny Tim). She was a fan of Rick Martel. Hall is divorced has a child from the marriage. On September 10, 2010, Hall married Mike Farole in a Las Vegas wedding. Hall announced in February 2011, that the couple was expecting their first child, but suffered a miscarriage 14 weeks into the pregnancy. On April 23, 2012, Hall was arrested in Orange County, Florida and charged with battery. Following her arrest, it was reported that Hall had separated from her husband. In 2020, Hall gave birth to her second child. In December 2021, she was married to Zachary Farrow. They have separated as of 2024. ==References== ==Other websites== * Category:1980 births Category:Living people Category:American professional wrestlers Category:Female professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling managers and valets Category:Sportspeople from Kentucky Category:People from Ashland, Kentucky",
 "title": "Jillian Hall"
}