{
 "id": "21354",
 "text": "Hilary Erhard DuffMiddle name reference can be found in Hilary Duff: All Access (2005) by Rettenmund, Matthew. U.S.: Berkley Trade. p. 2. (U.S.). (born September 28, 1987) is an American actress and singer. She got celebrity famous by being in the television program show' Lizzie McGuire she has gone onto a movie career, with roles in mainstream pictures. Among the movies she plays in are Cheaper by the Dozen, The Perfect Man, A Cinderella Story, Raise Your Voice, Material Girls and independent movies such as War, Inc. and Greta. Duff has also ventured into a music career as a pop musician, releasing 8 albums (for example Most Wanted, Dignity, Metamorphosis, Hilary Duff) and 15 music videos (for example \"Reach Out\", \"With Love\", \"Stranger\", \"Wake Up\", \"So Yesterday\", \"Come Clean\"). Lately she has also ventured into a fashion career as a designer for DKNY, with her new line Femme for DKNY. == Personal life == Duff has an older sister, Haylie, who is also an actress. Duff was married to hockey player Mike Comrie from 2010 to 2016; they share a son, Luca. She is currently married to music producer Matthew Koma since she dated him in 2015. They have three daughters together, Banks, Mae and Townes, born in 2018, 2021 and 2024. == Filmography == Film Film Film Film Year Film Role Notes 2001 Human Nature Young Lila Jute 2003 Agent Cody Banks Natalie Connors 2003 The Lizzie McGuire Movie Lizzie McGuire/Isabella Parigi 2003 Cheaper by the Dozen Lorraine Baker 2004 A Cinderella Story Samantha \"Sam\" Montgomery (Cinderella) 2004 Raise Your Voice Teresa \"Terri\" Fletcher 2005 The Perfect Man Holly Hamilton 2005 Cheaper by the Dozen 2 Lorraine Baker 2006 Material Girls Tanzania \"Tanzie\" Marchetta also Producer 2008 War, Inc. Yonica Babyyeah 2009 What Goes Up Lucy Premiered at the 3rd Annual Buffalo Niagara Film Festival 2009 Greta Greta also Executive Producer 2009 Stay Cool Shasta O'Neil Premiered at the 2009 Tribeca Film Festival 2010 Provinces of Night Raven Halfacre [Post-production] Hotz, Amy. \"Hilary Duff among actors filming 'Provinces' in Pender County.\" Star News Online. April 24, 2009. The Story of Bonnie and Clyde Bonnie Parker [Pre-production] unreleased Foodfight! Sunshine Goodness (Voice only) movies made for television or video movies made for television or video movies made for television or video movies made for television or video Year Title Role Distributor 1998 Casper Meets Wendy Wendy 20th Century Fox Home Entertainment 1999 The Soul Collector Ellie CBS 2002 Cadet Kelly Kelly Disney Channel 2004 In Search of Santa Crystal Miramax Family Films 2010 The Business of Falling in Love Lane Daniels ABC Family Television Television Television Television Year Title Role Notes 2001–2004 Lizzie McGuire Lizzie McGuire Lead role 2009 Gossip Girl Olivia Burke Recurring character (Season 3, Multiple Episodes) Television guest appearances Television guest appearances Television guest appearances Television guest appearances Year Title Role Notes 2000 Chicago Hope Jessie Seldon \"Cold Hearts\" (Season 6, Episode 17) 2003 American Dreams Shangri-Las \"Change a Comin\" (Season 2, Episode 8) 2003 George Lopez Stephanie \"Team Leader\" (Season 2, Episode 22) 2004 Frasier Britney \"Frasier-Lite\" (Season 11, Episode 12) 2005 Joan of Arcadia Dylan Samuels \"The Rise & Fall of Joan Girardi\" (Season 2, Episode 14) 2005 George Lopez Kenzie \"George's Grand Slam\" (Season 4, Episode 19) 2007 The Andy Milonakis Show Herself \"Andy Moves to L.A.\" (episode 1, season 3) 2009 Ghost Whisperer Morgan Jeffries \"Thrilled to Death\" (Season 4, Episode 19) 2009 Law & Order: SVU Ashlee Walker \"Selfish\" (Season 10, Episode 19) 2009 == Discography == ;Studio albums * Santa Claus Lane (2002) * Metamorphosis (2003) * Hilary Duff (2004) * Dignity (2007) * Breathe In. Breathe Out. (2015) ;Compilation albums * Disney Artist Karaoke Series: Hilary Duff (2005) * Most Wanted (2005) * 4Ever (2006) * Best of Hilary Duff (2008) * Metamorphosis / Hilary Duff / Dignity (2009) ;Live albums * The Girl Can Rock (2004) * Live At Gibson Amphitheatre - August 15th, 2007 (2009) == References == == Other websites == * Official music site * Category:1987 births Category:Living people Category:Actors from Houston Category:American movie actors Category:American pop singers Category:American television actors Category:Extras Category:Singers from Houston",
 "title": "Hilary Duff"
}