{
 "id": "213647",
 "text": "The Nymphalidae is the largest family of butterflies, with about 6,000 species. They live on all continents except Antarctica. They are commonly known as nymphalids, brushfoots, or brush-footed butterflies. == Characteristics == Brushfoots get their name from their front pair of legs. This pair of legs is reduced. They do not have claws at the end. Only the middle and last pair of legs are used for walking.Charles A. Triplehorn and Norman F. Johnson (2005). Borror and Delong's Introduction to the Study of Insects (7th Edition). Thomas Brooks/Cole, Belmont, CA. This is why they are called brush-footed butterflies or four-footed butterflies. Many species are brightly colored and include popular species such as the emperors, admirals, tortoiseshells, and fritillaries. Most hold their colourful wings flat when they are at rest. However, the underwings are often dull; in some species they look just like dead leaves, or are much paler. So when they raise their wings in the normal butterfly position, this cryptic effect helps the butterfly disappear into its surroundings. ==Subfamilies== *Apaturinae – Hackberry butterflies and Emperors *Biblidinae – Tropical Brushfoots *Calinaginae *Charaxinae – Leafwings *Cyrestinae *Danainae – Milkweed butterflies *Heliconiinae – Heliconiians and Fritillaries *Ithomiinae (sometimes placed in the subfamily Danainae as a tribe (a tribe is a ranking between family and genus)) *Libytheinae – Snout butterflies *Limenitidinae – Admirals and Sisters *Morphinae – Morphos (sometimes placed in the subfamily Satyrinae as a tribe) *Nymphalinae – Buckeyes, Eggflies, Checkerspots, Crescents, Anglewings, and Ladies *Satyrinae – Satyrs and Browns.Gerardo Lamas (edited by) (2004). Atlas of Neotropical Lepidoptera. Checklist: Part4A. Hesperioidea-Papilionoidea. Scientific Publishers, Inc., Gainesville, FL. ==Some example species== * Aglais urticae – Small Tortoiseshell * Apatura iris – Purple Emperor * Danaus plexippus – Monarch * Hamadryas amphinome – Red Cracker * Inachis io – Peacock * Junonia coenia – Common Buckeye * Libytheana carinenta – American Snout or Common Snout * Limenitis archippus – Viceroy * Morpho menelaus – Blue Morpho * Nymphalis antiopa – Mourning Cloak or Camberwell Beauty * Speyeria cybele – Great Spangled Fritillary * Vanessa cardui – Painted Lady * Vanessa atalanta – Red Admiral ==Image gallery== File:Kleiner Fuchs (Nymphalis urticae).jpg|Small Tortoiseshell (Aglais urticae) File:Apatura iris Weinsberg 20080614 5.jpg|Purple Emperor (Apatura iris) File:Monarch Butterfly Danaus plexippus Male 2664px.jpg|Monarch (Danaus plexippus) File:Common Buckeye, Megan McCarty76.jpg|Common Buckeye (Junonia coenia) File:American snout butterfly.jpg|American Snout or Common Snout (Libytheana carinenta) File:Viceroy Butterfly.jpg|Viceroy (Limenitis archippus) File:Nymphalis antiopa (Suruvaippa).jpg|Mourning Cloak or Camberwell Beauty (Nymphails antipoa) File:Butterfly August 2008-3.jpg|Painted Lady (Vanessa cardui) ==References== ==Other websites== * Nymphalidae at Tree of Life",
 "title": "Nymphalidae"
}