{
 "id": "214193",
 "text": "Waterloo Bridge is a road and foot traffic bridge crossing the River Thames in London, England between Blackfriars Bridge and Hungerford Bridge. == History == The first bridge on the site was designed in 1809-10 by John Rennie for the Strand Bridge Company and opened in 1817 as a toll bridge. The granite bridge had nine arches, each of span, separated by double Grecian-Doric stone columns and was long, including approaches. Before its opening it was known as 'Strand Bridge'. During the 1840s the bridge gained a reputation as a popular place for suicide attempts. In 1844 Thomas Hood wrote the poem The Bridge of Sighs about the suicide of a prostitute there.Ebeneezer Brewer (1970), Brewers Dictionary of Phrase and Fable Cassell. p.152. Paintings of the bridge were created by the French Impressionist Claude Monet and English Impressionist, John Constable. The bridge was nationalised in 1878 and given to the Metropolitan Board of Works, who removed the toll from it. In June 2012, the bridge was highlighted on the route of Queen Elizabeth II's Diamond Jubilee Pageant on the Thames.Thames Diamond Jubilee Pageant, Key facts ; Londontown.com, \"Thames Jubilee Pageant,\"; retrieved 2012-6-4. ==Gallery== File:Waterloo Bridge 1817.jpg|Crowds attend the opening of Waterloo Bridge on 18 June 1817 File:John Constable 001.jpg|View of the old Waterloo Bridge from Whitehall stairs, John Constable File:Underside Waterloo Bridge.jpg|The design called for supporting beams only at the outside edges, to bring \"light and sweetness\" to the undersideGiles Gilbert Scott, quoted in Hopkins (1970) File:City.of.london.view.arp.750pix.jpg|The centre span of the bridge, showing how it is carried on the cantilevered ends of the main beams Image:Drapersgardens.jpg|The completed bridge with the City of London behind ==Related pages == * List of crossings of the River Thames ==References== ==Other websites== *Survey of London entry *Peter Lind & Company * * Category:Bridges in London Category:Buildings and structures in the City of Westminster Category:Transport in the City of Westminster Category:Stone bridges Category:Concrete bridges Category:Grade II* listed buildings in London",
 "title": "Waterloo Bridge"
}