{
 "id": "214161",
 "text": "Geography of Haiti Continent Americas Region Caribbean Coordinates 19°00' N 72°25' W Area Ranked 147 27,750 km² Coastline 1,771 km Borders 360 km Highest point Pic la Selle 2,680 m Lowest point Caribbean Sea 0 m Longest river Artibonite Largest lake Étang Saumâtre Haiti (; ) is a country in the Caribbean. It occupies the western three-eighths of Hispaniola; the Dominican Republic occupies the eastern five-eighths (63%) of the island. The country has a total area of , of which 27,560 km² is land and 190 km² is water. Haiti has of coast-line and a border with the Dominican Republic. The limits of the country are the Dominican Republic to the east, the Atlantic Ocean to the north, and the Caribbean Sea to the south and west. The capital, Port-au-Prince, is a seaport located on the west coast. Cuba is to the northwest and Jamaica to the southwest of Haiti; the Winward Passage separates Cuba from Haiti (and Hispaniola), and the Jamaica Channel separates Haiti from Jamaica. There are two large peninsulas: the Northwestern on the Atlantic Ocean, and the Southern peninsulas on the Caribbean Sea. The Northwestern, or just Northern, Peninsula () is also known as the Saint-Nicolas Peninsula; it was the first part of the Hispaniola visited by Christopher Columbus on 1492. The historical name of the Southern Peninsula () was Tiburón Peninsula. Between those two large peninsulas there is a gulf (a very large bay): the Gulf of Gonâve. It is named so after the Gonâve Island that is in the middle of the gulf. It was called also Gulf of Léogane after the city of Léogane, one of the oldest in Haiti. == Climate == Haiti has a tropical climate but modified by elevation and the Trade winds (winds that come from the northeast, from the Atlantic Ocean, full of water vapour), which blow from the Atlantic all year long. In low lands with mountains to the northeast, the climate is arid (dry) because the trade winds leave their water in those mountains rather than the valleys and plains. There are two rainy seasons, in spring and fall to the south, and in spring and winter to the north. From June to November (mainly from August to October), tropical storms and hurricanes are frequent and can do much damage in the country. == Islands == There are several smaller islands and cays that are part of Haiti. The largest islands are: # Gonâve (), in the Gulf of Gonâve; it is part of the Ouest Department. It has an area of 743 km². Its Taíno name was Guanabo.Name Guanabo as shown in a map made by Andrés Morales in 1508 and published in 1516. In # Tortuga (), located off the northwest coast of Hispaniola, in the Atlantic Ocean; it is part of the Nord-Ouest Department. It has an area of . Its Taíno name was Baynei. It is very famous because many pirates lived here. The island's name comes from the turtle-like shape of the island (in Spanish, turtle is a \"tortuga\"). # Île à Vache, also called Île-à-Vaches, close to the soutwestern coast of Hispaniola. It is part of the Sud Department and has an area of . Its Taíno name was Iabaque. # Cayemites, two islands, Petite Cayemite and Grand Cayemite, in the Gulf of Gonâve. They are part of the Grand'Anse Department, and have a total area of . The Taíno name was Cahaimi. == Mountains and valleys == The chains of mountains show a direction northwest-southeast, except in the Southern Peninsula, where they have a direction west-east. The mountains are separated by valleys with the same general direction. From north to south, the main mountain ranges and valleys are: * The Plaine du Nord (\"Northern Plain\"), along the north coast from Cap-Haïtien to the Dominican Republic, where it is called the Cibao Valley. * The Massif du Nord (\"Northern Massif\"), which in the Dominican Republic is called Cordillera Central. The highest Haitian mountain of this mountain range is Gros Morne (1,198 m). * The Plateau Central (\"Central Plateau\") is a large high valley. * The Bombardopolis Plateau (640 m), Montagnes de Terre Neuve (1,100 m, Morne Goreille), Montagnes Noires (1,700 m, Pic Bonhomme). All this chains form one group of mountains. * Artibonite Plain and Valley, between those mountains mentioned above and below. It is the valley formed by the river Artibonite and its Haitian tributaries. * Chaîne des Matheux (Morne Delpech, 1,600 m) and the Montagnes du Trou d'Eau (Morne Ma Pipe, 1,510 m) form one group that get together with the previous group of mountains to form, in the Dominican Republic, the Sierra de Neiba. * The Cul-de-Sac (Haiti) or Hoya de Enriquillo (Dominican Republic), is a remarkable valley, with a west-east direction, of low elevation (on average 50 m with some points below sea level) and with the Êtang Saumatre lake in the eastern end, on the border with the Dominican Republic. Port-au- Prince is on the western end of this valley. * Massif de la Hotte (Pic Macaya, 2,405 m) and Massif de la Selle (Pic or Morne La Selle, 2,680 m, the highest Haitian mountain) are in the Southern Peninsula. The Massif de la Selle is called Sierra de Bahoruco in the Dominican Republic. The Gonâve Island (Morne La Pierre, 776 m) belongs, in geological terms, to the Massif de la Selle. == Rivers and lakes == The river Artibonite is the longest river of the island and of Haiti. It is 321 km long (68 km in the Dominican Republic, 253 km in Haiti). Its sources are in the Cordillera Central (Dominican Republic) and flows into the Gulf of Gonâve. Its watershed has an area of 6,399 km² in Haiti and 2,614 km² in the Dominican Republic. Another important Haitian river is the Trois Rivières (Three Rivers). It is 150 km long and its sources are in the Massif du Nord and flows into the Atlantic Ocean, near the city of Po// Others lakes are Étang de Miragoâne (25 km²), of fresh water at 4 km southeast from the city of Miragoâne; and Trou Caïman (16.2 km²), a small lake at 6 km from Étang Saumâtre. https://www.shrek.com for more information ==References==",
 "title": "Geography of Haiti"
}