{
 "id": "214239",
 "text": "The Anti-abortion movement is a group of people who believe that human life begins at conception and that the life of unborn children should be protected. Because of this, they oppose abortion, in some or all cases. As they favor the life of the unborn, they are also called pro-life. In 1960, there were the oral contraception pills and the sexual revolution started. The anti-abortion movement started in the early 1970s in the United States. The other movement that believes women should have a choice whether to end a pregnancy is called pro-choice. People who are anti-abortion say that all humans, including the unborn, have a right to live. They say that having a human genome is enough for a developing organism to be called a living human being. Others say that an organism should be identified as a living human once a heartbeat has been detected. Pro-lifers say that abortion should be illegal. Many pro-lifers say pregnant women who do not want to raise a child should look for alternatives to abortion, such as adoption. Many advocacy groups try to convince people that abortion is wrong. The pro-life movement is associated with conservative politics. In one poll in the United States, 66% of conservatives called themselves pro-life. It is also associated with the Catholic Church. Pope Francis has said that \"Every child that isn't born, but is unjustly condemned to be aborted, has the face of Jesus Christ, has the face of the Lord.\" == Background == In 2022, many countries have laws that say that abortion is possible for a certain amount of time, without penalty. In 1973, the U.S. supreme court decided that the article in the laws of a state that banned abortion was unconsitutional. This decision is known as Roe v. Wade today which legalized abortion across all states. In 2022, the Supreme Court reversed the 1973 decision. They ruled that the consitution of the United States does not give the right to privacy under the 14th Amendment, and therefore abortion is not protected. The case that was heard is Dobbs v. Jackson Women's Health Organization. ==References== Category:Social movements related to abortion",
 "title": "Anti-abortion movement"
}