{
 "id": "214327",
 "text": "Jonathan Niven \"Jon\" Cryer (born April 16, 1965) is an American actor, screenwriter and film producer. He is the son of David Cryer (born 1936) and Gretchen Cryer (née Kiger, born 1935). He played Alan Harper in the sitcom Two and a Half Men from 2003–2015. He has won an Emmy Award and has three Emmy nominations for Two and a Half Men. Cryer went to London to study acting at the Royal Academy of Dramatic Arts. ==Film and television credits== Film Year Title Role Notes 1984 No Small Affair Charles Cummings Debut 1985 Noon Wine Teenage Herbert TV movie 1985 O.C. and Stiggs Randall Schwab Jr. 1986 Pretty in Pink Phil 'Duckie' Dale 1987 Morgan Stewart's Coming Home Morgan Stewart 1987 Superman IV: The Quest for Peace Lenny Luthor 1987 Dudes Grant 1987 Hiding Out Andrew Morenski/Max Hauser 1988 Rap Master Ronnie: A Report Card direct-to-video 1989 Penn & Teller Get Killed 3rd Frat Boy 1991 Hot Shots! Jim 'Wash Out' Pfaffenbach 1993 Tommy Kazdan 1993 Heads Guy Franklin TV movie 1996 Mark also as writer 1996 Cannes Man Himself Cameo appearance 1997 Plan B Stuart Winer 1998 Went to Coney Island on a Mission from God... Be Back by Five Daniel also as writer and producer 1998 Holy Man Barry 2000 Clayton 2001 Glam Jimmy Pells 2003 Mr. Stamm TV movie 2008 Unstable Fables: 3 Pigs and a Baby Richard Pig Voice role 2008 Tortured Brian 2009 Weather Girl Charles completed 2009 Shorts Dad Thompson 2009 Stay Cool Javier 2010 Due Date Alan Harper cameo 2013 Planes Dusty Crophopper Voice Role In-production Television Year Title Role Notes 1986 Amazing Stories Phil Episode: \"Miscalculation\" 1989–1990 Teddy Zakalokis 1995–1996 Partners Bob also as producer 1996 Trevor McPhee Episode: \"Vanishing Act\" 1997 It's Good to Be King Mort 1997 Dharma & Greg Brian Episode: \"Shower the People You Love with Love\" 1998 Getting Personal Sam Wagner Episode: \"Sam I am\" Cryer also produced the series 1998 Hercules: The Animated Series The Winged Wolves (voice) Episode: \"Hercules and the Underworld Takeover\" 1998 Mr. Show with Bob & David Duckie Episode: \"It's Perfectly Understandishable\" 1998 Two Guys a Girl and a Pizza Place Justin Episode: \"Two Guys, a Girl and a Thanksgiving\" 2000, 2010 Family Guy Kevin Swanson, Himself Episodes: \"There's Something About Paulie\", \"Brian Griffin's House of Payne\" 2000–2001 Zack Mango 2002 Andy Richter Controls the Universe Lemuel Praeger Episode: \"Gimme a C\" 2002 Terry Pender Episode: \"Of Thee I Sing\" 2003 Becker Roger Episode: \"Chris' Ex\" 2003 Hey Joel Joel Stein (voice) 2003 Stripperella (voice) 2003–2015 Two and a Half Men Alan Harper main cast member; directed three episodes between 2007–present Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series (2009) Nominated—Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series (2006, 2007, 2008, 2010, 2011) Nominated—Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series (2011) 2005, 2006 Danny Phantom Freakshow Episodes: \"Reality Trip\" and \"Control Freaks\" 2006 American Dad! Quacky (Parody of his Pretty in Pink character, Duckie.) Episode: \"It's Good to Be Queen\" 2007 CSI: Crime Scene Investigation Alan Harper Cameo 2010, 2011 Hannah Montana Kenneth Truscott Episodes: \"The Wheel Near My Bed (Keeps on Turnin')\" and \"I Am Mamaw, Hear Me Roar!\" == Other websites == * ==References== Category:1965 births Category:Living people Category:Actors from New York City Category:American movie actors Category:American television actors Category:American voice actors Category:American Emmy Award winners Category:Movie producers from New York City",
 "title": "Jon Cryer"
}