{
 "id": "214392",
 "text": "I'm a Celebrity...Get Me Out Of Here! (often shortened to I'm a Celebrity or I'm a Celeb) is a British survival reality television show, The format sees a group of celebrities living together in a jungle camp for three weeks. Each member undertakes challenges to secure additional food and treats for the group, and to avoid being voted out by viewers during their stay, with the final episode's votes nominating who wins a series. It’s currently presented by Declan Donnelly and Ant McPartlin, it was previously hosted by Holly Willoughby for 2018. The UK version of the show takes place in Queensland, Australia and airs every November-December on ITV1 in the UK. The current presenters are Anthony McPartlin and Declan Donnelly. The previously host was Holly Willoughby. == Format == A group of celebrities (usually between 8 and 12) are sent into a jungle in Australia. They must live there in a camp for three weeks and may come across many bugs and creatures. === Bushtucker trial === Every day, someone has to do a task known as a \"bush trucker trial\". The public has to vote on which celebrity has to do it apart from in the first two or three days. Sometimes, near the end of the series the celebrities decide who participates in the trail. To make the trials more challenging, they put some creepy crawlies with them. All trials have stars, and they earn stars for meals back at the camp. If a celebrity doesn't win any stars, they will be given rice instead of a meal. === Eliminations and winner === In most versions of the show, the public get to vote for which celebrity they want to stay in the jungle. The celebrity with the least votes is eliminated. This happens until only one remains. ==Cut scenes== Like Big Brother, the show has a lot of cut scenes. One of them has a spider which catches a bug and spins it around and makes an amusing sound. == Presenters == In 2002, Ant McPartlin and Dec Donnelly were announced as the hosts of the show. In 2018, Ant McPartlin was suspended from television and he was replaced on the show. In November 2018, Holly Willoughby was announced to host the show alongside Donnelly replacing McPartlin. In 2019, it was announced that McPartlin will be returning to the show alongside Donnelly replacing Willoughby. Series Presenters 1 2 1 Declan Donnelly Anthony McPartlin 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 Holly Willoughby 19 Anthony McPartlin 20 21 22 23 == Series overview == Series Presenters Location Winner Campmates Days 1 Dec Donnelly Ant McPartlin Tony Blackburn 8 15 2 Phil Tufnell 10 3 Kerry Katona 17 4 Joe Pasquale 11 16 5 Carol Thatcher 12 6 Matt Willis 12 17 7 Christopher Biggins 11 19 8 Joe Swash 12 20 9 Gino D'Acampo 13 19 10 Stacey Solomon 11 Dougie Poynter 12 Charlie Brooks 12 13 Kian Egan 20 14 Carl Fogarty 15 Vicky Pattison 13 21 16 Scarlett Moffatt 12 17 Georgia Toffolo 22 18 Holly Willoughby Harry Redknapp 11 19 Ant McPartlin Jacqueline Jossa 12 20 Giovanna Fletcher 20 21 Danny Miller 19 22 Jill Scott 22 All-Stars Myleene Klass 15 15 23 Sam Thompson 12 23 == Camp Leader == I'm a Celebrity...Get Me Out of Here! Camp leader is currently No one === Leaders === * Noel Edmonds – Campking (2018; Series 18) * James Haskell – Camp Leader (2019; Series 19) * Giovanna Fletcher – Camp Leader (2020, Series 20) * Louise Minchin – Camp Leader (2021, Series 21) * Matt Hancock – Camp Leader (2022, Series 22) * Sam Thompson – Camp Leader (2023, Day 9–13) * Nella Rose – Camp Leader (2023, Day 13–16) * Dannielle Harold – Camp Leader (2023, Day 16–20) * Josie Gibson – Camp Leader (2023, Day 20–21) === Deputy === * Marvin Humes – Deputy (2023, Day 9–13) * Dannielle Harold – Deputy (2023, Day 13–16) * Josie Gibson – Deputy (2023, Day 16–20) * Tony Bellew – Deputy (2023, Day 20–21) == Home and Away Team Leaders == ==References== ==Other websites== * Category:2002 British television series debuts Category:2000s television series Category:2010s television series Category:English-language television programs",
 "title": "I'm a Celebrity...Get Me Out of Here!"
}