{
 "id": "214473",
 "text": "Harold Clayton Lloyd, Sr. (April 20, 1893 – March 8, 1971) was an American actor, comedian, and stunt performer. He was in many silent comedy movies.Obituary Variety, March 10, 1971, page 55. Lloyd made over 200 comedy movies from 1914 to 1947. These movies were both without and with sound. He usually played as a zeitgeist 1920s-era character. His movies usually had \"thrill\" sections where Lloyd would be in fast chases and performed his own stunts. Lloyd did these dangerous stunts himself even though a movie accident had caused the loss of his right thumb and index finger. After that accident, he used a prosthetic glove. This glove was not noticeable in his movies.An American Comedy; Lloyd and Stout; 1928; page 129 Although Lloyd's movies were not as commercially successful as Chaplin's, Lloyd made a lot more money than Chaplin during their movie years. ($15.7 million to Chaplin's $10.5 million). In 1971, Lloyd died of prostate cancer. ==Death== In March 8, 1971, Lloyd died of prostate cancer. He died in his Greenacres home in Beverly Hills, California. His co-star Bebe Daniels died eight days after him. His son Harold Lloyd Jr. died three months after him.D'Agostino 1994. pp. 54-55. ==References== ==Further reading== * * * * * * * * * * * * * * * * * * * * * * * * * * * * ==Other websites== * * Harold Lloyd .us by Annette D'Agostino Lloyd * Harold Lloyd Photographs and bibliography * Index of Lloyd Comedy Classics ;Interviews * BBC Radio Interview with Suzanne Lloyd (2002) * 1922 magazine interview ;Media * * Harold Lloyd in The Sin Of Harold Diddlebock at Internet Archive * Old Gold Comedy Theater Episodes at Internet Archive * Harold Lloyd Photos at Silent Ladies & Gents ;Data *AFI|Catalog *Harold Lloyd *Harold Lloyd | Biography, Movie Highlights and Photos * Category:1893 births Category:1971 deaths Category:Actors from Nebraska Category:American movie actors Category:American silent movie actors Category:Cancer deaths in the United States Category:Deaths from prostate cancer",
 "title": "Harold Lloyd"
}