{
 "id": "214569",
 "text": "The 1970–71 NHL season was the 54th season of the National Hockey League (NHL). Fourteen teams each played 78 games. The Montreal Canadiens were the Stanley Cup winners as they swept the Chicago Black Hawks in seven games in the final series. The Buffalo Sabres and the Vancouver Canucks made their NHL debuts this season. ==Regular season== ===Final standings=== Note: GP = Games played, W = Wins, L = Losses, T = Ties, Pts = Points, GF = Goals for, GA = Goals against, PIM = Penalties in minutes Note: Teams that qualified for the playoffs are highlighted in bold National Hockey League GP W L T Pts GF GA PIM Boston Bruins 78 57 14 7 121 399 207 1154 New York Rangers 78 49 18 11 109 259 177 952 Montreal Canadiens 78 42 23 13 97 291 216 1271 Toronto Maple Leafs 78 37 33 8 82 248 211 1133 Buffalo Sabres 78 24 39 15 63 217 291 1188 Vancouver Canucks 78 24 46 8 56 229 296 1371 Detroit Red Wings 78 22 45 11 55 209 308 988 West Division GP W L T Pts GF GA PIM Chicago Black Hawks 78 49 20 9 107 277 184 1280 St. Louis Blues 78 34 25 19 87 223 208 1092 Philadelphia Flyers 78 28 33 17 73 207 225 1060 Minnesota North Stars 78 28 34 16 72 191 223 898 Los Angeles Kings 78 25 40 13 63 239 303 775 Pittsburgh Penguins 78 21 37 20 62 221 240 1079 California Golden Seals 78 20 53 5 45 199 320 937 ===Scoring leaders=== Note: GP = Games played, G = Goals, A = Assists, PTS = Points, PIM = Penalties in minutes PLAYER TEAM GP G A PTS PIM Phil Esposito Boston Bruins 78 76 76 152 71 Bobby Orr Boston Bruins 78 37 102 139 91 John Bucyk Boston Bruins 78 51 65 116 8 Ken Hodge Boston Bruins 78 43 62 105 113 Bobby Hull Chicago Black Hawks 78 44 52 96 32 Norm Ullman Toronto Maple Leafs 73 34 51 85 24 Wayne Cashman Boston Bruins 77 21 58 79 100 John McKenzie Boston Bruins 65 31 46 77 120 Dave Keon Toronto Maple Leafs 76 38 38 76 4 Jean Beliveau Montreal Canadiens 70 25 51 76 40 Fred Stanfield Boston Bruins 75 24 52 76 12 ==Stanley Cup playoffs== ===Playoff bracket=== ==NHL awards== Clarence S. Campbell Bowl: Chicago Black Hawks Art Ross Trophy: Phil Esposito, Boston Bruins Bill Masterton Memorial Trophy: Jean Ratelle, New York Rangers Calder Memorial Trophy: Gilbert Perreault, Buffalo Sabres Conn Smythe Trophy: Ken Dryden, Montreal Canadiens Hart Memorial Trophy: Bobby Orr, Boston Bruins James Norris Memorial Trophy: Bobby Orr, Boston Bruins Lady Byng Memorial Trophy: Johnny Bucyk, Boston Bruins Lester B. Pearson Award: Phil Esposito, Boston Bruins NHL Plus/Minus Award: Bobby Orr, Boston Bruins Vezina Trophy: Eddie Giacomin & Gilles Villemure, New York Rangers Lester Patrick Trophy: William M. Jennings, John B. Sollenberger, Terry Sawchuk ===All-Star teams=== First team Position Second team Ed Giacomin, New York Rangers G Jacques Plante, Toronto Maple Leafs Bobby Orr, Boston Bruins D Brad Park, New York Rangers J.C. Tremblay, Montreal Canadiens D Pat Stapleton, Chicago Black Hawks Phil Esposito, Boston Bruins C Dave Keon, Toronto Maple Leafs Ken Hodge, Boston Bruins RW Yvan Cournoyer, Montreal Canadiens Johnny Bucyk, Boston Bruins LW Bobby Hull, Chicago Black Hawks ==References== *Hockey Database *NHL.com Category:1970 in North America Category:1971 Category:National Hockey League seasons",
 "title": "1970–71 NHL season"
}