{
 "id": "214886",
 "text": "Sticklebacks are fish of the Gasterosteidae family. FishBase currently recognises sixteen species in the family, grouped in five genera. Several of the species have a number of recognised subspecies, and the taxonomy of the family is thought to be in need of revision. They have a Holarctic distribution in fresh, brackish and marine waters. An unusual features of sticklebacks is that they have no scales, although some species have bony armour plates. They were thought to be related to pipefish and seahorses, but recent studies have shown that they're now related to the eelpouts and sculpins. Stickleback species are found in fresh water environments in Europe, Asia and North America. They feed on small crustaceans and fish larvae. Sticklebacks have strong separated spines in the dorsal fin. All species show similar mating behaviour, with co-operation between the sexes, and protection of the eggs. The males construct a nest from vegetation held together by secretions from their kidneys. The males then attract females to the nest. The females lay their eggs inside, where the males fertilise them. The males then guards the eggs until they hatch. == Taxonomy == The Gasterosteidae, was first proposed as a family by the French zoologist Charles Lucien Bonaparte in 1831. It has long been considered that the sticklebacks and others made up a suborder, the Gasterosteoidei in the order Gasterosteiformes. Recent phylogenetic work has shown that the Gasterosteoidei is closely related to the Zoarcoidei and the Cottoidei. This taxon is now in the order Scorpaeniformes. === Genera === The family Gasterosteidae includes the following genera: * Apeltes DeKay, 1842 * Culaea Whitley, 1950 * Gasterosteus Linnaeus, 1758 * Pungitius d'Annone, 1760 * Spinachia Cuvier, 1816 == Description == === Sizes === Sticklebacks have many sizes. Spinachia spinachia, the sea stickleback, is the largest of the sticklebacks and can grows to a length of 22 centimetres (8.7 in). The maximum size of the three-spined stickleback (Gasterosteus aculeatus), is about 4 inches, but few of them are more than 3 inches long. Body form varies with habitat: sticklebacks in shallow lakes have developed a deep body specialized to enable eating benthic invertebrates, whilst those in deep oligotrophic lakes love to feed on plankton and have a more slimlined body. === Personality === Studies have shown that sticklebacks display distinct personality traits, specifically in the area of taking a risk, and, can be considered bold or shy. These traits were determined to directly influence if they'd lead, and if discouraged, attempt to lead again. == Mating == Sticklebacks show similar, unusual mating behaviour. Here's how they do it. === Mating choice === The sex with the greatest parental investment has the strongest mate preferences. These small, spiky fishes exhibit mutual mate choice in which both the male and female have strong mate preferences. It is most probably due in part to the strong parental investment on behalf of the male in guarding the eggs. === Inbreeding avoidance === Female threespine sticklebacks adjust their courting behaviour to the risk of inbreeding. They prefer to mate with the non-sibling and avoid the disadvantages that accompany incest. == References == == Other websites == * View the gasAcu1 genome assembly in the UCSC Genome Browser. Category:Scorpaeniformes",
 "title": "Stickleback"
}