{
 "id": "214889",
 "text": "Mikhaíl Bulgakov ( - 10 March 1940) was a Soviet Russian writer and playwright active in the first half of the 20th century. He is best known for his novel The Master and Margarita, which has been called one of the masterpieces of the 20th century.Mukherjee, Neel 2008. The Master and Margarita: a graphic novel by Mikhail Bulgakov. The Times, London. accessdate=2009-01-19The sword and the shield: the Mitrokhin Archive and the secret history of the KGB Much of Bulgakov's work is best described as magic realism, where fantasy intrudes into what seemed at first to be a straightforward everyday scene. == Life == Mikhail Bulgakov was born in Kiev on May 15 1891. Two of his grandparents were priests and his father was an assistant professor. At school Bulgakov developed an interest in Russian writing, European writing, the theatre and the opera. In 1913 Bulgakov married Tatiana Lappa. When the First World War started he volunteered with the Red Cross as a doctor. Bulgakov was sent to an area where fighting was heavy, and he was badly injured at least twice. In 1916, he graduated from the Medical School of Kiev University. Bulgakov then joined the White Army with his brothers. They fought against the communists who were taking control of Russia. Bulgakov also fought in the Ukrainian People's Army. After the Russian Civil War, Mikhail and his brothers went to the Caucasus in Western Russia. Mikhail worked as a journalist. Many members of Bulgakov's family left Russia for Western Europe. Bulgakov was not allowed into other countries, however, as he had a disease called typhus. The injuries Bulgakov received in the First World War continued to cause him a lot of pain. To ease the pain, he started injecting himself with morphine. He eventually became addicted. He wrote a book about this period called Morphine, which was finally released in 1926. Bulgakov left medicine behind as he was now sure he wanted to be a writer. He moved to Moscow with his wife Tatiana in 1921. Bulgakov eventually divorced Tatiana, and married Lyubov' Belozerskaya in 1924. He published a number of works in the early 1920s. By 1927, however, he was criticised by people who said he was writing against the Soviet government. By 1929, Bulgakov's writing career was in ruins. Government censorship stopped his work and plays being released in the USSR. In 1931, Bulgakov got married again, to Yelena Shilovskaya. Yelena inspired one of the main characters in Bulgakov's most famous novel, The Master and Margarita. In the last ten years of his life, Bulgakov continued to write novels, plays and translate works in other languages. Many could still not be published in the USSR of the 1930s. Those that were published were often heavily criticised. Bulgakov did not like the way Soviet system prevented his works being published. He wrote a letter to the Soviet government asking permission to leave the country. He even spoke directly to Stalin on the telephone, asking to be allowed to leave the USSR. Stalin's reply implied that if Bulgakov attempted to leave, he would be killed. Stalin did allow Bulgakov to work at a small theatre in Moscow, however. Bulgakov eventually worked at the Moscow Art Theatre, but the Soviet system still did not allow him to write as he really wanted. This, and the fact that he was not allowed to go abroad to see his family, made Bulgakov very unhappy. Bulgakov died from problems with his kidneys on March 10, 1940. He was buried in the Novodevichy Cemetery in Moscow. == The Master and Margarita == The novel is a satire on the Soviet society. It is covered by a plot in which two apparently unrelated stories alternate chapter by chapter. The first plot theme is the Devil in modern Moscow; the second is the story of Pontius Pilate. Connecting these two themes are Satan himself, and the Master with his devoted lover Margarita. The Master is an embittered author, whose historical novel about Pontius Pilate had been rejected by the Soviet literary committee MASSOLIT. :\"On first reading the novel. readers were astonished by its daring satire and hilarious comedy\".Figes, Orlando 2010. Introduction to The Master and Margarita, transl. Richard Pevear & Larissa Volokhonsky. London: Folio Society, ix. By means of the plot, Bulgakov deals with some of the deepest issues in life: the interplay of good and evil, innocence and guilt, courage and cowardice. Bulgakov started writing the novel in 1928. He burnt the first manuscript of the novel in 1930, seeing no future as a writer in the Soviet Union.Cornwell, Neil & Christian, Nicole 1998. Reference guide to Russian literature. London: Taylor & Francis. The work was restarted in 1931. The second draft was completed in 1936 by which point all the major plot lines of the final version were in place. The third draft was finished in 1937. Bulgakov continued to revise the work, helped by his wife, but was forced to stop work on the fourth version four weeks before his death in 1940. A censored version (12% of the text removed and still more changed) of the book was first published in Moscow magazine (#11, 1966 and #1, 1967). The text of all the omitted and changed parts, with indications of the places of modification, was published on a samizdat basis. In 1967 the publisher Posev (Frankfurt) printed a version produced with the aid of these inserts. In the Soviet Union, the first complete version, prepared by Anna Saakyants, was published in 1973, based on the version of the beginning of 1940 proofread by the publisher. In 1989 the last version was prepared by literature expert Lidiya Yanovskaya based on all available manuscripts. The novel is autobiographical.In fact, all his works are autobiographical: Dobrenko, Evgeny 2008. Introduction to White Guard, transl. Marian Schwartz. Yale University Press, xxi. Bulgakov is the Master, and his trials and difficulties are very similar to those the Master faces. Margarita is Yelena Shilovskaya, his long- term girlfriend who became his third wife. The burning of the Master's manuscript is just what Bulgakov did, and for the same reasons of despair and frustration. Of course a state literary committee prevented its publication, just as MASSOLIT did in the novel. And Bulgakov was fascinated with the confrontation between Christ and Pontius Pilate. Bulgakov never lived to see the manuscript published, nor to enjoy his post-war fame. He died from nephrosclerosis (an inherited kidney disorder) on 10 March 1940.Nephrosclerosis: damage to the kidneys by chronic (long-term) high blood pressure His father died of the same disease, and Bulgakov had long expected his fate. === In other media === The novel has been the basis of films, stage productions,The Cambridge Guide to World Theatre, edited by Martin Banham (CUP 1988) opera, ballet, and television versions.The Master and Margarita (Мастер и Маргарита) is a Russian television production of Telekanal Rossiya, based on the novel The Master and Margarita. == Works == === Novels and short stories === *The White Guard (1926, translation 1971; 2008) A novel about a life of a White Army officer's family in civil war Kiev. Set in Ukraine, beginning in late 1918, the novel concerns the fate of the Turbin family as the various armies of the Russian Civil War – the Whites, the Reds, the Imperial German Army, and Ukrainian nationalists – fight over the city of Kiev. *Great Soviet short stories (1962) *The Master and Margarita (1967) *Black snow: a theatrical novel (1967) *Heart of a Dog (1968) A biting satire of the New Soviet man written in 1925 at the height of the NEP period, when Communism appeared to be weakening in the Soviet Union. *A country doctor's notebook (1975) *Diaboliad and other stories (1990) *The Terrible news: Russian stories from the years following the Revolution (1990) *Notes on the cuff & other stories (1991) *The Fatal Eggs and other Soviet satire, 19181963 (1993). The lead title was a science fiction novella, written in 1924 and first published in 1925. The book became popular. It was attacked by some Soviet critics who saw it as a satire of the Russian Revolution of 1917 and the leadership of Soviet Russia. *A dead man's memoir (a theatrical novel) (2007) ===Theatre=== *The early plays of Mikhail Bulgakov, 1990 *Peace plays: two, 1990 *Zoya's apartment: a tragic farce in three acts, 1991 *Six plays, 1991 ===Biography=== *Life of Mr. de Molière, 1962 == References == Category:1891 births Category:1940 deaths Category:Russian playwrights Category:Writers from Kyiv Category:Deaths from kidney disease",
 "title": "Mikhail Bulgakov"
}