{
 "id": "214915",
 "text": "John Maynard Smith,His surname was Maynard Smith, not Smith, nor was it hyphenated. FRS (6 January 1920 – 19 April 2004) was a British theoretical evolutionary biologist and geneticist. Originally an aeronautical engineer during the Second World War, he then took a second degree in genetics under the well-known biologist J.B.S. Haldane. Maynard Smith was instrumental in the application of game theory to evolution and theorized on other problems such as the evolution of sex and signalling theory. == Awards == He won most of the awards available to scientists: *Fellow, Royal Society (1977) *Darwin Medal (1986) *Frink Medal (1990) *Balzan Prize (1991) *Linnean Medal (1995) *Royal Medal (1997) *Crafoord Prize (1999) *Copley Medal (1999) *Kyoto Prize (2001) *Darwin-Wallace Award (2008). This was at the time awarded every 50 years by the Linnean Society of London. Maynard Smith was one of thirteen co- recipients. Maynard Smith has an Erdős number of four. == Books == * Maynard Smith J. 1958. The theory of evolution. London, Penguin Books. ** 1993 edn * Maynard Smith J. 1968. Mathematical ideas in biology. Cambridge University Press. ISBN * Maynard Smith J. 1972. On evolution. Edinburgh University Press. * Maynard Smith J. 1974. Models in ecology. Cambridge University Press. ISBN * Maynard Smith J. 1978. The evolution of sex. Cambridge University Press. * Maynard Smith J. (ed) 1981. Evolution now. London, Macmillan. * Maynard Smith J. 1982. Evolution and the theory of games. Cambridge University Press. * Maynard Smith J. 1986. The problems of biology. Oxford: Oxford University Press. * Maynard Smith J. 1988. Did Darwin get it right?: essays on games, sex and evolution. London, Chapman & Hall. * Maynard Smith J. 1989. Evolutionary genetics. Oxford: Oxford University Press. * Maynard Smith J. and Szathmáry E. 1997. The major transitions in evolution. New York: Oxford University Press. * Maynard Smith J. and Szathmáry E. 1999. The origins of life: from the birth of life to the origin of language. Oxford: Oxford University Press. * Maynard Smith J. and Harper D. 2003. Animal signals. Oxford University Press. == References == Category:1920 births Category:2004 deaths Category:English biologists Category:English geneticists Category:British zoologists Category:English science writers",
 "title": "John Maynard Smith"
}