{
 "id": "21532",
 "text": "Uzbekistan, officially the Republic of Uzbekistan, is a country in Central Asia. Its capital and largest city is Tashkent. There are about 37,5 million people living in Uzbekistan, in 2023. The neighbouring countries are Afghanistan, Kazakhstan, Kyrgyzstan, Tajikistan and Turkmenistan. It is a doubly landlocked country, of which there are only two in the world. Most people in Uzbekistan speak a language called Uzbek, a Turkic language similar to Uyghur and Turkish. In the Uzbek language, Uzbekistan is called \"O‘zbekiston\" and it means \"the land of the true nobles\". Uzbekistan has a long history. Humans first lived in Uzbekistan from before the 2nd millennium BC.Embassy of Uzbekistan - UZBEKISTAN: PAST, PRESENT, FUTURE The current president today is Shavkat Mirziyoyev. The situation with the human rights in Uzbekistan is very bad, according to Human Rights Watch.Uzbekistan: Human Rights Watch Islam is its largest religion. ==Provinces== Uzbekistan is divided into twelve provinces, one autonomous republic, and one independent city. The provinces are divided into districts. Division Capital City Area (km²) Population (2008) Key Buxoro Region Buxoro (Bukhara) 39,400 1,576,800 3 Jizzax Region Jizzax 20,500 1,090,900 5 Navoiy Region Navoiy 110,800 834,100 7 Qashqadaryo Region Qarshi 28,400 2,537,600 8 Samarqand Region Samarkand 16,400 3,032,000 9 Sirdaryo Region Guliston 5,100 698,100 10 Surxondaryo Region Termiz 20,800 2,012,600 11 Tashkent Region Toshkent (Tashkent) 15,300 2,537,500 12 Tashkent City Toshkent (Tashkent) ??? 2,192,700 1 Fergana Region Fergana 6,800 2,997,400 4 Andijan Region Andijan 4,200 2,477,900 2 Namangan Region Namangan 7,900 2,196,200 6 Xorazm Region Urganch 6,300 1,517,600 13 Qaraqalpaqstan Respublikasi Nukus 160,000 1,612,300 14 ==Notes== == References == == Further reading == * Poopak NikTalab. Sarve Samarghand (Cedar of Samarkand), continuous interpretation of Rudaki's poems, Tehran 2020, Faradid Publications {Introduction} Category:Members of the Organisation of Islamic Cooperation",
 "title": "Uzbekistan"
}