{
 "id": "215337",
 "text": "Field research is research done in natural surroundings. It is used in biology to contrast with research done in the laboratory. Field research is defined as a qualitative method of data collection that aims to observe, interact and understand people while they are in a natural environment. For example, nature conservationists observe behavior of animals in their natural surroundings and the way they react to certain scenarios. In the same way, social scientists conducting field research may conduct interviews or observe people from a distance to understand how they behave in a social environment and how they react to situations around them. Field research encompasses a diverse range of social research methods including direct observation, limited participation, analysis of documents and other information, informal interviews, surveys etc. Although field research is generally characterized as qualitative research, it often involves multiple aspects of quantitative research in it. Field research typically begins in a specific setting although the end objective of the study is to observe and analyze the specific behavior of a subject in that setting. The cause and effect of a certain behavior, though, is tough to analyze due to presence of multiple variables in a natural environment. Most of the data collection is based not entirely on cause and effect but mostly on correlation. While field research looks for correlation, the small sample size makes it difficult to establish a causal relationship between two or more variables. == Methods of Field research == Field research is typically conducted in 5 distinctive methods. They are: * Direct Observation In this method, the data is collected via an observational method or subjects in a natural environment. In this method, the behavior or outcome of situation is not interfered in any way by the researcher. The advantage of direct observation is that it offers contextual data on people, situations, interactions and the surroundings. This method of field research is widely used in a public setting or environment but not in a private environment as it raises an ethical dilemma. * Participant Observation In this method of field research, the researcher is deeply involved in the research process, not just purely as an observer, but also as a participant. This method too is conducted in a natural environment but the only difference is the researcher gets involved in the discussions and can mould the direction of the discussions. In this method, researchers live in a comfortable environment with the participants of the research, to make them comfortable and open up to in-depth discussions. * Ethnography Ethnography is an expanded observation of social research and social perspective and the cultural values of an entire social setting. In ethnography, entire communities are observed objectively. For example, if a researcher would like to understand how an Amazon tribe lives their life and operates, he/she may chose to observe them or live amongst them and silently observe their day-to-day behavior. * Qualitative Interviews Qualitative interviews are close-ended questions that are asked directly to the research subjects. The qualitative interviews could be either informal and conversational, semi-structured, standardized and open-ended or a mix of all the above three. This provides a wealth of data to the researcher that they can sort through. This also helps collect relational data. This method of field research can use a mix of one-on-one interviews, focus groups and text analysis. * Case Study A case study research is an in-depth analysis of a person, situation or event. This method may look difficult to operate, however, it is one of the simplest ways of conducting research as it involves a deep dive and thorough understanding the data collection methods and inferring the data. ==References== Category:Biology Category:Research methods",
 "title": "Field research"
}