{
 "id": "215592",
 "text": "The Sundance Film Festival is an American movie festival that takes place every year in Utah. It is one of the largest independent movie festivals in the United States. The festival is held in January in Park City, Salt Lake City, Ogden, and at the Sundance Resort. It is an event for new work from American and international independent movie makers. The festival has competition for American and international drama and documentary movies, feature films and short films. == 2015 == The 2015 Sundance Film Festival took place January 22 to February 1, 2015. What Happened, Miss Simone?, a documentary about American singer Nina Simone, opened the festival. A comedy- drama movie, Grandma, was the closing night movie. It stars Lily Tomlin. == Success of festival == Many notable independent movie makers first got noticed at Sundance, including Kevin Smith, Robert Rodriguez, Quentin Tarantino, Todd Field, David O. Russell, Steve James, Steven Soderbergh, Darren Aronofsky, James Wan, Edward Burns, and Jim Jarmusch. The festival has also given more attention and a larger audience to such movies as Saw, Super Troopers, The Blair Witch Project, Spanking the Monkey, Reservoir Dogs, Primer, Little Miss Sunshine, Clerks, Sex, Lies, and Videotape, The Brothers McMullen, Afternoon Delight, Napoleon Dynamite, and Whiplash. ==References == ==Further reading== *Anderson, John. Sundancing: Hanging Out And Listening In At America's Most Important Film Festival. Harper Paperbacks, 2000. *Biskind, Peter. Down and Dirty Pictures: Miramax, Sundance, and the Rise of Independent Film. Simon & Schuster, 2004. *Craig, Benjamin. Sundance – A Festival Virgin's Guide. Cinemagine Media Publishing, 2004. *Smith, Lory. Party in a Box: The Story of the Sundance Film Festival . Gibbs Smith Publishers, 1999. *von Roon, Alexander. \"Grass and dark Tunnels: Sundance is a Marketing-Tool for the US Film Industry\", Berliner Zeitung 2000. == Other websites == * – official site *Sundance: A Festival Virgin's Guide – detailed festival history and information for attendees * Category:Movie festivals Category:Park City, Utah Category:1978 establishments in the United States",
 "title": "Sundance Film Festival"
}