{
 "id": "215521",
 "text": "Dame Vanessa Redgrave (Blackheath, London, England, 30 January 1937) is an English actress and activist. ==Life and career== Born in a theatrical family, her father was actor Sir Michael Redgrave (1908-1985). Her mother was actress Rachel Kempson (1910-2003). Her brother Corin Redgrave (1939-2010) and sister Lynn Redgrave (1943-2010) were both actors. She began her career in theatre in 1958 with the Royal Shakespeare Company. She made her movie debut in 1966 in Morgan, a Suitable Case for Treatment, followed by Blowup. In 1967, she appeared in the musical Camelot, opposite Richard Harris. Other notable movies have included; The Charge of the Light Brigade (1968), Isadora (1969), The Devils (1970), The Trojan Women (1971), Mary Queen of Scots (1972), Murder on the Orient-Express (1974), Julia (1977), for which she won an Academy Award for best supporting actress, Agatha (1979), The Bostonians (1984), Wetherby (1985), Howard Ends (1992), Mrs Dalloway (1997), Deep Impact (1998), etc. On television, she appeared in Playing for Time in 1980, which won her an Emmy Award for best actress, as well as in the teleseries Peter The Great (1986) and Young Catherine (1991). In 2010 she received the BAFTA Academy Fellowship Award, a lifetime achievement award. Redgrave was married to movie director Tony Richardson from 1962 until 1967, with whom she had two daughters: actresses Natasha Richardson (1963-2009) and Joely Richardson (b. 1965). She has a son, Carlo Gabriel Nero (b. 1969) with Italian actor Franco Nero, whom she married in 2006. ==Filmography== Year Title Role Notes 1958 Behind the Mask Pamela Gray 1966 Morgan: A Suitable Case for Treatment Leonie Delt Cannes Film Festival Best Actress Award Nominated – Academy Award for Best Actress Nominated – BAFTA Award for Best Actress in a Leading Role Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy 1966 A Man For All Seasons Anne Boleyn 1966 Blowup Unnamed 1967 Camelot Guinevere 1968 Mrs. Clarissa Morris 1968 Nina 1968 Isadora Isadora Duncan Cannes Film Festival Best Actress Award National Society of Film Critics Award for Best Actress Nominated – Academy Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Drama 1969 Oh! What a Lovely War Sylvia Pankhurst 1969 Flavia 1970 Dropout Mary 1970 1971 Mary, Queen of Scots Mary, Queen of Scots 1971 Sister Jeanne 1971 Vacation Immacolata Meneghelli 1971 Andromache 1973 Katherine Mansfield Television film 1974 Murder on the Orient Express Mary Debenham 1975 Out of Season Ann 1976 Lola Deveraux 1977 Julia Julia 1979 Agatha Agatha Christie 1979 Yanks Helen 1979 Bear Island Heddi Lindguist 1981 Playing for Time Fania Fenelon Primetime Emmy Award for Outstanding Lead Actress – Miniseries or a Movie 1982 My Body, My Child Leenie Cabrezi Television film 1983 Sing Sing Queen 1983 Wagner Cosima Wagner Had a limited theatrical release; better known as a television mini-series; 2011 re-released as a feature film on DVD 1984 Olive Chancellor 1985 Wetherby Jean Travers National Society of Film Critics Award for Best Actress 1985 Three Sovereigns for Sarah Sarah Cloyce 1985 Steaming Nancy 1986 Comrades Mrs. Carlyle 1986 Peter the Great Sophia Nominated – Primetime Emmy Award for Outstanding Supporting Actress – Miniseries or a Movie 1986 Second Serve Richard Radley / Renee Richards 1987 Prick Up Your Ears Peggy Ramsay 1988 Consuming Passions Mrs. Garza 1988 Lady Alice More Nominated – Golden Globe Award for Best Actress – Miniseries or Television Film 1990 Romeo.Juliet Mother Capulet 1990 Breath of Life Sister Crucifix 1990 Pokhorony Stalina English journalist 1990 Orpheus Descending Lady Torrance Television film 1991 Miss Amelia 1991 Young Catherine Empress Elizabeth Nominated – Primetime Emmy Award for Outstanding Supporting Actress – Miniseries or a Movie 1991 What Ever Happened to Baby Jane? Blanche Hudson Television film 1992 Howards End Ruth Wilcox Nominated – Academy Award for Best Supporting Actress 1993 Kate Benson 1993 Nivea del Valle 1993 Sparrow Sister Agata 1993 Great Moments in Aviation Dr. Angela Bead 1993 They Florence Latimer 1994 Mother's Boys Lydia Madigan 1994 Little Odessa Irina Shapira Volpi Cup 1995 Miss Bentley Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy 1995 The Wind in the Willows Narrator Television Film 1996 Mission: Impossible Max 1996 Two Mothers for Zachary Nancy Shaffell Television film 1997 Smilla's Sense of Snow Elsa Lubing 1997 Wilde Lady Speranza Wilde 1997 Mrs. Dalloway Mrs. Clarissa Dalloway 1997 Déjà Vu Skelly 1997 Bella Mafia Graziella Luciano Nominated – Golden Globe Award for Best Actress – Miniseries or Television Film 1998 Deep Impact Robin Lerner 1998 Lulu on the Bridge Catherine Moore 1999 Cradle Will Rock Countess Constance LaGrange 1999 Uninvited Mrs. Ruttenburn 1999 Girl, Interrupted Dr. Sonia Wick 2000 If These Walls Could Talk 2 Edith Tress (segment \"1961\") 2000 Mirka Kalsan 2000 Maddy Bennett 2001 Annalise Hansen 2001 Jack and the Beanstalk: The Real Story Countess Wilhelmina/Narrator 2002 Clementine Churchill Television film 2002 Crime and Punishment Rodian's Mother 2002 Searching for Debra Winger Herself Documentary 2002 Esther Huish Television film 2003 Byron Lady Melbourne Television film 2003 Good Boy! 2004 Woman Also Executive Producer Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie 2004–2009 Nip/Tuck Dr. Erica Noughton Television series; 10 episodes 2005 2005 Short Order Marianne 2005 Vera Belinskya 2006 Sister Antonia 2006 Venus Valerie Nominated – British Independent Film Award for Best Supporting Actress 2006 Penelope Keeling Television film 2007 Roberta Elliot 2007 How About You Georgia Platts 2007 Evening Ann Lord 2007 Atonement Older Briony Tallis 2008 Restraint Sky News Reader 2008 Ein Job Hannah Silbergrau Television film 2008 Gud, lukt och henne 2009 Eva Eva 2009 Durrant Television miniseries 2010 Letters to Juliet Claire Smith-Wyman 2010 Madeleine Rees 2010 Miral Bertha Spafford 2010 Animals United Winnie Voice Only (English Version) 2011 Coriolanus Volumnia 2011 Cars 2 Mama Topolino/Queen Voice Only 2011 Anonymous Queen Elizabeth I 2012 Song for Marion Marion FilmingGemma Arterton, Vanessa Redgrave to star in Williams' Song For Marion Screen Daily. 8 July 2011 == Reference == * The Illustrated Who's Who of the Cinema, Lloyd, Fuller & Desser, Portland House, New York, 1987. Category:1937 births Category:Living people Category:English Academy Award winning actors Category:Actors from London Category:BAFTA Award winning actors Category:Drama Desk Award winners Category:Emmy Award winning actors Category:English activists Category:English movie actors Category:English stage actors Category:English television actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Tony Award winning actors Category:People from Greenwich",
 "title": "Vanessa Redgrave"
}