{
 "id": "21551",
 "text": "Harvard University is a private university in Cambridge, Massachusetts, and a member of the Ivy League. Harvard was started on September 8, 1636, and it is the oldest university in the United States. Harvard's current president is Lawrence Bacow. The school color is crimson, which is a dark red color. Harvard used slaves to serve its leaders and students, and the merchants who used their money to start the school used slaves too. Also, “Harvard students slept in beds and ate meals prepared by slaves, and many grew up to be prominent slave-holders in early America.\" In the 20th century, the university invested millions of dollars in apartheid South Africa. Harvard is on the Charles River. Some students go to the Charles River for rowing. On the other side of the Charles River is the city of Boston. Boston's subway system has a stop at Harvard. Some of Harvard's graduate schools are in Boston, but most of Harvard's schools are in Cambridge. Together, these schools are Harvard University. Harvard has many libraries like Widener Library. There are other facilities like skating rinks and the Malkin Athletic Center where students can swim and exercise. Harvard is almost always ranked as one of the best universities in the world. Another famous school close to Harvard in Cambridge, Massachusetts is the Massachusetts Institute of Technology (MIT). Eight Presidents of the United States have graduated from Harvard. Harvard has over $40 billion. There have been 161 Nobel Laureates from Harvard University. ==Notable alumni== * John Adams, 2nd President of the United States * George W. Bush, 43rd President of the United States * Bill Gates, Founder of Microsoft * Al Gore, 45th Vice President of the United States * John F. Kennedy, 35th President of the United States * Franklin Delano Roosevelt, 32nd President of the United States * Theodore Roosevelt, 26th President of the United States * Natalie Portman, Actress & filmmaker * Mark Zuckerberg, Founder & CEO of Facebook *Barack Obama, 44th President of the United States == References == Category:Association of American Universities Category:Collegiate Water Polo Association Category:ECAC Hockey Category:Ivy League Category:Cambridge, Massachusetts Category:1636 establishments Category:1630s establishments in Massachusetts",
 "title": "Harvard University"
}