{
 "id": "215793",
 "text": "George Gaylord Simpson (16 June 1902 – 6 October 1984) was an American paleontologist. Simpson was perhaps the most influential paleontologist of the twentieth century, and a major participant in the modern evolutionary synthesis.Simpson G.G. 1944. Tempo and mode in evolution. Columbia, N.Y.Simpson G.G. 1953. The major features of evolution. Columbia, N.Y. He was an expert on extinct mammals and their migrations, especially the Great American Interchange between the Americas.Simpson G.G. 1940. Mammals and land bridges. Journal of the Washington Academy of Sciences 30: 137163. See Charles H. Smith's website for full text. Simpson opposed Alfred Wegener's theory of continental drift, so his work on animal migration lacked this idea.Simpson G.G. 1953. Evolution and geography: an essay on historical biogeography with special reference to mammals. Oregon State System of Higher Education, Eugene, Oregon. Simpson dispelled the myth that the evolution of the horse was a linear process culminating in the modern Equus caballus. He coined the word hypodigm in 1940,A sample from which the characters of a population are to be inferred. and published extensively on the taxonomy of fossil and living mammals.Simpson G.G. 1940. Types in modern taxonomy. American Journal of Science 238, p418 == Biography == Born in Chicago, Illinois, Simpson was raised mostly in Denver, Colorado. He got his degrees from Yale University in 1923 and 1926. His dissertation, American Mesozoic Mammalia (1929), was the first step in his lifelong interest in the evolution of mammals. After a post- doctoral year at the British Natural History Museum, Simpson returned in 1927 to take up a post in the American Museum of Natural History. In 1942, Simpson enlisted in the U.S. Army. He served as a Captain, then Major, in Army intelligence, Simpson served with American forces in North Africa and western Europe until 1944. Then he resigned, suffering from a severe bout of hepatitis. He returned home, with two Bronze Stars. He was promoted to Curator (head) of the Department of Geology and Paleontology at the American Museum of Natural History. He also held a post as Professor of Zoology at Columbia University (19451959). He took up his work on early mammals, and worked on the Palaeocene and Eocene faunas of the San Juan Basin, New Mexico.George Gaylord Simpson Papers, American Philosophical Society. Background. He was Curator of the Museum of Comparative Zoology at Harvard University from 1959 to 1970, and a Professor of Geosciences at the University of Arizona until his retirement in 1982. == Major works and awards == In the 1940s Simpson produced three major works. Tempo and mode in evolution (1944), Principles of classification and a classification of mammals (1945) and The meaning of evolution (1949). Simpson provided a popular account of modern evolutionary theory with emphasis on evidence from the fossil record. Simpson was awarded the Linnean Society's Darwin-Wallace Medal in 1958. He also received the Royal Society's Darwin Medal \"In recognition of his distinguished contributions to general evolutionary theory, based on a profound study of palaeontology, particularly of vertebrates\" in 1962. He was awarded the U.S. National Medal of Science in 1965. == Quotes == These quotations from Simpson give a good idea of the man: :\"Man is the result of a purposeless and natural process that did not have him in mind\".Simpson G.G. 1967. The meaning of evolution, revised ed. New Haven: Yale University Press. p345 :\"I don't think that evolution is supremely important because it is my specialty; it is my specialty because I think it is supremely important\". == Books == * Attending marvels (1931) * Tempo and mode in evolution (1944) * The meaning of evolution (1949) * Horses (1951) * Evolution and geography (1953) * The major features of evolution (1953) * Life: an introduction to biology (1957) * Principles of animal taxonomy (1961) * This view of life (1964) * The geography of evolution (1965) * Penguins (1976) * Concession to the improbable (1978) (an autobiography) * Splendid isolation (1980) * The Dechronization of Sam Magruder (posthumously published novella, 1996) == References == * * * * == Other websites == *George Gaylord Simpson — full and comprehensive biography by L. F. Laporte *George Gaylord Simpson — biographical sketch from The Stephen Jay Gould Archive *George Gaylord Simpson — a short biography from the PBS Evolution website *George Gaylord Simpson Papers, American Philosophical Society. Category:1902 births Category:1984 deaths Category:Harvard University faculty Category:American autobiographers Category:American evolutionary biologists Category:American geologists Category:American military personnel of World War II Category:American paleontologists Category:Foreign Members of the Royal Society Category:Majors in the United States Army Category:Scientists from Chicago Category:Yale University alumni Category:Educators from Chicago Category:Military people from Chicago",
 "title": "George Gaylord Simpson"
}