{
 "id": "21581",
 "text": "West Bengal ( ; Bengali: পশ্চিমবঙ্গ, romanised: Paścimbaṅga, ) is a state in India. It is in the eastern part of the country. It is along the Bay of Bengal. Its area is . Its population was about 91 million in 2011. It became about 103 million in 2023. West Bengal is the fourth-largest state in India by population. It is the thirteenth-largest state in India by area. It is also the eighth-largest administrative division of the world. Both West Bengal and Bangladesh are parts of the region of Bengal. Bangladesh is a country east of West Bengal. Nepal and Bhutan are two countries north of the Indian state. Bihar and Jharkhand are two Indian states west of West Bengal. Odisha is another Indian state southwest of West Bengal. Sikkim is an Indian state north of West Bengal. Assam is an Indian state east of West Bengal. Kolkata is the capital city of West Bengal. Kolkata is the third-largest metropolis and seventh-largest city by population. West Bengal is divided into some regions, for example the Darjeeling Hills, the Ganges Delta, the Rarh region, the Sundarbans and the Bay of Bengal. West Bengal has a tropical climate, so it is very hot and humid in summer and cool in winter. The people who live here are called Bengalis. Bengalis also live in Bangladesh. ==History== The British Empire once ruled most of the Indian subcontinent. The Indians wanted freedom, but the Hindus and the Muslims of India always argued. So it was decided to divide the country into two parts—one part for Muslims and the other part for Hindus. In 1947 Bengal, which was a province of India, was divided into West Bengal and East Bengal,which is now called Bangladesh. West Bengal went to India, and East Bengal went to Pakistan and was called East Pakistan. In 1971, Bangladesh became independent, as a result of the Bangladesh Liberation War. ==Geography== West Bengal is on the eastern part of India. It stretches from the Himalayas in the north to the Bay of Bengal in the south. Its total area is . The Darjeeling Hills is the most northern region of West Bengal. It is a part of the eastern Himalayas. Sandakphu is the highest peak in the state. It is a part of the Darjeeling Hills. Its height is . The Terai is a narrow region between the hills and the North Bengal plains. The Ganges Delta is the most southern region of the state. The Rarh region is between the Ganges Delta in the east and the Chota Nagpur Plateau in the west. There is a coastal region south of the state. The Sundarbans is a mangrove forest at the Ganges Delta. It forms a geographical landmark of the region. The Ganges is the main river of West Bengal. It divides into two branches called distributaries. One branch enters Bangladesh as the Padma River. Another branch flows through West Bengal as the Hooghly River. The Farakka Barrage is a barrage over the Ganges. A canal from the Ganges gives water to the Hooghly branch of the river. There is a dispute between India and Bangladesh on sharing the water of the Ganges for a long time. There are some rivers from the northern region, for example the Teesta, Torsa, Jaldhaka and Mahananda rivers. There are also rivers from the Chota Nagpur Plateau, for example the Damodar, Ajay and Kangsabati. The Ganges Delta has more rivers and creeks. The Ganges River becoms polluted because people throw waste into the Ganges River. It is a main problem in West Bengal. The Damodar River is a tributary—a river meeting with another river—of the Ganges. It was once known as the \"Sorrow of Bengal\" because there were frequent floods on the valley. The river has several dams under the Damodar Valley Project. There amount of arsenic in the groundwaters of at least nine districts of West Bengal is very high. As of 2017, about 10.4 million people were poisoned by arsenic. ==Politics== The Government of West Bengal is a parliamentary system of representative democracy. The same type of government is also found in other Indian states. The residents are given universal suffrage. There are three branches of government: the legislature, the executive and the judiciary. The West Bengal Legislative Assembly is the legislature of the state. It has 295 elected members, the Speaker and the Deputy Speaker. The members are called MLAs. One of the elected members is from the Anglo-Indian community. The MLAs elect Speaker and the Deputy Speaker. The Speaker preside over the assembly meetings. The Deputy Speaker would preside over the assembly meetings in the absence of the Speaker. The Council of Ministers is the executive branch of West Bengal. The Governor is the head of state. The President of India appoints the Governor. The Chief Minister is the head of government. The Governor appoints the leader of the political party or coalition with a majority in the Legislative Assembly. The Chief Minister gives an advice to the Governor to appoint the Council of Ministers. The Governor do so. The Council of Ministers reports to the Legislative Assembly. The people of the government run the office for five years unless the Assembly is dissolved before this period. There are 42 seats to the Lok Sabha and 16 seats to the Rajya Sabha of the Parliament of India in West Bengal. The Calcutta High Court and other lower courts are the judiciary of West Bengal. The All India Trinamool Congress (AITC), Bharatiya Janata Party (BJP), Indian National Congress (INC) and the Left Front political alliance have controlled the politics of West Bengal. The Communist Party of India (Marxist) (CPI(M)) leads the Left Front. In the 2011 West Bengal state assembly election, people elected the coalition of the All India Trinamool Congress and the Indian National Congress to power. Mamata Banerjee was the leader of the coalition. The coalition won 225 seats of the Assembly. The Left Front had ruled the state for 34 years (1977–2011) before the election. It was the world's longest-running democratically elected communist government. ==Districts and cities== === Districts === West Bengal is divided into 23 districts. District Population Growth rate Sex ratio Literacy Density per square Kilometer North 24 Parganas 10,009,781 12.04 955 84.06 2445 South 24 Parganas 8,161,961 18.17 956 77.51 819 Purba Bardhaman 4,835,432 945 74.73 890 Paschim Bardhaman 2,882,031 922 78.75 1800 Murshidabad 7,103,807 21.09 958 66.59 1334 Paschim Medinipur 5,913,457 13.86 966 78.00 631 Hooghly 5,519,145 9.46 961 81.80 1753 Nadia 5,167,600 12.22 947 74.97 1316 Purba Medinipur 5,095,875 15.36 938 87.02 1081 Howrah 4,850,029 13.50 939 83.31 3306 Kolkata 4,496,694 −1.67 908 86.31 24306 Malda 3,988,845 21.22 944 61.73 1069 Jalpaiguri 3,872,846 13.87 953 73.25 622 Alipurduar 1,700,000 400 Bankura 3,596,292 12.64 954 70.95 523 Birbhum 3,502,404 16.15 956 70.68 771 Uttar Dinajpur 3,007,134 23.15 939 59.07 958 Purulia 2,930,115 15.52 957 64.48 468 Cooch Behar 2,819,086 13.71 942 74.78 832 Darjeeling 1,846,823 14.77 970 79.56 586 Dakshin Dinajpur 1,676,276 11.52 956 72.82 755 Kalimpong 202,239 270 Jhargram 1,136,548 374 A district collector or district magistrate rule over a district. The Indian Administrative Service or the West Bengal Civil Service appoints them. Each district is divided into subdivisions. A subdivisional magistrate rule over a subdivision. The subdivisions are divided into blocks. Blocks are divided into panchayats (village councils) and municipalities. ===Cities=== Kolkata is the capital city of West Bengal. It is also the largest city of the state. Kolkata is the third-largest urban agglomeration in India. It is also the seventh-largest city in India. Asansol is the second- largest urban agglomeration in West Bengal. West Bengal has some planned cities, for example Bidhannagar, Durgapur, Haldia, Kalyani, Kharagpur and New Town. Siliguri is an economically important city. It is in the Siliguri Corridor of India. Howrah, Chandannagar, Bardhaman, Berhampore, Jalpaiguri and Purulia are some other large cities in West Bengal. ==Transport== As of 2011, the total length of surface roads in West Bengal was more than . The total length of national highways was . The total length of state highways was . As of 2006, the road density of the state was . It is higher than the average road density of in India. As of 2011, the total length of railways in West Bengal was about . Kolkata is the headquarters of three zones of the Indian Railways—Eastern Railway (ER), South Eastern Railway (SER) and Kolkata Metro. Kolkata Metro is India's first underground railway. Northeast Frontier Railway (NFR) covers northern West Bengal. The Darjeeling Himalayan Railway is a UNESCO World Heritage Site. It is a part of the NFR. Netaji Subhas Chandra Bose International Airport is an airport at Dum Dum, near Kolkata. It is the largest airport in West Bengal. Bagdogra Airport near Siliguri is a customs airport. It offers regular domestic service. It has international service to Bhutan and Thailand. Kazi Nazrul Islam Airport is a domestic airport at Andal, near Durgapur. It is India's first private sector airport. Kolkata is a major river port in East India. The Syama Prasad Mookerjee Port Trust looks after Kolkata and Haldia docks. There is a passenger service to Port Blair on the Andaman and Nicobar Islands. Ferries are a main form of transport in southern West Bengal. It is more common in the Sundarbans. The West Bengal Government own some organisations that run buses, for example the North Bengal State Transport Corporation (NBSTC), the South Bengal State Transport Corporation (SBSTC) and the West Bengal Transport Corporation (WBTC). There are also private bus companies. There are some hired forms of transport, for example metered taxis and auto-rickshaws. They sometimes have their own routes in cities. In most of West Bengal, cycle rickshaws are used to travel short distances. In Kolkata, hand-pulled rickshaws and electric rickshaws are used it. Kolkata is the only city in India to have trams as a form of transport. The West Bengal Transport Corporation (WBTC) runs these trams since 2016. ==Demographics== From the provisional results of the 2011 national census, West Bengal is the fourth-largest state in India by population. Its population is 91,347,736. It is 7.55% of India's population. The state's rate of population growth in ten years from 2001 to 2011 was 13.93%. It is lower than the growth rate of 17.8% from 1991 to 2001. It is also lower than India's population growth rate of 17.64%. The state's gender ratio is 947 females per 1,000 males. West Bengal's population density was in 2011. So, it the second- largest state in India by population density. West Bengal's literacy rate is 77.08%. It is higher than India's rate of 74.04%. From 2010 to 2014, we can see that the life expectancy in the state was 70.2 years. It is higher than India's life expectancy of 67.9. In 2013, the percentage of people living below the poverty line was 19.98%. It is lower than the percentage of 31.8% ten years ago. In rural areas, 28.6% of people were Scheduled Castes and 5.8% of people were Scheduled Tribes. In urban areas, 19.9% of people were Scheduled Castes and 1.5% of people were Scheduled Tribes. In September 2017, some far-away villages in the Sundarbans of West Bengal became the last villages to get electricity. So, West Bengal became completely electrified. Bengali people are the largest ethnic group (group of people with same culture) of West Bengal. Most people of the state are Bengalis. Bengali people also live in Bangladesh. The Bengali people are divided into Bengali Hindus, Bengali Muslims, Bengali Christians and some Bengali Buddhists. There are also Marwari, Maithili and Bhojpuri people spread across the state. Buddhist communities, for example Sherpas, Bhutias, Lepchas, Tamangs, Yolmos and Tibetans live in the Darjeeling Hills. === Languages === Bengali and English are two official languages of West Bengal.— — — — — — Nepali is an additional official language in Darjeeling Sadar, Kurseong and Kalimpong subdivisions. In 2012, the state government passed a bill of law. It gave additional official status to Hindi, Odia, Punjabi, Santali and Urdu in areas where more than 10% of people speak one of those languages. In 2019, the government passed another bill. It gave additional official status to Kamtapuri, Kurmali and Rajbanshi as additional official languages in blocks, divisions or districts where more than 10% of people speak one of those languages. From the 2011 census, 86.22% of people spoke Bengali, 5.00% of people spoke Hindi, 2.66% of people spoke Santali, 1.82% of people spoke Urdu and 1.26% of people spoke Nepali as their first language. ==Culture== === Literature === The Bengali language has a rich heritage in literature. The Charyapada is one of the oldest literature in Bengali. It is a collection of Buddhist mystic songs. The songs were sung in the 10th and 11thcenturies. The Mangalkavya is a collection of Hindu narrative poetry. It was written about the 13thcentury. ==People== Famous people from West Bengal include: *Swami Vivekananda *Rabindranath Tagore *Subhas Chandra Bose *Satyendranath Bose *Surendranath Banerjee *Jagadish Chandra Bose *Ishwar Chandra Vidyasagar *Ramakrishna *Shibdas Bhaduri *Khudiram Bose *Syama Prasad Mukherjee *Kadambini Ganguly *Satyajit Ray *Ritwik Ghatak *Pradeep Kumar Banerjee *Victor Banerjee *Kishore Kumar *Biswajit Chatterjee *Bappi Lahiri *Michael Madhusudan Dutt *Rahul Dev Burman *Sourav Ganguly *Pranab Mukherjee *Uttam Kumar *Suchitra Sen *Sushmita Sen *Shreya Ghosal *Arijit Singh *Mithun Chakraborty *The Dhar-Sircar family ==References== ==Other websites== Category:States of India Category:Bay of Bengal",
 "title": "West Bengal"
}