{
 "id": "215915",
 "text": "George Ledyard Stebbins, Jr (6 January 1906 – 19 January 2000) was an American botanist and geneticist. He was one of the leading evolutionary biologists of the 20th century.Yoon C.K. January 21 2000. Ledyard Stebbins, 94, dies; applied evolution to plants. New York Times, Section B, Page 9 Stebbins received his PhD in botany from Harvard University in 1931. He went on to the University of California, Berkeley, where his work led to a synthesis of plant evolution and genetics. His most important publication was Variation and evolution in plants, which combined genetics and Darwin's theory of natural selection to describe plant speciation. It helped form the modern evolutionary synthesis, and still provides the framework for research in plant evolutionary biology. According to Ernst Mayr, \"Few later works dealing with the evolutionary systematics of plants have not been very deeply affected by Stebbins' work\".Mayr, Ernst. 1988. \"Botany: Introduction\" in The evolutionary synthesis: perspectives on the unification of biology, Ernst Mayr and William Provine, editors. Cambridge, Massachusetts: Harvard University Press. p138. :\"More than anything else, it was Stebbins' book, Variation and evolution in plants, that brought botany into the synthesis. It had the same impact in botany as Dobzhansky's book in population genetics, integrating the widely scattered literature of plant evolution and providing abundant suggestions for further research\". He also researched and wrote widely on the role of hybridization and polyploidy in speciation and plant evolution; his work in this area has had a lasting influence on research in the field. Stebbins was elected to the National Academy of Science, was awarded the National Medal of Science. He was involved in the development of evolution-based science programs for California high schools, as well as the conservation of rare plants in that state. == UC Berkeley == In 1935, Stebbins was offered a genetics research position at the University of California, Berkeley working with geneticist E.B. Babcock. Babcock needed assistance with a large Rockefeller-funded project on the genetics and evolution of plants from the genus Crepis. Crepis commonly hybridized, displayed polyploidy, and could make seed without fertilization (a process known as apomixis). The collaboration between Babcock and Stebbins produced numerous papers and two monographs. Stebbins's review, The significance of polyploidy in plant evolution, showed how polyploidy was important in developing large, complex, and widespread genera. By looking at the history of polyploidy in plant families, he argued that polyploidy was only common in herbaceous perennials, but infrequent in woody plants and annuals. As such, polyploids played a conservative role in evolution since problems with fertility prevented the replication of new genetic material that might lead to a new line of evolution.Stebbins G.L. 1940. The significance of polyploidy in plant evolution. The American Naturalist 74:54–66 This work continued with the 1947 paper Types of polyploids: their classification and significance, which described Stebbins' ideas about the role of paleopolyploidy in angiosperm evolution. He argued that chromosome number may be a useful tool for the construction of phylogenies.Stebbins G.L. 1947. Types of polyploids: their classification and significance. Advances in Genetics. 1:403–429 These reviews were highly influential and helped others study the role of polyploidy in evolution. In 1939, with Babcock's support, Stebbins was made a full professor in the Department of Genetics at UC Berkeley, after the Department of Botany failed to promote him. Stebbins taught a course on evolution. During his preparation he became excited by research combining genetics and evolution. Stebbins directed his research towards evolution. He became involved with the Society for the Study of Evolution in 1946, and was one of the few botanists in the new organization. He worked on the genetics of grass grown for grazing, looking at polyploidy and the evolution of the Poaceae (grass family). He produced an artificial autotetraploid grass from the diploid species Ehrharta erecta by treatment with the chromosome doubling agent colchicine. He was able to establish the plant in the field, and after 39 years of field trials found that the tetraploid was not as successful as its diploid parent in an unchanging environment.Stebbins G.L. 1985. Polyploidy, hybridization, and the invasion of new habitats. Annals of the Missouri Botanical Garden 72:824–832 == Books == *Variation and evolution in plants (1950) *Processes of organic evolution (1966) *The basis of progressive evolution (1969) *Chromosomal evolution in higher lants (1971) *Flowering plants: evolution above the species level (1974) *Evolution, with Dobzhansky, Ayala and Valentine (1977) == References == Category:1906 births Category:2000 deaths Category:American botanists Category:American geneticists Category:American evolutionary biologists Category:Scientists from New York (state)",
 "title": "G. Ledyard Stebbins"
}