{
 "id": "215955",
 "text": "An atomic clock is a clock that works with energy level of atoms, as opposed to most other clocks which are mechanical. The frequency comes from the crossing radiation of electrons. Atomic clocks are currently the most exact clocks of the world. They are also called primary clocks. Most clocks know the time because they count how many times something moves back and forth. Atomic clocks count how many times an atom wiggles back and forth. == Variants == There are several variants of atomic clocks, the most important being beam clocks, fountain clocks, and optical clocks. === Beam Clocks === Beam clocks are the most common kind of atomic clocks. They are also the least exact, but they are still very exact compared to most normal clocks like quartz clocks or mechanical clocks. ==== Timekeeping Atoms ==== The most commonly used atom for atomic clocks is Caesium. Specifically Caesium-133, because when you put Caesium-133 in a beam of microwaves, the atom wiggles very fast, and keeps wiggling at that speed for a long time. The atoms wiggling very fast means that it can keep time very well. ==== Tuning ==== The Caesium-133 atoms have a resonant frequency, which is the speed that they wiggle at. When the beam of microwaves has the same frequency as the resonance frequency of the Caesium atoms, then they will all start wiggling. To get the microwave beam to the resonance frequency, the Caesium atoms are hit by the microwaves, and then measured with a laser or another microwave beam to see how many of the atoms are wiggling. The more of the atoms that are wiggling, the closer to the resonant frequency the microwave beam is at. Once the machine gets as many atoms wiggling as possible, it stops the tuning and starts the timekeeping. ==== Measurement ==== Once all the atoms are wiggling, the microwave beam that was used to tune the clock is deactivated, and the atoms are cycled through the measurement laser or microwave beam, and the number of times that the atoms wiggle is counted. Once the number of times the atoms have wiggled reaches the resonant frequency of the atoms (which for Caesium-133 is 9,192,631,770 times per second), the counter is reset and the time is increased by one second. === Fountain Clocks === Fountain clocks are very similar to Beam clocks, but are much more precise and keep the atoms in the beam for longer. ==== Design ==== Fountain clocks use roughly the same tuning process, but once the tuning is done it deviates from beam clocks. Six (6) lasers are turned on, and the light pushes the atoms in the direction opposite to the way they're moving. This causes the atoms to slow down and cool, and they begin to group together. This allows for much more exact measurement because the atoms are not moving nearly as much, so it's easier to count how many times the atom has wiggled. A Caesium-133 atom moves at roughly 130 m/s (290.8 mph) (468 kph) at room temperature. This means that it's very difficult to count how many times the atom wiggled while it was in the beam. Cooling down the atoms with lasers makes the atoms much slower, keeping them in the beam for longer, and making it easier to count how many times they wiggled. ==== Accuracy ==== Fountain clocks tend to be exact to within one second in fifty (50) million years, with the best ones exact to within one second in 100 million years. However, the exactness does come at the cost of not being able to have them always running, and being expensive. ==== Use ==== Fountain clocks can't be run all the time, so they can't be used for International Atomic Time and are mostly used instead to correct beam clocks. === Optical Clocks === Optical clocks use elements with a very high resonant frequency, such as aluminium, but other elements have been used. They are called optical clocks because the resonant frequency of the element that it uses is within the visible light spectrum, or very close to it. ==== Design ==== Some optical clocks keep the atom(s) in place using a similar method to fountain clocks, but rather than just slowing the atoms down, it uses the lasers to hold the atom(s) in one place to make them easier to measure. However, some optical clocks use atoms that have been ionized, these are called ions, and unlike most atoms which aren't pushed around by electric fields, ions are. Machines can be used to make electric fields, where they're placed very carefully to push the ions into one place. ==== Tuning ==== The tuning of optical clocks is mostly the same as with beam clocks and fountain clocks, with the only important difference being that while fountain clocks and beam clocks use microwaves to make the atoms wiggle, an optical clocks uses visible light to make the atoms wiggle. ==== Accuracy ==== Optical clocks are the most exact clocks (atomic or not) in the world. Even the earliest optical clocks are four (4) times more exact than the best fountain clocks today. The best optical clocks today are 100 times more exact than the best fountain clocks, but they are still new and are still improving. ==== Potential To Redefine The Second ==== NIST has been contributing to the research and development of optical clocks for a long time, and are doing so in the hopes that they can get the definition of the second (as defined by the SI) to instead be based off optical clocks because of their much higher frequency allowing for clocks to be more exact. The SI is considering doing so, but it would need a big effort to change such an important unit. When the SI changes the definition of a unit of measurement, they only do so after meeting and deciding on how they can change it so that everyone can switch to the new definition. This includes agreeing on a specific method, machine, process, materials, and more. However with optical clocks being 100 times more exact than the best fountain clocks, it is likely that this change could happen soon. == Uses == Atomic clocks have many uses, but are most often used in areas that require high precision like GPS, satellite communications, the internet, and scientific research. They also are used as a baseline from which all other clocks are set. For example, an atomic clock is what you reference when you set the time for a wall clock. Although atomic clocks are usually referenced indirectly as updates are sent out several times per day to satellites, computers, etc. to bring them back in line with the atomic clocks. Worldwide, there are over 260 atomic clocks at over 60 different places. All data is collected at the International Bureau of Weights and Measures in Paris, France. The International Atomic Time is calculated there. == History == The basics were developed by Isidor Isaac Rabi. He was an American physicist at Columbia University. He got the Nobel Prize in Physics in 1944. ==References== Category:Clocks",
 "title": "Atomic clock"
}