{
 "id": "216128",
 "text": "The Second Epistle of John is the sixty-third book in the Christian Bible, and the twenty-fourth in the New Testament. This book is believed to a short letter from John. In number of verses, it is the shortest book in the bible. There is some disagreement over whether the John who wrote the letters of John, the John who wrote The Gospel of John, and the John who wrote the Book of Revelation are the same person. ==To whom it is written== The letter is sent to \"the elect lady and her children\" (some bibles translate this phrase as \"elder lady and her children\"), and closes with the words, \"The children of your chosen sister greet you.\" The lady has often been seen as a picture of the church, the church being the body of Christians as a whole and as local congregations. It is also possible the letter was sent to a real lady who John knew, and the children are real children, not members of the church. ==What is written== What this letter says is similar to the Third Epistle of John. The traditional view is that all the letters are by the hand of John the Apostle, and the language and words used and arguments made all seem to support this idea.John Painter, 1, 2, and 3 John (Sacra Pagina), Volume 18 of Sacra Pagina, Liturgical Press, 2008. pp. 57–59 The letter also warns against people who say that Jesus was not a flesh-and-blood figure: \"For many deceivers are entered into the world, who say that Jesus Christ has not come in the flesh.\" This shows that, from the time the epistle was first written, there were those who had docetic ideas about Jesus, believing that the human person of Jesus was really a pure spirit or did not come at all.James Leslie Houlden, Johannine epistles, Black's New Testament commentaries, Edition 2, Continuum International Publishing Group, 1994. pp. 139–40 John says that these people are deceivers and even calls them Antichrist that is against Christ. He says Christians should not receive such people. == References == == Other websites == *II John (NIV) *I John (KJV) Category:New Testament books Category:General Epistles",
 "title": "Second Epistle of John"
}