{
 "id": "21616",
 "text": "The Nintendo 64 (commonly abbreviated N64) was the third home video game console released by Nintendo. It was first released in Japan in June 1996 and was meant to compete against the Sony PlayStation and the Sega Saturn. It was named after its 64-bit CPU, one of the first in a consumer product. The Nintendo 64 was Nintendo's first console made for 3D graphics. It uses plastic cartridges instead of CDs or disks, making load times faster. Because of this, the games cost more to make. The controller for the Nintendo 64 was shaped like an \"M\" and had 10 buttons and a joystick. Sony used the N64 joystick design to make their DualShock PlayStation controller. Out of the box, the Nintendo 64 had 4 MB of RAM, and it could be upgraded to 8 MB with the expansion pak. Because making games for the Nintendo 64 was more expensive than making games for the PlayStation, many video game companies chose to develop for the PlayStation instead. Nintendo also did not like games that had a lot of blood or violence in them. Companies who made these kinds of games made them for the PlayStation instead. However, some game makers did make some violent games for the Nintendo 64, such as Rare's first-person shooter Perfect Dark. Nintendo ended up losing their first place spot in the video game market and Sony beat them because of these two things. The production of the system ended in Japan in 2002 and in 2003 worldwide as the GameCube launched. ==Background== In 1990, Nintendo released the Super Nintendo Entertainment System, also known as the SNES in Japan, and 1991 in North America. It was a 16-bit console. It mostly still played 2D games, and any 3D games it played weren't true 3D. However, just two years later, in 1993, Atari released a system called the Jaguar. It was 64 bits, a very big improvement, and it made Nintendo and Sega look outdated. While the Jaguar didn't sell well, the message was still clear. To make matters worse, Sony was working on a new system to launch in 1994 that would be known as the PlayStation. The SNES, even though it didn't sell as well as the original NES, still sold extremely well. By the mid 1990s, though, Nintendo knew it was time to move on and create their own 64 bit system. Its name in development was called Project Reality. == Reception == In 2015, IGN named the Nintendo 64 the ninth-greatest video game console of all time. Many great games were released on the system, with many video game series first appearing on the N64. These series included Super Smash Bros., Paper Mario, and Mario Party. It also had the first mario game in 3D, which was Super Mario 64. === Sales === 5.54 million Nintendo 64 units were sold in Japan, 20.63 million in the Americas, and 6.75 million in other regions, a total of 32.93 million units. ==Notable games== *1080° Snowboarding *Banjo-Kazooie *Banjo-Tooie *Cruis'n USA *Diddy Kong Racing *Donkey Kong 64 *Excitebike 64 *F-1 World Grand Prix *F-Zero X *GoldenEye 007 *Hey You, Pikachu! *Kirby 64: The Crystal Shards *Mario Golf *Mario Kart 64 *Mario Party *Mario Party 2 *Mario Party 3 *Mario Tennis *Paper Mario *Perfect Dark *Pokémon Snap *Pokémon Stadium *Pokémon Stadium 2 *Star Fox 64 *Star Wars Episode I: Racer *Star Wars: Rogue Squadron *Star Wars: Shadows of the Empire *Super Mario 64 *Super Smash Bros. *The Legend of Zelda: Majora's Mask *The Legend of Zelda: Ocarina of Time *The New Tetris *Tony Hawk's Pro Skater *Turok: Dinosaur Hunter *Wave Race 64 *WCW/nWo Revenge *Yoshi's Story ==References== Category:Nintendo video game consoles",
 "title": "Nintendo 64"
}