{
 "id": "21613",
 "text": "Hyderabad (pronounced ( )) is the largest city and capital of the state of Telangana. At over 12.2 million, it has the largest population of any city in the statehttp://www.censusindia.gov.in/2011-prov- results/paper2/data_files/India2/Table_2_PR_Cities_1Lakh_and_Above.pdf Hyderabad is an A-1 city under the terms of development priorities. It is also known as city of pearls or city of Nizams. The people of Hyderabad are called Hyderabadis. Hyderabad was founded in 1591 AD by Sultan Muhammad Quli Qutb Shah on the banks of river Musi. It was later ruled by the Mughal governor Nizam Asaf Jah I who then founded the Asaf Jahi Dynasty (Also known as The Nizams). There were a total of 10 Nizams with the last one being Osman Ali Khan, Asaf Jah VII. The city is home to the Ramoji Film City which spans an area of over . The movieindustry here is called The Hyderabad Deccan Urdu film industry (also known as Deccanwood). == History == Archaeologists have found Iron Age sites in Hyderabad that are 2,500 years old. These sites have been found near Haythnagar and Ramoji Film City, and have burials and tools. The Qutub Shahi kings ruled Hyderabad till 1687 when the city was taken over by the Mughals. Muhammad Quli Qutub Shah was a Qutub Shahi ruler who ordered the construction of the Charminar as a mosque. Nawab Abdul Hassan Shah who is popularly known as Tanisha was the last Qutub Shahi ruler of Hyderabad before Aurangzeb captured it in 1687. Asaf Jah was declared the governor of Hyderabad by Aurangzeb. This is how the Asaf Jahi Dynasty began which ruled Hyderabad till 1948. Hyderabad became a princely state in 1947 after the collaboration with India. But soon the Nizam had to sign an Instrument of Accession to the Union of India so that Hyderabad becomes a part of India. On 1 November 1956, the province of Hyderabad was divided into Karnataka, Maharashtra and Andhra Pradesh on the basis of language. So, Hyderabad came into the Telugu speaking community and thus became the capital of Andhra Pradesh. The state of Telangana was formed on 2 June 2014 and separated from Andhra Pradesh retaining Hyderabad as it's capital. The city has now developed in fields of IT with four IT universities including JNTU (Jawaharlal Nehru's Technological University ). The rise of International Airport and real estate has a major impact on the development of Hyderabad. == Geography == Hyderabad is situated at the Deccan Plateau, 500 meters above the sea level and most of the area is rocky. Paddy is the main crop grown and other crops include Bengal gram, groundnut, sugar cane and sunflower. Hyderabad was found on the banks of Musi river in 1591. Today that area is known as old city where Mecca Masjid and Hussain Sagar Lake exist. The area has many official buildings and that area is very old. From the recent time, Hyderabad has been merged with Secunderabad. This has led a large, united and populous city with many villages surrounding it. === Climate === Hyderabad has a hot, wet and dry climate. The monsoon or rainy season is from late June until late October. On average, 32 inches of rain falls on the city each year. The highest temperature ever recorded was 51.5 째C (113.9 째F) on 2 June 1966. The lowest recorded temperature was 1.1 째C (43 째F) on 8 January 1946. It is cooler in the evenings and mornings because the city is high above sea level. === Population === The city has a population of over four million. Hindus form the majority while Muslims are 40% of the population. The Muslim community of Hyderabad is largest in Telangana. Christians are also in a considerable numbers in the city. Famous churches include those around Abids and Secunderabad like St. Joseph's Cathedral. ==Culture== ===Architecture=== Charminar is actually founded as a Mosque and later by archaeological department changed into a monument. Charminar has long been the icon of Hyderabad. The name means \"Four minarets\". The towers rise to a height of 48.7 m above the ground. There is a mosque with 45 prayer spaces in the upper storeys of the building. The Golconda Fort was the capital of the Qutb Shahi kingdom. In the 16th century, it was the center of a busy diamond trade. The outer wall of the fort is 10 km around. Mecca Masjid is one of the oldest mosques in the city. Muhammed Quli Qutub Shah began building it in 1617. Mughal emperor Aurangzeb finished the building in 1694. The mosque is made of granite. The main hall of the mosque is 75 feet high, 220 feet wide and 180 feet long. Ten thousand worshippers can fit inside at the same time. The entrance arches are made of single slabs of granite. It is believed that Muhammed Quli had bricks made from earth brought from Mecca. He used them the central arch of the mosque. This explains the name of the mosque. The Chowmahalla Palace was Asaf Jahi dynasty capital. The Nizam entertained official guests and royal visitors here. Nawab Viqar al-Umra built Falaknuma Palace in 1872. The palace includes sculptures by artists from Florence. == Language == Telugu, Urdu and Hindi are mainly spoken in Hyderabad. English is also spoken among the educated people. The Telugu dialect spoken across Telangana is very different from the one in the Andhra Pradesh Region. ==Related pages== * Hyderabad State * Nizam of Hyderabad == References == Category:Former good articles",
 "title": "Hyderabad, India"
}