{
 "id": "216257",
 "text": "The 1917–18 NHL season was the first season of the National Hockey League (NHL). The season was split into two halves, December 19 to February 4, and February 6 to March 6. The Montreal Canadiens won the first half, and Toronto the second half. The Montreal Wanderers withdrew early in January 1918 after their rink, the Westmount Arena, burned down. Toronto won the NHL playoff and then won the Stanley Cup by defeating the PCHA's Vancouver Millionaires three games to two in a best-of-five series ==League business== The November 10, 1917 annual meeting of the NHA was presided over by Frank Calder, who was the NHA secretary. The NHA voted to stop operating. On November 17, 1917, it was announced that the Quebec Bulldogs team would not play the next season, but that the NHA season would continue. On November 26, 1917, representatives of the NHA clubs met at the Windsor Hotel in Montreal. The decision to start a new league was made, which was named the National Hockey League. They also decied on several things for the NHL: * the constitution and rules would be the same as the NHA; * Frank Calder was elected president and secretary; * M. J. Quinn of Quebec was named honorary president; * teams in the NHL would be the Ottawa Senators, Montreal Canadiens, and Montreal Wanderers; * the Quebec Bulldogs players were sent to the other teams. A Toronto team was to be controlld for a wihle by the Arena Gardens while the problem of who owned the Toronto team was fixed. The franchise had players from the Toronto Blueshirts, including those who had been sent to other NHA teams for the second half of the 1916–17 NHA season. While Eddie Livingstone, who owned Toronto teams, agreed to do this, the NHL owners did not want to share any money with him. Livingstone would sue for the Toronto team's revenues in 1918. George Kennedy, owner of the Canadiens, would later say: > \"The Toronto players belong as a body to the National Hockey League, for > they were only loaned to the Toronto Arena Company, though Livingstone tried > to make the Arena Company believe that he controlled those players\"from as > quoted in Holzman, page 371. The Toronto team played without a nickname for the season. They would later be called the \"Toronto Arenas.\" The NHL was not supposed to be a permanent league. It was only supposed to exist until the NHA could fix the problem of teams in the NHA. The NHA was involved in a lawsuit against the 228th Battalion, who had a team in the NHA the year before, and could or would not fold until that was finished. ===Major rule changes between the NHA and NHL=== The O'Brien Cup was given to the new NHL from the NHA, and became the league's championship trophy. It was awarded to the winner of the NHL playoffs and that winner then went on to play for the Stanley Cup in a series against other leagues. On January 9, 1918, the league decided to allow goaltenders to drop to the ice surface in order to make saves. This was the first implemented and amended rule change in the National Hockey League. It was done in response to Ottawa's Clint Benedict, who would fall to the ice to stop the puck, even though it was against the rules. ==Regular season== The new league had trouble getting players because there were other leagues at the time, including the Pacific Coast Hockey Association. Also making it difficult was many people were involved in World War I, so they could not play hockey. The Wanderers were in trouble from the start of the season. They won their first home game, but only had 700 people watch. The Wanderers then lost the next three games and owner Lichtenhein threatened to withdraw from the league unless he could get some other players. Although they could have acquired Joe Malone, who led the NHL in scoring, in the draft, they turned to the PCHA and signed goaltender Hap Holmes. They were also allowed to sign players like Frank Foyston, Jack Walker and others if they could get the players to agree. The Wanderers loaned Holmes to the Seattle Metropolitans of the PCHA, but he eventually came back to the NHL when Seattle loaned him to Toronto. A league meeting was planned to deal with the Wanderers, but on January 2, 1918, the it was fixed when the Montreal Arena burned down, leaving the Canadiens and Wanderers without a place to play. The Canadiens moved into the 3,250 seat Jubilee Rink. The Hamilton arena said the Wanderers could play there, but instead Lichtenhein shut down the team on January 4, after the other clubs refused to give him any more players. The remaining three teams would complete the season. The last player from the this season who played was Reg Noble, who retired following the 1933 Stanley Cup playoffs. ===Important events=== The first game of the season featured Toronto versus the Wanderers. Montreal's Dave Ritchie scored the first goal in NHL history and Harry Hyland had four goals in the Wanderers 10–9 victory, which would be their only one in the NHL. The opening game was played in front of 700 people. On January 28, when Canadiens visited Toronto, players Alf Skinner and Joe Hall started swinging their sticks at each other. Both players received match penalties, $15 fines and were arrested by the Toronto Police for disorderly conduct, for which they received suspended sentences. ===Final standings=== Wanderers defaulted scheduled games against the Canadiens (Jan. 2, 1918) and Toronto (Jan. 5, 1918), when their arena burned down. These were counted as losses in the standings, though the games were not played. > \"The league did not accept the Wanderers' resignation immediately, electing > to wait and see whether the team showed up for its scheduled match in > Toronto on Saturday January 5. ... The deadline did expire, and the once- > powerful team that had been known as the Little Men of Iron was thrown onto > the scrap heap of hockey history. The Wanderers' scheduled games of January > 2 and 5 were officially recorded in the standings as victories for their > respective opponents, the Canadiens and Torontos.\" — Holzman.Holzman(2002), > pp. 169–70. ===Results=== ;First half Month Day Visitor Score Home Score Dec. 19 Ottawa 4 Canadiens 7 Dec. 19 Toronto 9 Wanderers 10 Dec. 21 Ottawa 4 Toronto 11 Dec. 21 Canadiens 11 Wanderers 2 Dec. 26 Ottawa 6 Wanderers 3 Dec. 26 Canadiens 5 Toronto 7 Dec. 29 Wanderers 2 Ottawa 9 Dec. 29 Toronto 2 Canadiens 9 Jan. 2 Toronto 6 Ottawa 5 Jan. 2† Wanderers - Canadiens - Jan. 5 Ottawa 5 Canadiens 6 (27' OT) Jan. 5† Wanderers - Toronto - Jan. 9 Canadiens 4 Toronto 6 Jan. 12 Ottawa 4 Canadiens 9 Jan. 14 Toronto 6 Ottawa 9 Jan. 16 Ottawa 4 Toronto 5 Jan. 19 Toronto 1 Canadiens 5 Jan. 21 Canadiens 5 Ottawa 3 Jan. 23 Ottawa 4 Canadiens 3 Jan. 26 Toronto 3 Ottawa 6 Jan. 28 Canadiens 1 Toronto 5 Jan. 30 Canadiens 5 Ottawa 2 Feb. 2 Toronto 2 Canadiens 11 Feb. 4 Ottawa 2 Toronto 8 † Montreal Arena burned down and Wanderers withdraw. Two Wanderers games count as wins for Canadiens and Toronto. ;Second half Month Day Visitor Score Home Score Feb. 6 Canadiens 3 Ottawa 6 Feb. 9 Toronto 7 Canadiens 3 Feb. 11 Ottawa 1 Toronto 3 Feb. 13 Toronto 6 Ottawa 1 Feb. 16 Ottawa 4 Canadiens 10 Feb. 18 Canadiens 9 Toronto 0 Feb. 20 Toronto 4 Canadiens 5 Feb. 23 Ottawa 3 Toronto 9 Feb. 25 Canadiens 0 Ottawa 8 Feb. 27 Ottawa 3 Canadiens 1 (at Quebec) Mar. 2 Canadiens 3 Toronto 5 Mar. 6 Toronto 3 Ottawa 9 ===Scoring leaders=== GP = Games Played, G = Goals, A = Assists, Pts = Points, PIM = Penalties In Minutes Player Team GP G A Pts PIM Joe Malone Montreal Canadiens 20 44 4 48 30 Cy Denneny Ottawa Senators 20 36 10 46 80 Reg Noble Toronto 20 30 10 40 35 Newsy Lalonde Montreal Canadiens 14 23 7 30 51 Corbett Denneny Toronto 21 20 9 29 14 Harry Cameron Toronto 21 17 10 27 28 Didier Pitre Montreal Canadiens 20 17 6 23 29 Eddie Gerard Ottawa Senators 20 13 7 20 26 Jack Darragh Ottawa Senators 18 14 5 19 26 Frank Nighbor Ottawa Senators 10 11 8 19 6 ===Leading goaltenders=== Name Club GP GA SO Avg. Georges Vezina Canadiens 21 84 1 4.0 Harry Holmes Toronto 16 76 4.8 Clint Benedict Ottawa 22 114 1 5.2 A. Brooks Toronto 3 18 6.0 Sam Hebert Toronto/Ottawa 2 15 7.5 ==Playoffs== All dates in 1918 ===NHL Championship=== Montreal had won the first half of the NHL split season and Toronto had won the second half. The two teams then played a two- game total goals series for the NHL championship and the O'Brien Cup. Toronto won the series and advanced to the Stanley Cup finals. Toronto vs. Montreal Canadiens Date Away Score Home Score Notes March 11 Montreal Canadiens 3 Toronto 7 March 13 Toronto 3 Montreal Canadiens 4 Toronto wins total goals series 10–7 for the O'Brien Cup ===Finals=== Vancouver Millionaires vs. Toronto Date Away Score Home Score Notes March 20 Vancouver Millionaires 3 Toronto 5 March 23 Toronto 4 Vancouver Millionaires 6 March 26 Vancouver Millionaires 3 Toronto 6 March 28 Toronto 1 Vancouver Millionaires 8 March 30 Vancouver Millionaires 1 Toronto 2 Toronto wins best-of-five series 3 games to 2 for the Stanley Cup ===NHL playoff scoring leaders=== GP = Games Played, G = Goals, A = Assists, Pts = Points Player Team GP G A Pts Alf Skinner Toronto 7 8 3 11 Newsy Lalonde Canadiens 2 4 4 Harry Cameron Toronto 7 4 4 Harry Meeking Toronto 7 4 4 Reg Noble Toronto 7 3 3 ==New players== The following is a list of players of note who played their first NHL game in 1917–18 (listed with their first team, not including players who previously played in the NHA): *Jack Adams, Toronto ==Last games== The following is a list of players of note that played their last game in the NHL in 1917–18 (listed with their last team): *Jack Laviolette, Montreal Canadiens *Art Ross, Montreal Wanderers *Harry Hyland, Ottawa Senators ==References== ==Sources== *NHL Official Website *Hockey Database * Holzman, Morey, and Joseph Nieforth. Deceptions and Doublecross: How the NHL Conquered Hockey (Toronto: Dundurn Press, 2002), pp. 169–70. * NHL season, 1917-18 NHL season, 1917-18 Category:National Hockey League seasons Category:1917 in North America Category:1918 in the United States",
 "title": "1917–18 NHL season"
}