{
 "id": "216571",
 "text": "Monsters vs. Aliens is a 2009 American computer-animated monster comedy movie produced by DreamWorks Animation. It was the first computer animated movie to be directly produced in a stereoscopic 3-D format instead of being changed into 3-D after completion, adding $15 million to the movie's budget. The movie was set to release in May 2009. It was pushed up to March 27, 2009. It was released on DVD and Blu-ray September 29, 2009 in North America. It stars Reese Witherspoon, Seth Rogen, Hugh Laurie, Will Arnett, Rainn Wilson, Kiefer Sutherland, Stephen Colbert and Paul Rudd. There is also an animated television series of the same name by Nickelodeon and Dreamworks Animation Television. ==Cast and characters== ===Monsters=== * Reese Witherspoon as Ginormica: Susan Murphy from Modesto, California who is hit by a radioactive meteor on her wedding day, making her grow to a height of . She is shy and wants nothing more than to return to her old life, but slowly warms up to her new status as a monster. Because of her exposure with the meteorite's radiation, and her size, she is very strong and has a resistance to energy attacks. * Seth Rogen as B.O.B.: A mass in which you can't kill made when a genetically-altered tomato was injected with a chemically-altered ranch dessert topping. His greatest strength is to eat anything as well as you can't destoy him. His one weakness is that his change on form didn't give him a brain, making him very dumb. He sometimes mistaks the other monsters' goals in life for his own. His main goal in life is to eat things. * Hugh Laurie as Dr. Cockroach, Ph.D: A smart but mad scientist who, in an experiment to inspire himself with the resilience and powers of a cockroach, ending up with a giant cockroach's head and some personality things of the cockroach. He is charming and powerful. * Will Arnett as the Missing Link: A 20,000-year-old fish-ape hybrid who was found frozen and thawed out by scientists, only to escape and make trouble at his old lagoon habitat. Normally thought to as Link, he behaves as a jock most of the time, but is rather out of shape. Despite this, he is an expert martial-artist and takes it upon himself to lead the team in attacks, even if his attitude doesn't always work to their advantage. * Conrad Vernon as Insectosaurus: Formerly a grub transformed by nuclear radiation into a 350 ft monster with the power to shoot silk out of his nose. He is unable to speak clearly, and is mesmerized by bright lights (normally used to lead him to other places). He also has a close friendship with the Missing Link, who can understand what Insectosaurus is saying. In his butterfly form, he has wings and is able to fly and becomes the Monsters' mode of transportation. ===Aliens=== * Rainn Wilson as Gallaxhar: An evil alien overlord who hopes to take over Earth. He is served by big robot probes and has a big cloning machine. He says to have suffered many traumas in his youth, driving him to destroy his own homeworld, and plans to make a new one on Earth - although viewers never hear most of the story. He wants to collect quantonium - the stuff that transformed Susan - to give his cloning machine enough power to make an army of clones of himself to conquer Earth, and is determined to extract it from Susan. Gallaxhar serves as the main antagonist of the movie. * Amy Poehler as Gallaxhar's Computer: A smooth-working, user-friendly computer that follows his orders, with a sarcastic tone. ==Making of the movie== Ed Leonard, CTO of DreamWorks Animation, says it took about 45.6 million hours to make Monsters vs. Aliens, more than eight times as many as the first Shrek. Many hundred Hewlett-Packard xw8600 workstations were used, along with a large and powerful render farm of HP ProLiant blade servers. It had over 9,000 server cores, to read through the animation. The movie had to have 120 terabytes (120,000 gigabytes) of data to complete. It also had one explosion scene alone having 6 terabytes (6000 gigabytes). Since Monsters vs. Aliens, all big movies released by DreamWorks Animation will be made in a 3-D format, using Intel's InTru3D technology. ==References== Category:2009 science fiction movies Category:2009 computer-animated movies Category:2009 3D movies Category:American science fiction movies Category:DreamWorks Animation movies Category:English-language movies Category:Saturn Award winning movies Category:Movies about extraterrestrial life Category:Movies about impact events Category:Movies about giants Category:Movies set in California Category:2000s monster movies Category:Movies directed by Conrad Vernon",
 "title": "Monsters vs. Aliens"
}