{
 "id": "216789",
 "text": "Sonic the Hedgehog 3 (also known as Sonic 3) is the fourth main video game in the Sonic the Hedgehog series. It was made by Sonic Team and published by Sega for the Sega Mega Drive in 1994. The player plays as Sonic the Hedgehog or Miles \"Tails\" Prower and explores Angel Island while chasing down Dr. Robotnik and his new sidekick Knuckles the Echidna. Sonic 3 was meant to be one long game, but it was too big to put onto an affordable cartridge. Because of this, the game is split into two parts. The second part is Sonic & Knuckles. ==Gameplay== The gameplay of Sonic 3 is the same as the last two games, but it has a few small changes. Sonic has a new ability called the Insta-Shield, where tapping a button after jumping lets Sonic attack enemies that are slightly further away. There are new power-ups that are different kinds of shields, replacing the normal one from the last games: the fire shield lets Sonic boost forward and protects him from fire attacks, the bubble shield lets Sonic bounce off the ground or off enemies and stops him from drowning, and the lightning shield gives Sonic a double jump and protects him from bullets and electric attacks. This game also has a new special stage called Blue Spheres; Sonic runs around a large spherical stage collecting all of the blue spheres in the stage. If Sonic touches a red sphere, he loses and is forced out of the special stages. ==Plot== The game begins after what happened in the previous game; Sonic and Tails defeated Dr. Robotnik on his giant spaceship called the Death Egg. It then exploded and landed on Angel Island, an island that floats in the air. Knuckles lives on Angel Island. He guards the Master Emerald, which is a big green emerald that makes the island float. Dr. Robotnik knows that the Master Emerald is very powerful. He wants to steal it because he could fix the Death Egg with that power. He tricks Knuckles and tells him that Sonic and Tails are thieves and they want to steal the Master Emerald. Soon, Sonic and Tails arrive on Angel Island because they have seen that the Death Egg has fallen there. However, Knuckles surprises them, and takes away the Chaos Emeralds Sonic and Tails have collected. ==Development== Some of Sonic 3 music was composed by then-popular musician Michael Jackson. It is unknown which specific songs he did. Jackson apparently left due to child abuse allegations. ==Notes== ==References== Category:1994 video games Category:Cooperative video games Category:Multiplayer and single-player video games Category:Platform games Category:Sega Genesis games Category:Side- scrolling platform games Category:Side-scrolling video games Category:Sonic the Hedgehog games Category:Video game sequels Category:Video games developed in Japan Category:Video games developed in the United States Category:Virtual Console games Category:Windows games Category:Xbox 360 Live Arcade games",
 "title": "Sonic the Hedgehog 3"
}