{
 "id": "217503",
 "text": "James Byron Dean (February 8, 1931September 30, 1955) was an American movie actor. He was one of the most important people in Hollywood in the 1950s. His career was only 5 years long. He was also only in 3 major movies. However, he had a very big impact on cinema and popular culture. He was best known for his part in a movie called Rebel Without a Cause (1955). In this movie, he played a rebellious teenager. He was also in two other movies. He was in East of Eden (1955). He was also in Giant (1956). All of these movies are in the United States National Film Registry by the Library of Congress. He was killed in a car accident in 1955. He was 24. He got an Academy Award (Oscar) nomination after his death for Best Actor for his role in East of Eden. He was the first person to get this nomination posthumously (after he died). After his first nomination, he was given a 2nd nomination for his role in Giant. This makes him the only actor that has been given 2 acting nominations after his death. In 1999, the American Film Institute ranked him as the 18th best male movie star from Golden Age Hollywood on their \"AFI's 100 Years...100 Stars\" list. Time magazine said Dean was one of the \"All-Time Most Influential Fashion Icons.\" ==Early life== James Dean was born in 1931 in Marion, Indiana, United States. His parents were called Winton Dean and Mildred Wilson. Six years later, the family moved to California, and James went to school in Los Angeles. He was very close to his mother. She died of cancer when he was nine, and James went to live with his aunt and uncle in Fairmount, Indiana. In high school, he became interested in drama and car racing. After he graduated, he moved back to California to live with his father and stepmother. He attended Santa Monica College and UCLA, but left college in 1951 to become a professional actor. In an interview, Elizabeth Taylor told something which James Dean had said to her during their filming. After his mother’s death, when he was 11 years old, he was sexually harassed by a Protestant minister. This experience tortured him during all his whole childhood. ==Death== === Racing hobby === In 1954, Dean started doing motorsports. He bought many automobiles after he was done acting for East of Eden. He bought a Triumph Tiger T110 and a Porsche 356.Wasef and Leno (2007) pp. 13–19.Perry, p. 151. On March 26–27 1955, he was in his first professional race at the Palm Springs Road Races in Palm Springs, California. Dean was 1st place in the novice class. He was 2nd place at the main event. He raced in Bakersfield a month later. He was 1st in his class. He was 3rd overall.Raskin (2005) pp. 47–48; 68–71; 73–74; 78–81; 83–86 Dean said he wanted to race in the Indianapolis 500. However, he had a very busy acting schedule. This meant that this was not possible.Perry (2012) p. 162. Dean's last race was in Santa Barbara on May 30, 1955. He was not able to finish the competition. This was because he had a blown piston (his piston was damaged). He was not able to race after that because Warner Brothers said he could not race while acting for Giant.Raskin (2005) pp. 101–02. Once he was done acting for that movie, however, he wanted to race again. === Accident === Dean loved motor racing. After acting for Giant, he bought a new 1955 Porsche 550 Spyder. He entered into the upcoming Salinas Road Race. This would be on October 1–2, 1955.Raskin (2007) pp. 111–15. Dean went to the race track. 3 other people went with him. The first person was the stunt coordinator Bill Hickman. The second person was Collier's photographer Sanford Roth. The 3rd person was Rolf Wütherich. He was the German mechanic from the who maintained Dean's Spyder car.Perry (2012) pp. 11–12. On September 30, the group went west on U.S. Route 466 (now SR 46) near Cholame, California. At the same time, a 23-year-old California Polytechnic State University student Donald Turnupseed, was driving east. He was in a 1950 Ford Tudor. At 5:45 p.m., Turnupseed turned left onto Highway 41. He would be going north toward Fresno. This turn was in front of Dean's Porsche.Perry (2012) pp. 11–12. Dean was not able to stop his car in time. His car went into the Ford. Dean's car went into the pavement on the highway. Dean had many fatal injuries from this accident.Perry (2012) pp. 14–15. Turnupseed had only minor injuries. Dean was buried in Fairmount, Indiana. == Stage == === Broadway === * See the Jaguar (1952) * The Immoralist (1954) – based on the book by André Gide === Off-Broadway === * The Metamorphosis (1952) – based on the short story by Franz Kafka * The Scarecrow (1954) * Women of Trachis (1954) – translation by Ezra Pound == Filmography == === Movies === List of movie credits by James Dean Year Title Role Director Notes Ref. 1951 Fixed Bayonets! Doggie Samuel Fuller Uncredited 1952 Sailor Beware Boxing Trainer Hal Walker Deadline – U.S.A. Copyboy Richard Brooks Has Anybody Seen My Gal? Youth at Soda Fountain Douglas Sirk 1953 Trouble Along the Way Football Spectator Michael Curtiz 1955 East of Eden Cal Trask Elia Kazan Lead film debut Rebel Without a Cause Jim Stark Nicholas Ray Released posthumously 1956 Giant Jett Rink George Stevens Filmed in 1955; released posthumously. Final role. === Television === List of television credits by James Dean Year Title Role Notes Ref. 1951 Family Theater John the Apostle Episode: \"Hill Number One: A Story of Faith and Inspiration\" The Bigelow Theatre Hank Episode: \"T.K.O.\" The Stu Erwin Show Randy Episode: \"Jackie Knows All\" 1952 CBS Television Workshop G.I. Episode: \"Into the Valley\" Hallmark Hall of Fame Bradford Episode: \"Forgotten Children\" The Web Himself Episode: \"Sleeping Dogs\" 1952–1953 Kraft Television Theatre Various Characters Episodes: \"Prologue to Glory\", \"Keep Our Honor Bright\" and \"A Long Time Till Dawn\" 1952–1955 Lux Video Theatre Various Characters Episodes: \"The Foggy, Foggy Dew\" and \"The Life of Emile Zola\" 1953 The Kate Smith Hour The Messenger Episode: \"The Hound of Heaven\" You Are There Robert Ford Episode: \"The Capture of Jesse James\" Treasury Men in Action Various Characters Episodes: \"The Case of the Watchful Dog\" and \"The Case of the Sawed-Off Shotgun\" Tales of Tomorrow Ralph Episode: \"The Evil Within\" Westinghouse Studio One Various Characters Episodes: \"Ten Thousand Horses Singing\", \"Abraham Lincoln\" and \"Sentence of Death\" The Big Story Rex Newman Episode: \"Rex Newman, Reporter for the Globe and News\" Omnibus Bronco Evans Episode: \"Glory in the Flower\". Crazy Man Crazy was on soundtrack. Campbell Summer Soundstage Various Characters Episodes: \"Something for an Empty Briefcase\" and \"Life Sentence\" Armstrong Circle Theatre Joey Frasier Episode: \"The Bells of Cockaigne\" Robert Montgomery Presents Paul Zalinka Episode: \"Harvest\" 1953–1954 Danger Various Characters Episodes: \"No Room\", \"Death Is My Neighbor\", \"The Little Woman\" and \"Padlocks\" 1954 The Philco Television Playhouse Rob Episode: \"Run Like a Thief\" General Electric Theater Various Characters Episodes: \"I'm a Fool\" and \"The Dark, Dark Hours\" 1955 The United States Steel Hour Fernand Lagarde Episode: \"The Thief\" Schlitz Playhouse of Stars Jeffrey Latham Episode: \"The Unlighted Road\" == Awards and nominations == List of awards and nominations Year Award Category Nominated work Result Note Academy Awards Best Actor rowspan=\"4\" British Academy Film Awards Golden Globe Awards Jussi Awards Academy Awards Best Actor Bravo Otto | British Academy Film Awards Best Foreign Actor Golden Globe Awards | * * * == Notes == ==References== === Cited literature === * * * * * * * * * * * * * * * == Further reading == * Alexander, Paul: Boulevard of Broken Dreams: The Life, Times, and Legend of James Dean . Viking, 1994. * Bast, William: James Dean: A Biography. Ballantine Books, 1956. * * Beath, Warren: Death of James Dean. Grove Press, 1986. * Beath, Warren, with Wheeldon, Paula; James Dean in Death: A Popular Encyclopedia of a Celebrity Phenomenon, McFarland & Co., Inc., 2005. * Colavito, Jason: Jimmy: The Secret Life of James Dean. Rowman & Littlefield, 2024. * Dalton, David: James Dean-The Mutant King: A Biography. Chicago Review Press, 2001. * Frascella, Lawrence and Weisel, Al: Live Fast, Die Young: The Wild Ride of Making Rebel Without a Cause. Touchstone, 2005. * Gilmore, John : Live Fast-Die Young: Remembering the Short Life of James Dean. Thunder's Mouth Press, 1998. * Gilmore, John: The Real James Dean. Pyramid Books, 1975. * Heinrichs, Steve; Marinello, Marco; Perrin, Jim; Raskin, Lee; Stoddard, Charles A; Zigg, Donald; Porsche Speedster TYP540: Quintessential Sports Car, 2004, Big Lake Media, Inc. * Holley, Val: James Dean: The Biography. St. Martin's Griffin, 1996. * Hopper, Hedda and Brough, James: \"James Dean Was a Rebel With a Cause\" in The Whole Truth and Nothing But. Doubleday. 1963. * Howell, John: James Dean: A Biography. Plexus Publishing, 1997. Second Revised Edition. * Hyams, Joe; Hyams, Jay: James Dean: Little Boy Lost. Time Warner Publishing, 1992. * Martinetti, Ronald: The James Dean Story, Pinnacle Books, 1975. * * Perry, George: James Dean. DK Publishing, 2005. * Raskin, Lee: James Dean: At Speed. David Bull Publishing, 2005. * Reeves, Derek: The Legend of James Dean: Demonic Heroes Have Villainous Virtues . Archway Publishing, 2024. * Riese, Randall: The Unabridged James Dean: His Life from A to Z. Contemporary Books, 1991. * Sheridan, Liz: Dizzy & Jimmy: My Life With James Dean: A Love Story. HarperCollins Canada / Harper Trade, 2000. * Spoto, Donald: Rebel: The Life and Legend of James Dean. HarperCollins, 1996. * Turiello, James: The James Dean Collection, 1993. Biography on fifty trading cards with photographs from The James Dean Gallery in Fairmount, Indiana. * Turiello, James: James Dean The Quest for an Oscar. Amazon Digital Services LLC, 2018. == Other websites == * * * * * Category:Actors from Indiana Category:American movie actors Category:American television actors Category:Bisexual people Category:LGBT actors Category:LGBT people from Indiana Category:Road accident deaths in California Category:1931 births Category:1955 deaths",
 "title": "James Dean"
}