{
 "id": "217512",
 "text": "This is a list of characters in the Mario series. ==Heroes== *Mario: Mario is the main character of the series. He is an Italian-American man, and was originally referred to as Jumpman in Donkey Kong. He is often portrayed having superhuman acrobatics. In most of the Mario spin-offs, he is the most average character, and is a good choice for starters. He is usually portrayed today with his iconic hat with an M, while also wearing a red shirt and blue overalls. He also has his iconic brown mustache. *Luigi: Luigi is Mario's slightly taller brother. His abilities are usually the same as Mario's, but in some games Luigi can jump higher. Luigi is usually the sidekick, but was the hero in a few games such as Luigi's Mansion. His appearance is similar to Mario's, but instead wears a green shirt and hat with the letter L. *Rosalina: Rosalina is a princess from outer space. She first appears in the Mario game Super Mario Galaxy. * Peach: Princess Peach is the Princess of the Mushroom Kingdom. Mario often saves her from Bowser in many of the Mario games. However, she may sometimes be the protagonist in the game, such as Super Princess Peach and Super Mario 3D World. She is shown wearing a pink dress and a crown on her head of yellow hair. She is also known as Princess Toadstool. * Daisy: Daisy is the Princess of Sarasaland. The first game that she was in was Super Mario Land. She dresses similarly as Peach, but with an orange dress and brown hair. *Yoshi: Yoshi is a dinosaur that Mario rides in some games. He appeared in his own game, Yoshi's Island. He can have many colors. *Toad: Toad is a mushroom-shaped creature who appears in many Mario series games. He is just one of many toads. These creatures first appeared in Super Mario Bros., where they were called Mushroom Retainers. ==Villains== *Bowser: Bowser is the King of Koopas, a turtle-like monster species, who was first seen in Super Mario Bros. He kidnaps Princess Peach many times, and is beaten by Mario. *Bowser Jr.: A wild son of Bowser who wants to be like his father. First seen in Super Mario Sunshine. *The Koopalings: Includes Iggy Koopa, Morton Koopa Jr., Lemmy Koopa, Ludwig Von Koopa, Larry Koopa, Roy Koopa, and Wendy O. Koopa *Wario: Wario is an evil version of Mario who likes money. He is short, fat, muscular, and wears yellow. Wario is voiced by Charles Martinet. *Waluigi: Waluigi is Wario's sidekick, and an evil version of Luigi. He is tall and thin, like Luigi, and wears purple. Waluigi is voiced by Charles Martinet. *Fawful: A Beansish creature with fury *Foreman Spike: A rival from Mario and Luigi's time as carpenters in Brooklyn. He is from Wrecking Crew. * Petey Piranha: A giant Piranha Plant boss from Super Mario Sunshine. * Tatanga: Space alien who stole Princess Daisy and took over the kingdom of Sarasaland in Super Mario Land. He returns in Super Mario Land 2 as a henchman of Wario. * King Boo: A big Boo from Luigi's Mansion. King Boo is voiced by Toru Asakawa * Dry Bowser: The Dry Bones variation of Bowser. *King Bob-omb: The king of the Bob-ombs. Has a Moustache. *Kamek: A powerful magic Koopa leader who raised Bowser and appears as the secondary villain of the Yoshi games. *Whomp King: The ruler of the whomps from Super Mario 64. He reappeared in Super Mario Galaxy 2. *Mr. L: A brainwashed Paper Luigi who appeared in Super Paper Mario. *Wart: The villain of Super Mario Bros. 2. He is a big toad whom you had to throw vegetables at to defeat. *Hammer Bro: A koopa which throws hammers at Mario. With their relatives, the Fire Bro, the Boomerang Bro and the Ice Bro. ==Common enemies== *Koopa Troopa: Koopa Troopas are turtle-like monsters that often work for Bowser, though in some games, they are friendly. They are playable characters in some Mario sports games, such as Mario Kart. *Goomba: Goombas are mushroom shaped enemies that are the most common in the series. They are easily killed by jumping on their head. *Paratroopa: A flying version of a Koopa Troopa. *Paragoomba: A flying version of a Goomba. *Boo: Ghosts that stop moving when Mario looks at them. They show up in most Mario titles. *Piranha Plant: A hungry Venus Flytrap that hides in Warp Pipes *Dry Bones: A skeleton variation of the Koopa Troopa *Thwomp: Giant stone faces with spikes that try to crush Mario. Mostly seen in Super Mario games *Bullet Bill: An alive bullet that can be stood or jumped on. In some games will chase after Mario, but in most will just fly in a straight line. *Chuckya: A bomb that can throw Mario. *Bob-omb: A walking wind-up bomb. *Mecha-Koopa: A wind- up turtle. *Cheep Cheep: A red fish. *Chain Chomp: A barking ball-and chain. *Lakitu: A turtle who rides in a cloud. He sometimes throws things. *Spiny: A spiked turtle enemy commonly thrown by Lakitu *Blooper: A squid that follows Mario to try and beat him. *Buzzy Beetle: A beetle who walks forward and has a shell. *Pokey: A tall cactus that always smiles. *Shy Guy: A human shaped enemy who wears a hood and mask. ==Other characters == *Donkey Kong: Donkey Kong is a big ape. He first fought Mario in the arcade game Donkey Kong, before getting some games of his own as a hero. He appears in many Mario spin- offs, including Mario Kart. *Birdo: One of the bosses in Super Mario Bros. 2. Birdo shows up in many Mario spin-off titles such as Mario Kart Wii and Mario Party 9. *Diddy Kong: Donkey Kong's smaller sidekick in the Donkey Kong Country series. * Category:Lists of fictional characters",
 "title": "List of Mario series characters"
}