{
 "id": "21763",
 "text": "Hamas (), an acronym of its official name, Harakat al-Muqawama al-Islamiyya (, lit. \"Islamic Resistance Movement\"), is a Palestinian Sunni Islamist political movement in Gaza, with a history of terrorism and antisemitism * * * * * * despite its relative popularity in the Middle East and Western academia. * * * * * * * * * * * On October 7, 2023, the Hamas took the lead in a series of attacks on Israel, seen by some scholars as the worst massacre of Jews since the end of the Holocaust. * * * * * ==Name== Hamas is an acronym of the Arabic phrase , or Harakat al-Muqawama al-Islamiyya or \"Islamic Resistance Movement\". ==History== Hamas was started in 1987 by Ahmed Yassin and Abdel Aziz al-Rantissi after the beginning of the First Uprising against Israeli violence and occupation. It started as the Gaza branch of the Muslim Brotherhood organization in Egypt. In the 2006 legislative election, the party received 74 out of 132 seats in parliament by campaigning on clean government without corruption and affirming Palestinians' right to defend against Israeli occupation. ==Ideas== The party has supported the reestablishment of the Land of Palestine in all historic land, which includes the West Bank, Gaza, and the State of Israel. The 2017 Hamas Charter stated that the party's struggle was with Zionists and Israeli terrorists. In 2018, the United Nations voted to reject an American claim to condemn Hamas. Hamas official Sami Abu Zuhri told the Reuters news agency, \"Rejecting the American drafted resolution against the resistance represents a blow to the American administration and reaffirms the legitimacy of the resistance.\" ==Controversies== ===Violence=== Hamas is known for its military wing, the Izz ad-Din al-Qassam Brigades, which plans and carries out attacks on Israel. Because of its history of suicide bombings and rocket attacks on civilians in Israel, the United States, European Union and other countries call it a terrorist organisation. The country of Jordan has banned the group. In March 2025, families of the hostages filed a lawsuit in New York, accusing the Students for Justice in Palestine (SJP), Jewish Voice for Peace (JVP), and Within Our Lifetime of working as Hamas propagandists in America. Particularly, Columbia University's SJP chapter posted an instant story about the Hamas-led attack on October 7, 2023 three minutes before it happened, raising suspicion of them having had foreknowledge. Shlomi Ziv, once held hostage for 246 days, claimed to have been told by a Hamas captor that Columbia University-linked groups were receiving \"financial, organisational, and other support\" from the Hamas. ===Antisemitism=== Antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. is also widespread among the Hamas and their supporters. As per scholar Esther Webman, strongly antisemitic rhetoric is frequently found in Hamas leaflets, which tend to equate Jews with Zionists to incite terrorism against Jews.Webman, Esther. Anti-semitic Motifs in the Ideology of Hizballah and Hamas, Project for the study of Anti-semitism, Tel Aviv University, 1994, p. 22. The Hamas' Charter frames the group's raison d'être as being \"against the Jews [...] Israel, Jews and Judaism [are a] challenge to Islam and the Moslem people\" and makes it clear that The Hamas' Charter also blames the Freemasons, French Revolution, Russian Revolution, WWI and WWII on a \"Jewish Zionist conspiracy.\" In August 2003, senior Hamas official Dr. Abd Al-Aziz Al-Rantisi wrote in the Hamas newspaper Al-Risala: In August 2009, Hamas forbade Palestinian children from studying the Holocaust, demonized by the Hamas as \"a lie invented by the Zionists.\"\"Hamas rips U.N. for teaching the Holocaust.\" Jewish Telegraphic Agency (JTA). 31 August 2009. 31 August 2009. An ADL global poll in 2024 found that 97% of Palestinians held deeply entrenched antisemitic beliefs, * * * * * while 72% of Palestinians were satisfied with Hamas' conduct in the Israel–Hamas war and 82% supported the October 7 massacres, despite the October 7 massacres being the worst series of massacres of Jews since the end of the Holocaust. ==Popularity== In early 2006, Hamas won a clear victory in the vote for the Palestinian legislative election. Voters saw Hamas as an alternative to exchange the long- ruling Fatah party, the main part of the PLO. This was due to how Fatah had not improved the Palestinian people's conditions and instead allegedly worsened conditions by corruption. There have been no elections since 2006. ==Local work== Hamas has shown its organizational ability by building health, education, and social services to help the population in the West Bank and the Gaza Strip, where there are many poor people. Their efforts ended up increasing support to Hamas. In the first half of 2007, Hamas gained political control of the Gaza Strip, while Fatah keeps its headquarters in the West Bank. ==Related pages== * Nation of Islam * Islam and fascism ==Notes== ==References== Category:Gaza Strip Category:Nationalism Category:Islamic terrorism Category:Religious terrorism Category:Politics of Palestine Category:Sunni organizations Category:Arab–Israeli conflict Category:Gaza–Israel conflict Category:Nationalist terrorism Category:Political parties in Asia Category:Palestinian nationalism Category:Islamist militant groups Category:1987 establishments in Asia Category:Nationalist organizations in Palestine",
 "title": "Hamas"
}