{
 "id": "217734",
 "text": "Glenda May Jackson CBE (9 May 1936 – 15 June 2023) was an English actress turned politician. She is best known for her portrayal of Queen Elizabeth I in the BBC series Elizabeth R in 1971. She won the Triple Crown of Acting, meaning she was the winner of an Oscar, Emmy and Tony Awards. == Life and career == Glenda Jackson studied at the Royal Academy of Dramatic Art. She began her acting career in 1957. She joined the Royal Shakespeare Company, where she remained for four years. After a few bit parts in movies, she got her first major role in Marat/Sade in 1966. In 1969, she appeared in Ken Russell's movie version of D.H. Lawrence's novel Women in Love. For this part, she won the Academy Award for best actress. The next year, she appeared in another Ken Russell's movie The Music Lovers. Other notable movies have included; Sunday Bloody Sunday (1971), Mary, Queen of Scots (1971), The Triple Echo (1972), A Touch of Class (1973), which won her a second Academy Award for best actress, The Romantic Englishwoman (1975), Hedda (1975), The Incredible Sarah (1976), Stevie (1978), Hopscotch (1980) etc. She also appeared to great acclaim on BBC television in Elizabeth R, a six parts series on the life of Queen Elizabeth I of England, which is thought by many as the most scholarly version. Jackson retired from acting in 1992 and turned to politics. She entered the House of Commons as a Labour member of Parliament. She was married to Roy Hodges from 1958 to 1976, with whom she had a son, Daniel (born in 1969). In August 2017, Burberry, a London-based luxury fashion house recruited Glenda Jackson to model the iconic trench and revealed the inspiration for its next London Fashion Week show. On 15 June 2023, Jackson died at her home in Blackheath, London at the age of 87. == References == == Other websites == * MPs website * Local party website * Guardian Unlimited Politics — Ask Aristotle: Glenda Jackson * TheyWorkForYou.com — Glenda Jackson * BBC Politics Category:1936 births Category:2023 deaths Category:English Academy Award winning actors Category:Actors from Cheshire Category:Drama Desk Award winners Category:Emmy Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:Members of the British House of Commons for English constituencies Category:Golden Globe Award winning actors Category:People from the London Borough of Camden Category:People from Birkenhead Category:Tony Award winning actors Category:UK MPs 1992–1997 Category:UK MPs 1997–2001 Category:UK MPs 2001–2005 Category:UK MPs 2005–2010 Category:UK MPs 2010–2015 Category:Politicians from Merseyside",
 "title": "Glenda Jackson"
}