{
 "id": "217908",
 "text": "Selena Marie Gomez, (born July 22, 1992) is an American actress, singer and businesswoman. ==Early life== Selena Marie Gomez was born on July 22, 1992 in Grand Prairie, Texas, United States of America. Her parents divorced when she was five years old with Selena Gomez staying with her mother. Gomez had a close relationship with her grandparents as a child, who said that they \"raised her\" up until she found success in the entertainment industry. She appeared in various pageants while she was growing up. Selena Gomez has two siblings. Her sister, Gracie Elliot Teefey, was born to Amanda and Brian Teefey on June 12, 2013. Gomez has a second sister, Victoria Gomez, born to Ricardo and Sarah Gomez on June 25, 2014. She earned a high school diploma through homeschooling in May 2010.Selena Gomez Graduates High School – On Screen & Off | Access Hollywood – Celebrity News, Photos & Videos. Access Hollywood (May 12, 2010). Retrieved November 17, 2010. ==Acting career== When she was 7, Gomez was first featured on the children's television series Barney & Friends – where she befriended fellow child star and singer Demi Lovato – in the early 2000s. In 2007, she came to prominence after being cast in the Disney Channel television series Wizards of Waverly Place. She portrayed the starring character, Alex Russo, until its conclusion in 2012. Gomez entered the film industry with star billings in feature films including Ramona and Beezus (2010), Monte Carlo (2011), Hotel Transylvania (2012), The Big Short (2015), The Fundamentals of Caring (2016), Neighbors 2 (2016), and In Dubious Battle (2016) \"The Voyage of Doctor Dolittle\" (2019). In 2021, she starred in the hit television comedy crime show Only Murders in the Building. ==Singing career== Gomez formed her band Selena Gomez & the Scene after signing a recording contract with Hollywood Records in 2008; they released the studio albums Kiss & Tell (2009), A Year Without Rain (2010), and When the Sun Goes Down (2011) before beginning a hiatus in 2012. The band was known for singles such as \"Naturally\", \"Round & Round\", \"Who Says\", and \"Love You Like a Love Song\". In July 2013, Gomez released her solo debut album Stars Dance (2013). It featured the top-ten single \"Come & Get It\" and another single, \"Slow Down\". A greatest-hits album, For You, was released on November 24, 2014, and included the single \"The Heart Wants What It Wants\". Gomez released her second solo album Revival in 2015, featuring the top-ten singles \"Good for You\" (featuring rapper A$AP Rocky) and \"Hands to Myself\". In 2017, she released a single with rapper Gucci Mane called \"Fetish\". In 2020 Selena released her newest album Rare. That included songs like Lose You To Love Me and Look At Her Now, both released in 2019. Gomez was revealed to be an executive producer of the second season of the Netflix drama series, 13 Reasons Why. She released a song for its soundtrack, called \"Back to You\". ==Personal life== Gomez was in an on-and-off relationship with Canadian singer Justin Bieber from 2011 until 2017. In 2017, she was in a relationship with Canadian singer-songwriter The Weeknd. They split that October. In early January 2014, it was reported that Gomez had been battling lupus, an autoimmune disease that can cause facial swelling, fatigue, headaches, and joint pain for more than two years. Gomez required a kidney transplant as a result of her lupus diagnosis. Her close friend, actress Francia Raisa, donated her own kidney to Gomez in summer 2017. After the transplant, one of Gomez' arteries flipped inside of her, which required emergency surgery.Then, she went to rehab in 2018. Selena was diagnosed with Lupus in 2014. In December 2024, Gomez announced her engagement to music producer Benny Blanco. ==Products and endorsements== In 2009, Gomez was part of Sears's back-to-school fashion campaign and was in television commercials. She hosted the \"Sears Arrive Air Band Casting Call\" to select five winners for the first-ever \"Sears Air Band\" to perform at the 2009 MTV Video Music Awards. She also became the spokesperson for Borden Milk and was in newspaper adverts and television commercials for the brand. Gomez launched the Dream Out Loud fashion collection in 2010. It has bohemian dresses, floral tops, jeans, skirts, jackets, scarves and hats, They were made from recycled or eco-friendly materials. In May 2012, Gomez made her perfume with Adrenalina. In 2013, she made her second fragrance, Vivamore by Selena Gomez. She also created her own collection of nail polish colors for Nicole by OPI. From 2013 to 2015, Gomez was a spokesperson and partner for Neo by Adidas. In 2015, Gomez signed $3 million deal with Pantene. In 2016, Gomez appeared in a fashion campaign for luxury brand Louis Vuitton. She also appeared in ads for Coca-Cola. In 2017, Gomez launched a handbag collection with Coach called the \"Selena Grace\" line. In 2017, Gomez signed a $30 million contract with the athletic brand Puma as a brand ambassador, She was in a campaign for Phenom Lux sneakers released in March. On December 12, She launched her collection with Puma, called SG x PUMA Strong Girl collection. In April 2020, Gomez became an owner and investor of the ice cream brand Serendipity. In September, she launched her own makeup and cosmetics brand called Rare Beauty. In July 2021, Gomez released a swimwear line with La'Mariette. In November, Gomez co-founded the mental health media platform Wondermind. In December, she became an investor in the food delivery company Gopuff. In May 2022, Gomez collaborated with Our Place on a cookware line, the Summer Collection. A second edition of the range was released in June 2023. ==Awards and nominations== Award Year Category Work Result Ref. Critics' Choice Television Awards Best Actress in a Comedy Series Only Murders in the Building Gold Derby Television Awards Best Comedy Actress Golden Globe Awards Best Actress in a Series, Musical/Comedy Hollywood Television Critics Association Best Actress in a Streaming Series, Comedy Online Film and Television Association Best Actress in a Comedy Series Satellite Awards Best Actress in a Series, Musical/Comedy ==Notes== ==References== Category:1992 births Category:Living people Category:Disney actors Category:American child actors Category:American movie actors Category:American television actors Category:American dancers Category:Singer-songwriters from Texas Category:American voice actors Category:Models from Texas Category:American television producers Category:American activists Category:American pop singers Category:American child singers Category:Philanthropists from Texas Category:Businesspeople from Texas Category:Actors from Texas",
 "title": "Selena Gomez"
}