{
 "id": "218",
 "text": "Earth science is an all-embracing term for the sciences related to the planet Earth. Earth science may also be called geoscience. Geoscience is the study of the architecture of the Earth. It is a broader term than geology because it includes aspects of planetary science, which is part of astronomy. The Earth sciences include the study of the atmosphere, oceans and biosphere, as well as the solid earth. Typically Earth scientists use ideas from physics, chemistry, biology, chronology and mathematics to understand the Earth, and how it evolved to its current state. If there is one fact which underlies all Earth science it is this: the Earth is an ancient planet which has been changing the whole time since its formation. The extent of the changes is much greater than people used to think.Van Andel, Tjeerd 1994. New views on an old planet: a history of global change. 2nd ed, Cambridge University Press, Cambridge UK. ==Fields of study== The following disciplines are generally recognised as being within the geosciences: * Geology describes the rocky parts of the Earth's crust (or lithosphere) and its historic development. Major subdisciplines are mineralogy and petrology, geochemistry, geomorphology, paleontology, Mineralogy, petrophysics, stratigraphy, structural geology, engineering geology and sedimentology.Adams, Simon & Lambert, David 2006. Earth Science: an illustrated guide to science. New York NY 10001: Chelsea House. .Smith, Gary A. & Pun, Aurora 2006. How does the Earth work?. Pearson Prentice Hall, NJ. . * Geophysics and Geodesy investigate the shape of the Earth, its reaction to forces and its magnetic and gravity fields. Geophysicists explore the Earth's core and mantle as well as the tectonic and seismic activity of the lithosphere.Wordnet Search: GeodesyNOAA National Ocean Service Education: Geodesy * Soil science covers the outermost layer of the Earth's crust that is subject to soil formation processes (or pedosphere). * Oceanography and hydrology (includes limnology) describe the marine and freshwater domains of the watery parts of the Earth (or hydrosphere). Includes Marine biology. * Glaciology covers the icy parts of the Earth (or cryosphere). * Atmospheric sciences cover the gaseous parts of the Earth (or atmosphere) between the surface and the exosphere (about 1000 km). Major subdisciplines are meteorology, climatology, atmospheric chemistry and physics. * Astronomy includes the study of distant stars and galaxies to the examination of the 4.6 billion years old Earth from an astronomical point of view. It is also closely related with the study of the solar system and its planets, a subdiscipline called planetology. A more distant relative of astronomy is physical cosmology, which aims to study the Universe as a whole. * Closely related to the earth sciences are physical geography and biology. == List of Earth science topics == === Atmosphere === * Atmospheric chemistry * Climatology * Meteorology * Paleoclimatology === Biosphere === * Biogeography * Paleontology ** Micropaleontology === Hydrosphere === * Hydrology ** Limnology * Hydrogeology * Oceanography ** Marine biology ** Paleoceanography ** Physical oceanography === Lithosphere or geosphere === * Geology ** Environmental geology ** Historical geology ** Planetary geology ** Sedimentology ** Stratigraphy ** Structural geology * Geography ** Physical geography * Geochemistry * Geomorphology * Geophysics ** Geodynamics (see also Tectonics) ** Geomagnetics ** Seismology * Glaciology * Mineralogy ** Crystallography * Petrology * Volcanology === Pedosphere === * Soil science === Systems === * Environmental science * Geography * Gaia hypothesis === Others === * Engineering Geology * Geostatistics * Geodesy == References ==",
 "title": "Earth science"
}