{
 "id": "218001",
 "text": "Moritz Wagner (Bayreuth, 3 October 1813 – Munich, 31 May 1887) was a German explorer, collector, geographer and naturalist. Wagner devoted three years (1836–1839) to the exploration of Algiers.Wagner, Moritz 1841. Reisen in der Regentschaft Algier in den Jahren 1836, 1837 und 1838. 3 vols, Leipzig. It was there that he made an important discovery in natural history, which he later developed. His idea, first based on a study of flightless beetles, was that geographical isolation could play a key role in speciation. Although at first rejected, this idea turned out to be important in the theory of evolution. From 1852–1855, together with a companion, Wagner travelled through North and Central America and the Caribbean. In May 1843, Wagner toured the Lake Sevan region of Armenia. In his old age he committed suicide in Munich, aged 73. His brother Rudolf was a physiologist and anatomist. == Wagner's significance == Wagner's early career was as a geographer, and he published a number of geographical books about North Africa, the Middle East, and tropical America. He was also a keen naturalist and collector, and it is for this work he is best known among biologists. Ernst Mayr, the evolutionist and historian of biology, has given an account of Wagner's significance.Mayr E. 1982. The growth of biological thought: diversity, evolution and inheritance. Harvard. p562–565. During his three years in Algeria, Wagner studied (amongst other activities) the flightless beetles Pimelia and Melasoma. Each genus is split into a number of species, each of which is confined to a stretch of the north coast between rivers which descend from the Atlas mountains to the Mediterranean. As soon as one crosses a river, a different but closely related species appears.Wagner M. Reisen in der Regentschaft Algier in den Jahren 1836, 1837 & 1838\\. Voss, Leipzig. p199-200 Wagner was able to make similar observations in the Caucasus and in the Andean valleys, leading him to conclude, after the Origin of Species had been published:Wagner M. 1873. The Darwinian theory and the law of the migration of organisms. Translated by I.L. Laird, London. :\"... an incipient species will only [arise] when a few individuals transgress the limiting borders of their range... the formation of a new race will never succeed... without a long continued separation of the colonists from the other members of their species.\" This was an early description of a process of geographical speciation. Another formulation of this idea came later: \"Organisms which never leave their ancient area of distribution will never change\".Wagner, M. 1889. Die Entstehung der Arten durch räumliche Sonderung. Schwalbe, Basel. p82 This cannot be literally true, and is an overstatement of his idea. The fate of this idea was unhappy. \"Unfortunately, Wagner combined [his idea] with some peculiar ideas on variation and selection\" (Mayr). The leading evolutionists (Darwin, Wallace, Weismann) attacked Wagner's idea of geographic speciation, and it suffered a long decline. However, in 1942 it was reintroduced by Mayr,Mayr E. 1942. Systematics and the origin of species. Columbia, N.Y. and the importance of geographic speciation became one of the core ideas of the evolutionary synthesis.Huxley J.S. 1942. Evolution: the new synthesis. Allen & Unwin, London. == Criticism == Modern experts such as Ernst Mayr, Jerry Coyne & Allen Orr,Coyne J. and Orr, H. Allen 2004. Speciation Sinauer. agree that Wagner first identified geographical speciation. However, his \"migration theory\" was based on a rather simple, Lamarckian idea of evolution. Wagner argued in letters to Darwin that he had missed a vital geographic component in understanding the evolution of new species. Darwin at first responded in a friendly way to these letters, and agreed that geographic isolation was important (although not the only mode of speciation). Later, he found Wagner's increasingly hysterical tone and one-sided argument upsetting, and wrote across his copy of Wagner's 1875 paper \"most wretched rubbish,\" partly because Wagner ignored the importance of natural selection, and lifted parts of Darwin's theory that he liked without attribution, all the while claiming that Darwin's views were incorrect.Sulloway F.J. 1979. Geographic isolation in Darwin's thinking: the vicissitudes of a crucial idea. Studies in the History of Biology 3, p23-65. As well as Darwin, the Reverend J.T. Gulick also found Wagner's theories overstated.,Gulick J.T. 1888. Divergent evolution through cumulative segregation. Journal of the Linnean Society of London (Zoology) 20, p189-274. but in a later paper Gulick says that \"Moritz Wagner, in his Law of the Migration of Organisms, was the first to insist on the importance of geographical isolation as a factor in evolution, but when he asserted that, without geographical isolation, natural selection could have no effect in producing new species, he went beyond what could be sustained by facts\".Gulick J.T. 1908. Isolation and selection in the evolution of species. The need of clear definitions. American Naturalist 42, 493, p48-57. Ernst Mayr's formulation cleared up the issues which Wagner had left unresoved: \"A new species develops if a population which has become isolated from its parental species acquires during this period of isolation characters which promote or guarantee isolation when the external barriers break down\".Mayr E. 1942. Systematics and the origin of species. Columbia, N.Y. p155 The zoological taxonomist Bernhard Rensch was also significant in keeping geographical speciation on the evolutionary menu.Rensch, Bernhard 1929. Das Prinzip geographischer Rassenkreise und das Problem der Artbildung. Bonn.Rensch, Bernhard 1950. Evolution above the species level. Columbia, N.Y. He identified geographical separation as the most frequent initial step towards kladogenesis (species splitting). The importance of Wagner's insight is undeniable today.Schilthuizen M. 2001. Frogs, flies & dandelions: the making of species. Oxford. p34 It was obscured for many years by his other, mistaken, ideas, but it was a genuine natural history insight gained by observation of insects in their natural habitats. :\"It took more than 60 years after 1859 until the leading specialists... [agreed] that this geographical approach was the way to solve the problem of speciation... a new species may evolve when a population acquires isolating mechanisms while isolated from its parent population.\" Mayr, Ernst. 2001. What evolution is. Weidenfeld & Nicolson, London. p175 == Wagner's publications == *Reisen in der Regentschaft Algier in den Jahren 1836, 1837 und 1838. 3 Bde. Leipzig 1841. *Der kaukasus und das Land der Kosaken. 2 Bde. Leipzig 1847. *Reise nach Kolchis. Leipzig 1850. *Reise nach dem Ararat und dem Hochlande Armeniens. Stuttgart 1848. *Reise nach Persien und dem Lande der Kurden. 2 Bde. Leipzig 1851. *Die Republik Costa-Rica. Leipzig 1856. *Über die hydrogaphischen Verhältnisse und das Vorkommen der Süßwasserfische in den Staaten Panama und Ecuador. Abhandlungen der königlich bayerischen Akademie der Wissenschaften, II Classe 11 (I Abt.) *Reisen in Nordamerika in den Jahren 1852 und 1853. (with Carl Scherzer) 3 vols, Gotha 1861. *Die Darwinsche Theorie und das Migrationsgesetz der Organismen. Leipzig 1868. English edition: Wagner M. 1873. The Darwinian theory and the law of the migration of organisms. Translated by I.L. Laird, London. *Naturwissenschaftliche Reisen im tropischen Amerika. Stuttgart 1870. *Über den Einfluß der geographischen Isolierung und Kolonienbildung auf die morphologischen Veränderungen der Organismen. München 1871. *Die Entstehung der Arten durch räumliche Sonderung. [The origin of species by spacial separation] Gesammelte Aufsätze. Benno Schwalbe, Basel 1889. == References == == Other websites == * Short biography (in German) Category:1813 births Category:1887 deaths Category:German naturalists Category:German evolutionary biologists Category:German explorers",
 "title": "Moritz Wagner"
}