{
 "id": "218046",
 "text": "The Carboniferous was the geological period after the Devonian and before the Permian. It lasted from about 359 to about 299 million years ago. It is the fifth period of the Paleozoic era and the Phanerozoic eon. In the U.S.A. the Carboniferous is divided into the Mississippian (lower part, 359–323.2 mya) and the Pennsylvanian (upper part, 323.2–299 mya). In Europe the terms lower, middle and upper are used. == Vertebrate evolution == The early tetrapods were the amphibians, which laid their eggs in water, and the amniotes, who laid their cleidoic eggs on land. The amniotes gave rise to two groups: one was the synapsids, which eventually gave rise to the mammals. The second group, the sauropsids, later gave rise to the dinosaurs and other reptiles. We now know that this group includes the birds. These events took place in the lower (older) part of the Carboniferous, the Mississippian.Clack, Jennifer A. 2002. Gaining ground: the origin and evolution of tetrapods. Indiana University Press, Bloomington IN. == Invertebrates == Fossils of air-breathing insects myriapods and arachnids are known from the late Carboniferous, but so far not from the early Carboniferous. These arthropods were both well-developed and numerous. Their large size might have something to do with the fact that the oxygen concentration in the Earth's atmosphere in the Carboniferous was much higher than today. This required less effort for respiration and allowed arthropods to grow larger. The up to millipede-like Arthropleura was the largest-known land invertebrate of all time. Among the insect groups are the huge predatory Protodonata, among which was Meganeura, a giant dragonfly-like insect and with a wingspan of ca. —the largest flying insect ever to roam the planet. Many insects have been found in the coalfields of Saarbrücken and Commentry, and within the hollow trunks of fossil trees in Nova Scotia. Some British coalfields have yielded good specimens: Archaeoptilus, from the Derbyshire coalfield, had a large wing with preserved part, and some specimens (Brodia) still show traces of brilliant wing colors. Land snails (Archaeozonites, Dendropupa) have been found in the Nova Scotian tree trunks mentioned above. File:Meganeura monyi au Museum de Toulouse.jpg|The late Carboniferous giant dragonfly-like insect Meganeura grew to wingspans of . File:20210116 Pulmonoscorpius kirktonensis.png|The gigantic Pulmonoscorpius from the early Carboniferous reached a length of up to . File:Arthropleura reconstruction.png|Arthropleura was a giant millipede that fed on the Carboniferous plants. At 8 feet long, it was the largest terrestrial arthropod that ever lived. File:Mazothairos1.jpg|Mazothairos was a large palaeodictyopteran insect from the Mazon Creek fossil beds. File:Helenodora inopinata.jpg|Helenodora inopinata, an onychophoran File:Blattoidae - Fossil.JPG|A cockroach found in Carboniferous rocks of France File:20201202 Maiocercus celticus.png|Maiocercus was a arachnid from the UK about 310 million years ago. == Coal == The Carboniferous is named after the coal measures, the remains of peat formed by dense tropical wetland forests. New kinds of vascular plants with thick bark grew in the forests. Much of the coal came from this bark. This biota occurred in the upper part of the period, the Pennsylvanian, from 315 to 300 million years years ago. These forests were on the equator, and the wetlands, which are always low-lying, stretched across the supercontinent of Laurussia. This included what is now North America in the west, through what is now Europe to China in the east. The river plain which was the heart of the wetland stretched 5000 km from eastern Canada to Ukraine, and was 700 km wide.Thomas B.A. & Cleal C.J. 1993. The coal measure forests. National Museum of Wales.p6 In the Carboniferous, the great tropical rainforests of Euramerica supported towering lycopodiophyta, and a mix of vegetation, as well as a great diversity of animal life: giant dragonflies, millipedes, cockroaches, amphibians, and the first amniotes. This kind of climate and geography has no exact parallel today, but the peat swamp forests in Indonesia and Malaysia, the Amazon Basin, the Mississippi River system and the Okefenokee swamp give some idea. The swamps were dominated by giant clubmosses, including Lepidodendron.Cleal C.J. & Thomas B.A. 1994. Plants of the British coal measures. The Palaeontological Association. They were the earliest trees, later replaced by conifers and flowering plants. Sometimes other plants from the levee got swept down by the river, such as horsetails, ferns and tree-like pteridosperms. The wetland forest climates shifted when the land level was raised by the pressure of the Gondwana continent against Laurussia. This caused the zone of contact between the continents to rise. The end of the coal measures marks the end of the Carboniferous period. China was too far away to be affected. There, the wetland forests continued for another 50 million years, into the Permian.p30 == References == *",
 "title": "Carboniferous"
}