{
 "id": "218052",
 "text": "The Mesozoic Era was the geological era in which dinosaurs lived, as well as the first mammals. It lasted about 186 million years, starting 252.2 mya (million years ago) with the P/Tr extinction and ending 65 mya with the K/T extinction (the one that killed all dinosaurs except birds).Gradstein, Felix M. James G. Ogg, Alan G. Smith (eds) 2005. A geologic time scale 2004. Cambridge University Press. Dinosaurs appeared around 231 mya (21 million years after the beginning of the Mesozoic). They evolved from the reptiles called archosaurs. Modern birds and crocodiles are part of that group. Although mammals originated in the Upper Triassic, they did not live like dinosaurs. Mammals spent most of the long Jurassic and Cretaceous periods as small nocturnal animals living mainly in forests. Most lost their color vision. Mammals today have some color vision. Most have red-green color blindness, with only two types of cone cells. Some primates evolved a third type of cone cell, which gives them trichromacy. Color is needed in forests to spot ripe fruit. The Mesozoic is the middle of the three eras that make up the Phanerozoic eon. Before the Mesozoic was the Palaeozoic era. The K/T extinction in 65 mya also marks the beginning of the Cenozoic era, the one we live in. The three Mesozoic periods were: * Triassic (252–201 mya) **Lower Triassic (252–247 mya) **Middle Triassic (247–237 mya) **Upper Triassic (237–201 mya) * Jurassic (201–145 mya) **Lower Jurassic (201–176 mya) **Middle Jurassic (176–161 mya) **Upper Jurassic (161–145 mya) * Cretaceous (145–66 mya) **Lower Cretaceous (145–100 mya) **Upper Cretaceous (100–65 mya) == Ecology == The ecology of this world was quite different to that of the Pleistocene, the relatively cold era in which humans evolved and live. The Mesozoic was a much warmer world, with a higher temperature, and a higher sea level. There was little or no ice at the poles and the continents had large areas covered with shallow continental seas.Van Andel, Tjeerd H. 2nd ed 1994. New views on an old planet. Cambridge University Press. ISBN 0-521-44755-0 Moreover, the continents were quite near each other, or actually touching. Many land animals could walk or swim to other continents. The Mesozoic started with all the continents together in Pangaea. They began to split apart in early Middle Jurassic times and stayed pretty close for the rest of the Mesozoic. Textbooks have always described how the Mesozoic was the age of the dinosaurs,Benton, Michael J. 2015. Vertebrate palaeontology, 4th ed. Wiley Blackwell 10.3 Mesozoic world, p204. ISBN 978-1-118-40684-7 and now we know birds descended from land dinosaurs. It was the age, too, of extraordinary marine reptiles. Mammals were mainly small nocturnal animals which scurried around in the night-times of the great forests. We know from their loss of color vision (which is trichromatic in fish and reptiles) that mammals lived a nocturnal life. === Plants === For most of the Mesozoic, the plants were different from those of today. Only in the Upper Cretaceous do we find flowering plants of the modern kind. Before then ferns, cycads and conifers covered the land. They were the typical food of the huge vegetarian dinosaurs. Horsetails like Equisetum formed the understory of the huge conifer forests.Husby, Chad E.; Walkowiak, Radosław J. (2012). Zawada, Beth (ed.). \"An Introduction to the Genus Equisetum (Horsetail) and the Class Equisetopsida (Sphenopsida) as a whole\" (PDF). IEA Paper. International Equisetological Association. == References == Category:Mesozoic",
 "title": "Mesozoic"
}