{
 "id": "218020",
 "text": "thumb|Chiniquodon, an Upper Triassic cynodont, close to the ancestry of mammals. Museum of Paleontology, Tübingen thumb|Bienotherium, a Lower Jurassic tritylodont from China Mammal-like reptile is an old term for the therapsids: those synapsids which gave rise to the true mammals. The term is both outmoded and a mistake, because mammals did not descend from reptiles. Both groups descended from early amniotes (egg-laying tetrapods), probably in the Lower or Middle Carboniferous.Clack, Jennifer 2012. Gaining ground: the origin and early evolution of tetrapods. 2nd ed, Bloominton, Indiana: Indiana University Press, Chapter 8, p295. , () The precursors of reptiles are called sauropsids, and the precursors of mammals are called synapsids. The immediate ancestors of the mammals came from a group of therapsids called the cynodonts.Benton, Michael J. 2005. Vertebrate paleontology, 3rd ed. Blackwell, Oxford: chapter 10, The mammals. Prothero, Donald R. 2007. Evolution: what the fossils say and why it matters. New York: Columbia University Press, Chapter 13, 271280, especially p274/5. == Mammals and reptiles == There are a number of characteristics which cannot be seen on fossils, but which are of great importance. Mammals are distinguished from reptiles by fundamental differences in the development of the blood system.Goodrich E.S. 1930. Studies on the structure and development of Vertebrates. Macmillan, London.Kermack D.M. & K.A. 1984. The evolution of mamalian characters. Croom Helm, London. p6/7 These differences are such that it would be almost impossible for mammals to be derived from reptiles. :\"It is clearly quite impossible for the condition found in birds and modern reptiles to have arisen from that found in mammals or vice versa\". Kermack.6 This supports the division of amniotes into sauropsida and synapsida. == References == Category:Paleontology Category:Taxonomy Category:Therapsids Category:Mammals",
 "title": "Mammal-like reptile"
}