{
 "id": "218165",
 "text": "The Archaean (or Archean) eon is the geological period after the Hadean and before the Proterozoic. It is one of the four main time periods (eons) of Earth history. The Archaean lasted from 4,000 million years ago (mya) to 2,500 mya. It contains the first sedimentary rocks, and the first fossil life forms, which were cyanobacteria,Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton, N.J. and acritarchs.Buick R. 2010. Early life: ancient acritarchs. Nature 463: 885–886. doi:10.1038/463885a. PMID 20164911. Most of the rocks which survive are volcanic (igneous) and metamorphic in origin. Volcanic activity was everywhere. When the Archaean began, the Earth's heat flow was nearly three times higher than it is today. It was still twice the current level when the Archaean ended, 2,500 mya. This high level of heat flow may have made plate tectonics more vigorous than today. The question of when plate tectonics began is a major research area.Stanley, Steven M. 1999. Earth system history. New York: Freeman. p297-301 The large supercontinent Vaalbara formed in the Archaean. There were oceans already, before the Archaean. The atmosphere almost entirely lacked free oxygen, and instead, it was mostly methane and CO2. Fossil bacterial mats, called stromatolites, are found throughout the Archaean after about 3,500mya. These were formed by cyanobacteria, which used photosynthesis and gave off oxygen as a by-product.Schopf J.W. 1992. Geology and paleobiology of the Archaean Earth, in Schopf J.W., and Klein C. The Proterozoic biosphere: a multidisciplinary study, Cambridge University Press. Initially, this oxygen was absorbed by combining with iron ions in solution. Not until much later did oxygen build up in the atmosphere.see Great Oxygenation Event Fossil raindrop marks have been found in the later Archaean, 2,700 mya.Amos, Jonathan 2012. Fossil raindrops probe ancient atmosphere. BBC News: Science & Environment. The rocks were discovered in Ventersdorp in the North West Province of South Africa in the 1980s. == Related pages == * Life timeline == References == Category:Archaean",
 "title": "Archaean"
}