{
 "id": "218185",
 "text": "The Permian is a geological period which started about 299 million years ago (mya), and ended about 252 mya. It is the sixth and last period of the Paleozoic era and the sixth period in the Phanerozoic eon, and ended in the largest mass extinction known to science. == Data == *Oxygen content of atmosphere: 23% (115% of modern level). *Average CO2 content: 900 ppm (3 times pre-industrial level) *Average surface temperature: ~16oC (2oC above modern level) *Sea level: 60 metres above present day level; plummeting during the middle Permian to a constant minus 20 m in the late Permian. == Climate == The climate in the Permian was quite varied. At the start of the Permian, the Earth was still at the grip of an ice age from the Carboniferous. Glaciers receded in the mid-Permian period as the climate gradually warmed, drying the continent's interiors. In the late Permian period, the drying continued although the temperature cycled between warm and cool cycles. == Life == During the Permian, tetrapod life, (amphibians, Sauropsids and Synapsids) which evolved in the Carboniferous, became widespread and diverse. The first modern trees (conifers, ginkgos and cycads) appeared in the Permian.Levin, Harold L. 2005. The Earth through time. 8th ed, Wiley, N.Y. Chapter 4: The fossil record. === Insects === The Permian was also a period of adaptive radiation in insects. Beetles (Coleoptera) appeared; so did flies (Diptera). 22 out of a total of 36 known orders of insects are known from the Permian. Some became extinct in the end-Permian event, but more radiation followed in the Mesozoic. Insects were probably, by the end of the Permian, the largest phylum,or class, depending on how they are classified. in terms of number of species.Wooton R.J. 1990. Major insect radiations. In P.D. Taylor & G.P. Larwood eds. Major evolutionary radiations. Oxford. Early relatives of cockroaches (Blattopterans) were the most common insects.Zimmerman E.C. 1948. Insects of Hawaii. vol II, Univ. Hawaii Press and dragonflies ruled the air. True Odonata appeared in the Permian.Grzimek, Bernhard (ed) 1975. Grzimek's animal life encyclopedia, vol 22 Insects. Van Nostrand Reinhold, N.Y.Riek E.F. & Kukalova-Peck J. 1984. A new interpretation of dragonfly wing venation based on early Upper Carboniferous fossils from Argentina (Insecta: Odonatoida) and basic character states in pterygote wings. Can. J. Zool. 62; 1150-1160. == Pangaea == All the major land masses were collected together in the super- continent Pangaea. At the end of the period, the greatest flood basalt lava flows in the Phanerozoic raised world temperatures, and damaged the environment. These formed the extensive Siberian traps. The causes of the Permian/Triassic extinction event are not yet agreed between scientists.Erwin D.H. 1993. The great Palaeozoic crisis: life & death in the Permian. Columbia, N.Y. Trilobites, once a dominant life-form in the ocean, became extinct, together with 90% of all marine species. == References ==",
 "title": "Permian"
}