{
 "id": "218440",
 "text": "[[File:Paul Cézanne, Les joueurs de carte (1892-95).jpg|thumb|The Card Players, an iconic work by Cézanne (1892). As of 2021, one of the versions of the painting had previously been sold for a price that made it one of the 7th most expensive paintings ever.https://www.kooness.com/posts/magazine/most- expensive-paintings-ever-sold-here-are-the-top-10. \"As previously stated, there have been many paintings sold privately for higher prices than some of those on our list, so here is briefly listed the few works from some of the biggest names in art history that would lie between our Nos. 2 and 1. [...] $180 million [...] $186 million [...] $200 million [...] $210 million [...] Paul Cézanne's \"The Card Players\" — $250 million [...] $300 million\"]] Paul Cézanne (19 January 1839 – 22 October 1906) was a French painter. He was born in Aix-en-Provence, in the south of France, and died of pneumonia there. The artistic career of Paul Cézanne lasted more than forty years, from roughly 1860 to 1906. A busy artist, he produced more than 900 oil paintings and 400 watercolours, including many incomplete works. Cézanne's work is broadly post- impressionist. His work helped change the 19th-century idea of art to the very different world of art in the 20th century. Cézanne's work is the bridge between late 19th-century Impressionism and the early 20th-century Cubism. The line attributed to both Matisse and Picasso that \"Cézanne is the father of us all\" is significant. Cézanne's work shows a mastery of design, colour and composition. His brushstrokes are clearly recognizable. He used planes of colour and small brushstrokes that build up to form complex fields. The paintings reveal Cézanne's intense study of his subjects, a searching gaze, and a struggle to deal with the complexity of human visual perception. Cézanne's The Card Players (1882) is at present the world's most expensive painting. It was sold for more than $250 million in 2011 to the royal family of Qatar. What makes this all the more remarkable is that there are four other Cézanne 'Card Players'. They are in the collections of the Metropolitan Museum of Art, the Musée d’Orsay, the Courtauld, and the Barnes Foundation. His best friend was Emile Zola. ==Cézanne the artist== In Paris, Cézanne met the Impressionist Camille Pissarro in the mid-1860s. Initially the friendship was that of master and disciple, with Pissarro having an influence on the younger artist. Over the course time their landscape painting trips, in Louveciennes and Pontoise, led to a working relationship between equals. Cézanne's early work is often concerned with the figure in the landscape, imaginatively painted. Later in his career, he became more interested in working from direct observation and gradually developed a light, airy painting style that was to influence the Impressionists enormously. In Cézanne's mature work we see the development of a solidified, almost architectural style of painting. He ordered whatever he saw into simple forms and colour planes. His statement \"I want to make of impressionism something solid and lasting like the art in the museums\",Paul Cézanne, Letters, edited by John Rewald, 1984. and his contention that he was recreating Poussin \"after nature\" proved his desire to unite observation of nature with the permanence of classical composition. Many of his paintings show people bathing, with the Montagne Sainte-Victoire in the background. These mountains are situated east of Aix-en-Provence. He also painted many still lifes, and portraits of his wife, with these mountains. His colleagues included Pissarro, Monet and Renoir. Ambroise Vollard, an art critic with a gallery, was among the first people who bought Cézanne's artworks. In 1895, Vollard had the first exhibition showing Cézanne's works in his gallery, in Paris. Cézanne's work influenced other artists, especially Pablo Picasso and Georges Braque, who started Cubism, as well as Henri Matisse. Paul Cézanne can also be seen as a post-impressionist, who helped shape modernism in painting. Paul Cézanne painted over 900 oil paintings and 400 watercolours, over 200 of them being still life paintings. == Related pages == * List of French painters == References == Category:1839 births Category:1906 deaths Category:People from Aix-en-Provence Category:French painters",
 "title": "Paul Cézanne"
}