{
 "id": "218556",
 "text": "The Permian/Triassic extinction event was the largest extinction event in the Phanerozoic eon.Benton M.J. 2004. When life nearly died: the greatest mass extinction of all time. London: Thames & Hudson. ISBN 978-0500285732Erwin D.H. 2006. Extinction: how life on early Earth nearly ended 250 million years ago. Princeton University Press, Princeton. 57% of all biological families, 83% of all genera, 96% of all marine species became extinct. This includes many fish and the last surviving trilobites, 70% of all terrestrial vertebrates and many of the large amphibia, primitive reptiles and synapsids. It is the only known extinction event of insects. It ended the Palaeozoic era, and began the Mesozoic era. The event forms the boundary between the Permian and Triassic periods, at about 252 million years ago.International Stratigraphic ChartSole R.V. and Newman M. 2002. Extinctions and biodiversity in the fossil record: volume 2, The Earth system: biological and ecological dimensions of global environment change. pp297-391 in the Encyclopedia of global environmental change Wiley. Because so much biodiversity was lost, the recovery of life on Earth took much longer than after other extinction events. This event has been described as the \"mother of all mass extinctions\". The pattern of extinction is still unclear.Yin H, Zhang K, Tong J, Yang Z, Wu S. The Global Stratotype Section and Point (GSSP) of the Permian-Triassic Boundary. Episodes 24 (2): 102–114. Different studies suggest one to three separate pulses.Yin HF, Sweets WC, Yang ZY, Dickins JM. 1992. Permo-Triassic events in the eastern Tethys. Cambridge University. Press, Cambridge. There are several proposed mechanisms for the extinctions. These include: large or multiple meteorite impacts, increased volcanism, sudden release of methane hydrates from the sea floor. Gradual changes include sea level change, oceanic anoxic events, increasing aridity, and a shift in ocean circulation driven by climate change. One thing is probably significant. One of the largest ever flood basalt eruptions took place across the P/Tr junction. These eruptions, from 251 to 250 million years ago, produced the Siberian Traps, a huge volcanic province in Siberia. This would certainly have made the world's climate much worse, and is now thought to be the main cause of this great extinction.Sahney, Sarda and Benton, Michael J. 2008. Recovery from the most profound mass extinction of all time. Proceedings of the Royal Society series B, 275, 759-765. Another factor is that global sea levels were at an historic low point at the time. Lastly, it should be remembered that Pangaea was in existence: volcanic eruptions would affect all lands, continental shelves and ocean floors near the continents. ==Related pages== * List of extinction events == References == Category:Meteorites Category:Extinction events",
 "title": "Permian–Triassic extinction event"
}