{
 "id": "218527",
 "text": "The Eocene was the second geological epoch in the Palaeogene, and by far the longest.Kennet J.P. & Stott L.D. 1995. Terminal Paleocene mass extinction in the deep sea: association with global warming. Effects of past global change on life: studies in geophysics. National Academy of Sciences. It began 56 million years ago, and ended 33.9 million years ago with a global warming crisis. Before the period was the Palaeocene, and after the time was the Oligocene, the time where paraceratheres, indricotheres, entelodonts, hyaenodonts, archaeotheres, chalicotheres, arsinoitheres and cynodictids were the main animals. The Eocene, like the Palaeocene before it, had a climate much warmer than today. At the start of the Eocene, the Palaeocene–Eocene Thermal Maximum was reached. This lasted for 100,000 years, and caused a large extinction event. The land was heavily forested, with temperate forests into Arctic and Antarctic regions. The many herbivorous mammals were browsers, not grazers. All the members of the new mammal orders were small, under 10 kg. Eocene mammals were only 60% of the size of the primitive Palaeocene mammals that came before them. They were also smaller than the mammals that followed them. The main animals of the time included Propalaeotherium, Leptictidium, Ambulocetus, Pristichampsus, Gastornis and Hyracotherium. The end of the Eocene was the beginning of the Oligocene (33.9 million years ago). Many plant and animal species went extinct. This was the Eocene–Oligocene extinction event. The extinction event was probably caused by meteorite strikes in Siberia and Chesapeake Bay. The fauna of this timeline included basilosaurs, arsinoitheres, dorudonts, andrewsarchids, paraceratheres, indricotheres, uintatheres, hyaenodonts, embolotheres, brontotheres and moeritheres. == Swamp forests == Tropical peatlands coexist with swamp forests in the Eocene. This is the most recent period which has left us coal measures. It was so hot in the Eocene that there was a high level of plant growth. Polar forests were quite extensive.Speelman E.N. et al 2009. The Eocene Arctic Azolla bloom: environmental conditions, productivity, and carbon drawdown\". Geobiology. 7 (2): 155–170. Fossils and preserved remains of trees such as swamp cypress and dawn redwood from the Eocene have been found on Ellesmere Island in the Arctic. The end-Eocene flora and some of its fauna is well seen at Florissant Fossil Beds National Monument, Rocky Mountains, Colorado.Meyer H.M. 2003. The fossils of Florissant. Smithsonian Books. ISBN 1-5834-107-0 == References == Category:Eocene Category:Cainozoic",
 "title": "Eocene"
}