{
 "id": "218621",
 "text": "An extinction event is a relatively fast drop in the number of species living on Earth. It occurs when the rate of extinction increases more than the rate of speciation. This is a list of the largest. Major extinction events are important to both geology and evolution.Huggett, Richard J. 1997. Catastrophism. new ed. Verso.Elewa A.M.T. (ed) 2008. Mass extinctions. Springer, Berlin. == The Phanerozoic == There are five major extinction events in the Phanerozoic eon, and many smaller events.Hallam A. and Wignall P.B. 1997. Mass extinctions and their aftermath. Oxford. In order of time, latest first: 1\\. K/T extinction event. The Cretaceous/Tertiary extinction event ended the Mesozoic era and started the Cainozoic era. 2\\. End–Triassic extinction event or events.Benton M.J. 1991. What really happened in the Late Triassic? Historical biology 5, 263–278.Benton M.J. 1995. Diversification and extinction in the history of life. Science 268, 52–58. 3\\. P/Tr extinction event. The Permian/Triassic extinction event ended the Palaeozoic era and started the Mesozoic era.Benton M.J. 2005. When life nearly died: the greatest mass extinction of all time. Thames & Hudson, London. isbn=978-0500285732Erwin DH 1993. The great Paleozoic crisis; life and death in the Permian Columbia, N.Y. isbn=0231074670 4\\. Late Devonian extinctions, at the Frasnian/Famennian junction.McGhee, George R. Jr 1996. The Late Devonian mass extinction: the Frasnian/Famennian crisis. Columbia, N.Y. 5\\. End–Ordovician extinction event. After a series of lesser events, the end-Ordovician extinction resulted in an estimated 84% species loss.Jablonski D. 1994. Extinctions in the fossil record. Phil Trans Roy Soc B344, 11–17. Other extinction events in the Phanerozoic had a significant impact on the evolution of the biota. Overall, it seems that climate changes caused some extinctions, and hits by asteroids sometimes caused extinctions. Before the Phanerozoic eon, there were even larger extinction events, which are often forgotten: *The formation of the moon by a planet-sized body striking the Earth would probably have eliminated any early forms of life. *Pre-Palaeozoic ice ages would have been extinction events. They were: **The Huronian 2.5 to 2.2 billion years ago. **The Cryogenian which lasted for the whole of the second period of the Neoproterozoic. == References == * Category:Science-related lists",
 "title": "List of extinction events"
}