{
 "id": "218663",
 "text": "The Ediacaran biota are the fauna of the Ediacaran period. This geological period was from 635–542 million years ago, but the fossil biota was only from 575–542 million years ago. This was after a series of ice ages and just before the Cambrian period. The biota consists of soft-bodied multicellular organisms, probably animals, which left trace fossils in rocks of Ediacaran age. The biota is quite unusual, and there is no sign of it in the earlier Marinoan glaciation. The biota appears to suffer a fairly severe extinction event at the boundary with the Cambrian. Some of the biota may have survived into the early Cambrian.Bottjer, David J. 2002. Enigmatic Ediacaran fossils: ancestors or aliens? In Bottjer D.J. et al. (eds) Exceptional fossil preservation: a unique view on the evolution of marine life. Columbia, New York. p12 == Interpretation == There have been several different interpretations of the biota. The standard view is that the traces are fossils of well-known phyla (Cnidaria, annelids, early arthropods) with body plans that disappeared before the Cambrian.Hallam A. and Wignall P.B. 1997. Mass extinctions and their aftermath. Oxford.p27Glaessner M.F. 1984. The dawn of animal life. Cambridge. Quite different ideas have been put forward. Seilacher thought few if any of the forms belonged to living phyla.Seilacher A. 1984. Late Precambrian and early Cambrian metazoa: preservational or real extinctions? In Patterns of change in Earth evolution eds Holland H.D & Trendall A.F. Springer-Verlag, Berlin. Conway Morris opposed this idea.Conway Morris S. 1993. Ediacara-like fossils in Cambrian Burgess Shale-type faunas of North America. Palaeontology 36, 791–833. Rentallak suggested the biota might be lichens.Rentallak G.J. 1994. Were the Ediacara fossils lichens? Palaeobiology 20, 523–544. As Narbonne explains, the Ediacaran biota occupies a critical position in the fossil record. Before them, for a long period of the Archaean and most of the Protoerozoic, the only fossils were those of bacteria and bacterial mats, a form of life which continues to the present day.Narbonne Guy M 1998. The Ediacara biota: a terminal Neoproterozoic experiment in the evolution of life. GSA Today 8, #2, p1–6. The Ediacaran biota is found worldwide, and the most typical forms disappeared just before the Cambrian radiation, which begins with the 'small shelly fossils'. That is probably enough to justify the description of the change as an extinction event, though what caused it is not clear. One suggestion is that the evolution of animals which grazed upon the soft-bodied forms would have been sufficient to cause a collapse of the biota. The biota was extremely varied, having many different body forms, and hence species. The ecology was benthic (sea bottom), in both shallow and deeper water. Narbonne notes the absence of different life and different depths, the apparent absence of burrowing organisms, and the absence of animals capable of preying on the soft-bodied forms. If these conditions changed, the soft forms would be in peril.p6 == Assemblages == Ediacaran-type fossils are recognised globally in 25 localities,Reprint, 2004 original available here (PDF). and a variety of depositional conditions, and are commonly grouped into three main types, named after typical localities. Each assemblage occupies its own habitat, and after a burst of diversification changes little for the rest of its existence. * The Avalon-type assemblage is defined at Mistaken Point Ecological Reserve in Newfoundland, Canada, the oldest locality with a large quantity of Ediacaran fossils.Benus 1988. Trace fossils, small shelly fossils and the Precambrian- Cambrian boundary. New York State Museum Bulletin 463, University of the State of New York. * Ediacara-type assemblage: the Ediacara-type assemblage consists of fossils preserved in areas near the mouths of rivers (prodeltaic). They are found in interbedded sandy and silty layers formed below the normal base of wave-related water motion, in waters shallow enough to be affected by wave motion during storms. Most fossils are preserved as imprints in microbial mats, but a few are preserved within sandy units. * Nama-type assemblage: the Nama assemblage is best represented in Namibia. Three-dimensional preservation is most common, with organisms preserved in sandy beds containing internal bedding. === Significance of assemblages === In the White Sea region of Russia, all three assemblage types have been found close together. This, and the faunas' overlap in time, makes it unlikely that they represent evolutionary stages. Since they are found on all continents except Antarctica, geographical boundaries do not appear to be a factor. The same fossils are found at all palæolatitudes.the latitude where the fossil was created, accounting for continental drift Probably the three assemblages mark organisms adapted to survival in different environments. An analysis of one of the White Sea fossil beds, where the layers cycle from continental seabed to inter-tidal to estuarine and back again a few times, found that a specific set of Ediacaran organisms was associated with each environment. It is no surprise that not all environments are exploited. Of 92 possible modes of life — combinations of feeding style, tiering and motility — no more than a dozen are occupied by the end of the Ediacaran. Just four are represented in the Avalon assemblage. The lack of large-scale predation and vertical burrowing are perhaps the most significant factors limiting the ecological diversity; the emergence of these during the early Cambrian allowed the number of lifestyles occupied to rise to 30. == Related pages == *Lagerstätte *Fezouata formation *Mistaken Point Ecological Reserve == References == Category:Invertebrates Category:Lagerstätten Category:Ediacaran",
 "title": "Ediacaran biota"
}