{
 "id": "21874",
 "text": "Kyrgyzstan, officially the Kyrgyz Republic, is a country in Central Asia. The country is landlocked (has no coast) and mountainous. It has borders with China, Kazakhstan, Tajikistan, and Uzbekistan. Its capital is Bishkek. It was a socialist republic of the Soviet Union, but became independent in 1991. The country was peaceful in the 1990s. Its president, Askar Akayev showed an autocratic and authoritarian character. Russian is spoken as an official language at state level. In 2005, there was an unexpected revolution after the elections of parliament (the legislature) in March. President Akayev resigned on April 4 of that year. Opposition leaders formed a coalition (a group from more than one party), and a new government was formed, led by President Kurmanbek Bakiyev and Prime Minister Feliks Kulov. At the moment, different political groups are fighting for power in the republic. Three of the 75 elected members of Parliament have been murdered. Kyrgyzstan’s main religion is Islam. ==Geography== Kyrgyzstan is a landlocked country in Central Asia. It is farther from the ocean than any other country in the world. It borders Kazakhstan, China, Tajikistan and Uzbekistan. Mountains cover over 80% of the country. The land area of Kyrgyzstan is just a little bigger than the state of Nebraska. Issyk-Kul Lake is the largest lake in Kyrgyzstan. It is the largest mountain lake in Asia and the second largest mountain lake in the world after Titicaca. Peak Jengish Chokusu, at 7,439 m (24,406 ft), is the highest point. The highest peaks are in the Kakshaal-Too range. Bishkek, the capital city, is in the north. It is largest city in Kyrgyzstan. The second largest is the ancient town of Osh. ===Cities=== Name Kyrgyz name Oblast Population 1999 census results, as taken from the German wikipedia article Liste der Städte in Kirgisistan. Numbers in italics are 2008 estimates, taken from . Type Balykchy Балыкчы Issyk Kul 41,342 city Batken Баткен Batken 10,987 city Bishkek Бишкек - 750,327 city Cholpon-Ata Чолпоната Issyk Kul 8,851 city Isfana Исфана Batken 16,850 city Jalal-Abad Жалалабат Jalal-Abad 70,401 city Kant Кант Chuy 22,075 city Kara-Balta Карабалта Chuy 47,159 city Karakol Каракол Issyk Kul 64,322 city Karaköl Каракөл Jalal-Abad 17,977 city Kara-Suu Карасуу Osh 19,143 city Kerben Кербен Jalal-Abad n/a city Kochkor-Ata Кочкората Jalal-Abad 16,104 city Kökjanggak Көкжаңгак Jalal-Abad 10,727 city Kyzyl-Kiya Кызылкыя Batken 31,844 city Mailuu-Suu Майлуусуу Jalal-Abad 20,365 city Naryn Нарын Naryn 40,050 city Nookat Ноокат Osh n/a city Osh Oш Osh 208,520 city Shopokov Шопоков Chuy 9,133 city Sulyukta Сүлүктү Batken 14,145 city Talas Tалас Talas 32,638 city Tashkömür Ташкөмүр Jalal-Abad 23,331 city Tokmok Tокмок Chuy 59,409 city Uzgen Өзгөн Osh 41,497 city ==Economy== Kyrgyzstan was the second poorest country in the former Soviet Union next to Tajikistan. Now it is the second poorest country in Central Asia. Agriculture is an important part of the economy in Kyrgyzstan. Much farming is still being done by hand and by horse. Main crops include wheat, sugar beets, potatoes, cotton, tobacco, vegetables, and fruit. Kyrgyzstan is rich in mineral resources. It has small petroleum and natural gas reserves. Among its mineral reserves are solid amount of coal, gold, uranium, antimony and other metals but not iron. Metallurgy is an important industry. Imports include petroleum and natural gas, ferrous metals, chemicals, most machinery, wood and paper products, food and construction materials. Its trade partners are Germany, Russia, China, Kazakhstan, and Uzbekistan. ==Related pages== *Kyrgyzstan at the Olympics *Kyrgyzstan national football team *List of rivers of Kyrgyzstan ==References== Category:Members of the Organisation of Islamic Cooperation",
 "title": "Kyrgyzstan"
}