{
 "id": "218800",
 "text": "This is a list of Scottish football stadia, ranked in descending order of capacity. Rank Stadium Location Capacity Home team 1 Celtic Park Glasgow 60,832 Celtic 2 Hampden Park Glasgow 52,025 Queen's Park and Scotland 3 Ibrox Glasgow 51,082 Rangers 4 Pittodrie Aberdeen 22,199 Aberdeen 5 Easter Road Edinburgh 20,421 Hibernian 6 Tynecastle Park Edinburgh 20,099 Hearts 7 Rugby Park Kilmarnock 18,128 Kilmarnock 8 Tannadice Dundee 14,209 Dundee United 9 Fir Park Motherwell 13,742 Motherwell 10 Somerset Park Ayr 12,175 Ayr United 11 Dens Park Dundee 12,085 Dundee 12 Cappielow Greenock 12,011 Greenock Morton 13 Lesser Hampden Glasgow 12,000 Queen's Park youth 14 East End Park Dunfermline 11,904 Dunfermline Athletic 15 Firhill Stadium Glasgow 10,887 Partick Thistle 16 McDiarmid Park Perth 10,673 St. Johnstone 17 Excelsior Stadium Airdrie 10,171 Airdrieonians 18 Starks Park Kirkcaldy 10,104 Raith Rovers 19 Almondvale Livingston 10,016 Livingston 20 The Falkirk Stadium Falkirk 9,706 Falkirk 21 St. Mirren Park Paisley 8,023 St. Mirren 22 Broadwood Stadium Cumbernauld 8,006 No SPFL club 23 Caledonian Stadium Inverness 7,500 Inverness CT 24 Gayfield Park Arbroath 6,488 Arbroath 25 Palmerston Park Dumfries 6,412 Queen of the South 26 Mosset Park Forres 6,000 Forres Mechanics* 27 New Douglas Park Hamilton 6,000 Hamilton Academical 28 Victoria Park Dingwall 5,800 Ross County 29 Stair Park Stranraer 5,600 Stranraer 30 Station Park Forfar 5,177 Forfar Athletic 31 Victoria Park Buckie 5,000 Buckie Thistle* 32 Christie Park Huntly 4,500 Huntly* 33 Kynoch Park Keith 4,450 Keith* 34 Central Park Cowdenbeath 4,370 Cowdenbeath 35 Shielfield Park Berwick 4,131 Berwick Rangers 36 Dudgeon Park Brora 4,000 Brora Rangers* 37 Balmoor Peterhead 4,000 Peterhead 38 Claggan Park Fort William 4,000 Fort William* 39 Hannah Park Shotts 4,000 Shotts Bon Accord* 40 Newlandsfield Park Glasgow 4,000 Pollok* 41 Glebe Park Brechin 3,960 Brechin City 42 Borough Briggs Elgin 3,927 Elgin City 43 Forthbank Stadium Stirling 3,808 Stirling Albion 44 Princess Royal Park Banff 3,800 Deveronvale* 45 Station Park Nairn 3,800 Nairn County* 46 Ochilview Park Stenhousemuir 3,776 Stenhousemuir, East Stirlingshire 47 Galabank Annan 3,500 Annan Athletic 48 Links Park Montrose 3,292 Montrose 49 Grant Park Lossiemouth 3,250 Lossiemouth* 50 Harmsworth Park Wick 3,200 Wick Academy* 51 Recreation Park Alloa 3,142 Alloa Athletic 52 Bellslea Park Fraserburgh 3,000 Fraserburgh* 53 Grant Street Park Inverness 3,000 Clachnacuddin* 54 Ainslie Park Edinburgh 3,000 Spartans* 55 Raydale Park Gretna 3,000 Gretna 2008* 56 Mackessack Park Rothes 2,700 Rothes* 57 Harlaw Park Inverurie 2,400 Inverurie Loco Works* 58 Allan Park Aberdeen 2,300 Cove Rangers* 59 Cheaper Insurance Direct Stadium Dumbarton 2,050 Dumbarton 60 Bayview Stadium Methil 2,000 East Fife 61 Cliftonhill Coatbridge 1,249 Albion Rovers *capacity Category:Lists of stadiums",
 "title": "List of football stadiums in Scotland"
}