{
 "id": "218992",
 "text": "Avatar is a 2009 American science fiction adventure movie. The two main characters are played by Sam Worthington (Jake) and Zoe Saldana (Neytiri). Avatar was directed by James Cameron. In 1994, Cameron wrote an 80-page story about Pandora. He did not start to develop the movie until 12 years later, in early 2006. He did this because the level of technology at the time was not good enough. The cost of the movie was high. It cost $280–310 million to make it and $150 million for marketing. The movie was released in traditional 2-D and 3-D. Only three weeks after it was released (December 18, 2009 in the United States), Avatar has earned more money worldwide than any movie other than Cameron's previous movie, Titanic. Due to the movie's success, Cameron signed with 20th Century Fox to direct four sequels. The first sequel, Avatar: The Way of Water, was released on December 16, 2022. Avatar: Fire and Ash is set to be released in 2025, with further sequels scheduled for release in 2029 and 2031. It has been nominated for nine Academy Awards (winning three) and eight BAFTA awards (winning two). == Plot == The story takes place on Pandora, a moon of a far away planet, in the year 2154. The movie opens with Jake Sully (played by Sam Worthington), a paraplegic marine, getting into a fight in a bar on Earth before he goes to Pandora. Pandora is a fictional Earth-like moon in a distant planetary system. Some humans have traveled from Earth to Pandora because it is a source of a very valuable mineral called unobtanium. The largest deposit of the mineral is under a large tree that the local Na'vi people have named \"Hometree\" (kelutral in the Na'vi language). The tree is very important to the Na'vi. Parker Selfridge (played by Giovanni Ribisi) is the military leader of the mining operation. He uses marines for security. The marines need to move the Na'vi people before they can start mining the unobtanium. They have tried to do this many times. They have offered the Na'vi clothing, education, and such, but none has been working. Their next plan is to just blow the place up. Pandora is inhabited by the Na'vi. They are a blue- skinned species of humanoids with feline characteristics. Physically, the Na'vi are much stronger and taller than humans. They live in harmony with Nature and worship a mother goddess called Eywa. The human scientists on Pandora want to learn about the Na'vi's culture. To do this, they have created \"avatars\". Avatars are Na'vi bodies modified with human DNA. They are controlled mentally by human operators. These avatars are used to interact with the Na'vi people, to try to create peace. Jake's brother was a scientist trained to be an avatar operator. After his brother dies, Jake replaces him to control his avatar. Jake receives the mission to form relations with the Na'vi. His goal is to get the Na'vi to move away from Hometree so the humans can mine for unobtanium there. To do this, he was to become friends with the Na'vi so he could learn what it would take to get them to move. Many people, like Grace (played by Sigourney Weaver), an avatar specialist, did not think Jake had enough experience and intelligence to be useful. On a mission in avatar form, he gets lost in the jungle. Jake's avatar is saved by Neytiri (Zoe Saldana), a female Na'vi. Neytiri takes Jake to Hometree, where her clan, the Omaticaya, live. As a shaman, Neytiri's mother shows interest in Jake. She asks her daughter to teach Jake about their culture. Together, Jake and Neytiri have many adventures in Pandora. Neytiri shows Jake the spirit that every living thing has. Jake is respected when he first comes to the Na'vi. They call him a \"sky-dreamer\". Once he learns their culture, he impresses all of them and earns their respect. He becomes a member of the Omaticaya clan and is seen as one of them. At first, Neytiri does not like him. Their friendship forms as he becomes more skilled and her equal. They mate under the tree of Eywa. At first, Neytiri's father is quite mad about it. Over time, he accepts it. Time passes and Jake has not gotten the Na'vi people to move. Park Selfridge sees this. He tells Jake that it has taken too long and that they are going to bomb Hometree. Jake tries to warn the Na'vi people. The Na'vi people feel that he has betrayed them because he knew this was going to happen. The Na'vi try to fight back but their bows and arrows are useless against the Marines. The Hometree is bombed and thousands of Na'vi people died. Neytiri's father is one of the dead. Jake and Grace have failed. They are jailed by the mining company because they fought with the Na'vi. With the help of a woman marine pilot named Trudy (played by Michelle Rodriguez), they escape in a helicopter. They go to a nearby base to change into avatar mode. They then go to Hometree to see the Na'vi. Jake tells the Na'vi people that they still must fight. He joins with one of the Na'vi warriors to train them. Soon, more Na'vi come to defend their land. The marines choose to just destroy the Na'vi rather than try and move them. Many people do not think this was right. They think it is inhumane. These people are not listened to and the Marines went to attack the Na'vi. There is a very large battle between the Marines and Na'vi. When it looks as if the marines are going to win, many of the animals of Pandora join the battle. They fight with the Na'vi against the marines. Near the end of the battle, Jake, in his avatar, fights Parker Selfridge. When he is almost dead, Neytiri saves him. The Na'vi eventually win but many die. After the battle, the Marines are sent home to planet Earth. Jake Sully is changed into his avatar permanently and becomes the leader of the Na'vi with Neytiri. == Cast == === Humans/Avatars === * Sam Worthington as Jake Sully, a disabled former Marine who becomes part of the Avatar Program after his twin brother is killed. His military background helps the Na'vi warriors relate to him. Worthington also briefly appears as Jake's deceased identical twin, Tommy. * Stephen Lang as Colonel Miles Quaritch, the head of the mining operation's security detail. Fiercely consistent in his disregard for any life not recognized as human, he has a profound disregard for Pandora's inhabitants that is evident in both his actions and his language. * Sigourney Weaver as Dr. Grace Augustine, an exobiologist and head of the Avatar Program. She is also Sully's mentor and an advocate of peaceful relations with the Na'vi, having set up a school to teach them English. * Michelle Rodriguez as Trudy Chacón, a combat pilot assigned to support the Avatar Program who is sympathetic to the Na'vi. * Giovanni Ribisi as Parker Selfridge, the corporate administrator for the RDA mining operation. While he is at first willing to destroy the Na'vi civilization to preserve the company's bottom line, he is reluctant to authorize the attacks on the Na'vi and taint his image, doing so only after Quaritch persuades him that it is necessary and that the attacks will be humane. When the attacks are broadcast to the base, Selfridge displays discomfort at the violence. * Joel David Moore as Dr. Norm Spellman, a xenoanthropologist who studies plant and animal life as part of the Avatar Program. He arrives on Pandora at the same time as Jake and operates an avatar. Although he is expected to lead the diplomatic contact with the Na'vi, it turns out that Jake has the personality better suited to win the natives' respect. * Dileep Rao as Dr. Max Patel, a scientist who works in the Avatar Program and comes to support Jake's rebellion against the RDA === Na'vi === * Zoe Saldana as Neytiri, the daughter of the leaders of the Omaticaya (the Na'vi clan central to the story). She is attracted to Jake because of his bravery, though frustrated with him for what she sees as his naiveté and stupidity. She serves as Jake's love interest. The character, like all the Na'vi, was created using performance capture, and its visual aspect is entirely computer generated. * CCH Pounder as Mo'at, the Omaticaya's spiritual leader, Neytiri's mother, and consort to clan leader Eytukan. * Wes Studi as Eytukan, the Omaticaya's clan leader, Neytiri's father, and Mo'at's mate. * Laz Alonso as Tsu'tey, the finest warrior of the Omaticaya. He is heir to the chieftainship of the tribe. At the beginning of the movie's story, he is engaged to Neytiri. == Release == Avatar premiered in London on December 10, 2009, and was released worldwide from December 16 to 18. It was originally set for release on May 22, 2009, but it was delayed to allow more time for post- production and for theatres worldwide to install 3D projectors. === Home media === 20th Century Fox Home Entertainment released the movie on Blu-ray and DVD in the US on April 22, 2010, and in the UK on April 26. The US release was to coincide with Earth Day. The first DVD and Blu-ray releases do not contain any additional features other than the theatrical movie and the disc menu. This was made in favor of and to make space for optimal picture and sound. The Avatar three-disc Extended Collector's Edition on Blu-ray and DVD was released on November 16, 2010. Three different versions of the movie are present on the discs: the original theatrical cut (162 minutes), the special edition cut (170 minutes), and a collector's extended cut (178 minutes). The Blu-ray set presents the movie in a single disc, while the DVD set spreads it across two discs. The collector's extended cut contains 8 more minutes of footage, thus making it 16 minutes longer than the original theatrical cut. There is also an \"Earth opening\", which Cameron stated that it is an additional minutes of scenes that were initially in the movie but were eventually cut before the movie's theatrical release. The release also has an additional 45 minutes of deleted scenes and other extras. == Reception == On Rotten Tomatoes, 82% of 335 reviews are positive. The average rating is 7.5/10. On Metacritic, the movie has a score of 83 out of 100 based on 38 critic reviews, indicating \"universal acclaim\". ==References== ==Other websites== * Category:2009 movies Category:2009 science fiction movies Category:2009 3D movies Category:2009 adventure movies Category:2000s epic movies Category:Academy Award winning movies Category:2000s American adventure movies Category:American science fiction movies Category:English-language movies Category:Golden Globe Award winning movies Category:Movies composed by James Horner Category:Movies directed by James Cameron Category:Movies set in the future Category:Movies set on fictional planets Category:Jungle movies Category:Movies that won the Best Visual Effects Academy Award Category:Saturn Award winning movies Category:20th Century Fox movies Category:Movies set in the 22nd century Category:Movies about extraterrestrial life",
 "title": "Avatar (2009 movie)"
}