{
 "id": "219231",
 "text": "Macedonia is a historical and geographical region in northern Greece. It is the second most populous region of Greece and usually it is referred as Northern Greece along with Thrace. It is situated between the Pindus Mountains and river Nestos and it borders west with Epirus and Thessaly, northwestern with Albania, north with North Macedonia, northeastern with Bulgaria and east with Thrace. Its south coasts are washed by the Aegean Sea. Macedonia is separated in three smaller peripheries: West Macedonia, Central Macedonia and East Macedonia and Thrace. It has a total population of 2,424,765 inhabitants according to the 2001 census and its total area is 34,177 km². The capital of Macedonia is Thessaloniki and has a population of about 1,000,000 inhabitants. Macedonia's national anthem is Μακεδονία Ξακουστή which means Famous Macedonia. ==Geography== Macedonia has many mountains and the tallest is Mount Olympus which has a high of 2,917 meters. There are also many valleys that are some of the biggest in the whole Greece. Rivers such as Aliakmon, Axios, Nestos, and Strymonas cross these valleys and drain into the Aegean Sea. ==Prefectures and population== Macedonia consists 13 prefectures and sometimes it is said to be 14 because there is also a monastery region, Mount Athos, which is autonomous. Map of Macedonia Number Periphery Capital Area Population Total West Macedonia Kozani 9,451 km² 301,522 1 Kastoria Prefecture Kastoria 1,720 km² 53,483 2 Florina Prefecture Florina 1,924 km² 54,768 3 Kozani Prefecture Kozani 3,516 km² 155,324 4 Grevena Prefecture Grevena 2,291 km² 37,947 Total Central Macedonia Thessaloniki 18,811 km² 1,871,952 5 Pella Prefecture Edessa 2,506 km² 145,797 6 Imathia Prefecture Veria 1,701 km² 143,618 7 Pieria Prefecture Katerini 1,516 km² 129,846 8 Kilkis Prefecture Kilkis 2,519 km² 89,056 9 Thessaloniki Prefecture Thessaloniki 3,683 km² 1,057,825 10 Chalkidiki Prefecture Polygyros 2,918 km² 104,894 11 Serres Prefecture Serres 3.968 km² 200,916 Total East Macedonia Kavala 5,579 km² 249,029 12 Drama Prefecture Drama 3,468 km² 103,975 13 Kavala Prefecture Kavala 2,111 km² 145,054 \\- Mount Athos (Autonomous) Karyes 336 km² 2,262 Total 'Macedonia' Thessaloniki 34,177 km² And the population of the largest towns: Towns/Cities Greek Name Population 01\\. Thessaloniki (municipality) Δήμος Θεσσαλονίκης 363,987 02\\. Kavala Καβάλα 63,293 03\\. Katerini Κατερίνη 56,434 04\\. Serres Σέρρες 56,145 05\\. Drama Δράμα 55,632 06\\. Kozani Κοζάνη 47,451 07\\. Veria Βέροια 47,411 08\\. Ptolemaida Πτολεμαΐδα 35,539 09\\. Giannitsa Γιαννιτσά 26,296 10\\. Kilkis Κιλκίς 24,812 11\\. Naousa Νάουσα 22,288 12\\. Aridaia Αριδαία 20,213 13\\. Alexandreia Αλεξάνδρεια 19,283 14\\. Edessa Έδεσσα 18,253 15\\. Nea Moudania Νέα Μουδανιά 17,032 16\\. Florina Φλώρινα 16,771 17\\. Kastoria Καστοριά 16,218 18\\. Grevena Γρεβενά 15,481 19\\. Polygyros Πολύγυρος 10,721 20\\. Skydra Σκύδρα 5,081 ==Related pages== * Macedonia * Republic of Macedonia == References == ==Other websites== *Macedonia, The Historical Profile of Northern Greece *Macedonia and Thrace region site * Region of Central Macedonia * Region of Western Macedonia * Region of Eastern Macedonia and Thrace Category:Subdivisions of Greece",
 "title": "Macedonia (Greece)"
}