{
 "id": "219423",
 "text": "Miley Ray Cyrus (born Destiny Hope Cyrus; November 23, 1992) is an American actress, singer, and songwriter. She has starred in a television series (Hannah Montana) and in four movies. She has released five albums and has written an autobiography. Cyrus played minor roles in television series Doc and movie Big Daddy and Big Fish. She then appeared in Hannah Montana in 2006. Her debut studio album Meet Miley Cyrus was released in 2007. As of 2020, Cyrus has released eight albums: Meet Miley Cyrus (2007), Breakout (2008), Can't be Tamed (2010), Bangerz (2013), Miley Cyrus and Her Dead Petz (2015), Younger Now (2017), Plastic Hearts (2020), and Endless Summer Vacation (2023). ==Personal life == Destiny Hope Cyrus was born in Franklin, Tennessee. Her parents are Billy Ray Cyrus and Letitia \"Tish\" (Finley) Cyrus. Miley was a childhood nickname. In 2008, Cyrus dated an Australian actor called Liam Hemsworth. The two became engaged before breaking off their engagement in 2013. They reconciled and were later married on December 23, 2018. In August 10 2019, it was announced that Cyrus and Hemsworth had separated. On January 28, 2020, the divorce was finalized. ==Professional life== ===Television=== Cyrus was eleven years old when she starred in the television series, Hannah Montana. In 2012 and 2013, Cyrus played Missi in the series Two and a Half Men. In August 2013, Cyrus twerked on singer Robin Thicke at the MTV Video Music Awards program. It was the most tweeted about event in history. There were 360,000 tweets per minute. In September 2016, Cyrus co-starred in Amazon Studios' Crisis in Six Scenes.\"Miley Cyrus Explains Why She’s in Awe of Woody Allen: 'He’s Never Fake'\". Vanity Fair, September 16, 2016\"Watch First Clip From Woody Allen's 'Crisis in Six Scenes' TV Show\" , Rolling Stone, August 8, 2016 ===Music=== In 2006, Cyrus released the first Hannah Montana soundtrack album. It has sold 4.5 million copies. It reached number one on the US Billboard 200. In 2007, she released a double album, Hannah Montana 2: Meet Miley Cyrus. The first CD was a soundtrack album for Hannah Montana, and the second CD was Cyrus' first studio album. She starred in the Best of Both Worlds Tour. Her second album was Breakout (2008) and third album was Can't be Tamed (2010). Her fourth album Bangerz was released on October 4 by RCA Records. So far three singles have been released from Bangerz. We Can't Stop was released in June 2013. It reached number 2 in the U.S. Billboard Hot 100. In September 2013, Cyrus released the nude music video for her next single, \"Wrecking Ball\". It racked up more than 19.3 million views on Vevo in 24 hours, which was a record at the time. It reached number one in the United States, Canada, and the United Kingdom. \"Wrecking Ball\" was her first number- one single in the United States. In 2014, Cyrus embarked on The Bangerz World Tour. On October 5, 2013, Cyrus presented Saturday Night Live for the second time. Cyrus was a featured artist on rapper Future's November 2013 single, \"Real and True\". The single reached number 32 on the U.S. Billboard Hot R&B;/Hip-Hop Songs chart. In December 2013, MTV chose Cyrus as the best artist of the year. The video for the third single from Bangerz, \"Adore You\", was posted on Vevo on December 26, 2013. Cyrus released her fifth album, Miley Cyrus and Her Dead Petz, on the music-sharing site Soundcloud on August 30, 2015, following the 2015 MTV Video Music Awards, which she hosted. Cyrus released the lead single \"Malibu\" from her sixth album, Younger Now, on May 11, 2017. She released Plastic Hearts in 2020, which featured the singles \"Midnight Sky\" and \"Prisoner\", which samples \"Physical\" by Olivia Newton-John and features British singer Dua Lipa. In 2023, Cyrus released her eighth studio album, Endless Summer Vacation. The lead single \"Flowers\" entered at number one on the Billboard Hot 100, becoming her second US chart-topper after \"Wrecking Ball\" (2013). \"Flowers\" ranked at number two on Billboard's Year-End Hot 100 for 2023 and won Cyrus her first two Grammy Awards, for Best Pop Solo Performance and Record of the Year; it was also nominated for Song of the Year, which went to \"What Was I Made For?\" by Billie Eilish. The album track \"Thousand Miles\" with Brandi Carlile was nominated in the category of Best Pop Duo/Group Performance. Endless Summer Vacation was nominated for Album of the Year and for Best Pop Vocal Album, which both went to Taylor Swift's Midnights. ===Movies=== In 2008, Cyrus voiced the part of \"Penny\" in the Disney CGI-animated movie Bolt. In 2009, she starred in Hannah Montana: The Movie. In 2010, she starred in The Last Song and had a brief appearance in Sex and the City 2. In 2012, she starred in LOL and in So Undercover. ===Books=== In 2008, Cyrus posed nude for snaps that appeared in Vanity Fair magazine. This adventure did not damage Cyrus's career. In early 2009, Cyrus released the autobiography, Miles to Go. The book is a collection of family photographs, stories, and memories. ==Discography== *Meet Miley Cyrus (2007) *Breakout (2008) *Can't Be Tamed (2010) *Bangerz (2013) *Miley Cyrus and Her Dead Petz (2015) *Younger Now (2017) *Plastic Hearts (2020) *Endless Summer Vacation (2023) *Something Beautiful (2025) ==Filmography== ===Films=== Film roles showing year released, title, role played and notes Title Year Role Notes Big Fish 2003 Young Ruthie Feature film debut; credited as Destiny Cyrus Hannah Montana & Miley Cyrus: Best of Both Worlds Concert 2008 Herself Concert film Bolt Penny (voice) English dub; voice-over role Hannah Montana: The Movie 2009 Miley Stewart/ Hannah Montana Sex and the City 2 2010 Herself Cameo appearance The Last Song Veronica \"Ronnie\" Miller Justin Bieber: Never Say Never 2011 Herself Concert film LOL 2012 Lola Williams So Undercover Molly Morris Jeremy Scott: The People's Designer 2015 Herself Documentary The Night Before Herself Cameo appearance A Very Murray Christmas Herself Cameo appearance Guardians of the Galaxy Vol. 2 2017 Mainframe (voice) English dub; voice-over role ===Television=== Television roles showing year released, title, role played and notes Title Year Role Notes Doc 2001–2003 Kylie Recurring role; 3 episodes The Suite Life of Zack & Cody 2006 Miley Stewart/ Hannah Montana Episode: \"That's So Suite Life of Hannah Montana\" Hannah Montana 2006–2011 Lead role; 98 episodes The Emperor's New School 2007 Waitress (voice) Recurring role; 4 episodes The Replacements Celebrity Starr (voice) Episode: \"The Frog Prince\" High School Musical 2 Girl at pool Disney Channel Movie The Suite Life on Deck 2009 Miley Stewart/ Hannah Montana Episode: \"Double-Crossed\" Two and a Half Men 2012 Missi Guest role; 2 episodes Miley: The Movement 2013 Herself Special Miley Cyrus: Bangerz Tour 2014 Herself Special Stone Quackers 2015 Pigeon (voice) Episode: \"A Farewell to Kings\" Crisis in Six Scenes 2016 Lennie Dale Miniseries The Voice 2016–2017 Herself/ Coach Key advisor (season 10); coach (seasons 11, 13) Black Mirror 2019 Ashley O Episode: \"Rachel, Jack and Ashley Too\" ==References== ==Other websites== * * Miley Cyrus at MTV * * Category:1992 births Category:Living people Category:Actors from Tennessee Category:American child actors Category:American child singers Category:American feminists Category:American movie actors Category:American pop singers Category:American country singers Category:American rock singers Category:American dance musicians Category:American hip hop singers Category:American R&B; singers Category:American television actors Category:American voice actors Category:Disney actors Category:Disney singers Category:Pansexual people Category:Singers from Nashville, Tennessee",
 "title": "Miley Cyrus"
}