{
 "id": "219509",
 "text": "Macedonia (, , , ) is a region in southeastern Europe, in Balkans. In ancient times it was the Kingdom of Macedon and its greatest and most well known leader was Alexander The Great. In Roman times it was part of the Roman province of Macedonia. Today, its borders have changed and after the Treaty of Bucharest it was separated in three countries: Greece with the region of Macedonia (Greek Macedonia or Aegean Macedonia), the country North Macedonia (Vardar Macedonia), and Bulgaria (Pirin Macedonia (Blagoevgrad province)). ==Disputes== Greece and North Macedonia have been arguing over the name Macedonia ever since the independence of the country using the name \"Republic of Macedonia\". North Macedonia had to choose a temporary name in order to be recognized by the United Nations and was known as the Former Yugoslav Republic of Macedonia (FYROM). The two countries have been discussing a solution for a new name that both find acceptable and recently agreed upon the name North Macedonia with the Prespa Agreement between Greece and North Macedonia. Bulgaria has not taken part in the dispute but has some disagreements with North Macedonia. Even though Bulgaria was the first country to recognize Macedonia with its name, it doesn't support the Macedonian ethnicity and language anywhere, but claim it's all Bulgarian. ==Countries== ===Macedonia, Greece=== Macedonia (Greek: Μακεδονία - Makedonia), also known as Aegean Macedonia (Macedonian: Егејска Македонија, Egejska Makedonija) is a historical and geographical region in northern Greece. It is the second most populous region of Greece and usually it is referred as Northern Greece with Thrace. It is situated between the Pindus Mountains and river Nestos and it borders west with Epirus and Thessaly, northwestern with Albania, north with the Republic of North Macedonia, northeastern with Bulgaria and east with Thrace. Its south coasts are washed by the Aegean Sea. ===Republic of North Macedonia=== Republic of North Macedonia (Macedonian: Република Северна Македонија - Republika Severna Makedonija), also known as Vardar Macedonia (), is an independent state on the Balkan peninsula in southeastern Europe. The country borders Serbia to the north, Albania to the west, Greece to the south, and Bulgaria to the east. The country's currency is the Macedonian denar (MKD). ===Blagoevgrad Province, Bulgaria=== Blagoevgrad Province (, oblast Blagoevgrad or Благоевградска област, Blagoevgradska oblast), also known as Pirin Macedonia (Macedonian: Пиринска Македонија,), is a province (oblast) of southwestern Bulgaria. To the north and east it borders with four other Bulgarian provinces. It consists of a Macedonian minority in the province, to the south with Greece and the west with the Republic of North Macedonia. == Demographics == The region has always had a mixed population since ancient times, medieval times, and through Ottoman times, and today is no different with the population mostly consisting of Macedonians, Greeks and Albanians. With Vlach, Turkish, and Jewish as the main minority groups. * Macedonian Greeks - self-identify regionally as Macedonians. They form about 51% of the population and are mostly in Aegean Macedonia (Greece). However there are small minorities in the Vardar and Pirin regions. Most of the Greeks originate from a large influx of Greek refugees from Asia Minor in the early 20th century (around 1923). This is due to the population exchange between Greece and Turkey, during which over 1.2 million Christian refugees from Turkey were settled in Greece, 638,000 of whom were settled in the Greek province of Macedonia. It is estimated that they make up the majority of Greeks in Macedonia today. * Ethnic Macedonians - self-identify ethnically and regionally as Macedonians and are the second largest ethnic group in the region. Ethnic Macedonian minorities exist in Greece and Bulgaria and is the largest minority group in Greece's portion of Macedonia. Greece and Bulgaria do not officially recognise a Macedonian minority, in Greece they are recognised as \"Slavophone\" Greeks, and in Bulgaria as Bulgarians. Ethnic Macedonians are discriminated and somewhat oppressed in both of these regions. * Bulgarians - A small number of identifying Bulgarians live in North Macedonia and Greece. But are the bulk population in Bulgaria. * Albanians are another major ethnic group in the region. Ethnic Albanians make up the majority in certain northern and western parts of the Republic of North Macedonia, and account for 25.2% of the total population of the Republic of North Macedonia, according to the 2002 census. * Smaller numbers of Turks, Bosniaks, Roma, Serbs, Vlachs (Aromanians and Megleno-Romanians), Egyptians, Armenians and Jews (Sephardim and Romaniotes) can also be found in Macedonia. ==References== Category:Regions of Europe",
 "title": "Macedonia (region)"
}