{
 "id": "219593",
 "text": "Judaism (Hebrew: יהדות) is the religion of Jewish people, and also the world's oldest Abrahamic monotheistic religion. It was created around the 6th century BCE in Canaan, and is an evolution of the polytheistic religion of Yahwism. It is centered around the Torah. There are about 15 million followers. They are called Jews or Jewish people. It is the second oldest monotheistic religion. The Torah is the most important holy book of Judaism. The laws and teachings of Judaism come from the Torah, the first five books of the Hebrew Bible and oral traditions. Some of these were first oral traditions and later written in the Mishnah, the Talmud, and other works. Both Christianity and Islam are related to Judaism. These religions accept the belief in one God and the moral teachings of the Hebrew Bible (Old Testament), which includes the Torah or \"תורה.\" ==Basic beliefs== The three main beliefs at the center of Judaism are Monotheism, Identity, and covenant (an agreement between God and God's people). The most important teaching of Judaism is that there is one God, who wants people to do what is just and compassionate. Judaism teaches that a person serves God by learning the holy books and doing what they teach. These teachings include both ritual actions and ethics. Judaism teaches that all people are made in the image of God and deserve to be treated with respect. ===One God=== The main teachings of Judaism are about God, that there is only one God. According to Judaism, only God created the universe and only God controls it. Jewish people refer to God by many names. The most holy name for God in Judaism is \"Yahweh\", though most Jews avoid saying this name aloud due to how holy it is. Judaism also teaches that God is spiritual and not physical. Jews believe that God is one – a unity: God is one whole, complete being. God cannot be divided into parts and people cannot say how God looks in words; they can only say how God is and what God does. Jews believe that all goodness and morality is from God. God is interested in what people do and that God watches what they do. Judaism teaches that all people are made in the image of God. This is why people must be treated with dignity and respect. A person serves God by being like God. This means that they must do what is fair and just, show mercy, and behave with kindness and love for people. Judaism says that God exists forever, that God is everywhere, and that God knows everything. God is above nature (“supernatural”) but God is in the world and hears those who pray to God and will answer them. God is the main power in the universe. Judaism teaches that God allows people to choose what to do – this is called “free will.” Free will is the freedom to do whatever a person wants, but that they must be responsible for their own actions. People are responsible for their actions. God rewards people who do good, and will punish those who do wrong. God gives a person a reward or a punishment in this world, but God gives the final reward or punishment to the soul of the person after their death. ===Jews=== Jews believe that God made an agreement called a “covenant” with Abraham, the ancestor of the Jewish people. The Bible says that God promised to bless Abraham and his descendants if they worshipped God and were faithful to God. God made this covenant with Abraham's son, Isaac, and with Isaac's son, Jacob. God gave Jacob another name, Israel. This is how Jacob’s descendants got the name the “Children of Israel” or “Israelites.” God later gave the Torah to the Israelites through their leader, Moses. The Torah told the Israelites how to live and build their community. God gave the Israelites the Ten Commandments and other laws in the Torah (613 in total). The Jews are sometimes called the “Chosen People\". This is because the Bible says God told them, “You will be to Me a kingdom of priests and a holy nation” (Exodus 19:6) and “For you are a holy people to the Lord your God, and the Lord chose you to be God's own special nation out of all peoples on the earth” (Deuteronomy 14:2). Jews understand that this means they have special duties and responsibilities commanded by God. For example, Jews must build a just society and serve only God. Jews believe that this covenant works in two ways: if they follow God’s laws, God will give them God's love and protection, but they are also responsible for their sins – bad actions – and disobeying what God told them. Jews believe that they must teach other people that God exists and that God wants all people to do good actions. Jews believe that their job in the world is to be \"a light to the nations\" (Isiah 49:6) by showing the people of the world ways to make the world a better place. Jews believe that God has given them a special job which is to repair the world. Their job is to make the world a better place with more good in it. They must use the things in the world to increase good and come closer to God. They call this “tikkun olam” – repairing the world. Jews see themselves and all people as partners with God. People must repair the world in any way they can – to find ways to lessen suffering of people and animals, to make more peace, bring respect between people and protect the earth’s environment from destruction. Jews do not try to convince other people to believe in Judaism. Jews believe they have a special job to show the world that God exists, but people do not have to be Jewish to follow God. All people can serve God by following the Seven Commandments (rules) given to Noah. But, Judaism accepts people who choose to change their religion to Judaism. ===Torah and Mitzvot=== Jews believe that God tells them in the Torah the way of life that they must follow. The Torah says God wants the people of Israel to walk in God's ways, to love God, and to serve God, and to keep God’s commandments (Deut. 10:12–13). Actions are more important than beliefs and beliefs must be made into actions. These actions are called mitzvot in Hebrew (singular: a mitzvah מִצְוָה). Sometimes they are called “laws,” \"rules\" or “commandments”. Many people think of a mitzvah as \"a good act,\" or \"a good thing to do.\" There are 613 mitzvot in the Torah. Jews believe that the Torah gives mitzvot for all people; all people must keep seven laws that were taught to Noah and his children after the flood. The Jews must keep 613 mitzvot, which are listed in the Torah. The rabbis counted 365 mitzvot that Jews must not do (negative mitzvot), and 248 mitzvot that Jews must do (positive mitzvot). Some mitzvot are for everyday life, and some are only for special times, such as Jewish holidays. Many of the 613 mitzvot are about the Holy Temple in Jerusalem and cannot be done now, since the Temple was destroyed. Some of the mitzvot are about how people must act to other people. For example, they must give charity to a poor person, or help a person who is in danger. They must not steal or lie. These are ethical and moral mitzvot. Some mitzvot are about how people must act towards God. For example, they must respect God’s name, or not work on the Sabbath. These are religious or ritual mitzvot. Jews believe that God tells them to do both ethical and religious acts. Jews see mitzvot as acts that sanctify – bring holiness – to the world and bring people and the world closer to God. Jews do the mitzvot to sanctify the physical world and the things in it, such as food and drink, clothing, and natural activities such as sex, work, or seeing beautiful sights. Before doing many acts, such as eating, Jews say a blessing – a short prayer – that God makes and gives a person the things that they need for life. In Judaism, life is most holy and important. A Jew must stop doing other mitzvot of the Torah to help save another person’s life. Jews believe that they must do the mitzvot with happiness and joy because the Bible says “Serve God with joy; come before God with singing” (Psalms 100:2). Doing a mitzvah helps a person come close to God and that makes the person happy. A group of Jews called the Hasidim say this is the best way to live. They say that worrying takes people away from joy and they will not see the beauty and good in the world. Many mitzvot in the Torah are about the Land of Israel. The Talmud and later books call these mitzvot “commandments connected to the Land” because Jews can only do them in the Land of Israel. For example, Jews give gifts to the poor or the priests from their fields every year, and before the Temple was destroyed, take fruit or animals to the Temple in Jerusalem, and must stop working on the land every seven years (the “shmittah” – sabbatical year). ===The Land of Israel=== The Land of Israel is holy in Judaism. A Jewish belief is that God created the Earth from Mount Moriah in Jerusalem in the Land of Israel, and God is always closest to this land. Jews believe that this land is where God told the Jewish people to build a society to serve God, and many mitzvot (commandments) in the Torah are about the Land of Israel. The Jewish people believe their history as a nation begins with Abraham. The story of Abraham in the Torah begins when God tells Abraham to leave his country. God promises Abraham and his descendants a new home in the land of Canaan. This is now known as the Land of Israel. It is named after Abraham's grandson, Jacob, who was also called Israel and who was the father of the twelve tribes. This is where the name “Land of Israel” comes from. The land is also called “the Promised Land” because in the Torah, God promises to give the land to the children of Abraham (, , , ). The rabbis of the Talmud understood from the Torah () that it is a “mitzvah” for Jews to live in the Land of Israel. Jews often called the land outside of Israel \"galut.\" This is usually translated as \"diaspora (a place where people are scattered)\", but the word more closely means \"exile\". ===The Messiah and Saving The World=== The story of leaving Egypt, called the Exodus, is very important in the way the Jewish people understand the world. The Torah tells how God took a group of slaves, the Israelites, from slavery, and tells them how to be God's partner to build the world. Jews see this story as a model for the whole world. In the future, the whole world will change, and all the people of the world will serve the one God. This will be God’s kingdom on Earth. They believe the whole of Jewish history, and world history, is part of this process. The prophets taught that God would send a person to the world who would help all the people of the world see that God is the maker, ruler of the world and has supreme power. This person is called the Messiah. The word Messiah comes from the Hebrew word mashiah, which means \"the anointed one\". The Book of Isaiah says the Messiah will be a just king who will unite the Jewish people and lead them in God's way. The Messiah will also unite all the people of the world to serve God. People will act with justice and kindness, and the whole world will be filled with peace. Jews still wait for the Messiah to come. They believe that this will be a person. Other Jews believe in a future time when justice and peace will come through the cooperation of all people and the help of God. ==Writings== Jews believe that to know what God wants them to do, they must study the books of Torah and its laws and do what they teach. These include both laws about how to behave to other people and how to serve God. The two most important groups of books in Judaism are the Bible and the Talmud. The beliefs and actions of Judaism come from these books. Jewish teachers and scholars wrote more books, called commentaries. They explain and say more about what is written in the Bible and Talmud. ===The Torah === The Torah is the most important of all Jewish writings. The first five books of the Hebrew Bible (known to Christians as the \"Old Testament\") make up the Torah. The Torah contains the basic laws of Judaism and describes the history of the Jews until the death of Moses. Jewish tradition says that God told Moses what to write in the Torah, which is also called the Five Books of Moses. Religious Jews believe that Moses brought the Ten Commandments and the Torah down from Mount Sinai. The Ten Commandments are special because they were heard by all of the Jewish people at Mount Sinai. However, in traditional Judaism, all of the 613 mitzvot in the Torah are equally important. Jews divide the Hebrew Bible into three parts and call it the Tanakh. The three parts are the Torah, which is the first five books; the Nevi'im, which are the books of the prophets; and the Ketuvim, meaning the Writings, which are other books of history and moral teachings. ===Talmud=== Rabbinic Jews also believe that there is another part of the Torah besides the five books of Moses. It is called the Mishnah, also called the Oral Torah or Oral Law. It explains how to follow the laws written in the 5 books. There is a commentary (explanation) of the Mishnah, called the Gemara. Together, the Mishna and the Gemara make up the Talmud. But Karaite Jews believe that there is no additional Torah besides the five books of Moses. Traditional Jews believe that God gave the Written Torah and Oral Torah to Moses and that Moses told it to the Jewish people, and that it is the same today as it was back then. Traditional Jews also believe that all of the commandments must still be followed today. Liberal Jews believe that the Torah was inspired by God but written by human beings. Liberal Jews believe that all of the ethical laws in the Torah must still be followed, but many ritual laws do not need to be followed today. It is considered good in Judaism to talk about the commandments and to try to understand how to follow them. The Talmud has many stories about Rabbis who argued about the commandments. Over time, some opinions have become the rule for everyone. Some rules are still being argued about. Jews praise logical argument and looking for truth. There is no single leader of Judaism who can decide how to follow the commandments or what to believe. Even though Jews believe different things and they disagree about the rules, they are still one religion and one people. ==Daily way of life== ===Kashrut: Jewish food laws=== Jews who follow the religious rules called \"kashrut\" only eat some types of food that are prepared by special rules. Food that a Jew can eat is called Kosher food. Traditional Jews are very careful about kashrut. They usually cannot eat many foods in non-kosher restaurants or in the home of someone who does not keep Kasher. Sometimes, this makes it hard to visit people or to do business. People help avoid this problem by choosing to dine with Traditional Jews in a kosher restaurant or serve them Kasher food in their home. Less traditional Jews are not so careful about Kasher, although some of them may keep some rules. ====Kosher foods==== * Jews can eat any fresh fruit or vegetables that do not have any insects on or in them. * Jews can eat any fish that has scales and fins. This includes fish like salmon and tuna. They cannot eat seafood like shrimp, lobster, or mussels. *Jews can eat meat of any animal that chews its cud (food which has already been partly digested), and has split hooves. For example, cows, sheep, deer, and goats. However, the meat must be slaughtered and prepared in a specific way to be kosher. * Jews can eat many common birds such as chickens and turkeys and duck. The birds must also be slaughtered and prepared in a specific way. Jews can't eat birds of prey, like vultures. * Foods sold in stores or restaurants must be checked by a Jew who is an expert in Kashrut. The name for this person is \"mashgiach,\" or kosher overseer. He makes sure that the kosher rules were kept. Foods bought at the store often have a symbol called a hechsher on them to tell the customer that the food have been checked. Many everyday foods have a hechsher. * Honey is an insect product made by bees, but it is kosher. * It is a well- known myth that kosher food must be blessed by a rabbi, a rabbi cannot bless a food and make it Kosher. ====Non-Kosher foods==== * Some call non-kosher foods \"Treifah,\" meaning \"torn.\" This is because the Torah says not to eat an animal that has been killed or torn by another animal. * Jews cannot eat animals that do not have split hooves or animals that do not chew their cud. Unlike cows and sheep, pigs have split hooves, but do not chew their cud and are therefore not kosher. * Jews cannot eat rodents, reptiles or amphibians. * Jews cannot eat any sea animal that does not have scales and fins. For example, sharks, eels, crabs, shrimp and lobsters are not kosher. * Jews cannot eat birds that eat meat like vultures, which are mentioned in a list in the Torah. * Jews cannot eat any insects, except for a few types of crickets or locusts. ====Other Kosher rules==== There are other rules for kosher food as well. * Animals must be killed in a certain way, including using a fast strike across the neck with a very sharp blade which makes sure that the animal dies quickly. * All the blood must be removed from an animal before the meat is eaten. This is done by soaking and salting the meat. * A Jew cannot eat a meal that has both meat and milk in it. This comes from the rule (in the Torah) that a Jew must not cook a young goat in its mother's milk. Because of this, Jews use separate dishes and utensils for foods that have meat in it, and foods that have milk in it. * After eating meat, many Jews do not drink milk products before a time period between 1 to 6 hours has passed. * Kosher food must be cooked in a kitchen for actual kosher food. If the kitchen has been used to cook non-kosher food, such as rabbit and pig then the kitchen must be cleaned in a special way before it can be used to cook kosher food. ==Holidays== ===Sabbath=== One of the commandments is to keep the ~~Jewish~~ Sabbath or Shabbot. Shabbot starts every Friday at sunset and ends on Saturday at nightfall. Shabbot is a day of rest to thank God for making the universe. The tradition of resting on Shabbot comes from the Torah. According to the Torah, God created the world in six days and on the seventh day, Shabbot, He rested. Many Jews go to their temple or synagogue to pray on the Shabbat. Orthopraxy-Judaeans follow special rules on Shabbat. These rules require Jews not to do creative work on Shabbat. One reason for this is to give people a break from all the things that make them busy during the week. This helps them focus more on appreciating God, their family, and the rest of creation. Also it reminds people that God is the creator and ruler of the world; and no matter how great a person's creative power is, it cannot compare with God's creation of the universe and everything in it. Many of these categories of creative work include actions that people might not think of as work. For instance, on Shabbat a Jew cannot: * Use electrical machines like phones, computers, or a TV * Buy or sell things * Put on or off a fire or a light * Drive a car or ride a bicycle * Cook * Write * Build or fix things Traditional Jews are very careful about Sabbath. It is a special day. They clean their houses and prepare special food for the 7th day. They dress in their nicest clothes. They sing songs and say extra prayers in the synagogue. They have dinner and lunch with their families. Many families also invite guests for dinner and for lunch. They eat special food, and sing together Sabbatical songs. On the afternoon of the 7th day people study Judaism together or just visit friends. Liberal Jews do not follow those rules. Some do go to synagogue, visit friends or have special meals. But they may also talk on the phone, drive cars, and go shopping. == Important points in Judaism == *Birth * Brit Milah (for boys) a circumcision ceremony when a boy is 8 days old. It includes naming the baby. Some non-Orthodox Jews practice Brit Shalom, a baby naming ceremony for Jewish boys without circumcision. * Pidyon haben (for boys) is when a father does a special ceremony to redeem his wife's first son from the Temple, as originally all firstborns were sent to serve (in Jerusalem). Levites (a tribe of Israel) and Cohenim (priests) do not do this ritual. * Bat Mitzvah (for girls) a 'coming of age' ceremony when a girl turns 12 (13 for some Jews). Bat Mitzvah means \"daughter of the mitvah\" or \"daughter of the commandments\" in Hebrew. Once a girl turns 12 (or 13), she is considered a woman and is expected to follow Jewish law. A ceremony is not required. Bat Mitzvah not only refers to the ceremony, but also to the girl herself. * Bar Mitzvah (for boys) a 'coming of age' ceremony when a boy turns 13. It includes reading the Torah and special prayers. Bar Mitzvah means \"son of the mitzvah\" or \"son of the commandments\" in Hebrew. Once a boy turns 13, he is considered a man and is expected to follow Judaism. A ceremony is not required. Bar Mitzvah not only refers to the ceremony, but also to the boy himself. * Marriage * Having Children * Death == Kinds of Judaism == For a very long time, most Jews in Europe believed the same basic things about Judaism. Jews in other lands had different beliefs and customs than European Jews. About 200 years ago, a small group of Jews in Germany decided to stop believing in many parts of Judaism and try to become more \"modern\" and more similar to Germans. Those Jews were called Reform Jews. Today there are three main kinds of Judaism: Reform, Conservative, and Orthodox Judaism. There are also kinds with a smaller number of people, such as Reconstructionist Judaism, and Karaite Judaism. Each group has its own practices according to how it understands the Jewish laws. For example, Reform (also called Liberal or Progressive) Judaism encourages people to choose the ways to be Jewish that mean the most to them based on the traditions. Reform Judaism teaches Jews to focus on the ethical laws of Judaism. Conservative Judaism developed after Reform Judaism. The leaders of Conservative Judaism felt that Reform Judaism was too radical. They wanted to conserve (protect) Jewish tradition instead of reforming (changing) it. Orthodox Jews do not believe that Reform or Conservative Judaism are correct because they believe that the laws given by God are timeless, and can't be changed. In the most recent survey of Jews in the United States in 2000-2001, it was found that 35% of American Jews say they are Reform, 27% say they are Conservative, 10% say they are Orthodox, 2% say they are Reconstructionist and 25% do not say what type they are. In Israel and Occupied Palestinian Territories, almost all-Jews go to Orthodox Synagogues. There are very few Reform or Conservative synagogues, but there has been a steady increase since 2009. In Israel, Jews do not call themselves Reform, Conservative, or Orthodox. Instead, they mostly call themselves \"Haredi\" (completely religious) \"Dati\" (basically religious), \"Masorati\" (traditional/conservative) or \"Chiloni\" (secular). Surveys suggest about 20% of Israelis say they are secular, 25% say they are Dati or Haredi and 55% say they are traditional. == Names of God == Names are very important in Judaism. Many Jews believe that a name not only tells you who someone is, but also tells you something about them. Names of God are very special in Judaism, so Jews do not write them or speak them fully but use other words instead. That is why some Jews write G-d, with a \"-\" instead of an \"o.\" HaShem Means \"The Name\". It is the word Jews use most often when not praying to talk about Jehovah. Adonai means \"My Lord.\" This name tells Jews about God's position. God is the King of the World, and his name Adonai lets us know that. Elohim means \"one who is strong enough to do everything.\" This name is used when talking about God's power to create or God's justice. This tells us that God is the creator and that God rules the world with just laws. The two names above are so special that traditional Jews use these names only when they pray and read the Torah. When they are not praying or reading the Torah, they say \"Hashem\" (The Name) or \"Elokim\". God - Some Jews write \"God\" by replacing the \"o\" with a dash, like this: \"G-d\". They do this because God's name is very holy so they are not allowed to throw away a piece of paper with \"God\" written on it. However, if by accident \"God\" is written, then the paper can be disposed of in a special way and buried in a special place. Others say that \"God\" is just an English word, not Hebrew, and so it is not holy. YHWH (\"Yehovah\"/\"Yahweh\") is the most sacred name of God in Hebrew, and is not pronounced by most Jews. No one knows where the name came from, or what exactly it means. It looks like the Hebrew word \"hayah,\" which is the verb \"to be.\" (According to Hebrew scripture, when Moses asked God who God was, God told Moses I am that I am/I am who I am.) Jews believe that the name YHWH shows that God is endless. Instead of trying to say it, most Jews say \"haShem\", which means \"The Name.\" Some people pronounce this name as Yahweh or Jehovah. Scholars of religion sometimes refer to \"YHWH\" as the Tetragrammaton, from an old Greek word that means \"four letters\". == References == == Other websites == * Chabad. Large website from the Hassidic group. * The Jewish History Resource Center Project of the Dinur Center for Research in Jewish History; The Hebrew University of Jerusalem. * Judaism article from the 1901-1906 Jewish Encyclopedia * The Jewish Virtual Library * Orthodox Judaism - The Orthodox Union: Official website * The United Synagogue of Conservative Judaism: Official website * Union for Reform Judaism: Official website * Jewish Reconstructionist Federation: Official website * Askmoses.com: Orthodox Judaism site that explains a lot of the basics of Judaism. * The Judaica Press Complete Tanach with Rashi in English * Torah.org. (also known as Project Genesis) Contains Torah commentaries and studies of Tanakh, along with Jewish ethics, philosophy, holidays and other classes. * The complete formatted Talmud online. Interpretative videos for each page from an Orthodox viewpoint are provided in French, English, Yiddish and Hebrew. * Religious Tolerance- Judaism",
 "title": "Judaism"
}