{
 "id": "219817",
 "text": "Eats, Shoots & Leaves: The Zero Tolerance Approach to Punctuation is a non- fiction book by . It was first published in 2003. The book talks about how punctuation is used incorrectly in modern English and why it is important to use it correctly. Truss writes with humour while teaching punctuation rules. == About the book == The book has chapters on different punctuation marks, including: * Apostrophes * Commas * Semicolons and colons * Exclamation marks, question marks, and quotation marks * Italics, dashes, brackets, ellipses, and Emoticons * Hyphens Truss also shares stories and history about punctuation. == Title meaning == The title comes from a joke about bad punctuation: The comma in the wrong place changes the meaning of the sentence. Without it, the sentence means a panda eats plant shoots and leaves. With the comma, it sounds like the panda eats, then shoots a gun, and leaves the café. This joke shows why punctuation is important. == Success and criticism == The book became very popular, especially in the United States and the United Kingdom. It was on The New York Times bestseller list in 2004. However, some people criticized the book. * , a writer for , found punctuation mistakes in the book. He said it was strange for a British person to teach Americans about punctuation. * , a linguist, wrote a book called The Fight for English: How Language Pundits Ate, Shot and Left in 2006. He said Truss and other grammar writers try to stop the English language from changing. * Some people felt the book made people too strict about punctuation. In 2007, comedian said it made people into \"grammar bullies\". == Children's version == In 2006, a children's version of the book was published. It was called Eats, Shoots & Leaves: Why, Commas Really Do Make a Difference!. This version used cartoons to show how commas change meanings. == Related pages == * Der Dativ ist dem Genitiv sein Tod a similar book in German * Standard English == Notes == == References == * * * * * * == Other websites == * Category:2003 books Category:Style guides",
 "title": "Eats, Shoots & Leaves"
}