{
 "id": "220201",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Ochiai was born in Saitama on 28 February 1946. After graduating from Saitama Urawa High School, he joined Toshiba in 1964. He played at offensive position. In 1966, he moved to his local club Mitsubishi Motors played in Japan Soccer League (JSL). He played in all 260 league matches in the league until 1981. In 1969, he became a top scorer and the club won the champions at JSL first time. In the 1970s he was converted to defensive position. In 1973, the club won JSL and Emperor's Cup. In 1978, the club won all three major title in Japan; JSL, JSL Cup, Emperor's Cup and he was selected \"Japanese Footballer of the Year\" awards. He retired in 1984. He played 267 games and scored 56 goals in the league. This 267 games is the second record in JSL after Yoshikazu Nagai (272 games). He was selected Best Eleven 10 times included for 9 years in a row (1973-1981). The club won the league champions 2 times, JSL Cup 2 times and Emperor's Cup 4 times. In September 1974, Ochiai was selected the Japan national team for 1974 Asian Games. At this competition, on 7 September, he debuted against Israel. After his debut, he played in most games included 1976 Summer Olympics qualification, 1978 World Cup qualification and 1978 Asian Games. In 1980, 1980 Summer Olympics qualification was his last game for Japan. He played 63 games and scored 9 goals for Japan until 1980. After retirement, in 1988, Ochiai became an assistant coach for Japan national team under manager Kenzo Yokoyama who was teammate at Mitsubishi Motors. In 1992, Ochiai became an assistant coach for Urawa Reds (former Mitsubishi Motors) under manager Takaji Mori. In 2010, Ochiai was selected Japan Football Hall of Fame. ==Statistics== |- |1966||rowspan=\"19\"|Mitsubishi Motors||rowspan=\"19\"|JSL Division 1||14||6 |- |1967||14||13 |- |1968||14||5 |- |1969||14||12 |- |1970||14||2 |- |1971||14||4 |- |1972||14||1 |- |1973||18||2 |- |1974||18||2 |- |1975||18||3 |- |1976||18||1 |- |1977||18||1 |- |1978||18||1 |- |1979||18||2 |- |1980||18||1 |- |1981||18||0 |- |1982||5||0 |- |1983||2||0 |- |1984||0||0 267||56 267||56 |} Japan National Football Team Database |- |1974||2||0 |- |1975||13||3 |- |1976||15||2 |- |1977||5||0 |- |1978||14||3 |- |1979||9||1 |- |1980||5||0 |- !Total||63||9 |} ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association Category:1946 births Category:Living people Category:Footballers from Saitama Prefecture Category:Japan international footballers Category:Japan Soccer League players Category:Hokkaido Consadole Sapporo players Category:Urawa Red Diamonds players",
 "title": "Hiroshi Ochiai"
}