{
 "id": "220225",
 "text": "List of animal phyla is a list of the major groups of animals usually classified as a phylum. Modern sources have been used: the list is different from that of Linnaeus or Cuvier. A list of this type may be arranged alphabetically; equally it might be arranged according to evolutionary relationships. No list will be completely satisfactory. Authorities differ in what they consider a phylum, and in the actual name of the phylum. Despite this, there is agreement on most phyla. Most modern surveys include groups above the phylum, based on evidence of common descent. Differences of opinion about evolutionary relationships have been reduced by the use of molecular evolution and molecular clock research. These make use of protein amino acid sequences, and whole genome DNA sequence analysis. These modern techniques have led to changes and renaming of many higher categories. Classification based on traditional comparative anatomy had errors which needed to be corrected. For example, the old phylum Coelenterata, which had stood for almost two hundred years, was split down into two separate phyla, the Cnidaria and the Ctenophora. The following list is based on evolutionary relationships:Arthur, Wallace 1997. The origin of animal body plans: a study in evolutionary developmental biology. Cambridge.Nielsen, Claus 2001. Animal evolution: interrelationships of the living phyla. 2nd ed, Oxford.Valentine, James W. 2004. On the origin of phyla. Chicago University Press. == Phyla == Major groups in large text. === Ecdysozoa === *Nematoda: the round worms. For purists, the name Nemata has priority. Despite their rather limited body form, this is a major phylum, with huge numbers in every conceivable habitat. \"More than 15,000 species have been described, of an estimated one million living species\".Barnes R.S.K. Calow P. & Olive P.J.W. 1993. The invertebrates: a new synthesis. Blackwell, Oxford.p90 Nematodes include both free-living and parasitic species of plants and animals, including humans. Of their large number of species most are likely to be parasites.See discussion in Price P.W. Evolutionary biology of parasites, p24 et seq. Princeton N.J. Nematodes are one of the few life-forms in which each species has a defined number of cells.Abercrombie M; Hickman M; Johnson M.L. & Thain M. 1992. The Penguin dictionary of biology, 4th ed. London: Penguin Books, p388/9. *Nematomorpha: small group of nematode-like parasites. They spend their larval stage in the body cavity of arthropods. The adult stage is free, but non-feeding, though it may live for several months. About 250+ species.p85 *Priapulida or Priapula: small phylum of 18 species, with large front section which can be drawn back into the body cavity and extruded for feeding. The larger species are carnivores, seizing prey. The Burgess Shale fauna from the Cambrian shows that the living species are but a remnant of a once much larger group.p358 *Kinorhyncha: another small phylum with an introvert that carries a mouth at the end when extended.p97 Two groups, described as classes in Sørensen.Sørensen M.V. & others 2015. Phylogeny of Kinorhyncha based on morphology and two molecular loci. PLoS One 10, 1–33. 270 species have been described and many more are expected. *Loricifera: a new phylum, discovered in the 1970s. They are microscopic, 100–485μm;Millionths of a metre ~100 species. They have an exoskeleton called a lorica, and an introvert which can be withdrawn into the trunk. They live at the bottom of the water column attached to gravel. Three species live completely without oxygen. Now 37 described species, in nine genera. *Onychophora: the velvet worms. Only 110 species from two families, they are relatives of the Arthropods. *Arthropoda: by far the largest phylum.Discussion in Grimaldi D. & Engel M.S. 2005. Evolution of the Insects. Cambridge, p646/7. ISBN 978-0-521-82149-0 A recent estimate of the number of arthropods on Earth today is 3.7 million species.Counting creatures, Research highlights, Nature vol 465, 27 May 2010 p400. It includes animals with jointed limbs and an exoskeleton made of chitin. There are many opinions about its classification. An arrangement found in several texts is: Superphylum Arthropoda: Phyla Chelicerata, Crustacea, Uniramia (Insects + Myriapoda).p61 If Arthropoda is ranked as a phylum, its subdivisions rank as Subphyla: **Trilobitomorpha: the trilobites, Cambrian to Permian. **Chelicerata. Classes Arachnida: the spiders, mites, scorpions. Xiphosura: horseshoe crab Limulus. Pycnogonida: sea spiders. Eurypterida: sea scorpions (extinct). 63,000 species described.p179 **Myriapoda. Classes: Chilopoda: centipedes. Diplopoda: millipedes. Symphyla and Pauropoda: minor groups. ~3000 species.p187 **Hexapoda. Two classes of hugely different size. Insecta: the insects;Barnesp196 overwhelmingly the most common terrestrial animals, with an estimated 1.5 to 3 million species in about 30 orders. Apterygota are the wingless insects. Development of insects involves many kinds of larvae, both aquatic and terrestrial and, almost always, metamorphosis. The other class, the Entognatha consists of three small groups. **Crustacea. Classes: Branchiopoda: brine shrimps. Cephalocarida: horseshoe shrimps. Maxillopoda: barnacles, fish lice. Ostracoda: seed shrimps. Malacostraca: lobsters, crabs, shrimp. Remipedia: a group of blind underground crustacea, globally distributed but confined to coastal aquifers. First larva is usually a nauplius, which may be followed by other larval stages. *Tardigrada: 'Water bears'. 700 species of microscopic animals from damp or aquatic habitats. Structure is constant: head, four segments, each with two legs. Terrestrial species are adapted to survive extreme conditions. === Lophotrochozoa === *Sipuncula: 150 species, no certain fossil record. Small, tube-like marine animals with long tentacle-like front part which can be pulled in or out. The mouth is surrounded by a ring of cilia. Has pelagic larvae. *Mollusca: a great phylum by number of species and by variety of body forms; largely aquatic. Hugely important fossil record from the Lower Cambrian. A major food source for mankind, second only to fish. United by their mantle, the muscular 'foot', the radula (teeth band), and (ancestrally) by the shell. Number of living species estimated as 50,000 to 150,000. Classes: lesser classes are the Aplacophora, Monoplacophora, and Polyplacophora. Major classes are the Gastropods, Cephalopods, Bivalves and Scaphopods. A familiarity with bivalve evolution is valuable for identifying strata, so common are their fossils. Larvae are trochophores; or veligers (many gastropods & bivalves); glochidium (some freshwater bivalves). *Annelida: important phylum of both aquatic and terrestrial segmented worms. At least 15,000 living species. Fossil record weak, evolutionary history not well known. Classes: Polychaeta (marine worms), Oligochaeta (earthworms), Hirudinea (leeches). Larvae are trochophores or nectochaeta. *Bryozoa, also known as the Ectoprocta: An aquatic phylum with a huge fossil record (one of the most common in the Palaeozoic). Still fairly common, though little known to the public. There are now 5000 species, most of which build calcareous skeletons. They are almost all colonial, and all their zooids are clones. *Phoronida: A very small phylum, with 12 species. Live on the sea floor (benthic), build chitinous tubes covered with mud or sand or bore into calcareous rock. Usually have horeshoe-shaped lophophores with ciliated tentacles. *Nemertea or Nemertini: flat, unsegmented ribbon worms, mostly aquatic. They have also been called Rhynchocoela or proboscis worms. About 1400 species. There have been reports of extremely long ribbon worms, unconfirmed. Larvae are pilidiums. *Platyhelminthes: the flatworms. Classes: Turbellaria: free-living and aquatic (4,500 species); Trematoda: parasitic flukes of molluscs and vertebrates (~1500 species); Cestoda: tapeworms, parasitic in the digestive tract of vertebrates (3400 species); Monogenea: ectoparasites on the gills and skin of fish (1100 species). Müller's larva is characteristic of the free-living species, but in the parasitic groups development may be direct. *Rotifera: the rotifers. The rotifers (2200 species) are everywhere in transient pools and in sea and fresh water. The ring of cilia circling the mouth and the protective lorica are distinctive. The phylum now includes the Acanthocephala, parasitic thorn-headed worms. *Brachiopoda: the lamp-shells, with a huge fossil record going back to the Cambrian. 12,000 species, of which 350 are still living (or 100 according to Clarkson).Clarkson E.N.K. 1998. Invertebrate palaeontology and evolution. 4th ed, Blackwell, Oxford.p158 They look rather like bivalves, and they do have an upper and lower part to the shell. However, their internal organisation is quite different.Rudwick M.J.S. 1970. Living and fossil brachiopods. Hutchinson, London.p395 They were the dominant inshore fauna (infauna) of the Palaeozoic, but were much reduced by the two main extinction events, the P/Tr and K/T. Bivalve molluscs took over their inshore habitats in the Mesozoic, and since then the brachiopods have been confined to deeper water, except for a handful of species. *Entoprocta: A small phylum (150 species) of sessile benthic marine animals. *Gastrotricha: another phylum of small aquatic animals, with about 700 species. They are bilateral with a complete gut. They are covered with cilia, and have two terminal glands. One gland secretes cement, the other dissolves it. They have a short life span of a few days. === Deuterostomia === *Xenacoelomorpha: A group of marine benthic worms consisting of 3 main lineages defined by a blind gut, a net-like nervous system, and lack of nephridia. The position of this group on the tree of life is currently debated as either the sister group to all other Bilateria or as sister to all other Deuterostomia **Xenoturbellida: Benthic marine worms, often found in the deeps sea, sizes between 2–20cm. **Acoela: very small marine worms (usually under 2 millimeters in length) found in marine and brackish waters usually living in the benthos. **Nemertodermatida: small marine worms. ~11 described species. Closely related to Acoela, but differ in that unlike Acoela, they have a permanent intestinal cavity *Echinodermata: One of the most important marine phyla, with radial symmetry. 17,000 living species, which all live in the ocean, mostly on the sea bed. This is the largest phylum which is entirely marine. The main classes are quite well-known. The Crinoids are 'sea lilies', a remnant of a once great clade; the Asterozoa are the starfish, major predators of shell-fish, and the brittle stars. The Echinozoa are the sea urchins, sand dollars and the sea cucumbers. There are also some extinct groups. The echinoderm fossil record is extensive. Larvae are varied and planktonic: pluteus (echinoids); dipleurula, then bipinneria; then brachiolaria (starfish); ophiopluteus (brittle stars); doliolaris (sea cucumbers). *Hemichordata: The Chordates' closest relatives, three groups which are brought together in most modern taxonomies. **Enteropneusta: the acorn worms. A small, well-defined group with 70 marine species. Relatives of the chordates. **†Graptolites: fossil colonial animals. **Pterobranchia: a small sub-phylum of two or three marine groups which usually build tubes, and form small colonies on sea floor. They have a long fossil record. Zooids carry prominent ciliated tentacles. *Chordata: the phylum which contains the vertebrates. As with the Arthropoda, some taxonomists regard this as a Superphylum, with three phyla. Here, the chordata has three sub-phyla: **Urochordata: the tunicates. **Cephalochordata: the lancelates, such as the former Amphioxus. **Craniata or Vertebrata: the vertebrates. About 60,000 species recognised. The term vertebrate usually now excludes the lamprey and hagfish, which are included in the broader term craniate. === Other Bilateria phyla === *Cycliophora: a recently discovered group of tiny animals which live on lobsters. One genus and three species so far. *Gnathostomulida: jaw worms, a small phylum of small marine animals (100 species). Hermaphrodite, live in muddy benthic habitat, scape food from particles with their jaw. *Chaetognatha: arrow worms. Only about 120 species, but huge numbers in the plankton; some are benthic. They are predators, up to 12 cm long. They use a neurotoxin to subdue prey. *Orthonectida: a small phylum of parasites of marine invertebrates. === Non-Bilateria === *Cnidaria: a large phylum, with an extensive fossil record. 10,000 living species. Aquatic, mainly marine, five classes: **Anthozoa (sea anemones, corals) **Scyphozoa (true jellyfish) **Cubozoa (box jellies) **Staurozoa (stalked jellyfish). **Hydrozoa: the hydroids *Placozoa: Two described species: Trichoplax adhaerens, discovered in 1883 and ```Hoilungia hongkongensis```. Small, about 2mm, aquatic, eats bacteria and single-celled algae & protozoa. *Ctenophora: comb jellies. ~200 described species, Aquatic, all marine, usually transparent with eight comb rows of fused cilia. Mostly pelagic but several benthic species. *Porifera: sponges. 5000 species, aquatic mainly marine but several fresh water species, Have collared cells with long cilia. Sessile, have cell differentiation.Cells of different types Skeleton are of spongin, or are calcareous CaCO3, or silicious SiO2. == Reflections == At least 21 phyla are exclusively aquatic, with several others in quasi-aquatic habitats on land. None are entirely terrestrial. This is testimony to the importance of water for life, and to the sea in particular. It is fairly certain that all phyla originated in the sea or, at any rate, in water. Most made their first showing in the Cambrian, or in the Ediacaran. Most of the soft-bodied phyla have left few fossils. Phyla may be grouped according to evidence about their evolutionary relationships. The list above puts similar groups together. This kind of megataxonomy is becoming more convincing as DNA sequence analysis proceeds through the phyla. Some entirely fossil groups are still placed where they are on anatomy and commonsense rather than hard molecular evidence. The trilobites are a good example. Their position in the Arthropoda is based on not much more than their bilateral symmetry and an exoskeleton. These groupings are discussed further in the references to this page. == Sortable table == This table has the advantage of being sortable. The terminology differs in places from the above descriptions. Also, by listing living species only for most phyla, those with huge fossil records (like Bryozoa and Brachiopods) are lower in the order despite being important aquatic forms in the Palaeozoic era. Phylum Meaning Common name Distinguishing characteristic Species described Acanthocephala Thorny headed worms Thorny-headed worms Reversible spiny proboscis. Now usually included in Rotifera. extant (= living) Acoelomorpha Without gut Acoels No mouth or alimentary canal (alimentary canal = digestive tract in digestive system) 483 Annelida Little ring Segmented worms Multiple circular segment 20,481+ extant Arthropoda Jointed foot Arthropods Chitin exoskeleton Brachiopoda Arm foot Lamp shells Lophophore and pedicle 11,082 extant Bryozoa Moss animals Moss animals, sea mats Lophophore, no pedicle, ciliated tentacles 5,609 extant Chaetognatha Longhair jaw Arrow worms Chitinous spines either side of head, fins 132 extant Chordata With a cord Chordates Hollow dorsal nerve cord, notochord, pharyngeal slits, endostyle, post-anal tail 65,000+ Cnidaria Stinging nettle Coelenterates Nematocysts (stinging cells) 11,791 Ctenophora Comb bearer Comb jellies Eight \"comb rows\" of fused cilia 210 extant Cycliophora Wheel carrying Symbion Circular mouth surrounded by small cilia 2 Echinodermata Spiny skin Echinoderms Fivefold radial symmetry in living forms, mesodermal calcified spines 10,832 Entoprocta Inside anus Goblet worm Anus inside ring of cilia 171 Gastrotricha Hair stomach Meiofauna Two terminal adhesive tubes 851 Gnathostomulida Jaw orifice Jaw worms 101 Hemichordata Half cord Acorn worms, pterobranchs Stomochord in collar, pharyngeal slits 139 Kinorhyncha Motion snout Mud dragons Eleven segments, each with a dorsal plate 188 Loricifera Corset bearer Brush heads Umbrella- like scales at each end 27 Micrognathozoa Tiny jaw animals — Accordion-like extensible thorax. Newly discovered; close to Rotifers. Mollusca Soft Mollusks / molluscs Muscular foot and mantle round shell 85,844 Nematoda Thread like Round worms Round cross section, keratin cuticle 3,452 Nematomorpha Thread form Horsehair worms 361 Nemertea A sea nymph Ribbon worms 1,351 Onychophora Claw bearer Velvet worms Legs tipped by chitinous claws 205 Orthonectida Straight swim Single layer of ciliated cells surrounding a mass of sex cells 25 Phoronida Zeus's mistress Horseshoe worms U-shaped gut 19 Placozoa Plate animals 2 Platyhelminthes Flat worms Flat worms 18,089 Porifera* Pore bearer Sponges Perforated interior wall 9,049 Priapulida Little Priapus 22 Rhombozoa Lozenge animal — Single axial cell form front to back, surrounded by ciliated cells Rotifera Wheel bearer Rotifers crown of cilia at front 2,011 Sipuncula Small tube Peanut worms Mouth surrounded by invertible tentacles 205 Tardigrada Slow step Water bears Four segmented body and head 1,018 Xenoturbellida Strange flatworm — Ciliated deuterostome 4 Total: 35 1,356,899 and more species being discovered every day Protostome Bilateria Deuterostome Basal/disputed Others (Radiata or Parazoa) == Groups formerly ranked as phyla == This list is to help when you read older literature which may use out-of- date terms. Name as phylum Common name Current consensus Aschelminthes Pseudocoelomates Divided into several pseudocoelomate phyla. Craniata — Subgroup of phylum Chordata; perhaps synonymous with Vertebrata. Cephalochordata Lancelets Subphylum of phylum Chordata. Cephalorhyncha — Superphylum Scalidophora. Coelenterata — Divided into phyla Cnidaria and Ctenophora. Echiura Spoon worms Class of phylum Annelida. Enterepneusta Acorn worms Class of phylum Hemichordata. Gephyra Peanut worms and spoon worms Divided into phyla Sipuncula and Echiura. Mesozoa Mesozoans Divided into phyla Orthonectida and Rhombozoa. Myxozoa Severely modified Cnidarians. Pentastomida Tongue worms Subclass of Maxillopoda of phylum Arthropoda. Pogonophora Beard worms Part of family Siboglinidae of phylum Annelida. Pterobranchia — Class of phylum Hemichordata. Symplasma Glass sponges Class Hexactinellida of phylum Porifera. Urochordata Tunicates Subphylum of phylum Chordata. Vestimentifera Vent worms Part of family Siboglinidae of phylum Annelida. == References == * Ruppert, Edward E; Fox, Richard Barnes, Robert D. 2003. Invertebrate zoology: a functional evolutionary approach. Revision of Barnes' standard textbook. 1008 pages. * Category:Invertebrates Category:Lists of animals * Category:Glossaries",
 "title": "List of animal phyla"
}