{
 "id": "220487",
 "text": "A medical school is a place where medical students learn medicine. When they graduate from a medical school, they become a physician or a doctor. Medical Schools grant Doctor of Medicine (MD),Pinkas, M. M., Schnur, A., Wolff, M., Hovde, S., & Harling-Henry, C. (2012). University of Maryland Early Dissertations for Doctor of Medicine (1813–1889): Challenges and Rewards of a Digitization Project. Journal of electronic resources in medical libraries, 9(4), 261-271. Doctor of Osteopathic Medicine (DO)Gevitz, N. (2019). The DOs: osteopathic medicine in America. JHU Press.Gevitz, N. (2009). The transformation of osteopathic medical education. Academic Medicine, 84(6), 701-706.Gevitz, N. (2014). From “Doctor of Osteopathy” to “Doctor of Osteopathic Medicine”: a title change in the push for equality. J Am Osteopath Assoc, 114(6), 486-497.Norander, S., Mazer, J. P., & Bates, B. R. (2011). “DO or Die”: Identity negotiation among osteopathic medical students. Health Communication, 26(1), 59-70. and sometimes Doctor of Philosophy (PhD) Degrees. Students take classes in human biology and disease then take a license exam to practice medicine. ==Medical student== A medical student or student doctor is a person who has been accepted to a medical school and is studying to become a doctor. Medical students are typically required to learn about basic health, science, technology and the clinical practice of medicine. Medical students learn human anatomy,Moore, K. L., & Dalley, A. F. (2018). Clinically oriented anatomy. Wolters kluwer india Pvt Ltd.Tortora, G. J., & Derrickson, B. H. (2018). Principles of anatomy and physiology. John Wiley & Sons. physiology,Wilmore, J. H., Costill, D. L., & Kenney, W. L. (1994). Physiology of sport and exercise (Vol. 524). Champaign, IL: Human kinetics.Keener, J. P., & Sneyd, J. (1998). Mathematical physiology (Vol. 1). New York: Springer. diseases, and different drugs. Medical students are generally considered to be at the earliest stage of the medical career pathway. In some locations they are required to be registered with a government body. Medical students typically engage in both basic science and practical clinical coursework during their tenure in medical school. Course structure and length vary greatly among countries. ==Notable medical schools== ===USA=== It might be needless to say that the Ivy League universities have one of the greatest medical schools in the world.Feletti, D. (1989). The new pathway to general medical education at Harvard University. Teaching and Learning in Medicine: An International Journal, 1(1), 42-46.Moss, S. F., Arnold, R., Tytgat, G. N. J., Spechler, S. J., Delle Fave, G., Rosin, D., ... & Modlin, I. M. (1998). Consensus statement for management of gastroesophageal reflux disease: Result of workshop meeting at Yale University School of Medicine, Department of Surgery, November 16 and 17, 1997. Journal of clinical gastroenterology, 27(1), 6-12.Paul, J. R. (1950). Preventive medicine at the Yale University School of Medicine, 1940-49. The Yale journal of biology and medicine, 22(3), 199.Baserga, S. J. (1980). The early years of coeducation at the Yale University School of Medicine. The Yale journal of biology and medicine, 53(3), 181. Generally, most large-scale American universities (such as Stanford UniversityFassiotto, M., Simard, C., Sandborg, C., Valantine, H., & Raymond, J. (2018). An integrated career coaching and time banking system promoting flexibility, wellness, and success: a pilot program at Stanford University School of Medicine. Academic medicine: journal of the Association of American Medical Colleges, 93(6), 881.Rubenstein, E. (1973). Continuing medical education at Stanford: the back-to-medical-school program. Academic Medicine, 48(10), 911-8.Deuse, T., Haddad, F., Pham, M., Hunt, S., Valantine, H., Bates, M. J., ... & Reitz, B. A. (2008). Twenty‐year survivors of heart transplantation at Stanford University. American Journal of Transplantation, 8(9), 1769-1774.) have a medical school. ===Europe=== ====UK==== In the United Kingdom, Oxford University has made great medical textbooks through the Oxford University Press.Hanks, G., Cherny, N. I., Christakis, N. A., & Kaasa, S. (Eds.). (2011). Oxford textbook of palliative medicine. Oxford University Press.Longmore, M., Wilkinson, I., Baldwin, A., & Wallin, E. (2014). Oxford Handbook of Clinical Medicine-Mini Edition. OUP Oxford. Imperial College London is also famous for their medical education.Gay, H. (2007). The history of Imperial College London, 1907-2007: higher education and research in science, technology, and medicine. Imperial College Press.Cousins, J., & Perris, K. (2009). Supporting research at the faculty of medicine: the development of imperial college London’s Medicine Information Literacy Group. Journal of Information Literacy, 3(1), 60-67. ====Mainland Europe==== Karolinska Institutet is known as one of the greatest medical school in mainland Europe.Lindquist, C., & Kihlström, L. (1996). Department of neurosurgery, Karolinska Institute: 60 years. Neurosurgery, 39(5), 1016-1021.Rubio, C., & Befrits, R. (2008). Colorectal cancer in Crohn's disease—review of a 56-year experience in Karolinska Institute University Hospital. Journal of Environmental Pathology, Toxicology and Oncology, 27(4).Toraker, P., & Rydberg, U. S. (1989). New mandatory course in alcohol and drug dependence for medical students at The Karolinska Institute. Advances in alcohol & substance abuse, 8(1), 55-66. They are also involved in the Nobel Prize in Physiology or Medicine.Ljunggren, B., & Bruyn, G. W. (2002). The Nobel Prize in Medicine and the Karolinska Institute: The Story of Axel Key and Alfred Nobel. Karger Medical and Scientific Publishers. ===Asia=== ====Singapore==== Yong Loo Lin School of MedicineWee, L. E., Yeo, W. X., Tay, C. M., Lee, J. J., & Koh, G. C. (2010). The pedagogical value of a student-run community-based experiential learning project: the Yong Loo Lin School of Medicine Public Health Screening. Annals Academy of Medicine Singapore, 39(9), 686.Sayampanathan, A. A., Tan, Y. T. W., Fong, J. M. N., Koh, Y. Q., Ng, C. L., Mohan, N., ... & Tambyah, P. A. (2017). An update on finances and financial support for medical students in Yong loo Lin school of medicine. Singapore medical journal, 58(4), 206. at the National University of Singapore (NUS) and Lee Kong Chian School of MedicineLee Foundation makes $150 million gift to NTU's new medical school News release, 4 January 2011Partridge, M. R. (2013). Redefining medicine, transforming healthcare: the Lee Kong Chian school of medicine. Ann Acad Med Singapore, 42, 165-167. at Nanyang Technological University are famous medical schools with unique names. For graduate level, Duke-NUS Medical SchoolWilliams, R. S., Casey, P. J., Kamei, R. K., Buckley, E. G., Soo, K. C., Merson, M. H., ... & Dzau, V. J. (2008). A global partnership in medical education between Duke University and the National University of Singapore. Academic Medicine, 83(2), 122-127.Chow, P. K. H., Soh, C. R., Tay, S. M., & Cook, S. (2009). An integrated approach to learning anatomy, physiology and micro-anatomy: A clinician-based system at Duke-NUS Graduate Medical School Singapore.Takada, K., Suzuki, T., Akita, K., Nara, N., & Tanaka, Y. (2011). Team–Based Learning at the Duke–NUS Graduate Medical School Singapore. Medical Education, 42(3), 153-157.De Silva, D. A., Allen, J. C., Krishnaswamy, G., Vogel, S., & Cook, S. (2013). Patient oriented research: the Duke-NUS medical student experience. Medical Science Educator, 23(1), 141-147. is operated with Duke University.Zumwalt, A. C., Marks, L., & Halperin, E. C. (2007). Integrating gross anatomy into a clinical oncology curriculum: The oncoanatomy course at Duke University School of Medicine. Academic Medicine, 82(5), 469-474.March, J. S., Chrisman, A., Breland-Noble, A., Clouse, K., D'Alli, R., Egger, H., ... & Rana, A. (2005). Using and teaching evidence-based medicine: the Duke University child and adolescent psychiatry model. Child and Adolescent Psychiatric Clinics, 14(2), 273-296.Heflin, M. T. (2006). The senior mentor program at Duke University School of Medicine. Gerontology & geriatrics education, 27(2), 49-58. ====Japan==== Some major universities in Japan also includes a high quality medical school: * Keio UniversityPlotnikoff, G. A., & Amano, T. (2007). A culturally appropriate, student-centered curriculum on medical professionalism. Successful innovations at Keio University in Tokyo. Minnesota medicine, 90(8), 42.Hasegawa, M., Tomioka, S., & Kobayashi, Y. (1976). Clinical study of gram negative rods (GNR) septicemia at Keio University Hospital. In Chemotherapy (pp. 151-154). Springer, Boston, MA.Yamashita, H., Dokiya, T., & Hashimoto, S. (1986). Experience at Keio University Hospital for Cf-252 radiation therapy of tumors of the head and neck and other sites. Nucl. Sci. Appl, 2(3), 555-569.Liu, M., Hase, K., Tsuji, T., Fujiwara, T., Yamada, S., Masakado, Y., & Kimura, A. (2005). Clinical electromyography and electrodiagnosis course at Keio University Hospital—a 7-year experience. The Keio Journal of Medicine, 54(4), 193-196. * Kyoto UniversitySchool of Public Health is independently operated.Kasahara, M., Takada, Y., Egawa, H., Fujimoto, Y., Ogura, Y., Ogawa, K., ... & Tanaka, K. (2005). Auxiliary partial orthotopic living donor liver transplantation: Kyoto University experience. American journal of transplantation, 5(3), 558-565.Sakamoto, S., Egawa, H., Kanazawa, H., Shibata, T., Miyagawa‐Hayashino, A., Haga, H., ... & Uemoto, S. (2010). Hepatic venous outflow obstruction in pediatric living donor liver transplantation using left‐sided lobe grafts: Kyoto University experience. Liver Transplantation, 16(10), 1207-1214.Morioka, D., Kasahara, M., Takada, Y., Shirouzu, Y., Taira, K., Sakamoto, S., ... & Tanaka, K. (2005). Current role of liver transplantation for the treatment of urea cycle disorders: a review of the worldwide English literature and 13 cases at Kyoto University. Liver transplantation, 11(11), 1332-1342.Tamura, Y., Tanaka, S., Asato, R., Hirano, S., Yamashita, M., Tamaki, H., & Ito, J. (2007). Therapeutic outcomes of laryngeal cancer at Kyoto University Hospital for 10 years. Acta Oto- Laryngologica, 127(sup557), 62-65.Kokubo, M., Mitsumori, M., Ishikura, S., Nagata, Y., Fujishiro, S., Inamoto, T., ... & Hiraoka, M. (2000). Results of breast-conserving therapy for early stage breast cancer: Kyoto University experiences. American journal of clinical oncology, 23(5), 499-505.Kozaki, K., Kasahara, M., Oike, F., Ogawa, K., Fujimoto, Y., Ogura, Y., ... & Tanaka, K. (2002). Apheresis Therapy for Living‐Donor Liver Transplantation: Experience of Apheresis Use for Living‐Donor Liver Transplantation at Kyoto University. Therapeutic Apheresis, 6(6), 478-483. * Nihon UniversityKumasaka, K. (2003). Mandatory postgraduate medical training in Japan--present state of Nihon University as a private medical school. Rinsho byori. The Japanese journal of clinical pathology, 51(4), 362-366.Hamada, N., Endo, S., & Tomita, H. (2002). Characteristics of 2278 patients visiting the Nihon University Hospital Taste Clinic over a 10-year period with special reference to age and sex distributions. Acta Oto-Laryngologica, 122(4), 7-15. * Osaka UniversityTeshitma, T., Inoue, T., Ikeda, H., Murayama, S., Yamasaki, H., Inoue, T., ... & Nishiyama, K. (1993). High‐dose rate and low‐dose rate intracavitary therapy for carcinoma of the uterine cervix. Final results of Osaka University Hospital. Cancer, 72(8), 2409-2414.Inamura, K., Satoh, K., Kondoh, H., Mori, Y., & Kozuka, T. (1994). Technology assessment of PACS in Osaka University Hospital. Computer methods and programs in biomedicine, 43(1-2), 85-91. * Tokyo Medical and Dental University * Tokyo Women's Medical UniversityOguni, H., Hayashi, K., Awaya, Y., Fukuyama, Y., & Osawa, M. (2001). Severe myoclonic epilepsy in infants–a review based on the Tokyo Women's Medical University series of 84 cases. Brain and Development, 23(7), 736-748.Fukuda, I., Hizuka, N., Murakami, Y., Itoh, E., YASUMOTO, K., SATA, A., & TAKANO, K. (2001). Clinical features and therapeutic outcomes of 65 patients with acromegaly at Tokyo Women's Medical University. Internal medicine, 40(10), 987-992.Iseki, H., Nakamura, R., Muragaki, Y., Suzuki, T., Chernov, M., Hori, T., & Takakura, K. (2008). Advanced computer-aided intraoperative technologies for information-guided surgical management of gliomas: Tokyo Women's Medical University experience. min-Minimally Invasive Neurosurgery, 51(05), 285-291. * University of TokyoIchimura, K., Nibu, K. I., & Tanaka, T. (1997). Nerve paralysis after surgery in the submandibular triangle: review of University of Tokyo Hospital experience. Head & neck, 19(1), 48-53.Sora, S., Ueki, K., Saito, N., Kawahara, N., Shitara, N., & Kirino, T. (2001). Incidence of von Hippel-Lindau disease in hemangioblastoma patients: the University of Tokyo Hospital experience from 1954–1998. Acta neurochirurgica, 143(9), 893-896.Ohe, K., & Kaihara, S. (1996). Implementation of HL7 to client-server hospital information system (HIS) in the University of Tokyo Hospital. Journal of medical systems, 20(4), 197-205.Togashi, J., Akamastu, N., & Kokudo, N. (2016). Living donor liver transplantation for hepatocellular carcinoma at the University of Tokyo Hospital. Hepatobiliary Surgery and Nutrition, 5(5), 399.Akamatsu, N., & Kokudo, N. (2016, May). Living liver donor selection and resection at the University of Tokyo Hospital. In Transplantation Proceedings (Vol. 48, No. 4, pp. 998-1002). Elsevier. ==== Uzbekistan ==== * Samarkand State Medical University ==References== Category:Tertiary education",
 "title": "Medical school"
}