{
 "id": "220489",
 "text": "Doom 3 (or Doom III in roman numerals), is a sequel to the first-person shooter game Doom 2. It was created by iD Software, and came out in 2004. It was the first to not be based on the same game engine as Doom and Doom 2, and had 40 levels. Even though the game is named Doom 3, the game is not a direct sequel, which means the story does not take place after Doom or Doom 2. In fact, it is a reboot of the first Doom, which means it is a new start to the Doom story. Doom 3 has a very dark environment, and the player carries a flashlight to light the way, although the flashlight can't be used at the same time as the weapons. However, this feature changed the BFG Edition, where the player does not carry the flashlight like a weapon, but the player can use at any time during gameplay. That being said, the player must be careful not to use the flashlight too long, because the flashlight will automatically turn off after it runs after battery, and the player must wait for the battery to recharge before using the flashlight again. The game had two expansions, Resurrection of Evil and Lost Mission. == Changes from Doom 2 == * Much slower pace of gameplay *Much more emphasis on survival horror *Much higher texture resolution and quality * More focus on the plot than in the original Doom *Cutscenes are shown in third person, which means the player can see their own character during these cutscenes * Contains video and speech * Most of the weapons and monsters from Doom 2 are present, but they look different *Three new weapons are added in the main campaign, the Machine Gun, Grenades, and the Soul Cube *One new weapon was added to Resurrection of Evil, the Grabber * Support for room-over-room, colored lighting, mouse look, and sloped surfaces * Support for scripting * Most (but not all) sounds replaced * Weapons must be reloaded and do not fire continuously * Monsters are faster and will charge at the player and attempt to dodge the player's bullets *New monsters are added, such as Cherubs, Trites, Vagaries, Wraiths, and Maggots, etc. *Most of the boss enemies are only in Doom 3 (except for the Cyberdemon) *Many more jumpscares * Cheat codes are different (typing one of the original cheat codes displays the message \"your memory serves you well!\") * The status bar face was removed * The player now carries a \"PDA\" (Personal Data Assistant) that is used to unlock doors (in Doom 2 red, yellow, and blue keys unlocked doors) * No clipping (walk through walls/floors) cheat code disables clipping through both walls and floors (in Doom 2 it only disabled clipping through walls) * Nightmare mode is not playable until completing the game on any of the lower difficulty modes * Some monsters from Hell no longer leave behind corpses (but zombies still do) *The player can only sprint for a short time before needing to recharge (except in the Hell levels) ==Related pages== *Doom *Doom 2 *Doom 64 *Doom (2016 video game) ==Notes== ==References== ==Other websites== *Doom 3 on the Doom Wiki Category:2004 video games Category:2000s horror video games Category:Activision video games Category:Bethesda Softworks games Category:Cooperative video games Category:Doom (franchise) Category:First- person shooters Category:Id Software games Category:Linux games Category:MacOS games Category:Multiplayer and single-player video games Category:Multiplayer online games Category:Nintendo Switch games Category:PlayStation 3 games Category:PlayStation 4 games Category:PlayStation VR games Category:Science fiction video games Category:Vicarious Visions games Category:Video game sequels Category:Video games developed in the United States Category:Video games set in hell Category:Windows games Category:Xbox games Category:Xbox 360 games Category:Xbox One games",
 "title": "Doom 3"
}