{
 "id": "220532",
 "text": "The Na'vi are a fictional indigenous species that live on the fictional world of Pandora in the movie Avatar. They look like humans. They have two eyes, ears, arms, and legs. They also have a nose, a mouth, and expressions that are similar to humans. The Na'vi are different because all of them have blue skin, pointed ears, huge eyes, and tails. They are also taller than humans. They have a smaller body frame. At the beginning, the Na'vi were meant to be more alien in their looks. Director James Cameron said that in the first drawing of the main character, \"Neytiri\", she had fins, gills, and cat-like features. The species was changed to look more like humans. This was so thataudiences could relate (feel closer and empathise) to them better. Cameron said that Avatar was more \"science fantasy\" than true science fiction. He said that he would explain in the novel why the Na'vi look like humans. According to Entertainment Weekly, \"The Na'vi can commune with animals on their planet by literally plugging their ponytails into the creatures' nerve systems. To become a warrior, a Na'vi must tame and ride a creature known as Ikran.\"Josh Rottenberg, \"James Cameron Talks Avatar: Brave Blue World,\" Entertainment Weekly #1081 (December 18, 2009): 51. The Na'vi also use this system to mate with a \"life partner\". They make a bond that cannot be broken in the Na'vi's lifetime. The Na'vi language is a constructed language. It was made for the movie to be spoken by the actors when they played Na'vi characters. The Na'vi language was made by linguistics professor Paul Former of the University of Southern California. Frommer made the language so it could be spoken by human actors. It uses syntax and grammar from real languages. The professor made up over 1,000 words for the Na'vi language. He taught the actors who played Na'vi characters to speak it for the movie. ==Related pages== *Avatar *Na'vi language *Fictional universe in Avatar ==References== Category:Fictional races",
 "title": "Na'vi"
}