{
 "id": "220720",
 "text": "The Marvelous Misadventures of Flapjack is an animated television series made for Cartoon Network. The show was made by cartoonist Thurop Van Orman, who has worked as a writer and storyboard artist on Camp Lazlo and The Grim Adventures of Billy & Mandy. The main characters Captain K'nuckles, Flapjack & Bubbie, are trying to find the magical island \"Candied Island.\" Flapjack is an adventurous little boy taking after and learning from Captain K'nuckles. K'nuckles plays the role of a lazy sailor who is addicted to maple syrup. Bubbie is a antropomorphic whale who is the foster mother of Flapjack and protects him from dangerous situations, while he is being accompanied by K'nuckles. == Characters == * Flapjack (voiced by Thurop Van Orman) is a cheerful yet gullible orphan who was raised by Bubbie at a young age. Flapjack's biological parents are never seen or mentioned. Flapjack is naïve and oblivious to danger, and he is easily caught in dangerous situations. He holds K'nuckles in extremely high regard, with his affection for the captain sometimes bordering on obsession, although he can exhibit some anger towards K'nuckles when he lies to him. During the ending of the final episode, Thurop's son Leif plays the role of Flapjack. Flapjack's original voice actor was meant to be Paul Reubens, but Reubens never showed up to any recording sessions, so Van Orman voiced Flapjack himself. * Captain K'nuckles (voiced by Brian Doyle-Murray) is an old Irish sea captain. He claims to be a great adventurer, often telling Flapjack fabricated or exaggerated stories of his past experiences. K'nuckles enjoys candy and maple syrup, often valuing the acquisition of candy more than his relationships. Because of his often sociopathic behavior, K'nuckles has earned the open hostility and disrespect of nearly everybody in Stormalong. Although he often exploits Flapjack for his own needs, he is fond of him and will often attempt to get him out of trouble or make things right when a scheme of theirs goes too far. His hands, legs, and bottom are wooden prosthetics. During the ending of the final episode, Thurop Van Orman portrays live-action K'nuckles. * Bubbie (voiced by Roz Ryan) is an anthropomorphic whale. She is Flapjack's adoptive mother; she found him at sea in a bed of seaweed when he was a baby. Knuckles and Flapjack live inside her mouth, and she serves as their transportation as well as home. Bubbie disapproves of Flapjack's adventures, and she views K'nuckles as a bad influence on him. However, she often caves in, allowing Flapjack to go on adventures despite her wishes. == Episodes == === Season 1 (2008-2009) === # Several Leagues Under the Sea / Eye Sea You (June 5, 2008) # Several Leagues Above the Sea / That's a Wrap! (June 12, 2008) # Looking for Love in the Wrong Barrels / Beard Buddies (June 19, 2008) # Skooled / Snarked (June 26, 2008) # Cammie Island / Shave and a Haircut (July 3, 2008) # How's the West Even Fun / Knuckles is a Filthy Rat (July 10, 2008) # Foot Burn / Hand it Over (July 17, 2008) # Sittin' Muscle / Knot Funny (July 24, 2008) # Kid Nickles / The Sweet Life (July 31, 2008) # Pun Times with Punsie McKale / Balance (August 7, 2008) # Mechanical Genie Island / Revenge (August 14, 2008) # Oh Brother / Panfake (August 21, 2008) # Lead Em and Weep / Sea Urchins (December 4, 2008) # Sea Legs / No Syrups for Old Flapjacks (March 5, 2009) # Plant Man / Fish Heads (March 12, 2009) # Something's a Miss / Gone Wishin' (June 11, 2009) # Love Bugs / Ben Bozzled (June 18, 2009) # Whale Times / Candy Cruise Blues (June 25, 2009) # My Guardian Angel is Killing Me! / Dear Diary (July 2, 2009) # Diamonds in the Stuff / Tee Hee Tummy Tums (July 16, 2009) === Season 2 (2009-2010) === # Jar She Blows! / Behind the Curtains (July 30, 2009) # Shut It / Who's Mooching Who? (August 6, 2009) # Over the Moon / 100 Persensus (August 13, 2009) # Off with his Hat / Knuckles and his Hilarious Problem (August 20, 2009) # Fancy Pants / Cuddle Trouble (August 27, 2009) # Who's the Man in the Mirror? / Unhappy Endings (September 3, 2009) # S.S. Knuckies / Candy Casanova (September 10, 2009) # Down with the Ship / Willy! (October 8, 2009) # Bubbie's Tummy Ache / Mind the Store, Don't Look in the Drawer (October 15, 2009) # Please Retire / Under the Sea Monster (October 22, 2009) # Flapjack Goes to a Party / Rye Rve Roo (October 29, 2009) # Low Tidings (December 3, 2009) # Come Home, Cap'n! / Fastest Man Alive (March 4, 2010) # Oh You Animal / The Return of Sally Syrup (March 18, 2010) # Lazy Bones / Two Old Men and a Lock Box (April 5, 2010) # BAM! / Lost at Land (April 12, 2010) # Just One Kiss / Wishing Not So Well (April 19, 2010) # N is for Navy / What's Eaten Ya, Cap'n? (April 26, 2010) # I'm So Proud of Me / A Day Without Laughter (May 3, 2010) # All Hands on Deck (May 10, 2010) === Season 3 (2010) === # Be Careful What You Fish For / Mayor May Not (July 5, 2010) # I'm a Believer / Liar, Liar, You for Hire? (July 12, 2010) # Candy Colleague / These Boots Make You Walking On your Face (July 19, 2010) # High Landlubber / Who Let the Cats out in the Old Bag's House? (July 26, 2010) # Parfit Storm / Knuckles, Don't Be a Hero! (August 2, 2010) # Catch Me if you Candy / Fish Out of Water (August 31, 2010) Category:Animated television series Category:Cartoon Network series Category:English-language television programs Category:2008 television series debuts Category:2010 television series endings",
 "title": "The Marvelous Misadventures of Flapjack"
}