{
 "id": "220791",
 "text": "== Predicted and scheduled events == === January === * January 8 - Near-Earth object 2002 AY1 will make a close approach to Earth. === May === * May 31: 100th anniversary of the 20th Century Studios. === Date unknown === * Fully functioning artificial eyes are predicted to be available.Eyewitness Future, by Michael Talbini (2004), === September 15, 2035 === * The Nike Air Jordan is set to have its 50th Anniversary Celebration, which is said to be possibly commemorated through releasing 50th Anniversary Edition Air Jordans. == In fiction == === Film === * In Back to the Future Part II, the original timeline of the future says that Marlene McFly will be released from prison this year. * Twelve Monkeys (1995) * I, Robot (2004) * Doomsday (2008) === Television === * My Life and Times (1991) * The animated television series Aqua Teen Hunger Force features a character known as the Cybernetic Ghost of Christmas Past from the Future who often makes up infamously nonsensical stories that take place in the future, the year 2035 being one of his most referenced years. * The Gakuen Utopia Manabi Straight! series is set in this year. * Ghost in the Shell saga events take place on this year. * The last episode of the American series Life on Mars reveals that 2035 is the year Sam Tyler is from, not 2008. According to the show, on March 2, 2035, the first manned mission to Mars is supposed to touch down. * The History Channel TV Film, After Armageddon, ends at this time after 25 years the start of a global disaster, Pandemic. The story was told in the view point of the son of a paramedic, and he sees how a few humans left on Earth would go on, rebuilding a society. * Outcast The CT-9 spacecraft leaves Earth for Carpathia. (2011) * In the Anime series Cowboy Bebop. Jet Black is born on December 3 of this year. === Computer and video games === * TimeSplitters (2000) (the Spaceways mission) * Castlevania: Aria of Sorrow (2003) === Magazines === * In 2005 for the thirtieth anniversary issue, National Geographic Kids did an article on what everyday life would be like in 2035. == References ==",
 "title": "2035"
}