{
 "id": "220794",
 "text": "== Predicted and scheduled events == === Date unknown === * Certain documents relating to Elizabeth Bowes-Lyon's wishes to preserve a monarchy if the Nazis occupied the UK are to be released from the Royal Archives. * According to estimates released in October 2007, the Far Ultraviolet Spectroscopic Explorer (FUSE) space telescope, decommissioned that month, will continue orbiting the earth until it burns up in the atmosphere approximately 30 years after its decommissioning. * The 2037 Bomber, an optionally manned, stealthy, hypersonic, heavy-bomber is scheduled to enter service this year, as the USAF calculates that attrition will have reduced their existing strategic bomber fleet below the minimum 170 aircraft. * The use of fossil fuels is scheduled to become infrequent by this year in developed countries. Alternative fuels (like wind and solar) will eventually relegate the use of fossil fuels to the Middle East and to developing countries. * The world's largest mud volcano, in East Java, Indonesia, may have stopped erupting. === December === * December 21: 100th anniversary of the Snow White and the Seven Dwarfs. == In fiction == === Computer video games === * X-Squad (2000): Set in 2037. * The 1998 computer game SiN is set in 2037. === Film and television === * The Dexter's Laboratory movie Ego Trip has some scenes that take place in 2037. * In the 2002 movie The Time Machine, demolitions on the moon cause the moon to break up and the earths orbit is affected, causing mass extermination of the human race on August 20, 2037. * The Disney Channel Original Movie and the book, Zenon: Girl of the Twenty First Century takes place in the year 2037. * The majority of the Disney animated film Meet the Robinsons (2007) takes place in the year 2037. * In the film V for Vendetta, V destroys the Old Bailey with homemade explosives on November 5 of this year. * In the Star Trek universe, the third manned space mission to travel outside of the confines of the Terran solar system, the Charybdis, takes place this year * In the Ben 10 universe, the events of Ken 10 occur in this year beginning on Ken's 10th birthday. (2007) === Literature === * Science fiction novel Time's Eye by Arthur C. Clarke and Stephen Baxter has some of its lead characters from the year 2037. * The Night Sessions, a 2008 novel by Ken MacLeod, is set in this year. === Music === * Lumi, a fictional character and the singer of the virtual band Genki Rockets, was born on September 11, 2037, and is the first human to be born in space. == References ==",
 "title": "2037"
}