{
 "id": "220936",
 "text": "{{Infobox officeholder | honorific-prefix = His Excellency |name = Ferdinand Marcos |image = Ferdinand Marcos (cropped).jpg |imagesize = |caption = Marcos in 1982 |office = President of the Philippines |order = 10th |term_start = December 30, 1965 |term_end = February 25, 1986 |predecessor = Diosdado Macapagal |primeminister = Himself (1978–1981) Cesar Virata (1981–1986) |successor = Corazon Aquino |vicepresident = Fernando López (1965–1973) |signature = Marcos Sig.svg |office2 = 3rd Prime Minister of the Philippines |term_start2 = June 12, 1978 |term_end2 = June 30, 1981 |predecessor2 = Office established |party = Kilusang Bagong Lipunan |successor2 = Cesar Virata |birth_name = Ferdinand Emmanuel Edralin Marcos |birth_date = |birth_place = Sarrat, Ilocos Norte, Philippine Islands |death_date = |death_place = Honolulu, Hawaii, U.S. |resting_place = Ferdinand E. Marcos Presidential Center, Batac, Ilocos Norte Heroes' Cemetery, Taguig, Metro Manila | module= Coat of arms of Ferdinand Marcos |otherparty = Liberal Party (1946–1965) Nacionalista Party (1965–1978) |spouse = |children = 4 (Imee, Bongbong, Irene, and an adopted child, Aimee) |alma_mater = University of the Philippines |profession = |allegiance= / United States |rank= First lieutenant Major |unit=11th Infantry Division 14th Infantry Regiment <!--Fake medals and awards should only be restored below if irreproachable sources can be found and cited inline |awards = Ferdinand Emmanuel Edralin Marcos (September 11, 1917 – September 28, 1989) was the President of the Philippines from 1965 to 1986. His rule was marked by dictatorship, corruption, and human rights abuses. In 1972, he declared martial law, giving himself absolute power and using the military to silence opposition. Thousands of activists, journalists, and political rivals were arrested, tortured, or killed, while press freedom was completely suppressed. He and his wife, Imelda Marcos, stole billions of dollars from the country, living in luxury while millions of Filipinos remained in poverty. Imelda became infamous for her extravagant lifestyle, including owning thousands of expensive shoes. Marcos rigged elections to stay in power and used violence to crush dissent. In 1986, after a fraudulent election, the People Power Revolution erupted, with millions of Filipinos demanding his resignation. ==Early life== Ferdinand Edralin Marcos was born on September 11, 1917, in Sarrat, Ilocos Norte, Philippines. His parents, Mariano Marcos and Josefa Edralin, were both teachers from important families. He studied law at the University of the Philippines, and topped the bar examinations before being accused of assassinating his father's political rival. He represented himself as his own lawyer in court, and was later acquitted by the Supreme Court.<ref>Biography of Ferdinand E. Marcos. Britannica Encyclopedia. November 10, 2015 During World War II, Marcos claimed that he had been the leader of Ang Maharlika, guerrilla force in Northern Luzon. After the war, he was Ilocos Norte Representative (1949-1959) and Senator of the Philippines (1958-1965). He also assumed Senate President (1963-1965), and went on to become the President of the Philippines. However, in other side, he may be the one of the most corrupt leaders such as Suharto or Kim Il-Sung or Kim Jong Il due to atrocities. A few years later, national problems like the insurgency by the communist movement and rebellion arose during his presidency: He declared Martial Law in September 1972 to institute peace and order and discipline. His style of leadership soon became dictatorial. Government greed, government bullying, despotism, nepotism, and violation of human rights abuses were abundant. The nation's masses who went against the government were sent to prison, tortured, raped or killed. People could not express themselves freely unless it was in favor of the Marcos family.Philippines cult idolises Marcos. BBC News Online. December 8, 1999 In 1983, he was accused in the assassination of his main rival and challenger, politician Benigno Aquino, Jr. but until today the killer remain unknown. The death of Benigno Aquino, Jr. caused many events, like a wrongful president vote. People became angry after and kicked him out with the help of the US during the peaceful EDSA revolution in February 1986. He and his wife Imelda Marcos were accused to have stolen billions of dollars of government funds and had it secretly sent to bank accounts in the United States, Switzerland, and other countries, as well as into fake companies under his name. However, until today Imelda Marcos was never sent to prison nor found guilty of stealing billions of dollars of government money and she remains free and was even elected in congress representing her home province of Leyte. Her son Ferdinand Marcos was back into politics and became a senator of the Philippines while her daughter Imee Marcos is currently the governor of Ilocos Norte. By 1983 Marcos’s health was beginning to fail, and opposition to his rule was growing. Hoping to present an alternative to both Marcos and the increasingly powerful New People’s Army, Benigno Aquino, Jr., returned to Manila on August 21, 1983, only to be shot dead as he stepped off the airplane. The assassination was seen as the work of the government and touched off massive antigovernment protests. An independent commission appointed by Marcos concluded in 1984 that high military officers were responsible for Aquino’s assassination. To reassert his mandate, Marcos called for presidential elections to be held in 1986. But a formidable political opponent soon emerged in Aquino’s widow, Corazon Aquino, who became the presidential candidate of the opposition. It was widely asserted that Marcos managed to defeat Aquino and retain the presidency in the election of February 7, 1986, only through massive voting fraud on the part of Marcos' supporters. Deeply discredited at home and abroad by his dubious electoral victory, Marcos held fast to his presidency as the Philippine military split between supporters of his and of Aquino’s legitimate right to the presidency. A tense standoff that ensued between the two sides ended only when Marcos fled the country on February 25, 1986, at U.S. urging. He went into exile in Hawaii, where he remained until his death. Evidence emerged that during his years in power Marcos, his family, and his close associates had looted the Philippines’ economy of billions of dollars through embezzlements and other corrupt practices. Marcos and his wife were subsequently indicted by the U.S. government on racketeering charges, but in 1990 (after Marcos’s death) Imelda was acquitted of all charges by a federal court. She was allowed to return to the Philippines in 1991, and in 1993 a Philippine court found her guilty of corruption (the conviction was overturned in 1998). ==Final years and death== During the people Power EDSA revolution he was flown to Hawaii by a US plane instead of going to his hometown Paoay, Ilocos Norte. President Marcos died in Hawaii of heart, kidney and lung diseases. He was brought back to the Philippines and his remains still lie in a refrigerated crypt in Batac, Ilocos Norte until today because the current administration refuses to grant the former president a burial at the Libingan ng mga Bayani where other former presidents of the Philippines who died are buried. ==References== Notes Category:1917 births Category:1989 deaths Category:Filipino military people Category:Filipino Roman Catholics Category:Former dictators Category:Majors Category:Presidents of the Philippines Category:Prime ministers of the Philippines Category:Recipients of the Decoration for Services to the Republic of Austria Category:Minority leaders of the Senate of the Philippines Category:Politicians from Ilocos Norte",
 "title": "Ferdinand Marcos"
}