{
 "id": "221378",
 "text": "The Dunkirk evacuation, also called Operation Dynamo or The Miracle of Dunkirk, was a British mission to rescue Allied soldiers from the beaches of Dunkirk, France during World War II. Over 900 small British ships rescued around 340,000 British and French soldiers from the beaches between 26 May 1940 and 4 June 1940. == Context == After the Battle of Dunkirk, the German Army surrounded over 300,000 Allied soldiers along the beaches in Dunkirk. Instead of attacking, the Germans paused. British Prime Minister Winston Churchill then ordered all available ships and boats to head for Dunkirk to rescue the soldiers. == Evacuation == Over 900 ships participated in the evacuation. Some were larger ships, but many were fishing and pleasure boats. Originally, the plan was to pick up 40,000 British soldiers. Churchill expected the Germans to fight back, so he did not think they would be able to rescue everyone. In his 1982 book The Miracle of Dunkirk, Walter Lord writes: > Private W.B.A. Gaze, driver with [a military equipment] repair unit, looked > out to sea [on May 27] from Malo-les-Bains and saw nothing. No ships at all, > except a shattered French destroyer ... [On May 30] Lt. Ian Cox, HMS > Malcolm, could hardly believe his eyes. There, coming over the horizon > toward him, was a mass of dots that filled the sea. === Rescues === When the Germans did not fight back, British ships rescued more and more soldiers each day. * Day 1: 8,000 rescued (all from the harbor; none from the beaches) * Day 2: 17,000 (including some from the beaches) * Day 3: 47,000 * Day 4: 54,000 (including the first French soldiers) * Days 5 and 6: Over 60,000 On the seventh day, nearly all the British had left, but the boats continued to pick up 26,000 soldiers a day, nearly all of whom were French. The evacuation ended after nine days, when 200,000 British soldiers and 140,000 French soldiers had escaped to Britain. == Importance == The Battle of Dunkirk was a great defeat for the British and Allied forces. They lost almost all their tanks, big guns, and other heavy equipment. However, most of the British Army in France and part of the French Army escaped to fight again. However, the Dunkirk evacuation became a moment of national pride for the British, and a symbol of their determination to keep fighting. On June 4, the final day of the evacuation, Churchill gave what became a very famous speech: > [We] shall not flag or fail. We shall go on to the end, we shall fight in > France, we shall fight on the seas and oceans, we shall fight with growing > confidence and growing strength in the air, we shall defend our Island, > whatever the cost may be, we shall fight on the beaches, we shall fight on > the landing grounds, we shall fight in the fields and in the streets, we > shall fight in the hills; we shall never surrender. == Related pages == * World War II * Allies of World War II * Winston Churchill * Nazi Germany == References == Category:World War II Category:May 1940 events Category:June 1940 events Category:1940 in France Category:1940 events Category:Dunkirk Category:Winston Churchill",
 "title": "Dunkirk evacuation"
}