{
 "id": "221458",
 "text": "A , or is a place for sex in Japan that specializes in oral sex. The client is served soft drinks and a young woman performs fellatio on him in a small room or booth. These places are very popular for young men because they are very cheap and the service is fast. == History == Pink salons started appearing in the early 1960s and is a more involved version of the very popular Kyaba-Kura (cabaret clubs). In these clubs a client pays to talk and drink with a woman, and in night salons men can masturbate in front of a woman, and ejaculate into either her hands or mouth. This is all done without touching the client. == Legal Status == Prostitution in Japan is strictly prohibited. But if there is no penetration in the encounter it is not considered prostitution. Establishments intended for sex are in special zones in each city and are often hidden under a false or cover identities like restaurants, shops or sex shops. They can be easier to spot at night; pink salons and similar establishments will remain open while all other businesses are closed. == Location == These businesses are usually in specific zones like entertainment areas or Red-light districts. If a false name is used, they can also be in almost every part of the city and are usually announced at the JR stations. == Inside a pink salon == The inside of a pink salon is usually dark, with quiet music. At the entrance customers must disinfect their hands, particularly their nails if they are long. Most salons only allow entry to Japanese people and forbid entry to foreigners. There are also snacks and beer free of charge. Other alcoholic beverages must be paid for. === Pink salon system === Customers usually pay for 30–45 minutes of service and the price depends on the time of day. It usually costs around 2000-4000 Yen in the morning and 4000-12000 Yen at night. The customer sits in a single sofa and a woman comes and provides the customer with service. The types of service may include genital touching, fellatio, footjob, and cunnilingus. Customers do not need to wear a condom and it is common that they ejaculate in the woman's mouth. It is also common that the fellatio is done by more than one woman, changing every 15 minutes (making a total of three women in a 45-minute period). ==References== Category:Prostitution",
 "title": "Pink salon"
}