{
 "id": "221730",
 "text": "A leap year starting on Sunday is any leap year (i.e. a year with 366 days) that begins on Sunday, 1 January, and ends on Monday, 31 December. Its dominical letter hence is AG. Examples include 1928, 1956, 1984, 2012, 2040, 2068, and 2096. In this leap year January, April, and July begin on Sunday, February and August begin on Wednesday, March and November begin on Thursday, May begins on Tuesday, June begins on Friday, September and December begin on Saturday and October begins on Monday. This is the only leap year with three occurrences of Friday the 13th. The Friday the 13ths in this leap year are in January, April and July. The other type of year with three occurrences of Friday the 13th is a Common year starting on Thursday, which has Friday the 13ths in February, March, and November. From July of this type of year to September of the following year (Common year starting on Tuesday) is the longest period (14 months) between two instances of Friday the 13th. Interestingly, leap years starting on Sunday falls exactly three years either side of two consecutive common years starting on Thursday; the most recent occurrence was 2012 between 2009 and 2015. This leap year is one of three leap years with two Friday the 17ths, the others being Leap year starting on Thursday and Leap year starting on Saturday. The Friday the 17ths in this leap year are in February and August. This leap year is one of three leap years with two Tuesday the 13ths, the others being Leap year starting on Friday and Leap year starting on Monday. The Tuesday the 13ths in this common year are in March and in November. Common years starting on Monday share this characteristic, but also have another one in February. In this leap year, Martin Luther King Jr. Day is on January 16, Valentine’s Day is on a Tuesday, Presidents Day is on February 20, the leap day, February 29, is on a Wednesday, Daylight Savings Time begins on March 11, St. Patrick’s Day is on a Saturday, Mother’s Day is on May 13, Memorial Day is on May 28, Father’s Day is on June 17, Independence Day is on a Wednesday, Labor Day is on September 3, Columbus Day is on it’s earliest possible date, October 8, Halloween is on a Wednesday, Daylight Savings Time ends on November 4, Veterans Day is on a Sunday, Thanksgiving is on its earliest possible date, November 22, and Christmas is on a Tuesday. This leap year has three months (January, April, and July) beginning on the first day of the week, in places where Sunday is considered the first day of the week. Common years starting on Thursday share this characteristic, in the months of February, March, and November. This is the only type of year that has 54 different calendar weeks (2 partial, 52 full) in places where Monday is considered the first day of the week. Leap years starting on Saturday share this characteristic in places where Sunday is considered to be the first day of the week. ==Calendar== Category:Leap years by day",
 "title": "Leap year starting on Sunday"
}