{
 "id": "221831",
 "text": "The Hyundai i20 is a small Hatchback made by Hyundai since 2008. It replaced the Hyundai Getz. == First Generation (2008-2014) == The Hyundai i20 uses a new plataform made at the Hyundai's techince Center in Russelsheim. It was made to compete in the Subcompact car segment. It was launched in 2008. The i20 has 1.2, 1.25, 1.4 ,1.5, and 1.6 liter petrol engines and 1.1, 1.4, and 1.6 diesel engines with 5-speed and 6-speed manual transmissions and a 4-speed automatic transmission. It was improved in 2012. File:Hyundai i20 1.2 Comfort front 20100617.jpg|Front (5-door) == Second Generation (2014-2020) == The second-generation i20 was launched in August 2014 in India (as the i20 Elite) and in November in Europe. It was developed at Hyundai's design facilities also in Russelsheim. It was avaliable as a 3-door hatch called the i20 Coupe as a 5-door hatch and a crossover-style version called the i20 Active launched in 2015. It has a 1.0 liter turbo, 1.2, 1.25, and 1.4 liter petrol engines, 1.1 and a new 1.4 liter diesel engines with a 5-speed and 6-speed manual transmissions a 4-speed automatic transmission and a 7-speed DCT and CVT transmissions. It was improved in 2018. File:2018 Hyundai i20 SE T-GDi 1.0.jpg|Hyundai i20 (GB; facelift) == Third Generation (2020-present) == The third generation was shown online for Europe in February 2020. It was supposed to be launched in March at The Geneva Auto Show but it was cancelled due to the COVID-19 pandemic. The production for sale in Europe begam in Izmit Turkey in August and was later launched in India on November. The car has a 1.0 liter turbo 1.2 and 1.4 liter petrol engines and a 1.5 liter diesel engine with 5 and 6-speed manual transmissions a 6-speed automatic and semi-automatic transmissions and a 7-speed DCT and automatic CVT transmissions. It also has a mild-hybrid version and a sportier version called the i20 N launched in 2020. That has a 1.6 liter turbo gasoline engine with a 6-speed manual transmission. The version was discontinued in 2024 in Europe but it will be exported to Australia. The i20 got improved in 2023. File:Hyundai_i20_(BC3)_Facelift_IMG_8594.jpg|2024 i20 (front view, facelift) == Markets == The Hyundai i20 is currently sold in Europe and India. It was previously sold in Indonesia and some other markets. == References == i20 Category:2000s automobiles Category:2010s automobiles Category:2020s automobiles",
 "title": "Hyundai i20"
}