{
 "id": "222013",
 "text": "A plastid is a self-reproducing organelle of plants and algae. A plastome is the DNA genome of a plastid.King R.C. Stansfield W.D. & Mulligan P.K. 2006. A dictionary of genetics, 7th ed. Oxford.p341 They are like tiny machines inside cells: each makes or stores important chemicals used by the plant. Examples of plastids are: * Chloroplasts: photosynthesis; other plastids may have developed from chloroplasts. Etioplasts are chloroplasts which have not been exposed to light. * Chromoplasts: pigment synthesis and storage. * Leucoplasts: colourless, make terpenes such as resin. Sometimes they develop into more specialized types of plastid: ** Amyloplasts: starch storage ** Elaioplasts: fat storage. ** Proteinoplasts: store & modify protein. *** Statoliths: detect gravity. ==Plastids in algae== Plastids in algae and hornworts may differ from plant plastids. In algae, the term \"leucoplast\" is used for all unpigmented plastids and their function differs from the leucoplasts of plants. Glaucocystophytic algae contain muroplasts, which are similar to chloroplasts except that they have a cell wall, similar to that of prokaryotes. Rhodophytic algae contain rhodoplasts, which are red chloroplasts which allow the algae to photosynthesise to a depth of up to 268 metres.Wise, Robert R. 2006. The diversity of plastid form and function\". Advances in Photosynthesis and Respiration. 23, 3–26. == Genetics and evolution == Plastids are one of the many different types of organelles in the cell. In endosymbiont theory, plastids originated as cyanobacteria. This was first suggested by Mereschkowsky in 1905.Khakhina L.N. 1992. Concepts of symbiogenesis: a historical and critical survey of the research of Russian botanists. Yale, New Haven CN. Schimper in 1883 had said chloroplasts closely resembled cyanobacteria. Almost all chloroplasts are thought to derive directly or indirectly from a single endosymbiotic event. Mitochondria also derive from symbiosis, but chloroplasts are found only in plants and protista. The chloroplast is surrounded by a double-layered composite membrane with an intermembrane space; further, it has reticulations, or many infoldings, filling the inner spaces. The chloroplast has its own DNA, which codes for redox proteins involved in electron transport in photosynthesis. == References == Category:Botany Category:Organelles Category:DNA",
 "title": "Plastid"
}