{
 "id": "222014",
 "text": "The Medical Renaissance is a period of progress in European medical knowledge. It lasted from about 1400 to 1700 AD. During this period, there was a new interest in the ideas of the ancient Greeks and Romans. Discoveries from the Medical Renaissance paved the way for modern medicine. At the beginning of this period, around 1400, doctors did not understand anatomy and physiology. They had a lot of ideas that sound strange to modern people. Several things helped scientists make progress.OCR GCSE: Medicine Through TimeParragon, World History Encyclopedia Starting in the 1450s, the printing press made it possible for medical books to be mass-produced. This made it easy for medical knowledge to spread. Scientists published books sharing knowledge about anatomy and physiology. In 1543, Andreas Vesalius published De humani corporis fabrica (“On the fabric of the human body”), a detailed anatomy book.Vesalius, Andreas. On the Fabric of the Human Body, translated by W.F. Richardson and J.B. Carman. 5 vols. San Francisco and Novato: Norman Publishing, 1998–2009. The fabric of the human body, translated by Daniel H. Harrison and Malcolm H. Hast. Basel: Karger Publishing, 2013. This was the first time in history that realistic diagrams of dissections were published. By studying anatomy, physicians learnt the positions of bones, muscles, and organs. Much later, in 1628, the Englishman William Harvey discovered that the heart pumps blood, which travels through the body in blood vessels, and returns to the heart in the circulatory system..Harvey, William (1628) 1993. The circulation of the blood and other writings. London: Everyman: Orion Publishing Group. Translated by Kenneth J. Franklin. Introduction by Andrew Wear. ISBN 0-460-87362-8 Thus physicians began to understand the basic facts of anatomy and physiology. thumb |upright |Realdo Colombo, De re anatomica ==Beliefs== During the Renaissance, the theory of the four humours (or four temperaments) was very important. The ancient Greeks created this theory, and it influenced medical development until the 19th century. According to this theory, the body is filled with four different humours (liquids): black bile, yellow bile, phlegm and blood. When a person is healthy, these substances are in balance. When there is an imbalance between the humours, the person will be sick. The sickness can be cured by bringing the four humours back to balance. The ancient Roman physician Galen had supported this theory, though he refined it in many ways. He said that body temperature is based on the balance between the humors. During the Medical Renaissance, several important physicians helped to prove this theory wrong. The first was a Persian physician called Abū Bakr Muḥammad ibn Zakariyyāʾ al-Rāzī (865-925; he was also called Rhazes). In his book Doubts about Galen, he described doing an experiment to test Galen’s theory about what controls body temperature. He inserted a liquid with a different temperature into the body. This would result in an increase or decrease of bodily heat, which resembled the temperature of that particular fluid. Rhazes noted that a warm drink would heat up the body to a degree much higher than its own natural temperature. The drink would therefore trigger a response from the body, rather than transferring only its own warmth or coldness to it.G. Stolyarov II (2002), \"Rhazes: The Thinking Western Physician\", The Rational Argumentator, Issue VI. Later, Avenzoar (1091–1161) did an experimental dissection and autopsy to prove that the skin disease scabies was caused by a parasite. This discovery upset the theory of humorism. Removing the parasite from the patient's body did not require purging, bloodletting, or any other traditional treatments associated with the four humors.Islamic medicine , Hutchinson Encyclopedia. Finally, in the 13th century, Ibn al-Nafis (1213–1288) discovered both pulmonary circulationS. A. Al-Dabbagh (1978). \"Ibn Al-Nafis and the pulmonary circulation\", The Lancet 1, p. 1148. and coronary circulation.Husain F. Nagamia (2003), \"Ibn al-Nafīs: A Biographical Sketch of the Discoverer of Pulmonary and Coronary Circulation\", Journal of the International Society for the History of Islamic Medicine 1, p. 22–28. This proved once and for all that the theory of the four humors was incorrect. ==Medicine or myth?== Before the Medical Renaissance, there were only a few ways of studying the human body. Early doctors did not understand how the body works, how to treat sickness, or how disease spreads. In the Middle Ages and the early Renaissance, people thought that \"bad air\" or \"flying venom\" caused illness. For that reason, they covered their mouths or burned good-smelling leaves, but did not wash their hands after seeing a sick friend or family member. When William Harvey suggested that the heart pumps blood, most people thought he was a quack (a fake or bad doctor). At that time, most doctors focused on treating illness, not trying to find out how the body works. In the 17th century, Anton van Leeuwenhoek and Robert Hooke developed the light microscope. In 1676, using this microscope, Leeuwenhoek was the first person to see bacteria. He called them \"animalcules\" and published his observations in a series of letters to the Royal Society. The name bacterium was introduced much later, by Christian Gottfried Ehrenberg in 1838. Some cures prescribed by early doctors were both ineffective and dangerous. For instance, doctors would often attach leeches to sick patients. They thought that leeches could cure sickness by sucking bad blood out of a patient's body. In reality, taking blood from very sick patients just made them weaker. Some died from this \"treatment.\" Other cures really worked, though. To close large wounds, which modern doctors would stitch together, early doctors would use beetles that had pincers. They would get a beetle to pinch together the edges of the wound, then cut off the beetle's head. Early doctors also used spider webs to stop bleeding by making blood clot together. Doctors are still studying other \"cures\" that were used in the Medical Renaissance to see if they can help today's medicine. ==Related pages== *Medicine *Renaissance *Renaissance music *Renaissance art ==References== ==Other websites== *Renaissance Medicine Category:Renaissance Category:History of medicine",
 "title": "Medical Renaissance"
}