{
 "id": "222386",
 "text": "Charles Michael \"Chuck\" Palahniuk (born February 21, 1962) is an American satire author. He is well known for writing the award-winning book Fight Club. It was later made into a movie directed by David Fincher. He lives in the state of Washington. == Biography == Palahniuk was born in Pasco, Washington and raised in Burbank, Washington and Eastern Washington. started writing books when he was in his mid-thirties. His first book, Insomnia: If You Lived Here, You'd Be Home Already, was never made into a book because he didn't think the story was very good. When he tried to write his next novel, Invisible Monsters, publishers did not like it because they thought it was too scary. This made him work on his best known book, Fight Club. He wrote it to try to scare the publisher even more for not publishing his book. Palahniuk wrote this story in his spare time. After first writing it as a short story, Palahniuk made it longer into a full book, which, surprising to him, was published.Tomlinson, Sarah. \"Is it fistfighting, or just multi-tasking? \". Salon.com. October 13, 1999. In 1999, a changed version of Invisible Monsters, and his fourth novel, Survivor, were published. This made Palahniuk a cult figure. A few years later Palahniuk wrote his first New York Times bestseller, Choke. After that, Palahniuk's later books would mostly have the same success. This success allowed him to travel and promote his books, where he reads from new and upcoming books. Palahniuk is openly gay and a lapsed Catholic. == Bibliography == === Fiction === * Fight Club (1996) * Survivor (1999) * Invisible Monsters (1999) * Choke (2001) * Lullaby (2002) * Diary (2003) * Haunted (2005) * Rant (2007) * Snuff (2008) * Pygmy (2009) * Tell All (2010) === Non-fiction === * Fugitives and Refugees: A Walk in Portland, Oregon (2003) * Stranger Than Fiction: True Stories (2004) * You Do Not Talk About Fight Club: I Am Jack's Completely Unauthorized Essay Collection (2008) (introduction) === Movies === * Fight Club (1999) * Choke (2008) * Invisible Monsters (2010) * Haunted (TBA) - optioned property * Survivor (TBA) - script stage * Rant (TBA) - optioned property * Diary (TBA) - optioned property * Lullaby (TBA) - optioned property ==References== Category:20th-century American novelists Category:American LGBT writers Category:Gay men Category:Writers from Washington (state) Category:1962 births Category:Living people",
 "title": "Chuck Palahniuk"
}