{
 "id": "222712",
 "text": "Basic English (British Academic Scientific International Commercial) is a controlled language used to explain complex thoughts. It has 850 words chosen by Charles Kay Ogden. Some articles in the Simple English Wikipedia use only Basic English. In 1937, Ogden hired Otto Neurath and Marie Neurath to make International Picture Language as one of eight books in Basic English. Over 200,000,000 people speak Basic English. ==Rules== The grammar of Basic English is simpler and more regular than that of standard English. In standard English, words often have a number of different meanings. To make Basic English easier, not all the meanings of a word are used. Basic English uses Ogden's rules of grammar. Ogden's rules of grammar allow people to use the 850 words to talk about things and events simply. # -s / -es / -ies change singular nouns into plural nouns. # -ing / -ed change verbs into adjectives. # -ing / -er change verbs into nouns. # -ly changes adjectives into adverbs. # -er / -est or more / most describe amounts. # un- changes adjectives into their opposites. # The opposite word order with do makes questions. # 'Operators' (verbs) and pronouns change as in normal English. # Make combined words (compounds) from two nouns (\"football\") or a noun and a direction (\"sundown\"). # Measures, numbers, money, days, months, years, clock time, and international words are in English forms. Example for Date/Time: 20 May 1972 at 21:00 # Use the words of an industry or science. For example, in this grammar, some special words are for teaching languages, and not part of Basic English: plural, conjugation, noun, adjective, adverb, qualifier, operator, pronoun, and directive. == Related pages == * Simplified English * Français fondamental * Plain English Campaign * Basic English ordered wordlist * International auxiliary language ** Basic English picture wordlist * Basic English combined wordlist * Basic English compound wordlist * Basic English alphabetical wordlist ** List of simple verbs ** List of simple adjectives * Basic English international wordlist == References == * Ogden C.K. 1940. General BASIC English dictionary. London: Evans Brothers. * Simple English dictionary == Other websites == * Ogden's BASIC English * BASIC English Utility * Automatic online simplifying and summarizing tool. - Detect language and convert to BASIC English or summarize many documents into standard or BASIC English, reading material and BASIC English course included. Category:BASIC English",
 "title": "Basic English"
}