{
 "id": "222880",
 "text": "{{Infobox settlement |official_name = Pichilemu |other_name = |native_name = |nickname = Capital of the Surf (Capital del Surf) |settlement_type = City |motto = |image_skyline = Centre of Pichilemu in 2010.jpg |imagesize = 250px |image_alt = |image_caption = Sight of the urban centre of Pichilemu, shortly after the 2010 Chile earthquake. |image_flag = Flag of Pichilemu.svg |flag_alt = Flag of Pichilemu. |flag_size = |image_seal = |seal_size = |image_shield = Coat of arms of Pichilemu .svg |shield_alt = Coat of arms of Pichilemu. |shield_size = 64px |image_blank_emblem = |blank_emblem_type = |blank_emblem_size = |image_map = |mapsize = 200px |map_alt = Map of Pichilemu, including all of his streets. |map_caption = |image_map1 = |mapsize1 = |map_caption1 = |image_dot_map = |dot_mapsize = |dot_map_caption = |dot_x = |dot_y = |pushpin_map = |pushpin_label_position = |pushpin_map_caption = |pushpin_mapsize = |subdivision_type = Country |subdivision_name = |subdivision_type1 = Region |subdivision_name1 = O'Higgins |subdivision_type2 = Province |subdivision_name2 = Cardenal Caro |subdivision_type3 = |subdivision_name3 = |subdivision_type4 = |subdivision_name4 = |government_footnotes = |government_type = |leader_title = Mayor |leader_name = Marcelo Cabrera (2008-2009) Roberto Córdova (2009-2012) |leader_title1 = |leader_name1 = |leader_title2 = |leader_name2 = |leader_title3 = |leader_name3 = |leader_title4 = |leader_name4 = |established_title = |established_date = |established_title2 = |established_date2 = |established_title3 = |established_date3 = |unit_pref = |area_footnotes = |area_total_km2 = 749.1 |area_land_km2 = |area_water_km2 = |area_total_sq_mi = |area_land_sq_mi = |area_water_sq_mi = |area_water_percent = |area_urban_km2 = |area_urban_sq_mi = |area_metro_km2 = |area_metro_sq_mi = |area_blank1_title = |area_blank1_km2 = |area_blank1_sq_mi = |population_as_of = 2002 |population_footnotes = |population_note = |population_total = 12,392 |population_density_km2 = 16.54 |population_density_sq_mi = |population_metro = |population_density_metro_km2 = |population_density_metro_sq_mi = |population_urban = |population_density_urban_km2 = |population_density_urban_sq_mi = |population_blank1_title = |population_blank1 = |population_density_blank1_km2 = |population_density_blank1_sq_mi = |timezone = Chile Time (CLT) |utc_offset = -4 |timezone_DST = Chile Summer Time (CLST) |utc_offset_DST = -3 |area_code = +56-72 |coordinates = |elevation_footnotes = |elevation_m = 0 |elevation_ft = 0 |postal_code_type = ZIP code |postal_code = 3220478 |blank_name = |blank_info = |blank1_name = |blank1_info = |website = http://www.pichilemu.cl |footnotes = }} (Mapudungun for small forest ) is a city and commune of the central zone (centre part) of Chile. It is the capital of the Province of Cardenal Caro. The beach of Pichilemu is called one of the best beaches in the world for surfing. The most famous beach in Pichilemu is Punta de Lobos, where competitions are often held. The city has become a beach resort. == History == Promoucaes were the first people that populated Pichilemu. They were hunter gatherers and fishermen. In 1887, President José Manuel Balmaceda decreed Pichilemu as a minor dock. José Toribio Medina did his first archeological investigations in Pichilemu, and he published in 1908 Los Restos Indígenas de Pichilemu. He said there that Pedro de Valdivia gave land in what is now central Chile to Juan Gómez de Almagro on February 24, 1544. Pichilemu was between the areas of the Palloquierbico, Topocalma, and Gulaquien. The name Pichilemu comes from the Mapudungún words (little) and (forest). Some of the first land owners of Pichilemu were the Ortúzar family. Daniel Ortúzar is known as one of the founders of the original village of Pichilemu. The family of Ortúzar Cuevas, from the San Antonio de Petrel Hacienda, made a mid-century maritime dock which was as a fishing port for some years. They also built homes along the dock on what is now Ortúzar Avenue. More recently, other large land owners are Pedro Pavez Polanco and the Hacienda of San Antonio de Petrel. In 1891, during the Chilean Civil War, Daniel Ortúzar and the priest of Alcones were taken prisoners from Pichilemu through the dock. During the war, the dock was burned down. After the civil war, Pichilemu got its formal name and status. President Jorge Montt and his Minister, Manuel José Irarrázabal, the city was officially established on December 22, 1891. Pichilemu has become the historic capital of the province called Cardenal Caro which is named for the first Chilean Catholic Church Cardinal. His father was the first mayor in the city. Agustín Ross Edwards was a Chilean writer, Member of Parliament, minister and politician. Ross was very rich and based on his European background, he bought a 300-hectare piece of land and named it \"La Posada\" (), or Petren Fund, in 1885. Ross designed an urban place of high environmental value and landscape, turning \"La Posada\" into a hotel (Great Hotel Pichilemu, later Hotel Ross, or Ross Hotel), and building a casino, embankments, stone walls, a balcony facing the beach. Additionally, he built a park and a forest of more than 10 hectares. Agustín Ross turned Pichilemu into a summer resort town for the people from Santiago. Some of his buildings were named National Monuments. == Geography and climate == Pichilemu is located west of San Fernando, Chile and just east of the Pacific Ocean. It is around a three-hour drive to the Andes Mountains. It is also near the coastal mountain range. Even though most of the forest areas around Pichilemu are covered in Pine and Eucalyptus trees, a native forest (now Municipal Forest) is still there It contains species such as Litres, Quillayes, Boldos, Espinos and Peumos. Pichilemu borders Litueche to the north, Paredones to the south, Marchigüe and Pumanque to the east, and the Pacific Ocean to the west . == Demographics == In the 17th century, Pichilemu had 1,468 inhabitants. In 1787, Pichilemu had 1,688 inhabitants. In 1907, Pichilemu had 7,787 inhabitants. However, the city's population progressively decreased; in 1920, it was 7,424; in 1930, it was 6,929, and in 1940, it was 6,570. In 1952, the city's population increased to 7,150 inhabitants; in 1992, that figure had increased to 10,510. As of the 2002 census, 12,392 people live in the town. The census recorded that 9,459 people (76.3%) are from urban places of the city, and 2,933 people (23.7%) are from rural places of the city, there are 6,440 (52.0%) men and 5,952 (48.0%) women. The area of Pichilemu is . According to the CASEN 2002 census, 544 inhabitants (4.4%) of the population of Pichilemu live in extreme poverty compared to the average in the greater Region of O'Higgins of 4.5%, and 1,946 inhabitants (15.7%) live in mild poverty, compared to the regional average of 16.1%. == Government and politics == Pichilemu, along with the communes of Placilla, Nancagua, Chépica, Santa Cruz, Pumanque, Palmilla, Peralillo, Navidad, Lolol, Litueche, La Estrella, Chile, Marchihue and Paredones, is part of the Electoral District N° 35 and belongs to the 9th Senatorial Constituency (O'Higgins) of the electoral division of Chile. The current Mayor of Pichilemu is Roberto Córdova. The last popularly-elected mayor was Marcelo Cabrera, elected in 2008 with 42.08% of the vote, who served from May 2009 to August 2009 due to legal action. The municipal council selected Córdova as the new mayor on September 9, 2009, almost a year after the municipal elections. The current councilors are Aldo Polanco Contreras, Andrea Aranda Escudero, Viviana Parraguez Ulloa, Juan Cornejo Vargas and Marta Urzúa Púa. == Surfing == Surfing is one of the tourist attractions, particularly at Punta de Lobos. According to travel guide Fodor's, Every October and December the International Championship of Surf takes place at La Puntilla Beach. Punta de Lobos hosts the Campeonato Nacional de Surf () each summer. Pichilemu has many dark sand beaches. The water is cool year-round, though many tourists choose to swim during the summer months. Bodyboarding, surfing, windsurfing, and kitesurfing can be practiced. The beach that is farthest north is San Antonio Beach or Main Beach ( or ), which is found in front of the Ross Park. It is known for good surfing. Las Terrazas Beach () is the busiest beach during the summer. Many surf schools, La Ola Perfecta and Lobos del Pacífico, are found near the beach, as is the Caleta de Pescadores (), where fisherman sell their fish. found at the south of the town and around the other side of the Puntilla, the Infiernillo Beach is found. It is used for fishing. At the south of Infiernillo, Playa Hermosa is found, which is great for walking and fishing. Further south, from Pichilemu, Punta de Lobos is found .It is an increasingly popular destination for tourists and specially for surfers. Several surf contests are held there, including an international big-wave contest during the Chilean fall. The size of waves varies throughout the year, but large swells in fall and winter can reach heights of up to 50 feet (15 metres). It is widely considered one of the best beaches for surfing worldwide. == Gallery == Image:Casino Ross.jpg Image:Hotel Ross.jpg File:Estación de ferrocarriles de Pichilemu 2012-09-20 19-16-28.jpg Image:Biblioteca Pública de Pichilemu.jpg Image:Punta de lobos.jpg Image:Quiosco Janita 2.jpg Image:Salinas Cahuil.jpg Image:Villa los navegantes.JPG|Los Navegantes == References == == Other websites == * Pichilemu's official website",
 "title": "Pichilemu"
}