{
 "id": "22323",
 "text": "Mindanao is one of the three main island groups in the Philippines. It is the southernmost major island of the Philippines, and is the only island in the Philippines are predominantly Muslim people. Mindanao is northeast of Sabah. It may also refer to the main island in the group. ==List of provinces of Mindanao state== Province Capital Region Agusan del Norte Cabadbaran City Caraga Agusan del Sur Prosperidad Basilan Isabela City (exluding) Bangsamoro Bukidnon Malaybalay City Northern Mindanao Camiguin Mambajao Cotabato Kidapawan City Soccsksargen Davao del Norte Tagum City Davao Region Davao del Sur Digos City Davao de Oro Nabunturan Davao Occidental Malita Davao Oriental Mati Dinagat Islands San Jose Caraga Lanao del Norte Tubod Northern Mindanao Lanao del Sur Marawi City Bangsamoro Maguindanao del Norte Datu Odin Sinsuat Maguindanao del Sur Buluan Misamis Occidental Oroquieta City Northern Mindanao Misamis Oriental CAGAYAN DE ORO CITY (Regional center) Sarangani Alabel Soccsksargen South Cotabato KORONADAL CITY (Regional center) Sultan Kudarat Isulan Sulu Jolo Bangsamoro Surigao del Norte Surigao City Caraga Surigao del Sur Tandag City Tawi-Tawi Bongao Bangsamoro Zamboanga del Norte Dipolog City Zamboanga Peninsula Zamboanga del Sur PAGADIAN CITY (Regional center) Zamboanga Sibugay Ipil ===Regions of Mindanao State=== Island group: MINDANAO (SOUTH PHILIPPINES) Zamboanga (Region IX) PAGADIAN *Isabela CityA component city, part of the province of Basilan, but whose regional services are provided by the offices of Region IX. *Zamboanga City *Zamboanga del Norte *Zamboanga del Sur *Zamboanga Sibugay 14,811 3,407,353 Northern Mindanao (Region X) CAGAYAN DE ORO *Bukidnon *Cagayan de Oro *Camiguin *Iligan City *Lanao del Norte *Misamis Occidental *Misamis Oriental 17,125 4,297,323 Davao (Region XI) Davao City *Davao de Oro *Davao City *Davao del Norte *Davao del Sur *Davao Oriental *Davao Occidental 20,244 4,468,563 Cotabato (Region XII) KORONADAL *Cotabato *Cotabato City *General Santos *Sarangani *South Cotabato *Sultan Kudarat 18,433 4,109,571 Caraga (Region XIII) Butuan *Agusan del Norte *Agusan del Sur *Butuan *Dinagat Islands *Surigao del Norte *Surigao del Sur 18,847 2,429,224 Bangsamoro (BARMM) Cotabato City *Basilan (excluding Isabela City) *Lanao del Sur *Maguindanao *Sulu *Tawi-Tawi 12,695 3,256,140 ===Largest cities of Mindanao=== ==Related page== * Secession in the Philippines ==References==",
 "title": "Mindanao"
}