{
 "id": "223352",
 "text": "The Acarina, or Acari, are the mites and ticks. They are an order of Arachnids. Their fossil history goes back to the Devonian era. Most acarines are tiny: less than a millimetre. Over 50,000 species have been described, but a million or more species may be living. The study of mites and ticks is called acarology.Walter D.E. & Proctor H.C. 1999. Mites: ecology, evolution and behaviour. University of New South Wales Press, Sydney and CABI, Wallingford Acarines live in practically every habitat, including aquatic (freshwater and sea water) and terrestrial. They outnumber other arthropods in the soil and detritus. Many are parasitic, and they affect both vertebrates and invertebrates. Most parasitic forms are external parasites, while the free living forms are generally predators and may even be used to control undesirable arthropods. Others help to break down forest litter and dead organic matter such as skin cells. Still others are herbivorous and may damage crops. Damage to crops is perhaps the most costly economic effect of mites, especially by the spider mites and their relatives, earth mites, thread-footed mites and the gall and rust mites. Some parasitic forms affect humans and other mammals, causing damage by their feeding, and can even be vectors of diseases such as scrub typhus and rickettsia. A well-known effect of mites on humans is as an allergen which stimulates asthma. Predatory mites may be used in pest control and herbivorous mites used to attack weeds. A positive contribution of the Acari is their normal functions in ecosystems, especially their roles in the decomposer subsystem. == Mites == Mites are a hugely successful group with a large number of species. They are among the most diverse and successful of all invertebrates, but because of their small size they go largely unnoticed. They have exploited many habitats. Many live freely in the soil or water, but there are also a large number of species that live as parasites on plants, animals, and some that feed on moulds (fungi). == Ticks == Ticks are blood-sucking ectoparasites, mostly of mammals and birds. They wait on grass or bushes, and jump onto passing animals. A number of birds specialise in picking them off larger animals: the Cattle Egret and the Oxpecker for example. They are quite serious pests, and can be hard to get rid of. They are vectors, carrying diseases such as Lyme disease. == Related pages == *Chigger *Lyme disease == References == Category:Arachnids Category:Parasites",
 "title": "Acarina"
}