{
 "id": "223654",
 "text": "Ankylosaurs were herbivorous armoured dinosaurs in the order Ornithischia. Their armour was made of scutes (bony scales). They were quadrupeds with short and strong legs. Fossils of Ankylosaurs have been found on every continent. They were of two types: * Ankylosauria **Ankylosauridae: armoured from their head to their club-ended tail. **Nodosauridae: no tail club but spikes and bony bumps on body. They first appeared in the Middle Jurassic,But see Yuxisaurus and lived until the end of the Cretaceous period. == Size == When adult, they were large: Edmontonia was bulky, broad and tank-like. Its length when adult was about 6.6 m (22 ft).Edmontonia in: Dodson, Peter & Britt, Brooks & Carpenter, Kenneth & Forster, Catherine A. & Gillette, David D. & Norell, Mark A. & Olshevsky, George & Parrish, J. Michael & Weishampel, David B. The Age of Dinosaurs. Publications International, p141. ISBN 0-7853-0443-6 Both main Edmontonia species, E. longiceps and E. rugosidens weighed about three tonnes.Paul G.S. 2010, The Princeton Field Guide to Dinosaurs, Princeton University Press p. 238 == Diet and feeding == Ankylosaurs were low to the ground. The large hyoid bones left in skeletons shows they had long, flexible tongues. They also had a large, side secondary palate. This means that they could breathe while chewing. Their huge gut suggests they fermented their food, using symbiotic bacteria and gut flora. Their diet was mainly ferns and cycads, which were hugely widespread, especially in the Lower Jurassic. The tropical climate supported plant growth, as it does today. Ankylosaurs fed on vegetation at or below the height of a meter. An unresolved question is whether they could feed higher than their usual mouth level, by raising the front of their body somewhat. This possibility which would give them access to many tree ferns and cycads which would otherwise be out of reach. Given the unevenness of terrain, there might be places they could stand on higher ground, and eat plants normally out of reach. == The ankylosaur message == Ankylosaurs got some protection, not just from their armour, but from their being a miserable reward from the carnivore's point of view. == Distribution == Most ankylosaurs have been found in Laurasia.Note: Ankylosauria = formal name; ankylosaurs a general term. Comparison: Dinosauria vs dinosaurs. The first definitive ankylosaur to be recognized from Gondwana was discovered in Australia in 1964 and later named in 1980 as Minmi paravertebra. Ankylosaurs would be expected to live in heavily wooded areas. == Popularity == Famous members of this group included Ankylosaurus, Euoplocephalus, Pinacosaurus, Edmontonia, Talarurus and Gastonia. == References ==",
 "title": "Ankylosaur"
}