{
 "id": "223656",
 "text": "The Stegosaurs were a group of dinosaurs in the suborder Thyreophora. They have small heads, peg-like teeth and vertical bony plates and spines on their back and tail. They flourished from the Upper Jurassic to the Lower Cretaceous. == Classification == The Stegosauria was originally named as an order by O.C. Marsh in 1877.Marsh O.C. 1877. New order of extinct Reptilia (Stegosauria) from the Jurassic of the Rocky Mountains. American Journal of Science, 14(ser.3):513-514. Now it is treated as an infraorder or suborder (or simply a clade) within the armoured dinosaurs, the Thyreophora. The Stegosauria includes the families Huayangosauridae and Stegosauridae. The Huayangosauridae were an early family of stegosaurs from the Middle Jurassic. They were smaller than later stegosaurs and had shorter and higher skulls. The type genus is Huayangosaurus of China. The poorly-known remains of Regnosaurus from England suggest it also could be a member. Its lower jaw is very similar to that of the former. The vast majority of stegosaurs being in the Stegosauridae. They lived in the later part of the Jurassic and the early Cretaceous. The group includes the well-known Stegosaurus. The family is widespread, with fossils found in the Northern Hemisphere and Africa. Their decline coincides with that of the Cycadophyta.Butler, R.J; Barrett P.M; Kenrick P. and Penn M.G. 2009. Diversity patterns amongst herbivorous dinosaurs and plants during the Cretaceous: implications for hypotheses of dinosaur/angiosperm co-evolution. Journal of Evolutionary Biology, 22: 446–459. Suborder Thyreophora Infraorder Stegosauria * Family Huayangosauridae ** Huayangosaurus (Sichuan, China) **?Regnosaurus (Sussex, England) * Family Stegosauridae ** Adratiklit – (Morocco) ** Chialingosaurus – (Sichuan, China) ** Chungkingosaurus – (Chongqing, China) ** Dacentrurus – (England, France & Spain) ** Hesperosaurus – (Wyoming, USA) ** Miragaia – (Portugal) ** Monkonosaurus – (Tibet, China) ** Paranthodon – (South Africa) ** Wuerhosaurus – (Xinjiang, Western China) ** Kentrosaurus – (Tanzania, Africa) ** Lexovisaurus – (England & France) ** Stegosaurus – (Wyoming, USA) ** Tuojiangosaurus – (Sichuan, China) ** ?Craterosaurus – (Bedfordshire, England) **Jiangjunosaurus – (Xinjiang, Western China) * Uncertain placement (incertae sedis) ** Gigantspinosaurus – (Sichuan, China) == References ==",
 "title": "Stegosauria"
}