{
 "id": "223625",
 "text": "The U.S. Open is a golf tournament, which is one of the four major championships played annually. It is organized by the United States Golf Association. The tournament takes place annually on the third weekend of June, and the host course changes every year. == Past winners == Year Champion Country Venue Location Score 2011 Rory McIlroy Congressional Country Club, Blue Course Bethesda, Maryland 268 (−16) 2010 Graeme McDowell Pebble Beach Golf Links Pebble Beach, California 284 (E) 2009 Lucas Glover Bethpage State Park, Black Course Farmingdale, New York 276 (−4) 2008 Tiger Woods (3) Torrey Pines Golf Course, South Course La Jolla, California 283 (−1) 2007 Ángel Cabrera Oakmont Country Club Oakmont, Pennsylvania 285 (+5) 2006 Geoff Ogilvy Winged Foot Golf Club, West Course Mamaroneck, New York 285 (+5) 2005 Michael Campbell Pinehurst Resort, Course No. 2 Pinehurst, North Carolina 280 (E) 2004 Retief Goosen (2) Shinnecock Hills Golf Club Shinnecock Hills, New York 276 (−4) 2003 Jim Furyk Olympia Fields Country Club, North Course Olympia Fields, Illinois 272 (−8) 2002 Tiger Woods (2) Bethpage State Park, Black Course Farmingdale, New York 277 (−3) 2001 Retief Goosen Southern Hills Country Club Tulsa, Oklahoma 276 (−4) 2000 Tiger Woods Pebble Beach Golf Links Pebble Beach, California 272 (−12) 1999 Payne Stewart (2) Pinehurst Resort, Course No. 2 Pinehurst, North Carolina 279 (−1) 1998 Lee Janzen (2) Olympic Club, Lake Course San Francisco, California 280 (E) 1997 Ernie Els (2) Congressional Country Club, Blue Course Bethesda, Maryland 276 (−4) 1996 Steve Jones Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 278 (−2) 1995 Corey Pavin Shinnecock Hills Golf Club Shinnecock Hills, New York 280 (E) 1994 Ernie Els Oakmont Country Club Oakmont, Pennsylvania 279 (−5) 1993 Lee Janzen Baltusrol Golf Club, Lower Course Springfield, New Jersey 272 (−8) 1992 Tom Kite Pebble Beach Golf Links Pebble Beach, California 285 (−3) 1991 Payne Stewart Hazeltine National Golf Club Chaska, Minnesota 282 (−6) 1990 Hale Irwin (3) Medinah Country Club, Course No. 3 Medinah, Illinois 280 (−8) 1989 Curtis Strange (2) Oak Hill Country Club, East Course Rochester, New York 278 (−2) 1988 Curtis Strange The Country Club, Composite Course Brookline, Massachusetts 278 (−6) 1987 Scott Simpson Olympic Club, Lake Course San Francisco, California 277 (−3) 1986 Raymond Floyd Shinnecock Hills Golf Club Shinnecock Hills, New York 279 (−1) 1985 Andy North (2) Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 279 (−1) 1984 Fuzzy Zoeller Winged Foot Golf Club, West Course Mamaroneck, New York 276 (−4) 1983 Larry Nelson Oakmont Country Club Oakmont, Pennsylvania 280 (−4) 1982 Tom Watson Pebble Beach Golf Links Pebble Beach, California 282 (−6) 1981 David Graham Merion Golf Club, East Course Ardmore, Pennsylvania 273 (−7) 1980 Jack Nicklaus (4) Baltusrol Golf Club, Lower Course Springfield, New Jersey 272 (−8) 1979 Hale Irwin (2) Inverness Club Toledo, Ohio 284 (E) 1978 Andy North Cherry Hills Country Club Cherry Hills Village, Colorado 285 (+1) 1977 Hubert Green Southern Hills Country Club Tulsa, Oklahoma 278 (−2) 1976 Jerry Pate Atlanta Athletic Club, Highlands Course Duluth, Georgia 277 (−3) 1975 Lou Graham Medinah Country Club, Course No. 3 Medinah, Illinois 287 (+3) 1974 Hale Irwin Winged Foot Golf Club, West Course Mamaroneck, New York 287 (+7) 1973 Johnny Miller Oakmont Country Club Oakmont, Pennsylvania 279 (−5) 1972 Jack Nicklaus (3) Pebble Beach Golf Links Pebble Beach, California 290 (+2) 1971 Lee Trevino (2) Merion Golf Club, East Course Ardmore, Pennsylvania 280 (E) 1970 Tony Jacklin Hazeltine National Golf Club Chaska, Minnesota 281 (−7) 1969 Orville Moody Champions Golf Club, Cypress Creek Course Houston, Texas 281 (+1) 1968 Lee Trevino Oak Hill Country Club, East Course Rochester, New York 275 (−5) 1967 Jack Nicklaus (2) Baltusrol Golf Club, Lower Course Springfield, New Jersey 275 (−5) 1966 Billy Casper (2) Olympic Club, Lake Course San Francisco, California 278 (−2) 1965 Gary Player Bellerive Country Club St. Louis, Missouri 282 (+2) 1964 Ken Venturi Congressional Country Club, Blue Course Bethesda, Maryland 278 (−2) 1963 Julius Boros (2) The Country Club, Composite Course Brookline, Massachusetts 293 (+9) 1962 Jack Nicklaus Oakmont Country Club Oakmont, Pennsylvania 283 (−1) 1961 Gene Littler Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 281 (+1) 1960 Arnold Palmer Cherry Hills Country Club Cherry Hills Village, Colorado 280 (−4) 1959 Billy Casper Winged Foot Golf Club, West Course Mamaroneck, New York 282 (+2) 1958 Tommy Bolt Southern Hills Country Club Tulsa, Oklahoma 283 (+3) 1957 Dick Mayer Inverness Club Toledo, Ohio 282 (+2) 1956 Cary Middlecoff (2) Oak Hill Country Club, East Course Rochester, New York 281 (+1) 1955 Jack Fleck Olympic Club, Lake Course San Francisco, California 287 (+7) 1954 Ed Furgol Baltusrol Golf Club, Lower Course Springfield, New Jersey 284 (+4) 1953 Ben Hogan (4) Oakmont Country Club Oakmont, Pennsylvania 283 (−5) 1952 Julius Boros Northwood Club Dallas, Texas 281 (+1) 1951 Ben Hogan (3) Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 287 (+7) 1950 Ben Hogan (2) Merion Golf Club, East Course Ardmore, Pennsylvania 287 (+7) 1949 Cary Middlecoff Medinah Country Club, Course No. 3 Medinah, Illinois 286 (+2) 1948 Ben Hogan Riviera Country Club Pacific Palisades, California 276 (−8) 1947 Lew Worsham St. Louis Country Club St. Louis, Missouri 282 (−2) 1946 Lloyd Mangrum Canterbury Golf Club Beachwood, Ohio 284 (−4) 1942–1945: Cancelled due to World War II 1941 Craig Wood Colonial Country Club Fort Worth, Texas 284 (E) 1940 Lawson Little Canterbury Golf Club Beachwood, Ohio 287 (−1) 1939 Byron Nelson Philadelphia Country Club Gladwyne, Pennsylvania 284 (−4) 1938 Ralph Guldahl (2) Cherry Hills Country Club Cherry Hills Village, Colorado 284 (E) 1937 Ralph Guldahl Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 281 (+1) 1936 Tony Manero Baltusrol Golf Club, Upper Course Springfield, New Jersey 282 (−2) 1935 Sam Parks, Jr Oakmont Country Club Oakmont, Pennsylvania 299 (+15) 1934 Olin Dutra Merion Golf Club, East Course Ardmore, Pennsylvania 293 (+9) 1933 Johnny Goodman (Am) North Shore Country Club Glenview, Illinois 287 (−1) 1932 Gene Sarazen (2) Fresh Meadow Country Club Great Neck, New York 286 (+2) 1931 Billy Burke Inverness Club Toledo, Ohio 292 (+4) 1930 Bobby Jones (Am) (4) Interlachen Country Club Edina, Minnesota 287 (−1) 1929 Bobby Jones (Am) (3) Winged Foot Golf Club, West Course Mamaroneck, New York 294 1928 Johnny Farrell Olympia Fields Country Club Olympia Fields, Illinois 294 1927 Tommy Armour Oakmont Country Club Oakmont, Pennsylvania 301 1926 Bobby Jones (Am) (2) Scioto Country Club Columbus, Ohio 293 1925 Willie Macfarlane Worcester Country Club Worcester, Massachusetts 291 1924 Cyril Walker Oakland Hills Country Club, South Course Bloomfield Hills, Michigan 297 1923 Bobby Jones (Am) Inwood Country Club Inwood, New York 296 1922 Gene Sarazen Skokie Country Club Glencoe, Illinois 288 1921 Jim Barnes Columbia Country Club Chevy Chase, Maryland 289 1920 Ted Ray Jersey Inverness Club Toledo, Ohio 295 1919 Walter Hagen (2) Brae Burn Country Club, Main Course West Newton, Massachusetts 301 1917–1918: Cancelled due to World War I 1916 Chick Evans (Am) The Minikahda Club Minneapolis, Minnesota 286 1915 Jerome Travers (Am) Baltusrol Golf Club Springfield, New Jersey 297 1914 Walter Hagen Midlothian Country Club Midlothian, Illinois 290 1913 Francis Ouimet (Am) The Country Club Brookline, Massachusetts 304 1912 John McDermott (2) Country Club of Buffalo Buffalo, New York 294 1911 John McDermott Chicago Golf Club Wheaton, Illinois 307 1910 Alex Smith (2) Philadelphia Cricket Club, St. Martin's Course Philadelphia, Pennsylvania 298 1909 George Sargent Englewood Golf Club Englewood, New Jersey 290 1908 Fred McLeod Myopia Hunt Club South Hamilton, Massachusetts 322 1907 Alec Ross Philadelphia Cricket Club, St. Martin's Course Philadelphia, Pennsylvania 302 1906 Alex Smith Onwentsia Club Lake Forest, Illinois 295 1905 Willie Anderson (4) Myopia Hunt Club South Hamilton, Massachusetts 314 1904 Willie Anderson (3) Glen View Club Golf, Illinois 303 1903 Willie Anderson (2) Baltusrol Golf Club Springfield, New Jersey 307 1902 Laurie Auchterlonie Garden City Golf Club Garden City, New York 307 1901 Willie Anderson Myopia Hunt Club South Hamilton, Massachusetts 331 1900 Harry Vardon Jersey Chicago Golf Club Wheaton, Illinois 313 1899 Willie Smith Baltimore Country Club, East Course Lutherville-Timonium, Maryland 315 1898 Fred Herd Myopia Hunt Club South Hamilton, Massachusetts 328 1897 Joe Lloyd Chicago Golf Club Wheaton, Illinois 162 1896 James Foulis Shinnecock Hills Golf Club Shinnecock Hills, New York 152 1895 Horace Rawlins Newport Country Club Newport, Rhode Island 173 ==References== Category:Golf tournaments Category:Sports in the United States Category:1895 establishments in the United States",
 "title": "U.S. Open (golf)"
}