{
 "id": "224232",
 "text": "Avoidant personality disorder (AVPD), also called anxious personality disorder, is a personality disorder. Those with AVPD have extreme social anxiety. ==Overview== They usually feel that they are not good enough for others and have no positive traits to them. They usually are very sensitive to being rejected or criticized. As a result, they may choose to not be social or close with others, even if they may want to. They may only choose to be close with someone if they are certain that they will not be rejected. AVPD can be caused by being neglected as a child. However, unlike other personality disorders, someone can have AVPD if they were never abused or neglected. About 2.36% of people have AVPD. ==Symptoms== People with AVPD usually avoid social situations whenever they can. This is because they are very scared of being rejected, made fun of, criticized, or that people may not like them. They are extremely shy or anxious of being in social situations. People with AVPD may have fantasies of being liked and accepted. However, they would rather not have relations because there is the risk that the person they have a relationship with may leave them. If they do begin a relationship, they may feel ashamed and believe they are not good enough for the relationship. They may leave the person early so the person doesn't leave them instead. People with AVPD tend to be very scared of being left or abandoned. They may describe themselves as lonely, anxious, unwanted, and isolated. It may also be common for people with AVPD to be addicted to substances like drugs or alcohol. * * * ==Causes== The cause of AVPD is not fully known. It is believed that someone's genetics and the way they were raised as a kid can play a role in getting AVPD. If someone was neglected as a kid by their parents or peers, they may get AVPD as an adult. * * * * * Symptoms like being shy or scared in social situations can begin when someone is a kid. ==Diagnosis== ===ICD-10 and 11=== The ICD-10 (International Classification of Diseases Version 10) is published by the World Health Organization. It is used to diagnosed conditions worldwide, usually outside of the United States. The ICD-11 was published in 2022, and it merged every personality disorder into one condition (simply called personality disorder). However, the ICD-10 is still used in many countries. These countries still diagnose the different personality disorders. For someone to be diagnosed with AVPD, they must have four of these symptoms:Anxious [avoidant personality disorder] in ICD-10: Diagnostic Criteria and Clinical descriptions and guidelines. * Always feels tense and that something bad will happen * Believes that they are worse than others and have no appeal * Does not form relationships unless they know they will be liked * Always thinking of being criticized or rejected in a social situation * Their life is not as open because they do not want to be embarrassed * Avoids activities that have a lot of social involvement because of fear of being rejected, criticized, or not having approval ===DSM-5=== The DSM-5 (Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition) is used to diagnose mental disorders in the United States. In order for someone to be diagnosed with AVPD, the symptoms they have must have started by early adulthood. There are seven criteria for AVPD. To be diagnosed, someone must have at least four symptoms. The criteria are: * Does not do anything new because it could be embarrassing * Does not form relationships unless they know they will be liked * Always thinking of being criticized or rejected in a social situation * Believes they are worse than others and have no good traits for others * Does not get too intimate in relationships because of fear of being shamed or made fun of * Is self-conscious and scared in social situations because they feel they are worse than others * Avoids activities that have a lot of social involvement because of fear of being rejected, criticized, or not having approval ===Comorbidity=== AVPD can be comorbid with other conditions. A comorbidty is another condition that is more common for someone to have if they have another condition. Many people who have mental disorders like panic disorder and agoraphobia have AVPD. AVPD also has similarities to borderline personality disorder. Earlier doctors believed there was a personality disorder that combined parts of both disorders. This personality disorder was called \"avoidant-borderline mixed personality\". ===Differential diagnosis=== AVPD has differential diagnoses. These are other conditions that are very similar to AVPD and can be mistaken with it. For example, other personality disorders are similar to AVPD and may be mistaken with it. This includes dependent, paranoid, schizoid, and schizotypal personality disorder. AVPD can also be similar to schizophrenia. AVPD is very similar to autism. If someone will be diagnosed with AVPD, their doctors need to make sure they aren't actually autistic instead. ==Prognosis== The prognosis (how well or bad the symptoms of a condition change over time) for AVPD is not fully known. Like other personality disorders, AVPD is thought to be chronic (long-lasting). AVPD is not well researched.. For personality disorders in general, prognosis can be good if the person puts in effort in treatment. ==Treatment== People with AVPD may go to social skills training, psychotherapy, or cognitive behavioral therapy. This will help them slowly get used to being in social situations. Group therapy can help them be more social too. Sometimes, it can be hard for people with AVPD to trust doctors. They may feel that a therapist may reject them. ==Prevalence== A study from 2001 to 2002 said that 2.36% of people have AVPD. Men and women are equally affected by AVPD. ==Controversy== AVPD is a controversial mental disorder. This is because it is very similar to social anxiety disorder (SAD). Some doctors say that AVPD should not be considered as a mental disorder because it is too similar to SAD, while others say that AVPD is a more extreme version of SAD. For example, people with AVPD may be more depressed than people with SAD and they may struggle with daily tasks more. ==References== Category:Health Category:Psychiatry Category:Psychology Category:Health problems Category:Personality disorders",
 "title": "Avoidant personality disorder"
}