{
 "id": "224356",
 "text": "The Wikimedia Foundation is an American non-profit foundation. Their main headquarters is located in San Francisco, United States. The Foundation runs many projects with the Wiki idea and MediaWiki software. Wikipedia is the most famous. Other sites include Wiktionary, Wikiquote, Wikisource, Wikinews, Wikibooks, Wikiversity, Wikimedia Commons, Wikifunctions, Wikidata, Wikivoyage and Meta-Wiki. The Foundation runs other Wikis that are more closely related to the operations of the Foundation itself. They include the Wikimedia Foundation wiki, the MediaWiki wiki, the Test Wikipedia, the Wikimedia Incubator, Bugzilla, and the Wikimania wiki. ==History== ===Founding=== The foundation's creation was officially announced by Wikipedia co-founder Jimmy Wales, who was running Wikipedia within his company Bomis, on June 20, 2003. ===Operation=== The foundation gets most of its funds from donations, as it is non-profit. It also looks for grants. Some companies have helped Wikimedia by giving free computer hardwares and by hosting its servers. Since people can write the wikis, Wikimedia projects are free to use. Funds are used to run computer servers and to pay staff. The Foundation had 700 employees in 2023. ====2010s==== * In 2013, Sue Gardner was the executive director. * In 2015, Patricio Lorente was the Chair of the Wikimedia Foundation Board. * In 2016, Katherine Maher became the executive director. * In 2018, María Sefidari is chair of the board. ====2020s==== * In 2022, Maryana Iskander became Chief Executive Officer, replacing Katherine Maher. == Projects == === Content projects === Wikimedia has many content projects. These include: * Wikipedia: An online encyclopedia. * Meta-Wiki: A place for talking about ideas about Wikimedia projects. * Wikibooks: A collection of educational books. * Wikidata: A shared collection of data that can be accessed by other projects. * Wikifunctions: A collection of code. * Wikimedia Commons: A collection of free images, videos, and sounds. Things there can be used on other projects. * Wikinews: A collection of news articles. * Wikiquote: A collection of quotes. * Wikisource: A library of source texts and documents. * Wikispecies: A taxonomic collection of species. * Wikiversity: A collection of educational materials. * Wikivoyage: A travel guide. * Wiktionary: A dictionary. === Infrastructure projects === There are other projects that help the Wikimedia movement's infrastructure and interface. They do this by making them work smoothly. These include: * Kiwix: A community project that allows offline access to the content projects.Sutherland, Joe. Emmanuel Engelhart, Inventor of Kiwix: the Offline Wikipedia Browser. In: Wikimedia Blog. 12 September 2014. Accessed on 26 November 2014. * MediaWiki: The open-source platform that powers the Wikimedia projects. * Toolforge: A community space that hosts software projects. * Volunteer Response Team: A community group that handles email inquiries. * Wikimedia Cloud Services: A platform for shared cloud computing, based on OpenStack. * Wikitech: A group of developers with a wiki and mailing list. ==Boards== ===Board of Trustees=== The Board of Trustees in charge of the affairs of the Foundation has 10 members: * four who are appointed by the Board itself; * three who are selected by the community of all the different Wikimedia projects; * two who are selected by the local chapters and thematic organizations; * and one emeritus for the foundation's founder, Jimmy Wales. The Signpost reported that two new trustees were elected in 2019: * Nataliia Tymkiv, user:antanana (English or Ukrainian) * Shani Evenstein, user:Esh77 (English or Hebrew) ===Advisory Board=== The Foundation also has an Advisory Board, an international network of experts who have agreed to give the foundation meaningful help on a regular basis in many different areas, including law, organizational development, technology, policy, and outreach. ==Other websites== * * Governance wiki Category:2003 establishments in California Category:Companies based in San Francisco Category:Non-profit organizations of California ==References== Category:United States Category:21st-century establishments in the United States",
 "title": "Wikimedia Foundation"
}