{
 "id": "224765",
 "text": "Vanessa Anne Hudgens (born December 14, 1988) is an American actress and singer. She is most well known for starring in High School Musical, High School Musical 2 and High School Musical 3: Senior Year on Disney Channel. She has won many awards and has been nominated since High School Musical. She has been on many TV shows and movies. She began acting and singing at an early age. She is now married with her boyfriend Marshall TITO Armstrong. ==Early life== Vanessa was born in Salinas, California. Her mother, Gina (née Guangco), held a succession of office jobs, and her father, Gregory Hudgens, was a firefighter. She has a younger sister, Stella Hudgens, who is also an actress. She was raised as a Roman Catholic. Her father is of English ancestry, and her mother, a native of Manila, Philippines, is of Filipino ancestry. All of her grandparents were musicians. ==Discography== *V (2006) *Identified (2008) ==Tours== *The Party's Just Begun Tour (2006) *High School Musical: The Concert (2006/2007) *Identified Summer Tour (2008) ==Awards and nominations== Year Award Category Result Link 2006 Imagen Foundation Awards \"Best Actress – Television\" 21st Annual Imagen Awards Finalists (2006). Accessed 2014-01-12. 2006 Teen Choice Awards \"Choice TV Chemistry\" (shared with Zac Efron) Stephen M. Silverman (2006-08-21). Nick, Jessica Dodge Run-In at Teen Awards . People. Accessed 2014-01-12. 2006 Teen Choice Awards \"Choice TV Breakout Star\" 2007 Teen Choice Awards \"Choice Music: Breakout Artist – Female\" Jennifer McDonnell (2007-07-31). 2007 Teen Choice Awards Winners . Montreal Gazette. Accessed 2014-01-12. 2007 Young Artist Award Best Performance in a TV Movie, Miniseries, or Special (Comedy or Drama) – Leading Young Actress 28th Annual Young Artist Awards – Nominations . Young Artist Foundation. 2007-03-10. Accessed 2014-01-12. 2008 Teen Choice Awards \"Choice Hottie\" 2008 Teen Choice Awards winners and nominees. Teen Choice Awards 2008. 2008-06-17. Accessed 2014-01-12. 2009 Kids Choice Awards \"Favorite Movie Actress\" Nickelodeon Kids' Choice Awards 2009. Scoop — Independent News. 2009-03-30. Retrieved 2014-01-12. 2009 MTV Movie Awards \"Breakthrough Female Performance\" 2009 MTV Movie Awards \"Best Kiss\" (shared with Zac Efron) 2009 Teen Choice Awards \"Choice Movie Actress: Music/Dance\" 2009 Teen Choice Awards \"Choice Movie: Liplock\" (shared with Zac Efron) 2009 Teen Choice Awards \"Choice Hottie\" 2010 ShoWest \"Female Star Of Tomorrow\" Vanessa Hudgens: ShoWest Winner . Celebrity-Gossip.com. 2010-03-19. Retrieved 2014-01-12. 2011 People's Choice Awards \"Favorite Movie Star Under 25\" And the winners are.... People's Choice Awards. Retrieved 2014-01-12 2011 Teen Choice Awards \"Red Carpet Fashion Icon - Female\" 2011 Teen Choice Awards \"Choice Movie: Liplock\" (shared with Alex Pettyfer) 2012 Teen Choice Awards \"Choice Movie Actress: Sci-Fi/Fantasy\" 2013 Kids Choice Awards \"Favorite Movie Actress\" ==References== ==Other websites== * * * Category:1988 births Category:Living people Category:Actors from Monterey County, California Category:American child actors Category:American child singers Category:American movie actors Category:American pop singers Category:American television actors Category:High School Musical people Category:People from Monterey County, California Category:Singers from California",
 "title": "Vanessa Hudgens"
}