{
 "id": "224952",
 "text": "A fractal is any pattern, that when seen as an image, produces a picture, which when zoomed into, has infinite detail, sometimes having parts similar to the original image. The word fractal was made by Benoît Mandelbrot in 1975 from the Latin word fractus, which means \"broken\" or \"fractured\". A simple example of a fractal is a tree that branches into smaller branches, and those branches into smaller branches, and so on to infinity. It may be noted that you cannot create a full fractal in real life, since they require infinite detail in their full form. Despite this, one can get very close. These shapes have many practical applications in real life. == Examples == There are many types of fractals, made in a large variety of ways. One example is the Sierpinski triangle, where there are an infinite number of small triangles inside the large one. Another example is the Mandelbrot set, named for Benoît Mandelbrot. The Sierpinksi triangle is constructed using simple patterns, but the Mandelbrot set is based on an equation. There are also many natural examples of fractals in nature including trees, snowflakes, some vegetables and coastlines. === The Koch Curve === The Koch Curve is a simple example of a fractal. First, start a straight line segment (part of a straight line). Cut the line into 3 same-sized pieces. Get rid of the middle of those pieces, and put in the top part of a triangle with sides which are the same length as the bit to cut out. We now have 4 line segments which are touching at the ends. We can now do what we just did to the first segment to each of the 4 bits. We can now do the same thing again and again to all the bits we end up with. We now do this forever and look at what we end up with. The length of the Koch Curve is infinity, and the area of the Koch Curve is zero. This is quite strange. A line segment (with dimension 1) could have a length of 1, but it has an area of 0. A square of length 1 and width 1 (with dimension 2) will have area 1 and length of infinity. === Similarity dimension === So, the Koch Curve seems to be more than something of dimension 1 (a line), and less than something of dimension 2 (a flat shape). The idea of the similarity dimension is to give a dimension of sorts, which gives a better idea of length or area for fractals. So, for a Koch Curve, we want a dimension between 1 and 2. The Koch Curve can be cut into four pieces, each of which are \\frac{1}{3} of the size of the original. We call the number of pieces that a fractal can be cut into N, and we call the size difference B. We put those into the equation: \\frac{\\log N}{-\\log B} Where \\log is the logarithm of a number. This number is called the Hausdorff Dimension of the fractal. In the Koch Curve, this is \\frac{\\log 4}{-\\log \\frac{1}{3}}=1.2619... as we wanted. The Koch Curve is one of the simplest fractal shapes, and so its dimension is easy to work out. Its similarity dimension and Hausdorff dimension are both the same. This is usually not true for more complex fractals. === Koch snowflake === The Koch snowflake (or Koch star) is basically the same as the Koch curve, except it starts with an equilateral triangle instead of a line segment. It could also be seen as three copies of the Koch curve put together. == Uses == Fractals have many applications e.g. in biology (lung, kidneys, heart rate variability, etc...), in earthquakes, and in finance, where it is related to the so called heavy tail distributions and in physics. (This is partly because of how much intricate detail these fields have.) This indicates that fractals should be studied to understand why fractals are so frequent in nature. Some fractals exist only as art, but others are very useful in real life. Fractals are very efficient shapes for radio antennas and are used in computer chips to efficiently connect all the components. Also, coastlines can be thought of as fractals, since they are detailed at every level, or close to it. == Related pages == *Chaos theory *Iteration == References == == Other websites == * Category:Fractals",
 "title": "Fractal"
}