{
 "id": "225035",
 "text": "Resource room is a place where special education students attend daily classes. These students are usually included in the general classroom and just need more support.The resource room: rationale and implementation. DD Hammill,Wiederholt, J. Lee .1972. Philadelphia:Buttonwood Farms Students are taught individually and in small groups. The number of students in a resource room is at most five students per teacher. Mainstreaming in education typically includes this service. Students in separate classes generally do not need the resource room because all the support they need is in the self- contained classroom.T. Lamminmaki, T. Ahonen, H. T. de Barra, A. Tolvanen, K. Michelsson, and H. Lyytinen. (1997)Comparing Efficacies of Neurocognitive Treatment and Homework Assistance Programs for Children with Learning Difficulties.Journal of Learning Disabilities, May 1, 1997; 30(3): 333 - 345. Special education teachers in resource rooms focus on the goals set by an Individualized Education Program. These goals are based on the individual student's need to develop executive skills, complete their homework and behave. The programs can help students with language-based learning disabilities like dyslexia.Hagaman, J.L., & Reid, R. (2008) The effects of paraphrasing strategy on the reading comprehension of middle school students at risk for failure in reading. Remedial and Special Education, 29(4), 222-234 Visuo-motor perception, arithmetic, spelling and overall self-perception improve after time in the resource room classroom.An Investigation of the Effectiveness of Resource Rooms for Children with Specific Learning Disabilities Lawrence H. Weiner Journal of Learning Disabilities, Apr 1969; vol. 2: pp. 223 - 229. The small-group instructional model leads to achievement in students with a multitude of educational disabilities.Marzano, R.J., Pickering, D.J., & Pollock, J.E. (2001). Classroom instruction that works: Research-based strategies for increasing student achievement. Alexandria, VAL Association for Supervision and Curriculum DevelopmentEffects of a Short-Term Intervention Resource-Room Program On Task Orientation and Achievement Peter D. O'Connor, Gary B. Stuck, and Marvin D. Wyne Journal of Special Education, Dec 1979; vol. 13: pp. 375 - 385. Their peers also benefit when the concepts they learned in general education are reinforced in resource rooms.Macbeth in the Resource Room: Students with Learning Disabilities Study Shakespeare Sue Thorson Journal of Learning Disabilities, Nov 1995; vol. 28: pp. 575 - 581. == References == == Other websites == *http://specialed.about.com/od/idea/a/resourceroom.htm Category:Special education",
 "title": "Resource room"
}