{
 "id": "225205",
 "text": "Tardigrades ('water bears') are microscopic, segmented animals. They live in water. They are members of the tactopod phylum Tardigrada, part of the superphylum Ecdysozoa. They are also known as water bears or moss piglets. Tardigrades were first described in 1773. While originally named Kleiner Wasserbär (little waterbear) by zoologist Johann August Ephraim Goeze, the name \"Tardigrade\" was later given in 1777, by biologist Lazzaro Spallanzani, with the name meaning \"slow stepper\". There are more than 1000 different species of Tardigrade. Tardigrades have a cylindrical shape with four segments, each with two legs. Each leg has little claws. The biggest adults may reach a body length of 1.2 mm, the smallest below 0.1 mm. Freshly hatched larvae may be smaller than 0.05 mm. Tardigrades feed on plant cells by penetrating the cell wall and eating what is inside. Some tardigrades are carnivores. Tardigrades are eutelic: all adult Tardigrades of the same species have the same number of cells. Some species have as many as 40,000 cells in each adult, while others have far fewer.Seki, Kunihiro; Toyoshima, Masato 1998. Preserving tardigrades under pressure. Nature 395 (6705): 853–854. Preserving tardigrades under pressure | Nature Bordenstein, Sarah. \"Tardigrades (Water Bears)\". Microbial Life Educational Resources. National Science Digital Library. Retrieved 2014-01-24. Tardigrades can be found in many habitats: in moss, freshwater, the Himalayas, and the ocean. They are one of the few animals that can be found on the highest mountains and the deepest seas. About 83% of the known species live on land, the other 17% live in water. == Survivability == Tardigrades are able to live in environments that would kill most animals. In 2007, scientists discovered that some Tardigrades were able to survive 10 days in outer space. This meant living in a vacuum with severe radiation. Tardigrades can survive more than ten years without water. Tardigrades can survive extreme temperatures. They can live for a few hours in temperatures close to absolute zero and above boiling point. They can survive a few minutes in temperatures as high as . Some Tardigrades can survive being frozen for over 30 years.BBC News: News from elewhere. Japan: 'Water bear' reproduces after 30 years on ice - BBC News Tardigrades can also survive radiation at hundreds of times a level that would be deadly to humans. They can also survive in toxic environments and during impact events. In 2019, a lander with Tardigrades on board crashed on the moon. It is believed that the Tardigrades survived and could live for a few years on the moon. The Tardigrades slow their metabolism to survive these environments. Rotifers have a similar agility to survive. == References == Category:Minor phyla Category:Extremophiles Category:Invertebrates",
 "title": "Tardigrade"
}