{
 "id": "225966",
 "text": "Mark Alan Webber (born 27 August 1976 in Queanbeyan, New South Wales) is an Australian Formula One driver. At the German Grand Prix, he became the first Australian to win a race since Alan Jones in .AUSmotive.com - Webber wins in Germany! == Racing record == === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 1994 Australian Formula Ford Yellow Pages Racing 16 0 0 ? ? 30 13th 1995 Australian Formula Ford Yellow Pages Racing 16 3 3 ? ? 158 4th 1995 Australian Formula Holden Birrana Racing 2 0 0 0 2 32 8th 1995 Formula Ford Festival Van Diemen 1 0 0 0 1 N/A 3rd 1996 European Formula Ford Van Diemen ? ? ? ? ? ? 3rd 1996 British Formula Ford Van Diemen ? ? ? ? ? 113 2nd 1996 Formula Ford Festival Van Diemen 1 1 0 0 1 N/A 1st 1996 Australian Formula Holden Ralt Australia 2 1 0 0 1 20 10th 1997 British Formula Three Alan Docking Racing 16 1 3 1 5 127 4th 1997 Macau Grand Prix Alan Docking Racing 1 0 0 0 0 N/A 4th 1997 Masters of Formula Three Alan Docking Racing 1 0 0 0 1 N/A 3rd 1998 FIA GT Championship AMG Mercedes (GT1) 10 5 0 0 8 69 3rd 1998 Le Mans 24 Hours AMG Mercedes (GT1) 1 0 1 0 0 N/A NC 1999 Le Mans 24 Hours AMG Mercedes (GTP) 1 0 0 0 0 N/A DNS 2000 International Formula 3000 European Arrows 10 1 0 2 3 21 3rd 2001 International Formula 3000 Super Nova Racing 12 3 2 3 4 39 2nd 2002 Formula One KL Minardi Asiatech 17 0 0 0 0 2 16th 2003 Formula One Jaguar Racing 16 0 0 0 0 17 10th 2004 Formula One Jaguar Racing 18 0 0 0 0 7 13th 2005 Formula One BMW WilliamsF1 Team 19 0 0 0 1 36 10th 2006 Formula One WilliamsF1 Team 18 0 0 0 0 7 14th 2007 Formula One Red Bull Racing 17 0 0 0 1 10 12th 2008 Formula One Red Bull Racing 18 0 0 0 0 21 11th 2009 Formula One Red Bull Racing 17 2 1 3 8 69.5 4th 2010 Formula One Red Bull Racing 19 4 5 3 10 242 3rd 2011 Formula One Red Bull Racing 11 0 3 3 6 149* 2nd* Season in progress. === Complete International Formula 3000 results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 DC Points 2000 European Arrows F3000 IMO 3 SIL 1 CAT Ret NUR Ret MON Ret MAG 16 A1R 4 HOC 3 HUN 9 SPA 16 3rd 21 2001 Super Nova Racing INT 7 IMO 1 CAT 7 A1R Ret MON 1 NUR 2 MAG 1 SIL 4 HOC Ret HUN Ret SPA Ret MNZ Ret 2nd 39 ===Complete Formula One results=== (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap; small number denotes finishing position) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points KL Minardi Asiatech Minardi PS02 Asiatech AT02 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR GBR FRA GER HUN BEL ITA USA JPN 16th 2 Jaguar Racing F1 Team Jaguar R4 Cosworth CR-5 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN ITA USA JPN 10th 17 Jaguar Racing F1 Team Jaguar R5 Cosworth CR-6 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN BEL ITA CHN JPN 13th 7 Jaguar Racing F1 Team Jaguar R5B Cosworth CR-6 3.0 V10 BRA 13th 7 BMW Williams F1 Team Williams FW27 BMW P84/5 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN CHN 10th 36 Williams F1 Team Williams FW28 Cosworth CA2006 2.4 V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 14th 7 Red Bull Racing Red Bull RB3 Renault RS27 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 12th 10 Red Bull Racing Red Bull RB4 Renault RS27 2.4 V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 11th 21 Red Bull Racing Red Bull RB5 Renault RS27 2.4 V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 4th 69.5 Red Bull Racing Red Bull RB6 Renault RS27-2010 2.4 V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 3rd 242 Red Bull Racing Red Bull RB7 Renault RS27-2011 2.4 V8 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 3rd 258 Red Bull Racing Red Bull RB8 Renault RS27-2012 2.4 V8 AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA 6th 179 Infiniti Red Bull Racing Red Bull RB9 Renault RS27-2013 2.4 V8 AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 3rd 199 Sources: Half points awarded as less than 75% of race distance was completed by the winner. Did not finish, but was classified as he had completed more than 90% of the race distance. ==References== == Other websites == Category:1976 births Category:Living people Category:Australian Formula One drivers Category:Formula One current Category:Sportspeople from New South Wales",
 "title": "Mark Webber"
}