{
 "id": "226366",
 "text": "Edward Jenner (17 May 1749 – 26 January 1823) was an English physician known for creating the vaccine for smallpox. == Vaccination == Vaccination was a concept that was known before Jenner. In 1765, Dr John Fewster published a paper in the London Medical Society entitled \"Cow pox and its ability to prevent smallpox\", but he did not pursue the subject further. After 1770, at least five investigators in England and Germany (Sevel, Jensen, Jesty 1774, Rendell, Plett 1791) successfully tested a cowpox vaccine in humans against smallpox.Plett P.C. 2006. Peter Plett and other discoverers of cowpox vaccination before Edward Jenner. Sudhoffs Archiv (in German) 90 (2): 219–32. For example, Dorset farmer Benjamin Jesty successfully vaccinated and presumably induced immunity with cowpox in his wife and two children during a smallpox epidemic in 1774. Jenner may have been aware of Jesty's procedures and success, but after Jenner's work some 20 years later the procedure became widely understood at last. It was a common observation that milkmaids were generally immune to smallpox. Jenner thought that the pus in the blisters that milkmaids received from cowpox (a disease similar to smallpox, but much less virulent) protected them from smallpox. He may already have heard of Benjamin Jesty's success. On 14 May 1796, Jenner tested his hypothesis on an eight- year-old boy, the son of his gardener. He scraped pus from cowpox blisters on the hands of a milkmaid. Jenner inoculated Phipps in both arms that day, subsequently producing in Phipps a fever and some uneasiness, but no full- blown infection. Later, he injected the boy with a mild form of smallpox and he showed no sign of infection.An inquiry into the causes and effects of the variolae vaccinae, Edward Jenner. Retrieved 17 November 2012 Jenner successfully tested his hypothesis on 23 more subjects. :\"Jenner's unique contribution was not that he inoculated a few persons with cowpox, but that he then proved [by subsequent challenges] that they were immune to smallpox. Moreover, he demonstrated that the protective cowpox pus could be effectively inoculated from person to person, not just directly from cattle\".Hopkins, Donald R. 2002. The greatest killer: smallpox in history, with a new introduction. Chicago: University of Chicago Press. p. 80. Bazin H. 2000. The eradication of smallpox: Edward Jenner and the first and only eradication of a human infectious disease. Academic Press. ISBN 978-0-12-083475-4 == References == Category:1749 births Category:1823 deaths Category:English physicians Category:Vaccinologists",
 "title": "Edward Jenner"
}