{
 "id": "22653",
 "text": "Comic books are books with comics, with pictures that make a story.Scott Shaw and Mike Kazaleh. 2012. Secret Agent Orange, Annoying Orange #1, New York: Papercutz, December 2012, pp. 61–62.Sabin, Roger 1996. Comics, Comix & Graphic Novels: a history of comic art. Phaidon, London. ISBN 0 7148 3993 0 Comics were started in the 1800s, a century which saw the development of modern colour printing and many other inventions. Wood engraving was a cheaper type of illustration which was widely used in the 19th century. These things are important because they created an understanding that illustrations are sometimes just as important as words. The first comic strip appeared in France in 1889, and in the U.S.A. in 1897.Couperie, Pierre and Horn, Maurice C. 1968. A history of the comic strip. Crown, New York 1968, translated from the French first edition of 1967, p9. Since the middle 20th century DC Comics and Marvel Comics have introduced superheroes such as Superman, Batman, Wonder Woman, Spider-Man and the Incredible Hulk. Very often, characters in books, video games, movies and television appear in comics, and sometimes comic book characters are used in movies, TV shows or video games.Mila Bongco 2015. Reading comics: language, culture, and the concept of the Superhero in comic books. Routledge, p.xv Comic books are published in three different forms. * Single issues that are usually 32 pages long are called comic books. These are printed and bound like a magazine, with the pages folded and stapled together through the centerfold. * Several comics may be put together in a trade paperback. These have spines like a book and are glued together. * A bigger comic book that is bound like a trade paperback but is all new, instead of collecting older comics, is called a graphic novel. The list of famous comics are: *Superman *Batman *Spider-Man *Wonder Woman *Supergirl *Hulk *Captain America *Fantastic Four *X-Men *The Flash *Captain Marvel *Iron Man ==References== Category:Magazines",
 "title": "Comic book"
}