{
 "id": "226852",
 "text": "Ante Pavelić (14 July 1889 ; Bradina,Austria-Hungary– 28 December 1959 ; Madrid,Spain) was the founding member of the Croatian national socialist/fascist Ustaše movement and terrorist organization in the 1930s. Later, during World War II, he will be the leader (Poglavnik - Head) of the Independent State of Croatia, a puppet state\"International Law Reports\" by Lauterpacht, C. J. Greenwood, Cambridge University Press 1957 Page 69 Croatia is defined by contemporary writers as a 'puppet-state' or 'puppet- government', terms which appear to be of comparatively recent adoption in the field of international law.\"The Chetniks\" by Jozo Tomasevic, Stanford University Press 1975 Page 53 Without German tanks and bayonets on Croatian territory, no proclamation of a Croatian puppet state could have succeeded. of Nazi Germany. ==Early life== Ante Pavelić was born in Bradina, a small village roughly 15 kilometres south west of Hadžići in Bosnia and Herzegovina, then Austria-Hungary, although he draws his roots from southern Lika, in the small town of Krivi Put on the central part of the Velebit plain. His parents moved to Bosnia. As an adult, Ante Pavelić decided to move to Zagreb to study the law. An extremist even in his youth, he became a member of the organization known as the \"Frankovci\" whose founder, Dr. Josip Frank, was the father-in-law of Slavko Kvaternik, an Austro-Hungarian army officer.War and Revolution in Yugoslavia, 1941-1945: Occupation and Collaboration by Jozo Tomasevich, Stanford University Press 2001, page 417 This was issued by retired former Austro-Hungarian Lieutenant Colonel Slavko Kvaternik, a leading domestic Ustasha, whom Pavelic immediately promoted to marshal. In 1919 he was the interim secretary of the Pure Party of Rights. In 1921 he was arrested along with several other members of the party but was released; he defended them at the trial and lost. Kvaternik had long been a strong advocate of Croat separatism and the German ideas on a separate Croat state found in him a ready tool. Pavelić's quarrelsome nature became more and more apparent in the years immediately after the first war when he became involved in one dispute after another with the Centralist Party and the Croat Peasant Party of Radić. He was the sole representative of his Party in the Skupština (Yugoslav Parliament) but rarely attended sessions and, when he did, he sulked in his seat and only occasionally indulged in a long harangue in protest against some measure which he did not approve.CIC Summary of Information: HEADQUARTERS COUNTER INTELLIGENCE CORPS, ALLIED FORCES HEADQUARTERS, APO 512 30 January 1947 ==1920s and 1930s== In the early 1920s, Pavelić began to establish his contacts with Croat émigrées in Vienna and Budapest and later entered into close accord with the Macedonian terrorist society IMRO. In 1927 he acted as counsel for the defense of the Macedonian terrorists at the Skopje trials.The Lights that Failed: European International History 1919-1933 by Zara S. Steiner, Oxford University Press, 2005, pages 270-271 The terrorist group IMRO (Internal Macedonian Revolutionary Organization, founded in 1893) was the most powerful terrorist movement in the Balkans, and proved to be a highly disruptive political force. Assisted and funded by backer is Sofia, IMRO was divided between those wanting the whole of Macedonia annexed to Bulgaria and those who favoured a separate Macedonia in a Balkan Federation. Repeated incursions across the frontiers threatened Bulgaria's relations with both Yugoslavia and Greece. The Assassination of King Alexander: A Case Study of the League of Nations by James Wilson Alexander - 1956 - page 29 This was the dreaded IMRO - the Internal Revolutionary Macedonian Organization. This organization was an illegal government, with its own army, executioners, and secret service. It was a terrorist organization which condemned its victims to death in trials from which they were usually absent. Terrorism, U.S. Strategy, and Reagan Policies by Marc A. Celmer Praeger/Greenwood, 1987, , page 6. The second incident was the assassination of King Alexander of Yugoslavia. On October 9, 1934, King Alexander and French Foreign Minister Louis Barthou were assassinated in the streets of Marseilles, France, by members of the Ustasa- Internal Macedonian Revolutionary Organization (IMRO). This incident led to the formulation and adoption by the League of Nations of the 1937 Convention for the Prevention and Punishment of Terrorism, the first International attempt at dealing with terrorism. The Columbia History of Eastern Europe in the Twentieth by Joseph Held, Columbia University Press, 1992, , page 320 The Internal Macedonian Revolutionary Organization (IMRO) split after World War I onto two wings. The first demanded annexation of Macedonia to Bulgaria. During the 1920s it played an important role in Bulgarian domestic politics and organized terrorist groups to perpetrate sabotage in Yugoslavia. The other wing favored communism and a Balkan Federation, to include Macedonia. In 1927 he was elected to the Zagreb city council. He held the position of the party secretary in the Party of Rights until 1929 and the beginning of royal government in the Kingdom of Yugoslavia. Shortly after the proclamation of the establishment of the government Alexander I of Yugoslavia in January 1929, Pavelić fled abroad and was subsequently sentenced to death in absentia at Belgrade for his part in anti-Serb demonstrations organized at Sofia by Bulgarian and Macedonian terrorists. He then co-founded the Ustaše terrorist organization and went underground. Camps for training terrorists and saboteurs were set up in Italy and Hungary, chiefly at Brescia and Borgotaro in Italy and Janka Puszta in Hungary and an armed insurrection was attempted in 1933 when the Ustaše,\"Croatia: between Europe and the Balkans\" by William Bartlett, Routledge 2003 Page 18 Croatian Party of Right, had established a terrorist organization known as the Ustashe Croatian Revolutionary Organization\"Organizing for Total War\" by American Academy of Political and Social Science, Francis James Brown, American Academy of Political and Social Science 1942 Page 225 As an interesting detail for the American public it may be reported that the terrorist organization Ustashe, paid by the Italians, was sending money to the ... armed by the Italians, attempted to invade the country by crossing the Adriatic sea in motorboats. This was unsuccessful but its lack of success probably was instrumental in the decision to assassinate King Alexander I of Yugoslavia. Two attempts were made, the last one successful and Aleksandar was slain at Marseilles 9 October 1934 along with the French Foreign Minister, Louis Barthou. The singular lack of armed protection afforded to the Yugoslav monarch, and the general laxity of security precautions when it was well-known that one attempt had already been made on Alexander's life are grim tributes to Pavelić organizational abilities; he had apparently been able to bribe a high official in the Surete General. The Prefect of Police of Marseilles, Jouhannaud, was subsequently removed from office. ==World War II== Pavelić remained in Italy until the beginning of World War II. As the leader of the Ustaše he directly ordered, organized and conducted a campaign of terror against Serbs, Jews, Gypsies, and communist Croats and Bosniaks. The extent of this campaign reached the proportions of genocide. Pavelić's Ustaše regime was the most murderous Nazi puppet state in the whole of occupied Europe.Ladislaus Hory and Martin Broszat: Der Kroatische Ustascha-Staat, 1941-1945 Stuttgart, 1964Edmond Paris: Genocide in Satellite Croatia, The American Institute for Balkan Affairs, 1525 West Diversey Parkway, Chicago, Illinois. Published in 1961, 1962, 1990, Introduction Numerous surviving testimonies from the Nuremberg Trials and the German\"All Or Nothing: The Axis and the Holocaust, 1941-1943\" by Jonathan Steinberg Routledge 2002 Pages 29-30 By 28 June (1941) Glaise von Horstenau reported that \"according to reliable reports from countless German military and civil observers during the last few weeks the Ustasi have gone raging mad\". Serbian and Jewish men, women were literary hacked to death. Whole villages were razed to the ground and the people driven into barns to which the Ustasi set fire. On 10 July 1941 he added \"Our troops have to be mute witnesses of such events; it does not reflect well on their otherwise high reputation... I am frequently told that German occupation troops would finally have to intervene against Ustasha crimes. This may happen eventually. Right now, with the available forces, I could not ask for such action. Ad hoc intervention in individual cases could make the German Army look responsible for countless crimes which it could not prevent in the past.\" General Edmund Glaise von Horstenau to the OKW, July 10, 1941 See http://samvak.tripod.com/pp55.htmlHitler's Renegades: Foreign Nationals in the Service of the Third Reich by Christopher J Ailsby, Brassey's 2004 Page 156 One of the Horstenau's reports stated: \" We saw no sign of guerillas but there were plenty of ownerless horses and cattle, not to mention innumerable geese. At Crkveni Bok, an unhappy place where, under the leadership of Ustase lieutenant-colonel, some 500 country folk from 15 to 20 years had met their end, all murdered, the women raped then tortured, the children killed. I saw in the River Sava a woman's corpse with the eyes gouged out and a stick shoved into the sexual parts. The woman was at most 20 years old when she fell into the hands of these monsters. Anywhere in a corner, the pigs are gorging themselves on an unburied human being. All the houses were looted. The 'lucky' inhabitants were consigned to one of the fearsome boxcar trains; many of these involuntary 'passengers' cut their veins on the journey\" and the Italian war archives bear witness to bestialities perpetrated against the civilian population of the state. According to these testimonies, the German officers themselves were horrified by the scenes of atrocities committed by his Ustaše, forcing them to stop the bloodshed (Jasenovac, 1941), arrest one of the most notorious Ustaše (Fra Miroslav Filipović-Majstorović, Banja Luka, 1942) and disarm an Ustaše detachment (Eastern Bosnia, 1942). These atrocities were recorded in novelistic literature and poetry: Malaparte's Kaputt \"Basket of oysters chapter\", inspired by the widespread practices of the Ustaše gouging out the eyes of Serbs; Kovačić's \"Jama (The Pit)\", where Ustaše tied Serbs with barbed wire and dropped them into pits; Oljača's \"Kozara\"; Svetina's \"Volčiči (The Wolf Puppies)\". As far as the Serb population of the puppet state was concerned, the stated aim was the extermination of a third of their numbers, exile for another third, and a forced conversion to Catholicism for yet another.\"For the rest - Serbs, Jews and Gypsies - we have three million bullets. We will kill one part of the Serbs, the other part we will resettle, and the remaining ones we will convert to the Catholic faith, and thus make Croats of them.\" Mile Budak, Minister of Education of Croatia, July 22, 1941 The Yugoslav Auschwitz and the Vatican, Vladimar Dedijer, Anriman-Verlag, Freiburg, Germany, 1988 p 130 See http://www.fantompowa.net/Flame/yugoslavia_catholic_church.htm The Ustaše succeeded in reaching their first goal, exterminating close to one third of the Serbs and possibly more. A Gestapo report to Himmler (17 February 1942) on increased Partisan activities stated that \"Increased activity of the bands is chiefly due to atrocities carried out by Ustasha units in Croatia against the Orthodox population. The Ustashas committed their deeds in a bestial manner not only against males of conscript age, but especially against helpless old people, women and children. The number of the Orthodox that the Croats have massacred and sadistically tortured to death is about three hundred thousand.\" Report to Reichsfuhrer SS Heinrich Himmler from the Geheime Staatspolizei - GESTAPO - dated 17 February 1942. See http://samvak.tripod.com/pp55.html or http://www.gorgelink.org/freebooks/vaknin/terrorism.pdf Pavelić's regime was not officially recognized by the Vatican, but at no point did the Church condemn the genocide and forced conversions to Catholicism perpetrated by the Ustaše.Israel Gutman (ed.) Encyclopedia of the Holocaust vol 2, p.739 Soon after coming to power in April 1941 Pavelić was given a private audience in Rome by Pope Pius XII, an act for which the Pope was widely criticized. A British Foreign Office memo on the subject described Pius as \"the greatest moral coward of our age\" for receiving Pavelić.Mark Aarons and John Loftus Unholy Trinity pp.71-2 Pavelic remained Hitler's servant to the end of war. His servitude toward Hitler was described by A. VeesenmayerDebórah Dwork, Robert Jan Pelt, Robert Jan Van Pelt: Holocaust: A history; Publisher W. W. Norton & Company, Sep 1, 2003 page 183 > What Pavelic meant by \"independence\" he explained to German foreign minister > Ribentrop's trusted troubleshooter for the southeast Europe, Anton > Veesenmeyer. Pavelic had only two wishes, Veesenmayer reported to Berlin: > first to obtain German recognition of Croatia; and second, an opportunity to > thank Hitler in person and promise him \"to live and die for the Fuehrer\". A Yugoslavian court declared that Pavelić had been responsible for the deaths of 700,000 people during his reign. ==Post-war== In May 1945 Pavelić fled via Bleiburg to Austria, where he stayed for a few months before transferring to Rome, where he was hidden by members of the Roman Catholic Church (as is documented in de-classified US Intelligence documents).U.S. Intelligence and the Nazis by Richard Breitman, Cambridge University Press, Apr 4, 2005, pages 214-5 Six months later, he fled to South America. Upon arriving in Argentina via the ratlines, he became a security advisor to Juan Perón. Perón issued 34,000 visas to Croatians: both the Nazi collaborators and the anti-communists that fled from the new communist government led by Josip Broz Tito. On April 10, 1957, the 16th anniversary of the founding of the Independent State of Croatia, the 67 year old Pavelić was shot and seriously wounded by an unknown assailant in Buenos Aires.\"Yugoslav Rebel Shot in Argentina,\" Oakland Tribune, April 12, 1957, p3 The operation was attributed to Tito's Yugoslav intelligence, although the anniversary also suggested an attempt at revenge by a Chetnik activist. Despite having a bullet in his spine, Pavelić elected not to be hospitalized. Two weeks later, the Argentine government agreed to the Tito government's request to extradite Pavelić, and he went into hiding. Although there were reports that he had fled to work for the Stroessner regime in Paraguay, Pavelić's whereabouts remained unknown until late 1959, where it was learned that he had been granted asylum in Spain. Pavelić died on 28 December 1959, at the German hospital in Madrid, reportedly from complications due to the bullet in his spine.\"Ex-Puppet Premier of Croatia Dies,\" Nevada State Journal (Reno), January 3, 1960, p26 ==Notes== ==References== * Hermann Neubacher: Sonderauftrag Suedost 1940-1945, Bericht eines fliegendes Diplomaten, 2. durchgesehene Auflage, Goettingen 1956 * Ladislaus Hory and Martin Broszat: Der Kroatische Ustascha-Staat, 1941-1945 Stuttgart, 1964 * Encyclopædia Britannica, 1943 - Book of the year, page 215, Entry: Croatia * Worldmark Encyclopedia of the Nations, Europe, edition 1995, page 91, entry: Croatia * Encyclopædia Britannica, Edition 1991, Macropedia, Vol. 29, page 1111. * Helen Fein: Accounting for Genocide - Victims and Survivors of the Holocaust, The Free Press, New York, Edition 1979, pages 102, 103. * Alfio Russo: Revoluzione in Jugoslavia, Roma 1944. * Ruth Mitchell: The Serbs Choose War, Doubleday, Doran, 1943, page 148 * Encyclopedia of the Holocaust, vol. 2, p. 739\\. * Avro Manhattan: The Vatican's Holocaust, Ozark Books, 1986, page 48. * Edmond Paris: Genocide in Satellite Croatia, The American Institute for Balkan Affairs, 1525 West Diversey Parkway, Chicago, Illinois. Published in 1961, 1962, 1990 * Cali Ruchala, Lord of the Danse Macabre: Ante Pavelic and the Independent State of Croatia, Degenerate Magazine © 1996 ==Related pages== * World War II * Ustaše * Jure Francetić * Croatian Liberation Movement ==Other websites== * Ante Pavelic I * Ante Pavelic II * Ivan Goran Kovačić The Pit * Tied up in the Rat Lines by Yossi Melman * Vatican-Hitler-Pavelic connections Category:1889 births Category:1959 deaths Category:Prime Ministers of Croatia Category:Former dictators Category:Holocaust perpetrators Category:War criminals",
 "title": "Ante Pavelić"
}