{
 "id": "226991",
 "text": "A think tank is a special organization which helps other organizations and groups with problems they do not know how to solve. They do this by providing data or knowledge, and by discussing the options in detail. They get their information by doing research, and by collecting ideas and data from a wide range of sources. == Origins == The first think tank was the British Royal United Services Institute (1831),O'Connor, Damian P 2011. Between peace and war: British defence and the Royal United Services Institute, 1831-2010. RUSI. though of course the term \"think tank\" is much later, post World War II. Non- government institutions in the United States started early in the 20th century. The Arthur D. Little consultancy, incorporated in 1909, pioneered the idea of contracted professional services. The Carnegie Endowment for International Peace was founded in 1910.Medvetz, Thomas 2012. Think tanks in America. University of Chicago Press The Institute for Government Research, which later merged into the Brookings Institution, was formed in 1916. Other early twentieth century organizations now classified as think tanks include the Hoover Institution (1919), and Chatham House in London (1920). The Great Depression and its aftermath spawned several economic policy organizations, such as the National Planning Association (1934) and the Committee for Economic Development (1943). == The cold war era == Think tanks of the modern kind started after the Second World War, in the cold war era.Although thought about the implications of atomic weapons started immediately: Brodie, Bruce (ed) 1946. The absolute weapon: nuclear arms and the emerging international order. New York: Harcourt, Brace. This includes material written in 1945. The RAND Corporation was started in 1946 inside the Douglas Aircraft Company, and was set up as an independent corporation in 1948.Dickson, Paul 1971. Think tanks. New York: Atheneum, p2328. The name was taken from R&D; (research and development), though in fact it did no development. The RAND used the same operations research (O.R.) methods which scientists had developed during the war. This was the application of knowledge, scientific methods and thinking to solve the new problems posed by the war. After the war, the RAND used very similar techniques,Quade, Edward S. (ed) 1967. Analysis for military decisions. Chicago: Rand McNally. mostly based on the hard sciences like maths, physics and economics. It was and still is funded mainly by the American government. The cold war period raised the question of how the American government might handle nuclear weapons in bargaining and negotiating with the Soviet Union.Kaplan, Fred 1983. The wizards of Armageddon. New York: Simon & Schuster. and (pbk) This was the speciality of Herman Kahn, a RAND staff member who set up his own think tank in 1961, called the Hudson Institute. His publications on how to think about these issues,Kahn, Herman 1960. On thermonuclear war. Princeton University PressKahn. Herman 1962. Thinking about the unthinkable. New York: Horizon Press, and Avon Books. and those of Thomas Schelling,Schelling, Thomas C. 1960. The strategy of conflict. Harvard University Press. were landmarks in the post-war history of negotiating strategy. == Modern period == More recently, think tanks have specialised into particular areas of interest, such as foreign policy.Abelson D.E. 1996. American think tanks and their role in U.S. foreign policy. Basingstoke & New York: Macmillan/St. Martin's.Abelson D.E. 2014. Old world, new world: the evolution of foreign affairs think tanks. International Affairs 90, 1, 125142. Many have become advocates for political interests, doing research which can be used by public relations and lobbying groups.Smith J.A. 1991. The idea brokers: think tanks and the rise of the new policy elite. New York: Free Press.Denham A. & Garrett N. 1998. British think tanks and the climate of opinion. London: UCL Press. == Related pages == *Lobbying == References ==",
 "title": "Think tank"
}