{
 "id": "227185",
 "text": "A Pinto horse is a spotted horse. They are not a breed, but a coat color. In fact, any horse breed can be a Pinto as long as they have patches of white or another color. Pintos are often confused with Paints, a horse breed. They look very similar. The difference is that a Paint is a breed, and a Pinto is a coat color that can be on any breed, including Paints. == History == Pintos are so old that they were found in tombs in Ancient Egypt dating back to 4 B.C.\"National Pinto Horse Registry\", http://www.pintohorseregistry.com/TheBreed.html , (Date accessed: Feb 10, 2010) In the 16th century Cortez brought thousands to the New World. Some of them were set free, and Native Americans caught them. The Native Americans liked them for their toughness and their color. Their color blended in with the environment and made a natural camouflage. They were known to make great war horses.\"Horse Breed Directory: Pinto\", http://animal.discovery.com/guides/horses/breeds/pinto.html, (Date accessed: Feb 10, 2010) Their name came from the Spanish word pintado, which means “painted”. == Color == Pintos have pink skin, blue eyes, and white or multicolored hooves. They can be either a white horse with colored patches, or a colored horse with white patches.\"About The Pinto\", http://www.pinto.org/about_pinto.html, (Date accessed: Feb 10, 2010) It has been said that no two Pintos are exactly alike. == Patterns == Pintos have 3 different patterns: *Tobiano: The Tobiano is the most common. They are white, with large colored spots that often overlap. *Overo: A colored horse with jagged white markings. *Tovero: A Tovero is a mix of Tobiano and Overo. == Type == Pintos come in 4 different types: *Stock: A Western horse, usually a Quarter Horse or a Paint *Hunter: An English horse, usually a Thoroughbred or a European Warmblood *Pleasure: Usually an Arabian, Andalusian, or a Morgan *Saddle: A gaited horse, usually a Saddlebred, Hackney, or a Tennessee Walker == Size == Pintos come in 4 different sizes: *Miniature: usually about 34 inches. *Miniature B: usually about 34-38 inches. *Pony: usually about 38-56 inches. *Horse: 56 inches and up. ==Related pages== *Horse == References == Category:Horses",
 "title": "Pinto horse"
}