{
 "id": "227204",
 "text": "Jeremy Charles Robert Clarkson (born 11 April 1960) is an English author, broadcaster, journalist, talk show host. He is best known for presenting BBC television show Top Gear with Richard Hammond and James May. He is also known for controversial remarks. He also writes columns for The Sunday Times and The Sun. Clarkson was ranked 49th on Motor Trend Magazine's Power List for 2011. It is a list of the fifty most important figures in the automotive industry. On 26 March 2015, while Clarkson was not allowed to be at work, the BBC announced it will not keep paying him after he mocked and physically assaulted a producer during an argument . ==Shows he has appeared in== ===Presenter=== Year Title 1988–2000 Top Gear (Original Format) BBC VHS, 1994–1998 1995–1996 Jeremy Clarkson's Motorworld BBC VHS, 1996 1997 Jeremy Clarkson's Extreme Machines BBC VHS, 1997 1998 Robot Wars N/A 2000 Jeremy Clarkson's Car Years N/A 2001 Jeremy Clarkson's Speed BBC VHS, 2001 2001 You Don't Want To Do That N/A 2002–2015 Top Gear (Current Format) BBC DVD, 2010– 2002 Jeremy Clarkson: Meets the Neighbours N/A 2003 The Victoria Cross: For Valour BBC DVD, 2011 2004 Inventions That Changed the World N/A 2007 Jeremy Clarkson: The Greatest Raid of All Time BBC DVD, 2011 2016- The Grand Tour N/A ===Other roles=== Year Title Role 1993 Mr Blobby's Christmas Guest 1997 Room 101 Guest 1997 The Mrs Merton Show Guest 1998–2000 Clarkson Chat Show 2002 100 Greatest Britons Guest 2002 Have I Got News for You Guest Host 2002 Friday Night with Jonathan Ross Guest 2003 Patrick Kielty Almost Live Guest 2003 Parkinson Guest 2003 Question Time Participant 2003 Grumpy Old Men Participant 2004 Call My Bluff Participant 2004 QI Participant 2004 Who Do You Think You Are? Participant 2005 Top of the Pops Guest Host 2006 Cars Voice Artist 2006 Never Mind the Buzzcocks Guest Host 2006 The F Word Participant 2008 The One Show Guest 2008 Have I Got News for You Guest Host 2009 The Chris Moyles Show Guest 2009 Love the Beast Guest 2009 8 out of 10 Cats Guest 2009 Have I Got News for You Guest 2010 Have I Got News for You Guest Host 2010 QI Participant 2011 Forza Motorsport 4 Voice Artist 2012 The Chris Evans Breakfast Show Guest 2012 Have I Got News For You Guest Host ==Books he has written== Book Publisher Year Jeremy Clarkson's Motorworld BBC Books Penguin Books 1996 Reprinted 2004 Clarkson on Cars Virgin Books Penguin Books 1996 Reprinted 2004 Clarkson's Hot 100 Virgin Books Carlton Books 1997 Reprinted 1998 Planet Dagenham Andre Deustch Carlton Books 1998 Reprinted 2006 Born To Be Riled BBC Books Penguin Books 1999 Reprinted 2007 Jeremy Clarkson On Ferrari Lancaster Books Salamander Books 2000 Reprinted 2001 The World According To Clarkson Icon Books Penguin Books 2004 Reprinted 2005 I Know You Got Soul Michael Joseph Penguin Books 2005 Reprinted 2006 And Another Thing... Michael Joseph Penguin Books 2006 Reprinted 2007 Don't Stop Me Now!! Michael Joseph Penguin Books 2007 Reprinted 2008 For Crying Out Loud! Michael Joseph Penguin Books 2008 Reprinted 2009 Driven To Distraction Michael Joseph Penguin Books 2009 Reprinted 2010 How Hard Can It Be? Michael Joseph Penguin Books 2010 Reprinted 2011 Round The Bend Michael Joseph Penguin Books 2011 Reprinted 2012 * Two books with the best columns from previous publications, called \"The Collected Thoughts Of Clarkson\" and \"Never Played Golf\" were issued by Top Gear Magazine, in 2003 and 2004. ==References== Category:1960 births Category:Living people Category:English journalists Category:English television presenters Category:People from Doncaster Category:Television personalities from Yorkshire Category:Writers from Yorkshire",
 "title": "Jeremy Clarkson"
}