{
 "id": "227296",
 "text": "A taxicab number is the name given by mathematicians to a sequence of special numbers: 2, 1729 etc. A taxicab number is the smallest number that can be expressed as the sum of two positive cubes in n distinct ways. It has nothing to do with taxis, but the name comes from a well-known conversation that took place between two famous mathematicians: Godfrey Hardy and Srinivasa Ramanujan. ==The story about Godfrey Hardy’s taxi== Godfrey Hardy was a professor of mathematics at Cambridge University. One day he went to visit a friend, the brilliant young Indian mathematician Srinivasa Ramanujan, who was ill. Both men were mathematicians and liked to think about numbers. When Ramanujan heard that Hardy had come in a taxi he asked him what the number of the taxi was. Hardy said that it was just a boring number: 1729. Ramanujan replied that 1729 was not a boring number at all: it was a very interesting one. He explained that it was the smallest number that could be expressed by the sum of two cubes in two different ways. This story is very famous among mathematicians. 1729 is sometimes called the “Hardy-Ramanujan number”. ==Explanation of the Hardy-Ramanujan's number== *When a particular number is multiplied by itself the answer is called a “square”, e.g. 3x3=9, so the number 9 is a square. *When a particular number is multiplied thrice by itself the answer is called a “cube”, e.g. 3x3x3=27, so the number 27 is a cube. *Another example of a cube is 8, because it is 2x2x2. *27+8=35, so 35 is the “sum of two cubes” (“sum” in this sense means “numbers that are added together”). There are two ways to say that 1729 is the sum of two cubes. 1x1x1=1; 12x12x12=1728. So 1+1728=1729 But also: 9x9x9=729; 10x10x10=1000. So 729+1000=1729 There are other numbers that can be shown to be the sum of two cubes in more than one way, but 1729 is the smallest of them. ==Known taxicab numbers== Since the famous conversation between Hardy and Ramanujan, mathematicians have tried to find other interesting numbers that are the smallest number that can be expressed by the sum of two cubes in three/four/five etc. different ways. These numbers are very, very big, and have been found by computers. So far, the following six taxicab numbers are known : :\\operatorname{Ta}(1) = 2 = 1^3 + 1^3 :\\begin{matrix}\\operatorname{Ta}(2)&=&1729&=&1^3 + 12^3 \\\\\\&&&=&9^3 + 10^3\\end{matrix} :\\begin{matrix}\\operatorname{Ta}(3)&=&87539319&=&167^3 + 436^3 \\\\\\&&&=&228^3 + 423^3 \\\\\\&&&=&255^3 + 414^3\\end{matrix} :\\begin{matrix}\\operatorname{Ta}(4)&=&6963472309248&=&2421^3 + 19083^3 \\\\\\&&&=&5436^3 + 18948^3 \\\\\\&&&=&10200^3 + 18072^3 \\\\\\&&&=&13322^3 + 16630^3\\end{matrix} :\\begin{matrix}\\operatorname{Ta}(5)&=&48988659276962496&=&38787^3 + 365757^3 \\\\\\&&&=&107839^3 + 362753^3 \\\\\\&&&=&205292^3 + 342952^3 \\\\\\&&&=&221424^3 + 336588^3 \\\\\\&&&=&231518^3 + 331954^3\\end{matrix} :\\begin{matrix}\\operatorname{Ta}(6)&=&24153319581254312065344&=&582162^3 + 28906206^3 \\\\\\&&&=&3064173^3 + 28894803^3 \\\\\\&&&=&8519281^3 + 28657487^3 \\\\\\&&&=&16218068^3 + 27093208^3 \\\\\\&&&=&17492496^3 + 26590452^3 \\\\\\&&&=&18289922^3 + 26224366^3\\end{matrix} Category:Number theory",
 "title": "Taxicab number"
}