{
 "id": "227378",
 "text": "thumb |Podiceps cristatus The great crested grebe or pūteketeke is a water bird. It is a member of the grebe family. Its scientific name is Podiceps cristatus. == Description == The great crested grebe is a medium sized bird. It is 46–51 cm long. Its wingspan (both wings open) is 59–73 cm long. The bird is white, brown and black, and it has orange crest feathers on its head. It has a long, sharp pink bill. Baby great crested grebe have black and white stripes on their heads. == Habitat and behaviour == The great crested grebe is found in Europe, Asia, Africa and Australia. It is the biggest grebe in Europe. It lives in freshwater lakes. It eats crustaceans (for example, crabs), insects and small frogs. It dives into the water to find food. The bird has an interesting mating ritual. This means two birds (male and female) do a \"dance\" in the water before they mate. Grebes dance every time the pair meets, and the dance varies according to the circumstance. Returning to the nest is different from meeting out on the water, for instance. Most dances end in a bout of head-shaking.Huxley, Julian 1914. The courtship of the great crested grebe. Proceedings of the Zoological Society, London. Reprinted by Jonathan Cape, London 1968, with a forword by Desmond Morris. The great crested grebe makes a nest from plants. The nest floats on top of the water. A pair of grebes will usually have two eggs. When the babies are born, they cannot swim. Their parents teach them to swim and dive. Sometimes the babies will sit on their parents backs while the parents swim in the water. == Conservation == The bird nearly became extinct in the United Kingdom in the 19th century. This is because people wanted to use their orange head feathers. People wanted to put the feathers on their hats and clothes. The RSPB (Royal Society for the Protection of Birds) stopped this. There are now many great crested grebe in the United Kingdom, where their conservation status is green (\"least concern\"). ==Bird of the Century== In 2023, the great crested grebe won a Bird of the Century contest. The organization Forest & Bird organized the contest. One reason the great crested grebe won was because John Oliver talked about the contest on his television show Last Week Tonight and told people to vote for the great crested grebe. He also paid for posters in New Zealand, India, Japan, and the United States. The posters showed the great crested grebe as if it were a movie. One poster showed \"Lord of the Wings,\" like Lord of the Rings. John Oliver asked Forest & Bird whether or not he should do this before he did it. They said yes. Even so, some New Zealanders said Oliver ruined the contest. The great crested grebe got the most votes, 290,374 votes. The second-most votes were for the North Island brown kiwi, 12,904 votes. == References == Category:Podicipediformes",
 "title": "Great crested grebe"
}