{
 "id": "227497",
 "text": "Mortality rate is a measurement. It measures the number of deaths in a population. The World Bank calculated the death rate for the whole world was 8 deaths per 1,000 people in 2020. The mortality rate has been going down during the last hundred years, but the COVID-19 pandemic increased mortality rates globally. More than 6.8 million deaths were directly due to COVID-19. The number of people dying of some causes has increased. The rate is often reported as a number of deaths per 1000 individuals per year. For example, a mortality rate of 9 in a population of 1,000 would mean 9 deaths per year in that entire population. Some rare or deadly causes of death are are reported as percentages (of the world, countries, demographics). It can also be shown as a ratio (genders for example). Excess (more than expected) mortality rates across the European Union rose by 19% in December 2022, compared to the average number of deaths in the same period between 2016 and 2019. In Germany, 37.3% more people died in December 2022 than average for December. This is thought to be partly because of weakened immune systems and partly because healthcare systems have been badly affected. There are also effects of climate change. People are becoming more unhealthy. == Why keep track of how people die? == Counting and tracking the causes of death helps know more about how people are dying. This is done globally by governments or organisations, to know more about what's causing people to die. Some are relevant to a specfic country or area. Fatal diseases and hazards are often related to certain jobs. More specific or rarer causes can be tracked to learn from the small amount of information there is there, or other deadly (more dangerous, frequent, or unavoidable) causes as another example, can use high or low numbers or percentages to know the facts and track trends. It is important to know why people die to improve how people live. Measuring how many people die each year helps to learn about our health systems and direct resources to where they are needed most. For example, mortality data can help focus activities and resource allocation among different parts of life such as transportation, food and agriculture, and the environment as well as health. == Related pages == * Life expectancy * Birth rate ==References== Category:Demography Category:Death",
 "title": "Mortality rate"
}