{
 "id": "227431",
 "text": "The Flag of the State of Utah was adopted in 2024 and has three unequal horizontal bands of blue, white and red, with a navy blue hexagon containing a beehive and five-pointed star inside a yellow hexagon. The five peaks of the white stripe (shaped like a mountain) represent the five original tribes of the state, those being the Navajo, Shoshone, Goshute, Paiute and Ute. == Historic Flag == In 1912, the Sons and Daughters of Utah Pioneers ordered a custom made copy of the newly adopted state flag to be showed off to the battleship USS Utah, which was commissioned on August 31, 1911. When the flag came, the group found out that the coat of arms on the flag was in full color instead of white, and the manufacturer had added a gold ring around the shield. Rather than have the flag remade, the Utah legislature changed the law to match the battleship flag, and the flag was showed off to the USS Utah. A bald eagle, the national bird of the United States represents the safety of America. The arrows in the talons of the eagle represent courage in war. The sego lily, the Utah state flower, represents peace. The state motto \"industry\" represents progress, hard work, and community as does the emblem of the beehive, which is also a traditional Mormon symbol. Crossed Union flags show Utah's support and commitment to the United States. The name, Utah, appears underneath the beehive. The date 1847 represents the year Brigham Young led the first Mormons into the state. The year listed below that, 1896, represents the year that Utah was admitted to the Union. The gold circle around the state seal represents eternal order. The shield underneath the bald eagle represents common defense (military). Today, this flag is the historic flag of the state. The design of the seal was adopted in 1850 by the Territory of Utah and changed by the artist \"Harry Edwards\" when Utah became a state in 1896. == Historical flags == File:Flag of the Utah Territory.svg|Flag of the Utah Territory File:Flag of Utah (1903–1904).svg|Flag of Utah (1903-04; unofficial) File:Flag of Utah (1904–1911).svg|Flag of Utah (1904-11, unofficial) File:Flag of Utah (1911–1913).svg|Flag of Utah (1911-13) File:Flag of Utah (1913–1922).png|Flag of Utah (1913-22) File:Flag of Utah (1922–2011).svg|Flag of Utah (1922-2011) File:Flag of Utah (2011–2024).svg|Flag of Utah (2011-24) File:Flag of the State of Utah (2011-2024).svg|Flag of Utah (2011-24; enhanced) ==Flag of the State of Deseret== According to most descriptions, the flag of the State of Deseret, a state proposed by the Mormons, was almost the same to the flag of the State of Utah.Walker, Ronald W. \"A Banner is Unfurled\" Dialogue: A Journal of Mormon Thought Volume 26 Number 4, Winter 1993, pages 71-91. ==References== Utah Category:Utah Utah",
 "title": "Flag of Utah"
}