{
 "id": "227612",
 "text": "Uncle Tom's Cabin; or, Life Among the Lowly is an anti-slavery novel by Harriet Beecher Stowe was published on March 3rd, 1852. It greatly influenced many people's thoughts about African Americans and slavery in the United States. It also strengthened the conflict between the Northern and Southern United States. This led to the American Civil War. The book's effect was so powerful that Lincoln said when he met Stowe at the beginning of the Civil War, \"So this is the little lady who made this big war.\"Charles Edward Stowe, Harriet Beecher Stowe: The Story of Her Life (1911) p. 203. The main character of the novel is Uncle Tom, a patient black slave. The sentimental novel showed the effects of slavery. It also said that Christian love is stronger than slavery.The Complete Idiot's Guide to American Literature by Laurie E. Rozakis, Alpha Books, 1999, page 125, where it says that one of the book's main messages is that \"The slavery crisis can only be resolved (fixed, solved) by Christian love.\"Domestic Abolitionism and Juvenile Literature, 1830–1865 by Deborah C. de Rosa, SUNY Press, 2003, page 121, where the book quotes Jane Tompkins on how Stowe's strategy with the novel was to stop slavery through the \"saving power of Christian love.\" This quote is from \"Sentimental Power: Uncle Tom's Cabin and the Politics of Literary History\" by Jane Tompkins, from In Sensational Designs: The Cultural Work of American Fiction, 1790–1860. New York: Oxford UP, 1985. Pp. 122–146. In that essay, Tompkins also says \"Stowe conceived her book as an instrument for bringing about the day when the world would be ruled not by force, but by Christian love.\" Uncle Tom's Cabin was the most popular novel of the 19th century,\"The Sentimental Novel: The Example of Harriet Beecher Stowe\" by Gail K. Smith, The Cambridge Companion to Nineteenth-Century American Women's Writing by Dale M. Bauer and Philip Gould, Cambridge University Press, 2001, page 221. and the third best-selling book of the century (the first one was the Bible).Introduction to Uncle Tom's Cabin Study Guide, BookRags.com. Retrieved May 16, 2006. It helped abolitionism spread in the 1850s.Goldner, Ellen J. \"Arguing with Pictures: Race, Class and the Formation of Popular Abolitionism Through Uncle Tom's Cabin.\" Journal of American & Comparative Cultures 2001 24(1–2): 71–84. Fulltext: online at Ebsco. In these days, it has been praised as a very important help to anti- slavery. However, it has also been criticized for making stereotypes about black people.Hulser, Kathleen. \"Reading Uncle Tom's Image: From Anti-slavery Hero to Racial Insult.\" New-York Journal of American History 2003 65(1): 75–79. .Africana: arts and letters: an A-to-Z reference of writers, musicians, and artists of the African American Experience by Henry Louis Gates, Kwame Anthony Appiah, Running Press, 2005, page 544. == Inspiration and references == Harriet Beecher Stowe was born in Connecticut. She was an abolitionist. Stowe wrote her novel because of the 1850 passage of the second Fugitive Slave Act. This law punished people who helped slaves run away. It also made the North stop and return the South's black runaways. Mrs. Edward Beecher wrote to Harriet (\"Hattie\"), \"If I could use a pen as you can, I would write something that will make this whole nation feel what an accursed thing slavery is.\" At that time, Stowe was a wife with six children who sometimes wrote for magazines. Her son, Charles Stowe, said that his mother read this letter out loud to her children. When she finished the letter, she stood up, and with \"an expression on her face that stamped itself on the mind of her child\", she said, \"I will write something...I will if I live.\" That is how Uncle Tom's Cabin began. According to Stowe, she began thinking about Uncle Tom's Cabin; or, Life Among the Lowly as she was in a church in February 1851. She had a vision of a Christian black man being beaten and praying for the people who were beating him as he died. She was also partly inspired to write her novel by the autobiography of Josiah Henson. Henson was a black man who had run away and helped many black slaves.Harriet Beecher Stowe, A Key to Uncle Tom's Cabin 1853, page 42, in which Stowe states \"A last instance parallel with that of Uncle Tom is to be found in the published memoirs of the venerable Josiah Henson…\" An excerpt of this information and acknowledgement is also in A Routledge Literary Sourcebook on Harriet Beecher Stowe's Uncle Tom's Cabin by Debra J. Rosenthal, Routledge, 2003, pages 25–26. She was also helped by the book American Slavery As It Is: Testimony of a Thousand Witnesses by Theodore Dwight Weld and the Grimké sisters.Weld, Theodore Dwight. The Columbia Encyclopedia, Sixth Edition, 2001–2005. Retrieved May 15, 2007. Stowe also said that she got lots of ideas for Uncle Tom's Cabin by talking to runaway slaves when she was living in Cincinnati, Ohio. In her book A Key to Uncle Tom's Cabin (1853), Stowe wrote about the stories that inspired her when she was writing Uncle Tom's Cabin.A Key to Uncle Tom's Cabin , Uncle Tom's Cabin and American Culture, a Multi-Media Archive. Retrieved April 20, 2007. However, later research showed that Stowe did not actually read many of the stories inside the book until after her novel was published. == Publication == Uncle Tom's Cabin began in a series in an anti-slavery newspaper, The National Era. The National Era had also printed other works Stowe had written. Because everybody liked the story so much, John P. Jewett of Boston asked Stowe to turn the serial into a book. Stowe was not sure if people would like to read the story as a book. However, she finally agreed. John Jewett, sure that the book would be popular, asked Hammatt Billings to engrave six pictures for the book.First Edition Illustrations , Uncle Tom's Cabin and American Culture, a Multi-Media Archive. Retrieved April 18, 2007. In March 20, 1852, the finished book came out. By June it was selling ten thousand copies a week. By October American sales alone were 150 thousand copies. In the first year it was published, 300,000 copies of the book were sold, and it was translated into many important languages. == Summary == === Eliza's escape, Tom is sold === A Kentucky farmer named Arthur Shelby is afraid of losing his farm because of debts. Even though he and his wife, Emily Shelby, are kind to their slaves, he decides to sell two of them: Uncle Tom, a middle-aged man with a wife and children, and Harry, the son of his wife's maid Eliza. Emily Shelby is shocked and unhappy because she promised Eliza that she would not sell her son. George Shelby, her son, is unhappy because he admires Uncle Tom as his friend and Christian. When Eliza hears about Mr. Shelby's plans to sell her son, she decides to run away with her only son. She writes a letter saying sorry to Mrs. Shelby and runs away that night. Meanwhile, Uncle Tom is sold and put into a boat, which sails down the Mississippi River. There, he makes friends with a girl called Evangeline (\"Eva\"). When Eva falls into the water and he saves her, Eva's father, Augustine St. Clare, buys Tom. Eva and Tom become good friends because they both love Jesus very deeply. === Eliza's family hunted, Tom's life with St. Clare === During Eliza's escape, she meets her husband, George Harris, who had run away before her. They decide to try to run away to Canada. However, they are hunted by a slave hunter named Tom Loker. Tom Loker finally traps Eliza and her family, so that George shoots Loker. Eliza is worried that Loker might die and go to hell. Because of this, she persuades her husband to take him to a Quaker town to get better. The gentle Quakers change Tom Loker greatly. In St. Clare's house, St. Clare argues with his sister, Miss Ophelia. She thinks that slavery is wrong, but is prejudiced against blacks. St. Clare buys Topsy, a black child, and challenges Miss Ophelia to educate her. Miss Ophelia tries, but fails. After Tom has lived with St. Clare for about two years, Eva becomes very sick. She has a vision of heaven before she dies. Because of her death, many people change. Miss Ophelia loses her prejudice of black people, Tospy decides to become \"good\", and St. Clare decides to free Tom. === Tom's life with Simon Legree === St. Clare, however, is hurt when he tries to stop a fight at a tavern and dies. Because of this, he cannot keep his promise to free Tom. His wife sells Tom to a plantation owner named Simon Legree. Legree takes Tom to Louisiana. There, he meets other slaves, including Emmeline (who Legree bought at the same time that he bought Tom). Legree begins to hate Tom when Tom disobeys his order to whip the other slaves. Legree beats him, and decides to destroy Tom's faith in God. However, Tom secretly continues to read the Bible and help the other slaves. At the plantation, Tom meets Cassy, another black slave. Her two children had been sold, and she had killed her third child because she was afraid that her child would be sold, too. Loker has been changed because of the Quakers. George, Eliza, and Harry have finally reached Canada and become free. Meanwhile, Uncle Tom feels so unhappy that he almost gives up, but he has two visions of Jesus and Eva. He decides to continue to be a Christian, even if he has to die. Cassy and Emmeline, with Tom’s encouragement, run away. They cleverly use Legree’s superstitious fears to help them. When Tom does not tell Legree where they are, Legree tells his men to beat him to death. Tom forgives the two men who beat him as he dies, and they feel sorry and become Christians. George Shelby comes just as Tom is dying to free him. He is very angry and sad. However, Tom, saying smilingly, “Who,—who,—who shall separate us from the love of Christ?” dies. == Important characters == === Uncle Tom === Uncle Tom, the title character of the story, is a patient, noble, unselfish black slave. Stowe wanted him to be a “noble hero”: in the book, he stands up for what he believes in. Even though they do not want to, even his enemies admire him.A Routledge Literary Sourcebook on Harriet Beecher Stowe's Uncle Tom's Cabin by Debra J. Rosenthal, Routledge, 2003, page 31. Recently, however, his name has also been used negatively. People often think of \"Uncle Tom\" as an old black man trying to make his masters happy, as people have criticized his quiet acceptance of slavery.SparkNotes Editors. “SparkNote on Uncle Tom’s Cabin.” SparkNotes LLC. 2002. http://www.sparknotes.com/lit/uncletom/ (accessed March 18, 2010). However, others argue that this is not true. First of all, Uncle Tom is not really old - he is only eight years older than Mr. Shelby, which shows that he is probably around fifty. Also, Tom is not happy with slavery. His acceptance is not because of stupidity or because he likes slavery. It is because of his religious faith, which tells him to love everyone. Wherever Uncle Tom goes, he loves and spreads comfort and kindness. He helps slaves escape, such as Eliza, Emmeline and Cassy. He also refuses to beat other slaves. Because of this, he is beaten himself. Stowe was not trying to make Tom an example for blacks but for white and black people. She says that if white people were to be loving and unselfish like Uncle Tom, slavery would be impossible. === Eliza Harris === Eliza Harris is Mrs. Shelby's favorite maid, George Harris' wife, and Harry's mother. Eliza is a brave, intelligent, and very beautiful young slave. Eliza loves her son, Harry, very much. It is possible her love for him was even greater because she lost two of her first infant children. Her motherly love is shown when she bravely escapes with her son. Perhaps the most well- known part of Uncle Tom's Cabin is the part where Eliza escapes on the Ohio River with Harry. This escape is said to have been inspired by a story heard in the Lane Theological Seminary in Cincinnati by John Rankin to Stowe's husband Calvin, a professor at the school. In Rankin's story, in February, 1838, a young slave woman had escaped across the frozen Ohio River to the town of Ripley, Ohio with her child in her arms and stayed at his house before she had gone further towards the north.Hagedorn, Ann. Beyond The River: The Untold Story of the Heroes of the Underground Railroad. Simon & Schuster, 2002, pp. 135–139. === Eva === Eva \"Evangeline\" St. Clare is St. Clare and Marie's angelic daughter. She enters the story when Tom saves her from drowning when he was going to be sold. Eva asks her father to buy Tom. She says, \"I want to make him happy\". Through her, Tom becomes St. Clare's leading coachman and Eva's \"especial attendant (helper)...Tom had...orders to let everything else go, and attend to Miss Eva whenever she wanted him,—orders which our readers may fancy (imagine) were far from disagreeable to him.\" She is very beautiful: \"Her form was the perfection of childish beauty...Her face was remarkable less for its perfect beauty of features than for a singular (strange) and dreamy earnestness (seriousness) of expression...all marked her out (made her different) from the other children, and made every one turn and look after her\". To Tom, she \"...seemed something almost divine; and whenever her golden head and deep blue eyes peered (looked) out upon him...he half believed that he saw one of the angels stepped out of his New Testament.\" He says that \"She's got the Lord's mark in her forehead.\" Eva is an almost perfect, Christ- like child. She is very sad about slavery. She does not see the difference between blacks and whites. She talks very much about love and forgiveness. Even Topsy is touched by her love. Eva becomes one of the most important people in Tom's life. === Ophelia St. Clare === Ophelia St. Clare is perhaps the most complicated female character in the novel. St. Clare calls her, \"...desperately ... good; it tires me to death to think of it.\" She does not like slavery. However, she does not like to be touched or come close to any black person as a human being. When she first saw Eva \"...shaking hands and kissing\" with the blacks, she declared that it had \"...fairly turned her stomach (made her feel sick).\" She adds, \"I want to be kind to everybody, and I wouldn't have anything hurt; but as to kissing...How can she?\" She has a \"clear, strong, active mind\", and is very practical. However, she has a warm heart, which she shows in her love for St. Clare and Eva. Ophelia hates slavery, but has a deep prejudice against blacks. St. Clare, as a challenge to her, buys Topsy. He tells her to try educating her. At first she tries to teach and help Topsy simply because of duty. However, Stowe says that duty is not enough: there must be love. Eva's death changes Ophelia. When Topsy cries, \"She said she loved me...there an't (is not) nobody left now...!\" Ophelia gently says, as \"honest tears\" fell down her face, \"Topsy, you poor child...I can love you, though I am not like that dear little child. I hope I've learnt something of the love of Christ from her. I can love you...and I'll try to help you to grow up a good Christian girl.\" Stowe thought that there were many people like Miss Ophelia St. Clare, who did not like slavery but could not think of blacks as people. She wanted to write about such problems through Miss Ophelia. == Other characters == * Arthur Shelby, the owner of Uncle Tom in Kentucky, Shelby sells Tom to Mr. Haley to pay his debts. Arthur Shelby is a clever, kind, and basically good-hearted man. However, he still does slavery and is not as morally strong as his wife. Stowe used him to show that slavery makes everyone who does it become wicked - not just the cruel masters. * Emily Shelby is Arthur Shelby's loving, gentle, and Christian wife. She thinks slavery is wrong. She tries to persuade her husband to help the Shelby slaves and is one of the many kind female characters in the story. * George Shelby is the young son of Mr. and Mrs. Shelby. Good-hearted, passionate, and loving, he is Uncle Tom's friend. Because of this, he is very angry when Uncle Tom is sold. After Tom dies, he decides to free all the slaves on the Shelby's farm, saying, \"Witness (see), eternal God! oh, witness, that, from this hour, I will do what one man can to drive out this curse of slavery from my land!\" He is morally stronger than his father. He does what he promises and thinks. * George Harris Eliza's husband. A very clever and curious mulatto man, he loves his family very much and fights for his freedom bravely and proudly. * Augustine St. Clare Eva's father. Augustine St. Clare is a romantic, playful man. He does not believe in God, and drinks wine every night. He loves Eva very deeply and feels sorry for his slaves. However, like Mr. Shelby, he does not do anything about slavery. * Marie The wife of St. Clare. She is \"...a yellow faded, sickly woman, whose time was divided among a variety of fanciful diseases, and who considered (thought) herself...the most ill-used and suffering person [that lived]...\" Silly, complaining, and selfish, she is the opposite of people like Mrs. Shelby and Mrs. Bird. She thinks slavery is good and says about Topsy, \"If I had my way, now, I'd send...[her] out, and have her thoroughly whipped; I'd have her whipped till she couldn't stand!\" After her husband dies, she sells all the slaves. * Topsy the \"heathenish\" black slave girl who Miss Ophelia tries to change. At first, Miss Ophelia \"...[approaches] her new subject very much as a person might be supposed to approach a black spider, supposing them to have benevolent (kind) designs toward it\". Topsy feels this difference from duty and love. When Eva says, \"Miss Ophelia would love you, if you were good,\" she laughs and says, \"No; she can't bar (bear) me, 'cause I'm a nigger (black)! she'd 's soon have a toad touch her! There can't nobody love niggers, and niggers can't do nothin' (nothing)! I don't care.\" However, in time, she grows to love and respect people through Eva's love. She later becomes a missionary to Africa. :When she first enters the story, she says that she does not know who made her: \"I s'pect I growed. Don't think nobody never made me.\" In the early-to-mid 1900s, some doll companies made dolls that looked like Topsy. The expression \"growed like Topsy\" (later \"grew like Topsy\") began to be used in the English language. At first it meant to describe growing without planning it. Later, it simply meant growing a lot.The Word Detective, issue of May 20, 2003, accessed February 16, 2007. *Simon Legree a slave-owner who cannot break Uncle Tom of his Christian faith. He has Uncle Tom whipped to death because of this. He sexually exploits his female slaves Cassy and Emmeline. His name is used as a synonym for a cruel and greedy man. == Important themes == === Slavery === Uncle Tom's Cabin's most important theme is the evil of slavery.Homelessness in American Literature: Romanticism, Realism, and Testimony by John Allen, Routledge, 2004, page 24, where it states in regards to Uncle Tom's Cabin that \"Stowe held specific beliefs about the 'evils' of slavery and the role of Americans in resisting it.\" The book then quotes Ann Douglas describing how Stowe saw slavery as a sin. Every part in Uncle Tom's Cabin develops the characters and the story. But most importantly, it always tries to show the reader that slavery is evil, un-Christian, and should not be allowed.Drawn With the Sword: Reflections on the American Civil War by James Munro McPherson, Oxford University Press, 1997, page 30. One way Stowe showed the evil of slavery was how it forced families from each other.Drawn With the Sword: Reflections on the American Civil War by James Munro McPherson, Oxford University Press, 1997, page 29. === Motherhood === Stowe thought mothers were the \"model for all of American life\".\"Stowe's Dream of the Mother-Savior: Uncle Tom's Cabin and American Women Writers Before the 1920s\" by Elizabeth Ammons, New Essays on Uncle Tom's Cabin, Eric J. Sundquist, editor, Cambridge University Press, 1986, page 159. She also believed that only women could saveWhitewashing Uncle Tom's Cabin: Nineteenth-Century Women Novelists Respond to Stowe by Joy Jordan-Lake, Vanderbilt University Press, 2005, page 61. the United States from slavery. Because of this, another very important theme of Uncle Tom's Cabin is the moral power and sanctity of women. White women like Mrs. Bird, St. Clare’s mother, Legree’s mother, and Mrs. Shelby try to make their husbands help their slaves. Eva, who is the \"ideal Christian\",Somatic Fictions: imagining illness in Victorian culture by Athena Vrettos, Stanford University Press, 1995, page 101. says that blacks and whites are the same. Black women like Eliza are brave and pious. She escapes from slavery to save her son, and by the end of the novel, has made her whole family come together again. Some critics said that Stowe's female characters are often unrealistic.The Stowe Debate: Rhetorical Strategies in Uncle Tom's Cabin by Mason I. (jr.) Lowance, Ellen E. Westbrook, C. De Prospo, R., Univ of Massachusetts Press, 1994, page 132. However, Stowe's novel made many people remember \"the importance of women's influence\" and helped the women's rights movement later.Historical Dictionary of Women's Education in the United States by Linda Eisenmann, Greenwood Press, 1998, page 3. === Christianity === Stowe's puritanical religious beliefs are also one of the biggest themes in the novel. She explores what Christianity is like. She believed that the most important thing in Christianity was love for everyone. She also believed that Christian theology shows that slavery is wrong.The Company of the Creative: A Christian Reader's Guide to Great Literature and Its Themes by David L. Larsen, Kregel Publications, 2000, pages 386–387. This theme can be seen when Tom urges St. Clare to \"look away to Jesus\" after St. Clare's daughter Eva dies. After Tom dies, George Shelby says, \"What a thing it is to be a Christian.\"The Company of the Creative: A Christian Reader's Guide to Great Literature and Its Themes by David L. Larsen, Kregel Publications, 2000, page 387. Because Christian themes are so important, and because Stowe often directly spoke in the novel about religion and faith, the novel is written in the \"form of a sermon.\"The Cambridge History of American Literature by Sacvan Bercovitch and Cyrus R. K. Patell, Cambridge University Press, 1994, page 119. == Style == Uncle Tom's Cabin is written in a sentimentalMarianne Noble, \"The Ecstasies of Sentimental Wounding In Uncle Tom's Cabin,\" from A Routledge Literary Sourcebook on Harriet Beecher Stowe's Uncle Tom's Cabin Edited by Debra J. Rosenthal, Routledge, 2003, page 58. and melodramatic style. This style was often used in the 19th century sentimental novel and domestic fiction (also called women's fiction). These genres were the most popular novels of Stowe's time. It usually had female characters and a style that made readers feel sympathy and emotion for them.\"Domestic or Sentimental Fiction, 1820–1865\" American Literature Sites, Washington State University. Retrieved April 26, 2007. Stowe's novel is different from other sentimental novels because she writes about a large theme like slavery. It is also different because she has a man (Uncle Tom) as the main character. However, she still tried to make her readers have strong feelings when they read Uncle Tom's Cabin, like making them cry when Eva died.\"Uncle Tom's Cabin,\" The Kansas Territorial Experience. Retrieved April 26, 2007. This kind of writing made readers react powerfully. For instance, Georgiana May, a friend of Stowe's, wrote a letter to the writer. In the letter, she said that \"I was up (awake) last night long after one o'clock, reading and finishing Uncle Tom's Cabin. I could not leave it any more than I could have left a dying child.\"Reading Women: Literary Figures and Cultural Icons from the Victorian Age to the Present by Janet Badia and Jennifer Phegley, University of Toronto Press, 2005, page 67. Another reader said that she thought about the book all the time and even thought about changing her daughter's name to Eva.Reading Women: Literary Figures and Cultural Icons from the Victorian Age to the Present by Janet Badia and Jennifer Phegley, University of Toronto Press, 2005, page 66. The death of Eva affected lots of people. In 1852, 300 baby girls in Boston were named Eva. Even though many readers were very moved, literary critics did not like the style in Uncle Tom's Cabin and other sentimental novels. They said these books were written by women and had \"women's sloppy (messy) emotions.\"A Routledge Literary Sourcebook on Harriet Beecher Stowe's Uncle Tom's Cabin by Debra J. Rosenthal, Routledge, 2003, page 42. One literary critic said that if the novel not been about slavery, \"it would be just another sentimental novel\".\"Review of The Building of Uncle Tom's Cabin by E. Bruce Kirkham\" by Thomas F. Gossett, American Literature, Vol. 50, No. 1 (March, 1978), pp. 123–124. Another said the book was a \"piece of hack (messy) work.\"\"The Origins of Uncle Tom's Cabin\" by Charles Nichols, The Phylon Quarterly, Vol. 19, No. 3 (3rd Qtr., 1958), page 328. In The Literary History of the United States, George F. Whicher called Uncle Tom's Cabin \"Sunday- school fiction\".\"Sentimental Power: Uncle Tom's Cabin and the Politics of Literary History\" by Jane Tompkins, from In Sensational Designs: The Cultural Work of American Fiction, 1790–1860. New York: Oxford UP, 1985. Pp. 122–146. However, in 1985 Jane Tompkins wrote differently about Uncle Tom's Cabin in her book In Sensational Designs: The Cultural Work of American Fiction. Tompkins praised Uncle Tom's Cabin's style. She said that sentimental novels showed how women's emotions changed the world in a good way. She also said that the popular domestic novels written in the 19th century, like Uncle Tom's Cabin, were intelligently written. She also said that Uncle Tom's Cabin shows a \"critique of American society far more devastating (powerful) than any ... by better-known critics such as Hawthorne and Melville.\" == Reactions to the novel == Uncle Tom's Cabin has had a very great influence. There are not many novels in history that changed society so powerfully. When it was published, Uncle Tom's Cabin, people who defended slavery were very angry and protested against it. Some people even wrote books against it. Abolitionists praised it very much. As a best-seller, the novel greatly influenced later protest literature. === Contemporary and world reaction === As soon as it was published, Uncle Tom's Cabin made people in the American South very angry.Slave narratives and Uncle Tom's Cabin, Africans in America, PBS, accessed February 16, 2007. The novel was also greatly criticized by people who supported slavery. A famous novelist from the South, William Gilmore Simms, said that the book was not true.\"Simms's Review of Uncle Tom's Cabin\" by Charles S. Watson, American Literature, Vol. 48, No. 3 (November, 1976), pp. 365–368 Others called the novel criminal and said it was full of lies.\"Over and above … There Broods a Portentous Shadow,—The Shadow of Law: Harriet Beecher Stowe's Critique of Slave Law in Uncle Tom's Cabin\" by Alfred L. Brophy, Journal of Law and Religion, Vol. 12, No. 2 (1995–1996), pp. 457–506. A person who sold books in Mobile, Alabama had to leave town for selling the novel. Stowe received threatening letters. She even received a package with a slave's cut ear once. Many Southern writers, like Simms, soon began writing their own books about slavery.\"Woodcraft: Simms's First Answer to Uncle Tom's Cabin\" by Joseph V. Ridgely, American Literature, Vol. 31, No. 4 (January, 1960), pp. 421–433. Some critics said that Stowe had never actually went to a Southern plantation and she did not know much about Southern life. They said that because of this, she made wrong descriptions about the South. However, Stowe always said she made the characters of her book by stories she was told by slaves that ran away to Cincinnati, Ohio, where she lived. It is reported: \"She observed firsthand (herself) several incidents (happenings) which ... [inspired] her to write [the] famous anti- slavery novel. Scenes she observed (saw) on the Ohio River, including seeing a husband and wife being sold apart, as well as newspaper and magazine accounts and interviews, contributed material to the ... plot.\"The Classic Text: Harriett Beecher Stowe. University of Wisconsin-Milwaukee Library. Special collection page on traditions and interpretations of Uncle Tom's Cabin. Retrieved May 15, 2007. In 1853, Stowe published A Key to Uncle Tom's Cabin. This was to show the people who had criticized the novel's description of slavery that it was true. In the book, Stowe writes about the important characters in Uncle Tom's Cabin and about people in real life who were like them. Through this book, she writes a more \"aggressive attack on slavery in the South than the novel itself had\". Like the novel, A Key to Uncle Tom's Cabin was also a best-seller. However, many of the works in A Key to Uncle Tom's Cabin was read by Stowe after she published her novel. Even though there were such criticisms, the novel was still very popular. Stowe's son says that when Abraham Lincoln met her in 1862 Lincoln said, \"So this is the little lady who started this great war.\" Historians are not sure if Lincoln really said this or not. In a letter that Stowe wrote to her husband a few hours after meeting with Lincoln, she does not say anything about this sentence.Uncle Tom's Cabin, introduction by Amanda Claybaugh, Barnes and Noble Classics, New York, 2003, page xvii. After this, many writers have said that this novel helped make the North angry at slavery and at the Fugitive Slave Law. It greatly helped the abolitionist movement. Union general and politician James Baird Weaver said that the book made him help in the abolitionist movement.\"Review of James Baird Weaver by Fred Emory Haynes\" by A. M. Arnett, Political Science Quarterly, Vol. 35, No. 1 (March, 1920), pp. 154–157; and profile of James Baird Weaver , accessed February 17, 2007. Uncle Tom's Cabin also interested many people in England. The first London edition came out in May 1852. It sold 200,000 copies. Some of this interest was because at that time the British people did not like the United States. A writer said, \"The evil passions which 'Uncle Tom' gratified in England were not hatred or vengeance [of slavery], but national jealousy and national vanity. We have long been smarting (hurting) under the conceit of America – we are tired of hearing her boast that she is the freest and the most enlightened country that the world has ever seen. Our clergy hate her voluntary system – our Tories hate her democrats – our Whigs hate her ... All parties hailed Mrs. Stowe as a revolter from the enemy.\"Nassau Senior, quoted in Ephraim Douglass Adams, Great Britain and the American Civil War (1958) p: 33. Charles Francis Adams, the American minister to Britain during the war, said later that, \"Uncle Tom's Cabin; or Life among the Lowly, published in 1852, influenced the world more quickly, powerfully, and dramatically than any other book ever printed.\"Charles Francis Adams, Trans-Atlantic Historical Solidarity: Lectures Delivered before the University of Oxford in Easter and Trinity Terms, 1913. 1913. p. 79 Uncle Tom’s Cabin was published in Russia at the end of 1857 and was soon recognized as a classic of world literature. Many people saw a very strong link between the world of Uncle Tom’s Cabin and the serfdom that still existed in Russia in 1850s. In his letter to an abolitionist Maria Weston Chapman, Nikolay Turgenev wrote, “Many of the scenes described in the book seem like an exact depiction of equally frightful scenes in Russia.” Uncle Tom's Cabin served as an educational tool for Russian and Russo-Soviet elite in the post emancipation period, and it also became part of Soviet children literature. The book has been translated into almost every language. For example, it was translated into Chinese. Its translator Lin Shu made this the first Chinese translation of an American novel. It was also translated into Amharic. Its 1930 translation was made to help Ethiopia end the suffering of blacks in that nation.Richard Pankhurst, Economic History of Ethiopia (Addis Ababa: Haile Selassie I University Press, 1968), p. 122. The book was read by so many people that Sigmund Freud believed that some of his patients had been influenced by reading about the whipping of slaves in Uncle Tom's Cabin.Ian Gibson, The English Vice: Beating, Sex and Shame in Victorian England and After (1978) ===Literary importance and criticism=== Uncle Tom's Cabin was the first widely read political novel in the United States.Tompkins, Jane. Sensational Designs: The Cultural Work of American Fiction, 1790–1860. New York: Oxford University Press, 1986. See chapter five, \"Sentimental Power: Uncle Tom's Cabin and the Politics of Literary History.\" It greatly influenced American literature and protest literature. Some later books that were greatly influenced by Uncle Tom's Cabin are The Jungle by Upton Sinclair and Silent Spring by Rachel Carson.The Cambridge Companion to Harriet Beecher Stowe by Cindy Weinstein, Cambridge University Press, 2004, page 13. However, even though Uncle Tom's Cabin was very important, many people thought the book was a mix of \"children's fable and propaganda\".\"Uncle Tom's Shadow\" by Darryl Lorenzo Wellington, The Nation, December 25, 2006. Many critics called the book \"merely (only) a sentimental novel\". George Whicher wrote in his Literary History of the United States that \"Nothing attributable to Mrs. Stowe or her handiwork can account for the novel's enormous (great) vogue (popularity); its author's resources ... of Sunday-school fiction were not remarkable ... melodrama, humor, and pathos … compounded (made up) her book.\" Other critics, though, have praised the novel. Edmund Wilson said that \"To expose oneself in maturity (when one has grown up) to Uncle Tom's Cabin may … prove a startling (surprising) experience.\" Jane Tompkins said that the novel is one of the classics of American literature. She suggested that literary critics think badly of the book because it was simply too popular when it came out. Through the years, people have wondered what Stowe was trying to say with the novel. Some of her themes can be seen easily, like the evil of slavery. However, some themes are harder to see. For example, Stowe was a Christian and active abolitionist, and put lots of her religious beliefs in her book.Smylie, James H. \"Uncle Tom's Cabin Revisited: the Bible, the Romantic Imagination, and the Sympathies of Christ.\" American Presbyterians 1995 73(3): 165–175. . Some have said that Stowe wrote in her novel what she thought was a solution to the problem that worried many people who did not like slavery. This problem was: was doing things that were not allowed justified if they did it to fight evil? Was it right to use violence to stop the violence of slavery? Was breaking laws that helped slavery right? Which of Stowe's characters should be followed: the patient Uncle Tom or the defiant George Harris?Bellin, Joshua D. \"Up to Heaven's Gate, down in Earth's Dust: the Politics of Judgment in Uncle Tom's Cabin\" American Literature 1993 65(2): 275–295. Fulltext online at Jstor and Ebsco. Stowe thought that God's will would be followed if each (every) person sincerely (truly) examined his principles and acted on (followed) them. People have also thought Uncle Tom's Cabin expressed the ideas of the Free Will Movement.Grant, David. \"Uncle Tom's Cabin and the Triumph of Republican Rhetoric.\" New England Quarterly 1998 71(3): 429–448. Fulltext online at Jstor. In this idea, the character of George Harris symbolizes the free labor. The complex character of Ophelia shows the Northerners who allowed slavery, even though they did not like it. Dinah is very different from Ophelia. She acts by passion. In the book, Ophelia changes. Like Ophelia, the Republican Party (three years later) declared that the North must change itself. It said that the North must stop slavery actively. Feminist theory can also be seen in Stowe's book. The novel can be seen as criticizing slavery's patriarchal nature.Riss, Arthur. \"Racial Essentialism and Family Values in Uncle Tom's Cabin.\" American Quarterly 1994 46(4): 513–544. Fulltext in JSTOR. For Stowe, families were related by blood, not by family-like relations between masters and slaves. Stowe also saw the nation as a bigger \"family\". So, the feelings of nationality came from sharing the same race. Because of this, she supported the idea that freed slaves should live together in a colony. The book has also been seen as trying to show that masculinity was important in stopping slavery.Wolff, Cynthia Griffin. \"Masculinity in Uncle Tom's Cabin,\" American Quarterly 1995 47(4): 595–618. . Fulltext online at JSTOR. Abolitionists began to change the way they thought of violent men. They wanted men to help stop slavery without hurting their self-image or their position in society. Because of this, some abolitionists followed some of the principles of women's suffrage, peace, and Christianity. They praised men for helping, working together, and having mercy. Other abolitionists were more traditional: they wanted men to act more forcefully. All the men in Stowe's book show either patient men or traditional men. == Creation and popularization of stereotypes == Recently, some people have begun criticizing the book for what they thought were racist descriptions of the book's black characters. They criticized the way Stowe wrote about the characters' looks, speech, behavior, and the passive nature of Uncle Tom.Smith; Jessie Carney; Images of Blacks in American Culture: A Reference Guide to Information Sources Greenwood Press. 1988. The book's use of common stereotypes about African Americans is important because Uncle Tom's Cabin was the best-selling novel in the world in the 19th century. Because of this, the book (together with images in the bookIllustrations , Uncle Tom's Cabin and American Culture, a Multi-Media Archive. Retrieved April 18, 2007. and related stage productions) helped make a great number of people accept such stereotypes. Among the African-American stereotypes in Uncle Tom's Cabin are: * The \"happy darky\" (in the lazy, carefree character of Sam); * The light-skinned tragic mulatto (in the characters of Eliza, Cassy, and Emmeline); * The loving, dark-skinned female mammy (through several characters, including Mammy, a cook at the St. Clare plantation). * The Pickaninny stereotype of black children (in the character of Topsy); * The Uncle Tom, or African American who wants to please white people too much (in the character of Uncle Tom). Stowe wanted Tom to be a \"noble hero\". The stereotype of him was because of \"Tom Shows,\" which Stowe could not stop. These stereotypes made many people think much more lightly of the historical importance of Uncle Tom's Cabin as a \"vital antislavery tool.\" This change in the way people looked at Uncle Tom's Cabin began in an essay by James Baldwin. This essay was titled \"Everybody’s Protest Novel.\" In the essay, Baldwin called Uncle Tom’s Cabin a \"very bad novel\".\"Digging Through the Literary Anthropology of Stowe’s Uncle Tom\", by Edward Rothstein, from the New York Times, October 23, 2006. He said it was not well-written. In the 1960s and '70s, the Black Power and Black Arts Movements strongly criticized the book. They said that the character of Uncle Tom was a part of \"race betrayal\". They said that Tom made slaves look worse than slave owners. Criticisms of the other stereotypes in the book also increased during this time. However, people such as Henry Louis Gates Jr. have begun studying Uncle Tom's Cabin again. He says that the book is a \"central document in American race relations and a significant (important) moral and political exploration of the character of those relations.\" == References == == Other websites == * * Uncle Tom's cabin: or Life among the lowly ; frontispiece by John Gilbert; ornamental title-page by Phiz; and 130 engravings on wood by Matthew Urlwin Sears, 1853 (a searchable facsimile at the University of Georgia Libraries; DjVu & layered PDF format) * Pictures and stories from Uncle Tom's cabin ; \"The purpose of the editor of this little work, has been to adapt it for the juvenile family circle. The verses have accordingly been written by the authoress for the capacity of the youngest readers …\" 1853 (a searchable facsimile at the University of Georgia Libraries; DjVu & layered PDF format) * * Uncle Tom's Cabin, available at Internet Archive. Scanned, illustrated original editions. * Uncle Tom's Cabin Historic Site * Free audiobook of Uncle Tom's Cabin at Librivox * More on the lack of international copyright Category:1850s books Category:19th-century American novels Category:Origins of the American Civil War Category:Books about slavery in America",
 "title": "Uncle Tom's Cabin"
}