{
 "id": "227702",
 "text": "Health care or healthcare is the preservation of mental and physical health by preventing or treating illnesses through services offered by the health profession and its staff. Health care includes all reasonable and necessary medical aid, medical examinations, medical treatments, medical diagnoses, medical evaluations and medical services. The right to health care is considered one of human rights with international human rights law as well as social security. == Primary care == A primary care doctor (PCD) or primary care physician (PCP) is a doctor who provides general medical care. These doctors can answer health concerns and medical conditions a patient may have. They also can prescribe medicine for their patients, based on information gathered. == Hospitals == In most countries most of the money goes on hospital services. == Mental health == Mental illness is in most places treated separately from physical illness. It was, and in some places still is, given a religious explanation. People were sent to workhouses or asylums if they were thought to be dangerous to themselves or other people. By the 19th century many of them were very large. There was very little involvement by doctors until the 20th century when psychiatry developed. The classification of mental disorders has been, and still is, controversial. Mental health services generally get less attention and money than those for physical illness. Abuse of patients is not uncommon. People are often sent a long way from home. People may have to wait a lot longer for help in the community. == Cost == The amount of money spend on health care goes from Madagascar which spend $19.85 per person per year to the United States where the government spends $10,921 per person. About the same is spent privately in the USA, much of it from health insurance. ==Related pages== * Universal health care * Doctor-patient relationship * Means test * Right to health == References ==",
 "title": "Healthcare"
}