{
 "id": "227793",
 "text": "A north American sparrow is a member of the genus Passer. They are small passerine birds which belong to the family Passeridae. They are also known as old-world sparrows. Sparrows often make their nests near houses or buildings. This means they are one of the easiest birds to see in the wild. The genus has about 30 species around the world. The best known of these is the house sparrow, Passer domesticus. Some authorities place other genera in the sparrow group: Petronia, the rock sparrows; Carpospiza, the pale rockfinch; and Montifringilla, the snowfinches.Clement, Peter & Colston P.R. 2003. Sparrows and snowfinches. in Perrins, Christopher. The Firefly Encyclopedia of Birds. Firefly Books, 590–591. . == Description == Sparrows are small birds. They are between 11–18 centimeters long. They can weigh between 13–42 grams. They are usually brown and grey. They have short tails and small, strong beaks. Most sparrows eat seeds or small insects. Sparrows are social birds and they live in flocks (groups). == The house sparrow == The house sparrow (Passer domesticus) is a species of sparrow. It lives all over the world. It originally lived only in Europe and Asia. However, people travelled to new places and the house sparrow went to those places too. It is now the bird with the widest distribution. This means it lives in the most places. The species has about 50 subspecies. === Distribution === Sparrows can be seen on every continent on earth. A long time ago, they lived only in Europe, Asia and Africa. However, people traveled to Australia, North America and South America, and now sparrows are seen there too. The house sparrow is seen in every continent. In Australia, there are no sparrows in Western Australia, as they have not been able to travel across the deserts that separate that state from the eastern states. The government employs people to hunt and destroy any sparrows that might arrive. ==== North America ==== The house sparrow was introduced to America in the late 19th century. It was introduced on purpose. It was imported by several people, including Eugene Schieffelin, who was a wealthy New York City admirer of Shakespeare. He wanted to introduce to America all the birds mentioned in the works of Shakespeare. Two of these species were great successes: starlings and house sparrows. He organized a society for the importation of foreign birds, incorporated in Albany.Tales of birding: the most hated bird in America == Other so-called 'sparrows' == Some ornithologists thought the Estrildid finches were in the same family as sparrows. However, they are now in a different family, the Estrildidae. There is also a group called 'American sparrows', or New World sparrows. These are also in a different family, the Emberizidae (buntings). The hedge sparrow (also known as the dunnock or accentor) Prunella modularis is also not a true sparrow. It is in a different family, the Prunellidae. It is only called a sparrow because people called all small brown birds 'sparrows'. Birdwatchers call then all LBJs (little brown jobs) because they are usually so difficult to tell apart. === Description === The house sparrow is small bird. It is between 14–18 centimeters (5.5–7.1 in) long. It weighs between 24–39.5 grams (0.85–1.4 oz). Females are smaller than males. Male and female house sparrows are different colors. The male is brown, gray and white. It has a black throat. The female and young house sparrows are brown and dark yellow or cream. They have streaks (stripes) on their heads and wings. === Habitat === The house sparrow lives close to humans, often near human houses in towns or cities. It also lives near farms and makes a nest in a bush or small tree. It can have two or three broods per year. This means it has two or three sets of eggs and chicks each year. Nest sites are varied, though cavities are preferred. Nests are most frequently built in the eaves and other crevices of houses. Holes in cliffs and banks, or tree hollows, are also used.Summers- Smith J. Denis 1963. The house sparrow. New Naturalist, London: Collins.p52–57 A sparrow sometimes digs out its own nests in sandy banks or rotten branches. More often it uses the nests of other birds, such swallows' nests in banks and cliffs, and old tree nest holes. It often uses deserted nests. Sometimes it takes over active nests by driving away or killing the occupants. Tree hollows are more commonly used in North America than in Europe. This puts the sparrows in competition with bluebirds and other North American cavity nesters so the native bird population declines. ==== Conservation ==== The number of house sparrows in the United Kingdom has gone down, perhaps because their hedgerow habitat has shrunk.Also the general \"cleaning-up\" of the environment by councils is unintentionally hostile to wildlife. They are now 'endangered' in the United Kingdom. However, in other countries, the bird is still very common. Hedges are necessary to the bird because predators cannot usually get at their nests. They would have no defence against magpies (for example) if face-to-face. == Sparrows in Mao's China == Sparrows eat some grain. So Mao decided that sparrows should be eliminated in China. The result was a disastrous famine, with grain yields a fraction of what went before. Apparently no-one knew enough about sparrows. They are major predators of locusts. With few sparrows, locusts thrived and ate much of the wheat. It is difficult in an autocracy to tell leaders they are wrong. * In Sichuan Province, even though the collected grain was decreasing from 1958 to 1961, the numbers reported to the central government kept increasing. * In Gansu, the grain yield declined by 4,273,000 tonnes from 1957 to 1961. The gap between the expected quantity and the real quantity of grain led to widespread starvation in Mao's China. == References == Category:Passeri",
 "title": "Sparrow"
}