{
 "id": "227918",
 "text": "Every year, the Kennedy Center gives its Kennedy Center Honors to artists. These artists have contributed to American culture. Most of these artists were performers, such as actors, dancers, and musicians. Some of these artists were movie directors, play writers, and songwriters. Most of the recipients have been American. The President of the United States usually attends the awards ceremony. The Honors are given in Washington, D.C. at the Kennedy Center Opera House. From 1978 until 2002, the ceremony was hosted by Walter Cronkite.Keller, Julie.\"Kennedy Honors Feel Good\" E! Online.com, August 5, 2003 Since 2003, it has been hosted by Caroline Kennedy. ==Recipients== ===1970s=== *1978 – Marian Anderson, Fred Astaire, George Balanchine, Richard Rodgers and Arthur Rubinstein *1979 – Aaron Copland, Ella Fitzgerald, Henry Fonda, Martha Graham and Tennessee Williams ===1980s=== *1980 – Leonard Bernstein, James Cagney, Agnes de Mille, Lynn Fontanne, and Leontyne Price *1981 – Count Basie, Cary Grant, Helen Hayes, Jerome Robbins, and Rudolf Serkin *1982 – George Abbott, Lillian Gish, Benny Goodman, Gene Kelly, and Eugene Ormandy *1983 – Katherine Dunham, Elia Kazan, Frank Sinatra, James Stewart, and Virgil Thomson *1984 – Lena Horne, Danny Kaye, Gian Carlo Menotti, Arthur Miller, and Isaac Stern *1985 – Merce Cunningham, Irene Dunne, Bob Hope, Alan Jay Lerner & Frederick Loewe, and Beverly Sills *1986 – Lucille Ball, Hume Cronyn & Jessica Tandy, Yehudi Menuhin, Antony Tudor, and Ray Charles *1987 – Perry Como, Bette Davis, Sammy Davis, Jr., Nathan Milstein, and Alwin Nikolais *1988 – Alvin Ailey, George Burns, Myrna Loy, Alexander Schneider, and Roger L. Stevens *1989 – Harry Belafonte, Claudette Colbert, Alexandra Danilova, Mary Martin, and William Schuman ===1990s=== *1990 – Dizzy Gillespie, Katharine Hepburn, Risë Stevens, Jule Styne, and Billy Wilder *1991 – Roy Acuff, Betty Comden & Adolph Green, Fayard & Harold Nicholas, Gregory Peck, and Robert Shaw *1992 – Lionel Hampton, Paul Newman & Joanne Woodward, Ginger Rogers, Mstislav Rostropovich, and Paul Taylor *1993 – Johnny Carson, Arthur Mitchell, Georg Solti, Stephen Sondheim, and Marion Williams *1994 – Kirk Douglas, Aretha Franklin, Morton Gould, Harold Prince, and Pete Seeger *1995 – Jacques d'Amboise, Marilyn Horne, B.B. King, Sidney Poitier, and Neil Simon *1996 – Edward Albee, Benny Carter, Johnny Cash, Jack Lemmon, and Maria Tallchief *1997 – Lauren Bacall, Bob Dylan, Charlton Heston, Jessye Norman, and Edward Villella *1998 – Bill Cosby, Fred Ebb & John Kander, Willie Nelson, André Previn, and Shirley Temple Black *1999 – Victor Borge, Sean Connery, Judith Jamison, Jason Robards, and Stevie Wonder ===2000s=== *2000 – Mikhail Baryshnikov, Chuck Berry, Plácido Domingo, Clint Eastwood, and Angela Lansbury *2001 – Julie Andrews, Van Cliburn, Quincy Jones, Jack Nicholson, and Luciano Pavarotti *2002 – James Earl Jones, James Levine, Chita Rivera, Paul Simon, and Elizabeth Taylor *2003 – James Brown, Carol Burnett, Loretta Lynn, Mike Nichols, and Itzhak Perlman *2004 – Warren Beatty, Ossie Davis & Ruby Dee, Elton John, Joan Sutherland, and John Williams *2005 – Tony Bennett, Suzanne Farrell, Julie Harris, Robert Redford, and Tina Turner *2006 – Zubin Mehta, Dolly Parton, Smokey Robinson, Steven Spielberg, and Andrew Lloyd Webber *2007 – Leon Fleisher, Steve Martin, Diana Ross, Martin Scorsese, and Brian Wilson *2008 – Morgan Freeman, George Jones, Barbra Streisand, Twyla Tharp, and Pete Townshend & Roger Daltrey *2009 – Mel Brooks, Dave Brubeck, Grace Bumbry, Robert De Niro, and Bruce Springsteen ===2010s=== *2010 -- Merle Haggard, Jerry Herman, Bill T. Jones, Paul McCartney and Oprah Winfrey *2011 -- Barbara Cook, Neil Diamond, Yo-Yo Ma, Sonny Rollins and Meryl Streep\"Barbara Cook, Neil Diamond, Yo-Yo Ma, Sonny Rollins & Meryl Streep to Receive 34th Annual Kennedy Center Honors\" kennedy-center.org, accessed September 6, 2011 *2012 -- Buddy Guy, Dustin Hoffman, Led Zeppelin (John Paul Jones, Jimmy Page and Robert Plant), David Letterman and Natalia MakarovaGans, Andrew. \"Dustin Hoffman, David Letterman, Natalia Makarova, Buddy Guy, Led Zeppelin Are Kennedy Center Honorees\" playbill.com, September 12, 2012 *2013 -- Martina Arroyo, Herbie Hancock, Billy Joel, Shirley MacLaine and Carlos SantanaGans, Andrew. \"Martina Arroyo, Herbie Hancock, Billy Joel, Shirley MacLaine and Carlos Santana Are 2013 Kennedy Center Honorees\" playbill.com, September 12, 2013 *2014 -- Al Green, Tom Hanks, Patricia McBride, Sting and Lily Tomlin * 2015 – Carole King, George Lucas, Rita Moreno, Seiji Ozawa, and Cicely Tyson * 2016 – Martha Argerich, Eagles (Don Henley, Glenn Frey, Timothy B. Schmit, Joe Walsh), Al Pacino, Mavis Staples, and James Taylor * 2017 – Carmen de Lavallade, Gloria Estefan, LL Cool J, Norman Lear, and Lionel Richie * 2018 – Cher, Philip Glass, Reba McEntire, Wayne Shorter, and the creators of Hamilton: An American Musical (Lin-Manuel Miranda, Thomas Kail, Alex Lacamoire, and Andy Blankenbuehler) * 2019 – Earth, Wind & Fire (Philip Bailey, Verdine White, Ralph Johnson and Maurice White), Sally Field, Linda Ronstadt, Sesame Street (Lloyd Morrisett and Joan Ganz Cooney), and Michael Tilson Thomas ===2020s=== * 2020 – Cancelled due to the COVID-19 pandemic * 2021 – Debbie Allen, Joan Baez, Garth Brooks, Midori, and Dick Van Dyke ==Related pages== *Mark Twain Prize for American Humor, the Kennedy Center's award for contributions to American humor ==Sources== Category:Entertainment awards Category:Kennedy Center honorees",
 "title": "Kennedy Center Honors"
}