{
 "id": "228077",
 "text": "Sir David John White OBE (born 2 February 1940), known professionally as by his stage name David Jason, is an English actor, comedian, screenwriter and television producer. He is best known for his roles as Del Boy in the BBC and GOLD comedy series sitcom Only Fools and Horses and Detective Insepctor Jack Frost in A Touch Of Frost, Granville in Open All Hours and Still Open All Hours, and Pop Larkin in The Darling Buds of May, as well as voicing Mr. Toad in The Wind in the Williows and the title character of DangerMouse and Count Duckula; His last original was Del Boy was in 2014 and Frost in 2010. Jason was made an Officer of the Order of the British Empire (OBE) in 1993, and knighted in 2005, both for services to drama. He won the British Comedy Awards Lifetime Achievement Award in 2001, and the BAFTA Academy Fellowship Award in 2003. Jason lived with his long term girlfriend, actress Myfanwy Talog, for eighteen years until her death from breast cancer in 1995. At age 61, Jason and 41-year-old girlfriend Gill Hinchcliffe had a baby girl in 2001. They married in 2005. ==Career== ===Radio=== Year Title Role Other notes \\- Mostly Monkhouse Various 1970–1998 Week Ending Various 1977–1981 The Jason Explanation Various \\- The Hitchhiker's Guide to the Galaxy Captain of the 'B' Ark/Caveman 2008 Book at Bedtime Reader A 10 part abridged reading of A Christmas Carol for BBC Radio 4's Book at Bedtime. ===Television=== Year Title Role Other notes 1964 Crossroads Bert Bradshaw Unknown character duration. 1966 Softly, Softly Smith Episode ‘Overtake’ 1967–1969 Do Not Adjust Your Set Various A children's sketch show; popular with adults. 1968 Randall and Hopkirk (Deceased) Abel Episode ‘That’s How Murder Snowballs’ 1969 Counterstrike Taffy Sadler Episode ‘On Ice’ 1969 Canada Goose Unknown 1969–1970 Hark at Barker Various 1970 Doctor in the House Mr Drobnic Episode ‘What Seems to be the Trouble?’ 1970 Two D's and a Dog Dingle Bell 1971 Six Dates With Barker Odd Job Man Episode 3 – ‘The Odd Job’; Starred with Ronnie Barker 1971 Doctor at Large Victor Bligh Episode ‘Let’s Start at the Beginning’ 1972 His Lordship Entertains Dithers Starred with Ronnie Barker 1973 Seven of One Various Episodes 1 (Open All Hours) and 2 (I'll Fly You For A Quid) 1974 Doctor at Sea Manuel Sanchez 1974 The Top Secret Life of Edgar Briggs Edgar Briggs 1975; 1977 Porridge Blanco Webb Guest starred in three episodes; Happy Release, No Peace for the Wicked and Pardon Me. Starred with Ronnie Barker. 1976 Lucky Feller Shorty Mopstead 1976–1985 Open All Hours Granville Broadcast: 1976; 1981–1985. Starred with Ronnie Barker. 1977–1981 A Sharp Intake of Breath Peter Barnes 1981–2003 Only Fools and Horses Del Boy Broadcast: 1981–1983,1985–1993,1996,2001–2003 1985–1987 The Berenstain Bears Papa Bear 1987 Porterhouse Blue Skullion 1989 A Bit of a Do Ted 1990 Amongst Barbarians George 1991–1993 The Darling Buds of May Pop Larkin 1992–2010 A Touch of Frost DI Jack Frost 1993 The Bullion Boys Billy Mac 1997 The Ice House Unknown 1998 March In Windy City Steven March 1999 All the King's Men Captain Frank Beck A 1999 television film. 2001 Micawber Micawber 2002–2004 The Quest Dave A three-part film series. 2005–2007 Diamond Geezer Des Pilot in 2005; Series in 2007. 2006 Ghostboast Lt. Prof. Jack Hardy R.N. Rtd Two part ITV drama. 2006 Terry Pratchett's Hogfather Alberto Malich Two part Sky1 drama. 2006 Cartoon Kings Narrator Documentary. 2006 Prehistoric Park Narrator Documentary-style drama. 2008 Terry Pratchett's The Colour of Magic Rincewind Two part Sky1 drama. 2009 The Green Green Grass Del Boy Archive footage: Episode 'I Done It My Way' 2010 David Jason:The Battle of Britain Presenter ITV documentary 2010 Albert’s Memorial Harry ITV1 feature-length drama. 2010 Come Rain Come Shine Don ITV1 feature-length drama, starring alongside Alison Steadman 2011 David Jason's Great Escapes Himself Documentary 2011-2012 The Royal Bodyguard Captain Guy Hubble BBC Comedy. First episode broadcast Boxing Day 2011 on BBC One. ===Movies=== Year Title Role Other notes 1972 Under Milk Wood Nogood Boyo Originally offered to Jason's brother, Arthur, however Jason was cast in the role. 1973 White Cargo Albert Toddey 1975 Royal Flash The Mayor 1977 Wombling Free Womble Voice 1978 The Odd Job Odd Job Man 1983 The Wind in the Willows Toad Spawned a 52-part series. 2010 All the Way Up Director ===Animation=== Year Title Role Other notes 1978 The Water Babies Principal Characters 1981–1992 Danger Mouse Danger Mouse/Narrator/Buggles Pigeon/Count Duckula/Numerous others 1983–1990 The Wind in the Willows Toad/Chief Weasel/Billy Rabbit 1988–1993 Count Duckula Count Duckula/Numerous Others Spin-off from hit series Danger Mouse starring David Jason as the lead voice. 1989 The BFG The BFG Film based on Roald Dahl's novel 1991–1992 Victor and Hugo Hugo/Interpol 1993 The Adventures of Dawdle the Donkey Rola Polar 1994 Felidae Jesaja (English dub) 1995 The Snow Queen Eric 1998 Father Christmas and the Missing Reindeer Father Christmas 1999 Angelmouse Narrator 22 parts. 2010 Muddle Earth Randalf 26 parts. ==Awards and nominations== David Jason has a total of twenty-three awards between 1986 and 2003. His hit comedy show, Only Fools and Horses won many of these awards, and was also nominated many times. His crime drama, A Touch of Frost, has also won and been nominated many times. Porterhouse Blue, The Second Quest, All the King's Men and A Bit of a Do have won David Jason one award each. Year Group Award Film/Show Result 1985 BAFTA TV Award Best Light Entertainment Performance Only Fools and Horses 1986 BAFTA TV Award Best Light Entertainment Performance Only Fools and Horses 1987 BAFTA TV Award Best Actor Porterhouse Blue 1988 BAFTA TV Award Best Light Entertainment Performance Only Fools and Horses 1989 BAFTA TV Award Best Light Entertainment Performance Only Fools and Horses 1990 British Comedy Award Best TV Comedy Actor A Bit of a Do 1990 BAFTA TV Award Best Light Entertainment Performance Only Fools and Horses 1992 British Comedy Award Best TV Comedy Actor The Darling Buds of May 1996 National Television Award Most Popular Comedy Performer Only Fools and Horses 1996 National Television Award Special Recognition Award N/a 1996 BAFTA TV Award Best Comedy Performance Only Fools and Horses 1997 British Comedy Award Best TV Comedy Actor Only Fools and Horses 1997 National Television Award Most Popular Actor Only Fools and Horses 1999 National Television Award Most Popular Actor A Touch of Frost 2000 National Television Award Most Popular Actor A Touch of Frost 2000 TV Quick Award Best Actor A Touch of Frost All the King's Men 2001 British Comedy Award Lifetime Achievement Award N/a 2001 TV Quick Award Best Actor A Touch of Frost 2001 National Television Award Most Popular Actor A Touch of Frost 2001 National Television Award Most Popular Comedy Performer Only Fools and Horses 2002 National Television Award Most Popular Actor A Touch of Frost 2002 National Television Award Most Popular Comedy Performance Only Fools and Horses 2002 TV Quick Award Best Actor A Touch of Frost 2003 National Television Award Most Popular Actor A Touch of Frost 2003 BAFTA TV Award BAFTA Academy Fellowship N/a 2003 National Television Award Most Popular Actor The Second Quest A Touch of Frost 2011 National Television Award Outstanding Drama Performance A Touch of Frost ==References== ==Other websites== * Category:1940 births Category:Living people Category:Actors from London Category:BAFTA Award winners Category:English movie actors Category:English television actors Category:English voice actors",
 "title": "David Jason"
}