{
 "id": "228173",
 "text": "Sindhi food refers to the food of the Sindhi people who live in Pakistan and India. The daily food in most Sindhi households consists of wheat-based flat- bread (Mani/Roti/Phulka) and rice accompanied by two dishes, one gravy and one dry. == Snacks == *Kutti: Mashed Ofrato (Paratha Bread) with sugar and butter. *Lolo or Mitho Lolo: Sweeter version of koki - also made if you get chicken pox. *Ku-ini Kich-anee: Sindhi comfort food. A porridge like dish made with rice and served with yogurt. *Chhola Dhabal: baked bread with chick peas in thick gravy. *Ka-raw-o: religious offering made with flour, ghee and sugar. *Bhat: - porridge, usually given to a sick child, but popular at all times. *Sindhi Curry: - chick pea flour and vegetables like lady finger, potato and eggplant. == Meals == *Seyal Mani (Cooked Chappati in green sauce with tomato, coriander and spices). *Seyal Dab-roti (variation of above, but instead of Chappati, use bread) *Beehan ji Bhaji: Curry made of beeh (lotus root). *Koki or Loli (a thick chappati with ghee, onion and coriander). *Loli Du-dh (as above, but served with yogurt. Some Sindhis will eat Loli with pickles, but many Sindhis do not consider it good form to mix yogurt and pickles). This is a popular dish served at breakfast or brunch. *Pappad (a crisp and thin snack. Sindhi will generally eat this after a meal to digest food and in particular after an oily meal). *Dhodo Chutney (A thick roti with garlic paste and served with mint chutney) *Sai Bhaji (a spinach based gravy, sai means green - the colour of spinach) *Bugha Chawar (a browned rice) *Bhugal Bheeha (lotus root in thick curry) *Dhangi Fulko (moong beans with roti) *Curry Chawal (a tomato curry eaten with white rice - served with aloo took, a potato cutlet) *Besan ji Bhaji (vegetable made of gram flour) *Bhugal Teewarn (a mutton dish) *Jera & Bhukiyoo (Fried liver, Kidney of goat) *Dal Tikkhar (daal yellow pulses) cooked in gravy eaten with crisp fried very thin matthi *Bhugge Chawal (rice cooked in flavoured spices beige/ golden brown in colour with vegetable assortments) *Pava (goats legs) *Pakkwan Dal (lentil and solid crunchy puri) *Curry Chawal (It's Kathi Curry eaten with Rice) *Fote waro Tivan (Lamb meat in cardamom) *Keemo (ground lamb meet) *Seyal Pallo (pomfret fish in garlic sauce) *Mejalo/Maggaz: is goat/cow brain fried. *Arri Pakhi curry: == Desserts or Sweets & Drinks == *Thadal: is a cooling and energizing drink, used by the pehlwan (wrestlers), prepared using ground char magaz, dry fruits, pepper and almonds. *Busri: a special Sindhi sweet bread made of two breads, filled with powder of jaggery called musti/mithai sometimes with sugar, and a chunk of desi ghee or Makhan (butter) on top, eaten mostly in winters, also offered to bride and bridegroom on wedding day. *Ugham Halwo: is a traditional halwa made in Dadu district, made with almonds, pistachios, cashew nuts and important (ugham seeds) are used in desi ghee, it is very healthy and best in winters. *Mao: is is sweet dish made out of milk and sugar, milk is cooked until it becomes thick paste, then it is served with dry fruits and nuts. Mehar city is famous for making Sindhi mao. *Tairee bhat: the sweet rice made in jaggery with kishmish (Raisins ) and coconut. *Varo: Indian sweet made with pistachio, almonds or other nuts. *Moomthal: Indian sweet. *Khi-r-ni: a pudding of rice crushed into paste made with milk and dry fruits, flavours of cardamom and saffron. *Chulho: is a sweet bread of rice flour or wheat with sugar sprinkled on top, with desi ghee or makhan. *Sherbert: a sweet drink *Mal-pooro *Borinda: round ball like sweet snack made of sugar syrup/honey/jaggery and sesame seeds. *Lai: same as like borindas but flat and Lais are made of different dry fruits, sesame seeds etc. *Bhangg: for have fun and relaxtion , specially drunk on Holi, Eid or marriages. == Pickles == *Carrot pickle *Mango pickle *Mix fruit pickle *Green chilli pickle *Murbo (sweet grated mango in sugar syrup) == Food for Special Occasions == There are food that are served during special occasions, such as during Diwali a Baji with seven vegetables is made. If someone gets chicken pox and after it is gone, it is common to make an offering and make 'mitho lolo'. Saeyun: vermicelli is served on both Eids. On special religious occasions, mitho lolo, accompanied with milk is given to the poor. Khorak: a healthy snack made for bride and bridegroom before marriage, it is made of dry fruits and desi ghee, it is given to bride and bridegroom for seven days. == References == Category:Indian food Category:Pakistani food",
 "title": "Sindhi cuisine"
}