{
 "id": "228215",
 "text": "The Mycenaean culture (around 1600–1100 BC) was an early Greek culture during the Bronze Age on the Greek mainland and on Crete. The name Achaean was used by Homer to describe them and occurs in the Iliad. The term that is used is derived from Mycenae, which is an important archaeological site about 90 km from Athens. Other important Mycenaean sites are at Athens, Thebes, Tiryns and Pylos. The epic poems of Homer, the Iliad and the Odyssey, are Mycenaean in origin. The earlier Minoans traded but did not conquer. The Mycenaeans traded and conquered.Castleden, Rodney 2005. The Mycenaeans. Routledge, London. == Language == Mycenaean is the oldest-known form of Greek. It was spoken on the Greek mainland and on Crete in the Mycenaean period, from the 16th century to the 12th century BC. The language is written on clay tablets in a script called Linear B. Most of the tablets were found in Knossos, in central Crete, and in Pylos, in the southwest of the Peloponnese. Other tablets have been found at Mycenae itself; Tiryns and Thebes; and at Chania, on western Crete. For a long time, no one could translate the tablets. At last, Michael Ventris deciphered the script in 1952 and showed that the language was an early form of Greek.Chadwick, John 1958. The decipherment of Linear B. 2nd ed 1990. Cambridge University Press. Ventris, Michael and Chadwick, John 1973. Documents in Mycenaean Greek. 2nd ed, Cambridge University Press. The texts on the tablets are mostly lists and inventories. There are no stories, myths, or poetry, but they give some idea of the people who made them. By the late 13th century BC, mainland Greece witnessed a wave of destruction. The Mycenaean sites declined, and the people moved to refuge settlements. That is called the Greek Dark Ages since little or no writing is found until the 8th century BC. See Ancient Greece for that and the later periods. === Comparison with Hittite === Both Old Hittite and Mycenaean Greek are Indo-European languages. The oldest Hittite texts are slightly earlier than the earliest Mycenaean texts, but Greek is the oldest Indo-European language that is still spoken. ==Identity== The somewhat younger Linear B tablets suggest that the people called Mycenaeans might have been Achaeans. No written source found at a Mycenaean site reveals what they called themselves. In the Iliad, the residents of the Peloponnesus and nearby islands are often called Achaeans. There is mention of the Ahhiyawa in Hittite sources from the Late Bronze Age,Güterbock, Hans G. 1983. The Hittites and the Aegean world: Part 1. The Ahhiyawa problem reconsidered. American Journal of Archaeology 87, 133–138Mellink, Machteld J. 1983. The Hittites and the Aegean world: Part 2. Archaeological comments on Ahhiyawa-Achaians in Western Anatolia. American Journal of Archaeology 87, 138–141 which suggests itself that the Mycenaeans could possibly be Achaeans.Huxley G.L. 1960. Achaeans and Greeks. The Tawagalawa Letter,Translation of the Tawagalawa Letter written by an unnamed Hittite king (14th–13th century BC) to the king of Ahhiyawa, treats him as an equal. The letter suggests that Miletus (Millawanda) was under his control and refers to an earlier 'Wilusa' episode\" involving hostility by Ahhiyawa. Ahhiya(wa) has been identified with the Achaeans of the Trojan War and the city of Wilusa with the legendary city of Troy. However the exact relationship of the term Ahhiyawa to the Achaeans had been hotly debated by scholars even after the discovery that Mycenaean Linear B is an early form of Greek.Güterbock, Hans G. 1984. Hittites and Akhaeans: a new look. Proceedings of the American Philosophical Society 128, 114–122 The written forms of the two languages are quite different. == References == Category:Ancient Greek culture",
 "title": "Mycenaean culture"
}