{
 "id": "228206",
 "text": "A fire engine is a vehicle that is used to help put out the fires. It is also called a fire truck. Fire engines are also used for other emergency calls. These can include hazardous materials spills, technical rescue incidents and emergency medical service incidents. What types of calls it is used depends on the area and local setup. A fire engine takes firefighters from a fire station to a fire or other incident. Fire engines use flashing lights, loud sirens and horns to warn people that they are coming down the road and to get out of the way. These devices have been used for many years to warn people when they are coming down the road. Fire engines also use communication equipment to contact their dispatcher or other emergency services vehicles. A fire engine has many tools and equipment for fighting fires. Almost all fire engines have hoses, a pump, a water tank and breathing equipment. Some fire engines also have special tools and equipment. These might include electrical generators, specialized rescue tools such as the jaws of life, equipment for hazardous materials spills and first aid kits or medical equipment along with other tools and equipment. == History == In the middle ages, the only way to fight a fire was with buckets of water. In the 16th century, hand-powered pumps were invented. In the 19th century, the design of these pumps was improved. With them, horses could be used to take them to the location of a fire. Later, steam power was used to both run the pumps and move them to the fires. The first modern fire engine was invented in 1905 by Knox Automobile in Springfield, Massachusetts. == Types == There are several types of specialized fire service vehicles. They include: *Ladder truck: a ladder truck is found in large municipal fire departments. There are several types of ladder truck designations. They include tower ladders, aerial ladders, and hook and ladder. The number of people on a ladder company varies. Ladder trucks use ladders that are placed in the rear or middle of the truck. *Water tender: A water tender is a vehicle which carries large amounts of water. *Heavy rescue trucks: heavy rescue trucks use special rescue tools and equipment that a normal fire engine does not have. These vehicles are used for automobile accidents and building collapses. The equipment often found on these vehicle include the Jaws of Life hydraulic rescue systems, special rescue saws, air bags, electric and battery-powered tools and generators. *Hazardous materials trucks: hazardous materials trucks use special tools and equipment to deal with many kinds of hazardous materials accidents. These include chemical, biological, radiological, nuclear and high yield explosives. Other things they respond to are CBRNE incidents, train accidents and other incidents. These vehicles have special protective gear and use other types of fire extinguishing equipment based on the incident such as foam. *Airport crash tender: an airport crash tender uses a vehicle that has special tools and equipment that deal with emergencies at large airports. *Rescue ambulances or medic units: ambulances use vehicles for emergency medical services incidents. They provide services of either a paramedic or an emergency medical technician ===Other vehicles=== Other vehicles that are used by fire departments but may not be directly involved in firefighting may include * Fire car * Fire investigation unit * Fire police unit * Hazardous materials apparatus * Light and air unit * Marine rescue unit * Mobile communications vehicle * Operational support unit File:Japanese Kei car Fire apparatus.jpg|A Mitsubishi Town Box kei car fire truck used by the Chichibu, Saitama fire department File:Seattle Fire Department - Battalion 6 command vehicle.jpg|Chevrolet Suburban command vehicles used by the Seattle Fire Department File:ACTFB HAZMAT-heo.jpg|A Scania hazardous materials vehicle used by ACT Fire and Rescue File:GLOUCESTERSHIRE FIRE AND RESCUE SERVICE. - Flickr - secret coach park.jpg|A Dennis Dart command post used by the Gloucestershire Fire and Rescue Service File:Hemer-Löschpanzer1-Bubo.JPG|A Marder infantry fighting vehicle converted for use as a firefighting vehicle by the German Fire Services ==Gallery== File:Humberside Fire & Rescue DH03P4 - YT21 EHF.jpg|A Scania P280 fire engine used by the Humberside Fire and Rescue Service in Kingston upon Hull, Yorkshire, England File:Fire Engine 33 (6225707251).jpg|An E-One engine used by the Boston Fire Department File:Brandbil, Huddinge, 20220902.jpg|A Scania engine used by the Södertörn fire service File:Ural Next-based fire engine in Tomsk 01.jpg|An Ural engine used by the Russian State Fire Service File:20230306 HOWO T5G 340 fire engine in Kaifeng.jpg|A Howo engine used by the Henan Fire Rescue Corps File:Iveco Eurocargo - Magirus turntable ladder - front view.jpg|An Iveco turntable ladder used by the Romanian General Inspectorate for Emergency Situations File:LAFD Truck 3 with tiller.jpg|An American LaFrance tiller truck used by the Los Angeles Fire Department File:Roskilde S1.jpg|An articulating platform truck used by the Roskilde fire brigade File:Engine33ANF01.jpg|An International wildland fire engine used by the United States Forest Service File:JMSDF Water tender(Isuzu Forward, 41-8056) right front view at Kanoya Air Base April 30, 2017.jpg|An Isuzu water tender used by the Japan Maritime Self- Defense Force File:Whitehorse International Airport ARFF Striker.jpg|An Oshkosh airport crash tender used by the Erik Nielsen Whitehorse International Airport fire department File:Edinburgh fire engine, 1824.JPG|Manually drawn fire pump in service in Edinburgh in 1824 File:Brockhampton Estate - horse- drawn fire pump.jpg|Horse-drawn fire pump given to Brockhampton Estate in 1818 File:Antique Japanese Fire pump.jpg|Antique Japanese fire pump File:Fire truck and firemen, NSW Brigade headquarters 1941.jpg|A fire engine in Sydney, Australia in 1941 == References== == Other websites == * Category:Firefighting",
 "title": "Fire engine"
}