{
 "id": "228493",
 "text": "deadmau5 pronounced \"dead mouse\", (real name: Joel Zimmerman) (born January 5, 1981 in Niagara Falls, Ontario) is a Grammy-nominated and Juno winning Canadian electro and progressive house producer, DJ, and performer. He has released 8 albums and made a cameo on the TV show Gossip Girl. Furthermore he has made tracks like \"Arguru\" and \"Not Exactly\", which have been featured on many compilation CD's and on Armin van Buuren's A State Of Trance radio show. deadmau5 has worked together with DJs like: Kaskade, MC Flipside, Rob Swire of Pendulum and Knife Party, and Steve Duda under the BSOD alias. ==Personal life== The name deadmau5 started when Zimmerman found a dead mouse in his computer, while he was replacing his video card. He talked with people in chat rooms, and people started connecting him with this story. In the end, Zimmerman called himself deadmau5, as a shorter version of \"dead mouse\".Deadmau5 Discography at Discogs In an interview with Irish Daily Star, he mentioned that he didn't like being referred to as a DJ. He was quoted as saying: ::\"It puts me to fucking sleep, to be quite honest; I don't really see the technical merit in playing two songs at the same speed together and it bores me to fucking tears and hopefully, with all due respect to the DJ type that will fucking go the way of the dinosaur, I'd like them to dis-a-fucking-ppear! It's so middle man, they're like fucking lawyers! You need them, but they're fucking cunts. God bless them, they're my number one customer right, so I'm not gonna go diss every fucking DJ. But to say you become this massive, \"up on a podium\" performer by playing other peoples productions, at the same speed as someone else's productions and fading between the two of them, I don't get it...\" He later said that he was sorry for his comment and said that the interview was bad, and it did not express his opinion about DJs correctly: ::\"Let me start by admitting … I did not grow up in the EDM scene. I don't consider my career to be about \"being a DJ\". I don't have \"DJ roots\". I never had any intention of becoming a DJ, and my conception of \"DJ's\" in general from this standpoint has always been being forced into some nightclub when I would have rather stayed home, and watch some dude mash the \"play/stop\" button and occasionally move a pitch slider. Love it or hate it … that's just been my conception of the traditional \"DJ\". Mind you, I'm not a total fucking idiot, and I recognize talent when I see it … and there are many talented DJ's out there for sure. In my eyes, those would be the individuals who utilize technology to deliver the music in ways that are both skillful and innovate, more-so than my vision of the \"play/stop/pitch\" DJ. To me, the club is about \"the party\"; the people make the night; the DJ obviously needs to use that to his advantage, it's give and take.\" deadmau5 previously dated American model Lindsey Evans but they broke up in September 2011. He then dated tattoo artist Kat Von D in and they broke up in November 2012 however deadmau5 proposed to her on Twitter and she accepted. In June 2013, Von D announced that had ended their engagement. On July 30, 2010 deadmau5 collapsed on stage 50 minutes into his set and doctors said he was suffering from exhaustion and vomiting. Deadmau5 was forced to cancel his next nine shows for recovery. ==Discography== ===Studio albums=== *Get Scraped (2005) *Vexillology (2006) *Random Album Title (2008) *For Lack of a Better Name (2009) *4×4=12 (2010) *Album Title Goes Here (2012) *While(1<2) (2014) *W:/2016Album/ (2016) *Kx5 (with Kaskade) (2023) ===Compilation albums=== *deadmau5 Circa 1998–2002 (2006) (as Halcyon441) *A Little Oblique (2006) *Project 56 (2008) *At Play (2008) *It Sounds Like (2009) *At Play Vol. 2 (2009) *At Play Vol. 3 (2010) *Meowingtons Hax Tour Trax (2011) *At Play Vol. 4 (2012) ==Awards== *He was ranked #6 on DJ Magazine's annual Top 100 DJ Poll. ===Grammy Awards=== |- |2009 |\"\"The Longest Road\" (deadmau5 Remix) by Morgan Page featuring Lissie\" |Best Remixed Recording, Non-Classical | |- |2012 |\"Raise Your Weapon\" ft. Greta Svabo Bech\" |Best Dance Recording | |- |2012 |4x4=12 |Best Dance/Electronica Album | |- |2012 |\"Rope\" - Foo Fighters (deadmau5 Mix) |Best Remixed Recording, Non-Classical | |} ===Juno Awards=== |- |2008 |\"After Hours\" (with Melleefresh) |Dance Recording of the Year | |- |2008 |\"All You Ever Want\" (with Billy Newton-Davies) |Dance Recording of the Year | |- |2009 |Random Album Title |Dance Recording of the Year | |- |2009 |\"Move for Me\" (with Kaskade) |Dance Recording of the Year | |- |2010 |For Lack of a Better Name |Dance Recording of the Year | |} ==References== ==Other websites== *Official website * *Artist Site at Ultra Records Category:1981 births Category:Living people Category:Canadian electronic musicians Category:DJs Category:Musicians from Ontario Category:People from Niagara Falls, Ontario",
 "title": "Deadmau5"
}