{
 "id": "228596",
 "text": "This is the timeline of World War II, which shows the event linked to World War II during 1931-1945. == Before the war == * 1931- September 18: Japan invades the Manchuria region of China, starting Second Sino-Japanese War. * 1933- ** January 30: Nazi leader Adolf Hitler is appointed Chancellor of Germany. ** February 27: The Reichstag is set on fire. ** March 23: The Reichstag passes Enabling Act, giving Hitler dictatorship power. ** June 28: Only Nazi Party remains in Germany. * 1934- ** January 26: German–Soviet Molotov-Ribbentrop pact. ** August 2: Hitler becomes German head of state. * 1935- ** January 7: The League of Nations allows Germany to add Saarland to its territory. ** March 16: Hitler orders military buildup in Germany ** April: France, Britain, and Italy form the \"Stresa Front\", set up to defend Austrian independence, and will not allow Germany to change the Treaty of Versailles. ** June 18: The Anglo-German Naval Agreement is signed by Germany and the United Kingdom to allow a larger Kriegsmarine (German Navy). ** October 2: Italy invades Ethiopia, beginning the Second Italo–Abyssinian War. * 1936- ** May 7: Italy add Ethiopia to its territory. ** July 18: Spanish Civil War begins. ** October 25: Rome-Berlin Axis is formed. * 1937- Marco Polo Bridge Incident. Second Sino-Japanese War. * 1938- September 30: The Munich agreement is signed. * 1939- ** March 15: Germany invades Czechoslovakia. The country is divided and added to many countries. ** April 1: The Spanish Civil War ends with the nationalist victory. Francisco Franco becomes the head of state. ** May 22: The Pact of Steel between Germany and Italy is signed. ** August 23: The Molotov-Ribbentrop Pact between Germany and the Soviet Union is signed. == Wartime == === 1939 === * September 1: The Germany invades Poland, starting World War II in Europe (European War). * September 3: Britain and France warns Germany to move all soldiers out of Poland or there will be war. Germany does not respond. Britain and France declare war on Germany. * September 17: The Soviet Union invades Poland from the east. * October 5-10: Baltic states sign \"assistance pacts\" with the Soviet Union, allowing it to have soldiers in these countries. * October 6: The Polish fight comes to an end. * October 20: The \"Phoney War\" begins. * November 24: Japan announces the capture of Nanjing, the Chinese capital at the time. * November 30: The Soviet Union invades Finland in the Winter War (it wasn’t part of WWII). === 1940 === * 9 April: Germany invades Denmark and Norway. Denmark surrenders that same day. *May 10: Germany invades Belgium, France, Luxembourg and the Netherlands. Winston Churchill becomes Prime Minister of the United Kingdom. * May 25: The Allies falls back to Dunkirk. Hitler orders to stop attacking the Allies troops by land. * May 26: The Allies starts moving their soldiers from Dunkirk. By June 4, more than 300,000 Allies troops are transported to Britain. * June 2: Norway surrenders. * June 10: Italy declares war on Britain and France. * June 18: The Soviet Union occupies the Baltic states. * June 25: France formally surrenders. * July 10: The Battle of Britain begins. * September 9: The Italian army in Libya invades Egypt. * September 27: The Tripartite Pact is signed in Berlin by Germany, Italy, and Japan. * October 15: Italy invades Greece. * December 6-9: The Italians are pushed back in Egypt. === 1941 === *16. January: British forces launch a counter-attack on Italy-controlled Ethiopia. * 12 February: Erwin Rommel arrives to lead the German Army in Africa * February:Japan wins the Battle of Singapore assuring control of Southeast Asia * April 6: Germany invades Yugoslavia and Greece. * April 27: Greece surrenders. * May 20: German troops [in Crete] were to remain. * June 22: Germany invades the Soviet Union in Operation Barbarossa. There are also many European axes. German soldiers are sent to Finland. * September 8: The siege of Leningrad begins. * September 19: Arrest [Kiev]. * September 30: Battle of Moscow begins. * October 16: [Capture of Odessa] * November 27: The Siege of Tobruk is broken. * December 5: German invasion of Moscow begins. * December 7: World War II in the Pacific === 1942 === * April 18: The Doolittle Raid is launched, bombing Tokyo from the United States * June 4: Americans defeat Japan at Midway Island. * August 23: The Battle of Stalingrad begins. === 1943 === * February 2: German forces surrender at Stalingrad. * April 19 to May 16: Warsaw Ghetto Uprising. *July 5 to August 23: Battle of Kursk. *August 23: Belgorod and Kharkiv are liberated. * September 3: The allies land in southern Italy. * September 8: Italy surrenders. * November 6: Kiev is liberated. * November 28 to December 1: Tehran conference. === 1944 === * January 24 to February 16: Battle of Korsun–Cherkassy. * January 27: 900-days lasted Siege of Leningrad is broken. * April 10: Odessa is liberated. * May 9: Sevastopol is liberated. All Crimea is without German and Romanian troops. * June 6: American, British and Canadian soldiers invade Normandy. * July 27: Lviv is liberated. * August 25: Paris, France is Liberated. * October 15: Riga is liberated. * December 16: German forces attack Americans in Belgium, beginning the Battle of the Bulge. * United States enters Germany === 1945 === * January 27: Auschwitz camp of death is destroyed. * April 30: Hitler commits suicide. * May 7: Germany surrenders. * May 9: Prague is liberated. * May 9: The Great Patriotic War of the Soviet Union is finished. * May 15: National Liberation War in Yugoslavia is finished. * August 6: The First Atomic Bomb is dropped on Hiroshima. * August 9: The Second Atomic Bomb is dropped on Nagasaki. * September 2: Japan surrenders, ending the war. == Notes == Category:World War II",
 "title": "Timeline of World War II"
}