{
 "id": "228665",
 "text": "Harriet Beecher Stowe (June 14, 1811 – July 1, 1896) was an American abolitionist and writer. Her novel Uncle Tom's Cabin (1852) showed the lives of African-Americans slaves. It was very popular as a novel and a play, and had a great influence in the United States and Britain, helping people who did not like slavery and making many people disagree with slavery. ==Biography== Stowe was born Harriet Elisabeth Beecher in Litchfield, Connecticut, on June 14, 1811.McFarland, Philip. Loves of Harriet Beecher Stowe. New York: Grove Press, 2007: 112. Her parents were religious leaders Lyman Beecher (a leader of the Second Great Awakening) and Roxana (Foote) Beecher. Her mother died when Harriet was five years old. She had a sister, Catharine Beecher, who was an educator and author, and three brothers Henry Ward Beecher, Charles Beecher, and Edward Beecher. Harriet went to the girls' school run by her sister Catharine. She received an education in the classics, including study of languages and mathematics. At 21, she moved to Cincinnati, Ohio to join her father. He had become the president of Lane Theological Seminary. She also joined the literary salon and social club called the Semi-Colon Club.Tonkovic, Nicole. Domesticity with a difference: The Nonfiction of Catharine Beecher, Sarah J. Hale, Fanny Fern, and Margaret Fuller. University Press of Mississippi, 1997: 12. Harriet married Calvin Ellis Stowe on January 6, 1836. He was a widower and professor at the seminary.McFarland, Philip. Loves of Harriet Beecher Stowe. New York: Grove Press, 2007: 21. They had seven children together, including twin daughters. Calvin Stowe was a critic of slavery. The Stowes supported the Underground Railroad. They briefly sheltered several fugitive slaves in their home. ==Uncle Tom's Cabin and the American Civil War== In 1850, the Stowe family moved to a house near the campus of Bowdoin College in Brunswick, Maine. Calvin Stowe was teaching in the college. On March 9, 1850, Stowe wrote to the editor of the antislavery journal National Era. She told him that she was planning to write a story about slavery.Hedrick, Joan D. Harriet Beecher Stowe: A Life. New York: Oxford University Press, 1995: 208. In June 1851, the first installment of her book, Uncle Tom's Cabin, was published in the National Era. She originally used the subtitle \"The Man That Was A Thing\". It was changed to \"Life Among the Lowly\". Installments were published every week from June 5, 1851, to April 1, 1852. For the newspaper serialization (published in parts) of her novel, Stowe was paid only $400. Uncle Tom's Cabin was published in book form on March 20, 1852, by John P. Jewett with an initial print run of 5,000 copies.McFarland, Philip. Loves of Harriet Beecher Stowe. New York: Grove Press, 2007: 80–81. Each of its two volumes included three illustrations and a title-page designed by Hammatt Billings.Parfait, Claire. The Publishing History of Uncle Tom's Cabin, 1852–2002. Ashgate Publishing, Ltd., 2007: 71–72. In less than a year, the book sold an unprecedented 300,000 copies.Morgan, Jo-Ann. Uncle Tom's Cabin As Visual Culture. University of Missouri Press, 2007: 136–137. By December 1851, sales began dropping off. A cheap edition was published to stimulate more sales.Parfait, Claire. The Publishing History of Uncle Tom's Cabin, 1852–2002. Ashgate Publishing, Ltd., 2007: 78. Americans were captivated by the book. It provoked more debate about abolition and slavery. Southerns hated the book. Within a year of the book's publication, 300 babies were named \"Eva\" in Boston alone.Morgan, Jo-Ann. Uncle Tom's Cabin As Visual Culture. University of Missouri Press, 2007: 137. ===Lincoln and Stowe=== After the start of the American Civil War, Stowe went to Washington, D.C. She met President Abraham Lincoln on November 25, 1862.McFarland, Philip. Loves of Harriet Beecher Stowe. New York: Grove Press, 2007: 163. Stowe's daughter Hattie reported, \"It was a very droll time that we had at the White House I assure you ... I will only say now that it was all very funny—and we were ready to explode with laughter all the while.\"Hedrick, Joan D. Harriet Beecher Stowe: A Life (1995) p 306 Lincoln greeted Stowe by saying, \"So this is the little lady who made this big war.\" Harriet's own accounts are vague, including a letter reporting the meeting to her husband: \"I had a real funny interview with the President.\" ==Death== Harriet Beecher Stowe died on 1 July 1896 in Hartford, Connecticut. She is buried in the cemetery at Phillips Academy in Andover, Massachusetts. == References == == Other websites == * Harriet Beecher Stowe’s Uncle Tom’s Cabin: an Electronic Edition of the National Era Version – Edited by textual scholar Wesley Raabe, this is the first edition of the novel to be based on the original text published in the National Era * Uncle Tom's Cabin and American Culture – A multimedia archive edited by Stephen Railton about the Stowe's novel's place in American history and society * Harriet Beecher Stowe House & Center – Stowe's adulthood home in Hartford, Connecticut * Meet Harriet Beecher Stowe, renowned author of Uncle Tom’s Cabin – A live performance showcasing the life and times of this historical woman. * Harriet Beecher Stowe Society – Scholarly organization dedicated to the study of the life and works of Harriet Beecher Stowe * Brief biography at Kirjasto (Pegasos) * The Online Books Page (University of Pennsylvania) * ** * Harriet Beecher Stowe's brief biography and works * History's Women: Harriet Beecher Stowe * Uncle Tom's Cabin , online text with audio. (PDF ) * \"Uncle Tom's Cabin: the book that ignited a nation\" *Top-rated online version Black Freighter Productions' free online version of Stowe's \"Queer Little Folks\" (entire text, professional layout, PDF.) *\"How To Live on Christ\" a pamphlet by Harriet Beecher Stowe, taken from her Introduction to Chistopher Dean's \"Religion As It Should Be or The Remarkable Experience and Triumphant Death of Ann Thane Peck\" published in 1847 Hudson Taylor sent a pamphlet using the words of this preface out to all the missionaries of the China Inland Mission in 1869. *Barron's BookNotes for Uncle Tom's Cabin - The Author and Her Times Category:1811 births Category:1896 deaths Category:19th- century American novelists Category:19th-century writers from Connecticut Category:American abolitionists Category:Educators from Hartford, Connecticut Category:Writers from Hartford, Connecticut",
 "title": "Harriet Beecher Stowe"
}