{
 "id": "228609",
 "text": "The Xiongnu () were a group of nomads who lived north of China from the 3rd century BC to the 460s AD. Their lands were infertile, so they often attacked China. To stop these attacks, the first emperor of China, Qin Shi Huang, built the Great Wall of China between 214 and 206 BC. Some Han dynasty emperors tried to make peace with them, but the Xiongnu continued to attack Chinese borders. Some people believe that the Xiongnu were related to the Huns, and this idea is still widely accepted today. In the past, different nomadic tribes often lived together, even if they spoke different languages. Around 60 BC, a power struggle led to the Xiongnu breaking up into five smaller groups. In 202 AD, the leader of the Southern Xiongnu surrendered to Cao Cao, the Prime Minister of the Han dynasty. The Han dynasty sent unrelated women falsely labeled as princesses and members of the Han imperial family when they were practicing Heqin marriage alliances with the Xiongnu. The Xiongnu practiced marriage alliances with Han dynasty officers and officials. The older sister of the Chanyu (the Xiongnu ruler) was married to the Xiongnu General Zhao Xin, the Marquis of Xi who was serving the Han dynasty. The daughter of the Qiedihou Chanyu was married to the Han Chinese General Li Ling after he surrendered and defected., p. 31. The Yenisei Kirghiz Khagans claimed descent from Li Ling. Another Han Chinese General who defected to the Xiongnu was Li Guangli who also married a daughter of the Chanyu. The Han Chinese diplomat Su Wu married a Xiongnu woman given by Li Ling when he was arrested and taken captive. Han Chinese explorer Zhang Qian married a Xiongnu woman and had a child with her when he was taken captive by the Xiongnu. Han Emperor Wu dispatched the Han Chinese explorer Zhang Qian to explore the mysterious kingdoms to the west and to form an alliance with the Yuezhi people in order to combat the Xiongnu. During this time Zhang married a Xiongnu wife, who bore him a son, and gained the trust of the Xiongnu leader. The Kyrgyz khagans claimed descent from the Chinese general Li Ling, grandson of the famous Han dynasty general Li Guang. Li Ling was captured by the Xiongnu and defected in the first century BCE. And since the Tang royal Li family also claimed descent from Li Guang, the Kirghiz Khagan was therefore recognized as a member of the Tang Imperial family. This relationship soothed the relationship when Kyrgyz khagan Are (阿熱) invaded Uyghur Khaganate and put Qasar Qaghan to the sword. The news brought to Chang'an by Kyrgyz ambassador Zhuwu Hesu (註吾合素). ==References== Category:History of China Category:Nomadic people Category:3rd- century BC establishments Category:5th-century disestablishments Category:Ethnic groups in China Category:1st-century disestablishments",
 "title": "Xiongnu"
}