{
 "id": "229037",
 "text": "Cyberbullying is the misuse of electronic information and mass media, such as e-mail, SMS, weblogs, cellphones and defamatory websites, to harass or attack a person or a group. It can cause emotional damage. Cyberbullying” was first used in 1998. Cyberbullying can include sending threats and unwanted sexual messages. It is repeated behaviour, aimed at scaring, angering or shaming those who are targeted. Examples include: spreading lies about or posting embarrassing photos of someone on social media, sending hurtful messages or threats via messaging platforms, impersonating someone and sending mean messages to others on their behalf. Cyberbullying can happen anywhere such as on games and dating apps not just on Instagram or TikTok. Face-to-face bullying and cyberbullying can often happen alongside each other. But cyberbullying leaves a digital footprint – a record that can prove useful and provide evidence to help stop the abuse. The prevalence of cyberbullying is shocking, especially for youth: Over 59% of teenagers in the US have experienced cyberbullying, and globally 33% of parents report having or knowing a child within their community who had been cyberbullied. Cyberbullying is not only limited to children and teenagers however. 41% of adults in the US report having personally experienced online harassment, with 66% reporting that they have seen this negative behavior directed at others. Teenage girls are more likely to experience cyberbullying (49%) compared to teenage boys (43%). More than 50% of teens feel angry after being cyberbullied while 33% felt hurt and nearly 15% felt scared. There have been moments of celebrities being harassed online often end up on the news. Some schools have started programs to teach students about cyberbullying and how to deal with it. == Effects of Cyberbullying == Victims may experience the following effects after being cyberbullied: * Suicide: cyberbullying can have many effects and one of them can be suicide. Most victims can suffer from cyberbullying and may even have the urge to commit suicide * Physical harm: cyberbullying can lead to the victims self harming from all the hateful words getting to them. Victims may develop the need to harm themselves after being cyberbullied. * Decreased Self-Esteem: Bullying of all kinds is often detrimental to the victim’s self-esteem. Victims may believe that all of their peers dislike them and develop issues with trust and confidence. * Emotional Distress: Cyberbullying can lead to a shift in mood or emotion in the victim. The constant stress of the attacks can make victims prone to outbursts of frustration, sadness, or anger as they try to cope with the bullying. * Depression: Cyberbullying can cause victims to develop depression. The constant stress and lowered self-esteem can cause them to feel hopeless, unloved, and sad. ==Legal status== In 2006, a 13 year old girl in Missouri killed herself after receiving mean messages on MySpace from a woman pretending to be a teenage boy. The state of Missouri then made using technology like the Internet or text messages to harass someone illegal. In New Hampshire, a law was passed in 2010 that said that schools must have rules against cyberbullying. On October 12, 2012, a Canadian girl named Amanda Todd killed herself. A few years before this happened, she showed her breasts on a video chat, and a man later messaged her saying that if Todd did not show more parts of her body then he would post the pictures he had taken of her from the video chat to the Internet. She faced a lot of bullying on the internet afterwards. It is clear that both adults and children all over the world can be affected by cyberbullying, which sometimes lead to disturbing consequences. ==Related pages== * Internet troll * Bullying * Cybercrime ==References== ==Other websites== * \"Tips to Help the Bullying Bystander\" at education.com Category:Types of crime Category:Bullying",
 "title": "Cyberbullying"
}