{
 "id": "22914",
 "text": "Czechoslovakia, or Czecho-Slovakia, was a country in Europe. It split off from Austria-Hungary in 1918 and split apart in 1993. In mid-1938 Nazi Germany took over Czechoslovakia and split off Slovakia. Sudetenland was annexed by Germany, other parts of Czechia became its protectorate named Bohemia and Moravia. After World War II the USSR liberated these lands and kept Zakarpattia because of the Ukrainian (Rusyn) majority in that region. By 1948 pro-Soviet communists got the power finally and declared the Czechoslovak Socialist Republic. It was a member of Warsaw Treaty Organization and COMECON , one of the richest countries of the Eastern Bloc. In the Prague Spring of the late 1960s, Czechoslovak leader Alexander Dubcek pursued his own policy of a ‘socialism with a human face’. In 1968 Warsaw Pact troops invaded Czechoslovakia to restore the old system. In 1989 Czechoslovakia peacefully changed its political system in the Velvet Revolution. On 1 January 1993, Czechoslovakia split into the Czech Republic and Slovakia. The countries separated in peace. ==Official names== *1918–1920: Republic of Czechoslovakia (abbreviated RČS)/Czecho-Slovak State, or Czecho-Slovakia/Czechoslovakia *1920–1938: Czechoslovak Republic (ČSR), or Czechoslovakia *1938–1939: Czecho- Slovak Republic, or Czecho-Slovakia *1945–1960: Czechoslovak Republic (ČSR), or Czechoslovakia *1960–1990: Czechoslovak Socialist Republic (ČSSR), or Czechoslovakia *April 1990: Czechoslovak Federative Republic (Czech version) and Czecho-Slovak Federative Republic (Slovak version) **The country subsequently became the Czech and Slovak Federative Republic, ČSFR, or Československo (Czech version) and Česko-Slovensko (Slovak version). File: Czechoslovakia01.png File:Czechoslovakia.png ==Notes== == References == Category:1918 establishments in Europe Category:1993 disestablishments in Europe Category:States and territories established in the 20th century Category:States and territories disestablished in the 1990s",
 "title": "Czechoslovakia"
}