{
 "id": "229217",
 "text": "Rise Against is an American melodic hardcore band from Chicago, Illinois. Rise Against formed in 1999. Their current members are Tim McIlrath (vocals, guitar), Joe Principe (bass guitar), Brandon Barnes (drums), and Zach Blair (guitar). ==Overview== All of the members are straight edge (except Barnes), and the band supports the People for the Ethical Treatment of Animals (PETA). They are also vegans. The band is currently signed to Geffen. Geffen is a record label owned by Universal Music Group. As of 2009, Rise Against has had six studio albums, two EPs, and one DVD. Rise Against spent its first five years signed to the record label \"Fat Wreck Chords,\" on which it released two studio albums. The band got reviewer popularity with its first two releases on Geffen, Siren Song of the Counter Culture (2004) and The Sufferer & the Witness (2006). These two albums made many high-charting singles, like Swing Life Away, Prayer of the Refugee, and The Good Left Undone. Their newest studio album, Appeal to Reason (2008), was released in North America on 7 October. It got to number three on the U.S Billboard 200 and made the three singles, Re-Education (Through Labor), Audience of One, and Savior. ==History== ===Early years (1999–2003)=== Rise Against was first made with the name \"Transistor Revolt\" in 1999 by former members of the bands 88 Fingers Louie and Baxter. The first group was Tim McIlrath (vocals), Joe Principe (bass and vocals), Toni Tintari (drums), and Mr. Precision (guitar and vocals). The band never performed live with this group. Instead, it released a self-made demo or EP. It was called Transistor Revolt. They made it in the year 2000, a year before signing with Fat Wreck Chords. Tintari left shortly after making Transistor Revolt, and was replaced by Brandon Barnes. Barnes was first from Screeching Weasel and Squirtgun's drummer. The band changed its name to Rise Against in 2001 and made its first album, The Unraveling (made by veteran punk maker Mass Giorgini) on Fat Wreck Chords that same year. Mr. Precision then left the band in 2001. He was replaced by Todd Mohney. Mohney joined before the band began writing their second full-length album, Revolutions per Minute. After touring in support of The Unraveling, the band came back to the studio in December 2002 to work on their second full-length album. The album would be called Revolutions per Minute (made by Bill Stevenson and Jason Livermore at The Blasting Room). It was released in 2003. The band toured a lot in support of its first two albums. They also performed in helping roles for \"Sick of It All,\" \"NOFX,\" \"Agnostic Front,\" \"No Use for a Name,\" \"AFI,\" and \"Strung Out.\" Rise Against also helped out in the 2003 \"Warped Tour.\" ===Siren Song of the Counter Culture (2004–2005)=== Rise Against signed onto DreamWorks Records in December 2003 and made their third album, Siren Song of the Counter Culture in 2004. DreamWorks was soon absorbed by the Universal Music Group, and Rise Against found itself with Geffen Records instead. Shortly after the band signed with Geffen, Mohney left and was replaced by guitarist Chris Chasse. Rise Against released Siren Song of the Counter Culture in August 2004. The album was their first to be the band's album on a famous record label, and was their first to reach the Billboard 200 chart. It also was awarded gold by the Recording Industry Association of America (RIAA). The album got mostly good reviews from reviewers. In giving the album three out of five stars, Johnny Loftus from Allmusic said that Siren Song of the Counter Culture sometimes \"gets carried away with its own music urgency.\" However, he goes on to say that because of the album being the band's first famous-label release, \"maybe the fuller sound and sometimes forays into acoustic guitars and cello overdubs...are OK.\" Rise Against toured North America, Europe, Australia, and Japan in support of Siren Song of the Counter Culture. Some of the best performances are those on the first worldwide \"Taste of Chaos\" tour in 2005 (with Funeral for a Friend, Story of the Year, The Used, and Killswitch Engage), a worldwide tour to the United Kingdom, Germany, Australia, and Japan, the Give It a Name tour in the United Kingdom, the Reading Festival and Leeds Festival in the United Kingdom a United States tour with Alkaline Trio, and the Warped Tour in North America. ===The Sufferer & the Witness (2006–2007)=== In January 2006, after touring in support of Siren Song of the Counter Culture, Rise Against started to work on their fourth studio album at the Blasting Room studio in Fort Collins, Colorado. With makers Bill Stevenson and Jason Livermore. The Sufferer & the Witness was released on 4 July 2006. The album got to number 10 on the U.S. Billboard 200 chart, selling 48,397 copies in its first week of release. It was then awarded gold by the RIAA in 2008. The Age newspaper said that with The Sufferer & the Witness, the band \"returns to their punk roots.\" Plus, the album got mostly good reviews by reviewers. Corey Apar of Allmusic, in giving the album four out of five stars, said of it, She goes on to say, Then, Christine Leonard of Fast Forward Weekly says of the band, A DVD called Generation Lost was released on 5 December 2006 to help the band and their new album. It is a movie of the careers of the band members, as well as live performance videos and making-of shorts. Rise Against toured in support of The Sufferer & the Witness through the second half of 2006 and all of 2007. The band was a big band in the 2006 Warped Tour. In late 2006, the band said that they would tour with Thursday. The bands Circa Survive and Billy Talent would also come too. In early 2007, the band had My Chemical Romance open for them on the first half of their big tour. On 23 February 2007, Rise Against said guitarist Chris Chasse, would leave. Chasse was then replaced by longtime friend Zach Blair from Only Crime. On 15 June 2007, the band started their first big tour in support of The Sufferer & the Witness. It was a North American tour that lasted throughout the summer months. During this tour, on 3 July 2007, Rise Against recorded an EP in Canada titled This Is Noise, which was then released in the United States on 15 January 2008. ===Appeal to Reason (2008-present)=== Before the album was released, Rise Against supported it by performing at the sixteenth yearly KROQ Weenie Roast on 17 May in Irvine, California. They also performed at the sixth yearly Download Festival on 13 June at Donington Park, England. They played at Switzerland's Greenfield Festival as well as Germany's Hurricane Festival and Southside Festival. Like many past years, the band participated in the Vans Warped Tour, although they only performed on the tour's west coast swing from 6 August to 17 August. Rise Against's fifth studio album Appeal to Reason was released on 4 October in Australia. It was then released 6 October across Europe. Then 7 October in the United States. The album sold 64,700 copies in its first week. It also got to number three on the U.S. Billboard 200. This made it Rise Against's highest scoring album. Appeal to Reason also got mostly good reviews. However, reviewers did not rate it as good as The Sufferer & the Witness. Most people thought this because Rise Against is moving toward slower music and away from faster hardcore punk. Giving the album a C+ review, Marc Weingarten of Entertainment Weekly says the album is filled with \"protest anthems that lean closer to the burnished angst of such bands as New Found Glory and Fall Out Boy than the genuine outrage of brainy Green Day\" and songs that are \"peppy but pretty empty, power-chord downers with little bark or bite.\" Kyle Anderson from Rolling Stone says that the songs on Appeal to Reason \"are driven by an ever-sharpening pop sensibility\". He finishes by saying, \"Rise Against may be about leaving the underground behind, but with sharp songs like these, they're ready for the rest of the world\". Rise Against then went on a North American tour with other bands such as Rancid, Billy Talent, Killswitch Engage, and Riverboat Gamblers in June and July 2009. They also did a short tour in the United Kingdom in November. The bands Thursday and Poison the Well helped Rise Against do that tour. The band also played at KROQ's Almost Acoustic Christmas in December 2009, playing right before AFI. The band will release a record with Face to Face, but no date has been said.\"Face to Face / Rise Against Split\". Noise Press. Retrieved on 21 April 2009 After finishing a Europen tour from October to November 2009 and an Australian tour in January and February 2010, Rise Against will start working on a new album. ==Music style and inspiration== Rise Against is often described as melodic hardcore. * * * * The band has named many punk and hardcore bands as inspiration to its music. In 2004, drummer Brandon Barnes said: The band's songs focus on melody, catchy hooks, aggressive movements, and fast-paced tempo. * * * Guitarists McIlrath and Blair focus on speed riffing and multi-layered choruses. Bassist Principe uses aggressive picking to lock in with the snare and kick of the drums. Frummer Barnes follows the guitars. He says: In 2006, Tim McIlrath described the band's style: Other bands that have inspired Rise Against are Descendents, Dead Kennedys, Refused, and Bad Religion. During the early part of their career, Rise Against's music had a gritty combination of hardcore punk and melodic hardcore. The Unraveling had a raw punk sound, while Revolutions per Minute had an overall darker tone. ==Politics and ethics== All of the group's members are vegetarians. All of them are also supporters of PETA, an animal rights organization. Their video for the song \"Ready to Fall\" has video of factory farming, rodeos, and sport hunting. It also has videos of deforestation, melting ice caps, and forest fires. The group said that that video was the most important video they have ever made. In February 2012, the band released a cover of the Bob Dylan song Ballad of Hollis Brown. This was part of a benefit for Amnesty International. The Director's Cut of the video was first shown on a PETA website. In 2009, the band was voted Best Animal- Friendly Band by PETA. All the members of Rise Against (except Brandon Barnes) are straight edge; that is, they do not drink alcohol, and they do not use drugs. the band has voiced their support for Democratic and libertarian causes. During the 2004 United States presidential election, the band was part of Punkvoter, a political activist group. They appeared on the Rock Against Bush, Vol. 1 compilation. The Rock Against Bush project raised over $1 million for John Kerry. John Kerry was the Democratic presidential candidate at that time. During the 2008 presidential election, the band members supported Barack Obama. In a news bulletin in early 2009, the band said: \"Few things are more exciting than watching Bush finally release America as his eight year hostage.\" ===Vans shoes=== On 23 May 2007, Rise Against said they have an endorsement of a new line of Vans shoes. They said that the shoes would be \"completely vegan in consideration to [their] animal rights efforts\". Because people criticized them due to rumors that Vans' use sweatshops, Rise Against said on their MySpace profile and website, ==Albums== * The Unraveling (2001) * Revolutions per Minute (2003) * Siren Song of the Counter Culture (2004) * The Sufferer & the Witness (2006) * Appeal to Reason (2008) * End Game (2011) * The Black Market (2014) * Wolves (2017) ==Awards== Year Single Award Result 2009 Re-Education (Through Labor) MuchMusic Video Award Nominated ==References== Category:American punk bands Category:Musical groups from Chicago Category:1990s establishments in Illinois Category:1999 establishments in the United States",
 "title": "Rise Against"
}