{
 "id": "229390",
 "text": "{{Infobox writer |name = Henry Fielding |image = Henry Fielding.png |pseudonym = \"Captain Hercules Vinegar\", \"H. Scriblerus Secundus\"; some work published anonymously |birth_date = |birth_place = Sharpham, Somerset, England |death_date = |death_place = Lisbon, Kingdom of Portugal |occupation = novelist, dramatist and essayist |nationality = English |relatives = Sarah Fielding, John Fielding |period = 1728–1754 |genre = comedy, satire, picaresque |movement = Enlightenment, Augustan Age |education = Eton College }} Henry Fielding (22 April 1707 – 8 October 1754) was an English writer and magistrate. He was born in Sharpham, Somerset, attended Eton College then later the University of Leiden in Holland. He left Leiden in debt and eventually drifted to London to work in the theatre, and was a prolific playwright, becoming one of London's most popular writers until 1737 when his career was ended by The Licensing Act, which required all plays to be performed only in patent theatres and to be approved by the Lord Chamberlain. Fielding's sharp satire was one of several reasons the First Minister Wapole pushed through The Act. Fielding then turned to the law and trained to be a barrister. During this time he continued writing and editing. During his later writing career he produced three novels and is considered, along with Samuel Richardson, a founder of the modern novel. Tom Jones and Joseph Andrews were written in a picaresque style. Amelia, his last novel, was more sombre. He as well published in1743 a work of extended political irony, The Life and Death of the Late Jonathan Wild, the Great - a political satire. In 1749 he was made justice of the peace and magistrate for Westminster and Middlesex where he, and later with his half brother John Fielding, introduced innovations in criminal apprehension, gathering a small band of \"thief takers\" who were supported with money from the secret service. These men were known as \"Mr Fielding's people\", afterwards nicknamed \"the Bow Street runners\" (named after the Bow Street house where Fielding lived and held court, which later became Bow Street Magistrate's Court) and eventually evolved into The Metropolitan Police Force. Henry had suffered from gout and most probably cirrhosis of the liver (he was a very heavy drinker despite his remarkable energy and abilities) from his late 30s and by 1753 was very ill, his health made worse by overwork and long hours in the courtroom. In 1754 he resigned his post as magistrate, which was taken over by his half-brother John Fielding (later Sir John Fielding) and journeyed to Lisbon, Portugal to try to recover, but soon thereafter died and is buried in the English Cemetery. His last gift to the world was a humorous account of the travails of travel and sea,The Journal of a Voyage to Lisbon - a triumph of courage and humour in the face of his fatal illness. Category:1707 births Category:1754 deaths Category:18th-century English writers Category:English novelists Category:English playwrights Category:English Christians Category:English judges Category:People educated at Eton College Category:People from Somerset Category:Writers from London Category:18th-century novelists Category:Deaths from cirrhosis",
 "title": "Henry Fielding"
}