{
 "id": "22993",
 "text": "George Orson Welles (May 6, 1915 – October 10, 1985) was an American director, actor, writer, producer, and magician who is remembered for his innovative work in film, radio, and theatre. He is considered to be among the greatest and most influential filmmakers of all time. Welles was born in Kenosha, Wisconsin. In 1938 Welles directed a weekly radio show, The Mercury Theatre of the Air. His October 30 broadcast of The War of the Worlds (radio drama) created much excitement. Welles also made the movie Citizen Kane in 1941. Many movie critics think that this movie is the best movie ever made. His later movies are less liked. Welles died of a heart attack in Los Angeles, California, aged 70. == Other websites == * * * Orson Welles The Orson Welles OTR Archives * War Of The Worlds history of the War Of The Worlds radio broadcast and additional historical material on War Of The Worlds * Mercury Theatre on the Air website provides MP3 and Real Audio files of Welles' radio dramas * Nazi Eyes On Canada, starring Orson Welles , 1942 CBC war loan series * Wellesnet The Orson Welles Web Resource * The Magnificent Ambersons a site that details the strange saga of Welles' second film * The Unseen Welles a guide to Welles' unfinished and unreleased projects * The Orson Welles collection at the Lilly Library, Indiana University * Senses of Cinema: Great Directors Critical Database * UBU Web's 365 Days Project Outtake from Welles' Frozen Peas commercial. * MovieMaker Magazine Article on hoped for eventual release of final Welles movie The Other Side Of The Wind. * Orson Welles biography * Orson Welles' Photo & Gravesite * Orson Welles and the Bat-Man * New York Times Obituary * Biographical resources dedicated to Orson Welles * Orson Welles: The Man Who Was Magic * Orson Welles - The One Man Band (German documentary, 1995) Category:Academy Award Honorary Award winners Category:American movie actors Category:Movie directors from Wisconsin Category:Movie producers from Wisconsin Category:American radio actors Category:American radio personalities Category:American stage actors Category:American television actors Category:American television directors Category:American television producers Category:American television writers Category:American theatre directors Category:American voice actors Category:Theatre producers Category:Deaths from myocardial infarction Category:Screenwriters from Wisconsin Category:Actors from Kenosha, Wisconsin Category:1915 births Category:1985 deaths",
 "title": "Orson Welles"
}