{
 "id": "22996",
 "text": "Slobodan Milošević (Serbian: Слободан Милошевић, pronounced []; August 20, 1941 – March 11, 2006) was a Serbian Yugoslav dictator. * * * * * ==Overview== He was the President of Serbia from 1989 to 1996, and then the President of the Federal Republic of Yugoslavia from 1996 to 2000. After his fall from power in 2001, he was sent to The Netherlands to stand trial at the International Criminal Tribunal for the former Yugoslavia (ICTY) in The Hague over charges of genocide. * * * * * However, he died after five years in prison before the trial was completed. The UN tribunal said that Milosevic died of a heart attack. ==War crimes trials== ===International Criminal Tribunal for the former Yugoslavia=== ====2007 rulings==== Following his death, in four separate rulings, he was found to be a part of a joint criminal enterprise which used crimes to remove Croats, Bosniaks and Albanians from large parts of Croatia, Bosnia and Herzegovina, and Kosovo. In 2007, in its rulings against Republic of Serbian Krajina President Milan Martić, the International Criminal Tribunal for the former Yugoslavia (ICTY) concluded: In February 2007, the International Court of Justice (ICJ) cleared Serbia under Milošević's rule of direct responsibility for some of the war crimes. However, the ICJ stated that ====Kosovo rulings==== In the two Kosovo rulings, the Nikola Šainović et al. and Vlastimir Đorđević cases, Milošević was found to have been \"one of the crucial members\" of the criminal enterprise aimed at uprooting large parts of Albanians from Kosovo. ====2016 ruling==== In its 2016 ruling regarding Radovan Karadžić, the ICTY found that \"there was no sufficient evidence presented in this case to find that Slobodan Milošević agreed with the common plan [to create territories ethnically cleansed of non- Serbs]\" citing \"Milošević's repeated criticism and disapproval of the policies and decisions made by the Accused and the Bosnian Serb leadership\", though it also noted that ===International Residual Mechanism for Criminal Tribunals=== ====2021 ruling==== In its 2021 ruling against Serbia's operatives Jovica Stanišić and Franko Simatovićq, the follow-up International Residual Mechanism for Criminal Tribunals concluded: ==Related pages== * Ratko Mladić * Biljana Plavšić * Bosnian genocide * Complicity in genocide * Yugoslav massacres of Kosovo Albanians during the Kosovo War ==Footnotes== ==References== Category:1941 births Category:2006 deaths Category:War criminals Category:Former dictators Category:Bosnian genocide Category:Presidents of Serbia Category:Crimes against humanity Category:Presidents of Yugoslavia Category:People who died in prison custody Category:Presidents of Serbia and Montenegro Category:Specially Designated Nationals and Blocked Persons List",
 "title": "Slobodan Milošević"
}