{
 "id": "230020",
 "text": "Binge drinking is an unhealthy way of drinking alcoholic beverages. When people binge drink, they usually drink a lot of alcohol in a short time, or drink with the goal of getting drunk. Binge drinking is very common in the United States. The United States Centers for Disease Control and Prevention (CDC) says that in the U.S.: * More than half of the alcohol drunk by adults is drunk during binge drinking; and * About 90% of the alcohol drunk by youth under age 21 is drunk during binge drinking. ==What exactly is binge drinking?== Different researchers and countries sometimes have different definitions of what exactly binge drinking is. ===United States=== In the United States, the most common definition of binge drinking was created by the National Institute of Alcohol Abuse and Alcoholism in 2009. It says that binge drinking is a pattern of drinking alcohol that brings a person's blood alcohol content (BAC) to 0.08 or more. Blood alcohol content is the percentage of ethanol in the person's blood. (In the United States, a BAC of 0.08 means a person is legally drunk.) This means that a person would be binge drinking if: * A usual adult man had five or more drinks in about two hours * A usual adult woman had four or more drinks in about two hours. ===United Kingdom=== In the United Kingdom, the National Health Service (NHS) says that binge drinking is having \"eight or more units [of alcohol] in a single [drinking] session for men and six or more for women.\" (Units are used in the United Kingdom to measure alcohol.) This means a person would be binge drinking if: * A usual adult man drank four glasses of wine, or three and a half pints of beer, in a single drinking session * A usual adult woman drank three glasses of wine, or three pints of beer, in a single drinking session ===European Union=== A recent report paid for by the European Union suggested that binge drinking should be defined, across Europe, as drinking \"60g alcohol (men) and 40g alcohol (women) in a period of about two hours.\" ==Dangers of binge drinking== Binge drinking can be dangerous. It can cause alcohol poisoning. If a person drinks too much, they could stop breathing and die. Binge drinking can also damage the liver. Also, it increases binge drinkers' risks of having other problems. Binge drinkers are more likely than people who do not binge drink to: * Hurt themselves accidentally (for example, by falling or drowning) *Physical aggression like hitting, kicking, or slapping (and domestic violence) *Psychological intimidation, belittling, or humiliation *Forced sexual intercourse or activities (rape) *Controlling behaviors like isolating the person from friends and family. * Drive while drunk, causing them to crash the car, and hurt or kill themselves or other people * Hurt themselves or other people on purpose (injuries from guns, rape, and domestic violence are all more common among binge drinkers) * Get sexually transmitted diseases or get pregnant without meaning to (because they are more likely to take risks and not use birth control like condoms) * Have children who are born with Fetal Alcohol Syndrome if drinking while pregnant * Have high blood pressure, strokes, and other cardiovascular diseases * Get liver disease, like cirrhosis * Get brain damage * Have erectile dysfunction ==References== Category:Alcohol drinking habits",
 "title": "Binge drinking"
}