{
 "id": "230064",
 "text": "The United States is the third or fourth biggest country in the world. Only Russia and Canada are bigger. If you do not count the area of the Great Lakes, China is also bigger. Its geography varies a lot. The area is about 3,717,000 square miles, or about 9,629,000 square kilometers. The highest point is Mount McKinley, Alaska and the lowest point is Death Valley, California. * There are meadows and forests on the East Coast, * The Appalachian Mountains in the east * The Great Plains in the middle of the country, * The Mississippi-Missouri river, in the middle * The Rocky Mountains west of the plains * Deserts and coastal areas west of the Rocky Mountains * Forests in the Pacific Northwest * Arctic regions of Alaska * Volcanic islands in Hawaii, which is not geographically part of the Americas. The geographic center is in Butte County, South Dakota. The geographic center of the 48 states is in Smith County, Kansas. == Physical geography == There is a general rule of thumb which explains why so much of the land is close to sea level in the East, and so mountainous in the West. It is as follows. The Americas have been moving west for over 100 million years. The movement has buckled up and collected geological plates in the West and spread out the land in the East. This has resulted in a series of mountain ranges all down the West of the Americas, and mostly low-lying land in the East. The East is a \"passive margin\" coast where the continental crust is moving away, in this case to the West. The West is an \"active margin\" coast. It has the mountains, and it has the landslides and volcanoes. In fact, the only high land in the East of the U.S. is where there is a very ancient ground-down mountain range known as the Allegheny Mountains. What is now the Alleghenys was once part of the great Appalachian orogeny (mountain building) about 300 million years ago. What remains now is just the ground-down roots of this ancient mountain chain. In the top-most physical map, the red-brown areas are high land. ==Climate== The climate varies along with the geography, from tropical (hot and wet in summer, warm and dry in winter) in Florida and Hawaii to tundra (cold all year) in Alaska. Large parts of the country have warm summers and cold winters. Most of the northern U.S. gets snow in winter. Some parts of the western United States, like parts of California, have a Mediterranean climate. The southeastern United States can get hurricanes. Parts of the southern United States are subtropical (hot in summer and cool in winter). Tornadoes happen a lot in the Midwest. The highest recorded temperature is 134 degrees Fahrenheit (57 degrees Celsius) and the lowest recorded temperature is -80 degrees Fahrenheit (-62 degrees Celsius). == Gallery == File:Grand Canyon from Moran Point.jpeg|The Grand Canyon File:MountMcKinley BA.jpg|Mount McKinley in Alaska File:DeathValleyDunes4.jpg|Death Valley File:Mississipi River - New Orleans.JPG|The Mississippi River File:Florida Bay at Flamingo.JPG|the Everglades and Florida Keys File:Shenandoah-span.jpg|the Shenandoah Valley in Virginia ==Sources==",
 "title": "Geography of the United States"
}