{
 "id": "230266",
 "text": "WrestleMania XXVII was the twenty-seventh yearly WrestleMania professional wrestling pay-per-view (PPV) event made by World Wrestling Entertainment (WWE). It took place on April 3, 2011, at the Georgia Dome in Atlanta, Georgia. It was the last WrestleMania until 2017 to feature split rosters for Raw and SmackDown, as the first brand extension ended in August. WrestleMania XXVII was also the last event before World Wrestling Entertainment started calling itself simply \"WWE\". Eight matches happened on the card. In the main event, which was from the Raw brand, The Miz defeated John Cena to keep the WWE Championship, thanks to help from the show's host, The Rock. This set up a match between Rock and Cena at the main event of the following year's event. WrestleMania XXVIII. SmackDown's main match saw Edge defeat Alberto Del Rio to keep his World Heavyweight Championship in his last match until 2020. Also, The Undertaker defeated Triple H in a No Holds Barred match to extend his undefeated WrestleMania streak to 19–0. This is the only WrestleMania so far where no title changes happened. == Production == In September 2009, it was reported that the city of Atlanta was wanting to have WrestleMania XXVII at the Georgia Dome. A press conference was held on February 1, 2010 at the Georgia Dome to officially announced the event for Atlanta; this will be the first WrestleMania to be held in the state of Georgia. Along with WrestleMania XXVII, a group of events known as \"WrestleMania Week\" will be held in the week before the event including WrestleMania's yearly WrestleMania Axxess fan convention, the 2011 WWE Hall of Fame ceremony, the fourth yearly WrestleMania Art showing and auction, and a Celebrity Pro-Am Golf tournament. According to the president of the Atlanta Sports Council, Gary Stokan, WrestleMania Axxess is planned to be held at the Georgia World Congress Center, while the WWE Hall of Fame ceremony will take place either at the Fox Theatre or at Philips Arena. Between 15 and 20 cities were thought of to host the event, with fewer than half of the people thought of invited to explain why they should hold the event at WWE's headquarters at Stamford, Connecticut. Atlanta's main rival to hosting the event was the city of Miami, Florida who wanted to host the event at Sun Life Stadium along with WrestleMania Axxess at the Convention Center and the WWE Hall of Fame ceremony at the American Airlines Arena. Miami was later given to WrestleMania XXVIII. === Attendance record controversy === During the pay-per-view, Justin Roberts announced a new Georgia Dome entertainment attendance record of 71,617. But a Billboard.com article claims a Backstreet Boys concert had 73,337 people in attendance. WWE says in their official press release that the Backstreet Boys concert only had 65,658 people in attendance. WWE's number was later confirmed by officials at the Georgia Dome. == Matches == == Other on-screen talent == Host The Rock Commentator Michael Cole Jerry Lawler Josh Mathews Booker T Jim Ross Carlos Cabrera Hugo Savinovich Ring announcer Justin Roberts Tony Chimel Referees Scott Armstrong Mike Chioda John Cone Jack Doan Justin King Chad Patton Charles Robinson == References == == Other websites == * Official Website Category:2011 in professional wrestling Category:Sports in Atlanta Category:WrestleMania Category:21st century in Atlanta Category:2011 in the United States Category:2010s in Georgia (U.S. state)",
 "title": "WrestleMania XXVII"
}