{
 "id": "230588",
 "text": "The Hitler Youth (Hitlerjugend) was the youth organization of the Nazi Party in Nazi Germany. At first membership was voluntary, but after December 1936 all non-Jewish boys in Germany aged 10-18 were required to join. The girls' branch of the Hitler Youth was called the League of German Girls. Parents who stopped their children from participating in the Hitler Youth could be sent to prisons or concentration camps. A child who was not in the Hitler Youth could be refused a high school diploma, a job, an apprenticeship, and/or entrance to university. == Membership == === The Hitler Youth Law === At first, membership in the Hitler Youth was voluntary (though strongly encouraged). This changed in December 1936 with the Gesetz über die Hitlerjugend (Hitler Youth Law). The law required all \"Aryan\" boys aged 10-18 to join the Hitler Youth. The law also banned every other youth organization in Germany, including the Boy Scouts, and added their members to the Hitler Youth. It stated: \"All of the German youth in the Reich is organised within the Hitler Youth\". === Growth in membership === Before the Nazis made membership mandatory in 1936, the Hitler Youth already had over 5 million members. After the Hitler Youth Law, membership grew very quickly. In 1935, 60% of boys in Germany belonged to the Hitler Youth. By 1939, 90% did. In 1940, eight million children were members of the Hitler Youth. == Branches == When they entered the Nazi Party's youth organization at age 10, boys entered the Deutsches Jungvolk in der Hitler Jugend (\"the Young Folk of the Hitler Youth\"). At age 14, they graduated to the regular Hitler Youth. The girls' branch of the Hitler Youth was called the League of German Girls. It taught girls to help the Reich by raising families, collecting supplies (like coats and scrap metal), and raising money. Like the Hitler Youth, it focused on physical fitness through activities like rhythmic gymnastics. == Purposes == === Teaching ideology === One purpose of the Hitler Youth was to teach children Nazi ideas and values. These ideas were racist and antisemitic. Children were taught that: * \"Aryan\" people were better than Jews, Slavs, Soviets, and many other groups * Jews were conspiring to destroy Germany, and were a threat to every German * They had a duty to the Reich, and should be ready to give their lives for it * They should be loyal to Adolf Hitler and the Nazi Party before anyone else * They should report anyone who disagreed with Hitler or broke Nazi rules (even if this meant reporting their own friends or parents) ==== \"Education for death\" ==== A report written by the Supreme Headquarters Allies Expeditionary Force during the war concluded that the Hitler Youth was extremely dangerous: > The Hitler Youth is not a Boy Scout or Girl Guide organisation. It is > [unlike] any organisation for young people known to the Western World. It is > a compulsory Nazi formation, which has consciously sought to breed hate, > treachery and cruelty into the mind and soul of every German child. It is, > in the true sense of the word, \"education for death\". Under no circumstances > should the Hitler Youth be taken lightly ... from an operational or > occupation point of view. === Preparing for military service === Another purpose of the Hitler Youth was to turn children into eager, effective soldiers for the Reich. Many Hitler Youth activities involved physical fitness and military-style training. Members were trained to use weapons and basic fighting techniques. === Creating loyal Nazis === In his book Mein Kampf, Hitler wrote: “Whoever has the youth has the future.” With the Hitler Youth, he wanted to make children into loyal Nazis who would ensure the future of the Reich by: *Continuing Nazi policies, ideas, and values after their parents died * Creating \"pure\" German families * Being the next generation of soldiers and protectors for the Reich In 1938 Hitler explained: > These boys and girls enter our organizations with their ten years of age, > and often for the first time get a little fresh air; after four years of the > Young Folk they go on to the Hitler Youth, where we have them for another > four years...And even if they are still not complete National Socialists, > they go to Labor Service and are smoothed out there for another six, seven > months...And whatever class consciousness or social status might still be > left...the Wehrmacht will take care of that. == Use == === Non-military === Hitler Youth members were used to achieve the Nazi Party's goals. For example, they: * Spied on religious youth groups and classes * Tried to keep people from attending church * Delivered messages for the civil service * Collected supplies like recyclable materials in order to help the Nazi war effort * Helped to work on farms and build infrastructure (like roads) === Military === Many Hitler Youth entered the German Army. As members of the Wehrmacht were killed in the war, Hitler Youth members were expected to take their place. When Allied forces invaded German-occupied France on D-Day, over 20,000 German youth participated in the attempt to fight them off. As the war became more desperate, the Nazis pulled younger children out of school to fight as child solders. They were often sent on missions they were not expected to survive, and if they refused to go, they were executed. On various occasions in 1945, Hitler Youth members formed death squads, participated in executions, and committed other wartime atrocities. == Related pages == * Nazi Germany * The Holocaust * Antisemitism == References == *http://www.wolfhildehitleryouthdiary.com == Other websites == *History of the Hitler Youth Category:Nazism Category:Youth organizations Category:1922 establishments in Europe Category:1945 disestablishments in Germany Category:1920s establishments in Germany",
 "title": "Hitler Youth"
}