{
 "id": "230613",
 "text": "The Attack on Pearl Harbor was a surprise attack by the Empire of Japan against the neutral United States naval base at Pearl Harbor, Hawaii. This attack, on the morning of December 7, 1941, led the United States into World War II. The Japanese military leadership referred to the attack as the Hawaii Operation, Operation AI,For the Japanese designator of Oahu. Wilford, Timothy. \"Decoding Pearl Harbor\", in The Northern Mariner, XII, #1 (January 2002), p. 32fn81. and as Operation Z.Fukudome, Shigeru, \"Hawaii Operation\". United States Naval Institute, Proceedings, 81 (December 1955), pp. 1315–31 Japan wanted time to invade Southeast Asia. Over the course of seven hours several places were attacked. The places governed by the US were Philippines campaign (1941–1942), Guam, and Wake Island. The places in the British Empire attacked were Singapore, Hong Kong and, later, Malaya. == 1925 prediction by a journalist == Although the attack was a successful surprise, it had been predicted in detail. The prediction was in the form of a book originally published in 1925. This was The Great Pacific War: a history of the AmericanJapanese campaign of 1931.Bywater, Hector C. The Great Pacific War: a history of the American–Japanese campaign of 1931. 1925. Applewood Books, Bedford MA. ISBN 1-55709-557-4 The author was Hector C. Bywater (18841940), a journalist whose specialty was naval warfare. The whole story is told in the more recent book Visions of Infamy by William C. Honan.Honan, William C. 1991. Visions of Infamy: the untold story of how journalist Hector C. Bywater devised the plans that led to Pearl Harbor. St Martin's Press, N.Y. ISBN 0-312-05454-8 Bywater's book was translated into Japanese, thus it was available to those concerned with planning the future of Japanese sea power. One thing changed from Bywater's book: the U.S. fleet moved its Pacific base from the Philippines to Pearl Harbor. Of course this was known by Japan. When the Japanese got to the Philippines they landed on exactly the place predicted by Bywater except, of course, they had already bombed Pearl Harbor. == The Bombing == The attack started at 7:48 a.m. Hawaiian Time (18:18 GMT).Prange et al. December 7, 1941, p. 174. The base was attacked by 353 Japanese aircraft. These planes included fighters, level and dive bombers, and torpedo bombers. The planes attacked in two waves. The planes were launched from six aircraft carriers. All eight US battleships were damaged. All but were later raised. Six were returned to service and went on to fight in the war. Being old, they served for shore bombardment. The Japanese also sank or damaged three cruisers, three destroyers, an anti-aircraft training ship, and one minelayer. A total of 188 U.S. aircraft were destroyed. 2,403 Americans were killed and 1,178 others were wounded. Important base installations were not attacked. These facilities included the power station, dry dock, shipyard, maintenance facilities, fuel and torpedo storage facilities, submarine piers, and the headquarters building. Japan did not lose many people. Japan lost 29 aircraft and five midget submarines. 64 Japanese soldiers died. Kazuo Sakamaki, who was in charge of one of the submarines, was captured. He was the first Japanese soldier taken prisoner by the United States. Japan declared war on the United States and the British Empire the same day. Due to an error, the British and Americans did not know until the next day. The British government declared war on Japan immediately after being attacked. On December 8th, the United States Congress declared war on Japan. On December 11, Germany and Italy declared war on the United States. The U.S. which responded with a 1941 declaration of war upon Germany and a declaration of war upon Italy. President Franklin D. Roosevelt proclaimed December 7, 1941, \"a date which will live in infamy\". Attacking without declaring war is against the laws of war. As a result, the attack on Pearl Harbor was later judged in the Tokyo Trials to be a war crime. == Background to Conflict == === Diplomatic Background === Japan and the US knew they might go to war. They had been planning for war since the 1920's. Japan was concerned about the new American control of Hawaii and the Philippines. Japan thought those territories were within their sphere of influence. Japan had taken a heated stance when the United States opposed the Racial Equality Proposal to amend the Treaty of Versailles. Despite this, the two nations were still friendly and traded. Tensions seriously grew with Japan's invasion of Manchuria in 1931. Over the next decade, Japan expanded into China. This led to the Second Sino-Japanese War in 1937. Japan spent great effort trying to isolate China. They also tried to gain independent resources to attain victory on the mainland. The \"Southern Operation\" was designed to assist these efforts by conquering Southeast Asia. Starting in December 1937, events such as the Japanese attack on USS Panay, the Allison incident, and the Nanking Massacre made Western citizens dislike Japan.. The U.S. unsuccessfully proposed a joint action with the British to blockade Japan. In 1938, U.S. companies stopped providing Japan with implements of war. This was due to an appeal by President Roosevelt. In 1940, Japan invaded French Indochina, They did this to try and stop the flow of supplies reaching China. The United States halted shipments of airplanes, parts, machine tools, and aviation gasoline to Japan. Japan saw this as an unfriendly act. The United States did not stop oil exports. This was because Japan was dependent on US oil. Removing the oil would cause hostile relations. In mid-1940, President Franklin D. Roosevelt moved the Pacific Fleet from San Diego to Hawaii.Shift Of Our Fleet To Atlantic Studied, New York Times, June 23, 1940, \"Except for the Atlantic Battle Squadron, the entire fleet is now in the Pacific, based at Pearl Harbor, Hawaii.\" He also ordered a military buildup in the Philippines. He hoped that taking both actions would stop Japanese aggression in the Far East. The Japanese thought attacking the United Kingdom would mean they had to attack the United States. Japan then decided they would have to launch a massive attack on the US. An invasion of the Philippines was also considered necessary by Japanese war planners. The U.S. War Plan Orange called for defending the Philippines with an elite force of 40,000 men. This option was never done because Douglas MacArthur didn't like it. He thought he would need a force ten times that size. By 1941, U.S. planners expected to abandon the Philippines at the outbreak of war. Late that year, Admiral Thomas C. Hart, commander of the Asiatic Fleet, was given orders to that effect. The U.S. finally ceased oil exports to Japan in July 1941. This was done following the seizure of French Indochina after the Fall of France. It was also in part because of new American restrictions on domestic oil consumption. Because of this decision Japan decided to take the oil-rich Dutch East Indies. On August 17, Roosevelt warned Japan that America was preparing to stop Japan if needed.Chapter IV The Showdown With Japan August–December 1941 Strategic Planning for Coalition Warfare, 1941–1942 The Japanese were faced with a dilemma. They either either had to leave China or seize new sources of raw materials in the resource-rich European colonies of Southeast Asia. Japan and the U.S. engaged in negotiations during 1941. They were attempting to improve relations. Japan offered to withdraw from most of China and Indochina. They also offered to peace with the Nationalist government. Japan also offered to have a new neutral reading of the Tripartite Pact. They also agreed to stop trade discrimination. They promised to do these things if other nations did it as well. The U.S. government didn't accept these terms. Japanese Prime Minister Konoye offered to meet with Roosevelt. Roosevelt didn't want to meet before having an agreement. The U.S. ambassador to Japan told Roosevelt he should meet with Konoye. He was worried that if he didn't it might lead to war.Review of the Diplomatic Conversations Report of the Joint Committee on the Investigation of the Pearl Harbor Attack (1946) However, Roosevelt did not follow this recommendation. Konoye stopped being the Japanese prime minister the next month. He stopped because the Japanese military rejected the demand to leave China.Chapter V: The Decision for War Morton, Louis. Strategy and Command: The First Two Years Japan's final proposal was delivered on November 20th. In it, they offered to leave southern Indochina. They also offered to not attack Southeast Asia. In exchange, they asked for one million U.S. gallons (3.8 million liters) of airplane fuel. They also asked for the sanctions to be lifted. Finally, they asked the allies to stop aiding China.Battle Order Number One: Nov. 28, 1941 | 1941 – Battle Order Number One America responded with their own proposal on November 26th. The Hull note required Japan to leave China. It also required them to promise not to attack other powers in the pacific. On November 26th in Japan the task force left for Pearl Harbor. This was the day before the Hull note was sent to Japan. The Japanese wanted to attack the U.S. to prevent a larger war. Their goal was to destroy the U.S. navy so they could take over Southeast Asia. They wanted to take over the Pacific territories of the Allied nations. Over the course of seven hours multiple places were attacked. The places owned by the US attacked were Philippines, Guam, and Wake Island. The places owned by the British Empire attacked were Malaya, Singapore, and Hong Kong. The Japanese also saw the situation as being a time issue. They were worried about getting an attack in on the U.S. before they ran out of fuel to do so. ===Military Planning=== Planning for an attack on Pearl Harbor had been planned since early 1941. Isoroku Yamamoto came up with the plan in order to protect Japan's attack on Southern Asia. He got permission to plan and train for an attack. To do so, he had to argue with the Imperial Japanese Navy General Staff. He only got permission because he threatened to quit his job. Full-scale planning started in Spring 1941. The planning was under the guidance of Rear Admiral Ryūnosuke Kusaka, with assistance from Captain Minoru Genda. The planners looked to the 1940 British air attack on the Italian fleet at Taranto for help. This was because the British had successfully attacked ships in port there. Over the next several months, things progressed as planned. However, Emperor Hirohito did not approve the attack plan until November 5. This is because he wanted to discuss the matter over a set of Imperial Conferences. Final approval was not given until December 1st. This was because a majority of Japanese leaders warned the emperor about the \"Hull Note. They said it would, \"destroy the fruits of the China incident, endanger Manchukuo and undermine Japanese control of Korea\"., citing the Sugiyama memo By late 1941, many people thought war between the U.S. and Japan would come soon. A Gallup poll just before the attack on Pearl Harbor found that 52% of Americans expected war with Japan, 27% did not, and 21% had no opinion. Many U.S. bases in the pacific were put on alert in this period. However, U.S. leaders doubted that Pearl Harbor would be attacked. They expected Japan to attack the Philippines. This was because the Philippines were in a important position in the Pacific. The islands had many air bases and a large naval port. These would threaten Japanese shipping in Southern Asia.Noted by Arthur MacArthur in the 1890s. Manchester, William. American Caesar They also incorrectly thought Japan wasn't capable of multiple attacks at once.Peattie & Evans, Kaigun ===Objectives=== ==Ships Lost or Damaged== Twenty-one ships were damaged or lost in the attack. All of the ships except three were raised after the attack. ===Battleships=== * (Rear Admiral Isaac C. Kidd's flagship of Battleship Division One): hit by four armor-piercing bombs and exploded. 1,177 people were killed. The ship was judged to be too damaged for recovery. * : hit by five torpedoes and sank. 429 people were killed. The ship was judged to be too damaged for recovery. * : hit by two bombs and seven torpedoes before sinking. 106 people were killed. Returned to service July 1944. * : hit by two bombs and two torpedoes before sinking. 100 people were killed. Returned to service January 1944. * : hit by six bombs and one torpedo. Nevada was then steered into the island. 60 people were killed. Returned to service October 1942. * (Admiral Husband E. Kimmel's flagship of the United States Pacific Fleet):Prange, Goldstein, Dillon. At Dawn We Slept page 49 Was in drydock with Cassin and Downes. Was hit by one bomb and pieces from Cassin. 9 people were killed. Remained in service after the attack. * : Was hit by two bombs. 5 people were killed. Returned to service February 1942. * : Was hit by two bombs. 4 people were killed. This includes a plane pilot who was shot down. Returned to service February 1942. ===Ex-battleship (target/AA training ship)=== * : Was hit by two torpedoes before sinking. 64 people died. The ship was judged to be too damaged for recovery. ===Cruisers=== * : Hit by one torpedo. 20 people were killed. Returned to service January 1942. * : Hit by one torpedo. Returned to service February 1942. * : Was damaged mildly by a bomb that missed. Remained in service. ===Destroyers=== * : Was in drydock with Downes and Pennsylvania. Hit by one bomb and caught fire. Was rebuilt after the attack. Returned to service February 1944. * : in drydock with Cassin and Pennsylvania. Caught fire from Cassin and burned. Was rebuilt after the attack. Returned to service November 1943. * : Was moving to West Loch. Damaged by two missed bombs.; Continued patrol after attack. Put into dry-dock on January 15, 1942. Began sailing again on January 20, 1942. * : Hit by three bombs. Returned to service June 1942. ===Auxiliaries=== * (minelayer): damaged by the torpedo that hit Helena and sank. Returned to service as a repair ship on February 1944. * (repair ship): hit by two bombs. Also hit by the blast and fire from Arizona. Vestal was then steered into the island. Returned to service by August 1942. * (seaplane tender): Hit by one bomb. Also hit by a crashed Japanese aircraft. 19 people were killed. returned to service January 1942. 19 dead. * (harbor tug): Sunk by explosions and fire from Shaw. Returned to service August 1942. * (yard floating dock): Was sunk by bombs. Returned to service January 25, 1942. == After the Attack == The next day, United States president Franklin D. Roosevelt gave a speech to Congress. In his speech, President Roosevelt said that December 7 was \"a date which will live in infamy\". Most Americans listened to the speech on the radio. A few minutes after the speech ended, Congress voted to declare war on Japan. Only one member of Congress, Jeanette Rankin, voted \"no\". Three days later, Germany and Italy also declared war on the United States. Rumors started blaming Italian, German, and Japanese Americans for knowing about the attacks ahead of time and even helping. Many American citizens became afraid of Italian, German and Japanese Americans because Germany and Italy were allied to Japan. As a result, 110,000 Japanese Americans 31,000 German Americans and 3,000 Italian Americans were sent to internment camps starting in 1942. The government made the father of a famous baseball player, Joe di Maggio, move from the West coast because he was an Italian immigrant. Some Italian, German and Japanese Americans were interned as late as 1944. The government apologized for this to the Japanese Americans in 1988. German Americans and Italian Americans have never received an formal apology from the government. After the war Japanese leaders who ordered the attack were tried for a war crime, Hideki Tojo, the Prime Minister of japan was convicted of war crimes at an international military tribunal in 1948, including waging wars of aggression and ordering inhumane treatment of prisoners of war. He was sentenced to death that November and executed by hanging the following month == Reason == Behind the attack is a reason, and that reason is the shortage of raw materials in Japan (and similar island chains such as Hawaii). In such island chains there is a shortage of raw materials, particularly those of metals and coal. The shortage of metals is due to the island chains (such as Hawaii, Japan, Galapagos etc.) having a volcanic origin, rather than coming from an ancient craton. The United Kingdom, small as it is, has its origin in two ancient cratons which became part part of a much larger continent. Almost all the elements produced in stars are present in the UK in some amount, however small. Iron is there in plenty and many rare metals can be found. Japan is a typical island chain produced by comparatively recent volcanic action. It suffers from a shortage of rare elements. It is short of some minerals which are not rare: such as iron and coal. The lands it conquered have all the resources which Japan needed (and always will need). One example: Japan lacks iron. This is why traditional Japan makes such use of bamboo as a building material. But Western Australia has mountains virtually made of iron. This is where modern Japan gets most of its iron for making steel. ==Related pages== * List of attacks on U.S. territory * History of Japan * World War II * History of the United States ==Notes== ==References== ==Other websites== * Franklin D. Roosevelt's \"A day which will live in infamy\" speech Category:1941 in the United States Category:20th century in Hawaii Category:United States Navy Category:World War II Category:1940s in Japan",
 "title": "Attack on Pearl Harbor"
}