{
 "id": "230783",
 "text": "Edmund Gerald Brown Jr. (born April 7, 1938) is an American politician. He was the 39th Governor of California from 2011 to 2019. He was also the 34th Governor of California from 1975 to 1983. In 2010, he was elected Governor of California. On November 4, 2014, he was re-elected governor. Brown is a member of the Democratic Party. He has also been California's Secretary of State, Attorney General of California, and was the mayor of Oakland for eight years. He ran for President of the United States in the Democratic primaries in 1976, 1980 and in 1992. ==Early life== Brown was born in San Francisco, California. His father was Pat Brown who also served as Governor of California until losing re-election to Ronald Reagan. His mother was Bernice Layne Brown. He was raised in San Francisco. Brown studied at Yale University and at the University of California, Berkeley. ==Early career== Brown began his political career as a member of the Los Angeles Community College District Board of Trustees from 1969 to 1971. He later served as Secretary of State of California from 1971 to 1975. ==Governor of California== Elected Governor in 1974 at age 36, Brown was the youngest California governor in 111 years. Brown declined to run for a third term in 1982, instead running for the United States Senate in 1982. However, he was defeated by Republican Mayor Pete Wilson (who himself would later become governor), and many considered his political career to be over. After travelling abroad, Brown returned to California and served as Chairman of the California Democratic Party (1989–1991), resigning to run for the Senate again in 1992. Running against Meg Whitman in 2010, Brown became the 39th Governor in 2011; on October 7, 2013, he became the longest-serving governor in California history, surpassing Earl Warren. He was reelected in 2014 with sixty percent of the vote. As a consequence of the 28-year gap between his second and third terms, Brown has been both the sixth-youngest California governor (the youngest since 1863) and the oldest California governor in history. On November 23, 2017, Brown pardoned 70 year old Craig Richard Coley after DNA tests showed he was not involved in the murders of his ex girlfriend and her son in 1978. ==Alleged 2016 Presidential bid== Brown had been thought likely to run for the Democratic nomination for President in the 2016 U.S. presidential election. He had expressed some interest in doing so, particularly if Hillary Clinton did not run.Philip Rucker (May 28, 2014) \"Gov. Jerry Brown says 2016 Democratic nomination is Hillary Clinton’s ‘if she wants’\", The Washington Post. Retrieved October 2, 2014.Terence Cullen (July 21, 2014) \"List of potential Democratic presidential candidates for 2016 expands: report\", Daily News. Retrieved October 2, 2014.Jason Linkins (July 13, 2014) \"The Brutalist Guide To 2016's Democratic Contenders (Not Named Hillary Clinton)\", The Huffington Post. Retrieved October 2, 2014. However, in an interview in 2014, Brown ruled out running. He did not rule out running for another term as Mayor of Oakland, saying that \"I wouldn't mind being mayor of Oakland. But I don't know, when I'm 80 and a half, whether I'll have the same appetite. I'm very excited doing this job. [Still], I don't want to foreclose my options for four years from now.\" In an interview by CNN during the second Republican Primary debate at the Ronald Reagan Presidential Library, Brown hinted at a possible presidential bid in 2016.Pollak, Joe (September 17, 2015) \"Jerry Brown Hints at 2016 Run\", Breitbart. Retrieved September 18, 2015. He stated that \"I'll jump in when the time is appropriate\".Warren, Michael (September 17, 2015) \"Jerry Brown Considering Run For President?\" , Weekly Standard. Retrieved September 18, 2015. ==Personal life== Brown married his girlfriend of fifteen years, Anne Gust, in 2005. In April 2011 Brown had surgery to remove a basal- cell carcinoma from the right side of his nose. In December 2012, media outlets reported that Brown was being treated for early stage (the precise stage and grade was not stated) localized prostate cancer with a very good health. The official gubernatorial portrait of Jerry Brown, painted for his first term as Governor of California, was painted by Don Bachardy. It was shown to the public for the first time in 1984. The painting is controversial because it is not like all of the other portraits. ==References== ==Other websites== * Jerry Brown for Governor Category:1938 births Category:Living people Category:Governors of California Category:1976 United States presidential candidates Category:1980 United States presidential candidates Category:1992 United States presidential candidates Category:Democratic Party (United States) politicians Category:Politicians from San Francisco Category:Mayors of Oakland, California Category:21st-century American politicians Category:20th-century American politicians Category:American bloggers Category:California attorneys general Category:Lawyers from San Francisco Category:Lawyers from Oakland, California",
 "title": "Jerry Brown"
}