{
 "id": "230865",
 "text": "Warning coloration (or aposematism) is how animals let other animals know that they are poisonous or dangerous. It is the exact opposite of camouflage. Warning colors are usually some combination of red, yellow, black and white. Alfred Russel Wallace, a British naturalist, explained it this way, in 1889: :\"The animals in question are possessors of some deadly weapons, as stings or poison fangs, or they are uneatable, and are thus so disagreeable to the usual enemies of their kind that they are never attacked when their peculiar powers or properties are known. It is, therefore, important that they should not be mistaken for defenceless [sic] or eatable species... since they might suffer injury, or even death, before their enemies discovered the danger or uselessness of their attack. They require some signal or danger flag which shall serve as a warning to would-be enemies...\" Wallace A.R. 1889. Darwinism. Macmillan, London. p232 Wallace predicted that birds and other predators would reject conspicuous prey whilst accepting cryptic prey. Later reports confirmed this. Animals with warning colors move slowly and expose themselves to sight. The sluggishness and exposure helps to advertise their defense. Along with the color and behavior often goes the foul smell of their chemical weapons. The grasshopper Aularches miliaris is a very good example. Noxious caterpillars often have thick, leathery cuticles which help them to resist young birds making a 'test'. When the bird takes a peck, disgusting fluid seeps out from special glands on its back. The caterpillar (or other larva) will often survive such an attack, and the young bird has learnt a lesson it will never forget.Poulton E.B. 1890. The colours [sic] of animals: their meaning and their use, especially considered in the case of insects. Kegan Paul, London. p170; p336 All in all, the predator is given good warning. Tests show that warning colors definitely do deter predators.Ruxton G.D. Sherratt T.N. and Speed M.P. 2004. Avoiding attack: the evolutionary ecology of crypsis, warning signals & mimicry. Oxford. p55 5.3 Chemical defences [sic]. Some individual animals will die or receive damage while birds or mammals on the attack learn about the connection between color and taste. However, if warning costs less than hiding, the animal benefits. And the advertising traits such as colors may serve other functions as well. The patterns may help mate identification within the species, for instance. Warning coloration is the basis of two different kinds of mimicry: Müllerian mimicry and Batesian mimicry. == Toxin resistance == There are a number of predators which eat toxic animals. Cases which have been studied suggest there is some kind of cost to be borne for their relative immunity to the toxin. The rough-skinned newt is toxic, and displays its warning color by showing its abdomen. Throughout much of the newt’s range, the common garter snake (Thamnophis sirtalis) is resistant to the toxin. In several populations, these snakes successfully prey upon the newts. Toxin resistant garter snakes are the only known animals that can eat these newts and survive. The snake’s resistance to the toxin has resulted in a selective pressure that favours newts which produce more potent levels of toxin. Increases in newt toxicity then causes a selective pressure favouring snakes with mutations conferring even greater resistance. The price paid by the snakes is that their digestion and body metabolism is slower than related species. Really resistant snakes have slower crawl speeds than snakes with little or no resistance.Really resistant snakes have slower crawl speeds than snakes with little or no resistance. Science DailyGarter snake info This is an example of co-evolution. This cycle of a predator and prey co-evolving is sometimes called an evolutionary arms race. In this case it results in the newts producing levels of toxin far in excess of what is needed to kill any other conceivable predator.Geffeney, Shana L. et al 2005. Evolutionary diversification of TTX-resistant sodium channels in a predator-prey interaction. Nature 434: 759–763. == Bright colors == Animals can, and do, show bright colors which have other functions. The most common functions are: *Identification, a secondary sex characteristic to find a mate. *Temperature regulation. *Camouflage against unusual backgrounds. However, the bright colors used for these functions tend to be different from the standard warning patterns and colors. == Unknown function == The coloring of many species has unknown function. This is usually because their life habits have not been studied sufficiently, and because no field tests have been done. One example is the moth Utetheisa pulchella, the crimson speckled moth. Its association with the plant Dittrichia viscosa, which has a somewhat unpleasant smell, suggest the moth has warning coloration, but the matter is not settled. The related species Utetheisa ornatrix, which feeds on other plants, is known to exude (squeeze out) alkaloids to put predators off. == References == Category:Coevolution Category:Ethology",
 "title": "Warning colouration"
}