{
 "id": "230822",
 "text": "A meringue () is a type of dessert made from whipping egg whites and sugar. When egg whites are beaten, some of the hydrogen bonds in the protein break. This makes the stiff texture needed for meringues. Some meringue recipes also ask for cream of tartar or cornstarch to hold it together. Meringues are often flavoured with vanilla and a small amount of almond or coconut extract. They are light, airy and sweet. == History == People do not agree whether meringue was invented in the Swiss town of MeiringenThe Oxford English Dictionary states that the French word is of unknown origin. by an Italian chef named Gasparini. They are more sure that the name meringue was first seen in 1692, in a cookbook by François Massialot.Massialot, Nouvelle instruction pour les confitures, les liqueurs et les fruits, (Paris, Charles de Sercy), 1692, noted by Muster (ref.). The word meringue was first used in English in 1706 in an English translation of Massialot's book. There are two English recipe books that have a recipe for meringue, but it is called \"white biskit bread\" in the book of recipes started in 1604 by Lady Elinor Fettiplace,John Spurling produced a three-volume, typescript transcription of Lady Fettiplace’s book (Bristol:Stuart Press) 1994, noted by Muster (ref.). or called \"pets\" in the manuscript of collected recipes written by Lady Rachel Fane.Cited in Michael Barry, Old English Recipes, (Jarrod) 1995:64f from the manuscript archived at the Centre for Kentish Studies, Maidstone, Kent. ==Type of meringue == There are many types of meringue. The usual type is dry and crisp. One type is the half-cooked type on queen of puddings, key lime pie, and lemon meringue pie. There are also uncooked meringues, and other types of meringues cooked in different ways. Cooked meringue cannot be refrigerated or it will become soggy. They will keep for at least a week if stored in an airtight container. Meringue is also used as a topping on other desserts, such as angel food cake, pavlova, and baked Alaska. ==Notes== Basic Meringue Recipe (Mary Berry) Rachel's Recipe Pantry Category:Desserts Category:French food Category:Egg dishes",
 "title": "Meringue"
}