{
 "id": "230938",
 "text": "David Crockett (August 17, 1786 – March 6, 1836) was an American frontiersman, soldier, politician, and folk hero. He is more often called Davy Crockett. He also has the nickname “King of the Wild Frontier”. He represented Tennessee in the U.S. House of Representatives from 1827 to 1831 and again from 1833 to 1835. Fighting in the Texas Revolution, he was executed in the Battle of the Alamo at the age of 49. == Childhood and family == Crockett was born in Tennessee. A replica of the cabin In which he was born stands today in Davy Crockett Birthplace State Park, in Tennessee. The Crockett family's name comes from the name Monsieur de la Croquetagne. Monsieur de la Croquetagne was a captain in the Royal Guard of French King Louis XIV.Jean-Baptiste Nadeau, Julie Barlow, The Story of French, p.106, . The family became Protestants and ran away from France in the 17th century. Crockett did not have an easy childhood. He traveled around a lot and had many of adventures. He started to hunt with his brothers before his 9th birthday. A little after he started going to school, he beat up a bully. He stopped going to school so that his teacher would not punish him. His teacher told his father that Crockett was not at school. He ran away from home so that his father would not beat him. He started moving around Tennessee, Virginia, and other places, according to a book that Crockett wrote about himself. He came back home when he was 15, and his family welcomed him. He married Mary (Polly) Finley a day before his 20th birthday. They had three children, but Polly died at a young age. He married another woman, Elizabeth Patton in 1815. They had three children, together.Banks 76. == Political career == Crockett served in the Tennessee Militia for a few years and ran for Congress in 1824. He lost his election but ran again in the next election. In 1827, he was elected to the U.S. House of Representatives. As a Representative, he became angry with President Andrew Jackson's Indian Removal Act, which forced Native Americans to leave their land. He lost his re-election in 1830. However, he ran again in 1832 and won. In 1834, he wrote a book about himself, A Narrative of the Life of David Crockett. Written by Himself.Hubbell, Jay B. The South in American Literature: 1607-1900. Durham, North Carolina: Duke University Press, 1954: 664. He lost re-election to Congress that year. == Texas Revolution == Around December 1834, Crockett told some of his friends that he might move to Texas if Martin Van Buren became the next president of the United States. The next year, he talked to his friend Benjamin McCulloch about going to Texas, which the belonged to Mexico, but some people fought in the Texas Revolution against Mexico.Cobia, 21-22. Van Buren was elected president and so Crockett left Tennessee on Nov. 1, 1835 with three other men to go to Texas and said, \"You may all go to hell and I will go to Texas.\" He arrived in Nacogdoches, Texas, in early January 1836. On January 14, 1836, Crockett and 65 other men signed an oath before Judge John Forbes to the Provisional Government of Texas for six months that said, \"I have taken the oath of government and have enrolled my name as a volunteer and will set out for the Rio Grande in a few days with the volunteers from the United States.\" Each man was promised about 4,600 acres (19 km²) of land. He showed up at the Alamo on February 8, where over 100 other men were there. On February 23, a Mexican army, led by General Antonio López de Santa Anna, surrounded the Alamo and was ready to take it over.Edmondson (2000), p. 299.Todish et al. (1998), p. 40. After the Mexican army had been there for eight days, 32 other men showed up to help Crockett and the other men defend the Alamo. On March 6, according to Susana Dickinson, before running to his post, Crockett stopped in the chapel to pray.Edmondson (2000), p. 363. When the Mexican soldiers made it over the walls of the Alamo, they pushed the few remaining defenders back toward the church.Edmondson (2000), p. 368. The Battle of the Alamo lasted almost 90 minutes.Petite (1998), p. 114. All of the men defending the Alamo died, including Crockett. ==Legacy== Even while he was still alive, many books and plays were written about Crockett's life, some of which stretched the truth. Since his death, he has become a popular figure in American folklore. In the 1950s, there was a television show about him with a song called \"The Ballad of Davy Crockett,\" which was very popular. Many children wore \"coonskin\" hats to look like him. == Footnotes == == References == * * * * * * * == Other websites == * * * Category:1786 births Category:1836 deaths Category:Executed American people Category:United States representatives from Tennessee Category:American autobiographers Category:Writers from Tennessee Category:People from Lynchburg, Tennessee Category:American frontiersmen and women",
 "title": "Davy Crockett"
}