{
 "id": "231010",
 "text": "\"Avalon\" is a popular jazz song. It was written by Al Jolson, Buddy DeSylva and Vincent Rose in 1920. It was first recorded by Jolson and used in the musicals Sinbad and Bombo. Jolson's version became #2 on the American singles chart. It is possible that Rose wrote the song alone, and that Jolson's name was used in the credits because he was a popular artist and helped make the song popular. At first only Rose and Jolson were marked as the writers, and DeSylva's name was added later. Many jazz artists have recorded the song, for example Cab Calloway (1934), Coleman Hawkins (1935) and Eddie Durham (1936). Benny Goodman played the song in his concert in Carnegie Hall in 1938. The song was also played in the films The Jolson Story (1946) and The Benny Goodman Story (1956). The melody at the beginning of the song was taken from Giacomo Puccini's opera Tosca, and Rose changed it only a little. Because of this, a court later decided that Jolson and Rose had to pay Puccini's publishers $25,000 and all later profits from the song. == Versions == *Red Nichols and His Five Pennies (27 February 1928) *George Monkhouse and his Cambridge University Quinquaginta Ramblers (12 March 1930) *Spike Hughes and his Dance Orchestra (23 May 1930) *Joel Shaw and his Orchestra (August 1932) *Billy Cotton and his Band (21 July 1933) *Casa Loma Orchestra (16 August 1934) *Cab Calloway and his Orchestra (4 September 1934) *Scott Wood and his Six Swingers (18 December 1934; 1 September 1936) *Joe Venuti and his Orchestra (26 December 1934) *KXYZ Novelty Band (29 January 1935) *Coleman Hawkins (2 March 1935) *Quintette of the Hot Club of France (July 1935) *Jimmie Lunceford and his Orchestra (30 September 1935) *Harry Roy and his Orchestra (8 November 1935) *Val Rosing and his Swing Stars (18 November 1935) *Ballyhooligans (7 July 1936) *Benny Goodman Quartet (29 June 1937; 28 September 1937; 16 January 1938) *Joe Daniels and his Hotshots (28 September 1937) *Alix Combelle et son Orchestre (4 October 1937) *Harry James and his Orchestra (13 July 1939; 8 November 1939) *Willie Lewis and his Negro Band (27 June 1941) ==Notes== Category:1920 songs Category:Jazz songs",
 "title": "Avalon (song)"
}