{
 "id": "231084",
 "text": "Wrongful life is a legal action in which someone is sued for not stopping the birth of a severely disabled child. In this type of lawsuit a child and the parents will sue a doctor or a hospital. The doctor or hospital is sued for not giving information about the disability during the pregnancy. The doctor or hospital may have not provided all the information on a genetic case before the pregnancy. The parents argue that if the mother had known this information, she would have had an abortion, or chosen not to become pregnant at all. In the past, only parents could sue for their own damages the occurred as a result of the birth of a disabled child (e.g., the mother's own pregnancy medical bills and cost of psychiatric treatment for both parents' emotional distress resulting from becoming aware that their child was disabled). This cause of action is known as wrongful birth. But the child could not sue for his or her own damages, which were often much more in terms of money and harm. In four U.S. states, the child is allowed to start a wrongful life cause of action for damages. In 1982, the Supreme Court of California was the first state supreme court to permit the child's right to sue for wrongful life, but in the same decision, limited the child's recovery to special damages.Turpin v. Sortini, 31 Cal. 3d 220 (1982). Most other jurisdictions, including EnglandMcKay v. Essex Area Health Authority, [1982] 1 QB 1166. and Ontario,Bovingdon v. Hergott, 2008 ONCA 2, 290 D.L.R. (4th) 126. have not allowed the wrongful life cause of action. ==Related pages== *Wrongful birth *Wrongful abortion *Bioethics == References == == Further reading == * Appel, Jacob M. Physicians, Wrongful Life and the Constitution, Medicine & Health, Rhode Island Volume 87, Number 2. February 2004. Retrieved October 28, 2008. == Other websites == *Sydney Morning Herald article from May 2004 *Article on wrongful life in the Cornell Law Review. Category:Abortion Category:Law",
 "title": "Wrongful life"
}