{
 "id": "231146",
 "text": "Kingsport is a city in Hawkins and Sullivan counties in the U.S. state of Tennessee. Most of the city is in Sullivan County. Kingsport is the biggest city in each county but it is not the county seat of either. As of the 2020 census its population was 55,442. The name is based on \"King's Port\" which referred to the area around Ross's Landing. It is part of what is known as the \"Mountain Empire,\" which includes a portion of southwest Virginia and the mountainous counties in Tennessee to the east. Pal's Sudden Service, a regional fast-food restaurant chain, opened its first location in 1956 and is headquartered in Kingsport. In 2001, Pal's Sudden Service, won the Malcolm Baldrige National Quality Award, becoming the first restaurant company to receive the award.Reuters: Pal's Sudden Service Shares Secret of its Success ==Geography== Kingsport is located at (36.536851, -82.542123) where U.S. highways 11 and 23 meet. Kingsport is also the starting and ending point of Interstate 26. According to the United States Census Bureau, the city has a total area of 53.5 square miles (138.6 km²), of which, 52.6 square miles (136.2 km²) of it is land and 0.9 square miles (2.4 km²) of it (1.72%) is water. ==Education== People who live in Kingsport use the Kingsport City Schools public school system. The system has eight elementary schools, two middle schools, and one high school. Kingsport is also home to eight private academies. The city is also part of Sullivan county which has 2 other high schools in Kingsport. While no college or university houses its main campus within the city, Northeast State Community College, East Tennessee State University, and University of Tennessee have branch campuses in Kingsport. ===Neighborhoods=== There are several neighborhoods located within or just outside of Kingsport, offering different ways of living: * Allandale * Amersham * Bloomingdale * Borden Village * Carter's Valley * Cliffside * Colonial Heights * Cooks Valley * Downtown * Edinburgh * Fairacres * Fort Robinson * Gibson Town * Green Acres * Highland Park * Hillcrest * Huntington Hills * Indian Springs (Fall Creek & Airport) * Litz Manor * Lynn Garden * Malabar Heights * Meadowview * Midtown * Morrison City * Orebank * Preston Forest * Preston Hills * Ridgefields * Riverfront * Riverview * Rock Springs * Sevier Terrace * Sullivan Gardens * Tellico Hills * White City ==Notable people== *Lisa Alther, author, born and grew up in Kingsport * Edward L. Ayers, Bancroft Prize-winning historian and ninth president of the University of Richmond, raised in Kingsport * Barry Bales, Grammy Award-winning musician with Alison Krauss and Union Station * Fredrick 'Pal' Barger, founder of Pal's Sudden Service * James F. Barker, president of Clemson University (1999–2013) * Nick Castle, actor who played Michael Myers in the original Halloween, was born in Kingsport and makes appearances at the local haunted houses. * Jeff Chapman-Crane, Appalachian artist * Harry Coover, inventor of Super Glue * Denny Crawford, professional football player * Amy Dalley, country music artist * Bobby Dodd, College Football Hall of Fame inductee as both a football player (University of Tennessee) and coach (Georgia Institute of Technology) * Bobby Eaton, professional wrestler * Elle and Blair Fowler, online beauty retailers who spent part of their childhoods in Kingsport * Daniel Kilgore, professional football player, Kansas City Chiefs * Cliff Kresge, Nationwide Tour golfer who splits his time between homes in Kingsport and Florida * Hal Lawton, President & CEO of Tractor Supply, graduate of Sullivan South High School * Blake Leeper, Paralympic silver medallist * Cripple Clarence Lofton, noted boogie-woogie pianist and singer, born in Kingsport * Matt Mahaffey, musician, frontman of pop/rock band Self * Brownie and Stick McGhee, brothers and blues musicians, grew up in Kingsport and other East Tennessee towns * Ken Mellons, country music artist * John Palmer, former NBC News correspondent, born in Kingsport and a graduate of Dobyns-Bennett High School * Jimmy Quillen, member of the U.S. House of Representatives from Tennessee's 1st congressional district (1963–1997) * John Shelton Reed, sociologist and essayist, author or editor of eighteen books, most of them dealing with the contemporary American South * Selwa Showker \"Lucky\" Roosevelt, Chief of Protocol of the United States from 1982-1989 and former journalist for the Washington Post, married Archibald B. Roosevelt, grandson of President Theodore Roosevelt * Coty Sensabaugh, cornerback for the Pittsburgh Steelers * Gerald Sensabaugh, retired NFL cornerback, played for the Jacksonville Jaguars and the Dallas Cowboys * LeRoy Sprankle, high school multi-sport coach, author, and general manager of the Canton Independents * Adam Steffey, bluegrass artist * Bill Streever, biologist and author * Cyrus Thomas, entomologist and ethnologist * Steven Williams, actor who starred in 21 Jump Street and The Blues Brothers * Charles Wright, poet who spent part of his childhood and adult life in Kingsport ==Sports== The Kingsport Axman of the Appalachian League, a rookie-level league, play in the city. The team has competed in the city since 1969, with the exception of 1983. The Mets play in Hunter Wright Stadium named after Mayor Hunter Wright. Previously the team was known as the Kingsport Mets. Their name changed in 2020. ==References== ==Further reading== * Long, Howard. Kingsport: A Romance of Industry. Overmountain Press (October 1993) * Spoden, Muriel Millar Clark. The Long Island of the Holston: Sacred Island of the Cherokee Nation. ASIN: B0006WOGAM * Wolfe, Margaret Ripley. Kingsport Tennessee: A Planned American City. University Press of Kentucky (November 1987) ==Other websites== * * DiscoverKingsport.com : Historical Research Kingsport TN * Kingsport City Schools * Kingsport Times-News * Kingsport Daily News * Kingsport Chamber of Commerce Category:Cities in Tennessee Category:1822 establishments in the United States Category:19th-century establishments in Tennessee Category:Tri- Cities, Tennessee Category:Sullivan County, Tennessee Category:Washington County, Tennessee",
 "title": "Kingsport, Tennessee"
}