{
 "id": "23179",
 "text": "The Ford Motor Company (FMC; often known as Ford) is an American multinational automaker, founded on June 16, 1903 by Henry Ford. Ford, which owns the luxury vehicle manufacturer Lincoln, was the second-largest automaker, after General Motors, 1931 to 2004. Formerly, Ford also owned the following brands: * Mercury (1939–January 2011; discontinued) * Aston Martin (1987–March 2007) * Mazda (owned a 33.4 % controlling-stake in Mazda 1996 to November 2008) * Jaguar (1989–June 2, 2008; sold to Tata Motors) * Land Rover (May 2000–June 2, 2008; sold to Tata Motors) * Volvo (1999–2010; sold to Geely) * Ford Transit (1978 circa - 1988; sold at Greco Franco) == History == In 1896, Henry Ford had an idea to make a Quadricycle, the first \"horseless carriage\" he built. This four-wheeled vehicle was very different from cars we drive now. It was very different even from vehicles Ford produced just a few years later. Even so, this was the start of Ford's career as a businessman. Until the Quadricycle, Ford's work had been experimental and theoretical. For example, in the 1890s, Ford built a gas engine on his kitchen table — just an engine with nothing to power. Enough people liked the Quadricycle, and much could be done with the it, so it led to the beginning of Ford's business. Ford Motor Company started on June 16, 1903, when Henry Ford and 11 business helpers signed papers to form the company. Their first Ford production car, the Model A, was sold in Detroit, Michigan a few months later. (This Model A should not be confused with their more famous Model A, which came out in 1927). With $280,000 (around 165 000 pounds), the early businessmen made what was to become one of the world's largest companies. Few companies changed the history and development of industry and society in the 20th century as much as Ford Motor Company. === Mass production on the line === Ford Motor Company's most important contribution to automotive manufacturing was the (moving) assembly line. First implemented at the Highland Park plant (in Michigan, US) in 1913, this new method let each workers to stay in one place, to do the same job repeatedly as the vehicles went by on the assembly line. The line proved to be very efficient; it helped the company make more cars, and make them cheaper than other car companies could do at the time. Before using the assembly line, Ford made 12,000 Model T's in a year. With the assembly line, Ford could make 12,000 Model T's in just two days. Ford had discovered how to make more cars that more people could afford to buy. He even paid his workers higher salaries than other car companies and still made money. === Early growth === Henry Ford insisted that the company's future lay in the production of affordable cars for a mass market. In 1903, the company began using the first 19 letters of the alphabet to name new cars. In 1908, the Model T was born, and it was sold for 19 years. By selling 15 million Model T's, Ford Motor Company became a giant company which spanned the globe. They built plants in the Soviet Union, Japan and other places. Ford started making farm tractors, trucks and school buses. In 1925, Ford Motor Company bought the Lincoln Motor Company. It uses that name to build luxury cars. In the 1930s, the name \"Mercury\" was given to its mid-priced cars. Ford Motor Company was growing. == Former production vehicles == === 1900–1929 === Name Image Model A 1903-1904 Model B 1904–1906 Model C 1904–1905 Model F 1905–1906 Model K 1906–1908 Model N / R / S 1906–1909 Model T 1908–1927 Model A (1927) 1927–1931 Model TT 1925–1927 Model AA 1927–1931 === 1930–1939 === Name Image Model B / BB / 18 / 40 1932–1934 Model Y 1932–1937 Köln 1932–1935 Rheinland 1933–1936 Model 48 1935–1936 Model C Ten 1935–1937 Eifel 1935–1939 Ford CX 1935–1937, UK 1937 1937–1940 7W 1937–1938, UK 7Y 1938–1939, UK Prefect 1938–1961 Anglia 1939–1967 Taunus 1939–1994 Fordson E83W 1938–1957 === 1940–1949 === Name Image 1941 1941–1942 1946–1948 Vedette 1948–1954 Pilot 1947–1951 1949 1949–1951 Custom 1949–1981 ;Notes === 1950–1959 === Name Image 1952 1952–1954 1955 1955–1956 1957 1957–1959 Consul 1951–1962 1972–1975 Country Sedan 1952–1974 Country Squire 1950–1991 Courier 1952–2013 Crestline 1950–1951 Del Rio 1957–1958 Escort (100E) 1955–1961 Fairlane 1955–1970 Galaxie 1959–1974 Mainline 1952–1956 Parklane 1956 Popular 1953–1962 Ranchero 1957–1979 Squire 1955–1959 Thunderbird 1955–1997 2002–2005 Versailles 1954–1957 Zephyr 1950–1971 C Series 1957–1990 FK 1951–1961 ;Notes === 1960–1969 === Name Image 1960 1960–1964 Falcon 1960–1970 Falcon 1960–2016 E-Series / Econoline 1961–2014 Cortina 1962–1982 Fairlane Thunderbolt 1964 GT40 1964–1969 Corsair 1964–1970 LTD 1965–1986 Fairmont 1965-2008 P7 1967-1972 Fairlane 1967–2007 Torino 1968–1976 Capri (coupe) 1968–1986 Corcel 1968–1986 Escort 1968–2000 N-Series 1962–1969 D-Series 1965-1981 W-Series 1966–1977 ;Notes === 1970–1979 === Name Image Maverick 1970–1979 Pinto 1971–1980 P100 1971–1993 Granada 1972–1994 Landau 1971–1983 Landau 1973–1976 Elite 1974–1976 Granada 1975–1982 Fiesta 1976–2023 Fairmont 1978–1983 Durango 1979–1982 Econovan / Spectron 1977–1999 L-Series 1970–1998 Transcontinental 1975-1984 CL-Series 1978-1991 ;Notes === 1980–1989 === Name Image Capri 1989–1994 Del Rey 1981–1991 Escort 1981–2003 EXP 1982–1988 Festiva 1988–1992 Laser 1980–2003 LTD Crown Victoria 1980–1991 Orion 1983–1993 Probe 1989–1997 RS200 1984–1986 Scorpio 1985–1999 Sierra 1982–1992 Telstar 1983–1999 Taurus 1985–2019 Tempo 1984–1994 Verona 1989–2000 Maverick 1988–1994 Bronco II 1984–1990 Aerostar 1986–1997 Cargo 1982–2019 N-Series 1982–1997 Bantam 1983–2011 Pronto 1985–2007 ;Notes === 1990–1999 === Name Image Aspire 1993–1997 Contour 1995–2000 Cougar 1999–2002 Crown Victoria 1992–2011 Ka 1996–2021 Puma (coupe) 1997–2002 Ikon 1999–2015 Focus 1998–2020 Raider 1991-1997 Maverick 1993–1999 Explorer 1994–2003 Freda 1995 Galaxy 1995–2023 100px Windstar 1995–2003 ;Notes === 2000–2009 === Name Image Activa 2003 GT 2004–2022 Five Hundred 2005–2007 Fusion 2006–2020 Excursion 2000–2005 Escape 2001–2008 EcoSport 2003–2022 Territory 2004–2016 Freestyle 2005–2007 Taurus X 2008–2009 Flex 2009–2019 Fusion 2002–2012 i-Max 2007–2011 C-Max 2003–2019 Freestar 2003–2007 S-Max 2006–2023 Explorer Sport Trac 2001–2010 LCF 2006–2009 ;Notes === 2010–2019 === Name Image Escort 2015–2023 Focus Electric 2012–2019 Figo 2010–2021 Taurus 2015–2022 B-Max 2012–2017 Grand C-Max 2010–2019 C-Max 2013–2019 ;Notes == Current production vehicles == Body style Model Current generation Current generation Current generation Vehicle description Image Name(s) Introduction ( year) Introduction ( year) Facelift Main markets Hatchback Focus 1998 2018 2021 Europe C-segment / small family compact hatchback predominantly sold in Europe. Expected to be discontinued in 2025. Sedan Mondeo/ Taurus 1992 2022 — China and Middle East D-segment/Large family/mid-size sedan and liftback currently marketed in China. Marketed as the Taurus in the Middle East. Station wagon Focus 1998 2018 2021 Europe Station wagon version of the Focus. Sports car Mustang 1964 2022 – Global Long-running pony/muscle car. Available in coupé and convertible body styles. SUV/ crossover Bronco 1965 2020 — Americas, Europe and Middle East Off-road oriented mid-size body-on-frame SUV. Available in three-door and five-door configurations. Bronco Sport 2020 2020 — Americas and Middle East Retro-styled compact crossover SUV using the Bronco nameplate. Capri EV 2024 2024 — Europe Battery electric C-segment/compact crossover for the European market, based on the Volkswagen Group MEB platform. Edge 2006 2023 — China D-segment/Mid-size crossover marketed in China and manufactured by Changan Ford. Equator 2021 2021 2024 China Three-row mid-size crossover marketed in China and manufactured by JMC-Ford. Escape 2000 2019 2022 Americas, Europe, Australasia C-segment/compact crossover SUV marketed globally. Escape (global nameplate) and Kuga (Europe) was a separate model up to 2012 when the model was merged. Hybrid and plug-in hybrid powertrains are optional. Kuga 2008 Everest 2003 2022 — Asia-Pacific, Africa and Middle East Mid-size body-on-frame SUV based on the Ranger. Expedition 1996 2025 — Americas and Middle East Full-size body- on-frame SUV. Also available with a longer body variant called the Expedition Max. Explorer 1990 2019 2022 Americas, Europe, Middle East and Asia Three-row mid-size crossover SUV. Also available as a police fleet vehicle called the Police Interceptor Utility. Hybrid and plug-in hybrid powertrains are optional. Explorer EV 2024 2024 — Europe Battery electric compact crossover for the European market, based on the Volkswagen Group MEB platform. Mondeo Sport 2021 2021 — China Low-slung mid-size crossover marketed in China and manufactured by Changan Ford. Marketed as the Ford Evos before 2024. Mustang Mach-E 2020 2020 — Global Battery electric compact crossover using the Mustang nameplate. Puma 2019 2019 2024 Europe and Australasia B-segment/subcompact crossover SUV based on the Fiesta marketed in Europe and Australasia. Territory / Equator Sport 2018 2022 2024 Asia, Africa, Middle East and South America Compact crossover SUV manufactured by JMC-Ford joint venture in China, and exported to emerging countries. Pickup truck F-Series 1948 2020 2023 Americas and Middle East Full-size pickup truck mainly marketed in North America. Historically the best-selling vehicle in the United States (since 1977) and Canada. Line-up includes the F-150 pickup, F-250 through F-450 Super Duty heavy duty pickups. F-450/550 Super Duty class 4-5 trucks and F-650/750 Super Duty class 6-8 trucks are commercial chassis and cab vehicles. F-150 Lightning 2022 2022 — North America and others Battery electric version of the fourteenth-generation Ford F-150. Ranger 1981 2022 – Global Mid-size pickup truck sold globally. Available in single cab (except North America), space cab, and double cab configurations. Maverick 2021 2021 — Americas Compact pickup truck sold in North America and South America. Based on a front-wheel-drive unibody platform shared with the Escape and Bronco Sport. Transit 1965 2013 2020 Europe and Australasia Pickup version of the Transit van. MPV/ minivan Tourneo Courier 2014 2022 — Europe Passenger version of the Transit Courier. Tourneo Connect 2002 2021 — Europe Three-Row Compact MPV. Rebadged Volkswagen Caddy. Tourneo Custom 2012 2022 — Europe Passenger version of the Transit Custom marketed in Europe. Van Transit Courier 2014 2023 — Europe and others Small van based on Fiesta platform mainly marketed in Europe. Available as a four-door or five-door van. The passenger-focused leisure activity vehicle version is called the Tourneo Courier. Transit Connect 2002 2022 — Europe and others Compact van based on Focus platform mainly marketed in Europe and North America. Available as a four-door or five-door van. The passenger-focused leisure activity vehicle version is called the Tourneo Connect. Transit Custom 2012 2022 — Europe and others Mid-size van mainly marketed in Europe, Australasia and China. Available as a four-door or five- door van. The passenger-focused leisure activity vehicle version is called the Tourneo Custom. A campervan version is called the Transit Custom Nugget. Transit 1965 2013 2020 Global Full-size, rear-wheel-drive van. Available as a cargo van, passenger van, chassis cab, and cutaway van. Heavy commercial vehicles F-MAX 2018 2018 — Europe Heavy-duty truck developed and manufactured by Ford Otosan in Turkey. Sold in China as the JMC Weilong HV5. Transit Cutaway 1965 2013 2020 Europe, North America and others Cutaway version of the Transit van. E-Series Cutaway 1975 1992 2021 North America A cutaway version of the E-Series. F-Series 1948 2015 2020 North America Commercial medium-duty and heavy-duty trucks derived from the smaller F-Series pickup trucks. Super Duty 1999 2023 — North America Chassis-cab versions of the Super Duty pickups. ==References== Category:Automobile brands Category:Ford Category:1903 establishments in the United States Category:Companies based in Michigan Category:1900s establishments in Michigan Category:Dearborn, Michigan",
 "title": "Ford Motor Company"
}