{
 "id": "231958",
 "text": "Osteogenesis imperfecta is a genetic disorder. It is commonly called brittle bone disease. It is usually an autosomal dominant disease, which means a person can get it if only one of their parents has the abnormal gene. OI affects the part of the bones called the collagen rod, which provides bone strength. The abnormal gene weakens or even destroys the collagen rod. This disease was first identified by Vrolik in 1849.Wilson, Jennifer F. \"Osteogenesis Imperfecta.\" Gale Encyclopedia of Genetic Disorders. Canada, 2002. Print. When someone has this disease, their bones are more likely to break. Unfortunately, osteogenesis imperfecta has no cure.\"Osteogenesis imperfecta.\" World of Health. Gale, 2007. Student Resources in Context. Web. 23 Feb. 2016. This disease is categorized in four types: Type one is the most common case and it often causes brittle teeth and bone related injuries. Type two is a more severe version of type one and has most of the same symptoms just in more severe cases. People with type three of osteogenesis imperfecta may have more than 100 fractures before puberty. Their eyes often develop a purple, blue, or grey tint and people with this case also often have hearing loss. 50% of people that have osteogenesis imperfecta have hearing loss while becoming an adult. Type 4 is a more severe case of most symptoms stated above.Galenet.galegroup.com,. \"Password Logon Page\". N. p., 2016. Web. 22 Feb. 2016 == Symptoms == Less severe symptoms of OI may include: *easily broken bones *loose joints *low muscle tone *blue, purple or grey color to the normally white part of the eyes *triangular shape of face *tendency to develop scoliosis *brittle teeth OI has many other serious and fatal symptoms including respiratory problems and bone deformity. == Demographics == OI occurs equally in both male and females and can affect all ethnic groups. OI happens in the womb and there is no cure. It is usually discovered when someone breaks a lot of bones; they may have DNA testing to check for OI. It occurs in 1 in 20,000 births. == References == Category:Genetic disorders Category:Diseases and disorders of bones",
 "title": "Osteogenesis imperfecta"
}