{
 "id": "232073",
 "text": "Boris Spassky (30 January 1937 - 27 February 2025) was a Soviet–French chess grandmaster. He was the tenth World Chess Champion, holding the title from late 1969 to 1972.Hooper D. & Whyld K. 1992. The Oxford companion to chess. Oxford University Press, Oxford.p381 Spassky won the USSR Chess Championship twice outright (1961, 1973), and twice more lost in playoffs (1956, 1963). He was a World Chess Championship candidate on seven occasions (1956, 1965, 1968, 1974, 1977, 1980, and 1985). He was born in Leningrad. Boris won the Candidates match series in 1965 and 1968. He played for the world championship three times. Against Tigran Petrosian in 1966 he lost; against Petrosian again in 1969 (winning), and against Bobby Fischer in 1972 (losing). The match with Fischer in Reykjavik was the most publicised chess match of any time. His loss was subjected to the most rigorous scrutiny by the Soviet central committee for chess, and he was criticised for lack of adequate preparation. The second half of his life until recently was lived in France. He has both Russian and French nationality. == Later life == On 1 October 2006, Spassky suffered a minor stroke during a chess lecture in San Francisco. On 23 September 2010, ChessBase reported that Spassky had suffered a more serious stroke that had left him paralyzed on his left side. After that he returned to France for a long rehabilitation programme. On 16 August 2012, Spassky left France to return to Russia under disputed circumstances. He lived in an apartment in Moscow. Spassky died on February 27, 2025 in Moscow at the age of 88. == Further reading == * Cafferty, Bernard 1969. Spassky's best games. Batsford. * Winter, Edward G. 1981. World chess champions. * Seirawan, Yasser 1997. No regrets: Fischer-Spassky International Chess Enterprises. * Edmonds, David and Eidinow, John 2004. Bobby Fischer Goes to War: how the Soviets lost the most extraordinary chess match of all time. Ecco. * Garry Kasparov 2004. My great predecessors, part III. Everyman Chess. == References == Category:Russian chess players Category:French chess players Category:1937 births Category:2025 deaths Category:People from Saint Petersburg Category:Chess grandmasters Category:Soviet chess players",
 "title": "Boris Spassky"
}