{
 "id": "232167",
 "text": "{{Infobox Writer | name = Christopher Hitchens | image = Christopher Hitchens crop.jpg | caption = Christopher Hitchens, 2007 | pseudonym = | birth_name = Christopher Eric Hitchens | birth_date = | birth_place = Portsmouth, Hampshire, England | death_date = 15 December 2011 (aged 62) | death_place = Houston, Texas, United States | occupation = Author, journalist, activist, pundit | alma_mater = Balliol College, Oxford | nationality = British, American | period = | genre = Polemicism, journalism, essays, biography, literary criticism | signature = | website = }} Christopher Eric Hitchens (13 April 1949 – 15 December 2011) was an Anglo-American atheist, writer and debater. He wrote for various magazines including The Nation, Free Inquiry, Slate, and others. He was a supporter of the philosophical movement humanism. Hitchens was educated at Balliol College, Oxford. After graduation in 1970, he became a magazine writer. In 1982, he moved to Washington, D.C. In 1988, he learned from his grandmother that his mother was Jewish, but had kept her religion a secret. Hitchens remained an atheist and did not adopt any religious faith. He did not write about his religious views until his 2007 book God Is Not Great: How Religion Poisons Everything. Hitchens tried to write from first-hand experience. To write his essays, he braved gunfire in Sarajevo, he was jailed in Czechoslovakia, and in 2008, he was brutally beaten in Beirut, Lebanon. In 2009, Hitchens agreed to be waterboarded. He wrote in Vanity Fair magazine, \"If waterboarding does not constitute torture then there is no such thing as torture\". Hitchens died of oesophageal cancer. == Books by Hitchens == * 1984 Cyprus. Quartet. Revised editions as Hostage to history: Cyprus from the Ottomans to Kissinger, 1989. * 1988 Blaming the Victims: spurious scholarship and the Palestinian question. (contributor, and co-editor with Edward Said) Verso, * 1990 The Monarchy, Chatto & Windus * 1990 Blood, class and nostalgia: Anglo-American ironies, Farrar Straus & Giroux. * 1995 The missionary position: Mother Teresa in theory and practice, Verso * 1997 The Parthenon marbles: the case for reunification, Verso * 1999 No one left to lie to: the values of the worst family, Verso * 2000 Unacknowledged legislation: writers in the public sphere, Verso * 2001 The trial of Henry Kissinger. Verso. * 2001 Letters to a young contrarian, Basic Books * 2002 Why Orwell matters also Orwell's Victory, Basic Books, * 2004 Love, poverty, and war: journeys and essays, Thunder's Mouth, Nation Books. * 2005 Thomas Jefferson: author of America. Eminent Lives/Atlas Books/HarperCollins Publishers, * 2007 Thomas Paine's Rights of Man: a biography. Atlantic Monthly Press, * 2007 The Portable Atheist: essential readings for the non-believer. (Editor) Perseus Publishing. . * 2007 God is not great: how religion poisons everything, Twelve/Hachette Book Group USA/Warner Books, / Published in the UK as God is not great: the case against religion, Atlantic Books, . * 2008 Christopher Hitchens and his critics: terror, Iraq and the Left. (with Simon Cottee and Thomas Cushman), New York University Press * 2008 Is Christianity good for the world?—A Debate (co-author, with theologian Douglas Wilson). Canon Press. . * 2010 Hitch-22: a memoir, Twelve. * 2011 Arguably: essays by Christopher Hitchens. Twelve. UK edition as Arguably: selected prose, Atlantic, / * 2012 Mortality. Twelve, / . Atlantic Books, / ==References== ==Other websites== *The Christopher Hitchens Web * Category:American activists Category:American atheists Category:American journalists Category:British activists Category:British atheists Category:Cancer deaths in Texas Category:Deaths from esophageal cancer Category:English journalists Category:Humanists Category:Democratic socialists Category:Writers from Portsmouth Category:1949 births Category:2011 deaths",
 "title": "Christopher Hitchens"
}