{
 "id": "232437",
 "text": "The Boeing 707 is a jet airliner. It was made by Boeing Commercial Airplanes from 1958 until 1979. It only has two rows of seats, which means it is a narrow-body plane. It also has four engines. The name is often said as \"Seven Oh Seven\". There are many different types of 707, and they can hold from 140 to 189 passengers.\"Tech data sheet at Boeing.com\" They can also fly from .Best source for range is http://www.boeing.com/commercial/airports/acaps/707sec3.pdf, which shows 2800 nm for a 707-120B with maximum payload and 5750 nm for a −320B with zero payload. It doesn't include a graph for the −120, for which range would be 2500 nm or less with full payload. The Boeing 707 was Boeing's first jet airliner. It was the most common plane in the 1960s and it was still used a lot during the 1970s. The 707 was the first jet to have a lot of passengers fly on it.Wilson, p. 13. Quote: \"The Boeing 707, the airliner which introduced jet travel on a large scale.\"Wilson 1999, p. 48. Quote: \"The USA's first jetliner, the 707 was at the forefront of jet travel revolution...\" The 707 was not the first jet airliner, but it was the first one to make a lot of money. It made Boeing one of the biggest makers of airliners. It also started the group of planes with \"7x7\" names. The Boeing 727, Boeing 737 and Boeing 757 have some parts of the 707's design. The 707's design came from the Boeing 367-80, which was a prototype jet. The very first 707, the 707-120, had Pratt & Whitney JT3C turbojet engines. Pan American World Airways started using the 707 on October 26, 1958. Other types of 707 are the 707-138 and the 707-320. Both of these started being used in 1959. A smaller version, the Boeing 720, was made in 1960. The 707-420 had Rolls-Royce Conway 508 turbofan engines. It was made in 1960. The 707 has been used for many different types of flights. Versions of the 707 used by militaries are the E-3 Sentry, KC-135 Stratotanker, and the C-137 Stratoliner. Boeing made 1,011 707s (including the 720). More than 800 military planes were made. In August 2011, 10 707s were being used by airlines. By August 2012, there were only two. ==Designing== ===Model 367-80=== During World War II, and after it, Boeing was known for its military planes. Boeing had made very important bombers, like the propeller B-17 Flying Fortress and B-29 Superfortress and the jet B-47 Stratojet and B-52 Stratofortress. However, Douglas and other companies were far ahead of Boeing in the airliner market. The only successful airliners Boeing made before the 707 were the Boeing 314 Clipper and Boeing 307 Stratoliner. During 1949–1950, Boeing started looking at jets. Back then, aerial refueling (when a plane can get more fuel while flying) was being used a lot. The United States Air Force had ordered 800 KC-135 Stratotankers. Since planes were beginning to use jet engines, the USAF needed a jet tanker. Boeing looked at many wing designs and engines for the new tanker. Eventually, it chose the 367–80. The \"Dash 80\" took less than two years to make. It first took off on July 15, 1954. It had Pratt & Whitney JT3C engines. Nobody knew if the 707 would make money. Back then, Boeing was making almost all of its money from military planes. The last airliner it made, the Boeing 377 Stratocruiser, lost the company $15 million before the United States Air Force bought some and called them the KC-135 Stratotanker.\"Gamble in the Sky.\" Time, July 19, 1954. Retrieved December 27, 2009. In a demonstration flight over Lake Washington outside of Seattle, on August 7, 1955, test pilot Tex Johnston performed a barrel roll in the 367-80 prototype. The Dash 80 was wide. This meant that it was wide enough to have two seats on each side of the plane. Boeing decided to make it wide.Francillon 1999, p. 34 However, Douglas had made the DC-8, which was wide. Because of this, Boeing made the 707 wider again, so it was wide. ===Making and testing=== The first flight of the 707 happened on December 20, 1957. The FAA allowed it to fly on September 18, 1958. ===More changes=== The very first type of 707 was the 707-120. Qantas ordered a shorter version, which was called the 707-138. The -138 could fly for as long as Qantas needed. Braniff International Airways ordered a version with Pratt & Whitney JT4A engines. This version was called the 707-220. Even though the 707 should have had turbojet engines, the Pratt & Whitney JT3D was used the most. The JT3D was a turbofan engine. The last type of 707 was the 707-320C (C means \"Convertible\"). It had a big door for cargo. It also had a better wing. Boeing stopped making passenger 707s in 1978. 1,010 707s were made for airlines, but a lot of these went to militaries. Boeing made military 707s until 1991. ==Design== ===Wings=== The 707's wings are swept back at 35 degrees. This means that the wings are not straight lines. Boeing made a yaw damper for swept-wing planes, which was needed because swept-wing planes move strangely if there is not a yaw damper. On one flight, the yaw damper was switched off to give the new pilots some more experience with the plane. One pilot made a bad move, and the plane went out of control. Three of the engines were ripped off of the wing. The plane crashed near Seattle at Arlington, Washington. Four people on board died.Accident description at the Aviation Safety Network In his autobiography, Tex Johnston said he was flying on a 707 and he thought that there was something wrong with the yaw damper, because the plane was moving strangely. He went to the cockpit and helped fix the plane.Johnston, A.M., Tex Johnston: Jet-Age Test Pilot, Smithsonian Books, December 2000, p. 247. . ===Engines=== The 707 used air from the engines to pressurize the cabin. The P&W; JT3D-3B engines have special doors which open when the plane is taking off. The doors help to give more air to the engines. The doors close when the plane is in the air. ====Better engines==== Pratt & Whitney decided to make the JT8D-219 the new engines for planes made from the Boeing 707. A lot of these are for military planes which were designed from the Boeing 707. ==History== The first orders for the 707 happened on October 13, 1955. Pan Am ordered 20 707s. There was a lot of competition between the 707 and the Douglas DC-8. A lot of big airlines only used the DC-8. Boeing decided to make some more changes to the 707's wing so that it could fly further. The new version was called the 707-320. Pan Am was the first airline that used the 707. The plane's first flight was from New York to Paris on October 26, 1958. It stopped for fuel in Gander, Newfoundland. Qantas was the first airline from outside the United States to use the 707. The 707 became a very popular jet airliner. It helped air travel grow a lot. Air traffic control was also upgraded.\"Jets Across the U.S.\" Time, November 17, 1958. Retrieved December 27, 2009. At the end of the 1960s, the 707 was too small to fly all the passengers that wanted to fly. Boeing made the Boeing 747 because of this. The 707's engines were also too old. During the Falklands War the Argentine Air Force used 707s to patrol. Some of them were caught by Royal Navy Sea Harriers.Finlan, Alastair. The Royal Navy in the Falklands Conflict and the Gulf War: Culture and Strategy (British Politics and Society). London: Rutelage, 2004. . Trans World Airlines was the last U.S. airline to fly passengers on a 707. The flight happened on October 30, 1983.\"Farewell Flight.\" Time, November 14, 1983. Retrieved December 27, 2009. The last Boeing 707 that was used to fly people was in Saha Airlines from Iran until the year 2013. Most 707s are now private jets or cargo planes.\"Boeing 707.\" Goleta Air & Space Museum. Retrieved December 27, 2009. ==Different types of Boeing 707== ===707-020=== What the Boeing 720 was first called. American Airlines always called its 720s 707s. ===707-120=== The 707-120 was the first type of 707. The plane could hold 179 passengers. This type often had to stop for fuel in the North Atlantic. It had four Pratt & Whitney JT3C-6 turbojets. The first flight with passengers was on October 26, 1958. 56 were built, plus 7 short body −138s; the last −120 was delivered to Western in May 1960. The 707-138 was a −120 which was ten feet shorter than the others. It could also fly further. The 707-120B had Pratt & Whitney JT3D-1 turbofan engines. They were a lot better than the others. The −120B had some changes made to the wings. 72 were made. ===707-220=== The 707-220 had more powerful Pratt & Whitney JT4A-3 turbojet engines. Five of these were made, but only four were delivered. The first one began being used in December 1959. ===707-320=== The 707-320 Intercontinental is a longer version of the 707-120. This type could hold more passengers, and had some changes made to the wings. It first took off on January 11, 1958. ===707-420=== The 707-420 was the same as the −320, but it had Rolls-Royce Conway 508 engines. Lufthansa was the first to carry passengers on this type of plane in March 1960. ===707-320B=== The 707-320B had a few changes made to the outside of the plane, as well as new engines. The wing was changed. This plane was first used in June 1962 by Pan Am. ===707-320C=== The 707-320C could be changed from a passenger plane into a cargo plane. More 707-320Cs were made than any other type. The 707-320C had a cargo door added, as well as some other changes to the wing and the floor. ===Military=== Many militaries have used the 707 for many different things. The Boeing E-3 Sentry is a U.S. military airborne warning and control system (AWACS) aircraft. It has some of the Boeing 707's design. The Canadian Forces also used Boeing 707s. These were called the CC-137 Husky (707-347C) from 1972 to 1997. ====717==== The Original Boeing 717 (commonly confused with Boeing 717/MD-95) was what Boeing called the C-135 Stratolifter and KC-135 Stratotanker. The McDonnell Douglas MD-95's name was changed to Boeing 717 after Boeing bought McDonnell Douglas. ==Users== In the 1980s, the USAF bought 250 used 707s for parts for the KC-135E Stratotanker.\"KC-135E.\" Global Security. Retrieved December 27, 2009. 707s are not used anymore by big airlines. However, as of December 2012, 10 707s were being used. John Travolta owns a 707-138B.\"N707JT \". FAA Registry. Retrieved December 27, 2009. ==Deliveries== 1994 1992 1990 1988 1986 1984 1982 1980 1978 1976 1011 1 1 5 14 4 5 0 9 4 3 8 8 8 2 3 6 13 8 9 1974 1972 1970 1968 1966 1964 1962 1960 1958 1956 7 21 11 4 10 19 59 111 118 83 61 38 34 68 80 91 77 8 0 0 ==Accidents== As of May 2011, the 707 has had 170 hull- loss accidents.\"Boeing 707 Accident summary.\" Aviation-Safety.net, May 5, 2007. Retrieved December 27, 2009. 2,739 people have died in Boeing 707 accidents.\"Boeing 707 Accident Statistics.\" Aviation-Safety.net, July 5, 2005. Retrieved December 27, 2009. A hull-loss accident is when the plane is damaged so much that it cannot be fixed. ==Details== 707-120B 707-320B Cockpit crew Three (Four with navigator if the plane needs to fly over water) Three (Four with navigator if the plane needs to fly over water) Passengers 110 (2-class) 179 (1-class, maximum) 147 (2-class) 219 (1-class, maximum) Length 145 ft 1 in (44.07 m) 152 ft 11 in (46.61 m) Wingspan 130 ft 10 in (39.90 m) 145 ft 9 in (44.42 m) Weight when empty 122,533 lb (55,580 kg) 146,400 lb (66,406 kg) Cruising speed 540 knots (1000 km/h) 525 kn (972 km/h) Width 12 ft 4 in (3.76 m) 12 ft 4 in (3.76 m) Engines (4 x) Pratt & Whitney JT3D-1 Rolls Royce Conway (BOAC only): 17,000 lbf (75.6 kN) PW JT3D-3: 18,000 lbf (80 kN) PW JT3D-7: 19,000 lbf (84.4 kN) Sources:\"707 Airplane Characteristics: Airport Planning.\" The Boeing Company, May 2001. Retrieved October 12, 2012.\"Boeing 707 Family.\" Boeing. Retrieved December 27, 2009. ==Related pages== ==References== === Notes === === Bibliography === * * * Breffort, Dominique. Boeing 707, KC-135 and Civilian and Military Versions. Paris: Histoire & Collections. . * Caidin, Martin. Boeing 707. New York: Bantam Books, 1959. * Cearley, George Walker. Boeing 707 & 720: A Pictorial History. Dallas, TX: G.W. Cearley Jr, 1993. No ISBN. * Francillon, René. Boeing 707: Pioneer Jetliner. Shrewsbury, Shropshire, UK: Motor Books International, 1999. . * Cook, William H. Road to the 707: The Inside Story of Designing the 707. Bellevue, WA: TYC Publishing Company, 1991. . * * Lloyd, Alwyn T. Boeing 707 & AWACS in Detail and Scale. Falbrook, CA: Aero Publishers, 1987. . * Pither, Tony. The Boeing 707, 720 and C-135. Tonbridge, Kent, UK: Air-Britain (Historians) Ltd., 1998. . * Price, Alfred. The Boeing 707. Leatherhead, Surrey, UK: Profile Publications, 1967. * Proctor, Jon. Boeing 720. Miami, FL: World Transport Press, 2001. . * Schiff, Barry J. The Boeing 707. Blue Ridge Summit, PA: Tab Books, 1982, First edition 1967, . . * Smith, Paul Raymond. Boeing 707 – Airline Markings No. 3. Shrewsbury, Shropshire, UK: Swan Hill Press, 1993. . * Stachiw, Anthony L. and Andrew Tattersall. Boeing CC137 (Boeing 347C) in Canadian Service. St. Catherines, ON: Vanwell Publishing Ltd., 2004. . * Whittle, John A. The Boeing 707 and 720. Tonbridge, Kent: Air Britain (Historians), 1972. . * * * Winchester, Jim. Boeing 707. Shrewsbury, Shropshire, UK: Airlife, 2002. . == Other websites == * Boeing 707 family on Boeing.com * Boeing 707 page on Airliners.net 707",
 "title": "Boeing 707"
}