{
 "id": "232445",
 "text": "John Brown (May 9, 1800 – December 2, 1859) was an American abolitionist. Brown supported using violence to end slavery in the United States. He first got national attention when he led small groups of people during the Bleeding Kansas crisis of 1856. In October 1859, Brown led a raid on the federal armory at Harpers Ferry, Virginia (today West Virginia). He wanted to start a slave liberation movement that would spread south through the areas of Virginia and North Carolina. He took control of the armory, but seven people were killed, and ten or more were injured. Brown wanted to arm slaves with weapons from the armory. However, few local slaves joined his attack. Within 36 hours, Brown's men were killed or captured by local farmers, militiamen, and U.S. Marines. Brown was executed by hanging for treason against the state of Virginia on December 2, 1859. He was the first person executed for treason in the history of the United States. Brown is still a controversial person today. He is both remembered as a heroic martyr, and he is hated as a madman and a terrorist.Ken Chowder. \"The Father of American Terrorism\". American Heritage. February/March 2000. ==Early years== John Brown was born May 9, 1800, in Torrington, Connecticut. He was the fourth of the eight children of Owen Brown (1771–1856) and Ruth Mills (1772–1808) and grandson of Capt. John Brown (1728–1776).There has been speculation that the grandfather was the same John Brown who was a Loyalist during the American Revolution and spent time in jail with the notorious Claudius Smith, allegedly for stealing cattle, which he and Smith used to feed starving British troops. But this runs against the grain of the Brown family history as well as the record of the Humphrey family, to which the Browns were directly related (abolitionist John Brown's maternal grandmother was a Humphrey). Brown himself wrote in his 1857 autobiographical letter that both his and his first wife's grandfathers were soldiers in the Continental Army [which he established in his The Humphreys Family in America (1883)], which notes that abolitionist John Brown's grandfather, Capt. John Brown (born November 4, 1728), was a militia captain who died early in the American Revolution. His son Owen Brown, the father of abolitionist John Brown, was a tanner and strict evangelical who hated slavery and taught his trade to his son. Brown's ancestors were 17th-century English Puritans. In 1805, the family moved to Hudson, Ohio. Owen Brown opened a tannery here. Hudson had a lot of anti-slavery activity. Owen was a part of it. Owen provided a safe house to Underground Railroad fugitives. There was not a high school in Hudson at that time, so John studied at the school of the abolitionist Elizur Wright. Elizur Wright was the father of Elizur Wright, in nearby Tallmadge. The father of Ulysses S. Grant, Jesse R. Grant, was Owen Brown's apprentice.Ulysses S Grant, Memoirs and Selected Letters, (The Library of America, 1990) When he was 16 years old, Brown left his family and went to Plainfield, Massachusetts. He joined a preparatory program. Shortly afterward, he went to the Morris Academy in Litchfield, Connecticut.John Brown profile , pabook.libraries.psu.edu; accessed August 29, 2015. In 1820, Brown married Dianthe Lusk. Their first child, John Jr, was born 13 months later. In 1825, looking for a safer place (for fugitive slaves), Brown and his family moved to New Richmond, Pennsylvania. He bought of land. He cleared an eighth of it, and he built a cabin, a barn, and a tannery. The tannery had a secret room to hide escaping slaves. The John Brown Tannery Site was listed on the National Register of Historic Places in 1978. It \"was a major stop on the [Underground] Railroad, marking its place in history from 1825 to 1835.\" During that period, \"Brown helped an estimated 2,500 slaves escape.\" In 1829, some white families asked Brown to help them remove Native Americans who hunted annually in the area. Brown told them, \"I will have nothing to do with [such a] mean act. I would [rather] take my gun and help [remove] you from the country.\" Throughout his life, Brown kept peaceful relations with his Native American neighbors. Sometimes he would go with them on hunting trips, and he invited them to eat in his home. In 1831, one of his sons died. Brown became sick, and his businesses started to do poorly. This made Brown have a lot of debt. In the summer of 1832, shortly after the death of a newborn son, his wife Dianthe died. The only family he had left were his children John Jr., Jason, Owen, and Ruth. (Another three of their children died before they became adults.) On June 14, 1833, Brown married 16-year-old Mary Ann Day (April 15, 1817 – May 1, 1884). She was from Washington County, New York. They had 13 children; those alive at John Brown's death were Salmon, Annie, Sarah, and Ellen. In 1836, Brown moved his family to Franklin Mills, Ohio (now known as Kent). There, he borrowed money to buy land in the area. He built and operated a tannery along the Cuyahoga River. His partner was Zenas Kent. In 1837, when he learned that Elijah P. Lovejoy was murdered, Brown promised: \"Here, before God, [with witnesses around me], from [now on], I (dedicate) my life to the destruction of slavery!\" He strongly believed in Christianity. He believed that Christians should treat people the same no matter what color their skin was. Many white Christians in America at this time did not agree with this.Reynolds, D (2005). John Brown, Abolitionist: The Man Who Killed Slavery, Sparked the Civil War, and Seeded Civil Rights, Knopf. ==Kansas and the Pottawatomie Massacre== Brown lived mostly in Springfield, Massachusetts before moving to the Kansas Territory. This would later become the state of Kansas in 1861. Several of his sons were already living there. Brown's sons wanted his help to fight people from Missouri. The people in Missouri wanted slavery to be legal in Kansas. On May 24, 1856, Brown and his sons killed five people in Kansas who wanted slavery to be legal. They dragged the people out of their homes and killed them with swords. This came to be known as the Pottawatomie massacre. Many people in Kansas were shocked and upset about this. More violent things happened after this. This was the beginning of the period in the Kansas Territory known as Bleeding Kansas. Before leaving Kansas, Brown and his followers were attacked at the Battle of Osawatomie on August 30, 1856. His son Frederick was killed there. ==Harper's Ferry== In 1859, Brown decided to attack the Harpers Ferry Armory in Harper's Ferry, Virginia (now West Virginia). He was planning on giving the weapons to slaves. The slaves would use the weapons to fight against their masters and become free. Brown attacked the arsenal in October 1859. His sons and several other men, including several black men, helped him with the attack. His attack failed. Brown was captured, and was executed by hanging for treason against the state of Virginia on December 2, 1859. ==Death and aftermath== On the morning of December 2, 1859, Brown wrote: > I, John Brown, am now quite certain that the crimes of this guilty land will > never be purged away but with blood. I had, as I now think, [naively > thought] that [it could be done without much bloodshed].Territorial Kansas > Online: John Brown (1800–1859) , territorialkansasonline.org; accessed > August 29, 2015. He read his Bible and wrote a final letter to his wife. The letter included his will. At 11:00 a.m. he was taken from the county jail through a crowd of 2,000 soldiers a few blocks away. He was taken to a small field where the gallows were. Among the soldiers in the crowd were future Confederate general Stonewall Jackson, and John Wilkes Booth (Booth borrowed a militia uniform to watch the execution).Evan Carton, Patriotic Treason: John Brown and the Soul of America (2006), pp. 332–33. The poet Walt Whitman, in Year of Meteors, described watching the execution.Walt Whitman Archive: \"Year of Meteors\"; retrieved March 13, 2011 Brown chose to receive no religious services in the jail or at the scaffold. He was hanged at 11:15 a.m. He was declared dead at 11:50 a.m. ===Aftermath of the raid=== The raid on Harpers Ferry is generally thought to have pushed the United States towards civil war.David Potter, The Impending Crisis, pp. 356–84. Southern slaveowners, hearing early reports that hundreds of abolitionists were involved, were glad the action was so small. However, they feared other abolitionists would also try to lead slave rebellions. Therefore, the South reorganized the old militia system. These militias became a ready-made Confederate army, making the South better prepared for war.Daniel W. Crofts, Reluctant Confederates: Upper South Unionists in the Secession Crisis (1989), pp. 70 ff. Many abolitionists in the North believed Brown was a martyr, and that he sacrificed for the evils of the nation. Immediately after the raid, William Lloyd Garrison published a column in The Liberator. He said Brown's raid \"[meant well] but sadly unwise\" and \"wild and [pointless]\".\"The Tragedy at Harper's Ferry\" , fair-use.org; accessed November 12, 2015. However, he defended Brown's character from haters in the Northern and Southern press. He argued that those who supported the ideas of the American Revolution could not consistently oppose Brown's raid. On the day Brown was hanged, Garrison said in Boston: \"whenever [it happens], I all slave revolts succeed\".See opposed any use of violence on principle John Brown and the Principle of Nonresistance December 16, 1859 After the Civil War, Frederick Douglass wrote, \"His zeal in the cause of my race was far greater than mine ... I could live for the slave, but he could die for him.\"Frederick Douglass, John Brown. An Address at the Fourteenth Anniversary of Storer College, May 30, 1881; online at Project Gutenberg, gutenberg.org; accessed November 12, 2015. ==Public opinion== People had strong feelings about John Brown. Some people thought that he was crazy or evil. Other people thought that he was a hero. His attack on Harpers Ferry helped lead to the American Civil War. The war would start in 1861. Many Black leaders of the timeMartin Delany, Henry Highland Garnet, Frederick Douglass, Harriet Tubmanknew and respected Brown. \"Tubman thought Brown was the greatest white man who ever lived.\" Douglass called him \"a brave and glorious old man.\" Black businesses in the North closed on the day of his execution. Church bells rang across the North. ==References== ==Other websites== * * * Collection of primary materials on John Brown * Johnson, Mary. \"'His Soul Goes Marching On': The Life and Legacy of John Brown.\" West Virginia Division of Culture and History. * New York History Net, John Brown's Farm * John Brown, Abolitionist: The Man Who Killed Slavery by David S. Reynolds excerpt * * John Brown Song and Battle Hymn of the Republic * Correspondence relating to the Insurrection at Harper's Ferry, October 17, 1859, Senate of Maryland, 1860. Western Maryland History Online * John Brown Pike – Kansas Historical Society * \"John Brown and his Men, with Some Account of the Roads Traveled to Reach Harper's Ferry,\" poem by Jared Carter. * John Brown Desk, Kansas Historical Society website * John Brown Tannery Park, Site of the Franklin Mills Tannery, now a municipal park in Kent, Ohio * Harpers Ferry Revolver – Kansas Historical Society * (memento of James Miller McKim) * Historical, Marker for Kent, Ohio, Underground Railroad activity, mentioning John Brown's tenure in the vicinity Category:1800 births Category:1859 deaths Category:American abolitionists Category:American Calvinists Category:American Civil War Category:American folklore Category:American Old West Category:American revolutionaries Category:Bleeding Kansas Category:Congregationalists Category:Executed American people Category:Harpers Ferry, West Virginia Category:People executed by hanging Category:Politicians from Akron, Ohio Category:Politicians from Connecticut Category:Politicians from Kansas Category:Politicians from Massachusetts",
 "title": "John Brown (abolitionist)"
}