{
 "id": "232481",
 "text": "Perseus \"Percy\" Jackson is the main character and narrator of Rick Riordan's Percy Jackson & the Olympians series. He is a demigod, meaning he is half- mortal and half god. His father is Poseidon, the god of the sea, and his mother is the mortal Sally Jackson. First introduced in The Lightning Thief as a troubled 12-year-old who finds out he is Poseidon’s long lost son, Percy goes on many adventures in the series to save his friends and the gods of Mount Olympus. Percy is played by Logan Lerman in the movie Percy Jackson & the Olympians: The Lightning Thief and in Percy Jackson: Sea of Monsters. == Character traits == He always tells Blackjack, his pegasus whom Percy saved from The Princess Andromeda, not to call him \"boss\" or \"lord\" whenever they talk to him but does not get annoyed when Annabeth calls him Seaweed Brain. His fatal flaw is loyalty. Percy, like most boys his age, has trouble talking to girls. Athena said that Percy's fatal flaw is personal loyalty. He will do anything to save his friends and loved ones. Kronos uses this flaw to control him several times in the series, such as when his mother is held hostage, when Grover is trapped on Polyphemus' island, and when Annabeth is kidnapped. == In the books == === The Lightning Thief === Perseus \"Percy\" Jackson is introduced as a troubled 12-year-old boy who is a student with dyslexia, which makes it hard for him to read, and ADHD, which makes it hard for him to pay attention. He has been kicked out of every single school he has gone to. He has just been kicked out of Yancy Academy in Upstate New York. He has one friends at the school, his only friend being Grover Underwood, a satyr (half human, half goat) disguised as a human. During a field trip to The Metro Museum, Percy is annoyed by the school bully, Nancy Bobofit, for intimidating Grover and in a fit of rage, accidentally summons water from a nearby fountain to pull her in, but he didn't know how he did it. Mrs. Dodds, his pre-algebra teacher, witnesses the whole scene and tells him to follow her into the museum for a \"talk.\" Suddenly, she turns into the Fury, Alecto, and attacks him, looking like a bat-like figure with big fangs. Percy manages to destroy her using Mr. Brunner’s pen, Riptide, that transforms into a sword in his hand. However, when Percy returns to the bus and asks his classmates, nobody remembers Mrs. Dodds because of a force known as The Mist. The only person that may remember her was Grover, who always hesitated before he answered. Everybody else believed her name was Mrs. Kerr, \"a perky, blonde woman that Percy had never seen in his life until she got onto the bus\". Percy asks what just happened, and Mr. Brunner says he saw nothing and that Percy should bring his own things to write with in the future. Percy asks his classmates about it, but they act like there was never any \"Mrs. Dodds\". Percy sees that Grover is lying when he hesitates whenever Percy mentions \"Mrs. Dodds\". Percy overhears Grover and Mr. Brunner talking about him later in the school year. As he is going home on a bus with Grover, he sees three old ladies knitting a giant sock that cut a strand of yarn. Grover freaks out and tell Percy to get on the bus to which Percy rightfully replies: \"but it's like a bajjilion degrees in there.\" Percy leaves Grover at the bus stop and takes a taxi to his apartment on his own. His mother arrives soon after he gets home and tells him that they can go to Montauk Beach for the entire weekend. Percy is happy that something good has finally happened and packs his things and leaves. At the beach, Percy wakes up in the middle of the night in a storm and is shocked to see Grover at Sally's and his cabin at Montuak, pounding on the door. Grover tells them that 'it' is after them. Percy is confused, but his mother takes them both in the car and drives quickly away. After hearing a roar behind them, his mom arrives at a hill and pushes both boys out of the car. Percy sees that the thing chasing them is a Minotaur, who charges them. Percy and his mom dodge it, but Grover is too slow and the Minotaur charges him. Percy manages to defeat the Minotaur, but not before it dissolves Percy's mother into light and sends her to the Underworld. Percy drags Grover up the hill to Camp Half-Blood, where Percy passes out on the doorway of the Big House. Percy learns that Camp Half-Blood is a place for demigods like him. He meets a future friend, Annabeth Chase. He learns that Mr. Brunner is actually the centaur (half human, half horse) Chiron, the camp's activity director. He also learns that the director of the camp is the god Dionysus who is more commonly known as 'Mr D'. He is introduced to Luke Castellan, the leader of the Hermes cabin. Later, in a capture-the-flag game, Percy single-handed defeats Clarisse, leader of the Ares cabin, and three others when he healed his injuries in water. This is when he learned that he is the son of Poseidon as a holographic trident appears over his head. Soon after learning that Zeus's lightning bolt has been stolen, Percy embarks on his first and eventually successful quest along with Grover and Annabeth to retrieve it. === The Sea of Monsters === Thalia's tree, the magical border of Camp Half-Blood, has been poisoned. Chiron is blamed for the poisoning and is dismissed from camp; Tantalus, who comes from the Fields of Punishment and cannot have food or water, takes the job. The only thing able to rid the tree of its poison is the Golden Fleece, which is located on the island of Polyphemus (another son of Poseidon), in the Sea of Monsters (the Bermuda Triangle). Clarisse, the daughter of Ares and enemy of Percy, is given the quest to go into the Sea of Monsters to bring back the Golden Fleece, which has healing powers for plants, animals, and humans. Percy and Annabeth decide to go also, not just for the Golden Fleece, but for their friend Grover who is trapped in Polyphemus' cave. Tyson, a young Cyclops whom Percy befriended at school that year, joins them on their journey. Tyson is Poseidon's son and therefore Percy's half-brother. As they enter the Sea of Monsters, they have to get past Scylla and Charybdis. Instead of trying to sail in between the two, Clarisse automatically goes for Charybdis and Tyson supposedly dies in Clarisse's ship after it sinks. After that, Percy and Annabeth journey to many dangerous islands, and Annabeth tells Percy many things about how Thalia died and she also mentions her prophecy and tells Percy that he has a choice to make when he becomes 16 years old. Fighting their way through many other obstacles, like the Sirens and Circe's island, they join up with Clarisse, Grover, and later Tyson (who did not die), and leave with the Golden Fleece. When they return to the mortal world, they send off Clarisse on an airplane to camp alone, and Percy, Annabeth, Grover, and Tyson are kidnapped by Luke. In a duel with him, Percy is nearly killed. He is saved by Chiron, who is proven innocent, and his relatives, the Party Ponies. When they return to camp the Fleece is put on the tree. The Fleece not only revives Thalia's tree, but Thalia too. It turns out that this was actually Kronos's plan, done so that he would have another chance to control the prophecy which governs the future of Olympus and the Olympians. At the end Percy and Annabeth win a chariot race and Annabeth kisses Percy on the cheek. === The Titan's Curse === In the third book, Grover finds two demigods at a school, Bianca and Nico di Angelo. Percy, Grover, Thalia and two of Artemis' hunters, Zoë and Bianca (who later chose to become a hunter, upsetting Nico), are sent on a quest to save Artemis, who has been kidnapped. Percy is really going to save Annabeth, who was captured while they were saving the di Angelo's. During the journey, Percy meets a mortal girl at Hoover Dam, named Rachel Elizabeth Dare, who can see through the Mist. She helps him escape from skeletal warriors who were trying to attack Percy and his friends. While warning them about the junkyard of the gods, Aphrodite, goddess of love, tells Percy there is a romantic future waiting for him with Annabeth. Bianca is killed by a crazed robot in the junkyard of the gods while trying to get a figurine for her brother Nico. She said it was the only figurine he was missing in his collection. During the battle with Atlas, Zoë receives deadly injuries. She is poisoned by her old friend Ladon; her father, Atlas, makes the final strike that kills her and Atlas holds the burden of holding the sky again. Upon entering Olympus, the Gods decide whether to kill Thalia, Percy and Bessie (the ophiotaurus) who may hold the decision to tear down Olympus according to the Great Prophecy. Thalia becomes one of Artemis' hunters, eliminating her as a potential recipient of the Great Prophecy. In the end, the gods decide to leave Percy alive and keep the Ophiotaurus in safety at the throne room. Afterward, a feast is held in honor of the heroes and Athena tells Percy that she disapproves of his friendship with her daughter. At camp, Percy tells Nico about Bianca's death; he opens the ground, creating a passage to the underworld. From then on, Nico hates Percy, blaming him for his sister's death. Annabeth, Percy and Grover search for Nico and cannot find him. Percy then holds the figurine of the god Bianca gave him at the junk yard. Suddenly, he realizes who Nico's father is: Hades, lord of the dead. === The Battle of the Labyrinth === In book four, the Labyrinth of Daedalus is discovered. Camp Half-Blood is in danger of being invaded by Kronos' army by means of the Labyrinth. Chiron sends Annabeth along with Percy, Grover, and Tyson into the Labyrinth on a quest to find Daedalus. In this, they hope to use his knowledge to help thwart any attacks that are carried out using the giant underground maze. They eventually find Daedalus, who has made himself a new body, and has disguised himself as the swordplay counselor. There is a battle, as Kronos' army attacks Camp Half-Blood through the Labyrinth. Many are injured and some are left dead. Daedalus shows up to help along with his giant pet hellhound, Mrs. O'Leary. Daedalus has escaped death for centuries, but gives himself over to Nico di Angelo, a son of Hades, so he can accept his punishment in the Underworld and also so he can see his son Icarus and his nephew Perdix. Percy inherits Mrs. O'Leary. They have grown fond of each other. Percy and Annabeth's relationship starts to take on a new edge. Annabeth saves Percy several times and kisses him once because she thinks he is going to die. She also makes a big scene in front of all the campers when she realized that Percy was alive. === The Last Olympian === In book five, Percy discovers the truth behind the Great Prophecy. The campers find out there is a spy among them who is reporting everything to Kronos, who took over Luke's body in the fourth book. Percy battles Kronos many times, and eventually becomes invincible from bathing in the River Styx, but instead of his heel, his weak spot is the small of his back. In the beginning, Percy and Beckendorf, son of Hephaestus are sent on a quest to blow up Luke's demon cruise ship, and Beckendorf is killed. Percy and Nico sneak out of camp, and meet Hestia, who shows Percy part of Luke's past, and they meet Luke's mother. A war between the Titans and Olympians ensues, one that has been in the making for much of the series. Silena Beuregard turns out to be the spy. She is a good person inside, but Luke threatens her, and they make a deal that Beckendorf will not be hurt, as she was Beckendorf's girlfriend. Silena dies trying to kill a drakon, disguised as Clarisse, which upsets Clarisse greatly. In the end of the book, In the end, Luke, who is also invincible from bathing in the River Styx, commits suicide to save the Olympians by sending Kronos back to Tartarus. Annabeth admits she never loved Luke, and that she cared for him only as a brother. She and Percy finally cement their relationship. Percy tries to tell her about his feelings at the River Styx, but says that she is not making it easy. She says: \"I will never, ever make it easy for you Seaweed Brain. Get used to it\", then kisses him, after which the other campers throw them into the canoe lake. Percy then creates an air bubble and they share \"pretty much the best underwater kiss of all time.\". == Movie/series == Percy was played by Logan Lerman in the movie Percy Jackson: The Lightning Thief. That movie was adapted from the first book in the series, The Lightning Thief. A movie of the second book, The Sea of Monsters was released on August 7, 2013 in the United States. Percy is played by Walker Scobell in the TV series for Disney+. == Powers/abilities == Percy, like most demigods, has two main disabilities: * ADHD, which actually is heightened alertness that keeps half- bloods ready for battle. * Dyslexia, since his brain is hard-wired for reading Ancient Greek instead of modern languages. * A fatal flaw of complete, unwavering loyalty to his friends and family. In The Lightning Thief, Percy is given a magically enchanted sword called Anaklusmos (Riptide). It is made of celestial bronze, a fictional metal which will injure immortals and monsters, but not wound mortals. Many demigods use celestial bronze weapons. Children of the \"big three\" (Zeus, Poseidon, and Hades) are more powerful than demigods of the other Greek gods and goddesses. Percy has a wide range of abilities. * Percy is a naturally talented swordsman, often able to hold his own against larger, stronger, and more experienced opponents. * Percy possesses incredible physical strength. He tore a horn off the head of the Minotaur, and was able to bear the weight of the sky, the curse of Atlas. * Percy has clairvoyant dreams, causing him to watch events in distant locations as an out-of-body experience. This could be the work of Apollo, the God of Prophecy, because he told Percy, \"How important dreams could be.\" * Percy has a psychic connection with his friend Grover called an empathy link. * In The Last Olympian, Percy bathes in the River Styx (like Achilles), making him nearly invulnerable except in one weak point (the small of his back) and also granting him increased skill, strength, and puts him into a frenzy in battle. === Aquatic (water) powers === Percy has a lot of powers specifically connected to the things controlled by Poseidon: seas, horses, sea creatures, and earthquakes. His water-related abilities tend to be stronger in sea water than in fresh water. * When standing or immersed in water, Percy gains a lot of strength, combat (fighting) skill, and speed. * Percy can control large amounts of water with great force (hydrokinesis, or waterbending). For example, he can redirect rivers, create currents to push boats, or even increase surface tension to the point where it is firm enough to stand upon. * Percy can breathe underwater. He is unharmed by water pressure of any amount, or by falling from high up into water. * When Percy is underwater, he stays dry unless he consciously (thinks about it) forces himself to become wet. When Percy touches objects underwater, they become dry. * Percy can create seawater with no effort with things that used to be in the sea (such as petrified (solid) seashells, as in the book The Battle Of The Labyrinth) * Percy can communicate telepathically with sea animals, most of whom also obey him and treat him with respect. * Percy can communicate with equine animals (horses, zebras, pegasi, etc.), because his father created them out of sea foam. * While at sea, Percy has perfect bearings on his exact coordinates. * Percy can control all parts of boats telekinetically, especially sails. * Percy can sense where objects are underwater. * Percy can communicate with children of Poseidon, such as Cyclopes, underwater. * Percy is very resistant to burning, and is even able to survive while immersed in magma because of the power of the ocean inside of him. * Percy can make water appear from nothing, though doing so is particularly hard on his body. * Percy can summon hurricanes, as he did in The Last Olympian, since his father is the god of the sea and storms. * Percy can release the oxygen diffused in water and force the surrounding water to recede, making an air bubble so his friends with non-hydrokenetic abilities can breathe. * Percy can control ocean currents to propel him at great force underwater, or even up into the air, as he does in his duel with Ares. * Percy can harden water (without freezing it) to form shields. It is quite possible that he could use this skill to other purposes, combat or otherwise. * Percy can heal small cuts when on water, he also gains a burst of energy as seen in his fight with elements of the Ares cabin The Lightning Thief. * Percy can make earthquakes (as in The Battle Of The Labyrinth) *Percy can control not only water but other liquids too, only held back from using his power by a promise to Annabeth, his girlfriend (The House of Hades) * Percy can also sometimes control humans, because humans are 71% water.(bloodbending) == Romance == * Annabeth Chase: Throughout the series, it is shown that they have feelings for each other ; in each book there are hints of romantic tension and flirting. Percy and Annabeth first meet in The Lightning Thief when Percy wakes up after passing out to see Annabeth, whom he described as \"pretty\", spoon-feeding him nectar and ambrosia, the food of the gods. Percy is confused and irritated by Annabeth's behavior in the beginning of The Lightning Thief, but they develop a solid friendship at the end of the novel from all they had experienced together. In The Battle of the Labyrinth, Percy and Annabeth were supposed to meet up after school for lunch and a movie which Percy's mother, Sally, referred to as a \"date\" and teased him about it. It is revealed in The Sea of Monsters that Percy carried a picture of Annabeth in his binder and that Annabeth had been tailing Percy with her cap of invisibility on. In The Titan's Curse, Percy meets Aphrodite (Percy momentarily thought she resembled Annabeth), who tells him that he will have a tragic love life; incidentally, Percy meets Rachel a little while after. At the end of the book, he nearly has a heart attack, thinking Annabeth was about to join the Hunters of Artemis. Annabeth kisses him four times, once after winning the chariot race in The Sea of Monsters, though that was only on the cheek, again as she leaves him to fight the telekhines at Mount St. Helens in The Battle of the Labyrinth, in the dining area of Camp Half-Blood, prior to all the other campers throwing them in the canoe lake in The Last Olympian, where they share an underwater kiss. Also in The Last Olympian when Percy and Annabeth were inspecting Athena's cabin, Percy states that \"sure, she'd always been cute, but she was starting to be seriously beautiful\". When Percy goes to the River Styx to bathe, he is supposed to envision the one thing that keeps him tied to the mortal world. He thinks of Annabeth pulling him out of the water at the canoe lake. Annabeth is also the only person who knows Percy's vulnerable spot. When Kronos is spotted during the battle in The Last Olympian, Percy orders a retreat, but Annabeth stays behind to help him, taking a knife that would have killed him. At the end of The Last Olympian when Luke is dying, he asks Annabeth if she ever loved him, to which she replies that she only loved him as a brother, looking up to Percy.In the second series, they are dating and shown to be in love. Several times, both Annabeth and Percy say that they cannot live without the other. They say that they love each other and kiss throughout the books. This pairing is commonly referred to as Percabeth( per- ca- beth). * Calypso: Percy, stranded on Ogygia island after being badly burned, is nursed back to health by Calypso. She appears to be around sixteen with almond eyes and caramel hair; Percy thinks she is more beautiful than Aphrodite (goddess of love). Despite the fact that he never expresses love for her, Percy enjoys her company and admires her beauty and grace. When leaving the island, he says she will always be his biggest \"what if\". She says the gods allow a hero to wash up on her shore every thousand years, always someone she cannot help falling in love with and who cannot stay. She extends him an offer to stay, which would make him immortal, saving him from the prophecy predicting his death when he turns sixteen. However, his friends and family need his help and he chooses to leave. In the end of The Battle of the Labyrinth, he plants a sprig of moonlace in Manhattan, fulfilling his promise to her to plant a garden at his home. In The Last Olympian, he says that Calypso should be excused and released. * Rachel Elizabeth Dare: Even though Percy is not known to love Rachel, it is known that she likes him. Percy was unsure about having a crush on Rachel and never truly admits it. His feelings were mixed mainly because of his feelings towards Annabeth. In time, his growing feelings for Annabeth stopped him from ever developing a relationship with Rachel. In The Last Olympian, Rachel kisses Percy in Paul's Prius right before he sets off to the Princess Andromeda, where it was very likely he could have died. On Olympus, Rachel tells Percy that he was just a distraction for her. She tells him that they can never be together because she took on the spirit of the oracle, restricting her from dating. Percy thinks of this as Rachel \"dumping\" him but takes it very lightly and says he intends to continue to be friends with her. Percabeth forever! == Relationship with Olympians == * Poseidon: Percy is on good terms with Poseidon primarily because he is his son. At the end of The Battle of the Labyrinth, Poseidon states that Percy is his favorite son. Poseidon even forgives Percy for sitting on his throne in The Last Olympian. Poseidon states that not even Hercules is as good a hero as him. * Zeus: Zeus, the king of the Gods, has mixed feelings for Percy. He is upset over Percy's birth because it violates the pact that he, Poseidon, and Hades made after World War Two to not bear any more children, but is pleased when Percy returns his Master Bolt to him in The Lightning Thief. During the winter solstice in The Titan's Curse, Zeus votes to let Percy live, but this may have been tied to the fate of his own daughter, Thalia, as well. However, Thalia had agreed to become one of Artemis' Hunters before this, so it is possible that this may not have mattered. In spite of all of this, Zeus tells Percy that if he ever finds him in his realm (the sky), he will strike him down. After Percy fights in the battle at the end of The Last Olympian, Zeus offers Percy godhood, and therefore immortality, for saving Olympus from the Titans. * Hades: Hades, the lord of the underworld, has mixed feelings about Percy. Percy previously accused him of stealing Zeus' Master Bolt when it was in fact Luke who stole it. Later however, he returns to Hades his Helm of Darkness and clears his name of all charges pressed against him. In The Last Olympian, Hades is shown assisting Percy during the war, even talking with his son, Nico, who also has a decent relationship with Percy, afterwards. When mentioned by Percy during his decision of rejecting immortality, Hades is shown casually addressing him, with none of the malice that he normally shows throughout the series. * Ares: The god of war dislikes Percy. His hatred for Percy only intensifies when Percy defeats him in a duel in The Lightning Thief. It is dangerous for Percy that they are on bad terms because Ares, being the god of war, thinks highly of revenge and is quite violent. Ares puts a curse on Percy, saying that when he needs his sword the most, it will fail him. He only goes along with granting Percy godhood because he can fight him as many times as he wants and Percy will just keep coming back. * Athena: The goddess of wisdom, war, strategy, industry, justice and skill disapproves of Percy's friendship with her daughter Annabeth because of the historical rivalry between herself and Poseidon, but Percy has not done anything against her directly. In The Titan's Curse, she may have helped to guide him at the Hoover Dam. However, in the same book, she also voted that he be destroyed. In The Last Olympian, Athena is on good terms with Percy, with the exception of his relationship with Annabeth. * Hera: the goddess of women, marriage and family, neither likes nor dislikes Percy. Near the end of The Battle of the Labyrinth he and Annabeth both disagree with her views of families having to be perfect, siding with Hephaestus on the matter instead, even though Hera helped them numerous times in the book. Percy also insults her by mentioning Thalia, one of Zeus' children not borne by her, whom Hera historically despises, along with Hercules. She swears to make Annabeth regret her decision, much like Ares did to Percy, but it is not directly stated whether she included Percy in this statement. She makes Ares write a thank you letter to Poseidon for saving Olympus, revealing that she may care for him. * Dionysus (aka \"Mr. D\"): Percy primarily has been on Mr. D's bad side from the very second they met. Percy does not like Dionysus very much either, for he constantly antagonizes Percy (and all other demigods, for that matter) by never calling them by their real names (preferring to call him \"Peter Johnson\" or \"Perry Johansson\"), but he saves Percy's life in The Titan's Curse. One of the other reasons he may dislike half-bloods is because of the way they treat mortals; he mentions Theseus and Ariadne, Jason and Medea, and alludes to Hercules and Zoё Nightshade in The Titan's Curse, mentioning how the former in all three cases used and later abandoned the latter. However, at the end of the Battle of the Labyrinth, their relationship comes to better terms after one of Dionysus' sons dies in the final battle. Dionysus believes Grover's news of Pan's death, disbands the Council of Cloven Elders when they are at a tie, and cures Chris Rodriguez, a previous traitor half-blood, of the madness he obtained in the Labyrinth. Most shockingly, he calls Percy by his real name, although he later denies this. They are on much better terms by the end of The Battle of the Labyrinth. Although Dionysus denies this, he favours Percy with his judgement, help, and advice, more than any other god in the series. This may be proof that Dionysus is acknowledging Percy, and that their relationship is improving. * Hephaestus: Is grateful to Percy for having discovered who was using his forge under Mt. St. Helens, even though he causes an eruption that destroyed the forge and awakened Typhon (who had been imprisoned under it), but also dispersed and/or killed the users. At the end of the 5th book, Hephaestus said that Percy had done a 'Pretty bang up job, mostly'. Historically, Hephaestus and Poseidon have close ties in the terms of the Cyclopes who work for both of them. * Artemis: Percy is on Artemis' good side since he helped find and save her in The Titan's Curse. She even declared him a hero in the halls of Olympus itself and started calling him a man rather than a boy after he helped her defeat Atlas. His respect for Zoë Nightshade, and his deep loyalty, regardless of gender, has also improved her view of him. * Hermes: Percy is on good terms with Hermes, who convinced him to go on a quest in The Sea of Monsters and gave him magic items to assist him in his journey. He also explained the relationship between gods and heroes to him. Their relationship took a turn for the worse after realizing that Percy could not save Luke and Hermes grew bitter to all heroes. But after the war, their relationship was mended upon Percy's counseling and sympathy of Luke's situation and prophecy as well as how powerless Hermes was, on some occasions, when somebody includes Luke Castellan, Hermes gets mad at that person. * Aphrodite: Aphrodite is on Percy's good side, probably because she is intrigued by Percy's desire to save Annabeth. She expressed an interest in their relationship, meaning that she plans to meddle with it in some way. She also said she would make Percy's love life hard, just because she likes him. The way she meddled with it was by making Percy meet Rachel and causing him to be confused about Annabeth. * Apollo: Apollo treats Percy like a younger cousin (which he is). The sun god helped Percy twice in The Titan's Curse so that they could save Artemis, his sister. Being the god of prophecy, he also told Percy how important dreams could be. * Demeter: Demeter and Percy have a poor relationship due to Percy's lack of respect towards her. * Hestia: Percy and Hestia have a good relationship. In The Last Olympian, Percy entrusts her with Pandora's pithos that contains the spirit of hope, Elpis, saying that \"hope is best kept by the hearth\". This helps mend her anger towards the gods for giving her a small role, as well as her perception of demigods, which Kronos had used to bring many of the minor gods to his side. She also helps him and shows him the stories of Luke. == References == == Other websites == *Official Percy Jackson Site Category:Percy Jackson and the Olympians characters Category:The Heroes of Olympus characters Category:Fictional characters introduced in 2005",
 "title": "Percy Jackson"
}