{
 "id": "232548",
 "text": "This is a list of characters in the Persassy Johnson & the Olympians series of fantasy novels by the author Rick Riordan. ==Main Characters== * Percy Jackson: The protagonist and narrator of the series and the son of Poseidon. Being a child from one of \"Big Three\" (Zeus, Poseidon, Hades), Percy is possibly the child referred to within the prophecy, which says that the next half-blood child of the \"Big Three\" to reach the age of sixteen would make a decision that would either save or destroy Olympus. He was technically only selected to go on two of the five quests in the series, the first being the retrieval of Zeus' master thunderbolt. He is the leader of this quest. In The Battle of the Labyrinth, Percy has to go through the Labyrinth (a big subterranean maze) created by Daedalus, in order to defend the camp against Luke (a son of Hermes and servant of the Titan lord Kronos). The quest in The Sea of Monsters was actually led by Clarisse (a daughter of Ares), but Percy sneaks out of camp because he needs to find Grover, his best friend/protector. In The Titan's Curse, he is also not selected to go on the quest, but he follows the group because he needed to help Annabeth, who is in love with Percy. Percy has a crush on Annabeth, but his love life has been difficult as a result of Aphrodite's promise she made to him when she met him in the desert. After he helps Zoë, Bianca, Grover, and Thalia, Zoë reluctantly allows him to become the fifth member of their team . He leads the army against Kronos in The Last Olympian. He is portrayed by Logan Lerman in the film adaptation and by Chris McCarrell in the musical. Walker Scobell is set to portray him in the upcoming TV adaptation on Disney+. * Annabeth Chase: A daughter of Athena (goddess of wisdom and battle strategies). She is shown to be somewhat pompous at first, but quickly warms to Percy on their first quest together. Being a daughter of Athena, she is very intelligent and has a fascination with architecture. She ran away from home when she was seven and met Luke and Thalia, who took her with them to get to Camp Half-Blood. She aids Percy in four of his five quests and is captured in one of them. At first she likes Percy and Luke. But later she gets over Luke and ends up with Percy. He likes her back and gets jealous when she talks about Luke. They become a couple in The Last Olympian. She is portrayed by Alexandra Daddario in the film adaptation and by Kristin Stokes in the musical. Leah Sava Jeffries is set to portray her in the upcoming TV adaptation on Disney+. * Grover Underwood: He is a satyr and Percy Jackson's best friend. He has found the four most powerful demigods of the century (children of the Big Three): Percy Jackson (son of Poseidon), Thalia Grace (daughter of Zeus), and Nico and Bianca di Angelo (children of Hades). Before his death, Pan (the god of the wild) proclaims Grover as the bravest satyr and names Grover as his successor to carry on his word to protect the wilderness. The Council of Cloven Elders is angered by this choice. He is the boyfriend of tree nymph Juniper. He is portrayed Brandon T. Jackson in the films and is portrayed by George Salazar in the musical. Aryan Simhadri is set to portray him in the upcoming TV adaptation on Disney+. ==Greek gods== * Aphrodite: The goddess of love and beauty courageousness. She is mentioned in The Lightning Thief and appears briefly in The Titan's Curse. Her children (mostly girls) live in Cabin #10. She wears a red satin dress and has long hair in ringlets. Her appearance changes as Percy looks at her, matching every female he has ever had a crush on (one being Annabeth). She encourages Percy to pursue a quest for true love. She is shown to have interest in Percy's feelings towards Annabeth and promises to make Percy's love life hard. She appears again at the Council of the Gods and votes to let Percy live. Aphrodite is the mother of Silena Beauregard. * Apollo: The god of the sun and archery. The campers in Cabin #7 are his children. He drives a flying red convertible, a Maserati Spyder, that glows brightly like the sun. He appears to be about 18 years old and has sandy colored hair and dazzling white teeth. Apollo wears Ray-Ban sunglasses and sports an iPod. He also loves to recite poetry, especially haikus; Percy describes them as so bad that he would rather be shot by an arrow than listen to one, but Zoe says his limerick days were much worse. Apollo helps Percy Jackson in The Titan's Curse by disguising himself as a homeless man. Apollo is also the god of prophecy and controls the Oracle. In The Last Olympian, he heals Annabeth's broken arm after she was thrown into her mother's throne. * Ares: The god of war. His children are the campers in Cabin #5. He first encounters Percy in The Lightning Thief. Ares drives a huge motorcycle decorated with flames and human skin. He wears red sunglasses that cover his eyes, which are flames. His face is covered with scars from many fights. Once, Ares sends Percy, Grover and Annabeth to retrieve his shield, which he left behind after a date with Aphrodite. They travel to a Tunnel of Love, which ends up being a trap set by Hephaestus. He intercepts Zeus's master bolt from Luke in The Lightning Thief and gives Percy a backpack containing it. He wants to cause discord among Zeus, Poseidon and Hades. Later, he is overpowered by Percy in a duel. He curses Percy that his sword will fail him in battle and departs. Ares returns with minor roles in The Sea of Monsters, while talking to Clarisse and The Titan's Curse. In the book Ares gives Percy the shield and the lightning bolt, but in the movie, Percy gets the lightning bolt from Luke, the son of Hermes. * Artemis: The goddess of the hunt and the twin sister of Apollo. Cabin #8 at Camp Half-Blood is dedicated to her, though it is unoccupied, except for the rare visits when her group of huntresses stays at the camp, such as in Book 3. She has a prominent role in The Titan's Curse. Artemis appears to be about 12 years old. She has auburn hair and silvery- yellow eyes the color of the full moon. Artemis leads a group of teenaged girls, the Hunters. The Hunters pledge to give up love in exchange for immortality. The Hunters never grow up and can only die if they are killed in battle or break their oath. Artemis leaves the Hunters to pursue a monster that has the potential to destroy Olympus. She is abducted along with Annabeth by Atlas and is forced to hold up the sky. She is rescued by Percy who holds the sky for her so she can fight Atlas. Artemis and Percy trick Atlas into holding the sky again. Artemis transforms Zoe into a constellation after she is killed in battle. She seems to like Percy, saying that he's okay for a boy, and later refers to him as a man. She speaks up for Percy, Annabeth and Thalia at the Council of the Gods. She votes for Percy to live. Thalia joins her hunt at the end of The Titan's Curse, preventing her from fulfilling the Oracle's prophecy. * Athena: The goddess of wisdom and battle strategy. She first appears in The Titan's Curse, where she is shown to dislike Percy and his relationship with her daughter, Annabeth. Athena is described as being beautiful but also serious and foreboding. She has black curly hair and intense gray eyes, almost all of her children who live in Cabin #6 have gray eyes. Athena considers Percy to be very dangerous as he has the potential of fulfilling the Prophecy that a child of one of the Big Three will destroy Olympus. She advises Percy that wise counsel is not always the most popular, and cautions him about his fatal flaw. She also votes not to let Percy live. Percy considers Athena one of the most dangerous beings he has encountered, noting that because of her calculating intelligence, her plans rarely fail. Athena is against Percy and Annabeth's relationship. * Demeter: The goddess of the harvest. She is first mentioned in The Sea of Monsters, when Hermes is talking to Percy about the quest. She was also one of the goddesses who voted to keep Percy alive in The Titan's Curse. Demeter made three brief appearances along with her daughter Persephone in The Last Olympian. Her children live in Cabin #4. Her fictional persona in the Percy Jackson book series is obsessed with cereal. * Hades: The god of the Underworld. He is the husband of Persephone and is Nico and Bianca di Angelo's father. Percy first encounters him in The Lightning Thief on his quest to find and return Zeus's master bolt. In The Last Olympian, Hades traps Percy when Nico leads him to the Underworld palace. He plans to put him in the dungeon until Nico turns sixteen, so Nico can fulfill the prophecy. He appears again with Persephone and Demeter to save Olympus. * Hephaestus: The god of forging. He appears as a minor character in The Titan's Curse and as a major one in The Battle of the Labyrinth where he helps Percy numerous times. His children live in Cabin #9. He is the father of Charles Beckendorf. He was thrown off of Mt. Olympus when he was born because Hera thought he was hideous and wanted a \"perfect\" family, though Hera denies it. Hephaestus says that Hera likes telling the story that Zeus threw him off the cliff because \"It makes her seem more likable.\" * Hera: The goddess of marriage. She plays a small role in The Titan's Curse but is one of the gods who help Percy and the others in their quest in The Battle of the Labyrinth. At the end of the book, Annabeth and Percy offend her because she did not care that Luke was gone or that Daedalus and Pan were both dead. She thought they were better off gone. Cabin #2 at Camp Half-Blood is dedicated to her, but is perpetually empty; as the goddess of marriage, she has not given birth to any demigods. * Hermes: The god of travelers, communication, and thieves. He has nearly no role in the first book but is a significant character in the second book where he helps Percy by giving him a flask full of air, backpacks, and his special multi-vitamins, hoping that he will be able to rescue his son, Luke, who had joined the Titans. He is also mentioned briefly in The Titan's Curse. He gets bitter about Luke and gets angry at Annabeth in The Last Olympian for not saving his favorite son, Luke, when she had the choice. All of his children and the undetermined half-bloods stay in Cabin #11. * Poseidon: The god of the sea, earthquakes, and horses. He is Percy's father and his children live in Cabin #3. In the first book, he is suspected of having stolen Zeus's master bolt, but Percy proves the claim false. He appears as a minor character in the next three books. In The Last Olympian, Percy falls unconscious in the ocean and lands at Poseidon's castle. Poseidon is at war with Oceanus, the Titan god of the ocean, and makes Percy go back to camp instead of helping him. He is one of the few gods that does not go and help in the effort to defeat Typhon until Percy tells him that the only way to win is to abandon the sea and fight Typhon. * Persephone: The goddess of springtime and queen of the Underworld. She is married to Hades. Her mother is Demeter, whom she is only allowed to visit in spring and summer. Persephone appears in The Demigod Files and The Last Olympian. She is notably much kinder and more beautiful in the spring and summer. * Zeus: The King of the Gods and the god of the sky. He is a principal character in the first book but is a minor one in the next four. He is the father of Thalia Grace; his cabin is Cabin #1. Poseidon calls Zeus dramatic, saying that he might do better as the god of theatre. * Dionysus: The god of wine and madness. He is the director of Camp Half-Blood, where he was sent by his father Zeus for chasing an off-limits nymph. He is shown to hate his job, but he has to remain at Camp Half-Blood for another fifty years (his punishment used to be 100 years). His children live in Cabin #12. He can be seen playing with the satyrs in camp. He appears in all the books. In The Battle of the Labyrinth, he goes out to search for the minor gods and returns at the end of the book. He rarely bothers to call the campers by their proper names, calling Percy Jackson names such as \"Peter Johnson, \"Perry Johannson\", or \"Pierre Jorgenson\" throughout the series. He also calls Annabeth \"Annie Bell\", regardless of the fact that she has been in Camp Half-Blood since she was seven years old. ==Minor gods== * Aeolus: Greek gods of the winds. They never made an appearance, but they were mentioned in The Last Olympian. They made it hard for the Titan army to hit Olympus by air. Consequently, it also made it harder for Pegasi to fly. * Deimos: The god of terror. He appears in Percy Jackson and the Stolen Chariot in The Demigod Files. Deimos and Phobos (his brother) steal Ares's war chariot from Clarisse. Percy and Clarisse have to get it back to Ares before sunset. On the way, Deimos comes in front of the ferry that Percy and Clarisse are on while riding a sea serpent. He comes back later in the zoo, terrorizing Clarisse by shape- shifting into Ares and yelling at her. Clarisse deduces his true identity and defeats him. * East River: The minor god of the East River. He only appears in The Last Olympian. He dislikes Percy and the Hudson River. Percy asks him to sink all of the Titan ships that come in his river, and splits the sand dollar his father gave him for his fifteenth birthday with East River and Hudson so they both agree to his request. * Hebe: Goddess of youth. She was mentioned in a few of the books in lists of which minor Gods had turned over to the Titans' side. * Hecate: The minor goddess of magic. Hecate helps Kronos in The Last Olympian by attacking Olympus and making cars stay away from Manhattan. She is the mother of C.C. (Circe), who turns Percy into a guinea pig in The Sea of Monsters. She is the ruler of the empousai, two of which attack Percy in The Battle of the Labyrinth. * Hestia: The goddess of hearth and home. She first appears as a young girl, about 8 years old, who wears a simple brown dress and scarf. Percy sees her when he enters Camp Half-Blood for the first time, but does not speak to her. Percy and Nico encounter her in The Last Olympian when she gives them food. She has glowing eyes that remind Percy of a cozy fire. Hestia tends to the hearth in Olympus while the other gods battle Typhon. Hestia gave up her throne for Dionysus in order to prevent a civil war among the Olympians. She explains to Percy that one of the greatest powers is to yield in order to retain peace. Percy offers Pandora's box to Hestia. He tells her that she is the Last Olympian and Hope survives best at the hearth. Hestia accepts, preventing Percy from being tempted to open it. While it is thought that she is weak, it is shown that she is very powerful, as in The Last Olympian,when she is talking to Percy & Nico,she makes a campfire's flames shoot up about sixty feet in the air. Also, she helps Percy when he battles Kronos by making her hearth painfully hot for Kronos when he reaches to get his scythe when it fell into the flames. * Hudson: The minor god of the Hudson River. He first appears in The Last Olympian. He dislikes Percy and East River. Percy asks him to sink all of the Titan ships that come in his river, and splits the sand dollar his father gave him for his fifteenth birthday with East River and Hudson so they both agree to his request. * Iris: The goddess of rainbows. She helps people deliver messages through Iris messages. Percy uses Iris messages a lot throughout the series by finding a rainbow and asking Iris to accept his offering. He then throws a golden drachma into the rainbow, says the name of the person he would like to contact and where the person is, and then he can see and talk to the person. Iris specializes in delivering messages through rainbows. She does not appear in the series but later on gets her own cabin at camp Half-Blood. * Janus: The roman god of gates, doorways, beginnings and endings. He appears as a minor character in The Battle of the Labyrinth, where he offers Annabeth a choice between two doors, which represents the situation she was in when she had to make the decision about saving Luke's soul. He has two faces, and each face seems to think the exact opposite of what the other face thinks. * Morpheus: The god of dreams. He appears in The Last Olympian, putting all mortals to sleep in Manhattan before Kronos's army invades Olympus. He also puts Grover to sleep, after he tries to defend the forest of Central Park. * Melinoe: The goddess of ghosts. She lives in the Underworld. Half of her is pale chalky white and the other half is pitch black. She appears in The Demigod Files in the short story Percy Jackson and the Sword of Hades. She scares people by showing them the ghosts of deaths they regret. She shows Thalia her mother and Nico his mother. Percy does not have any ghosts because he has made peace with them. * Nemesis: The goddess of revenge and balance. She never makes any actual appearances in the books, but she is the mother of Ethan Nakamura, who appears in The Battle of the Labyrinth and The Last Olympian. Ethan mentions her in both The Battle of the Labyrinth and The Last Olympian. She is mentioned by Grover as a \"god\" when he talks to Percy at the start of the series. * Pan: The god of the wild. Satyrs have been looking for him for two thousand years. He appears in The Battle of the Labyrinth. Once Percy and the others find Pan in The Battle of the Labyrinth, Pan dies peacefully. * Phobos: The god of fear. He appears in Percy Jackson and the Stolen Chariot in The Demigod Files. Phobos and his brother Deimos (both sons of Ares) steal Ares's war chariot from Clarisse. Then Clarisse and Percy have to find it. Phobos has the power of showing people their greatest fears. He shows Percy his greatest fear, which is Camp Half- blood catching on fire and burning, when they are fighting in an aquarium in a zoo. The word \"Phobia\" was named after him. * Pompona: Roman goddess of plenty. A statue of her on top of a hotel comes to life in The Last Olympian. She becomes upset with Percy when he thinks she is Demeter. She is also cranky because all of the demigods who walk into the hotel ask her to watch their possessions. She is on the side of the Titans. ==Titans== * Atlas: The Titan General. He is the father of Zoe Nightshade and her sisters, the Hesperides. He was imprisoned in San Francisco upon a mountaintop, forever cursed to uphold the sky. He escaped briefly during The Titan's Curse but was cleverly subdued by Artemis and Percy. He is the father of Calypso. * Hyperion: The Titan of burning light. He appears only in The Last Olympian in a battle against Percy. Hyperion has a very fiery temper and dresses in full golden armor. He was defeated by \\ * Iapetus: The Titan who accompanies Ethan Nakamura in the Underworld in an attempt to steal the Sword of Hades in The Demigod Files. Percy drags him into the River Lethe and brainwashes him. Percy then tells him he is Bob the Titan. * Krios: Krios is mentioned to be Lord of the South and the Constellations and is only mentioned in one of Percy's dreams, where he is forced to babysit Atlas. He is dissatisfied with his condition because he only wears ram horns, but Hyperion can blow up into flame. He is also mentioned fleeing when Kronos was defeated. He wears armor that has glowing stars on it. Jason Grace is said to have defeated Krios during the Roman invasion and assault of Mount Othrys, which happened at the same time as the Defence of Olympus, led by the Greeks. * Kronos: The Lord of the Titans and the main antagonist of the series. He tries to get Percy to join him and fight against the Olympians. His weapon is a sword named Backbiter remade into the scythe. He is the father of the \"Big Three,\" which are Zeus, Poseidon, and Hades. He is also the father of Demeter, Hera, Chiron and Hestia. He was sent to Tartarus by his sons and is reforming in The Sea of Monsters, The Titan's Curse, and The Battle of the Labyrinth. When he eventually reforms himself, he takes Luke as his host body. The only reason Luke was not killed during this was because he bore the Curse of Achilles. In The Battle of the Labyrinth, Kronos is delayed to attack Camp Half-Blood. In the fifth book, Kronos leads the Titans to Olympus while the gods were fighting with Typhon. Later, Annabeth and Percy save Luke, and Luke sacrificed himself to defeat Kronos. * Oceanus: The Titan of the ocean. He did not fight the Olympians in the first war, but in The Last Olympian, he joins Kronos and is at war with Poseidon. Oceanus joins the side that he thinks will win. After it becomes clear that Kronos had lost the battle, he stops fighting Poseidon and escapes back to the depths of the ocean. * Prometheus: The Titan of forethought (and as Grover says, \"Crafty Counsel\", with emphasis on \"Crafty\"). He appeared in The Last Olympian, where he gives Percy Pandora's Box (or Pandora's pithos) which contains the spirit Hope. He fought with Olympians in the first war, then switched sides in the second war because he was sure the Titans would win. He is otherwise neutral, as he always tries to pick the winning side. After Kronos was defeated, he is mentioned to have run away and has sent a list of excuses to the Big Three. * Coeus: The Titan of the North. He appears only in the fourth book of the second series. ==Immortals== * Calypso: Calypso first appears in book four. She nurses Percy back to health on her island. She is shown to be in love with Percy, and is heartbroken when he leaves. She is cursed with this as punishment because her father, Atlas, supported the Titans in the first war. Near the end of The Last Olympian, she is freed from her punishment as part of Percy's wish. She is immortal and lives on an island that makes anyone who lives there immortal for the time of their stay. * Chiron: In the series, he plays the part of the mentor and activities director to the main protagonist Percy Jackson and the other demigods residing at Camp Half-Blood. In the first book, he appears under the pseudonym of Mr. Brunner. Later, it is revealed that he is the son of Kronos. Chiron is a centaur; his horse half is a white stallion. * Eurytion: A worker of Geryon and the owner of Orthus. He is usually seen with a huge club. He is a son of Ares. He is unenthusiastic about and later rebellious against working for Geryon. When Geryon is defeated, he starts planning to take over the Triple G ranch. He gives Annabeth a mechanical spider to find Hephaestus. * Phoebe: The best tracker of Artemis's hunters. She hit the Stoll brothers with arrows in a game of Capture the Flag. She was supposed to go on the quest inThe Titan's Curse, but the Stoll brothers gave her a poisoned (but non- lethal) shirt that prevented her from going. Percy ended up replacing her. * Zoë Nightshade: The lead Huntress of Artemis. She is a daughter of the Titan General Atlas and the sea goddess Pleione. Percy later discovers she made his magic blade, Riptide. She uses a hunting knife and a bow as her weapons. She is a former Hesperide, but was blotted from history for aiding the half-blood Hercules in slipping past the dragon Ladon and obtaining a golden apple. Ultimately, a combination of Ladon's poison and her father's attacks kill her. In remembrance of her sacrifice, Artemis turns her into a constellation, \"The Huntress.\" ==Demigods== * Bianca di Angelo: A daughter of Hades, and later, a Huntress of Artemis. After Artemis is kidnapped in The Titan's Curse, she undertakes the quest to rescue her alongside Percy Jackson, Grover, Thalia, and Zoë. She sacrifices herself to destroy a defunct prototype of Talos because she stole an item from the Junkyard of the Gods. The item she saved was a statue of Hades. Nico di Angelo blames Percy for her death and harbors hard feelings for him for a while afterwards. Nico also throws away the Hades statue that Bianca saved when she died. Later, Nico realizes that Hades is their father and that Maria di Angelo was their mother. * Castor: The son of Dionysus and the twin brother of Pollux. Castor died during the Battle of the Labyrinth. * Charles Beckendorf: A son of Hephaestus, known to be able to build almost anything. He is lead counselor for Cabin 9. He had a minor role in the first four books in the series, but has a larger role in The Last Olympian. He has a crush on Silena Beauregard, whom he starts dating from the short story The Bronze Dragon contained in The Demigod Files. Most members of Camp Half-Blood call him by his surname, Beckendorf. He sacrifices himself at the beginning of The Last Olympian to destroy the Princess Andromeda, a ship that was Kronos' headquarters, unaware that it was actually because of Silena (a spy on the camp) that he lost his life. Beckendorf was named after one of Riordan's former students. * Clarisse La Rue: One of the children of Ares and the head of Cabin #5. She is hot-tempered, arrogant, big, tall, strong, and is known to dislike Percy. Despite her brash nature, she is capable of compassion, shown when she cares for Chris Rodriguez, a half-blood who became a traitor and was later found crazed and stumbling within the Labyrinth during his bout of madness. She is later seen holding Chris's hand at a campfire after Dionysus cures him of his madness. She later befriends Silena Beauregard, apparently after Silena gives her advice on her first boyfriend. She and her cabin later fight with the Apollo cabin because of a flying chariot. She and her cabin later do not join in the battle of Manhattan because of the chariot, though Michael Yew gives it to them. Silena later impersonates her to bring the Ares cabin into the battle by taking her armor and spear. Later, Silena is killed by a drakon while she leads the cabin into fighting. Clarisse then grabs her spear back, runs up the drakon and stabs its eye, fully blinding it (Percy already blinded the other eye). The spear then breaks, electrocuting, and killing, the drakon. She then runs at Kronos's armies, acting as invulnerable as Percy is even though she does not have the Curse of Achilles. Percy recognizes that an aura around her highly resembles that of Ares when Percy fought him. Thalia remarks that it is a blessing of Ares and that she has never seen it before in person. She is later frozen by a giant, and, after thawing, is welcomed to Olympus by her father, who is very proud of her. * Chris Rodriguez: An undetermined half-blood who had gone to Kronos's side until having gone completely insane in the Labyrinth. Clarisse finds him and Dionysus makes him normal again. He later has a relationship with Clarisse. * Connor Stoll: One of the children of Hermes. He is brother to Travis Stoll. Both are known to be crafty and mischievous. He and his brother's shenanigans incapacitated a member of Artemis's Huntresses, which enabled Percy to join the quest of The Titan's Curse. He and his brother have a larger role in The Last Olympian and both survive. He and his brother head Cabin 11 after Luke goes over to Kronos. Connor was named after one of Riordan's former students. * Daedalus: Inventor of the Labyrinth and son of Athena, he killed his nephew and took his notes, which he then used to cast his animus (soul) into automatons after Athena branded him with the murderer's hand. He originally owned a hellhound named Mrs. O'Leary and fights the Titan army toward the end of the fourth book. He later decides that it is time to go to the Underworld and leaves. He gave his laptop to Annabeth. It is filled with his notes and ideas. * Ethan Nakamura: A son of Nemesis who feels that his mother is unappreciated and fights for her. She took his eye in return for the promise that Ethan would change the world. He turned to Kronos' side after Percy saved his life by letting him live after a duel. After the duel, he pledges himself to Kronos, the last half blood needed for his resurrection. In The Last Olympian, he tries to stab Percy in the small of his back (his Achilles spot), but Annabeth leaps in front of the dagger, and Kronos believes that he tried to stab Percy's Achilles spot. He is in the truce party along with the Empousa queen and Prometheus. Ethan later figures out that the small of Percy's back was his Achilles spot, but instead of killing him, he tries to kill Kronos. Kronos laughs, and kills him easily. Ethan's last words were \"Deserve better...if they [the minor gods] just...had thrones...\" * Jake Mason: A son of Hephaestus. He becomes the head of Hephaestus' cabin after the death of Charles Beckendorf in The Last Olympian. He fights in the war between the gods and Titans. * Katie Gardner: A daughter of Demeter and the head of her cabin. She fights in and survives the war between the god and the titans. She strongly dislikes Connor and Travis Stoll, because they once put chocolate Easter bunnies on the Demeter cabin's grass roof. * Luke Castellan: One of Hermes's children and a major antagonist of the series. Though initially the counselor of Cabin 11 and an ally to Percy, he revealed his true nature as a high-ranking member of Kronos's army by attempting to kill Percy at the end of The Lightning Thief, and on several occasions afterwards. He is shown to harbor a great bitterness towards the gods (particularly his father, Hermes) for what he regards as abandonment. His mom is driven crazy because she tried to become the Oracle. After reforming, Kronos took Luke's body as his own but when he saw Annabeth and the knife he gave her, he remembered his promise to Annabeth that he would never harm her. After Percy made his choice to give Luke the knife, Luke kills himself by stabbing his own Achilles spot to destroy Kronos, fulfill the prophecy, and become the hero of the war. It is unclear but sort of obvious that he likes Annabeth Chase because he tries to save her from being killed by Atlas in The Titan's Curse. * Lee Fletcher: A son of Apollo. He was the original head of Cabin 7 before he was killed in The Battle of the Labyrinth. * Michael Yew: A son of Apollo. He is the leader of the Apollo Cabin after Lee Fletcher died in The Battle of the Labyrinth. He is described as very short, four foot six, with personality that makes up for his height. Percy finds that very interesting that he's the counseler. He is killed leading a group of demigods in the fight against Kronos' army. Percy looked everywhere for him, but his body was not recovered at the time. * Malcolm Pace: A son of Athena. He is the assistant counselor of the Athena cabin. He leads Athena's cabin to a bridge or tunnel in The Last Olympian. He walks in on Percy and Annabeth hugging in The Battle of The Labyrinth. * Mark: A son of Ares. He is mentioned by Percy once in The Demigod Files in the short story Percy Jackson and the Stolen Chariot when Percy asks Clarisse which of her brothers played a prank on her. He may have been the one that Percy awoke from a midday nap in The Titan's Curse. * Nico di Angelo: A son of Hades. When his sister Bianca dies, he blames Percy and vows revenge. In the fourth book, Percy sees an Iris message from Bianca of Nico talking to a spirit while in the Underworld. Nico returns at the Triple G Ranch and then leaves it to avoid Percy and friends, from whom he has just discovered were not responsible for the death of Bianca. He comes back again and saves Percy, Rachel, Grover, Annabeth, and Tyson from Kronos, the Lord of Time. Doing this, Nico exposes the fact that his father is Hades, making him vulnerable; Kronos will try to bring him to his side because he is a son of one of the Big Three. He also fights in the Battle of the Labyrinth, leading an army of ghostly soldiers, but later disappears after noting that he is not welcomed at Camp Half-Blood, much like his father is not welcomed at Olympus. He reappears several months later and informs Percy of a plan that could lead to sending Kronos back to Tartarus. In the final book, he convinces Percy to bathe in the River Styx, making him undefeatable, but not before taking Percy to Hades in exchange for information about his mother. He later rescues Percy, and convinces his father Hades to help defend Olympus. * Pollux: The son of Dionysus and the twin brother of Castor. He and his brother are described as blond, athletic, plump faced and good looking. He fights and survives the war between the Titans and the Gods, making his father secretly happy. * Silena Beauregard: A daughter of Aphrodite and the head of Cabin 10. Percy regards her as one of the nicer girls of the cabin and acknowledges that she is pretty, but still finds her to be a \"neat freak\". She participates in the Battle of the Labyrinth. She does not think that she is a good fighter and feels that she does not do anyone any good at camp. She unveils her hatred towards the hunters of Artemis, who say that love is worthless, to which she responds by stating that she is going to \"pulverize\" them. Silena is killed by a drakon when she fights it pretending to be Clarisse in The Last Olympian. It is also revealed in The Last Olympian that she was the spy giving Kronos information about what was going on at Camp Half-Blood, though when the Stoll brothers ask Percy about it, he will not let Silena be remembered that way. She did, however, want to stop being the spy when her boyfriend Charles Beckendorf died (charming her with his looks, Luke had promised that fewer lives would be lost and that Charles would be safe), but was blackmailed by Luke, when he threatened to reveal her betrayal. This causes Silena to become even weaker or as Percy described, \"She looked like glass. Like she was going to break at any time.\" Percy also notes that no one says the word \"spy\" during the burning of her shroud. * Sherman: A son of Ares. He, like Mark (another son of Ares), is mentioned by Percy in The Demigod Files in the short story Percy Jackson and the Stolen Chariot, when Percy asks Clarisse which of her brothers played a prank on her. He also may have been the one that Percy awoke from a midday nap in The Titan's Curse. * Thalia Grace: A daughter of Zeus. Grover Underwood was assigned to watch over her when she ran away from home at ten years old. On her journey, she met Luke Castellan and Annabeth Chase. They also had brief encounters with the Hunters of Artemis and she was enticed to join by Zoë Nightshade. When she was twelve, they were all soon attacked by a herd of monsters and caught by a Cyclops in New York. She was captured, but thanks to Annabeth, was freed. They escaped, but found that the monsters they had briefly escaped caught up to them. As they reached Half-Blood Hill, Thalia sent Luke, Grover, and Annabeth over the boundary line while she faced the monsters. She sacrificed her life for her friends, and her father, Zeus, took pity on her and transformed her to a pine tree. She is later brought back to life by the Golden Fleece and joins the quest in the third book where she ultimately joins the Hunters, taking the place of Zoë Nightshade. * Travis Stoll: One of the children of Hermes. He and his brother become the new counslers of cabin 11 after Luke went to Kronos. Travis is the older brother of Connor Stoll. Both are known to be crafty and mischievous. Percy finds it ironic that their last name is Stoll, like the word 'stole'. His and his brother's shenanigans incapacitated a member of Artemis's Huntresses, which enabled Percy to join the quest of The Titan's Curse. He and his brother have a larger role in The Last Olympian and both survive. Travis Stoll is often confused as Connor Stoll's twin, whereas Travis is actually older than Connor. Both Travis and Connor were named after two of Riordan's former students. * Tyson: He is a Cyclops, the son of Poseidon and a Nature Spirit. Technically he is not a demigod, but at camp he lives in Percy's cabin. He first appears in The Sea of Monsters as a homeless boy. He is afraid of Grover while Grover is also afraid of him. * Will Solace: He is a son of Apollo whom Percy took to heal Annabeth in The Last Olympian. ==Monsters== * Briares: He first appears in The Battle of the Labyrinth when Percy, Annabeth, Tyson, and Grover rescue him from Alcatraz, where he is being held prisoner by Kampe. Briares is one of the three Hecatonchires (\"the Hundred-Handed Ones\"), elder brothers to the Cyclopes. His siblings are Kottos and Gyes. Like all other Hundred-Handed Ones, he has fifty different \"faces\" indicative of his moods. He is very frightened and timid due to his years of imprisonment and feels that he is of no use. Because of this, he runs away from Percy and his companions in the mazelike Labyrinth. However, Daedalus finds him and they both show up to fight for the Olympians in the battle at Camp Half-Blood at the end of The Battle of the Labyrinth. Briares seizes the chance to bury Kampe under a pile of rocks. At the end of The Battle of the Labyrinth, he goes to help the Cyclopes in Poseidon's forge. In The Last Olympian, Briares is shown fighting alongside Poseidon. * Cerberus: The three headed dog who guards the Underworld entrance to the living. In The Lightning Thief, he befriends Annabeth. He also appears in \"The Last Olympian\" when he is playing with Mrs. O'Leary. He is the son of Echidna and Typhon. * Charybdis: One of the two monsters (the other being Scylla) that live on either side of a narrow channel of water. She takes the form of a giant mouth that swallows and releases water, creating whirlpools. * Chimera: A three- headed beast that is part lion, part goat, and has a snake-headed tail. It is first seen in the form of a Chihuahua. It confronted Percy atop the St. Louis Arch alongside its mother, Echidna. Overwhelmed by the creature and poisoned by its snake head, Percy was forced to jump into the water far below to escape it. Disappeared after Percy dove into the water * Clazmonian Sow: A flying pig that appeared directly after Hyperion was defeated. Annabeth doesn't believe that anybody has defeated it, but Theseus defeated it in mythology. Percy defeats it with the help of Blackjack, a statue of Hermes, and two stone lion statues. * Cyclops: One eyed-giants who are brutal and savage by nature. The majority are sons of Poseidon, and thus Percy's half-brothers by default. The only exception to their savagery is Tyson, who is kind and gentle and extremely fond of Percy and Annabeth. He later visits Poseidon's kingdom to work in the Cyclopes' Forges. * Dracaenae: Snake women who make up a considerable portion of the Titan Lord's forces. * Dr. Thorn: He is the vice principal of Westover Hall, the school that Bianca and Nico di Angelo attended. He has two eyes of different colors, one blue and one brown. His nostrils flare up when he talks. His true form is a manticore. * Echidna: Part woman, part snake. She is the wife of Typhon and the mother of Cerberus, Chimera, Hydra, Nemean Lion, and Ladon, as well as several others not in the series. She is first seen as an old lady that owned the chihuahua that was actually Chimera in disguise. She assisted Chimera in fighting Percy at the top of the St. Louis Arch. * Empousai: Seductive shape-shifting beast women who are similar in appearance to vampires with both shaggy donkey legs and bronze legs. Two, Tammi and Kelli, pose as cheerleaders in The Battle of the Labyrinth. In The Last Olympian, the Empousa queen appears as part of the truce party along with Prometheus and Ethan Nakumura. * The Fates: The three women who control the threads of life. * The Furies: Alecto, one of the Furies, acted as Percy's pre-algebra teacher Mrs. Dodds in the first book. She is Hades's main servant. The Furies act as Hades's minions and personally searched for Hades's Helm of Darkness, thinking that Percy had stolen it. * Hellhounds: Hellhounds are a main part of Luke's army and monsters in general. They are described as very large black dogs that have fire glowing in their eyes. They were also mentioned to live in the Fields of Punishment. Daedalus owns a hellhound named Mrs. O'Leary, who, unlike her relatives, is loving and loyal. * Hekatonkheires: Hundred-Handed Ones; giants of incredible strength, superior even to the Cyclopes. They are taller than mountains. The last one, Briares, was imprisoned by Kampe in the fourth book. When Tyson finds that Briares is too afraid to escape, he is heartbroken. At the end, Briares returns helps defeat Luke and the Titans. In The Last Olympian, Percy sees Briares helping Poseidon defeat the forces of Oceanus. * Hyperboreans: Ice giants who freeze into ice when defeated. They side with Kronos in The Last Olympian. * Hydra: A monster with nine of heads. Every time a head is chopped off, two new heads grow back. This monster appears in The Sea of Monsters. * Kampe: A snake-haired, centauroid creature that is half-woman, half dragon with wings and the heads of various mutated wild animals growing from her human torso. She is a monster that imprisoned the Hundred-Handed Ones and Cyclopes during the First Great War. She is feared by all, and is defeated by Briares in the \"Battle of the Labyrinth\" by being crushed by boulders. * Laistrygonians: Large, muscular cannibals who serve as the brawn of Kronos's army. In Sea Of Monsters and in Son Of Neptune, they are referred to as \"canadians\" even though it annoys Frank, who is Canadian. * Ladon: The giant dragon who is one of the offspring of Echidna. It defends the Hesperides' apple tree. Ladon poisons Zoe Nightshade in The Titan's Curse. * Manticore: These monsters have human faces and the bodies of lions as well as thorny tails. Dr. Thorn is a manticore. * Medusa: The gorgon monster who, under the moniker of \"Aunty Em\", attempted to lull Percy, Annabeth, and Grover into a false sense of security and turn them into stone statues. She is defeated, and her severed head is mailed to the gods of Olympus as proof of the trio's courage (though Grover notes that it is more akin to impertinence). Percy's mom uses her head to turn Gabe Ugliano to stone. * Minotaur: The monster of the labyrinth that chased Percy all the way to Camp Half-Blood. He defeats the monster atop Half-Blood hill and claims its broken horn as a spoil of war. The Minotaur returns in The Last Olympian as a general for Kronos's army at Williamsburg Bridge, only to be defeated again. * Mrs. O'Leary: Mrs. O'Leary is the one of the only friendly hellhound to ever exist. Quintus (Daedalus) was her original owner, but, after asking Nico Di Angelo to kill him, Percy becomes the hellhound's owner. While Percy is in the \"mortal world\", Charles Beckendorf takes care of her at Camp Half-Blood. * Nemean Lion: A lion that is one of the children of Echidna and Typhon. Luke and Atlas sent the Nemean Lion to the National Air and Space museum to stop the group of questing Hunters and Demigods. It battled with Percy Jackson, but was hard to defeat because of its bulletproof and swordproof pelt. Percy eventually defeated it by throwing astronaut food into its mouth to expose it's one unprotected surface, it's mouth. * Ophiotaurus: A half-cow half-snake monster. It is an ancient monster that could bring down the gods if it was slain and its entrails were sacrificed. It was nicknamed Bessie by Percy Jackson who initially assumed it was female, although Grover later informed him that it was a male. Percy saved it from a trawler's net after being fetched by the Hippocampi. * Sirens: Dangerous bird-women whose sweet songs have led many sailors to watery deaths. Their hymn is almost Annabeth's undoing. * Scylla: One of the two monsters (the other being Charybdis) that live on either side of a narrow channel of water. Should a ship sail to close to her, she uses her six heads to pluck off crew members upon deck and devour them. * Telekhines: Dog-faced sea demons that reforged Kronos's blade in the fourth book. Some set Percy on fire in the fourth book. They also appear in the fifth book. In the fourth book, they are referred to as \"telekhines\", however in the fifth book, they are referred to as \"telkhines\", without the other \"e\". This may be a typographical error or something different of the author's choice. * Typhon: A very powerful monster. He sired many monsters by Echidna. He lives and sleeps inside Mount Saint Helens. Percy is such a powerful demigod that he almost wakes Typhon during his visit there. In The Last Olympian, he awakens and moves across America while destroying everything in his path. The gods of Olympus try to stop him but he is too powerful. In the end, Poseidon and his army come to help defeat him. ==Mortals== * Darrin: One of the many people in the Lotus Casino. He is described as about thirteen, and \"some Elvis impersonator's son\". Percy meets him at a Virtual reality shooter game. He has apparently been in the Lotus Casino since 1977. * Gabriel \"Gabe\" Ugliano: Known as \"Smelly Gabe,\" he is Percy's stepfather. During summer break from school, Gabe asks him for money for beer and for his poker games with his friends. It is implied that, at least once, he hit Percy's mother. Grover later tells Percy that Sally (Percy's mother) married Gabe to protect Percy from monsters who would have tracked him down otherwise. He stinks so bad that his smell confuses monsters and they could not smell him. If she did not marry him, monsters would have found Percy a very long time ago. At the end of Book 1, he is turned to stone by Percy's mother (using Medusa's severed head) and sold as a statue, \"The Poker Player\", earning lots of money in the process. * May Castellan: Luke's mother who had attempted to become the new Oracle of Apollo. Since Hades's curse prevents her from taking it, she was driven crazy and receives small glimpses of her son's future. * Dr. Frederick Chase: Annabeth's father and he first appears in The Titan's Curse. He allows Percy, Thalia, Zoë, and Grover to borrow his car to drive to Mt. Tamalpais (Mount Othrys). Annabeth's father is a professor who knows a lot about war. He also owns a plane. He and his daughter have had a lot of problems in the past, which is why she ran away home when she was seven years old. He lives in San Francisco with his wife and two sons. In The Titan's Curse, he helps Annabeth and Percy battle Atlas and his troops. * Mrs. Dare: Rachel's mother. She briefly appears in The Last Olympian. She went to Clarion Ladies' Academy, a finishing school for society girls in New Hampshire, and wants Rachel to go there as well. * Nancy Bobofit: A freckled, redheaded, kleptomaniac girl that went to Yancy Academy with Percy in The Lightning Thief. Percy finds her very unkind and annoying. She bullies Grover and Percy at any chance she has. She only appears in the first few chapters of Book 1. * Paul Blofis: Sally Jackson's boyfriend and later fiancé, and thus Percy's stepfather. Percy and his mother reveal to Paul the truth, and at first he only half believes them. When Percy, Nico, and Mrs. O'Leary come unexpectedly into Sally's apartment, Paul fully believes, and thinks it's \"awesome!\". Paul turns out to be an excellent swordsman and assists in the fight to save Olympus in The Last Olympian. He seems to have a good father-son relationship with Percy. * Preacher: A preacher who raised money supposedly for orphans and spent it instead on his mansion. He died in a police chase when he drove his \"Lamborghini for the Lord\" off a cliff. He was sent to the Fields of Punishment, but believed that he was in the Christian hell. * Rachel Elizabeth Dare: A clear-sighted mortal girl who is able to see through the Mist. She is first encountered by Percy during The Titan's Curse as he flees from the skeletons summoned by Atlas. After mistaking her for a monster and realizing she is human, Percy discovers that she can see through the mist. She leads the skeletons away from Percy. Rachel is encountered again in The Battle of the Labyrinth and aids Annabeth and Percy through the labyrinth. Later, at Percy's request, she uses her clear sight to guide them through the labyrinth to Daedalus's workshop, from where she, Percy, Annabeth, and Nico escape, only to enter again to locate Grover and Tyson. She is present at the deathbed of Lord Pan and, like the others, takes part of his essence within her. By throwing her hairbrush at Kronos, she provided enough of a distraction for Percy to escape the Titan Lord's time manipulation. It is hinted throughout the series that she harbors romantic feelings for Percy. In The Last Olympian, she turns into the Oracle, who should stay as a single woman (unless they are already married). * Sally Jackson: The daughter of Jim and Laura Jackson, who died in a plane crash. She is the mother of Percy; she was married to Gabe, then turned him to stone with the head of Medusa, and marries Paul Blofis in the fifth book. In the beginning of the series, it is indicated that Sally works at a candy shop called \"Sweet on America\" and said that she wanted to be an author when she was young. In the third book, Percy guesses that Sally can see through the Mist and she says that was probably the reason Poseidon took interest in her. She said that Poseidon was walking along Montauk Beach when she asked him why he had a trident in his hand. They fell in love in the middle of the conversation. * William Dare: He is Rachel Elizabeth Dare's father and first appears is in The Last Olympian. He owns a land developing company and is very wealthy. His family lives in a mansion in Brooklyn, where Rachel lives on the top floor. Rachel hates her father because of his job, but he seems to care about her. He said him and her mother had really been looking forward to the vacation, but, according to Rachel, they both hate the beach, and are just too stubborn to admit it. He walked into Rachel's room in Percy's dream, wearing pajamas with \"WD\" monogrammed on the pocket. * Sisyphus: A man that cheated death many times. His punishment in The Fields of Punishment was to roll a boulder up a hill. He appears in The Demigod Files in The Sword of Hades when Percy, Thalia, and Nico ask him advice. He does not really help them much, but he does say that he had helped someone else. He said that he told that other person to go see Melinoe. After that, Percy and his friends go to see her. * Tantalus: Tantalus is a spirit from the Fields of Punishment who becomes the activities director at Camp Half-Blood after Chiron is fired. He appears in The Sea of Monsters as a minor character. He is shown to hate Percy and his friends even more than he hates most half-bloods, yet shows favoritism to Clarisse, such as naming her hero when the camp was attacked by Cholcis bulls, or when she wins the chariot race, he throws a banquet in her honor. When the camp is attacked by a large flock of Stymphalian birds, Tantalus blames it on Percy, Annabeth, and Tyson's \"bad chariot driving\", despite that they were the ones who defeated the birds. When Tyson is brought to camp, Tantalus insults and makes fun of him, even when Tyson is claimed by Poseidon. He is cursed so that he cannot eat or drink, and this is made a joke when at the end of the book his curse is lifted just before he is sent back to the underworld, though none of the campers were sad to see him go. ==Others== * Blackjack: He is a pure black pegasus and one of Percy's many companions. He is first introduced in the second book The Sea of Monsters on the Princess Andromeda, Luke's demon cruise ship, where Percy rescued him from Kronos's minions. Ever since then, Blackjack has felt like he has to pay Percy back for saving him and he does whatever Percy asks. * Juniper: Juniper is a tree nymph. She is Grover Underwood's girlfriend. * King Minos: King Minos is a ghost that Nico summons in book four that is pretending to advise him on how to bring Bianca back from the dead, when really, he is trying to bring himself back. He is also seen as a live king in Percy's dreams/flashbacks. Near the end of the book, it is revealed that he is serving his own dark purpose when he kidnaps Nico and trys to kill Deadalus and use his soul as ransom. * Leneus: Leneus is a member of the Council of Cloven Elders. He is killed in The Last Olympian and is reincarnated as a laurel. He hates Grover and thinks he is a liar. When he dies, Grover takes his spot in the Council of Cloven Elders. * Maron: Maron is a member of the Council of Cloven Elders. He only appears in book four, when he, Silenus and Leneus try to exile Grover because they think that Pan, the god of the wild, is still alive and Grover is a just lying about his death. He and the other members of the Council are described as being old and fat satyrs. * The Oracle of Delphi: Apollo's Oracle of Delphi used to live in the mummified remains of its host until its spirit was transferred to Rachel Elizabeth Dare in The Last Olympian. The Oracle's spirit originally passed from the deceased oracle to a newly chosen oracle; however, at the end of the second world war, the oracle gave a Great Prophecy predicting a child of the Big Three (Zeus, Posiedon, and Hades) would determine whether or not the gods would be preserved or destroyed. Using this information, the Big Three entered a pact in which none could continue to sire heroes. In spite of this, Hades bore two young children, Nico di Angelo and Bianca di Angelo. Zeus, fearing that either were the children of the prophecy, destroyed the hotel where the di Angelos lived with his master bolt, killing Maria di Angelo, Hades' lover. In revenge, Hades cursed the Oracle to ensure that the spirit of the Oracle of Delphi would not pass to a new host but be trapped inside the body after the death of its host in hopes that it would soon return to the dust along with its bodily prison. After the Battle of Manhattan in which Hades and Nico successfully assist in the defense of Mount Olympus, Zeus honors the Lord of the Dead. In response to his newfound respect from the other gods, he lifts the curse, allowing the Oracle's spirit to pass on into Rachel Elizabeth Dare, effectively releasing the trapped soul of the last host of the Oracle. * Party Ponies: They are Chiron's kin. As their name suggests, they are a vast clan-like extended family of rowdy centaurs who live in the United States with chapters hailing from each respective state. They are key players in two major incidents in the series. In The Sea of Monsters, they along with Chiron rescue Percy from Luke during their duel on the Princess Andromeda. In The Last Olympian, they help Chiron and the others fight the major battle between the Gods and the Titans. * Silenus: Silenus is a minor character, appearing in books four and five. He is the leader of the Council of Cloven Elders and is shown to hate Grover, calling him an \"outcast\" and a \"liar\". ==References== * Category:Lists of fictional characters",
 "title": "List of Percy Jackson and the Olympians characters"
}