{
 "id": "233004",
 "text": "Lagerstätte (plural: Lagerstätten) is a German word for places (sites) of exceptional fossil preservation. Adolf Seilacher coined the term in 1970 to describe sites, like Solnhofen, which yielded the most exceptional fossils.Seilacher A. 1970. Begriff und Bedeutung der Fossil-Lagerstätten: Neues Jahrbuch fur Geologie und Paläontologie. Monatshefte 1970: 34–39. Extra- special sites are called Konservat-Lagerstätten (conservation Lagerstätten). These are deposits known for the exceptional preservation of fine details. There skeletons are mostly articulated (bones together in life form), and the soft parts are preserved as impressions or casts. == Preservation == In Lagerstätten the normal processses of decay after death were less active or halted as sediment was deposited. This allowed the preservation of soft parts and exceptional detail. There are several possible causes which allow this to happen: #Anoxic or near anoxic conditions (e.g. oxygen-free mud) which suppresses common bacterial decomposition long enough for the initial casts of soft body parts to register. #Rapid burial in volcanic ash from a nearby eruption. This prevents scavengers and burrowing animals from reaching the dead body. It also produces a low-oxygen environment. #Rapid burial by mud- slides. #High salt content in the water, which few organisms can live in. This condition occurred in the lagoons which produced the Solnhofen limestone. In these conditions, which are exceptional, scavengers, burrowers and bacteria are eliminated or reduced. Then the normal processes of deposition and fossilisation produces strata containing exceptional fossils. == Lessons learnt == Most of what we know about the details of extinct life comes from these exceptional sites. The soft-bodied Ediacaran biota, the fins of ichthyosaurs, the fur and wing structure of pterosaurs, the feathers on Mesozoic dinosaurs and birds, are all discoveries made on fossils from Lagerstätten. These sites preserve much of the fauna and flora of the time and place. That permits reconstruction of its ecology. == Short-list of Lagerstätten == There are over 50 sites which have been described as Lagerstätten. — A catalogue of sites of exceptional fossil preservation produced by MSc palaeobiology students at University of Bristol's Department of Earth Sciences. *Precambrian: ::Bitter Springs, South Australia ::Mistaken Point Ecological Reserve, Newfoundland, Quebec *Cambrian: ::Sirius Passet, Greenland. ::Burgess Shale, British Columbia, Canada ::Qingjiang biota, Hubei, China *Ordovician: ::Fezouata Formation, Morocco *Devonian: ::Rhynie chert, Aberdeen, Scotland *Carboniferous (Pennsylvanian): ::Mazon Creek, Illinois; ::Joggins Fossil Cliffs, Nova Scotia *Upper Jurassic: ::Morrison Formation, western U.S.A. ::Solnhofen limestone, Bavaria, Germany *Lower Cretaceous: ::Jehol biota: Yixian and Jiufotang formations, China. *Upper Cretaceous: ::Burmese amber fossils; ::Smoky Hill Chalk: Zhucheng dinosaur site *End Cretaceous: ::Tanis, North Dakota: Tanis fossil site *Eocene: ::Messel Pit, Germany ::Green River Formation, Utah. ::Florissant Formation, Rocky Mountains, Colorado *Oligocene/Miocene: ::Riversleigh, Australia *Pliocene ::Gray Fossil Site, Tennessee *Pleistocene: ::Rancho La Brea tar pits, Los Angeles, California. == References == Category:Paleontology *",
 "title": "Lagerstätten"
}