{
 "id": "23334",
 "text": "Exodus is the second book in the Torah. Exodus in Hebrew is called Shemot, which means 'names.' Exodus means 'going out' in Latin. It is about how the Hebrew people were led out of Egypt by God. Moses, their leader, hears God's words and then tells the Israelites. Exodus ends with God's laws and his instructions on how to build a holy container called the Ark of the Covenant. == Summary == After the Hebrews went to Egypt to get food, the old Pharaoh died, and a new Pharaoh came to power and made each Hebrew a slave. The Pharaoh made the Hebrews work very hard and told his soldiers to throw their babies into the Nile River. One baby was put in a reed basket and floated on the Nile. He was later rescued by an Egyptian princess who named him Moses. Moses grew up in Pharaoh's palace, and later killed an Egyptian slavedriver. Moses escaped from Egypt and lived away from his people in Midian. He lived with Jethro, his father-in-law. One day, while Moses was tending his flocks, God appeared in a burning bush to Moses and told him to lead the Israelites out of Egypt. As Moses had no confidence in doing this, God gives him his brother Aaron to help him. Aaron was good at speaking and helped Moses speak to the Pharaoh. When he returned to Egypt, Moses asked the Pharaoh to let the Israelites go, but the Pharaoh refused. Through God's power, Moses causes ten plagues to come on Egypt. The last plague was the death of all the firstborns in Egypt. Only the Israelites' firstborns were spared, as they had the blood of a young lamb on their door, so God did not let the Angel of Death enter their houses (12:23). The Pharaoh finally decided to let the Israelites go. While the Israelites were crossing the Sea of Reeds, the Pharaoh changed his mind and decided to follow them with his troops. The Israelites passed safely as Moses split the Sea with his staff by God's power. Once the Hebrews all passed the sea closed, leaving all the Pharaoh's troops to drown. Later, at Mount Sinai, Moses received the law and the Ten Commandments from God. But the Israelites sinned against God by worshiping an idol (a golden calf). Moses broke the first two stone tablets of the Ten Commandments in anger. God later gave him another two. He also told Moses how to build the Ark of the Covenant. ==Rabbanic Literature== The first settlment of the Jews in Egypt came with the extended families of the 12 sons of Jacob settled in Egypt. On the 15th of Nissan of the year 2447 from creation (1314 BCE) -- exactly one year before the Exodus -- Moses was shepherding the flocks of his father-in-law, Jethro, at the foot of Mount Sinai, when G-d appeared to him in a \"thornbush that burned with fire, but was not consumed\" and instructed him to return to Egypt, come before Pharaoh, and demand in the name of G-d: \"Let My people go, so that they may serve Me.Chabbad Jewish Timeline210 years after the settlement of JAcob Sons in Egypt on the 15 day of Nissan by the Jewish calendar year 2448 [1313 BCE] after the creation of the world was PAssover[https://www.jhi.pl/en/articles/pesach-one-of-the-greatest-miracles- in-jewish- history,5377#:~:text=At%20midnight%20on%2015%20Nissan,the%20Hebrew%20translation%20being%20Pesach.Pesach – one of the greatest miracles in Jewish history Written by: Lauren Colgan ]and the Exodus of Jews from Egypt by the direction of the L-D under first Moses and then Joshua.Chabbad Jewish TimelineAccoding to the Torah the Jews who left Egypt numbered 600,000 fighting men with their extended families with an estimated total of 3,000,000 to 3,600,000. However the Torah also explains that of the total of Jewish persons in Egypt only 20% left-while the remaining 80% choose not to leave.Number of Jews at Exodus Aish Torah.org Rabbanic Literature gives a number of reasons of why there were those who choose not to leave:. \"..In short, there were millions of Israelites who had collaborated with the Egyptians and gained much power and wealth. As such, they didn't want to leave...\"Chabbad Ask the Rabbi Responce 7/25/2024\".. Our Rabbis explain to us that the 80 percent were so entrenched into their reality and culture of Egypt that they simply lost the will to leave...\"Aish Torah Ask the Rabbi Responce 7/28/2024Because of their refusal to leave...\"..They were so steeped in Egyptian culture that they were unwilling to join the Exodus. As such, they were lost to the Jewish nation forever.\"AIsh Torah Ask A Rabbi \"Number of Jews at Exodus\"\"Ten Times the Israelites rebelled and tested the L-D during Exodus despite his revealation to them; according to rabbinic literature it was because \"..They were still laboring under the slave mentality of the Egyptian bondage.\"From Chabad Ask a Rabbi Simcha Bart. [See also Link] \"Please listen to https://www.chabad.org/851836 about these tests.\" === Media === The book has been filmed several times, as The Ten Commandments and The Prince of Egypt. ==References== Category:Old Testament books Category:Books of the Hebrew Bible Category:6th-century BC books",
 "title": "Exodus"
}