{
 "id": "233585",
 "text": "The Brak Show is a Adult Swim program starring Brak who was on several old Space Ghost cartoons. The show is also about Brak's mom and dad, his friends Zorak and Clarence, his brother Sisto, and his neighbor Thundercleese. At first the show had a plot, but later on became just crazy like its sister show Aqua Teen Hunger Force. ==Main Characters== *Brak: A childlike character that likes to sing a lot. He is very dumb, and he even thinks his dad is the smartest guy he knows. He is very close friends with Zorak even though Zorak is constantly mean to him. He is a very nice cat creature that would try to help about everybody that could use him. He wears a black suit with a blue x on his chest. *Dad: A very short human looking alien. He is very lazy and bossy to his wife and Brak. He is almost always sitting in his kitchen chair, and when his chair was moved he got very mad. He has not worked since 1984. He has said that he has family members that he does not get along with. He is very dumb, and has a bad time remembering the past. *Mom: A very nice mom and wife who does most of the work for Brak and Dad. She is a cat creature of the same race as Brak. She does not seem to be attaracted to Dad, except when she was drunk. When she was voiced by Marsha Crenshaw she was nice, but when Jonna Dainels voiced her she gave the character a British accent. *Zorak: A pure evil pray mantis. He is a very bad friend and infulance to Brak. The only thing he cares about the pain and suffering of others. He is 40 years old, and he can turn invisible. He wears a blue vest and yellow gloves and boots. Evantually he will be sent to hell. *Thundercleese: Brak's robotic next door neighbor. He often blows up Zorak for ruining his yard which wgot the yard of the year award. He says that he is a warrior. He was depowered by the company that created him, but then he was repowered so he could save the world. Brak really likes him, and he had a feud with Brak's Dad once. ==Voice cast== * Andy Merrill as Brak and Clarence * George Lowe as Dad and Space Ghost * C. Martin Croker as Zorak and Moltar * Carey Means as Thundercleese * Marsha Crenshaw as Mom (episodes 1-13) * Jonna Dainels as Mom (episodes 14-28) * Don Kennedy as Morlun and Poppy Andy Merill and George Lowe appear in all episodes. C. Martin Croker was absent for two episodes. Carey Means was absent for ten episodes. Category:Adult Swim Category:English- language television programs",
 "title": "The Brak Show"
}