{
 "id": "233632",
 "text": "The axolotl (Ambystoma mexicanum) is the best-known of the Mexican mole salamanders: it belongs to the Tiger Salamander complex. The axolotl shows paedomorphosis: the larvae do not undergo metamorphosis, so the adults stay aquatic, with external gills. == Natural history == The species evolved in the lake underlying Mexico City. Axolotls are often used in scientific research because they can regenerate most body parts, are easy to breed, and have large embryos. Axolotls are closely related to waterdogs, the larval stage of the closely related Tiger salamanders Ambystoma tigrinum and Ambystoma mavortium. These are common in much of North America and also sometimes become neotenic (see #Genetics and development below). The mudpuppies, Necturus, are fully- aquatic salamanders which are not closely related to the axolotl, but look like it. Axolotls are capable of regenerating entire limbs, parts of the spinal cord, the heart, and sections of the brain without scarring. This regeneration is driven by a unique immune response that promotes healing and cellular dedifferentiation, allowing it to regrow complex tissues effectively. In the wild axolotls are now near extinction.BBC - Earth News - Axolotl verges on wild extinction This may be due to population growth in Mexico City, and the polluted waters of the lake. Non-native fish, such as African tilapia and Asian carp, have also recently been introduced to the waters. These new fish have been eating the axolotls' young, as well as its primary source of food. The axolotl is currently on the IUCN Red List of threatened species (critically endangered as shown in the infobox).\"Mexico City's 'water monster' nears extinction. David Koop, Yahoo News, November 2, 2008. == Genetics and development == Compared with land-dwelling salamanders, the sexually mature adult Axolotl is a chimera (mixture) of larval and adult tissues. A mutation in hormone production slows the development of the non-sexual tissues compared to the gonads.McCusker, C., Bryant, S. V., & Gardiner, D. M. (2015). The axolotl limb blastema: cellular and molecular mechanisms driving blastema formation and limb regeneration in tetrapods. Regeneration, 2(2), 54–71. https://doi.org/10.1002/reg2.32 So, it ends up as an adult which looks like a larva, except that it is sexually mature. This is an example of neoteny, a type of heterochrony. Axolotls in the lab have reduced pigmentation and end up being a lighter pink color, while axolotls that live in nature are a darker, brown to black color. == References == Category:Salamanders Category:Developmental biology Category:Animals of North America",
 "title": "Axolotl"
}