{
 "id": "233697",
 "text": "Poison gas is any gas that is a poison. There are many different poison gases and each has own properties. Many toxic liquids are also evaporate easily at normal temperatures and their vapors are poison gas. \"Poison gas\" can refer to poisons in chemical weapons, but most of them are in fact liquids, for example mustard gas and VX are sticky liquids that are spread out into fine mists. In small amounts, corrosive poison gases (gas that can damage people or objects) usually cause irritation, and may have a smell, but this is not always the case. There are several gases that can kill sneakily, without a warning smell or irritation. All gases other than oxygen can take over air, and cause death by asphyxiation. This does not make them poison gases. Nitrogen and carbon dioxide are two common examples. This has to be taken into account in handling of any compressed or liquified gas. Gases can be also dangerous because they are flammable (easily bursting into flame). Poison gases can cause injury more easily than solid or liquid poisons because they diffuse (move) in the air, exposing skin, and are easily breathed in. Immediate contact with corrosive gas leads to chemical burns of the skin and lungs. When taken into the inside of the human body and into the blood, either by breathing in or through skin, several poison gases cause a poisoning. In a poisoning, medical help is often needed; simply removing the victim from the gas is not enough to prevent symptoms. * Corrosive poison gases such as hydrogen chloride cause chemical burns into skin and inside the lungs. This causes lungs to fill up with liquid, which can kill. * Alkylating poison gases such as methyl chloride are attacked by human DNA and proteins. In human cells, this causes cell death, cancer and symptoms caused by malfunctioning of the alkylated proteins. Mustard gas is an alkylating agent. * Gases that release fluoride ions into the human body can cause a loss of calcium in the blood, which leads to heart attack and death. Examples are hydrogen fluoride and chlorine trifluoride. * Ammonia can cause corrosive burns. * Hydrogen sulfide has a powerful smell, but it will easily desensitize the nose. After that it can shut down the breathing center in the brain, which stops the breathing reflex and kills the victim from asphyxiation. * Nerve agents are poisonous liquids, that easily evaporate. They shut down biochemical processes that allow muscles to relax. The result is that all muscles contract, including muscles required for breathing, causing death by asphyxiation. Poison gases are used in industry as chemical reagents. The chemical reactions they can be used for are more important than their toxicity. Today, chemists try to avoid the use of poisonous gases, but it is often not possible. Examples of large-volume industrial poisonous gases are hydrogen sulfide, cracked from oil, chlorine, in diverse chemical uses and to disinfect drinking water, and ammonia, which is a valuable fertilizer itself and can be converted into a range of other fertilizers, in addition to chemical uses. Some fumigants (chemicals used to kill pests) are also poison gases, for example phosphine, which is used to kill pests living in grains. The advantage of a gas is that it evaporates after use, so that if food is treated with gas, there is no need to rinse it to remove the poison. Some gases can kill and some can’t. Gases have advantages and disadvantages. Category:Weapons Category:Chemical warfare Category:Gases Category:Poisons",
 "title": "Poison gas"
}