{
 "id": "233769",
 "text": "G minor is a minor scale based on G. Its relative major is B-flat major. G minor is one of two flat key signatures that needs a sharp for the seventh note (the other is D minor). During the Baroque period, music in G minor was usually written with a one-flat key signature. ==Mozart's use of G Minor== Wolfgang Amadeus Mozart thought that G minor was the most suitable key for showing sadness and tragedy,Hellmut Federhofer, foreword to the Bärenreiter Urtext of Mozart's Piano Quartet in G minor. \"G-Moll war für Mozart zeitlebens die Schicksaltonart, die ihm für den Ausdruck des Schmerzes und der Tragik am geeignetsten erschien.\" (\"G minor was, for Mozart, the most suitable fate-key throughout his life for the expression of pain and tragedy.\")( and many of his minor key works are in G minor, such as the Piano Quartet No. 1 and the String Quintet in G minor. G minor is the only minor key he used as a main key for his numbered symphonies (No. 25, and the famous No. 40). In the Classical period, symphonies in G minor almost always used four horns, two in G and two in B-flat alto.H. C. Robbins Landon, Mozart and Vienna. New York: Schirmer Books (1991): 48. \"Writing for four horns was a regular part of the Sturm und Drang G minor equipment.\" Robbins Landon also notes that Mozart's No. 40 was first intended to have four horns. G minor symphonies like Mozart's No. 25 often used E flat major for the slow movement, including Haydn's No. 39 and Vanhal's G minor symphony from before 1771 (Bryan Gm1).James Hepokoski og Warren Darcy, Elements of Sonata Theory (Oxford University Press: 2006) p. 328 ==Famous classical music in G minor== * Fantasia and Fugue in G minor \"The Great\", BWV 542- Bach * Symphony No. 83 \"The Hen\" - Haydn * Symphony No. 40 - Mozart * Ballade No. 1 in G minor - Chopin * Polonaise in G minor - Chopin * Piano Concerto No. 2 - Saint-Saëns * Slavonic Dance No. 8 in G minor - Dvořák * Sicilliene, Op. 78 - Fauré * Prelude in G Minor - Rachmaninoff * Sonata for Cello and Piano in G minor - Rachmaninoff * Most of Verdi's Requiem (the Dies Irae), is in G minor. * Concerto No. 2 in G minor, Op. 8, RV 315, \"Summer\" from The Four Seasons - Antonio Vivaldi * Adagio in G minor - \"Albinoni's Adagio\", now said to be written by Remo Giazotto * Violin Concerto No. 1 in G minor, Op. 26 - Max Bruch * Christmas Concerto - Arcangelo Corelli * Ya Lil (Al Anisa Farah) - Ramage See also: List of symphonies in G minor. == Variations == There are many variations of G minor. Variation Description G minor 7th a g minor chord containing G, Bb/A#, D, and F G minor major 7th a G minor chord with a Major 7th. G minor major a combination of G minor and G major. G minor 6th a G minor chord with a Major 6th. G minor 9th G minor 7th containing A. G minor 2nd a G minor with Ab or G#. G augmented minor the augmented version of G minor. G diminished has C#/Db instead of D. G minor 7th-5 G diminished with minor 7th. G diminished 7th a G diminished with a major 6th. == References == Category:Musical keys Category:Minor scales",
 "title": "G minor"
}