{
 "id": "233776",
 "text": "A major or A-flat major is a major scale that starts on A-flat. It has the pitches of A♭, B♭, C, D♭, E♭, F, G, and A♭. Its relative minor is F minor and its parallel minor is A-flat minor. A-flat major is a key that sounds peaceful. It was used often by Franz Schubert. Twenty-four of Frédéric Chopin's piano pieces are in A-flat major, more than any other key. Charles- Marie Widor considered A-flat major to be the second best key for flute music.Charles-Marie Widor, Manual of Practical Instrumentation translated by Edward Suddard, Revised Edition. London: Joseph Williams, Ltd. (1946) Reprinted Mineola, New York: Dover (2005): 11. \"No key suits it [the flute] better than D [major]. ... A [major] is likewise an excellent key.\" Beethoven chose A-flat major as the key of the slow movement for most of his C minor works. This was also followed by Antonín Dvořák in his only C minor symphony and Anton Bruckner in his first two C minor symphonies. Since A-flat major was not often chosen as the main key for orchestral music of the 18th century, passages or movements in the key often kept the timpani tuned the same way as they were in the movement before it. For example, Beethoven's Symphony No. 5 in C minor has the timpani set to C and G for the first movement. With hand- tuned timpani, there is no time to retune the timpani to A flat and E flat for the slow second movement in A flat. In Bruckner's Symphony No. 1 in C minor, however, the timpani are retuned between the first movement in C minor and the following in A-flat major. Edward Elgar's Symphony No. 1 in A-flat major is one of the best-known symphonies in that key. Arnold Bax's last symphony is also in the same key. A-flat major is the major key with the most flats that Domenico Scarlatti used in his keyboard sonatas, though he used it only twice– in K. 127 and K. 130. Felix Mendelssohn and John Field each wrote one piano concerto in A-flat. ==Scales and keys== ==References== Category:Musical keys Category:Major scales",
 "title": "A-flat major"
}