{
 "id": "234087",
 "text": "Neoteny is a type of heterochrony. It is a change in the timing of development in an animal. It is where bodily development is slowed, but sexual development goes on at the same rate.Abercrombie et al. 1992. (8th edition) Dictionary of Biology. Penguin, London, p390. At the extreme, this results in a sexually mature juvenile or larval form. A classic example of that is the Axolotl salamander. It has often been suggested that the human species is an example of neoteny. There are features of adult humans that are more like those of juvenile apes than adult apes.The Cambridge Encyclopedia of Human Evolution, p90. eds Jones S; Martin R; & Pilbeam D. 1992. Cambridge University Press. ISBN 0-521-46786-1 These are some of the neotenous traits in humans: #Flattened face,Montagu A. 1989. Growing young. Bergin & Garvey: CT. broadened face,Gould S.J. 1977. Ontogeny and phylogeny. Cambridge: Belknap Press. large brain, #Hairless body, hairless face,Jean-Baptiste de Panafieu P. 2007. Evolution. Seven Stories Press. small nose, #Reduction of brow ridge, small teeth, small upper jaw (maxilla), small lower jaw (mandible), #Thinness of skull bones, limbs proportionately short compared to torso length, longer leg than arm length,Maynard Smith J. 1958. The theory of evolution. Cambridge University Press. #Larger eyes, #Upright stance.Henke W. 2007. Handbook of paleoanthropology, Volume 1. Springer, N.Y. In some texts these differences may be called paedomorphosis, meaning \"like a child\". The term \"K-selection\" is sometimes used to describe this evolutionary process. The process is all part of a situation where the species benefits from the longer-lasting of juvenile features into adult life. If we continue the list into physiology and behaviour, we find: #Longer period of brain growth #Longer period of learning #Culture passed on through generations #Mating deferred to older ages than apes #Longer life #Origin of articulate speech #Larger social groups This second list shows how the first list becomes the basis for the larger groups of modern man and their better transmission of experiences to later generations. == References == Category:Developmental biology Category:Evolutionary biology Category:Human body features",
 "title": "Neoteny"
}