{
 "id": "234186",
 "text": "Ven Conmigo (English: Come With Me), was the third album released by rising Latina superstar Selena, on November 12, 1990, for the CAPITOL/EMI Latin label. This album, was the first to market Selena as a solo artist, no longer identifying her albums with \"Selena Y Los Dinos,\" though they were still very much a part of the mix. The album itself, sold 50,000 units in America, and was certified Gold by the RIAA. Another 242,802 copies were sold on Amazon.com, verifed from their sellers rank. == Production == The group re- recorded \"La Tracalera\", a cover version of a song by the original Dinos, as well as \"Aunque No Salga El Sol,\" which they had originally recorded, in 1984. The song \"Baila Esta Cumbia,\" was an instant hit in the U.S., and later crossed over to Mexico. Ven Conmigo, was the group's first Gold album. == 20 Years Of Music == A remastered version was released in 2002, with bonus tracks and spoken liner notes by the family and friends, who witnessed the entire production. == Tracklisting == # Title Length Writer(s) Featured Guest(s) 1 Ya Ves 3:13 A.B. Quintanilla, III & Pete Astudillo 2 Aunque No Salga El Sol 3:24 Johnny Herrera 3 Ven Conmigo 2:26 AB Quintanilla, III & Pete Astudillo David Lee Garza (Accordion), Tony Garza (Bajo Sexto), Adam Garza (Drums), and Gilbert Velasquez (Guitar) 4 Yo Te Amo 3:39 AB Quintanilla, III & Pete Astudillo 5 Enamorada de Ti 4:05 AB Quintanilla, III & Pete Astudillo 6 La Tracalera 2:50 Johnny Herrera 7 Baila Esta Cumbia 2:57 Quintanilla & Pete Astudillo 8 Yo Me Voy 3:28 Juan Gabriel 9 No Quiero Saber 2:54 Quintanilla & Pete Astudillo 10 Despues De Enero 2:57 Johnny Herrera === 2002 Bonus Tracks === # Title Length Writer(s) Featured Guest(s) 1 No Quiero Saber (2000 Mix) 2:54 A.B. Quintanilla III/Pete A. 2 Enamorada De Ti\" (Club Remix) 6:06 3 Spoken Liner Notes by the Band and Family: Intro 1:39 4 Spoken Liner Notes by the Band and Family: Ya Ves 0:13 5 Spoken Liner Notes by the Band and Family: Anque No Salga el Sol 0:53 6 Spoken Liner Notes by the Band and Family: Ven Conmigo 0:36 7 Spoken Liner Notes by the Band and Family: Yo Te Amo 0:52 8 Spoken Liner Notes by the Band and Family: Enamorada de Ti 3:17 9 Spoken Liner Notes by the Band and Family: La Tracalera 0:47 10 Spoken Liner Notes by the Band and Family: Baila Esta Cumbia 3:30 11 Spoken Liner Notes by the Band and Family: Yo Me Voy 0:15 12 Spoken Liner Notes by the Band and Family: No Quiero Saber 1:10 13 Spoken Liner Notes by the Band and Family: Outro 0:20 14 No Quiero Saber (Multimedia Track) 2:57 == Album Credits == The album Ven Conmigo was recorded and mixed at ZAZ Studios in San Antiono, Texas. The engineer was Gilbert Velasquez who also mixed the album. The album's main photo was taken by Robert Lopez. The album was produced, arranged, and performaned by A.B. Quintanilla III. The co-arranged was Ricky Vela and Jose C. Ojeda. The midi and computer sequencing was made by Ricky Vela. === Additional Credits === A.B. Quintanilla, III, wrote and produced almost every song on Ven Conmigo. David Lee Garza, the accordion player for the title track, \"Ven Conmigo, participated in the writing and production, as well. * Selena Quintanilla- Perez (Lead Vocals) * Suzette Quintanilla (Drummer) * A.B. Quintanilla III (Bass & Vocals) * Ricky Vela (Keyboard) * Jose C. Ojeda (Keyboard) * Peter \"Pete\" Astudillo (Back-up vocals) * Mike Orosoco (Guitar) == Singles == * \"Aunque No Salga El Sol\" * \"Baila Esta Cumbia\" * \"No Quiero Saber\" * \"Enamorada De Ti\" * \"Ya Ves/La Tracalera\" == Certifications == Country Certification USA 2x Platinum (Latin) Category:1990 albums Category:2002 albums Category:Selena albums",
 "title": "Ven Conmigo"
}