{
 "id": "23417",
 "text": "Senkaku Islands, also called ,National Geospatial-Intelligence Agency, Senkaku-rettō, Japan. Retrieved 2011-10-10. Diaoyu Dao Islands ()Netherlands Institute for the Law of the Sea (NILOS). (2000). International Organizations and the Law of the Sea, p. 107. Retrieved 2011-10-10. and Tiaoyutai Islands (),Government Information Office, Republic of China (ROC): \"Ma Ying-jeou: Beijing’s Senkaku Claim isn’t Taipei’s Claim,\" China news Agency (ROC). July 22, 2011. Retrieved 2011-10-10. are uninhabited islands in the East China Sea. The group of islands, islets and rocks is east of mainland China, northeast of Taiwan, west of Okinawa, and north of the southwestern end of the Ryukyu Islands. The islands are about 200km from Taiwan, and about 300 km from Okinawa.Shaw, Han-yi. (1999). The Diaoyutai/Senkaku Islands Dispute: Its History and an Analysis of the Ownership Claims of the PRC, ROC, and Japan, p. 10 (PDF 12 of 150). ==Dispute== Control over these islands and rocks is disputed.GlobalSecurity.org, \"Senkaku/Diaoyutai Islands\". Retrieved 2011-10-10. The issues are complex.Hunt, Pete. \"China and Japan's Wikipedia War,\" Foreign Policy (US). February 5, 2013. Retrieved 2013-4-2. The Japanese government describes the islands as part of Japan.NILOS, p. 108. Retrieved 2011-10-10. The islands are also described as part of China.Permanent Mission of the People's Republic of China to the UN, Foreign Ministry Spokesperson's Remarks ; compare Youth Research Group (Russia), \"Senkaku (Diaoyudao) Islands\" ; retrieved 2011-10-10. There are conflicts in the positions of the People's Republic of China (PRC) and the Republic of China (ROC).Suganuma, Unryu (2001). Sovereign Rights and Territorial Space in Sino-Japanese Relations: Irredentism and the Diaoyu/Senkaku Islands, pp. 89-92.Lee, Seokwoo et al. (2002). Territorial disputes among Japan, Taiwan and China concerning the Senkaku Islands, pp. 11-12. Retrieved 2011-10-10. The PRC and ROC have a shared history.Shaw, p. 41 (PDF 43 of 150); retrieved 2011-10-10. The United States occupied these islands from 1945 to 1972 when they reverted to Japan. The official US position is neutral in a dispute among Japan, China and Taiwan.Finney, John W. \"Senate Endorses Okinawa Treaty; Votes 84 to 6 for Island's Return to Japan,\" The New York Times. November 11, 1971; Congressional Research Service Report 96-798, September 30, 1996. Retrieved 2011-11-11. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Political problems of China ==References == ==Other websites== * Japan, \"The Basic view on the Sovereignty over the Senkaku Islands\", Japan Ministry of Foreign Affairs * China, \"China's Diaoyu Islands Sovereignty is Undeniable\", People's Daily * Taiwan, \"ROC (Taiwan) Government Reaffirms Sovereignty over Diaoyutai Islands\", Republic of China Ministry of Foreign Affairs Category:Islands of Japan Category:Islands of China Category:Islands of Taiwan Category:Territorial disputes Category:Ryukyu Islands Category:Uninhabited islands",
 "title": "Senkaku Islands"
}