{
 "id": "234742",
 "text": "The Royal Canadian Mounted Police (RCMP), ( (GRC)), is the national police force of Canada. The force is also called the Mounties. ==Unique organization== RCMP is unique in the world because it is a national, federal, provincial and municipal policing organization: * RCMP is the federal police for all of Canada Greater Area. * RCMP serves as the police for the three Canadian territories * RCMP serves in all ten Canadian provinces, although its role is limited in Ontario and Quebec as both provinces have their own provincial police services. * RCMP provides police services for more than 190 municipalities * RCMP is the police for 184 Indigenous communities -- the First Nations,First Nations InuitInuit and Métis. * RCMP ensures security at three international airports. The RCMP/GRC wording is protected under the Canadian Trade-marks Achttps://simple.wiktionary.org/wiki/nativet. == History == The Northwest Mounted Police (NWMP), was founded 1873. The Mounties were created to establish authority and to dominate the native population in the west before settlers began to arrive.Wolkomir, Richard. \"Mounties forever, but these days rarely on horseback,\" Smithsonian. February 1989, pp. 81-82. The smaller Dominion Police was founded in 1868 to protect federal government buildings. The Mounties were given the right to use the term Royal by King Edward VII in 1904. Their name was changed to the Royal Northwest Mounted Police (RNWMP). The modern RCMP was created when the RNWMP merged with the smaller Dominion Police in 1920. The word mounted suggests that the police ride horses. Before 1920, horses were their main method of travel. However, today the RCMP do not ride horses except at special events. == Uniform == The RCMP are famous for their uniform. The \"Review Order\" (also \"Red Serge\") uniform is worn mostly at special events, such as parades. The uniform consists of a red tunic with a large brown belt,(formally known as a “Sam Browne”), a light brown hat, dark blue breeches (trousers) with a yellow stripe and riding boots. On an ordinary day at work, RCMP officers instead wear a grey shirt, dark blue trousers, ankle boots and a peaked cap (the type worn by most police officers elsewhere). In the winter they may wear a thicker coat, heavier boots and a fur cap. == RCMP Ranks == The ranks of the RCMP are, from highest to lowest: • Administrator General * Commissioner * Deputy Commissioner * Assistant Commissioner * Chief Superintendent * Superintendent * Inspector * Corps Sergeant Major (Trainer) * Sergeant Major * Staff Sergeant Major * Staff Sergeant * Sergeant * Specialist* * Corporal * Constable * Cadet (Trainee) Ranks marked with an asterisk (*) are only found in a few parts of the RCMP and are usually not part of the chain of command. For most staff sergeants, their superior is an inspector and not a staff sergeant major. While \"Cadet\" is a term used for RCMP trainees at depot it is not an official rank. ==References== == Sources == * Wolkomir, Richard. \"Mounties forever, but these days rarely on horseback,\" Smithsonian. February 1989, pp. 78-89. == Other websites == * List of Civilian organizations with prefix \"Royal\" – Heritage Canada. * History and Uniform of the North-West Mounted Police, 1873 to 1904 * The official website of the Royal Canadian Mounted Police * Royal Canadian Mounted Police Gazette * The Commission for Public Complaints Against the RCMP *RCMP Watch * RCMP Wanted list * RCMP Heritage Centre * * RCMP North- West Mounted Police in Literature and History * RCMP Honour Roll Category:1920 establishments in Canada Category:Government agencies of Canada Category:Law enforcement agencies Category:Law of Canada",
 "title": "Royal Canadian Mounted Police"
}