{
 "id": "234940",
 "text": "François-André Danican Philidor (7 September 1726 – 31 August 1795), often referred to as André Danican Philidor during his lifetime, or to personal friends as André, was probably the best chessplayer of his time, and a notable composer of light operatic music. He was born into a family of musicians who served at the French court. He became the author of a book on chess which influenced players for many years.Hooper, David and Whyld, Kenneth 1992. The Oxford Companion to Chess. 2nd ed, Oxford University Press, p303Hartston, William 1985. The kings of chess: a history of chess traced through the lives of its greatest players. Pavilion, London.p15 == Early years == His family name had once been Duncan, until they came from Scotland to Brittany. Danican was then their family name. Then, after their appointment to the court of King Louis XIII in the 17th century, they adopted the name Philidor as a tribute to an Italian court musician called Filidori. Young Philidor was trained in music from an early age, and learnt chess from musicians in intervals between musical numbers. He turned out to be equally good at both activities, though initially the music came first. Philidor took chess lessons from the leading French master of the time, du Kermeur, Sire de Légall (known as Légall).sometimes spelled Kermur de Légal. After three years, he was on equal terms. In 1746 he found himself in Rotterdam without money, after a tour had ended in the death of a young girl harpsichord player. He started to play chess for money, and came to London in 1747 to play a match against the strongest English player, whom he beat. Thus started his new life. He played chess in London, and wrote light operatic scores for the Comédie-Française in Paris. == His life in chess == Philidor started playing regularly about 1740 at the Parisian Café de la Régence. It was there that he played with a friend from 'New England', Mr. Benjamin Franklin. At 21 Philidor met the Syrian Philip Stamma of Aleppo, who was a translator and chess player of note. Philidor won by 8½–1⅓. At 29 he defeated his tutor Légall in a match. Unfortunately, none of these games survive, though we do have a number of games from his later career.Cozens W.H. 1981. Early times, in Winter E. (ed) World chess champions. Pergamon, Oxford. p2 In 1744, as a teenager, he could play two games of chess simultaneously blindfold, and in Berlin he played three games without sight of the board. He gave these exhibitions many times. This was thought to be a marvel, though it had been done before, by an Italian priest, Saccheri.p45 === The book === In 1749 he published a book on chess which was to make his name. The first edition, in French, included a subscription list of prosperous sponsors, such as the Earl of Sandwich and the Duke of Cumberland.Philidor, André Danican 1749. L'Analyse des Echecs. London. An edition in English, Chess analysed, came out in 1750. He revised and extended the book twice, in 1777 and 1790. Over the years, the book was a steady success. By 1871, it had gone through about 70 editions,Copyright was not so protected in those days. and had been translated into English, German, Russian and Italian. Eventually it went through over a hundred editions in ten languages.p17 === His chess ideas === As one commentator said: :\"Philidor's Analyse revolutionised chess thought. For the first time the principles of chess were laid down in an intelligible manner... In particular, he laid down the rules for the correct handling of pawns... [There are] games... to illustrate his principles... He gives some remarkable [endgame] analysis\". Hartston p17 Philidor's motto \"Les pions sont de l'âme du jeu\" (Pawns are the soul of chess) is a saying which is still taught to young players today. It sums up the idea that the pawn 'skeleton' gives the game its long-term structure, and influences how a game proceeds. Philidor’s book was the first that gave (1) detailed annotations on how to play the middlegame, (2) that presented chess strategy as a whole, and (3) that presented the concepts of the Blockade, Prophylaxis, positional sacrifice, and mobility of the pawn formation (though without fully identifying those ideas). Philidor also studied chess endgames, and the book gives generally accurate information about them. An important chess endgame position that he wrote about is called the Philidor position.In the endgames king, rook and pawn versus king and rook. Also his K+R+B vs K+R analysis was sound. He gave his name to one of the basic chess openings, Philidor's defence.1.e4 e5 2.Nf3 d6 Philidor was now received into fashionable society in France and England. He took his mistress with him to Prussia, then back to England. Later, in 1760, he married a singer, and had seven children.p304 Philidor played chess at the Café de la Régence in Paris, and at the Salopian Coffee-house and at Parsloe's chess club in London. == His music == Philidor's contemporaries had some difficulty believing he could be so good at two such different arts, but he was. His work on comic opera (opéra bouffe) excelled. He wrote 25 such works, four with collaborators (including Rousseau). \"His Tom Jones (1765) was regarded as the finest work in the theatre... His Ernelinda, Princess of Norway (1766) so pleased Louis XV that he gave Philidor a pension of 25 louis d'or (French gold coin) from his own purse\".p304 The English, however, ignored his music, and after 1792 he never returned home. The French Revolution made his connection with royalty a danger. Philidor died in 1795, and the Comédie-Française held a benefit concert for his widow. == References == Category:1726 births Category:1795 deaths Category:French chess players Category:18th-century French composers Category:Writers from Centre-Val de Loire Category:People from Eure-et-Loir",
 "title": "François-André Danican Philidor"
}