{
 "id": "235045",
 "text": "The 1964 United States presidential election happened on November 3, 1964. It was between Democrat Lyndon Johnson, President of the United States, and his running mate Hubert Humphrey of Minnesota, against Republican Barry Goldwater, a Senator from Arizona, and his running mate, Congressman William Miller of New York. In 1963, President John F. Kennedy was assassinated and Johnson (his vice president) became president of the United States. Lyndon Johnson campaigned to continue many of Kennedy's policies and ideas such as civil rights. He supported a series of programs called the \"Great Society\" to improve the quality of living for poor people which included programs like Medicare, Medicaid, and environmental programs. Barry Goldwater had the opposite belief that the government should be smaller and he was against government programs. During his campaign, actor Ronald Reagan made a famous speech called \"A Time For Choosing\" in support of Goldwater. Goldwater, during the campaign, was portrayed as an extremist who condoned the actions of the KKK and would cause nuclear war. His beliefs were radical at the time, but they would later influence many libertarian and conservative politicians. Lyndon Johnson won the election by a landslide, and this was the last presidential election where Democrats carried any of 8 particular states. ==Candidates== ===Democratic Party=== *Democratic candidates: **Lyndon B. Johnson, President of the United States from Texas **George Wallace, governor of Alabama (campaign) **Pat Brown, governor of California ====Candidates gallery==== Image:37 Lyndon Johnson 3x4.jpg|President Lyndon B. Johnson Image:George C Wallace (cropped).jpg|Governor George Wallace of Alabama | Governor of California Pat Brown of California ===Republican Party=== *Republican candidates: **John W. Byrnes, U.S. representative from Wisconsin **Hiram Fong, U.S. senator from Hawaii **Barry Goldwater, U.S. senator from Arizona **Henry Cabot Lodge, Jr., former U.S. senator and 1960 vice-presidential nominee from Massachusetts **Richard Nixon, former vice president and 1960 presidential nominee **Nelson A. Rockefeller, Governor and candidate for the 1960 nomination from New York **Margaret Chase Smith, U.S. senator from Maine **William Scranton, governor of Pennsylvania **Harold E. Stassen, former Minnesota Governor and candidate for the 1944, 1948 and 1952 nominations, running from Pennsylvania ====Candidates gallery==== File:BarryGoldwater.png|Senator Barry Goldwater of Arizona File:NelsonRockefeller.png|Governor Nelson Rockefeller of New York File:HenryCabotLodgeJr.jpg|Ambassador to South Vietnam and former Senator Henry Cabot Lodge, Jr. of Massachusetts File:MargaretChaseSmith.jpg|Senator Margaret Chase Smith of Maine File:Hiram Fong.jpg|Senator Hiram Fong of Hawaii File:Harold Stassen.jpg|former Governor Harold Stassen of Minnesota File:JohnWByrnes.jpg|Congressman John W. Byrnes of Wisconsin's 8th congressional district File:Wm Scranton Pennsylvania 87th Cong.png|Governor William Scranton of Pennsylvania ==Other websites== * 1964 Presidential General Election Results presidential election Category:United States presidential elections",
 "title": "1964 United States presidential election"
}