{
 "id": "235215",
 "text": "Bhagat Singh (भगत सिंह) ( — 23 March 1931) was an Indian socialist revolutionary. He is considered to be one of the most influential revolutionary person of the Indian Independence Movement. == Early life == Singh was born to Vidyavati Kaur and Sardar Kishan Singh, in a Sikh Jat family on 28 September 1907 at Lyallpur in Punjab Province of British India. His family had earlier been involved in revolutionary activities against the British government. His uncle, Swaran Singh, had participated in the freedom struggle against the British. When in 1907, an another uncle of Bhagat, Ajit Singh was arrested and exiled to Rangoon in Burma, Swaran asked the people of Punjab to force the government to release him and due to his efforts Ajit Singh was released from Rangoon Jail in October 1907. After coming back from jail, Ajit Singh decided to start a major revolt against the British. He began agitating the farmers and peasants to start a movement against them. The movement called 'Pagdi Sambhal Jatta' was launched in 1908. The British came to know of his intentions and arrested him on 13 January 1911, when he was attending the Lohri festival celebration at his relative's house. In February, Ajit Singh escaped from jail and ran away home, only to tell them about his planning to start a mass struggle abroad. Ajit Singh fled to Persia in March. In 1912, Bhagat joined the District Primary School in Lyallpur and received his elementary education there till class 6th. In 1917, his family shifted to Lahore for his higher education. In Lahore, he was admitted to the Dayanand Anglo-Vedic School. When he was in the 8th standard, the Jallianwala Bagh massacre (13 April 1919) took place. The very next day (on 14 April) he went to the Bagh telling his parents at home that he was going to school. He boarded a train heading for Amritsar and reached there an hour later. As Bhagat entered the compound he saw blood scattered all over the ground. The turbans and torn clothes of panic-stricken people were on the ground. The walls of the compound were red with blood. There was a curfew in Punjab so the blood hadn't been cleaned. Bhagat had taken a glass bottle with him. He took a handful of blood-stained soil and put it in the bottle. He reached home and put the bottle in front of the Sikh Guru's portrait and prayed to him for peace and solace for the victims of the massacre and he pledged to teach the British a lesson. In 1920, Mahatma Gandhi launched the Non-cooperation movement to encourage a mass protest against the British and to boycott their trade in India and to end their cooperation with the British rule. Many people joined the movement and stopped the use of foreign goods and clothes. The people boycotted schools and colleges. Lawyers such as Pandit Motilal Nehru (Jawaharlal's father) boycotted law courts and other government institutions. They publicly burnt their lawyers' dress in protest. Bhagat Singh also actively participated in the movement. He along with a group of people used to burn foreign clothes publicly and boycott government-funded schools. He was only 14 years old. In February 1922, In Chauri Chaura village of Gorakhpur in United Provinces, non-violent activists of the town lead a march to a nearby liquor shop to picket it. Some policemen began thrashing the activists. The protesters became angry and they burnt down the police station where the policemen had taken refuge, killing all 22 policemen inside. Mahatma Gandhi was shocked to hear about the incident and he suspended the non-cooperation movement realising that the people had still not understood the message of non-violent protest against the British. This created much chaos as people thought that if Gandhi had not suspended the movement they would have easily achieved independence. When Bhagat came to know about this, he was disappointed with Gandhi's decision to suspend the movement and he lost confidence in the philosophy of non-violence. In 1923, He joined the National College in Lahore. There he studied as well took part in many extracurricular activities. In August 1923, an essay competition was held at the college by Punjab Hindi Sahitya Sammelan. The topic was to write about any of the special acknowledgements about Punjab. Bhagat Singh wrote an essay on the following topic: A month later he joined a Dramatic Society near the college campus and began to organize functions and shows. In late October, the society organized a show for the governor of Punjab. When the governor Edward Douglas Maclagan arrived at the theatre, the audience present there consisting mainly of college students didn't show courtesy to him. He became so angry with the lack of respect that he walked out of the theatre. Bhagat Singh didn't mind and performed the show in front of the limited audience. While studying in the National College, he used to spend most of his time in the college library reading books about armed revolution in foreign countries. He was inspired by the Russian revolutionaries who believed that only armed revolt can bring freedom. In March 1924 it is said that one of his friend's bullock cart drivers was beaten harshly by some English officials as the sign the outside the office of the officials read - 'Dogs and Indians are not allowed'. He took revenge and along with Sukhdev he attacked the officials car and beat them with lathis (wooden sticks) and escaped unnoticed in the night. In April, his father asked him to get married which he refused. His father pressurised him for it, so one night, he quietly left his home and went to Kanpur. Before leaving he wrote a letter to his father: Bhagat Singh worked for Ganesh Shankar Vidyarthi in the newspaper Pratap Press in Kanpur for some months. Then he met Chandra Shekhar Azad and they began to work together for freedom struggle. In early 1925, his father called him home as his grandmother was very ill. He wrote to him for coming home, promising he would not force him to get married: In March 1925, he accepted his father's wish returned to Lahore but had to soon escape from there as police had came to know of his whereabouts. He went to Delhi and started publishing the daily newspaper Veer Arjun Newspaper for 6 months. In October, he returned to Kanpur to free the Kakori prisoners who had been arrested after the train robbery in Kakori (9 August) along with another revolutionary Ram Dulare Trivedi. The prisoners were temporarily detained at Kanpur police station before being shifted to different central jails across United Provinces. On 22 November, along with Azad, Bhagat went to the police station unnoticed and broke the lockups and freed one of their comrades but the police soon arrived and they had to run away. Their plan had failed. In March 1926, he organized the Naujawan Bharat Sabha to encourage the young men of his country to fight for their freedom. He began to address big public meetings and asked them to overthrow the British rule in India. He also used the dramatic society for the purpose of spreading his message. On 16 October, when the Dussehra festival fair was held in Lahore Maidan at 7 pm, a bomb exploded in a crowded section of the maidan when the Ramleela play was held. 12 people died in this explosion and about five times of that were injured. People rushed out of the maidan to save their lives. Next day, The Tribune was published as follows- The British Government took advantage of the incident and arrested Bhagat on the pretext that he was involved in the bomb incident on 29 May 1927. The real reason for his arrest was to stop him from instigating people against the British rule. It was later found that the bomb explosion was caused by a man named Channadin who was bribed by the Lahore police to get an excuse for arresting the revolutionaries. He was released for a security deposit of ₹ 60,000 with no evidence against him, about a month later. == Activities == He became involved in numerous revolutionary activities. He quickly gained prominence in the Hindustan Republican Association and became one of its leaders. The name of the organization was changed to Hindustan Socialist Republican Association on 9 September 1928. A Commission known as the Simon Commission was appointed by the British Government to consider political reforms. The commission which reached India on 3 February 1928 decided to tour the whole India to gain first hand information of the administrative system. There were no Indians in the commission. This angered many Indian political leaders who lead protests against the commission. The nationalist leaders lead protest marches wherever the commission went with the slogan 'Simon Go Back'. The Commission reached Lahore on 30 October 1928. Here, the protest march was being lead by Lala Lajpat Rai. As the members of commission got down from the train at Lahore Railway Station the protesters began yelling 'Simon Go Back'. Soon the protest turned violent and the police used a lathi charge to stop the protest. The superintendent of police of Lahore James A. Scott began to beat Lalaji with a baton. Lalaji was wounded by the batoning but he continued to yell 'Simon Go Back...Simon Go Back...Simon Go Back...' Lalaji was wounded and he fell to the ground. Later that evening, at a meeting held at Mochi Gate ground, he announced: 18 days later, Lalaji succumbed to his wounds. Bhagat Singh who was also in the protest march was witness to this incident and decided to take revenge. Bhagat made a plan by calling a meeting at Mozang House (a Hindustan Socialist Republican Association hideout). On the night of 10 December the plan to kill superintendent Scott was made. Jaigopal was asked to keep a watch on Scott for five days and make a plan. On 15 December, the meeting was held in which Sukhdev presented a map of the Police Headquarters of Lahore where Scott worked. Bhagat and Rajguru were chosen to execute the plan. Jaigopal was told to signal Bhagat and Rajguru when he saw Scott coming out of the office. The plan was now ready to be executed. On 17 December, Bhagat along with Rajguru & Chandrashekhar Azad went to the area of Police Headquarters. Bhagat and Rajguru hid behind a tree nearby. Jaigopal also came riding on his bicycle and acted as if he was repairing it to wait for Scott. At 1620 hours, as another police officer Assistant Superintendent of Police Saunders came out of the office Jaigopal mistook him for Scott and signaled Bhagat and Rajguru. As soon as Saunders approached the tree, Rajguru came out and shot him in the head which wounded him and Bhagat shot thrice in his chest and killed him. The Head Constable Chanan Singh chased Bhagat Singh, Rajguru and Azad but was wounded by Azad's covering fire. The traffic inspector Fern who was standing there controlling the traffic saw them running and started chasing them. Bhagat fired at Fern but he ducked down to prevent the shot and thus the shot missed. The four then escaped through the Dayanand Anglo-Vedic School backdoor to arranged safehouses. Next day, Posters appeared all over the walls of Lahore informing the public about the revenge action against the British- The rest of the poster contained the motives behind the murder of the officer and warning given to the Intelligence Department and bureaucracy. It was signed by Balraj (a pseudonym of Chandrashekhar Azad). When the news of Saunder's murder reached the British government, it launched a search operation in the whole of Lahore. The Criminal Investigation Department was asked to keep a watch on every person departing and arriving in Lahore. On 18 and 19 December many people were arrested on suspicion of the murder. Many people were beaten mercilessly and caught and jailed without warrant. The HSRA decided that it was not safe for Bhagat to be in Lahore as he would be soon caught by the police if so. So they planned Bhagat's escape from Lahore to Calcutta. On the evening of 19 December Sukhdev requested Durga Bhabhi (wife of Bhagwati Vohra, a member of HSRA) to accompany Bhagat to escape from Lahore. Durga Bhabhi agreed willingly. To avoid recognition Bhagat had shaved his beard and cut his long hair (a violation of Sikh customs) and wore an English outfit. He asked Durga Bhabhi to wear an English outfit too. Rajguru was asked to be their porter at the station. At about 6:00 am, Bhagat along with Durga Bhabhi and Rajguru, who acted as their porter and Azad reached the railway station and boarded the first train from Lahore to Calcutta. At Calcutta, Bhagat and Chandra Shekhar Azad met Jatindranath Das, a scholar and a scientist in January 1929. Jatin was asked to make bombs, and other weapons for the HSRA. The HSRA set up a bomb factory in Agra for the purpose. In March, the arsenals were tried and tested in secret near the Yamuna River. In April, the British Government introduced two bills: the Public Safety Bill and the Trade Dispute Bill. The first was for the purpose of curbing mass protests that were taking place in many parts of the country and the second was for lowering the pension of the mill workers and farmers by 10%. The Bombay Textile Mill workers announced a strike on 15 February to protest against low wages paid by Sir Nusserwanjee Wadia, the owner of the mill. The workers remained on strike for many days. They also barred the Wadia's entry in the mill. Wadia reported the problem to his friend who was a British officer. The officer agreed to help him. On 1 April, he came with a large cavalry force to disperse the protesting workers to make way for Wadia. First the officer requested the workers to end the strike but they refused to do so. The officer then ordered the cavalry to lathi-charge on the workers. Many were injured in this lathi-charge. To put a stop on the strikes of workers, the government decided to pass the bills as soon as possible. They decided to pass the bills on 8 April with the special powers of the Viceroy Lord Irwin in the Central Assembly. Bhagat Singh decided to protect the rights of the farmers of his country to protest against unjust laws of the government and decided to halt the passing of bills. He made a plan to bomb the Central Legislative Assembly in New Delhi with Batukeshwar Dutt. On 8 April the Speaker Vithalbhai Patel stood up to announce the passing of the bills at 1230 hours. They threw two small bombs into the Assembly chamber from the public gallery. Nobody was killed.. They were shouting slogans of revolution and threw pamphlets. They surrendered. Bhagat and Dutt were jailed. They were kept in Delhi Central Jail (present day Maulana Azad Medical College, Delhi) from 22 April to 13 June. The trial for Delhi Assembly Bomb case began on 7 May. The lawyer Asaf Ali defended Dutt. Bhagat defended himself. On 12 June, both were sentenced to life imprisonment for: \"causing explosions of a nature likely to endanger life, unlawfully and maliciously\". In the Court hearings, Bhagat Singh and Batukeshwar Dutt made a statement to clarify their motives for bombing and about the repressive action of government against the labourers and farmers of the country: The next day, the police came to know about his involvement in the murder of ASP Saunders. They police took him to Mianwali jail. Bhagat got to know that the English prisoners and thieves were treated with dignity and were given healthy food but Indian prisoners weren't. He and other revolutionaries began a hunger strike which lasted from 15 June to 5 October 1929. The demands that Bhagat placed before the Jailor Major Pindi Das Chopra were: * There should be no discrimination between the English and Indian prisoners. * Indian prisoners should be given books and newspapers to read and clean clothes to wear as given to the English. * Healthy food should be provided to the Indian prisoners. The demands were refused many times by the jail authorities. The police tried to get the prisoners to break their hunger strike. Jawaharlal Nehru and Muhammad Ali Jinnah supported the hunger strike. It got popular support. The Lahore Conspiracy Case trial began on 10 July 1929, in the Lahore Jail court house. The Presiding Judge was Justice Rai Sahib Pandit Sri Kishen. There were 14 accused. Jatin Das who had begun his hunger strike 28 days after Bhagat, died on 13 September 1929 due to weakness. Thousands of people attended his funeral procession in Lahore and felt proud for the brave revolutionary Jatin Das. He was cremated at Calcutta on 16 September. On 5 October the Jail authorities agreed to the prisoners' demands and they ended their hunger strike. Rajguru was arrested at a motor garage in Pune on 30 September 1929 and was presented in the court hearing on 18 October. Kundan Lal and Bejoy Kumar Sinha were also arrested in September. The Conspiracy Case trials went on with no decision for months. Jaigopal betrayed the HSRA by telling that Bhagat was involved in the murder of Saunders. On 21 October 1929, as Jaigopal spoke the truth a revolutionary Prem Dutt became so angry he insulted him and threw his shoes towards him. Jaigopal fainted and collapsed in the witness box. Prem Dutt was handcuffed but the revolutionaries protested so Magistrate Rai Saheb ordered all of them to be handcuffed. They refused to cooperate. The police then started to beat them and forced them to be handcuffed. They were badly wounded. Many had to be taken away from the court on stretchers. To speed up the slow-moving trial, Lord Irwin declared an emergency on 1 May 1930. The arrested people were to go to trial by the special tribunal appointed by the Viceroy on 30 April. The tribunal consisted three senior judges – Justice Coldstream, Justice G. C. Hilton and Justice Agha Hyder. The trials of the special tribunal began on 5 May 1930 at the court of special magistrate in Poonch House. The location had been shifted from the Lahore Jail. On 12 May, the revolutionaries were again harshly beaten with sticks and were dragged to the court for trial. The revolutionaries boycotted the trials from that day on and did not present themselves in the court. They demanded that Justice G. C. Hilton be removed and an Indian judge preside the case. But the government refused. In June, they removed Justice Agha Hyder (who had tried to stop the police from beating the revolutionaries as he had sympathy for them) and presiding judge Justice Coldstream and made Justice G. C. Hilton the presiding judge and appointed Justice Abdul Qadir and Justice Tapp instead. The trials continued in the absence of the accused. They were only conducted on the basis of testimonies of the 3 government approvers Jaigopal, Hans Raj Vohra & Phonindra Nath Ghosh. The testimonies were utilised as prime evidence against the accused and were thus used to give the judgement in the case. On 7 October 1930, the special tribunal of three judges pronounced their judgement as follows — *To be hanged till death — Bhagat Singh, Sukhdev Thapar, Shivaram Rajguru *Sentenced to life imprisonment — Shiv Verma, Jaidev Kapoor, Mahavir Singh, Gaya Prasad, Kishori Lal, Bejoy Kumar Sinha, Kamal Nath Tiwari *Termed imprisonment — Prem Dutt – 5 Years; Kundan Lal – 7 Years *Acquitted due to lack of evidence — Desh Raj, Ajoy Kumar Ghosh, Jatindra Nath Sanyal Bhagat Singh, Sukhdev and Rajguru were ordered to be hanged on 27 October 1930 at 8 am, but the sentence was delayed. Finally the date was decided as 24 March 1931. Many nationalist leaders appealed to the government to reduce the punishment, including Madan Mohan Malaviya, Mohammed Ali Jinnah and Subhash Chandra Bose who had positive views about the revolutionaries. Mahatma Gandhi asked the Viceroy Lord Irwin to revoke the death sentence of the three revolutionaries but he refused to do so. On 22 March, the Jailor decided to bring forward the hanging time 11 hours earlier to prevent public protest outside the jail. The families of the three were not allowed to meet them on 23 March. The father of Bhagat, Kishan Singh with his wife waited outside for a long a time to get a last glimpse of their son but even they were denied. At 7:20 pm, the Jailor P. D. Chopra arrived with other officers to take them to the gallows. At that time, Bhagat was reading the biography of Russian communist leader Vladimir Lenin. He called out to Bhagat to get ready as they were getting late. He replied 'wait a minute, one revolutionary is meeting the other'. He read for a few minutes and came out of the cell. While going towards the gallows, Bhagat, Sukhdev and Rajguru weren't even slightly afraid. They were singing the patriotic song 'Mera Rang De Basanti Chola'. At 7:28, the three arrived at the execution site where several members of the jail staff including Jail Doctor Narinder Singh Sodhi, IG Prisons Fredrick Barker, Senior officer Charles Stead and District magistrate Allan Arbuthnot Lane Roberts, were waiting for them. Jail warden Chhatar Singh was also present. Bhagat said to Lane Roberts 'Sir, today you will see how bravely the great sons of India embrace death'. So at 7:30 pm, the three were hanged till death by the Lahore Central Jail authorities. After hanging, their bodies were carried away secretly to Ferozepore through the backdoor of the jail. Late at night, the authorities reached the Sutlej river banks at Ferozepore where they burnt the three bodies. Soon a big crowd armed with fire torches arrived the river banks. The authorities were frightened and they fled. The people in the crowd then informed Bhagat's father Kishan Singh about the incident who along with Vidyawati came rushing to Ferozepore. Kishan Singh wept with grief along with pride at the same time for his brave son. The next day, the people and Kishan Singh cremated the bodies of Bhagat Singh, Sukhdev and Rajguru. In the memory of their martyrdom the day 23 March is celebrated every year as 'Martyrs Day'. The Government of India has made memorials and released postage stamps to honour these brave martyrs of India. == Notes == == References == Category:1907 births Category:1931 deaths Category:Indian revolutionaries",
 "title": "Bhagat Singh"
}