{
 "id": "235454",
 "text": "was a after Kōchō and before Kenji. This period started in February 1264 and ended in April 1275.Nussbaum, Louis-Frédéric. (2005). \"Bun'ei\" in Japan Encyclopedia, p. 90. During this time, the emperors were and .Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 253-261; Varley, H. Paul. (1980). Jinnō Shōtōki. p. 232-233. == Events of the Bun'ei era == * 17 March 1272 (Bun'ei 9, 17th day of the 2nd month): Former Emperor Go-Saga died.Titsingh, p. 261; Imperial Household Agency (Kunaichō), 後嵯峨天皇 (88); retrieved 2012-5-16. * 1274 (Bun'ei 11, 1st month): In the 15th year of Kameyama's reign, the emperor resigned.Titsingh, p. 261; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui-no-Rei); retrieved 2012-5-22. * 1274 (Bun'ei 11, 3rd month): Emperor Go-Uda became the monarch of Japan.Titsingh, p. 262. The retired Emperor Kameyama continued to be important and powerful.This was called insei or \"cloistered rule\". * 1274 (Bun'ei 11, 10th month): Former Emperor Go-Fukakusa's son Hirohito-shinnō was named Crown Prince and heir to Emperor Go-Uda. Hirohito and Go-Uda were first cousins.Titsingh, p. 262, 270. * 19 November 1274 (Bun'ei 11, 20th day of the 10th month): Kublai Khan sent a fleet and an army to invade Japan. Some military forces are landed near Fukuoka in Kyūshū. However, a storm sank many of the ships. The major part of the invading army was drowned. The invaders retreated to Korea.Davis, Paul K. (2001). 100 decisive battles: from ancient times to the present, p. 147. During the brief fighting, the Hakozaki Shrine was burned to the ground.Turnbull, Stephen R. (2003). Genghis Khan & the Mongol Conquests 1190–1400, p. 66. This 1274 event was called Bun'ei no eki.Nussbaum, \"Bun'ei no eki\" at p. 90. ==Related pages == * Kamakura period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" Bun'ei 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 1264 1265 1266 1267 1268 1269 1270 1271 1272 1273 1274 1275 Preceded by: Kōchō Era or nengō: Bun'ei Succeeded by: Kenji Bun'ei Category:1260s in Japan Category:1270s in Japan",
 "title": "Bun'ei"
}