{
 "id": "235446",
 "text": "{{Infobox Writer | name = Henry Wadsworth Longfellow | image = HenryWLongFellow1868.jpg | caption = Longfellow in 1868 by Julia Margaret Cameron | birth_date = | birth_place = Portland, Maine, United States | death_date = | death_place = Cambridge, Massachusetts, United States | occupation = Poet Professor | genre = | movement =Romanticism | signature = HWLongfellow autograph1.png }} Henry Wadsworth Longfellow (February 27, 1807 – March 24, 1882) was an American teacher and poet. Some of his poems are \"Paul Revere's Ride\", The Song of Hiawatha, and Evangeline. He was also the first American to translate Dante Alighieri's The Divine Comedy. He was one of the five Fireside Poets. He was one of the most influential persons in the culture of the 1800s in the USA. Longfellow was born in Portland, Maine and studied at Bowdoin College. He then spent time in Europe. He returned and became a professor at Bowdoin and, later, at Harvard College. His first major books of poetry were Voices of the Night (1839) and Ballads and Other Poems (1841). Longfellow retired from teaching in 1854 to spend more time writing. He lived the rest of his life in Cambridge, Massachusetts, living in George Washington's old headquarters building. His first wife, Mary Potter, died in 1835 after a miscarriage. His second wife, Frances Appleton, died in 1861 after her dress caught fire. Longfellow had difficulty writing poetry for a time after she died. He mostly worked on his translation. He died in 1882. Longfellow mainly wrote lyric poems which are known for their musicality. His poems often told stories of mythology and legend. He became the most popular American poet while he was alive. He was also successful in other countries. Some criticized him for imitating European styles and for writing poems for everyday people. In 1884, Longfellow became the first non-British writer for whom a commemorative bust was placed in Poet's Corner of Westminster Abbey in London. He is the only American poet represented with a bust.Williams (1964), p. 21 == Early life == Longfellow was born in Maine. One of his grandfathers was a state Senator and the other grandfather had been a Revolutionary War general and a Congressman. Then following his graduation in 1826 from Bowdoin College, where he was a classmate of Nathaniel Hawthorne, Longfellow went to Europe to study. When he returned to the United States three years later, he taught European languages, first at Bowdoin and then at Harvard. After 18 years of teaching at Harvard, he resigned his position because he felt it interfered with his writing. == Influences on society and culture == He was a commanding person in the culture life of 19-century America, a romantic who identified with the great traditions of European literature and thought. Also at the same time, he was rooted in American life and history that charged his imagination with amazing themes and made him ambitious for success. == End of life == During the last years of his life, Longfellow received many honors, including honorary degrees from Cambridge and Oxford Universities in England. After his death, a bust of Longfellow was placed in the Poet’s Corner of Westminster Abbey—the first American to be so honored. In the late 19th century, Longfellow was without a doubt the most popular American poet. ==List of works== *Outre-Mer: A Pilgrimage Beyond the Sea (Travelogue) (1835) *Hyperion, a Romance (1839) *The Spanish Student. A Play in Three Acts (1843)Calhoun (2004), p. 179 *Evangeline: A Tale of Acadie (epic poem) (1847) *\"Kavanagh: A Tale\" (1849) *\"The Golden Legend\" (poem) (1851) *The Song of Hiawatha (epic poem) (1855) *The Children's Hour (1860) *Household Poems (1865) *The New England Tragedies (1868) *The Divine Tragedy (1871) *Christus: A Mystery (1872) *\"Aftermath\" (poem) (1873) *The Reaper and the Flowers (1839) *The Bell of Atri (from The Sicilian's Tale) (1863–72) ;Poetry collections *A Psalm of Life (1838) *Voices of the Night (1839) *Ballads and Other Poems (1841) *Poems on Slavery (1842) *The Belfry of Bruges and Other Poems (1845) *Birds of Passage (1845) *The Seaside and the Fireside (1850) *The Courtship of Miles Standish and Other Poems (1858) *Tales of a Wayside Inn (1863) *Flower-de-Luce (1867) *Three Books of Song (1872)Calhoun (2004), p. 242 *The Masque of Pandora and Other Poems (1875) *Kéramos and Other Poems (1878) *Ultima Thule (1880) *In the Harbor (1882) *Michel Angelo: A Fragment (incomplete; published posthumously) ;Translations *Coplas de Don Jorge Manrique (Translation from Spanish) (1833) *Dante's Divine Comedy (Translation) (1867) ;Anthologies *Poets and Poetry of Europe (Translations) (1844) *The Waif (1845) *Poems of Places (1874) ==Notes== ==References== * Calhoun, Charles C. Longfellow: A Rediscovered Life. Boston: Beacon Press, 2004. . * Williams, Cecil B. Henry Wadsworth Longfellow. New York: Twayne Publishers, Inc., 1964. ==Other websites== Sources * Poems by Henry Wadsworth Longfellow and biography at PoetryFoundation.org * - Plain text and HTML *Works by Henry Wadsworth Longfellow at Internet Archive - Scanned books, many illustrated and original editions. * Audio - Hear the Village Blacksmith * Maine Historical Society Searchable poem text database, biographical data, lesson plans. Other *Longfellow National Historic Site in Cambridge, Massachusetts *Wadsworth-Longfellow House in Portland, Maine *Longfellow's Translation of Dante rendered side by side with that of Cary and Norton *Famous Quotations by Henry Wadsworth Longfellow *Audiobooks--Layne Longfellow Reads H.W. Longfellow Category:1807 births Category:1882 deaths Category:19th-century American poets Category:Writers from Portland, Maine Category:Writers from Cambridge, Massachusetts",
 "title": "Henry Wadsworth Longfellow"
}