{
 "id": "235702",
 "text": "Ingrid Reichel (born 1961 in St. Pölten, Lower Austria) is an Austrian artist, painter, essayist, and a reviewer of arts and literature. ==Biography== Ingrid Reichel has grown up in Kabul, Afghanistan and between 1967 and 1981 in Paris, France. Then she moved to St. Pölten, the capital of Lower Austria, where she still lives with her family. She had her first art exhibitions in 1991. Her works address sociopolitical topics. Ingrid Reichel is very active in the cultural life of St. Pölten and introduces children to arts and literature. Since 2005 she writes critical reviews, essays and portraits of artists. She is a directing member of the Literary Society St. Pölten (Literarische Gesellschaft) and writes also for its literary magazine etcetera. ==Exhibitions== * 1998: Cycle Nackte Gedanken, Prehistoric Museum/Castle of Traismauer and Gallery Kleiner Bischofshof in Vienna * 1999: Reflections, group exhibitions * 2000: Cycle ZOOM, ORF Landesstudio Niederösterreich (TV of Lower Austria), St. Pölten * 2000: IM_PULS, Dentist Congress, Melk * 2001: Cycle TABU, Communal Museum of St. Pölten * 2002: Cycle Geh.ende, Gallery fein.sinn, St. Pölten * 2003: Cycle isen formunge, Haus Kremayr, Museum Ybbsitz * 2005: zart beseitigt, poster series, exposition stock.WERK, St. Pölten, and Library of Lower Austria * 2007: high.matt.ade, Aktionsradius, Vienna * 2008: Zwischen Sein & Schein, 30 Meter Sonnenschein, façade of the Communal Museum of St. Pölten ==Other websites== *Homepage of the artist, retrieved on 2009-09-14 *Literary magazine etcetera, St. Pölten, retrieved on 2009-09-14 *Eva Riebler interviews Ingrid Reichel (in German), retrieved on 2009-09-14 *Artistic project Zwischen Sein & Schein in the communal museum of St. Pölten , retrieved on 2009-09-14 *Critical review on the drama Her mit den Prinzen und weg mit dem Speck, Landestheater of Lower Austria, retrieved on 2009-09-14 Category:1961 births Category:Living people Category:Austrian painters Category:Austrian writers Category:Essayists Category:People from Lower Austria",
 "title": "Ingrid Reichel"
}