{
 "id": "23597",
 "text": "The Spice Girls were a British girl group. The group formed in 1994. The group had five members. They were famous in the late 1990s and early 2000s. == Nicknames == Each member uses a nickname initially given to them: * Melanie Chisholm is \"Sporty Spice\" * Emma Bunton is \"Baby Spice\" * Melanie Brown is \"Scary Spice\" * Victoria Adams is \"Posh Spice\" * Geri Halliwell is \"Ginger Spice\" == History == They were signed to Virgin Records. The Spice Girls released their debut single, \"Wannabe\" in 1996. It hit number-one in more than 30 countries. The song helped make the group as a global phenomenon. The group is credited for starting the trend of commercial success of teen pop in the late 1990s. Their debut album, Spice, sold more than 28 million copies worldwide. It is the best-selling album by a female group in music history. They have sold over 75 million records worldwide. This makes them the best- selling female group of all time. It also makes them the most successful British band since the Beatles.\"This is the story of the greatest pop phenomenon since The Beatles\" BBC Entertainment. 25 August 2008\"Britain's most successful band since the Beatles\" 1998: Ginger leaves the Spice Girls, BBC The group released three albums: Spice in 1996, Spice World in 1997 and Forever in 2000. The Spice Girls starred in Spiceworld: The Movie, which was released in December 1997. The members reunited in 2007. They released a Greatest Hits album in November and said a world tour would start in December. On 1 February 2008, the group said that they would be ending the tour early. In 2012, they reunited again to perform at the closing ceremonies of the 2012 Summer Olympics in London. ==References== Category:1994 establishments in England Category:1990s British music groups Category:2000s British music groups Category:British girl groups Category:English pop music groups Category:Musical groups established in 1994 Category:Musical quintets Category:Musical groups disestablished in 2008 Category:2008 disestablishments in England",
 "title": "Spice Girls"
}