{
 "id": "236127",
 "text": ", also known as Enkei or Enkyū, was a after Tokuji and before Ōchō. This period started in October 1308 and ended in April 1311.Nussbaum, Louis- Frédéric. (2005). \"Enkyū\" in Japan encyclopedia, p. 180. During this time, the emperor was .Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 278-279; Varley, H. Paul. Jinnō Shōtōki, pp. 239-241. The nengō Enkyō means \"Becoming Prolonged\" because of the tail of the great comet which was seen in the night sky of 1308.Greenwood, Ned. (2011). Hachiman Taro: Firstborn of the God of War, p. 87. == Events of the Enkyō era == Retired former-Emperor Fushimi administered the court up through the time he took the tonsure as a Buddhist monk,Varley, p. 241. which happened after this nengō ended.Titsingh, p. 279. * 1308 (Enkyō 1): After the death of Emperor Go-Nijō, the throne passed to a cousin who would come to be known as Emperor Hanazono. The new emperor was 12 years old.Titsingh, p. 279; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui- no-Rei); retrieved 2012-6-29. * 1310 (Enkyō 3, 11th month): Hōjō Sadafusa died; and Hōjō Tokiatsu was named to take his place as Kyoto representative of the military government in Kamakura. An early version of The Tale of the Heike (Heike monogatori) has been traced to a draft written during this era.Watson, Burton et al. (2008). The Tales of the Heike, p. 196. ==Related pages == * Kamakura period * Enkyō (Edo period), 1744-1748 == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" Enkyō 1st 2nd 3rd 4th 1308 1309 1310 1311 Preceded by: Tokuji Era or nengō: Enkyō Succeeded by: Ōchō Enkyō (Kamakura period) Category:1300s establishments Category:14th- century establishments in Japan Category:1310s disestablishments in Japan Category:14th-century disestablishments in Japan",
 "title": "Enkyō (Kamakura period)"
}