{
 "id": "236216",
 "text": "The 1876–1877 Constantinople Conference (or ‘Shipyard Palace Conference’, from the conference venue) of the Great Powers (Britain, Russia, France, Germany, Austria-Hungary and Italy) was held in Istanbul (Constantinople) from 23 December 1876 until 20 January 1877. Following the Herzegovinian Rebellion started in 1875 and the Bulgarian Uprising in April 1876, the Great Powers agreed on a project for political reforms both in Bosnia and in the Ottoman territories with a majority Bulgarian population.Correspondence respecting the Conference at Constantinople and the affairs of Turkey: 1876–1877. Parliamentary Papers No 2 (1877). p. 340. ==Participants== The Great Powers were represented at the conference respectively by:H. Sutherland Edwards. Sir William White K.C.B., K.C.M.G., For Six Years Ambassador at Constantinople. London: John Murray, 1902. * United Kingdom of Great Britain and Ireland: : Lord Salisbury and Sir Henry Elliot; * Russian Empire: : Count Nikolay Ignatyev (historical spelling Nicolai Ignatieff); * Kingdom of France: : Count Jean-Baptiste de Chaudordy and Count François de Bourgoing; * German Empire: : Baron Karl von Werther; * Austro-Hungarian Empire: : Baron Heinrich von Calice and Count Ferenc Zichy; * Kingdom of Italy: : Count Luigi (Lodovico) Corti. Of these, Lord Salisbury, Count de Chaudordy and Baron von Calice were Ambassadors Plenipotentiary to the conference, while Count Ignatyev, Sir Henry Elliot, Count de Bourgoing, Baron von Werther, Count Zichy and Count Corti were the resident Ambassadors of their countries in Constantinople. The US Consul General in Constantinople, Eugene Schuyler also took an active part in drafting the conference decisions.The Eastern Question. The Constantinople Conference. What May Be Expected from the Meeting. The Foreign Representatives and How They Are Treated. The Report of the American Consul General. Various Items of Interest. New York Times, 31 December 1876. The Ottoman Empire was represented at the conference by: : Mithat Pasha, Saffet Pasha and Edhem Pasha. Mithat Pasha was the Grand Vizier (First Minister), and Saffet Pasha the Foreign Minister of Turkey. Although the Turkish representatives participated in the plenaries of the conference, they were not invited to the preceding working sessions at which the Great Powers negotiated their agreement. Lord Salisbury and Count Ignatyev played a leading role in the process. Ignatyev was trying to dispel British misgivings about Russia’s assumed role of a protector of the Orthodox Slavs being but a disguise of its drive to take over the Bosporus and Constantinople itself and thus – as Prime Minister Disraeli feared – potentially threaten the vital Mediterranean routes to British India.Buckle G.E., W.F. Monypenny, The Constantinople Conference, in: The Life of Benjamin Disraeli, Earl of Beaconsfield. Vol. VI, p. 84. On his part, Salisbury saw the conference as a promising opportunity for mapping out a comprehensive deal with Russia over their conflicting territorial ambitions in Central Asia.Sneh Mahajan. British Foreign Policy, 1874-1914: The role of India. London and New York: Routledge, 2002. p. 40. ==Decisions== ===Bosnia=== The conference envisaged the creation of an autonomous province including Bosnia and most of Herzegovina, while a southern part of the latter was to be ceded to Montenegro. ===Bulgaria=== The Great Powers agreed on a substantial Bulgarian autonomy to take the form of two new Ottoman provinces (vilayets) established for the purpose: Eastern, with capital Tarnovo, and Western, with capital Sofia. The conference determined that, as of the late 19th century, the Bulgarian ethnic territories within the Ottoman Empire extended to the Danube Delta in the northeast, Kastoria in the southwest, Kirklareli and Edirne in the southeast, and Niš in the northwest. These territories were to be incorporated into the two Bulgarian autonomous provinces as follows: * Eastern Bulgarian autonomous province, including the Ottoman sandjaks – second level administrative divisions – of Tarnovo, Ruse, Tulcea, Varna, Sliven, Plovdiv (bar the kazas – third level administrative divisions – of Ardino and Smolyan), and part of the Edirne sandjak including the kazas of Kirklareli, Svilengrad and Elhovo.Conference de Constantinople. Reunions Préliminaires. Compte rendu No. 8. Scéance du 21 décembre 1876. Annexe III Bulgare. Règlement organique. (in French)Further Correspondence respecting the affairs of Turkey. (With Maps of proposed Bulgarian Vilayets). Parliamentary Papers No 13 (1877). * Western Bulgarian autonomous province, including the sandjaks of Sofia, Vidin, Niš, Skopje, Bitola (bar the kazas of Debar and Korçë), the Gotse Delchev, Melnik, and Sidirokastro kazas of the Serres sandjak, and the kazas of Strumica, Veles, Tikveš and Kastoria. The Great Powers elaborated in detail the constitutional, legislative, executive, defense and law enforcement arrangements, cantonal administrative system, taxation, international supervision etc. for the proposed autonomous provinces. ==Conclusion== The agreed decisions of the six Great Powers were formally handed over to the Ottoman Government on 23 December 1876,Correspondence respecting the Conference at Constantinople and the affairs of Turkey: 1876–1877. Parliamentary Papers No 2 (1877). p. 140. dismissing the opening Turkish suggestions that the Conference's mission might have been obviated by a new Ottoman Constitution approved by Sultan Abdul Hamid II that same day.L.S. Stavrianos. Constantinople Conference, in: The Balkans Since 1453. Austin: Holt, Rinehart and Winston, 1963. In the subsequent conference plenary sessions Turkey submitted objections and alternative reform proposals that were rejected by the Great Powers, and attempts to bridge the gap did not succeed.Turkey and the Great Powers. The Constantinople Conference. The Commissioners' Last Proposals to the Porte. An Ultimatum Presented the Great Dignitaries of State to Decide Upon an Answer. New York Times, 16 January 1877. Eventually, on 18 January 1877 Grand Vizier Mithat Pasha announced the definitive refusal of Turkey to accept the conference decisions.N. Ivanova. 1876 Constantinople Conference: Positions of the Great Powers on the Bulgarian political question during the Conference. Sofia University, 2007. (in Bulgarian) ==Legacy== The failure of the Ottoman Government to implement the decisions of the Constantinople Conference triggered the 1877–1878 Russo-Turkish War, depriving at the same time Turkey – in contrast to the preceding 1853–1856 Crimean War – from Western support. Tsarigrad Peak in Imeon Range on Smith Island in the South Shetland Islands, Antarctica is named after the conference (‘Tsarigrad’ being the old Bulgarian name for Constantinople).SCAR Composite Gazetteer of Antarctica: Tsarigrad Peak. ==Related pages== * Russo-Turkish War (1877–1878) ==Notes== ==References== * R.W. Seton-Watson. Disraeli, Gladstone and the Eastern Question: A Study in Diplomacy and Party Politics. New York: W.W. Norton & Co., 1972. p. 108\\. * George Washburn. Fifty Years in Constantinople and Recollections of Robert College. Boston and New York: Houghton Mifflin, 1909. p. 115–119. Category:1870s in Europe Category:1876 Category:1877 Category:History of Turkey Category:Constantinople",
 "title": "Constantinople Conference"
}