{
 "id": "236293",
 "text": "was the 5th emperor of Japan,Imperial Household Agency (Kunaichō), 孝昭天皇 (5); retrieved 2011-10-19. according to the traditional order of succession.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 4-5Brown, Delmer et al. (1979). Gukanshō, p. 251; Varley, Paul. (1980). Jinnō Shōtōki, p. 90; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider Emperor Kōshō to be a legendary person,Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-19. and the name Kōshō-tennō was created for him posthumously by later generations. No certain dates can be assigned to this emperor's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 30. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. The Gukanshō records that Kōshō ruled from the palace of Ikekokoro-no-miya at Waki-no-kami in what will come to be known as Yamato province.Brown, p. 251; Varley, p. 90. == Traditional history == Kōshō is almost certainly a legend. The Kojiki records only his name and genealogy. The Nihonshoki includes Kōshō as the fourth of .Aston, pp. 142-143. Emperor Kōshō was the oldest son of Emperor Itoku.Ponsonby-Fane, p. 30; Varley, p. 90. Jinnō Shōtōki records that his mother was Amanotoyototsu- hime, and his grandmother by his mother's side was Okishimimi-no-kami.Varley, p. 90. == Events of Kōshō's life == The absence of information about Kōshō does not show that he was not real. Very little information is available for study before the rule of the 29th monarch, Emperor Kimmei (509?-571).Titsingh, pp. 34-36; Brown, pp. 261-262; Varley, pp. 123-124. === After his death === This emperor's official name after his death (his posthumous name) was regularized many centuries after the lifetime which was ascribed to Kōshō.Aston, pp. 144-145. The actual site of his grave is not known. According to the Imperial Household Agency, this emperor is venerated at a memorial Shinto shrine (misasagi) at Nara. == Related pages == * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree == References == Category:Emperors of Japan",
 "title": "Emperor Kōshō"
}