{
 "id": "236339",
 "text": "Anne of Denmark (12 December 1574 – 2 March 1619) was queen consort of Scotland, England, and Ireland as the wife of King James VI and I.Williams, 1, 201; Willson, 403. Anne, the second daughter of King Frederick II of Denmark, married James in 1589. when she was 15 years old. She gave birth to seven children, but only three lived to become adults. One of them was the future Charles I. She often used Scottish politics when she fought with James about her son, Prince Henry Frederick. She also used them in her arguments about his treatment of her friend Beatrix Ruthven. Anne seems to have loved James at first. However, they later became cooler towards each other and lived separately. However, both had respect and even some love for each other.Stewart, 182, 300–301. In England, Anne was more interested in art than politics. She built a beautiful and culturally-rich court of her own.Barroll, 15, 35, 109; \"Although Anna had considerable personal freedom and her own court, she does not...[go against] her husband in factional politics as she did in Scotland, and her support was not often sought (looked for). Where the Queen's court came into its own was as an artistic salon.\" Stewart, 183. After 1612, she became ill and later stopped being in the center of court life. She was said to have died a Protestant. However, evidence suggests that she may have been a Catholic at some time in her life.The archbishop of Canterbury reported that she had died saying that Catholicism was false. \"But, then,” adds historian John Leeds Barroll, “we are all familiar with the modern 'press release'. In Anna's day, too, there was much to be said for...[spreading] an official version of England's queen dying 'respectably'.\" Barroll, 172; A letter from Anne to Scipione Borghese of 31 July 1601 is \"open in its embrace of Catholicism\", according to McManus, 93. Historians have often thought of Anne as a queen who was light, selfish and not very important.Agnes Strickland (1848), 276 Retrieved 10 May 2007; Willson, 95; \"Her traditionally flaccid court image...\" Barroll, 27; Croft, 55; \"Anne had proved to be both dull and indolent (lazy), though showing a certain ... amiability so long as her whims were satisfied. She was interested in little that was more serious than matters of dress.\" Akrigg, 21. Recently, however, many people point out Anne's independence and importance as an encourager of the arts in the Jacobean Age.\"She quickly moved vigorously into court politics...she soon became a political presence at the Scottish court.\" Barroll, 17; \"Though she has been accorded insufficient (not enough) attention by historians, James's Queen, Anne of Denmark, was politically astute and active.\" Sharpe, 244; \"This new king's influence on the high culture of the Stuart period, although considerable in certain discrete areas, has been misunderstood in terms of innovations at the court itself...during the first decade of his reign (rule), these innovations were...[mostly] shaped by James’s much neglected queen consort, Anna of Denmark.\" Barroll, 1–2. ==Early life== Anne was born on 12 December 1574 at the castle of Skanderborg. Her birth came as a blow to her father, King Frederick II of Denmark, who had been hoping for a son.Williams, 1. Anne's mother, Sophie of Mecklenburg-Güstrow, however, was only 17. Three years later, she gave birth to a son, who was the future Christian IV of Denmark.Williams, 3. Anne was sent with her older sister Elizabeth to Güstrow, Germany. Anne was to be raised there by her grandparents on her mother's side. They were the Duke and Duchess of Mecklenburg because the Danish court was then very wild. Frederick II was famous for heavy eating and much drinking. He was also unfaithful to Sophie. In Güstrow, however, Anne enjoyed a quiet and stable life in her early years.Williams, 2. Christian was also sent to be brought up at Güstrow in 1577. Two years later, however, the Rigsraad, or Danish Privy Council, successfully asked him to move to Denmark. Anne and Elizabeth came back with him.Williams, 5. Anne enjoyed a close and happy family education in Denmark, mostly because of Queen Sophie. She took care of the children herself when they were ill.Croft, 24; The English agent Daniel Rogers reported to William Cecil that Sophie was \"a right virtuous and godly Princess which with motherly care and great wisdom ruleth her children.\" Williams, 4. Many people from all over Europe wanted to marry Anne and her older sister. Among thpse people were James VI of Scotland. He liked Denmark because he thought of it as a kingdom with the right religion and a good trading partner.Croft, 24; James's other seriously possible wife was Catherine de Bourbon. She was the sister of the Huguenot King Henry of Navarre (future Henry IV of France), who was liked by Elizabeth I of England. Stewart, 105–6; Williams, 12. However, she was eight years older than he was. Another reason James did not marry her was because Henry needed great military help. Willson, 86. Scottish ambassadors had at first tried to make him marry the oldest daughter.Williams, 10. However, Frederick betrothed Elizabeth to Henry Julius, Duke of Brunswick.Williams, 10; Willson, 87–8. He promised the Scots instead that \"for the second [daughter] Anna, if the King did like her, he should have her.\" === Betrothal and proxy marriage === Sophie's position became more difficult after Frederick's death in 1588.The clergyman said at Frederick's funeral that \"had the King drunk a little less, he might have lived many a day yet.\" Williams, 6. She had to join in a power struggle with the Rigsraad for control of King Christian. However, she worked harder than Frederick in making people marry. She overcame difficult points about the dowry and the position of Orkney.The Orkney Islands had been a part of the dowry of Princess Margaret of Denmark when she married James III of Scotland in 1469. It could be given back to Denmark when the dowry was fully paid. Williams, 10. She sealed the agreement by July 1589.The Danes gave up their claim to the Orkneys. James said he would not be a merchant for his bride. He dropped his demand for a great dowry. Williams, 14; Willson, 88. Anne seems to have been very excited about the match.Williams, 14–15. On 28 July 1589, the English spy Thomas Fowler said that Anne was greatly in love with James. He said that \"it were death to her to have it broken off\". He added that she proved her love in many ways.Letter to William Asheby, English ambassador in Denmark. Williams, 15. However, Fowler also suggested that James did not return Anne's love but liked men better than he liked women.\"All his life, except perhaps for six short months, King James disliked women, regarding them as inferior (lower) beings. All his interest was centered on the attractions of personable young men.\" Williams, 14–15. That would not have been told to the 14-year-old princess, who was was faithfully embroidering shirts for her fiancé. Meanwhile, 300 tailors worked on making her wedding dress.There were other dresses: five hundred Danish tailors and embroiderers were said to have been at work for three months. Willson, 87; A dress of peach and parrot-coloured damask with skirts lined with pillows round the hips was especially liked. Williams, 14. Even if the rumours were true, James needed a royal marriage because he needed to keep up the Stuart line.Croft, 23–4. \"God is my witness,\" he explained, \"I could have abstained longer than the weal of my country could have permitted, [had not] my long delay bred in the breasts of many a great jealousy of my inability, as if I were a barren stock.\"Willson, 85. On 20 August 1589, Anne and James were married separately but to each other in what is called a \"proxy marriage.\" The marriage took place in Kronborg Castle, in Helsingør, Denmark. The ceremony ended with James's representative, George Keith, 5th Earl Marischal, sitting next to Anne on the bridal bed.Williams, 15; McManus, 61. == Notes == == References == *Akrigg, G.P.V ([1962] 1978 edition). Jacobean Pageant: or the Court of King James I. New York: Athenaeum. . *Ackroyd, Peter (2006). Shakespeare: The Biography. London: Vintage. . *Barroll, J. Leeds (2001). Anna of Denmark, Queen of England: A Cultural Biography. Philadelphia: University of Pennsylvania. . *Cerasano, Susan, and Marion Wynne-Davies (1996). Renaissance Drama by Women: Texts and Documents. London and New York: Routledge. . *Croft, Pauline (2003). King James. Basingstoke and New York: Palgrave Macmillan. . *Fraser, Antonia ([1996] 1997 edition). The Gunpowder Plot: Terror and Faith in 1605. London: Mandarin Paperbacks. . *Haynes, Alan ([1994] 2005 edition). The Gunpowder Plot. Stroud: Sutton Publishing. . *Hogge, Alice (2005). God's Secret Agents: Queen Elizabeth's Forbidden Priests and the Hatching of the Gunpowder Plot. London: Harper Collins. . *McCrea, Scott (2005). The Case For Shakespeare: The End of the Authorship Question. Westport, Connecticut: Praeger/Greenwood. . *McManus, Clare (2002). Women on the Renaissance Stage: Anna of Denmark and Female Masquing in the Stuart Court (1590–1619). Manchester: Manchester University Press. . *Sharpe, Kevin (1996). \"Stuart Monarchy and Political Culture,\" in The Oxford Illustrated History of Tudor & Stuart Britain. Ed. John.S.Morrill. Oxford: Oxford University Press. . *Stewart, Alan (2003). The Cradle King: A Life of James VI & 1\\. London: Chatto and Windus. . *Strickland, Agnes (1848). Lives of the Queens of England: From the Norman Conquest. Vol VII. Philadelphia: Lea and Blanchard. Original from Stanford University, digitized 20 April 2006. Full view at Google Books. Retrieved 10 May 2007. *Williams, Ethel Carleton (1970). Anne of Denmark. London: Longman. . *Willson, David Harris ([1956] 1963 edition). King James VI & 1\\. London: Jonathan Cape Ltd. . Category:1574 births Category:1619 deaths Category:Kings and Queens consort of England Category:House of Oldenburg",
 "title": "Anne of Denmark"
}