{
 "id": "236505",
 "text": "Daniel Charles Jacobs, Jr. (born July 7, 1968) is an American actor, singer, voice artist, and comedian, best known as the voice of King Julien in the Madagascar franchise, substituting for Sacha Baron Cohen since 2008. In Madagascar 3: Europe's Most Wanted (2012), he provided Julien's singing voice in the soundtrack. ==Early life== Jacobs was born Daniel Charles Jacobs, Jr. in Detroit, Michigan on July 7, 1968 to Danny Jacobs, Sr. (?–2011). He is the sixth of seven children. ===College and Bishop Gallagher High School=== Jacobs attended St. Matthew Elementary School and Bishop Gallagher High School (which later merged with St. Florian High School to become Trinity Catholic High School). For 2 years, he pursued business school at Wayne State University. In 1988, he transferred to the University of Arizona and switched his major to musical theatre. ==Career== After graduating from the University of Arizona, Jacobs had acted in regional theaters across the country. He had established himself as a national voice-over talent with clients, including Bissel, Blockbuster, Bud Light, Ford Dealers, GMAC, and KFC, among others. In 1999, Jacobs appeared in his first live-action role in Get the Hell Out of Hamtown. In 2003, he began to tour the nation with \"Triple Espresso: A Highly Caffeinated Comedy.\" In Epic Movie (2007), Jacobs portrayed Borat Sagdiyev and made a cameo appearance as a Pirate with an Eye Patch. When portraying the role of Borat, he impersonated Sacha Baron Cohen, which was praised by the public. ===Voice acting=== In 1999, Jacobs landed a voice role as Curt in Full Blast, though he was not credited. From 2008 to 2015, Jacobs was a substitute for Sacha Baron Cohen as the voice of King Julien in The Penguins of Madagascar, again as an impression of Baron Cohen; Jacobs also provided additional voices in the series. In 2011, he won a Daytime Emmy Award for the role. Jacobs reprised his role in Merry Madagascar (2009) and Madly Madagascar (2013). From 2014 to 2017, he returned to the role in All Hail King Julien. In Penguins of Madagascar (2014), Jacobs once again reprised his role as King Julien. He had also provided voice-overs in various commercials. In addition to the performances that led to All Hail King Julien, Jacobs had been doing voice work for animated television series, including Phineas and Ferb (in which he provided additional voices) and Teenage Mutant Ninja Turtles (in which he voiced Snake / Snakeweed), as well as several video games. He had said that animation, much like the theater, gives actors a chance to play a wide range of roles. He said: He had personally stated that King Julien is his favorite voice role and would gladly reprise his role if ever asked. Jacobs' performance had received more recognition than the character's predecessor Baron Cohen. In Madagascar 3: Europe's Most Wanted (2012), he provided Julien's singing voice for the soundtrack. He provided the voice of Raam and Yeppau in the Lego Star Wars franchise. On September 20, 2017, Jacobs and his co-star John DiMaggio (who voiced Baash) also appeared as guests on The Star Wars Show. He had a voice role in Teen Titans Go! as George Washington and Kiril in The Lion Guard. ===Theatre=== In 1993, Jacobs originated the role of Chico Fernández in Jeff Daniels' comedy The Vast Difference at the Purple Rose Theatre. In 1996–97, he won acting awards in Michigan, Florida, and Wisconsin for his portrayal of Aram in Richard Kalinoski's \"Beast on the Moon.\" ==Personal life== On July 16, 2018, Jacobs paid tribute to his late cousin Michael Anthony Risk via a Facebook video. ===Philanthropy=== On July 13, 2015, Jacobs donated to Kids Kicking Cancer and had entertained some children with his King Julien voice. ==Awards== Jacobs was nominated for the 2010 Annie Award for Voice Acting in a Television Production for his voice role of King Julien in Merry Madagascar (2009), but lost the award to Tom Kenny. He won a 2011 Daytime Emmy Award and 2015 Daytime Emmy Award for his voice role of King Julien in The Penguins of Madagascar (2008–2015) and All Hail King Julien (2014–2017). * 2010: Annie Award for Voice Acting in a Television Production – Nominated * 2011: Daytime Emmy Award for Outstanding Performer in an Animated Program – Won * 2015: Daytime Emmy Award for Outstanding Performer in an Animated Program – Won ==References== Category:1968 births Category:Living people Category:American voice actors Category:American movie actors Category:American television actors Category:Comedians from Detroit Category:Actors from Detroit",
 "title": "Danny Jacobs (actor)"
}