{
 "id": "236528",
 "text": "The Bill of Rights (a short titleconferred by the Short Titles Act 1896, section 1 and the first schedule) is an act of the Parliament of England. Its full name is The Act Declaring the Rights and Liberties of the Subject and Settling the Succession of the Crown. It is often called the English Bill of Rights. The Bill of Rights was passed by Parliament in December 1689. It provides many of the rights requested in the Petition of Right in February after the overthrow of James II of England in the Glorious Revolution, and is still in effect today. The Bill of Rights influenced the United States Constitution, especially the Bill of Rights we have today. ==The Act== The Declaration of Rights was made by an Act of Parliament, the Bill of Rights 1689, which received royal assent in December 1689. The Act explained \"certain ancient rights and liberties\" by declaring that: *the pretended power of suspending and dispensing with (i.e. ignoring) laws by royal authority without consent of Parliament is illegal; (meaning the king can not just invent new laws, they must be made by parliament) *the commission for ecclesiastical causes is illegal; levying taxes without grant of Parliament is illegal; *it is the right of the subjects to petition (ask something from) the king, and prosecutions (being arrested) for such petitioning are illegal; *keeping a standing army in time of peace, unless it be with consent of Parliament, is against law; *Protestants may have arms for their defence suitable to their conditions and as allowed by law; *election of members of Parliament ought to be free; *the freedom of speech and debates or proceedings in Parliament ought not to be impeached or questioned in any court or place outside of Parliament; *excessive bail ought not to be required, nor excessive fines imposed, nor cruel and unusual punishments made; *jurors in trials for high treason ought to be freeholders (own their own land); *promises of fines and forfeitures before conviction are illegal and void (saying what punishment a person will get before they are convicted is wrong); *for redress of all grievances, and for the adding to, strengthening, and preserving of the laws, Parliaments ought to be held frequently. The Act declared James's leaving England following the Glorious Revolution to be an abdication (giving up) of the throne. It listed twelve of James's policies, which James designed to \"endeavour to subvert and extirpate the protestant religion, and the laws and liberties of this kingdom.\" These were: *by assuming and exercising a power of dispensing with and suspending of laws and the execution of laws without consent of Parliament; *by prosecuting the Seven Bishops; *by establishing the court of commissioners for ecclesiastical (religious) causes; *by levying taxes for the use of the Crown by pretence of prerogative as if the same was granted by Parliament; *by raising and keeping a standing army within this kingdom in time of peace without consent of Parliament; *by causing Protestants to be disarmed at the same time when papists Roman Catholics were both armed and employed contrary to law; *by violating the freedom of election of members to serve in Parliament; *by prosecutions in the Court of King's Bench for matters and causes cognizable (knowable) only in Parliament, and by divers (diverse) other arbitrary and illegal courses; *by employing unqualified persons on juries in trials, and jurors in trials for high treason which were not freeholders; *by imposing excessive bail on persons committed in criminal cases against the laws made for the liberty of the subjects; *by imposing excessive fines and illegal and cruel punishments; *by making several grants and promises made of fines and forfeitures (taking away) before any conviction or judgment against the persons upon whom the same were to be levied; all of which were declared to be completely and directly contrary to the known laws and statutes and freedom of the realm. In a prelude to the Act of Settlement to come twelve years later, the Bill of Rights barred Roman Catholics from the throne of England as \"it hath been found by experience that it is inconsistent with the safety and welfare of this Protestant kingdom to be governed by a papist prince\"; thus William III and Mary II were named as the successors of James II and that the throne would pass from them first to Mary's heirs, then to her sister, Princess Anne of Denmark and her heirs (and, thereafter, to any heirs of William by a later marriage). == Notes == == References == * * * * Category:17th century in England Category:Monarchy of the United Kingdom Category:Acts of the Parliament of England Category:1689 Category:1680s in Europe",
 "title": "Bill of Rights 1689"
}