{
 "id": "236569",
 "text": ", also known as was a legendary empress of Japan.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 15-18; Varley, Paul. (1980). Jinnō Shōtōki, pp. 101-103. Although her name was once included in the traditional order of succession,Titsingh, p. 15. she is now considered as a regent.Keene, Donald. (1999). Seeds in the Heart: Japanese Literature from Earliest Times, p. 82 n36.; Bitō Masuhide. (1991). \"Thought and Religion, 1500-1700\" in The Cambridge History of Japan, p. 410; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider details about the life of Empress Jingū to be mythical;Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009. and the name Jingū- tennō was created for her posthumously by later generations. No certain dates can be assigned to this empress's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 30. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. == Traditional history == Jingū is almost certainly a legend; but the Kojiki and Nihonshoki record her name.Aston, William. (1998). Nihongi. Vol. 1, pp. 188-214. Jingū was the principle wife of Emperor Chūai. Her son would become known as Emperor Ōjin.Aston (1998), pp. 217-223. The Gukanshō mentions her, but she is not included on the list of persons born within the line of Imperial descent.Brown, Delmer et al. (1979) Gukanshō: The Future and the Past, p. 21 n5. == Events of Jingū's life == The limited information about Jingū does not imply that no such person ever existed. Very little information is available for study prior to the reign of the 29th monarch, Emperor Kimmei.Titsingh, pp. 34-36; Brown, pp. 261-262; Varley, pp. 123-124. After the death of Chūai, Jingū also served as regent, according to the oracle of Sumiyoshi-jinja, until her son was old enough to be emperor.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 15-18; Varley, Paul. (1980). Jinnō Shōtōki, pp. 101-103. === After her death === This empress' official name after her death (her posthumous name) was regularized many centuries after the lifetime which was ascribed to Jingū. According to the Imperial Household Agency, the empress's final resting place is in an earthen tumulus (kofun). Jingū is venerated at a memorial Shinto shrine (misasagi) at Nara.Saki no Tatanami no ike no e no Misasagi (Nara prefecture). * 1883: Empress Jingū was the first portrait and the first woman to be featured on the Japanese paper currency; however, the representation of Jingū which was created by Edoardo Chiossone is imagined.Empress Jingū note: \"History of Japanese Currency,\" Institute for Monetary and Economic Studies, Bank of Japan (IMES BOJ) . In the centuries before the Meiji period, Jingū was known as the 15th Japanese imperial ruler, according to the traditional order of succession. However, Jingū's name is now removed from the official list of emperors of Japan. Jingū's son, Emperor Ōjin, is today considered to have been the 15th emperor in the order of succession. ==Related pages== * Emperor of Japan * List of Emperors of Japan * Japanese Imperial family tree * Jingū Seamount * Japanese empresses * Sumiyoshi-jinja - a shine created by her == References == == Other websites == * Bank of Japan: Empress Jingū on bank note (1883) * Stamp library: Empress Jingū on 10-yen violet postage stamp (1924) * Stamp library: Empress Jingū on 10-yen green postage stamp (1924) Category:Emperors of Japan",
 "title": "Empress Jingū"
}