{
 "id": "236674",
 "text": "was the 21st emperor of Japan,Imperial Household Agency (Kunaichō), 雄略天皇 (21); retrieved 2011-10-16. according to the traditional order of successionTitsingh, Isaac. (1834). Annales des empereurs du japon, pp. 27-28; Varley, Paul. (1980). Jinnō Shōtōki, pp. 113-115; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider details about the life of Emperor Yūryaku to be possibly legendary, but probable.Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-16. The name Yūryaku-tennō was created for him posthumously by later generations. No certain dates can be assigned to this emperor's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 30. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. == Traditional history == According to the Kojiki and Nihonshoki, Yūryaku was the fifth and youngest son of Emperor Ingyō. He was the brother of Emperor Ankō.Nussbaum, Louis-Frédéric. (2005). \"Yūryaku Tennō\" in Japan Encyclopedia, p. 1068. Yūryaku was followed on the throne by his son, who would come to be known as Emperor Seinei. == Events of Yūryaku's life == Very little is known about the events of Yūryaku's life and rule. Only limited facts can be studied before the rule of the 29th monarch, Emperor Kimmei.Titsingh, pp. 34-36; Brown, pp. 261-262; Varley, pp. 123-124. After Ankō's death, Yūryaku overcame others in the struggle for power. He became the new emperor. Yūryaku is known as a patron of silk.Nippon Gakujutsu Shinkokai (1969). The Manyōshū, p. 317. It is said that he encouraged growing mulberry bushes for silkworms to eat. Poems that are said to be Yūryaku's are included in the Manyōshū. A number of his verses are kept in the Kojiki and the Nihonshoki. He is credited with bringing many artisans from Korea to Japan. === After his death === This emperor's official name after his death (his posthumous name) was regularized many centuries after the lifetime which was ascribed to Yūryaku.Aston (1998), pp. 146-147. According to the Imperial Household Agency, the emperor's final resting place is in an earthen tumulus (kofun). This emperor is venerated at a memorial Shinto shrine (misasagi) which is associated with the burial mound. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Yūryaku Seamount * Kofun period ==References== == Other websites == Category:Emperors of Japan",
 "title": "Emperor Yūryaku"
}