{
 "id": "236848",
 "text": "was the 22nd emperor of Japan,Imperial Household Agency (Kunaichō), 清寧天皇 (22); retrieved 2011-10-16. according to the traditional order of succession.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 28-29; Varley, Paul. (1980). Jinnō Shōtōki, pp. 115-116; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider details about the life of Emperor Seinei to be possibly legendary, but probable.Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-16. The name Seinei-tennō was created for him posthumously by later generations. No certain dates can be assigned to this emperor's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 30. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. == Traditional history == According to Kojiki and Nihonshoki, Seinei was a son of Emperor Yūryaku.Titsingh, p. 29. Seinei fathered no children. He adopted two grandsons of Emperor Richū. Each would attain the throne; and they would become known as Emperor Ninken and as Emperor KenzoAston, William. (1998). Nihongi, Vol. 1, pp. 373-377. == Events of Seinei's life == Very little is known about the events of Seinei's life and reign. Only limited information is available for study prior to the reign of the 29th monarch, Emperor Kimmei.Titsingh, pp. 34-36; Brown, pp. 261-262; Varley, pp. 123-124. After the death of his father, Seinei overcame others in the struggle for power. === After his death === This emperor's official name after his death (his posthumous name) was regularized many centuries after the lifetime which was ascribed to Seinei.Aston (1998), pp. 146-147. According to the Imperial Household Agency, the emperor's final resting place is in an earthen tumulus (kofun). This emperor is venerated at a memorial Shinto shrine (misasagi) which is associated with the burial mound. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Kofun period == References == Category:Emperors of Japan",
 "title": "Emperor Seinei"
}