{
 "id": "237070",
 "text": "Pokémon Black Version and White Version is two role-playing games (RPGs) in the Pokémon series made by Game Freak for the Nintendo DS. The games were released in Japan on September 18, 2010, on Europe on March 4, 2011, on North America on March 6, 2011, and in Australia on March 10, 2011. The games have 156 new Pokémon, which brings the total to 649. These games introduce the largest amount of Pokémon in any generation.And everybody 100% loves this game!:) ==Gameplay== Pokémon Black and White is so really fun! They are role- playing games where the player captures creatures called Pokémon. They can use them to battle against other Pokémon. One of the new features in the games are triple battles, which allows players to battle three Pokémon against three Pokémon. Alongside triple battles are Rotation Battles. Players still send out three Pokémon, but only one can battle at a time. The player can switch the position of their Pokémon during their turn. Also new is that the seasons change, and areas in the game have falling leaves in the fall, and snow in the winter.witch is fun! ==Plot== Pokémon Black and White take place in the Unova region, which is based on New York City and its surrounding area, unlike past games being based on regions of Japan. The plot of the game follows a new Pokémon trainer who is on a journey to become a Pokémon master. They do this by battling other trainers such as Gym Leaders, and finally the Elite Four. During this journey, the player meets an evil team known as Team Plasma, who look like knights. Team Plasma wants to make a new world where Pokémon are no longer owned by trainers. The player has numerous encounters with the king of the organization, a young man simply known as \"N\". Through those encounters, the player learns that N truly believes in separating Pokémon from their trainers (later proved in the sequels by the player being able to find the Pokémon that N has released during the events of the game in the wild). After the player beats all eight Gym Leaders in the region, they go to the Pokémon League. There, they challenge the Elite Four. After beating the Elite Four, the player goes to challenge the Champion of Unova, only to find that N had beat him. Suddenly, Team Plasma's castle rises from the dirt, surrounding the Pokémon League. The player goes in to find that N has summoned the Pokémon of (Ideals in Black Version (Zekrom) or Ideals in White Version (Reshiram)), before he has the player summon the other Pokémon. Once these Pokémon are summoned and N is defeated again, the leader of Team Plasma, Ghetsis, reveals that he used N for his own personal gain. The player beats Ghetsis, and the credits begin. ==References== ==Other websites== *Official Website *Official Website (Japanese) Category:2010 video games Black and White Category:Game Freak games Category:Nintendo DS games Category:Nintendo DS-only games Category:Nintendo Wi-Fi Connection games Category:Video game sequels Category:Video games developed in Japan",
 "title": "Pokémon Black and White"
}