{
 "id": "237068",
 "text": "The Allan Cup is the trophy awarded to the national senior amateur men’s ice hockey champions of Canada. The trophy was donated in 1908 by Sir H. Montagu Allan as a trophy for amateur teams, to replace the Stanley Cup, whose tournament had become a professional competition. ==Allan Cup championships== ===Challenges=== Only listed are the final champions of the season, some teams may have carried the Allan Cup through winning challenges halfway through these seasons, but finishing the season with the trophy is what counted. For those teams who did not finish the season with the cup, they can be viewed by looking at articles for the first few Allan Cups. {| cellpadding=\"1\" width=\"700px\" style=\"font-size: 90%; border: 1px solid gray;\" Allan Cup Challenge Series Allan Cup Challenge Series Allan Cup Challenge Series Allan Cup Challenge Series Allan Cup Challenge Series Year Final Champion Last Challenge Goal total Location 1909 Ottawa Cliffsides Awarded as IPAHU Champions 1909 Queen's University Ottawa Cliffsides 5-4 (1 gm) Ottawa, Ontario 1910 Toronto St. Michael's Majors Sherbrooke 8-3 (1 gm) Toronto, Ontario 1911 Winnipeg Victorias Kenora Thistles 16-10 (2 gms) Winnipeg, Manitoba 1912 Winnipeg Victorias Regina Capitals 9-3 (1 gm) Winnipeg, Manitoba 1913 Winnipeg Hockey Club Edmonton Eskimos 18-8 (2 gms) Winnipeg, Manitoba 1914 Regina Victorias Grand-Mère 10-5 (2 gms) Regina, Saskatchewan 1915 Winnipeg Monarchs Melville Millionaires 7-6 (2 gms) Melville, Saskatchewan 1916 Winnipeg 61st Battalion Regina Victorias 13-3 (2 gms) Winnipeg, Manitoba 1917 Toronto Dentals Winnipeg Victorias 13-12 (2 gms) Winnipeg, Manitoba 1918 Kitchener Greenshirts Winnipeg Ypres 6-4 (2 gms) Toronto, Ontario ===Playoffs=== {| cellpadding=\"1\" width=\"700px\" style=\"font-size: 90%; border: 1px solid gray;\" Allan Cup Final Series Allan Cup Final Series Allan Cup Final Series Allan Cup Final Series Allan Cup Final Series Year Eastern Finalist Western Finalist Series Primary Location 1919 Hamilton Tigers Winnipeg Selkirks 7-6 (gls) Toronto, Ontario 1920 University of Toronto Winnipeg Falcons 5-11 (gls) Toronto, Ontario 1921 University of Toronto Brandon 8-3 (gls) Winnipeg, Manitoba 1922 Toronto Granites Regina Victorias 13-2 (gls) Toronto, Ontario 1923 Toronto Granites University of Saskatchewan 11-2 (gls) Winnipeg, Manitoba 1924 Sault Ste. Marie Greyhounds Winnipeg Selkirks 6-3 (gls) Toronto, Ontario 1925 University of Toronto Port Arthur Bearcats 0-2 Winnipeg, Manitoba 1926 University of Toronto Port Arthur Bearcats 1-2-1 Toronto, Ontario* 1927 University of Toronto Grads Fort William Thundering Herd 2-1-1 Vancouver, British Columbia 1928 Montreal Victorias University of Manitoba Bisons 1-2 Ottawa, Ontario 1929 Montreal St-Francois Xavier Port Arthur Bearcats 0-2-1 Winnipeg, Manitoba 1930 Montreal Hockey Club Port Arthur Bearcats 2-0 Toronto, Ontario 1931 Hamilton Tigers Winnipeg Hockey Club 0-2 Winnipeg, Manitoba 1932 Toronto National Sea Fleas Fort William Blues 2-0 Montreal, Quebec 1933 Moncton Hawks Saskatoon Quakers 2-0 Vancouver, British Columbia 1934 Moncton Hawks Fort William Beavers 2-1 Toronto, Ontario 1935 Halifax Wolverines Port Arthur Bearcats 2-0 Halifax, Nova Scotia 1936 Sudbury Falcons Kimberley Dynamiters 0-2 Winnipeg, Manitoba 1937 Sudbury Tigers North Battleford Beavers 3-2 Calgary, Alberta 1938 Cornwall Flyers Trail Smoke Eaters 1-3 Calgary, Alberta 1939 Royal Montreal Hockey Club Port Arthur Bearcats 1-3 Montreal, Quebec 1940 Kirkland Lake Blue Devils Calgary Stampeders 3-0 Toronto, Ontario 1941 Sydney Millionaires Regina Rangers 2-3-1 Regina, Saskatchewan 1942 Ottawa RCAF Flyers Port Arthur Bearcats 3-2 Ottawa, Ontario* 1943 Ottawa Army Commandos Victoria Army 3-1 Calgary, Alberta* 1944 Quebec Aces Port Arthur Shipbuilders 3-0 Quebec City, Quebec 1944-45 Competition was Suspended due to World War II 1946 Hamilton Tigers Calgary Stampeders 1-4 Calgary, Alberta* 1947 Royal Montreal Hockey Club Calgary Stampeders 4-3 Montreal, Quebec* 1948 Ottawa Senators Edmonton Flyers 1-4 Edmonton, Alberta* 1949 Ottawa Senators Regina Capitals 4-1 Ottawa, Ontario* 1950 Toronto Marlboros Calgary Stampeders 4-1 Calgary, Alberta* 1951 Owen Sound Mercurys Fort Frances Canadians 4-3 Owen Sound, Ontario 1952 Stratford Indians Fort Frances Canadians 2-4 Fort Frances, Ontario 1953 Kitchener-Waterloo Flying Dutchmen Penticton V's 4-1 Kitchener, Ontario 1954 Sudbury Wolves Penticton V's 3-4 Penticton, British Columbia* 1955 Kitchener-Waterloo Flying Dutchmen Fort William Beavers 4-1 Kitchener, Ontario 1956 Chatham Maroons Vernon Canadians 1-4 Vernon, British Columbia* 1957 Whitby Dunlops Spokane Flyers 4-0 Toronto, Ontario 1958 Belleville McFarlands Kelowna Packers 4-3 Kelowna, British Columbia* 1959 Whitby Dunlops Vernon Canadians 4-0 Toronto, Ontario 1960 Chatham Maroons Trail Smoke Eaters 4-0-1 Trail, British Columbia 1961 Galt Terriers Winnipeg Maroons 4-1 Galt, Ontario 1962 Montreal Olympics Trail Smoke Eaters 1-4 Trail, British Columbia 1963 Windsor Bulldogs Winnipeg Maroons 4-1 Windsor, Ontario 1964 Woodstock Athletics Winnipeg Maroons 0-4 Winnipeg, Manitoba 1965 Sherbrooke Beavers Nelson Maple Leafs 4-0 Sherbrooke, Quebec 1966 Sherbrooke Beavers Drumheller Miners 2-4 Calgary, Alberta 1967 Drummondville Eagles Calgary Spurs 4-0 Drummondville, Quebec 1968 Victoriaville Tigres St. Boniface Mohawks 4-1 Winnipeg, Manitoba 1969 Galt Hornets Calgary Stampeders 4-0 Galt, Ontario 1970 Orillia Terriers Spokane Jets 2-4 Spokane, Washington 1971 Orillia Terriers Calgary Stampeders 4-0 Galt, Ontario 1972 Barrie Flyers Spokane Jets 2-4 Spokane, Washington* 1973 Orillia Terriers St. Boniface Mohawks 4-1 Orillia, Ontario 1974 Barrie Flyers Cranbrook Royals 4-2 Cranbrook, British Columbia 1975 Barrie Flyers Thunder Bay Twins 2-4 Thunder Bay, Ontario 1976 Barrie Flyers Spokane Flyers 0-4 Spokane, Washington 1977 Brantford Alexanders Spokane Flyers 4-1 Brantford, Ontario 1978 Brantford Alexanders Kimberley Dynamiters 1-4 Kimberley, British Columbia 1979 Petrolia Squires Steinbach Huskies 4-1 Sarnia, Ontario 1980 Cambridge Hornets Spokane Flyers 0-4 Spokane, Washington 1981 Allan Cup was a Round Robin 1982 Petrolia Squires Cranbrook Royals 1-4 Cranbrook, British Columbia 1983 Cambridge Hornets St. Boniface Mohawks 4-0 Cambridge, Ontario 1984 Cambridge Hornets Thunder Bay Twins 1-4 Thunder Bay, Ontario 1985 Corner Brook Royals Thunder Bay Twins 3-4 Corner Brook, Newfoundland 1986 Corner Brook Royals Nelson Maple Leafs 4-0 Nelson, British Columbia 1987 Brantford Motts Clamatos Nelson Maple Leafs 4-0 Brampton, Ontario 1988 Charlottetown Islanders Thunder Bay Twins 0-4 Thunder Bay, Ontario 1989 Allan Cup was a Round Robin 1990 Montreal-Chomedy Construction Abbotsford Flyers 4-2 Vaudreuil, Quebec 1991 Charlottetown Islanders Thunder Bay Twins 4-0 Thunder Bay, Ontario {*} denotes event held in multiple locations. Applicable locations are listed on the event's specific article. ===Round Robins=== {| cellpadding=\"1\" width=\"700px\" style=\"font-size: 90%; border: 1px solid gray;\" Allan Cup Round Robins Allan Cup Round Robins Allan Cup Round Robins Allan Cup Round Robins Allan Cup Round Robins Year Champion Runner-Up Final Score Location 1981 Petrolia Squires St. Boniface Mohawks 5-1 Thunder Bay, Ontario Allan Cups 1982 through 1988 were playoffs 1989 Thunder Bay Twins St. Boniface Mohawks 2-0 (Best-of-3) Thunder Bay, Ontario Allan Cups 1990 and 1991 were playoffs 1992 Saint John Vito's Stony Plain Eagles 6-2 Saint John, New Brunswick 1993 Whitehorse Huskies Quesnel Kangeroos 7-4 Quesnel, British Columbia 1994 Warroad Lakers St. Boniface Mohawks 5-2 Warroad, Minnesota 1995 Warroad Lakers Stony Plain Eagles 3-2 Stony Plain, Alberta 1996 Warroad Lakers Stony Plain Eagles 6-1 Unity, Saskatchewan 1997 Powell River Regals Warroad Lakers 7-3 Powell River, British Columbia 1998 Truro Bearcats London Admirals 6-1 Truro, Nova Scotia 1999 Stony Plain Eagles Powell River Regals 6-3 Stony Plain, Alberta 2000 Powell River Regals Lloydminster Border Kings 4-1 / Lloydminster, Sask/Alta 2001 Lloydminster Border Kings Petrolia Squires 7-2 Sarnia, Ontario 2002 St-Georges Garaga Stony Plain Eagles 4-2 Powell River, British Columbia 2003 Ile des Chenes North Stars Stony Plain Eagles 3-2 (2OT) Dundas, Ontario 2004 St- Georges Garaga Ministikwan Islanders 5-0 Saint-Georges, Quebec 2005 Thunder Bay Bombers Montmagny Sentinelles 4-3 / Lloydminster, Sask/Alta 2006 Powell River Regals Whitby Dunlops 7-1 Powell River, British Columbia 2007 Lloydminster Border Kings Whitby Dunlops 4-3 Stony Plain, Alberta 2008 Brantford Blast Bentley Generals 3-1 Brantford, Ontario 2009 Bentley Generals Southeast Prairie Thunder 4-3 (2OT) Steinbach, Manitoba 2010 Fort St. John Flyers Bentley Generals 4-1 Fort St. John, British Columbia 2011 Clarenville Caribous Bentley Generals 5-3 Kenora, Ontario 2012 South East Prairie Thunder Bentley Generals 4-1 Lloydminster, Saskatchewan 2013 Bentley Generals Clarenville Caribous 3-0 Red Deer, Alberta 2014 Dundas Real McCoys Clarenville Caribous 3-2 (2OT) Dundas, Ontario 2015 South East Prairie Thunder Bentley Generals 2-0 Clarenville, Newfoundland and Labrador 2016 Bentley Generals Southeast Prairie Thunder 4-3 (OT) Steinbach, Manitoba 2017 Grand Falls- Windsor Cataracts Lacombe Generals 7-4 Bouctouche, New Brunswick 2018 Stoney Creek Generals Lacombe Generals 7-4 Rosetown, Saskatchewan 2019 Lacombe Generals Innisfail Eagles 5-2 Lacombe, Alberta 2020 cancelled because of COVID-19 pandemic Hamilton, Ontario 2021 cancelled because of COVID-19 pandemic Hamilton, Ontario 2022 cancelled because of COVID-19 pandemic Hamilton, Ontario 2023 Dundas Real McCoys Clarenville Caribous 5-3 Dundas, Ontario ==Most Championships by Province== {| cellpadding=\"1\" width=\"350px\" style=\"font-size: 90%; border: 1px solid gray;\" Allan Cups by Province/State Allan Cups by Province/State Allan Cups by Province/State Allan Cups by Province/State Allan Cups by Province/State Rank Region Championships 1 Ontario 50 2 Manitoba 12 3 British Columbia 11 4 Quebec 9 5 Alberta 8* 6 Saskatchewan 4* \\- Washington 4 8 Minnesota 3 \\- New Brunswick 3 10 Newfoundland and Labrador 3 \\- Nova Scotia] 2 11 Prince Edward Island 1 \\- Yukon 1 (*) Saskatchewan totals include championships won by teams from Lloydminster. ==References== == Other websites == * Allan Cup website * Allan Cup results Category:1909 establishments in Canada Category:Ice hockey trophies and awards",
 "title": "Allan Cup"
}