{
 "id": "237085",
 "text": "Karl Ernst Adolf Anderssen (Breslau, 6 July 1818 – Breslau, 13 March 1879) was a German chess master, and a teacher of mathematics. He was recognised as the best player in the world for much of the time between 1851 and 1870. Anderssen won three great international tournaments: the first in London 1851, then London 1862 and Baden-Baden 1870. Anderssen lost matches in 1858 to Paul Morphy and, narrowly, to Steinitz in 1866. He was also a chess problem composer.Hooper, David and Whyld, Kenneth 1992. The Oxford companion to chess 2nd ed, Oxford University Press. .p16 Anderssen became the most successful tournament player in Europe, winning over half the events he entered—including the Baden-Baden 1870 tournament, which is comparable to modern strong GM tournaments. His last success was at Leipzig in 1877 where he came second equal with Zukertort, behind Paulsen. He was then nearly 60. He is still famous for his brilliant sacrificial attacking play, particularly in the 'Immortal Game' (1851) and the 'Evergreen Game' (1852). He was also one of the most likeable of chess masters and became an elder statesman of the game, to whom others turned for advice or arbitration. == His status == Anderssen was never world champion because \"there was as yet no concept of a formal championship, or of the means by which one might be awarded... The world championship proper was the creation of Wilhelm Steinitz (18361900)... The first match for the world championship was in 1886\"... Eales, Richard 1985. Chess: the history of a game. London: Batsford, p143, 152 Also: \"Wilhelm Steinitz... was the first person to use the title of Champion of the world...\".Murray H.J.R. 1910. The history of chess. Oxford: Oxford University Press, p889. == Mathematician == Anderssen was a teacher of mathematics in Breslau (now Wroclaw). He became a professor in about 1862, and in January 1865 was awarded honorary degrees of PhD and MA. These honours were not for chess, but not much is known about the teaching part of his career. == Games == *Adolf Anderssen vs Jean Dufresne, Berlin 1852, Giuoco Piano: Evans Gambit (C52), 1-0 The \"Evergreen Game\" – a short game full of sacrifices and ending with a checkmate *Adolf Anderssen vs Paul Morphy match, Paris 1858, English opening by transposition. Anderssen beats Morphy in a long struggle. *Gottschall, Hermann von 1912 (reprint 2006). Adolf Anderssen, der Altmeister deutscher Schachspielkunst. Elibron Classics. . 748 games. *Bachmann, Ludwig 1914. Schachmeister Anderssen. Anspach. == References == Category:1818 births Category:1879 deaths Category:German chess players Category:German mathematicians Category:People from former German territories Category:Academics of the University of Wrocław",
 "title": "Adolf Anderssen"
}