{
 "id": "237108",
 "text": "The M1 Abrams is a modern main battle tank used by the United States. It is also exported to many countries. It is a well armed, well protected, and fast tank designed for modern armored ground warfare.M1 Abrams Main Battle tank. FAS.org, 14 April 2000 Notable features of the M1 Abrams include the use of a powerful engine, layered armor, and a low profile. It is one of the heaviest tanks in service(use), weighing almost 70 short tons. The M1 Abrams entered U.S. service in 1980, replacing the M60 Patton.Hunnicutt 1984, pp. 6, 149, 408. Three main versions of the M1 Abrams have been used, the M1, M1A1, and M1A2, incorporating improved armament, protection and electronics. These improvements, as well as periodic upgrades to older tanks have allowed this long-serving vehicle to remain in front-line service. The M1A3 is currently under development. It is the principal (main) main battle tank of the United States Army and Marine Corps, and the armies of Egypt, Kuwait, Saudi Arabia, Australia, and in 2010 Iraq. == Notes == == References == * King of the Killing Zone by Orr Kelly, 1989. W.W. Norton Company. * Rostker, Bernard: Environmental Exposure Report:Depleted Uranium in the Gulf. DoD Publication, 1998. . * United States General Accounting Office:Operation Desert Storm: Early Performance Assessment of Bradley and Abrams. Washington, January 1992.PDF . * Halberstadt, Hans. Desert Storm Ground War. Osceola, WI, Motorbooks International, 1991. 128 pp. * * Hunnicutt, R. P. \"Patton: A History of the American Main Battle Tank.\" 1984, Presidio Press; . * Forty, George: Tank Action. From the Great War to the Gulf, Allan Sutton Publishing Ltd., Phoenix Mill 1995. * Zaloga Steven J., & Sarson, Peter: M1 Abrams Main Battle Tank 1982-1992. Osprey Military, New Vanguard. Reed International Books Ltd, 1993. * * * Army Times - Two soldiers die in attack on Abrams tank, October 29, 2003 * DoD News: DoD Identifies Army Casualty - Dec 25, 2005 attack * DoD News: DoD Identifies Army Casualties - June 04, 2006 incident == Other websites == * Abrams U.S. Army Fact File * Official Abrams page on General Dynamics Land Systems site * M1A1/M1A2 Abrams Main Battle Tank on Army-Technology.com * M1A1/2 Abrams page on the Armor Site * Main Battle Tank M1A1 Abrams on Enemyforces.com * Anatomy of an M1 Abrams on military.discovery.com * M1 Abrams page, with a detailed overview of how the tank works on howstuffworks.com * M-1 Tank Urban Survivability Kit (TUSK) , M1A1 AIM Upgrade , and M1A2 SEP Upgrade on Defense-Update.com * M1 Abrams Main Battle Tank page on GlobalSecurity.com * AGT1500 Tubine Technology on Honeywell.com * http://www.defenseindustrydaily.com/M1-Abrams-Tanks-for- Iraq-05013/ Category:Tanks",
 "title": "M1 Abrams"
}