{
 "id": "237151",
 "text": ", also known as Keitai okimi, was the 26th emperor of Japan,Imperial Household Agency (Kunaichō), 継体天皇 (26); retrieved 2011-10-18. according to the traditional order of succession.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 31-33; Varley, Paul. (1980). Jinnō Shōtōki, pp. 119-120; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider details about the life of Emperor Keitai to be possibly legendary, but probable.Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-18. The name Keitai-tennō was created for him posthumously by later generations. No certain dates can be assigned to this emperor's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 30. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. Some modern reference works of history call Keitai the King Ohoto of Koshi.Aston, William. (1998). Nihongi, Vol. 2, pp. 1-25. Koshi was a small regional entity in what would become Koshi Province in northern Japan. == Traditional history == According to the Kojiki and Nihon Shoki, Ketai was a fifth generation grandson of Emperor Ōjin. When Emperor Buretsu died without a successor, Ketai attained the throne. There was a period of disputes over the succession after Keitai's death. One branch of the Yamato clan supported sons who would become Emperor Ankan and Emperor Senka. Another branch supported the third son who would become known as Emperor Kimmei.Hall, John Whitney. The Cambridge history of Japan: Ancient Japan, Vol. I., p. 154. == Events of Keitai's life == Very little is known about the events of Keitai's life and reign. Only limited information is available for study prior to the reign of the 29th monarch, Emperor Kimmei.Titsingh, pp. 34-36; Brown, Delmer et al. (1979). Gukanshō: The Future and the Past, pp. 261-262; Varley, pp. 123-124. Keitai confronted rebellion in Kyūshū, which was then known as the . The emperor sent forces to calm the unrest. It is not known how long Keitai lived after his abdication. Keitai abdicated in his favor of his eldest son who would become known as Ankan.Titsingh, p. 33; Varley, p. 120 . Ankan died four years later, and Keitai's next oldest son would attain the throne. This son would come to be known as Emperor Senka.Titsingh, pp. 33-34; Varley, pp. 121-122. Senka died after three years as emperor; and the throne would be vacant. The third son of Ketai would attained the throne, and he would become known as Emperor Kemmei. === After his death === This emperor's official name after his death (his posthumous name) was regularized many centuries after the lifetime which was ascribed to Keitai.Aston (1998), pp. 146-147. According to the Imperial Household Agency, the emperor's final resting place is in an earthen tumulus (kofun). Keitai is venerated at a memorial Shinto shrine (misasagi) which is associated with the burial mound. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Kofun period == References == ==Other websites== Category:Emperors of Japan",
 "title": "Emperor Keitai"
}