{
 "id": "237197",
 "text": "Arthur Friedenreich (18 July 1892 – 6 September 1969) was a Brazilian professional footballer who played as a forward. He was nicknamed The Tiger or The Original \"Black\" Pearl, and was arguably the sport's first outstanding mixed-race player. He played when Brazilian football was still amateur, which lasted until 1933. He is occasionally identified as one of the all-time top scorers in football history, although this is highly disputed. Friedenreich was often said to be the pioneer of 'jogo bonito' or 'the beautiful game', a style frequently associated with Brazilian football. The style involved playing very quickly with short passes as well as quick touches and combinations. It also relied on taking many long shots and attacking with 2-3 pacy strikers to disorient the defence. Despite being a short player (5 ft 7 in) he was known for his pace, power, and brilliant technical dribbling. Considered as one of the greatest Brazilian strikers of all time during the 1910s and 1920s. ==Career== ===Early career=== He started his career influenced by his father, playing for SC Germânia, a Brazilian football team composed of German immigrants. After playing with a succession of São Paulo club sides from 1910 onwards, Friedenreich made his debut with the national team in 1914 which was the first ever game Brazil played beating Exeter City 2-0. In the game, Friedenreich famously lost two of his front teeth due to a heavy slide tackle. He played twenty-two internationals, including wins in the 1919 and 1922 editions of the South American Championship, scoring ten goals. During the 1919 edition he became the first ever football player to score a hat-trick in a major international tournament. On Brazil's 1925 tour of Europe, he was feted as the King of Football. He was also the top scorer in the Sao Paulo League in 1912, 1914, 1917, 1918, 1919, 1921, 1927 and 1929. Friedenreich was very young when he developed his own style of play and was 17 when he first became a part of an elite club. After that, Friedenreich bounced around from club to club until he found a long lasting home with CA Paulistano, a top Brazilian club. Friedenreich played for the club CA Paulistano for 12 years before the club disbanded. He then joined the club São Paulo da Floresta. ===Later playing career=== He wasn't picked by Brazil for the 1930 FIFA World Cup because there was a serious misunderstanding between the football Leagues of the States of Rio de Janeiro and São Paulo; only players from Rio travelled. São Paulo stars, like him (who was 38 years old), Filó (who was 1934 FIFA World Cup champion with Italy) and Feitiço, did not go to Uruguay. He continued to grow older and play for less and less elite clubs. After 1934 he only played locally and competed in those clubs. The last team he played for before his retirement very late in his career in the year 1936, was the Flamengo team from Rio de Janeiro ==After football== In the 1930s, Brazilian football was beginning the process of professionalization, and in 1933 it became reality. Friedenreich was against the professionalization of football in the country. Outraged, he refused to continue playing football, and retired playing for Flamengo at 43 years old. His last match was against Fluminense on 21 July 1935 (the game ended in a 2–2 draw; he didn't score that day). He then started working in a liquor company and retired while there. When he retired Arthur got Alzheimer's disease and the treatment took most of his money while trying to treat this disorder. Arthur would end up losing most if not all of his money to this disease. He lived in a house ceded by São Paulo football club until he died on 6 September 1969 at 77 years old. ===Posthumous tributes=== There is a park in the Vila Alpina neighborhood, on the east side of São Paulo, with his name. The park, located at the beginning of Francisco Falconi avenue, is one of the biggest of the region. Still on the east side of São Paulo, there is a street with his name. In Rio de Janeiro, there is a school with his name, located within the sports complex of Maracanã, near the main entrance, on the left of Bellini statue. ===Personal life=== Friedenreich was born in São Paulo to Oscar Friedenreich, a German businessman whose father immigrated to Brazil, and Mathilde, a Black Brazilian washerwoman and the daughter of freed slaves. Friedenreich was the first professional football player of Afro-Brazilian origin, because at that time football was dominated by Whites, and Blacks were not accepted. He faced many barriers because of racism, and he could not attend the same places where white players were, such as swimming pools, tennis courts and parties. Also Friedenreich found it hard to make connections and friends in the world of Brazilian football due to the color of his skin. Friedenreich played football from his early childhood and then on. His father was very supportive of his skills and really helped him on his path to the great player he became. At some point in his life he married his wife named Jonas and together they had a son who they named after Friedenreich's father, Oscar. Both outlived Friedenreich and were left with no money. ==Honours== ===Club=== *Campeonato Paulista: 1918, 1919, 1921, 1926, 1927, 1929, 1931 ===International=== *South American Championship: 1919, 1922 *Roca Cup: 1914 ===Individual=== *South American Championship player of the tournament: 1919 *South American Championship top scorer: 1919 *IFFHS Brazilian Player of the 20th Century (5th place) *IFFHS South American Player of the 20th Century (13th place) ==References== ==Other websites== *Information about Friedenreich Category:1892 births Category:1969 deaths Category:Footballers from São Paulo",
 "title": "Arthur Friedenreich"
}