{
 "id": "237489",
 "text": "was the 31st emperor of Japan,Imperial Household Agency (Kunaichō), 用明天皇 (31); retrieved 2011-10-18. according to the traditional order of succession.Brown, Delmer. (1979). Gukanshō, p. 263; Varley, H. Paul. (1980). Jinnō Shōtōki. pp. 125-126; Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 37-38. The years of the reign of Yōmei start in 585 and end in 587.Nussbaum, Louis- Frédéric. (2002). \"Traditional order of Tennō\" at pp. 962-963. The names and sequence of the early emperors were not confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, p. 109 n1. ==Traditional history== Historians consider details about the life of Emperor Yōmei to be possibly legendary, but probable.Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2013-1-31. The name Yōmei-tennō was created for him posthumously by later generations. Emperor Yōmei was the fourth son of Emperor Kimmei. His mother, Soga no Kitashihime, was a daughter of Soga no Iname.Brown, Gukanshō, p. 263; Varley, p. 125. His palace in Yamato Province was called Namitsuki no Miya at Ikebe.Brown, Gukanshō, p. 263. Yōmei had three Empresses and seven Imperial sons and daughters. Yōmei's son, Prince Umayado, is also known as Prince Shōtoku.Varley, pp.125-129. ==Events of Yōmei's life== * 586: In the 14th year of Bidatsu's reign, the emperor died. The succession (senso) received by Bidatsu's younger brother who would become Emperor Yōmei.Brown, p. 263; Varley, p. 44; Titsingh, p. 37. This was confirmed in ceremonies.Varley, p. 44; compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-19. * 587, in the 4th month: Yōmei died and his body was placed in a coffin, but not buried. His reign lasted only two years. He died at the age of 69.Varley, p. 126. * 587, in the 5th month: There was armed conflict over the succession; and forces led by Prince Shōtoku and Soga no Umako overcame the opposition. The throne passed to a younger brother who would become known as Emperor Shushun.Brown, pp. 262-263. * 587, in the 7th month: The body of former Emperor Yōmei was buried. === After his death === According to the Imperial Household Agency, the emperor's final resting place is in an earthen tumulus (kofun). Yōmei is venerated at a memorial Shinto shrine (misasagi) which is associated with the burial mound. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Yōmei Seamount == References == ==Other websites== Category:518 births Category:587 deaths Category:Emperors of Japan",
 "title": "Emperor Yōmei"
}