{
 "id": "237857",
 "text": "The 2009–10 NHL season was the 92nd season of the National Hockey League (NHL) and the 100th season since the founding of the predecessor National Hockey Association (NHA). It ran from October 1, 2009, including four games in Europe on October 2 and 3—until April 11, 2010, with the 2010 Stanley Cup playoffs currently being played, all the way up to early June 2010. A mid-season break from February 15 to 28 occurred to allow participation of NHL players in the 2010 Winter Olympics in Vancouver. Because of the Winter Olympics break, there was no NHL All-Star Game for 2010. == Regular season == === Final standings === ==== Eastern Conference ==== ==== Western Conference ==== ==== Conference standings ==== ==== Tiebreaking procedures ==== Teams are ranked (ordered by how many games they won) at the end of the regular season. The team with the most points is ranked number one. If two or more teams are tied in points, the following method is used to rank the teams: * The fewer number of games played. This would mean that a team scored more points per game than another team. * The greater number of games won. * The greater number of points earned in games between the tied clubs. This would be the team that was better than the other team when they played against each other. ** If two teams are tied, and they have not played the same number of home games against the other, then: *** The points earned in the first home game played by the team with more home games do not count. ** If more than two clubs are tied, then: *** The team with the most points earned per game in games among those clubs. *** The \"odd\" games between those teams do not count. * The team with the biggest differential between goals for and against for the entire regular season. This would be the team that won their games by the most goals. === Statistical leaders === ==== Scoring leaders ==== The following players led the league in points at the conclusion of the regular season. GP = Games played; G = Goals; A = Assists; Pts = Points; +/– = Plus/minus; PIM = Penalty minutes Player Team GP G A Pts +/– PIM Vancouver Canucks 82 29 83 112 +35 48 Pittsburgh Penguins 81 51 58 109 +15 69 Washington Capitals 72 50 59 109 +45 89 Washington Capitals 82 33 68 101 +37 50 Tampa Bay Lightning 82 51 44 95 -2 38 Tampa Bay Lightning 82 29 65 94 -8 12 Dallas Stars 80 24 67 91 -12 14 San Jose Sharks 79 20 69 89 +17 54 Chicago Blackhawks 82 30 58 88 +16 20 New York Rangers 76 42 44 86 +15 37 ==== Leading goaltenders ==== The following goaltenders led the league in goals against average at the end of the regular season. GP = Games played; TOI = Time on ice (minutes); W = Wins; L = Losses; OT = Overtime/shootout losses; GA = Goals against; SO = Shutouts; SV% = Save percentage; GAA = Goals against average Player Team GP TOI W L OT GA SO SV% GAA Boston Bruins 45 2,562:11 22 12 5 84 5 .931 1.97 Buffalo Sabres 69 4,047:10 41 18 8 150 5 .929 2.22 New Jersey Devils 77 4,499:01 45 25 6 168 9 .916 2.24 Chicago Blackhawks 39 2,190:28 26 7 4 82 7 .912 2.25 Detroit Red Wings 63 3,740:15 37 15 10 141 3 .924 2.26 Phoenix Coyotes 69 4,084:27 42 20 6 156 8 .920 2.29 Calgary Flames 73 4,235:19 35 28 10 163 4 .920 2.31 New York Rangers 73 4,203:49 35 27 10 167 4 .921 2.38 Montreal Canadiens 45 2,629:56 26 13 5 105 5 .924 2.40 San Jose Sharks 71 4,194:07 44 16 10 170 3 .922 2.43 == Playoffs == === Playoff seeds === After the regular season, the standard of 16 teams qualified for the playoffs. The Washington Capitals won the Presidents' Trophy for having the best record in the league, at 121 points. Division champions maintain their relative ranking during the entire playoffs while the remaining teams get reseeded below them after each round. ==== Eastern Conference ==== # Washington Capitals – Southeast Division and Eastern Conference regular season champions; President's Trophy winners 121 points # New Jersey Devils – Atlantic Division champions, 103 points # Buffalo Sabres – Northeast Division champions, 100 points # Pittsburgh Penguins – 101 points (47 wins) # Ottawa Senators – 94 points (44 wins) # Boston Bruins – 91 points (39 wins) # Philadelphia Flyers – 88 points (41 wins) # Montreal Canadiens – 88 points (39 wins) ==== Western Conference ==== # San Jose Sharks – Pacific Division champions and Western Conference regular season champions, 113 points # Chicago Blackhawks – Central Division champions, 112 points # Vancouver Canucks – Northwest Division champions, 103 points # Phoenix Coyotes – 107 points (50 wins) # Detroit Red Wings – 102 points (44 wins) # Los Angeles Kings – 101 points (46 wins) # Nashville Predators – 100 points (47 wins) # Colorado Avalanche – 95 points (43 wins) === Playoff bracket === == NHL awards == 2009–10 NHL awards Award Recipient(s) Stanley Cup Chicago Blackhawks Presidents' Trophy Washington Capitals Prince of Wales Trophy Philadelphia Flyers Clarence S. Campbell Bowl Chicago Blackhawks Art Ross Trophy Henrik Sedin (Vancouver Canucks) Bill Masterton Memorial Trophy Jose Theodore (Washington Capitals) Calder Memorial Trophy Tyler Myers (Buffalo Sabres) Conn Smythe Trophy Jonathan Toews (Chicago Blackhawks) Frank J. Selke Trophy Pavel Datsyuk (Detroit Red Wings) Hart Memorial Trophy Henrik Sedin (Vancouver Canucks) Jack Adams Award Dave Tippett (Phoenix Coyotes) James Norris Memorial Trophy Duncan Keith (Chicago Blackhawks) King Clancy Memorial Trophy Shane Doan (Phoenix Coyotes) Lady Byng Memorial Trophy Martin St. Louis (Tampa Bay Lightning) Ted Lindsay Award Alexander Ovechkin (Washington Capitals) Maurice 'Rocket' Richard Trophy Sidney Crosby (Pittsburgh Penguins) Steven Stamkos (Tampa Bay Lightning) NHL General Manager of the Year Award Don Maloney (Phoenix Coyotes) NHL Plus/Minus Award Jeff Schultz (Washington Capitals) Roger Crozier Saving Grace Award Tuukka Rask (Boston Bruins) Vezina Trophy Ryan Miller (Buffalo Sabres) William M. Jennings Trophy Martin Brodeur (New Jersey Devils) Lester Patrick Trophy Dave Andrews, Cam Neely, Jack Parker, Jerry York == Milestones == === First games === The following is a list of players of note who played their first NHL game in 2009–10, listed with their first team: * John Tavares, New York Islanders * Matt Duchene, Colorado Avalanche * Tyler Myers, Buffalo Sabres * Tyler Bozak, Toronto Maple Leafs === Last games === * Keith Tkachuk, St. Louis Blues == References == == Other websites == * NHL.com * 2009–10 NHL season at Hockey Reference * 2009–10 NHL season at ESPN * Hockey Database Category:National Hockey League seasons",
 "title": "2009–10 NHL season"
}