{
 "id": "239021",
 "text": "Lincoln Park Zoo is a free zoo. It is in Lincoln Park neighborhood in Chicago, Illinois. The zoo was founded in 1868. This was when the Lincoln Park Commissioners were given a gift of 2 pair of swans. In 1874, the swans were joined by a bear cub. This was the first animal bought for the zoo. The bear became quite good at escaping from its home. It could often be found wandering around Lincoln Park at night. The first bison ever born in captivity was born in Lincoln Park. Marlin Perkins, who later gained fame as the host of the television program Wild Kingdom, was director of the zoo from 1944 until 1962. Now, Lincoln Park Zoo is home to a wide variety of animals. The zoo includes polar bears, penguins, gorillas, reptiles, monkeys, and other species totalling nearly 1,250 animals. Also located in Lincoln Park Zoo is a burr oak tree which dates to 1830, three years before the city was founded. Lincoln Park Zoo is one of four zoos in the Chicago area, the others being the large Brookfield Zoo, and the minor Phillips Park Zoo, and Cosley Zoo. Lincoln Park Zoo is the only one within the Chicago city limits. Two sections of Lincoln Park Zoo have been set aside for children. The first is the Pritzker Family Children's Zoo. The Children's Zoo contains an indoor structure for children to play in. People used to be able to pet animals at the Children's Zoo, but in recent years, due to health concerns, Lincoln Park Zoo has stopped this at the Children's Zoo. Also, baby animals who are rejected by their parents are no longer kept in the Children's Zoo because the zoo has found that it is harder to reintroduce them into their habitats once they grow up if they are kept away from their own species. The second area of the zoo for children in the Farm-in-the-Zoo, presented by John Deere. This small farm contains pigs, cows, horses and other animals which can be found on farms. Children can feed and pet the animals. In addition, the cows are milked in public for children to see. Regenstein Center for African Apes is home to Keo, the oldest male chimpanzee in a North American zoo. Near the southern end of Lincoln Park Zoo, one can rent a paddle boat for a spin around the Lincoln Park Lagoon. The Lagoon is surrounded by trees and offers a relaxing time (and, of course, paddling exercise). Kayakers and canoers also take to the lagoon and one can often see scullers as well. ==List of animal houses and locations== * Antelope and Zebra Area * Blum-Kovler Penguin/Seabird House: Chinstrap penguins, common murres, king penguins, razorbills, southern rockhopper penguins, and tufted puffins. * Helen V. Brach Primate House: Allen's swamp monkeys, black howler monkeys, black-and-white colobus monkeys, Bolivian gray titi monkeys, De Brazza's monkeys, Francois langurs, Geoffrey's marmosets, Goldi's marmosets, pied tamarins, and white-cheeked gibbons. * Farm-in-the-Zoo (presented by John Deere) * Kovler Lion House: African lions, Amur leopards, Amur tigers, Eurasian lynxes, jaguars, Pallas' cats, cougars, red pandas, servals, and snow leopards. * Kovler Sea Lion Pool: Grey seals * McCormick Bird House: * Hope B. McCormick Swan Pond: Hooded mergansers, northern pintails, ruddy ducks, and trumpeter swans. * Robert R. McCormick Bear Habitat: Malayan sun bears, polar bears, and spectacled bears. * Pritzker Family Children's Zoo: American black bears, American kestrels, American toads, Blanding's turtles, eastern box turtles, eastern screech owls, midland painted turtles, mudpuppies, North American beavers, North American river otters, red wolves, smooth green snakes, spotted turtles, wood ducks, and wood turtles. * Regenstein African Journey: Aardvarks, * Regenstein Birds of Prey Exhibit: Bald eagles, black vultures, white storks, and snowy owls. * Regenstein Center for African Apes: chimpanzees and western lowland gorillas. * Regenstein Small Mammal/Reptile House ==References== ==Other websites== *Lincoln Park Zoo official website Category:1868 establishments in the United States Category:Zoos in Illinois Category:Buildings and structures in Chicago Category:1860s establishments in Illinois",
 "title": "Lincoln Park Zoo"
}