{
 "id": "239340",
 "text": "Finidi George (born 15 April 1971) is a former Nigerian football player. He has played for Nigeria national team. He was a player with great speed who could play as a winger on the right or left. He was a physically strong and tall player, He was known for his dribbling and free-kicks. He is known by his name, Finidi. Considered as one of Nigeria's greatest wingers of all time. ==Club career== After playing for three different clubs in his home country, Finidi George joined Ajax club together with Nwankwo Kanu in 1993. During this period, Ajax's Eredivisie championship also contributed to the UEFA Champions League championship against Milan in the 1994-1995 season. In 1996, Finidi went to Spain and signed a contract with Real Betis. Although Finidi had previously held talks with Real Madrid, nothing came of them. He always scored double-digit goals during his years at Real Betis, and helped the club finish the league in fourth place in his first year at Real Betis. In the same year, the Andalusian team reached the final of the Copa del Rey, but although Finidi scored a goal, the cup was lost to Barcelona. Finidi was transferred to RCD Mallorca in 2000. The following year, he moved from Spain to England and signed for Ipswich Town FC, one of the Premier League teams. However, his career here was not very bright and his contract was terminated in June 2003. Finidi re-signed for his former team Mallorca in November 2003. That season, Mallorca finished the league in 11th place. In the summer of 2004, he ended his active football career. Finidi returned to Real Betis as Director of International Football in November 2010. ==International career== Finidi started to take part in the Nigerian national team in 1991. He made three assists to Rashidi Yekini in the 7-1 win against Burkina Faso in the African Cup of Nations qualifiers. He was again part of the team when they won the African Cup of Nations championship in Tunisia in 1994 . In subsequent tournaments, Nigeria, including Finidi, came second once and third twice. Finidi participates in the FIFA World Cup twice with Nigeria. In the 1994 FIFA World Cup held in the USA , Nigeria reached the second round as the group winner, but lost to Italy, one of the finalists. Finidi scored a goal in the 2-0 cup match against Greece and celebrated his goal as a peeing dog. In the 1998 cup in France , Nigeria was eliminated again in the second round, this time by Denmark, and Finidi played in all the matches. Finidi left the Nigeria jersey in 2002, which he wore 62 times, scoring 6 goals. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Ajax 1993–94 Eredivisie 27 4 – 4 0 – 31 4 1994–95 30 8 – 10 1 1 0 41 9 1995–96 29 6 – 12 2 2 0 43 8 Total 86 18 – 26 3 3 0 115 21 Real Betis 1996–97 La Liga 36 10 6 1 – – 42 11 1997–98 34 9 4 2 5 1 – 43 12 1998–99 36 11 1 0 6 2 – 43 13 1999–2000 24 8 – – – 24 8 Total 130 38 11 3 11 3 – 152 44 Mallorca 2000–01 La Liga 31 5 4 2 – – 35 7 Ipswich Town 2001–02 Premier League 25 6 – 4 1 – 29 7 2002–03 First Division 10 1 – 5 0 2 0 17 1 Total 35 7 – 9 1 2 0 46 8 Mallorca 2003–04 La Liga 14 0 – 3 0 – 17 0 Career Total 296 68 15 5 49 7 5 0 365 80 ===International=== Appearances and goals by national team and year National team Year Apps Goals Nigeria 1991 1 1 1992 9 0 1993 6 2 1994 12 1 1995 1 0 1996 1 0 1997 3 0 1998 7 1 1999 1 1 2000 6 1 2001 8 0 2002 7 0 Total 62 6 :Scores and results list Nigeria's goal tally first, score column indicates score after each George goal. List of international goals scored by Finidi George No. Date Venue Opponent Score Result Competition 1 National Stadium, Lagos, Nigeria 7–1 7–1 1992 African Cup of Nations qualification 2 Nnamdi Azikiwe Stadium, Enugu, Nigeria 2–0 2–0 1994 FIFA World Cup qualification 3 Stade du 5 Juillet, Algiers, Algeria 1–0 1–1 1994 FIFA World Cup qualification 4 Foxboro Stadium, Foxborough, USA 1–0 2–0 1994 FIFA World Cup 5 Moshood Abiola National Stadium, Abuja, Nigeria 2–0 2–0 2000 African Cup of Nations qualification 6 National Stadium, Lagos, Nigeria 1–0 2–0 2000 African Cup of Nations ===Managerial=== Managerial record by team and tenure Team From To Record Record Record Record Record Team From To Enyimba 15 September 2021 12 May 2024 Nigeria 29 April 2024 15 June 2024 Rivers United 4 July 2024 Present Total ==Honours== ===Club=== Ajax *Eredivisie: 1993–94, 1994–95, 1995–96 *Johan Cruijff Shield: 1994, 1995 *UEFA Champions League: 1994–95; *Runner-up 1995–96 *UEFA Super Cup: 1995 *Intercontinental Cup: 1995 Betis *Copa del Rey runner-up: 1996–97 ===International=== Nigeria *Africa Cup of Nations: 1994 Runner-up 2000 Third place 1992, 2002 == References == Category:1971 births Category:Living people Category:Ipswich Town F.C. players Category:Nigerian footballers Category:Premier League players Category:1994 FIFA World Cup players Category:1998 FIFA World Cup players",
 "title": "Finidi George"
}