{
 "id": "239803",
 "text": "The Taiping Rebellion was a civil war in China from 1850 to 1864. It was led by Hong Xiuquan. The Taiping Rebellion was against the ruling Qing Dynasty. About 20 million people died. Most of them were civilians. Hong established the Taiping Heavenly Kingdom (太平天囯).note that the uncommon variant character 囯 is used. This is different from the more common variants 國 and 国. The variant is different because it does not have a dot stroke, like 国. This was the variant used by the Taiping Heavenly Kingdom in its name. The character for 天 also uses an uncommon variant. However, it is not present in Unicode. The upper stroke going sideways in 天 is longer than the lower one in this case. When it was most powerful, it had about 30 million people joining in it. The rebels tried to change society. Troops were nicknamed the Long hair (長毛, cháng máo). == History of the rebellion == Hong Xiuquan was a clever student. He wanted to go into government service. He studied hard and would probably have passed the government tests. However, he discovered that the officials in charge expected bribes. Hong's family was poor at this time and did not have any money.Their family was loyal to the old Ming dynasty, and decided that his failure was because of the corrupt Manchu Qing dynasty. Soon after, Hong became seriously ill. In a fever, he saw himself in the \"Thirty-third Heaven\". He said that he saw a man called the Venerable (Respected) in Years. The Venerable in Years gave Hong a sword and told him to destroy the demon- worshipers who had rebelled against the Venerable in Years. With the help of the Venerable in Years's son, Hong saw himself doing battle against the demon forces. Shortly after he became healthy again, Hong read the Old Testament and believed it showed his vision was right. He felt that he had met with God and that God had chosen him for a son/prophet/messiah. Nimade wanted to know more about Christianity. The missionaries he met disagreed with Hong's vision. They did not agree that he was the brother of Jesus. Hong left them and decided to make his own cult. In Hong's cult, God was the Father, Christ was the Son and Elder (Older) Brother, and Hong was the Younger Brother. He called the New Testament the \"Former Testament\". He called his own ideas the New Testament. Hong's friend Yang Xiuqing used to sell firewood. Yang claimed to be able to act as a voice of God, to direct the people and gain political power.Jonathan Spence, God's Chinese Son: The Taiping Heavenly Kingdom of Hong Xiuquan (1996) China was very weak at this time, and the people were hungry. People began to join Hong's new religion. By 1851 he had a ten-thousand-man army. The rebels cut off their pigtails and made their hair loose. This showed that they were in rebellion to the Manchu. The Taiping Rebellion lasted from 1851 to 1864. It has been guessed that in the fighting, 20 to 30 million people died. At last, corruption of the rebellion's leaders made people angry. Hong committed suicide in June 1864. The Ever-Victorious Army led by Charles George Gordon joined the war. The Taiping capital, Nanjing, became controlled by the Imperial Army. == References == * == Further reading == * Jonathan Spence, God's Chinese Son: The Taiping Heavenly Kingdom of Hong Xiuquan (1996) * Thomas H. Reilly, The Taiping Heavenly Kingdom: Rebellion and the Blasphemy of Empire (2004) * Lindley, Augustus, Ti-ping Tien-Kwoh: The History of the Ti- Ping Revolution (1866, reprinted 1970) Google books access * Hsiu-ch°êng Li, translator, The Autobiography of the Chung-Wang (Confession of the Loyal Prince) (reprinted 1970) * Carr, Caleb, The Devil Soldier: The American Soldier of Fortune Who Became a God in China (1994) * Gray, Jack, Rebellions and Revolutions: China from the 1800s to the 1980s (1990), * Immanuel C. Y. Hsu, The Rise of Modern China (1999), Category:Civil wars involving Asia Category:Wars involving China Category:19th century in China Category:Rebellions in Asia Category:19th-century conflicts",
 "title": "Taiping Rebellion"
}