{
 "id": "239998",
 "text": "Antonín Panenka (born 2 December 1948) is a former Czech football player. He has played for the Czechoslovakian national team. He played most of his career for Bohemians Prague. Panenka won UEFA Euro 1976 with Czechoslovakia. In the final against West Germany, he scored the winning penalty in the shootout with a softly-chipped ball up the middle of the goal as the goalkeeper dived away; this style of penalty is now called the Panenka penalty. In 1980, he won Czechoslovak Footballer of the Year. His play became known as \"cavadinha\" in Brazil and as \"Panenka\" in Europe. The player was in fact a talented midfielder, with good vision of the game and distribution of passes and a specialist in dead balls in free kicks. The most famous move was the result of reflections on new ways of taking penalties after having missed two in the same match. Antonin \"Toni\" Panenka is still recognized as one of the best- known footballers from the former Czechoslovakia and is considered to be one of the best midfielders in the world of his generation. ==Club career == An attacking midfielder known for the quality of his passing and his free kicks, Panenka played for Bohemians Praha for most of his career, joining the club in 1967. In 1981, Panenka left Bohemians for Austrian club Rapid Wien, where he won two Bundesliga titles and an Austrian Cup. In 1985 Rapid reached the UEFA Cup Winners' Cup final; Panenka played as a substitute, but his side lost 3–1 to Everton. ==International career and Panenka penalty== Panenka made his international debut in 1973. He came to international prominence playing for Czechoslovakia at UEFA Euro 1976, where Czechoslovakia reached the final, facing West Germany. After extra time, the match finished 2–2, and so the first penalty shootout in a European Championships final ensued. The first seven kicks were converted until West Germany's fourth penalty taker, Uli Hoeneß, ballooned his shot over the bar. With the score 4–3, Panenka stepped up to take the fifth Czechoslovakian penalty, to win the match under immense pressure. He feigned shooting to the side of the goal, causing German goalkeeper Sepp Maier dive to his left, and then gently chipped the ball into the middle of the net. ==Honours== ===Club=== Rapid Wien *Austrian Bundesliga: 1982, 1983 *Austrian Cup: 1983, 1984, 1985 ===International=== ;Czechoslovakia *UEFA European Football Championship: 1976 ===Individual=== *UEFA European Football Championship Team of the Tournament: 1976 *Czechoslovak Footballer of the Year: 1980 *Golden Foot Legends Award: 2014 *World Soccer World XI: 1976\"ERIC BATTY’S WORLD XI – THE SIXTIES\" Retrieved on 26 November 2015 ==References== Category:1948 births Category:Living people Category:Czech footballers Category:Sportspeople from Prague Category:SK Rapid Wien players Category:Austrian football champions",
 "title": "Antonín Panenka"
}