{
 "id": "240167",
 "text": "Istrian Italians are one of the ethnic groups of Istria. The others are Croatians, Slovenians and Istrorumanians. ==History== The Istrian Italians are the descendants of the romanized Illyrian population of Istria during the Roman Empire. During the Middle Ages they were under domination of many political states, like the Byzantine Empire and the Holy Roman Empire. But most of the time they were under the Republic of Venice, especially during the Renaissance. The Istrian Italians enjoyed a huge cultural development in the centuries under Venice: Pola and Capodistria were important centers of art and culture during the Italian Renaissance.Prominents Italians of Istria Personalities like Pier Paolo Vergerio (a famous \"Humanist\") and Santorius Santorio (a physician who discovered the medical thermometer) are renowned worldwide. In the last two centuries, the Istrian Italians, who were the majority of the population of Istria under Napoleon, have been in continuous ethnic fighting with the Slavs of Istria. As a consequence, they have been reduced to a small minority, who have survived the Istrian exodus and the Foibe massacres during and after WWII.Arrigo Petacco, The exodus. The story of the Italian population of Istria, Dalmatia, and Venezia Giulia, Mondadori, Milan, 1999. English translation. ==Data== According to the Italian Census done in 1936,VIII. Censimento della popolazione 21. aprile 1936. Vol II, Fasc. 24: Provincia del Friuli; Fasc. 31: Provincia del Carnero; Fasc. 32: Provincia di Gorizia, Fasc. 22: Provincia dell’Istria, Fasc. 34: Provincia di Trieste; Fasc. 35: Provincia di Zara, Rome 1936. Cited at http://www.cliohres.net/books/7/26.pdf in the peninsula of Istria there were 294,000 residents; most were Istrian Italians. Here, there are the percentages for all the Istrian cities/districts: District Italians Slovenians Croatians Pola 68% - 32% Pisino (Province of Pola) 28% 2% 70% Capodistria (Province of Pola) 50% 35% 15% Lussino (Province of Pola) 57% - 43% Parenzo (Province of Pola) 72% 4% 24% Fiume 81% 3% 16% Abbazia (Province of Fiume) 24% 30% 46% Currently, there are nearly 50,000 Istrian Italians; a small minority of the Istria peninsula population. They are mainly divided between Croatia and Slovenia, but a few thousand still live in Italy (in the coastal city of Muggia near Trieste). Indeed, in various municipalities in actual Croatia and Slovenia, census data shows that there are still significant numbers of Italians living in Istria, such as 51% of the population of Grožnjan/Grisignana, 37% at Brtonigla/Verteneglio and nearly 30% in Buje/Buie.See census data from Croatia at http://www.dzs.hr/default_e.htm --> released data --> census 2001 --> tables --> population by mother tongue by towns/municipalities --> (scroll down) County of Istria ==Related pages== * Dalmatian Italians * Istria * Italian irredentism in Istria ==Notes== ==Bibliography== * Benussi, Bernardo. L'Istria nei suoi due millenni di storia. Treves-Zanichelli. Trieste 1924. Category:History of Italy Italians Istria",
 "title": "Istrian Italians"
}