{
 "id": "240222",
 "text": "\"Simply put, design management is the business side of design. Design management encompasses the ongoing processes, business decisions, and strategies that enable innovation and create effectively-designed products, services, communications, environments, and brands that enhance our quality of life and provide organizational success.\" This means that design management is not limited on a single design discipline. In his 'Classification of Design' (1976), Gorb divided design into three different classes; design management operates in and across all three categories: * Product (e.g. industrial design, packaging design, service design) * Information (e.g. graphic design, branding, media design, web design) * Environment (e.g. retail design, exhibition design, interior design) Design management is not independent from the organization and product context, and plays three integrative key roles in the interface of design, organisation and market: # align design strategy with corporate and/or brand strategy # manage quality and consistency of design outcomes across and within different design disciplines (design classes) # enhance new ways of user experience and differentiation from competitors Supportive activities are used in design management to manage design more efficient ('doing the things right') and effectively ('doing the right things'). Depending on a multitude of factors (such as industry, company size, design focus, market situation and the position / role of design within the company), design managers have a broad range of job profiles, with very different roles, activities and responsibilities. ==Historical development== It is difficult to exactly trace the history of design management. Even though design management as an expression is first mentioned in literature in 1964, earlier contributions created the context in which design management could arise. Throughout its history design management was influenced by a number of different disciplines (e.g. architecture, industrial design, management, software development, engineering) and movements (e.g. system theory, design methodologies) and in its understanding it can be attributed neither directly to design nor to management. Historical development of design management: PERIOD MAIN PERSPECTIVE DESIGN ROLE DESIGN MANAGEMENT FOCUS MAIN ACTORS 1940s to 1950s Design as style Quality communication Project management Alessi, Braun 1960s to 1970s Design as process Innovation NPD innovation management Philips, Sony 1980s to 1990s Design as leadership Creativity strategy Brand Apple 2000s to 2010s Design thinking New business model Creative organisation IDEO ==Design Management Hierarchy== Design management can be divided by its different fields of application into the three different levels: # operational design management Operational design management is concerned with the management of individual design projects and design teams. # tactical design management Tactical design management addressed the organisation of design resources and design processes. # strategic design management Strategic design management involves the creation of the strategic, long-term vision & planning for design and deals with defining the role of design within the company. ==Related pages== *Design *Innovation *Marketing ==References== ==Further reading== Books * * * * * * * * * * * * * * * * * * * * * * * * * * * ==Other websites== ===Organisations=== *Design Management Institute *Design Business Council(AUS) ===Awards=== *Design Management Europe Award ===Conferences=== * 6th German Conference of Design Management , 2010 May, Cologne (DE) organized by Bergische Universität Wuppertal and PARK advanced design management. Category:Management Category:Innovation Category:Management by type",
 "title": "Design management"
}