{
 "id": "240364",
 "text": "Mary of Modena (Maria Beatrice Eleonora Anna Margherita Isabella d'Este; – ) was Queen consort of England, Scotland and Ireland. She was the second wife of King James II. Mary was a very firm Catholic. She married James, Duke of York, (the future James II) in 1673. He was the younger brother of Charles II.Oman, p 30. Mary was not interested in politics. Instead, she was devoted to James, and gave birth to two children who lived to become adults. They were Louise Mary and the Jacobite James Francis Edward Stuart, who became known in history as \"The Old Pretender\".Oman, p.40 Mary was born as a princess of the Italian Duchy of Modena. She is mostly remembered for the birth of James Francis Edward. Most of the English people thought he was not really Mary's son. They believed he had been secretly brought into the birth-room in a warming-pan to continue King James II's Catholic rule. The privy council investigation declared that the story was false. However, James Francis Edward's birth was one of the reasons why the Glorious Revolution happened. In the Glorious Revolution, King James II was deposed by his daughter Mary and her husband William III of Orange. The \"Queen over the water\"—as Jacobites (followers of James II) called Mary—was exiled to France. She lived with her family in the Château de Saint-Germain-en-Laye, which Louis XIV of France had given her. Louis XIV's courtiers liked Mary, but thought James was not interesting. When James died, Mary spent a lot of time with the nuns at the Convent of Chaillot. When James II died in 1701, the Jacobites saw James Francis Edward as king. Because he was too young to rule, Queen Dowager Mary acted as regent until he became 16. Later, \"James III\" was forced to leave France because of the Treaty of Utrecht. This left Mary without any family in France (Princess Louise Mary had died of smallpox). Mary died of breast cancer in 1718. She was kindly remembered by the people in France at that time. == Early life (1658 - 1673) == Mary Beatrice d'Este was the older child of Alfonso IV, Duke of Modena and his wife Laura Martinozzi. She was born on 5 October 1658 NS in Modena. Her only sibling, Francesco, became a Duke when his father died in 1662. This was the year Mary became 4.Oman, p 14. Mary and Francesco's mother Laura was firm with her children. She acted as regent of the duchy until her son grew older.Haile, p 16.Oman, p 15. Mary's education was very good.Waller, p 22. She spoke French and Italian well, and had a knowledge of Latin and, later, English.Waller, p 23.Haile, p 18. ==References== ===Citations=== ===Bibliography=== *Allan, Fea (1909). James II and His Wives. Meuthon and Co. *Chapman, Hester (1953). Mary II, Queen of England. Jonathan Cape. *Brown, Beatrice Curtis (1929). Anne Stuart: Queen of England. Geoffrey Bles. *Fraser, Antonia (2002). King Charles II Phoenix. *Fraser, Antonia (2007). Love and Louis XIV: The Woman in the Life of the Sun King. Phoenix. *Gregg, Edward (1980). Queen Anne. Routledge & Kegan Paul. *Haile, Martin (1905). Queen Mary of Modena: Her Life and Letters. J.M. Dent & Co. *Harris, Tim. (2007). Revolution: The Great Crisis of the British Monarchy 1685-1720. Penguin. *Maclagan, Michael; Louda, Jiří (1999). Line of Succession: Heraldry of the Royal Families of Europe. Little, Brown & Co. . *Oman, Carola (1962). Mary of Modena. Hodder & Stoughton. *Starkey, David (2007). Monarchy: From the Middle Ages to Modernity. Harper Perennial. . *Turner, FC (1948). James II. Eyre & Spottswoode. *Uglow, Jenny (2009). A Gambling Man: Charles II and the Restoration. Faber & Faber. *Waller, Maureen (2002). Ungrateful Daughters: The Stuart Princesses Who Stole Their Father's Crown. Hodder & Stoughton. ==Other websites== Category:1658 births Category:1718 deaths Category:Deaths from breast cancer Category:House of Este Category:Kings and Queens of Ireland Category:Kings and Queens consort of Scotland Category:People from Modena",
 "title": "Mary of Modena"
}