{
 "id": "240799",
 "text": "Total Drama World Tour is the third season of the Total Drama series. The season started in June 21, 2010. There were originally 17 players on the show. The players are Ezekiel, Tyler, Lindsay, Noah, Harold, LeShawna, Duncan, Courtney, Bridgette, Alejandro, Heather Sierra, Cody, Izzy, DJ, Gwen, Owen and additionally Blaineley, who appeared in Episode 19. Dreamlover come and rescue me. ==Total Drama World Tour== Place Tourist Episodes TDAS Ep 1In Ep 2 Ep 3 Ep 4 Ep 52 Ep 7 Ep 82 Ep 9 Ep 102 Ep 113 Ep 13 Ep 142 Ep 15 Ep 16 Ep 172 Ep 19M Ep 203 Ep 21 Ep 222 Ep 23 Ep 252 Ep 2617 1 ♀ Heather IN WIN WIN IN WIN WIN LOW5 WIN IN IN WIN WIN WIN IN IN LOW IN LOW WIN IN WIN Winner PASS 2 ♂ Alejandro IN IN IN WIN IN IN IN IN WIN WIN LOW IN IN WIN WIN IN IN WIN12 IN16 LOW13 LOW14 Runner-up PASS 3 ♂ Cody IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN IN IN IN IN16 IN16 IN IN LOW14 OUT FAIL 4 ♀ Sierra IN WIN1 WIN IN WIN WIN IN WIN IN IN WIN WIN WIN IN IN LOW WIN11 LOW LOW5 OUT13 PASS 5 ♂ Duncan QUIT Returns in Episode 13 IN LOW5 LOW WIN WIN WIN IN OUT PASS 6-7 ♀ Courtney IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN LOW9 LOW5 WIN OUT10 PASS ♀ Blaineley15 Debuts in Episode 19 IN OUT10 FAIL 8 ♂ Owen IN IN IN WIN IN IN IN IN WIN WIN IN IN IN WIN WIN OUT FAIL 9 ♀ Gwen IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN OUT9 PASS 10 ♂ Tyler IN IN IN WIN IN IN IN IN WIN7 WIN IN IN OUT FAIL 11 ♂ Noah IN IN IN WIN IN IN IN IN WIN WIN OUT FAIL 12 ♂ DJ WIN LOW LOW4 LOW IN LOW WIN LOW6 WIN7 OUT8 FAIL 13 ♀ Izzy LOW IN1 IN WIN IN IN IN IN WIN LEFT FAIL 14 ♀ Lindsay IN IN IN IN IN IN WIN OUT6 PASS 15 ♀ LeShawna WIN IN IN IN IN OUT FAIL 16 ♀ Bridgette IN IN IN OUT Hostess of TDWT Aftermath FAIL 17 ♂ Harold WIN IN QUIT4 FAIL 18 ♂ Ezekiel LOW OUT Continues Within Competition FAIL Tag Description 1 Izzy and Sierra switched teams, therefore Izzy went onto Team Chris and Sierra moved to Team Amazon. 2 This episode featured a reward challenge, therefore no contestants were eliminated. 3 This episode featured two contestants being eliminated. 4 In Episode 3, DJ was supposed to be eliminated, but Harold quit before Chris announced the final barf bag. 5 This contestant was supposed to be eliminated but Chris announced it was a fake ceremony before the contestant took the drop of shame (Heather in Episode 8; Duncan in Episode 14; Sierra in Episode 22). 6 Since Lindsay and DJ were the last two members of Team Victory, Chris announced a tiebreaker and Lindsay lost, eliminating her. 7 In Episode 10, Team Victory (DJ) and Team Chris Is Really Really Really Really Hot (Alejandro, Izzy, Owen, Tyler & Noah) tied for first place, DJ and Tyler both winning for their team. 8 In Episode 11, Team Victory lost, and since DJ was its only member, he was automatically eliminated. 9 In Episode 16, Courtney and Gwen had the same number of votes, so Chris announced a tiebreaker and Courtney won, eliminating Gwen. 10 Courtney and Blaineley both got an equal number of votes, but Chris just eliminated both of them anyway, due to budget cuts. 11 In Episode 20, Sierra won the challenge, but she still got a vote from Cody. 12 In Episode 21, Alejandro won the challenge, but still got a vote from Duncan. 13 Despite Sierra winning the challenge and getting invincibility, she was disqualified by Chris because she unintentionally blew up the plane, which was the only form of transportation that the contestants had in order to compete in the season. This made Chris really angry which caused Sierra's disqualification from the competition. However, this did not make Sierra stay away from the other contestants as Chris expected, since Sierra still came along, even though she was no longer competing. Otherwise, Alejandro was originally supposed to be voted out. 14 In Episode 25, Heather made it to Hawaii first, but Alejandro and Cody had to have a tiebreaker the next episode. 15 Blaineley was never on a team. 16 This contestant was invited up to 1st Class by the winner of the challenge and got to share the reward with them. 17 This episode had two endings, one where Alejandro wins and one where Heather wins. Category Color Description Honor Places Winner of Total Drama World Tour and $1,000,000. Runner-Up of Total Drama World Tour. 3rd Place. Teams Was on Team Amazon Was on Team Chris Is Really Really Really Really Hot. Was on Team Victory Challenge Wins Won for their team (Episodes 2-17 (before the teams dissolved)). Won for themselves (Episode 1 (before the teams were formed); Episodes 19-26 (after the teams dissolved)). Was on winning team, but did not help win (Episodes 2-17 (before the teams dissolved)). Elimination Ceremony Recipients Placed in second and did not have to face elimination (Episodes 2-11 (before Team Victory was wiped out)). Received a barf bag filled with airline issued peanuts at the elimination ceremony. Received the final barf bag filled with airline issued peanuts at the elimination ceremony or had the second most votes. Eliminations Was voted out by their fellow competitors. Placed last in the challenge, or lost a tie-breaker. Quit the competition. Left the competition. Was disqualified. ===Alternate Ending=== Place Tourist Episodes TDAS Ep 1In Ep 2 Ep 3 Ep 4 Ep 52 Ep 7 Ep 82 Ep 9 Ep 102 Ep 113 Ep 13 Ep 142 Ep 15 Ep 16 Ep 172 Ep 19M Ep 203 Ep 21 Ep 222 Ep 23 Ep 252 Ep 2617 1 ♂ Alejandro IN IN IN WIN IN IN IN IN WIN WIN LOW IN IN WIN WIN IN IN WIN12 IN16 LOW13 LOW14 WINNER!!! PASS 2 ♀ Heather IN WIN WIN IN WIN WIN LOW5 WIN IN IN WIN WIN WIN IN IN LOW IN LOW WIN IN WIN Runner-Up PASS 3 ♂ Cody IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN IN IN IN IN16 IN16 IN IN LOW14 OUT FAIL 4 ♀ Sierra IN WIN1 WIN IN WIN WIN IN WIN IN IN WIN WIN WIN IN IN LOW WIN11 LOW LOW5 OUT13 PASS 5 ♂ Duncan QUIT Returns in Episode 13 IN LOW5 LOW WIN WIN WIN IN OUT PASS 6-7 ♀ Blaineley15 Debuts in Episode 19 IN OUT10 FAIL ♀ Courtney IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN LOW9 LOW5 WIN OUT10 PASS 8 ♂ Owen IN IN IN WIN IN IN IN IN WIN WIN IN IN IN WIN WIN OUT FAIL 9 ♀ Gwen IN WIN WIN IN WIN WIN IN WIN IN IN WIN WIN WIN OUT9 PASS 10 ♂ Tyler IN IN IN WIN IN IN IN IN WIN7 WIN IN IN OUT FAIL 11 ♂ Noah IN IN IN WIN IN IN IN IN WIN WIN OUT FAIL 12 ♂ DJ WIN LOW LOW4 LOW IN LOW WIN LOW6 WIN7 LEFT8 FAIL 13 ♀ Izzy LOW IN1 IN WIN IN IN IN IN WIN LEFT FAIL 14 ♀ Lindsay IN IN IN IN IN IN WIN OUT6 PASS 15 ♀ Leshawna WIN IN IN IN IN OUT FAIL 16 ♀ Bridgette IN IN IN OUT Hostess of TDWT Aftermath FAIL 17 ♂ Harold WIN IN QUIT4 FAIL 18 ♂ Ezekiel LOW OUT Continues Within Competition FAIL ==Contestant biographies== ===What's your best quality?=== *Ezekiel - Probably the fact that I could tell you my best quality in eight different languages. *Harold - As a humble warrior I must adhere to a certain code of honor and maintaining that honor is my best quality… along with my romantic side… and my pecs. *Bridgette - Probably my connection to mother earth. That and my loyalty to my boyfriend Geoff. He's so hot! *Leshawna - Has to be my desire to help other teens. I volunteer a lot and am always tryin' to better the lives of those less fortunate. *Lindsay - For sure my left checkbone. When I smile just right and use Babelline Sparkle Blush in Coral Dream it's like looking at a Pickasto Painting. *Izzy - Oh easy, Owen's shark bite on his butt. It is so my best quality. *DJ - Oh it's gotta be my mama. Well, she's not a quality, but she's the reason I am the way I am. And I think I'm pretty okay! Oh and I dance sweet! *Noah - Easy, my brain which is why I need to be in a contestant state of rest so it can be used to maximum effectiveness. *Tyler - Easy. My athletic co-ordination! *Gwen - I guess it'd be my ability not to get all yippe and yay team over stupid stuff like getting a date for the prom, or winning a challenge or the lottery. *Owen - I'd say my ability to control my own gaseous emissions. I can fart and burp the alphabet at the same time and alternating. *Courtney - Oh for sure it's my leadership skills. I'm organized, smart and not afraid to speak other people's minds in the way I want to hear them. *Duncan - Probably my ability to hot wire anything with an engine. *Sierra - My ability to retain every single fact, figure, elimination and relationship status of every single Total Drama player. *Cody - Has to be my animal magnetism. Ladies can't get enough. *Alejandro - I can smell a person's weakness and exploit it in seconds. It's a skill I've been honing since childhood. Let's just say, we went through a lot of nannies. *Heather - Probably my ability to do everything better than everyone else while simultaneously making everyone do everything for me. ==Related pages== * Total Drama Island * Total Drama Action Category:2010 Canadian television series debuts Category:Total Drama",
 "title": "Total Drama World Tour"
}