{
 "id": "241095",
 "text": "The mineral pyrite,The name pyrite is derived from the Greek πυρίτης (puritēs), \"of fire\" or \"in fire\", from πύρ (pur), \"fire\". or iron pyrite, is an iron sulfide with the formula FeS2. This mineral's metallic lustre and pale-to-normal, brass-yellow colour have earned it the nickname fool's gold because of its resemblance to gold.Julia A. Jackson, James Mehl and Klaus Neuendorf, Glossary of Geology, American Geological Institute (2005) p82.Albert H. Fay, A glossary of the mining and mineral industry, United States Bureau of Mines (1920) pp. 103–104.Hurlbut, Cornelius S.; Klein, Cornelis 1985. Manual of Mineralogy. 20th ed, John Wiley and Sons, New York. 285–286 Pyrite on webmineralPyrite on Mindat.orgHandbook of Mineralogy The term pyrite may also be used for some other sulphides such as copper sulphide. == History == Pyrite is the most common sulphide mineral. In ancient Roman times, the name was applied to several types of stone that would create sparks when it was struck against steel. Pliny the Elder described one of them as being brassy, which was almost certainly a reference to what is now called pyrite.James Dwight Dana, Edward Salisbury Dana, Descriptive Minerology, 6th ed., Wiley, New York (1911) p86. By Georgius Agricola's time, the term had become a generic term for all sulphide minerals.Herbert Clark Hoover and Lou Henry Hoover, translators of Georgius Agricola, [De Re Metallica], The Mining Magazine, London (1912; Dover reprint, 1950); see footnote, p. 112. Pyrite is usually found associated with other sulphides or oxides in quartz veins, sedimentary rock, and metamorphic rock, as well as in coal beds and as a replacement mineral in fossils. Despite being nicknamed fool's gold, pyrite is sometimes found in association with small amounts of gold. == Gallery == File:2780M-pyrite1.jpg|Pyrite cubic crystals File:Stolna pri Perneku.jpg|Pyrite mine in Slovakia File:Pyrite elbe.jpg|Crystals from Italy File:Bullypyrite2.jpg|Ammonite with Pyrite == References == Category:Sulfide minerals Category:Iron minerals",
 "title": "Pyrite"
}