{
 "id": "241486",
 "text": "Chicago O'Hare International Airport is an airport on the edge of Chicago, Illinois. It is in the Chicago neighborhood O'Hare. It is one of the largest airports in both the United States and the world. It is a \"hub\" for both United Airlines (its second largest hub) and American Airlines, meaning that flights from many cities come and go from the airport daily. It gets the most international flights of any American airport not on the East or West Coast. The Federal government of the United States reduces the amount of delayed flights in the airport in order to shift the burden of domestic flights at Hartsfield–Jackson Atlanta International Airport. United Airlines (including United Express) is the largest airline at O'Hare, carrying over 45% of passengers. O'Hare is the second-largest hub for United, after Houston-Bush. American Airlines (including American Eagle) has the second largest operation at O'Hare, carrying 37.08% of passengers. O'Hare is American Airlines' third- largest hub, after Dallas/Fort Worth and Charlotte-Douglas. O'Hare has been voted the \"Best Airport in North America\" for 10 years by two separate sources: Readers of the U.S. Edition of Business Traveler Magazine (1998–2003) and Global Traveler Magazine (2004–2007). Travel and Leisure magazine's 2009 \"America's Favorite Cities\" ranked Chicago's Airport System (O'Hare and Midway) the second-worst for delays, New York City's airport system (JFK, Newark Liberty, and LaGuardia) being the first. O'Hare currently accounts for over a sixth of the nation's total flight cancellations. The O'Hare Airport is 668 feet (204 meters) above sea level. It is operated by the City of Chicago Department of Aviation. Most of O'Hare Airport is in Cook County. However, a section of the southwest part of the airport is in DuPage County. The Cook County portion is located within a section of the city of Chicago contiguously connected to the rest of the city via a narrow strip of land about 200 feet (61 m) wide, running along Foster Ave. from the Des Plaines River to the airport. This land was annexed into the city limits in the 1950s to assure the massive tax revenue associated with the airport being part of the city. The strip is bounded on the north by Rosemont and the south by Schiller Park. ==History== The airport was constructed in 1942–43. It was made as a manufacturing plant for airplanes during World War II. The site was chosen for its proximity to the city and transportation. The two-million square-foot (180,000 m²) factory needed easy access to the workforce of the nation's then- second-largest city, as well as its extensive railroad infrastructure. Orchard Field was a small nearby farming community. Douglas Company's contract ended in 1945 and though plans were proposed to build commercial aircraft, the company ultimately chose to concentrate production on the west coast. With the departure of Douglas, the airport took the name Orchard Field Airport. That was the source of its three-letter IATA code ORD. In 1945, the facility was chosen by the city of Chicago as the site for a facility to meet future aviation demands. Matthew Laflin Rockwell (1915–1988) was the director of planning for the U.S. Army Corps of Engineers and responsible for the site selection and design of O'Hare International Airport. He was the great grandson of Matthew Laflin, a founder and pioneer of Chicago. The architect of the airport was Gertrude Kerbis. The O'Hare is currently undergoing the largest construction projects in the United States. In March 2014, a Blue Line train was derailed and crashed at the O'Hare train station, injuring 32 people. ==Transportation== * Road vehicles enter and exit via I-190, which branches off I-90 (the Kennedy Expressway) leading to downtown Chicago. Cars may also access the airport locally from Mannheim Road, the airport's eastern boundary. Aside from cargo access on its south side, all airport traffic travels through the east side of the airport. Local residents sometimes refer to I-190 as \"the world's busiest Cul-de-sac\" as a result of the one way access. * Subway trains from the Blue Line of the Chicago Transit Authority's 'L' depart the terminal from an underground station that opened on September 3, 1984. * Commuter trains from the Metra North Central Service stop at the O'Hare Transfer station, which is connected to the Airport Transit System via a shuttle bus. * Taxi and Limo Services also provide transportation to/from Chicago O'Hare Airport. ==Accidents== 1057 deaths have happened as a result of accidents to or from Chicago O'Hare. ==Airlines== The following airlines fly to O'Hare International Airport: *Aer Lingus *Aeroméxico *Air Canada *Air Choice One (hub) *Air France (seasonal) *Air India *Alaska Airlines *Alitalia (seasonal) *All Nippon Airways *American Airlines (hub) *Austrian Airlines *Avianca *British Airways *Cathay Pacific *Cayman Airways (seasonal) *China Eastern Airlines *Copa Airlines *Delta Air Lines *Emirates *Etihad Airways *EVA Air *Finnair *Frontier Airlines (focus city) *Hainan Airlines *Iberia Airlines *Icelandair *Interjet *Japan Airlines *JetBlue Airways *KLM *Korean Air *LOT Polish Airlines *Lufthansa *Qatar Airways *Royal Jordanian *Scandinavian Airlines *Spirit Airlines (focus city) *Turkish Airlines *United Airlines (hub) *Virgin America *Virgin Atlantic Airways (seasonal) *Volaris *WestJet (seasonal) *WOW Air (starts July 13) *XTRA Airways The following airlines used to fly to O'Hare International Airport: *Aeroflot *Air Florida *Air One *Air Ukraine *Aviacsa *Aviateca *Braniff International Airways *BMI *Canadian Airlines *Continental Airlines *Czech Airlines *Eastern Air Lines *Ecuatoriana *Finnair *Iceland Express *Mexicana de Aviacion *National Airlines *Northwest Airlines *Norwegian Air Shuttle *Pakistan International Airlines *Pan American World Airways *Philippine Airlines *Qantas *Sabena *Swissair *TACA Airlines *TAESA *TAROM Romanian Airlines *TWA *USA3000 Airlines *US Airways *Varig Brazilian Airlines *Virgin Atlantic Airways *Wardair Canada ==Statistics== ===Yearly traffic=== Traffic by calendar year Year Passenger volume Change over previous year Aircraft movements Cargo tonnage 2000 72,144,244 0.64% 908,989 1,640,524 2001 67,448,064 6.51% 911,917 1,413,834 2002 66,565,952 1.31% 922,817 1,436,386 2003 69,508,672 4.40% 928,691 1,601,736 2004 75,533,822 8.67% 992,427 1,685,808 2005 76,581,146 1.38% 972,248 1,701,446 2006 76,282,212 0.30% 958,643 1,718,011 2007 76,182,025 0.15% 926,973 1,690,742 2008 70,819,015 7.03% 881,566 1,480,847 2009 64,397,782 9.07% 827,899 1,198,426 2010 67,026,191 3.83% 882,617 1,577,048 2011 66,790,996 0.35% 878,798 1,505,218 2012 66,834,931 0.04% 878,108 1,443,569 2013 66,909,638 0.12% 883,287 1,434,377 2014 70,075,204 4.45% 881,933 1,578,330 2015 76,949,336 9.81% 875,136 1,742,501 2016 77,960,588 1.31% 867,635 1,726,362 2017 79,828,183 2.40% 867,049 1,950,137 2018 83,339,186 4.40% 903,747 1,868,880 2019 84,649,115 1.69% 919,704 1,788,001 2020 30,860,251 63.54% 538,211 2,052,025 2021 54,020,399 75.06% 684,201 2,536,576 ==Gallery== File:OHare (8759116920).jpg|Inside Terminal 1 at O'Hare. File:Ohare Neon Walkway.jpg|The walkway that connects Terminal 1 and Terminal 2 at the airport. File:O'Hare during the best time of the year! (5232919091).jpg|Inside Terminal 3 at O'Hare File:Ohareterminal5.png|Terminal 5 at O'Hare in 2006. File:Planes in Chicago - 11.JPG|Planes lined up at the airport. ==References== ==Other websites== * O'Hare International Airport (official web site) * O'Hare airport Modernization plan * O'Hare Modernization Program (official web site) * 41st ward map (official city web site) * The Northwest Chicago Historical Society's page on O'Hare * openNav: ORD / KORD charts Category:Airports in Chicago Category:1944 establishments in the United States Category:1940s establishments in Illinois",
 "title": "O'Hare International Airport"
}