{
 "id": "24184",
 "text": "Khartoum or Khartum ( ; ) is the capital city of Sudan. It is also Sudan's largest city. It is where the Blue Nile and main Nile come together. Its name means \"elephant tusk\". Two other cities nearby are Omdurman and Khartoum North. Khartoum has a hot desert climate (BWh in the Koeppen climate classification). ==Climate== Khartoum has a hot desert climate (Köppen climate classification BWh). It is very dry in the winter. This is normal in the Saharo-Sahelian zone. The climate is very dry for most of the year. In eight months of the year, the average rainfall is less than of rain. In August, there is a little bit of rain. The most amount of rainfall in this month is about . The rainy season is usually windy. The average amount of rainfall is very low. There is only of precipitation on average in a year. The highest temperatures usually are during two main parts of the year. The first is in the late dry season when the temperatures are usually above from April to June. The second is in the early dry season. Here, the average highs are above in September and October. Temperatures are usually colder in the night. The lowest average low temperature in the year in January is just above . Khartoum is one of the hottest major cities on Earth. It has an annual mean temperature of . In most months, the monthly average temperatures doesn't get below . This is usually not seen in any other majors cities with hot desert climates like Riyadh, Baghdad and Phoenix. ==Demographics== Year Population City Metropolitan area 1907 69,349 n.a. 1956 93,100 245,800 1973 333,906 748,300 1983 476,218 1,340,646 1993 947,483 2,919,773 2008 Census Preliminary 3,639,598 5,274,321 Almost 250,000 Syrians lived in Khartoum in 2019, representing 5% of all of the people in the city. Most of the population are young men who have fled war in Syria. Sudan was the only country in the world to accept travelers that has a Syrian passport but didn't have a visa. == List of Governors Khartoum == c.1837 * Khartoum a province of Egyptian Sudan. Governors c.1837 - 1861 .... *1861 - 1863 Muhammad Rasikh Bey (b. c.1834 - d. 1883) *1863 - 1877 .... 1877 Mustafa Bey Murad *1877 Muhammad Ma'ani Bey Governors (d. 1881) *1877 - 1878 `Uthman Rifiq Pasha (b. 1839 - d. 1886) *1878 Busati Bey Madani (b. 1850 - d. 1883) *Feb 1991 - Feb 1994 Mohammed Saeed *Feb 1994 - Dec 1997 Badr al-Din Taha *Dec 1997 - Feb 2001 Majdhub al-Khalifa *Feb 2001 - 8 May 2009 Abd al-Halim Ismail al-Muta'afi *8 May 2009 - Jun 2015 Abdul-Rahman Al-Khidir *Jun 2015 - 22 Feb 2019 Abdul-Rahim Mohamed Hussein *24 Feb 2019 - 16 Apr 2019 Hashim Osman al-Hussein *16 Apr 2019 - 18 Jun 2019 Murtadha Abdalla Warraq *18 Jun 2019 - 16 Apr 2020 Ahmed Abdoun Hammad *16 Apr 2020 - 2020 Youssef Adam Aldai (acting) *27 Jul 2020 - 2022 Ayman Khaled Nimer *2022 - 2022 Javed Khan King *1 Mar 2022 - Ahmed Osman Hamza ==Related pages== *2023 Sudan conflict ==References==",
 "title": "Khartoum"
}