{
 "id": "242721",
 "text": "The Southwestern Athletic Conference (SWAC) is a college athletic conference based in Birmingham, Alabama. It is made up of historically black universities in the Southern United States. It participates in the NCAA's Division I for most sports. In football, it participates in the Football Championship Subdivision (FCS). The SWAC is one of two conferences (the other being the Ivy League) which do not take part in postseason play in the FCS football tournament. It is the only one of the two whose members offer a full range of scholarships for football.The Ivy League does not award athletic scholarships at all. Northeast Conference members are limited to 30 football scholarships, less than half the FCS scholarship limit of 63. Pioneer League members may offer scholarships in other sports, but do not award football scholarships, and do not allow athletes receiving scholarships in other sports to play football. The SWAC instead splits its schools into two divisions, and plays a conference championship game. Furthermore, one SWAC game, the Bayou Classic between Southern and Grambling State, is positioned on the schedule after the NCAA tournament has begun. In addition, Alabama State plays Division II rival Tuskegee annually on Thanksgiving Day (The Turkey Day Classic). ==History== In 1920, athletic officials from six Texas HBCUs – C.H. Fuller of Bishop College, Red Randolph and C.H. Patterson of Paul Quinn College, E.G. Evans, H.J. Evans and H.J. Starns of Prairie View A&M;, D.C. Fuller of Texas College and G. Whitte Jordan of Wiley College – met in Houston, Texas, to discuss common interests. At this meeting, they agreed to form a new league, the SWAC. Paul Quinn became the first of the original members to leave the league when it did so in 1929. When Langston University of Oklahoma was allowed into the conference two years later, it began the migration of state-supported institutions into the SWAC. Southern University entered the league in 1934. Arkansas AM&N; entered in 1936 and Texas Southern University in 1954. As the state-supported schools became bigger, it became difficult for the church- supported schools to pay for their sports teams. Soon the church-supported schools started to leave the conference. Bishop withdrew from the conference in 1956, Langston in 1957 and Huston-Tillotson (formerly Samuel Huston) in 1959. That happened one year after two more state-supported schools entered the league (Grambling College and Jackson State College). The enter-exit cycle continued in 1961 when Texas College withdrew, followed by the entrance of Alcorn A&M; in 1962. Wiley left in 1968, the same year Mississippi Valley State College entered. Arkansas AM&N; exited in 1970 and Alabama State University entered in 1982. Arkansas-Pine Bluff (formerly Arkansas AM&N;) rejoined the SWAC on July 1, 1997, regaining full-member status one year later. Alabama A&M; University became the conference’s tenth member when it became a full member in September, 1999 after a one year period as an affiliate SWAC member. Current championship competition offered by the SWAC includes competition for men in baseball, basketball, cross country, football, golf, indoor track, outdoor track & field and tennis. Women’s competition is offered in the sports of basketball, bowling, cross country, golf, indoor track, outdoor track & field, soccer, softball, tennis and volleyball. ==Membership== There are currently 10 members in the SWAC. Institution Location (population) Founded Affiliation Enrollment Year Joined Nickname Endowment East Division Alabama A&M; Huntsville, Alabama (176,645) 1875 Public 6,000 1999 Bulldogs $119M Alabama State Montgomery, Alabama (204,086) 1867 Public 5,600 1982 Hornets $51.6M Alcorn State Lorman, Mississippi 1871 Public 3,250 1962 Braves $4.4M Mississippi Valley State Itta Bena, Mississippi (2,208) 1950 Public 2,500 1968 Delta Devils $1.4M Jackson State Jackson, Mississippi (156,382) 1877 Public 8,351 1958 Tigers $54.3M West Division Arkansas-Pine Bluff Pine Bluff, Arkansas (50,667) 1873 Public 3,232 1936-1970; 1998 Golden Lions $1.9M Grambling State Grambling, Louisiana (4,693) 1901 Public 4,988 1958 Tigers $1.9M Southern Baton Rouge, Louisiana (227,017) 1880 Public 8,900 1935 Jaguars $9.6M Prairie View A&M; Prairie View, Texas (4,410) 1876 Public 8,345 1920 Panthers $34M Texas Southern Houston, Texas (2,242,193) 1947 Public 11,550 1954 Tigers $6M ===Membership timeline=== DateFormat = yyyy ImageSize = width:750 height:auto barincrement:20 Period = from:1920 till:2010 TimeAxis = orientation:horizontal PlotArea = right:30 left:0 bottom:50 top:5 Colors = id:barcolor value:rgb(0.99,0.7,0.7) id:line value:black id:bg value:white PlotData= width:15 textcolor:black shift:(5,-5) anchor:from fontsize:s bar:1 color:powderblue from:1920 till:1956 text:Bishop (1920-1956) bar:2 color:powderblue from:1920 till:1929 text:Paul Quinn (1920-1929) bar:3 color:powderblue from:1920 till:end text:Prairie View (1920-present) bar:4 color:powderblue from:1920 till:1959 text:Samuel Huston (1920-1959) bar:5 color:powderblue from:1920 till:1961 text:Texas College (1920-1961) bar:6 color:powderblue from:1920 till:1968 text:Wiley (1920-1968) bar:7 color:powderblue from:1931 till:1957 text:Langston (1931-1957) bar:8 color:powderblue from:1934 till:end text:Southern (1934-present) bar:9 color:powderblue from:1936 till:1970 text:Arkansas AM&N; / Arkansas-Pine Bluff (1936-1970; 1998-present) bar:9 color:powderblue from:1998 till:end text: bar:10 color:powderblue from:1954 till:end text:Texas Southern (1954-present) bar:11 color:powderblue from:1958 till:end text:Grambling (1958-present) bar:12 color:powderblue from:1958 till:end text:Jackson State (1958-present) bar:13 color:powderblue from:1962 till:end text:Alcorn State (1962-present) bar:14 color:powderblue from:1968 till:end text:Mississippi Valley State (1968-present) bar:15 color:powderblue from:1982 till:end text:Alabama State (1982-present) bar:16 color:powderblue from:1999 shift:(-50,-4) till:end text:Alabama A&M; (1999-present) ScaleMajor = gridcolor:line unit:year increment:5 start:1920 ===Former members=== *Arkansas AM&N; (1936 to 1970; returned as Arkansas-Pine Bluff in 1997) *Bishop College (1920 to 1956) *Langston University (1931 to 1957) *Paul Quinn College (1920 to 1929) *Samuel Huston College (later Huston-Tillotson College) (from 1920 to 1959) *Texas College (1920 to 1961) *Wiley College (1920 to 1968) ==Conference facilities== School Football stadium Capacity Basketball arena Capacity Alabama A&M; Louis Crews Stadium 21,000 Elmore Gymnasium 6,000 Alabama State Cramton Bowl 21,800 ASU Acadome 8,000 Alcorn State Jack Spinks Stadium 22,500 Davey Whitney Complex 7,000 Arkansas Pine Bluff Lion Stadium 12,500 K. L. Johnson Complex 4,500 Grambling State Eddie Robinson Stadium 19,600 Health & Physical Educational Building Memorial Gymnasium 7,500 2,200 Jackson State Mississippi Veterans Memorial Stadium 62,000 Williams Assembly Center 8,000 Mississippi Valley State Rice-Totten Field 10,000 Harrison HPER Complex 5,000 Prairie View A&M; Blackshear Stadium 6,000 William Nicks Building 5,520 Southern Ace W. Mumford Stadium 29,000 F. G. Clark Center 7,500 Texas Southern BBVA Compass Stadium (primary) Reliant Stadium (secondary) 22,000 68,000 Health and Physical Education Arena 8,100 ==SWAC Championships== ===Football=== All games at were played at Legion Field in Birmingham, Alabama. Year Winner Runner Up Score 1999 Southern Jackson State 31-30 2000 Grambling Alabama A&M; 14-6 2001 Grambling Alabama State 38-31 2002 Grambling Alabama A&M; 31-19 2003 Southern Alabama State 20-9 2004 Alabama State Southern 40-35 2005 Grambling Alabama A&M; 45-6 2006 Alabama A&M; Arkansas Pine Bluff 22–13 2007 Jackson State Grambling 42–31 2008 Grambling Jackson State 41-9 2009 Prairie View A&M; Alabama A&M; 30-24 ===Men's basketball=== Year Regular Season Coach Tournament Coach 1956-1957 Texas Southern Ed Adams not held 1957-1958 Texas Southern Ed Adams not held 1958-1959 Grambling Fred Hobby not held 1959-1960 Grambling Fred Hobby not held 1960-1961 Prairie View A&M; Leroy Moore, Jr. not held 1961-1962 Prairie View A&M; Leroy Moore, Jr. not held 1962-1963 Grambling Fred Hobby not held 1963-1964 Grambling Jackson State Fred Hobby Harrison Wilson not held 1964-1965 Southern Richard Mack not held 1965-1966 Alcorn State Grambling E.E. Simmons Fred Hobby not held 1966-1967 Alcorn State Arkansas AM&N; Grambling E.E. Simmons Hubert Clemens Fred Hobby not held 1967-1968 Alcorn State Jackson State Bob Hopkins Paul Covington not held 1968-1969 Alcorn State Bob Hopkins not held 1969-1970 Jackson State Paul Covington not held 1970-1971 Grambling Fred Hobby not held 1971-1972 Grambling Fred Hobby not held 1972-1973 Alcorn State Davey L. Whitney not held 1973-1974 Jackson State Paul Covington not held 1974-1975 Jackson State Paul Covington not held 1975-1976 Alcorn State Davey L. Whitney not held 1976-1977 Texas Southern Robert Moreland not held 1977-1978 Southern Carl Stewart Jackson State Paul Covington 1978-1979 Alcorn State Davey L. Whitney Alcorn State Davey L. Whitney 1979-1980 Alcorn State Davey L. Whitney Alcorn State Davey L. Whitney 1980-1981 Alcorn State Southern Davey L. Whitney Carl Stewart Southern Carl Stewart 1981-1982 Alcorn State Jackson State Davey L. Whitney Paul Covington Alcorn State Davey L. Whitney 1982-1983 Texas Southern Robert Moreland Alcorn State Davey L. Whitney 1983-1984 Alcorn State Davey L. Whitney Alcorn State Davey L. Whitney 1984-1985 Alcorn State Davey L. Whitney Southern Bob Hopkins 1985-1986 Alcorn State Southern Davey L. Whitney Bob Hopkins Mississippi Valley State Lafayette Stribling 1986-1987 Grambling Bob Hopkins Southern Ben Jobe 1987-1988 Southern Ben Jobe Southern Ben Jobe 1988-1989 Grambling Southern Texas Southern Bob Hopkins Ben Jobe Robert Moreland Southern Ben Jobe 1989-1990 Southern Ben Jobe Texas Southern Robert Moreland 1990-1991 Jackson State Andy Stoglin Jackson State Andy Stoglin 1991-1992 Texas Southern Mississippi Valley State Robert Moreland Lafayette Stribling Mississippi Valley State Lafayette Stribling 1992-1993 Jackson State Andy Stoglin Southern Ben Jobe 1993-1994 Texas Southern Robert Moreland Texas Southern Robert Moreland 1994-1995 Texas Southern Robert Moreland Texas Southern Robert Moreland 1995-1996 Jackson State Mississippi Valley State Andy Stoglin Lafayette Stribling Mississippi Valley State Lafayette Stribling 1996-1997 Mississippi Valley State Lafayette Stribling Jackson State Andy Stoglin 1997-1998 Texas Southern Robert Moreland Prairie View A&M; Elwood Plummer 1998-1999 Alcorn State Davey L. Whitney Alcorn State Davey L. Whitney 1999-2000 Alcorn State Davey L. Whitney Jackson State Andy Stoglin 2000-2001 Alabama State Rob Spivery Alabama State Rob Spivery 2001-2002 Alcorn State Davey L. Whitney Alcorn State Davey L. Whitney 2002-2003 Prairie View A&M; Jerome Francis Texas Southern Ronnie Courtney 2003-2004 Mississippi Valley State Lafayette Stribling Alabama State Rob Spivery 2004-2005 Alabama A&M; L. Vann Pettaway Alabama A&M; L. Vann Pettaway 2005-2006 Southern Rob Spivery Southern Rob Spivery 2006-2007 Mississippi Valley State James Green Jackson State Tevester Anderson 2007-2008 Alabama State Lewis Jackson Mississippi Valley State James Green 2008-2009 Alabama State Lewis Jackson Alabama State Lewis Jackson 2009-2010 Jackson State Tevester Anderson Arkansas-Pine Bluff George Ivory ====Tournament performance by school==== School Championships Championship Years Alcorn State 7 1979, 1980, 1982, 1983, 1984, 1999, 2002 Southern 7 1981, 1985, 1987, 1988, 1989, 1993, 2006 Jackson State 5 1978, 1991, 1997, 2000, 2007 Texas Southern 4 1990, 1994, 1995, 2003 Mississippi Valley State 4 1986, 1992, 1996, 2008 Alabama State 3 2001, 2004, 2009 Prairie View A&M; 1 1998 Alabama A&M; 1 2005 Arkansas-Pine Bluff 1 2010 ===Women's Basketball=== Year Regular Season Coach Tournament Coach 1981-1982 Jackson State Sadie Magee Jackson State Sadie Magee 1982-1983 Jackson State Sadie Magee Jackson State Sadie Magee 1983-1984 Alcorn State Shirley Walker Jackson State Sadie Magee 1984-1985 Alcorn State Shirley Walker Jackson State Sadie Magee 1985-1986 Alcorn State Shirley Walker Alcorn State Shirley Walker 1986-1987 Grambling Patricia Bibbs Mississippi Valley State Jessie Harris 1987-1988 Mississippi Valley State Jessie Harris Grambling Patricia Bibbs 1988-1989 Grambling Patricia Bibbs Alabama State Ron Mitchell 1989-1990 Jackson State Andrew Pennington 1990-1991 Alcorn State Shirley Walker Alcorn State Shirley Walker 1991-1992 Alcorn State Shirley Walker Alcorn State Shirley Walker 1992-1993 Alcorn State Southern Shirley Walker Herman Hartman Mississippi Valley State Jessie Harris 1993-1994 Alcorn State Shirley Walker Grambling Patricia Bibbs 1994-1995 Alcorn State Grambling Jackson State Shirley Walker Patricia Bibbs Andrew Pennington Jackson State Andrew Pennington 1995-1996 Alcorn State Jackson State Shirley Walker Andrew Pennington Grambling Patricia Bibbs 1996-1997 Grambling Patricia Bibbs Grambling Patricia Bibbs 1997-1998 Grambling David Ponton Grambling David Ponton 1998-1999 Grambling David Ponton Grambling David Ponton 1999-2000 Grambling David Ponton Alcorn State Shirley Walker 2000-2001 Alcorn State Shirley Walker Alcorn State Shirley Walker 2001-2002 Southern Sandra Pugh Southern Sandra Pugh 2002-2003 Alabama State Jackson State Freda Freeman-Jackson Denise Taylor Alabama State Freda Freeman-Jackson 2003-2004 Alabama State Freda Freeman-Jackson Southern Sandra Pugh 2004-2005 Alcorn State Shirley Walker Alcorn State Shirley Walker 2005-2006 Jackson State Southern Denise Taylor Sandy Pugh Southern Sandra Pugh 2006-2007 Prairie View A&M; Jackson State Cynthia Cooper Denise Taylor Prairie View A&M; Cynthia Cooper 2007-2008 Prairie View A&M; Cynthia Cooper Jackson State Denise Taylor 2008-2009 Prairie View A&M; Cynthia Cooper Prairie View A&M; Cynthia Cooper 2009-2010 Southern Southern ==Notes and references== ==Other websites== *Official website *Swac Fans Category:NCAA Division I athletics conferences Category:1920 establishments in the United States",
 "title": "Southwestern Athletic Conference"
}