{
 "id": "243188",
 "text": "The Placozoa are an animal phylum, a primitive form of invertebrate.Barnes, Robert D. 1982. Invertebrate zoology. Holt-Saunders, Philadelphia, PA. p84 . They are the simplest in structure of all metazoa.They have been described as \"the simplest animals on Earth.\" The Placozoa is usually considered to have only one species, Trichoplax adhaerens, but there is enough genetic diversity that it is possible that there are multiple, morphologically similar species. Since 2018, three other species in two groups have been described. ==History== Franz Eilhard Schulze discovered them, in an aquarium in Graz, in 1883. There is no common name for the taxon. The scientific name literally means \"flat animals\". Other zoologists opposed this description. In 1890, F.C. Noll argued that the animal was a flat worm (Turbellaria). In 1907, Thilo Krumbach published a hypothesis that Trichoplax is not a distinct animal but that it is a form of the planula larva of the anemone-like hydrozoan Eleutheria krohni. Schulze and others published articles that showed that this was not true. Despite this, Krumbach's analysis became the standard textbook explanation. Nothing was printed in zoological journals about Trichoplax until the 1960s. ==Description== Trichoplax is a small, flattened, animal around a millimetre across. Like an Amoeba, it has no regular outline, although the upper surface is always flattened. The body consists of an outer layer of simple epithelium enclosing a loose sheet of cells. The epithelial cells bear flagella, which the animal uses to help it creep along the seafloor.UC Berkeley: Introduction to Placozoa Between these layers is the fiber syncytium, a liquid-filled cavity strutted open by star-like fibers. Trichoplax feed by absorbing food particles—mainly microbes—with their underside. They generally reproduce asexually, by dividing or budding, but can also reproduce sexually. Though Trichoplax has a small genome in comparison to other animals, nearly 87% of its 11,514 protein-coding genes are similar to known genes in other animals. ==New discoveries== In the 1960s and 1970s renewed interest among researchers led to the discovery that the animals people had been studying are adults, not larvae. This newfound interest also included study of the organism in nature (as opposed to aquariums).Syed T. and Schierwater B. 2002. Trichoplax adhaerens: discovered as a missing link, forgotten as a hydrozoan, re- discovered as a key to metazoan evolution. Vie Milieu vol 52, p177–187. == References == Category:Minor phyla Category:Invertebrates",
 "title": "Placozoa"
}