{
 "id": "243352",
 "text": "Desso GrassMaster is a sports playing field surface made of natural grass that has artificial fibres added to it. The unique part of this system is the artificial grass fibres, stuck 20 cm deep, which cover 3% of the surface. During the growing process, the roots of the natural grass mix with the man- made grass fibres to anchor the turf to product a stable, solid, and even field with better drainage and better playing comfort. Reinforced natural grass is used for stadium pitches and training pitches used for soccer, rugby, American football and baseball. Reinforced natural grass can also be used for events and concerts. The artificial turf injection shortens the recovery time for the grass. Reinforced Natural Grass (also known as Hybrid Grass), as the name suggest, is formed by the mixture of natural and artificial fibres. It was in the year 1990, when the first generation of Reinforced Natural Grass developed. Using turf, made up of synthetic fibres, combined with Natural Grass has become extremely popular in recent times. In this case, the artificial fibres are intertwined with natural grass roots as they grow. The synthetic fibers help to stabilize and protect the natural grass, improving growth of natural grass fields. In 2010, for the first time in history, a FIFA World CupTM was played on grass pitches that were partly made up of artificial grass in the Mbombela Stadium and the Peter Mokaba Stadium. __TOC__ == Stadiums that use the field == Stadium Club/association Sport Country Mbombela Stadium 2010 FIFA World Cup South AfricaTM Football Peter Mokaba Stadium 2010 FIFA World Cup South AfricaTM Football Emirates Stadium Arsenal Football Galpharm Stadium Huddersfield Town Football Anfield Liverpool Football Villa Park Aston Villa Football Keepmoat Stadium Doncaster Rovers Football City of Manchester Stadium Manchester City Football White Hart Lane Tottenham Hotspur Football Upton Park West Ham United Football Carrow Road Norwich City Football Stadium:mk Milton Keynes Dons Football Madejski Stadium Reading and London Irish Football and rugby union Adams Park Wycombe Wanderers and London Wasps Football and rugby union Liberty Stadium Swansea City and Ospreys Football and rugby union Cardiff City Stadium Cardiff City and Cardiff Blues Football and rugby union Croke Park Gaelic Athletic Association Gaelic games, Rugby Union and Football Santiago Bernabeu Stadium Real Madrid Football Galgenwaard Stadium F.C. Utrecht Football De Koel VVV-Venlo Football Rat Verlegh NAC Football AZ AZ Alkmaar Football Sports Authority Field at Mile High Denver Broncos American football Novator Stadium FC Khimki Football Constant Vanden Stock Stadium RSC Anderlecht Football Daknamstadion K.S.C. Lokeren Football Heinz Field Pittsburgh Steelers and Pitt Panthers American football Lambeau Field Green Bay Packers American football Lincoln Financial Field Philadelphia Eagles and Temple Owls American football Lerkendal Stadium Rosenborg BK Football == Footnotes == == Other websites == *FieldTurfLandscape Category:Sports",
 "title": "Desso GrassMaster"
}