{
 "id": "243339",
 "text": "Catherine Helen Spence (31 October 1825 – 3 April 1910) was a Scottish- Australian journalist and author in Australia. She fought for the rights of poor people, orphans, criminals, women, and children. She devoted most of her life to making change in South Australia. She strongly believed that women should be allowed to vote. Spence believed that everyone should get a good education. She was the first Australian woman to try to join the government.\"Catherine Helen Spence.\" Feminist Writers, edited by Pamela Kester-Shelton, St. James Press, 1996. Biography in Context, http://link.galegroup.com/apps/doc/K2410000244/BIC?u=palo88030&sid;=BIC&xid;=bcc03c02 Accessed 3 May 2018.\"Catherine Helen Spence.\" Encyclopedia of World Biography, vol. 23, Gale, 2003. Biography in Context, http://link.galegroup.com/apps/doc/K1631008099/BIC?u=palo88030&sid;=BIC&xid;=19ff9bfd Accessed 3 May 2018.Darian-Smith, Kate. \"Spence, Catherine Helen.\" World Book Student, World Book, 2018, www.worldbookonline.com/student/article?id=ar754985. Accessed 3 May 2018. She was lovingly called \"the Grand Old Woman of Australia\". In Scotland a plaque was made at her birthplace in 1999 (89 years after she died). She died in Adelaide, South Australia. == Early life == Catherine Helen Spence was born in 1825 in Melrose, Scotland. She moved to South Australia with her family in 1839. She went to a small private school and got a good education. Spence started working as a private teacher when she was 17 years old. She became good at giving public speeches and preaching. == Activism == Catherine Helen Spence was an activist for many humans' rights. She made many public speeches on the subjects she thought were important. She wrote several books. She did not sign with her own name on the first few books she wrote. Her first book was about Australia. It was the first book about Australia created by a woman. She created a program that helped the poor and children without families. Spence was important to an organization that supported women’s right to vote. South Australia (the place she lived) became the first place to let women vote. Spence wrote about wanting equality in the government and fairness towards women. She wanted women to be paid as much as men. She also wanted the environments that women worked in to be safe and healthy. Most people were not ready to accept her ideas in South Australia. == References == Category:1825 births Category:1910 deaths Category:Australian novelists Category:Australian activists Category:Australian journalists",
 "title": "Catherine Spence"
}