{
 "id": "243487",
 "text": "John Smith (c. January 1580 – 21 June 1631) was a English soldier, explorer, and author. He led one of the first settlements at the Virginia Colony in 1608-1609. He explored the rivers of Virginia and the Chesapeake Bay, and drew maps of the Chesapeake Bay area and New England. Smith's books and maps gave important information that helped Englishmen living in the New World. His books also encouraged people in Europe to come to the New World. At Jamestown, Smith trained settlers to farm so they would have food to eat. He told them \"he who shall not work, shall not eat.\" Smith was a strong leader, and under his leadership the settlement overcame many problems (including bad weather, lack of fresh water, living in a wilderness, people who did not want to work, and attacks from the Powhatan people.. ==Early adventures== Smith was born in January 1580 at Willoughby, Lincolnshire where his parents rented a farm. He claimed descent from the ancient Smith family of Cuerdley.Churton, Ralph, The lives of William Smyth, Bishop of Lincoln, and Sir Richard Sutton (1800), p. 5 Smith left home at the age of 16 and went to sea. He served as a soldier in the army of Henry IV of France, fighting against Spain. He also fought to help the Dutch revolt from the Spanish King Philip II of Spain. He went to the Mediterranean Sea where he worked in both trade and piracy. He then fought against the Ottoman Empire in the Ottoman wars and for the Austrian Habsburgs in Kingdom of Hungary in 1600 and 1601. Smith is rumored to have defeated, killed and beheaded Turkish commanders in 3 duels. He was knighted by the Transylvanian Prince and was given a horse and coat of arms showing 3 Turks' heads.Not Just Another John Smith, usnews.com, 21 January 2007 In 1602 he was wounded in a skirmish, captured and sold as a slave. Smith wrote that his Turkish master sent him as a gift to his Greek mistress in Constantinople, who fell in love with Smith. He then escaped from the Ottoman lands and returned to England in 1604. ==Work at Jamestown == === Journey from England === In 1606 the Smith was hired by the Virginia Company to settle in the Virginia Colony for profit. In December 1606 Smith and others set sail in three ships. Smith had a loyal servant named Samuel Collier, who traveled with Smith. There were problems on the voyage and Smith was charged with mutiny. Captain Newport planned to execute him. Then the Captain opened a letter of orders from the Virginia Company which stated that Smith was to be one of the leaders of the new colony. For that reason, Smith was not killed.A True Relation of Such Occurrences and Accidents of Note as Happened in Virginia (1608), EText, University of Virginia === In 1607 === The English arrived in April 1607 and Captain Wingfield chose Jamestown to be the location for the colony. In summer the settlers were still living in temporary housing. After the four-month ocean trip, food supplies were only enough for each person to have a cup or two of grain-meal per day. Due to bad weather and lack of food, disease spread quickly. By September, more than half of the settlers had died.. In December 1607, Smith was captured by Native Americans while looking for food. He was taken to meet the Chief of the Powhatan tribe. The village was about 15 miles from Jamestown. Smith was released without harm and gave credit in part to the chief's daughter, Pocahontas, who threw herself across his body.Smith, Generall Historie Seeing this, her father took mercy on Smith and he was safely taken back to Jamestown. This encounter began a friendly relationship between the natives and the Jamestown colonists.Smith. Letter to Queen Anne. === In 1608 === In early January 1608, nearly 100 new settlers arrived with Captain Newport, and through carelessness the village was set on fire. The settlers were forced to live in the ruins that winter, after the James River froze over. During this time, Newport and his crew wasted much time loading their ships with iron pyrite (fool's gold). Food supplies ran low and although the Native Americans brought some food, Smith wrote that “more than half of us died.”. In April 1608 a ship brought supplies and 50 new settlers. Smith put them to work building housing and planting crops. In the summer of 1608, Smith left Jamestown to explore the Chesapeake Bay region and search for badly needed food. He made a map that would be of great value to Virginia explorers for over a century. In his absence, Smith left his friend Matthew Scrivener, as governor in his place. Scrivener would later drown in a storm in an ill- fated voyage to Hog Island. Smith was elected president of the local council in September 1608 and instituted strict rules. In October 1608, a ship arrived with 70 new settlers, including the first women. Some German and Polish craftsmen also arrived, but they brought no food supplies. After that, Smith tried to get food from the Native Americans and it took threats of military force for them to obey. Powhatan was frightened by the great number of white men coming into the area and was trying to starve them. Smith found that there were those among both the settlers and Native Americans who did not like his rules and were planning to kill him. Smith wrote that he was warned by Pocahontas. He called a meeting and told the men who did not work that “he that will not work shall not eat…” After that the situation improved.To Conquer is To Live: The Life of Captain John Smith of Jamestown, Kieran Doherty, Twenty-first Century Books, 2001Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1973 NGS) Chpt. 4 p. 85 === In 1609 === For three months in early 1609, February, March and April all was well at Jamestown with many dwellings built, acres of land cleared and much other work done. Then in April, rats and dampness destroyed all their stored corn. They needed food badly and Smith sent a large group of settlers to fish and others to gather shellfish downriver. They came back without food and were willing enough to take the meager rations offered them. This angered Smith and he ordered them to trade their guns and tools for fruit from the Indians and ordered everyone to work or they would have to leave the safety of the fort.Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1974 NGS) Chpt. 4 P. 85 Some left and went to the Native American villages, but Powhatan’s people also went by Smith’s law that he who works not, eats not. This was in effect until they were near starved and they returned home.Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1974 NGS) Chpt. 4 At some point an unexpected ship arrived, captained by Samuel Argall. He had food and wine which Smith bought with a promise to pay back. Argall also brought news that the Virginia Company was sending more supplies and settlers to Jamestown along with a new governor, Lord De la Warr.Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1974 NGC) Chpt. 4 p. 85 In a May 1609 voyage to Virginia, Sir Thomas Smith, Virginia Company treasurer, arranged for about 500 colonists, including women and children to come along. A fleet of nine ships set sail. One sank in a storm soon after leaving the harbor. The Sea Venture was shipwrecked on the Bermuda islands with the admiral and Stephen Hopkins on board. One year later, in May 1610, they had arrived at Jamestown in small boats they had made.Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1974 NGS) Chpt. 4 p. 91 Gates soon found that there was not enough food to support all in the colony and decided to abandon Jamestown. As their boats were leaving the Jamestown area, they met a ship carrying the new governor, Lord De la Warr, who ordered them back to Jamestown. In August 1609 John Smith was quite surprised to see more than 300 new settlers arrive. London was sending new settlers with no planning as to how or where they would live. Capt. John Smith was severely injured by an accidental gunpowder explosion in his canoe. Smith sailed to England for treatment in October 1609. He had spent two and a half years at Jamestown. He never returned to Virginia. Historians say Smith was very important to the development of Jamestown in its earliest years. Colonists would continue to die from various illnesses and disease, with an estimated 150 of the 500 surviving that winter. In spite of this, the Virginia Company continued to finance and transport settlers to sustain Jamestown. For the next five years, Governors Gates and Sir Thomas Dale continued to keep strict discipline, with Sir Thomas Smith in London attempting to find skilled craftsmen and other settlers to send to Jamestown.Tee Loftin Snell. The Wild Shores: America’s Beginnings. National Geographic Society. (c. 1974 NGS) Chpt. 4 p. 93-94 === Books and maps === Smith wrote letters and books describing his New World experiences in detail. He encouraged Englishmen to come to the New World, writing: \"Here every man may be master and owner of his own labour and land and if he has nothing but his hands, he may still grow rich.David Cressy (1987). \"Coming Over: Migration and Communication Between England and New England in the Seventeenth Century\". p. 99. Cambridge University Press, Smith's writings are important historical documents. The National Park Service writes: > Captain John Smith's writings offer an eyewitness account of the Chesapeake > Bay in 1608. They describe his explorations in detail, recounting where he > went, what he saw, and the people he met. Although compelling and > informative, his perspective is still a biased one – that of an English > explorer in an Indigenous world. His writings introduced the English to this > region of the world for the first time and triggered a wave of colonization. == Later years== In 1614, Smith returned to the northeast coast of America and named the region \"New England\".New England. (2006). In Encyclopædia Britannica. Retrieved 20 June 2006, from Encyclopædia Britannica Premium Service: Later that year a storm destroyed his ship. In 1615, Smith was captured by French pirates off the coast of the Azores near Portugal. He escaped after weeks of captivity and made his way back to England, where he wrote an account of his two voyages called A Description of New England. He never left England again. Smith died in the year 1631 in London at the age of 51. He is buried in the church of St Sepulchre-without-Newgate in the City of London. The Captain John Smith Monument currently lies off the coast of New Hampshire on Star Island, part of the Isles of Shoals. It was built in 1864 to honor the 250th anniversary of John Smith's visit to the area, which he named Smith's Isles.J. Dennis Robinson The Ugliest Monument in New England In 1914, the New Hampshire Society of Colonial Wars partially restored and rededicated the monument for the 300th anniversary celebration of his historic visit.Robinson. John Smith Memorial Photo History The harsh coastal winters had damaged the monument so badly that the words carved in the granite had worn away. ==References== ==Sources== * ==Publications and more reading== * A True Relation of Such Occurrences and Accidents of Note as Happened in Virginia (1608) * A Map of Virginia (1612) * The Proceedings of the English Colony in Virginia (1612) * A Description of New England (1616) * New England's Trials (1620, 1622) * The Generall Historie of Virginia, New- England, and the Summer Isles (1624) * An Accidence, or the Pathway to Experience Necessary for all Young Seamen (1626) * A Sea Grammar (1627) – the first sailors' word book in English * The True Travels, Adventures and Observations of Captain John Smith (1630) * Advertisements for the Unexperienced Planters of New England, or Anywhere (1631) * Woolley, Benjamin. Savage Kingdom, The True Story of Jamestown, 1607, and the Settlement of America, First Harper Perennial Edition Published 2008 * Horn, James, ed. Captain John Smith, Writings, with Other Narratives of Roanoke, Jamestown, and the English Settlement of America (Library of America, 2007) . * Philip L. Barbour, The Jamestown Voyages under the First Charter, 1606–1609, 2 vols., Publications of the Hakluyt Society, ser.2, 136–37 (Cambridge: Cambridge University Press, 1969) * A. Bryant Nichols Jr., Captain Christopher Newport: Admiral of Virginia, Sea Venture, 2007 * Philip L. Barbour, The Three Worlds of Captain John Smith (Boston: Houghton Mifflin, 1964) * Gleach, Frederic W. Powhatan's World and Colonial Virginia. Lincoln: University of Nebraska Press, 1997. * Dorothy Hoobler and Thomas Hoobler, Captain John Smith: Jamestown and the Birth of the American Dream (Hoboken, N.J.: John Wiley & Sons, 2006) * Horn, James. A Land as God Made It: Jamestown and the Birth of America (New York: Basic Books, 2005) * Jenks, Tudor. Captain John Smith (New York: Century Co., 1904) * Kupperman, Karen Ordahl ed., John Smith: A Select Edition of His Writings (Chapel Hill: University of North Carolina Press, 1988) * Price, David A., Love and Hate in Jamestown: John Smith, Pocahontas, and the Heart of a New Nation (New York: Knopf, 2003) * Lemay, J.A. Leo. Did Pocahontas Save Captain John Smith? Athens, Georgia: The University of Georgia Press, 1992, p. 25\\. * Giles Milton, Big Chief Elizabeth: The Adventures and Fate of the First English Colonists in America, Macmillan, New York, 2001 * John Smith, The Complete Works of Captain John Smith (1580–1631) in Three Volumes, edited by Philip L. Barbour, 3 vols. (Chapel Hill: University of North Carolina Press for The Institute of Early American History and Culture, Williamsburg, 1986) * Smith, John. The Generall Historie of Virginia, New-England, and the Summer Isles. 1624. Repr. in Jamestown Narratives, ed. Edward Wright Haile. Champlain, VA: Roundhouse, 1998. pp. 198–9, 259. * Smith, John. Letter to Queen Anne. 1616. Repr. as 'John Smith's Letter to Queen Anne regarding Pocahontas'. Caleb Johnson's Mayflower Web Pages. 1997. Accessed 23 April 2006. * Symonds, William. The Proceedings of the English Colonie in Virginia. 1612. Repr. in The Complete Works of Captain John Smith. Ed. Philip L. Barbour. Chapel Hill: University of North Carolina Press, 1986. Vol. 1, pp. 251–2 * Charles Dudley Warner|Warner, Charles Dudley, Captain John Smith, 1881. Repr. in Captain John Smith Project Gutenberg Text, accessed 4 July 2006 == Other websites == * Captain John Smith Chesapeake National Historic Trail Official Website * Friends of the John Smith Trail * NGS Then and Now – John Smith * John Smith Water Trail Blog * The Captain John Smith Water Trail * A Description of New England (1616) online text (PDF) * The Ugliest Monument in New England (seacoastnh.com) * The Ugliest Monument in New England II * John Smith Memorial Photo History * Captain John Smith Chesapeake NHT is administered by the Chesapeake Bay Gateways and Watertrails Network * Complete text of the Generall Historie American Memory * Texts of Imagination & Empire, by Emily Rose, Princeton University Folger Shakespeare Library * Captain John Smith His Life and Legend Category:1580 births Category:1631 deaths Category:British military people Category:English explorers Category:Governors of Virginia Category:Writers from Lincolnshire Category:Duels",
 "title": "John Smith (explorer)"
}