{
 "id": "243421",
 "text": "Japanese food has many different styles and each region in Japan has its own style. Japanese food also has a history of cultural exchange between Japan and other counties. In modern times, the West inspired the Japanese to invent new dishes. Some of these dishes have become popular not only inside Japan but also outside. ==Examples== ===Soya beans=== Soya beans are a very important ingredient in Japanese cooking. They are used in soya sauce, natto, miso and tofu. Soya milk is also used as a drink. One example of a dish with soya beans in it, is tofu. Tofu is made from pressing soybeans into cubes and then boiling them. Tofu is often in soups and stews. Deep fried tofu is also used in many popular Japanese dishes, for example as kitsune udon and inari sushi. ===Noodles=== Noodles (like in most Asian foods) are used often in Japanese foods. The dishes usually come originally from China; nevertheless they have reached a unique development in Japan. *Ramen (egg noodles with soup, vegetables and meat or fish) *Udon (Thick noodles with soup that can be with tofu, meat or vegetables. For the hot dish, noodles and soup are usually served together in the same bowl. For the cold dish, noodles and soup are usually served in different dishes) * Soba (Thin noodles with soy-sause-based soup. In hot dishes, noodles and soup are usually served together in the same bowl. For cold dishes, the noodles and soup are usually served in different bowls) * Yakisoba (Stir fry vegetables and/or meat with egg noodles and a soy based sauce) * Sōmen (Very thin white noodles made of wheat flour) * Sōmin champurū (Okinawan very thin noodles that are stirred and fried with green onions and pork meat) ===Seafood=== Japan is surrounded by the ocean so there is a rich variety of seafood which is an important part of Japanese cooking. *Sushi (cooked rice with raw fish, vegetables or other seafood) *Sashimi (sliced raw fish) *Yakizakana (cooked whole fish) *Asari no miso shiru (miso soup with small mussels called \"asari\") ===Meat=== Japanese people did not eat meat until the Europeans first came. Fish was the most common food. *Yakiniku (fried slices of beef with a sweet and spicy sauce- originally Korean) *Nikujaga (beef, potatoes and usually carrots cooked in mentsuyu – a soy sauce based sauce) *Yakitori (bits of chicken staked with soy based sauce) *Shabu shabu is meat (or other protein-based food) and vegetables boiled in a simple broth flavored with seaweed and/or fish. Each piece of meat is put in the broth for a short time. *Botan nabe *Gyūdon (Rice bowl made with thin beef and sauce on top) *Chicken katsu (pieces of fried chicken with curry sauce on top) ===Wasabi=== Wasabi is Japanese horseradish. It is often a green paste used with sashimi and sushi. Wasabi is also used with many other Japanese foods. Wasabi is sold as a paste or in powder form. Wasabi powder has to be mixed with water to be turned into a paste. Wasabi has a strong, very spicy (hot) taste. ===Sashimi=== Sashimi is very thinly cut raw seafood. Many different kinds of fresh fish and other seafood are served raw in Japanese dishes. Sashimi is one of them. It is almost the same as sushi, but it has no vinegar rice. When the slices of fish are put on small pieces of rice they are called \"Nigiri Sushi\". Sashimi is artistically arranged and put on the plate on top of shredded daikon and shiso leaves. The fish pieces are dipped into soya sauce before being eaten. ===Seaweed=== Seaweed has been a very important part of Japanese dishes for a long time. Today, many different types of seaweed are used in soups, seasonings and other forms of Japanese cooking. These are the three seaweeds used the most: *Kombu (large type of seaweed) *Wakame (sold in dried form, and then put in water before people use it in their foods) *Nori (thin, dried seaweed sheets, used in sushi) ===Tofu=== Tofu is a popular traditional dish in Japanese and has become popular in Asia and the rest of the world. ==References== *\"Japanese Food\" Japan-Guide.com, Gourmet Navigator, Eat-Japan.com < > *Yoshizuka, S \"Japanese Food \" About.com (13/04/10) *\"Japanese Food\" Japan-Guide.com, Gourmet Navigator, Eat-Japan.com (13/04/10)",
 "title": "Japanese food"
}