{
 "id": "243571",
 "text": "Ryszard Kaczorowski (born 26 November 1919 in Białystok - died 10 April 2010 in Smolensk, near Katyn Forest) was a Polish politician and statesman. He was the last President of Poland within Government in Exile. It originated from early days of the World War II and was internationally recognized until 1945. Kaczorowski was active in Polish scouting movement, organized anti-Soviet resistance in 1939-1940. He was arrested, sentenced to death, which was commuted to 10 years of hard labour. He was then released in 1941. He joined Anders Army and fought in a battle of Monte Cassino. Kaczorowski decided to remain in exile in the United Kingdom after the establishment of the communist government. He worked for many years as economist, but never became a British citizen. He was active in emigree circles. He was the head of exiled Polish scouting for example. After retirement, he became Minister of Home Affairs. In exile, he was named designated successor for President Kazimierz Sabbat. He succeeded the office on 19 July 1989 following Sabbat sudden death. After the popular election of Lech Wałęsa for President of Poland in 1990, Kaczorowski handed presidential insignia of pre-War Poland to him. The Government in Exile ended its historical activity and recognized the new Third Republic of Poland. Although he largely was not involved in partisan politics, Kaczorowski remained an active figure after his Presidency. He visited Poland frequently (as he lived permanently in London) and participated in many events. In 1952 he married academic Karolina Kaczorowska. They were married until his death in 2010. He died in a presidential plane crash with President Lech Kaczyński on 10 April 2010 in Russia. His body was buried in state in Warsaw's Belvedere Palace. His crypt was buried in the National Temple of Divine Providence in Warsaw. == References == ==Other websites== * Category:1919 births Category:2010 deaths Category:Aviation deaths Category:Knights Grand Cross of the Order of St Michael and St George Category:Presidents of Poland",
 "title": "Ryszard Kaczorowski"
}