{
 "id": "243781",
 "text": "The 2008 UEFA Cup Final was the 37th final of the UEFA Cup. It is UEFA's second-tier club football tournament. The match was played at the City of Manchester Stadium. It is the home stadium of Manchester City F.C., in Manchester, England, at 20:45 CEST (19:45 local time) on 14 May 2008. The match was played by Zenit St. Petersburg of Russia and Rangers of Scotland. It was called a battle of Rangers coaching staff, with ex-boss Dick Advocaat, currently the manager of Zenit against current boss Walter Smith. Smith has had two times as manager of Rangers. Both coaches led the Rangers to the Scottish domestic treble; Smith in 1993 and Advocaat in 1999. Zenit won the match 2–0. They had goals from Igor Denisov and Konstantin Zyryanov. It was their first UEFA Cup title. It made them only the second Russian side to win the competition, after CSKA Moscow in 2004–05. The logo of the final shows a picture of the City of Manchester Stadium, created by English artist Liam Spencer. It was first shown at a ceremony in the stadium on December 6. __TOC__ ==Route to the final== ===Knockout stage=== Zenit St. Petersburg Zenit St. Petersburg Zenit St. Petersburg Rangers Rangers Rangers Villarreal H 1 - ;0 Pogrebnyak 63' Round of 32 First leg Round of 32 First leg Panathinaikos H 0 - 0 Villarreal A 1 - 2 Zenit St. Petersburg won on away goals Pogrebnyak 31' Second leg Second leg Panathinaikos A 1 - 1 Rangers won on away goals Novo 81' Marseille A 1 - 3 Arshavin 82' Round of 16 First leg Round of 16 First leg Werder Bremen H 2 - 0 Cousin 45' Davis 47' Marseille H 2 - 0 Zenit St. Petersburg won on away goals Pogrebnyak 39', 78' Second leg Second leg Werder Bremen A 0 - 1 Bayer Leverkusen A 4 - 1 Arshavin 20' Pogrebnyak 52' Anyukov 61' Denisov 64' Quarter-finals First leg Quarter-finals First leg Sporting CP H 0 - 0 Bayer Leverkusen H 0 - 1 Second leg Second leg Sporting CP A 2 - 0 Darcheville 60' Whittaker 90+2' Bayern Munich A 1 - 1 Lúcio 60' (o.g.) Semi-finals First leg Semi-finals First leg Fiorentina H 0 - 0 Bayern Munich H 4 - 0 Pogrebnyak 4', 73' Zyryanov 39' Fayzulin 54' Second leg Second leg Fiorentina A 0 - 0 (a.e.t.) Rangers won 4 - 2 on penalties ==Pre-match== Zenit and Michel Platini asked the British government to ease visa procedures for Russian fans, despite Russia having cancelled visas for British fans travelling to 2008 UEFA Champions League Final in Moscow. However, the Director for British Visa Services for the CIS, Mandy Ivemy, said that \"for the U.K. government, visas and biometric checks are a vital part of immigration policy, and we are not prepared to waive them\". Meanwhile, there was a mass flow of Rangers fans into Manchester. Over a hundred thousand supporters 'invaded' the city despite the club's official ticket allocation being just 13,000 and police requests for fans to stay at home. The influx of people resulted in there being no vacant hotel rooms in a twenty-mile radius of the city and the total amount of money that was ploughed into the local economy was estimated to be around £25 million.\"100,000 Rangers fans invade Manchester\" Daily Mail (14 May 2008) Rangers' home ground, Ibrox, was opened to show a live beamback of the match to approximately 30,000 spectators. Fans queued overnight for a seat in the stadium. The capacity was reached more than two hours before kick-off. ==Match== ===Team news=== Zenit St. Petersburg were without the competition's top scorer, Pavel Pogrebnyak, who had picked up two bookings in the knockout stages of the tournament and was therefore suspended. However, they were able to call upon their other star names such as attacking midfielders Andrei Arshavin and Konstantin Zyryanov, as well as holding midfielder Anatoliy Tymoschuk. Rangers manager Walter Smith started with Jean-Claude Darcheville on his own up-front, with a five-man midfield supporting him comprising Steven Davis, Kevin Thomson, Steven Whittaker, Barry Ferguson and Brahim Hemdani. Neil Alexander was making only his tenth start in goal for Rangers, first choice keeper Allan McGregor was injured. ===Match details=== {| style=\"font- size: 90%\" cellspacing=\"0\" cellpadding=\"0\" ZENIT ST. PETERSBURG: GK 16 Vyacheslav Malafeev RB 22 Aleksandr Anyukov CB 4 Ivica Križanac CB 15 Roman Shirokov LB 11 Radek Šírl DM 44 Anatoliy Tymoschuk (c) RM 18 Konstantin Zyryanov LM 27 Igor Denisov RW 20 Viktor Fayzulin LW 10 Andrei Arshavin CF 9 Fatih Tekke Substitutes: Substitutes: Substitutes: GK 1 Kamil Čontofalský DF 5 Kim Dong-Jin MF 2 Vladislav Radimov MF 25 Fernando Ricksen MF 57 Aleksei Ionov MF 88 Olexandr Gorshkov FW 7 Alejandro Domínguez Manager: Manager: Manager: Dick Advocaat Dick Advocaat Dick Advocaat Dick Advocaat Man of the Match: Andrei Arshavin (Zenit St. Petersburg) Assistant referees: Stefan Wittberg Henrik Andren Fourth official: Martin Ingvarsson ===Match statistics=== Zenit Rangers Goals scored 2 0 Total shots 19 8 Shots on target 8 3 Ball possession 56% 44% Corner kicks 9 2 Fouls committed 12 12 Offsides 3 0 Yellow cards 2 1 Red cards 0 0 *UEFA Full Time Report ==Fan violence== The event was marred by fans rioting in Manchester city centre; these riots started after a big screen that was due to show the match had failed. BBC News 24 interrupted normal programming to broadcast the riots live on television. ITN's flagship News at Ten programme gave a lot of coverage to the riots. A Zenit fan was also attacked and stabbed. Six Rangers fans were arrested on suspicion of grevious bodily harm. ==References== Category:2008 in European football Category:2008 in England Category:Football in Manchester Category:UEFA Category:2000s in Manchester",
 "title": "2008 UEFA Cup Final"
}