{
 "id": "244652",
 "text": "Stargate is a 1994 science fiction movie, starring Kurt Russell as Colonel Jonathan Jack O'Neil, James Spader as Dr. Daniel Jackson and Jaye Davidson as Ra. Although the movie got mixed reviews from movie critics, it did very well at the box office with a revenue of $196.6 million, which was nearly four times higher than its budget of $55 million. The financial success of this movie also started the Hollywood career of Roland Emmerich and it became a cult movie. ==Plot== In a dig at Giza in 1928, scientists find a big metalic ring inscribed with hieroglyphics. Archeologist Doctor Daniel Jackson is called by the U.S. Air Force to translate hieroglyphics on the ring. They find out that the ring is actually a piece of alien technology that creates wormholes to transport people across the universe. A military team under the command of the U.S. Air Force Colonel Jonathan Jack O'Neil goes through the stargate with Jackson, and after the journey find out that they cannot get back to Earth. They find a city of ancient Egyptian-like people under the tyrannical rule of Ra, who is an alien posing as their god. They eventually kill Ra with a nuclear blast and figure out how to get back to Earth, but Jackson gets married and stays on the planet. ==Related pages== * Stargate SG-1 * Stargate Atlantis == Other websites == * * MGM official site * StarGate - The Motion Picture Fansite * * GateGuide.net - The Stargate Website Directory * Producer comments from GateWorld. Visited May 14, 2006. Category:1994 science fiction movies Category:American science fiction movies Category:French science fiction movies Category:Stargate Category:Movies set in Egypt Category:Movies set in Colorado Category:Movies set on fictional planets Category:Movies about extraterrestrial life Category:Movies about slavery Category:Movies about rebellions Category:Movies about nuclear war and weapons Category:Multilingual movies Category:Movies directed by Roland Emmerich Category:Cult movies",
 "title": "Stargate (movie)"
}