{
 "id": "244851",
 "text": "Android is an operating system used in mobile devices. It is mostly used for smartphones, like Google's own Google Pixel, as well as by other phone manufacturers like HTC and Samsung. It has also been used for tablets such as the Motorola, Xoom and Amazon Kindle Fire. A modified Linux kernel is used as Android's kernel. Google says that over 1.3 million Android smartphones are sold every day. Most mobile phones run Android, making it the most popular mobile operating system. It is also the most popular operating system in general. It supports multitasking, and both two-dimensional and three- dimensional graphics. Security updates are not provided on versions older than Android 10. Newer versions receive security updates if the phone manufacturer supports them. Phones which have Android 10 and above receive security updates (like app updates) directly from Google Play. The current stable version is Android 15, released on September 3, 2024. == Android programs == Programs for Android, also called \"apps\" (short for applications), usually come from the Google Play Store. The Android programs have a file extension of .APK. On May 7, 2019, Kotlin replaced Java as Google’s preferred language for Android app development. Java is still supported, as is C++. Google states that \"Android apps can be written using Kotlin, Java, and C++ languages\". Other languages may also be used; such as Python and Go, and those languages and even C++ may have restrictions. Large portions of the operating system itself are also written in Java. Over 2.6 million apps are available for Android in the Google Play Store. Some apps are distributed elsewhere. Android, Inc. began working on the Android operating system in 2003. In the future, Google bought it in 2005. The software development kit (SDK) for Android OS was launched on November 12, 2007, while the beta version was made available on November 5, 2007. In October 2008, the T-Mobile G1 (also known as the HTC Dream) became the first Android smartphone to be made available to the general market. Google revealed in August 2019 that the candy scheme was coming to an end and that future Android releases would instead use numerical ordering. Android 10 was the first Android version to be made available in numerical order. == Android version numbers and names == Versions of Android have a number and have had a name based on confectioneries, up to and including Android 9 Pie, but since then it has mostly been a number, with the code name usually only being used internally and by Developers and manufacturers. The version numbers and names are: Name Internal codename Version number(s) Release date Android 1.0 September 23, 2008 Android 1.1 Petit Four February 9, 2009 Android Cupcake Cupcake April 27, 2009 Android Donut Donut September 15, 2009 Android Eclair Eclair October 27, 2009 December 3, 2009 January 11, 2010 Android Froyo Froyo May 20, 2010 Android Gingerbread Gingerbread December 6, 2010 February 9, 2011 Android Honeycomb Honeycomb February 22, 2011 May 10, 2011 July 15, 2011 Android Ice Cream Sandwich Ice Cream Sandwich October 18, 2011 December 16, 2011 Android Jelly Bean Jelly Bean July 9, 2012 November 13, 2012 July 24, 2013 Android KitKat Key Lime Pie October 31, 2013 June 25, 2014 Android Lollipop Lemon Meringue Pie November 12, 2014 March 9, 2015 Android Marshmallow Macadamia Nut Cookie October 5, 2015 Android Nougat New York Cheesecake August 22, 2016 October 4, 2016 Android Oreo Oatmeal Cookie August 21, 2017 December 5, 2017 Android Pie Pistachio Ice Cream August 6, 2018 Android 10 Quince Tart September 3, 2019 Android 11 Red Velvet Cake September 8, 2020 Android 12 Snow Cone October 19, 2021 Android 12L Snow Cone v2 March 7, 2022 Android 13 Tiramisu August 15, 2022 Android 14 Upside Down Cake October 4, 2023 Android 15 Vanilla Ice Cream September 3, 2024 Android 16 Baklava November 19, 2024 ;Notes == Related pages == * Operating system * Linux * Google Nexus * Google Pixel * Samsung Galaxy * Androidland * iOS == References == == Other websites == * * Android Developers * Android Open Source Project",
 "title": "Android (operating system)"
}