{
 "id": "245241",
 "text": "Raimundo Orsi (2 December 1901 – 6 April 1986) is a former Argentine-Italian football player. He has played for Argentina national team and Italy national team. At the international level he represented both Argentina and Italy, winning the 1927 Copa América and the silver medal at the 1928 Summer Olympics in Amsterdam, Netherlands, with Argentina, as well as two editions of the Central European International Cup and the 1934 FIFA World Cup, with Italy. A left winger with great speed, he suffered from a lack of physical strength, a lack that he made up for with a refined technique and a marked ability in dribbling, often preceded by body feints. He was one of the first wingers, in Argentina, not to limit himself exclusively to making crosses for the center forward, but also to look for the conclusion, centralizing with diagonal movements; In doing so, he was facilitated by his speed and the accuracy of his shot, which was mainly carried out with his left foot. His goals directly from corner kicks are also spectacular. Considered as one of the best players of all time. ==Club career== In 1920 he made his debut in the First Division playing for Independiente. Together with Canavery, Ravaschino, Lalín and Seoane he formed an outstanding attack. At the Avellaneda club, Orsi won two Argentine First Division championships and three successive editions of the Competition Cup. In 1928 he went to Italy hired by Juventus where he obtained the greatest successes of his football career and was called up to the Italian national team. He joined the club in time for the 1928–29 season and was there until 1935, winning five consecutive Scudettos between 1931 and 1935. In his first season he confirmed his skills as a striker and scored 15 goals. In the 1930/31 and 1931/32 seasons Orsi scored 40 goals. After finishing his time in European football, he returned to his homeland in 1935 and rejoined Independiente. In 1936 he played for Boca Juniors. In 1937 he moved to Platense and in 1938 he played briefly for Almagro. He finished his campaign in foreign clubs such as Peñarol of Uruguay, Flamengo of Brazil and Santiago National of Chile, a club in which he retired from the activity. ==International career== On August 10, 1924, Orsi made his debut for the Argentine national team in a match against Uruguay. On August 29, 1927, Orsi participated in the national team in a Lipton Cup match, but in this tournament the Argentines lost 0-1 to Uruguay. In the same year, he went to his first major tournament, the South American Championship, but at the competition itself, Orsi played only one game with the Peruvian team. In 1928, Orsi, as part of the Argentine national team, went to the Olympics in Amsterdam. In the first match of the tournament, against the United States, Orsi scored his first goal for the national team in the 41st minute, and in the 73rd and second goal. In the next match, Orsi scored again. But goals were not the main thing in Orsi's arsenal at that tournament: Orsi made a huge number of passes down his left flank of the attack, beating two or three opponents at a time, after which he made assists. Already during the competition, someone called him \"Comet\", this nickname stuck to the player, and after the tournament, the name of the Olympic city of Amsterdam was added to it. In the final of the tournament, Argentina met with its long-time rival, Uruguay. The first game ended in a 1-1 draw (Orsi made an assist for Manuel Ferreira), and the Uruguayans won the second match 2-1. He played for Argentina for the last time in 1929. Orsi made his debut for the Azzuri team against Portugal national football team with 6-1 victory in 1929. In 1930, Orsi won his first title with the Italian national team, winning the Central European Cup, which became the ancestor of the European Cup. In 1934, Orsi, as part of the Italian national team, went to the World Cup, he was taken by Pozzo to the World Cup, despite the fact that Raimundo had just \"recovered\" from a broken leg received a year earlier. Orsi scored two goals at once in the first game, which silenced all critics. As a result of Italy's brilliant performance at the World Cup, it won the tournament, and Orsi himself became one of the main creators of the team's victory, equalizing the score with a cut shot from the corner of the field in the final game 8 minutes before the end of the meeting. That goal could not be recorded by any of the photojournalists present at the match, as a result, the next day Orsi had to repeat it, especially for the press. ==After Football== After his retirement he served as coach of several small Argentine clubs, with which he obtained new achievements. He died on April 6, 1986. ==Club career statistics== |- |1929–30||rowspan=\"6\"|Juventus||rowspan=\"6\"|Serie A||34||15 |- |1930–31||33||20 |- |1931–32||32||20 |- |1932–33||32||10 |- |1933–34||24||8 |- |1934–35||21||4 176||77 176||77 ==International career statistics== |- |1924||2||0 |- |1925||0||0 |- |1926||0||0 |- |1927||3||0 |- |1928||7||3 |- |1929||0||0 |- |1930||0||0 |- |1931||0||0 |- |1932||0||0 |- |1933||0||0 |- |1934||0||0 |- |1935||0||0 |- |1936||1||0 |- !Total||13||3 |} |- |1929||1||2 |- |1930||5||1 |- |1931||8||4 |- |1932||6||2 |- |1933||7||1 |- |1934||7||3 |- |1935||1||0 |- !Total||35||13 |} ==Honours== ===Club=== ;Independiente *Asociación Amateurs de Football: 1922, 1924, 1925 ;Juventus *Serie A: 1930–31, 1931–32, 1932–33, 1933–34, 1934–35 ;Flamengo *Rio State Championship: 1939 ===International=== ;Argentina * South American Football Championship: 1927 * Summer Olympics: Runner-up 1928 ;Italy * World Cup: 1934 * Central European International Cup: 1927–30, 1933–35 * Central European International Cup: Runner-up: 1931-32 ===Individual=== *FIFA World Cup Team of the Tournament: 1934 ==References== Category:1901 births Category:1986 deaths Category:Argentine footballers Category:Italian footballers",
 "title": "Raimundo Orsi"
}