{
 "id": "245424",
 "text": "{{Infobox settlement | name = Easter Island | native_name = Rapa Nui | native_name_lang = es | other_name = Isla de Pascua | settlement_type = Special Territory, Province and Commune | image_skyline = File:Moais, Isla de Pascua. - panoramio.jpg | imagesize = | image_alt = | image_caption = | image = | image_flag = Flag of Rapa Nui, Chile.svg | flag_size = | flag_alt = | flag_link = | image_seal = Logotipo de la Gobernación de Isla de Pascua.svg | image_shield = Emblem of Easter Island.svg | shield_size = | shield_alt = Coat of arms | shield_link = | image_blank_emblem = | nickname = | motto = | anthem = | image_map = Easter Island map-en.svg | mapsize = | map_alt = | map_caption = Easter Island map showing Terevaka, Poike, Rano Kau, Motu Nui, Orongo, and Mataveri; major ahus are marked with moai | image_map1 = | mapsize1 = | map_alt1 = | map_caption1 = | image_dot_map = | pushpin_map = Pacific Ocean | pushpin_label_position = | pushpin_label = | pushpin_map_alt = | pushpin_mapsize = | pushpin_map_caption = Easter Island in the Pacific Ocean | pushpin_map1 = | pushpin_label_position1 = | pushpin_label1 = | pushpin_map_alt1 = | pushpin_mapsize1 = | pushpin_map_caption1 = | pushpin_relief = 1 | coordinates = | coor_pinpoint = | coordinates_footnotes = | subdivision_type = Country | subdivision_name = | subdivision_type1 = Region | subdivision_name1 = | subdivision_type2 = Province | subdivision_name2 = | subdivision_type3 = Commune | subdivision_name3 = | established_title = | established_date = | established_title1 = | established_date1 = | established_title2 = | established_date2 = | established_title3 = Special territory status | established_date3 = | founder = | named_for = | seat_type = | seat = Hanga Roa | parts_type = | parts_style = | parts = | p1 = | p2 = | government_footnotes = | government_type = Municipality | governing_body = Municipal council | leader_party = IND | leader_title = Provincial Governor | leader_name = Laura Alarcón Rapu | leader_title1 = Alcalde | leader_name1 = Pedro Edmunds Paoa (PRO) | total_type = | unit_pref = Metric | area_footnotes = | area_magnitude = | area_total_km2 = 163.6 | area_rank = | elevation_footnotes = | elevation_m = | elevation_ft = | elevation_max_footnotes = | elevation_max_m = 507 | elevation_max_ft = 1,663 | elevation_min_footnotes = | elevation_min_m = 0 | elevation_min_ft = 0 | population_footnotes = | population_total = 7750 | population_as_of = 2017 census | population_rank = | population_density_km2 = auto | population_blank1_title = Urban | population_blank1 = | population_blank2_title = Rural | population_blank2 = | population_demonym = | population_note = | demographics_type1 = | demographics1_footnotes = | demographics1_title1 = | demographics1_info1 = | demographics1_title2 = | demographics1_info2 = | timezone = CLT | utc_offset = −6 | timezone_DST = CLST | utc_offset_DST = −5 | postal_code_type = | postal_code = | postal2_code_type = | postal2_code = | area_code_type = Country Code | area_code = +56 | geocode = | registration_plate = | blank_name_sec1 = Currency | blank_info_sec1 = Peso (CLP) | blank1_name_sec1 = Language | blank1_info_sec1 = Spanish, Rapa Nui | blank2_name_sec1 = | blank2_info_sec1 = | blank_name_sec2 = | blank_info_sec2 = | blank1_name_sec2 = | blank1_info_sec2 = | blank2_name_sec2 = | blank2_info_sec2 = | website = Municipality of Isla de Pascua | footnotes = NGA UFI=-905269 }} Easter Island is a Polynesian island in the southeastern Pacific Ocean. The capital city is Hanga Roa. It is famous for its 887 huge statues called Moai, made by the early Rapa Nui people. Easter Island also has a huge crater called Rano Kau at the edge of the island. In the crater there is a natural lake, one of only three bodies of fresh water on the island. Easter Island a UNESCO World Heritage Site. Much of the island is protected in the Rapa Nui National Park. The introduction of diseases carried by European colonizers and slave raiding devastated the population in the 1800s. Introduced animals, first rats and then sheep, were largely responsible for the island's loss of native flora. == History == The history of Easter Island is rich and controversial. Its inhabitants have suffered famines, civil war, slave raids, and near total loss of forests. The population has declined steeply more than once. The islanders have left a cultural legacy that is famous. 300–400 AD was thought to be the date of the first settlement of Easter Island, which is about the same time as the arrival of the first settlers on Hawaii. However, new results in radiocarbon dating show that Polynesia and Rapa Nui were settled between 700 to 1,100 AD. The island was most probably settled by Polynesians who navigated in canoes or catamarans from the Marquesas Islands, 3,200 km (2,000 miles) away, or the Gambier Islands (Mangareva, 2,600 km (1,600 miles) away. When Captain Cook visited the island, one of his crew members, who was a Polynesian from Bora Bora, was able to communicate with the Rapa Nui. According to oral traditions written down by missionaries in the 1860s, the island originally had a very clear class system, with an ariki, high chief, who had great power over nine other clans and their chiefs. A French navigator, Jean-Francois de Galaup, comte de La Perouse, found 2,000 people on the island when he arrived in 1786. A major slave raid from Peru in 1862, followed by epidemics of smallpox, reduced the population to only 111 people by 1877. By that time, Catholic missionaries had settled on Easter Island and begun to convert the population to Christianity, a process that was completed by the late 19th century. In 1888, Chile annexed Easter Island, leasing much of the land for sheep raising. The Chilean government appointed a civilian governor for Easter Island in 1965, and the island’s residents became full Chilean citizens. The high chief was the eldest descendent, through firstborn lines, of the island's legendary founder, Hotu Matu'a. The most visible part of the culture was the making of very large statues called moai that represented deified ancestors. It was believed that the living had a relationship with the dead where the dead provided everything the living needed. Most settlements were on the coast and moai were erected all along the coastline, watching over their descendants in the settlements before them, with their backs toward the spirit world in the sea. == Culture == The most important myths are: * Tangata manu, the Birdman cult which was practiced until the 1860s. * Makemake, is an important god. * Aku-aku, the guardians of the sacred family caves. * Moai-kava-kava a ghost man of the Hanau epe (long-ears.) == Climate and weather == The climate of Easter Island is subtropical maritime. The lowest temperatures are in July and August (18 °C) and the highest in February (maximum temperature 28 °C), the summer season in the southern hemisphere. Winters are quite mild. The rainiest month is April, though the island has year-round rainfall. ==References== Category:World Heritage Sites in South America Category:Islands of Chile",
 "title": "Easter Island"
}