{
 "id": "246276",
 "text": "The National Geographic Channel, also known as Nat Geo, is an Asian subscription television channel. It has non-fiction, programming involving nature, science, culture, and history. These programs are made by the National Geographic Society, just like Educational Broadcasting System, History Channel, the Discovery Channel and British Broadcasting Corporation. ==History== The channel was launched on August 1, 1994 in partnership with STAR TV. Star TV is a Hong Kong-based satelite television service for Asia and the Pacific. It is owned by Rupert Murdoch's News Corporation. Nat Geo replaced the NBC Asia channel on July 1, 1998. , the Asian version of National Geographic Channel was available in over 56 million homes. NGC Asia has eight different channels feeds. ==Operating Channels== * National Geographic Channel Asia - This channel has a bilingual feed with English and Cantonese in selected programs only. * National Geographic Channel India - This channel has a bilingual feed with English and Hindi in selected programs only. * National Geographic Channel Korea - With Korean subtitles. * National Geographic Channel Japan - This channel has a bilingual feed with English and Japanese in selected programs only. * National Geographic Channel MENA - Simulcast from NGC Asia from 11:00 P.M. to 5:00 A.M. HK Time. * National Geographic Channel Philippines - Same with Asia feed with local advertisement. * National Geographic Channel Taiwan - With Traditional Chinese subtitles. * National Geographic Channel Israel - With Hebrew subtitles. * National Geographic Channel HD Asia ==Related pages== * National Geographic Channel ==References== ==Other websites== * National Geographic Channel Asia * National Geographic Channel Hong Kong * National Geographic Channel Taiwan * National Geographic Channel Korea * National Geographic Channel India * National Geographic Channel Middle East * National Geographic Channel Japan * National Geographic Channel China * National Geographic Channel Israel Category:Television channels in Asia Category:News Corporation Category:1994 establishments in Asia Category:Disney companies Category:National Geographic Society",
 "title": "National Geographic (Asian TV channel)"
}