{
 "id": "246269",
 "text": "Fox was a Asian pay television channel. It was owned and operated by Fox Networks Group Asia Pacific, a compsny owned by Disney International Operations. The network operated six subnetworks. All of them were named as Fox. It had one feed for East Asia and individual feeds for Japan, Thailand, The Philippines, Taiwan, and Vietnam. All of the networks had programming with the original English audio along with either subtitling or second audio feeds in each nation's main language. It also had a deal with Tcast until the end of 2020 for a version of Fox in South Korea. == History == In Japan, the channel launched in February 1998. Other Fox channels such as Fox Crime and Fox Life (now FOX bs238) also launched at that time. In Asia, the channel began testing in December 2009. It broadcast US TV series on loop. The first Asian provider who carried Fox was SkyCable. This was in the Philippines. It launched the channel on 4 January 2010. Next was StarHub TV in Singapore on 1 February 2010. Christmas kick-off for FOX roll-out retrieved via onscreenasia.com 1-18-2009 Fox Taiwan was officially launched on 1 September 2012, as FOX Showbiz (). It replaced Channel V Taiwan. They broadcast Asian programming and some of American series reruns with Chinese subtitles. The feed was renamed Fox in January 2014 and broadcast both local and foreign programmes. In 2020, Tcast announced that it had ended its license agreement with Disney's domestic division. It changed the name of its channels after 31 December 2020. Fox in South Korea then became Ch.NOW (채널 나우). On 31 August 2021, the Fox Networks Group channels ended operations in Hong Kong. The entire group of Fox networks in Asia ended operations on 30 September 2021. This did not include networks in Taiwan and Japan. Its content transferred to Disney+ and Hotstar. On 1 January 2022, Fox Taiwan was renamed to Star World. This marked the return of Star World in Taiwan. == References == ==Other websites== Category:Television channels in Asia Category:Fox Broadcasting Company Category:1998 establishments in Asia Category:2024 disestablishments Category:2020s disestablishments in Asia",
 "title": "Fox (Asian TV channel)"
}