{
 "id": "246274",
 "text": "HBO Asia is a television network in Asia. It is a franchise of HBO. HBO Asia is now a joint venture of media giants Viacom (25%) and Time Warner (75%). Sony Pictures Entertainment and Universal Studios exited the fifteen year-old HBO Asia premium movie joint venture on January 16, 2008. == History == Launched in 1992, Singapore-based HBO Asia is a commercial-free 24-hour subscription movie channel. It also offers some original movies and series that are produced by the Emmy and Golden Globe award winning American channel, HBO. HBO Asia has five channels under its multi-channel strategy (HBO, HBO Signature, HBO HiTS, HBO Family and Max). HBO launched its first subscription Video-On-Demand service, HBO On Demand, in Hong Kong, it was launched in Singapore a year later. HBO recently launched its first regional HD channel, HBO HD, in Singapore, Hong Kong, the Philippines,Thailand and Malaysia. HBO is available in twenty-two countries throughout Asia and has closed-captioned subtitling in several local languages. == Programming == HBO Asia has licensing deals with two major Hollywood conglomerates and their film studios: Time Warner (Warner Bros. Pictures; New Line Cinema, HBO Films, Castle Rock Entertainment; Warner Independent Pictures, Franchise Pictures) and Viacom (Paramount Pictures, DreamWorks; Paramount Vantage). It also licenses movies from Columbia Pictures and many independent distributors such as Village Roadshow Pictures, Morgan Creek, Screen Gems and Universal Studios * A new movie is usually premiered on Sunday night at 9pm. After the premiere, it will be aired many times in the next seven days. * HBO Central is a monthly program giving information about which movies and series will be shown in the coming month, including Hollywood gossip and behind-the-scenes tidbits. == Channels == Network Description Website HBO HiTS Asia Shows hits and blockbuster films Official Site HBO Family Asia Shows family oriented films Official Site HBO Signature Asia Shows critically acclaimed productions Official Site HBO Shows Hollywood films and HBO Original series Official Site HBO HD Asia Shows Hollywood movies and HBO Originals in superb clear pictures HBO On Demand Asia Shows the best Hollywood films and outstanding HBO Originals at your control Official Site MAX Asia Shows action and suspense movies Official Site Screen RED HBO Asia's brand new 24-hour, Asian movie channel Official Site The HBO multiplex channels are divided into special packages. In Hong Kong, now TV's package is HBO/MAX PAK Premium while in the Philippines, SkyCable Platinum's package is THE HBO PAK. In Indonesia, First Media's package is HBO MAX PAK In Singapore, StarHub TV's package is called HBO PAK. == Censorship == ;Singapore: Since HBO Asia headquarters is in Singapore, HBO Asia has to follow Singapore Law, which means that cuts have to be made to programs such as \"Sex and the City\" and \"The Sopranos\". ;Philippines: The HBO-made series \"Entourage\" was taken off-air for three weeks by one cable operator in the Philippines pending clearance by MTRCB. The entire series continued to air without disruption on all other Philippines cable operators. ;Vietnam: Every movie with content which is considered to oppose or distort the Vietnam War, the Vietnam Communist Party or Communism is replaced by a black screen. In addition, if the Ministry of Culture and Information considers a movie has contents of a serious sexual or horrific nature not conforming with Vietnamese society, it will not be aired. == HBO in South Asia == === India === HBO Asia airs a separate PAY TV feed with commercial breaks for viewers in South Asia. The channel is labeled as HBO South Asia and often referred to as HBO India since it specifically caters to the Indian market. All movie promos in this beam are according to IST The channel is also available to viewers in Bangladesh and the Maldives. HBO South Asia took over the rights for DreamWorks movies from STAR Movies in June 2008. === Pakistan === In Pakistan, HBO is available as HBO Pakistan. It is a simulcast of HBO India with slight modifications and running in PST. Diwali ads and other adverts targeted towards India are filtered out in this beam. This beam can also be called the +0.30 version of HBO South Asia since all the programs aired on this beam are aired with a thirty minute delay. == Availability == *Malaysia **Astro *Philippines **SkyCable **Global Destiny Cable **Telmarc Cable **Cable Boss **Cablelink **Cignal Digital TV *Hong Kong **now TV *Indonesia **First Media **IndosatM2 **TelkomVision **Indovision **Astro Nusantara *Singapore **StarHub TV *China **CITV China *Macau **Macau Cable TV *Thailand **TrueVisions (also available in Cambodia and Laos) *Republic of China (Taiwan) **CNS Total TV *Vietnam **VTC's Cable television and Electronics Company (Hanoi, Ho Chi Minh City) **Tay Do CaTV (Can Tho City and Ca Mau City) **Ho Chi Minh Cable Television - HTVC (Ho Chi Minh City) **Ha Noi Cable Television - HCaTV (Ha Noi) **Vietnam Cable Television - VCTV (Ha Noi, Hai Phong, Ha Tay, Hai Duong, Ho Chi Minh City) **Song Thu Cable Company (Da Nang City) *Bangladesh *Maldives *Pakistan **PTCL Smart TV *India **Tata Sky **DishTV **Airtel digital TV **Reliance BIG TV *Sri Lanka **DialogTV **Lanka Broadband Networks **Comet Cable == Other websites == * CNS Total TV * HBO Asia official site * HBO South Asia official site * HBO HiTS official site * HBO Signature Asia Official Site * HBO Family Asia official site * MAX Category:HBO Category:Time Warner subsidiaries Category:Television channels in Asia Category:1992 establishments in Asia",
 "title": "HBO Asia"
}