{
 "id": "246572",
 "text": "Martin Gardner (October 21, 1914 – May 22, 2010) was an American writer. ==Overview== Martin Gardner had many interests and wrote about many topics. He wrote about mathematics, magic, literature, philosophy, skepticism, and religion. He wrote the \"Mathematical Games\" column in the Scientific American magazine from 1956 to 1981. After that, he wrote the \"Notes of a Fringe Watcher\" column in the Skeptical Inquirer magazine. ==Authorship== Gardner published over 70 books. He wrote under numerous pen names. As \"Uriah Fuller\" he wrote Confessions of a Psychic. As \"George Groth\", he criticized his book, The Whys of a Philosophical Scrivener. == Works == * List of Martin Gardner Mathematical Games columns === Books === * 1952 In the Name of Science G. P. Putnam's Sons * 1956 Mathematics, Magic and Mystery Dover; * 1957 Science Puzzlers The Viking Press, Scholastic Book Services * 1957 Fads and Fallacies in the Name of Science Dover; (expansion of In the Name of Science) * 1957 Great Essays in Science (editor); Prometheus Books (Reprint edition 1994) * 1957 The Wizard of Oz and Who He Was. (with Russel B. Nye) Michigan State University Press. Revised 1994. * 1958 Logic Machines and Diagrams. McGraw- Hill New York * 1960 The Annotated Alice New York: Bramhall House Clarkson Potter. Lib of Congress #60-7341 (no ISBN) * 1962 The Annotated Snark New York: Simon & Schuster. (Unabridged Hunting of the snark with introduction and extensive notes from Gardner). 1998 reprint, Penguin Classics; * 1962 Relativity for the Million New York: MacMillan Company (o.p.). Revised and updated 1976 as The Relativity Explosion New York: Vintage Books. Revised and enlarged 1996 as Relativity Simply Explained New York: Dover; * 1964 The Ambidextrous Universe: Mirror Asymmetry and Time-Reversed Worlds (Revised ed., 1990 as The New Ambidextrous Universe: Symmetry and Asymmetry from Mirror Reflections to Superstrings; 3rd ed., 2005, Dover; ) * 1965 The Annotated Ancient Mariner New York: Clarkson Potter, Reprint. Prometheus. * 1967 Annotated Casey at the Bat: A Collection of Ballads about the Mighty Casey New York: Clarkson Potter. Reprint. Chicago: University of Chicago Press, 1984. Reprint. New York: Dover, 1995. * 1973 The Flight of Peter Fromm, Los Altos, California: William Kaufmann, Inc. Prometheus Books; Reprint edition (1994) * 1975 Mathematical Carnival: A New Round-up of Tantalizers and Puzzles from \"Scientific American\", Knopf Publishing Group; * 1976 The Incredible Dr. Matrix, New York, Charles Scribner's Sons; * 1978 Aha! Insight, W.H. Freeman & Company; * 1981 Science: Good, Bad, and Bogus, Prometheus Books; (paperback), (hardback), (Avon pocket paperback) * 1981 Entertaining Science Experiments With Everyday Objects; Dover; * 1982 Aha! Gotcha: Paradoxes to Puzzle and Delight (Tools for Transformation); W.H. Freeman & Company; * 1983 The Whys of a Philosophical Scrivener, 1999 reprint St. Martin's Griffin; * 1983 Order and Surprise, Prometheus Books, * 1984 Codes, Ciphers and Secret Writing (Test Your Code Breaking Skills), Dover; * 1985 Magic Numbers of Dr Matrix, Prometheus Books; * 1986 Entertaining Mathematical Puzzles, Dover; * 1987 The No-Sided Professor and other tales of fantasy, humor, mystery, and philosophy, Prometheus Books; * 1987 The Annotated Innocence of Father Brown Oxford University Press, (Notes by Gardner, on G. K. Chesterton’s stories). * 1987 Riddles of the Sphinx Mathematical Association of American, (collection of articles from Isaac Asimov's Science Fiction Magazine) * 1987 Time Travel and Other Mathematical Bewilderments, W.H. Freeman & Company; * 1988 Perplexing Puzzles and Tantalizing Teasers, Dover; * 1988 New Age: Notes of a Fringe Watcher, Prometheus Books; (collection of \"Notes of a Fringe Watcher\" columns) * 1990 More Annotated Alice, Random House; (a \"supplement\" to The Annotated Alice) * 1991 The Unexpected Hanging and Other Mathematical Diversions, University Of Chicago Press; Reprint edition; * 1991 The Annotated Night Before Christmas: A Collection Of Sequels, Parodies, And Imitations Of Clement Moore's Immortal Ballad About Santa Claus Edited, with an introduction and notes, by Martin Gardner, Summit Books (Reprinted, Prometheus Books, 1995); * 1991 Fractal Music, Hypercards and More; W. H. Freeman * 1992 On the Wild Side, Prometheus Books; (collection of \"Notes of a Fringe Watcher\" columns) * 1993 The Healing Revelations of Mary Baker Eddy, Prometheus Books, * 1994 My Best Mathematical and Logic Puzzles, Dover; * 1995 Classic Brainteasers, Sterling Publishing; * 1995 Urantia: The Great Cult Mystery, Prometheus Books; * 1996 Weird Water & Fuzzy Logic: More Notes of a Fringe Watcher, Prometheus Books; (collection of \"Notes of a Fringe Watcher\" columns) * 1997 The Night Is Large : Collected Essays, 1938-1995, St. Martin's Griffin; * 1998 Calculus Made Easy, St. Martin's Press; Revised edition (Revisions and additions to the 1910 calculus textbook by Silvanus P. Thompson.) * 1998 Martin Gardner's Table Magic, Dover; * 1998 Mathematical Recreations: A Collection in Honor of Martin Gardner, edited by David A. Klamer, Dover; This book is a reprint of The Mathematical Gardner, published by Wadsworth. Mathematicians wrote this book to thank Gardner when he retired from writing his Scientific American column in 1981. Important mathematicians submitted papers for this book. This shows Gardner's importance. * 1999 Gardner's Whys & Wherefores Prometheus Books; * 1999 The Annotated Alice: The Definitive Edition ; W.W. Norton & Company; * 1999 The Annotated Thursday: G. K. Chesterton's Masterpiece, the Man Who Was Thursday by G. K. Chesterton, Edited by Martin Gardner. * 2000 From the Wandering Jew to William F. Buckley, Jr. : On Science, Literature, and Religion, Prometheus Books; * 2000 The Annotated Wizard of Oz, New York: W.W. Norton & Company; (introduction) * 2001 A Gardner's Workout: Training the Mind and Entertaining the Spirit * 2001 Mathematical Puzzle Tales; Mathematical Association of America (collection of articles from Isaac Asimov's Science Fiction Magazine) * 2001 Did Adam and Eve Have Navels?: Debunking Pseudoscience, W.W. Norton & Company; (collection of \"Notes of a Fringe Watcher\" columns) * 2002 Martin Gardner's Favorite Poetic Parodies Prometheus Books; * 2003 Are Universes Thicker Than Blackberries?: Discourses on Gödel, Magic Hexagrams, Little Red Riding Hood, and Other Mathematical and Pseudoscientific Topics, (collection of \"Notes of a Fringe Watcher\" columns and others) * 2004 Smart Science Tricks, Sterling; * 2007 The Jinn from Hyperspace: And Other Scribblings—both Serious and Whimsical, Prometheus Books; * 2008 Bamboozlers: The Book of Bankable Bar Betchas, Brain Bogglers, Belly Busters & Bewitchery by Diamond Jim Tyler, Diamond Jim Productions; (introduction) * 2009 When You Were a Tadpole and I was a Fish and other Speculations about This and That, Hill and Wang; * 2009 The Upside-Down World of Gustave Verbeek, Sunday Press Books; (introduction) * (For a downloadable version of The Mathemagician and the Pied Puzzler, another tribute book, see other websites below) Note: Gardner also wrote some books on magic for professional magicians. These books are not listed here. === Collected Scientific American columns === Martin Gardner's columns from Scientific American are printed in 15 books. Don Knuth calls these books \"the Canon\". * Hexaflexagons and Other Mathematical Diversions: The First Scientific American Book of Puzzles and Games 1959; University of Chicago Press 1988 (originally published as The Scientific American Book of Mathematical Puzzles and Diversions) * The Second Scientific American Book of Mathematical Puzzles and Diversions 1961; University of Chicago Press 1987; * Martin Gardner's New Mathematical Diversions from Scientific American 1966; Simon and Schuster; reprinted by Mathematical Association of America 1995 * Numerology of Dr. Matrix 1967; reprinted/expanded as The Magic Numbers of Dr. Matrix; Prometheus Books; / * Unexpected Hangings, and Other Mathematical Diversions Simon & Schuster 1968; reprinted by University of Chicago Press, 1991 * The Sixth Scientific American Book of Mathematical Puzzles and Diversions Simon & Schuster 1971 * Mathematical Carnival Vintage 1975; reprinted by Mathematical Association of America * Mathematical Magic Show Vintage 1977; reprinted by Mathematical Association of America * Mathematical Circus Vintage 1979; reprinted by Mathematical Association of America * Wheels, Life, and Other Mathematical Amusements 1983; W. H. Freeman & Co. * Knotted Doughnuts and Other Mathematical Entertainments 1986; W. H. Freeman & Co. * Time Travel and Other Mathematical Bewilderments 1988; W. H. Freeman & Co. * Penrose Tiles to Trapdoor Ciphers 1989; W. H. Freeman & Co. ; reprinted by Mathematical Association of America * Fractal Music, Hypercards and More 1991; W. H. Freeman * Last Recreations: Hydras, Eggs, and other Mathematical Mystifications 1997; Springer Verlag; Three other books print some or all of Martin Gardner's columns from Scientific American: * The Colossal Book of Mathematics: Classic Puzzles, Paradoxes, and Problems 2001; W.W. Norton & Company; (a \"best of\" collection) * Martin Gardner's Mathematical Games 2005; Mathematical Association of America; (CD-ROM of all fifteen books above, encompassing all articles in the column) * The Colossal Book of Short Puzzles and Problems 2006; W.W. Norton & Company; == Other websites == === Interviews === * 1979 interview with Gardner by Anthony Barcellos for the College Mathematics Journal * 1998 interview with Gardner by Kendrick Frazier for the Skeptical Inquirer * 2004 interview with Gardner (PDF) by Allyn Jackson for the AMS Notices * The Martin Gardner Interview (2005) - Cambridge University Press blog - Part 1 * The Martin Gardner Interview (2005) - Cambridge University Press blog - Part 2 * The Martin Gardner Interview (2005) - Cambridge University Press blog - Part 3 * The Martin Gardner Interview (2005) - Cambridge University Press blog - Part 4 * The Martin Gardner Interview (2005) - Cambridge University Press blog - Part 5 * 2006 interview with Gardner by Colm Mulcahy for the MAA Online website === Tributes === * James Randi's notes on Gardner, written in the 1960s * A short Martin Gardner Bio * About Gathering for Gardner * (2587) Gardner asteroid * On-line Gardner bibliography * Gardner, Martin. \"David Bohm and J. Krishnamurti\" , Skeptical Inquirer, July 2000. * Gathering for Gardner conference site , G4G, includes downloadable Gardner tribute e-book (The Mathemagician and Pied Puzzler) === Obituaries === * A tribute to Martin Gardner, London Times, 05/24/2010 * Martin Gardner, 95, a journalist, provided in-depth analysis of Lewis Carroll's Cheshire Cat (Washington Post obituary, May 24, 2010) * Martin, Douglas, “Martin Gardner, Puzzler and Polymath, Dies at 95” ; New York Times, May 23, 2010. == References == Category:1914 births Category:2010 deaths Category:American mathematicians Category:American magicians Category:Writers from Tulsa, Oklahoma Category:Scientists from Tulsa, Oklahoma Category:Skeptics",
 "title": "Martin Gardner"
}