{
 "id": "246678",
 "text": "{{Infobox philosopher | region = Muslim scholar | era = Modern era | color = #B0C4DE | image_size = 200px | image = Fetullahgulen.png | name = Fethullah Gülen | birth_name = Muhammed Fethullah Gülen | birth_date = | birth_place = Erzurum, Turkey | death_date = | death_place = Pennsylvania, U.S. | death_cause = | religion = Islam | citizenship = Turkey | nationality = | ethnicity = | school_tradition = Hanafi, Sufi | alma_mater = | main_interests = Sufism, Mainstream Islamic thought, education, interfaith dialogue among the People of the Book | influences = Rumi, Yunus Emre, Ibn Arabi, Al-Ghazali, Said Nursi | influenced = | notable_ideas = Service (hizmet); interfaith dialogue; civil society | signature = Fethullah Gulen signature.svg }} Muhammed Fethullah Gülen (27 April 1941 - 20 October 2024), better known as Fethullah Gülen, was a Turkish preacher, author, educator and Muslim scholar. He lived in self-imposed exile in Pennsylvania, United States. Gülen taught a moderate version of Sunni / Hanafi Islam, derived from Said Nursi's teachings and modernizing them. Gülen condemns terrorism, supports communication between people of different religions, and has initiated dialogue with the Vatican and some Jewish organisations.Toward a Global Civilization of Love and Tolerance Until 2013 he was an ally of President Recep Tayyip Erdoğan, who later blamed him for the 2016 Turkish coup d'état attempt. He operated a worldwide organisation called the Gülen Movement also known as FETÖ. https://www.bbc.co.uk/news/world-europe-36855846 ==Teachings== Fethullah Gülen's attitude towards hijab changed over time.Fethullah Gülen yazı dizisi, Cumhuriyet Erişim 19/09/2012 In the past, Gülen, who regarded the unwinding of even a strand of women's hair as a great sin, suggested that women should cover their whole body by using veils and gloves. In his last speeches, Gülen evaluated the headscarf as a \"füruat\" (minor details).http://www.tesbihat.asia/joomla/index.php/dinleraras-diyalog/fethullah-guelen/tuerkiye-nas-l-kusat-ld/2347-son-20-y-ld-r-her-huekuemette-fethullahc-bakanlar-oldu.htmlhttp://www.tesbihat.asia/joomla/index.php/fethullah-guelen/yalanlar/88-kadn-ve-tuerban.html Creationism: According to Gülen, the Universe is a work of creation that has a purpose, and the purpose of existence is to know Allah and science can gain value if it serves this purpose. For him, to allow views opposed to belief in creation is a devastating delusion and evolution is a Darwin fallacy. According to Gülen, the creation of Adam as the first human and Eve from Adam's file bone are miracle creations that should not be addressed in the context of cause-effect relationship. He wrote his anti-evolutionary ideas in his book \"The Truth of Creation and Evolution\". This book was prepared by compiling his speeches at the meetings he held against Darwinism and evolution. In the book he states that biology science is a \"fantasy\" and that the greatest biology fantasy is the theory of evolution. ==Death== Gülen died at a hospital in Pennsylvania on October 20, 2024 at the age of 83. He was being treated for heart and kidney failure. ==References== ==Other websites== * * Fethullah Gulen * Hizment and Fethullah Gulen * Love is a Verb (2014), a film directed by Terry Spencer Hesser ** ** ** IMDb * Who Is Fethullah Gülen? * Category:1941 births Category:2024 deaths Category:Creationists Category:Turkish educators Category:Islamic religious leaders Category:Turkish writers Category:Hanafis Category:Deaths from heart failure Category:Deaths from renal failure Category:Disease-related deaths in Pennsylvania",
 "title": "Fethullah Gülen"
}