{
 "id": "246774",
 "text": "Human penis size is talked about by length and circumference of penis. It is longer than in other primates except for the chimpanzee. The chimpanzee's penis is about the same length. The average human erect penis is about in length, the circumference is about . There is no scientific relation between either penis size or race, and shoe size or stretched penis size. At birth the penis is between , at the beginning of puberty, it is 6 cm. Penis size does not change much during adulthood. ==Studies== A review about penis size was published in 2015 by Veale et al. This review analyzes many studies which published in past 30 years. By this review the average length of soft(not erect) penis is 9.16 cm, stretched soft penis length is 13.24 cm, erect penis length is 13.12 cm. And the average circumference of soft penis is 9.31 cm and erect penis is 11.66 cm. In these studies erect penis length is measured from the root of the penis to the tip of the glans along the upper side of the penis. The fat pad at the root of the penis is pushed to the pubic bone. The circumference of the penis is measured at the base or mid-shaft of the penis. * 1996 Journal of Urology, USA, 80 men, average erect length 12.89 cm (not include pre-pubic fat pad depth), average erect circumference 11.30 cm * 2007 International Journal of Impotence Research, India, 301 men, average erect length 13.01 cm, average erect circumference 11.46 cm * 2001 Urology, Germany, 111 men, average erect length 14.48 cm * 2002 Annals of Plastic Surgery, Turkey, 200 men, average erect length 12.73 cm ==Popular culture== Widespread private concerns have led to a number of folklore sayings and popular culture reflections related to penis size. There is belief that it is possible to predict the size of someone's penis by observing other bodily features such as the hands, feet, nose or height. The media has equated a man's penis size with both power and masculinity. The perception of having a large penis is linked to higher self-esteem. ==Penis size and female genital response== Many men exaggerate the importance of deep vaginal penetration in stimulating a woman to orgasm. The most sensitive area of the female genitals includes the clitoris and the section of vagina closest to the outside of a woman's body (G-spot). The vagina is roughly in length. The majority of penises are likely of sufficient length to fully satisfy their partners. Some women find stimulation of the cervix by penis as uncomfortable or painful, others report it to be key to orgasm. The cervix may be confused with the deepest point of the vagina, above and below the cervix, respectively making it possible for there to be indirect and/or simultaneous stimulation between them. During arousal, the vagina lengthens rapidly to an average of about 10 centimetres, but can continue to lengthen in response to pressure. The walls of the vagina are composed of soft elastic folds of mucous membrane skin which stretch or contract (with support from pelvic muscles) to the size of the penis. With proper arousal, the vagina stretches or contracts to accommodate virtually any size penis, from small to large. == History == Ancient Romans admired the large penis of Priapus. Ancient Greek art was not obsessed with penis size. A passage from Aristophanes lists broad shoulders, tiny tongue, strong buttocks, and a little penis as the most desirable masculine features. In medieval Arabic literature, a longer penis was preferred, but Afro-Arab author Al-Jahiz wrote: \"If the length of the penis were a sign of honor, then the mule would belong to the (honorable tribe of) Quraysh\". ==Micropenis== An adult penis with an erect length of less than , but otherwise formed normally, is referred to as having the micropenis condition. Some of the causes are deficiency of pituitary growth hormone and/or gonadotropins, mild degrees of androgen insensitivity, a variety of genetic syndromes, and variations in certain homeobox genes. Some types of micropenis can be addressed with growth hormone or testosterone treatment in early childhood. About 0.6% of males are in the micropenis condition. ==Gallery== File:Human Penis with Glans Exposed.jpg|Front view of a relaxed (flaccid) penis, typical length File:Erect pennis.jpg|Shorter than average erect penis length ==References== == Other websites == *Who says the penis size is not important by Simon Chan *Kinsey Institute on the penis Category:Male reproductive system penis",
 "title": "Human penis size"
}