{
 "id": "246734",
 "text": "Istanbul Park, also known as the Istanbul Racing Circuit or initially Istanbul Otodrom, is a motor sports racetrack(a place where cars drive with each other to see who is fastest) in Akfırat County east of Istanbul, Turkey. It opened on 21 August 2005. It has been called \"the best race track in the world\" by Formula One(a type of sport) leader Bernie Ecclestone.BBC Sport: Turkey to keep F1 race until 2021 The main use of the circuit (track) is the Formula One Turkish Grand Prix. Istanbul Park is in Pendik district on the Asian side of Istanbul(a city). It is close to the TEM motorway (a highway), that connects Istanbul to Ankara, the capital of Turkey. It is near the new Sabiha Gökçen International Airport(a place where planes(stuff that can fly) fly to and from). It is in an area with a lot of trees and fields. The track is long, and has an average width of . The main straight is over in length. The track has 14 corners. Istanbul Park were designed by the racetrack architect Hermann Tilke. It can hold 155,000 people to watch a race. The main grandstand(a place where people sit) has seats for 25,000 people. The track does have some critics(people who do not like it). After qualifying(a thing in Formula One, which is a type of sport), Jenson Button(a person who is doing Formula One, a sport) said the track was too bumpy. Jarno Trulli(also a person doing Formula One, a sport) did not think the track as hard enough to challenge(making it hard for people) the drivers. == Features == Designer - Hermann TilkeTilke GmbH: Istanbul Park Capacity - 26,250 permanent covered seats, 125,000 temporary seats Building Area - 220 hectare (10,000 square metres) Race Track Area - 8 hectare (10,000 square metres) == Major Motorsports Events == The main race at Istanbul Park is the Formula One Turkish Grand Prix. The track also hosts the GP2 series, and the Turkish motorcycle Grand Prix. The track has also hosted FIA World Touring Car Championship, Formula-G, Deutsche Tourenwagen Masters (DTM) and the Le Mans Series 1,000 km race. == Use in simulations / games == The track is included in the 2008 video game(a thing where people can play against each other and make as if it is real life), Race Driver: GRID from Codemasters, as well as in the 2008 PC simulator GTR Evolution by SimBin. == References and notes == ==Other websites== * Istanbul Park homepage * Track info from the official Formula1 website Category:Formula One circuits Category:Istanbul",
 "title": "Istanbul Park"
}