{
 "id": "246891",
 "text": "Joseph Carl Bailey, Jr.WrestlingZone.ru : JC Bailey (August 23, 1983 – August 30, 2010) was an American professional wrestler. He was better known as J. C. Bailey. He has wrestled for numerous American-based professional wrestling promotions, including Combat Zone Wrestling (CZW), IWA Mid-South and IWA East Coast. He has been known as a hardcore wrestler.CAGEMATCH.de : JC Bailey Bailey made his debut in 2001. In June 2003, along with the owner of the promotion IWA Mid-South Ian Rotten and Corporal Robinson, he \"invaded\" CZW on behalf of IWA Mid-South. In the same year, he competed in the 2nd CZW Tournament of Death where he lost to Nick Mondo in a deathmatch involving light tubes,Online World of Wrestling : Combat Zone Wrestling - Tournament of Death 2 and the 5th IWA Mid-South King of the Deathmatch where he lost to Mad Man Pondo after defeating 2 Tuff Tony, Necro Butcher and Ian Rotten.Online World of Wrestling : IWA Mid-South (2003) In 2004, he competed in the 3rd CZW Tournament of Death where he lost to Wifebeater after defeating Chri$ Ca$h,Online World of Wrestling : Combat Zone Wrestling - Tournament of Death 3 and the 6th IWA Mid-South King of the Deathmatch where he lost to Mad Man Pondo and Toby Klein.Online World of Wrestling : IWA Mid-South (2004) Since then, he competed in many deathmatch tournaments including the 4th CZW Tournament of Death,Online World of Wrestling : Combat Zone Wrestling - Tournament of Death 4 7th IWA Mid-South King of the Deathmatch,Online World of Wrestling : IWA Mid-South (2005) 8th IWA Mid-South King of the Deathmatch,Online World of Wrestling : IWA Mid-South (2006) 5th CZW Tournament of DeathOnline World of Wrestling : Combat Zone Wrestling - Tournament of Death 5 and 6.5th CZW Tournament of Death titled \"Fast Forward\".Online World of Wrestling : Combat Zone Wrestling (2007) On December 11, 2004, he teamed with Chri$ Ca$h, Nate Webb and Sexxxy Eddy, winning the CZW World Tag Team Championship.Combat Zone Wrestling : TITLE HISTORY On February 5, 2005, he became the first-ever CZW Ultraviolent Underground Champion. On August 13, 2005, he won his second CZW Ultraviolent Underground Championship. On August 20, 2006, he went to Japan and competed in the professional wrestling tournament WRESTLE EXPO 2006 where he lost to 2 Tuff Tony after defeating Mad Man Pondo.Yahoo! Sportsnavi : WRESTLE EXPO 2006 results On September 16, 2006, he competed in the 1st IWA East Coast Masters of Pain where he lost to Jun Kasai after defeating 2 Tuff Tony and Corporal Robinson.CAGEMATCH.de : IWA East Coast Masters Of Pain 2006 In 2007, Bailey was arrested for stealing a television set from a Bardstown, Kentucky Walmart. He made his official return to CZW in early 2010. On August 30, 2010, Bailey was found dead. He died in his sleep. Before he died, Bailey complained that he had been getting headaches and numbness in his hands. The cause of his death was later determined to be because of a brain aneurysm that was caused by complications from multiple concussions and traumas to his brain. His brain is expected to be donated for research at Boston University. ==References== ==Other websites== * Category:1983 births Category:2010 deaths Category:American professional wrestlers Category:Sportspeople from Louisville, Kentucky Category:Deaths from intracranial aneurysm",
 "title": "J. C. Bailey"
}