{
 "id": "246996",
 "text": "Petri Pasanen (born 24 September 1980) is a Finnish football player. He plays for F.C. Red Bull Salzburg in the Austrian Bundesliga and the Finland national team. He plays as central defender but also can play left or right back. ==Career== He started with Kuusysi Lahti and soon raised the interest of European top teams. In 2000, he went to Ajax Amsterdam and became a regular player in the first squad. In August 2001 he broke his leg and missed most of the 2001/02 season. After his injury he came back to the team. With Ajax he reached the quarterfinals of the UEFA Champions League in the 2003/04 season. During the second half of the 2003/04 season he was on loan at English club Portsmouth in the Premier League. Portsmouth manager Harry Redknapp was interested in buing Pasanen at the end of the season, but the price was to high. So Pasanen signed with SV Werder Bremen in the German Bundesliga. After the end of his contract on 30 June 2011 he left Werder Bremen and signed for Red Bull Salzburg in the Austrian Bundesliga. He became a regular player from the beginning. Pasanen is also a regular for the Finland national team. He made his international debut on 15 November 2000 against the Republic of Ireland. Pasanen has mostly played at right back for Finland, and has also served as the national team's captain, when Sami Hyypiä and Jari Litmanen have not played. Pasanen has also played in Finland national futsal team, where he has six caps and two goals. ==Honours== Ajax *Eredivisie: 2001–02 *KNVB Cup: 2001–02 *Johan Cruijff Shield: 2002 Werder Bremen *DFB Ligapokal: 2006 *DFB- Pokal: 2008–09 ==Club career statistics== |- |1996||Kuusysi Lahti||Ykkönen||2||0 |- |1997||Lahti||Ykkönen||15||0 |- |1997||rowspan=\"2\"|Hämeenlinna||rowspan=\"2\"|Ykkönen||4||0 |- |1998||1||0 |- |1998||rowspan=\"3\"|Lahti||Ykkönen||15||1 |- |1999||rowspan=\"2\"|Veikkausliiga||27||0 |- |2000||15||1 |- |2000/01||rowspan=\"4\"|Ajax||rowspan=\"4\"|Eredivisie||29||4 |- |2001/02||1||0 |- |2002/03||22||3 |- |2003/04||7||0 |- |2003/04||Portsmouth||Premier League||11||0 |- |2004/05||rowspan=\"6\"|Werder Bremen||rowspan=\"6\"|Bundesliga||23||1 |- |2005/06||17||0 |- |2006/07||17||0 |- |2007/08||28||2 |- |2008/09||16||0 |- |2009/10|||| 79||2 59||7 11||0 101||3 250||12 |} ==International career statistics== |- |2000||1||0 |- |2001||5||0 |- |2002||5||0 |- |2003||6||0 |- |2004||8||0 |- |2005||3||0 |- |2006||7||0 |- |2007||10||0 |- |2008||3||0 |- |2009||9||0 |- !Total||57||0 |} ==References== Category:1980 births Category:Living people Category:Finnish footballers Category:FC Red Bull Salzburg players Category:Portsmouth F.C. players Category:Sportspeople from Lahti",
 "title": "Petri Pasanen"
}