{
 "id": "247338",
 "text": "The Oxfordshire Ironstone Railway (the O.I.R.) was a standard gauge railway that served an ironstone quarry near the village of Wroxton in Oxfordshire. It linked to the Great Western Railway about to the east, just north of the town of Banbury. Both the quarry and line opened in 1917 and closed in 1967, when the Ironstone ran out. It never became part of British Rail and was run by the quarry's owners. The quarry was heavily worked in the Second World War, due to extra war needs. A newer quarry close by is now served by trucks only. The OIR operated its own fleet of steam locomotives: 0-6-0T, 0-6-0ST and 0-4-0ST's. Heavy clay and Ironstone deposits surround Banbury.http://docs.google.com/viewer?a=v&q;=cache:sppuMpvgMg8J:www.oum.ox.ac.uk/learning/pdfs/oxmin.pdf+clay+pits+in+banbury&hl;=en≷=uk&pid;=bl&srcid;=ADGEESgn- Yi-g1qgnV32eBJ5Bi24KzjITDU7kcw_uL- KWGxPnzzgLbT8n9stdyOyB9bxEnAdJs1yyzKFGNwmj0NWApex23PAad6KTYb4lJdKEqLBNLnqifn3yk8Xc8Fp- ya8DY20dPo5&sig;=AHIEtbREJLbdRHQ5aetZoqTAk3mdY2Gy0w ==Related pages== * Welsh Highland Railway *Quarry *Slate pit *Clay pit *Coal mine *Mineral railway ==Historic imagery of the site== File:Pin hill gradeing works.JPG|A picture of the former Wroxton Qarry's Pin Hill farm grading works in Banbury, Oxfordshire in 2001. File:Wroxton iron mine 1.jpg|Picture of the former ironstone quarry works at Wroxton in 2001. File:Woxton-Banbury Mineral line 1.png|Pictures of the surviving huts at the former quarry in 2001 and the track bed in Hardwick during 2001. File:Woxton-Banbury Mineral line 2.JPG|A picture of the mine manager's office in 2001. File:Wroxton qarry a1.png|A picture of the former ironstone quarry works at Wroxton in 2001. File:Wroxton OIR tool shed.JPG|A picture of Drayton's OIR mine's tool shed or possible staff privy in 2003. File:Wroxton OIR P-hut.JPG| Oxfordshire Ironstone Railway's OIR P-hut at Drayton, Oxfordshire in 2005. At the far right is a pile of rubble was ware a signal post used to be. File:Wroxton tool shed 2002.jpg|Horley's OIR derelict tool hut or a p-hut in 2002. It's overgrown and in the bushes now. File:Wroxton qarry ruins.JPG| Some shots of Wroxton's old ironstone mine in 2001. File:Horley tool shed or p-hut 1.png|Horley's OIR tool hut or a p-hut in 2001. It's overgrown and in the bushes now. File:Horley tool shed or p-hut 2.JPG|Horley's OIR tool hut or a p-hut in 2001. It's overgrown and in the bushes now. File:OIR Babury Bridge.JPG|The former OIR bridge supports by the former Alcan works in Banbury in 2001. File:OIR track pin at Drayton.JPG|A OIR track to sleeper pin in Drayton. The words stamped on it say it was made by the Great Western Railway in 1928. It was found in 2002. File:OIR Drayton tool shed in 2004.png|Drayton's OIR tool shed in 2004. File:OIR Hardwick pipe in 2000.png| A broken old pipe in Hardwick. It is not part of any mains system I know of and looks very old and corroded, so it was probably part of the OIR's grading works. ==References== ==Other websites== *Photo gallery of the disused railway# *# *# *# *http://www.geograph.org.uk/photo/199174 *http://www.geograph.org.uk/photo/199177 *http://apollopark.uk/ *http://www.deddingtonhistory.uk/ironstone/ironstonepics.html *http://www.geograph.org.uk/photo/199174 *http://www.geograph.org.uk/photo/199177 *http://www.steve- banks.org/prototype-and-traffic/202-banbury-yards-and-freight *http://www.geograph.org.uk/photo/199179 *http://www.wow.com/wiki/Oxfordshire_Ironstone_Railway *http://www.rightmove.co.uk/house-prices/OX16/Pinhill-Road.html *Photo gallery of the disused railway Category:Oxfordshire Category:Defunct railway companies of the United Kingdom Category:1917 establishments in Europe Category:1910s establishments in the United Kingdom Category:1967 disestablishments in the United Kingdom",
 "title": "Oxfordshire Ironstone Railway"
}