{
 "id": "247484",
 "text": "ELIZA is an early program able to process natural language. ELIZA operated by processing users' responses to scripts. The most famous script was called DOCTOR. It was a simulation of a Rogerian psychotherapist. Eliza didn't know much about thought or emotion. However, DOCTOR sometimes provided conversation like a human. ELIZA was written at MIT by Joseph Weizenbaum between 1964 and 1966. When the person used words that were not in the very small list, DOCTOR might say, for example, responding to \"My head hurts\", \"Why do you say your head hurts?\" The response to \"My mother hates me\" might be \"Who else in your family hates you?\" ELIZA was programmed using simple pattern matching techniques, but was taken seriously by several of its users, even after Weizenbaum explained to them how it worked. It was one of the first chatterbots in existence. ==Implementations== * Using Java, and based very closely on Weizenbaum's published description of the program: http://www.chayden.net/eliza/Eliza.html * Using z80 Assembly on the TI-83 Plus: ticalc.org * Trans-Tex Software has released shareware versions for Classic Mac OS and Mac OS X: Trans-Tex Software * `doctor.el` (circa 1985) in Emacs lisp: http://www.cs.cmu.edu/afs/cs/project/ai- repository/ai/areas/classics/eliza/emacs/0.html. * Source code in Tcl: http://wiki.tcl.tk/9235 * Source code in BASIC: http://www.atariarchives.org/bigcomputergames/showpage.php?page=22 ==Related pages== * 20Q * Artificial intelligence * Chatterbot * Loebner prize * Turing test == Notes == ==References== * * * == Other websites == * dialogues with colorful personalities of early AI , a collection of dialogues between ELIZA and various conversants, such as a company vice president and PARRY (a simulation of a paranoid schizophrenic) * Weizenbaum. Rebel at work - Peter Haas, Silvia Holzinger, Documentary movie with Joseph Weizenbaum and ELIZA. * Questsin - MSN Messenger implementation of ELIZA * CounterCounseling - Source code in C (programming language), Windows Category:Software",
 "title": "ELIZA"
}