{
 "id": "247404",
 "text": "The 3. Liga is the 3rd division of football in Germany. It replaced the Regionalliga as the 3rd division of Germany in 2008. == Current clubs == === List === Team Location Stadium Capacity Erzgebirge Aue Aue-Bad Schlema Erzgebirgsstadion 15,711 Arminia Bielefeld Bielefeld Schüco-Arena 27,300 Borussia Dortmund II Dortmund Stadion Rote Erde 9,999 Dynamo Dresden Dresden Rudolf-Harbig-Stadion 32,085 MSV Duisburg Duisburg Schauinsland-Reisen-Arena 31,500 Rot-Weiss Essen Essen Stadion an der Hafenstraße 20,650 SC Freiburg II Freiburg im Breisgau Dreisamstadion 24,000 Hallescher FC Halle Leuna Chemie Stadion 15,057 FC Ingolstadt Ingolstadt Audi Sportpark 15,000 Viktoria Köln Cologne Sportpark Höhenberg 8,343 VfB Lübeck Lübeck Stadion an der Lohmühle 17,849 Waldhof Mannheim Mannheim Carl-Benz-Stadion 25,667 1860 Munich Munich Grünwalder Stadion 15,000 Preußen Münster Münster Preußenstadion 14,300 Jahn Regensburg Regensburg Jahnstadion Regensburg 15,210 1\\. FC Saarbrücken Saarbrücken Ludwigsparkstadion 16,003 SV Sandhausen Sandhausen GP Stadion am Hardtwald 15,414 SSV Ulm Ulm Donaustadion Städtisches Waldstadion1 19,500 14,500 SpVgg Unterhaching Unterhaching Sportpark Unterhaching 15,053 SC Verl Verl Sportclub Arena 5,153 1 SSV Ulm will play at least five games in Aalen cause their own stadium has no Under-soil heating. === Map === ==Top scorers== Season Player Goals Club 2008–09 Anton Fink 21 SpVgg Unterhaching 2009–10 Régis Dorn 22 SV Sandhausen 2010–11 Domi Kumbela Patrick Mayer 19 Eintracht Braunschweig 1\\. FC Heidenheim 2011–12 Marcel Reichwein 17 Rot-Weiß Erfurt 2012–13 Anton Fink Fabian Klos 20 Chemnitzer FC Arminia Bielefeld 2013–14 Dominik Stroh-Engel 27 Darmstadt 98 2014–15 Fabian Klos 23 Arminia Bielefeld 2015–16 Justin Eilers 23 Dynamo Dresden 2016–17 Christian Beck 17 1. F.C. Magdeburg 2017–18 Manuel Schäffler 22 Wehen Wiesbaden 2018–19 Marvin Pourié 22 Karlsruher S.C. 2019–20 Kwasi Okyere Wriedt 24 Bayern Munich II ==Related pages== * Bundesliga * 2. Bundesliga * Regionalliga ==References== Category:Football leagues in Germany",
 "title": "3\\. Liga"
}