{
 "id": "247593",
 "text": "Gianpiero Combi (20 November 1902 – 12 August 1956) is a former Italian football player. He has played for Italy national team. Nicknamed Fusetta for his remarkable agility, although he was unaccustomed to flashy interventions, his confidence and leadership made him a highly reliable goalkeeper for his coaches. He boasted a great sense of position, especially when coming out of his own goal to block opposing crosses and assists. During his career he gave up his place as a starter on just nine occasions out of a total of 398, due to his excellent physical condition, In addition having praise on the strictly athletic side; He also became a specialist in blocking penalty kicks, sensing the direction of the ball after staring into the shooter's eyes. He is widely regarded as one of the greatest Italian goalkeepers of all time. Combi was considered one of the best goalkeepers in the world during the 1930s, alongside Ricardo Zamora and František Plánička, in a 1999 IFFHS poll, he was elected Italy's second best goalkeeper of the twentieth century, behind only Dino Zoff, and the sixteenth greatest European goalkeeper of the century, alongside Rinat Dasayev.IFFHS' Century Elections - www.rsssf.com - by Karel Stokkermans, RSSSF. ==Club career== Born in Turin, Gianpiero Combi played his entire career as a goalkeeper at Juventus Turin. He made his debut for the Juventus league team on 5 February 1922 in a match against Pro Vercelli. With Juve, he won the Italian championship five times between 1926 and 1934 and was part of the legendary Quinquennio d'Oro team. With the assumption of the presidency of Juventus Turin in 1923 from Edoardo Agnelli, president of the Fiat Group, the economic basis of the club was enormously improved and the foundations of future successes were created. The goalkeeper, who joined the first team in 1922, experienced his first title win in the 1925/26 series, when he won the two finals with Juventus in August 1926 with 7-1 and 5-0 goals against Alba Roma. From the 1929/30 season, the championship was played out in Serie A, Ambrosiana-Inter won the Scudetto and Juve finished third. In the 1932/33 series, Combi – the keeper, who was only 1.74 m tall, was credited with sovereign positional play, mobility, elegance and outstanding directing of the front men – had played all 34 league games and conceded only 23 goals. Together with Umberto Caligaris and Virginio Rosetta, he formed a final triangle of international class. Under coach Carlo Carcano, he also took part in the Mitropa pokal competition from 1931 to 1934. Combi, also known as Uomo di Gomma (rubber man), played his last Serie A game on 15 April 1934 in a 2-1 win against Brescia Calcio. After the 1933/34 round, the \"prestigiatore in porta\" (\"magician in goal\") ended his career. ==International career== Combi made his debut for the Italian national team on 6 April 1924 in an international match against Hungary in Budapest. The game ended in a 7-1 defeat and the Turin native had a creative break of almost a year with five international appearances. On 22 March 1925, however, after his second appearance in the Squadra Azzurra, he had a 7-0 victory against France and he had thus rehabilitated himself. But he was not yet a regular goalkeeper. Goalkeeper Giovanni De Prà of CFC Genoa competed with Combi until the first game at the 1928 Olympic Games in Amsterdam on May 29 against France (4-3). After his convincing performances at the Olympic tournament in the two games against Spain (decider 7-1 victory), the 2-3 semi-final defeat against Uruguay and the high 11-3 success in the match for 3rd place against Egypt on 10 June with the bronze medal, he was the undisputed placeholder in the goal of the Squadra Azzurra. From 1 June 1928 (against Spain) to 13 December 1931 in Turin against Hungary (3-2), the Juventus goalkeeper was in goal for the national team in 24 international matches. This also included the matches against the German national football team on 28 April 1929 in Turin and on 2 March 1930 in Frankfurt. While Nuremberg goalkeeper colleague Heiner Stuhlfauth had contributed to the surprising 2-1 victory of the German team with his outstanding performance in Turin, Italy took revenge in Frankfurt with a convincing Combi in goal with a 2-0 victory. With his teammates, Combi also prevailed against Austria, Czechoslovakia, Hungary and Switzerland in the first European Cup of national football teams from 1927 to 1930. In the second edition in 1931–32, he finished second with Italy before winning the competition for the second time from 1933 to 1935. In the 4-0 victory in the World Cup qualifier against Greece in Milan on 25 March 1934, Carlo Ceresoli kept the goal of the Squadra Azzurra. Combi had massive intentions at the end of his career and was only persuaded by Vittorio Pozzo to make himself available for the World Championship again after Ceresoli broke his hand. When he won the 1934 World Cup, he was the captain of the world champion team. In addition to winning the title, the duels with fellow goalkeepers Ricardo Zamora, Peter Platzer and František Plánička in the games against Spain, Austria and Czechoslovakia stood out. After the final on 10 June 1934 in Rome, he ended his playing career at the age of 31 after 47 international matches. ==End of career and retirement== A year later, in November 1935, Combi played only five of the eight matches in the International Cup and in his absence the Italian team won the trophy. He totalled 47 caps for the Italian team, five of which were as captain. Although he had stopped playing football, his passion for the sport remained all his life and he still held a number of unofficial positions with Juventus. He offered advice to the technical staff and also served as a scout. In 1951 the Italian Football Federation offered him the job of technical commissioner for the Italy national team with Carlino Beretta and Toni Busini. They led the National Team for seven months, from 8 April to 25 November 1951 in which time the Italian squad played 5 games without any losses. They won 4–1 against Portugal and France, and drew against Yugoslavia (0–0), Sweden (1–1) and Switzerland (1–1) - the only competitive game of the five. He died in Imperia on 12 August 1956, aged 53. ==Club career statistics== |- |1921/22||rowspan=\"13\"|Juventus||rowspan=\"8\"|Championship||10||0 |- |1922/23||21||0 |- |1923/24||21||0 |- |1924/25||24||0 |- |1925/26||27||0 |- |1926/27||28||0 |- |1927/28||32||0 |- |1928/29||28||0 |- |1929/30||rowspan=\"5\"|Serie A||34||0 |- |1930/31||29||0 |- |1931/32||34||0 |- |1932/33||34||0 |- |1933/34||29||0 351||0 351||0 |} ==International career statistics== |- |1924||1||0 |- |1925||4||0 |- |1926||2||0 |- |1927||3||0 |- |1928||7||0 |- |1929||4||0 |- |1930||5||0 |- |1931||8||0 |- |1932||2||0 |- |1933||5||0 |- |1934||6||0 |- !Total||47||0 |} == Honours == === Club === Juventus *Serie A: 1925–26, 1930–31, 1931–32, 1932–33, 1933–34 === International === Italy *FIFA World Cup: 1934 *Central European International Cup: 1927–30, 1933–35; Runner-up: 1931–32 *Summer Olympics: Bronze Medal 1928 ==References== Category:1902 births Category:1956 deaths Category:Footballers from Turin",
 "title": "Gianpiero Combi"
}