{
 "id": "248071",
 "text": "José Nasazzi Yarza (24 March 1901 – 17 June 1968) is a former Uruguayan football player. He has played for Uruguay national team. He is considered one of the best South-American defenders of all time and the best in Uruguayan football. Nasazzi was characterized by being a strong, fast defender, with great recovery, excellent positioning, perfect in the high and low game. He was a technical defender. He stood out for his great personality, for his innate command condition, for his courage, for the great ascendancy over his comrades. He was a \"boss\", caudillo and driver. By the International Federation of Football History and Statistics, Nasazzi was elected, also for the twentieth century, the seventh greatest Uruguayan player, ahead of Pedro Rocha (eighth) and Alcides Ghiggia (tenth), and the 26th greatest in South America, ahead of even Romário, Paulo Roberto Falcão, Rivellino, Carlos Alberto Torres and Daniel Passarella, among others. The British magazine World Soccer included the Uruguayan among the hundred greatest players of the twentieth century, precisely in 75th position, ahead of Alessandro Del Piero, Enzo Francescoli, again Falcao, Ryan Giggs, Sepp Maier, Zbigniew Boniek, Giacinto Facchetti and Raymond Kopa, among others. ==Club career== At the club level, Nasazzi wore the Lito shirt and founded in 1920 the club of his neighborhood, the Club Atlético Bella Vista, Nasazzi does not hesitate to ask for a pass. Faced with the refusal of Club Lito, he had to stay a year without playing in AUF championships, having to play in the Roland Moor for all of 1921. In Bella Vista, in 1922 he achieved promotion to the first division, achieving great campaigns in the highest category, highlighting the vice- championship of 1924 and the championship of the B series of the \"Laudo Serrato\" Tournament. In Nacional he made his official debut in 1933 and won the Uruguayan Championships of 1933 and 1934. In addition, as a Bella Vista player, he participated in the European tour made by Nacional in 1925, considered the most successful in the history of soccer. ==International career== The qualities expressed by Nasazzi with Bella Vista did not go unnoticed and earned him a call-up to the national team by Leonardo De Lucca in October 1923, on the occasion of the South American Championship organized by Uruguay in Montevideo. He is reunited with his club teammate José Andrade, an exceptional ball handler, probably unrivalled in the world at the time. Starting in defence alongside CA Lito player Fermín Uriarte, Nasazzi played in all three of Uruguay's matches, all won, and thus won his first international title. He was named the best player of the competition. The title earned Uruguay an invitation to represent South America at the 1924 Summer Olympics in Paris, the first official competition between European and American national teams. In order to be able to participate in the competition, Nasazzi quit his job at the marble factory. The president of the federation Atilio Narancio mortgaged a residence to advance the costs of the expedition1. The Uruguayans embarked on 16 March 1924 from Montevideo for a three-week boat ride. When they arrived, they played nine games — winning as many — across Spain to raise funds. These matches also allowed the Uruguayan team to settle tactically by rubbing shoulders with the first European teams. Finally arriving in Paris at the end of May, La Celeste flew over the Olympic tournament, scoring 20 goals and conceding only two, greatly impressing observers. Nasazzi played all five games as captain, with Pedro Arispe replacing Uriarte alongside him. Decisive in the quarter-finals, the Uruguayan captain cleared a shot from French centre-forward Paul Nicolas towards his forwards who scored the third goal in a 5-1 victory. The semi-final against the Netherlands was the only match in which the Uruguayans were really in trouble. After conceding the first goal, they equalized on a goal that their opponents considered offside, and finally took the lead at the end of the match thanks to a penalty that caused controversy. The final against Switzerland, more contested than the final score (3-0) suggests, and during which Nasazzi multiplied his interventions, attracted more than 40,000 spectators, not to mention the thousands of unfortunate people who were unable to enter the stadium, illustrating the popular success of the tournament. Shortly after their return, in October 1924, Uruguay hosted a new edition of the South American Championship. Nasazzi played all three matches and experienced his first unsuccessful match in his 11th official cap with a goalless draw against Argentina; which did not prevent Uruguay from winning another continental title. The Uruguayan team, whose activities had been suspended at the same time as the championship in 1925, participated in the 1926 South American Championship in Chile. Nasazzi, still a starter and captain, played in all four games of La Celeste, for as many victories, and won a 3rd continental title. Nasazzi did not make the trip to Peru for the 1927 South American Championship, where he was replaced by his club teammate Adhemar Canavesi. Uruguay lost its continental title by losing in the decisive match against Argentina, on an own goal scored by Canavesi at the very end of the match (3 goals to 2). The two rival teams travelled to the Netherlands the following summer to compete in the 1928 Olympic Games, which capitalised on the popular success of the 1924 tournament and generated great media anticipation. The Uruguayans were expected this time and experienced more resistance: they easily dominated the host country in the first round, but had to face the un-Olympic aggressiveness of the Dutch. The second match against Germany was similar, with the German captain being sent off shortly after Uruguay opened the scoring for a dangerous tackle. At the end of the match, when the Uruguayan victory was secured, the German striker and Nasazzi collided and the tone rose; the referee sent off both players, while Nasazzi was evacuated from the field on a stretcher. Although the tournament regulations did not require it, the Uruguayan federation decided to suspend Nasazzi for the next match. Canavesi took his place and Arispe took the captain's armband for the semi-final against Italy, considered the best European team in attendance. The duel was close but Uruguay finally won, with difficulty (3 goals to 2). Nasazzi is back in defence alongside Arispe for the final where Uruguay meet their great rivals, Argentina, who have had a more serene tournament. The first final ended in a draw (1-1) and a 2nd one had to be organised three days later. Unlike their opponents, Uruguay renewed their team by half. The match was just as hotly contested, but the Uruguayans, who took the advantage athletically, finally won it (2-1). Uruguay and Argentina met again at the 1929 South American Championship, this time held in Argentina. Deprived of Nasazzi for their first match, Uruguay lost to Paraguay and lost all hope of the title. Despite the return of its captain, Uruguay lost again in the last match against Argentina, who thus took his revenge for the Olympic Games. It was Nasazzi's first tournament defeat with the national team, six years after his debut. The following summer, Uruguay hosted the first edition of the Football World Cup, on the occasion of the centenary of its independence. Nasazzi was surrounded by five other two-time Olympic champions: José Andrade, Pedro Cea, Pedro Petrone, Héctor Scarone and Santos Urdinarán. His usual teammate in defence, Arispe, has stopped his playing career and is part of the national team's staff; he was replaced on the pitch by the young Ernesto Mascheroni. In the absence of several major European teams, the two big favourites of the tournament, Uruguay and Argentina, easily qualified for the final which was held in the Centenario Stadium, built for the occasion. The final was of paramount importance for Uruguay, José Nasazzi told his teammates before the match: \"If we don't win today, we are dead\". In the first half, the captain made a mistake on a long pass from Luis Monti and allowed Guillermo Stábile to score his eighth goal of the competition. At half-time, the Argentinians led by two goals to one, but the Uruguayans managed to turn the game around in the second half and win by four goals to two in front of nearly 70,000 spectators. Nasazzi, without being a goalscorer, particularly impressed observers with his influence on his teammates and the final result. The streets of Montevideo are invaded by tens of thousands of fans celebrating their country's victory. The next day, 31 July, was declared a public holiday in Uruguay. Unlike the future World Cup-winning captains, he did not have the chance to be awarded the famous trophy, the protocol did not yet provide for it, and it was presented to the president of the Uruguayan federation Raúl Jude. After the 1930 World Cup, the Argentines refused to participate in any new official competition with Uruguay, so the South American championships were suspended. In addition, Uruguay refused to register and defend its title at the 1934 World Cup held in Italy, officially in response to the lack of enthusiasm of the Europeans four years earlier. Nasazzi finally played in one last South American championship in 1935. Mascheroni left for Italy, he chose a new partner in defence in the person of Agenor Muñiz. Nasazzi played and won all three games played by Uruguay, and thus his 4th continental title. After 1923, he was elected best player of the tournament for the 2nd time, at the age of 34. This victory gave Uruguay qualification for the 1936 Olympic Games, but the Federation gave up participating for economic reasons. Nasazzi played his 40th and last official match for Uruguay in September 1936 against Argentina, against whom he earned 18 of his caps. == International career statistics == |- !Total||41||0 |} ==Honours== ===Club=== ;Lito *Uruguayan Intermedia: 1917, 1920 ;Roland Moor *Uruguayan 3era Extra: 1921 ;Bella Vista *Primera División: 1922 -1932 ;Nacional *Primera División: 1933 – 1937; 1925: European Tour with Nacional; 1927: US Tour with Nacional;. ===International=== ;Uruguay *FIFA World Cup: 1930 *Football at the Summer Olympics: 1924, 1928 *South American Championship: 1923, 1924, 1926, 1935 ===Individual=== *Best player at the South American Championship: 1923, 1935 *FIFA World Cup Golden Ball: 1930 *France Football's World Cup Top-100 1930–1990, 56th: 1994 *IFFHS South American Footballer of the Century, 26th: 1999 *World Soccer's 100 Greatest Footballers of All Time, 75th: 1999 *RSSSF Uruguay All-Time Team: 1999 * Copa América Historical Dream Team: 2011 * IFFHS Uruguayan Men's Dream Team ==References== Category:1901 births Category:1968 deaths Category:Uruguayan football managers Category:Footballers from Montevideo Category:1930 FIFA World Cup players",
 "title": "José Nasazzi"
}