{
 "id": "248242",
 "text": "Nigel de Jong (; born 30 November 1984) is a Dutch former professional footballer. He joined the Ajax youth academy when he was young and made the first team at age 17. De Jong moved from Ajax in 2006 to join Hamburg. He then moved to Manchester City in January 2009 for around £18 million. He became an important part of Manchester City's midfield. He has earned a reputation of being combative and feisty player. This got him nicknames like \"The Terrier\" and \"Lawnmower\". He moved to Italian club Milan in August 2012. ==Club career== ===Ajax=== On 19 October 2002, de Jong played for the Ajax first team for the first time. He scored his first goal on 18 February 2003 in a 1–1 draw against Arsenal in the UEFA Champions League. He started playing in the first team often in the next season. In this season, Ajax won the Eredivisie. In 2004–05, de Jong was named Ajax Player of the Season. Later, after starting in midfield for quite a while, he found himself sitting on the bench more often than being one of the players at the start of a match. On 7 December 2005, it was announced that de Jong did not want to stay with Ajax. His contract with Ajax was due to finish in July 2006. ===Hamburg=== On 26 January 2006, de Jong signed a four and a half year contract at German Bundesliga club Hamburg. He moved there for about €1 million. He played for Hamburg for the first time two days later. In the match, Hamburg lost 2–1 to Nuremberg. In March 2006, de Jong scored the winning goal in Bayern Munich's first ever loss at the Allianz Arena. The week after, he got his first red card in a UEFA Cup match against Rapid Bucharest. He had to stop playing in April because he needed surgery on a knee problem. The injury also meant that he could not play for the Netherlands at the 2006 World Cup. However, after becoming fit again, he was put on standby. ===Manchester City=== On 21 January 2009, de Jong moved to Manchester City for around £18 million. He signed a four-and-a-half year contract. He played for the first time against Newcastle United on 28 January 2009. He appeared sixteen times in the Premier League. De Jong was in the starting team against Arsenal on 12 September 2009. He was given Man of the Match by Sky Sports after Manchester City won 2-1 over Chelsea on 5 December 2009. By the end of the season, the fans liked him. He was one of Roberto Mancini's first picks as defensive midfielder as the team just missed out on the Champions League. De Jong scored his first goal for Manchester City when they won 2-1 against West Ham United on 1 May 2011. ===Milan=== On 31 August 2012, de Jong joined Italian Serie A club Milan. He signed a three-year contract. ==International career== On 31 March 2004, de Jong played his first game with the Netherlands in a friendly against France. He was not picked to play in UEFA Euro 2004. He missed the 2006 FIFA World Cup because his knee was injured. He scored his first goal for the Netherlands against Iceland on 6 June 2009 in a 2010 FIFA World Cup qualifying match. This match made the Netherlands go through to the 2010 World Cup. De Jong was part of the Dutch team for the 2010 FIFA World Cup. He was one of the starting players for their first match in the competition. In this match, they won 2–0 against Denmark. He was not allowed to play in the semi final against Uruguay because he got his second yellow card in a match against Brazil. He played in the Final, where the Netherlands lost 1–0 to Spain. Nigel de Jong: international goals # Date Place Opponent Score Result Competition 1\\. 6 June 2009 Laugardalsvöllur, Reykjavík, Iceland 1 – 0 2 – 1 2010 FIFA World Cup qualification ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National Cup League Cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Ajax 2002–03 Eredivisie 17 0 0 0 0 0 10 1 27 1 2003–04 Eredivisie 32 2 0 0 0 0 5 0 37 2 2004–05 Eredivisie 31 5 0 0 0 0 8 1 39 6 2005–06 Eredivisie 16 2 0 0 0 0 7 3 23 5 Total 96 9 0 0 0 0 30 5 126 14 Hamburg 2005–06 Bundesliga 12 1 0 0 0 0 3 0 15 1 2006–07 Bundesliga 18 1 0 0 0 0 5 1 23 2 2007–08 Bundesliga 29 1 0 0 0 0 6 1 35 2 2008–09 Bundesliga 7 0 2 0 0 0 2 0 11 0 Total 66 3 2 0 0 0 16 2 84 5 Manchester City 2008–09 Premier League 16 0 0 0 0 0 0 0 16 0 2009–10 Premier League 34 0 3 0 5 0 0 0 42 0 2010–11 Premier League 32 1 4 0 0 0 5 0 41 1 2011–12 Premier League 21 0 1 0 4 1 9 0 36Includes one appearance in the FA Community Shield 1 2012–13 Premier League 1 0 0 0 0 0 0 0 2 0 Total 104 1 8 0 9 1 15 0 137 2 A.C. Milan 2012–13 Serie A 12 1 0 0 0 0 4 0 16 1 2013–14 Serie A 33 2 1 0 0 0 10 0 44 2 2014–15 Serie A 29 3 1 1 0 0 0 0 30 4 2015–16 Serie A 5 0 1 0 0 0 0 0 6 0 Total 79 6 3 1 0 0 14 0 96 7 LA Galaxy 2016 Major League Soccer 14 0 0 0 1 0 2 0 16 0 Galatasaray 2016–17 Süper Lig 18 1 6 0 0 0 0 0 24 1 2017–18 Süper Lig 0 0 0 0 0 0 0 0 0 0 Total 18 1 6 0 0 0 0 0 24 1 Mainz 05 2017–18 Bundesliga 11 0 1 0 0 0 0 0 12 0 Al Ahli 2018–19 Qatar Stars League 21 4 0 0 0 0 0 0 21 4 Al Shahaniya 2019–20 Qatar Stars League 23Includes one appearance in the Relegation/Promotion playoffs 0 0 0 4 1 0 0 27 1 Career total 384 20 21 1 10 0 73 7 496 29 ===International=== Netherlands Netherlands Netherlands Year Apps Goals 2004 5 0 2005 5 0 2006 4 0 2007 5 0 2008 11 0 2009 9 1 2010 11 0 2011 6 0 2012 11 0 2013 2 0 2014 11 0 2015 1 0 Total 81 1 Scores list Netherlands' tally first. Nigel de Jong: international goals No. Date Venue Opponent Score Result Competition 1 6 June 2009 Laugardalsvöllur, Reykjavík, Iceland 2010 FIFA World Cup qualification ==Honours== Ajax *Eredivisie: 2003–04 *Johan Cruyff Shield: 2005 Manchester City *Premier League: 2011–12 *FA Cup: 2010–11 *FA Community Shield: 2012 Netherlands *FIFA World Cup runner-up: 2010; third place: 2014 Individual *Ajax Player of the Year (Rinus Michels Award): 2004–05 ==References== ==Other websites== * www.transfermarkt.co.uk Category:1984 births Category:Living people Category:A.C. Milan players Category:2010 FIFA World Cup players Category:2014 FIFA World Cup players Category:Dutch footballers Category:Footballers from Amsterdam",
 "title": "Nigel de Jong"
}