{
 "id": "248230",
 "text": "Neem is a tree in the mahogany family Meliaceae. It is native to India, Myanmar, Bangladesh, Sri Lanka, Malaysia and Pakistan. It grows in tropical and semi-tropical regions. It was also the state tree of Hyderabad Deccan. Neem is a fast-growing tree in India that can reach up to 15–20 m (about 50–65 feet) tall, and sometimes even to 35–40 m (115–131 feet). It is evergreen. It is found in some major parts of Tamil nadu like tuticorin,tirunelveli ,etc. == Uses == Products made from neem have been used in India for over two millennia for their medicinal properties. They are said to be antifungal, antidiabetic, antibacterial, antiviral, contraceptive and sedative. Neem products are also used in selectively controlling pests in plants. Neem is considered a part of Ayurvedic medicine.S. Zillur Rahman and M. Shamim Jairajpuri. Neem in Unani Medicine. Neem Research and Development Society of Pesticide Science, India, New Delhi, February 1993, p. 208-219. Edited by N.S. Randhawa and B.S. Parmar. 2nd revised edition (chapter 21), 1996Neem, WebMD. Neem is also known as the' village pharmacy'. All parts of neem are used for preparing many different medicines, especially for skin disease. * A compound from the Neem tree can be used as a spermicide . * Neem oil is used for preparing cosmetics (soap and shampoo, ozone as well as lotions and others), and is useful for skin care such as acne treatment. Neem oil has been used effectively as a mosquito repellent. * Neem is useful for damaging over 500 types of insects, mites, ticks, and nematodes, by changing the way they grow and act. Neem does not normally kill pests right away, rather it slows their growth and drives them away. As neem products are cheap and not poisonous to animals and friendly insects, they are good for pest control *In the UK, plant protection products that contain azadirachtin, the active ingredient of neem oil, are illegal. The plant is well recognized for its medicinal as well as health benefits that it provides to mankind. The presence of certain compounds makes this plant a must-add to your daily routine. It is specifically used for treating outer skin infections like fungi and bacteria. The two medicinal compounds that make Neem essential to be used for treating or preventing fungal infection are nimbidol and gedunin. It possesses the capability to fight and inhibit the growth of fungus spores. Application: Neem in combination with aloe vera gel aids in effective recovery from fungal infections as the goodness of aloe vera provides short-term relief from the pain and itchiness caused by the infection. For external use, wash the infected area with warm neem water which helps in treating fungal infection. Crush dry neem leaves and make powder. Mix neem powder with sandalwood water and make a thick paste with rose water. This mixture is to be applied on the affected area which helps prevent fungal infection. Note: Do not apply neem extract directly on infected skin as it may cause itchiness. ==References== Category:Meliaceae Category:Plants of Asia",
 "title": "Neem"
}