{
 "id": "248365",
 "text": "The Burgess Shale Formation in the Rocky Mountains of British Columbia is one of the world's most celebrated fossil sites, the best of its kind.Burgess Shale fossils and their importance. The Burgess Shale Geoscience 2010. It is famous for the exceptional preservation of the soft parts of its fossils.Briggs D.E.G; Erwin D.H. & Collier F.J. 1995. Fossils of the Burgess Shale. Washington: Smithsonian Inst Press. Conway Morris, Simon. The crucible of creation: the Burgess Shale and the rise of animals. It is ~505 million years old (Middle Cambrian), one of the earliest soft-parts fossil beds. The rock unit is a black shale, and crops out at a number of localities near the town of Field in the Yoho National Park. The Burgess Shale was discovered by palaeontologist Charles Doolittle Walcott in 1909, towards the end of the season's fieldwork.Yochelson E.L. 1996. Discovery, collection, and description of the Middle Cambrian Burgess Shale biota by Charles Doolittle Walcott. Proceedings of the American Philosophical Society 140, #4: 469–545. He returned in 1910 with his sons, and established a quarry on the flanks of Fossil Ridge. The fact that fossils were of soft-bodied forms, and the range of organisms new to science, led him to return to the quarry almost every year until 1924. At this point, aged 74, he had got over 65,000 specimens. Describing the fossils is a vast task, pursued by Walcott until his death in 1927, and continued into the 21st century. Walcott, led by scientific opinion at the time, attempted to categorise all fossils into living taxa. As a result, the fossils were regarded as little more than curiosities at the time. It was not until 1962 that a first-hand reinvestigation of the fossils was attempted, by Alberto Simonetta. This led scientists to recognise that Walcott had barely scratched the surface of information available in the Burgess Shale.Collins D. 2009. Misadventures in the Burgess Shale. Nature 460 (7258): 952. doi:10.1038/460952a PMID 19693066 A second quarry (in the same geological formation) was opened. A thorough reassessment of the Burgess Shale showed that the fauna were much more varied and unusual than Walcott had realised. The Royal Ontario Museum now has the largest collection of Burgess Shale material in the world with over 150,000 specimens. Many of the animals present had bizarre anatomical features and only the slightest resemblance to other known animals. Examples include Opabinia, with five eyes and a snout like a vacuum cleaner hose; Nectocaris, and Hallucigenia. This last was originally reconstructed upside down, walking on its spines. The Burgess Shale was designated a UNESCO World Heritage Site in 1980. It became part of the Canada Rocky Mountain Parks World Heritage Site in 1984. ==Related pages== * Cambroraster falcatus * Lagerstätten == References == Category:Lagerstätten Category:Mountains of British Columbia Category:Cambrian Category:Geological formations Category:Sedimentary rocks Category:World Heritage Sites in Canada",
 "title": "Burgess Shale"
}