{
 "id": "248403",
 "text": "Rhabdomyosarcoma is a rare type of cancer that is most common in children. Rhabdomyosarcoma is a cancer that begins in muscle tissue - usually the muscles that are attached to bones to help a person move. Rhabdomyosarcoma should not be confused with rhabdomyolysis, which is often called \"rhabdo\" for short. ==Types== There are three different kinds of rhabdomyosarcoma. ===Embryonal rhabdomyosarcoma (ERMS)=== This is the most common type of rhabdomyosarcoma. More than half of people with this cancer have ERMS. It is most common in children under age 6. Embryonal rhabdomyosarcoma usually happens in: * The head or neck; * The genitals; or * The urinary system. ===Alveolar rhabdomyosarcoma (ARMS)=== This is the second most common type of rhabdomyosarcoma. Alveolar rhabdomyosarcoma is more common in older children and teenagers, but it can also happen in younger children and adults. ARMS usually happens in the big muscles in: * The arms or legs; * The chest; or * The abdomen However, it can also happen in the genitals or the area around the anus. This type of rhabdomyosarcoma usually grows faster than embryonal rhabdomyosarcoma, and needs more treatment than ERMS. ===Anaplastic rhabdomyosarcoma=== Anaplastic rhabdomyosarcoma does not happen very often. When it does happen, it usually affects adults; is very rare in children. This type of cancer usually grows quickly and needs a lot of treatment. ==Treatment== The choice of how to treat rhabdomyosarcoma depends on many things. For example: * Where is the tumor? * How big is the tumor? * Has the tumor spread to other parts of the body? * Can the entire tumor be taken out by surgery? * What type of rhabdomyosarcoma does the person have? * Has the cancer caused changes to the person's genes? * How old is the patient? Based on all of these things, the patient and their medical team can decide what treatment is best. There are three types of treatments for rhabdomyosarcoma: * Radiation * Chemotherapy * Surgery ==Prognosis== The prognosis of a person with rhabdomyosarcoma also depends on many different things. For example, adults with rhabdomyosarcoma usually have tumors that grow faster and are harder to treat. Prognosis also depends on the type of rhabdomyosarcoma a person has, what kind of treatment they get, whether their cancer has spread, and many other things. ==References== Category:Medicine Category:Cancer C Category:Pediatrics",
 "title": "Rhabdomyosarcoma"
}