{
 "id": "248950",
 "text": "Old Style (or O.S.) and New Style (or N.S.) are terms used for calendar dates in English language historical studies, for two reasons. The first reason is that the method of dating that is most widely used around the world today, the Gregorian calendar, was introduced into English cultures only in 1752. The second is that 1 January has not always been the first day of the year: in the British Empire (and some other countries), March 25th was the start of the year. Both of these conventions changed just a few centuries ago, when the Calendar (New Style) Act 1750 was made law. The dating style used before 1752Julian Calendar, year beginning 25 March is called Old Style Dating and the dating style used todayGregorian Calendar, year beginning 1 January is called New Style Dating. So when a date is given in a history book (or an old book), we need to know whether it is using 'New Style' or 'Old Style' dating. During the time of the changeover, people would give both dates. Even today, when historians are writing about an event in those times, they often give the date as it was used at the time but also give the modern equivalent for your convenience. The reason for changing the calendar was that people realised that there is a mistake in the Julian calendar, that it adds too many leap years. This meant that the date of Easter was being calculated wrongly, because it depends on March 21 being the day before the equinox. So they designed a new calendar that corrected this error. The new rule was that a leap year would happen every four years (as before) but not if the year ended in 00 unless it could be divided evenly by 400. (So 1600 and 2000 were leap years, but 1700, 1800 and 1900 were not.) Pope Gregory XIII had declared that this new calendar should be used from 1582 onwards. But only Roman Catholic countries accepted this ruling: Protestant and Eastern Orthodox countries refused to have the Pope tell them what to do. So even in Europe, the change happened at different times. For example, it was not until 1752 that Great Britain and its colonies changed over to the new calendar, also changing the start of the year from 25 March to 1 January at the same time.Death warrant of Charles I web page of the UK National Archives. A demonstration of New Style meaning Julian calendar with a start-of-year adjustment.Stockton, J.R. Date Miscellany I: The Old and New Styles : \"The terms 'Old Style' and 'New Style' are now commonly used for both the 'Start of Year' and 'Leap Year' [(Gregorian calendar)] changes (England & Wales: both in 1752; Scotland: 1600, 1752). I believe that, properly and historically, the 'Styles' really refer only to the 'Start of Year' change (from March 25th to January 1); and that the 'Leap Year' change should be described as the change from Julian to Gregorian.\"Spathaky, Mike. Old Style New Style dates and the change to the Gregorian calendar. \"increasingly parish registers, in addition to a new year heading after 24th March showing, for example '1733', had another heading at the end of the following December indicating '1733/4'. This showed where the New Style 1734 started even though the Old Style 1733 continued until 24th March. ... We as historians have no excuse for creating ambiguity and must keep to the notation described above in one of its forms. It is no good writing simply 20th January 1745, for a reader is left wondering whether we have used the Old or the New Style reckoning. The date should either be written 20th January 1745 OS (if indeed it was Old Style) or as 20th January 1745/6. The hyphen (1745-6) is best avoided as it can be interpreted as indicating a period of time.\" Russia changed in 1918, after the 'October' Revolution.\"Russia: The October (November) Revolution\". Britannica encyclopaedia, A demonstration of New Style meaning the Gregorian calendar. The Latin words for O.S. are stili veteris or stilo vetere. These terms are used in some books worldwide. They can be shortened to st.v. In Europe and its colonies, the 'old style calendar' means the Julian calendar. Other countries used different systems: for example China, Japan and Korea used lunisolar calendars. == References == Category:History Category:Calendars",
 "title": "Old Style and New Style dates"
}