{
 "id": "249350",
 "text": "Druze (; ; Durūz, plural Druzes) are an Arab ethnoreligious group and community. It is estimated that there are more than 1 million Druzes in the world today, and most of them live in the Middle Eastern countries, especially in Lebanon and Syria. There are some smaller Druze communities around the world. 'Druze' is the name given to the community by outsiders, and the term is not used by Druzes themselves. Instead, they call themselves muwaḥḥidūn (“unitarians”). Druze’s origin is Ismaili Shi'i Islam of Fatimid dynasty, but Druzes hold distinctive beliefs and practices and put much emphasis on philosophy and spirituality. == Origin == === Early history === ==== al-Hakim bi-Amr Allah elaborates Druze doctrine ==== It is believed that the origin of Druze comes from Fatimid dynasty in Egypt in the 11th century. Because Fatimas were derived of Shi’a Islam called Isma’ilis, the root of Druze is also the branch of Shi’a. The sixth caliph of Fatimid dynasty, al-Hakim bi-Amr Allah, played an important role to elaborate the Druze doctrine. In Druze manuscript, he is regarded as the founder of Druze. ==== Hamza Ibn 'Alli came to Cairo for missionary work ==== In 1016, a Persian man called Hamza Ibn 'Ali came to Cairo to help al-Hakim. At that time, al-Hakim attempted to spread the belief of Druze. In 1017, al-Hakim designated Hamza as an imam, and Hamza especially contributed to elaborate the Druze doctrine and to spread the belief by sending missionaries. ==== The arrival and execution of Muḥammad al-Darāzī ==== There was conflict over the Druze doctrine between Hamza and Muḥammad al- Darāzī. Darāzī was also a Druze missionary who arrived in Cairo in 1016. He offered his service to al-Hakim and was recruited as a missionary. In order to get more support from al-Hakim than Hamza, Darāzī began to alter the teaching by Hamza and declared that the presence of al-Hakim is divine. However, al- Hakim did not appreciate it and people began to criticise Darāzī’s corrupted teachings. In 1019, Darāzī is said to be executed or killed. ==== The disappearance of al-Hakim ==== In 1021, al-Hakim disappeared suddenly during his trip to the east Cairo for reasons unknown. After his disappearance, his successor of Fatimad caliph al-Zāḥir oppressed the Druze movement to spread its doctrine. Druze gradually fell into decline in Egypt, but in Syria and Lebanon the belivers remained because of the effort by the missionaries. ==== The declaration of Druze shutting out from outsiders ==== In 1043, the Druze doctrine prohibited its believers from believing other religion and outsiders from becoming a new member of Druze. Since then, Druze has been the closed community and has kept the policy until now. === Origin of the name 'Druze' === The term Druze was given to the community by outsiders. They apparently mixed up Muḥammad al-Darāzī, one of the early missionaries of Druze, as the founder of the religion. However, because of his misbehavior, Druzes and its manuscripts regard Darāzī as the first betrayer. Therefore, the term never used in the Druze manuscripts and the members reject using it. Instead, the Druzes call themselves Muwwahhidun, meaning 'Unitarians'. == Beliefs and practices == === Two classes: the Initiated ('uqqal) and the Uninitiated (juhhal) === Within the Druze community, the strict religious authority exists. The religious elite has a huge impact on the rest of the people, and that makes the community members closely united. There are two main classes in Druze community: the initiated or wise ('uqqal) and the uninitiated or ignorant (juhhal). The duty of the initiated is telling its mystical, complex teaching and oral traditions to the uninitiated. The initiated study the Druze’s belief by discussing and reading its holy scripture in a prayer house (khalwa or majlis). In order to become the initiated, it is required to show deep respect and dedication to the God and to go through the long process of application. Women also have the chance to become the initiated. According to Druze doctrine, women are more spiritually matured than men, so women are required to take less-severe training to become the initiated. The initiated people are easily recognised because of their dark clothes with white and rounded turbans. === Reincarnation (taqamus) === According to the Druze manuscripts, after the someone’s dead, the soul is soon incarnated, meaning the soul gets a new human body and reborns as a different person. A soul is incarnated without changing its religion, skin colour or race, so a Druze reborns as a Druze over time. This idea comes from one of the Druze doctrines that the number of Druze souls is constant. === Marriage === For Druzes, it is quite rare and strongly discouraged to get married with a non-Druze person in order to maintain the religious teaching secret from outsiders. In addition, because only a child whose parents are both Druze is accepted as a Druze, the marriage within Druze community is important to prevent the number of Druzes from decreasing. But nowadays for many young Druzes living in a small community outside the Middle East have difficulty finding their Druze partner. === Worship services === The Druze worship places are called majlis or khalwa. Druzes worship there normally on Thursday evenings. Both the initiated and the uninitiated join the gathering. There, some religious ceremonies such as spiritual readings and prayer are conducted under the direction of the initiated. After the open session is over, the uninitiated leave the hall and only some initiated are permitted to remain there and join a limited session. There, they discuss and meditate mystical reading and transcription such as reading the Druze holy book Epistles of Wisdom. Their ceremonies are usually done in the Arabic language which they maintain as an integral part of their identity. Druze shrines are often also visited following the worship sessions. === The religious symbol === The Druze flag and its symbol star have the same five colours and each colour has two meanings: spiritual principles and key figures. In the Druze manuscript, there are five people who are respected by their contribution to Druze, and five cosmic spiritual elements that are main principles of existence for Druzes. The Meaning of the Symbol Colour Colour Principle Person Green the Universal Intelligence (al'Aql) Hamza ibn Ali Red the Universal Soul (al-Nafs) Ismail ibn Mohammad Yellow the Sun (al-Shams) Ishaq ibn Wahb Blue the Preceding (al-Sabiq) Salama ibn Abdul-Wahhab White the Following (al-Tali) Ali ibn Salman == Druze community in each country == The majority of Druzes are living in the Middle East, especially in Lebanon and Syria. Because of the economic and political instability, some Druzes emigrated outside the Middle East and small communities are found in the United States, Canada, Europe, South America and Australia. However, because of its strong feeling of unity, they are closely related to their hometown and companions. === Lebanon === In Beirut, the capital of Lebanon, the legal and administrative center of Druze is located. Over 300,000 Druze are living in Lebanon, which is around 7% of the total population of the country. The western edges of the Lebanon Mountains is the most populated area of Druzes. Since the independence of Lebanon, Druze has kept much power for the country’s politics. === Syria === There are around 600,000 Druze in Syria and the country has the largest population of Druze in the world. Around 6% of the Syrian population is Druze. Suwayda, the city located in the area of Jabal al- Durūz, holds the huge number of Druzes. In 1925, Druze leader Sulṭān al-Aṭrash rose a rebellion against French rule and it was considered to be the first nationalist movement in Syria. === Israel === The population of Druze in Israel is less than 1% of the total population, but the Druze's contribution to the Israeli government is not small. Although Druze is an Arab community, they are patriotic citizens to Israel, with many electing to enlist in the Israel Defense Forces. ==Sources== Category:Ethnic groups in Israel Category:Religion in Lebanon Category:Religion in Israel Category:Syrian people",
 "title": "Druze"
}