{
 "id": "249527",
 "text": "is a former Japanese football player. He played for the Japan national team. ==Biography== Kaneko was born in Saitama on September 12, 1959. After graduating from Teikyo High School, he joined Japan Soccer League club Furukawa Electric in 1978. Initially, he could not play many games. The club won the 1982 JSL Cup. From 1985, he played as a regular player and the club won the 1985–86 Japan Soccer League and 1986 JSL Cup. He was also selected for the Best Eleven in 1985–86 and 1986–87. In Asia, the club won the 1986 Asian Club Championship. This was the first Asian championship for a Japanese club. He played 163 matches and scored 23 goals for the club. He retired in 1992. In August 1979, Kaneko was selected the Japan U-20 national team for the 1979 World Youth Championship. On July 25, 1986, he debuted for the Japan national team against Syria. He also played at the 1986 Asian Games. In 1987, he was selected for Japan at the 1988 Summer Olympics. He played seven games and scored one goal for Japan until 1987. ==Statistics== ===Club statistics=== Club performance Club performance Club performance League League Cup Cup League Cup League Cup Total Total Season Club League Apps Goals Apps Goals Apps Goals Apps Goals Japan Japan Japan League League Emperor's Cup Emperor's Cup JSL Cup JSL Cup Total Total 1978 Furukawa Electric JSL Division 1 0 0 0 0 1979 1 0 1 0 1980 2 0 2 0 1981 13 0 13 0 1982 12 1 12 1 1983 10 1 10 1 1984 10 1 10 1 1985–86 22 2 22 2 1986–87 22 5 22 5 1987–88 20 4 20 4 1988–89 22 3 22 3 1989–90 21 5 2 0 23 5 1990–91 5 1 5 2 10 3 1991–92 3 0 0 0 3 0 Total Total Total 163 23 0 0 7 2 170 25 ===National team statistics=== Japan national team Japan national team Japan national team Year Apps Goals 1986 3 0 1987 4 1 Total 7 1 ==References== ==Other websites== * Category:1959 births Category:Living people Category:Footballers from Saitama Prefecture Category:Japan international footballers Category:Japan Soccer League players Category:JEF United Chiba players",
 "title": "Hisashi Kaneko"
}