{
 "id": "249671",
 "text": "The Andromeda galaxy is the nearest spiral galaxy to the Milky Way, our galaxy. Andromeda is sometimes called Messier 31, M31 or NGC 224 by astronomers. It is about 2.6 million light years away from us. In other words, we see it as it was 2.6 million years ago. The galaxy looks like a dim, fuzzy star to the naked eye. Andromeda is named after Andromeda constellation, where it is located. Andromeda is the largest galaxy of the Local Group. The group is the Andromeda galaxy, the Milky Way galaxy, the Triangulum galaxy, and about 30 other smaller clusters. Although the largest, Andromeda may not be the most massive. Recent findings suggest that the Milky Way contains more dark matter and may be the most massive in the group. The 2006 observations by the Spitzer Space Telescope revealed that M31 contains a trillion stars (1012). This is more than the number of stars in our own galaxy, which is estimated to be c. 200-400 billion. Andromeda is estimated to be 7.1 solar masses. In comparison, a 2009 study estimated that the Milky Way and Andromeda are about equal in mass, At an apparent magnitude of 3.4, the Andromeda galaxy is notable for being one of the brightest Messier objects as seen from Earth. It is visible to the naked eye on moonless nights even when viewed from areas with moderate light pollution. Although it appears more than six times as wide as the full Moon when photographed by a larger telescope, only the brighter central region is visible to the naked eye. Being both large and bright, it is one of the farthest objects that can be seen without a telescope or binoculars. The Andromeda galaxy is approaching the Milky Way at about 100 to 140 kilometres per second (62 to 87 mi/s), so it is one of the few blue shifted galaxies. The Andromeda galaxy and the Milky Way are thus expected to collide in perhaps 4.5 billion years. The Milky Way–Andromeda collision is likely to make the galaxies merge, to form a giant elliptical galaxy. Such events do happen in galaxy groups. However, 4.5 billion years is a vast period of time, roughly equal to the time the Earth has existed as a planet. == Satellite galaxies == Orbiting M31 are at least 13 dwarf galaxies. the brightest and largest is M110, which can be seen with a basic telescope. The second-brightest and closest one to M31 is M32. == Observational history == The Persian astronomer Al Sufi was the first man to record seeing the Andromeda galaxy. He called the galaxy \"a small cloud\" in his book, the Book of Fixed Stars, which was published in 964 AD. The first person to look at the galaxy with a telescope was Simon Marius in 1612. In 1764 Charles Messier put it into his catalogue of astronomical objects. He called it M31 and gave the credit for its discovery to Marius, as he did not know that Al Sufi had seen it hundreds of years previously. In 1751 William Herschel estimated the distance to the Andromeda \"nebula\" as \"no more than 2000 times the distance to Sirius,\" or around 17,200 light years.2000 x 8.5 = 17,200 The best modern estimate of Andromeda's distance is 2.54 million light years. In the 1920s astronomer Edwin Hubble proved that Andromeda was a galaxy, and not a gas cloud in the Milky Way as had been thought. Andromeda was known to the ancients, but only in the 1920s was it understood as a galaxy. == Andromeda galaxy in fiction == * A for Andromeda: a 1961 BBC science fiction drama series written by astronomer Fred Hoyle and John Elliott, and broadcast by BBC TV in seven episodes. Remade in 2006 as a film. * The Andromeda Breakthrough was a BBC 1962 sequel written by Fred Hoyle and John Elliott. * Andromeda (TV series). A Canadian/American science fiction television series, based on unused material by Gene Roddenberry, and developed by Robert Hewitt Wolfe. == Related pages == * Nature timeline == References == == Other websites == * Andromeda Galaxy -Citizendium Category:Spiral galaxies Category:Local galaxies",
 "title": "Andromeda galaxy"
}