{
 "id": "249653",
 "text": "Ian Stevenson, M.D., was a Canadian professor of psychiatry. He worked at the University of Virginia, in the area of parapsychology. Stevenson thought that the idea of reincarnation might help modern medicine better understand aspects of human behavior and development.Ian Stevenson. \"The Explanatory Value of the Idea of Reincarnation\", Journal of Nervous and Mental Disease, 164:305-326, 1977. He traveled a lot over a period of 40 years to investigate 3,000 childhood cases that suggested to him the possibility of past lives.Professor Ian Stevenson , The Daily Telegraph, February 12, 2007. Stevenson saw reincarnation as the survival of the personality after death, although he never suggested a physical way a personality might survive death. Stevenson's research was the subject of Jim B. Tucker's Life Before Life (2005). ==Reincarnation research== Stevenson found that the best evidence supporting the belief in reincarnation comes from the cases of young children who, typically between the ages of 2 and 5, make statements about a previous life they claim to have had before being born. Their statements are often accompanied by behaviour that is unusual for their family but appropriate for the life that the child claims to remember. There is often a \"forgetting of the imaged memories between the ages of 5 and 8; a high incidence of violent death claimed in the claimed previous life; and mention of the mode of death by the subject\".Jane Henry (2005). Parapsychology: Research on Exceptional Experiences Routledge, p. 225. Some 35 per cent of the subjects have birthmarks or birth defects which often correspond to injuries or illness experienced by the deceased person who the subject remembers. Medical documents have confirmed this correspondence in more than forty cases.Jane Henry (2005). Parapsychology: Research on Exceptional Experiences Routledge, p. 224. ==Selected books== Ian Stevenson authored or co-authored more than a dozen books. Stevenson died in 2007, and many of these books are mentioned in his obituaries in the British Medical Journal,Ian Pretyman Stevenson: Psychiatrist who researched reincarnation with scientific rigour British Medical Journal 2007, 334(7595):700 (31 March). New York Times,Margalit Fox. Ian Stevenson Dies at 88; Studied Claims of Past Lives New York Times, February 18, 2007. and the Washington Post.Tom Shroder. Ian Stevenson; Sought To Document Memories Of Past Lives in Children Washington Post, February 11, 2007. *Twenty Cases Suggestive of Reincarnation, (second revised and enlarged edition), University of Virginia Press, , 1974. (This book includes detailed reports of 20 cases of children, from five different countries, who claimed to remember previous lives).Edward F. Kelly, Emily Williams Kelly (2007). Irreducible mind: toward a psychology for the 21st century p. 650. *Reincarnation and Biology: A Contribution to the Etiology of Birthmarks and Birth Defects Volume 1: Birthmarks and Reincarnation and Biology: A Contribution to the Etiology of Birthmarks and Birth Defects Volume 2: Birth Defects and Other Anomalies. (2 volumes), Praeger Publishers, , 1997. *Where Reincarnation and Biology Intersect. Praeger Publishers, , 1997. (A short and non-technical version of Reincarnation and Biology, for the general reader) *Children Who Remember Previous Lives: A Question of Reincarnation, (revised edition) , 2000. (A general non-technical introduction into Reincarnation research). *European Cases of the Reincarnation Type. McFarland & Company, , 2003. *A World in a Grain of Sand: The Clairvoyance of Stefan Ossowiecki, (with Mary Rose Barrington and Zofia Weaver), McFarland Press, , 2005. ==References== ==Other websites== *The Division of Perceptual Studies (DOPS) at the University of Virginia Category:Canadian psychiatrists Category:People from Quebec Category:2007 deaths Category:1918 births Category:Parapsychologists Category:University of Virginia faculty",
 "title": "Ian Stevenson"
}