{
 "id": "24971",
 "text": "The Spanish Civil War (18 July 1936 – 1 April 1939) was a civil war between Republicans and Nationalists. The war ended on 1 April 1939, when the last Republican troops surrendered. Francisco Franco became dictator of Spain until he died in 1975. The civil war began after a pronunciamiento (revolt) against the Republican government by the Nationalists. The nationalists were supported by FE de las JONS, a far right political party. During this time, fascist General Francisco Franco and his nationalist troops wanted to take control of the Spanish Republic. The Army split, with about half of the troops being loyal to the Republic. Many different groups worked together to help the democratic Spanish Republic stop Franco, including Basques, Catalans and other groups. thumb|350px|center| General map of the Spanish Civil War (1936–1939). Main Nationalist centres Main Republican centres Land battles Naval battles Bombed cities Concentration camps Massacres Refugee camps == Foreign involvement == ===Support for Republicans=== The Soviet Union, Mexico and French Third Republic sold the Republican weapons, the International Brigades was a left wing international militant group formed to fight Franco, many anti-fascist partisans internationally volunteered to fight against Franco, including people from the United States, the United Kingdom, France, Belgium, Germany, and Italy. ===Support for Nationalists=== The governments of Nazi Germany, Kingdom of Italy and Second Portuguese Republic provided troops and supplies for Franco. == Death toll and atrocities == Around half-a-million people died in the war, and many atrocities were committed by both sides. The most famous atrocity was the bombing of Guernica. On 26 April 1937, the city was bombed by Legion Condor, a Nazi military unit working for Franco. It was the first time that an air bombing caused so many civilian casualties. The bombing was reported all over the world in newspapers and made people aware of the German involvement. thumb|center| location of Guernica. ==Related pages== * Ireland and the Spanish Civil War * Proxy war * European Civil War * Spain in World War II * Surviving veterans of the Spanish Civil War * SS Cantabria ==References== Category:1930s in Europe Category:1930s in Spain Category:20th-century rebellions Category:Rebellions in Europe Category:Spanish Civil War",
 "title": "Spanish Civil War"
}