{
 "id": "249810",
 "text": "Ellis Park is a sports stadium in Johannesburg, South Africa. It is also known as Coca-Cola Park. == History == Ellis Park was first built in 1928 as a Rugby union stadium. It was demolished and rebuilt in 1982, still as a rugby staduim. It was named after JD Ellis, a Johannesburg city councilor. JD Ellis allowed the use of the land for a stadium. He allowed 13 acres to build the stadium. The original stadium saw 100 000 visitors watch the South Africa versus England rugby match in 1955. The stadium has been used for different events. In 1995 it was part of the Rugby World Cup hosting group matches and the iconic final between South Africa and New Zealand. The stadium also hosted the football CONFED-Cup in 2009 as well as group and knockout matches in the 2010 FIFA World Cup. == Renovation == In 2009, the stadium was improved. More seats were added. Stadium access was made eaiser for disabled fans. A new pitch and media room was added. The sound system (loudspeaker)was improved. == FIFA World Cup == The stadium co-hosted the 2010 FIFA World Cup. It is one of the 10 stadiums where World Cup matches were played. 2010 World Cup Matches All times are given in South African Standard time (UTC+2). Date Time Group Team #1 Team #2 Result Saturday, 12 June 16:00 Group B Argentina Nigeria 1:0 Tuesday, 15 June 20:30 Group G Brazil Korea DPR 2:1 Friday, 18 June 16:00 Group C Slovenia United States 2:2 Monday, 21 June 20:30 Group H Spain Honduras 2:0 Thursday, 24 June 16:00 Group F Slovakia Italy 3:2 Monday, 28 June 20:30 Round of 16 Brazil Chile 3:0 Saturday, 3 July 20:30 Quarter-finals Paraguay Spain 0:1 File:Brazil & Chile match at World Cup 2010-06-28 4.jpg|Brazil vs.Chile File:FIFA World Cup 2010 Brazil North Korea 3.jpg|Brazil vs. DPR Korea File:Slovenia - USA at FIFA World Cup 2010, out.jpg|Slovenia vs. USA ==The stadium today== The stadium was originally developed as a rugby venue and is still the home ground of two rugby teams (Lions and Golden Lions). The stadium is also used by the Orlando Pirates football team. == Other websites == * Official Web Site * Fédération Internationale de Football Association (FIFA) Category:FIFA World Cup stadiums Category:Football stadiums in South Africa Category:Buildings and structures in Johannesburg Category:1982 establishments in Africa Category:1980s establishments in South Africa",
 "title": "Ellis Park Stadium"
}