{
 "id": "250229",
 "text": "Acupuncture is an ancient kind of medical treatment where the doctor sticks needles in certain places of a person's body. The oldest records are at least 2,500 years old. Thin metal needles are pushed into the body at certain places called \"acupuncture points\". It is a form of alternative medicine,Berman, Brian et al 2010. Acupuncture for chronic low back pain. New England Journal of Medicine 363 (5): 454–461. and a key part of Traditional Chinese medicine (TCM).Liu, Gang et al 2013. Effects of painful stimulation and acupuncture on attention networks in healthy subjects. Behavioral and Brain Functions 9 (1): 23. Complete article: It uses the Chinese philosophy of yin and yang. == Effectiveness == There is no general agreement as to whether acupuncture is effective. It is difficult to do good research on this issue.White A.R. et al (International Acupuncture Research Forum) 2001. Clinical trials of acupuncture: consensus recommendations for optimal treatment, sham controls and blinding. Complementary Therapies in Medicine 9 (4): 237–245. Witt, Claudia et al 2012. Effectiveness guidance document (EGD) for acupuncture research - a consensus document for conducting trials. BMC Complementary and Alternative Medicine 12 (1), 148. A 2014 review article said \"researchers usually find that it generally does not matter where the needles are inserted, how often (that is, no dose-response effect is observed), or even if needles are actually inserted. In other words, 'sham' or 'placebo' acupuncture generally produces the same effects as 'real' acupuncture and, in some cases, does better\".Gorski, David H. 2014. Integrative oncology: really the best of both worlds?. Nature Reviews Cancer. A 2013 analysis found little evidence that the effectiveness of acupuncture on pain (compared to sham) was modified by the location of the needles, the number of needles used, the experience or technique of the practitioner, or by the circumstances of the sessions.MacPherson, Hugh et al (Acupuncture Trialists' Collaboration) 2013. Characteristics of acupuncture treatment associated with outcome: an individual patient meta-analysis of 17,922 patients with chronic pain in randomised controlled trials. PLoS ONE 8 (10): e77438. Using the principles of \"evidence-based medicine\" (scientific research) to research acupuncture is controversial, and has produced different results. Some research suggests acupuncture can alleviate pain but the majority of research suggests that acupuncture's effects are mainly due to placebo.Ernst E. 2006. Acupuncture--a critical analysis. Journal of Internal Medicine 259 (2): 125–137. Evidence suggests that any benefits of acupuncture are short-lasting. There is insufficient evidence to support use of acupuncture compared to mainstream medical treatments. Acupuncture is not better than mainstream treatment in the long term.Amezaga Urruela, Matxalen & Suarez-Almazor, Maria E. 2012. Acupuncture in the treatment of rheumatic diseases. Current Rheumatology Reports 14 (6): 589–597. A 2023 review stated that \"acupuncture may represent an effective complementary treatment approach for PD depression; although, the optimal methods and techniques for this population need further investigation\". == Operations using acupuncture == Chinese doctors have claimed to perform surgery with acupuncture as the only anaesthetic. This is a claim which is difficult to test. In some cases at least, the claim has been fraudulent, because morphine, or other sedatives were delivered through a drip.Keng H.C. & Tao N.H. 1985. The evaluation of acupuncture anesthesia must seek truth from facts. (Translated by P. U. Unschuld). In Medicine in China: a history of ideas. Unschuld P.U. (ed). Berkeley: University of California Press.Colquhoun D. & Novella S. 2013. Acupuncture is a theatrical placebo: the end of a myth. Anesthesia & Analgesia 116 (6): 1360–1363. In 2006, a BBC documentary Alternative Medicine filmed a patient undergoing open heart surgery allegedly under acupuncture-induced anesthesia. It was later revealed that the patient had been given a cocktail of anesthetics. == The present == Recently, acupuncture has begun to be used more frequently in the West. In the United States acupuncture has often been used to help control pain and drug and alcohol addiction. It is also often used to treat headaches, asthma, and arthritis. It is widely agreed that acupuncture treatment is safe when done by well-trained doctors using clean needles. It can be dangerous when performed by untrained or unlicensed practitioners however. https://www.hk01.com/article/1070665 Guidelines from the NICE (National Institute for Health and Care Excellence) is that \"The National Institute for Health and Care Excellence (NICE) only recommends considering acupuncture as a treatment option for chronic lower back pain, chronic tension-type headaches and migraine\". == References == == Further reading == * Category:Alternative medicine Category:Chinese culture",
 "title": "Acupuncture"
}