{
 "id": "250598",
 "text": "Ramesses II was one of the greatest Pharaohs of Ancient Egypt.also known as Ramesses the Great and alternatively transcribed as Ramses and Rameses ; also known as Ozymandias in the Greek sources He was the third Pharaoh of the Nineteenth dynasty. The pharaohs who came after him and later Egyptians called him the \"Great Ancestor\".Putnan, James 1990. An introduction to Egyptology. When he was 14, Ramesses was named as the next pharaoh by his father Seti I. He ruled Egypt from 1279 BC to 1213 BC.Rice, Michael 1999. Who's who in Ancient Egypt. Routledge.p165 This is a total of 66 years and 2 months. It is likely that he died in his 90th or 91st year. On his death, he was buried in a tomb in the Valley of the Kings; his body was later moved to a royal cache (hidden wall slot) where it was discovered in 1881. It is now on display in the Cairo Museum. Ramesses II led several military attacks north into the lands east of the Mediterranean (the location of the modern Israel, Lebanon and Syria). He also led expeditions to the south, into Nubia. The early part of his rule was focused on building cities, temples and monuments. He established the city of Pi-Ramesses in the Nile Delta as his new capital and main base for his military attacks on Syria. ==Campaigns & Battles== Early in his life, Ramesses went on campaigns to get land back from Nubian and Hittite hands, and to keep Egypt's borders safe. He also stopped Nubian revolts and ran a campaign in Libya. During Ramesses's reign, the Egyptian army may have included about 100,000 men. Ramsses used this force to bully and influence nearby countries.R. Gabriel, The great armies of antiquity. ===Battle against Sherden sea pirates=== In his second year, Ramesses defeated the Sherden sea pirates. They were causing problems along Egypt's Mediterranean coast by attacking cargo-laden vessels on the sea routes to Egypt.p250 Ramesses posted troops and ships at strategic points along the coast, and allowed the pirates to attack their prey. He then caught them by surprise in a sea battle, capturing them all in a single action.Tyldesley, Joyce 2000. Ramesses: Egypt's greatest Pharaoh. London: Viking/Penguin Books.p53 A stele says they came \"in their war-ships from the midst of the sea, and none were able to stand before them\". Shortly afterwards Sherden are seen in the Pharaoh's body-guard with their horned helmets, round shields and the great Naue II swords. ===Peace treaty with the Hittites=== The Hittite Mursili III fled to Egypt, after he failed to take his uncle's throne. The uncle, Hattusili III, demanded that Ramesses extradite (send back) his nephew back to Hatti.Kitchen, Kenneth 1983. Pharaoh triumphant: the life and times of Ramesses II, King of Egypt. London: Aris & Phillips.p74 This caused a crisis between Egypt and Hatti, when Ramesses said he did not know where Mursili was. The two empires came close to war. Eventually, in the twenty-first year of his reign (1258 BC), Ramesses decided to make an agreement with Hattusili III, to end the conflict. The document they agreed is the earliest known peace treaty in world history.Grimal, Nicholas 1992. A history of Ancient Egypt. Blackwell, Oxford. p256 The peace treaty was recorded in two different versions, one in Egyptian hieroglyphs, the other in Akkadian, using cuneiform script; both versions survive. Such dual-language recording is common to many treaties. This treaty differs from others in that the two language versions are differently worded. Although the majority of the text is identical, the Hittite version claims that the Egyptians came suing for peace, while the Egyptian version claims the reverse.p73–79; 62–64 The treaty was given to the Egyptians in the form of a silver plaque. This 'pocket-book' version was taken back to Egypt, and a copy carved into the Temple of Karnak and Abu Simbel temples. == Death & Aftermath == Ramesses’ mummy has been extensively studied ever since it was discovered and preserved in a museum. His mummy reveals that he had dental problems, severe arthritis, and artery hardening before dying of either old age or heart failure. According to the Quran and Maurice Bucaille, his cause of death was drowning. Ramesses was buried in the Valley of the Kings, and like Queen Nefertari, Ramesses had a magnificent burial chamber. Egypt's power peaked during Ramesses the Great's reign. Several challenges arose following his death. Members of the ruling dynasty were at odds with one another. Furthermore, a group known as the Sea Peoples repeatedly invaded Egypt. The Sea Peoples fought a long war that left Egypt's civilization weak and unsteady even though they never succeeded in conquering Egypt. == References == Category:2nd-millennium BC pharaohs",
 "title": "Ramesses II"
}