{
 "id": "250506",
 "text": "On the Origin of Species is the famous book by Charles Darwin. It gave evidence for evolution, and suggested what had caused evolution to happen.Darwin, Charles; Costa, James T. 2009. The Annotated Origin: a facsimile of the first edition of On the Origin of Species annotated by James T. Costa. Cambridge, Massachusetts, and London, England: Belknap Press of Harvard University. Its full title was On the origin of species by means of natural selection, or the preservation of favoured races in the struggle for life. It was published in London by John Murray in November 1859. It was translated into many languages, and has been in print ever since. The title since the 6th edition of 1872 has been The Origin of Species. This is the most important single book in the biological sciences, and its main ideas are well- supported by modern research.Bowler, Peter J. 2003. Evolution: the history of an idea. 3rd ed, University of California Press, Browne, Janet 2007. Darwin's Origin of Species: a biography. == What the book did == Darwin's book did two things. First, it provided a great deal of evidence that evolution has taken place. Second, it proposed a theory to explain how evolution works. That theory is natural selection. Evolution by natural selection is the key to understanding biology, and the diversity of life on Earth. === Summary === # Within any population, there is natural variation. Some individuals have more favourable variations than others. # Even though all species produce a large number of offsprings, populations remain fairly constant naturally. # This is due to the struggle between members of the same species and different species for food, space, and mate. # The struggle for survival within populations eliminates the unfit individuals. The fit individuals possessing favourable variations survive and reproduce. This is called natural selection (or survival of the fittest). # The individuals having favourable variations pass on these variations to their progeny from generation to generation. # These variations when accumulated over a long period of time, lead to the origin of new species. == Areas of comparative weakness == Darwin's ideas on the connection between natural selection and inheritance were unclear, mainly because the process of genetic inheritance was unknown at that time. This was solved in the mid-20th century by the modern evolutionary synthesis, which showed that Gregor Mendel's genetics was compatible with evolution in small steps. Darwin made almost no mention of the evolution of the human race, though most of the controversy raged around this topic. Darwin eventually published The Descent of Man in 1871. == The book's effects == The Origin was a serious blow to all who interpreted the Bible literally. However, even in 1860, there were many Christians who thought some of the Old Testament could not be literally true. Even the early Church Fathers had not interpreted Genesis literally.p323 Today, both the Anglican and Catholic churches hold that evolution is not inconsistent with their beliefs. The Origin marked a big step in the history of science. Before it, religious leaders often gave their opinions on science; after – though it took time – science increasingly became the business of professional scientists. Darwin's friend Thomas Henry Huxley devoted many years to supporting Darwin, and opposing any interference of religion in science. All aspects of biology have been affected by evolution. Before Darwin, most biology was natural history, done by dedicated amateurs. After Darwin, most biology was done by professionals trained in modern techniques. The book helped this change by providing evolution as the explanation of how living things came to be as they are.Mayr, Ernst 1982. The growth of biological thought. Harvard, p501. == Nature of Darwin's argument == Darwin's aims were twofold: to show that species had not been separately created, and to show that natural selection had been the chief agent of change. Many readers were already familiar with the idea of evolution from a book published anonymously in 1844, Vestiges of the Natural History of Creation (actually by Robert Chambers). In his introduction Darwin ridicules that work as failing to provide a mechanism (a way it could happen).Secord, James A. 2000. Victorian sensation. Chicago: University of Chicago Press, The first four chapters lay out his case that selection in nature, caused by the struggle for existence, is analogous to the selection of variations under domestication.Quammen, David 2006. The reluctant Mr. Darwin. New York: Atlas Books, Darwin presents supporting facts drawn from many disciplines. The idea was to show that his theory could explain a myriad of observations from many fields of natural history that were inexplicable if species had been individually created.Larson, Edward J. 2004. Evolution: the remarkable history of a scientific theory. Modern Library, N.Y. === Contents === *Chapters 1 2: Variation under domestication and under nature. Discusses the variation found within a species. *Chapters 3&4: Struggle for existence, natural selection, and divergence. *Chapter 5: Variation and heredity. *Chapter 6: Difficulties with the theory. *Chapter 7: Deals with the inheritance of instincts. *Chapter 8: Discusses the viability or infertility of hybrids between species and varieties. *Chapters 9&10: The geological record and fossils. *Chapters 11&12: The geographical distribution of animals and plants (biogeography). *Chapter 13: Classification, morphology, embryology, rudimentary organs. *Final chapter: Summary and conclusions. === Later editions === There were six editions of the Origin during Darwin's life. The second, in 1860, was almost the same as the first. The sixth edition bore the title: The origin of species. There were many changes in the text in later editions. In the fifth edition of 1869 Darwin used Herbert Spencer's phrase 'survival of the fittest' for the first time, in the heading of chapter 4. In the sixth and last edition, Darwin uses the word 'evolution' for the first time in this book. There is a new chapter 7 inserted: *Miscellaneous objections to the theory of natural selection The Origin was translated during Darwin's lifetime into Danish, Dutch, French, German, Hungarian, Italian, Polish, Serbian, Spanish and Swedish, and into 18 more languages since. Translations into some languages, such as French and German, were done more than once. == Reference works == There are some reference works which help scholars to do research on the Origin. Peckham, Morse (ed) 1959. The Origin of Species: a variorum text. University of Pennsylvania, Philadelphia. A variorum contains all variants of a text; this records every change made by Darwin to the first edition up to 1890. Horblit H.D. 1964. One hundred books famous in science. Grolier Club. Contains the first full bibliographic description of the first edition. Barrett, Paul H., Weinshank D.J. and Gottleber T.T. 1961, reprint 1981. A concordance to Darwin's Origin of Species, first edition. Cornell, Ithaca & London. This takes every substantive word in the book in alphabetical order, and lists every occurrence with context and page number. Same idea as concordances to the Bible. Stauffer R.C. (ed) 1975. Charles Darwin's Natural Selection being the second part of his big species book written from 1856 to 1858. Edited from manuscript. Cambridge. Freeman, Richard Broke 1965, 2nd ed 1977. The works of Charles Darwin: an annotated bibliographical handlist. Dawson, Folkestone. Includes all the editions and reprints of all Darwin's works, as far as could be ascertained. Also, an on-line version with a few later corrections: :The complete work of Charles Darwin online: Table of contents bibliography of On the Origin of Species: Both web pages provide links to text and images of all editions of The Origin of Species, including translations in German, Danish, and Russian. == Contemporary reviews of the Origin == *. Published anonymously. *. Extract from Proceedings of the American Academy of Arts and Sciences 4 (1860): 411–415. *Gray, Asa (1861). A free examination of Darwin's treatise on the Origin of Species, and of its American reviewers. Reprinted from the Atlantic monthly for July, August, and October, 1860. London: Trübner & Co., Boston: Ticknor and Fields. *. *. Published anonymously. *. Published anonymously. *. *. Published anonymously. *. Published anonymously. *For further reviews, see == Related pages == *Charles Darwin's books == References == Category:Evolutionary biology Category:Biology books Category:1859 books Category:Books by Charles Darwin",
 "title": "On the Origin of Species"
}