{
 "id": "250669",
 "text": "Tarbosaurus was a large carnivorous theropod dinosaur from Asia, especially Mongolia and China. It was a tyrannosaurid dinosaur which flourished between 70 and 65 million years ago, at the end of the Cretaceous period. Tarbosaurus lived in a humid floodplain criss-crossed by river channels. In this environment, it was a predator at the top of the food chain, probably preying on other large dinosaurs like the hadrosaur Saurolophus or the sauropod Nemegtosaurus. Tarbosaurus is known from dozens of specimens, with several complete skulls and skeletons. These remains have allowed scientific studies on its phylogeny, skull mechanics, and brain structure. == Comparison with T. rex == === Skull === Like its close North American relative Tyrannosaurus rex, it had a large head and powerful jaws, but was not top heavy. Its huge skull was comparatively light, with large air pockets. Many of its bones were hollow, making them strong but light, so they did not add excessive weight to this large predator. Its skull was similar to that of Tyrannosaurus, but more rigid. Also, because its skull was not so broad at the back, it did not have binocular vision like Tyrannosaurus. In the lower jaw, a ridge on the outer surface of the angular bone articulated with the rear of the dentary bone, creating a locking mechanism unique to Tarbosaurus and Alioramus. Other tyrannosaurids lacked this ridge and had more flexibility in the lower jaw. === Limbs === Its forlimbs were small with two fingers, as with its larger relative. The small, two-fingered, front limb is absolutely distinctive of tyrannosaurids. The three-toed hind limbs were long and thick, supporting the body in a bipedal posture. The long, heavy tail served as a counterweight to the head and torso and put the center of gravity over the hips.Maleev, Evgeny A. 1955. New carnivorous dinosaurs from the Upper Cretaceous of Mongolia. (in Russian). Doklady Akademii Nauk SSSR 104: 779–783.Holtz, Thomas R. 2004. \"Tyrannosauroidea\". in Weishampel, David B.; Dodson, Peter; and Osmólska, Halszka (eds) The Dinosauria 2nd ed, Berkeley: University of California Press. pp111–136. . == Palaeobiology == Some scientists think the more rigid skull of Tarbosaurus was an adaptation to hunting the massive sauropods found in Asia, which did not exist in most of North America during the later Cretaceous. :\"Both Asiatic and North American... tyrannosaurines [NAT] hunted large prey, whilst also being opportunistic scavengers. However, the prey available to them were obviously different... the adult T. rex... probably specialized in bringing down large horned dinosaurs, like Triceratops... but this group was absent outside North America. Thus, the Mongolian tyrannosaurines were forced to feed on sauropods... These differences in typical prey items might have exerted different selective pressures, concerning hunting strategy and mechanical requirements maximizing their success rate as predators\". :\"The new material studied in this paper allows us to speculate if the tyrannosaurines can be divided into NATs and an Asiatic group\".Hurum, Jørn H.; and Sabath, Karol. 2003. Giant theropod dinosaurs from Asia and North America: skulls of Tarbosaurus bataar and Tyrannosaurus rex compared (PDF). Acta Palaeontologica Polonica 48: 161–190. http://www.app.pan.pl/archive/published/app48/app48-161.pdf. == References == Category:Theropods Category:Tyrannosaurids Category:Dinosaurs of Asia",
 "title": "Tarbosaurus"
}