{
 "id": "250740",
 "text": "Mediacorp is a Singapore-owned media company that provides free to air channels (free channels). It is made up of different companies. They are: * Mediacorp TV - company in charge of FTA channels * Mediacorp Radio - company in charge of radio stations * Okto - Television Channel The headquarters of Mediacorp is at 1 Stars Avenue. == Mediacorp TV == Mediacorp TV (Also known as Mediacorp TV Pte Ltd) has a total of 6 channels under it. They are: Channel Description Channel 5 Channel 5 shows different types of programmes like drama, variety, news, comedy, sports, and movies. This channel shows all the Singapore-made English drama and those from America. There is another HD version of this channel, Mediacorp HD5. This channel runs for 24 hours. Channel 8 Channel 8 is a Mandarin-language channel. It is the most-watched channel in Singapore. The channel shows local and regionally-made Chinese dramas, variety shows, news and current-affairs programmes. Special Chinese- language events are also shown on this channel. It runs for 24 hours. Channel U Channel U is Mediacorp's second Chinese-language channel. This channel is more for younger people, giving them another choince from traditional commercial television programming. It has a tagline 最精彩, or \"The Most Exciting\". Other than local programmmes, most East Asian dramas (especially Korean and Japanese) are shown on this channel. Suria Suria is a Malay- language channel showing Malay dramas and popular programmes. Its tagline, \"Suria, Sinar Bersama Anda \", means \"Suria, Shines With You\". Vasantham Vasantham is an Indian language channel. It is an important channel for local news and current affairs for the Indians. Vasantham would like to be the Pulse of the Indian Community. The channel has many Tamil and Indian movies, especially during the weekends. CNA Channel NewsAsia is an English-language news channel. The channel features international news and current affairs. It shows to more than 20 Asian countries and territories. == Mediacorp Radio == MHz Station Language Website/Webcast 89.7 Ria Malay https://www.melisten.sg/radio/ria-897 90.5 Gold English https://www.melisten.sg/radio/gold-905 92.4 Symphony English https://www.melisten.sg/radio/symphony-924 93.3 YES (顶尖流行音乐电台，引领潮流时代) Chinese https://www.melisten.sg/radio/yes-933 93.8 CNA938 English https://www.melisten.sg/radio/cna938 94.2 Warna Malay https://www.melisten.sg/radio/warna-942 95.0 Class 95 English https://www.melisten.sg/radio/class-95 95.8 Capital (城市频道) Chinese https://www.melisten.sg/radio/capital-958 96.8 Oli (ஒலி) Tamil https://www.melisten.sg/radio/oli-968 97.2 Love (最爱频道) Chinese https://www.melisten.sg/radio/love-972 98.7 987 English https://www.melisten.sg/radio/987 Category:Mass media in Asia Category:Companies of Singapore",
 "title": "Mediacorp"
}