{
 "id": "250925",
 "text": "Benjamin K. Sovacool is an academic at the Vermont Law School. He has written several books and many journal articles. ==Research work== Sovacool's research interests include energy policy and environmental issues. He has published more than 90 academic papers in journals like The Electricity Journal and Energy Policy. He has also appeared on the BBC World News, Bloomberg Live!, and Channel News Asia and been interviewed by Newsweek International, Associated Press, United Press International. His work on carbon emissions from nuclear power stations has also been reviewed in Nature.Kurt Kleiner. Nuclear energy: assessing the emissions, Nature Reports Climate Change, 24 September 2008. ==Books== In 2007, Sovacool edited Energy and American Society: Thirteen Myths which has been reviewed in Energy PolicyFereidoon P. Sioshansi. Energy and American Society—Thirteen Myths (Book Review) Energy Policy, 35 (2007), pp. 6554–6555. and the Annals of the Association of American Geographers. In 2008, he wrote The Dirty Energy Dilemma: What’s Blocking Clean Power in the United States which was published by Praeger and won a 2009 Nautilus Award. In Contesting the Future of Nuclear Power (2011) Sovacool says that \"energy efficiency programs and renewable power technologies are better than nuclear power plants\". His other books include: * Miguel Mendonça, David Jacobs and Benjamin K. Sovacool (2009). Powering the Green Economy: The Feed-In Tariff Handbook, Earthscan. * Benjamin K. Sovacool (2010). Climate Change and Energy Security: A Global Overview of Technology and Policy Options, MIT Press. * Benjamin K. Sovacool (Ed.) (2011). The Routledge Handbook of Energy Security, Routledge. * Benjamin K. Sovacool et al. (forthcoming). International Politics of Nuclear Power. ==Related pages== * Amory Lovins * Renewable energy commercialization * Mycle Schneider ==References== Category:Year of birth missing (living people) Category:Living people Category:Academics from Vermont",
 "title": "Benjamin K. Sovacool"
}