{
 "id": "251187",
 "text": "Kesha Rose Sebert, known simply as Kesha (stylized as Ke$ha until 2014; born March 1, 1987) is an American singer and songwriter. She has become famous for her style of dance-pop and electropop music, as well as her rap-singing of the lyrics to many of her biggest hits. She has three number-one songs in the U.S. They are \"Tik Tok\" (2009), \"We R Who We R\" (2010; number-one debut), and \"Timber\" with rapper Pitbull (2013). Kesha has also released the albums Animal (2010) and Warrior (2012), along with the EP Cannibal (2010) and the remix album I Am the Dance Commander + I Command You to Dance (2011). She also helped to co-write Britney Spears' 2011 single \"Till the World Ends\". She is also known for songs such as \"Your Love Is My Drug\", \"Blow\", \"Take It Off\", \"Die Young\", and \"Blah Blah Blah\", a collaboration with the alternative band 3OH!3. ==Early life== Kesha Rose Sebert was born in Los Angeles, California, on March 1, 1987. She was raised by her single mother, Pebe Sebert, and moved to Nashville, Tennessee in 1991. She has one older brother and one younger brother. ==Career== In 2005, Kesha was in an episode of The Simple Life, which starred Paris Hilton and Nicole Richie. Her first single \"Tik Tok\" reached number one in the US, Australia, and Canada. \"Tik Tok\" became the best- performing song of 2010 in the United States. She has sold 55 million records. In 2010, Kesha's first album Animal was released. Her first extended play Cannibal was released later that year. Her third studio album, Warrior, was released in 2012. In late 2013, Kesha was featured on rapper Pitbull's single \"Timber\". The song reached number one in Australia, Canada, the UK, and the US. In July 2017, she released the single \"Praying\", along with its music video, and announced a new studio album, Rainbow. The song reached the top 30 in Australia, the UK, US, and Canada. It is notably different from her other singles because it does not use the dance-pop or electropop genres that she is known for. Kesha released her fourth studio album, High Road, on January 31, 2020. It entered the Billboard 200 album chart at number seven. ==Personal life== Kesha is a vegetarian and is openly bisexual. Early in her career, Kesha stated that the use of a dollar sign ($) in her stage name was meant to be ironic, as she was not raised in a wealthy household. In January 2014, Kesha entered rehab for treatment for an eating disorder. Her mother says that her disorder started when she was 18. Later that year, she announced that her name would be styled back to Kesha instead of Ke$ha, and her Twitter username was changed from @keshasuxx to simply @KeshaRose. In February 2016, Kesha appeared in federal court in New York City to end her contract with Sony Music and the producer Dr. Luke—who has produced many of her biggest hits—claiming that he sexually and emotionally abused her. The court ruled that Kesha is to remain under her contract with Sony but is able to work with other producers. However, Kesha's lawyers argued that remaining with the same label would not benefit her. Other recording artists, such as Lady Gaga, Taylor Swift, Adele, and Demi Lovato, have shown support during Kesha's legal troubles. == Discography == * Animal (2010) * Warrior (2012) * Rainbow (2017) * High Road (2020) * Gag Order (2023) == Tours == Headlining * Get Sleazy Tour (2011) * Warrior Tour (2013–2015) * Kesha and the Creepies: Fuck the World Tour (2016–2017) * Rainbow Tour (2017–2019) * Kesha Live (2021) * Only Love Tour (2023) * House of Kesha (2024-2025) Co-headlining * North American Tour 2013 (with Pitbull) (2013) * The Adventures of Kesha and Macklemore (with Macklemore) (2018) Supporting * Rihanna – Last Girl on Earth (2010) Cancelled * High Road Tour (2020) == Filmography == * Bravo Supershow (2007) * Final Flesh (2009) * Walt Disney's Princess Ke$ha (2011) * Katy Perry: Part of Me (2012) * Jem and the Holograms (2015) * A Ghost Story (2017) * Rainbow: The Film (2018) ==References== ==Other websites== * Kesha's official website Category:1987 births Category:Living people Category:21st-century American singer-songwriters Category:American LGBT rights activists Category:American pop singers Category:Musicians from Nashville, Tennessee Category:Singers from Nashville, Tennessee Category:Writers from Nashville, Tennessee Category:Singer-songwriters from California Category:Singers from Los Angeles Category:Bisexual people Category:American pop rappers Category:American vegetarians Category:Synth-pop singers",
 "title": "Kesha"
}