{
 "id": "251651",
 "text": "Penang (also known Pulau Pinang) is a state in Malaysia. It is on the northwestern part of Malaysia. The capital city of Penang is George Town. by the Strait of Malacca. A resident of Penang is known as a Penangite. It has two parts – Penang Island and Butterworth on the mainland. The state of Penang is next to Kedah to the north and east, and Perak to the south. ==History== From the 14th century Portuguese traders set foot on the island of Penang. They were looking for spices to sell. Then, many years later Chinese traders arrived and it was then the island was first put onto a map. On 17 July 1786, Captain Francis Light, an English sailor landed on the island. He built a fort called Fort Cornwallis, On 12 August 1786, Light renamed the island Prince of Wales Island after the Prince of Wales. He named the new town George Town in honour of King George III of England. * 1941: Penang is heavily bombed by the Japanese invaders. Soon after this the English gave up Penang. * 1945: Japan surrenders and is chased away from Malaysia. Soon after the 2nd World War ended. As a result the English came back to Penang. * In 1957 Malaysia became independent. ==Geography== Penang is a geographically divided into two sections: * Penang Island an island located in the Straits of Malacca; * Seberang Perai: a narrow strip of land. The geography of Seberang Perai is mostly flat. It has a long coastline, the majority of which is lined with mangrove. The island of Penang is composed of two districts: * Northeast District * Southwest District The north and east of Penang island is very built up. Here is where most of the population live. This includes: Batu Ferringhi, Tanjong Bungah, Tanjong Tokong and Georgetown The north west and middle of the island is covered with thick forest. ===Climate=== The highest temperature ever recorded in Penang was 40.0°C (104.0°F) on 22 January 1976 and the lowest was 15.0°C (59.0°F) on 24 November 1979. As in the rest of Malaysia, Penang has a tropical rainforest climate bordering on a tropical monsoon climate, although the state does experience slightly drier conditions from December to February of the following year. The climate is very much dictated by the surrounding sea and the prevailing wind system. Penang's proximity with the island of Sumatra makes it susceptible to dust particles carried by wind from perennial but transient forest fires, creating a phenomenon known as the Southeast Asian haze. The Penang Meteorological Office in Bayan Lepas is the primary weather forecast facility for northern Malaysia. Temperature (day) 30–32 °C Temperature (night) 23–24 °C Ave annual rainfall 2408 mm Relative humidity 73%–84% ==Art== === Street Art === In 2012 artist Ernest Zacharevic created a series of 6 wall paintings. Since these paintings, the street art scene has grown. There are lots of examples around Georgetown. Many people come to the city just to see them! ===Art Galleries=== ==Society== The population of Penang is 1,902,116 as of 2016.[3] It is very crowded with lots of construction going on. Penang Island has a population of 711,102 in 2016. Penang Island is the most populated island in Malaysia. There are many people and cultures in Penang. Malays, Chinese, Indian (Malaysian Indian), Europeans, Australians, Americans, Indonesians, Myanmar, Vietnam, Thailand, and South Asian nations. Because of this, Penang is very famous for its delicious food! Other clues that tell us where people moved here from include the buildings and the languages spoken. ==References== *:en:Penang Retrieved 31st August 2016 == Other websites == * * *:en:Penang Retrieved 31st August 2016 *http://www.wonderfulmalaysia.com/history-penang-island-malaysia.htm",
 "title": "Penang"
}