{
 "id": "252231",
 "text": "Hatshepsut (1507–1458 BC), meaning Foremost of Noble Ladies,Clayton, Peter. Chronicle of the Pharaohs, Thames & Hudson Ltd, 1994. p104 was the fifth Pharaoh of the 18th dynasty of Ancient Egypt. Hatshepsut reigned longer than any other woman of an indigenous Egyptian dynasty. Her father was Thutmose I. Her predecessor was Thutmose II (her brother and husband). Her successor was Thutmose III, her nephew, the son of Thutmose II by a lesser wife. Thutmose III was co-regent with his stepmother, and was head of the army, but Hatshepsut was the effective ruler, and the named Pharaoh. Today it is generally recognized that Hatshepsut assumed the position of Pharaoh. The length of her reign usually is given as twenty-two years. The third-century B.C. historian, Manetho, gave that figure of twenty-one years and nine months, and he had access to many records that now are lost. She died in 1458 BC, which means that she became pharaoh in about 1479 BC. ==Major accomplishments== Hatshepsut established the trade networks that had been disrupted during the Hyksos occupation of Egypt during the Second Intermediate Period. Many Egyptologists have claimed that her foreign policy was mainly peaceful.Tyldesley, Joyce 1998. Hatchepsut: The female Pharaoh. Penguin, pp. 137–144. However, there is evidence that Hatshepsut led successful military campaigns in Nubia, the Levant, and Syria early in her career. The conquered lands being taxed and looted made egypt rich. ===Building projects=== Hatshepsut was one of the most prolific builders in ancient Egypt. She commissioned hundreds of construction projects throughout both Upper Egypt and Lower Egypt, that were grander and more numerous than those of any of her Middle Kingdom predecessors. Later pharaohs attempted to claim some of her projects as theirs. She employed the great architect Ineni. He also had worked for her father, her husband, and for the royal vizier Senemut. During her reign, so much statuary was produced that almost every major museum in the world has Hatshepsut statuary among their collections. For example, the Hatshepsut Room in New York City's Metropolitan Museum of Art is made up of some of these pieces. Following the tradition of most pharaohs, Hatshepsut had monuments built at the Temple of Karnak. At Karnak, she also restored the original Precinct of Mut, an ancient goddess of Egypt, that had been damaged by the Hyksos occupation. She had twin obelisks, at the time the tallest in the world, erected at the entrance to the temple. One still stands, as the tallest surviving ancient obelisk on Earth. The other has broken in two and fallen down. As with many pharaohs, the masterpiece of Hatshepsut's building projects was her mortuary temple. She built hers in a complex at Deir el- Bahri. It was designed and implemented by Senemut at a site on the West Bank of the Nile River near the entrance to what now is called the Valley of the Kings. The focal point was the Djeser-Djeseru or \"the Sublime of Sublimes\", a structure of perfect harmony built nearly one thousand years before the Parthenon. Djeser-Djeseru sits on a series of agricultural terraces that once had lush gardens. Djeser-Djeseru is built into a cliff face that rises sharply above it. Djeser-Djeseru and the other buildings of Hatshepsut's Deir el-Bahri complex were significant advances in architecture. Another of her accomplishments is the Hatshepsut needle (the granite obelisk). === Amun === The Oracle of Amun proclaimed that it was the will of Amun that Hatshepsut be pharaoh, which strengthened her position. She showed Amun's support by having these proclamations by the god Amun carved on her monuments: :\"Welcome my sweet daughter, my favorite, the King of Upper and Lower Egypt, Maatkare, Hatshepsut. Thou art the Pharaoh, taking possession of the Two Lands\".Breasted, James Henry 1906. Ancient Records of Egypt: historical documents from the earliest times to the Persian conquest. University of Chicago Press. 116–117. == References == Category:2nd-millennium BC pharaohs Category:15th-century BC people",
 "title": "Hatshepsut"
}