{
 "id": "25296",
 "text": "Charles V (24 February 1500 21 September 1558) was Holy Roman Emperor from 1519, King of Castile and Aragon from 1516, and Lord of the Low Countries as Duke of Burgundy from 1506. Philip the Handsome (son of Maximilian I of Austria and Mary of Burgundy) and Joanna the Mad (daughter of Ferdinand II of Aragon and Isabella I of Castile) were his parents. He ruled Austria, Spain, Two Sicilies, Sardinia, Germany, Belgium, Holland, Luxembourg, Hungary, Bohemia, Croatia, Mexico, Peru, and Venezuela. His Majesty or His Imperial Majesty was first used when he was king. His Empire became large and was known as \"in which the sun does not set\". He was also known as \"The Emperor of Universal Dominion.\" He divided his empire between his brother Ferdinand I, Holy Roman Emperor and his son Philip II of Spain. ==Issue== Charles and Isabella had seven legitimate children, but only three of them survived to adulthood. Charles also had natural children before he married and after he was widowed. Name Portrait Lifespan Notes Philip II of Spain 21 May 1527 – 13 September 1598 Only surviving son, successor of his father in the Spanish crowns and became king of Portugal. Maria 21 June 1528 – 26 February 1603 Married her first cousin Maximilian II, Holy Roman Emperor. Ferdinand 22 November 1529 – 13 July 1530 Died in infancy. Son 29 June 1534 Stillborn. Joanna 24 June 1535 – 7 September 1573 Married her first cousin João Manuel, Prince of Portugal. John 19 October 1537 – 20 March 1538 Died in infancy. Son 21 April 1539 Stillborn. Due to Philip II being a grandson of Manuel I of Portugal through his mother he was in the line of succession to the throne of Portugal, and claimed it after his uncle's death (Henry, the Cardinal-King, in 1580), thus establishing the personal union between Spain and Portugal. Charles also had six children out of wedlock: * Infanta Isabella of Castile (20 August 1518 – 1537), perhaps daughter of Charles's maternal step- grandmother, Germaine of Foix, but strongly disputed by biographer Geoffrey Parker;Parker, Emperor, 545–546 Isabella died at the age of 19, never married, and had no issue. * Margaret of Austria (1522–1586), daughter of Johanna Maria van der Gheynst, who Charles recognizedThomas, The Golden Empire, 37 a servant of Charles I de Lalaing, Seigneur de Montigny, daughter of Gilles Johann van der Gheynst and wife Johanna van der Caye van Cocamby. Married firstly with Alessandro de' Medici, Duke of Florence, and secondly with Ottavio Farnese, Duke of Parma. * Joanna of Austria (1522–1530), daughter of Catalina de Rebolledo (or de Xériga), lady-in-waiting of Queen Joanna I of Castile and Aragon or attached to the household of Henry of Nassau. She was brought up in an Augustinian convent in Madrigal de las Altas Torres. * Tadea of Austria (1523? – ), daughter of Orsolina della Penna. Married to Sinibaldo di Copeschi.Thomas, The Golden Empire, 37–38 * Cornelis de Hooghe (1541-1583), Dutch cartographer * John of Austria (1547–1578), victor of the Battle of Lepanto, son of Barbara Blomberg.Parker, Geoffrey. Emperor, pp. 400–401, 483–484, 560 ==Notes== ==Regnal titles of Charles V== Title Title From To Regnal name Titular Duke of Burgundy 25 September 1506 25 October 1555 Charles II Duke of Brabant 25 September 1506 25 October 1555 Charles II Duke of Limburg 25 September 1506 25 October 1555 Charles II Duke of Lothier 25 September 1506 25 October 1555 Charles II Duke of Luxemburg 25 September 1506 25 October 1555 Charles III Margrave of Namur 25 September 1506 25 October 1555 Charles II Count Palatine of Burgundy 25 September 1506 5 February 1556 Charles II Count of Artois 25 September 1506 25 October 1555 Charles II Count of Charolais 25 September 1506 21 September 1558 Charles II Count of Flanders 25 September 1506 25 October 1555 Charles III Count of Hainault 25 September 1506 25 October 1555 Charles II Count of Holland 25 September 1506 25 October 1555 Charles II Count of Zeeland 25 September 1506 25 October 1555 Charles II King of Castile and León 14 March 1516 16 January 1556 Charles I King of Aragon 14 March 1516 16 January 1556 Charles I King of Sicily 14 March 1516 16 January 1556 Charles I (II) Count of Barcelona 14 March 1516 16 January 1556 Charles I King of Naples 14 March 1516 25 July 1554 Charles IV Archduke of Austria 12 January 1519 12 January 1521 Charles I Holy Roman Emperor 28 June 1519 27 August 1556 Charles V King of the Romans 23 October 1520 24 February 1530 Charles V Count of Zutphen 12 September 1543 25 October 1555 Charles II Duke of Guelders 12 September 1543 25 October 1555 Charles III ==References== Category:1500 births Category:1558 deaths Category:Holy Roman Emperors Category:Spanish monarchs Category:Kings and Queens of Italy Category:Counts and countesses of Flanders Category:16th century in Germany",
 "title": "Charles V, Holy Roman Emperor"
}