{
 "id": "25291",
 "text": "This page is not to be confused with the page of Republika Srbija which redirects to Serbia Republika Srpska (Serbo-Croatian: Република Српска / Republika Srpska) is one of the two parts of Bosnia and Herzegovina. The other part is the Federation of Bosnia and Herzegovina, and there is also a special city that is not in either, the Brčko District. It is located in Southeastern Europe, more precisely in the western part of the Balkan Peninsula. The largest city is Banja Luka and is the seat of most of the institutions of the Republika Srpska, as well as its political, administrative, economic and university center. Srpska shares a state border with the Republic of Serbia, Montenegro and the Republic of Croatia, and the inter-entity demarcation line with the Federation of Bosnia and Herzegovina. Srpska was created due to the Bosnian War. == Regions == Republika Srpska has seven main parts (called regions). They are: Region Municipalities Comments 1\\. Banja Luka Banja Luka (City status), Čelinac, Gradiška, Istočni Drvar, Jezero, Kneževo, Kostajnica, Kotor Varoš, Kozarska Dubica, Krupa na Uni, Kupres, Laktaši, Mrkonjić Grad, Novi Grad, Oštra Luka, Petrovac, Prijedor (City status), Ribnik, Srbac, Šipovo, Teslić 2\\. Doboj Brod, Derventa, Doboj (City status), Donji Žabar, Modriča, Pelagićevo, Petrovo, Prnjavor, Stanari, Šamac, Vukosavlje 3\\. Bijeljina Bijeljina (City status), Lopare, Ugljevik 4\\. Vlasenica Bratunac, Milići, Osmaci, Srebrenica, Šekovići, Vlasenica, Zvornik (City status) 5\\. Sarajevo-Romanija or Sokolac Han Pijesak, Istočna Ilidža, Istočno Novo Sarajevo, Istočni Stari Grad, Istočno Sarajevo (City status), Pale, Rogatica, Sokolac, Trnovo 6\\. Foča Čajniče, Foča, Kalinovik, Novo Goražde or Ustiprača, Rudo, Višegrad 7\\. Trebinje Berkovići, Bileća, Gacko, Istočni Mostar, Ljubinje, Nevesinje, Trebinje (City status) Brčko District Brčko District is place controlled by Bosnia and Herzegovina instead. ==Related pages== * Municipalities of Republika Srpska == References == == Other websites == Category:Regions of Republika Srpska Category:1995 establishments in Europe Category:20th-century establishments in Bosnia and Herzegovina",
 "title": "Republika Srpska"
}