{
 "id": "253096",
 "text": "Boston is the largest city of Massachusetts in the United States. It was founded in 1630. Boston is one of the oldest, richest and most culturally important cities in the United States. == History == Boston was founded on September 7, 1630, by Puritan colonists from England. Boston's early European settlers called the area Trimountaine (Three Mountains). They renamed the town for Boston, England, in Lincolnshire because many important \"Pilgrim\" colonists came from there. From 1659 to 1681, Pilgrims banned Christmas celebrations in the city because they believed it to be a corrupt holiday. Most of Boston's early citizens were Puritans. Shortly after Boston's settlement, Puritans created America's first public school and America's first university, Harvard University (1636). Harvard is in the city of Cambridge, which is across the Charles River from Boston. Until the 1760s, Boston was America's largest city. During the early 1770s, the British tried to control the thirteen colonies with taxes. This made people from Boston start the American Revolution. The Boston Massacre, the Boston Tea Party, and several early battles happened in or near the city. It held its first town meeting in Faneuil Hall in 1743. Boston continued to grow and attract immigrants from around the world. Many immigrants came from Ireland, and gave Boston a very Irish culture that remains today. President John F. Kennedy was a member of an Irish-American family that lived in Boston. Many immigrants also came from Italy, and lived in Boston's North End, where Italian culture remains, with various Italian stores, restaurants, bakeries, and homes. On 15 April 2013, two bombs exploded at the Boston Marathon. == Geography == Boston is located on the Shawmut Peninsula. The city covers . Boston Harbor and the Atlantic Ocean is located east of the city. A much larger metropolitan area surrounds Boston. The highest point in Boston is Bellevue Hill, at above sea level. The lowest point is at sea level. Boston is the only state capital in the contiguous United States with an ocean coastline. === Climate === Boston has a continental climate with some ocean effects. Summers are normally warm to hot, rainy, and humid, while winters alternate between periods of cold rain and snow, with cold temperatures. Spring and fall are usually mild. Existing wind patterns that blow offshore lower the effect of the Atlantic Ocean. The hottest month is July, with an average temperature of . The coldest month is January, with an average of . Extremes have ranged from on February 9, 1934, up to on July 4, 1911. Boston's location on the North Atlantic moderates its temperature, but makes the city very likely to suffer from Nor'easter storm systems that can produce much snow and rain. The city averages of precipitation a year, with of snowfall per year. == Towers == The tallest towers in Boston are the Prudential Tower and the John Hancock Tower. == Culture == Boston has a culture that is quite similar to New England, such as a New England accent and foods that are mostly seafood, salt, and dairy products. Irish-Americans are very important in Boston's politics and religious activities. Boston people also have a style of talking which is called Boston slang. It is often thought that Bostonians have a strong sense of culture. Perhaps this is because Boston is famous for being a very intellectual place, with much of its culture coming from its universities. The city has many complex theatres, including the Cutler Majestic Theatre, Boston Opera House, Citi Performing Arts Center, the Colonial Theater, and the Orpheum Theatre. The headquarters of Unitarian Universalism (UU) is located in Boston. The Christian Science movement has also made its home in the Boston area. Boston has many historic places and Bostonians take pride in their city's history. The American Revolution began in Boston, and many of its leaders, such as Samuel Adams, John Adams, John Hancock, and Paul Revere were from the city. Many of the sites from the Revolution are preserved in the city, including Faneuil Hall, the Old State House, Park Street Church, and others. These form the \"Freedom Trail\", a walk that takes visitors past many historic places in the city. == Boston today == Boston is one of the United States' most important cities in education and health care. Boston and the towns around it contain many of the country's leading universities. Harvard, MIT, and Boston University are some of the most famous. Professional sports are an important part of life in Boston. The Red Sox play baseball at Fenway Park, the oldest stadium in Major League Baseball (1912). The Celtics, a basketball team, and the Bruins, a hockey team, both play at the TD Garden. Boston's football team, the New England Patriots, play in Foxborough, a town 22 miles south of the city. ==Demographics== ===People=== In 2020, the population of Boston was 675,647. The population had grown 9.4% since 2010. Boston has 13,977 people per square mile. The population is 47.3% male and 52.7% female. The racial breakdown is shown in the Racial Groups table. The people from outside the United States are 178,805. 27.7% of the population come from outside of the United States. Racial groups Race 2020 White (includes White Hispanics) 47.1% Black 20.6% Amerindian 0.4% Asian 11.3% Two or more races 10.5% Hispanic or Latino (of any race) 18.7% Non-Hispanic Whites 44.6% ====Homeless population==== The unemployment rate in Boston is 5.9% since June 2014. The 35th annual homeless census from 2015 said there were 7,663 homeless men, women, and children in Boston. The homeless population increased 5.6% since 2013. The number of homeless people sleeping on the streets decreased by 22.8% since 2013. However, the number of adults in emergency shelters has grown by 10.9%. In 2015, the homeless family population increased by 25%. The total number of homeless men, woman, families and children increased by 20.9% from 3,541 to 4,281. Mayor Marty Walsh announced his goal to help those in need for a permanent housing solution. Agencies such as Pine Street Inn, Boston Healthcare, Project Hope, and Boston Public Health Commission are helping the homeless. The homeless are helped by reducing family evictions. Property management companies and nonprofits, such as Project Hope and the Department of Neighborhood Development, will increase affordable housing options. Boston Public Health Commission and the Department of Neighborhood Development will work together to provide support for treatment options and shelters. The Wyman Re-Entry Center has a 90-day residential substance-abuse and recovery program. The Safe Harbor serves adults with HIV. The project SOAR stands for Stability, Opportunity, Achievement, and Recovery, and helps clients maintain a healthy lifestyle and provide support in moving to permanent housing. ===Education=== About 89.1% of the population ages 25 years and over in Boston have a high school diploma or higher in 2022. Those with a Bachelor's degree or higher make up 54.2% of the population. Some of the Colleges and Universities in Boston are: * Baystate College * Benjamin Franklin Institute of Technology * Berklee College of Music * Boston University * Boston College * Bunker Hill Community College * Emerson College * Emmanuel College * Fisher College * Massachusetts College of Art and Design * MGH Institute of Health Professions * New England College of Business and Finance * Northeastern University * School of the Museum of Fine Arts, Boston * Simmons College * Suffolk University * Wentworth Institute of Technology * Wheelock College * University of Massachusetts Boston There are many more not listed here. == Transportation == The MBTA runs the city's subway (known as \"the T\"), commuter rail, buses, and ferries. The main airport for the city is Logan International Airport. The main highways for the area are: Number Highway 93 Interstate 93 90 Interstate 90 95 Interstate 95 495 Interstate 495 Tunnels Tunnel Carries Opened Notes Boston Harbor tunnels Sumner Tunnel Route 1A South 1934 Toll of $3.50 for non-commercial vehicles and $5.25 for commercial vehicles. Callahan Tunnel Route 1A North 1961 Repair work to this tunnel caused complete closure of the tunnel, which began at 11 pm on December 27, 2013 and ended on March 12, 2014. Ted Williams Tunnel Interstate 90 both East and West 1995 built for the Big Dig Mainland tunnels Thomas P. O'Neill Jr. Tunnel Interstate 93 North and South 2003-2006 built for the Big Dig Dewey Square Tunnel Interstate 93 south (Congress st to Kneeland st) 1959 City Square Tunnel US Route 1 built for the Big Dig Bridges Bridge Name Opened Notes Charlestown Bridge 1900 connects Charlestown with Downtown area Leverett Circle Connector Bridge 1999-10-07 connects Storrow Drive with Interstate 93, built for the big dig Tobin Bridge 1950-02-27 Is more than two miles (3 km) from Charlestown to Chelsea over the Mystic River in Massachusetts. The bridge is the largest in New England. Leonard P. Zakim Bunker Hill Memorial Bridge (Zakim Bridge) 2003 built for the Big Dig, carries Interstate 93 North and South ==References== ;Notes == Related pages == * Boston Symphony Orchestra == Further reading == * Boston: A to Z (2000), Thomas H. O'Connor, * Built in Boston: City and Suburb, 1800–2000 (2000), Douglass Shand-Tucci, * Lost Boston (1999), Mariner Books, * Boston: A Topographical History, Third Enlarged Edition (2000), Belknap Press, * When in Boston: A Time Line & Almanac (2004), Northeastern, * Gaining Ground: A History of Landmaking in Boston (2003), Nancy S. Seasholes, * Boston's Secret Spaces: 50 Hidden Corners In and Around the Hub, (2009), Globe Pequot; First edition * AIA Guide to Boston, 3rd Edition: Contemporary Landmarks, Urban Design, Parks, Historic Buildings and Neighborhoods, (2008), Michael Southworth and Susan Southworth, GPP Travel, * Boston: A Pictorial Celebration (2006), Jonathan M. Beagle, Elan Penn (photographer), * City in Time: Boston (2008), Jeffrey Hantover, Gilbert King (photographer), * Mapping Boston (2001), Alex Krieger (editor), David Cobb (editor), Amy Turner (editor), Norman B. Leventhal (Foreword by) MIT Press, * Boston Beheld: Antique Town and Country Views (2008), D. Brenton Simons, University Press of New England, * Boston (2010) by Jordan Worek; photographs by Bill Horsman, Firefly Books, == Other websites == * * City of Boston official website * Greater Boston Chamber of Commerce * Greater Boston Convention and Visitors Bureau * WikiSatellite view of Boston at WikiMapia * Mayor Marty Walsh * Boston Public Health Commission Category:1630 establishments in Massachusetts Category:County seats in Massachusetts Category:State capitals in the United States",
 "title": "Boston"
}