{
 "id": "253114",
 "text": "The Parti Québécois (PQ) is a political party that wants Quebec to secede from Canada and become an independent country. ==History== The Parti Québécois, or PQ was founded by René Lévesque. PQ's main goals are to get independence for Quebec. In the provincial election of 1976, the Parti Québécois was elected to the government of Quebec for the first time. René Lévesque, became the premier of Quebec. Many French people in Quebec were happy to see the Lévesque as premier. Many English people were not happy. The PQ passed a bill called Bill 101. This is a law that makes French the only official language of Quebec. It restricts the use of English in Quebec, even though English and French are both official languages of Canada. The party was elected again in the 1981 election. In November 1984 founder René Lévesque left the party and the PQ lost the 1985 election. The Parti Québécois started the first Quebec referendum, having the citizens vote to decide to either leave Canada or stay a part of the country. 60% of the people who voted decided to stay in Canada. They had a second referendum in 1995. The citizens once again voted to stay in Canada. The leader of the party, Jacques Parizeau, resigned after the referendum failed. The current Bloc Québécois leader Gilles Duceppe was the first to announce that he would to try to become the leader of the PQ, on May 11, 2007. Pauline Marois also said she was going to try to become leader. Duceppe changed his mind on the 12th leaving Marois the only candidate. On June 26, 2007 Marois won the leadership. She said that the PQ plans to have another referendum in the future. On September 4, 2012, Marois led her party to minority victory in the Quebec general election. She was the first female premier in the province's history. After an electoral defeat in 2014, she resigned. Following her resignation, Jean-François Lisée was elected as leader in 2016. The current leader is Paul St-Pierre Plamondon, elected in 2020. ==Relationship with the Bloc Québécois== The Bloc Québécois is a federal political party in Canada that was founded in 1991 by future PQ leader Lucien Bouchard. The Bloc also wants sovereignty for Quebec. Although the two political parties are separate organizations, they help each other during elections. ==References== ==Other websites== * Parti québécois website * Parti québécois' parliamentary group website Category:1968 establishments in Canada Category:Nationalist organizations in North America Category:Social democratic parties Category:Political parties of Quebec",
 "title": "Parti Québécois"
}