{
 "id": "253178",
 "text": "Tactical voting happens when a person votes for someone other than their favorite candidate in a way to either help their favorite or achieve some other goal. This may happen in national or local elections, or even in elections for clubs and homeowner associations. == Examples == Say 5 people are running as candidates for board members, but only 3 will be elected. For the following situations except the last, let's say you get 1 vote. * Your favorite is almost guaranteed to win a seat on the board, so you may choose to vote for your second favorite candidate to help him out. That gives your two favorites a better chance of winning. * Your favorite is almost guaranteed to lose, so you may choose to vote for your second favorite candidate to help him out. That gives your second choice a chance of winning even though your favorite may lose. * Your favorite is uncertain to win, so you may choose to vote for a stronger candidate, rather than see someone else win. *You don't have a favorite, but hate the current leading candidate, but you may choose to vote for somebody with less votes to even out the results between them. * Say you get to vote for 3 candidates and your favorite is in the middle of the pack. You may choose to vote only for your favorite and not use your other 2 votes so that your favorite faces less competition. Another common situation happens in primary elections, where members of one party may temporarily 'cross over' to the other party to support a candidate who is getting fewer votes, hoping their favorite will face weak competition in the main election. This type of negative voting is popular but often considered unethical. == Ethics == Many experts question tactical voting in that it can undermine a democratic outcome. That is, ethical voters may believe it more important how a candidate wins than who wins. Others feel the end justifies the means. Most researchers tend to frown on tactical voting. ==Resources== * * Svensson, Lars-Gunnar (1999). The Proof of the Gibbard-Satterthwaite Theorem Revisited * The Science of Elections, Brams, Herschbach Science Online (2001). Abstract ==Other websites== * Tactical Voting Can Be a Weak Strategy -- Article on tactical voting within larger strategic considerations [archived] * VotePair.org VotePair is a banding together of the people who started tactical voting online in the 2000 US elections * Voting methods page Includes extensive discussion of strategic voting in a wide range of real and theoretical voting systems Category:Voting",
 "title": "Tactical voting"
}