{
 "id": "253560",
 "text": "\"God Defend New Zealand\" (), called \"Aotearoa\" (; simply \"New Zealand\") in Māori, is the title of the most popular national anthem of New Zealand. It was originally a poem written by Thomas Brackenhttp://dnzb.govt.nz/DNZB/alt_essayBody.asp?essayID=2B35 Broughton, W.S (22 June 2007). Bracken, Thomas 1843 – 1898. Dictionary of New Zealand Biography. Ministry for Culture and Heritage. Retrieved 9 November 2010. in the 1870s until it was set to music by John Joseph Woods as part a competition for ten guineas in 1876. Two years later, Thomas Henry Smith wrote the lyrics in Māori—one of the country's official languages. The anthem was adopted in 1977.https://www.mch.govt.nz/nz-identity-heritage/national-anthems/history- god-defend-new-zealand National anthems: History of God Defend New Zealand. Ministry for Culture and Heritage (23 March 2015). Retrieved 15 August 2015. \"God Save the Queen\", the national anthem used for the United Kingdom and used as a royal anthem for a number of countries and territories, is also a national anthem of New Zealand. ==Lyrics== According to copyright law of New Zealand, the English lyrics are no longer copyrighted since the beginning of 1949 or the end of the 50-year mark of Bracken's death,http://www.legislation.govt.nz/act/public/1994/0143/latest/DLM345634.html Copyright Act 1994 No 143 (as of 1 March 2017). Public Act Contents. Legislation.govt.nz. Parliamentary Counsel Office. Retrieved 7 September 2017. and since the 1980s, the rights to the musical score are in the public domain.https://teara.govt.nz/en/national-anthems/print Swarbrick, Nancy (June 2012). National anthems – New Zealand's anthems. Te Ara: The Encyclopedia of New Zealand. Retrieved 18 October 2017. The meaning of the Māori lyrics are slightly different from the English lyrics. English version Māori version God of Nations at Thy feet, In the bonds of love we meet, Hear our voices, we entreat, God defend our free land. Guard Pacific's triple star From the shafts of strife and war, Make her praises heard afar, God defend New Zealand. Men of every creed and race, Gather here before Thy face, Asking Thee to bless this place, God defend our free land. From dissension, envy, hate, And corruption guard our state, Make our country good and great, God defend New Zealand. Peace, not war, shall be our boast, But, should foes assail our coast, Make us then a mighty host, God defend our free land. Lord of battles in Thy might, Put our enemies to flight, Let our cause be just and right, God defend New Zealand. Let our love for Thee increase, May Thy blessings never cease, Give us plenty, give us peace, God defend our free land. From dishonour and from shame, Guard our country's spotless name, Crown her with immortal fame, God defend New Zealand. May our mountains ever be Freedom's ramparts on the sea, Make us faithful unto Thee, God defend our free land. Guide her in the nations' van, Preaching love and truth to man, Working out Thy glorious plan, God defend New Zealand.https://mch.govt.nz/nz-identity-heritage/national- anthems/god-defend-new-zealandaotearoa National anthems: God Defend New Zealand/Aotearoa. Ministry for Culture and Heritage. 25 March 2015. Retrieved 15 August 2015. E Ihowā Atua, O ngā iwi mātou rā Āta whakarangona; Me aroha noa Kia hua ko te pai; Kia tau tō atawhai; Manaakitia mai Aotearoa Ōna mano tāngata Kiri whero, kiri mā, Iwi Māori, Pākehā, Rūpeke katoa, Nei ka tono ko ngā hē Māu e whakaahu kē, Kia ora mārire Aotearoa Tōna mana kia tū! Tōna kaha kia ū; Tōna rongo hei pakū Ki te ao katoa Aua rawa ngā whawhai Ngā tutū e tata mai; Kia tupu nui ai Aotearoa Waiho tona takiwā Ko te ao mārama; Kia whiti tōna rā Taiāwhio noa. Ko te hae me te ngangau Meinga kia kore kau; Waiho i te rongo mau Aotearoa Tōna pai me toitū Tika rawa, pono pū; Tōna noho, tāna tū; Iwi nō Ihowā. Kaua mōna whakamā; Kia hau te ingoa; Kia tū hei tauira; Aotearoahttp://folksong.org.nz/e_ihowa_atua/index.html#500 Folksong.org.nz. E Ihowa atua: \"Triple Star\" Contains the English translation of the Māori lyrics. ===IPA transcription=== Māori version English version [ˈe ihowaː aˈtu.a] [ˈo ŋaː ˈiwi ˈmaːto.u ɾaː] [aːta ɸakaˈraŋona] [ˈme ˈa.roː.ha ˈno.a] [ˈki.a ˈhu.a ˈko ˈte pai] [ˈki.a ˈta.u ˈtoː a.taˈɸai] [maˈnaːki.titia ˈma.i] [aɔˈtearɔa] [gɒd əv ˈneɪʃənz ət ðaɪ fi:t] [ɪn ðə bɒndz əv lʌv wi: mi:t] [hɪ aʊ vɔɪsəz wi: ənˈtri:t] [gɒd dəˈfend aʊ fri: land] [ga:d pəˈsɪfɪks ˈtrɪpəl sta:] [frəm ðə ʃa:ftz əv straɪf ənd wɔ:] [meɪk hə: preɪzəz hə:d əˈfa:] [gɒd dəˈfend nju: ˈzi:lənd] ==References== Category:National symbols of New Zealand",
 "title": "God Defend New Zealand"
}