{
 "id": "254605",
 "text": "Housecleaning is what people do to remove mess, trash, and dirt from where they live and put things where they belong so the house looks neat.Gove P.B. and others. 1961. Housecleaning makes it easier to see the floor and furniture without clutter in the way. It also leaves fewer places for spiders and insects to live and removes dust so that people in the house can breathe more easily. Housecleaning may be sweeping the floor with a broom, cleaning rugs with a vacuum cleaner, cleaning clothes and putting them away, and washing windows. Washing a sponge, squeezing out the water, and placing it on a dish rack to dry is also part of housecleaning.Bredenberg, Jeff, cover & pp. xv – xvi. == Clutter == Clutter is things that either should not be in the house at all or have been put in the wrong place. A teacup in the middle of the floor is clutter. A teacup on its shelf is not clutter. Places people put things away on shelves, in drawers, and on hangers.Bredenberg, Jeff, pp. 21 – 27 == Health == Cleaning the house removes germs, dust and other things that can harm health.Bredenberg, Jeff, pp. 28 – 33 Dust can make people sneeze, cough, and get watery eyes. Dust can give people rashes and trouble breathing. Dust can come from smoke, cotton, small bits of soap, pollen, mold spores, dried cat saliva, pieces of spider web, skin flakes, cloth fibers, insect fibers, or tiny bits of food.Bredenberg, Jeff, pp. 36 – 39 == Cleaning chemicals == There are five main kinds of chemicals that people use for housecleaning:Bredenberg, Jeff, pp. 443 – 450 # Surfactants help water get things wet faster. # Alkaline chemicals like dish soap and baking soda can effectively cut through mud and grease making it easier to wash them away. Examples of alkaline products include All-purpose cleaners, and laundry detergents. # Acidic chemicals like vinegar, lemon juice and orange juice can make mustard, wine, tea, coffee, rust, dry soap suds, and limescale easier to wash away. # Flammable solvents like turpentine can make paint easier to wash away. # Disinfectants kill germs, fungus, and mold. == References == * Bredenberg, Jeff, Managing Editor; Researchers, writers and others. 1998. Clean It Fast, Clean It Right: THE ULTIMATE GUIDE to Making Absolutely Everything You Own Sparkle & Shine. Emmaus, PA: Rodale, Inc paperback www.rodalestore.com *Gove, P. B. and others. 1961. Housecleaning. Webster’s Third New International Dictionary of the English Language, Unabridged. Springfield, MA: G. & C. Merriam Company. == Other websites == *Bredenberg, Jeff. 1998. Clean It Fast, Clean It Right . . . Emmaus, PA: Rodale, Inc hardcover. Category:Home",
 "title": "Housecleaning"
}