{
 "id": "254797",
 "text": "Andrew William Hankinson (born December 22, 1983) is an American professional wrestler. He is best known for his time in WWE, Total Nonstop Action Wrestling (TNA) and New Japan Pro-Wrestling (NJPW). He was a member of the stables Bullet Club in NJPW, the Straight Edge Society, and The O.C. (The Original Club) in WWE. In his first run for WWE from 2005 to 2010, Hankinson was known for various gimmicks: He played an imposter version of Kane in 2006. From 2007 to 2009 he teamed with Jesse as Festus, a quiet man who turned insane when the bell rang. In November 2009, he became Luke Gallows, the enforcer and \"disciple\" of CM Punk in the Straight Edge Society, until his release. After his time in TNA and NJPW, he returned to WWE along with former Bullet Club member Karl Anderson. They joined AJ Styles, who previously was their leader in the Bullet Club. Gallows and Anderson won the Raw Tag Team Championship twice. They were released in 2020, signed a contract with TNA, now called Impact Wrestling, and won the Impact World Tag Team Championship three times. In October 2022, they returned to WWE and reunited with Styles, but were released again in February 2025. ==Championships and accomplishments== *American Pro Wrestling Alliance **APWA World Tag Team Championship (1 time) – with Knux *Impact Wrestling ** Impact World Tag Team Championship (3 times) – with Karl Anderson ** Impact Year End Awards (3 times) *** Finishing Move of the Year (2020) – Magic Killer *** Moment of the Year (2020) – *** Tag Team of the Year (2021) – with Karl Anderson * Lariato Pro Wrestling ** Lariato Pro Tag Team Championship (1 time) – with Karl Anderson *National Wrestling Alliance **NWA Southern Tag Team Championship (1 time) – with Iceberg *National Wrestling League **NWL Heavyweight Championship (1 time) *New Japan Pro-Wrestling **IWGP Tag Team Championship (3 times) – with Karl Anderson **World Tag League (2013) – with Karl Anderson **NJPW Strong Tag Team Turbulence Tournament (2021) – with Karl Anderson * Rampage Pro Wrestling **RPW Heavyweight Championship (1 time) *Pro Wrestling Illustrated **Ranked No. 65 of the top 500 wrestlers in the PWI 500 in 2016 *River City Wrestling **RCW Tag Team Championship (1 time) – with Knux *Southern Fried Championship Wrestling **SFCW Heavyweight Championship (1 time) *Vanguard Championship Wrestling **VCW Heavyweight Championship (1 time) *Wrestling Observer Newsletter **Worst Gimmick (2012, 2013) *WWE **WWE Raw Tag Team Championship (2 times) – with Karl Anderson **WWE Tag Team World Cup (2019) – with Karl Anderson * Other titles ** Talk 'N Shop A Mania 24/7 Championship (1 time) ==References== ==Other websites== * *New Japan Pro Wrestling profile Category:1983 births Category:Living people Category:Former WWE wrestlers Category:Sportspeople from Maryland Category:Total Nonstop Action Wrestling alumni",
 "title": "Doc Gallows"
}