{
 "id": "254967",
 "text": "Woodrow Tracy \"Woody\" Harrelson (born July 23, 1961 in Midland, Texas) is an American actor. He made his movie debut in the 1986 movie Wildcats. ==Personal life== Harrelson's father was Charles Voyde Harrelson. He was a contract killer. He was arrested for the killing of Federal Judge John H. Wood, Jr. by rifle fire in 1979 in San Antonio. Harrelson is a vegan. He was on postage stamps issued in 2011 as one of PETA's 20 famous vegetarians.Bill Hutchinson,\"First-Class Stars' Meat-Free Pitch ,\" NYDailyNews.com November 28, 2011. He was named PETA's Sexiest Vegetarian in 2012 (along with Jessica Chastain).Jessica Chastain and Woody Harrelson Named PETA's 2012 Sexiest Vegetarians - E! Online. Retrieved July 1, 2012. He would like the legalization of marijuana and hemp. He is also an environmental activist. Harrelson is a supporter of the 9/11 truth movement. He has supported reopening an investigation into the September 11 terrorist attacks. In 1985, Harrelson married Nancy Simon, daughter of playwright Neil Simon, in Tijuana. The two meant to divorce the following day, but the storefront marriage/divorce parlor was closed when they had returned to it. The two remained married for ten months. On December 28, 2008, Harrelson married Laura Louie, his girlfriend since 1987. The couple have three daughters, Deni Montana (born February 28, 1993), Zoe Giordano (born September 22, 1996), and Makani Ravello (born June 3, 2006). Laura is his former assistant. She is a co-founder of Yoganics, an organic food delivery service. ===Legal issues=== Harrelson was arrested in Columbus, Ohio in 1982 for disorderly conduct. He was found dancing in the middle of the street. He was also charged with resisting arrest after he ran from the police and assault after he hit one of the officers. Harrelson avoided jail time by paying a $390 fine. On June 1, 1996, Harrelson was arrested in Lee County, Kentucky. He symbolically planted four hemp seeds. This was to challenge the state law which did not distinguish between industrial hemp and marijuana. Harrelson was acquitted of these charges in 2000. In 2002, Harrelson was arrested in London after an incident in a taxi that ended in a police chase. Harrelson was taken to a London police station and later released on bail. The case was later dismissed after Harrelson paid the taxi driver involved in the incident £550 ($844). In 2008, TMZ photographer Josh Levine filed a lawsuit against Harrelson. It was for an alleged attack outside a Hollywood nightclub in 2006. A video of the incident appeared to show Harrelson grabbing a camera and clashing with the photographer. Los Angeles prosecutors would not press charges against the actor. Levine filed a lawsuit asking for $2.5 million in damages. The case was dismissed in April 2010. ==Awards== He has won multiple awards including: *Primetime Emmy Award for Outstanding Supporting Actor - Comedy Series in Cheers *MTV Movie Award for Best Kiss (shared with Demi Moore) in Indecent Proposal (1993) *Independent Spirit Award for Best Supporting Male, National Board of Review Award for Best Supporting Actor and the San Diego Film Critics Society Award for Body of Work in The Messenger (2009) *San Diego Film Critics Society Award for Body of Work in Zombieland (2009) *San Diego Film Critics Society Award for Body of Work in 2012 (2009) ==Filmography== Year Title Role Notes 1985–93 Cheers Woody Boyd Television series 1986 Wildcats Krushinski film debut 1987 Bay Coven Slater 1988 Cool Blue Dustin Direct-to-video 1988 Mickey's 60th Birthday Woody Boyd Television film 1988 Killer Instinct Charlie Long Television film 1990 L.A. Story Harris' Boss Cameo 1990 Mother Goose Rock 'n' Rhyme Lou the Lamb Cameo 1991 Doc Hollywood Hank Gordon 1991 Ted & Venus Homeless Vietnam Veteran Cameo 1992 White Men Can't Jump Billy Hoyle Nominated – MTV Movie Award for Best Kiss Nominated – MTV Movie Award for Best On-Screen Duo 1992 Cheers: Last Call! Woody Boyd NBC retrospective special 1993 Indecent Proposal David Murphy MTV Movie Award for Best Kiss Golden Raspberry Award for Worst Supporting Actor 1994 Natural Born Killers Mickey Knox Nominated – MTV Movie Award for Best Kiss Nominated – MTV Movie Award for Best On-Screen Duo 1994 Pepper Lewis 1994 I'll Do Anything Ground Zero Hero 1995 Money Train Charlie 1996 Larry Flynt Nominated – Academy Award for Best Actor Nominated – Golden Globe Award for Best Actor – Motion Picture Drama Nominated – Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role 1996 Kingpin Roy Munson 1996 Dr. Michael Reynolds 1997 Wag the Dog Sgt. William Schumann 1997 Welcome to Sarajevo Jordan Flynn 1998 Sgt. Keck 1998 Palmetto Harry Barber 1998 Big Boy Matson 1999 Play It to the Bone Vince Boudreau 1999 EDtv Ray Pekurny 1999 Austin Powers: The Spy Who Shagged Me Himself Cameo 1999 Grass Himself Narrator 2003 Anger Management Galaxia/Security Gary 2003 Go Further Himself Documentary film 2003 Scorched Jason 'Woods' Valley 2004 After the Sunset Stanley \"Stan\" P. Lloyd 2004 She Hate Me Lenald Power 2005 North Country Bill White 2005 Leo \"Kelly\" Ryan 2005 Raymond \"Ray\" Barnell 2006 Free Jimmy Roy Arnie Voice role, English-language version released in 2008 2006 Ernie Luckman 2006 Dusty Nominated – Gotham Award for Best Ensemble Cast 2007 Carter Page III 2007 No Country for Old Men Carson Wells Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2007 Battle in Seattle Dale 2007 One Eyed Jack Faro 2007 Nanking Bob Wilson 2008 Semi-Pro Ed Monix 2008 Sleepwalking Randall 2008 Transsiberian Roy Nominated – Saturn Award for Best Supporting Actor 2008 Surfer, Dude Jack 2008 Management Jango 2008 Seven Pounds Ezra Turner 2009 Captain Anthony 'Tony' Stone Independent Spirit Award for Best Supporting Male National Board of Review Award for Best Supporting Actor San Diego Film Critics Society Award for Body of Work Nominated – Academy Award for Best Supporting Actor Nominated – Broadcast Film Critics Association Award for Best Supporting Actor Nominated – Chicago Film Critics Association Award for Best Supporting Actor Nominated – Detroit Film Critics Society Award for Best Supporting Actor Nominated – Golden Globe Award for Best Supporting Actor – Motion Picture Nominated – Houston Film Critics Society Award for Best Supporting Actor Nominated – Satellite Award for Best Supporting Actor - Motion Picture Nominated – San Diego Film Critics Society Award for Best Supporting Actor Nominated – Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role Nominated – Washington D.C. Area Film Critics Association for Best Supporting Actor 2009 Defendor Arthur Poppington/Defendor 2009 Zombieland Tallahassee San Diego Film Critics Society Award for Body of Work Scream Award for Best Ensemble Nominated – Detroit Film Critics Society Award for Best Supporting Actor Nominated – Detroit Film Critics Society Award for Best Cast Nominated – Saturn Award for Best Supporting Actor Nominated – Scream Award for Best Horror Actor 2009 2012 Charlie Frost San Diego Film Critics Society Award for Body of Work 2011 Friends with Benefits Tommy 2011 Bunraku The Bartender 2011 Ethos Narrator Documentary filmhttp://www.ethosthemovie.com/ 2011 Rampart Dave Brown African American Film Critics Association Award for Best Actor Nominated – Independent Spirit Award for Best Male Lead Nominated – Satellite Award for Best Actor in a Motion Picture 2012 Game Change Steve Schmidt Television film Nominated - Critics' Choice Television Award for Best Actor in a Movie/Miniseries Pending - Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie 2012 Haymitch Abernathy 2012 Seven Psychopaths Charlie 2013 Now You See Me Merritt Osbourne 2013 Haymitch Abernathy 2018 Venom Cletus Kassady ==References== Category:1961 births Category:Living people Category:Actors from Texas Category:American movie actors Category:American television actors Category:People acquitted of crimes Category:American vegetarians Category:People from Midland, Texas",
 "title": "Woody Harrelson"
}