{
 "id": "254927",
 "text": "Zombieland is a 2009 American adventure comedy horror movie that was produced by Gavin Polone and was the directorial debut for director Ruben Fleischer. The writers are currently planning a sequel to Zombieland. The sequel will star the original cast and will be shot in 3-D. == Plot == A cowardly shut-in named Columbus (Jesse Eisenberg) is forced to join up with a seasoned zombie slayer named Tallahassee (Woody Harrelson) in order to survive the zombie apocalypse. As Tallahassee sets out on a mission to find the last Twinkie on Earth, the duo meets up with Wichita (Emma Stone) and Little Rock (Abigail Breslin), two young girls who have resorted to some rather unorthodox methods to survive amidst the chaos. Reluctant partners in the battle against the undead, all four soon begin to wonder if it might be better to simply take their chances alone. == Cast == * Woody Harrelson as Tallahassee * Jesse Eisenberg as Columbus * Emma Stone as Wichita * Abigail Breslin as Little Rock * Amber Heard as 406, Columbus's attractive dorm neighbor * Mike White as Gas Station Owner * Bill Murray as Himself (Cameo) ===Character Names=== The character names for Tallahassee, Columbus, Wichita and Little Rock come from the places they are traveling in the movie. ==Ratings== Zombieland received mostly positive reviews of reviewers: *Rotten Tomatoes - 7.3/10 (184 reviews) *Top Critics - 86% approval (29 reviews) *Metacritic - 73% approval *Roger Ebert - 3 out of 4 stars Zombieland debuted at #1 at the box office in North America, with ticket sales of $24,733,155 on the opening weekend and is the top-grossing zombie movie in history. ==Soundtrack== Zombieland Soundtrack Artist Song John Stafford Smith and Francis Scott Key \"The Star-Spangled Banner\" Metallica \"For Whom the Bell Tolls\" Chuck Mangione \"Feels So Good\" Sea Wolf \"You're a Wolf\" Band of Horses \"No One's Gonna Love You\" Arthur Smith \"Duelin' Banjos\" Metric \"Gold Guns Girls\" Van Halen \"Everybody Wants Some\" Paul Anka \"Puppy Love\" The Velvet Underground \"Oh! Sweet Nuthin'\" K.492 \"The Marriage Of Figaro\" Willie Nelson \"Blue Eyes Crying in the Rain\" Crash Kings \"It's Only Wednesday\" Success \"Hard to Come Back\" Howlin Rain \"Death Prayer in Heaven's Orchard\" Raul Malo \"Moonlight Kiss\" Kristin Chenoweth \"Popular\" Doves \"Kingdom of Rust\" Ray Parker Jr. \"Ghostbusters\" Blue Öyster Cult \"(Don't Fear) The Reaper\" General Daniel Butterfield \"Taps\" Hank Williams \"I'm So Lonesome I Could Cry\" The Droge and Summers Blend \"Two of the Lucky Ones\" Marching Band \"Feel Good About It\" Johann Strauß (as Johann Strauss, Jr.) \"Vienna Blood Waltz, Op. 354\" The Black Keys \"Your Touch\" The Raconteurs \"Salute Your Solution\" David Sardy \"Estasi Dell Anima\" ==References== ==Other websites== *Zombieland's official website * * Category:2009 comedy movies Category:2009 horror movies Category:2009 adventure movies Category:2000s road movies Category:American adventure movies Category:American comedy movies Category:American horror movies Category:American road movies Category:Comedy horror movies Category:English-language movies Category:Movies directed by Ruben Fleischer Category:Screenplays by Paul Wernick Category:Screenplays by Rhett Reese Category:Zombie movies Category:Post-apocalyptic movies",
 "title": "Zombieland"
}