{
 "id": "255033",
 "text": "This is a list of governors of the US state of California. == List == Governors of the State of California Governor Term in office Party Election Lt. Governor 1 Peter Hardeman Burnett – January 9, 1851 (resigned) Democratic 1849 John McDougal 2 John McDougal – January 8, 1852 (not candidate for election) Succeeded from Lieutenant Governor David C. Broderick (acting) 3 John Bigler – January 9, 1856 (lost election) 1851 Samuel Purdy 1853 4 J. Neely Johnson – January 8, 1858 (not candidate for election) American 1855 Robert M. Anderson 5 John B. Weller – January 9, 1860 (not candidate for election) Democratic 1857 Joseph Walkup 6 Milton Latham – January 14, 1860 (resigned) 1859 John G. Downey 7 John G. Downey – January 10, 1862 (not candidate for election) Succeeded from Lieutenant Governor Isaac N. Quinn (acting) (term ended January 7, 1861) Pablo de la Guerra (acting) 8 Leland Stanford – December 10, 1863 (not candidate for election) Republican 1861 John F. Chellis 9 Frederick Low – December 5, 1867 (not candidate for election) Union 1863 Tim N. Machin 10 Henry Huntly Haight – December 8, 1871 (lost election) Democratic 1867 William Holden 11 Newton Booth – February 27, 1875 (resigned) Republican 1871 Romualdo Pacheco 12 Romualdo Pacheco – December 9, 1875 (not candidate for election) Succeeded from Lieutenant Governor William Irwin (acting) 13 William Irwin – January 8, 1880 (not candidate for election) Democratic 1875 James A. Johnson 14 George Clement Perkins – January 10, 1883 (not candidate for election) Republican 1879 John Mansfield 15 George Stoneman – January 8, 1887 (not candidate for election) Democratic 1882 John Daggett 16 Washington Bartlett – September 12, 1887 (died in office) 1886 Robert Waterman 17 Robert Waterman – January 8, 1891 (not candidate for election) Republican Succeeded from Lieutenant Governor Stephen M. White (acting) 18 Henry Markham – January 11, 1895 (not candidate for election) 1890 John B. Reddick 19 James Budd – January 4, 1899 (not candidate for election) Democratic 1894 Spencer G. Millard (died October 24, 1895) William T. Jeter 20 Henry Gage – January 7, 1903 (not candidate for election) Republican 1898 Jacob H. Neff 21 George Pardee – January 9, 1907 (not candidate for election) 1902 Alden Anderson 22 James Gillett – January 3, 1911 (not candidate for election) 1906 Warren R. Porter 23 Hiram Johnson – March 15, 1917 (resigned) Republican 1910 Albert Joseph Wallace Progressive 1914 John M. Eshleman (died February 28, 1916) Vacant William Stephens (took office July 22, 1916) 24 William Stephens – January 8, 1923 (not candidate for election) Republican Succeeded from Lieutenant Governor Vacant 1918 C. C. Young 25 Friend Richardson – January 4, 1927 (not candidate for election) 1922 26 C. C. Young – January 6, 1931 (lost renomination) 1926 Buron Fitts (resigned November 30, 1928) Vacant Herschel L. Carnahan (appointed December 4, 1928) 27 James Rolph – June 2, 1934 (died in office) 1930 Frank Merriam 28 Frank Merriam – January 2, 1939 (lost election) Succeeded from Lieutenant Governor Vacant 1934 George J. Hatfield 29 Culbert Olson – January 4, 1943 (lost election) Democratic 1938 Ellis E. Patterson 30 Earl Warren – October 5, 1953 (resigned) Republican 1942 Frederick F. Houser 1946 Goodwin Knight 1950 31 Goodwin Knight – January 5, 1959 (not candidate for election) Republican Succeeded from Lieutenant Governor Harold J. Powers 1954 32 Pat Brown – January 2, 1967 (lost election) Democratic 1958 Glenn M. Anderson 1962 33 Ronald Reagan – January 6, 1975 (not candidate for election) Republican 1966 Robert Finch (resigned January 8, 1969) Edwin Reinecke (resigned October 2, 1974) 1970 John L. Harmer 34 Jerry Brown – January 3, 1983 (not candidate for election) Democratic 1974 Mervyn M. Dymally 1978 Michael Curb 35 George Deukmejian – January 7, 1991 (not candidate for election) Republican 1982 Leo T. McCarthy 1986 36 Pete Wilson – January 4, 1999 (term limited) 1990 1994 Gray Davis 37 Gray Davis – November 17, 2003 (recalled) Democratic 1998 Cruz Bustamante 2002 38 Arnold Schwarzenegger – January 3, 2011 (term limited) Republican 2003 (special) 2006 John Garamendi (resigned November 3, 2009) Mona Pasquil (acting) Abel Maldonado (appointed April 27, 2010) 39 Jerry Brown – January 7, 2019 (term limited) Democratic 2010 Gavin Newsom (took office January 10, 2011) 2014 40 Gavin Newsom – present 2018 Eleni Kounalakis ==References== Notes California * governors",
 "title": "List of governors of California"
}