{
 "id": "255016",
 "text": "The Australian Grand Prix is a motorsport race contested by cars in the Formula One section. The race was first held in Adelaide before moving to Melbourne in 1996. ==Winners== ===Repeat winners (drivers)=== Drivers in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. As of the 2018 edition, four-time World Drivers' Champion Alain Prost remains the only driver to win the race in both World Championship and domestic formats, winning the Australian Drivers' Championship 1982 race before winning in Adelaide in 1986 and 1988. Wins Driver Years won 4 Lex Davison 1954, 1957, 1958, 1961 4 Michael Schumacher 2000, 2001, 2002, 2004 3 Bill Thompson 1930, 1932, 1933 Doug Whiteford 1950, 1952, 1953 Jack Brabham 1955, 1963, 1964 Graham McRae 1972, 1973, 1978 Roberto Moreno 1981, 1983, 1984 Alain Prost 1982, 1986, 1988 Jenson Button 2009, 2010, 2012 Sebastian Vettel 2011, 2017, 2018 2 Les Murphy 1935, 1937 Bruce McLaren 1962, 1965 Frank Matich 1970, 1971 Max Stewart 1974, 1975 Gerhard Berger 1987, 1992 Ayrton Senna 1991, 1993 Damon Hill 1995, 1996 David Coulthard 1997, 2003 Kimi Räikkönen 2007, 2013 Lewis Hamilton 2008, 2015 Nico Rosberg 2014, 2016 ===Repeat winners (constructors)=== Teams in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. Wins Constructor Years won 12 Ferrari 1957, 1958, 1969, 1987, 1999, 2000, 2001, 2002, 2004, 2007, 2017, 2018 12 McLaren 1970, 1986, 1988, 1991, 1992, 1993, 1997, 1998, 2003, 2008, 2010, 2012 6 Williams 1980, 1985, 1989, 1994, 1995, 1996 5 Cooper 1955, 1960, 1961, 1962, 1965 4 Bugatti 1929, 1930, 1931, 1932 4 MG 1935, 1937, 1939, 1947 4 Lola 1974, 1975, 1977, 1979 4 Ralt 1981, 1982, 1983, 1984 4 Mercedes 2014, 2015, 2016, 2019 2 Talbot- Lago 1952, 1953 2 Maserati 1956, 1959 2 Brabham 1963, 1964 2 BRM 1966, 1967 2 Matich 1971, 1976 2 McRae 1973, 1978 2 Renault 2005, 2006 ===Repeat winners (engine manufacturers)=== Manufacturers in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. Wins Manufacturer Years won 12 Ferrari 1957, 1958, 1969, 1987, 1999, 2000, 2001, 2002, 2004, 2007, 2017, 2018 11 Mercedes * 1997, 1998, 2003, 2008, 2009, 2010, 2012, 2014, 2015, 2016, 2019 10 Ford ** 1950, 1951, 1968, 1980, 1981, 1982, 1983, 1984, 1990, 1993 8 Renault 1989, 1994, 1995, 1996, 2005, 2006, 2011, 2013 7 Chevrolet 1972, 1973, 1974, 1975, 1977, 1978, 1979 5 Climax 1961, 1962, 1963, 1964 1965 4 Bugatti 1929, 1930, 1931, 1932 MG 1935, 1937, 1939, 1947 Honda 1985, 1988, 1991, 1992 3 Maserati 1956, 1959, 1960 Repco/Holden 1970, 1971, 1976 2 Talbot-Lago 1952, 1953 BRM 1966, 1967 * Between 1997-2003 built by Ilmor ** Between 1968-1993 designed and built by Cosworth, funded by Ford ===By year=== A pink background indicates an event which was not part of the Formula One World Championship. * Alain Prost is the only driver, as of the 2019 Australian Grand Prix, to win the race in both Australian domestic (1982) and World Championship (1986 and 1988) formats. * The last Australian driver to win the AGP was World Champion Alan Jones who won 1980's non-championship race. * The last Australian driver to officially finish on the podium was John Smith in 1983. Australia's only current () Grand Prix driver Daniel Ricciardo had finished 2nd in the 2014 race, but was disqualified post-race. * Since becoming a round of the Formula One World Championship in , Jones (1985 and 1986), David Brabham (1990 and 1994), Mark Webber (2002–2013) and Ricciardo (2012–present) are the only Australian drivers to race in the Australian Grand Prix. Year Driver Constructor Location Report 1928 # Arthur Waite Austin Phillip Island Report 1929 Arthur Terdich Bugatti Report 1930 Bill Thompson Bugatti Report 1931 Carl Junker Bugatti Report 1932 Bill Thompson * Bugatti Report 1933 Bill Thompson * Riley Report 1934 Bob Lea-Wright * Singer Report 1935 Les Murphy * MG Report 1936 Not held 1937 + Les Murphy * MG Victor Harbor Report 1938 Peter Whitehead * ERA Bathurst Report 1939 Alan Tomlinson * MG Lobethal Report 1940 – 1946 Not held 1947 Bill Murray * MG Bathurst Report 1948 Frank Pratt * BMW Point Cook Report 1949 John Crouch Delahaye Leyburn Report 1950 Doug Whiteford Ford Nuriootpa Report 1951 Warwick Pratley GRS-Ford Narrogin Report 1952 Doug Whiteford Talbot-Lago Bathurst Report 1953 Doug Whiteford Talbot-Lago Albert Park Report 1954 Lex Davison HWM-Jaguar Southport Report 1955 Jack Brabham Cooper-Bristol Port Wakefield Report 1956 Stirling Moss Maserati Albert Park Report 1957 Lex Davison Bill Patterson Ferrari Caversham Report 1958 Lex Davison Ferrari Bathurst Report 1959 Stan Jones Maserati Longford Report 1960 Alec Mildren Cooper- Maserati Lowood Report 1961 Lex Davison Cooper-Climax Mallala Report 1962 Bruce McLaren Cooper-Climax Caversham Report 1963 Jack Brabham Brabham-Climax Warwick Farm Report 1964 Jack Brabham Brabham-Climax Sandown Report 1965 Bruce McLaren Cooper-Climax Longford Report 1966 Graham Hill BRM Lakeside Report 1967 Jackie Stewart BRM Warwick Farm Report 1968 Jim Clark Lotus-Cosworth Sandown Report 1969 Chris Amon Ferrari Lakeside Report 1970 Frank Matich McLaren-Repco/Holden Warwick Farm Report 1971 Frank Matich Matich-Repco/Holden Report 1972 Graham McRae Leda-Chevrolet Sandown Report 1973 Graham McRae McRae-Chevrolet Report 1974 Max Stewart Lola-Chevrolet Oran Park Report 1975 Max Stewart Lola-Chevrolet Surfers Paradise Report 1976 John Goss Matich- Repco/Holden Sandown Report 1977 Warwick Brown Lola-Chevrolet Oran Park Report 1978 Graham McRae McRae-Chevrolet Sandown Report 1979 Johnnie Walker Lola- Chevrolet Wanneroo Report 1980 Alan Jones Williams-Cosworth Calder Report 1981 Roberto Moreno Ralt-Ford Report 1982 Alain Prost Ralt-Ford Report 1983 Roberto Moreno Ralt-Ford Report 1984 Roberto Moreno Ralt-Ford Report Keke Rosberg Williams-Honda Adelaide Report Alain Prost McLaren-TAG Adelaide Report Gerhard Berger Ferrari Adelaide Report Alain Prost McLaren-Honda Adelaide Report Thierry Boutsen Williams-Renault Adelaide Report Nelson Piquet Benetton-Ford Adelaide Report Ayrton Senna McLaren-Honda Adelaide Report Gerhard Berger McLaren-Honda Adelaide Report Ayrton Senna McLaren-Ford Adelaide Report Nigel Mansell Williams-Renault Adelaide Report Damon Hill Williams-Renault Adelaide Report Damon Hill Williams-Renault Albert Park Report David Coulthard McLaren- Mercedes Report Mika Häkkinen McLaren-Mercedes Report Eddie Irvine Ferrari Report Michael Schumacher Ferrari Report Michael Schumacher Ferrari Report Michael Schumacher Ferrari Report David Coulthard McLaren-Mercedes Report Michael Schumacher Ferrari Report Giancarlo Fisichella Renault Report Fernando Alonso Renault Report Kimi Räikkönen Ferrari Report Lewis Hamilton McLaren- Mercedes Report Jenson Button Brawn-Mercedes Report Jenson Button McLaren- Mercedes Report Sebastian Vettel Red Bull-Renault Report Jenson Button McLaren-Mercedes Report Kimi Räikkönen Lotus-Renault Report Nico Rosberg Mercedes Report Lewis Hamilton Mercedes Report Nico Rosberg Mercedes Report Sebastian Vettel Ferrari Report Sebastian Vettel Ferrari Report Valtteri Bottas Mercedes Report Cancelled due to the COVID-19 pandemic 2021 Cancelled due to the COVID-19 pandemic and was replaced by the Qatar Grand Prix 2022 Charles Leclerc Ferrari 2023 Max Verstappen Red Bull-Honda RBPT * * From 1932 to 1948, the winner was determined on a handicap basis.Graham Howard, After 6,201 miles and 49 races, the 50th AGP marked the end of an era, Australian Motor Racing Year, 1985/86, page 33 * + The 1937 event was staged as the \"South Australian Centenary Grand Prix\" on 26 December 1936.The Official 50-race history of the Australian Grand Prix, 1986, page 82 * # The 1928 event was officially known as the \"100 Miles Road Race\".John B. Blanden, A History of Australian Grand Prix 1928–1939 (1981), page 1 * ** The 2020 Grand Prix was cancelled on 13 March 2020 which was the same day that it was due to start running due to the COVID-19 pandemic. The event's cancellation by the the event's promoter the Australian Grand Prix Corporation (AGPC) was announced just 90 minutes before Free Practice 1 was due to begin running but the event's official cancellation by the FIA was not confirmed until 8 hours later on that same day when the FIA released a statement which officially confirmed the event's cancellation. * The 2021 Grand Prix was originally scheduled to be run on 21 March 2021 but it was initially postponed and moved back to be run later on in the year on 6 January 2021 by the FIA because of the severity of the COVID-19 pandemic in Australia and it was originally rescheduled to be run on 21 November 2021. It was later cancelled on 6 July 2021 by the FIA because of COVID-19 concerns as new COVID-19 restrictions were implemented by the government of Victoria (State) which significantly restricted the admittance of international citizens to the state in order to combat the spread of the virus. The main reason for the event's cancellation by the FIA was because of low COVID-19 vaccination rates in Australia as COVID-19 vaccines were not readily available at the time in the country. This marked the event's cancellation for a second consecutive year because the 2020 event was cancelled by the FIA on the same day that it was due to begin running on 13 March 2020 just 90 minutes before Free Practice 1 was due to begin because of the beginnings of the COVID-19 pandemic in Australia. Following it's cancellation by the FIA the event was replaced by the Qatar Grand Prix which was run on the event's originally rescheduled date of 21 November 2021 as a substitute event. ==References== Category:Formula One Grands Prix Category:1985 establishments in Australia",
 "title": "Australian Grand Prix"
}