{
 "id": "255592",
 "text": "Stuart Alexander \"Stu\" Bennett (born 10 August 1980), better known by his ring name Wade Barrett, is an English professional wrestling commentator, actor, former professional wrestler and former bare-knuckle boxer. He is signed to WWE, where is a colour commentator on the SmackDown brand. As an active wrestler he was also known under the ring names Bad News Barrett and King Barrett. He is a five-time Intercontinental Champion, the winner of the first season of NXT, and the 2015 King of the Ring. Barrett was born in Penwortham. He lived in Preston until he was six. He then moved to Wales. After winning NXT in 2010, he made his debut on the main roster on the June 7 episode of Raw as the leader of The Nexus. He was later removed from being the leader of Nexus after CM Punk gave him the opportunity to regain the leadership saying that if he won a three-way steel cage match to determine the number one contender for the WWE Championship, but during the match Punk came down to ringside and took off Barrett's Nexus armband, which symbolically removed him from the Nexus, and he went on to lose the match. He then joined a new group, The Corre. On 28 April 2016 episode of Raw, Barrett competed in the 2015 King of the Ring tournament. In the tournament, he defeated Dolph Ziggler in the first round after Sheamus distracted Ziggler. The next night on the WWE Network, Barrett defeated R-Truth in the semi-finals and defeated Neville in the finals win the tournament and become King of the Ring. On 6 May 2016, Barrett was released from WWE and retired from wrestling. He returned to WWE as a commentator for NXT in September 2020, and was called up to the main roster again two years later. == Acting career == === Film === Year Title Role 2013 Dead Man Down Kilroy 2016 Eliminators George \"Bishop\" Edwards 2018 I Am Vengeance John Gold 2020 I Am Vengeance: Retaliation John Gold === Television === Year Title Role Notes 2015 Total Divas Himself Guest star === Web === Year Title Role Notes 2013–2015 The JBL and Cole Show Himself 2015 Swerved Himself 1 episode 2018 Ultimate Beastmaster Himself == Championships and accomplishments == * The Baltimore Sun ** Feud of the Year (2010) ** Newcomer of the Year (2010) * Dropkixx ** Dropkixx IWC European Heavyweight Championship (1 time) ** Dropkixx IWC European Heavyweight Title Tournament (2005) ** Best Physical Appearance Award (2005) * Florida Championship Wrestling ** FCW Florida Tag Team Championship (2 time) – with Drew McIntyre * Ohio Valley Wrestling ** OVW Southern Tag Team Championship (1 time) – with Paul Burchill * Pro Wrestling Illustrated ** Feud of the Year (2010) ** Most Hated Wrestler of the Year (2010) – ** Ranked No. 19 of the top 500 singles wrestlers in the PWI 500 in 2011 * WWE/World Wrestling Entertainment ** WWE Intercontinental Championship (5 times) ** King of the Ring (2015) ** NXT (season one) ** WWE Intercontinental Championship No. 1 Contender's Tournament (2014) ** Slammy Award (1 time) *** Shocker of the Year (2010) – ==References== ==Other websites== * * * Category:1980 births Category:Living people Category:English professional wrestlers Category:Former WWE wrestlers Category:People from Preston, Lancashire Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Sportspeople from Lancashire Category:WWE people",
 "title": "Wade Barrett"
}