{
 "id": "255693",
 "text": "Albert Charles Paul Marie Roussel (5 April 1869 - 23 August 1937) was a French composer. Roussel spent seven years as a midshipman. He only turned to music as an adult. But he then became one of the most important composers of the years between the two world wars. His earlier music came from the impressionism of Debussy and Ravel. He turned more towards neoclassicism with his later music. ==Personal life== Albert Roussel was born in Tourcoing (Nord department of France). HIs earliest interest was not music. It was mathematics. He spent some time in the French Navy. In 1889 and 1890 he served on the crew of the frigate Iphigénie. These travels were significant to his later career as a composer. This is because many of his musical works would reflect his interest in far-off and interesting places. After Roussel left the Navy in 1894, he began to study music with Eugène Gigout. He continued his studies until 1908 at the Schola Cantorum (one of his teachers there was Vincent d'Indy). While he studied, he would also teach at the Schola. His fellow students were Erik Satie and the young Edgard Varèse. During World War I, he served as an ambulance driver on the Western Front. After the war, he bought a summer house in Normandy. This is where he gave most of his time to composing music. Roussel was a classicist. Some of his first works are very much like impressionism. But he soon found a style fit just for him. This style had a strong rhythmic sound. The Schola Cantorum left a mark on Roussel's mature writing. Compared with the style of other French composers like Gabriel Fauré or Claude Debussy, Roussel's orchestration is rather powerful and heavy. Roussel also liked jazz. He wrote a piano-vocal composition called Jazz dans la nuit. This has a lot in common with other jazz-influenced works such as the \"Blues\" second movement of Maurice Ravel's Violin Sonata. Roussel's most important pieces include his ballets. They are Le festin de l'araignée, Bacchus et Ariane, and Aeneas. Among his other works are four symphonies (the Third is the most often played), a piano concerto, a concertino for cello and orchestra, a psalm setting for chorus and orchestra, music for the theater, solo piano music, and songs. He died in the town of Royan in western France in 1937. That is the same year that his countrymen Ravel, Charles-Marie Widor, and Gabriel Pierné died. Arturo Toscanini included the suite from the ballet Le festin de l'araignée in one of his concerts with the NBC Symphony Orchestra. Georges Prêtre recorded this same music with the Orchestre National de France for EMI in 1984. ==Works== ===Stage=== * Le marchand de sable qui passe, incidental music for a play, Le Havre, 16 December 1908, Op. 13 * Le festin de l'araignée, ballet in one act. f.p. 3 April 1913, Op. 17 * Padmâvatî, opera in 2 acts (1913–18, Louis Laloy, after T.-M. Pavie). f.p. Paris Opéra, 1 June 1923, Op. 18 * La naissance de la lyre, opera in 1 act, Paris Opéra, 1 July 1925, Op. 24 * Sarabande (1927; for the children's ballet L'éventail de Jeanne, to which ten French composers each contributed a dance) * Bacchus and Ariadne, ballet in two acts. f.p. Paris Opéra, 22 May 1931, Op. 43 * Le testament de la tante Caroline, opera in 3 acts, 14 November 1936 * Aeneas, ballet, Op. 54 * Prelude to Act 2 of Le quatorze juillet by Romain Rolland, Paris, 14 July 1936 * Elpénor, radio score, 1947, Op. 59 ===Orchestral=== * Evocations pour orchestra Op. 15 * Sinfonietta for String Orchestra, Op. 52 * Suite for Orchestra in F major, Op. 33 * Symphony No. 1 in D minor The Poem of the Forest, Op. 7 * Symphony No. 2 in B-flat major, Op. 23 * Symphony No. 3 in G minor, Op. 42 * Symphony No. 4 in A major, Op. 53 ===Concertante=== * Cello Concertino, Op. 57 * Piano Concerto in G major, Op. 36 ===Vocal/Choral=== * Psalm 80 for tenor, choir, and orchestra, Op. 37 ===Chamber/Instrumental=== * Andante and Scherzo, for flute and piano, Op. 51 * Elpenor for flute and string quartet, Op. 59 * Divertissement for piano and wind quintet, Op. 6 * Joueurs de Flûte, flute and piano, Op. 27 * Piano Trio in E-flat, Op. 2 * Serenade for flute, string trio, and harp, Op. 30 * Sonatine for Piano, Op. 16 * String Quartet, Op. 45 * String Trio, Op. 58 * Suite for Piano in F-sharp minor, Op. 14 * Trio for Flute, Viola, and Cello, Op. 40 * Violin Sonata No. 1 in D minor, Op. 11 * Violin Sonata No. 2 in A major, Op. 28 * Segovia, for guitar, Op. 29 * Impromptu for harp ==Recordings== * Symphony No. 3 and Ariadne et Bacchus - Royal Scottish National Orchestra/Stephane Deneve (Naxos Records) * Symphony No. 3 - New York Philharmonic/Leonard Bernstein (Sony Classical) * Symphony No. 4 - Philharmonia Orchestra/Herbert von Karajan (EMI) * Symphony No. 2/Aeneas/ Bacchus /Spider's Feast - ORTF/Jean Martinon(Erato); * Padmavati (opera) - London Symphony Orchestra/Jean Martinon (BBC) * Padmavati - Marilyn Horne, Nicolai Gedda/ Michel Plasson conducting (EMI) ==References== * * Albert Roussel, un marin musicien, 1st ed. by Damien Top. Séguier, 2000. * \"The Piano Music of Albert Roussel\", by Henry Doskey, D.M. Indiana University, 1981. 109 p., musical examples Category:1869 births Category:1937 deaths Category:20th-century French composers Category:People from Tourcoing",
 "title": "Albert Roussel"
}