{
 "id": "255862",
 "text": "The Aryan race is a hypothesised idea that was formed in the 19th and 20th centuries. It was used to describe the theoretical descendents of group of people in ancient Persia and India who spoke an Indo-European language. However, there is no historical, anthropological, or archaeological evidence that supports its existence. The word \"Aryan\" has been used to describe people of Iranian and Indian descent, but there is no record of Aryans in European history. Later it was used for Germanic peoples because of new ideas about the Aryans.Merriam-Webster Dictonary: Aryan. Retrieved: 25.07.2016. Url: http://www.merriam-webster.com/dictionary/AryanDavid W. Anthony (2010): The Horse, the Wheel, and Language: How Bronze-Age Riders from the Eurasian Steppes Shaped the Modern World. Princeton University Press. P. 7-10. Retrieved 25.07.2016. The term Aryan comes from the ancient Sanskrit word ārya. Sanskrit-speaking people used this word to distinguish themselves from other races. The Iranians also used this word, and the name Iran means \"land of the Aryans\".Trautmann, Thomas R. Aryans and British India Yoda Press New Dehli 1997 page xxxii The idea of an Aryan race was later used by occult movements like Theosophy; and by the Nazis. == In Nazism == The ideology of Nazism was based upon the idea that the Aryan race (Germanic peoples) was a master race.Longerich, Peter 2010. Holocaust: the Nazi persecution and murder of the Jews. Oxford University Press, p30. This view came from earlier racial theorists such as Arthur de Gobineau and Houston Stewart Chamberlain.Yenne, Bill 2010. Hitler's master of the dark arts: Himmler's black knights and the occult origins of the SS. Minneapolis: Zenith, p21/2. As the leader of Nazi Germany, Adolf Hitler decided that people who were not Germanic could also be Aryans. He declared Hungarians to be Aryan in 1934. He did the same for the Japanese in 1936 and the Finns in 1942. The Nazis saw Slavs as inferior non- Aryans. They were usually vague as to whether Italians were \"Aryan\", although Italy under Mussolini had a \"Manifesto of Race\" in 1938 that said they were. Jews, Romani people and Black people were considered “non-Aryans”. == In Theosophy == Theosophy, a mystical occult society founded in 1875 by Helena Blavatsky, teaches that the Arabian people and the Jews are a part of the Aryan race. Theosophists believe that the Arabians used the Semitic languages of the people around them. These people had moved to the area from Atlantis. Theosophists claim that the Jews began as a part of the Arabian sub-race in what is now Yemen around 30,000 BC. They moved first to Somalia and then to Egypt, where they lived until the time of Moses.Powell, A.E. The Solar System: A Complete Outline of the Theosophical Scheme of Evolution London:1930 The Theosophical Publishing House Pages 298-299 == References == ==Other websites == * Who Were the Aryans? The Aryan Invasion Myth Category:Historical races Category:Nazism Category:Indo-European",
 "title": "Aryan race"
}