{
 "id": "255870",
 "text": "The Annual Eurovision Song Contest was held in Düsseldorf (Germany), due to Germany's first place with their singer Lena Meyer-Landrut with her song \"Satellite\" in the Eurovision Song Contest 2010 in Oslo (Norway). Like previous years, a system of two semi-finals was used: the first on 10 May and the second on 13 May 2011. The final was on the evening of 14 May 2011. The winners were Ell & Nikki with their song Running scared, they represented Azerbaijan. == Venue == On 12 October 2010, the German broadcaster, Norddeutscher Rundfunk (NDR) announced that the Esprit Arena of Düsseldorf as the venue of the Eurovision Song Contest 2011. Germany has already held the Eurovision Song Contest. The first in 1957 in Frankfurt am Main and the second in 1983 in Munich. Since 1998 and the victory of the United Kingdom the year before, it is the first time that a country of the \"Big Five\" (Germany, France, Spain, United Kingdom & Italy (since 2011)) will held the Eurovision Song Contest. === Bidding Phase === 23 cities of Germany participated to the bidding phase of the venue for the Annual Eurovision Song Contest. Eight cities showed interest of hosting the Eurovision Song Contest 2011 : Berlin, Hamburg, Hanover, Gelsenkirchen, Düsseldorf, Cologne, Frankfurt, Munich. On 21 August 2010, NDR announced that four of those cities had officially applied to host the 2011 Contest : * Berlin : In a hangar near the former Tempelhof Airport * Düsseldorf: Esprit Arena * Hamburg: Hamburg Exhibition Centre * Hanover: Hanover Exhibition Centre == Format == The five countries that are part of the \"Big Five\", along with the host of the contest, automatically qualify for a place in the final. But Germany is both the host of the 2011 edition and a member from the \"Big Five\". To answer this question of if a country will qualify directly for the final (maybe the second of the 2010 Contest), the EBU held a meeting in Belgrade (Serbia). And it was decided that the existing rules will remain in place, and that the number of participants in the final will simply decreased from twenty-five to twenty-four. On 31 December 2010, the EBU published the official list of the participants for the 2011 Eurovision Song Contest and which stated the return of Italy, Austria, San Marino and Hungary. And thanks to the return of Italy twenty-fiv countries will participate for the final of the 2011 edition of the Eurovision Song Contest. === Hosts === On 16 December 2010, NDR revealed the presenters of the 2011 edition : Anke Engelke, Judith Rakers, and Stefan Raab. It will be the third time that three people have hosted the contest after 1999 and 2010. And the second time in a row. === Pot allocations === To determine the semi-final running orders for the Eurovision Song Contest, participating nations were split into six pots on 17 January 2011. Countries has been drawn from each pot to determine if they will compete in either the first or second semi-final and like in 2010, it will determine in which half of the semi-final they will perform, in order for delegations to know when rehearsals will begin for their respective countries. The draw also determine in which semi-finals the members of the \"Big Five\" (France, Germany, Spain, the United Kingdom and Italy) will be able to vote. Israeli broadcaster IBA requested to take part in the second semi-final due to the Israeli Memorial Day, which will be held during the first semi-final. German broadcaster NDR also requested that they be allowed to vote in the second semi-final for scheduling reasons. Pot 1 Pot 2 Pot 3 Pot 4 Pot 5 Pot 6 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * == Participating Countries == On 31 December 2010, the EBU confirmed the forty-three countries which will be competing fir the 2011 Eurovision Song Contest. The 2011 edition which will mark the returns of Austria, which last participated in 2007, Italy, which last participated in 1997, San Marino, which only took part in 2008, and Hungary, which last participated in 2009. At a meeting in Belgrade, the EBU decided that the countries has to choose their artists and their songs before 14 March because the running draw for the Eurovision Song Contest will be held on March 15. === Semi-finals === ====Semi-final 1==== * The first semi-final of the 2011 Eurovision Song Contest will take place on 10 May 2011. * The ten countries which has received the most points, will participate for the final of the contest * Two members of the \"Big Five\", Spain and the United Kingdom will vote in this semi-final Draw Country Language Artist Song English translation Results 01 Polish Magdalena Tul \"Jestem\" I am Out 02 English, Swahili Stella Mwangi \"Haba Haba\" Little by little Out 03 English, Albanian Aurela Gaçe \"Feel the Passion\" — Out 04 English Emmy \"Boom-Boom\" — Out 05 English Yüksek Sadakat \"Live It Up\" — Out 06 Serbian Nina Radojčić \"Čaroban\" (Чаробан) Magical Qualified 07 English Alexey Vorobyov \"Get You\" — Qualified 08 English Anna Rossinelli \"In Love for a While\" — Qualified 09 English Eldrine \"One More Day\" — Qualified 10 English Paradise Oskar \"Da Da Dam\" — Qualified 11 English Glen Vella \"One Life\" — Out 12 English Senit \"Stand By\" — Out 13 English Daria Kinzer \"Celebrate\" — Out 14 English Sigurjón's Friends \"Coming Home\" — Qualified 15 English, Hungarian Kati Wolf \"What About My Dreams?\" — Qualified 16 Portuguese Homens da Luta \"A luta é alegria\" The struggle is joy Out 17 English Evelina Sašenko \"C'est ma vie\" It's my life Qualified 18 English Eldar Gasimov and Nigar Jamal \"Running Scared\" — Qualified 19 English, Greek Loukas Giorkas feat. Stereo Mike \"Watch My Dance\" — Qualified ====Semi-final 2==== * The first semi-final of the 2011 Eurovision Song Contest will take place on 12 May 2011. * The ten countries which has received the most points, will participate for the final of the contest * Three members of the \"Big Five\", France, Germany and the Italy will vote in this semi-final Draw Country Language Artist Song English translation Results 01 English, Bosnian Dino Merlin \"Love in Rewind\" — Qualified 02 English Nadine Beiler \"The Secret Is Love\" — Qualified 03 English 3JS \"Never Alone\" — Out 04 English Witloof Bay \"With Love Baby\" — Out 05 English TWiiNS \"I'm Still Alive\" — Out 06 English Mika Newton \"Angel\" — Qualified 07 English Zdob şi Zdub \"So Lucky\" — Qualified 08 English Eric Saade \"Popular\" — Qualified 09 Greek Christos Mylordos I loved you like an angel — Out 10 Bulgarian Poli Genova \"Na inat\" (На инат) For spite Out 11 Macedonian Vlatko Ilievski \"Rusinka\" (Русинкa) Russian Girl Out 12 Hebrew, English Dana International \"Ding Dong\" — Out 13 English Maja Keuc \"No One\" — Qualified 14 English Hotel FM \"Change\" — Qualified 15 English Getter Jaani \"Rockefeller Street\" — Qualified 16 English Anastasia Vinnikova \"I Love Belarus\" — Out 17 English Musiqq \"Angel in Disguise\" — Out 18 English A Friend In London \"New Tomorrow\" — Qualified 19 English Jedward \"Lipstick\" — Qualified ====Final==== * The final of the 2011 Eurovision Song Contest will took place on 14 May 2011. * Only the countries of the \"Big Five\" automatically qualify for the final. * From the two semi-finals on 10 and 12 May 2011, twenty countries qualified for the final, and a total of twenty-five countries will competed in the final. * The voting system used will be the same as used in the 2010 Eurovision Song Contest, a 50/50 system, with a combination of televotes and jury votes who will select the winner. Viewers were able to vote during the performances. Draw Country Language Artist Song English translation Points Place 01 English Paradise Oskar \"Da Da Dam\" — 57 21 02 English, Bosnian Dino Merlin \"Love in Rewind\" — 125 06 03 English A Friend In London \"New Tomorrow\" — 134 05 04 English Evelina Sašenko \"\" It's my life 63 19 05 English, Hungarian Kati Wolf \"What About My Dreams ?\" — 53 22 06 English Jedward \"Lipstick\" — 119 08 07 English Eric Saade \"Popular\" — 185 03 08 English Getter Jaani \"Rockefeller Street\" — 44 24 09 English, Greek Loukas Giorkas feat. Stereo Mike \"Watch My Dance\" — 120 07 10 English, Russian Alexey Vorobyov \"Get You\" — 77 16 11 Corsican Amaury Vassili \"\" Dream 82 15 12 Italian, English Raphael Gualazzi \"Madness of Love\" — 189 02 13 English Anna Rossinelli \"In Love for a While\" — 19 25 14 English Blue \"I Can\" — 100 11 15 English Zdob şi Zdub \"So Lucky\" — 97 12 16 English Lena Meyer-Landrut \"Taken by a Stranger\" — 107 10 17 English Hotel FM \"Change\" — 77 17 18 English Nadine Beiler \"The Secret Is Love\" — 64 18 19 English Ell and Nikki \"Running Scared\" — 221 01 20 English Maja Keuc \"No One\" — 96 13 21 English Sjonni's Friends \"Coming Home\" — 61 20 22 Spanish Lucía Pérez \"\" They can't take away the good things I've lived 50 23 23 English Mika Newton \"Angel\" — 159 04 24 Serbian Nina \"\" (Чаробан) Magical 85 14 25 English Eldrine \"One More Day\" — 110 09 == References == Category:2011 in music Category:2011 in Germany Category:Düsseldorf 2011 Category:May 2011 events",
 "title": "Eurovision Song Contest 2011"
}