{
 "id": "255933",
 "text": "Khloé Alexandra Kardashian (born June 27, 1984) is an American reality television celebrity, socialite, and TV presenter. She became famous after appearing on her family's TV show Keeping Up with the Kardashians. == Early life == Khloé Alexandra Kardashian was born on June 27, 1984 in Los Angeles, California.http://www.californiabirthindex.org/birth/khloe_alexandra_kardashian_born_1984_16378963 She is the sister of Kim Kardashian, Kourtney Kardashian, Rob Kardashian, Kendall Jenner and Kylie Jenner. Kardashian is the daughter of Kris Jenner and Robert Kardashian Sr, and the ex-stepdaughter of Caitlyn Jenner. ==Career== In 2007, the Kardashians started their reality show, giving them a lot of fame and publicity. She has also starred in several of its spin-offs as well as its sequel, The Kardashians. As a TV presenter, Kardashian has presented her own shows: Kocktails with Khloé and Revenge Body with Khloé Kardashian. She was also the co-host of The X Factor USA. Kardashian also owns a clothing business named Good American. == Personal life == Kardashian married Los Angeles Lakers basketball player Lamar Odom in 2009. The two had their own TV show named Khloé and Lamar. She filed for divorce in December 2013, and it was finalized in 2016. She previously dated NBA player James Harden and music producer French Montana. Kardashian was in an on-off relationship with Canadian basketball player Tristan Thompson. On September 26, 2017, it was revealed that they are expecting a child together. This announcement came after Kardashian's half-sister Kylie Jenner announced her own pregnancy with rapper Travis Scott. On April 12, 2018, Kardashian gave birth to her first child (and Thompson's second), a daughter named True Thompson. In 2022, Kardashian and Thompson welcomed a son via surrogacy. == Filmography == === Television === As herself Year Title Role Notes 2007–2021 Keeping Up with the Kardashians Main role 2009 The Celebrity Apprentice Contestant Eliminated in Week 6 2009 Kourtney and Kim Take Miami Guest role 2011 Kourtney and Kim Take New York Guest role 2011 Khloé & Lamar Main role 2012 The X Factor USA Presenter Season 2 2014 Kourtney and Khloé take the Hamptons Main role 2015 I Am Cait Guest role 2016 Kocktails with Khloé Presenter 2017– 2019 Revenge Body with Khloé Kardashian Presenter 2022– present The Kardashians Main role == References == Category:1984 births Category:Living people Category:American television personalities Category:Television personalities from Los Angeles Category:Participants in American reality television series Category:American company founders Category:Kardashian family",
 "title": "Khloé Kardashian"
}