{
 "id": "256071",
 "text": "Sir Michael Terence Wogan (; 3 August 1938 – 31 January 2016), better known as Terry Wogan, was a veteran Irish-British radio and television broadcaster, who has worked for the British Broadcasting Corporation in the United Kingdom for most of his career. Before he retired from the weekday breakfast programme Wake Up to Wogan on BBC Radio 2 on 18 December 2009, Wogan had a regular eight million listeners, making him the most listened to radio broadcaster of any European nation.\"Wogan’s run – the King of banter finally goes blankety blank\" By Kim Bielenberg, Saturday September 12, 2009, Irish Independent He began his career at Raidió Teilifís Éireann where he presented shows such as Jackpot in the 1960s. Wogan was a leading media personality in the UK from the late 1960s and is often referred to as a national treasure. He is best known in the United Kingdom for his BBC 1 chat show Wogan, the game show Blankety Blank, for his work presenting Children in Need, as the host of Wake Up to Woganon BBC Radio 2, and as the BBC's commentator for the Eurovision Song Contest from 1980 to 2008. He was awarded an honorary knighthood in 2005. When he took dual British citizenship later that year, he became entitled to be addressed as \"Sir Terry Wogan\". Wogan started a primetime weekend show on Radio 2 from 14 February 2010. Wogan died on 31 January 2016 in Taplow, Buckinghamshire, England from cancer of unknown primary origin at the age of 77. ==References== Category:1938 births Category:2016 deaths Category:Deaths from cancer of unknown primary origin Category:BBC radio presenters Category:BBC television presenters Category:British entertainers Category:British radio personalities Category:British television personalities Category:Cancer deaths in England Category:Disease-related deaths in Buckinghamshire Category:Eurovision Song Contest presenters Category:Irish television presenters Category:Naturalised citizens of the United Kingdom Category:People from Limerick",
 "title": "Terry Wogan"
}