{
 "id": "256394",
 "text": "Nicholas Gregory \"Greg\" Mankiw (born February 3, 1958) is a famous economist. He graduated from Princeton University and Massachusetts Institute of Technology. He was an economic advisor for President George W. Bush from 2003-2005. In 2006, he became an economic adviser to Mitt Romney.Romney Taps Bush Hands to Shape Economic Policies, February 24, 2012 ==Publications== He wrote a widely used college textbook for economics called Principles of Economics, listing 10 principles that all economies run on: * People Face Tradeoffs (sometimes people have to choose between two things) * The Cost of Something is What You Give Up to Get It * Rational People Think at the Margin (people think of the pros and cons before making a purchase) * People Respond to Incentives (when there is a reward to do something, more people will do it) * Trade Can Make Everyone Better Off * Markets Are Usually a Good Way to Organize Economic Activity (the economy usually does well without government interference) * Governments Can Sometimes Improve Market Outcomes (sometimes it is necessary for the government to help the economy) * A Country's Standard of Living Depends on Its Ability to Produce Goods and Services * Prices Go Up When the Government Prints Too Much Money (the more money there is, the less value it has) * Society Faces a Short-Run Tradeoff Between Inflation and Unemployment His economic beliefs were influenced by John Maynard Keynes and he believes in Keynesian economics. He is sometimes labeled as a conservative because he supported George W. Bush's tax cuts and he has criticized the policies of the Obama Administration a few times. He also was influenced by the economist Arthur Pigou who believed that a high tax on something bad for society (called a sin tax) will result in fewer people buying it. ==References== Category:1958 births Category:Living people Category:American economists Category:People from Trenton, New Jersey",
 "title": "N. Gregory Mankiw"
}