{
 "id": "256497",
 "text": "Brent Seabrook (born April 20, 1985) is a Canadian former professional ice hockey defenceman. He played a total of 15 seasons in the National Hockey League (NHL), all with the Chicago Blackhawks. He was the Chicago Blackhawks first round draft pick in 2003. He played in the WHL for the Lethbridge Hurricanes where he played four seasons. On June 9, 2010, Seabrook won the Stanley Cup with the Chicago Blackhawks and also won a gold medal at the 2010 Winter Olympics. On June 24, 2013, He won his second Stanley Cup with the Blackhawks after they defeated the Boston Bruins 4 games to 2 in the 2013 Stanley Cup Finals. On September 17, 2015, Seabrook was named as an alternate captain for the Blackhawks. On September 26, 2015, Seabrook signed an 8-year contract extension with the Blackhawks. On March 5, 2021, Seabrook announced that injuries he suffered from throughout his career would force him to retire from playing professional ice hockey. On July 27, the Blackhawks traded Seabrook to the Tampa Bay Lightning in exchange for Tyler Johnson and a second-round draft pick in the 2023 NHL Entry Draft. However, he never played a game for the Lightning. His younger brother Keith played for the Rockford IceHogs of the AHL. ==Awards== *He won the gold medal with Canada at the IIHF World U18 Championships gold medalist in 2003. *He won the silver medal with Canada ath the World Junior Ice Hockey Championships in 2004. *He was named to the WHL East Second All-Star Team in 2005. *He won the gold medal with Canada at the World Junior Ice Hockey Championships in 2005. *He participated in the NHL YoungStars Game in 2006. *He won the Stanley Cup with the Chicago Blackhawks in 2010. *He won the gold medal with Canada at the 2010 Winter Olympics. *He won the Stanley Cup with the Chicago Blackhawks in 2013. ==References== ==Other websites== * Category:1985 births Category:Living people Category:Canadian ice hockey defencemen Category:Olympic gold medalists for Canada Category:Chicago Blackhawks players Category:Ice hockey people from British Columbia Category:Norfolk Admirals players Category:Lethbridge Hurricanes players Category:Stanley Cup champions",
 "title": "Brent Seabrook"
}