{
 "id": "256660",
 "text": "Joseph Satriani (born July 15, 1956 in Westbury, New York) is an American musician. He can play different instruments. He is most well known for his work as a rock guitarist. Early in his career, Satriani worked as a guitar teacher. Some of his former students have become famous with their guitar skills. These include Steve Vai, Larry LaLonde, Kirk Hammett, Charlie Hunter, Kevin Cadogan and Alex Skolnick. Satriani has been important in the music made by other musicians. He was a founder of the ever-changing touring trio, G3, as well as performing in various positions with other musicians. ==Awards and nominations== Satriani has the second most Grammy Award nominations of any artist without winning. Nominations Year Album Category 1989 \"Always With Me, Always With You\" Best Pop Instrumental Performance 1989 Surfing with the Alien Best Rock Instrumental Performance 1990 \"The Crush of Love\" Best Rock Instrumental Performance 1991 Flying in a Blue Dream Best Rock Instrumental Performance 1993 The Extremist Best Rock Instrumental Performance 1994 \"Speed of Light Best Rock Instrumental Performance 1995 \"All Alone\" Best Rock Instrumental Performance 1997 (You're) My World\" Best Rock Instrumental Performance 1998 \"Summer Song\" (Live) Best Rock Instrumental Performance 1999 \"A Train of Angels\" Best Rock Instrumental Performance 2001 \"Until We Say Goodbye\" Best Rock Instrumental Performance 2002 \"Always With Me, Always With You\" (Live) Best Rock Instrumental Performance from Live in San Francisco 2003 \"Starry Night\" Best Rock Instrumental Performance 2006 Super Colossal Best Rock Instrumental Performance 2008 \"Always With Me, Always With You\" (Live) Best Rock Instrumental Performance from Satriani Live! ==Discography== *Not of This Earth (1986) *Surfing with the Alien (1987) *Flying in a Blue Dream (1989) *The Extremist (1992) *Time Machine (1993) *Joe Satriani (1995) *Crystal Planet (1998) *Engines of Creation (2000) *Strange Beautiful Music (2002) *Is There Love in Space? (2004) *Super Colossal (2006) *Professor Satchafunkilus and the Musterion of Rock (2008) *Black Swans and Wormhole Wizards (2010) ==References== Category:1956 births Category:Living people Category:American rock guitarists Category:Musicians from New York (state) Category:American heavy metal musicians",
 "title": "Joe Satriani"
}