{
 "id": "256658",
 "text": "Reign in Blood is the third album by Slayer. Slayer is an American thrash metal band. Def Jam Recordings released the album on October 7, 1986. Reign in Blood was Slayer's first album with a major record label. Rick Rubin produced the album with the band. He helped the band make better music. Many music critics and fans liked Reign in Blood. The album helped Slayer become more popular. The band became important in the heavy metal community. Kerrang! magazine said the record was \"the heaviest album of all time,\" and an important album in thrash metal and speed metal. Reign in Blood is compared to many other important thrash metal albums made in the 1980s, such as Anthrax's Among the Living, Megadeth's Peace Sells... but Who's Buying?, and Metallica's Master of Puppets. Many people think Reign in Blood is one of the most influential thrash metal albums ever made. Reign in Blood changed how thrash metal music sounded in the 1980s. It was Slayer's first album on the Billboard 200. It was number 94 on the music chart. The RIAA gave the album a gold certification in 1992. In 2013, NME wrote that it was one of the greatest albums of all time. == Background == Slayer released their second album in March 1985. It is named Hell Awaits. Many music critics liked it. The band's producer, Brian Slagel, thought that the band's next album was going to be very popular. Slagel talked to many different record labels. One of them was Def Jam Recordings. At first, Slagel did not want the band to join Def Jam. This is because Def Jam did not have many other thrash metal bands in their record label. Rick Rubin, one of the people who made Def Jam, was interested in Slayer. Dave Lombardo, the band's drummer, learned that Rubin was interested. He tried to talk to Rubin. The other members of Slayer did not want to leave Metal Blade Records. Metal Blade helped them make Show No Mercy (1983) and Hell Awaits. The band also had a contract with Metal Blade. Lombardo talked to Columbia Records. This was Def Jam's distributor (business that moves products). Columbia helped Lombardo talk to Rubin. Rubin agreed to go to one of Slayer's concerts. He brought Glen E. Friedman with him. Friedman was a music producer. Friedman had produced the first album made by Suicidal Tendencies. Slayer's singer, Tom Araya, was in a music video for a song on the album. Jeff Hanneman was surprised that Rubin was interested in the band. Hanneman liked the work Rubin did with hip hop music makers, such as Run-DMC and LL Cool J. Rubin later talked to the band, and said that he wanted them to join Def Jam. Slayer joined the record label. The band went to Seattle for two days to take group photos. One of the photos was used on the back of the album South of Heaven (1988). == Making the album == The band recorded and produced Reign in Blood at Hit City West (a music studio) in Los Angeles. Rubin produced the album with the band. It was the first time Rubin produced a thrash metal album. Because of this, he made the album sound different from the band's first two albums. A music critic from AllMusic thought that Rubin's work made the songs on the album faster. He also made the music on Reign in Blood sound better than the music on Show No Mercy and Hell Awaits. Because of this, Slayer's music sounded different, and more people listened to it. There is a scream at the start of \"Angel of Death\". This is the first song on the album. Araya said that Hanneman wanted to put the scream on the album. Araya is the person who screamed. He recorded himself screaming many times.Archived at Ghostarchive and the Wayback Machine: The album is 29 minutes long. The band realized the album was short once they finished it. The band did not know if they should make more music or not. They asked Rubin what to do. Araya told Metal Hammer that Rubin said \"it had 10 songs, verses, choruses and leads\", and that it was an album. Rubin did not have a problem with how long the album was. King said that albums that were an hour long were normal at the time. He said that by taking out unneeded songs, \"you could make a much more intense record, which is what we're all about\". The album fits on one side of a cassette tape. Slayer did a concert tour after they finished the album. It was named the Reign in Pain tour. In the United States, they played with Overkill. In Europe, they played with Malice. In late 1986, Dave Lombardo left Slayer. The band needed a new drummer so they could keep playing music. They hired Tony Scaglione from Whiplash. Rubin wanted Lombardo to join the band again. He told Lombardo he would give him money to come back. In 1987, Lombardo came back to the band. == Release == Slayer released Reign in Blood on October 7, 1986. It was the band's first album to be on the Billboard 200. This is an American music chart. It was number 94 on the music chart. The album was also number 47 on the UK Albums Chart. In 1992, the RIAA gave the album a gold certification. Reign in Blood got good reviews from many music magazines. Steve Huey, a music critic from AllMusic, wrote that the album was a \"classic\". He also said that the album helped make death metal. Clay Jarvis from Stylus Magazine said that it was \"the greatest metal album of all time\". Kerrang! said it was the \"heaviest album of all time\". The magazine put Reign in Blood on a list of the 100 best heavy metal albums. In 2006, Metal Hammer said it was the \"best metal album of the last 20 years\". In 2017, Rolling Stone ranked the album number 6 on a list of the \"100 Greatest Metal Albums of All Time\". ==Track listing== : \"Aggressive Perfector\" was shorter and had clearer production than the version on the reissue of the EP Haunting the Chapel. The reissue also fixed a problem with some CD pressings which incorrectly set the beginning of \"Raining Blood\" into the blank pause in \"Postmortem\". ==Charts and certifications== ===Charts=== Chart (1986) Peak position Chart (1987) Peak position Chart (2009) Peak position Chart (2022) Peak position ===Certifications=== ==Sources== Category:1986 albums Category:Slayer albums Category:Def Jam Recordings albums",
 "title": "Reign in Blood"
}