{
 "id": "256654",
 "text": "Kristopher Royce Versteeg (born May 13, 1986) is a former Canadian professional ice hockey right winger. He played for the Carolina Hurricanes of the National Hockey League (NHL). He has also played for the Chicago Blackhawks, Toronto Maple Leafs, Philadelphia Flyers, Calgary Flames, Los Angeles Kings and Florida Panthers. ==Career== Before playing in the NHL, Versteeg played 5 seasons in the Western Hockey League (WHL). 3 seasons with the Lethbridge Hurricanes, 1 seasons with the Kamloops Blazers and 1 season with the Red Deer Rebels. He was drafted with the 134th overall pick by the Boston Bruins in the 2004 NHL Entry Draft. He played 2 seasons with their American Hockey League (AHL) affiliate, Providence Bruins and was traded along with a conditional draft pick to the Chicago Blackhawks in exchange for Brandon Bochenski. He played 3 seasons with the Blackhawks and won the Stanley Cup with them during the 2009–10 NHL season. His name was originally misspelled \"Kris Vertseeg\" when it was engraved on the Stanley Cup but it was quickly corrected afterwards. Versteeg was traded to the Toronto Maple Leafs along with the rights to prospect Bill Sweatt for Viktor Stalberg, Chris DiDomenico, and Philippe Paradis because of salary cap restraints. He played 1 season with the Maple Leafs and was traded to the Philadelphia Flyers for first-round and third-round draft picks. He only played 20 games for the Flyers and was again traded, this time to the Florida Panthers for a second- round and a third-round pick. Versteeg would play 1 season and 28 games with the Panthers before being traded back to the Chicago Blackhawks on November 14, 2013 in exchange for Jimmy Hayes and Dylan Olsen. On June 15, 2015, he won his second Stanley Cup with the Blackhawks after they defeated the Tampa Bay Lightning in six games. On September 11, 2015, Versteeg was traded along with Joakim Nordström to the Carolina Hurricanes in exchange for a 3rd round draft pick in the 2017 NHL Entry Draft. Versteeg and Nordström were traded because the Blackhawks had to make cap space for Marcus Kruger. == Awards == *2x Stanley Cup champion with the Chicago Blackhawks (2010, 2015) ==References== ==Other websites == * Category:1986 births Category:Living people Category:Calgary Flames players Category:Canadian ice hockey right wingers Category:Carolina Hurricanes players Category:Chicago Blackhawks players Category:Florida Panthers players Category:Ice hockey people from Alberta Category:Kamloops Blazers players Category:Lethbridge Hurricanes players Category:Los Angeles Kings players Category:Norfolk Admirals players Category:People from Lethbridge Category:Philadelphia Flyers players Category:Providence Bruins players Category:Red Deer Rebels players Category:Rockford IceHogs (AHL) players Category:Stanley Cup champions Category:Toronto Maple Leafs players Category:Swedish Hockey League players",
 "title": "Kris Versteeg"
}