{
 "id": "256849",
 "text": "Mickey Charles Mantle (October 20, 1931 – August 13, 1995) was an American baseball centerfielder. He played 18 seasons in Major League Baseball (from 1951 to 1968) for the New York Yankees. Mantle is considered to be the greatest switch hitter of all time. He was inducted into the National Baseball Hall of Fame in 1974. He was born in Spavinaw, Oklahoma. He played on 7 champion Yankees teams. He also hit 16 World Series home runs, and held the record for most home runs in Yankee Stadium for many years. He was elected to the Major League Baseball All-Century Team in 1999. His three closest teammates were Billy Martin , Roger Maris and Whitey Ford. He was an alcoholic, by the time he retired at age 37. He had hepatitis C and died in Dallas, Texas from liver cancer. His nicknames included The Mick, The Commerce Comet, and Muscles. \"The Commerce Comet\" is a reference to Mantle's days spent working in the coal mines of Commerce, Oklahoma. As a result of this work, Mantle grew incredibly strong, which led to the nickname \"Muscles\". Mantle was noted for batting average and for his batting power. He won the Major League Baseball Triple Crown in 1956, leading MLB in batting average, home runs, and runs batted in (RBI). He received three American League (AL) Major League Baseball Most Valuable Player (MVP) Awards, and played in nineteen Major League Baseball All-Star Game games. Mantle appeared in 12 World Series, his team winning 7 of them. He holds the records for most World Series home runs (18), RBIs (40), runs (42), walks (43), extra-base hits (26), and total bases (123). He is also the career leader (tied with Jim Thome) in walk-off home runs, with a combined thirteen, twelve in the regular season and one in the Major League Baseball postseason. Although his lifetime batting average slipped below .300 in his final year , his lifetime on- base - average / percentage was .421 He is known for the longest home run in history , 630 feet over the roof at Tiger Stadium , in 1960. On May 22nd, 1963 he hit a line drive off the Yankee Stadium right field grandstand roof facade ,calculated to have 750 foot potential , if it cleared another six inches . == References == == Other websites == *Official website Category:American baseball players Category:Cancer deaths in Texas Category:Deaths from liver cancer Category:Organ transplant recipients Category:New York Yankees players Category:National Baseball Hall of Fame members Category:Sportspeople from Oklahoma Category:1931 births Category:1995 deaths",
 "title": "Mickey Mantle"
}