{
 "id": "256817",
 "text": "The 35.7-kilometre Circle MRT Line (CCL) is Singapore's fourth Mass Rapid Transit line, and the first medium capacity line. This underground line is long with 30 stations (excluding Bukit Brown) and is fully automatically operated. As the name implies, the line is an orbital line linking all radial lines leading to the city, and also covering many parts of the Central Area. It will also connect to Marina South via a branch line branching off from Promenade and ending at Marina Bay. Circle Line is not a full circle, and the Stage 6 will only merge the section from Marina Bay to HarbourFront, forming a loop. The line is colored yellow on the MRT Rail map. The first part opened to the public from Bartley to Marymount on May 28, 2009. When finished, the line will connect all MRT lines, and will allow passengers to bypass the downtown area, so that the City Hall and Raffles Place interchange stations will be less crowded. The second part opened to the public from Bartley to Dhoby Ghaut on April 17, 2010 while the remaining parts from Marymount to Harbourfront was opened on October 8, 2011. Circle Line Extension (CCLe) from Promenade to Marina Bay opened on 14 January 2012. ==Stations== Station Number Station Name Interchange/Notes Dhoby Ghaut Change to North South Line Change to North East Line Bras Basah Esplanade Promenade Change to Nicoll Highway Stadium Marina Bay shuttle terminus Mountbatten Dakota Paya Lebar Change to East West Line MacPherson Change to Downtown Line Tai Seng Bartley Serangoon Change to North East Line Lorong Chuan Bishan Change to North South Line Marymount Caldecott Change to Thomson-East Coast Line Bukit Brown (Not in operation until further notice) Botanic Gardens Change to Downtown Line Farrer Road Holland Village Buona Vista Change to East West Line one- north Kent Ridge Haw Par Villa Pasir Panjang Labrador Park Telok Blangah HarbourFront Change to North East Line Stage 6 (2025) Stage 6 (2025) Stage 6 (2025) Stage 6 (2025) Keppel Under Construction Cantonment Under Construction Prince Edward Under Construction Circle Line Extension Circle Line Extension Circle Line Extension Circle Line Extension Promenade Change to Bayfront Change to ' Marina Bay Change to North South Line Change to Thomson-East Coast Line == References == Category:2009 establishments in Asia Category:2000s establishments in Singapore Category:Mass Rapid Transit (Singapore) lines",
 "title": "Circle MRT line"
}