{
 "id": "257566",
 "text": "Aliaune Damala Badara Akon Thiam (; born April 16, 1973), known mononymously as Akon, is an American singer, rapper, songwriter, record producer, and entrepreneur. Akon began his career as a singer-rapper, with his big break arriving in 2004 with the release of the singles \"Locked Up\" and \"Lonely.\" Both songs achieving great success, leading up to an album deal with Universal Motown. In the 2010s, Akon branched out onto philanthropy (Akon Lighting Africa), property development (Akon City in Senegal), television/movie production, politics, and others. He grew up in Senegal but at age 7, his family settled in New Jersey. His father, Mor Thiam was a successful jazz percussionist. Soon after moving back to the United States, Akon discovered hip-hop for the first time. Akon has collaborated with and produced for some of the biggest names in the music industry. Akon has been nominated for many awards including 5 Grammy Awards, 3 American Music Awards winning 1 and 4 MTV Video Music Awards. Billboard ranked Akon number 6 on the list of Top Digital Songs Artists of the decade. Akon had been friends with Michael Jackson until his death. Akon released a tribute song called \"Cry Out Of Joy\". In 2010, a song that Akon sung with Jackson, \"Hold My Hand\", was released. It was also released on Michael. R&B; star Akon entered the Congo Mining sector in a Joint Venture with a State owned company in accordance to Times Live in January 2021. == Discography == ===Studio albums=== * Trouble (2004) * Konvicted (2006) * Freedom (2008) * El Negreeto (2019) * Akonda (2019) * Konnect (TBC) * The Konnection (TBC) ==References== ==Other websites== * * * Category:1973 births Category:Living people Category:American contemporary R&B; singers Category:American dance musicians Category:Senegalese people Category:People from Dakar Category:Singers from St. Louis, Missouri Category:Singers from Atlanta Category:Singers from Jersey City, New Jersey Category:American pop singers Category:American record producers Category:Rappers from Missouri Category:American Muslims Category:Businesspeople from Atlanta Category:Businesspeople from Missouri Category:Businesspeople from Jersey City, New Jersey",
 "title": "Akon"
}