{
 "id": "257564",
 "text": "These are the complete Grand Prix racing results for Daimler Benz AG, the official name of the works Mercedes-Benz team, including Formula One. == Complete European Championship results == (key) (results in bold indicate pole position, results in italics indicate fastest lap) Year Chassis Engine Tyres Drivers 1 2 3 4 5 1935 Mercedes-Benz W25A Mercedes-Benz W25B Mercedes-Benz M25A 3.4 L8 Mercedes-Benz M25B 4.0 L8 BEL GER SUI ITA ESP Rudolf Caracciola 1 3 1 Ret 1 Luigi Fagioli 2 6 2 Ret 2 Manfred von Brauchitsch Ret 5 Ret Ret 3 Hermann Lang Ret 6 Ret Hanns Geier 7 DNS 1936 Mercedes-Benz W25K Mercedes-Benz ME25 4.7 L8 MON GER SUI ITA Rudolf Caracciola 1 Ret Ret Manfred von Brauchitsch Ret 7 Ret Hermann Lang Ret 4 Luigi Fagioli Ret 5 Ret Louis Chiron Ret Ret 1937 Mercedes- Benz W125 Mercedes-Benz M125 5.6 L8 BEL GER MON SUI ITA Rudolf Caracciola 1 2 1 1 Manfred von Brauchitsch Ret 2 1 3 Ret Hermann Lang 3 7 2 2 Christian Kautz 4 6 3 6 Ret Richard Seaman Ret 4 Goffredo Zehender 5 1938 Mercedes-Benz W154 Mercedes-Benz M154 3.0 V12 FRA GER SUI ITA Rudolf Caracciola 2 2 1 3 Manfred von Brauchitsch 1 Ret 3 Ret Hermann Lang 3 Ret 10 Ret Richard Seaman 1 2 Ret 1939 Mercedes-Benz W154 Mercedes-Benz M154 3.0 V12 Mercedes-Benz M163 3.0 V12 BEL FRA GER SUI Hermann Lang 1 Ret Ret 1 Rudolf Caracciola Ret Ret 1 2 Manfred von Brauchitsch 3 Ret Ret 3 Hans Hartmann 6 Richard Seaman Ret Heinz Brendel Ret === Notes === After Von Brauchitsch's car retired from the race, he took over Fagioli's car. Fagioli car had already retired. After Caracciola's car developed mechanical problems, he quit the race and Fagioli took over Caracciola's car. After Caracciola's car retired from the race, he took over Lang's car. Lang then took over von Brauchitsch's car. Caracciola retired Lang's car and then took over Fagioli's car. After Fagioli's car retired, he took over Lang's car. Lang's car developed a problem and was handed over to reserve driver Walter Bäumer. Caracciola fell ill and handed his car over to Lang. Lang got glass in his eye after his goggles were smashed by a stone. His car was taken over by reserve driver Walter Bäumer. Caracciola was burnt by leaking exhaust and handed his car over to von Brauchitsch. Von Brauchitsch later handed it back to Caracciola after suffering the same problem. == Complete Formula One results == === As a works (factory) team === (key) (results in bold indicate pole position, results in italics indicate fastest lap) Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points WCC Mercedes-Benz W196 Mercedes- Benz M196 2.5 L L8 ARG 500 BEL FRA GBR GER SUI ITA ESP - - Juan Manuel Fangio 1 4 1 1 1 3 Karl Kling 2 7 4 Ret Ret 5 Hans Herrmann Ret Ret 3 4 Ret Hermann Lang Ret Mercedes-Benz W196 Mercedes-Benz M196 2.5 L L8 ARG MON 500 BEL NED GBR ITA - - Fangio 1 Ret 1 1 2 1 Kling 4 Ret Ret 3 Ret Herrmann 4 PO Stirling Moss 4 9 2 2 1 Ret André Simon Ret Piero Taruffi 4 2 – : Mercedes did not compete as a team Mercedes MGP W01 Mercedes FO 108X 2.4 L V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 214 4th Michael Schumacher 6 10 Ret 10 4 12 4 11 15 9 9 11 7 9 13 6 4 7 Ret Nico Rosberg 5 5 3 3 13 7 5 6 10 3 8 Ret 6 5 5 17 Ret 6 4 Mercedes MGP W02 Mercedes FO 108Y 2.4 L V8 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 80* 4th* Michael Schumacher Nico Rosberg Constructors' Championship not awarded until . Indicates shared drive. Season in progress. === As an engine supplier === (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Jump to: 2000 2010 Year Entrant Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points WCC Broker Sauber Mercedes Sauber C13 Mercedes-Benz 2175B 3.5 L V10 BRA PAC SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR EUR JPN AUS 12 8th Karl Wendlinger 6 Ret 4 DNS Andrea de Cesaris Ret 6 Ret Ret Ret Ret Ret Ret Ret JJ Lehto Ret 10 Heinz-Harald Frentzen Ret 5 7 WD Ret Ret 4 8 Ret Ret Ret Ret Ret 6 6 7 Marlboro McLaren Mercedes McLaren MP4/10 * * * McLaren MP4/10B * * * McLaren MP4/10C Mercedes-Benz FO110 3.0 L V10 BRA ARG SMR ESP MON CAN FRA GBR GER HUN BEL ITA POR EUR PAC JPN AUS 30 4th Mark Blundell 6 Ret 5 Ret 11 5 Ret Ret 5 4 9 Ret 9 7 4 Nigel Mansell 10 Ret Mika Häkkinen 4 Ret 5 Ret Ret Ret 7 Ret Ret Ret Ret 2 Ret 8 2 DNS Jan Magnussen 10 Marlboro McLaren Mercedes McLaren MP4/11 Mercedes-Benz FO110/3 3.0 L V10 AUS BRA ARG EUR SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR JPN 49 4th Mika Häkkinen 5 4 Ret 8 8 6 5 5 5 3 Ret 4 3 3 Ret 3 David Coulthard Ret Ret 7 3 Ret 2 Ret 4 6 5 5 Ret Ret Ret 13 8 West McLaren Mercedes McLaren MP4/12 Mercedes-Benz FO110E 3.0 L V10 * * * Mercedes-Benz FO110F 3.0 L V10 AUS BRA ARG SMR MON ESP CAN FRA GBR GER HUN BEL ITA AUT LUX JPN EUR 63 4th Mika Häkkinen 3 4 5 6 Ret 7 Ret Ret Ret 3 Ret DSQ 9 Ret Ret 4 1 David Coulthard 1 10 Ret Ret Ret 6 7 7 4 Ret Ret Ret 1 2 Ret 10 2 West McLaren Mercedes McLaren MP4/13 Mercedes-Benz FO110G 3.0 L V10 AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN 156 1st David Coulthard 2 2 6 1 2 Ret Ret 6 Ret 2 2 2 7 Ret 3 3 Mika Häkkinen 1 1 2 Ret 1 1 Ret 3 2 1 1 6 Ret 4 1 1 West McLaren Mercedes McLaren MP4/14 Mercedes-Benz FO110H 3.0 L V10 AUS BRA SMR MON ESP CAN FRA GBR AUT GER HUN BEL ITA EUR MAL JPN 124 2nd Mika Häkkinen Ret 1 Ret 3 1 1 2 Ret 3 Ret 1 2 Ret 5 3 1 David Coulthard Ret Ret 2 Ret 2 7 Ret 1 2 5 2 1 5 Ret Ret Ret West McLaren Mercedes McLaren MP4/15 Mercedes-Benz FO110J 3.0 L V10 AUS BRA SMR GBR ESP EUR MON CAN FRA AUT GER HUN BEL ITA USA JPN MAL 152 2nd Mika Häkkinen Ret Ret 2 2 1 2 6 4 2 1 2 1 1 2 Ret 2 4 David Coulthard Ret DSQ 3 1 2 3 1 7 1 2 3 3 4 Ret 5 3 2 West McLaren Mercedes McLaren MP4-16 Mercedes-Benz FO110K 3.0 L V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN 102 2nd Mika Häkkinen Ret 6 Ret 4 9 Ret Ret 3 6 DNS 1 Ret 5 4 Ret 1 4 David Coulthard 2 3 1 2 5 1 5 Ret 3 4 Ret Ret 3 2 Ret 3 3 West McLaren Mercedes McLaren MP4-17 Mercedes-Benz FO110M 3.0 L V10 AUS MAL BRA SMR ESP AUT MON CAN EUR GBR FRA GER HUN BEL ITA USA JPN 65 3rd David Coulthard Ret Ret 3 6 3 6 1 2 Ret 10 3 5 5 4 7 3 Ret Kimi Räikkönen 3 Ret 12 Ret Ret Ret Ret 4 3 Ret 2 Ret 4 Ret Ret Ret 3 West McLaren Mercedes McLaren MP4-17D Mercedes-Benz FO110M 3.0 L V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN ITA USA JPN 142 3rd David Coulthard 1 Ret 4 5 Ret 5 7 Ret 15 5 5 2 5 Ret Ret 3 Kimi Räikkönen 3 1 2 2 Ret 2 2 6 Ret 4 3 Ret 2 4 2 2 West McLaren Mercedes McLaren MP4-19 * * * McLaren MP4-19B Mercedes-Benz FO110P 3.0 L V10 * * * Mercedes-Benz FO110Q 3.0 L V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN BEL ITA CHN JPN BRA 69 5th David Coulthard 8 6 Ret 12 10 Ret Ret 6 7 6 7 4 9 7 6 9 Ret 11 Kimi Räikkönen Ret Ret Ret 8 11 Ret Ret 5 6 7 2 Ret Ret 1 Ret 3 6 2 West McLaren Mercedes * * * Team McLaren Mercedes McLaren MP4-20 Mercedes-Benz FO110R 3.0 L V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN CHN 182 2nd Kimi Räikkönen 8 9 3 Ret 1 1 11 1 DNS 2 3 Ret 1 1 4 1 2 1 2 Juan Pablo Montoya 6 4 7 5 7 DSQ DNS Ret 1 2 Ret 3 1 14 1 Ret Ret Pedro de la Rosa 5 Alexander Wurz 3 Team McLaren Mercedes McLaren MP4-21 Mercedes-Benz FO108S 2.4 L V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 110 3rd Kimi Räikkönen 3 Ret 2 5 4 5 Ret 3 3 Ret 5 3 Ret Ret 2 Ret 5 5 Juan Pablo Montoya 5 4 Ret 3 Ret Ret 2 6 Ret Ret Pedro de la Rosa 7 Ret 2 5 Ret 5 11 8 Vodafone McLaren Mercedes McLaren MP4-22 Mercedes-Benz FO108T 2.4 L V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA - EX Fernando Alonso 2 1 5 3 1 7 2 7 2 1 4 3 1 3 Ret 2 3 Lewis Hamilton 3 2 2 2 2 1 1 3 3 9 1 5 2 4 1 Ret 7 Vodafone McLaren Mercedes McLaren MP4-23 Mercedes-Benz FO108V 2.4 L V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 151 2nd Lewis Hamilton 1 5 13 3 2 1 Ret 10 1 1 5 2 3 7 3 12 1 5 Heikki Kovalainen 5 3 5 Ret 12 8 9 4 5 5 1 4 10 2 10 Ret Ret 7 Vodafone McLaren Mercedes McLaren MP4-24 Mercedes-Benz FO108W 2.4 L V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 71 3rd Lewis Hamilton DSQ 7 6 4 9 12 13 16 18 1 2 Ret 12 1 3 3 Ret Heikki Kovalainen Ret Ret 5 12 Ret Ret 14 Ret 8 5 4 6 6 7 11 12 11 Force India F1 Team Force India VJM02 Adrian Sutil 9 17 17 16 Ret 14 17 17 15 Ret 10 11 4 Ret 13 Ret 17 13 9th Giancarlo Fisichella 11 18 14 15 14 9 Ret 10 11 14 12 2 Vitantonio Liuzzi Ret 14 14 11 15 Brawn GP Brawn BGP 001 Jenson Button 1 1 3 1 1 1 1 6 5 7 7 Ret 2 5 8 5 3 172 1st Rubens Barrichello 2 5 4 5 2 2 Ret 3 6 10 1 7 1 6 7 8 4 Vodafone McLaren Mercedes McLaren MP4-25 Mercedes-Benz FO108X 2.4 L V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 454 2nd Jenson Button 7 1 8 1 5 Ret 2 2 3 4 5 8 Ret 2 4 4 12 5 3 Lewis Hamilton 3 6 6 2 14 5 1 1 2 2 4 Ret 1 Ret Ret 5 2 4 2 Force India F1 Team Force India VJM03 Adrian Sutil 12 Ret 5 11 7 8 9 10 6 8 17 Ret 5 16 9 Ret Ret 12 13 68 7th Vitantonio Liuzzi 9 7 Ret Ret 15 9 13 9 16 11 16 13 10 12 Ret Ret 6 Ret Ret Vodafone McLaren Mercedes McLaren MP4-26 Mercedes-Benz FO 108Y 2.4 L V8 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 280* 2nd* Lewis Hamilton Jenson Button Force India F1 Team Force India VJM04 Adrian Sutil 26 7th* Paul di Resta Season in progress == References == Category:Formula One constructor results Category:Formula One current",
 "title": "Mercedes-Benz Grand Prix results"
}