{
 "id": "257652",
 "text": "This is a Formula One World Championship scoring system used by the Fédération Internationale de l'Automobile (FIA). The FIA uses this system to decide the FIA World Drivers' and Constructors' Championships since the season. The Championships are awarded to the driver and constructor (car builder) who score the most points over the course of the season. From through , a championship point was awarded to the driver (and team starting in ) that set the fastest lap. In some seasons, not all race results would be counted towards the World Championship. Only a certain number of a driver's best results would count. In this caused a very unusual result. Alain Prost and Ayrton Senna were the drivers for McLaren. They were the best two drivers of that year. There were 16 races that year, but only the best 11 results counted towards the championship. Prost won seven races and finished seven races in second place. He scored a total of 105 points, but only 87 of them counted for the championship. Senna won eight races and finished second in three, giving him 90 points for the championship and 94 for the season. This resulted in the strange event where Prost took a record number of points, yet Senna won the champion. A new system counting all races was introduced in . One additional point was also awarded to the race winner. The current system was introduced for the season. It was designed to allow more teams and drivers to score points. The most dominant Drivers' Champion in terms of points scored is Jim Clark. Clark scored the maximum of 54 points (6 wins) in both 1963 and 1965. In recent years, Michael Schumacher finished on the podium (one of the top three finishers) in every race of the 2002 season. Schumacher scored 144 of a maximum 170 points. The most dominant Constructors' Champion in recent times was McLaren in 1988. McLaren scored 199 of a maximum 240 points available. McLaren finished 134 points ahead of the second place team. In , Ferrari scored 221 points of a maximum 340 points available. Ferrari finished 129 points ahead of the second place team. == Pointscoring systems == Seasons 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th Fastest lap Sprint Qualifying Results Best results counted towards Drivers' Championship Best results counted towards Constructors' Championship Notes 1950–1953 8 6 4 3 2 1 4 N/A The Constructors' World Championship was not awarded from 1950 to 1957.Points for drivers sharing the same car were shared equally between the drivers, regardless of how many laps each driver completed. 1954 8 6 4 3 2 1 5 N/A Points were shared equally between drivers who set the same fastest lap time (an extreme example of which happened in the British Grand Prix where seven drivers set the same fastest lap time, and each received 1/7 of a point). 1955 8 6 4 3 2 1 5 N/A Points for drivers sharing the same car were shared equally between the drivers, even if they drove more than one points-scoring car (for example, the Argentine Grand Prix), unless one driver was determened to have completed \"insufficient distance\" (for example, the British Grand Prix). 1956–1957 8 6 4 3 2 1 5 N/A Drivers who shared more than one car in a race only received points for their highest finish (for example, the Monaco Grand Prix).Formula 2 cars raced with Formula One cars in the following Grands Prix, but were ineligible for World Championship points. * German Grand Prix * German Grand Prix * Morocco Grand Prix * German Grand Prix * German Grand Prix * German Grand Prix 1958 8 6 4 3 2 1 6 Same as Drivers' Championship Points were no longer awarded for shared race drives (for example, the Italian Grand Prix, and the Argentine Grand Prix).Only the points of the highest-scoring driver for each constructor at each race (including privateer entries) were counted towards the Constructors' Championship.The point for fastest lap was only awarded to drivers, not constructors 1959 8 6 4 3 2 1 5 Same as Drivers' Championship 1960 8 6 4 3 2 1 6 Same as Drivers' Championship 1961–1962 9 6 4 3 2 1 5 Same as Drivers' Championship 1963–1965 9 6 4 3 2 1 6 Same as Drivers' Championship 1966 9 6 4 3 2 1 5 Same as Drivers' Championship Drivers who were not classified (did not complete a specified amount of race distance) did not score points, even if they finished in the top 6. 1967 9 6 4 3 2 1 9 (5 from first 6, 4 from last 5) Same as Drivers' Championship 1968 9 6 4 3 2 1 10 (5 from first 6, 5 from last 6) Same as Drivers' Championship 1969 9 6 4 3 2 1 9 (5 from first 6, 4 from last 5) Same as Drivers' Championship 1970 9 6 4 3 2 1 11 (6 from first 7, 5 from last 6) Same as Drivers' Championship 1971 9 6 4 3 2 1 9 (5 from first 6, 4 from last 5) Same as Drivers' Championship 1972 9 6 4 3 2 1 10 (5 from first 6, 5 from last 6) Same as Drivers' Championship 1973–1974 9 6 4 3 2 1 13 (7 from first 8, 6 from last 7) Same as Drivers' Championship 1975 9 6 4 3 2 1 12 (6 from first 7, 6 from last 7) Same as Drivers' Championship Half points were awarded for races stopped before three-quarter-distance was completed. 1976 9 6 4 3 2 1 14 (7 from first 8, 7 from last 8) Same as Drivers' Championship 1977 9 6 4 3 2 1 15 (8 from first 9, 7 from last 8) Same as Drivers' Championship 1978 9 6 4 3 2 1 14 (7 from first 8, 7 from last 8) Same as Drivers' Championship 1979 9 6 4 3 2 1 8 (4 from first 7, 4 from last 8) All 1980 9 6 4 3 2 1 10 (5 from first 7, 5 from last 7) All 1981–1984 9 6 4 3 2 1 All Same as Drivers' Championship Second drivers of teams that officially entered only one car were not eligible for points. This affected Jo Gartner who drove for (Osella) and Gerhard Berger who drove for (ATS), and finished fifth and sixth at the Italian Grand Prix and Yannick Dalmas who drove for (Larrousse), and finished fifth at the Australian Grand Prix. Their points were not redistributed. 1985–1990 9 6 4 3 2 1 11 All 1991–2002 10 6 4 3 2 1 All Same as Drivers' Championship 2003–2009 10 8 6 5 4 3 2 1 All Same as Drivers' Championship 2010–2018 25 18 15 12 10 8 6 4 2 1 All Same as Drivers' Championship \"FIA F1 Commission Press Release 02/02/2010\" 2 February 2010 2019-2020 25 18 15 12 10 8 6 4 2 1 1 All Same as Drivers' Championship 2021 25 18 15 12 10 8 6 4 2 1 1 Top 3 Finishers All Same as Drivers' Championship == Notes == == References == * Category:Formula One lists",
 "title": "List of Formula One World Championship points scoring systems"
}