{
 "id": "257735",
 "text": "Royal Rumble (2010) was the twenty-third annual Royal Rumble professional wrestling pay-per-view event made by World Wrestling Entertainment (WWE). It took place on January 31, 2010 at the Philips Arena in Atlanta, Georgia. As always, the Royal Rumble match winner got a match at that years WrestleMania, (in this instance: WrestleMania XXVI) for his choice at either the WWE Championship, the World Heavyweight Championship and the ECW World Championship. Six professional wrestling matches were on the event's supercard, a scheduling of more than one main event. The main event was the annual 30-man Royal Rumble match which featured wrestlers from all three brands. Edge, the twenty-ninth person to enter, won the match by last eliminating John Cena, the nineteenth person to enter. The main match on the Raw brand was for the WWE Championship between champion Sheamus and Randy Orton, which Sheamus won by disqualification. The main match on the SmackDown brand was between The Undertaker and Rey Mysterio for the World Heavyweight Championship, which The Undertaker won. The main match on the ECW brand was for the ECW Championship between Christian and Ezekiel Jackson, which Christian won. ==Results== # Matches Stipulations Time Dark Gail Kim, Kelly Kelly, Eve Torres, and The Bella Twins (Nikki and Brie) defeated Maryse, Katie Lea Burchill, Jillian Hall, Alicia Fox, and Natalya 10-Diva tag team match N/A 1 Christian (c) defeated Ezekiel Jackson (with William Regal) Singles match for the ECW Championship 11:59 2 The Miz (c) defeated Montel Vontavious Porter Singles match for the WWE United States Championship 7:30 3 Sheamus (c) defeated Randy Orton by disqualification Singles match for the WWE Championship 12:25 4 Mickie James defeated Michelle McCool (c) (with Layla) Singles match for the WWE Women's Championship 0:20 5 The Undertaker (c) defeated Rey Mysterio Singles match for the World Heavyweight Championship 11:07 6 Edge last eliminated John Cena to win 2010 Royal Rumble match 49:24 ===Royal Rumble entrances and eliminations=== Red ██ and \"Raw\" indicates a Raw superstar, blue ██ and \"SD\" indicates a SmackDown superstar, and purple ██ and \"ECW\" indicates an ECW superstar. Draw Entrant Brand Order Eliminated by Time Dolph Ziggler SD Punk Evan Bourne Raw Punk CM Punk SD Triple H 10:04 JTG SD Punk The Great Khali SD Phoenix Beth Phoenix SD Punk Zack Ryder ECW Punk Triple H Raw 17 Michaels 17:51 Drew McIntyre SD 16 Michaels and Triple H 14:43 10 Ted DiBiase Raw 14 Michaels 12:40 11 John Morrison SD 15 Michaels 11:37 12 Kane SD 11 Triple H 13 Cody Rhodes Raw 13 Michaels 14 Montel Vontavious Porter Raw Himself 15 Carlito Raw 12 Michaels 16 The Miz Raw MVP 17 Matt Hardy SD 10 Kane 18 Shawn Michaels Raw 27 Batista 20:45 19 John Cena Raw 29 Edge 22:11 20 Shelton Benjamin ECW 18 Cena 21 Yoshi Tatsu ECW 19 Cena 22 The Big Show Raw 22 R-Truth 23 Mark Henry Raw 21 R-Truth 24 Chris Masters Raw 20 Big Show 25 R-Truth SD 24 Kingston 26 Jack Swagger Raw 23 Kingston 27 Kofi Kingston Raw 25 Cena 28 Chris Jericho SD 26 Edge 29 Edge SD 30 Batista SD 28 Cena ==Other websites== Category:Royal Rumble Category:2010 in professional wrestling Category:Sports in Atlanta Category:2010 in the United States Category:21st century in Atlanta Category:2010s in Georgia (U.S. state) Category:January 2010 events",
 "title": "Royal Rumble (2010)"
}