{
 "id": "257936",
 "text": "The oxidation state (or oxidation number) of an element is used to predict what sort of chemical compounds form. Every element has oxidation states that it likes, and will not form compounds that would put it in a bad state. Formally, oxidation states are defined in terms of the electronegativity of atoms in chemical bonds. You can look up the oxidation state(s) of an element on many periodic tables. They are usually between −2 and +3. A pure element always has an oxidation state of 0. == History == Oxidation states were invented by Antoine Lavoisier to predict how oxygen reacted in chemical reactions; hence the name. Later on, we learned that Lavoisier's theory can be used to predict other reactions too, many of them have nothing to do with oxygen. == Examples == Oxygen wants the -2 state, while hydrogen likes +1. Two hydrogen atoms stick to one oxygen atom to give a water molecule, . Oxygen can't have the -3 state, so they can't form . Uranium has two important oxidation states, +4 and +6. Fluorine always has the -1 oxidation state in compounds. To make nuclear fuel, uranium tetrafluoride , which has uranium in the +4 state and four fluorine atoms in the -1 state, is treated with elemental fluorine (two fluorine atoms in the 0 state): : The uranium atom changes from the +4 to the +6 state, and the two fluorine atoms change from the 0 state to the -1 state. Carbon can form compounds with oxidation states anywhere from -4 to 4. The carbon atom has the -4 state in methane, the -2 state in methanol, the 0 state in formaldehyde, the +2 state in formic acid, and the +4 state in carbon dioxide. Odd states can be seen in compounds with two carbons: both carbons have the -3 state in ethane, the -1 state in ethylene glycol, the +1 state in glyoxal, and the +3 state in oxalic acid. Carbon having so many oxidation states is part of what makes organic chemistry so complex. The highest oxidation state that people have made in a lab is +9, on iridium. The lowest is -5, on boron and gallium. == Relation to electric charge == In ionic compounds, oxidation states tell us about the movement of charge within the compound. For example, chlorine has a very high electronegativity which means that it really likes electrons and sodium has a very low electronegativity which means that it really hates electrons. When sodium and chlorine are close together, sodium will give away an electron to chlorine. A change in charge has taken place; chlorine's charge has gone down which we call reduction, and sodium's charge has gone up which we call oxidation. In covalent bonds, electrons are shared, not given away. Like ionic compounds, a bond between two different elements will lower the oxidation state of the element that wants electrons more, and raise the oxidation state of the element that wants them less - but the partial charges of the atoms will be smaller than the oxidation state. In water, oxygen has an oxidation state of -2 (its bonds give it two more electrons than elemental oxygen) but only a small negative charge (the electrons are still shared with the hydrogen). Sometimes, the oxidation state can even have a different sign than the electric charge. In methanol, the carbon atom has three bonds with hydrogen (wants electrons less than carbon does, -1 for each) and one bond with oxygen (wants electrons more, +1) for a total oxidation state of -2; but in the actual molecule, oxygen pulls on electrons so strongly that the carbon atom still has a very small positive charge. == Rules == # Every element that is not combined automatically is equal to 0. # Monatomic ions are automatically equal to ionic charge. # Metals of Group 1 and 2 are automatically equal to +1 or +2 respectively. # Fluorine is always automatically equal to -1, and all other halogens are automatically equal to -1 if they are the most electronegative in the compound. # Hydrogen is automatically equal to +1 unless it is alongside a metal which makes it automatically equal to -1. # Oxygen is automatically equal to -2, but if put alongside Fluorine, it is automatically +2. # Adding all the oxidation states in a compound must automatically equal to 0. # Adding all the oxidation states on a polyatomic ion must automatically equal to the charge. == References == Category:Chemical bonding Category:Oxides",
 "title": "Oxidation state"
}