{
 "id": "257999",
 "text": "Michael Austin Cera (born June 7, 1988 in Brampton, Ontario) is a Canadian actor who made his big screen debut in the 2000 movie Frequency as Gordy Jr., (Age 10) but first starred in the TV movie, Switching Goals as Taylor. He was nominated for the Orange Rising Star Award in 2009. == Filmography == Year Title Role Notes 1999 Switching Goals Taylor 2000 Frequency Gordy Jr., Age 10 Steal This Movie! America Hoffman, Age 7-8 Ultimate G's: Zac's Flying Dream Young Zac 2001 Stolen Miracle Brandon McKinley My Louisiana Sky Jesse Wade Thompson The Familiar Stranger Young Ted Welsh TV Walter and Henry Crying Kid TV 2002 Confessions of a Dangerous Mind Chuck Barris, Age 8 and 11 2007 Superbad Evan Juno Paulie Bleeker 2008 Extreme Movie Fred Nick and Norah's Infinite Playlist Nick O'Leary 2009 Paper Heart Himself Year One Oh 2010 Youth in Revolt Nick Twisp / François Dillinger Scott Pilgrim vs. the World Scott Pilgrim 2012 The End of Love 2013 This Is the End Himself Crystal Fairy Jamie Magic Magic Brink 2017 The Lego Batman Movie Robin Voice ===Television=== Year Title Role Notes 1999 I Was a Sixth Grade Alien Larrabe Hicks Series regular 1998–2001 Rolie Polie Olie Little Gizmo Four Episodes, voice only 2000 La Femme Nikita Jerome Season four, one episode 2001–2003 The Berenstain Bears Brother Bear Series regular, voice only 2001–2005 Braceface Josh Spitz Series regular, voice only 2003–2006, 2013 Arrested Development George Michael Bluth Series regular 2005–2007 Wayside Todd (Pilot) Pilot, voice only 2006 Veronica Mars Dean Rudolph The Rapes of Graff, Guest Spot 2007 Clark and Michael Mikey Cera Series regular 2007 Tim and Eric Awesome Show, Great Job! Jaime Stevens Season One, Episode Three 2008, 2010-present Childrens Hospital Sal Viscuso Recurring, voice only 2010 Scott Pilgrim vs. the Animation Scott Pilgrim Short animation based on the movie Scott Pilgrim vs. the World 2012 The Simpsons Nick One episode, voice only, \"The Daughter Also Rises\" ==Awards== *2005 Best Actor Award - Darling, Darling at the San Gio Festival *2007 Breakthrough Artist Award - Austin Film Critics Association *2008 Canadian Comedy Award for Best Actor - Superbad *2008 Canadian Comedy Awards for Best Actor - Juno (nomination) *2009 BAFTA Rising Star Award - (nomination) Category:1988 births Category:Living people Category:Actors from Ontario Category:Canadian movie actors Category:Canadian television actors Category:Canadian voice actors Category:People from Brampton, Ontario",
 "title": "Michael Cera"
}