{
 "id": "258186",
 "text": "\"Don't Look Back in Anger\" is a song by English rock band Oasis. It was released in 1996 as the fourth single from their second album (What's the Story) Morning Glory?. The song was written by the band's former guitarist and main songwriter, Noel Gallagher. The song became the band's second single to reach #1 in the UK Singles Chart. It also went platinum. \"Don't Look Back in Anger\" was also the first Oasis single to feature Noel on lead vocals instead of his brother, Liam Gallagher. ==Release== The single cover is showing respects to the incident where Ringo Starr briefly left The Beatles during the recording of The White Album. The B-side \"Step Out\" was originally intended for the (What's the Story) Morning Glory? album but was taken off after Stevie Wonder requested 10% of the royalties as the chorus like his hit \"Uptight (Everything's Alright)\". Henry Cosby and Sylvia Moy received credit for writing the song along with Noel. ==Reception== Don't Look Back in Anger was met with high critical praise and it became a commercial hit. * Billboard said \"Noel Gallagher reveals a deft sense of timing and craft that turn his improprieties into masterful pop gems.\"Flick, Larry (1996-06-15), \"Singles: Pop\". Billboard. 108 (24):74 * \"Don't Look Back in Anger\" is Oasis's sixth biggest Billboard hit in the US, reaching the number 10 spot on the US Modern Rock Chart for the week of June 22, 1996. Sexton, Paul (2005-08-27), \"OASIS\". Billboard. 117 (35):36 * It was the 10th biggest selling single of 1996 in the UK. * In a 2006 readers' poll conducted by Q magazine, \"Don't Look Back in Anger\" was chosen as the 20th best song of all time. * In May 2007, NME magazine placed \"Don't Look Back in Anger\" at number 14 in its list of the \"50 Greatest Indie Anthems Ever\". ==Track listing== All songs were written by Noel Gallagher except where noted. * UK CD and cassette single # \"Don't Look Back in Anger\" # \"Step Out\" (Gallagher, Wonder, Cosby, Moy) # \"Underneath the Sky\" # \"Cum On Feel the Noize\" (Holder, Lea) * UK 7-inch single :A. \"Don't Look Back in Anger\" :B. \"Step Out\" (Gallagher, Wonder, Cosby, Moy) * UK 12-inch single :A1. \"Don't Look Back in Anger\" :B1. \"Step Out\" (Gallagher, Wonder, Cosby, Moy) :B2. \"Underneath the Sky\" * US CD and cassette single # \"Don't Look Back in Anger\" # \"Cum On Feel the Noize\" (Holder, Lea) ==Personnel== Oasis * Noel Gallagher – lead vocals, lead and acoustic guitars, Mellotron, EBow * Paul \"Bonehead\" Arthurs – piano, rhythm guitar, Hammond organ * Paul \"Guigsy\" McGuigan – bass guitar * Alan White – drums, shaker, tambourine Additional personnel * Owen Morris – Kurzweil strings ==Charts== ===Weekly charts=== Chart (1996) Peak position Czech Republic (IFPI CR) 8 Denmark (IFPI) 8 Europe (Eurochart Hot 100) 8 Iceland (Íslenski Listinn Topp 40) 4 US Cash Box Top 100 33 Zimbabwe (ZIMA)* Zimbabwe. Kimberley, C. Zimbabwe: singles chart book. Harare: C. Kimberley, 2000 8 Chart (2013) Peak position ===Year-end charts=== Chart (1996) Position Canada Rock/Alternative (RPM) 39 Europe (Eurochart Hot 100) 54 Iceland (Íslenski Listinn Topp 40) 44 Sweden (Sverigetopplistan) 83 UK Singles (OCC) 11 US Modern Rock (Billboard) 58 ==Certifications== ==Release history== Region Date Format(s) Label(s) United Kingdom 19 February 1996 Creation Japan 22 February 1996 CD Epic United Kingdom 26 February 1996 12-inch vinyl Creation United States 23 July 1996 Contemporary hit radio Epic ==References== Category:Oasis (band) songs Category:1996 songs",
 "title": "Don't Look Back in Anger"
}