{
 "id": "258176",
 "text": "Thongchai \"Bird\" McIntyre, who was born as Albert Thongchai McIntyre on December 8, 1958, is a Thai pop singer and actor. He released his debut album in 1986. He is the most successful singer in Thailand, as he sold more than 20 million albums. He is also sometimes called the following names: * Bird Thongchai *Thongchai McIntyre () *Pe Bird (elder brother Bird) *or simply, Bird The Superstar No.1 of Thailand. ==Biography== Thongchai McIntyre, or \"Bird Thongchai\", is best known for his string (Thai pop) and luk thung music. He is also known for acting in numerous films, on the television, musicals, and in commercials. Thongchai McIntyre was born in Bangkok in 1958. His parents were James and Udom McIntyre. He lived in a family of musicians, and so, he enjoyed an upbringing in a musical environment. His father died when Bird was still a child.Bang pop! He started working in a bank as an officer. During that time, he had a chance to meet the famous Thai TV producer, \"Kai Varayuth\", who saw entertainment talent in Bird. Bird played his first TV series with Kai while still working in the bank. This task showed his talent. His most memorable roles were those of Captain Kobori from Koo Kam, which was a tragic love story between a Japanese soldier (played by Bird) and a local Thai girl during the World War II. In both, he starred in a television series, and he reprised his role in the 1996 film adaptation, Sunset at Chaophraya. He reached the top of his musical career in the early nineties. Some of Bird's best-known songs are Duay Rak Lae Pook Pan, Koo Gud, Sabai Sabai and Kob Jai Jing Jing. His popular singles released recently include luk thung singles Mah Tummai (with Jintara Poonlarp), Fan Ja (with Jintara and Jarin B. (Joey Boy), Nat Myria Benedetti and Katreeya English), Lao Su Kan Fang, and Yak Tham Kor Tob and Mai Kang Ying Pae from his album \"Volume One\". Westerners became aware of him in the mid nineties as he became the first Thai artist to receive an International MTV Award, be featured in the most high budget Thai film at the time, \"Sunset at Chaopraya\" (which reached international acclaim in Japan as well as the United States). He was featured on CNN and Variety magazine. An award winning documentary on his life entitled \"Crossing Borders\" directed by Phanjanit Garnploog can be seen at St. John's University in New York which includes rare interviews with the director. In 2010, Bird made his first international tour in Los Angeles and the 50th Anniversary of Lincoln Center in New York. It marks the first time in history a Thai pop artist has made an international tour. His Grammy label mates have previously only performed at local venues. In late 2007, he released another album entitled \"Simply Bird\", which features songs such as Chuay Rap Tee and Mee Tae Kid Tueng. ==Discography== Albums and Singles * Hard-Sai Sai-Lom Song-Rao (Beach, Wind, and two of us) (1986) * Sabai-Sabai (Relax-Relax) (1987) * Rub-Kwun-Wan-Mai (Blessing for a new day) (1987) * Sor-Kor-Sor (Greeting Card) (1988) * Thongchai 2501 (1988) * Boomerang (1990) * Boomerang Man (Live from Concert) * Prik-Kee-Noo (Bird Chilli) (1991) * Wan-Nee Tee Ror-Koy (TV drama Soundtrack) * Tor-Thong (Flag) (1994) * Tor-Thong Kab Tor-Ther Nan-Lae (Live form Concert) * Dream & Reality (Live from Concert) * Kon-nok-kab-Dok-Mai (Feather & Flowers) (1995) * Dream (Single) * Dream (1996) * Sunset at Chaophraya (Movie Soundtrack) (1996) * Bird Unreleased (1997) * Singing Bird (Live from Concert) (1997) * Niramitr (,TV drama Soundtrack) (1998) * Thongchai Service (1998) * Thongchai Service Special (1998) * Tu-Pleng Saman Prajam Barn (1999) * 100 Pleng Rak Mai Roo Job (100 everlasting love songs) (2000) * Bird Love Beat 1 & 2 (Apr 4, 2001) * Smile Club (Oct 2001) * Smile Club Remix (Mar 29, 2002) * Rab Khak (Nov 2002) * Fan Ja...Sanid Kun Leaw Ja (Mar 17, 2003) * Bird Sek (Jun 2004) with Sek Loso (Special Album with 20 Years G\"MM\" Grammy) * Volume 1 (Jul 2005) * Village (Sep 2006) * Bird Perd Floor [3 Disc Set/Individual available] [Ballroom Cha-Cha, Luktung, Disco] (Dec 2006) * Simply Bird (Nov 2007) * Singing Bird (2010) Compilations * Bird Dance Collection (Sep 2009) * Bird Love Collection (Sep 2009) ==Awards== *Best Singer from Siam-Kollakarn Contest (1983) *Best Singer from Mekala (1986) *Best Artist from The office of national young people or Sor Yor Chor (1987) *Popular song vote for Korb-Jai Jing Jing from Coke Music Award *Best Singer from See-Sun Award (1989) *Best Actor Koo-Kum (TV Lakorn) from Mekala (1990) *Best Actor Koo-Kum (TV Lakorn) from TV Golden (1990) *MTV Asian Viewer's Choice Award (1991) *Best Actor Wannee Tee Raw-Koy (TV Lakorn) from TV Golden (1993) *Best Actor Sunset At Chaopraya (Movie) from Prasurassavadee (1995) *Popular Actor Sunset At Chaopraya from Vote Award (1995) *Billboard Viewer's Choice Award first in Asia (1997) *Seesun Award : Best Song for Lao Su Kan Fang (2001) *Top Awards : The Best Singer (2001) *Channel V Music Video Awards : The Best Singer (2001) *Top Awards : The Best Singer (2002) *MTV Asia Awards : Favorite Artist Thailand (2004) *MTV Asia Awards : The Inspiration Award (2006) *Channel [V] Thailand Music Video Awards : Best Song (2006) *Virgin Hitz Awards 2006 : Achievement Awards (2006) ==References== == Other websites == *BIRDTHONGCHAI.COM *CLUBBIRD.COM *TORTHONG.COM *GMMGRAMMY.COM (record label) *GMEMBER.COM at Entertainment Online (Thai) Category:1958 births Category:Living people Category:Movie actors Thongchai McIntyre Category:Thai singers Category:Television actors Thongchai McIntyre",
 "title": "Thongchai McIntyre"
}