{
 "id": "258211",
 "text": "Nicole Yongju Jung (; Korean name: Jung Yong-Ju, ), better known mononymously as Nicole, was born on October 7, 1991. She is a Korean-American singer. Born and raised in Glendale, California but moved to South Korea to pursue her dreams. 카라, \"효리-아이비 언니 보며 포스 배워\" Known for being a member of girl group Kara formed by DSP Entertainment in 2007. ==Biography== Nicole was born on October 7, 1991, in Glendale, California. She moved to Korea with her mom. Her mother has a ramyeon restaurant called \"Red Kitchen\". 기특한 아이돌 스타들 \"돈모아 부모 가게 냈어\" She has played violin 4th through 8th grade. She was on a show called \"KAIST\" (portrayed a celebrity's life as a college student) which was renamed to \"Nicole The Entertainer's Introduction to Veterinary Science\" in Konkuk University since Nicole would not be attending KAIST. 니콜, 건국대 수의학과 합격…중간고사에 `눈물범벅` The first episode aired on November 12, 2009. She is also very popular with a lot of fans and is a member of Korea's K-POP \"KARA\" ==Career== ===Kara=== Kara debuted on March 29th 2007 with \"Break It\" on M! Countdown as a 4 member. Nicole was one of the four along with Gyuri, Seungyeon, and Sunghee. Kara was often compared to Fin.K.L because of their concept and the fact that they are both from the same company (DSP Entertainment). Later on Sunghee left the group in March 2008 due to parental pressure, just when Kara intended their comeback. Sunghee failed her college exams and left the group. On July 24th of 2008, Kara came back with two new members, Goo Hara and Jiyoung. Their new concept was \"cute\" and \"playful\". In December 4, 2008, Kara have their comeback starting on M! Countdown with \"Pretty Girl\".In February 2009, Kara released their second mini-album \"Honey\". \"Honey\" became the group's first #1 single when it topped the M! Countdown and The Music Trend. 카라 “소녀시대 게 섯거라” 데뷔 2년만에 TV 첫 1위 눈물 울먹울먹 . Joins.com. March 9, 2009. Retrieved March 9, 2009. In late July 2009, Kara revealed their second album named \"Revolution\". 걸그룹 대란속 ‘조용한’ 카라 뭐할까 “업그레이드 카라 온다” (What is \"silent\" Kara doing during the girl group uproar - \"An Upgraded Kara is coming.\"). Newsen. June 16, 2009. Retrieved July 20, 2009. June 16, 2009. Retrieved July 20, 2009. Due to the popularity of the song, Wanna and Mister, Kara's overall popularity increased. Kara currently started promotions with their third mini-album \"Lupin\". 카라, '루팡'-비상구 춤으로 컴백! Lupin was a succes, it won KBS Music Bank K-Chart on March 12th, March 19th, and March 26th of 2010. ===Solo activities=== Nicole joined Star Golden Bell on December 20, 2008, hosting a segment called \"Level With Me (Season 2)\" in which the guests have to guess a term or title from her clues; the challenge comes due to her comparative lack of skill and experience with the Korean language. The segment ended on October 17, 2009. `스타골든벨` 개편, `눈높이를 맞춰요` 니콜도 하차 In April 2009, she sang a duet with former Noel member Kang Kyun-seong called \"Happy and\". 군입대 앞둔 강균성, 니콜과 듀엣음반 발매 In August 2009, she and 2PM ex member Jaebeom became part of historical culture variety show Nodaji, replacing Choi Min Yong and Kim Tae Hyun. But the show was canceled due to low ratings on October 2009. In November 2009, She joined Nicole The Entertainer's Introduction to Veterinary Science. In July 2010, she joined Good Sunday - Yeongwunghogeol (영웅호걸). == Discography == ===Kara=== === Singles === *\"Kkeun\" - Sunha (Rap. Nicole) (2008) *\"Happy And\" - Kang Kyun-seong (Duet. Nicole) (2009) *\"Gorae\" - Park Myeong-su (Duet. Nicole) (2010) == Filmography == Broadcasts Informations Dates KBS 2TV Star Golden Bell 《Level With Me (Season 2)》 * December 20, 2008 - October 24, 2009 MBC Sunday Sunday Night 《Nodaji》 * August 30, 2009 - October 25, 2009 Mnet Nicole The Entertainer's Introduction to Veterinary Science * November 12, 2009 - January 28, 2010 SBS Good Sunday 《Yeongwunghogeol》 * July 18, 2010 - == Awards == == References == ==Other websites== *Kara Official website Category:21st-century American singer-songwriters Category:1991 births Category:K-pop singers Category:Kara (South Korean group) members Category:Living people Category:Musicians from Glendale, California",
 "title": "Nicole Jung"
}