{
 "id": "258451",
 "text": "These are the complete Grand Prix racing results for Renault F1 team. __FORCETOC__ == Complete Formula One results == === As a works (factory) team === (key) (results in bold indicate pole position) Jump to: 1980 2002 2010 Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points WCC Renault RS01 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW ESP MON BEL SWE FRA GBR GER AUT NED ITA USA CAN JPN 0 NC Jean-Pierre Jabouille Ret Ret Ret Ret DNQ Renault RS01 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW MON BEL ESP SWE FRA GBR GER AUT NED ITA USA CAN 3 12th Jean-Pierre Jabouille Ret Ret 10 NC 13 Ret Ret Ret Ret Ret Ret Ret 4 12 Renault RS01 * * * Renault RS10 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW ESP BEL MON FRA GBR GER AUT NED ITA CAN USA 26 6th Jean-Pierre Jabouille Ret 10 Ret Ret Ret NC 1 Ret Ret Ret Ret 14 Ret Ret René Arnoux Ret Ret Ret WD 9 Ret Ret 3 2 Ret 6 Ret Ret Ret 2 Renault RE20 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW BEL MON FRA GBR GER AUT NED ITA CAN USA 38 4th Jean-Pierre Jabouille Ret Ret Ret 10 Ret Ret Ret Ret Ret 1 Ret Ret Ret René Arnoux Ret 1 1 9 4 Ret 5 NC Ret 9 2 10 Ret 7 Renault RE20B * * * Renault RE30 Renault-Gordini EF1 1.5 L V6 T USW BRA ARG SMR BEL MON ESP FRA GBR GER AUT NED ITA CAN CPL 54 3rd Alain Prost Ret Ret 3 Ret Ret Ret Ret 1 Ret 2 Ret 1 1 Ret 2 René Arnoux 8 Ret 5 8 DNQ Ret 9 4 9 13 2 Ret Ret Ret Ret Renault RE30B Renault-Gordini EF1 1.5 L V6 T RSA BRA USW SMR BEL MON DET CAN NED GBR FRA GER AUT SUI ITA CPL 62 3rd Alain Prost 1 1 Ret Ret Ret 7 NC Ret Ret 6 2 Ret 8 2 Ret 4 René Arnoux 3 Ret Ret Ret Ret Ret 10 Ret Ret Ret 1 2 Ret 16 1 Ret Renault RE30C * * * Renault RE40 Renault-Gordini EF1 1.5 L V6 T BRA USW FRA SMR MON BEL DET CAN GBR GER AUT NED ITA EUR RSA 79 2nd Alain Prost 7 11 1 2 3 1 8 5 1 4 1 Ret Ret 2 Ret Eddie Cheever Ret Ret 3 Ret Ret 3 Ret 2 Ret Ret 4 Ret 3 10 6 Renault RE50 Renault-Gordini EF4 1.5 L V6 T BRA RSA BEL SMR FRA MON CAN DET DAL GBR GER AUT NED ITA EUR POR 34 5th Patrick Tambay 5 Ret 7 Ret 2 Ret Ret Ret 8 5 Ret 6 Ret Ret 7 Derek Warwick Ret 3 2 4 Ret Ret Ret Ret Ret 2 3 Ret Ret Ret 11 Ret Philippe Streiff Ret Renault RE60 * * * Renault RE60B Renault-Gordini EF4B 1.5 L V6 T * * * Renault EF15 1.5 L V6 T BRA POR SMR MON CAN DET FRA GBR GER AUT NED ITA BEL EUR RSA AUS 16 7th Patrick Tambay 5 3 3 Ret 7 Ret 6 Ret Ret 10 Ret 7 Ret 12 WD Ret Derek Warwick 10 7 10 5 Ret Ret 7 5 Ret Ret Ret Ret 6 Ret WD Ret François Hesnault Ret – Renault does not compete as a team. In 2000, Renault bought the Benetton team. For the season, the team ran under the Benntton name. In the season, the team became Renault. The 2001 results are listed under the As an engine supplier section. Renault R202 Renault RS22 3.0 L V10 AUS MAL BRA SMR ESP AUT MON CAN EUR GBR FRA GER HUN BEL ITA USA JPN 23 4th Jarno Trulli Ret Ret Ret 9 10 Ret 4 6 8 Ret Ret Ret 8 Ret 4 5 Ret Jenson Button Ret 4 4 5 12 7 Ret 15 5 12 6 Ret Ret Ret 5 8 6 Renault R23 * * * Renault R23B Renault RS23 3.0 L V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN ITA USA JPN 88 4th Jarno Trulli 5 5 8 13 Ret 8 6 Ret Ret Ret 6 3 7 Ret 4 5 Fernando Alonso 7 3 3 6 2 Ret 5 4 4 Ret Ret 4 1 8 Ret Ret Renault R24 Renault RS24 3.0 L V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN BEL ITA CHN JPN BRA 105 3rd Jarno Trulli 7 5 4 5 3 1 4 Ret 4 4 Ret 11 Ret 9 10 Jacques Villeneuve 11 10 10 Fernando Alonso 3 7 6 4 4 Ret 5 Ret Ret 2 10 3 3 Ret Ret 4 5 4 Renault R25 Renault RS25 3.0 L V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN CHN 191 1st Fernando Alonso 3 1 1 1 2 4 1 Ret DNS 1 2 1 11 2 2 2 3 3 1 Giancarlo Fisichella 1 Ret Ret Ret 5 12 6 Ret DNS 6 4 4 9 4 3 Ret 5 2 4 Renault R26 Renault RS26 2.4 L V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 206 1st Fernando Alonso 1 2 1 2 2 1 1 1 1 5 2 5 Ret 2 Ret 2 1 2 Giancarlo Fisichella Ret 1 5 8 6 3 6 3 4 3 6 6 Ret 6 4 3 3 6 Renault R27 Renault RS27 2.4 L V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 51 3rd Giancarlo Fisichella 5 6 8 9 4 DSQ 9 6 8 10 12 9 12 Ret 5 11 Ret Heikki Kovalainen 10 8 9 7 13 4 5 15 7 8 8 6 7 8 2 9 Ret Renault R28 Renault RS27 2.4 L V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 80 4th Fernando Alonso 4 8 10 Ret 6 10 Ret 8 6 11 4 Ret 4 4 1 1 4 2 Nelson Piquet, Jr. Ret 11 Ret Ret 15 Ret Ret 7 Ret 2 6 11 Ret 10 Ret 4 8 Ret Renault R29 Renault RS27 2.4 L V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU 26 8th Fernando Alonso 5 11 9 8 5 7 10 14 7 Ret 6 Ret 5 3 10 Ret 14 Nelson Piquet, Jr. Ret 13 16 10 12 Ret 16 12 13 12 Romain Grosjean 15 Ret 15 Ret 16 13 18 Renault R30 Renault RS27-2010 2.4 L V8 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 163 5th Robert Kubica 11 2 4 5 8 3 6 7 5 Ret 7 Ret 3 8 7 Ret 5 9 5 Vitaly Petrov Ret Ret Ret 7 11 13 15 17 14 13 10 5 9 13 11 Ret Ret 16 6 2011 Renault R31 Renault RS27-2011 2.4 L V8 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 66* 5th* Nick Heidfeld Vitaly Petrov Season in progress. === As an engine supplier === (key) (results in bold indicate pole position) Jump to: 1990 2001 2010 Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points WCC 1983 Lotus 93T * * * Lotus 94T Renault EF1 1.5 L V6 T BRA USW FRA SMR MON BEL DET CAN GBR GER AUT NED ITA EUR RSA 11‡ 8th‡ Nigel Mansell Ret 4 Ret 5 Ret 8 3 Ret Elio de Angelis DSQ Ret Ret Ret 9 Ret Ret Ret Ret Ret Ret 5 Ret Ret 1984 BRA RSA BEL SMR FRA MON CAN DET DAL GBR GER AUT NED ITA EUR POR Ligier JS23 Renault EF4 1.5 L V6 T François Hesnault Ret 10 Ret Ret DNS Ret Ret Ret Ret Ret 8 8 7 Ret 10 Ret 3 10th Andrea de Cesaris Ret 5 Ret 6 10 Ret Ret Ret Ret 10 7 Ret Ret Ret 7 12 Lotus 95T Renault EF4B 1.5 L V6 T Nigel Mansell Ret Ret Ret Ret 3 Ret 6 Ret 6 Ret 4 Ret 3 Ret Ret Ret 47 3rd Elio de Angelis 3 7 5 3 5 5 4 2 3 4 Ret Ret 4 Ret Ret 5 1985 BRA POR SMR MON CAN DET FRA GBR GER AUT NED ITA BEL EUR RSA AUS Ligier JS25 Renault EF4B 1.5 L V6 T Andrea de Cesaris Ret Ret Ret 4 14 10 Ret Ret Ret Ret Ret 23 6th Philippe Streiff 10 9 8 WD 3 Jacques Laffite 6 Ret Ret 6 8 12 Ret 3 3 Ret Ret Ret 11 Ret WD 2 Lotus 97T Renault EF15 1.5 L V6 T Ayrton Senna Ret 1 7 Ret 16 Ret Ret 10 Ret 2 3 3 1 2 Ret Ret 71 4th Elio de Angelis 3 4 1 3 5 5 5 NC Ret 5 5 6 Ret 5 Ret DSQ Tyrrell 014 Renault EF4B 1.5 L V6 T Martin Brundle 7 8 13 Ret 7 Ret 3 10th Stefan Bellof 8 7 Ret Ivan Capelli Ret 4 Philippe Streiff Ret 1986 BRA ESP SMR MON BEL CAN DET FRA GBR GER HUN AUT ITA POR MEX AUS Ligier JS27 Renault EF4B 1.5 L V6 T René Arnoux 4 Ret Ret 5 Ret 6 Ret 5 4 4 Ret 10 Ret 7 15 7 29 5th Jacques Laffite 3 Ret Ret 6 5 7 2 6 Ret Philippe Alliot Ret 9 Ret Ret Ret 6 8 Lotus 98T Renault EF15B 1.5 L V6 T Ayrton Senna 2 1 Ret 3 2 5 1 Ret Ret 2 2 Ret Ret 4 3 Ret 58 3rd Johnny Dumfries 9 Ret Ret DNQ Ret Ret 7 Ret 7 Ret 5 Ret Ret 9 Ret 6 Tyrrell 014 * * * Tyrrell 015 Renault EF4B 1.5 L V6 T Martin Brundle 5 Ret 8 Ret Ret 9 Ret 10 5 Ret 6 Ret 10 Ret 11 4 11 7th Philippe Streiff 7 Ret Ret 11 12 11 9 Ret 6 Ret 8 Ret 9 Ret Ret 5 1987 - 1988 Renault did not provide any Formula One engines. They spent 1987 developing their new V10 engine 1989 Williams FW12C * * * Williams FW13 Renault RS1 3.5 L V10 BRA SMR MON MEX USA CAN FRA GBR GER HUN BEL ITA POR ESP JPN AUS 77 2nd Thierry Boutsen Ret 4 10 Ret 6 1 Ret 10 Ret 3 4 3 Ret Ret 3 1 Riccardo Patrese 15 Ret 15 2 2 2 3 Ret 4 Ret Ret 4 Ret 5 2 3 1990 Williams FW13B Renault RS2 3.5 L V10 USA BRA SMR MON CAN MEX FRA GBR GER HUN BEL ITA POR ESP JPN AUS 57 4th Thierry Boutsen 3 5 Ret 4 Ret 5 Ret 2 6 1 Ret Ret Ret 4 5 5 Riccardo Patrese 15 13 1 Ret Ret 9 6 Ret 5 4 Ret 5 7 5 4 6 1991 Williams FW14 Renault RS3 3.5 L V10 USA BRA SMR MON CAN MEX FRA GBR GER HUN BEL ITA POR ESP JPN AUS 125 2nd Nigel Mansell Ret Ret Ret 2 6 2 1 1 1 2 Ret 1 DSQ 1 Ret 2 Riccardo Patrese Ret 2 Ret Ret 3 1 5 Ret 2 3 5 Ret 1 3 3 5 1992 RSA MEX BRA ESP SMR MON CAN FRA GBR GER HUN BEL ITA POR JPN AUS Ligier JS37 Renault RS3B 3.5 L V10 * * * Renault RS3C 3.5 L V10 Thierry Boutsen Ret 10 Ret Ret Ret 12 10 Ret 10 7 Ret Ret Ret 8 Ret 5 6 7th Érik Comas 7 9 Ret Ret 9 10 6 5 8 6 Ret Ret Ret Ret Ret Williams FW14B Renault RS3C 3.5 L V10 * * * Renault RS4 3.5 L V10 Nigel Mansell 1 1 1 1 1 2 Ret 1 1 1 2 2 Ret 1 Ret Ret 164 1st Riccardo Patrese 2 2 2 Ret 2 3 Ret 2 2 8 Ret 3 5 Ret 1 Ret 1993 RSA BRA EUR SMR ESP MON CAN FRA GBR GER HUN BEL ITA POR JPN AUS Ligier JS39 Renault RS5 3.5 L V10 Martin Brundle Ret Ret Ret 3 Ret 6 5 5 14 8 5 7 Ret 6 9 6 23 5th Mark Blundell 3 5 Ret Ret 7 Ret Ret Ret 7 3 7 11 Ret Ret 7 9 Williams FW15C Renault RS5 3.5 L V10 Damon Hill Ret 2 2 Ret Ret 2 3 2 Ret 15 1 1 1 3 4 3 168 1st Alain Prost 1 Ret 3 1 1 4 1 1 1 1 12 3 12 2 2 2 1994 BRA PAC SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR EUR JPN AUS Ligier JS39B Renault RS6 3.5 L V10 Éric Bernard Ret 10 12 Ret 8 13 Ret 13 3 10 10 7 10 13 6th Johnny Herbert 8 Franck Lagorce Ret 11 Olivier Panis 11 9 11 9 7 12 Ret 12 2 6 7 10 DSQ 9 11 5 Williams FW16 * * * Williams FW16B Renault RS6 3.5 L V10 Damon Hill 2 Ret 6 Ret 1 2 2 1 8 2 1 1 1 2 1 Ret 118 1st Ayrton Senna Ret Ret Ret David Coulthard Ret 5 5 Ret Ret 4 6 2 Nigel Mansell Ret Ret 4 1 1995 BRA ARG SMR ESP MON CAN FRA GBR GER HUN BEL ITA POR EUR PAC JPN AUS Benetton B195 Renault RS7 3.0 L V10 Michael Schumacher 1 3 ret 1 1 5 1 Ret 1 11 1 Ret 2 1 1 1 Ret 137 1st Johnny Herbert Ret 4 7 2 4 Ret Ret 1 4 4 7 1 7 5 6 3 Ret Williams FW17 * * * Williams FW17B Renault RS7 3.0 L V10 Damon Hill Ret 1 1 4 2 Ret 2 Ret Ret 1 2 Ret 3 Ret 3 Ret 1 118 2nd David Coulthard 2 Ret 4 Ret Ret Ret 3 3 2 2 Ret Ret 1 3 2 Ret Ret 1996 AUS BRA ARG EUR SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR JPN Benetton B196 Renault RS8 3.0 L V10| Jean Alesi Ret 2 3 Ret 6 Ret 2 3 3 Ret 2 3 4 2 4 Ret 68 3rd Gerhard Berger 4 Ret Ret 9 3 Ret Ret Ret 4 2 13 Ret 6 Ret 6 4 Williams FW18 Renault RS8 3.0 L V10 Damon Hill 1 1 1 4 1 Ret Ret 1 1 Ret 1 2 5 Ret 2 1 175 1st Jacques Villeneuve 2 Ret 2 1 11 Ret 3 2 2 1 3 1 2 7 1 Ret 1997 AUS BRA ARG SMR MON ESP CAN FRA GBR GER HUN BEL ITA AUT LUX JPN EUR Benetton B197 Renault RS9 3.0 L V10 Jean Alesi Ret 6 7 5 Ret 3 2 5 2 6 11 8 2 Ret 2 5 13 67 3rd Gerhard Berger 4 2 6 Ret 9 10 1 8 6 7 10 4 8 4 Alexander Wurz Ret Ret 3 Williams FW19 Renault RS9 3.0 L V10 Jacques Villeneuve Ret 1 1 Ret Ret 1 Ret 4 1 Ret 1 5 5 1 1 DSQ 3 123 1st Heinz-Harald Frentzen 8 9 Ret 1 Ret 8 4 2 Ret Ret Ret 3 3 3 3 2 6 2001 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN Benetton B201 Renault RS21 3.0 L V10 Giancarlo Fisichella 13 Ret 6 Ret 14 Ret Ret Ret 11 11 13 4 Ret 3 10 8 17 10 7th Jenson Button 14 11 10 12 15 Ret 7 Ret 13 16 15 5 Ret Ret Ret 9 7 2007 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA Red Bull RB3 Renault RS27 2.4 L V8 David Coulthard Ret Ret Ret 5 14 Ret Ret 13 11 5 11 10 Ret Ret 4 8 9 24 5th Mark Webber 13 10 Ret Ret Ret 9 7 12 Ret 3 9 Ret 9 7 Ret 10 Ret 2008 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA Red Bull RB4 Renault RS27 2.4 L V8 David Coulthard Ret 9 18 12 9 Ret 3 9 Ret 13 14 17 11 16 7 Ret 10 Ret 29 7th Mark Webber Ret 7 7 5 7 4 12 6 10 Ret 9 12 8 8 Ret 8 14 9 2009 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA SIN JPN BRA ABU Red Bull RB5 Renault RS27 2.4 L V8 Mark Webber 12 6† 2 11 3 5 2 2 1 3 9 9 Ret Ret 17 1 2 153.5 2nd Sebastian Vettel 13 15 1 2 4 Ret 3 1 2 Ret Ret 3 8 4 1 4 1 2010 BHR AUS MAL CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU Red Bull RB6 Renault RS27-2010 2.4 L V8 Sebastian Vettel 4 Ret 1 6 3 2 Ret 4 1 7 3 3 15 4 2 1 Ret 1 1 498 1st Mark Webber 8 9 2 8 1 1 3 5 Ret 1 6 1 2 6 3 2 Ret 2 8 2011 AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA Red Bull RB7 Renault RS27-2011 2.4 L V8 Sebastian Vettel 383* 1st* Mark Webber Team Lotus T128 Renault RS27-2011 2.4 L V8 Heikki Kovalainen 0* 9th* Jarno Trulli Karun Chandhok Season in progress. Point totals and position standings include finishes with non-Renault engines. === Other engines based on the Renault engine === Mecachrome was an engineering company. Starting in 1983 they helped Renault build the turbocharged engines supplied to other race teams. Starting in 1992 they help Renault build the V10 engines to supply the Ligier team. This changed to Benetton and Williams in 1995. After 1997, Renault sold its engine to Mecachrome. Mecachrome signed a contract in May 1998 with Super Performance Competition Engineering. They would supply engines and call them Supertec engines. (key) (results in bold indicate pole position) Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Points WCC 1998 AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN Benetton B198 Playlife GC37-01 3.0 L V10 Giancarlo Fisichella Ret 6 7 Ret Ret 2 2 9 5 Ret 7 8 Ret 8 6 8 33 5th Alexander Wurz 7 4 4 Ret 4 Ret 4 5 4 9 11 Ret Ret Ret 7 9 Williams FW20 Mecachrome GC37-01 3.0 L V10 Jacques Villeneuve 5 7 Ret 4 6 5 10 4 7 6 3 3 Ret Ret 8 6 38 3rd Heinz-Harald Frentzen 3 5 9 5 8 Ret Ret 15 Ret Ret 9 5 4 7 5 5 1999 AUS BRA SMR MON ESP CAN FRA GBR AUT GER HUN BEL ITA EUR MAL JPN BAR 01 Supertec FB01 3.0 L V10 Jacques Villeneuve Ret Ret Ret Ret Ret Ret Ret Ret Ret Ret Ret 15 8 10 Ret 9 0 NC Ricardo Zonta Ret DNQ Ret 9 Ret 15 Ret 13 Ret Ret 8 Ret 12 Mika Salo 7 Ret 8 Benetton B199 Playlife FB01 3.0 L V10 Giancarlo Fisichella 4 Ret 5 5 9 2 Ret 7 12 Ret Ret 11 Ret Ret 11 14 16 6th Alexander Wurz Ret 7 Ret 6 10 Ret Ret 10 5 7 7 14 Ret Ret 8 10 Williams FW21 Supertec FB01 3.0 L V10 Ralf Schumacher 3 4 Ret Ret 5 4 4 3 Ret 4 9 5 2 4 Ret 5 35 5th Alex Zanardi Ret Ret 11 8 Ret Ret Ret 11 Ret Ret Ret 8 7 Ret 10 Ret 2000 AUS BRA SMR GBR ESP EUR MON CAN FRA AUT GER HUN BEL ITA USA JPN MAL Arrows A21 Supertec FB02 3.0 L V10 Pedro de la Rosa Ret 8 Ret Ret Ret 6 DNS Ret Ret Ret 6 16 16 Ret Ret 12 Ret 7 7th Jos Verstappen Ret 7 14 Ret Ret Ret Ret 5 Ret Ret Ret 13 15 4 Ret Ret 10 Benetton B200 Playlife FB02 3.0 L V10 Giancarlo Fisichella 5 2 11 7 9 5 3 3 9 Ret Ret Ret Ret 11 Ret 14 9 20 4th Alexander Wurz 7 Ret 9 9 10 12 Ret 9 Ret 10 Ret 11 13 5 10 Ret 7 Half points awarded as less than 75% of race distance was completed. == References == Category:Formula One constructor results Category:Formula One current",
 "title": "Renault Grand Prix results"
}