{
 "id": "258488",
 "text": "Terror birds, the family Phorusrhacidae, were large carnivorous flightless birds. They were the dominant predators in South America during the Cainozoic, from 53–0.1 million years ago. They were roughly 1–3 meters (3–10 feet) tall. Titanis walleri, one of the larger species, is known from Texas and Florida in North America. This makes the phorusrhacids the only known example of large South American predators migrating north during the Great American Interchange. This took place after the volcanic Isthmus of Panama land bridge rose about three million years ago.Baskin J.A. 1995. The giant flightless bird Titanis walleri (Aves: Phorusrhacidae) from the Pleistocene coastal plain of South Texas. Journal of Vertebrate Paleontology, 15: 842-844. A recently discovered species is Kelenken guillermoi from the middle of the Miocene some 15 million years ago. It was found in Patagonia in 2006. It had the largest bird skull yet found. The fossil has been described as having a nearly intact skull. The beak is roughly long and curves in a hook shape that resembles an eagle's beak. Most species described as phorusrhacid were smaller, tall, but the new fossil belongs to a bird that probably stood about tall. The large terror birds were nimble and quick runners able to reach speeds of .Anitei, Stefan, \"The largest Terror Bird: it had the largest bird skull\" Simulations of a terror bird strike produced by the Discovery ChannelAbout Mega Beasts Terror Bird using a pneumatic model showed the larger species could easily crush the skull of its prey and puncture through bone with its beak. They had a fearsome weapon, a beak which could be driven into prey with the force of a sledgehammer. They could run at speed over long distances. The Phorusrhacids are colloquially known as \"terror birds\". The larger species were apex predators during the Miocene. Well-known genera: *Brontornis *Phorusrhacos *Titanis == References == Category:Fossils Category:Flightless birds",
 "title": "Terror birds"
}