{
 "id": "258579",
 "text": "Helen Beatrix Potter (28 July 1866 – 22 December 1943) was an English writer, illustrator, mycologist and conservationist. She was perhaps most historically famous and also perhaps best notable and most prominently remembered for having written and published several classic children's storybooks which are based on the narrative tales of several of her classic and most beloved animal characters such as The Tale of Peter Rabbit. Potter was born on 28 July 1866 in England and she was then raised in Kensington, London during the early childhood stages of her life. Her family became extremely wealthy just shortly after her father Rupert William Potter, who also had great multi-artistic talents and was an adept amateur photographer, had wisely invested a large part of their family income and hard-earned savings in the stock exchange market during the early 1890's. She was also surrounded as well as highly intellectually educated by many governesses throughout her adolescent and teenage years. Although, she did not have as many friends during her lifetime and longtime writing career, she was surrounded by beautiful mother nature and many loving pets. Including Benjamin and Peter, 2 favorite pet rabbits, the latter of which would be her prominent basis and much favorable namesake for her very first and most beloved storybook character. She spent most of her happy holidays in Scotland and the Lake District. There, she eventually began to learn to love nature, plants and animals, by which she had also carefully sketched, artistically illustrated and creatively painted. By the time she reached the age of 30, Potter had written and officially published her first original and classic children's storybook entitled The Tale of Peter Rabbit. It is a very widely popular classic children's story and had a universal appeal to people of all ages. At one point in time she became romantically engaged to her then-publisher Norman Warne. Both of her parents unfortunately disapproved of this and thus so became very angry with her as they disputed over the love affair and thereby tumultuosly separated with her because of this as they really did not want her to marry someone who was socially lower than her. However, Warne had unexpectedly died just before he and Potter could even officially marry each other. Eventually, both of Potter's parents had then forgiven her and eventually happily reconciled with her. Potter eventually moved on with her life without Norman Warne. Fortunately, she did not have to depend on her parents anymore for help and financial support because she already had enough self-earned money from her children's storybooks. In time, she bought out Hill Top Farm and purchased some more huge tracks of land. Much later in her 40's, she then married William Heelis, a local solicitor. She also began raising sheep and became a farmer, though she still continued on with her writing. She has written and published over 23 classic children's storybooks to date. Potter eventually married William Heelis in 1913 and their marriage had lasted for about 30 years until the time of her death in 1943. The couple never had any children. She suffered from a congenital heart problem and died of a cardiovascular heart disease and pneumonia in Near Sawrey, Lancashire at the age of 77 on 22 December 1943. Her whole life-savings out of her self-earned money plus her family inheritance, even from her younger brother Walter Bertham Potter was left in its entirety to the National Trust. Her popular classic children's storybooks continued to sell out around the world, and published in many different languages. Her then-widower, Heelis died shortly after her passing in August of 1945. == Bibliography == * * == Other websites == * * * Immersive Books Beatrix Potter Category:1866 births Category:1943 deaths Beatrix Potter Category:British illustrators Category:British children's writers Category:Writers from London Category:Deaths from pneumonia Category:Deaths from cardiovascular disease Category:Infectious disease deaths in England",
 "title": "Beatrix Potter"
}