{
 "id": "258674",
 "text": "Montserrat Caballé (12 April 1933 - 6 October 2018) was a Spanish (Catalan) operatic soprano. She was one of the greatest opera singers of the 20th century. She possessed a voice of remarkable beauty and considerable power, range and agility enabling her to sing a wide variety of roles. After her sensational success as Donizetti's Lucrezia Borgia, she was particularly associated with the bel canto repertoire in which she was considered one of the finest modern exponents. ==Life and career== Caballé was born in Barcelona, Spain. She studied at the Music Conservatory there and graduated in 1954 with a gold medal. She began her professional career in Basel in 1956 as Mimi in La bohème. She then joined the Bremen Opera. She sang from 1959 to 1962 in a wide variety of roles. International recognition came in 1965, when she appeared in a concert performance of Donizetti's Lucrezia Borgia at Carnegie Hall in New York City as a replacement for an indisposed Marilyn Horne. The performance won her great acclaim from the public and critics alike, and it made her an overnight sensation. Her success led to her first performance at the Metropolitan Opera that same year as Marguerite in Gounod's Faust. She was later invited to sing at most of the major opera houses and festivals of the world. She was especially admired in works by composers such as Rossini, Donizetti, Bellini and Verdi. She revived a number of long- neglected works by these composers. In 1987, she duetted with Queen frontman Freddie Mercury for the hit single Barcelona. That single became a hit again in 1992 during the Olympics that were being held there. From 1964 until her death, she was married to tenor Bernabé Martí. They had two children. Caballé died on 6 October 2018 at the age of 85 from a gallbladder infection in Barcelona. ==Notes== ==Sources== * The Complete Dictionary of Opera & Operetta, James Anderson, Wings Books, 1993. * Le Guide de l'Opéra, Roland Mancini & Jean-Jacques Rouveroux, Fayard, 1986. Category:1933 births Category:2018 deaths Category:Infectious disease deaths in Spain Category:Musicians from Barcelona Category:Spanish opera singers Category:Order of Merit of the Federal Republic of Germany Category:Sopranos Category:Spanish singers",
 "title": "Montserrat Caballé"
}