{
 "id": "258658",
 "text": "Time Flies... 1994–2009 is a compilation album released by the rock band Oasis. The album contains all 27 UK singles released by the band between 1994 and 2009. The record features the songs \"Whatever\" and \"Lord Don't Slow Me Down\" which had previously never appeared on an Oasis album. \"Sunday Morning Call\" is not listed anywhere on the artwork but appears as a hidden track on Disc 2, track 13. The reason for this is not known. Five different versions of the album were released. They are the 2CD version, DVD, the Deluxe Box Set, 5LP Box Set and the iTunes Deluxe Edition. In Japan it entered the charts at number 2 with sales of 59,348 copies. The album entered the charts at number 1 in the UK with the second highest first week sales in 2010 to date with 101,297. A boxset featuring postcards of the sleeves of every UK Oasis single was released concurrently with the album. ==Track listing== ===Disc 1 and 2=== * \"Champagne Supernova\" is listed first track on Disc 2 of United States version. The US version does not contain \"Sunday Morning Call\" as a hidden track due to time limitations. === Disc 3: DVD=== The DVD includes all the music videos from \"Supersonic\" to \"Falling Down\", and in addition, previous unreleased live video versions of \"Gas Panic!\", and \"Little by Little\". Also includes commentary on music videos by Oasis members. Two iTunes Live Festival videos of \"Half the World Away\" and \"Slide Away\" are only available with the iTunes Deluxe Edition. ===Disc 4: iTunes Live: London Festival=== All tracks recorded live at the London Roundhouse from the iTunes Festival 2009. Tracks 1, 7, 12 and 20 are only available with the iTunes Deluxe Edition. * = released as part of the iTunes Festival 2009 EP. ==Release history== Date Region June 9, 2010 Japan June 11, 2010 Europe June 14, 2010 United Kingdom June 15, 2010 United States July 21, 2010 Brazil ==Charts== Charts (2010) Peak position Australian Albums Chart 65 Austrian Albums Chart 22 Belgian Albums Chart 11 Dutch Albums Chart 44 Finnish Albums Chart 45 German Albums Chart 21 Greek Albums Chart 1 Irish Albums Chart 3 Italian Albums Chart 7 Japanese Albums Chart 2 Mexican Albums Chart 66 New Zealand Albums Chart 13 Spanish Albums Chart 20 Scottish Albums Chart 1 South Korea Albums Chart 1 Swiss Albums Chart 20 UK Albums Chart 1 US Billboard 200 131 ==References== * * * *official oasis recordstore webstore,8 June 2010 *http://itunes.apple.com/gb/preorder/time-flies-1994-2009-deluxe/id374345103 Category:Oasis (band) albums Category:2010 albums",
 "title": "Time Flies... 1994–2009"
}