{
 "id": "25878",
 "text": "Bertrand Arthur William Russell, 3rd Earl Russell (18 May 1872 – 2 February 1970) was a British philosopher, logician, and mathematician. He was born in Wales, but spent most of his life in England. He worked mostly in the 20th century. He won the Nobel Prize in Literature in 1950. Bertrand Russell wrote many books and articles. He also tried to make philosophy popular. He gave his opinion on many topics. He wrote the essay, \"On Denoting\", which has been described as one of the most influential essays in philosophy in the 20th Century. He wrote on very serious issues as well as everyday things. He was a well known liberal as well as a socialist and anti-war activist for most of his long life. Millions looked up to Russell as a prophet of the creative and rational life. At the same time, his stances on many topics were extremely controversial. From 1931 until his death, he was a member of the House of Lords. ==Personal life== Born at the height of Britain's economic and political ascendancy, he died of influenza nearly a century later when the British Empire had all but vanished, its power dissipated in two victorious, but debilitating world wars. Russell's voice carried enormous moral authority, even into his early 90s. Russell supported nuclear disarmament a lot, but did not support the American war in Vietnam even when it was popular. In 1950, Russell was made a Nobel Laureate in Literature \"in recognition of his varied and significant writings in which he champions humanitarian ideals and freedom of thought.\" ==Beliefs== In his 1949 speech, \"Am I an Atheist or an Agnostic?\", Russell expressed his difficulty over whether to call himself an atheist or an agnostic: In Russel's book The Impact of Science on Society he wrote: == What people said about Russell == === As a man === :\"Bertrand Russell would not have wished to be called a saint of any description; but he was a great and good man.\" :: — A.J. Ayer, Bertrand Russell, NY: Viking Press, 1972. === As a philosopher === :\"It is difficult to overstate the extent to which Russell's thought dominated twentieth century analytic philosophy: virtually every strand in its development either originated with him or was transformed by being transmitted through him. Analytic philosophy itself owes its existence more to Russell than to any other philosopher.\" :: — Nicholas Griffin, The Cambridge Companion to Bertrand Russell, Cambridge: Cambridge University Press, 2003. === As a writer and his place in history === :\"Russell's prose has been compared by T.S. Eliot to that of David Hume's. I would rank it higher, for it had more color, juice, and humor. But to be lucid, exciting and profound in the main body of one's work is a combination of virtues given to few philosophers. Bertrand Russell has achieved immortality by his philosophical writings.\" :: — Sidney Hook, Out of Step, An Unquiet Life in the 20th Century, NY: Carol & Graff, 1988. :\"Russell's books should be bound in two colours, those dealing with mathematical logic in red — and all students of philosophy should read them; those dealing with ethics and politics in blue — and no one should be allowed to read them.\" :: — Ludwig Wittgenstein quoted in Rush Rhees, Recollections of Wittgenstein, Oxford Paperbacks, 1984. === As a mathematician and logician === :Of the Principia: \"...its enduring value was simply a deeper understanding of the central concepts of mathematics and their basic laws and interrelationships. Their total translatability into just elementary logic and a simple familiar two- place predicate, membership, is of itself a philosophical sensation.\" :: — W.V. Quine, From Stimulus to Science, Cambridge: Harvard University Press, 1995. === As an activist === :\"Oh, Bertrand Russell! Oh, Hewlett Johnson! Where, oh where, was your flaming conscience at that time?\" :: — Alexandr I. Solzhenitsyn, The Gulag Archipelago, Harper & Row, 1974. === As a recipient of the Nobel Prize for Literature === :In other words, it was specifically not for his incontestably great contributions to philosophy — The Principles of Mathematics, 'On Denoting' and Principia Mathematica — that he was being honoured, but for the later work that his fellow philosophers were unanimous in regarding as inferior. :: — Ray Monk, Bertrand Russell, The Ghost of Madness, p. 332. === From a daughter === :\"He was the most fascinating man I have ever known, the only man I ever loved, the greatest man I shall ever meet, the wittiest, the gayest, the most charming. It was a privilege to know him, and I thank God he was my father.\" :: — Katharine Tait, My Father Bertrand Russell, NY: Harcourt Brace Jovanovich, 1975, p. 202. == Quotations == * \"War does not determine who is right. Only who is left.\" (Often attributed to Russell, but no sources exist.)Montreal Star (found in February 1932 Reader’s Digest “The Reader’s Digest”) * \"The secret of happiness is to face the fact that the world is horrible, horrible, horrible.\" (Source: Alan Wood, Bertrand Russell, the Passionate Sceptic, 1957) * \"The whole problem with the world is that fools and fanatics are always so certain of themselves, but wiser people so full of doubts.\" (Source?) * \"You could tell by his [Aldous Huxley] conversation which volume of the Encyclopaedia Britannica he'd been reading. One day it would be Alps, Andes and Apennines, and the next it would be the Himalayas and the Hippocratic Oath.\" (Source: Parris, M., Scorn: With Added Vitriol, London: Penguin, 1996, quoting Russell's 1963 letter to Ronald W. Clark) * \"A Tale of Two Moralities\" \"I dislike Nietzsche,\" Russell wrote, \"because he likes the contemplation of pain, because he erects conceit into a duty, because the men whom he most admires are conquerors, whose glory is cleverness in causing men to die.\" (Source: History of Western Philosophy, chap. on Nietzsche, last par.) == Further reading == === Selected bibliography of Russell's books === This is a selected bibliography of Russell's books in English sorted by year of first publication. * 1896, German Social Democracy, London: Longmans, Green. * 1897, An Essay on the Foundations of Geometry, Cambridge: At the University Press. * 1900, A Critical Exposition of the Philosophy of Leibniz, Cambridge: At the University Press. * 1903, The Principles of Mathematics, Cambridge: At the University Press. * 1910, Philosophical Essays, London: Longmans, Green. * 1910 – 1913, Principia Mathematica (with Alfred North Whitehead), 3 vols., Cambridge: At the University Press. * 1912, The Problems of Philosophy, London: Williams and Norgate. * 1914, Our Knowledge of the External World as a Field for Scientific Method in Philosophy, Chicago and London: Open Court Publishing. * 1916, Principles of Social Reconstruction, London: George Allen & Unwin. * 1916, Justice in War-time, Chicago: Open Court. * 1917, Political Ideals, New York: The Century Co. * 1918, Mysticism and Logic and Other Essays, London: Longmans, Green. * 1918, Roads to Freedom: Socialism, Anarchism, and Syndicalism, London: George Allen & Unwin. * 1919, Introduction to Mathematical Philosophy, London: George Allen & Unwin. * 1920, The Practice and Theory of Bolshevism, London: George Allen & Unwin * 1921, The Analysis of Mind, London: George Allen & Unwin. * 1922, The Problem of China, London: George Allen & Unwin. * 1923, The Prospects of Industrial Civilization (in collaboration with Dora Russell), London: George Allen & Unwin. * 1923, The ABC of Atoms, London: Kegan Paul, Trench, Trubner. * 1924, Icarus, or the Future of Science, London: Kegan Paul, Trench, Trubner. * 1925, The ABC of Relativity, London: Kegan Paul, Trench, Trubner. * 1925, What I Believe, London: Kegan Paul, Trench, Trubner. * 1926, On Education, Especially in Early Childhood, London: George Allen & Unwin. * 1927, The Analysis of Matter, London: Kegan Paul, Trench, Trubner. * 1927, An Outline of Philosophy, London: George Allen & Unwin. * 1927, Why I Am Not a Christian, London: Watts. * 1927, Selected Papers of Bertrand Russell, New York: Modern Library. * 1928, Sceptical Essays, London: George Allen & Unwin. * 1929, Marriage and Morals, London: George Allen & Unwin. * 1930, The Conquest of Happiness, London: George Allen & Unwin. * 1931, The Scientific Outlook, London: George Allen & Unwin. * 1932, Education and the Social Order, London: George Allen & Unwin. * 1934, Freedom and Organization, 1814 – 1914, London: George Allen & Unwin. * 1935, In Praise of Idleness, London: George Allen & Unwin. * 1935, Religion and Science, London: Thornton Butterworth. * 1936, Which Way to Peace?, London: Jonathan Cape. * 1937, The Amberley Papers: The Letters and Diaries of Lord and Lady Amberley (with Patricia Russell), 2 vols., London: Leonard & Virginia Woolf at the Hogarth Press. * 1938, Power: A New Social Analysis, London: George Allen & Unwin. * 1940, An Inquiry into Meaning and Truth, New York: W. W. Norton & Company. * 1945, A History of Western Philosophy, New York: Simon and Schuster. * 1948, Human Knowledge: Its Scope and Limits, London: George Allen & Unwin. * 1949, Authority and the Individual, London: George Allen & Unwin. * 1950, Unpopular Essays, London: George Allen & Unwin. * 1951, New Hopes for a Changing World, London: George Allen & Unwin. * 1952, The Impact of Science on Society, London: George Allen & Unwin. * 1953, Satan in the Suburbs and Other Stories, London: George Allen & Unwin. * 1954, Human Society in Ethics and Politics, London: George Allen & Unwin. * 1954, Nightmares of Eminent Persons and Other Stories, London: George Allen & Unwin. * 1956, Portraits from Memory and Other Essays, London: George Allen & Unwin. * 1956, Logic and Knowledge: Essays 1901 – 1950 (edited by Robert C. Marsh), London: George Allen & Unwin. * 1957, Why I Am Not A Christian and Other Essays on Religion and Related Subjects (edited by Paul Edwards), London: George Allen & Unwin. * 1958, Understanding History and Other Essays, New York: Philosophical Library. * 1959, Common Sense and Nuclear Warfare, London: George Allen & Unwin. * 1959, My Philosophical Development, London: George Allen & Unwin. * 1959, Wisdom of the West (\"editor\", Paul Foulkes), London: Macdonald. * 1960, Bertrand Russell Speaks His Mind, Cleveland and New York: World Publishing Company. * 1961, The Basic Writings of Bertrand Russell (edited by R.E. Egner and L.E. Denonn), London: George Allen & Unwin. * 1961, Fact and Fiction, London: George Allen & Unwin. * 1961, Has Man a Future?, London: George Allen & Unwin. * 1963, Essays in Skepticism, New York: Philosophical Library. * 1963, Unarmed Victory, London: George Allen & Unwin. * 1965, On the Philosophy of Science (edited by Charles A. Fritz, Jr.), Indianapolis: The Bobbs-Merrill Company. * 1967, Russell's Peace Appeals (edited by Tsutomu Makino and Kazuteru Hitaka), Japan: Eichosha's New Current Books. * 1967, War Crimes in Vietnam, London: George Allen & Unwin. * 1967 – 1969, The Autobiography of Bertrand Russell, 3 vols., London: George Allen & Unwin. * 1969, Dear Bertrand Russell... A Selection of his Correspondence with the General Public 1950 – 1968 (edited by Barry Feinberg and Ronald Kasrils), London: George Allen and Unwin. Note: This is a mere sampling, for Russell also authored many pamphlets, introductions, articles and letters to the editor. His works also can be found in any number of anthologies and collections, perhaps most notably, The Collected Papers of Bertrand Russell, which McMaster University began publishing in 1983. This collection of his shorter and previously unpublished works is now up to 16 volumes, and many more are forthcoming. An additional 3 volumes catalogue just his bibliography. The Russell Archives at McMaster also have more than 30,000 letters that he wrote. Additional references: A. Russell * 1900, Sur la logique des relations avec des applications à la théorie des séries, Rivista di matematica 7: 115-148. * 1901, On the Notion of Order, Mind (n.s.) 10: 35-51. * 1902, (with Alfred North Whitehead), On Cardinal Numbers, American Journal of Mathematics 23: 367-384. B. Secondary references: * John Newsome Crossley. A Note on Cantor's Theorem and Russell's Paradox, Australian Journal of Philosophy 51: 70-71. * Ivor Grattan-Guinness, 2000. The Search for Mathematical Roots 1870-1940. Princeton University Press. === Books about Russell's philosophy === * Bertrand Russell: Critical Assessments, edited by A. D. Irvine, 4 volumes, London: Routledge, 1999. Consists of essays on Russell's work by many distinguished philosophers. * Bertrand Russell, by John Slater, Bristol: Thoemmes Press, 1994. * The Philosophy of Bertrand Russell, edited by P.A. Schilpp, Evanston and Chicago: Northwestern University, 1944. * Russell, by A. J. Ayer, London: Fontana, 1972. . A lucid summary exposition of Russell's thought. === Biographical books === * Bertrand Russell: 1872 – 1920 The Spirit of Solitude by Ray Monk (1997) * Bertrand Russell: 1921 – 1970 The Ghost of Madness by Ray Monk (2001) * Bertrand Russell: Philosopher and Humanist, by John Lewis (1968) * Bertrand Russell, by A.J. Ayer (1972), reprint ed. 1988: * The Life of Bertrand Russell, by Ronald W. Clark (1975) * Bertrand Russell and His World, by Ronald W. Clark (1981) == Related pages == * Russell's teapot ==References== == Other websites == === Writings available online === * Mysticism * \"Contents Recommended\" * \"A Free Man's Worship\" (1903) * Am I an Atheist or an Agnostic? * Icarus: The Future of Science * Has Religion Made Useful Contributions to Civilization? * Ideas that Have Harmed Mankind * In Praise of Idleness (1932) * Nobel Lecture (1950) * Political Ideals * The Problem of China * The Problems of Philosophy * Proposed Roads to Freedom (1918) * \"16 Questions on the Assassination\" (of President Kennedy) * The Analysis Of Mind * What is an Agnostic? * Why I am not a Christian * \"The Elements of Ethics\" (1910) * The Principles of Mathematics (1903) * === Other === * Pembroke Lodge - childhood home and museum * The Bertrand Russell Society - a member organisation of the International Humanist and Ethical Union * The Bertrand Russell Society Quarterly * The Bertrand Russell Peace Foundation * Biography and quotes of Bertrand Russell * Russell Photo Gallery * Stanford Encyclopedia of Philosophy entry * The Bertrand Russell Archives * Resource list * The First Reith Lecture given by Russell (Real Audio) * Encyclopaedia Britannica * Bertrand Russel -Citizendium Category:1872 births Category:1970 deaths Category:20th-century British philosophers Category:Academics of the University of Cambridge Category:Agnostics Category:Alumni of the University of Cambridge Category:British atheists Category:British autobiographers Category:British mathematicians Category:British Nobel Prize winners Category:Democratic socialists Category:Labour Party (UK) people Category:British LGBT rights activists Category:Members of the House of Lords Category:Nonviolence advocates Category:Order of Merit Category:United Kingdom Earls Category:Welsh politicians Category:Welsh writers Category:Set theorists",
 "title": "Bertrand Russell"
}