{
 "id": "258754",
 "text": "A car battery or automotive battery is a rechargeable battery which is used to start a car. The battery is used to start the motor. After that, the motor operates a generator to charge the battery. Most are lead acid batteries, although some electric cars can have other batteries. Car batteries can be replaced and recycled when they cannot be recharged anymore. They are used to power important electrical components and stabilize the voltage that keeps the engine running by converting chemical energy into electrical energy. All the electrical accessories in a car are controlled and powered by an alternator which converts some of the engines mechanical energy into electrical energy. The alternator charges the internal battery of the car. The alternator is powered by the timing belt which only moves once the car is started and therefore it cannot be used to start the car and that is why a battery is needed. The alternator works with a timing belt that rests on a pulley attached to the alternator that moves once the car is started. When the timing belt spins the pulley, it turns a rotator shaft attached to the pulley which spins magnets around a coil. The spinning magnets create alternating current around the coil. That is directed to the rectifier which changes it into direct current. That is used to power the car and its electrical systems. The cars internal computer, also know as the Electric Control Unit (ECU) decides the fuel injection, exhaust system requirements and throttle response. For petrol engines it also can control the spark plug timing to ignite the mixture of air and fuel in the cylinder. It is primarily powered by the alternator but before the car is started, it must be powered by the battery as it decides the fuel injection and spark timing which are one of the key factors in getting a car started. The internal battery of the car also works as a surge protector, protecting the ECU from AC voltage spikes that typically last from 1 to 30 microseconds and can reach over 1,000 volts. ==Related pages== * Table of batteries * Sealed lead acid battery ==References== Category:Physical chemistry Category:Auto parts Category:Batteries",
 "title": "Car battery"
}