{
 "id": "259015",
 "text": "Dame Vera Margaret Lynn CH DBE (née Welch; 20 March 1917 – 18 June 2020) was an English singer and actress. Lynn was born in East Ham, Essex. She began performing in public at age seven and she started using her grandmother's maiden name (Lynn) as her stage name. Her first radio broadcast was in 1935 with the Joe Loss Orchestra. At this time she was being featured on records released by dance bands including those of Loss and of Charlie Kunz. She was popular during World War II. Her best known songs are We'll Meet Again and The White Cliffs of Dover. Lynn worked a lot with charities for former military servicemen, disabled children, and breast cancer. Veterans of the Second World War still admire her. She was named the Briton who best exemplified (the best example of) the spirit of the twentieth century, in 2000. Vera Lynn's album We'll Meet Again: The Very Best of Vera Lynn went to #1 in the United Kingdom. This made her the oldest living artist to top the U.K. album charts. The album is some of her recordings made for Decca Records. Lynn recorded for Decca between 1936 and 1959. The album reached number one on the UK Albums Chart on 13 September 2009. The album entered the chart at number 20 on 30 August. It then climbed to number 2 the following week, before reaching the top position. The 1964 movie Dr. Strangelove, starring Peter Sellers and George C. Scott, ends with a world-ending war of atomic bombs. The scene uses Vera Lynn's song We'll Meet Again. Lynn died on 18 June 2020 at the age of 103 in East Sussex. == Albums == Year Album 1961 Yours 1961 As Time Goes By 1962 Hits Of The Blitz 1964 Among My Souvenirs 1966 More Hits Of The Blitz 1970 Hits Of The 60's — My Way 1972 Favourite Sacred Songs 1976 Christmas With Vera Lynn 1977 Vera Lynn In Nashville 1981 20 Family Favourites 1989 We'll Meet Again 2009 We'll Meet Again: The Very Best of Vera Lynn 2010 Unforgettable 2014 National Treasure – Ultimate Collection ==Movies== Movie Year Title Role Notes 1943 We'll Meet Again Peggy Brown 1943 Rhythm Serenade Ann Martin 1944 One Exciting Night Vera Baker 1962 Venus fra Vestø Herself ==References== ==Other websites== * * Q&A; with TIME Magazine in September 2009 * Dame Vera Lynn Trust for Children with Cerebral Palsy Category:People buried in Westminster Abbey Category:1917 births Category:English centenarians Category:English pop singers Category:English singers Category:English singer-songwriters Category:Knights and Dames Commander of the Order of the British Empire Category:Musicians from Essex Category:People from East Ham Category:2020 deaths",
 "title": "Vera Lynn"
}