{
 "id": "259144",
 "text": "A tsunami (from Japanese, meaning “harbor wave”) is a natural disaster, a series of fast-moving waves in the ocean caused by powerful earthquakes, volcanic eruptions, landslides, or a meteor impact in the ocean. A tsunami starts as a small wave and builds up into a larger wave, and starts suddenly. The waves travel at a great speed across an ocean with little energy loss. They can remove sand from beaches, destroy trees, toss and drag vehicles and houses and even destroy whole towns and cities. Tsunamis can even be caused when a meteorite strikes the earth’s surface, though this is very rare. A tsunami normally occurs in the Pacific Ocean, especially in what is called the ring of fire (a volcanically active region around the ocean’s edge), but can occur in any large body of water like lakes and seas. If the coast is not steep, the water may pull back for hundreds of meters before a tsunami hits. People who do not know of the danger of tsunamis often remain at the shore. Tsunamis cannot be prevented. However, there are ways to help stop people dying from a tsunami. International and regional warning systems, especially for the Pacific Ocean, issue alerts before the waves arrive. Because the earthquake that caused the tsunami can be felt before the wave gets to the shore, people can be warned to go somewhere safe. Tsunamis are often called seismic sea wave or tidal waves because they usually rise and fall more slowly than ordinary ocean surface waves. This name is misleading, because tsunamis are not related to tides; they merely rise slowly as a series of fast-moving waves in the ocean caused by powerful earthquakes or volcanic eruptions. The deadliest tsunami recorded in documented history was on 26 December 2004, and is known as the 2004 Indian Ocean Tsunami. It was caused by an earthquake. The earthquake was said to have a magnitude of 9.1 on the Moment magnitude scale. It was centered in the ocean near the coast of Sumatra, Indonesia. Over 230,000 people, mainly on the shores of the Indian Ocean, died from this disaster. The giant wave moved very quickly. Thousands of people in Indonesia, Sri Lanka, Thailand, India, Somalia, and other nations, were killed or injured by it. Yet, the most expensive tsunami ever was the 2011 Tōhoku earthquake and tsunami or Great Sendai Earthquake. It is said to have cost the Japanese government around $2200 billion USD, which is equivalent to about 12 trillion yen. It went a huge distance in inland and mostly effected Tōhoku region (northeastern Honshu). and it was the 4th largest tsunami in history. There is another type of tsunami known as a megatsunami , which is mainly due to external impact on the ocean, like an asteroid or meteor crash, a landslide, or a rockslide. It is rare for a megatsunami to occur. == Surviving tsunamis == Tsunamis are very strong and can go many kilometers inland. Around 5 to 10 minutes before a tsunami hits, the sea seems to go back by an unusual distance. This is a warning that a tsunami can occur. The best way to evacuate is to climb to an elevated area. If a person notices strange or unusual behavior in animals, they can also take that as a warning and go inland. However, if it still looks like the wave can absorb the person, the most suitable alternative will be to hold on to something sturdy, like a tree, so they do not totally get carried away and not injured and call the disaster rescue team. ==References== ==Related pages== *Tsunami warning system ==Websites== * https://www.essaylions.com/near-the-east-coast-of-honshu-japan- tsunami/ * IOC Tsunami Glossary by the Intergovernmental Oceanographic Commission (IOC) at the International Tsunami Information Centre (ITIC) of UNESCO * Tsunami Terminology at NOAA *In June 2011, the VOA Special English service of the Voice of America broadcast a 15-minute program on tsunamis as part of its weekly Science in the News series. The program had an interview with an NOAA official who oversees the agency's tsunami warning system. A transcript and MP3 of the program, intended for English learners, can be found at The Ever-Present Threat of Tsunamis. * World's Tallest Tsunami – geology.com * Tsunami Data and Information – National Geophysical Data Center * IOC Tsunami Glossary – International Tsunami Information Center (UNESCO) * Tsunami & Earthquake Research at the USGS – United States Geological Survey * Intergovernmental Oceanographic Commission – Intergovernmental Oceanographic Commission * Tsunami – National Oceanic and Atmospheric Administration * Wave That Shook The World – Nova * Recent and Historical Tsunami Events and Relevant Data – Pacific Marine Environmental Laboratory * Raw Video: Tsunami Slams Northeast Japan – Associated Press * Tsunami alert page (in English) from Japan Meteorological Agency * Tsunami status page from USGS-run Pacific Tsunami Warning Center Category:Japanese words and phrases",
 "title": "Tsunami"
}