{
 "id": "259119",
 "text": "The 2011 Formula One season was the 62nd FIA Formula One season. The FIA announced they would consider adding a thirteenth team to the grid . On 8 September, 2010, the FIA announced that they would not add a new team. The same twelve teams from last year competed in 2011. The race schedule was going to expand to twenty rounds with the running of the Indian Grand Prix, but the Bahrain Grand Prix was cancelled due to the high amount of protesters. Bahrain was briefly put back on the schedule before being cancelled again by the organizers of the race. == Teams and drivers == The new Concorde Agreement signed on 1 August 2009 continues the terms of the 1998 agreement. It will run until 31 December 2012. The FIA published the entry list on 30 November 2010 (updated 2 December 2010). Team Constructor Chassis Engine Tyre No. Race Drivers Rounds Test/Reserve Driver(s) Red Bull Racing Red Bull RB7 Renault RS27–2011 1 Sebastian Vettel All Daniel Ricciardo 2 Mark Webber All Vodafone McLaren Mercedes McLaren MP4-26 Mercedes FO 108Y 3 Lewis Hamilton All Pedro de la Rosa Gary Paffett 4 Jenson Button All Scuderia Ferrari Marlboro Ferrari 150° Italia Ferrari 056 5 Fernando Alonso All Jules Bianchi Giancarlo Fisichella Marc Gené 6 Felipe Massa All Mercedes GP Petronas F1 Team Mercedes WO2 Mercedes FO 108Y 7 Michael Schumacher All TBA 8 Nico Rosberg All Lotus Renault GP Renault R31 Renault RS27-2011 9 Nick Heidfeld 1-11 Fairuz Fauzy Bruno Senna Romain Grosjean Ho-Pin Tung Jan Charouz Bruno Senna 12-19 10 Vitaly Petrov All AT&T; Williams Williams FW33 Cosworth CA2011 11 Rubens Barrichello All Valtteri Bottas 12 Pastor Maldonado All Force India F1 Team Force India VJM04 Mercedes FO 108Y 14 Adrian Sutil All Nico Hülkenberg 15 Paul di Resta All Sauber F1 Team Sauber C30 Ferrari 056 16 Kamui Kobayashi All Esteban Gutiérrez 17 Sergio Pérez 1-6, 8-19 Pedro de la Rosa 7 Scuderia Toro Rosso Toro Rosso STR6 Ferrari 056 18 Sébastien Buemi All Daniel Ricciardo 19 Jaime Alguersuari All Team Lotus Lotus T128 Renault RS27-2011 20 Heikki Kovalainen 1-16 Karun Chandhok Luiz Razia Davide Valsecchi Ricardo Teixeira 21 Jarno Trulli 1-9, 11-19 Karun Chandhok 10 HRT F1 Team Hispania F111 Cosworth CA2011 22 Narain Karthikeyan 1-8, 17 Narain Karthikeyan Daniel Ricciardo 9-16, 18-19 23 Vitantonio Liuzzi 1-16, 18-19 Daniel Ricciardo 17 Marussia Virgin Racing Virgin MVR-2 Cosworth CA2011 24 Timo Glock All Sakon Yamamoto Robert Wickens 25 Jérôme d'Ambrosio All === Notes === * Two teams will use the Lotus name in 2011. * Before the season started, Robert Kubica was set to be one of the drivers for Renault. On February 6, 2011, Kubica was in a bad crash while competing in a rally race. He will need several surgeries to repair the damage. Renault announced that Nick Heidfeld will replace Kubica starting at the test in Barcelona. * Lotus Racing is entered under the Team Lotus name. The legal use of the name Lotus and Team Lotus is under dispute. Team Lotus was an F1 team, based in England, that raced from 1954 to 1994. == Race schedule == The FIA released the race schedule for the 2011 world championship. A new race, the Indian Grand Prix, had been added. However, the Bahrain Grand Prix was called off due to the political unrest in the country. Rd. Official Race Title Grand Prix Circuit City / Location Date 1 Qantas Australian Grand Prix Australian GP Albert Park Grand Prix Circuit Melbourne 27 March 2 Petronas Malaysia Grand Prix Malaysian GP Sepang International Circuit Kuala Lumpur 10 April 3 UBS Chinese Grand Prix Chinese GP Shanghai International Circuit Shanghai 17 April 4 DHL Turkish Grand Prix Turkish GP Istanbul Park Istanbul 08 May 5 Gran Premio de España Spanish GP Circuit de Catalunya Barcelona Catalunya 22 May 6 Grand Prix de Monaco Monaco GP Circuit de Monaco Monte Carlo 29 May 7 Grand Prix du Canada Canadian GP Circuit Gilles Villeneuve Montreal 12 June 8 Grand Prix of Europe European GP Valencia Street Circuit Valencia 26 June 9 Santander British Grand Prix British GP Silverstone Circuit Silverstone 10 July 10 Grosser Preis Santander Von Deutschland German GP Hockenheimring Hockenheim 24 July 11 Eni Magyar Nagydij Hungarian GP Hungaroring Budapest 31 July 12 Shell Belgian Grand Prix Belgian GP Circuit de Spa-Francorchamps Spa-Francorchamps 28 August 13 Gran Premio Santander d'Italia Italian GP Autodromo di Monza Monza 11 September 14 SingTel Singapore Grand Prix Singapore GP Marina Bay Street Circuit Singapore 25 September 15 Japanese Grand Prix Japanese GP Suzuka Circuit Suzuka 9 October 16 Korean Grand Prix Korean GP Korean International Circuit Yeongam 16 October 17 Airtel Indian Grand Prix Indian GP Buddh International Circuit Greater Noida 30 October 18 Etihad Airways Abu Dhabi Grand Prix Abu Dhabi GP Yas Marina Circuit Yas Island 13 November 19 Grande Prêmio do Brasil Brazilian GP Autódromo José Carlos Pace São Paulo 27 November == Changes == * A new race, the Indian Grand Prix, has been added to the schedule. * Pirelli was the only tyre.* Adjustable rear wings were allowed. This replaced the adjustable front wing used in 2010. During the race, the wing may be adjusted only during selected conditions. After the first two laps, the driver may adjust the wing at selected locations on the track. The driver must be within one second of the car in front. This change should improve passing. * The F-duct, used in 2010, was banned. * Shortened shark fins. The shark fin, the raised engine cover that connected to the rear wing was banned. The height and length of the engine cover was limited. * KERS, or Kinetic Energy Recovery Systems was used again. It was not banned in 2010, but all the teams agreed to not use it. To encourage teams to install and use KERS, the minimum weight of the car was increased from 620 kilograms (1,367 pounds) to 640 kilograms (1,411 pounds). * The 107% rule returned to qualifying. The 107% rule is used for the first qualifying session (Q1). The rule was used to keep cars that are too slow out of the race. Any car that could not set a qualifying time within 107% of the fastest car was not allowed to enter the race. The rule did not apply to Q2 and Q3. :An example: The fastest car in Q1 sets a time of 1 minute and 40 seconds (or 100 seconds). The 107% time will be 1 minute and 47 seconds (or 107 seconds). A slower car sets a time of 1 minute and 45 seconds. It will be allowed to race. Another car sets a time of 1 minute and 48 seconds (or 108 seconds). This car will not be allowed to race. :Under some special conditions, the race stewards may allow a practice time to count for the 107% rule. * Starting with the European Grand Prix, the FIA no longer allowed teams to change the engine mapping parameter after the qualifying session. *Starting with the British Grand Prix, the FIA no longer allowed teams to flow constant exhaust gas when off throttle. Several teams had directed the exhaust gas to exit under the car. They then changed the engine to continue flow a large amount of gas through the exhaust when the driver let off the throttle in the corners. This gave the car better aerodynamics. == Results and standings == === Race results === Round Grands Prix Pole position Fastest lap Winning driver Winning constructor 1 Australian Grand Prix Sebastian Vettel Felipe Massa Sebastian Vettel Red Bull-Renault 2 Malaysian Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault 3 Chinese Grand Prix Sebastian Vettel Mark Webber Lewis Hamilton McLaren-Mercedes 4 Turkish Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault 5 Spanish Grand Prix Mark Webber Lewis Hamilton Sebastian Vettel Red Bull-Renault 6 Monaco Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault 7 Canadian Grand Prix Sebastian Vettel Jenson Button Jenson Button McLaren-Mercedes 8 European Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault 9 British Grand Prix Mark Webber Fernando Alonso Fernando Alonso Ferrari 10 German Grand Prix Mark Webber Lewis Hamilton Lewis Hamilton McLaren-Mercedes 11 Hungarian Grand Prix Sebastian Vettel Felipe Massa Jenson Button McLaren- Mercedes 12 Belgian Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault 13 Italian Grand Prix Sebastian Vettel Lewis Hamilton Sebastian Vettel Red Bull-Renault 14 Singapore Grand Prix Sebastian Vettel Jenson Button Sebastian Vettel Red Bull-Renault 15 Sebastian Vettel Jenson Button Jenson Button McLaren-Mercedes 16 Korean Grand Prix Lewis Hamilton Sebastian Vettel Sebastian Vettel Red Bull-Renault 17 Indian Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault 18 Abu Dhabi Grand Prix Sebastian Vettel Mark Webber Lewis Hamilton McLaren-Mercedes 19 Brazilian Grand Prix Sebastian Vettel Mark Webber Mark Webber Red Bull- Renault ==== Scoring system ==== === Drivers standings === Pos Driver AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA Points 1 Sebastian Vettel 392 2 Jenson Button 270 3 Mark Webber 258 4 Fernando Alonso 257 5 Lewis Hamilton 227 6 Felipe Massa 118 7 Nico Rosberg 89 8 Michael Schumacher 76 9 Adrian Sutil 42 10 Vitaly Petrov 37 11 Nick Heidfeld 34 12 Kamui Kobayashi 30 13 Paul di Resta 27 14 Jaime Alguersuari 26 15 Sébastien Buemi 15 16 Sergio Pérez 14 17 Rubens Barrichello 4 18 Bruno Senna 2 19 Pastor Maldonado 1 20 Pedro de la Rosa 0 21 Jarno Trulli 0 22 Heikki Kovalainen 0 23 Vitantonio Liuzzi 0 24 Jérôme d'Ambrosio 0 25 Timo Glock 0 26 Narain Karthikeyan 0 27 Daniel Ricciardo 0 28 Karun Chandhok 0 Pos Driver AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA Points Pole position in Bold. Fastest lap in Italics. Driver did not finish the Grand Prix. Driver was classified (ranked) because they finished over 90% of the race. === Constructors standings === Pos Constructor Car No. AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR ITA ABU BRA Points 1 Red Bull-Renault 1 650 2 2 McLaren-Mercedes 3 497 4 3 Ferrari 5 375 6 4 Mercedes 7 165 8 5 Lotus-Renault 9 73 10 6 Force India-Mercedes 14 69 15 7 Sauber-Ferrari 16 44 17 8 Toro Rosso-Ferrari 18 41 19 9 Williams-Cosworth 11 5 12 10 Team Lotus-Renault 20 0 21 11 HRT-Cosworth 22 0 23 12 Virgin-Cosworth 24 0 25 Pos Constructor Car No. AUS MAL CHN TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR ITA ABU BRA Points Pole position in Bold. Fastest lap in Italics. Car did not finish the Grand Prix. Car was classified (ranked) because it finished over 90% of the race distance. == References == ==Other websites== * The official website of Formula One Category:Formula One seasons Category:Formula One current Category:2011 in sports",
 "title": "2011 Formula One World Championship"
}