{
 "id": "259249",
 "text": "Clifford Vivian Devon \"Cliff\" Curtis (born 27 July 1968 in Rotorua, New Zealand) is a New Zealand actor. Curtis has been in many different movies as well as television shows. Curtis started acting musicals like Fiddler on the Roof and Man of La Mancha. Curtis made his big screen debut in the Oscar- nominated film, The Piano. Curtis was born to an amateur dancer and is one of nine children. Curtis is married. He has two children. ==Filmography== ===Movies=== Curtis has acted in many movies: Film Year Title Role Notes 1993 The Piano Mana 1993 Desperate Remedies Fraser 1994 Kahu & Maia 1994 Once Were Warriors Bully 1994 Rapa Nui Short Ears 1994 Hercules in the Underworld Nessus TV movie 1996 Chicken Zeke 1996 Mananui 1998 The Chosen Father Tahere TV movie 1998 Deep Rising Mamooli 1996 Six Days Seven Nights Kip 1998 Virus Hiko 1999 Three Kings Amir Abdulah 1999 Bringing Out the Dead Cy Coates Cameo appearance 1999 The Insider Sheikh Fadlallah 2000 Jubilee Billy Williams 2001 Blow Pablo Escobar 2001 Training Day Smiley 2001 The Majestic The Evil But Handsome Prince Khalid 2002 Collateral Damage Claudio Perrini 2002 Point of Origin Mike Camello TV movie 2002 Whale Rider Porourangi 2003 Runaway Jury Frank Herrera 2004 Spooked Mort Whitman 2004 Heinous Crime Pizza delivery man 2005 The Pool Husband 2005 River Queen Wiremu 2006 The Fountain Captain Ariel 2007 Sunshine Searle 2007 Fracture Detective Flores 2007 Live Free or Die Hard FBI Deputy Director Miguel 2008 10,000 BC Tic'Tic 2009 Push Hook Waters 2009 Crossing Over Hamid Baraheri 2010 The Last Airbender Fire Lord Ozai 2011 A Thousand Words Dr. Sinja ===Television=== Curtis has also acted in television series: Film Year Title Role Notes 1991 Under Cover Zip 1995 Hercules: The Legendary Journeys Nemis One episode 1994 City Life Daniel Freeman 2004 Traffic Adam Kadyrov 2009-10 Trauma Reuben 'Rabbit' Palchuk 2015- Fear the Walking Dead Travis Main cast ==Other websites== * * * Cliff Curtis at TVGuide.com Category:1968 births Category:Living people Category:New Zealand Māori people Category:New Zealand movie actors Category:New Zealand television actors",
 "title": "Cliff Curtis"
}