{
 "id": "259253",
 "text": "The Annecy International Animation Film Festival (Festival International du Film d'Animation d'Annecy) was created in 1960. It takes place at the beginning of June in the town of Annecy, France. At first, it took place every two years. The festival became annual in 1998. It is one of the four international animated movie festivals sponsored by the Association d'International du Film d'Animation (or ASIFA, the International Animated Film Association) ==Short movies Awards== *1960 - Lev a pisnicka (Grand prix) *1962 - The Flying Man (Grand prix) *1963 - Spatne namalovana slepice (Grand prix) *1965 - La demoiselle et le violoncelliste (Grand prix) *1967 - Arès contre Atlas (Grand prix) *1967 - Klatki (Grand prix) *1967 - Krotitelj divljih konja (Grand prix) *1967 - The Breath (Grand prix) *1971 - Apel (Grand prix) *1971 - Nevesta (Grand prix) *1971 - The Further Adventures of Uncle Sam (Grand prix) *1973 - Frank movie (Grand prix) *1975 - Le Pas (Grand prix) *1977 - David (Grand prix) *1977 - The Sand Castle (Grand prix) *1979 - Afterlife (Grand prix) *1979 - Mr. Pascal (Grand prix) *1981 - Tango (Grand prix) *1983 - Moznosti dialogu (Grand prix) *1985 - Een griekse tragedie (Grand prix) *1987 - L'homme qui plantait des arbres (Grand prix) *1987 - Smatchkan sviat (Grand prix) *1991 - The Hill Farm (Grand prix) *1993 - Le Fleuve aux grandes eaux (Grand prix) *1995 - Switchcraft (Grand prix du court métrage) *1997 - La Vieille Dame et les Pigeons (Grand prix du court métrage) *1998 - Nachtvlinders (Grand prix du court métrage) *1999 - When the Day Breaks (Grand prix du court métrage) *2000 - The Old Man and the Sea (Grand prix du court métrage) *2001 - Father and Daughter (Grand prix du court métrage) *2002 - Barcode (Grand prix du court métrage) *2003 - Atama Yama (Le Cristal d'Annecy) *2004 - Lorenzo (Le Cristal d'Annecy) *2005 - The Mysterious Geographic Explorations of Jasper Morello (Le Cristal d'Annecy) *2006 - Histoire tragique avec fin heureuse (Le Cristal d'Annecy) *2007 - Peter & the Wolf (Le Cristal d'Annecy) *2008 - La maison en petits cubes (Le Cristal d'Annecy) *2009 - Slavar (Le Cristal d'Annecy) *2013 - BoOzy' OS and the Cristal Gem (+ de courts! Online animation film contest by Annecy) ==Full-length movies Awards== *1995 - Heisei tanuki gassen Pompoko (Grand prix du long métrage) *1997 - James and the Giant Peach (Grand prix du long métrage) *1998 - I Married a Strange Person (Grand prix du long métrage) *1999 - Kirikou et la sorcière (Grand prix du long métrage) *2001 - Mutant Aliens (Grand prix du long métrage) *2002 - Mari Iyagi (Grand prix du long métrage) *2003 - My Life as McDull (Le Cristal du long métrage) *2004 - Oseam (Le Cristal du long métrage) *2005 - Nyócker ! (Le Cristal du long métrage) *2006 - Renaissance (Le Cristal du long métrage) *2007 - Slipp Jimmy fri (Le Cristal du long métrage) *2008 - Sita Sings The Blues (Le Cristal du long métrage) *2009 - Coraline / Mary and Max (Le Cristal du long métrage) ==Films produced for television== *1995 - Insektors: Le pont de la Konkorde (Grand Prix pour un spécial TV) *1997 - Famous Fred (Grand prix du movie TV) *1998 - Die Hard (Grand prix attribué à une série TV) *2000 - The Periwig-Maker (Grand prix du movie TV) *2002 - Hamilton Mattress (Grand prix) *2003 - Verte (Le Cristal pour une production TV) *2004 - Creature Comforts \"Cats or Dogs?\" (Le Cristal pour une production TV) *2005 - Peppa Pig \"Mummy Pig at Work\" (Le Cristal pour une production TV) *2006 - Pocoyo \"A Little Something Between Friends\" (Le Cristal pour une production TV) *2007 - Shaun the Sheep \"Still Life\" (Le Cristal pour une production TV) *2008 - Moot Moot L'enfer de la mode \"Moot Moot 'L'enfer de la mode'\" (Le Cristal pour une production TV) *2009 - Log Jam \"The Log\", \"The Rain\", \"The Moon\", \"The Snake\" (Le Cristal pour une production TV) ==Other websites== * Official website - International Animation Film Festival * ASIFA official web site Category:Movie festivals Category:Festivals in France Category:French movies Category:Annecy Category:1960 establishments in Europe Category:1960s establishments in France",
 "title": "Annecy International Animated Film Festival"
}