{
 "id": "259246",
 "text": "The 36th Annual Annie Awards, honoring the best in animation for 2008, were held on 30 January 2009 at Royce Hall in Los Angeles, California. Below is a list of announced nominees. Kung Fu Panda received the most awards with 11, winning nearly all of its nominations. ==Production nominees== ===Best Animated Feature=== * Kung Fu Panda **Bolt **$9.99 **WALL-E **Waltz with Bashir ===Annie Award for Best Home Entertainment Production=== *Futurama: The Beast with a Billion Backs **Batman: Gotham Knight **Christmas Is Here Again **Justice League: The New Frontier **The Little Mermaid: Ariel's Beginning ===Annie Award for Best Animated Short Subject=== *Wallace & Gromit: A Matter of Loaf and Death **Glago's Guest **Hot Dog **Presto **Sebastian’s Voodoo ===Annie Award for Best Animated Television Commercial=== *United Airlines “Heart” **Giant Monster **Long Legs Mr. Hyde **Rotofugi: The Collectors **Sarah ===Annie Award for Best Animated Television Production=== *Robot Chicken: Star Wars Episode II **King of the Hill **Moral Orel **Phineas and Ferb **The Simpsons ===Best Animated Television Production for Children=== *Avatar: The Last Airbender – Nickelodeon **A Miser Brothers' Christmas – Warner Bros. **Foster's Home for Imaginary Friends – Cartoon Network **Underfist: Halloween Bash – Cartoon Network **The Mighty B! – Nickelodeon ===Annie Award for Best Animated Video Game=== *Kung Fu Panda **Dead Space **WALL-E ==Individual Achievement== ===Animated Effects=== *Li-Ming Lawrence Lee - Kung Fu Panda **Alen Lai - Dr. Seuss’ Horton Hears A Who **Fangwei Lee - Madagascar: Escape 2 Africa **Kevin Lee - Bolt **Enrique Vila - Wall-E ===Character Animation in a Feature Production=== *James Baxter – Kung Fu Panda **Jeff Gabor – Dr. Seuss’ Horton Hears A Who **Philippe Le Brun – Kung Fu Panda **Victor Navone – Wall-E **Dan Wagner – Kung Fu Panda ===Character Animation in a Television Production=== *Pierre Perifel - Secrets of the Furious Five **Sandro Cleuzo - Secrets of the Furious Five **Joshua A. Jennings - Robot Chicken: Star Wars Episode II ===Character Design in an Animated Feature Production=== *Nico Marlet - Kung Fu Panda **Valerie Hadida - Igor (film) **Sang Jun Lee - Dr. Seuss’ Horton Hears A Who ===Character Design in an Animated Television Production=== *Nico Marlet - Secrets of the Furious Five **Bryan Arnett – Mighty B! - “Bat Mitzah Crashers” **Ben Balistreri - Foster's Home for Imaginary Friends - “Mondo Coco” **Sean Galloway - The Spectacular Spider-Man **Jorge Gutierrez – El Tigre: The Adventures of Manny Rivera - “The Good, The Bad, The Tigre” ===Directing in an Animated Feature Production=== *John Stevenson and Mark Osborne - Kung Fu Panda **Sam Fell and Rob Stevenhagen The Tale Of Despereaux **Ari Folman - Waltz with Bashir **Tatia Rosenthal - $9.99 **Andrew Stanton - WALL-E ===Directing in an Animated Television Production=== *Joaquim Dos Santos – Avatar: The Last Airbender - “Sozin’s Comet: Into the Inferno” **Bob Anderson - The Simpsons - “Treehouse of Horror XIX” **Craig McCracken and Rob Renzetti - Foster's Home for Imaginary Friends - “Destination Imagination” **Chris McKay – Moral Orel - “Passing” **Alan Smart - SpongeBob SquarePants - “Penny Foolish” ===Music in an Animated Feature Production=== *Hans Zimmer & John Powell – Kung Fu Panda – DreamWorks Animation **Kevin Manthei - Batman: Gotham Knight - Warner Bros. Animation **John Powell - Dr. Seuss’ Horton Hears A Who - Blue Sky Studios **Max Richter – Waltz With Bashir – Sony Pictures Classics, Bridgit Folman, Les Films D'ici, Razor Films **William Ross – The Tale of Despereaux (film) – Universal Pictures ===Music in an Animated Television Production or Short Form=== *Henry Jackman, Hans Zimmer & John Powell – “Secrets of the Furious Five” – DreamWorks Animation **Carl Finch & Brave Combo - Click and Clack’s “As the Wrench Turns” – CTTV Productions **Kevin Kiner – “Star Wars The Clone Wars: Rising Malevolence” – Lucasfilm Animation Ltd. **Guy Moon – Back at the Barnyard “Cowman: The Uddered Avenger” – Nickelodeon/Omation **Guy Michelmore – “Growing Up Creepie: Rockabye Freakie” – Taffy Entertainment LLC ===Production Design in an Animated Feature Production=== *Tang Heng “Kung Fu Panda” – DreamWorks Animation **Ralph Eggleston “Wall·E” – Pixar Animation Studios **Paul Felix “Bolt” – Walt Disney Animation Studios **Evgeni Tomov “The Tale Of Despereaux” – Universal Pictures **Raymond Zibach “Kung Fu Panda” – DreamWorks Animation ===Production Design in an Animated Television Production or Short Form=== *Tang Heng “Secrets of the Furious Five” – DreamWorks Animation **Andy Harkness “Glago’s Guest” – Walt Disney Animation Studios **Seonna Hong – The Mighty B! “Bee Patients” – Nickelodeon **Dan Krall – Chowder “The Heavy Sleeper” – Cartoon Network Studios **Raymond Zibach “Secrets of the Furious Five” – DreamWorks Animation ===Storyboarding in an Animated Feature Production=== *Jen Yuh Nelson – “Kung Fu Panda” – DreamWorks Animation **Alessandro Carloni – “Kung Fu Panda” – DreamWorks Animation **Ronnie Del Carmen – “Wall·E” – Pixar Animation Studios **Joe Mateo “Bolt” – Walt Disney Animation Studios **Rob Stevenhagen – “The Tale Of Despereaux” – Universal Pictures ===Storyboarding in an Animated Television Production or Short Form=== *Chris Williams “Glago’s Guest” – Walt Disney Animation Studios **Butch Hartman – Fairly OddParents “Mission: Responsible” – Nickelodeon **Andy Kelly – Ni Hao, Kai-Lan “Twirly Whirly Flyers” – Nickelodeon Productions/Nelvana **Andy Schuhler – “Secret of the Furious Five” – DreamWorks Animation **Eddie Trigueros “The Mighty B! “Name Shame”– Nickelodeon ===Voice Acting in an Animated Feature Production=== *Dustin Hoffman – Voice of Shifu – “Kung Fu Panda” – DreamWorks Animation **Ben Burtt – Voice of Wall·E – “Wall·E” – Pixar Animation Studios **James Hong – Voice of Mr. Ping – “Kung Fu Panda” – DreamWorks Animation **Ian McShane – Voice of Tai Lung – “Kung Fu Panda” – DreamWorks Animation **Mark Walton – Voice of Rhino – “Bolt” – Walt Disney Animation Studios ===Voice Acting in an Animated Television Production or Short Form=== *Ahmed Best – Voice of Jar Jar Binks – “Robot Chicken: Star Wars Episode II” - ShadowMachine **Seth MacFarlane – Voice of Peter Griffin – Family Guy “I Dream of Jesus” – Fox TV Animation/Fuzzy Door Productions **Dwight Schultz – Voice of Mung Daal – Chowder “Apprentice Games” – Cartoon Network Studios ===Writing in an Animated Feature Production=== *Jon Aibel & Glenn Berger – “Kung Fu Panda” – DreamWorks Animation **Etan Cohen and Eric Darnell & Tom McGrath – “Madagascar: Escape 2 Africa” – DreamWorks Animation **Ari Folman – “Waltz With Bashir” – Sony Pictures Classics, Bridgit Folman, Les Films D'ici, Razor Films **Cinco Paul and Ken Daurio – “Dr. Seuss’ Horton Hears A Who” – Blue Sky Studios ===Writing in an Animated Television Production or Short Form=== * Tom Root, Douglas Goldstein, Hugh Davidson, Mike Fasolo, Seth Green, Dan Milano, Matthew Senreich, Kevin Shinick, Zeb Wells, Breckin Meyer – “Robot Chicken: Star Wars Episode II” – ShadowMachine **Joel H. Cohen – The Simpsons “The Debarted” – Gracie Films/Fox TV **Scott Kreamer – El Tigre: The Adventures of Manny Rivera “Mustache Love” – Nickelodeon **Paul McEvoy and Todd Berger – “Secrets of the Furious Five” – DreamWorks Animation **Chris Williams – “Glago’s Guest” – Walt Disney Animation Studios ==Other websites== *Official Site of the Annie Awards *2008 Nominations Category:Annie Awards",
 "title": "36th Annie Awards"
}