{
 "id": "259444",
 "text": "A season finale (British English: last in the series; Australian English: season final) is the final episode of a season of a television program. This is often the final episode to be produced for a few months or longer, and, as such, will try to attract viewers to continue watching when the series begins again. A season finale may contain a cliffhanger ending to be resolved in the next season. Alternatively, a season finale could bring open-ended storylines to a close, \"going out on a high\" and similarly maintaining interest in the series' eventual return. ==Notable examples== * Dallas (1978–1991) — Most seasons of the US soap opera finished with a cliffhanger ending, most famously the “Who shot J.R.?” storyline in 1980, when an attempt on J.R. Ewing's life takes place in “A House Divided”, the finale of season 2; the mystery is solved four episodes later in “Who Done It” (season 3). * Star Trek: The Next Generation: \"The Best of Both Worlds\" (1990) — In the third season finale, the Borg attack several Federation colonies and when the Enterprise finally catches up with them, they kidnap Captain Picard. The Enterprise's normal weapons have very little effect on the Borg ship, so the crew devises a way to channel a massive amount of energy into the main deflector dish, turning it into a massive weapon. An Enterprise away team boards the Borg ship to try and rescue Picard, but discover that he has been assimilated — he is now Locutus of Borg. The episode ends with Locutus informing the Enterprise that they will be assimilated as well. Riker's only response is \"Mr. Worf, fire.\" This episode (and its conclusion) are widely regarded by fans to be the best episodes of the entire Star Trek franchise. This was also one of the first cliffhangers outside of a soap opera. * Friends: \"The One with Ross's Wedding\" (1998) — In the fourth season finale of the American sitcom, Ross and several main characters travel to London for his wedding to Emily Waltham. Rachel unexpectedly arrives, intending to tell Ross she loves him and possibly stop the wedding, but she decides against this at the last minute and the ceremony goes ahead as planned. However, during the vows Ross says Rachel's name instead of Emily's, and the episode ends with the registrar asking whether he should continue the ceremony. \"The One in Vegas\" (1999) — The fifth season of Friends ended with another cliffhanger, this time involving Ross and Rachel marrying drunkenly in Las Vegas, leading to their divorce in the following season. * Frasier: \"Something Borrowed, Someone Blue\" (2000) — At the end of the seventh season, the major plotline involving Niles's secret love for Daphne ended, as Daphne seemingly rejects Niles on the night before her wedding, but then joins him in the final scene and asks him to take her away with him, and they leave as her wedding to Donny is supposed to be beginning. * Blackadder: \"The Black Seal\" (1983), \"Chains\" (1986), \"Duel and Duality\" (1987) — Along with \"Goodbyeee\" (1989), the final episodes of the Blackadder series took a liberty that many series would be unable to take, by killing off the major characters (apart from in Blackadder the Third when only Prince George died). This reinforces the idea that the four series stand alone from each other, and the series' general black humor. * Green Wing: series 1 finale (2004) and series 2 finale (2006) — In an ironic parody of certain season finales, both series of the British hospital sitcom Green Wing conclude with literal cliffhangers. In series 1, Guy discovers that Joanna is his biological mother, directly after sleeping with her. In a confused rage, he steals an ambulance (with Mac and Martin managing to jump aboard), and drives it to the edge of a cliff. In series 2 Dr. Statham, having accidentally killed a dwarf, worries that the police are about to find and arrest him and Joanna, so hijacks a couple's campervan (Martin again rides in the back), but Dr. Statham takes them to the edge of the same cliff. Their survival is not explained in the following Green Wing Special, and this plot device could be a criticism of the \"cliffhanger\" method of generating tension and ratings. * Farscape: Bad Timing (2003) was written as the finale of the series' fourth season, ending on a cliffhanger where it appears John Crichton and Aeryn Sun had been killed. The SciFi Channel had announced the series' cancellation several months earlier, and despite intense fan pressure on the network, negotiations between SciFi and the Jim Henson Company failed to renew the series. In protest to the cancellation, the Henson company retained the \"To be continued\" titles at the end of the episode. The cliffhanger was eventually resolved in the Peacekeeper Wars two-part miniseries. ==Series finale== The final episode of a television series often concludes the entire premise of the show. There are examples of episodes, ostensibly having been the \"season finale\", unexpectedly becoming the de facto series finale due to the cancellation of the series. Recent examples of this include John Doe, Invasion, Two Guys and a Girl, Instant Star, Las Vegas and Everybody Hates Chris. ==In sports== In American English, the term has developed to describe the final event of a sporting season, e.g. in soccerSoccershout.com, \"07-05-29 – Season Finale\" Retrieved September 26, 2007 or Motocross,Crash.net, \"Strijbos wins season finale, Ramon crowned\" Retrieved September 26, 2007 perhaps partly because of the popularity of these with television viewers. ==References== Category:Television series",
 "title": "Season finale"
}