{
 "id": "259446",
 "text": "In television, a season premiere refers to the first episode of a new television season for a series that has been renewed. In North America, a given show's season premiere often airs in September or October, after several months of reruns. ==Characteristics== A season premiere usually has one or more of the following characteristics: * Resolutions to cliffhangers and other plots left unresolved in the previous season's season finale. * Introductions of new storylines. Some stock examples might include a character having a new job (or losing one), a character gets a new love interest (or an existing relationship either ends or enters a new phase), children entering a new school, the core group of characters move to a new home (or hangout, etc.) ... and the list goes on. :Often, one or more of these stories will introduce a fundamental change to a particular show. An example is Archie Bunker's Place, where Archie's wife, Edith, died and the characters deal with her death. Subsequent episodes had Archie adjusting to life as a widower and re-entering the dating scene. * One-up episodes with plots or special guest stars meant to entice viewers. Some shows feature a special guest star (e.g., Don Drysdale on a season premiere episode of The Brady Bunch or Jerry Seinfeld on a season premiere of 30 Rock); others might have multi-part \"adventures,\" such as the Bradys' family vacations to Grand Canyon and Hawaii. * A change in central setting or, to a lesser extent, remodeling of the setting. * Introductions of new characters, frequently to boost the ratings of a veteran show, two examples are John Doggett in season eight and Monica Reyes in season nine of The X-Files. * In the case of game shows, the introduction of new (or revised) rules, new bonus games, rules concerning prizes (such as what can be won), and/or new models. * The show airing at a new day and/or timeslot, either to improve sagging ratings or - if the ratings are high - to anchor a line-up of new and veteran programs. Category:Television series",
 "title": "Season premiere"
}