{
 "id": "259616",
 "text": "The Shanghai International Circuit is a Chinese motor racing venue. It is in the district of Jiading near Shanghai in the People's Republic of China. It was the venue of the first Formula One Chinese Grand Prix on 26 September 2004. == History == The circuit costing about $450 million (USD). It was paid for by a government-funded joint-venture company. This company was made up of the Shanghai Juss Corporation, Shanghai National Property Management Co Ltd, and Shanghai Jia'an Investment and Development Co Ltd. Architectural and design experts began visiting the site by April 2003. The site was transformed from swampland to an international racetrack in 18 months. A team of 3000 worked around the clock to finish the construction. Other events held at the circuit include a round of the MotoGP world championship, the Australian-based V8 Supercar championship, and also the final round of the A1 Grand Prix in 2006 and 2007. The 2008 MotoGP race was the last one at Shanghai International Circuit. The FIM didn't select the circuit for 2009 because of overcrowding problems.FIM announce provisional 2009 MotoGP calendar MotoGP.com, retrieved on July 25, 2008 ==Layout== Like many new Formula One circuits, Shanghai International Circuit was designed by Hermann Tilke. It features his trademark track feature: a long back straight followed by a hairpin turn. Current- generation F1 cars can easily exceed on the long straight between corners 13 and 14.Shanghai International Circuit Facts & Figures Forumula1.net, retrieved on October 10, 2007 The track layout was inspired from the Chinese character shang (上). Shang is the first character in the name of the city Shanghai, and means \"above\" or \"ascend\". == Records == Times below are driven over a distance of 5.451 km. Category Record Driver/Rider Car/Bike Date Formula One 1:32.238 Michael Schumacher Ferrari 26 September 2004 GP2 Asia Series 1:46.470 Kamui Kobayashi DAMS 18 October 2008 A1GP 1:51.832 Darren Manning Team Great Britain 1 April 2006 MotoGP 1:58.139 Colin Edwards Tech 3 Yamaha 3 May 2008 250cc 2:04.543 Jorge Lorenzo Fortuna Aprilia 5 May 2007 125cc 2:11.572 Mika Kallio Red Bull KTM GP 125 13 May 2006 V8 Supercars 1:51.056 * Todd Kelly Holden VZ Commodore 12 June 2005 *Intermediate circuit (4.600 km/2.858 mi) == References == == Other websites == * Shanghai International Circuit Statistics from official F1 site * A1GP info of Shanghai International Circuit Category:Formula One circuits",
 "title": "Shanghai International Circuit"
}