{
 "id": "259742",
 "text": ":For the episode list according to the broadcast order see List of Futurama episodes by broadcast order Futurama is a Fox animated television series, which originally aired on the network from March 28, 1999 to August 10, 2003. All four original production seasons are available on DVD. The DVD sets were entitled \"Volume #\" in Region 1 (USA), and \"Season #\" in the Regions 2 (Europe) and 4 (Australia). The Complete Collection DVD set was released on October 25, 2004 in Region 2, and on March 22, 2005 in Region 1. After cancellation on Fox four direct-to-DVD movies were released and later aired as 16 individual episodes on Comedy Central. Futurama was originally created as four seasons; Fox broadcast it out of the intended order as five seasons. This list is in production order for the first four seasons on Fox, primarily because this is the order used on the DVDs, as intended by the artists, and it helps avoid plot inconsistencies. A list of Futurama episodes by broadcast order is available in a separate article. The production code is the code used by Fox to indicate the production order of the episodes, and is in the format #ACV##. The first number represents the production season. ACV is Fox's series code for Futurama. The second number is the episode's number. The TV broadcast code indicates the broadcast order. It is in the format S##E##, where S## indicates the broadcasting season of which there were 5, and E## indicates the episode's number. Seasons currently airing or in production are ordered by broadcast date as the DVD order is unknown, when the DVDs are released the order will be adjusted to represent the final order in case episodes have been aired out of the intended order as they did on Fox. Futurama 's episode ratings in the United States are TV-PG for suggestive dialogue (D), offensive language (L), sexual content (S), and/or graphic violence (V) in its earlier episodes on Fox and on Cartoon Network's Adult Swim airings. The later episodes on Fox are rated TV-14 for suggestive dialogue (D), offensive language (L), sexual content (S), and/or graphic violence (V). The Comedy Central reruns are also rated TV-14, but do not include any of the sub- ratings. In the UK, Futurama episodes have been rated PG (parental guidance suggested when viewing) or 12 (not recommended viewing for anyone under 12 years of age), depending on the episode's content. The only episode not rated PG or 12 is \"Leela's Homeworld,\" which is rated U (recommended for all ages). Season five aired on Comedy Central from March 23, 2008 to August 30, 2009. It consisted of the four straight-to-DVD films divided into sixteen individual episodes. Each four-episode set aired after the release of the accompanying film. In addition to airing the new season, Comedy Central has taken over syndication of the previous episodes.Vo, Alex (July 30, 2007). Comic-Con Premieres New Futurama Footage; Plus, We Interview Futurama's Rich Moore . Rotten Tomatoes. Retrieved on August 1, 2007 A sixth season, consisting of 26 episodes, began airing on Comedy Central on June 24, 2010. == Seasons == Seasons Episodes Prod. Code Originally Aired Pilot 0 0ACVxx December 1998 1 13 1ACVxx March 1999 - November 1999 2 19 2ACVxx November 1999 - December 2000 3 22 3ACVxx January 2001 - December 2002 4 18 4ACVxx February 2002 - August 2003 5 16 5ACVxx March 2008 - August 2009 6 26 6ACVxx June 2010 - September 2011 7 26 7ACVxx June 2012 - September 2013 === Season 1 === # Original airdate Prod. Code Title Pilot December 16, 1998 0ACV01 \"Oggy and the Cockroaches: The Movie\" 1 - 101 March 28, 1999 1ACV01 \"Space Pilot 3000\" 2 - 102 April 4, 1999 1ACV02 \"The Series Has Landed\" 3 - 103 April 6, 1999 1ACV03 \"I, Roommate\" 4 - 104 April 13, 1999 1ACV04 \"Love's Labours Lost in Space\" 5 - 105 April 20, 1999 1ACV05 \"Fear of a Bot Planet\" 6 - 106 April 27, 1999 1ACV06 \"A Fishful of Dollars\" 7 - 107 May 4, 1999 1ACV07 \"My Three Suns\" 8 - 108 May 11, 1999 1ACV08 \"A Big Piece of Garbage\" 9 - 109 May 18, 1999 1ACV09 \"Hell Is Other Robots\" 10 - 110 September 26, 1999 1ACV10 \"A Flight to Remember\" 11 - 111 October 3, 1999 1ACV11 \"Mars University\" 12 - 112 November 7, 1999 1ACV12 \"When Aliens Attack\" 13 - 113 November 14, 1999 1ACV13 \"Fry and the Slurm Factory\" == References == Category:Lists of animated television series episodes Category:Lists of comedy television series episodes",
 "title": "List of Futurama episodes"
}