{
 "id": "259874",
 "text": "Deus ex machina or Random House Dictionary is the Latin version of an ancient Greek phrase ἀπὸ μηχανῆς θεός. The phrase means \"the god from the machine\". It comes from the theatre of ancient Greece. They had a kind of crane for delivering gods onto the stage on wires. By extension, the term means a plot device whereby a seemingly impossible problem is suddenly solved by means which do not follow normal logic. For example, in Euripides' play Alcestis, the heroine agrees to give up her own life in order to spare the life of her husband, Admetus. At the end Heracles shows up and seizes Alcestis from Death, restoring her to life and to Admetus. A more frequently cited example is Euripides' Medea in which the deus ex machina is used to take Medea (who has murdered people and babies) away from her husband Jason to the safety and civilization of Athens. Aristotle criticized this device in his Poetics. He argued that the resolution of a plot should follow the logic of the play. It should not come from something outside that logic.Janko (1987, 20) :\"It is obvious that the solutions of plots... should come about as a result of the plot itself, and not from a contrivance, as in the Medea and in the passage about sailing home in the Iliad. A contrivance must be used for matters outside the drama—either previous events which are beyond human knowledge, or later ones that need to be foretold or announced... There should be nothing improbable in the incidents; otherwise, they should be outside the tragedy as, for example, in Sophocles' Oedipus.Aristotle Poetics (1454a33-1454b9) There are many examples of the same dramatic device in modern movies and novels. For example, in H.G. Wells's War of the Worlds, the aliens attacking Earth are suddenly killed by bacteria. The movie Monty Python and the Holy Grail makes fun of this plot device when the heroes barely escape from an animated monster because the animator died from a heart attack before finishing the movie's animation. Since the monster only existed in the animated scenes in the movie, the animator's death caused the monster to completely disappear from the movie. ==Notes== ==Books== * Bushnell, Rebecca (ed) 2005. A Companion to Tragedy. Malden, MA and Oxford: Blackwell Publishing. . * Heath, Malcolm, trans. 1996. Poetics by Aristotle. Penguin: London. . * Janko, Richard, trans. 1987. Poetics with Tractatus Coislinianus, reconstruction of Poetics II and the fragments of the On Poets Aristotle. Cambridge: Hackett. . * Mastronarde, Donald 1990. Actors on high: the Skene roof, the Crane and the Gods in Attic drama. Classical Antiquity, 9, pp 247–294. University of California. * Rehm, Rush 1992. Greek Tragic Theatre. Routledge, London. . * Tanner, Michael (ed) 2003. The Birth of Tragedy, by Nietzsche, Friedrich. Penguin: London. . * Taplin, Oliver 1978. Greek tragedy in action. Methuen, London. . * Walton, J Michael, trans. 2000. Euripides: Medea. Methuen, London. . Category:Theater Category:Latin words and phrases",
 "title": "Deus ex machina"
}