{
 "id": "259801",
 "text": "The Philadelphia Inquirer is a newspaper that serves the Philadelphia, Pennsylvania, metropolitan area of the United States. The newspaper was founded by John R. Walker and John Norvell in June 1829 as The Pennsylvania Inquirer and is the third-oldest surviving daily newspaper in the United States. Owned by the local group Philadelphia Media Holdings LLC, The Inquirer has the nineteenth largest average weekday U.S. newspaper circulation and has won eighteen Pulitzer Prizes. ==Awards== Pulitzer Prizes awarded to The Philadelphia Inquirer Year Award Person(s) Work 1975 National Reporting Donald Barlett and James B. Steele \"Auditing the Internal Revenue Service\" series 1976 Editorial Cartooning Tony Auth \"O beautiful for spacious skies, For amber waves of grain\" 1977 Local Investigative Specialized Reporting Acel Moore and Wendell Rawls, Jr. Report on the conditions at the Fairview State Hospital for the mentally ill 1978 Public Service The Philadelphia Inquirer A series of articles on the abuse of power by Philadelphia police 1979 International Reporting Richard Ben Cramer Reports from the Middle East 1980 Local General or Spot News Reporting Staff of The Philadelphia Inquirer Coverage of the Three Mile Island accident 1985 Investigative Reporting William K. Marimow Expose on the Philadelphia police K-9 unit 1985 Feature Photography Larry C. Price Series of photographs from Angola and El Salvador 1986 National Reporting Arthur Howe Report on deficiencies in IRS processing of tax returns- reporting 1986 Feature Photography Tom Gralish Series of photographs on the homeless in Philadelphia 1987 Investigative Reporting John Woestendiek Prison beat reporting 1987 Investigative Reporting Daniel R. Biddle, H. G. Bissinger and Fredric N. Tulsky \"Disorder in the Court\" 1987 Feature Writing Steve Twomey Profile of life aboard an aircraft carrier 1988 National Reporting Tim Weiner Series on a secret Pentagon budget used for defense research and an arms buildup 1989 National Reporting Donald Barlett and James B. Steele Investigation into the Tax Reform Act of 1986 1989 Feature Writing David Zucchino \"Being Black in South Africa\" 1990 Public Service Gilbert M. Gaul Report on the American blood industry 1997 Explanatory Journalism Michael Vitez, April Saul and Ron Cortes Series on the choices of the critically-ill Source: The Pulitzer Prizes: Columbia University ==References== ==Other websites== * The Philadelphia Inquirer Online * Philadelphia Media Holdings website * The Philadelphia Inquirer Frontpage (Updated) Category:Newspapers in Pennsylvania Category:1829 establishments in the United States Category:Pulitzer Prize winners Category:Philadelphia Category:1820s establishments in Pennsylvania",
 "title": "The Philadelphia Inquirer"
}