{
 "id": "260374",
 "text": "Hattie McDaniel (June 10, 1895 – October 26, 1952) was an American actress and singer. She was born in Wichita, Kansas. She made her movie debut in the 1932 movie, The Golden West. McDaniel is probably best known for her role as Mammy in the 1939 movie, Gone with the Wind where she won a Academy Award for Best Supporting Actress making her the first African-American to win an Academy Award. McDaniel has two stars on the Hollywood Walk of Fame, one for singing and one for acting. McDaniel died in Woodland Hills, Los Angeles, on October 26, 1952 at age 57 from breast cancer. ==Filmography== Film Year Title Role Notes 1932 The Impatient Maiden Injured Patient Uncredited 1932 Are You Listening? Singer 1932 The Washington Masquerade Maid Uncredited 1932 The Boiling Point Caroline - Kirk's Cook uncredited 1932 Crooner Maid in Ladies' Room uncredited 1932 Blonde Venus Cora, Helen's Maid in New Orleans 1932 The Golden West Mammy Lou uncredited 1932 Hypnotized Powder Room Attendant 1933 Hello, Sister! Woman in Apartment House Uncredited 1933 I'm No Angel Tira's Maid-Manicurist uncredited 1933 Goodbye Love Edna the Maid uncredited 1934 Mickey's Rescue Maid uncredited 1934 Merry Wives of Reno Bunny's Maid uncredited 1934 Operator 13 Annie (a Cook) uncredited 1934 King Kelly of the U.S.A. Black Narcissus Mop Buyer uncredited 1934 Judge Priest Aunt Dilsey 1934 Flirtation uncredited 1934 Lost in the Stratosphere Ida Johnson 1934 Fate's Fathead Mandy, the Maid 1934 Babbitt Rosalie, the Maid uncredited 1934 Little Men Asia uncredited 1934 The Chases of Pimple Street Hattie, Gertrude's Maid uncredited 1935 Anniversary Trouble Mandy, the maid 1935 Okay Toots Maid 1935 The Little Colonel Becky ('Mom Beck') Porter 1935 Transient Lady Servant uncredited 1935 Traveling Saleslady Martha Smith uncredited 1935 Wig-Wag Cook uncredited 1935 The Four Star Boarder Maid Uncredited 1935 China Seas Isabel McCarthy, Dolly's Maid 1935 Alice Adams Malena Burns, Maid Serving Dinner Uncredited 1935 Murder by Television Isabella - the Cook 1935 Harmony Lane Liza, the Cook uncredited 1935 Music is Magic Amanda 1935 Another Face Nellie, Sheila's Maid uncredited 1935 We're Only Human Molly, Martin's Maid uncredited 1936 Can This Be Dixie? Lizzie 1936 Next Time We Love Hanna uncredited 1936 The First Baby Dora uncredited 1936 The Singing Kid Maid uncredited 1936 Gentle Julia Kitty Silvers 1936 Arbor Day Buckwheat's mother 1936 Show Boat Queenie 1936 The Bride Walks Out Mamie - Carolyn's maid 1936 High Tension Hattie 1936 Postal Inspector Deborah uncredited 1936 Star for a Night Hattie 1936 Valiant Is the Word for Carrie Ellen Belle 1936 Libeled Lady Maid in Grand Plaza Hall uncredited 1936 Reunion Sadie 1937 Mississippi Moods 1937 Racing Lady Abby 1937 Don't Tell the Wife Mamie, Nancy's Maid uncredited 1937 The Crime Nobody Saw Ambrosia 1937 The Wildcatter Pearl uncredited 1937 Saratoga Rosetta 1937 Stella Dallas Edna - Maid #2 Uncredited 1937 Sky Racket Jenny 1937 Over the Goal Hannah 1937 Merry Go Round of 1938 Maid 1937 Nothing Sacred Mrs. Walker uncredited 1937 45 Fathers Beulah 1937 Quick Money Hattie, Tompkins' Maid uncredited 1937 True Confession Ella 1938 Battle of Broadway Agatha 1938 Vivacious Lady Hattie, Maid at Prom Dance uncredited 1938 The Shopworn Angel Martha 1938 Carefree Hattie uncredited 1938 The Mad Miss Manton Hilda 1938 The Shining Hour Belvedere 1939 Everybody's Baby Hattie 1939 Zenobia Dehlia 1939 The Women Maid uncredited 1939 Gone with the Wind Mammy - House Servant 1940 Maryland Aunt Carrie 1941 The Great Lie Violet 1941 Affectionately Yours Cynthia, Sue's Cook uncredited 1941 They Died with Their Boots On Callie 1942 The Male Animal Cleota 1942 In This Our Life Minerva Clay 1942 George Washington Slept Here Hester, the Fullers' Maid 1943 Johnny Come Lately Aida 1943 Thank Your Lucky Stars Gossip in 'Ice Cold Katie' Number 1944 Since You Went Away Fidelia 1944 Janie April, Conway's Maid 1944 Three Is a Family Maid 1944 Hi, Beautiful Millie 1946 Janie Gets Married April 1946 Margie Cynthia 1946 Never Say Goodbye Cozy 1946 Song of the South Aunt Tempy 1947 The Flame Celia 1948 Mickey Bertha 1949 Family Honeymoon Phyllis 1949 The Big Wheel Minnie ==References== == Other websites == * Hattie McDaniel's IMDB profile Category:1895 births Category:1952 deaths Category:American Academy Award winning actors Category:African-American actors Category:African- American musicians Category:American movie actors Category:American singer- songwriters Category:American television actors Category:Cancer deaths in Los Angeles Category:Deaths from breast cancer Category:Actors from Wichita, Kansas",
 "title": "Hattie McDaniel"
}