{
 "id": "260376",
 "text": "Pedro Martínez de la Rosa (born 24 February 1971, Barcelona) is an Spanish Formula One racing driver. He has driven in Formula One since 1999. For , de la Rosa was signed by the Sauber team to drive with teammate Kamui Kobayashi. After the Italian Grand Prix, Sauber announced that Nick Heidfeld had been signed to replace de la Rosa. Heidfeld drove for Sauber from to , and to . De la Rosa wishes Sauber well, and said, \"I still intend to be in Formula One for 2011.\" On 27 September, Pirelli announced that de la Rosa had been hired as their new test driver. He will replace Romain Grosjean. Grosjean filled in for Heidfeld when he left Pirelli to join Sauber. After the Friday morning practice for the Canadian Grand Prix, Sergio Pérez became ill. He had received a concussion at the Monaco Grand Prix and was unable to race. Sauber announced that de la Rosa would replace Pérez for the remainder of the weekend. == Racing record == === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 1989 Spanish Formula Fiat Ofensiva Uno – Meycom 7 2 ? ? 5 ? 1st 1990 Spanish Formula Ford Racing for Spain 10 8 ? ? 9 ? 1st 1990 British Formula Ford Racing for Spain 6 0 ? ? 2 0 NC 1990 Formula Ford Festival ? 1 0 0 0 0 N/A 12th 1991 Spanish Formula Renault Championship Racing for Spain 10 0 ? ? 3 46 4th 1992 Eurocup Formula Renault 2.0 Racing for Spain 3 2 ? ? ? ? 1st 1992 Formula Renault Great Britain Racing for Spain 12 3 0 ? 7 153 1st 1993 British Formula Three West Surrey Racing 14 0 0 0 0 18 6th 1993 Macau Grand Prix West Surrey Racing 1 0 0 0 0 N/A NC 1993 Masters of Formula Three West Surrey Racing 1 0 0 0 0 N/A 9th 1994 British Formula Three Racing for Spain 17 0 0 0 0 6 19th 1995 All-Japan Formula Three TOM'S 9 8 8 4 9 54 1st 1995 Macau Grand Prix TOM'S 1 0 0 0 1 N/A 3rd 1996 Formula Nippon Team Nova 10 0 0 0 1 13 8th 1996 All-Japan GT Championship TOM'S 6 0 ? ? 2 38 13th 1996 Macau Grand Prix Paul Stewart Racing 1 0 0 0 0 N/A 7th 1997 Formula Nippon Team Nova 10 6 4 3 10 82 1st 1997 All-Japan GT Championship TOM'S 6 2 ? ? 4 64 1st 1999 Formula One Repsol Arrows 16 0 0 0 0 1 18th 2000 Formula One Arrows F1 Team 17 0 0 0 0 2 16th 2001 Formula One Jaguar Racing 13 0 0 0 0 3 16th 2002 Formula One Jaguar Racing 17 0 0 0 0 0 21st 2005 Formula One West McLaren Mercedes 1 0 0 1 0 4 20th 2006 Formula One Team McLaren Mercedes 8 0 0 0 1 19 11th 2010 Formula One BMW Sauber F1 Team 14 0 0 0 0 6 17th 2011 Formula One Sauber F1 Team 1 0 0 0 0 0* 18th* Season in progress. === Complete Formula One results === (key) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 WDC Points 1999 Repsol Arrows Arrows A20 Arrows T2-F1 3.0 L V10 AUS 6 BRA Ret SMR Ret MON Ret ESP 11 CAN Ret FRA 11 GBR Ret AUT Ret GER Ret HUN 15 BEL Ret ITA Ret EUR Ret MAL Ret JPN 13 18th 1 2000 Arrows F1 Team Arrows A21 Supertec FB02 3.0 L V10 AUS Ret BRA 8 SMR Ret GBR Ret ESP Ret EUR 6 MON Ret CAN Ret FRA Ret AUT Ret GER 6 HUN 16 BEL 16 ITA Ret USA Ret JPN 12 MAL Ret 16th 2 2001 Jaguar Racing Jaguar R2 Cosworth CR-3 3.0 L V10 AUS MAL BRA SMR ESP Ret AUT Ret MON Ret CAN 6 EUR 8 FRA 14 GBR 12 GER Ret HUN 11 BEL Ret ITA 5 USA 12 JPN Ret 16th 3 2002 Jaguar Racing Jaguar R3/R3B Cosworth CR-3 3.0 V10/CR-4 3.0 L V10 AUS 8 MAL 10 BRA 8 SMR Ret ESP Ret AUT Ret MON 10 CAN Ret EUR 10 GBR 11 FRA 9 GER Ret HUN 13 BEL Ret ITA Ret USA Ret JPN Ret 21st 0 2005 West McLaren Mercedes McLaren MP4-20 Mercedes FO 110R 3.0 L V10 AUS TD MAL TD BHR 5 SMR TD ESP TD MON EUR CAN TD USA TD FRA TD GBR TD GER HUN TUR TD ITA TD BEL BRA JPN TD CHN TD 20th 4 2006 McLaren Mercedes McLaren MP4-21 Mercedes FO 108S 2.4 L V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA 7 GER Ret HUN 2 TUR 5 ITA Ret CHN 5 JPN 11 BRA 8 11th 19 2010 BMW Sauber F1 Team Sauber C29 Ferrari 056 2.4 L V8 BHR Ret AUS 12 MAL DNS CHN Ret ESP Ret MON Ret TUR 11 CAN Ret EUR 12 GBR Ret GER 14 HUN 7 BEL 11 ITA 14 SIN JPN KOR BRA ABU 17th 6 2011 BMW Sauber F1 Team Sauber C30 Ferrari 056 2.4 L V8 AUS MAL CHN TUR ESP MON EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA 18th* 0* Season in progress. == References == == Other websites == * The official website for Pedro de la Rosa Category:1971 births Category:Living people Category:Spanish Formula One drivers Category:Formula One current Category:Sportspeople from Barcelona",
 "title": "Pedro de la Rosa"
}