{
 "id": "260418",
 "text": "is a Japanese racing driver. He last raced in Formula One for the Hispania Racing team. He currently is the test driver for Marussia Virgin Racing. ==Early life== He was born in Toyohashi, Aichi Prefecture, == Racing record == === Career summary === Season Series Team Name Races Poles Wins Points Position 2001 All-Japan Formula 3 TOM'S 18 0 0 117 4th 2001 British Formula 3 Team Avanti 4 0 0 0 24th 2002 German Formula 3 2003 Formula 3 Euroseries 20 0 0 0 27th 2004 All-Japan Formula 3 20 1 131 8th 2005 Super GT GT500 Kondo Racing 8 0 1 43 7th 2005 Formula Nippon Kondo Racing 18 0 0 9 10th 2005 Formula One Jordan (Test Driver) 0 0 0 0 NC 2006 Formula One Super Aguri 7 0 0 0 26th 2006 Super GT GT500 Nismo 3 0 0 15 21st 2006 Formula Nippon Kondo Racing 3 0 0 3.5 11th 2007 Formula One Spyker 7 0 0 0 24th 2007 GP2 Series BCN Competición 11 0 0 0 30th 2008 GP2 Series ART Grand Prix 10 0 0 3 23rd 2008 Formula One Renault (Test Driver) 0 0 0 0 NC 2008–09 GP2 Asia Series ART Grand Prix 11 0 0 13 9th 2010 Formula One HRT 7 0 0 0 26th Formula One Virgin Racing Test driver Season in progress === Complete GP2 Series results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 DC Points 2007 BCN Competición BHR FEA 11 BHR SPR 14 ESP FEA 9 ESP SPR 18 MON FEA Ret FRA FEA 11 FRA SPR 13 GBR FEA 16 GBR SPR Ret EUR FEA 13 EUR SPR 11 HUN FEA HUN SPR TUR FEA TUR SPR ITA FEA ITA SPR BEL FEA BEL SPR VAL FEA VAL SPR 30th 0 2008 ART Grand Prix ESP FEA ESP SPR TUR FEA TUR SPR MON FEA MON SPR FRA FEA FRA SPR GBR FEA GBR SPR GER FEA 12 GER SPR NC HUN FEA 10 HUN SPR 4 EUR FEA Ret EUR SPR Ret BEL FEA 18 BEL SPR Ret ITA FEA Ret ITA SPR Ret 23rd 3 ==== Complete GP2 Asia Series results ==== (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 DC Points 2008–09 ART Grand Prix CHN FEA 3 CHN SPR 14 UAE FEA 8 UAE SPR C BHR FEA 17 BHR SPR 11 QAT FEA Ret QAT SPR 14 MAL FEA 12 MAL SPR Ret BHR FEA 6 BHR SPR 4 9th 13 === Complete Formula One results === (key) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 WDC Points 2005 Jordan Grand Prix Jordan EJ15B Toyota RVX-05 3.0 L V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN TD CHN \\- - 2006 Super Aguri F1 Team Super Aguri SA05 Honda RA806E 2.4 L V8 BHR MAL AUS SMR EUR ESP MON GBR TD CAN TD USA TD FRA TD 26th 0 Super Aguri SA06 GER Ret HUN Ret TUR Ret ITA Ret CHN 16 JPN 17 BRA 16 2007 Etihad Aldar Spyker F1 Team Spyker F8-VII Ferrari 056H 2.4 L V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN Ret TUR 20 24th 0 Spyker F8-VIIB ITA 20 BEL 17 JPN 12 CHN 17 BRA Ret 2010 Hispania Racing F1 Team Hispania F110 Cosworth CA2010 2.4 L V8 BHR AUS MAL CHN ESP MON TUR TD CAN EUR GBR 20 GER Ret HUN 19 BEL 20 ITA 19 SIN JPN 16 KOR 15 BRA ABU 26th 0 Season in progress. == References == == Other websites == * Sakon Yamamoto Official Website Category:1982 births Category:Living people Category:Japanese Formula One drivers Category:Formula One current Category:GP2 Series drivers Category:Sportspeople from Aichi Prefecture",
 "title": "Sakon Yamamoto"
}