{
 "id": "260411",
 "text": "Vitantonio \"Tonio\" Liuzzi (born 6 August 1981) is an Italian raceing driver. He was born in Locorotondo. He currently drives for the Hispania Formula One team. He has homes in Lugano, Switzerland and Pescara, Italy. == Racing record == === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 2001 Formula Renault 2000 Eurocup GM Motorsport 1 0 0 0 0 0 NC 2001 Formula Renault 2000 Germany GM Motorsport 8 1 1 3 4 139 2nd 2002 German Formula Three Opel Team BSR 18 0 2 0 3 25 9th 2002 French Formula Three Opel Team BSR 2 0 0 0 0 N/A NC† 2002 Italian Formula Three Opel Team BSR 1 1 1 ? 1 9 8th 2002 Masters of Formula Three Opel Team BSR 1 0 0 0 0 N/A 8th 2002 European Formula Three Cup Opel Team BSR 1 0 0 0 0 N/A NC 2002 Macau Grand Prix Team Kolles Racing 1 0 0 0 0 N/A NC 2003 International Formula 3000 Red Bull Junior Team F3000 10 0 1 0 2 39 4th 2003 World Series by Nissan RC Motorsport 2 0 0 0 0 2 25th 2004 International Formula 3000 Arden International 10 7 9 3 9 86 1st 2005 Formula One Red Bull Racing 4 0 0 0 0 1 24th 2006 Formula One Scuderia Toro Rosso 18 0 0 0 0 1 19th 2007 Formula One Scuderia Toro Rosso 17 0 0 0 0 3 18th 2008–09 Speedcar Series UP Team 9 3 1 4 5 45 3rd 2008–09 A1 Grand Prix A1 Team Italy 4 0 1 0 0 7 16th 2009 Formula One Force India F1 Team 5 0 0 0 0 0 22nd 2010 Formula One Force India F1 Team 19 0 0 0 0 21 15th 2011 Formula One HRT F1 Team 11 0 0 0 0 0* 20th* Season in progress. As Liuzzi was a guest driver, he was ineligible to score points. === Complete International Formula 3000 results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 DC Points 2003 Red Bull Junior Team F3000 IMO 4 CAT Ret A1R 4 MON Ret NUR 2 MAG 4 SIL 3 HOC 4 HUN 9 MNZ 4 4th 39 2004 Arden International IMO 1 CAT 1 MON 1 NUR 11 MAG 1 SIL 1 HOC 1 HUN 2 SPA 2 MNZ 1 1st 86 === Complete A1 Grand Prix results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 13 14 DC Points 2008–09 Italy NED SPR NED FEA CHN SPR CHN FEA MYS SPR MYS FEA NZL SPR NZL FEA RSA SPR RSA FEA POR SPR 4 POR FEA Ret GBR SPR 10 GBR SPR 9 16th 17 === Complete Formula One results === (key) (Races in bold indicate pole position) (Races in italics indicates fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 WDC Points 2005 Red Bull Racing Red Bull RB1 Cosworth TJ2005 3.0 L V10 AUS TD MAL TD BHR TD SMR 8 ESP Ret MON Ret EUR 9 CAN USA FRA TD GBR TD GER TD HUN TD TUR TD ITA TD BEL TD BRA TD JPN TD CHN TD 24th 1 2006 Scuderia Toro Rosso Toro Rosso STR1 Cosworth TJ2006 3.0 L V10 14 Series BHR 11 MAL 11 AUS Ret SMR 14 EUR Ret ESP 15 MON 10 GBR 13 CAN 13 USA 8 FRA 13 GER 10 HUN Ret TUR Ret ITA 14 CHN 10 JPN 14 BRA 16 19th 1 2007 Scuderia Toro Rosso Toro Rosso STR2 Ferrari 056 2.4 L V8 AUS 14 MAL 17 BHR Ret ESP Ret MON Ret CAN Ret USA 17 FRA Ret GBR 16 EUR Ret HUN Ret TUR 15 ITA 17 BEL 12 JPN 9 CHN 6 BRA 13 18th 3 2009 Force India F1 Team Force India VJM02 Mercedes FO 108W 2.4 L V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA Ret SIN 14 JPN 14 BRA 11 ABU 15 22nd 0 2010 Force India F1 Team Force India VJM03 Mercedes FO 108X 2.4 L V8 BHR 9 AUS 7 MAL Ret CHN Ret ESP 15 MON 9 TUR 13 CAN 9 EUR 16 GBR 11 GER 16 HUN 13 BEL 10 ITA 12 SIN Ret JPN Ret KOR 6 BRA Ret ABU Ret 15th 21 2011 Hispania Racing Hispania F111 Cosworth CA2011 2.4 L V8 BEL ITA SIN JPN KOR IND ABU BRA 20th* 0* Season in progress. == References == == Other websites == * The official website for Vitantonio Liuzzi * Vitantonio Liuzzi profile and statistics Category:1981 births Category:Living people Category:Formula One current Category:Italian Formula One drivers Category:Sportspeople from Abruzzo Category:Sportspeople from Apulia Category:People from Pescara",
 "title": "Vitantonio Liuzzi"
}