{
 "id": "260604",
 "text": "An elastic collision is when two objects collide and bounce back with little or no deformation. For example, two rubber balls bouncing together would be elastic. Two cars hitting each other would be inelastic, as the cars crumple, and do not bounce back. In a perfectly elastic collision (the simplest case), no kinetic energy is lost, and so the kinetic energy of the two objects after the collision is equal to their total kinetic energy before the collision. Elastic collisions occur only if there is no net conversion of kinetic energy into other forms (heat, sound). The other rule to remember when working with elastic collisions is that momentum is conserved. ==One-dimensional Newtonian== Consider two particles, indicated by subscripts 1 and 2. Let m1 and m2 be the masses, u1 and u2 be the velocities before the collision and v1 and v2 be the velocities after collision. ===Using Conservation of Momentum to write one formula=== Since it is an elastic collision, the total momentum before the collision is the same as the total momentum after the collision. Given that momentum (p) is calculated as :\\,\\\\! p=mv We can calculate the momentum before the collision to be: :\\,\\\\! m_{1}u_{1}+m_{2}u_{2} and the momentum after the collision to be: :\\,\\\\! m_{1}v_{1}+m_{2}v_{2} Setting the two equal gives us our first equation: :\\,\\\\! m_{1}u_{1}+m_{2}u_{2}=m_{1}v_{1}+m_{2}v_{2} ===Using Conservation of Energy to write a second formula=== The second rule we use is that the total kinetic energy remains the same, meaning that the initial kinetic energy is equal to the final kinetic energy. The formula for kinetic energy is: :\\frac{mv^2}2 So, using the same variables as before: The initial kinetic energy is: :\\frac{m_1u_1^2}2+\\frac{m_2u_2^2}2 The final kinetic energy is: :\\frac{m_1v_1^2}2+\\frac{m_2v_2^2}2. Setting the two to be equal ( since the total kinetic energy remains the same): :\\frac{m_1u_1^2}2+\\frac{m_2u_2^2}2=\\frac{m_1v_1^2}2+\\frac{m_2v_2^2}2. ===Putting those two equations together=== These equations may be solved directly to find vi when ui are known or vice versa. Here is a sample problem, which can be solved using either conservation of momentum, or conservation of energy: For example: :Ball 1: mass = 3 kg, v = 4 m/s :Ball 2: mass = 5 kg, v = -6 m/s After collision: :Ball 1: v = -8.5 m/s :Ball 2: v = unknown ( We'll represent it with v ) Using Conservation of Momentum: :\\,\\\\! m_{1}u_{1}+m_{2}u_{2}=m_{1}v_{1} + m_{2}v_{2}. : \\ 3*4 + 5*(-6) = 3*(-8.5) + 5*v After doing multiplication, and then subtracting 3*(-8.5) from both sides, we get: : \\ 12 - 30 + 25.5 = 5*v Summing the left side, then dividing by 5 gives us: : \\frac{7.5}5 = v, and doing the final division gives us: \\ 1.5 = v We could have also solved this problem using Conservation of Energy: :\\frac{m_1u_1^2}2+\\frac{m_2u_2^2}2=\\frac{m_1v_1^2}2+\\frac{m_2v_2^2}2 :\\frac{3*4^2}2+\\frac{5*(-6)^2}2=\\frac{3(-8.5)^2}2+\\frac{5v^2}2 Multiplying both sides by 2, and then do all the required multiplications gives us: : \\ 48+180=216.75+5v^2 Adding the numbers on the left, subtracting 216.75 from both sides, and dividing by 5 gives us: : \\ 2.25 = v^2 Taking the square root of both sides gives us an answer of v = \\pm1.5. Unfortunately, we'd still need to use conservation of momentum to figure out whether v is positive or negative. Category:Physics Category:Elasticity (physics)",
 "title": "Elastic collision"
}