{
 "id": "261101",
 "text": "Doctor is an academic degree, awarded by a university or similar institution. \"Doctor\" may be used to refer to a person with a doctorate. To get the degree, people need to pass a doctorate exam, or write a thesis or dissertation. The requirements vary according to the subject-matter. There are three levels of university qualification: * A bachelor's degree * A master's degree. * The doctorate. The first level of these, the Bachelo's degree, covers the basics; the things that people will need in their job almost every day. There is very little specialization. A bacheolor's degree usually takes 3-4 years. The second level covers specializations; usually people need a bacheolor's degree in the same branch, or a closely related one. The master's degree is about more advanced cases, and specializations. It usually takes another 1.5 to 2 years. So, people can do a master's degree in about 4.5-5 years. People who do a doctorate write a theseis that can answer one, or a few very specific questions. With the doctorate, they show that they are capable of doing research. Usually, a doctorate takes andother 3-5 years after a master's degree. Depending on the country, there are cases where people get what is called a professional doctorate. This is mostly the case in law, and in medicine. A professional doctorate is comparable to a master's degree. People who have a doctor's degree may use the title \"doctor\", though in practice it is often used only by medical doctors. Medical doctors examine, diagnose and treat patients. They can specialize in a number of medical areas, such as pediatrics, anesthesiology or cardiology, or they can work as general practice physicians. Becoming a medical doctor requires a doctoral degree in medicine and participating in clinical training. Medical doctors need a licence, and certification may also be required for many specialists. * Medical doctor or Doctor of Medicine, a person who practices medicine. Degrees vary: M.D. is common in the United States; MRCP is common in the UK, and they are addressed as \"doctor\" whatever the degree. ** Surgeon, a doctor who performs surgery, is in the UK not called \"doctor\", because the legal qualification is MRCS: Member of the Royal College of Surgeons, because the profession had a different origin. **Physiotherapist, a physiotherapist having Doctor of Physiotherapy is also called Doctor in USA and in countries like India \"traditional and conventional use of Doctor\" can be used by using \"PT\" as suffix for B.P.T.(Bachelor of Physiotherapy) degree holders. * Juris Doctor or Doctor of Law * Doctor of Philosophy a general degree for any subject which offers a doctorate for research and presentation of a thesis. * Universities may award doctorates to people who have done a lot in their fields of study: these are called honorary doctorates. There is no set rule for this. These may be abbreviated \"Doctor h.c.\" (for \"honoris causa\"). Category:Titles",
 "title": "Doctor (title)"
}