{
 "id": "261826",
 "text": "Malcolm in the Middle is an American sitcom. It was shown on Fox. It ran from January 9, 2000 to May 14, 2006. Malcolm in the Middle won 9 Emmy Awards, 1 Peabody Award and 1 Grammy Award. == Cast == *Frankie Muniz as Malcolm *Jane Kaczmarek as Lois *Bryan Cranston as Hal *Justin Berfield as Reese *Christopher Masterson as Francis *Erik Per Sullivan as Dewey == Production == === Development === The pilot was initially developed for UPN with Regency Television for the 1998–99 television season but when UPN's enthusiasm for the project waned, Gail Berman managed to rescue the pilot by bringing the project to Fox. The show was then moved to the 1999–2000 cycle where it was picked up by Fox. === Opening title === The show's opening title features short clips from cult films or television shows, edited together with clips from the pilot and early episodes of the show, set to the song \"Boss of Me\" by They Might Be Giants. === Filming === Much of the filming for Malcolm in the Middle was done on location in various parts of the thirty-mile zone around Los Angeles. A privately owned home, located at 12334 Cantura Street in Studio City, California, was rented for upwards of $3,000 a day to film as Malcolm's house. Rebuilt in 2011, the property is no longer recognizable due to its modern two- floor design. However, the house directly to the left of it is nearly identical to what it looked like during filming, still making it a frequent stop for fans of the show. School scenes were filmed at Colfax Charter Elementary School, in North Hollywood, and the Lucky Aide was represented by a Drug Emporium at 6020 Lankershim Boulevard in North Hollywood. In \"Stock Car Races\", when Hal and the boys are entering a race track, the billboard behind the entrance displays the place as Irwindale Speedway, a real race track in Southern California. The last episode in the first season (\"Water Park\") was filmed at a water park called Wild Rivers (now closed as of 2011) in Irvine, California. Though palm trees and desert scenery are seen in shots of the local region and town throughout the show, indicating a location in the Western United States, it is never revealed which state the show is set in (except for Francis's whereabouts in early seasons, such as his military school in Alabama and his job in Alaska). Studio filming for Malcolm in the Middle took place on Stage 21 at CBS Studio Center in Studio City. Hallmarks of the series' filming and structure, many of which heavily influenced later programs, included the following: * A cold open presenting one or more family members in an absurd situation that has little or nothing to do with the main plot of the episode. * A split-second whip pan as a transition from one scene to another. * Frequent pieces to camera delivered by Malcolm. * An abrupt cut to black at the end of each segment, accompanied by the sound of a slamming door. During the final two seasons, Christopher Masterson reduced his on- screen time in favor of writing and directing some episodes. === Music === The show's theme song, \"Boss of Me\", was written and recorded by the alternative rock group They Might Be Giants. The song won the \"Best Song Written for a Motion Picture, Television or Other Visual Media\" award at the 2002 Grammy Awards. The band also performed nearly all of the incidental music for the show in its first two seasons. Mood-setting music is sprinkled throughout the series, in lieu of audience laughter, in a way that resembles feature film more than other TV sitcoms. Some examples of this highly varied music include ABBA, Basement Jaxx, Sum 41, Kenny Rogers, Lemon Jelly, Lords of Acid, The Getaway People, En Vogue, Electric Light Orchestra, Fatboy Slim, Phil Collins, Claude Debussy, Tears for Fears, Quiet Riot, Queen, Chaka Khan and Citizen King, whose song \"Better Days\" is played at the end of both the pilot episode and the series finale. The Southern California pop-punk band Lit have many of their songs featured in several episodes. Lit songs that were never released as singles were also used. A soundtrack, Music from Malcolm in the Middle, was released on November 21, 2000. ==Other websites== *Malcolm in the Middle on fox.com * Category:2000 American television series debuts Category:2006 American television series endings Category:2000s American sitcoms Category:Emmy Award winning programs Category:American Grammy Award winners Category:Peabody Award winners Category:Television series about brothers Category:Television series about dysfunctional families Category:Television series about suburbia Category:English-language television programs",
 "title": "Malcolm in the Middle"
}