{
 "id": "261848",
 "text": "Cooking Channel is an American television channel. It replaced Fine Living Network on May 31st, 2010. The channel is owned by Scripps Networks Interactive. It is a spin-off of Food Network which is also owned by SNI. The channel focuses more on instructional programs than \"reality style\" and competitions that Food Network is now geared towards. The original plan was to make the change in the fall of 2010.Scripps Rebranding Fine Living Into Cooking Channel, MultiChannel News, October 8, 2009 It was later announced that the switch would be made on May 31, 2010 to happen with Memorial Day in the United States.Another Cable Helping for Food Lovers, New York Times, February 18, 2010 Cooking Channel launched a high-definition channel on June 30, 2010. The channel also announced that it would offer an on demand version. ==Programming== Many of Food Network's top chefs and celebrities had new programs on the channel starting in the fall of 2010. These included - Emeril Lagasse, Rachael Ray and Bobby Flay. Lagasse's program, Emeril's Fresh Food Fast, showed viewers how fresh food can be prepared in a short amount of time without the lose of authentic taste. Flay's program, Bruch @ Bobby's focused on Weekend bruches/ Ray's program, Week In a Day showedviewers how to plan a week's menu by cooking them all in a single day.Cooking Channel Launch To Simmer In Stages, Multichannel News, April 25, 2010 The channel also carried the new \"post-game\" show for The Next Food Network Star. It also aried replays of programs from cooks in Canada and Great Britain, These include Food Network Canada host David Rocco's David Rocco's Dolce Vita and Irish chef Rachel Allen's Rachel Allen: Bake!. ==References== ==Other websites== * *Cooking Channel Fan Page on Facebook *Cooking Channel Chat Page on Twitter Category:American television networks Category:Cable television Category:2010 establishments in the United States Category:Knoxville, Tennessee Category:21st-century establishments in Tennessee",
 "title": "Cooking Channel"
}