{
 "id": "261833",
 "text": "Shays' Rebellion was a rebellion in central and western Massachusetts (mainly Springfield) from 1786 to 1787. The rebellion is named after Daniel Shays, a veteran of the American Revolution who led the rebels, also known as \"Shaysites\" or \"Regulators\". Most of the rebels were poor farmers angered by their debt and taxes. They could not pay their taxes and were afraid of going to jail or having their homes taken away from them. They tried to stop the courts from taking property from indebted farmers by forcing the closure of courts in western Massachusetts. The participants in Shays' Rebellion believed they were acting in the spirit of the American Revolution, modeled their tactics after the crowd activities of the 1760s and the 1770s, and used \"liberty poles\" and \"liberty trees\" to symbolize their cause. Shays' Rebellion started on August 29, 1786, and by January 1787, over 1000 rebels had been arrested. A militia, which had been raised as a private army, defeated an attack on the federal Springfield Armory by the main rebel force on February 3, 1787. Shays' Rebellion produced fears that the American Revolution's democratic impulse had gotten out of hand. Over time, the farmers grew into armies, controlled by Shays and his men, as they tried to take back their rights. Daniel Shays had participated in the Northampton action and began to take a more active role in the uprising in November, though he firmly denied that he was one of its leaders. The Supreme Judicial Court of Massachusetts indicted 11 leaders of the rebellion as \"disorderly, riotous, and seditious persons\". The court was scheduled to meet next in Springfield, on September 26, and Shays organized an attempt to shut it down in Northampton, while Luke Day organized an attempt in Springfield.Holland, pp. 245–247 They were anticipated by William Shepard, the local militia commander, who began gathering militiamen the Saturday before the court was to sit, and he had 300 men protecting the Springfield courthouse by opening time. Shays and Day were able to recruit a similar number but chose only to demonstrate, exercising their troops outside of Shepard's lines rather than attempting to seize the building. The judges first postponed hearings and then adjourned on the 28th without hearing any cases. Shepard withdrew his force (which had grown to around 800 men) to the Springfield Armory, which was rumored to be the target of the protestors.Holland, p. 247 Warrants were issued for the arrest of several of the protest ringleaders, and a posse of around 300 men rode to Groton on November 28 to arrest Job Shattuck and other rebel leaders in the area. Shattuck was chased down and arrested on the 30th and was wounded by a sword slash in the process.Szatmary, pp. 92–93 This action and the arrest of other protest leaders in the eastern parts of the state angered those in the west, and they began to organize an overthrow of the state government. \"The seeds of war are now sown\", wrote one correspondent in Shrewsbury,Szatmary, p. 94 and by mid-January rebel leaders spoke of smashing the \"tyrannical government of Massachusetts\".Szatmary, p. 97 ==References== Category:18th century in Massachusetts Category:1787 in the United States Category:1786 in the United States Category:18th-century rebellions Category:Rebellions in North America",
 "title": "Shays' Rebellion"
}