{
 "id": "261867",
 "text": "The Lord High Chancellor of Great Britain, or Lord Chancellor is a senior and important functionary in the government of the United Kingdom. They are the second highest ranking of the Great Officers of State after the Lord High Steward. The Lord Chancellor is appointed by the Sovereign on the advice of the Prime Minister. Before the Union there were separate Lord ChancellorsThe title can be pluralised 'Lord Chancellors' or 'Lords Chancellor'. The former is more common and is used for consistency throughout the article. See Gardner, B., (2001), A dictionary of modern legal usage, Oxford University Press, p. 538. of England and Scotland. Until Tony Blair became Prime Minister the Lord Chancellor was required to be a member of the House of Lords, was its presiding officer, and was Britain's highest-ranking judge. Blair tried to abolish the position and wound up removing some of its responsibilities and dividing others, and now the holder is usually in the House of Commons. The Lord Chancellor remains responsible for the Great Seal and for the efficient functioning and independence of the courts.Formerly they were also the presiding officer of the House of Lords, and the head of the judiciary in England and Wales, but the Constitutional Reform Act 2005 transferred these roles to the Lord Speaker and the Lord Chief Justice respectively. The current Lord Chancellor is Shabana Mahmood, who replaced Alex Chalk in 2024. Formerly, there were separate Chancellors of England, Scotland and Ireland. When the Kingdom of England and the Kingdom of Scotland united to form the United Kingdom of Great Britain under the Acts of Union 1707 the offices of the Chancellor of England and the Lord Chancellor of Scotland were combined to form a single office of Lord Chancellor of Great Britain for the new state. ==References== ==Bibliography== *Campbell, J., 1st Baron. (1868). Lives of the Lord Chancellors and Keepers of the Great Seal of England From the Earliest Times Till the Reign of King George IV, 5th ed. London: John Murray. * Davies, M. (2003). Companion to the Standing Orders and guide to the Proceedings of the Lords, 19th ed. * Department for Constitutional Affairs. (2003). \"Constitutional Reform: Reforming the Office of the Lord Chancellor\" * House of Lords. (2003–2004). Bill 30 (Constitutional Reform Bill). *\"Lord High Chancellor\" (1911). Encyclopædia Britannica, 11th ed. London: Cambridge University Press. Category:1707 establishments",
 "title": "Lord Chancellor"
}