{
 "id": "262043",
 "text": "The New York Comic Con is a festival that takes place in New York City for fans of comics, graphic novels, anime, manga, video games, toys, movies, and television. ==Past conventions== Dates Places Number of people Guests February 24-26, 2006 Jacob Javits Center, NYC 33,000 Kevin Smith, Frank Miller February 23-25, 2007 Jacob Javits Center, NYC 49,000Reid, Calvin. \"Indie Outreach and More for NYCC 2008\". Publishers Weekly. August 28, 2007. Retrieved March 5, 2010. Stan Lee,Lillard, Kevin. \"New York Comic Con\". (May 2007) Newtype USA. pp. 96-97 Brian K. Vaughan April 18-20, 2008 Jacob Javits Center, NYC 60,000 Stan Lee, Frank Miller, T.M. Revolution, Paul Barnett, Coheed and Cambria February 6-8, 20092009 details Jacob Javits Center, NYC 77,000 Dave Gibbons, Joss Whedon, McG, Daniel Dae Kim, Euros Lyn October 8-10, 2010 Jacob Javits Center, NYC TBC John Romita Sr., John Romita Jr, Stan Lee ==Gallery== Image:4.20.08DavidLloydbByLuigiNovi.JPG|V for Vendetta artist David Lloyd at the April 2008 convention. Image:4.20.08DannyFingerothByLuigiNovi.JPG|Danny Fingeroth at the April 2008 convention. Image:4.20.08DarwynCookeByLuigiNovi.JPG|DC: The New Frontier artist Darwyn Cooke at the April 2008 convention. Image:4.20.08IvanReisByLuigiNovi.JPG|Green Lantern artist Ivan Reis at the April 2008 convention. Image:4.20.08JerryOrdwayByLuigiNovi.JPG|Artist Jerry Ordway at the April 2008 convention. Image:4.20.08WaltSimonsonByLuigiNovi.JPG|Thor writer/artist Walter Simonson at the April 2008 convention. Image:4.20.08RagsMoralesByLuigiNovi.JPG|Identity Crisis artist Rags Morales at the April 2008 convention. Image:4.20.08SimoneBianchiByLuigiNovi.JPG|Italian artist Simone Bianchi at the April 2008 convention. Image:Comic con clay.jpg|Watchmen photographer Clay Enos at the February 2009 convention. Image:Comiccon 21.jpg|Eisner Award Hall of Fame member Jim Steranko at the February 2009 convention. ==References== ==Other websites== *New York Comic Con website *NYCC YouTube page *Videos and photos from New York Comic Con 2007 *AMCTV.com's Sci-Fi Department's video coverage of the 2008 New York Comic Con *Midtown Comics, New York Category:Entertainment in New York City Category:Festivals in the United States Category:Comics conventions",
 "title": "New York Comic Con"
}