{
 "id": "262010",
 "text": "José Alberto Rodríguez (born May 25, 1977) is a Mexican professional wrestler, former mixed martial artist and luchador enmascarado. He has wrestled in the WWE under the ring name Alberto Del Rio. He has also wrestled for Consejo Mundial de Lucha Libre (CMLL), Asistencia Asesoría y Administración (AAA), Ring of Honor (ROH) and Lucha Underground (LU). He competeed in AAA under the ring name El Patrón Alberto (\"The Boss Alberto\") and in ROH and LU under the name Alberto el Patrón. In 2006 Pro Wrestling Illustrated ranked Alberto Del Rio #45 of the 500 best singles wrestlers of the PWI 500. On January 30, 2011, Del Rio won the 2010 Royal Rumble by last eliminating Santino Marella. On August 7, 2014, it was announced that Del Rio had been fired from the WWE after he slapped an employee who allegedly made a racist joke. On August 17 at Triplemanía XXII, El Patrón and his father Dos Caras returned to AAA. He spoke about returning to AAA and he addressed the WWE, claiming that they were racist. They were interrupted by the Los Perros del Mal stable. On December 11, 2014, Ring of Honor (ROH) announced that they had signed Rodríguez and that he would make his debut for them on January 3, 2015. In his debut match, he defeated Christopher Daniels. On January 17, 2015, Lucha Underground announced that they had signed Rodríguez. He debuted for them at their television tapings in Los Angeles, California later that same day. On October 25, 2015, Del Rio made a surprise return to the WWE at Hell in a Cell with Zeb Colter as his manager. At Hell in a Cell, Del Rio answered John Cena's United States Open Challenge. He defeated Cena to win the United States Championship. ==Championships== *Consejo Mundial de Lucha Libre **AAA World Heavyweight Championship (one time) **Técnico of the Year (2014) *Consejo Mundial de Lucha Libre **CMLL World Heavyweight Championship (one time) **La Copa Junior (2006) *Pro Wrestling Illustrated **He was ranked #6 of the top 500 singles wrestlers in the PWI 500 in 2011. *World Wrestling Entertainment/WWE **World Heavyweight Championship (two times) **WWE Championship (two times) **WWE United States Championship (Two times) **Money in the Bank (Raw 2011) **Royal Rumble (2011) **Bragging Rights Trophy (2010) (with Team SmackDown (Big Show, Rey Mysterio, Jack Swagger, Edge, Tyler Reks, and Kofi Kingston)) *World Wrestling League **WWL World Heavyweight Championship (1 time) *Wrestling Observer Newsletter **Best Gimmick (2010) == References == ==Other websites== * Category:1977 births Category:Living people Category:Mexican professional wrestlers Category:Mixed martial artists Category:People from San Luis Potosí Category:Former WWE wrestlers",
 "title": "Alberto Del Rio"
}