{
 "id": "262499",
 "text": "Carbon tetrachloride, also known as tetrachloromethane or carbon tet for short, is a chemical compound. Its chemical formula is CCl4. It contains carbon in its +4 oxidation state and chloride ions. It is a colourless heavy liquid. ==Properties== It is a colorless liquid. It smells like chloroform. It evaporates quite quickly. It can dissolve fats and oils as well as other substances including iodine. It does not burn, but it does make phosgene when heated to a very high temperature. ==Preparation== It is made by reacting methane with chlorine. This reaction is similar to the burning of methane (reaction of methane with oxygen). Hydrogen chloride, chloromethane, dichloromethane and chloroform are byproducts (left over substances). It used to be made by reacting carbon disulfide with chlorine. This reaction would produce sulfur(I) chloride. ==Uses== The uses of carbon tetrachloride have diminished lately, because it is known to be damage people's health. People think it might damage the ozone layer. Today, it is rarely used for anything.Manfred Rossberg, Wilhelm Lendle, Gerhard Pfleiderer, Adolf Tögel, Eberhard-Ludwig Dreher, Ernst Langer, Heinz Jaerts, Peter Kleinschmidt, Heinz Strack, Richard Cook, Uwe Beck, Karl-August Lipper, Theodore R. Torkelson, Eckhard Löser, Klaus K. Beutel, \"Chlorinated Hydrocarbons\" in Ullmann's Encyclopedia of Industrial Chemistry, 2006 Wiley-VCH, Weinheim. Previously, was used in fire extinguishers. It was also used to make freon, used in dry cleaning and as a refrigerant. ==Safety== Carbon tetrachloride is very poisonous to the liver, the kidneys and the nervous system. Carbon tetrachloride converts to phosgene (an extremely poisonous gas) at very high temperatures like fire conditions. In the days when it was used as a fire extinguisher, this problem was very common and caused deaths. ==References in media== *In the episode \"Return From The Outer Space\" (1965) of the science fiction TV series Lost In Space, a boy is seen buying carbon tetrachloride from a parallel universe. *Australian YouTuber Tom de Prinse of \"Explosions&Fire;\" and \"Extractions&Ire;\" made videos where he is taking out carbon tetrachloride from an old fire extinguisher and then using it in his videos in 2019, and the chemical has got a fan base on social media. Channel owner Tom later used carbon tetrachloride themed designs in his channel's merchandise. *In the Ramones song \"Carbona Not Glue\", the singer says that breathing the vapours of a stain remover containing carbon tetrachloride is better than breathing in glue vapours. ==References== ==Related pages== *Chloromethane - methane with 1 hydrogen replaced by chlorine *Dichloromethane - methane with 2 hydrogens replaced by chlorine *Chloroform - methane with 3 hydrogens replaced by chlorine *Carbon dioxide *Bromide *Fluoride Category:Perchlorocarbons Category:Greenhouse gases Category:HVAC",
 "title": "Carbon tetrachloride"
}