{
 "id": "262453",
 "text": "Donovan Patton (born March 1, 1978) is an American host, actor, voice actor, and singer. Patton graduated from the Interlochen Arts Academy and acted in Shakespeare plays such as Much Ado About Nothing and Romeo and Juliet before he replaced Steve Burns as Joe, the second host of Nickelodeon's children's television program Blue's Clues in 2002. Series co-creator Angela Santomero stated that Patton brought Joe, his character, closer to the preschool viewer, as Joe was more willing to \"jump into a problem rather than figure it out first like Steve\". After Blue's Clues ended Patton voiced Bot on Nickelodeon's Team Umizoomi, for his work on children's television series, Patton has been described as a \"household name\" and an \"unqualified star to the 5-and-under set and their parents\". Although most of his career has been in children's television, Patton has also appeared in independent films, such as Awake and Lies I Told My Little Sister, and in television shows. He also appeared in video games, such as Grand Theft Auto V, Lego Jurassic World, Star Wars: The Old Republic - Knights of the Fallen Empire and Halo 5: Guardians. == Early career == Donovan Patton graduated from the Interlochen Arts Academy in northwest Michigan. His first acting roles were in Shakespeare plays such as Much Ado About Nothing and Romeo and Juliet. ==Blue's Clues== Patton's \"big break\" came in 2002, when he was cast to replace Steve Burns as Joe, the second host of the Nickelodeon children's television program Blue's Clues. He was up for a part in Blair Witch Project 2 at the time, but considered the role as Joe \"a happy accident\". Patton became a \"household name\" and has been called \"an unqualified star to the 5-and-under set and their parents\". He was subjected to \"the same kind of scrutiny\" as Burns, who was involved in Patton's selection and helped train him, to earn the role.Tracy, p. 48 Patton was selected out of 1,500 auditions. He had never seen the show before his audition, but like Burns was the favorite with preschool test audiences.Tracy, p. 47 He said, \"I am convinced that I got that part because of a Christopher Walken impression I sometimes do. There's a tape out there, somewhere, with both Steve Burns and myself doing a Blue's Clues scene both as Christopher Walken, which we did at the screen test. I haven't seen the tape, but I know somewhere it still exists\". Beginning in September 2000, Burns trained Patton to take over the host spot and advised him not to \"think of [the show] as children's TV\", but rather as \"acting and telling the truth\". According to Traci Paige Johnson, one of the producers and creators of Blue's Clues, Patton's character was more like a preschooler and more innocent than Steve. Angela Santomero, another producer and creator, stated that Patton's characterization as Joe brought him closer to the preschool viewer as Joe was more willing to \"jump into a problem rather than figure it out first like Steve\". Patton liked working on Blue's Clues because, as he stated, \"I got to go be a kid for twelve hours a day\".Barron, event occurs at 3.38 He called the show's crew \"a real fun little family\" and a \"well-oiled machine\"Barron, event occurs at 5.06 by the time he joined the show. Patton remained on the show for 50 episodes, until it ended its run in 2006, and also appeared in its spin- off, Blue's Room, which premiered in 2004. Several years later, Patton said he had not yet grasped the enormity of replacing Burns, even after he became a parent and witnessed the show's effect on his own children. He admitted that he preferred when his two-year-old daughter watched the Steve episodes. == Later roles == In 2012, Patton appeared in the short films Awake and Pharmboy, the latter of which was directed by his longtime friend Lawrence Feeney. Mark Finguerra, the director of Awake, was able to look past the potential typecasting of Patton's role in Blue's Clues to cast him in a darker role. Patton had impressed him in an audition for an earlier feature film. Finguerra called Patton a \"complete professional [and a] tremendous actor\", and enjoyable on set. He appeared in the soap opera One Life to Live, in which he played, in a departure of his previous roles, \"a very angry man\".Barron, event occurs at 10.30 In 2014, he appeared in a small movie shot mostly in New Jersey, entitled Lies I Told My Little Sister, directed by William Stribling and starring Lucy Walters. Patton called his career, with its mixture of children's television and darker roles in independent films, \"an odd experience\" and told a reporter that he had spent half his life at Nickelodeon. In 2009, he was cast as Bot, the robot superhero, on the children's show Team Umizoomi through the relationships he had made at Nickelodeon on Blue's Clues. He found working on Team Umizoomi \"comforting\" because many of the same crew, producers, and creators had also worked on Blue's Clues. It was the first time he had worked as a voice-over artist, unlike on Blue's Clues, when he was able to be more physical acting in front of a blue screen.Barron, event occurs at 3.10 He said, about Team Umizoomi, \"the work the animators have done on it has been superlative\".Barron, event occurs at 0.38 He stated that he enjoyed working on Team Umizoomi because it gave him the opportunity to participate in a show from its inception, which he had missed with Blue's Clues. Patton said his voice performance of Bot, which he modeled on Brent Spiner's performance as the android Data on Star Trek: The Next Generation and was influenced by Mel Blanc's work in the classic Warner Bros. cartoons,Barron, event occurs at 5.53 \"ended up sounding more like my natural voice, with a teeny bit of superhero in there\". Despite both roles in Blue's Clues and Team Umizoomi requiring him to sing, he did not consider himself a natural singer and felt that he had to work hard at it.Barron, event occurs at 9.45 He said, about being cast as Bot, \"I get to be a superhero. Who doesn't want to be a superhero\"?.Barron, event occurs at 8.30 Patton is married and has two children. He is active in several charities in the New York City area, including Literacy Inc., the Make-a-Wish Foundation, and the Columbia Presbyterian Hospital, a large children's hospital. ==Filmography== Film Year Title Role Notes 1997 Scream 2 Himself / \"Stab\" Jerry Prescott 2005 Black Wine Todd 2009 Imagine That Joe Uncredited 2012 Pharmboy Mr. Morris 2013 Monsters University Additional voices 2014 Lies I Told My Little Sister Josh Davidson 2017 The Broken Ones Tim Kelly 2018 Ralph Breaks the Internet JP Television Year Title Role Notes 2002–2006 Blue's Clues Joe 50 episodes 2004–2007 Blue's Room Joe 13 episodes 2010–2015 Team Umizoomi Bot (voice) 76 episodes 2011 Blue Bloods Bellhop 1 episode 2011 Nurse Jackie Husband 1 episode 2012 Damages Dry Cleaning Boy at Hewes & Associates 1 episode 2015–2018 Clarence Jim Reese, additional voices 18 episodes 2016–2017 Creative Galaxy Chef Zesty 5 episodes Video games Year Title Role Notes 2013 Grand Theft Auto V Actor Uncredited 2015 Lego Jurassic World Additional voices 2015 Lego Dimensions Additional Voices 2015 Star Wars: The Old Republic - Knights of the Fallen Empire Additional voices 2015 Halo 5: Guardians Additional voices 2017 Horizon Zero Dawn Gildun 2017 Minecraft: Story Mode - Season 2 Warden 2017 Horizon Zero Dawn: The Frozen Wilds Gildun 2018 God of War Additional Voices Shorts Year Title Role 2012 Beyond Belief Shaina's Dad 2013 Awake Eddie 2015 Clarence Shorts: Big Boy Mr. Reese (voice) Videos Year Title Role 1996 Dr. Ice Waiter 2002 Blue's Clues: It's Joe Time Joe 2002 Blue's Clues: Meet Joe! Joe 2003 Blue's Clues: 100th Episode Celebration Joe 2003 Blue's Clues: Blue's Big Band Joe 2003 Blue's Clues: Get to Know Joe Joe 2003 Blue's Clues: Shapes and Colors Joe 2003 Blue's Clues: Blue Takes You to School Joe 2003 Blue's Clues: Blue's First Holiday Joe 2004 Blue's Clues: Blue Talks Joe 2004 Blue's Room: Snacktime Playdate Joe (Blue's Wishes) 2004 Blue's Clues: Bluestock Joe 2005 Blue's Room: It's Hug Day Joe (Joe's Clues) 2005 Blue's Room: Beyond Your Wildest Dreams Joe (Playdates) 2005 Blue's Room: Alphabet Power Joe (The Alphabet Train) 2005 Blue's Room: Holiday Wishes Joe 2006 Blue's Room: Fred's Birthday Joe (The Fairy Tale Ball) 2006 Blue's Clues: Blue's Jobs Joe (2 episodes) 2006 Blue's Clues: Blue's Biggest Stories Joe (3 episodes) 2006 Blue's Room: Meet Blue's Baby Brother! Joe 2007 Blue's Room: Knights of the Snack Table Joe 2007 Blue's Room: Shape Detectives Joe 2007 Blue's Room: Little Blue Riding Hood Joe 2007 Blue's Room: World Travelers Joe ==References== Category:1978 births Category:Living people Category:American voice actors Category:People from Guam",
 "title": "Donovan Patton"
}