{
 "id": "262536",
 "text": "Alexandra David-Néel (full name Louise Eugénie Alexandrine Marie David) born in Saint-Mandé, Val-de-Marne on 24 October 1868, and died in Digne-les-Bains, on 8 September 1969. She was a Belgian-French explorer. ==Career== *1898 Pour la vie *1911 Le modernisme bouddhiste et le bouddhisme du Bouddha *1927 Voyage d'une Parisienne à Lhassa (1927, My Journey to Lhasa) *1929 Mystiques et Magiciens du Tibet (1929, Magic and Mystery in Tibet) *1930 Initiations Lamaïques (Initiations and Initiates in Tibet) *1931 La vie Surhumaine de Guésar de Ling le Héros Thibétain (The Superhuman Life of Gesar of Ling) *1933 Grand Tibet; Au pays des brigands-gentilshommes *1935 Le lama au cinq sagesses *1938 Magie d'amour et magic noire; Scènes du Tibet inconnu (Tibetan Tale of Love and Magic) *1939 Buddhism: Its Doctrines and Its Methods *1940 Sous des nuées d'orage; Recit de voyage *1949 Au coeur des Himalayas; Le Nepal *1951 Ashtavakra Gita; Discours sur le Vedanta Advaita *1951 Les Enseignements Secrets des Bouddhistes Tibétains (The Secret Oral Teachings in Tibetan Buddhist Sects) *1951 L'Inde hier, aujourd'hui, demain *1952 Textes tibétains inédits *1953 Le vieux Tibet face à la Chine nouvelle *1954 La puissance de néant, by Lama Yongden (The Power of Nothingness) *Grammaire de la langue tibetaine parlée *1958 Avadhuta Gita *1958 La connaissance transcendente *1961 Immortalite et reincarnation: Doctrines et pratiques en Chine, au Tibet, dans l'Inde *L'Inde où j'ai vecu; Avant et après l'independence *1964 Quarante siècles d'expansion chinoise *1970 En Chine: L'amour universe! et l'individualisme integral: les maitres Mo Tse et Yang Tchou *1972 Le sortilège du mystère; Faits étranges et gens bizarre rencontrés au long de mes routes d'orient et d'occident *1975 Vivre au Tibet; Cuisine, traditions et images *1975 Journal de voyage; Lettres à son Mari, 11 août 1904 - 27 decembre 1917. Vol. 1. Ed. Marie-Madeleine Peyronnet *1976 Journal de voyage; Lettres à son Mari, 14 janvier 1918 - 31 decembre 1940. Vol. 2. Ed. Marie-Madeleine Peyronnet *1979 Le Tibet d'Alexandra David-Neel *1981 Secret Oral Teachings in Tibetan Buddhist Sects *1986 La lampe de sagesse ==Books== *The Secret Lives of Alexandra David-Neel - A Biography of the Explorer of Tibet and Its Forbidden Practices, Barbara and Michael Foster. ; American edition under the title Forbidden Journey - The Life of Alexandra David-Neel, . This book is based on extensive interviews with David Neel's secretary at Digne and reading her letters to her husband, now published as \"Journal de voyage: lettres a son mari.\" *Alexandra David-Neel, Ruth Middleton, Boston, Shambhala, 1989. . * Norwick, Braham. (1976). \"Alexandra David-Neel's Adventures in Tibet: Fact or Fiction?\". The Tibet Journal. Vol. 1, Nos. 3 & 4\\. Autumn 1976, pp. 70–74. ==Other websites== *Official web site *A Mystic in Tibet - Alexandra David- Neel *Alexandra David Neel in Upasika (spanish) Category:1868 births Category:1969 deaths",
 "title": "Alexandra David-Néel"
}