{
 "id": "262879",
 "text": "St Kilda is a small archipelago of Hebridean islands. It is northwest of the coast of Scotland. The islands are a UNESCO World Heritage Site.UNESCO, \"St Kilda\"; retrieved 2012-4-20. St Kilda has large seabird colonies. The island has the largest colony of North Atlantic gannets in the world.National Trust for Scotland (National Trust), \"Marine Environment gains World Heritage Protection,\" 2 July 2004; retrieved 2012-4-20. ==History== It is known that people have lived on St Kilda for over 2000 years. The entire population was evacuated from the island in 1930. St Kilda was given to the National Trust for Scotland in 1957. In the 21st century, the only year-round residents are defence personnel. Many conservation workers, volunteers and scientists spend time on the islands in the summer months.\"The new residents of St Kilda archipelago\". (29 August 2010). BBC News. Retrieved 29 August 2010. ==National Nature Reserve== St Kilda became a National Nature Reserves (NNR) in 1957. It is one of 71 NNRs in Scotland. In 2004, the NNR was expanded. The nearby marine features were added. The islands were also added. In July 2005, it became one of the few World Heritage Sites to have a \"mixed\" status for its natural and cultural qualities.National Trust, \"Dual World Heritage Status For Unique Scottish Islands,\" 14 July 2005; retrieved 2012-4-20. They are also a National Scenic Area. ==Gallery== File:Saint Kilda 20090611 Hirta - Village Bay overview.jpg|Hirta, Village Bay File:A Cleit On St Kilda - geograph.org.uk - 1379478.jpg|St Kilda cleits were small, turf-covered dry-stone structures used for storage File:Sheep enclosure, St Kilda - geograph.org.uk - 229754.jpg|St Kilda sheep enclosure File:St-Kildans.jpg|St Kildans sitting on the village street, 1886 File:St kilda inhabitants.jpg|At the foot of the cliffs, Borrera, 1898 File:St Kilda puffins hunting.jpg|Catching puffins on St Kilda, 1898 == Related pages == *List of World Heritage Sites of the United Kingdom == References == ==Other websites== * St Kilda website Category:Inner and Outer Hebrides Category:World Heritage Sites in the United Kingdom Category:Biosphere reserves Category:Uninhabited regions",
 "title": "St Kilda"
}