{
 "id": "262816",
 "text": "Heart of Neolithic Orkney refers to a group of Neolithic monuments found on Mainland, one of the islands of Orkney, Scotland. The name was adopted by UNESCO when it proclaimed these sites as a World Heritage Site in 1999.UNESCO, \"Heart of Neolithic Orkney\". Retrieved 2012-4-19. There are five sites on Mainland: # Skara Brae – a cluster of ten houses making up Northern Europe’s best-preserved Neolithic village.\"Skara Brae Prehistoric Village\" Historic Scotland. Retrieved 16 August 2009. # Ring of Brodgar – a stone circle 104 metres in diameter, originally composed of 60 stones set within a circular ditch up to 3 metres deep and 10 metres wide, forming a henge monument. It has been estimated that the structure took 80,000 man-hours to construct.\" The Ring o' Brodgar, Stenness\" . Orkneyjar. Retrieved 16 September 2008.Wickham- Jones, Caroline 2007. Orkney: a historical guide. Edinburgh: Birlinn, 28–29. # Standing stones of Stenness – the four remaining megaliths of a henge, the largest of which is 6 metres (19 ft) high.\"The Standing Stones o' Stenness\" . Orkneyjar. Retrieved 16 September 2008. # Ness of Brodgar is an archaeological site between the Ring of Brodgar and the Stones of Stenness that has provided evidence of housing, decorated stone slabs, a massive stone wall with foundations, and a large building described as a Neolithic 'cathedral'.Towrie, Sigurd (16 August 2007) \"Stone wall hints at Neolithic spiritual barrier\"Orkneyjar. Retrieved 17 September 2008. Ross, John and Hartley, David (14 August 2009) \" 'Cathedral' as old as Stonehenge unearthed.\" Edinburgh. The Scotsman. Retrieved 16 August 2009. # Maeshowe – a unique chambered cairn and passage grave, aligned so that its central chamber is illuminated on the winter solstice. It was looted by Vikings who left one of the largest collection of runic inscriptions in the world.\"Maeshowe\" . Orkneyjar. Retrieved 11 February 2008.BBC program: { == Related pages == * List of World Heritage Sites of the United Kingdom == References == Category:Buildings and structures in Scotland Category:World Heritage Sites in the United Kingdom Category:Neolithic Category:Prehistoric buildings and structures on Orkney",
 "title": "Heart of Neolithic Orkney"
}