{
 "id": "262970",
 "text": "Jean Cocteau (Jean Maurice Eugène Clément Cocteau, 5 July 1889 – 11 October 1963) was a French artist, poet, novelist, dramatist, designer, playwright, moviemaker and actor. Cocteau wrote or worked on 21 stage performances, some of which were ballets, and some were plays. Cocteau's movies, most of which he both wrote and directed, were particularly important in introducing the avant- garde into French cinema and influenced the upcoming French New Wave genre. He also worked with Pablo Picasso on several projects and was friends with most of the European art community. In all his creative work, he was a modernist. In 1955, Cocteau was made a member of the Académie Française and The Royal Academy of Belgium. During his life Cocteau was made a Commander of the Légion d'honneur. == Life == Cocteau was bisexual.Rick Norton 2012. Cocteau's White Paper on homophobia. His circle of associates, friends and lovers included Pablo Picasso, Jean Hugo, Jean Marais, Henri Bernstein, Marlene Dietrich, Coco Chanel, Erik Satie, María Félix, Édith Piaf (whom he cast in one of his one- act plays entitled Le Bel Indifferent in 1940), and Raymond Radiguet. In the 1930s, Cocteau had an affair with Princess Natalie Paley, the beautiful daughter of a Romanov grand duke. She became pregnant. To Cocteau's distress and Paley's life-long regret, the foetus was aborted.Jean-Noël Liaut 1996. Natalie Paley: La princesse dechirée. Paris: Filipacchi. Cocteau's longest- lasting relationships were with the French actors Jean Marais (who played 'tough guy' roles in movies and TV),Jean Marais (1913-1998) (in French) and Édouard Dermit, whom Cocteau formally adopted. Cocteau cast Marais in four of his movies. At times, Cocteau was addicted to opium.Cocteau, Jean 1958. Opium: the diary of a cure. Transl. Margaret Crosland and Sinclair Road. Grove Press, New York. Biographer James S. Williams describes Cocteau's politics as \"naturally right-leaning\".p123 In his diary, Cocteau accused France of disrespect towards Hitler and speculated on the Führer's sexuality. His views became known, and he was arraigned on charges of collaboration after the war. He was cleared of any wrongdoing: it turned out that he had used his contacts to try and save friends from the Nazis.p182 Cocteau died of a heart attack in Milly-la-Foret, Essonne. == Work == === Theatre and ballet === Cocteau wrote or worked on 21 stage performances, some of which were ballets, and some were plays. He was involved in Diaghilev's Ballets Russes from the first season in Paris, 1909. He wrote scenarios (librettos) for Fokine's Le Dieu Blue in 1912, Massine's Parade in 1917 and Nijinska's Le Train Bleu in 1924. He also design company posters, and worked for several other ballet companies. He wrote many articles on dance, and made sketches of many in Diaghilev's circle.Crane, Debra & Mackrell, Judith 2002. The Oxford dictionary of dance. Oxford University Press, Oxford. In 1940, Le Bel Indifférent, Cocteau's play written for and starring Édith Piaf, was enormously successful. === Film === Cocteau directed eleven movies in avant-gard style, wrote scripts for six movies and dialogue for three, and directed the photography for one more. Some of his most well-known were Blood of a Poet (1930), Les Parents terribles (1948), and Orpheus (1949). === Writing === Cocteau wrote extensively. including poetry. All of it is in French, but some is available in translation. Cocteau wrote five novels. The most important of these was probably Les Enfants terribles (1929). He also published 23 books or pamphlets of original poetry, and 26 volumes of poetic criticism and collections. He illustrated 12 works of poetry. He made a number of recordings, mostly spoken poems. == References == == Further reading == *Steegmuller, Francis 1970. Cocteau: a biography. Atlantic-Little, Brown, Boston. *Brown, Frederick. An impersonation of Angels: a biography of Jean Cocteau, The Viking Press, New York. *Tsakiridou, Cornelia A. ed. 1997. Reviewing Orpheus: essays on the cinema and art of Jean Cocteau. Lewisburg PA: Bucknell University Press. == Other websites == * Category:1889 births Category:1963 deaths Category:Bisexual people Category:Deaths from myocardial infarction Category:French artists Category:French LGBT people Category:French movie actors Category:French movie directors Category:French novelists Category:French poets Category:French playwrights Category:French screenwriters Category:LGBT actors Category:LGBT artists Category:LGBT directors Category:LGBT novelists Category:LGBT poets Category:LGBT playwrights Category:LGBT screenwriters Category:Librettists Category:Members of the Académie française",
 "title": "Jean Cocteau"
}