{
 "id": "263062",
 "text": "Kansas City is the third-largest city in the U.S. state of Kansas. It is the county seat of Wyandotte County. Kansas City is a suburb of Kansas City, Missouri and is the third largest city in the Kansas City Metropolitan Area. About two million people live in this region. The city is part of the \"Unified Government\". This also includes the cities of Bonner Springs and Edwardsville. As of the 2020 census, the city population was 156,607. The city is at Kaw Point, which is the junction of the Missouri and Kansas rivers. ==History== Kansas City formed in 1868. It was first officially mentioned in October 1872. The Kansas-Missouri border area became the first battlefield in the conflict over slavery that led to the American Civil War. The first city election was held on October 22, 1872. It resulted in the election of Mayor James Boyle. The mayors of the city after its organization have been James Boyle, C. A. Eidemiller, A. S. Orbison, Eli Teed and Samuel McConnell. John Sheehan was appointed Marshal in 1875. He was also Chief of Police. He had the control over five policemen. In June 1880, the Governor of Kansas made the city of Kansas City a city of the second class with the Mayor Samuel McConnell present. James E. Porter was Mayor in 1910. It was one of the 100 largest cities for many US Census counts, from 1890 to 1960, including 1920, when it had over 100,000 residents for the first time.https://www.census.gov/population/www/documentation/twps0027/tab15.txt In 1997, voters approved a proposition to unify the city and county governments. On March 30, 2011, Internet search company Google Inc. announced that Kansas City had been selected as the site of an experimental fiber-optic network that Google will build at no cost to the city. Kansas City was chosen from a field of 1,100 US communities that had applied for the network. Google plans to have the network in operation by 2012.http://www.boston.com/business/ticker/2011/03/sorry_boston_go.html ==Government== ;Mayor/CEO * Joe Reardon ;Board of Commissioners * At-Large District 1, Mayor Pro Tem, Rev Mark Holland * At-Large District 2, John J. Mendez * District 1, Nathaniel Barnes * District 2, William J (Bill) Miller * District 3, Ann Brandau-Murguia * District 4, Mark Mitchell * District 5, Mike Kane * District 6, Particia Huggins Pettey * District 7, Thomas R. Cooley * District 8, Benoyd M. Ellison ==Geography== According to the United States Census Bureau, the city has a total area of 128.3 sq mi (332.3 km2). 124.7 sq mi (323.1 km2) of it is land and 3.6 sq mi (9.2 km2) of it is water. ===Cityscape=== Kansas City is organized into a system of neighborhoods, some with histories as independent cities or the sites of major events. Neighborhoods of Kansas City, Kansas * Downtown Kansas City, Kansas * Argentine, former home to the silver smeltery for which it was named. * Armourdale, formerly a city, consolidated with the city of Kansas City in 1886. * Armstrong, a town absorbed by Wyandotte. * Bethel * Fairfax District, an industrial area along the Missouri River. * Muncie * Maywood * Nearman * Piper * Pomeroy, late 1800s-early 1900s Train Depot, Trading Post, Saw Mill, and river landing for barges to load-unload. * Rosedale * Stoney Point * Strawberry Hill * Turner, community around the Wyandotte-Johnson County border to the Kansas River north-south, and from I-635 to I-435 east-west. * Vinewood * Wolcott * Welborn ====Parks and parkways==== * City Park * Wyandotte County Park * Wyandotte County Lake Park ==Climate== Kansas City is near \"Tornado Alley\", a region where cold air from the Rocky Mountains and Canada meets warm air from the Gulf of Mexico. This situation causes the formation of powerful storms. The most recent tornado to strike Kansas City itself was in May 2003. The region is also prone to ice storms, such as the 2002 ice storm during which hundreds of thousands lost power for days and (in some cases) weeks.KC powerless as icy barrage pummels the area, leaves behind disaster zone, Accessed 10 September 2006. The MoKan area was subject to flooding, including the Great Flood of 1993 and the Great Flood of 1951. Source: U.S. National Climatic Data Center, Asheville, North Carolina. {| border=0 cellspacing=1 cellpadding=0 style=\"color:#000000; background-color:#ffffff; text-align:right; width:100%;\" Month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Average high 41 43 54 66 75 84 90 88 80 69 54 42 Average low 21 25 34 46 56 66 71 69 61 49 36 26 Warmest 75 81 91 95 103 108 112 113 109 98 83 74 Coldest −20 −21 −10 12 27 42 51 43 31 17 1 −23 Average dew point 18 23 29 41 53 62 66 64 56 44 32 24 Average precipitation 1.3 1.3 2.5 3.3 4.5 4.8 3.7 3.9 4.3 3.0 1.9 1.5 ==People== Demographic profile 2020 2010 1990 1970 1950 White 41.0% 52.2% 65.0% 78.9% 79.4% —Non-Hispanic 34.5% 40.2% 61.9% 76.3%From 15% sample N/A Black or African American 21.5% 26.8% 15.8% 10.7% 9.9% Hispanic or Latino (of any race) 34.6% 27.8% 7.1% 3.2% N/A Asian 4.8% 2.7% 1.2% 0.1% − As with Kansas City, Missouri, the percentage of the city's biggest ethnic group, non- Hispanic whites, has gone down from 76.3% in 1970 to 40.2% in 2010. ==Educational institutions== ===Colleges and universities=== ====Private==== * Donnelly College * University of Saint Mary ====Public==== * Kansas City Kansas Community College * University of Kansas Medical Center (Home of KU's Schools of Medicine, Nursing and Allied Health) ===Public and private school districts=== * Kansas City Kansas Public Schools * Piper Unified School District #203 * Turner Unified School District #202 * Archdiocese of Kansas City in Kansas Catholic Schools ===Secondary schools=== * Bishop Ward High School, Kansas City * Fairfax Learning Center * J. C. Harmon High School * Kansas City Kansas Community College: Technical Education Center (Formerly Kansas City Kansas Area Technical School, merged with Kansas City Kansas Community College in 2008) * Piper High School, Kansas City (Piper, Kansas) * F.L. Schlagle High School, Kansas City * Kansas State School for the Blind, Kansas City * Sumner Academy of Arts & Science, Kansas City * Turner High School, Kansas City (Turner, Kansas) * Washington High School, Kansas City * Wyandotte High School, Kansas City ==Crime== ==Sister cities== Kansas City has four sister cities, as designated by Sister Cities International: * Linz, Austria * Karlovac, Croatia * Limerick, Ireland * Uruapan, Michoacan, Mexico ==References== ==Other websites== * Unified Government of Wyandotte County/Kansas City, Kansas * Kansas City, KS/Wyandotte County Convention and Visitors Bureau * Kansas City, Kansas Public Libraries Category:County seats in Kansas Category:1868 establishments in Kansas",
 "title": "Kansas City, Kansas"
}