{
 "id": "263202",
 "text": "Gordini is a French sports car manufacturer. The firm was founded by Amédée Gordini. His nickname was \"Le Sorcier\", which means \"The Sorcerer\". Gordini competed in Formula One from 1950 to 1956. Gordini worked with Renault as an engine tuner. He sold his firm to Renault. Renault entered Renault-Gordini cars at the 24 Hours of Le Mans from 1962 until 1969. Renault build sport versions of some models like the Dauphine, Renault 8, and Renault 12. They included the Gordini badge. In November 2009, Renault announced that it will bring back the Gordini name. It will be used on a line of hot hatches (sports compacts). == Formula One results == === As a works (factory) team === (key) (results in bold indicate pole position) (results in italics indicate fastest lap) Year Chassis Engine Driver 1 2 3 4 5 6 7 8 9 Simca Gordini Type 15 Gordini L4 GBR MON 500 SUI BEL FRA ITA Robert Manzon Ret 4 Ret Maurice Trintignant Ret Ret Simca Gordini Type 15 Gordini L4 SUI 500 BEL FRA GBR GER ITA ESP André Simon Ret Ret 6 Ret Robert Manzon Ret 7 Ret 9 Maurice Trintignant Ret Ret Ret Ret Aldo Gordini Ret Gordini Type 16 Gordini L6 SUI 500 BEL FRA GBR GER NED ITA Robert Manzon Ret 3 4 Ret Ret 5 14 Jean Behra 3 Ret 7 5 Ret Ret Johnny Claes 8 Prince Bira Ret 11 Maurice Trintignant Ret Ret 6 Ret Simca Gordini Type 15 Simca L4 Max de Terra Ret Gordini L4 Prince Bira Ret 10 Johnny Claes Ret 14 DNQ Robert O'Brien NC Maurice Trintignant 5 Paul Frère Ret Gordini Type 16 Gordini L6 ARG 500 NED BEL FRA GBR GER SUI ITA Jean Behra 6 Ret 10 Ret Ret Ret Maurice Trintignant 7† 6 5 Ret Ret Ret Ret 5 Harry Schell 7† Ret 7 Ret Ret Ret 9 Robert Manzon Ret Carlos Menditeguy Ret Roberto Mieres NC Ret 6 Fred Wacker 9 Simca Gordini Type 15 Gordini L4 Pablo Birger Ret Georges Berger Ret Gordini Type 16 Gordini L6 ARG 500 BEL FRA GBR GER SUI ITA ESP Jean Behra DSQ Ret 6 Ret 10 Ret Ret Ret Élie Bayol 5 Roger Loyer Ret Paul Frère Ret Ret Ret André Pilette 5 9 Ret Jacques Pollet Ret Georges Berger Ret Clemar Bucci Ret Ret Ret Ret Fred Wacker Ret 6 Gordini Type 16 Gordini L6 ARG MON 500 BEL NED GBR ITA Élie Bayol Ret Ret Jesus Iglesias Ret Pablo Birger Ret Robert Manzon Ret Ret Ret Jacques Pollet 7 10 Ret Hernando da Silva Ramos 8 Ret Ret Mike Sparken 7 Jean Lucas Ret Gordini Type 32 Gordini L8 ARG MON 500 BEL FRA GBR GER ITA André Pilette 6† DNS Élie Bayol 6† Robert Manzon 9 9 Ret Ret Hernando da Silva Ramos 8 Ret Ret Andre Milhoux Ret Gordini Type 16 Gordini L6 Hernando da Silva Ramos 5 Robert Manzon Ret André Pilette 11 André Simon 9 († indicates shared drive) === As an engine supplier === (key) (results in bold indicate pole position) Year Chassis Engine Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 Points WCC Renault RS01 Renault- Gordini EF1 1.5 L V6 T ARG BRA RSA USW ESP MON BEL SWE FRA GBR GER AUT NED ITA USA CAN JPN 0 NC Jean-Pierre Jabouille Ret Ret Ret Ret DNQ Renault RS01 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW MON BEL ESP SWE FRA GBR GER AUT NED ITA USA CAN 3 12th Jean-Pierre Jabouille Ret Ret 10 NC 13 Ret Ret Ret Ret Ret Ret Ret 4 12 Renault RS01 * * * Renault RS10 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW ESP BEL MON FRA GBR GER AUT NED ITA CAN USA 26 6th Jean-Pierre Jabouille Ret 10 Ret Ret Ret NC 1 Ret Ret Ret Ret 14 Ret Ret René Arnoux Ret Ret Ret WD 9 Ret Ret 3 2 Ret 6 Ret Ret Ret 2 Renault RE20 Renault-Gordini EF1 1.5 L V6 T ARG BRA RSA USW BEL MON FRA GBR GER AUT NED ITA CAN USA 38 4th Jean-Pierre Jabouille Ret Ret Ret 10 Ret Ret Ret Ret Ret 1 Ret Ret Ret René Arnoux Ret 1 1 9 4 Ret 5 NC Ret 9 2 10 Ret 7 Renault RE20B * * * Renault RE30 Renault-Gordini EF1 1.5 L V6 T USW BRA ARG SMR BEL MON ESP FRA GBR GER AUT NED ITA CAN CPL 54 3rd Alain Prost Ret Ret 3 Ret Ret Ret Ret 1 Ret 2 Ret 1 1 Ret 2 René Arnoux 8 Ret 5 8 DNQ Ret 9 4 9 13 2 Ret Ret Ret Ret Renault RE30B Renault-Gordini EF1 1.5 L V6 T RSA BRA USW SMR BEL MON DET CAN NED GBR FRA GER AUT SUI ITA CPL 62 3rd Alain Prost 1 1 Ret Ret Ret 7 NC Ret Ret 6 2 Ret 8 2 Ret 4 René Arnoux 3 Ret Ret Ret Ret Ret 10 Ret Ret Ret 1 2 Ret 16 1 Ret Renault RE30C * * * Renault RE40 Renault-Gordini EF1 1.5 L V6 T BRA USW FRA SMR MON BEL DET CAN GBR GER AUT NED ITA EUR RSA 79 2nd Alain Prost 7 11 1 2 3 1 8 5 1 4 1 Ret Ret 2 Ret Eddie Cheever Ret Ret 3 Ret Ret 3 Ret 2 Ret Ret 4 Ret 3 10 6 Renault RE50 Renault-Gordini EF4 1.5 L V6 T BRA RSA BEL SMR FRA MON CAN DET DAL GBR GER AUT NED ITA EUR POR 34 5th Patrick Tambay 5 Ret 7 Ret 2 Ret Ret Ret 8 5 Ret 6 Ret Ret 7 Derek Warwick Ret 3 2 4 Ret Ret Ret Ret Ret 2 3 Ret Ret Ret 11 Ret Philippe Streiff Ret Renault RE60 * * * Renault RE60B Renault-Gordini EF4B 1.5 L V6 T * * * Renault EF15 1.5 L V6 T BRA POR SMR MON CAN DET FRA GBR GER AUT NED ITA BEL EUR RSA AUS 16 7th Patrick Tambay 5 3 3 Ret 7 Ret 6 Ret Ret 10 Ret 7 Ret 12 WD Ret Derek Warwick 10 7 10 5 Ret Ret 7 5 Ret Ret Ret Ret 6 Ret WD Ret François Hesnault Ret == References == Category:Formula One constructors Category:Formula One engine manufacturers",
 "title": "Gordini"
}