{
 "id": "263393",
 "text": "Saint Xavier High School ( ), or simply St. X, is a private, all-boys high school near Cincinnati, Ohio, United States. The school is one of four all- boys Catholic high schools in the Archdiocese of Cincinnati, but it is run by the Society of Jesus (Jesuits) instead of the archdiocese. St. Xavier has 1,535 students, making it the largest private high school in Ohio and one of the 100 largest high schools in that state. St. Xavier is the oldest high school in the Cincinnati area and one of the oldest in the nation, even older than many universities. It started as the Athenaeum, which opened in 1831 in downtown Cincinnati. From 1869 to 1934, the high school was part of St. Xavier College, which is now called Xavier University. In 1960, the high school moved to its current location on a campus. The \"Bombers\" football team and \"Aquabombers\" swimming and diving team are ranked nationally and often compete at state championships. ==Famous people from St. Xavier== ===Graduates=== Arts and literature: *John Diehl (1968) – actor *Joey Kern (1995) – movie actor *David Quammen (1966) – writer about science Politics: *Jim Bunning (1949) – Republican in the U.S. Senate representing Kentucky; also a baseball player in the Hall of Fame *John J. Gilligan (1939) – Democratic governor of Ohio; father of Kathleen Sebelius, the U.S. Health and Human Services Secretary *Charles H. Keating Jr. (d. 2014) – lawyer and banker who was convicted of fraud as one of the \"Keating Five\" in the 1989 Savings and Loan scandal *William J. Keating (d. 2020) – businessman and Republican in the U.S. House of Representatives representing Ohio *Bill Kraus (1965) – activist for gay rights and for people with AIDS *Brad Wenstrup (1976) – Republican in the U.S. House of Representatives representing Ohio Sports: *Jayme Cramer (2001) – swimmer who won the bronze medal at the 2003 Pan American Games and the silver medal at the 2006 FINA Short Course World Championships *Joe Hudepohl (1992) – swimmer who won the gold medal at the 1992 and 1996 Olympic Games *Pat Todd (1998) – rower in the semifinals at the 2004 and 2008 Summer Olympics The graduates of St. Xavier include many professional athletes, three Olympians, state and national politicians, and well-known authors and actors. ===Others=== St. Xavier gave an honorary degree to Nick Clooney, a television news reporter, game show host, and politician who would have graduated in 1952. In 1985, Urban Meyer worked as a football coach at St. Xavier. Later, he was the head football coach at the University of Utah, Bowling Green State University, and the University of Florida. ==Sources== ==Books== * ==Related pages== *Elder High School *La Salle High School *Moeller High School ==Other websites== *St. Xavier High School ** ** *The St. Xavier Blueprint – the school newspaper Category:Cincinnati Category:Schools in Ohio Category:1831 establishments in Ohio Category:High schools in the United States",
 "title": "St. Xavier High School (Ohio)"
}