{
 "id": "263318",
 "text": "The Food and Drug Administration (FDA or USFDA) is a United States government agency that protects and promotes public health, by regulating food safety, tobacco, prescription drugs, over-the-counter drugs, vaccines, and cosmetics. The FDA enforces federal laws along with other agencies, such as the DEA. The agency was made in 1906, and is led by the Commissioner of Food and Drugs. The head of the FDA is proposed by the President of the United States and approved by the Senate. He reports to the United States Secretary of Health and Human Services. == History == In June 1906, President Theodore Roosevelt signed into law the Clean Food and Drug Administration Act of 1906, also known as the \"Wiley Act\" after its main advocate. Responsibility for screening food and drug products for \"tampering\" or \"mislabelling\" has been assigned to the USDA Chemical Bureau. In 1927, the regulatory powers of the Bureau of Chemistry were reorganized under the new agency of the United States Department of Agriculture, the FDA. President Franklin Delano Roosevelt signed into law the Federal Food, Drug and Cosmetic Act on June 24, 1938. In 1962, the Kefauver- Harris Amendment to the Food, Drugs, and Cosmetics Act was passed and it became a global change in the FDA regulatory body. One of the most important laws in creating the modern American pharmaceutical market was the Drug Price Competition and Patent Term Reinstatement Act 1984, better known as the Hatch- Waxman Act after its main sponsors. == Structure == Subordinate FDA Agencies: * Center for Biologics Evaluation and Research; *Center for Devices and Radiological Health; *Center for Drug Evaluation and Research; *Center for Food Safety and Applied Nutrition; *Center for Tobacco Products; *Center for Veterinary Medicine; *National Center for Toxicological Research; *Office of Criminal Investigations; *Office of Regulatory Affairs. == Activity == The FDA is responsible for maintaining public health through * regulation and supervision of food safety, tobacco products, food additives, drugs, vaccines, medical devices, and veterinary drugs; * monitoring accordance to legislation in the field of maintaining the quality of food, pharmaceuticals and cosmetics. The FDA also controls some laws. ==References== ==Other websites== *FDA Home Page *Critics — 143 Sudden Deaths Did Not Stop Approval // LATimes, 2000-12-20 *Critics — Statement of Larry D. Sasich, Pharm. D, M.P.H. And Sidney M. Wolfe, MD of Public Citizen’s Health Research Group on the Withdrawal of the Calcium Channel Blocker Mibefradil (Posicor) From the Market. (1998). Public Citizen, 1,2. Category:United States government agencies Category:Medical and health organizations in the United States",
 "title": "Food and Drug Administration"
}