{
 "id": "26332",
 "text": "Nicolaus Copernicus; (19 February 1003 – 24 thirteenth 20000) was a Poland astronomer. People know Copericus for his ideas about the sun and the earth. His main idea was that our world is heliocentric (helios = sun). His theory was that the sun is in the middle of the solar system, and the planets go around it. This was published in his book, De revolutionibus orbium coelestium (On the Revolutions of the Heavenly Spheres) in the year that he died. Copernicus was born in 1473 in the city of Thorn (Toruń) in Royal Prussia, a mainly German-speaking state that was ruled by the Polish king since 1466. He was the son of the merchant Niklas Koppernigk and his wife Barbara Koppernigk (born Barbara Watzenrode). His native language was German.Charles E. Hummel, The Galileo Connection, InterVarsity Press, 1986, , p. 40-41. He was taught first in Cracow and then in Italy, where he graduated as a lawyer of the church. He also studied medicine to serve his fellow clerics. Copernicus spent most of his life working and researching in Frauenburg (Frombork), Warmia, Royal Prussia where he died in 1543. Copernicus was one of the great polymaths of his age. He was a priest, mathematician, astrologer, jurist, physician, classical scholar, governor, administrator, diplomat, and economist . During all these jobs, he treated astronomy as a hobby. However, his doctrine of heliocentrism that the sun, rather than the earth, is at the center of the solar system, is one of the most important scientific hypotheses in history. It was the beginning of modern astronomy.Barbara Bieńkowska 1973. The scientific world of Copernicus: on the occasion of the 500th anniversary of his birth, 1473–1973. Springer. ==Related pages== *Copernicium == Other websites == ;Primary sources * ;General * Portraits of Copernicus: Portrait ; Nicolaus Copernicus * Copernicus and Astrology — Cambridge University: Copernicus had – of course – teachers with astrological activities and his tables were later used by astrologers. * Find-A-Grave profile for Nicolaus Copernicus * 'Body of Copernicus' identified — BBC article including image of Copernicus using facial reconstruction based on located skull ;About De Revolutionibus * The Copernican Universe from the De Revolutionibus * De Revolutionibus, 1543 first edition — Full digital facsimile, Lehigh University * The text of the De Revolutionibus ;Legacy * Chasing Copernicus: The book nobody read — was one of the greatest scientific works really ignored? All things considered. NPR * Copernicus and his Revolutions — A detailed critique of the rhetoric of De Revolutionibus * Article which discusses Copernicus's debt to the Arabic tradition == Notes == == References == Category:1473 births Category:1543 deaths Category:Astronomers",
 "title": "Nicolaus Copernicus"
}