{
 "id": "263429",
 "text": "Variations on a Rococo Theme is a piece of music for cello and orchestra composed by Pyotr Ilyich Tchaikovsky. It is one of the most popular pieces of music for cello and orchestra. Tchaikovsky never composed a cello concerto, but he did write this work, which is a tune with a set of variations. It is called \"Rococo\" because the music is based on the style that was popular in the late 18th century, the period during the Classical period known as Rococo, the time of composers such as Mozart. The main theme is an original theme by Tchaikovsky, not a theme that had been composed by someone else in the 18th century. Tchaikovsky wrote this piece for Wilhelm Fitzenhagen to play. He was a German cellist who lived in Russia. Like Tchaikovsky, he was a professor at the Moscow Conservatory. Fitzenhagen gave the first performance of the work in Moscow on 30 November 1877. Nikolai Rubinstein was the conductor. ==Fitzhagen makes changes to the piece== What happened to the work after that first performance is an interesting story. Tchaikovsky himself had not been at the first performance because he was in Switzerland trying to calm himself down after a very short, disastrous marriage. He wanted to prepare the work so that it could be published. He sent Fitzhagen a short score (this is similar to an arrangement for the piano). He asked Fitzhagen to make any necessary changes to the cello part. Meanwhile, Tchaikovsky got on with the job of orchestrating the music (showing exactly what is played by each instrument). However, Fitzhagen did not only make changes to the solo cello part. He made other changes as well. He left one of the variations out, and changed the order of some of the others. When the music was about to be published, Tchaikovsky saw what Fitzhagen had done. Tchaikovsky was very cross, but he decided to let the publishers print it like that anyway. When it was published there was nothing in the score which said that Fitzhagen had made lots of changes. It was not until about 70 years later that people realized that Tchaikovsky’s original version had been different. Some cellists, such as Steven Isserlis, now choose to play Tchaikovsky’s original version. However, most cellists still prefer to play Fitzhagen’s version. It is hard to tell which one Tchaikovsky would have preferred. Maybe he let it be printed because he realized that Fitzhagen had improved it. We cannot tell. Musicians still argue about which version ought to be played. == Orchestration == The piece is written for an orchestra which is smaller than Tchaikovsky’s usual Romantic orchestral. It is like the ones from the time of Mozart. There are just two of each woodwind instrument, two horns, and strings. == Structure of the work == The piece, which is about 20 minutes long, consists of a theme and seven variations (eight in Tchaikovsky's original version). # Moderato assai quasi Andante - Thema: Moderato semplice #: After a short introduction we hear the main theme in A major played at first by the cello, and then by other instruments. # Var. I: Tempo della Thema #: The first variation is very graceful. We hear the theme in triplets. # Var. II: Tempo della Thema #: The second variation is a conversation between cello and orchestra. The soloist twice has a scale which rushes upwards. # Var. III: Andante sostenuto #: The third variation is very slow and beautiful. It is in C major. # Var. IV: Andante grazioso #: The fourth variation is back in A major. The tune is elegant and dance-like. # Var. V: Allegro moderato #: Ihe fifth variation the flute has the theme first. The viola adds several ornamental ideas. Then the music leads to a cadenza. # Var. VI: Andante #: The sixth variation is in D minor. This sounds dark in colour. The soloist has a conversation with the clarinet. # Var. VII e Coda: Allegro vivo #: After a short pause the music is back in A major. It is a fast, lively variation which ends in a big climax. The work is occasionally played by other solo instruments. Maxim Rysanov plays it on the viola. He played it at the Last Night of the Proms in 2010. ==References== * Brown, David, Tchaikovsky: The Crisis Years, 1874-1878, W.W. Norton & Co., 1983. . Category:Compositions by Pyotr Ilyich Tchaikovsky Category:Concertos Category:Variations (music)",
 "title": "Variations on a Rococo Theme"
}