{
 "id": "264075",
 "text": "The Wikiatlas or Wikimedia World (or Commons Atlas) is a wiki-portal on the Wikimedia Commons website, related to the English Wikipedia, Wikipedia App, Wikipedia Portal Atlas. It contains thousands of gallery pages and maps about many nations or regions of the world.\"1. Wikimedia Commons\", HowWikipediaWorks.com, 2008, webpage: HowW-ch16s01 . \"MapHist: A place to show off your maps\", Tony Campbell, email in mailman.geo.uu.nl, February 2008, webpage: [http://mailman.geo.uu.nl/pipermail/maphist/2008-February/011360.html pipermail-360]: mentions maps are available in the Wikimedia Atlas of the World. As a collection of map image-galleries, the Wikiatlas links many sets of maps, such as: : maps of Europe, maps of Africa, maps of North America, maps of Asia, maps of Oceania, Groups of Maps Groups of Maps Atlas of Europe Atlas of Africa Atlas of England Atlas of Italy Atlas of Mexico Atlas of Germany Atlas of Japan Atlas of the U.S. Atlas of Texas Atlas of California Atlas of Florida : maps of the U.S.A., of Italy, of Germany, of China, of Taiwan, plus maps of Texas, or maps of Malaysian, and maps of Florida, etc. Unlike Wikibooks or Wikisource, the Wikiatlas is not a separate wiki website, but rather, a large subset of the Wikimedia website. There are many thousands of maps in the WikiAtlas. Europe map in Wikiatlas England map Italy map ==Atlas pages are map groupings== The Wikiatlas is based on some simple ideas. All maps are grouped, in the manner of a World atlas, into pages stored with the name \"Atlas of...\" for each continent, such as: * Atlas of Europe * Atlas of Asia * Atlas of North America * Atlas of South America * Atlas of Africa * Atlas of Oceania Similar page titles \"Atlas of...\" cover each nation or region, such as: * Atlas of Argentina * Atlas of Austria * Atlas of Australia * Atlas of Bangladesh * Atlas of Belgium * Atlas of Brazil * Atlas of Canada * Atlas of China * Atlas of Taiwan * Atlas of Colombia * Atlas of Cuba * Atlas of Denmark * Atlas of Egypt * Atlas of England * Atlas of Ethiopeia * Atlas of Fiji * Atlas of Finland * Atlas of France * Atlas of Germany * Atlas of Greece * Atlas of India * Atlas of Ireland * Atlas of Israel * Atlas of Italy * Atlas of Japan * Atlas of Kenya * Atlas of S.Korea * Atlas of N.Zealand * Atlas of Norway * Atlas of Pakistan * Atlas of Peru * Atlas of Portugal * Atlas of Russia * Atlas of Spain * Atlas of Sudan * Atlas of Sweden * Atlas of Switzerland * Atlas of Turkey * Atlas of Ukraine * Atlas of UK * Atlas of USA * Atlas of Vanuatu * Atlas of Venezuela * Atlas of Wales Some of the U.S. states also have Wikiatlas pages, such as: * Atlas of Alabama * Atlas of California * Atlas of Florida * Atlas of Texas Similarly, hundreds of other Wikiatlas pages are named as \"Atlas of...\" for over 200 nations and over 94 other regions of the World. ==Wikiatlas page format== Many pages in the Wikiatlas are arranged in a distinctive format: with maps displayed down the left-side of the page, and explanatory text presented to the right-hand side. The description for each nation, territory, or region is written, first, in the official language(s) of the area, followed by other languages, including English. Because the Wikiatlas is a wiki effort, developed by the Wikimedia volunteers, the level of detail and coverage varies, from section to section, of the Wikiatlas. Some groups of maps are very extensive, while other maps are rudimentary, depending on the time spent by volunteer writers. ==History of Wikiatlas== The Wikiatlas was designed, during extended discussions on the Wikimedia website, beginning in 2003. \"Wikiatlas\", Wikimedia.org, July 2003, webpage: [http://meta.wikimedia.org/wiki/Wikiatlas Wikimedia-Meta-atlas]. Originally, the concept was to have an \"automatic\" map-generator, based on giving coordinates. However, use of maps beyond mere location, led to the current vast collections of maps also showing economic areas, precipitation, average- temperature, political regions, earthquake fault-lines, etc. To show a location was only one way to use maps. Many thousands of maps were collected, over the years. However, by June 2005, the Wikiatlas subproject still lacked sufficient structure to be considered viable. \"*Openstreetmap* Wikimania, August 4-8\", Lars Aronsson, Openstreetmap.org, June 25, 2005, webpage: [http://lists.openstreetmap.org/pipermail/talk/2005-June/000761.html openstreetmap-mail-761]. In April 2006, the Wikiatlas was mentioned in an archaeology conference as a \"nascent\" project.\"Unsuported Assertions: An Analysis of Criticism of Wikipedia and Possible Solutions\", Elijah Meeks, University of California, Merced, USA, in \"List of Abstracts\", 34th Annual Meeting and Conference of Computer Applications and Quantitative Methods in Archaeology\", April 18-21, 2006, webpage (PDF): [http://www.caa2006.org/pdf/accepted-abstracts.pdf caa2006-PDF]. Finally, a coherent page-format was generalized during mid-2007, using page layouts stored in MediaWiki template files. \"Talk:WikiEarth\", e-katalog.com.pl, revision: 16:28, 24 August 2007, web: [http://meta.wikimedia.e-katalog.com.pl/wiki/Talk:WikiEarth TalkWikiE-Aug7]. Hundreds of Wikimedia and Wikipedia editors worked on various aspects of the page descriptions in over 100 languages, including uploading and modifying the thousands of map images. Some of the maps were transferred from Wikipedia image pages. ==Wikimedia readership== Although readership figures are not specifically available, of the complete grouping of all Wikiatlas pages, the general readership of the Wikimedia website has been based, nearly 50% (in early 2009), within the following: United States 24.5%, Germany 10.7%, India 5.7%, United Kingdom 4.0%, and Italy 3.5%. \"Traffic Details from Alexa - wikimedia\", Alexa Internet, Inc., March 2009, web: [http://www.alexa.com/data/details/traffic_details/commons.wikimedia.org Alexa-wikimedia]. ==Notes== ==References== *\"1. Wikimedia Commons\", HowWikipediaWorks.com, 2008, webpage: HowW-ch16s01 . ==Other websites== * Wikiatlas main page on Wikimedia Commons. Category:Maps Category:Wikis Category:Wikimedia Foundation",
 "title": "Wikiatlas"
}