{
 "id": "26405",
 "text": "Mardi Gras is a festival held the day Carnival ends, before Ash Wednesday (Also called Shrove Tuesday) and the start of Lent. Many cities (especially those with large Catholic populations) like New Orleans are famous for their Mardi Gras celebrations. Mardi Gras happens every year, but it's date is relative to other holidays. 2024 date February 13 2025 date March 4 2026 date February 17 2027 date February 9 During Mardi Gras, people takes part in celebrating with big parades and parties. Many people celebrate Mardi Gras in their own way, some people have small parties and eat pastries and some people have huge parties and celebrate in a big way. Some of the pastries they eat are called king's cake, hot cross buns, paczki, tricolor scrolls and thick sugar cookies. There are other things that people eat but these are the usual American celebration food for Mardi Gras. There are so many different parades and kinds of celebrations. In some countries, including the United Kingdom, Ireland and Australia, the day is called Shrove Tuesday, Fat Tuesday, Pancake Tuesday or Pancake Day. Mardi Gras is also celebrated in French speaking countries. == Origin == In many christian denominations, people don't eat certain foods during the season of Lent. Many people also give up something important to them, like TV. Many people use the days leading up to Lent as a time to do all the things they wont be able to. People started calling the last day before Lent \"Fat Tuesday\" because you would be very full after eating so much. In the late 17th to early 18th century, people began having more official Fat Tuesday celebrations. == Traditions == During Mardi Gras, people usually celebrate by going to parades and eating food. Mardi Gras celebrations typically feature purple and green, as well as bead necklaces and masquerade masks. Bead necklaces will often be thrown from parade floats. Though it isn't very common nowadays, sometimes women will flash parade performers to get more bead necklaces. Food is an important part of Mardi Gras. A lot of different kinds of food is eaten, mostly being Cajun food and pastries. King's Cake is famous for having a small toy of baby Jesus hidden inside. The person who gets the slice with the toy inside wins. Category:Festivals",
 "title": "Mardi Gras"
}