{
 "id": "264110",
 "text": "There are many different and diverse ethnic groups in the United States. Most people in the United States have ancestors who came from somewhere else, often from multiple places. Some people say their ancestry is \"American\"; often these are people from the Southern United States whose families have been living in America since before the American Revolution, however their ancestry most likely originated from Europe. There are several races expanded into many ethnic groups in the United States: *White is the most common race in the United States. White or European-American refers to people from countries in Europe (such as Germany, England, Ireland, France, Belgium, Switzerland, Austria, Luxembourg, Italy, Portugal, Spain, Poland, Russia, Belarus, Ukraine, Georgia, Finland, Iceland, Sweden, Denmark, Norway, Greece, Turkey, Albania, Croatia, Moldova, Romania, Serbia, Bulgaria, Hungary, the Czech Republic, or the Netherlands). * Black or African-American refers to people from countries in Sub-Saharan Africa. * Asian refers to people from countries in Asia (such as China, Japan, Korea, South Asia, or Southeast Asia). * Oceanian refers to people from countries in Oceania (such as Australia, New Zealand, or Fiji). * Native American refers to people who are part of Native American groups that have lived for thousands of years in the lands now controlled by the U.S. These are the only people who did not come to the United States during or after Europe learned of the Americas. * Hispanic Americans, such as Spanish and Indigenous Mexican Americans, are often of this category. Hispanic is an ethnicity, meaning Hispanic people can be of any race. * Lusophone Americans, such as Portuguese and Indigenous Brazilians, are often of this category. Lusophone is an ethnicity, meaning Lusophone people can be of any race. * Other refers to people who are an unlisted ethnic group, such as Jewish people and Roma people. The race is not the same as ethnicity, however. Here are the top three ethnic groups in the United States. Since many Asian and Hispanic people are classified differently, most of the groups listed are white. * The most common is German-American, which 42.8 million Americans identify with. Many people came to the U.S. from Germany in the 19th and early 20th centuries. German American is the most common ethnic group in over half the states. The largest number of Germans are found in the Midwest, West, and Pennsylvania. * Irish-American is the second-largest ethnic group found in the United States, with 30.5 million people. *The third-largest ethnic group is African-American, at 24.8 million people. The largest number of African- Americans are found in the South. ==References== ==Other websites==",
 "title": "Ethnic groups of the United States"
}