{
 "id": "264144",
 "text": "The South African Grand Prix was first run as a Grand Prix motor racing handicap race in 1934 at the Prince George Circuit at East London, Eastern Cape Province, South Africa. The races were stopped because of World War II. It was started again in 1962 as part of the Formula One circuit. It was a popular F1 event. It was stopped again after the 1985 race. Some nations began boycotting (not participating) South African events because of racial segregation policy of apartheid.AUTO RACING; [3 STAR Edition] Compiled from wire reports by Ken Paskman. Orlando Sentinel. Orlando, Fla.: Oct 24, 1985. pg. B.2 After apartheid was ended in 1991, there were two more races held in 1992 and 1993. ==Winners of the South African Grand Prix== === Repeat winners (drivers) === A pink background indicates an event which was not part of the Formula One World Championship. Wins Driver Years won 4 Jim Clark 1961, 1963, 1965, 1968 3 Niki Lauda 1976, 1977, 1984 2 Jackie Stewart 1969, 1973 Carlos Reutemann 1974, 1981 Nigel Mansell 1985, 1992 Alain Prost 1982, 1993 === Repeat winners (constructors) === A pink background indicates an event which was not part of the Formula One World Championship. Wins Constructor Years won 6 Lotus 1961, 1963, 1965, 1966, 1968, 1978 4 Ferrari 1971, 1976, 1977, 1979 Williams 1981, 1985, 1992, 1993 2 Maserati 1934, 1939 Cooper 1960, 1967 Brabham 1970, 1983 Tyrrell 1973, 1975 Renault 1980, 1982 McLaren 1972, 1984 === Repeat winners (engine manufacturers) === A pink background indicates an event which was not part of the Formula One World Championship. Wins Manufacturer Years won 8 Ford * 1968, 1969, 1970, 1972, 1973, 1974, 1975, 1981 5 Climax 1960, 1961, 1963, 1965, 1966 4 Ferrari 1971, 1976, 1977, 1979 Renault 1980, 1982, 1992, 1993 3 Maserati 1934, 1939, 1967 * Built by Cosworth ===By year=== A pink background indicates an event which was not part of the Formula One World Championship. Year Driver Constructor Location Report 1934 Whitney Straight Maserati 8CM 3.0L East London Report 1935 Not held Not held Not held Not held 1936 Mario Massacuratti Bugatti 35B East London Report 1937 Pat Fairfield ERA-B Report 1938 Buller Meyer Riley Report 1939 Luigi Villoresi Maserati 6CM Report 1940 – 1959 Not held Not held Not held Not held 1960There were two South African Grands Prix in 1960. Reference Paul Frère Cooper-Climax East London Report 1960There were two South African Grands Prix in 1960. Reference Stirling Moss Porsche Report 1961 Jim Clark Lotus-Climax Report 1962 Graham Hill BRM East London Report 1963 Jim Clark Lotus-Climax Report 1964 Not held Not held Not held Not held 1965 Jim Clark Lotus-Climax East London Report 1966 Mike Spence Lotus–Climax East London Report 1967 Pedro Rodríguez Cooper-Maserati Kyalami Report 1968 Jim Clark Lotus-Ford Report 1969 Jackie Stewart Matra-Ford Report 1970 Jack Brabham Brabham-Ford Report 1971 Mario Andretti Ferrari Report 1972 Denny Hulme McLaren-Ford Report 1973 Jackie Stewart Tyrrell-Ford Report 1974 Carlos Reutemann Brabham-Ford Report 1975 Jody Scheckter Tyrrell-Ford Report 1976 Niki Lauda Ferrari Report 1977 Niki Lauda Ferrari Report 1978 Ronnie Peterson Lotus-Ford Report 1979 Gilles Villeneuve Ferrari Report 1980 René Arnoux Renault Report 1981 Carlos Reutemann Williams-Ford Report 1982 Alain Prost Renault Report 1983 Riccardo Patrese Brabham-BMW Report 1984 Niki Lauda McLaren-TAG Report 1985 Nigel Mansell Williams-Honda Report 1986 – 1991 Not held Not held Not held Not held 1992 Nigel Mansell Williams-Renault Kyalami Report 1993 Alain Prost Williams-Renault Report ==Broadcasting== ===United Kingdom=== Year Network Lap-by-lap Colour commentator(s) BBC Two Murray Walker James Hunt Eurosport Allard Kalff John Watson BBC Two Murray Walker James Hunt Eurosport Allard Kalff John Watson BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker James Hunt BBC Two Murray Walker ITV Andrew Marriott BBC One Barrie Gill BBC One Barrie Gill == References == == Resource == *ChicaneF1 Category:Formula One Grands Prix",
 "title": "South African Grand Prix"
}