{
 "id": "264237",
 "text": "The Moroccan Grand Prix was a Grand Prix motor racing event. It began in 1925 in Casablanca, Morocco. The official name was \"Casablanca Grand Prix\". In 1930, the race was moved to the new Anfa Racecourse. There was no race in 1933. There were no races between 1935 and 1953. When it returned in 1954, it was held on a circuit at the city of Agadir for sports cars. A new circuit at Ain-Diab near Casablanca was ready for the 1957 Moroccan Grand Prix Formula One race. This race did not counttoward the World Championship. The only World Championship F1 race was in 1958. The race was marred by the death of Stuart Lewis-Evans. This was the last Grand Prix organized in Morocco. == Winners of the Moroccan Grand Prix == === Repeat winners (drivers) === No driver won the Moroccan Grand Prix more than one time. === Repeat winners (constructors) === Number of wins Driver Years 4 Bugatti 1926, 1928, 1931, 1932 3 Ferrari 1954, 1955, 1956 Active constructors are in bold. Event that were not part of the Formula One World Championship have a pink background. === By year === Year Driver Constructor Category Location 1958 Stirling Moss Vanwall Formula One Ain-Diab 1957 Jean Behra Maserati Formula One Ain-Diab 1956 Maurice Trintignant Ferrari Sports cars Agadir 1955 Mike Sparken Ferrari Sports cars Agadir 1954 Giuseppe Farina Ferrari Sports cars Agadir 1953 - 1935 Not held 1934 Louis Chiron Alfa Romeo Touring cars Anfa 1933 Not held 1932 Marcel Lehoux Bugatti Touring cars Anfa 1931 Stanislas Czaikowski Bugatti Touring cars Anfa 1930 Charles Bénitah Amilcar Touring cars Anfa 1929 Not held 1928 E. Meyer Bugatti Touring cars Casablanca 1927 G. Roll Georges Irat Touring cars Casablanca 1926 R. Meyerl Bugatti Touring cars Casablanca 1925 Comte de Vaugelas Delage Touring cars Casablanca Event that were not part of the Formula One World Championship have a pink background. Category:Formula One Grands Prix Category:Casablanca Category:1925 establishments Category:1920s establishments in Africa Category:20th-century establishments in Morocco Category:1958 disestablishments Category:20th- century disestablishments in Africa",
 "title": "Moroccan Grand Prix"
}