{
 "id": "264341",
 "text": "The Swiss Grand Prix (, ) was the motor race of Switzerland. In its later years it was a Formula One race. Grand Prix racing started in Switzerland in 1934. The Bremgarten circuit was just outside the town of Bremgarten, near Bern. The Swiss Grand Prix counted toward the European Championship from 1935 to 1939. The Bremgarten track remained the home of the Swiss Grand Prix until 1954. In 1958, motor racing was banned by the Swiss government as an unsafe spectator sport. The was in reaction following the death of 80 people at the 1955 24 Hours of Le Mans race. The Swiss Grand Prix did return for two more races, but at the Dijon-Prenois circuit, just across the border in France. In 1975 it was a non-Championship Grand Prix. One Championship F1 race was held in 1982. == Winners of the Swiss Grand Prix == ===Repeat winners (drivers)=== A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Wins Driver Years won 3 Rudolf Caracciola 1935, 1937, 1938 2 Alberto Ascari 1949, 1953 2 Juan Manuel Fangio 1951, 1954 === Repeat winners (constructors) === A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Wins Constructor Years won 5 Mercedes 1935, 1937, 1938, 1939, 1954 4 Alfa Romeo 1947, 1948, 1950, 1951 4 Ferrari 1949, 1952, 1953, 1975 2 Auto Union 1934, 1936 === Repeat winners (engine manufacturers) === A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Wins Manufacturer Years won 5 Mercedes 1935, 1937, 1938, 1939, 1954 4 Alfa Romeo 1947, 1948, 1950, 1951 4 Ferrari 1949, 1952, 1953, 1975 2 Auto Union 1934, 1936 ===Year by year=== A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Year Driver Constructor Location Report 1934 Hans Stuck Auto Union Bremgarten Report 1935 Rudolf Caracciola Mercedes-Benz Bremgarten Report 1936 Bernd Rosemeyer Auto Union Report 1937 Rudolf Caracciola Mercedes-Benz Report 1938 Rudolf Caracciola Mercedes-Benz Report 1939 Hermann Lang Mercedes- Benz Report 1940 – 1946 Not held Not held Not held Not held 1947 Jean-Pierre Wimille Alfa Romeo Bremgarten Report 1948 Carlo Felice Trossi Alfa Romeo Report 1949 Alberto Ascari Ferrari Report 1950 Nino Farina Alfa Romeo Bremgarten Report 1951 Juan Manuel Fangio Alfa Romeo Report 1952 Piero Taruffi Ferrari Report 1953 Alberto Ascari Ferrari Report 1954 Juan Manuel Fangio Mercedes Report 1955 – 1974 Not held Not held Not held Not held 1975 Clay Regazzoni Ferrari Dijon (France) Report 1976 – 1981 Not held Not held Not held Not held 1982 Keke Rosberg Williams-Ford Dijon (France) Report Category:Formula One Grands Prix",
 "title": "Swiss Grand Prix"
}