{
 "id": "264346",
 "text": "The Coppa Acerbo was an motor race held in Italy. Following Italy's defeat in World War II, the race was renamed the Circuito di Pescara, and in some years was also referred to as the Pescara Grand Prix (Gran Premio di Pescara). The race was run between 1924 and 1961 with a variety of vehicle classes. In the Pescara Grand Prix was one round of the Formula One World Championship. This race which holds the record of the longest circuit length ever used for a Championship event. ==Race winners== ===Repeat winners (drivers)=== A pink background indicates an event which was not part of the Formula One World Championship. Wins Driver Years won 3 Giuseppe Campari 1927, 1929, 1931 2 Luigi Fagioli 1933, 1934 2 Achille Varzi 1930, 1935 2 Bernd Rosemeyer 1936, 1937 2 Giovanni Bracco 1948, 1952 ===Repeat winners (constructors)=== A pink background indicates an event which was not part of the Formula One World Championship. Wins Constructor Years won 10 Alfa Romeo 1924, 1925, 1927, 1929, 1931, 1932, 1933, 1939, 1949, 1950 4 Ferrari 1951, 1952, 1953, 1961 3 Auto Union 1935, 1936, 1937 3 Maserati 1930, 1948, 1954 2 Mercedes-Benz 1934, 1938 ===Repeat winners (engine manufacturers)=== A pink background indicates an event which was not part of the Formula One World Championship. Wins Manufacturer Years won 10 Alfa Romeo 1924, 1925, 1927, 1929, 1931, 1932, 1933, 1939, 1949, 1950 4 Ferrari 1951, 1952, 1953, 1961 3 Auto Union 1935, 1936, 1937 3 Maserati 1930, 1948, 1954 2 Mercedes-Benz 1934, 1938 ===Year by year=== A pink background indicates an event which was not part of the Formula One World Championship. Year Driver(s) Class Vehicle Race title 1924 Enzo Ferrari Grand Prix Alfa Romeo RL I Coppa Acerbo 1925 Guido Ginaldi Grand Prix Alfa Romeo RL II Coppa Acerbo 1926 Luigi Spinozzi Grand Prix Bugatti T35 III Coppa Acerbo 1927 Giuseppe Campari Grand Prix Alfa Romeo P2 IV Coppa Acerbo 1928 Not held Not held Not held Not held 1929 Giuseppe Campari Grand Prix Alfa Romeo P2 V Coppa Acerbo 1930 Achille Varzi Grand Prix Maserati 26M VI Coppa Acerbo 1931 Giuseppe Campari Grand Prix Alfa Romeo Tipo A VII Coppa Acerbo 1932 Tazio Nuvolari Grand Prix Alfa Romeo Tipo-B 'P3' VIII Coppa Acerbo 1933 Luigi Fagioli Grand Prix Alfa Romeo Tipo-B 'P3' IX Coppa Acerbo 1934 Luigi Fagioli Grand Prix Mercedes-Benz W25 X Coppa Acerbo 1935 Achille Varzi Grand Prix Auto Union B Typ. XI Coppa Acerbo 1936 Bernd Rosemeyer Grand Prix Auto Union C Typ. XII Coppa Acerbo 1937 Bernd Rosemeyer Grand Prix Auto Union C Typ. XIII Coppa Acerbo 1938 Rudolf Caracciola Grand Prix Mercedes-Benz W154 XIV Coppa Acerbo 1939 Clemente Biondetti Voiturette Alfa Romeo 158 XV Coppa Acerbo 1940 – 1946 Not held Not held Not held Not held 1947 Vincenzo Auricchio Sports car Stanguellini-Fiat 1100 XVI Circuito di Pescara 1948 Giovanni Bracco Alberto Ascari Sports car Maserati A6GCS XVII Circuito di Pescara 1949 Franco Rol Sports car Alfa Romeo 6C 2500 SS XVIII Circuito di Pescara Juan Manuel Fangio Formula One Alfa Romeo 158 XIX Circuito di Pescara José Froilán González Formula One Ferrari 375 XX Circuito di Pescara 1952 Giovanni Bracco Paolo Marzotto Sports car Ferrari 250 S 1° 12 Ore di Pescara 1953 Umberto Maglioli Mike Hawthorn Sports car Ferrari 375 MM 2° 12 Ore di Pescara Luigi Musso Formula One/Two Maserati 250F XXIII Gran Premio di Pescara 1955 Not held Not held Not held Not held 1956 Robert Manzon Sports car Gordini T15S XXIV Gran Premio di Pescara Stirling Moss Formula One Vanwall VW5 XXV Circuito di Pescara 1958 – 1959 Not held Not held Not held Not held 1960 Denny Hulme Formula Junior Cooper T52 - BMC XXVI Gran Premio di Pescara 1961 Lorenzo Bandini Giorgio Scarlatti Sports car Ferrari 250 TRI 1961 4h Testa Rosa ==References== == Other websites == *The Pescara Circuit at ETracksonline . Category:Formula One Grands Prix",
 "title": "Coppa Acerbo"
}