{
 "id": "264464",
 "text": "Copper(II) sulfate General Systematic name copper(II) sulfate Other names cupric sulfate, copper sulfate, chalcanthite, blue vitriol, bluestone Molecular formula CuSO4 Molar mass 159.60 g/mol (anhydrous) Appearance blue solid crystals when hydrated, white solid when anhydrous CAS number 7758-98-7 Properties Density and phase 3.603 g/cm³ (anhydrous), 2.284 g/cm³ (hydrated) Solubility in water 31.6 g/100 ml (0 °C) Solubility in ethanol insoluble, both forms Solubility in methanol hydrate is soluble Melting point 150 °C (423 K) dehydrates, 650 °C decomp. Structure Coordination geometry octahedral Crystal structure triclinic Hazards MSDS MSDS Main hazards (Xn) Harmful (Xi) Irritant (N) Dangerous for the environment NFPA 704 R/S statement R: R22, R36/38, R50/53 S: S2, S22, S60, S61 Related compounds Other anions Copper(II) chloride, Copper(II) oxide Other cations Sodium sulfate, Manganese sulfate, Iron(II) sulfate Except where noted otherwise, data are given for materials in their standard state (at 25 °C, 100 kPa) Disclaimer Copper(II) sulfate, also known as cupric sulfate, copper sulfate, blue vitriol, or bluestone, is a chemical compound. Its chemical formula is CuSO4. It contains copper in its +2 oxidation state. It also contains sulfate ions. It is a blue solid that can kill fungi. It is also used to purify copper metal. It is common in chemistry sets and chemistry demonstrations, and practical lessons at high school. ==Properties== ===Physical properties=== Copper(II) sulfate is a solid at 25 degrees Celsius at standard atmosphere (a pressure). Copper(II) sulfate is a blue solid when hydrated (attached to water molecules). It is whitish when anhydrous (not attached to water molecules). When hydrated, it normally has five water molecules attached to it. It can be dehydrated by heating it. When water is added to it, it gets hydrated again. When it is in air, it absorbs water vapor and becomes hydrated, too. ===Chemical properties=== It is a weak oxidizing agent. It reacts with most metals to make copper and a metal sulfate. For example, it reacts with iron to make copper and iron(II) sulfate. :Fe + CuSO4 → FeSO4 \\+ Cu It reacts with sodium hydroxide or potassium hydroxide to make copper(II) hydroxide. :CuSO4 \\+ 2 NaOH → Cu(OH)2 \\+ Na2SO4 It reacts with sodium carbonate to make copper(II) carbonate. :CuSO4 \\+ Na2CO3 → CuCO3 \\+ Na2SO4 It reacts with ammonia to make a dark blue solution. This solution can dissolve fibers in cotton. :CuSO4 \\+ 4 NH3 → Cu(NH3)4SO4 When it is heated to a high temperature, it turns into copper(II) oxide and sulfur trioxide. :CuSO4 → CuO + SO3 It makes a blue-green color when it is heated in a flame, like all copper compounds. ==Occurrence== Copper(II) sulfate is found in the ground as chalcanthite. Chalcanthite is easily dissolved. It is only found in dry areas. When it is in air, it loses its bright blue color. Some minerals are tested by taste. Chalcanthite has a sweet metal taste. It should only be tasted carefully, as it is poisonous.National Audubon Society, Field Guide to Rocks and Minerals, Alfred A. Knopf (publisher) (c) 1979, pg. 461 Its Mohs hardness is 2.5. It is the pentahydrate of copper sulfate. It is blue or green. Many people collecting minerals want it. ==Preparation== Copper sulfate is not normally made in a small laboratory, because it is much easier just to buy it. There are some ways to make copper sulfate, however. Copper(II) sulfate can be made by electrolysis of a solution of sulfuric acid with copper electrodes. Hydrogen is made, as well as copper sulfate solution. :Cu + H2SO4 → CuSO4 \\+ H2 It can also be made by reacting copper(II) oxide or copper(II) hydroxide or copper(II) carbonate with sulfuric acid or by adding copper to heated concentrated sulphuric acid: :CuO + H2SO4 → H2O + CuSO4 :Cu(OH)2 \\+ H2SO4 → 2 H2O + CuSO4 :CuCO3 \\+ H2SO4 → H2O + CuSO4 \\+ CO2 :Cu + 2H2SO4 → CuSO4 \\+ 2H2O + SO2 It can also be made by reacting copper with a mixture of nitric acid and sulfuric acid. ==Uses== Copper(II) sulfate, as the most common copper compound, has many uses. It can be used to kill algae and fungi. Some fungi can get resistant to copper sulfate, though. Then the copper sulfate does not kill them any more. It can be mixed with lime to make a similar fungi killer. It can be used to treat aquarium fish for infections. It is also used to detect sugars. It turns into red copper(I) oxide when reduced by a sugar. It can be used in organic chemistry as a catalyst and oxidizing agent. It is used to see whether blood is anemic. It is commonly found in chemistry sets. It is used to demonstrate a displacement reaction, where a metal reacts with copper sulfate to make copper and the metal sulfate. It is also used to demonstrated hydrated and anhydrous chemicals. It was used as an emetic in the past. It is seen as too toxic now. It can be used to purify copper. A thin pure piece of copper and a thick impure piece of copper are placed in copper sulfate solution. The thin plate is connected to the negative wire and the thick plate to the positive wire. An electrical current is passed through them. The copper in the thick plate dissolves and plates on the thin plate. All of the impurities fall to the bottom, while the pure copper is made at the negative electrode. Someone covered the walls of their apartment with copper sulfate crystals for decoration. ==Safety== Copper sulfate is somewhat toxic to humans.U. S. Environmental Protection Agency. 1986 Guidance for reregistration of pesticide products containing copper sulfate. Fact sheet no 100. Office of Pesticide Programs. Washington, DC. It is very toxic to fish, though. In humans, it irritates skin and eyes.Windholz, M., ed. 1983. The Merck Index. Tenth edition. Rahway, NJ: Merck and Company.TOXNET. 1975–1986. National library of medicine's toxicology data network. Hazardous Substances Data Bank (HSDB). Public Health Service. National Institute of Health, U. S. Department of Health and Human Services. Bethesda, MD: NLM.Clayton, G. D. and F. E. Clayton, eds. 1981. Patty's industrial hygiene and toxicology. Third edition. Vol. 2: Toxicology. NY: John Wiley and Sons. It can cause nausea when eaten. It automatically makes one throw up when it is ingested. If too much is eaten, however, it can get into the stomach and cause many problems. ==Related pages== *Copper compounds ==References== Category:Sulfur compounds Category:Copper compounds",
 "title": "Copper(II) sulfate"
}