{
 "id": "264589",
 "text": "Eye makeup is a type of cosmetics which aims to make the eyes look noticeable and attractive. It is mostly used by females, and by stage performers of all types. Eye makeup is an important part of the fashion and cosmetic industries. The idea can be taken much further. The colour of the eye can be altered by using contact lenses. Glitter and other appliqués can be stuck on near the eye. Fake eyelashes or eyelash extensions are possible. == Mascara == Mascara is a cosmetic used to darken, colour, thicken, lengthen, or define eyelashes. Historically, it was (and still is) usually black, but now it also comes in many colours and tints. Mascara comes in three forms: liquid, cake, and cream. It is available in tubes with wand applicators. Ingredients in mascara include water, wax thickeners, film-formers, and preservatives. == Eye shadow== Eye shadow is a cosmetic that is applied on the eyelids and under the eyebrows. The average distance between eyelashes and eyebrows is twice as big in women as in men. Pale eye shadow visually enlarges this area and has a feminising effect. Eye shadow can be applied in a variety of ways depending upon the desired look. Typically application is done using sponges, fingers, and/or brushes. The most important aspect of applying eye shadow, and makeup in general, is blending well. To remove eye shadow, a commercial eye makeup remover may be used, though a face wash will usually remove all traces of colour. Generally it is easy to remove, and simple water and soap can be used. Eye shadow, eyeliner, and mascara may also be removed using baby oil or olive oil. There are also makeup wipes that may be used. == Eye liner == Eye liner is a cosmetic used to define the eyes. It is applied around the contours of the eye, along and above the edges of the eyelids where the eyelashes grow. Often applied just on the outer half of the eye. Creating a baseline is the first step in applying liner. It provides a level surface that makes it easier to apply the liner and gives you more control === Types === Depending on its texture, eyeliner can be softly smudged or clearly defined. There are six main types available on the market: * Liquid eyeliner is an opaque liquid that usually comes in a small bottle and is applied with a tiny brush or felt applicator. It creates a sharp, precise line. * Powder-based eye pencil is eyeliner in a wood pencil. It is generally available in dark matte shades. * Wax-based eye pencils are softer pencils and contain waxes that ease application. They come in a wide variety of intense colours as well as paler shades such as white or beige. Wax-based eyeliners can also come in a cone or a compact with brush applicator. * Gel eye liner, which can easily be applied with an eyeliner brush. * Kohl eyeliner pencil is known for its creamy consistency. It is often used to create a smokey eye effect. Because of its texture, it may not be the best choice for an eyeliner that you want to stay put. * Eyeshadow or cake liner applied to the eyelid with an angle brush can serve as a more natural-looking alternative to heavy eyeliner. Cake liners look like pressed shadows that turn into a creamy liquid when you dip a wet brush into them. === Kohl === Kohl is an ancient black eye pigment which survives to the present day in the Mediterranean, the Middle East and the Indian subcontinent. It was a dark-colored powder made of crushed galena (lead sulfide) and/or antimony, burnt almonds, lead, cupric oxide, ochre, ash, malachite, or any combination of them. It may be used as an eye liner, mascara or eyeshadow. The upper and lower eyelids were painted in a line that extended to the sides of the face for an almond effect. In addition to reducing sun glare, it was believed that kohl eyeliner could restore good eyesight and reduce eye infection. Kohl was kept in a small, flat-bottomed pot with a wide, tiny rim and a flat, disk-shaped lid. According to images of the time, the use of makeup was not limited to women. Highly polished silver and copper mirrors aided the application of makeup. == References == Category:Cosmetics Category:Body art",
 "title": "Eye makeup"
}