{
 "id": "264774",
 "text": "Glycogen storage disease type II (also known as Pompe's Disease) is a disease that causes glycogen to gather in lysosomes. It was also the first glycogen storage disease to be discovered, this happened in 1932 by Dutch pathologist J.C. Pompe. It is one of the rarest diseases in the United States, and the world. The build-up of glycogen causes muscles to get weaker over time throughout the body and affects various body tissues, more commonly in the heart, skeletal muscles, liver and the nervous system. == Signs and symptoms == === Newborn === The form that happens during early childhood usually comes to medical attention within the first few months of life. The usual presenting features are having a bigger heart than usual (cardiomelagy, 92%), low ability to resist muscle stretch (hypotonia, 88%), cardiomyopathy (88%), breathing problems (78%), muscle weakness (63%), feeding difficulties (57%) and not enough weight gain (inability to thrive, 50%). The main things that doctors can look for include floppy baby appearance, delays in critical parts of being able to move (for example: being able to lift your head and neck), and feeding difficulties. A liver that is moderately larger than usual (mild hepatomegaly) might happen. Facial features include an unusually large tongue (macroglossia), wide open mouth, wide open eyes, and flaring of the babies nostrils (due to respiratory distress). The heart and lungs can be affected, shown by a faster breathing rate, the use of additional muscles for breathing, frequent and repeated chest infections, reduced entry of air into the lower left zone (due to cardiomelagy), irregular heartbeat (arrythmias) and signs of heart failure. Before a cure was developed, the average age of death was 8.7 months (if the disease was left untreated), usually due to heart and lung failure. However, this outcome has drastically changed since treatment has been available, and the life expectancy gets better with early access to treatment. === Late-onset form === This form is different from the infantile form mainly because it involves the heart less. It starts slowly and gets worse more slowly. The heart involvement, if present, is not as bad compared to the infantile form. The skeletal system is affected more, especially in the lower limbs. In the late-onset form, symptoms include difficulty coughing, repeated chest infections, weak muscles, delayed development in being able to move, trouble swallowing or chewing, and reduced breathing capacity. The prognosis depends on when the symptoms start, and later-onset disease generally has a better prognosis. ==References== Category:Diseases",
 "title": "Glycogen storage disease type II"
}