{
 "id": "264873",
 "text": "Christian Klien (born 7 February 1983 in Hohenems, Vorarlberg) is an Austrian Formula One racing driver. In total he has scored 14 points in Formula One. == Racing career == Klien started his motorsport career in his early teens. He raced in karting championships in both Austria and Switzerland. He moved up to Formula BMW. He won several titles in lower Formula series. Klien moved into Formula One in . He drove for the Jaguar Racing team, alongside Mark Webber. At the end of 2004, Jaguar sold its Formula One team to Red Bull. The team was renamed Red Bull Racing. Klien shared a race seat with Italian Vitantonio Liuzzi. He stayed at Red Bull for season. In , Klien was replaced by Mark Webber. He was the test driver for Honda. For and , he was the reserve and test driver for BMW Sauber. In , Klien moved to become the test driver for HRT. For the Singapore Grand Prix Kling replaced Sakon Yamamoto. HRT reported that Yamamoto was sick from food posining. For the Brazilian Grand Prix, HRT announced that Klien would race in place of Yamamoto. No reason was given. == Racing record == === Career summary === Season Series Team Name Races Poles Wins F/Laps Podiums Points Final Placing 1999 Formula BMW Junior ADAC Sport München 20 1 3 193 4th 2000 Formula BMW ADAC Team Rosberg 19 0 0 57 10th 2001 Formula BMW ADAC Team Rosberg 19 3 5 232 3rd 2002 Formula Renault 2000 Eurocup JD Motorsport 8 0 0 92 6th 2002 Formula Renault 2000 Germany JD Motorsport 14 2 4 278 1st 2003 Formula Three Euroseries Mücke Motorsport 20 6 3 89 2nd 2003 Masters of Formula Three Mücke Motorsport 1 0 1 N/A 1st 2004 Formula One Jaguar 18 0 0 3 16th 2005 Formula One Red Bull 15 0 0 9 15th 2006 Formula One Red Bull 15 0 0 2 18th 2007 Formula One Honda Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2008 Formula One BMW Sauber Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2008 Le Mans 24 Hours Peugeot Sport Total (LMP1) 1 0 0 N/A 3rd 2009 Formula One BMW Sauber Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2009 Le Mans 24 Hours Team Peugeot Total (LMP1) 1 0 0 N/A 6th 2010 Formula One Hispania Racing 3 0 0 0 0 0 27 Season in progress === Complete Formula One results === (key) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 WDC Points 2004 Jaguar Racing Jaguar R5 Cosworth CR-6 3.0 L V10 AUS 11 MAL 10 BHR 14 SMR 14 ESP Ret MON Ret EUR 12 CAN 9 USA Ret FRA 11 GBR 14 GER 10 HUN 13 BEL 6 ITA 13 JPN 12 BRA 14 16th 3 Jaguar R5B CHN Ret 2005 Red Bull Racing Red Bull RB1 Cosworth TJ2005 3.0 L V10 AUS 7 MAL 8 BHR DNS SMR TD ESP TD MON TD EUR TD CAN 8 USA DNS FRA Ret GBR 15 GER 9 HUN Ret TUR 8 ITA 13 BEL 9 BRA 9 JPN 9 CHN 5 15th 9 2006 Red Bull Racing Red Bull RB2 Ferrari 056 2.4 L V8 BHR 8 MAL Ret AUS Ret SMR Ret EUR Ret ESP 13 MON Ret GBR 14 CAN 11 USA Ret FRA 12 GER 8 HUN Ret TUR 11 ITA 11 CHN JPN BRA 18th 2 2007 Honda Racing F1 Team Honda RA107 Honda RA807E 2.4 L V8 AUS MAL BHR ESP MON CAN USA FRA GBR TD EUR HUN TUR ITA BEL JPN CHN BRA \\--- --- 2010 Hispania Racing F1 Team Hispania F110 Cosworth CA2010 2.4 L V8 BHR AUS MAL CHN ESP TD MON TUR CAN EUR TD GBR GER HUN BEL ITA SIN Ret JPN KOR BRA 22 ABU 20 27 0 Season in progress. == References == All Formula One race and championship results are taken from: * Official Formula 1 Website. Archive: Results for 2004 – Present seasons www.formula1.com Retrieved 6 June 2006 == Other websites == * Christian Klien Official website * Christian Klien profile and statistics * Christian Klien statistics * Christian Klien statistics at Driver Database. (includes pre-F1 career) Category:1983 births Category:Living people Category:24 Hours of Le Mans drivers Category:Austrian racecar drivers Category:Formula One current Category:Formula One drivers Category:People from Vorarlberg",
 "title": "Christian Klien"
}