{
 "id": "264941",
 "text": "Theodor Holm Nelson (Ted Nelson, born 1937) is an American sociologist, philosopher, and pioneer of information technology. He coined the terms \"hypertext\" and \"hypermedia\" in 1963 and published it in 1965. He also is credited with first use of the words transclusion, virtuality, intertwingularity and teledildonics. The main thrust of his work has been to make computers easily accessible to ordinary people. His motto is: \"A user interface should be so simple that a beginner in an emergency can understand it within ten seconds.\" However, he is known for inventing many new words (neologisms) which few other people understand (such as \"intertwingularity\"), and his remarks contain humor to entertain rather than just inform. Consequently, some of his ideas have been met with negative reactions. From a pessimist viewpoint, Ted Nelson promotes four maxims: \"most people are fools, most authority is malignant, God does not exist, and everything is wrong\".See chapter II, 3rd paragraph, 3rd and 4th sentence in: \"The Curse of Xanadu\" ==Career== Nelson started Project Xanadu in 1960. He wanted to create a new computer network that was easy to use and easy to understand. He wrote about the project in his books Computer Lib/Dream Machines (1974) and Literary Machines (1981). He has spent much of his adult life working on Project Xanadu and telling people about its benefits. The Xanadu project was not very successful. There were many reasons, but not everyone agrees why the project did not go well. Journalist Gary Wolf published an unflattering history, \"The Curse of Xanadu\", on Nelson and his project in the June 1995 issue of Wired. Nelson expressed his disgust on his website, referring to Wolf as a \"Gory Jackal\", and threatened to sue him. He also outlined his objections in a letter to Wired, and released a detailed rebuttal of the article. Nelson says that Tim Berners-Lee made some ideas from Xanadu become true by inventing the World Wide Web. But, Nelson dislikes the World Wide Web, XML, and all embedded markup. Nelson thinks that Berners-Lee's work is a much too simple way of doing his original plan: > HTML is precisely what we were trying to PREVENT– ever-breaking links, links > going outward only, quotes you can't follow to their origins, no version > management, no rights management. – Ted Nelson (Ted Nelson one-liners ) Nelson co-founded Itty bitty machine company, or \"IBM\", which was a small computer retail store operating from 1977 to 1980 in Evanston, Illinois. The Itty bitty machine company was one of the few retail stores to sell the original Apple I computer. In 1978 he had a significant impact upon IBM's thinking when he outlined his vision of the potential of personal computing to the team that three years later launched the IBM PC.When Big Blue Got a Glimpse of the Future. Ted Nelson is currently working on a new information structure, ZigZag. More information about ZigZag is on the Xanadu project website. That website also has two versions of the Xanadu code that visitors can download. He is also currently developing XanaduSpace \\- a system for the exploration of connected parallel documents (an early version of this software may be freely downloaded from . He is a visiting fellow at Oxford University - based at the Oxford Internet Institute - where he works in the fields of information, computers, and human-machine interfaces. ==Education and awards== Nelson earned a Bachelor's degree in philosophy from Swarthmore College in 1959, a Master's degree in sociology from Harvard University in 1963 and a Doctorate in Media and Governance from Keio University in 2002. In 1998, at the Seventh WWW Conference in Brisbane, Australia, Ted Nelson was awarded the Yuri Rubinsky Memorial Award. He told the audience that it was the first award that he had ever received for his work. In 2001 he was knighted by France as \"Officier des Arts et Lettres\". In 2004 he was appointed as a Fellow of Wadham College, Oxford, and associated with the Oxford Internet Institute, where he is currently conducting his research. In 2007 he celebrated his 70th birthday by giving an invited birthday lecture at the University of Southampton.70th Birthday Lecture: Intertwingularity: where ideas collide ==Personal life== He is the son of the late Emmy Award-winning director Ralph Nelson and the Academy Award-winning actress Celeste Holm. His parents' marriage was brief, and he was mostly raised by his grandparents in Greenwich Village, with relatively little contact with his parents. Internet Pioneers from Ibiblio. He is partly of Norwegian descent. ==Popular culture== The anime Serial Experiments Lain cites Project Xanadu as a precursor to The Wired (a fictional internet-like communications network and augmented reality system) and mentions Nelson as the originator of hypertext. ==Populitism== Populitism (\"pop-u-leet-ism\") is another neologism coined by Nelson, as a combination of the word \"populism\" with \"elite\". It refers to treating the general populace with the privileges of elitism. The word suggests the society-of-text envisioned by theorists like Shoshana Zuboff and Jay David Bolter, a writing space in which traces of authority persist only as local and contingent effects, the social equivalent of the deconstructed author-function. A \"populite\" culture might mark the first step toward realization of Jean- Francois Lyotard's \"game of perfect information\" where all have equal access to the world of data, and where \"[g]iven equal competence (no longer in the acquisition of knowledge, but in its production), what extra performativity depends on in the final analysis is 'imagination,' which allows one either to make a new move or change the rules of the game.\" This is the utopia of information-in-process, the ultimate wetware dream of the clerisy: discourse converted with 100 percent efficiency into capital, the mechanism of that magical process being nomology or rule-making—admittedly a rather specialized form of \"imagination.\" ==Works by Ted Nelson== * Life, Love, College, etc. (1959) * Computer Lib: You can and must understand computers now / Dream Machines: New freedoms through computer screens–a minority report (1974), Microsoft Press, rev. edition 1987: * The Home Computer Revolution (1977) * Literary Machines: The report on, and of, Project Xanadu concerning word processing, electronic publishing, hypertext, thinkertoys, tomorrow's intellectual revolution, and certain other topics including knowledge, education and freedom (1981), Mindful Press, Sausalito, California. ** Publication dates as listed in the 93.1 (1993) edition: 1980, 1981, 1982, 1983, 1984, 1987, 1990, 1991, 1992, 1993 * The Future of Information (1997) * A Cosmology for a Different Computer Universe: Data Model, Mechanisms, Virtual Machine and Visualization Infrastructure . Journal of Digital Information, Volume 5 Issue 1. Article No. 298, July 16, 2004 * Geeks Bearing Gifts: How The Computer World Got This Way (2008) (Chapter summaries ) ==Notes== ==Other websites== * Ted Nelson's homepage * Detailed Ted Nelson bibliography * Xanadu project webpage * The Magical Place of Literary Memory: Xanadu in Screening the Past , July 2005 by Belinda Barnet * Ted Nelson and Xanadu , in The Electronic Labyrinth, 1993 * The Curse of Xanadu , June 1995 Wired article by Gary Wolf * reactions to The Curse of Xanadu, September 1995 Wired magazine, from Vint Cerf, Jonathan Vos Post and Ted Nelson, * Orality and Hypertext: An Interview with Ted Nelson * Way Out Of The Box , by Theodor Nelson, October 8, 1999 * Software and Media for a New Democracy a talk given by Ted Nelson at the File festival Symposium/November/2005 * Article/interview with Nelson, Wired, August 2005 * The Politics of Internet Software 'Geeks Bearing Gifts' , a talk given by Ted at the Oxford Internet Institute, November 30, 2005 * Transclusion: Fixing Electronic Literature , a talk given by Ted at Google, January 29, 2007 * Biography at ibiblio.org Category:American sociologists Category:American philosophers Category:People from New York City Category:1937 births Category:Harvard University alumni Category:Living people",
 "title": "Ted Nelson"
}