{
 "id": "265180",
 "text": "== D == Latin Translation Notes Da mihi factum, dabo tibi ius Give me the fact(s), I'll give you the law also: Da mihi facta, dabo tibi ius; legal idea based on Roman law; parties should present the facts of a case while the judge rules on the law. Related to iura novit curia (the court knows the law). damnant quodnon intelligunt They condemn what they do not understand. damnatio memoriae damnation of memory A Roman custom in which disgraced Romans (such as former Emperors) were pretended to have never existed. damnum absque injuria damage without injury A loss that results from no one's wrongdoing. In Roman law, a man is not responsible for unintended, consequential injury to another resulting from a lawful act. This protection does not necessarily apply to unintended damage by negligence or folly. dat deus incrementum God grants the increase Motto of Westminster School, a leading British independent school. data venia \"with due respect\" or \"given the excuse\" Used before disagreeing with someone. de bonis asportatis carrying goods away Trespass de bonis asportatis was the traditional name for larceny (wrongful taking of chattels). de dato of the date Used as short form \"d.d.\" such as in, \"We agreed in the meeting d.d. 26 May 2006\". de facto by deed Said of something that is the actual state of affairs, in contrast to something's legal or official standing, which is described as de jure. De facto means the \"way things really are\" rather than what is \"officially\" presented as right. de fideli with faithfulness A clerk makes the declaration De fideli when appointed, promising to do tasks faithfully as a servant of the court. de futuro regarding the future Usually used in the context of \"at a future time\". de gustibus non est disputandum there is no disputing about tastes Less literally \"there's no accounting for taste\". Likely of Scholastic origin (see Wiktionary). de jure by law \"Official\", in contrast with de facto. Analogous to \"in principle\", whereas de facto means \"in practice\". In other contexts, can mean \"according to law\", \"by right\" or \"legally\". Also commonly written de iure, in the classical form. de minimis non curat lex The law does not bother with the smallest things. The court does not want to bother with small, trivial things. A case must have importance for the court to hear it. See below: \"de minimis not curat praetor\". de minimis non curat praetor The commander does not bother with the smallest things. Also \"The chief magistrate does not concern himself with trifles.\" Trivial matters are no concern of a high official (cf. aquila non capit muscas, the eagle does not catch flies). Sometimes rex (the king) or lex (the law) is used in place of praetor, and de minimis is a legal term referring to things unworthy of the law's attention. de mortuis nil nisi bonum about the dead, nothing unless a good thing From de mortuis nil nisi bonum dicendum est, \"nothing must be said about the dead except the good\", attributed by Diogenes Laërtius to Chilon. In legal contexts, this quotation is used with the opposite meaning, as defaming a deceased person is not a crime. In other contexts, it refers to taboos against criticizing the recently deceased. de nobis fabula narratur about us is the story told Thus, \"Their story is our story\". Originally referred to the end of Rome's dominance. Now often used when comparing any current situation to a past story or historical event. de novo from the new \"Anew\" or \"afresh\". In law, a trial de novo is a retrial. In biology, de novo means newly synthesized, and a de novo mutation is a mutation that neither parent possessed or transmitted. In economics, de novo refers to newly founded companies, and de novo banks are state banks that have been in operation for five years or less. de omnibus dubitandum be suspicious of everything; doubt everything Karl Marx's favorite motto. de oppresso liber Free from having been oppressed Commonly mistranslated as \"To liberate the oppressed\". The motto of the United States Army Special Forces. de profundis from the depths Out of the depths of misery or dejection. From the Latin translation of Psalm 130. de re about the matter In logic, de dicto statements (about the truth of a proposition) are distinguished from de re statements (about the properties of a thing itself). decus et tutamen An ornament and a safeguard Inscription on British one-pound coins. Originally on 17th-century coins, it refers to the inscribed edge as a protection against the clipping of precious metal. The phrase originally comes from Virgil's Aeneid. Dei Gratia Regina By the Grace of God, Queen Also Dei Gratia Rex (By the Grace of God, King). Abbreviated as D G REG preceding Fidei Defensor (F D) on British pounds, and as D G Regina on Canadian coins. Dei sub numine viget Under God's Spirit she flourishes Motto of Princeton University. delectatio morosa peevish delight In Catholic theology, a pleasure taken in sinful thought or imagination, such as brooding on sexual images. It is distinct from actual sexual desire, and involves voluntary and complacent erotic fantasizing, without any attempt to suppress such thoughts. Deo ac veritati For God and for truth Motto of Colgate University. Deo domuique For God and for home Motto of Methodist Ladies' College, Melbourne. Deo et patriae For God and Country Motto of Regis High School (New York City). Deo gratias Thanks [be] to God The semi-Hispanicized form Deogracias is a Philippine first name. Deo juvante With God's help The motto of Monaco and its monarch, which appears on the royal arms. Deo Optimo Maximo (DOM) To the best and greatest God Derived from the Pagan Iupiter Optimo Maximo (To the best and greatest Jupiter). Printed on bottles of Bénédictine liqueur. Deo vindice With God as protector Motto of the Confederate States of America. An alternate translation is \"With an avenging God\". Deo volente God willing This was often used in conjunction with a signature at the end of letters. It was used in order to signify that \"God willing\" this letter will get to you safely, \"God willing\" the contents of this letter come true. See also: Insha'Allah. Deus caritas est God is Love The first encyclical of Pope Benedict XVI. deus ex machina a god from a machine From the Greek ἀπὸ μηχανῆς θεός (apò mēchanēs theós). A contrived or artificial solution, usually to a literary plot. Refers to the practice in Greek drama of lowering by crane (the mechanê) an actor playing a god or goddess onto the stage to resolve an insuperable conflict in the plot. The device is most commonly associated with Euripides. Deus meumque jus God and my right The principal motto of Scottish Rite Freemasonry; see also Dieu et mon droit. Deus spes nostra God is our hope The motto of Sir Thomas de Boteler founder of Boteler Grammar School Warrington in 1526 Deus vult God wills it! The principal slogan of the Crusades.Motto of Bergen Catholic High School, NJ dicto simpliciter [From] a maxim, simply I.e. \"From a rule without exception.\" Short for A dicto simpliciter, the a often being dropped by confusion with the indefinite article. A dicto simpliciter occurs when an acceptable exception is ignored or eliminated. For instance, the appropriateness of using opiates is dependent on the presence of extreme pain. To justify the recreational use of opiates by referring to a cancer patient or to justify arresting said cancer patient by comparing him to the recreational user would be a dicto simpliciter. dictum meum pactum my word [is] my bond Motto of the London Stock Exchange. diem perdidi I have lost the day From the Roman Emperor Titus. Passed down in Suetonius's biography of him in Lives of the Twelve Caesars (8). Dies Irae Day of Wrath Refers to the Judgment Day in Christian eschatology. The name of a famous 13th-century Medieval Latin hymn by Tommaso da Celano, used in the Mass for the dead. dies non juridicum Day without judiciary Days under common law (traditionally Sunday) in which no legal process can be served and any judgment is void. This concept was first codified by the English Parliament in the reign of Charles II. dirigo I direct In Classical Latin, \"I arrange\". State motto of Maine. Based on a comparison of the State of Maine to the star Polaris. dis aliter visum it seemed otherwise to the gods In other words, the gods have different plans than mortals, and so events do not always play out as people wish them to. dis manibus sacrum (D.M.S.) Sacred to the ghost-gods Refers to the Manes, Roman spirits of the dead. Loosely \"To the memory of\". A conventional inscription preceding the name of the deceased on pagan grave markings, often shortened to dis manibus (D.M.), \"for the ghost-gods\". Preceded in some earlier monuments by hic situs est (H. S. E.), \"he lies here\". disce quasi semper victurus vive quasi cras moriturus Learn as if always going to live; live as if tomorrow going to die. Attributed to St Edmund of Abingdon. dissiecta membra scattered limbs That is, \"scattered remains\". Paraphrased from Horace, Satires, I, 4, 62, where it was written \"disiecti membra poetae\" (limbs of a scattered poet). Also written as disjecta membra. ditat Deus God enriches State motto of Arizona, adopted in 1911. Probably derived from the Vulgate's translation of Genesis 14:23. divide et impera divide and rule A Roman maxim adopted by Julius Caesar, Louis XI and Machiavelli. Commonly rendered \"divide and conquer\". dixi I have spoken A popular eloquent expression, usually used in the end of a speech. The implied meaning is: \"I have said all that I had to say and thus the argument is settled\". [\"...\", ...] dixit [\"...\", ...] said Used to attribute a statement or opinion to its author, rather than the speaker. docendo discitur It is learned by teaching Also translated \"One learns by teaching.\" Attributed to Seneca the Younger. docendo disco, scribendo cogito I learn by teaching, think by writing. dolus specialis special intent \"The ... concept is particular to a few civil law systems and cannot sweepingly be equated with the notions of ‘special’ or ‘specific intent’ in common law systems. Of course, the same might equally be said of the concept of ‘specific intent,’ a notion used in the common law almost exclusively within the context of the defense of voluntary intoxication.\"—Genocide scholar William SchabasActus non facit reum, nisi mens sit rea: An Investigation into the Treatment of Mens Rea in the Quest to Hold Individuals Accountable for Genocide Mens Rea: The Mental Element quoting and citing William A. Schabas, \"The Jelisic Case and the Mens Rea of the Crime of Genocide,\" Leiden Journal of International Law 14 (2001): 129. Domine dirige nos Lord guide us Motto of the City of London Dominus Illuminatio Mea God lights the way. The Lord is my light. Motto of the University of Oxford. Dominus vobiscum Lord be with you Phrase used during and at the end of Catholic sermons, and a general greeting form among and towards members of Catholic organizations, such as priests and nuns. See also pax vobiscum. dona nobis pacem give us peace Often set to music, either by itself or as part of the Agnus Dei prayer of the Mass. Also an ending in the video game Haunting Ground. donatio mortis causa giving in expectation of death A legal concept where a person in imminent mortal danger need not meet the requisite consideration to create or modify a will. draco dormiens nunquam titillandus a sleeping dragon is never to be tickled Motto of the fictional Hogwarts school in the Harry Potter series; translated more loosely in the books as, \"Never tickle a sleeping dragon\". dramatis personae the people of the play More literally, \"the masks of the drama\"; more figuratively, \"cast of characters\". The characters represented in a dramatic work. ducunt volentem fata, nolentem trahunt The fates lead the willing and drag the unwilling Attributed to Lucius Annaeus Seneca. ductus exemplo Leadership by example This is the motto for the United States Marine Corps' Officer Candidates School located at Marine Corps Base Quantico; Quantico, Virginia. dulce bellum inexpertis War is sweet to the inexperienced War may seem pleasant to those who have never been involved in it, though the more experienced know better. A phrase from Erasmus in the 16th century. dulce et decorum est pro patria mori It is sweet and honorable to die for the fatherland. From Horace, Odes III, 2, 13. Used by Wilfred Owen for the title of a poem about World War I, Dulce et Decorum Est. dulce et utile a sweet and useful thing Horace wrote in his Ars Poetica that poetry must be dulce et utile (pleasant and profitable), both enjoyable and instructive. dulce periculum danger is sweet Horace, Odes III, 25, 16. Motto of the Scottish clan MacAulay. dulcius ex asperis sweeter after difficulties Motto of the Scottish clan Fergusson.Clan Fergus(s)on Society Retrieved on 14 December 2007 dum Roma deliberat Saguntum perit while Rome debates, Saguntum is in danger Used when someone has been asked for urgent help, but responds with no immediate action. Similar to Hannibal ante portas, but referring to a less personal danger. dum spiro spero while I breathe, I hope State motto of South Carolina. From Cicero. dum vivimus servimus While we live, we serve Motto of Presbyterian College. dum vivimus, vivamus While we live, let us live! An encouragement to embrace life. Motto inscribed on the sword of the main character in the novel Glory Road. dura lex sed lex [The] law [is] harsh, but [it is the] law. dura mater tough mother The outer covering of the brain. dum vita est, spes est While there is life, there is hope. dux bellorum War leader ==References== * Category:Language-related lists",
 "title": "List of Latin phrases (D)"
}