{
 "id": "265140",
 "text": "== C == Latin Translation Notes cacoethes scribendi insatiable desire to write Cacoēthescacoēthes. Charlton T. Lewis and Charles Short. A Latin Dictionary on Perseus Project. \"bad habit\" or medically \"malignant disease\" is a borrowing of Greek kakóēthes. The phrase is derived from a line in the Satires of Juvenal: Tenet insanabile multos scribendi cacoethes, or \"the incurable desire (or itch) for writing affects many\". See: hypergraphia. cadavera vero innumera truly countless bodies Used by the Romans to describe the aftermath of the Battle of the Catalaunian Plains. Caedite eos. Novit enim Dominus qui sunt eius. Kill them. For the Lord knows those who are his. Supposed statement by Abbot Arnaud Amalric before the massacre of Béziers during the Albigensian Crusade, recorded 30 years later, according to Caesar of Heisterbach. Caelum non animum mutant qui trans mare currunt Those who hurry cross the sea change the sky [upon them], not their souls or state of mind Hexameter by Horace (Epistulae I, 11 v.27 ). Seneca shortens it to Animum debes mutare, non caelum (You must change [your] disposition, not [your] sky) in his Letter to Lucilium XXVIII, 1 caetera desunt the rest is missing Caetera is Medieval Latin spelling for cētera. calix meus inebrians my cup making me drunk camera obscura dark chamber An optical device used in drawing, and an ancestor of modern photography. The source of the word camera. canes pugnaces war dogs or fighting dogs canis canem edit dog eats dog Refers to a situation where nobody is safe from anybody, each man for himself. capax infiniti holding the infinite a term referring (at least) to some Christian doctrines of the incarnation of the Son of God when it asserts that humanity is capable of housing full divinity within its finite frame. Related to the Docetic heresy and sometimes a counterpoint to the Reformed 'extracalvinisticum.' caput inter nubila (condit) (he plunges) [his] head in the clouds So aggrandized as to be beyond practical (earthly) reach or understanding (from Virgil's Aeneid and the shorter form appears in John Locke's Two Treatises of Government) caput mortuum dead head Originally an alchemical reference to the dead head or worthless residue left over from a reaction. Also used to refer to a freeloader or worthless element. Caritas Christi The love of Christ It implies a command to love as Christ loved. Motto of St. Francis Xavier High School in West Meadowlark Park, Edmonton. Caritas in Veritate Charity in Truth Pope Benedict XVI's third encyclical. carpe diem seize the day An exhortation to live for today. From Horace, Odes I, 11.8. Carpere refers to plucking of flowers or fruit. The phrase collige virgo rosas has a similar sense. carpe noctem seize the night An exhortation to make good use of the night, often used when carpe diem would seem absurd, e.g., when observing a deep sky object or conducting a Messier marathon. carpe vinum seize the wine Carthago delenda est Carthage must be destroyed The Roman senator Cato the Elder ended every speech after second Punic Wars with ceterum censeo Carthaginem esse delendam, literally \"For the rest, I am of the opinion that Carthage is to be destroyed.\" Before the ratification of the Lisbon Treaty in the European Parliament, Daniel Hannan ended all his speeches in a similar way with Pactio Olisipiensis censenda est \"The Lisbon Treaty must be put to a referendum\". casus belli event of war Refers to an incident that is the justification or case for war. causa latet, vis est notissima The cause is hidden, but the result is well known. Ovid: Metamorphoses IV, 287; motto of Alpha Sigma Phi. causa mortis cause of death cave beware! especially used by Doctors of Medicine, when they want to warn each other (e.g.: \"cave nephrolithiases\" in order to warn about side effects of an uricosuric). Spoken aloud in some British public schools by pupils to warn each other of impending authority. cave canem Beware of the dog cave laborem beware of work cave nil vino beware of no wine caveat emptor let the buyer beware The purchaser is responsible for checking whether the goods suit his need. Phrases modeled on this one replace emptor with lector, subscriptor, venditor, utilitor: \"reader\", \"signer\", \"seller\", \"user\". cedant arma togae let arms yield to the gown \"Let military power yield to civilian power\", Cicero, De Officiis I:77. See also Toga celerius quam asparagi cocuntur more swiftly than asparagus [stem]s are cooked Or simply \"faster than cooking asparagus\". A variant of the Roman phrase velocius quam asparagi coquantur, using a different adverb and an alternative mood and spelling of coquere. cepi corpus I got the body In law, it is a return made by the sheriff, upon a capias, or other process to the like purpose; signifying, that he has taken the body of the party. See also habeas corpus. certum est quod certum reddi potest it is certain, whatever can be rendered certain Or \"... if it can be rendered certain.\" Often used in law when something is not known, but can be ascertained (e.g. the purchase price on a sale which is to be determined by a third-party valuer) cessante ratione legis cessat ipsa lex when the reason for the law ceases, the law itself ceases A rule of law becomes ineffective when the reason for its application has ceased to exist or does not correspond to the reality anymore. By Gratian. cetera desunt the rest are missing Also spelled \"caetera desunt\". ceteris paribus all other things being equal That is, disregarding or eliminating other factors in a situation. charta pardonationis se defendendo a paper of pardon to defend oneself The form of a pardon for killing another man in self- defence (see manslaughter). charta pardonationis utlagariae a paper of pardon to the outlaw The form of a pardon of a man who is outlawed. Also called perdonatio utlagariae. Christianos ad leones [Throw the] Christians to the lions! Christo et Doctrinae For Christ and Learning The motto of Furman University. Christus nos liberavit Christ has freed us title of volume I, book 5, chapter XI of Les Misérables by Victor Hugo. Christus Rex Christ the King A Christian title for Jesus. circa (c.) or (ca.) around In the sense of \"approximately\" or \"about\". Usually used of a date. circulus in probando circle made in testing [a premise] Circular reasoning. Similar term to circulus vitiosus. circulus vitiosus vicious circle In logic, begging the question, a fallacy involving the presupposition of a proposition in one of the premises (see petitio principii). In science, a positive feedback loop. In economics, a counterpart to the virtuous circle. citius altius fortius faster, higher, stronger Motto of the modern Olympics. clamea admittenda in itinere per atturnatum A writ whereby the king of England could command the justice to admit one's claim by an attorney, who being employed in the king's service, cannot come in person. clausum fregit A legal action for trespass to land; so called, because the writ demands the person summoned to answer wherefore he broke the close (quare clausum fregit), i.e., why he entered the plaintiff's land. claves Sancti Petri the keys of Saint Peter A symbol of the Papacy. clavis aurea golden key The means of discovering hidden or mysterious meanings in texts, particularly applied in theology and alchemy. clerico admittendo for being made a clerk In law, a writ directed to the bishop, for the admitting a clerk to a benefice upon a ne admittas, tried, and found for the party who procures the writ. clerico capto per statutum mercatorum In law, a writ for the delivery of a clerk out of prison, who is imprisoned upon the breach of statute merchant. clerico convicto commisso gaolae in defectu ordinarii deliberando In law, a writ for the delivery of a clerk to his ordinary, that was formerly convicted of felony; by reason that his ordinary did not challenge him according to the privilege of clerks. clerico intra sacros ordines constituto non eligendo in officium In law, a writ directed to the bailiffs, etc., that have thrust a bailiwick or beadleship upon one in holy orders; charging them to release him. Codex Iuris Canonici Book of Canon Law The official code of canon law in the Roman Catholic Church (cf. Corpus Iuris Canonici). cogito ergo sum I think, therefore I am. A rationalistic argument used by French philosopher René Descartes to attempt to prove his own existence. coitus interruptus interrupted congress Aborting sexual intercourse prior to ejaculation—the only permitted form of birth control in some religions. coitus more ferarum congress in the way of beasts A medical euphemism for the doggy-style sexual position. collige virgo rosas pick, girl, the roses Exhortation to enjoy fully the youth, similar to Carpe diem, from De rosis nascentibus (also titled Idyllium de rosis) attributed to Ausonius or Virgil. \"Gather ye rosebuds while ye may\", 1909, by John William Waterhouse ==References== * Category:Language-related lists",
 "title": "List of Latin phrases (C)"
}