{
 "id": "265136",
 "text": "== B == Latin Translation Notes barba tenus sapientes wise as far as the beard Or wise only in appearance (in what shows). From Erasmus's collection of Adages. Beata Virgo Maria (BVM) Blessed Virgin Mary A common name in the Roman Catholic Church for Mary (mother of Jesus). The genitive, Beatae Mariae Virginis (BMV), occurs often as well, appearing with such words as horae \"hours\", litaniae \"litanies\" and officium \"office\". beatae memoriae of blessed memory See in memoriam. beati pauperes spiritu Blessed in spirit [are] the poor. A Beatitude from in the Vulgate: beati pauperes spiritu, quoniam ipsorum est regnum caelorum \"Blessed in spirit [are] the poor, for theirs is the kingdom of the heavens\". beati possidentes blessed [are] those who possess Translated from Euripides. beatus homo qui invenit sapientiam blessed is the man who finds wisdom from Proverbs 3:13; set to music in a 1577 motet of the same name by Orlando di Lasso. bella gerant alii Protesilaus amet! let others wage war Protesilaus should love! Originally from Ovid, Heroides 13.84,Ovidi Nasonis Epistvlae Heroidvm, XIII. Laodamia Protesilao where Laodamia is writing to her husband Protesilaus who is at the Trojan War. She begs him to stay out of danger, but he was in fact the first Greek to die at Troy. Also used of the Habsburg marriages of 1477 and 1496, written as bella gerant alii, tu felix Austria nube (let others wage war; you, fortunate Austria, marry). Said by King Matthias. bellum omnium contra omnes war of all against all A phrase used by Thomas Hobbes to describe the state of nature. bellum se ipsum alet war feeds itself bibo ergo sum I drink, therefore I am A spoof of the common \"I think therefore I am\" bis dat qui cito dat he gives twice, who gives promptly A gift given without hesitation is as good as two gifts. bis in die (bid) twice in a day Medical shorthand for \"twice a day\". bona fide in good faith In other words, \"well-intentioned\", \"fairly\". In modern contexts, often has connotations of \"genuinely\" or \"sincerely\". Bona fides is not the plural (which would be bonis fidebus), but the nominative, and means simply \"good faith\". Opposite of mala fide. bona notabilia note-worthy goods In law, if a person dying has goods, or good debts, in another diocese or jurisdiction within that province, besides his goods in the diocese where he dies, amounting to a certain minimum value, he is said to have bona notabilia; in which case, the probat of his will belongs to the archbishop of that province. bona officia good services A nation's offer to mediate in disputes between two other nations. bona patria goods of a country A jury or assize of countrymen, or good neighbors. bona vacantia vacant goods United Kingdom legal term for ownerless property that passes to The Crown. boni pastoris est tondere pecus non deglubere it is a good shepherd's [job] to shear his flock, not to flay them Tiberius reportedly said this to his regional commanders, as a warning against taxing the populace excessively. bonum commune communitatis common good of the community Or \"general welfare\". Refers to what is a benefit to society, as opposed to bonum commune hominis, which refers to what is good for an individual. bonum commune hominis common good of a man Refers to an individual's happiness, which is not \"common\" in that it serves everyone, but in that individuals tend to be able to find happiness in similar things. busillis — Pseudo-Latin meaning \"baffling puzzle\" or \"difficult point\". John of Cornwall (ca. 1170) was once asked by a scribe what the word meant. It turns out that the original text said in diebus illis magnis plenae (in those days there were plenty of great things), which the scribe misread as indie busillis magnis plenae (meaning: in India there were plenty of large busillis). ==References== * Category:Language-related lists",
 "title": "List of Latin phrases (B)"
}