{
 "id": "265738",
 "text": "Shikoku is the smallest of Japan's four main islands.Library of Congress Country Studies, Japan (LOC),\"Geography\". Retrieved 2012-2-13. About 4 million people live there, fewer than on any of the other main islands. The island lies south of HonshuNussbaum, Louis-Frédéric. (2002). \"Shikoku\" in Japan Encyclopedia, p. 857. and east of Kyūshū across the Kanmon Strait. A bridge connects it to Honshu. Farming is a very important business in Shikoku. Citrus fruits are an important product. Shikoku is the home of the 88 Temple Pilgrimage of the Shingon sect of Buddhism. ==Regions== Shikoku region covers the entire island.LOC, \"Shikoku\". Retrieved 2012-2-13. The name Shikoku literally means \"four countries\" in Japanese. Shikoku was made of four old \"countries\" or provinces that are now prefectures. In other words, each prefecture has a modern name and an old provincial name. The old names are still used sometimes, especially for foods, music, or art. *Ehime, formerly Iyo Province – to the westNussbaum, \"Ehime\" in Japan Encyclopedia, p. 170; Japan External Trade Organization (JETRO), Ehime Prefecture, Regional Information. Retrieved 2012-4-6. *Kagawa, formerly Sanuki Province – to the northNussbaum, \"Kagawa prefecture\" in Japan Encyclopedia, p. 446; JETRO, Kagawa Prefecture, Regional Information . Retrieved 2012-4-6. *Kōchi, formerly Tosa Province – to the southNussbaum, \"Kōchi prefecture\" in Japan Encyclopedia, p. 538; JETRO, Kōchi Prefecture, Regional Information . Retrieved 2012-4-6. *Tokushima, formerly Awa Province – to the eastNussbaum, \"Tokushima prefecture\" in Japan Encyclopedia, p. 980; JETRO, Tokushima Prefecture, Regional Information . Retrieved 2012-4-6. ==Cities== * Kōchi – home of \"Yosakoi\" and many local sights * Matsuyama, Ehime – is best known for the old hot springs at Dogo Onsen * Takamatsu, Kagawa – the largest city in Shikoku * Tokushima – home of the Awa Odori festival in August * Uwajima – has a fertility shrine and wrestling bulls * Naruto – the east gate of Shikoku. ==Points of interest== * Cape Ashizuri – a scenic cape at the southernmost point of Shikoku * Iya Valley – a remote but beautiful mountain valley * Kotohira – the site of the Kompira-san shrine * Mount Ishizuchi – the tallest peak in Shikoku ===Castles=== There are twelve original castles that are left in Japan and Shikoku is home to four of them. * Marugame Castle, Marugame * Kōchi Castle, Kochi * Matsuyama Castle * Uwajima Castle, Uwajima. ===Temples and Shrines=== The 88 Temple Pilgrimage is a famous but difficult 1,647-kilometer circle around the entire island. Serious pilgrims may choose to complete the 88 Temple Circuit on foot. Other people uses buses. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan ==References== ==Other websites == * Murdoch's map of provinces, 1903 Category:Islands of Japan Category:Shikoku region",
 "title": "Shikoku"
}