{
 "id": "265802",
 "text": "Edwin Powell Hubble (November 20, 1889 – September 28, 1953) was an American astronomer. Hubble's findings changed the scientific view of the universe. ==Career== In 1925 he showed that there are galaxies beyond our own, the Milky Way. Also, he developed a method for classifying galaxies. Then he proved the galaxies were moving away from each other. Hubble found the degree of Doppler effect (redshift) from a galaxy increased in proportion to its distance from Earth. Doppler effect is the change in pitch or colour when an object or sound comes in (higher pitch, brighter color) or moves away (lower and darker). Redshift is observed in the light spectrum In 1929 Hubble formulated what is called Hubble's law. The law states that the greater the distance between any two galaxies, the greater their relative speed of separation. Georges Lemaître, a Belgian priest and astronomer, had published the idea two years before in an obscure journal.Eugenie Samuel Reich Published online 27 June 2011| Nature| Nevertheless, the idea bears Hubble's name to this day.Nussbaumer, Harry 2013. 'Slipher's redshifts as support for de Sitter's model and the discovery of the dynamic universe' In Origins of the Expanding Universe: 1912–1932. Astronomical Society of the Pacific. pp. 25–38. Today, the 'apparent velocities' of galaxies are understood as an increase in proper distance which occurs due to the expansion of space. Light traveling through stretching space experiences a Hubble-type redshift.Sandage, Allan 1989. Edwin Hubble 1889–1953, The Journal of the Royal Astronomical Society of Canada, Vol. 83, No.6. Retrieved 2010-03-26. This work helped to establish that the universe is expanding. Some have incorrectly said that Hubble discovered the Doppler shift in the spectra of galaxies, but this had already been observed earlier by Vesto Slipher, whose data Hubble used. The Hubble Space Telescope was named after Hubble. == Four major achievements == According to Sandage, Hubble achieved four main things: #A classification system for nebulae, both galactic (diffuse) and extragalactic (both nebulae inside our Milky Way galaxy, and other galaxies outside it). #Hubble settled decisively the question of the nature of the galaxies (as being other things like the Milky Way). #The distribution of galaxies was found to be homogeneous in distance (the galaxies were all over the universe, not in any particular location). #The linear velocity-distance relation was established. This discovery lead to the notion of the expanding universe which is the centre-piece of the cosmology of the present day. === Hubble's personal opinion on the data === Hubble himself did not see his 1929 data as evidence for an expanding Universe. Even six years later, Hubble wrote: === Inflation as an explanation for expansion === Hubble's words were forgotten, and the notion of the expansion of the universe became the consensus. Until the theoretical developments in the 1980s no one had an explanation for why this seemed to be the case. The question \"why is the universe expanding?\" is now answered by understanding the details of what happened in the first inflationary epoch (10−32 seconds) of the existence of our universe. *Hubble's law == References == Category:1889 births Category:1953 deaths Category:Cosmology Category:American astronomers Category:Scientists from Missouri",
 "title": "Edwin Hubble"
}