{
 "id": "266114",
 "text": "{{Infobox writer | name = Theodore Sturgeon | image = | imagesize = | alt = | caption = | pseudonym = E. Waldo Hunter | birth_name = Edward Hamilton Waldo | birth_date = | birth_place = New York City, U.S. | death_date = | death_place = Eugene, Oregon, U.S. | resting_place = | occupation = | language = | citizenship = | education = | alma_mater = | period = 1938–1985 | genre = | subject = Science fiction (as critic) | movement = | notableworks = | spouse = | partner = | children = | relatives = | awards = | signature = | signature_alt = | website = | portaldisp = }} Theodore Sturgeon (26 February 1918 — 8 May 1985) was an American science fiction author. He used a special writing style called rhythmic prose. Prose writing tells a story, but rhythmic writing is often poetry. His prose text would fit into a standard poetry rhythm, or meter. This made subtle shift in mood. Usually the reader would not notice how the timing of the words changed their feeling. His most famous novel is More Than Human (1953). ==Biography== Sturgeon was born Edward Hamilton Waldo in Staten Island, New York City in 1918. His name was legally changed at age eleven after his mother's divorce and remarriage to William Dicky (\"Argylle\") Sturgeon.Theodore Sturgeon, Storyteller. 1976 Biographical essay by Paul Williams. \"Sturgeon because that was the stepfather's name -- he was a professor of modern languages at Drexel Institute in Philadelphia -- and Theodore because Edward was the boy's father's name and the mother was still bitter and anyway young Edward had always been known as Teddy.\" \"Theodore Sturgeon\" is occasionally misidentified as a pseudonym; it was in fact his legal name.op. cit.. \"To this day, libraries all over the world list \"Theodore Sturgeon\" as a pseudonym for \"E.H. Waldo, which is incorrect.\" He sold his first story in 1938 to the McClure Syndicate, which bought much of his early (non-fantastic) work; his first genre appearance was \"Ether Breather\" in Astounding Science Fiction a year later. At first he wrote mainly short stories, primarily for genre magazines such as Astounding and Unknown, but also for general-interest publications such as Argosy Magazine. He used the pen name \"E. Waldo Hunter\" when two of his stories ran in the same issue of Astounding. A few of his early stories were signed \"Theodore H. Sturgeon.\" Sturgeon ghost-wrote an Ellery Queen mystery novel, The Player on the Other Side (Random House, 1963). This novel gained critical praise from critic H.R.F. Keating, who \"had almost finished writing Crime and Mystery: the 100 Best Books, in which I had included The Player on the Other Side ... placing the book squarely in the Queen canon\"Keating, H.R.F., The Bedside Companion to Crime, New York: Mysterious Press, 1989 when he learned that it had been written by Sturgeon. Similarly, \"William DeAndrea, author and ... winner of Mystery Writers of America awards, selecting his ten favorite mystery novels for the magazine Armchair Detective, picked The Player on the Other Side as one of them. He said: 'This book changed my life ... and made a raving mystery fan (and therefore ultimately a mystery writer) out of me. ... The book must be 'one of the most skilful pastiches in the history of literature. An amazing piece of work, whomever did it'.\" Sturgeon wrote the screenplays for the Star Trek episodes \"Shore Leave\" (1966) and \"Amok Time\" (1967, later published as a \"Fotonovel\" in 1978). The latter is known for his invention of the pon farr, the Vulcan mating ritual, the first use of the sentence \"Live long and prosper\" and the first use of the Vulcan hand symbol. Sturgeon also wrote several episodes of Star Trek that were never produced. One of these was notable for having first introduced the Prime Directive. He also wrote an episode of the Saturday morning show Land of the Lost, \"The Pylon Express\", in 1975. Two of Sturgeon's stories were adapted for The New Twilight Zone. One, \"A Saucer of Loneliness\", was broadcast in 1986 and was dedicated to his memory. Another short story, \"Yesterday was Monday\", was the inspiration for The New Twilight Zone episode A Matter of Minutes. His 1944 novella \"Killdozer!\" was the inspiration for the 1970s made-for-TV movie, Marvel comic book, and alternative rock band of the same name. Although Sturgeon is well-known among readers of classic science-fiction anthologies (at the height of his popularity in the 1950s he was the most anthologized author alive) and much respected by critics (John Clute writes in The Encyclopedia of Science Fiction: \"His influence upon writers like Harlan Ellison and Samuel R. Delany was seminal, and in his life and work he was a powerful and generally liberating influence in post-WWII US sf\"), he is not much known among the general public and won comparatively few awards (though it must be noted that his best work was published before the establishment and consolidation of the leading genre awards, while his later production was scarcer and weaker). He was listed as a primary influence of the much more famous Ray Bradbury. Kurt Vonnegut based his character Kilgore Trout on Theodore Sturgeon. Sturgeon died on May 8, 1985, of lung fibrosis, in Eugene, Oregon. Sturgeon lived for several years in the neighboring city of Springfield.Obituary from the Register-Guard, May 10, 1985, retrieved from George C. Willick's \"Spacelight\" webpage May 4, 2007. ==Sturgeon's Law== In 1951, Sturgeon said something that is now known as Sturgeon's Law. He said, \"Ninety percent of SF [science fiction] is crud, but then, ninety percent of everything is crud.\" At first, this was called Sturgeon's Revelation. Sturgeon has said that \"Sturgeon's Law\" was originally \"Nothing is always absolutely so.\" However, the former statement is now widely referred to as Sturgeon's Law. He is also known for his strong support of critical thinking and challenging all normative assumptions: \"Ask the next question.\" He represented this credo by the symbol of a Q with an arrow through it, an example of which he wore around his neck and used as part of his signature in the last 15 years of his life. ==Novels== * The Dreaming Jewels (1950) Also published as The Synthetic Man * More Than Human (1953) Fix-up of three linked novellas, the first and third written around the previously published \"Baby Is Three\" * The Cosmic Rape (1958) Abridged version published as To Marry Medusa * Venus Plus X (1960) * Some of Your Blood (1961) * Godbody (1986) (published posthumously) ===Novelizations=== Movie producers hired Sturgeon under his own name to write novelisations of these movies based on their scripts: * The King and Four Queens (1956) * Voyage to the Bottom of the Sea (1961) * The Rare Breed (1966) ===Pseudonymous novels=== * I, Libertine (1956): Historical novel created as a for-hire hoax. Credited to \"Frederick R. Ewing,\" written from a premise by Jean Shepherd. * The Player on The Other Side (1963): Mystery novel credited to Ellery Queen and ghost-written with Queen's assistance and supervision. ==Short stories== Sturgeon published numerous short story collections during his lifetime, many drawing on his most prolific writing years of the 1940s and 1950s. Note that some reprints of these titles (especially paperback editions) may cut one or two stories from the line-up. Statistics herein refer to the original editions only. ===Collections published during Sturgeon's lifetime=== The following table includes sixteen volumes (one of them collecting western stories) where up to three stories (representing no more than half the book) were previously published in a Sturgeon collection. Title Year Number of stories previously collected Originally published Earliest story Latest story Without Sorcery 1948 13 1939 1947 E Pluribus Unicorn 1953 13 1947 1953 A Way Home 1955 11 1946 1955 Caviar 1955 7 1 1941 1955 A Touch of Strange 1958 11 1953 1958 Aliens 4 1959 4 1944 1958 Beyond 1960 6 1941 1960 Sturgeon In Orbit 1964 5 1951 1955 Starshine 1966 6 3 1940 1961 Sturgeon Is Alive and Well... 1971 11 1954 1971 The Worlds of Theodore Sturgeon 1972 10 3 1941 1962 Sturgeon's West (westerns) 1973 7 1949 1973 Case and the Dreamer 1974 3 1962 1973 Visions and Venturers 1978 8 1 1942 1965 The Stars Are The Styx 1979 10 1 1951 1971 The Golden Helix 1979 10 3 1941 1973 The following 6 collections consisted entirely of reprints of previously collected material: Title Year Stories Notes Number Earliest Latest Thunder and Roses 1957 8 1946 1955 selected from 11 in 1955's \"A Way Home\" Not Without Sorcery 1961 8 1939 1941 selected from 13 in 1948's Without Sorcery The Joyous Invasions 1965 3 1955 1958 selected from 4 in 1959's \"Aliens 4\" To Here and the Easel 1973 6 1941 1958 Maturity 1979 3 1947 1958 Alien Cargo 1984 14 1940 1956 ===Complete short stories=== North Atlantic Books has been releasing the chronologically assembled The Complete Short Stories of Theodore Sturgeon, edited by Paul Williams, since 1994. The series will run to 13 volumes, with the last appearing in 2010. The currently available volumes include: # The Ultimate Egoist (1937 to 1940) # Microcosmic God (1940 to 1941) # Killdozer (1941 to 1946) # Thunder and Roses (1946 to 1948) # The Perfect Host (1948 to 1950) # Baby is Three (1950 to 1952) # A Saucer of Loneliness (1953) # Bright Segment (1953 to 1955, as well as two \"lost\" stories from 1946) # And Now the News... (1955 to 1957) # The Man Who Lost the Sea (1957 to 1960) # The Nail and the Oracle (1961 to 1969) # Slow Sculpture (1970 to 1972, plus one 1954 novella and one unpublished story)Solicitation from Amazon.com # Case and The Dreamer (1972 to 1983, plus one 1960 story and three unpublished stories) forthcoming September 2010 ===Representative short stories=== Sturgeon was best known for his short stories and novellas. The best known include: * \"Ether Breather\" (September 1939, his first published science-fiction story) * \"Derm Fool\" (March 1940) * \"It!\" (August 1940) * \"Shottle Bop\" (February 1941) * \"Microcosmic God\" (April 1941) * \"Yesterday Was Monday\" (1941) * \"Killdozer!\" (November, 1944) * \"Bianca's Hands\" (May, 1947) * \"Thunder and Roses\" (November 1947) * \"The Perfect Host\" (November 1948) * \"Minority Report\" (June 1949, no connection to the 2002 movie, which was based on a later story by Philip K. Dick) * \"One Foot and the Grave\" (September 1949) * \"A Saucer of Loneliness\" (February 1953) * \"The World Well Lost\" (June 1953) * \"Mr. Costello, Hero\" (December 1953) * \"The [Widget], The [Wadget], and Boff\" (1955) * \"The Skills of Xanadu\" (July 1956) * \"The Other Man\" (September 1956) * \"And Now The News\" (December 1956) * \"The Girl Had Guts\" (January 1957) * \"Need\" (1960) * \"How to Forget Baseball\" (Sports Illustrated, December 1964) * \"The Nail and the Oracle\" (Playboy, October 1964) * \"Slow Sculpture\" (Galaxy, February 1970) — winner of a Hugo Award and a Nebula Award * \"Occam's Scalpel\" (August, 1971, with an introduction by Terry Carr) * \"Vengeance Is\" (1980, Dark Forces anthology edited by Kirby McCauley) * \"If All Men Were Brothers, Would You Let One Marry Your Sister?\" (1967, Dangerous Visions anthology edited by Harlan Ellison) — Nebula Award 1967 Nominee Novella * \"The Man Who Learned Loving\" — Nebula Award 1969 Nominee Short Story ==Autobiography== * Argyll, an autobiographical sketch about Sturgeon's relationship with his stepfather. ==References== Article on-line from 2007 in which Wina Sturgeon recalls watching Apollo landing with TS in 1969 ==Other websites== * The Theodore Sturgeon Page - an informative and comprehensive fan site * The Theodore Sturgeon Literary Trust - owners of Sturgeon copyrights, information on Sturgeon publications * * Theodore Sturgeon's online fiction at Free Speculative Fiction Online * Gary Westfahl's Biographical Encyclopedia of Science Fiction Film Category:1918 births Category:1985 deaths Category:Deaths from pulmonary fibrosis Category:American autobiographers Category:American science fiction writers Category:Disease-related deaths in Oregon Category:Hugo Award winning writers Category:Nebula Award winning writers Category:People from Staten Island Category:Writers from New York City Category:People from Springfield, Oregon Category:Writers from Oregon",
 "title": "Theodore Sturgeon"
}