{
 "id": "266265",
 "text": "The First Indochina War was fought in French Indochina from December 19, 1946 to August 1, 1954. Other names for the war are the French Indochina War, Anti- French War, Franco-Vietnamese War, Franco-Vietminh War, Indochina War, Dirty War in France, and Anti-French Resistance War. The war was fought between the French Union's French Far East Expeditionary Corps, led by France and supported by Emperor Bảo Đại's Vietnamese National Army, and the Việt Minh, led by Hồ Chí Minh and Võ Nguyên Giáp. Most of the fighting took place in Tonkin, in northern Vietnam, but the conflict spread over the entire country and also extended into the neighboring French Indochinese protectorates of Laos and Cambodia. ==Beginning== The French reoccupied Indochina after World War II after the territory had been part of the Empire of Japan. The Việt Minh launched a rebellion against the French authorities. The first few years of the war involved a low-level rural insurgency against the French. However, after the Chinese communists had reached the northern border of Vietnam in 1949, the conflict turned into a conventional war between two armies, which had modern weapons supplied by the United States and the Soviet Union.Fall, Bernard, Street Without Joy, p. 17. The French forces included colonial troops from the whole empire (Moroccan, Algerian, Tunisian, Laotian, Cambodian, Vietnamese, and Vietnamese ethnic minorities) and French professional troops and units of the French Foreign Legion. It was called the \"dirty war\" (la sale guerre) by supporters of the Left in France and intellectuals (including Jean- Paul Sartre) during the Henri Martin Affair in 1950. The French had the strategy of pushing Việt Minh into attacking a well-defended base in a remote part of the country at the end of the logistical trail. The strategy was validated at the Battle of Na San. The major problem of the war was the lack of construction materials (especially concrete). Because of difficult terrain without roads, tanks could not be used, and providing air cover was difficult. That made it almost impossible to defend the area effectively. == Dien Bien Phu == The Battle of Dien Bien Phu started when the French Army tried to attack the Viet Minh after it had cut off the supply line to get a easy defeat. The Viet Minh surrounded the French with trenches and attacked by using artillery. The trenches made the battle looked like one from World War I. The French wanted to resupply the troops from the air, but the anti- aircraft guns shot down the planes. The Viet Minh had all those advantages and won the battle, which caused the war to end shortly afterwards. ==Geneva Conference== After the war, on July 21, 1954, the Geneva Conference made a provisional division of Vietnam at the 17th parallel. The Việt Minh received control over the north in a territory called the Democratic Republic of Vietnam under Ho Chi Minh. The area south of the 17th parallel was turned into the State of Vietnam under Emperor Bảo Đại to prevent Ho from gaining control of the entire country.Nash, Gary B., Julie Roy Jeffrey, John R. Howe, Peter J. Frederick, Allen F. Davis, Allan M. Winkler, Charlene Mires, and Carla Gardina Pestana. The American People, Concise Edition Creating a Nation and a Society, Combined Volume (6th Edition). New York: Longman, 2007. A year later, Bảo Đại would be deposed by Prime Minister Ngô Đình Diệm, who created the Republic of Vietnam. Diem's refusal to enter into negotiations with North Vietnam on holding nationwide elections in 1956, as had been suggested by the Geneva Conference, would lead to another war breaking out again in South Vietnam in 1959, the Second Indochina War. ==Notes== ==References==",
 "title": "First Indochina War"
}