{
 "id": "266509",
 "text": "Art Deco is a style of decorative art, design and architecture of the 1920s and 1930s in Europe, the United States and other countries. It was named after an international exhibition held in Paris in 1925, but there are some examples dating back to before the First World War. Art Deco followed another design style, Art Nouveau, which was influenced by organic plant-like forms. Art Deco was one of the first styles of modern architecture. It was influenced by different styles and movements of the early 20th century, Neoclassical, Constructivism, Cubism, Modernism, and Futurism. Later Art Deco of the mid to late 1930s is also sometimes called Streamline Moderne. One idea behind art deco architecture was to apparently streamline buildings the same way you would streamline a car for aerodynamics. The style was much more common in commercial buildings than in houses; many banks, schools, and libraries were built in this style. Most of the public buildings built by the Works Progress Administration during the Great Depression are in the Art Deco style. == Examples == Famous Art Deco buildings include the Chrysler Building in New York City and the Chicago Board of Trade Building in Chicago. Another is Bullock's Wilshire in Los Angeles. Many art deco buildings have elaborate terra cotta or murals inside them. The towers of the Golden Gate Bridge have an art deco design. == Gallery == File:1941_Packard_180_Formal_Sedan.jpg|Packard sedan, 1941 File:PRR S1.jpg|Pennsylvania Railroad locomotive File:Municipal Auditorium art deco chandelier.jpg|Municipal Auditorium (Kansas City) File:Cord 812 1937.jpg|1937 Cord automobile model 812, 1935 File:US 853.jpg|U.S. postage stamp commemorating the 1939 New York World's Fair File:Rytm2.jpg| Henryk Kuna, \"Rytm\" (Rhythm), Warsaw, Poland, 1925 File:Snowdon Theatre (Montreal).jpg|Disused Snowdon Theatre, Montreal File:Cincimuseum.jpg|Union Terminal in Cincinnati, Ohio, 1933 File:Niagara Mohawk Bldg (Syracuse, NY).jpg|Niagara Mohawk Building, Syracuse, New York File:Victoire 2 by Rene Lalique Toyota Automobile Museum.jpg| \"Victoire\" by René Lalique, 1928 File:NewIndiaAssuranceBdg.jpg|New India Assurance Building, 1936, Mumbai, India. File:Sault Memorial Gardens 1.jpg|Sault Memorial Gardens, 1946/9 ==References==",
 "title": "Art Deco"
}