{
 "id": "266521",
 "text": "The Andrews Sisters were an American singing group in the 1930s, the 1940s and the 1950s. They were from Minneapolis, Minnesota. Their names were LaVerne (July 6, 1911 - May 8, 1967), Maxene (January 3, 1916 – October 21, 1995) and Patty Andrews (February 16, 1918 - January 30, 2013). They broke up in 1967 after the death of LaVerne, but their music is still played over certain radio stations in the United States. The Andrews Sisters were notable for their song \"The Boogie Woogie Bugle Boy\". That song was covered and recorded by multiple singers over the years. == Personal lives == The Andrews sisters were born in Minnesota, to a Greek father and Norwegian mother. They grew up in Minneapolis. === Maxene === Maxene was married to the Andrews Sisters' manger Louis Abraham \"Lou\" Levy 1941 until they divorced in 1951.Los Angeles Times article February 4, 1940 They had two adopted children, a son and a daughter. Andrews died on October 21, 1995 in Cape Cod, Massachusetts, from a heart attack, aged 79. === LaVerne === LaVerne was married to Louis A. Roger from 1948 until her death in 1967. Andrews died on May 8, 1967 in Brentwood, California from cancer, aged 56.Los Angeles Times article May 9, 1967 === Patty === Patty was married to Martin \"Marty\" Melcher from 1947 until they divorced in 1950. Then she was married to pianist Melvin Walter \"Wally\" Weschler from 1951 until his death in 2010. Patty was the last survivor of the group. She died on January 30, 2013 in her home in Northridge, California from natural causes, aged 94. ==References== ==Other websites== * Andrews Sisters official website * Andrews Sisters on BigBands.net * Vocal Group Hall of Fame page on the Andrews Sisters * * * Category:1950s American music groups Category:1960s American music groups Category:1967 disestablishments in the United States Category:American girl groups Category:American movie actors Category:American radio actors Category:Musical trios Category:Musicians from Minneapolis Category:Actors from Minneapolis Category:1925 establishments in the United States Category:20th-century establishments in Minnesota Category:Musical groups established in the 1950s Category:1951 disestablishments Category:1950s disestablishments in the United States Category:1956 establishments in the United States Category:20th-century disestablishments in Minnesota",
 "title": "The Andrews Sisters"
}