{
 "id": "266761",
 "text": "Bonnie Francesca Wright (born 17 February 1991) is an English actress. She is most known for playing Ginny Weasley in Harry Potter movies. In 2012, Wright will start shooting her first leading role. It is a British nineteenth century period movie In Want of a Wife. She will star opposite Emily Watson.Bonnie Wright's talks directing and prostitution Wright graduated from London's University of the Arts: London College of Communication. She is the owner of her own production company called Bon Bon Lumiere.Bonnie Wright starts her production company ==Filmography== Movie Year Film Role Notes 2001 Harry Potter and the Philosopher's Stone Ginny Weasley Supporting role 2002 Stranded Young Sarah Robinson TV movie 2002 Harry Potter and the Chamber of Secrets Ginny Weasley Supporting role 2004 Harry Potter and the Prisoner of Azkaban Ginny Weasley Supporting role 2004 Agatha Christie: A Life in Pictures Young Agatha Christie TV movie 2005 Harry Potter and the Goblet of Fire Ginny Weasley Supporting role 2007 Harry Potter and the Order of the Phoenix Ginny Weasley Supporting role. 2007 Vanessa Voice only; TV; \"London Calling\" 2009 Harry Potter and the Half-Blood Prince Ginny Weasley Supporting role 2010 Harry Potter and the Deathly Hallows – Part 1 Ginny Weasley Supporting role 2010 Harry Potter and the Forbidden Journey Ginny Weasley Supporting role 2011 Harry Potter and the Deathly Hallows – Part 2 Ginny Weasley Supporting role 2012 Geography of the Hapless Heart Mia Post-production 2012 The Philosophers Georgina Post-production 2013 Before I Sleep Phoebe Post-Production 2013 The Sea Rose Filming 2013 In Want of a Wife Lydia Pre-production Video game Year Game Role Notes 2007 Harry Potter and the Order of the Phoenix Ginny Weasley Voice only 2009 Harry Potter and the Half-Blood Prince Ginny Weasley Voice only Director Year Movie Role Notes 2012 Separate We Come, Separate We Go Director only, directorial debut Will be premiered at the Graduation BAFTAs Screenwriter Year Movie Role Notes 2012 Separate We Come, Separate We Go Screenwriter only, screenwriting debut Will be premiered at the Graduation BAFTAs ==Awards and nominations== Awards Year Award Category Movie Result 2011 Rodial Beautiful Awards Most Edgy Look Award 2012 Empire Award Best Female Newcomer Harry Potter and the Deathly Hallows – Part 2 ==Related pages== *List of Harry Potter films cast members ==References== Category:English movie actors Category:English television actors Category:English voice actors Category:People from London Category:1991 births Category:Living people",
 "title": "Bonnie Wright"
}