{
 "id": "267113",
 "text": "is a race track standing in the foothills of Mount Fuji, in Oyama, Suntō District, Shizuoka Prefecture, Japan. It was built in the early 1960s and hosted the first Formula One race in Japan in 1976. In the 1980s, Fuji Speedway was used for the FIA World Sportscar Championship and national racing. When it first opened, it was managed by Mitsubishi. Fuji Speedway was purchased by Toyota Motor Corporation in 2000. Fuji Speedway is known for having one of the longest straights in motorsport tracks, at in length. == History == === F1 launches in Japan === Fuji Speedway Corporation was established in 1963, as Japan NASCAR Corporation. At first, the circuit was planned to hold NASCAR-style races in Japan. The track was designed to be a high-banked superspeedway. There was not enough money to complete the project and only one of the banked turns was ever designed. Mitsubishi Estate Co. (a part of Mitsubishi) invested in the circuit. They took over the management rights in October 1965. The track was converted to a road course. Fuji speedway opened in December 1965. The banked turn was somewhat dangerous, and caused several major accidents. According to Vic Elford \"The reason that banking was so horrific, was that at the end of the straight we went over a blind crest at around 190/200 mph and dropped into the banking. At other tracks (Daytona, Monthlery, etc.) you climb up the banking.\" A new part of track was built to fix the problem. The new course was more successful. In 1966, the track hosted a USAC Indy Car non-championship race, won by Jackie Stewart. The speedway brought the first Formula One race to Japan at the end of the season. Mario Andretti won the race, and James Hunt earned enough points to win the world championship title. In Gilles Villeneuve was involved in a crash that killed two spectators on the side of the track. Formula One stopped racing at the speedway and Japan. When Japan was added back to the F1 schedule ten years later, it went to Suzuka instead. F1 didn't return to Fuji until . === National racing venue === Fuji remained a popular sports car racing venue. FIA World Sportscar Championship visited the track between 1982 and 1988. Fuji was often used for national races. Two chicanes were added to the track to slow down the speeds. Even with these changes, the main feature of the track remained its long straight, one of the longest in all of motorsports. The long pit straight has also been used for drag racing. NHRA exhibitions were run in 1989. Local drag races are common on the circuit. The track is still used for Japanese national races. In 2000 the majority of the shares of stock were bought by Toyota.Suzuka responds to Fuji pressure – December 23, 2000 Toyota was making plans for future motor racing. === Renovations === In 2003 the circuit was closed to for a major reprofiling of the track. A new design from Hermann Tilke was used. The circuit reopened on 10 April 2005. It hosted its first Formula One championship event in 29 years on 30 September 2007. The race won by Lewis Hamilton. The circuit hosts the NISMO Festival for historic Nissan racers. Toyota also hosts its own historic event a week before the NISMO called Toyota Motorsports Festival. Nearby is a drifting course, which was built as part of the refurbishment. The only time the circuit is run on a reverse direction is during the D1 Grand Prix drifting round.JDM Option Vol.21 The series has hosted its rounds since 2003, with the exception of the 2004 closure. The circuit became the first to take place on an international level racetrack and the first of the three to take place on an F1 circuit. As part of the 2003 renovations, most of the old banked section of track was removed. Only a small section remains. Following both poor ticket sales and bad weather it was decided by FOM that the Japanese Grand Prix would be shared between Fuji Speedway and Suzuka on alternate years. Suzuka would hold the next race on 4 October 2009. After the global recession and its own financial problems, Toyota decided to stop hosting of Japanese Grand Prix. == Records == Category Record Driver Car Date 1974–1984After abolishing the high- banking in 1974 World Sportscar Championship 1:10.02 Stefan Bellof Porsche 956 1 October 1983 Formula One 1:12.23 Mario Andretti Lotus 78-Ford 22 October 1977 Formula Two 1:12.62 Geoff Lees March 832-Honda/Mugen 14 August 1983 1984–1992The chicanes were added in 1984 and 1987. All Japan Sports Prototype Championship 1:14.088 Kazuyoshi Hoshino Nissan R92CP 2 May 1992 Formula Two 1:18.31 Satoru Nakajima March 842-Honda/Mugen 15 April 1984 Fuji Grand Champion Series 1:21.800 Masanori Sekiya March 89GC Mugen 29 October 1989 1993–2003 Formula 3000 1:14.854 Takuya Kurosawa Lola T92 10 April 1993 Formula Nippon 1:15.304 Kazuyoshi Hoshino Lola T96/52 19 October 1996 Le Mans Prototype 1:16.349 Ukyo Katayama Toyota GT-One TS020 6 November 1999 JGTC (GT500) 1:23.886 Yuji Tachikawa Toyota Supra 3 May 2003 Formula Three 1:26.344 Tatsuya Kataoka Dallara F302 Toyota 6 April 2003 Japanese Touring Car Championship (Group A) 1:31.131 Kazuyoshi Hoshino Nissan Skyline GT-R R32 31 October 1993 JGTC (GT300) 1:31.356 Suga Ichijo Mosler MT900R 3 May 2003 Japanese Touring Car Championship (Super Touring) 1:33.035 Naoki Hattori Honda Accord 1 November 1997 Super Taikyu 1:35.173 Kasuya Shunji Nissan Skyline GT-R R33 7 November 1998 2005–Reprofiled by Hermann Tilke in 2003 Formula One 1:17.287 Felipe Massa Ferrari F2008 11 October 2008 Formula Nippon 1:25.525 Benoit Treluyer Lola FN06-Toyota 31 March 2007 Le Mans Prototype 1:31.065 Daisuke Ito Courage LC70-Mugen 2 June 2007 Super GT (GT500) 1:33.066 Takashi Kogure Honda NSX 3 May 2007 Japan Le Mans Challenge (LMP1) 1:33.117 Shinsuke Yamazaki Zytek 04S 2 June 2007 Formula Three 1:35.173 Kazuya Oshima Dallara F306-Toyota 3 March 2007 Super GT (GT300) 1:40.682 Haruki Kurosawa Honda NSX 3 May 2005 Super Taikyu (ST-1) 1:46.304 Masataka Yanagida BMW Z4 Coupé 4 August 2007 == Fuji Speedway in video games == The Fuji circuit is known to fans of the arcade racing game Pole Position, as cars raced on the circuit. Fuji is also featured in a number of video games including Top Gear, several Gran Turismo games and TOCA Race Driver. == Fuji Speedway in television == The Fuji circuit is featured prominently in the Japanese television drama Engine as the main setting for the racing scenes. It is also the home of the (fictional) \"Regulus Cup\". == References == == Other websites == * Fuji Speedway official website * Fuji Speedway info from official F1 website * Trackpedia's guide to the Fuji Speedway * BBC's circuit guide to the Fuji Speedway * Google Map Category:Formula One circuits",
 "title": "Fuji Speedway"
}