{
 "id": "267202",
 "text": "Juan Martín del Potro was the defending champion, but chose not to compete this year, after a wrist operation in May and only starting to practice again in August. Rafael Nadal defeated Novak Djokovic 6–4, 5–7, 6–4, 6–2 to win his first US Open title. It was his ninth career major and Nadal completed the Career Golden Slam with the win. Nadal became the first player since Rod Laver in 1969 to win the French Open, Wimbledon, and the US Open all in the same calendar year. ==Seeds== # Rafael Nadal (Champion) # Roger Federer (Semifinals) # Novak Djokovic (Final) # Andy Murray (Third Round) # Robin Söderling (Quarterfinals) # Nikolay Davydenko (Second Round) # Tomáš Berdych (First Round) # Fernando Verdasco (Quarterfinals) # Andy Roddick (Second Round) # David Ferrer (Fourth Round) # Marin Čilić (Second Round) # Mikhail Youzhny (Semifinals) # Jürgen Melzer (Fourth Round) # Nicolás Almagro (Third Round) # Ivan Ljubičić (First Round) # Marcos Baghdatis (First Round) 17. Gaël Monfils (Quarterfinals) 18. John Isner (Third Round) 19. Mardy Fish (Fourth Round) 20. Sam Querrey (Fourth Round) 21. Albert Montañés (Fourth Round) 22. Juan Carlos Ferrero (Third Round) 23. Feliciano López (Fourth Round) 24. Ernests Gulbis (First Round) 25. Stanislas Wawrinka (Quarterfinals) 26. Thomaz Bellucci (Second Round) 27. Fernando González (First Round, retired due to a knee injury) 28. Radek Štěpánek (First Round) 29. Philipp Kohlschreiber (Second Round) 30. Juan Mónaco (First Round) 31. David Nalbandian (Third Round) 32. Lleyton Hewitt (First Round) 33. Michael Llodra (Third Round) ==Main draw== ===Finals=== ===Top Half=== ====Section 1==== ====Section 2==== ====Section 3==== ====Section 4==== ===Bottom Half=== ====Section 5==== ====Section 6==== ====Section 7==== ====Section 8==== ==Qualifying draw== # Ričardas Berankis # Rik de Voest # Ivan Dodig # Marc Gicquel # Andreas Haider- Maurer # Ryan Harrison # Robert Kendrick # Martin Kližan # Dušan Lojda # Adrian Mannarino # Kei Nishikori # Benoît Paire # Peter Polansky # Milos Raonic # Lukáš Rosol # Júlio Silva ==Other websites== * Official site of US Open Men's Singles",
 "title": "2010 US Open – Men's Singles"
}