{
 "id": "267356",
 "text": "is a prefecture in the Tōhoku region of Japan on the island of Honshu.Nussbaum, Louis-Frédéric. (2005). \"Provinces and prefectures\" in Japan Encyclopedia, p. 780; \"Tōhoku\" at p. 970. The capital city is Akita.Nussbaum, \"Akita\" at p. 20. Akita prefecture is famous for rice and sake. == History == The area of Akita was created from Dewa Province and Mutsu Province. ===Historic places=== * Senshu Park is 5 minutes walk from Akita Station. The site of castle of the Kubota Castle built by Satake, a daimyo from Hitachi. Landscape gardener, Abira Nagaoka, designed the park in 1896. The name \"Akita\" became established in Tenpyou era. == Geography == Akita Prefecture faces the Sea of Japan. It is bordered by Aomori Prefecture in the north, Iwate Prefecture in the east, Miyagi Prefecture in the southeast, and Yamagata Prefecture in the south. Mt. Chokai is the second hightest mountain in the Tohoku Region. Shirakami-Sanchi is a large mountain range along the border between Akita and Aomori prefectures. == Cities == There are 13 cities in Akita Prefecture: * Akita (capital) * Daisen * Katagami * Kazuno * Kitaakita * Nikaho * Noshiro * Oga * Ōdate * Semboku * Yokote * Yurihonjō * Yuzawa ===National Parks=== National Parks cover about 11% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\"; retrieved 2012-9-4. including * Towada-Hachimantai National ParkJapan Ministry of the Environment, \"Towada- Hachimantai National Park\" ; retrieved 2012-9-4. ===Hot Springs=== * Nyuto Hot Spring Village (There are seven hotels.) ** Tsurunoyu ** Taenoyu ** Kuroyu ** Ganiba ** Magoroku ** Oogama ** National Park Resort Village Nyuto Hot Spring ==Shrines and Temples== Ōmonoimi jinja and Tsutsukowake jinja are the chief Shinto shrines (ichinomiya) in the prefecture.\"Nationwide List of Ichinomiya,\" p. 2 ; retrieved 2012-9-4. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan == References == == Other websites == * http://www.pref.akita.jp/e/ Category:Akita Prefecture Category:Honshū Category:Provinces",
 "title": "Akita Prefecture"
}