{
 "id": "267418",
 "text": "Agnes Grey, A Novel is the first novel written by the English author Anne Brontë and first published in 1847. The novel is about a governess of that name and is said to be based on Anne Brontë's own experiences. Like her sister Charlotte's novel Jane Eyre, it addresses the uncertainty of the position of a governess. == Plot == Agnes Grey is the daughter of Mr. Grey, a minister who is not very rich, and Mrs. Grey, a woman who left her wealthy family and married out of love. Mr. Grey tries to make more money, but he end up losing money in an investment. That plunges the family into debt. Agnes, her sister Mary, and their mother all try to keep expenses low and bring in extra money, but Agnes is frustrated that everyone treats her like a child. To prove herself and to earn money for the family, she wants to be a governess. Eventually, she is offered a position, and gets her parents' permission. With some doubt about how it would be to be governess, she travels to to work for the Bloomfield family. The Bloomfields are rich and much crueller than Agnes had expected. Mrs. Bloomfield pampers her children while Mr. Bloomfield constantly finds fault with Agnes's work. The children misbehave a lot and Agnes is responsible for their behaviour even though she does not have power over them. Tom, the oldest Bloomfield child, even tortures small animals. In less than a year, Mrs. Bloomfield fires Agnes, thinks that her children are not learning quickly enough. Agnes then returns home. She then begs her mother to help her find a new position. Agnes advertises and is given a position in an even wealthier family – the Murrays. The two boys, John and Charles, are both sent to school soon after her arrival, but the girls Rosalie and Matilda remain in her care. Matilda is a tomboy and Rosalie is a flirt. Both girls are selfish and sometimes annoying, and although Agnes's position is slightly better than it was at the Bloomfield's, she is often ignored. Agnes then begins to visit Nancy Brown, an old woman with poor eyesight who needs help reading the Bible; there Agnes meets the new curate, Mr. Edward Weston. The next day while on a walk Agnes is surprised by Mr. Weston, who picks some wild primroses for her. Agnes later saves one of the flowers in her Bible. This new friendship is noticed by Rosalie Murray, who has now entered into society and is admired by nearly all suitors in the county. Rosalie becomes engaged to Sir Thomas Ashby, a wealthy baronet from Ashby Park. She tells Agnes, but makes her promise to keep silent, as she is still going to flirt with other men before she is married. One day, she and Agnes go on a walk and meet Mr. Weston. Rosalie begins to flirt with him, much to Agnes's irritation. Agnes receives a note from her sister Mary, who is now married to Mr. Richardson, a parson who lives near their home. Mary warns that their father is dying and begs Agnes to come. Agnes arrives too late to see her father alive. After his funeral, Agnes opens a small school with her mother, leaving behind the Murrays and Mr. Weston. She receives a letter from Rosalie who is very unhappy in her marriage and asks Agnes to come for a visit. Agnes is shocked by the change in Rosalie from a happy girl to an unhappy young woman. Rosalie tells Agnes that she hates Sir Thomas Ashby (and her mother-in-law), and claims he only left London because he was jealous of all the gentlemen she was attracting. Agnes also hears that Mr. Weston has left the area, and she is sad, believing she will not be able to see him again. Agnes leaves Ashby Park and returns home. Several months after she arrives, she goes for a walk on the sea shore and encounters Mr. Weston, who had been looking for her since he moved to the nearby parsonage. He is introduced to Agnes's mother, and they become friends. Agnes finds her attraction to him growing, and she accepts when he proposes marriage. In the end, Agnes is very happy having married Edward Weston, and they have three children together. ==Characters== *Agnes Grey – Main character and narrator. The younger daughter of a minister. She decided become a governess to support herself and her family. *Mary Grey - The elder sister of Agnes. *Richard Grey - The father of Agnes and Mary. A poor parson who loses most of his money he put in an investment *Mrs. Grey - The mother of Agnes and Mary. Squire's daughter and a woman of spirit. She married Richard despite of the wishes of her friends and family. She willingly let go of her better lifestyle for a life with him. \"An elegant house and spacious grounds were not to be despised; but she(Mrs. Grey) would rather live in a cottage with Richard Grey than in a palace with any other man in the world.\" *Mr. Weston – The curate at the local church. Rosalie describes him as \"an insensate, ugly, stupid blockhead\". Agnes disagrees, thinking he is much better than the rector, Mr Hatfield. *Mr. Bloomfield - The master of Wellwood House. He and his wife were Agnes's first employers. He keeps on blaming his children's faults in Agnes. Very particular about his food, he sends his food two times in a meal, on account of the food not being cooked well. *Mrs. Bloomfield - Mistress of Wellwood. Agnes’ first employer, she is convinced that her are really very good, and that Agnes is a bad example to them. She says this to Agnes after dismissing her, \"Though superior to most children of their(Mrs. Bloomfield's children) years in abilities, they were decidedly behind them in attainments; their manners were uncultivated, and their tempers unruly. And this she attributed to a want of sufficient firmness, and diligent, persevering care on my part. \" Her is described as, \"a tall, spare, stately woman, with thick black hair, cold grey eyes, and extremely sallow complexion.\" *Uncle Robson - The brother of Mrs. Bloomfield. Describes as \"a tall, self–sufficient fellow, with dark hair and sallow complexion like his sister, a nose that seemed to disdain the earth, and little grey eyes, frequently half–closed, with a mixture of real stupidity and affected contempt of all surrounding objects. He was a thick–set, strongly–built man, but he had found some means of compressing his waist into a remarkably small compass\". He frequently drinks a lot of wine. He encourages seven-year-old Tom to do so too. He also goes torturing animals with Tom. He also spoils Mary Ann. *Tom Bloomfield – The Bloomfield's son, well-grown seven years old boy. He is describes as a \"a well-grown boy of seven, with a somewhat wiry frame, flaxen hair, blue eyes, small turned-up nose, and fair complexion. He is very violent and cruel to animals. Commands his sisters as he thinks he is in charge of them as a boy. *Mary Ann Bloomfield – The eldest daughter of Bloomfields. Described as \"a tall girl\", \"somewhat dark like her mother, but with a round full face and a high colour in her cheeks.\" She wanted attention to herslef, and likes people to flatter her. *Fanny Bloomfield - The second daughter of Bloomfields. She was dishonest and mischevious. *Mr. Murray - He and his wife were the second employers of Agnes. Agnes does not see him much as he is always out. *Mrs. Murray - She is describes as a fashionable, showy woman. She wants her daughters to marry well. Matilda drives her crazy because of her tomboy ways. She convinces Rosalie that Sir Thomas Ashby's character is not as bad as is reported. *Rosalie Murray (also Miss Murray) – The eldest daughter of Murrays, silly but kind. She is very pretty. She is a selfish girl who flirts with any man she comes in contact with. She marries Sir Thomas Ashby because he is rich and has a title. She later regrets her marriage, and becomes closer to Agnes. *Mathilda Murray – The second daughter of the Murrays. A tomboy that loves horses, and likes to swear and use slang. *Mr. Hatfield – The rector at the local church. He loves Miss Murray but she does not answer his feelings. ==Other books by Anne Brontë== *Poems by Currer, Ellis and Acton Bell (1846) *The Tenant of Wildfell Hall (1848) ==Other websites== * Category:1847 books Category:English novels",
 "title": "Agnes Grey"
}