{
 "id": "267416",
 "text": "The Sons of Liberty was a secretive organization in Boston before and during the American Revolution. At that time, the British Empire controlled large parts of North America, including the thirteen original American colonies. The Sons of Liberty opposed British rule and led resistance efforts against them. Its leaders included Samuel Adams, James Otis, and Paul Revere. Other well- known members included Benedict Arnold and Patrick Henry. The group helped to organize the Boston Tea Party, and were involved in the Boston Massacre. The organization disbanded at the end of the American Revolution. == Beginnings == The Sons of Liberty formed in the summer of 1765 to fight the Stamp Act, which put a tax on paper to pay for British troops stationed in the Thirteen Colonies during the Seven Years War. They argued that this was \"taxation without representation\" because the British had imposed the tax without talking to any of the colonial legislatures. == Importance == The Sons of Liberty played a key role in preventing the Stamp Act from being enforced. They were a major force of pre-Revolution resistance against the British King and the colonial government. Often, their resistance focused on unfair taxation and financial limitations which the British government had imposed. They used petitions, demonstrations, boycotts, propaganda, and sometimes violence against British officials. Additionally, according to the official Boston Tea Party museum: > [They used] mob rule, tactics of fear, force, intimidation, violence such as > tarring and feathering, and the [collection] of arms, shot, and gun powder > [to] effectively [weaken] British rule, paving the way to America’s > independence. The [most important] act and lasting legacy of the Sons of > Liberty to the history of the American Revolution was the December 16, 1773 > [organization] of the Boston Tea Party which ultimately led to the outbreak > of the Revolutionary War... [It] was a catalyst for the start of war and a > principal reason why the Revolutionary War began in Massachusetts. Category:American Revolutionary War Category:Manhattan Category:Massachusetts Category:Nationalist organizations in the United States Category:1765 establishments Category:Secret societies Category:1760s establishments in Massachusetts == References ==",
 "title": "Sons of Liberty"
}