{
 "id": "267459",
 "text": "is a Japanese prefecture in the Kantō region on the island of Honshu.Nussbaum, Louis-Frédéric. (2005). \"Chiba prefecture\" in Japan Encyclopedia, p. 109. The capital city is Chiba City.Nussbaum, \"Chiba\" at p. 109. Chiba is the sixth most populous prefecture, and 27th largest by land area. == History == Chiba Prefecture is made from the old province of Awa, Kazusa and Shimōsa.Nussbaum, \"Provinces and prefectures\" at p. 780. == Geography == Chiba borders Ibaraki Prefecture to the north at the Tone River, Tokyo and Saitama Prefecture to the west at the Edo River, the Pacific Ocean to the east and Tokyo Bay around its southern boundary. Most of Chiba lies on the hilly Bōsō Peninsula, a rice farming region: the east coast, known as the Ninety-Nine League Plain, is an especially productive area. The most populous zone, in the northwest of the prefecture, is part of the Kantō region that extends into the urban agglomeration of Tokyo and Saitama. The Kuroshio Current flows near Chiba, which keeps it relatively warm in winter and cooler in summer than neighbouring Tokyo. ===Cities=== There are thirty-seven cities in Chiba Prefecture: * Abiko ‡ * Asahi * Chiba (capital) * Chōshi * Funabashi * Futtsu * Ichihara * Ichikawa * Inzai * Isumi * Kamagaya ‡ * Kamogawa * Kashiwa ‡ * Katori * Katsuura * Kimitsu * Kisarazu * Matsudo ‡ * Minamibōsō * Mobara * Nagareyama ‡ * Narashino * Narita * Noda ‡ * Ōamishirasato * Sakura * Sanmu * Shiroi * Sodegaura * Sōsa * Tateyama * Tomisato * Tōgane * Urayasu * Yachimata * Yachiyo * Yotsukaidō ‡ Scheduled to be dissolved after mergers. ===Towns and villages=== These are the towns and villages in each district: {| class=wikitable District Municipality Awa District Kyonan Chōsei District Chōnan Chōsei District Chōsei Chōsei District Ichinomiya Chōsei District Mutsuzawa Chōsei District Nagara Chōsei District Shirako Inba District Sakae Inba District Shisui ===National Parks=== National Parks are established in about 6% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\". Retrieved 2012-3-13. == Economy == Chiba is one of Japan's biggest industrial areas. This is because it has a long coastline on Tokyo Bay. Chiba was chosen as the place for a major Kawasaki Steel factory in 1950. The prefectural government started a very big land reclamation program. They filled in the water areas to make big, new waterfront properties for factories, warehouses, and docks. Chemical production, petrochemical refining, and machine production are the three main industries in Chiba. They are 45% of Chiba's exports. In recent years, the government has given more than eighty industrial parks money. This is to bring development further inland. Chiba also has the second-highest farming output in Japan. Only Hokkaidō makes more farm products. Chiba makes more vegetables than Hokkaidō. Seaweed is harvested in big amounts from Tokyo Bay. == Culture == ===Chiba in popular culture=== * Novels set in Chiba include: Neuromancer by William Gibson (set in Chiba city), Ningen Shikkaku by Osamu Dazai (Funabashi), and Nogiku no Haka by Sachio Itō (Matsudo). * Manga include: Be Free!, Ah! Megamisama,Chameleon, Kyō Kara Ore Wa!!, Makuhari (set in Chiba city), Makuhari Saboten Campus (Chiba city), Susume!! Pirates, and Urayasu Tekkin Kazoku (Urayasu). * Anime include: Chikyū Bōei Kazoku (set in Funabashi), Battle Programmer Shirase (Narashino), and Zegapain (Urayasu). * TV programs include: Kisarazu Cat's Eye (set in Kisarazu), Mio Tsukushi (Chōshi), Beach Boys (filmed in Tateyama and Shirahama (now Minamiboso) and Yappari Neko ga Suki (Chiba city). * Many rock bands started in Chiba, including the popular X Japan, Plastic Tree, girugamesh and punk bands like Nicotine and Ellegarden. * Aiba Masaki of Arashi, Yamashita Tomohisa of NEWS, Tanaka Koki and Akanishi Jin of KAT-TUN, Ryo, Satoshi, Ni and ShuU Girugamesh, Tsugunaga Momoko of Berryz Kobo and Arioka Daiki of Hey! Say! JUMP are all from the Chiba Prefecture. == Sports == Two major Japanese sport events happen in Chiba each year: the International Chiba Ekiden and the Chiba International Cross Country. These sports teams are based in Chiba. ===Football=== * JEF United Chiba (Chiba, Ichihara) * Kashiwa Reysol (Kashiwa) ===Baseball=== * Chiba Lotte Marines ===Rugby=== * IBM Big Blue (Yachiyo) * Kubota Spears (Funabashi) * NEC Green Rockets (Abiko) == Transportation == Most Tokyo-bound visitors going to Tokyo arriving on international flights land in Narita International Airport, which is in Narita in the north of the prefecture, and connected to Tokyo by the East Japan Railway's Narita Express and the Keisei Electric Railway's Skyliner. === Railway === * East Japan Railway Company ** Sōbu Main Line *** Chūō-Sōbu Line *** Sōbu Line (Rapid) ** Jōban Line *** Jōban Line (Local) *** Jōban Line (Rapid) ** Narita Line ** Uchibō Line ** Sotobō Line ** Keiyō Line ** Musashino Line ** Tōgane Line ** Kashima Line ** Kururi Line ** Isumi Line ** Kominato Line == Tourism == The Tokyo Disney Resort is in Urayasu near the western border of the prefecture. The Kamogawa Sea World is a large scale comprehensive marine leisure center/museum equivalent facility located between the Tojo coast and the national highway No. 128 in Kamogawa city. There are several tourist sites on the Bōsō Peninsula, such as Mount Nokogiri; Kujūkuri Beach; and Onjuku Beach. Chiba is linked to Tokyo by several railway lines; the main ones are the Keiyo Line and Sobu Line. The Musashino Line connects Chiba to Saitama and northern Tokyo. Southern Chiba is connected to Kanagawa Prefecture by the Tokyo Bay Aqua-Line bridge-tunnel. == Prefectural symbols == Chiba is famous for peanuts. Most of Japan's peanuts are harvested in this prefecture and are also processed into peanut oil. ==Shrines and Temples== Awa jinja and Tamasaki jinja are the chief Shinto shrines (ichinomiya) in the prefecture. \"Nationwide List of Ichinomiya,\" p. 2 . Retrieved 2012-3-14. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan ==References== ==Other websites== * Official Chiba Prefecture website * Chiba Information Guide * Japan Statistical yearbook",
 "title": "Chiba Prefecture"
}