{
 "id": "267680",
 "text": "{{Infobox settlement | name = Shimane Prefecture | native_name = | settlement_type = Prefecture | translit_lang1 = Japanese | translit_lang1_type = Japanese | translit_lang1_info = | translit_lang1_type1 = Rōmaji | translit_lang1_info1 = | image_skyline = | image_flag = Flag of Shimane Prefecture.svg | flag_size = 100px | image_blank_emblem = Emblem of Shimane Prefecture.svg | blank_emblem_size = 80px | blank_emblem_type = Symbol | image_map = Map of Japan with highlight on 32 Shimane prefecture.svg | coordinates = | subdivision_type = Country | subdivision_name = Japan | subdivision_type1 = Region | subdivision_name1 = Chūgoku (San'in) | subdivision_type2 = Island | subdivision_name2 = Honshu | seat_type = Capital | seat = Matsue | parts_type = Subdivisions | parts_style = para | p1 = Districts: 5 | p2 = Municipalities: 19 | leader_title = Governor | leader_name = Tatsuya Maruyama | area_total_km2 = 6,708.26 | area_water_percent = 2.7 | area_rank = 19th | population_footnotes = | population_total = 665205 | population_as_of = February 1, 2021 | population_rank = 46th | population_density_km2 = auto | demographics_type2 = GDP | demographics2_footnotes = | demographics2_title1 = Total | demographics2_info1 = JP¥ 2,689 billion US$ 24.7 billion (2019) | iso_code = JP-32 | website = | module = | anthem = Usu-murasaki no yamanami }} is a Japanese prefecture in the Chūgoku region of the island of Honshu.Nussbaum, Louis-Frédéric. (2005). \"Shimane Prefecture\" in Japan Encyclopedia, p. 859; \"Chūgoku\" at p. 127. The capital is the city of Matsue.Nussbaum, \"Matsue\" at p. 617. It has the second smallest population of any prefecture in Japan. Shimane Prefecture is part of the San'in area. San'in means \"the shady side of the mountains\". There is a mountain range separating Shimane and neighboring Tottori from Hiroshima and Okayama. That means that the weather here is much wetter than further to the south. == History == The area of Shimane Prefecture includes the old provinces of Iwami Province, Izumo Province, and Oki Province.Nussbaum, \"Provinces and prefectures\" at p. 780. === Early history === The history of Shimane starts with Japanese mythology. In these myths, the Shinto god Ōkuninushi lived in Izumo, an old province in Shimane. Izumo Shrine honors this god. Later on in the Kamakura period, the Kamakura Shogunate forced Emperor Gotoba and Emperor Godaigo into exile on Oki Island. Emperor Godaigo got away from Oki and successfully fought back against the shogunate. === Middle Ages === During the Muromachi period, many clans fought over this area because there was a lot of silver. The Kyogoku clan controlled Izumo and Oki. However, after the Ōnin War, the Amago clan in Gassan-Toda castle increased in power, and the Masuda clan controlled Iwami. Iwami Ginzan Silver Mine was in between Amago clan territory and Masuda clan territory, so there were many battles between these lords for the large amount of silver. However, in 1566 Mouri Motonari (毛利元就) conquered Izumo, Iwami, and Oki. After over 30 years of Mori control, in 1600 Horio Yoshiharu entered Izumo and Oki after the Battle of Sekigahara which Mouri lost. Horio Yoshiharu decided to move and build Matsue Castle instead of Gassan-Toda. The castle was completed soon after Yoshiharu's death. Later in 1638, the grandson of Tokugawa Ieyasu, Matsudaira Naomasa entered the castle because the Horio clan had no heir. Matsudaira's family ruled until the end of the han system. The Iwami area was split into 3 clans. The mining district was under direct control of the Shogunate. The Hamada clan and the Tsuwano clan each controlled their own areas. Iwami Ginzan produced silver and was one of the nation's largest silver mine by the early 17th century. The Hamada clan was on the shogunate's side in the Meiji Restoration, and the castle was burned down. The Tsuwano clan, despite the Matsudaira (relative of the shogun) rule was on the emperor's side in the restoration. ===Historic sites=== * Iwami Ginzan Silver Mine (石見銀山) is a UNESCO World Heritage Site * Yunotsu - An old onsen town with architecture preserved from the 1920s ==Geography== Shimane faces the Sea of Japan on its north. Its southeastern border meets Tottori Prefecture, Hiroshima Prefecture and Yamaguchi Prefecture. ===Cities=== * Matsue (松江) - The prefectural capital city, Matsue has an original castle. Most castles in Japan have been rebuilt in modern times. Lafcadio Hearn lived and wrote here. * Izumo (出雲) - Site of Izumo Taisha, one of Japan's most famous shrines. * Hamada (浜田) - Fishing port and recreation area. * Tsuwano (津和野) - This is also called \"Little Kyoto\". Mori Ogai was born here. * Masuda (益田) - The westernmost city in Shimane and long-time home of Sesshu, an important artist in Japanese history. * Gotsu (江津) - A small industrial city between Hamada and Oda. * Ōda (大田) - Close to Iwami Ginzan and Mt. Sanbe. * Yasugi - Site of the Adachi Art Museum. ===National Parks=== National Parks are established in about 6% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\"; retrieved 2012-3-13. ==Shrines and Temples== Izumo taisha, Mononobe jinja, Mizuwakasu jinja and Yurahime jinja are the chief Shinto shrines (ichinomiya) in the prefecture.\"Nationwide List of Ichinomiya,\" p. 2 ; retrieved 2012-8-27. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * :Category:People from Shimane Prefecture ==References== == Other websites == * Shimane Prefecture website",
 "title": "Shimane Prefecture"
}