{
 "id": "26769",
 "text": "Aldi is a supermarket in Germany and in most parts of the European Union. Aldi shops are also in Australia, the UK and the United States. Most German towns and villages have at least one Aldi shop. There are about 4,100 stores in Germany, and 7,600 worldwide. The name of the shop stands for ALbrecht- DIscount. The company is a food retailer, but it also sells non-food at times. In the 1990s, Aldi often sold computers that were sought after. Aldi has a reputation for being cheap. It forces its suppliers to sell to them at low prices. == History == The company was started in 1913 as a family grocery business in Essen. In 1946, brothers Karl Albrecht (1920-2014) and Theo Albrecht (1922-2010) took over the business from their mother. Theo had been held by the US in a prisoner of war camp. They started the idea of discount shops in Germany. They decided to have a limited range of goods and sell them at a discount price. In 1960, the company was split into Aldi Nord (Aldi North) under the control of Theo, and Aldi Süd (Aldi South) under the control of Karl. The brothers became billionaires. In 2009 Karl's wealth was estimated to be €25 billion. Theo was kidnapped in 1971 and held prisoner for 17 days until a seven million mark ransom was paid. The family have avoided publicity and there are few known photographs of them. === Geographic distribution === Country Name Aldi group Since Outlets Aldi Nord 1946 2,400 Aldi Süd 1946 1,790 Aldi Süd 2001 311 Hofer Süd 1968 430 Aldi Nord 1976 380 Aldi Nord 1977 244 Aldi Nord 1988 680 Aldi Süd 2008 75 Aldi Süd 1998 105 Aldi Nord 1990 12 Aldi Nord 1973 406 Aldi Nord 2008 100 Aldi Nord 2006 36 Hofer Süd 2005 71 Aldi Nord 2002 250 Aldi Suisse Süd 2005 130 Aldi Süd 1990 550 Aldi Süd 1976 1,200\"Discount grocer opens North Bergen store\" . The Hudson Reporter. 26 March 2013. Trader Joe's Nord 1979 399 total number of Aldi Nord stores 4,805 total number of Aldi Süd stores 4,430 combined total of Aldi stores 9,235 ==Australia== Aldi started in Australia in 2001. At the end of 2010 there were 210 Aldi stores in eastern Australia and the company were planning to open 20-30 stores each year. In 2009 the Australian stores made a profit of AU$91.94 million, up 27% on 2008. In January 2024 Aldi was operating 591 stores in Australia. == United Kingdom == Aldi opened its 1000th store in the UK in September 2023 - in the affluent town of Woking. It is the UK’s fourth- biggest grocer by market share and plans to open 500 more. Sales had increased by 21% in August from a year earlier. It has lower operational costs than other supermarkets and sells mostly own-label products. == References == == Other websites == * Aldi International (with links to all of Aldi's international websites) * ALDI Near Me (ALDI store locator Australia) Category:1913 establishments in Europe Category:1910s establishments in Germany Category:Supermarkets of Germany",
 "title": "Aldi"
}