{
 "id": "267714",
 "text": "Roblox is an online free to play video game and game creation system made by the Roblox Corporation. It was created by David Baszucki and Erik Cassel in 2004 and released in 2006. The old name for Roblox was \"Dynablocks\". Roblox allows players to create games and play games created by others, with many different types of games available. Roblox can be played on Mobile, PC, Playstation and Xbox. Virtual accessories to decorate User Avatars can be bought in the store using \"Robux\", a currency which costs real money to obtain but can also be earned by selling virtual items to other players. Roblox has over 205 million monthly active players and began to grow fast in 2021. By December 2022, Robloxes popularity had fallen. It had 55.1 million daily active users worldwide. This is an increase from 19.1 million daily active users by the end of 2019. == History == In 1989, David Baszuki and his brother Greg Baszuki released an Interactive Physics Software under the company they founded called Knowledge Revolution. The software was designed to teach Students about Physics in a 2D Space. By 2004, David and his friend Erik Cassel had started working on a new 3D Multiplayer game, originally known as DynaBlocks, but eventually changed the name to Roblox. Later, Roblox published its beta version to public. Roblox had made many big changes in 2006. In January 2006, Roblox had implemented Multiplayer. In September 2006, Roblox left Beta and was made free for all players. later that Month, Roblox made changes to the multiplayer API so that players could make their own Multiplayer Games instead of just the Roblox Developers. In May 2007, the Roblox Developers began making virtual items. Its first virtual item being a Red Baseball Cap. Later that year, Roblox started the Paid Membership known as Builders Club. In 2008, Roblox released a mode called Guest Mode, which allowed users to play Roblox without creating an account, but had some limitations. Higher forms of the Builders Club were started in 2009. These were known as the Turbo Builders Club and the Outrageous Builders Club. In 2010, Roblox Studio was changed so that game developers could understand its features easily. The next year, Roblox released its first Commercial. The Commercial had the well-known quote, \"IT'S FREE!\" On April 1st, 2012, Roblox was hacked. It caused the Roblox website to be shut down that day. By April 2nd, 2012, the website was recovered. The hacking incident is mostly known as the 'April Fools Hacking Incident'. In 2013, Roblox added dynamic lighting. Its purpose was to make the lighting in the game more realistic. This update received more updates over time. In June 2015, Roblox released Smooth Terrain. This made the Terrain (such as Sand, Grass, Water, etc.) look better. On 14 April 2016, the Roblox Currency Tix was removed. In September 2016, Roblox released R15 to the public, which allowed for Users to have more Parts in their Limbs.. In January 2017, Roblox changed their logo. The YouTube channel for the game also released a music video to showcase it. Later, in October, Roblox removed Guest Mode due to most using it as a way to use Exploits without having any repercussions. In 2019, Builders Club was replaced with Roblox Premium. In December 2020, Roblox announced that players would soon no longer need Premium to upload Clothing. Although, they would have to pay a fee of 10 Robux for each upload. The change was implemented in March 2021. In August 2021, Roblox bought the Company of a communication app known as Guilded for 90 million USD. In the same month, they chose some developers to test out Voice Chatting features. In October 2021, Roblox had to shut down the website due to many Backend Modules having issues causing the site to be down for a record 3 Days. Despite popular belief, it wasn't caused by the Restaraunt Chipotle coming to the site for free Burrito Coupons. Shortly after in October 2023, Roblox removed a once loved Xbox theme from 2017, which brought up lots of Controversy among the Community. == Legal issues == In May 2021, a 12 Year Old user filed a class action lawsuit against the Roblox Corporation. The suit said that they were scamming players by not giving out refunds when banned items get deleted. In June 2021, a group of Music Publishers sued the Roblox company for mass Copyright Infringement due to users uploading many copyrighted songs without permission, with the publishers seeking 200 million USD from them. In March 2022, Roblox was once again sued, which led to Roblox removing all user-made audio longer than 6 seconds. Along with the update, they added more Sound Effects made by official developers as the Community Works towards getting audio and background music back. They also limited Audio Publishing to 180 Audio Files a month. A policy exists within in the game that with an account, if any copyrighted thing, (e.g. characters, places) was to be in a lawsuit, the account owner would be at fault. == Game creation == Roblox lets its players create their own games using its own separate app, Roblox Studio. Players can build anything they want by using the Studio, and then publish their game to the Roblox website for anyone to play. Roblox encourages its players to create new games because every game is made by other users. However, it is only available on MacOS and Microsoft Windows. == Games in Roblox == See main article, List of Roblox games There are over 18 million unique games in Roblox. == Virtual items and currency (Robux)== Players on Roblox can buy virtual items from the Catalog using virtual currency named 'Robux'. This currency is obtained by buying a Roblox Premium Membership or from a Gift Card. It can also be made by selling items like Game Passes or Accessories to other players for Robux, as well as making Clothing Items or playing Donation Games. Another form of currency was the Tix, also known as Tickets. All players could get a few Tix each day when they log into the game. They could trade those Tix for Robux. Tix were removed in April 14th 2016. == Membership == Builders Club was Roblox's first Membership club which could only be used through a purchase. Builders Club gave its members more features in Roblox, such as earning its virtual currency called Robux, and the ability to trade items. Another thing players could do was sell Limited items (buy- able and sell-able items on the Avatar Shop). There were three types of Builders Club: Classic, Turbo, and Outrageous. Classic was the original Builders Club type and Outrageous was the newest. Players would either buy it monthly or annually. In 2019, Builder's Club was removed and replaced with Premium. Premium is very much like the original Builders Club except it gives players Robux every month instead of daily. Premium players also get access to perks in select games and get discounts from User-generated content. == References == Category:2006 video games Category:Android (operating system) games Category:Free online games Category:IOS games Category:MacOS games Category:Massively multiplayer online games Category:Online games Category:Social simulation video games Category:Game engines Category:Video games developed in the United States Category:Windows games Category:Xbox One games",
 "title": "Roblox"
}