{
 "id": "268007",
 "text": "The Last Day of the Dinosaurs is a 2010 Discovery Channel television documentary about the extinction of the dinosaurs. It portrays the asteroid as the cause of the extinction. ==Featured genera== * Hypselosaurus * Ankylosaurus * Parasaurolophus * Hypacrosaurus * Quetzalcoatlus * Troodon * Triceratops * Tyrannosaurus * Mesodma * Cockroach * Scorpion ==Plot== In the Pacific Northwest of North America, in the Hell Creek Formation, a Quetzalcoatlus is flying above the Late Cretaceous landscape, looking for food. It finds a nest of Tyrannosaurus rex chicks that have just hatched. It picks them up in its beak and eats them to death. Suddenly, the father of the brood appears, and starts fighting the Quetzalcoatlus. He grabs it by the wing, but it manages to escape. Only one chick survives the horror. Meanwhile, the asteroid is getting closer to Earth. The narrator says that it was caused by the collision of two asteroids 150 million years ago. One of the fragments is heading towards Earth. In the Pacific Northwest, two male Triceratops horridus fight for mating rights. One of them wins. The loser walks away. Suddenly, two Tyrannosaurus attack and kill the male. They start feeding on his carcass. Nearby, in France, a herd of Hypselosaurus is roaming the plains in search of food. They are the giants of prehistoric France, even by dinosaur standards. They are big, but only a little small as other sauropods, and they weigh only a few tons. Their small size demands that they eat a lot of vegetation to maintain their bulky size. Meanwhile, the asteroid enters the Earth's atmosphere. It is burning brighter than a million suns. The scorching light sears the Hypselosaurus' eyeballs, blinding them. Then, the asteroid hits the Earth in the Gulf of Mexico, near the Yucatan Peninsula. In a fraction of a second, it dives into the planet. The air temperature near the crash site now reaches 600 degrees Fahrenheit. The Hypselosaurus are burned alive. In the Pacific Northwest, the Quetzalcoatlus can see the impact. Meanwhile, Canada is 8,000 miles away from the point of impact. A herd of Parasaurolophus walkeri is drinking at a watering hole. They are protecting their eggs. Suddenly, a Troodon appears. Its brain-to-body weight ratio is among the highest of any dinosaur. It steals an egg, but is seen by the mother of the group. It runs into a cave. A second Troodon is in the cave. The two predators start chasing the Parasaurolophus. They jump on its neck and slash with their retractable toe claws, killing their prey. Then they start feasting on the carcass. Millions of tons of dust and rock were thrown up into the air by the asteroid's impact. This is the ejecta cloud. In Canada, the ejecta cloud causes the temperature to become hotter. As the air temperature reaches 120 degrees, the Troodons run inside the cave. The temperature ticks upward every second. The Parasaurolophus go into the cave. Inside the cave, it is cooler. However, the Parasaurolophus and Troodon are forced to share the cave with each other, even though they are enemies to some of the herbivorous dinosaurs, such as Hypacrosaurus, Panoplosaurus, Parksosaurus, and Eotriceratops. Back in Hell Creek at North America, fires burn across the forest floor at 9 miles per hour. The Tyrannosaurus and the Triceratops are running to get away from the fire. The panicked animals race up the valley slopes. In Canada, the temperatures are finally starting to decrease. The Troodon run outside and start feeding on a parasaur corpse. Soon, the Parasaurolophus herd follow. However, one stays near the protection of the cave. However, the dinosaurs are not safe yet. The ejecta cloud has caused a huge sandstorm. As it hits, the Troodons are small enough to crouch for cover. But the parasaurs are out in the open. The harder they struggle and the deeper they need oxygen, the more sand fills their lungs, until finally, they can't breathe. It's hours before the winds die down. The last Parasaurolophus, protected once again by the cave, finds that it's the last of the herd. But it's not the last remaining dinosaur in the neighborhood. The Troodons were sheltered from the worst of the storm. They have survived. Instinct drives the Troodon back to their prime hunting spot, the watering hole, where the last remaining Parasaurolophus is drinking. The Troodon are desperate for food. One of them has the confidence to attack. The Troodon runs to the parasaur and leaps on it. It starts slashing at its neck. The parasaur is still too exhausted to run. Suddenly, the Parasaurolophus crashes to the ground, crushing the Troodon to death under its weight. The remaining Troodon starts eating the dead body of its companion. A week after impact, food is in very short supply across the entire planet. In the Pacific Northwest, two Triceratops are searching for food. Their hunger drives them to the Pacific coast. They see an island. Protected from the fires by the surrounding ocean, the island is lush and green. It has all the food that the Triceratops need. But when the asteroid hit the Earth, it caused an earthquake under the ocean. This causes a huge tsunami. The ocean is dragged back hundreds of feet. The path to the island is suddenly dry land. The Triceratops walk across the land bridge to the island. However, the tsunami crashes down on them, flooding the land. The Triceratops drown. In the days and weeks that follow, few dinosaurs remain. In Canada, the starving Parasaurolophus stays close to the cave that has saved it twice in the past. Suddenly, it collapses, but not from starvation. Bubbling to the surface from hot springs is one of nature's most toxic gases; Hydrogen Sulfide. The Troodon runs up to the dead hadrosaur. Then, it too dies from inhaling the poisonous gas. In the Pacific Northwest, only a handful of dinosaurs patrol the gray wasteland. An Ankylosaurus magniventris, severely weakened by hunger, is searching for food. All it can find is a small bush. But even that won't come without a fight. A Triceratops horridus becomes angry at the Ankylosaurus. Suddenly, a Tyrannosaurus rex appears. It frightens the herbivores. Then it kills the Triceratops. The Ankylosaurus tries to defend itself with its heavy tail club, but it's too weak to fight. The Tyrannosaurus flips the Ankylosaurus over and bites its soft underbelly, killing it. Then the Tyrannosaurus collapses from hunger. It falls on the Triceratops' horn and is impaled by it after tripping over the Ankylosaurus. In France, the first region to be hit by the asteroid, life still remains in this country. Buried in the cool ground inside its egg, a Hypselosaurus baby has survived. And so has an adult Hypselosaurus. All around the world, small handfuls of dinosaurs try to start over. But their species are already considered extinct. In order to survive, any species needs to maintain a critical mass of population. If it falls below that threshold, then there's no way to climb back from certain extinction. But life on Earth is not completely destroyed. Out of the ruins, nature starts over. A group of animals that have long been limited in success by the dinosaurs now become the new rulers of the Earth: mammals. Eventually, they multiply and diversify. 10,000 species explode across the planet. And one species, humans, branches off from its relatives and comes down from the trees. They walk on two legs, evolve bigger brains, and eventually, they rule the planet. They build cities that touch the sky, vehicles that can leave the planet, and weapons that can destroy it. In the end, the narrator says that humans would never have existed if a chance collision in space 150 million years ago had not occurred, sending an asteroid hurtling towards Earth and dooming the dinosaurs to extinction. ==Inaccuracies== *There is no evidence for a collision of meteorites. Meteorites tend to break up as they enter the atmosphere * Troodon mongoliensis didn't live at the end of the age of dinosaurs. It lived in earlier stages of the Late Cretaceous. * Charonosaurus wasn't discovered in Mongolia. It lived in northeastern China. It was found on the southern bank of the Amur River, on the border with Siberia. ==Trivia== * The dinosaur models used here are the same as those used in Clash of the Dinosaurs. The Parasaurolophus was used for the Charonosaurus, the Deinonychus was used for Saurornithoides, and the Sauroposeidon model was used for Alamosaurus. The same Tyrannosaurus, Triceratops, Ankylosaurus, and Quetzalcoatlus models were also used. * It is never shown how the female Quetzalcoatlus dies. However, she is last seen flying away from the tsunami, so it is presumed that she was killed by the tsunami. * When the narrator explains that the air temperature is hot enough to boil away the water in the Alamosaurus' skin, water is seen flying off the dinosaurs' necks. ==References== *http://dsc.discovery.com/videos/last-day-dinosaurs/ Category:Dinosaurs Category:Television movies Category:2010s documentary movies Category:Discovery Channel",
 "title": "The Last Day of the Dinosaurs"
}