{
 "id": "268291",
 "text": "Liu Xia (; born 1 April 1961, Beijing, China) is a painter, poet, and photographer who resides in Beijing, China. She was married to 2010 Nobel Peace Prize winner Liu Xiaobo. ==Biography== Liu used to be a civil servant in the Beijing tax bureau. She met her husband Liu Xiaobo while part of the Beijing literary scene in the 1980s.Boelinger, Mathias (8 October 2010). \"Wife of Nobel Peace Prize winner talks about daily struggle\", Deutsche Welle She married Liu Xiaobo while he was in prison in a Chinese labor re-education camp between the years of 1996 and 1999. Ms. Liu prefers to lead the solitary life of an intellectual. However, she has been forced to act for her husband in public because of he is often in prison for his activism. She has been described as her husband's \"most important link to the outside world.\" She also personally experiences pressures from the Chinese authorities for publicly voicing opinions because she is the wife of one of China's most prominent human rights advocates.Nobel winner's wife: Prize brings hope, 8 October 2010 - msnbc.com Since his arrest, the government has watched her constantly. She speaks out on issues of human rights both for herself and for her husband. Although she may not want always want to, she has continued to speak publicly all during their marriage and while her husband has been in prisonJailed Chinese dissident wins Nobel Peace Prize, By Bill Schiller, 8 Oct 2010 The StarChina dissident's wife pleads for detained husband , By Lucy Hornby, 11 Feb 2009, Reuters Despite the pressures, she attempts to keep her life normal. Liu Xiaobo's was sent to prison for 11 years after he helped write the political manifesto 2008 called Charter 08. Liu Xia begged her husband to not participate in writing the document.Nobel Peace Prize Goes to Chinese Dissident Liu Xiaobo, By ANDREW JACOBS and JONATHAN ANSFIELD, Published: 8 October 2010 New York Times At first, he did as she asked. But later, he spent much of his time writing and re-writing the document which took three years. He later got more than 300 prominent workers, Chinese Communist Party members, and intellectuals, to sign the charter. 10,000 people added their names to a charter support list on the Internet. After it was announced that her husband had won the Nobel Peace Prize, Liu Xia said that “For all these years, Liu Xiaobo has persevered in telling the truth about China and because of this, for the fourth time, he has lost his personal freedom.\" She also said that she would visit him in jail and \"give him a big hug\". After visiting him, however, she was placed under house arrest and her mobile phone number was canceled.Mark MacKinnon Wife of Nobel laureate under house arrest after informing him of win The Globe and Mail 10 October 2010 Liu Xiaobo died on 13 July 2017 from liver cancer complications. ==Related pages== *List of Chinese painters *Liu Xiaobo == References == Category:1961 births Category:Living people Category:21st-century Chinese poets Category:20th- century Chinese painters Category:Photographers Category:21st-century Chinese painters Category:20th-century Chinese poets",
 "title": "Liu Xia (poet)"
}