{
 "id": "268302",
 "text": "Václav Havel (), 5 October 1936–18 December 2011, was a Czech playwright, essayist, dissident and politician. He was the tenth and last President of Czechoslovakia (1989–92). He then became the first President of the Czech Republic (1993–2003). He wrote more than twenty plays and many non-fiction works. Many of them were translated into multiple languages. Beginning in the 1960s, Havel mostly wrote about the politics of Czechoslovakia. After the Prague Spring, he became more and more active against the government. In 1977, he became famous internationally for his work on the human rights manifesto, Charter 77. He became known as a leader of the opposition in Czechoslovakia. He was also sent to prison for these activities. The 1989, Havel became president during the \"Velvet Revolution\". As president, he led Czechoslovakia and later the Czech Republic to an open democracy with several political parties. His country changed greatly during the thirteen years he was president. The Czech Republic separated from Slovakia, even though Havel was against separation. The Czech Republic also joined NATO and started negotiating membership in the European Union. The country became a member of the EU in 2004. He was one of the first people to sign the Prague Declaration on European Conscience and Communism. == Early life == Václav Havel was born in Prague, Czechoslovakia on 5 October 1936. He grew up in a well-known and wealthy entrepreneurial and intellectual family. His family was active in culture and politics in Czechoslovakia from the 1920s to the 1940s. His father owned part of the suburb of Barrandov. This is the highest part of Prague. Havel's mother came from a well-known family. Her father was an ambassador and journalist. Havel completed his required education in 1951. However, the Communist government did not allow him to continue to study formally because of his bourgeois family background. In the early 1950s, the young Havel entered a four-year apprenticeship as a chemical laboratory assistant. He took evening classes at the same time and completed secondary education in 1954. None of the colleges or universities with humanities programs would accept Havel for political reasons. So, he chose to study at the Faculty of Economics of Czech Technical University in Prague. He dropped out after two years.Vaclav Havel — Biography. The official website of Vaclav Havel. Retrieved 4 June 2008. In 1964, Havel married Olga Šplíchalová. His mother was against the marriage.David Remnick, \"Exit Havel\" , The New Yorker 10 February 2003, accessed 29 April 2007., http://www.kirjasto.sci.fi/vhavel.htm . Petri Liukkonen (author) & Ari Pesonen. Kuusankosken kaupunginkirjasto 2008. 4 December 2008. ==Presidency== Havel was already leader of the Civic Forum, and on 29 December 1989, he became president. He left office after his second term as Czech president ended on 2 February 2003. Every member of the Federal Assembly voted to make him president. This was a surprising change because Havel had always said that he was not interested in politics. He and other dissidents had said that change should come from groups of people directly, not from the government.Stanger, Richard L. \"Václav Havel: Heir to a Spiritual Legacy\" . The Christian Century (Christian Century Foundation), 11 April 1990: 368–370. Rpt. in religion-online.org (\"with permission\"; \"prepared for Religion Online by Ted & Winnie Brock\"). [\"Richard L. Stanger is senior minister at Plymouth Church of the Pilgrims in Brooklyn, New York.\"]Tucker, Scott. \"Capitalism with a Human Face?\". The Humanist (American Humanist Association), 1 May 1994, \"Our Queer World\". Rpt. in High Beam Encyclopedia (an online encyclopedia). Accessed 21 December 2007. [\"Vaclav Havel's philosophy and musings.\"] Czechoslovakia had free elections in 1990. Havel won and continued to be president. Havel wanted to keep the federation of the Czechs and the Slovaks together during the breakup of Czechoslovakia. He supported keeping the country together even though this was difficult and there was a lot of pressure. On 3 July 1992 the federal parliament did not elect Havel — the only candidate — because Slovak MPs did not support him. Havel resigned as president on 20 July after the Slovaks issued their Declaration of Independence. He stood for election as president of the new Czech Republic in 1993. He won and became president of this new, separate country. Havel was quite popular throughout his career. However, some of his actions caused controversy and criticism. One of his first acts as a president was to pardon many people. He wanted to reduce the number of people in overcrowded prisons and release people who had been put in prison during the Communist era even though they were innocent. He did not trust the decisions of a corrupt court of the previous government. He thought the courts had been unfair to most people in prison.Havel's New Year's address Critics said that this amnesty caused more crime. In his memoir, To the Castle and Back, Havel wrote that most of the people he released had less than a year left to stay in prison. Statistics about this are not clear. Havel said that the most important thing he did as president was breaking up the Warsaw Pact. Ending this group of countries was very complicated because the association was a deep part of how the countries worked. It took two years before the Soviet troops finally left Czechoslovakia completely. Havel was very important to changing NATO. He helped change it from an anti-Warsaw Pact alliance to a group that includes former-Warsaw Pact members. Havel spoke very strongly for expanding of the military alliance into Eastern Europe, including the Czech Republic.Václav Havel, \"NATO: The Safeguard of Stability and Peace In the Euro-Atlantic Region\", in European Security: Beginning a New Century, eds. General George A. Joulwan & Roger Weissinger-Baylon, papers from the XIIIth NATO Workshop: On Political-Military Decision Making, Warsaw, Poland, 19–23 June 1996.Žižek, Slavoj. \"Attempts to Escape the Logic of Capitalism\" . Book review of Vaclav Havel: A Political Tragedy in Six Acts, by John Keane. the London Review of Books, 28 October 1999. Retrieved 21 December 2007. ==Awards== He has received many awards, including: *The Philadelphia Liberty Medal *The freedom medal of the Four Freedoms Award *The Ambassador of Conscience Award ===State awards=== Country Awards Date Place Order of the Liberator San Martin Collar 09/1996 Buenos Aires Decoration for Science and Art 11/2005 Vienna Order of the Southern Cross Grand Collar Order of Rio Branco Grand Cross 10/1990 09/1996 Prague Brasília Order of Canada Honorary Companion 03/2004 Prague Order of the White Lion 1st Class (Civil Division) with Collar Chain Order of Tomáš Garrigue Masaryk 1st Class 10/2003 Prague Order of the Cross of Terra Mariana The Collar of the Cross 04/1996 Tallinn Légion d'honneur Grand Cross Order of Arts and Letters Commander 03/1990 02/2001 Paris Order of Merit of the Federal Republic of Germany Special class of the Grand Cross 05/2000 Berlin Order of Merit of Hungary Grand Cross with Chain 09/2001 Prague Gandhi Peace Prize 08/2003 Delhi Order of Merit of the Italian Republic Grand Cross with Cordon 04/2002 Rome Order of Hussein ibn' Ali Collar 09/1997 Amman Order of the Three Stars Grand Cross with Collar 08/1999 Prague Order of Vytautas the Great Grand Cross 09/1999 Prague Order of the White Eagle 10/1993 Warsaw Order of Liberty Grand Collar 12/1990 Lisbon Order of Brilliant Star with Special Grand Cordon 11/2004 Taipei Order of the White Double Cross 01/2003 Bratislava The Golden honorary Medal of Freedom 11/1993 Ljubljana Order of Isabella the Catholic Grand Cross with Collar 07/1995 Prague National Decoration of Republic of Turkey 10/2000 Ankara Order of Yaroslav the Wise 10/2006 Prague Order of the Bath Knight Grand Cross (Civil Division) 03/1996 Prague Presidential Medal of Freedom 07/2003 Washington D.C. Medal of the Republic 09/1996 Montevideo ==Works== ===Collections of poetry=== * Čtyři rané básně * Záchvěvy I & II, 1954 * První úpisy, 1955 * Prostory a časy (poesie), 1956 * Na okraji jara (cyklus básní), 1956 * Anticodes, (Antikódy) ===Plays=== * Motormorphosis 1960 * An Evening with the Family, 1960, (Rodinný večer) * The Garden Party (Zahradní slavnost), 1963 * The Memorandum, 1965, (Vyrozumění) * The Increased Difficulty of Concentration, 1968, (Ztížená možnost soustředění) * Butterfly on the Antenna, 1968, (Motýl na anténě) * Guardian Angel, 1968, (Strážný anděl) * Conspirators, 1971, (Spiklenci) * The Beggar's Opera, 1975, (Žebrácká opera) * Unveiling, 1975, (Vernisáž) * Audience, 1975, (Audience) - a Vanӗk play * Mountain Hotel 1976, (Horský hotel) * Protest, 1978, (Protest) - a Vanӗk play * Mistake, 1983, (Chyba) - a Vanӗk play * Largo desolato 1984, (Largo desolato) * Temptation, 1985, (Pokoušení) * Redevelopment, 1987, (Asanace) * Tomorrow, 1988, (Zítra to spustíme) * Leaving (Odcházení), 2007 ===Non-fiction books=== * The Power of the Powerless (1985) [Includes 1978 titular essay.] * Living in Truth (1986) * Letters to Olga (Dopisy Olze) (1988) * Disturbing the Peace (1991) * Open Letters (1991) * Summer Meditations (1992/93) * Towards a Civil Society (Letní přemítání) (1994) * The Art of the Impossible (1998) * To the Castle and Back (2007) ==References== Category:1936 births Category:2011 deaths Category:Honorary Knights Grand Cross of the Order of the Bath Category:Order of Canada Category:Order of Merit of the Federal Republic of Germany Category:Czech playwrights Category:Presidents of Czechoslovakia Category:Presidents of the Czech Republic Category:Royal Society of Literature Category:Writers from Prague Category:Charter 77 signatories",
 "title": "Václav Havel"
}