{
 "id": "268535",
 "text": "Solitary confinement is a punishment or special form of imprisonment. A prisoner is not allowed contact with anyone, except the prison staff. It may be a kind of psychological torture. It is also used to protect one prisoner from other inmates in the prison. Solitary confinement has many other names. In American English it is also called the 'hole', 'lockdown', the 'SHU' (pronounced 'shoe') or the 'pound'. In British English people say 'block' or 'the cooler'. ==Use and criticism== People who think solitary confinement is necessary give several reasons. Some prisoners are considered dangerous to other people in the prison. Other prisoners might be able to lead crime groups even from inside jail. Also, solitary confinement can be used to stop prisoners from communicating with others because of possible fears about national security. Finally, it may be used for prisoners who are at high risk of being attacked by other inmates, such as pedophiles, LGBTQ people, celebrities, or witnesses who are in prison themselves. This form of solitary confinement is sometimes called protective custody. In the US Federal Prison system, solitary confinement is known as the Special Housing Unit (SHU),Institution Supplement - Visiting Regulations, USP McCreary (from the Bureau of Prisons, US Department of Justice website. Accessed 2008 May 1.) . California's prison system also uses the abbreviation SHU, but it stands for Security Housing Units.Visitors, State Prison, Corcoran (CSP-COR) (from the California Department of Corrections and Rehabilitation website. Accessed 2008 May 1.) In other states, it is known as the Special Management Unit (SMU), pronounced . Opponents of solitary confinement claim that it is cruel and unusual punishmentTrend toward solitary confinement worries experts - Tyre, Peg; US News, 1998 9 January and torture. Direct link to audio file . Taking away social contact, and the sensory input is usually part of solitary confinement and can have a powerful negative effect on a prisoner's mind.Solitary Confinement Torture In The US - Kerness, Bonnie; National Coordinator of the 'National Campaign to Stop Control Unit Prisons', 1998 This may lead to mental illnesses such as depression and even death since humans are social animals. ==Related pages== *Prison *Torture ==References== ==Other websites== *Sourcebook on solitary confinement Category:Torture Category:Imprisonment and detention",
 "title": "Solitary confinement"
}