{
 "id": "268592",
 "text": "Classical physics are the physics that were made before the 20th century. This part of physics studies things like movement, light, gravity, and electricity. Most of physics today uses ideas that are more complicated than the ideas of classical physics, because in the 20th century, physicists discovered two better ways to describe nature: the theory of relativity and quantum mechanics. Classical physics turned out not to work when the things being studied were very, very small (around the size of atoms or smaller), or were moving very, very fast (around the speed of light). So, around the beginning of the twentieth century, Albert Einstein worked out his Theory of Relativity and people like Neils Bohr, Werner Heisenberg. and Erwin Schrödinger created quantum mechanics. == History == Sir Isaac Newton, and many scientists before him, helped create classical physics. They observed that some things in nature such as the falling of an apple occur the same way each time. Newton made equations that let him predict such events. He called these equations laws of physics. Newton's laws of physics have been tested by experiments and by using them in doing jobs. Sometimes things (like powerful winds) mess up the results of the experiment a bit, and the results come out a little wrong. But when people make efforts to get rid of these extra factors, the results of the experiments almost always get closer to what Newton's laws predict. ==Areas of classical physics== *Mechanics (how levers help lift things, cars keep moving after the engine is turned off, etc.) *Thermodynamics (why we experience some things as hot and other things as cold, why it takes longer to heat water than air, etc.) *Electricity (why rubbing one object with another can produce a static charge, why electrons move through wires, why lightning can span immense distances, etc.) *Magnetism (why compass needles point to the north and south poles, why nails wrapped around and around with insulated wire will act as magnets when a direct current is passed through the wire, etc.) *Optics (why sunlight that passes through raindrops can produce a rainbow, why prism bend light and make a spectrum like the rainbow, why lenses can magnify things, how to make powerful telescopes with or without using lenses, etc.) Category:Physics ht:Dezyèm lwa Newton",
 "title": "Classical physics"
}