{
 "id": "268619",
 "text": "Miloš Forman (18 February 1932 - 13 April 2018) was a Czech-American movie director, screenwriter, actor, and professor. He was an emigrant to the US from Czechoslovakia. He was born in Caslav. Two of his movies, One Flew Over the Cuckoo's Nest, and Amadeus won the Academy Award for Best Picture and are very famous. He also directed Hair and People vs. Larry Flynt. He won the Academy Award for Best Director twice. == Personal life == He became an American citizen in 1977. His full name was Jan Tomáš Forman. Forman died at a hospital in Danbury, Connecticut from a short-illness on 13 April 2018 at the age of 86. ==Movies== Filmography Filmography Filmography Filmography Filmography Filmography Filmography Filmography Year Movie Oscar nominations Oscar wins Movie director Screenwriter Actor Role 1954 Stříbrný vítr (Silver wind) 1955 Nechte to na mně (Leave it to me) 1958 Štěňata (Puppies) 1960 Laterna magika II 1963 Kdyby ty muziky nebyly 1963 Audition (Konkurs) 1964 Black Peter (Černý Petr) 1964 Loves of a Blonde (Lásky jedné plavovlásky) 1 1966 Dobře placená procházka (A well paid walk) 1967 The Fireman's Ball (Hoří, má panenko) 1 1971 Taking Off 1971 I Miss Sonia Henie (Short Film) 1973 Visions of Eight 1975 One Flew Over the Cuckoo's Nest 9 5 1979 Hair 1981 Ragtime 8 1984 Amadeus 11 8 1986 Heartburn Dmitri 1989 Valmont 1 1989 New Years Day Lazlo 1996 The People vs. Larry Flynt 2 1999 Man on the Moon 2000 Keeping the Faith Father Havel 2006 Goya's Ghosts 2008 Chelsea on the Rocks 2009 Peklo s princeznou (Hell with a Princess) 2011 The Ghost of Munich 2011 The Beloved (Les Bien-aimés) Jaromil ==Awards, nominations and honours== Academy Awards * 1975: One Flew Over the Cuckoo's Nest (won) * 1984: Amadeus (won) * 1996: The People vs. Larry Flynt (nomination) Golden Globe * 1975: One Flew Over the Cuckoo's Nest (won) * 1984: Amadeus (won) * 1981: Ragtime (nomination) * 1996: The People vs. Larry Flynt (won) Cannes * 1971: Taking Off (Won) * 1968: The Fireman's Ball (nomination) Berlinale * 1999: Man on the Moon (won) * 1997: The People vs. Larry Flynt (won) BAFTA * 1975: One Flew Over the Cuckoo's Nest (won) * 1984: Amadeus (nomination) * 1971: Taking Off (nomination – Best Film) * 1971: Taking Off (nomination – Best Screenplay) César Award * 1984: Amadeus (won) * 1975: One Flew Over the Cuckoo's Nest (nomination) * 1979: Hair (nomination) * 1989: Valmont (nomination) David di Donatello * 1975: One Flew Over the Cuckoo's Nest (won) * 1984: Amadeus (won – Best Film) * 1984: Amadeus (won – Best Screenplay) * 1979: Hair (won) European Film Academy * 1996: The People vs. Larry Flynt – Award for European contribution to world cinema – screen Prix International (won) Czech Lion * 1997: Contribution to Czech cinema (won) List of Greatest Czechs * Největší Čech: # 30 place * 1995: Medal of Merit ==References== ==Other websites== * Category:Academy Award winning directors Category:American movie actors Category:American movie directors Category:American movie producers Category:American screenwriters Category:BAFTA Award winning directors Category:Czech actors Category:Golden Globe Award winning directors Category:Naturalized citizens of the United States Category:Disease-related deaths in Connecticut Category:1932 births Category:2018 deaths",
 "title": "Miloš Forman"
}