{
 "id": "268682",
 "text": "Treasure Planet is a 2002 American animated science fiction movie produced by Walt Disney Feature Animation, and released by Walt Disney Pictures and Buena Vista Pictures on November 27, 2002. The 42nd animated movie in the Walt Disney Animated Classics, the movie is based on Robert Louis Stevenson's adventure novel Treasure Island and was the first movie to be released in both normal and IMAX theaters at the same time. The movie uses hand-drawn 2D traditional animation over 3D computer animation. And it was theatrical released with a 2002 Pixar short, Mike's New Car. The movie was co-written, co-produced, and directed by John Musker and Ron Clements, who had pitched the concept for the movie at the same time that they pitched The Little Mermaid. Treasure Planet features the voices of Joseph Gordon-Levitt, Brian Murray, David Hyde Pierce, Martin Short, Emma Thompson, Michael Wincott, Laurie Metcalf, and Roscoe Lee Browne. The musical score was composed by James Newton Howard, while the songs were written and performed by John Rzeznik. Although it got mostly positive reviews, the movie did not perform well at the box office in the United States. The movie cost $140 million to make but only earned $38 million in the United States and Canada and just under $110 million in the rest of the world. It was nominated for the 2002 Academy Award for Best Animated Feature. This and Lilo and Stitch were Disney's first PG-rated animated movies released in the same year as each other and Disney's last hand drawn movies released in the same year as each other. == Plot == As a young boy, Jim Hawkins grows up enjoying stories of the legendary pirate Captain Flint. Twelve years later, he has grown into a wayward, rebellious teenager; his father is out of the picture and his mother Sarah is at her wit's end. Jim reluctantly helps his mother out at the Benbow Inn, and finds entertainment through \"Solar Surfing\" (similar to windsurfing and sky surfing), a hobby which gets him into frequent trouble. One day, a spaceship crashlands near the inn, and Billy Bones, the ship's pilot, is critically injured. Before succumbing to his wounds, he gives Jim a sphere and warns him to \"beware the cyborg\". After this, a gang of pirates raid the inn and raze it to the ground, as Jim, Sarah and their dog-like friend Dr. Delbert Doppler escape. Taking refuge in Delbert's study, Jim discovers the sphere is a map to the legendary Treasure Planet. Doppler commissions a ship called the RLS Legacy, on a mission to search for Treasure Planet. The ship is captained by the cat-like, free-spirited Captain Amelia, and the stone-skinned Mr. Arrow; the crew is secretly led by the half-robot cook Long John Silver, who Jim suspects is the cyborg that Bones warned him about. Jim is sent to work in the galley, where Silver and his shapeshifting pet alien Morph supervise him. Although Jim does not trust Silver, they form a tenuous father-son relationship. On the voyage, the ship encounters a supernova. While Jim secures the lifelines, he saves Silver just in time. The supernova then devolves into a black hole, and Mr. Arrow falls to his death into the abyss. As Amelia mourns Arrow, she suspects Jim failed to secure his lifeline, when it was really severed by the treacherous crablike pirate Scroop. As the ship approaches Treasure Planet, Jim eavesdrops on the crew and discovers that they are following Silver, which leads to a mutiny. Jim, Doppler, Amelia and Morph escape, but the map is left behind. Silver, thinking that Jim has the map, targets to kill him, but hesitates; Amelia ends up being wounded when the fugitives are shot down in the escape. While Jim explores Treasure Planet's jungles, the group come across the eccentric robot B.E.N., who has lost his primary memory and invites them to his home for shelter, where the group are cornered by the pirates; Using a back door, Jim, B.E.N. and Morph return to the ship in an effort to recover the map. Scroop attacks them, but ends up falling into the abyss. The group obtain the map, but end up being caught by Silver (who has captured Doppler and Amelia) when they return. Silver coerces Jim into using the map, which can open a portal to any location in the universe, which leads Jim to realize this was how Flint conducted his raids. The portal to Treasure Planet is opened, and the group discover the planet is a giant space station which Flint commandeered in order to store his loot. As the pirates prepare to collect the loot, Jim finds Flint's skeleton, holding the missing piece of B.E.N.'s cognitive computer. After reinserting it, B.E.N. immediately remembers that Flint rigged the planet to explode upon the treasure's discovery. As the planet falls apart, Silver, in a desperate attempt not to leave emptyhanded, tries to escape on a boat loaded with treasure, but sacrifices the treasure to save Jim. The survivors escape to the ship, but it is damaged and becomes unable to leave the planet in time. Jim rigs a rocket- powered sailboard, and rides ahead of the ship to the portal. At the last moment, Jim sets the portal to the Montressor Spaceport, and he and the crew clear the destruction. Jim discovers Silver has escaped below decks. Jim allows Silver to leave, and Silver gives Jim Morph, as well as providing him some of the treasure he rescued before the planet's destruction to help him rebuild the Benbow Inn; as he leaves, Silver tells Jim he will \"rattle the stars\". Amelia offers Jim a recommendation to the Interstellar Academy, before he returns to the spaceport to reunite with his mother. Sometime later, a celebration is held at the rebuilt Inn; Doppler and Amelia marry and have children, and Jim becomes a military cadet. During the party, Jim sees an image of Silver in the clouds, smiling proudly. == Cast == * Joseph Gordon- Levitt as Jim Hawkins * Brian Murray as Long John Silver * Emma Thompson as Captain Amelia * Martin Short as B.E.N * Michael Wincott as Scroop, an alien- like creature * David Hyde Pierce as Doctor Delbert Doppler * Roscoe Lee Browne as Mr Arrow. * Laurie Metcalf as Sarah Hawkins * Patrick McGoohan as Billy Bones, this was Patrick McGoohan's last film role before his death in 2009 * Dane A. Davis as Morph * Corey Burton as Onus * Michael McShane as Hands * Rodger Bumpass as Turnbuckle * Phil Proctor, Jan Rabson, Joe Ranft and Steve Susskind as Pirates * Peter Cullen as Captain Flint == Video games== Several Treasure Planet video games were released. In October 2002, Disney Interactive released the naval strategy game Treasure Planet: Battle at Procyon for the PC, while in November, Sony Computer Entertainment released two separate Treasure Planet action video games for the PlayStation (developed by Magenta Software) and PlayStation 2 (developed by Bizarre Creations). Bizarre Creations used Softimage's XSI engine for modeling, texturing and animation, and released a Making-of video on their Facebook page in 2008. A Game Boy Advance game based on the film was also released. A series of games collectively called Disney's Treasure Planet: Training Academy (or Disney's Treasure Planet Collection) was also released in 2002. It was composed of three games (Broadside Blast, Treasure Racer, and Etherium Rescue), and players with all three games could unlock a fourth game (Ship Shape). == References== Category:2002 movies Category:2002 animated movies Category:2002 science fiction movies Category:American science fiction movies Category:Disney animated movies Category:Movies based on books Category:Movies set on fictional planets Category:Movies composed by James Newton Howard Category:English-language movies Category:IMAX movies Category:Movies about extraterrestrial life Category:Pirate movies",
 "title": "Treasure Planet"
}