{
 "id": "268778",
 "text": "The National Institutes of Health (NIH) is part of the United States Department of Health and Human Services (HHS). It is their agency for research. There are 27 separate institutes and offices. Each of them have separate areas of health which they research. Most of them are located in Bethesda, Maryland. The NIH made vaccines against hepatitis, Haemophilus influenzae (HIB) and human papillomavirus. The current Director of the NIH is Francis Collins since 2009. ==History== In 1887, a laboratory for the study of bacteria, the Hygienic Laboratory, was established within the Marine Hospital Service, which at the time was expanding its functions beyond the system of Marine Hospitals into quarantine and research programs. It was initially located at the New York Marine Hospital on Staten Island.[7][8][9] In 1891, it moved to the top floor of the Butler Building in Washington, D.C. In 1904, it moved again to a new campus at the Old Naval Observatory, which grew to include five major buildings.[10] In 1901, the Division of Scientific Research was formed, which included the Hygienic Laboratory as well as other research offices of the Marine Hospital Service.[11] In 1912, the Marine Hospital Service became the Public Health Service (PHS).[9] In 1922, PHS established a Special Cancer Investigations laboratory at Harvard Medical School. This marked the beginning of a partnership with universities.[9] In 1930, the Hygienic Laboratory was re-designated as the National Institute of Health by the Ransdell Act, and was given $750,000 to construct two NIH buildings at the Old Naval Observatory campus.[9] In 1937, NIH absorbed the rest of the Division of Scientific Research, of which it was formerly part.[11][12] In 1938, NIH moved to its current campus in Bethesda, Maryland.[9] Over the next few decades, Congress would markedly increase funding of the NIH, and various institutes and centers within the NIH were created for specific research programs.[9] In 1944, the Public Health Service Act was approved, and the National Cancer Institute became a division of NIH. In 1948, the name changed from National Institute of Health to National Institutes of Health. Later historyEdit In the 1960s, virologist and cancer researcher Chester M. Southam injected HeLa cancer cells into patients at the Jewish Chronic Disease Hospital.[13]: 130 When three doctors resigned after refusing to inject patients without their consent, the experiment gained considerable media attention.[13]: 133 The NIH was a major source of funding for Southam's research and had required all research involving human subjects to obtain their consent prior to any experimentation.[13]: 135 Upon investigating all of their grantee institutions, the NIH discovered that the majority of them did not protect the rights of human subjects. From then on, the NIH has required all grantee institutions to approve any research proposals involving human experimentation with review boards.[13]: 135 In 1967, the Division of Regional Medical Programs was created to administer grants for research for heart disease, cancer, and strokes. That same year, the NIH director lobbied the White House for increased federal funding in order to increase research and the speed with which health benefits could be brought to the people. An advisory committee was formed to oversee the further development of the NIH and its research programs. By 1971 cancer research was in full force and President Nixon signed the National Cancer Act, initiating a National Cancer Program, President's Cancer Panel, National Cancer Advisory Board, and 15 new research, training, and demonstration centers.[14] Funding for the NIH has often been a source of contention in Congress, serving as a proxy for the political currents of the time. In 1992, the NIH encompassed nearly 1 percent of the federal government's operating budget and controlled more than 50 percent of all funding for health research, and 85 percent of all funding for health studies in universities.[15] While government funding for research in other disciplines has been increasing at a rate similar to inflation since the 1970s, research funding for the NIH nearly tripled through the 1990s and early 2000s, but has remained relatively stagnant since then.[16] By the 1990s, the NIH committee focus had shifted to DNA research and launched the Human Genome Project.[17] == Philanthropic Initiatives == The NIH hosts a number of philanthropic programs aimed at encouraging youth participation in science. For example, the NIH's NEI hosts the Eye on the Future video contest, which recognizes young scientists like Thuy-Tien Tran, Celia Cooley, and Mark Leschinsky. ==References== ==Other websites== *Official website Category:United States Department of Health and Human Services Category:Medical and health organizations in the United States Category:1930 establishments in the United States Category:Research organizations in the United States",
 "title": "National Institutes of Health"
}