{
 "id": "269224",
 "text": "Indentured servitude is a form of labor. A person would agree to work for another person for a given length of time, usually without being paid much. The contract was called indenture. It was common between the 16th and the 18th century. People could enter the contract voluntarily, for example to repay debt. Sometimes, courts imposed indentured servitude as a form of punishment. It was common for apprenticeships: An apprentice agreed to work for free for a master tradesman to learn a trade. An indentured servant was a worker in a contract with an employer for a certain length of time. Usually a laborer or craftsman would have to work three to seven yearsWilliam Moraley and Susan E. Klepp, The infortunate: the voyage and adventures of William Moraley an indentured servant, Google Books, page xx in exchange for the cost of transportation across the ocean, food, clothing, land, a place to live and other things they needed to live or work during their contract. This kind of contract was called \"indenture.\" Indentures were quite common in Colonial America in the 17th and 18th centuries. Indentured servants were different from slaves in that their captivity was temporary. Like any loan, an indenture could be sold; most employers had to depend on middlemen to recruit and transport the workers, so indentures (indentured workers) were commonly bought and sold when they arrived at their destinations. Like prices of slaves, their price went up or down depending on supply and demand. When the indenture (loan) was paid off, the worker was free. Sometimes they might be given a plot of land. This type of contract has been common throughout world history in different forms. Usually, the worker became an indentured servant by choice.Frank R. Diffenderffer, The German Immigration into Pennsylvania Through the Port of Philadelphia, 1700-1775, Genealogical Pub. Co., Baltimore, 1979. This book describes the indenturing process in detail for immigrants from foreign countries, not only Germany. == Restrictions == There were also some restrictions. Indentured servants were not allowed to marry without the consent of their master. They would be physically punished, like many servants. They were also required to work, an obligation enforced by courts. Female indentured servants in particular might be raped and/or sexually abused by their masters. To make sure that they really worked for the time that was in their contract, a female sevant who became pregnant had her contract lengthened by two years. Unlike slaves, servants were guaranteed to be eventually released from bondage. At the end of their term they received a payment known as \"freedom dues\" and became free members of society.Eric Foner: Give me liberty. W.W. Norton & Company, 2004. . One could buy and sell indentured servants' contracts, and the right to their labor would change hands, but not the person as a piece of property. Both male and female laborers could be subject to violence, occasionally even resulting in death. Richard Hofstadter notes that, as slaves arrived in greater numbers after 1700, white laborers in Virginia became a \"privileged stratum, assigned to lighter work and more skilled tasks\".White Servitude , by Richard Hofstadter He also notes that \"Runaways were regularly advertised in the newspapers, rewards were offered, and both sheriffs and the general public were enlisted to secure their return. ... The standard penalty in the North, not always rigorously enforced, was extra service of twice the time the master had lost, though whipping was also common.\" == Comparison with debt bondage and slavery == Indentured servitude is comparable to debt bondage or slavery in many ways. It was also easy to exploit. Indentured servants had agreed to work for a given time, usually in exchange of getting a place to live, some clothing, and to be nourished. With their work, they earned little to no money. At some point, the servant might need special goods he or she could not afford. These might be things like drugs to treat a disease, or a doctor's visit. The employer would then provide these goods or services, but the servant had to agree that the contract be extended, with some extra time added. Historical Dictionary of Oceania describes indentured labour as a Labour Trade. It says \"the system of indentured labour, developed as a scaled-down but legal replacement of slave labour.\"Robert D. Craig, Frank P. King: Historical Dictionary of Oceania. Greenwood Press, Westport/London 1981, p. 152. ==Colonial America== Many immigrants arrived in Colonial America as indentured servants. Their new master paid a ship's captain for the worker's trip across the Atlantic Ocean. Most were young men and women from England, Scotland and Germany under the age of 21. Their parents often made the arrangements. In the 17th and the early 18th centuries, most people who came to America were indentured servants. Indentured servants often had to do very hard labor on a farm or in a household. Often, they were no more than slaves for their indentures. During the 17th century, over half of indentured servants died before their indentures had ended. In the 17th century, when people had served an indenture, they usually received a piece of land, usually 40 acres. However, by 1676, indentured servants were not getting land as often. That led to an attack on the Virginia government by Nathaniel Bacon and other indentured servants. After Bacon's Rebellion, the number of indentured servants decreased, and the South turned to slaves for its labor. === Numbers === Between one-half and two-thirds of European immigrants to the American Colonies between the 1630s and the American Revolution came under indentures. At any time, there were more people whose indenture had expired or who never had an indenture. These people were free workers, who were paid a wage for the work they did. Europeans in the colonies were free workers more often than indetured servants. Indentured people were important mainly in the region between Virginia to north of New Jersey. In total, about 500,000 Europeans immigrated to the American colonies before 1775. About 55,000 of these were prisoners. The remaining 450,000 came voluntarily. Tomlins estimates that 48% were indentured. About 75% of these were under the age of 25. The age of adulthood for men was 24 years (not 21); those over 24 generally came on contracts lasting about three years.Tomlins (2001) at notes 31, 42, 66 Regarding the children who came, Gary Nash reports that \"many of the servants were actually nephews, nieces, cousins and children of friends of emigrating Englishmen, who paid their passage in return for their labor once in America.\"Gary Nash, The Urban Crucible: The Northern Seaports and the Origins of the American Revolution (1979) p 15 Several cases of kidnapping\"trepan | trapan, n.2\". OED Online. June 2017. Oxford University Press for transportation to the Americas are recorded, such as that of Peter Williamson (1730–1799). As historian Richard Hofstadter pointed out, \"Although efforts were made to regulate or check their activities, and they diminished in importance in the eighteenth century, it remains true that a certain small part of the European colonial population of America was brought by force, and a much larger portion came in response to deceit and misrepresentation on the part of the spirits [recruiting agents].\" One \"spirit\" named William Thiene was known to have spirited away 840 people from Britain to the colonies in a single year. Historian Lerone Bennett Jr. notes that \"Masters given to flogging often did not care whether their victims were black or white.\" Also, during the 18th and early 19th centuries, children from the UK were often kidnapped and sold into indentured labor in the American and Caribbean colonies (often without any indentures). ==Indenture today== ===Examples=== Some people claim that practices in the United Arab Emirates are examples of modern-day indentured servitude. Many workers from India and Pakistan must pay agents in their own countries for jobs in the Emirates. The recruiting agents take the workers passports after they enter the country. The workers do not know when they will get their passports back. The indentured servants get basic food and housing and transportation to the work place. ===Laws about indenture=== The United Nations passed the Universal Declaration of Human Rights 1948. Article 4 of the Declaration says that indenture, or servitude, is illegal. However, only laws in each country can stop it. In America, the Trafficking Victims Protection Act (TVPA) of 2000 expanded the definition of servitude. ==References== ==Further reading== * Immigrant Servants Database * Abramitzky, Ran; Braggion, Fabio. \"Migration and Human Capital: Self-Selection of Indentured Servants to the Americas,\" Journal of Economic History, Dec 2006, Vol. 66 Issue 4, pp 882–905, * Brown, Kathleen. Goodwives, Nasty Wenches & Anxious Patriachs: gender, race and power in Colonial Virginia, Chapel Hill: University of North Carolina Press, 1996. * Frethorne, Richard. The Experiences of an Indentured Servant in Virginia (1623) * Jernegan, Marcus Wilson Laboring and Dependent Classes in Colonial America, 1607-1783 Westport, CT: Greenwood Press, 1980. * Morgan, Edmund S. American Slavery, American Freedom: The Ordeal of Colonial Virginia. New York: Norton, 1975. * Salinger, Sharon V. 'To serve well and faithfully': Labor and Indentured Servants in Pennsylvania, 1682-1800. New * Khal Torabully and Marina Carter, Coolitude: An Anthology of the Indian Labour Diaspora Anthem Press, London, 2002, * Saxton, Martha. Being Good: Women's Moral Values in Early America New York: Hill and Wang, 2003. *Zipf, Karin L. Labor of Innocents: Forced Apprenticeship in North Carolina, 1715-1919 (2005). * Whitehead, John Frederick, Johann Carl Buttner, Susan E. Klepp, and Farley Grubb. Souls for Sale: Two German Redemptioners Come to Revolutionary America, Max Kade German-American Research Institute Series, . * Marion, Pascal. Dictionnaire étymologique du créole réunionnais, mots d'origine asiatique, Carré de sucre, 2009, ==Other websites== * GUIANA 1838 - a film about indentured labourers Category:Human rights abuses Category:Debt bondage Category:Domestic work",
 "title": "Indentured servitude"
}