{
 "id": "269383",
 "text": "Gurjar or Gujjar (also translitterated as Gurjara, Gujar, Gujjara and Gujjer) are a peasant, pastoral and agricultural ethnic community, residing mainly in India, Pakistan, Nepal, and Afghanistan, divided internally into 1788 to 2000 clan groups. They are an agricultural and pastoral group of Jammu and Kashmir, Northwestern India, northern and central Pakistan, Azad Kashmir and northeastern Afghanistan. The Gujari language is closely related to Rajasthani and Marwari. As per historical accounts parts of Rajasthan and Gujarat were known as Gurjarah-bhumi or Gurjaratra prior to Mughal period in India. The Pratihara dynasty acted as a barrier to invasions from Muslim Arabs for around 300 centuries. However, in later times, circa the 14th century AD onwards, they were reduced to small principalities due to successful invasions and conquests by Muslim powers in northern and western India. During the 15th-16th century, there were Gurjars in the areas of Meerut and Dadri. The Gurjars in Pakistan and Afghanistan are Muslim. After this time, with struggles against the rising Mughal power and later British India the Gurjars gradually fell into a decline. They became poor nomads and started living in jungles and forests. With Muslim rule in North India, the Hindu Gurjars of the area surrounding Delhi had to live in jungles in order to save their Hindu faith and to survive. ==Geographical Distribution== Today, Hindu Gurjars are found in the Indian states of Rajasthan, Haryana, Western Uttar Pradesh and to a smaller extent Punjab. Muslim Gurjars are found in the Indian states of Uttarakhand, Himachal Pradesh, Jammu and Kashmir and in the Pakistani provinces of Punjab, Azad Kashmir, Khyber Pakhtunkhwa and in the Afghanistan province of Nuristan. ==Related pages== *Nomad *Gurjar clans *Central Asia *Iranic peoples *History of Asia *Turkic peoples *Mughal Empire *Timurid Empire *Delhi Sultanate *Uralic languages *Dravidian peoples *Indo-Iranic peoples *Dravidian languages *Indo-Iranian peoples *Indo-Iranic languages *Indo-Iranian languages == Reference == Category:Ethnic groups in India Category:Ethnic groups in Afghanistan Category:Ethnic groups in Pakistan",
 "title": "Gurjar"
}