{
 "id": "269454",
 "text": "Anthony Robert McMillan OBE (30 March 1950 – 14 October 2022), known professionally as Robbie Coltrane, was a Scottish actor, author and comedian. He is known both for his role as Dr. Eddie \"Fitz\" Fitzgerald in the British television series Cracker during the 1990s and as Rubeus Hagrid in the Harry Potter movies. == Life and career == === Life === Coltrane was born on 30 March 1950 in Rutherglen, South Lanarkshire. He lived in Killearn Stirlingshire. He had a son named Spencer and a daughter named Alice. Coltrane had osteoarthritis in later life. He said he was in \"constant pain all day\" in 2016. On 14 October 2022, Coltrane died at a hospital in Larbert, Scotland, at the age of 72. The cause of death was multiple organ failure caused by sepsis, a respiratory tract infection, and heart block. He had also been diagnosed with obesity and Type 2 diabetes. === Career === Coltrane began his acting career in his early twenties. He took the stage name Coltrane in tribute to jazz saxophonist John Coltrane. In 2006, Robbie received an OBE for his services to drama. == Filmography and awards == Year Movie Role Notes and awards 1980 Flash Gordon Man at air field 1982 Britannia Hospital Striking worker on picket line Cameo non-speaking role 1983 Ghost Dance George Krull Rhun 1985 National Lampoon's European Vacation Man in bathroom The Supergrass Det. Sgt. Troy 1986 Caravaggio Scipio 1986 Mona Lisa Thomas 1987 Eat the Rich Jeremy 1988 The Fruit Machine Annabelle 1989 Henry V Falstaff Bert Rigby, You're a Fool Sid Temple Let It Ride Ticket Seller Danny, the Champion of the World Victor Hazell Slipstream Montclaire 1990 Midnight Breaks Fat Nuns on the Run Charlie McManus/Sister Inviolata Perfectly Normal Alonzo Turner 1991 The Pope Must Die The Pope Triple Bogey on a Par Five Hole Steffano Baccardi 1992 Oh, What a Night Todd Nominated - Genie Award for Best Performance by an Actor in a Supporting Role 1993 Boswell & Johnson's Tour of the Western Isles Dr. Samuel Johnson The Adventures of Huck Finn Duke 1995 GoldenEye Valentin Dmitrovich Zukovsky 1997 Buddy Dr. Bill Lintz 1998 Frogs for Snakes Al Montana The Boss 1999 The World Is Not Enough Valentin Dmitrovich Zukovsky Message in a Bottle Charlie Toschi 2001 Harry Potter and the Sorcerer's Stone Rubeus Hagrid Sorcerer's Stone in US Nominated - BAFTA Award for Best Actor in a Supporting Role Nominated - Saturn Award for Best Supporting Actor On the Nose Delaney From Hell Sergeant Peter Godley 2002 Harry Potter and the Chamber of Secrets Rubeus Hagrid Nominated - Phoenix Film Critics Society Award for Best Ensemble Acting 2004 Ocean's Twelve Matsui Harry Potter and the Prisoner of Azkaban Rubeus Hagrid Van Helsing: The London Assignment Mr. Hyde Voice Van Helsing Mr. Hyde Voice 2005 Harry Potter and the Goblet of Fire Rubeus Hagrid 2006 Stormbreaker Prime Minister of the United Kingdom Provoked Lord Edward Foster 2007 Harry Potter and the Order of the Phoenix Rubeus Hagrid 2008 The Tale of Despereaux Gregory Voice The Brothers Bloom The Curator 2009 Harry Potter and the Half- Blood Prince Rubeus Hagrid Gooby Gooby Voice 2010 Harry Potter and the Deathly Hallows: Part 1 Rubeus Hagrid 2011 Harry Potter and the Deathly Hallows: Part 2 Rubeus Hagrid 2012 Brave Lord Dingwall Voice Television Year Title Role Notes an Awards 1983 Are You Being Served Dynamite Truck Driver on CB Radio Mrs. Slocombe causes a crash 1987 Blackadder the Third Samuel Johnson Tutti Frutti Danny McGlone Nominated - British Academy Television Award for Best Actor 1988 Blackadder's Christmas Carol The Spirit of Christmas 1990 Danny Champion of the World Victor Hazell 1993–2007 Cracker Dr. Eddie 'Fitz' Fitzgerald Three British Academy Television Awards for Best Actor (1994, 1995 and 1996) Broadcasting Press Guild Award for Best Actor Royal Television Society Award for Best Actor - Male Nominated - CableACE Award for Best Actor in a Movie or Miniseries For episode \"Brotherly Love\" (parts I, II and III). 1998 The Ebb-Tide Capt. Chisholm 1999 Alice in Wonderland Ned Tweedledum 2001 Thomas and Friends Toad the Great Western Brakevan Voice 2003 Comic Relief: The Big Hair Do Hagrid The Planman Jack Lennox QC 2004 Pride James Frasier Michael Moon Series Finalé: Part 1 2005 Still Game Davie Season 4 Episode 3: Dial-A-Bus 2006 Cracker: Nine Eleven Dr. Eddie 'Fitz' Fitzgerald 2009 Murderland D.I. Douglas Hain The Gruffalo The Gruffalo TV film (Children's), voice 2010 Robbie Coltrane - B Road Britain TV Documentary 2011 Lead Balloon Donald Series 4 Episode 4: \"Off\" Series 4 Episode 5: \"Blade\" Series 4 Episode 6: \"End\" 50 Greatest Harry Potter Moments Himself Narrator The Gruffalo Child The Gruffalo TV film (Children's), voice ==References== Category:1950 births Category:2022 deaths Category:Actors who played in James Bond movies Category:British television writers Category:People from South Lanarkshire Category:Scottish comedians Category:Scottish movie actors Category:Scottish television actors Category:Scottish television presenters Category:Scottish voice actors Category:Scottish writers",
 "title": "Robbie Coltrane"
}