{
 "id": "269899",
 "text": "Paul Revere (; December 21, 1734 O.S. (January 1, 1735 N.S.)May 10, 1818) was a courier, soldier, and leader in the Sons of Liberty during the American Revolution. He was born in Boston, Massachusetts, and worked there as a silversmith. He was married twice and was the father of 16 children. He died in Boston at the age of 83 and was buried in the Granary Burying Ground. Revere is well known for his engraving of the Boston Massacre. It was distributed widely within the American colonies and made Americans even more angry with the British. However, he is most famous for alerting the colonial militia that British soldiers were coming before the Battles of Lexington and Concord. In 1860, Henry Wadsworth Longfellow wrote a poem about this called \"Paul Revere's Ride.\" After the Revolutionary War ended in 1801, he opened a metal foundry in Boston called the Revere Copper Company, which was the first copper rolling mill in North America. It is still in operation today. == Midnight Ride == Revere is most famous for his \"Midnight Ride\" on the night of April 1819, 1775. British officials had learned that American Patriots (the leaders of the American Revolution) were storing guns in Concord, Massachusetts. They wanted to destroy the guns. The Patriots thought the British also wanted to capture Patriot leaders John Hancock and Samuel Adams, who were staying in Lexington, Massachusetts. Revere and a man named William Dawes rode on horseback from Boston to Lexington to warn Adams and Hancock that British soldiers were approaching. He also warned other Patriots along his route. People commonly believe that Paul Revere arrived in Lexington and shouted his famous quote (\"The British are coming!\"), but this is false. When Revere arrived in Lexington, he quietly woke up the people and told them about the British to avoid drawing attention to himself. Revere was soon joined by Dawes, who also told the people that the British soldiers were coming. In Concord, Samuel Prescott joined Revere and Dawes. All three were stopped by British soldiers in a field in the city of Lincoln, Massachusetts. Prescott and Dawes escaped quickly. However, the British soldiers held Revere for about an hour before letting him go. Because his horse was gone, Revere ran back to Lexington, where the fighting had already begun. Almost a hundred years later, Paul Revere's Ride revived his fame. ==Notes== ==References== ===Further reading=== * * * * * * * This work is extensively footnoted, and contains a voluminous list of primary resources concerning all aspects of the Revere's ride and the battles at Lexington and Concord. * * * (Volume 2) * * * * * * * * * * * * * * * ==Other websites== * * Paul Revere Heritage Project * The Paul Revere House ** An interactive map showing the routes taken by Revere, Dawes, and Prescott * Original copper engravings and other documents in collections of the Massachusetts State Archives * Revere Rolling Mill – about the endangered original Revere copper works site in Canton, MA * Booknotes interview with David Hackett Fischer on Paul Revere's Ride, July 17, 1994. * * Category:1734 births Category:1818 deaths Category:American revolutionaries Category:People from Boston",
 "title": "Paul Revere"
}