{
 "id": "269833",
 "text": "Jewish Virtual Library (JVL) is a Jewish topic-based online encyclopedia set up in 1993. It has been one of the most wide-ranging databases covering the culture and history of Jews and antisemitism. ==History== The website was first made in the late 1990s. It was first called The Jewish Student Online Research Center (JSOURCE).According to the website, the Library covers material that cannot be found anywhere else in the world, such as information about projects where the United States and Israel worked together, and how Americans were treated during the Holocaust. It explains that it got permission to use materials from the Library of Congress, from the American Jewish Historical Society, the Anti-Defamation League, the Simon Wiesenthal Center, the Foreign Ministry of Israel, and Prime Minister’s Office, Rabbi Joseph Telushkin (author of Jewish Literacy), and dozens of other sources. It has more than 13,000 articles and 6,000 photographs and maps about Jewish history, Israel, U.S.-Israel relations, the Holocaust, anti-Semitism, and Judaism.Text from the website of the Jewish Virtual Library, copied at the Michigan State University Library The website has all of the words of the Tanakh. The Jewish Virtual Library also has the Israel advocacy text \"Myths and Facts\", edited by Mitchell Bard, in several languages. == Reception== John Jaeger, in an article published by the Association of College and Research Libraries, said of the Jewish Virtual Library: > \"This library, once it is entered, is more like a living encyclopedia than > it is anything else. One has options to click on, such as history, women, > biography, politics, Israel, maps, and Judaic Treasures at the Library of > Congress, with each launching a person into a different realm. The site is > extremely well put together.John Jaeger, Association of College and Research > Libraries \"World religions on the Web: A guide to some of the most helpful > sites\" , C&RL; News June 2002 Vol. 63 No. 6 Karen Evans of Indiana State University wrote that the site covers many different topics, with \"easily accessible, balanced information\".Karen Evans, Jewish Virtual Library at the Internet Reviews Archive, College and Research Libraries News, a division of the American Library Association at Bowdoin College, Oct 2002 (courtesy link: ) The Jewish Virtual Library has been used as a source by CNN, New York Times,Benjamin Netanyahu News - The New York Times BBC, CBS News, Fox News, The Los Angeles Times, USA Today, Business Week, and Bloomberg etc. JVL got awards from the Britannica Internet Guide Selection, USA Today Hot Site, and the Best of the Jewish Web from the Jewish Agency for Israel, the Academic Excellence Award from Study Web and others. Contrarily, the Jewish Virtual Library has been accused by Islamists and their academic Marxist sympathisers of \"pro-Israel bias\" for having articles about Muslim antisemitism, with the English Wikipedia community controversially restricting its use as a source of information. Meanwhile, the antisemitic * * * Qatari state-owned * * * * * * * * outlets Al Jazeera and Middle East Eye have not been subject to similar restrictions. Instead, they were considered as \"reliable sources\" despite their decade-long disinformation on geopolitics, * * * * * * raising doubt about the procedural integrity of the English Wikipedia. ==Related pages== * Holocaust Encyclopedia * Anti-Defamation League ==References== ==Other websites== * Jewish Virtual Library * Anti-Defamation League * Southern Poverty Law Center Category:Jewish literature Category:Encyclopedia websites Category:American websites",
 "title": "Jewish Virtual Library"
}