{
 "id": "269975",
 "text": "Karen Sheila Gillan (born 28 November 1987) is a Scottish actress, director, screenwriter and model. She is best known for playing the part of Amy Pond in the British science fiction series, Doctor Who. ==Early life== Karen Sheila Gillan was born on 28 November 1987 in Inverness, Scotland. She learned to play the piano when she was seven. She started acting when she was very young. She joined several local youth theatre groups. She also acted at her school, Charleston Academy. When she was sixteen, Karen Gillan went to Edinburgh's Telford College to study acting. Later, she studied at the Italia Conti Academy of Theatre Arts drama school in London. Karen Gillan moved to London when she was 18 to study at drama school. Her cousin, Caitlin Blackwood, played the part of the young Amy Pond in at least three episodes of Doctor Who.Karen Gillan bags relative role . 31 March 2010. STV.comGillan never watched Dr Who until landing leading role.The Scotsman. 22 July 2010, Stuart MacDonald ==Career== === Modelling === Before Karen Gillan started acting on television, she worked in a London pub. She had had left Italia Conti for a television programme, but was hired by a modelling agency. Karen Gillan worked as a model in London Fashion Week, in 2007. She worked for designer Allegra Hicks' show. === Acting === Karen Gillan began acting on television doing small parts, on several drama series. Her first larger role was as a part of the ensemble cast of the sketch comedy series The Kevin Bishop Show. She worked for the series for two years. On the programme, she played many different characters. She also played celebrities such as Katy Perry and Angelina Jolie. She was on Channel 4's 'Stacked'. She played the part of Ginny. Karen Gillan also was on TV in a main part in a horror programme The Well. It was broadcast as a series of short movies, on BBC Two. It was later shown on the internet. Karen Gillan was cast as Amy Pond on the British sci-fi series Doctor Who in May 2009. Her first episode as Amy Pond was shown on 3 April 2010. Gillan had been in Doctor Who once before in the 2008 episode \"The Fires of Pompeii\" as a different character. Karen Gillan also acts in theatre. She first role was as Shirley in John Osborne's play Inadmissible Evidence at the Donmar Warehouse on 16 October 2011. At the 2011 San Diego Comic-Con, Karen Gillan said she will be on Doctor Who for its seventh series. On 15 December 2011, it was said that Gillan and Arthur Darvill (Rory Williams) would only be on the early part of seventh series, in 2012. After leaving Doctor Who, Karen Gillan has appeared in 2013 horror film Oculus and 2014 Marvel superhero science fiction film Guardians of the Galaxy. Both of films received positive reviews from critics, while Guardians of the Galaxy became a critical and commercial success, grossing over $774 million worldwide. Also in 2014, she was cast as the main character in ABC's sitcom Selfie. In May 2015, it was announced that Karen Gillan was cast in the Adam McKay-directed drama film The Big Short alongside Brad Pitt, Christian Bale, Ryan Gosling, Steve Carell and Melissa Leo. She directed her first short film, Coward, which won several awards and screened at the 2015 Edinburgh Film Festival. Later that year, in September, Karen Gillan was cast as one of the main characters, Annie, in the movie The Circle alongside Emma Watson, Tom Hanks and John Boyega. The film is directed and written by James Ponsoldt and is based on the novel written by Dave Eggers. ==Filmography== Feature films Year Title Role Notes 2008 New Town Killers Girl at bus station 2010 Outcast Ally 2013 Not Another Happy Ending Jane Lockhart 2013 Oculus Kaylie Russell 2014 Guardians of the Galaxy Nebula 2015 The Big Short Evie 2016 The Circle Annie Filming 2017 Jumanji: Welcome to the Jungle Ruby Roundhouse Television Year Title Role Notes 2006 Rebus Teri Cotter Episode: \"A Question of Blood\" 2008 Stacked Ginny Turner TV movie 2008 Doctor Who Soothsayer Episode: \"The Fires of Pompeii\" 2008 Harley Street Holly Episode 1 2008 – 2009 Various characters Main role (12 episodes) 2008 Coming Up Anna Episode: \"Thinspiration\" 2009 The Well Coll 4 episodes 2010 – 2013 Doctor Who Amy Pond Series 5, 6, 7 (33 episodes) \"The Time of the Doctor\" (cameo) 2010 – 2011 Doctor Who Confidential Herself 26 episodes 2012 We'll Take Manhattan Jean Shrimpton TV movie 2012 In Love with Coward Laura 3 episodes 2013 NTSF:SD:SUV:: Daisy Main role (9 episodes, season 3) 2014 Kerry Newblood 2 episodes 2014 Selfie Eliza Dooley Main role (13 episodes) 2015 Seven Days in Hell Lily Allsworth TV movie Year Title Format 2011 Inadmissible Evidence Play Year Title 2010 Doctor Who: The Adventure Games: City of the Daleks 2010 Doctor Who: The Adventure Games: Blood of the Cybermen 2010 Doctor Who: The Adventure Games: TARDIS 2010 Doctor Who: The Adventure Games: Shadows of the Vashta Nerada 2011 Doctor Who: The Adventure Games: The Gunpowder Plot 2010 Doctor Who: Evacuation Earth 2010 Doctor Who: Return to Earth 2010 Doctor Who: The Mazes of Time ==Awards== List of awards and award nominations Year Award Category Nominated work Result Ref. 2010 TV Quick Awards Best Actress Doctor Who 2010 Cosmopolitan \"Woman of the Year\" Awards Best Actress 2011 SFX Awards Best Actress 2011 TV Choice Awards Best Actress 2011 Scream Awards Best Sci-Fi Actress 2012 National Television Awards Best Drama Performance: Female 2012 Nickelodeon UK Kids' Choice Awards Favourite UK Actress 2012 Scottish Fashion Awards Scotland's Fashion Icon 2013 National Television Awards Best Drama Performance - Female Doctor Who 2014 Fright Meter Awards Best Actress Oculus 2015 Empire Awards Best Female Newcomer Guardians of the Galaxy and Oculus ==References== ==Other websites== * Category:1987 births Category:Living people Category:British models Category:Doctor Who Category:People from Inverness Category:Scottish movie actors Category:Scottish television actors",
 "title": "Karen Gillan"
}