{
 "id": "270171",
 "text": "Roe v. Wade was a 1973 landmark decision by the US Supreme Court that ruled that a state law that banned abortion was unconstitutional. The decision said that a woman's right to privacy extended to the fetus that she was carrying. The court viewed that during the first three months (trimester) an abortion was no more dangerous than carrying the fetus to full term. The 7-2 decision was supported by Chief Justice Warren E. Burger and six other Justices and was opposed by Justices William Rehnquist and Byron White. The decision divided the United States into pro-life and pro-choice camps and is still controversial. Pro-life supporters argue that the unborn baby has the same right to life as other people and that the government should intervene to protect it. Pro-choice supporters believe that the unborn baby is not the same as a person, that the woman has the right to choose what she wants to do with her body and that the government should not intervene. Roe v. Wade was limited by a later decision, Webster v. Reproductive Health Services (1989), which allowed the regulation of abortion in some cases. Several states have considered laws banning abortions altogether. In May 2022, a draft of the Supreme Court's decision to overrule Roe v. Wade was leaked to the media. On June 24, 2022, the Supreme Court overturned Roe v. Wade. == Background == The case began in 1970 in Texas as a challenge against a law banning any kind of abortion unless the mother's life was in danger. A pregnant Texas woman, Norma McCorvey (alias Jane Roe), brought a lawsuit against Henry Wade, Dallas County District Attorney, in a Texas federal court. Claiming to be a single woman and pregnant, McCorvey wanted to terminate her pregnancy. She could not get a legal abortion in Texas because her life was not in danger. She wanted it to be done safely by a doctor but said that she could not afford to travel outside Texas. Her lawsuit claimed that the Texas law violated her right to privacy, which was protected by the First, Fourth, Fifth, Ninth, and Fourteenth Amendments. Roe added that she sued \"on behalf of herself and all other women\" in the same situation. The case slowly made its way to the US Supreme Court. Meanwhile, McCorvey had her baby and placed it for adoption. == Majority opinion == In a 7-2 decision, the court held that a woman's right to an abortion was protected by her right to privacy under the Fourteenth Amendment. The decision allowed a woman to decide whether or not to have an abortion during the first trimester. That affected the laws of 46 states. Justice Harry Blackmun wrote the majority opinion: \"We... acknowledge our awareness of the sensitive and emotional nature of the abortion controversy, of the vigorous opposing views, even among physicians, and of the deep and seemingly absolute convictions that the subject inspires.\" == Dissenting opinion == The dissenting opinion was written by Justice William Rehnquist, who disagreed with the majority decision for several reasons. * He pointed out that there was no legitimate plaintiff in the case, which was a requirement to hear the case. A legitimate plaintiff would have been a woman in the first trimester of her pregnancy at some point while the case was being tried. McCorvey (Jane Roe) did not fit that qualification and so the ruling had no application to the case. * The court recognized a woman's right to abortion under the general \"right to privacy\" from previous cases. However, he argued, \"A transaction such as this is hardly 'private' in the ordinary usage of the word.\" * The majority opinion was vague on the exact place of the right to privacy in the Constitution. Several amendments were mentioned, but none was specifically identified to contain the right to privacy. The word \"privacy\" is not found in the Constitution. * Additional problems include the court acting as a legislature in dividing pregnancy into three trimesters and outlining the permissible restrictions that states may make. He pointed out that 36 of the 37 states in 1868, when the Fourteenth Amendment was passed, had laws against abortion, including Texas: \"The only conclusion possible from this history is that the drafters did not intend to have the Fourteenth Amendment withdraw from the States the power to legislate with respect to this matter.\" == Right to privacy interpretation == The basis for the \"right to privacy\" is a judicial interpretation that can be traced from an earlier case Griswold v. Connecticut (1965). In that landmark case, the Supreme Court ruled that a Connecticut law against the use of contraceptives violated the right to privacy, as found in the Constitution. However, the right to privacy is not directly mentioned in the Constitution. The Supreme Court decided that the right to privacy is implied by several amendments. In 1923, the court interpreted the \"liberty\" guarantee in the Fourteenth Amendment as a broad right to privacy. Justice William O. Douglas stated the guarantees of the right to privacy had penumbras (implied rights) \"formed by emanations (a flowing) from those guarantees that help give them life and substance.\" == Trimester concept == In its decision, the court used the three-trimester framework of pregnancy. During the first trimester, an abortion was safer for the mother than childbirth. The reasoning was that the decision of whether to get an abortion at that stage should be left up to the mother to decide. Any law that interfered with abortions in the first trimester would be presumed to be unconstitutional. During the second trimester, laws could regulate abortion only to protect the health of the mother. During the third trimester, the unborn child was viable and so could live on its own, outside the mother's womb. Then, laws could restrict or prohibit abortions unless it was necessary to preserve the mother's health. That doctrine stood until 1992, when Planned Parenthood v. Casey had the court now base the legality of an abortion no longer on trimesters but on fetal viability.Danielle Keats Morris, 'Planned Parenthood v. Casey: From U.S. \"Rights Talk\" to Western European \"Responsibility Talk\"', Fordham International Law Journal, Volume 16, Issue 3 (1992), pp. 772–773 ==Overruling== The case, Docket Number 19-1392,Dobbs, State Health Officer of the Mississippi Department of Health, et al. v. Jackson Women’s Health Organizatione et al. started being argued on December 1, 2021. On May 2, 2022, Politico was given a leaked initial draft majority opinion written by Justice Samuel Alito suggesting that the Supreme Court is and will overturn Roe and Casey in a pending final decision on Dobbs v. Jackson Women's Health Organization. The leak also renewed calls on the US Senate to pass legislation already passed by the House of Representatives to codify the rights created by Roe before the Dobbs decision is formally published. On June 24, 2022, Roe v. Wade was formally struck down by the Supreme Court. The opinion officially released was almost identical to the leaked version on May 2, 2022. Because Chief Justice Roberts \"concurring in judgment,\" the outcome has been put as 5-4 or 6-3 (technically, it is 6-3) and either way effectively overturned Roe v. Wade. The following are the opinions: *Justice Alito delivered the opinion of the court. Opinion of the Court Appendix A to the opinion of the Court Appendix B to the opinion of the Court Concurring with the opinion were *Justice Thomas Justice Kavanaugh - concurrence *Justice Gorsuch - There is no direct concurrence or dissent from Justice Gorsuch. Throughout the opinion, he concurs with some of the opinions and dissents with some of the opinions presented by the Court. Justice Gorsuch - concurring Justice Gorsuch - dissenting Justice Gorsuch - joined in 'opinion in part' Justice Gorsuch - dissenting *Justice Kavanaugh Justice Kavanaugh - concurrence *Justice Barrett - Justice Barrett did not file any opinion with the document. She just concurred with what the majority wrote. Concurring in judgment (in agreement with the outcome of the situation but with different thoughts as to why from the majority). *Chief Justice Roberts Chief Justice Roberts - concurring in judgement Dissenting (not in agreement and voting against the majority) Dissent from Justices Kagan, Sotomayor, and Breyer Dissent appendix A from Justices Kagan, Sotomayor, and Breyer *Justice Kagan *Justice Sotomayor *Justice Breyer This opinion has now given the power to the individual states on what laws they want on abortion. Justice Alito wrote Justices Kagan, Sotomayor, and Breyer stated in their dissenting opinion During a speech at the White House, given shortly after the opinion was released, US President Joe Biden stated in part: US Vice President Kamala Harris stated in a pre-scheduled briefing about the future of women's maternity care had to reverse course and she stated in her briefing: == References == == Other websites == * Roe at 40 – The Controversy Continues * Before and after Roe v. Wade, CNN * Right to Privacy: Constitutional Rights & Privacy Laws Category:1973 in the United States Category:Court cases and laws about abortion Category:United States Supreme Court cases Category:Abortion in the United States",
 "title": "Roe v. Wade"
}