{
 "id": "270110",
 "text": "This is a list of dinosaurs whose remains have been recovered from North America. North America has a rich dinosaur fossil record with great diversity of dinosaurs. This may not mean the dinosaurs were more diverse or abundant; it may be because substantial resources have been devoted to the North American fossil record. The Middle Jurassic is the only poorly represented time period in North America, although several Middle Jurassic localities are known from Mexico. Footprints, eggshells, teeth, and fragments of bone representing theropods, sauropods, and ornithopods have been found, but none of them are diagnostic to the genus level. The Late Jurassic of North America, however, is the exact opposite of the Middle Jurassic. The Late Jurassic Morrison Formation is found in several U.S. states, including Colorado, Utah, Wyoming, Montana, New Mexico, Oklahoma, South Dakota, and Texas. It is notable as being the most fertile single source of dinosaur fossils in the world. During the Early Cretaceous period, new, various types of dinosaurs appeared. Sauropods like Cedarosaurus were still present, but they were not as diverse as they were in the Jurassic. Theropods from the early Cretaceous of North America include Deinonychus, Utahraptor, Acrocanthosaurus, and a new genus of theropod, Microvenator. Huge plant-eating, long-necked dinosaurs included Astrodon and the Late Cretaceous sauropod Sauroposeidon. Ornithischians were more diverse than they were in the Jurassic Period. Tenontosaurus, Hypsilophodon, Iguanodon, Protohadros, and Eolambia are some of the ornithopods that lived then during the Early Cretaceous. Ankylosaurs replaced their stegosaur cousins in the Cretaceous. Ankylosaurs from the Early Cretaceous timeline of North America include Sauropelta and the popular Gastonia. Therizinosaurs such as Falcarius, are also known from the Early Cretaceous rocks of North America. Finally, in the long Late Cretaceous, the greatest abundance and diversity of dinosaurs of all time lived in North America. During the early part of the Late Cretaceous, the therizinosaur Nothronychus and the ceratopsian Zuniceratops lived. During the Campanian stage (83.672 mya), an enormous diversity of dinosaurs is known from the Horseshoe Canyon Formation. Theropods from this formation included the tyrannosaurs such as Albertosaurus, Gorgosaurus, Daspletosaurus, Appalachiosaurus, and Dryptosaurus, as well as the dromaeosaurids Dromaeosaurus, Saurornitholestes, Atrociraptor, and Bambiraptor. Ceratopsians, such as Pachyrhinosaurus, Styracosaurus, Centrosaurus, Monoclonius, Brachyceratops, Pentaceratops, and Leptoceratops existed in the Horseshoe Canyon Formation at that time. Among hadrosaurs, Parasaurolophus, Corythosaurus, Lambeosaurus, Saurolophus, and Prosaurolophus existed also during this time. During the Late Cretaceous, the Maastrichtian stage (7265.5 mya), in the Hell Creek Formation, the diversity of dinosaurs wasn't as great as the preceding Campanian stage. North American herbivorous dinosaurs from this formation included Alamosaurus, Triceratops, Torosaurus, Pachycephalosaurus, Stegoceras, Edmontosaurus, Anatosaurus, Pentaceratops, and Regaliceratops. Predatory dinosaurs from this formation included Tyrannosaurus, Nanotyrannus, Troodon, Dakotaraptor and a possible American species of Spinosaurus. : Name Period DietDiet is sometimes hard to determine for dinosaurs and should be considered a \"best guess\" Notes Abydosaurus Middle Cretaceous herbivore — Achelousaurus Early Cretaceous herbivore — Acrocanthosaurus Early Cretaceous carnivore — Agathaumas Middle Cretaceous herbivore Dubious, see article Agujaceratops Middle Cretaceous herbivore — Alamosaurus Late Cretaceous herbivore — Alaskacephale Middle Cretaceous herbivore — Albertaceratops Cretaceous herbivore — Albertonykus Cretaceous carnivore/insectivore — Albertosaurus End of the Cretaceous carnivore — Aletopelta Cretaceous herbivore — Allosaurus End of the Jurassic carnivore — Ammosaurus Early to Late Jurassic herbivore/omnivore — Amphicoelias Late Jurassic herbivore — Anasazisaurus Cretaceous herbivore — Anatosaurus End of the Cretaceous herbivore — Anchiceratops Cretaceous herbivore — Anchisaurus Jurassic herbivore — Angulomastacator Cretaceous herbivore — Animantarx Cretaceous herbivore — Ankylosaurus Cretaceous herbivore — Antrodemus End of the Jurassic carnivore Probably synonymous with Allosaurus, see article Apatodon (unknown) (unknown) Highly dubious, see article Apatosaurus Jurassic herbivore Formerly known as Brontosaurus Appalachiosaurus Cretaceous carnivore — Arkansaurus Cretaceous carnivore Received validity in 2018 Arrhinoceratops Cretaceous herbivore — Astrodon Cretaceous herbivore — Atlantosaurus Jurassic herbivore — Atrociraptor Cretaceous carnivore — Aublysodon Cretaceous carnivore — Avaceratops Cretaceous herbivore — Bambiraptor Cretaceous carnivore — Barosaurus Jurassic herbivore — Beelemodon Jurassic (unknown) — Bistahieversor Cretaceous carnivore — Brachiosaurus Jurassic/Cretaceous herbivore — Brachyceratops Cretaceous herbivore Only juvenile fossils found so far Brachylophosaurus Cretaceous herbivore — Brontoraptor Jurassic carnivore — Camarasaurus Jurassic herbivore — Camposaurus Triassic carnivore Camptosaurus Jurassic/Cretaceous herbivore — Capitalsaurus Cretaceous carnivore — Caseosaurus Triassic carnivore — Cedarosaurus Cretaceous herbivore — Cedarpelta Cretaceous herbivore — Cedrorestes Cretaceous herbivore — Centrosaurus Cretaceous herbivore Not to be confused with Kentrosaurus Cerasinops Cretaceous herbivore — Ceratops Cretaceous herbivore — Ceratosaurus Jurassic carnivore — Chasmosaurus Cretaceous herbivore — Chindesaurus Triassic carnivore — Chirostenotes Cretaceous carnivore — Cionodon Cretaceous herbivore — Claorhynchus Cretaceous herbivore Dubious, see article Claosaurus Cretaceous herbivore — Coahuilaceratops Cretaceous herbivore — Coelophysis Triassic carnivore — Coelurus Jurassic carnivore — Colepiocephale Cretaceous herbivore — Comanchesaurus Triassic (unknown) — Corythosaurus Cretaceous herbivore — Dakotadon Early Cretaceous herbivore — Daspletosaurus Middle Cretaceous to the End of the Cretaceous carnivore — Deinodon Cretaceous carnivore Dubious, see article Deinonychus Cretaceous carnivore Feathered Diabloceratops Cretaceous herbivore — Diclonius Cretaceous herbivore — Dilophosaurus Early to Late Jurassic carnivore — Diplodocus Jurassic herbivore — Diplotomodon Cretaceous carnivore — Dracorex Cretaceous herbivore A pachycephalosaur, synonymized with Pachycephalosaurus in 2006 Drinker Jurassic herbivore — Dromaeosaurus Cretaceous carnivore — Dromiceiomimus Cretaceous carnivore(?) — Dryosaurus Jurassic herbivore — Dryptosaurus Middle Jurassic to the End of the Cretaceous carnivore — Dyoplosaurus Cretaceous herbivore — Dysganus Cretaceous herbivore — Dyslocosaurus Jurassic herbivore — Dystrophaeus Jurassic herbivore — Edmarka Jurassic carnivore — Edmontonia Cretaceous herbivore — Edmontosaurus Cretaceous herbivore — Einiosaurus Cretaceous herbivore — Eobrontosaurus Jurassic herbivore — Eolambia Cretaceous herbivore — Eotriceratops Cretaceous herbivore — Epanterias Jurassic carnivore — Euoplocephalus Cretaceous herbivore — Falcarius Cretaceous (disputed) Apparently in the course of switching from carnivore to herbivore Fruitadens Jurassic omnivore — Gargoyleosaurus Jurassic herbivore — Gastonia Cretaceous herbivore — Glishades Cretaceous herbivore — Glyptodontopelta Cretaceous herbivore — Gojirasaurus Triassic carnivore — Gorgosaurus Early Jurassic to the End of the Cretaceous carnivore — Gravitholus Cretaceous herbivore — Gryposaurus Cretaceous herbivore — Hadrosaurus Cretaceous herbivore — Hagryphus Cretaceous carnivore — Hanssuesia Cretaceous herbivore — Haplocanthosaurus Jurassic herbivore — Hesperonychus Cretaceous carnivore — Hesperosaurus Jurassic herbivore — Hoplitosaurus Cretaceous herbivore — Hypacrosaurus Cretaceous herbivore — Hypsibema Cretaceous herbivore — Jeyawati Cretaceous herbivore — Kayentavenator Jurassic carnivore — Koparion Jurassic (unknown) — Kosmoceratops Cretaceous herbivore — Kritosaurus Cretaceous herbivore — Labocania Cretaceous carnivore — Lambeosaurus Cretaceous herbivore — Laosaurus Jurassic/Cretaceous herbivore — Leptoceratops Cretaceous herbivore — Lophorhothon Cretaceous herbivore — Madsenius Jurassic carnivore — Magulodon Cretaceous herbivore — Maiasaura Cretaceous herbivore — Marshosaurus Jurassic carnivore — Megapnosaurus Jurassic carnivore Formerly known as Syntarsus Medusaceratops Cretaceous herbivore — Microcephale Cretaceous herbivore — Microvenator Cretaceous carnivore — Moabosaurus Cretaceous herbivore — Mojoceratops Cretaceous herbivore — Monoclonius Cretaceous herbivore — Montanoceratops Cretaceous herbivore — Mymoorapelta Jurassic herbivore — Naashoibitosaurus Cretaceous herbivore — Nanosaurus Jurassic herbivore (?) — Nanotyrannus Cretaceous carnivore — Nedcolbertia Cretaceous (unknown) — Nedoceratops Cretaceous herbivore — Niobrarasaurus Cretaceous herbivore — Nodocephalosaurus Cretaceous herbivore — Nodosaurus End of the Cretaceous herbivore — Nothronychus Cretaceous herbivore — Ojoceratops Cretaceous herbivore — Orcomimus Cretaceous carnivore — Ornatotholus Cretaceous herbivore — Ornitholestes Jurassic carnivore — Ornithomimus Cretaceous herbivore — Orodromeus Cretaceous herbivore — Oryctodromeus Cretaceous herbivore — Othnielia Jurassic herbivore — Othnielosaurus Jurassic herbivore/omnivore — Pachycephalosaurus Cretaceous herbivore — Pachyrhinosaurus Cretaceous herbivore — Palaeopteryx Jurassic (unknown) Dubious, see article Palaeoscincus Cretaceous herbivore — Paluxysaurus End of the Cretaceous herbivore — Panoplosaurus Cretaceous herbivore — Parasaurolophus Cretaceous herbivore — Parksosaurus Cretaceous herbivore — Paronychodon Cretaceous carnivore — Pawpawsaurus Cretaceous herbivore — Peloroplites Cretaceous herbivore — Pentaceratops Cretaceous herbivore — Planicoxa Cretaceous herbivore — Pleurocoelus Cretaceous herbivore — Podokesaurus Jurassic carnivore — Polyonax Cretaceous herbivore — Prenoceratops Cretaceous herbivore — Priconodon Cretaceous herbivore — Prosaurolophus Cretaceous herbivore — Protoavis Triassic (unknown) Dubious, see article Protohadros Cretaceous herbivore — Pteropelyx Cretaceous herbivore — Richardoestesia Cretaceous carnivore — Rubeosaurus Cretaceous herbivore — Sarahsaurus Jurassic omnivore — Saurolophus Cretaceous herbivore — Sauropelta Cretaceous herbivore — Saurophaganax Jurassic carnivore — Sauroposeidon Cretaceous herbivore — Saurornitholestes Cretaceous carnivore — Scelidosaurus Jurassic herbivore — Scutellosaurus Jurassic to the End of the Cretaceous herbivore — Segisaurus Jurassic carnivore — Seitaad Jurassic omnivore — Silvisaurus Cretaceous herbivore — Sonorasaurus Cretaceous herbivore — Sphaerotholus Cretaceous herbivore — Stegoceras Cretaceous herbivore — Stegopelta Cretaceous herbivore — Stegosaurus Jurassic herbivore — Stokesosaurus Jurassic carnivore — Struthiomimus Cretaceous herbivore/omnivore — Stygimoloch Cretaceous herbivore — Styracosaurus Cretaceous herbivore — Supersaurus Jurassic herbivore — Suuwassea Jurassic herbivore — Tanycolagreus Triassic to Jurassic carnivore — Tatankacephalus Cretaceous herbivore — Tatankaceratops Cretaceous herbivore — Tawa Triassic carnivore — Tenontosaurus Cretaceous herbivore — Texacephale Cretaceous herbivore — Texasetes Cretaceous herbivore — Theiophytalia Cretaceous herbivore — Thescelosaurus Cretaceous herbivore — Thespesius Cretaceous herbivore — Tichosteus Jurassic herbivore — Torosaurus Cretaceous herbivore — Torvosaurus Jurassic carnivore — Trachodon Cretaceous herbivore Dubious, see article Triceratops Cretaceous herbivore — Troodon Cretaceous carnivore Includes Stenonychosaurus. Tyrannosaurus End of the Cretaceous carnivore — Utahceratops Cretaceous herbivore — Utahraptor Cretaceous carnivore — Vagaceratops Cretaceous herbivore — Velafrons End of the Cretaceous herbivore — Venenosaurus Cretaceous herbivore — Wyomingraptor Jurassic carnivore — Zephyrosaurus Early to Late Cretaceous herbivore — Zuniceratops End of the Early Cretaceous herbivore — ==Key== Nomen dubium Invalid Nomen nudum ==Timeline== This is a timeline of selected dinosaurs from the list above. Time is measured in Ma, megaannum, along the x-axis. ImageSize = width:800px height:auto barincrement:15px PlotArea = left:10px bottom:50px top:10px right:10px Period = from:-250 till:-25 TimeAxis = orientation:horizontal ScaleMajor = unit:year increment:25 start:-250 ScaleMinor = unit:year increment:5 start:-250 TimeAxis = orientation:hor AlignBars = justify Colors = #legends id:CAR value:claret id:HER value:teal id:OMN value:blue id:black value:black id:white value:white id:cretaceous value:rgb(0.3,0.75,0.1) id:jurassic value:rgb(0.3,0.75,0.4) id:triassic value:rgb(0.3,0.75,0.7) id:mesozoic value:rgb(0.3,0.6,0.4) BarData= bar:eratop bar:space bar:periodtop bar:space bar:NAM1 bar:NAM2 bar:NAM3 bar:NAM4 bar:NAM5 bar:NAM6 bar:NAM7 bar:NAM8 bar:NAM9 bar:NAM10 bar:NAM11 bar:NAM12 bar:NAM13 bar:NAM14 bar:NAM15 bar:NAM16 bar:NAM17 bar:NAM18 bar:NAM19 bar:NAM20 bar:NAM21 bar:NAM22 bar:NAM23 bar:NAM24 bar:NAM25 bar:NAM26 bar:NAM27 bar:NAM28 bar:NAM29 bar:NAM30 bar:NAM31 bar:NAM32 bar:NAM33 bar:NAM34 bar:NAM35 bar:NAM36 bar:NAM37 bar:NAM38 bar:NAM39 bar:NAM40 bar:NAM41 bar:NAM42 bar:NAM43 bar:NAM44 bar:NAM45 bar:NAM46 bar:NAM47 bar:NAM48 bar:NAM49 bar:NAM50 bar:NAM51 bar:NAM52 bar:NAM53 bar:NAM54 bar:NAM55 bar:NAM56 bar:NAM57 bar:NAM58 bar:NAM59 bar:space bar:period bar:space bar:era PlotData= align:center textcolor:black fontsize:M mark:(line,black) width:25 shift:(7,-4) bar:periodtop from: -145 till: -65 color:cretaceous text:Cretaceous from: -200 till: -145 color:jurassic text:Jurassic from: -250 till: -200 color:triassic text:Triassic bar:eratop from: -250 till: -65 color:mesozoic text:Mesozoic PlotData= align:left fontsize:M mark:(line,white) width:5 anchor:till align:left color:CAR bar:NAM1 from:-125 till:-100 text:Acrocanthosaurus color:HER bar:NAM2 from:-70 till:-65 text:Alamosaurus color:CAR bar:NAM3 from:-74 till:-69 text:Albertosaurus color:CAR bar:NAM4 from:-155 till:-145 text:Allosaurus color:HER bar:NAM5 from:-68 till:-65 text:Anatotitan color:HER bar:NAM6 from:-78 till:-70 text:Anchiceratops color:HER bar:NAM7 from:-70 till:-65 text:Ankylosaurus color:HER bar:NAM8 from:-155 till:-145 text:Apatosaurus color:HER bar:NAM9 from:-155 till:-145 text:Barosaurus color:HER bar:NAM10 from:-150 till:-145 text:Brachiosaurus color:HER bar:NAM11 from:-76 till:-72 text:Brachyceratops color:HER bar:NAM12 from:-77 till:-73 text:Brachylophosaurus color:HER bar:NAM13 from:-155 till:-145 text:Camarasaurus color:HER bar:NAM14 from:-155 till:-150 text:Camptosaurus color:HER bar:NAM15 from:-77 till:-73 text:Centrosaurus color:CAR bar:NAM16 from:-155 till:-145 text:Ceratosaurus color:CAR bar:NAM17 from:-215 till:-210 text:Coelophysis color:HER bar:NAM18 from:-77 till:-73 text:Corythosaurus color:CAR bar:NAM19 from:-125 till:-100 text:Deinonychus color:HER bar:NAM20 from:-152 till:-147 text:Diplodocus color:HER bar:NAM21 from:-155 till:-145 text:Dryosaurus color:HER bar:NAM22 from:-70 till:-65 text:Edmontonia color:HER bar:NAM23 from:-73 till:-65 text:Edmontosaurus color:HER bar:NAM24 from:-155 till:-150 text:Eobrontosaurus color:HER bar:NAM25 from:-70 till:-65 text:Eotriceratops color:OMN bar:NAM26 from:-130 till:-125 text:Falcarius color:CAR bar:NAM27 from:-77 till:-74 text:Gorgosaurus color:HER bar:NAM28 from:-83 till:-75 text:Gryposaurus color:HER bar:NAM29 from:-156 till:-144 text:Haplocanthosaurus color:HER bar:NAM30 from:-76 till:-68 text:Hypacrosaurus color:HER bar:NAM31 from:-75 till:-71 text:Kritosaurus color:HER bar:NAM32 from:-77 till:-74 text:Lambeosaurus color:HER bar:NAM33 from:-70 till:-65 text:Leptoceratops color:CAR bar:NAM34 from:-200 till:-194 text:Megapnosaurus color:HER bar:NAM35 from:-83 till:-70 text:Monoclonius color:HER bar:NAM36 from:-70 till:-68 text:Montanoceratops color:HER bar:NAM37 from:-87 till:-82 text:Niobrarasaurus color:CAR bar:NAM38 from:-150 till:-145 text:Ornitholestes color:HER bar:NAM39 from:-76 till:-68 text:Ornithomimus color:HER bar:NAM40 from:-70 till:-65 text:Pachycephalosaurus color:HER bar:NAM41 from:-76 till:-73 text:Parasaurolophus color:HER bar:NAM42 from:-75 till:-73 text:Pentaceratops color:HER bar:NAM43 from:-72 till:-68 text:Saurolophus color:CAR bar:NAM44 from:-155 till:-145 text:Saurophaganax color:HER bar:NAM45 from:-112 till:-108 text:Sauroposeidon color:HER bar:NAM46 from:-200 till:-196 text:Scutellosaurus color:HER bar:NAM47 from:-83 till:-65 text:Stegoceras color:HER bar:NAM48 from:-150 till:-145 text:Stegosaurus color:OMN bar:NAM49 from:-77 till:-70 text:Struthiomimus color:HER bar:NAM50 from:-77 till:-75 text:Styracosaurus color:HER bar:NAM51 from:-125 till:-105 text:Tenontosaurus color:HER bar:NAM52 from:-66 till:-65 text:Thescelosaurus color:HER bar:NAM53 from:-68 till:-65 text:Torosaurus color:CAR bar:NAM54 from:-150 till:-145 text:Torvosaurus color:HER bar:NAM55 from:-68 till:-65 text:Triceratops color:CAR bar:NAM56 from:-69 till:-65 text:Tyrannosaurus color:CAR bar:NAM57 from:-132 till:-119 text:Utahraptor color:HER bar:NAM58 from:-75 till:-71 text:Velafrons color:HER bar:NAM59 from:-93 till:-89 text:Zuniceratops PlotData= align:center textcolor:black fontsize:M mark:(line,black) width:25 bar:period from: -145 till: -65 color:cretaceous text:Cretaceous from: -200 till: -145 color:jurassic text:Jurassic from: -250 till: -200 color:triassic text:Triassic bar:era from: -250 till: -65 color:mesozoic text:Mesozoic ==Criteria for inclusion== *The creature must appear on the List of dinosaurs. *Fossils of the creature must have been found in North America. *This list is a complement to :Category:Dinosaurs of North America. ==Notes== Category:Dinosaurs of North America Category:Lists of dinosaurs",
 "title": "List of North American dinosaurs"
}