{
 "id": "270113",
 "text": "Dinosaurs evolved partway through the Triassic period of the Mesozoic era, around 230 Ma (million years ago). At that time, the earth had one supercontinental landmass, called Pangaea, of which Europe was a part. So it remained throughout the Triassic. By the start of the Jurassic period, some 30 million years later, the supercontinent began to split into Laurasia and Gondwana. The largest inlet from Panthalassa, the superocean that surrounded Pangaea, was called the Tethys Ocean, and as this inlet cut deeper into the supercontinent, much of Europe was flooded. By the Cretaceous, from 145 to 65 million years ago, the continents were beginning to approach their present shapes, but not their present positions, and Europe remained tropical. At times, it was a chain of island-microcontinents including Baltica and Iberia. Europe is relatively rich in fossils from the Jurassic-Cretaceous boundary, and much of what is known about European dinosaurs dates from this time. As the timeline below illustrates, there are substantial gaps in our knowledge from the rest of the Mesozoic. The absence of dinosaur genera from this time is because few fossils have been discovered, and almost certainly not because Europe contained few types of dinosaur—except, perhaps, immediately after the Triassic–Jurassic extinction event. : Name Period DietDiet is sometimes hard to determine for dinosaurs and should be considered a \"best guess\" Notes Acanthopholis Cretaceous herbivore — Aepisaurus Cretaceous herbivore — Agnosphitys Triassic (unknown) Possibly not a dinosaur, see article Agrosaurus Triassic herbivore/omnivore — Ajkaceratops Cretaceous herbivore — Allosaurus Jurassic carnivore — Alocodon Jurassic (unknown) — Altispinax Cretaceous carnivore — Ampelosaurus Cretaceous herbivore — Angloposeidon Cretaceous herbivore — Anoplosaurus Cretaceous herbivore — Aragosaurus Cretaceous herbivore — Arcovenator Cretaceous carnivore — Archaeopteryx Jurassic carnivore Possibly bird Arenysaurus Cretaceous herbivore — Aristosuchus Cretaceous carnivore — Asylosaurus Triassic herbivore/omnivore — Atsinganosaurus Cretaceous herbivore — Aviatyrannis Jurassic carnivore — Avipes Triassic (unknown) — Balaur Cretaceous carnivore — Barilium Cretaceous herbivore — Baryonyx Cretaceous carnivore — Becklespinax Cretaceous carnivore — Betasuchus Cretaceous carnivore (?) — Bihariosaurus Cretaceous herbivore — Blasisaurus Cretaceous herbivore — Bothriospondylus Jurassic herbivore — Bradycneme Cretaceous (unknown) — Calamosaurus Cretaceous carnivore — Calamospondylus Cretaceous (unknown) — Callovosaurus Jurassic herbivore — Camarillasaurus Cretaceous carnivore — Camelotia Triassic herbivore — Canardia Cretaceous herbivore — Cardiodon Jurassic herbivore — Ceratosaurus Jurassic carnivore — Cetiosauriscus Jurassic herbivore — Cetiosaurus Jurassic herbivore — Chondrosteosaurus Cretaceous herbivore — Claosaurus Compsognathus Jurassic carnivore — Concavenator Cretaceous carnivore — Craspedodon Cretaceous herbivore — Craterosaurus Cretaceous herbivore — Cruxicheiros Jurassic carnivore — Cryptosaurus Jurassic herbivore — Cumnoria Jurassic herbivore — Dacentrurus Jurassic herbivore — Darwinsaurus Cretaceous herbivore — Delapparentia Cretaceous herbivore — Demandasaurus Cretaceous herbivore — Dinheirosaurus Jurassic herbivore — Dinodocus Cretaceous herbivore — Dolichosuchus Triassic (unknown) — Draconyx Jurassic herbivore — Dracopelta Jurassic/Cretaceous herbivore — Dromaeosauroides Cretaceous carnivore — Dubreuillosaurus Jurassic carnivore — Duriatitan Jurassic herbivore — Duriavenator Jurassic carnivore — Echinodon Cretaceous herbivore — Efraasia Triassic herbivore — Elopteryx Cretaceous carnivore — Emausaurus Jurassic herbivore — Eotyrannus Cretaceous carnivore — Eousdryosaurus Jurassic herbivore — Erectopus Cretaceous carnivore — Eucamerotus Cretaceous herbivore — Eucercosaurus Cretaceous herbivore — Euronychodon Cretaceous carnivore — Europasaurus Jurassic herbivore — Europelta Cretaceous herbivore — Eustreptospondylus Jurassic carnivore — Galveosaurus Jurassic/Cretaceous herbivore — Genusaurus Cretaceous carnivore — Gideonmantellia Cretaceous herbivore — Gigantosaurus Cretaceous herbivore — Halticosaurus Triassic carnivore — Heptasteornis Cretaceous carnivore — Histriasaurus Cretaceous herbivore — Hungarosaurus Cretaceous herbivore — Huxleysaurus Cretaceous herbivore — Hylaeosaurus Cretaceous herbivore — Hypselosaurus Cretaceous herbivore — Hypselospinus Cretaceous herbivore — Hypsilophodon Cretaceous herbivore/omnivore — Iguanodon Cretaceous herbivore — Iliosuchus Cretaceous carnivore — Ischyrosaurus Jurassic herbivore — Iuticosaurus Cretaceous herbivore — Juratyrant Jurassic carnivore — Juravenator Jurassic carnivore — Koutalisaurus Cretaceous herbivore — Kukufeldia Cretaceous herbivore — Lexovisaurus Jurassic herbivore — Liassaurus Jurassic (unknown) — Liliensternus Triassic carnivore — Lirainosaurus Cretaceous herbivore — Lophostropheus Triassic/Jurassic carnivore — Loricatosaurus Jurassic herbivore — Losillasaurus Jurassic/Cretaceous herbivore — Lourinhanosaurus Jurassic carnivore — Lourinhasaurus Jurassic herbivore — Lusitanosaurus Jurassic herbivore — Lusotitan Jurassic herbivore — Macrurosaurus Cretaceous herbivore — Magnosaurus Jurassic carnivore — Magyarosaurus Cretaceous herbivore — Mantellisaurus Cretaceous herbivore — Mantellodon Cretaceous herbivore — Megalosaurus Jurassic carnivore — Merosaurus Jurassic carnivore — Metriacanthosaurus Jurassic carnivore — Miragaia Jurassic herbivore — Mochlodon Cretaceous herbivore — Morinosaurus Cretaceous herbivore — Neosodon Jurassic herbivore — Neovenator Cretaceous carnivore — Newtonsaurus Triassic carnivore — Normanniasaurus Cretaceous herbivore — Nuthetes Cretaceous carnivore — Ohmdenosaurus Jurassic herbivore — Oplosaurus Cretaceous herbivore — Ornithodesmus Cretaceous carnivore — Ornithopsis Cretaceous herbivore — Orthomerus Cretaceous herbivore — Owenodon Cretaceous herbivore — Paludititan Cretaceous herbivore — Pantydraco Triassic herbivore — Pararhabdodon Cretaceous herbivore — Pelecanimimus Cretaceous carnivore — Pelorosaurus Cretaceous herbivore — Phyllodon Jurassic herbivore — Piveteausaurus Jurassic carnivore — Proplanicoxa Cretaceous herbivore — Plateosaurus Triassic herbivore — Pneumatoraptor Cretaceous carnivore — Poekilopleuron Jurassic carnivore — Polacanthus Cretaceous herbivore — Ponerosteus Cretaceous (unknown) — Priodontognathus Jurassic herbivore — Proa Cretaceous herbivore — Proceratosaurus Jurassic carnivore — Procompsognathus Triassic carnivore — Pterospondylus Triassic carnivore — Pyroraptor Cretaceous carnivore — Regnosaurus Cretaceous herbivore — Rhabdodon Cretaceous herbivore — Ruehleia Triassic herbivore — Rutellum Jurassic herbivore Nomen oblitum Saltriosaurus Jurassic carnivore — Sarcolestes Jurassic herbivore — Sarcosaurus Jurassic carnivore — Scelidosaurus Jurassic herbivore — Scipionyx Cretaceous carnivore — Sciurumimus Jurassic carnivore — Sellacoxa Cretaceous herbivore — Stegosaurus Jurassic herbivore — Stenopelix Cretaceous herbivore — Streptospondylus Jurassic herbivore — Struthiosaurus Cretaceous herbivore — Suchosaurus Cretaceous carnivore — Tarascosaurus Cretaceous carnivore — Tastavinsaurus Cretaceous herbivore — Taveirosaurus Cretaceous herbivore — Teinurosaurus Jurassic carnivore — Telmatosaurus Cretaceous herbivore — Tethyshadros Cretaceous herbivore — Thecocoelurus Cretaceous (unknown) — Thecodontosaurus Triassic herbivore — Thecospondylus Cretaceous (unknown) — Torvosaurus Jurassic carnivore — Trimucrodon Jurassic herbivore — Turiasaurus Jurassic/Cretaceous herbivore — Valdoraptor Cretaceous carnivore — Valdosaurus Cretaceous herbivore — Variraptor Cretaceous carnivore — Velocipes Triassic (unknown) May not be a dinosaur, see article Xenoposeidon Cretaceous herbivore — Yaverlandia Cretaceous (unknown) — Zalmoxes Cretaceous herbivore — Zby Jurassic herbivore — ==Key== Nomen dubium Invalid Nomen nudum ==Timeline== This is a timeline of selected dinosaurs from the list above. Time is measured in Ma, megaannum, along the x-axis. ImageSize = width:800px height:auto barincrement:15px PlotArea = left:10px bottom:50px top:10px right:10px Period = from:-250 till:-25 TimeAxis = orientation:horizontal ScaleMajor = unit:year increment:25 start:-250 ScaleMinor = unit:year increment:5 start:-250 TimeAxis = orientation:hor AlignBars = justify Colors = #legends id:CAR value:claret id:HER value:teal id:OMN value:blue id:black value:black id:white value:white id:cretaceous value:rgb(0.3,0.75,0.1) id:jurassic value:rgb(0.3,0.75,0.4) id:triassic value:rgb(0.3,0.75,0.7) id:mesozoic value:rgb(0.3,0.6,0.4) BarData= bar:eratop bar:space bar:periodtop bar:space bar:NAM1 bar:NAM2 bar:NAM3 bar:NAM4 bar:NAM5 bar:NAM6 bar:NAM7 bar:NAM8 bar:NAM9 bar:NAM10 bar:NAM11 bar:NAM12 bar:NAM13 bar:NAM14 bar:NAM15 bar:NAM16 bar:NAM17 bar:NAM18 bar:NAM19 bar:NAM20 bar:NAM21 bar:NAM22 bar:NAM23 bar:NAM24 bar:NAM25 bar:NAM26 bar:NAM27 bar:NAM28 bar:NAM29 bar:NAM30 bar:NAM31 bar:NAM32 bar:NAM33 bar:NAM34 bar:NAM35 bar:NAM36 bar:NAM37 bar:NAM38 bar:NAM39 bar:NAM40 bar:NAM41 bar:NAM42 bar:NAM43 bar:NAM44 bar:NAM45 bar:NAM46 bar:NAM47 bar:NAM48 bar:NAM49 bar:NAM50 bar:NAM51 bar:NAM52 bar:NAM53 bar:NAM54 bar:NAM55 bar:NAM56 bar:NAM57 bar:NAM58 bar:NAM59 bar:NAM60 bar:NAM61 bar:NAM62 bar:NAM63 bar:NAM64 bar:NAM65 bar:NAM66 bar:NAM67 bar:NAM68 bar:NAM69 bar:NAM70 bar:NAM71 bar:NAM72 bar:space bar:period bar:space bar:era PlotData= align:center textcolor:black fontsize:M mark:(line,black) width:25 shift:(7,-4) bar:periodtop from: -145 till: -65 color:cretaceous text:Cretaceous from: -200 till: -145 color:jurassic text:Jurassic from: -250 till: -200 color:triassic text:Triassic bar:eratop from: -250 till: -65 color:mesozoic text:Mesozoic PlotData= align:left fontsize:M mark:(line,white) width:5 anchor:till align:left color:HER bar:NAM1 from:-112 till:-94 text:Acanthopholis color:CAR bar:NAM2 from:-155 till:-145 text:Allosaurus color:HER bar:NAM3 from:-74 till:-70 text:Ampelosaurus color:HER bar:NAM4 from:-112 till:-100 text:Anoplosaurus color:HER bar:NAM5 from:-130 till:-120 text:Aragosaurus color:CAR bar:NAM6 from:-150 till:-145 text:Archaeopteryx color:CAR bar:NAM7 from:-130 till:-120 text:Aristosuchus color:OMN bar:NAM8 from:-204 till:-199 text:Asylosaurus color:CAR bar:NAM9 from:-155 till:-150 text:Aviatyrannis color:CAR bar:NAM10 from:-130 till:-125 text:Baryonyx color:CAR bar:NAM11 from:-66 till:-65 text:Betasuchus color:HER bar:NAM12 from:-170 till:-150 text:Bothriospondylus color:HER bar:NAM13 from:-165 till:-160 text:Callovosaurus color:HER bar:NAM14 from:-215 till:-200 text:Camelotia color:HER bar:NAM15 from:-155 till:-150 text:Camptosaurus color:CAR bar:NAM16 from:-165 till:-145 text:Ceratosaurus color:HER bar:NAM17 from:-181 till:-169 text:Cetiosaurus color:CAR bar:NAM18 from:-150 till:-145 text:Compsognathus color:HER bar:NAM19 from:-154 till:-150 text:Dacentrurus color:HER bar:NAM20 from:-155 till:-150 text:Dinheirosaurus color:HER bar:NAM21 from:-130 till:-123 text:Dollodon color:HER bar:NAM22 from:-155 till:-150 text:Dracopelta color:CAR bar:NAM23 from:-169 till:-164 text:Dubreuillosaurus color:CAR bar:NAM24 from:-171 till:-167 text:Duriavenator color:HER bar:NAM25 from:-145 till:-140 text:Echinodon color:HER bar:NAM26 from:-212 till:-207 text:Efraasia color:CAR bar:NAM27 from:-71 till:-68 text:Elopteryx color:CAR bar:NAM28 from:-130 till:-125 text:Eotyrannus color:CAR bar:NAM29 from:-112 till:-106 text:Erectopus color:HER bar:NAM30 from:-130 till:-125 text:Eucamerotus color:HER bar:NAM31 from:-155 till:-150 text:Europasaurus color:CAR bar:NAM32 from:-164 till:-161 text:Eustreptospondylus color:CAR bar:NAM33 from:-210 till:-205 text:Halticosaurus color:HER bar:NAM34 from:-136 till:-125 text:Histriasaurus color:HER bar:NAM35 from:-86 till:-83 text:Hungarosaurus color:HER bar:NAM36 from:-140 till:-136 text:Hylaeosaurus color:HER bar:NAM37 from:-70 till:-65 text:Hypselosaurus color:OMN bar:NAM38 from:-140 till:-130 text:Hypsilophodon color:HER bar:NAM39 from:-130 till:-120 text:Iguanodon color:CAR bar:NAM40 from:-155 till:-145 text:Juravenator color:CAR bar:NAM41 from:-215 till:-200 text:Liliensternus color:CAR bar:NAM42 from:-203 till:-196 text:Lopostropheus color:HER bar:NAM43 from:-164 till:-161 text:Loricatosaurus color:HER bar:NAM44 from:-155 till:-145 text:Lourinhanosaurus color:HER bar:NAM45 from:-150 till:-145 text:Lusotitan color:HER bar:NAM46 from:-133 till:-127 text:Macrurosaurus color:HER bar:NAM47 from:-70 till:-65 text:Magyarosaurus color:HER bar:NAM48 from:-140 till:-125 text:Mantellisaurus color:CAR bar:NAM49 from:-181 till:-169 text:Megalosaurus color:HER bar:NAM50 from:-155 till:-145 text:Miragaia color:HER bar:NAM51 from:-150 till:-145 text:Neosodon color:CAR bar:NAM52 from:-130 till:-125 text:Neovenator color:HER bar:NAM53 from:-138 till:-112 text:Pelorosaurus color:HER bar:NAM54 from:-216 till:-199 text:Plateosaurus color:CAR bar:NAM55 from:-168 till:-165 text:Poekilopleuron color:HER bar:NAM56 from:-132 till:-112 text:Polacanthus color:CAR bar:NAM57 from:-167 till:-164 text:Proceratosaurus color:HER bar:NAM58 from:-216 till:-203 text:Ruehleia color:HER bar:NAM59 from:-164 till:-159 text:Sarcolestes color:CAR bar:NAM60 from:-201 till:-195 text:Sarcosaurus color:HER bar:NAM61 from:-208 till:-194 text:Scelidosaurus color:CAR bar:NAM62 from:-115 till:-111 text:Scipionyx color:HER bar:NAM63 from:-220 till:-210 text:Sellosaurus color:HER bar:NAM64 from:-150 till:-145 text:Stegosaurus color:CAR bar:NAM65 from:-150 till:-145 text:Stokeosaurus color:HER bar:NAM66 from:-83 till:-65 text:Struthiosaurus color:CAR bar:NAM67 from:-150 till:-145 text:Torvosaurus color:HER bar:NAM68 from:-150 till:-140 text:Turiasaurus color:CAR bar:NAM69 from:-127 till:-121 text:Valdoraptor color:HER bar:NAM70 from:-144 till:-122 text:Valdosaurus color:HER bar:NAM71 from:-145 till:-140 text:Xenoposeidon color:HER bar:NAM72 from:-70 till:-67 text:Zalmoxes PlotData= align:center textcolor:black fontsize:M mark:(line,black) width:25 bar:period from: -145 till: -65 color:cretaceous text:Cretaceous from: -200 till: -145 color:jurassic text:Jurassic from: -250 till: -200 color:triassic text:Triassic bar:era from: -250 till: -65 color:mesozoic text:Mesozoic ==Criteria for inclusion== *The creature must appear on the List of dinosaurs. *Fossils of the creature must have been found in Europe. *This list is a complement to :Category:Dinosaurs of Europe. ==Related pages== * :Category: Cretaceous paleontological sites of Europe ==Notes== * Category:Lists of dinosaurs Dinosaurs",
 "title": "List of European dinosaurs"
}