{
 "id": "270597",
 "text": "John Simon Bercow (surname pronounce BER-COE; born 19 January 1963) is a former British politician who was the 157th Speaker of the House of Commons of the United Kingdom from 2009 until 2019. He was the Member of Parliament (MP) for the constituency of Buckingham from 1997 to 2019. ==Biography== John Bercow was active in the Conservative Party from a young age and was a Conservative councillor, for Lambeth, from 1986 to 1990. He stood as a candidate to become an MP at the 1987 and 1992 General Elections but was not successful. At the 1997 General Election, Bercow was elected the Conservative MP for Buckingham. He served in the shadow cabinets of Iain Duncan Smith and Michael Howard.Bercow Says He's Relieved to Quit U.K. Conservatives bloomberg.com, 26 June 2009 After the Speaker Michael Martin resigned on 22 June 2009, Bercow was elected as the Speaker. Bercow is the first Jewish Speaker. He is the first Speaker not to wear traditional court robes while presiding over the House of Commons. But, along with tradition, Bercow does now display his coat of arms at Speaker's House.Speaker Bercow's coat of arms On 9 September 2019, Bercow told the House of Commons that he would stand down on 31 October, or at the next general election, whichever occurs first. He officially left the office on 4 November 2019. Manor of Northstead: John Bercow, Gov.uk, 4 November 2019. Retrieved 4 November 2019 In 2021, Bercow became a member of the Labour Party, saying that Boris Johnson's leadership was making his old party \"reactionary, populist, nationalistic and sometimes even xenophobic\". ==References== Category:1963 births Category:Living people Category:Conservative Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:Speakers of the House of Commons of the United Kingdom Category:Jewish British politicians Category:People from Middlesex Category:Politicians from London Category:Members of the Privy Council of the United Kingdom Category:UK MPs 1997–2001 Category:UK MPs 2001–2005 Category:UK MPs 2005–2010 Category:UK MPs 2010–2015 Category:UK MPs 2015–2017 Category:UK MPs 2017–2019",
 "title": "John Bercow"
}