{
 "id": "27065",
 "text": "Lindsay Dee Lohan (born July 2, 1986) is an American actress and singer. She has acted in several movies, including The Parent Trap, Life-Size, Get A Clue, Freaky Friday, Mean Girls, Confessions of a Drama Queen, Herbie Fully Loaded, Just My Luck, Georgia Rule and Labor Pains. Early life. Lindsay Lohan was born on July 2, 1986, in The Bronx borough of New York City, and grew up in Merrick and Cold Spring Harbor on Long Island, New York. She is the eldest child of Dina and Michael Lohan. ==Early life== Lohan's parents are Dina Lohan and Michael Lohan, both of whom are of Irish and Italian descent. She has a sister named Ali Lohan. == Movie career == The movies The Parent Trap and Mean Girls made Lohan popular in the United States. They also showed her talent in singing. She plays the guitar and has done many singing parts. == Music career == She first sang in the soundtrack of the movie Confessions of a Teenage Drama Queen. In 2004, she released her first album named Speak. In 2005, her second album, A Little More Personal (RAW) was released. Now, in recent years she has been working on a new album with Ne-Yo, Snoop Dogg, Timbaland. This album was released at the end of 2008. == Personal life == Between 2008 and 2009 Lohan dated Samantha Ronson. However, Lohan now identifies as heterosexual. She had a miscarriage in 2013. In May 2011, Lohan was convicted of misdemeanor theft of a $2,500 necklace from a jewelry store in Venice Beach. On November 28, 2021, Lohan announced her engagement to financier Bader Shammas after three years of dating. On July 2, 2022, it was confirmed that Lohan and Shammas were married. In July 2023, Lohan gave birth to her son Luai. == Filmography == === Movies === Year Movie Role Notes 1998 The Parent Trap Hallie Parker / Annie James Main role 2000 Life-Size Casey Stewart TV 2002 Get a Clue Lexy Gold TV movie by Disney Channel Original Movie 2003 Freaky Friday Anna Coleman Main role 2004 Confessions of a Teenage Drama Queen Mary Elizabeth \"Lola\" Steppe Main role Mean Girls Cady Heron Main role 2005 Herbie: Fully Loaded Margaret \"Maggie\" Peyton Main role 2006 Just My Luck Ashley Albright Main role A Prairie Home Companion Lola Johnson Supporting role Bobby Diane Huber Supporting role 2007 I Know Who Killed Me Aubrey Fleming / Dakota Moss Main Role 2008 Dare to Love Me La Ritana Main role / filming 2010 Machete TBA Supporting role 2012 Liz and Dick Main role TV movie 2012 Scary Movie 5 Herself Credited 2013 The Canyons Tara Supporting Role === Television === * Another World - 1996–1997 * Bette (2000–2001) - appeared October 11, 2000, in pilot episode only * Punk'd - one episode, December 14, 2003 (see above) * Saturday Night Live - Host, May 1, 2004 * 2004 MTV Movie Awards - Host, June 10, 2004 * That '70s Show - \"Mother's Little Helper\" episode, November 10, 2004 * Saturday Night Live - Cameo for Weekend Update, December 11, 2004 * Saturday Night Live - Host, May 21, 2005 (season finale) * Saturday Night Live - Host, April 15, 2006 * 2006 World Music Awards - Host, November 2006 * Ugly Betty- episode Jump === Albums === * Speak * A Little More Personal (RAW) * Untitled third album === Singles === Year Single Album 2004 \"Rumors\" Speak 2005 \"Over\" Speak 2005 \"First\" Speak 2005 \"Confessions of a Broken Heart (Daughter to Father)\" A Little More Personal (Raw) 2006 \"I Live for the Day\" A Little More Personal (Raw) 2008 \"Bossy\" Untitled third album == References == == Other websites == * Official website * Casablanca (Universal) Records site * * * * Maxim cover shoot pictures and interview Category:1986 births Category:Living people Category:Actors from New York City Category:American child actors Category:American guitarists Category:American movie actors Category:American pop musicians Category:American television actors Category:American thieves Category:Models from New York City Category:Musicians from New York City Category:Singers from New York City",
 "title": "Lindsay Lohan"
}