{
 "id": "270713",
 "text": "The wandering albatross is a large seabird of the family Diomedeidae. It is also called the snowy albatross or white-winged albatross.Clements, James 2007. The Clements Checklist of the Birds of the World. 6th ed, Ithaca, NY: Cornell University Press. It is the largest member of the genus Diomedea (the great albatrosses) and has the largest wingspan of any living bird.Robertson, C.J.R. 2003. Albatrosses (Diomedeidae). In Hutchins, Michael (ed). Grzimek's Animal Life Encyclopedia. 8 Birds I Tinamous and Ratites to Hoatzins. 2nd ed, Farmington Hills, MI: Gale Group. pp. 113–116, 118–119. It can have a wing- span of up to 11.5 feet (3.50 m).Dunn, Jon L. & Alderfer, Jonathon 2006. Accidentals, extinct species. In Levitt, Barbara (ed) National Geographic Field Guide to the Birds of North America, 5th ed, Washington D.C.: National Geographic Society, p. 467. The IUCN says it is a vulnerable species. == Behavior == Wandering albatross live together when breeding, which they do once every two years. They are monogamous, and usually mate for life. They can live for over 50 years, Is foraging efficiency a key parameter in aging? (2010) and adult mortality is only 5 to 7% a year (this is very low for birds). === Communication === They make many kinds of noises, such as screams, whistles, grunts and bill clapping. When they are looking for a mate, they spread their wings, wave their heads and tap their bills together. They feed at night on cephalopods, small fish, and crustaceansHarrison, Colin; Greensmith, Alan 1993. Non-Passerines. In Bunting, Edward (ed) Birds of the World. New York, NY: Dorling Kindersley, p48. == References == ==Other websites== * *BirdLife Species Factsheet. * Wandering Albatross videos, photos & sounds on the Internet Bird Collection * Holotypes of Wandering Albatross subspecies in the collection of the Museum of New Zealand Te Papa Tongarewa * South Georgia albatross slide show Category:Seabirds Category:Procellariiformes",
 "title": "Wandering albatross"
}