{
 "id": "270881",
 "text": "Jeremy John Durham \"Paddy\" Ashdown, Baron Ashdown of Norton-sub-Hamdon (27 February 1941 - 22 December 2018) was a British politician and international diplomat. He served as leader of the Liberal Democrats from July 1988 to August 1999. == Biography == Paddy Ashdown was born in New Delhi, British India, but was brought up in Northern Ireland and his Irish accent brought him the nickname \"Paddy\". He served in the Royal Marines from 1959 to 1972 and saw fighting in Borneo, Hong Kong and Northern Ireland. At the 1983 general election, Ashdown became the Liberal Party's Member of Parliament (MP) for the constituency of Yeovil. In 1988, when the Liberal Party merged with the Social Democratic Party to form the Liberal Democrats, Ashdown was elected the leader of the new party and led the party through the 1992 and 1997 general elections. He resigned in 1999, and was given both a knighthood and a seat in the House of Lords. In the House of Lords, he was given the title Baron Ashdown of Norton-sub-Hamdon. From 2002 to 2006 he served as High Representative for Bosnia and Herzegovina. His reputation was damaged slightly in 1992, when it was revealed that he had a five-month extra-marital affair with his secretary, and many British newspapers exposed this in great detail. The Sun newspaper ran a famous headline which played on Ashdown's name, calling him \"Paddy Pants-Down\". Ashdown was diagnosed with \"serious\" bladder cancer in October 2018. He died two months later on 22 December 2018 from the disease in Norton-sub-Hamdon, Somerset, at the age of 77. ==References== ==Other websites== * * Category:1941 births Category:2018 deaths Category:British military people Category:Liberal Democrats (UK) MPs Category:Members of the British House of Commons for English constituencies Category:Knights Grand Cross of the Order of St Michael and St George Category:Leaders of the Liberal Democrats (UK) Category:Liberal Party (UK) MPs Category:Northern Ireland politicians Category:Members of the Privy Council of the United Kingdom Category:UK MPs 1983–1987 Category:UK MPs 1987–1992 Category:UK MPs 1992–1997 Category:UK MPs 1997–2001 Category:Liberal Democrat Life Peers",
 "title": "Paddy Ashdown"
}