{
 "id": "270851",
 "text": "The Year 10,000 problem (also known as the Y10K problem, Y10K Bug, and Y10K) is an error machines and computers will encounter when they need to express five digits for a year. ==Cultural practicing== Some peopleCultural practice of Two-Digit Chop Off. practice the art of cutting the last two digits of a decade. For example, the \"1970's\" becomes just the \"70s\".Chopping It Off. Cultural.com, 2010. However, this becomes a problem, because to keep order, one will now need to take the last three digits, rather than two.Digital Prolonging effects of Y10K. Retrieved 5-7-08. == Computer Errors due to this == This is also a problem because the \"000's\" might be confused with the standard digits \"00's\", representing a new century. Also, the year can overflow with certain computer programs. For example: in Microsoft Excel, 12/31/9999 is considered a valid date, but 1/1/10000 is invalid and will raise errors. The date \"ten thousand\" is unable to be supported, producing a large negative instead.Date Overflowing: Your Machine in 10000. Long Now Foundation, 2005. ==Efforts== So far, the Long Now Foundation is able to preempt the Y10K by adding a \"0\" in front of the date. So the current year of , will look like 0. However, it would still be affected by the \"Y100K\" problem, the \"Y1000K\" problem, \"Y10000K\" Problem, etc.What about 100K? Long Now, 2005. == Database Errors == In MySQL databases, the values of some datatypes are limited to the scope of only 31-12-9999 which causes some problems as the computer would not be able to compile the data in the SQL. Many other SQL software can also be affected by this error. == Comma Errors == Another possible error in the computer display of the year ten thousand is the possible use of commas in between the third and fourth digit. To avoid confusion with years such as \"1000\", a comma may be added to display such year as 10,000. Today, due to the low likelihood of a year such as \"2000\" being confused with \"200\", commas are rarely used. \"When [the year is] embedded in a date, [it is] plenty easy to discern from context. \" == Related pages == * Year 2000 problem * Programming bug * Integer overflow ==References== == Other websites == * Official Long Now Site Category:Computing",
 "title": "Year 10,000 problem"
}