{
 "id": "270931",
 "text": "Ann Noreen Widdecombe MEP (born 4 October 1947 in Bath, Somerset, England) is a British former politician. She was the Conservative Party Member of Parliament (MP) for the constituency of Maidstone and The Weald from 1987 to 2010. ==Early life== Widdecombe is the daughter of a Ministry of Defence civil servant James Murray Widdecombe and Rita N Plummer. She attended the Royal Navy School in Singapore,Ann Widdecombe set to stand down; BBC News, 7 October 2007 and a convent school in Bath. She then read Latin at Birmingham University and later attended Lady Margaret Hall, Oxford, to read Philosophy, Politics and Economics (PPE). She worked for Unilever (1973–75). She was then an administrator at the University of London (1975–87) before entering Parliament. ==Career== She was first elected to the House of Commons at the 1987 General Election. From 1995 to 1997, she was the Minister of State for Prisons. Ann Widdecombe served in William Hague's shadow cabinet from 1997 to 2001. Widdecombe retired from politics at the 2010 general election. Throughout her political career, Widdecombe was socially conservative and converted from the Church of England to Catholic Church in 1992 after the Church of England voted to allow female priests. She is a committed animal lover. She is one of the few Conservative MPs to have consistently voted for the ban on fox hunting.\"Ann Widdecombe compared to 'Fox hunting – Ban'\", Public Whip. Retrieved on 21 March 2009. Widdecombe was a contestant in the 2010 series of Strictly Come Dancing. In 2002 she took part in a Louis Theroux television documentary. It showed her life, both in and out of politics. She was cast as herself in an episode of the science-fiction drama Doctor Who. On 23 April 2012, Widdecombe presented an hour-long documentary for BBC Radio 5 Live. It was Drunk Again: Ann Widdecombe Investigates, looking at how the British attitude to getting drunk has changed over the last few years. ==Bibliography== ===Fiction=== * 2000: The Clematis Tree. London: Weidenfeld & Nicolson * 2002: An Act of Treachery. London: Weidenfeld & Nicolson * 2005: Father Figure. London: Weidenfeld & Nicolson * 2005: An Act of Peace. London: Weidenfeld & Nicolson ===Non-fiction=== * 1999: Inspired and Outspoken: the collected speeches of Ann Widdecombe; edited by John Simmons, with a biographical preface by Nick Kochan. London: Politico's Publishing * 2000: Kochan, Nicholas Ann Widdecombe: right from the beginning. London: Politico's Publishing ==References== == Other websites == * Category:1947 births Category:Living people Category:English novelists Category:English Roman Catholics Category:English television presenters Category:Conservative Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:UK MPs 1987–1992 Category:UK MPs 1992–1997 Category:UK MPs 1997–2001 Category:UK MPs 2001–2005 Category:UK MPs 2005–2010 Category:Members of the Privy Council of the United Kingdom Category:People from Bath, Somerset Category:Politicians from Somerset Category:Strictly Come Dancing participants Category:Television personalities from Somerset Category:Writers from Somerset Category:Alumni of the University of Birmingham",
 "title": "Ann Widdecombe"
}