{
 "id": "271015",
 "text": "is a Japanese architect and university professor at Tama Art University and Keio University in Tokyo. Sejima won the Pritzker Architecture Prize in 2010.\"Kazuyo Sejima & Ryue Nishizawa–2010 Laureates, Biography\". Retrieved 2012-3-1. ==Career== Sejima worked in the design office of Toyo Ito. In 1987, she started her own company, Kazuyo Sejima and Associates in 1987. In 1995, she started a partnership with Ryūe Nishizawa in Tokyo. It was called SANAA.SANAA is an acronym. SANAA stands for \"Sejima And Nishizawa And Associates\". In 2005-2008, she was a visiting professor at the School of Architecture at Princeton University, in Princeton, New Jersey. In 2010, Sejima became Director of the Architecture Sector for the Venice Biennale. She organized the 12th Annual International Architecture Exhibition. She is the first woman to be in that position. ==Projects== :This table is not finished; you can help Wikipedia by adding to it. Name City State/Country Completed Other Information Image Platform IArchSource, \"Platform I\" . Retrieved 2012-3-1. Katsura Chiba, Japan 1988 Platform IIArchSourc, \"Platform II\" . Retrieved 2012-3-1. Kitagoma Yamanashi, Japan 1990 Castelbajac Sports StoreArchSource, \"Castelbajac Sports Store\". Retrieved 2012-3-1. Kanagawa, Japan 1991 Saishunkan Seiyaku Women's DormitoryArch Source, \"Saishunkan Seiyaku Women’s Dormitory\" . Retrieved 2012-3-1. Kumamoto Kumamoto, Japan 1991 Pachinko Parlor IArchSource, \"Pachinko Parlor I\" . Retrieved 2012-3-1. Hitachi Ibaraki, Japan 1993 Pachinko Parlor IIArchSource, \"Pachinko Parlor II\" . Retrieved 2012-3-1. Naka Ibaraki, Japan 1993 Police Box at Chofu StationArchSource, \"Police Box at Chofu Station\" . Retrieved 2012-3-1. Tokyo, Japan 1994 Villa in the ForestArchSource, \"Villa in the Forest\" . Retrieved 2012-3-1. Chino Nagano, Japan 1994 Gifu Kitagata Apartment BuildingArchSource, \"Gifu Kitagata Apartment Building\" . Retrieved 2012-3-1. Gifu Gifu, Japan 1998 U-Office BuildingArchSource, \"U-Building,\". Retrieved 2012-3-1. Ushiku Ibaraki, Japan 1998 HHStyle.com StoreArchSource, \"HHStyle.com,\". Retrieved 2012-3-1. Tokyo, Japan 2000 Asahi Shimbun Yamagata Office Building,ArchSource, \"Asahi Shimbun Yamagata Building\". Retrieved 2012-3-1. Yamagata, Japan 2003 House in a Plum Grove,ArchSource, \"House ina Plum Grove\"; Stories of Houses, \"House in a Plum Grove (Tokyo)\". Retrieved 2012-3-1. Tokyo, Japan 2003 Onishi Civic Center,ArchSource, \"Multipurpose Facility in Onishi\". Retrieved 2012-3-1. Onishi Gunma, Japan 2005 De Kunstlinie Theater and Cultural Center,ArchSource, \"De Kunstlinie Theater and Cultural Center\" . Retrieved 2012-3-1. Almere Netherlands 2007 ===Unbuilt=== * Platform III House, Tokyo, Japan, 1990 * Nasumoahara Harmony Hall,ArchSource, \"Nasunogahara Harmony Hall. Retrieved 2012-3-1. Tochigi Prefecture, Japan, 1991 * Service Center at the Tokyo Expo 96,ArchSource, \"Tokyo Expo 96 Facilities Building\" . Retrieved 2012-3-1. Tokyo, Japan, 1995 * Yokohama International Port Terminal,ArchSource, \"Yokohama International Port Terminal\" . Retrieved 2012-3-1. Kanagawa Prefecture, Japan, 1994 ==Honors== * Venice Biennale Golden Lion, 2004. * Pritzker Prize, 2010. * Thomas Jefferson Foundation Medal, 2019 ==References== == Other websites == * SANAA website * Vernissage.tv, \"SANAA: Works 1998-2008 New Museum of Contemporary Art, New York\" Category:1956 births Category:Living people Category:Japanese architects Category:Pritzker Architecture Prize winners Category:People from Ibaraki Prefecture",
 "title": "Kazuyo Sejima"
}