{
 "id": "271102",
 "text": "Most political parties in Scotland can be put into two groups: Unionists and Nationalists. Nationalists want Scotland to become an independent country and to stop being part of the United Kingdom whereas Unionists want Scotland to stay in the United Kingdom. ==Parties currently represented== The following parties are parties represented at either the British House of Commons and/or the Scottish Parliament. Party UK House of Commons members out of 59 Scottish Parliament members out of 129 Notes Scottish National Party (SNP) 45 64 A centre-left party which promotes social democracy and Scottish independence. Scottish Conservative Party 6 31 A centre-right party which promotes conservatism and strong British unionism. Scottish Labour Party 1 22 A centre- left party which promotes social democracy and Scottish unionism. 4 4 A centrist party which promotes liberalism, federalism and British unionism. Scottish Green Party 0 7 A left-wing party which promotes green politics and Scottish independence. ==Parties formerly represented in the Scottish Parliament== * Scottish Senior Citizens Unity Party - 1 MSP from 2003–2007 * Scottish Socialist Party - 6 MSPs elected in 2003, 4 at the dissolution of parliament in 2007 * Solidarity (dissolved in 2021) - 2 Scottish Socialist MSPs changed parties in 2006 when this party was formed and lost their seats in 2007 ==Minor parties in Scotland== * Alba Party - A Scottish nationalist and socially conservative party that supports Scottish independence. * British National Party (BNP) - A far-right UK-wide party which promotes fascism, anti- immigration, right-wing populism, Euroscepticism and Third position economics with many combinations. * Christian Peoples Alliance - A right-wing Christian party. * Free Scotland Party - A party in favour of an independent Scotland free from both the United Kingdom and the European Union. * Scottish Christian Party - A Christian right party that endorses traditional social conservative Christian values. * Scottish Unionist Party - A centre-right protestant party which promotes abolishing the Scottish parliament. * Socialist Labour Party - A left-wing UK-wide party that promotes socialism and Trade Unionism. * UK Independence Party (UKIP) - A right-wing to far-right UK-wide party has conservative and right wing populist policies. *",
 "title": "Political parties in Scotland"
}