{
 "id": "271167",
 "text": "Mariana Victoria of Spain (31 March 1718 – 15 January 1781) sometimes Maria Anna Victoria was an Infanta of Spain by birth and was later the Queen of Portugal as wife of King Joseph I. The eldest daughter of Philip V of Spain and Elisabeth Farnese. Under the influence of the Duke of Bourbon she was engaged to the young Louis XV of France at the age of seven. Rejected due to her age, the marriage never took place and she was sent back to Spain. In 1729 she was married to the son of John V of Portugal. Her husband became the King on 31 July 1750. The mother of Maria I of Portugal she also acted as regent of Portugal during the last months of her husbands life and acted as advisor to her daughter in her reign. ==Life in France== Under the influence of the Duke of Bourbon she was engaged to the young King Louis XV of France at the age of seven when she moved to the Palace of Versailles and was placed in the care of the Dowager Princess of Conti. Eventually due to her age she was unable to have children and was sent back to Spain in 1729. This caused a rift between the royal courts of Spain and France. ==Issue== #Maria I of Portugal (17 December 1734 – 20 March 1816) married Infante Pedro of Portugal and had issue. Later queen of Portugal. #Mariana Francisca of Portugal (7 October 1736 – 6 May 1813) died unmarried. #Doroteia of Portugal (21 September 1739 – 14 January 1771) died unmarried. #Benedita of Portugal (25 July 1746 – 18 August 1829) married Infante Joseph, Prince of Beira, no issue. ==Titles and styles== * 31 March 1718 – 19 January 1729: Her Royal Highness The Infanta Dona Mariana Victoria of Spain * 19 January 1729 – 31 July 1750: Her Royal Highness the Princess of Brazil, Duchess of Braganza * 31 July 1750 – 29 November 1776: Her Most Faithful Majesty the Queen of Portugal and the Algarves * 29 November 1776 – 24 February 1777: Her Most Faithful Majesty the Queen Regent of Portugal and the Algarves * 24 February 1777 – 15 January 1781: Her Most Faithful Majesty the Queen Mother of Portugal and the Algarves ==Other websites== * Category:1718 births Category:1781 deaths Category:Spanish House of Bourbon Category:Regents Category:People from Madrid Category:Spanish infantes and infantas Category:House of Braganza Category:Kings and Queens consort of Portugal",
 "title": "Mariana Victoria of Spain"
}