{
 "id": "271155",
 "text": "In Italy, there is a multi-party system. This means that it is unlikely for any one party to gain a majority in the Italian parliament and so coalitions between several parties must be formed. ==Major parties== Major parties are parties with representation in the Italian parliament. Brothers of Italy (Fratelli d'Italia) - A right-wing to far-right party that promotes national conservatism and right-wing populism. It's leader is Giorgia Meloni, who has been Prime Minister of Italy since 22 October 2022. Five Star Movement (Movimento 5 Stelle) - A party that promotes populism, environmentalism and direct democracy. It's leader, Giuseppe Conte, was a former Italian Prime Minister. Democratic Party (Partito Democratico) - A centre-left party that promotes social democracy. Northern League (Lega Nord) - A right-wing federalist party which wants to make the region of Italy called Padania an independent country. Forza Italia - A centre-right conservative party. Action (Azione) - A centrist and liberal party. Italy Alive (Italia Viva) - A centrist and liberal party. Green Europe (Europa Verde) - A left-wing green party. Italian Left (Sinistra Italiana) - A left-wing democratic socialist and eco-socialist party. South Tyrolean People's Party (Südtiroler Volkspartei (German language)) - A regionalist political party in South Tyrol, an autonomous province with a German-speaking majority in northern Italy. ==Minor parties== Having a minor representation in elective bodies with less than 4% of the vote in the 2008 general election: * The People of Freedom (Il Popolo della Libertà) - A centre-right party that promotes liberal conservatism, Christian democracy and liberalism * Italian Radicals (Radicali Italiani) - Liberal * Alliance for Italy (Alleanza per l'Italia) - Centrist, Christian Democracy * We the South (Noi Sud) - Centrist, Wants the South of Italy to become independent * Movement for Autonomies (Movimento per le Autonomie) - Centrist, Christian democracy, More independence for Sicily * The Populars of Italy Tomorrow (I Popolari di Italia Domani) - Christian democratic, Based in Sicily * Left Ecology Freedom (Sinistra Ecologia Libertà) - Democratic socialism, eco-socialism * Communist Refoundation Party (Partito della Rifondazione Comunista) - Communist * Party of Italian Communists (Partito dei Comunisti Italiani) - Communist * Populars for Italy (Popolari per l'Italia) - Christian democratic, Based in Sicily * The Right (La Destra) - National conservatism, social conservatism, libertarianism * Populars for the South (Popolari per il Sud) - Centrist * Italian Socialist Party (Partito Socialista Italiano) - Centre-left, social democracy * Federation of the Greens (Federazione dei Verdi) - Eco-socialism, Anti-globalisation, Pacificm * Tricolour Flame (Fiamma Tricolore) - Fascism, nationalism * Italian Republican Party (Partito Repubblicano Italiano) - Liberal * European Republicans Movement (Movimento Repubblicani Europei) - Centre-left, social liberalism * Italian Liberal Party (Partito Liberale Italiano) - Liberal * Liberal Democrats (Liberal Democratici) - Centrism, Social liberalism * White Rose (Rosa Bianca) - Centrism, Christian democracy * Alliance of the Centre (Alleanza di Centro) - Christian democratic * Workers' Communist Party (Partito Comunista dei Lavoratori) - Communism, Trotskyism * New Force (Forza Nuova) - Fascism, nationalism, Third position economics * Critical Left (Sinistra Critica) - Communism, Trotskyism * Citizens' Political Movement (Movimento Politico dei Cittadini) - Left-wing, populist * Italian Democratic Socialist Party (Partito Socialista Democratico Italiano) - Social democracy * Libertarian Movement (Movimento Libertario) - Libertarianism * Italian Union Movement (Movimento Unione Italiano) - Social liberalism * Future and Freedom (Futuro e Libertà) - A centre-right party which promotes liberal conservatism and national conservatism. * Union of Christian and Centre Democrats - A centrist party which promotes Christian democracy and social conservatism. * Italy of Values (Italia dei Valori) - A centrist party which promotes populism and anti-corruption. == Footnotes ==",
 "title": "List of political parties in Italy"
}