{
 "id": "271147",
 "text": "In the United States of America, there has id,ccc.4.0usually only been two main political parties. But there are many different factions with varying viewpoints within the two main parties. Since the 1860s, the two main parties have been the Republican Party and the Democratic Party. Currently, the Republican Party has the most seats in the House of Representatives while the Democrats have the most seats in the Senate. The Vice President, a Democrat, holds a tie breaking vote in the United States Senate. The United States currently has two major political parties: the Democrats and the Republicans. But there are other parties that aren't as represented in the United States government and are usually underfunded or misrepresented. Usually these smaller parties aren’t as well known, which makes it difficult for them to win elections. The major parties have a duopoly, meaning that they share almost all the political power in the country. Most constitutional republic countries have more than two parties. For other political parties not listed, see List of political parties in the United States. == Political parties in Congress == These two parties have members in the United States Congress, the legislative branch of the United States government. They are also called \"major parties\". ===Democratic Party=== The Democratic Party was started in 1828 as a pro- slavery party and the first President was Andrew Jackson in 1829. However, through the economic resurgence after the Great Depression in the 1930s and 1940s, as well as the Civil Rights Movement in the 1960s, the Democratic party became a proponent of racial equality. Many 20th century United States Presidents such as Woodrow Wilson, Franklin D. Roosevelt, Harry S. Truman, John F. Kennedy, Lyndon Johnson, Jimmy Carter, Bill Clinton and 21st century presidents such as Barack Obama and Joe Biden are Democrats. They have 48 out of 100 seats in the U.S. Senate (independents caucusing with the democratic party hold two seats in the U.S. senate) and 222 out of 435 seats in the House of Representatives. 24 out of 50 state governors are also Democrats. The party generally promotes liberalism and is often classed as a center-left to left- wing party. Currently, the party has 60 million registered voters across America. The party's philosophy of modern liberalism advocates social and economic equality. It seeks to provide government intervention and regulation in the economy. These interventions, such as the introduction of social programs, anti-gun laws, support for labor unions, affordable college tuitions, moves toward universal health care and equal opportunity, consumer protection and environmental protection form the core of the party's economic policy. ===Republican Party=== The Republican Party was started in 1854 as an anti-slavery party and its first President was Abraham Lincoln in 1861. Others include Ulysses S. Grant, Benjamin Harrison, Theodore Roosevelt, Dwight D. Eisenhower, Richard Nixon, Ronald Reagan, George H.W. Bush, George W. Bush and Donald Trump. In the Nixon years, there was a shift to appeal to the implicit racial biases of white voters that did not like the civil rights movement of the 1960's in what is called the southern strategy. This strategy created the appearance of equity while ignoring minorities in the process. 26 out of 50 states have a Republican governor. It has around 55 million registered voters across America. Currently, the Republican Party is identified as conservative. The party philosophy centers around social and economic independence, and a capitalist economic system. It is also known for its anti-abortion efforts, pro-gun laws, anti-regulatory policy, and reduction of government intervention in the economy as well as being in support of privatized health care. The party believes in lower taxes, less social programs, and personal liberty. File:Democratic_Disc.svg|alt=| File:Republican_Disc.svg|alt=| == Political parties in state legislatures == These four parties have members in one of any state legislature. These are called \"minor parties\" or \"third parties\". *Libertarian Party **The Libertarian Party supports policies such as marijuana legalization, economic deregulation, and no taxes. ***In the last presidential election, Jo Jorgensen won almost 2 million votes. She didn't win any states or electors. She is a Libertarian. ***Only one Libertarian has ever been in Congress: Justin Amash. He was a Republican before he switched parties in 2019. He left Congress in 2021. Ron Paul is a member of the Libertarian Party and has been in Congress too. But, he was never registered to vote as a Libertarian. ***Only one Libertarian is in a state legislature right now: Jarrod Sammis. He was a Republican before he switched parties in 2023. ***741,930 Americans are registered to vote as Libertarians. ****Other notable libertarians include Marshall Burt, Gary Johnson, John McAfee, Dick Randolph, Bill Weld, and Lily Wu. *Independent Party of Oregon **Independent Party of Oregon is a centrist party. It only exists in Oregon. It supports policies such as electoral reform. ***In the last presidential election, the party nominated Joe Biden. He is a Democrat. ***It has one state legislator: Brian Boquist. He left the Republican Party in 2021. ***141,720 Americans are registered to vote with the IPO. *Forward Party **The Forward Party is a centrist party. It supports electoral reform. ***It has two state legislators: Lisa Boscola and Anthony Williams. These two are still registered Democrats, but still choose to consider themselves as members of the Forward Party. ***Only 421 Americans are registered to vote with Forward. ****Other notable members include David Jolly, Joe Sestak, and Andrew Yang. *Vermont Progressive Party **The Vermont Progressive Party is a progressive party. It only exists in Vermont. It supports raising the minimum wage, guaranteeing LGBT rights, and making socialized healthcare. ***The lieutenant governor of Vermont is David Zuckerman. He is a Progressive. ***It has four state legislators: Brian Cina, Troy Headrick, Kate Logan, and Taylor Small. ***Vermont does not track political party registration. It is unknown how many members the party has. ****Other notable members include Peter Diamondstone and Emma Mulvaney-Stanak. File:Libertarian_Disc.svg|alt=| File:Independent_Party_of_Oregon_unofficial_symbol.png|alt=| File:Forward_Party_star.png|alt=| File:Vermont Progressive Party Shield.svg|alt=| == Small parties in multiple states == These are some other small parties. All of these parties are on the ballot in 2 states or more. *American Independent Party **The American Independent Party is a paleoconservative party. ***In the last presidential election, it did not run a candidate. It supported Rocky De La Fuente for president. He was with Alliance. ***892,016 Americans are registered to vote with the AIP. ****Other notable members include Alan Keyes, Lester Maddox, John G. Schmitz, and George Wallace. *Green Party **The Green Party is a progressive party. It supports causes such as clean energy, drug legalization, reparations to Black Americans, and it supports LGBT rights. They are against nuclear energy. It also wants the United States to stop helping Israel. ***In the last presidential election, Howie Hawkins won over 400 thousand votes. He didn't win any states or electors. He is a Green. ***253,544 Americans are registered to vote as Greens. ****Other notable Greens include Jello Biafra, Richard Carroll, Mike Feinstein, Cynthia McKinney, Ralph Nader, and Jill Stein. *Constitution Party **The Constitution Party is a paleoconservative party. It supports Christian nationalism. It dislikes immigration, abortion and LGBT rights and denies climate change. ***In the last presidential election, Don Blankenship won over 60 thousand votes. He didn't win any states or electors. He is a member of the Constitution Party. ***139,523 Americans are registered to vote with the Constitution Party. ****Other notable members include Chuck Baldwin, Virgil Goode, Lora Hubbel, Howard Phillips, Tom Tancredo, and Randall Terry. *No Labels **No Labels is a centrist organization. It wanted to run a candidate for president in 2024. After its chairman Joe Lieberman died, the organization stopped its presidential effort. ***67,280 Americans are registered to vote with No Labels. *Working Families Party **The Working Families Party is a progressive party. It supports healthcare reform, raising the minimum wage, universal paid sick days, and progressive taxation. ***In the last presidential election, it did not run a candidate. It supported Joe Biden for president. He is a Democrat. ***61,335 Americans are registered to vote with Working Families. *Liberal Party **The Liberal Party is a classical liberal party. It was created after a fight inside the Libertarian Party. ***32,241 Americans are registered to vote as Liberals. *Natural Law Party **The Natural Law Party is a environmentalist party. It believes that problems can be fixed by using Transcendental Meditation. ***In the last presidential election, it did not run a candidate. It supported Rocky De La Fuente for president. He was with Alliance. ***5,731 Americans are registered to vote with Natural Law. ****Other notable members include John Hagelin and Mike Love. *Party for Socialism and Liberation **The PSL is a communist party. Its main goal is the removal of capitalism. ***In the last presidential election, Gloria La Riva won over 85 thousand votes. She didn't win any states or electors. She is a member of the PSL. ***1,626 Americans are registered to vote with the PSL. ****Other notable members include Claudia de la Cruz, Kristin Richardson Jordan, and Jon Siebels. *Alliance Party **The Alliance Party is a centrist party. It was created when many small parties decided to work together. Some of these parties are the Independence Party of Minnesota and the Independent Party of Connecticut. ***In the last presidential election, Rocky De La Fuente won over 88 thousand votes. He didn't win any states or electors. He is a member of the Alliance Party. ***551 Americans are registered to vote with Alliance. *American Solidarity Party **The American Solidarity Party is a Christian democratic party. It supports socialized medicine and immigration. It opposes capital punishment and abortion. ***In the last presidential election, Brian Carroll won over 42 thousand votes. He didn't win any states or electors. He is a member of the ASP. ***467 Americans are registered to vote with American Solidarity. ****Other notable members include Peter Sonski. *Working Class Party **The Working Class Party is a socialist party. ***Neither Michigan nor Maryland record party registration. It is unknown how many members this party has. File:American_Independent_Party_Logo.png|alt=| File:Green_Disc.svg|alt=| File:No_Labels_logo.svg|alt=| File:Working_Families_Party_Symbol.svg|alt=| File:Natural_Law_Election_Disc.svg|alt=| File:Party_for_Socialism_and_Liberation_Logo.svg|alt=| File:Alliance_Party_Symbol.png|alt=| File:blank 4x3.svg|alt=| File:blank 4x3.svg|alt=| == Independents == There are over 420 registered political parties in the United States of America, with many different blends of political viewpoints. However, there are only two nationally recognized political parties, the Republicans and Democrats. Most of the other parties fall under those two political parties with variations, or under other ideological umbrellas, like Progressive, Libertarian, Conservative, Socialist, Communist, etc. It is less common to achieve political influence in modern government functions, but some lawmakers such as Joe Lieberman may retire their parties with their careers. Famous examples include: * 1st President: George Washington * Presidential Candidate: Evan McMullin (2016) * Presidential Candidate: Ross Perot (1992) * Senator and Presidential Candidate: Bernie Sanders (Caucuses with Democratic Party) == Related pages == *List of presidents of the United States ==References== ==Sources== *https://news.gallup.com/poll/15370/party-affiliation.aspx Independent politicians",
 "title": "Political parties in the United States"
}