{
 "id": "271339",
 "text": "is a tower in Osaka, Japan. It is a well-known landmark and shows advertisements for Hitachi, Ltd. The tower is 103 meters tall. The main observation deck is 91 meters above the ground. The three characters in the name mean \"Reaching Heaven Tower\". It is in Shinsekai, part of Naniwa Ward. Tsūtenkaku Kanko Co., Ltd. owns the tower. == History == The current tower is the second tower on the site. The original tower was built in 1912. The design was based on the Eiffel Tower. The tower had an cable car that connected it to a nearby amusement park called Luna Park. The original was 64 meters tall. It was the second tallest building in Asia at that time. It quickly became one of the most popular locations in the city. Visitors came from all over. There was a fire in 1943 which severely damaged the tower. It was not repaired. The tower was taken apart and the steel was used to make things for World War II. After the war, citizens wanted to rebuild the popular tower. A private company called Tsūtenkaku Kanko Co. Ltd. was set up for this purpose. They hired Tachu Naito to design it. He was nicknamed Japan's \"Father of Towers\". The new tower opened in 1956. ==Signs== In 1957, Hitachi started putting neon sign advertisements on the tower. The advertisements have usually been changed every 5 or 6 years. Hitachi last changed the signs in 2006. New signs are scheduled for autumn 2011. The new signs will use LED lights, not neon. Other lights on the tower also show weather information. ==Access== * JR West, Osaka Loop Line and Yamatoji Line, Shin-Imamiya Station, East Exit (10 minute walk) * Nankai Railway, Nankai Main Line and Koya Line, Shin-Imamiya Station, East Exit (10 minute walk) * Osaka Municipal Subway Sakaisuji Line (brown line), Ebisuchō Station, Exit 3 (3 minute walk) * Osaka Municipal Subway Midosuji Line (red line), Dobutsuen-mae Station, Exit 5 (10 minute walk) * Hankai Tramway, Hankai Line, Ebisucho Station (3 minute walk) ==Photos of the tower today== File:Osakatowerday.jpg File:Tsutenkaku tower.jpg File:Shinsekai_downtown_MShades.jpg File:通天閣03.jpg File:Tsutenkaku in 2006.jpg File:Tsutenkaku-Night.jpg File:Osakatowernight.jpg File:Tsutenkaku2.jpg ==Photos of the original tower== File:Original_Tsutenkaku_dedication_celemony.jpg|Dedication Ceremony, 1912 File:Original_Tsutenkaku_and_Shinsekai_aerial_tramway_2.jpg|Ropeway connecting Tsutenkaku and Luna Park, 1912 File:Original_Tsutenkaku_and_Shinsekai_Luna_Park.jpg|Luna Park at sunset, 1912 File:Original_Tsutenkaku_at_night.jpg|Luna Park Night View, 1912 File:Original_Tsutenkaku_and_Shinsekai.jpg|View from Shinsekai, 1920 File:Original_Tsutenkaku_2.jpg|View from Shinsekai, 1920 File:Original_Tsutenkaku_and_Shinsekai_main_entrance.jpg|View from Shinsekai, Ebisu Gate, 1920 File:Original_Tsutenkaku_and_Shinsekai_2.jpg|View from Shinsekai, 1920-1943 File:Original_Tsutenkaku_and_Ichigo-kan.jpg|View from Luna Park Ichi-go-kan, 1920-1943 File:The_Original_Tsutenkaku_from_Jan- Jan_Alley.jpg|View from Jan Jan Yokocho, 1920-1943 File:Original_Tsutenkaku_after_1943_fire.jpg|After the fire in the movie theater, 1943 File:Original_Tsutenkaku_during_demolition.jpg|During demolition, 1943 ==Related pages== *Tokyo Tower ==References== Category:Towers in Japan Category:Osaka Category:Buildings and structures completed in the 20th century",
 "title": "Tsūtenkaku"
}