{
 "id": "271312",
 "text": "Jean-Marie Le Pen (20 June 1928 - 7 January 2025) was a French politician, lawyer and activist. He was the leader of the French National Front (FN) from 1972 until 2011, which is a far-right political party in France. He was a Member of the European Parliament from 1984 to 2003 and again from 2004 to 2019. Le Pen was also a member of the National Assembly from 1956 to 1962 and again from 1986 to 1988. Le Pen ran for President of France five times, but never won. His daughter, Marine Le Pen, was leader of the National Front and also unsuccessfully ran for President of France. Le Pen supported immigration restrictions, the death penalty, raising incentives for homemakers, and was against the EU. He was strongly against same-sex marriage, euthanasia and abortion. ==Early life== Le Pen was born in La Trinité-sur-Mer, Brittany, France. He studied at the Paris-Panthéon-Assas University in Paris. Le Pen served in the French Army from 1953 to 1957. ==Political career== Jean-Marie Le Pen founded the FN in 1972. He became a Member of the European Parliament (MEP) in 1984 and ran for President of France five times; in 1974, 1988, 1995, 2002 and 2007. He came second in the 2002 election. Le Pen had xenophobic and antisemitic views and was accused of having practised torture when he fought in the Algerian War (1954-1962). He was suspended from the FN on 4 May 2015 by his daughter Marine, after saying good things about the gas chambers used in the Holocaust by Nazi Germany. In April 2024, Jean Marie Le Pen was placed “under legal protection” at the request of his family. ==Personal life and death== The youngest of his three daughters was FN leader Marine Le Pen. His granddaughter was FN MP Marion Maréchal-Le Pen. Le Pen died on 7 January 2025 at a care home in Garches, France from problems caused by a heart attack at the age of 96. ==References== ==Other websites== *Jews for Le Pen from Haaretz Category:1928 births Category:2025 deaths Category:French military people Category:MEPs for France Category:National Front (France) politicians Category:People from Morbihan Category:Leaders of political parties Category:Conspiracy theorists Category:Fascists Category:French Roman Catholics Category:Politicians from Brittany Category:French lawyers Category:Holocaust deniers Category:People convicted of assault Category:People from Saint-Cloud Category:White supremacists Category:Deaths from myocardial infarction Category:French activists",
 "title": "Jean-Marie Le Pen"
}