{
 "id": "271337",
 "text": "The Quebec Maritimes Junior Hockey League (French: la Ligue de hockey junior Maritimes Québec, shortened as QMJHL in English, LHJMQ in French) is one of the three major junior ice hockey leagues which make up the Canadian Hockey League. Because the name of the league is so long, it is sometimes called the \"Q\". It was known as the Quebec Major Junior Hockey League until 2023. There are 18 teams in the QMJHL that are in Quebec, New Brunswick, Nova Scotia, and Prince Edward Island in Canada. One of the New Brunswick teams will move to Newfoundland and Labrador after the 2024–25 season. The winner of the QMJHL plays against the winners of the Western Hockey League and Ontario Hockey League for the Memorial Cup. Many good players go from the QMJHL to the National Hockey League, and nine players from the QMJHL are in the Hockey Hall of Fame. ==History== The QMJHL was created in 1969 from two different junior leagues in Quebec, the Quebec Junior Hockey League and the Metropolitan Montreal Junior Hockey League. These two teams wanted to make a better junior league for the province, so combined teams from their leagues. Eight teams were from the QJHL and two from the MMJHL and another team came from a town in Ontario on the Ontario-Quebec border. Nearly every team was within a close distance of Montreal, the largest city in Quebec, though no team played in Montreal. In 1972 the QMJHL finally wanted a team in Montreal, and tried to get the Montreal Junior Canadiens, who played in the Ontario Hockey Association, to join. The OHA made a deal with the QMJHL and gave them the Junior Canadiens while creating a new team in a different city to keep an OHA team with the same name. In December 2023, the league changed its logo and the name of the league to the Quebec Maritimes Junior Hockey League. This was done to recognize the Maritimes teams that are also in the league. ==Member teams== Division Team City Arena West Blainville-Boisbriand Armada Boisbriand, Quebec Centre d'Excellence Sports Rousseau Drummondville Voltigeurs Drummondville, Quebec Centre Marcel Dionne Gatineau Olympiques Gatineau, Quebec Centre Robert Guertin Rouyn-Noranda Huskies Rouyn-Noranda, Quebec Aréna Iamgold Sherbrooke Phoenix Sherbrooke, Quebec Palais des Sports Val-d'Or Foreurs Val-d'Or, Quebec Centre Air Creebec East Baie-Comeau Drakkar Baie-Comeau, Quebec Centre Henry- Leonard Chicoutimi Saguenéens Saguenay, Quebec Centre Georges-Vézina Quebec Remparts Quebec City, Quebec Centre Vidéotron Rimouski Océanic Rimouski, Quebec Colisée de Rimouski Shawinigan Cataractes Shawinigan, Quebec Centre Gervais Auto Victoriaville Tigres Victoriaville, Quebec Colisée Desjardins Maritimes Acadie–Bathurst Titan Bathurst, New Brunswick K.C. Irving Regional Centre Cape Breton Eagles Sydney, Nova Scotia Centre 200 Charlottetown Islanders Charlottetown, Prince Edward Island Eastlink Centre Halifax Mooseheads Halifax, Nova Scotia Scotiabank Centre Moncton Wildcats Moncton, New Brunswick Avenir Centre Saint John Sea Dogs Saint John, New Brunswick TD Station ==References== ==Other websites== *Quebec Major Junior Hockey League Official website *Canadian Hockey League Official website *Internet Hockey Database Archive of standings and statistics Category:Canadian Hockey League Category:Sport in Quebec Category:1969 establishments in Canada",
 "title": "Quebec Maritimes Junior Hockey League"
}