{
 "id": "271681",
 "text": "The Malays (Malay-; ; Rejang: ꤷꥁꤼ; Jawi: ) are an Austronesian ethnic group in Southeast Asia. They mainly live in the Maritime Southeast Asia region (especially within the Malay Archipelago; consist of Indonesian Archipelago and Philippines archipelago), such as Sumatra, Riau Islands, Singapore, Kalimantan (including Brunei), southern Thailand, and southern Philippines. == Overview == Malay people were once a tribal group who inhabited the island of Sumatra. According to the Malay Annals, the origin of Malay people are from the area known as Palembang in modern-day South Sumatra. Sang Sapurba also mentioned in the Malay Annals as the King of Malays who originated from the hill of Siguntang Mahameru area as well. Malay people transformed from the tribal group into an ethnic group during the glorious era of Srivijaya—the empire that originated from Palembang— when the trading activities grew. Nowadays, Malay people are inhabiting areas that was under the Srivijayan empire rule, with the big population mainly in Sumatra and its surrounding regions such as Bangka Belitung Islands, Riau Islands, Malacca Peninsula ( Kra Peninsula), Kalimantan (including Brunei), southern Thailand, southern Vietnam, and southern Philippines. ==Language== Most ethnic Malays speak one or more of the many dialects (versions) of the Malay language, a language of the Austronesian family of languages. In Indonesia, the standardized form of Malay is Indonesian (),These naming policies were created to form national unities in the countries instead of making the Malays a ruling influence or the ruling class. In Malaysia, the standard form is called bahasa melayu (. About 80% of their words mean the same thing in either dialect. same like in Brunei. In Brunei, Thailand and Singapore it is also known as Bahasa Melayu. Today, the language is usually written a version of the Roman alphabet, called Rumi. Malay written using the Arabic alphabet is called Jawi, which is mostly used in official and religious contexts. Jawi is more common than Rumi in very conservative Muslim areas like Kelantan in Malaysia and Pattani in Thailand. ==Religion== The vast majority of ethnic Malays today are Sunni Muslims and Islam has become a large part of the Malay identity. ==References== Category:Ethnic groups in Africa Category:Ethnic groups in Asia",
 "title": "Malays"
}