{
 "id": "271694",
 "text": "Polyxena of Hesse-Rotenburg (Polyxena Christina Johanna; 21 September 1706 – 13 January 1735) was the second wife of Charles Emmanuel, Prince of Piedmont, future King Charles Emmanuel III of Sardinia. ==Biography== Polyxena was born at Langenschwalbach in Hesse and was baptised with the names Polyxena Christina Johanna . King Victor Amadeus II of Sardinia approached her family and proposed a union between Polyxena and Victor Amadeus II's son and heir Charles Emmanuel, Prince of Piedmont. A previous match organised by \"Agostino Steffani\" with a daughter of Duke Rinaldo d'Este of Modena had come to nothing. His first wife, Anne Christine of Sulzbach died March 1723 having given birth to a son. The engagement was announced on 2 July 1724. The marriage was celebrated in person at Thonon in Chablais on 20 August 1724. The happy marriage produced six children. Praised as an attractive, cultured and kind woman, Polyxena founded a home for penniless mothers in Turin in 1732, redecorated the Villa della Regina, the hunting lodge of Stupingi, and the Church of Saint Giuseppe in Turin. She popularised chinoiserie. She was also a patron of Giovanni Battista Crosato, a baroque painter. Having been ill since June 1734, she died at the Royal Palace of Turin. Originally buried at the Cathedral of Saint Giovanni Battista, she was moved to the Royal Basilica of Superga in 1786 by her son Victor Amadeus III. Two years after her death, her husband married Elisabeth Therese of Lorraine, sister of the future Francis I, Holy Roman Emperor. ==Issue== # Victor Amadeus III of Sardinia (26 June 1726 – 16 October 1796) married Maria Antonia of Spain and had issue. # Princess Eleonora of Savoy (28 February 1728 – 14 August 1781) unmarried. # Princess Maria Luisa of Savoy (25 March 1729 – 22 June 1767) unmarried. # Princess Maria Felicita of Savoy (19 March 1730 – 13 May 1801) unmarried. # Prince Emanuele Filiberto of Savoy (17 May 1731 – 23 April 1735) Duke of Aosta. # Prince Carlo of Savoy (23 July 1733 – 28 December 1733) Duke of Chablais. ==Titles and styles== *21 September 1706 – 23 July 1724 Her Serene Highness Princess Polyxena of Hesse-Rotenburg. *23 July 1724 – 3 September 1730 Her Royal Highness the Princess of Piedmont. *3 September 1730 – 13 January 1735 Her Majesty the Queen. ==Other websites== Category:1706 births Category:1735 deaths Category:Kings and Queens of Sardinia Category:Princes and Princesses of Savoy Category:Princes and Princesses of Piedmont",
 "title": "Polyxena of Hesse-Rotenburg"
}