{
 "id": "271668",
 "text": "Italic script and type has a long history. It was based on handwriting. Ludovico Vicentino degli Arrighi (1475–1527) was a papal scribe and type designer in Renaissance Italy. Present day cursive writing style known as \"italic\" is based upon the style he developed. It has been said that the style of cursive known as \"italic\" got its name from this Italian designer. Modern day scribes, also known as \"calligraphers\", study the work of Arrighi to learn the structure of the style of writing known as \"italic\" , a modernized version of the Chancery hand which was first perfected by Roman scribes in the early part of the sixteenth century. In typography, italic type is a cursive font based on a kind of calligraphic handwriting. Such letters normally slant slightly to the right. In modern texts, Italics can emphasise key points in a printed text. One manual of English usage described italics as \"the print equivalent of underlining\". Calligraphy-inspired typefaces were first designed in Italy, to replace documents written in a handwriting style called chancery hand. Updike D.B. 1927. Printing types: their history, form and use: volume 1, chapter 10. The Aldine italic, p124. Harvard University Press. As the illustration shows, there were flourishes copied from calligraphy. An alternative is oblique type: the type is slanted but the letterforms do not change shape: this less elaborate approach is used by many sans-serif typefaces. == Usage on the web == Using italic is usually used as a place holder for a blank piece of information.Wikipedia:Requests for permissions - A blank section would have \"None at the moment\" as a place holder for no recent requests There are different ways in making a text italic. === HTML === In HTML, the editor can add the `_`and the`_` tags to make text surrounded by these tags italic. === Wikitext === In Wikitext, the editor can just add two apostrophes (``) around the text to become italic.MediaWiki's help on making italic text == Related pages == * Bold * Underlined == References == Category:Typography Category:Writing",
 "title": "Italic"
}