{
 "id": "272006",
 "text": "Traditional animation is much harder than today's style of animation.How Hard Is It? Anime and Animation. It often uses a stop-motion camera to \"liven\", or animate, the photos made by the producer.Producing with Stop-motion. Animation Studio, 2010. When movie-makers use stop-motion, they need to draw one picture for every scene. However, there are tools to help save time with movie-making. Other types of animation, such as limited or digital animation, can also be used now. FPS is the number of times a movie is shot in one second. ==Process== ===Filming=== The photographer first shoots out or edits many photos. These photos are combined to make the storyline.From A to Z: Producing cartoons and movies in Stop-motion. 2009. And as with all movies, not all scenes make it into the final movie.Winding Up on the \"Cutting Floor\": Scenes that don't make it. CG Crucher, 2004. ===Editing=== Many peopleThe Crew of a Movie Maker. 2008, Anime and Animation Press. help out in the editing of a movie. But in old times, people had to draw the scenes on their own.How Movies Were Made. Retrieved 10-04-09. Then the stop-motion camera took a photo of a scene once a second.Stop-motion filming: Animation Studio, 2008. Accessed 07-07-07.Movie Crew in toil of Stop-motion filming. Accessed 4-18-10. ==Involvement== Most movies or cartoons in the 1950's required very hard work of the editors.Toil in the 50's. Anime and Animation, 2007. To make things cheaper, though, people made limited animationPeoples' idea comes to LA. 2008, CG Press. that used two to three copies of the same imageCopying Stop-motion: CG Press. Accessed May 2008. (so the stop-motion process would be two to three times faster.Stop-motion speeding-up? Anime Studio, 2009.) ==Current== Right now movie-makers use digital animationAnimation in the present: CG Press and Animation Studio. Accessed April 5, 2003. to \"liven the movie even more\".Documents from current directors. Anime and Animation, May 2005. Movies from the 2000 to 2010 years are usually 1–2 hours long.Toil coming to a Movie: A to Z Movie-Making Appearance. CG Press and Anime and Animation, June 2006. ==Common units== ===FPS=== FPS, or frames per second, is the number of scenes being shot in one second.FPS Facts, CG Press. Retrieved July 20, 2008. The higher this is, the more \"smooth\"Does FPS Affect Movies? 10-12-10. the film looks.Toil Turning Into Smooth Film.Frames per second: \"Makes your film go faster.\" CG Times, June 2009. Most movies have an FPS of 24 to 60.FPS Press: \"The FPS --- is between 24-60.\" ==Tools== ===Cels=== Cels, or celluloids, are tools used to \"preserve\" scenes.What are Celluloids? CG Press, 2007. An editor uses a cell to draw a scene then make changes to it on the next drawing.Cel Usage. It is useful when a cartoon or movie involves moving figures or objects. ===Sketcher=== Sometimes a sketch pad is used to draft the scenes the editors think would be good in the movie. A sketchpad at first may contain a comic book that looks like an animation when the editors flip it back and forth.Sketch: \"Draft for an Animation.\" CG Cruchter, 2005. ===Live video shower=== Often editors preview the animation with a video shower. On the stream of scenes, movie-makers test their animation and fix bugs or problems.Live video showing: \"A test for broadcast.\" CG Press, 2006. ==== Impact ==== The spread and development of multiplane animation helped animators tackle problems with motion tracking and scene depth, and reduced production times and costs for animated works. In a 1957 recording, Walt Disney explained why motion tracking was an issue for animators, as well as what multiplane animation could do to solve it. Using a two-dimensional still of an animated farmhouse at night, Disney demonstrated that zooming in on the scene, using traditional animation techniques of the time, increased the size of the moon. In real-life experience, the moon would not increase in size as a viewer approached a farmhouse. Multiplane animation solved this problem by separating the moon, farmhouse, and farmland into separate planes, with the moon being farthest away from the camera. To create the zoom effect, the first two planes were moved closer to the camera during filming, while the plane with the moon remained at its original distance. This provided a depth and fullness to the scene that was closer in resemblance to real life, which was a prominent goal for many animation studios at the time. === Xerography === Applied to animation by Ub Iwerks at the Walt Disney studio during the late 1950s, the electrostatic copying technique called xerography allowed the drawings to be copied directly onto the cels, eliminating much of the \"inking\" portion of the ink-and-paint process. This saved time and money, and it also made it possible to put in more details and to control the size of the xeroxed objects and characters. At first, it resulted in a more sketchy look, but the technique was improved upon over time. Disney animator and engineer Bill Justice had patented a forerunner of the Xerox process in 1944, where drawings made with a special pencil would be transferred to a cel by pressure, and then fixing it. It is not known if the process was ever used in animation. The xerographic method was first tested by Disney in a few scenes of Sleeping Beauty and was first fully used in the short film Goliath II, while the first feature entirely using this process was One Hundred and One Dalmatians (1961). The graphic style of this film was strongly influenced by the process. Some hand inking was still used together with xerography in this and subsequent films when distinct colored lines were needed. Later, colored toners became available, and several distinct line colors could be used, even simultaneously. For instance, in The Rescuers the characters' outlines are gray. White and blue toners were used for special effects, such as snow and water. === The APT process === Invented by Dave Spencer for the 1985 Disney film The Black Cauldron, the APT (Animation Photo Transfer) process was a technique for transferring the animators' art onto cels. Basically, the process was a modification of a repro-photographic process; the artists' work was photographed on high-contrast \"litho\" film, and the image on the resulting negative was then transferred to a cel covered with a layer of light-sensitive dye. The cel was exposed through the negative. Chemicals were then used to remove the unexposed portion. Small and delicate details were still inked by hand if needed. Spencer received an Academy Award for Technical Achievement for developing this process. === Rotoscoping === Rotoscoping is a method of traditional animation invented by Max Fleischer in 1915, in which animation is \"traced\" over actual film footage of actors and scenery. Traditionally, the live-action will be printed out frame by frame and registered. Another piece of paper is then placed over the live-action printouts and the action is traced frame by frame using a lightbox. The end result still looks hand-drawn but the motion will be remarkably lifelike. The films Waking Life and American Pop are full-length rotoscoped films. Rotoscoped animation also appears in the music videos for A-ha's song \"Take On Me\" and Kanye West's \"Heartless\". In most cases, rotoscoping is mainly used to aid the animation of realistically rendered human beings, as in Snow White and the Seven Dwarfs, Peter Pan, and Sleeping Beauty. A method related to conventional rotoscoping was later invented for the animation of solid inanimate objects, such as cars, boats, or doors. A small live-action model of the required object was built and painted white, while the edges of the model were painted with thin black lines. The object was then filmed as required for the animated scene by moving the model, the camera, or a combination of both, in real-time or using stop-motion animation. The film frames were then printed on paper, showing a model made up of the painted black lines. After the artists had added details to the object not present in the live-action photography of the model, it was xeroxed onto cels. A notable example is Cruella de Vil's car in Disney's One Hundred and One Dalmatians. The process of transferring 3D objects to cels was greatly improved in the 1980s when computer graphics advanced enough to allow the creation of 3D computer-generated objects that could be manipulated in any way the animators wanted, and then printed as outlines on paper before being copied onto cels using Xerography or the APT process. This technique was used in Disney films such as Oliver and Company (1988) and The Little Mermaid (1989). This process has more or less been superseded by the use of cel- shading. Related to rotoscoping are the methods of vectorizing live-action footage, in order to achieve a very graphical look, like in Richard Linklater's film A Scanner Darkly. === Live-action hybrids === Similar to the computer animation and traditional animation hybrids described above, occasionally a production will combine both live-action and animated footage. The live-action parts of these productions are usually filmed first, the actors pretending that they are interacting with the animated characters, props, or scenery; animation will then be added into the footage later to make it appear as if it has always been there. Like rotoscoping, this method is rarely used, but when it is, it can be done to terrific effect, immersing the audience in a fantasy world where humans and cartoons co-exist. Early examples include the silent Out of the Inkwell (begun in 1919) cartoons by Max Fleischer and Walt Disney's Alice Comedies (begun in 1923). Live-action and animation were later combined in features such as Song of the South (1946), The Incredible Mr. Limpet, Mary Poppins (both in 1964), Who Framed Roger Rabbit (1988), Cool World (1992), Space Jam (1996), Looney Tunes: Back in Action (2003), The SpongeBob SquarePants Movie (2004), and Enchanted (2007), among many others. The technique has also seen significant use in television commercials, especially for breakfast cereals marketed to children to interest them and boost sales. === Special effects animation === Besides traditionally animated characters, objects, and backgrounds, many other techniques are used to create special elements such as smoke, lightning and \"magic\", and to give the animation, in general, a distinct visual appearance. Today special effects are mostly done with computers, but earlier they had to be done by hand. To produce these effects, the animators used different techniques, such as drybrush, airbrush, charcoal, grease pencil, backlit animation, diffusing screens, filters, or gels. For instance, the Nutcracker Suite segment in Fantasia has a fairy sequence where stippled cels are used, creating a soft pastel look. == Modern techniques == The methods mentioned above describe the techniques of an animation process that originally depended on cels in its final stages, but painted cels are rare today as the computer moves into the animation studio, and the outline drawings are usually scanned into the computer and filled with digital paint instead of being transferred to cels and then colored by hand. The drawings are composited in a computer program on many transparent \"layers\" much the same way as they are with cels, and made into a sequence of images which may then be transferred onto film or converted to a digital video format. It is now also possible for animators to draw directly into a computer using a graphics tablet such as a Cintiq or a similar device, where the outline drawings are done in a similar manner as they would be on paper. The Goofy short How To Hook Up Your Home Theater (2007) represented Disney's first project based on the paperless technology available today. Some of the advantages are the possibility and potential of controlling the size of the drawings while working on them, drawing directly on a multiplane background and eliminating the need for photographing line tests and scanning. Though traditional animation is now commonly done with computers, it is distinct from 3D computer animation, such as Toy Story, Shrek, Jimmy Neutron: Boy Genius, and Ice Age. Traditional animation and 3D computer animation can be used together, as in Don Bluth's Titan A.E. and Disney's Hercules, Tarzan, Atlantis: The Lost Empire, and Treasure Planet. Some recent anime and western animated series, such as Ghost in the Shell, Neon Genesis Evangelion, and Cowboy Bebop, have applied both animation techniques. DreamWorks executive Jeffrey Katzenberg coined the term \"tradigital animation\" to describe animated films produced by his studio which incorporated elements of traditional and computer animation equally, such as The Road to El Dorado, Spirit: Stallion of the Cimarron, and Sinbad: Legend of the Seven Seas. Many video games such as Viewtiful Joe, The Legend of Zelda: The Wind Waker, Ico, Ōkami, Mirror's Edge, and others use \"cel-shading\" animation filters or lighting systems to make their full 3D animation appear as though it were drawn in a traditional cel-style. This technique was also used in the animated movie Appleseed, and cel-shaded 3D animation is typically integrated with cel animation in Disney films and in many television shows, such as Fox's Futurama, Family Guy, and American Dad! and both Nickelodeon animated series Invader Zim and The Fairly OddParents. In one scene of the 2007 Pixar movie Ratatouille, an illustration of Gusteau (in his cookbook), speaks to Remy (who, in that scene, was lost in the sewers of Paris) as a figment of Remy's imagination; this scene is also considered an example of cel-shading in an animated feature. More recently, animated shorts such as Paperman, Feast, and The Dam Keeper have used a more distinctive style of cel- shaded 3D animation, capturing a look and feel similar to a 'moving painting'. ==Related pages== * Animation * Anime ==References== Category:Animation Category:Traditional animation Category:Animation technique",
 "title": "Traditional animation"
}