{
 "id": "272371",
 "text": "TESOL (Teachers of English to Speakers of Other Languages, Inc.) is a global education association for English language teachers who teach speakers of others languages. == Interest Sections == TESOL has some special interest groups called \"Interest Sections\". They promote research and continuing education in areas that are important to TESOL members. Current Interest Sections include the following: * Adult Education * Applied Linguistics * Bilingual Education * Computer-Assisted Language Learning * Elementary Education * English as a Foreign Language * English for Specific Purposes * Higher Education * Intercultural communication * Intensive English Programs * International Teaching Assistants * Materials Writers * Non-native English- Speaking Teachers * Program Administration * Refugee Concerns * Second Language Writing * Secondary Schools * Speech, Pronunciation, and Listening * Teacher Education * Video and Digital Media == History == TESOL was founded in 1966 and has corporate headquarters in Alexandria, Virginia. TESOL has more than 13,000 members in more than 120 different countries. TESOL is an NGO under the United Nations. == Affiliates == TESOL has relationships with 98 independent organizations worldwide: 41 in the United States and 57 in Asia, the Pacific, Europe, Latin America, the Middle East, and Africa. == Annual conference == TESOL convenes an annual conference with papers, symposia, key note speakers, workshops, and annual meetings for the Interest Sections. Presenters speak on topics ranging from practical advice for the classroom to new theories for explaining language learning. The event also has a large book fair where most major publishers have displays. Usually around 10,000 people attend the conference. It was first held in 1966. == Awards == Each year, TESOL gives four awards, each to one of its members. *The James E. Alatis Award for Service to TESOL is for outstanding and extended service by TESOL members at international, regional, and local levels. *The TESOL Virginia French Allen Award for Scholarship and Service *The D. Scott Enright TESOL Interest Section Service Award is for outstanding and extended service to and leadership in TESOL interest sections. *The TESOL Award for Excellence in Teaching is for educators who are considered excellent by other teachers. == References == == Other websites == *TESOL Home Page *TESOL France Home Page *TESOL Greece Home Page *Dates and locations of past TESOL Conferences * TESOL Asia http://www.tesol.asia *TESOL India Home Page *TESOL Costa Rica Home Page Category:Language education Category:1966 establishments Category:Educational organizations",
 "title": "TESOL International Association"
}