{
 "id": "272367",
 "text": "Oscar Jerome Hijuelos (August 24, 1951 - October 12, 2013) was an American novelist. He is the first Hispanic to win a Pulitzer Prize for Fiction.Candelaria, Cordelia; Garcia, Peter J.; Aldama, Arturo J., Encyclopedia of Latino popular culture, Greenwood Publishing Group, 2004. Cf. pp.343-345 ==Early life and education== Hijuelos was born in New York City, in Morningside Heights, Manhattan. His parents were Cuban immigrants. He studied at the Corpus Christi School in Morningside Heights.Carlson, Lori M.; and Hijuelos, Oscar, Red Hot Salsa: Bilingual Poems on Being Young and Latino in the United States, Macmillan, 2005. . Cf. Introduction, p.xvi. \"Once, while in the fourth grade at Corpus Christi School, I received a Valentine's card that said 'I think you're cute'. ...\" Later, he attended Bronx Community College, Lehman College, and Manhattan Community College. He studied writing at the City College of New York and earned two degrees in Creative Writing there: his B.A. in1975 and M.A. in 1976. He had several jobs before becoming a full-time writer. ==Writing career== His first novel, Our House in the Last World, was published in 1983 and received the 1985 Rome Prize, awarded by the American Academy in Rome. His second novel, The Mambo Kings Play Songs of Love, received the 1990 Pulitzer Prize for Fiction. It was adapted for the film The Mambo Kings in 1992 and as a Broadway musical in 2005. ==Teaching career== Hijuelos has taught at Hofstra University. He is a faculty member in the Department of English at Duke University.\"Oscar Hijuelos, Professor of the Practice\", Duke University, English Department faculty ==Death== Hijuelos collapsed due to a heart attack while playing tennis in Manhattan and never regained consciousness. He was 62 and is survived by his wife Lori Marie Carlson. ==Works== === Major works === *Our House in the Last World (1983) *The Mambo Kings Play Songs of Love (1990) *The Fourteen Sisters of Emilio Montez O'Brien (1993) *Mr. Ives' Christmas (1995) *Empress of the Splendid Season (1999) *A Simple Habana Melody (from when the world was good) (2002) *Dark Dude (2008) *Beautiful Maria of my Soul (2010) === Contributions === * Preface, Iguana Dreams: New Latino Fiction, edited by Delia Poey and Virgil Suarez. New York, HarperPerennial, 1992. * Introduction, Cool Salsa: Bilingual Poems on Growing up Latino in the United States, edited by Lori M. Carlson. New York, Holt, 1994. * Introduction, The Cuban American Family Album by Dorothy and Thomas Hoobler. New York, Oxford University Press, 1996. * Contributor, Best of Pushcart Press III. Pushcart, 1978. * Contributor, You're On!: Seven Plans in English and Spanish, edited by Lori M. Carlson. New York, Morrow Junior Books, 1999. == Notes == ==Other websites== *Perales, Contreras Jaime and Lozano, Tovar Wendolyn. \"Two Pulitzer Prize (Junot Diaz and Oscar Hijuelos) Talk to Literal Magazine\" * Oscar Hijuelos Papers at the Rare Book & Manuscript Library at Columbia University *Oscar Hijuelos's page at HarperCollins *Biography of Oscar Hijuelos from Thomson Gale *1990 Real Audio interview with Oscar Hijuelos at Wired for Books.org by Don Swaim Category:American novelists Category:Pulitzer Prize winners Category:Writers from New York City Category:Deaths from myocardial infarction Category:1951 births Category:2013 deaths",
 "title": "Oscar Hijuelos"
}