{
 "id": "272415",
 "text": "The Greco–Persian Wars were a series of wars fought between Classical Greece and Persia's Achaemenid Empire in the 5th century BC. The struggle lasted 50 years, from 499–449. Herodotus wrote a history of these wars. Fifty years before the war started, Cyrus the Great had conquered the Greek colonies on the western coast of Asia Minor, an area the Greeks called Ionia. The Persians put a tyrant in charge of each city or polis. About 530 BC Cyrus died in battle. Aristagoras, the Tyrant of Miletus was on an expedition to conquer the island of Naxos with Persian support, but that was a failure. Before he could be dismissed, Arisagoras encouraged Ionia to rebel against the Persians. This led to the Ionian Revolt. Aristagoras got support from Athens and Eretria, and together they burnt the Persian regional capital city, Sardis. The Persian king, now Darius the Great, vowed revenge. == First invasion of Greek kingdoms == The first Persian invasion of Greek majority kingdoms began in 492 BC, led by the Persian general Mardonius. They successfully beat Thrace and Macedon, but several mishaps forced an early end to the rest of the campaign.Roisman, Joseph & Worthington, Ian 2011. A companion to Ancient Macedonia. Wiley. ISBN 978-1-44-435163-7p135-138. == The Battle of Marathon == In 490 BC a second force was sent to Greece, this time across the Aegean Sea. This expedition captured the Cyclades, then destroyed Eretria. On the way to Athens, the Persian force was decisively defeated by the Athenians at the Battle of Marathon, ending Persian efforts at that time. Darius then began to plan to completely conquer Greece, but died in 486 BC. Command passed to his son Xerxes. In 480 BC, Xerxes personally led the second Persian invasion of Greece with one of the largest ancient armies ever assembled. Victory over the allied Greek states at the famous Battle of Thermopylae allowed the Persians to burn Athens (which had been evacuated) and overrun most of Greece. However, against the combined Greek fleet, the Persians suffered a severe defeat at the Battle of Salamis. The following year, the confederated Greeks went on the offensive, decisively defeating the Persian army at the Battle of Plataea, and ending the invasion of Greece by the Achaemenid Empire. == List of main events == #Ionian revolt 499–493 BC #First invasion of Greece 492–490 ##Battle of Marathon 490 #Second invasion of Greece 480–479 ##Battle of Thermopylae 480 ##Battle of Artemisium 480 ##Battle of Salamis 480 #Greek counter-attack 479–478 ##Battle of Plataea #Wars of the Delian League 477–449 Much of what is known of these wars comes from Herodotus. == Peloponnesian War == Although 449 BC saw the end of the wars started by the Ionian revolt, the two civilisations continued for more than a hundred years. The Peloponnesian War between Athens and Sparta allowed Persia to take back all she had lost in the Greco–Persian wars. This is a brief summary of the later conflict: #First part: Sparta vs Athens: 460–445 BC #Second part: 431–404. Persians join Sparta in return for Ionia. Persian king Artaxerxes II demands return of Ionian cities. Humiliating peace treaty follows. == References == == Other websites == * The Persian Wars at History of Iran on Iran Chamber Society * Batchelor, J. The Graeco-Persian Wars Compared . Clio History Journal, 2009. * 1320: Section 2: Herodotus and the Persian Wars Category:History of the Middle East Category:Wars of the Ancient World Category:Achaemenid Empire Category:Battles of ancient Greece Category:5th century BC",
 "title": "Greco–Persian wars"
}