{
 "id": "272533",
 "text": "James Dewey Watson (born April 6, 1928) is an American molecular biologist and zoologist. Watson is of British ancestry. He is best known as one of the discoverers of the structure of DNA with Francis Crick in 1953. Watson, Crick, and Maurice Wilkins were awarded the 1962 Nobel Prize in Physiology or Medicine \"for their discoveries concerning the molecular structure of nucleic acids and its significance for information transfer in living material\".The Nobel Prize in Physiology or Medicine 1962. Nobel Prize Site for Nobel Prize in Physiology or Medicine 1962. He studied at the University of Chicago and Indiana University and later worked at the University of Cambridge's Cavendish Laboratory. He met Crick at the Cavendish and they became friends. Watson has received 19 honorary doctorates. He was elected a foreign member of the Academia Europaea in 1998. == Criticism of Watson == Watson has always been a controversial figure, especially in the United States. The main cause is a long-running argument as to what causes the small difference in the average IQs of black and white people in the U.S.A. Watson has repeatedly said that differences in average measured IQ between blacks and whites are due to genetics.Harmon, Amy.James Watson had a chance to salvage his reputation on Race. He made things worse. (older title: James Watson Won't Stop Talking About Race), New York Times, January 1, 2019. Retrieved January 1, 2019. Watson said his intention was to promote science, not racism An excerpt from Watson's memoir, Avoid Boring People: Lessons from a Life in Science page=102 goes as follows: :\"As we find the human genes whose malfunctioning gives rise to such devastating developmental failures, we may well discover that sequence differences within many of them also lead to much of the observable variation in human IQs. A priori, there is no firm reason to anticipate that the intellectual capacities of peoples geographically separated in their evolution should prove to have evolved identically. Our desire to reserve equal powers of reason as some universal heritage of humanity will not be enough to make it so\".Jerry A. Coyne, \"The complex James Watson\" , Times Literary Supplement, December 12, 2007 An editorial in Nature said that his remarks were \"beyond the pale\".\" Watson's folly\", Nature, October 24, 2007. Retrieved September 27, 2008. Because of the controversy, the Board of Trustees at Cold Spring Harbor Laboratory suspended Watson's administrative responsibilities.Watson, J.D. \"James Watson: To question genetic intelligence is not racism\", Independent, October 19, 2007. Retrieved October 24, 2007 Watson issued an apology,van Marsh, A. \"Nobel-winning biologist apologizes for remarks about blacks\", CNN, October 19, 2007. Retrieved October 24, 2007. then retired at the age of 79 from CSHL after what the lab called \"nearly 40 years of distinguished service\". Watson attributed his retirement to his age and to circumstances that he could never have anticipated or desired.Cold Spring Harbor Laboratory. October 18, 2007. Statement by Cold Spring Harbor Laboratory Board of Trustees and President Bruce Stillman, PhD Regarding Dr. Watson's Comments in The Sunday Times on October 14, 2007. Press release. Retrieved October 24, 2007. Wigglesworth, K. DNA pioneer quits after race comments, LA Times, October 26, 2007. Retrieved December 5, 2007\"Nobel prize-winning biologist resigns.\", CNN, October 25, 2007. Retrieved on October 25, 2007. == Books == Watson has published a number of books. *1968. The double helix: a personal account of the work with Francis Crick 2018: later version. *2002. Genes, Girls, and Gamow: after the double helix (autobiography) *2003. DNA: The secret of life. Knopf. *2003. The molecular biology of the gene, 5th ed. (co-author with five others) *2007. Avoid boring people: lessons from a life in science (autobiography) *The molecular biology of the cell *Recombinant DNA: a short course. 1983 to 2017 editions. ==References== Category:1928 births Category:Living people Category:American molecular biologists Category:American Nobel Prize winners Category:Nobel Prize in Physiology or Medicine winners Category:Scientists from Chicago Category:Members of Academia Europaea",
 "title": "James D. Watson"
}