{
 "id": "27263",
 "text": "Wikipedia is a free content online encyclopedia website in 344 languages of the world in which 342 languages are currently active and 14 are closed. It is written and maintained by a community of volunteers, known as Wikipedians. Users can freely use it, share it, and change it, without having to pay. It is also one of the biggest wiki organizations. People can choose to give money to the Wikimedia Foundation to fund Wikipedia and its sister projects. It is an open content website. This means anyone can copy or edit it and make changes to it if they follow the rules for copying or editing. Wikipedia is owned by an American organization, the Wikimedia Foundation, which is in San Francisco, California. Wikipedia's name is a combination of two words, wiki and encyclopedia.Andreas Kaplan, Haenlein Michael (2014) Collaborative projects (social media application): About Wikipedia, the free encyclopedia. Business Horizons, Volume 57 Issue 5, pp.617-626 Wikipedia was started on January 9, 2001, by Jimmy Wales and Larry Sanger as part of an earlier online encyclopedia named Nupedia. On January 15, 2001, Wikipedia became a separate website of its own. It is a wiki that uses the software MediaWiki (like all other Wikimedia Foundation projects). Anyone who wishes to can change the pages on Wikipedia, or even make new ones. Wikipedia has a standard page layout for all pages in the encyclopedia. As of September 2011, Wikipedia had about 18 million pages in about 300 languages and more than 3.50 billion words across all Wikipedias. The regular English Wikipedia is the largest Wikipedia edition. == History == Wikipedia began as a related project for Nupedia. Nupedia was a free English-language online encyclopedia project. Nupedia's articles were written and owned by Bomis, Inc which was a web portal company. The important people of the company were Jimmy Wales, the person in charge of Bomis, and Larry Sanger, the editor-in-chief of Nupedia. Nupedia was first licensed under the Nupedia Open Content License which was changed to the GNU Free Documentation License before Wikipedia was founded and made their first article when Richard Stallman requested them. Larry Sanger and Jimmy Wales are the ones who started Wikipedia. Wales is credited with defining the goals of the project. Sanger created the strategy of using a wiki to reach Wales' goal. On January 10, 2001, Larry Sanger proposed on the Nupedia mailing list to create a wiki as a \"feeder\" project for Nupedia. Wikipedia was launched on January 15, 2001. It was launched as an English-language edition at www.wikipedia.com, and announced by Sanger on the Nupedia mailing list. Wikipedia's policy of \"neutral point-of-view\"\"Wikipedia:Neutral point of view, Wikipedia (January 21, 2007) was enforced in its initial months and was similar to Nupedia's earlier \"nonbiased\" policy. Otherwise, there weren't very many rules initially, and Wikipedia operated independently of Nupedia. Wikipedia gained early contributors from Nupedia, Slashdot, and from people who looked it up. It grew to about 20,000 articles and 18 languages by the end of 2001. By late 2002 it had 26 languages, 46 by the end of 2003, and 161 by the end of 2004.\" Nupedia and Wikipedia both existed until Nupedia's servers were stopped in 2003. After this, its text was incorporated into Wikipedia. The English Wikipedia reached 2 million articles on September 9, 2007, making it the largest encyclopedia ever. It is even larger than the Yongle Encyclopedia (1407), which had held the record for exactly 600 years. Encyclopedia Britannica The English Wikipedia reached 3 million articles in August 2009. The number of articles and contributors appeared to be growing less quickly around the spring of 2007. In October 2014, the Wikipedia Monument was unveiled to the public in Poland to honor all the contributors of Wikipedia. According to the TechCrunch website, on 23 January 2020, Wikipedia reached more than 6 million articles on the English Wikipedia. On 13 January 2021, the English Wikipedia reached one billion edits, where the billionth edit was made by Steven Pruitt. MIT Press published an open access book of essays Wikipedia @ 20: Stories of an Unfinished Revolution, edited by Joseph Reagle and Jackie Koerner with contributions from prominent Wikipedians, Wikimedians, researchers, journalists, librarians and other experts reflecting on particular histories and themes. By November 2021, Wikipedia had fallen to the thirteenth-placed website in the world for global internet engagement. === 20th anniversary === In January 2021, Wikipedia's 20th anniversary was noted in the media. == Gallery == 10piece-english-M.png|The logo used on the English Wikipedia on January 15, 2011 Old wikipedia logo.png|The first view of the Wikipedia logo Wikipedia Monument 4.JPG|Wikipedia Monument Nupedia logo and wordmark.png|Wikipedia originally developed from another online encyclopedia project, Nupedia. == Related pages == * Simple English Wikipedia * Epistemic community ==Notes== == References == == Other websites == * Wikipedia - multilingual portal (contains links to all language editions of the project) * Wikipedia at the Open Directory Project * CBC News: I, editor * Wikipedia - Citizendium Category:2001 establishments in the United States Category:Wikis Category:Websites established in 2001 Category:Encyclopedia websites Category:Free encyclopedias",
 "title": "Wikipedia"
}