{
 "id": "272681",
 "text": "Moonrise is the second book in the second Warriors series: Warriors: The New Prophecy. It was written by Erin Hunter. It was published on 21 July 2005. It takes place in a fictional forest populated by feral cats who live in groups called Clans. There are four Clans: ThunderClan, ShadowClan, WindClan, and RiverClan. The story also takes place in a mountain range populated by a group of cats called the Tribe of Rushing Water, and in a different forest around a lake, as well as the ocean shores. == Plot == Brambleclaw and Squirrelpaw of ThunderClan, Crowpaw of WindClan, Feathertail and Stormfur of RiverClan, and Tawnypelt of ShadowClan are on their way home from a journey. They were on a journey to find a new home for their Clans, because their old home is being destroyed by humans. On their way back, they go through a mountain range, where they meet the Tribe of Rushing Water. The Tribe is being preyed upon by a mountain lion called Sharptooth. However, their leader, Stoneteller, has received a prophecy that says \"a silver cat will save their Tribe.\" The Tribe takes Stormfur hostage, believing he is the silver cat. The Clan cats help Stormfur escape from the Tribe, but they end up going back to the Tribe, taking pity on them. Squirrelpaw comes up with the idea of hiding a dead rabbit in a cave, and stuffing it with poisonous berries, so that Sharptooth will eat the rabbit and die. But their plan backfires, and Sharptooth doesn't eat the rabbit. It attacks the Tribe cats, and it corners Crowpaw. It is about to kill him, when Feathertail sacrifices herself for Crowpaw. She jumps onto a sharp stone hanging from the cave ceiling, and impales Sharptooth with it. Sharptooth dies, and the Tribe is saved, but Feathertail also dies. Meanwhile, back in the Clans, the forest is being destroyed even more by humans, and some Clan cats begin to go missing. == References == Category:2005 books Category:Warriors books",
 "title": "Moonrise (Warriors)"
}