{
 "id": "272605",
 "text": "The started on December 16, 1707 (23rd day of the 11th month of the year Hōei 4) and ended about January 1, 1708 (9th day of the 12th month of the year Hōei 4) during the Edo period. Shikuoka University page; see Japanese Wikipedia. There was no lava flow, but the Hoei eruption released at least 800 million cubic meters of volcanic ash. This ash spread over very large areas around the volcano. It even reached Edo almost 100 km away. Cinders and ash fell like rain in Izu, Kai, Sagami, and Musashi provinces.Titsingh, Isaac. (1834). Annales des empereurs du japon, p. 416. This eruption of Mount Fuji might have been caused by the 1707 Hōei earthquake 49 days earlier. The eruption was on Mount Fuji's east–north-east slope and made three new volcanic openings called No. 1, No. 2, and No. 3 Hōei vents. The danger of the eruption increased over the next several days. After the first earthquake and explosion of cinders and ash, another stronger explosion happened a few days later. This explosion threw out rocks and stones.Smith, Henry. (1988). Hokusai: One Hundred Views of Mt. Fuji. p. 197. Mount Fuji has not erupted since; but scientists describe Fuji as an active volcano. Hokusai's One Hundred Views of Mount Fuji includes an image of the small crater which developed from a secondary eruption site on the southwestern slope. This was called Hōeizan (Mount Hōei) because the eruption happened in year Hōei 4. Today the crater can be visited from Fujinomiya Trail or Gotemba Trail of Mount Fuji. ==Related disasters== In the year after the Hōei eruption, another related disaster happened. The Sakawa River flooded. Sand from the volcano fell and widely covered the fields east of Mount Fuji. Farmers made sand piles by dumping the ash and sand from their fields. The rain washed away the sand piles from the dumping grounds and into the rivers again and again. This made some of the rivers shallower, especially the Sakawa. Enough ash had fallen to partly block the river. The ash made temporary dams. Heavy rainfall on August 7 and 8, 1708, caused an avalanche of volcanic ash and mud and broke the dams. The river flooded the Ashigara plain. ==Related pages== *Historic eruptions of Mount Fuji *1707 Hōei earthquake ==References== ==Other websites== *富士山火山防災協議会 (Council for Fuji volcano disaster reduction) *富士山宝永噴火（1707）後の土砂災害(PDF) (Distribution of sediment disasters after the 1707 Hoei eruption of Fuji Volcano in central Japan, based on historical documents) Category:Natural disasters in Asia Category:18th century in Japan Category:1707 Category:1700s in Asia Category:1708",
 "title": "Hōei eruption"
}