{
 "id": "273078",
 "text": "Catherine, Princess of Wales, CH (born Catherine Elizabeth Middleton, sometimes known as Kate Middleton; 9 January 1982) is the wife of Prince William and mother of Prince George, Princess Charlotte and Prince Louis. She will become Queen of the United Kingdom when William becomes King. == Background == Middleton was born at Royal Berkshire Hospital in Reading, She grew up in Berkshire. She went to Marlborough College. She met Prince William when she was studying at the University of St Andrews in 2001. When they started a relationship, the attention from the media made Middleton feel harassed.Ex-royal aide condemns paparazzi BBC News Retrieved 16 November 2010. In April 2007, the press reported that William and Middleton had split up. They continued to be friends and didn't stay away from each other, and later in 2007 they got back together. == Marriage to Prince William == William and Kate were married on 29 April 2011. She became Duchess of Cambridge upon her marriage to Prince William. Since then, Middleton has attended many royal events. On 22 July 2013, the Duchess gave birth to a baby boy named Herbert in a London hospital. On 24 July, it was announced that the baby would be called Prince George of Cambridge, with the full given name George Alexander Louis. On 2 May 2015, she gave birth to Princess Charlotte of Cambridge. Their third child, Prince Louis of Cambridge, was born on 23 April 2018. == Public image == Kate is very popular with the public. Many people like her fashion sense and she has been placed on many \"best dressed\" lists. ==Health== On 22 March 2024, she announced publicly that she had been diagnosed with cancer after having abdominal surgery in January. She said that was is undergoing chemotherapy. == Titles == * 29 April 2011-present: Her Royal Highness The Duchess of Cambridge * 8 September 2022-present: Her Royal Highness The Duchess of Cornwall ** In Scotland: Her Royal Highness The Duchess of Rothesay, Her Royal Highness The Countess of Carrick, Baroness of Renfrew, Lady of the Isles, Her Royal Highness The Countess of Strathearn ** In Northern Ireland: Baroness of Carrickfergus * 9 September 2022-present: Her Royal Highness The Princess of Wales, Her Royal Highness The Countess of Chester ==References== |- Category:1982 births Category:Living people Category:English Anglicans Category:House of Windsor Category:Royalty from Berkshire",
 "title": "Catherine, Princess of Wales"
}