{
 "id": "273470",
 "text": "Prince Harry, Duke of Sussex KCVO (Henry Charles Albert David; born 15 September 1984) is a member of the British royal family. He is the younger son of Charles III, and Diana, Princess of Wales and is the younger brother of William, Prince of Wales, and is fifth in the line of succession to the British throne. Harry was a pupil at Eton College. Harry launched the Invictus Games in 2014, and remains patron of its Foundation. He also gives patronage to several other organisations, including the HALO Trust, the London Marathon Charitable Trust, and Walking with the Wounded. ==Early life== Harry was born in the Lindo Wing of St Mary's Hospital in Paddington, London, on 15 September 1984 as the second child of Charles, Prince of Wales, and Diana, Princess of Wales. ==Education and military service== Like his father and brother, Harry was educated at independent schools. He started at Jane Mynors' nursery school and the pre-preparatory Wetherby School, both in London. He was a helicopter pilot in the military,https://www.aljazeera.com/news/2023/1/5/prince-harry- reveals-he-killed-25-in-afghanistan-british-media. Retrieved 2023-01-06 during the War in Afghanistan. During the same year that his book was published, he said to media that he killed enemieshttps://www.vg.no/rampelys/i/jlOWnb/prins- harry-forteller-om-kokainbruk-i-sin-kommende-bok. VG.no. Retrieved 2023-01-05 in Afghanistan. ==Marriage== Prince Harry began dating Meghan Sussex in June 2016. They became engaged in November 2017. The couple married at Windsor Castle on 19 May 2018. The couple's first child, Archie Harrison Mountbatten- Windsor, was born on May 6, 2019. In November 2020, Markle revealed in an opinion piece for The New York Times that she suffered a miscarriage in July of that year. On 4 June 2021, the couple's daughter Lilibet Diana Mountbatten- Windsor was born in Santa Barbara, California. == Titles == 15 September 1984-19 May 2018 His Royal Highness Prince Henry of Wales 19 May 2018 His Royal Highness The Duke of Sussex Scotland: His Royal Highness The Earl of Dumbarton Northern Ireland: Baron of Kilkeel ==Ancestry== Prince Harry's ancestors in three generations Prince Harry of Wales Father: Charles, Prince of Wales Paternal Grandfather: Prince Philip, Duke of Edinburgh Paternal Great-grandfather: Prince Andrew of Greece and Denmark Paternal Great-grandmother: Princess Alice of Battenberg Paternal Grandmother: Elizabeth II of the United Kingdom Paternal Great-grandfather: George VI of the United Kingdom Paternal Great-grandmother: Elizabeth Bowes-Lyon Mother: Diana, Princess of Wales Maternal Grandfather: John Spencer, 8th Earl Spencer Maternal Great-grandfather: Albert Spencer, 7th Earl Spencer, Maternal Great-grandmother: Cynthia Hamilton Maternal Grandmother: Frances Burke Roche Maternal Great-grandfather: Maurice Burke Roche, 4th Baron Fermoy Maternal Great-grandmother: Ruth Gill ==Relationships== He has a brother. As of 2022, Harry has said that he is not satisfied with the relationship with his brother. In 2023, he attended the coronation of his father (Charles III); At that ceremony, Prince Harry was puthttps://www.vg.no/rampelys/i/gEB0J1/kong-charles-krones-foelg- seremonien-direkte-her. VG.no. Retrieved 2023-05-06 on row 3. (Row 3 included the king's brother, Prince Andrew.) ==Notes== == References == ==Other websites== * The Duke of Sussex profile at the official website of the British Monarchy * The Duke of Sussex profile at the official website of the Prince of Wales * * |- |- Category:1984 births Category:Living people Category:House of Windsor Category:People educated at Eton College Category:British princes Category:Royalty from London Category:Charles III",
 "title": "Prince Harry, Duke of Sussex"
}