{
 "id": "273807",
 "text": "is a Japanese architect and university professor at Yokohama National University. Nishizawa won the Pritzker Architecture Prize in 2010.\"Kazuyo Sejima & Ryue Nishizawa--2010 Laureates, Biography\"; retrieved 2012-3-1. ==Career== In 1995, he started a partnership with Kazuyo Sejima in Tokyo. It was called SANAA.SANAA is an acronym. SANAA stands for \"Sejima And Nishizawa And Associates\". In 1997, he started the independent Office of Ryūe Nishizawa. ==Projects== :This table is not finished; you can help Wikipedia by adding to it. Name City State/Country Completed Other Information Image Weekend HouseArchSource, \"Weekend House\" ; retrieved 2012-3-1. Usui Gunma, Japan 1998 House in KamakuraArchSource, \"House in Kamakura\" ; retrieved 2012-3-1. Kamakura Kanagawa, Japan 2001 Takeo Head Office Store Tokyo Tokyo, Japan 2001 Ichikawa ApartmentsArchSource, \"Ichikawa Apartments\" ; retrieved 2012-3-1. Ichkawa Chiba, Japan 2001 Funabashi Apartment BuildingArchSource, \"Funabashi Apartment Building\" ; retrieved 2012-3-1. Funabashi Chiba, Japan 2004 Love Planet Museum Okayama, Japan 2003 Benesse Art Site Naoshima OfficeSetouchi International Art Festival, \"Ryue Nishizawa\" ; retrieved 2012-3-1. Naoshima Kagawa, Japan 2004 House AArchSource, \"House A\" ; retrieved 2012-3-1. Tokyo Tokyo, Japan 2004 Moriyama HouseArchSource, \"Moriyama House\" ; retrieved 2012-3-1. Tokyo Tokyo, Japan 2005 Naoshima Museum Naoshima Kagawa, Japan 2005 Towada Art CentreArchSource, \"Towada Art Centre\" ; retrieved 2012-3-1. Towada Aomori, Japan 2005 Teshima Art MuseumSetouchi International Art Festival, \"Teshima Art Museum\"; retrieved 2012-3-1. Toshima Kagawa, Japan 2010 ===Unbuilt=== * Video Pavilion,ArchSource, Video Pavilion\" ; retrieved 2012-3-1. Kagawa, Japan, 2003 ==Honors== * Venice Biennale Golden Lion, 2004. * Pritzker Prize, 2010. * Thomas Jefferson Foundation Medal, 2019 ==References== ==Other websites== * SANAA website * Office of Ryue Nishizawa website * Vernissage.tv, \"SANAA: Works 1998-2008 New Museum of Contemporary Art, New York\" Category:Living people Category:Japanese architects Category:1966 births Category:Pritzker Architecture Prize winners Category:People from Kanagawa Prefecture",
 "title": "Ryūe Nishizawa"
}