{
 "id": "274110",
 "text": "Overpopulation means that the population of a place is too high. Specifically, there are too many organisms of a certain species in a habitat, so the number of organisms living there is larger than the carrying capacity of the habitat. The habitat cannot support these numbers over time without hurting itself. The term \"overpopulation\" is most often used to refer to the number of humans living on Earth. ==Human overpopulation== The world's population has greatly increased in the last 50 years. The main reason is the reduction in death rate, especially for infants and children. The result is that many more people survive to the age when reproduction is possible. *Reduction of death rate #By reducing the effect of infectious diseases ##widespread use of antibiotics against bacterial diseases ##increased use of vaccination against some viral diseases ##wider provision of clean water (modern sewage systems etc.), which reduces parasitic diseases. #By increasing food production ##the world-wide use of DDT, and later anti-pest treatments. ##the invention of high-yielding varieties of crops and later, genetically-engineered crops.Global food crisis looms Global food crisis looms as climate change and population growth strip fertile land. Guardian.co.uk. 31 August 2007. The recent rapid increase in human population over the past two centuries has raised concerns that humans are beginning to overpopulate the Earth. The planet may not be able to sustain larger numbers of people. The population has been growing since the end of the Black Death, around the year 1400.World population estimates At the beginning of the 19th century, it had reached roughly 1,000,000,000 (one billion). Rapid population growth occurred all over the world, especially after World War II. By 1960, the world population had reached 3 billion, and it doubled to 6 billion over the next four decades. As of 2011, the estimated annual growth rate was 1.10%, down from a peak of 2.2% in 1963, and the world population stood at roughly 6.9 billion. In 2014, it is over seven billion. Current projections show a steady decline in the population growth rate, with the population expected to reach between 8 and 10.5 billion between the year 2040 and 2050. == Loss of forests == What were forests have often been turned into farmland. In so doing many species of animals and plants are wiped out, and the CO2 levels in the atmosphere goes up. This is a direct consequence of human population increase.Alexander Wood 2000. The root causes of biodiversity loss. Routledge. ISBN 978-1853836992 Vidal, John (March 15, 2019). The rapid decline of the natural world is a crisis even bigger than climate change. The Huffington Post. Retrieved March 16, 2019. Stokstad, Erik 2019. Landmark analysis documents the alarming global decline of nature. Science. AAAS. Retrieved 8 February 2021. For the first time at a global scale, the report has ranked the causes of damage. Topping the list, changes in land use—principally agriculture—that have destroyed habitat. Second, hunting and other kinds of exploitation. These are followed by climate change, pollution, and invasive species, which are being spread by trade and other activities. Climate change will likely overtake the other threats in the next decades, the authors note. Driving these threats are the growing human population, which has doubled since 1970 to 7.6 billion, and consumption. Per capita of use of materials is up 15% over the past 5 decades. == Potential solutions == The solutions usually suggested are better education and widespread free contraception (birth control). Many pregnancies are unplanned (40%) or unwanted.Population growth driving climate change, poverty: experts . Agence France-Presse, 21 September 2009. There are powerful forces working against birth control. Religious and traditional beliefs often favor large families. Few governments have tackled the problem seriously. Others have proposed that since human population size and carrying capacity depends on the amount of food available, like other species, a good method would be to control food production and produce food only for how much is needed rather than more than needed in order to stop birthrates. For example, Peter Farb, an anthropologist, ecologist and naturalist stated \"Intensification of production to feed an increased population leads to a still greater increase in population.\"Ian J. Drake, What the Gorilla Saw: Environmental Studies and the Novel Ishmael, ISLE: Interdisciplinary Studies in Literature and Environment, Volume 22, Issue 3, Summer 2015, Pages 568–581, https://doi.org/10.1093/isle/isu141 == Related pages == *Birth control *Population growth *World Population Day *Malthusianism ==Further reading== * *Diamond, Jared M. The worst mistake in the history of the human race. Los Angeles: Oplopanax Publishing, 2010. *Feeney, John. \"AGRICULTURE: Ending the World as We Know It.\" Zephyr, August—September (2010). ==References== ==Other websites== *Pan Earth (overpopulation website) *Population Institute of Canada Category:Demography Category:Population Category:Environmental issues",
 "title": "Human overpopulation"
}