{
 "id": "274273",
 "text": "is a Japanese female electropop group from Hiroshima, Japan. The members are Ayano Ōmoto, Yuka Kashino and Ayaka Nishiwaki. They started in 2001 and joined a major label in 2005. As of June 2009, the group had released nine major label singles to great success. Since 2003, Perfume has been produced by Yasutaka Nakata, founder of the group Capsule and the Contemode label. The group's original sound changed to electronic, dance and pop music taking on Auto-Tune and electro house when they joined major label. ==Profile== Yuka Kashino (Kashiyuka) Birth: 1988.12.23 Hobbies and favorite things: Ice cream, hair care, sparkling jewelry, photography, memorizing lines of commercials. Ayano Omoto (Nocchi) Birth: 1988.9.20 Hobbies: Sleeping, watching TV and movies, reading books, making Misanga, aroma, photography, shopping Special skills: Working hard and detailed, puzzles. Ayaka Nishiwaki (A-chan) Birth: 1989.2.15 Hobbies and favorite things: Flower pattern design, lace, sparkling things, mascara, pink pajamas Special skills: Health and fitness enthusiast. ==History== Perfume formed in 2000. In 2003 in Tokyo, they met someone who would become a crucial to their success - Capsule's Yasutaka Nakata, who is the main producer for them. They released Linear Motor girl, which managed to chart on the oricon chart on September 21, 2005. They released two other singles, \"Computer City\" and \"Electro World\" in 2006. In 2008, they released \"Polyrhythm\", which Perfume is famous for. It reached #7 on oricon chart. In 2011 Perfume switched labels, and their single Spring of Life was their first under Universal Music Japan. ==Discography== These are some of Perfume's singles. Indie Singles *2002.03.21 Omajinai★Perori (OMAJINAI★ペロリ) *2002.11.01 Kareshi Boshūchū (彼氏募集中) *2003.08.06 Sweet Donuts (スウィートドーナッツ) *2004.03.17 Monochrome Effect (モノクロームエフェクト) *2004.09.08 Vitamin Drop (ビタミンドロップ) Major Singles *2005.09.21 Linear Motor Girl (リニアモーターガール) *2006.01.11 Computer City (コンピューターシティ) *2006.06.28 Electro World (エレクトロ・ワールド) *2007.02.14 Fan Service [sweet] (ファン・サーヴィス[sweet]) *2007.09.12 Polyrhythm (ポリリズム) *2008.01.16 Baby cruising Love/Macaroni (Baby cruising Love/マカロニ) *2008.07.09 love the world *2008.11.19 Dream Fighter *2009.03.25 One Room Disco (ワンルーム・ディスコ) *2010.04.14 Fushizenna Girl / Natural ni Koishite (不自然なガール / ナチュラルに恋して) *2010.08.11 VOICE * 2010.11.10 Nee (ねぇ) * 2011.05.18 Laser Beam / Kasukana Kaori (レーザービーム / 微かなカオリ) * 2011.11.02 Spice (スパイス) * 2012.04.11 Spring of Life * 2012.08.15 Spending all my time * 2013.02.27 Mirai no Museum (未来のミュージアム) * 2013.05.22 Magic of Love * 2013.11.27 Sweet Refrain * 2014.07.16 Cling Cling * 2015.04.29 Relax in the City / Pick Me Up * 2015.10.28 STAR TRAIN * 2016.03.16 FLASH ==References== ==Other websites== *Perfume global site *Perfume official site: Biography Category:J-pop music groups Category:People from Hiroshima Category:Musical groups established in 2001 Category:Musicians from Hiroshima Prefecture",
 "title": "Perfume (Japanese band)"
}