{
 "id": "274210",
 "text": "Defenestration is the action of throwing something, especially a person, out of a window. The word comes from the Latin de- (down or away from) and fenestra (window or opening). ==History of the word== The word comes from two events in history that took place in Prague. In 1419, seven town officials were thrown from the town hall, which started the Hussite War. In 1618, two Imperial governors and their secretary were thrown from Prague Castle, which started the Thirty Years War. Both events, particularly the one in 1618, were called the Defenestration of Prague and gave rise to the word and to the idea. ==Other famous defenestrations== * The Bible describes the defenestration of Jezebel at Jezreel by her own servants at the urging of Jehu (2 Kings 9:33). * Several chronicles, notably the Annals of Westhide Abbey, state that King John killed his nephew, Arthur of Brittany, by throwing him from a window in the castle at Rouen, France, in 1203. * In 1378, about 15 of the city leaders were thrown from a window by an angry crowd in Leuven. * In 1383, Bishop Dom Martinho was defenestrated by the citizens of Lisbon, who thought that he had helped the enemy when Lisbon was besieged by the Castilians. * In 1452, King James II of Scotland murdered William Douglas, 8th Earl of Douglas, with his own hands and threw him out of the window at Stirling Castle. * On April 26, 1478, after the failure of the \"Pazzi conspiracy\" to murder the ruler of Florence, Lorenzo de' Medici, Jacopo de' Pazzi was defenestrated. * In 1572, French King Charles IX's friend, the Huguenot leader Gaspard de Coligny, was killed on what is likely the orders of Charles's mother, Catherine de' Medici. Charles ordered the murder of thousands of Protestants in the St. Bartholomew's Day massacre after soldiers had attacked Coligny in his house, stabbed him, and thrown him out of the window. * On December 1, 1640 in Lisbon supporters of the Duke of Braganza found Miguel de Vasconcelos, the hated Portuguese Secretary of State of the Habsburg Philip III, hidden in a closet. They killed him and defenestrated him. His body was left lying in the street. * During the Polish January 1863 Uprising, Russian troops threw Frédéric Chopin's piano out the window of a second-story apartment. Tate is remembered in the Polish poet Cyprian Norwid's poem \"Chopin's Piano.\" The composer had left Warsaw and Poland forever shortly before the start of the November 1830 Uprising. * On June 11, 1903, a group of Serbian army officers murdered and defenestrated King Alexander and Queen Draga. * In 1922, the Italian writer and poet Gabriele d'Annunzio was injured after he had been pushed out a window by an unknown person. * On March 10, 1948, Czechoslovak Foreign Minister Jan Masaryk was found dead and dressed in his pajamas in the courtyard of the Foreign Ministry below his bathroom window. It is now believed that he had been thrown from the window. * In 1968, the son of China's former paramount leader, Deng Xiaoping, Deng Pufang, was thrown from a window by Red Guards during the Cultural Revolution. * Shortly before midnight on December 15, 1969, the Italian anarchist Giuseppe Pinelli was seen falling to his death from a fourth-floor window of the Milan police station. * In 1984, Royal Canadian Mounted Police Officer Patrick Kelly was convicted of throwing his wife, Jeanette, over their 17th-floor balcony in Etobicoke. * The 2000 Ramallah lynching included throwing the dead body of either Vadim Nurzhitz or Yossi Avrahami out of a second-floor window after both of the Israeli soldiers had been murdered. * On March 2, 2007, the Russian investigative journalist Ivan Safronov, who was researching the Kremlin's secret arms deals, fell to his death from a fifth-floor window. His friends said it was not suicide, and an investigation was opened looking into possible \"incitement to suicide\". * In 2007 in Gaza, Fatah killed a Hamas supporter by defenestration. The next day, a Fatah supporter was defenestrated by Hamas.Palestinian gunmen target Haniyeh's home in Gaza, Associated Press, 11/06/2007 ==References== Category:Assassinations",
 "title": "Defenestration"
}