{
 "id": "274494",
 "text": "Deportivo Italia is a Venezuelan football team in Caracas. It was founded in 1948 and ended activities in summer 2010. ==History== Football started to be played in Venezuela in the first half of the 20th century. \"Deportivo Italia\" was one of the first teams. If was founded by Italian emigrants in Caracas in 1948. The most successful years of the team were those of the \"D'Ambrosio era\", which lasted from 1958 to 1977.Photos of the team players in those years This 20 years period was crowned by the victory 1:0 with the Fluminense, champion team of Brazil in 1971. ===The D'Ambrosio golden era=== In 1958, Mino D'Ambrosio and his brother Pompeo D'Ambrosio took control of Deportivo Italia. Pompeo managed the finances of the team. For the next twenty years, the team was the most successful in Venezuela. In those golden years, Deportivo Italia won the \"Venezuelan First Division\" tournament four times (1961, 1963, 1966 and 1972) and the Copa Venezuela three times (1961,1962 and 1970), and was runner up in the first division in 1965, 1968, 1969, 1970 and 1971 and in the Copa Venezuela in 1976. Deportivo Italia even managed to participate in the Copa Libertadores six times (1964, 1966, 1967, 1969, 1971 and 1972). In the 1971 Copa Libertadores, Deportivo Italia was even able to defeat 1:0 the Fluminense (Champion of Brasil) in the Estádio do Maracanã in Rio de Janeiro: it was celebrated as Pequeno Maracanazo (Small Maracanazo in english) by all the Latinoamerican sport-media. The Caracas daily 'El Universal' wrote that: The Deportivo Italia – under the direct supervision of Mino D'Ambrosio (who ruled the team with his brother Pompeo D'Ambrosio)– that night went to the match with Vito Fasano (who for his performance was recruited in Brazil, Vito is Italian) as goalkeeper. At the defence there were Carlos \"Chiquichagua\" Marín, Tenorio, Vincente Arrud and Freddy Elie, while as midfielders Delman \"Pito\" Useche, Negri and Rui. In the attack played Alcyr (who was replaced by Bahia), Beto and Militello. In the magazine \"Incontri\" of Caracas, Bruno D'Ambrosio (grandson of Mino who attended the match) wrote that in the final half hour the goalkeeper Vito Fassano did miracles: three hits to the poles helped him, but while two knocked externally the door defended by Fassano, the third would have been goal if the goalkeeper had not deflected it with his fingers stretching in an incredible way. Fassano made the best game of his life, according to sport journalists. ===Final years=== After 1998, the team suffered a crisis and changed its name to \"Italchacao\". But the following performance of the team was very low in the Venezuelan championship. For the 2006/2007 season the team returned to its original name Deportivo Italia Fútbol Club. In 2008, with manager Eduardo Saragó, Deportivo Italia won the Torneo Apertura, beating Aragua FC (0-2) on November 30, and for this, qualified them for the 2010 Copa Libertadores. There in May 2010 the \"Azules\" were able only to get a tie with the \"Cruzeiro\" of Brazil Video of Deportivo Italia-Cruzeiro 2:2 Deportivo Italia changed its name to \"Deportivo Petare\" in summer 2010. But there is an ongoing dispute, because there is a strong opposition to this change from the Italian community of Caracas. ==Related pages== * Small Maracanazo * Pompeo D'Ambrosio * Deportivo Petare ==Notes== Category:Venezuelan football clubs Category:Caracas Category:1948 establishments in Venezuela Category:2010 disestablishments",
 "title": "Deportivo Italia (1948-2010)"
}