{
 "id": "274791",
 "text": "Philippe II, Duke of Orléans (Philippe Charles; 2 August 1674 - 2 December 1723), was a member of the royal family of France and served as Regent of the Kingdom from 1715 to 1723. Born at his father's palace at Saint-Cloud, he was known from birth under the title of Duke of Chartres. His father was Louis XIV's younger brother Philippe I, Duke of Orléans, known as Monsieur; his mother was Elizabeth Charlotte of the Palatinate. In 1692, Philippe married his first cousin, Françoise Marie de Bourbon - the youngest legitimised daughter (légitimée de France) of Philippe's uncle Louis XIV and Madame de Montespan. Named regent of France for Louis XV until Louis attained his majority in February 1723, the era of his de facto rule was known as the Regency (1715–1723). He died at Versailles in 1723. He is referred to historically as le Régent. ==Issue== #Mademoiselle de Valois (17 December 1693 - 17 October 1694) died in infancy. #Marie Louise Élisabeth d'Orléans (20 August 1695 - 21 July 1719) married Charles of France, Duke of Berry and had issue. #Louise Adélaïde d'Orléans (13 August 1698 - 10 February 1743) Abbess of Chelles died unmarried. #Charlotte Aglaé d'Orléans (20 October 1700 - 19 January 1761) married Francesco III d'Este, Duke of Modena and had issue. #Louis d'Orléans (4 August 1703 - 4 February 1752) married Margravine Johanna of Baden-Baden and had issue. #Louise Élisabeth d'Orléans (11 December 1709 - 16 June 1742) married King Louis I of Spain, no issue. #Philippine Élisabeth d'Orléans (18 December 1714 - 21 May 1734) married Infante Carlos of Spain, no issue. #Louise Diane d'Orléans (27 June 1716 - 26 September 1736) married Louis François de Bourbon and has issue. Philippe also had several illegitimate children with several women, three of whom he acknowledged. *By Florence Pellerin: #Charles de Saint-Albin (1698–1764); *By Marie Louise Le Bel de La Boissière: #Jean Philippe bâtard d'Orléans (1702–1748); *By Christine Charlotte Desmares: #Angélique de Froissy (1702–1785). ==Titles, styles, honours and arms== ===Titles and styles=== *2 August 1674 – 9 June 1701 His Royal Highness The Duke of Chartres, Grandson of France. *9 June 1701 – 2 September 1715 His Royal Highness The Duke of Orléans, Grandson of France. *2 September 1715 – 15 February 1723 His Royal Highness The Regent [of France], Grandson of France. *15 February 1723 – 2 December 1723 His Royal Highness The Duke of Orléans, Grandson of France. Category:1674 births Category:1723 deaths Category:Dukes and Duchesses of Montpensier Category:Dukes and Duchesses of Nemours Category:Dukes and Duchesses of Chartres Category:People from Saint-Cloud Category:Regents Category:House of Orléans Category:Dukes and Duchesses of Orléans Category:Burials at the Basilica of St Denis Category:Knights of the Golden Fleece",
 "title": "Philippe II, Duke of Orléans"
}