{
 "id": "274848",
 "text": "The Science Fiction and Fantasy Writers of America gives awards for good Science Fiction writing. Each year they give the Nebula Award for Best Novel. In this list, the year means the year that the book was published; awards are given the next year. == Winners and other nominees == Year Winner Other authors and books that were named as very good 1965 Dune by Frank Herbert1 * All Flesh is Grass by Clifford D. Simak * The Clone by Theodore Thomas & Kate Wilhelm * Dr. Bloodmoney by Philip K. Dick * The Escape Orbit by James White * The Genocides by Thomas M. Disch * Nova Express by William Burroughs * A Plague of Demons by Keith Laumer * Rogue Dragon by Avram Davidson * The Ship That Sailed the Time Stream by G. C. Edmondson * The Star Fox by Poul Anderson * The Three Stigmata of Palmer Eldritch by Philip K. Dick 1966 (tie) * Babel-17 by Samuel R. Delany * Flowers for Algernon by Daniel Keyes * The Moon Is a Harsh Mistress by Robert A. Heinlein1 1967 The Einstein Intersection by Samuel R. Delany * Chthon by Piers Anthony * The Eskimo Invasion by Hayden Howard * Lord of Light by Roger Zelazny1 * Thorns by Robert Silverberg 1968 Rite of Passage by Alexei Panshin * Black Easter by James Blish * Do Androids Dream of Electric Sheep? by Philip K. Dick * The Masks of Time by Robert Silverberg * Past Master by R. A. Lafferty * Picnic on Paradise by Joanna Russ * Stand on Zanzibar by John Brunner1 1969 The Left Hand of Darkness by Ursula K. Le Guin1 * Bug Jack Barron by Norman Spinrad * Isle of the Dead by Roger Zelazny * The Jagged Orbit by John Brunner * Slaughterhouse-Five by Kurt Vonnegut * Up the Line by Robert Silverberg 1970 Ringworld by Larry Niven1 * And Chaos Died by Joanna Russ * Fourth Mansions by R. A. Lafferty * The Steel Crocodile by D. G. Compton * Tower of Glass by Robert Silverberg * The Year of the Quiet Sun by Wilson Tucker 1971 A Time of Changes by Robert Silverberg * The Byworlder by Poul Anderson * The Devil is Dead by R. A. Lafferty * Half Past Human by T. J. Bass * The Lathe of Heaven by Ursula K. Le Guin * Margaret and I by Kate Wilhelm 1972 The Gods Themselves by Isaac Asimov1 * The Book of Skulls by Robert Silverberg * Dying Inside by Robert Silverberg * The Iron Dream by Norman Spinrad * The Sheep Look Up by John Brunner * What Entropy Means to Me by George Alec Effinger * When Harlie Was One by David Gerrold 1973 Rendezvous with Rama by Arthur C. Clarke1 * Gravity's Rainbow by Thomas Pynchon * The Man Who Folded Himself by David Gerrold * The People of the Wind by Poul Anderson * Time Enough for Love by Robert A. Heinlein 1974 The Dispossessed by Ursula K. Le Guin1 * 334 by Thomas M. Disch * Flow My Tears, The Policeman Said by Philip K. Dick * The Godwhale by T. J. Bass 1975 The Forever War by Joe Haldeman1 * Autumn Angels by Arthur Byron * The Birthgrave by Tanith Lee * The Computer Connection by Alfred Bester * Dhalgren by Samuel R. Delany * Doorways in the Sand by Roger Zelazny * The Embedding by Ian Watson * The Exile Waiting by Vonda N. McIntyre * The Female Man by Joanna Russ * A Funeral for the Eyes of Fire by Michael Bishop * Guernica Night by Barry N. Malzberg * The Heritage of Hastur by Marion Zimmer Bradley * Invisible Cities by Italo Calvino * A Midsummer Tempest by Poul Anderson * The Missing Man by Katherine Maclean * The Mote in God's Eye by Larry Niven & Jerry Pournelle * Ragtime by E. L. Doctorow * The Stochastic Man by Robert Silverberg 1976 Man Plus by Frederik Pohl * Inferno by Larry Niven & Jerry Pournelle * Islands by Marta Randall * Shadrach in the Furnace by Robert Silverberg * Triton by Samuel R. Delany * Where Late the Sweet Birds Sang by Kate Wilhelm 1 1977 Gateway by Frederik Pohl1 * Cirque by Terry Carr * In the Ocean of Night by Gregory Benford * Moonstar Odyssey by David Gerrold * Sword of Demon by Richard A. Lupoff 1978 Dreamsnake by Vonda McIntyre1 * Blind Voices by Tom Reamy * The Faded Sun: Kesrith by C. J. Cherryh * Kalki by Gore Vidal * Strangers by Gardner Dozois 1979 The Fountains of Paradise by Arthur C. Clarke1 * Jem by Frederik Pohl * Juniper Time by Kate Wilhelm * On Wings of Song by Thomas M. Disch * The Road to Corlay by Richard Cowper * Titan by John Varley 1980 Timescape by Gregory Benford * Beyond the Blue Event Horizon by Frederik Pohl * Mockingbird by Walter Tevis * The Orphan by Robert Stallman * The Shadow of the Torturer by Gene Wolfe * The Snow Queen by Joan D. Vinge 1 1981 The Claw of the Conciliator by Gene Wolfe * Little, Big by John Crowley * The Many-Colored Land by Julian May * Radix by A. A. Attanasio * Riddley Walker by Russell Hoban * The Vampire Tapestry by Suzy McKee Charnas 1982 No Enemy But Time by Michael Bishop * Foundation's Edge by Isaac Asimov1 * Friday by Robert A. Heinlein * Helliconia Spring by Brian Aldiss * The Sword of the Lictor by Gene Wolfe * The Transmigration of Timothy Archer by Philip K. Dick 1983 Startide Rising by David Brin1 * Against Infinity by Gregory Benford * The Citadel of the Autarch by Gene Wolfe * Lyonesse by Jack Vance * Tea with the Black Dragon by R. A. MacAvoy * The Void Captain's Tale by Norman Spinrad 1984 Neuromancer by William Gibson1 * Frontera by Lewis Shiner * The Integral Trees by Larry Niven * Job: A Comedy of Justice by Robert A. Heinlein * The Man Who Melted by Jack Dann * The Wild Shore by Kim Stanley Robinson 1985 Ender's Game by Orson Scott Card1 * Blood Music by Greg Bear * Dinner at Deviant's Palace by Tim Powers * Helliconia Winter by Brian Aldiss * The Postman by David Brin * The Remaking of Sigmund Freud by Barry N. Malzberg * Schismatrix by Bruce Sterling 1986 Speaker for the Dead by Orson Scott Card1 * Count Zero by William Gibson * Free Live Free by Gene Wolfe * The Handmaid's Tale by Margaret Atwood * The Journal of Nicholas the American by Leigh Kennedy * This is the Way the World Ends by James Morrow 1987 The Falling Woman by Pat Murphy * The Forge of God by Greg Bear * Soldier of the Mist by Gene Wolfe * The Uplift War by David Brin1 * Vergil in Averno by Avram Davidson * When Gravity Fails by George Alec Effinger 1988 Falling Free by Lois McMaster Bujold * Deserted Cities of the Heart by Lewis Shiner * Drowning Towers by George Turner * Great Sky River by Gregory Benford * Mona Lisa Overdrive by William Gibson * Red Prophet by Orson Scott Card * The Urth of the New Sun by Gene Wolfe 1989 The Healer's War by Elizabeth Ann Scarborough * The Boat of a Million Years by Poul Anderson * Prentice Alvin by Orson Scott Card * Good News From Outer Space by John Kessel * Ivory: A Legend of Past and Future by Mike Resnick * Sister Light, Sister Dark by Jane Yolen 1990 Tehanu: The Last Book of Earthsea by Ursula K. Le Guin * Mary Reilly by Valerie Martin * Only Begotten Daughter by James Morrow * The Fall of Hyperion by Dan Simmons * Redshift Rendezvous by John E. Stith * White Jenna by Jane Yolen 1991 Stations of the Tide by Michael Swanwick * Orbital Resonance by John Barnes * Barrayar by Lois McMaster Bujold 1 * Bone Dance by Emma Bull * Synners by Pat Cadigan * The Difference Engine by Bruce Sterling and William Gibson 1992 Doomsday Book by Connie Willis1 * A Million Open Doors by John Barnes * Sarah Canary by Karen Joy Fowler * China Mountain Zhang by Maureen F. McHugh * A Fire Upon the Deep by Vernor Vinge1 * Briar Rose by Jane Yolen 1993 Red Mars by Kim Stanley Robinson * Assemblers of Infinity by Kevin J. Anderson and Doug Beason * Hard Landing by Algis Budrys * Beggars in Spain by Nancy Kress * Nightside the Long Sun by Gene Wolfe 1994 Moving Mars by Greg Bear * Parable of the Sower by Octavia E. Butler * Gun, with Occasional Music by Jonathan Lethem * Towing Jehovah by James Morrow * Temporary Agency by Rachel Pollack * Green Mars by Kim Stanley Robinson1 * A Night in the Lonesome October by Roger Zelazny 1995 The Terminal Experiment by Robert J. Sawyer * Mother of Storms by John Barnes * Beggars and Choosers by Nancy Kress * Celestis by Paul Park * Metropolitan by Walter Jon Williams * Calde of the Long Sun by Gene Wolfe 1996 Slow River by Nicola Griffith * The Silent Strength of Stones by Nina Kiriki Hoffman * Winter Rose by Patricia A. McKillip * Expiration Date by Tim Powers * Starplex by Robert J. Sawyer * The Diamond Age by Neal Stephenson 1 1997 The Moon and the Sun by Vonda McIntyre * Memory by Lois McMaster Bujold * King's Dragon by Kate Elliott * A Game of Thrones by George R. R. Martin * Ancient Shores by Jack McDevitt * City on Fire by Walter Jon Williams * Bellwether by Connie Willis 1998 Forever Peace by Joe Haldeman1 * The Last Hawk by Catherine Asaro * Moonfall by Jack McDevitt * How Few Remain by Harry Turtledove * Death of the Necromancer by Martha Wells * To Say Nothing of the Dog by Connie Willis 1 1999 Parable of the Talents by Octavia E. Butler * The Cassini Division by Ken MacLeod * A Clash of Kings by George R. R. Martin * Mission Child by Maureen F. McHugh * Mockingbird by Sean Stewart * A Deepness in the Sky by Vernor Vinge1 2000 Darwin's Radio by Greg Bear * A Civil Campaign by Lois McMaster Bujold * Crescent City Rhapsody by Kathleen Ann Goonan * Midnight Robber by Nalo Hopkinson * Infinity Beach by Jack McDevitt * Forests of the Heart by Charles de Lint 2001 The Quantum Rose by Catherine Asaro * Eternity's End by Jeffrey A. Carver * Mars Crossing by Geoffrey A. Landis * A Storm of Swords by George R. R. Martin * The Collapsium by Wil McCarthy * The Tower at Stony Wood by Patricia A. McKillip * Declare by Tim Powers * Passage by Connie Willis Although Declare appeared on the final ballot, it was afterwards determined to be ineligible. 2002 American Gods by Neil Gaiman1 * Solitaire by Kelley Eskridge * The Other Wind by Ursula K. Le Guin * Picoverse by Robert A. Metzger * Perdido Street Station by China Miéville * Bones of the Earth by Michael Swanwick 2003 The Speed of Dark by Elizabeth Moon * Diplomatic Immunity by Lois McMaster Bujold * The Mount by Carol Emshwiller * Light Music by Kathleen Ann Goonan * The Salt Roads by Nalo Hopkinson * Chindi by Jack McDevitt 2004 Paladin of Souls by Lois McMaster Bujold 1 * Down and Out in the Magic Kingdom by Cory Doctorow * Omega by Jack McDevitt * Cloud Atlas by David Mitchell * Perfect Circle by Sean Stewart * The Knight by Gene Wolfe 2005 Camouflage by Joe Haldeman * Jonathan Strange and Mr Norrell by Susanna Clarke 1 * Polaris by Jack McDevitt * Going Postal by Terry Pratchett * Air by Geoff Ryman * Orphans of Chaos by John C. Wright 2006 Seeker by Jack McDevitt * The Privilege of the Sword by Ellen Kushner * The Girl in the Glass by Jeffrey Ford * Farthing by Jo Walton * From the Files of the Time Rangers by Richard Bowes * To Crush the Moon by Wil McCarthy 2007 The Yiddish Policemen's Union by Michael Chabon 1 * Odyssey by Jack McDevitt * The Accidental Time Machine by Joe Haldeman * The New Moon's Arms by Nalo Hopkinson * Ragamuffin by Tobias Buckell 2008 Powers by Ursula K. Le Guin * Little Brother, by Cory Doctorow * Cauldron by Jack McDevitt * Brasyl by Ian McDonald * Making Money by Terry Pratchett * Superpowers by David J. Schwartz 2009 The Windup Girl by Paolo Bacigalupi 1 Winners: 2009 Nebula Awards , SF Signal, accessed May 15, 2010. * The Love We Share Without Knowing by Christopher Barzak * Flesh and Fire by Laura Anne Gilman * The City & the City by China Miéville1 * Boneshaker by Cherie Priest * Finch by Jeff VanderMeer 2010 Blackout/All Clear by Connie Willis1 * The Native Star by M.K. Hobson * The Hundred Thousand Kingdoms by N. K. Jemisin * Shades of Milk and Honey by Mary Robinette Kowal * Echo by Jack McDevitt * Who Fears Death by Nnedi Okorafor 2011 Among Others by Jo Walton1 * Embassytown by China Miéville * Firebird by Jack McDevitt * God's War by Kameron Hurley * Mechanique: a Tale of the Circus Tresaulti by Genevieve Valentine * The Kingdom of Gods by N. K. Jemisin 2012 2312 by Kim Stanley Robinson * Throne of the Crescent Moon by Saladin Ahmed * Ironskin by Tina Connolly * The Killing Moon by N. K. Jemisin * The Drowning Girl by Caitlín R. Kiernan * Glamour in Glass by Mary Robinette Kowal 2013 Ancillary Justice by Ann Leckie1 * We Are All Completely Beside Ourselves by Karen Joy Fowler * The Ocean at the End of the Lane by Neil Gaiman * Fire with Fire by Charles E. Gannon * Hild by Nicola Griffith * The Red: First Light by Linda Nagata * A Stranger in Olondria by Sofia Samatar * The Golem and the Jinni by Helene Wecker 2014 Annihilation by Jeff VanderMeer * The Goblin Emperor by Katherine Addison * Trial by Fire by Charles E. Gannon * Ancillary Sword by Ann Leckie * The Three-Body Problem by Cixin Liu1 * Coming Home by Jack McDevitt 2015 Uprooted by Naomi Novik * Ancillary Mercy by Ann Leckie * Barsk: The Elephants' Graveyard by Lawrence M. Schoen * The Fifth Season by N. K. Jemisin1 * The Grace of Kings by Ken Liu * Raising Caine by Charles E. Gannon * Updraft by Fran Wilde 2016 All the Birds in the Sky by Charlie Jane Anders * Borderline by Mishell Baker * The Obelisk Gate by N. K. Jemisin1 * Ninefox Gambit by Yoon Ha Lee * Everfair by Nisi Shawl 2017 The Stone Sky by N. K. Jemisin1 * Amberlough by Lara Elena Donnelly * The Strange Case of the Alchemist's Daughter by Theodora Goss * Spoonbenders by Daryl Gregory * Six Wakes by Mur Lafferty * Jade City by Fonda Lee * Autonomous by Annalee Newitz 2018 The Calculating Stars by Mary Robinette Kowal1 * Blackfish City by Sam J. Miller * The Poppy War by R. F. Kuang * Spinning Sliver by Naomi Novik * Trail of Lightning by Rebacca Roanhorse * Witchmark by C. L. Polk 2019 A Song for a New Day by Sarah Pinsker * Marque of Caine by Charles E. Gannon * The Ten Thousand Doors of January by Alix E. Harrow * A Memory Called Empire by Arkady Martine1 * Gods of Jade and Shadow by Silvia Moreno-Garcia * Gideon the Ninth by Tamsyn Muir 2020 Network Effect by Martha Wells1 * Piranesi by Susanna Clarke * The City We Became by N. K. Jemisin * Mexican Gothic by Silvia Moreno-Garcia * The Midnight Bargain by C. L. Polk * Black Sun by Rebecca Roanhorse 2021 A Master of Djinn by P. Djélí Clark * The Unbroken by C. L. Clark * Machinehood by S. B. Divya * A Desolation Called Peace by Arkady Martine * Plague Birds by Jason Sanford 1 Also a winner of the Hugo Award for Best Novel. ==Related pages== * Hugo Award for Best Novel * List of science fiction awards ==References== ==Other websites== * Nebula Awards Homepage * List of award winners from official site * A list of the most honored Nebula Award nominated novels * Another list of award winners * Scans of the first edition covers of Hugo- and Nebula-winning novels Category:Nebula Awards Category:Lists of books",
 "title": "Nebula Award for Best Novel"
}