{
 "id": "274804",
 "text": "Françoise Marie de Bourbon, Légitimée de France, Granddaughter of France by marriage (4 MayDate as given by the Almanach Royal of France. She has been given three dates of birth over time; 9 February; 4 May; and 25 May 1677 – 1 February 1749) was the youngest legitimised daughter (fille légitimée de France) of Louis XIV of France and his mistress, Madame de Montespan. She was famed for her arrogance and belief that she was above most other people. ==Biography== Originally known as the second Mademoiselle de Blois, that style eventually gave way to the name Françoise Marie de Blois. She married her first cousin Philippe d'Orléans in 18 February 1692 at the age of fourteen and later bore eight children, four of which would have further children. Proud, lazy and attractive, she successfully intrigued to have her daughters marry well to the Prince of Conti, Duke of Berry, Duke of Modena and King of Spain, mostly to spite her sister Louise Françoise de Bourbon, the Duchess of Bourbon. However, she welded little political influence considering her proximity to the political circle of the era. She was involved in the Cellamare Conspiracy in 1718 which was supposed to overthrow her own husband Philippe d'Orléans as Regent of the Kingdom and replace him with her favourite brother the Duke of Maine. The marquis d'Argenson said she was very like her mother, Madame de Montespan, but also had Louis XIV's orderly mind with his failings of injustice and harshness. Among her male line descendents are Philippe Egalité, Louis-Philippe I, King of the French, and Prince Henri, Count of Paris, the present Orléanist pretender to the French throne. She is also an ancestor of Juan Carlos I of Spain, Philippe, King of the Belgians, Henri, Grand Duke of Luxembourg and Vittorio Emanuele, Prince of Naples, the pretender to the Italian throne. ==Children== #Mademoiselle de Valois (17 December 1693 - 17 October 1694) died in infancy. #Marie Louise Élisabeth d'Orléans (20 August 1695 - 21 July 1719) married Charles of France, Duke of Berry and had children but none survived to adulthood. #Louise Adélaïde d'Orléans (13 August 1698 - 10 February 1743) Abbess of Chelles died unmarried and childless. #Charlotte Aglaé d'Orléans (20 October 1700 - 19 January 1761) married Francesco d'Este, Duke of Modena and had children. #Louis d'Orléans (4 August 1703 - 4 February 1752) married Margravine Johanna of Baden-Baden and had children. #Louise Élisabeth d'Orléans (11 December 1709 - 16 June 1742) married Louis I of Spain, no issue. #Philippine Élisabeth d'Orléans (18 December 1714 - 21 May 1734) engaged to Infante Carlos of Spain but never married and died childless. #Louise Diane d'Orléans (27 June 1716 - 26 September 1736) married Louis François de Bourbon, Prince of Conti and had children. ==Titles, styles, honours and arms== ===Titles and styles=== *4 May 1677 – 22 November 1681 Françoise Marie de Bourbon. *22 November 1681 – 18 February 1692 Her Highnessib. Spanheim, Ézéchiel, pp. 100–105, 323–327. Françoise Marie de Bourbon, Legitimée de France, \"Mademoiselle de Blois\". *18 February 1692 – 9 June 1701 Her Royal Highness the Duchess of Chartres.http://www.heraldica.org/topics/france/frroyal.htm#sang Style of HRH and further information on Princes of the Blood * 9 June 1701 – 2 December 1723 Her Royal Highness the Duchess of Orléans. *2 December 1723 – 1 February 1749 Her Royal Highness the Dowager Duchess of Orléans. ==References== Category:1677 births Category:1749 deaths Category:House of Bourbon Category:House of Orléans Category:Dukes and Duchesses of Chartres Category:Dukes and Duchesses of Orléans Category:Dukes and Duchesses of Montpensier Category:Dukes and Duchesses of Nemours",
 "title": "Françoise Marie de Bourbon"
}