{
 "id": "274947",
 "text": "A geological basin is a large low-lying area. It is often below sea level. Geological basins are one of the two most common places inland which collect sediment (the other is lakes). The type of rocks which form there tell about the palaeoclimate of the continent. The geology is of interest to oil prospectors, hydrologists and palaeontologists. == Causes == #One cause is stretching of the lithosphere (crust + upper mantle). Examples: North Sea; Nevada basin; Death Valley; Red Sea. #Overthrusting of a continental plate, at a plate boundary, causes the plate to flex. Part goes up, and part goes down. The downward part becomes a foreland basin. Examples: the Ebro basin next to the Pyrenees in Spain; the Molasse and Po River basins next to the Alps. #Rifting can cause basins, as with the Dead Sea rift. === Death Valley example === Starting around 16 million years ago in the Miocene, and continuing into the present, a large part of the North American Plate has been stretched by being pulled apart.Harris, Ann G.; Tuttle, Esther; Tuttle, Sherwood D. 1997. Geology of National Parks. 5th ed, Iowa: Kendall/Hunt Publishing. p611 The result has been the creation of a large and still-growing region of relatively thin crust; the region grew an average of per year initially and then slowed to per year in the last 5 million years.Collier, Michael 1990. An introduction to the geology of Death Valley. Death Valley Natural History Association. LCN 90-081612. Geologists call this region the Basin and Range Province. Pulling forces causes rock at depth to stretch like silly putty and rock closer to the surface to break along normal faults into downfallen basins called grabens. == Sediment == Because the basin is low-lying, it collects sediment. Rivers may run down into the basin from surrounding mountains. Floods or lakes may form with no outlet to the sea. Evaporation occurs; more sediment arrives, and so on. The strata which forms gives clues as to the palaeoclimate. Other terms that are used to describe a basin are: drainage basin, catchment, catchment area, catchment basin, drainage area, river basin, water basin, endorheic basin and watershed. == Drainage == Some basins, such as the Great Basin, do not drain to the sea. The water may drain into underground aquifers, or evaporate to form salt lakes. Most basins, however, are drainage basins with rivers bringing their water into the sea. Many such rivers meander through a web of islands at the river delta, and bring along a huge amount of sediment in the form of mud, clay and sand. The Amazon and the Mississippi river systems are like this. The strata which form are quite different from inland basin lakes. == References == Category:Landforms",
 "title": "Basin (geology)"
}