{
 "id": "275021",
 "text": "Charles Emmanuel III (27 April 1701 – 20 February 1773) was the Duke of Savoy and King of Sardinia from 1730 until his death. ==Biography== He was born a Prince of Savoy in Turin to Victor Amadeus II of Savoy and Anne Marie d'Orléans. His maternal grandparents were (Prince) Philippe of France and his first wife Henrietta of England, daughter of Charles I of England and Queen Henrietta Maria. At the time of his birth, Charles Emmanuel was styled the Duke of Aosta as his older brother Victor Amadeus, Prince of Piedmont was the Heir apparent. His older brother, the Prince of Piedmont died in 1715 and then Charles Emmanuel became Heir apparent. In 1730 his father abdicated on 3 September leaving the throne to Charles. He was not loved by Victor Amadeus, and consequently received an incomplete education. He however acquired noteworthy knowledge in the military field along his father. A god ruler, he married three times and had eleven children in total. Charles Emmanuel died in Turin in 1773. He was buried in the Basilica of Superga. ==Marriages and issue== He married three times, but his three wives all died before their 30th birthday. There were plans for him to marry Charlotte Aglaé d'Orléans but his mother declined the offer. Amalia d'Este was also a candidate, daughter of Rinaldo d'Este, Duke of Modena. *Anne Christine of Sulzbach (1704–1723), daughter of Theodore Eustace of Sulzbach and Maria Eleonore of Hesse- Rotenburg. She died a few days later after giving birth to a son: #Prince \"Vittorio Amedeo\" Theodore of Savoy (1723–1725) died in infancy; *Polyxena of Hesse-Rotenburg (1706–1735) She was the daughter of Ernest Leopold, Landgrave of Hesse-Rotenburg and his wife Maria Anna of Löwenstein-Wertheim-Rochefort. Polyxena was the aunt of the famous princesse de Lamballe. The couple married on 20 August 1724 in Thorn. Polyxena bore him six children: #Victor Amadeus III of Sardinia (1726–1796); married Infanta Maria Antonia of Spain and had children. They were the ancestors of Henri, Count of Chambord; #Princess Eleonora Maria Teresa of Savoy (1728–1781), unmarried. #Princess Maria Luisa Gabriella of Savoy (1729-d.1767), a nun. #Princess Maria Felicita of Savoy (1730–1801), unmarried. #Prince Emanuele Filiberto of Savoy, Duke of Aosta (1731–1735) died in infancy; #Prince \"Carlo\" Francesco Romualdo of Savoy, Duke of Chablais (1733-1733) died in infancy; *Elisabeth Therese of Lorraine (1711–1741) daughter of Élisabeth Charlotte d'Orléans (niece of Louis XIV of France) and Leopold, Duke of Lorraine. The couple married in 1737. Elisabeth Therese was a younger sister of Holy Roman Emperor Francis I, Elisabeth Therese bore him three children: #Prince \"Carlo\" Francesco Maria Augusto of Savoy, Duke of Aosta (1738–1745) died in infancy; #Princess Maria \"Vittoria\" Margherita of Savoy (1740–1742) died in infancy; #Prince \"Benedetto\" Maria Maurizio of Savoy (1741–1808), Duke of Chablais (-1796) and Marquis of Ivrea (1796–1808). He married his niece Princess Maria Anna of Savoy (1757–1824), daughter of his older half-brother Victor Amadeus III, no children. ==Titles, styles, honours and arms== ===Titles and styles=== *27 April 1701 – 22 March 1715 His Highness the Duke of Aosta *22 March 1715 – 3 September 1730 His Royal Highness The Prince of Piedmont *3 September 1730 – 20 February 1773 His Majesty the King of Sardinia Category:1701 births Category:1773 deaths Category:People from Turin Category:Kings and Queens of Sardinia Category:Princes and Princesses of Savoy Category:Dukes and Duchesses of Savoy Category:Princes and Princesses of Piedmont Category:Burials at the Basilica of Superga",
 "title": "Charles Emmanuel III of Sardinia"
}