{
 "id": "275105",
 "text": "Sally Margaret Field (born November 6, 1946) is an American actress, singer, producer, director, and screenwriter. She has been in many movies. These include Norma Rae, Murphy's Romance, Forrest Gump, Steel Magnolias, The Amazing Spider-Man, and Lincoln. She has also acted in television programs and won many awards for her movies and acting. ==Personal life== Field married Steven Craig in 1968. The couple had two sons; Peter Craig, a novelist, and Eli Craig, an actor and director. Craig and Field divorced in 1975. Sally Field was romantically involved with Burt Reynolds for many years. During this time they co-starred in several movies. She married movie producer Alan Greisman in 1984. They had one son, Sam, in 1987. Field and Greisman divorced in 1993. Field has osteoporosis. She has become a vocal advocate for women's health issues, encouraging early diagnosis of such conditions through technology, such as bone density scans. ==Filmography== ===Movie=== Year Title Role Notes 1962 Moon Pilot Beatnik girl in lineup 1967 Mercy McBee 1976 Stay Hungry Mary Tate Farnsworth Sybil Sybil Dorsett 1977 Smokey and the Bandit Carrie / 'Frog' Nominated — Golden Globe Award for Best Actress - Motion Picture Musical or Comedy Heroes Carol Bell 1978 Mary Ellen Hooper Gwen Doyle 1979 Norma Rae Norma Rae Academy Award for Best Actress Golden Globe Award for Best Actress - Motion Picture Drama Best Actress Award (Cannes Film Festival) American Movie Award for Best Actress Kansas City Film Critics Circle Award for Best Actress Los Angeles Film Critics Association Award for Best Actress National Board of Review Award for Best Actress National Society of Film Critics Award for Best Actress New York Film Critics Circle Award for Best Actress Beyond the Poseidon Adventure Celeste Whitman 1980 Smokey and the Bandit II Carrie / 'Frog' 1981 Back Roads Amy Post Absence of Malice Megan Carter Nominated — Golden Globe Award for Best Actress - Motion Picture Drama 1982 Kiss Me Goodbye Kay Villano Nominated — Golden Globe Award for Best Actress - Motion Picture Musical or Comedy 1984 Places in the Heart Edna Spalding Academy Award for Best Actress Golden Globe Award for Best Actress - Motion Picture Drama 1985 Murphy's Romance Emma Moriarty Nominated — Golden Globe Award for Best Actress - Motion Picture Musical or Comedy 1987 Surrender Daisy Morgan Lethal Weapon KTLA Reporter (Uncredited) 1988 Punchline Lilah Krytsick 1989 Steel Magnolias M'Lynn Eatenton Nominated — Golden Globe Award for Best Actress - Motion Picture Drama 1991 Not Without My Daughter Betty Mahmoody Soapdish Celeste Talbert / Maggie 1993 Homeward Bound: The Incredible Journey Sassy Voice role Mrs. Doubtfire Miranda Hillard 1994 Herself Documentary Forrest Gump Mrs. Gump Nominated — BAFTA Award for Best Actress in a Supporting Role Nominated — Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role - Motion Picture Nominated — Blimp Award for Favorite Movie Actress 1996 Eye for an Eye Karen McCann Homeward Bound II: Lost in San Francisco Sassy Voice role 2000 Where the Heart Is Mama Lil Beautiful Directorial debut 2001 Say It Isn't So Valdine Wingfield 2003 Legally Blonde 2: Red, White and Blonde Rep. Victoria Rudd Going Through Splat: The Life and Work of Stewart Stern Herself Documentary 2006 Two Weeks Anita Bergman 2008 The Little Mermaid: Ariel's Beginning Marina Del Ray Voice role 2012 Aunt May Lincoln Mary Todd Lincoln African-American Film Critics Association Award for Best Supporting Actress Boston Society of Film Critics Award for Best Supporting Actress Dallas-Fort Worth Film Critics Association Award for Best Supporting Actress Nevada Film Critics Society Award for Best Supporting Actress New York Film Critics Circle Award for Best Supporting Actress Pending—Academy Award for Best Supporting Actress Pending—BAFTA Award for Best Actress in a Supporting Role Nominated—Broadcast Film Critics Association Award for Best Supporting Actress Nominated—Chicago Film Critics Association Award for Best Supporting Actress Nominated—Detroit Film Critics Society for Best Supporting Actress Nominated—Golden Globe Award for Best Supporting Actress – Motion Picture Nominated—Houston Film Critics Society for Best Supporting Actress Nominated—London Film Critics' Circle Award for Best Supporting Actress Nominated—Online Film Critics Society Award for Best Supporting Actress Nominated—Phoenix Film Critics Society Award for Best Supporting Actress Nominated—Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Nominated—Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role Nominated—Southeastern Film Critics Association Award for Best Supporting Actress Nominated—St. Louis Gateway Film Critics Association Award for Best Supporting Actress Nominated—Washington D.C. Area Film Critics Association Award for Best Ensemble Nominated—Washington D.C. Area Film Critics Association Award for Best Supporting Actress 2014 The Amazing Spider-Man 2 Aunt May ===Television === Year Title Role Notes 1965–6 Gidget Frances Elizabeth \"Gidget\" Lawrence 32 episodes 1966–7 Hey, Landlord Bonnie Banner 4 episodes 1967–70 Elsie Ethrington \"Sister Bertrille\" 82 episodes 1971 Maybe I'll Come Home in the Spring Denise \"Dennie\" Miller Hitched Roselle Bridgeman Marriage: Year One Jane Duden 1972 Home for the Holidays Christine Morgan 1973–4 Sally Burton 22 episodes 1976 Bridger Jennifer Melford Sybil Sybil Dorsett Primetime Emmy Award for Outstanding Lead Actress - Miniseries or a Movie 1977 Merry Christmas, George Bailey Mrs. Bailey/Narrator 1995 Bess Alcott Steed Garner Television miniseries Nominated — Primetime Emmy Award for Outstanding Lead Actress - Miniseries or a Movie Nominated — Golden Globe Award for Best Actress - Miniseries or Television Film Nominated — Screen Actors Guild Award for Outstanding Female Actor - Miniseries or Television Film 1998 From the Earth to the Moon Trudy Cooper; also directed Miniseries 1999 Iris Nominated — Primetime Emmy Award for Outstanding Lead Actress - Miniseries or a Movie Nominated — Screen Actors Guild Award for Outstanding Female Actor - Miniseries or Television Film 2000 David Copperfield Aunt Betsey Trotwood Nominated – Screen Actors Guild Award for Outstanding Female Actor - Miniseries or Television Film 2000–6 ER Maggie Wyczenski Recurring role Primetime Emmy Award for Outstanding Guest Actress - Drama Series (Won in 2001, Nominated 2003) Nominated — Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Drama Series (2000) 2002 Justice Kate Nolan Cancelled after 6 episodes 2005 Conviction 2006–11 Brothers & Sisters Nora Walker 109 episodes Primetime Emmy Award for Outstanding Lead Actress - Drama Series (Won in 2007, Nominated 2008–09) Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Drama Series (Won in 2009, Nominated 2008) Prism Award for Best Performance in a Drama Series Multi-Episode Storyline (2008) Nominated — Golden Globe Award for Best Actress - Television Series Drama (2008–09) Nominated — Satellite Award for Best Actress – Television Series Drama (2007–08) Nominated — People's Choice Award for Favorite Female TV Star (2008–09) ==References== ==Other websites== * Category:1946 births Category:Living people Category:American movie actors Category:American television actors Category:American Academy Award winning actors Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Actors from Pasadena, California Category:Singers from Pasadena, California Category:Writers from Pasadena, California",
 "title": "Sally Field"
}