{
 "id": "275188",
 "text": "A pion, π meson, or pi meson is a type of meson, made of one up quark (u) and one down antiquark (d̅). Mesons are a category of subatomic particles, which are composed of one quark, and one antiquark. There are six types of quarks (called flavours) but only two flavours go together to make a pion. These flavours are called up and down. Quarks have charge, so two quarks of the same flavour (both up or both down) make a neutral pion. But when the two quarks have different flavours (up and down), the pion will have a charge. This charge is positive when an up quark pairs with a down antiquark. The charge is negative when a down quark pairs with an up antiquark. Pions do not exist for a long time. (On average, charged pions exist for around 26 nanoseconds; neutral pions last a tiny fraction of this). Pions are significant to our lives because they are one of the ways for strong force interactions to take place between nucleons like the protons and neutrons of ordinary matter. These interactions hold the nucleus together. Pions are the lightest hadrons (particles made up of quarks) and pions with a positive or negative charge are the mesons with the longest mean lifetime (the average time that passes before they decay into leptons). == Three Types of Pions == The three types of pion have the Greek letter pi in their symbols: ::π+ for the positively charged pion ::π– for the negatively charged pion, and ::π0 for the neutral pion. The (superscript) +, –, or 0 simply refers to the (electromagnetic) charge of the pion. Up quarks have a charge of + and down antiquarks have a charge of +, so π+ has charge of +1 (like a proton). Antiparticles have charge opposite to their particles, so up antiquarks have a charge of − and down quarks have a charge of −. This means that π− has charge of −1 (like an electron). Because π0 pairs quarks of the same flavour with their antiquarks, both up quark (+) paired with up antiquark (−) and down quark (+) paired with down antiquark (−) leave it with zero charge (like a neutron). Quarks and antiquarks also have a different kind of charge called color, unrelated to electromagnetic charge. This comes from the strong interaction that holds the quarks together. As in all mesons, the color charges in a pion must be equal and opposite: blue with anti-blue, green with anti-green, or red with anti-red. The effect of these color–anticolor pairings is that the pion's color charge is colorless (like a neutron is neutral). At the smallest distances, typically within an atomic nucleus, a small effect of the color charge remains and acts as the nuclear force that holds the nucleus together. Within the nucleus, then, virtual pions (and other virtual mesons) are exchanged between nucleons (protons and neutrons), pulling them together. Antiquarks are antimatter, so they will annihilate a quark of the same flavour that is near enough. This means that the quark and the antiquark will turn one another into energy. == Force Carriers == Force-carriers are particles that are responsible for the action of forces, such as electromagnetism. Just as photons are responsible for electromagnetic force, so mesons are responsible for some of the lower energy (residual) strong force interactions that occur between nucleons. (Strong force is also known as nuclear force or residual strong force when its action is between nucleons.) At an even smaller level, gluons are responsible for the strong force interactions between quarks. == Pion Decay == Decay of charged pions always produces leptons, like electrons. ::π+ almost always decays into one muon, and one muon antineutrino. ::π– almost always decays into one antimuon and one muon neutrino. A neutral pion, π0, will usually decay into two highly energized photons. === Other Forms of Pion Decay === However, there is some probability (from <0.1% to 1.2%) involved with the decay of some pions, as they can also decay into different forms. For π+, the second most likely decay product is one positron (an anti-electron) and one electron neutrino. π– will sometimes decay into one electron and one electron antineutrino. π0 will sometimes decay into one highly energized photon, one electron, and one positron. (Keep in mind that positrons and electrons can annihilate each other, and this annihilation produces highly energized photons). === Decay Due to Weak Force === Since the decay of pions is due to weak force, yet another force carrier is introduced. During the decay, a W+ boson is created, which lasts for 3x10−25 seconds. After this incredibly short amount of time, the W+ boson will decay into the leptons that the pion would naturally decay to. However, it is important to draw this distinction, as it includes weak force. == References == Category:Subatomic particles",
 "title": "Pion"
}