{
 "id": "275392",
 "text": "Victor Amadeus III (Vittorio Amadeo Maria; 26 June 1726–16 October 1796) was King of Sardinia from 1773 until his death. Although he was politically conservative, he carried out numerous administrative reforms until declaring war on revolutionary France in 1792. ==Early life== Born at the Royal Palace of Turin, he was a son of Charles Emmanuel III of Sardinia and his second wife Polyxena of Hesse-Rotenburg. He was styled as the Duke of Savoy from birth. As a young prince, he surrounded himself with intellectuals and stayed far from public life. ==Marriage== He married Maria Antonia of Spain (1729–1785), youngest daughter of Philip V of Spain and Elisabeth Farnese, on 31 May 1750 at Oulx and later had twelve children. He had a loving relationship with his wife who exerted little influence over her husband]. The marriage had been arranged by Maria Antonia's half brother, the ruling Ferdinand VI of Spain. ==King of Sardinia== When Victor Amadeus came to the throne in 1773 he started working on bureaucratic and military aspects of the reign. He was suspicious of anything innovative. At the outbreak of the French Revolution, Victor Amadeus III allowed his two son's in law, the Counts of Artois, Provence and the Princesses Marie Adélaïde and Victoire to stay in his kingdom under his protection. He died at the Castle of Moncalieri having suffered an attack of apoplexy. He died leaving an economically damaged kingdom and two key provinces–Savoy and Nice–devastated having suffered at the hands of French revolutionary forces. He was buried at the Basilica of Superga in Turin. ==Issue== # Charles Emmanuel IV of Sardinia (24 May 1751–6 October 1819) married Princess Marie Clotilde of France in 1773, no issue. # Maria Elisabetta Carlotta of Savoy (16 July 1752–17 April 1755) died in infancy. # Maria Giuseppina of Savoy (2 September 1753–13 November 1810) married Louis Xavier, Count of Provence in 1771, no issue. # Amedeus Alexander of Savoy (5 October 1754–29 April 1755) died in infancy. # Maria Teresa of Savoy (31 January 1756–2 June 1805) married Charles, Count of Artois in 1773, had issue. # Maria Anna of Savoy (17 December 1757–11 October 1824) married Prince Benedetto of Savoy in 1775, no issue. # Victor Emmanuel I of Sardinia (24 July 1759–10 January 1824) married Archduchess Maria Theresa of Austria-Este in 1789, had issue. # Maria Cristina Ferdinanda of Savoy (21 November 1760–19 May 1768) died in infancy. # Maurizio of Savoy (13 December 1762–1 September 1799) died unmarried of malaria. # Maria Carolina of Savoy (17 January 1764–28 December 1782) married Antony, Electoral Prince of Saxony in 1781, no issue. # Charles Felix of Sardinia (6 April 1765–27 April 1831) married Princess Maria Cristina of Naples and Sicily in 1807, no issue. # Giuseppe of Savoy (5 October 1766–29 October 1802) died unmarried of malaria. ==Titles, styles, honours and arms== ===Titles and styles=== *26 June 1726–20 February 1773 His Royal Highness the Duke of Savoy *20 February 1773–16 October 1796 His Majesty the King of Sardinia ==Other websites== Category:1726 births Category:1796 deaths Category:Dukes and Duchesses of Savoy Category:People from Turin Category:Kings and Queens of Sardinia Category:Burials at the Basilica of Superga Category:Princes and Princesses of Savoy Category:Deaths from stroke",
 "title": "Victor Amadeus III of Sardinia"
}