{
 "id": "275427",
 "text": "The thallium halides come in two oxidation states: monohalides, where thallium has the oxidation state +1, and trihalides, where thallium generally has oxidation state +3. == Monohalides == The monohalides all contain thallium with oxidation state +1. *Thallium(I) fluoride, a white crystalline solid. It is soluble in water, unlike the other thallium monohalides.U.Haussermann, P.Berastegui, S.Carlson, J.Haines, and J.Leger Angewandte Chemie, 31, pp. 4760 (2001) *Thallium(I) chloride, sensitive to light. It is a white crystalline solid. *Thallium(I) bromide, sensitive to light. A pale yellow crystalline solid. *Thallium(I) iodide, at room temperature it is a yellow crystalline solid. At higher temperatures the colour changes to red. == Trihalides == Thallium(III) halides are very rare. Some of them are unstable. The thallium(III) iodide does not form. They are quite different to aluminium, gallium and indium trihalides. *Thallium(III) fluoride, also known as thallic fluoride, is made of thallium in its +3 oxidation state and fluoride ions. It is made by reacting thallium(III) oxide with bromine trifluoride, fluorine, or sulfur tetrafluoride at a warm temperature. *Thallium(III) chloride, also known as thallic chloride, is made of thallium in its +3 oxidation state and chloride ions. It disproportionates above 40°C, making thallium(I) chloride and chlorine. It is made by reacting thallium(I) chloride with chlorine in an organic solution. *Thallium(III) bromide, also known as thallic bromide, is made of thallium in its +3 oxidation state and bromide ions. It disproportionates at a low temperature to thallium(I) bromide and bromine. It can be made by reacting thallium(I) bromide with bromine in water or an organic solution. *Thallium(I) triiodide, a black crystalline solid. It does not contain thallium(III), but has the same structure as CsI3 containing the linear I3- ion. == References == Category:Thallium compounds",
 "title": "Thallium halide"
}