{
 "id": "275645",
 "text": "The phylum Bacteroidetes is a large, diverse group of bacteria. It has three large classes that are found on every habitat on Earth, including in soil, sediments, sea water, the guts, and the skin of animals. The group is made of around 7000 sub-groups. The sub-groups are divided into 6 main groups: Bacteroidia, Chitinophagia, Flavobacteria, Sphingobacteria, Saprospiria and Cytophagia. Bacteroidetes have many roles but mainly break down humus (dead organic matter) such as proteins and complicated sugars into smaller molecules. Members of Bacteroidetes can be both helpful and unhelpful to humans and plants. Some members are involved in metabolism (the natural way of changing chemicals) and decompostion (the breaking down of particles). On the other hand, some members are pathogenic, they cause disease in humans. Members of the genus Bacteroides are 'good' pathogens. Members of the other two classes are rarely pathogenic to humans. == Bacteroidetes in humans == The gastrointestinal tract (or digestive tract) in humans is made up of the mouth, pharnx, esophagus, stomach, small intestine, large intestine and anus. This is the path that food enters the body and waste matter leaves the body. The majority of microbes in the human body live in this gastrointestinal tract, or the intestines. Bacteroidetes can be found in all of the different parts of the gastrointestinal tract, even though the conditions in each part can be very different from each other. Bacteroidetes have many functions in humans but their main role is breaking down molecules of food in the small intestine. They break down strong molecules like plant cell walls that human cells find hard to digest. The products of this breakdown reaction are absorbed through the intestine and are used by humans as a source of energy. Bacteroidetes help humans to get energy from strong material and are important for gut health. The number of Bacteroidetes can be used to indicate the health of the gut. Low numbers can be related with obesity. Higher numbers are related to bowel syndrome and diabetes. == Bacteroidetes as Pathogens == Although many members of Bacteroidetes are needed for a healthy gut in humans, some can act as pathogens. Members of the Bacteroides group are useful bacteria that live in the gut. However, if the intestine is damaged, they would be able to escape and can cause infections in other parts of the body. Bacteroides can cause infections in the gastrointestinal tract and the appendix. Bacteroides are tolerant to many antibiotics and can share this tolerance with other dangerous bacteria. It can be treated with certain antibiotics but the problem of tolerance is troubling. == Bacteroidetes in soil == Members of Bacteroidetes are also found in soil such as members of the Flavobacteria and Sphingobacteria classes. They have been found in many different types of soil including farm soil, greenhouse soil and untouched soil. Bacteroidetes are one of the most common bacteria found in the rhizosphere (the area surrounding a plant’s roots). They can also be found on the surface of leaves. Bacteroidetes have a similar role in plants. They break down organic matter, such as proteins, surrounding the roots of a plant into simpler forms that can be taken up by the plant and used as energy. As in humans, Bacteroidetes can also cause disease in plants. Flavobacterium johnsoniae is a member of Bacteroidetes which causes decay of plants and vegetables. Some strains of Flavobacterium cause disease in red plants and algae. Bacteroidetes can also break down cell walls, damaging plants. == Bacteroidetes in water == Bacteroidetes can also be found in marine environments such as seas, oceans and lakes. They are the third most common type of bacteria found in the ocean. They are found on surfaces (living and non-living), rocks and minerals, corals and algae. They are an important part of floating bacterial life (bacterioplankton) in marine environments. Bacterioplankton are involved in the recycling of important elements in marine ecosystems. Bacteroidetes break down large organic matter in marine environments. == References == \\---- Category:Gram-negative bacteria",
 "title": "Bacteroidetes"
}