{
 "id": "275674",
 "text": "UNIQLO is a Tokyo fashion and clothing company. It is a fast growing company, one of the five biggest specialty fashion retailers in the world. The company makes T-shirts, jeans, and casual wear for both women and men. It is owned by Fast Retailing, a Yamaguchi based company. ==Locations== UNIQLO has locations in 25 countries. The majority of shops and primary market is Japan. Shops are also in: Mainland China, Hong Kong, Taiwan, Korea, Singapore, Malaysia, Thailand, Philippines, Indonesia, Australia, Vietnam, India, USA, Canada, UK, France, Germany, Belgium, Spain, Sweden, The Netherlands, Denmark and Italy.(“Group Outlets | FAST RETAILING CO., LTD.,” 2021) Countries with UNIQLO StoresUniqlo Europe Store Locator Country Cities Sydney, Melbourne, Brisbane, Adelaide, Canberra, Gold Coast, Perth Antwerp, Brussels Toronto, Vancouver, Montreal, Calgary, Edmonton, Ottawa Copenhagen Paris, Lyon, Marseille, Annecy, Bordeaux, Lille, Montpellier, Nantes, Nice, Rennes, Strasbourg, Toulouse Berlin, Cologne, Düsseldorf, Hamburg, Stuttgart Delhi, Mumbai Jakarta, Medan, Bandung, Surabaya, Makassar, Denpasar Milan, Rome Luxembourg City Kuala Lumpur, Kuching, Johor Bahru Amsterdam, Rotterdam, The Hague Warsaw Barcelona, Madrid Stockholm, Gothenburg Bangkok, Chiang Mai, Phuket London, Liverpool, Manchester, Edinburgh, Oxford Los Angeles, New York, San Francisco, Boston, Chicago, Dallas, Honolulu, Houston, Orlando, Philadelphia, Seattle, Washington D.C. ==History== The company began in Yamaguchi Prefecture, Japan in 1949. It has grown steadily since then. In 1984, Fast Retailing opened the first UNIQLO shop in nearby Hiroshima Prefecture. Since then it opened an online business in 2000. It then became international with shops in London (2001); Shanghai (2002); then, Korea, the US in the SoHo fashion district of Manhattan in New York, and Hong Kong (2005). Since then it expanded into France (2007), Singapore (2009), and Russia (2010). Recently, on 27th September, they opened \"BICQLO\", which is a collaboration shop with Bic Camera.(2012) ==Product== One of UNIQLO’s main product is HEATTECH. These clothes are sold in many countries. It keeps people warm, so it is useful in winter. It is thin and comfortable, so people can wear many layers of clothing easily. Also it has some good functions: it keeps in heat, and dries quickly. HEATTECH material has odor control, is anti-static, and stretches. Moreover, there are a variety of HEATTECH products, including: T-shirts, turtlenecks, underwear, leggings, and socks. Furthermore, heattech jeans have gotten attention for keeping people warm. ==Hiring== UNIQLO announced that it is changing the way it hires new workers. Large companies in Japan usually hire new college graduates once a year. UNIQLO is changing to hiring people all through the year. They are also open to hiring people who have not yet graduated, people who graduated several years ago, and people with other jobs. UNIQLO is also a gateway to Japanese products in many countries. ==References== ==Other websites== * UNIQLO Twitter * Facebook * UNIQLO official website * UNIQLO UK official website Category:Manufacturing companies of Japan Category:Fashion houses Category:1949 establishments in Asia Category:1940s establishments in Japan Category:Retail companies of Japan Category:Companies based in Tokyo",
 "title": "UNIQLO"
}