{
 "id": "275740",
 "text": "Suzy Spafford (born 1945 in Toledo, Ohio) is an American cartoonist. She is best known for drawing animal characters.San Diego Union Tribune, March 27, 1997San Diego Union Tribune, April 27, 1999 Her Suzy's Zoo picture book is her most successful work. The book's characters have been made into greeting cards, stickers, stationery and calendars. The products are sold in thousands of stores all over the world.San Diego Union Tribune, August 8, 1999 She has also written several dozen books for children, including the Tales from Duckport series.Playthings, May 31, 2001 Her pictures have been attracted by a lot of people in San Diego since 1967. She created her own greeting card company, Suzy's Zoo Studios, in 1968. ==Suzy's Zoo== ===Characters=== *\"Witzy\", a baby duck, is the main character of Suzy's Zoo. He was based on Suzy's little brother, Johnny. *\"Boof\" is Witzy's best friend; a teddy bear. He is an old teddy bear so he is fixed several times by Witzy’s mom. *\"Lulla\" is a fashionable and tidy stuffed toy rabbit. She has a wind-up key on her back, and when Witzy turns the key, she begins to sing a sleepy song. *\"Ellie Funt\" is a shy stuffed toy elephant. She is made from the old bathrobe by Witzy’s mom. *\"Patches\" is a brave stuffed toy giraffe and he follows Witzy at night so Patches is not afraid of the dark. He is always full of energy and impishness. *\"Tickle\" is a ladybug who lives in the backyard. By the way, Witzy calls all ladybugs in his backyard \"Tickle\". *\"Peek-a-boo\" is a small snail live in the backyard. She likes to play hide-and-seek with her friends. *\"Zoom-Zoom\" is Witzy’s favorite grasshopper. He is always hopping in the backyard. *\"Teeter & Totter\" are twin turtles but they have a different color shell. Teeter is a girl and Totter is a boy. They are always together when they play in the backyard. ==References== Category:1945 births Category:People from Toledo, Ohio Category:Living people Category:American cartoonists",
 "title": "Suzy Spafford"
}