{
 "id": "27589",
 "text": "The National Security Agency (NSA) is part of the US government and is responsible for the global monitoring, collection, and processing of information and data for domestic and foreign intelligence and counterintelligence purposes, and specializes in a discipline known as signals intelligence (SIGINT). The agency is also tasked with protecting U.S. communications networks and information systems. NSA was started in 1952, and its main office is in Maryland. Its stated goal is to protect the US people by *Worldwide \"earsdropping,\" secretly listening to what people are saying in other countries. It monitors, collects, decodes, translates and analyses information and data. That is known as signals intelligence (SIGINT). * Protecting the US from eavesdropping and SIGINT spying by foreign governments and agencies, called \"penetration and network warfare.\"Nakashima, Ellen. January 26, 2008. Bush order expands network monitoring. The Washington Post. Retrieved February 9, 2008. The agency does so by clandestine (secret) means,Executive Order 13470 — 2008 Amendments to Executive Order 12333, United States Intelligence Activities, July 30, 2008 (PDF) such as bugging electronic systems,Malkin, Bonnie. NSA surveillance: US bugged EU offices. The Daily Telegraph, June 30, 2013 and sabotaging their computer networks with viral software.Ngak, Chenda. NSA leaker Snowden claimed U.S. and Israel co-wrote Stuxnet virus , CBS, July 9, 2013Bamford, James. The Secret War, Wired Magazine, June 12, 2013. ==Related pages== * Central Intelligence Agency * Federal Bureau of Investigation * Venona project == References == * Official NSA website * NSA for kids == Further reading == * Bamford, James, The Puzzle Palace, Penguin Books, . * Bamford, James, The Shadow Factory, Anchor Books, 2009, . * Church Committee, Intelligence Activities and the Rights of Americans: 1976 US Senate Report on Illegal Wiretaps and Domestic Spying by the FBI, CIA and NSA, Red and Black Publishers (May 1, 2008). * * Aid, Matthew, The Secret Sentry: The Untold History of the National Security Agency, 432 pages, , Bloomsbury Press (June 9, 2009). * Shaker, Richard J. \"The Agency That Came in from the Cold.\" (Archive, Archive #2) Notices. American Mathematical Society. May/June 1992 pp. 408–411. * * \"National Security Agency Releases History of Cold War Intelligence Activities.\" George Washington University. National Security Archive Electronic Briefing Book No. 260. Posted November 14, 2008. * Category:1952 establishments in the United States",
 "title": "National Security Agency"
}