{
 "id": "276171",
 "text": "Jacques-Yves Cousteau known as Jacques Cousteau (11 June 1910 - 25 June 1997) was a French naval officer, explorer, ecologist, filmmaker, innovator, scientist, photographer, author and researcher who studied the sea and all forms of life in water. He helped create the aqua-lung, helped marine conservation and was a member of the Académie française. He was also known as \"le Commandant Cousteau\" or \"Captain Cousteau\". == Life == === Early life === Cousteau was born on June 11,1910, in Saint-André-de-Cubzac, Gironde, to Daniel and Élisabeth Cousteau. He had one brother, Pierre-Antoine. Cousteau attended Collège Stanislas in Paris. In 1930, he entered the École navale and graduated as vnvmvmcnskda gunnery officer. After an automobile accident cut short his career in naval aviation, Cousteau changed to studying the sea. Dudndmd In Toulon, where he was serving on the Condorcet, Cousteau carried out his first underwater experiments, thanks to his friend Philippe Tailliez who in 1936 lent him some Fernez underwater goggles.The Cousteau Foundation page about \"The Captain\" confirms Cousteau biography as written here. Cousteau also belonged to the information service of the French Navy, and was sent on missions to Shanghai and Japan (1935–1938) and in the USSR (1939). On 12 July 1937 he married Simone Melchior (1919-1990), with whom he had two sons, Jean- Michel (born 1938) and Philippe (1940–1979). His sons took part in the adventures of the Calypso. In 1991, after his wife Simone's death from cancer, he married Francine Triplet. They already had a daughter Diane Cousteau (born 1980) and a son Pierre-Yves Cousteau (born 1982), born during Cousteau's marriage to his first wife. ==Death== On the morning of 25 June 1997, Jacques- Yves Cousteau died at his home in Paris, aged 87 from a heart attack. He was buried in the family vault at Saint-André-de-Cubzac in France. A street was named \"rue du Commandant Cousteau\" in a street which runs near his native house, where a commemorative plaque was affixed. ==Honors== During his lifetime, Jacques-Yves Cousteau received these awards: * Commandeur de la Légion d'Honneur * Grand-Croix de l'Ordre national du Mérite * Croix de guerre 1939–1945 * Officier de l'Ordre du Mérite Maritime * Commandeur de l'Ordre des Arts et des Lettres * Honorary Companion of the Order of Australia. * National Geographic Society's Special Gold Medal in 1961http://blogs.nationalgeographic.com/blogs/news/chiefeditor/2010/06/jacques- cousteau-would-be-hear.html * BAFTA Academy Fellowship Award - a lifetime achievement award for his movies ==Related pages== *List of ecologists == References == ==Other websites== * Category:French biologists Category:French movie directors Category:French movie producers Category:Writers from Nouvelle-Aquitaine Category:Members of the Académie française Category:Oceanographers Category:Ecologists Category:Order of Australia Category:People from Gironde Category:French photographers Category:Television directors Category:Television producers Category:1910 births Category:1997 deaths",
 "title": "Jacques Cousteau"
}