{
 "id": "276237",
 "text": "The Society of the Muslim Brothers ( ), better known as the Muslim Brotherhood ( ) is a transnational Sunni Islamist organization founded in Egypt by Islamic scholar and schoolteacher Hassan al-Banna in 1928. Al-Banna's teachings spread far beyond Egypt, influencing today various Islamist movements from charitable organizations to political parties. ==Goals== The Muslim Brotherhood's stated goal is to instill the Qur'an and Sunnah as the \"sole reference point for ... ordering the life of the Muslim family, individual, community ... and state\". Al-Banna expressed his desire for Egypt to return to Islamic values to revitalize the people's moral and social life. The vision of the Brotherhood was to create a comprehensive system of for governance where religion and the state functioned together, based on Sharia law. Since it was created, in 1928 the movement has officially opposed violent means to achieve its goals, with some exceptions such as in the Israeli-Palestinian conflict or to overthrow secular Ba'athist rule in Syria (see 1982 Hama massacre). This position has been questioned, particularly by the Egyptian government, which accused the group of a campaign of killings in Egypt after World War II.Chamieh, Jebran, Traditionalists, Militants and Liberal in Present Islam, Research and Publishing House, 1994?, p.140 ==In Egypt== The Muslim Brotherhood was established as a lay organisation, not led by religious clerics, unlike other Islamist groups. The group consisted of Egyptians who had moved to the city looking for work, as well as students who had been newly educated in state- funded universities. The Brotherhood served as an outlet for young people who were disappointed with the political system, and were seeking a community and philosophical guidance on living in an increasingly modern society. The Muslim Brotherhood is currently banned in Egypt. People have been arrested because they participated in the group. To circumvent this ban, supporters of the group often run for office as independent candidates. The fifth president of Egypt, Mohamed Mohamed Morsi Eissa al-Ayyat, was a member of the Muslim Brotherhood. He was elected in 2012, but overthrown in 2013 by the current president of Egypt, General Abdel Fattah el-Sisi. ==Outside Egypt== Outside Egypt, the group's political activity is more traditional and conservative. Inside Egypt, the group is modernist and wants reforms to happen. In Kuwait, for example, the Muslim Brotherhood says that women should not have a right to vote in elections.Roy, Olivier, Globalized Islam, Columbia University Press, 2004, p.67 The Brotherhood condemned terrorism and the 9/11 attacks. Whether the group has ties to terrorist organisations is disputed. The question whether and how to use violence has also led to disputes inside the movement. At times, those in favour of using violence split from the main group and created their own groups. Examples of such groups are Al-Gama'a al-Islamiyya (The Islamic Group) and Al Takfir Wal Hijra (Excommunication and Migration).The Salafist Movement, Frontline (PBS) === Hamas === The Muslim Brotherhood first established a branch in Jerusalem, Palestine, in 1946, after the Great Revolt when Palestinians protested against the ongoing Palestine Mandate held by Britain. By 1948, there were 38 autonomous branches of the Muslim Brotherhood in Palestine. Between 1946 and 1987, activism by the Brotherhood was largely limited to social improvements and the establishment of social institutions. For example, the Islamic Centre was established and used charitable donations by Muslims (zakat) to organise a mosque, medical clinic, sports clubs. These social improvements were also aimed at providing for Palestinians who were not well served by the PLO, the rival Palestinian resistance group. Hamas as an organisation, created out of the Muslim Brotherhood, was declared on December 14th 1987, 5 days after the first collision between an Israeli truck driver and Palestinian civilians, four of which were killed. In August of 1988, Hamas issued its own charter. The charter declared that Hamas is a wing of the Muslim Brotherhood, and that it is also a \"distinguished Palestinian movement\". == Influences == Among the Brotherhood's more influential members was Sayyid Qutb. Qutb was the author of one of Islamism's most well-known books, Milestones. The book called for the restoration of Islam by re-establishing Sharia law as the governing principle. He also calls for the use of Jihad for abolishing the secular organisations and authorities throughout the Muslim world. Although Qutb was once an influential member of the Brotherhood, it is clear throughout Milestones that his ideas on the use of non-violence no longer aligned with those of the organisationQutb, Sayyid, Milestones, (1981) p.55, 62 Qutb, Sayyid, Milestones, (1981) p.11, 19 While studying at university, Osama bin Laden claimed to have been influenced by the religious and political ideas of several professors with strong ties to the Muslim Brotherhood including both Sayyid Qutb and his brother Muhammad Qutb. However, once Al Qaeda was fully organized, they denounced the Muslim Brotherhood's reform through nonviolence and accused them of \"betraying the cause of Islam and abandoning their 'jihad' in favour of forming political parties and supporting modern state institutions\".\"Muslim Brotherhood vs Al Qaeda\" January 19, 2010\"MB Chief Criticism\" Dec. 30 2007 == Funding == The Brotherhood is financed by contributions from its members, who are required to allocate a part of their income to the movement. Some of these contributions are from members who live in oil-rich countries.In Search Of Friends Among The Foes U.S. Hopes to Work With Diverse Group ==References== Category:Islamic organizations based in Egypt Category:1928 establishments Category:20th-century establishments in Egypt",
 "title": "Muslim Brotherhood"
}