{
 "id": "276244",
 "text": "Egyptian Islamic Jihad (EIJ), (EIJ), formerly called simply Islamic Jihad الجهاد الإسلامي and Liberation Army for Holy Sites.Global Briefings, Issue 27, September 1998, “Osama Bin Laden tied to other fundamentalists”. originally called al-Jihad,\" and then \"the Jihad Group\", or \"the Jihad Organization\"Wright, Lawrence, Looming Tower, Knopf, 2006, p.123 is an Egyptian terrorist group based on an extreme interpretation of Islam. It has been active since the late 1970s. It is under worldwide embargo by the United Nations as a group linked to al-Qaeda.Affiliates of al-Qaeda and the Taliban, United Nations Security Council Committee 1267 It is also banned by several governments around the world, including that of the Russian Federation.‘Terror’ list out; Russia tags two Kuwaiti groups , Arab Times, February 2003 Since 1991 it has been led by Ayman al-Zawahiri, who is now the leader of al-Qaeda. According to Zawahiri, the EIJ was \"different from the Takfir wal Hijra group as we do not consider people infidels because of their sins. And we are different from the Muslim Brotherhood because sometimes they do not oppose the government\".al-Zayat, Montasser 2002. The road to al-Qaeda. The organization's original main goal was to overthrow the Egyptian government and replace it with an Islamic state based on the way it thought Islam should be. Later it broadened its aims to include attacking the United States and Israel, and other interests in Egypt and abroad. Islamic Jihad was responsible for the assassination of Anwar Sadat in 1981. Sadat's Sinai treaty with Israel, which recognized the Jewish state, made them very angry. == Link with Al Qaeda == In June 2001, Al Qaeda and Egyptian Islamic Jihad, which had been associated with each other for many years, merged into 'Qaeda al- Jihad'.Lawrence Wright 2002. The New Yorker. The Man Behind Bin Laden :\"...the members of Islamic Jihad and its guiding figure, Ayman al-Zawahiri, have provided the backbone of [al-Quaeda's] leadership. According to officials in the C.I.A. and the F.B.I., Zawahiri has been responsible for much of the planning of the terrorist operations against the United States\". == Related pages == * Palestinian Islamic Jihad == References == Category:Islamic terrorism Category:Rebel militia groups in Africa Category:1970s establishments in Egypt Category:Islamic organizations based in Egypt Category:Islamist militant groups",
 "title": "Egyptian Islamic Jihad"
}