{
 "id": "276367",
 "text": "\"One Sweet Day\" is a song by American singer-songwriter Mariah Carey and American R&B; boy band Boyz II Men. The song was released on November 14, 1995, as the second single from the former's fifth studio album, Daydream (1995) by Columbia Records. The artists co-wrote the song with Walter Afanasieff, who co-produced it with Carey. Lyrically, the song speaks about the death of a loved one and misses them, and finally about seeing the person in heaven. The artists wrote the song about specific people in their lives, being inspired by sufferers of the AIDS epidemic, which was a topic at the time. ==Music video== The music video for \"One Sweet Day\" was filmed in February 1995, and features snippets of Carey and Boyz II Men in the studio and recording the song. The busy schedule of both Carey and Boyz II Men did not allow time for them to shoot a proper video. == Chart performance == \"One Sweet Day\" debuted at number one on the US Billboard Hot 100 chart dated December 2, 1995, with sales of 204,000 units. Columbia distributed free copies to stores, where it was sold for as low as 49 cents. It became Carey's tenth number one single on the Billboard chart and Boyz II Men's fourth number one. he song remained at the peak for a record-breaking 16 consecutive weeks, from December 2, 1995, to March 16, 1996. It became a record for being the only song to stay at number one on the chart for 16 weeks until 2017, when the record was tied by Luis Fonsi and Daddy Yankee's \"Despacito\", featuring Justin Bieber. The record would remain until Lil Nas X's \"Old Town Road\", featuring Billy Ray Cyrus, broke the record in 2019, spending nineteen weeks on top the Billboard Hot 100. It still remains the only number one debut to spend sixteen continual weeks at number one. == Track listing and formats == * Worldwide Cassette CD single # \"One Sweet Day\" (Album Version) – 4:41 # \"One Sweet Day\" (Live Version form Fantasy: Mariah Carey at Madison Square Garden) – 5:08 * Japanese CD maxi-single # \"One Sweet Day\" (Album Version) – 4:42 # \"One Sweet Day\" (Live Version from Fantasy: Mariah Carey at Madison Square Garden) – 5:10 # \"Open Arms\" – 3:30 * UK CD maxi-single #1 # \"One Sweet Day\" (Album Version) – 4:41 # \"One Sweet Day\" (Sweet A Cappella) – 4:52 # \"One Sweet Day\" (A Cappella) – 4:48 # \"One Sweet Day\" (Chucky's Remix) – 4:51 # \"One Sweet Day\" (Live Version from Fantasy: Mariah Carey at Madison Square Garden) – 5:08 * UK CD maxi-single #2 # \"One Sweet Day\" (Album Version) – 4:44 # \"Fantasy\" (Def Drums Mix) – 4:01 # \"Joy to the World\" (Celebration Mix) – 7:58 # \"Joy to the World\" (Club Mix) – 7:35 * US CD maxi-single # \"One Sweet Day\" (Album Version) – 4:41 # \"One Sweet Day\" (Sweet A Cappella) – 4:52 # \"One Sweet Day\" (A Cappella) – 4:48 # \"One Sweet Day\" (Chucky's Remix) – 4:51 # \"One Sweet Day\" (Live Version) – 5:08 # \"Fantasy\" (Def Drums Mix) – 4:00 * One Sweet Day EP # \"One Sweet Day\" (Chucky's Remix) – 4:51 # \"One Sweet Day\" (Sweet A Cappella) – 4:52 # \"One Sweet Day\" (A Cappella) – 4:49 # \"One Sweet Day\" (Live at Madison Square Garden - October 1995) – 5:09 == Credits and personnel == Credits adapted from the Daydream liner notes. * Mariah Carey – co-production, songwriting (music and lyrics), vocals * Walter Afanasieff – co-production, songwriting (music) * Nathan Morris – songwriting (lyrics), vocals * Wanya Morris – songwriting (lyrics), vocals * Shawn Stockman – songwriting (lyrics), vocals * Michael McCary – songwriting (lyrics), vocals == Charts == === Weekly charts === Chart (1995–1996) Peak position Benelux Airplay (Music & Media) 3 Brazil (ABPD) 2 British Isles Airplay (Music & Media) 3 Canada Retail Singles (The Record) 2 Canada Contemporary Hit Radio (The Record) 1 Canada (The Record) 3 DACH Airplay (Music & Media) 6 Denmark (Tracklisten) 5 European Hot 100 Singles (Music & Media) 6 Europe Adult Contemporary (Music & Media) 2 European Hit Radio (Music & Media) 2 France Airplay (Music & Media) 1 Germany (Official German Charts) 25 Hungary Airplay () 9 Iceland (Íslenski Listinn Topp 40) 20 Italy (Musica e Dischi) Set \"Tipo\" on \"Singoli\". Then, in the \"Artista\" field, search \"Mariah Carey\". 23 Italy Airplay (Music & Media) 4 Japan (Oricon) 87 Lithuania (M-1) See LW column. 24 Netherlands Airplay (BDS) 3 Panama (UPI) 9 Poland Airplay (Music & Media) 10 Scandinavia Airplay (Music & Media) 2 Spain Airplay (Music & Media) 3 UK Airplay (BDS) 8 US Cash Box Top 100 Pop Singles 1 US Cash Box Top 100 Urban Singles 1 US Adult Contemporary (Radio & Records) 1 US CHR/Pop (Radio & Records) 1 US CHR/Rhythmic (Radio & Records) 1 US Hot AC (Radio & Records) 1 US Urban (Radio & Records) 2 US Urban AC (Radio & Records) 1 Zimbabwe (ZIMA)* Zimbabwe. Kimberley, C. Zimbabwe: singles chart book. Harare: C. Kimberley, 2000 3 Chart (2002) Peak position US Hot Singles Sales (Billboard) 35 === Year-end charts === Chart (1995) Position Australia (ARIA) 32 Netherlands (Dutch Top 40) 178 Netherlands (Single Top 100) 87 New Zealand (Recorded Music NZ) 23 Sweden (Sverigetopplistan) 92 UK Singles (OCC) 60 US Adult Contemporary (Radio & Records) 68 US CHR/Rhythmic (Radio & Records) 61 US Hot AC (Radio & Records) 82 Chart (1996) Position Australia (ARIA) 40 Belgium (Ultratop 50 Flanders) 83 Belgium (Ultratop 50 Wallonia) 48 Canada Top Singles (RPM) 12 Canada Adult Contemporary (RPM) 14 European Hot 100 Singles (Music & Media) 28 France (SNEP) 59 Netherlands (Dutch Top 40) 37 Netherlands (Single Top 100) 34 New Zealand (Recorded Music NZ) 32 Sweden (Sverigetopplistan) 86 Switzerland (Schweizer Hitparade) 49 US Billboard Hot 100 2 US Adult Contemporary (Billboard) 3 US Adult Top 40 (Billboard) 17 US Dance Singles Sales (Billboard) 28 US Hot R&B;/Hip-Hop Songs (Billboard) 15 US Mainstream Top 40 (Billboard) 10 US Rhythmic (Billboard) 11 US Adult Contemporary (Radio & Records) 4 US CHR/Pop (Radio & Records) 19 US CHR/Rhythmic (Radio & Records) 15 US Hot AC (Radio & Records) 17 US Urban (Radio & Records) 49 US Urban AC (Radio & Records) 18 === Decade-end charts === Chart (1990–1999) Position US Billboard Hot 100 1 === All-time charts === Chart Position US Billboard Hot 100 43 == Certifications and sales == ==Release history== Release dates and formats for \"One Sweet Day\" Region Date Format Label United States November 14, 1995 CD maxi single United Kingdom November 27, 1995 Japan November 30, 1995 Mini CD single Sony Music Japan == References == == Further reading == * * Category:1995 songs Category:Mariah Carey songs Category:Boyz II Men songs Category:R&B; songs Category:R&B; ballads Category:Billboard Hot 100 number one songs",
 "title": "One Sweet Day"
}