{
 "id": "276412",
 "text": "Midnight is a teen fantasy novel, the first book in the second Warriors series: Warriors: The New Prophecy, written by Erin Hunter. It was released on 10 May 2005. The novel focuses on a group of feral cats living in four groups called Clans: ThunderClan, RiverClan, WindClan, and ShadowClan. The cats of these Clans call themselves warriors. ==Plot summary== Bramblepaw, son of the evil Tigerstar, has received his warrior name, Brambleclaw. Firestar, leader of ThunderClan and main character of the previous Warriors series, has had two kits with his mate, Sandstorm: Squirrelpaw and Leafpaw. A cat named Dustpelt teaches Squirrelpaw how to be a warrior, and a cat named Cinderpelt teaches Leafpaw how to become a medicine cat (a cat who heals others). While Leafpaw and Cinderpelt search for healing herbs, StarClan, the spirits of the cats' ancestors, sends Cinderpelt a warning in some burning bracken: a picture of a tiger running through fire. Cinderpelt mistakenly believes this to mean that fire and tiger will unite and destroy the forest, fire being Squirrelpaw and tiger being Brambleclaw. They share the warning with Firestar, who decides to keep Brambleclaw and Squirrelpaw separated. In a dream, StarClan tells Brambleclaw, Feathertail of RiverClan, Crowpaw of WindClan, and Tawnypelt of ShadowClan to \"listen to what midnight has to say.\" The four cats unite and begin on a journey in the direction of the setting sun. Squirrelpaw refuses to let Brambleclaw go without her, and Stormfur insists on joining them to protect his sister, Feathertail. On their journey, they meet an old cat named Purdy, who helps the Clan cats get to the ocean. The six journeying cats enter a cavern inhabited by a badger called Midnight, who can speak the language of cats. She reveals to them that humans will destroy the forest the cats live in, and that the Clans must leave the forest or die. She also tells them that a \"dying warrior\" (shooting star) will lead the Clans to their new home. The book ends with a short epilogue back in the forest, where the humans begin to destroy ThunderClan's territory. ==Publication history== Midnight was first released in the US and Canada in hardcover on 10 May 2005. It was released in the UK on 25 October 2006. It was released in paperback on 4 April 2006. It was also released for the Amazon Kindle on 6 November 2007. ==Critical reception== The reception of Midnight was mixed. Children's Literature gave a negative review. Points raised in the review include the demotion of Firestar (who held a major role in the previous series) to a simple spokesman, the huge volume of characters, and the \"wimpy\" group of traveling cats. However, the review did praise the character of Squirrelpaw. On the other hand, Kirkus Reviews said the novel was \"structurally solid.\" BookLoons called the characters \"engaging.\" ==Inspiration and influences== The forest the cats live in is based on New Forest, a forest in southern England. The herbs that the cats use for healing is based on information found in a book called Culpeper's Herbal by Nicholas Culpeper. ==References== Category:Warriors books Category:2005 books",
 "title": "Midnight (Hunter novel)"
}