{
 "id": "276519",
 "text": "Johnny English is a 2003 British comedy spy movie set in London. It was produced by Tim Bevan, Eric Fellner and Mark Huffam and was directed by Peter Howitt. Johnny English parodies the James Bond movie series. This movie has a sequel, Johnny English Reborn. == Plot == An MI7 agent named Johnny English is protecting the Crown Jewels but they are stolen. He meets a mysterious lady named Lorna Campbell, who he becomes suspicious of. English and his assistant, Angus Bough, discover that a French businessman named Pascal Sauvage plans to become King of Britain and turn the island into a large prison for international criminals. English meets Lorna Campbell again and she reveals she is an Interpol agent tracking Sauvage. Sauvage's henchmen force Elizabeth II to abdicate and erase her line of succession, allowing Sauvage to become next-in-line due to being descended from James II. English, Bough and Campbell hijack the coronation of Sauvage and after a long struggle, the Archbishop accidentally crowns English. As King, Johnny English gives the crown back to the Queen and has Pascal Sauvage arrested. While on holiday with Campbell in southern France, English accidentally ejects her from the car. == Cast == * Rowan Atkinson as Johnny English, an MI7 spy and secret agent * Natalie Imbruglia as Lorna Campbell, an INTERPOL agent * John Malkovich as Pascal Sauvage, a French businessman * Ben Miller as Angus Bough, English's friend and assistant * Tim Pigott-Smith as Pegasus, head of the MI7 * Prunella Scales as Queen Elizabeth II * Oliver Ford Davies as the Archbishop of Canterbury * Kevin McNally as the Prime Minister == Ratings == Johnny English gained mixed reviews: * Rotten Tomatoes - 33% * Metacritic - 51% out of 100 == Other websites == * Johnny English's official website * * Category:2003 comedy movies Category:2000s parody movies Category:2000s spy movies Category:British comedy movies Category:British spy movies Category:Movies about royalty Category:Movies set in London Category:Movies set in palaces",
 "title": "Johnny English"
}