{
 "id": "276586",
 "text": "Lila Downs (September 9, 1968 in Tlaxiaco, Oaxaca, Mexico) is a Mexican/American singer-songwriter. She performs her own compositions as well as Mexican traditional and popular music. She also incorporates indigenous Mexican influences and have recorded songs in indigenous languages such as Mixtec, Zapotec, Maya, Nahuatl and P'urhépecha.BBC Music: Lila Downs. Her albums are One Blood, Shake Away, and Sins and Miracles has won various Grammys and World Music Awards. == Early life == Downs is the daughter of Mixtec cabaret singer Anita Sánchez and Allen Downs, a Scottish/English- American professor of art and cinematographer from Minnesota. She learned to sing at the age of four. She began to perform rancheras songs when she was 10 years old. Lila grew up partly in the Mexican state of Oaxaca, partly in the U.S. state of California as a teenager. She was 15 when she went to Performing Arts Institute of Oaxaca, where she studied music. She lived in Minnesota as an adult. She graduated from the University of Minnesota in voice and anthropology. == Career == She later returned to Mexico where she learned to weave. Later, she began singing in the club scenes of Oaxaca and Philadelphia along with Paul Cohen, an American-born saxophonist. They began collaborating on songs that would slowly evolve into Downs' subsequent recordings. Cohen became both Downs' husband and her artistic director.XISPAS: An interview with Lila Downs Retrieved Sept 18, 2006 from xispas.com In recent years, Downs and her band have toured widely in Mexico, South America, the US and Europe. She was also heard in the soundtrack to the movie Frida in a song, \"Burn it Blue\", that was nominated for the Academy Award for Best Song and that she performed at the 75th Academy Awards.BBC News. Lila Downs, In music. Other songs that she performed on the soundtrack are \"Benediction and Dream\", \"Estrella Oscura\", and \"La Llorona\". Other movies in which her songs are featured include Maria Ripoll's 2001 Tortilla Soup, Patricia Cardoso's 2002 Real Women Have Curves and Carlos Saura's 2007 Fados. She was also invited to the Twelve Girls Band's concert in Shanghai, where she sang in French and English. Downs is currently based in Coyoacán, a borough of Mexico City. On September 2, 2008, Lila Downs released Shake Away, her latest album of new material as well as featuring a few cover songs, including \"I Envy The Wind\" by Lucinda Williams and \"I Would Never\" by The Blue Nile. Downs also collaborated with artists like La Mari from Chambao and Enrique Bunbury from Héroes del Silencio. In 2010 she appeared on The Chieftains' album San Patricio. Sins and Miracles is the most recent album by Lila Downs. It was released in 2011. It reached the top of the charts in Mexico, Germany, Argentina, Colombia, Spain and the United States. It also reached the top ten in other major markets. Downs did a tour for the album called the \"Pecados y Milagros World Tour\". The singles on Sins and Miracles are: \"Palomo del Comalito\", \"Zapata se Queda\" and \"Mezcalito\". The album and its singles received one Grammy Award. The main music genres which make up the album are pop, folk and ska. She has a contralto vocal range. == Discography == === Studio albums === * 1999 – La Sandunga * 2000 – Tree of Life * 2001 – Border * 2004 – One Blood * 2006 – La Cantina * 2008 – Ojo de Culebra * 2011 – Pecados y Milagros * 2015 – Balas y Chocolate * 2017 – Salón Lágrimas Y Deseos === Live albums === * 1996 - Azulao: En Vivo con Lila Downs * 2010 – Lila Downs y La Misteriosa en París - Live à Fip === Compilations === * 2008 – The Very Best Of Lila Downs [CD] * 2012 – Canciones pa' Todo del Año === Other albums === * 1994 - Ofrenda * 1998 - Trazos === EP's === * 2007 - Live Session === DVD's === * 2006 – Loteria Cantada * 2008 – The Very Best Of/El Alma de Lila Downs [DVD] * 2010 – Lila Downs y La Misteriosa en París Live - à Fip [DVD] * 2011 – Pecados y Milagros (Deluxe Edition) == Notes == ==Other websites== * Official Category:1968 births Category:Living people Category:Mexican singer-songwriters Category:People from Oaxaca Category:Mexican Grammy Award winners Category:Latin Grammy Award winners Category:21st-century indigenous people of the Americas Category:20th-century indigenous people of the Americas",
 "title": "Lila Downs"
}