{
 "id": "276572",
 "text": "Hecate (Ἑκάτη, Hekátē) is the goddess of magic, crossroads, witchcraft, sorcery, ghosts, and necromancy in ancient Greek religion and mythology. She is the daughter of Perses and Asteria, who is the twin sister of Leto. Although Hecate is a member of the third generation of Titans, she sided with Zeus and his siblings during the Titanomachy. As a result, she was highly honored by Zeus, who granted her influence over the Earth, the sky, and the Underworld. A nocturnal figure, Hecate often resided in underground caves or in the Underworld itself. She was commonly invoked as a household deity to help ward off evil spirits. Hecate assisted Demeter in her search for her daughter Persephone after Hades abducted her, guiding Demeter’s path at night with her flaming torches. Following this, she frequently accompanied Persephone on her annual journey to and from the realm of the dead. In later depictions, Hecate is portrayed as a woman with three heads, which are thought to represent the past, present, and future. Her attendants included the Empousa, a species of man-eating monsters that appeared vampiric, featuring one leg made of solid bronze and the other leg resembling that of a donkey. Often identified with the goddesses Artemis and Selene, Hecate is also seen as a symbol of the harvest moon. Her sacred symbols include a pair of torches, keys, and daggers, while animals such as the serpent, polecat, and dog were considered sacred to her. She was typically worshipped alongside Demeter and Persephone. Hecate's Roman counterpart is Trivia. == References == * The Goddess Hecate. Hecate's Cauldron , n.d. Web. 23 Oct. 2012. * Hecate. Albany , n.d. Web. 13 Nov. 2012. * \"Hecate.\" . Greek Gods-Hecate. Alex Goldberger, n.d. Web. 6 Nov. 2012. * \"Hecate.\" Hecate.. Princeton University, n.d. Web. 6 Nov. 2012. * Perses. Theoi, n.d. Web. 27 Nov. 2012. *Ovid's Metamorphoses Category:Greek gods and goddesses Category:Virgin goddesses",
 "title": "Hecate"
}