{
 "id": "276609",
 "text": "A citadel is a large fortress or castle that is usually built to protect cities or towns from attacks or disaster, though citadels have been built for other reasons as well. Citadels are often built to be the final protection for a city or town, in case enemies break through other protections such as walls or soldiers. The citadel of a city is most often built around the center of administration and government, which is where the king or city council makes their rulings. Other common places for a citadel to be placed are the downtown (central core) of the city, the holy center or religious square of the city (many shrines), and the business or financial area, where money is traded for goods, and invested. == History == === 3300 BCE - 1300BCE === === –1300 BCE === The oldest known citadels were built in the Indus Valley Civilization, where the citadel may have been used as a symbol of authority (power), though no one is entirely sure why they were built. === 800–600 BCE === In Ancient Greece, the Acropolis was important in the life of the people, serving as a place of safety in times of trouble. It contained military supplies, food, a shrine, and often a palace or citadel. The most well-known is the Acropolis of Athens, but nearly every Greek city-state had one. === 167–141 BCE === Citadels were sometimes built so strongly that enemies could take over the rest of the city, but fail to take over the city's citadel. During the Maccabean Revolt, the Maccabean rebels managed to take over all of Jerusalem except its citadel. It wasn't until 20 years later that they finally managed to take over the citadel too. === 1600 CE–present === Citadels were not always built to keep away a city's enemies. During the Anglo-Dutch Wars, King Charles II of England built a citadel at Plymouth that could not only keep out enemies, but also the city's people in case they tried to rebel against the King. === Modern Usage === The Citadelle of Quebec still survives as the largest citadel still in official military operation in North America after more than 200 years of existence. Since the middle of the 20th century, citadels usually protect military center, rather than cities or towns. These citadels are built to protect the center from heavy attacks, such as aerial or nuclear bombardment. The military citadels under London are an example of this. Category:Fortification",
 "title": "Citadel"
}