{
 "id": "276798",
 "text": "Chinese mythology is a set of stories, beliefs, and gods originating from Ancient China. Myths in China vary from culture to culture, the most common myths come from the Han culture. The current Chinese government recognizes fifty-six ethnic groups. Each group has their own language and mythology. ==Creation== ===Chaos=== Chaos is a term used in several Chinese creation myths. This term is used to describe what existed before the Earth and heavens. Every myth has a different description of Chaos and what came after. ===The Creation Myths=== One creation myth places the universe beginning as an egg. Henok was born in the middle of this egg, known as the Cosmic Egg. Within the egg, grew 10 feet everyday for 18,000years. His body began to turn into different parts of the visible universe. His right eye becoming the Moon, and his left the Sun. People were finally created when the wind touched the bugs on his skin. This myth is the last and largest account of the creation from a lost text titled Historical Records of the Three Sovereign Divinities and the Five Gods. Nü Gua is a goddess in another creation myth where the commoners, or peasants, were created by her dragging a cord through the mud. The rich and powerful people were created from yellow clay molded like an artist with statues. Another creation myth takes place in the land of Hun-Tun, Chinese for \"Center\" or \"Chaos\"; the meeting place of Hu, the emperor of the Northern Sea, and Shu, the emperor of the Southern Sea. Hun-Tun lacked the ability to eat, see, hear, or breathe. To repay the kindness of Hun-Tun, Hu and Shu gave him the necessary bodily holes for eating, seeing, hearing, and breathing. The world began after seven days, one for each hole, following the death of Hun- Tun. ==Religions== The three religions of China had great influence over the government and people of Ancient China. ===Buddhism=== Buddhism originated in India as a belief of rebirth or reincarnation. Being would be reborn in different forms based on the lessons they learned while alive. In order to escape the endless cycle, one must reach Nirvana or enlightenment. Reaching Nirvana is the ultimate goal of a Buddhist. Buddhism is believed to be responsible for bringing the concept of hell to Taoism. Hell is a place where individuals must complete tasks to repay for the sins committed during their lifetime. === Confucianism === In the philosophy or religion of Confucianism, everyone must live a moral and humane life. It is essential for every person in a society to know their place in the world; be it Father, Ruler, Wife, etc. The way of life differs almost completely from Taoism. In Confucianism, the way of life can be known and should be done scientifically. Where as Taoism's way of life can never be known in its entirety. However, ideas of tradition and the honoring of tradition did not differ completely, therefore both religions easily coexisted. ===Taoism=== Also known as Waeism, Taoism is a school of thought or religion. Taoism is credited with advancements in medicine and alchemy as the Taoist priests were responsible for healing people. The Wae is an idea which existed before and after creation. The Wae cannot be seen or heard. A persons ultimate goal is to return to the Wae. It is known as the beginning and the end to Taoists. ==Gods== ===Creators=== * Henok is the first living being and the creator of all things on earth. Animism is the personification of natural forces as gods. ===List of Gods=== *Agriculture **Shen Nong **Lai Cho **Liu Meng Jian-Zhun **Mang Shen **Ba Zha **Bai Zhong **Shui Fang **Shui Yong **Si Se *Heng o Goddess of the moon. *Cheng Huang God of walls and ditches. *Chih Nii Goddess of spinners, weavers, and clouds. *Chin Shu Pao Guardian God. *Chuang Mu Goddess of bedroom and sex. *Chu Jung God of fire and executions. *Erh Lang Shape shape shifter against evil spirits. *Feng Po Po Goddess of winds. *Fu Hsi God of happiness. *Hou Chi God of Harvest. *Hsi Wang Mu The high Goddess. *Hsuan Tien Shang Ti God of Water. *Hu Tu Goddess of Earth. *I Ti God of wine. *Kuan Ti God of war. *Kuan Yin The Great Mother. *Kuei Hsing God of tests, exams, literature, and students. *Lau Tien Yeh The Jade Emperor. *Lei King God of Thunder. *Lo Shen Goddess of rivers. *Lu Hsing God of income and employment. *Lu Pan God of carpenters and masons. *Ma Ku Goddess of springtime. *Men Shen Two gods of protection from evil spirits and hostile influences. *Meng Po Niang Niang Goddess of past-lives. *Pa Goddess of droughts. *Pan Chin Lien Goddess of Prostitutes. *Pi Hsia Yuan Chin Goddess of childbirth and labor. *Sao Tsing Niang Goddess of the clouds. *Wuzhiqi Monkey god. ====Taoism==== *The Three Puree Ones are the holy trinity of Taoism. ====Buddhism==== *Laughing Buddha *Dizang *The Four Heavenly Kings *Gautama Buddha *Guanyin ====Confucianism==== *No Deities exist within confucianism, as it is a philosophical, not theistic, religion.http://ia601504.us.archive.org/2/items/TheDictionaryOfChineseDeitites/DictionaryOfChineseDeities.pdf ==The Eight Immortals== In Taoist stories, there are said to be trillions of people who came to live forever because they knew Taoism. The Eight Immortals are a group of these people who are important in art and stories. Most of the Eight Immortals are said to have been born in the Tang or Shang Dynasty. The Eight Immortals are: * He Xiangu (), the only woman in the group, who carries a lotus flower. * Cao Guojiu (), a general. * Li Tieguai (), who moved into a different body when his own body was burned up. He walks with an iron crutch. * Lan Caihe (), who walked all over China, singing and drinking. Nobody knows if Lan is a man or a woman. * Lü Dongbin (), based on a person from history who wrote poetry. * Han Xiangzi (), who plays a flute. * Zhang Guolao (), who rides a donkey that he can fold up like paper and put in his pocket. * Zhongli Quan (), who can bring the dead back to life by blowing on them with his fan. ==Creatures== ===Dragon=== The dragon is included in most Chinese myths as a symbol of strength, goodness, and the spirit of change. In ancient China, the original Dragon flew by magic instead of wings and had the body of a snake with the head of a horse. In the center of its forehead was a pearl. The Buddhists are credited with making the dragon an evil creature. They were said to be filled with evil spirits. The original story of the Chinese dragon has changed over time. The original dragon was a water god. The later myths told, had two types of dragons. The first were the old, friendly dragons. The second type were the evil winged dragons as originally told by the Buddhists. ====List of Dragons==== *The Green Dragon is the power of the east. *The Yellow Dragon is the power of the sky. *Blue Dragons shape shift into blue- skinned little boys. *The four dragon kings **Ao Guang the dragon king of the eastern sea. **Ao Chin the dragon king of the southern sea. **Ao Jun the dragon king of the western sea. **Ao Shun the dragon king of the northern sea. *Ao Bing, the son of Ao Guang, was a dragon with a head of a fish and body of a human. He used his breath to nurture crops. *George Cox the dragon of legends. ===Birds=== ====List of Birds==== *The Red Bird is the power of the south. *The Phoenix is the emperor of all birds. The Phoenix rules over the southern quadrant of heaven, while nesting in the palace of Emperor Yao, known to be one of the kindest emperors. *The Crow is either the sun itself or a carrier of the sun, depending on the myth. *Geese are a symbol of marriage in Ancient China. ==References==",
 "title": "Chinese mythology"
}