{
 "id": "276840",
 "text": "Wooddrow \"Woody \"Woodpecker is an animated cartoon character, an anthropomorphic tuxedo woodpecker who appeared in theatrical short movies produced by Walter Lantz, and distributed by Universal Pictures. Woody Woodpecker cartoon was created in 1940 by Ben \"Bugs\" Hardaway. He also created the cartoon characters of Bugs Bunny and Daffy Duck when he worked at the Schlesinger/Warner Bros. studio in the late 1930s. == Family == Knothead and Splinter are the nephew and niece of Woody Woodpecker. They first appeared in the cartoon Get Lost!. Originally Knothead and Splinter were Woody's nephews in the New Funnies comic books. Knothead was Nuthead and Splinter was a boy. However, in 1949, Nuthead was turned into Knothead and Splinter was a girl. In the late 1950's Knothead and Splinter appeared in both animated cartoons and comic books. They were both voiced by June Foray. Woodpecker also has a girlfriend named Winnie Woodpecker. In The New Woody Woodpecker Show, Winnie is voiced by B. J. Ward. == Voice actors == * Mel Blanc (cartoons: 1940–1941; archive recordings: 1942–1972; Capitol Records: 1948–1955) * Danny Webb (1941; Pantry Panic) * Kent Rogers (1941–1943, gulping in Wild and Woody! (archive recording)) * Dick Nelson (1943, 1954; Ration Board, conscience in Under the Counter Spy) * Ben Hardaway (1944–1949) * Lee Sweetland (1944–1947; singing voice in The Barber of Seville, The Beach Nut, Ski for Two, Chew-Chew Baby, The Dippy Diplomat and Smoked Hams) * Theodore von Eltz (1947; Sally in Hollywoodland [unaired radio pilot]) * Harry Babbitt (1948; \"The Woody Woodpecker Song\") * Danny Kaye (1948; \"The Woody Woodpecker Song\" cover) * Grace Stafford (1950–1991, 1995; Destination Moon, cartoons: 1950–1972; The Woody Woodpecker Show, commercials, 51st Academy Awards, Walter, Woody and the World of Animation, Let's All Recycle, Pepsi commercial (archive recording)) * Gladys Holland (1953; imitating Ga Ga Gazoo in Belle Boys) * Dallas McKennon (1954, 1964, 1966; growling in Wrestling Wrecks, Indian voice disguise in Saddle-Sore Woody, monster sounds in Monster of Ceremonies) * Hal Smith (1957; Woody Woodpecker Presents) * Daws Butler (1963–1964, 1969, 1972; Indian voice disguise in Greedy Gabby Gator, imitating Homer's boss in Freeway Fracas, monster sound in Spook-a-Nanny, yelling in Little Skeeter, imitating Floyd Farkle in Pecking Holes in Poles) * Benny Rubin (1963; with the Mad Professor's voice in Science Friction) * Cherry Davis (1988; Who Framed Roger Rabbit) * Dave Spafford (1991; 63rd Academy Awards) * Jeff Bennett (1996; Animaniacs (as \"Woodpeckerman\")) * Billy West (1998–2002; From the Earth to the Moon, The New Woody Woodpecker Show) * Eric Kelso (2001; Universal Studios Japan, Universal Studios Theme Parks Adventure) * Dan Castellaneta (2008; The Simpsons (as a parody named \"Robby Robin\")) * Seth Green (2014; Robot Chicken) * Eric Bauza (2017–present; Woody Woodpecker, Woody Woodpecker, MeTV promotion, Woody Woodpecker Goes to Camp) * Dan Milano (2025; Robot Chicken) ==Related pages== *Knothead and Splinter *Andy Panda *Chilly Willy Category:Anthromophic characters",
 "title": "Woody Woodpecker"
}