{
 "id": "276837",
 "text": "Newton Leroy \"Newt\" Gingrich (born June 17, 1943 as Newton Leroy McPherson) is an American politician from Georgia. He is credited with bringing about the Republican Revolution in the 1994 United States House of Representatives elections, which gave the Republican Party control of the United States House of Representatives for the first time since the 1952 United States House of Representatives elections. ==Early life== He was born Newton Leroy McPherson in Harrisburg, Pennsylvania. He was adopted by his stepfather. ==Political career== === 1974 election === Gingrich began his political career in 1974 when he ran for the United States House of Representatives from Georgia's 6th congressional district. He ran against incumbent John Flynt, a segregationist Democrat who had represented Georgia's 6 since 1965. Flynt had not faced any serious challenge to his seat in the past, and Gingrich struggled to pull together a grassroots movement against Flynt. Despite the 1974 United States elections being a bad year for Republicans nationally due to the Watergate scandal, Gingrich only narrowly lost to Flynt by 2.9 points. === 1976 election === Despite his previoust defeat, Gingrich ran against Flynt again in 1976. Flynt was expected to do well given that Jimmy Carter, a favorite son and Georgia Democrat, leading the ticket as the Democratic Party's presidential nominee. Despite this, Gingrich only narrowly lost again by only 3.4 points. === 1978 election === In 1978, Flynt decided to retire and did not run for reelection. Gingrich launched a third consecutive campaign, although he did face a primary challenge from other Georgia Republicans. After winning the Republican primary, he faced Democrat Virginia Shapard. He managed to use ads about Shapard's previous record on in the Georgia State Senate to paint Shapard as a liar. This strategy proved successful, with Gingrich winning 54.4% of the vote. === Tenure in the House of Representatives === Gingrich entered the House of Representatives on January 3, 1979. ==Personal life== He is also an author, professor, and a historian. Since quitting the House, Gingrich has become a political analyst, or someone who talks about current issues on television, radio, or in a newspaper. Gingrich has been a Fox News Network political analyst until his presidential campaign in 1988. He then joined the Cable News Network (CNN) as a political analyst after the campaign ended.CNN's biography of Gingrich http://www.cnn.com/CNN/anchors_reporters/gingrich.newt.html Gingrich unloads on Fox News http://www.realclearpolitics.com/articles/2012/04/12/gingrich_unloads_on_fox_news_in_private_meeting___113818.html He also cohosted Crossfire on CNN.Newt Gingrich biography on Crossfire website http://crossfire.blogs.cnn.com/newt-gingrich/ In 2000, he married Callista Bisek. ==2012 election== In the 2012 United States presidential election, Gingrich launched a presidential campaign for the Republican nomination. Gingrich announced that he was going to suspend his campaign on April 25, 2012, and officially did so on May 2, 2012. Gingrich endorsed eventual Republican nominee Mitt Romney, though he continued to claim that Romney was a liar. ==2020 election== Gingrich has supported Donald Trump's allegations of voter fraud in the 2020 United States presidential election. ==References== Category:American adoptees Category:Time People of the Year Category:Speakers of the United States House of Representatives Category:2012 United States presidential candidates Category:United States representatives from Georgia Category:1943 births Category:Living people Category:Politicians from Harrisburg, Pennsylvania Category:CNN people Category:Republican Party (United States) politicians",
 "title": "Newt Gingrich"
}