{
 "id": "276949",
 "text": "The Nintendo 3DS (also called 3DS or N3DS) is a handheld video game console made by Nintendo which can display 3D effects without the need for any special glasses. It succeeded the Nintendo DS family. Like the Wii, Wii U, Nintendo Switch, and all the members of the Nintendo 3DS family, it has a Mii Maker application, letting the user create their own personal avatar, which some games use to replace the standard characters. It was released in Japan on February 26, 2011, on March 25, 2011 in Europe and the United Kingdom, on March 27, 2011 in the United States and Canada, and in Australia on March 31, 2011. The Nintendo 3DS lets the user play games in either 2D or 3D. A slider lets the player change the level of 3D in the game. The Nintendo 3DS also lets the user play most Nintendo DS and Nintendo DSi games, but only in 2D. Similar to the DSi and DSi XL, DS games that use the Game Boy Advance slot cannot be used. It comes with extra channels (some have to be downloaded from the Nintendo eShop), such as Nintendo Video, Nintendo Zone, and Swapnote. The system has a camera on the inside, and two on the outside. The outer cameras let the user both take pictures in 3D and shoot videos up to 10 minutes long in 3D. The Nintendo 3DS was first shown at the Electronic Entertainment Expo 2010. On July 28, 2011, Nintendo announced that they would cut the price of the 3DS to $170 on August 12. People who got it when it was at the higher price of $250 got 10 free Nintendo Entertainment System games, along with 10 free Game Boy Advance games from the Nintendo eShop.Nintendo What's New 2011-7-28 NES games later became available to the public, but GBA games remained exclusive to ambassadors. A bigger version, called the Nintendo 3DS XL, was shown to the public on June 21, 2012. Similar to the DSi XL, this version has screens much larger than the regular 3DS. It was released in Japan in July 2012 and August 2012 worldwide (along with New Super Mario Bros. 2), and currently costs $199.Nintendo 3DS XL Price and Release Date Revealed A third version of the console, called the Nintendo 2DS, was announced on August 27, 2013 and released on October 12, 2013 worldwide and in Japan on February 27, 2016. This version does not have the 3D feature and is the first handheld since the Game Boy Micro not to have the clamshell design. Two newer upgraded versions were released, called the New Nintendo 3DS and New Nintendo 3DS XL, similar to the DSi and DSi XL. Like the original 3DS, the New 3DS also has an XL variant. They were announced on August 28, 2014 and released in Japan on October 11, 2014, in Australia on November 21, 2014, and in Europe and North America on February 13, 2015. However, in North America, only the XL version was released at launch.https://www.amazon.com/Nintendo-New-3DS-XL- Black/dp/B00S1LRX3W/ref=dp_ob_title_vg?th=1 The standard-sized version was released only in special bundles on September 25, 2015. The sixth and latest model called the New Nintendo 2DS XL was announced on April 27, 2017 and released in June/July 2017. Like the Nintendo 2DS, it does not have the 3D feature, but retains the clamshell design and has the same features as the New 3DS and New 3DS XL. In the first year, Nintendo 3DS sold 15 million units and Nintendo 3DS fans created 213.8 million Miis. The 3DS was discontinued in September 2020, with online play for many first party titles and system features ending on April 8th, 2024. ==Games== The Nintendo 3DS first launched in Japan with Pro Evolution Soccer 3DS, Super Street Fighter IV 3D Edition, Samurai Warriors: Chronicles, Bust-a-Move Universe, Nintendogs + Cats, Ridge Racer 3D, Combat of Giants: Dinosaurs 3D, and Professor Layton and the Miracle Mask. Titles for the North American and European launches of the 3DS are The Sims 3, Madden NFL 3DS, Lego Star Wars III: The Clone Wars, Super Monkey Ball 3D, Asphalt 3D, Tom Clancy’s Ghost Recon: Shadow Wars, and Steel Diver. ==List of built-in applications== *Health and Safety Information *Nintendo 3DS Camera *Nintendo 3DS Sound *Mii Maker *StreetPass Mii Plaza *AR Games *Face Raiders *Activity Log *Nintendo 3DS Download Play *System Settings *Nintendo eShop (discontinued) *Nintendo Zone (discontinued) *Miiverse (discontinued) ==Related pages== *Nintendo Entertainment System *Super Nintendo Entertainment System *Game Boy Color *Game Boy Advance *Nintendo DS *Virtual Boy ==References== Category:Nintendo video game consoles",
 "title": "Nintendo 3DS"
}