{
 "id": "277073",
 "text": "The Christogram IHS is a monogram symbolizing Jesus Christ. From Greek it is an abbreviation of the name ΙΗΣΟΥΣ (Jesus). In the Eastern Orthodox Church, the Christogram is composed of the letters X and P, or I and X. They are the first two letters of the words Christ and Jesus Christ in the Greek language. The letter X forms a diagonal cross, also known as saltire or St. Andrew's cross. In the Western culture there exist the compositions: \"IHS\" and also \"IHC\" being the first letters (iota-eta-sigma) of the name Jesus in Greek alphabet: ΙΗΣΟΥΣ (Ίησοῦς or ΙΗϹΟΥϹ with lunated sigma). The abbreviation in form \"IHS\" appeared in first time on the coins of Justinian II on the turn of the 7th and 8th centuries. The order of Jesuits, in other words the Society of Jesus (Societas Iesu), adopted IHS as its fixed emblem - the symbol in 17th century. There appeared also Latin interpretations of the abbreviation IHS, among others: * Iesus Humilis Societas - Humble Society of Jesus, * Iesus Hominum Salvator - Jesus, Savior of men, and also: * In hoc signo vinces- By this sign you shall conquer. These developed inscriptions were most likely formed because in the Middle Ages people mistakenly read the letter E as H. According to a legend, this inscription with the cross was seen by emperor Constantine the Great in his sleep before the battle against Maxentius in 312 on the Ponte Milvio. Saint Bernardine of Siena (1380–1444) promoted devotion to the IHS monogram (the first three Greek letters of \"Jesus\"), encouraging its use in art, churches, and homes. Commentators unfriendly to the Catholic Church sometimes interpret the abbreviation IHS as derived from the solar idols of the Egyptian mythology: Isis, Horus and Seth. Nevertheless, present scientific knowledge does not confirm such interpretations. Tomasz Dekert - Co oznacza skrót IHS? (\"What does the abbreviation IHS mean?\") , Dominikański Ośrodek Liturgiczny, date of access: 23rd of April 2009. A catholic source. == References == Category:Jesus Category:Christian symbols",
 "title": "Christogram IHS"
}