{
 "id": "277067",
 "text": "The Liberal Party of Canada () is a political party in Canada. The party is considered to be centre to centre-left. The party was the Official Opposition after it lost the 2006 election, until the NDP became the Official Opposition in 2011. They won the election in 2015. The current party leader is the Canadian Prime Minister Mark Carney ==Provincial and territorial parties== Every provinces and one territory in Canada have its own Liberal Party. However, only the parties in New Brunswick, Newfoundland and Labrador, Nova Scotia, and Prince Edward Island are part of the federal Liberal Party. Some of the other provincial parties might have very similar political ideologies but they are different political parties. These parties might have different members and different funding. Affiliated provincial parties, current seats, and leaders Party Seats/Total Leader Status New Brunswick Liberal Association Kevin Vickers Liberal Party of Newfoundland and Labrador Dwight Ball Nova Scotia Liberal Party Stephen McNeil Prince Edward Island Liberal Party Robert Mitchell ==List of leaders== ===Leaders=== No. Portrait Name Term start Term end Date of birth Date of death Notes — George Brown 1867 1867 November 29, 1818 May 9, 1880 Unofficial (The leader of the Clear Grits, a forerunner of the federal Liberal Party) — Edward Blake 1869 1870 October 13, 1834 March 1, 1912 Unofficial 1 Alexander Mackenzie March 6, 1873 April 27, 1880 January 28, 1822 April 17, 1892 2nd Prime Minister (1st Liberal Prime Minister) 2 Edward Blake May 4, 1880 June 2, 1887 October 13, 1833 March 1, 1912 3 Wilfrid Laurier June 23, 1887 February 17, 1919 November 20, 1841 February 17, 1919 7th Prime Minister — Daniel Duncan McKenzie February 17, 1919 August 7, 1919 January 8, 1859 June 8, 1927 Interim leader 4 William Lyon Mackenzie King August 7, 1919 August 7, 1948 December 17, 1874 July 22, 1950 10th Prime Minister 5 Louis St. Laurent August 7, 1948 January 16, 1958 February 1, 1882 July 25, 1973 12th Prime Minister 6 Lester B. Pearson January 16, 1958 April 6, 1968 April 23, 1897 December 27, 1972 14th Prime Minister 7 Pierre Trudeau April 6, 1968 June 16, 1984 October 18, 1919 September 28, 2000 15th Prime Minister 8 John Turner June 16, 1984 June 23, 1990 June 7, 1929 September 18, 2020 17th Prime Minister 9 Jean Chrétien June 23, 1990 November 14, 2003 January 11, 1934 living 20th Prime Minister 10 Paul Martin November 14, 2003 March 19, 2006 August 28, 1938 living 21st Prime Minister — Bill Graham March 19, 2006 December 2, 2006 March 17, 1939 August 7, 2022 Interim leader, Leader of the Opposition 11 Stéphane Dion December 2, 2006 December 10, 2008 September 28, 1955 living Leader of the Opposition 12 Michael Ignatieff December 10, 2008 May 25, 2011 May 12, 1947 living Interim leader until May 2, 2009 (when ratified as leader), Leader of the Opposition — Bob Rae May 25, 2011 April 14, 2013 August 2, 1948 living Interim leader 13 Justin Trudeau April 14, 2013 March 9, 2025 December 25, 1971 living 23rd Prime Minister 14 Mark Carney March 9, 2025 Incumbent March 16, 1965 living 24th Prime Minister Source: ==Notes== ==References== ==Other websites== *Official website *Liberal action for a greater Canada: speaker's handbook, federal general election, 1957 *Laws Relating to Labor: Record of the Liberal Government on Labor Regulation; A Progressive Policy in Which Ontario Leads *Tory vs. Liberal legislation! in favor of the workers of Canada: a comparison / (Workingman) *Includes various Liberal party publications from the 19th and 20th centuries Category:Political parties based in Ottawa Category:1867 establishments in Canada Category:Liberal parties",
 "title": "Liberal Party of Canada"
}