{
 "id": "277075",
 "text": "The Color Purple is a 1985 American period drama movie directed by Steven Spielberg with a screenplay by Menno Meyjes, based on the Pulitzer Prize- winning 1982 novel of the same name by Alice Walker. It was Spielberg's eighth movie as a director, and marked a change from the summer blockbusters for which he had become known. It was also the first movie directed by Spielberg for which John Williams did not compose the music. It stars Whoopi Goldberg, Danny Glover, Desreta Jackson, Margaret Avery, Oprah Winfrey, Rae Dawn Chong, Willard Pugh, and Adolph Caesar in his final roles. Filmed in Anson and Union counties in North Carolina, the movie tells the story of an young African American girl named Celie Harris and shows the problems African American women faced during the early 20th century, including domestic violence, incest, pedophilia, poverty, racism, and sexism. Celie is changed as she finds her self-worth through the help of two strong female friends. The movie was a box office success, grossing $142 million against a budget of $15 million. The movie received positive reviews from critics, receiving praise for its acting, direction, screenplay, musical score, and production values; but it was also criticized by some critics for being \"over-sentimental\" and \"stereotypical.\" The movie was nominated for eleven Academy Awards, including Best Picture, without winning any; it also received four Golden Globe Award nominations, with Whoopi Goldberg winning Best Actress in a Drama. Steven Spielberg did not receive an Academy Award nomination for his directing, but did receive a Directors Guild of America Award for Outstanding Directorial Achievement, and a Golden Globe nomination. The movie was later included in Roger Ebert's book series The Great Movies. == Cast == * Whoopi Goldberg as Celie Harris Johnson * Danny Glover as Mr. Albert Johnson * Oprah Winfrey as Sofia * Margaret Avery as Shug Avery * Akosua Busia as Nettie Harris * Adolph Caesar as Old Mister * Willard Pugh as Harpo Johnson * Rae Dawn Chong as Squeak * Larry Fishburne as Swain * Dana Ivey as Miss Millie * Leon Rippy as Store Clerk * Bennet Guillory as Grady * James Tillis as Henry \"Buster\" Broadnax * Desreta Jackson as Young Celie Harris * Leonard Jackson as Alphonso \"Pa\" Harris * Howard Starr as Young Harpo Johnson * Lelo Masamba as Olivia Johnson === Awards === The Color Purple was nominated for 11 Academy Awards. Notably, Spielberg was not nominated for his direction. It won none of the Academy Awards. This tied the record set by 1977's The Turning Point for the most Oscar nominations without a single win. ;Academy Awards nominations: *Best Picture *Best Writing, Screenplay Based on Material from Another Medium *Best Actress in a Leading Role; Whoopi Goldberg *Best Actress in a Supporting Role; Margaret Avery *Best Actress in a Supporting Role; Oprah Winfrey *Best Art Direction-Set Decoration; J. Michael Riva, Bo Welch, Linda DeScenna *Best Cinematography; Allen Daviau *Best Costume Design; Aggie Guerard Rodgers *Best Makeup; Ken Chase *Best Music, Original Score *Best Original Song (\"Miss Celie's Blues (Sister)\") The Color Purple was nominated for five Golden Globes, including Best Picture (Drama), Best Director for Spielberg, and Best Supporting Actress for Winfrey. Its only win went to Goldberg for Best Actress (Drama). Menno Meyjes was nominated for the BAFTA Award for Best Adapted Screenplay. Spielberg received the Directors Guild of America Award for Best Motion Picture Director, his first. The movie was shown at the 1986 Cannes Film Festival as a non-competing title. ==References== == Other websites == * Category:1985 drama movies Category:1985 LGBT movies Category:African-American movies Category:American drama movies Category:American LGBT movies Category:English-language movies Category:Feminist movies Category:Golden Globe Award winning movies Category:Incest in movies Category:LGBT drama movies Category:Movies about domestic violence Category:Movies about dysfunctional families Category:Movies about marriage Category:Movies based on books Category:Movies directed by Steven Spielberg Category:Movies set in Georgia (U.S. state) Category:Movies set in the 1900s Category:Movies set in the 1910s Category:Movies set in the 1920s Category:Movies set in the 1930s Category:Rape in movies Category:Warner Bros. movies",
 "title": "The Color Purple (1985 movie)"
}