{
 "id": "27716",
 "text": "Montenegro (meaning Black Mountain) is a small country in Southeastern Europe. It is on the Adriatic Sea, between Albania (to the South) and Croatia to the North. Inland (to the East and South-East) it also has a common border with Serbia, and Bosnia and Herzegovina. For most of the 20th century it was part of Yugoslavia. It had also been independent before World War I and existed as a kingdom. Its leader is Jakov Milatović. == History == Montenegro was an independent country during the 20th century, but after WW1 was united to the newly created Kingdom of Yugoslavia.http://researchomnia.logspot.com/2022/10/montenegro-betrayed-after- ww1-united-to.html Montenegro was part of the Kingdom of Yugoslavia from 1918 until 1941 when Nazi Germany and the Kingdom of Italy invaded it in 1941. In 1945 the Kingdom of Serbs, Croats and Slovenes became SFR Yugoslavia (SFRY). This was the time Montenegro became the Socialist Republic of Montenegro, a federated state in Yugoslavia along with Serbia, Croatia, Bosnia and Herzegovina, Slovenia, and Macedonia. In 1948, Josip Broz Tito ended his friendship with Stalin. Yugoslavia became neutral and founded the Non-Aligned Movement. In 1991, Yugoslavia started to breakup. A country named Serbia and Montenegro was formed in 1992. Montenegro came to exist when its people decided to split from the country Serbia and Montenegro on May 21, 2006. Montenegro became a independent country after the Yugoslav Wars during the 1990s. The national song is called \"Oj, svijetla majska zoro.\" Montenegrin Cyrillic: \"Ој, свијетла мајска зоро.\" English: \"Oh, Bright Dawn of May.\" ==Notes== == Economy and demographics == The size of the economy's GDP is $4.114 billion and it has 621,873 people in Montenegro in 2020. The traditional old capital of Montenegro is Cetinje, but Podgorica is the new capital. The country adopted the Euro unilaterally as Montenegro does not have its own currency, but the adoption has raised the national debt to 57 percent of GDP in 2011. The most professed religion is Eastern Orthodoxy at 72.1% and the second most is Islam at 19.2%. ==Related pages== * List of rivers of Montenegro * Montenegro at the Olympics * Montenegro national football team ==References== Category:European Union candidate states",
 "title": "Montenegro"
}