{
 "id": "277360",
 "text": "Transphobia or transmisia is any prejudice or discrimination based on bad feelings toward transgender or transsexual people. This also means refusing them the chance to take part in society, have a job, or forcing prostitution out of them, not only hate speech or hate crime against the transgender person. In 2009, to prohibit hate crime against transgender people, the Matthew Shepard Act was passed in the United States. The United Nations High Commissioner for Refugees points out that asylum seekers because of gender identity are covered by the Yogyakarta Principles. A transgender woman who escaped from Guatemala to Denmark was put into a male centre and raped there. Now she is in danger to be returned into Guatemala by Danish government. Transphobia is common all over the world. It is also found in social justice movements such as feminism. It is especially associated with radical feminism. 'Transmisogyny' is a word that refers to transphobia towards trans women. Julia Serano made it popular with her book Whipping Girl. Cissexism is sometimes used as a synonym for transphobia, and cisphobia is sometimes used as its antonym. ==Misgendering and exclusion== Misgendering is when someone does not use the pronouns preferred by a transgender person, deliberately or by accident. Deadnaming is using a name that someone used before transitioning. ===Violence against transgender people=== In a 2012 study of transgender people in the United Kingdom, 14% had been sexually assaulted for being transgender. 6% had been raped because they were transgender. These are hate crimes. 38% had been sexually harassed because they were transgender.http://www.gires.org.uk/assets/Medpro-Assets/trans_mh_study.pdf A review of American studies on sexual violence against transgender people found that about 50% of transgender people had been sexually assaulted.https://scholar.google.com/citations?view_op=view_citation&hl;=en&user;=x1nHMj8AAAAJ&citation;_for_view=x1nHMj8AAAAJ%3AULOm3_A8WrAC ==Homelessness== In the National Transgender Discrimination Survey 19% had become homeless at some time in their lives because they were transgender. ==Transphobia at work== In 2013 there was a study of transphobia in the American workforce. It found that 26% of transgender people had been fired for being transgender.http://lgbtmap.org/file/a-broken-bargain-for-transgender- workers.pdf Transgender people are not protected against employment discrimination under US law. The National Transgender Discrimination Survey found that 60% of Native American transgender people had not been given a job because of being transgender. 10% were sexually assaulted at work.http://www.thetaskforce.org/downloads/reports/reports/ntds_native_american_3.pdf ==Prison== Transgender people are put in prison more often than cisgender (non-transgender) people. The biggest study about discrimination against transgender people found that 16% of transgender people had been in prison. Black transgender people were even more likely to have been in prison. 41% of black transgender people said that they had been put in prison because of discrimination. They are often not put in prisons that match their gender identities. They may also be refused hormones. A famous example of this is Chelsea Manning. ==Health== Transphobia has been identified as a predictor of HIV risk and suicide attempts in transgender people. A study found that transgender women are 49 times more likely to have HIV compared with adults in general. ==Human rights enforcement== In a case before the Human Rights Tribunal in British Columbia several business owners were sued for refusing service to a transgender woman. The transgender person lost the case. ==Related pages== *Discrimination *Transgender *Homophobia *Matthew Shepard Act *Phobia *Yogyakarta Principles *Transgender Day of Remembrance *Cissexism *Gender binarism *International Day Against Homophobia == References == Category:Discrimination Category:Transgender",
 "title": "Transphobia"
}