{
 "id": "277450",
 "text": "Skandar Keynes, or ‘”Alexander Amin Caspar Keynes” is a British actor, born 5 September 1991. He starred Edmund Pevensie in The Chronicles of Narnia. He appeared in all three movies, The Lion, the Witch and the Wardrobe (2005), Prince Caspian (2008) and The Voyage of the Dawn Treader, which was released on December 10, 2010. == Personal Life == Keynes was born in London. He was the son of Zelfa Hourani and author Randal Keynes. He has an older sister, Soumaya Keynes (born 1989), who also starred in many productions of the BBC Radio 4. His grandparents by his mother’s side were Furugh Afnan and Cecil Fadlo Hourani. Cecil Fadlo Hourani used to be an author and also advisor to Habib Bourguiba, the late Tunisian president. Cecil Hourani was also the brother of Albert Hourani, a historian who studied about the Middle East. The Hourani family were immigrants to England. On his father’s side, Keynes is the grandson of Richard Keynes, the nephew of the Cambridge professor Simon Keynes, and the great-great-nephew of John Maynard Keynes, an economist. His great-great-great-grandfather was the famous naturalist Charles Darwin, who invented the theory of evolution. Keynes' great-grandparents were Edgar Adroam. 1st Barpm Adoroam and Hester Adrian, Baroness Adrian, both receivers of the Nobel Prize. Keynes had stated that he is an atheist. Keynes attended the Anna Scher Theatre School from 2000 to 2005. He went to the all-boys City of London School, and took his GCSEs in May and June 2008. He studied biology, chemistry, maths, and history at A-level. In October 2010 he began his degree in Arabic and Middle Eastern History at Pembroke College, Cambridge. He is currently a movie critic, writing for The Citizen, the City of London School weekly school newspaper. He is also a fan of English football club Arsenal. Keynes lives presently in Highbury, London. ==Career== He auditioned for The Lion, the Witch and the Wardrobe at the same time as he asked for the role of Simon Brown in Nanny McPhee, but lost the role to Thomas Sangster. His voice got deeper when he was filming The Lion, the Witch and the Wardrobe, so his sister Soumaya had to voice some of his lines. Recently, he starred in The Voyage of the Dawn Treader, the third installment of The Chronicles of Narnia movie series. The filming began in July 2009, and finished in December of the same year. The movie was released on 10 December 2010 in Britain and the US. In 2014 he Provided his voice as Sir Allen Kerr in Heirloom audio production's In Freedom's Cause radio drama. == Filmography == Year Title Role Notes 2001 Victoria Died in 1901 and Is Still Alive Today Waif TV documentary 2003 Ferrari Enzo Ferrari at 8 years old TV movie 2005 Edmund Pevensie 2008 Edmund Pevensie 2010 Edmund Pevensie ===Wins=== Year Award Award Ceremony 2006 Best Younger cast Camie ===Nominations=== Year Award Award Ceremony 2008 Best Performance in a Feature film - Leading Young Actor Young Artist Awards Best Performance in a Feature Film - Young Ensemble Cast ==References== ==Other websites== * Official website * Interview over the movie Prince Caspian (12 May 2008) *Prince Caspian On set interview (July 2007) *Cinema Confidential interview (December 7, 2005) Category:1991 births Category:Living people Category:Actors from London",
 "title": "Skandar Keynes"
}