{
 "id": "277658",
 "text": "A burn is an injury to a person's skin or flesh caused by heat, cold, electricity, chemicals, friction, or radiation. Most burns are due to heat from hot liquids, solids, or fire. While rates are similar for males and females the underlying causes often differ. Among women in some areas, risk is related to use of open cooking fires or unsafe stoves. Among men, risk is more related to the work environments. Alcoholism and smoking are other risk factors. Burns can also occur as a result of self harm or violence between people. Burns can be very serious injuries, and can even cause death. Depending on how deep the burn goes and amount of skin affected, a burn can be a medical emergency. For children, at least five percent of the skin needs to be affected. Adults can tolerate up to ten percent of affected skin. Burns of a certain extent affect the body as a whole: Common reactions are circulatory shock, systemic inflammatory response syndrome and sepsis. == Causes == In the United States, almost eight out of ten serious burns resulted from fire, flames, or hot liquids.National Burn Repository Pg. i Most burn injuries occur at home (73%) or at work (8%), and most are accidental, with 2% due to assault by another, and 1–2% resulting from a suicide attempt. Burns can cause inhalation injury to the airway and/or lungs, occurring in about 6%. == Characteristics == Burns are usually minor. They are usually Degree One to a minor Degree Two. People may get more powerful burns from high heat or radioactive items. === 1st Degree Burns === Degree One burns are minor and can be cured at home. They seldom leave scars. A person can get them from hot water, a minor sunburn, or by touching hot metal. It causes pain, but only the top layer of skin is burnt and no nerves are injured. === 2nd Degree Burns === Degree Two burns can be cured at home, but some people take them to the hospital. This degree of burn goes into the second layer of skin. === 3rd Degree Burns === Degree Three burns are the most severe burns that most people can survive from. Although they may be severe, the chances of death are low if treated at the hospital right away. It burns through all three layers of skin, leaving a scab. === 4th Degree Burns === This degree of burn goes through the skin and destroys the nerves near it. There is no pain at the location of the 4th degree burn area, due to the destruction of the nerves, but there can be immense pain that occurs in the area surrounding the burn. Very few survive it. It must be treated at the hospital ASAP if it occurs and the person is still alive. Names Layers involved Appearance Texture Sensation Healing Time Complications Example Superficial (1st degree) Epidermis Red without blisters Dry Painful 5–10 days Repeated sunburns increase the risk of skin cancer later in life Superficial partial thickness (2nd degree) Extends into superficial (papillary) dermis Red with clear blister. Blanches with pressure Moist Very Painful 2–4 weeks Local infection/cellulitis Deep partial thickness (2nd degree) Extends into deep (reticular) dermis Red-and-white with bloody blisters. Less blanching. Moist Painful with deep pressure 4–8 weeks Scarring, contractures (may require excision and skin grafting) Full thickness (3rd degree) Extends through entire dermis Stiff and white/brown Dry, leathery Painless Prolonged and incomplete Scarring, contractures, amputation 4th degree Extends through skin, subcutaneous tissue and into underlying muscle and bone Black; charred with eschar Dry Painless Requires excision, does not heal Amputation, significant functional impairment, possible gangrene, and in some cases death. == History == Cave paintings from more than 3,500 years ago show burns and their management. The earliest Egyptian records on treating burns describes dressings prepared with milk from mothers of baby boys. The 1500 BC Edwin Smith Papyrus describes treatments using honey and the salve of resin (may be myrrh). Many other treatments have been used over the ages, including the use of tea leaves by the Chinese documented to 600 BC, pig fat and vinegar by Hippocrates documented to 400 BC, and wine and myrrh by Celsus documented to 100 AD. French barber-surgeon Ambroise Paré was the first to describe different degrees of burns in the 1500s. Guillaume Dupuytren expanded these degrees into six different severities in 1832. The first hospital to treat burns opened in 1843 in London, England and the development of modern burn care began in the late 1800s and early 1900s. During World War I, Henry D. Dakin and Alexis Carrel developed standards for the cleaning and disinfecting of burns and wounds using sodium hypochlorite solutions, which significantly reduced mortality. In the 1940s, the importance of early excision and skin grafting was acknowledged, and around the same time, fluid resuscitation and formulas to guide it were developed. In the 1970s, researchers demonstrated the significance of the hypermetabolic state that follows large burns. == Notes == * ==References== Category:Medical emergencies Category:Injuries",
 "title": "Burn"
}