{
 "id": "277742",
 "text": "James Hutton MD (Edinburgh, (14 June 1726 – 26 March 1797) was a Scottish geologist, physician, naturalist, chemist and experimental farmer. Hutton studied in medicine, but never practised it. Instead, he did scientific research, helped to start a chemical industry, and farmed his estate. He is one of the founders of modern geology. He saw the Earth as the product of natural forces. What could be seen happening today, over long periods of time, could produce what we see in the rocks. His book on the Theory of the Earth set out theories of geology and geologic time. These ideas supported the theories of plutonism and uniformitarianism. ==Theory of rock formations== Hutton hit on a variety of ideas to explain the rock strata he saw around him. According to Playfair he \"was in no haste to publish his theory; for he was one of those who are much more delighted with the contemplation of truth, than with the praise of having discovered it”. After some 25 years of work, his Theory of the Earth was read to meetings of the Royal Society of Edinburgh in 1785. Hutton later read an abstract of his Concerning the system of the Earth, its duration and stability on 4 July 1785,Theory of the Earth full text (1788 version) which he had printed and circulated privately.Concerning the system of the Earth abstract In it, he outlined his theory as follows; :\"The solid parts of the present land appear in general, to have been composed of the productions of the sea, and of other materials similar to those now found upon the shores. Hence we find reason to conclude: 1st, That the land on which we rest is not simple and original, but that it is a composition, and had been formed by the operation of second causes. 2nd, That before the present land was made, there had subsisted a world composed of sea and land, in which were tides and currents, with such operations at the bottom of the sea as now take place. And, Lastly, That while the present land was forming at the bottom of the ocean, the former land maintained plants and animals; at least the sea was than inhabited by animals, in a similar manner as it is at present. :Hence we are led to conclude, that the greater part of our land, if not the whole had been produced by operations natural to this globe; but that in order to make this land a permanent body, resisting the operations of the waters, two things had been required; 1st, The consolidation of masses formed by collections of loose or incoherent materials; 2ndly, The elevation of those consolidated masses from the bottom of the sea, the place where they were collected, to the stations in which they now remain above the level of the ocean\". == Anticipation of natural selection == In Hutton's less well-known work is a remarkable anticipation of the idea of natural selection. As always with Hutton, the idea is almost hidden in the complex language: :\"...if an organised body is not in the situation and circumstances best adapted to its sustenance and propagation, then, in conceiving an indefinite variety among the individuals of that species, we must be assured, that, on the one hand, those which depart most from the best adapted constitution, will be the most liable to perish, while, on the other hand, those organised bodies, which most approach to the best constitution for the present circumstances, will be best adapted to continue, in preserving themselves and multiplying the individuals of their race\".– Investigation of the Principles of Knowledge, volume 2. The same \"principle of variation\" would influence \"every species of plant, whether growing in a forest or a meadow\". He came to his ideas as the result of experiments in plant and animal breeding, some of which he outlined in an unpublished manuscript, the Elements of Agriculture. He distinguished between heritable variation as the result of breeding, and non-heritable variations caused by environmental differences such as soil and climate. == Progress of his ideas == Hutton's prose hindered his theories. John Playfair in 1802 restated of Huttton's geological ideas (though not his thoughts on evolution).Playfair, John 1802. Illustrations of the Huttonian Theory of the Earth. Edinburgh. Playfair added an important observation of his own: that glaciers can transport great quantities of rock. Charles Lyell in the 1830s popularised the idea of an infinitely repeating cycle (of the erosion of rocks and the building up of sediment). Lyell believed in gradual change, and thought even Hutton gave too much credit to catastrophic changes. Lyell's books had widepread influence, not least on the up and coming young geologist Charles Darwin who read them with enthusiasm during his voyage on the Beagle. William Whewell coined the term uniformitarianism to describe Lyell's version of the ideas. This was in contrast with catastrophism, the idea that the rocks recorded a series of catastrophes followed by repopulation by a new range of species. Over time there was a convergence between these views, but Lyell's description of the development of geological ideas led to a belief that uniformitarianism had triumphed. ==Works== * 1785. Abstract of a dissertation read in the Royal Society of Edinburgh, upon the seventh of March, and fourth of April, MDCCLXXXV, Concerning the System of the Earth, Its Duration, and Stability. Edinburgh. 30pp. * 1788. The theory of rain. Transactions of the Royal Society of Edinburgh, vol. 1, Part 2, pp. 41–86. * 1788. Theory of the Earth; or an investigation of the laws observable in the composition, dissolution, and restoration of land upon the Globe. Transactions of the Royal Society of Edinburgh, vol. 1, Part 2, pp. 209–304. * 1792. Dissertations on different subjects in natural philosophy. Edinburgh & London: Strahan & Cadell. * 1794. Observations on granite. Transactions of the Royal Society of Edinburgh, vol. 3, pp. 77–81. * 1794. A dissertation upon the philosophy of light, heat, and fire. Edinburgh: Cadell, Junior, Davies. * 1794. An investigation of the principles of knowledge and of the progress of reason, from sense to science and philosophy. Edinburgh: Strahan & Cadell. * 1795. Theory of the Earth; with proofs and illustrations. Edinburgh: Creech. 2 vols. * 1797. Elements of Agriculture. Unpublished manuscript. * 1899. Theory of the Earth; with proofs and illustrations, vol III, Edited by Sir Archibald Geikie. Geological Society, Burlington House, London. == References == Category:1726 births Category:1797 deaths Category:British geologists Category:British naturalists Category:Scientists from Edinburgh Category:Scottish chemists",
 "title": "James Hutton"
}