{
 "id": "277821",
 "text": "Bill O'Reilly (born September 10, 1949) is an American conservative political commentator who hosted The O'Reilly Factor on Fox News from 1996 until 2017, after Fox News fired him. O'Reilly also hosted The Radio Factor (2002-2009) and Inside Edition (1989-1995). O'Reilly was born in Washington Heights, Manhattan, New York City. He has written some books including Pinheads and Patriots. He was raised in New York City and Westbury, Connecticut. ==Criticism== O'Reilly has been criticized for claims he reported events in the Falklands War between Argentina and the United Kingdom incorrectly. He also has been criticized by former Washington Post editor Jeff Morley for claiming he was outside George de Mohrenschildt's house when he committed suicide.Jeff Morley (January 30, 2013). \"JFKfacts » Investigator’s tape exposes Bill O’Reilly’s JFK fib\". JFK Facts. Retrieved 2015-03-10. In April 2017, Fox News Channel fired O'Reilly from the network due to sexual harassment accusations. ==Books== O'Reilly is known for his Killing series of historical nonfiction books, all written with Martin Dugard. The first five books in the series are about the violent deaths, or attempted assassinations, of historic figures. The next four deal with major episodes in American military history. Two others involve the U.S. government's battle against organized crime and the worldwide battle against terrorism, and the most recent recounts the lives, influence, and deaths of three iconic figures of 20th-century Anglo-American culture. These are: * Killing Lincoln (2011; about the assassination of Abraham Lincoln) * Killing Kennedy (2012; about the assassination of John F. Kennedy) * Killing Jesus (2013; about the crucifixion of Jesus Christ) * Killing Patton (2014; about the possibility of George Patton being assassinated) * Killing Reagan (2015; about the 1981 assassination attempt on Ronald Reagan) * Killing the Rising Sun (2016; about Harry S. Truman ordering the United States' bombing Japan and ending World War II) * Killing England (2017; about the American Revolutionary War) * Killing the SS (2018; about the end of Nazi Germany and the hunt for Nazi war criminals after World War II) * Killing Crazy Horse (2020; about the American Indian Wars, specifically those west of the Mississippi River in the 19th century) * Killing the Mob (2021; about the federal government's battle against organized crime, especially the Mafia) * Killing the Killers (2022; about the worldwide battle against terrorism, especially relating to the U.S.) * Killing the Legends (2022; about the lives and deaths of John Lennon, Elvis Presley, and Muhammad Ali) Some of his Killing books have been made into television movies for National Geographic. ==References== == Other websites == *Bill O'Reilly Official Home On The Web * Category:American radio personalities Category:Journalists from Connecticut Category:Journalists from New York City Category:American novelists Category:American political writers Category:American television presenters Category:American political commentators Category:Writers from Connecticut Category:Writers from New York City Category:Fox News people Category:1949 births Category:Living people",
 "title": "Bill O'Reilly"
}