{
 "id": "277975",
 "text": "Reese Witherspoon (also known as Laura Jeanne Reese Witherspoon, born March 22, 1976) is an American actress and film producer. She lived in Wiesbaden, Germany for four years when her father worked for the U.S. military. After returning to the U.S., she spent her childhood in Nashville, Tennessee. She was raised as an Episcopalian. She attended Stanford University as an English literature major. == Career == Witherspoon was selected as a fashion model for a florist's television advertisements at age seven. This made her want to take acting lessons. She has starred in many motion pictures. Notable movies by Witherspoon include Election, Legally Blonde, and Walk the Line. Witherspoon owns a production company called Type A Films. The company was at first believed by the media to be named after her childhood nickname \"Little Miss Type A\". Witherspoon received a star on the Hollywood Walk of Fame on December 01, 2010, at 6262 Hollywood Blvd. In 2018, she appeared alongside Oprah Winfrey and Mindy Kaling in support of the Time's Up movement against sexual assault in the workplace and in A Wrinkle in Time. == Personal life == Witherspoon married Ryan Phillippe from 1999 to 2008. They have two children together — daughter Ava Elizabeth Phillippe (born September 9, 1999) and son Deacon Reese Phillippe (born October 23, 2003). Witherspoon married talent agent Jim Toth on March 26, 2011. They have a son, Tennessee James Toth (born September 27, 2012). In March 2023, they got divorced. == Filmography == Actress Year Title Role Notes 1991 Dani Trant Nominated – Chicago Film Critics Association Award for Most Promising Actress Nominated – Young Artist Award for Best Young Actress Starring in a Motion Picture 1991 Wildflower Ellie Perkins 1992 Desperate Choices: To Save My Child Cassie 1993 Nonnie Parker 1993 Jack the Bear Karen Morris Young Artist Award for Best Youth Actress Co-Star 1993 Return to Lonesome Dove Ferris Dunnigan TV miniseries 1994 S.F.W. Wendy Pfister 1996 Freeway Vanessa Lutz Cognac Festival du Film Policier Award for Best Actress 1996 Fear Nicole Walker 1998 Twilight Mel Ames 1998 Overnight Delivery Ivy Miller 1998 Pleasantville Jennifer/Mary Sue Nominated – Teen Choice Award for Funniest Scene 1999 Cruel Intentions Annette Hargrove Blockbuster Entertainment Award for Favorite Supporting Actress Nominated – Teen Choice Award for Sexiest Love Scene Nominated – Teen Choice Award for Choice Actress 1999 Election Tracy Flick Kansas City Film Critics Circle Award for Best Actress National Society of Film Critics Award for Best Actress Online Film Critics Society Award for Best Actress Nominated – American Comedy Award for Funniest Actress in a Motion Picture Nominated – Chicago Film Critics Association Award for Best Actress Nominated – Chlotrudis Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Nominated – Independent Spirit Award for Best Lead Female Nominated – Las Vegas Film Critics Society Award for Best Actress Nominated – Satellite Award for Best Actor – Motion Picture Musical or Comedy Nominated – Teen Choice Award for Choice Hissy Fit 1999 Best Laid Plans Lissa 2000 Little Nicky Holly Cameo appearance 2000 American Psycho Evelyn Williams 2001 Serena Voice 2001 Legally Blonde Elle Woods MTV Movie Award for Best Comedic Performance MTV Movie Award for Best Dressed MTV Movie Award for Best Line Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Nominated – MTV Movie Award for Best Performance – Female Nominated – Satellite Award for Best Actor – Motion Picture Musical or Comedy 2002 Cecily Cardew Nominated – Teen Choice Award for Choice Actress 2002 Sweet Home Alabama Melanie Carmichael Teen Choice Award for Choice Movie Liplock Nominated – MTV Movie Award for Best Performance – Female Nominated – Teen Choice Award for Choice Actress 2003 Legally Blonde 2: Red, White & Blonde Elle Woods Executive Producer 2004 Vanity Fair Becky Sharp 2005 Walk the Line June Carter Cash Academy Award for Best Actress Austin Film Critics Association Award for Best Actress BAFTA Award for Best Actress in a Leading Role Boston Society of Film Critics Award for Best Actress Broadcast Film Critics Association Award for Best Actress Florida Film Critics Circle Award for Best Actress Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Kansas City Film Critics Circle Award for Best Actress Las Vegas Film Critics Society Award for Best Actress National Society of Film Critics Award for Best Actress New York Film Critics Circle Award for Best Actress Online Film Critics Society Award for Best Actress San Francisco Film Critics Circle Award for Best Actress Satellite Award for Best Actor – Motion Picture Musical or Comedy Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role Teen Choice Award for Choice Actress Washington D.C. Area Film Critics Association Award for Best Actress Nominated – Empire Award for Best Actress Nominated – MTV Movie Award for Best Performance 2005 Just Like Heaven Elizabeth Masterson 2006 Penelope Annie Also producer 2007 Rendition Isabella Fields El-Ibrahimi Nominated – Teen Choice Award for Choice Actress 2008 Four Christmases Kate 2009 Monsters vs. Aliens Susan Murphy / Ginormica Voice 2010 How Do You Know Lisa 2011 Water for Elephants Marlena Rosenbluth Nominated – People's Choice Award for Favorite Movie Actress Nominated – Teen Choice Award for Choice Movie Actress - Drama 2012 This Means War Lauren Scott 2012 Mud Juniper Post-Production 2013 Devil's Knot Pam Hobbs Filming starts in June 2012 2018 A Wrinkle in Time Mrs. Whatsit Post- Production Producer Year Title Notes 2003 Legally Blonde 2: Red, White & Blonde Executive Producer 2006 Penelope 2008 Four Christmases Television Year Title Role Notes 2000 King of the Hill Debbie 2 episodes voice 2000 Friends Jill Green 2 episodes 'The One With Rachel's Sister' 'The One Where Chandler Can't Cry' Nominated – American Comedy Award for Funniest Female Guest Appearance in a TV Series 2002 Greta Wolfcastle 1 episode voice 2003 Freedom: A History of Us Various roles 3 episodes 2009 Monsters vs. Aliens: Mutant Pumpkins from Outer Space Susan Murphy / Ginormica Halloween TV Special voice 2011-2012 After Lately Herself 2 Episodes == Discography == Year Soundtrack 2005 Walk the Line ==References== Category:American movie actors Category:American movie producers Category:American television actors Category:Actors from New Orleans Category:Best Actress Academy Award winners Category:Screen Actors Guild Award winners Category:1976 births Category:Living people",
 "title": "Reese Witherspoon"
}