{
 "id": "277929",
 "text": "Bernadette Peters (born February 28, 1948) is an American actress and singer. She is famous for her performances in musical theater as well acting in many movies. Her first Broadway performance was in 1967 in Johnny No-Trump. ==Work== ===Stage (selected)=== Year Show Role Notes 1958 This is Goggle Professional stage debut 1967 The Girl in the Freudian Slip Leslie Maugham Broadway debut (standby)\"The Girl in the Freudian Slip\". Internet Broadway Database, accessed January 22, 2012 1967 Johnny No-Trump Bettina 1968 George M! Josie Cohan Theatre World Award for Debut Performance 1968 Dames at Sea Ruby Drama Desk Award for Outstanding Performance 1968 A Mother's Kisses Performer Written by Bruce Jay Friedman and featured Bea Arthur.\"'A Mother's Kisses' Listing\". BroadwayWorld.com, accessed June 17, 2011 Three weeks of out-of-town tryouts in New Haven and Baltimore; cancelled before scheduled Broadway premiere.Zolotow, Sam. \"'Mother's Kisses' Will Not Make It to Broadway\", The New York Times, October 15, 1968, p.39 1969 La Strada Gelsomina Closed after one official performance.Mandelbaum, Ken. \"Not Since Carrie: Forty Years of Broadway Flops\", p. 171 (1991) St. Martin's Press Peters' performance was praised.Barnes, Clive. \"La Strada With Music\", The New York Times, December 15, 1969, p. 63 1971 Nevertheless, They Laugh Consuelo Lamb's Club, New York City, March 1971 (5 performances)New York Magazine theater listings, p. 13, March 29, 1971 1971 W.C. Carlotta MontiMarill, Alvin H. \"'W.C.' The Sixth Decade\". Mickey Rooney: His Films, Television Appearances, Radio Work, Stage Shows, and Recordings, McFarland, 2005, , pp. 62-63, 178-79 Starred Mickey Rooney. Played only out-of-town from May to October 1971, never opening in New York City. 1971 On the Town (revival) Hildy Esterhazy Nominated—Tony Award for Best Featured Actress in a Musical 1974 Mack & Mabel Mabel Normand Nominated—Drama Desk Award for Outstanding Actress in a Musical Nominated—Tony Award for Best Actress in a Musical 1982 Sally and Marsha Sally 1984 Sunday in the Park with George Dot/Marie Nominated—Drama Desk Award for Outstanding Actress in a Musical Nominated—Tony Award for Best Actress in a Musical 1985 Song and Dance Emma Drama Desk Award for Outstanding Actress in a Musical Tony Award for Best Actress in a Musical 1987 Into the Woods The Witch Nominated—Drama Desk Award for Outstanding Actress in a Musical 1993 The Goodbye Girl Paula Nominated—Tony Award for Best Actress in a Musical 1999 Annie Get Your Gun (revival) Annie Oakley Drama Desk Award for Outstanding Actress in a Musical Outer Critics Circle Award for Outstanding Actress in a Musical Tony Award for Best Actress in a Musical 2003 Gypsy (revival) Rose Nominated—Drama Desk Award for Outstanding Actress in a Musical Nominated—Tony Award for Best Actress in a Musical 2010 A Little Night Music (revival) Desiree Armfeldt Replacement for Catherine Zeta-Jones, from July 2010-January 2011 2011 Follies (revival) (Kennedy Center and Broadway revival) Sally Durant Plummer Nominated—Drama Desk Award for Outstanding Actress in a Musical ===Filmography=== * Ace Eli and Rodger of the Skies (1973) * The Longest Yard (1974) * Silent Movie (1976) * W.C. Fields and Me (1976) * Vigilante Force (1976) * The Jerk (1979) * Tulips (1981) * Pennies from Heaven (1981) * Heartbeeps (1981) * Annie (1982) * Slaves of New York (1989) * Pink Cadillac (1989) * Alice (1990) * Impromptu (1991) * Beauty and the Beast: The Enchanted Christmas (1997) (voice) * Anastasia (1997) (voice) * Barney's Great Adventure (1998) (singer, title song) * Wakko's Wish (1999) (voice) * Let It Snow (2001) * The Making and Meaning of We Are Family (2002) (documentary) * It Runs in the Family (2003) * The Land Before Time X: The Great Longneck Migration (2003) (voice) * Come le formiche (Wine and Kisses) (2007) (DVD released in Italy) ===Television=== * The Carol Burnett Show (various shows, 1969–1991) * George M! (1970) * Once Upon a Mattress (1972) as Lady Larkin * \"Love American Style\" – Episode titled \"Love and the Hoodwinked Honey\" (1973) as Nellie (opposite Jerry Orbach) * Paradise Lost (TV film, 1974) * Maude – Episode titled \"Rumpus in the Rumpus Room\" (1975) * All in the Family – Episode titled \"Gloria Suspects Mike\" (1975) * All's Fair (TV series) (1976–1977) * McCloud – Episode titled \"The Day New York Turned Blue\" (1976) * The Muppet Show (1977) * The Islander (TV film, 1978) * The Martian Chronicles (1980) (miniseries) * Saturday Night Live (1981) (host and performer) * Faerie Tale Theatre – Sleeping Beauty (1983) * Sunday in the Park with George (1986) * Diana Ross: Red Hot Rhythm & Blues (1987) * David (TV film, 1988) * Fall from Grace (TV film, 1990) * The Last Best Year (TV film, 1990) * Into the Woods (1991) * The Last Mile (1992) * Animaniacs (\"Rita and Runt\" episodes, 1993–1994) (voice of Rita) * The Larry Sanders Show – Episode titled \"Montana\" (1994) * A&E; Stage: \"A Tribute to Stephen Sondheim at Southern Methodist University\" (1995)\"Television and Radio listings, Part Three\". Sondheimguide.com, retrieved June 9, 2010 * Live with Regis and Kelly (various appearances, 1996–2011) * The Odyssey (1997) (miniseries) * Cinderella (TV film, 1997) * What the Deaf Man Heard (TV film, 1997) * Holiday in Your Heart (TV film, 1997) * The Closer – Episode titled \"Baby, It's Cold Outside\" (1998) * Inside the Actors Studio (2000) * Frasier (\"Sliding Frasiers\") (2001) (celebrity call-in) * Ally McBeal – Episodes titled \"The Getaway\" and \"The Obstacle Course\" (2001) * Bobbie's Girl (TV film, 2002) * Prince Charming (TV film, 2001 (Peru), 2003 (USA)) * Adopted (2005) (unsold ABC pilot) * Will & Grace – Episode titled \"Whatever Happened to Baby Gin?\" (2006) * Law and Order:SVU – Episode titled \"Choreographed\" (2006) * Boston Legal – Episode titled \"Guantanamo By The Bay\" (2007) * Grey's Anatomy – Episode titled \"Dream a Little Dream of Me\" (2008) * Living Proof (TV film, 2008) * Ugly Betty – Episodes titled \"Dress for Success\"; \"There's No Place Like Mode\", \"Things Fall Apart\", \"In The Stars\", and \"Curveball\" (2009) * Smash – Episodes titled \"The Workshop\" and \"Bombshell\" (2012). ===Concerts=== ;Major concerts * Various venues, summer of 1989: 10-city concert tour with Peter Allen.Evertz, Mary. \"Song and Dance: Just for this occasion, Allen has written a song\", St. Petersburg Times (Florida), July 14, 1989, p. 19Joyce, Mike. \"Peter Allen & Bernadette Peters\", The Washington Post, July 15, 1989, p. C7 * Hollywood Bowl, Los Angeles, California on September 6 and 7, 1996 (solo concert).Gieske, Tony. \"Bernadette Peters The Hollywood Bowl Friday, Sept. 6\", The Hollywood Reporter, September 9, 1996 * Carnegie Hall, New York City on December 9, 1996 (solo concert with guest singers/dancers, recorded on CD). * Sydney Opera House, Sydney, Australia on January 7 and 8, 1998 (solo concert).Hallett, Bryce. \"Peters masters a scratchy start\", The Weekend Australian, January 10, 1998, p. 8 * Royal Festival Hall, London on September 17, 1998 (solo concert with guest singers/dancers, recorded on video).Davis, Clive. \"Bernadette Peters, Festival Hall\", The Times, September 19, 1998Jones, Kenneth. \"Bernadette Peters Sings Sondheim in PBS Airing of London Concert\". Playbill.com, August 5, 1999, accessed July 5, 2008Gans, Andrew. \"Diva Talk: Peters The Great – The London Concert\". Playbill.com, July 16, 1999, accessed July 5, 2008 * Radio City Music Hall, New York City on June 19, 2002 (solo concert with guest singers).Gans, Andrew. \"Bernadette Peters Makes Solo Radio City Music Hall Concert Debut June 19\". Playbill.com, June 19, 2002, accessed July 5, 2008 * Lincoln Center (Avery Fisher Hall), New York City, on May 1, 2006 (solo concert).Gans, Andrew. \"Bernadette Peters Offers Sold-Out Solo Concert at Avery Fisher Hall May 1\". Playbill.com, May 1, 2006, accessed July 5, 2008 * Adelaide Cabaret Festival, Adelaide, Australia, on June 6 and 7, 2009 (solo concert). Peters headlined, and the concert was televised on June 27, 2009 on Foxtel. A DVD of the concert was released in Australia in June 2010.BWW news desk. \"BWW's First Look at the Australia Concert Poster for Bernadette Peters' Adelaide Cabaret Festival\". Broadwayworld.com, March 29, 2009\"An Evening With Bernadette Peters (DVD) listing\". Musicshop.com.au, retrieved June 2, 2010 * Benefit concert, \"Bernadette Peters: A Special Concert for Broadway Barks Because Broadway Cares\", Minskoff Theatre, New York City on November 9, 2009.Ross, Blake. \"About Last Night.... An Enchanted Evening with Enchantress, Bernadette Peters\". Playbill.com, November 6–12, 2009Gans, Andrew. \"Peters Concert Raises More Than Half a Million for Charities\". Playbill.com, November 10, 2009 ;Other notable concerts * \"Sondheim: A Celebration at Carnegie Hall\" – June 10, 1992 (broadcast on PBS Great Performances in 1993), singing \"Not a Day Goes By\" and \"Sunday\"Ruhlmann, William. \"Sondheim: A Celebration at Carnegie Hall\", Allmusic, accessed May 21, 2012 * \"Hey Mr. Producer! The Musical World of Cameron MacKintosh\" – June 7, 1998, singing, among others, \"Unexpected Song\", \"Being Alive\" and \"You Gotta Have a Gimmick\"Stringer, Robin. \"Even Sondheim and Lloyd Webber clown for Sir Cameron\", The Evening Standard (London), June 8, 1998, p. 5\" 'Hey Mr. Producer!' Listing\". albemarle-london.com, retrieved January 15, 2012 * Hollywood Bowl Sondheim Concert – July 8, 2005, performing in the \"Opening Doors Medley\" and \"Being Alive\".Gans, Andrew. \"Burnett, Cook, Peters, McDonald, Stritch and More Salute Sondheim July 8 at Hollywood Bowl\". Playbill.com, July 8, 2005, accessed July 5, 2008\"Photo Coverage: Sondheim at the Bowl Performance\". Broadwayworld.com, July 12, 2005 * \"Sondheim: The Birthday Concert\", the New York Philharmonic at Lincoln Center's Avery Fisher Hall, a celebration of Sondheim's 80th birthday – March 15 and 16, 2010. Peters sang \"Move On\" with Mandy Patinkin and \"Not a Day Goes By\".Gans, Andrew and Hetrick, Adam. \"Sondheim! The Birthday Concert DVD, with Patti LuPone and Bernadette Peters, Arrives Nov. 16\". Playbill.com, 16 November 16, 2010, accessed February 23, 2012 ===Discography=== ;Solo recordingsBernadette Peters at Allmusic.com, accessed November 3, 2011 * Bernadette Peters (1980) MCA. Billboard 200 #114 (retitled and expanded as Bernadette in a 1992 CD reissue) * \"Gee Whiz!\" (\"Look at His Eyes\") (1980) Billboard Hot 100 #31 (single) * Now Playing (1981) MCA US Billboard 200 #151 * I'll Be Your Baby Tonight (1996) Angel Records – Grammy Award nominee * Sondheim, Etc. – Bernadette Peters Live At Carnegie Hall (1997) Angel Records – Grammy Award nominee\"Bernadette Peters\" . Sondheim, Etc. – Pandora Internet Radio, accessed July 3, 2008 * Bernadette Peters Loves Rodgers and Hammerstein (2002) Angel Records – Grammy Award nominee * Sondheim Etc., Etc. Live At Carnegie Hall: The Rest of It (2005) Angel Records * \"Kramer's Song\" (2008) Blue Apple Books (single) * \"Stella's Song\" (2010) Blue Apple Books (single) ;Cast recordings * George M! – Sony (1968) * Dames At Sea – Columbia Masterworks (1969) * Mack and Mabel – MCA (1974) * Sunday in the Park with George – RCA Records (1984) – Grammy Award winner (Best Cast Show Album, 1985) * Song and Dance – The Songs – RCA Victor (1985) * Into The Woods – RCA Victor Records (1988) – Grammy Award winner (Best Musical Cast Show Album, 1989) * The Goodbye Girl – Columbia Records (1993) * Anyone Can Whistle Live At Carnegie Hall – Columbia Records (1995) * Annie Get Your Gun The New Broadway Cast Recording – Angel Records (1999) – Grammy Award winner (Best Musical Show Album, 2000) * Gypsy The New Broadway Cast Recording – Angel Records (2003) – Grammy Award winner (Best Musical Show Album, 2004) * Sherry! – Studio Cast Recording – Angel Records (2004) * Legends Of Broadway-Bernadette Peters Compilation (2006) – Sony Masterworks Broadway (Original versions of songs from Dames At Sea, Annie Get Your Gun, Anyone Can Whistle, Sunday in the Park with George, Mack and Mabel, Song and Dance, Into The Woods and Gypsy)\"Legends of Broadway\". Amazon.com, retrieved November 19, 2009 * Follies – PS Classics (2011) ;Other recordings * Dress Casual – Evening Primrose suite with Mandy Patinkin – CBS Records (1990)amazon.com listing and review * Sondheim – A Celebration at Carnegie Hall (Concert Cast) RCA Victor Broadway (1992) * Hey Mr. Producer!: The Musical World of Cameron Mackintosh – Philips Records (1998) * Flirting with the Edge – John Whelan – Narada (1998) * Dewey Doo-It Helps Owlie Fly Again – Randall Fraser Publishing (2005) * Born to the Breed: A Tribute to Judy Collins – Wildflower Records (2008) - \"Trust Your Heart\" ==References== Category:1948 births Category:Living people Category:American movie actors Category:American musical theatre actors Category:Actors from New York City Category:Singers from New York City",
 "title": "Bernadette Peters"
}