{
 "id": "278015",
 "text": "A parallelogram is a polygon with four sides (a quadrilateral). It has two pairs of parallel sides (line segments which never meet if the lines were allowed to extend beyond their end points). The opposite sides of a parallelogram have the same length (they are equally long). The word \"parallelogram\" comes from the Greek word \"parallelogrammon\" (bounded by parallel lines). Rectangles, rhombuses, and squares are all parallelograms. As shown in the picture on the right, because triangles ABE and CDE are congruent (have the same shape and size), :AE = CE :BE = DE. In all Parallelogram's opposite angles are equal to each other. Angles which are not opposite in the Parallelogram will add up to 180 degrees. ==Characterizations== A simple (non self-intersecting) quadrilateral is a parallelogram if and only if _any one_ of the following statements is true:Owen Byer, Felix Lazebnik and Deirdre Smeltzer, Methods for Euclidean Geometry, Mathematical Association of America, 2010, pp. 51-52.Zalman Usiskin and Jennifer Griffin, \"The Classification of Quadrilaterals. A Study of Definition\", Information Age Publishing, 2008, p. 22. *Two pairs of opposite sides are equal in length *Two pairs of opposite angles are equal in measure *The diagonals bisect each other *One pair of opposite sides are parallel and equal in length *Adjacent angles are supplementary *Each diagonal divides the quadrilateral into two congruent triangles *The sum of the squares of the sides equals the sum of the squares of the diagonals. (This is the parallelogram law) *It has rotational symmetry of order 2 *It has two lines of symmetry == Properties == # Opposite sides of parallelogram are parallel. # Any line through the midpoint of a parallelogram bisects the area. # Parallelograms are quadrilaterals. == Area formula == A parallelogram can be cut into a trapezoid and a right triangle, and be rearranged to make a rectangle. This mean the area of a parallelogram is the same with with a rectangle of the same height and base as that parallelogram: K=bh. == References == == Other websites == * Parallelogram and Rhombus - Animated course (Construction, Circumference, Area) * Interactive Parallelogram --sides, angles and slope Category:Polygons",
 "title": "Parallelogram"
}