{
 "id": "278323",
 "text": "Dexter's Laboratory (commonly abbreviated as Dexter's Lab) is an American science fiction animated television series. It was created by Genndy Tartakovsky for the Cartoon Network, as the first Cartoon Cartoon. The series was broadcast from 1996 to 2003. The series takes place in the fictional city of Genius Grove, California, and follows a red-haired boy named Dexter who had a secret laboratory filled with large number of his inventions. His inventions are normally destroyed by his older sister, Dee Dee. This causes Dexter to have to recreate his inventions. The series was followed by a feature movie, Dexter's Laboratory: Ego Trip (1999). == Characters == * Dexter is a red- haired genius. He works on inventions in his top-secret laboratory. His inventions help himself or the world. Dexter's inventions are usually smashed by his sister, Dee Dee. Dexter also keeps his lab a secret from his clueless parents. Dexter is motivated and inspired by Albert Einstein and other geniuses. Dexter has glasses, red hair, a lab coat and gloves and boots. He has his own lab pet monkey named Monkey (voiced by Frank Welker). The character was voiced by Christine Cavanaugh and Candi Milo. * Dee Dee is Dexter's sister. She is a tall blonde-haired girl. Dee Dee is high-spirited but not as smart as Dexter. She dances around Dexter's lab. Dee Dee usually plays around with Dexter and crushes his inventions. Dee Dee is interested in ballet and unicorns. She wears a short pink skirt and ballet shoes. Dee Dee is voiced by Allison Moore and Kat Cressida. * Dexter and Dee Dee's mother (Mom) is a loving but clueless red-haired woman who is unaware of Dexter's secret laboratory. She is a stereotypical mother, a mysophobe with OCD who has trouble being around the rest of the family without her rubber gloves. Dexter and Dee Dee's mother is voiced by Kath Soucie. * Dexter and Dee Dee's father (Dad) is a workaholic but also clueless blonde-haired man who is unaware of Dexter's secret laboratory. He is a stereotypical father, he loves bowling, golf, fishing, working in an office and has an unnatural affinity for his wife's muffins. Dexter and Dee Dee's father is voiced by Jeff Bennett. * Mandark Astronomonov is Dexter's black-haired arch-nemesis and rival. He is a brilliant scientist and fellow classmate who is always trying to one-up Dexter. He is also a very cruel and sadistic person who enjoys making Dexter's life miserable. Mandark has a large head and a small body, and he wears a red and black outfit. He is voiced by Eddie Deezen. * Beau is Dee Dee's love interest and crush. He is a kind and gentle boy who is always there for Dee Dee. He is also very intelligent and creative. Beau is interested in science and Albert Einstein. He is of English and German descent. He is of Caucasian heritage. Beau enjoys studying science, playing video games, watching movies, and reading comics. He is best friends with Dexter, and the two of them often work together to solve problems. Beau is a loyal friend and always has Dexter's back. He is voiced by Pamela Adlon. == Critical reception == The series was one of Cartoon Network president Betty Cohen's favorite animated programs. In an August 2002 Billboard interview, rapper Coolio said that he is a fan of the series. He states, \"I watch a lot of cartoons because I have kids. I actually watch more cartoons than movies.\" ==Notes== == References == Category:Cartoon Network series Category:American television series revived after cancellation Category:Television series created by Genndy Tartakovsky Category:English-language television programs Category:1990s American animated television series Category:2000s American animated television series Category:1990s American comedy television series Category:2000s American comedy television series Category:Comedy science fiction Category:Warner Bros. characters Category:1996 American television series debuts Category:2003 American television series endings Category:Cartoon Network original programming Category:Traditional animation",
 "title": "Dexter's Laboratory"
}