{
 "id": "278441",
 "text": "Off the Wall is the fifth studio album by the American singer Michael Jackson. It was released in 1979. 5 of the 10 songs on the album were released as singles: \"Don't Stop 'Til You Get Enough\", \"Rock with You\", \"Off the Wall\", \"She's Out of My Life\", and \"Girlfriend\". Three of them had videos. It sold over 8 million copies in the United States and 20 million copies around the world. The album got good reviews. Rolling Stone compared his vocals to the \"breathless, dreamy stutter\" of Stevie Wonder and described his tenor as \"extraordinary beautiful\". The first single, \"Don't Stop 'Til You Get Enough\", reached No.1. It won a Grammy Award for Best Male R&B; Vocal Performance in 1980. However, Jackson was disappointed at this. He said, \"It was totally unfair that it didn't get Record of the Year and it can never happen again\". Off the Wall was Jackson's first album produced by Quincy Jones. In 2001 a special edition of the album was released by Sony Records with 9 extra tracks. Rolling Stone put the album at number 68 on their list of the 500 greatest albums of all time in 2003. In 2008 the album became part of the Grammy Hall of Fame. ==Track listing== # \"Don't Stop 'Til You Get Enough\" (Michael Jackson) – 6:05 # \"Rock with You\" (Rod Temperton) – 3:40 # \"Working Day and Night\" (Jackson) – 5:14 # \"Get On the Floor\" (Jackson, Louis Johnson) – 4:39 # \"Off the Wall\" (Temperton) – 4:05 # \"Girlfriend\" (Paul McCartney) – 3:05 # \"She's Out of My Life\" (Tom Bahler) – 3:37 # \"I Can't Help It\" (Stevie Wonder, Susaye Greene) – 4:29 # \"It's the Falling In Love\" (featuring Patti Austin) (Carole Bayer Sager, David Foster) – 3:48 # \"Burn This Disco Out\" (Temperton) – 3:41 == Track listing == Notes * The original LP, cassette pressings and some early CD issues pressed in Japan contain the original mixes of \"Rock with You\" and \"Get on the Floor\". * Every song on the album is available either as A or B sides of single releases both in 7 or 12 inch format. Seven of the songs out of ten saw US release either as A or B sides and the UK had the remaining three songs available also as A or B sides of singles. As of 2000 the singles are available in both 7 and 12 inch formats and few different mixes, even though some releases have been more targeted to a UK/Europe audience. The original album mix of the title track is not available as a single and the original mix was kept for future reissues of the album, unlike the two songs mentioned in the upper note, the single mix did not replace the title track on all future reissues. == References == Category:1979 albums Category:Michael Jackson albums Category:Disco albums Category:Funk albums Category:R&B; albums Category:Epic Records albums",
 "title": "Off the Wall"
}