{
 "id": "278451",
 "text": "The Governor of the State of Kansas is the head of state for the State of Kansas. Under the Kansas Constitution, the Governor is also the head of government. The Governor is the Commander-in-Chief of the Kansas National Guard when not called into Federal use. Kansas has had 47 governors since becoming a state. The current governor is Laura Kelly. She started on January 14, 2019. Since 1962, the governor lives in the governor's mansion. ==List of Governors== === Governors of Kansas Territory === Governors of the Territory of Kansas Governor Term in office Appointed by 1 Andrew Horatio Reeder – August 16, 1855 Franklin Pierce 2 Wilson Shannon – August 18, 1856 3 John W. Geary – March 20, 1857 4 Robert J. Walker – December 15, 1857 James Buchanan 5 James W. Denver – November 1858 6 Samuel Medary – December 1860 === Governors of Kansas === Governors of the State of Kansas Governor Term in office Party Election Lt. Governor 7 Charles L. Robinson – January 12, 1863 (not candidate for election) Republican 1860 Joseph Pomeroy Root 8 Thomas Carney – January 9, 1865 (not candidate for election) Republican 1862 Thomas A. Osborn 9 Samuel J. Crawford – November 4, 1868 (resigned) Republican 1864 James McGrew 1866 Nehemiah Green 10 Nehemiah Green – January 11, 1869 (successor took office) Republican Succeeded from Lieutenant Governor Vacant 11 James M. Harvey – January 13, 1873 (not candidate for election) Republican 1868 Charles Vernon Eskridge 1870 Peter Percival Elder 12 Thomas A. Osborn – January 8, 1877 (not candidate for election) Republican 1872 Elias S. Stover 1874 Melville J. Salter 13 George T. Anthony – January 13, 1879 (not candidate for election) Republican 1876 Lyman U. Humphrey 14 John St. John – January 8, 1883 (lost election) Republican 1878 1880 David Wesley Finney 15 George Washington Glick – January 12, 1885 (lost election) Democratic 1882 16 John Martin – January 14, 1889 (not candidate for election) Republican 1884 Alexander P. Riddle 1886 17 Lyman U. Humphrey – January 8, 1893 (not candidate for election) Republican 1888 Andrew Jackson Felt 1890 18 Lorenzo D. Lewelling – January 14, 1895 (lost election) Populist 1892 Percy Daniels 19 Edmund Needham Morrill – January 11, 1897 (lost election) Republican 1894 James Armstrong Troutman 20 John W. Leedy – January 9, 1899 (lost election) Populist 1896 Alexander Miller Harvey 21 William Eugene Stanley – January 12, 1903 (not candidate for election) Republican 1898 Harry E. Richter 1900 22 Willis J. Bailey – January 9, 1905 (not candidate for election) Republican 1902 David John Hanna 23 Edward W. Hoch – January 11, 1909 (not candidate for election) Republican 1904 1906 William James Fitzgerald 24 Walter R. Stubbs – January 13, 1913 (not candidate for election) Republican 1908 1910 Richard Joseph Hopkins 25 George H. Hodges – January 11, 1915 (lost election) Democratic 1912 Sheffield Ingalls 26 Arthur Capper – January 13, 1919 (not candidate for election) Republican 1914 William Yoast Morgan 1916 27 Henry Justin Allen – January 8, 1923 (not candidate for election) Republican 1918 Charles Solomon Huffman 1920 28 Jonathan M. Davis – January 12, 1925 (lost election) Democratic 1922 Benjamin S. Paulen 29 Benjamin S. Paulen – January 14, 1929 (not candidate for election) Republican 1924 De Lanson Alson Newton Chase 1926 30 Clyde M. Reed – January 12, 1931 (not candidate for election) Republican 1928 Jacob W. Graybill 31 Harry Hines Woodring – January 9, 1933 (lost election) Democratic 1930 32 Alf Landon – January 11, 1937 (not candidate for election) Republican 1932 Charles W. Thompson 1934 33 Walter A. Huxman – January 9, 1939 (lost election) Democratic 1936 William M. Lindsay 34 Payne Ratner – January 11, 1943 (not candidate for election) Republican 1938 Carl E. Friend 1940 35 Andrew Frank Schoeppel – January 13, 1947 (not candidate for election) Republican 1942 Jess C. Denious 1944 36 Frank Carlson – November 28, 1950 (resigned) Republican 1946 Frank L. Hagaman 1948 37 Frank L. Hagaman – January 8, 1951 (successor took office) Republican Succeeded from Lieutenant Governor Vacant 38 Edward F. Arn – January 10, 1955 (not candidate for election) Republican 1950 Fred Hall 1952 39 Fred Hall – January 3, 1957 (resigned) Republican 1954 John McCuish 40 John McCuish – January 14, 1957 (successor took office) Republican Succeeded from Lieutenant Governor Vacant 41 George Docking – January 9, 1961 (lost election) Democratic 1956 Joseph W. Henkle Sr. 1958 42 John Anderson Jr. – January 11, 1965 (not candidate for election) Republican 1960 Harold H. Chase 1962 43 William H. Avery – January 9, 1967 (lost election) Republican 1964 John Crutcher 44 Robert Docking – January 13, 1975 (term limited) Democratic 1966 1968 James H. DeCoursey Jr. 1970 Reynolds Shultz 1972 Dave Owen 45 Robert Frederick Bennett – January 8, 1979 (lost election) Republican 1974 Shelby Smith 46 John W. Carlin – January 12, 1987 (term limited) Democratic 1978 Paul Dugan 1982 Thomas Docking 47 Mike Hayden – January 14, 1991 (lost election) Republican 1986 Jack D. Walker 48 Joan Finney – January 9, 1995 (not candidate for election) Democratic 1990 Jim Francisco 49 Bill Graves – January 13, 2003 (term limited) Republican 1994 Sheila Frahm (resigned June 11, 1996) Vacant Gary Sherrer (appointed July 18, 1996) 1998 50 Kathleen Sebelius – April 28, 2009 (resigned) Democratic 2002 John E. Moore 2006 Mark Parkinson 51 Mark Parkinson – January 10, 2011 (not candidate for election) Democratic Succeeded from Lieutenant Governor Vacant Troy Findley (appointed May 15, 2009) 52 Sam Brownback – January 31, 2018 (resigned) Republican 2010 Jeff Colyer 2014 53 Jeff Colyer – January 14, 2019 (not candidate for election) Republican Succeeded from Lieutenant Governor Tracey Mann (appointed February 14, 2018) 54 Laura Kelly – present Democratic 2018 Lynn Rogers ==References== * Category:1861 establishments in Kansas",
 "title": "List of governors of Kansas"
}