{
 "id": "278461",
 "text": "Melanie Griffith (born August 9, 1957) is an American actress. She is the daughter of Tippi Hedren. She has been in many motion pictures. She is an Academy Award nominee and Golden Globe winner for her performance in the 1988 movie Working Girl. ==Early life== She graduated from Hollywood Professional School when she was 16 years old.Alumni Hollywood Conservatory of Music and Arts web site Griffith began work at nine months old in a commercial.Melanie Griffith biography In Night Moves she did racy nude scenes at age 17. ==Personal life== At age 14, Griffith began dating 22-year old actor Don Johnson. He co-starred with her mother in The Harrad Experiment. Griffith was an extra. They had a six-month marriage in 1976. Tatum O'Neal said in her 2004 autobiography that around that time, she (then 12) and Griffith (then 18) were in an opium-fueled orgy in a Paris hotel room.O'Neal, Tatum (2004). A Paper Life. HarperCollins. .\"Melanie Griffith - Tatum O'neal Corrupted By Griffith\" 13 October 2004, Contactmusic.com In September 1981, Griffith married Steven Bauer. He was her co-star in the TV movie She's in the Army Now. They have a son, Alexander, born on August 22, 1985. The couple divorced in 1987. Griffith later said she had problems with cocaine and liquor after her divorce from Bauer. \"What I did was drink myself to sleep at night,\" she said. \"If I wasn't with someone, I was an unhappy girl.\"\"Not So Magic Johnson\" June 20, 1994, Vol. 41, No. 23, People She checked into rehab in 1988. During this time, she got back together with Johnson, became sober and pregnant. They remarried in June 1989. Their daughter, Dakota Johnson, was born on October 4, 1989. They separated in June 1994. They divorced in 1996. Griffith and Antonio Banderas began a relationship in May 1995 when they began filming Two Much. The couple has been married since May 14, 1996. Their daughter, Stella del Carmen Banderas Griffith, was born on September 24, 1996. There are reports of trouble in the marriage due to Antonio's closeness to an Indian Actress Mallika Sherawat. In June 2014, Griffith and Banderas stated that they are to divorce. The divorce was finalized in 2015. Her father, Peter Griffith, died at age 67 on May 14, 2001. In 1988, Griffith sought treatment for addiction to painkillers and alcohol after the filming of Working Girl. She went into rehab in 2000 for a painkiller addiction. She returned to rehab in August 2009 for substance abuse problems.\"Melanie Griffith: Return to Rehab Was Planned\" interview, August 26, 2009, Parade She left three months later and underwent surgery for skin cancer in December 2009. ==Honors== * Named \"Star of Tomorrow\" by the Motion Picture Booker's Club (1984) * Taormina International Film Festival — Diamond Award (2000) * Cannes Film Festival — Lifetime Achievement Award (2001) ==Filmography== Year Film Role Notes 1969 Smith! Extra Uncredited 1973 The Harrad Experiment Extra Uncredited 1975 Night Moves Delly Grastner The Drowning Pool Schuyler Devereaux Smile Karen Love 1976 Once an Eagle Jinny Massengale 1977 The Garden Young Girl One on One The Hitchhiker Joyride Susie 1978 Daddy, I Don't Like it Like This Girl in Hotel Steel Cowboy Johnnie 1981 Roar Melanie Underground Aces Lucy The Star Maker Dawn Barnett Youngblood She's in the Army Now Pvt. Sylvie Knoll Golden Gate Karen 1984 Fear City Loretta Body Double Holly Body National Society of Film Critics Award for Best Supporting Actress Nominated — Golden Globe Award for Best Supporting Actress – Motion Picture 1985 Alfred Hitchcock Presents Girl 1986 Something Wild Audrey Hankel aka Lulu Nominated — Golden Globe Award for Best Actress – Motion Picture Musical or Comedy 1987 Cherry 2000 Edith 'E' Johnson 1988 The Milagro Beanfield War Flossie Devine Stormy Monday Kate Working Girl Tess McGill Boston Society of Film Critics Award for Best Actress Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Nominated — Academy Award for Best Actress Nominated — BAFTA Award for Best Actress in a Leading Role 1990 Women and Men: Stories of Seduction Hadley In the Spirit Lureen Pacific Heights Patty Palmer The Bonfire of the Vanities Maria Ruskin 1991 Paradise Lily Reed 1992 Shining Through Linda Voss A Stranger Among Us Emily Eden 1993 Born Yesterday Billie Dawn 1994 Milk Money V Nobody's Fool Toby Roebuck 1995 Buffalo Girls Dora DuFran Nominated — Golden Globe Award for Best Supporting Actress – Series, Miniseries or Television Film Now and Then Tina 'Teeny' Tercell Two Much Betty Kerner 1996 Mulholland Falls Katherine Hoover 1997 Lolita Charlotte Haze 1998 Another Day in Paradise Sid Sant Jordi Award for Best Foreign Actress also for Crazy in Alabama Shadow of Doubt Kitt Devereux Celebrity Nicole Oliver 1999 Crazy in Alabama Lucille Vinson Sant Jordi Award for Best Foreign Actress also for Another Day in Paradise RKO 281 Marion Davies Nominated — Emmy Award for Outstanding Supporting Actress – Miniseries or a Movie Nominated — Golden Globe Award for Best Supporting Actress – Series, Miniseries or Television Film 2000 Cecil B. Demented Honey Whitlock Forever Lulu Lulu McAfee Released on DVD as Along for the Ride (2000) 2001 Tart Diane Milford 2002 Searching for Debra Winger Herself Stuart Little 2 Margalo the Bird Voice 2003 The Night We Called It a Day Barbara Marx Nominated — Australian Film Institute Award for Best Actress in a Supporting Role Shade Eve Tempo Sarah 2005 Heartless Miranda Wells 2007 Viva Laughlin Bunny Baxter Supporting role, TV series 2010 Nip/Tuck Brandie Henry Recurring role, TV series Eli Narrator Lead role, Movie 2011 Hot in Cleveland Herself Episode: \"Sisterhood of the Traveling SPANX\" 2012 This American Housewife Leila Lifetime original series ==References== ==Other websites== * Category:Actors from New York City Category:American child actors Category:American movie actors Category:American stage actors Category:American television actors Category:1957 births Category:Living people Category:American bloggers",
 "title": "Melanie Griffith"
}