{
 "id": "278584",
 "text": "Firestar's Quest is a teen fantasy novel in the Warriors series by Erin Hunter. It focuses on a cat named Firestar, the leader of a group of cats called ThunderClan, as he goes on a quest to rebuild a lost Clan called SkyClan. He is joined by his mate, Sandstorm. == Setting == The story begins in a forest, but after the main character goes on a journey, he ends up at a gorge. == Plot == Firestar's dreams are disturbed by wailing cats and feelings of fear and sadness. He finds out that the wailing cats are SkyClan cats, a lost Clan that was chased from the forest many years ago. The Clan has been forgotten by everyone else, because it has been such a long time since it was destroyed. Firestar realizes that he must go on a quest to rebuild this Clan, and he takes his mate, Sandstorm with him. Along the way, Firestar and Sandstorm are hit by a storm, and Sandstorm is washed away in a flood. Firestar is set behind schedule because he chooses to look for her instead of continue his journey. One he finds her, they begin their quest again, and eventually find the place where they knew they needed to go: a gorge. There, they seek out the last living descendant of SkyClan, and talk to him. His name is Sky. He tells them to look for more cats who may be descended from SkyClan, or who may be interested in joining the Clan. Those who do join are given warrior names and are taught about the way of the Clans. More and more cats join, and eventually, the newly rebuilt SkyClan, along with Firestar and Sandstorm, fight a gigantic swarm of rats. It is revealed that the rats are what killed off SkyClan after it left the forest many years ago. They defeat the rats, and their mission is completed. Firestar and Sandstorm leave SkyClan, knowing that its new leader, Leafstar, will lead it well. The book ends with an epilogue that shows Firestar and Sandstorm a few months later with their two new kits, Squirrelkit and Leafkit. Leafkit is named after Leafstar. Category:2007 books Category:Warriors books",
 "title": "Firestar's Quest"
}