{
 "id": "278501",
 "text": "An Electromagnetic Pulse, or EMP, is a burst of electromagnetic radiation (light, magnetism, electricity), and is caused by a huge release of energy. A \"common\" cause for an electromagnetic pulse is a nuclear explosion. A scientist named Enrique Fermi predicted that electromagnetic pulses would result from a nuclear weapon being launched. An EMP can damage electronic recording equipment and shut off digital clocks, regardless of their electronic shielding. == Further reading == * 21st Century Complete Guide to Electromagnetic Pulse (EMP) Attack Threats, Report of the Commission to Assess the Threat to the United States from Electromagnetic ... High-Altitude Nuclear Weapon EMP Attacks (CD-ROM) * Threat posed by electromagnetic pulse (EMP) to U.S. military systems and civil infrastructure: Hearing before the Military Research and Development Subcommittee ... first session, hearing held July 16, 1997 (Unknown Binding) * Electromagnetic Pulse Radiation and Protective Techniques * Report of the Commission to Assess the Threat to the United States from Electromagnetic Pulse (EMP) Attack ==Other websites== *Business Insider: Gauging The Threat Of An Electro-Magnetic Pulse Attack In The US * GlobalSecurity.org – Electromagnetic Pulse: From chaos to a manageable solution * Electromagnetic Pulse (EMP) and Tempest Protection for Facilities – U.S. Army Corps of Engineers * EMP data from Starfish nuclear test measured by Richard Wakefield of LANL, and review of evidence pertaining to the effects 1,300 km away in Hawaii, also review of Russian EMP tests of 1962 * Ray, James F. (2008). FULL THREAT. Baltimore: Publish America. * Read Congressional Research Service (CRS) Reports regarding HEMP * MIL-STD-188-125-1 * Electromagnetic Pulse Risks & Terrorism * How E-Bombs Work * Commission to Assess the Threat to the United States from Electromagnetic Pulse (EMP) Attack * NEMP and Nuclear plant Category:Nuclear weapons",
 "title": "Electromagnetic Pulse"
}