{
 "id": "278719",
 "text": "The Lincoln Town Car was a full-size luxury sedan produced by Ford's Lincoln division from 1980 to 2011. Initially introduced in 1980 as a 1981 model, the Town Car name had been used previously on the Lincoln Continental from 1959 to 1979. The Town Car became its own model starting in 1980, that gained popularity, especially in the limousine and funeral vehicle industries. == First Generation (1981-1989) == The first generation of the Lincoln Town Car was produced from 1981 to 1989. It was based on the Ford Panther platform and featured a traditional sedan design, characteristic of luxury vehicles of the time. The first-generation Town Car was a popular choice for chauffeur-driven transportation, with many used as limousines and funeral cars. == Second Generation (1990-1997) == The second generation of the Lincoln Town Car was introduced in 1990 with a complete redesign. It featured updated styling with rounded edges and new technology. The interior was redesigned and The second generation also had A facelift in 1995 that included a refreshed front end. == Third Generation (1998-2011) == The third generation of the Town Car debuted in 1998, featuring a more rounded and sleek design. This generation had upgrades to the suspension and interior quality. The Town Car continued to be used as a limousine, taxi, and hearse. In 2003, the model received a mild redesign that introduced rack-and-pinion steering and other updates to the exterior and interior. The Third generation was sold until the production ended in 2011. == Discontinuation == The Lincoln Town Car was discontinued in 2011 after over three decades of production. The decision was part of Lincoln's transition to newer vehicle platforms, such as the front-wheel- drive-based Lincoln MKS and Lincoln Continental. Although production ceased, the Town Car continued to be used as a limousine and funeral vehicle for some time. == Licensed Production in China == In China, a licensed version of the Lincoln Town Car was produced by FAW and rebadged as the Hongqi CA7460 and Hongqi Qijian from November 10, 1998, until 2005. The limousine versions are now known as the Hongqi Limousine L1, L2, and L3. In 1998, the price was 690,000 RMB (approximately US$109,710). The L3, introduced in 2001, had a wheelbase of 3,190 mm. The L1, introduced in 2002, had a wheelbase of 3,990 mm, while the L2, introduced in 2003, had the longest wheelbase at 5,339 mm. The limousine variant was priced at 1,350,000 RMB (approximately US$214,650). == References == Category:1980s automobiles Category:1990s automobiles Category:2000s automobiles Category:2010s automobiles Category:Sedans Town Car",
 "title": "Lincoln Town Car"
}