{
 "id": "278704",
 "text": "A smartphone is a mobile phone that can also be used as a computer. They work as a computer but are mobile devices small enough to fit in a people's hand. They use a System on a chip or Minimal instruction set computer so they can be small. Uses include: * Sending and receiving emails, text, photographs and multimedia messages * Registering contacts * Calculator, currency conversions, alarm, etc. functions * Browsing the Internet using a mobile browser * Playing games * Video chat * Mobile payment for goods or services * Barcode scanning * Photography and video recording * Use as torch to make light in dark areas * Taking and searching notes * Showing map of user's location by GPS (Global Positioning System) Another way to think of them is that they are PDAs that can make voice calls like any other mobile phone. Older phones also used computer technology, but lacked many of the parts of a computer that were too big to fit into a phone. Modern phone makers have been able to use smaller parts. Most smartphones are also GPS receivers and digital cameras. Because smartphones are small computers, they run an operating system that is often common between devices to ensure compatibility. The majority of smartphones run on Apple iOS or Google Android but others use Windows Phone or BlackBerry OS. Most can do multitasking, running more than one program which helps the user do things quicker and easier. Users can get more programs, called mobile apps, from the manufacturer's app store, such as the Apple App Store and Google Play which can help them complete special tasks. Data communication has become faster. Smart phones can send and receive data much faster than older phones. The industry uses different standards to label the data transmission rates. 2G was introduced in 1991. 2G means 2nd Generation. 2G phones transmit data at about the same speed as a 56kbit/s (kilobits per second) dial-up modem would get. 3G was introduced in the early 2000s. Depending on where they are, 3G phones vary in speed between about 200kbit/s to 14Mbit/s (megabits per second). This is comparable to a DSL or low end cable modem speed. Most smart phones use 3G technology to make them fast enough to practically use internet and other data features. Faster 4G networks operate in many places, with speeds estimated as fast as 100Mbit/s to 1Gbit/s (gigabit per second). This is as fast as some computer networks that use ethernet. Many smart phones introduced after 2010 use 4G technology including LTE, as later, even faster version. 5G was introduced in a few places in 2019. Smartphones are powered by rechargeable batteries. The amount of energy they can store is reduced over time, and they become weaker. This causes the phone to become slower and later to turn itself off without the user asking for it. Until 2010 most smartphones were made so the user could easily replace the weakened battery. Most newer smartphones are not made like this. == Use as camera == Smartphones also works as a camera. They are usually not as capable as dedicated cameras. Some phones have sophisticated camera software allowing such features as independent setting of bitrate, framerate and resolution. Such controls have only been adapted starting in the mid-2010s. As of early 2021, mobile phone chipsets may be capable of 2160p 4K video capture at 120 frames per second. == Related pages == * Mobile phone * Android * iPhone * Windows Phone * BlackBerry * Symbian == References == == Other websites == Category:Smartphones",
 "title": "Smartphone"
}