{
 "id": "278790",
 "text": "The title Duke of Normandy was given to the rulers of the duchy of Normandy. This fief was created in 911 by Charles the Simple King of France for Rollo, a leader of Northmen.David C. Douglas, William the Conqueror; The Norman Impact upon England (Berkeley; Los Angeles, University of California Press, 1964), p. 16 In 1066 the seventh duke, William II, became King William I of England. The title of Duke of Normandy was held by the Kings of England until Henry III gave up the title by treaty in 1259.John Le Patourel, Feudal empires: Norman and Plantagenet (London: Hambledon Press, 1984), p. 200 King John had lost mainland Normandy in 1204, and kept only the Channel Islands.W L Warren, King John (Berkeley: University of California Press, 1978), p. 99 Today the Channel Islands are a British Crown dependency.The World Factbook 2010, prepared by the Central Intelligence Agency (Washington, DC: Potomac Books, Inc., 2010), p. 327 In 1660 when King Charles II was restored to the throne, the King of France, Louis XIV, created Charles' brother James Duke of Normandy, probably as a show of support for monarchy and to stop Charles claiming the title himself. ==Early Dukes of Normandy (911-1204)== === House of Normandy === *Rollo (911–928) *William I Longsword (928–942) *Richard I (942–996) *Richard II the Good (996–1026) *Richard III (1026–1027) *Robert I The Magnificent (1027–1035) *William the Conqueror* (1035–1087) (William II as Duke of Normandy, William I as King of England) *Robert II Curthose (1087–1106) **William Rufus* as regent (1096–1100) **William Clito as claimant (1106–1134) *Henry I Beauclerk* (1106–1135) **William III Atheling (Under his father, Henry I) === House of Blois === *Stephen of Blois* (1135–1144) (usurped from Empress Matilda) === House of Plantagenet === *Geoffrey Plantagenet (1144–1150) (jure uxoris) *Henry II* (1150–1189) **Henry the Young King* as junior duke (1170–1183) *Richard IV Lionheart* (1189–1199) *John Lackland* (1199–1216), lost mainland Normandy in 1204. *Henry III* (1216–1259), renounced mainland Normandy and the ducal title by Treaty of Paris (1259). == Notes == == References == Category:Dukes and duchesses of Normandy Category:Kings and Queens of England Category:Channel Islands",
 "title": "Duke of Normandy"
}