{
 "id": "278818",
 "text": "Rod R. Blagojevich (born December 10, 1956) was 40th Governor of Illinois beginning January 13, 2003 and ending January 29, 2009. He succeeded George Ryan, who would also be arrested for non-related charges. Blagojevich was the first Governor of Illinois to be impeached while in office and the first Democratic politician in over 25 years to face such charges. In February 2020, President Donald Trump ended Blagojevich's prison sentence four years earlier. ==Early life== Blagojevich was born in Chicago, Illinois, the second of four children. His father, Radislav, was an immigrant steel plant laborer from a village near Kragujevac, Serbia.Copley News Service. Three Democrats battle for party's nomination for governor. March 9, 2002. Blagojevich graduated from Chicago's Foreman High School after transferring from Lane Technical High School. He began boxing at a young age. ==Governor of Illinois== During 2002, Blagojevich campaigned for his party's nomination to become governor. Blagojevich won a close primary campaign against former Illinois Attorney General Roland Burris and Chicago Public Schools Superintendent Paul Vallas, who ran well in the suburban collar counties of Chicago. Blagojevich finished strongly in Southern Illinois, winning 55% of the primary vote downstate, enough to win a primary victory by a thin margin. In the general election, Blagojevich defeated Topinka and the Green Party's Rich Whitney, outspending Topinka $27 million to $6 million. He attempted to tie Topinka to former Republican governor George Ryan's corruption. Blagojevich won re-election. ==Arrest and conviction== He was arrested in December 2008 on federal corruption charges, including conspiracy to commit mail and wire fraud.Source: Feds take Gov. Blagojevich into custody Chicago Breaking News. Retrieved December 9, 2009. Blagojevich was later impeached during January 2009, convicted and removed from office on January 29, 2009. On December 7, 2011, Blagojevich was sentenced to 14 years in federal prison. He is held at Federal Correctional Institution, Englewood in Jefferson County, Colorado. On May 31, 2018, President Donald Trump, soon after having pardoned commentator Dinesh D'Souza, told reporters that he was considering reducing Blagojevich's sentence (without pardoning him). Trump called Blagojevich's 14-year sentence \"unfair\", saying that Blagojevich's statements about enriching himself were \"stupid\", but also the sort of thing \"that many other politicians say\". President Donald Trump commuted his sentence on February 18, 2020, ending his sentence four years early. On February 10, 2025, President Donald Trump issued a full and unconditional pardon to Blagojevich using the power given to presidents in the Constitution. While Blagojevich had already been walking free since Trump’s 2020 commutation of his sentence, the pardon cleared Blagojevich’s criminal record. ==Personal life== Blagojevich has been married to Patricia Mell Blagojevich. They have two children. His family owns a home in Ravenswood, Chicago, but live in Jefferson County, Colorado because of Blagojevich's prison stay. ==References== Category:American fraudsters Category:American prisoners Category:American boxers Category:United States representatives from Illinois Category:Criminals from Chicago Category:Governors of Illinois Category:1956 births Category:Living people Category:Lawyers from Chicago",
 "title": "Rod Blagojevich"
}