{
 "id": "278896",
 "text": "This article lists Dukes, Electors, and Kings ruling over territories named Saxony from the beginning of the Saxon Duchy in the 9th century to the end of the Saxon Kingdom in 1918. ==Dukes of Saxony== The original Duchy of Saxony was the lands of the Saxon people in the north-western part of present-day Germany, namely, the modern German state of Lower Saxony as well as Westphalia and Western Saxony-Anhalt, not the modern German state of Saxony. Early dukes * Hadugato (ruled about 531) * Berthoald (ruled about 627) * Theoderic (ruled about 743-744) * Widukind (ruled about 777-810) * Abo (ruled about 785-811) Hattonid dynasty * Banzleib (830s) ===Ottonian Dynasty === Monarch Image Began Ended Notes Liudolf I 850 12 March 864 or 866 Bruno 12 March 864 or 866 2 February 880 Otto I the Illustrious 2 February 880 30 November 912 Henry I the Fowler 30 November 912 2 July 936 Also King of the Germans 919-936 Otto II the Great 2 July 936 961 Also King of the Germans 936-973, Emperor 962-973 ===Billung Dynasty=== Monarch Image Began Ended Notes Hermann 961 27 March 973 Bernard I 27 March 973 9 February 1011 Bernard II 9 February 1011 29 June 1059 Ordulf 29 June 1059 28 March 1072 Magnus 28 March 1072 23 August 1106 ===Supplinburg Dynasty === Monarch Image Began Ended Notes Lothair I 1106 4 December1137 Also German King 1125-1137, Emperor 1133-1137 ===Welf Dynasty === Monarch Image Began Ended Notes Henry II the Proud 4 December 1137 20 October 1139 Also Duke of Bavaria as Henry X ===Ascanian Dynasty === Monarch Image Began Ended Notes Albert I the Bear 20 October 1139 1142 Also Margrave of Brandenburg ===Welf Dynasty === Monarch Image Began Ended Notes Henry III the Lion 1142 1180 Also Duke of Bavaria as Henry XII When the Welfs left in 1180, the Duchy of Saxony lost a lot of territory. Westphalia fell to the Archbishop of Cologne, while the Duchies of Brunswick and Lüneburg remained with the Welfs. The Ascanian Dukes had their base further east, near the Elbe, so the name Saxony moved towards the east. The post carve-up Saxony is therefore sometimes called the younger Duchy of Saxony. Also the counting of its dukes its mixed up. While the first post carve-up duke is sometimes called Bernard III - because of two predecessors of the same name before 1180 - or Bernard I with his great-great-great-great grandson Bernard II being counted second. The second post carve-up duke Albert I is already usually counted as the first, although before 1180 he had one predecessor of the same name, his grandfather Albert the Bear. ===Ascanian or younger Duchy of Saxony=== The new dukes changed the Saxon horse emblem () and used their Ascanian family colours and emblem (black and gold stripes) () and added a \"bendwise crancelin\", a crown diagonally across the coat of arms, symbolising the Saxon ducal crown, as new coat-of-arms of Saxony (). The later rulers of the House of Wettin adopted the Ascanian coat-of-arms. Dukes of Saxony Ascanian Dynasty Image Name Date Notes Bernard I (or III) 1180–1212. numberings starting with Ascanian rule or continuing after prior dukes of the same name. Father of the following Albert I 1212-1260. father of the following two dukes John I 1260–1282. joint rule with his brother Albert II until 1282, when John I resigned. Some time after 1272 John I and Albert II divided some areas between themselves, however. Albert II 1260–1296. joint rule with his brother until 1282, then fostering John I's minor sons Albert III, Eric I, and John II, who later ascended as co- rulers. In 1296 uncle and nephews partitioned Saxony into the Lauenburg line (Albert III, Eric I, and John II jointly) and the Wittenberg line, where Albert II continued as sole ruler until 1298, then succeeded by his son Rudolph I (see section Dukes of Saxe-Wittenberg below in this arcticle). Uncle of the following three dukes Albert III, 1282–1296. joint rule with his uncle Albert II and his brothers Eric I and John II until 1296. In 1296 uncle and brothers partitioned Saxony into the Wittenberg line (Albert II) and the Lauenburg line, where Albert III, Eric I, and John II continued to rule jointly (see section Dukes of Saxe-Lauenburg below in this arcticle). Brother of the following two dukes Eric I, 1282–1296. joint rule with his uncle Albert II and his brothers Albert III and John II until 1296. In 1296 uncle and brothers partitioned Saxony into the Wittenberg line (Albert II) and the Lauenburg line, where Albert III, Eric I, and John II continued to rule jointly (see section Dukes of Saxe-Lauenburg below in this article). Brother of the following duke John II, 1282–1296. joint rule with his uncle Albert II and his brothers Albert III and Eric I until 1296. In 1296 uncle and brothers split Saxony into the Wittenberg line (Albert II) and the Lauenburg line, where Albert III, Eric I, and John II continued to rule jointly (see section Dukes of Saxe-Lauenburg below in this article) In 1296 Albert II and his nephews Albert III, Eric I, and John II ended their joint rule and split Saxony into the Lauenburg line, where Albert III, Eric I, and John II continued to rule jointly until 1303, and the Wittenberg line, where Albert II continued as sole ruler until 1298. ====Dukes of Saxe-Lauenburg==== Since the Duke of Saxony was considered one of the prince-electors electing a new Holy Roman Emperor, there was an argument between the lines of Lauenburg and Wittenberg about who should cast Saxony's vote. In 1314 both lines found themselves on different sides in a double election. Eventually, the Dukes of Saxe-Wittenberg succeeded in 1356 after the promulgation of the Golden Bull. To distinguish him from other rulers bearing the title Duke of Saxony, he was commonly called Elector of Saxony. * Eric I 1296–1303 joint rule, then ruling until 1360 in Saxe-Bergedorf, partitioned from Saxe-Lauenburg (see section Dukes of Saxe-Ratzeburg-Lauenburg below in this article) * John II 1296–1303 joint rule, then ruling until 1321 in Saxe-Ratzeburg, partitioned from Saxe- Lauenburg (see section Dukes of Saxe-Bergedorf-Mölln below in this article) * Albert III 1296–1303 joint rule, then ruling until 1308 in Saxe-Ratzeburg, partitioned from Saxe-Lauenburg, dying without issue Eric I inherited his share In 1303 the brothers split their inheritance between them, however, only two brothers had heirs creating the Bergedorf-Mölln and the Ratzeburg- Lauenburg lines. =====Dukes of Saxe-Bergedorf-Mölln===== First named Saxe- Mölln, however, renamed after reorganising territory, including parts of Albert III's share in 1321. * John II, 1285–1321, rivalled as Saxon Prince- Elector by his cousin Rudolph I of Saxe-Wittenberg * Albrecht (Albert) IV, 1321–1343. * John III, 1343–1356. * Albrecht (Albert) V, 1356–1370. * Eric III, 1370–1401. In 1401, the elder branch became extinct and Lauenburg rejoined the Ratzeburg-Lauenburg line. =====Dukes of Saxe-Ratzeburg- Lauenburg===== First named Saxe-Bergedorf-Lauenburg, however, renamed after reorganising territory, including parts of Albert III's share in 1321. * Eric I, 1305–1361 (joint rule until 1308). * Eric II, 1361–1368. * Eric IV, 1368–1412.His wife was Sophia of Brunswick and Lunenburg (Wolfenbüttel) and they had Catharina of Saxe-Lauenburg (mar. Henry IV, Duke of Mecklenburg- Schwerin) as daughter. In 1401, the younger branch inherited Lauenburg and other possessions of the extinct elder Bergedorf-Mölln line. ====Dukes of Saxe-Lauenburg (1401-1876)==== Dukes of Saxe-Lauenburg Ascanian Dynasty, Lauenburg Line Image Name Date Notes Eric V 1401–1436. joint rule with his father Eric IV (till 1411), his younger brother John IV (till 1414) and his youngest brother Bernard II (since 1426) John IV 1401–1411/1414 joint rule with his father Eric IV (till 1411) and his elder brother Eric V. Brother of the following Bernard IIHis wife was Adelheid of Pomerania and they had Sophie of Saxe-Lauenburg (before 1428-1473) as daughter, married to Gerhard VII, Duke of Jülich. 1426–1463 joint rule with his brother Eric V until 1436. Father of the following duke John VHis wife was Dorothea of Brandenburg (c. 1446 - March, 1519, daughter of Frederick II, Elector of Brandenburg). Their children were Eric of Saxe-Lauenburg (1472 - 20 October 1522, as Eric I Prince-Bishop of Münster, as II Prince-Bishop of Hildesheim) and Sophia of Saxe-Lauenburg (mar. in ca. 1420, d. 1462, mother of Eric II, Duke of Pomerania). 1463–1507 father of the following duke Magnus I, 1507–1543. father of the following duke Francis IHe married on 8 February 1540 Sybille of Saxe-Wittenberg (Freiberg, 2 May 1515 - 18 July 1592, Buxtehude), daughter of Henry IV of Saxe-Wittenberg. Their children were Henry of Saxe-Lauenburg (as Henry II Prince-Bishop of Osnabrück, as III Prince-Archbishop of Bremen and as IV Prince-Bishop of Paderborn), Sidonia Katharina of Saxe-Lauenburg (mar. with Wenceslaus III Adam, Duke of Cieszyn) and Ursula of Saxe-Lauenburg-Ratzeburg (mar. with Henry, Duke of Brunswick and Lunenburg (Dannenberg)). 1543–1571 and again 1573–1581. joint rule with his son Francis II since 1578. Father of the following three dukes Magnus IIHis wife was Sophia of Sweden. 1571–1573. brother of the following two dukes Francis IIHis wife was Mary of Brunswick and Lunenburg (Wolfenbüttel) (1566-1626, daughter of Julius, Duke of Brunswick and Lunenburg (Wolfenbüttel)) and they had daughters Juliane of Saxe-Lauenburg (26 December 1589 - 1 December 1630, mar. 1 August 1627), married to Friedrich, Duke of Schleswig-Holstein-Sonderburg-Norburg, and Sophie Hedwig of Saxe-Lauenburg (24 May 1601 - 1 February 1660, mar. 23 May 1624) with Philipp, Duke of Schleswig-Holstein-Sonderburg-Glücksburg. 1578–1619. since 1578 viceregent, since 1581 administrator. Joint rule with his brother Maurice between 1581 and 1612. Father of Augustus and Julius Henry Maurice 1581–1612. joint rule with his brother Francis II. Uncle of the following two dukes AugustusHis wife was Elisabeth Sophie of Holstein-Gottorp, daughter of John Adolf, Duke of Holstein-Gottorp. Their daughter was Anna-Elisabetha of Saxe- Lauenburg (23 August 1624 - 1688, mar. 2 April 1665), wife of William Christoph, Landgrave of Hesse-Homburg. 1619–1656. brother of the following duke Julius Henry He married three times: 1) Anne of Ostfriesland, 2) on 27 February 1628 Elisabeth Sophia of Brandenburg (13 July 1589–24 December 1629), daughter of John George, Elector of Brandenburg and mother of Duke Francis Erdmann, and 3) on 18 August 1632 Anna Magdalene, Baroness Popel von Lobkowitz (d. 7 September 1668), the only to ascend with him to the throne on 18 January 1656. She was mother of Duke Julius Francis. 1656–1665. father of the following two dukes Francis Erdmann 1665–1666. elder son of Julius Henry and his second wife. Julius Francis His wife was Hedwig of Palatine Sulzbach (15 April 1660 - 23 November 1681; daughter of Christian Augustus, Count Palatine of Sulzbach) and they had Anna Maria Franziska of Saxe-Lauenburg and Sibylle Auguste of Saxe-Lauenburg as daughters. 1666–1689. younger son of Julius Henry and his third wife. In 1689 the Saxe-Lauenburgian Ascanians were extinct in the male line. The House of Welf usurped the duchy, inhibiting the heiress Anna Maria Franziska of Saxe-Lauenburg, and resucceeded with its Brunswick and Lunenburg-Celle line. Welf Dynasty, Lüneburg Line Image Name Date Notes George William 1689–1705. he invaded with his troops Saxe- Lauenburg, stopping the legal female heir, Duchess Anna Maria Franziska of Saxe-Lauenburg. This takeover was only imperially legitimised in 1728. He was a great-great grandson of Magnus I through his great grandmother Dorothea of Saxe-Lauenburg Welf Dynasty, Hanover Line George I Louis 1705–1727. he was a nephew and son-in-law of George William. George II Augustus 1727–1760. in 1728 Emperor Charles VI granted George II Augustus with Saxe-Lauenburg, finally legitimising the de facto takeover by his grandfather. George III 1760–1814. de facto deposed by various occupations in the Great French War, he was a grandson of George II Augustus George III's son, Regent George agreed to pass Saxe-Lauenburg to his Danish cousin in a general reorganisation of land at the Congress of Vienna Dukes of Saxe-Lauenburg Oldenburg Dynasty, Main Line Image Name Date Notes Frederick I 1814–1839. Frederick was a great-grandson of Duke George II Augustus from both sides through his mother Caroline and his father. The official colours of Saxe-Lauenburg were changed to red and gold. Christian I 1839–1848. half nephew of the former, but not related to the Saxe-Lauenburgian Welfs, however, grandson in sixth generation of Duke Francis I Frederick II 1848–1863. son of the former Oldenburg Dynasty, Glücksburg Line Christian II 1863–1864. deposed in Second Schleswig War and resigned by Treaty of Vienna. His mother was a cousin of Frederick I and Christian I as well as maternally and paternally a great-granddaughter of George II Augustus. Dukes of Saxe-Lauenburg Hohenzollern Dynasty, Berlin Line Image Name Date Notes William 1865–1876. the Estates of Saxe-Lauenburg offered him the ducal throne in 1865, he accepted. He was a grandson in sixth generation of Duke George William. The coat-of-arms of Saxe-Lauenburg was changed to the colours red and silver, with a rim in the Prussian colours black and white. Duke and estates decided to merge Saxe- Lauenburg as district Duchy of Lauenburg into Prussia with effect of 1 July 1876. The Ascanian Dynasty continued in Saxe-Lauenburg until 1689, but after the Lauenburg line had finally lost the Saxon Electorate to the Wittenberg line in 1356 and failed to obtain the succession in the Electorate after 1422, recognition of the Dukes of Saxe-Lauenburg as Dukes of Saxony waned. ====Dukes of Saxe-Wittenberg==== For the predecessor see the section Ascanian or younger Duchy of Saxony above in this article. Dukes of Saxe-Wittenberg Ascanian Dynasty Image Name Date Notes Albert II 1296–1298. 1260–1296 joint rule of Saxony with his brother John I, Duke of Saxony (till 1282) and thereafter with the latter's sons Albert III, Eric I, and John II. In 1296 uncle and nephews had partitioned Saxony into the Wittenberg line, where Albert II continued as sole ruler, and the Lauenburg line, where his nephews ruled jointly (see section Dukes of Saxe-Lauenburg below in this article). Father of the following duke Rudolph I 1298-1356 rivalled as Saxon Prince-Elector by his cousin John II. In January 1356 the Golden Bull confirmed Rudolph I as the legitimate Saxon Prince-Elector, thus the rulers of Saxe-Wittenberg are conceived as Electors of Saxony since (see section Electors of Saxony below in this article). ===Wettin Dukes of Saxony=== ====Albertine Dukes of Saxony==== The Albertines were a junior branch of the Wettin dynasty of Electors of Saxony (section below), who ruled in Northern Thuringia and Southern Meissen until they replaced the senior \"Ernestine\" branch as Electors and rulers of most Saxon territory in 1547. Dukes of Saxony Wettin Dynasty, Albertine Line Image Name Date Notes Albert the Bold 1464-1500. Younger son of Frederick II, Elector of Saxony. Divided the Saxon lands, including Thuringia and Meissen, with his brother Ernest in 1485. George the Bearded 1500-1539 Son of Albert. Opposed Martin Luther. Henry IV the Pious 1539-1541 Brother of George. Introduced Lutheranism to Albertine Saxony. Maurice 1541-1553 Son of Henry IV. Became Elector 1547. ====Ernestine Dukes of Saxony==== Following their displacement by the Albertines, the Ernestine branch of the Wettins continued to rule in southern Thuringia as \"Dukes of Saxony\", but their lands eventually split up into many different tiny \"Ernestine duchies\". Of these, Saxe-Weimar- Eisenach, Saxe-Coburg-Gotha, Saxe-Meiningen, and Saxe-Altenburg lasted until 1918. This article does not list the subsequent Ernestine dukes. ==Electors of Saxony== The Golden Bull of 1356 confirmed the right to participate in the election of a Holy Roman Emperor to the Duke of Saxony in the Saxe-Wittenberg line. For the predecessor see the section Ascanian Dukes of Saxe-Wittenberg above in this article. Electors of Saxony Ascanian Dynasty Image Name Began Ended Notes Rudolf I 10 January 1356 11 March 1356 Rudolf II 11 March 1356 6 December 1370 Son of preceding. Wenceslaus Wenzel 6 December 1370 15 May 1388 Brother of preceding. Rudolf III 15 May 1388 9 June 1419 Son of preceding. Albert III Albrecht II 9 June 1419 27 November 1422 Brother of preceding. Wettin Dynasty Image Name Began Ended Notes Frederick I Friedrich I 6 January 1423 4 January 1428 Nicknamed \"the Warlike.\" After the Wittenberg line of the Ascanians became extinct, the Electorate was given to Frederick, Margrave of Meissen and Landgrave of Thuringia, of the House of Wettin. Frederick II Friedrich II 4 January 1428 7 September 1464 Nicknamed \"the Gentle\". Son of Frederick I. Ruled jointly in Saxony with his brothers, but was the sole holder of the Electorate. Father of Ernest and Albert, founders of the Ernestine (continuing below) and Albertine Saxon lines (see section Albertine Dukes of Saxony above in this article). Ernestine Line Ernest Ernst 7 September 1464 26 August 1486 Son of Frederick II, divided Saxony with his brother Albert, taking Wittenberg, northern Meissen, and southern Thuringia. Inherited Thuringia in 1482 and ruled it jointly with Albert until 1485. Frederick III Friedrich III 26 August 1486 5 May 1525 Nicknamed \"the Wise.\" Son of Ernest. Protector of Martin Luther, but a lifelong Catholic. John Johann 5 May 1525 16 August 1532 Nicknamed \"the Steadfast.\" Brother of Frederick III. Legally established Lutheranism in his territories in 1527. John Frederick I Johann Friedrich I 16 August 1532 19 May 1547 Son of John the Steadfast. Called \"the Magnanimous\". Deprived of his Electorate by Emperor Charles V for his role in the Schmalkaldic War. Died 1554. Albertine Line Maurice Moritz 4 June 1547 11 July 1553 Second cousin of John Frederick, grandson of Albert. Though a Lutheran, allied with Emperor Charles V against the Schmalkaldic League. Gained the Electorate for the Albertine line in 1547 after Charles V's victory at the Battle of Mühlberg. Augustus I August I 11 July 1553 12 February 1586 Brother of Maurice. Recognized as Elector by the ousted John Frederick in 1554. Christian I 12 February 1586 25 September 1591 Son of Augustus I. Christian II 25 September 1591 23 June 1611 Son of Christian I. John George I Johann Georg I 23 June 1611 8 October 1656 Brother of Christian II, ruled during the Thirty Years' War, during which he was at times allied with the Emperor and at times with the King of Sweden. John George II Johann Georg II 8 October 1656 1 September 1680 Son of John George I. John George III Johann Georg III 1 September 1680 22 September 1691 Son of John George II. John George IV Johann Georg IV 22 September 1691 27 April 1694 Son of John George III. Frederick Augustus I Friedrich August I 27 April 1694 1 February 1733 Brother of John George IV. Converted to Catholicism 1697 in order to compete for the crown of Poland. Took the Polish crown 1697, opposed by Stanisław Leszczyński 1704, forced to renounce the throne 1706, returned as monarch 1709 until his death. Called \"the Strong\". Frederick Augustus II Friedrich August II 1 February 1733 5 October 1763 Son of Frederick Augustus I. Converted to Catholicism 1721. King of Poland 1734-1763. Called \"\"the Fat\" or (in Poland) \"the Saxon\". Frederick Christian Friedrich Christian 5 October 1763 17 December 1763 Son of Frederick Augustus II, raised Catholic. Frederick Augustus III Friedrich August III 17 December 1763 20 December 1806 Son of Frederick Christian. His Electorate ceased with the fall of the Holy Roman Empire in 1806, and he became King of Saxony. Called \"the Just.\" == Kings of Saxony == The Holy Roman Empire came to an end in 1806. The Elector of Saxony, allied to Napoleon I, anticipated its dissolution by becoming the ruler of an independent Kingdom of Saxony in 1806. Kings of Saxony Wettin Dynasty Image Name Begin End Notes Frederick Augustus I Friedrich August I 20 December 1806 5 May 1827 Duke of Warsaw 1807-1813. Called \"the Just.\" Anthony Anton 5 May 1827 6 June 1836 Brother of Frederick Augustus I. Frederick Augustus II Friedrich August II 6 June 1836 9 August 1854 Nephew of Anthony. John Johann 9 August 1854 29 October 1873 Brother of Frederick Augustus II. Albert Albert 29 October 1873 19 June 1902 Son of John. Called \"the Good\" George Georg 19 June 1902 15 October 1904 Brother of Albert. Frederick Augustus III Friedrich August III 15 October 1904 13 November 1918 Son of George. Last king of Saxony. Lost his throne in the German revolutions of 1918. == Heads of the Albertine Branch of the House of Wettin (since 1918) == Saxony became a republic at the end of the German Empire in 1918. For later rulers, see List of Ministers-President of Saxony. * Frederick Augustus III of Saxony, 1918-1932. * Frederick Christian, Margrave of Meissen, 1932-1968. * Maria Emanuel, Margrave of Meissen, since 1968. ==References== ==Other websites== * House Laws of the Kingdom of Saxony Category:Kings and Queens in Germany Category:Holy Roman Empire Category:Electors and Electresses Category:Lists of heads of state",
 "title": "List of rulers of Saxony"
}