{
 "id": "278930",
 "text": "David Herman is an American actor, comedian and voice actor best known as an original cast member of MADtv and for his role as Michael Bolton in Office Space. He is also known for his voice roles on television programs such as Futurama, and King of the Hill. == Biography == David Herman was born in New York City and raised in Washington Heights. He graduated from the Fiorello H. LaGuardia High School of Music & Art and Performing Arts in 1987, then attended the acting program at SUNY Purchase. Herman appeared in the films Born on the Fourth of July, Lost Angels and Let It Be Me, but he is probably best known for his role as Michael Bolton in Mike Judge's Office Space. Earlier, Herman had joined the cast of John Leguizamo's House of Buggin' in 1994; however, that show was short-lived. When FOX decided to mount a sketch comedy show to replace House of Buggin', Herman was kept on as an original MADtv cast member. ==Filmography== Year Title Role Other notes 2006 Idiocracy Secretary of State Comedy 2005 Fun with Dick and Jane Angry Caller Comedy 2005 Kicking & Screaming Referee 2005 The Lather Effect Corey 2003 Life on Parole Dave 2001 Primetime Glick Various Characters 2000 Angel David Nabbit Science Fiction/Action Drama 2000 Monsignor Martinez Smith 2000 Table One Norman Comedy 2000 Dude, Where's My Car? Nelson Comedy 2000 Shriek If You Know What I Did Last Friday the Thirteenth Mr. Lowelle Buchanan Comedy 1999 Office Space Michael Bolton Comedy 1997 Kirk and Kerry Dave Comedy 1995 Let it Be Me Comedy 1995–1997 MADtv Various Characters Sketch Comedy 1989 Born on the Fourth of July VA in Hospital Drama 1989 Lost Angels Carlo ===Voice and video game appearances=== Year Title Role Other notes 2009 The Goode Family Ubuntu Goode 2008 The Drinky Crow Show Uncle Gabby, Additional Voices 2008 Moral Orel Coach Stopframe, Principal Fakey, Additional voices Replaced Jay Johnston 2007 Futurama Turanga Morris, Scruffy the Janitor, Roberto, Malfunctioning Eddie, Additional Voices Nudar in Bender's Big Score and the No. 9 man in Into the Wild Green Yonder. 2007 Bee Movie 2007 Zombie College Scott 2006 American Dad! Arboreus, Mr. Aids 2005 Jak X: Combat Racing Razer, Ximon, Thugs 2004 Father of the Pride Roy 2004 Jak 3 Errol, Male Citizens 2003 Jak II Erol, Agent 2, Krimzon Guards 2003 Futurama: The Game Larry, Adoy, Ra-Ra the Sun King, Additional Voices 2001 Invader ZIM Various Voices 2001 Jak and Daxter: The Precursor Legacy Boggy Billy, Sculptor 2000 Futurama Various Characters 1999 Family Guy Various Characters 1997–2009 King of the Hill Buckley, Eustis, Anthony Page, Jimmy Witchert (the same voice he performs for Uncle Gabby in Drinky Crow), Additional voices Category:American television actors Category:American voice actors Category:Comedians from New York City Category:1967 births Category:Living people Category:Actors from New York City",
 "title": "David Herman"
}