{
 "id": "279020",
 "text": "Amber Laura Heard (born April 22, 1986 in Austin, Texas) is a former American actress. ==Career== She made her movie debut in the 2004 sports movie Friday Night Lights. She had a recurring role on the television show, Hidden Palms as Greta Matthews. Amber Heard's journey into the world of film and television began with rapid success. In 2004, she secured roles on television shows like \"Jack & Bobby\" and \"The Mountain,\" followed by \"The OC\" in 2005. Her transition to the silver screen occurred with a supporting role in the sports drama \"Friday Night Lights\" in 2004, marking a significant turning point in her career. However, her breakthrough came the following year when she appeared in the critically acclaimed film \"North Country.\" Though her role was relatively small, she made a noticeable impact by portraying a younger version of Charlize Theron's character, Josey. From this juncture, it became clear that Heard was destined for greater accomplishments. She took on diverse roles in films such as \"Alpha Dog,\" \"Price To Pay,\" and \"All The Boys Love Mandy Lane,\" demonstrating her versatility as an actress. Notably, her leading role in \"All The Boys Love Mandy Lane\" garnered praise and identified her as a rising star when it premiered at the Toronto Film Festival. == Personal life == Heard came out at GLAAD's 25th anniversary event. From 2008 to 2011, she was in a relationship with photographer Tasya van Ree. She began a relationship with Johnny Depp in 2012. The couple became engaged in December 2013. They married in February 2015. In May 2016, she filed for divorce. The divorce gained a lot of media attention when Heard filed for a temporary restraining order against Depp claiming domestic abuse. In response, Depp claimed that Heard was the one that had abused him before he went on, in 2018, to unsuccessfully sue the publishers of the British tabloid The Sun for defamation in England for calling him a \"wifebeater\". === Court case with Johnny Depp === In 2019, Depp sued Heard for defamation in the United States after she wrote an op-ed in December 2018 in which she said, among other things, that she \"became a public figure representing domestic abuse.\" The trial began in Virginia on April 11, 2022 with a verdict being reached on June 1, 2022. The trial got a lot of online attention from the media, with many internet users taking the side of Johnny Depp. The verdict found Heard liable for defaming Depp on three counts and Depp liable for defaming Heard on one count. A year after losing the legal battle against Depp, Heard reportedly quit Hollywood and moved to Madrid with her daughter, Oonagh Paige. === Wealth === As of 2024, Amber Heard Net Worth is Projected $1 million, which is a significant decrease from her prior net worth of $11 million. ==Filmography== * Friday Night Lights (2004) - Maria * Side FX (2005) - Shay * Drop Dead Sexy (2005) - Candy * North Country (2005) - Young Josey Aime * Price To Pay (2006) - Trish * The Prince (2006) (TV movie) - Serena * You Are Here (2006) - Amber * Alpha Dog (2006) - Alma * Day 73 With Sarah (short film) (2007) - Mary * Remember the Daze (2007) - Julia * All the Boys Love Mandy Lane (2008) - Mandy Lane * Never Back Down (2008) - Baja Miller * Pineapple Express (2008) - Angie Anderson * The Informers (2009) - Gwen Pearson * Zombieland (2009) - 406 * The Stepfather (2009) - Kelly Porter * ExTerminators (2009) - Nikki * The Joneses (2010) - Jenn Jones * The River Why (2010) - Eddy (Yet to be released) * And Soon the Darkness (2010) - Stephanie * The Ward (2010) - Kristen * Drive Angry (2011) - Piper * The Rum Diary (2011) - Chenault * Justice League (2017) - Mera * Aquaman (2018) - Mera ==References== == Other websites == * * * * Category:1986 births Category:Living people Category:Actors from Austin, Texas Category:American movie actors Category:American television actors Category:Bisexual people Category:LGBT actors Category:LGBT models Category:LGBT people from Texas",
 "title": "Amber Heard"
}