{
 "id": "279065",
 "text": "Daniel Michael \"Danny\" DeVito, Jr. (born November 17, 1944)Danny de Vito, Biography.com,. (2015). Retrieved 30 July 2015, from http://www.biography.com/people/danny-devito-9542289 is an American actor, comedian and filmmaker. He has starred in and directed a number of movies. DeVito is of Italian descent. He was born in Neptune Township, New Jersey and grew up in Asbury Park, New Jersey. ==Filmography== Year Title Role Director Notes 1970 Dreams of Glass Thug Robert Clouse 1971 Lady Liberty Fred Mancuso Mario Monicelli 1972 Hot Dogs for Gauguin Adrian Martin Brest 1973 Hurry Up, or I'll Be 30 Petey Joseph Jacoby 1973 Scalawag Fly Speck Kirk Douglas 1975 One Flew Over the Cuckoo's Nest Martini Miloš Forman 1975 Deadly Hero Unknown character Ivan Magy 1976 Car Wash Joe Michael Schultz Deleted scenes 1976 The Money Bartender Chuck Workman 1977 The Van Andy Sam Grossman 1977 The World's Greatest Lover Assistant Director Gene Wilder 1978 Goin' South Hog Jack Nicholson 1979 Swap Meet Max Brice Mack 1981 Going Ape! Lazlo Jeremy Joe Kronsberg 1983 Terms of Endearment Vernon Dahlart James L. Brooks 1984 Romancing the Stone Ralph Rob Zemeckis 1984 Johnny Dangerously Burr Amy Heckerling 1984 The Ratings Game Vic DeSalvo Himself 1985 The Jewel of the Nile Ralph 1985 Head Office Frank Steadman 1986 Wise Guys Harry Valentini 1986 Ruthless People Sam Stone 1986 My Little Pony: The Movie Grundle King (voice) 1987 Tin Men Ernest Tilley 1987 Throw Momma from the Train Owen Lift 1988 Twins Vincent Benedict 1989 The War of the Roses Gavin D'Amato 1991 Other People's Money Larry Garfield 1992 Batman Returns Oswald Cobblepot / The Penguin 1992 Hoffa Bobby Ciaro 1993 Jack the Bear John Leary 1993 Last Action Hero Whiskers (voice) Uncredited 1993 Look Who's Talking Now Rocks (voice) 1994 Renaissance Man Bill Rago 1994 Junior Dr. Larry Arbogast 1995 Get Shorty Martin Weir 1996 Matilda Harry Wormwood / Narrator 1996 Space Jam Swackhammer (voice) 1996 Mars Attacks! Rude Gambler 1997 The Rainmaker Deck Shifflet 1997 Hercules Philoctetes (voice) 1997 L.A. Confidential Sid Hudgens 1997 Men in Black Alien on TV Monitor Uncredited cameo 1998 Living Out Loud Pat Francato 1999 The Big Kahuna Phil Cooper 1999 Man on the Moon George Shapiro 1999 The Virgin Suicides Dr. Hornicker 2000 Drowning Mona Wyatt Rash 2000 Screwed Grover Cleaver 2001 Heist Bergman 2001 What's the Worst That Could Happen? Max Fairbanks 2002 Death to Smoochy Burke Bennet Himself 2002 Austin Powers in Goldmember Himself as Mini-Me Cameo 2003 Anything Else Harvey Wexler 2003 Duplex Narrator (voice) Uncredited 2003 Big Fish Amos Calloway 2004 Christmas in Love Brad LaGuardia 2005 Be Cool Martin Weir 2005 Marilyn Hotchkiss' Ballroom Dancing and Charm School Booth 2006 Relative Strangers Frank Menure 2006 Even Money Walter 2006 10 Items or Less Big D 2006 The Oh in Ohio Wayne 2006 Deck the Halls Buddy Hall 2007 The Good Night Mel 2007 Reno 911!: Miami District Attorney 2007 Nobel Son Gastner 2008 Just Add Water Merl 2009 House Broken Tom \"Smoky\" Cathkart 2009 Solitary Man Jimmy 2010 When in Rome Al 2010 I'm Still Here Himself 2011 Girl Walks into a Bar Aldo 2011 Revenge of the Electric Car Himself 2012 The Lorax The Lorax (voice) 2012 Hotel Noir Eugene Portland 2014 All the Wilderness Dr. Pembry 2016 Curmudgeons Jackie Short film 2016 Wiener-Dog Dave Schmerz 2016 The Comedian Jimmy Berkowitz 2017 Animal Crackers Chesterfield (voice) 2018 Smallfoot Dorgle (voice) 2019 Dumbo Max Medici 2019 Jumanji: The Next Level Eddie Gilpin 2020 The One and Only Ivan Bob (voice) 2022 The Maggie and the Ferocious Beast Movie Phil (voice) ==References== == Other websites == * Category:1944 births Category:Living people Category:Actors from New Jersey Category:American movie actors Category:American movie directors Category:American movie producers Category:American stage actors Category:American television actors Category:American television directors Category:American television producers Category:American voice actors Category:American Emmy Award winners Category:Golden Globe Award winners Category:Movie directors from New Jersey Category:Movie producers from New Jersey",
 "title": "Danny DeVito"
}