{
 "id": "279083",
 "text": "The Smithsonian National Zoological Park is one of the oldest zoos in the United States. It is part of the Smithsonian Institution and does not charge admission. It began in 1889 and wants to be a leader in animal care, science, education, sustainability, and visitor experience. It is also called the National Zoo. The Zoo has two campuses. The first is a urban park in northwest Washington, D.C.. It is 20 minutes from the National Mall by Metro. It offers family fun, excitement and interesting education programs. The other campus is the Smithsonian Conservation and Research Center (SCBI; formerly known as the Conservation and Research Center) in Front Royal, Virginia. SCBI is not open to the public. It is for training wildlife professionals in conservation biology and to propagating rare species through natural means and assisted reproduction. The National Zoo is accredited by the Association of Zoos and Aquariums (AZA). Altogether, the two facilities contain some 2,000 animals of 400 different species. ==History== The National Zoo was created by an Act of Congress in 1889 for “the advancement of science and the instruction and recreation of the people.” In 1890 it became a part of the Smithsonian Institution. Three well-known people planned the Zoo: Samuel Langley, third Secretary of the Smithsonian; William T. Hornaday, a conservationist and head of the Smithsonian's vertebrate division; and Frederick Law Olmsted, a landscape architect. They designed a new zoo to show animals for the public and to serve as a refuge for wildlife, such as bison and beaver, which were rapidly vanishing from North America. , The National Zoo has been the home to giant pandas for more than 30 years. First Hsing Hsing and Ling Ling in 1972, and, since 2000, Mei Xiang and Tian Tian. On July 9, 2005, Mei Xiang gave birth to Tai Shan, who went to China in February 2010. The zoo is supported by taxes and is open to everyone. About 2 million people visit each year, according to the Washington Post in 2005. ==Special programs and events== * Woo at the Zoo * Earth Day Clean-Up * Guppy Gala * Zoofari * Garden Day * Brew at the Zoo * Sunset Serenades * Fiesta Musical * Grapes with the Apes * Autumn Conservation Festival at Smithsonian Conservation Biology Institute(SCBI) * Boo at the Zoo * Night of the Living Zoo * Zoolights * Snore and Roar ==Exhibits and animals== Daily programs include animal training, feeding demonstrations, and talks by zoo workers. These are exhibits at the Zoo: * David M. Rubenstein Giant Panda Habitat: Giant pandas * Asia Trail: Sloth bears, fishing cats, red pandas, clouded leopards, Asian small-clawed otters, and giant pandas. * Great Ape House: Geoffroy's marmosets, Golden lion tamarins, Bornean orangutans, western lowland gorillas, and howler monkeys. *Gibbon Ridge: Siamangs. *Lemur Island: Ring-tailed, and red-fronted lemurs. * Invertebrate Exhibit: Coral, spiny lobsters, giant African millipedes, tarantulas, and giant Pacific octopuses. *Elephants Trails & Greater one horned rhino habitat: In opened mainly building visitors, at the area greater one-horned rhino, unfortunately area at the Indian, Sri Lanka, China, Indonesia, and Thailand, the structure building up to being attributed area elephants. *Africa: Reticulated giraffes, Mountain zebras, greater kudus, gemsboks, gerenuk, blue wildebeests, Thomson's gazelles, warthogs Grevy's zebras, ostrichs, marabou storks, red river hogs, an predators Cheetahs, African wild dogs, lions, leopards, ruppel griffon vultures, maned wolfs * Amazonia: Arapaima, glass frogs, lemur frogs, pacu, Panamanian golden frogs, river stingrays, red-bellied piranhas, red-tailed catfish, sunbitterns, two- toed sloths, titi monkeys, and poison dart frogs. * Small Mammal House: Golden lion tamarins, black and rufous giant elephant-shrews, three-banded armadillos, prehensile-tailed porcupines, naked mole rats, treeshrews, and collared peccaries. * Lion/Tiger Hill * Bird House * Kids’ Farm * Seals and Sea Lions Exhibit * Valley Trail File:Smithsonian's zoo-the Lion Luke 2008-01-17th 2of2.jpg|Lion at the National Zoo File:Cheetah Cubs Nat Zoo DC.jpg|Cheetah File:Flamingo National Zoo.jpg|Flamingo at the National Zoo File:Red Panda National Zoo.ogv|A Red panda navigates around its enclosure File:SlothBearNationalZoo.JPG|Sloth bear on the Asia Trail File:DCzooRedPanda.JPG|Red panda at the National Zoo File:Giant_Panda_2004-03-2.jpg|A male Giant panda called Tian Tian ==References== ==Other websites== * Smithsonian National Zoological Park * Association of Zoos and Aquariums site * Links to WebCams at the National Zoo. Category:Zoos in the United States Category:Smithsonian Institution Category:National Register of Historic Places Category:1889 establishments in the United States Category:19th-century establishments in Washington, D.C.",
 "title": "Smithsonian National Zoological Park"
}