{
 "id": "279191",
 "text": "The Stuarts who claimed the thrones of England, Scotland, Ireland and France after the Glorious Revolution of 1688 were: Descendent Portrait Birth Marriages Death James II & VII 6 February 1685– 16 September 1701 14 October 1633 St. James's Palace son of Charles I and Henrietta Maria of France Anne Hyde 3 September 1660 8 children Mary of Modena 21 November 1673 7 children 16 September 1701 Château de Saint-Germain-en-Laye aged 67 James Francis Edward Stuart (\"James III & VIII\") (\"The Old Pretender\") 16 September 1701– 1 January 1766 10 June 1688 St. James's Palace son of James II of England and Mary of Modena Clementina Sobieski 3 September 1719 2 children 1 January 1766 Palazzo Muti aged 77 Charles Edward Stuart (\"Charles III\") (\"The Young Pretender\") (\"Bonnie Prince Charlie\") 1 January 1766– 31 January 1788 31 December 1720 Palazzo Muti son of James Francis Edward Stuart and Clementina Sobieski Princess Louise of Stolberg-Gedern 28 March 1772 no children (2 illegitimate children) 31 January 1788 Palazzo Muti aged 67 Henry Benedict Stuart (\"Henry IX & I\") 31 January 1788– 13 July 1807 11 March 1725 Rome son of James Francis Edward Stuart and Clementina Sobieski never married 13 July 1807 Frascati aged 82 When Henry died, the succession passed to a different house, and none of the Jacobite heirs since has claimed the thrones of England or Scotland or put the arms of England and Scotland in their coats-of-arms. == House of Savoy == *House of Savoy Charles Emmanuel IV of Sardinia was a descendant of Charles I through his youngest daughter Henrietta Anne. Her daughter Anne Marie of Orléans married Victor Amadeus II of Sardinia, and Charles IV was great- grandson of Queen Anne Marie in the male line. Descendent Portrait Birth Marriages Death Charles Emmanuel IV of Sardinia (\"Charles IV\") 13 July 1807– 6 October 1819 24 May 1751 Turin son of Victor Amadeus III of Sardinia and Maria Antonietta of Bourbon Marie Clotilde of France 1775 No children 6 October 1819 Rome aged 68 Victor Emmanuel I of Sardinia (\"Victor\") 6 October 1819– 10 January 1824 24 July 1759 Turin son of Victor Amadeus III of Sardinia and Maria Antonietta of Bourbon Maria Teresa of Austria-Este 21 April 1789 7 children 10 January 1824 Moncalieri aged 65 Maria Beatrice of Savoy (\"Mary III\")Mary III & II and Mary IV & III were numbered like that because some Jacobites ignore Elizabeth I of England as illegitimate, and therefore say Mary, Queen of Scots, was the next queen of England after the death of Mary I 10 January 1824– 15 September 1840 6 December 1792 daughter of Victor Emmanuel I of Sardinia and Maria Teresa of Austria-Este Francis IV, Duke of Modena 20 June 1812 4 children 15 September 1840 aged 48 ==House of Austria-Este== Descendent Portrait Birth Marriages Death Francis V, Duke of Modena (\"Francis I\") 15 September 1840– 20 November 1875 1 June 1819 Modena son of Maria Beatrice of Savoy and Francis IV, Duke of Modena Adelgunde of Bavaria 30 March 1842 1 child 20 November 1875 Vienna aged 56 Maria Theresia of Austria-Este (\"Mary IV\") 20 November 1875– 3 February 1919 2 July 1849 Brno daughter of Ferdinand of Austria-Este and Elisabeth of Austria Ludwig III of Bavaria 13 children 7 November 1918 Chiemgau aged 69 ==House of Wittelsbach== Descendent Portrait Birth Marriages Death Rupprecht, Crown Prince of Bavaria (\"Robert I & IV\") 3 February 1919– 2 August 1955 18 May 1869 Munich son of Maria Theresia of Austria-Este and Ludwig III of Bavaria Marie Gabrielle of Bavaria 10 July 1900 Munich 4 children Antonia of Luxembourg 7 April 1921 Lenggries 6 children 2 August 1955 Schloß Leutstetten aged 86 Albrecht, Duke of Bavaria (\"Albert\") 2 August 1955– 8 July 1996 3 May 1905 Munich son of Rupprecht, Crown Prince of Bavaria and Marie Gabrielle of Bavaria Countess Maria Draskovich of Trakostjan 1930 4 children Countess Marie-Jenke Keglevich of Buzin 1971 No children 8 July 1996 Castle Berg aged 91 Franz, Duke of Bavaria (\"Francis II\") 8 July 1996– present 14 July 1933 Munich son of Albrecht, Duke of Bavaria and Countess Maria Draskovich of Trakostjan not married ===Future descent after the Duke of Bavaria=== The heir presumptive of Franz, Duke of Bavaria, is his younger brother * Prince Max, Duke in Bavaria. Then his daughter ** Sophie, Hereditary Princess of Liechtenstein, and then her eldest son *** Prince Joseph Wenzel of Liechtenstein, born 24 May 1995 in London. The first heir in the Jacobite line born in the British Isles since James III and VIII, The Old Pretender in 1688. ==References== Category:Monarchy of the United Kingdom Category:Jacobitism Category:House of Savoy Category:House of Wittelsbach",
 "title": "Jacobite succession"
}