{
 "id": "279194",
 "text": "Taiwan is a medium-sized chain of islands in East Asia at 23°30\" N, 121°00\" E . It runs through the Tropic of Cancer. Also known as Formosa, it makes up most of the territories of the Republic of China (commonly known as Taiwan). ==Formation== The island of Formosa (or Taiwan) was formed about 4.5 million years ago from a Geosyncline. It is part of an island arc. It was formed when the Eurasian Plate slid under an old chain of volcanic islands in the Philippine Mobile Belt. At the northern end of the island, the Philippine Mobile Belt sank under the Eurasian Plate. ==Physical boundaries== The main island makes up 99% of the Republic of China. The other 1% is made up of smaller islands like Orchard Island and the Penghu Islands, along with far smaller islands. The chain is separated from mainland China by the Taiwan Strait which is 220 kilometers long. ==Climate and terrain== The climate on the island is mostly ocean-like and changes very widely. The south end of the island is humid (very watery) During the summer, typhoons are very common. Most of the time, there are four each year. The terrain of the island changes a lot. In the west, plains and grasslands are common. 90% of the population lives in the west. The highest point on Formosa is Jade Mountain at 3951.798 meters tall in the year 2003. In the east of the island is mountainous terrain with thick forests and endemic (native-only) types of plants and animals such as the Formasan Black Bear and the Formosan Cypress. Many of these species are now endangered or extinct. ==Major mountain ranges== There are many mountain ranges on the island of Formosa. #Central Mountain Range (中央山脈)- The Central Mountain Range connects Su-ao in the north of the island to Eluanbi in the south of the island. These mountains are made mostly of hard rock formations with are very slowly worn away. These mountains are very rugged and hard to climb. They range from 120 to 1200 meters (3,937 feet) #Xueshan Range (雪山山脈)- The Syue Mountain Range is northwest of the Central Mountain Range. It starts at Sandiaojiao in the northwest. It gets taller as it goes southwest. Its highest point is Syue Mountain, at 3,886 m (12,749 ft) high. #Yushan Range (玉山山脈)- The Yushan mountain range runs along the southwestern side of the Central Mountain Range. It includes Jade Mountain. #Alishan Mountain Range (阿里山山脈)- The Alishan Range is west of the Yushan Range. It ranges from 1,000 meters and 2,000 meters (6,562 ft). Its highest peak is Data Mountain which is 2,663 meter (8,737 ft). #Haian Mountain Range (海岸山脈)- The East Coast Mountain Range goes north from the Hualien Range to Taitung County in the south. Most of the range is tall hills. There are many streams that run through the mountain, but there is one large river. ==Natural resources== The few natural resources are gold, copper, coal, natural gas, limestone, marble, and asbestos. The island is 55% forest, 24% farmable lands, 15% miscellaneous, 5% pastures, and 1% crops. ==Natural hazards== Earthquakes are the main natural hazards (problems). More than 2,000 people have died from earthquakes. The main environmental problems are air pollution and water pollution. ==Maps of Taiwan== Category:Geography of Taiwan",
 "title": "Geography of Taiwan"
}