{
 "id": "279327",
 "text": "William Edward Ranford (born December 14, 1966 in Brandon, Manitoba) is a Canadian retired professional ice hockey goaltender and is the current goaltending coach for the Los Angeles Kings. He graduated from New Westminster Secondary School in 1985. He was selected in the third round of the 1985 NHL Entry Draft, 52nd overall, by the Boston Bruins. Over the course of fifteen NHL seasons, Ranford would play with Boston, the Edmonton Oilers, Washington Capitals, Tampa Bay Lightning, and Detroit Red Wings, winning two Stanley Cups, a Canada Cup, and the 1994 Hockey World Championships while playing for Canada. ==Early life and career== As a child, Ranford took figure skating lessons, before eventually decided to go into goaltending. Because his father was in the armed forces, Ranford lived in Germany for a few years, as well as various places in Canada. He played for local teams in Portage la Prairie, Manitoba, Prince Edward Island and Red Deer, Alberta. Ranford spent his junior career with the New Westminster Bruins, playing two seasons with the team before being drafted by the Boston Bruins in the 3rd round (52nd overall) in the 1985 NHL Entry Draft.. Ranford's post-draft year, 1985–86, was an eventful one, as Ranford was named to the WHL Second All-Star Team, and saw his first NHL action after the WHL season ended, winning three of four games for Boston, before going 0–2 in the playoffs. To start the next year, Boston assigned him to the Moncton Golden Flames of the AHL, where he went 3–0 to start the season, and wound up spending the rest of the year with Boston. The replacement of Bruins coach Butch Goring with Terry O'Reilly led to Ranford falling out of favour, and eventually being dealt on March 8, 1988 from the Boston Bruins with Geoff Courtnall to the Edmonton Oilers in exchange for Andy Moog. Following the trade, he spent most of the next season with the AHL's Maine Mariners, but that would be the last time he would play at the minor- league level. ==NHL career== Ranford won his first Stanley Cup in 1988, as the backup to Grant Fuhr. However, in 1990 despite constant comparisons to the injured Fuhr, Ranford emerged as a first-rate goaltender, leading the Oilers to the Stanley Cup and winning the Conn Smythe Trophy (playoff MVP) in the process. It was the last cup that the Edmonton Oilers dynasty would win. Ranford went on to play the next six seasons in Edmonton, before being dealt back to the Boston Bruins on January 11, 1996 for Mariusz Czerkawski, Sean Brown, and a 1st Round Pick in the 1996 Entry Draft (Matthieu Descoteaux). After less than two seasons with Boston, Ranford was dealt to the Washington Capitals on March 1, 1997 with Adam Oates and Rick Tocchet for Jason Allison, Anson Carter, Jim Carey, a conditional draft pick in the 1998 Entry Draft, and a 3rd Round Pick in the 1997 Entry Draft (Lee Goren). In 1998 the Washington Capitals advanced to the Stanley Cup Finals, it was Ranfords third trip to the finals. On June 18, 1998, he was dealt to the Tampa Bay Lightning for a 2nd Round Pick in the 1999 Entry Draft and a 3rd Round Pick in the 1998 Entry Draft (Todd Hornung). He began the season with the Tampa Bay Lightning, but was traded to the Detroit Red Wings on March 23, 1999 for a conditional draft pick. It was the second deal between the Tampa Bay Lightning and the Detroit Red Wings that day. The prior trade brought Wendel Clark and a draft pick to the Detroit Red Wings and Goaltender Kevin Hodson and a draft pick to the Tampa Bay Lightning. The Wendel Clark trade made the Bill Ranford deal happen. His final year in the NHL was 2000, where Ranford returned to Edmonton as a free-agent backing up Tommy Salo before announcing his retirement on April 24. ==Post-NHL career== Ranford acted in the movie Miracle, performing the on-ice scenes as the goaltender for Team USA, Jim Craig, while Eddie Cahill performed the off-ice scenes.Merron, Jeff (February 12, 2004). \"Reel Life: Miracle rings true...\", ESPN. Ranford also played net for the Edmonton Oilers alumni team at the Heritage Classic, the first outdoor regular season game in NHL history. Ranford (14 saves) and Grant Fuhr (11 saves) took turns in goal and held the Montreal Canadiens alumni team scoreless in a 2–0 victory. Bill served as the Goalie Coach for the WHL Vancouver Giants for the 2004-2005 and 2005-2006 seasons. On July 10, 2006 he was named the goaltending coach of the Los Angeles Kings and continues to hold that position. He is also a part-owner of the Coquitlam Express of the British Columbia Hockey League (Tier II Junior). ==Career statistics== ===Regular season=== Season Team League GP W L T MIN GA SO GAA SV% 1983–84 New Westminster Bruins WHL 27 10 14 0 1450 130 0 5.38 .876 1984–85 New Westminster Bruins WHL 38 19 17 0 2034 142 0 4.19 1985–86 New Westminster Bruins WHL 53 17 29 1 2791 225 1 4.84 1985–86 Boston Bruins NHL 4 3 1 0 240 10 0 2.50 .906 1986–87 Moncton Golden Flames AHL 3 3 0 0 180 6 0 2.00 .927 1986–87 Boston Bruins NHL 41 16 20 2 2234 124 3 3.33 .891 1987–88 Maine Mariners AHL 51 27 16 6 2856 165 1 3.47 .887 1987–88 Edmonton Oilers NHL 6 3 0 2 325 16 0 2.95 .899 1988–89 Edmonton Oilers NHL 29 15 8 2 1509 88 1 3.50 .877 1989–90 Edmonton Oilers NHL 56 24 16 9 3107 165 1 3.19 .887 1990–91 Edmonton Oilers NHL 60 27 27 3 3415 182 0 3.20 .893 1991–92 Edmonton Oilers NHL 67 27 26 10 3822 228 1 3.58 .884 1992–93 Edmonton Oilers NHL 67 17 38 6 3753 240 1 3.84 .884 1993–94 Edmonton Oilers NHL 71 22 34 11 4070 236 1 3.48 .898 1994–95 Edmonton Oilers NHL 40 15 20 3 2203 133 2 3.62 .883 1995–96 Edmonton Oilers NHL 37 13 18 5 2015 128 1 3.81 .875 1995–96 Boston Bruins NHL 40 21 12 4 2306 109 1 2.84 .894 1996–97 Boston Bruins NHL 37 12 16 8 2147 125 2 3.49 .887 1996–97 Washington Capitals NHL 18 8 7 2 1009 46 0 2.74 .888 1997–98 Washington Capitals NHL 22 7 12 2 1183 46 0 2.79 .901 1998–99 Tampa Bay Lightning NHL 32 3 18 3 1568 102 1 3.90 .881 1998–99 Detroit Red Wings NHL 4 3 0 1 244 8 0 1.97 .918 1999–00 Edmonton Oilers NHL 16 4 6 3 785 47 0 3.59 .885 NHL totals NHL totals NHL totals 647 240 279 76 35936 2042 15 3.41 .888 ===Playoffs=== Season Team League GP W L MIN GA SO GAA SV% 1983–84 New Westminster Bruins WHL 1 0 0 27 2 0 4.44 1984–85 New Westminster Bruins WHL 7 2 3 309 26 0 5.05 1985–86 Boston Bruins NHL 2 0 2 120 7 0 3.50 .841 1986–87 Boston Bruins NHL 2 0 2 123 8 0 3.90 .855 1989–90 Edmonton Oilers NHL 22 16 6 1401 59 1 2.53 .912 1990–91 Edmonton Oilers NHL 3 1 2 135 8 0 3.56 .897 1991–92 Edmonton Oilers NHL 16 8 8 909 51 2 3.37 .895 1995–96 Boston Bruins NHL 4 1 3 239 16 0 4.02 .857 1998–99 Detroit Red Wings NHL 4 2 2 183 10 1 3.28 .905 NHL totals NHL totals NHL totals 53 28 25 3110 159 4 3.07 .897 ==Awards== *1986 - WHL 2nd All-Star Team *1988, 1990 - Stanley Cup *1990 - Conn Smythe Trophy MVP *1991 - NHL All-Star Game *1991 - Canada Cup (Team Canada) *1991 - Canada Cup MVP *1994 - Ice Hockey World Championship (Team Canada, previously Canada won 1961) *1994 - Hockey World Championship tournament MVP *1996 - World Cup of Hockey (Team Canada) ==Transactions== *June 15, 1985 - Ranford drafted by Boston *March 8, 1988 - Ranford traded from Boston to Edmonton, along with Geoff Courtnall in exchange for Andy Moog *January 11, 1996 - Ranford traded from Edmonton to Boston in exchange for Sean Brown, Mariusz Czerkawski and a 1st round draft pick (Matthieu Descoteaux) *March 1, 1997 - Ranford traded from Boston to Washington, along with Adam Oates and Rick Tocchet in exchange for Jason Allison, Anson Carter, and Jim Carey *June 18, 1998 - Ranford traded from Washington to Tampa Bay in exchange for a 2nd and 3rd round draft pick (Todd Hornung) *March 23, 1999 - Ranford traded from Tampa Bay to Detroit in exchange for a conditional draft pick. *August 4, 1999 - Ranford signs with Edmonton. ==References== ==Other websites== * *Oilers Ranford Bio *Ranford at IMDB Category:1966 births Category:Living people Category:Boston Bruins players Category:Canadian ice hockey goaltenders Category:Conn Smythe Trophy winners Category:Detroit Red Wings players Category:Edmonton Oilers players Category:Ice hockey people from Brandon, Manitoba Category:Maine Mariners (AHL) players Category:Moncton Golden Flames players Category:New Westminster Bruins players Category:Stanley Cup champions Category:Tampa Bay Lightning players Category:Washington Capitals players",
 "title": "Bill Ranford"
}