{
 "id": "279316",
 "text": "Tyler Plante (born May 17, 1987) is a Canadian professional ice hockey goaltender currently with the Rochester Americans of the American Hockey League. ==Playing career== Tyler was drafted by the Florida Panthers in the second round, 32nd overall, in the 2005 NHL Entry Draft. Tyler gained NHL attention playing for the Brandon Wheat Kings of the Western Hockey League and earning the Jim Piggott Memorial Trophy as the top rookie of the WHL in the 2004–05 season. After three full seasons with the Wheat Kings Plante was signed by the Panthers to a three-year entry level contract on June 1, 2007. Since then, he has spent most of his playing time with the Florida Panthers AHL affiliate, the Rochester Americans. He was recalled up to Florida for a pre-season game at the start of the 2008–09 NHL season, but did not get any playing time and started the season in Rochester. After a lackluster start with the Americans, he was demoted to the ECHL, and spent time with the Dayton Bombers. After spending over two months with the Bombers, he was called back up to Rochester, where he currently plays. Plante was born in Milwaukee, Wisconsin and raised in Brandon, Manitoba. Plante was born in while his father Cam was a member of the Milwaukee Admirals. His brother Alex Plante was a first round draft pick of the Edmonton Oilers. ==Career statistics== Regular season Playoffs Season Team League GP W L T/OT MIN GA SO GAA SV% GP W L MIN GA SO GAA SV% 2003–04 Brandon Wheat Kings WHL 2 0 0 1 58 2 0 2.07 .889 — — — — — — — — 2004–05 Brandon Wheat Kings WHL 48 34 11 2 2833 122 6 2.58 .907 24 13 11 1408 69 0 2.94 .911 2005–06 Brandon Wheat Kings WHL 60 25 24 5 3414 189 2 3.32 .898 6 2 4 360 18 0 3.00 .914 2006–07 Brandon Wheat Kings WHL 54 30 14 2 3215 145 4 2.71 .911 11 6 5 659 37 0 3.37 .889 2007–08 Rochester Americans AHL 25 6 16 1 1451 86 0 3.56 .885 — — — — — — — — 2007–08 Florida Everblades ECHL 10 4 5 1 598 28 1 2.81 .921 — — — — — — — — 2008–09 Rochester Americans AHL 19 5 10 1 904 49 0 3.25 .902 — — — — — — — — 2008–09 Dayton Bombers ECHL 19 6 11 1 1076 60 0 3.35 .888 — — — — — — — — 2009–10 Rochester Americans AHL 27 12 12 1 1487 66 3 2.66 .914 7 3 3 346 14 0 2.43 .935 AHL Totals 71 23 38 3 3842 201 3 3.14 .900 7 3 3 346 14 0 2.43 .935 ==References== ==Other websites== * Category:1987 births Category:Living people Category:American ice hockey goaltenders Category:Brandon Wheat Kings players Category:Canadian ice hockey goaltenders Category:ECHL players Category:Ice hockey people from Brandon, Manitoba Category:Rochester Americans players Category:San Antonio Rampage players Category:Swedish Hockey League players",
 "title": "Tyler Plante"
}