{
 "id": "279422",
 "text": "Short-faced bears belong to the Tremarctinae subfamily of bears. There is one living representative, the spectacled bear (Tremarctos ornatus) of South America. Extinct members include Arctodus, Arctotherium, Plionarctos and the Florida spectacled bear (Tremarctos floridanus). Of these, the giant short- faced bears (Arctodus simus and Arctotherium angustidens) may have been the largest ever predators in the Americas. == Evolution == The group evolved in eastern North America from Plionarctos, and then spread across the Americas as part of the Great American Interchange. Most short-faced bears became extinct at the end of the Pleistocene. The medium sized Arctodus pristinus and Tremarctos floridanus inhabited much of North America in the Early Pleistocene. While a fragmentary Arctotherium is first found from El Salvador, the next fossils are of the gigantic Arctotherium angustidens in Argentina, from around 1 million years ago. Arctotherium angustidens was possibly the largest predatory land mammal ever. In the Middle Pleistocene, Arctodus pristinus evolved into Arctodus simus, which inhabited most of North America, from Alaska to Mexico. Arctotherium angustidens was replaced by smaller, medium-sized species- first Arctotherium vetustum, then by Arctotherium bonariense and Arctotherium tarijense. Arctotherium wingei was the only known species of Arctotherium to inhabit tropical South America and Central America. == Biology == Short-faced bears were either smaller and mostly herbivorous bears inhabiting forested habitats, such as Arctotherium wingei and Tremarctos ornatus, or omnivores adapted for more open habitats, such as Arctotherium angustidens and Arctodus simus. Although the two giant species appear similar, both species had key differences. While Arctodus simus inhabited most of North America for over a million years, Arctotherium angustidens has only been found in the Southern Cone, from open plains habitat. Also, while Arctodus simus varied its diet between mostly eating meat in Alaska to omnivory elsewhere, Arctotherium angustidens had similar rates of eating meat across specimens, according to studies of its bone chemistry. Additionally, the much more slender bones of Arctodus, in contrast with the robust Arctotherium angustidens, have puzzled researchers. However, the extinctions scavenger- niche mega-carnivores in their habitats could have been a shared reason for evolving gigantism in Arctodus and Arctotherium. Arctodus and Tremarctos share characteristics common to herbivorous bears. These were either ancestral traits of the group, or clues to their preferred diets. Arctotherium was more closely related to the spectacled bear than to Arctodus, implying convergent evolution of large size in the two lineages. == Taxonomy == The following taxonomy of the short-faced bears follow Mitchell et al. (2016): * Subfamily Tremarctinae ** †Plionarctos *** †Plionarctos edensis *** †Plionarctos harroldorum ** †Arctodus *** †Arctodus pristinus *** †Arctodus simus ** †Arctotherium *** †Arctotherium angustidens *** †Arctotherium bonariense *** †Arctotherium tarijense *** †Arctotherium vetustum *** †Arctotherium wingei ** Tremarctos *** †Tremarctos floridanus *** Tremarctos ornatus – spectacled bear == References == Category:Bears",
 "title": "Short-faced bear"
}