{
 "id": "279513",
 "text": "Yaws is a tropical chronic disfiguring and debilitating childhood infectious disease of the skin, bones, joints and cartilage. It is also known as frambesia tropica, thymosis, polypapilloma tropicum, parangi, bouba, frambösie, and pian. It is caused by the spirochaete bacterium Treponema pallidum pertenue. The organism that causes yaws, Treponema pallidum subspecies pertenue, is closely related genetically to T. pallidum subspecies pallidum, which causes syphilis, bejel and pinta Yaws is cured with a single oral dose of an inexpensive antibiotic called azithromycin or also benzathine penicillin. Humans are currently believed to be the only reservoir. Transmission is from person to person. About 75–80% of people affected by yaws are children under 15 years of age. It most commonly occurs in children aged 6–10 years, and males and females are equally affected. Most lesions occur on the limbs. The incubation period is 9–90 days, with an average of 21 days. The disease begins with a round, hard swelling of the skin, two to five centimeters in diameter. The center may break open and form an ulcer. This usually heals after three to six months. The diagnosis of the ulcerative form is more challenging and requires serological confirmation. Without treatment, infection can lead to chronic disfigurement and disability. After several weeks, or even years later, the joints and bones may become painful, fatigue may develop, and new skin sores may appear. The skin of the palms of the hands and the soles of the feet may become thick and break open. The bones (especially those of the nose) may change shape. After five years or more large areas of skin can die. This leaves large scars. Secondary yaws occurs weeks to months after the primary infection and typically presents with multiple raised yellow lesions or pain and swelling of long bones and fingers (dactylitis). Yaws is spread by touching the fluid from the sores of a person with the disease. The disease is most common among children, who spread it by playing together. Other similar diseases are caused by different strains of the same bacterium, such as syphilis (Treponema pallidum pallidum). Once the lesions have appeared doctors are able to tell it is yaws. Polymerase chain reaction (PCR) is the best method of diagnosis. Other tests are Treponema pallidum particle agglutination (TPPA) and rapid plasma reagin (RPR), widely used to diagnose treponemal infections (for example, syphilis and yaws). The main way of stopping the disease spreading, is by curing those who have it. This stops them passing it on to others. Where the disease is common, treating the entire community is effective. Improving cleanliness and sanitation will also decrease spread. Without treatment, physical deformities happen in 10% of cases. Yaws is common in at least 14 or 15 as of Janurary 2023. The disease infects only humans. In the 1950s and 1960s the World Health Organization (WHO) nearly destroyed yaws. Since then the number of cases has increased. One of the first descriptions of the disease was made in 1679 by Willem Piso. Archaeology shows that yaws may have been present among humans as far back as 1.6 million years ago. ==References== Category:Diseases caused by bacteria Category:Skin problems",
 "title": "Yaws"
}