{
 "id": "279548",
 "text": "Le Monde's 100 Books of the Century is a list of books thought to be the 100 best of the 20th century. The list was made in 1999 by the French retail store Fnac and the Paris newspaper Le Monde. Starting with a list of 200 titles made by bookshops and journalists, 17,000 French people answered the question, \"Which books have stayed in your memory?\"Écrivains et choix sentimentaux , Josyane Savigneau, Le Monde, 15 October 1999. The list includes novels, poetry, theatre, and comic strips. Some received the Nobel Prize in Literature. __NOTOC__ == The 100 Books of the Century == No. Title Author Year Language Country 1 The Stranger (The Outsider) Albert Camus 1942 French French Algeria 2 In Search of Lost Time (Remembrance of Things Past) Marcel Proust 1913–1927 French France 3 The Trial Franz Kafka 1925 German Austria-Hungary, Czechoslovakia 4 The Little Prince Antoine de Saint-Exupéry 1943 French France 5 Man's Fate André Malraux 1933 French France 6 Journey to the End of the Night Louis-Ferdinand Céline 1932 French France 7 The Grapes of Wrath John Steinbeck 1939 English USA 8 For Whom the Bell Tolls Ernest Hemingway 1940 English USA 9 Le Grand Meaulnes Alain- Fournier 1913 French France 10 Froth on the Daydream Boris Vian 1947 French France 11 The Second Sex Simone de Beauvoir 1949 French France 12 Waiting for Godot Samuel Beckett 1952 French, English Ireland, France 13 Being and Nothingness Jean-Paul Sartre 1943 French France 14 The Name of the Rose Umberto Eco 1980 Italian Italy 15 The Gulag Archipelago Aleksandr Solzhenitsyn 1973 Russian Soviet Union 16 Paroles Jacques Prévert 1946 French France 17 Alcools Guillaume Apollinaire 1913 French France 18 The Blue Lotus Hergé 1936 French Belgium 19 The Diary of a Young Girl Anne Frank 1947 Dutch Germany, Netherlands 20 Tristes Tropiques Claude Lévi-Strauss 1955 French France 21 Brave New World Aldous Huxley 1932 English UK 22 Nineteen Eighty-Four George Orwell 1949 English UK 23 Asterix the Gaul René Goscinny and Albert Uderzo 1959 French France 24 The Bald Soprano Eugène Ionesco 1952 French, Romanian Romania, France 25 Three Essays on the Theory of Sexuality Sigmund Freud 1905 German Austria 26 The Abyss (Zeno of Bruges) Marguerite Yourcenar 1968 French France, Belgium 27 Lolita Vladimir Nabokov 1955 English, Russian Russia, USA 28 Ulysses James Joyce 1922 English Ireland 29 The Tartar Steppe Dino Buzzati 1940 Italian Italy 30 The Counterfeiters André Gide 1925 French France 31 The Horseman on the Roof Jean Giono 1951 French France 32 Belle du Seigneur Albert Cohen 1968 French Greece, Switzerland 33 One Hundred Years of Solitude Gabriel García Márquez 1967 Spanish Colombia 34 The Sound and the Fury William Faulkner 1929 English USA 35 Thérèse Desqueyroux François Mauriac 1927 French France 36 Zazie in the Metro Raymond Queneau 1959 French France 37 Confusion of Feelings Stefan Zweig 1927 German Austria 38 Gone with the Wind Margaret Mitchell 1936 English USA 39 Lady Chatterley's Lover D. H. Lawrence 1928 English UK 40 The Magic Mountain Thomas Mann 1924 German Germany 41 Bonjour Tristesse Françoise Sagan 1954 French France 42 Le Silence de la mer Vercors 1942 French France 43 Life: A User's Manual Georges Perec 1978 French France 44 The Hound of the Baskervilles Arthur Conan Doyle 1901–1902 English UK 45 Under the Sun of Satan Georges Bernanos 1926 French France 46 The Great Gatsby F. Scott Fitzgerald 1925 English USA 47 The Joke Milan Kundera 1967 Czech Czech Republic, France 48 A Ghost at Noon (Contempt) Alberto Moravia 1954 French France 49 The Murder of Roger Ackroyd Agatha Christie 1926 English UK 50 Nadja André Breton 1928 French France 51 Aurélien Louis Aragon 1944 French France 52 The Satin Slipper Paul Claudel 1929 French France 53 Six Characters in Search of an Author Luigi Pirandello 1921 Italian Italy 54 The Resistible Rise of Arturo Ui Bertolt Brecht 1959 German Germany 55 Vendredi ou les Limbes du Pacifique Michel Tournier 1967 French France 56 The War of the Worlds H. G. Wells 1898 English UK 57 If This Is a Man Survival in Auschwitz Primo Levi 1947 Italian Italy 58 The Lord of the Rings J. R. R. Tolkien 1954–1955 English Orange Free State, UK 59 Les Vrilles de la vigne Colette 1908 French France 60 Capitale de la douleur Paul Éluard 1926 French France 61 Martin Eden Jack London 1909 English USA 62 Ballad of the Salt Sea Hugo Pratt 1967 Italian Italy 63 Writing Degree Zero Roland Barthes 1953 French France 64 The Lost Honour of Katharina Blum Heinrich Böll 1974 German Germany 65 The Opposing Shore Julien Gracq 1951 French France 66 The Order of Things Michel Foucault 1966 French France 67 On the Road Jack Kerouac 1957 English USA 68 The Wonderful Adventures of Nils Selma Lagerlöf 1906–1907 Swedish Sweden 69 A Room of One's Own Virginia Woolf 1929 English UK 70 The Martian Chronicles Ray Bradbury 1950 English USA 71 The Ravishing of Lol Stein Marguerite Duras 1964 French France 72 The Interrogation J. M. G. Le Clézio 1963 French France 73 Tropisms Nathalie Sarraute 1939 French Russia, France 74 Journal, 1887–1910 Jules Renard 1925 French France 75 Lord Jim Joseph Conrad 1900 English Russian Empire, UK 76 Écrits Jacques Lacan 1966 French France 77 The Theatre and its Double Antonin Artaud 1938 French France 78 Manhattan Transfer John Dos Passos 1925 English USA 79 Ficciones Jorge Luis Borges 1944 Spanish Argentina 80 Moravagine Blaise Cendrars 1926 French France, Switzerland 81 The General of the Dead Army Ismail Kadare 1963 Albanian, French Albania 82 Sophie's Choice William Styron 1979 English USA 83 Gypsy Ballads Federico García Lorca 1928 Spanish Spain 84 The Strange Case of Peter the Lett Georges Simenon 1931 French Belgium 85 Our Lady of the Flowers Jean Genet 1944 French France 86 The Man Without Qualities Robert Musil 1930–1932 German Austria 87 Fureur et mystère René Char 1948 French France 88 The Catcher in the Rye J. D. Salinger 1951 English USA 89 No Orchids For Miss Blandish James Hadley Chase 1939 English UK 90 Blake and Mortimer Edgar P. Jacobs 1950 French Belgium 91 The Notebooks of Malte Laurids Brigge Rainer Maria Rilke 1910 German Austria-Hungary, Switzerland 92 Second Thoughts Michel Butor 1957 French France 93 The Burden of Our Time The Origins of Totalitarianism Hannah Arendt 1951 English, German Germany, USA 94 The Master and Margarita Mikhail Bulgakov 1967 Russian Soviet Union 95 The Rosy Crucifixion Henry Miller 1949–1960 English USA 96 The Big Sleep Raymond Chandler 1939 English USA 97 Amers Saint-John Perse 1957 French France 98 Gaston (Gomer Goof) André Franquin 1957 French Belgium 99 Under the Volcano Malcolm Lowry 1947 English UK 100 Midnight's Children Salman Rushdie 1981 English India, UK Note: Language and Country refer to the author's career generally, not to the book specifically. ==Related pages== * Nobel Prize in Literature - Camus, Steinbeck, Hemingway, Beckett, Sartre, Solzhenitsyn, Gide, García Márquez, Faulkner, Mauriac, Mann, Pirandello, Böll, Lagerlöf, Le Clézio, Perse *Booker Prize - Kadare, Rushdie *Pulitzer Prize for Fiction - Steinbeck, Hemingway, Faulkner, Mitchell, Styron ==References== Category:20th- century books Category:Lists of books",
 "title": "Le Monde's 100 Books of the Century"
}