{
 "id": "279680",
 "text": "Adelaide of Austria (Adelheid Franziska Marie Rainera Elisabeth Clotilde; 3 June 1822 - 20 January 1855) was the first wife of Victor Emmanuel II of Sardinia, future King of Italy. She was the mother of eight children including the future Umberto I of Italy. She was the Queen of Sardinia from 1849 until 1855 when she died as a result of childbirth. The present Italian pretender is her direct great great grandson. ==Biography== ===Archduchess of Austria=== She was born at the Royal Palace of Milan to Rainer Joseph of Austria and his wife Elisabeth of Savoy.Urban. Sylvanius: The Gentleman's Magazine, 1855, p 303 Named Adelaide, or known as Adele in the family, she held the title of Archduchess of Austria. Her father was the Viceroy of Lombardy-Venetia and was a son of the Holy Roman Emperor Leopold II and Maria Luisa of Spain. Her mother was a member of the House of Savoy and a daughter of the then Prince of Carignano, the head of the junior branch of the House of Savoy who ruled the Kingdom of Sardinia. ===Duchess of Savoy=== On 12 April 1842, at the Palazzina di caccia di Stupinigi, she married Victor Emmanuel of Savoy. The marriage was used to strengthen relations between the House of Savoy and that of the House of Habsburg but was viewed by many people of the time to increase Austrian power in Italy.Georgina Sarah. Godkin:Life of Victor Emmanuel II, First king of Italy, Volume I, 1879, p 44 Victor Emmanuel was her first cousin and heir apparent to the King of Sardinia. He was styled the \"Duke of Savoy\" prior to succession. Adelaide thus took on the style of \"Duchess of Savoy.\" She maintained her style of Imperial & Royal Highness till she became Queen. Her husband's mother Maria Theresa of Austria retained great influence over her son throughout his life. Her mother-in-law was also her first cousin, both she and Adelaide being grandchildren of Emperor Leopold II. Adelaide and her husband of thirteen years had eight children. Four of these went on to have further progeny. Her husband had various extramarital affairs throughout the marriage.Forester. C.S: Victor Emmanuel II: And the Union of Italy, Simon Publications LLC, 2001, p 216 Due perhaps to her strict upbringing, Adelaide was a quiet, religious woman, who would frequently give to charity. She was a loving wife.The eclectic magazine of foreign literature Volume 2; Volume 35, p 556 ===Queen of Sardinia=== In March 1849, her father-in-law King Charles Albert abdicated after the events of the Revolutions of 1848. Her husband succeeded as Victor Emmanuel II of Sardinia. During her tenure as queen consort she had three further children, all of which died in infancy. On 8 January 1855, she gave birth to a son who was styled the \"Count of Genevois.\" Days later Queen Maria Theresa died on 12 January 1855. Adelaide went to the late queens funeral on 16 January and returning to the palace caught a cold. She died four days later at the Royal Palace of Turin having had an acute attack of Gastroenteritis. Another story claims that Adelaide died of her burns after stepping on a match that set fire to her clothes. She was buried at the Royal Basilica of Superga. In 1861 her husband would become the first post-unification King of Italy. After her death, her husband wed again to Rosa Vercellana in a morganatic marriage.Forester. C.S: Victor Emmanuel II: And the Union of Italy, Simon Publications LLC, 2001, p 210 ==Issue== # Princess Maria Clotilde of Savoy (2 March 1843 - 25 June 1911) married Prince Napoléon Joseph Bonaparte, \"Prince Napoléon\" and had children. # Umberto I of Italy (14 March 1844 - 29 July 1900) married Princess Margherita of Savoy and had children. # [Amadeo I of Spain (30 May 1845 - 18 January 1890) married Princess Maria Vittoria dal Pozzo and later Princess Princess Maria Letizia Bonaparte and had children. # Prince Oddone of Savoy, Duke of Montferrat (11 July 1846 - 22 January 1866) died unmarried. # Princess Maria Pia of Savoy (14 February 1847 - 5 July 1911) married King Luís I of Portugal and had children. # Prince Carlo Alberto of Savoy (2 June 1851 - 22 June 1854) Duke of Chablais died in childhood. # Prince Vittorio Emanuele of Savoy (6 July 1852) died at birth. # Prince Vittorio Emanuele of Savoy, Count of Genevois (18 January 1855 - 17 May 1855) died in childhood. ==Titles, styles, honours and arms== ===Titles and styles=== *3 June 1822 - 12 April 1842 Her Imperial and Royal Highness Archduchess Adelaide of Austria *12 April 1842 - 23 March 1849 Her Imperial and Royal Highness The Duchess of Savoy *23 March 1849 - 20 January 1855 Her Majesty The Queen of Sardinia ===Honours=== *Dame of the Order of the Starry Cross ==References== Category:Kings and Queens of Sardinia Category:1822 births Category:1855 deaths Category:People from Milan Category:Princes and Princesses of Savoy Category:House of Habsburg-Lorraine Category:Deaths in childbirth Category:Dukes and Duchesses of Savoy Category:Burials at the Basilica of Superga",
 "title": "Adelaide of Austria"
}