{
 "id": "279621",
 "text": "The BSFA Awards are prizes given every year by the British Science Fiction Association (BSFA). The prize is for excellent works of science fiction. The first BSFA Award was given in 1970. Prizes are given for works from the year before the award is given. At first, the award was only for novels. Categories for short works and artwork were added in 1980. Awards for media were given from 1979 to 1992. In 2002, the BSFA Award started to be given for nonfiction too. Members of the BSFA vote for the nominees who may win an award and then for the final winners. Recently members of Eastercon also vote. ;1969 :Novel: Stand on Zanzibar by John Brunner ;1970 :Novel: The Jagged Orbit by John Brunner ;1971 :Collection: The Moment of Eclipse by Brian W. Aldiss ;1972 :No award–insufficient votes. ;1973 :Novel: Rendezvous with Rama by Arthur C. Clarke :Special Award: Billion Year Spree by Brian W. Aldiss ;1974 :Novel: Inverted World by Christopher Priest ;1975 :Novel: Orbitsville by Bob Shaw ;1976 :Novel: Brontomek! by Michael G. Coney :Special Award: A Pictorial History of Science Fiction by David Kyle ;1977 :Novel: The Jonah Kit by Ian Watson ;1978 :Novel: A Scanner Darkly by Philip K. Dick :Collection: Deathbird Stories by Harlan Ellison :Media: The Hitchhiker's Guide to the Galaxy (original radio series) – Douglas Adams ;1979 :Novel: The Unlimited Dream Company by J. G. Ballard :Short: \"Palely Loitering\" by Christopher Priest (F&SF;) :Media: The Hitchhiker's Guide to the Galaxy record :Artist: Jim Burns ;1980 :Novel: Timescape by Gregory Benford :Short: \"The Brave Little Toaster\" by Thomas M. Disch (F&SF;) :Media: The Hitchhiker's Guide to the Galaxy second radio series – Douglas Adams :Artist: Peter Jones ;1981 :Novel: The Shadow of the Torturer by Gene Wolfe :Short: \"Mythago Wood\" by Robert Holdstock (F&SF;) :Media: Time Bandits :Artist: Bruce Pennington ;1982 :Novel: Helliconia Spring by Brian W. Aldiss :Short: \"Kitemaster\" by Keith Roberts (Interzone) :Media: Blade Runner :Artist: Tim White ;1983 :Novel: Tik-Tok by John Sladek :Short: \"After-Images\" by Malcolm Edwards (Interzone) :Media: Android :Artist: Bruce Pennington ;1984 :Novel: Mythago Wood by Robert Holdstock :Short: \"The Unconquered Country\" by Geoff Ryman (Interzone) :Media: The Company of Wolves :Artist: Jim Burns ;1985 :Novel: Helliconia Winter by Brian W. Aldiss :Short: \"Cube Root\" by David Langford (Interzone) :Media: Brazil :Artist: Jim Burns ;1986 :Novel: The Ragged Astronauts by Bob Shaw :Short: \"Kaeti and the Hangman\" by Keith Roberts (in collection Kaeti & Company) :Media: Aliens :Artist: Keith Roberts ;1987 :Novel: Grainne by Keith Roberts :Short: \"Love Sickness\" by Geoff Ryman (Interzone) :Media: Star Cops :Artist: Jim Burns ;1988 :Novel: Lavondyss by Robert Holdstock :Short: \"Dark Night in Toyland\" by Bob Shaw (Interzone) :Media: Who Framed Roger Rabbit :Artist: Alan Lee ;1989 :Novel: Pyramids by Terry Pratchett :Short: \"In Translation\" by Lisa Tuttle (Zenith) :Media: Red Dwarf :Artist: Jim Burns ;1990 :Novel: Take Back Plenty by Colin Greenland :Short: \"The Original Doctor Shade\" by Kim Newman (Interzone) :Media: Twin Peaks :Artist: Ian Miller ;1991 :Novel: The Fall of Hyperion by Dan Simmons :Short: \"Bad Timing\" by Molly Brown (Interzone) :Media: Terminator 2: Judgment Day :Artwork: Mark Harrison ;1992 :Novel: Red Mars by Kim Stanley Robinson :Short: \"Innocent\" by Ian McDonald (New Worlds 2) :Artwork: Jim Burns ;1993 :Novel: Aztec Century by Christopher Evans :Short: \"The Ragthorn\" by Robert Holdstock and Garry Kilworth (Interzone) :Artwork: Jim Burns :Special Award: The Encyclopedia of Science Fiction ed. John Clute and Peter Nicholls ;1994 :Novel: Feersum Endjinn by Iain M. Banks :Short: \"The Double Felix\" by Paul di Filippo (Interzone) :Artwork: Jim Burns ;1995 :Novel: The Time Ships by Stephen Baxter :Short: \"The Hunger and Ecstasy of Vampires\" by Brian Stableford (shorter version, Interzone 91/92) :Artwork: Jim Burns (cover for Seasons of Plenty) ;1996 :Novel: Excession by Iain M. Banks :Short: \"A Crab Must Try\" by Barrington J. Bayley (Interzone 103) :Artwork: Jim Burns (cover for Ancient Shores) ;1997 :Novel: The Sparrow by Mary Doria Russell :Short: \"War Birds\" by Stephen Baxter (Interzone 126) :Artwork: SMS ('The Black Blood of the Dead' cover Interzone 116) ;1998 :Novel: The Extremes, by Christopher Priest :Short: \"La Cenerentola\" by Gwyneth Jones (Interzone 136) :Artwork: Jim Burns, 'Lord Prestimion' (cover, Interzone 138) ;1999 :Novel: The Sky Road by Ken MacLeod :Short: \"Hunting the Slarque\" by Eric Brown (Interzone 141) :Artwork: Jim Burns, Darwinia (cover of Darwinia, Robert Charles Wilson) ;2000 :Novel: Ash: A Secret History by Mary Gentle :Short: \"The Suspect Genome\" by Peter F. Hamilton (Interzone 156) :Artwork: Hideaway – Dominic Harman (Cover, Interzone 157) ;2001 :Novel: Chasm City by Alastair Reynolds :Short Story: \"Children of Winter\" by Eric Brown (Interzone 163) :Artwork: cover of Omegatropic by Colin Odell :Non-fiction: Omegatropic by Stephen Baxter ;2002 :Novel: The Separation by Christopher Priest :Short Fiction: Coraline by Neil Gaiman :Artwork: cover, Interzone 179 by Dominic Harman :Related Publication: Introduction to Maps: The Uncollected John Sladek by David Langford ;2003 :Novel: Felaheen by Jon Courtenay Grimwood :Short Fiction: The Wolves in the Walls by Neil Gaiman & Dave McKean :Artwork: cover, The True Knowledge of Ken MacLeod by Colin Odell :Non-fiction: Reading Science Fiction by Farah Mendlesohn ;2004 :Novel: River of Gods by Ian McDonald :Short Fiction: Mayflower II by Stephen Baxter :Artwork: cover, Newton's Wake by Stephan Martinière (US Edition) ;2005 :Novel: Air by Geoff Ryman :Short Fiction: Magic for Beginners by Kelly Link :Artwork: cover, Interzone #200 by Pawel Lewandowski :Non-fiction Award: Soundings: Reviews 1992-1996 by Gary K. Wolfe ;2006 :Novel: End of the World Blues by Jon Courtenay Grimwood :Short Fiction: The Djinn's Wife by Ian McDonald :Artwork: cover, Time Pieces Angelbot by Christopher \"Fangorn\" Baker ;2007 :Novel: Brasyl by Ian McDonald :Short Fiction: Lighting Out by Ken MacLeod :Artwork: Cracked World, cover of disLocations, by Andy Bigwood ;2008 :Novel: The Night Sessions by Ken MacLeod :Short Fiction: Exhalation by Ted Chiang :Artwork: cover of Subterfuge by Andy Bigwood :Non-fiction: Rhetorics of Fantasy by Farah Mendlesohn ;2009 :Novel: The City and the City by China Mieville :Short Fiction: The Beloved Time of Their Lives by Ian Watson and Roberto Quaglia :Artwork: cover of Desolation Road by Stephen Martiniere :Non-fiction: Mutant Popcorn by Nick Lowe ==Other websites== * BSFA website * List of all winning and nominated novels Category:Science fiction awards Category:Literary awards Category:Lists of books",
 "title": "BSFA Award"
}