{
 "id": "279976",
 "text": "Clinical psychology is the study in psychology of mental disorders.Kazdin, A. E. (1998). Research design in clinical psychology. Allyn & Bacon.Barker, C., Pistrang, N., & Elliott, R. (2015). Research methods in clinical psychology: An introduction for students and practitioners. John Wiley & Sons. It is about learning, understanding, diagnosing, treating or preventing these types of illnesses. Clinical psychologists examine the mental functioning of a person and use psychotherapy to treat the disorder. Psychotherapy uses talking instead of medical or physical treatments.Fox, R. (2017). Research in psychotherapy. Routledge. The first psychological clinic opened in 1896 at the University of Pennsylvania by Lightner Witmer.Witmer L. (1907). Clinical Psychology. The Psychological clinic, 1(1), 1–9.In the first half of the 20th century, clinical psychology mainly was about psychological assessment, and not treatment. After World War II, there was a big increase in the numbers of trained clinical psychologists. There are two main educational models - the Ph.D. scientist-practitioner model which looks at research, and the Psy.D. practitioner-scholar model which looks at the treatments. Clinical psychologists are now regarded as experts in psychotherapy. == Main schools == Clinical psychologists generally train in one of the four primary academic areas – psychodynamic, humanistic, behavior therapy/cognitive behavioral, and systems or family therapy. === Psychodynamic === Sigmund Freud's ideas led to the development of psychodynamic psychotherapy.Cabaniss, D. L. (2016). Psychodynamic Psychotherapy: A clinical manual. John Wiley & Sons. Its goal is to help the patient, or client, to understand the meaning of the unconscious desires and conflicts that have caused their problems. === Humanistic === Humanistic psychology was developed in the 1950s in reaction to both behaviourism (the belief that conditioning is the main cause of human behavior) and psychoanalysis (the belief that the unconscious is the main cause of human behavior).Schneider, K. J., Pierson, J. F., & Bugental, J. F. (Eds.). (2014). The handbook of humanistic psychology: Theory, research, and practice. Sage Publications.DeCarvalho, R. J. (1991). The founders of humanistic psychology. Praeger Publishers. The major principles of humanistic psychology are: # A person's present is more important than his past or future # People must take responsibility for their actions to be mentally healthy # Every person deserves basic human dignity # Self-improvement and self- understanding is the key to happiness. # Carl roger created client center therapy under Humanistic approach ==References== Category:Branches of psychology",
 "title": "Clinical psychology"
}