{
 "id": "280179",
 "text": "A villain is a bad person. The word comes from a Latin word meaning a feudal farm worker or peasant. Villains, or antagonists, are usually found in fiction, such as cartoons, comics, movies, television shows, novels, and video games. The audience do not usually like the villain and they support the hero or heroine. However, in some cases the villain is more praised by the public than the hero, as the example of Joker in the Batman franchise. In some movies and books (such as the movie Ocean's Eleven), the antagonist is a good person and the main character is bad (such as a robber). When used in comic books, they are depicted as supervillains. Supervillains usually hold some kind of unnatural force. There have been Cartoon villains since 1912. Villains such as Frankenstein, Dracula, Freddy Krueger, Jason Voorhees and Darth Vader are very popular in horror fiction. == History of Villains in Mythology and Religion == The Epic of Gilgamesh has a villain since in it the goddess Ishtar wants Gilgamesh to have sex with her and when he says no, she kills Gilgamesh’s best friend Enkidu. Egyptian mythology has Apep, a snake god who wants to eat the Sun. Also, it has Set murder Osiris and become king before Osiris’s son Horus overthrows Set. The Bible also has evil people in it called Biblical Villains. In Norse mythology, Loki doesn’t start out evil but becomes a villain when he kills Baldur. == History of Villains in Theatre == Ancient Greek tragedies like Antigone normally didn’t have villains. Though others like Agamemnon did. In the Middle Ages, a lot of plays in Europe had The Devil as the antagonist. Christopher Marlowe also wrote plays with villains like Faustus and The Jew of Malta. They were very evil. William Shakespeare wrote more complicated villains like Shylock in The Merchant of Venice, Edmund in King Lear and Caliban in The Tempest. Molière also had some villains like Dom Juan. In Opera and musicals, villains will often sing songs about how evil they are. For example, the Pirate King sings “Tonight the Traitor Dies” in The Pirates of Penzance. == History of Villains in Literature == A lot of books also have villains. Beowulf has to fight a monster named Grendel and Egil Skalagrimmson in Egil’s Saga has to escape an evil witch named Gunhilda. Sir Mordred is the villain of Le Morte d’Arthur by Sir Thomas Malory. Chaucer also had villains in some of the stories in The Canterbury Tales. Shakespeare had Tarquinius be a villain in The Rape of Lucrece. Miguel de Cervantes had someone called The Knight of Mirrors beat Don Quixote in Don Quixote. When John Milton wrote Paradise Lost, he had Satan be both the villain and the main character. Johann Wolfgang von Goethe had Mephisto be the villain of Faust. Percy Bysshe Shelley had Jupiter as the villain of Prometheus Bound. His wife Mary Shelley made Frankenstein's monster the villain of Frankenstein. Victor Hugo had Claude Frollo as the villain of The Hunchback of Notre Dame and he made Javert as the villain of Les Misérables. Charles Dickens also had a lot of villains like Fagin from Oliver Twist and Ralph Nickleby from Nicholas Nickleby. Sir Arthur Conan Doyle created James Moriarty to be a villain in Sherlock Holmes while Alexandre Dumas had Milady de Winter as the villain of The Three Musketeers and Jules Verne had Captain Nemo as the villain of Twenty Thousand Leagues Under the Sea. L. Frank Baum created the Wicked Witch of the West as the villain of the The Wizard of Oz. J.R.R Tolkien created the Dark lord Sauron as the villain of the Lord of the Rings and C. S. Lewis also created villains for The Chronicles of Narnia books. Isaac Asimov had a character called The Mule as a villain in Foundation. Dr. Seuss didn’t usually have villains but he sometimes did like the Grinch in How the Grinch Stole Christmas!, Kangaroo in Horton Hears a Who! and Yertle in Yertle the Turtle, who Dr. Seuss said was based on Hitler. Frank Herbert created Vladimir Harkonnen as the villain of the Dune books and Peter S. Beagle created King Harrow as the villain of The Last Unicorn. In the 1990s, J.K. Rowling created Lord Voldemort as the villain of Harry Potter. == Villains in Movies == Movie villains were invented in 1895 when Thomas Edison made a movie about Mary, Queen of Scots getting her head cut off or in 1896 when Georges Méliès made a Horror movie with The Devil in it. Edison also had villains in The Great Train Robbery. Also, in the early 1900s, there were movie versions of Les Misérables, The Merchant of Venice, Frankenstein, The Wizard of Oz and Twenty Thousand Leagues Under the Sea which all had villains. There were also villains in Birth of a Nation and Cecil B. DeMille’s The Ten Commandments movies. In 1937, Walt Disney had the Evil Queen as the villain of an animated Feature movie Snow White and the Seven Dwarfs. In 1977, Darth Vader the villain for Star Wars. Roger Ebert said a movie was only as good as its villain. Category:Literature Category:Movie terminology",
 "title": "Villain"
}