{
 "id": "280245",
 "text": "Brett Skinner (born June 28, 1983 in Brandon, Manitoba) is a Canadian professional ice hockey defenceman currently playing in the Russian Kontinental Hockey League with Amur Khabarovsk. ==Playing career== Skinner was drafted by the Vancouver Canucks 68th overall in the 3rd round of the 2002 NHL Entry Draft. Brett was a member of the Trail Smoke Eaters in the BCHL in 2000–01, the Des Moines Buccaneers in the USHL in 2001–02, and then the University of Denver from 2002–2005. As a Denver Pioneer, he was a member of two NCAA national championship winning teams, was named an All-American in 2004–05. He was named team captain for what would have been his senior year at Denver (2005–06) but signed his first professional contract with the Canucks on August 30, 2005, and made his pro debut with affiliate, the Manitoba Moose of the AHL, in the 2005–06 season. At the trade deadline, Skinner was traded by the Canucks, along with a 2nd round pick to the Mighty Ducks of Anaheim for Keith Carney and Juha Alen on March 9, 2006. Despite being dealt, Skinner remained on loan with the Moose until the end of the season. Brett spent the 2006–07 season, playing with the Augusta Lynx, Portland Pirates and the Omaha Ak-Sar-Ben Knights. He was traded by the Ducks, along with Nathan Saunders, to the Boston Bruins for Mark Mowers just prior to the 2007–08 season on September 24, 2007. Skinner enjoyed a break out year with the Providence Bruins recording 47 points in 68 games and playing in the AHL All-Star game. On July 3, 2008, Skinner was signed to a one-year contract by the New York Islanders. Brett was assigned to affiliate, the Bridgeport Sound Tigers of the AHL, to start the 2008–09 season. When a rash of injuries hit the Islanders, Skinner was recalled and made his NHL debut in a 4-2 defeat against the New York Rangers on October 27, 2008. Skinner played 11 games with the Isles before he was returned to the Sound Tigers. On January 13, 2009, Brett was traded by the Islanders to the Atlanta Thrashers for Junior Lessard. He was then assigned to affiliate, the Chicago Wolves, where he remained for the rest of the season. On July 8, 2009, Skinner signed a one-year contract with the Colorado Avalanche. He was assigned to the Avalanche's AHL affiliate, the Lake Erie Monsters, for 2009–10. Skinner scored 28 points in 73 games for the Monsters. During the season on January 22, 2010, Skinner was re-called but did not debut with the Avalanche. Skinner left North America as a free agent and signed a one-year contract with Russian team, Amur Khabarovsk, of the KHL on August 12, 2010. ==Awards and achievements== *2004–05 - WCHA First All-Star Team *2004–05 - NCAA Frozen Four All-American Team *2004–05 - NCAA West Second All-American Team ==Career statistics== Regular season Playoffs Season Team League GP G A Pts PIM GP G A Pts PIM 2000–01 Trail Smoke Eaters BCHL 59 11 24 35 43 — — — — — 2001–02 Des Moines Buccaneers USHL 46 9 38 47 25 3 0 1 1 0 2002–03 University of Denver WCHA 37 4 13 17 27 — — — — — 2003–04 University of Denver WCHA 44 7 23 30 32 — — — — — 2004–05 University of Denver WCHA 41 4 31 35 28 — — — — — 2005–06 Manitoba Moose AHL 65 4 21 25 33 13 0 4 4 19 2006–07 Augusta Lynx ECHL 5 1 3 4 8 — — — — — 2006–07 Portland Pirates AHL 41 6 12 18 24 — — — — — 2006–07 Omaha Ak-Sar-Ben Knights AHL 21 0 6 6 2 5 0 3 3 2 2007–08 Providence Bruins AHL 68 7 40 47 47 10 0 1 1 0 2008–09 Bridgeport Sound Tigers AHL 24 1 11 12 10 — — — — — 2008–09 New York Islanders NHL 11 0 0 0 4 — — — — — 2008–09 Chicago Wolves AHL 37 3 20 23 4 — — — — — 2009–10 Lake Erie Monsters AHL 73 3 25 28 43 — — — — — AHL totals 329 24 135 159 163 28 0 8 8 21 NHL totals 11 0 0 0 4 — — — — — ==References== == Other websites == * Category:1983 births Category:Living people Category:Bridgeport Sound Tigers players Category:Canadian ice hockey defencemen Category:Chicago Wolves players Category:Grand Rapids Griffins players Category:Ice hockey people from Brandon, Manitoba Category:Lake Erie Monsters players Category:Manitoba Moose players Category:New York Islanders players Category:Norfolk Admirals players Category:Omaha Ak-Sar-Ben Knights players Category:Portland Pirates players Category:Providence Bruins players Category:Rockford IceHogs (AHL) players Category:Swedish Hockey League players Category:United States Hockey League players Category:ECHL players",
 "title": "Brett Skinner"
}