{
 "id": "280300",
 "text": "Cameron \"Cam\" Jerrell Newton (born May 11, 1989) is an American football former professional quarterback. He played parts of eleven seasons in the National Football League (NFL). He played for the Carolina Panthers and New England Patriots. He played college football at Auburn University, where he won a National Championship in 2011. ==Biography== Newton was born in Savannah, Georgia to parents Cecil and Jackie Newton. His father played professional football in the NFL. He grew up in College Park, Georgia. He attended Seaborn Lee Elementary School and then Camp Creek Middle School.Merrill, Elizabeth. NFL draft 2011: Tracing Cam Newton's journey to the NFL. ESPN. Retrieved May 1, 2011. In 2003, he attended Westlake High School in Fulton County, Georgia, where he played football and basketball. In 2007, as a freshman at the University of Florida, Newton earned the spot over fellow quarterback John Brantley as the back-up for star quarterback and eventual Heisman Trophy winner Tim Tebow. He played in five games and threw for 40 yards on 5-of-10 passing and ran the ball 16 times for 103 yards and three touchdowns.Aschoff, Edward. NFL draft 2011: Tracing Cam Newton's journey to the NFL. ESPN. Retrieved May 1, 2011. In 2008, during his sophomore season, Newton played in the season opener against Hawaii. He then suffered an ankle injury. On November 21, 2008, police arrested Newton for stealing a laptop computer. He was suspended by the team.Paul Loschak account of laptop theft differs from Cam Newton . Gatorsports.com. Retrieved on 2011-07-01. Newton tossed the computer out his dorm window in an attempt to hide it from the police. Newton was suspended indefinitely and announced his intention to transfer three days before Florida's national championship win over Oklahoma. All criminal charges against him were dropped after he completed a court- approved pretrial diversion program. Foxsports.com reported that Newton left the University of Florida after the fall semester in 2008 rather than face suspension or expulsion in part because of three instances of academic cheating. In January 2009, Newton transferred to Blinn College a junior college in Brenham, Texas. In fall 2009, he was quarterback for the team. The team won the 2009 NJCAA National Football Championship. Newton then wanted to transfer to a four-year college, and his father allegedly sought money from the schools competing for Newton's attendance. Newton transferred to Auburn University where he also played quarterback. ===Eligibility controversy=== Newton spent much of the second half of the 2010 football season haunted by allegations that his father wanted money in return for his son playing for a major-college team. If true, this would violate National Collegiate Athletic Association rules. In early November, officials with Mississippi State University charged that Cecil Newton said that it would take \"more than just a scholarship\" to secure his son's services. This demand was apparently spread by Kenny Rogers, a recruiter who formerly played for the Bulldogs, to John Bond, his former teammate at MSU. Rogers later said in a Dallas radio interview that Cecil Newton said it would take \"anywhere between $100,000 and $180,000\" to get his son to transfer to MSU. Auburn maintained throughout the scandal that they were not involved in any pay-for-play scheme, and that Cam Newton was allowed to play. On December 1, the NCAA announced that Auburn had declared Cam Newton to be ineligible. Auburn found evidence that Cecil Newton did in fact ask Mississippi State for money in exchange for Cam Newton's athletic service. Auburn immediately asked the NCAA to reinstate Newton. The NCAA quickly reinstated Newton, declaring him eligible for the 2010 SEC Championship Game three days later. The NCAA said that there was not sufficient evidence that Cam Newton or anyone from Auburn had any knowledge of Cecil Newton's actions. Auburn subsequently limited the access Cecil Newton had to the football program as result of NCAA findings. Also due to increased pressure by the media and the NCAA investigation, Cecil Newton announced he would not attend the Heisman Trophy Ceremony. The NCAA reinstatement did not clear Cecil Newton of any wrongdoing. The NCAA action did make Cam Newton eligible to win the Heisman Trophy. He won the award with 2,263 points and 729 first-place votes. In October 2011, the NCAA closed its 13-month investigation into the Auburn University recruitment of Newton. The NCAA conducted over 50 interviews, and reviewed bank records, IRS documents, telephone calls, and e-mail messages. The NCAA found nothing that would indicate Auburn paid to recruit Newton to become an Auburn student. The NCAA's Stacey Osburn would say \"We've done all we can do. We've done all the interviews. We've looked into everything, and there's nothing there. Unless something new comes to light that's credible and we need to look at, it's concluded.\" ==Professional career== Newton was selected 1st overall by the Carolina Panthers in the 2011 NFL Draft. On July 29, 2011, Newton signed a four-year deal worth over $22 million that is fully guaranteed. He was the number one quarterback for the team, above Jimmy Clausen and Derek Anderson. In his first NFL game on September 11, 2011, Newton was 24–37 passing for 422 yards, 2 touchdowns and 1 interception in a 28–21 road loss to the Arizona Cardinals. With a quarterback rating of 110.4, he also rushed for a touchdown, and became the first rookie to throw for over 400 yards in his first career game. His 422 passing yards broke Peyton Manning's rookie record for most passing yards on opening day.Carolina Panthers vs. Arizona Cardinals – Box Score – September 11, 2011 – ESPN. Scores.espn.go.com (2011-09-11). Retrieved on 2011-10-23. In his second career game, his team lost 30–23 to the defending Super Bowl champion Green Bay Packers. Newton broke his own record, set the weekend previously, with 432 yards passing, throwing and rushing for a touchdown.Newton sets more records, Packers get win. ESPN.com. Retrieved on September 18, 2011. Newton's 854 passing yards in the first two games of the season was the most in league history by a rookie.Associated Press (September 18, 2011). Newton throws for NFL rookie record 432 yards. Forbes.com. Retrieved on September 18, 2011. Newton broke the NFL record of 827 set by Kurt Warner in the 2000 season. He also became the only player to begin his career with consecutive 400-yard passing gamesSnyder, Deron (September 20, 2011). Cam Newton Shows Them All . The Root.com. Retrieved on September 20, 2011. He broke the Carolina Panthers franchise record of 547 yards previously held by Steve Beuerlein.Associated Press (September 18, 2011). Aaron Rodgers helps Packers overcome Cam Newton's 2nd straight 400-yard day . ESPN.com. Retrieved on September 18, 2011. After Newton's second career game, Packers quarterback Aaron Rodgers commented \"I think someone said in the locker room that I'm kind of glad we played him early in the season because when he figures it out fully, he's going to be even tougher to stop.\" Newton's three additional interceptions against the Packers tied him for the most interceptions thrown in the league. He passed a total of 1,012 yards in the first three games. The Panthers won for the first time in the season against the Jacksonville Jaguars 16–10. Newton threw for 158 yards and one touchdown. The Panthers played the Atlanta Falcons, losing 31–17 while passing for 237 yards with no passing touchdowns. Newton's three interceptions returned him to leading the NFL in interceptions. On October 23, 2011, the Carolina won over the Washington Redskins, 33-20. Newton completed 18 of 23 passes for 256 yards and a touchdown. Newton also ran for 59 yards and a touchdown. Despite his bad interception count, Newton was voted the 2011Offensive Rookie of the Year. Newton stopped playing professional football after the 2021 season but never officially retired. == Academic life == In 2015, Newton graduated from Auburn University with a degree in sociology. He had promised his mom he would get his degree, which he did. == Accomplishments and records == === Awards === * NFL MVP (2015) * NFL Offensive Player of the Year (2015) * Best NFL Player ESPY Award (2016) * PFWA MVP (2015) * PFWA All- NFL Team (2015) * PFWA All-NFC Team (2015) * Bert Bell Award (2015) * PFWA All-Rookie Team (2011) * All-Iron Award (2015) * NFL Offensive Rookie of the Month (September 2011) * 3× Pepsi NFL Rookie of the Week (Weeks 4, 15, 16 2011) * 10× NFC Offensive Player of the Week * PFWA Offensive Rookie of the Year (2011) * Sporting News Rookie of the Year (2011) * Heisman Trophy winner (2010) * Consensus All-American (2010) * First-team All-SEC (2010) * Sporting News College Player of the Year (2010) === Rookie records and achievements === * Most combined touchdowns for a rookie in NFL history (35) * Most combined yards for a rookie in NFL history (4,784) * First rookie to pass for at least 4,000 yards * First and only rookie to pass for more than 4,000 yards and rush for more than 700 yards * First rookie in NFL history to pass for more than 400 yards in back to back games, September 11, 2011, against the Arizona Cardinals and September 18, 2011, against the Green Bay Packers === Records and achievements === * Second most rushing touchdowns by a quarterback in NFL history (75) * Most passing yards by a quarterback in his first two games (854), September 11, 2011, against the Arizona Cardinals and September 18, 2011, against the Green Bay Packers * Most games in NFL history with a passing touchdown and a rushing touchdown (32) * Most player of the week awards in a single season (5) tied with Tom Brady * First player in NFL history and most games with at least 250 passing yards, 100 rushing yards, one passing touchdown, and one rushing touchdown in a single game (2) * Most games in single season with at least one passing touchdown and one rushing touchdown (8) * Only player in NFL history with at least 30 passing touchdowns and 10 rushing touchdowns in same season: 2015 * Most rushing touchdowns in single season by a quarterback (14), achieved on December 4, 2011, against the Tampa Bay Buccaneers * Most combined yards in a player's first five seasons (21,560) * First quarterback and fifth player in NFL history with at least 500 rushing yards, 5 rushing touchdowns, and 4.8 yards a carry in 5 consecutive NFL seasons * First quarterback in NFL history to win both NFL Offensive Rookie of the Year and NFL MVP at some point in his career. * Most passing yards by a quarterback in debut game (422), September 11, 2011, against the Arizona Cardinals * First quarterback in NFL history to pass for more than 400 yards in first two career starts, September 11, 2011, against the Arizona Cardinals and September 18, 2011, against the Green Bay Packers * Fastest player to throw for 1,000 yards (at Arizona Cardinals, vs. Green Bay Packers, and vs. Jacksonville Jaguars) * Sixth quarterback to throw for 400+ yards in back-to- back games * First player in NFL history with at least five rushing touchdowns and five passing touchdowns in his first five games * Twenty-fifth NFL player (and first quarterback) to have 20 rushing touchdowns in first two seasons * First player to have 30 passing touchdowns and 20 rushing touchdowns in first two seasons * First player in NFL history with 50 passing touchdowns and 25 rushing touchdowns in his first three seasons * First player in NFL history with 4,000+ passing yards and 10+ rushing touchdowns in a season * First player in NFL history with 4,000+ passing yards and 500+ rushing yards in a season * First quarterback in NFL history with 100+ pass touchdowns and 25+ rush touchdowns in first five seasons * First quarterback in NFL history with multiple seasons of 20+ passing touchdowns and 10+ rushing touchdowns in a season * First player in NFL history with 10,000 passing yards and 1,000 rushing yards in his first three seasons * First player in NFL history with 10,000 passing yards and 2,000 rushing yards in his first four seasons * First player in NFL history to have at least 3,000 passing yards and 500 rushing yards in five consecutive seasons * First quarterback in NFL history to rush for 100+ yards and pass for 300+ yards with 5 touchdowns in a single game (December 20, 2015). * First player in NFL history with 100+ rush yards and 5 pass touchdowns in a single game * First player with 3,500 passing yards, 20 passing touchdowns and 10 rushing touchdowns in a single season (2011, 2015) * First quarterback in NFL history with 10+ rushing touchdowns in multiple NFL seasons (2011, 2015) * Fourth quarterback to win 17+ straight regular-season starts in the Super Bowl era * Most games in NFL history with at least 200 passing yards and 80 rushing yards with multiple touchdown passes and a rushing touchdown (4 games) * Third quarterback in NFL history with 2+ passing touchdowns and 1+ rushing touchdown * Second quarterback in NFL history with 3+ passing touchdowns and 1+ rushing touchdown * Most touchdown passes from a player from Auburn * First starting quarterback to win the NFC South in consecutive seasons (2013–2015) * Second player in NFL history with 7,500+ pass yards and 40+ pass touchdowns in first two seasons, joining Peyton Manning ('99) * First quarterback in NFL history to earn a comeback victory when trailing in overtime * Third quarterback in NFL history to pass for over 3,000 yards in his first five seasons * Second most 5+ touchdown games in a single season (3) * Second quarterback with 300+ passing yards and 100+ rushing yards in a single game * First player in Super Bowl era to pass for 300 yards and rush for multiple touchdowns in a playoff game * Most rushing touchdowns by a quarterback in his first four seasons (33) === Panthers franchise records === Note: As of 2019 off-season * Pass completions, career (2,371), rookie season (310) * Pass attempts, career (3,980), playoff game (41, February 7, 2016, against the Denver Broncos in Super Bowl 50) * Passing yards, career (29,041), game (432, September 18, 2011, against the Green Bay Packers), playoff game (335, January 24, 2016, against the Arizona Cardinals in the NFC Championship), rookie season (4,051), rookie game (432, September 18, 2011, against the Green Bay Packers) * Passing touchdowns, career (182), game (5, thrice, shared with Steve Beuerlein), rookie season (21), rookie game (3, October 30, 2011, against the Minnesota Vikings and December 24, 2011, against the Tampa Bay Buccaneers, shared with Kerry Collins) * Interceptions, rookie game (4, November 20, 2011, against the Detroit Lions; shared with Kerry Collins (twice) and Chris Weinke) * Passer Rating, season (99.4 in 2015), game (153.3, December 13, 2015, against the Atlanta Falcons), playoff career (83.9), rookie season (84.5), rookie game (142.4, December 24, 2011, against the Tampa Bay Buccaneers) * Times sacked, career (291), game (9, November 10, 2014, against the Philadelphia Eagles; shared with Frank Reich), playoffs (16; shared with Jake Delhomme), playoff season (8 in 2015; shared with Jake Delhomme), playoff game (6, February 7, 2016, against the Denver Broncos in Super Bowl 50), rookie season (35) * Yards per pass attempt, game (12.65, September 16, 2012, against the New Orleans Saints), playoff season (10.68 in 2013), playoff game (11.96, January 24, 2016, against the Arizona Cardinals in the NFC Championship), rookie season (7.84), and rookie game (11.41, September 11, 2011, against the Arizona Cardinals) * Passing yards per game, career (232.3), playoffs (245.3), playoff season (267 in 2013), and rookie season (253.2) * 300+ yard passing games, career (20) and rookie season (3) * 4,000+ yard passing seasons: 1 (shared with Steve Beuerlein) * Rushing touchdowns, career (58), rookie season (14), rookie game (3, December 4, 2011, against the Tampa Bay Buccaneers; shared with Fred Lane) * Yards per carry, career (5.18), season (5.83 in 2012), rookie season (5.60) * Rush/Rec Touchdowns, playoff game (2; shared with 3 players), rookie season (14), rookie game (3, December 4, 2011, against the Tampa Bay Buccaneers; shared with Fred Lane) * Most combined yards in franchise history * Most NFC Offensive Player of the Week Awards in a single season (5) * Completions in a row (15) (December 6, 2015, against the New Orleans Saints) * First quarterback in franchise history to throw four touchdown passes in the first half of a game (November 22, 2015, against the Washington Redskins) === Patriots franchise records === * Longest run by a quarterback (49 yards) (against the New York Jets on January 3, 2021) * Most rushing yards by a quarterback, season (592) * Most rushing touchdowns by a quarterback, season (12, tied with Steve Grogan) * First Quarterback in Patriots History to have a Touchdown Catch * First Quarterback to receive the New England Media Award for 2020, by NE Journalists, awarded by their, President Andrew Callahan * First Black Quarterback to lead the Patriots an entire season as The QB 1 & Starter, 2020 == Personal life == === Relationships and children === Newton has four children with former girlfriend, Kia Proctor. Newton and Proctor split. === Diet and lifestyle === Newton was a self-proclaimed pescetarian. As of March 2019, he has become a vegan. Some say this delayed his injuries. On December 9, 2014, Newton was involved in a car crash in Charlotte in which he suffered two back fractures. ==References== ==Other websites== *https://kids.kiddle.co/Cam_Newton Category:1989 births Category:Living people Category:African-American players of American football Category:American Christians Category:American football quarterbacks Category:Carolina Panthers players Category:Heisman Trophy winners Category:New England Patriots players Category:People from Savannah, Georgia Category:Sportspeople from Georgia (U.S. state)",
 "title": "Cam Newton"
}