{
 "id": "280350",
 "text": "Nobel Laureate Abdus Salam of Pakistan led a group of scientists in starting TWAS in 1983. This group of important and respected scientists knew that scientific research in developing countries was not good enough and wanted to improve it. TWAS meant Third World Academy of Sciences. The name was changed to TWAS, the academy of sciences for the developing world in 2004. TWAS is a science academy uniting 1,000 scientists in some 70 countries. Its main goals are promoting the ability to do science and excellence for sustainable development in the South (see North-South divide). Its headquarters are at the Abdus Salam International Centre for Theoretical Physics (ICTP) in Trieste, Italy. * Developing countries have 80% of the world’s population, but only 28% of the world's scientists come from these countries. This is a problem for solving real-life problems affecting poor nations. * There is never enough money to support research in developing countries. Scientists in developing countries become isolated. This causes problems for scientists' careers, their institutions and, their nations. * Scientists in developing countries often earn poor salaries. They may get little respect for their work because others do not understand how important it can be. This causes brain drain from developing countries to the North. Then the South becomes even poorer. * Research institutions and universities in the South are under-funded, forcing scientists to work in difficult conditions and often with outdated equipment. The founding members of TWAS therefore decided to set up an organization that would help to: # Recognize, support and promote excellence in scientific research in the South; # Provide promising scientists in the South with research facilities necessary for the advancement of their work; # Facilitate contacts between individual scientists and institutions in the South; # Encourage South-North cooperation between individuals and centres of scholarship; # Promote scientific research on major developing countries problems. The Italian government has supported TWAS financially since it began. The director general of UNESCO and the president of TWAS signed an agreement. UNESCO has managed TWAS finance and staff since 1991. ==Original members== These are some of the original fellows. They started TWAS in 1983. * Hua Luogeng (1910–1985), China * Nil Ratan Dhar (1892–1987), India * Luis F. Leloir (1906–1987), Argentina * Benjamin Peary Pal (1906–1989), India * Ignacio Bernal (1910–1992), Mexico * Gerardo Reichel-Dolmatoff (1912–1994), Colombia * Emilio Rosenblueth (1926–1994), Mexico * Salimuzzaman Siddiqui (1897–1994), Pakistan * Abdus Salam (1926–1996), Pakistan * Carlos Chagas Filho (1910–2000), Brazil * Johanna Döbereiner (1924–2000), Brazil * Gopalasamudram Narayana Ramachandran (1922–2001), India * Thomas Risley Odhiambo (1931–2003), Kenya * Marcel Roche (1920–2003), Venezuela * Sivaramakrishna Chandrasekhar (1930–2004), India * Thomas Adeoye Lambo (1923–2004), Nigeria * Autar Singh Paintal (1925–2004), India ==Other websites== * Category:Scientific organizations Category:1983 establishments in Europe Category:Organizations based in Italy",
 "title": "TWAS"
}