{
 "id": "280434",
 "text": "In mathematics, a linear equation is a type of equation. A linear equation is the equation of a straight line. This type of equation is written in the form: y = mx + b or (y-y_1) = m(x-x_1) also known as rise over run. or Ax+By=C otherwise, standard form The m is the rate of change or slope. The slope is how fast the line moves up or down. Numbers farther from 0, or a larger absolute value will make the slope steeper. If m is a negative number, then the line will appear to fall or go down the page when read from left to right. If m is a positive number, then the line will appear to climb the page when read from left to right. While b is the y-intercept of the function. This is where the function crosses the y-axis of the coordinate plane. The first equation is called slope-intercept form because, in it, the slope (m) and y-intercept (b) are easily found. The second equation is called point-slope form because, in it, a point on the graph (x1, y1) and the slope (m) are easily found. You can find the slope of a graph by seeing how much the y-value increases by for every one x-value. You can find the y-intercept of a graph by looking at where the x coordinate equals 0, and see what the y-value equals. As per the standard form equation, there are certain rules that apply when using such. A, B, and C must all be integers, \"A\" must always be a positive coefficient, and none can have a shared common factor (GCF). In all linear equations, variable \"x\" and \"y\" are always representative of the coordinates. In order to graph with a standard form equation, one of the \"x\" or \"y\" variables has to be substituted with the number zero, leaving either \"Ax=c\" or \"By=c\". In replacing the \"x\" or \"y\" variables with 0, we are finding the intercepts on each axis. With this, we can plot them on the line. When given an equation that must be transferred over to the standard form but has a one fraction in the equation, you must multiply the denominator of that fraction to every number present. (e.g, 1/2x+2y=9, when turned into standard becomes x+4y=18) When given an equation with multiple (at max 3) fractions, check first for the LCM (least common multiple) and use that number to multiply into every fraction, thus turning it into a standard form equation. Finally, always remember to simplify standard form equations at the end if you have a common factor between your numbers. Also remember that standard form equations do not need to be graphed in standard, but can also be turned into Slope-Intercept form as shown above. Slope-intercept is usually the easiest to graph in most cases, but standard has its uses. ==References== Category:Equations",
 "title": "Linear equation"
}