{
 "id": "280431",
 "text": "{{Infobox Writer | name = Gardner Dozois | image = GardnerDozoisCW98 wb.jpg | imagesize = 200px | caption = Gardner Dozois | pseudonym = | birth_date = | birth_place =Salem, Massachusetts, U.S. | death_date = | death_place =Philadelphia, Pennsylvania, U.S. | occupation = Editor, writer | nationality = American | period = 1966—2018 | genre = | subject = | movement = | influences = | influenced = | signature = | website = }} Gardner Raymond Dozois (July 23, 1947 - May 27, 2018) was an American science fiction writer and editor. He was editor of Asimov's Science Fiction magazine from 1984 to 2004. He won several Hugo and Nebula awards. He won as an editor and as a writer of short fiction. ==Biography== Dozois was born on July 23, 1947 in Salem, Massachusetts.\"Gardner Dozois: The Good Stuff,\" Interview, Locus: The Magazine of the Science Fiction and Fantasy Field, Nov. 2008, issue 574, pages 68-70. He was in the Army from 1966 to 1969 as a journalist. He then moved to New York City to work as a science fiction editor. Dozois said that one reason he started reading fiction was to escape from his isolated home town. In 2004, Dozois was badly injured in a traffic accident while going home in a taxi from a Philadelphia Phillies game. He missed Worldcon for the first time in many years because of the accident. He did make a full recovery. On July 6, 2007, Dozois had a planned heart surgery. A week later, he experienced problems and had another operation to put in a defibrillator. On May 27, 2018, Dozios died of multiple organ failure complicated by an infection at a hospital in Philadelphia at the age of 70. == Fiction == Dozois mostly wrote short stories. He won the Nebula Award for best short story twice: once for \"The Peacemaker\" in 1983, and again for \"Morning Child\" in 1984. His short fiction has been collected in The Visible Man (1977), Geodesic Dreams (a best-of collection), Slow Dancing through Time (1990, with other authors), and Strange Days (2001, another best-of collection). He wrote fewer novels. He wrote one novel by himself, Strangers (1978). He wrote, Nightmare Blue (1977) with George Alec Effinger. Dozois also wrote Hunter's Run (2008) with George R. R. Martin and Daniel Abraham. After he became editor of Asimov's, Dozois wrote less fiction. Later, he began writing more. His 2006 novelette \"Counterfactual\" won the Sidewise Award for best alternate-history short story. Dozois also agreed to write short fiction reviews for Locus. == Editorial work == Dozois mainly worked as an editor. He won 15 Hugo Awards for Best Professional Editor, nearly every year between 1988 and his retirement from Asimov's in 2004. That is more than anyone else. He also worked in the 1970s with magazines such as Galaxy Science Fiction, If, Worlds of Fantasy, and Worlds of Tomorrow.\"Gardner Dozois: The Good Stuff,\" Interview, Locus: The Magazine of the Science Fiction and Fantasy Field, Nov. 2008, issue 574, pages 68-70. Dozois was well known for publishing books that collected many short stories. After leaving Asimov's, he continued as the editor of the series The Year's Best Science Fiction. This has been published each year since 1984. He also edited a long series of themed anthologies with Jack Dann. Each book has a title that explains the theme, such as Cats, Dinosaurs, Seaserpents, or Hackers. Dozois always said he was especially interested in adventure science fiction and space opera. He calls these two sub-genre \"center-core SF\".Gardner Dozois, the Revitalization of Genre SF, and The New Space Opera by Dave Truesdale, Fantasy and Science Fiction, accessed Nov. 3, 2008. Michael Swanwick published a book-length interview with Dozois in 2001. The book was called Being Gardner Dozois. It was about each published piece of fiction Dozois ever wrote. Swanwick had written some stories together with Dozois. In 2002, the interview was named as a possible Hugo Award for Best Related Book winner. It won the 2002 Locus Award for Non-Fiction. ==Works== === Fiction (This list is not complete) === *\"A Special Kind of Morning\" (1971) *\"Chains of the Sea\" (1971) *\"Machines of Loving Grace\" (1972) *A Day in the Life (1973, )First Edition 1978 Library of Congress number 78-160655 *Nightmare Blue (with George Alec Effinger) (1977, ) *The Visible Man (collection) (1977, ASIN B000GZU4C8) *Strangers (1978) *\"A Traveler in an Antique Land\" (1983) *\"The Peacemaker\" (1983) (Nebula Award winner) *\"Morning Child\" (1984) (Nebula Award winner) *Slow Dancing Through Time (collection) (1990, 978-0942681031) *Geodesic Dreams (collection) (1992, ) *\"A Knight of Ghosts and Shadows\" (1999) *Strange Days: Fabulous Journeys with Gardner Dozois (collection) (2001) * \"The Hanging Curve\" (F&SF;, April 2002) *Morning Child and Other Stories (collection) (2004, ) *\"When the Great Days Came\" (The Magazine of Fantasy and Science Fiction, Dec 2005) *Shadow Twin (2005) (with George R. R. Martin and Daniel Abraham) * \"Counterfactual\" (F&SF;, June 2006) *Hunter's Run (2008, ) (with George R. R. Martin and Daniel Abraham) === Nonfiction === *The Fiction of James Tiptree, Jr. (1977, ) *Writing Science Fiction & Fantasy (1993, ) (co-edited with Stanley Schmidt and Sheila Williams) ===Anthologies edited by Gardner Dozois (This list is not complete)=== *Future Power (1976, ) (co-edited with Jack Dann) *Another World: Adventures in Otherness (1977, ) *Ripper (1988, ) (co-edited with Susan Casper) *Modern Classics of Science Fiction (1992, ) *Future Earths: Under African Skies (1993, ) (co-edited with Mike Resnick) *Future Earths: Under South American Skies (1993, ) (co-edited with Mike Resnick) *Modern Classics: Short Novels of Science Fiction (1994, ) *Mammoth Book of Contemporary SF Masters (1994, ) *Killing Me Softly (1995, ASIN B000OEN80G) *Dying for It (1997, ASIN B000H40WZC) *Modern Classics of Fantasy (1997, ) *Roads Not Taken: Tales of Alternate History (1998, ) (co-edited with Stanley Schmidt) *The Good Old Stuff: Adventure SF in the Grand Tradition (1998, ) *The Good New Stuff: Adventure in SF in the Grand Tradition (1999, ) *Explorers: SF Adventures to Far Horizons (2000, ) *The Furthest Horizon: SF Adventures to the Far Future (2000, ) *Worldmakers: SF Adventures in Terraforming (2001, ) *Supermen: Tales of the Posthuman Future (2002, ) *Galileo's Children: Tales of Science vs. Superstition (2005, ) *One Million A.D. (2005, ) *Nebula Awards Showcase 2006 (2006, ) *Escape From Earth: New Adventures in Space (2006, ) (co-edited with Jack Dann) *Wizards: Magical Tales from the Masters of Modern Fantasy (2007, ) (co-edited with Jack Dann) *The New Space Opera (2007, ) (co-edited with Jonathan Strahan) *Galactic Empires (2007) *The New Space Opera 2 (2009, ) (co-edited with Jonathan Strahan) ====Anthologies co-edited by Dozois and Martin that mix genres==== *Songs of the Dying Earth, a tribute anthology to Jack Vance´s seminal Dying Earth series, published by Subterranean Press (co-edited with George R. R. Martin) (2009) *Warriors, a massive, cross-genre anthology featuring stories about war and warriors (co-edited with George R. R. Martin) (2010) *Songs of Love and Death, a cross-genre anthology featuring stories of romance in fantasy and science-fiction settings (co-edited with George R. R. Martin) (2010) *Down these Strange Streets, a cross-genre anthology featuring stories of private-eye detectives in fantasy and science fiction settings (co-edited with George R. R. Martin) (forthcoming) ====Themed anthology series co-edited by Dozois and Dann==== *Unicorns! (1982, ASIN B000LW2UHI) (co-edited with Jack Dann) *Bestiary! (1986, ) (co-edited with Jack Dann) *Mermaids! (1986, ) (co-edited with Jack Dann) *Sorcerers! (1986, ) (co-edited with Jack Dann) *Demons! (1987, ) (co-edited with Jack Dann) *Magicats! (1987, ) (co-edited with Jack Dann) *Dogtales! (1988, ) (co-edited with Jack Dann) *Seaserpents! (1989, ) (co-edited with Jack Dann) *Dinosaurs! (1990, ) (co-edited with Jack Dann) *Little People! (1990, ) (co-edited with Jack Dann) *Magicats II (1991, ) (co-edited with Jack Dann) *Unicorns II (1992, ) (co-edited with Jack Dann) *Dragons! (1993, ) (co-edited with Jack Dann) *Invaders! (1993, ) (co-edited with Jack Dann) *Horses! (1994, ) (co-edited with Jack Dann) *Angels! (1995, ) (co-edited with Jack Dann) *Dinosaurs II (1995, ) (co-edited with Jack Dann) *Hackers (1996, ) (co-edited with Jack Dann) *Timegates (1997, ) (co-edited with Jack Dann) *Clones (1998, ) (co-edited with Jack Dann) *Immortals (1998, ) (co-edited with Jack Dann) *Nanotech (1998, ) (co-edited with Jack Dann) *Armageddons (1999, ) (co-edited with Jack Dann) *Future War (1999, ) (co-edited with Jack Dann) *Aliens Among Us (2000, ) (co-edited with Jack Dann) *Genometry (2001, ) (co-edited with Jack Dann) *Space Soldiers (2001, ) (co-edited with Jack Dann) *Future Sports (2002, ) (co-edited with Jack Dann) *Beyond Flesh (2002, ) (co-edited with Jack Dann) *Future Crimes (2003, ) (co-edited with Jack Dann) *A.I.s (2004, ) (co-edited with Jack Dann) *Robots (2005, ) (co-edited with Jack Dann) *Beyond Singularity (2005, ) (co-edited with Jack Dann) *Futures Past (2006, ) (co-edited with Jack Dann) *Dangerous Games (2007, ) (co-edited with Jack Dann) *Wizards (2007) (co-edited with Jack Dann) ====\"Isaac Asimov's\" Series==== *Transcendental Tales from Isaac Asimov's Science Fiction Magazine (1989, ) *Time Travelers from Isaac Asimov's Science Fiction Magazine (1989, ) *Isaac Asimov's Robots (1991, ) (co-edited with Sheila Williams) *Isaac Asimov's Aliens (1991, ) *Isaac Asimov's Mars (1991, ) *Isaac Asimov's Earth (1992, ) (co-edited with Sheila Williams) *Isaac Asimov's War (1993, ) *Isaac Asimov's SF Lite (1993, ) *Isaac Asimov's Cyberdreams (1994, ASIN B000HWNC5Q) *Isaac Asimov's Skin Deep (1995, ) (co-edited with Sheila Williams) *Isaac Asimov's Ghosts (1995, ) (co-edited with Sheila Williams) *Isaac Asimov's Vampires (1996, ) (co-edited with Sheila Williams) *Isaac Asimov's Moons (1997, ) (co-edited with Sheila Williams) *Isaac Asimov's Christmas (1997, ) (co-edited with Sheila Williams) *Isaac Asimov's Detectives (1998, ) (co-edited with Sheila Williams) *Isaac Asimov's Camelot (1998, ) (co-edited with Sheila Williams) *Isaac Asimov's Solar System (1999, ) (co-edited with Sheila Williams) *Isaac Asimov's Werewolves (1999, ) (co-edited with Sheila Williams) *Isaac Asimov's Valentines (1999, ) (co-edited with Sheila Williams) *Isaac Asimov's Halloween (1999, ) (co-edited with Sheila Williams) *Isaac Asimov's Utopias (2000, ) (co-edited with Sheila Williams) *Isaac Asimov's Mother's Day (2000, ) (co-edited with Sheila Williams) *Isaac Asimov's Father's Day (2001, ) (co-edited with Sheila Williams) ====Year's Best Science Fiction Series==== * The Year's Best Science Fiction: First Annual Collection (1984) * The Year's Best Science Fiction: Second Annual Collection (1985) * The Year's Best Science Fiction: Third Annual Collection (1986) * The Year's Best Science Fiction: Fourth Annual Collection (1987) * The Year's Best Science Fiction: Fifth Annual Collection (1988) * The Year's Best Science Fiction: Sixth Annual Collection (1989) * The Year's Best Science Fiction: Seventh Annual Collection (1990) * The Year's Best Science Fiction: Eighth Annual Collection (1991) * The Year's Best Science Fiction: Ninth Annual Collection (1992) * The Year's Best Science Fiction: Tenth Annual Collection (1993) * The Year's Best Science Fiction: Eleventh Annual Collection (1994) * The Year's Best Science Fiction: Twelfth Annual Collection (1995) * The Year's Best Science Fiction: Thirteenth Annual Collection (1996) * The Year's Best Science Fiction: Fourteenth Annual Collection (1997) * The Year's Best Science Fiction: Fifteenth Annual Collection (1998) * The Year's Best Science Fiction: Sixteenth Annual Collection (1999) * The Year's Best Science Fiction: Seventeenth Annual Collection (2000) * The Year's Best Science Fiction: Eighteenth Annual Collection (2001) * The Year's Best Science Fiction: Nineteenth Annual Collection (2002) * The Year's Best Science Fiction: Twentieth Annual Collection (2003) * The Year's Best Science Fiction: Twenty-First Annual Collection (2004) *Best of the Best: 20 Years of the Year's Best Science Fiction (2005) (Anthology from previous Year's Best Science Fiction editions) * The Year's Best Science Fiction: Twenty-Second Annual Collection (2005) * The Year's Best Science Fiction: Twenty-Third Annual Collection (2006) *Best of the Best Volume 2: 20 Years of the Year's Best Short Science Fiction Novels (2007) (Anthology from previous Year's Best Science Fiction editions) * The Year's Best Science Fiction: Twenty-Fourth Annual Collection (2007) * The Year's Best Science Fiction: Twenty-Fifth Annual Collection (2008) * The Year's Best Science Fiction: Twenty-Sixth Annual Collection (2009) * The Year's Best Science Fiction: Twenty-Seventh Annual Collection (2010) ==Notes== ==Other websites== *Gardner Dozois's online fiction at Free Speculative Fiction Online *Gardner Dozois at Asimovs.com *The SF Site: A Conversation with Gardner Dozois *Locus Online: Gardner Dozois Interview (excerpt) *Gardner Dozois's Recommended Reading List (archived) *Michael Swanwick Online: Profile of Gardner Dozois Category:1947 births Category:2018 deaths Category:Deaths from multiple organ failure Category:Infectious disease deaths in Pennsylvania Category:American science fiction writers Category:Hugo Award winning writers Category:Nebula Award winning writers Category:Writers from Massachusetts Category:People from Salem, Massachusetts Category:American editors",
 "title": "Gardner Dozois"
}