{
 "id": "280696",
 "text": "Alaska Airlines () is a large airline from the United States. They are headquartered in Seattle, Washington, where they have one of their five hubs. Alaska Airlines also has hubs in Anchorage, Alaska, Los Angeles, California and Portland, Oregon. The company was named the top \"Traditional Carrier\" in customer satisfaction for the third year in a row by J. D. Power and Associates. As of 2023, it goes to 117 cities and has 305 airplanes. ==History== Alaska Airlines began in 1932 with the name \"McGee Airways\". McGee Airways was combined with several other airlines in 1934 and this created \"Star Air Lines\". History | Alaska Airlines The name was finally changed to \"Alaska Airlines\" on May 2, 1944. StanWing.Com - Insignia of the U.S.A Starting in 1947, Alaska Airlines bought many new planes. In the 1950s, Alaska Airlines started flying many worldwide charter (irregular) flights. The government later said that Alaska Airlines could only fly in the state of Alaska. In 1961, Alaska Airlines started flying to the Continental United States. In the 1970s, Alaska Airlines started flying charters to the Soviet Union. In 1972, Alaska Airlines introduced its famous \"Eskimo\" logo which is still used today. In 1985, Alaska started flying to many new cities in the West Coast of the United States. In 1988, Alaska Airlines started its first flights to Mexico. In the 1990s, Alaska Airlines became the first to sell tickets on the internet, to have self-service check-in and to have GPS on its planes. Alaska Airlines Pioneers | Alaska Airlines On January 31, 2000, an Alaska Airlines plane crashed in the Pacific Ocean. That crash led to many changes at the airline over the following years. http://www.ntsb.gov/news/pressreleases/Pages/NTSB_Determines_that_Poor_Maintenance_Practices_Led_to_the_Crash_of_Alaska_Airlines_Flight_261.aspx Alaska Airlines introduced a brand new logo on January 25, 2016. Alaska Airlines and Virgin America announced plans to merge on April 4, 2016. The merged airline kept the Alaska Airlines name, with Virgin America flying for the last time on April 24, 2018.Find cheap airline tickets and more - book today | Alaska Airlines ==Gallery== File:Alaska Airlines 4920s0.jpg|Alaska Airlines headquarters building File:Alaska Airlines Boeing 727-100 Silagi-2.jpg|An Alaska Airlines Boeing 727 in November 1979. File:Alaska-737-4QB-YVR.jpg|An Alaska Airlines Boeing 737-400 File:Alaska AIrlines Boeing 737-800 N566AS (48464018012).jpg|An Alaska Airlines 737-800 File:AlaskaAirlines(Skywest)E175N183SY SANFebruary2019.jpg|An Alaska Airlines Embraer E175 ==References== == Other websites == * Alaska Air's Official website Category:1932 establishments in North America Category:Airlines of the United States Category:Companies listed on the New York Stock Exchange Category:Low-cost airlines Category:Transport in Alaska Category:Companies based in Seattle",
 "title": "Alaska Airlines"
}