{
 "id": "280703",
 "text": "The Iapetus Ocean existed in the Neoproterozoic and Palaeozoic eras (between 600 and 400 million years ago). The ocean was in the southern hemisphere, between three paleocontinents. The ocean disappeared when these three continents joined to form one big landmass.The three palaeocontinents collided, producing three mountain-building events: the Caledonian, Taconic and Acadian orogenies. That large continent has been given various names, such as Laurussia or the Old Red Sandstone continent. Probably the best name is Euramerica, because basically it was American and Europe stuck together. The Iapetus Ocean was between continental masses that would at a much later time roughly form the opposite shores of the Atlantic Ocean. It was a kind of precursor of the Atlantic.The name Iapetus was first used by Harland & Gayer (1972), before that the ocean was referred to as the Proto-Atlantic At the start of the 19th century, American paleontologist Charles Doolittle Walcott noticed differences in early Paleozoic benthic trilobites either side of the line which later was called the Iapetus suture. The so called \"Pacific fauna\" of Laurentia, as found in Scotland and western Newfoundland, was quite different from those of Baltica, often called the \"Atlantic fauna\". The latter is found in the southern parts of the British Isles and eastern Newfoundland. Geologists of the early 20th century thought a large trough, a so-called geosyncline, had existed between Scotland and England in the early Paleozoic, keeping both sides separated. With the development of plate tectonics in the 1960s geologists concluded the Atlantic Ocean must have had a precursor before the time of Pangaea. That ocean had closed as three continents joined, producing the Iapetus suture. == Line of the suture == The Iapetus suture runs where the Iapetus Ocean was before. *In Great Britain the suture runs pretty much along the border between England and Scotland. On the east it runs through Lindisfarne, on the west through the Solway Firth.Gillen, Con 2003. Geology and landscapes of Scotland. Harpenden. Terra Publishing, pp. 69, 73, 75, 88 & 95. *On the Isle of Man it is the Niarbyl Fault, which is an exposed section of the suture. *On Ireland the suture runs from the east coast at Clogherhead in County Louth to the estuary of the River Shannon on the west. *In Canada, it runs through Newfoundland and New Brunswick. *In the United States the suture runs through the north-eastern states of Maine, New Hampshire, Massachusetts and Connecticut. There are other suture lines caused by the collision of continents in the run-up to Pangaea, but the Iapetus is the main one. == References == Category:Geology Category:History of the British Isles Category:History of North America",
 "title": "Iapetus Ocean"
}