{
 "id": "280838",
 "text": "Wonder Pets! is an American animated children's television series on Nick Jr. from 2006 to 2016. Two several video games, full special episodes, and educational shorts. The series wins an Emmy Award for Outstanding Achievement. Josh Selig developed the idea for the cartoon series while working on his previous series, Oobi. The series began with two animated shorts called \"Linny the Guinea Pig\", which acted as a pilot episode. They featured Linny going on adventures set to classical music. Selig first screened the shorts at the wrap party for Oobis first season. The crew of Oobi was impressed with them and urged Selig to pitch them to a TV channel. He eventually decided to send the shorts to Disney executives. Selig called Nickelodeon \"a great partner\", saying \"They're really the company that first believed in us when we pitched Oobi, and then they believed in us again on Wonder Pets!.\" The series' success lead to a full lane specials. The first has two for strangers, which is a successful store to teach us children about watching out for strangers. A Mickey Mouse special, was released on January one, the first day of 2021. another full special special making movie fantastic, aired as a special episode to continuation shows Legacy. ==Overview== Each episode follows a similar structure, with many hallmarks and repeated elements. As each episode begins, children are heard from off-screen, leaving school at the end of the day. They say goodbye to the classroom pets. The classroom is always decorated with student artwork and other items related to a given episode's particular storyline, featured animal, or geographic location. Once the classroom is empty, a pencil holder rattles to create the ringing of a phone. One by one, the classroom pets notice the ringing phone. As the phone rings, they put on their accessories (a hat for Linny, shoes and a sailor's cap for Tuck, and aviator goggles for Ming-Ming) and make their way towards the phone while singing their opening verses. The Wonder Pets answer the phone and find that an animal is in trouble somewhere. Linny, the Guinea Pig, explains the situation to the other two: Tuck Turtle and Ming-Ming Duckling. They all jump into a box filled with fabric scraps and jump back out wearing different outfits, often alluding to the area of the world they will be visiting. They make a quick joke and jump back into the box, emerging again in superhero capes. == Episodes == *Tea for Me: the cartoons want to share tea for a tea party, but they begin to bigger over the smallest amount of tea cups for the tea party. *Mysterious case of the disappearing comics: the comics at the bookstore gets stolen, the cartoons, go on a mystery, not knowing that dog has secretly stolen the comics to make a book called *Once upon a Mortimer: Mortimer accidentally unleashes a clam in the city of underwater palace, causing everything he touches the turn into clams, including Mickey. *A tale of two Doms: Dom accidentally switches with his grandfather Dominico, causing the two cats to be mistaken. Dominic tries to help with cooking, but he starts to mess things up. Wheelchair flipping and falling on the sidewalk. *Where is Morphle?: Run away from home after discovering he cannot move into everything he sees. everyone tries to the statue of liberty. *Catdog: the musical: cat dog want to participate in Nancy’s fun, musical extraordinaire, but are deemed to argue both for the act. Luckily, they learned that they can find their act of how they get along together and participate in the musical. *Flea bee Jeebies!: Butch ends up getting fleas after taking a fab bath and eating flea pie. Everyone begins to worry that is the flea monster. *Dog therapy: Pluto becomes afraid to go in the water, especially what it is very shallow deep water. however, the others are there to teach him to learn to jump in the water. *Expensive treat: Donald does not want to give away his things and only focus on buying expensive things. When he buys an expensive floaty, he ends up in the floaty that bounces around and the others must try to rescue him. *England teatime: during a vacation in England, everyone is not allowed in the palace due to having to learn special manners for the party. Donald is not used to be patient due to an instant, was holding a cuppa tea with his finger and only fumes and anger, and the others take him to men school to teach him some manners. *Penguin, a bird, and a runaway little girl oh my!: She beat the penguin encounters after she loses her mitten at the bottom of the ski lift. He helped her get it, at the bottom of the mountain is afraid to climb up to try and reunite with the gang. It is up with me to try and find a way with Nana had a rescue him. *Donald and Little stinker: Donald finds a stunk he name little stinker and becomes friends with him, teaching him ways about his stink. But the stink begins to attract everyone away, especially the gang. Donald must find a way how to make things smell good so that everyone won’t run away from his very far smell. *Oh, where oh, where has my dog gone?: Pluto is upset since he cannot help with everything and it runs away, he ends up on a boat to tip buck to. Must find a way to rescue before he gets sent away to the country Timbucktu. *A little mischief: Alvin is only interested in gathering nuts and food and accident ruins his hollow home. So he steals corn from the local corn shop and everyone must try to get him back while he runs away cheeky with the corn. *Cloudberry, cloudberry, go away: everyone is gathering for the cloudberry pie festival, but tiger does not like cloudberry pie and questions for the berries to go away so he can have raspberry pie. Eventually, the berries give her bad luck and learn his lesson by baking cloudberry pies to make them settle down. * ==References== ==Other websites== *Wonder Pets on nickjr.com * Category:2006 American television series debuts Category:American children's television series Category:Nick Jr. Category:Emmy Award winning programs Category:English-language television programs",
 "title": "Wonder Pets!"
}