{
 "id": "280844",
 "text": "The giant impact hypothesis says that around 4.5 billion years ago, the young Earth collided with a Mars-sized proto-planet, and the Moon formed out of the debris. This is the favoured scientific hypothesis for how the Moon formed. The object that collided with Earth is sometimes called Theia for the mythical Greek Titan: the mother of Selene, the goddess of the moon.Halliday, Alex N. 2000. Terrestrial accretion rates and the origin of the Moon. Earth and Planetary Science Letters 176 (1): 17–30. doi:10.1016/S0012-821X(99)00317-9.Wiechert U; Halliday A.N; Lee D-C; Snyder G.A; Taylor LA; Rumble D. 2001. Science. Science 294 (12): 345–348. doi:10.1126/science.1063037. PMID 11598294. http://www.sciencemag.org/cgi/content/abstract/294/5541/345. Retrieved 2009-07-05. Evidence for this hypothesis comes from Moon samples. These show that the Moon's surface was once molten (liquified by heat). They also show that the Moon has a relatively small iron core and a lower density than the Earth. Additionally, there is evidence that similar collisions have happened in other star systems, resulting in \"debris disks.\" This hypothesis leaves several unanswered questions. Lunar oxygen isotopic ratios are essentially identical to Earth's, and there is no evidence that another solar body contributed to them. Also, lunar samples do not have expected ratios of volatile elements, iron oxide, or siderophilic elements (chemical elements which bond with iron). Finally, there is no evidence that the Earth ever had the magma ocean implied by the hypothesis. == Context == === Age === The Earth's relatively large natural satellite, the Moon, is unique.The Earth's Moon is larger relative to its planet than any other satellite in the solar system. Pluto's satellite Charon is relatively larger, but Pluto is considered a dwarf planet. Astronauts in the Apollo program brought rocks from the Moon's surface to Earth. Radiometric dating of these rocks has shown the Moon to be 4527 ±10 million years old: about 30 to 55 million years younger than other bodies in the Solar System.Kleine et al. 2005. Hf-W chronometry of lunar metals and the age and early differentiation of the Moon. Science 310, 1671–1674.Halliday A.N. 2006. The origin of the Earth; what's new? Elements 2 205-210. New evidence suggests the Moon formed even later, around 4.48 ±0.02 Ga (billion years ago), or around 70–110 Ma (million years ago) after the start of the Solar System.Halliday, Alex N 2008. A young Moon-forming giant impact at 70–110 million years accompanied by late-stage mixing, core formation and degassing of the Earth. Philosophical Transactions of the Royal Society. 366, 4163-4181. doi:10.1098/rsta.2008.0209. http://rsta.royalsocietypublishing.org/content/366/1883/4163.full. === Low density === Another notable feature is the Moon's relatively low density, which must mean it does not have a large metallic core like other terrestrial bodies in the solar system do. The Moon has a bulk composition closely resembling the Earth's mantle and crust together, without the Earth's core. This has led to the giant impact hypothesis: the idea that the Moon was formed during a giant impact of the proto-Earth with another proto-planet.Ida S; Canup R.M. & Stewart G.M. 1997. Lunar accretion from an impact-generated disk, Nature 389, 353-357. === Theia === The impactor, sometimes called Theia, is thought to have been a little smaller than the planet Mars. It collided with Earth about 4.533 Ga.Münker, Carsten et al. 2003. Evolution of planetary cores and the Earth-Moon system from Nb/Ta systematics. Science 301 (5629): 84–87. doi:10.1126/science.1084662. PMID 12843390. http://sciencemag.org/cgi/content/abstract/301/5629/84 . Models show that if an impactor this size struck the proto-Earth at a low angle and relatively low speed (), much material from the mantles (and proto-crusts) of the proto-Earth and the impactor was ejected into space. Much of it stayed in orbit around the Earth. This material would eventually form the Moon. However, the metallic cores of the impactor would have sunk through the Earth's mantle to fuse with the Earth's core, depleting the Moon of metallic material.Liu L-G. 1992. Chemical composition of the Earth after the giant impact. Earth, Moon, and Planets 57, 85-97. The giant impact hypothesis thus explains the Moon's abnormal composition.Newsom H.E. & Taylor S.R. 1989. Geochemical implications of the formation of the Moon by a single giant impact. Nature 338, 29-34. The ejecta in orbit around the Earth could have condensed into a single body within weeks. Under the influence of its own gravity, the ejected material became a more spherical body: the Moon. The radiometric ages show the Earth existed already for at least 10 million years before the impact, enough time to allow for differentiation of the Earth's primitive mantle and core. Then, when the impact occurred, only material from the mantle was ejected, leaving the Earth's core of heavy elements untouched. === Consequences === The impact had some important consequences for the young Earth. It released an enormous amount of energy, causing both the Earth and Moon to be completely molten. Immediately after the impact, the Earth's mantle was vigorously convecting, the surface was a large magma ocean. The planet's first atmosphere must have been completely blown away by the enormous amount of energy released.Benz W. & Cameron A.G.W. 1990. Terrestrial effects of the giant impact. LPI Conference on the Origin of the Earth. 61-67. The impact is also thought to have changed Earth’s axis to produce the large 23.5° axial tilt that is responsible for Earth’s seasons (a simple, ideal model of the planets’ origins would have axial tilts of 0° with no recognizable seasons). The impact may also have sped up Earth’s rotation. == Recent evidence == Analysis of lunar rock brought back by Apollo astronauts appears to show traces of Theia. The researchers claim this confirms the theory that the Moon was created by a cataclysmic collision.Ghosh, Pallab 2014. Traces of another world found on the Moon. BBC News Science & Environment. Some scientists are surprised that the difference between the Theian material found in the Moon rock and the Earth is so small. == Related pages == *Catastrophism == References == Category:Moon Category:Earth sciences Category:Hadean",
 "title": "Giant impact hypothesis"
}