{
 "id": "280812",
 "text": "Counter-Strike is a multiplayer first-person shooter game that was created by Valve Corporation. The game was initially released on November 9, 2000, for Microsoft Windows and later released for Xbox in 2003, and for OS X and Linux in 2013. The game is divided into two teams: counter-terrorists and terrorists, where players fight against each other to achieve their mission or stop the opposing team from achieving theirs. Initially, Counter-Strike started as a mod for Valve's popular game, Half-Life. The game quickly gained traction, and in a short period of time, Valve Corporation made it into a standalone game. == Gameplay == In Counter-Strike, players complete missions to achieve objectives such as planting a bomb, rescuing hostages, or killing the VIP on the opposing team. The game's objective changes depending on the level and mission the teams are playing. The game ends when one team finishes their mission or eliminates all players on the opposing team. At the beginning of each round, players receive money, which they can use to purchase weapons and equipment that will help them complete their mission. As players progress through the game, they can earn more money, which can be used to purchase more powerful weapons and equipment. Counter-Strike is primarily an online game, and players connect to a server to fight against other players. The game's popularity led to the creation of several sequels, including Counter-Strike: Source and Counter-Strike: Global Offensive. Counter-Strike: Global Offensive was released on August 21, 2012, and has since become one of the most played games in the world. The game's success is due to its exciting gameplay, the ability to play online with friends, and the constant updates and additions to the game, which keep players engaged and interested. ==References== Category:2000 video games Category:Cooperative video games Category:Esports games Category:First-person shooters Category:Linux games Category:MacOS games Category:Microsoft video games Category:Multiplayer online games Category:Tactical shooters Category:Counter-Strike (series) Category:Valve Corporation games Category:Video games about bomb disposal Category:Video games about police officers Category:Video games about terrorism Category:Video games about the Special Air Service Category:Video games about the United States Navy SEALs Category:Video games developed in the United States Category:Video games set in Italy Category:Video games set in the United States Category:Windows games Category:Xbox games",
 "title": "Counter-Strike"
}