{
 "id": "281200",
 "text": "Jim Agnew (born March 21, 1966) is a Canadian retired professional hockey defenceman. Agnew was drafted by the Vancouver Canucks in the 8th round (157th overall) in the 1984 NHL Entry Draft. After a stellar career in the Western Hockey League with the Brandon Wheat Kings and Portland Winter Hawks, Agnew began his professional career with the Canucks in 1986. ==Playing career== Agnew spent most of the 1986–87 in the American Hockey League, although he did receive a four-game stretch with the Canucks. He would spend four full seasons in Vancouver's minor-league system while seeing occasional action in Vancouver. Playing ten games for the team in the 1987–88 during which time he recorded his only career point, and was called up again for seven games in 1989–90. While playing for the Canucks in March 1990, Agnew seriously injured his left knee and required surgery. This would be the start of a chronic knee problem. Injuries to his left knee caused him to miss significant action six times over the next four seasons, and required three separate surgeries. His knee problems struck just as he made the NHL on a full-time basis. He spent virtually the entire 1990–91 and 1991–92 seasons on the Canuck roster as a utility player seeing action at both forward and defence, but was limited to just 44 games over that stretch due to injury and failed to record a point. He was released by the Canucks in 1992 and signed as a free agent with the Hartford Whalers. Again, however, he was limited to only 16 games by an injury to his left knee. After injuring his knee again during the Whalers' 1993 training camp, he decided to retire. Agnew appeared in 81 NHL games over parts of six seasons, recording 1 assist and 257 penalty minutes. == Career statistics == Regular season Playoffs Season Team League GP G A Pts PIM GP G A Pts PIM 1982–83 Brandon Wheat Kings WHL 14 1 1 2 9 — — — — — 1983–84 Brandon Wheat Kings WHL 71 6 17 23 107 12 0 1 1 39 1984–85 Brandon Wheat Kings WHL 19 3 15 18 82 — — — — — 1984–85 Portland Winter Hawks WHL 44 5 24 29 223 6 0 2 2 44 1985–86 Portland Winter Hawks WHL 70 6 30 36 386 9 0 1 1 48 1986–87 Fredericton Express AHL 67 0 5 5 261 — — — — — 1986–87 Vancouver Canucks NHL 4 0 0 0 0 — — — — — 1987–88 Fredericton Express AHL 63 2 8 10 188 14 0 2 2 43 1987–88 Vancouver Canucks NHL 10 0 1 1 16 — — — — — 1988–89 Milwaukee Admirals IHL 47 2 10 12 181 11 0 2 2 34 1989–90 Milwaukee Admirals IHL 51 4 10 14 238 — — — — — 1989–90 Vancouver Canucks NHL 7 0 0 0 36 — — — — — 1990–91 Milwaukee Admirals IHL 3 0 0 0 33 — — — — — 1990–91 Vancouver Canucks NHL 20 0 0 0 81 — — — — — 1991–92 Vancouver Canucks NHL 24 0 0 0 56 4 0 0 0 6 1992–93 Springfield Indians AHL 1 0 1 1 2 — — — — — 1992–93 Hartford Whalers NHL 16 0 0 0 68 — — — — — NHL totals 81 0 1 1 257 4 0 0 0 6 == References == * * Profile at hockeydraftcentral.com Category:1966 births Category:Brandon Wheat Kings players Category:Canadian ice hockey defencemen Category:Fredericton Express players Category:Hartford Whalers players Category:Ice hockey people from Manitoba Category:Living people Category:Portland Winterhawks players Category:Springfield Indians players Category:Vancouver Canucks players Category:International Hockey League (1945–2001) players",
 "title": "Jim Agnew"
}