{
 "id": "281388",
 "text": "This is a list of filmography of all of Sylvester ″Sly″ Stallone's most prominent onscreen acting action roles as well as directing, screenwriting, producing and voice acting roles. Also, included in this list are some of Stallone's special cameo appearances and exclusive extra. American actor, filmmaker, singer, character actor, voice actor, director, movie producer, film producer, and screen writer, Sylvester Sly Stallone has appeared in over 82 films. == Film == Year Title Role Notes 1969 The Square Root Uncredited extra 1969 Downhill Racer Restaurant Patron Uncredited extra 1970 M*A*S*H Soldier Sitting at Camp Table Uncredited extra 1970 The Party at Kitty and Stud's Stud 1970 Lovers and Other Strangers Groomsman Uncredited extra 1970 The Sidelong Glances of a Pigeon Kicker Party Guest Uncredited extra 1971 Bananas Subway Thug #1 Uncredited cameo 1971 Klute Club Patron Uncredited extra 1972 What's Up, Doc? Hotel Guest Uncredited extra 1973 No Place to Hide Jerry Savage 1974 The Lords of Flatbush Stanley Rosiello Also additional dialogue 1975 The Prisoner of Second Avenue Youth in Park Cameo 1975 Capone Frank Ralph \"The Enforcer\" Nitti 1975 Death Race 2000 Joe \"Machine Gun\" Viterbo 1975 Mandingo Lynching Witness Uncredited extra 1975 Farewell, My Lovely Jonnie Cameo https://tvtropes.org/pmwiki/pmwiki.php/Film/FarewellMyLovely 1976 Cannonball Mafioso #2 Uncredited cameo 1976 Rocky Robert \"Rocky\" Balboa Also writer and boxing choreographer 1978 F.I.S.T. Johnny Kovak Also writer 1978 Paradise Alley Cosmo Carboni Also director and writer 1979 Rocky II Robert \"Rocky\" Balboa Also director, writer and boxing choreographer 1981 Nighthawks Sergeant Deke DaSilva Also uncredited director 1981 Escape to Victory Captain Robert Hatch 1982 Rocky III Robert \"Rocky\" Balboa Also director, writer and boxing choreographer 1982 First Blood John J. Rambo Also writer 1983 Staying Alive Man on Street Also director, writer and producer; uncredited cameo 1984 Rhinestone Nick Martinelli Also writer 1985 Rambo: First Blood Part II John J. Rambo Also writer 1985 Rocky IV Robert \"Rocky\" Balboa Also director, writer and boxing choreographer 1986 Cobra Lieutenant Marion \"Cobra\" Cobretti Also writer 1987 Over the Top Lincoln \"Linc\" Hawk Also writer 1988 Rambo III John J. Rambo Also writer 1989 Lock Up Frank Leone 1989 Tango & Cash Lieutenant Raymond \"Ray\" Tango 1990 Rocky V Robert \"Rocky\" Balboa Also writer 1991 Oscar Angelo \"Snaps\" Provolone 1992 Stop! Or My Mom Will Shoot Sergeant Joseph Andrew \"Joe\" Bomowski 1993 Cliffhanger Ranger Gabriel \"Gabe\" Walker Also writer 1993 Demolition Man Sergeant John Spartan 1994 The Specialist Captain Ray Quick 1995 Your Studio and You Himself Short film; uncredited cameo 1995 Judge Dredd Judge Joseph Dredd 1995 Assassins Robert Rath / Joseph Rath 1996 Daylight Chief Kit Latura 1997 Cop Land Sheriff Freddy Heflin 1997 An Alan Smithee Film: Burn Hollywood Burn Himself Limited release; cameo https://disney.fandom.com/wiki/An_Alan_Smithee_Film:_Burn_Hollywood_Burn 1997 The Good Life Boss Unreleased; cameo https://lostmediawiki.com/The_Good_Life_(lost_unreleased_comedy_crime_film;_1997) 1998 Antz Corporal Weaver Voice role 2000 Get Carter Jack Carter 2001 Driven Joe \"The Hummer\" Tanto Also writer and producer 2002 D-Tox Agent Jake Malloy Limited release 2002 Avenging Angelo Frankie Delano Direct-to-video 2003 Taxi 3 Passenger to Airport Uncredited cameo 2003 Shade Dean \"The Dean\" Stevens Limited release 2003 Spy Kids 3-D: Game Over Agent Sebastian \"The Toymaker\" Dual role 2006 Rocky Balboa Robert \"Rocky\" Balboa Also director, writer and boxing choreographer 2008 Rambo John J. Rambo Also director and writer 2009 Kambakkht Ishq Himself Cameo https://www.instagram.com/moviecameos/reel/C9EY76qSw7F/ 2010 The Expendables Barney Ross Also director and writer 2011 Zookeeper Joe the Lion Voice role 2012 The Expendables 2 Barney Ross Also writer 2012 Bullet to the Head James \"Jimmy Bobo\" Bonomo 2013 Escape Plan Ray Breslin / Anthony Portos 2013 Homefront Writer and producer only 2013 Grudge Match Henry \"Razor\" Sharp Also boxing choreographer 2014 The Expendables 3 Barney Ross Also writer/story 2014 Reach Me Chief Gerald Cavallo Streaming release 2015 Creed Robert \"Rocky\" Balboa Also producer 2016 Ratchet & Clank Lieutenant Victor Von Ion Voice role 2017 Guardians of the Galaxy Vol. 2 Stakar Ogord Cameo https://screenrant.com/guardians-galaxy-2-sylvester-stallone-starhawk/ 2017 Animal Crackers Bulletman Voice role 2018 Escape Plan 2: Hades Ray Breslin Direct-to-video 2018 Creed II Robert \"Rocky\" Balboa Also writer and producer 2018 Backtrace Detective Sykes Limited release 2019 Escape Plan: The Extractors Ray Breslin Direct-to-video 2019 Rallying Cry Jasper Reese Short film 2019 Rambo: Last Blood John J. Rambo Also writer/story 2019 One Night: Joshua vs. Ruiz Himself Documentary film; also executive producer 2021 The Suicide Squad Nanaue / King Shark Voice role 2021 The Making of Rocky vs. Drago by Sylvester Stallone Himself Documentary film; also producer 2022 Samaritan Joe Smith / Samaritan / Nemesis Streaming release; also producer 2022 MVP Limited release; executive producer only 2023 Creed III Producer only 2023 Guardians of the Galaxy Vol. 3 Stakar Ogord Cameo https://www.yahoo.com/entertainment/every-cameo-guest-star- guardians-020000086.html?guccounter=1&guce;_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS5wZy8&guce;_referrer_sig=AQAAAET6ppNxkLI6B4q-bi_DvncQriPUVbTDuWIrU8DvLxTlzCh7ywGF1LBnVn3X29FMraX3elxwYoC7EQ9dQk2joeCDz3rPY1mP9h5ySkGwdCJRfBir- RoamoUULNk4m_DG2AgvR-jvdF3XDQXyFg-kVYmwS40w2KUvdanfb8672uzX 2023 Expend4bles Barney Ross 2023 Sly Himself Documentary film; also executive producer 2024 Lost on a Mountain in Maine Limited release; producer only 2024 Armor Rook Limited release 2025 Alarum Agent Chester Limited release 2025 A Working Man Writer and producer only 2025 Giant Executive producer only; in production == Television == Year Title Role Notes 1973 The Evil Touch Episode: \"Heart to Heart\"; writer only 1975 Police Story Elmore \"Rocky\" Caddo Episode: \"The Cutting Edge\" 1975 Kojak Detective Rick Daly Episode: \"My Brother, My Enemy\" 1985 Heart of a Champion: The Ray Mancini Story Television film; executive producer only 1991 Dream On Himself Episode: \"The Second Greatest Story Ever Told: Parts 1 & 2\" 2002 Father Lefty Unsold television pilot for an unproduced TV series; writer and executive producer only 2002 Liberty's Kids Paul Revere Episode: \"Midnight Ride\"; voice role 2005 Las Vegas Frank \"The Repairman\" 2 episodes 2005 The Contender Rematch: Mora vs. Manfredo Television special; executive producer only 2006–2009 The Contender Himself - Host 16 episodes; also executive producer for 21 episodes 2010 Inferno: The Making of 'The Expendables' Himself Television documentary film; also producer 2013 Saturday Night Live Three Wise Guys Episode: \"John Goodman/Kings of Leon\"; uncredited cameo 2016 Strong 3 episodes; executive producer only 2017 Ultimate Beastmaster 24 episodes; creator also producer for 1 episode and executive producer for 1 episode only 2017 This Is Us Himself Episode: \"Déjà Vu\" 2022–2024 Tulsa King Dwight \"The General\" Manfredi 19 episodes; also executive producer for 14 episodes and writer for 2 episodes 2025 Extracted 10 episodes; executive producer only == Theatre == Year Title Role Venue Notes 1970 Score Telephone Repairman Mike Martinique Theater == Commercial == Year Title Role Notes 2020 Facebook: Groups - Ready to Rock? - 2020 Super Bowl Commercial Robert \"Rocky\" Balboa Cameo == Music video == Year Title Role Performer Notes 1987 \"Winner Takes It All\" Lincoln \"Linc\" Hawk Sammy Hagar Uncredited cameo == Soundtrack appearances == Year Title Song Notes 1978 Paradise Alley \"Too Close to Paradise\" 1979 The Muppet Show \"Let's Call the Whole Thing Off\", \"A Bird in a Gilded Cage\" Episode: \"Sylvester Stallone\"; uncredited 1982 Rocky III \"Take You Back\" Uncredited 1984 Rhinestone \"Stay Out of My Bedroom\", \"Woke Up in Love\", \"Drinkinstein\", \"Sweet Lovin' Friends\", \"Be There\" 2013 Grudge Match \"The Star-Spangled Banner\" == Video games == Year Title Voice role Notes 1994 Demolition Man Sergeant John Spartan Live action full-motion video; 3DO version only 2020 Mortal Kombat 11 John J. Rambo Downloadable content https://x.com/noobde/status/1314190432558080001?lang=bg ==Related pages== * List of awards and nominations received by Sylvester Stallone ==References== ==Other websites== * * Stallone, Sylvester",
 "title": "Sylvester Stallone filmography"
}