{
 "id": "281300",
 "text": "Patric Gösta Hörnqvist (born January 1, 1987) is a Swedish former professional ice hockey right winger. He played parts of fifteen seasons in the National Hockey League (NHL). He played for the Nashville Predators, Pittsburgh Penguins, and Florida Panthers. He also played for Djurgårdens IF of the Swedish Hockey League (SEL). Hörnqvist is a three-time Stanley Cup winner; two as a player for the Penguins and one as an executive for the Panthers. ==Career== Before playing in the NHL, Hörnqvist played six seasons for Djurgårdens IF of the Swedish Hockey League (SEL). He was selected 230th overall by the Nashville Predators in the 2005 NHL Entry Draft. He would spend six seasons with the Predators. On June 28, 2014, the Predators traded Hörnqvist along with Nick Spaling to the Pittsburgh Penguins in exchange for James Neal. During his time with the Penguins, Hörnqvist would find his most success. He would record his first career hat-trick in a 6–0 win against the Arizona Coyotes. On June 12, 2016, Hörnqvist would win his first Stanley Cup when the Penguins defeated the San Jose Sharks four games to two in the 2016 Stanley Cup Finals. The Penguins would go on to win a second Stanley Cup in a row when they defeated the Nashville Predators four games to two in the 2017 Stanley Cup Finals. Hörnqvist was the player who scored the Cup-winning goal. On 27 February 2018, he would sign a five-year; $26.5 million extension to stay with the Penguins. On 24 September 2020, the Penguins would trade Hörnqvist to the Florida Panthers, in exchange for Mike Matheson and Colton Sceviour. On 29 June 2023, Hörnqvist announced that he was retiring from playing professional ice hockey. ==References== == Other websites == * Category:1987 births Category:Living people Category:Florida Panthers players Category:Milwaukee Admirals players Category:Nashville Predators players Category:Pittsburgh Penguins players Category:Stanley Cup champions Category:Swedish ice hockey right wingers Category:Swedish Hockey League players",
 "title": "Patric Hörnqvist"
}