{
 "id": "281455",
 "text": "The City of London Livery Companies began as trade associations or trade guilds, which controlled who could carry out certain jobs in the City of London. == The Companies today == Today the companies act mainly as social and charitable groups, because over the centuries the livery companies have lost most rights to control trade, often as statute law applied the same standards across the whole country. Some support schools which were set up in the 1500s. Others sponsor apprentices in colleges and unversities. Some still have a statutory role. For example the Goldsmiths' Company continue to run the London Assay Office where several million articles of gold, silver and platinum are hallmarked each year. == List of Companies in order of precedence == The order of precedence was first set down in 1515 by the Aldermen of the City of London. Forty-eight livery companies then existed. The list was based on the companies' economic or political power. The first twelve livery companies are known as the Great Twelve City Livery Companies. There are now 111 livery companies, some very new, so the Order of Precedence is sometimes supplemented. The Merchant Taylors and the Skinners have always disputed their precedence, so once a year (at Easter) they exchange sixth and seventh place. This is one of the theories for the origin of the phrase \"at sixes and sevens\", as the master of the Merchant Taylors has said a number of times, although the first use of the phrase may have been before the Taylors and the Skinners decided to alternate their position.\"At Sixes and Sevens\" Both companies had been founded before the birth of Chaucer, who was one of the first people to use the phrase, so it may have dated from before him. #The Worshipful Company of Mercers (General merchants) #The Worshipful Company of Grocers #The Worshipful Company of Drapers (Wool and cloth merchants) #The Worshipful Company of Fishmongers #The Worshipful Company of Goldsmiths #The Worshipful Company of Merchant Taylors (Tailors) (alternates with the Skinners) #The Worshipful Company of Skinners (Fur traders) (alternates with the Merchant Taylors) #The Worshipful Company of Haberdashers #The Worshipful Company of Salters #The Worshipful Company of Ironmongers #The Worshipful Company of Vintners (Wine merchants) #The Worshipful Company of Clothworkers #The Worshipful Company of Dyers #The Worshipful Company of Brewers #The Worshipful Company of Leathersellers #The Worshipful Company of Pewterers #The Worshipful Company of Barbers (Barbers, surgeons, and dentists) #The Worshipful Company of Cutlers #The Worshipful Company of Bakers #The Worshipful Company of Wax Chandlers #The Worshipful Company of Tallow Chandlers #The Worshipful Company of Armourers and Brasiers (Armour makers and brass workers) #The Worshipful Company of Girdlers (Sword-belt and dress-belt makers) #The Worshipful Company of Butchers #The Worshipful Company of Saddlers #The Worshipful Company of Carpenters #The Worshipful Company of Cordwainers (Fine leather workers) #The Worshipful Company of Painter-Stainers #The Worshipful Company of Curriers (Tanned leather dressers) #The Worshipful Company of Masons #The Worshipful Company of Plumbers #The Worshipful Company of Innholders #The Worshipful Company of Founders (Metalworkers) #The Worshipful Company of Poulters #The Worshipful Company of Cooks #The Worshipful Company of Coopers (Barrel makers) #The Worshipful Company of Tylers and Bricklayers #The Worshipful Company of Bowyers (Longbow makers) #The Worshipful Company of Fletchers (Arrow makers) #The Worshipful Company of Blacksmiths #The Worshipful Company of Joiners and Ceilers (Wood craftsmen) #The Worshipful Company of Weavers #The Worshipful Company of Woolmen #The Worshipful Company of Scriveners (Court document writers and notaries public) #The Worshipful Company of Fruiterers #The Worshipful Company of Plaisterers (Plasterers) #The Worshipful Company of Stationers and Newspaper Makers #The Worshipful Company of Broderers (Embroiders) #The Worshipful Company of Upholders (Upholsterers) #The Worshipful Company of Musicians #The Worshipful Company of Turners (Lathe operators) #The Worshipful Company of Basketmakers #The Worshipful Company of Glaziers and Painters of Glass #The Worshipful Company of Horners #The Worshipful Company of Farriers (Horseshoe makers and veterinary surgeons for horses) #The Worshipful Company of Paviors (Road and highway pavers) #The Worshipful Company of Loriners (Harness makers) #The Worshipful Society of Apothecaries (Medical practitioners and pharmacists) #The Worshipful Company of Shipwrights #The Worshipful Company of Spectacle Makers #The Worshipful Company of Clockmakers #The Worshipful Company of Glovers #The Worshipful Company of Feltmakers (Hat makers) #The Worshipful Company of Framework Knitters #The Worshipful Company of Needlemakers #The Worshipful Company of Gardeners #The Worshipful Company of Tin Plate Workers #The Worshipful Company of Wheelwrights #The Worshipful Company of Distillers #The Worshipful Company of Pattenmakers (Wooden shoe makers) #The Worshipful Company of Glass Sellers #The Worshipful Company of Coachmakers and Coach Harness Makers #The Worshipful Company of Gunmakers #The Worshipful Company of Gold and Silver Wyre Drawers #The Worshipful Company of Makers of Playing Cards #The Worshipful Company of Fanmakers #The Worshipful Company of Carmen #The Honourable Company of Master Mariners (first of the 20th century companies) #The City of London Solicitors' Company #The Worshipful Company of Farmers #The Honourable Company of Air Pilots #The Worshipful Company of Tobacco Pipe Makers and Tobacco Blenders #The Worshipful Company of Furniture Makers #The Worshipful Company of Scientific Instrument Makers #The Worshipful Company of Chartered Surveyors #The Worshipful Company of Chartered Accountants in England and Wales #The Worshipful Company of Chartered Secretaries and Administrators #The Worshipful Company of Builders Merchants #The Worshipful Company of Launderers #The Worshipful Company of Marketors #The Worshipful Company of Actuaries #The Worshipful Company of Insurers #The Worshipful Company of Arbitrators #The Worshipful Company of Engineers #The Worshipful Company of Fuellers #The Worshipful Company of Lightmongers #The Worshipful Company of Environmental Cleaners #The Worshipful Company of Chartered Architects #The Worshipful Company of Constructors #The Worshipful Company of Information Technologists #The Worshipful Company of World Traders #The Worshipful Company of Water Conservators #The Worshipful Company of Firefighters #The Worshipful Company of Hackney Carriage Drivers (Taxi drivers) #The Worshipful Company of Management Consultants #The Worshipful Company of International Bankers #The Worshipful Company of Tax Advisers #The Worshipful Company of Security Professionals #The Worshipful Company of Educators #The Worshipful Company of Arts Scholars #The Worshipful Company of Nurses Two old companies do not intend applying for a grant of the right to wear the special costume or uniform known as a livery. #The Worshipful Company of Parish Clerks #The Company of Watermen and Lightermen Two groups intend applying for livery. Both have already been recognised as a \"Company without Livery\" . #The Company of Communicators #The Company of Entrepreneurs ==References== Category:Organisations based in London Category:Trade associations",
 "title": "London Livery Company"
}