{
 "id": "281832",
 "text": "Sharon Vonne Stone (born March 10, 1958) is an American actress and movie producer. She received a Golden Globe Award for her part in the 1995 movie Casino. Her role in the movie Basic Instinct was also notable. Stone won the title of Miss Crawford County in Meadville. She was a candidate for Miss Pennsylvania. One of the pageant judges said she should quit school and move to New York City to become a fashion model.Stated on Inside the Actors Studio, 1999 In 1977, Stone left Meadville, moving in with an aunt in New Jersey. Within four days of her arrival in New Jersey, she was signed by Ford Modeling Agency in New York. While living in Europe, she decided to quit modeling and become an actress. Stone was cast for a brief role in Allen's Stardust Memories (1980). She had many roles in movies in the 1980's. Being in Total Recall (1990) with Arnold Schwarzenegger helped her career. To promote the movie, she posed nude for Playboy. The movie that made her a star Basic Instinct (1992). She played a person thought to be a serial killer. In the movie's most notorious scene, her character is being questioned by the police. She crosses and uncrosses her legs, exposing her genitalia, which are not covered by underwear. After Basic Instinct, she was listed by People magazine as one of the 50 most beautiful people in the world. In November 1995, Stone received a star on the Hollywood Walk of Fame, located at 6925 Hollywood Blvd. In 2003, she appeared in three episodes from the eighth season of The Practice. For her performances, she received an Emmy AwardSharon Stone Emmy Award Winner for Outstanding Guest Actress in a Drama Series. Stone tried a return to the mainstream with roles in the movies Cold Creek Manor (2003) with Dennis Quaid and Catwoman (2004) with Halle Berry. Both movies were not well liked by either the public or critics. == Personal life == Stone married Michael Greenburg in 1984. They separated in 1987 and the divorce was finalized in 1990. In 1993, Stone met William J. MacDonald (aka Bill MacDonald) on the set of the movie Sliver. MacDonald left his wife Naomi Baca for Stone and became engaged to her. They separated one year later in 1994. While working on the movie The Quick and the Dead in 1995, Stone met Bob Wagner and they became engaged. On February 14, 1998, Stone married Phil Bronstein, executive editor of the San Francisco Examiner. They adopted a son, Roan Joseph Bronstein (born on May 22, 2000) in late May or early June of 2000. They divorced in 2004. After her divorce she adopted another two boys, Laird Vonne Stone (born on May 7, 2005) and Quinn Kelly Stone (born in June 2006). Stone is a convert to Tibetan Buddhism. She is an ordained minister with the Universal Life Church. ==Filmography== Year Title Role Notes 1980 Stardust Memories Pretty Girl on train 1981 Les Uns et les autres Girl with Glenn Senior Uncredited Deadly Blessing Lana Marcus 1982 Not Just Another Affair Lynette television film Silver Spoons Debbie (TV series) 1983 Bay City Blues Cathy St. Marie (TV series) Remington Steele Jillian Montague (TV series) 1984 The New Mike Hammer Julie Eland (TV series) Magnum, P.I. Diane Dupree and Diedra Dupree (TV series) Calendar Girl Murders Cassie Bascomb television film The Vegas Strip War Sarah Shipman television film Irreconcilable Differences Blake Chandler 1985 T. J. Hooker Dani Starr (TV series) King Solomon's Mines Jesse Huston 1986 Mr. and Mrs. Ryan Ashley Hamilton Ryan Television pilot Allan Quatermain and the Lost City of Gold Jesse Huston 1987 Police Academy 4: Citizens on Patrol Claire Mattson Cold Steel Kathy Connors 1988 Above the Law Sara Toscani Action Jackson Patrice Dellaplane Badlands 2005 Alex Neil television pilot War and Remembrance Janice Henry television miniseries Tears in the Rain Casey Cantrell television film 1989 Beyond the Stars Laurie McCall Blood and Sand Doña Sol 1990 Total Recall Lori Quaid 1991 He Said, She Said Linda Metzger Scissors Angie Anderson Year of the Gun Alison King Diary of a Hitman Kiki Cameo Where Sleeping Dogs Lie Serena Black 1992 Basic Instinct Catherine Tramell MTV Movie Award for Best Female Performance MTV Movie Award for Most Desirable Female Nominated – Chicago Film Critics Association Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Drama Nominated – Saturn Award for Best Actress 1993 Sliver Carly Norris Nominated – MTV Movie Award for Most Desirable Female Last Action Hero Catherine Tramell One-second walk on The Larry Sanders Show Herself (TV series) Harlow: The Blonde Bombshell Host documentary about Jean Harlow 1994 Intersection Sally Eastman Razzie Award for Worst Actress The Specialist May Muro (aka Adrian Hastings) Razzie Award for Worst Actress Nominated – MTV Movie Award for Most Desirable Female 1995 The Quick and the Dead Ellen 'The Lady' Nominated – Saturn Award for Best Actress Roseanne Trailer Park Resident (TV series) Casino Ginger McKenna Golden Globe Award for Best Actress – Motion Picture Drama Nominated – Academy Award for Best Actress Nominated – Chicago Film Critics Association Award for Best Actress Nominated – MTV Movie Award for Best Female Performance 1996 Diabolique Nicole Horner Last Dance Cindy Liggett 1998 Sphere Dr. Elizabeth 'Beth' Halperin Antz Princess Bala voice The Mighty Gwen Dillon Nominated – Golden Globe Award for Best Supporting Actress – Motion Picture 1999 Gloria Gloria The Muse Sarah Little Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Simpatico Rosie Carter Happily Ever After: Fairy Tales for Every Child Henny Penny voice 2000 Picking Up the Pieces Candy Cowley If These Walls Could Talk 2 Fran made-for-cable film Women in Film Lucy Award Beautiful Joe Alice 'Hush' Mason 2002 Harold and the Purple Crayon Narrator (TV series) 2003 Cold Creek Manor Leah Tilson The Practice Sheila Carlisle Primetime Emmy Award for Outstanding Guest Actress – Drama Series (TV series) 2004 A Different Loyalty Sally Cauffield Catwoman Laurel Hedare 2005 Higglytown Heroes Nicky – Blind Art Teacher voice Kurtlar Vadisi (Eng. Valley of the Wolves) Lisa Turkish TV serial Will & Grace Dr. Georgia Keller (TV series) Broken Flowers Laura Daniels Miller 2006 Alpha Dog Olivia Mazursky Basic Instinct 2 Catherine Tramell Razzie Award for Worst Actress Huff Dauri Rathburn (TV series) Bobby Miriam Ebbers Hollywood Film Festival for Cast of the Year Nominated – Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Democrazy Patricia Hill short 2007 When a Man Falls in the Forest Karen Fields If I Had Known I Was a Genius Gloria Fremont 2008 The Year of Getting to Know Us Jane Rocket Five Dollars a Day Dolores Jones 2009 Streets of Blood Nina Ferraro 2010 Law & Order: Special Victims Unit Jo Marlowe Four episodes(TV series) 2011 The Burma Conspiracy Diane Francken 2012 Gods Behaving Badly Aphrodite post-production The Mule Sofie post-production Lovelace Dorothy Boreman filming Attachment TBA Starts shooting in April 2012\"Sharon Stone to play cheating wife in sex thriller\" February 04, 2012, Hindustan Times ==References== ==Other websites== * Category:Actors from Pennsylvania Category:American Buddhists Category:American movie actors Category:American movie producers Category:American television actors Category:1958 births Category:Living people Category:Emmy Award winning actors",
 "title": "Sharon Stone"
}