{
 "id": "282000",
 "text": "Tyler Seguin (born January 31, 1992 in Brampton, Ontario) is a Canadian professional ice hockey center for the Dallas Stars of the National Hockey League (NHL). He was selected by the Boston Bruins with the 2nd overall pick in the 2010 NHL Entry Draft. He played 2 seasons in the OHL with the Plymouth Whalers. Seguin has also played in the NHL for the Boston Bruins for 3 seasons. During his time with the Bruins, he won the Stanley Cup on June 15, 2011 when they defeated the Vancouver Canucks in game 7 by a score of 4-0. On July 4, 2013, he was traded by the Bruins along with Rich Peverley, and Ryan Button to the Dallas Stars for Loui Eriksson, along with Reilly Smith, Matt Fraser, and Joe Morrow. He won a gold medal in the 2009 Ivan Hlinka Memorial Tournament in Slovakia and a gold medal in the 2009 World U-17 Hockey Challenge in British Columbia. Regular season Playoffs Season Team League GP G A Pts PIM GP G A Pts PIM 2008–09 Plymouth Whalers OHL 61 21 46 67 28 11 5 11 16 8 2009–10 Plymouth Whalers OHL 63 48 58 106 54 9 5 5 10 8 2010–11 Boston Bruins NHL 74 11 11 22 18 13 3 4 7 2 2011–12 Boston Bruins NHL 81 29 38 67 30 7 2 1 3 0 2012–13 EHC Biel NLA 29 25 15 40 24 — — — — — 2012–13 Boston Bruins NHL 48 16 16 32 16 22 1 7 8 4 2013–14 Dallas Stars NHL 80 37 47 84 18 6 1 2 3 0 2014–15 Dallas Stars NHL 71 37 40 77 20 — — — — — 2015–16 Dallas Stars NHL 72 33 40 73 16 1 0 0 0 0 2016–17 Dallas Stars NHL 82 26 46 72 22 — — — — — 2017–18 Dallas Stars NHL 82 40 38 78 43 — — — — — 2018–19 Dallas Stars NHL 82 33 47 80 18 13 4 7 11 2 2019–20 Dallas Stars NHL 82 40 38 78 43 26 2 11 13 12 NHL totals 741 279 356 635 225 88 13 32 45 20 == Awards == *He won the Spengler Cup in 2012. *He won the Boston Bruins 7th Player Award in 2012. *He played in the 2012 NHL All-Star Game *Stanley Cup (2011) - with the Boston Bruins *He won the Eddie Powers Memorial Trophy for highest scorer in the Ontario Hockey League, alongside Taylor Hall of the Windsor Spitfires (2009–10) *He won the Red Tilson Trophy for the most outstanding player in the Ontario Hockey League (2009-10) *He won the CHL Top Draft Prospect Award as the top eligible prospect for the NHL Entry Draft from the Canadian Hockey League. *He won the gold medal in the 2009 Ivan Hlinka Memorial Tournament in Slovakia *He won the gold medal in the 2009 World U-17 Hockey Challenge in British Columbia. ==References== == Other websites == * * Category:Boston Bruins players Category:Canadian ice hockey centres Category:Dallas Stars players Category:Ice hockey people from Ontario Category:Living people Category:1992 births Category:Ontario Hockey League players Category:People from Brampton, Ontario",
 "title": "Tyler Seguin"
}