{
 "id": "282260",
 "text": "This is a list of foods that were named after people. ==A== Dish Named in honour of Main ingredients Notes Poularde Adelina Patti Adelina Patti Chicken Pâté de filets d'oie Adolphe Hardy Adolphe-Marie Hardy Goose liver Created by Charles Ranhofer Woodcock salmis Agnès Sorel Agnès Sorel Woodcock Big Hearted Al candy bar Al Smith Candy bar Fillet of Beef Prince Albert Albert, Prince Consort Beef Poularde Albufera Louis Gabriel Suchet chicken Albufera Sauce Louis Gabriel Suchet chicken Alexandertorte Alexander I of Russia Gâteau Alexandra Alexandra of Denmark chocolate cake Soup, sole, chicken, quail, and various meat dishes are also named after her. Consommé Alexandra Alexandra of Denmark Chicken in a consommé Soup, sole, chicken, quail, and various meat dishes are also named after her. Lobster Duke Alexis Grand Duke Alexei Alexandrovich of Russia Lobster Fettuccine Alfredo Alfredo di Lelio Fettuccine, Parmesan, Butter Consommé Princess Alice Princess Alice, Countess of Athlone Consommé with artichoke hearts and lettuce Created by Escoffier Sole Princess Alice Princess Alice, Countess of Athlone Sole Created by Escoffier Amundsen's Dessert Roald Amundsen Created by his friends not long before he died in an Arctic plane crash Omelette André Theuriet André Theuriet omelette, truffles & asparagus Angela Burdett plum Angela Burdett-Coutts Plum variety Pommes Anna Anna Deslions sliced potatoes casseroled in butter Created by Adolphe Dugléré at his Café Anglais. \"Potatoes Annette\" is a version of Potatoes Anna, with the potatoes julienned instead of in rounds Omelette Arnold Bennett Arnold Bennett Omelette, haddock Oreiller de la Belle Aurore Claudine-Aurore Récamier game birds, veal, pork, truffles, aspic, and much else The mother of Jean Anthelme Brillat-Savarin also has a lobster dish named after her but this elaborate game pie was one of her son's favorite dishes. Château Ausone wine Ausonius Bordeaux wine ==B== Dish Named in honour of Main ingredients Notes Baco Noir Maurice Baco grape Hybrid grape, named after its breeder Baldwin apple Loammi Baldwin Apple variety Found by Baldwin, a commander of militia at the Battle of Lexington, while working as a surveyor and engineer on the Middlesex Canal in Massachusetts between 1784 and 1793 Chicken Cardinal la Balue Cardinal Jean la Balue (1421–1491) minister to Louis XI Chicken, crayfish, and mashed potatoes Bartlett pear Enoch Bartlett Pear variety Accidentally renaming of the English Williams pear by Massachusetts nurseryman Bartlett. Williams was a 17th-century English horticulturist. Battenberg cake The Princes of Battenberg family colourful cake Béarnaise sauce Henry IV of France But often thought to indicate the region of Béarn Béchamel sauce Louis de Béchamel Scalded milk and roux. Bellini (cocktail) Giovanni Bellini Sparkling wine (e.g. Prosecco) and peach purée Ham mousseline à la Belmont August Belmont (1816–1890) Ham Eggs Benedict Lemuel Benedict Eggs, Bacon, Hollandaise sauce, English Muffin Oscar Tschirky at the Waldorf- Astoria or Eggs Benedict Commodore E.C. Benedict or Mrs LeGrand Benedict Eggs, Bacon, Hollandaise sauce, English Muffin Eggs Benedict XVI Pope Benedict XVI Rye bread and sausage or sauerbraten replace the English muffins and bacon Eggs Berlioz Hector Berlioz , soft-boiled eggs, croustades, duchesse potatoes, and truffles and mushrooms in a Madeira sauce. Beyti kebap Beyti Güler roasted lamb fillets wrapped in strips of lamb cutlet fat . Bibb lettuce John B. Bibb Lettuce variety .Named after a mid-19th- century amateur horticulturist of Frankfort, Kentucky Oysters Bienville Jean- Baptiste Le Moyne de Bienville (1680–1767) baked oysters in a shrimp sauce A New Orleans dish was named for French governor of Louisiana and founder of New Orleans (1718). Bing cherry Ah Bing Cherry variety Developed around 1875 bySeth Luelling (or Lewelling), an Oregon horticulturist. Named after his Manchurian foreman Bing Bismarck herring Otto von Bismarck (1815–1898) pickled herring The first Chancellor of the German Empire. This is just a few of the many foods named after him. The Black Velvet Cocktail is also sometime called a Bismarck. Bismarcks Otto von Bismarck (1815–1898) Berliner Pfannkuchen, so called in Canada and the US The first Chancellor of the German Empire. This is just a few of the many foods named after him. The Black Velvet Cocktail is also sometime called a Bismarck. Schlosskäse Bismarck Otto von Bismarck (1815–1898) Type of cheese The first Chancellor of the German Empire. This is just a few of the many foods named after him. The Black Velvet Cocktail is also sometime called a Bismarck. Oeufs moulés Bizet Georges Bizet Eggs, tongue, artichoke hearts Consommé Bizet Georges Bizet Sole Bolivar Simón Bolívar South American revolutionary Sole Bonaparte's Ribs Napoleon Bonaparte an early-19th-century English sweet Boysenberry Rudolph Boysen loganberry/raspberry/blackberry cross Brillat-Savarin cheese Jean Anthelme Brillat-Savarin Type of Cheese Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Consommé Brillat-Savarin Jean Anthelme Brillat- Savarin Chicken consommé, savoury pancakes Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Croutes Brillat-Savarin Jean Anthelme Brillat-Savarin Calves' or lambs' sweetbreads Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Oeufs en cocotte Brillat-Savarin Jean Anthelme Brillat-Savarin Eggs, noodles, asparagus Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Flan Brillat- Savarin Jean Anthelme Brillat-Savarin Scrambled Eggs, truffles Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Savarin cake Jean Anthelme Brillat-Savarin Flour, sugar, eggs, almonds Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Timbale Brillat- Savarin Jean Anthelme Brillat-Savarin Brioche, macaroons, pears, crèmè pâtissière Brillat-Savarin was author of The Physiology of Taste, in which he spoke about cuisine as a science. These are only a few of the dishes named after him Hot Brown J. Graham Brown Hot Sandwich Parson Brown orange Rev. Nathan L. Brown Orange variety Brown was a 19th-century Florida minister and orange grower who, developed what was to become the leading commercial orange of the time in the U.S. Burbank plum Luther Burbank (1849–1926) Plum variety Burbank was an American horticulturist, who bred many new varieties of plants, including this and the Russet Burbank potato. == C == Dish Named in honour of Main ingredients Notes Bloody Caesar cocktail Julius Caesar Created by Canadian bartender Walter Chell. Caesar's mushroom probably named for Julius Caesar Mushroom of southern France is also called the King of Mushrooms Caesar potato probably named for Julius Caesar Caesar salad Hotel Caesar in Tijuana Caesar Cardini (1896–1956) or one of his associates created this salad at the restaurant he owned Carpaccio named for painter Vittore Carpaccio Thinly sliced raw beef. Carpaccio was known for using a red colour which looked like that of raw beef Caruso sauce Enrico Caruso Galantine of pheasants Casimir Perier Jean Casimir Perier pheasant Charles Ranhofer named these dishes after this French president. Palmettes Casimir Perier Jean Casimir Perier Charles Ranhofer named these dishes after this French president. Apple Charlotte Queen Charlotte fruit puree a baked dessert Charlotte Russe Czar Alexander I Bavarian cream, sponge cake fingers An uncooked dish, renamed in honour of Marie-Antoine Carême's employer (\"Russe\" being the French equivalent of the adjective, \"Russian\") in the Second Empire. Carême called his creation Charlotte à la parisienne. Charlotte Corday Charlotte Corday (1768–1793), ice cream an ice cream dessert by Charles Ranhofer of Delmonico's Chateaubriand Vicomte François René de Chateaubriand (1768–1848) Steak a cut and a recipe named for Chateaubriand, by his chef Montinireil. Probably around 1822 while he was ambassador to England. There is also a kidney dish named for him. Chiboust cream French pastry chef Chiboust Cream filling Invented by the French pastry chef Chiboust in Paris around 1846, for his Gâteau Saint-Honoré. The filling is also called Saint-Honoré cream. Choron sauce Alexandre Étienne Choron Christian IX cheese King Christian IX of Denmark (1818–1906) Caraway- seeded semi-firm Danish cheese. Chaudfroid of chicken Clara Morris Clara Morris (1848–1925) Chicken Charles Ranhofer named this dish for the popular 19th-century American actress. When the taste in drama changed in the 1890s and she turned to writing. Clementines Père Clément Rodier Type of citrus fruit Cleopatra Mandarin orange presumably, Cleopatra VII (69–30 BC), fruits Cleopatra apple presumably, Cleopatra VII (69–30 BC), fruits Peach pudding à la Cleveland Grover Cleveland Peaches Charles Ranhofer seemed to feel presidents deserved desserts named after them, like Escoffier did ladies, even if Cleveland was reputed to not much like French food. Veuve Clicquot Barbe- Nicole Ponsardin Champagne brand Ponsardin was the widow () of François Clicquot. Cobb Salad Robert H. Cobb Cobb owned the Hollywood Brown Derby restaurant, and is said to have invented this as a late-night snack for himself in 1936–1937. Scrambled eggs à la Columbus Christopher Columbus eggs ham, blood pudding and beef brains Cox's Orange Pippin Richard Cox (1777–1845) Apple variety Named after its developer in Buckinghamshire Cumberland Sauce Ernst August of Hanover, 3rd Duke of Cumberland Sauce for game Lady Curzon Soup Lady Curzon, née Mary Victoria Leiter (1870–1906) turtle soup with sherry Allegedly, she directed the inclusion of sherry when a teetotalling guest prevented the usual serving of alcohol at a dinner, around 1905. Lady Curzon was the daughter of Chicago businessman Levi Z. Leiter, who co-founded the original department store now called Marshall Field. ==D== Dish Named in honour of Main ingredients Notes Dartois François-Victor-Armand Dartois (1780–1867) Several versions of this pastry, some sweet, some savoury Dartois was once very well-known author of French vaudeville plays Shrimp DeJonghe The DeJonghe Brothers shrimp and garlic casserole created at DeJonghe's Hotel, 1n early-20th-century Chicago, owned by brothers from Belgium. Sirloin of beef à la de Lesseps Ferdinand de Lesseps Beef Ranhofer named this beef dish after de Lessep, following a dinner in his honour. A banana dessert from the same dinner was afterward termed \"à la Panama.\" ,probably well before de Lesseps' 1889 bankruptcy scandal. Delmonico steak Delmonico's Restaurant Steak Two of the many dishes named after the restaurant in the United States, or the brothers who owned it. Lobster à la Delmonico Delmonico's Restaurant Lobster Two of the many dishes named after the restaurant in the United States, or the brothers who owned it. Chicken Demidoff Prince Anatole Demidoff (1813–1870) Chicken, elaboratedly stuffed, smothered, tied up and garnished There are two chicken dishes named after him, and the Demidoff name is also applied to dishes of rissoles and red snapper. Veal pie à la Dickens Charles Dickens (1812–1870) Veal Two dishes from Delmonico’s menu, probably from around the time Dickens was making his second visit to New York in 1867. Beet fritters à la Dickens Charles Dickens (1812–1870) Beetroot Two dishes from Delmonico’s menu, probably from around the time Dickens was making his second visit to New York in 1867. Doboschtorte or Dobostorta Josef Dobos multi-layered chocolate torte Created by Josef Dobos, a well-known Hungarian pastry chef, in Budapest or Vienna. Dongpo's pork Su Dongpo (1037–1101), poet squares of pork, half lean meat and half fat, pan-fried then braised. Potage à la Du Barry Madame du Barry Cauliflower, potato, consommé, cream Several dishes cauliflower based dishes arenamed for her. It was said to be a reference to her elaborate powdered wigs. Salade Du Barry Madame du Barry Cauliflower, radishes Several dishes cauliflower based dishes arenamed for her. It was said to be a reference to her elaborate powdered wigs. Sole Dubois Urbain Dubois 19th-century French chef Sole (see Veal Prince Orloff) Sole Dugléré Adolphe Dugléré (1805–1884) Sole Dugléré, started as a student of Antonin Carême, when he became head chef at the famed Café Anglais in Paris in 1866, he began creating and naming many well-known dishes. Several fish dishes bear his own name. Salad à la Dumas Alexandre Dumas, père Various salads Apparently a favourite of Charles Ranhofer Mushrooms à la Dumas Alexandre Dumas, père Apparently a favourite of Charles Ranhofer Stewed Woodcock à la Dumas Alexandre Dumas, père Apparently a favourite of Charles Ranhofer Timbale à la Dumas Alexandre Dumas, père Apparently a favourite of Charles Ranhofer Duxelles Nicolas Chalon du Blé, marquis d'Uxelles a mushroom- based sauce or garnish D’Uxelles employed French chef François Pierre La Varenne (1615–1678), who created the dish. A variety of dishes use this name. ==References== * named after people",
 "title": "List of foods named after people"
}