{
 "id": "282393",
 "text": "Bihari Muslims are people originating and tracing descent from the Indian State of Bihar, who practice Islam as their religion. Bihari Muslims mainly practice Sunni Islam of the Hanafi creed, though a small Shia minority exists. ==Origin== Islam in Bihar is said to have been established in the 10-15th century with the arrivals of Sufi missionaries as well as Sunni rulers. About 3 millions of Bihari Muslims migrated to the newly created State of Pakistan and the former East Pakistan (now Bangladesh) because of Muslim League politics. Those who settled in Pakistan were deemed a sub-caste of Muhajirs. Those who lived in Bangladesh were deemed Stranded Pakistanis. ==History== This history of Bihar lasted till around the middle of the 7th or 8th century A.D. - the Gupta Period - when, with the conquest of almost all of northern India by invaders from the middle-east, the Gupta dynasty also fell a victim. In medieval times Bihar lost its prestige as the political and cultural center of India. The Mughal period was a period of unremarkable provincial administration from Delhi. The only remarkable person of these times in Bihar was Sher Shah, or Sher Khan Sur, an Afghan. Based at Sasaram which is now a town in the district of the same name in central-western Bihar, this jagirdar of the Mughal King Babur was successful in defeating Humayun, the son of Babur, twice - once at Chausa and then, again, at Kannauj (in the present state of Uttar Pradesh or U.P.) Through his conquest Sher Shah became the ruler of a territory that, again, extended all the way to the Punjab. He was noted as a ferocious warrior but also a noble administrator - in the tradition of Ashok and the Gupta kings. Several acts of land reform are attributed to him. The remains of a grand mausoleum that he built for himself can be seen in today's Sasaram (Sher Shah's maqbara.) ==Society== The majority of educated Bihari Muslims formally speak Urdu, while in the vernacular speak in the Bihari language. The Muslims of Bihar have wealth rates comparable to rest of the Republic of India. Category:Bihar Category:Partition of India Category:Indian Muslims Category:Sunni Islam Category:Hanafis",
 "title": "Bihari Muslims"
}