{
 "id": "282537",
 "text": "Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names, The Notorious B.I.G., Biggie Smalls, or simply Biggie, was an American rapper, songwriter, and record producer. He is considered by many music enthusiasts to be one of the greatest rappers of all time.The 10 Greatest Rappers of All Time (November 12, 2015). Billboard. Retrieved November 15, 2015. Wallace became known for his distinctive laid-back lyrical delivery, offsetting the lyrics' often grim content. His music was often semi- autobiographical, telling of hardship and criminality, but also of debauchery and celebration. Both his death and the death of his friend/rival Tupac Shakur, who died in September 1996, are still unsolved. The release of Wallace's first album Ready to Die in 1994 made him an East Coast hip hop icon. While recording his second album, Wallace was heavily involved in the East Coast/West Coast hip hop feud, through which record companies from both sides of the United States fostered a feud between New York-based and California-based artists. He was killed by drive-by shooting in Los Angeles, California on March 9, 1997 at age 24. ==Early life== Christopher George Latore Wallace was born and raised in Brooklyn, New York. He was the only child of Jamaican parents Voletta Wallace and Selwyn George Latore. He excelled academically and received multiple awards in school for English. He began selling drugs at the early age of 12. As a teenager, he began rhyming to entertain people on street corners and in neighborhood groups. He nicknamed himself \"Biggie Smalls\" after a gangster character in the 1975 crime comedy movie Let's Do It Again. ==Musical career== In 1991, he released a demo tape called Microphone Murderer. Sean Combs, a rapper and producer, heard Biggie's early songs. After Combs was fired from Uptown Records in 1993, he decided to sign Biggie to his record label, Bad Boy Records. In April 1993, his solo track, \"Party and Bullshit\", appeared on the soundtrack to the 1993 comedy movie Who's the Man?. His first album Ready to Die was released on September 13, 1994. It debuted at number 13 on the Billboard 200 chart and was certified platinum. The album featured 3 singles \"Juicy\", \"Big Poppa\", and \"One More Chance\". That same year, he was named \"Best New Artist,\" \"Best Live Performer\" and \"Lyricist of the Year by the Source. He won a Billboard Music Award for Rap Artist of the Year in 1995. He rapped on Michael Jackson's 1995 single \"This Time Around\". A few weeks after Wallace’s death, his second album, Life After Death, was released on March 25, 1997. It quickly rose to number one on the US album charts. The album featured 3 singles: \"Hypnotize\", \"Mo Money Mo Problems\", and \"Sky’s the Limit.\" Wallace became the first artist to have two number-one hits after death (“Hypnotize” and “Mo Money Mo Problems”). Life After Death was nominated for 3 Grammy Awards in 1998. His posthumous albums, Born Again (1999) and Duets (2005), became number one hits. ==Personal life== He was married to singer Faith Evans from 1994 until his assassination. He has two children T'yanna (born 1993 with Jan Jackson) and Christopher George \"C. J.\" Latore Wallace Jr. (born 1996 with Faith Evans). ==Killing== On March 7, 1997, Wallace attended the Soul Train Music Awards where he presented an award to singer Toni Braxton. On March 8, he attended the after party for the Soul Train Music Awards at Petersen Automotive Museum. It was hosted by Qwest Records and Vibe magazine. On March 9, Wallace left the party to return to his hotel after the Los Angeles Fire Department closed the party early because of overcrowding. He was driving a GMC Suburban. An unidentified black man in a 1994-96 Chevy Impala SS stopped on side of Wallace's SUV and fired four shots at the Suburban that hit Wallace's chest, killing him instantly. He was 24 years old. His assassination is still unsolved. ==Discography== ===Studio albums=== The Notorious B.I.G. released one studio album in his lifetime and three after his death: Year Album 1994 Ready to Die 1997 Life After Death* 1999 Born Again* 2005 Duets: The Final Chapter* ===Singles=== Year Album 1994 Juicy 1995 Big Poppa 1995 One More Chance (Stay with Me Remix) 1997 Hypnotize 1997 Mo Money Mo Problems* (feat. Puff Daddy & Mase) 1997 Sky's The Limit (song)* (feat. 112) 1999 Notorious B.I.G.* (feat. Lil' Kim & Puff Daddy) 2000 Dead Wrong* (feat. Eminem) 2005 Nasty Girl* 2006 Spit Your Game* (feat. Twista, Krayzie Bone, Swizz Beatz, 8 Ball & MJG) *(*) albums and songs were released posthumously (after death). == Media == === Filmography === * The Show (1995) as himself * Rhyme & Reason (1997 documentary) as himself * Biggie & Tupac (2002 documentary) archive footage * Tupac Resurrection (2004 documentary) archive footage * Notorious B.I.G. Bigger Than Life (2007 documentary) archive footage * Notorious (2009) archive footage * All Eyez on Me (2017) archive footage * Quincy (2018 documentary) archive footage * Biggie: The Life of Notorious B.I.G. (2017 documentary) archive footage * Biggie: I Got a Story to Tell (2021 documentary) archive footage === Television appearances === * New York Undercover (1995) as himself * Martin (1995) as himself * Who Shot Biggie & Tupac? (2017) archive footage * Unsolved (2018), played by Wavy Jones == Awards and nominations == Award Year of ceremony Nominee/work Category Result The Source Hip-Hop Music Awards2nd Annual Source Awards 1995 The Notorious B.I.G. New Artist of the Year, Solo The Notorious B.I.G. Lyricist of the Year The Notorious B.I.G. Live Performer of the Year Ready To Die Album of the Year Billboard Music Awards 1995 The Notorious B.I.G. Rap Artist of the Year \"One More Chance/Stay with Me (Remix)\" Rap Single of the Year 1997 Life After Death R&B; Album Grammy Awards 1996 \"Big Poppa\" Best Rap Solo Performance 1998 \"Hypnotize\" Best Rap Solo Performance \"Mo Money Mo Problems\" Best Rap Performance by a Duo or Group Life After Death Best Rap Album MTV Video Music Awards 1997 \"Hypnotize\" Best Rap Video 1998 \"Mo Money Mo Problems\" Best Rap Video Soul Train Music Awards 1996 \"One More Chance/Stay With Me (Remix)\" R&B;/Soul or Rap Song of the Year 1998 Life After Death Best R&B;/Soul Album - Male Life After Death R&B;/Soul or Rap Album of the Year \"Mo Money Mo Problems\" Best R&B;/Soul or Rap Music Video Black Reel Awards 2004 \"Runnin' (Dying to Live)\" ) Best Original or Adapted Song ASCAP Rhythm & Soul Music Awards2005 ASCAP Awards2017 ASCAP Awards2020 ASCAP Awards 2005 \"Runnin' (Dying to Live)\" ) Top Soundtrack Song of the Year 2017 The Notorious B.I.G. ASCAP Founders Award 2020 \"Sicko Mode\" Winning Rap and R&B;/Hip-Hop Songs Rock and Roll Hall of Fame 2020 The Notorious B.I.G. Performers ==References== ==Other websites== * Notorious B.I.G at atlanticrecords.com Category:1972 births Category:1997 deaths Category:20th- century American rappers Category:Rappers from New York (state) Category:Gangsta rappers Category:Criminals from New York City Category:American drug dealers Category:Murdered musicians Category:Murders by firearm in California Category:Musicians from Brooklyn Category:People murdered in California Category:Singers from New York City Category:Unsolved murders in the United States",
 "title": "The Notorious B.I.G."
}