{
 "id": "282542",
 "text": "The Central Hockey League (CHL) was a mid-level professional hockey league in the United States. It is owned by Global Entertainment Corporation. It was started in 1992. ==History== The first CHL season was in 1992-1993. It started with six teams, including the Oklahoma City Blazers, the Tulsa Oilers, the Wichita Thunder, the Memphis RiverKings, the Dallas Freeze and the Fort Worth Fire. In 1996-97, the Huntsville Channel Cats, along with the planned 1996–97 Southern Hockey League (SHL) expansion teams Columbus Cottonmouths, Macon Whoopee, and Nashville Nighthawks, joined the Central Hockey League after the SHL ended. The CHL came together with the Western Professional Hockey League (WPHL) in 2001. The CHL commissioner is now Duane Lewis, who succeeded Brad Treliving on an temporary basis after Treliving took a position with the NHL's Phoenix Coyotes following the 2006-2007 season. Treliving co-founded the WPHL in 1996, and after the 2001 merger, served with the CHL for seven years. Lewis was named the permanent commissioner in June 2008. On June 1, 2010 the league announced that it would come together with the International Hockey League. ==Current teams== The CHL is divided into two Conferences. Teams compete every year for the Ray Miron President's Cup. Turner Conference Team Arena City/area Affiliate team(s) Bloomington PrairieThunder U.S. Cellular Coliseum Bloomington, Illinois Colorado Eagles Budweiser Events Center Loveland, Colorado Dayton Gems Hara Arena Trotwood, Ohio Evansville IceMen Swonder Ice Arena Evansville, Indiana Fort Wayne Komets Allen County War Memorial Coliseum Fort Wayne, Indiana Columbus Blue Jackets, Springfield Falcons Missouri Mavericks Independence Events Center Independence, Missouri Quad City Mallards i Wireless Center Moline, Illinois Rapid City Rush Rushmore Plaza Civic Center Rapid City, South Dakota Wichita Thunder Intrust Bank Arena Wichita, Kansas Berry Conference Team Arena City/area Affiliate team(s) Allen Americans Allen Event Center Allen, Texas Dallas Stars, Texas Stars Arizona Sundogs Tim's Toyota Center Prescott Valley, Arizona Phoenix Coyotes Bossier-Shreveport Mudbugs CenturyTel Center Bossier City, Louisiana Laredo Bucks Laredo Energy Arena Laredo, Texas Mississippi RiverKings DeSoto Civic Center Southaven, Mississippi Odessa Jackalopes Ector County Coliseum Odessa, Texas New York Islanders, Bridgeport Sound Tigers Rio Grande Valley Killer Bees State Farm Arena Hidalgo, Texas Texas Brahmas NYTEX Sports Centre North Richland Hills, Texas Tulsa Oilers BOK Center Tulsa, Oklahoma Colorado Avalanche, Lake Erie Monsters ==League champions== *1993 - Tulsa Oilers *1994 - Wichita Thunder *1995 - Wichita Thunder *1996 - Oklahoma City Blazers *1997 - Fort Worth Fire *1998 - Columbus Cottonmouths *1999 - Huntsville Channel Cats *2000 - Indianapolis Ice *2001 - Oklahoma City Blazers *2002 - Memphis RiverKings *2003 - Memphis RiverKings *2004 - Laredo Bucks *2005 - Colorado Eagles *2006 - Laredo Bucks *2007 - Colorado Eagles *2008 - Arizona Sundogs *2009 - Texas Brahmas *2010 - Rapid City Rush ==References== * ==Other websites== *Central Hockey League website Category:Central Hockey League Category:1992 establishments in the United States",
 "title": "Central Hockey League"
}