{
 "id": "282573",
 "text": "Edgar Degas (, ;; born Hilaire-Germain-Edgar De Gas, ; 19 July 183427 September 1917) was a French artist. He is famous for his paintings and sculptures: he was one of those who started Impressionism, although he rejected the term, and preferred to be called a realist.Gordon, Robert & Forge, Andrew 1988. Degas. New York: Harry N. Abrams. p31 A superb draughtsman, he is identified with the subject of the dance, and over half of his works depict dancers. These display his mastery in the depiction of movement, as do his racecourse subjects and female nudes. His portraits are notable for their psychological complexity and the way they show human isolation.Brown, Marilyn 1994. Degas and the business of art: a cotton office in New Orleans. Pennsylvania State University Press. p11 ==His life== He was born in Paris, France. He began to paint early in his life. Because his father wanted it, he went to university to become a lawyer in 1853. Edgar did not like this, and he went to study at the École des Beaux-Arts, an important art- school in Paris in 1855. In 1856 he traveled to Naples in Italy, he stayed there for 3 years. He studied famous painters like Michelangelo and Raphael and learnt by copying their work. In 1859 he came back to Paris. He started his first important painting The Bellelli Family, and also started on a few paintings on historical myths, like Alexander and Bucephalus and The Daughter of Jephthah. In 1861 he visited Normandy and made his first drawings of horses which were an important subject for his paintings. After the start of the Franco-Prussian War in 1870, Degas worked for the National Guard. He did not have time to paint.Guillaud, Jaqueline & Guillaud, Maurice (eds) 1985. Degas: form and space. New York: Rizzoli. p29 After the war he went to stay with his brother Rene in New Orleans, Louisiana. In 1873 he went back to Paris and in 1874 his father died. He then found out his brother had large business debts. Edgar had to sell the house and a collection of art he had inherited. He now had to depend on his paintings for his income. He created a lot of great paintings in next 10 years.p33 With the money he earned, he bought paintings by painters he liked a lot. Examples are Manet, Paul Cézanne, Pissarro, Gauguin, Van Gogh and others. In 1874 Edgar Degas and a group of other painters started to organise their own art exhibition. Their exhibitions were called \"Impressionist Exhibitions\". At the end of the 1880s, he started to take photographs of his friends.p26 Other photographs, of dancers and nudes, were used as an example for some of his later paintings.p34 As the years passed, he became isolated. They think that he made sculptures up until 1910. He probably stopped working in 1912. He never married, and he was nearly blind at the end of his life. He died in Paris in 1917.p41 ==Gallery== Image:Edgar Germain Hilaire Degas 049.jpg|Portrait of the Bellelli Family, 1858-1867, Musée d'Orsay, Paris, France File:Young Spartans National Gallery NG3860.jpg|Young Spartans Exercising, c. 1860, National Gallery, London Image:Edgar Germain Hilaire Degas 013.jpg|The Amateur, 1866, The Metropolitan Museum of Art New York City File:Degas - Das Ehepaar Manet.jpg|Édouard Manet and Mme. Manet, 1868-1869, Kitakyushu Municipal Museum of Art, Japan Image:Horses in a Meadow.jpg|Horses in a Meadow, 1871, National Gallery of Art, Washington, DC Image:Edgar Germain Hilaire Degas 051.jpg|Portrait of Miss Cassatt, Seated, Holding Cards, 1876-1878 Image:Edgar Germain Hilaire Degas 037.jpg|At the Café-Concert: The Song of the Dog, 1875-1877 File:Edgar Germain Hilaire Degas 025.jpg|Fin d'Arabesque, with ballerina Rosita Mauri, 1877, Musée d’Orsay. Image:Edgar Germain Hilaire Degas 019.jpg|The Singer with the Glove, 1878, The Fogg Art Museum, Cambridge, Massachusetts Image:Edgar Germain Hilaire Degas 044.jpg|Miss La La at the Cirque Fernando, 1879, The National Gallery, London Image:Edgar Germain Hilaire Degas 011.jpg|The Millinery Shop, 1885, The Art Institute of Chicago, Chicago, Illinois Image:Edgar Germain Hilaire Degas 004.jpg|Ballet Rehearsal, 1873, The Fogg Art Museum, Cambridge, Massachusetts Image:Edgar Germain Hilaire Degas 069.jpg|Dancer with a Bouquet of Flowers (Star of the Ballet), 1878 Image:Edgar Germain Hilaire Degas 009.jpg|Stage Rehearsal, 1878-1879, The Metropolitan Museum of Art New York City File:Degas - Frau mit Stadtkostüm.jpg|Woman in Street Clothes, Portrait of Ellen Andrée, 1879, pastel on paper Image:Edgar Germain Hilaire Degas 072.jpg|Dancers at The Bar, 1888, The Phillips Collection, Washington, DC Image:Edgar Germain Hilaire Degas 032.jpg|Woman in the Bath, 1886, Hill-Stead Museum, Farmington, Connecticut Image:Edgar Germain Hilaire Degas 031.jpg|The Tub, 1886, Musée d'Orsay, Paris, France File:Edgar Degas (1834-1917) - 'The Bath- Woman Supporting her Back', pastel on paper, c. 1887.jpg|The Bath: woman sponging her back, c. 1887, pastel on paper, Honolulu Academy of Arts File:Edgar Germain Hilaire Degas 042.jpg|Kneeling Woman, 1884, Pushkin Museum, Moscow File:SpanishDance c1884-DegasPC20080120-8849A.jpg|The Spanish Dance, c. 1885 (bronze cast 1921), bronze, 46.3 x 14.3 cm, Ackland Art Museum == Related pages == * List of French painters ==References== Category:1834 births Category:1917 deaths Category:Artists from Paris Category:Burials at Montmartre Cemetery, Paris Category:French painters Category:French Roman Catholics Category:French sculptors",
 "title": "Edgar Degas"
}