{
 "id": "282592",
 "text": "Horizontal gene transfer (HGT) (or Lateral gene transfer) is how an organism gets genetic material from another organism without being the offspring of that organism. By contrast, vertical transfer occurs when an organism gets genetic material from its ancestor, e.g., its parent or a species from which it has evolved. Most thinking in genetics has focused on vertical transfer, but horizontal gene transfer is also important.Yap W.H. et al 1999. Distinct types of rRNA operons exist in the genome of the actinomycete Thermomonspora chromogena and evidence for horizontal gene transfer of an entire rRNA operon. J. Bacteriol. 181 : 5201-9. Amongst single-celled organisms it may be the dominant form of genetic transfer. Artificial horizontal gene transfer may be used as a type of genetic engineering. == Mechanism == There are several mechanisms for horizontal gene transfer: * Transformation, the genetic alteration of a cell resulting from the introduction, uptake and expression of foreign genetic material (DNA or RNA). This process is relatively common in bacteria, but less so in eukaryotes. Transformation is often used in laboratories to insert novel genes into bacteria for experiments or for industrial or medical applications. * Transduction, the process in which bacterial DNA is moved from one bacterium to another by a bacterial virus (a bacteriophage, or 'phage'). * Bacterial conjugation, a process in which a bacterial cell transfers genetic material to another cell by cell-to-cell contact. * A gene transfer agent or 'GTA' is a virus-like element which contains random pieces of the host chromosome. They are found in most members of the alphaproteobacteria order Rhodobacterales.McDaniel L.D. et al. 2010. High frequency of horizontal gene transfer in the oceans. Science 330: 50. doi:10.1126/science.1192243 They are encoded by the host genome. GTAs transfer DNA so frequently that they may have an important role in evolution.Maxmen A. 2010. Virus-like particles speed bacterial evolution. Nature. doi:10.1038/news.2010.507 A 2010 report found that genes for antibiotic resistance could be transferred by engineering GTAs in the laboratory. * Integrons, a bacterial \"kit\" for transferring gene cassettes. ==History== Horizontal gene transfer was first described in Japan in a 1959 publication that demonstrated the transfer of antibiotic resistance between different species of bacteria. In the mid-1980s, Syvanen suggested that lateral gene transfer not only had biological significance, but was involved in shaping evolutionary history from the beginning of life on Earth. \"Increasingly, studies of genes and genomes are indicating that considerable horizontal transfer has occurred between prokaryotes\". The phenomenon appears to have had some significance for unicellular eukaryotes as well. As Bapteste et al. observe, \"additional evidence suggests that gene transfer might also be an important evolutionary mechanism in protist evolution\". There is some evidence that even higher plants and animals have been affected. Richardson and Palmer (2007) state: \"Horizontal gene transfer (HGT) has played a major role in bacterial evolution and is fairly common in certain unicellular eukaryotes. However, the prevalence and importance of HGT in the evolution of multicellular eukaryotes remains unclear\". == References == * Category:Microbiology",
 "title": "Horizontal gene transfer"
}