{
 "id": "282671",
 "text": "Bette Midler (born December 1, 1945) is an American actress, singer and comedian. She starred in movies including Ruthless People, Beaches and Hocus Pocus. Midler has won many awards in the entertainment industry. She was born in Honolulu, Hawaii. ==Career== Midler released her first album, The Divine Miss M, in December 1972. Midler won the 1973 Grammy Award for Best New Artist because of it. In 1979, Midler appeared in her first movie, The Rose, as the main character. In 1988, she played Cecilia Bloom in Beaches. The movie's soundtrack featured a cover version of \"Wind Beneath My Wings\" sung by Midler. It reached No.1. In 2000, she had her own sitcom called Bette. It ended after one season. ==Filmography== Year Title Role Notes 1966 Hawaii Passenger Uncredited 1968 The Detective Girl at Party Uncredited 1969 Goodbye, Columbus Wedding Guest Uncredited, cut scene 1971 Virgin Mary Also known as The Divine Mr. J; blocked distribution of movie 1972 Scarecrow in a Garden of Cucumbers unknown Voice 1979 Mary Rose Foster 1980 Divine Madness! Herself/ Divine Miss M. Concert movie 1982 Jinxed! Bonita Friml 1986 Down and Out in Beverly Hills Barbara Whiteman Ruthless People Barbara Stone 1987 Outrageous Fortune Sandy Brozinsky 1988 Big Business Sadie Shelton/Sadie Ratliff Oliver & Company Georgette Voice Beaches C. C. Bloom 1989 Music Teacher Short film 1990 Stella Stella Claire 1991 Scenes from a Mall Deborah Fifer For the Boys Dixie Leonard Yakety Yak, Take it Back Herself 1992 Trash Talk Herself 1993 Hocus Pocus Winifred 'Winnie' Sanderson 1995 Get Shorty Doris Saphron Uncredited 1996 Brenda Cushman 1997 That Old Feeling Lilly Leonard 1999 Get Bruce Herself Fantasia 2000 Herself / Hostess Segment: \"Piano Concerto No. 2, Allegro, Opus 102\" 2000 Drowning Mona Mona Dearly Isn't She Great Jacqueline Susann What Women Want Dr. J.M. Perkins Uncredited 2002 Divine Secrets of the Ya-Ya Sisterhood Executive producer 2004 Bobbie Markowitz 2007 Then She Found Me Bernice Graves 2008 Leah Miller 2010 Cats & Dogs: The Revenge of Kitty Galore Kitty Galore Voice 2012 Casting By Herself Documentary Parental Guidance Diane Decker 2017 Freak Show Muv 2019 The Addams Family Grandmama Voice TBA The Glorias: A Life on the Road Bella Abzug Post-production == Other websites == * Category:1945 births Category:Living people Category:Actors from Honolulu Category:Comedians from Hawaii Category:American movie actors Category:American television actors Category:American voice actors Category:Singers from Hawaii Category:Warner Bros. Records artists Category:Drama Desk Award winners Category:Golden Globe Award winning actors Category:American Grammy Award winners Category:Emmy Award winners Category:Tony Award winning actors Category:People's Choice Award winners",
 "title": "Bette Midler"
}