{
 "id": "282679",
 "text": "Elimination Chamber is a professional wrestling match held by WWE. It takes place in a large steel cage that surrounds the entire ring. The chamber contains four clear, plexiglass pods. The match was created by Triple H, and introduced by Eric Bischoff at Survivor Series in November 2002. It usually features six competitors with two starting the match. One or two matches have taken place each year (except in 2004 and 2016). A pay-per-view (PPV) and livestreaming event series, also called Elimination Chamber (or No Escape in Germany), replaced No Way Out in 2010. A women's variation was introduced at the 2018 event. == Match rules == After the entrances, the match starts with two wrestlers (or teams of wrestlers) in the ring, while the other four are locked inside each pod. After a certain amount of time (usually five minutes), one of the wrestlers from the pods enters the match. This continues until all four have been released. Wrestlers are eliminated by pinfall or submission, which originally was allowed to happen in the ring or on the chamber's elevated floor, but since 2010 event all pinfalls and submissions must take place within the ring. Disqualifications and count-outs do not apply. The winner of the match is the last remaining wrestler (or team of wrestlers) after all others have been eliminated. == Dates and venues == History # Brand Winner Stipulation Match Date Event Location 1 Raw Shawn Michaels World Heavyweight Championship Triple H (c) vs. Booker T vs. Chris Jericho vs. Kane vs. Shawn Michaels vs. Rob Van Dam Survivor Series (2002) New York City, New York 2 Triple H Triple H (c) vs. Goldberg vs. Chris Jericho vs. Shawn Michaels vs. Kevin Nash vs. Randy Orton SummerSlam (2003) Phoenix, Arizona 3 World Heavyweight Championship (The championship was vacant for this match.) Batista vs. Chris Benoit vs. Edge vs. Chris Jericho vs. Randy Orton vs. Triple H New Year's Revolution (2005) San Juan, Puerto Rico 4 John Cena WWE Championship John Cena (c) vs. Kurt Angle vs. Carlito vs. Chris Masters vs. Shawn Michaels vs. Kane New Year's Revolution (2006) Albany, New York 5 ECW Bobby Lashley ECW World Heavyweight Championship The Big Show (c) vs. Bobby Lashley vs. Hardcore Holly vs. CM Punk vs. Test vs. Rob Van Dam December 3, 2006 December to Dismember (2006) Augusta, Georgia 6 SmackDown/ECW The Undertaker World Heavyweight Championship match at WrestleMania XXIV Batista vs. Big Daddy V vs. Finlay vs. The Great Khali vs. Montel Vontavious Porter vs. The Undertaker No Way Out (2008) Las Vegas, Nevada 7 Raw Triple H WWE Championship match at WrestleMania XXIV Jeff Hardy vs. Chris Jericho vs. John \"Bradshaw\" Layfield vs. Shawn Michaels vs. Triple H vs. Umaga 8 SmackDown WWE Championship Edge (c) vs. The Big Show vs. Jeff Hardy vs. Vladimir Kozlov vs. The Undertaker vs. Triple H No Way Out (2009) Seattle, Washington 9 Raw Edge World Heavyweight Championship John Cena (c) vs. Edge vs. Chris Jericho vs. Kane vs. Mike Knox vs. Rey Mysterio 10 John Cena WWE Championship Sheamus (c) vs. John Cena vs. Triple H vs. Randy Orton vs. Ted DiBiase vs. Kofi Kingston Elimination Chamber (2010) St. Louis, Missouri 11 SmackDown Chris Jericho World Heavyweight Championship The Undertaker (c) vs. R-Truth vs. John Morrison vs. Rey Mysterio vs. Chris Jericho vs. CM Punk 12 Raw John Cena WWE Championship match at WrestleMania XXVII John Cena vs. Sheamus vs. CM Punk vs. Randy Orton vs. John Morrison vs. R-Truth Elimination Chamber (2011) Oakland, California 13 SmackDown Edge World Heavyweight Championship Edge (c) vs. Dolph Ziggler vs. Drew McIntyre vs. Rey Mysterio vs. Kane vs. Wade Barrett 14 N/A CM Punk WWE Championship CM Punk (c) vs. Chris Jericho vs. Dolph Ziggler vs. Kofi Kingston vs. The Miz vs. R-Truth February 19, 2012 Elimination Chamber (2012) Milwaukee, Wisconsin 15 Daniel Bryan World Heavyweight Championship Daniel Bryan (c) vs. The Big Show vs. Cody Rhodes vs. The Great Khali vs. Santino Marella vs. Wade Barrett 16 Jack Swagger World Heavyweight Championship match at WrestleMania 29 Jack Swagger vs. Chris Jericho vs. Daniel Bryan vs. Kane vs. Mark Henry vs. Randy Orton February 17, 2013 Elimination Chamber (2013) New Orleans, Louisiana 17 Randy Orton WWE World Heavyweight Championship Randy Orton (c) vs. Cesaro vs. Christian vs. Daniel Bryan vs. John Cena vs. Sheamus February 23, 2014 Elimination Chamber (2014) Minneapolis, Minnesota 18 The New Day (Big E, Kofi Kingston and Xavier Woods) WWE Tag Team Championship The New Day (Big E, Kofi Kingston and Xavier Woods) (c) vs. The Ascension (Konnor and Viktor) vs. Lucha Dragons (Sin Cara and Kalisto) vs. Los Matadores (Diego and Fernando) vs. The Prime Time Players (Darren Young and Titus O'Neil) vs. Tyson Kidd and Cesaro May 31, 2015 Elimination Chamber (2015) Corpus Christi, Texas 19 Ryback Vacant WWE Intercontinental Championship Ryback vs. Dolph Ziggler vs. King Barrett vs. Mark Henry vs. R-Truth vs. Sheamus 20 SmackDown Bray Wyatt WWE Championship John Cena (c) vs. Bray Wyatt vs. The Miz vs. Baron Corbin vs. AJ Styles vs. Dean Ambrose February 12, 2017 Elimination Chamber (2017) Phoenix, Arizona 21 Raw Alexa Bliss WWE Raw Women's Championship Alexa Bliss (c) vs. Sasha Banks vs. Bayley vs. Mickie James vs. Sonya Deville vs. Mandy Rose February 25, 2018 Elimination Chamber (2018) Paradise, Nevada 22 Roman Reigns WWE Universal Championship match at WrestleMania 34 Roman Reigns vs. Braun Strowman vs. Seth Rollins vs. Finn Balor vs. John Cena vs. Elias vs. The Miz 23 Raw/SmackDown The Boss N Hug Connection (Bayley and Sasha Banks) First WWE Women's Tag Team Championship The Boss N Hug Connection (Bayley and Sasha Banks) vs. Carmella and Naomi vs. Mandy Rose and Sonya Deville vs. Nia Jax and Tamina vs. The IIconics (Billie Kay and Peyton Royce) vs. The Riott Squad (Liv Morgan and Sarah Logan) February 17, 2019 Elimination Chamber (2019) Houston, Texas 24 SmackDown Daniel Bryan WWE Championship Daniel Bryan vs. AJ Styles vs. Jeff Hardy vs. Kofi Kingston vs. Randy Orton vs. Samoa Joe 25 The Miz and John Morrison WWE SmackDown Tag Team Championship The Miz and John Morrison (c) vs. Dolph Ziggler and Robert Roode vs. Heavy Machinery (Otis and Tucker) vs. Lucha House Party (Gran Metalik and Lince Dorado) vs. The New Day (Big E and Kofi Kingston) vs. The Usos (Jey and Jimmy Uso) March 8, 2020 Elimination Chamber (2020) Philadelphia, Pennsylvania 26 Raw Shayna Baszler WWE Raw Women's Championship match at WrestleMania 36 Shayna Baszler vs. Asuka vs. Liv Morgan vs. Natalya vs. Ruby Riott vs. Sarah Logan 27 SmackDown Daniel Bryan WWE Universal Championship match Daniel Bryan vs. Cesaro vs. Jey Usovs. Kevin Owens vs. King Corbin vs. Sami Zayn February 21, 2021 Elimination Chamber (2021) St. Petersburg, Florida 28 Raw Drew McIntyre WWE Championship Drew McIntyre (c) vs. AJ Styles vs. Jeff Hardy vs. Kofi Kingston vs. Randy Orton vs. Sheamus 29 Bianca Belair WWE Raw Women's Championship match at WrestleMania 38 Bianca Belair vs. Alexa Bliss vs. Doudrop vs. Liv Morgan vs. Nikki A.S.H. vs. Rhea Ripley February 19, 2022 Elimination Chamber (2022) Jeddah, Saudi Arabia 30 Brock Lesnar WWE Championship Bobby Lashley (c) vs. Brock Lesnar vs. AJ Styles vs. Austin Theory vs. Riddle vs. Seth \"Freakin\" Rollins 31 Austin Theory WWE United States Championship Austin Theory (c) vs. Bronson Reed vs. Damian Priest vs. Johnny Gargano vs. Montez Ford vs Seth \"Freakin\" Rollins February 18, 2023 Elimination Chamber (2023) Montreal, Quebec, Canada 32 Raw/SmackDown Asuka WWE Raw Women's Championship match at WrestleMania 39 Asuka vs. Carmella vs. Liv Morgan vs. Natalya vs. Nikki Cross vs.Raquel Rodriguez 33 Becky Lynch Women's World Championship match at WrestleMania XL Becky Lynch vs. Bianca Belair vs. Liv Morgan vs. Naomi vs. Raquel Rodriguez vs. Tiffany Stratton February 24, 2024 Elimination Chamber: Perth Perth, Australia 34 Drew McIntyre World Heavyweight Championship match at WrestleMania XL Drew McIntyre vs. Bobby Lashley vs. Kevin Owens vs. LA Knight vs. Logan Paul vs. Randy Orton == DVD box set == WWE released a DVD with the title Satan's Prison: The Anthology of the Elimination Chamber (Iron Will in Europe), which included every Elimination Chamber match up until Elimination Chamber 2010, in July of 2010. The DVD is very edited mostly because of Chris Benoit. == Footnotes == == References == == Other websites == * Elimination Chamber description at WWE.com Category:Elimination Chamber Category:World Wrestling Entertainment pay-per-view events",
 "title": "Elimination Chamber"
}