{
 "id": "283307",
 "text": "Alfred Emanuel Smith, Jr. (December 30, 1873 – October 4, 1944), known in private and public life as Al Smith, was an American statesman who was elected the 42nd Governor of New York four times, and was the Democratic US presidential candidate in 1928. He was a leader of the Progressive Movement, and was noted for making a wide range of reforms as governor in the 1920s. He was also linked to the Tammany Hall machine that controlled Manhattan politics; he was a strong opponent of prohibition. Smith was the first Catholic to run for President, and attracted many thousands of ethnic voters. However he was especially unpopular among Southern Baptists and German Lutherans, who feared the pope would dictate his policies. It was a time of national prosperity, and Smith lost in a landslide to Republican Herbert Hoover. Smith tried for the 1932 nomination, but was defeated by his former ally Franklin D. Roosevelt. Smith entered business in New York City, and became an increasingly vocal opponent of Roosevelt's New Deal. In 1939 he was appointed a Papal Chamberlain of the Sword and Cape, one of the highest honors the Papacy bestowed on a layman, which today is styled a Gentlemen of His Holiness. Smith died at the Rockefeller Institute Hospital on October 4, 1944 of a heart attack, at the age of 70, broken-hearted over the death of his wife from cancer five months earlier. He is interred at Calvary Cemetery. ==Namesake== Alfred Smith is the namesake of buildings, schools, a playground, a fireboat, a park, a youth center, a military camp and a philanthropic foundation. *Alfred E. Smith Building, a 1928 skyscraper in Albany, New York *Governor Alfred E. Smith Houses, a public housing development in Lower Manhattan, near his birthplace *PS 1 Alfred E. Smith School, a school in Manhattan's Chinatown. *PS 163 Alfred E. Smith School, a school on the Upper West Side of Manhattan *Alfred E. Smith Career and Technical Education High School in the South Bronx. *Governor Alfred E. Smith Park, a playground in the Two Bridges neighborhood in Manhattan, near his birthplace *Governor Alfred E. Smith, a former front line and current reserve fireboat in the New York City Fire Department fleet. *Governor Alfred E. Smith Sunken Meadow State Park, a state park on Long Island *Alfred E. Smith Recreation Center, a youth activity center in the Two Bridges neighborhood, Manhattan. *Alfred E. Smith Memorial Foundation Dinner, a fundraiser held for Catholic Charities and a stop on the presidential campaign trail *Smith Hall, a residence hall at Hinman College, SUNY Binghamton. *Camp Smith, a State owned military installation of the New York Army National Guard in Cortlandt Manor near Peekskill, NY, about north of New York City, at the northern border of Westchester County, and consists of . *Alfred E. Smith IV, former member of the New York Stock Exchange, philanthropist, Chairman of the Saint Vincent's Catholic Medical Center *Big Hearted Al candy bar, named after Smith by a supporter who owned a candy factory ==References== Category:1873 births Category:1944 deaths Category:Deaths from myocardial infarction Category:Governors of New York (state) Category:Politicians from New York City Category:People with foods named after them Category:20th-century American politicians",
 "title": "Al Smith"
}