{
 "id": "283373",
 "text": "Jack Leroy \"Jackie\" Wilson, Jr. (June 9, 1934 – January 21, 1984) was an American singer and performer. He was called \"Mr. Excitement\". Wilson helped to change rhythm and blues into soul. He was a master showman, and a dynamic singers. He was a member of the R&B; vocal group Billy Ward and His Dominoes. On his own, beginning in 1957, he recorded over 50 hit singles. These songs included R&B;, pop, soul, doo-wop and easy listening. During a 1975 benefit concert, he collapsed on-stage from a heart attack. Then he fell into a coma. The coma lasted nearly nine years until his death in 1984. By then, he had become one of the most influential artists of his generation. A two-time Grammy Hall of Fame Inductee, Jackie Wilson was inducted to the Rock and Roll Hall of Fame in 1987. In 2004, Rolling Stone magazine ranked Jackie Wilson #68 on their list of the 100 Greatest Artists of All Time. At the 1984 Grammy Awards Michael Jackson dedicated his Album of the Year Grammy for Thriller to Wilson. After this Tarnapol released the first Wilson album in nearly nine years. ==Discography== For a detailed listing of singles and albums, see Jackie Wilson discography. ===Hit singles=== Year Title Chart positions US Billboard Hot 100 US R&B; UK Singles Chart 1957 \"Reet Petite\" 62 - 6 \"To Be Loved\" 22 7 23 1958 \"Lonely Teardrops\" 7 1 - 1959 \"That's Why (I Love You So)\" 13 2 - \"I'll Be Satisfied\" 20 6 - \"You Better Know It\" 37 1 - \"Talk That Talk\" 34 3 - 1960 \"A Woman, a Lover, a Friend\" 15 1 - \"Night\" 4 - - \"Alone at Last\" 8 - 50 \"Doggin' Around\" 15 1 - \"Am I the Man\" - 10 - \"(You Were Made For) All My Love\" - - 33 1961 \"My Empty Arms\" 9 - - \"The Tear of the Year\" - 10 - \"I'm Comin' on Back to You\" 19 9 - 1963 \"Baby Workout\" 5 1 - 1966 \"Whispers (Gettin' Louder)\" 11 5 - 1967 \"(Your Love Keeps Lifting Me) Higher and Higher\" 6 1 - 1969 \"(Your Love Keeps Lifting Me) Higher and Higher\" (UK re-release) \\- - 11 1970 \"(I Can Feel These Vibrations) This Love is For Real\" - 9 - 1972 \"I Get the Sweetest Feeling\" (UK re-release) \\- - 9 1975 \"I Get the Sweetest Feeling\" / \"(Your Love Keeps Lifting Me) Higher and Higher\" (UK re-release) \\- - 25 1986 \"Reet Petite\" (UK re-release) \\- - 1 1987 \"I Get the Sweetest Feeling\" (UK re-release) \\- - 3 \"(Your Love Keeps Lifting Me) Higher and Higher\" (UK second re-release) \\- - 15 ===Hit albums=== Year Title Chart positions US Pop US R&B; 1963 Baby Workout 36 * Merry Christmas from Jackie Wilson 6 * 1966 Whispers - 15 1967 Higher and Higher - 28 1968 Manufacturers of Soul - 18 ==References== ==Other websites== * * Jackiewilson.net * Jackie Wilson at history-of-rock.com * Jackie Wilson Tribute Artist * * The Rise and Fall of Jackie Wilson * Spinning Soul.com -The Tragic Life of Jackie Wilson * Jackie Wilson on the Soul Patrol website * The Soul Guy website: Jackie Wilson * Jackie Wilson: \"A history in pictures\" from the Soulwalking U. K. website *Brunswick Records Album Discography (including Jackie Wilson) * Michigan Rock and Roll Legends * Category:African-American musicians Category:American R&B; singers Category:American soul musicians Category:Deaths from pneumonia Category:Singers from Detroit Category:Rock and Roll Hall of Fame inductees Category:1934 births Category:1984 deaths",
 "title": "Jackie Wilson"
}