{
 "id": "283563",
 "text": "The 2012 Formula One season was the 63rd season of the Formula One World Championship. The season had 20 races, starting in Australia on 18 March and ended in Brazil on 25 November. The 2012 season saw the return of the United States Grand Prix, which was held at the Circuit of the Americas, in Austin, Texas. After being cancelled in 2011 due to civil protests, the Bahrain Grand Prix also returned to the calendar. Seven different drivers won the first seven races of the championship. a record for the series. It was not until the European Grand Prix in June that a driver, Ferrari's Fernando Alonso, won his second race of the year. Alonso was the championship leader for the next seven races, taking his third win in Germany and finishing on the podium in the United Kingdom, Italy and Singapore. However, first-lap retirements in Belgium and Japan allowed others to catch up, and defending World Champion Sebastian Vettel—like Alonso, a two-time winner—took the lead in the sixteenth race of the season. Vettel, too, had problems during the season; contact with a backmarker left him to finish outside the points in Malaysia, while alternator failures at the European and Italian Grands Prix cost him valuable points and exclusion from qualifying in Abu Dhabi led him to start from the pit lane. Vettel entered the final race of the season with a thirteen-point lead over Alonso. Alonso needed a podium finish to stand any chance of becoming World Drivers' Champion, but in a race that finished under the safety car, Vettel finished in sixth place, scoring enough points to win his third consecutive championship, becoming the third driver to do so. In the World Constructors' Championship, Red Bull Racing secured their third consecutive title when Sebastian Vettel finished second at the United States Grand Prix. In addition to seeing seven different winners at the first seven races, the season also had the most races ever in a season with twenty, beating the last record of nineteen, which was first set in 2005. Six current or former World Drivers' Champions—Sebastian Vettel, Fernando Alonso, Jenson Button, Lewis Hamilton, Kimi Räikkönen, and Michael Schumacher—started the season, breaking the record of five established in 1970. ==Pre-season== The pre-season testing season began immediately after the 2011 Abu Dhabi Grand Prix with a three-day 'Young Driver Test' (for drivers with fewer than three Formula One race starts to their name) at the Yas Marina Circuit from 15–17 November 2011. Toro Rosso test driver and Formula Renault 3.5 Series runner-up Jean-Éric Vergne was the fastest driver in every session over the three-day test, driving for Red Bull Racing. The Young Driver Tests also saw the debut of Pirelli's 2012 tyre compounds, with all bar one of the tyre compounds used in 2011 having undergone significant revisions. Several teams, including Williams and Mercedes used the event to test parts for the 2012 season in the face of a ban on exhaust-blown diffusers. ==Signed teams and drivers== After a dispute between the Formula One Teams Association and the FIA in the first half of , a new Concorde Agreement was signed on 1 August 2009 by the then FIA president Max Mosley and all of the existing teams. The new agreement provided for a continuation of the terms of the 1998 Concorde Agreement, and ran until 31 December 2012. The FIA published a provisional entry list on 30 November 2011. Team Constructor Chassis Engine Tyre Race Drivers Test/Reserve Driver(s) Red Bull Racing Red Bull RB8 Renault 1 Sebastian Vettel Sébastien Buemi Red Bull Racing Red Bull RB8 Renault 2 Mark Webber Sébastien Buemi Vodafone McLaren Mercedes McLaren MP4-27 Mercedes 3 Jenson Button Gary Paffett Vodafone McLaren Mercedes McLaren MP4-27 Mercedes 4 Lewis Hamilton Gary Paffett Scuderia Ferrari Ferrari F2012 Ferrari 5 Fernando Alonso Jules Bianchi Giancarlo Fisichella Marc Gené Scuderia Ferrari Ferrari F2012 Ferrari 6 Felipe Massa Jules Bianchi Giancarlo Fisichella Marc Gené Mercedes AMG Petronas F1 Team Mercedes F1 W03 Mercedes 7 Michael Schumacher TBA Mercedes AMG Petronas F1 Team Mercedes F1 W03 Mercedes 8 Nico Rosberg TBA Lotus F1 Team Lotus E20 Renault 9 Kimi Räikkönen TBA Lotus F1 Team Lotus E20 Renault 10 Romain Grosjean TBA Sahara Force India F1 Team Force India VJM05 Mercedes 11 Paul di Resta TBA Sahara Force India F1 Team Force India VJM05 Mercedes 12 Nico Hülkenberg TBA Sauber F1 Team Sauber C31 Ferrari 14 Kamui Kobayashi Esteban Gutiérrez Sauber F1 Team Sauber C31 Ferrari 15 Sergio Pérez Esteban Gutiérrez Scuderia Toro Rosso Toro Rosso STR7 Ferrari 16 Daniel Ricciardo TBA Scuderia Toro Rosso Toro Rosso STR7 Ferrari 17 Jean-Éric Vergne TBA Williams F1 Williams FW34 Renault 18 Pastor Maldonado Valtteri Bottas Williams F1 Williams FW34 Renault 19 Bruno Senna Valtteri Bottas Caterham F1 Team Caterham CT01 Renault 20 Heikki Kovalainen Giedo van der Garde Caterham F1 Team Caterham CT01 Renault 21 Vitaly Petrov Giedo van der Garde HRT F1 Team HRT F112 Cosworth 22 Pedro de la Rosa TBA HRT F1 Team HRT F112 Cosworth 23 Narain Karthikeyan TBA Marussia F1 Team Marussia MR01 Cosworth 24 Timo Glock TBA Marussia F1 Team Marussia MR01 Cosworth 25 Charles Pic TBA ===Team changes=== * In June 2011, Williams announced that they would be using Renault engines for the 2012 and 2013 seasons, with an option to use Renault engines again in 2014 under the next generation of engine regulations. Renault had previously supplied engines to Williams from 1989 to 1997, when the team won four World Drivers' Championships and five World Constructors' Championships. * In July 2011, Virgin Racing split with Wirth Research mid- season after a technical review by former Renault F1 Team engineering director Pat Symonds found that Virgin's CFD-only approach had failed. The team formed a technical partnership with McLaren that granted them access to McLaren's testing facilities as well as the purchase of Wirth Research facilities. * In the week before the 2011 Indian Grand Prix, Force India announced that the Sahara Group had purchased a 42.5% stake in the team, valued at US$100 million. The investment gives the Sahara Group and team principal Vijay Mallya an equal stake in the team, with team director Michiel Mol controlling the remaining 15% of the team. Under the terms of the sale, the Sahara Group will become Force India's naming-rights sponsor. * At the November 2011 meeting of the Formula One Commission in Geneva, several teams were given permission to change their names, pending final approval from the World Motorsports Council in December of that year: ** Team Lotus will be known as Caterham F1 Team, reflecting team principal Tony Fernandes' purchase of Caterham Cars. ** Lotus Renault GP will change its name to Lotus F1 Team, having been sponsored by Lotus Cars in 2011. ** Virgin Racing will become Marussia F1 Team, following increased ownership of the team by Russian car manufacturer Marussia Motors. :As a result of the name changes, Team Lotus and Lotus Renault GP declared that their ongoing dispute over the use of the Lotus name was over after they had reached an \"amicable conclusion\". Although the exact terms of the settlement were kept confidential, the joint statement detailed the transfer of the rights to the Lotus and Team Lotus names to Group Lotus' ownership. * In December 2011, Mercedes GP announced that they will change their official team name to Mercedes AMG. The new name originates from AMG, Mercedes-Benz's performance and luxury road car brand. * On 15 December 2011, HRT team principal Colin Kolles formally left his position, with the team citing the relocation of their headquarters to Spain as the reason for the separation. Former Minardi driver Luis Pérez-Sala took Kolles' place as team principal. In January 2012, the team relocated to a new facility in Valencia. ===Driver changes=== * Jaime Alguersuari did not have his contract with Scuderia Toro Rosso renewed. He was later offered a seat at HRT, but turned it down and was instead reported to be seeking a third driver role with a larger team. * Jérôme d'Ambrosio left Virgin Racing after the 2011 Brazilian Grand Prix. * After two seasons with Williams, Rubens Barrichello left the team. With HRT stating they want a young driver for their second seat, Barrichello was without a drive for 2012. * Sébastien Buemi was released from his position with Toro Rosso. He later joined parent team Red Bull Racing as their testing and reserve driver and made plans to compete in the 24 Hours of Le Mans. * Pedro de la Rosa will return to Formula One with HRT. De la Rosa has been without a full-time drive since the 2010 Italian Grand Prix, having spent the majority of the 2011 season as a test driver for McLaren. * Reigning GP2 Series champion Romain Grosjean will return to Formula One with Lotus F1, having previously competed for the team (when it was known as Renault F1) in 2009. * Nico Hülkenberg will return to Formula One with Force India, having spent the 2011 season as their testing and reserve driver. * After being injured in a rally accident shortly before the 2011 season, Robert Kubica spent the 2011 season recovering from his injuries. In November 2011, Kubica informed his team that he would not be ready to start the 2012 season. Lotus team principal Éric Boullier has indicated that he would be prepared to make a seat available for Kubica mid-season if and when Kubica is prepared to return. * In December 2011, HRT driver Vitantonio Liuzzi joined the Indian i1 Super Series. * Russian driver Vitaly Petrov was under contract to race for Lotus F1 in 2012; however, the team terminated his contract one year in advance. * Charles Pic—who placed fourth in the 2011 GP2 Series driving for Addax—will join Marussia, replacing Jérôme d'Ambrosio. * 2007 World Drivers' Champion Kimi Räikkönen will return to the sport with the Lotus F1 Team after a two- year hiatus competing in the World Rally Championship. Räikkönen had previously been in negotiations with Williams before joining Lotus. * After racing with HRT in the second half of the 2011 season, Daniel Ricciardo joined Toro Rosso. Ricciardo had previously served as the team's test and reserve driver before being placed at HRT for the 2011 British Grand Prix. * After competing for Lotus (under the Renault name) in the second half of 2011, Bruno Senna left the team. He later joined Williams, the team his uncle was racing for at the time of his death, though he did not sign a contract without his family's blessing. Senna was reported to bring fourteen million Euros in sponsorship to the team. * Adrian Sutil left Force India, having spent six years with both the team and its previous incarnations, Spyker and Midland. He wanted to drive with Williams, before negotiations collapsed in December 2011. Sutil was later charged with grievous bodily harm after allegedly assaulting a senior Renault team member with a glass in a Shanghai nightclub following the 2011 Chinese Grand Prix. If convicted, Sutil could face up to one year in prison and be banned from entering China. * 2011 Formula Renault 3.5 Series runner-up Jean-Éric Vergne filled Toro Rosso's second racing seat, becoming the third French driver to join the grid. Like Ricciardo, Vergne had completed a limited testing schedule for the team in 2011. ==2012 calendar== Bernie Ecclestone wanted to see the calendar increase to a record 20 rounds, the maximum he feels is viable. A provisional calendar was announced in June 2011, with a record 21 races. FIA President Jean Todt later said that the 2012 calendar would have no more than 20, but did not say which race would be removed. On 29 July 2011, a second provisional calendar was released, confirming that the Turkish Grand Prix would be discontinued. The final calendar was released on 7 December 2011. Round Race Title Grand Prix Circuit Date 1 Australian Grand Prix Australian GP Albert Park, Melbourne 18 March 2 Petronas Malaysia Grand Prix Malaysian GP Sepang International Circuit, Kuala Lumpur 25 March 3 UBS Chinese Grand Prix Chinese GP Shanghai International Circuit, Shanghai 15 April 4 Gulf Air Bahrain Grand Prix Bahrain GP Bahrain International Circuit, Sakhir 22 April 5 Gran Premio de España Santander Spanish GP Circuit de Catalunya, Barcelona 13 May 6 Grand Prix de Monaco Monaco GP Circuit de Monaco, Monte Carlo 27 May 7 Grand Prix du Canada Canadian GP Circuit Gilles Villeneuve, Montreal 10 June 8 Grand Prix of Europe European GP Valencia Street Circuit, Valencia 24 June 9 Santander British Grand Prix British GP Silverstone Circuit, Silverstone 8 July 10 Großer Preis Santander von Deutschland German GP Hockenheimring, Hockenheim 22 July 11 Eni Magyar Nagydíj Hungarian GP Hungaroring, Budapest 29 July 12 Shell Belgian Grand Prix Belgian GP Circuit de Spa-Francorchamps, Spa 2 September 13 Gran Premio Santander d'Italia Italian GP Autodromo Nazionale Monza, Monza 9 September 14 SingTel Singapore Grand Prix Singapore GP Marina Bay Street Circuit, Marina Bay 23 September 15 Japanese Grand Prix Japanese GP Suzuka Circuit, Suzuka 7 October 16 Korean Grand Prix Korean GP Korean International Circuit, Yeongam 14 October 17 Airtel Indian Grand Prix Indian GP Buddh International Circuit, Greater Noida 28 October 18 Etihad Airways Abu Dhabi Grand Prix Abu Dhabi GP Yas Marina Circuit, Abu Dhabi 4 November 19 United States Grand Prix United States GP Circuit of the Americas, Austin 18 November 20 Grande Prêmio do Brasil Brazilian GP Autódromo José Carlos Pace, São Paulo 25 November ===Calendar changes=== * In May 2010, it was announced that Austin, Texas would host the return of the United States Grand Prix, the first since Indianapolis in 2007. Known as the Circuit of the Americas, the venue will be a brand-new and purpose-built permanent circuit designed by Hermann Tilke. In November 2011, Bernie Ecclestone expressed \"minor\" doubt over the race going ahead after what he described as \"disagreements inside the [management] company\" and gave the circuit owners and race organisers a deadline of 7 December—coinciding with the meeting of the FIA World Motorsports Council and the release of the final 2012 calendar—to sort out their differences or else risk losing the event entirely. The final calendar included the race, with Ecclestone confirming that a new arrangement had been made, and that the event organisers had paid their circuit sanctioning fees for 2012. * The calendar released in July 2011 showed several events being moved around the calendar: ** The Bahrain Grand Prix was moved to the end of the season after the 2011 race was postponed, and later cancelled. The race was scheduled for a November date to give the government more time to ensure civil order was restored, but was later brought forward to April. At the 2011 Japanese Grand Prix, several teams expressed concern over the state of the race in the face of renewed violence in the country. These concerns were taken to the November meeting of the Formula One Commission. In January 2012, human rights groups in the country urged teams to boycott the 2012 race amid renewed political disturbances in the country. ** The German Grand Prix will return to Hockenheim after the 2011 German Grand Prix was held at the Nürburgring, in line with the event's policy of alternating between venues. ** The Korean Grand Prix was to be brought forward from October to April; however, the July calendar brought the Indian Grand Prix forward to April, leaving the Korean event in its October date. The Indian race was later moved back to 28 October, with the Korean race remaining in its 14 October date. ** The Turkish Grand Prix was removed from the calendar after Formula One Management and the event organisers could not agree on a renewed contract. In August 2011, organisers of the race said that they were negotiating with Bernie Ecclestone to resume their place on the calendar. ** The United States Grand Prix was originally scheduled to be held in June, but was moved back to become the penultimate event of the season in response to concerns over the heat of the Texas summer and its effects on teams, drivers and spectators. * Organisers of the Abu Dhabi Grand Prix had originally planned to reconfigure the Yas Marina Circuit for the 2011 race following heavy criticism over a lack of overtaking in 2010. They later postponed the circuit modifications until 2012 in the face of rule changes for the 2011 season that they felt directly addressed the criticisms levelled at the circuit, promising the speedy introduction of changes if the 2011 race proved disappointing. * Organisers of the Korean Grand Prix said they were unhappy with the terms of their contract with Bernie Ecclestone and Formula One Management, particularly the cost of race-sanctioning fees, and asked to make a new contract, seeking more-favourable terms. However, Ecclestone ruled out renegotiations, stating that the initial negotiation process had been difficult enough, and that the organisers were aware of the terms of the contract when they first signed it. Ecclestone stated that in the event that race organisers can not pay sanctioning fees, the Korean Grand Prix will be removed from the calendar. * In January 2012, organisers of the European Grand Prix wrote to Bernie Ecclestone about the race in Valencia. They felt it would not make money, and wanted to change the contract with Formula One Management to include \"a substantial cost reduction\". Organisers of the Spanish Grand Prix in Barcelona expressed similar misgivings over the state of their race. ==Changes== ===Rule changes=== ;Technical regulations * The 2011 season saw teams running \"off-throttle blown diffusers\", which created downforce by forcing fuel through the engine to produce exhaust gasses and directing it over the diffuser when the driver was not applying the throttle. This was originally banned in incremental phases, with increasingly restrictive rules on what teams could and could not do, with a full ban to be applied from the 2011 British Grand Prix onwards. The incremental ban was controversial, with several teams applying for and receiving permission to avoid the total ban. After discussion between the FIA and engine manufacturers, the original regulations were restored, with the full ban delayed until 2012. The regulations in 2012 will govern the design of the exhaust with the teams agreeing to strict rules on the position of the exhaust tailpipe. This will result in the exhaust exiting the bodywork much higher up than in 2011, and no longer near the diffuser. In October 2011, a clarification to the amended rules was issued, effectively banning \"exotic\" engine maps; in November, further amendments were introduced, completely banning the practice of blowing exhaust gasses over parts of the car to improve downforce, following a bid by several teams to allow it under certain conditions. * In January 2012, the FIA banned the use of \"reactive ride- height\". The system, first proposed by Lotus in 2010 (but not applied until 2012), used hydraulic cylinders in the brake calipers and suspension push-rods to make minute adjustments to the ride height of the car, thereby keeping the ride height at an optimal level throughout the race and providing stability during braking. The FIA initially approved the device as being legal, and several teams, including Ferrari and Williams, gave plans to the FIA for their own versions of the device before it was banned one week later. No reason was given for the reversal of the decision, though it was reported that the reactive ride-height systems violated Article 3.15 of the technical regulations, which states that \"any aerodynamic effect created by the suspension should be incidental to its primary function\" and \"any device that influences the car's aerodynamics must remain immobile in relation to the spring part of the car\". * Technical regulations for 2012 include the reprofiling of the car's nose. The pre-2012 regulations allow the nose to be as high as above ground, but the revisions to the sporting code lower the maximum allowable height to . * At the meeting for the Formula One Commission in Geneva in November 2011, the use of helium in air guns used to change tyres during pit stops was banned. Despite increasing the rotation speed of the air guns by up to 30%, the use of helium was deemed to be too expensive with little competitive gain. * All cars must now pass their mandatory FIA crash tests before they can take part in pre-season testing. Previously, passing the crash tests was only a requirement prior to the first race of the season. Crash tests for the 2012 season will also be more rigorous than in previous years. ;Sporting regulations * After being banned in 2009, in-season testing will return in 2012, with plans for a test to be held at Mugello on 1 May ahead of the European leg of the 2012 championship. As teams will only be permitted to do fifteen days of testing over the course of the season, the pre-season winter testing schedule has been cut back to accommodate the Mugello test. * At the September 2011 meeting of the FIA World Motor Sport Council, representatives of the member organisations voted to amend the rules for double-waved yellow flags in all FIA-sanctioned championships. The amendment means that double-waved flags will be shown when a track marshall is working on or beside the circuit. * Faced with several constructors applying for name changes, teams have requested a clearer definition of what constitutes a \"constructor\". Under the rules set out in the Sixth Concorde Agreement, several teams have been forced to compete under names that do not necessarily reflect their ownership – such as Sauber competing as \"BMW Sauber\" in 2010, despite BMW withdrawing from the sport at the end of the 2009 season – in order to preserve their status as a current constructor and their claim to a share of the television rights paid to teams that placed in the top ten in the final World Constructors' Championship standings. * At the final meeting of the World Motorsports Commission in December 2011, a series of changes to the rules were published. Chief among these is the re-introduction of a rule that will allow all lapped traffic under the safety car to be released from the queue before the car returns to pit lane, allowing the drivers to unlap themselves and to ensure a clean restart. * Drivers will not be able to leave the confines of the circuit without good reason. In 2011 drivers were seen using access roads around the circuit to shorten their reconnaissance and in-laps in order to save their fuel and tyres. Drivers will not be allowed to return to the normal racing line should they choose a defensive line going into a corner. * Races will have a maximum four-hour time limit to prevent the indefinite suspension of a race. This will stop the theoretical possibility of a race lasting more than eight hours. This rule was introduced after the rain-interrupted 2011 Canadian Grand Prix, which set a record for the longest race in Formula One history, at four hours, four minutes and thirty-nine seconds. * Any driver in the pit lane when a race is suspended will be permitted to return to the circuit and take up the position on the grid that they were running in at the time of the suspension. ===Other changes=== * In July 2011, a joint broadcasting deal for Formula One in the United Kingdom was announced between Sky Sports and the BBC. The new arrangement runs from 2012 until 2018 and will see all practice, qualifying sessions and races being broadcast by Sky, with the BBC televising qualifying and the race live from ten selected venues and extended highlights of the remaining ten on a delayed broadcast. The announcement was controversial, with early promises that the races would not be interrupted by commercials doing little to quell the highly negative reactions from fans and observers. It had previously been believed that the terms of the Concorde Agreement prevented Formula One from being broadcast exclusively on pay-per-view, but the Agreement did not prevent a shared broadcast such as the proposal made by Sky Sports and the BBC. The controversial nature of the broadcast deal led to the House of Commons' Culture, Media and Sport Committee calling Bernie Ecclestone and \"senior BBC figures\" including director-general Mark Thompson to answer questions over the details of the broadcasting arrangement. In November 2011, Sky announced plans to launch an additional channel, Sky Sports F1, specifically for Formula One coverage. * In December 2011, Red Bull Racing and Scuderia Ferrari left FOTA, the Formula One Teams Association, following prolonged debate over the implementation of the controversial Resource Restriction Agreement, though Red Bull team principal Christian Horner reaffirmed his team's commitment to cost-cutting measures and highlighting the team's concerns over certain loopholes in the Resource Restriction Agreement that they felt teams and manufacturers would willingly exploit. One week later, Sauber also left the organisation, though the Swiss team did not publicly give a reason for ending their membership. ==Results and Standings== ===Grands Prix=== Grand Prix Pole position Fastest lap Winning driver Winning constructor 1 Australian Grand Prix Lewis Hamilton Jenson Button Jenson Button McLaren-Mercedes Report 2 Malaysian Grand Prix Lewis Hamilton Kimi Räikkönen Fernando Alonso Ferrari Report 3 Chinese Grand Prix Nico Rosberg Kamui Kobayashi Nico Rosberg Mercedes Report 4 Bahrain Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 5 Spanish Grand Prix Pastor Maldonado Romain Grosjean Pastor Maldonado Williams-Renault Report 6 Monaco Grand Prix Mark Webber Sergio Pérez Mark Webber Red Bull-Renault Report 7 Canadian Grand Prix Sebastian Vettel Sebastian Vettel Lewis Hamilton McLaren-Mercedes Report 8 European Grand Prix Sebastian Vettel Nico Rosberg Fernando Alonso Ferrari Report 9 British Grand Prix Fernando Alonso Kimi Räikkönen Mark Webber Red Bull-Renault Report 10 German Grand Prix Fernando Alonso Michael Schumacher Fernando Alonso Ferrari Report 11 Hungarian Grand Prix Lewis Hamilton Sebastian Vettel Lewis Hamilton McLaren-Mercedes Report 12 Belgian Grand Prix Jenson Button Bruno Senna Jenson Button McLaren-Mercedes Report 13 Italian Grand Prix Lewis Hamilton Nico Rosberg Lewis Hamilton McLaren-Mercedes Report 14 Singapore Grand Prix Lewis Hamilton Nico Hülkenberg Sebastian Vettel Red Bull-Renault Report 15 Japanese Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 16 Korean Grand Prix Mark Webber Mark Webber Sebastian Vettel Red Bull-Renault Report 17 Indian Grand Prix Sebastian Vettel Jenson Button Sebastian Vettel Red Bull- Renault Report 18 Abu Dhabi Grand Prix Lewis Hamilton Sebastian Vettel Kimi Räikkönen Lotus-Renault Report 19 United States Grand Prix Sebastian Vettel Sebastian Vettel Lewis Hamilton McLaren-Mercedes Report 20 Brazilian Grand Prix Lewis Hamilton Lewis Hamilton Jenson Button McLaren-Mercedes Report ===Drivers standings=== Points are awarded to the top 10 classified finishers. Position 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th Points 25 18 15 12 10 8 6 4 2 1 {| class=\"wikitable\" style=\"font-size:85%; text- align:center;\" Driver AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA Points 1 Sebastian Vettel 2 11 5 1 6 4 4 Ret 3 5 4 2 22† 1 1 1 1 3 2 6 281 2 Fernando Alonso 5 1 9 7 2 3 5 1 2 1 5 Ret 3 3 Ret 3 2 2 3 2 278 3 Kimi Räikkönen 7 5 14 2 3 9 8 2 5 3 2 3 5 6 6 5 7 1 6 10 207 4 Lewis Hamilton 3 3 3 8 8 5 1 19† 8 Ret 1 Ret 1 Ret 5 10 4 Ret 1 Ret 190 5 Jenson Button 1 14 2 18† 9 16† 16 8 10 2 6 1 Ret 2 4 Ret 5 4 5 1 188 6 Mark Webber 4 4 4 4 11 1 7 4 1 8 8 6 20† 11 9 2 3 Ret Ret 4 179 7 Felipe Massa Ret 15 13 9 15 6 10 16 4 12 9 5 4 8 2 4 6 7 4 3 122 8 Romain Grosjean Ret Ret 6 3 4 Ret 2 Ret 6 18 3 Ret 7 19† 7 9 Ret 7 Ret 96 9 Nico Rosberg 12 13 1 5 7 2 6 6 15 10 10 11 7 5 Ret Ret 11 Ret 13 15 93 10 Sergio Pérez 8 2 11 11 Ret 11 3 9 Ret 6 14 Ret 2 10 Ret 11 Ret 15 11 Ret 66 11 Nico Hülkenberg Ret 9 15 12 10 8 12 5 12 9 11 4 21† 14 7 6 8 Ret 8 5 63 12 Kamui Kobayashi 6 Ret 10 13 5 Ret 9 Ret 11 4 18† 13 9 13 3 Ret 14 6 14 9 60 13 Michael Schumacher Ret 10 Ret 10 Ret Ret Ret 3 7 7 Ret 7 6 Ret 11 13 22† 11 16 7 49 14 Paul di Resta 10 7 12 6 14 7 11 7 Ret 11 12 10 8 4 12 12 12 9 15 19† 46 15 Pastor Maldonado 13† 19† 8 Ret 1 Ret 13 12 16 15 13 Ret 11 Ret 8 14 16 5 9 Ret 45 16 Bruno Senna 16† 6 7 22† Ret 10 17 10 9 17 7 12 10 18† 14 15 10 8 10 Ret 31 17 Jean-Éric Vergne 11 8 16 14 12 12 15 Ret 14 14 16 8 Ret Ret 13 8 15 12 Ret 8 16 18 Daniel Ricciardo 9 12 17 15 13 Ret 14 11 13 13 15 9 12 9 10 9 13 10 12 13 10 19 Vitaly Petrov Ret 16 18 16 17 Ret 19 13 DNS 16 19 14 15 19 17 16 17 16 17 11 0 20 Timo Glock 14 17 19 19 18 14 Ret DNS 18 22 21 15 17 12 16 18 20 14 19 16 0 21 Charles Pic 15† 20 20 Ret Ret Ret 20 15 19 20 20 16 16 16 Ret 19 19 Ret 20 12 0 22 Heikki Kovalainen Ret 18 23 17 16 13 18 14 17 19 17 17 14 15 15 17 18 13 18 14 0 23 Jérôme d'Ambrosio 13 0 24 Narain Karthikeyan DNQ 22 22 21 Ret 15 Ret 18 21 23 Ret Ret 19 Ret Ret 20 21 Ret 22 18 0 25 Pedro de la Rosa DNQ 21 21 20 19 Ret Ret 17 20 21 22 18 18 17 18 Ret Ret 17 21 17 0 Driver AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA Points Notes: *†—Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. ===Constructors standings=== {| class=\"wikitable\" style=\"font-size: 85%; text-align:center;\" Constructor AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA Points 1 Red Bull-Renault 1 2 11 5 1 6 4 4 Ret 3 5 4 2 22† 1 1 1 1 3 2 6 460 2 4 4 4 4 11 1 7 4 1 8 8 6 20† 11 9 2 3 Ret Ret 4 2 Ferrari 5 5 1 9 7 2 3 5 1 2 1 5 Ret 3 3 Ret 3 2 2 3 2 400 6 Ret 15 13 9 15 6 10 16 4 12 9 5 4 8 2 4 6 7 4 3 3 McLaren-Mercedes 3 1 14 2 18† 9 16† 16 8 10 2 6 1 Ret 2 4 Ret 5 4 5 1 378 4 3 3 3 8 8 5 1 19† 8 Ret 1 Ret 1 Ret 5 10 4 Ret 1 Ret 4 Lotus-Renault 9 7 5 14 2 3 9 8 2 5 3 2 3 5 6 6 5 7 1 6 10 303 10 Ret Ret 6 3 4 Ret 2 Ret 6 18 3 Ret 13 7 19† 7 9 Ret 7 Ret 5 Mercedes 7 Ret 10 Ret 10 Ret Ret Ret 3 7 7 Ret 7 6 Ret 11 13 22† 11 16 7 142 8 12 13 1 5 7 2 6 6 15 10 10 11 7 5 Ret Ret 11 Ret 13 15 6 Sauber-Ferrari 14 6 Ret 10 13 5 Ret 9 Ret 11 4 18† 13 9 13 3 Ret 14 6 14 9 126 15 8 2 11 11 Ret 11 3 9 Ret 6 14 Ret 2 10 Ret 11 Ret 15 11 Ret 7 Force India-Mercedes 11 10 7 12 6 14 7 11 7 Ret 11 12 10 8 4 12 12 12 9 15 19† 109 12 Ret 9 15 12 10 8 12 5 12 9 11 4 21† 14 7 6 8 Ret 8 5 8 Williams-Renault 18 13† 19† 8 Ret 1 Ret 13 12 16 15 13 Ret 11 Ret 8 14 16 5 9 Ret 76 19 16† 6 7 22† Ret 10 17 10 9 17 7 12 10 18† 14 15 10 8 10 Ret 9 Toro Rosso-Ferrari 16 9 12 17 15 13 Ret 14 11 13 13 15 9 12 9 10 9 13 10 12 13 26 17 11 8 16 14 12 12 15 Ret 14 14 16 8 Ret Ret 13 8 15 12 Ret 8 10 Caterham-Renault 20 Ret 18 23 17 16 13 18 14 17 19 17 17 14 15 15 17 18 13 18 14 0 21 Ret 16 18 16 17 Ret 19 13 DNS 16 19 14 15 19 17 16 17 16 17 11 11 Marussia-Cosworth 24 14 17 19 19 18 14 Ret DNS 18 22 21 15 17 12 16 18 20 14 19 16 0 25 15† 20 20 Ret Ret Ret 20 15 19 20 20 16 16 16 Ret 19 19 Ret 20 12 12 HRT-Cosworth 22 DNQ 21 21 20 19 Ret Ret 17 20 21 22 18 18 17 18 Ret Ret 17 21 17 0 23 DNQ 22 22 21 Ret 15 Ret 18 21 23 Ret Ret 19 Ret Ret 20 21 Ret 22 18 Constructor AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA Points Notes: *†—Cars did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. == Notes == == References == Category:Formula One seasons Formula One season",
 "title": "2012 Formula One World Championship"
}