{
 "id": "283566",
 "text": "Capital Region International Airport , is a public airport in DeWitt Township, Clinton County, Michigan. The airport is northwest of Lansing, Michigan. The airport has three runways and is 2160 acres (874.12 ha) in size. The airport is owned and operated by the Capital Region Airport Authority. ==History== The airport opened in July 1928. Cargo service from the airport began on July 17, 1928, on Transamerican Airlines. Passenger service began on September 1, 1929, on Kohler Airlines. The current terminal building opened in 1959.Airport Master Plan 2006, sec 1.2.1 , FlyLansing.com, December 2006 The first international flights (to Cancún, Mexico) began in December 2009 on USA3000 Airlines.Press Release. Apple Vacations announces new non-stops from Lansing to Cancun on USA 3000 Airlines, July 1, 2009, web.archive.org flylansing.com archived on October 23, 2010, Retrieved December 20, 2012 Allegiant Air served the airport from 2003-2009 and 2012-2015 with flights to Florida. ==Airlines and destinations== Delta Air Lines, Sun Country Airlines, and United Airlines are passenger airlines that serve Capital Region International Airport. UPS Airlines is a cargo airline that serves the airport. The airport has domestic passenger flights to Atlanta, Chicago, Detroit, Minneapolis, and Washington, D.C. The airport has seasonal international passenger flights to Cancún, Mexico and Puerto Vallarta, Mexico.Sun Country Airlines. Flight Schedule, suncountry.com, Retrieved June 1, 2012. The airport has cargo flights to Columbus and Louisville. A total of 376,790 passengers flew to and from Capital Region International Airport in 2014. Another 418,850 passengers flew in 2013. Earlier, 656,703 passengers flew in 2000. 45,896,074 pounds (20,818,109 kg) of cargo flew to and from the airport in 2014. 64,844,276 pounds (29,412,869 kg) of cargo flew in 2000. thumb|right|210px |Destinations with non-stop service from Lansing (as of February 2013) ==Photos== Image:Lansing_Capital_Region_International_Airport_Terminal_Parking_Lot.jpg|Airport terminal and parking lot Image:Lansing Capital Region International Airport Terminal Drive 1.jpg|Front of airport terminal Image:Capital Region International Airport UPS Boeing 767-300 Cargo.jpg|UPS Airlines Boeing 767 cargo airplane Image:Capital Region International Airport USGS 08-Mar-2010.png|Aerial photograph of the airport USGS TNM 2.0 Viewer from USGS The National Map, viewer.nationalmap.gov, Retrieved July 6, 2010 ==Related pages== * Lansing, Michigan ==References== == Other websites == * Capital Region International Airport (official site) * Port Lansing (official site) * Capital Region Airport Authority * Mid-Michigan Business Travel Coalition Category:Airports in Michigan Category:Lansing, Michigan Category:1928 establishments in the United States Category:1920s establishments in Michigan",
 "title": "Capital Region International Airport"
}