{
 "id": "283674",
 "text": "Trevor Bayne (born February 19, 1991) is an American race car driver. Until 2019, Bayne drove the No. 6 Ford Fusion for Roush Fenway Racing. On February 20, 2011 Trevor Bayne won the 2011 Daytona 500. Bayne is the youngest driver to win the Daytona 500. ==Early career== Trevor Bayne started racing Go-Karts when he was 5 years old. Bayne won over 300 races and 22 championships in Go- Karts. In 2005, Bayne started racing in the Allison Legacy Series. He drove in 22 races, and won 12 of those races. In 2006, Bayne raced for Team Rensi in the USAR Pro Hooters Cup, and he won the Rookie of the Year award at age of 15. In 2007, Bayne left Team Rensi to race for Dale Earnhardt, Inc. ==NASCAR career== For the 2008 season, Bayne drove the #1 car for Dale Earnhardt Incorporated in the NASCAR Camping World East Series. Bayne had 6 Top 5's, two poles and one win at Thompson International Speedway in his 6th start. In the 2009 season Bayne made his first NASCAR Nationwide Series start for Means Racing in the #52 Taco Bell Chevrolet at Bristol Motor Speedway. Bayne also agreed to drive the #99 Aarons Toyota for Michael Waltrip Racing for 8 races. Bayne got his career best finish at O'Reilly Raceway Park when he finished 7th. In September 2010, Bayne left Diamond-Waltrip Racing and went to drive for Roush-Fenway Racing. He will drive for Roush-Fenway Racing in the 2011 season in the NASCAR Nationwide Series. He made his first NASCAR Sprint Cup Series start in the 2010 AAA Texas 500 at Texas Motor Speedway with Wood Brothers Racing. Bayne is the first driver to compete in one of the top three NASCAR series to be born in 1991. Bayne drove the #21 Wood Brothers Racing Ford in 17 Sprint Cup Series races in 2011. He did not competing for the Rookie of the Year award because he was racing the full Nationwide Series season. Bayne won his first Sprint Cup Series race in his second race ever, the 2011 Daytona 500. This win makes him the second youngest driver ever to win a Sprint Cup Series race, and the youngest ever driver to win the Daytona 500. In 2015 Bayne started racing full time in the NASCAR Sprint Cup Series for Roush Fenway Racing. ==Images== File:TrevorBayneToyotaMilwaukeeMile2009.jpg|Bayne's #99 Nationwide car at Milwaukee in 2009 File:99TrevorBayne2010Bucyrus200RoadAmerica.jpg|2010 Nationwide car at Road America File:Trevor Bayne, the 2011 Daytona 500 winner.jpg|Bayne's car before the start of the 2011 Daytona 500 ==References== ==Other websites== *Stories and photos about Travor Bayne from the Knoxville News Sentinel *Video interview with Travor Bayne *Yahoo Driver Page Category:NASCAR drivers Category:1991 births Category:Living people Category:Daytona 500 winners Category:American racecar drivers Category:Sportspeople from Knoxville, Tennessee",
 "title": "Trevor Bayne"
}