{
 "id": "283859",
 "text": "Angela Georgina Burdett-Coutts, 1st Baroness Burdett-Coutts (21 April 1814 – 30 December 1906), born Angela Georgina Burdett, was a noted nineteenth century philanthropist. She was the daughter of Sir Francis Burdett, 5th Baronet and Sophia Coutts, daughter of Thomas Coutts the banker. In 1837 she became the wealthiest woman in England when she inherited her grandfather's fortune of nearly three million pounds sterling. At the same time she got a Royal Licence (permission from the monarch) to join her father's and grandfather's surnames and become Angela Burdett-Coutts. Lady Burdett-Coutts did not mary until she was 67. She married her 29-year-old secretary, the American born William Lehman Ashmead Bartlett, who later became MP for Westminster on 12 February, 1881. Her new husband changed his surname to Burdett-Coutts. Lady Burdett-Coutts had no children. ==Philanthropy== She gave away most of her wealth, setting up on scholarships, endowments, and giving to a wide range of charitable causes. One of her earliest was to establish, with the novelist Charles Dickens, Urania Cottage, a home that helped young women who had 'turned to a life of immorality'including theft and prostitution. Among many gifts to churches, she also personally endowed the bishoprics of Cape Town, and Adelaide (1847), and the founding bishopric of British Columbia (1857). The money from these endowments was invested to help pay for the Bishop's expenses. The granite fountain in Edinburgh, with a statue of Greyfriars Bobby, was erected by Baroness Burdett-Coutts. Man's Best Friend - Greyfriars Bobby at Historic UK She also established the National Society for the Prevention of Cruelty to Children (NSPCC) in 1883, the Westminster Technical Institute in 1893 and was closely involved with the Royal Society for the Prevention of Cruelty to Animals (RSPCA). Other roles and charitable projects included: *President, British Beekeepers Association 1878–1906 *President of the Ladies Committee of the RSPCA (England/Scotland). *Church bells for St Paul's Cathedral *Cotton gins for Nigeria *Drinking fountains for dogs *Help for Turkish peasants and the refugees of the 1877 Russo-Turkish War, receiving the order of the Medjidieh, the only time it was conferred on a woman *Housing schemes for the working-class along the lines of contemporary model dwellings companies. *Lifeboats in Brittany, France *The London Ragged School Union *A sewing school for women in Spitalfields when the silk trade declined *Soup kitchens *Support organisations for the aboriginal peoples of Australia and for the Dayaks of Borneo *The Temperance Society *Promotion of the fishing industry in Ireland by helping to start schools and provide boats; she also advanced £250,000 in 1880 for supplying seed to the impoverished tenants *Placement of hundreds of destitute boys in training ships for the navy and merchant service *Financing the first archaeological survey of Jerusalem in 1864 to improve its sanitation *Prominent supporter of the British Horological Institute at a crucial time in its history, due to her acquaintance with John Jones, a BHI founder *In 1858 donated £500 to the Cotton Supply Association and contributed an annual subscription of £100 for five years. Ten years letter she donated another £500 to the Association. *In 1864 purchased more than one hundred Greek manuscripts (532-546) from Janina (Epirus), transported to England between 1870 and 1872 and presented them to Sir Roger Cholmely's School, they were housed at the Highgate, in London *Commissioned a monument for St Pancras Old Church, containing the names of many people whose bodies had been dug up from the churchyard to make space for the railway.www.es.ucl.ac.uk In 1871, in recognition of her charity work, Queen Victoria made her a peer on her own under the title Baroness Burdett- Coutts, of Highgate and Brookfield in the County of Middlesex., although as a woman she was not a member of the House of Lords. On 18 July 1872 she became the first woman to be presented with the Freedom of the City of London at the Guildhall and in 1874 was Edinburgh's first woman Burgess, also being presented with the Freedom of that city. ==Death== Lady Burdett-Coutts died of acute bronchitis at her house in Stratton Street, Piccadilly. By the time of her death she had given more than £3 million to good causes. She was buried on 5 January 1907 near the West Door in the nave of Westminster Abbey. The barony became extinct on her death. ==Legacy== Charles Dickens dedicated his novel Martin Chuzzlewit to her and she had many royal and eminent friends. The book Flashman's Lady by George MacDonald Fraser makes reference to Angela Burdett- Coutts (fictional) love interest for James Brooke (The White Rajah); and his rejection of her due to his physical affliction. ==References== ==Other websites== *Angela Georgina Burdett-Coutts at the Victorian Web *Article on Angela Burdett-Coutts from Anglicans Online Category:1814 births Category:1906 deaths Category:Infectious disease deaths in London Category:Deaths from bronchitis Category:People buried in Westminster Abbey Category:People with foods named after them Category:British philanthropists",
 "title": "Angela Burdett-Coutts"
}