{
 "id": "283823",
 "text": "Edward B. Lewis (May 20, 1918 – July 21, 2004) was an American geneticist. He shared the 1995 Nobel Prize in Physiology or Medicine with Christiane Nüsslein-Volhard and Eric F. Wieschaus. Lewis was born in Wilkes-Barre, Pennsylvania He received a BA in Biostatistics from the University of Minnesota in 1939. In 1942 Lewis received a PhD from California Institute of Technology (Caltech), working on Drosophila melanogaster under the guidance of Alfred Sturtevant. After serving as a meteorologist in the U.S. Air Force in World War II, Lewis joined the Caltech faculty in 1946 as an instructor. In 1956 he was appointed Professor of Biology, and in 1966 the Thomas Hunt Morgan Professor of Biology. His Nobel Prize winning studies with Drosophila founded the field of developmental genetics and laid the groundwork for our current understanding of the universal, evolutionarily conserved strategies controlling animal development. His key publications in the fields of genetics, developmental biology, radiation and cancer are available in a book.Lipshitz H.D. 2004. Genes, development, and cancer: the life and work of Edward B. Lewis. Kluwer Academic, Boston. == Effects of radiation == During the 1950s, Lewis studied the effects of radiation from X-rays, nuclear fallout and other sources as possible causes of cancer. He reviewed medical records from survivors of the atomic bombings of Hiroshima and Nagasaki, as well as radiologists and patients exposed to X-rays. Lewis concluded that \"health risks from radiation had been underestimated\". Lewis published articles in Science and other journals and made a presentation to a Congressional committee on atomic energy in 1957.Edward Lewis, Nobelist who studied fly DNA, dies at 86 At the scientific level of the debate, the crucial question was whether the \"threshold theory\" was valid or whether, as Lewis insisted, the effects of radioactivity were \"linear with no threshold\", where every exposure to radiation had a long-term cumulative effect.Gerald H. Clarfield and William M. Wiecek 1984. Nuclear America: military and civilian nuclear power in the United States 1940-1980, Harper & Row, New York. p225 == Genes regulating development == In a series of experiments with the fruit-fly Drosophila, Lewis was able to identify a complex of genes whose proteins bind to the regulatory regions of target genes. The latter then activate or repress cell processes which direct the final development of the organism.Lewis E.B. 1995. The bithorax complex: the first fifty years. Nobel Prize lecture. Repr. in Ringertz N. (ed) 1997. Nobel lectures, Physiology or Medicine. World Scientific, Singapore.Lawrence P. 1992. The making of a fly. Blackwell, Oxford. The sequence of these control genes show co-linearity: the order of the loci in the chromosome parallels the order in which the loci are expressed in segments along the body. Not only that, but this cluster of master control genes programs the development of all higher organisms.Duncan I. 1987. The bithorax complex. Ann. Rev. Genetics 21, 285–319.Lewis E.B. 1992. Clusters of master control genes regulate the development of higher organisms. J. Am. Medical Assoc. 267, 1524–1531. Each of the genes contains a homeobox, a remarkably conserved DNA sequence. This suggests the complex itself arose by gene duplication.McGinnis W. et al. 1984. A conserved DNA sequence in homeotic genes of the Drosophila antennipedia and bithorax complexes. Nature 308, 428–433.Scott M.P. and Weiner A.J. 1984. Structural relationships among genes that control developmental sequence homology between the antennipedia, ultrabithorax and fushi tarazu loci of Drosophila. PNAS USA 81, 4115.Gehring W. 1999. Master control systems in development and evolution: the homeobox story. Yale. In his Nobel lecture, Lewis said \"Ultimately, comparisons of the [control complexes] throughout the animal kingdom should provide a picture of how the organisms, as well as the [control genes] have evolved\".Duncan I. and G. Montgomery 2002. E.B. Lewis and the bithorax complex. Part I. Genetics 160: 1265–1272. PMC free article: Duncan I. and G. Montgomery 2002. E.B. Lewis and the bithorax complex. Part II. Genetics 161: 1–10. PMC free article E. B. Lewis and the bithorax complex: part II. From cis-trans test to the genetic control of development. == Related pages == *Hox gene == References == Category:1918 births Category:2004 deaths Category:California Institute of Technology faculty Category:American geneticists Category:American Nobel Prize winners Category:American zoologists Category:Scientists from Pennsylvania Category:Wolf Prize winners Category:People from Wilkes-Barre, Pennsylvania",
 "title": "Edward B. Lewis"
}