{
 "id": "283997",
 "text": "The Kaw people (also known as the Kanza) are a Native American people living in the central part of the Midwestern United States. The Kaw people have also been known as the \"People of the South wind\",\"Constitution of the Kaw Nation.\" Kaw Nation. 2011. Retrieved 30 April 2012. \"People of water\", Kansa, Kaza, Kosa, and Kasa. The US state of Kansas was named after the Kaw people. Kansas' capital city, Topeka, was named after a Kaw word meaning \"a good place to dig potatoes\". The Kaw are closely related to the Osage Nation. == Government == The Kaw Nation's headquarters is in Kaw City, Oklahoma. The tribe's jurisdictional area is in Kay County, Oklahoma. The elected chairwoman is Lynn Williams. She is serving a four-year term. There are 3,126 members of the tribe. 1,428 of them live in Oklahoma. ==History== ===Interacting with the United States=== The Louisiana Purchase in 1803 hurt the Kaw. They were forced to move west by Native Americans from the east. They were also forced to move by White settlers who liked the \"beautiful aspects\" and \"rich and exuberant soils\" of the Kaw's land.Unrau, Kansa Indians, 105 In 1825, the Kaw ceded a big area of land in Missouri and Kansas to the United States. They did this in exchange for a promise of a $3,500 payment every year for twenty years. The promised payment was often late. Sometimes, the payments were taken by government officials and merchants. The Kaw faced smallpox epidemics in 1827–1828 and 1831–1832. It killed about 500 people.Unrau, Kansa Indians, 149-150 In 1844, a flood destroyed most of the land the Kaw had planted. It hurt the Kaw a lot. In 1846, the Kaw sold most of their remaining of land for $202,000 plus a reservation on Council Grove, Kansas.Unrau, ibid, 159-161 In 1861, during the American Civil War, the Kaw and other Native Americans in Kansas were recruited as soldiers and scouts. This was done to prevent attacks by pro-slavery tribes and Confederate supporters in Indian Territory. Seventy young Kaw men were persuaded—or forced—to join Company L, Ninth Kansas Cavalry. They served in Indian Territory (Oklahoma) and Arkansas during the war. 21 of them never came home. This was a big loss because there were already few Kaw people left.National Archives, Record Group M-234, Tape 467, page 476 After the Civil War, White Americans in Kansas wanted to remove the Native Americans, including the Kaw. However, during this time, something happened. The Kaw and the Cheyenne were enemies. On June 1, 1868, about one hundred Cheyenne people attacked the Kaw reservation. Scared white settlers ran to Council Grove. The Kaw men painted their faces, wore their armor, and went on horseback to meet the Cheyenne. The two Indian armies put on a military display. It featured horsemanship, howls and curses, and volleys of bullets and arrows. After four hours, the Cheyenne left with a few stolen horses and a peace offering of coffee and sugar by the Council Grove merchants. Nobody was hurt on either side. During the battle, the mixed-blood Kaw interpreter, Joseph James, Jr. went 60 miles to Topeka to ask for help from the Governor. An eight-year-old, part-Indian boy named Charles Curtis went with Joseph James. Curtis would later become a jockey, a lawyer, a politician, and Vice President of the United States under Herbert Hoover.Unrau, William E. Mixed Bloods and Tribal Dissolution: Charles Curtis and the Quest for Indian Identity, Norman: University of Okla Press, 1971: 72-75. White pressure finally forced the Kaw out of Kansas. On June 4, 1873, they packed up, and they went south in wagons to Indian Territory to a new reservation. Two weeks later, 533 men, women, and children arrived at the junction of the Arkansas River and Beaver Creek. This would become Kay County, Oklahoma.Unrau, Mixed Bloods, 92 The Kaw made their last successful buffalo hunt that winter. They went to the Great Salt Plains to hunt. They saved the buffalo meat by jerking it, and they sold the buffalo fur for five thousand dollars. Accessed, Aug 12, 1999. === 20th century === While living in the Indian Territory, they were ignored by white people. However, the tribe continued to lose people. By 1888 there were only 188 persons. The Kaws seemed like they would be gone.Accessed, Feb 22, 2010. However, they slowly acculturated and their numbers increased, mostly through intermarriage as the number of full-bloods continued to decline. By 1910, only one old woman in the tribe could not speak English and more than 80 percent were literate. The Curtis act of 1898 allowed the federal government to have more power over Indian affairs. The author of the law was Charles Curtis, now a Congressman. Curtis believed that the Indians should be assimilated. He supported the break-up of tribal governments and the allotment of tribal lands to their members. In 1902, at Curtis's urging, Congress ended the Kaw tribal government and reservation. Congress divided tribal lands among members. Each of 247 Kaw tribal members got . Of that, were for a house. Curtis and his son and two daughters got of land.Finney, Frank F. \"The Kay Indians and their Indian Territory Agency.\" Chronicles of Oklahoma. Vp; 35. No. 4, 1957, 416-422 Most Kaws sold or lost their land. By 1945, only 13 percent of the land of the former Kaw Reservation was owned by Kaws.Chapman, Berlin B. \"Charles Curtis and the Kaw Reservation.\" Kansas Historical Quarterly.Vol XV, No. 4. Nov 1947, p. 351 Much former Kaw land was flooded by the creation of Kaw Lake in the 1960s. This included their Council House and cemetery at Washunga which was moved to Newkirk, Oklahoma. After the death of Washunga in 1908, the Kaw people had no formal organization for many years. In 1922, Washunga's adopted daughter Lucy Tayiah Eads was elected principal chief. A council of eight members was also created. She was the first and only female chief. In 1928, the government agency to the Kaw was ended, and the buildings were sold.Finney, p. 423 After that, the Kaw had no recognized government. This changed in 1959, when the federal government recognized them, and the tribe reorganized. The last Chief of the Kaw, Ernest Emmett Thompson, was elected in 1934. According to Dorothy Roberts, full-blooded Kaw women were forced to be sterilized by the Indian Health Service in the 1970s.Accessed Feb 15, 2019. Truthout: The last time the US wanted a wall 70,000 were sterilized. As Dorothy Roberts notes in Killing the Black Body: In four Indian Health Service hospitals alone, doctors performed more than 3,000 sterilizations without adequate consent between 1973 and 1976. For small Indian tribes, this policy was literally genocidal. One physician reported that: all the pureblood women of the Kaw tribe of Oklahoma have now been sterilized. At the end of the generation the tribe will cease to exist.. In 1990, the Kaw wrote a new tribal constitution. They created a tribal court in 1992. In 2000, the tribe bought lands on their pre-1873 reservation near Council Grove, Kansas. This did this to create a park remembering their history in Kansas. They named it the Allegawaho Memorial Heritage Park. The last fluent speaker of the Kansa language, Walter Kekahbah, died in 1983.Ranney, Dave. \"Researchers try to preserve Indian languages.\" accessed 8 Apr 2011 {As of 2012, the Kaw Nation offers online language learning for Kansa second language speakers}.[Ranney, Dave. \"Researchers try to preserve Indian languages.\", accessed 12 Apr 2011] The last full-blood Kaw, William Mehojah, died in 2000.OK/IT GenWeb. \"The Kansas/Kanza/Kaw Nation.\" Accessed 30 Nov 2011 ==References== == Other websites == *Kaw Nation, official website *Al-le-ga-wa-ho Memorial *Rootsweb Kaw article. *WebKanza: The Online Home of the Kanza Language Category:Kansas Category:Native Americans",
 "title": "Kaw people"
}