{
 "id": "284190",
 "text": "The Premier of the Soviet Union was the head of the government in the Union of Soviet Socialist Republics (USSR). Most Western countries use the term \"Prime Minister\" for this government position. == Names == In the former Soviet Union, this job had many names: #Chairman of the Council of People's Commissars (1917–1946) #Chairman of the Council of Ministers (1946–1991) #Prime Minister of the Soviet Union (1991) #Chairman of the Interstate Economic Committee of the USSR—Prime Minister of the Economic Community (1991) ==List of Premiers== # These numbers are not official. Name (birth–death) Tenure Electorate Cabinets 1 Chairman of the Council of People's Commissars (1922–1946) Vladimir Lenin (1870–1924) 30 December 1922 – 21 January 1924 — Lenin I–II He led the Russian Social Democratic Labour Party (RSDLP) through the Russian Revolution (February and October Revolution) and successfully created the world's first socialist state, the Russian Socialist Federative Soviet Republic (RSFSR). In 1922 he established the Soviet Union. 2 Alexey Rykov (1881–1938) 2 February 1924 – 19 December 1930 1929 Rykov I A member of the moderate faction within the Bolshevik Party. He was forced, along with other moderates, to \"admit their mistakes\" to the party and, in 1930, Rykov lost his premiership because of it. 3 Vyacheslav Molotov (1890–1986) 19 December 1930 – 6 May 1941 1937 Molotov I He oversaw Stalin's collectivization of agriculture, the implementation of the First Five-Year Plan, industrialization of the USSR, and the Great Purge of 1937–38. Despite the great human cost, the Soviet Union under Molotov's nominal premiership made great strides in adopting and using agricultural and industrial technology. 4 Joseph Stalin (1878–1953) 6 May 1941 – 15 March 1946 1946 Stalin I He led the country through the Great Patriotic War (World War II) and started the reconstruction period. He renamed the office of the People's Commissars to the Council of Ministers of the USSR. Chairman of the Council of Ministers (1946–1991) Joseph Stalin (1878–1953) 15 March 1946 – 5 March 1953 1950 Stalin II After the war Stalin installed communist governments in most of Eastern Europe, forming the Eastern Bloc, behind what was referred to as an \"Iron Curtain\" of Soviet rule. This was during the Cold War, a long period of tension between the Western world and the USSR. 5 Georgy Malenkov (1902–1988) 6 March 1953 – 8 February 1955 1954 Malenkov I–II He took over after Stalin's death, but soon lost in a power struggle with Nikita Khrushchev. He continued to hold the office of premier until Khrushchev started the process of de-Stalinization. He was replaced on Khrushchev's orders by Nikolai Bulganin. 6 Nikolai Bulganin (1895–1975) 8 February 1955 – 27 March 1958 1958 Bulganin I He oversaw the period of de-Stalinization. At first he was a strong supporter of Khrushchev. Then he started doubting some of his more radical policies. He was accused of being a member of the Anti-Party Group, and was eventually replaced by Khrushchev himself. 7 Nikita Khrushchev (1894–1971) 27 March 1958 – 14 October 1964 1962 Khrushchev I–II He led the country through the Cuban Missile Crisis. He oversaw plenty of reforms and policy innovations, such as the 1961 monetary reform. His increasingly erratic behaviour led to his removal by the nomenklatura both as premier and First Secretary of the Communist Party. 8 Alexei Kosygin (1904–1980) 15 October 1964 – 23 October 1980 1966, 1970, 1974, 1979 Kosygin I–V He was one of three leading members of the \"collective leadership\" (with Leonid Brezhnev and Nikolai Podgorny). He ruled through the Era of Stagnation. Kosygin initiated three large-scale economic reforms under his leadership: the 1965, the 1973–74 and the 1979 reform. He retired in October 1980 and died two months later. 9 Nikolai Tikhonov (1905–1997) — 23 October 1980 – 27 September 1985 1984 Tikhonov I–II Tikhonov was premier through the rules of Brezhnev's late rule, Yuri Andropov, Konstantin Chernenko and the very beginning of Mikhail Gorbachev's tenure. In between Andropov's last days and Chernenko's rise to power, Tikhonov was the de facto 'leader of the Soviet Union'. 10 Nikolai Ryzhkov (1929–) 27 September 1985 – 14 January 1991 1989 Ryzhkov I–II Ryzhkov supported Gorbachev's attempt to revive and restructure the Soviet economy by decentralising and introducing new technology. However, he resisted Gorbachev's later attempts to introduce market mechanisms into the Soviet economy. He was forced to resign when his office as Chairman of the Council of Ministers was dissolved. 11 Prime Minister of the Soviet Union (1991) Valentin Pavlov (1937–2003) — 14 January 1991 – 22 August 1991 — Pavlov I Pavlov was elected to the new position of Prime Minister as a compromise candidate. His 1991 monetary reform failed and led him to join the State Committee of the State of Emergency. The State Committee attempted to depose Gorbachev on 19 August. They failed, and Pavlov was arrested on 29 August. 12 Chairman of the Interstate Economic Committee of the USSR—Prime Minister of the Economic Community (1991) Ivan Silayev (1930–2023) — 6 September 1991 – 25 December 1991 — Silayev I After the August Coup of 1991, the Soviet government lost much of its power over the republics. Silayev and Gorbachev were unable to hold the Soviet state together, and eventually it fell apart. ===Notes=== ==References== Soviet Union *",
 "title": "Premier of the Soviet Union"
}