{
 "id": "284260",
 "text": "Reproductive isolation refers to the situation where different species may live in the same area, but properties of individuals prevent them from interbreeding.Mayr, Ernst 2001. What evolution is. Weidenfeld and Nicolson, London. The things which stop species or groups of organisms reproducing sexually are called isolating mechanisms. Members of one species do not, in general, mate with members of another species, though there are many exceptions and variations to this. And, if such mating does take place, the offspring may not develop, or may not be fertile. If species arise by the splitting of ancestral species, it might be asked what stops the new species continuing to reproduce together. If they did, they would again become one species. == Isolating mechanisms == A list as drawn up of isolating mechanisms: Mayr E. 1970. Populations, species, and evolution. Harvard University Press, Cambridge, Mass. === Pre-mating mechanisms === Factors which cause individuals to mate with their own species. *Temporal isolation: Individuals do not mate because they are active at different times. *Ecological isolation: Individuals only mate in their preferred habitat. They do not meet those with different ecological preferences. *Behavioral isolation: Individuals of different species may meet, but choose members of their own species. They may not recognize sexual cues given by other species. *Mechanical isolation: Copulation may be attempted but transfer of sperm does not take place. The individuals may be incompatible due to size or morphology. === Post-mating isolating mechanisms === Incompatibility of the two genomes stops normal development in the hybrid. *Gametes not compatible. Sperm transfer takes place, but egg is not fertilized. *Zygote mortality: The egg is fertilized, but the zygote does not develop. *Hybrid inviability: Hybrid embryo forms, but dies. *Hybrid sterility: Hybrid is viable, but the resulting adult is sterile. *Hybrid breakdown: First generation hybrids are viable and fertile, but further hybrid generations and backcrosses are inviable or sterile. There is still much debate as to whether the Dobzhansky/Mayr account is satisfactory. Modern researchers tends to avoid the general term 'isolating mechanisms' in favour of the more specific terms 'mate choice', 'hybrid incompatibility' and other forms of 'reproductive isolation'. == References == Category:Evolutionary biology",
 "title": "Reproductive isolation"
}