{
 "id": "284339",
 "text": "The Indian Rebellion of 1857, also called the Great Indian Event of 1857, the Indian Mutiny, the Sepoy Mutiny,Sepoy: an Indian footsoldier (of whatever religion) in the East India Company army or the British Indian Army. The term comes from the Persian \"Sipahi\". India's First War of Independence, or India's First Struggle for Independence, began on 10 May 1857 at Meerut as a mutiny of sepoy of the British East India Company's army. Sepoy in the Presidency of Bengal revolted against their British officers. == Causes == === Long term === The causes of the rebellion are hard to pin down and have been much argued about. Before the rebellion, 50,000 British troops and 300,000 sepoy served in the East India Company army. The forces were divided into three presidency armies: Bombay, Madras, and Bengal. Those armies had a make-up that varied from region to region.Gregory Fremont-Barnes 2007. Essential histories, The Indian Rebellion 1857–1858. Osprey, p25. The Bengal Army recruited higher castes such as Rajputs and Bhumihar brahmins and reduced the enlistment of lower castes in 1855. In contrast, the Madras Army and the Bombay Army were “more localized, caste-neutral armies” that “did not prefer high-caste men”. The domination of higher castes in the Bengal Army has been blamed in part for the initial mutinies that led to the rebellion. There were some changes in the terms of their service, which may have created resentment. As the East India Company expanded, soldiers were now expected to serve in less familiar regions, such as in Burma, and to make do without the “foreign service” remuneration that they used to have., Another financial grievance stemmed from the General Service Act, which denied retired sepoy a pension. That applied only to recruits, but older sepoy suspected that it might apply to those already in service. Moreover, the Bengal Army was paid less than the Madras and Bombay Armies, which increased its members' fears over pensions. === Short term === The immediate event that angered the sepoy was the ammunition for the new Enfield rifles, which they had to use. The cartridges that were used in the new rifles had to be bitten open. The Muslims were angry because they thought that the paper cartridges had pig fat in them. Hindu soldiers were angry because they believed the cartridges had cow fat in them. On January 27, Colonel Richard Birch ordered that no cartridges should have grease on them and that sepoy could grease them with whatever they wanted.David, Saul (2003), The Indian Mutiny: 1857, London: Penguin Books, 528 pp, During the 1850s, the British rulers continued to take some regions forcibly that had been ruled by Indians. For example, the British, under the decision of Governor-General Lord Dalhousie, seized in 1856 the kingdom of Agra and Oudh, which is now part of the Indian state of Uttar Pradesh. That went against Indian customs and did not give any respect to old royal houses of India like the Mughals, the nominal Indian emperors, and the Peshwas, the most powerful Maratha rulers. ==Events== The rebellion broke out after a soldier, called Mangal Pandey, attacked a British sergeant and wounded an adjutant while his regiment was in Barrackpore. General Hearsey ordered another Indian soldier to arrest Mangal Pandey, but the soldier refused. Later, the British arrested Mangal Pandey and the other Indian soldier and hanged both of them for treachery. All other soldiers of that regiment lost their places in the army. On May 10, 1857, cavalry troops doing parade at Meerut broke rank, freed the soldiers of the 3rd Regiment and moved towards Delhi. Soon, many Indians of northern India joined the soldiers; entered the Delhi Fort, where Mughal Emperor Bahadur Shah II lived; and made him unwillingly become the leader of the rebellion. Very soon, the revolt spread throughout northern India. Important Indian leaders of royal families joined the rebellion and started fighting the British in several places. Its leaders included Ahmed Ullah, an advisor of the ex-King of Oudh; Nana Saheb, his nephew Rao Saheb, and his retainers, Tantia Tope and Rani Lakshmibai; the Rani of Jhansi; Kunwar Singh; the Rajput chief of Jagadishpur in Bihar; and Firuz Saha, a relative of the Mughal Emperor, Bahadur Shah. At first, the British were slow to respond, but they later took rapid action with heavy forces and brought their regiments from the Crimean War to India. They also redirected many of the regiments that were going to China to India. The British forces reached Delhi and surrounded the city from July 1 to August 31, 1857. Eventually, street-to-street fighting broke out between the British troops and the Indians. Ultimately, the British took control of Delhi. The massacre at Kanpur (July 1857) and the Siege of Lucknow (June to November 1857) were also critical. == Battle of Gwalior == The last decisive battle was at Gwalior (now in Madhya Pradesh) in June 1858 in which the Rani of Jhansi was killed. A few days later, the British retook the fortress of Gwalior. They had now practically suppressed the rebellion, but some guerrilla fighting in many places continued until early 1859. Tantia Tope was captured and executed in April 1859. ==British reactions == The rebellion was an event of great importance in the front of history of modern India. The British Parliament withdrew the right of the British East India Company to rule India in November 1858. The British started ruling India directly through its representative, Governor General, also called the Viceroy, and formally made India part of the British Empire. The British promised “the Princes, Chiefs, and People of India” equal treatment under British law.Tarling, Nicholas. Nations and States in Southeast Asia. Cambridge: Cambridge University Press. In 1877, Queen Victoria took the title of Empress of India and the Viceroy of India ruled India for her. The British sent Bahadur Shah II, the last Mughal Emperor, out of India and kept him in Rangoon (now called Yangon), in Burma (now called Myanmar), where he died in 1862. The Mughal dynasty, which had ruled India for about 400 years, ended with his death. The British also took many steps to employ members of Indian higher castes and rulers in the government and started to employ Indians in the civil services but only at the lower levels. The British stopped both taking the lands of the remaining princes and rulers of India and interfering in religious matters. They increased the number of British soldiers and banned others from handling artillery. In Britain, newspapers focused on the violence of the mutiny. Charles Dickens wrote that the British should take revenge in his 1857 novella The Perils of Certain English Prisoners. ==ChronologyBrantlinger, Patrick 1990. Rule of Darkness: British Literature and Imperialism, 1830-1914. Ithaca, N.Y.: Cornell University Press. == ;1857 *May – after the mutiny in Meerut (10th), ther revolt starts and later develops into a wider mutiny with outbreaks in Delhi, Ferozepur, Bombay, Aligarh, Mainpuri, Etawah, Bulandshahr, Nasirabad, Bareilly, Moradabad, Shahjahanpur and elsewhere. Sepoys are disarmed in Lahore, Agra, Lucknow, Peshawar and Mardan. The Delhi Field Force advances to Karnaul British Commander-in-Chief of General Anson. *June – Mutinies in Sitapur, Hansi, Hissar, Azamgarh, Gorakhpur and Nimach; in Gwalior, Bharatpur and Jhansi; in Kanpur, followed by the siege of the Europeans (4th-25th) and a massacre; mutiny in Banaras forestalled; mutinies at Jewanpur, Allahabad, Jullundur, Phillaur, Nowgong, Rhoni, Fatehgarh, Aurangabad (Deccan), Fatehpur and Jubbulpore; Indian units are forcibly disarmed at Nagpur and Barrackpore; mutinies at Faizabad, Sultanpur and Lucknow; order is restored in Lucknow but the district remains disturbed (Europeans take shelter in the Residency); British defeat at Chinhat (30rd) near Lucknow; siege of Lucknow begins. Battle of Badli-ki-Serai (8th); Delhi Field Force takes up position on the Ridge and begins operations against Delhi; further spreading of the revolt through the Ganges Plain, Rajputana, and Central India. *July – Mutinies in Indore and Mhow, Augur, Jhelum, Saugor, Sialkot, Dinapur and Agra; siege of the Lucknow Residency continues until July; operations against Delhi continue until July; General Barnard dies after commanding at Delhi (5th); General Havelock's force advances from Allahabad to the relief of Kanpur and arrives on the 17th, one day too late to save those massacred there; disarming of Indian units in Rawalpindi; Sialkot mutineers defeated at Trimmu Ghat (16th) *August – Mutinies at Kolhapur (Bombay Presidency), Poonamallee (near Madras), Jubbulpore, Bhopawar (near Indore), and Mian Mir (near Lahore); rebellion spreads through the Saugor and Narbada districts. Also disarmament of Indian units at Berhampur (1st); siege of the Lucknow Residency continues; Havelock's first attempt at relief fails. *September – Failure of an outbreak in Karachi (14th.); further outbreaks in the Saugor and Narbada districts; siege of Saugor begins; Delhi is assaulted and captured by the British (14th-20th); the Lucknow residency is relieved by Havelock and Outram (25th), but a new siege of the reinforced garrison begins *October – Mutiny at Bhagalpur (near Dinapur); unrest in Bihar, north Bengal and Assam; mutiny in Bombay City is forestalled (15th); revolt in Kotah state (15 Oct.) *November – Sir Colin Campbell relieves Lucknow (17th); the garrison is evacuated and the city and Residency are temporarily abandoned; General Windham is defeated outside Kanpur (28th) *December – Decisive Battle of Kanpur (6th); the armies of Rao Sahib and of Tatya Tope are routed by Sir Colin Campbell; campaign in the Doab; capture of Fatehgarh. ;1858 *January – General Sir Hugh Rose begins the Central India campaign; Sir Colin Campbell begins the campaign to recapture Lucknow *February – General Rose relieves Saugor; Campbell's Army of Oudh assembles on the Kanpur-Lucknow road, awaits Jang Bahadur's Gurkha Army from Nepal *March – Lucknow is recaptured on 21 March; Central India campaign continues *April – Battle of the Betwa; the nearby city of Jhansi is stormed and captured (3-6 April); Azamgarh isrecaptured; advance on Kalpi (25 April); Campbell begins reconquering Rohilkhand; Koer Singh leads a rising in Bihar but is defeated and dies of his wounds *May – Battle of Bareilly, followed by its recapture; Battle of Kunch; recapture of Jagdispur; reoccupation of Kalpi; Battle of Mohamdi (24 May) and end of resistance in Rohilkhand; rebels begin guerrilla war in the jungle; Tatya Tope and the Rani of Jhansi outside Gwalior *June – Gwalior Army deserts to rebels and Tatya Tope; the Rani of Jhansi seize Gwalior; General Rose marches from Kalpi to Gwalior arrive on the 16th; Battle of Kotah-i-Serai on the 17th; Battle of Gwalior on the 18th in which Gwalior fortress is recaptured; guerrilla forces in Oudh, Bihar and along the Nepalese frontier are meanwhile suppressed *July to December – suppression of guerrilla forces except in Rajputana and Central India ;1859 *April – Trial (15th) and execution (18th) of Tatya Tope (Ramachandra Pandurang Tope), the last captured rebel leader; which ended the rebellion == References == === Sources === *Edwardes, Michael (1975) Red Year. London: Sphere Books; pp. 153–55 (events of the rebellion) ===Textbooks and academic monographs=== * . * * . * . * . * . * . * . * . * . * . Category:Wars involving the United Kingdom Category:19th century in India Category:Wars of independence Category:British India Category:Rebellions in Asia Category:1857 in Asia Category:19th-century rebellions Category:Mutinies Category:Resistance to the British Empire Category:Indian independence movement",
 "title": "Indian Rebellion of 1857"
}