{
 "id": "284315",
 "text": "Lavrenty Pavlovich Beria (, Russian: Лаврентий Павлович Берия, born 9 March 1899: Merkheuli, Russian Empire (Georgia or Abkhazia) - 23 December 1953: Moscow, Soviet Union). He was a Georgian-Bolshevik, Soviet politician. Beria was born to a poor family in Georgia and joined the Bolsheviks of Vladimir Lenin in 1917, when he was 18 years old. Beria was leader of the the NKVD, the Soviet secret police from 1938 to1945 and of the MVD from 1946 to 1953. In 1953, after Joseph Stalin's death, Nikita Khrushchev plotted to have Beria executed. == Early life and career == Beria joined the Bolsheviks in 1917, during the Russian Revolution and the Russian Civil War. In 1938, he and Nikolai Yezhov executed the head of the NKVD, Genrikh Yagoda, and Alexey Rykov, a Leninist, during the Great Purge (1936-1938). == Soviet politician == After Vladimir Lenin died in 1924 at age 53, Stalin replaced him, and Beria joined the NKVD, which was led by Felix Dzerzhinsky (1877–1926) and then by Vyacheslav Menzhinsky (1874–1934). On 1 December 1934, Sergei Kirov was killed probably by the NKVD, and the Great Purge followed from 1936 to 1938. In 1939, during the start of World War II, the NKVD was involved in the invasion of Poland. In 1940, Stalin and Beria executed Yezhov and had Ramón Mercader from Spain kill Leo Trotsky in Mexico. A Soviet politician, Beria was the de facto Marshal of the Soviet Union; a state security administrator; and the chief of the Soviet security and secret police apparatus, the NKVD, under Stalin during World War II against Nazi Germany from 1941 to 1945. Beria became a postwar First Deputy Premier from 1946 to 1953. Nearly five years after the war had ended in Asia, and Korea had been liberated from Japan, another began. North Korea, led by Kim Il-Sung, invaded South Korea, led by Syngman Rhee, on June 25, 1950 and started the Korean War. Stalin's Eastern Bloc (East Germany, Czechoslovakia,Poland, Hungary, Romania, and Bulgaria), along with Mongolia, led by Khroloogiin Choibalsan, and China, led by Mao Zedong, helped North Korea. Beria administered vast sections of the Soviet state. He commanded the NKVD field units responsible for anti-partisan operations on the Eastern Front during World War II. His troops also were a barrier against thousands of \"turncoats, deserters, cowards and suspected malingerers.\" Beria administered the vast expansion of the gulag labor camps. He was responsible for overseeing the secret defense institutions known as sharashkas, which were critical to the war effort. Beria also played the decisive role in coordinating the Soviet partisans, who developed an impressive intelligence and sabotage network behind German lines. He attended the Yalta Conference with Stalin, who introduced him to U.S. President Franklin D. Roosevelt as \"our Himmler.\" After the war, Beria helped to organize the communist takeover of Central and Eastern Europe. Beria's uncompromising ruthlessness in his duties and skill at producing results led to him overseeing the Soviet atomic bomb project. Stalin gave absolute priority to the project, an achievement that was completed in less than five years. That was helped by Beria's NKVD organizing Soviet espionage against the Western Bloc. Stalin died of a stroke on March 5, 1953 at the age of 74. Beria, along with Vyacheslav Molotov and Georgy Malenkov, tried to replace Stalin. Beria was promoted to First Deputy Premier, where he carried out a brief campaign of liberalization. He was briefly a part of the ruling \"troika,\" along with Malenkov and Molotov. Beria's overconfidence in his position after Stalin's death led him to misjudge other Politburo members. == Downfall == There was a coup d'état, led by Nikita Khrushchev, along with the military forces of Marshal Georgy Zhukov. Beria was arrested on charges of treason on June 26, 1953, during a meeting in which the full Politburo condemned him, all of which had been planned by Khrushchev.Beria, Sergo 2003. Beria, My Father: Inside Stalin's Kremlin. London: Duckworth. ISBN 0715632051Knight, Amy 1996. Beria: Stalin's First Lieutenant. Princeton University Press. ISBN 0-691-03257-2 The NKVD was powerless because Zhukov's troops were there. After his interrogation, Beria was taken to the basement of the Lubyanka and shot on December 23, as were six of his associates.Wittlin, Thaddeus 1972. Commissar: the life and death of Lavrenty Pavlovich Beria. New York: Macmillan. OCLC 462215687.Yakovlev A.N. Naumov V. and Sigachev Y. 1999. (eds) Lavrenty Beria, 1953. Stenographic Report of July's Plenary Meeting of the Central Committee of the Communist Party of the Soviet Union and other documents, International Democracy Foundation, Moscow, 1999 (in Russian). ISBN 5-89511-006-1 Numerous allegations arose of Beria being a serial killer for murdering men, women, and children. == References == Category:1899 births Category:1953 deaths Category:Directors of Soviet intelligence agencies Category:Marshals of the Soviet Union Category:People executed by firearm Category:Politicians from Georgia (country)",
 "title": "Lavrenty Beria"
}