{
 "id": "284313",
 "text": "Georgy Maximilianovich Malenkov ( trans : Georgiy Maksimilianovich Malenkov) (8 January 1902 – 14 January 1988) was a Soviet politician who was the third leader of the Soviet Union and the fifth premier of the Soviet Union from 1953 to 1955. However, just over a week later, he was forced to give up most of his power, but then remained the leader and premier of the country. He subsequently went on a power struggle with the party's First Secretary Nikita Khrushchev. Malenkov was eventually removed from his posts in 1955. He was involved in World War II when Nazi Germany lead by Adolf Hitler carried out the Nazi Invasion of Russia. Malenkov was also involved in the Korean War just 5 years after World War II when Hitler and Mussolini both died in April 1945 and after Hirohito surrendered Japan in August 1945. Malenkov formed a team with Nikolai Bulganin, Vyacheslav Molotov, and Lazar Kaganovich, and together they tried to throw Khrushchev out of power. He eventually won the battle for power, and in 1957 Malenkov was forced to leave his position in the Party Politburo. In 1961, he was kicked out of the Party and forced to move to Kazakhstan. Along with Khrushchev, Malenkov was one of a few important members of Stalin's group of partners (called the \"inner circle\") who died a natural death, and was not executed. Together with Lavrentiy Beria and Khrushchev, Malenkov began the process of de-Stalinisation, the process began as soon as Stalin died in 1953 and ended in 1961. ==Career== On 23 December 1953, just months after Joseph Stalin died on 5 March 1953, Malenkov along with Nikita Khrushchev and Georgy Zhukov and other soviet officials executed Lavrentiy Beria in late 1953 who was the NKVD chief from 1938-1946 and the MVD from 1946-1953. In February 1955, Georgy Malenkov was replaced by Nikita Khrushchev. Malenkov died in 1988, 33 years after being replaced by Khrushchev in 1955 and 3 years after Mikhail Gorbachev came to power in 1985. == References == Category:Heads of government of the Soviet Union Category:1902 births Category:1988 deaths Category:Recipients of the Order of Lenin Category:General Secretaries of the Communist Party of the Soviet Union",
 "title": "Georgy Malenkov"
}