{
 "id": "284408",
 "text": "Paul di Resta (born April 16, 1986 in Livingston West Lothian) is a Scottish auto racing driver. He made his Formula One debut in the Australian Grand Prix with the Force India, finishing in the points with a 10th place finish. == Career == === Karting === Di Resta started his career in karting. He raced in several series of karts from 1994 until 2002. In 2001 he won the British JICA Championship. === Formula Renault === Di Resta moved up to single-seaters at the end of 2002. he competed in the British Formula Renault Winter Series. He raced full-time in 2003 with the Eurotek Motorsport team. Di Resta finished seventh in the standings with one race win. He switched to Manor Motorsport for 2004, and finished third in the championship with four wins. Di Resta also entered some races of Eurocup Formula Renault 2.0 with the Manor team. He also won the prestigious McLaren Autosport BRDC Young Driver of The Year Award in 2004. The award had been won by his cousin Dario Franchitti in 1992. === Formula Three === Di Resta moved to the Formula Three Euroseries with Manor Motorsport in 2005, and finished tenth in the standings. For 2006 he moved to the ASM Formule 3 team. He won the championship with five wins. He beat his team mate, future Formula One World Drivers Champion, Sebastian Vettel. Di Resta also won the 2006 BP Ultimate Masters at Circuit Park Zandvoort. === DTM === In 2007, di Resta switched from single-seaters to race in the Deutsche Tourenwagen Masters (DTM) touring car racing series for Mercedes. He finished fifth in the championship. Di Resta was the highest driver in the standings to drive a non-2007 car. His performance earned him a 2008 Mercedes C-Class for the 2008 season. Di Resta finished second in the 2008 championship, winning two races. In 2009, he finished third overall. In 2010, he won three races in a row on the way to winning the DTM championship. === Formula One === Di Resta has tested for the McLaren Formula One team in 2009. In December 2009, di Resta took part in a test with the Force India at the Jerez circuit. On February 2, Force India announced they signed di Resta at their reserve driver. ==== Force India (2011–) ==== On 26 January 2011 it was confirmed that di Resta will join Adrian Sutil at the Force India team for the season. He will replace Vitantonio Liuzzi, and Nico Hülkenberg will replace di Resta as the reserve driver. === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 2003 Formula Renault UK Eurotek Motorsport 17 1 2 1 2 233 7th 2003 Formula Renault UK Team JVA 17 1 2 1 2 233 7th 2004 Formula Renault UK Manor Motorsport 20 4 4 2 9 415 3rd 2004 Formula Renault 2000 Eurocup Manor Motorsport 3 0 0 0 1 0 NC† 2004 Bahrain Superprix Manor Motorsport 1 0 0 0 0 N/A NC 2005 Formula Three Euroseries Manor Motorsport 19 0 3 2 1 32 10th 2005 Masters of Formula 3 Manor Motorsport 1 0 0 0 0 N/A 4th 2006 Formula Three Euroseries ASM Formule 3 20 5 5 1 9 86 1st 2006 Masters of Formula 3 ASM Formule 3 1 0 0 0 0 N/A 1st 2006 Macau Grand Prix ASM Formule 3 1 0 0 0 0 N/A NC 2007 Deutsche Tourenwagen Masters Persson Motorsport 10 0 0 0 4 32 5th 2008 Deutsche Tourenwagen Masters HWA Team 11 2 1 4 7 71 2nd 2009 Deutsche Tourenwagen Masters HWA Team 10 1 1 2 3 45 3rd 2010 Deutsche Tourenwagen Masters HWA Team 11 3 3 1 7 71 1st 2010 Formula One Force India Formula One Team Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2011 Formula One Force India F1 Team 11 0 0 0 0 8* 16th* Season in progress. – As di Resta was a guest driver, he was ineligible to score points. === Complete Formula Three Euroseries record === (key) Season Team 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Pos Points 2005 Manor Motorsport HOC 1 Ret HOC 2 17 PAU 1 14 PAU 2 DNS SPA 1 DSQ SPA 2 5 MCO 1 8 MCO 2 6 OSC 1 4 OSC 2 4 NOR 1 3 NOR 2 8 NÜR 1 23 NÜR 2 Ret ZAN 1 14 ZAN 2 5 LAU 1 Ret LAU 2 DSQ HOC 1 Ret HOC 2 DSQ 10th 32 2006 ASM Formule 3 HOC 1 3 HOC 2 Ret LAU 1 2 LAU 2 3 OSC 1 1 OSC 2 14 BRH 1 1 BRH 2 5 NOR 1 1 NOR 2 18 NÜR 1 2 NÜR 2 13 ZAN 1 1 ZAN 2 14 CAT 1 10 CAT 2 6 BUG 1 1 BUG 2 6 HOC 1 Ret HOC 2 6 1st 86 === Complete DTM results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Season Team Car 1 2 3 4 5 6 7 8 9 10 11 Pos. Points 2007 Persson Motorsport AMG-Mercedes C-Class 2005 HOC1 5 OSC 2 LAU 2 BRH Ret NOR 15 MUG 3 ZAN 14 NÜR 6 CAT 3 HOC2 8 5th 32 2008 HWA Team AMG-Mercedes C-Class 2008 HOC1 13 OSC 4 MUG 2 LAU 1 NOR 5 ZAN 7 NÜR 2 BRH 2 CAT 1 BUG 2 HOC2 2 2nd 71 2009 HWA Team AMG-Mercedes C-Class 2009 HOC1 5 LAU 4 NOR 7 ZAN 6 OSC 4 NÜR Ret BRH 1 CAT 7 DIJ 2 HOC2 3 3rd 45 2010 HWA Team AMG-Mercedes C-Class 2009 HOC1 4 VAL 5 LAU 2 NOR 10 NÜR 2 ZAN 2 BRH 1 OSC 1 HOC2 1 ADR 9 SHA 2 1st 71 === Complete Formula One results === (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 WDC Points 2010 Force India F1 Team Force India Force India VJM03 Mercedes FO 108X 2.4 V8 BHR AUS TD MAL TD CHN TD ESP TD MON TUR CAN EUR TD GBR TD GER HUN TD BEL ITA TD SIN JPN KOR BRA ABU – – 2011 Force India F1 Team Force India Force India VJM04 Mercedes FO 108Y 2.4 V8 BEL ITA SIN JPN KOR IND ABU BRA 16th* 8* Season in progress. == Personal life == Di Resta, who grew up in Uphall West Lothian. He is the cousin of fellow racing drivers Dario Franchitti and Marino Franchitti. In February 2010, di Resta was made a director of his family's leisure firm, which owns several establishments in West Lothian. == References == == Other websites == * Paul di Resta career statistics at Driver Database * Official website Category:1986 births Category:Living people Category:British Formula One drivers Category:Scottish racecar drivers Category:Formula One current Category:Sportspeople from West Lothian",
 "title": "Paul di Resta"
}