{
 "id": "284504",
 "text": "The economy of the USA grew quickly in the 1920s. This growth in the 1920s had a positive effect on the USA in later years. The country's main commercial rivals had been devastated by WWI which was fought almost entirely in Europe. Germany, Britain, France, and the Low Countries were all economically weakened. == Natural resources and a growing population == The USA has many natural resources. For example, there is oil in Texas, coal in the Appalachian Mountains, and ranching in the Midwest and Great Plains. This meant there was no need to buy natural resources from other countries. Moreover the population of the USA was growing fast, so making a market for natural resources inside the USA. Below is a table in which the population growth in millions is shown in the 40 years after the 1920s:Source 3.4, Page 59, GCSE Modern World History Second Edition - Ben Walsh 1880 1890 1890 1910 1920 50.2 62.9 75.9 91.9 105.7 Below is a table which shows the urban growth in the six largest cities by population, in 1870 and 1910:Source 3.6, Page 59, GCSE Modern World History Second Edition - Ben Walsh U.S. Cities 1870 Population 1910 Population New York 942,292 4,766,883 Philadelphia 674,027 1,549,009 Chicago 298,977 2,185,283 St Louis 310,864 687,029 Baltimore 267,354 558,485 Boston 250,526 670,585 == The First World War == During the First World War, the USA was selling metal to Britain and France, and also weapons. The USA made a lot of money from this. Also, the USA took over Europe's international trade and became the world leader in manufacturing of chemical, explosives, and plastics. This was good for the US economy. However, the Spanish flu was worldwide, and affected all countries. === Spanish flu === The Spanish flu pandemic lasted from 1918 to 1920.Andrew Price-Smith 2009. Contagion and chaos. Cambridge, MA: MIT Press, 2009 It killed between 17 million and 100 million people. Symptoms in 1918 were so unusual that initially influenza was misdiagnosed as dengue, cholera, or typhoid. One observer wrote \"One of the most striking of the complications was haemorhage from mucous membranes, especially from the nose, stomach, and intestine\". Most deaths were from bacterial pneumonia, a secondary infection caused by influenza. The virus also killed people directly. It caused hemorrhages and oedema in the lungs. The Spanish flu pandemic was truly global, spreading even to the Arctic and remote Pacific islands. The unusually severe disease killed between 10 and 20% of those infected, as opposed to the more usual flu epidemic mortality rate of 0.1%. ==Republican Party Policies== The Republican Party at the time had policies which were very useful for a large economic growth: 1\\. The Republicans had a 'laissez-faire' way of thinking, which meant that the government would not stand in the way of people's lives and businesses. The Republican Party believed that this would create much profit, and it did. 2\\. The Republicans made 'tariffs', which meant that it cost a lot of money to buy products from other countries. This protected American businessmen from foreign competition. This also made the American people buy American-made products. 3\\. The Republicans lowered taxes, which was good for normal people, and even better for rich people. The Republican Party believed that low taxes would make people keep their money and spend it on American-made products and put money into American industries. 4\\. The Republicans allowed 'trusts'. Trusts were very large corporations, or businesses, which controlled almost all of a certain industry. Many people did not like these trusts as they did not want one corporation to control an entire industry, but the Republican Party said that a corporation would do business better than a politician. These trusts were very important in causing this economic growth. There were also problems with the policies. During the 1920s, much of the wealth in the United States was controlled by only a few people. Also, farmers and other people who worked in the business of farming found it very difficult to make money and were therefore very poor. == New industries, new methods == There were new industries, and new ways of managing industries. For example, products such as telephones, radios, vacuum cleaners, washing machines, and others were being made on a large scale, at an affordable price. Effective advertising was also invented for many products. One large industry in the 1920s was the motorcar industry. They was made on a production line, which was a relatively new idea at the time. The idea was first developed in the steel industry, and adopted by Henry Ford for his car industry. By the year 1929, 4.8 million cars had been made. Hoover (vacuum cleaners) became a household name. The biggest growth was in radios. In 1920, there were 60,000 radios sold. By 1929, it was 10 million. The 20s decade saw the large-scale development and use of automobiles, telephones, films, radio, and electrical appliances in the lives of millions in the United States. Most of Western Europe followed these events, but their economies were so damaged by WWI. It was many years (in effect, the 1960s and 70s) before ordinary people got telephones in their own homes. == The American way of life == At the time, most Americans believed that they deserved success. For example; a nice house, a good job, plenty to eat, and many consumer goods. The act of 'consuming' was seen as very American, this had a huge impact on powering economic growth in the 1920s. == References == * GCSE Modern World History Second Edition - Ben Walsh Category:1920s in the United States Category:Economy of the United States",
 "title": "Economy of the United States in the 1920s"
}