{
 "id": "284597",
 "text": "Prince Al-Waleed bin Talal bin Abdulaziz Al Saud (; born 30 July 1954) is a member of the Saudi Royal Family. He is the nephew of the Saudi Arabian King Abdullah. An entrepreneur and international investor but without real political power within the House of Saud or in Saudi Arabia, he has amassed a fortune through investments in real estate and the stock market.As of March 2010, his net worth is estimated at US$19.4 billion, up from $13.3 billion, according to Forbes, making him the 19th richest person in the world on their list published in March 2010.Forbes topic page on Prince Alwaleed Retrieved March 2010 He has been nicknamed by Time magazine as the Arabian Warren Buffett. Talal bought the super yacht Kingdom5KR. It had been owned by Donald Trump and called the \"Trump Princess\". The yacht, built in 1979, was used in the James Bond movie, Never Say Never Again. It has 11 cabins, can take 22 guests and has a crew of 31. On 4 November 2017, he was arrested in Saudi Arabia, in an anti-corruption raid, together with, among others, Waleed bin Ibrahim Al Ibrahim and Saleh Abdullah Kamel.Alwaleed bin Talal, two other billionaires tycoons among Saudi arrests, 4 November, Daily Sabah Al-Waleed was released from detention on 27 January 2018, following a financial settlement of some kind, after nearly three months in detention.Ben Hubbard, Billionaire Saudi Prince, Alwaleed bin Talal, Is Freed From Detention , The New York Times (27 January 2017). In March 2018 he was dropped from the World's Billionaires list due to lack of current information. ==Early life and education== Al-Waleed was born in Jeddah on 30 July 1954 to Prince Talal bin Abdul-Aziz, long-time-known as The Red Prince, and Mona Al Solh, daughter of Riad Al Solh (Lebanon's first prime minister). == Honours == === Saudi Arabian national honours === Ribbon bar Honour Member 1st Class of the Order of Abdulaziz Al Saud ===Foreign honors=== Ribbon bar Country Honour Member 1st Class of the Khalifiyyeh Order of Bahrain Grand Officer of the National Order of Benin Member 1st Class of the Family Order of Laila Utama Member 1st Class of the Order of the Balkan Mountains Commander of the National Order of Burkina Faso Grand Cross of the National Order of the Republic of Burundi Grand Officier of the National Order of Chad 70px Commander of the Star Anjouan Grand Cross of the National Order of Merit of Central African Republic Grand Cordon of the National Order of the Star of Djibouti Commander of the Legion of Honour Grand Cross of the National Order of Merit of Gabon Grand Commander of the Order of the Republic of The Gambia Companion of the Order of the Volta Commander of the National Order of Merit of Guinea Grand Cross of the Order of Independence Grand Cordon of the Order of the Star of Jordan 70px Grand Cross of the National Order of the Ivory Coast Grand Cordon of the Chief of the Order of the Golden Heart of Kenya Grand Officer of the National Order of the Cedar Grand Cordon of the Order of the Star of Africa Grand Cross of the National Order of Madagascar Commander of the National Order of Merit of Mauritania Grand Cordon of the Order of the Distinguished Rule of Izzuddin Grand Officier of the National Order of Mali Companions of the National Order of Merit (Malta) Grand Officier of the Order of Grimaldi 70px Grand Cordon of the Order of Ouissam Alaouite Officier of the Order of Orange-Nassau Grand Cordon of the National Order of Merit of Niger Second Class of Nishan-e- Pakistan Grand Officier of Order of Sikatuna Grand Officier of the National Order of the Lion Grand Gordon of the Order of the Republic (Sierra Leone) Sungnye Medal of the Order of Diplomatic Service Merit Grand Cordon of the Republic of the Sudan Member 1st Class of the Order of the Umayyads Grand Cordon of the Order of Brilliant Star Grand Officier of the Order of Mono Grand Officier of the Order of the Republic Medal of the Friendship Order Companion of the Most Excellent Order of the Pearl of Africa ==Personal life== Al-Waleed has been married four times.Royal Saudi couple’s divorce is 'amicable' Richard Johnson. Page Six. NYPost.com 20 November 2013. Retrieved 13 December 2015 ==References== ==Further reading== * John Rossant, The Prince: A Biography of Prince Alwaleed Bin Talal (HarperCollins, 2001) * Riz Khan, Alwaleed: Businessman, Billionaire, Prince (HarperCollins, 2005) Category:Saudi princes and princesses Category:1954 births Category:Living people",
 "title": "Al Waleed bin Talal Al Saud"
}