{
 "id": "284660",
 "text": "Benjamin S. \"Ben\" Carson, Sr (born September 18, 1951) is an American neurosurgeon and politician. A member of the Republican Party, he was the 17th United States Secretary of Housing and Urban Development from 2017 to 2021. After graduating from Yale University, Carson went to University of Michigan Medical School, and was later accepted to Johns Hopkins University. In 2008, Carson was awarded the Presidential Medal of Freedom from George W. Bush. He was the Director of Pediatric Neurosurgery at Johns Hopkins Hospital. He is known for, among other accomplishments, being the first doctor to separate twins that were joined together at the head. ==Early life== Carson was born in Detroit, Michigan to Sonya Copeland and Robert Carson. He studied at Yale University and at the University of Michigan. ==Medical career== Carson was a professor of neurosurgery, oncology, plastic surgery, and pediatrics, and he was the director of pediatric neurosurgery at Johns Hopkins Hospital. At 33, he became the youngest major division director in the hospital's history as director of pediatric neurosurgery. He was also a co-director of the Johns Hopkins Craniofacial Center. He was the first surgeon to successfully separate conjoined twins joined at the head. In 2008 he was awarded the Presidential Medal of Freedom by President George W. Bush. After delivering a widely publicized speech at the 2013 National Prayer Breakfast, he became a popular conservative figure in political media for his views on social and political issues. In March 2013, Carson announced he would retire as a surgeon, stating \"I'd much rather quit when I'm at the top of my game\". His retirement became official on July 1, 2013. ==2016 presidential campaign== Carson ran for the Republican nomination for President of the United States in the 2016 election. On March 2 following the 2016 Super Tuesday primaries, Carson announced that while he was not suspending his campaign he \"did not see a 'path forward'\" and would not attend the next Republican debate in Detroit. On March 4, 2016, Carson suspended his presidential campaign. He later endorsed Donald Trump. ==United States Secretary of Housing and Urban Development (2017-2021)== On December 5, 2016, Donald Trump nominated Carson for the job of United States Secretary of Housing and Urban Development. On March 2, 2017, Carson was confirmed by the United States Senate in a 58–41 vote. ==Personal life== Carson married Candy Carson in 1975. They have three children. He is a member of the Seventh-day Adventist Church. ==References== ==Other websites== * Carson for President campaign website ** In Depth interview with Carson, August 4, 2013 Category:1951 births Category:Living people Category:African- American politicians Category:American surgeons Category:American Protestants Category:Politicians from Detroit Category:Politicians from Florida Category:Politicians from Baltimore Category:Politicians from Michigan Category:Scientists from Detroit Category:Scientists from Maryland Category:Seventh-day Adventists Category:2016 United States presidential candidates Category:United States Secretaries of Housing and Urban Development Category:Republican Party (United States) politicians Category:Yale University alumni Category:Neurosurgeons",
 "title": "Ben Carson"
}