{
 "id": "284692",
 "text": "Daniel Clement Dennett III (March 28, 1942 - April 19, 2024) was an American philosopher, neuroscientist, and cognitive scientist. He was also an atheist. Dennett was born in Boston, Massachusetts. His scientific works focused in evolutionary biology and cognitive science.Beardsley, T. (1996) Profile: Daniel C. Dennett – Dennett's Dangerous Idea, Scientific American 274(2), 34–35. Dennett graduated from Phillips Exeter Academy in 1959. He spent one year at Wesleyan University before receiving his Bachelor of Arts in philosophy at Harvard University in 1963. In 1965, he received his Doctor of Philosophy in philosophy at the University of Oxford. He taught at the University of California, Irvine, from 1965 to 1971, before moving to Tufts University. He was the co-director of the Center for Cognitive Studies and the Austin B. Fletcher Professor of Philosophy at Tufts University in Massachusetts. Dennett was a member of the editorial board for The Rutherford Journal and a co-founder of The Clergy Project. His best known written works were Consciousness Explained (1991), Darwin's Dangerous Idea (1995) and Breaking the Spell (2006). He was called one of the leading members of New Atheism, along with Richard Dawkins, Sam Harris, and Christopher Hitchens. He was married to Susan Bell from 1962 until his death. They had two children. He was an avid sailor. Dennett died on April 19, 2024 at a hospital in Portland, Maine from problems caused by lung disease at the age of 82. ==More readings== * John Brockman (1995). The Third Culture. New York: Simon & Schuster. (Discusses Dennett and others). * Andrew Brook and Don Ross (editors) (2000). Daniel Dennett. New York: Cambridge University Press. * Daniel C. Dennett (1997), \"Chapter 3. True Believers: The Intentional Strategy and Why it Works\", in John Haugeland, Mind Design II: Philosophy, Psychology, Artificial Intelligence. Massachusetts: Massachusetts Institute of Technology. (reprint of 1981 publication). * Matthew Elton (2003). Dennett: Reconciling Science and Our Self-Conception. Cambridge, UK Polity Press. * P.M.S. Hacker and M.R. Bennett (2003) Philosophical Foundations of Neuroscience. Oxford, and Malden, Mass: Blackwell (Has an appendix devoted to a strong critique of Dennett's philosophy of mind) * Don Ross, Andrew Brook and David Thompson (editors) (2000) Dennett's Philosophy: A Comprehensive Assessment Cambridge, Massachusetts: MIT Press. * John Symons (2000) On Dennett. Belmont, CA: Wadsworth Publishing Company. ==References== Category:1942 births Category:2024 deaths Category:20th-century American philosophers Category:21st-century American philosophers Category:American atheists Category:Writers from Boston Category:Scientists from Boston Category:Skeptics Category:Educators from Boston Category:American sailors Category:Deaths from lung disease",
 "title": "Daniel Dennett"
}