{
 "id": "284729",
 "text": "Carol Elaine Channing (January 31, 1921 - January 15, 2019) was an American stand-up comedian, actress, singer, dancer and voice artist. She received three Tony Awards. Channing played Lorelei in the Broadway musical Gentlemen Prefer Blondes and played Dolly in the Broadway musical Hello, Dolly!. ==Early life== Channing was born Carol Elaine Channing in Seattle, Washington on January 31, 1921. When she left home to go to Bennington College, her mother told her that her father's mother was African-American.Just Lucky I Guess: A Memoir of Sorts by Carol Channing (Simon & Schuster, 2002) ==Death== Channing died on January 15, 2019, of complications from a stroke at her home in Rancho Mirage, California, sixteen days before her 98th birthday.Wild, Stephanie. \"The Legendary Carol Channing Dies at 97\" broadwayworld.com, January 15, 2019\"Carol Channing Dead 'Hello Dolly' 'Gentlemen Prefer Blondes' Star was 97\" hollywoodreporter.com, January 15, 2019 ==Awards and nominations== Year Award Category Work Result 1956 Tony Award Best Actress in a Musical The Vamp 1961 Tony Award Best Actress in a Musical Show Girl 1964 Tony Award Best Actress in a Musical Hello, Dolly! 1968 Academy Awards Best Supporting Actress Thoroughly Modern Millie 1968 Golden Globes Best Supporting Actress - Motion Picture Thoroughly Modern Millie 1968 Tony Award Special Award Special Award 1974 Tony Award Best Actress in a Musical Lorelei 1979 Olivier Award Best Actress in a Musical Hello, Dolly! 1995 Tony Award Lifetime Achievement Award\"Curtain Up\", The Baltimore Sun, June 5, 1995 p. 38 1996 Drama Critics Circle Lifetime Achievement Award\"Awards: 'Folly,' 'Captivity,' 'Wit' Honored\", Los Angeles Times, March 20, 1996 2002 Grammy Awards Grammy Hall of Fame Hello, Dolly! Original Broadway Cast Recording 2002 Tony Awards (West) Lifetime Achievement Award\"Tony Awards West\", Los Angeles Times, June 9, 2002 Benefit for Aids and Actors' Fund ==References== ==Other websites== * * * Category:1921 births Category:2019 deaths Category:Deaths from stroke Category:American movie actors Category:American dancers Category:American LGBT rights activists Category:Singers from Seattle Category:American stage actors Category:American television actors Category:American voice actors Category:Comedians from Seattle Category:Actors from Seattle Category:Golden Globe Award winning actors Category:Tony Award winning actors",
 "title": "Carol Channing"
}