{
 "id": "284899",
 "text": "Mira Sorvino (born September 28, 1967) is an American actress. She received an Academy Award for \"Best Supporting Actress\" for her role in the 1995 movie Mighty Aphrodite. She starred in many other Hollywood movies. More recently she has been starring in low budget or independent movies. She is the daughter of actor Paul Sorvino. == Personal life == Sorvino and actor Christopher Backus were married June 11, 2004. The couple have four children. Their daughters are Mattea Angel (born 2004) and Lucia (born 2012). Their sons are Johnny Christopher King (born 2006) and Holden Paul Terry Backus (born 2009). == Filmography == Year Title Role Notes 1992 Swans Crossing Sophia Eva McCormick De Castro 4 episodes 1993 The Obit Writer 1993 Amongst Friends Laura 1993 Nyû Yôku no koppu Maria 1994 Parallel Lives Matty Derosa 1994 Quiz Show Sandra Goodwin 1994 Barcelona Marta Ferrer 1994 The Dutch Master Teresa 1995 Mighty Aphrodite Linda Ash Academy Award for Best Supporting Actress Broadcast Film Critics Association Award for Best Supporting Actress Chlotrudis Award for Best Supporting Actress Dallas-Fort Worth Film Critics Association Award for Best Supporting Actress Golden Globe Award for Best Supporting Actress - Motion Picture National Board of Review Award for Best Supporting Actress New York Film Critics Circle Award for Best Supporting Actress Southeastern Film Critics Association Award for Best Supporting Actress Nominated — BAFTA Award for Best Actress in a Supporting Role Nominated — Chicago Film Critics Association Award for Best Supporting Actress Nominated — Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role 1995 Blue in the Face Young Lady 1995 The Buccaneers Conchita Closson 1996 Norma Jean & Marilyn Marilyn Monroe Nominated — Primetime Emmy Award for Outstanding Lead Actress - Miniseries or a Movie Nominated — Golden Globe Award for Best Actress – Miniseries or Television Film 1996 Beautiful Girls Sharon Cassidy 1996 Tales of Erotica Teresa Segment \"The Dutch Master\" 1996 Sweet Nothing Monika 1996 Tarantella Diane 1997 Romy and Michele's High School Reunion Romy White Nominated — MTV Movie Award for Best Dance Sequence 1997 Mimic Dr. Susan Tyler Nominated — Saturn Award for Best Actress 1998 The Replacement Killers Meg Coburn 1998 Lulu on the Bridge Celia Burns 1998 Too Tired to Die Death/Jean 1998 Free Money Agent Karen Polarski 1999 At First Sight Amy Benic 1999 Summer of Sam Dionna 2000 The Great Gatsby Daisy Buchanan 2001 The Grey Zone Dina 2001 The Triumph of Love The Princess/Phocion/Aspasie 2002 WiseGirls Meg Kennedy 2002 Semana santa Maria Delgado 2003 Will & Grace Diane Episode \"Last Ex To Brooklyn\" 2003 Gods and Generals Fanny Chamberlain 2004 The Final Cut Delila 2005 Human Trafficking Kate Morozov Nominated — Golden Globe Award for Best Actress – Miniseries or Television Film 2006 Covert One: The Hades Factor Rachel Russell 2007 Reservation Road Ruth 2008 House Dr. Cate Milton Episode \"Frozen\" 2009 The Last Templar Tess Chaykin 2009 Multiple Sarcasms Cari 2009 Like Dandelion Dust Wendy Porter New York VisionFest Award for Acting - Female Lead Sonoma Valley Film Festival Award for Best Actress San Diego Film Festival Award for Best Actress 2009 The Trouble with Cali The Balletmaster 2009 Sweet Flame Sheila 2009 Attack on Leningrad Kate Davis 2010 The Presence'' The Woman 2012 Union Square Lucy 2012 Perfect Sisters Linda 2012 Smitty Amanda 2012 Trade of Innocents Claire Becker == References == == Other websites == * Category:1967 births Category:Living people Category:American movie actors Category:American television actors Category:Actors from New Jersey Category:American Academy Award winning actors Category:Golden Globe Award winning actors",
 "title": "Mira Sorvino"
}