{
 "id": "284955",
 "text": "Lead poisoning is a condition where there is too much lead in the body. Lead interferes with many processes. It is toxic to many organs and tissues, including the bones and brain. The half-life of lead in these tissues is measured in weeks for blood, months for soft tissues, and years for bone. Lead in the bones, teeth, hair, and nails is bound tightly and not available to other tissues, and is generally thought not to be harmful. In adults, 94% of absorbed lead ends up in the bones and teeth, but children only store 70% in this way, a fact which may partially account for the more serious health effects on children. In 2013, lead is believed to have resulted in 853,000 deaths worldwide == Causes == The risk of lead poisoning is very small in developed countries. However, lead might be used in paints, petrol or food containers in some countries where it might be legal, such as in developing countries. Other ways a person can be exposed is from: * lead pipes * a lead water tank * pipework with lead fittings Causing the water supply to be contaminated. ==Symptoms== Symptoms of lead poisoning include coughing, fatigue, and severe dehydration. Exposure to lead can be harmful especially to unborn babies and young children. Infants and young children absorb a bigger percentage of lead from sources than adults. The signs and symptoms in young children can include: * irritability and fatigue * loss of appetite and weight loss * abdominal pain * vomiting * constipation * hearing loss * developmental delay and learning difficulties Although children are at increased risk of the effects of lead poisoning, exposure can also result in illness in adults. Symptoms in adults can include: * high blood pressure * abdominal pain * constipation * joint and muscle pain * pain, numbness or tingling of the extremities (like the fingers and toes) * headache * miscarriage or premature birth in pregnant women * fatigue * memory loss ==Treatment== Treatment of the condition is usually to remove the source of lead. Animals sometimes from lead poisoning. Mostly, children are at risk for this condition. ==References == Category:Toxicology",
 "title": "Lead poisoning"
}