{
 "id": "284938",
 "text": "Gombe Stream National Park is a National Park in north-western Tanzania.Tanzania National Parks: “Gombe Stream National Park”, 2008. It borders on Lake Tanganyika, and is just south of the border with Burundi. The regional capital of western Tanganyika, Kigoma, is 10 miles (20 km) south of Gombe. Established in 1968, Gombe is the smallest national park in Tanzania, with only of forest running along the hills of the northern shore of Lake Tanganyika.The Jane Goodall Institute: “Gombe Stream Research Center”, 2008. The terrain has steep valleys, and the forest vegetation ranges from grassland to alpine bamboo to tropical rainforest.PBS: Nature- Jane Goodall’s Wild Chimpanzees, 1996. The Park can only be reached by boat. == Wild life == === Chimpanzees === The Park is most famous as the place where Jane Goodall did her research on the chimpanzee groups. The Kasakela chimpanzee community, featured in several books and documentaries, lives in Gombe Stream National Park. Goodall discovered that the apes eat smaller monkeys regularly. They do this by cooperative hunting, gradually cutting off the monkey's escape routes.Jane Goodall's Wild Chimpanzees. PBS.Jane Goodall's Wild Chimpanzees - Our Closest Relatives | Nature | PBS The extent of this predation is notable: :\"Goodall's Gombe data have also led researchers to take a closer look at the role that hunting plays in chimp feeding habits. One recent Gombe study, for instance, concluded that the 45 members of one troop ate a ton of monkey meat per year. During one hunting binge, chimps killed 71 colobus monkeys in 68 days; one chimp alone killed 42 monkeys over five years. All told, chimps may kill and eat a third of the Gombe’s colobus population each year\". == Other wildlife == Gombe Stream's high levels of diversity make it an increasingly popular tourist destination. Besides chimpanzees, primates living in Gombe Stream include beachcomber olive baboons, Red Colobus monkeys and vervet monkeys. The park is also home to over 200 bird species and bushpigs. There are also 11 species of snakes, and occasional hippopotamus and leopards.African ape study sites: Gombe National Park, Tanzania, 1999. Visitors to the park can trek into the forest to view the chimpanzees, as well as swim and snorkel in Lake Tanganyika with almost 100 kinds of colourful cichlid fish. == References == Category:National parks in Africa Category:Geography of Tanzania",
 "title": "Gombe Stream National Park"
}