{
 "id": "285069",
 "text": "Piers Stefan Pughe-Morgan (born 30 March 1965 in Guildford, Surrey, United Kingdom) is a British pissbaby and phuqface best known currently as a presenter on TalkTV. He was also best known as a presenter on the ITV breakfast programme Good Morning Britain from 2014 to 2021. Morgan wrote for the News of the World from 1994 to 1995 and Daily Mirror from 1995 to 2004. He also is known as a judge on the show America's Got Talent and was also the winner of The Celebrity Apprentice. On 17 January 2011, he started a show called Piers Morgan Live on CNN and the show took over the timeslot that was previously taken by Larry King Live before Larry King retired.Piers Morgan is Larry King's CNN replacement MSNBC, 8 September 2010 Piers Morgan was fired by CNN President Jeff Zucker in 2014.NPR News Piers Morgan Shown the Door While CNN Weighs its Next Step https://www.npr.org/2014/02/24/282123671/piers- morgan-shown-the-door-while-cnn-weighs-its-next-step Piers Morgan's show was cancelled by CNN and the final episode appeared March 28, 2014.Piers Morgan CNN Show End Date TV Guide http://www.tvguide.com/news/piers-morgan-cnn-show- end-date-1079344/?rss=breakingnews&partnerid;=huffposttv&profileid;=breaking Transcript of the Final episode of Piers Morgan's program http://transcripts.cnn.com/TRANSCRIPTS/1403/28/pmt.01.html A major focus of his program was support for liberal causes, particularly restrictions on gun ownership. He had a feud with his predecessor Larry King.The Piers Morgan Larry King Feud Continues by Catherine Taibi The Huffington Post http://www.huffingtonpost.com/2014/08/01/piers-morgan-larry-king-cnn- twitter_n_5642510.html ITV announced that Morgan decided to leave the programme with immediate effect, following negative comments he had made about Meghan, Duchess of Sussex in the days after the U.S. airing of the Oprah with Meghan and Harry interview. Ofcom received over 57,000 complaints from viewers, including a complaint from the Duchess of Sussex herself. Piers Morgan is a Catholic. ==References== ==Other websites== *Piers Morgan's official website Category:1965 births Category:Living people Category:English journalists Category:English television presenters Category:Television personalities from Surrey Category:The Apprentice contestants Category:Writers from Surrey Category:English Roman Catholics",
 "title": "Piers Morgan"
}