{
 "id": "285095",
 "text": "Alpha and Omega is a 2010 3D American computer-animated comedy-drama movie. It was produced by Ken Katsumoto, Steve Moore and Richard Rich. It was directed by Anthony Bell and Ben Gluck. The movie was released on September 17, 2010. It was the last movie that Dennis Hopper acted in before he died on May 29, 2010. The movie is dedicated to Hopper. The movie was shot in 3D. A sequel, Alpha and Omega 2: A Howl-iday Adventure was released on October 8, 2013. It received mixed reviews. A second sequel, Alpha and Omega 3: The Great Wolf Games was released on March 25, 2014. Alpha and Omega: The Legend of the Saw Tooth Cave was released on September 23, 2014. Alpha and Omega: Family Vacation is currently in production. A wolf named Kate lives with a family and is an alpha wolf, while Humphrey, which is a gray and dimwitted wolf, is an omega wolf. The two meet during childhood when Humphrey accidentally crashes his log he was writing with his friends into their pathway, and both their fathers take them home after disagreeing of meeting each other. Sometime later, Kaite is now an adult wolf sent to be married to Harry, a serious brown brown wolf that has a grudge against omegas, since the last time he met one, it bit the fur off his tail and causing him to have a inexperience where he’s surrounded by nonsensical things. Meanwhile, Humphrey is not satisfied with his omega lifestyle since all they do is sleep and he longs for adventure. He gets out when chasing a frog and counters Kate, which she takes no interest in him since her father told her that alphas cannot meet omegas. On the moonlight Howell, a fun event when the wolves get betrothed and married, Kate is unsatisfied and leaves, where she encounters Humphrey again. The two of them get into an argument about do’s and don’t’s, and they get shot by tranquilizer darts, being transported, somewhere else without the wolves knowing. when they wake up after a few days of traveling, they find themselves in a new surrounding and attempt to find their wolf families. They encounter a loving goose named Parry who tell them after a mishap that they are in Idaho. They must take a locomotive train to get back, headed to the same in high wall forest, and Kaite decides to lead Humphrey. They get into a moving truck and Kate dreams about her father getting into a fight with the wolf clan, something that she wants to prevent. meanwhile, Lily notices that Kaite has not returned home and decides that she is missing. Meanwhile, that night, Humphrey gets the used to pass urine and goes outside, we’re at a nearby gas station eats a cupcake after realizing that he didn’t eat anything before they got on the truck. He is discovered and believed to be feral, and although he and Kaite tried to explain, they cannot understand animal talk, and they get chased out. Kaite blames Humphrey for losing their only way home and leaves to go find a way home herself, which she tries to cross a bridge, but ends up hanging on a vine over a muddy river. Humphrey appears to save her and they get to the other side, where the duo begin to bond. they can’t with snowy mountain and decide to get up to the top, or Humphrey reveals that he did not have a passing experience with snow. Kaite goes to look for the locomotive, Humphrey plays with a baby bear, but accidentally causes it to cry. He tries to apologize by tossing a much larger snowball, doing a game of catch the snowball. However, he uses a much bigger snowball that causes the baby bear to cry more. Its family arrives and chases Humphrey, forage, realizes, and tries to help him, but they both get chased. Perry comes nearby and informs the goose who are flying forward to Highwall. they missed the locomotive train, but successfully out with the Bears. Humphrey feels guilty, and Kate forgives him, but Humphrey explains that when he first met Kate, he wanted to explain to her how much he liked her, but he couldn’t bring himself to do that, and was scolded by his own father and forced to sleep with them every single day, growing up every time he slept. Kaite decides to prove that she cannot marry Harry and wants to marry Humphrey instead. Meanwhile, the wolf family look for Kate and Humphrey, while his father tries to track him down, but it’s informed by a passing goose that they are in Idaho. Meanwhile, Kate and Humphrey look for other ways to get to the locomotive train, where Humphrey launches himself and Kate, where Kate screams that this was probably a bad idea. however, they land safely on the locomotive train, much to their pleasure. Over the days they bonded together, and Humphrey explains to Kaite that they have fun today, deepening their bond. When they finally get back to Highwall, the wolves are happy to have Kaite back, but our hostile to Humphrey. Humphrey man just convinced him that he was a friend that had and they looked and let him in. When Humphrey learns that Kaite is going to marry Harry, he sadly decides to leave without Kaite knowing. Kaite, who learned that he left, is saddened and decides to marry Harry. But when she notices the leaf her that Humphrey gave her, she stops in the middle of the wedding that she does not want to marry Harry and confesses her love for Humphrey. Disappointed and angered, both of their fathers declare a war, causing a scuffle between the wolves. Kate attempts to stop the father wolf, but he is so caught up in his rage that he ramp into her father, starling, some deer that start running as fast as they can , causing a stampede. The wolves get to safety, but both their fathers are left in the stampede. Kaite finds Humphrey and reunite with him, and both the wolves ride on the log to save their fathers, where they jump straight into the stampede and lead them to safety. However, Kaite is knocked out when she attempts to save Humphrey from getting hit, so Humphrey covers her while their father nip and bark at the Caribou, dodging them just by getting hit in the ear a few times. When the stampede clears and all the wolves get to safety, Humphrey tries to wake Kaite up, but she doesn’t, and he mournfully confesses his love as the wolves mourn. Kate wakes up, and everything is well. She and Humphrey get married, and they have a fun moonlight Howell, all while Harry finds a love of his own that is an omega, just like Humphrey while Perry and the goose are also welcome into the family. in a post credit scene, a flower starts to grow while a gray flower grows as well, symbolizing of Kate and Humphrey love. == Cast == *Justin Long as Humphrey *Hayden Panettiere as Kate *Dennis Hopper as Tony *Danny Glover as Winston *Larry Miller as Marcel *Eric Price as Paddy, a duck and as Mooch *Vicki Lewis as Eve *Chris Carmack as Garth *Christina Ricci as Lilly *Maya Feltheimer as a bear cub *Kevin Sussman as Shakey *Brian Donovan as Salty *Bitsie Tulloch as Sweets *Paul Nakauchi as Hutch *Ben Gluck as Radio Announcer (uncredited) *Frank Welker as Additional Voices (uncredited) ==Reception== ===Critical Response=== Alpha and Omega received mixed reviews from critics. The Rotten Tomatoes website said \"With bland visuals and a dull, predictable plot, Alpha and Omega is a runt in 2010's animated litter.\" In Metacritic, the movie had a score of 37 out of 100, based on 15 critics. Some critics liked the voice performances by Justin Long and Hayden Panettiere. Other critics said it had a weak storyline, poor animation, and a predictable plot. In Amazon, Alpha and Omega received mostly positive reviews, for its animation, voice acting, characters and sense of humor. ===Box Office=== Alpha and Omega didn't do well at the US box office. It grossed only $25 million. It did much better overseas, grossing $50 million on its $20 million budget. It was a commercial hit. This also made it the highest-grossing animated movie from Lionsgate. ==Soundtrack== == Other websites == *Alpha and Omega's Official website * * Category:2010 computer- animated movies Category:2010 comedy movies Category:American comedy movies Category:Canadian animated movies Category:Canadian comedy movies Category:Movies about wolves Category:Movies about animals Category:Alpha and Omega Category:Lionsgate movies",
 "title": "Alpha and Omega (movie)"
}