{
 "id": "285053",
 "text": "Etuini Haloti Ngata (born January 21, 1984 in Inglewood, California) is an American former professional football defensive tackle. He played 13 seasons in the National Football League (NFL). He played for the Baltimore Ravens, Detroit Lions, and Philadelphia Eagles. Ngata was drafted out of the University of Oregon by the Baltimore Ravens with the 12th pick in the first round of the 2006 NFL Draft. Ngata was selected to the Pro Bowl in 2010 and 2011. He won Super Bowl XLVII with the Ravens when they defeated the San Francisco 49ers 34-31. == College career == While with the Oregon Ducks, Ngata was successful. Ngata totaled 107 tackles, 17.5 tackles for a loss, and 6.5 sacks total in the 2004 and 2005 seasons after tearing his ACL in 2003. ==Professional career== In 2006, Ngata had one interception and a 60-yard return, and had two picks for eight yards in 2008. He was an important part of the Baltimore defense. In 2011, Ngata scored his first NFL regular season touchdown when he recovered a fumble forced by Ravens middle linebacker Ray Lewis on St. Louis Rams quarterback Sam Bradford. A week later against the New York Jets, a sack by Ngata forced a Mark Sanchez fumble, which fellow Baltimore defender Jarret Johnson, who scored one of three defensive touchdowns for the Ravens in that game. It later emerged that Ngata played much of the rest of the year injured, which would explain his decline in production. In his NFL career, Ngata has made 311 tackles (206 alone), 17 sacks, knocked down 18 passes, forced four fumbles, and caught three interceptions, which he returned for a total of 68 yards with the Baltimore Ravens. He was voted to the Pro Bowl in 2009 and 2010. He won Super Bowl XLVII with the Ravens when they defeated the San Francisco 49ers 34-31. On March 18, 2019, Ngata announced that he was retiring from playing professional football. He announced this by posting a picture of himself on top of Mount Kilimanjaro with the caption \"I'm retiring from the NFL on top\". He signed a one-day contract with Baltimore to retire as a Raven on May 28, 2019. On October 11, 2021, Ngata was inducted into the Baltimore Ravens Ring of Honor. ==Personal== Ngata is a cousin to current players Fili Moala and Sifa Moala. Ngata's parents both died before he entered the 2006 NFL Draft. ==Other websites== * Official website * Haloti Ngata at nfl.com ==References== * Feldman, Bruce (2002-05-28). \"A recruiting pitch of another kind\". ESPN.com. * \"Haloti Ngata Draft Profile\", NFLDraftScout, retrieved November 10, 2009 * https://www.pro- football-reference.com/players/N/NgatHa20/gamelog/2009/ * \"Haloti Ngata selected to 2010 All Fundamentals Team \" * \"DT Haloti Ngata franchised by Ravens\". espn.com. 2011-02-15. * \"Ravens sign Haloti Ngata\". espn.com. 2011-09-20. * \"Ravens force 7 turnovers, crush Steelers 35-7 \". WJLA-TV (Washington). 2011-09-11. * \"Haloti Ngata fined for hit on Mark Sanchez \". Baltimore Sun. 2011-10-07. * \"Player Bio: Sifa Moala - UNLV OFFICIAL ATHLETIC SITE \". Unlvrebels.cstv.com. 1986-09-09. * Chadiha, Jeffri (May 8, 2006), \" Bittersweet: Haloti Ngata's draft joy came in knowing how proud his parents would have been \", Sports Illustrated Category:1975 births Category:Living people Category:Baltimore Ravens players Category:Detroit Lions players Category:Philadelphia Eagles players Category:American football defensive tackles Category:Sportspeople from Inglewood, California Category:American football defensive ends",
 "title": "Haloti Ngata"
}