{
 "id": "285156",
 "text": "Anne Celeste Heche ( ; May 25, 1969 – August 11, 2022) was an American actress, director and screenwriter. She starred in the television soap opera Another World. She received a Daytime Emmy Award in 1991 and in 2004, she was nominated for another Emmy Award and a Tony Award. She starred in many theatrical movies. She is best known for her roles in 1990s movies such as Donnie Brasco (1997), Volcano (1997), I Know What You Did Last Summer (1997), Six Days, Seven Nights (1998), and Return to Paradise (1998). As Heche was beginning to establish herself in movies during the late 1990s, her career was negatively affected by her highly publicized same-sex relationship with Ellen DeGeneres. This resulted in Heche losing movie offers. She later returned to having television roles such as in Men in Trees (2006–08), Hung (2009–11), Save Me (2013), Aftermath (2016), and the military drama television series The Brave (2017). She was also the voice of Suyin Beifong in the Nickelodeon animated television series The Legend of Korra (2014). ==Early life== Heche was born in Aurora, Ohio to Nancy Prickett and Donald Joseph Heche. Heche's family moved eleven times and once lived in an Amish community.Nancy Heche: When the Truth Comes Out CBN.com She was raised in Ocean City, New Jersey. Her father died of AIDS when he was 45. Heche said her father raped her and gave her genital herpes when she was 12. In 1985, she moved to Chicago where she went to high school. In 1987, she was offered a role in the soap opera As the World Turns, however her mother wanted her to graduate high school before starting her career. A few months before she graduated high school, she was cast in the soap opera Another World. Her sister Cynthia died of a heart defect in infancy. Her brother Nathan died in a car crash aged 18 in June 1983. Her sister, Susan Bergman, died aged 48 in January 2006. ==Personal life== ===Relationships=== Anne Heche's same-sex relationship with comedienne Ellen DeGeneres and the events following their breakup became subjects of widespread media interest. The couple started dating in 1997. At one point, they said they would get a civil union if it became legal in Vermont. They broke up in August 2000. Heche has said that all of her other relationships have been with men. After the split, Heche began dating cameraman Coleman 'Coley' Laffoon. They married on September 1, 2001. Their son, Homer, was born on March 2, 2002. Laffoon filed for divorce on February 2, 2007. Heche lost custody of their son in June 2007. Heche left her husband for Men in Trees co- star James Tupper. The couple reportedly moved in together in August 2007. On December 5, 2008, it was confirmed by Heche's representative that the actress was pregnant with Tupper's child. Their son, Atlas Heche Tupper, was born on March 8, 2009. ===Psychological problems=== On August 19, 2000, Heche drove from Los Angeles to Cantua Creek, a rural area outside Fresno, California. She parked her Toyota SUV along a dusty roadside. Wearing only a bra and shorts, Heche walked 1½ miles through the desert before knocking on the door of a stranger's ranch house. When the home's resident, Araceli Campiz, opened the door, she knew Heche from the movie Six Days Seven Nights. Bemused at first, Campiz grew uneasy when Heche showed no sign of leaving. \"I didn't know what to do,\" Campiz said. \"So I called the sheriff's department.\" When deputies arrived, Heche told them that she was \"God, and was going to take everyone back to heaven in a spaceship,\" according to a police report that was aired on NBC. The deputies called an ambulance. Heche went 50 miles to Fresno's University Medical Center, from which she was released after a few hours. Heche said that she was insane for the first 31 years of her life. She said this was due to the trauma of being sexually abused by her father during her infancy and childhood. As a result of this trauma, Heche also said she had multiple personality disorder. She made an alter ego named \"Celestia,\" an alien from another planet who could speak to God and was the half-sister of Jesus Christ.McClurg, Jocelyn (September 4, 2001). \"'Elated' Anne Heche weds, closes the door on her past\", USA Today , P. 2d. Heche said that the incident in Cantua Creek snapped her out of her insanity and put her alter ego behind her. ===Car crashes and death=== On August 5, 2022, Heche was part of a series of car crashes, first hitting a garage at an apartment complex, and ending in a fiery car crash that left her \"severely burned\" in the hospital. It was reported that she was under the influence and acting not normally at the time of the crash. Heche was in critical condition after the accident, and on August 7, she was in stable condition. The next day however, Heche was in a coma because of major lung and brain injuries. Heche had cocaine in her system at the time of the car crashes. On August 12, 2022, her family confirmed that Heche was brain dead and on life-support. Her family said they would remove her life support when they find out if they can donate her organs. By California law, Heche died on August 11 because she was brain dead. Her life- support was removed on August 14. ==Filmography== Movie Year Title Role Notes 1993 An Ambush of Ghosts Denise Unreleased 1993 The Adventures of Huck Finn Mary Jane Wilks 1994 I'll Do Anything Claire 1994 Milk Money Betty 1995 Wild Side Alex Lee/Johanna Straight to video 1996 The Juror Juliet 1996 Pie in the Sky Amy Straight to video 1996 Walking and Talking Laura Limited release 1997 Donnie Brasco Maggie Pistone National Board of Review Award for Best Supporting Actress 1997 Volcano Dr. Amy Barnes 1997 I Know What You Did Last Summer Missy Egan 1997 Wag the Dog Winifred Ames Nominated – Satellite Award for Best Supporting Actress – Motion Picture Comedy or Musical 1998 Six Days Seven Nights Robin Monroe Blockbuster Entertainment Award for Favorite Actress – Comedy or Romance 1998 Return to Paradise Beth McBride Csapnivalo Awards – Golden Slate for Best Actress in a Leading Role 1998 Psycho Marion Crane 1999 The Third Miracle Roxane Limited release 2000 Auggie Rose Lucy Brown Also known as Beyond Suspicion Limited release 2001 Prozac Nation Dr. Sterling Straight to video 2002 John Q. Rebecca Payne 2004 Birth Clara Limited release 2005 Sexual Life Gwen Straight to video 2007 Suffering Man's Charity Helen Straight to video 2007 What Love Is Laura Limited release 2007 Superman: Doomsday Lois Lane Voice only Straight to video 2008 Toxic Skies Dr. Tess Martin Straight to video 2009 Spread Samantha Limited release 2010 The Other Guys Pamela Boardman UncreditedDimako, Peter. \"Anne Heche joins Cedar Rapids and The Other Guys\", MovieJungle.com, October 29, 2009, sourced from subscription-only Variety article \"Anne Heche picks up gigs\", October 28, 2009 2011 Cedar Rapids Joan Ostrowski-Fox Limited release 2011 Rampart Catherine Limited release 2012 That's What She Said Dee Dee Premiered at 2012 Sundance Film Festival 2012 Arthur Newman, Golf Pro N/A post-production 2012 Black November Barbra post- production 2012 Life at These Speeds Coach Rowan in production 2013 Nothing to Fear N/A pre-production 2013 Wheeler N/A Filming begins in June 2012http://www.bizjournals.com/orlando/print-edition/2012/04/27/action-film- shoot-in-orlando-to-create.html Television Year Title Role Notes 1987–1991 Another World Victoria 'Vicky' Hudson Marley Love Hudson Daytime Emmy Award for Outstanding Younger Actress in a Drama Series Soap Opera Digest Award for Outstanding Female Newcomer – Daytime Soap Opera Digest Award for Outstanding Lead Actress – Daytime 1991 Murphy Brown Nica 1 episode 1992 O Pioneers! Marie TV movie 1993 The Young Indiana Jones Chronicles Kate 1 episode 1994 Against the Wall Sharon Made-for-cable film 1994 Girls in Prison Jennifer Made-for-cable film 1994 The Investigator Lucinda Short 1995 Kingfish: A Story of Huey Long Aileen Dumont TV movie 1996 If These Walls Could Talk Christine Cullen Made-for-cable film Segment: \"1996\" 1997 Subway Stories Pregnant Girl Made-for-cable film Segment: \"Manhattan Miracle\" 1998 Ellen Karen 1 episode 2000 One Kill Captain Mary Jane O'Malley TV movie 2001 Ally McBeal Melanie West 7 episodes 2004 Gracie's Choice Rowena Lawson TV movie Nominated – Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie 2004 The Dead Will Tell Emily Parker TV movie Nominated – Saturn Award for Best Actress on Television 2004–2005 Everwood Amanda Hayes 10 episodes 2005 True Rosie True Unaired pilot 2005 Nip/Tuck Nicole Morretti 3 episodes 2005 Silver Bells Catherine O'Mara TV movie 2005–2006 Higglytown Heroes Gloria the Waitress Voice only 3 episodes 2006 Fatal Desire Tanya Sullivan TV movie 2007 Masters of Science Fiction Martha Van Vogel 1 episode 2006–2008 Men in Trees Marin Frist 36 episodes 2009–2011 Hung Jessica Haxon 30 episodes 2011 Girl Fight Melissa TV movie 2011 Silent Witness Kate Robb TV movie 2012 Blackout Dr. Debra Westen Miniseries 2012 Save Me Beth Harper Upcoming NBC pilot Director Year Title Notes 2000 If These Walls Could Talk 2 Segment \"2000\" 2001 Ellen DeGeneres: American Summer Documentary 2001 On the Edge Segment Reaching Normal ==References== == Other websites == * Category:Actors from Ohio Category:American crime victims Category:American movie actors Category:American television actors Category:American television producers Category:American television writers Category:Bisexual people Category:LGBT actors Category:LGBT directors Category:LGBT people from Ohio Category:American LGBT writers Category:Movie directors from Ohio Category:1969 births Category:2022 deaths Category:Emmy Award winning actors Category:LGBT people from New Jersey Category:Movie directors from New Jersey Category:American autobiographers Category:Writers from Ohio Category:Writers from New Jersey Category:Actors from New Jersey Category:People from Ocean City, New Jersey Category:Road accident deaths in California",
 "title": "Anne Heche"
}