{
 "id": "285191",
 "text": "Melissa Gilbert (born May 8, 1964) is an American actress and writer. She is famous for acting as Laura Ingalls Wilder in Little House on the Prairie (1974-1984). She has also acted in many other television programs and movies. Gilbert had two terms as president of the Screen Actors Guild. On June 9, 2009 her autobiography, Prairie Tale: A Memoir, was released. ==Personal life== Gilbert was born in Los Angeles. She was married to Bo Brinkman from 1988 until they divorced in 1992. She was married to Bruce Boxleitner from 1995 until they divorced in 2011. She married Timothy Busfield in 2013. They have two children. ===Health issues=== Gilbert has battled alcoholism and drug abuse, which she wrote about in her 2009 autobiography. In January 2015 Gilbert decided to have her breast implants surgically removed for health reasons. ==Honors== For her contribution to the television industry, Gilbert has a star on the Hollywood Walk of Fame at 6429 Hollywood Blvd in 1985. Her then-fiance, Rob Lowe, was with her when her star was unveiled. She is one of the youngest actresses to have been honored with a star. ==2016 Congressional election== On August 10, 2015, Gilbert announced her intentions to run for Michigan's 8th congressional district. She will be opposing Republican incumbent Mike Bishop. ==Career== ===Movies=== Year Film Role Notes 1977 Circus, Lions, Tigers and Melissas Too Self Christmas Miracle in Caufield, U.S.A. Kelly Sullivan TV movie 1979 Nutcracker Fantasy Clara Voice The Miracle Worker Helen Keller TV movie; Nominated for an Emmy Award 1980 The Diary of Anne Frank Anne Frank TV movie 1981 Splendor in the Grass Wilma Dean 'Deanie' Loomis TV movie 1983 Choices of the Heart Jean Donovan TV movie Little House: Look Back to Yesterday Laura Ingalls Wilder TV movie Little House: Bless All the Dear Children Laura Ingalls Wilder TV movie 1984 Little House: The Last Farewell Laura Ingalls Wilder TV movie Family Secrets Sara Calloway TV movie 1985 Sylvester Charlie 1986 Drug Free Kids: A Parents' Guide Self Video Choices Terry Granger TV movie The Penalty Phase Leah Furman TV movie 1987 Blood Vows: The Story of a Mafia Wife Marian TV movie 1988 Killer Instinct Dr. Lisa DaVito TV movie 1989 Ice House Kay 1990 Without Her Consent Emily Briggs TV movie Forbidden Nights Judith Shapiro TV movie Joshua's Heart Claudia TV movie Donor Dr. Kristine Lipton TV movie The Lookalike Gina/Jennifer TV movie 1992 With a Vengeance Janet King/Vanessa TV movie 1993 Family of Strangers Julie TV movie With Hostile Intent Miranda Berkley TV movie Shattered Trust: The Shari Karney Story Shari Karney TV movie House of Secrets Marion Ravinel TV movie Dying to Remember Lynn Matthews TV movie 1994 The Babymaker: The Dr. Cecil Jacobson Story Mary Bennett TV movie Against Her Will: The Carrie Buck Story Melissa Prentice TV movie Cries from the Heart Karen TV movie 1995 Zoya Zoya Ossipov TV movie 1996 Christmas in My Hometown (a.k.a. A Holiday for Love) Emma Murphy TV movie 1997 Seduction in a Small Town Sarah Jenks TV movie Childhood Sweetheart? Karen Carlson TV movie 1998 Her Own Rules Meredith Sanders TV movie 1999 Murder at 75 Birch Gwen Todson TV movie The Soul Collector Rebecca TV movie Switched at Birth Sarah Barlow TV movie 2000 A Vision of Murder: The Story of Donielle Donielle TV movie 2001 Sanctuary Jo Ellen Hathaway TV movie 2003 Hollywood Wives: The New Generation Taylor Singer TV movie 2004 Heart of the Storm Cassie Broadbeck TV movie 2005 Thicker Than Water Natalie Jones TV movie 2007 Sacrifices of the Heart originally titled Spring Thaw Kate Weston/Anne Weston TV movie Safe Harbour Ophelia Direct-to-video 2011 The Christmas Pageant Vera Parks TV movie ===Television=== Series starring roles Year Show Role Season # Notes 1974–83 Little House on the Prairie Laura Ingalls Wilder 1–9 Two Young Artist Awards Nominated: Golden Globe Award 1992 Stand By Your Man Rochelle Dumphy 1 1992–95 Batman: The Animated Series Barbara Gordon/Batgirl 1 & 2 Voice 1994–95 Sweet Justice Kate Delacroy 1 2012 Dancing with the Stars Herself / contestant 14 Finished in 5th place Guest appearances Year Show Role Season Episode Notes 1972 Gunsmoke Spratt's Child 18 4: \"The Judgement\" 1972 Emergency! Jenny 2 10: \"Dinner Date\" 1978 The Love Boat Rocky 2 3: \"Julie's Dilemma/Who's Who/Rocky\" 1985 Faerie Tale Theatre Gerda 4 2: \"The Snow Queen\" 1991 The Hidden Room 1 4: \"Spirit Cabinet\" 1996 Babylon 5 Anna Sheridan 3 17: \"War Without End: Part 2\" 21: \"Shadow Dancing\" 22: \"Z'ha'dum\" 1998 The Outer Limits Teresa Janovitch 4 6: \"Relativity Theory\" 1998 Touched by an Angel Michelle Tanner 5 10: \"The Peacemaker\" 2002 Providence Lorna Berlin 4 21: \"Smoke and Mirrors\" 2002 Presidio Med Grace Bennett 1 7: \"Once Upon a Family\" 2005 7th Heaven Marie Wagner 9 18: \"Honor Thy Mother\" 2006 Nip/Tuck Shari Noble 4 4: \"Shari Noble\" 2009 Chelsea Lately Herself 3 131: \"Chelsea Lately\" 2010 The Talk Herself / guest 1 Episode 29 ==References== ==Other websites== *Official personal website *Official campaign website * Category:Presidents of the Screen Actors Guild Category:American movie actors Category:American television actors Category:Actors from Michigan Category:Politicians from Michigan Category:Actors from Los Angeles Category:Politicians from California Category:Democratic Party (United States) politicians Category:1964 births Category:Living people",
 "title": "Melissa Gilbert"
}