{
 "id": "285238",
 "text": "The Horizon League is a NCAA conference that plays in the NCAA Division I. The conference is headquartered in Indianapolis, Indiana and features universities and colleges from the Great Lakes Region. While it plays many sports, it has never played football. ==History== The Horizon League was founded in 1979 as the Midwestern City Conference (MCC) with six members. None of these schools are in the league now. The school that has been in the league the longest is Detroit Mercy, which joined in 1980 (when it was known as simply \"Detroit\"). The conference changed its name in 1985 to Midwestern Collegiate Conference. In 1993, the largest conference expansion in NCAA history that did not involve a merger was announced. Six schools left the Mid-Continent Conference, now known as The Summit League, to join the Midwestern Collegiate Conference for the 1994–95 school year. In June 2001, the conference changed its name to the current Horizon League to avoid confusion with the \"other\" MCC (which did not become The Summit League until 2007). Today, eight of the Horizon League's 11 full members (those playing most, if not all, of their sports in the league) are former members of The Summit League. The exceptions are Detroit Mercy, Northern Kentucky, and Robert Morris. The most recent changes to the conference membership happened in the 2020s. First, in 2020, Purdue Fort Wayne and Robert Morris joined. In 2022, UIC left to join the Missouri Valley Conference. Most recently, the conference announced in February 2025 that Northern Illinois, which had left in 1997, would return in 2026. Northern Illinois will return to the Horizon League at the same time that the school's football team joins the Mountain West Conference. ==Members== The Horizon League now has 11 full members, with a 12th joining in 2026. School Location Founded Type Nickname Joined Cleveland State University Cleveland, Ohio 1964 Public Vikings 1994 Detroit. Michigan 1877 Private Titans 1980 (Green Bay) Green Bay, Wisconsin 1965 Public Phoenix 1994 (IU Indy) Indianapolis, Indiana 1969 Public Jaguars 2017 (Milwaukee) Milwaukee, Wisconsin 1956 Public Panthers 1994 Northern Kentucky University Highland Heights, Kentucky 1968 Public Norse 2015 Oakland University Rochester, Michigan 1957 Public Golden Grizzlies 2013 Purdue University Fort Wayne Fort Wayne, Indiana 1964 Public Mastodons 2020 Robert Morris University Moon Township, Pennsylvania 1921 Private Colonials 2020 Wright State University Dayton, Ohio 1964 Public Raiders 1994 Youngstown State University Youngstown, Ohio 1908 Public Penguins 2001 ===Future member=== School Location Founded Type Nickname Joining Northern Illinois University DeKalb, Illinois 1895 Public Huskies 2026 ===Former full members=== A total of 14 schools have been full members, but are no longer in the conference. Northern Illinois will return to the Horizon League in 2026. Nicknames are those used when the schools were conference members. School Location Founded Joined Left Type Nickname Current Conference Butler University Indianapolis, Indiana 1855 1979 2012 Private Bulldogs Big East Dayton, Ohio 1850 1987 1993 Private Flyers Atlantic 10 Duquesne University Pittsburgh, Pennsylvania 1878 1992 1993 Private Dukes Atlantic 10 Evansville, Indiana 1854 1979 1994 Private Purple Aces Missouri Valley La Salle University Philadelphia, Pennsylvania 1863 1992 1995 Private Explorers Atlantic 10 Loyola University Chicago Chicago, Illinois 1870 1979 2013 Private Ramblers Atlantic 10 Marquette University Milwaukee, Wisconsin 1881 1988 1991 Private Warriors Big East Northern Illinois University DeKalb, Illinois 1895 1994 1997 Public Huskies MAC South Bend, Indiana 1842 1982 1987/1988 1986 1995 Private Fighting Irish ACC Oklahoma City University Oklahoma City, Oklahoma 1904 1979 1985 Private Chiefs Sooner (NAIA) Oral Roberts University Tulsa, Oklahoma 1963 1979 1987 Private Titans The Summit Saint Louis University St. Louis, Missouri 1818 1981 1991 Private Billikens Atlantic 10 (UIC) Chicago, Illinois 1859 1994 2022 Public Flames Missouri Valley Valparaiso University Valparaiso, Indiana 1859 2007 2017 Private Crusaders Missouri Valley Xavier University Cincinnati, Ohio 1831 1979 1995 Private Musketeers Big East ===Associate members=== NCAA conferences often have one or more \"associate\" members that play only a limited number of sports in the conference, usually one. For most of its history, the Horizon League has not had associate members. The first such member was Belmont, which was a men's soccer member from 2014 to 2018. More recently, the Horizon greatly expanded its men's tennis league. The Ohio Valley Conference (OVC) merged its men's tennis league into the Horizon in 2022. At the same time, Belmont returned to the conference for men's tennis, and Chicago State moved men's and women's tennis into the Horizon. Lindenwood shut down its men's tennis team after the 2023–24 season. At the same time, Chicago State joined the Northeast Conference, which sponsors tennis for both sexes. However, it is keeping both tennis teams in the Horizon League through the 2024–25 season, honoring its affiliation contract with that confernece. ==== Current ==== Departing members in pink. School Location Founded Type Nickname Horizon League sport(s) Joined Main conference Belmont University Nashville, Tennessee 1890 Private Bruins Men's tennis 2022 MVC Chicago State University Chicago, Illinois 1867 Public Cougars Men's and women's tennis 2022 NEC Eastern Illinois University Charleston, Illinois 1895 Public Panthers Men's tennis 2022 OVC Evansville, Indiana 1965 Public Screaming Eagles Men's tennis 2022 OVC Tennessee State University Nashville, Tennessee 1912 Public Tigers Men's tennis 2022 OVC Tennessee Technological University (Tennessee Tech) Cookeville, Tennessee 1915 Public Golden Eagles Men's tennis 2022 OVC ==== Former ==== As noted above, current men's tennis member Belmont once housed its men's soccer team in the Horizon League. School Location Founded Type Nickname Horizon League sport Joined Left Main conference Conference in former Horizon sport Belmont University Nashville, Tennessee 1890 Private Bruins Men's soccer 2014 2018 MVC MVC Lindenwood University 1827 Public Lions Men's tennis 2022 2024 OVC ==References== * Category:NCAA Division I athletics conferences Category:1979 establishments in the United States",
 "title": "Horizon League"
}