{
 "id": "285260",
 "text": "Denis Colin Leary (born August 18, 1957 in Worcester, Massachusetts) is an American actor, comedian, producer, singer and writer. He is the star and co- creator of the television show Rescue Me. His career as a comedian has been controversial because he allegedly stole not only material but his entire act from the dead comedian Bill Hicks. ==Awards== Year Result Award Category Film/Show 2009 Golden Globe Awards Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television Recount (2008) 2008 Emmy Awards Outstanding Supporting Actor in a Miniseries or a Movie Recount (2008) 2007 Emmy Awards Outstanding Lead Actor in a Drama Series Rescue Me 2007 Satellite Awards Best Actor in a Series, Drama Rescue Me 2007 Prism Awards Performance in a Drama Series, Multi-Episode Storyline Rescue Me 2006 Emmy Awards Outstanding Lead Actor in a Drama Series Rescue Me 2006 Satellite Awards Best Actor in a Series, Drama Rescue Me 2006 Prism Awards Performance in a Drama Series, Multi-Episode Storyline Rescue Me 2005 Emmy Awards Outstanding Writing for a Drama Series Rescue Me 2005 Golden Globe Awards Best Performance by an Actor in a Television Series - Drama Rescue Me 2005 Satellite Awards Best Actor in a Series, Drama Rescue Me 2003 Kids' Choice Awards Favorite Voice from an Animated Movie Ice Age 2003 DVD Exclusive Awards Best Actor Double Whammy (2001) 2002 Television Critics Association Awards Individual Achievement in Comedy The Job 2000 Blockbuster Entertainment Awards Favorite Supporting Actor - Drama/Romance The Thomas Crown Affair (1999) 1996 CableACE Awards Best Directing: Comedy National Lampoon's Favorite Deadly Sins (1995) 1992 Edinburgh International Arts Festival Critic's Award No Cure for Cancer (1992) 1992 BBC Festival Recommendation Award No Cure for Cancer (1992) ==Filmography== Year Title Role Notes 1987 Long Walk to Forever Newt Short film 1991 Strictly Business Jake Cameo 1993 Bill Who's the Man? Sergeant Cooper Demolition Man Edgar Friendly Loaded Weapon 1 Mike McCracken Cameo; performing \"You Really Got Me\" Judgment Night Fallon 1994 Gus Gunmen Armor O'Malley Natural Born Killers Prison Inmate Director's cut; Cameo 1995 National Lampoon's Favorite Deadly Sins Jake Television film, also directed segment \"Lust\" Operation Dumbo Drop CW3 David Poole Frank 1996 Underworld Johnny Crown/Johnny Alt Two If by Sea Francis \"Frank\" O'Brien Also writer 1997 Vinnie Franko Television film Love Walked In Jack Hanaway Also producer Subway Stories Guy in wheel chair Television film, segment \"The Red Shoes\" Wag the Dog Fad King Suicide Kings Lono Veccio Doug Nick 1998 Monument Ave. Bobby O'Grady a.k.a. Snitch, Also uncredited writer Wide Awake Mr. Beal Small Soldiers Gil Mars A Bug's Life Francis Voice 1999 True Crime Bob Findley Jesus' Son Wayne Do Not Disturb Simon Det. Michael McCann 2000 Sand Teddy Lakeboat The Fireman Company Man Officer Fry 2001 Double Whammy Det. Raymond Pluto Also uncredited producer Final Bill performing \"Little Sister\" Blow Producer 2002 Dawg Douglas \"Dawg\" Munford a.k.a. Bad Boy Ice Age Diego Voice Nominated – Kids' Choice Award for Favourite Voice from an Animated Movie Slater 2003 When Stand Up Stood Out Himself Documentary Himself Documentary Reverse of the Curse of the Bambino Himself Documentary (sequel) 2006 Ice Age: The Meltdown Diego Voice 2007 Death Sentence James Wan Feature Film 2008 Recount Michael Whouley Television film 2009 Ice Age: Dawn of the Dinosaurs Diego Voice 2012 George Stacy Ice Age: Continental Drift Diego Voice 2014 Draft Day Coach Penn The Amazing Spider-Man 2 George Stacy 2015 Freaks of Nature Rick Wilson 2016 Ice Age: Collision Course Diego Voice ==References== ==Other websites== * Denis Leary's Official website Category:1957 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Massachusetts Category:American stand-up comedians Category:Comedians from Massachusetts Category:People from Worcester, Massachusetts",
 "title": "Denis Leary"
}