{
 "id": "285221",
 "text": "Carrie-Anne Moss (born August 21, 1967) is a Canadian-American actress. Moss started her career on television, but became famous for her character, Trinity, in The Matrix trilogy. == Early life == Carrie-Anne Moss was born in Burnaby, British Columbia. Her parents are Barbara and Melvyn Moss. She has an older brother, Brooke. Moss' mother reportedly named her after The Hollies' 1967 hit song, \"Carrie Anne\", which had been released in May that year. Moss lived with her mother in Vancouver as a child. At the age of 11, she joined the Vancouver children's musical theatre and later went on to tour Europe with the Magee Secondary School Choir in her senior year. ==Personal life== Moss married American actor Steven Roy in 1999, and they have two sons and a daughter. The family resides in Los Angeles. == Filmography == === Film === Year Title Role Notes 1994 Jane Tanner 1994 Flashfire Meredith Neal 1995 Terrified Tracy Also known as Evil Never Sleeps and Toughguy 1996 Sabotage Louise Castle 1997 Lethal Tender Melissa Wilkins 1997 Madge Clerisy 1999 Trinity 1999 New Blood Leigh 2000 Chocolat Caroline Clairmont 2000 Red Planet Cmdr. Kate Bowman 2000 Detective Olivia Neal 2000 Memento Natalie 2003 Trinity 2003 Voice only 2003 2004 Suspect Zero Fran Kulok 2005 Jerri Falls 2005 Sledge: The Untold Story Herself/Girlfriend in movie 2006 Fido Helen Robinson 2006 Snow Cake Maggie 2006 Mini's First Time Diane Drogues-Tennan 2007 Disturbia Julie Brecht 2007 Normal Catherine 2008 Fireflies in the Garden Kelly Hanson 2009 Love Hurts Amanda Bingham 2010 Unthinkable Agent Helen Brody 2012 Silent Hill: Revelation Claudia Wolf 2012 Knife Fight Penelope Nelson 2013 The Clockwork Girl Admiral Wells Voice 2013 Compulsion Saffron 2014 Dragon Nest: Warriors' Dawn Elena Voice 2014 Pompeii Aurelia 2014 Elephant Song Olivia 2015 Pirate's Passage Kerstin Hawkins Voice 2015 Unity Narrator Documentary 2015 Frankenstein Elizabeth Frankenstein 2016 Brain on Fire Rhona Nack 2017 The Bye Bye Man Detective Shaw 2021 The Matrix Resurrections Trinity === Television === Year Title Role Notes 1991–1993 Dark Justice Tara McDonald 9 episodes 1991 Street Justice Jennifer 2 episodes 1992 Forever Knight Monica Howard Episode: \"Feeding the Beast\" 1993 Matrix Liz Teel 13 episodes 1993 Doorways Laura Unaired TV pilot 1993 Silk Stalkings Lisa / Lana Bannon Episode: \"The Perfect Alibi\" 1994–1995 Models Inc. Carrie Spencer 28 episodes 1994 Baywatch Gwen Brown / Mattie Brown Episode: \"Mirror, Mirror\" 1995 Nowhere Man Karin Stoltz Episode: \"Something About Her\" 1996–1997 F/X: The Series Lucinda Scott 17 episodes 1996 Due South Irene Zuko Episode: \"Juliet is Bleeding\" 2007 Suspect Lt. Chivers TV pilot 2008 Pretty/Handsome Elizabeth Fitzpayne TV pilot 2011 Normal Ann Brown TV pilot 2011–2012 Chuck Gertrude Verbanski 4 episodes 2012–2013 Vegas Katherine O'Connell 21 episodes 2014 Crossing Lines Amanda Andrews 4 episodes 2015–present Jessica Jones Jeri Hogarth Main Cast 2016 Daredevil Jeri Hogarth Episode: \"A Cold Day in Hell's Kitchen\" 2016-present Humans Dr Athena Morrow Main role (second season) 2016 Man Seeking Woman Joan Dillon Episode: \"Eel\" 2017 Iron Fist Jeri Hogarth 3 episodes 2017 The Defenders Jeri Hogarth Episode: \"Mean Right Hook\" === Video games === Year Title Voice Notes 2003 Enter the Matrix Trinity FMV Motion capture 2010 Mass Effect 2 Aria T'Loak Voice role 2012 Mass Effect 3 Aria T'Loak Voice role (also appears in Omega) 2022 Horizon Forbidden West Tilda van der Meer Voice role == Awards and nominations == Year Nominated work Award Result 1997 Due South Gemini Award for Best Guest Actress in a Drama 1999 The Matrix Empire Award for Best Newcomer (tied with Damien O'Donnell) 1999 The Matrix MTV Movie Award for Breakthrough Female Performance 1999 The Matrix Saturn Award for Best Actress 2000 Chocolat Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2000 Memento Independent Spirit Award for Best Supporting Female 2000 Memento Las Vegas Film Critics Society Award for Best Supporting Actress 2003 Teen Choice Award for Choice Movie Actress – Drama/Action Adventure 2006 Fido Vancouver Film Critics Circle Award for Best Actress in a Canadian Film 2006 Snow Cake Genie Award for Best Performance by an Actress in a Supporting Role == References == Category:Canadian movie actors Category:Canadian television actors Category:1967 births Category:Living people Category:People from Burnaby",
 "title": "Carrie-Anne Moss"
}