{
 "id": "285384",
 "text": "is a prefecture in the Tōhoku region of Japan. It is on the island of Honshu. The capital city is Morioka. == History == The area of Iwate was part of Mutsu Province. In 1869, Mutsu was split into five new provinces: Rikuōku, Rikuchū, Rikuzen, Iwashiro and Iwaki. The first three of these together known as the \"Three Riku\", or Sanriku.Nippon-Kichi, \"Saw-tooth Sanriku Coastline\". Retrieved 2012-1-12. The new provinces were abolished in July 1871.Japan-i, Sanriku Coastline/Kamaishi Daikannon . Retrieved 2012-1-12. In the Meiji period, the provinces of Japan were converted into prefectures. Maps of Japan and Mutsu Province were changed in the 1870s. ==Geography== Iwate is the second largest prefecture after Hokkaido. The prefecture is in the Tōhoku region of Honshū island. It has the island's easternmost point. The eastern coastline faces the Pacific Ocean. Iwate shares its northern border with Aomori Prefecture. The western border meets Akita Prefecture. Its southern border is shared with Miyagi Prefecture. ===Cities=== * Hachimantai * Hanamaki * Ichinoseki * Kamaishi * Kitakami * Kuji * Miyako * Morioka (capital) * Ninohe * Ōfunato * Ōshū * Rikuzentakata * Tōno ===National Parks=== National parks cover about 5% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\". Retrieved 2012-3-13. They include: * Towada-Hachimantai National ParkJapan Ministry of the Environment, \"Towada-Hachimantai National Park\" . Retrieved 2012-3-19. * Rikuchu Kaigan National ParkJapan Ministry of the Environment, \"Rikuchu Kaigan National Park\" . Retrieved 2012-3-19. ==Shrines and temples== Tsutsukowake jinja is the main Shinto shrine (ichinomiya) of the prefecture.\"Nationwide List of Ichinomiya,\" p. 2 . Retrieved 2012-1-17. The Buddhist temples of Hiraizumi include Chūson-ji and Mōtsū-ji. Hiraizumi was added to the World Heritage List in June 2011. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Iwate Museum of Art == References == ==Other websites== * http://www.pref.iwate.jp/info.rbz?ik=1&nd;=4334 ;",
 "title": "Iwate Prefecture"
}