{
 "id": "285555",
 "text": "The ASUN Conference is a NCAA conference whose members play in NCAA Division I. The conference is headquartered in Atlanta and mostly features universities and colleges from the southeastern United States. The ASUN did not play football until 2022, when it began play in the second level of Division I football, the Football Championship Subdivision (FCS). The ASUN began in 1978 as the Trans America Athletic Conference (TAAC). It became the Atlantic Sun Conference in 2001 and rebranded itself as the ASUN Conference in 2016. ==Members== As of the 2022–23 school year, the ASUN has 14 full members, or schools that play almost all of their sports in the conference. School Location Founded Type Nickname Joined ASUN Austin Peay State University Clarksville, Tennessee 1927 Public Governors 2022 Bellarmine University Louisville, Kentucky 1950 Private Knights 2020 Conway, Arkansas 1907 Public Bears & Sugar Bears 2021 Eastern Kentucky University Richmond, Kentucky 1874 Public Colonels 2021 Florida Gulf Coast University Fort Myers, Florida 1991 Public Eagles 2007 Jacksonville University Jacksonville, Florida 1934 Private Dolphins 1998 Jacksonville State University Jacksonville, Alabama 1883 Public Gamecocks 1995–2003 2021 Kennesaw State University Kennesaw, Georgia 1963 Public Owls 2005 Liberty University Lynchburg, Virginia 1971 Private Flames 2018 Lipscomb University Nashville, Tennessee 1891 Private Bisons 2003 Florence, Alabama 1830 Public Lions 2018 Jacksonville, Florida 1969 Public Ospreys 2005 Queens University of Charlotte Charlotte, North Carolina 1857 Private Royals 2022 Stetson University DeLand, Florida 1883 Private Hatters 1985 The ASUN has added five members in the 2020s. First, three schools, one a returning member, joined in 2021. The first-time members were the University of Central Arkansas and Eastern Kentucky University, which respectively arrived from the Southland Conference and Ohio Valley Conference (OVC). Jacksonville State University, which had been an ASUN member from 1995 to 2003, returned after spending 18 years in the OVC. At that time, the ASUN technically began sponsoring football, but did not start conference play. It partnered with the Western Athletic Conference, which was launching an FCS football league in the fall 2021 season. Under the agreement, the three newest members, all of which play FCS football, became de facto WAC football members for that season only. The next membership change came in July 2022 with the arrival of football- sponsoring Austin Peay State University from the OVC and non-football Queens University of Charlotte from the Division II South Atlantic Conference. When Peay was announced as an incoming ASUN member, it gave the conference six members that play FCS football and award scholarships for that sport, which is the number of teams needed for a conference to receive an automatic bid to the FCS playoffs. However, the ASUN would lose one of those six members when Jacksonville State announced a 2023 move to Conference USA (C-USA). JSU began a transition to FBS in 2022, making it ineligible for the FCS playoffs. The WAC lost two of its planned six playoff-eligible members in 2022, with Sam Houston starting an FBS transition ahead of its 2023 move to C-USA and Incarnate Word backing out of a planned move to the WAC and remaining in the Southland Conference. This led the ASUN and WAC to renew their football partnership for 2022. Both conferences will play separate league schedules, with officials from each conference choosing their one automatic playoff team. The new ASUN football league, launching in 2022, will feature Austin Peay, the three 2021 arrivals, Kennesaw State, and North Alabama. Three other ASUN schools sponsor football but will not play that sport in the ASUN. Stetson plays in the Pioneer Football League, whose members do not award football scholarships; Liberty plays as an independent in the top level of D-I football, the Football Bowl Subdivision; and Bellarmine began play in sprint football, a weight-restricted form of the sport not run by the NCAA, in 2022. ===Associate members=== The ASUN also has 12 \"associate members\" that play one or two sports in the conference while being full members of another conference. Seven of these schools, plus full members Bellarmine and Jacksonville, make up the ASUN men's lacrosse league, restarted in the 2021–22 school year (2022 season) after having been shut down when the ASUN began a lacrosse partnership with the Southern Conference (SoCon). Four more schools joined in July 2021. Two returned women's lacrosse to the ASUN after the SoCon shut down its women's lacrosse league, and three joined in beach volleyball. After the Atlantic 10 Conference started a men's lacrosse league for the 2023 season, taking away two of the SoCon's six men's lacrosse members, the SoCon shut down its men's lacrosse league. Jacksonville, which had played in SoCon men's lacrosse in the 2022 season by agreement between the ASUN and SoCon, returned that sport to the ASUN. It was joined in ASUN men's lacrosse by Mercer, a full SoCon member that was already an ASUN beach volleyball member, and Lindenwood, which started a transition to D-I in 2022 as a new member of the Ohio Valley Conference (OVC), which does not sponsor the sport. Lindenwood also joined the ASUN in women's lacrosse, also not sponsored by the OVC, at that time. The \"Joined\" column shows the year in which a school joined the ASUN. Since all ASUN sports that have associate members (beach volleyball and men's and women's lacrosse) are spring sports, this means the year of joining is the calendar year before the first season of ASUN play. School Location Founded Type Nickname Joined ASUN sport(s) Main conference (Air Force) Colorado Springs, Colorado 1954 Federal Falcons 2021 Men's lacrosse Mountain West Conference (Charleston) Charleston, South Carolina 1770 Public Cougars 2021 Beach volleyball Colonial Athletic Association Cleveland State University Cleveland, Ohio 1964 Public Vikings 2021 Men's lacrosse Horizon League Coastal Carolina University Conway, South Carolina 1954 Public Chanticleers 2021 Women's lacrosse Sun Belt Conference Delaware State University Dover, Delaware 1891 Public Hornets 2021 Women's lacrosse Mid-Eastern Athletic Conference Detroit, Michigan 1877 Private Titans 2021 Men's lacrosse Horizon League Lindenwood University 1827 Private Lions 2022 Men's and women's lacrosse Ohio Valley Conference Mercer University Macon, Georgia 1833 Private Bears 2014 Beach volleyball Southern Conference Mercer University Macon, Georgia 1833 Private Bears 2022 Men's lacrosse Southern Conference Robert Morris University Moon Township, Pennsylvania 1921 Private Colonials 2021 Men's lacrosse Horizon League Stephen F. Austin State University Nacogdoches, Texas 1923 Public Ladyjacks 2021 Beach volleyball Western Athletic Conference (UNCW) Wilmington, North Carolina 1947 Public Seahawks 2021 Beach volleyball Colonial Athletic Association Salt Lake City, Utah 1850 Public Utes 2021 Men's lacrosse Pac-12 Conference ==References== * Category:NCAA Division I athletics conferences Category:1978 establishments in the United States",
 "title": "Atlantic Sun Conference"
}