{
 "id": "285786",
 "text": "The NCAA Division I men's basketball tournament (also known as March Madness) is a single-elimination (if you lose a game, you stop playing) college basketball tournament. It has 68 college teams in it. The National Collegiate Athletic Association (NCAA) created it in 1939. When it was started in 1939, only eight teams played in the tournament. The tournament is played from mid- March to early April. 32 of the teams in the tournament are the best teams in each Division I conference. 36 of the teams join the tournament by winning other basketball games. These teams are chosen by the NCAA to be in the tournament. For the tournament, there are four regions. Each team is put into a region. Each region has 16 teams. The tournament has seven rounds. It is three weeks long. The first round is called the First Four. It has eight teams in it. The four winning teams join the tournament. Each team is given a number. It is from 1 to 16. In the tournament, the semifinals are known as the Sweet Sixteen. The finals are known as the Elite Eight. They are named for how many teams are in these rounds. Thirty seven college basketball teams have won the tournament. As of 2023, UCLA has won it eleven times. The Kentucky Wildcats have won it eight times. The coach with the most wins is John Wooden. He coached UCLA. He has won it ten times. == Titles by school == :The following is a list of all schools that have won at least one NCAA men's basketball tournament, along with the year(s) in which they won their championship(s). *Vacated title not included Team # Years 11 1964, 1965, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1975, 1995 8 1948, 1949, 1951, 1958, 1978, 1996, 1998, 2012 6 1957, 1982, 1993, 2005, 2009, 2017 5 1991, 1992, 2001, 2010, 2015 5 1940, 1953, 1976, 1981, 1987 5 1999, 2004, 2011, 2014, 2023, 2024 4 1952, 1988, 2008, 2022 3 1985, 2016, 2018 2 1961, 1962 2 2006, 2007 2 1980, 1986, 2013* 2 1979, 2000 2 1974, 1983 2 1945, 1946 2 1955, 1956 Team # Year 1 1997 1 1994 1 2021 1 1959 1 1950 1 1984 1 1947 1 1954 1 1963 1 1977 1 2002 1 1989 1 1960 1 1939 1 1990 1 1942 1 2003 1 1966 1 1944 1 2019 1 1941 1 1943 Category:College basketball Category:National Collegiate Athletic Association",
 "title": "NCAA Division I men's basketball tournament"
}