{
 "id": "285726",
 "text": "Population Population Population Years passed Year Billion – 1800 1 127 1927 2 33 1960 3 14 1974 4 13 1987 5 12 1999 6 12 2011 7 12 2023* 8 14 2037* 9 18 2055* 10 33 2088* 11 *World Population Prospects 2017 (United Nations Population Division) *World Population Prospects 2017 (United Nations Population Division) *World Population Prospects 2017 (United Nations Population Division) Population growth is the rate at which a population grows or expands. For example, if a population increased from 100 to 110 in a year, then it would have had a population growth of 10% per year. == World population == World population has been rising since the end of the Black Death, around the year 1350. Population began growing rapidly in the Western world during the industrial revolution. Several factors were notable: the coming of modern agriculture, and the control of epidemic diseases (black death, cholera, typhus). Modern water engineering brought clean water to many large cities. Deaths from world wars, especially WWI, reversed the trend, but only for a while. The most significant increase in the world's population has been since the 1950s in Asia and Latin America. Medical advances, and increases in farming, have been the main causes. A single example is both astonishing and revealing. Since 1945, half the forests of Indonesia have been replaced with farmland. As late as 1900, Indonesia was still a densely forested country: forests covered 84 percent of the total land area. Deforestation became serious in the 1970s, and has gone faster since then. About 170 million hectares (estimated in 1900) decreased to less than 100 million hectares by the end of the 20th century.Matthews, Emilly (ed): The State of Forests Indonesia, Bogor 2002, Retrieved 28 May 2010 In 2008, it was estimated that tropical rainforests in Indonesia would be logged out in a decade.China is black hole of Asia's deforestation, Asia News, 24 March 2008 Of the total logging in Indonesia, up to 80% is said to be done illegally.Riskanalys av glas, järn, betong och gips 29 March 2011. s.19–20 ==Related pages== *Overpopulation *Population density ==Further reading== * * YAN Kun(2011). The tendency equation of the population and its limit value in the United Kingdom (Brief annotation of the connection equation(R)), Xi'an: Xi'an Modern Nonlinear Science Applying Institute. == References == ==Other websites== * Category:Population",
 "title": "Population growth"
}