{
 "id": "285849",
 "text": "A cash crop is a crop that is grown to be sold on the market. This is different from a subsistence crop which is grown for the personal use of the farmer, or as food for the farmer's animals. There are several different categories of cash crops, for different purposes. == Foods == Food crops are grown to be eaten by humans or animals. Since modern agriculture(farming) methods allow farmers to grow much more food than they need to feed themselves and their families, the extra is sold to others. Some food crops include: * Wheat, barley, and other grains * Apples, oranges, and other fruits * Potatoes, cabbage, and other vegetables * Mushrooms === Spices and Herbs === Spices and herbs are ingredients added to food in order to make it taste less bland. Spices and herbs do not make up much of a meal but are very flavorful. Since spices and herbs are used in small amounts but can be grown in much larger quantities, the surplus grown is sold as a cash crop. Some spices/herbs include: * Cinnamon * Paprika * Turmeric * Cardamom * Mint * Basil * Pepper == Materials == Material crops are plants which have parts that can be used as raw materials to create objects with. Material crops are not eaten, but sold to the market for usage for various purposes. Some material crops include: * Timber (Wood from trees) * Bamboo * Cotton * Wool == Medicinal/Drug == Medicinal and drug crops are grown for their effects on the human or animal body. Medicinal crops can help with healing, relieving pain, and curing illness. Some medicinal crops can be used to substitute for sugars. Drug crops are crops that are used for recreational purposes and often have addicting effects. Some medicinal crops include: * Aloe Vera * Amla * Basil * Lavender * Lemon grass * Marijuana Some drug crops include: * Tobacco * Marijuana == Decorative == Ornamental plants are crops grown and sold for the purpose of making a place look more attractive. These include flowers, though they can be any plant that decorates an indoor or outdoor space. Ornamental crops are frequently used in gardens, parks, and public places. Some decorative crops include: * Tulips * Roses * Agave == References == Category:Agriculture",
 "title": "Cash crop"
}