{
 "id": "286017",
 "text": "How to Train Your Dragon is a 2010 computer animated fantasy-comedy movie based on the 2003 book of the same name and made by DreamWorks Animation. It was released on March 26, 2010. It received positive reviews with Rotten Tomatoes giving the movie a 99% and Metacritic gave it a 75 out of 100. The movie was nominated for two Academy Awards for Best Animated Feature and Best Original Score. A sequel, How to Train Your Dragon 2, was released on June 13, 2014. A third film, How to Train Your Dragon: The Hidden World, was released on February 22, 2019. In 2026, a computer animated remake will be released. ==Summary== The Viking village of Berk is frequently attacked by dragons that steal livestock and endanger the villagers. Hiccup, the 15-year-old son of the village chieftain, Stoick the Vast, is deemed too weak to fight. Instead, he creates mechanical devices under apprenticeship with Gobber, the village blacksmith. Hiccup uses a bolas launcher to shoot down a Night Fury, a rare dragon, during a dragon raid. He goes into the forest and finds the creature but cannot bring himself to kill it and sets it free instead. Before leaving with his fleet to find and destroy the dragons' nest, Stoick enrolls Hiccup in a dragon-fighting class with fellow teenagers Fishlegs, Snotlout, twins Ruffnut and Tuffnut, and Astrid, on whom Hiccup has a crush. Facing little success in the class, Hiccup returns to the forest and finds the Night Fury in a cove, unable to fly because Hiccup's bolas tore off half his tail fin. Hiccup gradually befriends the dragon, naming him 'Toothless' after his retractable teeth, and designs a harness and prosthetic fin that allows Toothless to fly with Hiccup riding him. Learning dragon behavior from Toothless, Hiccup is able to subdue the captive dragons during training, earning admiration from his peers, but sparking suspicion and jealousy from Astrid. Stoick's fleet returns home unsuccessful after being destroyed by a massive dragon. Hiccup must kill a dragon for his final exam. He tries to run away with Toothless, but Astrid discovers the dragon. Hiccup takes her for a flight to demonstrate that Toothless is friendly. During the flight, Toothless is hypnotically drawn to the dragons' nest. There, a gargantuan dragon named the Red Death summons smaller dragons to feed it copious amounts of live food to avoid being eaten themselves. Realizing the dragons have been forced to attack Berk to survive, Astrid wishes to tell the village, but Hiccup advises against it to protect Toothless. In his final exam, Hiccup faces a captive Monstrous Nightmare dragon and tries to subdue him to prove that dragons can be peaceful. When Stoick unintentionally enrages the dragon into attacking, Toothless arrives to protect Hiccup but is captured. Stoick furiously confronts his son for his deception until Hiccup accidentally reveals that Toothless knows the location of the dragons' nest. Stoick disowns Hiccup and sets off for the nest with Toothless guiding the Vikings. Astrid prompts Hiccup to realize that he spared Toothless out of compassion, not weakness. Regaining his confidence, Hiccup shows his friends how to befriend the training dragons, and they set out after Toothless. Stoick and his Vikings locate and break open the dragon's nest, awakening the Red Death, which overwhelms them. Hiccup and his friends ride in on the training dragons, distracting the Red Death. Hiccup attempts to free Toothless; Stoick rescues them, reconciling with his son. Toothless and Hiccup destroy the Red Death through teamwork. Whilst escaping the explosion, Hiccup gets knocked off Toothless. The Vikings and Stoick find out that Toothless saved Hiccup from the explosion by covering him with his wings, but Hiccup has lost his lower left leg. Some time later, Hiccup awakes back on Berk and finds that Gobber has fashioned him a prosthetic. He is now admired by his village, including Astrid, who kisses him. Berk begins a new era of humans and dragons living in peace. ==Voice cast== * Jay Baruchel as Hiccup Horrendous Haddock III * Gerard Butler as Stoick the Vast * Craig Ferguson as Gobber the Belch * America Ferrera as Astrid Hofferson * Christopher Mintz-Plasse as Fishlegs Ingerman * Jonah Hill as Snotlout Jorgenson * T. J. Miller as Tuffnut Thorston * Kristen Wiig as Ruffnut Thorston * David Tennant as Spitelout ==Related pages== *How to Train Your Dragon's Official website * * Category:2010 3D movies Category:2010 animated movies Category:2010 fantasy movies Category:2010 comedy movies Category:2010 movies Category:American fantasy-comedy movies Category:Movies based on books Category:Movies about dragons Category:DreamWorks Animation movies Category:American 3D animated movies",
 "title": "How to Train Your Dragon (movie)"
}