{
 "id": "286193",
 "text": "Mercedes Ruehl (born February 28. 1948) is an American stage, television and motion picture actress. She was born in New York City. She is best known for her supporting role in the 1991 movie The Fisher King. ==Work== ===Movies=== Year Movie Role Other notes 1976 Dona Flor and Her Two Husbands American girl in casino 1979 The Warriors Policewoman in Central Park 1981 Four Friends Woman in Taxi 1986 Twisted Cybelle 1986 Heartburn Eve 1987 Leader of the Band Miss Cooper 1987 Radio Days Ad Men 1987 84 Charing Cross Road Kay 1987 The Secret of My Success Sheila 1988 Big Mrs. Baskin 1988 Married to the Mob Connie Russo National Society of Film Critics Award for Best Supporting Actress 1989 Slaves of New York Samantha 1989 Crimes and Misdemeanors Party Guest uncredited 1990 Crazy People Dr. Liz Baylor 1991 Another You Elaine 1991 The Fisher King Anne Napolitano Academy Award for Best Supporting Actress Boston Society of Film Critics Award for Best Supporting Actress Chicago Film Critics Association Award for Best Supporting Actress Golden Globe Award for Best Supporting Actress - Motion Picture Los Angeles Film Critics Association Award for Best Supporting Actress Saturn Award for Best Supporting Actress 1993 Lost in Yonkers Bella Kurnitz 1993 Last Action Hero Irene Madigan 1994 On Hope Wendy 1995 Indictment: The McMartin Trial Lael Rubin 1997 Roseanna's Grave Roseanna 'Rosa' 1999 The Minus Man Jane Durwin 1999 Out of the Cold Tina 2000 Spooky House Boss 2000 What's Cooking? Elizabeth 'Lizzy' Avila 2000 More Dogs Than Bones Victoria 'Vic' Galletti 2000 The Amati Girls Grace 2004 Zeyda and the Hitman Esther 2007 A Happy Death Aunt Rosa 2009 Loving Leah Janice Lever ===Television=== Year Title Role Notes 1984 Mom's on Strike Sandy 1985 Our Family Honor Louise Taylor Episode: \"Homecoming\" 1986 Kate & Allie Millie Episode: \"Late Bloomer\" 1990 Bernadette Foley Episode: \"The Moves\" 1995 Indictment: The McMartin Trial Lael Rubin 1995–1996 Frasier Kate Costas 5 episodes 1997 SUBWAY Stories: Tales from the Underground Leyla Segment: \"Underground\" 1997 North Shore Fish Florence 1998 Gia Kathleen Carangi 2000 All-American Girl: The Mary Kay Letourneau Story Jane Newhall 2000 Rebecca Hallmark Hall of Fame 2001 Mr. Life 2002 Guilt by Association Susan Walker 2002 Widows Dolly Rawlins Miniseries 2004 1-800-Missing Emanuelle Baker Episode: \"These Dreams Before Me\" 2004 Bad Apple Lorraine Gibbons 2004 Law & Order Zina Rybakov Episode: \"All in the Family\" 2005 Mom at Sixteen Terry Jeffries Nominated — Prism Award Performance in a TV Movie or Miniseries 2006 Entourage Rita Chase Episodes: \"Aquamom\" and \"Return To Queens Blvd\" 2006 A Girl Like Me: The Gwen Araujo Story Sylvia Guerrero Nominated — Imagen Award for Best Actress - Television 2007 Psych Detective Goochberg Episode: \"Scary Sherry: Bianca's Toast\" 2009 Law & Order Judge Clara Lloyd Episode: \"By Perjury\" Category:1948 births Category:Living people Category:American movie actors Category:American stage actors Category:American television actors Category:Actors from New York City",
 "title": "Mercedes Ruehl"
}