{
 "id": "286289",
 "text": "James Reiher Snuka (born James Wiley Smith; May 18, 1943 – January 15, 2017) was a Fijian-American professional wrestler. He is better known by his ring name, Jimmy \"Superfly\" Snuka. His first match was in 1967. Snuka is one of the most remembered wrestlers, along with Hulk Hogan, Ted DiBiase, and more. His daughter Tamina Snuka currently works for the WWE. His son Jimmy Snuka, Jr. also worked for the company. He retired from wrestling in 2015. In August 2015, his wife announced that Snuka was diagnosed with stomach cancer. On September 1, 2015, Snuka was arrested and charged with third-degree murder and involuntary manslaughter in the 1983 death of his girlfriend Nancy Argentino at an Allentown, Pennsylvania hotel. The charges were dismissed in 2017, because of Snuka's terminal illness and dementia. Snuka died of stomach cancer on January 15, 2017 in Pompano Beach, Florida, aged 74. After his death, an autopsy revealed that Snuka had been suffering from chronic traumatic encephalopathy (CTE). ==Championships== *All Japan Pro Wrestling **World's Strongest Tag Team League (1981) (with Bruiser Brody) *Catch Wrestling Association **CWA British Commonwealth Championship (1 time) *Cauliflower Alley Club **Other honoree (1996) *Continental Wrestling Association **CWA International Tag Team Championship (one time) (with JT Southern) *Eastern Championship Wrestling **NWA ECW Heavyweight Championship (two times, Inaugural)one **NWA ECW Television Championship (one time) *Georgia Championship Wrestling **NWA National Tag Team Championship (one time) (with Terry Gordy) *International Wrestling Superstars **IWS United States Championship (one time) *Mid-Atlantic Championship Wrestling **NWA United States Heavyweight Championship (Mid-Atlantic version) (one time) **NWA World Tag Team Championship (Mid-Atlantic version) (two times) (with Paul Orndorff (one) and Ray Stevens (one)) *NWA All-Star Wrestling **NWA Canadian Tag Team Championship (Vancouver version) (one time) (with Don Leo Jonathan) *NWA Big Time Wrestling **NWA Texas Heavyweight Championship (one time) **NWA Texas Tag Team Championship (one time) with Gino Hernandez *NWA Tri-State Wrestling **NWA Tri-State Heavyweight Championship (one time) *Pacific Northwest Wrestling **NWA Pacific Northwest Heavyweight Championship (five times) **NWA Pacific Northwest Tag Team Championship (six times) with Dutch Savage *Professional Wrestling Hall of Fame **Class of 2012 *Pro Wrestling Illustrated **PWI Match of the Year (1982) (vs. Bob Backlund in a cage match on June 28) **PWI Most Popular Wrestler of the Year (1983) **PWI Tag Team of the Year (1980) (with Ray Stevens) **He was ranked #29 of the 500 best singles wrestlers by PWI during the \"PWI Years\" in 2003. *Universal Superstars of America **USA Heavyweight Championship (2 times) *USA Pro Wrestling **USA Pro New York Heavyweight Championship (1 time) *World Wide Wrestling Alliance **WWWA Heavyweight Championship (one time) *World Wrestling Federation **WWE Hall of Fame (Class of 1996) *Wrestling Observer Newsletter awards **Tag Team of the Year in 1981 with Terry Gordy **Best Flying Wrestler in 1981 **Best Wrestling Maneuver in 1981 and 1983 for the Superfly Splash. == Footnotes == ==References== ==Other websites== * Category:1943 births Category:2017 deaths Category:American professional wrestlers Category:Fijian sportspeople Category:Former WWE wrestlers Category:Deaths from stomach cancer Category:WWE Hall of Fame",
 "title": "Jimmy Snuka"
}