{
 "id": "286295",
 "text": "Sienna Rosie Diana Miller (born 28 December 1981 FilmReference.com notes \"born December 28, 1981 (some sources say 1982)\" at Sienna Miller Biography (1981?-).) is an American-born British actress. model and fashion designer. She has starred in Layer Cake, Alfie, Factory Girl, \"G.I. Joe: Rise of the Cobra\" and The Edge of Love. She was nominated for the Orange Rising Star Award in 2008. ==Early life== Sienna Rose Diana Miller was born on December 28, 1981 in New York City, United States. She is the daughter of a South African-born mother and American father. She has lived in England for most of her life and has dual citizenship - American and British. ==Modeling== Before her professional acting career, Miller worked as a photographic model. She signed with Tandy Anderson of Select Model Management London. She modeled for Coca-Cola, Italian Vogue, and posed topless in the 2003 Pirelli Calendar. Miller signed a two-year contract with Pepe Jeans London. The jeans ad campaign first appeared in magazines March 2006. In February 2009, Hugo Boss Fragrances said that Miller would be the new ambassador for their BOSS Orange women's perfume. ==Personal life== Miller's had a relationship with Jude Law, her co-star from Alfie. On Christmas Day 2004, they became engaged. On July 8, 2005, Law issued a public apology to Miller for having an affair with the nanny of his children. After trying to mend their relationship, Miller and Law finally separated the following November. In 2008, Miller had a highly publicized affair with married actor Balthazar Getty. Miller later sued two British tabloids over the publication of photos showing her and Getty together. She was in a relationship actor Tom Sturridge between 2011 and 2015. They have a daughter, Marlowe Ottoline, born in July 2012. ==Filmography== Movie Year Title Role Notes 2001 South Kensington Sharon 2002 High Speed Savannah 2002 Sara 2004 Layer Cake Tammy 2004 Alfie Nikki 2005 Casanova Francesca Bruni 2006 Factory Girl Edie Sedgwick 2007 Interview Katya 2007 Camille Camille Foster 2007 Stardust Victoria 2008 Jane Bellwether 2008 A Fox's Tale Darcey (voice) 2008 Caitlin Macnamara 2009 G.I. Joe: The Rise of Cobra Ana Lewis/Anastascia DeCobray/The Baroness 2011 Two Jacks Diana Completed 2012 Just Like a Woman Completed 2012 Yellow Xanne Completed 2013 A Case of You Filming 2013 Alfred Hitchcock and the Making of the Birds Tippi Hedren Television Year Title Role Notes 2002 Babe 1 episode 2002 Bedtime Stacey 4 episodes 2003–2004 Keen Eddie Fiona Bickerton 13 episodes 2009/2011 Top Gear Herself 2 episodes ==Awards== Year Award Category Movie Result 2007 Environmental Media Awards EMA Futures Award – Independent Spirit Awards Best Female Lead Interview London Film Critics Circle Awards British Actress of the Year Interview 2008 BAFTA Rising Star Award – BIFA Award Best Supporting Actress The Edge of Love 2009 ShoWest Awards Best Supporting Actress The Edge of Love 2010 Golden Raspberry Award Worst Supporting Actress \"G.I. Joe: The Rise of Cobra\" ==References== Category:Actors from New York City Category:American fashion designers Category:American movie actors Category:American stage actors Category:American television actors Category:British fashion designers Category:English models Category:English movie actors Category:English stage actors Category:English television actors Category:Models from New York City Category:1981 births Category:Living people",
 "title": "Sienna Miller"
}