{
 "id": "286287",
 "text": "Arthur Griffith (; March 31, 1871 – August 12, 1922) was the founder of Sinn Fein, which became the political wing of the Irish Republican Army. Griffith's opposition to British domination was based on his rejection of the legality of the Act of Union of Great Britain and Ireland in 1800, despite the treaty having been signed voluntarily between the two kingdoms. Elected to the parliament in 1918, he was also responsible for the 1921 Anglo-Irish Treaty setting up the Irish Free State. ==Antisemitism== Despite Griffith's role in Ireland's achievement of independence, he was known for his antisemitism IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. As an editor of the United Irishman, Griffith took an \"Anti-Dreyfusard\" line, writing in 1899 to defend the conviction of \"the Jew traitor\" Dreyfus and accuse the Dublin press of being \"almost all Jew rags\" and decrying * * Other editorials in Griffith's United Irishman that year expressed concern about a conspiracy where \"the Jew capitalist has got a grip on the lying Press of Civilization from Vienna to New York and further\", and concluded \"we know that all Jews are pretty sure to be traitors if they get the chance.\" In late 1899, the United Irishman published an article by Griffith stating: The antisemitism found in the pages of the United Irishman during Griffth's editorial tenure has been credited with shaping various aspects of Joyce's Ulysses, especially in the \"Cyclops\" episode. In 1904, a piece in the paper voiced support for the Limerick boycott, a boycott of Jewish businesses in Limerick organised by a local priest, declaring that Griffith ignored the fact that the Jews of Limerick had little or no involvement in moneylending or similar practices. The United Irishman also published articles by Oliver St. John Gogarty that contained antisemitic sentiments, which were common among Irish Catholics back then. ==Related pages== * Dublin * Ireland * Pogrom * Antisemitism * Antisemitism in Europe * The Protocols of the Elders of Zion ==References== Category:1872 births Category:1922 deaths Category:Irish Free State Category:Irish republicanism Category:Sinn Féin members of Dáil Éireann Category:Sinn Féin MPs",
 "title": "Arthur Griffith"
}