{
 "id": "286359",
 "text": "In mathematics, an operation is a function which takes one or more inputs (named operands) and produces an output. Common operations are addition, subtraction, multiplication and division, all of which take two inputs and produce an output. These are called binary operations and are frequently used when solving math problems. Other kinds of operations are named unary operations, which take only one input and produce an output. There are more operations than these, including raising numbers to exponents, taking the root and applying the logarithm. Below is a list of the most useful operations. == List of mathematical operations == === Addition === Addition is the first arithmetic operation and hyperoperation. It is the inverse operation of subtraction. The terms in an addition are named addends, and the result of an addition is named a sum. The symbol for addition is + Examples: 2+3=5 7+1=8 1+4+6=11 8+1+5=14 2+5+9=16 Any number plus zero is the same number (a+0=a). This is named the additive identity. For example: 4+0=4 Changing the order of the addends in an addition does not change its sum. This is named the commutative property of addition. For example: 31+27\\iff27+31 Changing how addends are grouped in an addition does not change its sum either. This is named the associative property of addition. For example: (14+15)+92\\iff14+(15+92) ==== Additive inverses (opposites) ==== The opposite of a number n is -n. A number n plus its opposite -n is always equal to 0: n+-n=0 For example, the opposite of 5 is -5, because -5+5=0 The absolute value of two opposite numbers is always the same. === Subtraction === Subtraction is the second arithmetic operation and the inverse operation of addition. The number that is being subtracted is the subtrahend and the number it is subtracted from is the minuend. The result of a subtraction is named a difference. The symbol for subtraction is − Examples: 2-4-5=-7 6-1=5 -1-8=-9 3-3=0 0-9-8=-17 7-8=-15 Because of the additive identity, any number minus zero is the same number (n-0=n). In a subtraction of two terms, switching the minuend and the subtrahend changes the sign of the answer, meaning subtraction is anticommutative. For example: 15-4=11 and 4-15=-11 === Multiplication === Multiplication is the third arithmetic operation and the second hyperoperation. It is the inverse operation of division. The terms in a multiplication are named factors, and the result of a multiplication is named a product. Multiplication is repeated addition. The symbol for multiplication is × or n (• in algebra and * in most programming languages). Examples: 6\\times7=42 4\\times4=16 9\\times0=0 1\\times2\\times3=6 8\\times5=40 Any number times one is the same number (x\\cdot1=x). This is named the multiplicative identity. For example: 6\\times1=6 Changing the order of the factors in a multiplication does not change its product. This is named the commutative property of multiplication. For example: 4\\times5\\iff5\\times4 Changing how factors are grouped in a multiplication does not change its product either. This is named the associative property of multiplication. For example: (3\\times4)\\times5\\iff3\\times(4\\times5) Multiplication can also be implied with fractions and letters. For example, 2a means 2\\cdot a, and xy means x\\cdot y. With the Hindu-Arabic numerals, putting two digits next to each other could be misunderstood (e.g. 235 is read as \"two hundred and thirty-five\" and not 23\\cdot5). Instead, one of the numbers (normally the second) is put in brackets. For example: 3(2)\\iff3\\cdot2 ==== Multiplicative inverses (reciprocals) ==== The reciprocal of a number x is \\bar x. A number x times its reciprocal \\bar x is always equal to 1: x\\cdot\\bar x=1 For example, the reciprocal of 3 is 1/3, because 3\\times\\bar3=1 To get the reciprocal of a fraction, switch the numerator and the denominator: the reciprocal of \\frac27 is \\frac72 === Division === Division is the fourth arithmetic operation and the inverse operation of multiplication. The number that is being divided is the dividend and the number it is divided by is the divisor. The number on top of a fraction is named the numerator and the number at the bottom is named the denominator. The result of a division is named a quotient. Division is repeated subtraction. The symbol for division is ÷, /, : or . Examples: 3/7=0.428 2/3=0.666 3/4=0.75 0/6=0 5/9/8=0.069 Because of the multiplicative identity, any number divided by one is the same number (y/1=y). Division by zero is undefined (d/0=\\textrm{undefined}). In a fraction, switching the numerator and the denominator gives the reciprocal of the fraction. For example: \\frac24=\\bar{\\frac42} === Exponentiation === Exponentiation is the fifth arithmetic operation and the third hyperoperation. It is one of the inverse operations of roots and logarithms. The number that is being multiplied is the base and the number of times it is multiplied is the exponent. The result of an exponentiation is named a power. Exponentiation is repeated multiplication. The symbol for exponentiation is ^ or ⁿ. Examples: 11^1=1\\times11=11 3^2=1\\times3\\times3=9 2^3=1\\times2\\times2\\times2=8 5^0=1 7^{-1}=1/7=0.\\overline{142857} 13^{-2}=1/13^2\\approx0.006 Because of the multiplicative identity, the first power of any number is the same number, and the zeroth power of any number is one (b^1=b and b^0=1). === Roots === Roots are the sixth arithmetic operation and one of the inverse operations of exponentiation and logarithms. The first term is named the index, and the second term is named the radicand. The result of a root is named a base. When there is no index, this means it is a square (index 2) root. The symbol for roots is √. Examples: \\sqrt4=2 \\sqrt121=11 \\sqrt[3]{343}=7 \\sqrt[4]{81}=3 \\sqrt[3]{-125}=-5 The first root of any number is the same number (\\sqrt[1]{k}=k). === Logarithms === Logarithms are the seventh arithmetic operation and one of the inverse operations of exponentiation and roots. The first term is named the base, and the second term is named the power. The result of a logarithm is named an exponent. When there is no base, this means it is a decimal (base 10) logarithm. The symbol for logarithm is ㏒. Examples: \\log100=2 \\log_{2}{1024}=10 \\log_{3}{27}=3 \\log_{2}{128}=7 \\log_{3}{729}=6 The logarithm of 1 (\\log_b1) is 0 in every base. This is because m^0=1 The logarithm base e, or natural logarithm, is written as \\ln x. === Modulation === Modulation is the eighth arithmetic operation. It gives the remainder of a division. The first term is named the modulend and the second term is named the modulator. The result of a modulation is named a modulus. The symbol for modulation is \\ Examples: 5\\backslash2=1 20\\backslash7=6 0\\backslash3=0 9\\backslash8=1 22\\backslash4=2 0\\backslash x is always equal to zero, because zero can be divided by any number (0/x=0). === Factorial === Factorial is a function which gives the number of ways to arrange n objects. The term is named the index. The result of a factorial is also named a factorial. The symbol for factorial is ! The first factorials are: 0!=1 1!=1 2!=2 3!=6 4!=24 5!=120 0! is equal to one because there is exactly one way of arranging 0 objects. Factorials are undefined for negative integers. Factorials of fractional numbers can be calculated using the Gamma function. === Absolute value === Absolute value is a function which gives the distance from zero (or magnitude) of a number. The symbol for absolute value is |x| Examples: |147|=147 |-321|=321 |96|=96 |-358|=358 |0|=0 The absolute value of a-b is the same as the absolute value of b-a (|a-b|=|b-a|). This is because subtraction is anticommutative. == Related pages == * Algebra * Arithmetic * Operand * Operator * Order of operations * Hyperoperation == References == Category:Arithmetics Category:Mathematics",
 "title": "Operation (mathematics)"
}