{
 "id": "286363",
 "text": "The 39 Clues is a set of five series of ten adventure novels written by different authors including Rick Riordan, Gordon Korman, Peter Lerangis, Jude Watson, Patrick Carman, Linda Sue Park, Margaret Peterson Haddix, Roland Smith, David Baldacci, Jeff Hirsch, Natalie Standiford, C. Alexander London, Sarwat Chadda and Jenny Goebel. In the series, the two main characters are Dan and Amy Cahill. They are published by Scholastic Press in the United States. Steven Spielberg bought the movie rights to the series in June 2008. Universal Pictures bought the rights in 2013 but in 2023 no movie has appeared. ==Characters== ===Cahill Branches=== The fictitious Cahill family has supposedly changed the world more than any other family. Most famous people are apparently Cahills. They are split into five branches, the Lucians, Ekatrinas, Tomas, Janus, and Madrigal. The Lucians are good leaders and spies, and are also good with poisons. The Ekaterinas are very inventive and good scientists. The Tomas are very tough and strong. The Janus are very creative and good artists, musicians, and authors. The Madrigals are trying to keep their other family members from being too violent/getting all 39 clues. ===Characters=== Dan Cahill is an 11-year-old boy who likes ninjas, video games, eating, gross stuff, and collecting things. Dan has asthma, but a photographic memory. Amy Cahill is a 14-year-old girl who likes reading and museums. She is scared of public speaking. Dan and Amy live in Boston, Massachusetts Grace Cahill is Dan and Amy's recently deceased (dead) grandmother. She took them to museums, and secretly got them ready for the hunt. Amy, Dan, and Grace are Madrigals. Nellie Gomez is their au pair. She is about 22 years old, and can speak a lot of languages and fly an airplane. She has dyed (colored) hair. Isabel Kabra is a Lucian and Dan and Amy's main enemy. She is very mean and has tried to kill both of them at different times. Her children, Ian and Natalie Kabra help her. Irina Spasky is a Lucian woman in her 40s or 50s. She appeared to be Dan and Amy's enemy, but turns out to be their ally. Alistair Oh is a 64-year-old Korean man. His branch is Ekaterina. He has formed an alliance with Amy and Dan, but ends up betraying (breaking a promise) them. He is Bae Oh's nephew. Jonah Wizard is a 15-year-old Janus boy and world-famous pop star. His mother, Cora Wizard, really pushes him to do well, and his father, Broderick Wizard, types on his BlackBerry a lot. The Starling triplets, Ned, Ted, and Sinead are Ekaterinas who were severely injured in a bomb blast in Book 1, but get back in the hunt in Book 10. The Holts are a Tomas family of five. They are all very strong. Amy and Dan made a temporary alliance with 15 year old Hamilton Holt. ==Plot== In Book 1, the Cahills learn that their family is the most powerful family in the world. They split into groups and start on the clue hunt. They go to places where Benjamin Franklin went, including Boston, Philadelphia, and Paris. In Book 2, Amy and Dan go to a monastery in the Alps, [where they are chased by monks], and Venice. In Book 3, they go to Japan and South Korea, where they team up with Alistair, but he later abandons them. In Book 4, they go to a tomb in an Egyptian pyramid where they meet Irina. In Book 5, Amy and Dan team up with the Holts to go to different cities throughout Russia. They have to go to five cities in 36 hours to get into the Amber Room, which holds the fifth clue. In Book 6, they go to a mine in Australia and almost get killed by Isabel. Irina turns out to be their ally, but then she dies in a fire in Indonesia caused by Isabel. In Book 7, Amy and Dan go to Pretoria, in South Africa. While they are there, they barely escape out of a Tomas stronghold and discover that they are Madrigals. In Book 8, Amy and Dan go to China, where they get separated. Dan stays with Jonah and his family for a while, but eventually he takes a train to Lhasa, near Mount Everest. In a village near Lhasa, Dan meets Amy as they both try to take a helicopter to go to Mount Everest. In Book 9, they go to the Caribbean, where they learn more about their family branch, and that they need to unite the family. In Book 10, they go to England and Amy and Dan successfully unite the family. They do this by having to go through a cave with explosions. == References == Category:Series of books Category:2000s books",
 "title": "The 39 Clues"
}