{
 "id": "286373",
 "text": "Glenn Ford (May 1, 1916 - August 30, 2006) was an American actor, born in Canada. == Biography == Born Gwyllyn Samuel Newton Ford in Quebec City, Canada. He was the son of a Canadian railroad worker. Glenn studied at Santa Monica High School. After graduating he started working in small local theatres. Glenn Ford interrupted his actor career in 1942 to enlist as a volunteer in The Marine Corps of The United States during World War II. Ford was assigned in 1943 to active duty in San Diego Base. Then be promoted to sergeant Glenn Ford also joined the Naval Reserve United States in 1958 and was promoted to lieutenant commander. Ford touts the Navy through radio and television spectacles. He was promoted to captain in 1968. Glenn Ford was married four times, and a son, Peter Ford. He died at 90 years old on August 30, 2006 at his residence of Beverly Hills. ==Career== His first film work, was a short Night in Manhattan (1937). He is remembered for playing the role of Johnny Farrell in Classic movie Gilda (1946), with Rita Hayworth. His long list of movie include The Adventures of Martin Eden (1942), The Doctor and the Girl (1949), Plunder of the Sun (1953), Torpedo Run (1958), Experiment in Terror (1962), Four Horsemen of the Apocalypse (1962), Dear Heart (1964), Is Paris Burning? (1966), Midway (1976). He also participated in the movie of 1978 Superman, playing the role of Jonathan Kent Superman's father. Among his most notable roles are that of the incorruptible Detective. Sgt Dave Bannion, who must fight against the Mafia, in The Big Heat (1953), also he played role of school teacher who is harassed by his students in Blackboard Jungle (1955). He had starred in big Western movies, in the history of Hollywood as Texas (1941), The Desperadoes (1943), with Randolph Scott, The Man from Colorado (1948), with William Holden, Lust for Gold (1949), The Redhead and the Cowboy (1951), The Man from the Alamo (1953), The Violent Men (1955), Jubal (1956), with Ernest Borgnine, The Fastest Gun Alive (1956), 3:10 to Yuma (1957), Cowboy (1958), The Sheepman (1958), Cimarrón (1960), A Time for Killing (1967), The Last Challenge (1967), Day of the Evil Gun (1968), and Heaven with a Gun (1969). His latest western movies are: Santee (1973). In 1962, Glenn Ford won a Golden Globe, as best actor for the movie Pocketful of Mir, directed by Frank Capra. For his outstanding career in the movies, Glenn Ford star on the Hollywood Walk of Fame at 6933 Hollywood Boulevard. He was also inducted into the Hall of Fame Western artists at the National Cowboy & Western Heritage Museum in Oklahoma City, Oklahoma. ==Television== In 1971 he starred in the CBS television series Cade's County, he plays county sheriff Sam Cade, is a must fight against crime. in this series works the son of Glenn Ford, Peter Ford. Glenn Ford has had great performances in movies and series for television The Brotherhood of the Bell (1970), The Greatest Gift (1974), The Disappearance of Flight 412 (1974), The 3,000 Mile Chase (1977), Police Story: No Margin for Error (1978), The Sacketts (1979), his last role was that of Rev. Rogers, in drama Final Verdict (1991). == Filmography == Movie Año Title Role Note 1937 Night in Manhattan Emcee Gwyllyn Ford 1939 Heaven with a Barbed Wire Fence Joe Riley 1939 My Son Is Guilty Barney 1940 Convicted Woman Jim Brent 1940 Men Without Souls Johnny Adams 1940 Babies for Sale Steve Burton 1940 The Lady in Question Pierre Morestan 1940 Blondie Plays Cupid Charlie 1941 So Ends Our Night Ludwig Kern 1941 Texas Tod Ramsey 1941 Go West, Young Lady Sheriff Tex Miller 1942 The Adventures of Martin Eden Martin Eden 1942 Flight Lieutenant Danny Doyle 1943 The Desperadoes Cheyenne Rogers 1943 Destroyer Mickey Donohue 1946 Gilda Johnny Farrell 1946 A Stolen Life Bill Emerson 1946 Gallant Journey John J. Montgomery 1947 Framed Mike Lambert 1948 The Mating of Millie Doug Andrews 1948 The Man from Colorado Col. Owen Devereaux 1948 The Loves of Carmen Don José 1948 The Return of October Prof. Bassett Jr 1949 The Undercover Man Frank Warren 1949 Lust for Gold Jacob Walz 1949 Mr. Soft Touch Joe Miracle 1949 The Doctor and the Girl Dr. Michael Corday 1950 The White Tower Martin Ordway 1950 Convicted Joe Hufford 1950 The Flying Missile Cmdr. William A. Talbot 1951 The Redhead and the Cowboy Gil Kyle 1951 Follow the Sun Ben Hogan 1951 The Secret of Convict Lake Jim Canfield 1952 The Green Glove Michael Blake 1952 Young Man with Ideas Maxwell Webster 1952 Affair in Trinidad Steve Emery 1953 Time Bomb Maj. Peter Lyncort 1953 The Man from the Alamo John Stroud 1953 Plunder of the Sun Al Colby 1953 The Big Heat Det. Sgt. Dave Bannion 1953 Appointment in Honduras Steve Corbett 1954 City Story Narrator 1954 Human Desire Jeff Warren 1955 The Americano Sam Dent 1955 The Violent Men John Parrish 1955 Blackboard Jungle Richard Dadier 1955 Interrupted Melody Dr. Thomas King 1955 Trial David Blake 1956 Ransom! David G. Stannard 1956 Jubal Jubal Troop 1956 The Fastest Gun Alive George Temple 1956 The Teahouse of the August Moon Capt. Fisby 1957 3:10 to Yuma Ben Wade 1957 Don't Go Near the Water Lt. J.G. Max Siegel 1958 Cowboy Tom Reese 1958 The Sheepman Jason Sweet 1958 Imitation General Sgt. Murphy Savage 1958 Torpedo Run Lt. Cmdr. Doyle 1959 It Started with a Kiss Sgt. Joe Fitzpatrick 1959 The Gazebo Elliott Nash 1960 Cimarron Yancey 'Cimarron' Cravat 1961 Cry for Happy CPO Andy Cyphers 1961 Pocketful of Miracles Dave the Dude Golden Globe Award for Best Actor – (Glenn Ford) 1962 The 4 Horsemen of the Apocalypse Julio Desnoyers 1962 Experiment in Terror John 'Rip' Ripley 1963 The Courtship of Eddie's Father Tom Corbett 1963 Love Is a Ball John Lathrop Davis 1964 Advance to the Rear Captain Jared Heath 1964 Fate Is the Hunter Sam C. McBane 1964 Dear Heart Harry Mork 1965 The Rounders 1965 The Money Trap Joe Baron 1966 Is Paris Burning? Lt. Gen. Omar N. Bradley 1966 Rage Doc Reuben 1967 A Time for Killing Maj. Tom Wolcott 1967 The Last Challenge Marshal Dan Blaine 1968 Day of the Evil Gun Lorn Warfield 1969 Smith! Smith 1969 Heaven with a Gun Jim Killian 1973 Santee Santee 1976 Midway Rear Admiral Raymond A. Spruance 1978 Superman Kent phather 1979 The Visitor Det. Jake Durham 1979 Day of the Assassin Christakis 1980 Virus President Richardson 1981 Happy Birthday to Me Dr. David Faraday 1989 Casablanca Express Major Gen. Williams 1991 Raw Nerve Capt. Gavin == References == ==Other websites== * * * Official family- sanctioned website for fans to send condolences * Official family-run website about upcoming biography * Glenn Ford biography at Northern Stars * * Interview with David Priol and Peter Ford on the Official Glenn Ford Website * Photographs and literature Category:American movie actors Category:Golden Globe Award winning actors Category:Canadian movie actors Category:American television actors Category:American stage actors Category:Naturalized citizens of the United States Category:Canadian television actors Category:Canadian stage actors Category:Deaths from stroke Category:1916 births Category:2006 deaths Category:People from Quebec City",
 "title": "Glenn Ford"
}