{
 "id": "2866",
 "text": "The Bible, also known as the Holy Bible, is a group of religious texts central to Judaism and Christianity. The Bible contains both the Old Testament and the New Testament. It is the best-selling book in the world. A number of its texts are also found in the Hebrew Bible used in Judaism. Many Christians believe that the Bible is the word of God. The Bible is divided into books. In fact, the word \"Bible\" comes from the Greek word τὰ (biblía), which means \"books\" in English. Each book includes a number of individual writings. Some books combine texts that may have been written or collected by the same person. The books of the Bible focus on various subjects, including: * The history of the Jews, Jesus, or Jesus' followers * Collections of wise sayings * Songs of praise to God * God's commands to his people, which he expects them to obey * Prophecy (the Bible says these are messages from God that he gave through chosen people called prophets) Not all groups of Christians agree on which texts should be included in the Bible. Christian Bibles range from the 66 books of the Protestant canon to 81 books in the Ethiopian Orthodox Bible. The oldest surviving Christian Bible is the Codex Sinaiticus, a Greek manuscript from the fourth century AD.Codex Sinaiticus: http://codexsinaiticus.org/en/codex/ The oldest complete Hebrew manuscripts date from the Middle Ages. ==How it was written== The Bible was written long ago in Aramaic, Hebrew, and Greek. For a long time, people passed its texts from generation to generation through oral tradition: by word of mouth. After the Bible was translated into Latin and other languages, it became easier for people to share the written Bible. Now there are translations in English, Simple English, and hundreds of other languages. The books of the Hebrew Bible—what Christians call the Old Testament—were written at different times during the course of about 1200 years. The Hebrew people began to put all of these books together around 400 B.C. Five hundred years later, around 100 A.D., believers began to collect the books of the New Testament. Originally written in Greek, it tells about things that happened between 4 B.C. and 70 A.D. It tells the stories of Jesus's birth, life, death, and resurrection. It describes how Jesus's followers went around spreading his message. It ends with a description of how the world will end when Jesus returns to earth. Believers say that most of the New Testament was written by Jesus's apostles. These were people who said they had seen Jesus alive after his crucifixion. === Translations and versions === There is not one single version of the Bible; both the content of the books and their order may change. Followers of Judaism and Christianity consider the Bible sacred, but they do not all agree about what belongs in it. Different denominations include certain parts or leave out other parts. The texts considered to be part of the Bible have changed over time. Translations also vary because languages do not match up exactly. Translators have to decide between translating things word for word, or using different words to capture the sense of the text. ==== Early translations ==== In the 4th century, a Gothic bishop named Ulfilas (Wulfila) translated the Bible into the Gothic language. In the early 5th century, Saint Jerome created an important Latin version of the Bible called the Vulgate. Later, in the early Middle Ages, people like Petrus Valdes and Jan Hus provided translations. ==== Middle Ages ==== The New Testament was first translated into English in 1382 by John Wycliffe. (His associates translated the Old Testament.) He used the Vulgate Bible for his translation, which he wrote in Middle English, the language of his day. Wycliffe wanted to translate the Bible into common language so that people could see for themselves what it said. He did not have the Church's permission to do this, but he was protected by John of Gaunt, one of the most powerful men in the kingdom. After Wycliffe and John of Gaunt were both dead, in 1415, the Church declared Wycliffe a heretic and banned his writings. Wycliffe's translations challenged the Church's authority over the people. In church, explaining the Bible was the priest's work. Whatever he said could not be challenged. But if ordinary people could read the Bible, they might have other opinions. The Council of Constance decreed that Wycliffe's works should be burned and his remains exhumed (dug up). ==== The first English translations ==== In 1525, William Tyndale translated the Bible into Early Modern English, which we can just about understand today. Like Wycliffe, Tyndale wrote his translation without the Church's permission. His was the first translation to be printed, and several thousand copies were made. Without any protector, Tyndale fled to Europe, but agents of Thomas More (the Chancellor of England) eventually found him. Both Tyndale and his printer were executed by burning at the stake. The Catholic Church published an English translation called the Douay Rheims Bible with the New Testament in 1582 and the Old in 1609. It was translated from the Latin Vulgate Another well-known translation is the 1611 King James translation (commonly known as the Authorized King James Version of the Bible). ==== Modern day translations ==== Today there are hundreds of versions of the Bible. Some are translations, while others paraphrase, putting things into their own words. It is the best-selling book of all time. To date, between 2.5 billion and 6 billion copies have been sold.Businessweek on The Bible: \"The Bible (2.5 billion copies sold)\" (18 July 2005) The complete version of the Bible exists in 471 languages, while parts of the Bible have been translated into 2225 languages.Wycliffe translators' homepage, (Sept 2009) == Old Testament == The Old Testament is the first 39 books of the Christian Bible (which has 66 books overall). It tells the first part of God's story of salvation. According to the Bible, \"salvation\" is God's long work of saving us from our sins. It says that people sin when they decide to live their own way instead of God's way in the world that God created. The Old Testament tells the story of Noah's Ark, in which God sent a great flood to destroy the whole world in order to prepare the way for salvation. He saved only the family of Noah, then raised up a new people for himself. They were the ancient Hebrews. God promised the Hebrews they would bring his salvation to the whole world. The first five books of the Old Testament mostly tell the story of how God chose the ancient Hebrews and taught them his laws. The next twelve books tell the history of the Hebrews. The following five are books of poetry and wisdom. One of these, the \"Psalms\", is a book of songs showing mainly how God wants to be worshiped. The last seventeen books of the Old Testament were written by Hebrew prophets. These books tell about God's disappointment with the ancient Hebrews and his promise to bring them back to friendship with him. The prophets also foretell that God will send his son to earth in order to save humanity from their sins. In the Old Testament, Tanakh was mostly written in Hebrew; a few parts were written in Aramaic. This part of the Bible is considered to be holy by Jews as well as Christians. There are also a few books of the Old Testament's time called Deuterocanonical by those Churches that accept them as part of the Bible, and Apocrypha by those that do not. == New Testament == The second part of the Bible is called the New Testament. It focuses mostly on telling Jesus's life story. The four different versions of this story in the New Testament are called the Gospels. After the Gospels, the New Testament tells the story of what happened to the Church after Jesus's death and resurrection. It does this partly through letters written by early Christian leaders, especially Saint Paul. The final book of the Bible tells about a vision experienced by St. John, one of Jesus's disciples. In the vision, John saw what would happen at the end of the world. This included judgement for evil and happiness for the people who had followed Jesus. One of the most quoted verses in the Bible is John 3:16: \"For God so loved the world that He gave His one and only Son, that whoever believes in Him shall not perish [die] but have eternal life.\" NIV == Views about the Bible == People have different ideas about the Bible. Protestants and Catholics believe that the Old and New Testaments are God's Word. Jews believe that only the Old Testament is from God. Catholics also believe that the books called Apocrypha or Deuterocanonical are part of the Bible. Sometimes different denominations disagree over exactly what the Bible means. Deists believe in God; however, they believe the Bible was written by people rather than God, and view it as unimportant. == Related pages == * Bible study * Abraham * King David * Isaac * Jacob * James (son of Zebedee) * Jesus Christ * John the Apostle * Joseph * Luke the Evangelist * Mark the Evangelist * The Virgin Mary * Matthew the Evangelist * Moses * Joshua * Noah * Saint Peter * Saint Paul * Timothy * Adam * Eve == References == * Entre Galilée et l'Église : la Bible., Une mise au point. Étude. Joël COL. , AutoEdition Méguila, 2003. == Other websites == * The Bible Gateway: the complete Bible online * Bible Hub: Search, Read, Study the Bible in Many Languages * The Bible in Simple English",
 "title": "Bible"
}