{
 "id": "286784",
 "text": "Eartha Kitt (January 17, 1927 – December 25, 2008) was an American actress, singer and songwriter credited with many hit recordings, including the first version of the song \"Santa Baby.\" She died of colorectal cancer in Weston, Connecticut. ==Early life and career== Kitt was born on a cotton plantation in the town of North, in South Carolina, where she spent the first 7 years of her life. At the age of 8, she moved with her family to Harlem in New York City, eventually attending the High School of Performing Arts in Manhattan and, in 1943, joining the Katherine Dunham Dance Company. With the Dunham troupe, Kitt performed in Egypt, France, Greece, Turkey, New York, Las Vegas and Hollywood, and eventually secured her first movie acting role in the 1948 film, Casbah. For her many outstanding accomplishments, Kitt was honored in 1960 with a star on the Hollywood Walk of Fame. She provided the voice of the character Yzma in the 2000 animated film, The Emperor's New Groove, and from 2002 to 2006, she was the voice of Queen Vexus in the Nickelodeon animated series, My Life as a Teenage Robot. Kitt performed in the Broadway musical productions of New Faces and Timbuktu, and in numerous films, including Synanon, The Mark of the Hawk, All by Myself and Accused. She also made numerous television appearances on The Colgate Comedy Hour, Batman, The Ed Sullivan Show, I Spy, Police Woman, and several others programs. In her later years, Kitt wrote and published four memoirs, Thursday's Child (1956), Tart is Not a Sweet, Alone With Me: A New Autobiography (1976), and I’m Still Here; Confessions of a Sex Kitten (1989). She died on Christmas Day, 2008, at her home in Weston, Connecticut. == References == * \"Kitt, Eartha.\" World Book Advanced. World Book, 2014. Web. 12 May 2014. * \"Eartha Kitt.\" Contemporary Authors Online. Detroit: Gale, 2008. Biography in Context. Web. 12 May 2014. Category:Actors from South Carolina Category:African-American actors Category:African-American musicians Category:American movie actors Category:American singer-songwriters Category:American stage actors Category:American television actors Category:American voice actors Category:Cancer deaths in Connecticut Category:Deaths from colorectal cancer Category:Singers from South Carolina Category:1927 births Category:2008 deaths",
 "title": "Eartha Kitt"
}