{
 "id": "286766",
 "text": "David Smith (27 November 1962 – 18 May 2002) was an English professional wrestler who was best known for wrestling with World Wrestling Federation (WWF) and World Championship Wrestling (WCW) under the ring names, (The) British Bulldog and Davey Boy Smith. He had a close relationship with the Hart family and was trained in The Hart Dungeon by Stu Hart. Smith died of a heart attack. ==Championships== Smith held many championships during his professional wrestling career: *All Japan Pro Wrestling **January 2nd Korakuen Hall Heavyweight Battle Royal Winner in 1989 *Pro Wrestling Illustrated **PWI Match of the Year in 1992 vs. Bret Hart at SummerSlam **PWI ranked him #15 of the top 500 singles wrestlers in the PWI 500 in 1993. **PWI ranked him #5 of the 100 best tag teams of the PWI Years in 2003 with The Dynamite Kid **PWI ranked him 53 of the top 500 singles wrestlers of the \"PWI Years\" in 2003 *Stampede Wrestling **NWA Stampede International Tag Team Championship (Calgary version) (two times) with Bruce Hart **Stampede British Commonwealth Mid-Heavyweight Championship (one time) **Stampede Wrestling International Tag Team Championship (two times) with The Dynamite Kid **Stampede North American Heavyweight Championship (two times) **Stampede World Mid-Heavyweight Championship (one time) **Stampede Wrestling Hall of Fame *World Wrestling Federation **WWF European Championship (two times) **WWF Hardcore Championship (two times) **WWF Intercontinental Championship (one time) **WWF World Tag Team Championship (two times) (with The Dynamite Kid (one) and Owen Hart (one)) **Battle Royal at the Royal Albert Hall Winner **WWE Hall of Fame (Class of 2020) *Wrestling Observer Newsletter awards **Best Wrestling Maneuver in 1984 Power clean dropkick **Feud of the Year in 1997 with Bret Hart, Owen Hart, Jim Neidhart, and Brian Pillman vs. Stone Cold Steve Austin **Tag Team of the Year in 1985 with The Dynamite Kid ==References== ==Other websites== * Category:1962 births Category:2002 deaths Category:English professional wrestlers Category:Former WWE wrestlers Category:WWE Hall of Fame Category:Sportspeople from Lancashire Category:Deaths from myocardial infarction Category:Disease-related deaths in British Columbia",
 "title": "Davey Boy Smith"
}