{
 "id": "286983",
 "text": "The Spanish Data Protection Agency is the national data protection authority of Spain. It is an agency dependant of the Spanish Ministry of Justice that was created in 1993. It is to protect Spanish people's privacy. This agency ensures compliance of the Organic Law 3/2018 of December regarding the protection of personal data and digital rights and the General Data Protection Regulation. It is in Madrid and it has the power to act in all the Kingdom. Currently the director of the agency is Mar España Martín, and previously José Luis Rodríguez Álvarez and Artemi Rallo Lombarte. The Spanish Data Protection Agency is a public law entity with legal personality. It has full public and private capacity to act independently of public administration. It ensures that the owners of the files that contain personal information strictly follow the data protection legislation. == Functions == General * Ensures the laws are followed regarding data protection; specially ensures that the rights of access, rectification, cancellation and opposition are respected. In relation to those seeking data * The Spanish Data Protection Agency has the power to fine those not respecting the law. * Issuing authorizations in the manner prescribed by law. * Require corrective actions. * Order, in cases of unlawful data processing, the termination and deletion of the data. * Issuing authorizations of international transfers of data. In relation to citizens * Processing their complaints regarding suspected violations of the data protection laws. * Inform the citizens about their rights regarding the data protection law. Regarding the telecommunication services * Protect the rights and interests of the subscribers and the users in the field of electronic communications, including sending unsolicited commercial communications made through mail or electronic media equivalent (spam). == References == ==Related pages== * European Data Protection Supervisor == Other websites == * Official website. * European Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data. * European Data Protection Supervisor Category:Government of Spain Category:Data protection",
 "title": "Spanish Data Protection Agency"
}