{
 "id": "286962",
 "text": "A tablet computer (sometimes called a tablet) is a type of computer that can be carried easily. Unlike a laptop it has no physical keyboard or trackpad, though users sometimes add those things.https://www.amazon.com/Tablet- Keyboards/b?ie=UTF8&node;=11548965011 Users control a tablet mostly by using its touchscreen with multi-touch technology similar to a smartphone. The screen can be anywhere from (sometimes called a phablet) to in size, but many have a screen size of about diagonal. Almost all tablet computers can access the Internet using Wi-Fi, and many can use mobile phone networks like 2G, 3G, 4G, and 5G. Like smartphones, many tablets have sensors such as a camera and a microphone. Other features tablets have are high definition, anti-glare (with less reflection) displays, a Bluetooth radio (to connect to printers and other devices), flash memory, and cloud storage services to back up information on the tablet and synchronize data. Science fiction started putting tablets in stories after the middle 20th century. Some companies started making real tablets late in the century. The release of the Apple iPad in 2010 got much attention, and other companies made and sold more. ==Advantages and disadvantages== Compared to laptop computers, tablets are lighter, more portable, have longer battery life, make less heat, and do not need a mouse or keyboard to be connected. Typing is usually done on the touch screen with a \"virtual\" keyboard which appears on the screen. Many tablets let the user to get reminders even when the tablet is powered off or on standby One bad thing is that the \"virtual\" keyboards are sometimes slow and easy to make typos on. Some tablets can connect to computer keyboards and computer mice to let the user use them in ways similar to a PC. Tablets often have limited storage compared to a laptop. The majority run a mobile operating system and may not support as many file formats and different types of software as laptops, but they may work with the same kinds of mobile apps that smartphones use. These weaknesses sometimes result in a tablet being used mainly to consume media made by someone else who used a full-service computer. ==Different tablet computers over the years== File:ThinkPad X61t.jpg|2007: Lenovo ThinkPad X61 Tablet. It uses Windows Vista. The screen can spin around and fold back on the keyboard. File:IPad The 1st Generation on the iDock.jpg|2009: This is the first iPad, made by Apple and using the same iOS software as its iPhone. Apple makes new iPads every year. File:Galaxy Tab wp jeh.jpg|2010: Samsung made the Samsung Galaxy Tab, the first tablet to use Android. There are newer versions of this tablet as well. File:BlackBerry PlayBook 2.jpg|2011: The BlackBerry PlayBook used QNX-based software. Not many were sold at first, which made BlackBerry lower the price. File:Samsung Galaxy Note 10.1 jeh.jpg|2012: The Samsung Galaxy Note 10.1 comes with a stylus pen that lets people draw on the screen as if it was a piece of paper. File:Microsoft Surface (black).jpg|2012: Microsoft made the first Surface tablet. It runs Windows RT, a version of Windows 8 that cannot run most Windows programs. File:Surface Pro 3 with accessories.jpg|2014: Microsoft's Surface 3 is a 2-in-1 PC, which works just like a PC and can run the same programs as laptops and desktops. File:IPad Pro 10.5 unboxing (38618066655).jpg|2015: The iPad Pro is announced. It works with a stylus pen and a keyboard cover, and has a bigger screen than the regular iPad. ==References==",
 "title": "Tablet computer"
}