{
 "id": "286915",
 "text": "Patsy Ann McClenny (born February 3, 1950), better known as Morgan Fairchild, is an American actress. She became famous in the late 1970s and early 1980s. She had important roles in several television series. She also worked in live theater and acted in television comedies. Fairchild was born in Dallas, Texas. She is a board member of the Screen Actors Guild. ==Personal life== Fairchild was married to Jack Calmes from 1967 to 1973. She dated United States Senator and later-presidential candidate, John Kerry, in the early 1980s. She has been in a relationship with movie company executive, Mark Seiler, for over 25 years.Interview. People magazine, 25 September 2006. During the early 1970s Fairchild was kidnapped and held against her will on two separate occasions.\"Bobby Brown, Jewel, Morgan Fairchild, Elliott Yamin.\" Celebrity Close Calls. The Biography Channel. 25 June 2011.\"Scott Baio, Pam Grier, Morgan Fairchild, Greg Louganis.\" Dir. Jared Burke, Seth Jarrett, Timothy F. Smith, and Kathi Watson. Celebrity Close Calls. The Biography Channel. 13 Aug. 2011. ==Works== Movies Year Title Role Notes 1967 Bonnie and Clyde Faye Dunaway's double uncredited 1970 A Bullet for Pretty Boy Small role uncredited 1978 Escapade Suzy 1978 The Initiation of Sarah Jennifer Lawrence 1979 Murder in Music City Dana Morgan 1980 The Memory of Eva Ryker Lisa Eddington 1980 The Dream Merchants Dulcie Warren 1981 The Girl, the Gold Watch & Dynamite Stella Walker 1982 The Seduction Jamie Douglas 1982 Honeyboy Judy Wellman 1984 Time Bomb Renee DeSalles 1984 The Zany Adventures of Robin Hood Lady Marian 1985 Pee-wee's Big Adventure Herself as Dottie 1986 Red Headed Stranger Raysha Shay 1987 Campus Man Katherine Van Buren 1987 Sleeping Beauty Queen 1987 Deadly Illusion Jane Mallory/Sharon Burton 1988 Street of Dreams Laura Cassidy/Eva Bomberg 1988 Killing Blue Lisa 1989 Phantom of the Mall: Eric's Revenge Mayor Karen Wilton 1989 The Haunting of Sarah Hardy Lucy 1990 How to Murder a Millionaire Loretta 1990 Mob Boss Gina 1990 Menu for Murder Paula Preston 1991 Even Angels Fall Leslie 1991 Writer's Block Magenta Hart 1991 Sherlock Holmes and the Leading Lady Irene Frances Adler 1992 Just Deserts Catherine Harcourt 1993 Das Paradies am Ende der Berge Irmgard Hoelzl 1993 Freaked Herself 1993 Based on an Untrue Story Satin Chow 1994 Point of Seduction: Body Chemistry III Beth Chaney 1994 Test Tube Teens from the Year 2000 Camella Swales 1994 Naked Gun 33 1/3: The Final Insult Herself 1995 Criminal Hearts District Attorney 1995 Venus Rising Peyton 1995 Gospa Sister Fabijana Zovko 1996 Dead Man's Island Valerie St. Vincent 1996 Star Command Cmdr. Sigrid Ivorstetter 1997 Moment of Truth: Into the Arms of Danger Diana Astin 1998 Shattered Illusions Angie 1998 Holy Man Herself 1999 Nice Guys Sleep Alone Lorraine 2000 Unshackled Mrs. Rebecca Miller 2000 Held for Ransom Mrs. Kirkland 2001 Peril Terry 2002 Teddy Bears' Picnic Courtney Vandermint 2002 I Was a Teenage Faust Babylonia 2004 Knuckle Sandwich Mrs. Simms 2004 Arizona Summer Debbie 2006 Shock to the System Phyllis Hale 2006 The Initiation of Sarah Trina Goodwin 2007 Walk Hard: The Dewey Cox Story Herself 2008 The Sno Cone Stand Inc Cathy Wanton 2009 The Slammin' Salmon Herself 2010 Life's a Beach Felicia Wald 2010 The Steamroom Sheila 2011 Boy Toy Barbra 2011 Beverly Hills Chihuahua 2 Herself 2011 eCupid Venus 2012 Spring Break '83 Mouth's Mother 2012 A Perfect Ending Valentina 2013 Fighting Back Cheryl Television series Year Title Role Notes 1973-1977 Search for Tomorrow Jennifer Pace 1976 Kojak Allison Episode: A Hair-Trigger Away 1977 Rafferty Lisa Farrell Episode: A Point of View 1977 Switch Shelley Bloom Episode: Downshift 1977 Rosetti and Ryan Claire Blake Episode: The Ten-Second Client 1977 Happy Days Cynthia Holmes Episode: My Fair Fonzie 1977 The Bob Newhart Show Bianca / Linda Episode: Grand Delusion 1978 Police Woman Cheryl Episode: Murder with Pretty People 1978 The Amazing Spider-Man Lisa Benson Episode: Night of the Clones 1978 Barnaby Jones Felice Winters Episodes: Daughter of Evil and A Dangerous Affair 1978 Dallas Jenna Wade Episode: Old Acquaintance 1978-1979 Mork & Mindy Susan Taylor 3 episodes 1979 Concrete Cowboys Carla / Kate Episode: Concrete Cowboys 1979 A Man Called Sloane Melissa Nelson Episode: The Venus Microbe 1980 Young Maverick Selene Episode: Makin' Tracks 1981 The Love Boat Jenny Boyer 2 episodes 1980-1982 Flamingo Road Constance Weldon Semple Carlyle 38 episodes Nominated - Golden Globe Award for Best Actress – Television Series Drama (1982) 1982 Magnum, P.I. Alex Houston / Catherine Hailey Episode: Ki'is Don't Lie 1982 Simon & Simon Alex Houston / Catherine Hailey Episode: Emeralds Are Not a Girl's Best Friend 1983 Hotel Carol Episode: Hotel 1984 Paper Dolls Racine 13 episodes 1985 North and South Burdetta Halloran TV mini-series 1986 North and South, Book II Burdetta Halloran TV mini-series 1985-1986 Falcon Crest Jordan Roberts 29 episodes Nominated - Soap Opera Digest Award for Outstanding Actress in a Leading Role on a Prime Time Serial (1986) 1989 My Two Dads Diana Thackery Episode: Macho, Stupid Guy Time 1989 Murphy Brown Julia St. Martin Episode: TV or not TV Nominated - Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series (1990) 1992 Roseanne Marla 3 episodes 1993 Lois & Clark: The New Adventures of Superman Miranda Episode: Pheromone, My Lovely 1993 Murder, She Wrote Iris Novaro Episode: Murder at a Discount 1994 Burke's Law June Ward Episode: Who Killed Romeo? 1994 Empty Nest Zoe Episode: Best Friends 1994 Diagnosis: Murder Pamela Dorn Episode: My Four Husbands 1995-1996 The City Sydney Chase 1996 General Hospital Sydney Chase 1995-1997 Cybill Andrea Thorpe 4 episodes 1997 Head Over Heels Mona DuBois Episode: Gigolo Guy 1997 Touched by an Angel Jackie Sykes Episode: My Dinner with Andrew 1997 The Naked Truth Herself Episode: Bridesface Revisited 1998 Home Improvement Herself Episode: Mr. Likeable 1998 V.I.P. Herself Episode: Three Days to a Kill 1998 The Angry Beavers Muffy Snootwell Episode: Open Wide for Zombies/Dumbwaiters (voice) 1999 The New Addams Family Lady Pretensia Episode: Thing's Romance 1995-2001 Friends Nora Tyler Bing 5 episodes 2001 Dharma & Greg Jackie Episode: Dharma Does Dallas 2001 7th Heaven Merle 'Bird' Episode: Teased 2002 Roswell Meris Wheeler 2 episodes 2002 Providence Gwendolynne Gold Episode: Limbo 2002 Maybe It's Me Big Kimberly Episode: The Quahog Festival Episode 2002 That '80s Show Cossima Blair Episode: Beach Party 2003 Just Shoot Me! Lily Barton Episode: Pictures of Lily 2004 That '70s Show Carolyn Episode: Going Mobile 2006 Fashion House Sophia Blakely 35 episodes 2007 Two and a Half Men Donna Episode: Young People Have Phlegm Too 2008 Men in Trees Herself Episode: Get a Life 2009 Nip/Tuck Herself Episode: Manny Skerritt 2009 My Name Is Earl Carol Episode: Friends with Benefits 2009 The Bold and the Beautiful Dorothy 4 episodes 2010 Law & Order: Special Victims Unit Claire Lockton Episode: Bedtime 2008-2010 Chuck Dr. Honey Woodcomb 3 episodes 2011 Bones Bianca Chiverton Episode: The Prince in the Plastic 2012 Happily Divorced Jill Episode: The Reunion == References == Category:1950 births Category:Living people Category:American television actors Category:Actors from Dallas Category:American stage actors",
 "title": "Morgan Fairchild"
}