{
 "id": "287266",
 "text": "Terence Stephen \"Steve\" McQueen (March 24, 1930 - November 7, 1980) was an American actor. == Career == Steve McQueen rose to fame in 1960, starring together with Yul Brynner, in the Western movie The Magnificent Seven. Three years after that success. He starred in another movie that would become a classic The Great Escape (1963), where he plays the role of a U.S. soldier imprisoned in a Nazi Prisoner of war camp. The 1960s would see more success as McQueen starred in movies as such as The Cincinnati Kid (1965), and the action movie Bullitt (1968), in this movie he filmed many scenes on the streets of San Francisco, driving a powerful Ford Mustang without using a stunt driver. In the early 1970s, McQueen had three hits, starring in the movies The Getaway (1972), by Sam Peckinpah, Papillon (1973), with Dustin Hoffman, and The Towering Inferno (1974), in which he plays role of fire department Chief O'Hallorhan, the who led the rescue of people trapped in the building. Steve McQueen received a four Golden Globe Awards for Love with the Proper Stranger (1964), The Sand Pebbles (1967), The Reivers (1969), and Papillon (1973). He was nominated for an Academy Award for the movie The Sand Pebbles (1967). == Television == Steve McQueen starred in the CBS Western TV series Wanted: Dead or Alive, as Josh Randall bounty hunter, he starred in the series between 1958 and 1961, and recorded 94 episodes. He was also guest star on the TV series Goodyear Television Playhouse, Studio One, The 20th Century-Fox Hour, Climax!, Wells Fargo, Trackdown. == Death == McQueen died of a heart attack while having mesothelioma-related surgery in Ciudad Juárez, Chihuahua, Mexico on November 7, 1980. He was 50 years old. == References == * * * Steve McQueen: 20 Never-Seen Photos - slideshow by Life magazine ==More reading== * Gesprengte Ketten - The Great Escape, Behind the scenes , Photographs of cameraman Walter Riml. Helma Türk & Christian Riml, eds. House Publishing 2013, English/German Category:Actors from Indiana Category:American movie actors Category:American television actors Category:Cancer deaths in Mexico Category:Deaths from mesothelioma Category:Deaths from surgical complications Category:Movie producers from Indiana Category:1930 births Category:1980 deaths Category:Former Roman Catholics Category:Deaths from myocardial infarction",
 "title": "Steve McQueen"
}