{
 "id": "287345",
 "text": "Ernest Borgnine (born Ermes Effron Borgnino; January 24, 1917 – July 8, 2012) was an American actor.Telegraph obituary ==Early life== Borgnine was born Ermes Effron Borgnino in Hamden, Connecticut on January 24, 1917 to Italian immigrant parents. ==Career== ===Movies=== Borgnine's first movie work was in a small role in China Corsair (1951), followed by The Whistle at Eaton Falls (1951). Then in 1953 he would get a role in From Here to Eternity (1953). This movie had a very well known part with him and Frank Sinatra fighting. Borgnine won an Academy Award and a Golden Globe Award for his role in the movie Marty (1955), one of the best movies of his career. His other movies included The Stranger Wore a Gun (1953), with Randolph Scott, Demetrius and the Gladiators (1954), with Victor Mature and Susan Hayward, Vera Cruz (1954), with Gary Cooper and Burt Lancaster, Bad Day at Black Rock (1955), with Spencer Tracy, Run for Cover (1955), with James Cagney, Three Brave Men (1956), with Ray Milland, The Vikings (1958), with Kirk Douglas and The Badlanders (1958), with Alan Ladd. He worked with Glenn Ford in Jubal (1956) and Torpedo Run (1958), and Bette Davis in The Catered Affair (1956). He played Lucius, in the biopic Barrabas (1961), with Anthony Quinn. He then starred in McHale's Navy (1964) and has a small role in The Flight of the Phoenix (1965). In 1967, he is co- starred in The Dirty Dozen (1967) as General Worden. Borgnine co-starred with William Holden in The Wild Bunch (1969), he played Dutch Engstrom. Another of his best work was in The Poseidon Adventure (1972), with Gene Hackman. He played Mike Rogo, who helped rescue people from the ship. His later works include When Time Ran Out (1980), Escape from New York (1981), The Genesis Code (2010) and Night Club (2011). ===Television=== Borgnine has had a large amount of success on television. This includes his work on McHale's Navy and Airwolf. He is also remembered for Dirty Dozen: The Deadly Mission (1987) and The Dirty Dozen: The Fatal Mission (1988). In these movies, he again played the part of General Sam Worden. He was a special guest in the series Laramie, Wagon Train, Get Smart, Little House on the Prairie, Hallmark Hall of Fame and others. Borgnine provided the voice of Mermaid Man (from 1999 to 2012) in SpongeBob SquarePants. This is the second time Borgnine would work with Tim Conway (Barnacle Boy) in a television series. ==Illness and death== In 2006, Borgnine was suffered kidney failure after he was taken to a medical center in Las Vegas. On the morning of July 8, 2012, Borgnine died at a hospital in Los Angeles, California of kidney failure at the age of 95. He is buried at Forest Lawn Memorial Park in Hollywood Hills, California. ==References== ==Other websites== * * * * * Video interview with Ernest Borgnine from the Archive of American Television Category:1917 births Category:2012 deaths Category:American Academy Award winning actors Category:Actors from Connecticut Category:American movie actors Category:American radio actors Category:American stage actors Category:American television actors Category:American voice actors Category:BAFTA Award winning actors Category:Deaths from renal failure Category:Disease-related deaths in Los Angeles Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners",
 "title": "Ernest Borgnine"
}