{
 "id": "287424",
 "text": "William Broderick Crawford (December 9, 1911 – April 26, 1986) was an American actor. == Career == Born in Philadelphia, Pennsylvania, U.S., his first film was Woman Chases Man (1937). He was in Beau Geste (1939), a classic starring Gary Cooper. His got an Academy Award and a Golden Globe in 1950 for his role in the 1949 movie Decepción, directed by Robert Rossen. In the 1950s he worked with Glenn Ford in Convicted (1950, directed by Henry Levin), Human Desire (1954, directed by Fritz Lang) and the western classic The Fastest Gun Alive (1956), where he played a gunslinger who wants to prove he is the fastest gun. He starred in the famous Italian film directed by Federico Fellini, Il bidone (1955). In 1966 he co-starred with Audie Murphy in The Texican (1966). In 1970 he starred in Ransom Money, where he played a police inspector who led the rescue of a child who was kidnapped by a gang. He narrated the film The Candidate (1972) and starred Terror in the Wax Museum (1973), a horror film starring Ray Milland and John Carradine. Towards the end of the 1970s, he had a great performance in the film The Private Files of J. Edgar Hoover (1977), directed by Larry Cohen. == Television == Crawford starred in Highway Patrol (1955-1959). He played Chief Dan Mathews, an experienced highway police chief. Crawford also worked on films for television such as The Challenge (1970), The Phantom of Hollywood (1974), Look What's Happened to Rosemary's Baby (1976), and Mayday at 40,000 Feet! (1976). Crawford was a special guest star in Rawhide, The Virginian, The Girl from U.N.C.L.E., The Man from U.N.C.L.E., Cimarron Strip, Banacek, Vega$, Fantasy Island, and others. == Other websites == * * * *Watch Highway Patrol *Broderick Crawford in Il Bidone * Profile @ Turner Classic Movies Category:1911 births Category:1986 deaths Category:American movie actors Category:American television actors Category:Actors from Philadelphia Category:Best Actor Academy Award winners",
 "title": "Broderick Crawford"
}