{
 "id": "287447",
 "text": "Evidence as to Man's Place in Nature is an 1863 book by Thomas Henry Huxley, in which he gives evidence for the evolution of man and apes from a common ancestor. It was the first book devoted to the topic of human evolution, and discussed much of the anatomical and other evidence. Backed by this evidence, the book said that evolution applied as fully to man as to all other life. == Precursors of the idea == In the 18th century Linnaeus and others had classified man as a primate, but without drawing evolutionary conclusions. It was Lamarck, the first to develop a coherent theory of evolution, who discussed human evolution in this context.Lamarck J.B. 1914 [1809]. Zoological philosophy: an exposition with regard to the natural history of animals. Translated by Hugh Elliot. Macmillan, London. p169–173 Robert Chambers in his anonymous Vestiges also clearly made the point.[Chambers, Robert] 1844. Vestiges of the natural history of creation. p217–218 The book came five years after Charles Darwin and Alfred Russel Wallace announced their theory of evolution by means of natural selection,Darwin C. & Wallace W.R. 1858. On the tendency of species to form varieties; and on the perpetuation of varieties and species by natural means of selection. Journal of the Proceedings of the Linnean Society of London. Zoology 3: 46-50. . and four years after the publication of Darwin's Origin of Species. In the Origin Darwin had deliberately avoided tackling human evolution, except for a sentence: \"Light will be thrown on the origin of man and his history\".Darwin, Charles 1859. On the origin of species by means of natural selection. Murray, London. p488. Darwin's sequel came eight years later, with The Descent of Man, and Selection in relation to Sex (1871). == Content and structure of the book == === Chapters === I. On the natural history of the man-like Apes p1–56. This contains a summary of what was known of the great apes at that time. II. On the relations of Man to the lower animals p57–112. This chapter and its addendum contained most of the controversial material, and is still important today. :Addendum: A succinct history of the controversy respecting the cerebral structure of Man and the apes p113–118. III. On some fossil remains of Man p119–159. A neanderthal skull-cap and other bones had been found, and various remains of early Homo sapiens. Huxley compares these remains with existing human races. == References == Category:Biology books Category:1860s books Category:Evolutionary biology",
 "title": "Man's Place in Nature"
}