{
 "id": "287451",
 "text": "Peter Gene Hernandez Jr. (born October 8, 1985), known by his stage name Bruno Mars, is a Filipino-American singer, songwriter, record producer, actor, and dancer. After an unsuccessful stint with Motown, Mars signed with Atlantic Records in 2002. He became recognized as a solo artist after lending his vocals and co-writing the hooks for the songs \"Nothin on You\" by B.o.B, and Billionaire by Travie McCoy. He also helped write the hits \"Right Round\" by Flo Rida featuring Kesha, \"Wavin' Flag\" by K'naan, and \"Fuck You\" by Cee Lo Green, also known as \"Forget You\". In October 2010, he released his album, Doo-Wops & Hooligans. The album reached number three on the Billboard 200 chart. He was nominated for seven Grammys at the 53rd Grammy Awards, winning Best Male Pop Vocal Performance for \"Just the Way You Are\". His singles \"Just the Way You Are\", \"Nothin' on You\", \"Grenade\", \"Locked Out of Heaven\", \"When I Was Your Man\", \"The Lazy Song\", \"It Will Rain\", \"24K Magic\", and \"Finesse\" have all reached the top five of the US Billboard Hot 100, with the first five reaching number one. Mars has sold 10 million albums around the world. In 2013, his song \"Locked Out of Heaven\" was nominated for a Grammy Award. He was featured on British producer Mark Ronson's song \"Uptown Funk!\", which became the number-one song of the year 2015 and the 2010s decade in the United States. It spent 14 weeks at number one on the Billboard Hot 100. \"Uptown Funk\" won a Grammy Award for Record of the Year. Mars co-wrote the song \"All I Ask\" from English singer-songwriter Adele's third studio album 25 (2015). In 2016, Mars released the single \"24K Magic\" (pronounced \"twenty-four-karat magic\") from his album, also called 24K Magic. It has reached the top five of the Billboard Hot 100. The second single from 24K Magic, \"That's What I Like\", became Mars' seventh number-one song on the Hot 100. A remix of the 24K Magic song \"Finesse\", featuring rapper Cardi B, was released in January 2018 and reached the top five around the world. In 2021, Mars collaborated with recording artist Anderson .Paak on the song \"Leave the Door Open\" as the duo Silk Sonic. The song became Mars' eighth and Paak's first number-one on the Billboard Hot 100. ==Early life== Peter Gene Hernandez was born on October 8, 1985, in Honolulu, Hawaii. He was raised in the Waikiki neighborhood of Honolulu. He is the son of Peter Hernandez and Bernadette \"Bernie\" San Pedro Bayot (died June 1, 2013). His father is of half Puerto Rican and half Jewish (from Hungary and Ukraine) ancestry and is originally from Brooklyn, New York. Mars' mother immigrated to Hawaii from the Philippines as a child and is Filipino. At the age of six, in 1991, Mars appeared on The Arsenio Hall Show as an Elvis Presley impersonator. After performing many times in his hometown throughout his childhood, he decided to pursue a musical career and moved to Los Angeles after graduating from high school. ==Artist influences== As a child, he was influenced by artists such as Elvis Presley and Michael Jackson and would often try to sing like these artists. Mars also incorporates reggae and Motown inspired sounds into his work. Jon Caramanica of The New York Times referred to Mars as \"one of the most versatile and accessible singers in pop.\" ==Discography== === Studio albums === *Doo-Wops & Hooligans (2010) *Unorthodox Jukebox (2012) *24K Magic (2016) === with Silk Sonic === * An Evening with Slik Sonic (2021) == Awards == === Grammy Awards === Mars has won 15 Grammys (10 solo, four as part of Silk Sonic, and one as part of The Smeezingtons) from 35 nominations. Bruno Mars Year Ceremony Award Nominated work Result 2011 53rd Best Rap Song \"Nothin' on You\" Best Rap/Sung Collaboration Record of the Year Best Male Pop Vocal Performance \"Just the Way You Are\" Song of the Year \"Fuck You!\" 2012 54th \"Grenade\" Record of the Year Best Pop Solo Performance Best Pop Vocal Album Doo-Wops & Hooligans Album of the Year 2013 55th Best Rap Song \"Young, Wild & Free\" 2014 56th Best Pop Vocal Album Unorthodox Jukebox Record of the Year \"Locked Out of Heaven\" Song of the Year Best Pop Solo Performance \"When I Was Your Man\" 2016 58th Record of the Year \"Uptown Funk\" Best Pop Duo/Group Performance 2018 60th Album of the Year 24K Magic Best R&B; Album Song of the Year \"That's What I Like\" Best R&B; Vocal Performance Best R&B; Song Record of the Year \"24K Magic\" The Smeezingtons Year Ceremony Category Nominated work Result 2011 53rd Record of the Year \"Nothin' on You\" \"Fuck You!\" Producer of the Year, Non-Classical The Smeezingtons 2012 54th Album of the Year Doo-Wops & Hooligans Record of the Year \"Grenade\" 2014 56th \"Locked Out of Heaven\" 2017 59th Album of the Year 25 Silk Sonic Year Ceremony Category Nominated work Result 2022 64th Song of the Year \"Leave the Door Open\" 2022 64th Record of the Year \"Leave the Door Open\" 2022 64th Best R&B; Performance \"Leave the Door Open\" 2022 64th Best R&B; Song \"Leave the Door Open\" ==References== ==Other websites== *Official website * Category:American contemporary R&B; singers Category:American R&B; singers Category:American pop singers Category:American hip hop singers Category:American funk musicians Category:American new jack swing singers Category:American rock singers Category:American doo-wop singers Category:American reggae singers Category:American singer-songwriters Category:Grammy Award winners Category:Jewish American musicians Category:Singers from Hawaii Category:Writers from Hawaii Category:1985 births Category:Living people Category:People from Honolulu Category:Atlantic Records artists",
 "title": "Bruno Mars"
}