{
 "id": "287585",
 "text": "Minecraft is a 2011 sandbox game made and published by Mojang Studios. Originally made by Markus \"Notch\" Persson in the Java programming language, it started being made over the span of two years, from 17 May 2009 to 18 November 2011. More than 350 million copies of the game have been sold in 2025. This makes it the best-selling video game of all time. In Minecraft, players explore a freely walkable world filled with many 3D items. Many of these items are cubes called \"blocks\" that can be placed down. These include basic terrain and resources such as dirt, stone, wood, and sand. There are also items the player can use, such as crafting tables, furnaces, blast furnaces, looms, and stonecutters among others. Players can use these to make new items such as tools and armor, as well as different kinds of blocks. Players can then build structures using these blocks, such as buildings, statues, pixel art, and more. Minecraft has a large community. It has a lot of user-generated content (things made by players) like mods, servers, skins, resource packs, and custom maps, which add new gameplay features and game modes to the base game. Minecraft has three main versions: Java Edition, Bedrock Edition, and Education Edition. Java Edition is the first version of Minecraft made, but Bedrock Edition is now used more due to it being multi-platform. Bedrock Edition and Education Edition are written in C++, and Java Edition is written in Java. In the past, special versions of Minecraft were made just for video game consoles, like for the PlayStation or for the Xbox 360. == Gameplay == At the start of the game, players are put in a random location in the game world. They can begin breaking blocks to collect resources, such as wood, dirt, etc. which can be used later in the game. Players can use resources to make new tools, such as pickaxes, which let the player gather stone in the caves that they find. Different resources require different tools to collect them. For example, diamonds can only be collected with an iron pickaxe, or one of a better quality. The game world is mostly endless. As players explore it, the game makes new sections of the world using procedural generation. The game generates different kinds of terrain in biomes. Different biomes have different blocks in them. For example, a taiga biome will have lots of spruce trees and snow, whereas a plains biome will have lots of grass. The player can also find different structures in the world, like mountains and villages. The game has non-player characters called \"mobs\" (short for mobile entity). There are many mobs in Minecraft. Some are real-life animals, like cows, pigs, and sheep. Some are based on monsters, such as zombies or skeletons. There are also some which do not exist in the real world in any way, and are unique to Minecraft, such as Creepers, Piglins, and Endermen. Each mob has different things it can do. For example, players can kill cows to get leather, which can make items, and beef, which can be cooked to make food. The Creeper, a hostile mob (meaning it tries to attack the player), will move close to the player and then explode, which usually causes so much damage that will kill the player. Minecraft has very few goals. Players can choose how they want to play. They can choose to fight bosses, such as the Wither and the Ender Dragon, or choose to explore the world and build. If the player defeats the Ender Dragon, they can see the credits of the game. Minecraft also has lots of Achievements called \"advancements\". These can range from simple things like sleeping in a bed for the first time, to complex things like discovering every biome in the game. Both boss fights and advancements are optional. In addition to the default dimension the player starts in (called the \"Overworld\"), there are also two other dimensions in Minecraft - the Nether and the End. Both of these can be accessed with special portals. The player can make Nether portals using obsidian and flint and steel, but End portals have to be found in strongholds. While it is not necessary to go to these dimensions, they have lots of different items and enemies which cannot be found in the Overworld. The Ender Dragon can only be fought in the End. After that, the player has a choice of going back to the overworld or to go to the end islands to find an end city and get an Elytra and Diamond Enchanted Armor. === Mobs === Passive mobs, such as cows, pigs, and chickens, can be hunted for food and crafting materials. They spawn in the day, while hostile mobs—including large spiders, witches, creepers, skeletons, endermen, and zombies—spawn during night or in dark places such as caves. Some hostile mobs, such as zombies, skeletons and drowned (underwater versions of zombies), burn under the sun if they have nothing on their head, such as armour. Other creatures in Minecraft include the creeper (an exploding creature that sneaks up on the player) and the enderman (a creature with the ability to teleport as well as pick up and place blocks). There are also variants of mobs that spawn in different conditions; for example, zombies have husk and drowned variants that spawn in deserts and oceans, respectively. === Game modes === ==== Survival mode ==== In survival mode, players can gather resources found in the world to make lots of different items. Some of the items players can make include new blocks, tools, and armor. For example, players can turn wood into planks at the start of the game, which lets them make lots of things, like crafting tables and tools. Players can also place down these planks to build things, like houses. and other structures Players have a health bar and a hunger bar in this mode. The health bar is shown as 10 hearts, and the hunger bar is shown as 10 steaks. Each heart and steak are worth two health points and two hunger points, respectively. The health bar depletes when players get attacked by monsters, lose all of their air underwater, walk into lava or cacti, fall from a high place, fall into the void, or if their hunger bar is depleted completely. Players can heal by staying still, drinking healing potions, and/or if they have a full hunger bar. Players will lose hunger by walking, sprinting and jumping too much. If they are low on hunger, they will not be able to sprint. They can fill their hunger bar by eating food. During the night, monsters come out to fight the player, but players can build a house to protect themselves from these monsters. If a player sleeps in a bed, they can skip the night, and go directly to the next day. However, they are unable to sleep if there are monsters near the bed. Players can only carry a certain number of items at any time, by holding them in their inventory. If the player dies, they drop their items, unless they have turned on Keep Inventory. Players can get their items back if they can find them before they disappear. They can then respawn, which sends them back to their spawn point, or the place they started the game at. Players can change their spawn point using items like beds. For example, a player can put a bed in their house to respawn there, and in the Nether players can use a unique block called a respawn anchor to respawn there. Players can play Survival Mode in four levels of difficulty: Peaceful, Easy, Normal and Hard. As the difficulty increases, the more damage monster's deal. In addition, certain mobs will gain certain abilities at higher difficulty levels. When a player made a new world, the difficulty is set to normal by default. On peaceful difficulty, no monsters spawn, and the only way players can die is by deaths that are not from mobs, such as falling from a high place, being in fire or lava, drowning, suffocating inside a block, or falling into the void. ==== Creative mode ==== In creative mode, players can generate an infinite number of items. This is so they can build whatever they want, instead of having to look for resources. They cannot normally die and do not have a health bar or hunger bar. Players can also freely fly to reach places they normally could not. Some items can only be obtained in Creative Mode, and a few can only be accessed with cheat commands, such as the Command Block. ==== Multiplayer ==== Players can play on the same Minecraft world together by using the multiplayer mode. They can connect to an online server by typing in the server's address (usually an IP address), or by making a game on the local area network (LAN). On Bedrock Edition, Xbox multiplayer can be used. If the player makes a LAN game, only players on the same network can play. Much like the rest of Minecraft, players can choose what they want to do. For example, they can choose to fight each other, or work together and survive. All game modes can be played in multiplayer. == Versions == === Java Edition === Minecraft: Java edition was the first version of Minecraft, first released in 2009. It can be played on Windows, macOS, and Linux. === Pocket Edition === Minecraft: Pocket Edition was a mobile version of Minecraft for phones and tablets. In 2011, Minecraft: Pocket Edition was released for the Android market as an early version. It was then released for other devices in October 2011. An iOS version was released in November 2011, and a port was made for Windows Phones after Microsoft bought Mojang. The port focuses on the basic building and the survival parts of the game and does not have all the features of the PC version. On his Twitter account, Jens Bergensten said that the Pocket Edition of Minecraft is in C++ and not Java code, because of iOS not being able to support Java code. However, there now exists a way to play Java Edition on both Android and iOS devices using unofficial 3rd party launchers. Minecraft: Pocket Edition was replaced by Bedrock Edition on 19 December 2016 === Bedrock Edition === Minecraft: Bedrock Edition is a version of Minecraft focused on multiplayer. It can be played on Windows (10 or higher), Chromebook, Xbox, PS4, Nintendo Switch, Android, iOS and iPadOS. This version is based off the Pocket Edition codebase which uses C++ as it's programming language. === Education === Formerly Minecraft Education Edition, this is an edition of the game mostly used for schools. Most features of this edition are in Bedrock Edition, but they need to be turned on before making a world. Minecraft Education is a game-based platform that inspires creative, inclusive learning through play. Explore blocky worlds that unlock new ways to take on any subject or challenge. === Legacy Console Edition === The Legacy Console Edition are the editions of Minecraft on consoles before Bedrock Edition. Platforms that used this edition are the PlayStation 3, Xbox 360, PlayStation Vita, Wii U, Xbox One, PlayStation 4, New Nintendo 3DS and Nintendo Switch (using an option in Bedrock Edition available to those who had Legacy Console Edition before). As of 2024, it is no longer updated. ==History== Minecraft was originally made as an experiment to test random generation for caves. Minecraft was inspired by Infiniminer, a game made by Zach Barth. The first version of Minecraft was released for PC players on May 17, 2009, and was called Cave Game. After going through alpha and beta versions, the full version was released on 18 November 2011. A version for Android was released on 7 October 2011, and an iOS version was released on 17 November 2011. At first, Minecraft was made only by Markus Persson. Other people started to work on it when Persson started an independent video game company called Mojang Specifications. The company was later renamed simply to Mojang. Later in 2011, a version named Minecraft: Pocket Edition was released for iOS and Android devices. This version was later renamed \"Bedrock Edition\". In 2012, Persson gave Jens \"Jeb\" Bergensten the job of being the main developer of Minecraft. In 2014, Microsoft bought Mojang for $2.5 billion USD. Minecraft has also released on many video game consoles. On 9 May 2012, Minecraft came out on the Xbox 360 as a download through the Xbox Live Arcade. It was available for 1600 Microsoft Points ($19.99). In 2013, Minecraft came out as a disc for the Xbox 360 and PlayStation 3. On 10 December 2013, a Windows Phone version was released. Versions for the Xbox One and PlayStation 4 were released in September 2014. A version for the PlayStation Vita was released on 14 October 2014. The Wii U edition was released on 17 December 2015. In 2017, versions for the Nintendo Switch and the New Nintendo 3DS were released. The Xbox One, PlayStation 4, and Nintendo Switch were later given the Bedrock Edition, which allowed players of these systems to play together. == Music == The composer of Minecraft was the German musician Daniel Rosenfeld, better known under the name C418. The soundtrack is under the genre of \"ambient music\" with it being inspired be music by Brian Ino and Vangelis, as well as the some sounds from of Stephen Reich. well making the soundtrack he used the Foley technique. Most people think this soundtrack is one of the greatest video games soundtracks of all time. == Other games == === Minecraft: Story Mode === Minecraft: Story Mode was an interactive animated game/TV series made by Mojang Studios on 13 October 2015. In this, you play as a character who can make choices that impact how the story goes. On 5 December 2018, a Netflix version was added. There is a sequel that is currently not on Netflix. It is now discontinued and removed from Netflix. === Minecraft Dungeons === Minecraft Dungeons is a Dungeon Crawler made by Mojang Studios in 2020. Unlike Minecraft, you cannot jump, mine or build. Instead, you defeat enemies to progress. It is no longer receiving content updates. === Minecraft Earth === Minecraft Earth is a phone game made by Mojang Studios in 2019. It used augmented reality to let players build in real life. You got blocks and mobs from walking around in real life and finding \"tappable\". The game was shut on 30 June 2021 due to COVID-19.https://www.minecraft.net/en-us/article/minecraft-earth-coming-end Staff - MINECRAFT EARTH COMING TO AN END === Minecraft Legends === Minecraft Legends is a action-strategy video game developed by Mojang Studios and Blackbird Interactive in 2023. == Reception == Minecraft received very positive reviews. Jaz McDougall of PC Gamer said that Minecraft is \"intuitively interesting and contagiously fun, with an unparalleled scope for creativity and memorable experiences\". IGN called the blocky graphics \"instantly memorable\". == Community == Minecraft has a very large community, with many fan forums and multiplayer servers such as Hypixel. The Minecraft community is also one of the largest on YouTube, with 1 trillion views on Minecraft videos so far. Many people upload various types of Minecraft content to YouTube, such as parody songs, animations, gameplay, and more. Content made by other players can also be uploaded to platforms such as Forge. Minecraft Live is another YouTube community event that occurs yearly. At certain points in history, several teams of hackers made hack clients that allowed users to get the location of other players. == Minecraft Live == Minecraft Live, formerly called Minecon, is a livestream and convention about the video game Minecraft. It is held every year. == Updates == Minecraft has had many new updates since it first released. These updates are usually announced before they are released. They add lots of new features into the game, such as new blocks, mobs, and items. Mojang releases smaller development versions called \"snapshots\" which players can choose to play on Minecraft Launcher. These snapshots have a few new features in them and are released as the developers are working on the new version. This is so players can try out new features before the full version is released. On Bedrock Edition, these are called previews. == Notes == == References == == Other websites == * * Minecraft wiki Category:2011 video games Category:Android (operating system) games Category:Construction and management simulation games Category:Early access video games Category:IOS games Category:Indie video games Category:Linux games Category:MacOS games Category:Microsoft video games Category:Multiplayer and single-player video games Category:Nintendo 3DS eShop games Category:Nintendo 3DS games Category:Nintendo Network games Category:Nintendo Switch games Category:Open-world video games Category:PlayStation 3 games Category:PlayStation 4 games Category:PlayStation 5 games Category:PlayStation Network games Category:PlayStation Vita games Category:Sandbox games Category:Survival video games Category:Video games developed in Sweden Category:Virtual reality games Category:Wii U games Category:Windows games Category:Xbox 360 games Category:Xbox 360 Live Arcade games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Minecraft"
}