{
 "id": "287880",
 "text": "Tiffany Dawn Thornton (born February 14, 1986 in College Station, Texas, U.S.) is an American actress, comedian and singer, best known for her co-starring role as Tawni Hart on the Disney Channel Original Series, Sonny with a Chance. == Career== Thornton made her television acting debut on the pilot episode of the Fox sitcom, Quintuplets. She then went on to guest star on 8 Simple Rules, American Dreams, The O.C., Desperate Housewives, That's So Raven, Jericho, Wizards of Waverly Place and Hannah Montana. In 2009, she began her role as Tawni Hart on the Disney Channel Original Series, Sonny with a Chance and then went on to play a part in the Disney Channel Original Movie, Hatching Pete. == Personal life == Thornton became engaged to her boyfriend of one year, Christopher Carney, a court officer, in December 2009. She has openly stated, \"I am a Christian. I would have nothing without my faith.\" ==Filmography== Film 2009 Hatching Pete Jamie Disney Channel Original Movie Television Year Show Role Notes 2004 Quintuplets Stacy Pilot 2004 8 Simple Rules Marnie 1 episode: \"Car Trouble?\" 2005 American Dreams Tonya 2 episodes: \"Truth Be Told\" and \"Home Again\" The O.C. Ashley 3 episodes: \"The Shape of Things to Come\", \"The Disconnect\" and \"The Safe Harbor\" 2006 Desperate Housewives Barbie 1 episode: \"No One Is Alone\" That's So Raven Tyler Sparks (episode \"Checkin' Out\", part of That's So Suite Life of Hannah Montana) Jericho Stephanie Lancaster Pilot episode, uncredited 2007 Hannah Montana Becky 2 episodes: \"Get Down, Study-udy-udy\" and \"Yet Another Side of Me\" Wizards of Waverly Place Susan 1 episode: \"Movies\" 2008 Disney Channel's Totally New Year 2008 Herself Disney Channel special New Years event 2009 Leo Little's Big Show Herself Hatching Pete and Dadnapped Double Feature and \"Sonny With a Chance: Sonny's Big Break\" 2009–present Sonny with a Chance Tawni Hart Main role, Disney Channel Original Series 2010 Fish Hooks Doris Flores Gorgeous (voice) 1 episode: \"Doris Flores Gorgeous\" 2010 Kick Buttowski: Suburban Daredevil Teena Sometimes (voice) 1 episode: \"And... Action!\" ==Music== ===Songs=== *2009: \"Let It Go\" (with Mitchel Musso) \\- Disney Channel Playlist *2009: \"Some Day My Prince Will Come\" \\- Snow White and the Seven Dwarfs: Diamond Edition DVD/Blu-ray *2009: \"Magic Mirror\" - Tinker Bell and the Lost Treasure *2009: \"I Believe\" Duet with Kermit the Frog - Studio DC: Almost Live *2010: \"If I Never Knew You\" \\- DisneyMania 7 *2010: \"Kiss Me\" - Sonny with a Chance (soundtrack) *2010: \"Sure Feels Like Love\" - Sonny with a Chance (soundtrack) ===Music videos=== *2008: \"La La Land\" (Demi Lovato's video, cameo appearance) *2009: \"Let It Go\" (with Mitchel Musso) *2009: \"Some Day My Prince Will Come\" *2009: \"I Believe\" ==Awards== Year Award Category Nominated work Result 2010 Teen Choice Awards \"Summer TV Star-Female\" Sonny with a Chance ==References== ==Other websites== * Category:1986 births Category:Living people Category:Actors from Texas Category:Singers from Texas Category:American Christians Category:American television actors Category:Comedians from Texas",
 "title": "Tiffany Thornton"
}