{
 "id": "287897",
 "text": "The List of science books is mainly got from: * Printing and the Mind of Man: a descriptive catalogue illustrating the impact of print on the evolution of western civilisation during five centuries. Compiled by John Carter and Percy H. Muir. Karl Pressler, München (Munich) 1983. The list here does not notice mathematics or technology, although these subjects are related to science. == The list == === 1st century AD / 15th century === # Gaius Plinius Secundus (Pliny the Elder, 23–79 AD) Historia naturalis. Venice, 1469. Pliny's Natural History is an encyclopedia of the scientific and technical knowledge of the ancient world. === 16th century === # Nicolaus Copernicus (1473–1543) De revolutionibus orbium coelestium. Nuremberg, 1543. The first step to modern science. # Conrad Gessner (1516–1565) Historiae animalium. 5 vols, Zurich 1551–57. An encyclopedia of animals, illustrated by woodcuts. === 17th century === # Wiliam Gilbert (1544–1603) De magnete. London 1600. First to propose that the Earth was one large magnet. # Johannes Kepler (1571–1630) Astronomia nova. Heidelberg 1609. The laws of planetary motion. # Galileo Galilei (1564–1642) ## Siderius nuncius. Venice 1610. Discovery of 'new worlds' with the telescope. ## Dialogo sopra i due massimi sistemi del mondo, Tolemaico et Copernicano. Florence, 1632. The famous 'dialogue between two world systems, Ptolemaic and Copernican'. ## Discorsi et demonstrazioni mathematiche. Leiden 1638. Includes mathematics of motion in support of his previous work. # William Harvey (1578–1657) Exercitatio anatomica de motu cordis et sanguinis in animalibus. Frankfurt 1628. Proof of the circulation of blood; fundamental to physiology and medicine. # Robert Boyle (1627–1691) ## The sceptical chymist. London 1661. The foundation of chemistry. ## New experimental physico-mechanical touching the air. 2nd ed, Oxford 1662. Boyle's law. # Robert Hooke (1635–1703) Micrographia. London 1665. The microscope and what he saw in it, illustrated. # Nicolaus Steno (1638–1686) De solido. Florence 1669. Clear recognition of the organic origin of fossils, and first attempt to show sections of geological strata. # Isaac Newton (1642–1727) Philosophae naturalis principia mathematica. London, 1687. Mathematical physics, gravity, laws of motion. # Anton van Leeuwenhoek (1632–1723) Arcana naturae detecta. Delft, 1696. Made many lenses and microscopes, with which he made many discoveries. Discovered microorganisms, and was the first to name some bacteria. # Edward Tyson (1650–1708) Orang-Outang; or the anatomy of a pygmie compared to that of a monkey, an ape, and a man. London 1699. The earliest important work in comparative anatomy. He showed that between monkey and man stood the anthropoid apes. The 'pygmie' was a chimpanzee, evidently a juvenile. === 18th century === # Edmund Halley (1656–1742) A synopsis of the anatomy of comets. London, 1705. A famous study of comets. # Stephen Hales (1677–1761) Statical essays containing vegetable staticks &c.; 2 vols, London, 1731–33. Ground-breaking work on the movement of water and sap in plants. # Carl Linnaeus, or Linné (1707–78) Systema naturae. Leiden, 1735. Originator of the binomial system of classification of living things. All species he knew about were given both a general (genus) and a specific name, such as Homo sapiens. The names were given in Latin, and so avoided a problem with local names. # Georges Louis le Clerc, Comte de Buffon (1707–88) Histoire naturelle, general et particuliere. 44 vols, Paris 1749–1804. # Frederick William Herschel (1738–1822) Herschel discovered the planet Uranus, and several planetary satellites. He worked out what the Milky Way was, and discovered binary stars. His catalogue of binary stars was expanded further by his son, John Herschel. ## On the proper motion of the Sun and Solar system. London, 1783. ## Catalogue of 500 new nebulae, nebulous stars, planetary nebulae, and clusters of stars; with remarks on the construction of the heavens. London, 1802. Announces discovery of double stars. ## Account of the changes that have happened, during the last twenty-five years, in the relative situation of double-stars; with an investigation of the cause to which they are owing. London, 1903. Confirms the discovery of double stars. # Antoine Lavoisier (1743–94) Traité élémentaire de chimie. 2 vols, Paris, 1789. First modern textbook of chemistry. Lavoisier understood the difference between elements and compounds, and put an end to alchemy. # James Hutton (1726–97) Theory of the Earth, with proofs and illustrations. 2 vols, Edinburgh 1795; vol 3 London 1899. Uniformitarianism applied to geology: processes seen today have acted in the past. Small changes over long periods of time lead to great transformations. A foundation-stone of geology. # Pierre-Simon Laplace (1749–1827) Traité de méchanique céleste. 5 vols, Paris 1799–1825. Fundamental work on applied mathematics and astronomy. Includes celestial mechanics applied to the solar system. Laplace was the originator of a number of mathematical techniques, and the author of the nebular hypothesis of how the solar system arose. He showed the solar system would be long-lasting because of its dynamic stability. === 19th century === # John Dalton (1766–1844) A new system of chemical philosophy. London: part I 1808, part II 1810; volume 2, part I 1827. Dalton's atomic theory. # Lamarck (1744–1829) Philosophie Zoologique. 2 vols, Paris 1809. First coherent statement of evolution (though not quite as now), and a theory (incorrect) as to how it happened. One of Darwin's most important precursors. # William Smith (1769–1839) A geological map of England and Wales, with part of Scotland. London 1815. Founder of stratigraphy and geological mapping. # Michael Faraday (1791–1867) Experimental researches in electricity. 3 vols, London 1839, 1844, 1855. Faraday, a blacksmith's son, became the greatest experimental physicist of the nineteenth cencury. # Justus Liebig (1803–1873) Dawn of organic chemistry. Liebig 'invented' the chemical laboratory. ## Die Organische Chemie in ihrer Anwendung auf Agricultur und Physiologie. Brunswick 1840. (Organic chemistry in its application to agriculture and physiology); and ## Die Organische Chemie in ihrer Anwendung auf Physiologie und Pathologie. Brunswick 1842. (Organic chemistry in its application to physiology and pathology). # Alexander von Humboldt (1769–1859) ## Voyages aux Régions Equinoxiales du Nouveau Continent fait en 1799–1804. Describes the geography and natural history of South America. ## Kosmos: Entwurf einer Physischen Weltbeschreibung 4 vols, Stuttgart & Tübingen 1845–62. A fifth volume was published from his notes. The work is a summary of all that was known of the natural sciences of his day and, by 1852, 80,000 copies had been sold. # Charles Darwin (1809–1882) and the theory of evolution: ## with Alfred Russel Wallace (1823–1913): On the tendency of species to form varieties; and on the perpetuation of varieties and species by natural selection. Journal of the Proceedings of the Linnean Society, London 1858. ## Charles Darwin On the origin of species by means of natural selection. London 1859. ## Charles Darwin The Descent of Man, and selection in relation to sex. London, 1871. == 20th century == # Albert Einstein (1879–1955) Die Grundlage der allgemeinen Relativitätstheorie. Leipzig 1916. (Foundations of the general theory of relativity) and its popular version Über die spezielle und die allgemeine Relativitätstheorie, gemeinverständlich (On the special and general theory of relativity: a popular account) Braunschweig 1917. The greatest work in physics since Newton. Journal publication of the ideas came first. # Ronald Fisher (1890–1962) The Genetical Theory of Natural Selection 1930; 1950. A building- block of the modern evolutionary synthesis. Books * Books",
 "title": "List of science books"
}