{
 "id": "287995",
 "text": "This article lists some of concentration camps set up by the Third Reich, and includes camps such as Dachau which was set up at first to help the Nazis keep power and control political opponents, and other camps such as Auschwitz which was set up to help fulfil the Final Solution. The German Ministry of Justice, in 1967, named about 1200 camps and subcamps in countries occupied by Nazi Germany, while the Jewish Virtual Library writes \"It is estimated that the Nazis established 15,000 camps in the occupied countries.\"Concentration Camp Listing Sourced from Van Eck, Ludo Le livre des Camps. Belgium:Editions Kritak; and Gilbert, Martin Atlas of the Holocaust. New York:William Morrow 1993 . In this on-line site are published the names of 149 camps and 814 subcamps, organized by country. Most of these camps were destroyed. ==Table of selected Nazi concentration camps== According to the table below, an estimated 7,991,460 people lost their lives in the camps. Camp Name Country (today) Camp Type Dates of use Est. prisoners Est. deaths Sub-camps Webpage Alderney Alderney, Channel Islands Labour camp Jan 1942 – Jun 1944 6,000 700 Lager Borkum, Lager Helgoland, Lager Norderney, Lager Sylt Amersfoort Netherlands Transit camp and prison Aug 1941 - Apr 1945 35,000 1,000 Arbeitsdorf Germany Labour camp 8 Apr 1942 – 11 Oct 1942 600 min. none Auschwitz-Birkenau Poland Extermination and Labour camp Apr 1940 – Jan 1945 around 1.3 million list of 48 sub-camps with description at the Auschwitz-Birkenau State Museum List of Subcamps of KL Auschwitz (Podobozy KL Auschwitz). The Auschwitz-Birkenau State Museum in Oświęcim, Poland (Państwowe Muzeum Auschwitz-Birkenau w Oświęcimiu), 1999-2010 Franciszek Piper, Construction and Expansion of KL Auschwitz (\"Budowa i rozbudowa KL Auschwitz\"). The Auschwitz-Birkenau State Museum in Oświęcim, Poland (Państwowe Muzeum Auschwitz-Birkenau w Oświęcimiu), 1999-2010 Banjica Serbia Concentration camp Jun 1941 – Sep 1944 23,637 min. Bardufoss Norway Concentration camp Mar 1944 – ???? 800 250 Bełżec Poland Extermination camp Oct 1941 – Jun 1943 434,508 min. Bergen-Belsen Germany Collection point Apr 1943 – Apr 1945 70,000 2 Berlin-Marzahn Germany Early a \"rest place\" then Labour camp for Roma July 1936 - none Bernburg Germany Collection point Apr 1942 – Apr 1945 100,000 2 Bogdanovka Moldova Concentration camp 1941 54,000 40,000 Bolzano Italy Transit Jul 1944 – Apr 1945 11,116 Bredtvet Norway Concentration camp Fall, 1941 - May, 1945 1,000 min. ???? none Breendonk Belgium Prison and Labour camp 20 Sep 1940 – Sep 1944 3532 min. 391 min. none Breitenau Germany \"Early wild camp\", then Labour camp Jun 1933 – Mar 1934, 1940–1945 470 - 8500 Buchenwald Germany Labour camp Jul 1937 – Apr 1945 250,000 56,000 list Chełmno (Kulmhof) Poland Extermination camp Dec 1941 – Apr 1943, Apr 1944 – Jan 1945 152,000 min. Crveni krst Serbia Concentration camp 1941–1945 30,000 12,300 Dachau Germany Labour camp Mar 1933 – Apr 1945 200,000 31,591 list Drancy France Internment camp, transit 20 Aug 1941 – 17 Aug 1944 70,000 Three of five Paris annexes: Austerlitz, Lévitan and Bassano camps Falstad Norway Prison camp Dec 1941 – May 1945 200 min. none Flossenbürg Germany Labour camp May 1938 – Apr 1945 100,000 min. 30,000 list Fort de Romainville France Prison and transit camp 1940 – Aug 1944 8,100 min. 200 min. none Fort VII (Poznań) Poland Concentration, detention, transit Oct 1939 – Apr 1944 18,000 min. 4,500 min. Fossoli Italy Prison and transit camp 5 Dec 1943 - Nov 1944 none Grini Norway Prison camp 2 May 1941 – May 1945 19,788 8 Fannrem Bardufoss Kvænangen Gross-Rosen Poland Labour camp; Nacht und Nebel camp Aug 1940 – Feb 1945 125,000 40,000 list Herzogenbusch (Vught) Netherlands Concentration camp 1943 - Summer 1944 31,000 750 list Hinzert Germany Collection point and subcamp Jul 1940 – Mar 1945 14,000 302 min. Janowska (Lwów) Ukraine Ghetto; transit, Labour, & extermination camp Sep 1941 – Nov 1943 40,000 min. none (see \"A-Z\") Jasenovac concentration camp Croatia Extermination camp for Jews, Serbs Roma, Croats, and Bosniaks 1941–1944 100,000 min. 100,000 min. Stara Gradiška concentration camp, Sisak children's concentration camp, Donja Gradina, Jasenovac main Kaiserwald (Mežaparks) Latvia Labour camp 1942 – 6 Aug 1944 20,000? 16, incl. Eleja-Meitenes Kaufering/Landsberg Germany Labour camp Jun 1943 – Apr 1945 30,000 14,500 min. Kauen (Kaunas) Lithuania Ghetto and internment camp ???? Prawienischken Klooga Estonia Labour camp Summer 1943 – 28 Sep 1944 2,400 Langenstein-Zwieberge Germany Buchenwald subcamp Apr 1944 – Apr 1945 5,000 2,000 Le Vernet France Internment camp 1939–1944 Majdanek (KZ Lublin) Poland Extermination camp Jul 1941 – Jul 1944 78,000 Malchow Germany Labour and Transit camp Winter 1943 – 8 May 1945 5,000 Maly Trostenets Belarus Extermination camp Jul 1941 – Jun 1944 65,000 Mauthausen-Gusen Austria Concentration camp Aug 1938 – May 1945 195,000 95,000 min. list Mittelbau-Dora Germany Concentration camp Sep 1943 – Apr 1945 60,000 20,000 min. list Natzweiler-Struthof (Struthof) France Concentration camp; Nacht und Nebel camp; extermination camp May 1941 – Sep 1944 40,000 25,000 list Neuengamme Germany Concentration camp 13 Dec 1938 – 4 May 1945 106,000 42,900+ list Niederhagen Germany Prison and Labour camp Sep 1941 – early 1943 3,900 1,285 none Oberer Kuhberg Germany Concentration camp Nov 1933 – 1935 0 Former infantry base Gleißelstetten Ohrdruf Germany Labour and concentration camp; Buchenwald subcamp Nov 1944 - Apr 1945 11,700 Oranienburg Germany Collective point Mar 1933 – Jul 1934 3,000 16 min. Osthofen Germany Collective point Mar 1933 – Jul 1934 Płaszów Poland Labour camp Dec 1942 – Jan 1945 150,000 min. 9,000 min. list Ravensbrück Germany Concentration camp for women May 1939 – Apr 1945 150,000 90,000 min. list Risiera di San Sabba (Trieste) Italy Police detainment camp Sep 1943 – 29 Apr 1945 25,000 5,000 Sachsenhausen Germany Concentration camp Jul 1936 – Apr 1945 200,000 min. 100,000 list Sajmiste Serbia Extermination camp Dec 1941 – Sep 1944 100,000 Salaspils Latvia Labour camp Oct 1941 – Summer 1944 2,000 Sobibór Poland Extermination camp May 1942 - Oct 1943 200,000 max. Soldau Poland Concentration camp; Transit camp Winter 1939/40 – Jan 1945 30,000 13,000 Stutthof Poland Concentration camp Sep 1939 – May 1945 110,000 65,000 list Theresienstadt (Terezín) Czech Republic Transit camp and Ghetto Nov 1941 – May 1945 140,000 35,000 min. Treblinka Poland Extermination camp Jul 1942 – Nov 1943 870,000 Vaivara Estonia Concentration and transit camp 15 Sep 1943 – 29 Feb 1944 20,000 950 22 Warsaw concentration camp Poland Concentration camp 1943–1944 400,000 max. 20,000 max. Westerbork Netherlands Transit camp May 1940 – Apr 1945 102,000 ==References== Category:Europe Category:Nazism Category:Racism Category:Germany Category:Nazi Germany Category:Antisemitism Category:Jewish history Category:Discrimination Category:History of Europe Category:History of Germany Category:Antisemitism in Europe Category:Antisemitism in Germany",
 "title": "List of Nazi concentration camps"
}