{
 "id": "288030",
 "text": "Anquan Kenmile Boldin (born October 3, 1980) is a American former football wide receiver. He played for a total of 14 seasons in the National Football League (NFL). He played for the Arizona Cardinals, Baltimore Ravens, San Francisco 49ers, and Detroit Lions. Boldin was drafted out of Florida State University by the Arizona Cardinals with the 54th overall pick in the second round of the 2003 NFL Draft. Boldin has been selected for 3 Pro Bowls in 2003, 2006 and 2009. He has been known for his physical play. He won Super Bowl XLVII with the Ravens when they defeated the San Francisco 49ers 34-31. On August 20, 2017, Boldin retired from playing professional football. On October 14, 2019, the Ravens held an official retirement ceremony for him. In 2017, Boldin and Malcolm Jenkins founded the Players Coalition to help NFL players work for racial justice. Part of the Coalition is a charity and part is a political action group. By January 2020, the Coalition had given more than US$25 million to charities. During the 2020 George Floyd protests, Boldin appeared on The Daily Show to talk about police racism and how athletes and the NFL could help society. He said why he founded the Players Coalition: \"For me it was really important. Unfortunately, I lost my cousin at the hands of law enforcement. He was a drummer in a band. One night after ashow he had just played with his band, he ended up breaking down by the side of the road. Long story short, a law enforcement officer killed him while he was on the phone with roadside assistance. For me, seeing the pain my family went through, seeing how long the process was before we felt like justice was served, I didn't want any other family to have to deal with that.\" \"I can tell you that, even after having money, I found myself in those situations where I'm pulled over just because of the car that I'm driving or the color of my skin. Having money doesn't exempt you from being black in America.\" He said he was glad that sporting events had been canceled because of COVID-19: \"The one thing I'm happy that is not happening right now is that sports isn't being played.\" He then named many tournaments and other events that had been cancelled. \"...and everybody could be distracted by those things that are going on, but because you don't have sports, everybody's attention is focused on this one thing. And I think, for us, this is the opportunity to really create change. It's an opportunity for us to really strategize and have a game plan going forward. So I'm actually happy that there are no sports because there's nothing to distract people from the real issue that needs to be talked about.\" ==References== ==Other websites== *Anquan Boldin at NFL.com Category:1980 births Category:Living people Category:Arizona Cardinals players Category:Baltimore Ravens players Category:Detroit Lions players Category:San Francisco 49ers players Category:African-American players of American football Category:American football wide receivers Category:Sportspeople from Florida",
 "title": "Anquan Boldin"
}