{
 "id": "288183",
 "text": "Rebecca Renee Black (born June 21, 1997) is an American singer and YouTuber who became famous for her 2011 single, \"Friday\". Her single gained around 1,000 views in the first month and has had negative views. After the video saw many views on YouTube and other social media websites, \"Friday\" expressed unpraise by many music critics and viewers. They described it as \"the worst song ever\". After the video was uploaded in Youtube on February 10, 2011 and its temporary removal on June 16, 2011, the music video received around 167 million views. Black re-uploaded it to her own YouTube channel in September 2011. In 2023, Black released her first album Let Her Burn. It had mostly positive reviews from critics. She released her second album Salvation on February 27, 2025. ==Early life== Rebecca Renee Black was born on June 21, 1997, in Irvine, California. She is the daughter of John Jeffery Black and Georgina Marquez Kelly, who are veterinarians. Her mother is of half Mexican ancestry, and her father is from Iowa,rebecca (June 28, 2013). DRAW MY LIFE - REBECCA BLACK on Youtube. Retrieved December 21, 2013. is of Italian, English, and Polish ancestry. She has one younger brother named Chase (born August 25, 1999). Her parents divorced in 2003 when Black was in first grade. Her grandmother lives in Illinois. Black's aunts and uncles live around the United States. Black originally attended private school from kindergarten to 6th grade. She moved to a public school due to bullying. She joined the school's musical theater program, which she felt being involved in was \"meant to be,\" and that she became part of another family. In April 2011, she dropped out in favor of homeschooling because she needed to focus on her career\"Rebecca Black ran toward 'stuff' like VMAs, not away from bullies\". Los Angeles Times. August 2011. and she wanted to avoid insults from her former classmates.\"Rebecca Black opts for homeschooling after taunts\". New York Post. 2011-08-10 She was also failing English class because of her busy schedule. ==Discography== ===Studio albums=== Title Details Let Her Burn * Released: February 9, 2023 * Label: Self-released * Formats: LP, digital download Salvation * Released: February 27, 2025 * Label: Self-released * Formats: LP, digital download ===Extended plays=== Title Details RE / BL * Released: September 15, 2017 * Label: Teall, self-released * Formats: CD, digital download Rebecca Black (Live Session, Los Angeles, California, 2019) * Released: May 29, 2020 * Label: Jam in the Van * Formats: Digital download Rebecca Black Was Here * Released: June 16, 2021 * Label: Self-released * Formats: Digital download ===Singles=== Title Year Peak chart positions Certifications Album US Peak positions for singles in the US: * All except noted: * \"Saturday\": US Heat Peaks on Heatseekers Songs: * Main: * \"Saturday\": US Dance AUS Digital CAN IRL NZ SCO UK \"Friday\" 2011 58 1 — 40 61 46 33 45 60 * RIAA: Gold rowspan=\"6\" \"My Moment\" — — — — — — — — — \"Person of Interest\" — — — — — — — — — \"Sing It\" 2012 — — — — — — — — — \"In Your Words\" — — — — — — — — — \"Saturday\" (with Dave Days) 2013 55 2 — — — — — — — \"The Great Divide\" 2016 — — 23 — — — — — — RE / BL \"Foolish\" 2017 — — — — — — — — — \"Heart Full of Scars\" — — — — — — — — — \"Anyway\" 2019 — — — — — — — — — rowspan=\"6\" \"Do You?\" — — — — — — — — — \"Sweetheart\" — — — — — — — — — \"Self Sabotage\" 2020 — — — — — — — — — \"Closer\" — — — — — — — — — \"Ven Dímelo (Love Is Love)\" (with Dani Ride) — — — — — — — — — \"Girlfriend\" 2021 — — — — — — — — — Rebecca Black Was Here \"Friday (Remix)\" (featuring 3OH!3, Big Freedia and Dorian Electra) — — — — — — — — — \"Personal\" — — — — — — — — — Rebecca Black Was Here \"Worth It for the Feeling\" — — — — — — — — — \"Read My Mind\" (featuring Slayyyter) — — — — — — — — — rowspan=\"2\" \"Heart2\" (with umru and Petal Supply) 2022 — — — — — — — — — \"Crumbs\" — — — — — — — — — Let Her Burn \"Look at You\" — — — — — — — — — \"Sick to My Stomach\" 2023 — — — — — — — — — \"Trust!\" 2024 — — — — — — — — — Salvation \"Sugar Water Cyanide\" — — — — — — — — — \"Salvation\" 2025 — — — — — — — — — \"—\" denotes releases that did not chart or were not released in that territory. ===Music videos=== List of music videos, showing year released and director Title Year Director Notes \"Friday\" 2011 Patrice Wilson and Clarence Jey \"Last Friday Night (T.G.I.F.)\" Marc Klasfeld Guest appearance only; Katy Perry's music video \"My Moment\" Morgan Lawley \"Person of Interest\" Mazik Self \"Sing It\" 2012 Ryan Pesecky \"In Your Words\" \"Saturday\" 2013 Chris Grieder \"The Great Divide\" (Crash Cove Remix) 2016 Taljon DeRuiter \"If We Were a Song\" 2017 \"Foolish\" Lobster Bear \"Heart Full of Scars\" Garrett Nicholson \"Satellite\" 2018 Jesse Dacri, Emily Skeggs and Zach Williams \"Anyway\" 2019 Garrett Nicholson \"Do You?\" Bia Jurema \"Sweetheart\" \"Ass Like Mine\" 2020 Brad Hammer Guest appearance only; Morgan McMichaels's music video \"Alone Together\" \"Edgelord\" Dorian Electra and Weston Allen Featured; Dorian Electra's music video \"Friday (Remix)\" 2021 Weston Allen \"Yoga\" Shiraz and Mike Featured; bbno$'s music video \"Crumbs\" 2022 Luke Orlando \"Look at You\" \"Sick to My Stomach\" 2023 Christina Bryson \"Trust!\" 2024 Olivia De Camps \"Sugar Water Cyanide\" Rebecca Black, Buck Andrews, Kelsi Franzino, Jack Kolbe and Audrey Lipsmire \"Salvation\" 2025 Olivia De Camps ==Filmography== Year Title Role Type Notes 2012 Katy Perry: Part of Me Herself Film Documentary 2013 Legend of a Rabbit Penny Film Voice (English dub) 2014 Fine Brothers Herself Web YouTubers React session (Season 3) 2016 Life After Friday Herself Web 2022 Is It Cake? Herself Netflix series Episode 5 ==Awards and nominations== Year Nominated work Event Award Result 2011 \"Which Seat Can I Take?\" MTV O Music Awards Favorite Animated GIF Herself Teen Choice Award Choice Web Star 2022 Rebecca Black Was Here Libera Award Self-Released Record of the Year ==References== ==Other websites== * * * * * * Category:American child singers Category:American pop musicians Category:American Internet celebrities Category:Singers from California Category:1997 births Category:Living people Category:People from Irvine, California",
 "title": "Rebecca Black"
}