{
 "id": "288193",
 "text": "Bing is a cultivar (farmed type) of the wild or sweet cherry (Prunus avium) that started in the Pacific Northwest, in Milwaukie, Oregon, United States. The Bing remains a major cultivar in Oregon, Washington, and British Columbia. It is the most produced variety of sweet cherry in the United States. == History == The cultivar was created as a crossbred graft from the Republican cherry in 1875 by Oregon horticulturist Seth Lewelling and his Manchurian Chinese foreman Ah Bing, for whom the cultivar is named.Peg Herring, Bing cherries are an American favorite. But who was Bing? , Oregon Progress, Oregon State University Agricultural Experiment Station, Fall 2009. === Ah Bing === Ah Bing was reportedly born in China and immigrated to the U.S. in about 1855. He worked as a foreman in the Lewelling family fruit orchards in Milwaukie for about 35 years, supervising other workers and caring for trees. He went back to China in 1889 for a visit. Due to the restrictions of the Chinese Exclusion Act of 1882 he never returned to the United States.Ah Bing, Infoplease.com, accessed September 23, 2010 Some say Ah Bing developed the cultivar, others that it was developed by Lewelling and named in Bing's honour due to his long service as orchard foreman. == Horticultural production == Bing cherries are used almost exclusively for fresh market. Bings are large, dark and firm cherries that ship well, but will crack open if exposed to rain near harvest. A wet climate is required for the harvest of the bing cherry. ==Health== Bing cherries are high in anti-oxidants. \"A Daily Dose of Antioxidants?\" in Agricultural Research, March 2008. A study by the United States Department of Agriculture has shown that fresh Bing cherries may help sufferers of arthritis and gout.Fresh Cherries May Help Arthritis Sufferers However, the U.S. Food and Drug Administration warns that these are yet unproven claims.List of Firms Receiving Warning Letters Regarding Cherry and other Fruit-Based Products with Disease Claims in Labeling ==References== ==Other websites== *All about cherries Category:Prunus Category:Dishes named after people",
 "title": "Bing cherry"
}