{
 "id": "288267",
 "text": "There are many translations of the Bible in English. People don't agree about what is the \"original Bible\". Because there are many versions of Greek and Latin Bibles, there are also many versions of the English Bible. Some translations are word-for-word from the original language. These translations are usually difficult to read. Other translations are idea-for-idea. These translations change the ideas of the original Bible into English. Some idea- for-idea translations use very easy English. Literal translations are difficult for some people to understand. But, non-literal translations can change the meaning. \"Dynamic Equivalence\" means making the Bible easy to read, without changing the meaning. ==Modern English Bible Versions== ===Christian Translations=== Most English Bible translations are written from a Christian point of view. ====The King James Version==== The Authorized King James Version (KJV) is very popular. Many parts of it are literal (word-for-word) translations of the original Greek and Hebrew. The KJV Bible was produced from 1604 to 1611, as a revision of the Bishops Bible. Since 1600, many English words have changed. Because the KJV Bible is 400 years old, it is more difficult to read. But even though it is 400 years old, many expressions and idioms used in everyday modern English come from the KJV. Since 1611, the first KJV Bible has been changed. The edition usually used today is the 1769 edition. The new versions, which are revisions of the KJV include the Revised Version (1885), the Revised Standard Version (1952), the New Revised Standard Version (1989), and the English Standard Version (2001). ====Other Translations==== :The New English Bible (1970) - from the United Kingdom. This was a fresh ecumenical translation. :Letters to Young Churches (1958) - by John Bertram Phillips. This is a translation of the New Testament Epistles (Letters). :The Living Bible (1971) - by Kenneth N Taylor. This is a paraphrase of the American Standard Version (1901). :The Good News Bible (1976) - from the American Bible Society. This is one of the most popular Bibles. :The New International Bible (1978) - This Bible is between the King James Version (very literal) and the Good News Bible (very informal). :The New Living Translation (1996) - a new version of \"The Living Bible\". On the internet, there are many translations of the Bible. You can read virtual Bibles. If you want to read part of the Bible, you can print that part. This is called \"print on demand\". Today, there are many translations that are literal, not literal, and between. The Young's Literal Translation is very literal. The Message Bible and The Word on the Street are not literal. ====Gender Neutral Versions==== In the Bible, men and women are equal. They just have different roles. Men are supposed to be the dominant figures in society. Some new translations weaken male dominance. These translations are called feminist, gender neutral, or gender accurate. Some gender-neutral translations are: the New Revised Standard Version (1989), the Revised English Bible (1989), Today's New International Version (2005), New International Version (2011). The English Standard Version (2001) also tries to be more equal. ====Simplified English Bibles==== Many people have written simpler Bibles. These Bibles use few words. Some are written for non-native speakers of English. Abbreviation Name Date BBE Bible in Basic English 1949 BWE Bible in Worldwide English [New Testament only] 1969 NLV New Life Version (Gleason Ledyard) 1986 SEB Simple English Bible (Dr Stanley Morris) 1980 ERV Easy-to- Read Version (previously English Version for the Deaf) 1989 NCV New Century Version 1991 NIrV New International Reader's Version 1998 EEB EasyEnglish BibleSimple Translations of the Bible in Easy English 2001+ ====World English Bible==== The World English Bible is a version of the Bible written in modern English. It began in 1997 and was a revision of the American Standard Version 1997. The project began with the goal of producing an English-language version of the Bible that does not use older English nor Basic English. It is based on the 1901 American Standard Version, the Greek Majority Text, and the Hebrew Biblia Hebraica Stuttgartensia with some minor changes made because of alternative readings in the Dead Sea Scrolls and the Septuagint but these alternative readings are ignored or restricted to the footnotes. There are seven passes of editing and reading for each book. The first pass updated about 1,000 words, phrases and grammatical constructs. The first manual pass was to add quotation marks and other punctuation, and to check the version against the Greek and Hebrew texts where there are large textual variants or the meaning is not clear. ===Jewish Translations=== Sometimes Jews and Christians do not agree on how to translate the Hebrew Bible, or Tanakh. Jews have written translations that follow Jewish opinions. These include: :Jewish Publication Society of America Version (JPS)(1917) — based on the Revised Version and American Standard Version (see above), but changed to follow Jewish opinions. :Judaica Press (1963) :New Jewish Publication Society of America Version (NJPS)(1985) — a new translation, not based on JPS 1917 :ArtScroll Stone Edition (1996) Many Jewish Bible translations show the English and original Hebrew on facing pages. None of these translations is considered Simple English or Basic English. ==Related pages== * Bible translations - for a view of translation into languages other than English. * Bible version debate ==References== ==Other websites== * The Gender-Neutral Bible Controversy * Translations of the Bible Into English * An extensive list of English translations * OSIS User Manual Appendix D provides standard abbreviations for many translations. Category:Bible versions",
 "title": "Modern English Bible translations"
}