{
 "id": "288237",
 "text": "The Lieutenant Governor () is the representative on the Isle of Man of the Lord of Mann, who is currently Queen Elizabeth II. He/she has the power to grant Royal Assent and is styled His Excellency. The official residence of the Governor is Government House, Governor's Road, Onchan. The Lieutenant Governor had all judicial, fiscal (tax raising) and executive power. In about 1900 they had more power over the island than any other Commonwealth leader had in their colony or Dominion. However, he lost his role as Head of the Judiciary and as Head of Government in 1961, as President of Legislative Council in 1980 and finally as President of Tynwald in 1990. Today the role of Lieutenant Governor is mainly ceremonial. Some powers under Isle of Man legislation do still fall to the Governor or Governor-in-Council. ==Proposed change to title== In October 2005 Tynwald wanted to change the title of the Lieutenant Governor to Crown Commissioner. This proposal was sent to the British Department of Constitutional Affairs for submission to the Lord of Mann Elizabeth II for approval. However, in April 2006, after much public disapproval, Tynwald rejected their own proposal and withdrew their request for Royal Assent. Thus the Lieutenant Governor will remain as currently titled. ==List of lieutenant governors== *Henry Hope (1773-1775) *Richard Dawson (1775-1790) *Alexander Shaw (1790-1804) *Henry Murray (1804-1805) *Cornelius Smelt (1805-1832) *Major General The Honourable John Ready (1832-1845) *The Honourable Charles Hope (1845-1860) **Mark Hildesley Quayle (1860) acting *Francis Pigott Stainsby Conant (1860-1863) **Mark Hildesley Quayle (1863) acting *Sir Henry Brougham Loch KCB, Baron Loch (1863-1882) *Sir Spencer Walpole (1882-1893) *Joseph West Ridgeway (1893-1895) *John Henniker-Major, 5th Baron Henniker (1895-1902) *George Fitzroy Henry Somerset, 3rd Baron Raglan (1902-1918) *William Fry (1918-1925) *Claude Hill (1925-1932) *Montagu Sherard Dawes Butler (1932-1937) *Vice Admiral William Spencer Leveson-Gower, the Earl Granville, KG, KCVO, CB, DSO (1937-1945) *Air Vice Marshal Sir Geoffrey Rhodes Bromet, KBE, CB, DSO (1945-1952) *Sir Ambrose Dundas Flux Dundas, KCIE, CSI (1952-1959) *Sir Ronald Herbert Garvey, KCMG, KCVO (1959-1966) *Sir Peter Hyla Gawne Stallard, KCMG, CVO, MBE (1966-1974) *Sir John Warburton Paul, GCMG, OBE, MC (1974-1980) *Rear Admiral Sir Nigel Cecil, KBE, CB (1980-1985) *Major General Sir Laurence New, CB, CBE (1985-1990) *Air Marshal Sir Laurence Jones, KCB, AFC (1990-1995) *Sir Timothy Daunt, KCMG (1995-2000) *Air Marshal Ian David Macfadyen, CB, OBE (2000-2005) **Deemster Michael Kerruish QC (2005) acting *Vice Admiral Sir Paul Kenneth Haddacks, KCB (2005-2011) *Adam Kenneth Compton Wood (2011 - 2016) *Sir Richard Hugh Turton Gozney, KCMG CVO KStJ (2016-present) ==Related pages== *Governors of the Isle of Man *King of Mann *Lord of Mann Lieutenant Governors of the Isle of Man, List of",
 "title": "Lieutenant Governor of the Isle of Man"
}