{
 "id": "288404",
 "text": "Mechanical advantage (also written as MA in formulas) is the factor by which a machine multiplies force. The mechanical advantage of a machine can be used to find out how well a machine works and whether it can perform a particular job. The mechanical advantage of a machine is the ratio of the load (the resistance overcome by a machine) to the effort (the force applied). :MA = \\frac{\\text{output force}}{\\text{input force}} For an ideal (without friction) mechanism, it is also equal to: :MA = \\frac{\\text{distance over which effort is applied}}{\\text{distance over which the load is moved}} == Ideal vs actual mechanical advantage == There are two types of mechanical advantage: ideal and actual. Ideal mechanical advantage (also written as IMA) assumes that no power is lost by friction or other causes. This means the power of the input (load) should equal the power of the output (effort). So, force times speed of the input should equal force times speed of the output. : P = F_\\text{in}v_\\text{in}= F_\\text{out}v_\\text{out}. You can calculate ideal mechanical advantage without measuring the forces. It is the distance over which effort is applied, divided by the distance over which the load is moved. In reality, there is friction, so some of the power is lost. The actual mechanical advantage (also written as AMA) is always less than ideal. To calculate actual mechanical advantage, you must measure the forces. Then divide the output force by the input force. The mechanical efficiency is the ratio of the actual mechanical advantage to the ideal mechanical advantage. It is also written as η, the Greek letter eta. : \\eta =\\frac\\mathit{AMA}\\mathit{IMA} ==Example of mechanical advantage== See the illustration. In the top picture of the right column, a lever is delivering a force to a stone. If there is a mechanical advantage of 2, then the output force is twice the size of the input force. ==No unit for mechanical advantage== There is no unit for mechanical advantages, because the unit for both input and output forces cancel out. Category:Mechanics",
 "title": "Mechanical advantage"
}