{
 "id": "28858",
 "text": "Major League Soccer (MLS) is an American soccer league that started in 1996. As of the current 2025 season, 30 teams play in the league. The commissioner of the league (the person in charge) is Don Garber. MLS, founded in the United States, is a fully professional league with 30 teams, three of which are based in Canada. The United States Soccer Federation (USSF or U.S. Soccer), which runs soccer in that country, considers MLS to be the country's top men's league. The Canadian Soccer Association (CSA), which runs soccer in Canada, considers the Canadian Premier League as its top men's league, but MLS has much greater Canadian media coverage and is seen as having a higher level of play. Referees are approved by U.S. Soccer and the CSA. In turn, both national governing bodies are members of FIFA, which governs all play between national teams and sets the rules for the sport along with the national governing bodies of England, Northern Ireland, Scotland, and Wales. MLS was formed in 1993 as a professional league, with play starting with 10 teams in 1996. The MLS regular season starts in late February and ends in November, with each team playing 34 games. The regular season is followed by a playoff tournament to decide the league champion. == Teams == === Current === Team City Stadium Founded Joined Conference Head Coach Atlanta United FC Atlanta, Georgia Mercedes-Benz Stadium 2014 2017 Eastern Conference Ronny Deila Austin FC Austin, Texas Q2 Stadium 2019 2021 Western Conference Nico Estévez C.F. Montréal Montreal, Quebec Saputo Stadium 2010 2012 Eastern Conference Laurent Courtois Charlotte FC Charlotte, North Carolina Bank of America Stadium 2019 2022 Eastern Conference Dean Smith Chicago Fire FC Chicago, Illinois Soldier Field 1997 1998 Eastern Conference Gregg Berhalter Colorado Rapids Commerce City, Colorado Dick's Sporting Goods Park 1995 1996 Western Conference Chris Armas Columbus Crew Columbus, Ohio Lower.com Field 1994 1996 Eastern Coference Wilfried Nancy D.C. United Washington, D.C. Audi Field 1994 1996 Eastern Conference Troy Lesesne FC Cincinnati Cincinnati, Ohio TQL Stadium 2018 2019 Eastern Conference Pat Noonan F.C. Dallas Frisco, Texas Toyota Stadium 1995 1996 Western Conference Eric Quill Houston Dynamo Houston, Texas Shell Energy Stadium 2005 2006 Western Conference Ben Olsen Inter Miami CF Fort Lauderdale, Florida Chase Stadium 2018 2020 Eastern Conference Javier Mascherano Los Angeles FC Los Angeles, California BMO Stadium 2014 2018 Western Conference Steve Cherundolo Los Angeles Galaxy Carson, California Dignity Health Sports Park 1994 1996 Western Conference Greg Vanney Minnesota United FC Saint Paul, Minnesota Allianz Field 2015 2017 Western Conference Eric Ramsey Nashville SC Nashville, Tennessee Geodis Park 2017 2020 Eastern Conference B. J. Callaghan New England Revolution Foxborough, Massachusetts Gillette Stadium 1994 1996 Eastern Conference Caleb Porter New York City F.C. New York City, New York Yankee Stadium 2013 2015 Eastern Conference Pascal Jansen New York Red Bulls Harrison, New Jersey Red Bull Arena 1994 1996 Eastern Conference Sandro Schwarz Orlando City SC Orlando, Florida Inter&Co; Stadium 2013 2015 Eastern Conference Óscar Pareja Philadelphia Union Chester, Pennsylvania Subaru Park 2008 2010 Eastern Conference Bradley Carnell Portland Timbers Portland, Oregon Providence Park 2009 2011 Western Conference Phil Neville Real Salt Lake Sandy, Utah America First Field 2004 2005 Western Conference Pablo Mastroeni San Diego FC San Diego, California Snapdragon Stadium 2023 2025 Western Conference Mikey Varas Energizer Park 2019 2023 Western Conference Olof Mellberg San Jose Earthquakes San Jose, California PayPal Park 1994 1996 Western Conference Bruce Arena Seattle Sounders F.C. Seattle, Washington Lumen Field 2007 2009 Western Conference Brian Schmetzer Sporting Kansas City Kansas City, Kansas Children's Mercy Park 1995 1996 Western Conference Peter Vermes Toronto F.C. Toronto, Ontario BMO Field 2005 2007 Eastern Conference Robin Fraser Vancouver Whitecaps Vancouver, British Columbia BC Place 2009 2011 Western Conference Jesper Sørensen ===Former teams=== Team City Last Stadium Founded Joined Left MLS Dissolved Conference Tampa Bay Mutiny Tampa, Florida Raymond James Stadium 1994 1996 2001 2002 Central Conference Miami Fusion Fort Lauderdale, Florida Lockhart Stadium 1997 1998 2001 2002 Eastern Conference Chivas USA Carson, California StubHub Center 2004 2005 2014 2014 Western Conference == MLS Cup winners == Season Champions Runner-up 1996 D.C. United LA Galaxy 1997 D.C. United Colorado Rapids 1998 Chicago Fire DC United 1999 D.C. United LA Galaxy 2000 Kansas City Wizards Chicago Fire 2001 San Jose Earthquakes LA Galaxy 2002 LA Galaxy New England Revolution 2003 San Jose Earthquakes Chicago Fire 2004 D.C. United Kansas City Wizards 2005 LA Galaxy New England Revolution 2006 Houston Dynamo New England Revolution 2007 Houston Dynamo New England Revolution 2008 Columbus Crew New York Red Bulls 2009 Real Salt Lake LA Galaxy 2010 Colorado Rapids FC Dallas 2011 LA Galaxy Houston Dynamo 2012 LA Galaxy Houston Dynamo 2013 Sporting Kansas City Real Salt Lake 2014 LA Galaxy New England Revolution 2015 Portland Timbers Columbus Crew SC 2016 Seattle Sounders FC Toronto FC 2017 Toronto FC Seattle Sounders FC 2018 Atlanta United FC Portland Timbers 2019 Seattle Sounders FC Toronto FC 2020 Columbus Crew SC Seattle Sounders FC 2021 New York City FC Portland Timbers 2022 Los Angeles FC Philadelphia Union 2023 Columbus Crew Los Angeles FC 2024 LA Galaxy New York Red Bulls ==Related pages== * USL Championship == References == * Best Players in Major league Soccer (MLS) in 2012. hub, n.d. Web. 18 Dec. 2012. * Major League Soccer. Princeton, n.d. Web. 18 Dec. 2012. * An Overview of American Soccer History. Dave Litterer, n.d. Web. 18 Dec. 2012. * Soccer Politics / The Politics of Football. Duke University, n.d. Web. 18 Dec. 2012. Category:Soccer in the United States Category:Soccer in Canada Category:Sports organizations of the United States Category:1996 establishments in the United States Category:Soccer leagues in the United States Category:Soccer leagues in Canada",
 "title": "Major League Soccer"
}