{
 "id": "288521",
 "text": "The iPad 2 is a tablet made by Apple Inc. As the second model in the iPad line, it has a faster A5 chip, and is faster than the previous model. The device was first made available with three sizes – 16, 32, and 64 GB – and two options – Wi-Fi only or Wi-Fi and cellular. Each version of the device is available with either a black or white front. But after the release of the 3rd generation iPad in March 2012, the 32 and 64 GB versions were discontinued, leaving only the 16 GB version being available. A popular tablet, it was in the line-up as a cheap iPad model for three years until March 2014, later with a small upgrade to an advanced version of the A5 chip. Its basic design made the centre of the first iPad mini, which had the same screen pixel count and the same things at a smaller size. The tablet became available from March to May 2011. The April 29, 2011 release date for Japan was due to the earthquake and tsunami which hit the country on March 11, 2011. Supported from iOS 4 to iOS 9, the iPad 2 is the only device using the Apple A5 to have received six versions of iOS, and the first device made by Apple to do so. ==History== Apple began selling the iPad 2 on its website on March 11, and in its U.S. stores at 5 pm on that date. Many stores in big cities, such as New York, sold out in hours. Online shopping delays had increased to three to four weeks on Sunday and four to five weeks by Tuesday. The iPad 2 was released in 25 other countries on March 25, 2011. The countries included Australia, Austria, Belgium, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Ireland, Hungary, Luxembourg, Mexico, Netherlands, New Zealand, Norway, Poland, Portugal, Spain, Sweden, Switzerland and the United Kingdom. The April 29, 2011 release date for Japan was delayed due to the earthquake and tsunami which hit the country on March 11, 2011. The iPads were delayed due to the chip used in the iPads being made by Toshiba, which was affected by the earthquake and tsunami, resulting in delay for a long period of time. The iPad 2 was later released in Hong Kong, India, South Korea, Singapore, Philippines, Malaysia and other countries including Japan on April 29, 2011. It was then released in many other countries which include China, Estonia, Thailand, Brazil, Russia and Taiwan on two dates, May 6 and 27. The 32 and 64GB models were removed on March 7, 2012, after the announcement of the third generation iPad. The 16GB Wi-Fi and 16GB Wi-Fi + 3G models were later removed on March 18, 2014. ==Features== In late March 2011, the iPad 2 was released with iOS 4.3, which had Airplay Mirroring and Home Sharing with other features. On October 12, 2011, after the release of the iPhone 4S, the iPad can upgrade to the iOS 5.1 update which released more than 200 new features to iOS devices including Game Center, iMessage, Reminders, and a new notice system, using a new style instead of the old “alert” style. Later, iOS 5 was available for the iPad 2, which released more than 200 features on the iOS devices. On September 19, 2012, iOS 6 was released for many iOS devices, but not all features are available on the iPad 2. The upgrade was an update package and had a lot of new features, which had a map software made by Apple named Apple Maps, a \"Clock\" app, which has a timer, stopwatch and alarm, and Facebook with other new features. In 2013 the iPad 2 received iOS 7, but some features were not available, with AirDrop only being available to the iPad 4 and later, and no Siri. It later got iOS 8 in 2014, being the first Apple device to get five versions of iOS (4, 5, 6, 7, and 8). But most of its new features do not work on the device due to old parts used in the tablet, and its performance was poor. Users have also reported problems on the device. In 2015, the device got iOS 9, being the first device to get six iOS versions (4, 5, 6, 7, 8, and 9) but many features weren’t on the tablet either due to older parts in it. The iPad 2 did not get iOS 10, released in 2016. ==References== Category:IPad Category:Apple products released in 2010s",
 "title": "IPad 2"
}