{
 "id": "288645",
 "text": "Sir Peter Brian Medawar OM CBE FRS (28 February 1915 – 2 October 1987) was a British biologist. His work was important to skin grafts and organ transplants. Transplants of skin and organs from other people are usually rejected. This is an action by the immune system. Medawar showed that sometimes this reaction can be avoided, and why. He worked on graft rejection and the discovery of acquired immune tolerance. He was awarded the 1960 Nobel Prize in Physiology or Medicine, with Sir Frank Macfarlane Burnet. Until he was partially disabled by a stroke, Medawar was Director of the National Institute for Medical Research at Mill Hill, London. == Achievements == Medawar was professor of zoology at the University of Birmingham (1947–51) and University College London (1951–62). In 1962 he was appointed director of the National Institute for Medical Research, and became professor of experimental medicine at the Royal Institution (1977–83), and president of the Royal Postgraduate Medical School (1981–87). Medawar was a scientist of great inventiveness who was interested in many other subjects including opera, philosophy and cricket. He was knighted in 1965, and appointed to the Order of Merit in 1981. == Outcome of research == Medawar was awarded his Nobel Prize in 1960 for work in tissue grafting, which is the basis of organ transplants. He and his team discovered acquired immunological tolerance. At birth, babies are protected by antibodies from the mother. During embryonic life and immediately after birth, immune cells develop. They 'learn' to distinguish between their own tissues on the one hand, and unwanted cells and foreign material on the other. Medawar's work resulted in a shift of emphasis in the science of immunology from one that attempts to deal with the fully developed immunity mechanism to one that attempts to alter the immunity mechanism itself. Various ways have been found to suppress the body's rejection of organ transplants. == Books == His books include #The uniqueness of Man, which includes essays on immunology, graft rejection and acquired immune tolerance; #Induction and intuition in scientific thought; #The art of the soluble, a book of essays, later reprinted in Pluto's Republic; #Advice to a young scientist; #Aristotle to Zoos: a philosophical dictionary of biology. (with his wife Jean Shinglewood Taylor) Oxford & Harvard. #The limits of science; #Memoirs of a thinking radish, an autobiography. Oxford. 1986 == Obituaries == * * * == References == Category:1915 births Category:1987 deaths Category:British zoologists Category:Order of Merit Category:Knights Bachelor Category:Nobel Prize in Physiology or Medicine winners Category:Fellows of the Royal Society Category:British autobiographers Category:British Nobel Prize winners Category:Immunologists Category:People from Petrópolis",
 "title": "Peter Medawar"
}