{
 "id": "288810",
 "text": "The Rhynie chert is a Lower Devonian sedimentary rock, part of the Old Red Sandstone. It has extraordinary fossils, and is a Lagerstätte. The chert is exposed near the village of Rhynie, Aberdeenshire, Scotland. A second unit, the Windyfield chert, is some 700 m away. The Rhynie chert is exceptionally preserved material covered by an overlying volcanic deposit. Most of the fossil bed has primitive plants (which had water-conducting cells and sporangia, but no true leaves). There are also arthropods, lichens, algae and fungi. == Significance == === Date === This fossil bed is remarkable for two reasons. First, the age of the site, formed about 410 million years ago. This places it at an early stage in the colonisation of land. Second, the sheer quantity and variety of lifeforms throws a vivid light on the whole ecosystem near the hot springs. === Quantity === Seven land plant taxa have been found in the Rhynie and Windyfield cherts:University of Aberdeen, The biota of early terrestrial ecosystems: the Rhynie Chert. *Aglaophyton *Asteroxylon *Horneophyton *Nothia *Rhynia *Trichopherophyton *Ventarura Also, the cherts have crustacea, primitive insects and other arthropods, fungi, lichen, and cyanobacteria. Even mycorrhizas are found in the Rhynie chert. === Quality === Second, these cherts are famous for their exceptional state of preservation. Individual cell walls are easy to see in polished specimens. Stomata have been counted and lignin remnants detected in the plant material. The \"book lungs\" of early spiders can be seen in cross-sections. Fungal hyphae can be seen entering plant material, acting as decomposers and mycorrhizal symbionts. The oldest known insect (Rhyniognatha hirsti), which is rather like the modern springtails, was found in the Rhynie chert. This pushes dates for the origin of insects back to the Silurian period. ==History of research== The chert was discovered by William Mackie while mapping the western margin of the Rhynie basin in 1910–1913. Since 1980, the chert has been examined by the Münster group, and from 1987 by Aberdeen University. They showed the chert was indeed produced by a hot spring setting. ==Conditions of formation== The chert was formed when silica-rich water from volcanic springs rose and rapidly petrified the early terrestrial ecosystem in situ. Organisms are petrified that way by hot springs today, although that quality of preservation has not been found in recent deposits. Hot springs, with temperatures between , were active; the water had probably cooled to under before it reached the fossilised organisms. The deposits are interbedded with sands, shales and tuffs, which speaks of local volcanic activity. Deposition was very rapid. The texture of the silica formed is like that found today in freshwater streams at Yellowstone National Park. They are typically alkaline (pH 8.7) and tepid . Living vegetation covered around 55% of the land area, with litter covering 30% and the remaining 15% of the ground being bare. :Contains useful reconstructions of both the plant associations, and the regional setting. ==Other websites== * == References == Category:Lagerstätten",
 "title": "Rhynie chert"
}