{
 "id": "289061",
 "text": "Christoph Leitgeb (born 14 April 1985 in Graz) is a former Austrian football player. He played in the Austrian Bundesliga for F. C. Red Bull Salzburg and Sturm Graz as a midfielder. He also played in the national team and was a member of Austria's team at Euro 2008. ==Career== He started playing football in the youth teams of SK Sturm Graz in his hometown. In the 2005–06 season he played his first match in the first team of Sturm Graz. The first goal he scored was on 22 April 2006 against Red Bull Salzburg. After two seasons with Sturm Graz he signed with FC Red Bull Salzburg. In his first year he played regularly, but in his second year he had problems with his knees. The following years he came back and played very often from the beginning. After spending 12 years in Salzburg he went back to SK Sturm Graz. In 2020 he ended his career and works now as scout for SK Sturm. ==International career== His first international match was in a friendly against Croatia on 23 June 2006. (1–4). He played 41 times for Austria. ==Career statistics== Club Season League Cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Sturm Graz 2005–06 Bundesliga 20 1 1 0 — 21 1 2006–07 34 4 0 0 34 4 Totals 54 5 1 0 — 55 5 Red Bull Salzburg 2007–08 Bundesliga 31 4 — 6 0 37 4 2008–09 16 0 1 0 3 0 20 0 2009–10 33 5 1 0 14 0 48 5 2010–11 36 1 1 0 11 0 48 1 2011–12 23 2 3 0 8 0 34 2 2012–13 22 4 3 0 2 0 27 4 2013–14 22 1 5 0 9 0 36 1 2014–15 18 0 3 1 10 0 31 1 2015–16 3 0 0 0 4 0 7 0 2016–17 8 0 3 0 0 0 11 0 2017–18 11 0 2 0 3 0 16 0 Totals 223 17 22 1 70 0 315 18 Career totals 277 22 23 1 70 0 370 23 Reference: ==Honours== ;Red Bull Salzburg *Austrian Football Bundesliga: 2008–09, 2009–10, 2011–12, 2013–14, 2014–15, 2015–16 *Austrian Cup: 2011–12, 2013–14, 2014–15, 2015–16 ==References== Category:1985 births Category:Living people Category:Austrian footballers Category:Sportspeople from Graz Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:UEFA Euro 2008 players Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Christoph Leitgeb"
}