{
 "id": "289283",
 "text": "Kingdom Hearts is the first game of the Kingdom Hearts series. It was made for PlayStation 2 and was released in Japan on March 28, 2002, and in North America on September 17, 2002. In it, the player controls Sora, a 14-year-old boy living in his home island, but is sent to different worlds along with his friends after their world is destroyed. Along the way, he meets various Disney characters, like Donald Duck and Ariel, and Final Fantasy characters, like Cloud and Yuffie. Sora must save the worlds while searching for his friends. == Story == Sora and his friends, Riku and Kairi, plan on leaving their homes on Destiny Islands to explore their world, but their plans are interrupted when their world is attacked by the Heartless; monsters who steal people's hearts. During the attack, Sora wields a weapon called a Keyblade. Their world is destroyed, and Sora, Riku and Kairi end up on different worlds. Sora accompanies Donald Duck and Goofy to find his lost friends, and they travel to worlds based on different Disney movies, including Alice in Wonderland, The Little Mermaid and The Nightmare Before Christmas. Sora learns later that Riku has sided with Darkness and kidnapped Kairi. Riku is possessed by a Heartless called Ansem, who wants to capture seven Princesses of Heart so he can open Kingdom Hearts, the heart of all worlds. Sora rescues Kairi and Riku and defeats Ansem. Kairi goes home to Destiny Islands, but Riku stays in Kingdom Hearts with King Mickey to defend it. Kingdom Hearts then disappears. Sora tells Kairi he will not come home until he finds Riku, and leaves with Donald and Goofy to start a new adventure. == Worlds == In the game, there are fourteen different worlds. Sora, Donald and Goofy travel to twelve of them using a space ship called a Gummi Ship. The worlds are: * Destiny Islands - Sora, Riku, and Kairi's home world. The game starts here. * Traverse Town - A world called a crossroads. When someone's world is destroyed, if they survive, they end up in Traverse Town. Sora wakes up here after Destiny Islands is destroyed. * Wonderland - This world is based on the Disney movie Alice in Wonderland. * Deep Jungle - This world is based on the Disney movie Tarzan. * Olympus Coliseum - This world is based on the Disney movie Hercules. * Agrabah - This world is based on the Disney movie Aladdin. * Atlantica - The world is based on the Disney movie The Little Mermaid. * Monstro - This world is based on the Disney movie Pinocchio. * Halloweentown - This world is based on the Tim Burton movie The Nightmare Before Christmas. * Neverland - This world is based on the Disney movie Peter Pan. * 100 Acre Wood - This world is based on Disney's Winnie the Pooh. * Hollow Bastion - This world was made up for the game. It is the original home of most of the Final Fantasy characters in the game, and the hide-out for the villains. * End of the World - The last world the player visits. It is where the final boss battle takes place. * Disney Castle - Donald and Goofy's home world. King Mickey and Queen Minnie also live here. Sora does not visit this world. It only appears in cutscenes. == Final Mix == Kingdom Hearts Final Mix is a reissue of the game that was released only in Japan on December 26, 2002. It has more features than Kingdom Hearts, including a battle with the Unknown Man, who is the main enemy in Kingdom Hearts II. It is also for the PlayStation 2. == References == == Other websites == * Official Kingdom Hearts site * Official international Kingdom Hearts site * * Official Kingdom Hearts TOKYOPOP manga site Category:2002 video games Category:Kingdom Hearts Category:Square Enix games Category:Disney video games Category:Action role-playing video games Category:Crossover role- playing video games Category:PlayStation 2 games Category:PlayStation 2-only games Category:Single-player video games Category:Sony Interactive Entertainment games Category:Video games developed in Japan",
 "title": "Kingdom Hearts (video game)"
}