{
 "id": "289291",
 "text": "Bill Bixby (born January 22, 1934 in San Francisco, California - November 21, 1993), was an American actor, director, and producer. He is known for the role of David Banner in the TV series The Incredible Hulk. Bixby died from complications of prostate cancer in Los Angeles on November 21, 1993. He was 59 years old. == Career == Bill Bixby made the most of his career in television. His credits on the big screen include: Irma la Douce (1963), with Jack Lemmon, and directed by Billy Wilder; Ride Beyond Vengeance (1966), western starring Chuck Connors; and two movies starring Elvis Presley, Clambake (1967) and Speedway (1968). His first television series was My Favorite Martian, playing the role of Tim O'Hara, and co-starring Ray Walston. The show aired on CBS from 1963 to 1966. Bixby continued to have success on television as the star of the ABC sitcom The Courtship of Eddie's Father (1969–1972), where he played a widower who cares for his young son played by Brandon Cruz. He also played in The Magician (1973–1974), as a famous magician Anthony Blake, who is also a detective. The biggest hit of his career would come in the late 1970s, playing the role of David Banner in CBS TV series The Incredible Hulk with Lou Ferrigno as the Hulk. The show is based on the character created by Stan Lee and Jack Kirby. After the success of the series, there were three movies filmed for television: The Incredible Hulk Returns (1988), directed by Nicholas Corea; The Trial of the Incredible Hulk (1989); and The Death of the Incredible Hulk, directed by Bixby. Bill Bixby was nominated for three Emmy Awards for his work in The Courtship of Eddie's Father (1969), The Streets of San Francisco (1972), and Rich Man, Poor Man (1976). == Filmography == Movie Year Títle Role Notes 1962 Lonely Are the Brave Airman in Helicopter Uncredited 1963 Irma la Douce Tattooed sailor 1963 Under the Yum Yum Tree Track team coach 1963–66 My Favorite Martian Tim O'Hara TV series 1966 Ride Beyond Vengeance Johnsy Boy Hood 1967 Doctor, You've Got to Be Kidding! Dick Bender 1967 Clambake James J. Jamison III 1968 Speedway Kenny Donford 1969–73 The Courtship of Eddie's Father Tom Corbett TV series 1971 Big Fish, Little Fish Ronnie TV movie 1972 The Couple Takes a Wife Jeff Hamilton TV movie 1973 Steambath Tandy TV movie 1973 Shirts/Skins Teddy Bush TV movie 1973–74 The Magician Anthony Blake TV series 1974 Rex Harrison Presents Stories of Love William TV movie 1975 The Apple Dumpling Gang Russel Donavan 1976 Rich Man, Poor Man Willie Abbott TV mini-series 1976 The Invasion of Johnson County Sam Lowell TV movie 1976 The Great Houdini Rev. Arthur Ford TV movie 1977 Black Market Baby Herbert Freemont TV movie 1977 The Incredible Hulk Dr. David Banner TV movie 1977 The Incredible Hulk: Death in the Family Dr. Bruce Banner TV movie 1978–82 The Incredible Hulk Dr. Bruce Banner TV series 1982 Murder Is Easy Luke Williams TV movie 1982 I've Had It Up to Here TV movie 1983–84 Goodnight, Beantown Matt Cassidy TV series 1985 International Airport Harvey Jameson TV movie 1986 Sin of Innocence David McGary TV movie 1986 True Confessions TV series 1988 The Incredible Hulk Returns Dr. Bruce Banner TV movie 1989 The Trial of the Incredible Hulk Dr. Bruce Banner TV movie 1990 The Death of the Incredible Hulk Dr. Bruce Banner TV movie == References == *Cult TV: the essential critical guide, by Jon E. Lewis, Penny Stempel *Encyclopedia of Television Series, Pilots and Specials: 1974-1984, by Vincent Terrace] == Other websites == *. Retrieved March 10, 2010. *. Retrieved March 10, 2010. *. Retrieved March 10, 2010 Category:1934 births Category:1993 deaths Category:American movie actors Category:American television actors Category:American television directors Category:American television producers Category:Cancer deaths in Los Angeles Category:Deaths from prostate cancer Category:Actors from San Francisco",
 "title": "Bill Bixby"
}