{
 "id": "289493",
 "text": "The Messel Pit () is a disused quarry near the village of Messel, Hesse. The site about 35 km southeast of Frankfurt am Main, Germany. It is a site where fine fossils are preserved: a lagerstätte. The site is very important: it includes fossils of early mammals, including early primates. Because of its fossils, the site has significant geological and scientific importance. Bituminous shale was mined there.Bitumenous: shale with coal, clay and oil. After almost becoming a landfill, strong local resistance eventually stopped those plans. The Messel pit was declared a UNESCO World Heritage Site in 1995. It was placed on the list solely due to fossils.Mayer E. 1994. Nomination of Messel Pit for inclusion in the UNESCO World Heritage List. Hessian Minister of State for Science and Arts, Messel. Amateur collectors developed a \"transfer technique\" to preserve the fine details of small fossils, the method still used to preserve the fossils today. Many of the known specimens from the site have come from amateur collectors, and in 1996, an amnesty on previously collected fossils was put in effect, in the hope of getting privately owned collections back into public ownership and available to science. == Ecology == The current surface of the Messel pit is roughly 60 m below the local land and is about 0.7 km² in area. The oil-shale bed originally extended to a depth of 190 m.United Nations Environment Programme-World Conservation Monitoring Centre (content partner); Mark McGinley. 2008. Messel Pit fossil site, Germany. In: Encyclopedia of Earth. ed Cutler J. Cleveland (Washington, D.C.: Environmental Information Coalition, National Council for Science and the Environment). [First published in the Encyclopedia of Earth November 29, 2007; Last revised July 8, 2008; Retrieved May 22, 2009. Pit fossil site, Germany article 47 million years ago in the Eocene when the Messel deposits formed, the area was 10° further south than it is now. The period was just after the Palaeocene–Eocene Thermal Maximum, and the climate and ecology of the site were very different from today. A large series of lakes, surrounded by lush sub-tropical forests supported an incredible diversity of life. The Messel lake bed was probably a center point for drainage from nearby rivers and creeks. The pit deposits were formed during the Eocene epoch of the Palaeogene period about 47 million years ago. This is based on dating of basalt fragments under the fossilbearing strata.Mertz D.F. & Renne P.R. 2005. A numerical age for the Messel fossil deposit (UNESCO World Heritage Site) derived from 40Ar/39Ar dating on a basaltic rock fragment. Courier Forschungsinstitut Senckenberg. #255: 7–75 Oil shale, formed by the slow anoxic deposition of mud and dead vegetation on the lake bed, is the primary rock at the site. Its sediments extend 130 m downward and lie atop an older sandstone foundation. The fossils within the shale show a remarkable clarity and preservation due to the unique depositional characteristics of the lake. The upper layers of the lake had a great deal of life, but the bottom was anoxic. Because the water was not much disturbed, little oxygen got to the lower levels. This prevented many epifaunal (bottom-living) and infaunal (burrowing) species from living there. That is why dead bodies were so little damaged. Overturn of the lake layers (caused by seasonal variations) lowered oxygen content near the surface and led to a periodic \"die-off\" of aquatic species. Combined with a relatively low rate of deposition (0.1 mm/yr), this was a prime environment for the preservation of fauna and flora. === Volcanic gas releases === The area around the Messel Pit was geologically and tectonically active during the Eocene. Volcanic gas releases could account for the large deposition of non-aquatic species. Subsurface shifts released large concentrations of reactive gases (such as carbon dioxide and hydrogen sulfide) into the lake and adjoining ecosystems, killing susceptible organisms. During these releases, birds and bats might have fallen in if near the lake surface, and terrestrials could be overwhelmed near the lake shore. ==Fossils== The Messel Pit provides the best preserved evidence of early Eocene flora and fauna so far discovered. Most other sites are lucky to contain partial skeletons, but Messel boasts extensive preservation of structural integrity, even going so far as to preserve the fur, feathers, and \"skin shadows\" of some species. Unusual preservation has sparked some closely-reasoned interpretations. The symptomatic \"dumb-bell\"-shaped bite marks on either side of the leaf vein on a fossilised leaf have been identified as the death-grip of a carpenter ant terminally parasitized by a fungus that, apparently then as today, took over its behaviour to release its spores at a good location; it is the earliest clear example of fungal behavioural manipulation.Guardian.com, \"'Zombie ants' controlled by parasitic fungus for 48m years\", 18 August 2010]: accessed 21 August 2010 The diversity of species is astonishing. Here is a brief summary of some of the fossils found at the site: * Early primate fossil with anthropoid (i.e. non-lemuroid) characteristics: discovery made public May 2009 of Darwinius masillae * Nine mating pairs of fossil turtles have been found. The turtles, Allaeochelys crassesculpta, were in coitus (in the act of having sex).Amos, Jonathan 2012. Turtles fossilised in sex embrace. BBC News: Science & Environment. They are male-female pairs, with the male's tail tucked under the female, which is how they have sex. Their death must have been rapid. It is supposed that the turtles had started mating in the aerated surface waters of the ancient lake. As they sank into deeper water, they were overcome by the release of toxic volcanic gas. They were then buried in the lakebed sediment.Joyce W.G. et al 2012. Caught in the act: the first record of copulating fossil vertebrates. Biology Letters Full free access. Turtles belonging to this clade are still living. They have lost their reptilian scales, and their skin absorbs oxygen from the water. Normally, this is an advantage: it helps them stay submerged for long periods. However, under anoxic conditions it is a disadvantage, because carbon dioxide and dissolved poisons are absorbed as well. * Over 10,000 fossilized fish of numerous species * Thousands of aquatic and terrestrial insects, some with distinct colour still preserved * Many small mammals including pygmy horses, large mice, primates, ground dwellers (hedgehogs, marsupials, pangolins), aardvark relatives, and bats. * Many birds, particularly predatory species. * Crocodiles, frogs, turtles, salamanders, and other reptiles or amphibians * Remains of over 30 plant species, including palm leaves, fruits, pollen, wood, walnuts, and grapevines The assemblage of fossils includes a South American anteater, two types of South American flightless birds, and an ancestor of the scaly ant-eater (Manis) of the old-world tropics.George W. & Lavocat R. (eds) 1993. The AfricaSouth America connection. Oxford Monographs in Biogeography #7, p119141. ==Related pages== * Lagerstätte ==References== ==Other websites== * Messel Fossils * Missing Link Found at Messel Pit? * Daily Mail article on fossils found at Messel pit; many colour photos Category:World Heritage Sites in Germany Category:Landmarks in Germany Category:Eocene Category:Lagerstätten",
 "title": "Messel pit"
}