{
 "id": "289584",
 "text": "The Space Shuttle Challenger disaster occurred on January 28, 1986, when the NASA's exploded after 73 seconds of flight. All seven crew members were killed. It was the 25th flight of a Space Shuttle. The cause of the explosion was a part called an O-ring that broke in the right solid rocket booster. During the flight, hot gases escaped from the O-ring and made it break apart. Shuttles stopped flying for two and a half years. == Background == The mission of the flight that ended in disaster was named STS-51-L. It was the tenth mission for Challenger. STS-51-L was scheduled to deploy the second in a series of Tracking and Data Relay Satellites. It was also going to carry out the first flight of the \"Shuttle Pointed Autonomous Research Tool for Astronomy\" (SPARTAN-203) / Halley's Comet Experiment Deployable in order to observe Halley's Comet. One of the crew members was Christa McAuliffe, a civilian teacher. She was going to carry out several lessons from space as part of the Teacher in Space Project and Shuttle Student Involvement Program (SSIP). Another crew member of this mission, Gregory Jarvis, was originally going to fly on the previous shuttle flight (STS-61-C). However, he was reassigned to this flight and replaced by Congressman Bill Nelson. == O-ring issues == The O-ring was a part of the Shuttle's solid rocket booster that, when working correctly, stopped hot gas escaping through joins in the booster's steel skin called field joints. Each booster had three field joints, and each joint had two rubber O-rings, a main and a backup, that circled the booster. When the boosters were tested in 1977, however, the force caused by the pressure inside the booster made the steel parts bend away from each other at the field joints, breaking the O-ring seals and allowing the hot gases to escape. This was called \"joint rotation\", and if the \"blow-by\" of the hot gases against the O-rings was bad enough it could have destroyed the ring and caused the booster to explode. However, it was also found that the rubber O-rings would shift under the forces of lift-off and form a seal anyway, which was called \"extrusion\", so the problem was not seen as serious by NASA. Blow-by of the O-rings had been seen on early Shuttle flights, and a pattern was noticed by the engineers who built the boosters: more blow-by happened in cold temperatures. The company that built the boosters, Thiokol, had been working on a fix but had not told NASA even though the O-rings were \"criticality 1\" parts, meaning that if they should fail to do their job, the rocket would be destroyed. Criticality 1 parts were also not allowed to rely on a backup part for safety - this meant that the backup O-ring in the booster was not good enough to keep the astronauts safe. == Launch == It was unusually cold on the morning of the Space shuttle's launch. The engineers argued that the Challenger should not take off because the temperature was and the O-rings could not seal right if the temperature was under . The NASA commanders did not agree and said that the backup O-ring would work. They were later proved wrong. The temperature was so low that icicles were hanging from some parts of the launch pad. However, the NASA commanders convinced the engineers' managers to overrule them and approve the launch. Challenger lifted off at 11:38 EST exactly. In the first four seconds of flight, grey smoke was seen on the launch pad cameras coming out of the aft (bottom) field joint in the right booster. This was the O-rings being partially destroyed - they had been frozen solid and could not seal, so the blow-by of hot gases burned them away completely before the \"extrusion\" could happen. However, aluminium oxide, formed by the burning rocket fuel, plugged the gap and formed a weak seal. Challenger was safe for now, and quickly cleared the launch tower. == Vehicle breakup == Challenger flew normally for almost a minute. At the 59 second mark, though, the aluminium seal broke. This allowed the burning rocket fuel to escape through the broken part of the O-ring. A visible plume of fire came out of the right SRB, burning both the external fuel tank and the piece of metal keeping the two connected. This plume burned through the bottom of the fuel tank, where the liquid hydrogen fuel was stored. At 68 seconds after liftoff, the engines increased power to produce the highest thrust possible (known as throttling up). The flight controllers informed the shuttle crew that their flight status was \"go\" at the throttle-up stage. The flight commander, Dick Scobee, responded with \"Roger, go at throttle up.\" However, at 72 seconds after liftoff, the fire that had burned through the fuel tank also burned through the connecting metal, leaving the right booster hanging only by the forward (top) attaching point. Challenger suddenly went off its intended path, which may have been felt by the crew. Half a second later, Smith said the last words picked up by the recorder designed to record all interactions in the crew area of the shuttle during flight: \"Uh oh...\". Smith may have been responding to the shuttle's computer telling him that the engines were moving quickly to compensate for the now loose booster in a useless attempt to get the shuttle back on the planned path. The right booster, free to swing about its remaining connection, turned outwards and hit the top of the fuel tank just as the hydrogen tank broke. The burning liquid fuel pushed the hydrogen tank into the now-broken upper oxygen tank, destroying both. The two liquid fuel parts combined and exploded in one go, swallowing Challenger in a huge explosion. The boosters, being made of thick steel, survived this, and though the explosion itself didn't destroy Challenger directly, it pushed the Shuttle into the wrong angle for its flight path through the air, which caused enormous amounts of drag that ripped Challenger apart. thumb | right | The video showing the launch and breakup Little is known of what happened in the minutes after the breakup. The crew cabin was still intact as it started falling, since it was built to be strong. The official report into the disaster says that the crew survived the first breakup and that at least three people were still alive. They were able to move switches which required a cover to be pulled off before they could be moved, probably when they tried to regain control of the craft, as well as activate their air packs. The crew cabin did not have any kind of parachute, and it smashed into the ocean after falling for 2 minutes and 45 seconds at roughly . Any crew that might have survived the first break up died instantly with more than 200 times the force of normal gravity. This is like going from 0 to over and then slowing back down to 0 all within a second. == Investigation == Many people wanted to know why the Challenger exploded. President Ronald Reagan asked for a report about the disaster. It was called the Rogers Commission Report and it was written by a group of astronauts, scientists and engineers. They worked out what had happened and why the Challenger exploded. The report said that the people in charge at NASA did not listen to the engineers who said the O-rings were not safe; and that sometimes the people in charge thought that parts of the shuttle were well made when they were not. They also wrote that NASA sometimes did unsafe things because people would get angry if the shuttle launches were delayed. There were no shuttle flights while the report was written. After the report was written, NASA had to be more careful in many different ways. == Related pages == * Space Shuttle Columbia disaster == References == Category:1986 in the United States Category:1980s in Florida Category:Aviation accidents and incidents in the 1980s Category:Aviation accidents and incidents in the United States Category:Explosions in 1986 Category:Explosions in the United States Challenger disaster",
 "title": "Space Shuttle Challenger disaster"
}