{
 "id": "289665",
 "text": "A magazine is a feeding device for firearms that contains ammunition. For artillery it can be a special warehouse or a special room in a warship. In firearms, a magazine (often incorrectly called a \"clip\") is a container that holds ammunition for a firearm. There are two main types of magazines. An external magazine, also known as a box magazine, is a formed piece of sheet metal or plastic, usually polymer, that contains a spring and a follower. Rounds are inserted via the top, either from directly pushing them in, or sliding them under the feed lips, pushing down on the follower that is attached to the spring. As the box magazine is emptied, the follower and spring maintain pressure on the rounds and force them upwards to be grabbed by the firearms bolt. The other type of magazine, an internal magazine is built into the gun and is not meant to be quickly replaced like an external magazine. Internal magazines are common in bolt action rifles, older semi- automatic rifles, such as the M1 Garand, and tube-fed shotguns. These are usually loaded with individual rounds or via a stripper clip, a small piece of formed sheet metal that holds anywhere from 5-10 rounds via the extraction groove. Box magazines come in many different capacities. The standard being 30 rounds, but some hold as little as 3, and others up to 150. Other external magazine types include drum magazines, which are circular in design with the rounds parallel with each other and fed into a singular point. Pan magazines are also circular, but the rounds all point to the center of the circle and are fed into the firearm as the pan spins upon the gun. Magazines may also be what is know as single, double, or quadruple stacked. Single stack magazines are when the rounds sit directly on top of one another, with no offset. Double stack magazines, quickly becoming the most popular method, are two columns of rounds stacked so that each round is offset left or right of the one above and below it. This method maximizes capacity and size of the magazine. Finally, quadruple stacked magazines, are essentially two double stacked magazines next to each other in one magazine. These often hold 40 rounds or more, but are prone to feeding issues as the rounds often get stuck on each other. Category:Ammunition",
 "title": "Magazine (firearms)"
}