{
 "id": "289850",
 "text": "Ritchie Blackmore (born 14 April 1945) is an English guitarist. He is former member and founder of British hard rock band Deep Purple. == Early life == Blackmore was born in Weston-super-Mare, Somerset. His family moved to Heston, Middlesex when he was two. == Career == In the 1950s, Blackmore played with small bands. In 1968, Blackmore, with keyboardist Jon Lord, singer Rod Evans, bassist Nick Simper and drummer Ian Paice created the band Deep Purple. Deep Purple had a hit song in the United States with \"Hush\". Although they were doing well, Ritchie Blackmore and Deep Purple decided to get a different singer. They replaced Evans with Ian Gillan from the band Episode 6. They also replaced the bass player (Nick Simper) with another Episode 6 member, Roger Glover. The band's album Deep Purple In Rock was released in 1970. In 1972, Deep Purple made the album Machine Head. It included one of their most popular songs, \"Smoke on the Water. In 1972, they recorded the live album Made in Japan. Gillan and Glover left the group in 1973. They were replaced with singer David Coverdale and bassist Glenn Hughes. The new Deep Purple released two albums Burn (1974) and Stormbringer (1974). Blackmore left the band soon after these albums were released. In 1984, Blackmore got back together with Gillan, Glover, Lord and Paice and made the album Perfect Strangers. The album had many successes with the songs \"Knocking at Your Back Door\" and \"Perfect Strangers\". After recording the album The Battle Rages On, Blackmore left the band in 1993. == The Rainbow == In 1975, Blackmore founded the band The Rainbow. The band included Ronnie James Dio as singer, Craig Gruber on bass, Micky Lee Soule on keyboards, and Gary Driscoll on drums. The band's first album, Ritchie Blackmore's Rainbow, was released August 4, 1975. It was followed by Long Live Rock 'n' Roll in 1978, with Cozy Powell in drums. On Difficult to Cure (1981), The band included the vocalist Joe Lynn Turner, replacing Dio. After several changes in its members, Blackmore disbanded the band in 1997. ==Discography== === Deep Purple === ;Studio albums # Shades of Deep Purple (1968) # The Book of Taliesyn (1968) # Deep Purple (1969) # Deep Purple in Rock (1970) # Fireball (1971) # Machine Head (1972) # Who Do We Think We Are (1973) # Burn (1974) # Stormbringer (1974) # Perfect Strangers (1984) # The House of Blue Light (1987) # Slaves and Masters (1990) # The Battle Rages On... (1993) == References == * Legends of rock guitar: the essential reference of rock's greatest guitarists, by Pete Prown,Harvey P. Newquist,Jon F. Eiche * The British Invasion: The Music, the Times, the Era, by Barry Miles ==Other websites== * The Official Ritchie Blackmore and Blackmore's Night website * 1975 Interview with Ritchie Blackmore on Modern Guitars Magazine * Interview with Ritchie Blackmore * Interview with Ritchie Blackmore about acoustic renaissance work * First Ritchie Blackmore Fanclub on the net in English with many infos and a community Category:1945 births Category:Living people Category:British rock musicians Category:English guitarists Category:English songwriters Category:People from Middlesex",
 "title": "Ritchie Blackmore"
}