{
 "id": "289867",
 "text": "LGBT human rights are not respected in the People's Republic of Bangladesh, and there appears to be no organized movement to advance such human rights. And such acts of homosexuality will lead to life in prison, or even face the death penalty. == 1947-1971 Pakistan period == The Constitution of Pakistan of 1956 and Constitution of Pakistan of 1962 continued the British law regarding Homosexuality which is criminalized according to the law. The 1950s saw the introduction of the East Pakistan's (East Bengal / modern-day Bangladesh) film industry. 'Mukh O Mukhosh' (1956) was the first Bengali film made in East Pakistan which represented conservative Heterosexual marriage. From the year 1956 - 1960s, many films followed this pattern. The Bengali Muslim literature sector also started to grow expeditiously during this period. Progressive values in educated Bengali Muslim society was to possess Heteronormative values. In the 1960s decade, there were reports to have some Brothels in Dacca University's adjacent areas e.g. the Shahbag area, where Bacha bazi (sexual play on young adolescent males) was observed but publicly adult Homosexuality was not seen; Homosexuality remained a taboo throughout 1947 to 1960s decade and to 1971 emancipation in which year Bangladesh unilaterally seceded from parent-state Unionship with Pakistan severed politically. ==Constitutional & Criminal Code== The Constitution has several provisions that could apply to LGBT citizens; * Part II Article 19 – Promises equal opportunity for all citizens. * Part III Article 27- Promises equality before the law for all citizens. * Freedom of religion and the press are both promised, but subject to restrictions based on \"decency or morality\". * A citizen is not eligible to be a member of Parliament if they are convicted of a \"criminal offence involving moral turpitude.\" According to Section 377 A of the British Indian penal code of BPC, adult homosexual sex acts are illegal and will be punished with deportation, fines and/or up to 10 years, sometimes life imprisonment. This legal prohibition extends to any sort of LGBT-human rights organization. BPC Section – 377A. Whoever voluntarily has carnal intercourse against the order of nature with any man, woman or animal, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine. Explanation : ” Penetration is sufficient to constitute the carnal intercourse necessary to the offence described in this section. ==Social status== Hijras are discriminated against a lot. Many hijras do sex work because people will not give them jobs. Since On the 11th of November in 2013, hijras in Bangladesh have been allowed to choose 'hijra' as a gender on their passports. Before this they had to choose 'male' or 'female'. Hijras have their own language called Hijra Farsi. It is also known as Koti. In 2000, Shabnam Mausi was the first hijra to be elected to Indian parliament. ==Public opinion== According to a 2017 poll carried out by ILGA, a plurality of 47% of Bangladeshis agreed that gay, lesbian and bisexual people should enjoy the same rights as straight people, while 38% disagreed. Additionally, 50% agreed that they should be protected from workplace discrimination. 49% of Bangladeshis, however, said that people who are in same-sex relationships should be charged as criminals, while 38% disagreed. As for transgender people, 44% agreed that they should have the same rights, 50% believed they should be protected from employment discrimination and 40% believed they should be allowed to change their legal gender.ILGA-RIWI Global Attitudes Survey ILGA, October 2017 Additionally, according to that same poll, a third of Bangladeshis would try to \"change\" a neighbour's sexual orientation if they discovered he/she was gay. ==Summary table== Same-sex sexual activity legal Equal age of consent Anti- discrimination laws in employment only Anti-discrimination laws in the provision of goods and services Anti-discrimination laws in all other areas (incl. indirect discrimination, hate speech) Same-sex marriages Recognition of same-sex couples Step-child adoption by same-sex couples Joint adoption by same-sex couples Gays and lesbians allowed to serve openly in the military Recognition of a Third gender (Since 2013) Right to change legal gender (Since 2015) Access to IVF for lesbians Commercial surrogacy for gay male couples ===Related=== * Boys of Bangladesh ==References== Category:Politics of Bangladesh Bangladesh",
 "title": "LGBT rights in Bangladesh"
}