{
 "id": "289928",
 "text": "In simple terms, catastrophism is a theory in geology that says the Earth's shape has been largely shaped by sudden and violent events. These events might have affected the whole world at once. This idea is different from uniformitarianism or gradualism, which says that slow, small changes like erosion shaped everything on Earth. Uniformitarians think that what happens today is how things happened in the past. Scientists now think both big disasters and slow changes played roles in shaping our planet's history. They believe big disasters, like huge floods or mountains forming quickly, sometimes caused lots of plants and animals to die out, making room for new life to grow fast. People who believed in catastrophism thought that each period of time in Earth's history ended with huge natural disasters, like big floods or mountains forming very quickly. These disasters would make old plants and animals die out fast, and new ones would appear suddenly. Some people even thought one of these disasters was the same flood described in the Bible's story about Noah. A French scientist named Georges Cuvier talked a lot about catastrophism in the early 1800s. He thought that many of Earth's big changes happened because of disasters like floods. But he didn't mix these ideas with religion or other beliefs in his science writing. ==History== ===Geology and biblical stories=== In the past, people in mostly Christian countries tried to connect what the Bible said about the world's beginning with new ideas about how Earth formed. They also found deluge myths in other old books, like some from Classical Greece. These stories helped people think about how huge floods could have shaped Earth. ===Cuvier and other scientists=== One of the main scientists who believed in catastrophism in the early 1800s was Georges Cuvier. He studied old bones and rocks to understand why some animals died out and new ones came. Cuvier thought that Earth went through big disasters, like floods, and each time these disasters happened, lots of plants and animals would die out fast. He thought this explained why we find different kinds of fossils in different layers of rock. Cuvier didn't think these disasters were caused by God or magic. He thought they were part of how Earth naturally changes over time. Cuvier also believed that the Earth was very old, not just a few thousand years, because of what he saw in the rocks. In Britain, where many people believed in natural theology during the 1800s, scientists like William Buckland also talked about catastrophism. Buckland thought the big flood in the Bible was a real event, and he tried to find proof for it in the rocks and fossils he studied. But later on, he changed his mind and believed more in the idea that slow changes over millions of years shaped Earth, like volcanoes and erosion. This new idea was called uniformitarianism, and it said Earth's changes happen slowly over a very long time. ===Uniformitarianism in geology=== Uniformitarianism says that Earth's shape was made by slow changes like volcanoes and rivers, and these are still happening today. This idea became very popular in geology from the 1850s to the 1980s. It said that big disasters like huge floods or volcanoes didn't play a big part in shaping Earth. Instead, it was small, slow changes over millions of years that made the world look the way it does today. Today, most scientists think both big disasters and slow changes helped shape Earth's history. They say huge disasters like big floods or asteroid hits sometimes happened and wiped out lots of plants and animals. But they also think slow changes over millions of years, like rivers and volcanoes, played a big part in how Earth looks today. ===Modern ideas=== Today, scientists still think big disasters like huge asteroid hits or supervolcanos can change Earth very fast. They think these disasters sometimes caused big events like the K/T extinction event. These ideas are still being studied and debated to understand more about how Earth has changed over billions of years. ==References== ==Sources== * * * ==Further reading== * Lewin, R.; Complexity, Dent, London, 1993, p. 75 * Palmer, T.; Catastrophism, Neocatastrophism and Evolution. Society for Interdisciplinary Studies in association with Nottingham Trent University, 1994, (SIS) (Nottingham Trent University) ==Other websites== *Impact Tectonics *Catastrophism and Mass Extinctions *The Fall and Rise of Catastrophism *Catastrophism! Man, Myth and Mayhem in Ancient History and the Sciences *Answers In Creation - Catastrophism Article *Dictionary of the History of Ideas: \"Uniformitarianism and Catastrophism\" Category:History of science Category:Geology Category:Philosophy of science",
 "title": "Catastrophism"
}