{
 "id": "290179",
 "text": "Philosophy of religion is a branch of philosophy. Religions, and religious beliefs can manifest themselves in different ways. Philosophy of religion looks into explaining certain answers to questions of religion using understanding. It is also looks into different ways religions are practiced and their importance for the everyday lives of the people practicing them. Other domains of it include criticism and analysis of religious texts using philosophy of language. According to Winfried Löffler, philiosphers of religion can be grouped as follows. Many of the philosophers mentioned belong to more than one group: # Analysis of religious feelings: The analysis focuses on looking at the typical feelings a religion evokes. Philiosphers include Friedrich Schleiermacher and Ludwig Wittgenstein. # Question about the essence of religion. Philiosphers include Rudolf Otto,Georg Wilhelm Friedrich Hegel and Martin Heidegger. # Analysis of the language a religion uses # Relationship of a religious an non-religious explanation for a phenomenon. Philiosphers include Richard Swinburne and Ludwig Wittgenstein. # Rationality or irrationality of religion: Is there / Can there be a rational explaation for religious phenomena. Examples of these are \"proofs\" for or against the existence of God, and Theodicy. Gottfried Wilhelm Leibniz was the first to talk about theodicy. Philosophy of religion also looks at more practical matters like defining the features that make up a religion. There are two main schools of thought. The one called Essentialist says that all religions have a common\"essence\". The following have been proposed: # They relate to one or more gods. # There is a belief in spiritual superhuman beings # There is something holy or sacred, which in someway is also accessible by humans. The problem with this is that using only these definitions leas to a common \"philiosphy of religion\" that is harly usable for studies. The other approach (called \"functional\") tries to counter this: Rather than trying to get an \"abstract idea\" of religion, it looks at the use or function religion has in the live of people or societies. Among the things mentioned are that religions help keep a psychological equilibrium and that they provide a certain amount of stability to a society. Thinkers with this opion include Karl Marx, Émile Durkheim, Bronisław Malinowski and Talcott Parsons. Critics of these theories say that such explanations often go against common sense, as religions can also have the popposite effect to that mentioned. Other topics include arguments for the existence of God, the problem of evil, divine attributes and the relationship between science and religion. Important philosophers of religion include Thomas Aquinas, Augustine and Alvin Plantinga. Philosophers of religion can be religious or non-religious == Related pages == * Hindu philosophy * Islamic philosophy * Religious studies Category:Branches of philosophy Category:Religion",
 "title": "Philosophy of religion"
}