{
 "id": "290228",
 "text": "In mosaic evolution some characters in a transitional form are basal, while others are remarkably advanced. Apparently, evolutionary change takes place rapidly in some body parts or systems without simultaneous changes in other parts.King R.C. Stansfield W.D. & Mulligan P.K. 2006. A dictionary of genetics. 7th ed, Oxford University Press. p286 Another definition is the \"evolution of characters at various rates both within and between species\".Carroll R.L. 1997. Patterns and processes of vertebrate evolution. Cambridge University Press. 408 Its place in evolutionary theory comes under long-term trends or macroevolution. Evolution from a basal (early) form to a derived (later) form takes place in stages. Modules (groups of characters) change semi-independently of each other. They change at different times, so producing a mosaic of primitive and derived traits. These changes play a leading role in major evolutionary transitions. It may involve speciations producing a series of species, only a few of which would be found as fossils. By its very nature, the evidence for this idea comes mainly from palaeontology. It is not claimed that this pattern is universal, but it is common. There are now a wide range of examples from many different taxa. == Examples == * Human evolution. The early evolution of bipedalism in Australopithecines, and its modification of the pelvic girdle took place long before there was any significant change in the skull, or brain size.Stanley S.M. 1979. Macroevolution: pattern and process. Freeman, San Francisco. p154 Jurmain, Robert. et al. 2008. Introduction to Physical Anthropology. Thompson Wadsworth. p479 * Evolution of the brain. The different parts of the mammalian brain evolved at different rates.Barton R.A. & Harvey P.H. 2000. Mosaic evolution of brain structure in mammals. Nature 405: 1055-1058.Gómez-Robles, Aida; Hopkins, William D.; Sherwood, Chet C. 2014. Modular structure facilitates mosaic evolution of the brain in chimpanzees and humans. Nature Communications 5 (1): 4469. Bibcode:2014NatCo...5.4469G. doi:10.1038/ncomms5469. ISSN 2041-1723. PMC 4144426. PMID 25047085 * Archaeopteryx. Nearly 150 years ago Thomas Henry Huxley compared Archaeopteryx with a small theropod dinosaur, Compsognathus. These two fossils came from the Solnhofen limestone in Bavaria. He showed that the two were very similar, except for the front limbs and feathers of Archaeopteryx. Huxley's interest was in the basic affinity of birds and reptiles, which he united as the Sauropsida.Foster, Michael and Lankester, E. Ray (eds )1898–1903. The scientific memoirs of Thomas Henry Huxley. 4 vols and supplement, Macmillan, London The interest here is that the rest of the skeleton had not changed. * Meadow voles during the last 500,000 years.Barnovsky A.D. 1993. Mosaic evolution at population level in Microtus pennsylvanicus. In Morphological changes in Quaternary mammals of North America. ed R.A. Martin & A.D. Barnovsky. Cambridge University Press. pp24–59 * The pterosaur Darwinopterus. The type species, D. modularis was the first known pterosaur to display features of both long-tailed (rhamphorhynchoid) and short-tailed (pterodactyloid) pterosaurs.Lü J., Unwin D.M. et al 2010. Evidence for modular evolution in a long-tailed pterosaur with a pterodactyloid skull. Proceedings of the Royal Society B, 277(1680): 383-389. * Evolution of the horse. The major changes took place at different times, not all simultaneously.Maynard Smith, John 1993. The theory of evolution. Cambridge University Press. 3rd ed + new Introduction. pp285–290 * Mammalian evolution during the Mesozoic is another good example.Kemp T.S. 2005. The origin and evolution of mammals. Oxford University Press, Oxford. Kielan-Jaworowska, Zofia; Richard L. Cifelli and Zhe-Xi Luo 2004. Mammals from the Age of Dinosaurs: origins, evolution, and structure, Columbia University Press, New York. === A famous case re-examined === Huxley had pointed out that Archaeopteryx was a mixture of reptile and bird features. Without the feathers and arms, its skeleton looked just like that of Compsognathus. We now know its bone growth physiology was much slower than modern birds, and more like that of its dinosaur ancestors. This means it would take longer after hatching before it could fly. A modern precocial bird takes for 3–6 weeks from hatching to flying. In Archaeopteryx this milestone might have taken about 18 weeks. It might have taken two to three years to reach its final adult size.Ericson G.M. et al 2009. Was dinosaurian physiology inherited by birds? Reconciling slow growth in Archaeopteryx? PLoS One DOI: 10.1371 The evolution of the physiology of modern forms occurred later in the group's history. They have had over 140 million years to evolve since Archaeopteryx. == Background == It has long been known that changes in the genes which control development cause changes in the final adult animal.de Beer, Gavin 1930. Embryos and evolution. Oxford University press; 2nd ed Embryos and ancestors 1940; 3rd ed 1958.Brigandt I. 2006. Homology and heterochrony: the evolutionary embryologist Gavin Rylands de Beer (1899-1972). Journal of Experimental Zoology (Molecular and Developmental Evolution) 306B:317-328. preprintGould S.J. 1977. Ontogeny and phylogeny. Harvard University Press. Recent work shows how master control systems in development ('homeoboxes') can organise selective changes in different parts of an organism.Lewis E.B. 1992. Clusters of master control genes regulate the development of higher organisms. J. Am. Medical Assoc. 267, 1524–1531.Gehring W. 1999. Master control systems in development and evolution: the homeobox story. Yale University Press. This is what underlies mosaic evolution. == Related pages == * Gene regulation * Heterochrony * Neoteny * Evo-devo * Parallel evolution * Convergent evolution * Macroevolution * Transitional fossil == References == Category:Evolutionary biology",
 "title": "Mosaic evolution"
}