{
 "id": "290319",
 "text": "The Red Bull Arena is a football stadium in Salzburg, Wals-Siezenheim. It is the home ground of F.C. Red Bull Salzburg and FC Liefering. During the Euro 2008 football championship it was one of four venues in Austria. It has a capacity of 30,188. ==History== The arena was built in 2003 and opened on March 8th, 2003 with a match between SV Austria Salzburg vs. FC Kärnten. The score was 1-1. It replaced the Stadion Lehen. The building is not in the city of Salzburg but in the neighbouring borough of Wals-Siezenheim. For international matches the ground is called \"EM Stadion Wals-Siezenheim\". The architects were Schuster Architekten (Düsseldorf) and Atelier Albert Wimmer (Wien). In 2005 two video boards were erected. At this time the capacity was around 18,000 but was expanded to over 30,000 in 2006 because the ground was used for the Euro 2008. A second balcony was built. The new stadium was presented with a match against Arsenal F.C., in which Red Bull Salzburg won 1-0. After the Euro it was decided, despite of neighbour protests, that this balcony should stay for further use by Red Bull Salzburg. The stadium was the only one in Austria with an artificial turf, but since 2010 the arena has switched to natural grass. FC Red Bull Salzburg play their games here, which was rented from another owner. Therefore, the stadium is indirectly owned by the state of Salzburg. ==Notable matches== ===Matches during the Euro 2008=== Date Match Result 10 Juny 2008 Greece vs. Sweden 0:2 14 Juny2008 Greece vs. Russia 0:1 18 Juny 2008 Greece vs. Spain 1:2 File:Euro 2008 Greece- Spain.jpg|Greece vs.Spain File:Euro 2008 greece vs sweden 7.jpg|Greece vs. Sweden ===Friendlys=== Date Match Result 18 January 2014 RB Salzburg vs. FC Bayern München 3:0 28 July 2021 RB Salzburg vs. Atletico Madrid 1:0 4 August 2021 RB Salzburg vs. CF Barcelona 2:1 27 July 2022 RB Salzburg vs. Liverpool FC 1:0 ===International matches=== Date Match Result 2011 FC Salzburg gegen Paris SG 2:0 17\\. August 2021 RB Salzburg vs. Brøndby IF 2:1 8\\. Dezember 2021 RB Salzburg vs. FC Sevilla 1:0 ===League matches=== Date Match Result 23 March 2008 RB Salzburg vs. SK Rapid Wien 0:7 29 September 2013 RB Salzburg vs. SC Wiener Neustadt 8:1 10 August 2014 RB Salzburg vs. SV Grödig 8:0 ==Gallery== File:EM-Stadion Wals-Siezenheim zur Euro.jpg|EM-Stadion Wals-Siezenheim (Photo:Arne Müseler) File:Panorama Stadion.jpg|Stadium in 2010 with the new natural lawn File:RBA-Nord.jpg|Inside the arena North stand File:EM Stadion Wals-Siezenheim Osttribüne.jpg|East stand File:Red Bull Arena(Salzburg).jpg|South stand-standing room in the middle File:Salzburg gegen Innsbruck Panorama.jpg|League match-west and north stand File:Em stadion salzburg 1.jpg|during adaption work 2007 File:Freundschaftsspiel vs.Bayern München.JPG|friendly match versus Bayern München ==Other websites== * ==References== Category:Football stadiums in Austria Category:Salzburg Category:Football stadiums in Salzburg (state) Category:2003 establishments in Europe Category:2000s establishments in Austria",
 "title": "Red Bull Arena (Salzburg)"
}