{
 "id": "290312",
 "text": "Robert Elwood Bly (December 23, 1926 - November 21, 2021) was an American poet, author, activist and leader of the Mythopoetic Men's Movement. He was born in Lac qui Parle County, Minnesota. ==Career== Bly's early collection of poems, Silence in the Snowy Fields, was published in 1962, and its plain style had considerable influence on American poems of the next two decades.Gioia, Mason, Schoerke (editors) Twentieth-Century American Poetics, p 260 The following year, he published \"A Wrong Turning in American Poetry\", an essay. In 1966, Bly co-founded American Writers Against the Vietnam War. In 1968, he signed the “Writers and Editors War Tax Protest” pledge, vowing to refuse tax payments in protest against the war.“Writers and Editors War Tax Protest” January 30, 1968 New York Post When he won the National Book Award for The Light Around the Body, he contributed the prize money to the Resistance. During the 1970s, he published eleven books of poetry, essays, and translations. During the 1980s he published Loving a Woman in Two Worlds, The Wingéd Life: Selected Poems and Prose of Thoreau, The Man in the Black Coat Turns, and A Little Book on the Human Shadow. Among his most famous works is Iron John: A Book About Men, an international bestseller which has been translated into many languages. Bly died at his home in Minneapolis, Minnesota on November 21, 2021, at the age of 94. == Related pages == *List of poets from the United States == References == == Other websites == * The Robert Bly Web Site * Profile and poems of Bly at PoetryFoundation.org * * \"Robert Bly reads 'Loon's Cry' \" for the WGBH series, New Television Workshop * Bly profile, The Academy of American Poets * MenWeb - Men's Issues Interview with Robert Bly * Modern American Poetry critical essays on Bly's works. University of Illinois * The Human Shadow and other essays, articles and interviews by Robert Bly. Audio. Category:American poets Category:1926 births Category:2021 deaths Category:American activists Category:writers from Minnesota",
 "title": "Robert Bly"
}