{
 "id": "290484",
 "text": "LGBT people in Pakistan have a history that goes back a long time, with different views on gender and sexuality. Transgenders (Khwaja Sira) have been a big part of Pakistani culture. Before British rule, South Asian societies had different ways of understanding gender and same-sex relationships. Today, the law against same-sex acts in Pakistan comes from British colonial times. It is part of Section 377 of the Indian Penal Code, which started in 1860. In modern Pakistan, LGBT people face many problems. They can be punished by law, face discrimination, and experience mistreatment. The Supreme Court of Pakistan recognizes a third gender for intersex people, which it says is allowed under Islamic law. The Pakistani Penal Code of 1860, made during British rule, makes sodomy illegal. This can lead to jail sentences from two years to life and fines. Even though homosexual acts are rarely taken to court in Pakistan, the law is sometimes used to threaten and harass LGBT Pakistanis. Other rules about morality and public order are also used against them. A big problem is violence and killings by terrorist groups. The police can arrest LGBT people even if the law says otherwise. LGBT people in Pakistan often face discrimination and social unacceptance. This can make it hard for them to have stable relationships. Despite these challenges, LGBT people can still meet, organize, date, and sometimes live together, usually in secret. In Pakistan, same-sex marriages and civil unions are rarely discussed in politics. People who marry someone of the same sex might be arrested and taken to court. In 2009, the Supreme Court of Pakistan made a historic decision to support transgender citizens' rights. Later, the court gave more rights to transgender people. In 2018, the Transgender Persons (Protection of Rights) Act was passed, giving many protections to transgender people. However, in 2020, a petition was made to challenge the Act. Some people argued that the Act could allow homosexuality by separating gender from biological sex. On May 19, 2023, the court agreed with the petitioners, saying that some parts of the Act about gender do not follow Islamic principles. Transgender groups plan to appeal this decision. Until a final ruling is made, the law remains the same. The court also said that a third gender for intersex people is allowed under Islamic law. == History == Even with strict laws during British rule, Pakistan was once more open about homosexuality than places like London. This changed in the 1980s under General Muhammad Zia-ul-Haq. His government made laws against homosexuality much harsher, including life imprisonment and, in some areas, the death penalty under Sharia law. More Wahhabi-style madrasas, influenced by the Middle East, appeared during this time. In 2005, the BBC said that gay life in Pakistan was still \"less restricted than in the West\". This is because the culture is much stronger than the laws. Pakistani-American scholar Taymiya R. Zaman said to the National Public Radio that same-sex relationships have long been part of Pakistani culture, and ignoring this history is misleading. In 2012, Hina Jilani from the Human Rights Commission of Pakistan called for better protection against violence based on sexual orientation and gender identity, criticizing the use of culture and religion to avoid taking action. === Homosexuality in Ancient Times === Homosexuality has a long history in Pakistan that goes back to ancient times. Homophobia likely appeared earlier here than in other parts of Asia. Old texts from Zoroastrianism, Buddhism, and Islam suggest that same-sex relations were often forbidden as early as 250 BCE. For example, the Zoroastrian text Vendidad from the Parthian Empire condemned same-sex acts and allowed for severe punishment. It contains provisions that are part of sexual code promoting procreative sexuality that is interpreted to prohibit same-sex intercourse as sinful. Ancient commentary on this passage shows that those engaging in sodomy could be killed without permission from a high priest. Pakistan in ancient times was part of both the Achaemenid and Parthian empires. The first reference to homosexuality can be found during the era of the Achaemenid empire from the 6th century BCE onwards. In 521 BCE, the Achaemenid Empire crucifies Polycrates and suppresses pederasty in Samos, which causes pederastic poets Ibycus and Anacreon to flee Samos.During the Mughal period in Pakistan, Khwaja Sira (Transgenders) were highly respected and many help important positions in the royal court. However, under Emperor Aurangzeb, laws against homosexuality became stricter, with severe punishments for homosexual acts, such as lashes or death by stoning. A number of the already existing Delhi Sultanate laws were combined into the Fatawa-e-Alamgiri, mandating several types of punishments. These could include 50 lashes for a slave, 100 for a free infidel, or death by stoning for a Muslim. ===Pre-Independence and Colonial era (1857-1947)=== In precolonial Pakistan, Khwaja sira (transgenders) were very respected, especially during the Mughal period. They worked in royal courts and harems as advisors and performers.Alamgir A (2022) Decolonization of gender and sexuality: Exploring the stories of discrimination, marginalisation, resistance, and resilience in the communities of khawaja sara and hijra in Pakistan. In LGBT+ Communities-Creating Spaces of Identity. IntechOpen. 10.5772/intechopen.108684Sher A, Mashkoor I and Awan N (2022) Lingual abuse faced by transgenders in Hazara Division: A critical discourse analysis. SHAJAR 4(1), 80–88. One famous Khwaja sira was Malik Kafur, who became the Grand Wazir (the head of government) and later the leader of the army under Sultan Alaud-din Khilji in the 14th century.Junejo T (1994) Eunuchs: the cultural heritage of Sindh. Sindh University Arts Research Journal 29, 32–46. 10.26692/surj.v53Gugler TK (2011) Politics of pleasure: Setting South Asia straight. South Asia Chronicle 1, 355–392. Another, Mahboob Ali Khan, served as the Controller General of Revenues (Mukhtar-i-Kul) under the last Mughal Emperor, Bahadur Shah Zafar. When the British took control of the region, the situation changed for Khwaja sira. The British did not like their public performances and saw them as a problem. In 1871, the Criminal Tribes Act made it illegal for them to sing, dance, or \"cross-dress\" in public. They were also wrongly accused of crimes like kidnapping and castrating children.Hinchy J (2017) Obscenity, moral contagion and masculinity: Hijras in public space in colonial North India. In Contestations over Gender in Asia. New York: Routledge, pp. 111–132. 10.1080/10357823.2014.901298 The British often called them \"eunuchs,\" even though many khwaja sira were not castrated and some even had children. After Pakistan became independent, the Criminal Tribes Act was canceled in 1952.Reddy, G. (2005). Geographies of contagion: Hijras, Kothis, and the politics of sexual marginality in Hyderabad. Anthropology & Medicine, 12(3), 255–270. 10.1080/13648470500291410 But another law, Section 377 from the Indian Penal Code of 1860, still exists. This law makes acts like sodomy and homosexuality illegal, and it continues to affect the LGBT community in Pakistan.Bhaskaran S (2002) The politics of penetration: Section 377 of the Indian penal code. In Vanita R (ed.), Queering India: Same-Sex Love and Eroticism in Indian Culture and Society. New York: Routledge, pp. 15–29. 10.4324/9780203951217Hinchy J (2013) Troubling bodies: ‘Eunuchs,’ masculinity and impotence in colonial North India. South Asian History and Culture 4(2), 196–212. 10.4324/9781315093710-3 The Colonial British government made Lesbian, gay, bisexual, and transgender (LGBT) activities illegal in the subcontinent under section 377. Khwaja sira before the Transgender Persons (Protection of Rights) Act, 2018 had fewer opportunities for education and work.Khan S (2017) Khwaja sira, hijra, and the struggle for rights in Pakistan. Modern Asian Studies 51(5), 1283–1310. 10.1017/s0026749x16000068 One way they earn money is through badhai, where they give blessings at weddings and other important events in exchange for donations.Pamment C (2010) Hijraism: Jostling for a third space in Pakistani politics. TDR/The Drama Review 54(2), 29–50. 10.1162/dram.2010.54.2.29 Many people believe khwaja sira can bring happiness and fertility because they are seen as spiritual beings who have the ability to bless and curse others.Khan S (2016) What’s in a name? Khwaja sira, hijra, & eunuchs in Pakistan. Indian Journal of Gender Studies 23(2), 218–242. 10.1177/0971521516635327Hamzić V (2019) The Dera paradigm: Homecoming of the gendered other. Ethnoscripts 21(1), 34–57. 10.1525/9780520948129-003 Some also work as dancers or beggars, and some engage in sex work to survive.Hambly G (1974) A note on the trade in eunuchs in Mughul Bengal. Journal of the American Oriental Society 94(1), 125–130. 10.2307/599739Shroff, Sara (2020). \"Operationalizing the \"New\" Pakistani Trans Gender Citizen\". In Roy, Ahonaa (ed.). Gender, Sexuality, Decolonization: South Asia in the World Perspective. Taylor & Francis. . == Legality of same-sex sexual activity == The Constitution of Pakistan does not talk about sexual orientation or gender identity. Some parts of the Constitution may affect the rights of LGBT Pakistani citizens, but the law against homosexuality is not always enforced. Pakistan’s legal system follows both British and Islamic rules. The law that makes same-sex relations illegal was created during British colonial times. This law, made on October 6, 1860, and started on January 1, 1862, was written by Lord Macaulay. It was part of the Indian Penal Code 1860, which made male same-sex acts illegal under a British rule called \"Unnatural Offences.\" After Pakistan became independent in 1947, the Parliament kept this law but renamed it the Pakistan Penal Code (Act XLV of 1860). Article 377 of this code says: Under Muhammad Zia-ul-Haq, the Hudud Ordinances were introduced in 1979. These laws set harsh punishments for adultery, fornication, drinking alcohol, and sodomy. Punishments included up to 100 lashes or death by stoning for married people who committed adultery. But according to a 2021 U.S. report on human rights in Pakistan, the Hudood Ordinances have not been enforced since martial law ended in 1985. There are no known cases of these laws being used against same-sex acts, and no known executions for homosexual activity. In 2018, Pakistan’s Parliament passed the Transgender Persons (Protection of Rights) Act, giving important rights to transgender people. This followed a 2009 Supreme Court ruling that supported civil rights for transgender citizens. Since then, other court rulings have strengthened these rights. But Pakistan does not have laws to stop discrimination or harassment based on sexual orientation. Same-sex marriages or civil unions are not allowed. Still, more people, especially those with educated parents who understand topics like evolution and sexuality, are beginning to share their same-sex relationships with friends. === Pakistan Penal Code === Here are some related parts of the Pakistani Penal Code of 1860: * Article 141 – If five or more people gather to commit a crime, it is called an \"unlawful assembly.\" * Article 153 – If someone tries to make students or schools join activities that disrupt public order, they can go to prison for up to two years, pay a fine, or both. * Article 268 – If someone causes harm or annoyance to the public or nearby residents, it is a public nuisance. * Article 269 – If someone acts carelessly and spreads a dangerous disease, they can go to prison for up to six months, pay a fine, or both. * Article 270 – If someone intentionally spreads a dangerous disease, they can go to prison for up to two years, pay a fine, or both. * Article 290 – Other public nuisances not covered by the code can be fined up to 600 rupees. * Article 292 – It is illegal to sell, distribute, show, own, or import \"obscene\" books, pamphlets, or images. * Article 294 – Public acts, songs, music, or poems that are \"obscene\" are also illegal. * Article 371A – Selling or using a person for prostitution or illegal activities can lead to up to 25 years in prison and a fine. * Article 371B – If a female is sold or rented to a brothel, the person doing this is assumed to want her to be used for prostitution. \"Illicit intercourse\" means sexual activity between people who are not married to each other. * Article 377 – Anyone who has sex against the order of nature with a man, woman, or animal can go to prison for life or between two to ten years, and pay a fine. Even slight penetration counts as an offense. * Article 496 – Going through a marriage ceremony knowing it is not lawful can lead to up to seven years in prison and a fine. == Discrimination protections == Pakistan does not have civil rights laws that protect people from discrimination based on sexual orientation. But since 2018, it is illegal to discriminate against transgender people in many areas. These areas include jobs, education, health care, services, housing, and public office. The International Commission of Jurists says that Chapter Three of the Transgender Persons (Protection of Rights) Act () stops discrimination against transgender people. The act says that no one should treat transgender people unfairly in any of these areas. The Green Party of Pakistan has shown some support for LGBT rights, but most political parties either ignore LGBT rights or oppose them. Sociologists Stephen O. Murray and Badruddin Khan say that even though laws against LGBT people are not often used directly, the police and others sometimes use them to blackmail people. In March 2012, Hina Jilani, then Chair of the Human Rights Commission of Pakistan, spoke at the Human Rights Council. She said that one of the biggest problems is the refusal to protect people from violence because of their sexual orientation or gender identity. She also said that governments should not use culture or religion as reasons not to protect people. All governments have a duty to protect the human rights of everyone. ==Transsexualism and Intersexuality== In Pakistan, there has been a concept of a third gender historically. Members of this group are often called hijras (), though this term can be seen as disrespectful. Instead, the term khawaja sara () is preferred. In English, they might be called transgender, intersex, or eunuchs. Like transgender people elsewhere, khawaja saras sometimes face ridicule, abuse, and violence. However, they also have a certain level of acceptance because of their historical role in precolonial Pakistani society. Hijra communities live a very secretive life. Because of this, many people see the hijras as mysterious. In 2004, it was reported that Lahore alone has 10,000 active transvestites. Khawaja saras are often invited to events like weddings, where they dance for entertainment. They are also included in ceremonies like births and circumcisions. In Sindhi, they are called khadra (کدڙا). Many khawaja saras are seen as cultural descendants of the Mughal court eunuchs. They are thought to have been born with genital dysphoria and people are afraid that they might curse one their fate, people listen to their needs, give them alms and treat them with respect due to their perceived blessings. In recent years, attitudes have started to change. Sex reassignment surgery has become more accepted for those experiencing gender dysphoria. For example, in 2008, a Lahore High Court ruling allowed a woman named Naureen to have a sex change operation. This decision was specifically for those suffering from gender dysphoria. In 2009, the Pakistani Supreme Court ruled that transvestites were entitled to government support programs like the Benazir Income Support Programme (BISP). The Chief Justice at that time, Iftikhar Chaudhry, played a key role in extending rights to the transgender community.In 2010, the Supreme Court ordered full recognition of the transgender community. This included free medical and educational services, micro credit schemes, and job quotas in government jobs. However, they did not mandate protections against discrimination in public services or housing. In 2017, the Lahore High Court required the government to include transgender people in the national census. In February 2018, a Senate committee decided that transgender people could inherit property without needing a medical board to decide their gender. In May 2019, Shireen Mazari, the Federal Minister for Human Rights, appointed Ayesha Moghul, a transgender woman, to her department for the first time. On the 18th of June in 2016 a small clerical body in Lahore know as Tanzeem Ittehad-I-Ummat declared Transgender marriages legal under Islamic law. These clerics are affiliated to the Pakistan-based organisation issued a Fatwa on Pakistani transgender people where a trans woman (born male) with \"visible signs of being a woman\" is allowed to marry a man, and a trans man (born female) with \"visible signs of being a man\" is allowed to marry a woman. Pakistani transsexuals can also change their gender. Muslim ritual funerals also apply. Depriving transgender people of their inheritance, humiliating, insulting or teasing them were also declared Haraam. Although there are no Fatāwās by a Mufti for it or against the (\"Zenanas\") or Eunuchs and Hermaphrodites within the country, that remains a debatable issue for the existing various sexual minority diverse communities. Even though the Pakistani Government recognises a third gender on ID cards, many people from the LGBT community do not apply for it as they will not be allowed to enter the holy city of Mecca in Saudi Arabia as a transgender person. == Restoring the Dignity of Transgenders == In 2009, the Supreme Court of Pakistan ordered that the NADRA issue National Identity Cards to members of the transgender community showing their distinct gender.\"It's the first time in the 62-year history of Pakistan that such steps are being taken for our welfare\", Almas Bobby, a Khawaja Sara association's president, said to Reuters, \"It's a major step towards giving us respect and identity in society. We are slowly getting respect in society. Now people recognise that we are also human beings.\" The Supreme Court of Pakistan officially recognised a third gender category for Pakistani passports in December 2018. Pakistan now allows transgender, intersex, and hijra individuals to obtain documents that match their gender identity, whether male, female, or third gender. In 2009, the Pakistan Supreme Court, delivered a ruling, recognising the dignity of transgenders and declaring them the third gender under the equal protection clause of the Pakistani Constitution. Article 25 states that “There Shall be no discrimination on the basis of sex.” The Supreme Court noted that transgender persons had been neglected “On account of gender disorder in their bodies.” They had been denied the inheritance rights as they were neither sons nor daughters who inherit under Islamic law. To remedy discrimination against transgenders, the Court ordered provincial and federal governments to protect transgenders’ gender identification, right to inherit property, right to vote, right to education, and right to employment. This shall include the recognition of trans identity in legal documents such as passports, ID cards, and driver licenses, and prohibiting discrimination in employment, schools, work-place, public transit, healthcare… etc, as well as the right for inheritance in accordance to their chosen gender. Furthermore, the law tells the government to build protection centres and safe houses for the transgender community. On the 23rd of September in 2012, the Supreme Court of Pakistan acted in a very bold manner and declared that transgenders have equal rights in Pakistan. They granted for the first time, three basic rights to transsexuals: * the right to be recognised as a 'Third sex or gender' * the right to vote as Pakistani citizens as transsexuals and * the fixation of job quotas in the public/government sector, for transsexual people. The 'Third gender' was officially protected from discrimination by the Supreme Court of Pakistan in 2010. On the 9th of January in 2017, the Lahore High Court ordered the Government to include transgender people in the national census. On the 29th of December in 2018, Pakistan's first trans pride parade was held in Lahore to celebrate the landmark Transgender rights law passed earlier during that year. In 2018, Nisha Rao attained her law degree from Karachi's Sindh Muslim Law College and became Pakistan's first transgender lawyer.In early 2019 The word \"Transgender\" translated as for the first time in the Urdu language by the Lahore-Pakistan based Organization HOPE - Have Only Positive Expectations. Earlier than this there was no translation which covered the whole Transgender spectrum. == Public opinion == Public opinion about LGBT rights in Pakistan is mixed. In June 2013, the Pew Research Center found that Pakistan was one of the least accepting countries out of 39 studied. About 87 percent of the people surveyed said, \"Homosexuality should not be accepted by society.\" A poll in 2017 by International Lesbian, Gay, Bisexual, Trans and Intersex Association (ILGA) showed that 45 percent of Pakistanis thought gay, lesbian, and bisexual people should have the same rights as straight people. However, 36 percent disagreed, and the rest were undecided. Also, 41 percent agreed that they should be protected from discrimination at work. On the other hand, 46 percent of Pakistanis said people in same-sex relationships should be punished as criminals, while 31 percent disagreed. When it comes to transgender people, 49 percent thought they should have the same rights as others. About 51 percent believed they should be protected from job discrimination, and 44 percent said they should be able to change their legal gender. Another World Values Survey from 2017 to 2020 found that 44 percent of Pakistanis believed that same-sex couples could be good parents like heterosexual couples. But 31 percent disagreed. In this survey, 59 percent of Pakistanis said they would accept a gay or lesbian neighbor, while 41 percent said they would not. ==Summary table== Same-sex sexual activity legal Criminalized under Article 377. (Penalty: from two years to life imprisonment, fines, or both. Hudood ordinances which notionally allow capital punishment, but are unenforced since 1985; have never been used to prosecute homosexual acts.) Equal age of consent Anti-discrimination laws in employment for Pakistani gays, lesbians, and bisexuals (Since 2018; for Gender Identity Only) Anti-discrimination laws in employment only for Transgender or Transexual persons (known as Khuwaja Sira, formerly hijra, or Third Gender) Anti- discrimination laws in the provision of goods and services for gays, lesbians, and bisexuals (Since 2018; for Gender Identity Only) Anti-discrimination laws in the provision of goods and services for (known as Khuwaja Sira, formerly hijra, or Third Gender) Anti-discrimination laws in all other areas (incl. indirect discrimination, hate speech) (Since 2018; for Gender Identity Only) Recognition of same-sex couples Adoption by same-sex couples Gays allowed to serve in the Military Third gender Recognised (Since 2010) Right to change Legal Gender (Since 2010) Access to IVF for lesbians Commercial surrogacy for gay male couples == Related pages == * Male prostitution in Pakistan * Naz Male Health Alliance ==References== == Other websites == * * Category:Human rights in Pakistan Category:LGBT in Asia Category:LGBT Muslims Category:LGBT rights by country",
 "title": "LGBT rights in Pakistan"
}