{
 "id": "290786",
 "text": "A thesis (plural: 'theses') is a document written in support of an idea that is presented for discussion or disputation. In modern usage it usually refers to a document presented as a requirement for an academic degree or professional qualification. It presents the author's research and findings.International Standard ISO 7144: Documentation – Presentation of theses and similar documents, International Organization for Standardization, Geneva, 1986. In the academic context it means the same as dissertation. The term dissertation can be used to describe an argument without relation to academic degrees. The term thesis may also be used for the central claim of an essay or other work. == Thesis types == There are different types of thesis for different fields, for example, if you are an English major then for your thesis you may be asked to write a short story, a media student can be asked to submit a short film. A graduate thesis is also known as graduate dissertation. A student may work with a member of the faculty who has specialized in the relevant field. A thesis may be much longer. In the French system, a thesis (PhD), also called \"Doctorat\" is generally far longer and is up to 500 pages long. == History == Originally, the words \"dissertation\" and \"thesis\" had separate meanings. When, at ancient universities, the professor had completed his lecture, there would be a disputation. During this, students could take up certain points and argue them. The position that one took during a disputation was the thesis, while the dissertation was the line of reasoning with which one supported it. ==Etymology== The word \"thesis\" comes from the Greek , meaning \"position\", and refers to an intellectual proposition. \"Dissertation\" comes from the Latin dissertātiō, meaning \"discourse\". ==References== == Other websites == * en.wikibooks.org/wiki/ETD_Guide Guide to electronic theses and dissertations on Wikibooks * Networked Digital Library of Theses and Dissertations (NDLTD) * How to write a PhD thesis Thesis Writing * PhD Thesis Structure Explained on The Academic Papers * Free thesis indexing service * EThOS Database Database of Theses available through the British Library Category:Academia Category:Genres fi:Tieteellisten yliopistotutkintojen opinnäytetyöt#Väitöskirja",
 "title": "Thesis"
}