{
 "id": "290848",
 "text": "Boyz n the Hood is a 1991 American hood movie that was produced by Steven Nicolaides and DJ Pooh and was directed by John Singleton. Boyz n the Hood was released on July 12, 1991 in North America. The movie received positive reviews with a 98% rating on Rotten Tomatoes and a 73 out of 100 from Metacritic. The movie was selected to be in the United States National Film Registry by the Library of Congress to be preserved because it was considered to be \"culturally significant\" in 2002. This movie was the directorial debut for John Singleton. == Plot == ===1984=== The movie starts with a fight at school in Inglewood, California after a boy tells another that he is from Africa. The attacker's teacher calls his mother Reva. The attacker gets expelled for three days and comes home. In Crenshaw, Tre reunites with his childhood friends, Darrin \"Doughboy\" Baker, Doughboy's half-brother Ricky, and their friend Chris. That night, Tre's father shoots at a burglar. The next day, Doughboy and Chris are being taken to prison for stealing. ===7 years later=== The movie shifts 7 years later when a party is held outside. Later, an augment the Bloods and Crips happens. Tre and Ricky are pulled over and an officer threatens Tre with a gun. The next afternoon, Ricky has a fight with Doughboy. Ricky is later found dead. The epilogue reveals that Ricky buried the next day and two weeks later Doughboy was murdered. == Cast == * Cuba Gooding, Jr. (Desi Arnez Hines II, young) as Tre Styles * Ice Cube (Baha Jackson, young) as Darrin \"Doughboy\" Baker * Morris Chestnut (Donovan McCrary, young) as Ricky Baker * Laurence Fishburne as Jason \"Furious\" Styles * Nia Long as Brandi * Tyra Ferrell as Brenda Baker * Angela Bassett as Reva Devereaux-Styles * Redge Green (Kenneth A. Brown, young) as Chris * Dedrick D. Gobert as Dookie * Baldwin C. Sykes as Monster * Tracey Lewis-Sinclair as Shaniqua * Alysia Rogers as Shanice * Regina King as Shalika * Lexie Bigham as Mad Dog * Raymond Turner as Ferris == References == Category:1990s English- language movies Category:1991 drama movies Category:1991 crime drama movies Category:1990s American drama movies Category:1990s coming-of-age movies Category:1990s teen drama movies Category:American crime drama movies Category:American gangster movies Category:American coming-of-age movies Category:American teen romance movies Category:American teen drama movies Category:African-American movies Category:Movies about racism Category:Movies set in Los Angeles Category:Movies set in the 1980s Category:Movies set in the 1990s Category:United States National Film Registry movies Category:Movies directed by John Singleton Category:Columbia Pictures movies",
 "title": "Boyz n the Hood"
}