{
 "id": "290991",
 "text": "The Phoenix Park MurdersMoloney (2006)Corfe (1968) were the fatal stabbings on 6 May 1882 in Phoenix Park in Dublin, Ireland. Lord Frederick Cavendish and Thomas Henry Burke were killed. Cavendish was the newly appointed Chief Secretary for Ireland, and Burke was the Permanent Undersecretary, the most senior Irish civil servant. The assassination was carried out by members of the \"Irish National Invincibles\". ==Murders== Cavendish and Burke were attacked as they walked through Phoenix Park to the Viceregal Lodge. This was the \"out of season\" residence of the Lord Lieutenant of Ireland (the King's representative and head of the Irish affairs). Thomas Myles, surgeon at the nearby Dr Steevens' Hospital, was called to help the victims.Moloney (2006), p. 27 The Lord Lieutenant, Lord Spencer, described suddenly hearing screams, before seeing a man running to the Lodge grounds shouting \"Lord Frederick Cavendish and Mr. Burke are killed.\"Moloney (2006), p. 33 Responsibility for the political murders was claimed by a small, until then unknown Republican organisation called the Irish National Invincibles. ==Investigation== The hunt for the murderers was led by Superintendent John Mallon, a Catholic who came from Armagh. Mallon had a pretty good idea of who was involved. He suspected a number of former Fenian activists. A large number of suspects were arrested and kept in prison by claiming they were connected with other crimes. Mallon got several of them to reveal what they knew about the murders.Moloney (2006), p. 146 et passim The Invincibles' leader James Carey, Michael Kavanagh and Joe Hanlon agreed to testify against the others. Joe Brady, Michael Fagan, Thomas Caffrey, Dan Curley and Tim Kelly were convicted of the murder.Moloney (2006), p. 187 et passim They were hanged in Kilmainham Gaol in Dublin between 14 May and 4 June 1883. Others were sentenced to serve long prison terms. ==Political results== Irish politician Charles Stewart Parnell made a speech condemning the murders in 1882. This increased his popularity in both Britain and Ireland.Lyons (1977), p. 209-211 In March 1887, The Times printed letters that said they were written by Parnell. The letters said that he agreed with the murderers of the English politicians, and that his speech saying otherwise was not true. It later came to light that the letters were not written by Parnell. They were forgeries written by journalist Richard Pigott. Parnell was personally shown to be innocent by the Parnell Commission in 1888-89. ==Notes== ==References== * * * Category:1882 Category:1880s in Europe Category:19th century in the United Kingdom Category:Assassinations in Europe Category:History of Dublin Category:Irish republicanism Category:Murder in the 19th century Category:Terrorist incidents in the United Kingdom",
 "title": "Phoenix Park Murders"
}