{
 "id": "290934",
 "text": "Judith Eva Barsi (June 6, 1978 – July 25, 1988) was an American child actress. She was born in Los Angeles, California and started her acting career in commercials. She also played Thea Brody in the movie \"Jaws 4: The Revenge\" in 1987 and voiced \"Ducky\" in The Land Before Time and Annie-Marie in All Dogs Go to Heaven in June 1989. Her father, Jozef, was jealous and paranoid. He abused Judith and her mother for some years. Barsi was the daughter of Hungarian immigrants József Barsi and Maria Barsi (née Benkő). Her parents fled the 1956 Soviet occupation of Hungary and then immigrated to Los Angeles. Maria Barsi wanted to be an actress herself, but later hoped that her daughter would be one, instead. Judith was discovered at a skating rink when she was five years old, but could still pass for age three. She went on to appear in over 70 commercials and soon appeared in movies. Later in her life, Barsi had growth hormone injections to help her growth. On July 25, 1988, she and her mother were shot dead by her father, Jozsef who later committed suicide. ==Career== In 1984, Barsi began her career as a actress. ==Abuse, murder and burial== Judith's parents met at a restaurant in Los Angeles that was well known as a meeting place for immigrants. Maria worked there as a waitress. Jozsef was a plumber. He had problems with alcohol and was arrested three times for driving drunk. In the first years of their marriage, they were a happy couple. Soon Jozsef became jealous of the success of Maria's daughter. When Judith was getting ready to go to the Bahamas for the movie Jaws 4: The Revenge, her father entered her bedroom. He locked the door and put a kitchen knife to her neck saying: \"If you do not return after finished shooting, I'll cut your throat.\" She came back after two months, but the atmosphere at the house was not better. Over time, there were more problems. Judith's father called her a \"spoiled brat\". Judith's mood began to get bad. She did not do anything wrong and was not \"full of life, a happy girl.\" Unable to deal with the problems at home, Judith pulled out her eyelashes and the whiskers of her cat. Jozsef had said many times that he would kill his wife. Sometimes he said he would kill himself and his daughter. In December 1986, Maria made a report to the police. She said he was abusing her mentally and physically. The police saw no injuries. In May 1988, Ruth Hansen saw the poor condition of the girl. Because Judith cried a lot and could not speak, Hansen told Maria to take Judith to a psychologist. She was taken to Children's Services. They could get no help from government organizations. Maria rented an apartment in Panorama City, where she wanted to move with Judith. Hansen told her to get a divorce from her husband. In July, Maria said she did not want to lose the house purchased with the money from her daughter's career. Judith was seen riding her bike in the morning of July 25, 1988, one month after her 10th birthday. On the same day, she had an audition for the role in a new production studio, Hanna- Barbera. When Judith was sleeping, her father shot Judith in the head. She was killed instantly. Her mother ran down the hall to see what was going on, and he fatally shot her. Jozef later went down to the garage and took his own life. The funeral was held on August 9, 1988. Judith was buried with her mother in unmarked graves in the cemetery Forest Lawn Memorial Park in Los Angeles. The short ceremony was attended by about 75 people. Many of these people were children. ==Legacy== The Judith Barsi Memorial was dedicated the song \"Love Survives\" from the movie All Dogs Go to Heaven. The movie premiered over a year after the death of the girl. Judith Barsi's tombstone was placed on August 23, 2004. It says: In Memory of the lovely Judith Eva Barsi \"Our Concrete Angel Yep! Yep! Yep!\". A similar plate was mounted at January 25, 2005 commemorating her mother Maria. ==References== Category:1978 births Category:1988 deaths Category:Actors from Los Angeles Category:American child actors Category:American movie actors Category:American murder victims Category:American television actors Category:American voice actors Category:Murders by firearm in California",
 "title": "Judith Barsi"
}