{
 "id": "291213",
 "text": "The following is a list of episodes from the American animated series Rugrats. The first episode aired on Sunday, August 11, 1991. The first three seasons aired between 1991 and 1995. The series returned with two Jewish holiday specials in April 1995 and December 1996. From 1997 to 2004, the series began airing regular episodes again. The 10th anniversary special \"All Growed Up\" aired on July 21, 2001, on Nickelodeon. Rugrats ended on Sunday, August 1, 2004. Rugrats reruns still air on TeenNick’s late night programming block NickRewind. There are 9 seasons, 172 episodes, three movies, and two direct- to-DVD specials. ==Series overview== ==Episodes== ===Pilot (1990)=== ===Season 1 (1991)=== ===Season 2 (1992–93)=== ===Season 3 (1993–95)=== ===Season 4 (1996–97)=== ===Season 5 (1998–99)=== ===Season 6 (1999–2001)=== In the United States, episodes 127 to 130 were held over from this season and ended up airing during Season 7. The first Klasky Csupo logo still appeared after the second logo appeared at the end of The Rugrats Movie. The second logo did not appear until \"Runaway Reptar\". ===Season 7 (2001; 2004)=== During season 7, Rugrats made a change with a different format that consisted of three segments per episode. Additionally, all half-hour stories from this point on had two ad breaks instead of one. ===Season 8 (2001–03)=== The original two-segment format for Rugrats was brought back in season 8. However, the half-hour episodes retain having two commercial breaks. The first Klasky Csupo logo appeared after the credits in the early airings of this season. However, the Season 8 DVD from Amazon.com, \"The '90s Are All That\" and the later airings kept the second logo. ===Season 9 (2002–04)=== ==DVD releases== Nickelodeon and Amazon.com produce DVDs of new and old Nickelodeon shows through the CreateSpace service. Using a concept similar to print on demand, Amazon manufactures the discs, cover art, and disc art. , Seasons 1–9 were available. , the Amazon.com releases have been discontinued. In Australia, Beyond Home Entertainment has released all 9 seasons on DVD. In May 2017, Nickelodeon and Paramount Home Entertainment released Seasons 1 and 2 on DVD. In February 2018, Nickelodeon and Paramount Home Media Distribution released Seasons 3 and 4 on DVD. ==Rugrats Tales from the Crib (2005–06)== These movies are direct-to-DVD movies that are part of the Rugrats series. No. Title Directed by Written by Original air date Prod. code ==Notes== ==References== ;General references * ==Other websites== * TV.com's Rugrats episodes * TV Guide's Rugrats episode Category:Lists of Nickelodeon television series episodes",
 "title": "List of Rugrats episodes"
}