{
 "id": "291391",
 "text": "The Reichstag fire () was an arson on the Reichstag building, the meeting place of the German Parliament, in Berlin on 27 February 1933. It was an important event in the creation of Nazi Germany. A Berlin fire station was called, and by the time the police and firefighters had arrived, most of the building was covered in flames. Inside the building, Marinus van der Lubbe was found. He was a Dutch communist. The Nazis said it proved that communists were beginning a plot against the German government. Van der Lubbe and four Communist leaders were arrested shortly after that. Adolf Hitler, who had become Chancellor four weeks before, urged President Paul von Hindenburg to pass an emergency law to fight back \"the confrontation of the Communist Party of Germany\".History of the Reichstag Fire in Berlin Germany As a result, Enabling Act of 1933 was passed. The Reichstag Fire Decree was issued by President von Hindenburg on the advice of Chancellor Adolf Hitler on 28 February 1933 in response to the Reichstag fire. The decree suspended most civil liberties in Germany.Mommsen, Hans 1972. The Reichstag Fire and its political consequences. In Holborn, Hajo. Republic to Reich: the making of the Nazi Revolution. New York: Pantheon Books. pp. 129–222. Many Communists were arrested, including all the Communist Party members of Parliament. This made the Nazis the majority of the Parliament, and made Hitler's the dictator in effect.Hett, Benjamin Carter 2014. Burning the Reichstag: an investigation into the Third Reich's enduring mystery. Oxford: Oxford University Press. ISBN 978-0-19-932232-9 The following elections gave Hitler more power. More investigation continued. In early March 1933, three men were brought to the court. All of them were senior Bulgarian Comintern agents. One Communist was found guilty and executed; the others were acquitted and went to the Soviet Union. Historians still do not know who planned the fire or who did it. It is still an ongoing topic of research. == References == Category:1933 in Europe Category:1930s in Berlin Category:Arson in Europe Category:Attacks on buildings and structures in Germany Category:Building and structure fires in Europe Category:February events Category:Nazi Germany Fire",
 "title": "Reichstag fire"
}