{
 "id": "291413",
 "text": "Chelsea Kane Staub (born September 15, 1988) is an American actress and singer professionally known as Chelsea Kane since December 2010. She is best known for her role as Stella Malone in the Disney Channel sitcom Jonas L.A.. She also appeared in the Disney Channel Original Movies, Minutemen and Starstruck. She also co-stars in the Disney Channel animated series, Fish Hooks. == Career == Kane grew up in Phoenix, Arizona, where she attended Mohave Middle School. She is an alumna of Valley Youth Theatre. In 2007, she played her first starring role as well as her first theatrical role, in the theatrical motion picture Bratz: The Movie, as \"Meredith Baxter Dimly\", the film's primary antagonist. She performs two of the songs on the film's soundtrack. In 2008, she acted in one of the Disney Channel Original Movies Minutemen as \"Stephanie Jameson\", which aired on Disney Channel in January 2008. She will be in the Jonas Brothers' brand new Disney Channel series JONAS as \"Stella Malone\", the boys' stylist and childhood best friend. She also has a song written about her performed by The Summer Set. ==Filmography== ===Film=== Year Title Role Notes 2004 Arizona Summer Carol Direct-to-video film 2007 Bratz Meredith Baxter Dimly First theatrical role 2008 Minutemen Stephanie Jameson Disney Channel original film 2010 Starstruck Alexis Bender Disney Channel original film 2013 Lovestruck: The Musical Young Harper Hutton/Debbie Hayworth ABC Family original film 2014 Pop Fan Ava Pierce Main role; Lifetime original film ===Television=== Year Title Role Notes 2004 Listen Up Young girl Episode: \"Grandmaster of the Wolfhunt\" 2004 Summerland Sharon Pilot episode 2004 Cracking Up Nora Jones Episodes: \"Grudge Match\", \"Learning Disability\" 2008 Wizards of Waverly Place Kari Langsdorf Episode: \"The Supernatural\" 2008 Erica Episode: \"Pineblock Derby\" 2008 Disney Channel Games Herself 5 episodes 2008 Jonas Brothers: Living the Dream Herself Episode: \"Hello Hollywood\" 2009–2010 Jonas Stella Malone Main role; Disney Channel original series 2010–2014 Fish Hooks Bea Goldfishberg (voice) Main role; Disney Channel original series 2011 Dancing with the Stars Herself/contestant Season 12; placed third 2011 So Random! Herself Episode: \"Chelsea Kane Staub and Hot Chelle Rae\" 2011 The Homes Annie Holmes Main role; web series 2012 One Tree Hill Tara Richards Recurring role, 5 episodes 2012 CSI: Crime Scene Investigation Brooke Casidy Episode: \"Trends with Benefits\" 2012–2017 Baby Daddy Riley Perrin Main role; ABC Family original series 2012 Drop Dead Diva Paige McBride Episode: \"Jane's Getting Married\" 2015 Rick and Morty Arthricia (voice) Episode: \"Look Who's Purging Now\" 2015 Regular Show Chrissy (voice) Episode: \"Return of Party Horse\" 2018–2019 Hot Streets Jen Sanders (voice) Main role 2018 A Christmas for the Books Joanna Moret Hallmark Movies & Mysteries Channel Television Film 2019–2021 Archibald's Next Big Thing Loy (voice) Main role 2019 Robot Chicken Butterbear, Ellen Ripley (voice) Episode: \"Musya Shakhtyorov in: Honeyboogers\" 2020 The Expanding Universe of Ashley Garcia Ava Germaine Recurring role, 4 episodes 2020 DC Super Hero Girls Rose Wilson (voice) Episode: \"Dinner for Five\" 2022–2023 9-1-1 Kameron Season 6: 4 episodes ===Music videos=== Year Title Artist Notes 2009 \"U Can't Touch This\" Daniel Curtis Lee and Adam Hicks Cameo appearance 2009 \"Chelsea\" The Summer Set Herself 2011 \"Hotwire\" Mark Ballas Herself ==Discography== Year Song Album 2007 \"It's All About Me\" (feat. Malese Jow and Anneliese van der Pol) Bratz: Motion Picture Soundtrack 2007 \"Fabulous\" Bratz: Motion Picture Soundtrack 2011 \"When Everything Falls Back Down\" (with Action Item) The Stronger The Love ==Awards and nominations== Year Association Category Nominated work Result 2009 Teen Choice Awards Choice TV Breakout Star Female Jonas L.A. 2012 Teen Choice Awards Summer TV Star: Female Baby Daddy 2013 Teen Choice Awards Summer TV Star: Female Baby Daddy ==References== ==Other websites== * *Chelsea Staub Web Site Category:1988 births Category:Living people Category:Actors from Phoenix, Arizona Category:American movie actors Category:American television actors Category:Disney actors Category:Musicians from Phoenix, Arizona Category:Singers from Phoenix, Arizona",
 "title": "Chelsea Kane"
}