{
 "id": "291639",
 "text": "\"Tommy's First Birthday\" is the first official episode of the animated television series Rugrats. It originally aired on the television network Nickelodeon on August 11, 1991, during the series' first season. In the episode, Stu and Didi strive to make Tommy's first birthday a memorable one. They do, but under the wrong circumstances. Meanwhile, Tommy wants to eat dog food so he can be just like Spike, eventually selling the other Rugrats on the idea. == Summary == One morning, Tommy Pickles is woken up by his parents who wish him a happy birthday: his very first, in fact. Once he's changed and dressed in his special birthday outfit (which consist of a Mario-like red T-shirt with overalls instead of what will be the series normal of light blue T-shirt and diaper) Didi takes him downstairs for breakfast before his party begins. Didi and Stu feel thoroughly prepared for this special occasion by consulting Lipschitz and creating a birthday checklist. The adults don't notice that Tommy is watching a dog food commercial on TV. Feeling inspired by the ad, Tommy breaks out of his highchair and crawls over to his dog Spike's food bowl (full of canned dog food). At the last minute Grandpa Lou catches Tommy and tells him he doesn't want dog food, he wants his baby food breakfast. But when Lou looks at Tommy's baby food he admits that dog food does look more appetizing by comparison! The day rolls on and Betty and Howard DeVille arrive for the party with their twins, Phil and Lil, and Chuckie Finster, the neighbors son. When they're all gathered in the playpen, Tommy tells them about the dog food commercial, and his belief that if they eat dog food, they'll turn into dogs. The other babies find this appealing and decide they want to be dogs, too. But before they can leave the playpen, the grownups put party hats on the babies and snap pictures, though the babies aren't thrilled by either one. Soon, Stu's older brother Drew arrives with his daughter Angelica (who, not unlike Tommy, is wearing a special birthday party dress for the occasion). Angelica gleefully poses for pictures with the babies, though roughly. Tommy tells Angelica about the dog food, a spotted hyena hound named Spike who enjoys the idea of biting the mailman and agrees to go along with Tommy's plan to get dog food. But before they can do anything, it's time to open presents. Angelica is greedy and wants Tommy's presents for herself. Stu made Tommy's present himself: a remote control flying saucer. Didi and Grandpa Lou both doubt that even a grownup can fly it, but Stu insists Tommy can figure it out. The doorbell rings, signaling the arrival of the puppet stand and puppets the Pickles' booked for the party. But there are no professional puppeteers to go with the stand, leaving Stu and Drew to perform themselves (and Didi worrying that her son's first birthday won't be perfect). They decide to perform the climax of Little Red Riding Hood, but they quickly begin to argue over how the lines go. Lou tries to tell them to cut it out (with a puppet of his own), however it doesn't work and they continue to bicker. Meanwhile Grandpa Boris, Didi's father, complains about the cake she baked. Didi baked a carrot cake, but Boris says a chocolate cake is more suitable. With the adults distracted, first Tommy, then the rest of the gang, go to the kitchen, but find Spike's bowl licked clean. They find another can on the counter, but have difficulties getting it down on their own. They use Stu's present to help, but wreck the kitchen and the cake in the process. Fortunately, Lou opens the can of dog food for Spike. Spike isn't interested in eating right now, so the babies eagerly help themselves...and quickly spit it out (except for Lil). Nothing happens at first, but then Tommy says he feels something, and starts to bark and crawl around. Phil and Lil say they have fleas, Chuckie hopes he can grow fur, and Angelica hopes the mailman comes soon. All of them start acting like dogs, which attracts the notice of the adults. They feel happy seeing this moment, because even though the day was far from perfect, they're all having a good time. A picture of this is taken, which is forever included on the pages of the Pickles family photo album documenting Tommy's first birthday. == Cast == * Tommy Pickles (voiced by E.G. Daily) * Phil and Lil DeVille (voiced by Kath Soucie) * Chuckie Finster (voiced by Christine Cavanaugh) * Angelica Pickles (voiced by Cheryl Chase) * Stu Pickles (voiced by Jack Riley) * Betty DeVllie (voiced by Kath Soucie) * Grandpa Lou (voiced by David Doyle) * Didi Pickles (voiced by Melanie Chartoff) * Grandpa Boris (voiced by Michael Bell) * Spike (voiced by by Michael Bell) == Home releases == \"Tommy's First Birthday\" was released on the DVD Rugrats: Season 1 and will be released on Rugrats: The Complete Series. ==References== Category:Rugrats Category:1991 television episodes",
 "title": "Tommy's First Birthday"
}