{
 "id": "291683",
 "text": "The Planck units are physical units of measurement. The system of these units was first developed by Max Planck. The four basic Planck units are based only on four physical constants found in nature. When Planck units are used to express any of these four physical constants, the value is 1. This allows physicists to simplify many equations about physical law. Planck proposed these units in 1899. Planck units are unique: they are based only on properties of free space (a vacuum). Planck units are also called natural units because they come only from properties of nature and not from any human construct. Planck units are only one system of natural units among other systems. The constants that Planck units define as 1 are these: *The speed of light in a vacuum, c; *The gravitational constant, G; *The reduced Planck constant, ħ; *The Boltzmann constant, kB (sometimes k). Each of these constants has at least one fundamental physical theory: c with special relativity, G with general relativity and Newton's law of universal gravitation, ħ with quantum mechanics, ε0 with electrostatics, and kB with statistical mechanics and thermodynamics. Planck units are very important for theoretical physics, because they simplify several recurring algebraic expressions of physical law. They are particularly relevant in research on unified theories such as quantum gravity. Planck units may sometimes be semi- humorously referred to by physicists as \"God's units\". They eliminate human centered arbitrariness from the system of units: some physicists argue that communication with extraterrestrial intelligence would have to use such a system of units to make common reference to scale. Unlike the meter and second, which exist as fundamental units in the SI system for historical reasons, the Planck length and Planck time are linked at a fundamental physical level. Natural units help physicists to reframe questions. Frank Wilczek puts this succinctly: The strength of gravity is simply what it is and the strength of the electromagnetic force is simply what it is.Barrow, John D. 2002. The Constants of Nature: from alpha to omega – the numbers that encode the deepest secrets of the Universe. New York: Pantheon Books. ISBN 978-0-375-42221-8Penrose, Roger 2005. Section 31.1. The Road to Reality. New York: Alfred A. Knopf. ISBN 978-0-679-45443-4 == References == Category:Basic physics ideas Category:Units of measurement",
 "title": "Planck units"
}