{
 "id": "291602",
 "text": "Ruth Ann Buzzi (July 24, 1936 - May 1, 2025) was an American comedian and actress. She was most famous for her performances on the variety show Rowan & Martin's Laugh-In. She appeared as the unwilling object of \"dirty old man\" character Tyrone F. Horneigh's affection. Ruth appeared as Ruthie on Sesame Street for several seasons. ==Awards== Buzzi received 5 Emmy Award nominations. She won the Golden Globe Award in 1973 for her work on Laugh-In. Buzzi received the Lifetime Achievement Award by the Pasadena Playhouse of the Performing Arts. Buzzi received a Clio Award for Best Spokesperson in a television commercial for her series of Clorox-2 commercials. She is among the first of only a few Caucasian women to win an NAACP Image Award. Ruth Buzzi guest starred as a music and comedy performer on dozens of prime time television specials with colleagues including Jonathan Winters, Carol Burnett, Jim Nabors, Dean Martin, Frank Sinatra, Jerry Lee Lewis, Wayne Newton, Anne Murray, Rolf Harris, Dom DeLuise, Tony Orlando to name just a few. She appeared 8 times on The Tonight Show Starring Johnny Carson and has made more than 200 other television guest appearances. Ruth Buzzi graduated with honors from the Pasadena Playhouse in Pasadena, California. She was one of the first recipients of the Pasadena Playhouse Alumni Achievement Award along with her former classmates Dustin Hoffman and Gene Hackman. Buzzi was a presenter at the 2009 Emmy Awards along with several members of her debut series, Rowan and Martin's Laugh-In. ==Personal life== Buzzi lived in Texas with her husband. Buzzi and her husband collect automobiles. Some of their collection is at the Petersen Automotive Museum in Los Angeles, California. Buzzi was diagnosed with Alzheimer's disease in 2012. In July 2022, it was reported that Buzzi had suffered a multiple strokes. Buzzi died at her home in her sleep in hospice care in Stephenville, Texas from problems caused by Alzheimer's disease on May 1, 2025, at the age of 88. ==References== Category:Comedians from Rhode Island Category:American movie actors Category:American stage actors Category:American television actors Category:Actors from Rhode Island Category:1936 births Category:2025 deaths Category:Clio Award winners Category:Golden Globe Award winning actors Category:Deaths from Alzheimer's disease Category:Disease-related deaths in Texas",
 "title": "Ruth Buzzi"
}