{
 "id": "291863",
 "text": "John Mark \"Johnny\" Galecki (born April 30, 1975) is an Belgian-born American actor. Galecki is best known for playing the role of David Healy on Roseanne and Leonard Hofstadter on The Big Bang Theory. ==Early life== Galecki was born in Bree, Belgium to American parents. He was raised in Oak Park, Illinois. ==Personal life== Galecki dated Kaley Cuoco who is his co-star on The Big Bang Theory. They dated secretly for two years before they broke up. In February 2012, it was revealed that Galecki was dating actress Kelli Garner since 2011.Simpson, Leah (February 2012). \"'Big Bang Theory' star Johnny Galecki dating 'Pan Am's Kelli Garner?\". Digital Spy.\"Kelli Garner Goes Public with Johnny Galecki!\". US Weekly. March 23, 2012.\"What would Penny say? The Big Bang Theory's John Galecki is dating Pan Am's Kelli Garnerp\". Daily Mail. February 214, 2012. ==Filmography== ===Movie=== Year Movie Role Notes 1987 Murder Ordained Doug Rule TV movie 1988 A Night in the Life of Jimmy Reardon Toby Reardon 1989 Prancer Billy Quinn National Lampoon's Christmas Vacation Russell 'Rusty' Griswold 1990 Blind Faith John Marshall TV movie In Defense of a Married Man Eric TV movie 1991 Backfield in Motion Tim Seavers TV movie 1993 A Family Torn Apart Daniel Hannigan TV movie 1994 Without Consent Marty TV movie 1996 Murder at My Door Teddy McNair TV movie 1997 Bean Stingo Wheelie Suicide Kings Ira Reder I Know What You Did Last Summer Max Neurick 1998 The Opposite of Sex Jason Bock 2000 Playing Mona Lisa Arthur Bounce Seth 2001 Morgan's Ferry Darcy Vanilla Sky Peter Brown 2003 Bookies Jude 2004 Chrystal Barry White Like Me Marcus Short movie 2005 Happy Endings Miles Uncredited role 2007 Who You Know David Short movie 2008 Hancock Jeremy Cameo Role 2009 Table for Three Ted Direct-to-video release 2011 In Time Borel ===Television=== Year Title Role Notes 1990 Hardball Male Escort #1 Episode: \"The Hunt for Honus Wagner\" 1991 Blossom Jason Episode: \"Sex, Lies and Teenagers\" 1990–1991 American Dreamer Danny Nash 17 episodes. 1992 Billy David MacGregor 13 episodes. 1993 Civil Wars Student accused of cheating Episode: \"Split Ends\" 1992–1997 Roseanne Kevin/David Healy 92 episodes. Nominated for four and winner of one Young Artist Award. 2000 Batman Beyond Knux (voice) Episode: \"April Moon\" The Norm Show Dale Stockhouse Episode: \"Norm vs. Youth: Part 1\" Episode: \"Norm vs. Youth: Part 2\" 2004 LAX Leland Pressman Episode: \"Finnegan Again, Begin Again\" 2005 My Name Is Earl Scott Episode: \"Stole Beer from a Golfer\" 2005 Hope & Faith Jay Episode: \"Blood Is Thicker Than Daughter\" Episode: \"The Restaurant\" Episode: \"Jay Date\" 2006 American Dad! Arnie Episode: \"Irregarding Steve\" 2006–2007 My Boys Trouty Episode: \"Clubhouse Cancer\" Episode: \"Take One for the Team\" Episode: \"Ethics\" 2007–2019 The Big Bang Theory Leonard Hofstadter Nominated – Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series (2011) Nominated – Golden Globe Award for Best Actor - Television Series Musical or Comedy (2011) 2009 Family Guy Leonard Hofstadter Episode: \"Business Guy\" 2011 Entourage Himself Recurring guest star ==References== ==Other websites== * Category:1975 births Category:Living people Category:Actors from Illinois Category:American child actors Category:American movie actors Category:American television actors Category:People from Limburg (Belgium)",
 "title": "Johnny Galecki"
}