{
 "id": "291956",
 "text": "Hoverflies, sometimes called 'flower flies' or 'syrphid flies', are the insect family Syrphidae.Gilbert, Francis S. 1986. Hoverflies. Cambridge University Press, Natural History Handbooks 5. . Hoverflies mimic wasp stripes, and are usually smaller than wasps. Thus to a bird they may look scarcely worth eating, and dangerous. As their common name suggests, they are often seen hovering or sucking nectar at flowers. The adults of many species feed mainly on nectar and pollen, while the larvae (maggots) eat a wide range of foods. In some species, the larvae are saprotrophs, eating decaying plant and animal matter in the soil or in ponds and streams. In other species, the larvae are insectivores and prey on aphids, thrips, and other plant-sucking insects. Aphids alone cause tens of millions of dollars of damage to crops worldwide every year. Hoverflies are important natural enemies of these pests, and can be used in biological control. Some adult syrphid flies are important pollinators. Some orchids mimic aphid alarm scent (pheromones), which attracts hoverflies. The hoverflies then pollinate the orchids.Stokl, Johannes; Brodmann; Dafni; Ayasse; Hansson 2011. Smells like aphids: orchid flowers mimic aphid alarm pheromones to attract hoverflies for pollination. Proc. R. Soc. B. 278 (1709): 1216–1222. About 6,000 species in 200 genera have been described. Hoverflies are common throughout the world and can be found on most continents except Antarctica. Hoverflies are harmless to most other animals despite their mimicry of the black and yellow stripes of wasps. They are a classic example of Batesian mimicry. The Batesian mimic is a sheep in wolf's clothing: it looks like something dangerous or which tastes disgusting, but in reality it is good to eat. Hover flies look roughly like little wasps, and their warning colouration is well-known to birds. Unlike adults, the maggots of hoverflies feed on a variety of foods. Predatory species benefit farmers and gardeners, because aphids destroy crops. Hoverfly maggots are often used in biological control. == Related pages == *Halteres *Mimicry == References == Category:Flies Category:Mimicry",
 "title": "Hoverfly"
}