{
 "id": "291966",
 "text": "James Joseph Wisniewski (born February 21, 1984) is an American former professional ice hockey defenseman. He played parts of fourteen seasons in the National Hockey League (NHL). He played for the Chicago Blackhawks, Anaheim Ducks, New York Islanders, Montreal Canadiens, Columbus Blue Jackets, and Carolina Hurricanes. He also one season with Admiral Vladivostok of the Kontinental Hockey League (KHL) and one season with Kassel Huskies of the DEL2. ==Career== Before playing in the NHL, Wisniewski played four seasons with the Plymouth Whalers of the Ontario Hockey League (OHL). Wisniewski would be drafted 156th overall by the Chicago Blackhawks in the 2002 NHL Entry Draft. He would spend his time playing between the Blackhawks and their AHL- affiliate teams, the Norfolk Admirals and Rockford IceHogs. His season would end short after he tore his anterior cruciate ligament (ACL) in a game against the Los Angeles Kings and underwent surgery on March 8, 2007. On March 4, 2009, the Blackhawks would trade Wisniewski along with Petri Kontiola to the Anaheim Ducks in exchange for Samuel Påhlsson and Logan Stephenson. Wisniewski would be given an eight-game suspension for a hit he delivered on his friend and former Blackhawks teammate Brent Seabrook on On March 17, 2010. On July 30, 2010, the Ducks traded Wisniewski to the New York Islanders for a third- round draft pick. He would play 32 games with them. On December 28, 2010, the Islanders traded him to the Montreal Canadiens for draft picks. He would play 43 games with the Canadiens. On June 29, 2011, the Canadiens traded Wisniewski to the Columbus Blue Jackets in exchange for a seventh-round (fifth-round if he signed) draft pick. On July 1, he would eventually sign a six-year, $33 million contract with the Blue Jackets. On September 26, 2011, Wisniewski would be suspended eleven games after he hit Minnesota Wild player Cal Clutterbuck after game on September 23. He would end up having to miss six weeks after taking a puck to the face in a game against the Dallas Stars on December 29, 2011. He would miss four to six weeks in 2012–13 season with a broken foot. However, the next season Wisniewski would record a career-high in points with 51 points in 75 games. On March 2, 2015, the Blue Jackets would trade Wisniewski back to the Anaheim Ducks along with a third-round pick in exchange for Rene Bourque, William Karlsson and a second-round pick. He would only play 13 games with them. On June 27, 2015, he would be traded to the Carolina Hurricanes in exchange for Anton Khudobin. He played 1 game for them. In his only game for them, Wisniewski tore his ACL 47 seconds into the game and his season was cut short. He would play professionally in Europe before retiring from playing professional ice hockey in 2018. On June 24, 2024, Wisniewski was named as an Associate Head Coach for the Ohio State Buckeyes women's team. == Awards == *He was named to the OHL First All-Rookie Team in the 2000-01 season. *He was named to the OHL First All-Star Team in the 2003-04 season. *He won the OHL Max Kaminsky Trophy in the 2003-04 season. *He was named to the CHL First All-Star Team in the 2003-04 season. *He was named the CHL Defenceman of the Year in the 2003-04 season. ==References== == Other websites == *James Wisniewski's Official website * Category:1984 births Category:Living people Category:American ice hockey defensemen Category:Anaheim Ducks players Category:Carolina Hurricanes players Category:Chicago Blackhawks players Category:Chicago Wolves players Category:Columbus Blue Jackets players Category:Montreal Canadiens players Category:New York Islanders players Category:Norfolk Admirals players Category:Sportspeople from Michigan Category:Ontario Hockey League players",
 "title": "James Wisniewski"
}