{
 "id": "292021",
 "text": "Walter Horton (April 6, 1917 – December 8, 1981) was an American blues harp player. He is also known as Big Walter Horton or \"Shakey\" Horton. ==Life== He was born in Horn Lake, Mississippi and started playing harp at the age of five. In his teens he went to Memphis and lived with little income and a lot of discrimination. In the 1930s he played with many musicians across the Mississippi delta region. He made his first recording in Memphis with the guitarist Little Buddy Doyle. Due to poor health he worked outside the music industry in the 1940s. In the early 1950s he was one of the first musicians recording for Sam Phillips at Sun Records in Memphis, who would later record Elvis Presley. At this time he also was part of the Chicago blues scene, where he recorded amongst others with Eddie Taylor and Johnny Shines. After Junior Wells left the Muddy Waters Band he recorded one session with Waters. In the 1960s he recorded often as sideman for other musicians. He played frequently in the 1970s at blues and folk music festivals in the U.S. and Europe, often with Willie Dixon's Chicago Blues All-Stars. In 1977 he joined Johnny Winter and Muddy Waters on Winter's album I'm Ready. At that time he also recorded for Blind Pig Records. Horton appeared in the Maxwell Street scene in the 1980 film The Blues Brothers. His final recordings were made in 1980. He got his nickname \"Shakey\" because while playing he moved his head. He did his own first recording not until 1964 because he was a humble and shy person who did not like to be a leader. He felt more comfortable as sideman for others. Big Walter Horton died from heart failure in Chicago in 1981 aged 64. ==Discography== ===Own works=== *1964 The Soul of Blues Harmonica Chess *1969 Southern Comfort Sire Records *1972 Offer You Can't Refuse [1 Side] Red Lightnin' (UK) *1973 Big Walter Horton with Carey Bell Alligator *1973 NowLive at the El Mocambo Red Lightnin' (UK) *1974 With Hot Cottage Stony Plain *1976 Can't Keep Lovin' You Blind Pig Records *1979 Fine Cuts Blind Pig Records *1980 Little Boy Blue [live] JSP *1984 The Deep Blues Harmonica JSP *1984 Can't Keep Lovin' You Blind Pig Records *1986 Walter Horton Black Magic *1988 Mouth Harp Maestro Ace *1990 Horton Blind Pig Records *1996 Ann Arbor Blues & Jazz Festival, Vol. 4 [live] Schoolkids *1996 They Call Me Big Walter Blues Alliance *1997 An Offer you Can´t Refuse Walter Horton und Paul Butterfield Castle *1998 Toronto '73 M.I.L. Multimedia *1999 Walter \"Shakey\" Horton Live Pacific Blues *2001 Live at the Knickerbocker JSP *2001 With Hot Cottage Stony Plain *2005 Memphis Recordings 1951 Megaphon Importservice *2008 Bocce Boogie: Live 1978 Topcat Records ===As sideman=== *Chicken Shack Complete Blue Horizon Sessions (2006) *Fleetwood Mac Blues Jam In Chicago, Vol. 2 (2004) *Buddy Guy This Is the Beginning: The Artistic and USA Sessions 1958-1963 (2003) *David \"Honeyboy\" Edwards Don't Mistreat A Fool (1999) *Johnny Shines 1915-1992 (1998) *Muddy Waters His Best 1956 bis 1964 (1997) *American Folk Blues Festival: 1962-1965 (1995) *Floyd Jones Masters Of Modern Blues (1994) *J.B. Hutto Masters Of Modern Blues (1995) *Jimmy Rogers Chicago Bound (1976) *Fleetwood MacKiln House (1970) *Koko Taylor Koko Taylor (1969) *Sunnyland SlimMidnight Jump (1969) *Fleetwood Mac Blues Jam In Chicago, Vol. 1 (1969) *Chicken Shack O.K. Ken? (1969) *Johnny Shines Johnny Shines With Big Walter Horton (1969) *Johnny Winter Johnny Winter (1969) *Big Mama Thornton Ball N' Chain (1968) *Johnny Young Chicago Blues (1968) *Otis Spann Otis Spann's Chicago Blues (1966) *Big Mama Thornton Big Mama Thornton In Europe (1965) == References == Category:Blues musicians Category:Musicians from Mississippi Category:1917 births Category:1981 deaths Category:Chicago blues musicians Category:Blues harp players",
 "title": "Walter Horton"
}