{
 "id": "292167",
 "text": "Kesennuma is a Japanese city. It is part of Miyagi Prefecture. Kesennuma is in the northeastern part of the prefecture and faces two coasts: the Pacific coast, and Sanriku coast. Kesennuma borders the town of Minamisanriku to the south. Across the border to the north in Iwate Prefecture, it borders the cities of Ofunato and Rikuzentakata. The city was heavily damaged on March 11, 2011 by the 2011 Tōhoku earthquake and tsunami and by large fires. Between 1 March and 31 August 2011, many people left Kesennuma. The population went down by about 2,500 people, or 5%. ==Damage on March 11, 2011== File:Kesennuma earthquake damage, 2011.JPG|House destroyed by the 2011 Tōhoku earthquake and tsunami. File:Damage of Tsunami in Kesennuma.JPG|The tsunami swallowed up city areas and left behind many large ships. File:Minami-Kesennuma Station after tsunami.jpg|Minami Kesennuma Station, damaged by the tsunami File:Searching for missing person in Kesennuma.JPG|Japanese Self Defense Force members search for missing persons after the town was damaged by large ships. File:US Navy 110322-N-SB672-673 An aerial view of Oshima-Mura, Japan, 11 days after a 9.0 magnitude earthquake and subsequent tsunami.jpg|Photo of damage 11 days after the quake and tsunami on the Oshima Island section of Kesennuma, taken from a helicopter attached to the USS Ronald Reagan. File:US Navy 110401-N-8607R-356 Landing Craft Utility (LCU) 1651, assigned to Assault Craft Unit (ACU) 1, embarked aboard the amphibious assault ship US.jpg|An American landing craft assisting damaged areas as part of Operation Tomodachi, April 1, 2011. ==Sister cities and friendship agreements== * Ichinoseki, Iwate Prefecture: Sister city agreement on May 1, 1997. * Kurihara, Miyagi Prefecture * Meguro, Tokyo. Kesennuma is a major producer of a mackerel fish called sanma. Meguro holds a large Sanma Festival each year. Kesennuma and Meguro became sister cities at that festival on September 18, 2010. * Puntarenas, Costa Rica * Zhoushan, People's Republic of China * Jilin, Changyi District, People's Republic of China * Seattle and Kesennuma have a sister port relationship. == References == Category:Cities in Miyagi Prefecture",
 "title": "Kesennuma"
}