{
 "id": "292541",
 "text": "Elizabeth \"Libba\" Cotten (January 5, 1895 – June 29, 1987) was an American blues and folk musician, singer, and songwriter. ==Life== She was born as Elizabeth Nevills in Carrboro, North Carolina. She was the youngest of five children of a musical family. At the age of seven she started playing her older brothers banjo. In her early teens she bought her own guitar and started writing own songs. At the age of eleven she wrote a song called \"Freight train\", which was later her signature song. At the age of 15 she worked as maid along with her mother. Soon after her 15th birthday she married Frank Cotten. They had a daughter named Lillie and Libba gave up music for church and child. They went around in the USA but finally settled in the D.C. area. After 25 years she became maid in the house of the composer Ruth Crawford Seeger and Charles Seeger. In this musical family she remembered her own guitar playing. Mike Seeger recorded her and the songs were later published as \"Folksongs and Instrumentals with Guitar\", which was released on Folkways Records. In the early 1960s during the folk revival she played shows with great names like Mississippi John Hurt, John Lee Hooker, and Muddy Waters at venues such as the Newport Folk Festival and the Smithsonian Festival of American Folklife. She went on touring and recording well into her 80s. In 1984 she won the Grammy Award for \"Best Ethnic or Traditional Recording\" for her album on Arhoolie Records, \"Elizabeth Cotten Live\". Her songs were covered by Peter, Paul, and Mary, Jerry Garcia, Bob Dylan, Devendra Banhart, Laura Gibson, Laura Veirs, His Name Is Alive and Taj Mahal. ==Recordings on CD== *Elizabeth Cotten. Freight Train and Other North Carolina Folk Songs and Tunes. Smithsonian Folkways. *Elizabeth Cotten. Shake Sugaree. Smithsonian Folkways. *Elizabeth Cotten. Live!. Arhoolie Records. *Elizabeth Cotten. Vol. 3: When I'm Gone. Folkways Records. ==Side Performer Appearances and Compilations== *1958 Various Artists / Folk Music USA. Vol. 1 (Folkways FE 4530) *19?? Various Artists / Folk Song America, Vol. 2 (Smithsonian/Folkways CD 00462) *198? Mike Seeger / Second Annual Farewell Reunion (Mercury SRMI-685) *1986 New Lost City Ramblers/ 20th Aniversery Concert (Flying Fish FF 090) *1991 Etta Baker / One-Dime Blues (Rounder CD 2112) *1990 Various Artists / A Fish That's a Song (Folkways CD 45037) *1993 Various Artists / Blues With a Feeling (VANGUARD VCD2-77005) *1996 Various Artists / Mean Old World: The Blues from 1940 to 1994 Smithsonian Blues Box (Smithsonian Institution Press 0003/ 0004) *1996 Various Artists / Smithsonian Folkways American Roots Collection (Smithsonian Folkways CD 40062) *1997 Various Artists / Close to Home Old Time Music from Mike Seeger´s Collection (Folkways CD 40097) *1998 Various Artists / North Carolina Banjo Collection (Rounder CD 439) == Videos und DVDs == * Masters of the Country Blues: Elizabeth Cotten and Jesse Fuller. Yazoo Records, 1960. * Elizabeth Cotten with Mike Seeger. Vestapool Productions, 1994. * Legends of Traditional Fingerstyle Guitar. Cambridge, Mass.: Rounder Records, 1994. * Mike Seeger and Elizabeth Cotten. Sparta, NJ: Stefan Grossman's Guitar Workshop, 1991. * Jesse Fuller and Elizabeth Cotten. Newton, NJ: Yazoo Video, 1992. * Me and Stella: A film about Elizabeth Cotten. New Brunswick, NJ: Phoenix Films and Video, 1976. * John Fahey, Elizabeth Cotten: Rare Performances and Interviews. Vestapool Productions, 1969, 1994. * Rainbow Quest with Pete Seeger. Judy Collins and Elizabeth Cotten. Shanachie Entertainment, 2005. * Libba Cotten, an interview and presentation ceremony. Schomburg Center for Research in Black Culture, 1985. * Homemade American Music. Mendocino California: Lawren Productions, 1980. * Elizabeth Cotten in concert, 1969, 1978, and 1980. Vestapool Productions, 1969, 2003. * The Guitar of Elizabeth Cotten. Sparta, NJ: Stefan Grossman's Guitar Workshop, 2002. * The Downhome Blues. Los Angeles, California: Distributed by Philips Interactive Media, 1994. * Elizabeth Cotten Portrait Collection. Public Broadcasting System, United States, 1977-1985. ==Other websites== * \"Interview with blues and folk singer Elizabeth Cotten\" for the WGBH series, Say Brother * Find-A-Grave profile for Elizabeth Cotten * Cotten Discography on Folkways * A clip of Elizabeth performing in 1969 *Remembering Elizabeth Cotten, Eclectica Magazine, Acoustic Guitar Magazine * Elizabeth Cotten Category:1895 births Category:1987 deaths Category:American guitarists Category:Singers from North Carolina Category:Musicians from North Carolina Category:Piedmont blues Category:Blues guitarists Category:American Grammy Award winners",
 "title": "Elizabeth Cotten"
}