{
 "id": "292634",
 "text": "Christ Church , the temple (æděs) or house (ædēs) of Christ, and thus sometimes known as The House is one of the largest colleges of the University of Oxford.Even so, the numbers are quite small by modern standards: about 425 undergraduates and 250 postgraduates. The college was founded by Henry VIII in 1546. As well as being a college, Christ Church is also the cathedral church of the diocese of Oxford, namely Christ Church Cathedral, Oxford. ==People== Christ Church has produced thirteen British prime ministers. This is equal to the number produced by all 45 other Oxford colleges put together, and two short of the total number for the University of Cambridge (fifteen). ==Appearance in novels== The college is the setting for parts of Evelyn Waugh's Brideshead Revisited, as well as Lewis Carroll's Alice's Adventures in Wonderland. More recently it has been used in the filming of the movies of J. K. Rowling's Harry Potter series and also the movie adaptation of Philip Pullman's novel Northern Lights (the movie bearing the title of the US edition of the book, The Golden Compass). ==Architecture== Distinctive features of the college's architecture have been used as models by a number of other academic institutions. The University of Chicago and Cornell University both have reproductions of Christ Church's dining hall. Christ Church Cathedral, New Zealand, after which the City of Christchurch is named, is itself named after Christ Church, Oxford. Stained glass windows in the cathedral and other buildings are by the Pre-Raphaelite William Morris group with designs by Edward Burne-Jones.Edward Burne-Jones Southgate Green Association \"His work included both stained-glass windows for Christ Church in Oxford and the stained glass windows for Christ Church on Southgate Green\".PreRaphaelite Painting and Design University of Texas ==Female students== The college has admitted female students since 1978. == References == Category:Colleges of the University of Oxford Category:1546 establishments in England Category:Buildings and structures in Oxford",
 "title": "Christ Church, Oxford"
}