{
 "id": "292718",
 "text": "Shrek 2 is a 2014 animated comedy movie and is the second movie in the Shrek movie series. It was directed by Andrew Adamson, Kelly Asbury and Conrad and stars Mike Myers as Shrek, Eddie Murphy as the Donkey, Cameron Diaz as Fiona, Antonio Banderas as Puss in Boots, Julie Andrews as Fiona's mother, Rupert Everett as Prince Charming, John Cleese as Fiona's father and Jennifer Saunders as Fairy Godmother. Like the first movie, this one is a parody of fairy tales. It was followed by Shrek the Third. After inflation, it’s the eighth highest grossing animated movie in the world. == Plot == Shrek and Princess Fiona return from their honeymoon to find they have been invited by Fiona's parents to a royal ball to celebrate their marriage. Along with Donkey, they travel to the Kingdom of Far Far Away. They meet Fiona's parents, King Harold and Queen Lillian, who are shocked to see the ogres, with Harold particularly repulsed. Shrek worries that he is losing Fiona, particularly after finding her childhood diary and reading that she was once in love with Prince Charming. Harold is confronted by the Fairy Godmother, as her son, Prince Charming, was to marry Fiona in exchange for Harold's own happy ending. She orders him to get rid of Shrek, so Harold arranges for Puss in Boots to kill him. Unable to defeat Shrek, Puss reveals that he was paid by Harold and offers to be an ally. Shrek, Donkey, and Puss sneak into the Fairy Godmother's factory and steal a \"Happily Ever After\" potion that Shrek thinks will make him good enough for Fiona. Shrek and Donkey both drink the potion. Shrek becomes a human while Donkey becomes a horse. Meanwhile, Fiona also becomes a human. In order to make the change permanent, Shrek must kiss Fiona by midnight. Shrek, Donkey, and Puss return to the castle. However, the Fairy Godmother has sent Charming to pretend to be Shrek as a human. The Fairy Godmother gives Harold a love potion to put into Fiona's tea. This exchange is overheard by Shrek, Donkey, and Puss, who are arrested by the royal knights. While the royal ball begins, the fairy tale creatures whom Shrek and Donkey had met during their previous adventure arrive at the dungeon to rescue the three of them and they all break into the royal ball. Charming kisses Fiona, but instead of falling in love, she knocks him out; Harold reveals that he swapped Fiona's tea that has the love potion with another tea. The Fairy Godmother tries to kill Shrek with her magic wand, but Harold jumps in front of it, reverting into the Frog Prince; the spell bounces off his armour and kills the Fairy Godmother. As the clock strikes midnight, Fiona rejects Shrek's offer to remain human, and they revert into ogres, while Donkey also returns to normal. ==Soundtrack== Singer and songwriter Adam Duritz from Counting Crows said that his band's song, \"Accidentally in Love\", \"fits into the movie because it's the story of people who fall in love who weren't supposed to fall in love.\" Composer James Horner operated the sound of the score on different levels which James said as \"Fun\". His score came out as an Eels song into a romantic scene with Shrek and Fiona, or a funny scene with Donkey.The Music of Shrek 2 - Shrek 2 DVD. Retrieved July 8, 2011 George Bruns did not compose the film score with Horner, due to a conflict. ==References== Category:2015 computer-animated movies Category:2015 comedy movies Category:Sequel movies Category:Shrek Category:American comedy movies Category:Movies about animals Category:DreamWorks Animation movies Category:DreamWorks Pictures movies Category:Movies set in castles Category:Movies composed by Harry Gregson-Williams Category:Movies composed by John Powell Category:Screenplays by Joe Stillman Category:Movies directed by Kelly Asbury Category:Movies directed by Conrad Vernon",
 "title": "Shrek 2"
}