{
 "id": "292795",
 "text": "The North South MRT line is the first Mass Rapid Transit (MRT) line in Singapore to be built. It is 45 km long with 27 stations, and it is being operated by SMRT Trains. It would usually take one hour to travel from one end of the MRT line to the other. This line is coloured red on the MRT Rail map. This line joins the Central area of Singapore to the Northern and Southern areas of Singapore. To transfer to the East West MRT line, a commuter can transfer at Jurong East, Raffles Place or City Hall. Transferring to the North East MRT Line is done at Dhoby Ghaut with a linkway. Bishan MRT Station, Dhoby Ghaut MRT Station and Marina Bay MRT Station can transfer a commuter to the Circle MRT Line. Transfer to the Downtown line is provided at Newton MRT Station. ==History== ===Main route=== The first section of the north south line opened on 7 November 1987 between Toa Payoh and Yio Chu Kang. Afterwards, the section to Outram Park (now on the East West MRT line) opened. Following that, the rest of the line opened stage by stage. ===Woodlands Extension=== The Woodlands Extension was planned to close the gap between Yishun and Choa Chu Kang. It consists of 6 stations, and opened on 10 February 1996. ===Marina South Pier extension (NSLe)=== A 1-kilometre extension of the line to Marina South Pier MRT Station was opened in 2014. ===Timeline of stations opened=== * 7 November 1987: Yio Chu Kang – Toa Payoh * 12 December 1987: Toa Payoh – Raffles Place * 20 December 1988: Yio Chu Kang – Yishun * 4 November 1989: Raffles Place – Marina Bay * 10 March 1990: Jurong East – Choa Chu Kang * 10 February 1996: Yishun – Choa Chu Kang * 23 November 2014: Marina Bay – Marina South Pier * 2 November 2019: Canberra ==Major Incidents== ===2011=== ===2015=== ===2017=== On 7 October, services on the line was stopped between Ang Mo Kio and Marina South Pier around 6pm, after the tunnels between Bishan and Braddell flooded following heavy rain, and a fire was seen near Raffles Place. Services between Newton and Marina South Pier was resumed at around 9.30pm but the section between Newton and Ang Mo Kio remained closed overnight. It opened at 2pm the following day after staff and the SCDF worked overnight to clear the water from the tunnel. SMRT reported that a faulty water pump was the cause of the flooding. This was the worst train incident in SMRT's history. == Stations == Station Number Station Name Interchange/Notes Jurong East Cross-platform interchange with the Interchange with the (2027) Bukit Batok Bukit Gombak Brickland Opening in mid-2030s Choa Chu Kang Interchange with the and the (2026) Yew Tee Sungei Kadut Interchange with the Opening in mid-2030s Kranji Marsiling Woodlands Interchange with the (2020) Admiralty Sembawang Canberra Station being built on top of already opened line, opened on 2 November 2019 Yishun Khatib Yio Chu Kang Ang Mo Kio Interchange with the (2029) Bishan Interchange with the Braddell Toa Payoh Novena Newton Interchange with the Orchard Interchange with the (2022) Somerset Dhoby Ghaut Interchange with the and City Hall Cross- platform interchange with the Raffles Place Cross-platform interchange with the Marina Bay Interchange with the extension and the (2022) Marina South Pier ==References== Category:1987 establishments in Singapore Category:Mass Rapid Transit (Singapore) lines",
 "title": "North South MRT line"
}