{
 "id": "29271",
 "text": "The British Raj was a colony of the British Empire from 1858 to 1947 in Indian Subcontinent. Raj is a word in Sanskrit that means \"rule\" and so \"British Raj\" means rule of the British Empire. The area of the colony is now in India, Pakistan, Bangladeshand Myanmar. Mansergh, Nicholas 1974. Constitutional relations between Britain and India. London: HMSO. The British Raj was officially called India or the Indian Empire The term British Raj is used for the direct British rule over areas that had been conquered by the British in the Subcontinent. It also included the independent princely states. These areas were governed by their own traditional rulers although they were under the overall authority of the British crown. An estimated 165 million people may have died as a result of British colonial policies from 1880 to 1920. This number is larger than the death toll from both World War I and World War II, including The Holocaust. Myanmar or Burma became its own British colony in 1937. The colony of Aden came under the same government from 1858 to 1937, as were British Somaliland (now part of Somalia) from 1884 to 1898 and Singapore from 1858 to 1867. British rule ended on 15 August 1947. The borders between India and Pakistan came into effect on the 18 August. Many people died during the Partition of India. Jammu and Kashmir, like the other princely states, had not been under direct British rule. India and Pakistan went to war over the area, which is now divided between them. The 1861 census showed that the British population in the subcontinent was 125,945. Only 41,862 of them were civilians as compared with 84,083 European officers and men of the Army. In 1880, the standing Indian Army consisted of 66,000 British soldiers, 130,000 natives, and 350,000 soldiers in the princely armies.Robinson, Ronald Edward, & John Gallagher. 1968. Africa and the Victorians: the climax of imperialism. Garden City, NY: Doubleday ==References== Category:History of Pakistan Category:Myanmar Category:Viceroys Category:1858 establishments Category:1850s establishments in the United Kingdom Category:19th-century establishments in India Category:19th-century establishments in Pakistan Category:Establishments in Bangladesh Category:1947 disestablishments in India Category:1947 disestablishments in the United Kingdom Category:1850s establishments in Asia Category:1940s disestablishments in Asia",
 "title": "British Raj"
}