{
 "id": "292784",
 "text": "Srinivasa Ramanujan Iyenger (December 22, 1887 – April 26, 1920) was an Indian mathematician. His father's name was K. Srinivasa Iyengar and his mother's name was Komalatammal. On 1st October 1892 Ramanujan was enrolled at local school. He had no formal training in mathematics. However, he has made a large contribution to number theory, infinite series and continued fraction. After getting his degree at Cambridge, Ramanujan did his own work. He compiled over 3500 identities and equations in his life. Some of the identities were found in his “lost notebook”. When the notebook was discovered, mathematicians proved almost all of Ramanujan's work. His discoveries have led to many advancements in mathematics. His formulae are now being used in crystallography and string theory. In 2011, Ramanujan's birthday was made \"National Mathematics Day\" by Prime Minister Manmohan Singh. Ramanujan was brought into the world in Dissolve, Madras Administration, English India (presently Tamil Nadu, India), on 22 December 1887. His dad, Kuppuswamy Srinivasa Iyengar, was a representative in a material trader's shop, and his mom, Komalathamma, was a housewife. Ramanujan was a splendid understudy, and he showed an early fitness for math. In 1904, Ramanujan entered Pachaiyappa's School in Madras, where he concentrated on arithmetic and physical science. He graduated in 1907 with a five star degree. In the wake of graduating, Ramanujan filled in as a representative in the Madras Port Trust. In 1909, Ramanujan wedded Janaki Ammal. The couple had no kids. Read More... In 1912, Ramanujan started to relate with G. H. Hardy, a teacher of math at Trinity School, Cambridge. Strong was dazzled by Ramanujan's numerical capacities, and he welcomed Ramanujan to come to Cambridge to study. Ramanujan showed up in Cambridge in 1914, and he was granted a grant to Trinity School. Read More... ==Related pages== * List of Indian scientists * Taxicab number * Triangular number * Srinivasa Ramanujan ==References== ==Other websites== * https://www.britannica.com/biography/Srinivasa-Ramanujan * https://learnwithvdk.blogspot.com/2023/05/information-about-srinivasa- ramanujan-l.html Category:1887 births Category:1920 deaths Category:Indian mathematicians Category:Number theorists",
 "title": "Srinivasa Ramanujan"
}