{
 "id": "292998",
 "text": "Jeff Bezos (born Jeffrey Preston Jorgensen; January 12, 1964) is an American businessman who founded Amazon. He also was Amazon's chairman, president, and chief executive officer (CEO). However, Bezos said in a blog post he would soon step down from this position and become Executive Chair of the Amazon Board. == Early life, Education, and Career == Jeff Bezos was born on January 12, 1964, in Albuquerque, New Mexico. He showed an early interest in technology and graduated from Princeton with degrees in electrical engineering and computer science. Before founding Amazon in 1994, he worked on Wall Street and later started an online bookstore, laying the foundation for his remarkable entrepreneurial journey. On February 2, 2021, Bezos announced that he would step down as the CEO of Amazon, to be replaced by Andy Jassy. Bezos became executive chairman on July 5, 2021.Jeff Bezos to Step Down as Amazon C.E.O., New York Times, February 2, 2021. Retrieved February 2, 2021. On July 19, 2021 Blue Origin successfully conducts its first human test flight with Bezos going to space. == Net worth == When markets opened on July 27, 2017, Bezos briefly became the world's richest person, surpassing Bill Gates with a net worth of just over $90 billion. He lost the title later in the day when Amazon's stock dropped, returning him to second place with a net worth just below $90 billion. On October 27, 2017, Bezos again surpassed Gates on the Forbes list as the richest person in the world. In August 2020, Bezos became the first person in history to have a net worth of $200 billion, according to Forbes. In January 2021, Elon Musk became the world's richest person. Since then, Bezos is now the world's second-richest person == Hacking claim == In February 2019, Bezos published a blog post alleging that National Enquirer publisher American Media, Inc. had attempted blackmail and extortion in connection with Bezos' alleged affair with Lauren Sánchez. == References == == Other websites == * Category:Businesspeople from Albuquerque, New Mexico Category:Businesspeople from Seattle Category:1964 births Category:Living people Category:American inventors Category:American company founders Category:Amazon (company) Category:Space tourists Category:American billionaires",
 "title": "Jeff Bezos"
}