{
 "id": "292900",
 "text": "The Great American Interchange was an important zoogeographic event about three million years ago. Land and freshwater fauna migrated between North America and South America.[The Great American Interchange is] \"one of the most extraordinary events in the whole history of life\". George Gaylord Simpson 1980. Splendid isolation: the curious history of South American mammals. Yale University Press, New Haven. 179 The migration happened during the Pliocene, 3.6–2.6 million years ago (mya). The volcanic Isthmus of Panama rose from the seafloor and bridged the two continents. The land bridge in what is now Panama joined the Neotropic (roughly South America) and Nearctic (roughly North America) ecozones to form the Americas. The interchange is visible from both stratigraphy and nature. Its most dramatic effect is on the distribution of mammals, but weak-flying or flightless birds, reptiles, amphibians, arthropods and even freshwater fish also migrated. The differences in the fauna of North and South America had been known for some time. Both Humboldt and Darwin discussed it. The interchange as a concept was first fully laid out in 1876 by the \"father of biogeography\", Alfred Russel Wallace. Wallace had spent 1848–1852 exploring and collecting specimens in the Amazon Basin. Others who made significant contributions to understanding the event in the century that followed include Florentino Ameghino and George Gaylord Simpson. Similar interchanges occurred earlier in the Cainozoic, when the former Gondwana continents of India and Africa made contact with Eurasia, about 50 and 30 mya respectively. == Plate tectonics == When the global continent Pangaea broke up early in the Jurassic period, the great southern supercontinent Gondwana was formed. It separated from Laurasia 200–180 mya. In stages, Gondwana also broke up, eventually into half-a-dozen continents we recognise today. They were Australasia, Indian subcontinent, Africa, Madagascar, Antarctica and South America. South America drifted west from Africa, starting about 130 mya in the Lower Cretaceous. There was open sea between them by 110 mya. The last connection of South America with any part of Gondwana was a link with West Antarctica, which broke in the Oligocene, only 30 mya. === Relevance to biogeography === When Gondwana was separated from Laurasia, evolution of most animals and plants went on separately in the two great supercontinents. Later, as Gondwana broke up, most of its fauna and flora also evolved separately. This is not obvious in Africa and India, since they moved north and joined the Eurasian continent long ago. Animals and plants moved north and south there also, but the original pattern is now hard to see. But in Australasia and South America the pattern is clear. The mammals are a good example. Eutherian mammals evolved in Laurasia but few got to Gondwana before it was separated. Earlier groups of mammals did get to Gondwana. They were the marsupials, the monotremes and other (now extinct) therian mammals. Thus, when South America was completely separated, it had only the earlier types of mammals, including some early eutherians such as the Xenarthra. The groups which evolved later, and which dominate the northern continents, only got to South America by the Great American Interchange. == South America's endemic fauna == After the late Mesozoic breakup of Gondwana, South America spent most of the Cainozoic era as an island continent. Its \"splendid isolation\" allowed the fauna to evolve into many forms found nowhere else on earth, most of which are now extinct.Simpson, George Gaylord 1980. Splendid isolation: the curious history of South American mammals. Yale University Press, New Haven. === Early mammals === The endemic mammals initially consisted of metatherians (including marsupials, xenarthrans, and a diverse group of South American ungulates. Marsupials appear to have travelled from South America through Antarctica to Australasia in the late Cretaceous or early Tertiary. Ratites (relatives of South American tinamous) probably migrated by this route about the same time, in the direction from South America towards Australia/New Zealand. Other taxa that may have dispersed by the same route (if not by flying or rafting) are parrots, chelid turtles and (extinct) meiolaniid turtles. One living South American marsupial, the tiny Monito del Monte, is more closely related to Australian marsupials than to other South American marsupials. Since it is the most 'basal' (= primitive) australidelphian we know, its group probably evolved in South America and then colonized Australia. A 61 mya old platypus- like monotreme fossil from Patagonia may be an Australian immigrant. Marsupials in South America included didelphimorphs (opossums), shrew opossums and several other small groups. === Predators === The borhyaenids and the sabertooth Thylacosmilus were once considered to be marsupials.Argot, Christine 2004. Evolution of South American mammalian predators (Borhyaenoidea): anatomical and palaeobiological implications. Zoological Journal of the Linnean Society 140, 487-521. They are sparassodont metatherians, the sister group of the marsupials. Sparassodonts were the only South American mammals to specialize as carnivores. Their relative inefficiency left opportunites for nonmammalian predators to be more prominent than usual (similar to the situation in Australia). Sparassodonts shared the ecological niches for large predators with fearsome flightless \"terror birds\" (phorusrhacids), whose closest extant (living) relatives are the seriemas. Terrestrial ziphodont crocodilians were also present at least through the middle Miocene. Some of South America's aquatic crocodilians reached monstrous sizes, with lengths up to 12 m. Through the skies over late Miocene South America (6 Ma ago) soared the largest flying bird known, the teratorn Argentavis, with a wingspan of 6 m or more, which may have lived in part on the leftovers of Thylacosmilus kills. === Later herbivores === Xenarthrans are a curious group of mammals that developed morphological adaptations for specialized diets very early in their history. In addition to those extant today (armadillos, anteaters and tree sloths), a great diversity of larger types were present, including pampatheres, the ankylosaur-like glyptodonts, various ground sloths, some of which reached the size of elephants (e.g. Megatherium), and even semiaquatic sloths. The notoungulates and litopterns had many strange forms, some examples of convergent evolution. Both groups started evolving in the Lower Paleocene, possibly from condylarth stock, diversified, dwindled before the great interchange, and went extinct at the end of the Pleistocene. The pyrotheres and astrapotheres were also strange but were less diverse and disappeared earlier, well before the interchange. The North American fauna was typical northern eutheria (supplemented with Afrotherian proboscids). == Invasions == Once the continents were joined, invasions from the north to the south were numerous and significant in their effect. Invasions from south to north were much less significant. This is most clearly seen in the mammals. === Reasons === Reasons for this have been suggested. Wetland tropical species going north encountered desert or, at any rate, dry conditions in Mexico, where the Trans-Mexican Volcanic Belt, also known as the Sierra Nevada (Mexico) or the Snowy Mountain Range, extends 900 km from west to east across central-southern Mexico. However, by far the most common theory is that North American fauna were 'topped up' from time to time whenever Eurasian species could get over the Bering Strait.During the Miocene alone, between about 23 and 5 mya, 11 episodes of invasions of North America from Eurasia have been recognized, bringing a total of 81 new genera into North America. Webb, S. David 2006. The Great American Biotic Interchange: patterns and processes. Annals of the Missouri Botanical Garden (St. Louis, Missouri: Missouri Botanical Garden) 93 (2): 245–257. doi:10.3417/0026-6493(2006)93[245:TGABIP]2.0.CO;2. . http://www.bioone.org/doi/full/10.3417/0026-6493(2006)93%5B245:TGABIP%5D2.0.CO%3B2?cookieSet=1. Retrieved 2009-06-05. === Mammals a special case === This applies with force to mammals, because the eutherian mammals originated in Asia and had undergone a great deal of evolution before they got to South America. Marsupials originally in Eurasia had long before been out-competed and gone extinct. It is not surprising the eutherians did well in South America. Marsupials in both South America and Australasia were weak in predators. The borhyaenids and Thylacosmilus (the 'marsupial' sabretooth) were not marsupials; they were the related group, the sparassodonts. Instead, in South America, the terror birds (Phorusrhacos were for a long time the top predators. All these native forms were wiped out as short-faced bears, wolves, nine species of small cats, cougars, jaguars, lions, sabretooths (Smilodon and Homotherium) established themselves. The successes in the opposite direction are interesting. Opossums, as the Virginia Opossum, are well established over a wide range. They are the only surviving marsupial in North America, though there were others before mankind arrived in the Americas. The top native South American mammal success for a long time was the superorder Xenarthra, which had two different groups with large representatives in North America. One group was the giant ground sloths, such as the megalonychid Megalonyx. This group lived in North America for over 10 million years, well before the Great Interchange. How they got there is not known. They got as far north as Alaska and the Yukon. The other group was the glyptodonts, such such as Glyptotherium texanum. They were large, heavily armoured relatives of the armadillo. The ability of South America's xenarthrans to compete effectively against the northerners represents a special case. The explanation for their success lies in part in their defence against predation. This was based on body armour and/or formidable claws. The xenarthrans did not need to be fleet-footed or quick- witted to survive. Such a strategy may have been forced on them by their low metabolic rate (the lowest among the therians). Their low metabolic rate in turn allowed them to subsist on less abundant and/or less nutritious food sources. Unfortunately, the defensive adaptations of the large xenarthrans would have been useless against humans armed with spears and other projectiles. == References == Category:Zoology Category:History of Panama Category:Gondwana Category:Laurasia Category:Pliocene Category:History of South America Category:History of North America",
 "title": "Great American Interchange"
}