{
 "id": "293164",
 "text": "Jasenovac concentration camp was the largest death camp and concentration camp in the Independent State of Croatia (ISC) during World War II. It was created by the Ustaše regime in August 1941 and destroyed in April 1945. It was part of the Holocaust. Most of the people killed at Jasenovac were ethnic Serbs, who the ISC saw as their main ethnic enemy. The camp also held Jews; Roma; anti-Fascist civilians; and a number of Croat and Bosniak Yugoslav Partisans. Between 80,000 and 100,000 people died in this concentration camp. * * * == Overview == The Ustaše imprisoned, tortured and executed men, women and children in Jasenovac. The largest number of victims were Serbs, but other victims included Jews, Bosnian Muslims,Bosniaks in Jasenovac Concentration Camp—Congress of Bosniak Intellectuals, Sarajevo. . October 2006. (Holocaust Studies) Romani people, and Croatian resistance members who opposed the ISC regime. When they got to the camp, the prisoners were marked with colors: blue for Serbs and red for \"communists\" (non-Serbian resistance members). Roma had no marks (though this was later changed).Djuro Schwartz,\"in the death camps of Jasenovac\"(במחנות המוות של יאסנובץ, קובץ מחקרים כ\"ה של יד-ושם), p. 329 Most people who were sent to Jasenovac were killed at execution sites near the camp: Granik, Gradina, and other places. Prisoners who were kept alive were mostly people who had special skills (for example, doctors, pharmacists, electricians, shoemakers, and goldsmiths). They were forced to work at Jasenovac.See: Encyclopedia of the holocaust, \"Jasenovac\" Jasenovac was a complex of five sub-camps covering over on both banks of the Sava River. The largest camp was at Jasenovac, about southeast of Zagreb. The complex also included large grounds at Donja Gradina, directly across the Sava River; a children's death camp in Sisak; and a Stara Gradiška concentration camp. == Background == === 1941 ISC orders === The Independent State of Croatia (ISC) made three important orders in 1941. The first one translates to English as the Legal Order for the Defense of the People and the State\" It was dated April 17, 1941. It ordered the death penalty for \"infringement of the honour and vital interests of the Croatian people and the survival of the Independent State of Croatia.\" (This meant that anyone who was against the government of the ISC, or the things the ISC did, could be killed.) The second set of orders were dated April 30, 1941. Their names (when translated to English) were the Legal Order of Races and the Legal Order of the Protection of Aryan Blood and the Honour of the Croatian People. Finally, on June 4, 1941 the ISC released its Order of the Creation and Definition of the Racial-Political Committee. These orders were enforced through the regular court system, and through new special courts and mobile courts-martial with special powers. Many people were imprisoned under these new laws, and by July 1941, there were too many new prisoners to fit in the jails that existed. The Ustaše government began building the Jasenovac concentration camp.For Ustase regulations and legislations, see scanned documents here, and translation here === Support from Nazi Germany === The Independent State of Croatia was created and supported by Nazi Germany and Fascist Italy. Because of this, the ISC took on their ideas about race and politics. One of Jasenovac's purposes was to help achieve the Nazis' Final Solution. Another was to commit an ethnic cleansing of Romani and Serbian people in Croatia. ==== Nazi directors ==== The Nazi organizations that directed the Ustaše's death camps were: *The Office of Foreign Affairs, represented in Croatia by Siegfried Kasche *The Schutzstaffel (SS), represented by an unknown Gestapo official who Jewish witnesses called \"Miller\" *The Reichfuhrung *The Wehrmacht ==== Plans for genocide ==== The Nazis encouraged the Ustaše's anti-Jewish and anti-Roma actions. He also showed support for anti-Serb policies. Soon, it became clear that the Nazis wanted to commit genocide. In a meeting on July 21, 1941 Hitler said to the Croatian military commander, Slavko Kvaternik: > The Jews are the bane of the human kind. If the Jews will be allowed to do > as they [want], like they are permitted in their Soviet heaven [the USSR], > then they will fulfill their most insane plans. And thus Russia became the > center to the world's illness... if for any reason, one nation would endure > the existence of a single Jewish family, that family would eventually become > the center of a new plot. If there are no more Jews in Europe, nothing will > [prevent] the unification of the European nations.... [T]his sort of people > cannot be integrated in the social order or into an organized nation. They > are parasites on the body of a healthy society, that live off of expulsion > of decent people. One cannot expect them to fit into a state that requires > order and discipline. There is only one thing to be done with them: To > exterminate them. The state holds this right since, while precious men die > on the battlefront, it would be nothing less than criminal to spare these > bastards. They must be expelled, or -- if they pose no threat to the public > -- to be imprisoned inside concentration camps and never be released.\" > Hilgruber, Staatsmanner und Diplomaten bei Hitler, p. 611. ==Creating the camp== The Jasenovac complex was built between August 1941 and February 1942. The first two camps, Krapje and Bročica, were closed in November 1941.Encyclopedia of the Holocaust (1990) Israel Gutman edition, page 739-740 The three newer camps continued to function until the end of the war: * Ciglana (Jasenovac III) * Kozara (Jasenovac IV) * Stara Gradiška (Jasenovac V) The camp was built, managed and supervised by Department III of the UNS: the Ustaška Narodna Služba (which means \"Ustaše People's Service\"). They were a special ISC police force led by Vjekoslav \"Maks\" Luburić. At different times, Miroslav Majstorović and Dinko Šakić managed the camp.For the administrative structure of the command, lo here : and in the testimony of witness Milijenko Bobanac, Dinko Sakic indictment ==Living conditions== The living conditions in the camp were terrible, as they were in most Nazi death camps. The Ustaše fed prisoners very little, did not give them enough clothing or shelter to stay warm; gave them no access to health care; and abused them. As in many other camps, conditions improved temporarily when special groups visited. For example, when members of the press visited in February 1942, and later when a Red Cross delegation visited in June 1944, the prisoners were treated better until the visitors left. Then the living conditions went back to usual.Gutman Israel (Ed.), \"Encyclopedia of the holocaust\", vol. 1, p. 739 === Food === Like at all Nazi death camps, the food given to prisoners at Jasenovac was not enough to keep them alive. The kind of food they were given changed over time. In camp Brocice, inmates were given a \"soup\" made of hot water with starch for breakfast, and beans for lunch and dinner. (These \"meals\" were served at 6:00, 12:00 and 21:00.)Djuro Schwartz,\"in the death camps of Jasenovac\", p. 299-300 Food in Camp No. III was better at first, with potatoes instead of beans. However, in January, prisoners started getting only one daily serving of thin \"turnip soup\".Cadik Danon, \"The smell of human flesh\". By the end of the year, the diet had been changed again, to three daily portions of thin gruel made of water and starch.Lazar Lukajić:\"Fratri i ustaše kolju\", interview with Borislav Ševa on pages 625-639 More changes were made, but prisoners never got enough food to keep them from starving. === Water === The water at Jasenovac was even worse than at most death camps. There was no clean water at the camp. Prisoners had to drink water from the Sava River, which was contaminated with hren (horseradish).Dinko Sakic indictment, available here, overview of witnesses' testimonies, witnesses Mara Cvetko, Jakov Finci and others === Shelter === In the first camps, Brocice and Krapje, inmates slept in regular concentration-camp barracks. These were made of wood and had three tiers (levels) of bunks. In Camp No. III, which housed about 3,000 prisoners, there was not enough shelter for everyone. At first, inmates slept in the attics of the camp's workshops, in an open depot used as a railway \"tunnel\", or simply outside in the open. A short time later, eight barracks were built.State-commission for the investigation of the Ustasa crimes and their collaborators, P. 19-20, 40.Djuro Schwartz, p. 299, 302-303, 306, 313, 315, 319-320, 322 Inmates slept in six of these barracks. The other two were used as a \"clinic\" and a \"hospital.\" These were not places where inmates could get medical treatment and get better. They were places where sick inmates were put together to die or be killed.Sakic indictment, Dragan Roller testimony.State-commission, P. 20, 39 (testimonies: Hinko Steiner, Marijan Setinc, Sabetaj Kamhi, Kuhada Nikola)Sakic indictment, testimonies: Dragan Roller, Anton Milković, Mara Cvetko, Jakov Finci, Adolf Friedrich and Abinun JesuaDjuro Schwartz, p. 316,324-328, 330Cadik Danon, \"The Smell of Human Flesh\", as presented here (under the heading \"Hunger\") === Forced labor === As in all concentration camps, prisoners at Jasenovac had to work about 11 hours a day. They did hard forced labor, and were always watched by the Ustaše guards. These guards would execute inmates even for small reasons, and say the inmates were \"sabotaging labor.\"See: State-commission, pp. 20-22various examples in: Schwartz, pp. 299-301, 303, 307 and many more examples thereinSakic trail and indictment, all witnesses' testimonies Ustasas Hinko Dominik Picilli and Tihomir Kordić controlled the labor section. Picilli would personally whip inmates to make them work harder.State-commission, p. 30-31See Sakic trail, Vladimir Cvija testimony, Sakic indictment, Milijenko Bobanac testimony here He divided the \"Jasenovac labor force\" into 16 groups, including groups of construction workers, brick-workers, metalworkers, and agricultural workers. Many inmates died from the hard work. Brick-working was especially hard and dangerous.Schwartz, p. 308. compare with Elizabeta Jevric, \"Blank pages of the holocaust: Gypsies in Yugoslavia during World-war II\", p. 120, 111-112 Inmates working as blacksmiths were forced to make knives and other weapons for the Ustaše.Documentary, \"Jasenovac: The cruelest death camp of all times\", from: \"Jasenovac: blood and ashes\" as presented here Building dikes was the most feared job of all.Ibidem, and compare with Schwartz, 299-301, 303, 332 === Sanitation === Inside the camp, there was no sanitation. Prisoners had no way to keep things clean, and had to live in terrible conditions. Blood, vomit and dead bodies filled the barracks. The barracks were also full of pests like lice and rats, which spread disease. The barracks smelled terrible because inmates had to use a bucket for a toilet during the evenings. The bucket often spilled.Schwartz, p. 313 During breaks from work (from 5:00-6:00; 12:00-13:00, and 17:00-20:00Schwartz, p. 311), inmates were allowed to empty their bowels in public latrines. These were big pits that lay bare in the open field, covered with planks of wood. Inmates often fell inside and died. The Ustaše encouraged this by having prisoners separate the planks. Sometimes, the Ustaše would even drown inmates inside the pits. When it rained, these pits would overflow and drain into the lake. This meant that urine and feces would mix into the water which the prisoners had to drink.Schwartz, p. 311, 313Borislav Seva testimonyCadik Danon, \"Smell of human flesh\", \"Talit\", \"ultimate villeness\"Ljubomir Saric testifies against Dinko Sakic Inmates were given rags and blankets, but they were very thin. The barracks were also not enough to keep inmates warm from the cold.See: State- commission, p. 20. Compare with Egon Berger's testimony, at Carl Savich column on serbianna.com on Jasenovac (front page) Prisoners' clothes and blankets were rarely cleaned. Inmates were allowed to wash them quickly in the lake once a month,State-commission, p. 20 except during the winter, when the lake froze. Then, inmates were sometimes allowed to boil a few clothes, but not well enough to get them clean. Because of these terrible living conditions, inmates suffered from illnesses that led to epidemics of typhus, typhoid, malaria, lung infections, influenza, dysentery, and diphtheria.Jakov Danon in the trail of Dinko Sakic === Belongings === The Ustaše took away all of the inmates' clothes and other things. They were given only prison uniforms made out of rags. In winter, inmates were given thin \"raincoats,\" and they were allowed to make light sandals. Inmates were given a small personal food bowl to hold the 0.4 litres of \"soup\" they were fed. An inmate would get no food if their bowl was missing (for example, because another inmate had stolen it to use it as a toilet).Schwartz, p. 324 During delegation visits, inmates were given spoons and bowls that were twice as large as the usual ones. They were also were given colored tags during these visits. === Emotional suffering === Prisoners suffered from a constant fear of death and the terrible stress of being in a situation where the living and dead were very close together. Inmates were often shocked by the terrible conditions on the trip to Jasenovac and in the camp itself. The Ustaše would worsen this shock by murdering a number of inmates as soon as they got to the camp. They also housed new prisoners temporarily in warehouses, attics, in the train tunnel, and outdoors.State-commission, p. 16-18 The inmates suffered from hardships, abuse, torture, and the deaths of other prisoners. The danger of death was greatest during \"public performances for public punishment,\" also called selections. Inmates would be lined up in groups, and guards would randomly choose individuals to be killed while facing the other prisoners. The Ustaše would make this worse by making this a slow process. They would walk around and ask questions; gaze at inmates; choose one person, then change their mind and choose another.See: State-commission, p. 23-24Marijana Cvetko testimony, New-York times, 3rd may 1998. \"War crimes revive as Croat faces possible trail\" Inmates reacted to being in Jasenovac in two basic ways. Some became activists. They formed resistance movements (groups who tried to fight the Ustaše in different ways, like stealing food, planning escapes and revolts, and trying to get in touch with people outside the camp).See: State- commission, p.53-55 But most of the inmates reacted by trying to survive and get through each day unharmed. This was not \"going in line to slaughter,\" but rather another survival strategy. === Reactions === All inmates suffered from some kind of mental health problems. Some could not stop thinking about food; others became paranoid; some had delusions; some lost control of themselves.Ilija Ivanovic, \"Witness to the Jasenovac hell\" Others seemed to lose their sense of hope. Some inmates reacted by writing. For example, Nikola Nikolić, Djuro Schwartz, and Ilija Ivanović were Jasenovac prisoners who tried to memorize events, dates, and details so they could write about them. Writing was punishable by death, and tracking dates was hard, so this was both dangerous and difficult.See: Djuro Schwartz, who said that a father and his three sons were killed for writing. The witness wrote his memories on a piece of paper in tiny script and planted it in his shoe == Systematic extermination of prisoners == Many inmates sent to Jasenovac were scheduled to be murdered. Strong men who could do hard work, and were sentenced to less than 3 years in prison, were allowed to live. However, anyone who was sentenced to 3 years in prison or longer was immediately scheduled for execution.State-commission, p. 9-11, 46-47various testimony in the Dinko Šakić trial and indictment Most of the executions of Jews at Jasenovac occurred before August 1942. After that, the ISC started to deport Jewish prisoners to Auschwitz concentration camp. Usually, Jews were forced to go to certain cities, and from there they were deported to Jasenovac. In Croatia, Jews were gathered at Zagreb; in Bosnia and Herzegovina, they were gathered at Sarajevo. However, in some cities and smaller towns, people were sent directly to Jasenovac. The Ustaše used many different kinds of systematic extermination (killing many people at once, using a system). However, they liked using manual methods of killing: killing prisoners with their hands, using tools like knives, saws, and hammers. === Cremation === The Ustaše cremated living inmates. Some of these inmates were given drugs, but others were fully awake. The Ustaše also cremated dead bodies. When the Ustaše first started cremating people in January 1942, they used brick factory ovens.Lukajić, \"Fratri i ustaše kolju\", interview with Borislav Seva , \"they threw Rade Zrnic into the brick factory fires alive!\". An engineer named Hinko Dominik Picilli made cremation much easier for them by creating seven better-working crematories.Savic, Jasenovac. Testimonies: Jakov Atijas, Jakov Kablij, Sado Cohen-DavkoState-commission, p. 14, 27, 31, 42-43, 70testimony in the Dinko Sakic caseinterview with Borislav SevaShorthand notes of the Ljubo Milos case. Also in: indictment of Ante Pavelic and presented in The Vatican's Holocaust\" Dr. Edmund Paris, Genocide in Satellite Croatia, p. 132. Crematories were also built in Gradina, across the Sava River. The State Commission says \"there is no information that [the Gradina crematory] ever went into operation.\"State-commission, p. 43 However, later testimony says this crematory was used.Sakic trial, Tibor Lovrencic testimony, 30.3.99Djuro Schwartz, p. 331-332 Some bodies were buried rather than cremated. Their bodies were dug up late in the war. === Gassing and poisoning === The Nazis had used poison gas to kill many prisoners in their concentration camps. Following this example, the Ustaše tried to use poison gas to kill inmates that arrived in Stara-Gradiska. At first, they tried to gas the women and children that arrived from camp Djakovo with gas vans (which Simo Klaić called \"green Thomas\").Dinko Sakic trail, Simo Klaic testimony, 23.3.99Dragan Roller, statement to the press during the Dinko Sakic case, new-york times, May 2nd, 1998: \"War crimes horrors revive as Croat faces a possible trial\", by Chris Hedges Later, they built gas chambers and killed prisoners by using Zyklon-B and sulphur monoxide.Savic, Jasenovac, testimonies: Sado Cohen-Davko,Misha Danon, Jakov Atijas\"Zlocini Okupatora Nijhovih Pomagaca Harvatskoj Protiv Jevrija\". Pages 144-145Shorthand notes of the Ljubo Milos case, p. 292-293. Antun Vrban himself admmitted of his crimes: \"Q. And what did you do with the children A. The weaker ones we poisoned Q. How? A. We led them into a yard... and into it we threw gas Q. What gas? A. Zyklon.\"(Qtd. M. Shelach (Ed.),\"The History of the holocaust: Yugoslavia\")Sakic trail, testimonies of witnesses: Milka Zabicic, Jesua Abinun, Jakov Finci, Simo Klaic and others\"Blank pages of the holocaust\"M. Persen, \"Ustasi Logore\", p. 105Secanja Jevreja na logor Jasenovac\", p. 40-41,58, 76, 151 === Granik === Granik was a ramp used to unload goods from boats on the Sava River. In winter 1943-44, the ground was frozen, so prisoners who did farming work had no jobs to do. Meanwhile, large numbers of new prisoners arrived. By this time, the Axis powers were expected to lose World War II, and the Ustaše wanted to kill as many people as possible before that happened. They decided to execute people on the ramp, so that after they were killed, their bodies could be dumped into the river. Every night for about 20 days, Ustaše officers brought in lists of prisoners who they planned to execute. They stripped, chained, and beat these prisoners. Then they took them to the Granik. There, they tied weights to the victims' bodies; cut their intestines and necks; hit them in the head; and then threw them into the river. Over time, the Ustaše changed this method: they tied inmates back to back in pairs, and cut open their abdomens before throwing them into the river alive.Regarding \"Granik\", see www.jasenovac.org/whatwasjasenovac.php and compare with Egon Berger testimony Jovo Iluric testimony in: \"Jasenovac Then and Now: A Conspiracy of Silence\" by William Dorich, Serbian Orthodox Dioceses of Western America,1991. p. 39State- commission, pp. 13 ,25, 27, 56-57, 58-60 === Gradina and Ustice === Gradina and Ustice were villages around Jasenovac. The Ustaše chose some empty areas near these villages, and used wire to mark off an area for a massacre and mass graves. They gathered many prisoners there and killed them with knives or by smashing their skulls with hammers. When Roma people (Gypsies) arrived in the camp, they did not undergo selection because they were all scheduled to be killed. The Ustaše took them to Gradina. Between massacres, they forced prisoners to work: the men on a nearby dyke and the women in Ustice's cornfields. Eventually, the Ustaš killed them all. Gradina and Ustice became Roma mass grave sites. Gradina became Jasenovac's main killing ground. Gravesites were also located in nearby Ustica and in Draksenic.State- commission of Croatia for the investigation of the crimes of the occupation forces and their collaboratorsC. Danon, \"Smell of human flesh\": http://www.srpska-mreza.com/History/ww2/book/Danon/Gradina.html , http://www.srpska-mreza.com/History/ww2/book/Danon/SerbianWoman.html === Mlaka and Jablanac === The Ustaše used Mlaka and Jablanac to hold women and children, and to force them to work. However, the Ustaše killed many women, children, and men at the Sava River bank between the two camps. === Velika Kustarica === According to the State Commission, the Ustaše killed as many as 50,000 people during the winter of 1941 to 1942.State-commission, p. 38-39 According to evidence, more people were killed after that winter ended.Dragutin Skrgatic testifies in the trail of Dinko Sakic, 14.4.99Illija Ivanovic, \"witness to Jasenovac hell\", \"the last day in Jasenovac\" === August 29, 1942 mass murder === In the late summer of 1942, the ISC sent tens of thousands of Serbian villagers to Jasenovac. These villagers had lived in the Kozara mountain area (in Bosnia), where ISC soldiers were fighting against the Yugoslav Partisans.M. Shelach, \"History of the holocaust: Yugoslavia\", pp. 432-434 Women were sent to do forced labor in Germany. Children were taken from their mothers and killed or sent to Catholic orphanages.Ibidem, pp. 192, 196 Most of the men were killed at Jasenovac. On the night of August 29, 1942, the camp's guards made bets about who could kill the most prisoners. One of the guards, Petar Brzica, reportedly cut the throats of about 1,360 of the new prisoners, using a butcher knife that became known as srbosjek (\"Serb- cutter\"). Other guards who admitted taking part in the bet included Ante Zrinušić, who killed about 600 inmates,Dinko Sakic trial, Ljubomir Saric testimony,15.4.1999, at: http://public.carnet.hr/sakic/hinanews/arhiva/9904/hina-15-g.html and Mile Friganović, who gave a detailed and consistent report of what happened.The Role of the Vatican in the Breakup of the Yugoslav State , by Dr. Milan Bulajić, Belgrade, 1994: 156-157; from a Jan., 1943, interview with Mile Friganović by psychiatrist Dr. Nedo Zec, who was also an inmate at Jasenovac. Friganović admitted to killing 1,100 inmates. He specifically talked about how he tortured an old man named Vukasin. He ordered the man to bless the Ustaše leader, Ante Pavelić. The old man refused, even though Friganović cut off his ears, nose, and tongue every time he refused. Eventually, he cut out the old man's eyes, tore out his heart, and cut his throat. Dr. Nikola Nikolić saw this happen.Avro Manhattan, The Vatican's Holocaust, p. 48. ==End of the camp== In April 1945, as Yugoslav Partisan units neared the camp, the Ustaše guards tried to get rid of evidence of their crimes. Since the prisoners knew what they had done, the Ustaše tried to kill as many inmates as possible, as fast as they could. On April 22, 1945, 600 prisoners revolted; 520 were killed and 80 escaped. Not long after the prisoners revolted, the Ustaše abandoned the camp. However, first, they killed the prisoners who were still alive. They also blew up and destroyed buildings, guardhouses, torture rooms, crematoriums, and other parts of the camp. When they entered the camp, the Partisans found only ruins, soot, smoke, and dead bodies. By the end of 1945, the rest of Jasenovac was destroyed. ==Victims== ===Total number=== Historians do not know exactly how many people died at Jasenovac. Today, the most common estimate is that tens of thousands of people died at the camp. Before the 1990s, the most common estimate was that hundreds of thousands had died. These estimates are very different for many reasons. The Ustaše did not keep accurate records. Different people use different ways of estimating deaths. Sometimes, the people making estimates have political biases. In some cases, entire families were killed at the camp, leaving no one to submit their names to lists of the dead. On the other hand, the lists sometimes include the names of people who died in other places; people who survived; or people who are on more than one list. ===Lists of victims=== ==== The Jasenovac Memorial Area ==== The Jasenovac Memorial Area keeps a list of the names of 69,842 Jasenovac victims, including: * 39,580 Serbs * 14,599 Roma (Gypsies) * 10,700 Jews * 3,462 Croats * 1,128 Bosniaks * People of other ethnicities The Memorial estimates that between 85,000 and 100,000 people died at the camp. However, its former director, Simo Brdar, estimated that there were at least 360,000 total deaths.Southeast Times: Exhibition aims to show truth about Jasenovac ==== The Belgrade Museum of the Holocaust ==== The Belgrade Museum of the Holocaust keeps a list of the names of 80,022 victims (mostly from Jasenovac), including approximately: * 52,000 Serbs * 16,000 Jews * 12,000 Croats * 12,000 Bosniaks * 10,000 Roma Milan Bulajic, the Museum's former director, estimated that between 500,000 and 700,000 victims died at Jasenovac. ==== The Jasenovac Research Institute ==== The Jasenovac Research Institute estimates that there were 300,000 to 700,000 deaths at the camp. ==== The Bosniak Institute ==== In 1998, the Bosniak Institute published The Socialist Federal Republic of Yugoslavia's final List of war victims from the Jasenovac camp (created in 1992).Jasenovac: Žrtve rata prema podacima statističkog zavoda Jugoslavije. Bošnjački Institut Sarajevo, Sarajevo 1998. The list contains the names of 49,602 victims at Jasenovac, including: * 26,170 Serbs * 8,121 Jews * 5,900 Croats * 1,471 Roma * 787 Muslims (whose nationalities are unknown) * 6,792 people of unknown ethnicities * Some people listed simply as \"others\" ===Estimates by Holocaust organizations=== The Jasenovac Memorial Site says: > We cannot be sure of the exact number of victims of the Ustasha camp in > Jasenovac. According to research completed so far, the number can be > estimated at between 80,000 and 100,000. According to the United States Holocaust Memorial Museum, Jasenovac's victims included: > between 45,000 and 52,000 Serb residents of the so-called Independent State > of Croatia; between 12,000 and 20,000 Jews; between 15,000 and 20,000 Roma > (Gypsies); and between 5,000 and 12,000 ethnic Croats and Muslims, who were > political and religious opponents of the regime.\" By the end of the war, over 500,000 Serbs had been killed in the Independent State of Croatia, according to Yad Vashem.http://www1.yadvashem.org/odot_pdf/Microsoft%20Word%20-%205930.pdf This includes Serbs who were killed at Jasenovac.Yad Vashem The Simon Wiesenthal Center estimates the same. ===Historical documents=== There are many different documents about Jasenovac, written by many different people. At the time, the Germans and Italians were fighting Yugoslav Partisans for control of Yugoslavia. People from both sides of that fight wrote about Jasenovac. The Ustaše themselves also wrote about the camp; so did the Vatican. Comparing all of these different accounts can help with estimates of how many people died at the camp. As the war went on, German generals wrote reports on the number of Serbs, Jews, and others killed in the Independent State of Croatia. In 1943, three different generals estimated that 300,000 to 400,000 Serbs had been killed. By March 1944, Ernst Fick wrote that 600,000 to 700,000 Serbs had been killed.Jasenovac and the Holocaust in Yugoslavia: analyses and survivor testimonies by Barry M. Lituchy; Jasenovac Research Institute, 2006. page 115Shadows on the mountain: the Allies, the Resistance, and the rivalries that doomed WWII Yugoslavia by Marcia Christoff Kurapovna; John Wiley and Sons, 2010 page 65 Hermann Neubacher wrote: > \"When prominent Ustashi [Ustaše] leaders claimed that they slaughtered a > million Serbs (including babies, children, women and old men), that is, in > my opinion, a boastful exaggeration. On the basis of the reports submitted > to me, I believe that the number of defenseless victims slaughtered to be > three quarters of a million. (Neubacher, Dr. Hermann. Special Assignment in > the Southeast, p. 18-30.) Italian generals reported similar figures to their commanders.Le Operazioni della unita Italiane in Jugislavja. Rome 1978. pp. 141-148 The Vatican's sources also wrote of similar figures. For example, Eugen Tisserant reported that 350,000 Serbs had been killed by the end of 1942.C. Falconi,The silence of Pius XII, London 1970,p. 3308 Godfried Danneels estimated that a total of \"over 500,000 people\" were killed.Brussels, Vatican's radio, interview in October 20, 1994. See Carl Savich column on Serbianna.com, front page, Jasenovac The Ustaše themselves claimed that they had killed many more people. Vjekoslav \"Maks\" Luburić, commander-in-chief of all the Croatian camps, once bragged about Jasenovac's \"efficiency.\" At a ceremony on October 9, 1942 - just a year after the camp was created - he said: \"We have slaughtered here at Jasenovac more people than the Ottoman Empire was able to do during its occupation of Europe.\"\"Dr. Edmund Paris, \"Genocide in satellite Croatia\", P. 132 The Ustaše general headquarters once published a pamphlet that said: \"the concentration and labor camp in Jasenovac can receive an unlimited number of internees [prisoners].\"Dinko Sakic indictment, case file page 1298 Finally, Miroslav Filipovic-Majstorovic, once captured by Yugoslav forces, tried to minimize the crimes committed in Jasenovac by saying that \"only\" 20,000 to 30,000 people died during the three months when he ran the camp.State-commission, p. 62 Others say that the three months' death toll is 40,000.Avro Manhatten, \"the Vatican's holocaust In 1945, the new Yugoslavian government, led by Josip Broz Tito, paid for a report by the National Committee of Croatia. The report looked into the crimes that the Ustaše and their allies had committed. The report, dated November 15, 1945, stated that 500,000 to 600,000 people were killed at the Jasenovac complex. These figures were used by researcher Israel Gutman in the Encyclopedia of the Holocaust; by the Simon Wiesenthal Center; and by others. ===Qualities of the camp=== Logically, the number of deaths in Jasenovac would depend on a few different things: ==== Size ==== Jasenovac was a complex of various camps, including Krapje and Brocice, Ciglana, Stara-Gradiska, Sisak, Djakovo, Jablanac, Mlaka, Draksenic, Gradina and Ustice, Dubica, Kosutarica, and Jasenovac's tannery. These camps and mass graveyards covered 120 square miles (around 311 square kilometers). The Jasenovac Memorial Site's list of names includes only 4000 victims are from Stara-Gradiska, where inmates were killed with poison gas as early as 1942. This suggests that the victim list may not be complete. ==== How long the camp existed ==== Jasenovac existed from mid-August 1941 to May 1945. Mass extermination took place during all of 1941 and 1942, and again in the second half of 1944. From March to December 1943, almost no mass atrocities took place. However, deaths from illness and individual killings continued. Any guard could still kill any inmate at any time. ==== Classification ==== Besides being a concentration camp, Jasenovac was an extermination camp. The Kulmhof and Bełżec extermination camps were both small, and both existed for a much shorter period of time. However, at Bełżec, over 300,000 people were killed; at Kulmhof, 128,000 were killed. ==== Population ==== Jasenovac was used as a death camp for Serbs, Jews, Roma, Sinti, Slovens, and people of other ethnicities. In other death camps, only Jews and Roma were systematically killed. Therefore, more people may have died at Jasenovac. Also, crematories were built in Jasenovac as far back as January 1942, because the Ustaše were having trouble burying all of the camp's dead bodies. This suggests that many people were already dying at the camp. In addition, later that year, prisoners were being killed with poison gas in Stara-Gradiska, in both gas chambers and vans. ==Camp officials and their fate== Some of the camp's officials and their post-war fates are listed below. Miroslav Majstorović was an Ustaše who commanded Jasenovac and Stara-Gradiska at different times. He was nicknamed Fra Sotona (brother devil) because he was very cruel, and because his family was Christian. He was captured by the Yugoslav communist forces, tried, and executed in 1946. Vjekoslav \"Maks\" Luburić was the commander of the Ustaska Obrana, or Ustaše defense. This means he was responsible for all crimes committed under his supervision in Jasenovac, which he visited a few times a month.State-commission, p. 28-29 He ran away to Spain, but was assassinated by a Yugoslav agent in 1969. Dinko Šakić ran away to Argentina. However, eventually he was extradited back to Croatia. After a trial, in 1999 he was sentenced to 20 years in prison. He died in prison in 2008. Petar Brzica was an Ustaše officer who was accused of killing about 1,360 people on August 29, 1942. He ran away to the United States. His name was on a list of 59 Nazis living in the U.S., which a Jewish organization gave to the U.S. Immigration and Naturalization Service during the 1970s. It is not clear what happened to him after that. == Later events == The Jasenovac Memorial Museum was temporarily abandoned during the Yugoslav Wars. In November 1991, Simo Brdar, a former associate director of the Memorial, collected the documentation from the museum and brought it to Bosnia and Herzegovina. Brdar kept the documents until 2001, when he gave them to the United States Holocaust Memorial Museum, with the help of SFOR and the government of Republika Srpska. In April 2005, a public monument to the victims of Jasenovac was created in New York City (on the sixtieth anniversary of the camp's liberation from Ustaše control). Former U.S. Congressman Anthony Weiner, the New York City Parks Department, the Holocaust Park Committee, and the Jasenovac Research Institute all participated. When the monument opened, ten Yugoslavian Holocaust survivors were there, along with diplomats from Serbia, Bosnia, and Israel. It is the only public monument to Jasenovac victims outside of the Balkans, and ceremonies are held there every April. ==Related pages== *The Holocaust *World War II casualties *Concentration camps == Notes == == References == *The Yugoslav Auschwitz and the Vatican, Vladimir Dedijer (Editor), Harvey Kendall (Translator) Prometheus Books, 1992. *Witness to Jasenovac's Hell Ilija Ivanovic, Wanda Schindley (Editor), Aleksandra Lazic (Translator) Dallas Publishing, 2002 *Crimes in the Jasenovac Camp, State Commission investigation of crimes of the occupiers and their collaborators in Croatia, Zagreb, 1946. *Ustasha Camps by Mirko Percen, Globus, Zagreb, 1966. Second expanded printing 1990. *Ustashi and the Independent State of Croatia 1941-1945, by Fikreta Jelic-Butic, Liber, Zagreb, 1977. *Romans, J. Jews of Yugoslavia, 1941- 1945: Victims of Genocide and Freedom Fighters, Belgrade, 1982 *Antisemitism in the anti-fascist Holocaust: a collection of works, The Jewish Center, Zagreb, 1996. *The Jasenovac Concentration Camp, by Antun Miletic, Volumes One and Two, Belgrade, 1986. Volume Three, Belgrade, 1987. Second edition, 1993. *Hell's Torture Chamber by Djordje Milica, Zagreb, 1945. *Die Besatzungszeit das Genozid in Jugoslawien 1941-1945 by Vladimir Umeljic, Graphics High Publishing, Los Angeles, 1994. *Srbi i genocidni XX vek (Serbs and XX century, Ages of Genocide) by Vladimir Umeljić, (vol 1, vol 2), Magne, Belgrade, 2004. *Magnum Crimen, by Viktor Novak, Zagreb, 1948. *Kaputt, by Curzio Malaparte, translated by Cesare Foligno, Northwestern University Press Evanston, Illinois, 1999. *Der kroatische Ustascha-Staat 1941-1945, by Ladislaus Hory and Martin Broszat, Deutsche Verlags-Anstalt, Stuttgart 1964. == Other websites == * Holocaust Encyclopedia: Jasenovac, hosted at USHMM * US Holocaust Memorial Museum: Jasenovac * Spomen Područje Jasenovac * Jasenovac Memorial Museum * Jasenovac victims list * Balkan Repository Project - Jasenovac * Jasenovac commander Šakić trial documents by Republic of Croatia * Concentration camp Jasenovac, Archive of Republika Srpska * Jasenovac at the Simon Wiesenthal Center Museum of Tolerance * Pavelic Papers' Documents on Jasenovac (includes \"Encyclopedia of the Holocaust\" quotes) * Jasenovac Committee of the Holy Assembly of Bishops of the Serbian Orthodox Church * Kosta Brandic Archives: Jasenovac * Jasenovac Research Institute * Eichmann Trial - Alexander Arnon testimony * Unscrambling the History of a Nazi Camp, The New York Times, 6 December 2006 * New expanded Jasenovac Memorial opened Category:Nazi concentration camps Category:20th century in Croatia Category:Buildings and structures in Croatia",
 "title": "Jasenovac concentration camp"
}