{
 "id": "293463",
 "text": "A dental formula is a summary of a mammal's teeth.Angus Stevenson, ed. 2007. Dentition definition, Shorter Oxford English Dictionary. vol 1: A-M 6th ed, Oxford: Oxford University Press. p646 Almost all mammals have four kinds of teeth: #incisors #canines #premolars #molars Teeth numbers and form have adapted to different feeding methods. Over time, different mammal groups have evolved distinct dental features, in the number and type of teeth, and in the shape and size of the chewing surface. The number of teeth of each type is written as a dental formula for one side of the mouth, or quadrant, with the upper and lower teeth shown on separate rows. The number of teeth in a mouth is twice that listed as there are two sides. In each set, incisors (I) are indicated first, canines (C) second, premolars (P) third, and finally molars (M), giving I:C:P:M. So for example, the formula 2.1.2.3 for upper teeth indicates 2 incisors, 1 canine, 2 premolars, and 3 molars on one side of the upper mouth. The deciduous dental formula is notated in lowercase lettering preceded by the letter d: e.g. di:dc:dm.Larry L Mai; Marcus Young Owl; M Patricia Kersting 2005. The Cambridge dictionary of human biology and evolution. Cambridge & New York: Cambridge University Press. 135 An animal's dentition for either deciduous or permanent teeth can thus be expressed as a dental formula, written in the form of a fraction: I.C.P.M / I.C.P.M. Since the teeth are always listed in the same order, the letters can be dropped, thus: #Human: deciduous teeth: 212/212; adult = 2123/2123. Both childhood molars are replaced by adult premolars. Adult total is double the formula = 32. #Opossum: 5134/4134 (one less incisor on each side of the lower jaw). #Felines: 3131/3121. The last upper premolar and first lower molar of the cat are 'carnassials', used to slice meat and skin. The carnassials are always the fourth upper premolar and the first lower molar. #Horse 313-43/3133. The horse dentition is highly specialized for eating grass. Continuous growth from the roots counters teeth wear. The teeth fall into two clear groups: incisors seize the grass, molars grind the grass.Al Cirelli 2008. Equine dentition. University of Nevada Both felines and horses have a large diastema, or gap, between their front teeth and their back teeth. This is a natural feature in many types of mammal. == References == Category:Teeth Category:Mammals Category:Animal anatomy ]",
 "title": "Dental formula"
}