{
 "id": "29349",
 "text": "The Seljuk Empire was an empire of the Seljuk Turks and a Muslim dynasty. * A. C. S. Peacock, Great Seljuk Empire, (Edinburgh University Press, 2015), 1–378 * Christian Lange; Songül Mecit, eds., Seljuqs: Politics, Society and Culture (Edinburgh University Press, 2012), 1–328 * P.M. Holt; Ann K.S. Lambton, Bernard Lewis, The Cambridge History of Islam (Volume IA): The Central Islamic Lands from Pre-Islamic Times to the First World War, (Cambridge University Press, 1977), 151, 231–234.* \"Aḥmad of Niǧde's al-Walad al-Shafīq and the Seljuk Past\", A. C. S. Peacock, Anatolian Studies, Vol. 54, (2004), 97; \"With the growth of Seljuk power in Rum, a more highly developed Muslim cultural life, based on the Persianate culture of the Seljuk court, was able to take root in Anatolia.\" * Meisami, Julie Scott, Persian Historiography to the End of the Twelfth Century, (Edinburgh University Press, 1999), 143; \"Nizam al- Mulk also attempted to organise the Saljuq administration according to the Persianate Ghaznavid model k...\" * Encyclopaedia Iranica, \"Šahrbānu\", Online Edition: \"here one might bear in mind that non-Persian dynasties such as the Ghaznavids, Saljuqs and Ilkhanids were rapidly to adopt the Persian language and have their origins traced back to the ancient kings of Persia rather than to Turkmen heroes or Muslim saints ...\" * Josef W. Meri, Medieval Islamic Civilization: An Encyclopedia, Routledge, 2005, p. 399 * Michael Mandelbaum, Central Asia and the World, Council on Foreign Relations (May 1994), p. 79 * Jonathan Dewald, Europe 1450 to 1789: Encyclopedia of the Early Modern World, Charles Scribner's Sons, 2004, p. 24: \"Turcoman armies coming from the East had driven the Byzantines out of much of Asia Minor and established the Persianized sultanate of the Seljuks.\" * Grousset, Rene, The Empire of the Steppes, (Rutgers University Press, 1991), 161, 164; \"renewed the Seljuk attempt to found a great Turko-Persian empire in eastern Iran.\" \"It is to be noted that the Seljuks, those Turkomans who became sultans of Persia, did not Turkify Persia-no doubt because they did not wish to do so. On the contrary, it was they who voluntarily became Persians and who, in the manner of the great old Sassanid kings, strove to protect the Iranian populations from the plundering of Ghuzz bands and save Iranian culture from the Turkoman menace.\" * Wendy M. K. Shaw, Possessors and possessed: museums, archaeology, and the visualization of history in the late Ottoman Empire. University of California Press, 2003, , ; p. 5.* * Bosworth, C. E. (2001). 0Notes on Some Turkish Names in Abu 'l-Fadl Bayhaqi's Tarikh-i Mas'udi\". Oriens, Vol. 36, 2001 (2001), pp. 299–313. * Dani, A. H., Masson, V. M. (Eds), Asimova, M. S. (Eds), Litvinsky, B. A. (Eds), Boaworth, C. E. (Eds). (1999). History of Civilizations of Central Asia. Motilal Banarsidass Publishers (Pvt. Ltd). * Hancock, I. (2006). On Romani origins and identity. The Romani Archives and Documentation Center. The University of Texas at Austin. * Asimov, M. S., Bosworth, C. E. (eds.). (1998). History of Civilizations of Central Asia, Vol. IV: \"The Age of Achievement: AD 750 to the End of the Fifteenth Century\", Part One: \"The Historical, Social and Economic Setting\". Multiple History Series. Paris: UNESCO Publishing. * Dani, A. H., Masson, V. M. (Eds), Asimova, M. S. (Eds), Litvinsky, B. A. (Eds), Boaworth, C. E. (Eds). (1999). History of Civilizations of Central Asia. Motilal Banarsidass Publishers (Pvt. Ltd). It ruled parts of Central Asia and the Middle East from the 11th to the 14th centuries. It was founded by Tughril Beg in 1037. The Seljuk Empire stretched from Anatolia and the Levant to Afghanistan. It was replaced by the Khwarezmian Empire in 1194. The Seljuk Empire united the eastern Islamic world, and fought against the Crusaders in the First Crusade and Second Crusade. The Seljuk Empire made several long lasting changes. These affected the region even after the empire was gone. Among them was making Farsi as the official language for history and events. They also shifted the center for the Arabic language culture from Baghdad to Cairo.Andre Wink, Al-Hind: The Making of the Indo-Islamic World, Vol. 2, 16. ==References== ==Other websites== * * Category:Former monarchies of Asia Category:Former empires Category:History of Iran Category:Medieval Azerbaijan Category:Former countries in the Middle East Category:Royal dynasties Category:11th-century establishments in Asia Category:14th-century disestablishments in Asia Category:History of West Asia Category:Geography of West Asia Category:Empires in Central Asia Category:Empires in West Asia",
 "title": "Seljuk Empire"
}