{
 "id": "29360",
 "text": "World Heritage Sites are places in the world which are very important from a cultural or natural point of view. A part of the United Nations called UNESCO selects these sites. The World Heritage Convention (\"Convention Concerning the Protection of World Cultural and Natural Heritage\") is a United Nations treaty. It governs how World Heritage Sites are selected and protected. Nations that have agreed to the treaty elect 21 countries to the UNESCO World Heritage Committee. As of 2011, World Heritage Committee members are: Australia, Bahrain, Barbados, Brazil, Cambodia, China, Egypt, Estonia, Ethiopia, France, Iraq, Jordan, Mali, Mexico, Nigeria, Russian Federation, South Africa, Sweden, Switzerland, Thailand, and United Arab Emirates. That committee sets the list of sites.According to the UNESCO World Heritage website, States Parties are countries that signed and ratified The World Heritage Convention. As of November 2007, there are a total of 186 States Parties. Each site is a place or a thing (such as a forest, mountain, lake, desert, monument, building, complex, or city). , there were 1007 sites in 161 different countries. These included 779 cultural sites, 197 natural sites, and 31 mixed properties (which are both naturally and culturally important).World Heritage List, UNESCO World Heritage Sites official sites.Twenty-seven new sites inscribed, UNESCO World Heritage Sites official sites. Italy has 50 World Heritage Sites - more than any other country. Each World Heritage Site is part of the legal territory of the nation where the site is located. UNESCO wants everyone in the world to work to protect each site. Sometimes UNESCO provides funds to help protect a site. Islamic State of Iraq and the Levant have destroyed some sites. ==Selection== The UNESCO selection committee has held a session each year since 1977. The first session was held in Paris, France. At these sessions, the committee choses which applications for World Heritage Site status are added to their list. When something is added to the list, it is said to be \"inscribed\" on the list. The entry on the list is called an Inscription. ==Selection criteria== Until the end of 2004, there were six criteria for cultural heritage sites and four criteria for natural heritage sites. In 2005, a single set of ten criteria replaced the old cultural and natural heritage criteria. To qualify as a World Heritage Site, nominated sites must meet at least one of the ten criteria; they must also be of \"outstanding universal value.\" If a site meets both cultural and natural criteria, it is called a \"mixed site\". ===Cultural criteria=== 1. \"represents a masterpiece of human creative genius and cultural significance\" 2. \"exhibits an important interchange of human values, over a span of time, or within a cultural area of the world, on developments in architecture or technology, monumental arts, town-planning, or landscape design\" 3. \"to bear a unique or at least exceptional testimony to a cultural tradition or to a civilization which is living or which has disappeared\" 4. 5. \"is an outstanding example of a type of building, architectural, or technological ensemble or landscape which illustrates a significant stage in human history\" 6. \"is an outstanding example of a traditional human settlement, land-use, or sea-use which is representative of a culture, or human interaction with the environment especially when it has become vulnerable under the impact of irreversible change\" 7. \"is directly or tangibly associated with events or living traditions, with ideas, or with beliefs, with artistic and literary works of outstanding universal significance\" ===Natural criteria=== 7. \"contains superlative natural phenomena or areas of exceptional natural beauty and aesthetic importance\" 8. \"is an outstanding example representing major stages of Earth's history, including the record of life, significant on-going geological processes in the development of landforms, or significant geomorphic or physiographic features\" 9. \"is an outstanding example representing significant on-going ecological and biological processes in the evolution and development of terrestrial, freshwater, coastal and marine ecosystems, and communities of plants and animals\" 10. \"contains the most important and significant natural habitats for in-situ conservation of biological diversity, including those containing threatened species of outstanding universal value from the point of view of science or conservation\" ===Legal status of designated sites=== UNESCO designation as a World Heritage Site provides prima facie evidence that such culturally sensitive sites are legally protected pursuant to the Laws of war, under the Geneva Conventions, their articles, protocols and customs, together with other treaties including the Hague Convention for the Protection of Cultural Property in the Event of Armed Conflict and international law. Thus, the Geneva Convention treaty promulgates: \"Article 53. PROTECTION OF CULTURAL OBJECTS AND OF PLACES OF WORSHIP. Without prejudice to the provisions of the Hague Convention for the Protection of Cultural Property in the Event of Armed Conflict of 14 May 1954,' and of other relevant international instruments, it is prohibited: :(a) To commit any acts of hostility directed against the historic monuments, works of art or places of worship which constitute the cultural or spiritual heritage of peoples; :(b) To use such objects in support of the military effort; :(c) To make such objects the object of reprisals.\" ==Images== file:Persepolis 06.jpg|Persepolis, Iran file:Il Duomo Florence Italy.JPG|Historic centre of Florence in Tuscany (Italy) File:Liberty-statue- from-below.jpg|The Statue of Liberty (United States) File:UluruClip3ArtC1941.jpg|Uluru (Australia) File:Chichen-Itza-Castillo-Seen- From-East.JPG|Chichen Itza in Yucatán (Mexico) File:Sankt Petersburg Auferstehungskirche 2005 a.jpg|Historic Centre of St. Petersburg and its suburbs (Russia) File:武当山三清殿.JPG|Ancient Building Complex in the Wudang Mountains (China) File:Chogoria valley from Nelion.jpg|Mount Kenya National Park (Kenya) File:VicFalls.jpg|Victoria Falls of the Zambezi River in Africa File:Taj Mahal in March 2004.jpg|The Taj Mahal in India File:Gizeh Cheops BW 1.jpg|Memphis and its Necropolis, including the Pyramids of Giza (Egypt) ==References== == Other websites == * List of UNESCO World Heritage Sites—Official website * World Heritage Site – Smithsonian Ocean Portal * TIME magazine. The Oscars of the Environment – UNESCO World Heritage Site",
 "title": "World Heritage Site"
}