{
 "id": "293724",
 "text": "Eczema (from Greek ēkzema, \"to boil over\") is a form of dermatitis, or inflammation of the epidermis. The epidermis is the outer layer of the skin. Eczema is a skin disease that makes the skin dry with a red or pink color to it. It becomes irritated very easily. The person's skin may start to fall off. The person may get a rash, and the skin may ooze fluids (liquid will come out from the area). If a person has eczema, the person's skin might itch and turn a lighter color in the area. Eczema is common in creases of the body (i.e. on the backs of knees, on the eyelids, in between the fingers). It worsens with extreme temperatures, so it is most common during the winter and the summer. The extreme heat can make the person sweat which will irritate the dry spots. The extreme cold will dry the skin out even more. It also can become irritated from a quick change in temperature. For example, being outside on a summer day and coming into an air conditioned environment. Eczema can last for a most of a person's life, but there is a good chance that they will outgrow it before they are eighteen. If they do not outgrow it by the age of eighteen, the odds that they will have it for the rest of their life increase. The good thing is, even if a person does not outgrow it, symptoms usually lessen with age. The worst breakouts are usually when a person is very young. Some babies are born with eczema and deal with it a lot during their first years of life. There are seven different kinds of eczema: atopic, dyshidrotic, nummular, contact dermatitis, sebbhoric dermatitis, neurodermatitis, and stasis dermatitis . No kind of Eczema is contagious. If a person's relatives have Eczema, that person is more likely to have it, too, or in other words, it is hereditary For example, if their father grew up having eczema there is a high likelihood they will have it during their lifetime. There are some foods or medicines that can start eczema. A lot of children who are sensitive to dairy or gluten will find this leads to eczema flare-ups. Also, if a person has an allergic reaction to a food this can cause hives which can sometimes turn into an eczema irritation spot. There are medicines that can help eczema hurt less. There is a medicine called hydroxyzine that is commonly used to treat it. This prevents people from itching their eczema during their sleep. There is also a new biologic medication called Dupixent on the market. This is an injection one must give to themselves once every other week. It helps to lessen the dry skin and rashes that come with eczema. Eczema can also be treated with lotions and ointments. It can be treated with over the counter lotions such as Eucerin, Cera Ve, or a cortisone ointment. There are also prescription steroid creams that will help the eczema spots. These are typically just stronger cortisone ointments. There are also other non-steroidal options such as Protopic or Zoryve which control inflammation by inhibiting the release of certain itch causing mechanisms. Also, using Aquaphor on very dry spots can help them from drying out further. In some extreme cases, people might find it necessary to receive an oral steroid or steroid shot to lessen their irritation. Lynfield, Yelva Liptzin. \"Eczema.\" World Book Advanced. World Book, 2016. Web. 22 Feb. 2016.RelayHealth. “Eczema: brief version.” Health and Wellness. Gale Cengage learning, Feb. 2012. 22 Feb. 2016. Bathing with hot water will make Eczema rashes worse. The soak and seal method can also be very helpful for those with eczema. It involves taking a lukewarm shower or preferably bath and letting the water soak into the skin anywhere from 5-15 minutes. Pat the skin dry with a towel before applying a thick emollient cream to seal in the moisture from the bath. For very inflamed spots, using a wet wrap with steroid cream underneath can help soothe the area even further. == Eczema Symptoms == Red Patches- The most common symptom is the appearance of red scaly patches all over the body. Itchiness- The scaly lesions causes irritation and itchiness. This condition occurs when the problem becomes more severe. Skin Color Change- The skin becomes dull, weak, and starts to lose its moisture. This skin becomes rough, darker, and thicker Cracks on Skin- In severe conditions, the cuts and cracks on the skin are common which can even cause pain. It is said to be the breeding ground for bacterial and fungal infections to grow. Swollen Skin- Inflamed or swollen skin is common with the appearance of dark red patches on the skin. The hands are most likely to be prone to this symptom for indicating the eczema infection in adults. ==References== Category:Skin problems",
 "title": "Eczema"
}