{
 "id": "293844",
 "text": "This page is a list of Transport for London (TfL) contracted London Bus routes in London, as well as private services that enter the Greater London area (except coaches). ==Kinds of route numbers== ===The different kind of routes today=== Route Number Type of Service 1–599 Day routes, including 24-hour services 600–699 School services, normally operating only one return journey per day* 700–899 Regional and national coach services 900–999 Mobility bus routes,only the 969 remain. N-prefixed routes Night routes X-prefixed routes Express routes Other letter-prefixed routes Local day routes, including 24-hour services, with the letter(s) denoting a key area the bus travels through. *Except 603 and 607, which are normal day time routes † Transport for London services that cross the Greater London boundary. Standard ticketing applies throughout. ===Historic numbering=== Historically, bus routes run by London Transport were grouped by the type of service that they provided. The 1924 London Traffic Act imposed a numbering scheme known as the Bassom Scheme, named after Chief Constable A.E. Bassom of the Metropolitan Police who made it. Changing and short lines used letter suffixes. The numbers were grouped also by the company that operated the route. The numbering was revised in 1934 after London Transport was formed: Route Number Former type of Service 1–199 \"Central Area\" red double-decker services 200–289 \"Central Area\" red single-decker services 290–299 \"Central Area\" night routes 300–399 \"Country Area\" north of the River Thames (rural services were operated by London Country Bus Services after 1970) 400–499 \"Country Area\" south of the River Thames 500–699 Trolleybuses 701–799 Green Line Coaches 800–899 \"Country Area New Towns\" routes ==List of routes== All routes operate in both directions unless detailed. ===1–99=== Route Start End Operator Notes 1 Canada Water bus station Hampstead Heath Go-Ahead London 2 Marylebone station Norwood bus garage Arriva London 3 Crystal Palace bus station Victoria bus station Transport UK London Bus 4 Archway tube station Blackfriars station Metroline 5 Canning Town bus station Romford Market Go-Ahead London 6 London Victoria station Willesden bus garage Metroline Operates as a 24-hour service.Central London Night Bus Map Transport for London 7 East Acton Oxford Circus Metroline 8 Bow Church Tottenham Court Road station Stagecoach London 9 Aldwych Hammersmith bus station Metroline 11 Fulham Town Hall London Waterloo station Go-Ahead London 12 Dulwich Library Oxford Circus Go-Ahead London Operates as a 24-hour service. 13 North Finchley bus station London Victoria station First Bus London Operates as a 24-hour service.Bus Service Changes 11 March to 16 April 2017 Transport for London 24 March 2017 14 Putney Heath Russell Square Go-Ahead London Operates as a 24-hour service. 15 Blackwall DLR station Charing Cross tube station Go-Ahead London 16 Brent Park London Paddington station Metroline 17 Archway tube station London Bridge bus station Metroline 18 Euston bus station Sudbury & Harrow Road railway station First Bus London 19 Battersea Bridge Finsbury Park bus station Arriva London 20 Debden Walthamstow bus station Stagecoach London 21 Lewisham Shopping Centre Holloway Go-Ahead London 22 Oxford Circus Putney Common Go-Ahead London 23 Aldwych Westbourne Park tube station First Bus London Operates as a 24-hour service. 24 Hampstead Heath Pimlico Transport UK London Bus Operates as a 24-hour service. 25 Ilford City Thameslink railway station Stagecoach London 26 Hackney Wick London Victoria station Stagecoach London 27 Chalk Farm Hammersmith Grove Transport UK London Bus 28 Kensal Rise railway station Southside Wandsworth Metroline 29 Trafalgar Square Wood Green tube station Arriva London 30 Hackney Wick Marble Arch tube station Metroline 31 White City bus station Camden Town tube station Metroline 32 Edgware bus station Kilburn Park tube station Metroline 33 Fulwell railway station Castelnau First Bus London Temporarily withdrawn between Castelnau and Hammersmith bus station until further notice due to the closure of Hammersmith Bridge. 34 Barnet Church Walthamstow bus station Arriva London 35 Clapham Junction railway station Shoreditch Go-Ahead London Operates as a 24-hour service. 36 New Cross bus garage Queen's Park station Go-Ahead London Operates as a 24-hour service. 37 Peckham Putney Heath Go-Ahead London Operates as a 24-hour service. 38 Clapton Pond Victoria bus station Arriva London Several buses start from Hackney Central during weekday daytimes. 39 Clapham Junction railway station Putney Bridge tube station Go-Ahead London 40 Clerkenwell Road Dulwich Library Go-Ahead London 41 Archway tube station Tottenham Hale bus station Arriva London 42 East Dulwich Shoreditch Go-Ahead London 43 Friern Barnet London Bridge bus station Metroline Operates as a 24-hour service. 44 Tooting railway station London Victoria station Go-Ahead London 45 Morden tube station Camberwell Green Transport UK London Bus 46 London Paddington station St Bartholomew's Hospital Metroline Operated with electric buses since 20 October 2018. 47 Catford bus garage Shoreditch Stagecoach London Operates as a 24-hour service.South-East London Bus Map Transport for London 12 September 2015Changes to night buses from 12 September 2015 Transport for London 49 Clapham Junction White City bus station First Bus London 50 Fairfield Halls Stockwell tube station Arriva London 51 Orpington railway station Beresford Square Go-Ahead London 52 Victoria bus station Willesden bus garage Metroline Operates as a 24-hour service. 53 Plumstead railway station Lower Marsh Stagecoach London 54 Woolwich railway station Elmers End station Stagecoach London 55 Walthamstow bus station Oxford Circus Stagecoach London 56 St Bartholomew's Hospital Whipps Cross Stagecoach London 57 Clapham Park Fairfield bus station Go-Ahead London Operates as a 24-hour service.South-West London Bus Map Transport for London 9 January 2016 58 East Ham Walthamstow bus station Stagecoach London 59 St Bartholomew's Hospital Clapham Park Arriva London 60 Old Coulsdon Oasis Academy Coulsdon (schoolday journeys to Streatham railway station) Streatham railway station Arriva London 61 Bromley North railway station Chislehurst Stagecoach London 62 Barking Marks Gate Stagecoach London 63 London King's Cross railway station Honor Oak Transport UK London Bus 64 New Addington Thornton Heath Pond Arriva London Operates as a 24-hour service.Proposed changes to bus services in New Addington and Forestdale Transport for London 65 Ealing Broadway station Kingston upon Thames First Bus London 66 Leytonstone bus station Romford railway station Arriva London 67 Wood Green tube station Dalston Go-Ahead London 68 Euston bus station West Norwood Transport UK London Bus 69 Canning Town bus station Walthamstow bus station Go-Ahead London Operates as a 24-hour service.East London Bus Map Transport for London 70 Chiswick Business Park South Kensington tube station First Bus London 71 Chessington World of Adventures Cromwell Road bus station First Bus London 72 East Acton Hammersmith Bridge First Bus London Temporarily withdrawn between Hammersmith Bridge and Roehampton until further notice due to the closure of Hammersmith Bridge. 73 Oxford Circus Stoke Newington Common Arriva London 74 Baker Street tube station Putney Exchange Go-Ahead London 75 Fairfield Halls Lewisham station Stagecoach London 76 Tottenham Hale bus station Lambeth North Arriva London Operates as a 24-hour service.Bus service proposal: routes 76 and N76 Transport for London 77 Tooting railway station London Waterloo station Go-Ahead London 78 Nunhead Shoreditch High Street railway station Go-Ahead London 79 Stonebridge Park station Edgware bus station First Bus London 80 Downview & High Down Prisons Hackbridge Go-Ahead London 81 Slough Hounslow bus station Metroline Temporarily curtailed to Queensmere Shopping Centre in Slough until further notice due to Slough bus station being closed as a result of damage caused by a fire. 83 Alperton Golders Green tube station Metroline 85 Kingston upon Thames Putney Bridge tube station First Bus London 86 Romford railway station Stratford bus station Stagecoach London 87 Aldwych Wandsworth Go-Ahead London Originally numbered 77A until 3 June 2006. 88 Parliament Hill Fields Clapham Common Go-Ahead London Operates as a 24-hour service. 89 Lewisham station Slade Green railway station Go-Ahead London 90 Feltham Northolt tube station Metroline Operated with double-decker buses since 29 August 2015. 91 Crouch End Trafalgar Square Go-Ahead London 92 Ealing Hospital St Raphael's North Metroline 93 North Cheam Putney Bridge tube station Go-Ahead London Operates as a 24-hour service. 94 Acton Green Piccadilly Circus First Bus London Operates as a 24-hour service. 95 Shepherd's Bush Green Southall Town Hall Metroline 96 Bluewater Shopping Centre Woolwich Stagecoach London 97 Chingford railway station Stratford City bus station Stagecoach London 98 Red Lion Square Willesden bus garage Metroline 99 Bexleyheath Shopping Centre Beresford Square Go-Ahead London ===100–199=== Route Start End Operator Notes 100 St Paul's tube station Shadwell railway station Go-Ahead London Operated with electric buses since 18 January 2020. 101 Beckton bus station Wanstead tube station Go-Ahead London 102 Brent Cross bus station Edmonton Green bus station Arriva London Operates as a 24-hour service between Edmonton Green bus station and Golders Green tube station.North London Bus Map Transport for London 103 Chase Cross Rainham railway station Arriva London 104 Beckton bus station Stratford bus station Go-Ahead London 105 Greenford station Heathrow Central bus station First Bus London Operates as a 24-hour service.Night buses in West London Transport for London 106 Finsbury Park bus station Whitechapel Go-Ahead London 107 Edgware bus station New Barnet railway station Metroline Crosses border into Hertfordshire at Elstree & Borehamwood railway station. 108 Lewisham Shopping Centre Stratford International station Go-Ahead London Operates as a 24-hour service. 108D Lewisham Shopping Centre North Greenwich bus station Go-Ahead London Runs only at night. 109 Croydon Brixton tube station Transport UK London Bus 110 Hammersmith bus station Hounslow bus station First Bus London 111 Heathrow Central bus station Cromwell Road bus station Transport UK London Bus Operates as a 24-hour service. 112 North Finchley bus station Ealing Broadway station Metroline 113 Edgware bus station Marble Arch tube station Metroline 114 Mill Hill Broadway railway station Ruislip tube station Metroline 115 Aldgate bus station East Ham Go-Ahead London 116 Ashford Hospital Hounslow bus station First Bus London 117 Staines-upon-Thames West Middlesex University Hospital First Bus London 119 Bromley North railway station Croydon Colonnades Go-Ahead London Operates as a 24-hour service.Buses from Bromley North and Market Square Transport for London 12 September 2015 120 Hounslow bus station Northolt tube station Metroline 121 Enfield Island Village Turnpike Lane bus station Arriva London 122 Crystal Palace bus station Plumstead bus garage Stagecoach London 123 Ilford Wood Green tube station Arriva London Operates as a 24-hour service. 124 St Dunstan's College Eltham Stagecoach London 125 Colindale tube station Winchmore Hill First Bus London 126 Bromley Eltham Go-Ahead London 127 Purley railway station Tooting Broadway tube station Go-Ahead London 128 Claybury Broadway Romford railway station Stagecoach London Operates as a 24-hour service. 129 Lewisham Shopping Centre North Greenwich bus station Go-Ahead London 130 New Addington Thornton Heath Transport UK London Bus 131 Fairfield bus station Tooting Broadway tube station Go-Ahead London 132 Bexleyheath Shopping Centre North Greenwich bus station Go-Ahead London 133 Streatham railway station Holborn tube station Transport UK London Bus 134 North Finchley bus station University College Hospital Metroline Operates as a 24-hour service. 135 Cubitt Town Old Street tube station Stagecoach London 136 Elephant and Castle Grove Park railway station Stagecoach London 137 Marble Arch tube station Streatham Hill Arriva London 138 Bromley North railway station Coney Hall Stagecoach London 139 Golders Green tube station London Waterloo station Metroline Operates as a 24-hour service. 140 Harrow Weald bus garage Hayes & Harlington railway station Metroline Withdrawn between Heathrow Central bus station and Hayes & Harlington railway station on 7 December 2019. 141 London Bridge bus station Palmers Green Arriva London 142 Brent Cross bus station Watford Junction railway station Metroline 143 Archway tube station Brent Cross bus station Metroline 144 Edmonton Green bus station Muswell Hill Arriva London 145 Dagenham Leytonstone bus station Stagecoach London 146 Bromley North railway station Downe Stagecoach London 147 Canning Town bus station Ilford Go-Ahead London 148 Camberwell Green White City bus station First Bus London Operates as a 24-hour service. 149 Edmonton Green bus station London Bridge bus station Arriva London Operates as a 24-hour service. 150 Becontree Heath Chigwell Row Arriva London 151 Wallington Worcester Park railway station Go-Ahead London 152 New Malden Pollards Hill Go-Ahead London 153 Finsbury Park bus station Liverpool Street bus station Metroline 154 Morden tube station West Croydon bus station Go-Ahead London 155 Elephant and Castle St George's Hospital Go- Ahead London 156 Vauxhall bus station Wimbledon station Transport UK London Bus 157 Crystal Palace bus station Morden tube station Go-Ahead London 158 Chingford Mount Stratford bus station Arriva London Operates as a 24-hour service. 159 Oxford Circus Streatham railway station Transport UK London Bus Operates as a 24-hour service. 160 Catford Bridge railway station Sidcup railway station Stagecoach London 161 Chislehurst North Greenwich bus station Stagecoach London 162 Beckenham Junction station Eltham railway station Go- Ahead London 163 Morden tube station Wimbledon Go-Ahead London 164 Wimbledon Sutton railway station Go-Ahead London 165 Rainham The Brewery Stagecoach London 166 Banstead Epsom Hospital (once per hour) West Croydon bus station Arriva London 167 Ilford Loughton tube station Stagecoach London 169 Barking Clayhall Stagecoach London 170 Roehampton London Victoria station Go-Ahead London 171 Elephant and Castle Catford bus garage Go-Ahead London Ran to Holborn tube station until 15 June 2019. 172 Brockley Rise Aldwych Go-Ahead London Ran to Clerkenwell Green until 15 June 2019. 173 Beckton bus station King George Hospital Stagecoach London 174 Beam Park Harold Hill Stagecoach London 175 Dagenham Hillrise Estate Arriva London 176 Penge Tottenham Court Road station Go-Ahead London Operates as a 24-hour service. 177 Peckham Thamesmead Stagecoach London 178 Lewisham station Woolwich Go-Ahead London 179 Chingford railway station Ilford Stagecoach London 180 Erith Quarry North Greenwich bus station Stagecoach London 181 Grove Park railway station Lewisham station Stagecoach London 182 Brent Cross bus station Harrow Weald Metroline 183 Golders Green tube station Pinner tube station First Bus London 184 Chipping Barnet Turnpike Lane bus station Go-Ahead London 185 Lewisham station London Victoria station Go-Ahead London 186 Brent Cross bus station Northwick Park Hospital Metroline 187 O2 Centre Central Middlesex Hospital Metroline 188 North Greenwich bus station Tottenham Court Road station Go-Ahead London Operates as a 24-hour service. 189 Brent Cross bus station Marble Arch tube station Metroline Operates as a 24-hour service. 190 Richmond bus station Empress State Building Metroline 191 Brimsdown railway station Edmonton Green bus station Arriva London 192 Enfield Town Tottenham Hale bus station Arriva London 193 County Park Estate Queen's Hospital Stagecoach London 194 Lower Sydenham West Croydon bus station Arriva London 195 Brentford Charville Lane Estate Transport UK London Bus 196 Elephant and Castle Norwood Junction railway station Transport UK London Bus 197 Fairfield Halls Peckham Go-Ahead London 198 Shrublands Thornton Heath Arriva London 199 Canada Water bus station Catford bus garage Stagecoach London ===200–299=== Route Start End Operator Notes 200 Mitcham Raynes Park Go-Ahead London 201 Herne Hill railway station Morden tube station Transport UK London Bus 202 Crystal Palace bus station Blackheath Arriva London 203 Staines-upon-Thames Hounslow bus station First Bus London 204 Edgware bus station Sudbury Town tube station Metroline 205 Bow Church Paddington Stagecoach London 206 Kilburn Park tube station Wembley Park Metroline 207 Hayes Bypass White City bus station Transport UK London Bus 208 Lewisham station Orpington Go-Ahead London 209 Mortlake Castelnau Go-Ahead London Temporarily withdrawn between Castelnau and Hammersmith bus station until further notice due to the closure of Hammersmith Bridge. 210 Brent Cross bus station Finsbury Park bus station Metroline 211 Hammersmith bus station Battersea Power Station tube station Transport UK London Bus Re-routed from Waterloo to Battersea Power Station on 29 June 2024. 212 Chingford railway station St. James Street railway station Go-Ahead London 213 Fairfield bus station Sutton bus garage Go-Ahead London Operates as a 24-hour service.Night buses in South West London Transport for London 9 January 2016Buses from Sutton Transport for London 12 September 2015 214 Highgate Village Finsbury Square Go-Ahead London Operates as a 24-hour service. 215 Walthamstow bus station Lee Valley Campsite Stagecoach London 216 Cromwell Road bus station Staines-upon-Thames First Bus London 217 Turnpike Lane bus station Waltham Cross Go-Ahead London 218 North Acton Hammersmith bus station First Bus London Introduced on 7 December 2019 with a peak frequency of every 10 minutes. 219 Clapham Junction Wimbledon Go-Ahead London 220 Southside Wandsworth Willesden Junction station First Bus London Operates as a 24-hour service. 221 Edgware bus station Turnpike Lane bus station Arriva London 222 Uxbridge tube station Hounslow bus station Metroline Operates as a 24-hour service. 223 Harrow View Wembley Central station Metroline 224 St Raphael's Estate Alperton First Bus London 225 Canada Water bus station Hither Green railway station Stagecoach London 226 Ealing Broadway station Golders Green tube station First Bus London 227 Crystal Palace bus station Bromley North railway station Go-Ahead London 228 Central Middlesex Hospital Maida Hill Metroline 229 Queen Mary's Hospital Thamesmead Arriva London 230 Upper Walthamstow Wood Green tube station Go- Ahead London 231 Enfield Chase railway station Turnpike Lane bus station Metroline 232 St Raphael's Estate Turnpike Lane bus station Go-Ahead London 233 Eltham railway station Swanley Go-Ahead London 234 The Spires Barnet Archway tube station Metroline 235 North Brentford Sunbury Village First Bus London 236 Finsbury Park bus station Hackney Wick Stagecoach London 237 Hounslow Heath White City bus station Metroline 238 Barking station Stratford bus station Stagecoach London Operates as a 24-hour service. 240 Edgware bus station Golders Green tube station Metroline 241 Royal Wharf Stratford City bus station Stagecoach London 242 Homerton University Hospital Aldgate bus station Stagecoach London 243 London Waterloo station Wood Green tube station Arriva London Operates as a 24-hour service. 244 Abbey Wood Queen Elizabeth Hospital Go-Ahead London 245 Alperton Golders Green tube station Metroline 246 Bromley North railway station Westerham Chartwell (8 buses on Summer Sundays) Stagecoach London 247 Barkingside tube station Romford railway station Stagecoach London 248 Cranham Romford Market Arriva London 249 Anerley railway station Clapham Common Arriva London 250 West Croydon bus station Brixton tube station Arriva London 251 Arnos Grove tube station Edgware bus station Metroline 252 Collier Row Hornchurch Stagecoach London 253 Euston bus station Hackney Central railway station Arriva London 254 Aldgate bus station Holloway Arriva London 255 Balham station Pollards Hill Arriva London 256 Hornchurch Noak Hill Stagecoach London 257 Stratford bus station Walthamstow bus station Stagecoach London 258 South Harrow tube station Watford Junction railway station Metroline 259 Edmonton Green bus station King's Cross Arriva London 260 Golders Green tube station White City bus station Metroline 261 Lewisham station Princess Royal University Hospital Stagecoach London 262 Gallions Reach Shopping Park Stratford bus station Go-Ahead London 263 Barnet Hospital Highbury Barn Metroline 264 West Croydon bus station St George's Hospital Go-Ahead London Operates as a 24-hour service.Night buses in south London Transport for London 29 March 2014 265 Putney Bridge tube station Tolworth Go-Ahead London 266 Brent Cross bus station Acton Metroline 267 Fulwell Hammersmith bus station Transport UK London Bus 268 O2 Centre Golders Green tube station Metroline 269 Bexleyheath Shopping Centre Bromley North railway station Go-Ahead London 270 Mitcham Putney Bridge tube station Transport UK London Bus 272 Shepherd's Bush Green Chiswick First Bus London 273 Lewisham Petts Wood railway station Stagecoach London 274 Angel Islington Lancaster Gate tube station Metroline 275 Barkingside St. James Street railway station Stagecoach London Crosses border into Essex in Chigwell. 276 Newham University Hospital Stoke Newington Common Stagecoach London 277 Cubitt Town Dalston Stagecoach London 278 Heathrow Central bus station Ruislip tube station Transport UK London Bus Introduced on 7 December 2019. 279 Manor House tube station Waltham Cross Arriva London 280 St George's Hospital Belmont railway station Go-Ahead London 281 Hounslow bus station Tolworth railway station First Bus London Operates as a 24-hour service. 282 Ealing Hospital Mount Vernon Hospital Metroline 283 East Acton Hammersmith bus station First Bus London 284 Lewisham station Grove Park Cemetery Stagecoach London 285 Heathrow Central bus station Kingston upon Thames Transport UK London Bus Operates as a 24-hour service. 286 Cutty Sark Queen Mary's Hospital Go-Ahead London 287 Barking station Rainham Stagecoach London 288 Broadfields Estate Queensbury First Bus London 289 Elmers End station Purley railway station Arriva London 290 Staines-upon-Thames Twickenham First Bus London 291 Queen Elizabeth Hospital Woodlands Estate Go- Ahead London 292 Borehamwood Colindale Metroline 293 Morden tube station Epsom Hospital First Bus London 294 Havering Country Park Noak Hill Stagecoach London 295 Clapham Junction railway station Ladbroke Grove First Bus London Operates as a 24-hour service. 296 Ilford Romford railway station Stagecoach London 297 Ealing Broadway station Willesden bus garage Metroline Operates as a 24-hour service. 298 Arnos Grove tube station Potters Bar railway station Uno Withdrawn between Potters Bar and Potters Bar railway station on 13 November 2017. 299 Muswell Hill Cockfosters tube station Go-Ahead London ===300–399=== Route Start End Operator Notes 300 Canning Town bus station East Ham Go-Ahead London 301 Bexleyheath Shopping Centre Beresford Square Arriva London Introduced on 13 July 2019. 302 Mill Hill Broadway railway station Kensal Rise railway station Metroline 303 Kingsbury Edgware bus station First Bus London 304 Manor Park Custom House station Go-Ahead London Introduced on 21 May 2022 in preparation for the Elizabeth line. 306 Acton Vale Sands End Transport UK London Bus Introduced on 7 December 2019 with a peak frequency of every 12 minutes. 307 Barnet Hospital Brimsdown railway station Arriva London 308 Clapton Pond Wanstead Stagecoach London 309 Bethnal Green Canning Town bus station Stagecoach London 310 Golders Green tube station Stamford Hill Stagecoach London Introduced on 1 September 2024, intended to benefit local Jewish communities in the two areas. 312 Norwood Junction railway station Purley Arriva London 313 Chingford railway station Enfield bus garage (schoolday journeys to and from Dame Alice Owen's School) Potters Bar railway station Dame Alice Owen's School (schoolday journeys to and from Enfield bus garage) Arriva London 314 New Addington tram stop Eltham railway station Stagecoach London 315 Balham station West Norwood Transport UK London Bus 316 Brent Cross West railway station White City bus station Metroline 317 Enfield Town Waltham Cross Metroline 318 North Middlesex University Hospital Stamford Hill Arriva London 319 Sloane Square Streatham Hill Arriva London 320 Biggin Hill Valley Catford Bridge railway station Go-Ahead London 321 Foots Cray New Cross Go- Ahead London Operates as a 24-hour service. 322 Crystal Palace bus station Clapham Common Transport UK London Bus 323 Canning Town bus station Mile End tube station Stagecoach London 324 Brent Cross Elstree Metroline 325 East Beckton Prince Regent DLR station Go-Ahead London 326 The Spires Barnet Brent Cross bus station First Bus London 327 Waltham Cross Circular via Elsinge Estate & Turkey Street railway station Metroline 328 World's End Golders Green tube station Metroline 329 Enfield Town Turnpike Lane bus station Arriva London 330 Pontoon Dock Wanstead Park railway station Stagecoach London 331 Uxbridge tube station Ruislip tube station Metroline Runs via Harefield. Crosses border into Hertfordshire at Batchworth Heath and into Buckinghamshire at Denham railway station. 333 Elephant and Castle Tooting Broadway tube station Go-Ahead London 335 Kidbrooke North Greenwich bus station Arriva London Introduced on 26 October 2019. 336 Catford Bridge railway station Locksbottom Stagecoach London 337 Clapham Junction Richmond bus station Go- Ahead London 339 Leytonstone bus station Shadwell DLR station Stagecoach London 340 Edgware bus station Harrow bus station First Bus London 341 London Waterloo station Meridian Water railway station Arriva London Operates as a 24-hour service. 343 Tower Gateway DLR station New Cross Gate Go-Ahead London 344 Clapham Junction railway station Liverpool Street bus station Transport UK London Bus Operates as a 24-hour service. 345 Peckham Natural History Museum Transport UK London Bus Operates as a 24-hour service. 346 Upminster Park Estate Harold Hill Stagecoach London 349 Enfield bus garage Stamford Hill Arriva London 350 Hayes Heathrow Terminal 5 Transport UK London Bus 352 Bromley North railway station Lower Sydenham Go-Ahead London 353 Forestdale Ramsden Go-Ahead London 354 Bromley North railway station Penge Go-Ahead London 355 Mitcham Brixton tube station Go-Ahead London 356 Shirley Upper Sydenham Stagecoach London 357 Chingford Hatch Whipps Cross Whipps Cross University Hospital (Sundays only) Go-Ahead London 358 Crystal Palace bus station Orpington railway station Go-Ahead London 359 Addington Village Interchange Purley Go-Ahead London 360 Elephant and Castle Royal Albert Hall Go-Ahead London 362 King George Hospital Grange Hill tube station Stagecoach London 363 Crystal Palace bus station Elephant and Castle Transport UK London Bus 364 Dagenham East Ilford Go-Ahead London 365 Beam Park Havering Country Park Stagecoach London Operates as a 24-hour service. 366 Beckton bus station Redbridge Go-Ahead London 367 West Croydon bus station Bromley North railway station Transport UK London Bus 368 Barking Chadwell Heath Go-Ahead London 370 Romford Lakeside Shopping Centre Arriva London 371 Richmond Kingston upon Thames First Bus London 372 Hornchurch Lakeside Shopping Centre Stagecoach London Partially replaced former route 324 that ran between Hornchurch and Bluewater Shopping Centre. 375 Romford railway station Passingford Bridge Arriva London Partially replaced commercial routes 500 and 575. 376 Beckton bus station Newham Town Hall Go-Ahead London 377 Enfield bus garage Oakwood tube station Arriva London 378 Mortlake Putney Bridge Go-Ahead London 379 Chingford railway station Yardley Lane Estate Stagecoach London 380 Lewisham Shopping Centre Belmarsh Prison Stagecoach London 381 County Hall Peckham Transport UK London Bus 382 Southgate tube station Mill Hill East Metroline 383 The Spires Barnet Finchley Memorial Hospital Uno 384 Edgware bus station Cockfosters tube station Metroline 385 Chingford railway station Salisbury Hall Stagecoach London 386 Blackheath Village Woolwich Arsenal station Go-Ahead London 388 London Bridge bus station Stratford City bus station Stagecoach London 389 The Spires Barnet Circular via High Barnet tube station Go-Ahead London 390 Victoria bus station Archway tube station Metroline Operates as a 24-hour service. 393 Chalk Farm Clapton Pond Metroline 394 Islington Homerton University Hospital Stagecoach London 395 Greenford Harrow bus station First Bus London 396 Ilford King George Hospital Go-Ahead London 397 Salisbury Hall Debden Stagecoach London 398 Ruislip tube station Wood End First Bus London 399 The Spires Barnet Circular via Hadley Wood railway station Go-Ahead London ===400–499=== Route Start End Operator Notes 401 Bexleyheath Shopping Centre Thamesmead Go-Ahead London 403 Warlingham West Croydon bus station Go-Ahead London 404 Caterham on the Hill Coulsdon Transport UK London Bus 405 Croydon Redhill Arriva London 406 Epsom Epsom Hospital (schoolday journeys) Cromwell Road bus station First Bus London 407 Sutton Caterham Valley Transport UK London Bus 410 Crystal Palace bus station Wallington Arriva London Frequency reduced from a bus every 9 minutes to a bus every 10 minutes on 30 June 2018. 411 Cromwell Road bus station West Molesey First Bus LondonShort Hops Buses issue 765 December 2018 page 23 412 Croydon Purley Arriva London 413 Morden tube station Sutton bus garage Go- Ahead London 415 Old Kent Road Tulse Hill railway station Transport UK London Bus 417 Crystal Palace bus station Clapham Common Arriva London 418 Cromwell Road bus station Epsom First Bus London 419 Roehampton Richmond bus station First Bus London 422 Bexleyheath Shopping Centre North Greenwich bus station Stagecoach London 423 Heathrow Terminal 5 Hounslow bus station First Bus London 424 Putney Heath Fulham Go-Ahead London 425 Clapton Ilford Stagecoach London 427 Southall Uxbridge Transport UK London Bus 428 Erith Bluewater Shopping Centre Arriva London 430 Victoria and Albert Museum Roehampton Go- Ahead London 432 Anerley railway station Brixton tube station Arriva London 433 Croydon Addington Village Interchange Transport UK London Bus Originally numbered T33 until 24 October 2015. 434 Coulsdon Caterham Valley Go-Ahead London 436 Battersea Park railway station Lewisham Shopping Centre Go-Ahead London 439 Waddon Marsh tram stop Whyteleafe South Go-Ahead London 440 Wembley Turnham Green Church First Bus London 444 Turnpike Lane bus station Chingford railway station Go-Ahead London 450 Lower Sydenham West Croydon bus station Go-Ahead London 452 Ladbroke Grove Vauxhall bus station First Bus London 453 Marylebone station Deptford Bridge DLR station Go-Ahead London Operates as a 24-hour service. 456 North Middlesex University Hospital Crews Hill Go-Ahead London 460 North Finchley bus station Willesden bus garage Metroline 462 Ilford Hainault Stagecoach London Crosses border into Essex at Grange Hill tube station. 463 Pollards Hill Coulsdon South railway station Go-Ahead London 464 Tatsfield New Addington tram stop Transport UK London Bus 465 Cromwell Road bus station Dorking Transport UK London Bus 466 Caterham on the Hill Oasis Academy Coulsdon (schoolday journeys) Addington Village Interchange Arriva London 467 Hook Hinchley Wood School (schoolday journeys from Epsom) Epsom Epsom Hospital (schoolday journeys from Hook) First Bus London 468 Elephant and Castle South Croydon Arriva London 469 Queen Elizabeth Hospital Erith Go- Ahead London 470 Colliers Wood tube station Sutton railway station Go-Ahead London 472 North Greenwich bus station Abbey Wood railway station Stagecoach London Operates as a 24-hour service. 473 Stratford bus station North Woolwich Go-Ahead London 474 Canning Town Manor Park railway station Stagecoach London Operates as a 24-hour service. 476 Northumberland Park railway station London King's Cross railway station Go-Ahead London 481 West Middlesex University Hospital Cromwell Road bus station Metroline 481D Whitton Cromwell Road bus station Transport UK London Bus Schoolday journeys only. 482 Southall Town Hall Heathrow Terminal 5 Transport UK London Bus 483 Harrow bus station Windmill Park Metroline 484 Camberwell Green Lewisham station Go-Ahead London 485 Southside Wandsworth Castelnau Go-Ahead London Temporarily withdrawn between Castelnau and Hammersmith bus station until further notice due to the closure of Hammersmith Bridge. Route serves the WWT London Wetland Centre in both directions during opening hours. 486 Bexleyheath Shopping Centre North Greenwich bus station Go-Ahead London Operates as a 24-hour service. 487 Willesden Junction station South Harrow tube station Metroline 488 Bromley-by-Bow Dalston Stagecoach London 490 Pools on the Park Heathrow Terminal 5 Transport UK London Bus 491 North Middlesex University Hospital Waltham Cross Metroline 492 Bluewater Shopping Centre Sidcup railway station Arriva London 493 St George's Hospital Richmond bus station Go-Ahead London 496 Queen's Hospital Harold Wood Stagecoach London 498 Queen's Hospital Brentwood Stagecoach London Introduced on 26 December 2005. 499 Gallows Corner loop service via Heath Park Estate Stagecoach London ===500–599=== Route Start End Operator Notes 533 Hammersmith bus station Castelnau Go-Ahead London A temporary route replacing routes 33, 72, 209 and 485 until further notice due to the closure of Hammersmith Bridge ===600–699=== Route numbers from 600 to 699 are used for school services, with the majority of them running one return journey on each weekday during peak times and during school term time. Route Start End Schools Operator Notes 601 Thamesmead Wilmington Academy Wilmington Academy Go-Ahead London 602 Thamesmead Townley Grammar School Townley Grammar School Stagecoach London 603 Swiss Cottage tube station Muswell Hill N/A Metroline 605 Burnt Oak tube station Totteridge & Whetstone tube station Mill Hill County High School Metroline 606 Queensbury tube station The Totteridge Academy The Totteridge Academy Queen Elizabeth's School, Barnet Metroline 608 Gallows Corner Shenfield High School Shenfield High School Go-Ahead London 612 Selsdon Wallington County Grammar School Wallington County Grammar School Riddlesdown Collegiate The John Fisher School Wallington High School for Girls Arriva London 613 Tolworth railway station Glenthorne High School Glenthorne High School First Bus London 616 Winchmore Hill Edmonton Green bus station The Latymer School Stagecoach London 617 Turnpike Lane bus station Turkey Street railway station St Ignatius College Metroline 618 Ivybridge Osterley Bolder Academy Transport UK London Bus Introduced on 2 September 2024. 621 Lewisham station Stationers' Crown Woods Academy Stationers' Crown Woods Academy Stagecoach London 624 Grove Park railway station Stationers' Crown Woods Academy Welling (1 bus eastbound only) Stationers' Crown Woods Academy Go-Ahead London 625 Plumstead Common Chislehurst N/A Go-Ahead London 626 Finchley Central tube station Dame Alice Owen's School Dame Alice Owen's School Metroline 627 Wallington High School for Girls Worcester Park railway station Wallington High School for Girls Arriva London 628 JFS Southgate tube station JFS Uno Runs one way to Southgate tube station only. 629 Turkey Street railway station Wood Green bus garage St Ignatius College Metroline 631 Golders Green tube station Henrietta Barnett School Henrietta Barnett School Metroline 632 Grahame Park Kilburn Park tube station St James' Catholic High School Metroline 633 Pollards Hill Coulsdon South railway station Woodcote High School Go-Ahead London 634 Muswell Hill Chipping Barnet Queen Elizabeth's School, Barnet Metroline 635 St Paul's College Hounslow bus station St Paul's College Metroline 638 Coney Hall Kemnal Technology College Chislehurst School for Girls Kemnal Technology College Coopers School Eltham College Stagecoach London 639 Roehampton St John Bosco College St John Bosco College Transport UK London Bus 640 South Harrow tube station Bentley Wood High School Whitmore High School Salvatorian College Sacred Heart Language College Bentley Wood High School Metroline 642 West Hendon London Academy London Academy Metroline 643 Brent Cross bus station Christ's College Finchley Christ's College Finchley Uno 645 Purley Cross Waddon N/A Arriva London Introduced on 4 January 2022 to replace route 405D. 646 Noak Hill Cranham Redden Court School, Havering College of Further and Higher Education, Havering Sixth Form College, Sacred Heart of Mary Girls' School, Coopers' Company and Coborn School, Hall Mead School Go-Ahead London 649 Romford bus garage The Campion School The Campion School Go-Ahead London 650 Romford bus garage Emerson Park Academy Emerson Park Academy Go-Ahead London 651 Romford railway station Chase Cross Bower Park Academy Go-Ahead London 652 Rainham Upminster station Sanders Draper School Havering Sixth Form College The Brittons Academy Harris Academy Rainham Go-Ahead London 653 JFS Muswell Hill JFS Uno 654 Addington Village Interchange Ramsden Harris Academy Orpington Ravens Wood School Go-Ahead London 655 Mitcham Raynes Park High School Raynes Park High School Transport UK London Bus 656 Gallows Corner Emerson Park Academy Emerson Park Academy Go-Ahead London 657 Salisbury Hall Bancroft's School Trinity Catholic High School Bancroft's School Stagecoach London 658 Woolwich Arsenal station Stationers' Crown Woods Academy Stationers' Crown Woods Academy Go-Ahead London 660 Stationers' Crown Woods Academy Catford bus garage Stationers' Crown Woods Academy Stagecoach London 661 Chislehurst Petts Wood railway station Eltham College Coopers School Stagecoach London 662 Surbiton railway station Holy Cross School Holy Cross School First Bus London 663 Thornton Heath railway station Harris Academy Purley Harris Academy Purley Go-Ahead London 664 New Addington Charles Darwin School Charles Darwin School Ravens Wood School Go-Ahead London 665 Surbiton Holy Cross School Holy Cross School First Bus London 667 Ilford West Hatch High School West Hatch High School Stagecoach London 669 Thamesmead Cleeve Park School Cleeve Park School Stagecoach London 670 Roehampton St John Bosco College St John Bosco College Transport UK London Bus 671 Chessington South railway station Tiffin Girls' School Tiffin Girls' School Transport UK London Bus 672 Thamesmead Beresford Square Hawksmoor Primary School Stagecoach London 673 The Warren School Beckton bus station The Warren School Stagecoach London Runs one way to Beckton bus station only. 674 Romford railway station Harold Hill Royal Liberty School Stagecoach London 675 St. James Street railway station Woodbridge High School Woodbridge High School Arriva London 677 Ilford Debden Davenant Foundation School Go-Ahead London 678 Beckton bus station Forest Gate railway station St Angela's Ursuline School St Bonaventure's Forest Gate Community School Stratford School Stagecoach London 679 Goodmayes Woodford Wells Woodford County High School For Girls Trinity Catholic High School Bancroft's School Go-Ahead London 681 Hounslow bus station Teddington School Teddington School First Bus London 683 Friern Barnet JFS JFS Uno 684 Orpington railway station Charles Darwin School Charles Darwin School Stagecoach London 685 Warlingham School Selsdon Warlingham School Riddlesdown Collegiate Arriva London Runs one way to Selsdon only. 686 Romford railway station St Edward's Church of England Academy St Edward's Church of England Academy Go-Ahead London Afternoon journeys from St Edward's Church of England Academy terminate at Harold Hill. 687 Dagenham Park Church of England School Barking station Dagenham Park Church of England School Go-Ahead London 688 Southgate tube station JFS JFS Uno 689 West Croydon bus station Monks Orchard Orchard Park High School Arriva London 690 Burntwood School Norwood bus garage Burntwood School Go-Ahead London 696 Hayes Bishop Ramsey School Bishop Ramsey School First Bus London 697 The Douay Martyrs School Hayes End The Douay Martyrs School First Bus London Morning journeys from Hayes End terminate at Ickenham tube station. 698 The Douay Martyrs School West Drayton The Douay Martyrs School First Bus London Morning journeys from West Drayton terminate at Ickenham tube station. 699 Winchmore Hill Dame Alice Owen's School Dame Alice Owen's School Uno ===900–999=== Route numbers from 900 to 999 represent mobility buses; these mostly provide a once-a-week return journey to a local shopping centre from relatively low-density neighbourhoods where there is no alternative route in the main bus network. The number of mobility buses routes has declined over the past few years because low-floor and wheelchair-accessible buses run on all London Buses routes. Route Start End Operator Notes 969 Whitton Roehampton Vale Transport UK London Bus Operates one return journey on Tuesdays and Fridays only. ===Letter prefixes=== Route Start End Operator Letter code Notes A10 Uxbridge tube station Heathrow Central bus station Metroline Heathrow Airport B11 Bexleyheath bus garage South Thamesmead Go-Ahead London Bexleyheath B12 Erith Joyden's Wood Go-Ahead London Bexleyheath Runs in a loop in Joyden's Wood via Dartford Road, Old Bexley Lane, Oakfield Lane, Leyton Cross Road, Birchwood Road, Summerhouse Drive, Tile Kiln Lane and Baldwyn's Park, exiting the loop at the junction with Baldwyn's Park and Dartford Road. Runs the loop in reverse after 12:00. B13 Bexleyheath Shopping Centre New Eltham railway station Go-Ahead London Bexleyheath B14 Bexleyheath Shopping Centre Orpington railway station Stagecoach London Bexleyheath B15 Bexleyheath Shopping Centre Horn Park Arriva London Bexleyheath B16 Bexleyheath bus garage Kidbrooke Go- Ahead London Bexleyheath C1 London Victoria station White City bus station First Bus London Central London C3 Clapham Junction railway station Earl's Court Transport UK London Bus Chelsea C10 London Victoria station Canada Water bus station Transport UK London Bus Central London C11 Archway tube station Brent Cross bus station Metroline Cricklewood D3 Bethnal Green Leamouth Go- Ahead London London Docklands D6 Ash Grove bus garage Cubitt Town Stagecoach London London Docklands D7 Mile End tube station All Saints Church Stagecoach London London Docklands D8 Cubitt Town Stratford bus station Stagecoach London London Docklands E1 Ealing Broadway station Greenford Broadway Metroline Ealing E2 Brentford Greenford Broadway Metroline Ealing E3 Chiswick Greenford Broadway First Bus London Ealing E5 Perivale Southall Transport UK London Bus Dormers Wells E6 Bulls Bridge Greenford station Transport UK London Bus Yeading E7 Ealing Broadway station Ruislip tube station Transport UK London Bus Ealing Runs via Wood Lane in Ruislip during shopping hours. E8 Ealing Broadway station Hounslow Metroline Ealing E9 Ealing Broadway station Yeading Metroline Ealing E10 Ealing Broadway station Northolt Transport UK London Bus Ealing E11 Ealing Common Greenford Broadway Transport UK London Bus Ealing G1 Shaftesbury Park Estate Norbury Go-Ahead London St George's Hospital H2 Golders Green tube station Circular via Hampstead Garden Suburb Metroline Hampstead Garden Suburb H3 East Finchley Golders Green tube station Metroline Hampstead Garden Suburb H9 Northwick Park Hospital (circular) anticlockwise via Kenton station First Bus London Harrow H10 Northwick Park Hospital (circular) clockwise via South Harrow tube station First Bus London Harrow H11 Harrow bus station Mount Vernon Hospital First Bus London Harrow H12 South Harrow tube station Stanmore tube station First Bus London Hatch End H13 Northwood Hills Ruislip Lido Metroline Ruislip H14 Northwick Park Hospital Hatch End First Bus London Harrow H17 Harrow bus station Wembley Central station Metroline Harrow H18 Harrow bus station (circular) clockwise via North Harrow First Bus London Harrow H19 Harrow bus station (circular) anticlockwise via Kenton station First Bus London Harrow Route terminates at St George's Shopping Centre instead of Harrow bus station. H20 Hounslow Ivybridge Transport UK London Bus Hounslow H22 Hounslow West Middlesex University Hospital First Bus London Hounslow H25 Hanworth Hatton Cross tube station Transport UK London Bus Hatton H26 Feltham Hatton Cross tube station Transport UK London Bus Hatton H28 Bulls Bridge Osterley Transport UK London Bus Hounslow H32 Southall Town Hall Hounslow bus station Transport UK London Bus Hounslow H37 Richmond Hounslow First Bus London Hounslow H91 Hammersmith bus station Hounslow West tube station Metroline Hounslow H98 Hayes End Hounslow bus station First Bus London Hounslow K1 Cromwell Road bus station New Malden railway station First Bus London Kingston upon Thames K2 Kingston Hospital Hook First Bus London Kingston upon Thames K3 Roehampton Vale Esher First Bus London Kingston upon Thames K4 Mansfield Park Estate Kingston Hospital First Bus London Kingston upon Thames K5 Morden tube station Ham First Bus London Kingston upon Thames P4 Lewisham station Brixton tube station Go-Ahead London Dulwich P5 Elephant and Castle Patmore Estate Transport UK London Bus Clapham P12 Surrey Quays Shopping Centre Brockley Rise Go-Ahead London Peckham P13 New Cross Streatham railway station Transport UK London Bus Peckham R1 Green Street Green St Paul's Cray Go-Ahead London Orpington R2 Orpington Biggin Hill Valley Go-Ahead London Orpington R3 Princess Royal University Hospital Orpington railway station Go-Ahead London Orpington R4 Princess Royal University Hospital Paul's Cray Hill Go-Ahead London Orpington R5 Orpington railway station (circular) clockwise via Knockholt and Cudham Go-Ahead London Orpington R7 Chelsfield Village Chislehurst Go-Ahead London Orpington R8 Orpington railway station Biggin Hill Go-Ahead London Orpington R9 Orpington railway station loop service via Ramsden Go-Ahead London Orpington R10 Orpington railway station (circular) anticlockwise via Cudham and Knockholt Go-Ahead London Orpington R11 Green Street Green Queen Mary's Hospital Go- Ahead London Orpington R68 Hampton Court railway station Kew Transport UK London Bus Richmond R70 Richmond Hampton Transport UK London Bus Richmond S1 Lavender Fields Banstead Go-Ahead London Sutton S2 St Helier railway station Epsom Go-Ahead London Sutton S3 Belmont railway station Malden Manor railway station Transport UK London Bus Sutton S4 Sutton Waddon Marsh Transport UK London Bus Sutton U1 Ruislip tube station West Drayton railway station Metroline Uxbridge U2 Uxbridge tube station Brunel University Metroline Uxbridge Runs via Hillingdon tube station. U3 Uxbridge tube station Heathrow Central bus station Metroline Uxbridge U4 Uxbridge tube station Hayes Metroline Uxbridge U5 Uxbridge Hayes Transport UK London Bus Uxbridge U7 Uxbridge tube station Hayes Transport UK London Bus Uxbridge U9 Uxbridge tube station Harefield Hospital Transport UK London Bus Uxbridge U10 Uxbridge tube station Ruislip Metroline Uxbridge W3 Finsbury Park bus station Northumberland Park railway station Arriva London Wood Green W4 Oakthorpe Park Tottenham Hale Arriva London West Green W5 Archway tube station Harringay Stagecoach London Crouch End W6 Southgate tube station Edmonton Green bus station Arriva London Palmers Green W7 Finsbury Park bus station Muswell Hill Metroline Crouch End W8 Lee Valley Leisure Complex Chase Farm Hospital Metroline Enfield Town W9 Southgate tube station Chase Farm Hospital Metroline Enfield Town W11 Walthamstow bus station Chingford Hall Estate Stagecoach London Walthamstow W12 Walthamstow Woodford Bridge Stagecoach London Walthamstow W13 Leyton Mills Woodford Wells Stagecoach London Woodford W14 Whipps Cross Loughton tube station Stagecoach London Woodford W15 Hackney Town Hall Higham Hill Go-Ahead London Walthamstow W16 Leytonstone bus station Chingford Mount Stagecoach London Highams Park W19 Walthamstow Ilford Stagecoach London Walthamstow ===East London Transit routes (EL-prefixed)=== Route Start End Operator Notes EL1 Barking Riverside Ilford Go-Ahead London Operates as a 24-hour service. Originally numbered 369 until 20 February 2010. EL2 Becontree Heath Dagenham Dock Go-Ahead London EL3 Barking Riverside Little Heath Go-Ahead London Originally numbered 387 until 18 February 2017. ===Superloop routes (SL- prefixed)=== Route Start End Operator Notes SL1 North Finchley bus station Walthamstow bus station Arriva London SL2 Walthamstow bus station North Woolwich Arriva London SL3 Thamesmead Bromley North railway station Stagecoach London SL5 Bromley North railway station Croydon Arriva London SL6 Russell Square West Croydon bus station Arriva London Runs non-stop between Waterloo and West Norwood. Runs only on weekdays during peak hours only. Runs towards Russell Square in the morning peak, and runs towards West Croydon bus station in the evening peak. SL7 West Croydon bus station Heathrow Central bus station Go-Ahead London SL8 Uxbridge tube station White City bus station Metroline SL9 Heathrow Central bus station Harrow bus station First Bus London SL10 Harrow bus station North Finchley bus station First Bus London ===Night only routes (N-prefixed)=== Night Bus routes are often related to the day numerical equivalent, normally running the same route but with an extension at either end of the service. This is normally to provide a night service to destinations served by tube or train during the day. However, there are a few N-prefixed route numbers that have no relation to their daytime equivalents: the N5, N20, and N97 all operate in a different part of London to their respective day routes. Also, the N550 and N551 (which provide night service on parts of the DLR network), and the N271 (whose daytime service was withdrawn on 4 February 2023) have no corresponding daytime routes. There are also 24-hour routes, which run day and night but usually with a lower frequency during the night hours. The vast majority run the same route at all times. With the introduction of the Night Tube, some day routes have been extended to run during Friday and Saturday nights to serve the stations. Route Start End Operator N1 Thamesmead Tottenham Court Road station Go-Ahead London N2 Crystal Palace bus station Marylebone station Arriva London N3 Bromley North railway station Oxford Circus Transport UK London Bus N5 Edgware bus station Trafalgar Square First Bus London N7 Northolt tube station Oxford Circus Metroline N8 Hainault Oxford Circus Stagecoach London N9 Heathrow Terminal 5 Aldwych Metroline N11 Ealing Broadway station Whitehall Go-Ahead London N15 Romford Market Oxford Circus Go-Ahead London N18 Harrow Weald bus garage Trafalgar Square First Bus London N19 Clapham Junction railway station Finsbury Park bus station Arriva London N20 Barnet Hospital Trafalgar Square Metroline N21 Bexleyheath Shopping Centre Trafalgar Square Go-Ahead London N22 Fulwell Oxford Circus Go-Ahead London N25 Ilford Oxford Circus Stagecoach London N26 Chingford railway station London Victoria station Stagecoach London N27 Hammersmith bus station Camden Market Transport UK London Bus N28 Camden Town Southside Wandsworth Metroline N29 Enfield Town Trafalgar Square Arriva London N31 Camden Town Clapham Junction railway station Metroline N32 Edgware bus station London Victoria station Metroline N33 Fulwell railway station Hammersmith bus station First Bus London N38 Walthamstow bus station Victoria bus station Arriva London N41 Tottenham Hale bus station Trafalgar Square Arriva London N44 Sutton railway station Aldwych Go-Ahead London N53 Plumstead railway station Whitehall Stagecoach London N55 Woodford Wells Oxford Circus Stagecoach London N63 Crystal Palace bus station London King's Cross railway station Transport UK London Bus N65 Chessington World of Adventures Ealing Broadway station First Bus London N68 Old Coulsdon Tottenham Court Road station Transport UK London Bus N72 East Acton Roehampton First Bus London N73 Walthamstow bus station Oxford Circus Arriva London N74 Roehampton Baker Street tube station Go-Ahead London N83 Ealing Hospital Golders Green tube station Metroline N86 Harold Hill Stratford bus station Stagecoach London N87 Fairfield bus station Aldwych Go-Ahead London N89 Erith Trafalgar Square Go- Ahead London N91 Cockfosters tube station Trafalgar Square Go-Ahead London N97 Hammersmith bus station Trafalgar Square Go-Ahead London N98 Stanmore tube station Holborn Procter Street Metroline N109 Croydon Oxford Circus Transport UK London Bus N113 Edgware bus station Trafalgar Square Metroline N133 Morden tube station Liverpool Street bus station Transport UK London Bus N136 Chislehurst Oxford Circus Go-Ahead London N137 Crystal Palace bus station Oxford Circus Arriva London N140 Harrow Weald bus garage Heathrow Central bus station Metroline N155 Morden tube station Aldwych Go-Ahead London N171 Hither Green railway station Tottenham Court Road station Go-Ahead London N199 St Mary Cray railway station Trafalgar Square Stagecoach London N205 Drapers Field Paddington Stagecoach London N207 Uxbridge tube station Bloomsbury Square Transport UK London Bus N242 Homerton University Hospital Tottenham Court Road station Stagecoach London N250 Brixton Fairfield Halls Arriva London N253 Aldgate bus station Tottenham Court Road station Arriva London N266 Brent Cross bus station Hammersmith bus station First Bus London N271 Finsbury Square Tally Ho Corner Metroline N277 Cubitt Town Angel Islington Stagecoach London N279 Waltham Cross Trafalgar Square Arriva London N343 New Cross Gate Trafalgar Square Go-Ahead London N381 Peckham Whitehall Transport UK London Bus N550 Canning Town bus station Trafalgar Square Stagecoach London N551 Gallions Reach Shopping Park Trafalgar Square Stagecoach London ==Non-TfL bus routes in Greater London== These bus routes are not contracted to TfL and are therefore not 'London Buses', all but three run from villages and towns outside Greater London to destinations within. They are painted in a colour chosen by the operator, so are not necessarily red like London Buses, and most of them do not accept Oyster cards. These routes are operated with a London Service Permit issued by TfL so they are recognised by TfL bus maps and appear on TfL bus stops. Route Start End Operator Source Notes 3 Locksbottom Sevenoaks Go-Coach 3 Slough Uxbridge tube station First Beeline 5 Cippenham Heathrow Terminal 5 Thames Valley Buses 7 Britwell Heathrow Terminal 5 First Beeline Limited early morning trips extend to and from to Heathrow Central bus station. 8 Slough Heathrow Terminal 5 First Beeline 84B Barnet Hospital Potters Bar railway station Central Connect 102 High Wycombe Heathrow Central bus station Carousel Buses 104 High Wycombe Uxbridge Carousel Buses 269 Brentwood Grays NIBS Buses Crosses border into Greater London in North Ockendon. 328 Mount Vernon Hospital Watford Red Rose Travel 346 Mount Vernon Hospital Watford Red Rose Travel 355 Carterhatch Nicholas Breakspear School Sullivan Buses 356 Bush Hill Park Nicholas Breakspear School Sullivan Buses 409 East Grinstead Selsdon Metrobus 411 Reigate Selsdon Metrobus Limited service of one journey per day to Selsdon, all other journeys terminate at Warlingham or Chelsham. 420 Sutton bus garage Crawley Metrobus 429 West Kingsdown Dartford Go-Coach Crosses border into Greater London in Coldblow. 442 Heathrow Terminal 5 Staines-upon-Thames Carlone Limited Limited early morning and late evening buses extend to and from Englefield Green. Special journeys extend to and from Heathrow Central bus station. 446 Hatton Cross tube station Woking railway station White Bus Services 458 Cromwell Road bus station Staines-upon-Thames White Bus Services 461 Cromwell Road bus station St Peter's Hospital Falcon Buses 477 Orpington railway station Bluewater Shopping Centre Arriva Kent Thameside 513 Cromwell Road bus station Downside Reptons Coaches 514 Cromwell Road bus station Weybridge Falcon Buses 515 Cromwell Road bus station Weybridge Falcon Buses 555 Heathrow Central bus station Whiteley Village White Bus Services 581 Uxbridge Higher Denham Carousel Buses 583 Uxbridge Hedgerley Carousel Buses 610 Cockfosters tube station Luton railway station Uno 614 Queensbury tube station Hatfield railway station Uno 644 Queensbury tube station Hatfield railway station Uno 668 North Cheam St Andrew's Catholic School Go-Ahead London 695 Oxted School Westerham Metrobus Crosses border into Greater London in Biggin Hill. 702 Legoland Windsor Resort Green Line Coach Station Reading Buses 703 Bracknell bus station Heathrow Terminal 5 Thames Valley Buses 715 Cromwell Road bus station Guildford Falcon Buses 724 Harlow Heathrow Central bus station Arriva Herts & Essex 820 Sutton bus garage Redhill Metrobus 847 Stratford City bus station Here East Go-Ahead London Runs the Here East shuttle. 849 Roehampton Vale Putney Bridge tube station Go-Ahead London University of Roehampton Shuttle. Only runs on schooldays. Formerly ran to Wimbledon Station. 866 Coulsdon The Beacon School Metrobus A4 Cippenham Heathrow Central bus station First Beeline E16 Epsom Circular via Worcester Park railway station Falcon Buses KU1 Seething Wells Roehampton Vale First Bus London Only runs on schooldays. KU2 Berrylands Circular via Surbiton railway station First Bus London Only runs on schooldays. KU3 Seething Wells Circular via Kingston upon Thames and Surbiton railway station First Bus London Only runs on schooldays. N30 Heathrow Central bus station Acton Diamond South East Night-only route. R1 Maple Cross Mount Vernon Hospital Red Eagle R2 Chorleywood Mount Vernon Hospital Red Eagle R17 Carpenders Park railway station Harrow Arts Centre Red Eagle Only runs on Wednesdays. S3 Orpington Trinity School Go-Coach S32 Kemnal Technology College Trinity School Go-Coach S34 Pratt's Bottom Trinity School Go-Coach X442 Heathrow Terminal 5 Staines-upon-Thames Carlone Limited Limited stop version of route 442, but avoids Ashford Hospital and sections in Stanwell and Stanwell Moor. Also serves the Royal Estate, located south of Staines-upon-Thames. ==Former routes== Route Start End Withdrawal date(s) Notes 9H Kensington High Street Trafalgar Square 25 July 2014 Heritage route that used AEC Routemaster buses. 10 Hammersmith bus station London King's Cross railway station 24 November 2018Route 10 Map Transport for LondonPermanent Bus Changes Transport for London Partially replaced by route 23. 15H Tower Hill tube station Trafalgar Square 14 November 2020 Heritage route that used AEC Routemaster buses. 48 London Bridge bus station Walthamstow bus station 12 October 2019 Replaced by routes 26, 55 and 388. 77A Aldwych Wandsworth 3 June 2006 Renumbered 87. 82 North Finchley bus station Victoria bus station 1 April 2017Route 82 Map Transport for London Replaced by route 13. 87 Barking Romford Market 25 March 2006 Replaced by an extension of route 5. 118 Morden tube station Brixton tube station 1 February 2025 Replaced by route 45. 129 Claybury Broadway Becontree Heath 26 June 2004 Replaced by revised versions of routes 128 and 150. 143D Christ's College Finchley Archway tube station 4 February 2023 Ran schoolday journeys only. 168 Hampstead Heath Old Kent Road 30 September 2023 Replaced by route 1. 239 London Victoria station Clapham Junction 16 February 2008 Replaced by route 170. 271 Finsbury Square Highgate Village 4 February 2023 Replaced by routes 21, 263 and N271. 305 Edgware bus station Kingsbury 1 September 2018 Replaced by route 303. 332 Brent Park London Paddington station 29 April 2023 Replaced by route 16. 347 Romford railway station Ockendon railway station 18 January 2025 Partially replaced by an extension of route 346 351 Bromley North railway station Penge 24 June 2002 Renumbered 354. 369 Ilford Thames View Estate 20 February 2010 Replaced by new routes EL1 and EL2. 374 Romford railway station Harold Hill 14 October 2005 Replaced by route 174. 387 Little Heath Barking Riverside 18 February 2017 Renumbered EL3. 391 Richmond Hammersmith bus station 12 December 2020 Replaced by route 110. 405D Purley West Croydon bus station 4 January 2022 Replaced by route 645. 414 Putney Bridge tube station Marble Arch tube station 22 February 2025 Replaced by routes 14 and 74 455 Purley Wallington railway station 2 March 2024 Replaced by routes 166, 312 and S4. 497 Harold Wood railway station Harold Hill 9 March 2024 Replaced by an extension of route 346. 507 London Waterloo station Victoria bus station 29 April 2023 Replaced by routes 3, 11 and C10. 521 London Bridge bus station London Waterloo station 29 April 2023 Replaced by routes 59 and 133. 530 Holloway Angel tube station 29 October 2017 A temporary route introduced on 16 August 2017 and operated by Go-Ahead London. Created due to works on Upper Street. Ran one way to Angel tube station only. 541 Prince Regent DLR station Keir Hardie Estate 1 June 2012 31 March 2013 30 October 2015 19 February 2016 A temporary route introduced on 3 May 2011, 1 October 2012, 14 September 2013 and 15 February 2016 and operated by Stagecoach London (3 May 2011 until 1 June 2012 and 1 October 2012 until 31 March 2013) and Go- Ahead London (14 September 2013 until 30 October 2015 and 15 February 2015 until 19 February 2016). Created multiple times due to a temporary withdrawal of route 241 between Canning Town bus station and Prince Regent DLR station. 546 Keston Downe 20 December 2024 A temporary route introduced on 18 November 2024 and operated by Ensignbus due to roadworks on Rookery Road and a temporary withdrawal of route 146 between Keston and Downe. 549 Loughton tube station South Woodford tube station 7 September 2024 Replaced by a restructured version of route W14. 558 Seven Sisters station Chingford Mount 28 August 2015 A temporary route introduced on 10 August 2015 and operated by Metroline. Created due to a closure of the Victoria line between Seven Sisters and Walthamstow Central stations. 588 Hackney Wick Stratford City bus station 14 December 2013 A temporary route introduced on 13 July 2013 and operated by Stagecoach London. Was the first bus route to operate through the Queen Elizabeth Olympic Park.Bus route 388 extended to Stratford City Queen Elizabeth Olympic Park 11 December 2013 607 Uxbridge tube station White City bus station 15 July 2023 Renumbered SL8. 609 The Harrodian School Hammersmith bus station 18 May 2019 Morning journeys from Hammersmith bus station terminated at Mortlake. 611 Stonebridge Park station Christ's College Finchley 18 July 2020 Partly replaced by route 112. 618 Mill Hill Broadway railway station Avanti House Secondary School 3 April 2018 619 Edgware bus station Avanti House Secondary School 3 April 2018 636 Kemnal Technology College Grove Park 2 September 2017 Ran one way to Grove Park only. 637 Kemnal Technology College Grove Park 2 September 2017 Ran one way to Grove Park only. 641 West Molesey Teddington School 30 September 2017 648 Romford railway station Cranham 24 July 2021Route 648 Map Transport for London Replaced by route 248 and partially replaced by route 646. 689 Norwood bus garage Burntwood School 30 July 2011 Replaced by route 690. 692 Dame Alice Owen's School Southgate tube station 2 September 2023 Ran one way to Southgate tube station only; reincorporated into route 699. 718 Morden tube station Rosehill 5 December 2021 A temporary route introduced on 30 November 2019 and operated by Go-Ahead London. Created due to a closure of Bishopsford Road Bridge. 728 Fulham Town Hall Southside Wandsworth 2 October 2023 A temporary route introduced on 24 July 2023 and operated by Abellio London. Created due to a closure of Wandsworth Bridge. 733 Oval tube station Finsbury Square 13 May 2022 A temporary route introduced on 15 January 2022 and operated by Tower Transit. Created due to a closure of the Northern line between Moorgate and Oval stations. 931 Crystal Palace Lewisham Shopping Centre 19 May 2017Route 931 Map Transport for London Operated one return journey on Fridays. Replaced by local routes in the area and the Dial-a-Ride service. 953 Scrattons Eco Park Romford 7 November 2012 Operated two return journeys on Wednesdays. Replaced by local routes in the area and the Dial-a-Ride service. 965 Riverhill Kingston upon Thames 12 October 2018 Operated one return journey on Mondays, Wednesdays and Fridays only. Replaced by the Dial-a-Ride service. Crossed border into Surrey on Worcester Park Road.Route 965 Map Transport for London C2 Parliament Hill Fields Regent Street 30 March 2019Route C2 Map Transport for London Replaced by route 88. H23 Hounslow bus station Heathrow Airport 21 March 2008 Extended to Heathrow Terminal 5 and renumbered 423. H50 West Drayton railway station Circular via Stockley Park 21 March 2008 Extended to Heathrow Terminal 5 and renumbered 350. PR1 Willesden Junction station Ealing Broadway station 23 March 2007 Replaced by routes 226 and PR2. PR2 Willesden Junction station Wembley Park 14 October 2011 Replaced by route 206. R6 Orpington railway station St Mary Cray railway station 29 March 2025 Replaced by route B14. RV1 Covent Garden Tower Gateway DLR station 15 June 2019Route RV1 Map Transport for LondonPermanent Bus Changes 12 April 2019 to 30 June 2019 Transport for London Partly replaced by route 343. S2 Stratford bus station Clapton 5 July 2008 Replaced by routes 425 and 488. S5 Wallington Mitcham Common 1 March 2002 Replaced by a revised version of route 463. T31 New Addington Forestdale 24 October 2015 Replaced by changes to routes 64, 130 and 353. T32 New Addington tram stop Addington Village Interchange Replaced by changes to routes 64 and 130. T33 West Croydon bus station Addington Village Interchange Renumbered 433. W10 Crews Hill Enfield Town 13 March 2021 Replaced by route 456. N10 Richmond London King's Cross railway station 29 January 2010 Replaced by routes 10 and 33. N13 North Finchley bus station Aldwych 1 April 2017 Replaced by a 24-hour service on route 13. N16 Edgware bus station London Victoria station 29 April 2023 Renumbered N32. N35 Clapham Junction railway station Tottenham Court Road station 30 April 2016 Replaced by a 24-hour service on route 35. N36 Queen's Park station Grove Park railway station 9 February 2008 Replaced by a new 24-hour service on route 36 and a new route N136 between Oxford Circus and Grove Park railway station. N47 Trafalgar Square St Mary Cray railway station 12 September 2015 Replaced by new route N199 and a 24-hour service on route 47. N64 New Addington Thornton Heath Pond 24 October 2015 Replaced by a 24-hour service on route 64. N76 Northumberland Park railway station Lower Marsh 8 November 2014 Withdrawn between Tottenham and Northumberland Park railway station and renumbered 76. N93 Putney Bridge tube station North Cheam 3 April 2004 Incorporated into the main service of route 93. N159 Marble Arch tube station New Addington 27 August 2010 Replaced by routes 159, N64 and N109. X26 West Croydon bus station Heathrow Central bus station 19 August 2023 Renumbered SL7. X68 Russell Square West Croydon bus station 31 July 2023 Renumbered SL6. X140 Heathrow Central bus station Harrow bus station 26 August 2023 Renumbered SL9. ==Future routes== Route Start End Notes SL4 Westferry Circus Grove Park railway station To be introduced on 7 April 2025 when the Silvertown Tunnel opens as part of the Superloop network of orbital express bus routes. To run non-stop between Leamouth and Sun in the Sands. ==Temporary routes== All routes operate in both directions unless stated. Route Start End Operator Notes 7X East Acton London Paddington station Metroline Runs annually during the Notting Hill Carnival weekend. 36X Peckham Harrow Road Go-Ahead London Runs annually during the Notting Hill Carnival weekend. Runs one-way towards Harrow Road only. ==Related pages== * :Category:London bus operators ==References== ==Bibliography== * Atkin, Michael. \"THIS SCEPTRED ISLE\", The Guardian * Carr, Ken, The London Bus Guide. Boreham: Visions International Entertainment, 2011. ISBN 978-0-9570058-0-8. ==Other websites== * London Buses Category:Public transport in the United Kingdom Category:London-related lists Category:Transport lists",
 "title": "List of bus routes in London"
}