{
 "id": "293961",
 "text": "The Chicago Blues Festival is a blues festival in Chicago held every year in June since 1984. The festival is hosted by the City of Chicago Mayor's Office of Special Events. It is held at Petrillo Music Shell and four other stages in Grant Park at the waterfront of Lake Michigan. The festival is free and it is the largest free blues festival in the world. Most of the musicians come from Chicago. Chicago was very important for the development of Blues. Many people from the south went to Chicago to find a better life and the brought their musical tradition with them. In the clubs of the South Side a new style, known as Chicago blues, developed. Many musicans made the city famous for it´s blues music scene. This years festival will be held from June 10th-12th in the Grant Park. Artist are among others * James “Super Chikan” Johnson * Erwin Helfer Band featuring Katherine Davis * Tribute to Robert Johnson: David “Honeyboy” Edwards, Rick Sherry, Rocky Lawrence, Hubert Sumlin and Duwayne Burnside Band * Sam Lay Blues Band * Tribute to Pinetop Perkins featuring Willie “Big Eyes” Smith and Friends * John Primer * Shemekia Copeland * Lonnie Brooks with guests Michael “Iron Man” Burks, Rick Estrin Ann Rabson and Eddy “The Chief” Clearwater: 40th Anniversary of Alligator Records ==The line up of the first Chicago Blues Festival== * James Cotton * Junior Wells * Jimmy Rogers * Sammy Lawhorn * Louis Myers * Pinetop Perkins * Calvin Jones * Willie \"Big Eyes\" Smith * Jerry Portnoy * Carey Bell * Sunnyland Slim Blues Band w/Louis Myers * Robert Stoger * Odie Payne, Jr. * Willie Dixon & the Chicago Blues All Stars * Johnny Winter and the Legendary Blues Band with Special Guests Koko Taylor and James Cotton * Billy Branch and the Sons of Blues * Lurrie Bell * Little Ed Williams * Gloria Hardiman * Johnny B. Moore * Sugar Blue * Valerie Wellington * Erwin Helfer, Blind John Davis, Estella Mama Yancey and Big Time Sarah * Buckwheat Zydeco Ils Sont Parties Band * Bobby Rush * Texas Guitar Showdown featuring Clarence Gatemouth Brown, Albert Collins and Johnny Copeland with Special Guest Brother Jack McDuff * Magic Slim & the Teardrops * Homesick James, Snooky Pryor, Eddie Taylor * Jimmy and Syl Johnson * John Lee Hooker * Bobby Blue Bland ==Past performers== Albert King, B. B. King, Bill Doggett, Bo Diddley, Bobby \"Blue\" Bland, Bobby Rush, Buckwheat Zydeco, Buddy Guy, Calvin Jones, Carey Bell, Carl Perkins, Chicago Blues Museum All Stars, Chuck Berry, Clarence \"Gatemouth\" Brown, Dr. John, Eddie Boyd, Eddie C. Campbell, Eddie Vinson, Eddy Clearwater, Etta James, Fenton Robinson, Fontella Bass, Hank Ballard, Henry Townsend, Homesick James, Hubert Sumlin, James Cotton, Jerry Portnoy, Jimmy Johnson, Jimmy Rogers, John Lee Hooker, Johnnie Taylor, Johnny Shines, Johnny Winter, Junior Wells, Keith Richards, Koko Taylor, Little Milton, Little Willie Littlefield, Lonnie Brooks, Lowell Fulson, Louisiana Red, Luther Allison, Magic Slim, Matt Murphy, Memphis Slim, Mick Taylor, The Neville Brothers, Otis Rush, Pee Wee Crayton, Pinetop Perkins, Ray Charles, Robert Cray Band, Robert Lockwood, Jr., Snooky Pryor, Son Seals, Staple Singers, Stevie Ray Vaughan, Sugar Blue, Sunnyland Slim, Taj Mahal, Willie Dixon, Lil' Ed Williams and the Blues Imperials, and Johnny B. Moore ==References== Category:Music in Chicago Category:June events Category:1964 establishments in the United States Category:1960s establishments in Illinois Category:Music festivals in the United States",
 "title": "Chicago Blues Festival"
}