{
 "id": "294289",
 "text": "Leif Erikson Day is a holiday that happens on October 9. It honors Leif Ericson, the Norse explorer who brought the first Europeans known to be in North America. ==History== America Not Discovered by Columbus by Rasmus B. Anderson was published in 1874. This book helped make popular the idea that Vikings were the first Europeans in the New World. In 1925, American President Calvin Coolidge recognised Leif Erikson as the Discoverer of America. This was due to research by Norwegian-American scholars such as Knut Gjerset and Ludvig Hektoen.Becoming American, Becoming Suburban: Norwegians in the 1920s (Knut Gjerset and Ludvig Hektoen. Norwegian-American Historical Association.Volume 33: Page 3) In 1930, Wisconsin became the first state to officially adopt Leif Erikson Day as a state holiday. A year later, the state of Minnesota did the same. By 1956, Leif Erikson Day was an official holiday seven states (Wisconsin, Minnesota, South Dakota, Illinois, Colorado, Washington, and California) and one Canadian province (Saskatchewan). My Minneapolis (Carl Gustav Otto Hansen. Minneapolis,MN: 1956) In 1963, the U.S. Representative from Duluth, John Blatnik, introduced a bill to observe Leif Erikson Day in the rest of the United States. In 1964, the United States Congress authorized and requested the President to create the observance through a yearly proclamation. Lyndon B. Johnson and each President since have done so. Presidents have used the proclamation to praise the spirit of discovery and the contributions of Americans of Nordic descent generally. Some states officially commemorate Leif Erikson Day, particularly in the Upper Midwest, where large numbers of people from the Nordic countries settled. ==Date== October 9th is not related with any event in Leif Erikson's life. The date was chosen because the ship Restauration coming from Stavanger, Norway, arrived in New York Harbor on October 9, 1825. This was the start of the first organized immigration from Norway to the United States.Leif Erikson Day in United States (Time and Date AS 1995–2009) ==References== ==Further reading== * ==Other websites== *Leif Erikson Day - October 9th *Leif Ericson Viking Ship, Inc. * Brief History of Leif Erikson's Life & Voyages Sample proclamations: *1998 *2005 *2007 *2009 Category:Holidays of the United States Category:Holidays of Canada Category:Iceland Category:October observances",
 "title": "Leif Erikson Day"
}