{
 "id": "294231",
 "text": "Cinco de Mayo (Spanish for \"fifth of May\") is a holiday celebrating Mexican heritage inkling and pride, and is held on May 5. It is celebrated in the United States and in some parts of Mexico, mostly in the state of Puebla.Cinco de Mayo. Mexico Online: The Oldest and most trusted online guide to Mexico. Retrieved February 6, 2009.\"The anniversary of the victory is celebrated only sporadically in Mexico\" - National Geographic Accessed December 4, 2007List of Public and Bank Holidays in Mexico April 14, 2008. This list indicates that Cinco de Mayo is not a día feriado obligatorio (\"obligatory holiday\"), but is instead a holiday that can be voluntarily observed.Cinco de Mayo is not a federal holiday in México Accessed May 5, 2009 Cinco de Mayo is not Mexico's Independence Day, the most important national holiday in Mexico. In the Mexican state of Puebla, Cinco de Mayo is celebrated because the Mexican army won the Battle of Puebla from the French army on May 5, 1862. This was a surprising victory. The army was under the leadership of General Ignacio Zaragoza Seguín.National Geographic: Defeat of French forces by Mexican Army Retrieved February 6, 2009.Library of Congress (U.S.A.) Declaration Retrieved February 6, 2009. ==United States== In the United States Cinco de Mayo is more important than in Mexico.\"hdushoweijfop ij \"Cinco de Mayo has become a day for celebrating Mexican culture in the United States, and celebrations there easily outshine those in Mexico.\" Accessed May 8, 2007 It is a day to celebrate the culture and experiences of Americans of Mexican ancestry. This is in the same way as other holidays like Saint Patrick's Day, Oktoberfest, and the Chinese New Year are used to celebrate those of Irish, German, and Chinese ancestry. Cinco de Mayo is celebrated by many Americans, not only by Americans of Mexican origin. Celebrations use both traditional Mexican symbols, like the Virgen de Guadalupe, and prominent figures with Mexican roots in the United States, including César Chávez.In some locations with significant non-Mexican hispanic communities, such as Florida, the celebration has grown to include non-Mexicans. Ahorre.com Accessed May 8, 2007. Many people display Cinco de Mayo banners while schools organize events to educate pupils about Mexico. Special events and celebrations highlight Mexican culture, especially its music and regional dancing. Examples include baile folklórico and mariachi demonstrations held every year at the Plaza del Pueblo de Los Angeles, near Olvera Street. Businesses advertise Mexican products and services, especially Mexican drinks,kk foods, and music.\"From my perspective as a marketing professional, Cinco de Mayo has morphed into a national holiday designed by Fifth Avenue to sell alcohol and excite consumership around a party-type theme.\" Accessed May 5, 2007.\" ==Mexico== Cinco de Mayo is a regional holiday limited mostly to the state of Puebla.mjlk ==Elsewhere== Cinco de Mayo is also celebrated outside Mexico and the United States. For example, a sky-diving club near Vancouver, Canada, holds a Cinco de Mayo skydiving event. In the Cayman Islands, in the Caribbean, there is a yearly Cinco de Mayo air guitar competition.jj As far away as the island of Malta, in the Mediterranean Sea, revelers are encouraged to drink Mexican beer on May 5.Celebration in Malta . Accessed 2008-05-05. ==Related pages== * History of Mexico * Napoleon III ==References== ==Other websites== * Cinco De Mayo Videos on The History Channel Category:Holidays of the United States Category:May observances Category:Mexico",
 "title": "Cinco de Mayo"
}