{
 "id": "294389",
 "text": "Nick on CBS was a Saturday morning children's programming block for CBS that began on September 16, 2000, replacing CBS Kidshow. This Saturday morning block presented programming from Nick Jr., which at a time shared common ownership with CBS under Viacom. When the block first properly aired, it was hosted by Face from Nick Jr. On September 14, 2002, Nick Jr. on CBS was re- branded as Nick on CBS, and airing both Nickelodeon and Nick Jr. shows. The Nickelodeon shows were removed in 2005 in favor for a return to an exclusively-Nick Jr. block. The block's continuity was provided by segments featuring Piper O'Possum. At the beginning of New Year's Eve 2005, Viacom split into two different companies, with CBS Corporation becoming its own standalone company and Nickelodeon going to new Viacom. Nick Jr. on CBS ended on September 9, 2006 and was replaced by KOL Secret Slumber Party on CBS on September 16, 2006, as part of a multi-year partnership between CBS and Cookie Jar Entertainment. All programming during the block, as is standard for Saturday morning network programming, was labelled as meeting E/I requirements, as tennous as some of the claims of educational content may have been. This is part of the reason why some of Nickelodeon's most popular programs (most notably SpongeBob SquarePants and The Fairly OddParents) any did not putting offer with Nick on CBS era. ==Programming== === Nick Jr. === ====Live-action/animated series==== Program Premiere date Finale date Blue's Clues September 16, 2000 September 9, 2006 LazyTown September 18, 2004 September 9, 2006 ====Animated series==== Program Premiere date Finale date Nick Jr. Toons October 18, 2007 January 1, 2025 The Backyardigans September 18, 2004 September 9, 2006 Bob the Builder September 22, 2001 September 7, 2009 Dora the Explorer September 16, 2000 September 9, 2006 Franklin September 7, 2002 Go, Diego, Go! September 17, 2005 September 9, 2006 Kipper September 16, 2000 Little Bear Little Bill September 7, 2002 August 2, 2003 March 6, 2004 September 18, 2004 September 9, 2006 Maggie and the Ferocious Beast September 16, 2000 Maisy Miss Spider's Sunny Patch Friends September 18, 2004 September 10, 2005 Oswald September 22, 2001 September 7, 2002 ===Nickelodeon=== ====Animated series==== Program Premiere date Finale date All Grown Up! March 13, 2004 September 11, 2004 As Told by Ginger September 14, 2002 November 23, 2002 ChalkZone September 11, 2004 Hey Arnold! September 14, 2002 Pelswick November 23, 2002 Rugrats July 26, 2003 The Wild Thornberrys September 14, 2002 March 6, 2004 ==Block slogans== *Nick Jr. is Just for Me! (2000-2002) *Nick on CBS, Cool! (2002-2004) *Solo! (2004-2005) *Nick Jr. Play to Learn (2005-2006) *Nick Jr, Playtime (2009) ==References== Category:Columbia Broadcasting System Category:Nickelodeon Category:Children's television series",
 "title": "Nickelodeon on CBS"
}