{
 "id": "294434",
 "text": "Nizam ), a shortened version of Nizam-ul-Mulk (, meaning Administrator of the Realm) was the title of the native sovereigns of Hyderabad State, India, since 1719. They belonged to the Asaf Jahi dynasty. The dynasty was founded by Mir Qamar-ud-Din Siddiqi, a viceroy of the Deccan under the Mughal emperors from 1713 to 1721. After Aurangzeb's death in 1707, the Mughal Empire fell apart and the viceroy in Hyderabad said he was independent. From 1798 Hyderabad was one of the princely states of British India, but it kept local control. Seven Nizams ruled Kingdom of Hyderabad for two centuries until Indian independence in 1947. The Asaf Jahi rulers used money to support free Education, literature, architecture, art, culture and cuisine. The Nizams ruled the state until September 1948 after independence from the British. == Origins == The Nizams of Hyderabad were of Turkic and Hadhrami Arab Descent. They are descendants of the first Khalifa of Islam, Abu Bakr. Nizām-ul-mulk was a title first used in Urdu around 1600. It comes from the Arabic word, nizām (), meaning order, arrangement. The Nizam was also called Ala Hadrat, Ala Hazrat, or Nizam Sarkar. == Rise of the Nizams == The first Nizam ruled in place of the Mughal emperors. After Aurangzeb died, the Mughal empire collapsed. So, the Nizams created an independent kingdom (Hyderabad). When the British got power over India, the Nizams continued to rule Kingdom of Hyderabad after coming into an understanding with the British. The Nizams had power in Kingdom of Hyderabad until 17 September 1948. Hyderabad then became part of the new Indian Union. The Asaf Jah dynasty had only seven rulers. However, for 13 years after the rule of the first Nizam, three of his sons (Nasir Jung, Muzafar Jung and Salabath Jung) ruled. They were not officially recognized as rulers. A legend about the first Nizam says that on one of his hunting trips he was offered some kulchas (an Indian bread) by a holy man. He asked the Nizam to eat as many as he could. The Nizam ate seven kulchas and the holy man predicted that seven generations of his family would rule the state. By tradition, no Nizam has ever left India, even if there was good a reason. Hyderabad did not join the first war of Indian Independence of 1857 against the British. Therefore the Royal Family had the special, official status of Faithful Ally with Britain. ==Contributions to society== ===Infrastructure=== The Nizams commissioned engineering projects such as large reservoirs like Osman Sagar and Himayat Sagar. Survey work on the Nagarjuna Sagar Dam was also initiated during this time. Other landmarks like the Asafia library, The Assembly building, the Osmania Arts College and the Osmania Medical College are some of their important buildings. The Asaf Jahis also built many palaces. The Nizams liked the European style of architecture and created a fusion of European traditions with Hindu and Islamic forms and images. ==The last Nizam== After the British left India in 1947, the princely state of Hyderabad did not join either of the new dominions of India or Pakistan. While the talks were going on, the Indian army entered Hyderabad State from four sides defeated Hyderabad Nizams army and the independent razakaars. The Nizam's rule ended on 17 September 1948. His soldiers surrendered to the Indian govt. He, however, was made the 1st Governor (Rajpramukh) of post-independent Hyderabad based on the public poll. All Nizams are buried in the royal graves at the Makkah Masjid near Charminar in Hyderabad. Only the last Nizam, Mir Osman Ali Khan is buried in a different place. His mausoleum is in the Judi Mosque facing King Kothi Palace. ==Related pages== * Hyderabad State *Osman Ali Khan, Asaf Jah VII ==References== ==Other reading== * * * * * Mughal Administration of Deccan Under Nizamul Mulk Asaf Jah, 1720-48 A.D.By M. A. Nayeem, Indian Council of Historical Research, University of Poona, Dept. of History \"The Days of the Beloved\" Harriet Ronken Lynton and Mohini Rajan, Berkeley University Press == Other websites == * Asaf Jahi Dynasty with Genealogical Tree and Photos * Hyderabad: Compulsory education was Nizam’s concept * New York Times - A Graceful City of Two Cultures * History of Hyderabad state * Narendra Luther, An authority on History of Hyderabad * Tribute to Nizam * Detailed genealogy of the Nizams of Hyderabad * Article on some aspects of life in erstwhile Hyderabad state",
 "title": "Nizam of Hyderabad"
}