{
 "id": "294660",
 "text": "Daniel Ricciardo (born 1 July 1989 in Perth, Western Australia) is an Australian racing driver. He won the British Formula Three Championship in 2009. who most recently competed in Formula One from 2011 to 2024. == Career == === Formula Ford and Formula BMW === Daniel Ricciardo started karting at the age of nine. In 2005, he entered the Western Australian Formula Ford championship. He drove a 15-year-old Van Diemen, and finished eighth by season's end. The next year, he won a scholarship to the Formula BMW Asian championship with Eurasia Motorsport. During his first season, Ricciardo earned a pole position and won twice. He finished third in the Drivers' Championship with 231 points, 59 points behind the champion. In August 2006, Daniel Ricciardo entered one race in the Formula BMW UK series. He finished eighth in the second race and took three championship points. At the end of the year, he entered the Formula BMW World Final Fortec Motorsport. He finished in fifth position, fourteen seconds behind the winner. === Formula Renault === 2007 saw the Australian moved to Formula Renault, entering the European and Italian championships. He finished the year seventh in the Italian series with 196 points and scoring a single podium at Valencia. He failed to score a point in his few starts in the European races. Daniel Ricciardo stayed in Formula Renault for 2008, entering the European and Western European championships. By the end of the year, the he took his first European title in the Western European Cup and finished second in the Eurocup. === Formula Three === During the middle of the 2008 season, Daniel Ricciardo made his Formula Three debut at the Nürburgring. He qualified in eighth for the first race. He was moved up to sixth in the race after James Jakes and Christian Vietoris stalled on the grid. Daniel Ricciardo moved to the British Formula Three Championship for 2009, driving for Carlin Motorsport. He also made his debut in the 3.5-litre World Series by Renault championship. He retired from the first race, before finishing fifteenth in the second. When he returned to Formula Three, he extended his championship lead. Ricciardo became the first Australian driver since David Brabham in 1989 to win the British F3 title. He won the championship by 87 points. Daniel Ricciardo continued with Carlin for the Macau Grand Prix with the team. He finished sixth in the qualifying race. He retired on the first lap of the main race after hitting the wall. === Formula Renault 3.5 Series === On 30 October 2009, Daniel Ricciardo was signed by Tech 1 to compete in the 2010 Formula Renault 3.5 Series season. He had 8 pole positions in the season, 4 wins, and finished the season second in the championship. Daniel Ricciardo returned to the series in 2011 for ISR Racing === Formula One === Daniel Ricciardo made his track debut at the wheel of a Formula One car in December 2009. He tested for Red Bull Racing at the young drivers test at Circuito de Jerez. On the final day of testing, Ricciardo had the fastest time of the test by more than one second. Ricciardo became one of the test and reserve drivers for both Red Bull Racing, and the sister team Scuderia Toro Rosso In November 2010, Daniel Ricciardo was the only Red Bull Racing driver at the end-of-season young drivers test. Daniel Ricciardo dominated the event. His fastest lap was 1.3 seconds faster than Sebastian Vettel's qualifying lap the Saturday before. Daniel Ricciardo remained unbeaten in Formula One tests he has attended. On 26 November 2010, Daniel Ricciardo was confirmed as Toro Rosso's test and reserve driver for the season. He will take part in the first free practice session of each race weekend. == Racing record == === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 2005 Australian Formula Ford Privateer 3 0 0 ? 0 74 8th 2006 Formula BMW Asia Eurasia Motorsport 19 2 3 3 12 231 3rd Formula BMW UK Motaworld Racing 2 0 0 0 0 3 20th Formula BMW World Final Fortec Motorsport 1 0 0 0 0 N/A 5th 2007 Formula Renault 2.0 Italy RP Motorsport 14 0 0 0 0 196 6th Eurocup Formula Renault 2.0 4 0 0 0 0 0 NC 2008 Formula Renault 2.0 WEC SG Formula 15 8 9 7 11 192 1st Eurocup Formula Renault 2.0 18 6 5 5 7 136 2nd Formula Three Euroseries 2 0 0 0 0 N/A NC Masters of Formula 3 1 0 0 0 0 N/A NC 2009 British Formula Three Championship Carlin Motorsport 20 7 6 5 13 275 1st Masters of Formula 3 1 0 0 0 0 N/A NC Formula Renault 3.5 Series Tech 1 Racing 2 0 0 0 0 0 34th Macau Grand Prix Carlin 1 0 0 0 0 N/A NC 2010 Formula Renault 3.5 Series Tech 1 Racing 16 4 8 5 8 136 2nd 2011 Formula Renault 3.5 Series ISR 12 1 2 3 6 144 5th Formula One Red Bull Racing Test driver Test driver Test driver Test driver Test driver Test driver Test driver Scuderia Toro Rosso Hispania 11 0 0 0 0 0 27th 2012 Formula One Scuderia Toro Rosso 20 0 0 0 0 10 18th 2013 Formula One Scuderia Toro Rosso 19 0 0 0 0 20 14th 2014 Formula One Infiniti Red Bull Racing 19 3 0 1 8 238 3rd 2015 Formula One Infiniti Red Bull Racing 19 0 0 3 2 92 8th 2016 Formula One Red Bull Racing 21 1 1 4 8 256 3rd 2017 Formula One Red Bull Racing 20 1 0 1 9 200 5th 2018 Formula One Aston Martin Red Bull Racing 21 2 2 4 2 170 6th 2019 Formula One Renault F1 Team 21 0 0 0 0 54 9th 2020 Formula One Renault DP World F1 Team 17 0 0 2 2 119 5th 2021 Formula One McLaren F1 Team 10 1 0 0 0 50* 8th* As a guest driver, Ricciardo was ineligible for points Season in progress === Complete Formula Three Euroseries results === (key) Yr Team 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Pos Points 2008 SG Formula HOC1 1 HOC1 2 MUG 1 MUG 2 PAU 1 PAU 2 NOR 1 NOR 2 ZAN 1 ZAN 2 NÜR 1 6 NÜR 2 15 BRH 1 BRH 2 CAT 1 CAT 2 LMS 1 LMS 2 HOC2 1 HOC2 2 NC† 0 † – As Ricciardo was a guest driver, he was ineligible for points. === Complete Formula Renault 3.5 Series results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Team 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 Pos Points 2009 Tech 1 Racing CAT SPR CAT FEA SPA SPR SPA FEA MON FEA HUN SPR HUN FEA SIL SPR SIL FEA BUG SPR BUG FEA ALG SPR Ret ALG FEA 15 NÜR SPR NÜR FEA ALC SPR ALC FEA 34th 0 2010 Tech 1 Racing ALC 1 3 ALC 2 2 SPA 1 13 SPA 2 5 MON 1 1 BRN 1 12 BRN 2 5 MAG 1 6 MAG 2 2 HUN 1 1 HUN 2 6 HOC 1 1 HOC 2 11 SIL 1 Ret SIL 2 2 CAT 1 1 CAT 2 4 2nd 136 2011 ISR Racing ALC 1 ALC 2 SPA 1 10 SPA 2 9 MNZ 1 6 MNZ 2 1 MON 1 1 NÜR 1 2 NÜR 2 5 HUN 1 HUN 2 SIL 1 SIL 2 LEC 1 LEC 2 CAT 1 CAT 2 17th* 3* === Complete Formula One results === (key) (Races in bold indicate pole position; races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 WDC Points Scuderia Toro Rosso Toro Rosso STR6 Ferrari 056 2.4 L V8 AUS TD MAL TD CHN TD TUR TD ESP TD MON TD CAN TD EUR TD 26th* 0* Hispania Racing Hispania F111 Cosworth CA2011 2.4 L V8 GBR 19 GER 19 HUN 18 BEL Ret ITA NC SIN 19 JPN 22 KOR 19 IND 18 ABU Ret BRA 20 Season in progress. == References == == Other websites == *Official website *Profile on Driver Database Category:1989 births Category:Living people Category:Australian Formula One drivers Category:Sportspeople from Perth, Western Australia",
 "title": "Daniel Ricciardo"
}