{
 "id": "294704",
 "text": "The Rhysling Awards are a prize given each year for the best poem from science fiction, fantasy, or horror. Most awards for writing are named for the creator of the award, the subject of the award, or an important person. The Rhyslings are named for a character in a science fiction story: the blind poet Rhysling, in Robert A. Heinlein's short story The Green Hills of Earth. Two awards are given: \"Best Long Poem\", for poetry of 50 or more lines, and \"Best Short Poem\", for works of 49 or fewer lines. The members of the Science Fiction Poetry Association (SFPA) choose several possible winners (nominees) for each year's Rhysling Awards. Each member may name one work that should win in each category. All of the nominees are published in a book called The Rhysling Anthology. Members of the Association then vote on the final winners. Since 2005, the Awards have been presented in July at a ceremony at Readercon. The \"Best Short Poem\" category allows very short poems to be entered. However, the SFPA also has the Dwarf Stars Award for poems from one to ten lines.The Science Fiction Poetry Association: Dwarf Stars ==Best Long Poem winners== * 1978 Gene Wolfe The Computer Iterates the Greater Trumps * 1979 Michael Bishop For the Lady of a Physicist * 1980 Andrew Joron The Sonic Flowerfall of Primes * 1981 Thomas M. Disch On Science Fiction * 1982 Ursula K. Le Guin The Well of Baln * 1983 Adam Cornford Your Time and You: A Neoprole's Dating Guide * 1984 Joe Haldeman Saul's Death: Two Sestinas * 1985 Siv Cedering A Letter from Caroline Herschel (1750-1848) * 1986 Andrew Joron Shipwrecked on Destiny Five * 1987 W. Gregory Stewart Daedalus * 1988 Lucius Shepard White Trains * 1989 (tie): Bruce Boston In the Darkened Hours ; John M. Ford Winter Solstice, Camelot Station * 1990 Patrick McKinnon dear spacemen * 1991 David Memmott The Aging Cryonicist in the Arms of His Mistress Contemplates the Survival of the Species While the Phoenix Is Consumed by Fire * 1992 W. Gregory Stewart the button and what you know * 1993 William J. Daciuk To Be from Earth * 1994 W. Gregory Stewart and Robert Frazier Basement Flats: Redefining the Burgess Shale * 1995 David Lunde Pilot, Pilot * 1996 Margaret B. Simon Variants of the Obsolete * 1997 Terry A. Garey Spotting UFOs While Canning Tomatoes * 1998 Laurel Winter why goldfish shouldn't use power tools * 1999 Bruce Boston Confessions of a Body Thief * 2000 Geoffrey A. Landis Christmas (after we all get time machines) * 2001 Joe Haldeman January Fires * 2002 Lawrence Schimel How to Make a Human * 2003 (tie): Charles Saplak and Mike Allen Epochs in Exile: A Fantasy Trilogy ; Sonya Taaffe Matlacihuatl's Gift * 2004 Theodora Goss Octavia Is Lost in the Hall of Masks * 2005 Tim Pratt Soul Searching * 2006 Kendall Evans and David C. Kopaska-Merkel The Tin Men * 2007 Mike Allen The Journey to Kailash * 2008 Catherynne M. Valente The Seven Devils of Central California * 2009 Geoffrey A. Landis Search * 2010 Kendall Evans and Samantha Henderson In the Astronaut Asylum * 2011 C.S.E. Cooney The Sea King's Second Bride * 2012 Megan Arkenberg The Curator Speaks in the Department of Dead Languages * 2013 Andrew Robert Sutton Into Flight * 2014 Mary Soon Lee Interregnum * 2015 F.J. Bergmann 100 Reasons to Have Sex with an Alien * 2016 (tie): Krysada Panusith Phounsiri It Begins With A Haunting; Ann K. Schwader Keziah * 2017 Theodora Goss Rose Child ==Best Short Poem winners== * 1978 (tie): Duane Ackerson The Starman ; Andrew Joron Asleep in the Arms of Mother Night ; Sonya Dorman Corruption of Metals * 1979 (tie): Duane Ackerson Fatalities ; Steve Eng Storybooks and Treasure Maps * 1980 (tie): Robert Frazier Encased in the Amber of Eternity ; Peter Payack The Migration of Darkness * 1981 Ken Duffin Meeting Place * 1982 Raymond DiZazzo On the Speed of Sight * 1983 Alan P. Lightman In Computers * 1984 Helen Ehrlich Two Sonnets * 1985 Bruce Boston For Spacers Snarled in the Hair of Comets * 1986 Susan Palwick The Neighbor's Wife * 1987 (tie): Jonathan V. Post Before the Big Bang: News from the Hubble Large Space Telescope ; John Calvin Rezmerski A Dream of Heredity * 1988 (tie): Bruce Boston The Nightmare Collector ; Suzette Haden Elgin Rocky Road to Hoe * 1989 Robert Frazier Salinity * 1990 G. Sutton Breiding Epitaph for Dreams * 1991 Joe Haldeman Eighteen Years Old, October Eleventh * 1992 David Lunde Song of the Martian Cricket * 1993 Jane Yolen Will * 1994 (tie): Bruce Boston Spacer's Compass ; Jeff VanderMeer Flight Is for Those Who Have Not Yet Crossed Over * 1995 Dan Raphael Skin of Glass * 1996 Bruce Boston Future Present: A Lesson in Expectation * 1997 W. Gregory Stewart Day Omega * 1998 John Grey Explaining Frankenstein to His Mother * 1999 Laurel Winter egg horror poem * 2000 Rebecca Marjesdatter Grimoire * 2001 Bruce Boston My Wife Returns as She Would Have It * 2002 William John Watkins We Die as Angels * 2003 Ruth Berman Potherb Gardening * 2004 Roger Dutcher Just Distance * 2005 Greg Beatty No Ruined Lunar City * 2006 Mike Allen The Strip Search * 2007 Rich Ristow The Graven Idol's Godheart * 2008 F.J. Bergmann Eating Light * 2009 Amal El-Mohtar Song for an Ancient City * 2010 Ann K. Schwader To Theia * 2011 Amal El-Mohtar Peach-Creamed Honey * 2012 Shira Lipkin The Library, After * 2013 Terry A. Garey The Cat Star * 2014 Amal El- Mohtar Turning the Leaves * 2015 Marge Simon Shutdown * 2016 Ruth Berman Time Travel Vocabulary Problems * 2017 Marge Simon George Tecumseh Sherman's Ghosts ==Other websites== *SFPA Rhysling Anthology ==References== Category:Science fiction awards Category:Fantasy Category:Poetry Category:Literary awards Category:Horror",
 "title": "Rhysling Award"
}