{
 "id": "294756",
 "text": "Vim is a text editor made by Bram Moolenaar.Robbins, A., Hannah, E., & Lamb, L. (2008). Learning the vi and vim editors. \" O'Reilly Media, Inc.\".Robbins, A. (2011). vi and Vim Editors Pocket Reference: Support for every text editing task. \" O'Reilly Media, Inc.\".Neil, D. (2015). Practical Vim: Edit Text at the Speed of Thought. Pragmatic Bookshelf.Schulz, K. (2007). Hacking Vim: a cookbook to get the most out of the latest Vim editor. Packt Publishing Ltd.Neil, D. (2018). Modern Vim: Craft Your Development Environment with Vim 8 and Neovim. Pragmatic Bookshelf. Moolenaar publicly released Vim on November 2, 1991. Vim stands for Vi IMproved. Vim is an improved version of the vi text editor, an editor created by Bill Joy in 1976. Vim is free, and the source code is publicly available on GitHub. It is available in multiple languages, and it works on multiple operating systems, including Windows, Linux, and macOS. Vim can be used from either a command-line interface or a graphical user interface. While Vim can be hard to use, there are built-in commands new users can learn from reading the Vim user manual, running the `:help` command in Vim, or using the `vimtutor` command in a terminal. Vim is widely popular because it allows users to perform many functions on a document (save, search, scroll, etc.) by pressing as few keys as possible. However, many critics argue that these keystrokes are confusing. One can customize Vim using a .vimrc file. To add new features like keyboard shortcuts, one can use Vim script,Rosset, C. (2013). Exploring Vimscript as a Functional Domain Specific Language (Doctoral dissertation, University of Oxford). Vim’s built-in programming language. Many Vim plugins and extensions are also available online for free. There is an Internet turf war between programmers that prefer Vim and programmers that prefer Emacs,Cameron, D., Elliott, J., Loy, M., Raymond, E. S., & Rosenblatt, B. (2005). Learning GNU Emacs. \" O'Reilly Media, Inc.\". another common text editor. ==Gallery== File:Vim-javascript-with- plugin-gitgutter.png|Vim editing JavaScript File:Vim-netrw.png|File manager inside Vim File:Vim-search-copen-quickfix.png|Searching inside Vim File:Neovim-logo.svg|Neovim, a famous Vim variant File:Neovim 0.5.0 screenshot.png|Neovim screenshot ==References== == Other websites == * Category:Free software Category:Computer programming Category:Linux software",
 "title": "Vim"
}