{
 "id": "294805",
 "text": "This table compares IOC, FIFA, and ISO 3166 country codes. Flag Country IOC FIFA ISO Afghanistan AFG AFG AFG Åland Islands ALA Albania ALB ALB ALB Algeria ALG ALG DZA American Samoa ASA ASA ASM Andorra AND AND AND Angola ANG ANG AGO Anguilla AIA AIA Antarctica ATA Antigua and Barbuda ANT ATG ATG Argentina ARG ARG ARG Armenia ARM ARM ARM Aruba ARU ARU ABW Australia AUS AUS AUS Austria AUT AUT AUT Azerbaijan AZE AZE AZE The Bahamas BAH BAH BHS Bahrain BRN BHR BHR Bangladesh BAN BAN BGD Barbados BAR BRB BRB Belarus BLR BLR BLR Belgium BEL BEL BEL Belize BIZ BLZ BLZ Benin BEN BEN BEN Bermuda BER BER BMU Bhutan BHU BHU BTN Bolivia BOL BOL BOL Caribbean Netherlands AHO BES Bosnia and Herzegovina BIH BIH BIH Botswana BOT BOT BWA Bouvet Island BVT Brazil BRA BRA BRA British Indian Ocean Territory IOT British Virgin IslandsIn Olympic Games, Virgin Islands means the United States Virgin Islands not British Virgin Islands. IVB VGB VGB Brunei BRU BRU BRN Bulgaria BUL BUL BGR Burkina Faso BUR BFA BFA Burundi BDI BDI BDI Cambodia CAM CAM KHM Cameroon CMR CMR CMR Canada CAN CAN CAN Cape Verde CPV CPV CPV Cayman Islands CAY CAY CYM Central African Republic CAF CTA CAF Chad CHA CHA TCD Chile CHI CHI CHL China, People's Republic ofMainland China (People's Republic of China except Hong Kong and Macau) is designated as the \"People's Republic of China\", (\"China\" for short) in Olympic Games, and as \"China PR\", (\"China\" for short) in soccer matches. CHN CHN CHN Christmas Island CXR Cocos (Keeling) Islands CCK Colombia COL COL COL Comoros COM COM COM Congo, Democratic Republic of theThe Democratic Republic of the Congo is abbreviated as the \"DR Congo\" in Olympic Games, and as \"Congo DR\" in soccer matches. COD COD COD Congo, Republic ofThe Republic of the Congo is abbreviated as \"Congo\" in Olympic Games and soccer matches. CGO CGO COG Cook Islands COK COK COK Costa Rica CRC CRC CRI Côte d'Ivoire CIV CIV CIV Croatia CRO CRO HRV Cuba CUB CUB CUB Curaçao CUW Cyprus CYP CYP CYP Czech Republic CZE CZE CZE Denmark DEN DEN DNK Djibouti DJI DJI DJI DominicaThe Commonwealth of Dominica (Dominica) is abbreviated as \"Dominica\" in Olympic Games and soccer matches. DMA DMA DMA Dominican Republic DOM DOM DOM Ecuador ECU ECU ECU Egypt EGY EGY EGY El Salvador ESA SLV SLV England ENG \"GB-ENG\" is its ISO 3166-2 code. See also ISO 3166-2:GB. Equatorial Guinea GEQ EQG GNQ Eritrea ERI ERI ERI Estonia EST EST EST Ethiopia ETH ETH ETH Falkland Islands FLK Faroe Islands FRO FRO Fiji FIJ FIJ FJI Finland FIN FIN FIN France FRA FRA FRA French Guiana GUF French PolynesiaCompetes as \"Tahiti\" in soccer TAH PYF French Southern and Antarctic Lands ATF Gabon GAB GAB GAB The Gambia GAM GAM GMB Georgia GEO GEO GEO Germany GER GER DEU Ghana GHA GHA GHA Gibraltar GIB GIB Greece GRE GRE GRC Greenland HAL Grenada GRN GRN GRD Guadeloupe GLP Guam GUM GUM GUM Guatemala GUA GUA GTM Guernsey GGY Guinea GUI GUI GIN Guinea- Bissau GBS GNB GNB Guyana GUY GUY GUY Haiti HAI HAI HTI Heard Island and McDonald Islands HMD Honduras HON HON HND Hong KongHong Kong is designated as \"Hong Kong, China\" by IOC and in soccer matches. HKG HKG HKG Hungary HUN HUN HUN Iceland ISL ISL ISL India IND IND IND Indonesia INA IDN IDN Iran IRI IRN IRN Iraq IRQ IRQ IRQ IrelandIt coveres only the Republic of Ireland in the Olympic Games and soccer matches. In FIFA, the name \"Republic of Ireland\" is used in order to distinguish from Ireland as a former home nation of the United Kingdom. IRL IRL IRL Isle of Man IMN Israel ISR ISR ISR Italy ITA ITA ITA Jamaica JAM JAM JAM Japan JPN JPN JPN Jersey JEY Jordan JOR JOR JOR Kazakhstan KAZ KAZ KAZ Kenya KEN KEN KEN Kiribati KIR KIR Korea, Democratic People's Rep. (North)North Korea is designated as \"Democratic People's Republic of Korea\", abbreviated to \"DPRK\", in Olympic Games, and as the \"Korea DPR\" in soccer matches. PRK PRK PRK Korea, Republic of (South)South Korea is designated as \"Korea\" in Olympic Games, and as the \"Korea Republic\" in soccer matches. KOR KOR KOR Kuwait KUW KUW KWT Kyrgyzstan KGZ KGZ KGZ Laos LAO LAO LAO Latvia LAT LVA LVA Lebanon LBN LBN LBN Lesotho LES LES LSO Liberia LBR LBR LBR Libya LBA LBY LBY Liechtenstein LIE LIE LIE Lithuania LTU LTU LTU Luxembourg LUX LUX LUX Macau MAC MAC North MacedoniaThe North Macedonia is designated as the \"former Yugoslav Republic of Macedonia\" in Olympic Games and soccer matches. See also Macedonia naming dispute. MKD MKD MKD Madagascar MAD MAD MDG Malawi MAW MWI MWI Malaysia MAS MAS MYS Maldives MDV MDV MDV Mali MLI MLI MLI Malta MLT MLT MLT Marshall Islands MHL MHL Martinique MTQ Mauritania MTN MTN MRT Mauritius MRI MRI MUS Mayotte MYT Mexico MEX MEX MEX Micronesia, Federated States of FSM FSM Moldova MDA MDA MDA Monaco MON MCO Mongolia MGL MNG MNG Montenegro MNE MNE MNE Montserrat MSR MSR Morocco MAR MAR MAR Mozambique MOZ MOZ MOZ Myanmar MYA MYA MMR Namibia NAM NAM NAM Nauru NRU NRU Nepal NEP NEP NPL Netherlands NED NED NLD New Caledonia NCL NCL New Zealand NZL NZL NZL Nicaragua NCA NCA NIC Niger NIG NIG NER Nigeria NGR NGA NGA Niue NIU Norfolk Island NFK Northern Ireland NIR \"GB-NIR\" is its ISO 3166-2 code. See also ISO 3166-2:GB. Northern Mariana Islands MNP Norway NOR NOR NOR Oman OMA OMA OMN Pakistan PAK PAK PAK Palau PLW PLW Palestinian Authority PLE PLE PSE Panama PAN PAN PAN Papua New Guinea PNG PNG PNG Paraguay PAR PAR PRY Peru PER PER PER Philippines PHI PHI PHL Pitcairn Islands PCN Poland POL POL POL Portugal POR POR PRT Puerto Rico PUR PUR PRI Qatar QAT QAT QAT Réunion REU Romania ROU ROU ROU Russia RUS RUS RUS Rwanda RWA RWA RWA Saint Barthélemy BLM Saint Helena SHN Saint Kitts and Nevis SKN SKN KNA Saint Lucia LCA LCA LCA Saint Martin (French part) MAF Saint Pierre and Miquelon SPM Saint Vincent and the Grenadines VIN VIN VCT SamoaThe name \"Samoa\" as political sense contains only the Independent States of Samoa and excludes American Samoa. SAM SAM WSM San Marino SMR SMR SMR São Tomé and Príncipe STP STP STP Saudi Arabia KSA KSA SAU Scotland SCO \"GB-SCT\" is its ISO 3166-2 code. See also ISO 3166-2:GB. Senegal SEN SEN SEN Serbia SRB SRB SRB Seychelles SEY SEY SYC Sierra Leone SLE SLE SLE Singapore SGP SGP SGP Sint Maarten (Dutch part) SXM Slovakia SVK SVK SVK Slovenia SLO SVN SVN Solomon Islands SOL SOL SLB Somalia SOM SOM SOM South Africa RSA RSA ZAF South Georgia and the South Sandwich Islands SGS Spain ESP ESP ESP Sri Lanka SRI SRI LKA Sudan SUD SDN SDN Suriname SUR SUR SUR Svalbard and Jan Mayen SJM Eswatini SWZ SWZ SWZ Sweden SWE SWE SWE Switzerland SUI SUI CHE Syria SYR SYR SYR Republic of China (Taiwan)TW and TWN is defined as \"Taiwan, Province of China\" in the ISO 3166 codes list. The Republic of China is designated as \"\" in Olympic Games and soccer matches. See also Chinese Taipei and the Political status of Taiwan. TPE TPE TWN Tajikistan TJK TJK TJK Tanzania TAN TAN TZA Thailand THA THA THA Timor-LesteTimor-Leste is generally known as \"East Timor\". West Timor is a part of Indonesia. TLS TLS TLS Togo TOG TOG TGO Tokelau TKL Tonga TGA TGA TON Trinidad and Tobago TTO TRI TTO Tunisia TUN TUN TUN Turkey TUR TUR TUR Turkmenistan TKM TKM TKM Turks and Caicos Islands TCA TCA Tuvalu TUV TUV Uganda UGA UGA UGA Ukraine UKR UKR UKR United Arab Emirates UAE UAE ARE United KingdomThe United Kingdom's short names generally used in the Olympic Games are \"Great Britain and Northern Ireland\" or just \"Great Britain\" not the \"United Kingdom\". GBR GBR United States USA USA USA United States Minor Outlying Islands UMI United States Virgin IslandsUnited States Virgin Islands is designated as just Virgin Islands in Olympic Games. ISV VIR VIR Uruguay URU URU URY Uzbekistan UZB UZB UZB Vanuatu VAN VAN VUT Vatican City State VAT Venezuela VEN VEN VEN Vietnam VIE VIE VNM Wales WAL \"GB-WLS\" is its ISO 3166-2 code. See also ISO 3166-2:GB. Wallis and Futuna WLF Western Sahara ESH Yemen YEM YEM YEM Zambia ZAM ZAM ZMB Zimbabwe ZIM ZIM ZWE == Former countries and former country names == Codes are shown with their last year of use. Flag Country IOC FIFA ISO British Honduras HBR * * * 1972 BHO * * * Burma BIR * * * 1988 BUR * * * 1989 BUR * * * 1989 Ceylon CEY * * * 1972 CEY * * * 1972 Dahomey DAH * * * 1972 DAH * * * 1975 DHY * * * 1977 Czechoslovakia TCH * * * 1992 TCH * * * 1993 CSK * * * 1993 East Germany GDR * * * 1988 DDR * * * 1989 DDR * * * 1989 Khmer Republic KHM * * * 1976 ? * * * 1975 Malaya MAL * * * 1960 ? * * * 1963 Netherlands Antilles AHO * * * activeThe Netherlands Antilles dissolved on 10 October 2010. Although its ISO 3166 code has been deleted, the National Olympic Committee has yet to dissolve. ANT * * * activeThe Netherlands Antilles dissolved on 10 October 2010. Although its ISO 3166 code has been deleted, the national football confederation has yet to dissolve. ANT * * * 2010 North Borneo NBO * * * 1956 NBO * * * 1963 North Yemen YAR * * * 1988 NYE * * * 1990 YEM * * * 1990 Northern Rhodesia NRH * * * 1964 NRH * * * 1964 Rhodesia RHO * * * 1972 RHO * * * 1980 RHO * * * 1980 Serbia and Montenegro SCG * * * 2006 SCG * * * 2006 SCG * * * 2006 South Yemen YMD * * * 1988 SYE * * * 1990 YMD * * * 1990 Soviet Union URS * * * 1988 URS * * * 1991 SUN * * * 1992 Upper Volta VOL * * * 1984 UPV * * * 1984 HVO * * * 1984 Viet-Nam, Democratic Republic of VNO * * * 1975 VDR * * * 1977 Viet Nam, Republic of VNM * * * 1976 VSO * * * 1975 VNM * * * 1977 West Germany FRG * * * 1988 FRG * * * 1989 DEU * * * 1989 Yugoslavia, Federal Republic of YUG * * * 2002 YUG * * * 2003 YUG * * * 2003 Yugoslavia, Socialist Federal Republic of YUG * * * 1992 YUG * * * 1992 YUG * * * 1992 Zaire ZAI * * * 1996 ZAI * * * 1997 ZAR * * * 1997 == References == == Other websites== * \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF] * Category:Country codes",
 "title": "Comparison of IOC, FIFA, and ISO 3166 country codes"
}