{
 "id": "294801",
 "text": "There are currently 211 FIFA members, each one with a different country code. {| class=\"wikitable\" style=\"font-size:90%;\" Country Code AFG ALB ALG ASA AND ANG AIA ATG ARG ARM ARU AUS AUT AZE BAH BHR BAN BRB BLR BEL BLZ BEN BER BHU BOL BIH BOT BRA VGB BRU BUL BFA BDI CAM CMR CAN CPV CAY CTA CHA CHI CHN TPE COL COM CGO COD COK CRC (Côte d'Ivoire) CIV CRO CUB CUW ==Non-FIFA member codes== The following codes refer to countries or dependent areas that are currently not affiliated with FIFA, but whose codes either appear in the FIFA results database, or are used regularly by confederation websites. {| class=\"wikitable\" style=\"font-size:90%;\" Country Code Confederation GYF CONCACAF GPE CONCACAF MTQ or MQE CONCACAF REU CAF SXM CONCACAF TUV OFC ZAN CAF ==Abnormal codes== The following codes mean countries that do not have anything to do with FIFA. Even though they are members of their local groups, these codes are not usually used by FIFA. {| class=\"wikitable\" style=\"font- size:90%;\" Country Code Confederation FSM OFC NIU OFC NMI AFC PLW OFC SMT CONCACAF ==Obsolete country codes== The following codes are obsolete because a country has ceased to exist, changed its name, changed its code, or has become part of another country. {| class=\"wikitable\" style=\"font-size:90%;\" Country Code ADE BGU BHO BIN BOH BUR CAF CEY CIS CKN COB TCH DAH DEI ==FIFA, IOC and ISO differences== Although most FIFA codes are the same as the International Olympic Committee country codes at the Olympic Games, there are still some changes between them: Country FIFA IOC ISO Antigua and Barbuda ATG ANT ATG Bahrain BHR BRN BHR Barbados BRB BAR BRB Belize BLZ BIZ BLZ British Virgin Islands VGB IVB VGB Burkina Faso BFA BUR BFA Central African Republic CTA CAF CAF Croatia CRO CRO HRV El Salvador SLV ESA SLV Equatorial Guinea EQG GEQ EQG Germany GER GER DEU Guinea-Bissau GNB GBS GNB Indonesia IDN INA IDN Iran IRN IRI IRN Latvia LVA LAT LVA Libya LBY LBA LBY Malawi MWI MAW MWI Netherlands NED NED NLD Netherlands Antilles ANT AHO Until 10 October 2010, ANT, removed after the dissolution of the Netherlands Antilles Nigeria NGA NGR NGA Palestine PLE PLE PSE Slovenia SVN SLO SVN Taiwan (Chinese Taipei) TPE TPE TWN U.S. Virgin Islands VIR ISV VIR Vietnam VIE VIE VNM == References == country codes Category:Football-related lists Category:Lists of countries Category:Country codes",
 "title": "List of FIFA country codes"
}