{
 "id": "295194",
 "text": "Johann \"Hans\" Krankl (born 14 February 1953) is an Austrian football player who played for SK Rapid Wien and the Austrian national team. He is regarded as one of the best Austrian footballers in history. ==Career== He started his professional career with SK Rapid Wien at the age of 17. But he played not very often so he went to Wiener AC where he shot 27 goals in 26 matches. So he was transferred back to SK Rapid. In the next years he shot in 201 matches for the club 160 goals. In the 1977/78 season he shot 41 goals and got the European Golden Shoe as Europs best scorer. This is still the record in the Austrian League. In 1978 he was transferred to FC Barcelona where he shot in his first season 29 goals and won the Pichichi, the trophy for the best Spain scorer. With FC Barcelona he won also the UEFA Cup Winners Cup in 1979. 1981 he went back to Rapid where he shot another 107 goals for the club. The last years of his career he played with Wiener Sportklub, Kremser SC and SV Austria Salzburg.In his career he played 478 matches and scored 355 goals. ==International== Krankl played 69 matches for the national team and scored 34 goals. He was member of the team for the 1978 and 1982 FIFA World Cup. In 1978 he became a legend in Austria for scoring two goals against Germany - the first victory after 47 years. The radio commentary (\"Tor Tor Tor Tor Tor Tor, I werd' narrisch\" – \"Goal goal goal goal goal goal, I'm going crazy\") is known by almost all Austrian football supporters. ==Manager career== Although he coached different teams he was not as successful as a player. With his teams he never reached a European competition. As manager of the national team failed to qualify for the 2006 FIFA World Cup. ==Honours== ;Rapid Wien *Austrian Bundesliga:1982, 1983 *Austrian Cup:1976, 1983, 1984, 1985 ;Barcelona *UEFA Cup Winners' Cup:1979 *Copa del Rey:1981 ;Individual honours *Runner up European footballer of the year 1978 *Austrian Footballer of the year 1973, 1974, 1977, 1982, 1988 *Part of the 20th century Austrian team *Part of Rapids team of the century *Pichichi Trophy: 1979 *European Golden Shoe: 1978 *Austrian coach of the Year: 1999 ==Musical career== After his football career he began to sing and had some hits in Austria. ===Discography=== ;Singles *\"Ohne Ball'n und ohne Netz\" (1974) *\"Vor, vor noch ein Tor …\" (1974) ;Under the name Johann K. *\"Rostige Flügel\" (1984, mit Kottans Kapelle) *\"Lonely Boy\" (1985) *\"Ka Platz im Herz\" (1986) *\"Aspirin\" (1986) *\"Der Bätmän bin i\" (1989) *\"Rudi\" (2002) *\"Jingle Bells\" (2003) ;Albums ;Under the name Johann K. *Des war schon alles? (1985) *A scheena Bua (2003) *Best of – Wo san nur die Zeiten hin (2008) Category:1953 births Category:Living people Category:Austrian footballers Category:Austrian football managers Category:Austria national football team managers Category:Sportspeople from Vienna Category:Players of the Austrian national football team Category:FC Red Bull Salzburg players Category:SK Rapid Wien players Category:FC Admira Wacker Mödling managers Category:LASK managers Category:Association football forwards Category:Austrian football forwards Category:Austrian Football Bundesliga top scorers Category:Austrian football champions",
 "title": "Hans Krankl"
}