{
 "id": "295195",
 "text": "Lafayette County is a county in the state of Florida. As of 2020, 8,226 people lived there. It is the second least populated county in the state. Its county seat is Mayo, Florida. Lafayette County is a prohibition county, meaning alcohol is illegal there. == History == Lafayette County was created December 23, 1856 from part of Madison County, and included at the time what is now both Lafayette and Dixie Counties. Lafayette County was named in honor of the Marquis de Lafayette, the French citizen who rendered assistance to the colonies during the American Revolutionary War. The Suwannee River forms the entire eastern border. The county courts first met at the home of Ariel Jones near Fayetteville. The county seat was New Troy until the court house there burned down in 1892. It was then moved to Mayo in 1893, and Mayo is currently Lafayette's only incorporated town. New Troy is now a ghost town. In 1921 the lower part of the county was carved off to create Dixie County. ===Historic sites=== Historic sites in Lafayette County include: * The Hal W. Adams Bridge, built in 1947 across the Suwannee River north of Mayo. It was Florida's first suspension bridge. * The (second) Old Lafayette County Courthouse, built in 1893-1894, now an inn. * The current Lafayette County Courthouse, built in 1908. ==Land== According to the U.S. Census Bureau, the county has a total area of , of which is land and (0.8%) is water. === Parks === Parks in the county include Lafayette Blue Springs State Park and Troy Springs State Park, both accessible to the Suwannee River. === Counties nearby === *Suwannee County, Florida - east *Gilchrist County, Florida - southeast *Dixie County, Florida - south *Taylor County, Florida - west *Madison County, Florida - northwest ==People== At the 2020 census, 8,226 people lived in the county. There were 2,727 households and 1,537 people who did not live in households. The population density was 15.1 people per square mile (5.8/km²). The median age was 44.3 years (42.4 for males, 47.7 for females). Of the total population, 17.1% were under 18 years old, 62.3% were 18 to 64, and 20.6% were 65 or over. Males made up 57.9% and females made up 42.1% of the people. The population was 73.8% White (non-Latino), 12.4% Black (non-Latino), 11.4% Hispanic or Latino, and 1.8% Two or more races (non-Latino). Less than 1% of the people were from other races. Of the 2,727 households, 1,891 (69.3%) were families, 782 (28.7%) had children under 18, 1,455 (53.4%) had a married couple, and 694 (25.4%) had one person living alone. The average household size was 2.5 people. There were 3,284 housing units, and 83.0% had people living in them all year. Of these households, 77.9% were owner-occupied, while 22.1% were renters. As of 2022, the median (middle) yearly income for a household was about $57,852, and the median income for a family was about $59,633. The per capita income was about $20,073. About 17.7% of families and 19.3% of all people in Lafayette County lived below the poverty line. This includes 25.3% of children under 18 years old and 18.1% of people over 65 years old. == Municipalities == ===Incorporated=== *Mayo ===Unincorporated=== *Alton *Day *Cook's Hammock, Florida == Politics == Lafayette County is strongly Republican. It has voted for the Republican candidate in every presidential election since 1984. ==References== ==Other websites== ===Government websites/Constitutional offices=== * Lafayette County Board of County Commissioners * Lafayette County Supervisor of Elections * Lafayette County Property Appraiser * Lafayette County Sheriff's Office * Lafayette County Tax Collector ====Special districts ==== * Lafayette County Schools * Suwannee River Water Management District ====Judicial branch==== * Lafayette County Clerk of Courts * Public Defender, 3rd Judicial Circuit of Florida serving Columbia, Dixie, Hamilton, Lafayette, Madison, Suwannee, and Taylor Counties * Office of the State Attorney, 3rd Judicial Circuit of Florida * Circuit and County Court for the 3rd Judicial Circuit of Florida Category:Florida counties Category:1853 establishments in Florida",
 "title": "Lafayette County, Florida"
}