{
 "id": "295208",
 "text": "Marion County is a county in the U.S. state of Florida. At the 2020 census, 375,908 people lived there. Its county seat is Ocala. Marion County is part of the Ocala Metropolitan Statistical Area. ==History== Marion County was created in 1844 from portions of Alachua, Mosquito (Orange), and Hillsborough counties. Until 1853, Marion County included most of what are now Lake and Sumter counties. The county is named after General Francis Marion of South Carolina, a guerilla fighter and hero of the American Revolutionary War. Many of the early settlers of Marion County were from South Carolina. The county motto is \"Kingdom of the Sun.\" Farms in the county are known for breeding champion race horses such as Affirmed and Needles. ==Land== According to the 2000 census, the county has a total area of , of which (or 94.94%) is land and (or 5.06%) is water. Marion County is generally composed of rolling hills, some high and some low. The majority of its trees consist of live oaks, pine, and palm trees. Marion County is considered the southernmost county in North Central Florida, and the northernmost county in Central Florida. It is about a two hour drive from many of Florida's major cities. Orlando is 75 minutes to the southeast while Daytona Beach is about 90 minutes to the east. Tampa is about 75 minutes to the southwest. Jacksonville is roughly a two hour drive northeast. Miami is about five hours to the southeast. Fort Lauderdale is about a four-hour drive from Marion County. Marion County also has three large lakes at its opposite borders. Orange Lake is in the far northern part of Marion County, near the border with Alachua County. Lake Kerr is in the northeastern part of the county, near the town of Salt Springs. Lake Weir, the largest of the three, is in the far southern region near the border with Lake County. Part of Lake George is also in Marion County. Marion County is inland, centered between the Atlantic Ocean to the east and the Gulf of Mexico to the west. Because of this, Marion County is not affected as much by hurricanes compared to the more coastal counties to its east and west. However, tornadoes are a major threat to this region of the state. Although Marion County is not near either of Florida's coasts, it is situated slightly to the west, so it takes a little less than an hour to get to the Gulf of Mexico while it takes about half an hour longer to get to the Atlantic Ocean. ===Counties nearby=== * Putnam County, Florida - northeast * Volusia County, Florida - east * Lake County, Florida - southeast * Sumter County, Florida - south * Citrus County, Florida - southwest * Levy County, Florida - west * Alachua County, Florida - northwest ===National protected area=== * Ocala National Forest (part) ==People== At the 2020 census, 375,908 people lived in the county. There were 156,906 households and 9,681 people who did not live in households. The population density was 236.7 people per square mile (91.4/km²). The median age was 50.3 years (48.8 for males, 51.7 for females). Of the total population, 18.0% were under 18 years old, 52.2% were 18 to 64, and 29.8% were 65 or over. Males made up 47.9% and females made up 52.1% of the people. The population was 67.5% White (non-Latino), 14.9% Hispanic or Latino, 11.4% Black (non- Latino), 1.6% Asian, and 3.9% Two or more races (non-Latino). Less than 1% of the people were from other races. Of the 156,906 households, 102,412 (65.3%) were families, 35,434 (22.6%) had children under 18, 74,486 (47.5%) had a married couple, and 44500 (28.4%) had one person living alone. The average household size was 2.3 people. There were 177,380 housing units, and 88.5% had people living in them all year. Of these households, 75.5% were owner- occupied, while 24.5% were renters. As of 2022, the median (middle) yearly income for a household was about $55,265, and the median income for a family was about $66,666. The per capita income was about $31,086. About 9.7% of families and 14.4% of all people in Marion County lived below the poverty line. This includes 21.4% of children under 18 years old and 9.5% of people over 65 years old. ==Government== The Florida Department of Corrections operates facilities in unincorporated areas in the county, including the Lowell Correctional Institution and the Lowell Annex.\"Lowell Correctional Institution .\" Florida Department of Corrections. Retrieved on August 31, 2010.\"Lowell Annex .\" Florida Department of Corrections. Retrieved on August 31, 2010. The annex houses Florida's female death row.\"Death Row Fact Sheet .\" Florida Department of Corrections. Retrieved on August 15, 2010. == Cities and towns == ===Cities=== * Belleview * Dunnellon * McIntosh * Ocala * Reddick ===Unincorporated=== * Summerfield * Fort McCoy * Marion Oaks * Silver Springs Shores * Salt Springs * Anthony * The Villages (partly) * Orange Springs == Schools == ===Public school system=== * 28 elementary schools * 8 middle schools * 1 4-8 school * 1 k-8 center * 8 high schools * 3 charter schools * 14 special needs schools === Elementary schools === * Anthony Elementary School * Belleview Elementary School * Belleview-Santos Elementary School * College Park Elementary School * Dr. N.H. Jones Elementary (Magnet) * Dunnellon Elementary School * East Marion Elementary School * Eighth Street Elementary School * Emerald Shores Elementary School * Evergreen Elementary School * Fessenden Elementary School * Fort McCoy School (K-8) * Greenway Elementary School * Hammett Bowen Jr. Elementary School * Harbour View Elementary School * Horizon Academy at Marion Oaks(5th-8th) * Madison Street Academy of Visual and Performing Arts (Magnet) * Maplewood Elementary School * Oakcrest Elementary School * Ocala Springs Elementary School * Reddick-Collier Elementary School * Romeo Elementary School * Saddlewood Elementary School * Shady Hill Elementary School * South Ocala Elementary School * Sparr Elementary School * Stanton-Weirsdale Elementary School * Sunrise Elementary School * Ward-Highlands Elementary School * Wyomina Park Elementary School === Middle schools === * Belleview Middle School * Dunnellon Middle School * Fort King Middle School * Horizon Academy at Marion Oaks(5th-8th) * Howard Middle School * Lake Weir Middle School * Liberty Middle School * North Marion Middle School * Osceola Middle School === High schools === * Vanguard High School * Belleview High School * Dunnellon High School * Forest High School * Lake Weir High School * Marion Technical Institute * North Marion High School * Trinity Catholic High School * West Port High School ==References== ==Other websites== ===Government websites/Constitutional offices=== * Marion County Fire Rescue * Marion County Board of County Commissioners * Marion County Supervisor of Elections * Marion County Property Appraiser * Marion County Sheriff's Office * Marion County Tax Collector * Marion County Public Schools Homepage ====Special districts ==== * Marion County School Board * Southwest Florida Water Management District * St. Johns River Water Management District ====Judicial branch==== * Marion County Clerk of Courts * Public Defender, 5th Judicial Circuit of Florida serving Citrus, Hernando, Lake, Marion, and Sumter counties * Office of the State Attorney, 5th Judicial Circuit of Florida * Circuit and County Court for the 5th Judicial Circuit of Florida === Tourism websites === * Everything you need to know about The Rainbow River, Dunnellon Florida * Ocala/Marion County Chamber of Commerce * Ocala/Marion Visitors' & Convention Bureau Category:Florida counties Category:1844 establishments in Florida Territory",
 "title": "Marion County, Florida"
}