{
 "id": "295442",
 "text": "The Middle Jurassic is the second geological epoch in the Jurassic. It began 174.1 million years ago, and ended at 163.5 million years ago. In the Middle Jurassic, Pangaea began to split apart. It began to separate into Laurasia and Gondwana, and the Atlantic Ocean formed. Tectonic activities closed the Paleo- Tethys Ocean.The Tethys Ocean: an ancient seaway approximately in the position of the Mediterranean. A subduction zoneFormed by an oceanic plate sliding under a continental plate. on the coast of western North America continues to create the ancestral Rocky Mountains. == Life of the epoch == === Marine life === During this time, marine life (including ammonites and bivalves) flourished. Ichthyosaurs, although common, are reduced in diversity. A type of crocodilians first appeared. Plesiosaurs became common at this time. The top marine predators, the pliosaurs, grew to the size of killer whales and larger e.g. Pliosaurus, Liopleurodon. === Terrestrial life === New types of dinosaurs evolved on land. Cetiosaurus was an early sauropod found in England in the mid-19th century.\"Cetiosaurus.\" In: Dodson, Peter et al. The Age of Dinosaurs. Publications International, p65. . The environment in which Cetiosaurus lived was floodplain and open woodland. Brachiosaurs and Megalosaurus also lived in this environment. The cynodont therapsids flourished with the dinosaurs, but they were only shrew-sized. None grew larger than a badger. One group of cynodonts, the Trithelodonts were becoming rare and eventually became extinct at the end of this epoch. The Tritylodonts were still common, though. In this epoch \"true\" mammals evolved from a group of cynodonts. ===Flora=== Conifers were dominant in the Middle Jurassic. Other plants, such as ginkgoes, cycads, and ferns were also common. These are the trees which the large herbivores ate. == Related pages == *Jurassic *Lower Jurassic *Upper Jurassic ==References== Category:Jurassic",
 "title": "Middle Jurassic"
}