{
 "id": "295479",
 "text": "The Ustaše (also called Ustashas or Ustashi) was a Croatian independence movement. It engaged in terrorist activities before World War II.Der kroatische Ustascha-Staat, pages 19-27 Loosely associated with Fascist Italy and Nazi Germany, the Ustaše ruled an independent Croatian state, after Yugoslavia was occupied by Italy and Germany. * * * At the end of World War II, much of the Ustaše was disbanded as result of the partisans. However factions still existed, new groups were also formed such as the Crusaders (Križari). ==Founding== Croatian politician Stjepan Radić was shot in October 1928 and died a month later. Alexander I, King of Yugoslavia, imposed a royal dictatorship in January 1929 and made all political parties illegal. Ante Pavelić left the country for Vienna. He and Gustav Perčec, a former Austro- Hungarian Lieutenant colonel, established contact with an organization of Macedonian political émigré. These two groups agreed to coordinate their political activities for achieving full independence for Macedonia and Croatia. Pavelić secretly met with the leader of outlawed Internal Macedonian Revolutionary Organization, Ivan Mikhailov, a declared enemy of Yugoslavia, and agreed with him to cooperate against the Yugoslav state. The Court for the Preservation of the State in Belgrade sentenced Pavelić and Perčec to death on 17 July 1929.War and revolution in Yugoslavia, 1941-1945: occupation and collaboration by Jozo Tomasevich Stanford University Press, 2001 page 33 The exiles started organizing support for their cause among the Croatian emigration in Europe, North America, and South America. The Ustaše organization was small in numbers and was organized in military patterns. They fought Yugoslav statehood by means of terror.Battling terrorism: legal perspectives on the use of force and the war on terror by Jackson Nyamuya Maogoto, Ashgate Publishing, Ltd., 2005 page 26 ==Ideology== The roots of the Ustaše ideology were in the Croatian nationalism of the nineteenth century. The Ustaše ideological system was chiefly based on the traditional pure Croatian nationalism of Ante Starčević. About it, W. Safran wroteThe secular and the sacred: nation, religion and politics by William Safran, Taylor & Francis, 2003, page 168 > But another vision of Croatian identity that was closely tied to the > Catholic Church and the Vatican and was led by an ex-seminarist Ante > Starcevic became the ideological precursor to the Ustase. Starcevic and his > followers emphasized the high achievements of Western Catholic, Croatian > culture, while Serbian culture was depicted as oriental and inferior. ===Racism=== Starčević's racism was elaborated by Ustaša Ivo Pilar [under the pseudonym L. von Südland].Die südslawische Frage und der Weltkrieg: Übersichtliche Darstellung des Gesamt-problems By L. von Südland, 1918, Manz His book was translated into Croatian in 1943, by Pavelić's regime, as one of the tenets of his Ustaše and his Independent State of Croatia.\"Blood And Homeland\": Eugenics And Racial Nationalism in Central And Southeast Europe, 1900-1940 edited by Marius Turda, Paul Weindling Published 2006 Central European University Press Rory Yeomans article: Of \"Yugoslav Barbarians\" and Croatian Gentlemen Scholars: Nationalist Ideology and Racial Anthropology in Interwar YugoslaviaIrina Ognyanova: Nationalism and National Policy in Independent State of Croatia (1941–1945) . in: Topics in Feminism, History and Philosophy, IWM Junior Visiting Fellows Conferences, Vol. 6, edited by Rogers, Dorothy, Joshua Wheeler, Marína Zavacká, and Shawna Casebier. Vienna: IWM 2000. \"In fact, the roots of the Ustasha ideology can be found in the Croatian nationalism of the nineteenth century. The Ustasha ideological system was just a replica of the traditional pure Croatian nationalism of Ante Starcevic. His ideology contained all important elements of those of the extreme Croatian nationalism in the twentieth century. Starcevic’s writings reveal an attitude similar to that of the contemporary Croatian nationalists: Frankovci at the beginning of the twentieth century and Ustashas in the 1930s.\" The Ustaše said that Eastern Orthodoxy, as a symbol of Serbian nationalism to them, was their greatest enemy. The Ustaše never recognized the existence of a Serb people on the territories of Croatia or Bosnia. They recognized only \"Croats of the Eastern faith.\" They also called Bosnian Muslims \"Croats of the Islamic faith,\"(the latter which they wanted to force to convert to Christianity) but they had a stronger ethnic dislike of Serbs. ===Syncretism=== Simultaneously, the Ustaše borrowed from traditional Croatian nationalism, the Nazism of Hitler, the fascism of Mussolini, and even from the program of the Croatian Peasant Party.[Ognyanova, Irina 2000], page 6 The Ustaše aimed at an ethnically \"pure\" Croatia. They saw the Serbs that lived in Croatia and Bosnia and Herzegovina as their biggest obstacle. Ustaše ministers Mile Budak, Mirko Puk and Milovan Žanić declared in May 1941 that the goal of the new Ustaše policy was an ethnically clean Croatia. They announced the strategy on July 22, 1941 Hitler's renegades: foreign nationals in the service of the Third Reich by Christopher Ailsby, Brassey's, 2004 page 156 to achieve their goal, which resembled the bloodiest religious wars:Vatikan i Jasenovac:dokumenti by Vladimir Dedijer, Rad, 1987, page 473 ====Persecution of ethnic minorities==== The Ustaše persecuted the Serbs, who were Orthodox Christians. They were tolerant toward the Muslims Bosniaks, claiming that the Muslims were actually ethnic Croats that converted to Islam during the Ottoman Turk occupation of Bosnia. The state even converted a former museum in Zagreb for use as a mosque. The basic principles of the movement were laid out by Pavelić in his 1929 pamphlet \"Principles of the Ustaše Movement.\"The Gypsies of Eastern Europe by David Crowe, John Kolsti, M.E. Sharpe, 1991, page 86 The Ustaše's problem with the Nazi ideology was that the Croats are Slavs and were considered inferior by the Nazis. Ustaše ideology thus created a theory about a pseudo-Gothic origin of the Croats in order to raise their standing on the Aryan ladder.Nationalism, historiography and the (re)construction of the past by Claire Norton, New Academia Publishing, 2007, page 86 ==Terrorism== At Janka Puszta training facility in Hungary, IMRO terrorists trained Ustaše operatives in bomb-making and in conspiracy. The Ustaše carried out about half-dozen assassinations of Yugoslavian officials or pro-Serb civilians. They bombed a dozen trains, including the Orient Express, and other public targets during the first four years of their existence.Terrorism: a history by Randall D. Law, Polity, 2009, page 157 The Yugoslav Government complained to the League of Nations and forced Hungary to close down Janka Pusta Ustaše training camp. Internal power struggle, and discovery that Perčec's mistress was a Yugoslav police informant, led to Perčec's assassination by Pavelić in 1933.Conflict studies, Issues 103-117, Institute for the Study of Conflict, Current Affairs Research Services Centre (London, England), Current Affairs Research Service Centre, 1979 ===Funding=== The Ustaše received the most money from Mussolini. He also supplied the group with an Italian headquarters that changed whenever Yugoslavia managed to track it down. Camps for training terrorists and saboteurs were set up in Italy, chiefly at Brescia and Borgotaro. An armed insurrection was attempted in 1933. The Ustaše,\"Croatia: between Europe and the Balkans\" by William Bartlett, Routledge 2003 Page 18 Croatian Party of Right, had established a terrorist organization known as the Ustashe Croatian Revolutionary Organization\"Organizing for Total War\" by American Academy of Political and Social Science, Francis James Brown, American Academy of Political and Social Science 1942 Page 225 As an interesting detail for the American public it may be reported that the terrorist organization Ustashe, paid by the Italians, was sending money to the United States to support publications and spread propaganda among the Croats in America. armed by the Italians, attempted to invade Yugoslavia by crossing the Adriatic Sea in motorboats. This was unsuccessful. The lack of success may have led to the decision to assassinate King Alexander I of Yugoslavia. ===Assassination attempts=== Two assassination attempts of Yugoslav royal family members were made. Alexander was murdered at Marseilles on 9 October 1934, along with the French Foreign Minister, Louis Barthou. After the assassination, Mussolini renounced the Ustaše, and the group went deeply underground. The lack of armed protection for the Yugoslav king, and the general laxity of security precautions when it was well known that one attempt had already been made on Alexander's life, are grim tributes to Pavelić organizational abilities. He had apparently been able to bribe a high official in the Surete General. The Prefect of Police of Marseilles, Jouhannaud, was subsequently removed from office.Headquarters Counter Intelligence Corps Allied Forces Headquarters APO 512, 30 January 1947: Present Whereabouts and Past Background of Ante Pavelic, Croat Quisling The assassin was Vlada Georgief Cernozemski, a Bulgarian, who had already killed two members of the Bulgarian Parliament in Sofia. His accomplices were arrested and sentenced to life imprisonment. Pavelic was condemned to death by France, but escaped.The Vatican's Holocaust by Avro Manhattan, Ozark, Springfield MO 1986 Page 20 ====Diplomatic disputes==== Yugoslavia brought charges against Hungary and Italy before the League of Nations in November 1934. They had evidence that Italy and Hungary had openly conspired against her sovereignty. The League of Nations did not discuss the Italian conspiracy against the national sovereignty of Yugoslavia. Italy refused to extradite Pavelić and Kvaternik to either France or Yugoslavia, and Hungary bore the brunt of the charges.Present Whereabouts and Past Background of Ante Pavelic, Croat Quisling Headquarters Counter Intelligence Corps Allied Forces Headquarters, APO 512 30 January 1947 ====Brief crackdown==== After the assassination, the Ustaše activities were prevented completely. A great number of Ustaše were caught and arrested in Italy, Germany, and Hungary. Italy interned many Ustaše to the Lipari camp, where many died. Janka Puszta Ustaše camp was raided by Hungarian police, who arrested some of them. Ustaše from Germany escaped to Switzerland, France, and England.Ustaše i Treći Reich by Bogdan Krizman, Globus, 1983 p. 410 Widespread outrage at the assassination of Alexander and Barthou led to the first international efforts to combat terrorism since the St. Petersburg Protocol of 1904. The issue was taken up by the League of Nations, which passed the convention on the Prevention and Punishment of Terrorism in 1937. After March 1937, when Italy and Yugoslavia signed a friendship treaty, many Ustaše in Italy were extradited to Yugoslavia. ==World War II== ===Invasion of Yugoslavia=== Germany and Italy invaded Yugoslavia on 6 April 1941. On April 10, the most senior home-based Ustaša, Slavko Kvaternik, took control of the police in Zagreb. ===Establishment of the Independent State of Croatia=== In a radio broadcast that day he proclaimed the formation of the Independent State of Croatia (Serbo-Croatian: Nezavisna Država Hrvatska, NDH). Maček issued a statement that day, calling on all Croatians to cooperate with the new authorities.Vladko Maček, In the Struggle for Freedom (New York: Robert Speller & Sons, 1957) p 230. Meanwhile, Pavelić and several hundred Ustaše left their camps in Italy for Zagreb, where Pavelić set up his government on 17 April. He gave himself the title of Poglavnik – equivalent to Führer in German. The NDH included the territory of Croatia, Srem, and Bosnia- Herzegovina – except parts of the Dalmatian coastal area, which were ceded to the Italians. De facto control over this territory varied for the majority of the war, as the partisans grew more successful, while the Germans and Italians increasingly exercised direct control over areas of their interest. ===Domestic policy=== All who opposed or threatened the Ustaše were banned. In early 1941, Jews and Serbs were ordered to leave certain areas of Zagreb. ===Foreign policy=== Pavelić first met with Adolf Hitler on June 6, 1941. Mile Budak, then a minister in Pavelić's government, publicly proclaimed the violent racial policy of the state on July 22, 1941.Mainstream, Volume 38, Issues 6-35, N. Chakravartty, 2000, Page 18 Maks Luburić, one of the chiefs of the secret police, started building concentration camps in the summer of the same year. Ustaše activities in villages across the Dinaric Alps led to the Italians and the Germans expressing disquiet. As early as July 10, 1941, Wehrmacht General Edmund Glaise von Horstenau reported to the German High Command, the Oberkommando der Wehrmacht (OKW):http://samvak.tripod.com/pp55.html The Ustaše - The Insurgents and the Swastika (Part IV) General Edmund Glaise von Horstenau to the OKW, July 10, 1941; report to Reichsführer SS Heinrich Himmler from the Geheime Staatspolizei, dated February 17, 1942. See also Trifković, Srđa, 'The Real Genocide in Yugoslavia: Independent Croatia of 1941 Revisited'. ====February 17, 1942 report==== A Gestapo report to Reichsführer SS Heinrich Himmler, dated February 17, 1942, stated that: ====Territorial disputes with Italy==== Italian troops in the field had competing territorial claims with their Ustaše allies and had cooperated from the start with Chetnik units operating in the southern areas that they controlled. Hitler tried to insist that Mussolini should have his forces work with the Ustaše, but senior Italian commanders, such as General Mario Roatta, ignored such orders. ===Genocides=== The Ustaše had race laws like those of Nazi Germany. These laws were aimed against Jews, Roma, and Serbs, who were declared enemies of the Croatian people. Serbs, Jews, Roma and anti-fascist Croats and Bosniaks, including communists, were interned in concentration camps, the largest of which was the Jasenovac concentration camp, where many were killed by Ustaše militia. ====Death toll==== The exact number of victims is not known. The number of murdered Jews is fairly reliable: around 32,000 Jews were killed during World War II on their territory. Gypsies (Yugoslav Roma) numbered around 40,000 fewer after the war. Of the number of Serbs who died, estimates vary between 300,000 and 700,000. During World War II, various German military commanders gave different figures for the number of Serbs, Jews and others killed on the territory of the Independent State of Croatia. They circulated figures of 400,000 Serbs (Alexander Lehr); 350,000 Serbs (Lothar Rendulic); between 300,000 (Edmund Glaise von Horstenau); more than \"3/4 of a million Serbs\" (Hermann Neubacher) in 1943; 600,000–700,000 until March 1944 (Ernst Fick); 700,000 (Massenbach). The history textbooks in the Socialist Federal Republic of Yugoslavia cited 700,000 as the total number of victims at Jasenovac. According to the Simon Wiesenthal Center (citing the Encyclopedia of the Holocaust), \"Ustasa terrorists killed 500,000 Serbs, expelled 250,000 and forced 250,000 to convert to Catholicism. They murdered thousands of Jews and Gypsies.\"Page Has Moved - Simon Wiesenthal Center Multimedia Learning Center The Jasenovac Memorial Area, currently headed by Slavko Goldstein, keeps a list of 59,188 names of Jasenovac victims that was gathered by government officials in Belgrade in 1964. The previous head of the Memorial Area, Simo Brdar, estimated at least 365,000 dead at Jasenovac. The Muslim Bosniaks community from Zenica published a declaration stressing the special position of Muslim Roma, and with help of Muslim religious authorities in Sarajevo, the declaration influenced the Ustaše authorities to make a special provision in May 1942 to spare Muslim Roma residing in Bosnia and Herzegovina from deportation to the concentration camps. The Belgrade Museum of the Holocaust compiled a list of over 77,000 names of Jasenovac victims. It was previously headed by Milan Bulajić, who supported the claim of a total of 700,000 victims. The current administration of the Museum has further expanded the list to include a bit over 80,000 names. In the 1961 trial of Adolf Eichmann, Alexander Arnon – secretary of the Jewish Community in Zagreb – testified about the treatment of Jews in Yugoslavia during the war. Alexander Arnon's testimony included estimates of 600,000 killed in the Jasenovac concentration camp. ===Concentration camps=== The first batch of concentration camps was formed in spring 1941: * Pag * Đakovo * Tenja, near Osijek * Loborgrad, in Zagorje * Jadovno, near Gospić * Danica, near Koprivnica * Kruščica, near Vitez and Travnik in Bosnia These six camps were closed by October 1942. The Jasenovac complex was built between August 1941 and February 1942. The first two camps, Krapje and Bročica, were closed in November 1941. The three newer camps continued to function until the end of the war: * Kozara (Jasenovac IV) * Ciglana (Jasenovac III) * Stara Gradiška (Jasenovac V) ====Other camps==== There were also camps in: * Gospić * Kerestinec, near Zagreb * Lepoglava, near Varaždin * Jastrebarsko, between Zagreb and Karlovac - Jastrebarsko Children's Concentration Camp ====Prisoners==== Numbers of prisoners: * From 300,000 to 350,000 up to 700,000 in Jasenovac * Around 35,000 in Gospić * Around 8,500 in Pag * Around 3,000 in Đakovo * 1,018 in Jastrebarsko * Around 1,000 in Lepoglava ==Connections with the Roman Catholic Church== Throughout the Catholic Ustaše-led NDH's existence, the Roman Catholic Church played a significant role in Ustaše's genocides. * * * * * Alojzije Cardinal Stepinac, then the Archbishop of Zagreb, was seen by the survivors as an Ustaše war criminal. Stepinac was crucial in the Church's decision to sponsor the Ustaše due to his perception that the Ustaše was the * guarantor of Croatia as the \"Bulwark of Catholicism\" against Islam and Orthodox Christianity * hope for a Catholic state to reconvert the 200,000 Serbian Orthodox Christians who changed from their Catholic faith following WWI ===NDH leadership=== In May 1941, Pope Pius XII met the NDH leader Ante Pavelić – a devout Catholic himself – with Stepinac. It was followed by Pope Pius XII's posting of Giuseppe Ramiro Marcone (1882–1952) as his rep to the NDH, despite Pope Pius XII's clear knowledge of the ongoing genocides of Croatian Jews, Roma and Serbs. Aligned with the Pope's will, Stepinac only disagreed with brutalizing Catholic Jews, but not the vast majority of non-Catholic Jews. ===Pogroms=== Pogroms against Croatian Jews, Roma and Serbs were often incited by Catholic priests who hated the presence of non-Catholics in their parishes. To avoid immediate death, many Serbs were forced to convert to Catholicism, while Jews who converted were still killed as the Ustaše regime followed the Nazi racial policies on seeking to wipe out Jews as a race rather than a religion. * * * * * Under subordinate bishops' pressure, Stepinac told the Pope that they would ask Pavelić to stop the massacres and forced conversions, while sending Pavelić a different letter in which they asked for neither to stop. Instead, they asked Pavelić to delegate them the conversion authority to make the persecutions look more \"humane\". ===Support for the NDH=== In April 1942, Stepinac visited the Vatican for the second time, when he presented a report to Vatican's State Secretary Luigi Cardinal Maglione that praised the Ustaše regime's crackdown on abortion and pornography, while denying that Ustaše's genocides were planned. The Vatican kept full diplomatic relations with the NDH until its defeat in 1945. To stay friendly with the Jews, Stepinac arranged for Chief Rabbi Freiburg of Zagreb to write the Pope a letter to thank him for the help, which the Church had not actually offered. Chief Rabbi Freiburg of Zagreb was killed in the Auschwitz concentration camp on 8 May 1943 upon arrival for protesting the Nazi brutalization of his fellow Jews. ===Participation in the Holocaust=== Contrary to the common perception that the Roman Catholic Church was opposed to Nazism and the Holocaust, priests and bishops throughout the Church hierarchy were highly sympathetic to them due to classical antisemitism and their belief that Nazi Germany was the \"lesser evil\". * * * * * * * * * * Within the lower clergy, many Jesuits and Franciscans were Ustaše members, who persecuted or massacred Jews, Roma and Serbs for the Ustaše regime. Some prominent Catholic perpetrators included Ivan Guberina, Mate Mugoš and Franciscan Father Bojanović, while Franciscan Dionizije Juričev and Radoslav Glavaš served as the head of the Religious Section (VO) and head of the Religious Department of the Ministry of Justice and Religion respectively to oversee forced conversions within NDH territory. Miroslav Filipović-Majstorović, the operator of the Jasenovac concentration camp in which 77,000–99,000 were killed, * * * * * was a Franciscan. In addition, Catholic priest Božidar Bralo served as the security police chief in Sarajevo to target Jews while Dyonisy Juričev as an Ustaše newspaper editor calling for all bishops to join the Ustaše to kill Jews. 81% of Croatian Jews were killed in the Holocaust. ===Plundered gold=== The Ustaše regime had sent large amounts of gold that it had plundered from Serbian and Jewish property owners during WWII into Swiss banks. Of a total of 350 million Swiss Francs, about 150 million was seized by British troops; however, the remaining 200 million (ca. 47 million dollars) reached the Vatican. Speculations exist that it is still being kept in the Vatican Bank. This was reported by the American intelligence agency SSU in October 1946. This issue is the theme of a class action lawsuit against the Vatican Bank and others. Adolf Eichmann trial witness Alexander Arnon testified about the Roman Catholic Church stance that time. > Unfortunately there were no protests. Croatia was definitely a Catholic > state. Not even the Catholic Church in Zagreb said one word against the > deportations and sufferings of the Jews. E. Fratini and D. Cluster wrote in their book The entity: Five centuries of secret Vatican espionage:The entity: five centuries of secret Vatican espionage by Eric Frattini, Dick Cluster Macmillan, 2008, page 391 > The Archbishop of Zagreb, Monisgor Alojzije Stepinac, provided Catholic > support to the Pro Nazi government of Ante Pavelic; knew right from the > start about the massacres and extermination of Serbs, Jews, and Gypsies; and > was one of the pillars of the effort to help Nazi and Croatian criminals to > escape to South America after the Second World War. Archbishop Stepinac also said this on 28 March 1941, in note of Yugoslavia's early attempts to unite Croatians and Serbs: ===Critique=== In his 1999 book Hitler's Pope: The Secret History of Pius XII, British author and journalist John Cornwell pointed out that # Pope Pius XII's allegedly anti-Nazi sermons never mentioned Jews # Pope Pius XII was silent after the Nazi roundup of 1,200 Jews below the Vatican hill on 16 October 1943most of whom were then gassed in the Auschwitz concentration camp in Nazi-occupied Poland. # the reason for (1.) and (2.) was Pope Pius XII's lifelong antisemitism preventing him from developing sympathy for Jews # Defenders of Pope Pius XII promoted lies to make him look like a hero by misclassifying his neutral correspondence with the Nazis as \"protests\" and overstating his interventions in Nazi deportations of Jews ==Post-war period== At the end of war, Ustaše continued fighting for a short while after the formal surrender of German Army Group E on 9 May 1945, and many refugees attempted to escape to Austria. Pavelić, however, with the help of associates among the Franciscans, managed to escape and hide in Austria and Rome, later fleeing to Argentina. The remaining Ustaše went underground or fled to South America and countries such as Canada, Australia, Germany, with the assistance of Roman Catholic churches and their grassroots supporters Some of them persisted in their crusade against Yugoslavia. After the Second World War was over, the Ustaše who had managed to escape from Yugoslav territory, including Pavelić, were smuggled to South America. It is widely documented that this was done through rat lines operated by members of the organization who were Catholic priests and had previously secured positions at the Vatican. Members of the Illyrian College of San Girolamo in Rome were reputedly involved in this: friars Krunoslav Draganović, Petranović, and Dominik Mandić. ===Cold War=== ====Croatian Liberation Movement==== With the defeat of the Independent State of Croatia, the movement ceased to exist. Infighting over the failure to establish a Croatian state also fragmented the surviving Ustaše. Ante Pavelić formed the Croatian Liberation Movement, which drew several of the former state's leaders. Vjekoslav Vrančić founded a reformed Croatian Liberation Movement, and was its leader. ====Croatian National Resistance==== Vjekoslav Luburić helped form an organization called the Odpor (Croatian National Resistance). This became the most violent of the Ustaše organizations which were born after the WWII. Luburić commanded the organization for twenty-five years from his refuge in Spain. His organization was heavily involved in racketeering, extortion, hijacking, terrorist bombings, and other violent crimes. Odpor hada radical nationalist ideology very like Ustaše ideology.Homeland calling: exile patriotism & the Balkan wars by Paul Hockenos; Cornell University Press, 2003, page 23 ====Other groups==== Another Ustaše terrorist organization, the Croatian Revolutionary Cell, Bruno Busic Department, bombed the R. S. Schullz publishing house in Percha on Lake Starnberg, Germany, on August 19, 1981. The group, which claimed to be based in Paris, used 1 kg of Swiss Mark 2 dynamite. They threatened to use two more kilograms the following week if the firm published Tito's memoirs.International terrorism in the 1980s: a chronology of events by Edward F. Mickolus, Todd Sandler, Jean Marie Murdock; Iowa State University Press, 1989 Page 186 ==Related pages== * Iron Guard * Antisemitism * Catholic Church and the Independent State of Croatia * Roman Catholics and antisemitism in the 21st century ==Footnotes== ==Other websites== * Holocaust era in Croatia: Jasenovac 1941-1945 , an on-line museum by the United States Holocaust Memorial Museum * Tied up in the Rat Lines from the Haaretz, 17/01/2006 * Principles of the Ustaše movement * The Ustasha Genocide by Marko Attila Hoare * Eichmann Trial, Tel Aviv 1961 Category:Nazism Category:Croatia Category:Fascism Category:Terrorism Category:Yugoslavia Category:World War II Category:1940s in Europe Category:History of Europe Category:History of Croatia Category:History of Yugoslavia Category:Antisemitism in Europe Category:20th century in Croatia Category:Political parties in Croatia Category:1929 establishments in Europe Category:Nationalist organizations in Europe",
 "title": "Ustaše"
}