{
 "id": "295469",
 "text": "Douglas da Silva (born 7 March 1984) is a Brazilian professional association football player who plays for Brusque as a central defender. ==Career== In 2005 he went from Brazil to Israel, where he started playing for Hapoel Kfar Saba and soon became one of the best defenders in the league. After four years with this club he went one to an Israelian top club Hapoel Tel Aviv, because his old club was relegated to the second league. With Tel Aviv he became cup winner and champion in 2010. They also played in the UEFA Champions league 2010/11 after eliminating Red Bull Salzburg in the play off round. He played in the Champions league group stage, but in December 2010 he signed with F.C. Red Bull Salzburg.In a preliminary match he was injured badly, so he missed the whole second part of the 2010/11 season. ==Honours== *Israel State Cup (1): **2010 *Israeli Premier League (1): **2009–10 *Austrian League (1): **2011–12 * Austrian Cup (1) : **2011-12 ==Career statistics== Club performance Club performance Club performance League League Cup Cup League Cup League Cup Continental Continental Total Total Season Club League Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Brazil Brazil Brazil League League Copa do Brasil Copa do Brasil League Cup League Cup South America South America Total Total 2004 Atlético Paranaense Série A 0 0 0 0 – – 0 0 0 0 Israel Israel Israel League League Israel State Cup Israel State Cup Toto Cup Toto Cup Europe Europe Total Total 2005–06 Hapoel Kfar Saba Israeli Premier League 33 1 0 0 8 0 0 0 41 1 2006–07 29 3 2 0 10 0 0 0 41 3 2007–08 31 3 2 0 6 2 0 0 39 5 2008–09 Hapoel Tel Aviv 32 3 2 1 5 1 6 1 45 6 2009–10 34 6 5 0 3 0 12 0 54 6 2010 12 3 0 0 2 1 12 2 26 6 Austria Austria Austria League League Austrian Cup Austrian Cup League Cup League Cup Europe Europe Total Total 2011 Red Bull Salzburg Bundesliga 0 0 0 0 – – 0 0 0 0 2011–12 11 0 2 0 – – 1 0 14 0 2012–13 2 0 - - – – 0 0 2 0 Total Brazil Brazil 0 0 0 0 – – 0 0 0 0 Total Israel Israel 171 19 11 1 34 4 30 3 246 27 Total Austria Austria 13 0 2 0 – – 1 0 16 0 Career total Career total Career total == References == Category:1984 births Category:Living people Category:Brazilian footballers Category:FC Red Bull Salzburg players",
 "title": "Douglas da Silva"
}