{
 "id": "295427",
 "text": "A rainband is an area of rainfall where all the clouds and precipitation are stretched out in a long line or band.Glossary of Meteorology (2009). Rainband. Retrieved on 2008-12-24. Rainbands can be stratiform or convective. They are caused by differences in temperature. When seen on a weather radar, the long narrow shape is called a banded structure.Glossary of Meteorology (2009). Banded structure. Retrieved on 2008-12-24. Rainbands in a tropical cyclone are curved and may even spiral around the center of the cyclone.Tropical cyclone. (2011). In Encyclopædia Britannica. Retrieved on 2011-05-15. Tropical cyclone rainbands include rain showers and thunderstorms. When this includes an eyewall and the eye, they make a hurricane or tropical storm. The size of rainbands around a tropical cyclone helps to measure the cyclone's intensity. Rainbands that form near and ahead of cold fronts can be squall lines which can produce tornadoes. The shape of rainbands linked with cold fronts can be changed by mountains. The mountains block the winds which can then form a low- level barrier jet. Bands of thunderstorms can form when sea breeze and land breezes meet, if enough moisture is present. Sometimes sea breeze rainbands which are ahead of a cold front, can hide the location of the cold front itself. Rainbands in an extratropical cyclone can cause large amounts of rain or snow. Behind extratropical cyclones, rainbands can form downwind of large, warmer bodies of water such as the Great Lakes. If the air is cold enough, these rainbands can cause heavy snowfalls. ==Extratropical cyclones== Rainbands ahead of warm occluded fronts and warm fronts have little upward motion.Owen Hertzman (1988). Three-Dimensional Kinematics of Rainbands in Midlatitude Cyclones. Retrieved on 2008-12-24 They tend to be wide and stratiform in nature.Yuh-Lang Lin (2007). Mesoscale Dynamics. Retrieved on 2008-12-25. In an atmosphere with rich low level moisture and vertical wind shear,Richard H. Grumm (2006). 16 November Narrow Frontal Rain band Floods and severe weather. Retrieved on 2008-12-26. narrow, convective rainbands form. These are known as squall lines, and are usually in the cyclone's warm sector, ahead of strong cold fronts associated with extratropical cyclones.Glossary of Meteorology (2009). Prefrontal squall line. Retrieved on 2008-12-24. Wider rain bands can form behind cold fronts, which usually have more stratiform, and less convective, precipitation.K. A. Browning and Robert J. Gurney (1999). Global Energy and Water Cycles. Retrieved on 2008-12-26. In colder cyclones, small bands of heavy snow can occur with a width of to .KELLY HEIDBREDER (2007). Mesoscale snow banding. Retrieved on 2008-12-24. These bands are linked with areas of frontogensis, or zones of strengthening temperature contrast.David R. Novak, Lance F. Bosart, Daniel Keyser, and Jeff S. Waldstreicher (2002). A CLIMATOLOGICAL AND COMPOSITE STUDY OF COLD SEASON BANDED PRECIPITATION IN THE NORTHEAST UNITED STATES. Retrieved on 2008-12-26. The curved air flow from extratropical cyclones bringing cold air across the relatively warm Great Lakes can lead to narrow lake effect snow bands. These can bring heavy localized snowfalls. ==Tropical cyclones== Rainbands exist on the edges of tropical cyclones, and point towards the cyclone's center of low pressure.Glossary of Meteorology (2009). Tropical cyclone. Retrieved on 2008-12-24. Rainbands within tropical cyclones need moisture and a low level pool of cooler air.A. Murata, K. Saito and M. Ueno (1999). A Numerical Study of Typhoon Flo (1990) using the MRI Mesoscale Nonhydrostatic Model. Retrieved on 2008-12-25. Bands located to from a cyclone's center move outward.Yuqing Wang (2007). How Do Outer Spiral Rainbands Affect Tropical Cyclone Structure and Intensity? Retrieved on 2008-12-26. They can cause heavy rains and squalls of wind, as well as tornadoes.NWS JetStream – Online School for Weather (2008). Tropical Cyclone Structure.| National Weather Service. Retrieved on 2008-12-24. Some rainbands move closer to the center, forming a secondary, or outer, eyewall within intense hurricanes.Jasmine Cetrone (2006). Secondary eyewall structure in Hurricane Rita: Results from RAINEX. Retrieved on 2009-01-09. Spiral rainbands are such a basic part of a tropical cyclone that in most tropical cyclone basins, use of the satellite-based Dvorak technique is the main method used to determine a tropical cyclone's maximum sustained winds.University of Wisconsin–Madison (1998).Objective Dvorak Technique. Retrieved on 2006-05-29. Using this method, the area of spiral banding and difference in temperature between the eye and eyewall is used to estimate the maximum sustained wind and a central pressure.Atlantic Oceanographic and Meteorological Laboratory (2007). Subject: H1) What is the Dvorak technique and how is it used? Retrieved on 2006-12-08. ==Forced by geography== Convective rainbands can form parallel mountains on their windward side. This is due to lee waves triggered by hills just upstream of the cloud's formation.Daniel J. Kirshbaum, George H. Bryan, Richard Rotunno, and Dale R. Durran (2006). The Triggering of Orographic Rainbands by Small-Scale Topography. Retrieved on 2008-12-25. Their spacing is normally to apart.Daniel J. Kirshbaum, Richard Rotunno, and George H. Bryan (2007). The Spacing of Orographic Rainbands Triggered by Small-Scale Topography. Retrieved on 2008-12-25. When rainbands near frontal zones get close to steep mountains, a low-level barrier jet stream forms parallel to and just before the mountain ridge. This slows down the frontal rainband just before the mountain barrier.J. D. Doyle (1997). The influence of mesoscale orography on a coastal jet and rainband. Retrieved on 2008-12-25. If enough moisture is present, sea breeze and land breeze fronts can form convective rainbands. Sea breeze front thunderstorm lines can become strong enough to hide the location of an approaching cold front by evening.A. Rodin (1995). Interaction of a cold front with a sea-breeze front numerical simulations. Retrieved on 2008-12-25. The edge of ocean currents can cause thunderstorm bands due to heat differences where they meet.Eric D. Conway (1997). An Introduction to Satellite Image Interpretation. Retrieved on 2008-12-26. Downwind of islands, rainbands can form when low level winds meet downwind of the island edges. Offshore California, this has been noted in the wake of cold fronts.Ivory J. Small (1999). AN OBSERVATIONAL STUDY OF ISLAND EFFECT BANDS: PRECIPITATION PRODUCERS IN SOUTHERN CALIFORNIA. Retrieved on 2008-12-26. == References == == Other websites == * * * Category:Precipitation Category:Tropical cyclones",
 "title": "Rainband"
}