{
 "id": "295572",
 "text": "A motorcade (or convoy, carcade, autocade) is a number of vehicles driving in the same direction on official business. == Uses of motorcades == === VIPs === Motorcades can be used to transport a very important person (VIP), usually a political figure. Such a motorcade is usually accompanied by police cars and other protection. This is to make sure the people in the motorcade are safe. For instance, motorcades for presidents often have four to six armoured cars, with police motorcycles and cars going in front and behind. Depending on the size of the motorcade and who it is carrying, streets may be completely blocked off so no-one else can use them. This is common for the security of heads of state or government. === Protests and demonstrations === Motorcades can be used as protests and demonstrations. A large, organised, group of vehicles will travel a busy route at very slow speed. They do this to deliberately cause traffic disruption. This is often in relation to protest groups that have access to many large vehicles, such as truckers and farmers. === Funerals === A funeral cortege is a group of mourners following a hearse in a motorcade of cars. Image:Staatsbesuch Elisabeth64.jpg|Motorcade for the British monarch, Queen Elizabeth II, in Koblenz, Germany, 1965 Image:Presidential motorcade inaugural 2001.jpg|Presidential motorcade following the inauguration of United States President George W. Bush, January 20, 2001 Image:Reagan funeral motorcade 1.jpg|Funeral motorcade for former United States President Ronald Reagan in Simi Valley, California, 2004 Image:Funeral of Patriarch Alexy II-11.jpg|Funeral motorcade of Russian Patriarch Alexy II Image:Motorcade Winnipeg Queen Elizabeth II.jpg|The motorcade for the Canadian monarch, Queen Elizabeth II, on route to 17 Wing CFB Winnipeg, July 3, 2010 ==References== == Other websites == *Detailed description of the motorcade of the President of the United States Category:Diplomacy Category:Security Category:Road transport",
 "title": "Motorcade"
}