{
 "id": "295568",
 "text": "John F. Kennedy, the 35th president of the United States, was shot and killed in Dallas, Texas on November 22, 1963. This happened while he was riding in the presidential motorcade through Dealey Plaza with his wife Jackie, Texas Governor John Connally and Connally's wife Nellie. == Shooting and death == As the car drove into Dealey Plaza, shots were fired. Kennedy was shot once in the throat, and once in the head. It happened at 12:30 p.m. Central Standard Time (18:30 UTC). The motorcade drove to Parkland Memorial Hospital away. At 1:00 p.m., Kennedy was pronounced dead. Lee Harvey Oswald was the main suspect in the murder. He was arrested on the same day for the murder of a policeman, J. D. Tippit. He was charged with both murders later that night.Tippit murder affidavit: text, cover. Kennedy murder affidavit: text, cover. Oswald denied shooting anyone.Warren Commission Hearings, vol. 20, p. 366, Kantor Exhibit No. 3 — Handwritten notes made by Seth Kantor concerning events surrounding the assassination. Oswald was shot by Jack RubyTestimony of Jack Ruby, Warren Commission Hearings, vol. 5, pp. 198–200. two days later, on November 24. This was when Oswald was being moved from the police station to a jail. He died in Parkland Hospital. The event left a lasting impression on many worldwide. As with the December 7, 1941 attack on Pearl Harbor before it and the September 11 attacks after it, asking \"Where were you when you heard about President Kennedy's assassination\" would become a common topic of discussion. == Investigations == An investigation into what happened was done by the Warren Commission in 1963–1964. It took 10 months. The commission decided that Oswald was the only person involved, and he had fired three shots from the window of a warehouse on the corner of Dealey Plaza. No one else was involved. The man who murdered Oswald, Jack Ruby, was also said to have acted alone. Most people at the time believed this was true. However, other alternative theories as to what could have happened have developed. Surveys from 1966 to 2004 found that as many as 80 percent of Americans have suspected that there was a plot or cover-up.Jarrett Murphy, 40 Years Later: Who Killed JFK?, CBS News, November 21, 2003. Another investigation was done by the United States House Select Committee on Assassinations (HSCA) in 1979. They found that President John F. Kennedy was probably killed as a result of a conspiracy (a secret plot). The HSCA found both the original FBI investigation and the Warren Commission Report to have big mistakes. They agree with the Commission that Oswald fired all the shots. But they say that there were at least four shots fired. They also say that it was very likely that two gunmen fired at the President. No gunmen or groups involved in the conspiracy were pointed out by the committee. They said that the CIA, the Soviet Union, organized crime and several other groups were not involved. == Conspiracy theories == The assassination is still the subject of a lot of debate. There are a lot of conspiracy theories. Some researchers have suggested that Oswald was not the shooter. Others have suggested that he conspired with others to kill the president. Most of these theories accuse criminal groups, the military–industrial complex, the government of Cuba, the KGB, or the CIA. Lyndon Johnson, George H. W. Bush and Sam Giancana are among those accused. That mob boss Sam Giancana was responsible is supported by the account of his brother and nephew.Giancana, Sam & Chuck [1992] 1998. Double Cross: the story of the man who controlled America. New York: Little, Brown. Only one person was ever put on trial: Clay Shaw, but he was found not guilty. Some have also argued that the gunshots were fired so quickly there must have been more than one assassin shooting at the President. This could be supported by the fact that most witnesses said that the second and third shots were fired closer together. Some believe that the bullets could not have hit Kennedy in the place they hit him if they had really been fired from the warehouse. Many of the workers at Parkland Hospital reported that a large portion of the back of the President's head appeared to have been blown out. This may suggest that he had been hit from the front. Today, the truth is not known of the planning and the whole assassination. == References == ==Other websites== *A photo chronology of the seconds leading up to the assassination *JFK Assassination Records Collection at the U.S. National Archives *Assassination of John F Kennedy Original reports and pictures from The Times *British Pathé Online archive of newsreels relating to the assassination *BBC article on Kennedy's assassination *The Kennedy Assassination Encyclopaedia by John Simkin *JFK Online: JFK Assassination Resources Online by David A. Reitzes *The John F. Kennedy Assassination Homepage by Ralph Schuster *Map of motorcade route *JFK Assassination Photographs and Film archive *The Assassination of President Kennedy: A Radio Documentary c. 1985 *Kennedy Assassination Research Site Category:1963 in the United States Category:1960s in Texas Category:20th century in Dallas Kennedy, John F Category:Conspiracy theories Category:Deaths by firearm in Texas Category:John F. Kennedy Category:Murder in the 1960s Category:Murders by firearm in Texas",
 "title": "Assassination of John F. Kennedy"
}