{
 "id": "29564",
 "text": "Charon is a moon of the dwarf planet Pluto. It is half as wide as Pluto and is much like the dwarf planet itself. It was discovered many years after Pluto. They are sometimes considered a binary system, as Charon does not orbit Pluto, and Pluto does not orbit Charon. They orbit a barycentre in space. ==Naming== The moon is named after Charon in Greek mythology, a boatman who would carry the souls of dead people across the river Acheron to the underworld. == Discovery == Charon was found by astronomer James Christy on June 22, 1978, when he was looking at highly blown up picture of Pluto on a photographic plate that taken a couple of months before. Christy noticed that a slight bulge was able to be seen every now and then. This finding was made public on July 7, 1978. Later, the bulge was confirmed on plates dating back to April 29, 1965. Later observations of Pluto were able to figure out that the bulge was due to a smaller body. The orbit of the bulge fit in with Pluto's rotation period, which was already known from Pluto's light curve. Any final doubts were erased when Pluto and Charon entered a five-year period of mutual eclipses between 1985 and 1990. This happens when the Pluto-Charon orbital plane is edge-on as seen from Earth, which only happens at twice in Pluto's 248-year orbital period. It was very lucky that one of these intervals happened to occur so soon after Charon's discovery. == Pictures == Pictures showing Pluto and Charon as separate disks were taken for the first time by the Hubble Space Telescope in the 1990s. Later, after a new technology called adaptive optics was discovered, it was possible to see Pluto and Charon as separate disks using ground-based telescopes. == References == == Other websites == * Charon Profile by NASA's Solar System Exploration * James W. Christy and Robert S. Harrington, \"The satellite of Pluto,\" The Astronomical Journal 83 (1978) 1005 * Marc W. Buie, Phases of Charon as seen from Pluto, Lowell Observatory * Buie, Surface of Charon and Pluto * Hubble reveals new map of Pluto, BBC News, September 12, 2005 * IAU Circular No. 3241 describing the discovery * Measuring the Size of a Small, Frost World (ESO press release January 2006) * M. J. Person et al.: Charon’s Radius and Density from the Combined Data Sets of the 2005 July 11 Occultation (submitted to the Astronomical Journal, February 3, 2006) * Cryovolcanism on Charon and other Kuiper Belt Objects Category:Pluto's moons",
 "title": "Charon (moon)"
}