{
 "id": "295641",
 "text": "Dominique Strauss-Kahn (born 25 April 1949) is a French politician and economist of Jewish descent. He studied economics and is a professor for economics at a university in Paris. He has held different posts in the French government, and was the head of the International Monetary Fund from 2007 to 2011. In France, his name is usually abbreviated DSK. He is a full professor at the Paris Institute for Political Studies (\"Sciences Po\").He was a Professor of Economics at Paris West University Nanterre La Défense and Sciences Po, and was Minister of Economy and Finance from 1997 to 1999, as part of Lionel Jospin's Plural Left government. He belongs to the right wing of the Socialist Party (PS) (which is on the center-left of French politics). He was nominated in the 2006 primary elections of his party to become a candidate for the French presidential election in 2007. Ségolène Royal defeated him in these elections in November 2006. On 14 May 2011, Strauss-Kahn was arrested and charged with sexually assaulting a woman in a hotel in New York. Strauss-Kahn denies all charges. A judge later approved his release on bail. On 18 May 2011 he resigned from his post at the IMF, in order to be able to focus on his defense. On 29 June 2011, French finance minister Christine Lagarde was elected IMF Managing director and took office on 5 July 2011. From 1995 till 1997 he was mayor of Sarcelles. == Early Life == Dominique Strauss- Kahn was born on 25 April 1949 in the wealthy Paris suburb of Neuilly-sur- Seine, Hauts-de-Seine. He is the son of lawyer Gilbert Strauss-Kahn. Strauss- Kahn's father was born to an Alsatian Jewish father and a Catholic mother from Lorraine; Strauss-Kahn's mother is from a Sephardic Jewish family in Tunisia. == Political Life == Strauss-Kahn was first an activist member of the Union of Communist Students, before joining in the 1970s the Centre d'études, de recherches et d'éducation socialiste (Center on Socialist Education Studies and Research, CERES) led by Jean-Pierre Chevènement, future presidential candidate at the 2002 election. There, he befriended the future Prime Minister of France Lionel Jospin (PS). ==References== Category:1949 births Category:Living people Category:French economists Category:French lawyers Category:French mayors Category:French Ministers of Finance Category:Jewish French academics Category:Jewish French politicians Category:Jewish French scientists Category:Jewish lawyers Category:Managing Directors of the International Monetary Fund Category:Politicians from Hauts-de-Seine Category:Socialist Party (France) politicians Category:People from Neuilly- sur-Seine Category:Alumni of HEC Paris",
 "title": "Dominique Strauss-Kahn"
}