{
 "id": "295689",
 "text": "Kevin Spacey Fowler, (born July 26, 1959) is an American actor, director, screenwriter and producer. == Early life == Spacey was born on July 26, 1959 in South Orange, New Jersey. He moved to Southern California at age four. The name \"Spacey\" was the surname of his grandmother, he took it as his acting surname in high school. He worked as an actor in the theatre before he worked in movies and shows. == Career == Spacey's first professional stage appearance was in 1981. He was a spear carrier in a New York Shakespeare Festival performance of Henry VI, Part 1. In 1982, he made his first Broadway appearance, as Oswald in a production of Henrik Ibsen's Ghosts, starring Liv Ullmann. Then he played Philinte in Molière's The Misanthrope. In 1984, he appeared in a production of David Rabe's stage play Hurlyburly, in which he played each of the male parts on different nights. Next came Anton Chekhov's The Seagull. In 1986, he appeared in a production of Sleuth in a New Jersey dinner theatre. He became best known as a stage actor in 1986, when he was cast opposite Jack Lemmon, Peter Gallagher and Bethel Leslie as Jamie, the eldest Tyrone son in Jonathan Miller's production of Eugene O'Neill's Long Day's Journey into Night. Lemmon became a mentor to Spacey. Although he had decided he liked making movies better, Spacey stayed active in live theater community. In 1991, he won a Tony Award for his portrayal of Uncle Louie in Neil Simon's Broadway hit Lost in Yonkers. He got his Oscar Academy Award for Best Supporting Actor in The Usual Suspects and for Best Actor in American Beauty (1999). A few of the other movies in which he played the main part are Seven, L.A. Confidential, Pay It Forward and Superman Returns. He worked as the artistic director of the Old Vic theatre at London in 2003 and played Francis Underwood in the television drama series, House of Cards until 2017 when allegations of sexual harassment arose about Spacey. Spacey was set to play J. Paul Getty in the 2017 crime drama movie All the Money in the World, but after sexual harassment statements were made against Spacey, director Ridley Scott decided to cut his scenes and Christopher Plummer replaced him. ==Personal life and sexual harassment allegations == Spacey came out as gay in October 2017. In late October 2017, in a response for the #MeToo campaign, actor Anthony Rapp alleged that Spacey, while appearing drunk, made a sexual advance to him in 1986, when Rapp was 14 years old. After hearing of this, Spacey apologized on Twitter saying he did not remember the hebephilic incident, but that if he behaved as described by Rapp, he owes him \"the sincerest apology for what would have been deeply inappropriate drunken behavior.\" Spacey ended the apology by saying that \"I have had relationships with both men and women. I have loved and had romantic encounters with men throughout my life, and I choose now to live as a gay man.\" Afterwards, 13 others came forward saying similar episodes of abuse. On November 1, Spacey stated that he would be seeking \"evaluation and treatment\" for his behavior. One of the accusers was Norwegian royal Ari Behn. In December 2018, Spacey was charged with sexually assaulting a male minor in Nantucket, Massachusetts in July 2016. Spacey appeared in court on January 7, 2019. == Theatre == Year Title Role Notes 1981 Henry IV, Part 1 Messenger 1982 Ghosts Oswald Alving 1982 The Mousetrap 1983 As You Like It 1983 The Misanthrope Philinte 1984 Hurlyburly Understudy for Phil, Eddie and Mickey 1985 The Seagull Konstantin 1991 Lost in Yonkers Louie 1997 The Iceman Cometh Theodore \"Hickey\" Hickman 2005 Richard II Richard II 2006 A Moon for the Misbegotten Jim Tyrone 2008 Speed-the-Plow Charlie Fox 2009 Inherit the Wind Henry Drummond 2011 Richard III Richard III == Filmography == Year Title Role Director(s) Notes 1986 Heartburn Subway Thief Mike Nichols 1988 Rocket Gibraltar Dwayne Hanson Daniel Petrie Working Girl Bob Speck Mike Nichols 1989 See No Evil, Hear No Evil Kirgo Arthur Hiller Dad Mario Gary David Goldberg 1990 A Show of Force Frank Curtin Bruno Barreto Henry & June Richard Osborn Philip Kaufman 1992 Glengarry Glen Ross John Williamson James Foley Consenting Adults Eddy Otis Alan J. Pakula 1994 Iron Will Harry Kingsley Charles Haid The Ref Lloyd Chasseur Ted Demme Swimming with Sharks Buddy Ackerman George Huang Also co-producer 1995 The Usual Suspects Roger \"Verbal\" Kint Bryan Singer Outbreak Casey Schuler Wolfgang Petersen Se7en John Doe David Fincher 1996 A Time to Kill Rufus Buckley Joel Schumacher Streak: Showdown of the Teams Maximilian van Statten III Joss Whedon Albino Alligator Himself Directorial debut 1997 L.A. Confidential Jack Vincennes Curtis Hanson Midnight in the Garden of Good and Evil James Arthur Williams Clint Eastwood 1998 The Negotiator Chris Sabian F. Gary Gray Hurlyburly Mickey Anthony Drazan A Bug's Life Hopper (voice) John Lasseter and Andrew Stanton 1999 American Beauty Lester Burnham Sam Mendes The Big Kahuna Larry Mann John Swanbeck Also producer 2000 Ordinary Decent Criminal Michael Lynch Thaddeus O'Sullivan Also producer Pay It Forward Eugene Simonet Mimi Leder 2001 K-PAX Prot / Robert Porter Iain Softley The Shipping News Quoyle Lasse Hallström 2002 Austin Powers in Goldmember Himself / Famous Dr. Evil ('Austinpussy') Jay Roach Cameo 2003 The Life of David Gale David Gale Alan Parker The United States of Leland Albert T. Fitzgerald Matthew Ryan Hoge Also producer 2004 Beyond the Sea Bobby Darin Himself Also director, producer and writer 2005 Edison Levon Wallace David J. Burke Direct-to-video 2006 Superman Returns Lex Luthor Bryan Singer 2007 Fred Claus Clyde Northcut David Dobkin 2008 21 Mickey Rosa Robert Luketic Also producer Telstar: The Joe Meek Story Major Wilfred Banks Nick Moran 2009 Shrink Henry Carter Jonas Pate Also producer Moon GERTY (voice) Duncan Jones The Men Who Stare at Goats Larry Hooper Grant Heslov 2010 Father of Invention Robert Axle Trent Cooper Also producer Casino Jack Jack Abramoff George Hickenlooper 2011 Margin Call Sam Rogers J.C. Chandor Horrible Bosses Dave Harken Seth Gordon Inseparable Chuck Dayyan Eng Mandarin Chinese title: Xing ying bu li Also executive producer 2012 Envelope Evgeniy Petrov Aleksey Nuzhny Short movie 2014 Horrible Bosses 2 Dave Harken Sean Anders 2016 Elvis & Nixon Richard Nixon Liza Johnson Nine Lives Tom Brand / Mr. Fuzzypants Barry Sonnenfeld 2017 Rebel in the Rye Whit Burnett Danny Strong Baby Driver Doc Edgar Wright 2018 Billionaire Boys Club Ron Levin James Cox N/A Gore Gore Vidal Michael Hoffman Cancelled (2017 production) ===Television=== Year Title Role Notes 1987 The Equalizer Detective Sgt. Cole Episode: \"Solo\" 1987 Long Day's Journey into Night James \"Jamie\" Tyrone Jr Television film 1987 Crime Story Senator Rourke Episode: \"The Senator, the Movie Star, and the Mob\" 1988 The Murder of Mary Phagan Wes Brent Miniseries 1988 Wiseguy Mel Profitt 7 episodes 1989 Unsub Benton Episode: \"Clean Slate\" 1990 When You Remember Me Wade Television film 1990 Fall from Grace Jim Bakker Television film 1991 Darrow Clarence Darrow Television film 1991-1997 Streak Maximilian van Statten III Recurring cast 1992 L.A. Law Giles Keenan Episode: \"Guess Who's Coming To Murder\" 1993 TriBeCa Chris Boden Episode: \"Heros Exoletus\" 1994 Doomsday Gun Jim Price Television film 1997, 2006 Saturday Night Live Himself (host) 2 episodes 2008 Recount Ron Klain Television film 2013–2017 House of Cards Francis \"Frank\" Underwood Main role; also executive producer 2014 The Colbert Report Frank Underwood Episode: \"1,394\" 2017 71st Tony Awards Himself (host) Television special 2017 Manhunt: Unabomber Miniseries; executive producer ===Director=== * Albino Alligator (1997) ===Producer=== * Interstate 84 (2000) * The Sasquatch Gang (2006) * The Good Student (2006) * Mini's First Time (2006) * Bernard & Doris (2006) * Columbus Day (2008) * Hackers Wanted (2009) * Fanboys (2009) * The Social Network (2010) * Safe * Captain Phillips (2013) === Live performances === * \"Mind Games\" — Come Together: A Night for John Lennon's Words and Music — October 2, 2001 – Radio City Music Hall == Awards and nominations == Year Nominated work Award Result 1995 The Usual Suspects Boston Society of Film Critics Award for Best Supporting Actor National Board of Review Award for Best Acting by an Ensemble and Supporting Actor New York Film Critics Circle Award for Best Supporting Actor Seattle International Film Festival Award for Best Actor Society of Texas Film Critics Award for Best Supporting Actor 1996 Academy Award for Best Supporting Actor Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Motion Picture Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role Critics Circle Award for Best Supporting Actor Chicago Film Critics Association Award for Best Supporting Actor Chlotrudis Award for Best Supporting Actor Dallas-Fort Worth Film Critics Association Award for Best Supporting Actor 1997 L.A. Confidential Boston Society of Film Critics Award for Best Supporting Actor Society of Texas Film Critics Award for Best Actor 1998 BAFTA Award for Best Actor in a Leading Role Chicago Film Critics Association Award for Best Supporting Actor Chlotrudis Award for Best Supporting Actor Empire Award for Best Actor Screen Actors Guild Award for Outstanding Performance by a Cast 1999 American Beauty Kansas City Film Critics Circle Award for Best Actor San Diego Film Critics Society Award for Best Actor Toronto Film Critics Association Award for Best Actor 2000 Academy Award for Best Actor American Comedy Award for Funniest Actor in a Motion Picture BAFTA Award for Best Actor in a Leading Role Blockbuster Entertainment Award for Favorite Actor - Drama Chicago Film Critics Association Award for Best Actor Chlotrudis Award for Best Actor Dallas-Fort Worth Film Critics Association Award for Best Actor Florida Film Critics Circle Award for Best Actor Golden Globe Award for Best Performance by an Actor in a Motion Picture - Drama Jupiter Award for Best International Actor Las Vegas Film Critics Society Award for Best Actor London Film Critics Circle Award for Best Actor Online Film and Television Association Award for Best Actor Online Film Critics Society Award for Best Actor Russian Guild of Film Critics Award for Best Foreign Actor Satellite Award for Best Performance by an Actor in a Motion Picture, Drama Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role and Cast in a Motion Picture Southeastern Film Critics Association Award for Best Actor 2013 House of Cards Primetime Emmy Award for Outstanding Lead Actor in a Drama Series Satellite Award for Best Actor in a Series, Drama == References == == Other websites == * * * Interview with Kevin Spacey from April 2007 * Kevin Spacey interview in the UK Independent on Sunday Category:1959 births Category:Living people Category:American Academy Award winning actors Category:Actors from California Category:Actors from New Jersey Category:American movie actors Category:American stage actors Category:American television directors Category:American television producers Category:American television writers Category:American voice actors Category:BAFTA Award winners Category:Comedians from California Category:Comedians from New Jersey Category:Gay men Category:LGBT actors Category:LGBT comedians Category:LGBT people from California Category:LGBT people from New Jersey Category:LGBT screenwriters Category:LGBT singers Category:Movie directors from California Category:Movie directors from New Jersey Category:Movie producers from California Category:Movie producers from New Jersey Category:Screen Actors Guild Award winners Category:Screenwriters from California Category:Screenwriters from New Jersey Category:Singers from California Category:Singers from New Jersey Category:Tony Award winning actors Category:Honorary Knights Commander of the Order of the British Empire Category:Democrats (United States) Category:People accused of child sexual abuse",
 "title": "Kevin Spacey"
}