{
 "id": "295697",
 "text": "King Creole is an American movie directed by Michael Curtiz, released by Paramount Pictures on July 2, 1958.Victor, Adam, The Elvis Encyclopaedia, p.288 The movie stars Elvis Presley, Carolyn Jones, and Walter Matthau. It is Presley's fourth movie (the third and last filmed in black & white). It was based on the 1952 novel by Harold Robbins, A Stone for Danny Fisher. ==Story== Presley plays a teenager named Danny Fisher, who is forced to drop out of school to help support his father (Dean Jagger). Always in trouble, Danny is saved from a jail term by New Orleans saloon-keeper Charlie Le Grand (Paul Stewart), who gives the boy a job as a singer. Soon a local gang boss, Maxie Fields (Walter Matthau), a shadowy figure from Danny's criminal past, puts pressure on the boy, insisting that Danny sing at his saloon. To tempt Danny, Maxie relies upon the seductive charms of his girlfriend Ronnie (Carolyn Jones), while Danny's true love Nellie (Dolores Hart) suffers on the sidelines. ==Actors== *Elvis Presley: Danny Fisher *Carolyn Jones: Ronnie *Walter Matthau: Maxie Fields *Dolores Hart: Nellie *Dean Jagger: Mr. Fisher *Liliane Montevecchi: Forty Nina *Vic Morrow: Shark *Paul Stewart: Charlie LeGrand *Jan Shepard: Mimi Fisher *Brian G. Hutton: Sal ==History== Hal Wallis purchased the rights to A Stone For Danny Fisher so he could make a non- musical movie starring either James Dean or Ben Gazzara.Victor, Adam, The Elvis Encyclopaedia, p.286 After Dean died in 1955, the project did not continue. In January 1957, following the success of an Off-Broadway stage version of the story, Presley's name was suggested as a possible replacement. The character of Fisher was changed from a boxer to a singer and the story was moved from New York to New Orleans. With filming starting in January 1958, Presley had to get special permission to delay his entry to the US Army, until after filming was complete.Elvis:Day by Day, p.116 Michael Curtiz, a noted director during the golden era of the Hollywood studio system was hired for the project. His famous movies included The Adventures of Robin Hood in 1938, Yankee Doodle Dandy in 1942, and in the same year, Casablanca, After seeing an early copy of the movie Presley thanked Curtiz for giving him the chance to show people he could be an actor. King Creole was said to have been Presley's favorite role of his entire career. He had high hopes of returning from the Army to pick up from where he had left off. However, despite success of the movie, he never got the chance to be taken as seriously as an actor again, with the exception of the westerns Charro! and Flaming Star. This was partly due to the success of later movies such as Blue Hawaii, G.I. Blues, and Viva Las Vegas. These were all quick to make, low cost box-office hits. They had enough songs to sell soundtrack albums and entertain the thousands of Presley fans who were more eager to see him sing than act. King Creole was the last movie Presley made during the 1950s and is often said to be his best role. Filming took place between January 20 and March 12 1958.Elvis:Day by Day, p.120 Twelve days after the finishing King Creole, Presley joined the U.S. Army. ==References== *Jorgenson, Ernst (1998). Elvis Presley: A Life In Music - The Complete Recording Sessions. New York: St. Martin's Press. ==Other websites== * *Review by Cheryl Northcott at Apollo Movie Guide . *Review of the movie collection \"Lights! Camera! Elvis! Collection (King Creole, Blue Hawaii, G.I. Blues, Fun in Acapulco, Roustabout, Girls! Girls! Girls!, Paradise, Hawaiian Style, Easy Come, Easy Go) by Paul Mavis at DVD Talk, August 6, 2007. Category:1958 musical movies Category:1958 drama movies Category:American musical movies Category:American drama movies Category:Paramount Pictures movies Category:Movies based on books Category:Movies directed by Michael Curtiz Category:Movies set in New Orleans",
 "title": "King Creole"
}