{
 "id": "295611",
 "text": "Kobie van Rensburg (born 23 May 1969 in Johannesburg) is a South African tenor and opera director. == Life == Van Rensburg studied singing with Werner Neel at the Northwest University of South Africa,New Classical Adventure retrieved 12 December 2010 (German) but also law and international politics at Potchefstroom University for Christian Higher Education. .Artist Management Augstein & Hahn . Retrieved 12 December 2010. He made his debut in 1991 at the age of 20 as Belmonte in Mozart's \"Die Entführung aus dem Serail\" for the Roodeport City Opera. In 1996, he started an engagement at the Gärtnerplatztheater in Munich. Since the year 2000 van Rensburg has been working regularly with the Lautten Compagney Berlin (director: Wolfgang Katschner). With this ensemble he staged Monteverdi's \"L'Orfeo\" and published three recordings. Since 2011 van Rensburg collaborates with a different emsemble for Ancient and New Music, called \"così facciamo\". With them he staged Handel’s \"Ariodante\".Website of \"così facciamo\" retrieved 16 May 2011 (German). He sung his first name part as and in Mozart’s Idomeneo in 2006 for the New York City Metropolitan Opera. Van Rensburg‘s repertoire focuses on Baroque music. However, he has also made his mark in song and Lied interpretation, focusing on English Baroque composers (i.e. Dowland, Byrd, Purcell), as well as German composers Beethoven, Schumann and Schubert, to name only a few. == Opera stage direction == At the Munich Gärtnerplatztheater van Rensburg staged, together with the librettist Peer Boysen the pasticcio \"Ein Theater nach der Mode\" in 2002, featuring compositions by Handel and other Baroque composers. In 2006 he gave his directorial debut in the Opernhaus Halle with Monteverdi‘s \"L'Orfeo, in which he also sang the name part. Handel‘s first oratorio \"Il Trionfo del Tempo e del Disinganno\" was staged in 2009 in Passau by van Rensburg. His latest directorial work includes Handel’s opera Ariodante, premiered in February 2011 at the Munich Cuvilliés- Theater.ARD Mediathek retrieved 16 May 2011, BR Klassik Radio (German). Just like in his former own production \"Il Pianto d'Orfeo\"E-Paper of the Berliner Zeitung from 10.09.2007 retrieved 16 May 2011 (German) van Rensburg links the expressiveness of dancing with the music of the composition. The dancer serves as an Alter ego to the singer and thereby illustrates the emotions of the character he or she impersonates.TV Berlin retrieved 16 May 2011 (German). == Choice of roles == * Pane in La Calisto (Francesco Cavalli) * Acis in Acis and Galatea (Georg Friedrich Händel) * Grimoaldo in Rodelinda (Georg Friedrich Händel) * Jupiter in Semele (Georg Friedrich Händel) * Orfeo in L'Orfeo (Claudio Monteverdi) * Bastien in Bastien und Bastienne (Wolfgang Amadeus Mozart) * Don Ottavio in Don Giovanni (Wolfgang Anmadeus Mozart) * Idomeneo in Idomeneo (Wolfgang Amadeus Mozart) * Tito in La Clemenza di Tito (Wolfgang Amadeus Mozart) * Tamino in Die Zauberflöte (Wolfgang Amadeus Mozart) * Ubaldo in Armida (Gioachino Rossini) * Nightingale in Ein Theater nach der Mode (Kobie van Rensburg & Peer Boysen) == Discography == * 2009: \"Rodrigo\" (Georg Friedrich Händel, Eduardo Lopéz Banzo, Al Ayrę Español) * 2009: \"Bach Cantatas - Vol.4\" (Johann Sebastian Bach, John Eliot Gardiner, English Baroque Soloists) * 2009: \"Alcina\" (Georg Friedrich Händel, Alan Curtis, Il Complesso Barocco) * 2008: \"Saul, Messiah\" (Georg Friedrich Händel, René Jacobs, Concerto Köln & Freiburger Barockorchester) * 2007: \"Der Messias\" (Georg Friedrich Händel, Wolfgang Katschner, Lautten Compagney, Dresdner Kammerchor) * 2006: \"Messiah\" (Georg Friedrich Händel, René Jacobs, Freiburger Barockorchester) * 2006: \"Cantone in Utica\" (Giovanni Battista Ferrandini, Christoph Hammer, Neue Hofkapelle München) * 2006: \"Il pianto d'Orfeo\" (various composers, Kobie van Rensburg, Lautten Compagney) * 2005: \"Der Fliegende Holländer\" (Richard Wagner, Bruno Weil, Cappella Coloniensis) * 2004: \"Le Nozze di Figaro\" (Wolfgang Amadeus Mozart, René Jacobs, Concerto Köln) * 2003: \"Griselda\" (Alessandro Scarlatti, René Jacobs, Akademie für alte Musik Berlin) * 2002: \"Madrigali Guerrieri ad Amorosi\" (Claudio Monteverdi, René Jacobs, Concerto Vocale) * 2001: \"Liededition Vol.1 & 2\" (Fanny Hensel, Kelvin Groot) * 2001: \"Songs of An English Cavalier\" (various composers, Kobie van Rensburg, Lautten Compagney) * 2000: \"Handel's Beard\", Airs for Tenor (Georg Friedrich Händel, Kobie van Rensburg, Lautten Compagney) == References == Category:1971 births Category:Living people Category:Tenors Category:South African musicians Category:Opera singers Category:People from Johannesburg",
 "title": "Kobie van Rensburg"
}