{
 "id": "29577",
 "text": "Sir Donald George Bradman (27 August 1908 – 25 February 2001) was an Australian cricketer. Often called \"The Don\", he is widely acknowledged as one of the greatest batters of all time. He scored 6,996 runs in his Test career at a world record batting average of 99.94 runs per completed innings. Bradman's career Test batting average of 99.94 has been cited as the greatest achievement by any sportsman in any major sport. Bradman also gained a degree in mathematics from the University of Victoria achieving the highest mark in his year. Australian fast bowler Jeff Thomson said that bowling to Bradman was one of his \"greatest moments\". This happened in 1977–78 in Adelaide during India's tour to Australia. Thomson said: \"Sir Don was batting in a suit, no pads, no gloves, just a bat. He must've been around 70 and hadn't batted [much] for almost 30 years and he was still so good. It was turf wicket, and I bowled within myself, but there were a couple of young blokes who were bowling at full speed and he was carting them all over the place. Along with meeting George Best, bowling to Bradman is the greatest moment of my life\". == Cricket playing days == === Bodyline Series === Before the first match of the tour, England had not told Australia what they were going to do, but when England named 5 fast bowlers (including Harold Larwood and Bill Voce). It was not usual to have so many fast bowlers in one team, so Bradman knew that England were about to try something new. The new way of bowling was first tried in a warm-up match which Bradman played in, and as expected Bradman struggled. Bradman did not play in the first Test Match of the tour, which led some people to think this was because his had suffered a nervous breakdown. England still tried their new way of bowling, and won the match but the Australian team were not happy. Australian newspapers described this way of bowling as \"bodyline\", because the balls were often aimed fast at the body. They felt that this bowling was unfair and dangerous, as in 1930s batsman did not wear helmets. Despite this, the tour carried on and in the second Test Match, Bradman returned. In the first Australian innings, Bradman was bowled first ball. Bradman guessed that the ball was going to be bounced high, so he moved to one side and swung the bat so he could score a boundary. The ball did not bounce as high as Bradman thought, and it hit the stumps. This was the first time he had been out on the first ball (called a duck) in his career at that point. The crowd were shocked, as they were used to seeing Bradman easily score hundreds. Bradman had a better second innings and scored 103 runs. With good bowling from Australian bowlers Bill O'Reilly and Bert Ironmonger, this score helped Australia win the second match. Australia were happy, as they thought that they had beaten what they felt was unfair bowling. England won the last 3 test matches, still bowling \"bodyline\". Bradman changed the way he batted a lot to try to score runs. In bodyline, England put a lot of fielders on the leg side, so Bradman had the idea of moving backwards to hit the ball on the off side, where there were few fielders. This was not a normal way of playing but this helped him to get 56.57 runs on average per innings in the tour. Jack Fingleton (Australian batsman) thought that this tour changed Bradman's way of batting for the restc of his career.Fingleton (1949) p198 == Personal life == Bradman was married to Jessie Martha Menzies for 65 years, until Jessie died in 1999. Bradman said on many occasions how important his wife was, once saying \"I would never have achieved what I achieved without Jessie\".Eason (2004) p55. Don and Jessie Bradman had 3 children, but family life was difficult. Their first child died young in 1936. Their second child (John, born in 1939) caught poliomyelitis, a serious virus disease. and their third child (Shirley, born 1941) had cerebral palsy since birth. == Death == Bradman died of pneumonia on 25 February 2001, aged 92, in Kensington Park, South Australia. ==Gallery== File:D.G.Bradman.png File:Bradman 1937.JPG File:Fingleton Bradman.jpg File:Bradman chaired.jpg File:Bradman 1928.jpg File:Bradman stand.jpg File:Bradman's Cottage at Temora Rural Museum.jpg File:Inside Bradman's Cottage at Temora Rural Museum.jpg File:Bradman Barnes 234.jpg File:Bradman and wife.jpg File:MCG Bradman statue.jpg File:Bradman Museum 2.JPG File:Bradman Museum 1.JPG File:Bradman c.1928.jpg File:Bradman Stand.jpg File:Bradman Stand, Adelaide Oval.jpg File:MCG Bradman statue base.jpg File:Bradman Oval Bowral - fence.jpg File:Bradman&Bat.jpg; File:Don Bradman and Stan McCabe.jpg File:Donald Bradman australian cricket player pic.JPG File:Don Bradman statue at Adelaide Oval.jpg File:BradmanWedding.jpg File:Bradmanstatue.jpg File:BradmanHooksVoce.jpg File:Donald Bradman practises his drive, 1936 (StateLibQld 1 101600).jpg File:Aus1930Team.jpg == References == Category:1908 births Category:2001 deaths Category:Australian cricketers Category:Knights Bachelor Category:Sportspeople from New South Wales Category:Order of Australia Category:Australian sport administrators",
 "title": "Don Bradman"
}