{
 "id": "295703",
 "text": "\"Rolling in the Deep\" is a song by English singer-songwriter Adele. It is from her second studio album, 21. The song was written by Adele and Paul Epworth. Adele has described it as a \"dark blues-y gospel disco tune\". The song's official MV uploaded to YouTube on 30 November 2010 has accumulated over 2.58 billion views and 13 million \"Likes\" as of 19 October 2024, similar to that of Adele's another hit Someone Like You released 10 months later, which Adele considered as having changed her life. ==Overview== Rolling in the Deep was released as the lead single on 29 November 2010 in the Netherlands. \"Rolling in the Deep'\" became Adele's first number-one hit single in the United States and Canada. It was also her first top-five hit in several countries. Positive reviews for the song have been seen. It reached number one in Belgium, Germany, Italy, the Netherlands, and Switzerland. It also reached top ten in Austria, Canada, Denmark, Ireland, New Zealand, and Norway. The song debuted at number two in the United Kingdom. There, it became Adele's third top-ten single. ===Performance=== \"Rolling in the Deep\" became Adele's second single to chart in the United States. After that, it became her first single to go to top of a Billboard chart. This was when it reached number one on the Hot Adult Top 40 Tracks chart in May 2011. It also became her first number one hit in the country when the song reached #1 in the Billboard Hot 100 in May 2011. As of May 2011, \"Rolling in the Deep\" had sold over 2 million digital copies in the US. The song is her best-selling single in the country. It has sold more copies than her previous best-selling single \"Chasing Pavements\". ==Composition== The song has \"martial arts\", \"pounding piano keys\" (played by Neil Crowley) and \"chanting backing singers\". Critics have said Adele's vocals are like Wanda Jackson's \"dirty-blues growl.\" AOL Radio Blog's Nadine Cheung says the song is \"sung from the perspective of a scorned lover, who is finally able to see the light, but despite regretful sentiments, reconciliation is not an option here.\" ==Critical reception== The song was praised by critics for Adele's powerful voice, the lyrics and the song's instrumentation. The Sun called the song an \"epic, foot-stomper of a pop anthem.\" They said it had a thumping piano. According to The Sun, Adele's vocals seemed to be that of a veteran who has been singing for 20 years . Bill Lamb from About.com gave it 5 stars out of 5. He praised her voice and the emotion with which she sang the song. He said the song could \"raise chills up the spine.\" He added that after hearing the song, people would want to hear the full album. Jason Lipshutz from Billboard praised the chorus of the song and its instrumentation. Lipshutz praised Adele's vocal performance. He said Adele was confident about her vocal ability. Lipshutz praised the way Adele started the chorus of the song. Rolling Stones Barry Walters gave \"Rolling in the Deep\" a positive review. He said Adele's voice was \"powerful but not particularly pop\" in the song. He said that the song started with \"a stroked acoustic guitar.\" But he described its end as \"stomping\" and one that has hand-clapping. He said this showed that the English liked to modify Black American roots music. ==Music video== The music video for \"Rolling in the Deep,\" directed by Sam Brown, filmed in July 2010. And premiered on Channel 4 on 3 December 2010. The video begins in an abandoned house, where Adele is sitting in a chair singing. During the video, the scenes show hundreds of glasses filled with water that vibrate to the beat of a drum. Jennifer White, who also choreographed the sequence, dances in a room kicking up white flour The drummer plays his drums under the stairs, and china is thrown breaking on a piece of suspended plywood at the bottom of a staircase. There is a white model of a city which is set on fire by five bursting light bulbs at the end of the song. The music video received critical acclaim, with critics praising its dark tone and simplicity. ==Track listing== * Digital download # \"Rolling in the Deep\" – 3:48 * Digital EPRolling in the Deep - EP by Adele - Download Rolling in the Deep - EP on iTunes. iTunes Store. Retrieved on 20 January 2011. # \"Rolling in the Deep\" – 3:48 # \"Rolling in the Deep (Jamie xx Shuffle)\" – 4:17 # \"Rolling in the Deep (Acapella)\" – 3:56 * CD single # \"Rolling in the Deep\" # \"If It Hadn't Been for Love\" (Michael Henderson, Christopher Stapleton) ==Credits and personnel== Credits are taken from 21 liner notes. * Backing vocals, Lead vocals - Adele * Songwriting – Adele, Paul Epworth * Production, bass, acoustic guitar, electric guitar and backing vocals – Paul Epworth * Mixing – Tom Elmhirst * Mixing assistant – Dan Parry * Recording – Mark Rankin * Piano – Neil Cowley * Drums – Leo Taylor * Mastering – Tom Coyne == Charts == === Weekly charts === Chart (2010–14) Peak position Brazil (Billboard Hot 100 Airplay)\"Brasil Hot 100 Airplay\". Billboard Brasil (Brasil: bpp) (2): 96. May 2011. 3 Brazil (Billboard Hot Pop)\"Brasil Hot Pop & Popular Songs\". Billboard Brasil (Brasil: bpp) (2): 97. May 2011. 1 Europe (Euro Digital Songs) 2 Greece Digital Songs (Billboard) 4 Iceland (RÚV) 1 Luxembourg Digital Songs (Billboard) 1 Mexico Airplay (Billboard) 25 Portugal Digital Songs (Billboard) 2 Russia (Radio Hits Top 100) 58 Slovenia (Slovenian Singles Chart) 2 South Korea International Chart (GAON) 1 ===Year- end charts=== Chart (2010) Position Netherlands (Single Top 100) 36 Chart (2011) Position Australia (ARIA) 5 Austria (Ö3 Austria Top 40) 16 Belgium (Ultratop 50 Flanders) 2 Belgium (Ultratop 40 Wallonia) 1 Canada (Canadian Hot 100) 1 Denmark (Hitlisten) 10 France (SNEP) 2 Germany (Media Control Charts) 4 Greece (IFPI) 19 Hungary (Mahasz) 1 Ireland (IRMA) 11 Israel (Media Forest) 2 Italy (FIMI) See the attached file, by pressing Scarica l'allegato. 5 Netherlands (Dutch Top 40) 2 Netherlands (Single Top 100) 1 New Zealand (Recorded Music NZ) 6 Spain (PROMUSICAE) 18 South Korea (Gaon Singles Chart) (Int'l.)Of Year Charts 2011| 13 Sweden (Sverigetopplistan) 8 Switzerland (Schweizer Hitparade) 2 UK Singles (Official Charts Company) 9 US Billboard Hot 100 1 US Pop Songs (Billboard) 5 US Adult Contemporary (Billboard) 3 US Adult Pop Songs (Billboard) 1 US Hot Rock Songs (Billboard) 45 Chart (2012) Position Belgium (Ultratop 50 Flanders)Ultratop Belgian Charts. ultratop.be. Retrieved on 2013-08-25. 51 Belgium (Ultratop 40 Wallonia) 32 Canada (Canadian Hot 100) 61 Hungary (Mahasz) 41 Israel (Media Forest ACUM) 6 Russia Airplay (Tophit) 189 Spain (PROMUSICAE) 25 Switzerland (Schweizer Hitparade)Schweizer Jahreshitparade 2012 . hitparade.ch (2012-12-30). Retrieved on 2013-08-25. 34 US Billboard Hot 100 71 US Adult Contemporary (Billboard) 22 Chart (2013) Position Slovenia (SloTop50) 17 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 12 UK Singles (Official Charts Company) 73 US Billboard Hot 100 10 ===All-time charts=== Chart Position US Adult Top 40 (Billboard) 29 US Billboard Hot 100 (1958-2018) 35 UK Singles (Official Charts Company) 129 ==Release history== Region Date Label Format Netherlands 29 November 2010 XL Recordings Digital download United States 30 November 2010 Columbia Records Digital download Germany 14 January 2011 XL Recordings CD single Australia 16 January 2011 XL Recordings Digital EP United Kingdom 16 January 2011 XL Recordings Digital EP United Kingdom 17 January 2011 XL Recordings CD single Europe 15 October 2010 XL Recordings CD single ==Covers== Rolling in the Deep has been covered by various singers since its release. Some of them are independent bands, including the First To Eleven. First To Eleven's cover version of the song has accumulated 1,455,163 views as of April 8, 2025. ==References== ==Other websites== * Category:Pop songs Category:Soul songs Category:2009 songs Category:2010 singles Category:Adele songs Category:Aretha Franklin songs",
 "title": "Rolling in the Deep"
}