{
 "id": "295874",
 "text": "The London station group is a group of 18 railway stations in central London. They are part of the National Rail network. Most are terminal stations, meaning that they are at the end of the railway line. The station group is shown on tickets as London Terminals. ==Group members== As of 2024, the group is made up of: *Blackfriars *Cannon Street *Charing Cross *City Thameslink *Euston *Fenchurch Street *King's Cross *Liverpool Street *London Bridge *Marylebone *Moorgate *Old Street *Paddington *St. Pancras International *Vauxhall *Victoria *Waterloo *Waterloo East ==Former members== *Broad Street (closed 1986) *Holborn Viaduct (closed 1990) *Kensington Olympia (withdrawn 1994) *Kings Cross Thameslink (closed 2007) ==Station statistics == Station Image Location Coordinates Managed by London services National services Annual entry/exit (millions) 2006/7 Annual entry/exit (millions) 2007/8 Annual entry/exit (millions) 2008/9 Annual entry/exit (millions) 2009/10 Open date Terminal platforms Through platforms Blackfriars City of London First Capital Connect NW, N, S, SE Thameslink, Gatwick Airport, Luton Airport 11.852 12.440 12.959 12.089 1886 2 2 Cannon Street City of London Network Rail SE Kent and East Sussex 21.106 22.045 21.646 20.229 1866 7 0 Charing Cross Westminster Network Rail SE Kent and East Sussex 34.779 36.294 36.660 36.460 1864 6 0 City Thameslink City of London First Capital Connect NW, N, S, SE Thameslink, Gatwick Airport, Luton Airport 5.479 5.370 5.294 5.163 1988 0 2 Euston Camden Network Rail NW West Coast Main Line 25.585 28.739 31.179 30.068 1837 18 0 Fenchurch Street City of London Network Rail E Southend-on-Sea 15.189 15.976 16.576 15.093 1841 4 0 Kings Cross Camden Network Rail N East Coast Main Line 22.504 23.945 24.641 24.818 1852 12 0 Liverpool Street City of London Network Rail E, NE East of England, Stansted Airport 55.266 57.790 56.198 51.596 1874 18 0 London Bridge Southwark Network Rail S, SE, NW Kent, East Sussex, Gatwick Airport 47.577 50.602 49.901 48.723 1836 9 6 Marylebone Westminster Chiltern Railways NW Birmingham 11.639 11.559 11.645 11.758 1899 6 0 Moorgate City of London London Underground N Hertfordshire 9.236 10.109 9.374 6.737 1865 2 0 Old Street Islington London Underground N Hertfordshire 0.734 0.813 0.828 1.372 1901 0 2 Paddington Westminster Network Rail W Great Western Main Line, Heathrow Airport 27.259 26.521 32.697 29.104 1854 14 0 St Pancras Camden Network Rail N, NW, S, SE Midland Main Line, Gatwick Airport, Luton Airport, Kent 5.777 6.624 19.326 18.020 1868 13 2 Vauxhall Lambeth South West Trains SW South West England 10.469 15.420 14.582 13.890 1848 0 10 Victoria Westminster Network Rail S, SE, SW Kent, Sussex, Gatwick Airport 66.749 70.854 70.157 70.224 1862 19 0 Waterloo Lambeth Network Rail SW South West England 89.993 91.452 88.548 86.397 1848 19 0 Waterloo East Lambeth Southeastern S, SE Kent and East Sussex 6.329 6.537 6.675 6.714 1869 0 4 ==Related pages== *List of London railway stations ==Footnotes== * for Thameslink from the north only * for Thameslink from the south only * does not include London Underground * from 2008/2009, King's Cross Thameslink passengers are grouped with St Pancras. In addition, full Eurostar services began from St Pancras on 9 December 2007. ==References== *",
 "title": "London station group"
}