{
 "id": "295836",
 "text": "The Non-Aligned Movement (NAM) is an international organization (group of countries) who do not want to be officially aligned with or against any major power bloc (group of countries). In 2024, the movement had 121 members and 27 observers. The group was started in Belgrade in 1961. It was created by Yugoslavia's President, Josip Broz Tito, India's first Prime Minister, Jawaharlal Nehru, Egypt's second President, Gamal Abdel Nasser, Ghana's first president Kwame Nkrumah, and Indonesia's first President, Sukarno. All five leaders believed that developing countries should not help either the Western or Eastern blocs in the Cold War. They also believed that developing countries should not be Capitalist or Communist, but should try to find a different way to help their people. The Havana Declaration of 1979 said that the purpose of the organization is to help countries keep their \"the national independence, sovereignty, territorial integrity and security of non-aligned countries\" in their \"struggle against Imperialism, Colonialism, Neocolonialism, Racism, and all forms of foreign aggression, occupation, domination, interference or hegemony as well as against great power and bloc politics.\"Fidel Castro speech to the UN in his position as chairman of the non-aligned countries movement 12 October 1979 ; Pakistan & Non-Aligned Movement , Board of Investment - Government of Pakistan, 2003 This means that they wanted to govern their countries without the main capitalist powers nor the major socialist states telling them how. The countries of the Non-Aligned Movement are nearly two- thirds of the United Nations's members and 55% of the world population. ==Secretaries-General== Between summits, the Non-Aligned Movement is run by the secretary-general elected at last summit meeting. As a considerable part of the movement's work is undertaken at the United Nations in New York, the chair country's ambassador to the UN is expected to devote time and effort to matters concerning the Non-Aligned Movement. The Coordinating Bureau, also based at the UN, is the main instrument for directing the work of the movement's task forces, committees and working groups. Secretaries-General of the Non-Aligned Movement Name Country Party From To Josip Broz Tito League of Communists of Yugoslavia 1961 1964 Gamal Abdel Nasser Arab Socialist Union 1964 1970 Kenneth Kaunda United National Independence Party 1970 1973 Houari Boumediène Revolutionary Council 1973 1976 William Gopallawa Independent 1976 1978 Junius Richard Jayewardene United National Party 1978 1979 Fidel Castro Communist Party of Cuba 1979 1983 Neelam Sanjiva Reddy Janata Party 1983 1983 Zail Singh Congress Party 1983 1986 Robert Mugabe ZANU-PF 1986 1989 Janez Drnovšek League of Communists of Yugoslavia 1989 1990 Borisav Jović Socialist Party of Serbia 1990 1991 Stjepan (Stipe) Mesić Croatian Democratic Union 1991 1991 Branko Kostić Democratic Party of Socialists of Montenegro 1991 1992 Dobrica Ćosić Independent 1992 1992 Suharto Partai Golongan Karya 1992 1995 Ernesto Samper Colombian Liberal Party 1995 1998 Andrés Pastrana Arango Colombian Conservative Party 1998 1998 Nelson Mandela African National Congress 1998 1999 Thabo Mbeki African National Congress 1999 2003 Mahathir Mohamad United Malays National Organisation 2003 2003 Abdullah Ahmad Badawi United Malays National Organisation 2003 2006 Fidel CastroFidel Castro, having recently undergone gastric surgery, was unable to attend the conference and was represented by his younger brother, Cuba's acting president Raúl Castro. See \"Castro elected President of Non-Aligned Movement Nations\", People's Daily, 16-09-2006. Communist Party of Cuba 2006 2008 Raúl Castro Communist Party of Cuba 2008 2009 Hosni Mubarak National Democratic Party 2009 2011 Mohamed Hussein Tantawi Independent 2011 2012 Mohamed Morsi Freedom and Justice Party 2012 2012 Mahmoud Ahmadinejad Alliance of Builders of Islamic Iran 2012 2013 Hassan Rouhani Combatant Clergy Association 2013 2016 Nicolás Maduro United Socialist Party of Venezuela 2016 2019 Ilham Aliyev New Azerbaijan Party 2019 2023 ==Members== ===Full Members=== # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # ===Former members=== # (1961–1990) # (1961–2004) # (1961–1992) # (1970–1990) # (1973–2004) # (1973–1991) ===Observers=== The following countries and organizations have observer status:Member and Observer Countries , Non-Aligned Movement ====Countries==== # # # # # # # # # # # # # # # # # # # ====Organisations==== #Association of Southeast Asian Nations #African Union #Afro-Asian People's Solidarity Organisation #Arab League #Commonwealth Secretariat #Hostosian National Independence Movement #Kanak and Socialist National Liberation Front #Organisation of Islamic Cooperation #South Centre #United Nations #World Peace Council Members have, at various times, included: Yugoslavia, Argentina, SWAPO, Cyprus, Poland, and Malta. Brazil has never been a formal member of the movement, but shares many of the aims of Non-Aligned Movement and frequently sends observers to the Non-Aligned Movement's summits. While many of the Non-Aligned Movement's members were actually quite closely aligned with one or another of the super powers, the movement still maintained surprising amounts of cohesion throughout the Cold War. Additionally, some members were involved in serious conflicts with other members (e.g., India and Pakistan, Iran and Iraq). The movement fractured from its own internal contradictions when the Soviet Union invaded Afghanistan in 1979. While the Soviet allies supported the invasion, other members of the movement (particularly predominantly Muslim states) condemned it. Because the Non- Aligned Movement was formed as an attempt to thwart the Cold War, it has struggled to find relevance since the Cold War ended. After the breakup of Yugoslavia, a founding member, its membership was suspended in 1992 at the regular Ministerial Meeting of the Movement, held in New York during the regular yearly session of the General Assembly of the United Nations. At the Summit of the Movement in Jakarta, Indonesia (September 1, 1992 – September 6, 1992) Yugoslavia was suspended or expelled from the Movement. The successor states of the SFR Yugoslavia have expressed little interest in membership, though some have observer status. In 2004, Malta and Cyprus ceased to be members and joined the European Union. Belarus remains the sole member of the Movement in Europe. Turkmenistan, Belarus and Dominican Republic are the most recent entrants. The application of Bosnia and Herzegovina, and Costa Rica were rejected in 1995 and 1998. Serbia has been suspended since 1992 due to the Serbian Government's involvement in the Bosnian War (officially as the Government of the Federal Republic of Yugoslavia at the time). ==Origins== The Non-Aligned movement was never established as a formal organization, but became the name to refer to the participants of the Conference of Heads of State or Government of Non-Aligned Countries first held in 1961. The term \"non-alignment\" itself was coined by Indian Prime Minister Jawaharlal Nehru during his speech in 1954 in Colombo, Sri Lanka. In this speech, Nehru described the five pillars to be used as a guide for Sino-Indian relations, which were first put forth by Chinese Premier Zhou Enlai. Called Panchsheel (five restraints), these principles would later serve as the basis of the Non- Aligned Movement. The five principles were: * Mutual respect for each other's territorial integrity and sovereignty * Mutual non-aggression * Mutual non- interference in domestic affairs * Equality and mutual benefit * Peaceful co- existence A significant milestone in the development of the Non-Aligned Movement was the 1955 Bandung Conference, a conference of Asian and African states hosted by Indonesian president Sukarno, who gave a significant contribution to promote this movement. The attending nations declared their desire not to become involved in the Cold War and adopted a \"declaration on promotion of world peace and cooperation\", which included Nehru's five principles. Six years after Bandung, an initiative of Yugoslav president Josip Broz Tito led to the first Conference of Heads of State or Government of Non- Aligned Countries, which was held in September 1961 in Belgrade. The term non aligned movement appears first in the fifth conference in 1976, where participating countries are denoted as members of the movement. At the Lusaka Conference in September 1970, the member nations added as aims of the movement the peaceful resolution of disputes and the abstention from the big power military alliances and pacts. Another added aim was opposition to stationing of military bases in foreign countries. The founding fathers of the Non- aligned movement were: Sukarno of Indonesia, Jawaharlal Nehru of India, and Josip Broz Tito of Yugoslavia, Gamal Abdul Nasser of Egypt and Kwame Nkrumah of Ghana. Their actions were known as 'The Initiative of Five'. ==Organizational structure and membership== The movement stems from a desire not to be aligned within a geopolitical/military structure and therefore itself does not have a very strict organizational structure. Some organizational basics were defined at the 1996 Cartagena Document on Methodology The Summit Conference of Heads of State or Government of Non- Aligned States is the \"highest decision making authority\". The chairmanship rotates between countries and changes at every summit of heads of state or government to the country organizing the summit. Requirements for membership of the Non-Aligned Movement coincide with the key beliefs of the United Nations. The current requirements are that the candidate country has displayed practices in accordance with the ten \"Bandung principles\": *Respect for fundamental human rights and for the purposes and principles of the Charter of the United Nations. *Respect for the sovereignty and territorial integrity of all nations. *Recognition of the movements for national independence. *Recognition of the equality of all races and of the equality of all nations, large and small. *Abstention from intervention or interference in the internal affairs of another country. *Respect for the right of each nation to defend itself singly or collectively, in conformity with the Charter of the United Nations. *Refraining from acts or threats of aggression or the use of force against the territorial integrity or political independence of any country. *Settlement of all international disputes by peaceful means, in conformity with the Charter of the United Nations. *Promotion of mutual interests and co- operation. *Respect for justice and international obligations. ==Policies and ideology== Secretaries General of the NAM had included such diverse figures as Suharto, an authoritarian anti-communist, and Nelson Mandela, a democratic socialist and famous anti-apartheid activist. Consisting of many governments with vastly different ideologies, the Non-Aligned Movement is unified by its commitment to world peace and security. At the seventh summit held in New Delhi in March 1983, the movement described itself as \"history's biggest peace movement\". The movement places equal emphasis on disarmament. NAM's commitment to peace pre-dates its formal institutionalisation in 1961. The Brioni meeting between heads of governments of India, Egypt and Yugoslavia in 1956 recognized that there exists a vital link between struggle for peace and endeavours for disarmament. The Non-Aligned Movement espouses policies and practices of cooperation, especially those that are multilateral and provide mutual benefit to all those involved. Many of the members of the Non-Aligned Movement are also members of the United Nations and both organisations have a stated policy of peaceful cooperation, yet successes that the NAM has had in multilateral agreements tends to be ignored by the larger, western and developed nation dominated UN.Morphet, Sally. “Multilateralism and the Non-Aligned Movement: What Is the Global South Doing and Where Is It Going?” Global Governance 10 (2004), 517–537 African concerns about apartheid were linked with Arab-Asian concerns about Palestine and success of multilateral cooperation in these areas has been a stamp of moderate success. The Non-Aligned Movement has played a major role in various ideological conflicts throughout its existence, including extreme opposition to apartheid regimes and support of liberation movements in various locations including Zimbabwe and South Africa. The support of these sorts of movements stems from a belief that every state has the right to base policies and practices with national interests in mind and not as a result of relations to a particular power bloc. The Non-Aligned Movement has become a voice of support for issues facing developing nations and is still contains ideals that are legitimate within this context. ==Role after the Cold War== Since the end of the Cold War and the formal end of colonialism, the Non-Aligned Movement has been forced to redefine itself and reinvent its purpose in the current world system. A major question has been whether many of its foundational ideologies, principally national independence, territorial integrity, and the struggle against colonialism and imperialism, can be applied to contemporary issues. The movement has emphasised its principles of multilateralism, equality, and mutual non- aggression in attempting to become a stronger voice for the global South, and an instrument that can be utilised to promote the needs of member nations at the international level and strengthen their political leverage when negotiating with developed nations. In its efforts to advance Southern interests, the movement has stressed the importance of cooperation and unity amongst member states,http://www.ipsterraviva.net/TV/Noal/en/default.asp . See \"Putting Differences Aside,\" Daria Acosta, September 18, 2006. but as in the past, cohesion remains a problem since the size of the organisation and the divergence of agendas and allegiances present the ongoing potential for fragmentation. While agreement on basic principles has been smooth, taking definitive action vis-à-vis particular international issues has been rare, with the movement preferring to assert its criticism or support rather than pass hard-line resolutions.http://news.bbc.co.uk/2/hi/2798187.stm#facts. BBC Profile, BBC News, January 30, 2008. The movement continues to see a role for itself, as in its view, the world’s poorest nations remain exploited and marginalised, no longer by opposing superpowers, but rather in a uni-polar world,http://www.nam.gov.za/xiisummit/chap1.htm . See no. 10-11 in Durban Summit 'Final Document.' and it is Western hegemony and neo-colonialism that the movement has really re-aligned itself against. It opposes foreign occupation, interference in internal affairs, and aggressive unilateral measures, but it has also shifted to focus on the socio-economic challenges facing member states, especially the inequalities manifested by globalisation and the implications of neo-liberal policies. The Non-Aligned Movement has identified economic underdevelopment, poverty, and social injustices as growing threats to peace and security.http://www.nam.gov.za/xiisummit/chap1.htm . See no.16-22 in Durban Summit 'Final Document.' ==Current activities and positions== ;Criticism of US policy In recent years the US has become a target of the organisation. The US invasion of Iraq and the War on Terrorism, its attempts to stifle Iran and North Korea's nuclear plans, and its other actions have been denounced as human rights violations and attempts to run roughshod over the sovereignty of smaller nations.http://www.cbc.ca/world/story/2006/09/16/nonalign.html. \"Non- aligned nations slam U.S.,\" CBC News, September 16, 2006. The movement’s leaders have also criticised the American control over the United Nations and other international structures. ;Self-determination of Puerto Rico Since 1961, the group have supported the discussion of the case of Puerto Rico's self- determination before the United Nations. A resolution on the matter will be proposed on the XV Summit by the Hostosian National Independence Movement. ;Self-determination of Western Sahara Since 1973, the group have supported the discussion of the case of Western Sahara's self-determination before the United Nations. The Non-Aligned Movement reaffirmed in its last meeting (Sharm El Sheikh 2009) the support to the Self-determination of the Sahrawi people by choosing between any valid option, welcomed the direct conversations between the parts, and remembered the responsibility of the United Nations on the Sahrawi issue.XV Summit of heads of state and government of the Non Aligned Movement - Final Document. Sharm El Sheikh, Egypt.16-04-2009. See points 237, 238 & 239. ;Sustainable development The movement is publicly committed to the tenets of sustainable development and the attainment of the Millennium Development Goals, but it believes that the international community has not created conditions conducive to development and has infringed upon the right to sovereign development by each member state. Issues such as globalisation, the debt burden, unfair trade practices, the decline in foreign aid, donor conditionalities, and the lack of democracy in international financial decision-making are cited as factors inhibiting development.http://espana.cubanoal.cu/ingles/index.html . See \"Statement on the implementation of the Right to Development,\" January 7, 2008. ;Reforms of the UN The Non-Aligned Movement has been quite outspoken in its criticism of current UN structures and power dynamics, mostly in how the organisation has been utilised by powerful states in ways that violate the movement’s principles. It has made a number of recommendations that would strengthen the representation and power of ‘non-aligned’ states. The proposed reforms are also aimed at improving the transparency and democracy of UN decision-making. The UN Security Council is the element considered the most distorted, undemocratic, and in need of reshaping.http://www.nam.gov.za/xiisummit/chap1.htm . See no.55 in Durban Summit 'Final Document.' ;South-south cooperation Lately the Non-Aligned Movement has collaborated with other organisations of the developing world, primarily the Group of 77, forming a number of joint committees and releasing statements and document representing the shared interests of both groups. This dialogue and cooperation can be taken as an effort to increase the global awareness about the organisation and bolster its political clout. ;Cultural diversity and human rights The movement accepts the universality of human rights and social justice, but fiercely resists cultural homogenisation. In line with its views on sovereignty, the organisation appeals for the protection of cultural diversity, and the tolerance of the religious, socio- cultural, and historical particularities that define human rights in a specific region.http://espana.cubanoal.cu/ingles/index.html . See \"Declaration on the occasion of celebrating Human Rights Day.\" ;Working groups, task forces, committeeshttp://www.nam.gov.za/background/background.htm#2.4 . NAM background information. *High-Level Working Group for the Restructuring of the United Nations *Working Group on Human Rights *Working Group on Peace-Keeping Operations *Working Group on Disarmament *Committee on Palestine *Task Force on Somalia *Non-Aligned Security Caucus *Standing Ministerial Committee for Economic Cooperation *Joint Coordinating Committee (chaired by Chairman of G-77 and Chairman of NAM) ==Summits== The conference of Heads of State or Government of the Non-Alligned Countries, often referred to as Non-Alligned Movement Summit is the main meeting within the movement and are held every few years: # Belgrade, September 1–6, 1961 # Cairo, October 5–10, 1964 # Lusaka, September 8–10, 1970 # Algiers, September 5–9, 1973 # Colombo, August 16–19, 1976 # Havana, September 3–9, 1979 # New Delhi (originally planned for Baghdad), March 7–12, 1983 # Harare, September 1–6, 1986 # Belgrade, September 4–7, 1989 # Jakarta, September 1–6, 1992 # Cartagena de Indias, October 18–20, 1995 # Durban, September 2–3, 1998 # Kuala Lumpur, February 20–25, 2003 # Havana, September 15–16, 2006 # Sharm El Sheikh, July 11–16, 2009 # Isfahan, August 26–31, 2012 # Porlamar, September 13–18, 2016 # Baku, October 25–26, 2019 A ministerial meeting takes place in between the conferences of Heads of State and Government in a country which is not the chair of the movement. The 2011 meeting is on Bali, Indonesia in May 2011. ==References== ==Related pages== * Third World == Other websites == * * Official Site: 15th Summit — Fifteenth Non Aligned Movement Summit, (Sharm el Sheikh July 11–16, 2009) * Official Site: 14th Summit — Fourteenth Non Aligned Movement Summit, (Havana, September 11–16, 2006) * Non-Aligned Movement — Resource site * International Institute for Non-Aligned Studies — International Organization for Non-Aligned Movement * The Cold War International History Project's Document Collection on the NAM Category:Cold War",
 "title": "Non-Aligned Movement"
}