{
 "id": "295850",
 "text": "Economic development it is the growth of standard of living of nations from a poor economy to a high-income economy. When the local quality of life is improved, there is more economic development.Blair, John and conor Carroll. Local Economic Development: Analysis, Practices, and Globalization. Sage Publications, 2009 Adam Smith theory of Economic development created a basic framework for understanding. When social scientists study economic development, they look at a lot of things. They want to know about the way economic development is discussed by historians. They also want to know how development is happening today. They may want to know why people invest more money in some places than in others. They also want to know why people are better at making things to sell in some countries rather than others.Lewis F. Abbott, Theories Of Industrial Modernization & Enterprise Development: A Review, Revised 2nd edition 2003, pages 1–2. . == Measuring Economic Development == Economists usually measure economic development by GDP, Gross domestic product. Same map for people with color blindness. One way to measure economic development is human development. Human development is very important, and includes the health of the people and their education. This usually goes together with economic growth. As people in a country become healthier and get better education, they also usually get richer, because healthy, educated workers are more productive (better at making things), and richer workers can afford health and education.Hanushek, Eric A., and Ludger Woessmann. 2008. \"The role of cognitive skills in economic development.\" Journal of Economic Literature, 46, no. 3 (September): 607-668. The Human Development Index looks at how long people live, how well people read, how many people go to school, and how much money people make. Economists also look at the rate of growth, which is how fast a country gets richer. ==Related pages== * Developed country * Developing country * Development economics * Economic sector * Human Development Index * Newly industrialized country * Least developed country * OECD * BRICS * Next Eleven * Four Asian Tigers * Standard of living ==References== ==Other websites== Category:Economics",
 "title": "Economic development"
}