{
 "id": "295810",
 "text": "BRICS is an acronym used to talk about the countries of Brazil, Russia, India, China, South Africa, Iran, Egypt, Ethiopia, Indonesia and the United Arab Emirates. Many economists think that all these countries are at a similar stage of economic development. When people write about these countries, they usually write \"BRICS\" or the \"BRICS countries\". The acronym was invented by Jim O'Neill, an economist who worked for Goldman Sachs. In 2001, O'Neill wrote an article that he called \"Building Better Global Economic BRICs\".Global Economics Paper No. 99, Dreaming with BRICs and Global Economics Paper 134, How Solid Are the BRICs?Economist's Another BRIC in the wall 2008 article Mexico and South Korea were the only other countries with economies that are like the BRICs. O'Neill did not include these countries because they were considered already more developed, as they were already members of the OECD. They also proposed to have a “partnership model” for other countries and talked about starting a common currency. They planned to use the US dollar less. ==Countries that are called \"partnership countries\"== These countries could gain full membership later, but they are not full members. As of 2025's first quarter: Belarus, Bolivia, Cuba, Kazakhstan, Malaysia, Thailand, Uganda, Uzbekistan, Nigeria ==Leaders== Leaders as of 2025's first quarter File:Luiz Inácio Lula da Silva.jpg|alt=BrazilLuiz Inácio Lula da Silva,President of Brazil| Luiz Inácio Lula da Silva, President of Brazil File:Vladimir Putin (2017-07-08).jpg|alt=RussiaVladimir Putin,President| Vladimir Putin, President File:PM Modi Portrait(cropped).jpg|alt=IndiaNarendra Modi,Prime Minister| Narendra Modi, Prime Minister File:Xi Jinping 2019.jpg|alt=ChinaXi Jinping,President| Xi Jinping, President File:2019 Reunião Informal do BRICS - 48142657142 (cropped).jpg|alt=South AfricaCyril Ramaphosa,President| Cyril Ramaphosa, President File:Khamenei 2023.jpeg| Seyed Ali Khamenei, Supreme Leader|alt=IranSeyed Ali Khamenei,Supreme Leader File:PM in a bilateral meeting with the Prime Minister of the Federal Democratic Republic of Ethiopia, Mr. Ably Ahmed during the 15th BRICS Summit at Johannesburg, in South Africa on August 24, 2023 (cropped).jpg|Ethiopia Abiy Ahmed, Prime Minister File:Abdel Fattah el-Sisi in 2017.jpg| Abdel Fattah el-Sisi, President|alt=EgyptAbdel Fattah el-Sisi,President File:Mohamed bin Zayed Al Nahyan - 2024 (cropped).jpg| Mohamed bin Zayed Al Nahyan, President|alt=United Arab EmiratesMohamed bin Zayed Al Nahyan,President ==Countries that have applied for membership== A total of 15 countries have formally applied to join BRICS, listed as follows: * (applied in 2022) (Expected to join in next expansion) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) * (applied in 2023) ==References== ==Bibliography== * Elder, Miriam, and Leahy, Joe, et al., Who's who: Bric leaders take their place at the top table, Financial Times, London, September 25, 2008 * O'Neill, Jim, BRICs could point the way out of the Economic Mire, Financial Times, London, September 23, 2008, p. 28\\. * * Category:International organizations Category:Economics organizations Category:Economy of Africa Category:Economy of Asia Category:Economy of South America Category:Economy of Brazil Category:Economy of India Category:Economy of Russia Category:Economy of South Africa Category:China",
 "title": "BRICS"
}