{
 "id": "296",
 "text": "Geography (from Greek: , geographia, literally \"earth description\") is the study of earth and its people and one of social sciences. Its features are things like continents, seas, rivers and mountains. Its inhabitants are all the people and animals that live on it. Its phenomena are the things that happen like tides, hurricanes, tornadoes, earthquakes and more. A person who is an expert in geography is a geographer. A geographer tries to understand the world and the things that are in it, how they started and how they have changed.Geography: The Mother of Sciences Geography is divided into two main parts which are: Physical geography and human geography. Physical geography studies the natural environment and human geography studies the human environment. The human environmental studies would include things such as the population in a country, how a country's economy is doing, and more. There is also environmental geography. Maps are a main tool of geography, so geographers spend much time making and studying them. Making maps is called cartography, and people who specialize in making maps are cartographers. == Branches == === Physical geography === Physical geography (or physiography) focuses on geography as an Earth science. It aims to understand the physical problems and the issues of lithosphere, hydrosphere, atmosphere, pedosphere, and global flora and fauna patterns (biosphere). Physical geography can be divided into many broad categories, including: : Biogeography Climatology & Meteorology Coastal geography Environmental management Geodesy Geomorphology Glaciology Hydrology & Hydrography Landscape ecology Oceanography Pedology Palaeogeography Quaternary science === Human geography === Human geography is the social science that covers the study of people and their communities, cultures, economies and their interaction with the environment. Geographers studying the human environment may look at: * Population * Countries of the world * Land use * Agriculture * City * Industry * Energy * Pollution ==History== The oldest known world map dates back to ancient Babylon from the 9th century BC. The best known Babylonian world map is the Imago Mundi of 600 BC. Star charts (maps of the sky) are of similar age. During the Middle Ages, people in Europe made fewer maps. People in the eastern countries made more. Abū Zayd al-Balkhī created the \"Balkhī school\" of mapping in Baghdad. Western Europe became known as the leader of geographic thought during the European Renaissance and The Age of Exploration (1400–1600). The printing press made maps and information about the world available to everyone. In 1650, the first edition of Geographia Generalis was published. In the 1700s and 1800s scientists started to study the relationship between the environment and its people Related pages * Geodesy * Geographer * Geographical renaming * Geopolitics * International Geographical Union * Landform * Map * Navigator == References == == Other websites == * Geography Trainer 1.3 - Educational game aimed at school children * www.geoknow.net - Geography resources at your fingertips! * PopulationData.net * PopulationMondiale.com * Using Literature To Teach Geography in High Schools. ERIC Digest. * Teaching Geography at School and Home. ERIC Digest. * The National Geography Content Standards. ERIC Digest.",
 "title": "Geography"
}