{
 "id": "296411",
 "text": "Hox genes are a group of related genes that determine the basic structure and orientation of animals and plants.Dictionary.com – Hox gene . Accessed March 31, 2011.Jongmin Nam, Claude W. dePamphilis, Hong Ma, Masatoshi Nei. Antiquity and evolution of the MADS-Box gene family controlling flower development in plants. 'Hox' is short for 'homeobox'. Hox genes are critical for the proper placement of segment structures of animals during early embryonic development (e.g. legs, antennae, and wings in fruit flies or the different vertebrate ribs in humans).Gehring, Walter J. 1998. Master control genes in development and evolution. the homeobox story. Yale University Press, New Haven CT. Hox genes are a complex of genes whose proteins bind to the regulatory regions of target genes. The target genes then activate or repress cell processes to direct the final development of the organism.Lewis E.B. 1995. The bithorax complex: the first fifty years. Nobel Prize lecture. Repr. in Ringertz N. (ed) 1997. Nobel lectures, Physiology or Medicine. World Scientific, Singapore.Lawrence P. 1992. The making of a fly. Blackwell, Oxford. *Hox genes have a DNA sequence known as the homeobox. The homeobox is a 180 nucleotide- long DNA sequence which codes for a 60 amino acid-long protein domain known as the homeodomain. This works by binding with DNA. *Hox genes are in gene clusters on the genome *The order of the loci in the chromosome parallels the order in which the loci are expressed in segments along the body. *This cluster of master control genes programs the development of all higher organisms.Duncan I. 1987. The bithorax complex. Ann. Rev. Genetics 21, 285–319. *The cluster is highly \"conserved\". It has not changed much over hundreds of millions of years of evolutionary history. Molecular evidence shows that some limited number of hox genes have existed in the Cnidaria since before the earliest true Bilatera. This means the system evolved before the Palaeozoic era. Ryan J.F. et al 2007. Pre-bilaterian origins of the hox cluster and the hox code: evidence from the sea anemone, Nematostella vectensis. PLoS ONE 2, (1), e153. == Sequence of hox genes == In some organisms, especially vertebrates, the various hox genes are very close to one another on the chromosome in groups or clusters.Lewis E.B. 1992. Clusters of master control genes regulate the development of higher organisma. Journal of the American Medical Association 292 154–31. The order of the genes on the chromosome is the same as the expression of the genes in the developing embryo. The first gene is expressed in the front of the developing organism. The reason for this co-linearity is not yet completely understood. The diagram above shows the relationship between the genes and protein expression in flies. === Found in all animals and plants === The homeodomain protein motif is highly similar in most animals and plants. In addition, homeodomains of individual hox proteins are similar in many species. Because of this, it is thought hox gene clusters evolved from a single hox gene via tandem gene duplication. A hox gene cluster with at least seven different hox genes was probably present in the common ancestor of all bilateral animals. == Humans == Humans have a total of 39 hox genes in clusters on four chromosomes. == Related pages == *Edward B. Lewis *Transcription factor == References == Category:Genetics Category:Evolutionary biology Category:Developmental biology",
 "title": "Hox gene"
}