{
 "id": "296546",
 "text": "Kangaroo Island is Australia's third-largest island after Tasmania and Melville Island. It is southwest of Adelaide in the state of South Australia. At its closest point to the mainland, it is offshore from Cape Jervis. The island is long and between and wide, its area covering . Its coastline is long and highest altitude is . ==Wildlife and its protection== More than half of the island has never been cleared of vegetation, and a quarter of it is conserved in National Parks, Conservation Parks, and five Wilderness Protection Areas. The main protected areas are: * Flinders Chase National Park * Seal Bay Conservation Park * Cape Gantheaume Conservation Park * Cape Bouguer Wilderness Protection Area * Ravine des Casoars Wilderness Protection Area Because of its isolation from mainland Australia, foxes and rabbits are not there. People are forbidden to bring them into the island. Registration and microchipping of cats is compulsory. The Kangaroo Island kangaroo, Rosenberg's sand goanna, southern brown bandicoot, Tammar wallaby, common brushtail possum, short-beaked Echidna and New Zealand fur seal are native to the island, as well as six bat and frog species. The sole endemic (found nowhere else) vertebrate species is a small marsupial carnivore called the Kangaroo Island dunnart. The koala, common ringtail possum and Platypus have been introduced and still survive there. Kangaroo Island had a native species of emu, the Kangaroo Island emu which became extinct between 1802 and official European settlement in 1836. Perhaps this was caused by bushfires or hunting by sealers or whalers. The introduced koalas have flourished so well on the island that their preferred food source, the manna gum tree, is at risk of local extinction. Koalas have recently been forced to turn to other, less tasty, plants. Park Management has been searching for a solution. == Tourism == The island is a major tourist attraction. == References == Category:Islands of Australia Category:Geography of South Australia",
 "title": "Kangaroo Island"
}