{
 "id": "296890",
 "text": "SV Grödig is an Austrian football club from Grödig near Salzburg, Austria . The team plays in the Regionalliga Salzburg, the third highest league in Austrian football. ==History== The club was founded in 1948 and played till the 1990s in different classes of the SFV (Salzburger football association). In the 1990s they won 4 championships. 2003 they promoted to the Regionalliga West(3rd division). 2006 Eduard Glieder, a former team player became coach of SV Grödig, they reached the 6th place. The next year Heimo Pfeifenberger, another former team player became coach. 2008 they were promoted to the 1.Division, the second level in Austrian football. The first year was not successful and they were relegated to the Regionalliga. 2009/10 they won the league and were again promoted to the First Division. The season 2010/11 was successful, they reached th 6th place. After this success the president announced, that the aim for the next season is reaching a top position. Therefore, the team was chanced and 6 players left the club. 2012/13 they won the league under coach Adi Hütter and were promoted to the Bundesliga. In the 2015/16 league they were relegated to the Second League, but went straight to the third league because of financial reasons. ==Current squad== https://www.transfermarkt.at SV Grödig Kader ==Coaches== * Miroslav Bojčeski (20 Aug 2005 – 30 June 2006) * Eduard Glieder (1 July 2006 – 30 June 2007) * Heimo Pfeifenberger (1 July 2007 – 12 Dec 2008) * Miroslav Bojčeski (14 Dec 2008 – 30 June 2009) * Michael Brandner (1 July 2009 – 26 March 2010) * Johann Davare (interim) (26 March 2010 – 3 April 2010) * Heimo Pfeifenberger (4 April 2010 – 30 May 2012) * Adi Hütter (1 June 2012 – 31 May 2014) * Michael Baur (1 June 2014–15) * Peter Schöttel (17 June 2015 – 16 May 2016) * Andreas Fötschl (1 July 2016 – 31 Dec 2017) * Mario Messner (1 January 2018 – 4 November 2018) * Miroslav Bojceski (3. December 2018 – 30 June 2020) * Heimo Pfeifenberger (1 July 2020 – 31 December 2021) * Thomas Schnöll (1 January 2021 – present) ==Honours== * Champion Regionalliga West(3) * Champion in different leagues of the Salzburg football association (31) ==References== Category:Football clubs of Salzburg Category:Austrian football clubs Category:1948 establishments in Europe Category:1940s establishments in Austria",
 "title": "SV Grödig"
}