{
 "id": "297105",
 "text": "\"Brother, Can You Spare a Dime?\", also sung as \"Buddy, Can You Spare a Dime?\", is one of the best-known American songs of the Great Depression. Written in 1931 by lyricist E. Y. \"Yip\" Harburg and composer Jay Gorney, \"Brother, Can You Spare a Dime?\" was part of the 1932 musical New Americana; the melody is based on a Russian lullaby Gorney heard as a child. It became best known, however, through recordings by Bing Crosby and Rudy Vallee. Both versions were released right before Franklin Delano Roosevelt's election to the presidency and both became number one hits on the charts. The Brunswick Crosby recording became the best-selling record of its period, and came to be viewed as an anthem of the shattered dreams of the era.Giddins, G. (2001). Bing Crosby: A Pocketful of Dreams, The Early Years, 1903 - 1940. Little, Brown, p.305. ==Summary== The song asks why the men who built the nation – built the railroads, built the skyscrapers – who fought in the war (World War I), who tilled the earth, who did what their nation asked of them should, now that the work is done and their labor no longer necessary, find themselves abandoned, in bread lines. The Twentieth Century: A People's History, by Howard Zinn, p. 116 ==Musical structure== The song has unusual structure for a Broadway song. Firstly, rather than starting in a major key, as most Broadway songs do, it begins in a minor key, which is darker, and more appropriate for the Depression. When discussing the prosperous past and building the railroads, the song jumps an octave and moves briefly into a major key, evoking energy and optimism. It then reverts to a minor key in the word \"time\" in the line \"Once I built a railroad, made it run / Made it race against time,\" marking the end of prosperous times, and changing to a wistful mood. The song then ends, not on a note of resignation, but with anger – repeating the beginning (as is usual for Broadway songs), an octave higher, but with a significant change: the friendly \"Brother, can you spare a dime?\" is replaced with the aggressive \"Buddy, can you spare a dime?\"A Depression-Era Anthem For Our Times \"n 1932, a young New York City lyricist named E.Y. \"Yip\" Harburg, together with composer Jay Gorney, penned what is considered the anthem of the Great Depression, 'Brother, Can You Spare a Dime?' \" National Public Radio's Weekend Edition (November 15, 2008). ==Update== During the bad times in the 1970s, the New York Times asked Harburg to update \"Brother\" for a new age, and he responded with:Song by song: the lives and work of 14 great lyric writers, Caryl Brahms, Ned Sherrin, p. 125–126Cutting edge, or, \"Back in the knife-box, Miss Sharp\": Ned Sherrin's anthology of wit, Ned Sherrin, 1984, p. 140. ==Other recordings== * Al Jolson live performance recorded in the early 30's. * Peter, Paul and Mary recorded a version in 1965, for their album See What Tomorrow Brings. * Barbra Streisand recorded a version in 1966, for her album My Name is Barbra, Two.... * Spanky And Our Gang recorded a version in 1967, on their \"Spanky and Our Gang\" album. * Tom Jones recorded a version in 1970, for his album I Who Have Nothing. * Judy Collins recorded a version in 1975, for her album Judith. * Peter Yarrow (from Peter Paul and Mary) recorded alone in 1975 for his album Hard times. * Tom Waits recorded a version in 1976, for his album Spare Parts. * Tiny Tim recorded a version in 1979, for his album Chameleon * The Dave Brubeck Quartet recorded a version in 1980, for the album Tritonis * Eugene Chadbourne recorded a seven minutes long version in 1996, for his album Jesse Helms Busted With Pornography. * George Michael recorded a version in 1999, for his 1999 album Songs from the Last Century. ==Gallery== File:YongeStreetMission.jpg|Why should I be standing in line, just waiting for bread? File:Jämsä–Orivesi railway under construction.jpg|Once I built a railroad, I made it run, made it race against time. File:Old timer structural worker2.jpg|Once I built a tower, up to the sun, brick, and rivet, and lime; File:Cheshire Regiment trench Somme 1916.jpg|Once in khaki suits, gee we looked swell, Full of that Yankee Doodly Dum, Half a million boots went slogging through Hell, ==References== == Other websites == * Songs of the Great Depression – lyrics, prepared by Professor Catherine Lavender for courses in The Department of History, The College of Staten Island of The City University of New York. * Explanation of lyrics Category:Bing Crosby songs Category:George Michael songs Category:Tom Jones (singer) songs Category:Tom Waits songs Category:Barbra Streisand songs Category:1932 songs Category:1931 works",
 "title": "Brother, Can You Spare a Dime?"
}