{
 "id": "297322",
 "text": "Paul Gustave Doré (; January 6, 1832 – January 23, 1883) was a French artist, engraver, illustrator and sculptor. Most of Doré's work was wood engraving and steel engraving. ==Biography== Doré was born in Strasbourg. His first illustrated story was published at the age of fifteen. As a young man, he began work as a literary illustrator in Paris. He was hired to illustrate scenes from books by Rabelais, Balzac, Milton and Dante. In 1853, Doré was asked to illustrate the works of Lord Byron. British publishers asked him to do more work, including a new illustrated English Bible. Ten years later, he illustrated a French edition of Cervantes's Don Quixote. His images of the knight and Sancho Panza have influenced later readers, artists, and stage and film directors' ideas of how the two characters looked. Doré also illustrated an edition of Edgar Allan Poe's \"The Raven\" with larger than usual pages. He was paid 30,000 francs by the publisher Harper & Brothers in 1883.Quinn, Arthur Hobson. Edgar Allan Poe: A Critical Biography. Baltimore: The Johns Hopkins University Press, 1998. p. 252. Doré's English Bible (1866) was a great success, and in 1867 Doré had a major exhibition of his work in London. The Doré Gallery in Covelant Bond Street opened after the show. In 1869, Blanchard Jerrold suggested that they work together to make a complete portrait of London. Jerrold got the idea from The Microcosm of London produced by Rudolph Ackermann, William Pyne, and Thomas Rowlandson in 1808. Doré signed a five-year contract with the publishers Grant & Co. He had to stay in London for three months each year. He was paid £10,000 a year for the project. The completed book, London: A Pilgrimage, was published in 1872. It had 180 engravings. The book was successful financially and influenced many people. However, many critics at the time disliked it. Some of these critics wrote that Doré paid too much attention to the poverty in parts of London. His later works included Coleridge's Rime of the Ancient Mariner, Milton's Paradise Lost, Tennyson's The Idylls of the King, The Works of Thomas Hood, and The Divine Comedy. His work also appeared in the Illustrated London News. He continued to illustrate books until he died in Paris after a short illness in 1883. He is buried in Père Lachaise Cemetery in Paris. ==Gallery== Image:Paul Gustave Dore Raven14.jpg|Illustration 14 from The Raven Image:Paul Gustave Dore Raven15.jpg|Illustration 15 from The Raven for the line \"Perched upon a bust of Pallas.\" Image:Das Lied der Debora.jpg|The song of Deborah Image:Orlando Furioso 14.jpg|Illustration 14 from Orlando Furioso Image:Orlando Furioso 9.jpg|A hippogriff from Orlando Furioso Image:Paradise Lost 13.jpg|Satan from Paradise Lost Image:Confusion of Tongues.png|Confusion of Tongues–The Tower of Babel Image:Gustave Dore Ancient Mariner Illustration.jpg|From The Rime of Ancient Mariner Image:Idylls of the King 3.jpg|From Idylls of the King Image:Paradiso Canto 31.jpg|Paradiso Canto 31 Image:Pcnto12.jpg|Purgatorio Canto 12 Image:Inferno Canto 5 lines 32-33.jpg|Inferno Canto 5 Image:Gustave Doré - Dante Alighieri - Inferno - Plate 9 (Canto III - Charon).jpg|Inferno Charon crossing the River Styx Image:Don Quixote 5.jpg|Don Quixote ==List of works== Doré made many works of art. This list is very long, but does not include every piece of art that Doré made. It does not include his sculptures and paintings. Also, many journal illustrations are not listed. Date Author Work Volumes / Format Illustrations Publisher Ref 1854 Gustave Doré Histoire pittoresque dramatique et caricaturale de la Sainte Russie, d'après les chroniqueurs et historiens Nestor Nikan Sylvestre Karamsin Ségur etc. 1 vol. 500 Paris: de Bry indyworld.com Gustave Doré's «Holy Russia» by Bill Kartalopoulos. INDY Magazine, Summer 2004 1854 Rabelais Oeuvres contenant la vie de Gargantua et celle de Pantagruel ... 1 vol. 4to. Frontis. & 15 J.Bry Ainé, Paris Eleanor Garvey, A Catalogue of an Exhibition of the Philip Hofer Bequest, 1988. 1855 Honoré de Balzac Les Contes Drôlatiques 425 Société Générale de la Libraire, and in Le Journal pour Tous Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 183. Cassell & Company, Limited, New York, 1885. 1856 Fierabras d'Alexandrie, Légende Nationale traduite par Mary Lafon 1 vol in 8vo 123 Librairie Nouvelle Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 207. Cassell & Company, Limited, New York, 1885. 1856 Mémoires d'un Jeune Cadet, par Victor Percival 48 1856 La Légende du Juif Errant 1 vol. grand in folio 12 :Image:Wandering jew title page.jpg Michel Lévy 1857Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", pages 215. Cassell & Company, Limited, New York, 1885. Roosevelt states that \"In Doré's catalogue 'L'Inferno' figures amongst the works of 1857, and I shall therefore speak of it as belonging to that year's collection, although it was not brought out until 1860.\" Dante Alighieri L'Enfer 70This reference needs attribution. Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", pages 212-227. Cassell & Company, Limited, New York, 1885. 1857 autumn Ed. de La Bédollière Nouveau Paris, Histoire de ses 20 Arrondissements 1 vol in 4to 150 Barba Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", pages 241-243. Cassell & Company, Limited, New York, 1885. 1857 autumn Valéry Vernier Aline, Journal d'un Jeune Homme, one large page Dentu 1860–1862 Thomas Mayne Reid L'Habitation du Désert, 1 vol. in 16mo 60 Hachette 1860–1862 Ann S. Stevens La Fille du Grand Chieftain 1 vol. 15 1860–1862 M. V. Victor Flêche d'Or 1 vol. 13 1860–1862 E. S. Ellis L'Ange des Frontières 1 vol. 10 1860–1862 N. W. Buxted Les Vierges de la Forêt 1 vol. 10 1860 William Shakespeare The Tempest 1 vol. in 4to (London) 1861 Les Figures du Temps, 1 vol. in 12mo (Paris) 1861 Plouvier and Vincent Les Chansons d'Autrefois in 12mo Coulon and Pineau, Paris 1861 Edmond AboutRoosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", pages 63. Cassell & Company, Limited, New York, 1885. Gustave Doré, Edmond About, and H. Taine were more than contemporaries: they knew each other from college. Roosevelt quotes Doré, \"...from that date [1847] until 1850, I occupied myself—sometimes well and sometimes badly—in finishing my studies at the Lycée Charlemagne. It was there that I was so fortunate as to have Edmond About and H. Taine for fellow-collegians.\" Le Roi des Montagnes 1 vol. in 8vo 157 Hachette and Co., Paris 1862 Saintine Les Mythologies du Rhin 1 vol. in 8vo 165 Hachette and Co., Paris 1862 L'Abbé Léon Godard L'Espagne, Mœurs et Paysages, 2 vols in 8vo 4 :Image:Moeurs et paysages title page.jpg Alfred Mame et Fils, Tours :Image:Moeurs et paysages title page.jpg or Paris 1862 Malte-BrunRoosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", pages 241. Cassell & Company, Limited, New York, 1885. Roosevelt attributes authorship to \"Malted\": \"'Les États Unis et la Mexique,' by Malted (sic) (Brun, Paris, 1862), 1 vol. in 4to.\" She is most likely referring to either Conrad Malte-Brun or his son, Victor Adolphe Malte-Brun, both noted French Geographers. Les États Unis et le Mexique 1 vol. in 4to Brun, Paris 1862 Histoire aussi intéressante qu'invraisemblable de l'intrépide Capitaine Castagnette, neveu de l'Homme à la Tête de Bois 1 vol. in 4to 43 Hachette 1866 Aventures du Baron de Münchausen, traduction nouvelle par Théophile Gautier fils 1 vol. (London) 1863 M. Épiné Légende de Croquemitaine 1 vol. in 4to 177 Hachette 1863 Gastineau La Chasse au Lion et à la Panthère 1 vol. in 8vo Hachette and Co. 1863 Miguel de Cervantes Don Quixote de la Mancha translation by Louis Viardot 2 vols. folio 370 Hachette and Co., Paris, and Cassell and Co., London 1863 Les Contes de Perrault or in Spanish Los Cuentos de Perrault 100+ Hetzels. in Spanish by Ledouse 1865 Gastineau De Paris en Afrique 1 vol. in 12mo (Paris) 1865 A. Masse L'Histoire d'un Minute 1 vol., 12mo (Paris) 1866 Victor Hugo Travailleurs de la Mer Sampson Low and Co., London Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 242. Cassell & Company, Limited, New York, 1885. Roosevelt implies, though does not specifically state, that a French publisher published this volume in 1865. For one, she places this reference with the other books published in 1865, for another, she uses the word also when mentioning that Sampson Low brought out a copy in London in 1866. Additionally, an English publication would most likely be translated and have a title of Toilers of the Sea. Roosevelt's line reads thus: \"Victor Hugo's 'Travailleurs de la Mer,' also in 1866, brought out by Sampson Low and Co., in London.\" 1865 E. Edgar Cressy and Poictiers 1 vol. in 8vo 50+ (London) 1865 Thomas Moore L'Épicurien (French translation) in 8vo (Paris) 1865 Falmy Realm in folio (London) 1865 Quatrelles Le Chevalier Beautemps grand in 8vo (Paris) Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 242. Cassell & Company, Limited, New York, 1885. Roosevelt states that the preface was written by Alex. Dumas fils 1865 Chateaubriand Atala 2 vols, grand folio 80 Hachette Edition 1866 Théophile Gautier Le Capitaine Fracasse 1 vol. grand in 8vo 60 Charpentier 1866 G. La Bédollière Histoire de la Guerre en Mexique in 4to (Paris) 1867 Dante Alighieri Il Purgatorio ed il Paradiso Hachette and Co. 1866Although Blanche Roosevelt lists this book as being published in 1866, here :Image:Le chemin des ecoliers title page.jpg is the title page of an edition published five years earlier, with Gustave Doré drawings. Roosevelt is most likely mistaken. X. B. Saintine Le Chemin des Écoliers 1 vol. in 8vo 450 :Image:Le chemin des ecoliers title page.jpg(not all by Doré) Hachette and Co. 1866 La Sainte Bible, according to the Vulgate, new translation 2 vols. grand in folio 200+ Mame, Tours; Cassell and Co., England 1866 John Milton Paradise Lost Cassell and Co. 1867 La Bédollière La France et la Russie (Paris) 1867 Les Fables de Lafontaine 2 vols. in folio 8 large and 250 small plates Hachette and Co. 1867 Les Pays-bas et la Belgique in 8vo (Paris) 1870 Thomas Hood (Poems) 2 vols. in folio Ward and Lock, London 1870 Samuel Taylor Coleridge The Rime of the Ancient MarinerRoosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 242. Cassell & Company, Limited, New York, 1885. Roosevelt titles this book \"The Song (sic) of the Ancient Mariner\". The error possibly derives from reverse-translating the French title (Le Chanson du Vieux Marin) back into English. grand in 4to 40 large and 3 small drawings 1873 New edition of Rabelais 2 vols. in folio Paris : Garnier; London: Chatto and Windus 1876 Louis Énault London 1 vol. in 4to 174 wood engravings Hachette and Co. 1874 Baron Ch. Davilliers L'Espagne in 4to 309 wood-engravings Hachette and Co.; London: Sampson Low and Co. 1875 Michaud Histoire des Croisades 2 vol. medium folio 100 grand compositions Paris: Hachette and Co. Alfred Tennyson Idylls of the King 1877 Ariosto Orlando Furioso 36 drawings Hachette and Co. (London: Ward and Lock) 1884 Edgar Allan Poe The Raven 26 steel engravings London: Sampson Low and Co., New York: Harper and Co. Roosevelt, Blanche: \"Life and Reminiscences of Gustave Doré.\", page 488. Cassell & Company, Limited, New York, 1885. ==References== ===Bibliography=== *(80 illustrations, earliest photogravures of Dore paintings) *(141 illustrations) *(138 illustrations) *(314 illustrations) *(103 illustrations) *(30 illustrations) *(521 illustrations, reprinting most of the Delorme photogravures) *(exhibition book: 591 illustrations) *(343 illustrations) *(500 illustrations) * (exhibition book: 250 illustrations, 40 in full-color, sometimes incorrectly listed as, “40 b/w, 120 color illustrations”) * (annual listing of the books published in France) ==Other websites== * *Doré's grave site at Cimetière du Père Lachaise *German FTP with Dore illustrations *Dore Bible Gallery *SurLaLune Fairy Tale Illustrations of Gustave Doré *The \"Dore Vase\" in San Francisco's Golden Gate Park, a massive bronze that was exhibited to acclaim at Chicago's 1893 World's Columbian Exposition and later moved to San Francisco *Gustave Doré's Illustrations for 'Don Quixote' *More of Gustave Doré's Illustrations for 'Don Quixote' *World of Dante Doré Dante illustrations in the World of Dante gallery *Elbert Hubbard's account of the Category:1832 births Category:1883 deaths Category:Burials at Père Lachaise Cemetery Category:Disease-related deaths in France Category:Engravers Category:French painters Category:People from Strasbourg Category:French illustrators Category:French sculptors",
 "title": "Gustave Doré"
}