{
 "id": "297612",
 "text": "The Grand Tour was the name of travel through Europe by rich European (mostly British) young men between 1660 until about 1840. It was done to learn about European society and art. The idea was that what they learned on their travels could be used to help those that stayed at home. Italy was often the final country to visit. They would mostly travel with servants and a teacher called a bear-leader. ==Example Grand Tour== Which places the Grand Tour would visit See Fussell (1987), Buzard (2002), Bohls and Duncan (2005) changed through the years. An example would be a British tourist would go from Dover, England and crossed the English Channel to Ostend,Ostend was the initial starting point for William Beckford on the continent. in the Spanish Netherlands/Belgium, or Calais, or Le Havre in France. There they could rent or buy a carriage and travel to Paris. Or they could make the trip by boat, traveling up the Seine to Paris, or up the Rhine to Basel. In Paris, the traveler could take lessons in French, dancing, fencing, and horse riding. Paris was popular because of the language and fashion of French high society. From Paris he would go to Switzerland for a while, often to Geneva. From there the traveler would make a difficult crossing over the Alps into northern Italy. Once in Italy the tourist would visit Turin, then might spend a few months in Florence. Other Grand Tourists would be in Florence to welcome him. A trip to Pisa then on to Padua,The Registro dei viaggiatori inglesi in Italia, 1618-1765, consists of 2038 autograph signatures of English and Scottish visitors, some of them scholars, to be sure. (J. Isaacs, \"The Earl of Rochester's Grand Tour\" The Review of English Studies 3. 9 [January 1927:75-76]). Bologna, and Venice. Venice was seen as the most important place for Italian architecture, and was very important place to visit.Redford, Bruce. Venice and the Grand Tour. Yale University Press: 1996.Eglin, John. Venice Transfigured: The Myth of Venice in British Culture, 1660-1797. Macmillan: 2001. From Venice the traveler went to Rome to study the ruins of ancient Rome. Some travelers also visited Naples to study music. Naples was often the final destination before turning back. From here the traveler went north through the Alps to the German-speaking parts of Europe. From there travelers visited Holland and Flanders before returning across the Channel to England. ==References== == Other websites== * The Grand Tour * Grand Tour online at the Getty Museum * In Our Time: The Grand Tour: Jeremy Black, Edward Chaney and Chloe Chard. * \"Grand Tour\" an exhibition project of the Swedish artist Matts Leiderstam * Voyagers and Voyeurs - Travellers in 19th century France, an anthology * Contemporary Grand Tour in Italy, Pictures and quotes * Digging and Dealing in Eighteenth Century Rome Category:Tourism Category:Travel",
 "title": "Grand Tour"
}