{
 "id": "297978",
 "text": "Mark Louis Recchi (born February 1, 1968 in Kamloops, British Columbia) is a Canadian retired professional ice hockey right winger. He played in the National Hockey League (NHL) for the Pittsburgh Penguins for 6 seasons, the Philadelphia Flyers for 10 seasons, the Montreal Canadiens for 5 seasons, the Carolina Hurricanes for 1 season, the Atlanta Thrashers for 1 season, the Tampa Bay Lightning for 1 season and the Boston Bruins. Recchi also played hockey in the WHL for 4 seasons with the New Westminster Bruins and Kamloops Blazers. When he was playing with the Bruins in 2011 he was the oldest player in the NHL at the time at the age of 43. He has won the Stanley Cup three times: 1 with the Pittsburgh Penguins in 1990, 1 with the Carolina Hurricanes in 2005 and 1 with the Boston Bruins in 2011. == Awards == *He was named to the West First All-Star Team (WHL) in 1987. *He was named to the Second All- Star Team (IHL) in 1988. *He played in the NHL All-Star Game in 1990. *He won the Stanley Cup with the Pittsburgh Penguins in 1990. *He was named to the Second All-Star Team in 1991. *He played in the All-Star Game in 1992. *He played in the All-Star Game in 1993. *He played in the All-Star Game in 1996. *He was named the All-Star Game MVP in 1996. *He played in the All-Star Game in 1997. *He played in the All-Star Game in 1998. *He played in the All-Star Game in 1999. *He won the Stanley Cup with the Carolina Hurricanes in 2005. *He won the Stanley Cup with the Boston Bruins in 2011 ==References== == Other websites == * Category:1968 births Category:Atlanta Thrashers players Category:Boston Bruins players Category:Canadian ice hockey right wingers Category:Carolina Hurricanes players Category:Ice hockey people from British Columbia Category:Kamloops Blazers players Category:Living people Category:Montreal Canadiens players Category:New Westminster Bruins players Category:Philadelphia Flyers players Category:Pittsburgh Penguins players Category:Tampa Bay Lightning players Category:International Hockey League (1945–2001) players",
 "title": "Mark Recchi"
}