{
 "id": "297993",
 "text": "Tarbes () is a commune in the Hautes-Pyrénées department in the Occitanie region in southwestern France. It is part of the historical region of Gascony and is the capital since 1790 of the Hautes-Pyrénées department. It is the second largest metropolitan area of the old Midi-Pyrénées region, after Toulouse. ==Name== The city is named for the first time during the 5th century like Civitas Turba ubi castrum Bigorra. It is also an important city of the Novempopulania.Novempopulania (\"country of the nine peoples\") was a Roman province, also called Aquitania Tertia. Gregory of Tours, in the 7th century, called the city as Talvam vicum. During the Middle Ages, the city was named as Tarbe (1214), Tursa, Tarvia (1284) and also Tarbia. ==History== A small town founded in the 3rd century B.C. became a Roman colony under the name of Tarba. It was destroyed by the Vikings in 840 and rebuilt by the Bishop of Bigorre or Tarbes. From the twelfth century on, Tarbes became the capital of the County of Bigorre.In this case, \"county\" () means \"land under a count (the British earl)\". During the religious wars, the cathedral was burnt in 1569 by Protestants but the bishop had it rebuilt in 1652. In 1790, Tarbes became the capital of the new department of Hautes-Pyrénées. ==Geography== Tarbes is located in the southwest of France, at the foot of the Pyrenees, in a fertile plain of the valley of the river Adour, at to the northeast of Lourdes, to the southeast of Auch, to the east of Bayonne and to the southwest of Toulouse. It has an area of and its average altitude is ; at the city hall, the altitude is . Two rivers flow through the city: the Adour by the east and the Échez by the west. ===Neighboring municipalities=== Tarbes and its neighboring communes The following municipalities (communes) are around Tarbes: * To the north: Andrest, Bazet (going to Bordeaux) * To the northeast: Orleix, Aureilhan (going to Auch) * To the east: Séméac (going to Saint-Gaudens, Toulouse) * To the southeast: Soues, Barbazan-Debat * To the south: Laloubère, Horgues (going to Bagnères-de-Bigorre) * To the southwest: Juillan, Ossun, Hibarette, Odos (going to Lourdes, Argelès-Gazost) * To the west: Ibos (going to Pau, Bayonne) * To the northwest: Bordères-sur-l'Échez, Oursbelille ===Climate=== Tarbes has an oceanic climate with relatively hot summers, mild winters and abundant rainfall, Cfb in the Köppen climate classification. ==Population== The inhabitants of Tarbes are known, in French, as Tarbais (women: Tarbaises). The city of Tarbes has a population, in 2014, of 40,900; its population density is of inhabitants/km2. Evolution of the population in Tarbes Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:60000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:5000 start:0 ScaleMinor = gridcolor:lightgrey increment:2500 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2011 text:2011 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 55375 bar:1975 from:0 till: 54897 bar:1982 from:0 till: 51422 bar:1990 from:0 till: 47566 bar:1999 from:0 till: 46275 bar:2006 from:0 till: 45433 bar:2011 from:0 till: 42888 bar:2014 from:0 till: 40900 PlotData= bar:1968 at: 55375 fontsize:S text: 55,375 shift:(-12,5) bar:1975 at: 54897 fontsize:S text: 54,897 shift:(-15,5) bar:1982 at: 51422 fontsize:S text: 51422 shift:(-15,5) bar:1990 at: 47566 fontsize:S text: 47,566 shift:(-15,5) bar:1999 at: 46275 fontsize:S text: 46275 shift:(-15,5) bar:2006 at: 45433 fontsize:S text: 45,433 shift:(-15,5) bar:2011 at: 42888 fontsize:S text: 42,888 shift:(-15,5) bar:2014 at: 40900 fontsize:S text: 40,900 shift:(-15,5) ==Administration== Tarbes is the prefecture of the Hautes-Pyrénées department since 1790. It is also the capital of three Cantons: # Tarbes-1, formed with a part of Tarbes (13,514 inhabitants) (2014) # Tarbes-2, formed with a part of Tarbes (13,402 inhabitants) (2014) # Tarbes-3, formed with a part of Tarbes (13,984 habitants) (2014) It is part of the intercommunality Le Grand Tarbes (). === Sister cities === Tarbes is twinned with: * Huesca, Spain, since 7 May 1964 * Altenkirchen, Germany, since 24 June 1972 ==Transport== The Gare de Tarbes railway station offers direct connections with Paris, Bordeaux, Toulouse, Bayonne and other cities in the region. There is a motorway that connects Tarbes with Bayonne and Toulouse. Tarbes is also served by the small Tarbes- Lourdes-Pyrénées Airport situated 10 kilometers away of the city centre. == Education == * Institut national polytechnique de Toulouse ==Gallery== File:Tarbes (Hautes-Pyrénées) quai de l'Adour.jpg|The Adour river through Tarbes File:Massey Cloitre.jpg|Massey garden File:Fontaine Duvignau.JPG|Fountain of the Quatre-Vallées File:Église Sainte-Thérèse de Tarbes.JPG|Sainte-Thérèse de Tarbes church ==Related pages== * Arrondissement of Tarbes * Communes of the Hautes-Pyrénées department ==Notes== ==References== ==Other websites== * City Council website * Office de Tourisme - Tarbes * Grand Tarbes website * Tarbes (Hautes-Pyrénées) Information",
 "title": "Tarbes"
}