{
 "id": "297931",
 "text": "Roy Rogers (born Leonard Franklin Slye, November 5, 1911 – July 6, 1998) was an American singer and cowboy actor. Roy Rogers Restaurants chain was named after him. He and his third wife Dale Evans, his golden horse named Trigger, and his German Shepherd named Bullet were in more than 100 movies and The Roy Rogers Show. The show was on the radio and then on television from 1951 through 1957. His productions usually had a sidekick, usually either Pat Brady, (who drove a Jeep called \"Nellybelle\") or Andy Devine, or the crotchety George \"Gabby\" Hayes. Rogers' nickname was \"King of the Cowboys.\" Evans' nickname was \"Queen of the West.\" ==About Roy Rogers' life== ===Early life=== Leonard Franklin Slye was born in Cincinnati, Ohio in USA. His parents' names were Andrew and Mattie Slye. His family lived in a tenement building on 2nd Street. (Riverfront Stadium was built at this place in 1970 and Leonard joked that he had been born at second base.) His father, Andrew Slye, was not happy with his job and city life. So, Andy Slye and his brother Will built a 12-by-50-foot houseboat from salvage lumber. In July 1912, the Slye family traveled up the Ohio River towards Portsmouth, Ohio, to pursue a more stable life in Portsmouth. They bought land on which they could build a home. Because of the flood of 1913, they moved their houseboat to the land and thereafter continued living in the houseboat on dry land. In 1919, the Slyes bought a farm in Duck Run, located near Lucasville, Ohio, 12 miles north of Portsmouth. There they built a six-room home. But the farm alone could not give a good income for his family, so Andrew took a job at a shoe factory in Portsmouth. He lived there during the week and returned home on weekends. He used to bring gifts for his family after paydays. One important gift was a horse which is how Leonard first learned how to ride. Leonard attended high school in McDermott, Ohio. When he was 17, his family returned to Cincinnati. In Cincinnati, his father started work at another shoe factory. Leonard also wanted to help his family to earn more money, so he left high school. He started to work with his father at the shoe factory and went to night school. Leonard was made fun of for sleeping in class, so he left night school. Leonard and his father did not like their factory jobs. In 1929, his older sister, Mary, went to Lawndale, California, with her husband. Leonard and his father left their shoe factory jobs. The family lived with Mary for four months and then cam back to Ohio. Soon, Leonard got to go to California with Mary's husband's father. The rest of the family came to California in the spring of 1930. The Slyes rented a small house close to Mary. Leonard and his father soon found jobs as truck drivers for a highway making project, but soon learned that their employer had become bankrupt. Then came the years of the Great Depression. The Slyes moved from job to job, collecting fruit and living in worker camps. One day, Andrew Slye learned about a shoe factory hiring in Los Angeles. Andrew asked Leonard to join him. Leonard felt happy playing guitar and singing around campfires and told his father that he wanted to earn money through music. His father agreed. Leonard and his cousin Stanley Slye went to Los Angeles and started performing as The Slye Brothers. Leonard had by then come to be known as Len. In 1932, he met Lucile Ascolese while on tour. The same year, a palomino colt was born in Santa Cietro, CA. The young horse was first named \"Golden Cloud,\" and later renamed \"Trigger.\" In May 1933, Len, 21, proposed to Lucile, 19, on the radio. Len then went on tour with the \"O-Bar-O Cowboys.\" In June 1933, Len met Grace Arlene Wilkins at a radio station in New Mexico. She gave Len a lemon pie in exchange for his singing \"Swiss Yodel\" on the radio. By August 1934, Len and Lucile had separated as she was jealous and tired of being a musician's wife. Len and Lucile divorced on June 8, 1936. Len and Grace Arlene Wilkins married in Roswell, New Mexico, on June 11, 1936.\"Roy Rogers\" by Robert W. Phillips, MacFarland Press publisher (1995) In 1941, Len and his wife Grace adopted a girl, Cheryl Darlene. In 1942, they legally changed their names to Roy and Grace Arlene Rogers. The next year, Grace gave birth to a daughter, Linda Lou. == References == Category:American television actors Category:Actors from Cincinnati Category:Singers from Ohio Category:1911 births Category:1998 deaths Category:Deaths from heart failure",
 "title": "Roy Rogers"
}