{
 "id": "297949",
 "text": "In the Christian religion, The Day of Judgment is the day in the future when all people who are living or dead will be judged by God. It is often known as the Last Judgment, Final Judgment, Judgment Day, Doomsday, or sometimes it is called The Day of the Lord. ==Beliefs of the early Christians== In the Torah the prophets had said that one day God would send His son to forgive people for the wrong things they had done and to save their souls. In the early years of the Christian church people thought that, although Jesus Christ had now visited the world and died for us on the cross, salvation will only be completed when the world ends and all people alive or dead will face God who will judge them. ==References to the Day of Judgment in the Bible== The Day of the Lord is mentioned several times in the Old Testament (e.g. Book of Ezekiel chapter 13 v.5 and Isaiah chapter 2 v.12). In the New Testament the coming of Christ as Judge of the world is mentioned very often. In Paul’s letters and in the Revelation to John, then Christians who are saved by their faith in Jesus will reign with Christ. When Christ comes, His arrival will be announced by a trumpet call. He will come down from heaven. All the people who are alive will stay alive, and all the people who are dead will become alive again.First Epistle to the Thessalonians, Chapter 4 v.17 Christ’s Second Coming is talked about in the ancient creeds. In the Apostles' Creed it says: “He ascended into heaven...From thence He shall come to judge the living and the dead”. In the Nicene Creed it says: “He will come again in glory to judge the living and the dead”. ==The Day of Judgment in art== This belief about the Day of Judgment has inspired many painters throughout the ages to draw or paint the Second Coming of Christ. One of the most famous is Michelangelo’s painting on the ceiling of the Sistine Chapel in Rome. ==References== ==Related pages== *Eschatology ==Further reading== *New Encyclopaedia Britannica vol 16 p. 369 Category:Christian eschatology Category:Judaism Category:Bible Category:Afterlife",
 "title": "Day of judgment"
}