{
 "id": "298431",
 "text": "The Christmas Raid or Magazine fort raid happened on the 23 December 1939. The Irish Republican Army (IRA) stole a lot of weapons and ammunitions (bullets) from the Irish Army. Although the theft from the Magazine Fort building in Phoenix Park was successful, most of what was stolen was recovered by the Irish Army a few days later. Several IRA volunteers were arrested. ==Reasons for raid== The reason for the raid was that the IRA had many Thompson submachine guns. They found it hard to get the .45 ACP bullets used in these guns in Europe. Because the Irish Army also used the Thompson and had large supplies of bullets, the IRA decided to steal some. ==The raid== Around 2030, the gate bell rang, and the Military Police officer on guard opened the gate a little for a civilian who said he had a parcel to deliver to the officer-in- charge. The unidentified man told the MP to open the gate fully and put his hands up. At this point, the IRA team appeared from both inside and outside the fort, confiscating the weapons of the sentry and MP.Stephan Enno P.65The IRA By Tim Pat Coogan, , page 135 The two hostages were then forced to act as human shields for the two intruders to the guardroom where the remaining soldiers were caught by surprise and gave up without a fight. The captives heard 'many' heavy lorries coming and going from the depot. At 2210 hrs the IRA locked the prisoners in the so-called 'C' Magazine area which the raiders had completely emptied. It was 2250, by the time a party of soldiers was sent from Portobello Barracks to find out what was happening at the fort. They managed to catch two of the raiders. A total of 1,084,000 rounds of ammunition had been taken and removed in thirteen lorries with no casualties. Over the next three to four days a large, nationwide hunt was organised to find the stolen items. On 1 January 1940, it was reported that almost three-quarters of the ammunition had been found, a total of 850,000 rounds; * two and a half tons were found in Dundalk, County Louth, * eight tons in Swords, County Dublin, * sixty-six cases of Thompsons and ammunition in South Armagh (2 and a half tons captured by the Royal Ulster Constabulary (RUC)), * one hundred crates containing 120,000 rounds in Straffan, County Kildare. In addition, some IRA volunteers who were caught storing the ammunition were arrested. ==What happened after the raid== The raid was not good for the IRA. The massive hunt to find what was stolen turned up all and more. It caused IRA Volunteers to be arrested. The day after the raid the Irish Minister for Justice, Gerald Boland, at an emergency meeting of the Dáil (government) introduced the Emergency Powers bill to allow internment (taking prisoner), Military Tribunal, and executions for IRA members. It became the Emergency Powers Act. ==Related pages== * The Emergency * Irish Republican Army (1922–1969) * Sabotage Campaign (IRA) * Northern Campaign (IRA) ==Footnotes== ==Further information== * Mark M. Hull, Irish Secrets. German Espionage in Wartime Ireland 1939-1945, Dublin:Irish Academic Press, 2003, * Enno Stephan, Spies in Ireland, London, 1963 (reprint) * J Bowyer Bell, The Secret Army - The IRA 1997 - Details of IRA Companies and Vol. involved. * IRA volunteer Liam Brady's recollection of the Christmas Raid and the part he played in it, available here . * Collection of images from the fort Category:1939 in Europe Category:20th century in Dublin Category:Irish Republican Army",
 "title": "Christmas Raid"
}