{
 "id": "298648",
 "text": "Bodmin Moor is a granite moorland in northeastern Cornwall, United Kingdom. It is in size, and originally dates from the Carboniferous period of geological history. Bodmin Moor is one of five granite plutons (underground masses of igneous rock) in Cornwall.Genesis of the Cornubian Batholith (South-West England): the example of the Carnmenellis Pluton | Journal of Petrology | Oxford Academic Charoy, B. (1986) Genesis of the Cornubian Batholith (South West England): the example of the Carnmenellis Pluton in: Journal of Petrology; 1986 Oxford: OUP The name 'Bodmin Moor' is fairly recent, invented in 1813. It was formerly known as Fowey Moor after the River Fowey which rises within it.; p. 72 Since the mid 18th century Bodmin Moor has been crossed by the trunk road now known as the A30. ==Geography== Dramatic granite tors rise from the rolling moorland: the best known are Brown Willy, the highest point in Cornwall at , and Rough Tor at . Considerable areas of the moor are poorly drained and form marshes (in hot summers these can dry out). The rest of the moor is mostly rough pasture or overgrown with heather and other low vegetation. The Moor contains about 500 farm holdings with around 10,000 beef cows, 55,000 breeding ewes and 1,000 horses and ponies. Most of the moor is a Site of Special Scientific Interest (SSSI) and has been officially designated an Area of Outstanding Natural Beauty (AONB), as part of Cornwall AONB. === Rivers and inland waters=== Bodmin Moor is the source of several of Cornwall's rivers: they are mentioned here anti-clockwise from the south. * The River Fowey rises at a height of and flows through Lostwithiel and into the Fowey estuary. * The River Tiddy rises near Pensilva and flows into the River Lynher. * The River Inny rises near Davidstow and flows southeast into the River Tamar. * The River Camel rises on Hendraburnick Down and flows for about before joining the sea at Padstow. * The De Lank River rises near Roughtor and flows into the Camel south of Wenford. * The River Warleggan rises near Temple and flows south to join the Fowey. Inland waters on the moor include Dozmary Pool (Cornwall's only natural inland lake) and three reservoirs, Colliford Lake, Siblyback Lake and Crowdy reservoir which supply water for a large part of the county's population. ==References== Category:Geography of Cornwall",
 "title": "Bodmin Moor"
}