{
 "id": "29894",
 "text": "The Indus River or Indus (from Sanskrit: सिन्धु) is a river in Asia. It flows through Tibet, Kashmir and Pakistan. It is one of the main rivers of the Indo- Gangetic Plain. The river is 3180 km long. It is Pakistan's longest river and is a national symbol The river has a total drainage area exceeding 1,165,000 km2 (450,000 sq mi). Its estimated annual flow stands at around 207 km3 (50 cu mi), making it the twenty-first largest river in the world in terms of annual flow. It discharges about 6,600 cubic meters per second. The word Indus and the related word \"Hindu\" are derived from the Sanskrit word Sindhu.\"Cognate\" means descended from a common ancestor, of the same family, coming from the same stock or root. Shorter Oxford English Dictionary, vol 1, p337. The Ancient Greeks used the word Indós; Hinduš was Old Persian; Sindhu in Sindhi and Sanskrit. Latest languages on the sub-continent use either Sindh (modern Sindhi) or Sindhu or very similar words. The Names \"India\" and \"Indonesia\" are both named after the Indus.Shorter Oxford English Dictionary vol 2, p989. == River basin == The Indus water system of rivers comprises the main Indus and its major tributaries: the Kabul River and Kurram River on the right bank, and the Jhelum River, Chenab River, Ravi River, Beas River and the Sutlej on the left. The first two join the Indus soon after it leaves the mountains, and the others lower down in the plains. The whole of the Beas and the head reaches of the Ravi and Sutlej are in the Republic of India, while those of the Chenab and Jhelum lie mostly in the disputed Kashmir state. The entire basin covers an area of about 384,000 square miles of open land, of which 204,000 lie in Pakistan. In addition, there are about 29,000 square miles which lie outside the Indus basin but are dependent on the Indus river system for their water requirements and irrigation supplies. Without the Indus waters, agriculture in Pakistan would be very uncertain, because there is not much rain. Even now when Pakistan is being rapidly industrialised, it needs its water resources, because much of its industry uses agriculture produce for its raw materials. Almost all of the basin in Pakistan receives an overall rainfull of less than 15 inches, 60% of its area receiving less than 10 inches, while, 16% receives less than 5 inches. The rainfull is not evenly distributed throughout the year but is concentrated during the monsoons. == Course == Rising in western Tibet, the Indus runs at first across a high plateau, then the ground falls away and the river, dropping rapidly, gathering momentum and rushing north-west, collects the waters from innumerable glacier-fed streams, and runs north-west between the world's greatest mountain ranges, the Karakoram and the Himalayas. In Kashmir it crosses the United Nations cease-fire line and, in Baltistan District, enters Azad Kashmir. From here on it is Pakistan's river; Pakistan's first town on the upper Indus, Skardu, at 7,500 feet above sea-level, stands on a bluff near the junction of the Indus and one of its great right-bank tributaries, the Shigar. The majority of the people live in Skardu town; others inhabit small and scattered villages along the Indus and Shigar valleys, or tiny hamlets high on the surrounding mountains. ==See also== *Indus Valley civilization == References == == Other websites == * Blankonthemap The Northern Kashmir WebSite * All About Indus River Pakistan * Bibliography on Water Resources and International Law See Indus River. Peace Palace Libray * Northern Areas Development Gateway * The Mountain Areas Conservancy Project * Indus River watershed map (World Resources Institute) * Indus Treaty * Baglihar Dam issue * Indus * Indus Wildlife Category:Rivers of Pakistan Category:National symbols of Pakistan",
 "title": "Indus River"
}