{
 "id": "299091",
 "text": "Egypt was first at the Olympic Games in 1912. The International Olympic Committee's official abbreviation for Egypt is EGY. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-8-16. ==History== Egypt has sent athletes to most of the Summer Olympic Games since then. Egypt did was not at the 1976 Summer Olympics because of the African boycott. Egypt was at the Winter Olympic Games with a single alpine skier in 1984. Egyptian athletes have won a total of 24 medals. The National Olympic Committee for Egypt was formed in 1910. ==Medalists== Medal Name Games Sport Event 1928 Amsterdam Weightlifting Men's light heavyweight 1928 Amsterdam Wrestling Men's Greco-Roman light heavyweight 1928 Amsterdam Diving Men's 10 m platform 1928 Amsterdam Diving Men's 3 m springboard 1936 Berlin Weightlifting Men's lightweight 1936 Berlin Weightlifting Men's middleweight 1936 Berlin Weightlifting Men's featherweight 1936 Berlin Weightlifting Men's featherweight 1936 Berlin Weightlifting Men's light heavyweight 1948 London Weightlifting Men's featherweight 1948 London Weightlifting Men's lightweight 1948 London Weightlifting Men's lightweight 1948 London Wrestling Men's Greco- Roman bantamweight 1948 London Wrestling Men's Greco-Roman light heavyweight 1952 Helsinki Wrestling Men's Greco-Roman featherweight 1960 Rome Wrestling Men's Greco-Roman flyweight 1960 Rome Boxing Men's flyweight 1984 Los Angeles Judo Men's open 2004 Athens Wrestling Men's Greco-Roman 2004 Athens Boxing Men's super heavyweight 2004 Athens Boxing Men's light heavyweight 2004 Athens Boxing Men's heavyweight 2004 Athens Taekwondo Men's 58 kg 2008 Beijing Judo Men's −90 kg 2012 London Fencing Men's foil 2012 London Wrestling Men's Greco- Roman 84 kg ==Related pages== * List of IOC country codes == References == ==Other websites == * Egypt profile at London2012.com Category:Sport in Egypt Category:Nations at the Olympics",
 "title": "Egypt at the Olympics"
}