{
 "id": "299123",
 "text": "Libya at the Olympics is a history which began in 1956. The International Olympic Committee's official abbreviation for Libya (Libya Jamahiriya) was LYA. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-10-12. It is now LBA.\"Abbreviations, National Olympic Committees,\" 2009 Annual Report, p. 91 [PDF p. 92 of 94]; retrieved 2012-10-12. ==History== A teams from Libya was first at the Olympic Games in 1964. They have been in most Summer Olympic Games since then. The nation boycotted the 1976 Games along with most other African nations, and also boycotted the 1984 Games. Libya has never been in the Winter Olympic Games. As of 2025, no Libyan athlete has ever won an Olympic medal. The National Olympic Committee for Libya was created in 1962 and recognized by the International Olympic Committee in 1963. ==Olympic Medal table== Games Athletes Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Medals Medals Medals Games Athletes Tokyo 1964 1 1 - - - - - - 0 0 0 Mexico City 1968 1 1 - - - - - - 0 0 0 1972 Munich did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete 1976 Montreal did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete 1980 Moscow 32 9 1 22 - - - - 0 0 0 1984 Los Angeles did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete Seoul 1988 1 - - - 4 - - - 0 0 0 Barcelona 1992 1 1 - - - - - - 0 0 0 Atlanta 1996 1 1 - - - - - - 0 0 0 Sydney 2000 1 1 - - - - - - 0 0 0 Athens 2004 8 1 2 - - 1 1 2 0 0 0 Beijing 2008 7 2 2 - 1 1 1 - 0 0 0 ==Related pages== * List of IOC country codes == References == ==Other websites== * Category:Nations at the Olympics Category:Sport in Libya Category:National sports teams of Libya",
 "title": "Libya at the Olympics"
}