{
 "id": "299207",
 "text": "Antichrist is a 2009 supernatural horror movie. It was directed by Lars von Trier. The movie stars Willem Dafoe and Charlotte Gainsbourg. This movie caused serious controversy upon its release in multiple countries during 2009. The movie was not submitted to the MPAA because of fear that it would be rated NC-17 for graphic violence. ==Accolades== Organization Category Recipients and nominees Result Bodil Awards Best Danish Film Lars von Trier Best Actress Charlotte Gainsbourg Best Actor Willem Dafoe Best Director of Photography Anthony Dod Mantle Special Bodil Kristian Eidnes Andersen Robert Award Best Cinematography Anthony Dod Mantle Best Director Lars von Trier Best Editor Anders Refn Best Film Lars von Trier Best Screenplay Lars von Trier Best Sound Kristian Eidnes Andersen Best Special Effects Peter Hjorth Ota Bares Best Actor Willem Dafoe Best Actress Charlotte Gainsbourg Best Costume Design Frauke Firl Best Make-Up Hue Lan Van Duc Best Production Design Karl Júlíusson Nordic Council Nordic Council's Film Prize Lars von Trier European Film Awards Best Cinematographer Anthony Dod Mantle Best Actress Charlotte Gainsbourg Best Director Lars von Trier Chlotrudis Awards Best Actress Charlotte Gainsbourg Best Cinematography Anthony Dod Mantle Sant Jordi Awards Best Foreign Actress (Mejor Actriz Extranjera) Charlotte Gainsbourg Zulu Awards Best Film Lars von Trier ==References== == Other websites == * Category:2009 movies Category:English-language movies Category:2009 horror movies Category:2000s psychological movies Category:Danish horror movies Category:German horror movies Category:French horror movies Category:Italian horror movies Category:Polish movies Category:Polish horror movies Category:Swedish horror movies Category:Movies directed by Lars von Trier Category:Obscenity controversies Category:Movies about grieving Category:Movies about depression Category:Movies set in forests Category:Movies set in Washington (state)",
 "title": "Antichrist (movie)"
}