{
 "id": "299267",
 "text": "Dietmar \"Didi\" Constantini (30 May, 1955 - 18 December, 2024) was an Austrian football player and coach. ==Career== Constantini started playing with FC Wacker Innsbruck. With the team he won the Austrian Championship two times. After one year with LASK Linz, he went to Greece. This was the only time he spent with a squad from abroad. In 1982, he came back to Austria and played with different clubs from the first and second league. After his time with the Wiener Sportclub, he ended his career as player. He played 198 league matches, scoring five goals, winning two Austrian championships, and one Austrian Cup. He played matches for the Austrian Under 18 team and the amateur national team. ==Coaching career== His first experiences as coach was in Saudi-Arabia and for SK Rapid Wien as assistant coach. Then he went to the ÖFB where he became coach of the Under 21 national team and at the same time assistant coach with the national team. After the demotion of head coach Alfred Riedl he did not become coach of the team, so he went on to different clubs in Austria and Germany. (FSV Mainz 05, LASK, Admira Wackerand FC Tirol Innsbruck.) In 1998, he started football camps for children so he could not became coach of a team. He was only caretaker for FK Austria Wien, FC Kärnten and manager of SV Austria Salzburg. He worked in the meantime as expert for the football broadcast of ATV and organized his camps. In 2006/07, he was coach of FC Superfund Pasching. ===Team coach=== On 4 March 2009, Constantini became coach of the Austrian national football team. In the six last qualification matches the team scored 10 points but could not qualify for the 2010 World Cup. In September his contract was prolonged until 2012. Constantini had troubles with some players but he also gave young players a chance to play in the team (Aleksandar Dragović, Yasin Pehlivan, Julian Baumgartlinger or Jakob Jantscher). Austria did not qualify for Euro 2012 and Constantini's contract was not renewed. ==Death== Constantini died on 18 December 2024, at the age of 69, from problems caused by dementia. ==Managerial statistics== Team From To Record Austria 16 October 1991 13 November 1991 Austria 18 November 1992 18 November 1992 LASK Linz 12 March 1993 30 June 1993 Admira Wacker 1 July 1993 30 June 1995 Tirol Innsbruck 1 July 1995 30 June 1997 Mainz 05 16 September 1997 8 April 1998 Austria Wien 22 December 2001 30 June 2002 Kärnten 27 October 2003 18 January 2004 Pasching 7 March 2006 5 June 2006 Pasching 25 October 2006 31 May 2007 Austria Wien 20 March 2008 31 May 2008 Austria 4 March 2009 31 December 2011 Total — ==References== Category:1955 births Category:2024 deaths Category:Deaths from dementia Category:Austria national football team managers Category:Austrian football managers Category:Austrian footballers Category:Sportspeople from Innsbruck Category:LASK managers Category:FK Austria Wien managers Category:LASK players Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Dietmar Constantini"
}