{
 "id": "299338",
 "text": "Canada has been to every Winter Olympic Games and almost every Summer Olympic Games. The International Olympic Committee's official abbreviation for Canada is CAN. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-8-16. ==History== A Canadian team was not at the 1896 Summer Olympics and the boycotted 1980 Summer Olympics. Canada has won at least one medal at every Olympics. The Canadian Olympic Committee (COC) is the National Olympic Committee for Canada. Canada set a gold medals record in a single Winter Olympics during the 2010 Winter Olympics, which they hosted in Vancouver. ==Hosting the Games== Canada has hosted the Games three times. Games Host city Dates Nations Participants Events 1976 Summer Olympics Montreal July 17 – August 1 92 6028 198 1988 Winter Olympics Calgary February 13–28 57 1423 46 2010 Winter Olympics Vancouver February 12–28 83 2629 86 ==Medals== ===Hockey=== Hockey has been Canada's best medal earning sport, along with curling. They have competed at every tournament in both sports. M = Men's W= Women's B = Both Year Players Events Medals Medals Medals Medals Gender that won Year Players Events Gold Silver Bronze Total Gender that won 1920 8 1 1 0 0 1 M 1924 9 1 1 0 0 1 M 1928 12 1 1 0 0 1 M 1932 14 1 1 0 0 1 M 1936 14 1 0 1 0 1 M 1948 18 1 1 0 0 1 M 1952 16 1 1 0 0 1 M 1956 17 1 0 0 1 1 M 1960 17 1 0 1 0 1 M 1964 13 1 0 0 0 0 - 1968 18 1 0 0 1 1 M 1972 18 1 0 0 0 0 - 1976 18 1 0 0 0 0 - 1980 18 1 0 0 0 0 - 1984 20 1 0 0 0 0 - 1988 21 1 0 0 0 0 - 1992 23 1 0 1 0 1 M 1994 21 1 0 1 0 1 M 1998 20 2 0 1 0 1 W 2002 23 2 2 0 0 2 B 2006 22 2 1 0 0 1 W 2010 24 2 2 0 0 2 B Total 26 11 5 2 18 ==Records== In 2008, Equestrian show jumper Ian Millar was at his ninth Summer Olympics, tying the record for most Olympic games participated in set by Austrian sailor Hubert Raudaschl between 1964 and 1996. Millar was selected for ten straight Olympic teams, but was not at the 1980 Summer Olympics. In 2008 Millar won his first medal, a silver medal in the team jumping event. ==Related pages== * List of IOC country codes == References == ==Other websites == * Canada profile at London2012.com * Canadian Medals by Olympic Games * CBC Digital Archives - Gold Medal Athletes - 1948-1968 * CBC Digital Archives - Cold Gold: Canada's Winter Winners 1984–2002 * Most Canadian Olympic Medals Category:Sport in Canada Category:Nations at the Olympics Category:National sports teams of Canada",
 "title": "Canada at the Olympics"
}