{
 "id": "299377",
 "text": "{{Infobox settlement | name = KwaZulu-Natal | official_name = The Province of KwaZulu-Natal | native_name = | settlement_type = Province of South Africa | image_flag = Flag of the KwaZulu-Natal Province.png | motto = Masisukume sakhe (Let us rise and build) | image_map = Map of South Africa with KwaZulu-Natal highlighted.svg | mapsize = | map_alt = Map showing the location of KwaZulu-Natal in the south-eastern part of South Africa | map_caption = Location of KwaZulu-Natal in South Africa | subdivision_type = Country | subdivision_name = | coordinates = | established_title = Natalia Republic | established_date = 12 October 1839 | established_title1 = Colony of Natal | established_date1 = 4 May 1843 | established_title2 = Natal Province | established_date2 = 31 May 1910 | established_title3 = KwaZulu-Natal | established_date3 = 27 April 1994 | seat_type = Capital | seat = Pietermaritzburg | parts_type = Districts | p1 = eThekwini | p2 = Ugu | p3 = Umgungundlovu | p4 = Uthukela | p5 = Umzinyathi | p6 = Amajuba | p7 = Zululand | p8 = Umkhanyakude | p9 = King Cetshwayo | p10 = iLembe | p11 = Harry Gwala | government_footnotes = | government_type = Parliamentary system | leader_party = ANC | leader_title = Premier | leader_name = Sihle Zikalala | area_footnotes = | area_total_km2 = 94361 | area_rank = 7th in South Africa | elevation_max_footnotes = | elevation_max_m = 3451 | elevation_min_footnotes = | elevation_min_m = 0 | population_footnotes = | population_total = 10259230 | population_as_of = 2007 | population_density_km2 = auto | population_est = 10645400 | pop_est_as_of = 2010 | population_rank = 2nd in South Africa | population_density_rank = 2nd in South Africa | population_demonym = Natalian | population_note = | demographics_type1 = Population groups | demographics1_footnotes = | demographics1_title1 = Black African | demographics1_info1 = 86.0% | demographics1_title2 = Indian or Asian | demographics1_info2 = 8.1% | demographics1_title3 = White | demographics1_info3 = 4.4% | demographics1_title4 = Coloured | demographics1_info4 = 1.4% | demographics_type2 = Languages | demographics2_footnotes = | demographics2_title1 = Zulu | demographics2_info1 = 80.0% | demographics2_title2 = English | demographics2_info2 = 13.4% | demographics2_title3 = Xhosa | demographics2_info3 = 3.5% | demographics2_title4 = Afrikaans | demographics2_info4 = 1.5% | timezone1 = SAST | utc_offset1 = +2 | iso_code = ZA-NL | website = www.kwazulunatal.gov.za | footnotes = }} KwaZulu-Natal (, also called KZN or Natal) is a province in South Africa. Before 1994, KwaZulu-Natal was made up of the province of Natal and the KwaZulu homeland. ==Background== In the 1830s, the northern part of KwaZulu-Natal was part of the Zulu Kingdom. The southern part of KwaZulu-Natal was a Boer republic called Natalia (1839-1843). In 1843, Natalia became a British colony. Zululand remained independent until 1879. Today KwaZulu-Natal is the traditional home of the Zulu nation. It is called the \"garden province.\" Two natural areas, the iSimangaliso Wetland Park and the uKhahlamba Drakensberg Park, have been declared UNESCO World Heritage Sites. KwaZulu-Natal is located to the east of South Africa. It borders the Indian Ocean as well as three other provinces, and the countries of Mozambique, Eswatini, and Lesotho. Its capital is Pietermaritzburg and its largest city is Durban. == Geography == KwaZulu-Natal is about in area, making it about the same size as Portugal. The province has three different geographic areas. The lowland region lies along the Indian Ocean coast. It is very narrow in the south and widens in the northern part of the province. The central region is called the Natal Midlands. The midlands are hilly plateaus that rise toward the west. The third region is mountainous. The two mountain ranges are the Drakensberg Mountains in the west and the Lebombo Mountains in the north. The Drakensberg mountains are basalt cliffs that rise near Lesotho. The Lebombo Mountains are ancient granite mountains that run south from Swaziland. The Tugela River flows west to east across the center of the province and is the region's largest river. The coastal areas have dense stands of subtropical trees and shrubs and deep ravines. Afromontane Forest grows on the steep sides of the ravines. The midlands have moist (wet) grasslands and small pockets of Afromontane Forest. The north is mostly wet savanna. The Drakensberg region is alpine grassland. == HIV == One of the biggest problems in the province is HIV infection. South Africa has more HIV-positive citizens than any other country in the world. KwaZulu-Natal has the highest rate of HIV infection of all of the provinces. According to UNAIDS in 2009, the infection rate is 39%. Many people die from complications from AIDS. Infected people in KwaZulu-Natal do not have the health care, medicine, and proper food they need to stay healthy. HIV/AIDS has slowed economic growth by destroying human capital, the ability of people to make money in society. == Sport == === Events === * Comrades Marathon – A yearly marathon run between Pietermaritzburg and Durban. * Midmar Mile – A mile-long swimming race held yearly at Midmar Dam * Dusi Canoe Marathon – A yearly canoe marathon, starting in Pietermaritzburg and ending in Durban. * Durban July – South Africa's premier annual horse racing event at Greyville Racecourse in Durban. * Mr Price Pro – a premier international surfing event at Durban during winter. It used to be known as the Gunston 500. === KwaZulu-Natal sports teams === * Football ** Premier Soccer League (PSL), with the following teams from KwaZulu-Natal: *** AmaZulu and Golden Arrows, from Durban *** Thanda Royal Zulu from Richards Bay *** Maritzburg United, from Pietermaritzburg * Rugby union ** The Sharks, who compete in the Super Rugby competition with four other South African teams, five teams from Australia, and five teams from New Zealand ** Natal Sharks (different from the Super Rugby team), who compete in South Africa's domestic competition, the Currie Cup ==References== == Other websites == * KwaZulu-Natal Provincial Government * KwaZulu-Natal Tourism Authority * Ezemvelo KZN Wildlife",
 "title": "KwaZulu-Natal"
}