{
 "id": "299406",
 "text": "Yash Raj Chopra (, 27 September 1932 – 21 October, 2012) is an Indian filmmaker, screenwriter, and a highly successful Bollywood producer. Some of his successful movies are : Waqt , Deewaar, Kabhi Kabhie, Silsila, Lamhe, Chandni, Darr, Dil To Pagal Hai, and Veer-Zaara.Veer-Zaara yashrajfilms.com He is also the founder of Yash Raj Films. ==BR Chopra Mahabharat Awards== The Mahabharat (1988 TV series) was nominated and won the Uptron Awards 1988 in many categories Year Award Category Recipient Result 1988 Uptron Awards Best Director Ravi Chopra Best Mythological Series BR Studios Uptron Awards Best Actor in a leading role Pankaj Dheer Best Supporting Actor Mukesh Khanna Best Supporting Actor Nitish Bharadwaj Uptron Awards Best Actress Roopa Ganguly Uptron Awards Best Supporting Actress Nazneen Uptron Awards Other nominees Puneet Issar; Gufi Paintal; Surendra Pal The other nominees included the other supporting cast of the show such as Shakuni, Drona etc who were praised for their work in the Award ceremony. ==About== Yash Chopra is undoubtedly India's most successful filmmaker. With a career spanning over five decades, he has been associated with almost 35 films, most of which have created box-office history. He started out as an assistant to his brother and went on to direct 5 very successful films for his brother’s banner - B.R.Films. These were Dhool Ka Phool (1959), Dharmputra (1961), Waqt (1965), Ittefaq (1969) & Aadmi Aur Insaan (1969). He has wielded the baton, additionally, for 4 films made by other film companies - Joshila (1973), Deewaar (1975), Trishul (1978) & Parampara (1993). But his greatest repertoire of work has been around 30 films made under the auspices of his own company, YASH RAJ FILMS. Out of these, he has directed 12 films himself, while the others have been directed by younger directors – under his supervision and administrative acumen as one of India’s greatest producers. ==Career== Yash worked as an assistant for I. S. Chopra and later he was working for his brother, who was also in the movie industry, Baldev R. Chopra. Baldev provided Yash an opportunity to direct his first movie which was named as Dhool Ka Phool and was released in 1959. Yash later set up his own company under the name Yash Raj Films and the first movie to be released under this company was Daag in 1973. Yash has produced more than 45 movies and has directed more than 20 movies, thus making him one of the most successful filmmaker/producer in India. ==Awards== ===Filmfare Awards=== Years Category Films Results 1965 Filmfare Best Director Award, Waqt 1969, Ittefaq 1973, Daag 1975 Deewar 1991 Filmfare Best Movie Award Lamhe 1995 Dilwale Dulhania Le Jayenge 1997 Dil To Pagal Hai 2004 Veer-Zaara 2006 Filmfare Power Award 2007 2008 ===National Film Awards=== Years Category Films Results 1990 Best Popular Film Chandni 1994 Darr' 1996 Dilwale Dulhania Le Jayenge' 1998 Dil To Pagal Hai' 2005 Veer-Zaara' ==References== ==Other websites== * *Yash Chopra at timesofindia.com *Yash Chopra at ApunkaChoice.com Category:Indian movie directors Category:Deaths from multiple organ failure Category:1932 births Category:2012 deaths",
 "title": "Yash Chopra"
}