{
 "id": "299419",
 "text": "This list of Manhattan neighborhoods has all areas in the Manhattan borough of New York City (U.S.). The list is arranged, by neighborhood location, from north to south on the island (use browser \"find\" button to search for a name). Please note the following general definitions: *Uptown Manhattan refers to the area above 59th Street; Upper Manhattan refers to the area above 96th Street. *Downtown Manhattan refers to the area below 14th Street; Lower Manhattan refers to the area below Chambers Street. *Midtown Manhattan refers to the area between 34th Street and 59th Street. *East Side refers to the area east of Fifth Avenue. *West Side refers to the area west of Fifth Avenue. Neighborhood names and boundaries are not officially defined. They may change, from time to time. ==Uptown Neighborhoods== Name of the Neighborhood Limits South to North and East to West Upper Manhattan above 95th St Marble Hill physically located on the mainland Inwood above Dyckman St Fort George Between Nagel Ave, Dyckman St and 192nd, includes Broadway South to Fairview Avenue Washington Heights W155 (once 125) to Dyckman St Hudson Heights (Part of Washington Heights) W173 to Fort Tryon Park; Broadway to the Hudson River West Harlem W125-155; Saint Nicholas Avenue to the Hudson River Hamilton Heights (West Harlem) W135-155; St. Nick to the Hudson River Manhattanville (West Harlem) W125-135; St. Nick to the Hudson River ViVa, Viaduct Valley W125-132; the Hudson River Morningside Heights, SoHa (or \"South of Harlem\") W96-125; Columbus to Riverside Drive Central Harlem E110-155; Park Avenue to St. Nick Harlem E96-141 (east), W110-155 (central), W125-155 (west) Strivers' Row (Central Harlem) W137-138; 7th-8th Avenue Astor Row (Central Harlem) centered at W130 Sugar Hill (Central Harlem) W125-155; Edgecombe Avenue to Amsterdam Ave. Marcus Garvey Park, Mount Morris Historical District E120-124; Madison Avenue to Fifth Avenue Le Petit Senegal (Little Senegal) W. 116; East of Morningside Park, rapidly growing neighborhood East Harlem E96-141; East River to 5th Spanish Harlem northeast of Central Park; E96-130; East River to 5th Upper East Side, Lenox Hill, Silk Stocking District E59-96; East River to 5th (and E96-110 along 5th) Carnegie Hill E86-98; 3rd to 5th (centered at E91 and Park) Yorkville E79-96; the river to 3rd (centered at E86 and 3rd) Upper West Side W59-110; Central Park W to the Hudson River Manhattan Valley, Bloomingdale District W96-110; Eighth Avenue to Broadway (Manhattan) Lincoln Square (once San Juan Hill, Manhattan) W65-66; Ninth Avenue to Broadway ==Midtown Neighborhoods== Name of the Neighborhood Limits South to North and East to West Midtown Manhattan 34th to 59th St Columbus Circle W59 and 8th Avenue Sutton Place E53-59 and Sutton Pl Rockefeller Center, Radio City W49-51 and 5th to 6th Diamond District W47 and 5th to 6th Theater District W42-53 and 6th to 8th Turtle Bay E42-53 and East River to Lex Midtown East 42-59 and East River to 5th Midtown 40-59 and 3rd to 9th Tudor City E40-43 and 1st Avenue to 2nd Little Brazil W46 and 5th to 6th Times Square W39-52 and 7th-9th Avenue Hudson Yards W28-43 and 7th to the Hudson River Midtown West W34-59 and 5th to Hudson River Hell's Kitchen, Clinton W34-57 (59) and 8th to the Hudson River Garment District W34-42 and 5th to 9th Herald Square W34 and 6th Avenue Koreatown W31-36 and 5th to 6th Murray Hill E29-42 and 2nd to 5th Tenderloin W23-42 and 5th to 7th Madison Square W23-26 and 5th to Broadway ==Neighborhoods between Midtown and Downtown== Name of the Neighborhood Limits South to North and East to West Flower District W26-28 and 6th Brookdale E25th and 1st to FDR Kips Bay E23-34 and the river to 3rd Rose Hill E25-30 and 3rd to Madison NoMad W25-30 and Lex to 6th Peter Cooper Village† (former Gas House district) E20-23 and C to 1st Chelsea W14-34 and 6th to the river Flatiron District, Toy District, Photo District E&W16-27; and Park Avenue South to 6th Gramercy Park E14-23 and 1st to Park Avenue So. Stuyvesant Square E15-E18 and 1st to 3rd Union Square E14-17 and 4th to University Pl Stuyvesant Town† (former Gas House district) E14-20 and C to 1st Meatpacking District Gansevoort to W15th and Hudson to the river Waterside Plaza E25-29th and FDR Drive †Large scale developments ==Downtown Neighborhoods== Name of the Neighborhood Limits South to North and East to West Downtown Manhattan below 14th Street Little Germany (historic) E7-10 and A to B Alphabet City, Loisaida Houston to E23rd (14th) and FDR to A East Village Houston to E14th and the East River to Bowery Greenwich Village, the Village Houston to W14th and Broadway to the Hudson River NoHo Houston to Astor and Bowery to Broadway Bowery Canal to E4 and Allen to Bowery West Village Houston to W14th and 6th to the river Lower East Side Canal to Houston and the river to Bowery SoHo Canal to Houston and Lafayette to Varick Nolita (NoLIta) Broome to Houston and Bowery to Lafayette Little Italy Canal to Broome along Mulberry Chinatown Chambers to Delancey and East Broadway to Broadway Lower Manhattan, Financial District below Chambers Five Points (historic) Worth & Baxter Cooperative Village† Frankfort to Grand and FDR to E B-way Two Bridges Brooklyn Bridge to Montgomery, St. James Pl to the river TriBeCa Park Pl to Canal and Broadway to the Hudson River Civic Center Vesey to Chambers and the East River to Broadway Radio Row (historic) Cortlandt to Dey and Greenwich St (WTC) South Street Seaport Historical District south of Fulton and along FDR Battery Park City† west of West Street †Large scale developments ==Islands== *Roosevelt Island *Liberty Island *Ellis Island *Governors Island *Randall's Island *Wards Island ==Related pages== *List of Brooklyn neighborhoods *List of Bronx neighborhoods *List of Queens neighborhoods *List of Staten Island neighborhoods ==Other websites== *Neighborhood Map from NYC Department of City Planning neighborhoods Category:New York (state)-related lists Category:Neighborhoods of New York City",
 "title": "List of Manhattan neighborhoods"
}