{
 "id": "299692",
 "text": "Cornish dialect, also called Anglo-Cornish dialect, is the dialect of English that is spoken in Cornwall, in south-western Great Britain. == History == A long time ago, people in Cornwall spoke Cornish, a language that is similar to Welsh and Breton. After a while, people speaking English came to Cornwall, and the Cornish people started to learn English. They did not speak in exactly the same way but spoke in a distinct way, the Cornish dialect. Eventually, people had forgotten how to speak Cornish by about 1800. == International use == Cornish people also spoke Cornish dialect when they went abroad to Australia, North America and other places. == Geography == The Cornish dialect changes between the west and the east of Cornwall. In the latter, it is more like how people in Devon speak. == Differences from Standard English == Sometimes, Cornish people use different words from those who speak Standard English or say words in a different order when they speak Cornish dialect from when they speak Standard English. There is a difference in grammar between Cornish dialect and Standard English. Other times, they pronounce words differently by using different vowel sounds from Standard English. == Decline == When Cornish people started to go to school in the late 19th century, teachers told them to speak Standard English, not dialect. Many people thought that those who spoke the dialect were not less intelligent and educated than those who spoke Standard English and so people spoke the dialect less often, and the dialect declined. In the 20th century, many people moved into Cornwall from the South- East of England, near London. People there did not speak the dialect and found it hard to understand thopse who spoke it. That made the Cornish people speak the dialect less to become understood. ==Preservation== As fewer people spoke the Cornish dialect, other people, such as people in the Old Cornwall Society, wrote the dialect down and made audio recordings to prevent the dialect from being lost. People have written books, short stories, and poetry in Cornish dialect. ==References== ==Further reading== * M. A. Courtney; T. Q. Couch: Glossary of Words in Use in Cornwall. West Cornwall, by M. A. Courtney; East Cornwall, by T. Q. Couch. London: published for the English Dialect Society, by Trübner & Co., 1880 *Pol Hodge: The Cornish Dialect and the Cornish Language. 19 p. Gwinear: Kesva an Taves Kernewek, 1997 *David J. North & Adam Sharpe: A Word-geography of Cornwall. Redruth: Institute of Cornish Studies, 1980 (includes word-maps of Cornish words) *Martyn F. Wakelin: Language and History in Cornwall. Leicester University Press, 1975 (based on the author's thesis, University of Leeds, 1969) ==Other websites== *Old Cornwall Society dialect webpages Category:Cornwall Category:British English",
 "title": "Cornish dialect"
}