{
 "id": "299653",
 "text": "Venda, also called or , is a Bantu language and an official language of South Africa. Most Venda speakers live in South Africa, but some speakers live in Zimbabwe. The Venda language is very similar to the Shona and Pedi languages, which is spoken in South Africa and Zimbabwe. During the Apartheid era of South Africa, Venda speakers lived in the bantustan of Venda. Venda is a language in the Bantu branch of the Niger-Congo language family. Venda is spoken by about 666,000 people in the northern part of South Africa's Limpopo Province. Around 84,000 people in Zimbabwe also speak the language. == Writing == The Venda language uses the Latin alphabet. It has five (5) extra accented letters. Four consonants have a circumflex below the letter (ḓ, ḽ, ṋ, ṱ) and one consonant has an overdot (ṅ). The Venda alphabet A a B b D d Ḓ ḓ E e F f G g H h I i K k L l Ḽ ḽ M m N n Ṋ ṋ Ṅ ṅ O o P p R r S s T t Ṱ ṱ U u V v W w X x Y y Z z The letters C, J, and Q are used when writing foreign words and names. letter(s) value(s) in IPA notes a b bv bw or Varies by dialect d dz dzh Like the English \"j\" dzw ḓ e , f fh g h , Pronounced before e. hw i k kh khw l ḽ m , M is syllabic, , when the next syllable begins with m. n , N is syllabic, when the next syllable begins with n. ng ny nz ṋ ṅ ṅw o , p ph pf pfh r s sh sw t th ts tsh tsw ty ṱ ṱh u v vh w x Like the ch in Scottish 'loch.' y z zh zw === Unicode === The extra letters have these Unicode names * U+1E12 LATIN CAPITAL LETTER D WITH CIRCUMFLEX BELOW * U+1E13 LATIN SMALL LETTER D WITH CIRCUMFLEX BELOW * U+1E3C LATIN CAPITAL LETTER L WITH CIRCUMFLEX BELOW * U+1E3D LATIN SMALL LETTER L WITH CIRCUMFLEX BELOW * U+1E44 LATIN CAPITAL LETTER N WITH DOT ABOVE * U+1E45 LATIN SMALL LETTER N WITH DOT ABOVE * U+1E4A LATIN CAPITAL LETTER N WITH CIRCUMFLEX BELOW * U+1E4B LATIN SMALL LETTER N WITH CIRCUMFLEX BELOW * U+1E70 LATIN CAPITAL LETTER T WITH CIRCUMFLEX BELOW * U+1E71 LATIN SMALL LETTER T WITH CIRCUMFLEX BELOW == References == == Other websites == *Ethnologue entry for Venda *Tshivenda - South African Languages *Batho Portal Welcome page in Venda *PanAfrican L10n page on Venda === Computer programs === * Spell checker for OpenOffice.org and Mozilla , OpenOffice.org , Mozilla Firefox web-browser , and Mozilla Thunderbird email program in Venda * Translate.org.za Project to translate Free and Open Source Software into all the official languages of South Africa including Venda * Keyboard with extra venda characters Category:Languages of South Africa Category:Languages of Zimbabwe Category:Bantu languages",
 "title": "Venda language"
}