{
 "id": "299705",
 "text": "Citroën is automobile manufacturer based in France. André-Gustave Citroën started the company in 1919 and it became the first mass-production automobile company outside the USA. Citroën was the first to create a sales and services network that goes with the automobile. 1919 == Innovations == Citroën were innovators in automobile design. Their Traction Avant (pictured) had the first mass production of three revolutionary features that are still in use today. They are: a unitary body with no separate frame, four-wheel independent suspension, and front-wheel drive. Later on, in the 1950s, Citroën developed a remarkable type of suspension. A high-pressure hydraulic system was used in over 9 million Citroën cars. They included the DS, SM, GS, CX, BX, XM, Xantia, C5, and C6. Self-levelling is the principal benefit – the car kept a constant ride height above the road. It adjusted to the passenger and cargo load, and gave a very soft suspension. This type of suspension smooths out road irregularities without disturbing the occupants.http://www.autotraderclassics.com/car- article/Topless+Goddess+_+Citroen+DS+Décapotable-44136.xhtml It is often compared to riding on a 'magic carpet' for this reason. ==Models== ===Citroën=== File:Citroën C3 - 2016 (18).jpg|Citroën C3 III File:2019 Citroen C3 Aircross Flair Puretech 1.2 Front.jpg|Citroën C3 Aircross II File:Citroen C4 (2020) IMG 4202.jpg|Citroën C4 File:Citroen C5 X PHEV 1X7A0152.jpg|Citroën C5 X File:Citroen C5 Aircross, Paris Motor Show 2018, IMG 0197.jpg|Citroën C5 Aircross File:Citroen Berlingo, Paris Motor Show 2018, IMG 0700.jpg|Citroën Berlingo File:2017 Citroen Dispatch 1400 2.0 Front.jpg|Citroën Jumpy ===DS line=== File:DS3 Crossback E-Tense, Paris Motor Show 2018, IMG 0697.jpg|DS 3 File:DS 4 E-Tense (2021) Auto Zuerich 2021 IMG 0542.jpg|DS 4 File:DS, Paris Motor Show 2018, Paris (1Y7A1419).jpg|DS 7 File:DS_9_E-Tense_Auto_Zuerich_2021_IMG_0396.jpg|DS 9 ===Dongfeng Peugeot- Citroën (joint venture)=== File:Citroen C5X 001.jpg|Citroën C5 X File:C5aircross.jpg|Citroën C5 Aircross == References == Category:Automobile brands Category:1919 establishments in France Category:Stellantis",
 "title": "Citroën"
}