{
 "id": "299781",
 "text": "Dietmar \"Didi\" Kühbauer (born 4 April 1971) is a former Austrian footballer. He played as a midfielder. Kühbauer played in the Austrian national football team. ==Career== He made his Bundesliga debut for Admira Wacker in 1987 at the age of 16. In 1992 he went on to SK Rapid Wien. With this club he won one champions' title and one Austrian cup. With Rapid he also played in the 1996 UEFA Cup Winners Cup Final against Paris St. Germain in Brussels. By the fans of SK Rapid he was elected into Rapid's team of the century. He played abroad for five years, three years for Real Sociedad in Spain and two years in the German Bundesliga for VfL Wolfsburg. Then he came back to Austria and played the last years of his career for his youth team SV Mattersburg. Dietmar Kühbauer played 55 matches for the Austrian national football team and scored 5 goals. His debut was in May 1992 in a friendly match versus Poland. He was a member of the Austrian team for the FIFA World Cup 1998 and played two matches, versus Italy and Chile. His final match was in September 2005 also against Poland in a qualifying match for the FIFA World Cup 2006. ==Coaching career== He started as coach of the second team of VfB Admira Wacker Mödling. In 2010 he became manager of the first squad which reached the title in the First league and was promoted to the Austrian Bundesliga. In his first year he reached the 3rd place. Then he went on to the Bundesliga team Wolfsberger AC. In his first season he reached fifth place. The next season Wolfsberg was after 16 rounds the last team in the table and the contract was dissolved. 2018 he became coach of SKN St. Pölten after the half of the season he went on to SK Rapid Wien where he was also player. In 2021 his contract was dissolved. In 2022 he became head coach of LASK. After just one season the contract was dissolved in June 2023 due to differences of opinion. ==Honours== ===Player=== *Austrian Football Bundesliga (1): ** 1996 *Austrian Cup (1): ** 1995 *UEFA Cup Winners Cup Final ** 1996 * Member of the Austrian Squad FIFA World Cup: **1998 * Rapid-Team of the century ===Coach=== *Austrian Football First League : **2011 *Austrian Cup : **2025 ==References== == Other websites == *Dietmar Kühbauer Rapid Archiv Category:1971 births Category:Austrian footballers Category:Players of the Austrian national football team Category:Austrian football managers Category:Living people Category:SK Rapid Wien managers Category:FC Admira Wacker Mödling managers Category:Wolfsberger AC managers Category:LASK managers Category:Austrian football champions Category:Austrian football midfielders",
 "title": "Dietmar Kühbauer"
}