{
 "id": "300069",
 "text": "The Great White Spot, also known as Great White Oval, on Saturn, is a name given to storms that are large enough to be seen by telescope from Earth. The spots appear to be white, and the name was based on Jupiter's Great Red Spot. The spots can be several thousands of kilometers wide. Currently, a large band of white clouds called the Northern Electrostatic Disturbance (because of an increase in radio and plasma interference) has covered Saturn since 2010, and the Cassini orbiter is tracking the storm. Cassini information shows a loss of acetylene in the white clouds, an increase of phosphine, and an unusual temperature drop in the center of the storm. In April 2011, the storm had a second eruption. Scientists believe the white spots are made from ammonia ice pushed up by warmer gas through the tops of the planet's clouds. ==Occurrence== The spots happen every 28.5 Earth years. This is the solstice when Saturn's northern hemisphere tilts most toward the Sun. The following is a list of recorded sightings; years with spots that are part of the cycle are 1876, 1903, 1933, 1960, and 1990. * 1876 – Seen by Asaph Hall. He used the white spots to calculate the planet's period of rotation. * 1903 – Seen by Edward Barnard. * 1933 – Seen by Will Hay, comic actor and amateur astronomer. * 1960 – Seen by J.H. Botham (South Africa). * 1990 – Seen by Stuart Wilber, from 24 September through November. * 1994 – Seen from Earth and the Hubble Space Telescope. * 2006 – Observed by Erick Bondoux and Jean-Luc Dauvergne. * 2010 - First observed by Anthony Wesley. Why there were no spots recorded before 1876 is a mystery. It is like the break in sightings of the Great Red Spot in the 18th and early 19th centuries. The 1876 Great White Spot was very large, and could be seen even with small telescopes. Was the earlier record simply poor, or was the 1876 GWS truly a first for the telescopic era? Some believe that neither scenario is likely.Patrick Moore, ed., The 1993 Yearbook of Astronomy, Mark Kidger, \"The 1990 Great White Spot of Saturn\", (London: W.W. Norton & Company, 1992), 176-215 Mark Kidger has described three important Great White Spot patterns: #The Great White Spots alternate in latitude. One will be seen in the North Temperate Zone (NTZ) or higher, and the next one only seen in the Equatorial Zone (EZ). For example, the 1960 Great White Spot was in the NTZ, and in 1990 it was in the EZ. #The NTZ Great White Spots happen at shorter intervals than the EZ Great White Spots ( Every 27 years versus every 30 years). #The NTZ Great White Spots are much harder to see than the EZ spots. Kidger predicts that the next Great White Spot will happen in the NTZ in 2016, and will probably be less spectacular than the 1990 Great White Spot. ==Characteristics == A \"classic\" Great White Spot is a spectacular event. Very bright white storms light up Saturn's usually dull atmosphere. All the major ones have happened in the planet's northern hemisphere. They usually begin as separate \"spots\", but then rapidly get bigger in longitude, as the 1933 and 1990 Great White Spots did. In 1990 the Great White Spot grew to circle the whole planet. ==References== * 2006: observed with a 12\" telescope by amateurs near Paris. * Volunteers Help NASA Track Return of the Dragon * ==Other websites== *The Great White Spot at ESA/Hubble *Christopher Go's Saturn Website Pictures of Saturn's Northern Electrostatic Disturbance (2011) Category:Saturn",
 "title": "Great White Spot"
}