{
 "id": "300013",
 "text": "In evolutionary biology, a group of organisms have common descent if they have a common ancestor. There is strong support for the theory that all living organisms on Earth are descended from a common ancestor. Charles Darwin proposed the theory of universal common descent through an evolutionary process in On the Origin of Species, saying, \"There is a grandeur in this view of life, with its several powers, having been originally breathed into a few forms or into one\".Darwin, Charles; Costa, James T. 2009. The Annotated Origin: a facsimile of the first edition of On the Origin of Species, annotated by James T. Costa. Cambridge, Massachusetts: Belknap Press of Harvard University. p490 The last universal ancestor (LUA) (or last universal common ancestor, LUCA), is the most recent common ancestor of all currently living organisms. It is believed to have appeared about 3.9 billion years ago. == History == In the 1740s, Pierre-Louis Maupertuis made the first known suggestion that all organisms may have had a common ancestor, and that they had diverged through random variation and struggle for existence.J.S. Bromley 1970. The new Cambridge modern history: The rise of Great Britain and Russia, 1688-1715/25 CUP Archive. , pgs. 62-63.Geoffrey Russell Richards Treasure 1985. The making of modern Europe, 1648-1780, Taylor & Francis p142 In Essai de Cosmologie, Maupertuis noted: > Could one not say that, in the fortuitous combinations of the productions of > nature, as there must be some characterized by a certain relation of fitness > which are able to subsist, it is not to be wondered at that this fitness is > present in all the species that are currently in existence? Chance, one > would say, produced an innumerable multitude of individuals; a small number > found themselves constructed in such a manner that the parts of the animal > were able to satisfy its needs; in another infinitely greater number, there > was neither fitness nor order: all of these latter have perished... The > species we see today are but the smallest part of what blind destiny has > produced...C. Leon Harris 1981. Evolution, genesis and revelations, with > readings from Empedocles to Wilson, SUNY Press. p107 == Evidence of universal common descent == === Common biochemistry and genetic code === All known forms of life are based on the same fundamental biochemical organisation. Genetic information is encoded in DNA, and transcribed into RNA, then translated into proteins by (highly similar) ribosomes, with ATP, NADH and others as energy sources, etc. The similarities include the energy carrier adenosine triphosphate (ATP), and the fact that all amino acids found in proteins are left-handed (chirality). Furthermore, the genetic code (the \"translation table\" according to which DNA information is translated into proteins) is nearly identical for all known lifeforms, from bacteria to humans. The universality of this code is generally regarded by biologists as definitive evidence in favor of the theory of universal common descent. Analysis of the small differences in the genetic code has also provided support for universal common descent. A statistical comparison of various alternative hypotheses has shown that universal common ancestry is significantly more probable than models involving multiple origins. ===Phylogenetic trees=== Another important piece of evidence is that it is possible to construct detailed phylogenetic trees (that is, \"genealogic trees\" of species) mapping out the proposed divisions and common ancestors of all living species. In 2010 an analysis of available genetic data, mapping them to phylogenetic trees, gave \"firm quantitative support for the unity of life. ...there is now strong quantitative support, by a formal test, for the unity of life. Traditionally, these trees have been built using morphological methods, such as comparative anatomy, embryology, etc. Recently, it has been possible to construct these trees using molecular data, based on similarities and differences between genetic and protein sequences. All these methods produce essentially similar results. That phylogenetic trees based on different types of information agree with each other is strong evidence of an underlying common descent. == Last universal common ancestor == Some things are deduced about LUCA or LUA. It was not the very first cell, but one whose descendants survived beyond the very early stages of microbial evolution. On the basis of their presence in eubacteria, archaea, and eukaryotes, about 325 proteins were present in the LUCA.Brooks, Dawn J. et al 2002. Evolution of amino acid frequencies in proteins over deep time: inferred order of introduction of amino acids into the genetic code. Molecular Biology and Evolution 19, 1645-1655. Kyrpides N; Overbeek R. & Ouzounis C. 1999 Universal protein families and the functional content of the last universal common ancestor. J. Mol. Evol 49:413-423 These amino acids were probably the first to be built into proteins: alanine, asparagine, aspartic acid, glycine, histidine, isoleucine, serine, threonine, and valine. These amino acids were also found in spark tube simulations,Miller S.L. 1953. Production of amino acids under possible primitive earth conditions. Science 117:528-529. and analysis of the Murchison meteorite.Kvenvolden K. et al 1970 Evidence for extraterrestrial amino-acids and hydrocarbons in the Murchison meteorite Nature 228:923. The other amino acids, later additions to the genetic code, include several of the most complex amino acids. Studies from 2000 to 2018 have suggested an increasingly ancient time for LUCA. In 2000, estimations suggested LUCA existed 3.5 to 3.8 billion years ago in the Paleoarchean era, a few hundred million years before the earliest fossil evidence of life, for which there are several candidates ranging in age from 3.48 to 4.28 billion years ago. A 2018 study from the University of Bristol, using a molecular clock model, puts the LUCA shortly after 4.5 billion years ago, in the Hadean era. == Related pages == *Earliest known life forms *Origin of life == References == Category:Evolutionary biology",
 "title": "Common descent"
}