{
 "id": "300180",
 "text": "Like all organisms, plants have cells. Plant cells have a nucleus with chromosomes and DNA, and they have mitochondria. Those are common to all eukaryotic cells. But in some ways they are different from animal cells and the cells of other eukaryotes. * They have cell walls composed of cellulose and some other compounds. Pectin, and sometimes lignin, is secreted on the outside of the cell membrane. This is different from the cell walls of fungi (which are made of chitin), and of bacteria (which are made of peptidoglycan). The cell wall gives the cell a definite shape. * There are special cell-to- cell communication pathways known as plasmodesmata.Oparka K.J. 1993. Signalling via plasmodesmata - the neglected pathway. Seminars in Cell Biology 4, 131–138. These are pores in the cell wall through which the cell content of adjacent cells (including endoplasmic reticulum) are continuous.Hepler P.K. 1982. Endoplasmic reticulum in the formation of the cell plate and plasmodesmata. Protoplasma 111, 121–133. * They have plastids. The most notable are the chloroplasts, which contain chlorophyll. This green-colored pigment absorbs sunlight, and allows the plant to make its own food by photosynthesis. Other types of plastids are the amyloplasts, which store starch, elaioplasts for fat storage, and chromoplasts for making and storing pigments. Like mitochondria, plastids have their own genomes of about 100–120 unique genes.L. Cui et al 2006. ChloroplastDB: the chloroplast genome database. Nucleic Acids Research, 34, D692-696. It is thought they started as prokaryotic endosymbionts living in the cells of an early eukaryotic ancestor of the land plants and algae.L. Margulis 1970. Origin of eukaryotic cells. Yale University Press, New Haven. * They have a large central vacuole, a water-filled volume enclosed by a membrane.Raven J.A. 1997. The vacuole: a cost-benefit analysis. Advances in Botanical Research 25, 59–86.Leigh R.A.& Sanders D. 1997. The plant vacuole. In Advances in Botanical Research 25: Academic Press. The vacuole keeps the cell's turgor (stiffness), controls movement of molecules between the cytosol and sap, stores useful material and digests waste proteins and organelles. * Cell division by construction of a 'cell plate' late in cytokinesis is characteristic of land plants and a few groups of algae.Lewis L.A. & McCourt R.M. 2004. Green algae and the origin of land plants. American Journal of Botany 91, 1535–1556.López-Bautista J.M; Waters D.A. and Chapman R.L. 2003. Phragmoplastin, green algae and the evolution of cytokinesis. International Journal of Systematic and Evolutionary Microbiology 53, 1715–1718. * The sperm of bryophytes and pteridophytes, cycads and Ginkgo have flagella similar to those in animals.Silflow C.D. and Lefebvre P.A. 2001 Assembly and motility of eukaryotic cilia and flagella. Lessons from Chlamydomonas reinhardtii. Plant Physiology 127, 1500–1507.Manton I. and Clarke B. 1952. An electron microscope study of the spermatozoid of Sphagnum. Journal of Experimental Botany 3, 265–275.Paolillo D.J. Jr. 1967. On the structure of the axoneme in flagella of Polytrichum juniperinum. Transactions of the American Microscopical Society, 86, 428–433. However, higher plants (including gymnosperms and flowering plants) lack the flagella and centrioles that are present in animal cells.Raven P.H; Evert R.F. & Eichhorm S.E. 1999. Biology of plants. 6th ed, W.H. Freeman, New York. == References == Category:Cells Category:Plant anatomy",
 "title": "Plant cell"
}