{
 "id": "300334",
 "text": "A vector in biology is an intermediary organism that faciliates transmission of a smaller living species from one host to another. The vector gets no benefit due to the transport being passive and sometimes loses fitness by the arrangement. The term is most used for the transport of parasites and pathogens-- causative agents of infection or disease. Familiar examples of vectors include, mosquitoes acting as vectors that carry deadly diseases, such as malaria and dengue fever. Ticks are a popular example that vector Lyme disease. The study of vectors gives us knowledge about the life cycle of parasitic diseases. Valuable insight on disease control strategies can be gained by studying the vector bheavior, habitat, and interactions with pathogens. With this knowledge, we can target specific points within the transmission cycle leading to vector control programs. ==Examples== === Insects === ==== Flies ==== *Mosquitoes ** Mosquitoes of the Anopheles genus transmit human malaria and elephantiasis (a roundworm disease). ** Aedes mosquitoes are vectors of avian malaria, dengue fever, yellow fever and chikungunya (a viral disease).CDC: Aedes albopictus * Sand flies transmit leishmaniasis, bartonellosis and pappataci fever. *Tsetse flies Several genera are vectors of human African trypanosomiasis also known as \"African sleeping sickness\". ==== Bugs ==== * Aphids are the vectors of many viral diseases in plants. * Triatomine bugs such as Rhodnius prolixus are vectors of Chagas disease. ==== Other insects ==== * Fleas such as the human flea, Pulex irritans and the Oriental rat flea, Xenopsylla cheopis, transmit bubonic plague, murine typhus and tapeworms.http://www.ttlntl.co.uk/3/Diseases/fleas.htm Taking the Lead: Fleas Rodents, such as rats and mice carry the fleas, and spread them. * Glassy- winged sharpshooter (a leafhopper) transmits the Xylella fastidiosa bacterium among plants, resulting in diseases of grapes, almonds, and many other cultivated plants. === Other groups === * Ticks of the genus Ixodes are vectors of Lyme disease and babesiosis. and along with lice transmit various members of the bacterial genus Rickettsia. *Cyclopoid copepods: a number of species transmit the nematode Dracunculus medinensis. *Mammals **Bats which represent about 20% of all known mammalian species act as both a natural reservoirs for viruses such as the Hendra virus (HeV) and the SARS like coronavirusesHalpin K, Young PL, Field HE, Mackenzie JS. Isolation of Hendra virus from pteropid bats: a natural reservoir of Hendra virus. Journal of General Virology. 2000 Aug;81(Pt 8):1927-32. PMID 10900029Li W, Shi Z, Yu M, Ren W, et al. Bats are natural reservoirs of SARS-like coronaviruses. Science. 2005 Oct 28;310(5748):676-9. Epub 2005 Sep 29. PMID 16195424 and in many cases as a vector for various viruses such as the lyssaviruses including the rabies virus.McColl KA, Tordo N, Aguilar Setién AA. Bat lyssavirus infections. Rev Sci Tech. 2000 Apr;19(1):177-96. PMID 11189715Arellano-Sota C. Rev Infect Dis. 1988 Nov-Dec;10 Suppl 4:S707-9. Vampire bat-transmitted rabies in cattle. PMID 3206085 ** Felids (cats) are the primary hosts for Toxoplasma gondii a parasitic protozoan which causes Toxoplasmosis. Approximately 30% of the human population is infected with Toxoplasmosis.Vivan AL, Caceres RA, Basso LA, et al.Structural studies of PNP from Toxoplasma gondii. Int J Bioinform Res Appl. 2009;5(2):154-62. PMID 19324601 == Mechanisms of Transmission == In order for parasites and pathogens to be transferred by vectors, it is important to understand the mechanims of transmission. These mechanisms can dictate how and when the pathogen is transferred to a new host. These mechanisms fall into two main categories: biological and mechanical. === Examples === * Biting: Infected vectors such as mosquitoes and ticks directly introduce the pathogen into the bloodstream of the host through their saliva when biting the host. * Regurgitation: Pathogens can be transmitted through vectors regurgitating infected material into the host as they feed. Flies are an example of vectors that transmit parasites this way. * Fecal Contamination: Vector sheds the pathogen in its feces. Then, the host ingests the diseased feces or it comes into contact through skin abrasions. An example vector of this transmission mechanism is the kissing bug. * Vertical Transmission: Vertical transmission is when the vector passes the pathogen on to its offspring. This specific mechanism of transmission is less common. == Control Strategies == Great harm comes from vectors transmitting pathogens and parasites to hosts. Combatting effective strategies that can target these disease transmissions consist of: * Insecticides: chemical agents used to kill adult vectors * Larvicides: target the early larvae stages of vectors * Habitat Modification: Alter environment to eliminate or reduce vector breeding grounds such as filling in breeding sites * Bed nets: Bed nets are physical barriers that are effective in preventing bites from vectors * Protective clothing: Wear proper clothing when in habitats that are prone to nesting vectors such as ticks and mosquitoes == References == Category:Microbiology Category:Parasitism",
 "title": "Vector (biology)"
}