{
 "id": "300590",
 "text": "The Isonzo/Soča (; ; ) is a river that flows through western Slovenia and northeastern Italy. An Alpine river in character, its source lies in the Julian Alps in Slovenia and enters the Adriatic Sea close to the Italian town of Monfalcone. ==Geography== The Soča river has a length of , in Slovenia and in Italy. Its drainage basin has a pronounced mountainous character with an average elevation of about above sea level, and an area of , (66%) in Slovenia and (34%) in Italy. The watershed of this river is one of the few places where the marble trout (Salmo marmoratus) is found. ===Course=== The source of the Soča lies in the Trenta Valley in the Julian Alps in northwestern Slovenia, at an altitude of . The river flows through the western part of Triglav National Park. Then it flows to the south past the Slovenian towns of Bovec, Kobarid, Tolmin, Kanal ob Soci and Nova Gorica (where it is crossed by the Solkan Bridge); here, at an altitude of , the river crosses the border and gets into Italy. In Italy, the Soča, now called Isonzo, flows through several comuni of the Friuli-Venezia Giulia region. Theses comuni are: * Province of Gorizia: Gorizia, Savogna d'Isonzo, Farra d'Isonzo, Gradisca d'Isonzo, Sagrado, Fogliano Redipuglia, Villesse, San Pier d'Isonzo, Turriaco, San Canzian d'Isonzo, Staranzano, Grado. * Province of Udine: Only one comune, Fiumicello; the river flows through a small part of this comune that borders with the province of Gorizia. Finally, it flows into the Gulf of Trieste (Adriatic Sea) in the Riserva Naturale della Foce dell'Isonzo (\"Natural Reserve of the Mouth of the Isonzo\"), to the southwest of the town of Monfalcone. ==Main tributaries == * Left tributaries ** Idrijca - long; it joins the Soča river in Most na Soči, a town in the municipality of Tolmin. ** Vipava - long; it joins the Soča river in the municipality of Savogna d'Isonzo, Italy. * Right tributaries ** Torre - long; ==History== The valley of the Soča river was the place where several battles were fought in World War I between May 1915 and November 1917, in which over 300,000 Austro-Hungarian and Italian soldiers lost their lives. ==Gallery== File:Vrsic 08.jpg|The Soča river in the Trenta Valley. File:Isonzo vue d'avion2.jpg|Aerial view of the Soča river to the south of Tolmin. File:Foce Isonzo dal satellite.jpg|Satellite image of Soča (Isonzo) estuary. File:Isonzo (1).jpg|The Soča river at dawn. ==Related pages== * List of rivers of Italy * List of rivers of Slovenia == References == ==Other websites== * Soča River - The Official Travel Guide by Slovenian Tourist Board. * Autorità di bacino Isonzo, Tagliamento, Livenza, Piave, Brenta-Bacchiglione . * Laboratorio Isonzo . * Soca Valley: Kobarid and Tolmin * Soca River Whitewater Rafting * Kajaking in the Soca river Category:Rivers of Italy Category:Rivers of Slovenia",
 "title": "Soča"
}