{
 "id": "300659",
 "text": "Pete Johnson (born Kermit H. Johnson, March 25, 1904 – March 23, 1967) was an American blues and jazz pianist. He was one of the piano players, together with Albert Ammons und Meade Lux Lewis who made boogie woogie popular. ==Life== He started his musical life as drummer in Kansas City. Playing the piano he started at the age of 18. From 1926 to 1938 he worked as a pianist, often supporting singer Big Joe Turner, and sometimes as cab driver. He met Joe Turner during a gig at Sunset Cafe, where Turner worked as bar man. With Turner he recorded and toured till 1955. In 1936 he was discovered by the famous producer John Hammond who brought him to New York. 1938 Johnson played in the From Spiritual Swing Concerts. This concert made the boogie woogie style popular. Afterwards he played together with Ammons and Lewis and singer Joe Turner at the Cafe Society. They also toured and recorded together. One of his most popular records was \"Roll ´Em Pete\" which he wrote together with Joe Turner. In the late 1940s he made one of the first concept albums. He played firt solo, then different musicians from Kansas City joined him. Everybody has a solo packed by Johnson and then they all played together one piece. He recorded for Storyville, Savoy, Brunswick, Riverside, Apollo and Blue Note. In the 1950s he went to Buffalo but was still touring and recording mainly with Jimmy Rushing and Big Joe Turner. In 1958 he was in Europe with the Jazz at the Philharmonic tour and played at the Newport Jazz Festival. He was partly paralyzed after a stroke. His last years were troubled by illness and poverty. He died on March 23, 1967 in Buffalo being 62 years old. ===Notable songs=== *\"1280 Stomp\" *\"627 Stomp\" *\"Basement Boogie\" *\"Buss Robinson Blues\" *\"Cherry Red\" *\"Death Ray Boogie\" *\"Goin' Away Blues\" *\"Holler Stomp\" *\"Just for You\" *\"Lone Star Blues\" *\"Pete's Blues\" *\"Pete's Lonsome Blues\" *\"Rebecca\" *\"Roll 'Em Pete\" ===Albums=== *1938-1939 Classics, 1938 *King of Boogie Milan, 1939 *Master of Blues and Boogie Woogie, Vol. 3 Oldie Blues, 1939 *Boogie Woogie Mood (1940-1944) MCA ca. 1970 *Pete's Blues Savoy, 1946 *Central Avenue Boogie || Delmark 1993 *Master of Blues and Boogie Woogie Oldie Blues 1975 *1939-1941 Classics 1996 *1944-1946 Classics 1997 *Blues & Boogie Woogie Master 1938/1946 EPM Musique 1998 *St. Louis Parties of July 20 & August 1, 1954 Document 1999 *Roll 'Em Pete Pearl 1999 *1947-1949 Classics 2000 *Atomic Boogie: The National Recordings 1945-1947 Savoy Jazz 2001 ==References== Category:Musicians from Kansas City, Missouri Category:American blues musicians Category:Blues pianists Category:Boogie Woogie pianists Category:American jazz pianists Category:Deaths from stroke Category:1904 births Category:1967 deaths",
 "title": "Pete Johnson"
}