{
 "id": "300613",
 "text": "The Javan rusa or Sunda sambar (Rusa timorensis) is a deer which lives on the islands of Java, Bali and Timor. It is also an introduced species to Irian Jaya, Borneo (Kalimantan) the Lesser Sunda Islands, Maluku, Sulawesi, Australia, Mauritius, New Caledonia, New Zealand, Papua New Guinea, Réunion. The deer lives in a habitat similar to that of the Chital of India, that is, open dry and mixed deciduous forests, parklands, and savannas. It is a close relative of the larger sambar deer. It is hunted in eastern Australasia. Javan Rusa deer breed in the rutting period in July and August. They are active in the early morning and the late afternoon. ==Description== Rusa deer are known by their large ears, the tufts of hair above the eyebrows, and antlers. Males are bigger than females. Males weigh 152–160 kg. Females weigh about 74 kg. Unlike most other types of deer, newborn fawns do not have spots. ==Distribution== The Javan rusa natively lives on the islands of Java, Bali, and Timor in Indonesia. It has been introduced to Irian Jaya, Borneo (Kalimantan), the Lesser Sunda Islands, Maluku, Sulawesi, Pohnpei, Mauritius, Fiji, Tonga, Samoa, Vanuatu, the Solomon Islands, the Christmas Islands, the Cocos Islands, Nauru, Australia, New Caledonia, New Zealand, Papua New Guinea, New Britain, and New Ireland. Rusa deer were introduced to New Guinea in the early 1900s. It prefers open dry and mixed deciduous forests, parklands, and savannas. Rusa deer have populations in remote islands, and may have been brought there by Indonesian fishermen. ==Ecology== Rusa deer are mostly active in the early morning and late afternoon. They are almost never seen in open places. They are very difficult to come close to because of their sharp senses and cautious instincts. The Javan rusa are almost never found alone. When scared, a rusa male lets out an really loud honk. This is an alarm call and alerts any other deer in the area. Just like other types of deer, Javan rusa mostly eat grass, leaves, and fallen fruit. They do not drink water, because they get all their water from their food. The main predators of the Javan rusa include the Javan leopard, the dhole, crocodiles, pythons, and the Komodo dragon. ==Reproduction== The Javan rusa breeds around July and August. When stags contest by calling in a loud, shrill bark and duelling with the antlers. The doe gives birth to one or two calves after a gestation of 8 months, at the beginning of spring. The young ones stop taking milk and start eating solid food at 6–8 months. They reach sexual maturity at 3–5 years, depending on the type of habitat. Javan rusas live 15–20 years both in the wild and in captivity. ==References== Category:Deer Category:Mammals of Asia",
 "title": "Javan rusa"
}