{
 "id": "300776",
 "text": "Holostei is a group of ancient bony fish that show primitive characteristics. There are eight species divided among two orders, the Amiiformes represented by two living species, the bowfin (Amia calva) and the eyespot bowfin (Amia ocellicauda), and the Lepisosteiformes, the gars. There are more species to be found in the fossil record. Holostei was thought to be paraphyletic before. However, a recent study said that they are the closest living relatives of the Teleostei. == References == # Rick Leah. \"Holostei\". University of Liverpool (http://www.liv.ac.uk). # Patterson C. Interrelationships of holosteans. In: Greenwood P H, Miles R S, Patterson C, eds. Interrelationships of Fishes. Zool J Linn Soc, 1973, 53(Suppl): 233–305 # Betancur-R (2016). \"Phylogenetic Classification of Bony Fishes Version 4\". Archived from the original on 2017-07-11. Retrieved 2021-06-07. # Nelson, Joseph, S. (2016). Fishes of the World. John Wiley & Sons, Inc. . # \"Actinopterygii\". Integrated Taxonomic Information System. Retrieved 3 April 2006. # Olsen P. E. (1984). \"The skull and pectoral girdle of the parasemionotid fish Watsonulus eugnathoides from the Early Triassic Sakemena Group of Madagascar with comments on the relationships of the holostean fishes\". J Vertebr Paleontol. 4 (3): 481–499. Bibcode:1984JVPal...4..481O. CiteSeerX 10.1.1.384.2050. doi:10.1080/02724634.1984.10012024. # Grande, Lance; Bemis, William E. (1998). \"A Comprehensive Phylogenetic Study of Amiid Fishes (Amiidae) Based on Comparative Skeletal Anatomy. an Empirical Search for Interconnected Patterns of Natural History\". Journal of Vertebrate Paleontology. 18 (sup001): 1–696. Bibcode:1998JVPal..18S...1G. doi:10.1080/02724634.1998.10011114. # Brito, Paulo M.; Alvarado-Ortega, Jesus (2013). \"Cipactlichthys scutatus, gen. nov., sp. nov. a New Halecomorph (Neopterygii, Holostei) from the Lower Cretaceous Tlayua Formation of Mexico\". PLOS ONE. # López-Arbarello, Adriana; Sferco, Emilia (March 2018). \"Neopterygian phylogeny: the merger assay\". Royal Society Open Science. 5 (3): 172337. # Romano, Carlo (2021). \"A Hiatus Obscures the Early Evolution of Modern Lineages of Bony Fishes\" (PDF). Frontiers in Earth Science. # Brinkmann, W.; Romano, C.; Bucher, H.; Ware, D.; Jenks, J. (2010). \"Palaeobiogeography and stratigraphy of advanced Gnathostomian fishes (Chondrichthyes and Osteichthyes) in the Early Triassic and from selected Anisian localities (report 1863-2009): Literaturbericht\". Zentralblatt für Geologie und Paläontologie. category:Ray-finned fish",
 "title": "Holostei"
}