{
 "id": "300837",
 "text": "Windom is a city in Cottonwood County, Minnesota, United States. The population was 4,798 at the 2020 census. It is the county seat of Cottonwood County. Windom is a small farming town. It also has many parks including one with a disc golf course. The Des Moines River flows through Windom and some people canoe there. ==History== The city was named for William Windom, who was a United States Senator from Minnesota from 1881–1883, and was United States Secretary of the Treasury under presidents James Garfield, Chester Arthur and Benjamin Harrison. ==Geography== Windom is located at (43.866346, -95.116937). It is above sea level. The United States Census Bureau says that the city has a total area of 4.3 square miles (11.0 km²). 4.1 square miles (10.6 km²) of it is land and 0.2 square miles (0.4 km²) of it (3.8%) is water. ==Politics== Windom is located in Minnesota's 7th congressional district, represented by Michelle Fischbach, a Republican. At the state level, Windom is located in Senate District 21, represented by Republican Bill Weber, and in House District 21B, represented by Republican Marj Fogelman. ==Transportation== U.S. Highway 71, Minnesota Highway 60, and Minnesota Highway 62 are three of the main routes in the city. ==Industry== Windom is home to one of 8 Toro manufacturing facilities.Toro Locations It is also the home to Big Game Treestands.big game treestands ==Communications== The local paper is the Cottonwood County Citizen. The local radio station is KDOM Radio. ==Education== Windom is home to three schools: Windom Area Middle/High School, Winfair Elementary School, and Red Rock Ridge ALC. It is also home to two preschools: Busy Bees and Sunshine School. ===Windom Area Middle/High School=== Windom Area Middle/High School is home to students grade 4-12 due to renovations in 2003. There are roughly 300 students attending the high school (grades 9-12) and 350 attending the middle school (grades 4-10). The school is led by Principal Eric Hanson and Superintendent Wayne Wormstadt. ====Extracurriculars==== =====Sports===== *Football home of Top Minnesota recruits Michael Rivera and Tent Bever *Volleyball - State Champions in 2008, State Runner up in 2007 2013 section 2A champs *Cross Country - Boys and Girls- John Curley and Emily Turner, State Participants, 2010 (800 meter dash winner 7th grade John Turner) *Basketball- Boys and Girls Hoops that Like to throw Alley-oops. Stepping stone to Intermural glory. *Gymnastics-voted all state academics 12 years running *Wrestling- Jeff Stuckenbroker, Nick Kulseth, A.J. Stevens, Drake Borsgard, Joe Fischenich, Billy Hochstein, Sam Fischenich, and Wyatt Stevens have all been state place winners. *Golf - State Runner-up in 2008 lead by Jordan Higley. *Lacrosse established in 2008 coached by Johnathan Smith who has a 21-46 career record star players have been Sean Mcgire, Phillip Symens, and Nolan Jones. *Tennis only all state player in school history Brendon Chester =====Arts===== *Band *Stage Band *Choir *Pop Group *Flags and Rifles *Fall Musical *Winter Play *Mass Media =====Academics===== *Knowledge Bowl State Participants in 3 successive years 2009, 2010, and 2011 *YES! Team *Speech-Many state participants, including Morgan Potter, State Champion in Prose *FFA *Student Senate ==Entertainment== ===Riverfest=== Windom holds an annual summer festival called Riverfest during the second weekend of June. A pageant corresponds to this celebration which crowns a Miss Riverfest, a First Runner-Up, Miss Photogenic, Miss Congeniality and a Little Miss Riverfest. Other activities in this weekend celebration include: fireworks, Vickie Schendel 5K Walk/Run, tennis tourney, fishing tourney, turtle races, kiddie tractor pull, street dance, grand parade, and many more. ===Winter-River-Fest=== In February 2011 Windom started a new festival dubbed \"Winter-River-Fest.\" Activities included a chili feed, open fires, dodge ball, snow sculpting, and the Darn Cold Croquet Contest. ==Notable natives== *Maria Schneider - Composer *Johnny Olson - Gameshow announcer *Larry Buhler - Professional football player ==References== * Brown, John A. History of Cottonwood and Watonwan Counties, Minnesota: Their People, Industries, and Institutions. B.F. Bowen & Co.: Indianapolis, 1916. ==Other websites== * City of Windom * Windom Community Guide Category:Cities in Minnesota Category:County seats in Minnesota",
 "title": "Windom, Minnesota"
}