{
 "id": "300996",
 "text": "South Africa has eleven official languages. They are Afrikaans, English, Ndebele, Northern Sotho, Sesotho, Swazi, Setswana, Tsonga, Venda, Xhosa and Zulu. Most South Africans (over 99%) speak one of these languages as a first language. Most South Africans can speak more than one language. Prior to 1994, South Africa had only two official languages, English and Afrikaans. All the official languages are equally spoken and recognized everywhere in South Africa even though they are dominant in their respective provinces. Sesotho(Southern Sotho) is dominant in the Free State Province, Setswana(Northern Cape and North West Province), Sepedi(Northern Sotho), Tshivenda and Xitsonga in Limpopo Province, isiZulu in KwaZulu Natal province, isiXhosa in Eastern/Western Cape Province. English and Afrikaans is common in all the provinces as English is a medium of instruction. Due to people migrating to different provinces in pursuit for work, there is always a chance you'll find multiple languages spoken in certain regions however a dominant language with respect to that province will prevail. The English version of the South African constitution calls each of these languages by its name in that language. Sotho is called Sesotho, Tswana is called Setswana, Pedi is called Sepedi, Zulu is called isiZulu, Xhosa language is called isiXhosa, and so on. The languages listed in the constitution are: Sesotho(Southern Sotho), Setswana(Tswana), Sepedi(Northern Sotho), isiZulu (Zulu), isiXhosa (Xhosa), Afrikaans (Afrikaans), English (English), Xitsonga (Tsonga), Siswati (Swati), Tshivenda (Venda), and isiNdebele (Southern Ndebele). In South Africa, Southern Ndebele is known simply as Ndebele, since most speakers of Northern Ndebele live in Zimbabwe. The 1993 version of the Constitution referred to Northern Sotho as Sesotho sa Leboa, but the 1996 version called it Sepedi. Different government departments and official organizations use different names for Northern Sotho. The main language of government is English. Afrikaans and English are both important languages used in commerce. Most rich South Africans speak Afrikaans and English. Two of the official languages are West Germanic languages (English and Afrikaans). The other nine languages are Bantu languages. Four of the Bantu languages are part of the Nguni family (Zulu, Xhosa, Swati, Ndebele). Three of the Bantu languages are Sotho-Tswana languages (Northern Sotho, Southern Sotho, Setswana). Tsonga is a Tswa-Ronga language. South Africa also has a national sign language, South African Sign Language. ==References== ==Other websites== * Introduction to the languages of South Africa * Ethnologue Listing of South African Languages * PanAfriL10n page on South Africa * Statistics SA",
 "title": "Languages of South Africa"
}