{
 "id": "300935",
 "text": "The Tejano Music Awards is an annual music awards ceremony that is held in San Antonio, Texas to recognize and build awareness for Tejano music. The first TMA's began in 1980. == Achievements == In 1986, Selena won the \"Female Vocalist of The Year\" award and continued to win the award for nine consecutive years, up until her death.Patoski, p. 232 She had won two awards posthumously after her death. Selena dominated the awards beginning the 90's when she helped spread the Tejano Music Movement into the United States. She was then given the title \"Queen of Tejano music\".Patoski, p. 109 Being a male- dominate genre, the Tejano Music Awards continued to see a rise in more male entertainers receiving awards such as Emilio Navaira, Jay Perez, and La Mafia. The group, La Mafia, became the first male Tejano group to sell a gold album (sales of 50,000 units).Patoski, p. 91 For the females, Selena's album Ven Conmigo (1990) became the very first Tejano album to ever be certified gold by the RIAA.Patoski, p. 93 == Awards == *Tejano Music Awards for Male Vocalist of The Year *Tejano Music Awards for Female Vocalist of The Year *Tejano Music Awards for Best New Male Artist *Tejano Music Awards for Best New Female Artist *Tejano Music Awards for Best New Group *Tejano Music Awards for Album of The Year (Conjunto) *Tejano Music Awards for Album of The Year (Tejano) *Tejano Music Awards for Entertainer of The Year *Tejano Music Awards for Song of The Year *Tejano Music Awards decade ballots *Tejano Music Awards for Album of The Year (group) *Tejano Music Awards for Crossover Song of The Year *Tejano Music Awards for Vocal Duo of the Year *Tejano Music Awards for Lifetime Achievement Award *Tejano Music Awards for Most Promising Band *Tejano Music Awards for Showband of the Year *Tejano Music Awards for Album of The Year (Conjunto Progressive) *Tejano Music Awards for Album of The Year (Urban Tejano) *Tejano Music Awards for Album of The Year (Conjunto Norteño) *Tejano Music Awards for Mexican/Regional Song of the Year *Tejano Music Awards for Album of The Year (Tejano Norteño) *Tejano Music Awards for Tejano Music Video of the Year *Tejano Music Awards for Album of The Year (Traditional) *Tejano Music Awards for Humanitarian of the Year *Tejano Music Awards for Album of The Year (Orchestra) *Tejano Music Awards for Album of The Year (Overall) *Tejano Music Awards for Song of The Year (Tejano Country) *Tejano Music Awards for Instrumental of the Year *Tejano Music Awards for Songwriter of the Year *Tejano Music Awards for Tejano Gospel Music Artist == References == == Books and articles == * == Other websites == *Official web site Category:Music awards Category:San Antonio, Texas Category:Tejano music Category:1980 establishments in the United States Category:1980s establishments in Texas",
 "title": "Tejano Music Awards"
}