{
 "id": "300904",
 "text": "Anthony Wilford Brimley (September 27, 1934 - August 1, 2020) was an American actor. Brimley has appeared in the movies The China Syndrome, Cocoon, The Thing and The Firm. He has also appeared in television commercials for Quaker Oats and Liberty Medical. He was a member of The Church of Jesus Christ of Latter-day Saints and a former United States Marine. He had diabetes which he speaks openly about in his commercials for Liberty Medical. Brimley died on August 1, 2020 in St. George, Utah at the age of 85, after suffering kidney disease. ==Filmography== Year Film Role 1968 Bandolero! Stunts (uncredited) 1969 True Grit Stunts (uncredited) 1971 Lawman Stunts (uncredited) 1976 The Oregon Trail Ludlow 1979 The China Syndrome Ted Spindler 1979 The Electric Horseman Farmer 1980 Brubaker Rogers 1980 Borderline Scooter Jackson 1981 Absence of Malice Asst. U.S. Atty. Gen. James A. Wells 1982 Death Valley The Sheriff 1982 The Thing Dr. Blair 1983 Tender Mercies Harry 1983 10 to Midnight Captain Maline 1983 High Road to China Bradley Tozer 1983 Tough Enough Bill Long 1984 Harry & Son Tom Keach 1984 Ewoks: The Battle for Endor Noa Briqualon 1984 The Hotel New Hampshire Iowa Bob 1984 The Stone Boy George Jansen 1984 The Natural Pop Fisher 1984 Country Otis 1984 Terror in the Aisles 1985 Cocoon Benjamin Luckett 1985 Remo Williams: The Adventure Begins Harold Smith 1985 Shadows on the Wall Theater Owner 1985 Murder in Space Dr. Andrew McAllister 1986 Jackals Sheriff Mitchell 1987 End of the Line Will Haney 1988 Cocoon: The Return Benjamin Luckett 1989 Eternity King/Eric 1992 Where the Red Fern Grows: Part II Grandpa Will 1993 The Firm William Devasher 1993 Hard Target Uncle Douvee 1994 Heaven Sent Security Guard 1995 Mutant Species Devro 1995 Last of the Dogmen Narrator (uncredited) 1996 My Fellow Americans Joe Hollis 1997 In & Out Frank Brackett 1997 Lunker Lake The Storyteller 1998 A Place to Grow Jake 1998 Progeny Dr. David Wetherly 1998 Chapter Perfect Chief Hawkins 1998 All My Friends Are Cowboys Charlie 1998 Summer of the Monkeys Grandpa Sam Ferrans 2000 Comanche 2001 PC and the Web 2001 Brigham City Stu 2001 The Ballad of Lucy Whipple Deputy Sheriff Ambrose Scraggs 2001 Crossfire Trail Joe Gill 2002 Resurrection Mary Morty 2002 The Round and Round Governor 2003 The Road Home Coach Weaver 2009 The Path of the Wind Harry Caldwell 2009 Did You Hear About the Morgans Earl Granger ==References== ==Other websites== * Category:1934 births Category:2020 deaths Category:Deaths from kidney disease Category:Stunt performers Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from Wyoming Category:Actors from Salt Lake City, Utah Category:Singers from Wyoming Category:Singers from Utah",
 "title": "Wilford Brimley"
}