{
 "id": "300948",
 "text": "Abraham Issac Quintanilla, Jr. (born February 20, 1939) is a Mexican American singer. He was Selena's manager throughout her life. == Los Dinos era == Abraham and his close friends formed a Mexican American doo-wop band called, Los Dinos beginning in the 1950s. Los Dinos took to the road everywhere their music was much appreciated. Through struggles, Los Dinos signed numerous minor Texas based record companies. By the 1960s Los Dinos switched their musical styles to Tejano music due to their low popularity. Abraham quit the band to tend to his family full-time soon after his third and final child, Selena was born in 1971. Abraham became managing his children's music abilities, soon after his daughter Selena had the ability to sing high notes in perfect pitch tune and memorization. == Selena y Los Dinos era == In the late 1970s, Abraham formed a new group composed of his three children, which was named Selena y Los Dinos.http://i-search-design.com/search/+Abraham+Quintanilla Abraham opened a Mexican American restaurant in 1982, which featured performances by his musically gifted children. Unfortunately, the restaurant was unsuccessful and closed in its first year. By 1984, Abraham became the children's manager full-time for live concerts, performance on television shows, and so forth with the help of the \"Selena Tour Bus\". In 1993, Abraham opened up his own recording studio, Q-Productions which he managed with various artists. In the same year, the \"Selena Fan Club\" was formed by Yolanda Saldivar who later took Selena's life. In 1995, Abraham was no longer the manager of Selena and her band Selena y Los Dinos due to an upcoming crossover album that would have propelled Selena into the main strain American pop. On March 31, 1995, Abraham's youngest child, Selena was murdered at the age of 23. Soon after her death, Abraham and his family created The Selena Foundation, a charitable organization which would help children in crisis. == Personal life == Abraham Quintanilla continues to produce new acts in the music business and film with his record company, Q-Productions. Since Selena's death, Abraham Quintanilla appeared in numerous television Selena specials. == Discography == ;Studio albums Album information Los Dinos (The Guys) ** Released: 1963? Con Esta Copa (With This Cup) ** Released: 1964 The Dinos (Falcon release) ** Released: 1965 2000 ** Released: 1962? Unknown fifth release (Bernal release) ** Released: 1967? Unknown sixth release (Bernal release) ** Released: 1974? == Filmography == Film Film Film Film Year Film Role Notes 1997 Selena Executive Producer 1997 Selena Remembered Producer 2003 Greatest Hits DVD Producer Television Television Television Television Year Title Role Notes 1995–present Tejano Music Awards himself, receiving awards for Selena TV appearances 1998? American Justice: Selena episode himself 1998 Behind The Music: Selena the movie himself 1999 Corpus: A Home Video for Selena himself 2004 Noche de estrellas: Premio lo Nuestro 2004 himself, receiving awards for Selena 2005 Don Francisco presenta himself 2005 Selena: Noche de estrellas himself 2005 Selena !VIVE! himself 2005 Selena ¡vive!, acceso total himself 2007 Selena: Queen of Tejano himself 2007 Making of Selena: 10 Years Later himself == References == == Other websites == * IMDB profile * Q-Productions.com web site Category:Selena Category:Singers from Texas Category:1939 births Category:Living people Category:Tejano musicians Category:American folk singers Category:Former Roman Catholics Category:People from Corpus Christi, Texas",
 "title": "Abraham Quintanilla"
}