{
 "id": "300921",
 "text": "The Shire is a fictional location is part of the legendarium created by the British author J. R. R. Tolkien and appears in their novels The Hobbit and The Lord of the Rings. It is a region in the northwest of Middle-earth, one of the continents of the fictional world of Arda where elapses the most part of J. R. R. Tolkien's legendarium. It is, in turn, within the great region of Eriador, where previously existed the kingdom of Arnor. Is inhabited only by hobbits, a race similar to the men and characterized by their short stature.The Fellowship of the Ring, Prologue Founded in the middle of the Third Age, their known history is small and with little significants events because the peaceful nature of its inhabitants, with the exception of the events that took place during the War of the Ring. Even if is not mentioned as such in the novel The Hobbit, J. R. R. Tolkien already was then an idea of what was the Shire, was created \"officially\" during the composition of the first chapter of The Lord of the RingsTOLKIEN, J. R. R. 1988. «An unexpected meeting». The Return of the Shadow. ed. Christopher Tolkien, London, Unwin Hyman, and inspired principally in the neighborhood of Sarehole, Birmingham, where the author lived during his childhood.Carpenter, Humphrey and Tolkien, Christopher (eds.), 1981, The Letters of J. R. R. Tolkien, London, George Allen & Unwin, == The Shire in the languages of the Middle-Earth == Hobbits sometimes call it Sûza (which means \"Shire\") The Return of the King, Appendix F or Sûzat (\"the Shire\"),Tolkien, The Peoples of Middle-earth, Vol. XII of The History of Middle-earth, p. 45. terms that have their origin in the Rohirric, the language of Rohan with which they came in contact before colonizing the Shire. On the other hand, in the Elvish language Sindarin they call it i Drann.Vinyar Tengwar #31, pp. 21-2 It is also called \"Four frames\", the name refers to their territorial division. == Geography == According to Tolkien, the Shire measured 40 leagues (193 km, 120 miles)Tolkien takes a league to be 3 miles, see Unfinished Tales, The Disaster of the Gladden Fields, Appendix on Númenórean Measure. from the Far Downs in the west to the Brandywine Bridge in the east, and 50 leagues (241 km, 150 miles) from the northern moors to the marshes in the south, This is confirmed in an essay by Tolkien on translating The Lord of the Rings,Tolkien, Guide to the Names in The Lord of the Rings, in Jared Lobdell (ed.), A Tolkien Compass, Open Court, 1975. where he describes the Shire as having an area of 18,000 square miles (47,000 km²).Guide to the Names, entry on \"Farthing\". The original territory of the Shire was bounded on the east by the Baranduin River, on the north by uplands rising to the old centre of Arnor, on the west by the White Downs, and on the south by marshland south of the River Shirebourne. After the original settlement, hobbits also expanded to the east into Buckland between the Baranduin and the Old Forest, and (much later) to the west into the Westmarch between the White Downs and the Tower Hills. The Shire was originally divided into four Farthings. The outlying lands of Buckland and the Westmarch were formally added after the War of the Ring when they were officially granted by King Elessar. Within the Farthings there are some smaller unofficial clan homelands: the Tooks nearly all live in or near Tuckborough in Tookland, for instance. A Hobbit surname often indicates where the family came from: Samwise Gamgee's last name derives from Gamwich, where the family originated. Buckland was named for the Oldbucks (later called the Brandybucks). The Shire was densely populated, with many towns and few cities, but still had large areas of forests and wetlands. It is described as a \"small land\", but beautiful and fruitful, beloved by its inhabitants. Their location gives it a natural fertility and therefore the hobbits have an extensive farming system, being able to find many supplies such as cereals, fruits, wood and pipe-weed (one of the favorite pleasures of the hobbits). However, its economy is almost self-sufficient and hobbits typically consume all the products of their crops, or reserve them for gifts. === Orography === The Shire is a region of low elevations, and these are no higher than hills. The main ones are: *Far Downs, are between the Tower Hills, west, and the White Downs to the east. They were originally the western frontier of the Shire, but after expansion \"in 32\" of the \"Fourth Age of the Sun,\" were included in it and became part of the Westfarthing. They found the village of Greenholm *White Downs: also called White Hills, are in the Westfarthing, on the east of Far Downs. The town Michel Delving was there. The Free Fair, where hobbits elected there Mayor of the Shire, was held here. *Hills of Scary: in the Eastfarthing and extend from the river Baranduin until near the border with the Northfarthing. Scary and Quarry villages are close to the hills, ob the south. *Green Hills, extending from the Westfarthing, through the Southfarthing and ending in the Eastfarthing, going into the Woody End. All the lands who occupied were called the Green Hill Country. In the west was the town Tuckborough, where the Took family and the Thain lived. In these hills born the river of the Shire and the river of the Cardoon. === Weather === The climate in the Shire was primarily temperate maritime or ocean, depending on the area. In general, temperatures are slightly warmer in the south than in the north and seasonal changes of temperature are lightly more pronounced (hotter summers and colder winters) in the extreme east than the extreme west. The rainfalls are moderate throughout the whole year and especially in the Northframe, Can snow during the occasional visits of polar air from the north.FONSTAD, Karen Wynn Atlas of Middle-earth 1981, Chapter: The Shire, Timun Mas, Climate studying and modeling based on local topography and geography by climatologists at the University of Bristol, UK, have found that the Shire holds an annual average temperature of 44 °F (6.7 °C) and an annual yearly precipitation average of 24 inches (61 cm), similar to that of Lincolnshire or Leicestershire, England, or Dunedin, New Zealand. == Population == The Shire is populated only by hobbits. By the time of the War of the Ring, most of the whole hobbit race was there, except those who lived in Bree-land to the east. The original three tribes of hobbits (Harfoots, Fallohides, Stoors) united and mixed in the Shire. Only in the east part of the Shire there is a bigger Stoorish influence, which can be seen in that those hobbits sometimes grow beards. The Shire has three leader positions: *The Thain is the leader of all Shire-hobbits. The Thain originates from the Took family. *The Master of Buckland, at the eastern border of the Shire. The Master of Buckland is from the Brandybuck family. *The Mayor of Michel Delving. He is elected every seven years by the Shire-hobbits. He administers the post system and the police. == References == Category:Middle-earth de:Regionen und Orte in Tolkiens Welt#Auenland lb:Länner a Stied aus Middle- earth#The Shire",
 "title": "Shire (Middle-earth)"
}