{
 "id": "301094",
 "text": "The Bad Girls Club (or BGC) was an American reality television show. It was created by Jonathan Murray for Oxygen TV channel. The show is about seven women who are called \"bad girls\" because of their bad behavior. They come from different races and backgrounds. They have psychological and behavior problems. They are put in a big house to live for three months. The production team video tapes their life inside and outside of the house. They live in the house to try and change their \"bad ways\" and become role models. They have to obey the rules they were given. If they don't follow them, they can be removed from the show. If this happens, a \"replacement\" will arrive at the house. In season one and season two, the premise of the show was different from other seasons. There has been six complete seasons of The Bad Girls Club. The fourth season had the highest ratings. It became the \"breakthrough season\" for the show. The show is broadcast in five different countries.The Bad Girls Club was given negative feedback from television critics. This is because the show is about girls fighting. Teenagers have also pretended to be like the girls in the show. This made schools in the United States to dislike the show. Some schools even started banning the show in their cities. There has been a lot of conflicts about the show. This is because some cast-members stated opinions that made the public very angry. There have been three spin-offs of The Bad Girls Club. Love Games: Bad Girls Need Love Too has been a rating success. The show is about three former \"bad girls\" looking for love. Oxygen released mobile games, comic strip and merchandise to help promote the show. There has been 62 people who been on the show. Kerry Harvick (from the first season) became a country singer. Tanisha Thomas (from the second season) became a host in many Bad Girls Club spin-offs. Amber Meade, Amber Buhl, Sarah Michaels, Kendra Jones, Natalie Nunn and Lea Beaulieu were in the \"Love Games: Bad Girls Need Love Too\" show. == About the show == The show follows seven women. They are between the ages of 21 and 27. They live in a big house for three months. The production team video tapes their lives in and out of the house. The girls are called \"bad girls\". This is because of their bad behavior. However, they are put in the show because they want to change their \"bad ways\". They also want to become role models to young women. Other \"bad girls\" are only there to reach goals of their own. In the show, the \"bad girls\" must try to live with each other. They must also try and deal with a lot of changes from their roommates. They must follow all the rules that they were given. If they break a \"bad girl\" breaks a rule, she will be removed from the show. A \"replacement\" is then brought in. A replacement is a \"bad girl\" who did not enter the house on the first night. She is brought in the show, to fill in. This is because the show is about seven women trying to change. The \"bad girls\" have to talk in a room about their day. Sometimes, a \"bad girl\" may divide into cliques. Create bad behavior to feel happy, book parties in nightclubs and shop for food. They must also maintain their personal lives. The \"bad girls\" are allowed to contact their families and boyfriends (or girlfriends). They are given a home computer to communicate with the world. However, watching television and having a cell phone is not allowed. Bullying and double tagging is known to happen in the show. Double tagging means that two or more \"bad girls\" jump one of their roommates. Sometimes, a \"bad girl\" may wish to leave the show. This is because of their roommates who are bullying them, being or feeling alone, problems at home, court dates, or because they feel like they are \"better\" then the girls in the house. It is rare if two or more replacements come into the show. The only seasons to have a lot of replacements was season one (2006), season five (2010) and season six (2011). The replacement \"bad girl\" is always treated badly by the original cast. It is rare if a replacement wants to leave the show. The only season to have a replacement leave was on the fifth season. This is the Bad Girls Club creed. It was first seen in the third season. === Season one and Season two === The show was different in these two seasons. The age requirements were 21 and 31. \"Nicknames\" were not given to anyone. Nicknames started in the third season. Season one was the first season to have a lot of replacement \"bad girls\". Even though this season was different, the rules were kept the same for later seasons. Another thing that stood the same was how the first episode started. The first episode always starts with a physical fight. The fight that is seen, shows how the first \"bad girl\" is removed from the show. For the second season, the show began to change. The maximum age requirements to apply dropped from 35 to 27. The cast had to work. They were given jobs that did not give them any money. They had to learn how to be dependent on others for teamwork. They also needed to build a work ethic. This skill would help them in their life after the show. If a \"bad girl\" wanted to quit her job or did not show up, she would be removed from the show. The girls were given the jobs of planning and decision making. This became the first and only season to have the \"bad girls\" working. This was also the last time episodes were only 30-minutes long. === Live shows === The OxygenLive was released on August 3, 2010. This allowed fans of the show to submit their opinions about the season or the cast. Fans had to submit their comments on Facebook or Twitter. Their comments were then showed during the re-cap episode of The Bad Girls Club. OxygenLive! was an online talk show. Tanisha Thomas (from season two) was the host. The live show debuted after the first episode of the sixth season aired on Oxygen. The show was about talking with the cast of season six. Thomas gave them questions to answer from fans. == Airings and locations of The Bad Girls Club == Season Season premiere Season finale Locations Season 1 December 5, 2006 April 24, 2007 Los Angeles, California Season 2 December 4, 2007 May 13, 2008 Season 3 December 2, 2008 March 24, 2009 Season 4 December 1, 2009 March 9, 2010 Season 5 August 3, 2010 November 9, 2010 Miami, Florida Season 6 January 10, 2011 April 25, 2011 Los Angeles, California Season 7 August 1, 2011 TBA New Orleans, Louisiana == U.S. television ratings == \"Viewers\" is the estimated number viewers that watched a program either while it was broadcast or watched via DVR on the same day the program was broadcast. Season Timeslot (ET) Airings Premiered Premiered Ended Ended Ended A18-49 W18-34 H/H Share Highest rated episode (in millions) Total viewers (average) Date Premiere viewers (in millions) Date Finale viewers (in millions) Reunion viewers (in millions) Season 1 10 P.M Tuesdays 6 December 2006 24 April 2007 393,000 Season 2 4 December 2007 20 May 2008 267,000 191,000 681,000 Season 3 2 December 2008 1.03 31 March 2009 0.8 641,000 476,000 1.07 1,143,000 Season 4 1 December 2009 1.67 9 March 2010 2.66 749,000 527,000 1.1/2 2.27 1,677,000 Season 5 9 P.M 3 August 2010 1.34 9 November 2010 1.71 1.90 831,000 810,000 1.1/2 1.96 1,679,000 Season 6 Mondays 10 January 2011 1.71 25 April 2011 1.36 1.55 700,000 1.0/1 1.85 Season 7 1 August 2011 900,000 494,000 1.75 1,331,000 == International broadcast == Country / Region Channel Title United States (origin) Oxygen The Bad Girls Club Netherlands RTL Entertainment De slechte meisjes (The Bad Girls) Australia MTV Australia The Bad Girls Club Hungary Kemény lányok klubja (Tough Girls Club) Sweden TV11 Stygga flickors klubb (Naughty Girls Club) Russia MTV Russia Дом Плохих Девчонок (Bad Girls Home) Portugal SIC Radical As Desavergonhadas (The Shameless) United Kingdom Sky Living The Bad Girls Club Ireland Sky Living The Bad Girls Club Southeast Asia Channel [V] The Bad Girls Club ==Cast members== Season Name Age Hometown Profession 1 Zara 22 Upstate NY Ripsi 23 MA Aimee 24 South Philly Leslie 24 Atlanta Model Ty 25 Atlanta Jodie 29 Baltimore Model Kerry 31 Nashville Singer-songwriter Joanna Sacramento DeAnn Andrea 2 Tanisha Thomas 21 Brooklyn, NY Reality star, television host Nikki Sarah \"Cordelia\" Carlisle 22 Wallingford, CT Porn actress Hanna Thompson 22 Brooklyn, NY Actress Lyric Greene 22 Phoenix, AZ Rapper Darlen 24 Austin, TX Neveen 24 Portland, OR Jennavecia 26 Las Vegas, NV Voice actress Andrea Portland, OR Blogger 3 Ailea 21 Buford, GA Whitney 21 Boston, MA Amber Buhl 23 Pittsburgh, PA Kayla 23 Compton, CA Sarah 23 Milwaukee, WI Tiffany 24 Chicago, IL Amber 25 Montevideo, MN Ashley Weaver 21 Seattle, WA 4 Kendra 22 Charlotte, North Carolina Former beauty queen Amber 23 Morgantown, West Virginia Kate 23 Boston, MA Natalie Nunn 24 Oakland, CA Socialite, club promoter, model Portia 24 Kansas City, MO Annie Andersen 25 Los Angeles, CA Animal rights activist Florina 26 Staten Island, NY Singer, club promoter, LGBT rights activist Lexie 21 Belleville, IL 5 Danielle 21 Massapequa, NY Morgan 21 Miami, FL Socialite, club promoter, model Lea 22 South Beach, FL Kristen Guinane 23 Boston, MA Hooters waiter Catya 24 Philadelphia, PA Model Erica Lynne (or Langston) Eggum 25 Anaheim, CA Former cheerleader Brandi Arceneaux 26 Inglewood, CA Porn actress, exotic dancer, club promoter Ashley Cheatham 21 Houston, TX Model Kayleigh Severn Christina Hopkins 22 Staten Island, NY Model, club promoter 6 Jessica 22 Chicago, IL Kori Koether 21 Phoenix, AZ Model Lauren Spears 21 Lexington, KY Sydney Red Taylor Steinfeldt 21 Dallas, TX Jade Kayrina Bennett 22 Milwaukee, Wisconsin Socialite Nicole \"Nikki\" Galladay Giacara Garcia 22 Annandale, NJ Football player, model, body builder Charmaine 27 Chicago, IL Administrative assistant Ashley Nichole 21 Norfolk, VA Model, Socialite Jennifer Buonagurio 21 Bergen County, NJ Playboy model, exotic dancer Wilmarie Sena 27 Passaic County, NJ Model 7 Angelic Castillo 21 Bronx, NY Go-go dancer, exotic dancer Judi Jai Jackson 21 Olympia Fields, IL Tiara Hodge 22 Gary, Indiana Entrepreneur Nastasia 23 Huntington Beach, CA Shelly Hickman 23 St. Louis, MO Bartender Tasha 23 Miami, FL Priscilla Mennella 25 New York, NY CheyenneEvans 22 Austin TX 8 Amy Cieslowski 23 Chicago, Illinois Dani 23 Methuen, Massachusetts YouTuber Demitra \"Mimi\" 25 Miami, Florida Erica \"Venetia\" Marie Figueroa 23 Atlanta, Georgia Gabi 23 Methuen, Massachusetts Gia Sapp-Hernandez 22 Newark, Delaware Jenna Russo 24 Wantagh, NY Elease Donovan 24 Miami, Florida Christine Moon 23 Nashville, Tennessee Camilla Poindexter 24 Long Beach, California Actress, model, reality star 9 Ashley Dye 21 Bartlett, Illinois Christina Rome Salgado Jerz 21 Jersey City, New Jersey Singer Erika Vee 23 Chicago, Illinois Rapper Falen G 25 Fairfax, Virginia Julie Ofcharsky 23 Boston, Massachusetts Mehgan James 21 Texas City, Texas Model, reality star Rimanelli Mellal 22 Chicago, Illinois Andrea Jones 27 Bethpage, NY Singer, model Zuly Ramos 28 Tampa, Florida Natasha Smoot 21 Monroe, NY 10 Alicia Samaan 24 Bolingbrook, Illinois Janae Bradford 23 Houston, Texas Nicole Vargas 22 Fort Lee, New Jersey Paula Hellens 26 Chicago, Illinois Shannon Sarich 26 Hillsboro, Oregon Stephanie George 21 Harlem, NY Valentina Anyanwu 22 Hyattsville, Maryland Jennifer Hardwick 21 San Bernardino, California Raquel Santiago 21 Pine Grove, California Nancy Denise 22 Memphis, Tennessee 11 JazMone Adams 22 Glendale, California Milyn Jensen 24 Los Angeles, California Sarah Oliver 27 Riverdale, Georgia Actress, reality star Stephanie Rivera 21 New Haven, Connecticut Teresa Bordeaux 22 Newark, Ohio Tess Mett 21 Louisville, Kentucky Tiana Small 21 Harlem, NY Reality star, model Gina Lopez 23 Brooklyn, NY Shanae Thomas 21 Atlanta, Georgia Janelle Shanks 22 Houston, Texas Reality star Andrea Bowman 21 Wichita, Kansas Mercedies Webber 24 Brooklyn, NY Hailey Wade 21 Spring, Texas 12 Alexandria Rice 22 Sherwood, Wisconsin Alyssa Carswell 24 Fort Lauderdale, Florida Brittany Britton 24 Louisville, Kentucky Jada Cacchilli 28 Queens, NY Jonica Booth 25 St. Louis, Missouri Actress Linsey Berardi 21 Brooklyn, NY Loren Jordan 23 Mobile, Alabama Aysia Garza 22 Klein, Texas Dalila Ortiz 26 Chicago, Illinois Raesha Clanton 23 Mobile, Alabama 13 Alyssa Carswell 24 Fort Lauderdale, Florida Camilla Poindexter 27 Long Beach, California Actress, model, reality star Danni Victor 26 Methuen, Massachusetts YouTuber Jada Cacchilli 28 Queens, NY Judi Jai 25 Olympia Field, Illinois Julie Ofcharsky 25 Boston, Massachusetts Natalie Nunn 29 Oakland, California Socialite, club promoter, model Raquel Santiago 23 Pine Grove, California Sarah Oliver 29 Riverdale, Georgia Actress, reality star Rimanelli Mellal 24 Chicago, Illinois 14 Christina Aviles 23 Queens, NY Jasmine Carter 21 Chicago, Illinois Jelaminah Lanier 25 Houston, Texas Kathryn Florek 24 Zion, Illinois Lauren Lewis 23 Covington, Georgia Shannade Clermont 20 Montclair, New Jersey Shannon Clermont 20 Montclair, New Jersey Jenna Charland 22 Albany, NY Amber Zadora 21 Philadelphia, Pennsylvania Beatrice Miller 21 Yonkers, NY Alicia Ramsdell 22 Atlanta, Georgia 15 Amber Thorne 26 Houston, Texas Angela Babicz 25 Clifton, New Jersey Annalisa Giordano 23 Arden Heights, NY Asia Jeudy 24 Brooklyn, NY Diamond Jimenez 23 Harlem, NY Jessica Giordano 23 Arden Heights, NY Kristina Babicz 22 Clifton, New Jersey Olivia Adams 26 Allentown, Pennsylvania Amanda Hepperle 28 Guttenberg, New Jersey Victoria Hepperle 28 Guttenberg, New Jersey Jaimee Wallace 22 Miami, Florida Jazmyn Wallace 21 Philadelphia, Pennsylvania Allison Green 24 Las Vegas, Nevada Melissa Green 27 Las Vegas, Nevada Hanan Ibrahim 24 Covina, California Susu Ibrahim 26 Covina, California 16 Adryan Jones 23 Philadelphia, Pennsylvania Brynesha Seegers 22 Washington, D.C. Elliadria Griffin 25 Dallas, Texas Kaila Wilkey 22 Richmond, California YouTuber, podcaster Kailie Lima 21 Allenstown, New Hampshire Tabatha “DreamDoll” Robinson 23 The Bronx, New York Rapper, actress, reality star Zee Carrino 24 San Jose, California Stephanie Tejada 27 Orlando, Florida Kandyce Hogan 24 Riverdale, Illinois Kabrina Nashaye 23 Chicago, Illinois Tiara Nicole 26 Memphis, Tennessee 17 Deshayla Harris 22 Norfolk, Virginia Francesca Jacovino 22 Torrington, Connecticut Keyaira Hamilton 26 Compton, California Kiyanna Bygrave 23 Brooklyn, NY Sayyora Badalbaeva 21 Northridge, California Seven Craft 21 Fort Washington, Maryland YouTuber Susan Shermann 21 Lynnwood, Washington Briana Walker 23 Las Vegas, Nevada Contestant's age at the start of the season. U.S. state abbreviations can be found here. == Spin-offs == * Bad Girls Road Trip * Love Games: Bad Girls Need Love Too * Bad Girls Club: Flo Gets Married * Tanisha Gets Married * Bad Girls All-Star Battle * Baddies == References == == Other websites == * Category:2006 American television series debuts Category:2000s American television series Category:2010s American television series Category:English-language television programs",
 "title": "The Bad Girls Club"
}