{
 "id": "301096",
 "text": "The Bad Girls Club: New Orleans is the seventh season of the reality television series The Bad Girls Club. Filming began in February 2011 in Kenner, Louisiana and was originally scheduled to premier on July 11, 2011. The premier date was later changed to August 1, 2011. Becoming the second season to be filmed outside of the shows original filming location, season seven's theme is Mardi Gras. == Production == Oxygen confirmed that there will be a seventh season of The Bad Girls Club several weeks before the season finale for season six. The show was called \"Bad Girls Club Boot Camp\" but was later changed to \"Bad Girls Club: New Orleans\". Filming started in February 2011 in Kenner, Louisiana. Several weeks later, basketball coach Bryon Scott allowed production at his mansion. Tamithia Shaw, for Interim Code Enforcement (ICE), said \"[she] understands the [place] will be used for four months but that pre-production work apparently has been going on for two or three weeks\". She also said that the cast was not there. This began to cause an outrage from neighbors. The cast of season seven were asked to model for the \"House of Lounge lingerie\" at the New Orleans Fashion Week in March 2011. === Conflicts === On March 13, 2011, TMZ had announced that The Bad Girls Club were not allowed to be at eight clubs because the clubs did not want to be associated with the show's \"bad image\" (not a good reputation). Season seven's cast were also not allowed at a Mardi Gras party, hosted by Pierre Thomas. On April 12, 2011 Tasha Malek, one of the cast, had made a complaint about another cast member, Natasia Townsend. Malek told the local police that Townsend was removing her personal items into a garbage bag, while telling her that \"she needed to leave the house\". This statement outraged Malek as she and Townsend began a physical fight and wrestled to the floor. They were later given summons by the police for disturbing the peace and disorderly conduct. == Cast == On May 9, 2011 the following cast were confirmed. Bad Girl Age Hometown \"Bad Girl\" nickname Biography 21 Bronx, New York \"The Bronx Bombshell\" Angelic, better known as \"Angie\", is a cashier and a go-go dancer. 21 Olympia Fields, Illinois \"The Voodoo Vixen\" Judi, who is Louisiana Creole, was originally from Louisiana before she moved to Illinois when she became an adult. 23 Sacramento, California \"The Powerhouse\" Before entering the house, Nastasia was a \"shy little girl\" who had dreamed of owning a strip club. In the fourth episode, Nastasia told her roommates that she has a sister who is in prison. Nastasia believes this is the reason why she can deal with Judi - fearing that Judi might get locked up - Nastasia feels that she should help Judi make right decisions. 25 Staten Island, New York \"The Staten Island Spitfire\" Priscilla works at a fast food restaurant. 23 St. Louis, Missouri \"The Lady Killer\" Shelly works as a bartender in a gay nightclub. 23 Miami, Florida \"The Posh Princess\" Tasha, who is very close to her father, is wealthy and believes she should be treated as a queen. During the show, Tasha was always complaining that she is \"better than everyone else\" and that she has a better life. Some cast member tried to remove Tasha from the show, however, Nastasia succeeded this during the last few episodes of the season. 23 Houston, Texas \"The Goofy Gangsta\" Tiara, better known as \"Tracy\" (or spelled \"Traci\"), has a personality disorder. After the season was done filming, Tiara started her Signature Lipstick Collection called \"Boojie by Tiara\" (slang word for \"Rich by Tiara\") in the fall of 2011, with Yagolicious Cosmetics, who released the product. === Replacement Bad Girls === In every season of The Bad Girls Club, one or more \"bad girls\" will be asked to leave the house from producers because, of violence, fighting, or they will leave on their own because of stress or family problems. This then gives producers a chance at a new \"bad girl\" who arrives to the house a day or two to replace the \"bad girl\" who was removed. Bad Girl Age Hometown \"Bad Girl\" nickname Replaced http://coedmagazine.com/category/girls/a-to-z/cheyenne-evans/ 22 Round Rock, Texas \"The Texan Vixen\" Priscilla ''' == Timeline of cast == Bad Girls Season 7 episodes Episode 1 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 8 Episode 9 Episode 10 Episode 11 Episode 12 Season finale Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Angelic Judi Judi Judi Judi Judi Judi Judi Judi Judi Judi Judi Judi Judi Judi Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Shelly Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Tiara Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Nastasia Cheyenne Cheyenne Cheyenne Cheyenne Cheyenne Cheyenne Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Tasha Priscilla Priscilla Priscilla Priscilla Priscilla Priscilla Priscilla Priscilla Priscilla Priscilla === Notes === :Key: = \"Bad Girl\" appears on this episode. :Key: = \"Bad Girl\" leaves the house. :Key: = \"Bad Girl\" removed from the house. :Key: = \"Bad Girl\" replacement arrives. * Priscilla was removed from the house in episode 9 after fighting with Judi. * Cheyenne replaced Priscilla in episode 9. * Tasha was removed from the house in episode 12 after she scratched Nastasia on the face. * Cheyenne is kicked out of the house by Tiara in the season finale. She was tricked by her into thinking it was her time to leave the show. * Nastasia was removed from the house in the season finale after she had started to fight with Shelly. == Trivia == * In the next and eighth season, Angelic, Judi, Nastasia, Cheyenne, Shelly, Tasha and Tiara were replaced by Amy, Danielle, Demitra, Erica, Gabrielle, Gia and Jenna. == Episodes == Series # Title U.S. viewers (millions) Original air date == References == == Other websites == * * * Category:2011 in American television Category:2011 television seasons 7",
 "title": "The Bad Girls Club (season 7)"
}