{
 "id": "301098",
 "text": "Big Brother 13 is the 13th season of the American reality television series Big Brother. It premiered on July 7, 2011 on the CBS television network. The show is produced by Endemol USA and Fly on the Wall Entertainment. The 13th season was confirmed on the same day as the finale of Big Brother 12 in a press release issued from CBS. == Pre-season == Casting for Big Brother 13 began in mid-April. Applications and video tape submissions did not have a set deadline. Applicants chosen to be a finalist went to Los Angeles, California, from which applicants were narrowed down to a pool of 40 finalists. Casting calls were held around the United States on a later date. The cast has recently been selected, and they are now in sequester. == House == The house was revealed on June 27, 2011. It features a \"Venice Beach\" theme. With a Katy Perry themed room, a fortune teller/tarot card room and the backyard is of graffiti. == Houseguests == In the house tour that was exclusive to Yahoo, there was room for 14 houseguests on the picture wall. Name Age Occupation Hometown Adam Poch 39 Music Inventory Manager Hoboken, New Jersey Cassi Colvin 26 Model Nashville, Tennessee Dominic Briones 25 College Student/Model San Mateo, California Kalia Booker 30 Writer Los Angeles, California Keith Henderson 32 Human Resources Manager Bolingbrook, Illinois Lawon Exum 39 Legal File Clerk Inglewood, California Porsche Briggs 23 Cocktail Waitress Miami Beach, Florida Shelly Moore 41 Outdoor Industry Executive Prairieville, Louisiana Brendon Villegas 30 High School Swim Coach Riverside, California Rachel Reilly 26 Chemistry Graduate Student/VIP Cocktail Waitress Las Vegas, Nevada Jeff Schroeder 31 Advertising Salesman Norridge, Illinois Jordan Lloyd 22 Waitress Matthews, North Carolina Dick Donato 48 Website CEO Los Angeles, California Daniele Donato 25 College Student Huntington Beach, California Contestant's age at the start of the season. == Summary == On the first night, the houseguests were told of a surprise. They then were told that they had to pair up in groups of two. Before the HoH (Head of Household) competition, the houseguests were welcomed to three past dous. The first were Rachel and Brendon (from Big Brother 12). The second were Jordan and Jeff (from Big Brother 11). The last dous were Danielle and Dick (from Big Brother 8). During the HoH competition, the houseguests had to hold onto a banana. They were later squirted with chocolate and whip cream, while being rocked back-and- forth, to make the competition harder. Rachel then won the first HoH competition of the summer and her partner Brendon were safe from being evicted from the game. Host, Julie Chen, told the houseguests that Rachel had to choose only one dou. She was also told that only one of them would be evicted. However, the houseguest who wasn't eliminated can be safe until there are ten remaining houseguests. == Voting history == Color key: Voting history (season 13) Duos phase Individual phase Individual phase Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Week 7 Week 8 Week 9 Week 10 Day 49 Day 55 Day 63 Day 68 Day 75 Finale Head of Household Rachel Jordan Rachel Daniele Kalia Daniele Jeff Kalia Porsche Rachel Adam Rachel (None) Nominations (pre-veto) Keith Porsche Adam Dominic Adam Dominic Brendon Rachel Jeff Rachel Adam Shelly Kalia Porsche Jeff Rachel Jordan Rachel Kalia Porsche Jordan Porsche Adam Porsche Veto winner(s) Brendon Rachel Dominic Brendon Brendon Jeff Adam Jeff Porsche Rachel Adam Porsche (None) Nominations (post-veto) Keith Porsche Cassi Shelly Adam Dominic Brendon Jordan Lawon Rachel Brendon Shelly Daniele Kalia Jeff Rachel Adam Shelly Kalia Porsche Jordan Rachel Rachel Head of Household Cassi Head of Household Jordan Nominated Shelly Daniele Nominated Shelly Kalia Nominated Adam Winner Porsche Nominated Cassi Dominic Jordan Lawon Brendon Kalia Jeff Head of Household Nominated Jordan Nominated Adam Porsche Cassi Nominated Brendon Lawon Brendon Daniele Rachel Nominated Kalia Head of Household Evicted (Day 75) Porsche Jordan Keith Head of Household Dominic Nominated Lawon Brendon Daniele Rachel Shelly Porsche Nominated Evicted (Day 69) Rachel Kalia Keith Cassi Dominic Brendon Head of Household Brendon Nominated Jeff Adam Nominated Evicted (Day 67) Porsche Shelly Keith Nominated Dominic Brendon Lawon Nominated Kalia Jeff Nominated Evicted (Day 62) Rachel Jeff Keith Cassi Dominic Brendon Lawon Brendon Head of Household Nominated Evicted (Day 55) Rachel Daniele Keith Cassi Adam Head of Household Lawon Head of Household Nominated Evicted (Day 55) Porsche Brendon Keith Cassi Dominic Nominated Evicted (Day 34) Nominated Re-evicted (Day 48) Rachel Lawon Porsche Cassi Dominic Brendon Nominated Evicted (Day 41) Dominic Porsche Cassi Nominated Evicted (Day 27) Cassi Porsche Nominated Evicted (Day 20) Keith Nominated Evicted (Day 13) Dick Quit (Day 6) Evicted Keith 6 of 10 votes to evict Cassi 9 of 9 votes to evict Dominic 7 of 8 votes to evict Brendon 5 of 7 votes to evict Brendon into game Brendon 5 of 6 votes to evict Daniele 3 of 5 votes to evict Jeff 3 of 5 votes to evict Shelly 2 of 3 votes to evict Kalia 2 of 3 votes to evict Jordan Porsche's choice to evict Adam Rachel's choice to evict Rachel 4 votes to win Lawon 6 of 6 votes to evict Porsche 3 votes to win ;Notes == Twist == As revealed on ET Canada on June 28, 2011; Julie Chen revealed that Dynamic Duos of seasons past would have a major impact on this season and the twist. == References == == Other websites == *CBS Official Site *Global TV Official Site Category:2011 in American television Category:2011 television seasons Category:Big Brother seasons Category:American television seasons",
 "title": "Big Brother 13 (American season)"
}