{
 "id": "301152",
 "text": "Erwin Helfer (born January 21, 1936 in Chicago, Illinois) is an American boogie-woogie, blues and jazz pianist. ==Life== Erwin Helfer was born in Chicago and grew up there. In his younger life he was more interested in classical music than in blues. But grewing up in the 50s he got contact to blues anyway. He studied music at Tulane University in New Orleans, completing college with a degree in music. In New Orleans he studied also the local music style of the city. He started his professional career with Estelle Yancey, who asked him to play with him. This was the beginning of a life long friendship.He was also mentored and influenced by Cripple Clarence Lofton, Speckled Red, and Sunnyland Slim. In the 1960s and 1970s he played with Jimmy Walker.Erwin Helfer at All about Jazz In 1982 he started his own record label, Read Bean. There he released albums of Estelle Yancey, Blind John Davis, Johnny \"Big Moose\" Walker and other Chicago blues artists. He was nominated for Blues Music Awards in 2003, for 'Comeback Blues Album of the Year', for his CD I'm Not Hungry But I Like To Eat - Blues. He still plays at different blues- and jazzfestivals all over the world.(Chicago Jazz Festival, 2005–2007; Hungary's Debrecen Jazz Festival, 2005, the Chicago Blues Festival, in June 2010, and all the years in Chicago's blues clubs.) ==Discography== ===own albums=== *1974 Blues, Boogie Woogie Piano Duets & Solos Flying Fish *1976 Boogie Piano Chicago Style Big Bear *1979 On the Sunny Side of the Street Flying Fish *1987 Chicago Piano Red Beans *2001 I'm Not Hungry but I Like to Eat - Blues Sirens *2003 St. James Infirmary (mit Skinny Williams) Sirens *2005 Careless Love The Sirens Records ===as sideman=== *Mama Estella Yancey Maybe I'll Cry (1983) *Howard & the White Boys Strung Out on the Blues (1995) *8 Hands on 88 Keys: Chicago Blues Piano Masters (2002) *Heavy Timbre: Chicago Boogie Piano (2002) *Barrelhouse Chuck Prescription for the Blues (2002) *Ella Jenkins Sharing Cultures with Ella Jenkins (2003) *Barrelhouse Chuck Chicago Blues Piano, Vol. 2 (2007) *Andrew Calhoun Bound to Go (2008) CD Universe ==References== Category:Blues pianists Category:American jazz pianists Category:1936 births Category:Boogie Woogie pianists Category:Chicago blues musicians Category:Musicians from Chicago Category:Living people",
 "title": "Erwin Helfer"
}