{
 "id": "301127",
 "text": "Copy editing, or sub-editing, is about making written ideas better to read. The word 'copy' refers to written or typewritten text. It is done by an editor. When copy-editing, the writing is changed to be more readable & accurate — it is made easier to read and more correct. Copy-editing can include changing the: * Grammar & punctuation * Writing style — the way in which it is written. * Format — the way in which the writing is arranged. * Facts (if wrong). == The editing process == Copy editing is commonly done before typesetting and proofreading in the editing process. Proofreading is the last step. == Related names and titles == In the United States and Canada, an editor who does this work is called a copy editor, and an organization's highest-ranking copy editor, or the supervising editor of a group of copy editors, may be known as the copy chief, copy desk chief, or news editor. === Sub-editor === In book publishing in the United Kingdom and other parts of the world that follow UK nomenclature, the term 'copy editor' is also used, but in newspaper and magazine publishing, the term is 'sub-editor' and commonly shortened to 'sub' or 'subbie'. As the 'sub' suggests, UK copy editors usually have less authority than regular editors. 'Editors' in book publishing generally have a responsibility for choosing authors and titles which will make for good sales. In magazines and newspapers they are executives, responsible for the business success of the enterprise. ==== The work of a sub-editor ==== According to experienced editors, the main things a sub-editor does are: Evans, Harold 1972/4. Editing and design. vol 1. Newsman's English; vol 2. Handling newspaper text. Heinnemann, London.Sellars, Leslie 1968. The simple subs book. Pergamon, Oxford. #To make sure readers can understand the text. The text should be, as far as possible, easy to read and interesting #To make sure that anything checkable is checked. #To make sure any requirements are met, such as length and house style. #To write instructions for how the copy should be organised in print. #Writing headlines and proofreading may be done, according to the organisation. Above all, the sub should \"approach every story from the point of view of the reader\".p6 == References == Category:Writing Category:Publishing",
 "title": "Copy editing"
}