{
 "id": "301290",
 "text": "Andrew Fetterly Wilkes Krier (born May 9, 1979 in Stanford, California), better known by his stage name, Andrew W.K., is an American rock musician. He married his ex-wife, Cherie Pourtabib (who is also known as Cherie Lily). His song \"Party Hard\" is one of his most famous songs. ==Discography== === Studio albums === * I Get Wet (2001) * The Wolf (2003) * Close Calls with Brick Walls (2006) * The Japan Covers (2008) * 55 Cadillac (2009) * Gundam Rock (2009) * You're Not Alone (2018) * God Is Partying (2021) ===EPs=== Year Album 1991 AWKGOJ 1999 Party Til You Puke 2002 The \"Party All Goddamn Night\" EP ==Filmography== Year Title Role Notes 2012 I Spill Your Guts Crazy Hobo 2013 Cool as Hell Andrew 2015 Dude Bro Party Massacre III Rip Stick 2016 Midnight Show Theater voice 2017 (Romance) in the Digital Age Himself 2020 Your Friend Andrew W.K. Himself Documentary ==Television== Year Title Role Notes 2002 Jackass Backyard BBQ Himself TV special 2004 Your Friend, Andrew WK Himself Host 2006 Aqua Teen Hunger Force Himself Episode: \"Party All the Time\", voice role 2006 I Love the New Millennium Himself Commentator, 8 episodes 2010 Food Party Santa Episode: \"Zit Butter\" 2011 Destroy Build Destroy Himself Host, all episodes 2011 Mad Himself Episode: \"Kung Fu Blander/Destroy, Bob the Builder, Destroy\", voice role 2012 Let's Big Happy Episodes: \"Pilot\" and \"Andrew W.K.\" 2015 Uncle Grandpa Himself Episode: \"Shower Party\", voice role 2016 Idiotsitter Kerry Episode: \"GED Prom\" 2021 American Dad Palmer Episode: \"The Wondercabinet\" ==Video games== Year Title Role Notes 2003 Madden NFL 2003 Soundtrack artist Madden NFL 2003 Soundtrack, Party Hard 2003 Nascar Thunder 2004 Soundtrack artist NASCAR Thunder 2004, Tear it Up 2004 Backyard Wrestling 2: There Goes the Neighborhood Himself 2009 Pro Evolution Soccer 2010 Soundtrack artist Pro Evolution Soccer 2010 Soundtrack, Party Hard 2016 Fallout 4: Nuka-World RedEye DLC == References == ==Other websites== * Andrew W.K.'s Official website Category:1979 births Category:Living people Category:American rock musicians Category:Singers from California Category:Musicians from California Category:Multi-instrumentalists Category:People from Stanford, California",
 "title": "Andrew W.K."
}