{
 "id": "301289",
 "text": "Albert \"Sunnyland Slim\" Luandrew (September 5, 1907 – March 17, 1995) was an American blues pianist from the Mississippi delta. He later went to Chicago where he became one of the most important piano players in Chicago's blues scene. Sunnyland Slim was one of the most important persons in Chicago blues history, but he really never became a star because he did most of his work as sideman. ==Life== He was born on a farm near Vance, Mississippi. He taught himself to play piano and organ and began playing in a local church when he was 14. Soon played in juke joints in the whole delta area.All Music Guide biography by Bill Dahl In 1925 he went to Memphis, Tennessee where he played with local musicians like Little Brother Montgomery and Ma Rainey. There he also got his stage name writing a song about the Sunnyland train which ran between Memphis and St. Louis, Missouri.Russell, Tony (1997). The Blues - From Robert Johnson to Robert Cray. Dubai: Carlton Books Limited. pp. 171. . In 1942 he went to Chicago. As the electric blues began Sunnyland Slim played with blues musicians like Muddy Waters, Howlin' Wolf, Robert Lockwood, Jr., and Little Walter. Muddy Waters partially owed his recording career at Chess Records to Sunnyland Slim who introduced him to the Chess brothers at his own birthday party. His first recording was as a singer with Jump Jackson's band on the Specialty label in September 1946 and his first recording as band leader was in 1947. Between 1948 and 1956 he recorded for Hytone, Opera, Chance, Tempo-Tone, Mercury, Apollo, JOB, Regal, Vee-Jay (unissued), Blue Lake, Club 51, Cobra. In 1988 he was awarded a National Heritage Fellowship. He went on touring and recording till his death in 1995. ==Discography== * 1969 Midnight Jump Beat Goes On * 1969 Slim's Got His Thing Goin' on Sequel * 1969 Slim's Shout Prestige/Original Blues Classics * 1971 Depression Blues Festival Records * 1973 Plays Ragtime Blues BluesWay * 1975 Sunnyland Slim & Little Brother Montgomery 77 Records * 1977 She Got That Jive Airway Records * 1979 Patience Like Job Airway Records * 1986 Chicago Jump Evidence * 1989 Be Careful How You Vote Earwig * 1991 Live in Europe Airway Records * 1994 Decoration Day Evidence * 1994 Chicago Blues Sessions Southland (Select-O- Hits) * 1995 Live at the D.C. Blues Society Mapleshade Records * 1995 Sunnyland Train Evidence * 1998 She Got a Thing Goin' On Blind Pig * 1999 Smile on My Face Delmark * 2006 Blues Legends Live Mapleshade Records ==References== Category:Blues musicians Category:Blues pianists Category:1907 births Category:1995 deaths Category:Boogie Woogie pianists Category:Chicago blues musicians Category:Musicians from Mississippi",
 "title": "Sunnyland Slim"
}