{
 "id": "301349",
 "text": "Marcus Claudius Tacitus (–July 276) was Roman emperor from 275 to 276 AD. == Early life == Tacitus () was probably born around 200. He may have come from Interamna (Terni, Italy). Tacitus was a politician from the Roman nobility. He was a member of the Roman Senate. He may have been the leader of the senate (). Some time before 273, long before he was emperor, Tacitus was Roman consul. On his way east in September 275 (or possibly in October), the emperor Aurelian was murdered by his own soldiers in Roman Thracia. Aurelian's wife, the augusta Ulpia Severina, may have been in control of the government until Tacitus became emperor. == Emperor == The Greek historian Zonaras wrote that the Roman army chose Tacitus as their emperor. This happened in about November or December 275, while Tacitus was in Campania. The Historia Augusta (a Latin history) says that the Roman Senate chose Tacitus as their emperor. This is probably not correct. Tacitus was Roman consul for the second time in 276. Tacitus travelled to Asia Minor that year. In the same year, his armies overcame the Goths in a war. In early summer 276 Tacitus got the name because of his success against the Goths. == Death == Tacitus probably died in July 276. The Historia Augusta says that Tacitus was murdered at Tyana in Cappadocia (Kemerhisar, Turkey). The Historia Augusta also says that Tacitus had a cenotaph at Interamna (Terni, Italy). Tacitus was not deified (made into a god) but neither did he get damnatio memoriae. == Family == The Historia Augusta says that Tacitus had a half-brother, Florianus. Tacitus and Florian had the same mother, but different fathers. This information may not be correct. The Historia Augusta says that Tacitus had a wife and a number of sons. Their names are unknown and this information may not be correct. The Historia Augusta says that the emperor Marcus Claudius Tacitus was from the same family as the Latin historian Cornelius Tacitus. (The historian Tacitus lived in the 1st century AD.) The Historia Augusta is not correct. In truth, the two men were not from the same family. The Historia Augusta also says that the emperor Tacitus's full name in . This is also not correct. In truth, the emperor's name was . == References == Category:200 births Category:270 deaths Category:3rd-century Roman emperors Category:Assassinated Roman politicians",
 "title": "Marcus Claudius Tacitus"
}