{
 "id": "301332",
 "text": "Banded iron formations (or BIFs) are a distinctive type of rock often found in Precambrian sedimentary rocks. They consist of repeated thin layers of iron oxides, either magnetite (Fe3O4) or hematite (Fe2O3), alternating with bands of iron-poor shale and chert. Some of the oldest known rock formations, formed over 3,700 million years ago (mya), include banded iron layers.Minik T. Rosing et al. 1996. Earliest part of Earth's stratigraphic record: A reappraisal of the >3.7 Ga Isua (Greenland) supracrustal sequence. Geology 24 #1, 43-46 The banded layers are a common feature in sediments for much of the Earth's early history.Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton, N.J. Faces of Earth - Building the Planet. YouTube account of early Earth history. American Geosciences Institute. == Relation to atmospheric oxygenation == The formations are abundant around the time of the Great Oxygenation Event, 2,400 mya.Cloud, Preston 1973. Paleoecological significance of the Banded Iron-Formation. Economic Geology 68 (7): 1135. doi:10.2113/gsecongeo.68.7.1135. They become less common after 1,800 mya. The total amount of oxygen locked up in the banded iron beds is estimated to be perhaps twenty times the volume of oxygen present in the modern atmosphere of Earth. Banded iron beds are an important commercial source of iron ore, such as the Pilbara region of Western Australia, the Animikie Group in Minnesota and Carajás Mineral Province in Brazil.DOCEGEO, 1988, Revisão litoestratigráfica da Província Mineral de Carajás: Congresso Brasileiro de Geologia, 35th, Sociedade Brasileira de Geologia, Belém, Brazil, p. 11−54. ==Origins== The conventional concept is that the banded iron layers were formed in sea water as the result of oxygen released by photosynthetic cyanobacteria. This combined with dissolved iron in Earth's oceans to form insoluble iron oxides. These precipitated out, forming a thin layer on the substrate, which may have been anoxic mud (forming shale and chert). Each band is similar to a varve: the banding is assumed to result from cyclic variations in available oxygen. It is assumed that the Earth started out with vast amounts of iron dissolved in the world's acidic seas.Cesare Emiliani, Planet Earth 1992:407f, and Tjeerd van Andel, New Views on an Old Planet 2nd ed. 1994:303-05. Iron is much more soluble than its oxides. Eventually, as photosynthetic organisms generated oxygen, the available iron in the Earth's oceans was precipitated out as iron oxides. At the tipping point where the oceans became permanently oxygenated, small variations in oxygen production produced pulses of free oxygen in the surface waters, alternating with pulses of iron oxide deposition. == References == Category:Geological formations Category:Sedimentary rocks Category:Iron compounds Category:Ores",
 "title": "Banded iron formation"
}