{
 "id": "301395",
 "text": "The Palaeoproterozoic was the first era of the Proterozoic eon. It came after the Archaean eon, and lasted from 2500 to 1600 million years ago (mya). In the Palaeoproterozoic, there was a huge production of stromatolites by cyanobacteria. The first unicellular eukaryote organisms also appeared in the fossil record. The first supercontinent grew, and some of the rocks were normal sedimentary rocks, not metamorphosed. == Basic differences in Earth physics == Because the Earth was only half as old as now, there were some basic differences from today. Heat in the Earth's interior was greater than today. This was mainly due to the higher abundance of radioactive isotopes, which decay as time passes. Temperatures at the surface were also higher, due to radiation from the Earth's interior, and due to a methane and carbon dioxide-based greenhouse atmosphere. During the previous eon, the Archaean, the oceans were hot (55–85 °C). This was only partly balanced by the fact that the Sun's radiation was lower at that time. Paleontological evidence on the Earth's rotational history suggests that ~1.8 billion years ago, there were about 450 days in a year, implying 20 hour days.Giorgio Pannella 1972. Paleontological evidence on the Earth's rotational history since early precambrian Astrophysics and Space Science 16.2 p212 Further back, the Earth day had about 17 hours, and there were 514±33 days per year. The Earth–Moon distance for the earliest Palaeoproterozoic was 51.9±3.3 Earth radii (compared to 60.27 at present).Williams G.E. 2000. Geological constraints on the Precambrian history of Earth's rotation and the moon's orbit. Reviews of Geophysics 38:37–59. == Supercontinent == A global supercontinent (called Columbia, or Nena) existed from about 1.8 to 1.5 billion years ago in the Palaeoproterozoic era.Rogers J.J.W. and Santosh M. 2002. Configuration of Columbia, a Mesoproterozoic supercontinent. Gondwana Research. 5, 5-22 == Climate == During the era climate changes were as severe as any in Earth history. From a global high temperature at the start, there were three massive ice ages, with ice deep into the tropics.Reddy S.M. and Evans D.A.D. 2009. Palaeoproterozoic supercontinents and global evolution: correlations from core to atmosphere. Geological Society. 203, 1–26. === Drop in methane === There are clear indications that the era saw a drop in atmospheric methane: :\"The collapse of methane from formerly high levels in the Archaean atmosphere probably plays a large role, not only the oxygenation history, but also the occurrence of Palaeoproterozoic ice ages. The data point to 2.4–2.3 billion years ago as host to a ‘Great Oxidation Event’,Cloud P.E. 1968. Atmospheric and hydrospheric evolution on the primitive Earth. Science 160:729–736.Holland H.D. 2006. The oxygenation of the atmosphere and oceans. Philosophical Transactions of the Royal Society B: Biological Sciences 361:903–915. during which Earth's surface environment changed profoundly and irreversibly\". === The buildup of oxygen === Oxygen was produced by the cyanobacteria, but it was mostly used up by chemical sinks. These were the unoxidized sulfur and iron. Until roughly 2.3 billion years ago, oxygen was probably only 1% to 2% of its current level.Stanley, Steven M. 1999. Earth system history. New York: W.H. Freeman. .p323 Banded iron formations, which provide most of the world's iron ore, were formed by the oxygen forming compounds with iron; most accumulation ceased after 1.9 billion years ago. Red beds, which are colored by hematite, indicate an increase in atmospheric oxygen after 2 billion years ago; they are not found in older rocks.p324 === Ice ages === There were three major ice ages, with ice deep into the tropics.Evans D.A., Beukes N.J., Kirschvink J.L. 1997. Low-latitude glaciation in the Palaeoproterozoic era. Nature 386:262–266. Undoubtedly, they happened as a result of reduced greenhouse gases in the atmosphere, and the rise of oxygen production. There is what researchers call \"a puzzling interval of ~1,400 million years with no verified glaciation between early Palaeoproterozoic glaciations at 2400–2200 mya in North America, South Africa, Scandinavia and Australia and the Neoproterozoic glaciations that affected all continents at 800–600 mya\".Williams G.E. 2005. Subglacial meltwater channels and glaciofluvial deposits in the Kimberley Basin, Western Australia: 1.8 Ga low-latitude glaciation coeval with continental assembly. Journal of the Geological Society 162:111–124. === Meteorite strikes === There were major bolide impacts during the era, two of which caused the largest impact crators on Earth.Grieve R. and Therriault A. 2000. Vredefort, Sudbury, Chicxulub: three of a kind? Annual Review of Earth and Planetary Sciences 28:305–338. There are also three smaller (equal or more than 30 kilometers diameter) in the time zone of 3.0 to 1.2 billion years ago. == Origin of eukaryotes == The origin of the eukaryotic cell was a milestone in the evolution of life, since they include all complex cells and almost all multi-cellular organisms. The timing of this series of events is hard to determine; Knoll suggests they developed approximately 1.6–2.1 billion years ago.Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton University Press. Some acritarchs are known from at least 1650 million years ago, and the possible alga Grypania has been found as far back as 2100 million years ago. == References ==",
 "title": "Palaeoproterozoic"
}