{
 "id": "301701",
 "text": "Trichomoniasis (often called trich) is a sexually transmitted disease. It is caused by a parasite called Trichomonas vaginalis, which is a protozoa made of just one cell. Trichomoniasis can affect both men and women. It is usually an infection of the urinary system and genitals. ==Cause== The Trichomonas vaginalis parasite can only live in the human genital tract. Trichomoniasis is only spread through sex, or if two people's genitals touch. ==Signs and symptoms== Most people with trichomoniasis do not have any symptoms. When people do have symptoms, they usually start about 5 to 28 days after the person got infected. Symptoms may include:Trichomoniasis symptoms . cdc.gov * Pain, burning, or itching in the urethra (urethritis), the vagina (vaginitis), or the penis * Pain while having sex (dyspareunia) * Women may have a yellow- green, badly-smelling vaginal discharge * Lower abdominal pain (this does not happen often) ===Complications=== Complications are serious problems that can happen because a person has a disease. These problems do not happen to everyone with trichomoniasis. They are the most serious problems that trichomoniasis can cause. Some of the most dangerous problems that can happen to a person with trichomoniasis include: * People with trichomoniasis are more likely to get (or spread) HIV, the virus that causes AIDS. * If a woman is pregnant, trichomoniasis can cause her to have a premature infant, or an infant that weighs less than normal. * Trichomoniasis may work together with human papillomavirus (HPV) to cause cervical cancer, although this has not been proven. * In men, trichomoniasis can cause inflammation (swelling) of the urethra and the prostate. In the prostate, trichomoniasis may create chronic (long-term) inflammation that may eventually cause prostate cancer. ==Treatment== Treatment for trichomoniasis is usually metronidazole (Flagyl), which kills protozoa like Trichomonas vaginalis.Vaginitis/Trichomoniasis :Treatment for trichomoniasis , American Social Health Association. Retrieved March 12, 2008. However, this medication has to be used carefully with woman who are in the early stages of pregnancy. Anyone the infected person has had sex with should also get treatment, even if they have no symptoms. About 95% to 97% of people with trichomoniasis are cured after one dose of metronidazole. Without treatment, trichomoniasis can stay in a woman's body for months to years. In many (but not all) men, it seems to go away on its own. ==Prevention== Trichomoniasis can be prevented by having safe sex (for example, by using condoms).Vaginitis/Trichomoniasis :Reduce your risk , American Social Health Association. Retrieved March 12, 2008. The United States Centers for Disease Control and Prevention (CDC) suggests that women who are having vaginal discharge should get tested for trichomoniasis.Workowski KA, Berman S. \"Sexually transmitted diseases treatment guidelines, 2010\" MMWR Recomm Rep 2010;59(RR-12):1–110. ==How common is trichomoniasis?== Trichomoniasis is the most common sexually transmitted disease in the world that is not caused by a virus. Every year, about 248 million more people get trichomoniasis.World Health Organization. Prevalence and Incidence of Selected Sexually Transmitted Infections, Chlamydia trachomatis, Neisseria gonorrhoeae, syphilis and Trichomonas vaginalis: Methods and Results Used by WHO to Generate 2005 Estimates. 2011. Available at: http://whqlibdoc.who.int/publications/2011/9789241502450_eng.pdf .World Health Organization, Department of Reproductive Health and Research. Global incidence and prevalence of selected curable sexually transmitted infections – 2008. Geneva, Switzerland; 2008. It is more common in women than men. It is also the most common non-viral sexually transmitted disease in the United States. In the U.S., about 3.7 million people have trichomoniasis, and about 1.1 million more people get infected every year.Centers for Disease Control and Prevention, National Center for HIV/AIDS, Viral Hepatitis, and TB. Division of STD Prevention. Trichomoniasis - CDC Fact Sheet. 2012. Recent research has said that 3% of the U.S. population (3 in every 100 people) have trichomoniasis. In people who are at higher risk of getting trichomoniasis, like people with HIV and people in prison, between 7.5% to 32% are infected.Freeman AH, Katz KA, Pandori MW, et al. Prevalence and correlates of Trichomonas vaginalis among incarcerated persons assessed using a highly sensitive molecular assay. Sex Transm Dis. 2010;37(3):165–168. ==Related pages== * Sexually transmitted disease * Safe sex * Parasite ==References== Category:Sexually transmitted diseases",
 "title": "Trichomoniasis"
}