{
 "id": "301781",
 "text": "Netherlands Antilles at the Olympics is a history which began in 1931. The International Olympic Committee's official abbreviation for the region of the Netherlands Antilles was NAN. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-8-16. It is now AHO.\"Abbreviations, National Olympic Committees,\" 2009 Annual Report, p. 90 [PDF p. 91 of 94]; retrieved 2012-10-12. ==History== Athletes from the Netherlands Antilles have been in most Summer Olympic Games since then. The nation supported the Netherlands' boycott of the 1956 Games and the American- led boycott of the 1980 Summer Olympics. The Netherlands Antilles has been in the Winter Olympic Games two times. The National Olympic Committee for the Netherlands Antilles was formed in 1931 and recognized by the International Olympic Committee in 1950. At the 2012 Summer Olympics, three athletes from the region of the Netherlands Antilles competed under the flag of the IOC. \"London 2012: Refugee runs for world, family walk 50km to watch,\" NDTV (New Delhi Television), 11 August 2012; retrieved 2012-8-16. ==List of medalists== As of 2008, Jan Boersma is the only Netherlands Antillean athlete to win an Olympic medal, a silver medal in sailing. Churandy Martina finished second, behind Usain Bolt but was disqualified after an American led protest that Martina ran out of his lane during the race.Martina's bid to reclaim silver rejected, ESPN.com, March 6, 2009. Medal Name Games Sport Event Jan Boersma 1988 Seoul Sailing Men's sailboard ==Dissolution of the Netherlands Antilles== The Netherlands Antilles Olympic Committee has continued to exist as the umbrella body for sports on the five islands after the dissolution of the Netherlands Antilles. The five islands will continue to be in the Olympic Games under the \"Netherlands Antilles\" name, but as a region in the Caribbean rather than a political entity. The International Olympic Committee (IOC) approved this in June 2007. ==Related pages== * List of IOC country codes ==References== ==Other websites== * Netherlands Antilles at BBC Category:Former nations at the Olympics Category:Netherlands Antilles",
 "title": "Netherlands Antilles at the Olympics"
}