{
 "id": "301785",
 "text": "Panama at the Olympics is a history which includes 16 games in 14 countries and 70+ athletes.SportsReference.com (SR/Olympics), Panama ; retrieved 2012-10-12. Since 1928, Panama has contributed to the growth of the \"Olympic Movement\".Olympics.org, \"Factsheet: The Olympic Movement\"; retrieved 2012-10-12. The International Olympic Committee's official abbreviation for Panama is PAN. ==History== A team from Panama was first at the 1928 Summer Olympics. They have been in 12 Summer Olympic Games, but none of the Winter Olympic Games. ==List of medalists== Medal Name Games Sport Event 1948 London Athletics Men's 100m 1948 London Athletics Men's 200m 2008 Beijing Athletics Men's long jump ===Olympic Medal Table=== Games Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Athletes by sport Medals Medals Medals Games Amsterdam 1928 1 - - - - - - 0 0 0 Los Angeles 1932 did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete Berlin 1936 did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete London 1948 1 - - - - - - 0 0 2 Helsinki 1952 1 - - - - - - 0 0 0 Melbourne 1956 did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete Rome 1960 1 - - - - - - 0 0 0 Tokyo 1964 1 - - - - - - 0 0 0 Mexico City - 2 12 2 - - - 0 0 0 Munich 1972 - - - - - - - 0 0 0 Montreal 1976 1 2 - 2 - 1 3 0 0 0 Moscow 1980 did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete did not compete Los Angeles 1984 2 2 - 2 - - 1 0 0 0 Seoul 1988 - - - - - - 1 0 0 0 Barcelona 1992 1 - - - - - 1 0 0 0 Atlanta 1996 1 - - - - - 2 0 0 0 Sydney 2000 1 1 - - - - 2 0 0 0 Athens 2004 2 - - - - - 2 0 0 0 Bejiing 2008 2 - - - - - 2 1 0 0 ==Related pages== * List of IOC country codes ==References== ==Other websites== * Panama profile at London2012.com Category:Nations at the Olympics Category:National sports teams of Panama",
 "title": "Panama at the Olympics"
}