{
 "id": "301931",
 "text": "Phyllobates is a group of frogs with poison in their skin. They live in Central America and South America, from Nicaragua to Colombia. There are three different Colombian species of Phyllobates. They have strong poison. The most poisonous frog in the world is in Phyllobates: The golden poison frog (P. terribilis). All the frogs in Phyllobates have bright colors on their skins. This tells other animals not to eat the frog, even though some of them do not have poison. Native South Americans use Phyllobates frogs to put poison on the tools they use to hunt animals for food. The frogs' poison is made of alkaloids molecules, and the frogs make them in glands in their skins. The strongest poison is batrachotoxin.Daly, J.W. (1995). The chemistry of poisons in amphibian skin. Proceedings of the National Academy of Sciences 92: 9-13. == Name == Phyllobates is Ancient Greek for \"leaf climber.\" ==Groups== Scientists used to say that Phyllobates had many more frogs, but they moved some of them to Ranitomeya. However, it now just contains those six members within the Phyllobates bicolor species group. These are: Group Image Common name Scientific name Distribution P. lugubris species group Lovely poison frog Phyllobates lugubris (Schmidt, 1857) southeastern Nicaragua through Costa Rica to northwestern Panama Golfodulcean poison frog Phyllobates vittatus (Cope, 1893) Costa Rica. P. bicolor species group black-legged poison frog Phyllobates bicolor (Duméril and Bibron, 1841) Chocó area in western Colombia Kokoe Poison Frog Phyllobates aurotaenia (Boulenger, 1913) Pacific coast of Colombia Phyllobates sp. aff. aurotaenia Golden poison frog Phyllobates terribilis (Myers, Daly, and Malkin, 1978) Pacific coast of Colombia. Every species in Phyllobates can be different colors. Frogs can be in the same species and look different. These are called color morphs. For example, P. terribilis frogs come in color morphs called \"mint,\" \"yellow,\" or \"orange.\" P. vittatus, another example, always has black skin, but its stripes can be yellow, orange, or red, wide or narrow. Its legs can be blue or green. The bicolor dart frog (Phyllobates bicolor) can be yellow to orange, from black legs to green legs. P. aurotaenia can be yellow-banded or orange. They are always smaller than P. vittatus, so people tell them apart by which frog is bigger instead of by color. ==Poison== Scientists have only found the batrachotoxin poison in wild frogs. Frogs that live with humans stop making poison. Scientists think the frogs need to eat wild foods to make the poison. Some beetles in Papua New Guinea also have batrachotoxin poison. == See also == *Allopumiliotoxin 267A *Pumiliotoxin 251D == References == * * * Category:Frogs of South America",
 "title": "Phyllobates"
}