{
 "id": "301955",
 "text": "==Greek/Roman gods== * Zeus/Jupiter - King of the Gods, God of the Sky, Zeus is brother to Poseidon and Hades, uncle to Percy, father of Thalia, son of Kronos. His Roman counterpart is Jupiter, brother to Pluto and Neptune, and father to Jason. He is a principal character in the first book but takes on a smaller role throughout the duration of the following four. His children's cabin at Camp Half-blood is cabin #1. Zeus is often called dramatic by his brother Poseidon, saying that he might do better as the God of Theater. His symbol of power is his Master Bolt, stolen in The Lightning Thief, In The Lost Hero, Zeus (under the influence of Khione) forbids contact between gods and mortals, and closes down Olympus. Despite this, Zeus indirectly aids the demigods several times on their quest, such as answering his son's prayer for aid against Enceladus.Riordan, Rick. The Lost Hero. Disney Hyperion Books, 2010, p. 498. * Hera/Juno - Hera is the Queen of the Gods and the Goddess of Marriage. Hera plays a small role in The Titan's Curse and is one of the gods who help with Annabeth's quest in The Battle of the Labyrinth. She especially dislikes Annabeth and curses her like how Ares cursed Percy in the 1st book. She thought Luke, Pan and Daedalus were better off gone. Cabin 2 at Camp Half- Blood is dedicated to her, but is perpetually empty; as the goddess of marriage, she has not given birth to any demigods. In spite of this, Hera meddles with the affairs of many demigods. In The Last Olympian she has a minor role where she congratulates Percy on his victory rather disdainfully and says that she would have to let him and Annabeth live a little longer. She returns as Juno in The Lost Hero in which Percy Jackson has disappeared. She has been kidnapped by Gaea and contacts Jason Grace, the new protagonist and asks him to help her. It is then revealed that as Juno, she snuck out of Olympus and exchanged Percy and Jason to try and unite the Roman and Greek demigods. She goes against the wishes of Zeus in this regard because she wants to save the gods, demigods and mortals from the new evil. Juno also admits that she is bitter towards heroes and demigods because she does not have any of her own. Juno, Hera's Roman counterpart, is more warrior-like and more disciplined and rebellious. Juno even states that Hera would not have disobeyed Zeus, but Juno would.Riordan, Rick. The Lost Hero. Disney Hyperion Books, 2010, p. 272. * Aphrodite/Venus - Aphrodite is the Goddess of Love and Beauty. She is mentioned in The Lightning Thief and appears briefly in The Titan's Curse. Her children reside in Cabin 10 at Camp Half-blood. She is often shown wearing a red satin dress with her hair in long dark-brown waves, although her appearance is shown to change as Percy looks at her, matching every female he has ever had a crush on (one being Annabeth). She encourages Percy to pursue a quest for true love, and she is shown to have interest in Percy's feelings towards Annabeth and promises to make Percy's love life difficult. She appears again at the Council of the Gods and votes to let Percy live. Aphrodite is the last child of Ouranos. Aphrodite is also the mother of Piper McLean, one of the main characters in The Lost Hero, and changes her daughter's tomboyish appearance twice to make her more beautiful.Riordan, Rick. The Lost Hero. Disney Hyperion Books, 2010, p. 133, 437. * Apollo - Apollo is the God of the Sun. The campers in Cabin 7 are his children. He drives a flying red convertible, a Maserati Spyder, that glows brightly like the sun. He appears to be about 18 or 19 years old and has sandy colored hair and dazzling white teeth. Apollo wears Ray-Ban sunglasses and sports an iPod. Percy notes that he looks similar to Luke, but less evil. He also loves to recite poetry, especially haikus; Percy describes them as so bad that he would rather be shot by an arrow than listen to one, but Zoe says his limerick days were much worse. Apollo helps Percy and his friends by flying them to Camp Half-Blood in The Titan's Curse and later speeding up a train while being disguised as a homeless man. In The Last Olympian, he heals Annabeth's broken arm after she was thrown into her mother's throne. Apollo is also the god of prophecy and controls the Oracle. At the end of the war between the Titans and the gods, Rachel is certified as the new Oracle by Apollo. His name is both Greek and Roman. * Ares/Mars - The God of War and Bloodlust. His children are the campers in Cabin 5. He first encounters Percy in The Lightning Thief. Ares drives a large, black, Harley-Davidson motorcycle with a flame-pattern paint job, a boar themed antenna, handles, boars head shaped red headlight and a leather seat made from human skin. He wears red wraparound sunglasses that cover his eyes, which are flames, a bulletproof vest, combat boots, black leather biker clothes, and a black leather duster. His face is covered with scars from many fights. Once, Ares sends Percy, Grover and Annabeth to retrieve his shield, which he left behind after a date with Aphrodite. They travel to a Tunnel of Love, which ends up being a trap set by Hephaestus. He intercepts Zeus's master bolt from Luke in The Lightning Thief and gives Percy a backpack containing it. He wants to cause discord among Zeus, Poseidon and Hades. Later, he is overpowered by Percy in a duel. He curses Percy that his sword will fail him in battle and departs. Ares returns with minor roles in The Sea of Monsters and The Titan's Curse. He is seen at the end of The Last Olympian after giving Clarisse a blessing during battle and is very proud of her. * Artemis/Diana - The Goddess of the Moon, Wild Animals, and the Hunt. She is the twin sister of Apollo. Cabin 8 at Camp Half-Blood is dedicated to her, though it is unoccupied, except for the rare visits when her group of huntresses stays at the camp, such as in The Titan's Curse. She is a maiden goddess and bears no demigod children. She has a prominent role in The Titan's Curse. Artemis appears to be about 12 years old. She has auburn hair and silvery-yellow eyes, the color of the full moon. Artemis leads a group of teenaged girls known as the Hunters of Artemis. The Hunters pledge to give up love in exchange for immortality. The Hunters never grow up and can only die if they are killed in battle or break their oath. Artemis leaves the Hunters to pursue a monster that has the potential to destroy Olympus. She is trapped by Atlas and is forced to hold up the sky. She is rescued by Percy who holds the sky for her so she can fight Atlas. Artemis and Percy trick Atlas into holding the sky again. Artemis transforms Zoe into a constellation after she is killed in battle. She seems to like Percy, saying that he's okay for a boy, and later refers to him as a man. She speaks up for Percy, Annabeth and Thalia at the Council of the Gods and votes for Percy to live. Thalia joins her hunt at the end of The Titan's Curse, preventing her from fulfilling the Oracle's prophecy. Artemis did not follow Zeus' order to not have contact with mortals by still communicating with her Hunters. Thalia states, \"Artemis follows her own rules,\" even though she does this without Zeus' knowledge. She sent Thalia to find Jason, her long-lost brother.Riordan, Rick. The Lost Hero. Disney Hyperion Books, 2010, p. 393. * Athena/Minerva - The Goddess of Wisdom and Battle Strategy. She first appears in The Titan's Curse, where she is shown to dislike Percy and his relationship with Athena's daughter, Annabeth. Athena is described as being beautiful but also serious and foreboding. She has intense grey eyes, as do almost all of her children who reside in Cabin 6. In The Demigod Files, she has black hair, but in other books, she is depicted as having blonde hair, like her children. Athena considers Percy to be very dangerous as he has the potential of fulfilling the Prophecy that a child of one of the Big Three will destroy Olympus. She advises Percy that wise counsel is not always the most popular, and cautions him about his fatal flaw. She also votes not to let Percy live. Percy considers Athena one of the most dangerous beings he has encountered, noting that because of her calculating intelligence, her plans rarely fail. * Demeter/Ceres - The Goddess of the Harvest. She is first mentioned in The Sea of Monsters, when Hermes is talking to Percy about the quest. She was also one of the goddesses who voted to keep Percy alive in The Titan's Curse. Demeter made three brief appearances along with her daughter Persephone in The Last Olympian, notably when she participates in the battle against the Titans. Her children reside in Cabin 4. * Dionysus/Bacchus - The God of Wine and Madness. He is Percy's cousin and the father of Castor and Pollux. He is the director of Camp Half-Blood where he was sent by his father Zeus for chasing an off-limits nymph though he is married. At Camp Half Blood, he is known as \"Mr. D.\" He is shown to hate his job and have a low opinion of demigods stemming from Theseus' abandonment of Ariadne, but he has to remain at Camp Half-Blood for another fifty years (his punishment used to be 100 years, then Zeus shortened it). His children live in Cabin 12. He can be seen playing with the satyrs in camp. He appears in all the books. In The Battle of the Labyrinth, he goes out to search for the minor gods and returns at the end of the book. He rarely bothers to call the campers by their proper names, making a point of calling Percy Jackson names such as \"Peter Johnson\", \"Perry Johannson\", or \"Pierre Jorgenson\" throughout the series. He also calls Annabeth \"Annie Bell\" or \"that Anne girl\", regardless of the fact that she has been in Camp Half-Blood since she was seven years old. Though he has said that Percy \"always manages to annoy him,\" he has saved Percy's and Annabeth's life several times. * Hades/Pluto - The God of the Underworld, son of Kronos, brother to Poseidon and Zeus. He is the husband of his niece Persephone and is Nico and Bianca di Angelo's father. Percy first encounters him in The Lightning Thief on his quest to find and return Zeus's master bolt. In The Last Olympian, Hades traps Percy when Nico leads him to the Underworld palace. He plans to put him in the dungeon until Nico turns sixteen, so Nico can fulfill the prophecy. He appears again with Persephone and Demeter to save Olympus. After the war, Hades, along with the minor gods, is given a cabin in Camp Half- Blood * Hephaestus/Vulcan - The Gods' Blacksmith and God of Fire. He appears as a minor character in The Titan's Curse and as a major one in The Battle of the Labyrinth where he helps Percy numerous times. His children reside in Cabin 9. He is the father of Charles Beckendorf and Leo Valdez. He was thrown off of Mount Olympus when he was born because Hera thought he was hideous and wanted a \"perfect\" family, though Hera denies it. Hephaestus says that Hera likes telling the story that Zeus threw him off the cliff because \"it makes her seem more likable.\" He defied Zeus' rule in The Lost Hero and spoke to his son. He also took the head of Festus to Bunker 9 for Leo.Riordan, Rick. The Lost Hero. Disney Hyperion Books, 2010, p. 325, 537. * Hermes/Mercury - The Messenger of the Gods and the God of travelers, Communication, and Thieves. He has nearly no role in the first book but is a significant character in the second book where he helps Percy by giving him a flask full of air, backpacks, and his special multi-vitamins, hoping that he will be able to rescue his son, Luke, who had joined the Titans. He is also mentioned briefly in The Titan's Curse. He is bitter about Luke's situation and gets angry at Annabeth in The Last Olympian for not saving him when she had the choice. All of his children and any half-bloods of undetermined parents stay in Cabin 11. * Hestia/Vesta - The Goddess of Hearth and Home. She first appears as a young girl, about 8 years old, who wears a simple brown dress and scarf. Percy sees her when he enters Camp Half-Blood for the first time, but does not speak to her. Percy and Nico encounter her in The Last Olympian when she gives them food. She has glowing eyes that remind Percy of a cozy fire. Hestia tends to the hearth in Olympus while the other gods battle Typhon. Hestia gave up her throne for Dionysus in order to prevent a civil war among the Olympians. She explains to Percy that one of the greatest powers is to yield in order to retain peace. Percy offers Pandora's jar to Hestia, as she is the Last Olympian and Hope survives best at the hearth. Hestia accepts, preventing Percy from being tempted to open it. She later helps Percy when he battles Kronos by making her hearth painfully hot for Kronos when he reaches to get his scythe when it fell into the flames. When Percy looks into her eyes, he can sometimes see the past or the future, like what happened before Annabeth, Thalia and Luke came to Camp Half-Blood. * Poseidon/Neptune - The God of the Sea, Earthquakes, Storms, and Hurricanes and the creator of the horse. He is Percy's father and his children (Percy's half- siblings) reside in Cabin 3. In the first book, he is suspected of having stolen Zeus's master bolt, but Percy proves the claim false. He appears as a minor character in the next three books. In The Last Olympian, Percy falls unconscious in the ocean and lands at Poseidon's castle. Poseidon is at war with Oceanus, the Titan god of the ocean, and makes Percy go back to camp instead of helping him. He is one of the few gods that does not go and help in the effort to defeat Typhon until Percy tells him that the only way to win is to abandon the sea and fight Typhon. His symbol of power is the trident ===Minor gods=== * Aeolus - The custodian of the Four Winds. They never made an appearance, but they were mentioned in The Last Olympian. They made it hard for the Titan army to hit Olympus by air. Consequently, it also made it harder for Pegasi to fly. In \"The Lost Hero,\" Aeolus is shown to have gone crazy filling out the gods' weather requests and wants Zeus to make him a god. * Amphitrite - The Queen of the Seas, wife of Poseidon, and daughter of Oceanus. In The Last Olympian, Amphitrite alongside Triton is seen talking strategy with her husband Poseidon in the throne room of their ocean floor palace. Percy Jackson joins them and Amphitrite treats him coldly as he is a reminder of Poseidon's unfaithfulness. Percy expects nothing else and feels sorry for her as she does not have a faithful husband. She is worried about how her father is attacking and how Poseidon is losing power to the Titan of the Sea. Amphitrite is a beautiful goddess, with flowing black hair and small horns like crab claws. * Boreas - The God of the North Wind. In The Lost Hero, Jason, Piper, and Leo meet him in his palace when they come to him for help. * Boreads - Cal and Zeke are the sons of Boreas. In The Lost Hero, they are seen when Jason, Piper, and Leo arrive at Boreas' palace. * Deimos - The God of Terror and the son of Ares. He appears in \"Percy Jackson and the Stolen Chariot\" in The Demigod Files. Deimos and his brother Phobos steal Ares' war chariot from Clarisse. Percy and Clarisse have to get it back to Ares before sunset. On the way, Deimos comes in front of the ferry that Percy and Clarisse are on while riding a sea serpent. He comes back later in the zoo, terrorizing Clarisse by shape-shifting into Ares and yelling at her. Clarisse deduces his true identity and defeats him. * East River - The minor God of the East River. He only appears in The Last Olympian. He dislikes Percy and the Hudson River. Percy asks him to sink all of the Titan ships that come in his river, and splits the sand dollar his father gave him for his fifteenth birthday with East River and Hudson so they both agree to his request. * Hebe - The Goddess of Youth. She was mentioned in a few of the books in lists of which minor Gods had turned over to the Titans' side. * Hecate - The minor Goddess of Magic. Hecate helps Kronos in The Last Olympian by attacking Olympus and making cars stay away from Manhattan. She is the mother of C.C. (Circe), who turns Percy into a guinea pig in The Sea of Monsters. She is the ruler of the empousai, two of which attack Percy in The Battle of the Labyrinth. * Hudson River - The minor God of the Hudson River. He first appears in The Last Olympian. He dislikes Percy and East River. Percy asks him to sink all of the Titan ships that come in his river, and splits the sand dollar his father gave him for his fifteenth birthday with East River and Hudson so they both agree to his request. * Hypnos - The God of Sleep and father of Morpheus. In \"The Lost Hero,\" it shown that Hypnos has his own cabin. Clovis is one of Hypnos' sons. * Iris - The Goddess of Rainbows. She helps people deliver messages through Iris messages. Percy uses Iris messages a lot throughout the series by finding a rainbow and asking Iris to accept his offering. He then throws a golden drachma into the rainbow, says the name of the person he would like to contact and where the person is, and then he can see and talk to the person. Iris specializes in delivering messages through rainbows. She does not appear in the series, but later on gets her own cabin at Camp Half-Blood. In The Lost Hero, she is revealed to be the mother of Butch. Iris is said to be on good terms with Chiron and Hermes. * Janus - The God of Gates, Doorways, Beginnings and Endings. He appears as a minor character in The Battle of the Labyrinth where he offers Annabeth a choice between two doors, which represents the situation she was in when she had to make the decision about saving Luke's soul. He has two faces, and each face seems to think the exact opposite of what the other face thinks. He is also mentioned when Percy Jackson has a dream of Deadalus. Janus makes him choose to become a murderer, which he must bear a burden for as long as he lives. * Khione - The Goddess of Winter and daughter of Boreas who appears in The Lost Hero. Jason, Piper, and Leo encounter her in Boreas' palace. She ends up betraying them to help Gaia in her conquest. * Morpheus - The God of Dreams[son of Hypnos]. He appears in The Last Olympian, putting all mortals to sleep in Manhattan before Kronos's army invades Olympus. He also puts Grover to sleep for two months, after he tries to defend the forest of Central Park. * Melinoe - The Goddess of Ghosts. She lives in the Underworld. Half of her is pale chalky white and the other half is pitch black. She appears in The Demigod Files in the short story \"Percy Jackson and the Sword of Hades\". She scares people by showing them the ghosts of deaths they regret. She shows Thalia her mother and Nico his mother. Percy does not have any ghosts because he has made peace with them. * Nemesis - The Goddess of Revenge and Balance. She never makes any actual appearances in the books, but she is the mother of Ethan Nakamura who appears in The Battle of the Labyrinth and The Last Olympian. Ethan mentions her in both The Battle of the Labyrinth and The Last Olympian. * Pan - A Satyr who is the God of the Wild. Satyrs have been looking for him for two thousand years. He appears in The Battle of the Labyrinth. Once Percy and the others find Pan in The Battle of the Labyrinth, Pan dies peacefully. * Persephone - The Goddess of Springtime and Queen of the Underworld. She is married to Hades. Her parents are Demeter,and Zeus. Hades only allows Persephone to visit her mom in the spring and summer. Unlike most minor Gods, Persephone fights with the Gods during the battle against the titans. Persephone appears in The Demigod Files and The Last Olympian. She is notably much kinder and more beautiful in the spring and summer. * Phobos - The God of Fear and the son of Ares. He appears in Percy Jackson and the Stolen Chariot in The Demigod Files. Phobos and his brother Deimos steal Ares's war chariot from Clarisse. Then Clarisse and Percy have to find it. Phobos has the power of showing people their greatest fears. He shows Percy his greatest fear, which is Camp Half-Blood catching on fire and burning, when they are fighting in an aquarium in a zoo. The word \"Phobia\" was named after him. * Pompona - The Roman Goddess of Plenty. A statue of her on top of a hotel comes to life in The Last Olympian. She becomes upset with Percy when he thinks she is Demeter. She is also cranky because all of the demigods who walk into the hotel ask her to watch their possessions. She is on the side of the Titans. * Thanatos - The God of Death. In The Demigod Files, King Sisyphus made a reference to him when Percy, Nico, and Thalia visit him. * Triton - The Sea Messenger God and the son of Poseidon and Amphitrite. He is depicted as a mermaid with two fish tails. In The Last Olympian, Triton was with his parents talking strategy revolving on Oceanus' war on Poseidon. He is shown to be cold and arrogant to Percy, but respects Tyson. * Tyche - The Goddess of Fortune. At Camp Half-Blood, her children reside in Cabin 19. According to Rick Riordan's website, Tyche is the most difficult Goddess to find. ==Titans== * Aigaios - The Titan of Sea Storms. Like Oceanus, he did not fight in the first war. In The Titan's Curse, Aigaios was mentioned by Tyson to be assisting Oceanus in protecting the Princess Andromeda from Poseidon. * Atlas - The Titan General. He is the father of Zoe Nightshade and her sisters, the Hesperides. He was imprisoned in San Francisco upon a mountaintop, forever cursed to uphold the sky. He escaped briefly during The Titan's Curse but was cleverly subdued by Artemis and Percy. He is the father of Calypso and Zoë Nightshade. * Helios - The Titan of the Sun and son of Hyperion. In The Titan's Curse, Apollo mentioned that he and Selene faded due to the Romans being too lazy to build their temples and make sacrifices to them. * Hyperion - The Titan of Burning Light and father of Helios and Selene. He appears only in The Last Olympian in a battle against Percy. Hyperion has a very fiery temper and dresses in full golden armor. He was defeated by Grover Underwood and trapped within a giant maple tree. * Iapetus - The Titan of Mortalilty, Pain and Death. He accompanies Ethan Nakamura in the Underworld in an attempt to steal the Sword of Hades in The Demigod Files. Percy drags him into the River Lethe and brainwashes him. Percy then tells him he is Bob the Titan. * Krios - Krios is the Lord of the South and the Titan of Stars and the Constellations. He is only mentioned in one of Percy's dreams, where he is forced to babysit Atlas. He is dissatisfied with his condition because he only wears ram horns, but Hyperion can blow up into flame. He is also mentioned fleeing when Kronos was defeated. He wears armor that has glowing stars on it. In The Lost Hero, Jason mentions that he defeated Krios with his bare hands. * Kronos - The Lord of the Titans and the main antagonist of the first series. He is the father of Zeus, Poseidon, and Hades, Chiron, and grandfather of Percy. He tries to get Percy to join him and fight against the Olympians. His weapon is a scythe, a \"six-foot-long blade curved like a crescent moon\" as said in The Battle of the Labyrinth. It is hinted in the book that it is Luke's old sword Backbiter remade into the scythe. He is the father of the \"Big Three,\" which are Zeus, Poseidon, and Hades. He is also the father of Demeter, Hera, Chiron and Hestia. He was sent to Tartarus by his sons and is reforming in The Sea of Monsters, The Titan's Curse, and The Battle of the Labyrinth. When he eventually reforms himself, he takes matters in his own hands. The only reason Luke was not killed was because of his loyalness to Kronos. In The Battle of the Labyrinth, Kronos is delayed to attack Camp Half- Blood. In the fifth book, Kronos leads the Titans to Olympus while the gods were fighting with Typhon. Later, Annabeth and Percy save Luke, and Luke sacrificies himself. * Oceanus - The Titan of the Ocean. In this series, Oceanus is often depicted as having the upper body of a muscular man with a long beard and horns (often represented as the claws of a crab), and the lower torso of a serpent. He did not fight the Olympians in the first war, but in The Last Olympian, he joins Kronos and is at war with Poseidon. Oceanus joins the side that he thinks will win. After it becomes clear that Kronos had lost the battle, he stops fighting Poseidon and escapes back to the depths of the ocean. * Prometheus - The Titan of Forethought (and as Grover says, \"Crafty Counsel\", with emphasis on \"Crafty\"). He appeared in The Last Olympian, where he gives Percy Pandora's Box (or Pandora's pithos) which contains the spirit Hope. He fought with Olympians in the first war, then switched sides in the second war because he was sure the Titans would win. He is otherwise neutral, as he always tries to pick the winning side. After Kronos was defeated, he is mentioned to have run away and has sent a list of excuses to the Big Three. * Selene - The Titan of the Moon and daughter of Hyperion. In The Titan's Curse, Apollo mentioned that she and Helios faded due to the Romans being too lazy to build their temples and make sacrifices to them. ==Giants== * Enceladus - A Giant who was the first to be awakened in The Lost Hero. He was killed when Jason and Jupiter threw lightning at him. * Porphyrion - A Giant who was the second to be awakened in The Lost Hero. He fought Jason and his friends and was teleported away before Hera could finish him off. ==Immortals== * Calypso - Calypso first appears in book four. She nurses Percy back to health on her island. She is shown to be in love with Percy, and is heartbroken when he leaves. She is cursed with this as punishment because she supported her father, Atlas, the Titans in the first war. Near the end of The Last Olympian, she is freed from her punishment as part of Percy's wish. She is immortal and lived on an island that makes anyone who lives there immortal for the time of their stay, though once they leave they can never come back. * Charon - Charon is the Underworld carrier through the River Styx. Percy and his friends meet him in The Lightning Thief. * Chiron - In the series, he plays the part of the mentor and activities director to the main protagonist Percy Jackson and the other demigods residing at Camp Half-Blood. In the first book, he appears under the pseudonym of Mr. Brunner. Later, it is revealed that he is the son of Kronos. Chiron is a centaur; his horse half is a white stallion. * Eurytion - A worker of Geryon and the owner of Orthrus. He is usually seen with a huge club. He is a son of Ares. He is unenthusiastic about and later rebellious against working for Geryon. When Geryon is defeated, he starts planning to take over the Triple G ranch. He gives Annabeth a mechanical spider to find Hephaestus. * Phoebe - The best tracker of Artemis' hunters. She hit the Stoll brothers with arrows in a game of Capture the Flag. She was supposed to go on the quest inThe Titan's Curse, but the Stoll brothers (at the request of Aphrodite) gave her a poisoned (but non-lethal) shirt that prevented her from going. Percy ended up replacing her. She appears in The Lost Hero. The incident with the Stolls appears to have had a lasting effect on her; she appears to think that every boy wants to play a prank on her. * Zoë Nightshade - The lead Huntress of Artemis. She is a daughter of the Titan General Atlas and the sea goddess Pleione. Percy later discovers she made his magic blade, Riptide. She uses a hunting knife and a bow as her weapons. She is a former Hesperide. but was blotted from history for aiding the half-blood Hercules in slipping past the dragon Ladon and obtaining a golden apple. Ultimately, a combination of Ladon's poison and her father's attacks kill her. In remembrance of her sacrifice, Artemis turns her into a constellation, \"The Huntress.\" ==Demigods== * Annabeth Chase is a daughter of Athena. So, she is very intelligent. She is fascinated with architecture. In battle, she is a skilled enough fighter to fight along with Percy. She is very good in strategy. She ran away from home when she was seven and met Luke and Thalia, who took her with them to get to Camp Half-Blood. She aids Percy in four of his five quests and is captured in one of them. She is also Percy's girlfriend. * Bianca di Angelo - A daughter of Hades, Nico's older sister, Percy, Thalia and Jason's cousin and later, a Huntress of Artemis. After Artemis is kidnapped in The Titan's Curse, she undertakes the quest to rescue her alongside Percy Jackson, Grover, Thalia Grace, and Zoë Nightshade. She sacrifices herself, leading to her death in a short battle. * Butch - The demigod son of Iris who first appears in The Lost Hero. He is the counselor of the Iris Cabin. It is said he is the best equestrian at camp. * Castor - The son of Dionysus and the twin brother of Pollux. Castor died at age 17 during the Battle of the Labyrinth when he was stabbed in the arm and hit on the head by an enemy demigod. * Charles Beckendorf - A son of Hephaestus, known to be able to build almost anything. He is lead counselor for Cabin 9. He had a minor role in the first four books in the series, but has a larger role in The Last Olympian. He has a crush on Silena Beauregard, whom he starts dating from the short story The Bronze Dragon contained in The Demigod Files. Most members of Camp Half-Blood call him by his surname, Beckendorf. He sacrifices himself at the beginning of The Last Olympian to destroy the Princess Andromeda, a ship that was Kronos' headquarters, unaware that it was actually because of Silena (a spy on the camp) that he lost his life. * Christopher - The demigod son of Hephaestus who first appears in The Lost Hero. * Chris Rodriguez - A half-blood son of Hermes (as shown in \"Percy Jackson and The Olympians The Ultimate Guide\") who had gone to Kronos's side until having gone completely insane in the Labyrinth. Clarisse finds him and brings him to camp where Dionysus makes him sane again. He later has a relationship with Clarisse. * Clarisse La Rue - One of the children of Ares and the head of Cabin 5. She is hot-tempered, arrogant, big, tall, strong, and is known to dislike Percy. Despite her brash nature, she is capable of compassion, shown when she cares for Chris Rodriguez, a half-blood who became a traitor and was later found crazed and stumbling within the Labyrinth in a bout of madness. She is later seen holding Chris's hand at a campfire after Dionysus cures him of his madness. She later befriends Silena Beauregard, apparently after Silena gives her advice on her first boyfriend. She and her cabin later fight with the Apollo cabin over a flying chariot. Later, she prevents Cabin 5 from joining in the battle of Manhattan because of the chariot fight, though Michael Yew gives it to them. Silena later impersonates her to bring the Ares cabin into the battle by taking her armor and spear. Silena sacrifices herself and is killed by a drakon during this charade. To avenge her friend, Clarisse stabs the drakon in the eye, breaking her spear and electrocuting the drakon. She then runs at Kronos's armies, appearing to be as invulnerable as Percy, even though she does not have the Curse of Achilles. Percy recognizes that an aura around her highly resembles that of Ares when Percy fought him. Thalia remarks that it is a blessing of Ares and that she has never seen it before in person. She is later frozen by a giant, and, after thawing, is welcomed to Olympus by her father, who is very proud of her. * Clovis - The demigod son of Hypnos who first appears in The Lost Hero, where he tries to help Annabeth on how Jason Grace's memory was lost. He is the counselor of the Hypnos Cabin. * Connor Stoll - One of the children of Hermes. He is brothers to Travis Stoll. Both are known to be crafty and mischievous. He and his brother's shenanigans incapacitated a member of Artemis's Huntresses, which enabled Percy to join the quest of The Titan's Curse. He and his brother have a larger role in The Last Olympian and both survive. He and his brother head Cabin 11 after Luke goes over to Kronos. * Drew Tanaka - A demigod daughter of Aphrodite who first appeared in The Lost Hero. She was the Cabin counselor after Silena, but was forced down by Piper McLean. She is vain and sarcastic, and can also charmspeak. * Ethan Nakamura - A son of Nemesis who feels that his mother is unappreciated and fights for her. She took his eye in return for the promise that Ethan would change the world. He turned to Kronos' side after Percy saved his life by letting him live after a duel. After the duel, he pledges himself to Kronos, the last half blood needed for his resurrection. In The Last Olympian, he tries to stab Percy in the small of his back (his Achilles spot), but Annabeth leaps in front of the dagger, and Kronos believes that he tried to stab Percy's Achilles spot. He is in the truce party along with the Empousa queen and Prometheus. Ethan later figures out that the small of Percy's back was his Achilles spot, but instead of killing him, he tries to kill Kronos. Kronos laughs, and kills him easily. Ethan's last words were \"Deserve better...if they- the minor gods just...had thrones...\" * Gracie Quinlock - daughter of Apollo, first appears at the end of The Mark Of Athena. * Frank Zhang - (also known as Fai Zhang by Grandma Zhang) is a Roman demigod of Camp Jupiter and one of the main protagonists in The Heroes of Olympus series. He is the son of Mars and Emily Zhang, as well as a legacy of Poseidon. Frank is one of the seven demigods mentioned in the Prophecy of Seven. His girlfriend his Hazel Levesque * Harley - A demigod son of Hephaestus who first appeared in The Lost Hero. * Hazel Levesque - She is one of the main protagonists in The Heroes of Olympus series and one of the seven heroes of the Prophecy of Seven. She is a Roman demigod daughter of Pluto and Marie Levesque, and the half sister of Nico di Angelo and girlfriend of Frank Zhang * Jake Mason - A son of Hephaestus. He becomes the head of Hephaestus' cabin after the death of Charles Beckendorf in The Last Olympian. He fights in the war between the gods and Titans. He later steps down and gives the role to Leo. In The Lost Hero, he was seen in a body cast after trying to catch Festus. He resigned after Festus led Leo to Bunker 9. * Jason Grace -Jason Grace is one of the main protagonists of the second series, The Heroes of Olympus. He is the son of Jupiter and Ms. Grace and the younger brother of Thalia Grace. He was a praetor With Reyna at Camp Jupiter until he gave his rank to Frank Zhang; he is the current counselor of Cabin One at Camp Half-Blood. His girlfriend is Piper Mclean * Katie Gardner - A daughter of Demeter that is the head counselor for cabin four at Camp Half-Blood, as seen in The Last Olympian. Miranda Gardiner is her deputy taking over in winter because Katie is not a year-rounder. She fights in and survives the war between gods and titans. Katie strongly dislikes the Stoll twins, because they once put chocolate Easter bunnies on the Demeter cabin's grass roof. She is the cousin of Percy Jackson, Thalia Grace, Nico di Angelo and Bianca di Angelo. * Lacy - Lacy is a daughter of Aphrodite who befriends Piper McLean in \"The Lost Hero\". * Lee Fletcher - A son of Apollo. He was the original head of Cabin 7 before he was killed by a giant in The Battle of the Labyrinth. * Lou Ellen - Daughter of Hecate, who was first mentioned in The Lost Hero. She is known for playing magical tricks on fellow campers. * Luke Castellan is one of Hermes's children and a major antagonist of the series. Though initially the counselor of Cabin 11 and an ally to Percy, he revealed his true nature as a high-ranking member of Kronos's army by attempting to kill Percy at the end of The Lightning Thief, and on several occasions afterward. He is shown to harbor a great bitterness towards the gods (particularly his father, Hermes) for what he regards as abandonment. His mother had been driven crazy upon attempting to become the Oracle, leading to a stressful childhood. After reforming, Kronos does not need Luke's assistance. However, in his duel with Percy on Mount Olympus, striking Annabeth reminds him of his promise to protect her. This temporarily frees him from Kronos's influence. Percy makes his choice to give Luke Annabeth's knife, and Luke, cursed by the broken promise, kills himself by stabbing his own Achilles heel to destroy Kronos. This fulfills the prophecy, with Luke being the foretold hero. In the film, Luke is portrayed by Jake Abel. Percy refers to Luke as a hero. * Leo Valdez - He is one of the main protagonists in The Heroes of Olympus series and one of the seven heroes of the Prophecy of Seven. He is a Greek demigod, the son of Hephaestus and Esperanza Valdez. Leo is currently the head counselor of the Hephaestus’ Cabin and is dating Calypso * Malcolm Pace - A son of Athena. He is the assistant counselor of the Athena cabin. He leads Athena's cabin to a bridge or tunnel in The Last Olympian. His last name is never revealed. He walks in on Percy and Annabeth hugging in The Battle of The Labyrinth. * Mark - A son of Ares. He is mentioned by Percy once in The Demigod Files in the short story Percy Jackson and the Stolen Chariot when Percy asks Clarisse which of her brothers played a prank on her. He may have been the one that Percy awoke from a midday nap in The Titan's Curse. * Michael Yew - A son of Apollo. He is the leader of the Apollo Cabin after Lee Fletcher died in The Battle of the Labyrinth. He is described as very short, four foot six, with personality that makes up for his height, and a face that reminds Percy of a ferret. In The Demigod Files, in an interview with Clarisse, she mentions that she would want to pulverize Micheal, thus stating that they are enemies. Percy finds it very interesting that he's the counselor. He is supposedly killed leading a group of demigods in the fight against Kronos' army. Percy looked everywhere for him, but only found his bow. He is presumed deceased, although this was never confirmed. * Miranda Gardiner - Miranda is a daughter of Demeter who first appears in The Lost Hero and is the counselor of her cabin. Miranda had her nose (temporarily) removed by Lou Ellen, a daughter of Hecate. * Mitchell - Mitchell is a son of Aphrodite who befriends Piper McLean in \"The Lost Hero\". * Nyssa Barrera - Demigod daughter of Hephaestus. * Nico di Angelo is a son of Hades, Bianca's younger brother, Hazel Levesque half-brother, Percy Jackson, Thalia and Jason Grace's cousin. At first Percy assumed Hades broke the oath not to have children after World War II, but Nico and his sister Bianca had been placed in the Lotus Casino, where 'time stands still' since before the oath was made. At the time, he took great interest in a game called Mythomagic. Nico has the power to raise skeletal warriors, shadow travel, and create great fissures in the ground that swallow up anyone or anything unfortunate enough to be standing on it at the time. For a time, he was Percy's enemy, blaming him for the fact that he had failed to protect Bianca as he had promised, but they became friends eventually. Nico tried multiple times to contact his sister and had difficulty contacting her, even using his dreams. Nico refused to stay at Camp Half-Blood in the fourth book after noting that he was not welcomed at Camp Half-Blood; he compares this to the fact that his father is not welcomed at Olympus. Several months later, he informed Percy of a plan that could lead to defeating Kronos. In the final book of the first series, he convinced Percy to bathe in the River Styx, making him invincible barring the small of his back. In the end of the final book, Percy is given a 'wish' to be granted by the gods, and he turns down becoming a god, instead choosing to make all the gods and goddess 'claim' their children and make sure they have cabins at Camp Half-blood. Nico goes back to the camp to find Hades cabin has been built, along with one for all the other minor gods and goddess. Later in the Heroes of Olympus series, he captured captured by giants in a sort of jar, with only his sword and a few pomegranate seeds, which when eaten he will sleep in a trance-like state for a day. In The Sun and The Star, he and his boyfriend, Will Solace, head of the Apollo cabin, travel to Tartarus in hopes of saving Bob the titan, formerly Iapetus. * Percy Jackson - is a son of Poseidon and is the protagonist and narrator of the Percy Jackson and the Olympian series. Being a child of one of the \"Big Three\" (Zeus, Hades, Poseidon), Percy is the hero referred to within the prophecy of the Oracle, which foretells that the next half-blood child of the \"Big Three\" to reach the age of sixteen would have to make a decision that would mean the destruction or saving of Olympus. When battling, he uses a ballpoint pen that when uncapped turns into a Celestial Bronze sword know as Anaklusmos (ἀνάκλυσμος), or Riptide. His nicknames are: “Seaweed brain”, especially by Annabeth and \"Persassy\" by many fans, due to how he acts towards many monsters and gods, especialy Zeus. * Pollux - The son of Dionysus and the twin brother of Castor. He and his brother are described as blond, athletic, plump faced and good looking. He fights and survives the war between the Titans and the Gods, making his father secretly happy. * Piper Mclean - Piper McLean is the demigod daughter of Aphrodite and the actor Tristan McLean, the counselor of Cabin 10 at Camp Half-Blood, the girlfriend of Jason Grace and one of the demigods from the Prophecy of seven * Reyna Avila Ramírez-Arellano - Former praetor of the Roman demigod camp, Camp Jupiter. A Roman demigod, daughter of Belleona and Julian, who became a mania. Her sister Hylla is the Queen of the Amazons. They fled after their father became a full mania, when she was 10, and ended up living on Circe's Island. After becoming praetor, she became friends with Jason Grace, and started to develop romantic feelings for him. She was present when Juno revealed herself with Percy Jackson in The Son of Neptune, and has Hazel bring him for questioning. That night she makes Percy a probatio, announcing him an official demigod of Camp Jupiter. After the giants attack, she welcomes her sister and the Amazons in a speech, and makes Percy the other praetor. * Silena Beauregard - A daughter of Aphrodite and the head of Cabin 10. Percy regards her as one of the nicer girls of the cabin and acknowledges that she is pretty, but still finds her to be a \"neat freak\". She participates in the Battle of the Labyrinth. She does not think that she is a good fighter and feels that she does not do anyone any good at camp. She unveils her hatred towards the hunters of Artemis, who say that love is worthless, to which she responds by stating that she is going to \"pulverize\" them. Silena is killed by a drakon when she fights it while pretending to be Clarisse in The Last Olympian. It is also revealed in The Last Olympian that she was the spy giving Kronos information about what was going on at Camp Half-Blood. When the Stoll brothers ask Percy about it, he will not let Silena be remembered as a spy. She did, however, want to stop being the spy when her boyfriend Charles Beckendorf died (charming her with his looks, Luke had promised that fewer lives would be lost and that Charles would be safe), but was blackmailed by Luke when he threatened to reveal her betrayal. This causes Silena to become even weaker or as Percy described, \"She looked like glass. Like she was going to break at any time.\" Percy also notes that no one says the word \"spy\" during the burning of her shroud (which was hot pink with an electric spear embroidered on it). * Sherman Yang - A son of Ares. He, like Mark (another son of Ares), is mentioned by Percy in The Demigod Files in the short story Percy Jackson and the Stolen Chariot, when Percy asks Clarisse which of her brothers played a prank on her. He also may have been the one that Percy awoke from a midday nap in The Titan's Curse. * Thalia Grace is a daughter of Zeus. She is Jason's older sister and the cousin of Percy Jackson and Hazel Levesque and Bianca and Nico di Angelo. Grover Underwood was assigned to watch over her when she ran away from home at ten years old. On her journey, she met Luke Castellan and Annabeth Chase. They also had brief encounters with the Hunters of Artemis and she was enticed to join by Zoë Nightshade. When she was twelve, they were all soon attacked by a herd of monsters and caught by a Cyclops in New York. She was captured, but thanks to Annabeth, was freed. They meet the satyr Grover Underwood on the way. They escaped, but found that the monsters they had briefly escaped caught up to them. As they reached Half-Blood Hill, Thalia sent Luke, Grover, and Annabeth over the boundary line while she faced the monsters. She sacrificed her life for her friends, and her father, Zeus, took pity on her and transformed her to a pine tree. She is later brought back to life by the Golden Fleece and joins the quest in the third book where she ultimately joins the Hunters, taking the place of Zoë Nightshade. She has a younger brother, Jason Grace who was separated from her when she was 10. This became the reason she ran away from home. She wears a lot of dark makeup and punk style clothing. She has electric blue eyes and spiky black hair. She is so like Percy that according to Annabeth, they either could be best friends... or worst enemies. * Travis Stoll - One of the children of Hermes. He and his brother become the new counselors of cabin 11 after Luke went to Kronos. Travis is the older brother of Connor Stoll. Both are known to be crafty and mischievous. Percy finds it ironic that their last name is Stoll, like the word 'stole'. His and his brother's shenanigans incapacitated a member of Artemis's Huntresses, which enabled Percy to join the quest of The Titan's Curse. He and his brother have a larger role in The Last Olympian and both survive. * Will Solace - He is a son of Apollo, who healed Annabeth in The Last Olympian, and becomes head of Apollo Cabin (as seen in The Lost Hero.) Will Solace is also Nico's boyfriend in Trials of Apollo and The Sun and The Star. ==Mythological Characters== Some of the known characters of Greek Mythology have made an appearance in this series: * Achilles - The image of Achilles appears briefly in The Last Olympian, warning Percy about The Curse of Achilles. * Ariadne - Ariadne once helped Theseus when it came to him slaying the Minotaur. When Theseus unknowingly left Ariadne on an island, she was found by Dionysus who took her on as his wife. Theseus \"abandoning\" Ariadne was one of the reasons why Dionysus dislikes heroes. Ariadne made an appearance at the end of \"The Titan's Curse\" where she was walking arm to arm with Dionysus. * Circe - Circe ran a magical beauty boutique in the Sea of Monsters. She was glamorous and went by the alias of C.C. While she treated females at her spa, she turned males into guinea pigs. When Percy was turned into a guinea pig, Annabeth managed to use Hermes' multivitamins to become immune to Circe's spells and escaped with the guinea pigs. Not knowing which one is Percy, Annabeth fed them all multivitamins restoring Circe's victims to normal. * Daedalus - Inventor of the Labyrinth, son of Athena, and father of Icarus. Daedalus killed his nephew Perdix and took his notes, which he then used to cast his animus (soul) into automatons after Athena branded him with the murderer's brand. He originally owned a hellhound named Mrs. O'Leary and fights the Titan army toward the end of the fourth book. He later decides that it is time to go to the Underworld and leaves Annabeth his laptop which is filled with his notes and ideas. Nico unleashes Daedalus' spirit which destroys the labyrinth. When in the Underworld, King Minos tried to convince the other judges to punish him and fails. Daedalus' spirit now works as the Underworld's architect while being able to visit Icarus and Perdix on weekends. * The Fates - The three women who control the threads of life. ** Clotho - The Fate who spins the Thread of Life. ** Lachesis - The Fate who measures the Thread of Life. In \"The Lightning Thief,\" Percy and Grover encounter them at an old-fashioned fruit stand. In \"The Last Olympian,\" the Fates take Luke's dead body away after the Second Olympian War. ** Atropos - The Fate who cuts the Thread of Life. * Gaea - The embodiment of Earth, the mother of the Titans, Giants, and Antaeus, and grandmother of the Olympian Gods. She serves as the primary antagonist of The Heroes of Olympus series. * King Lycaon - King Lycaon was a king who was turned into a wolf after doing deadly tests on Zeus. In \"The Lost Hero,\" King Lycaon appears where he meets Jason, Leo, and Piper in their search for Aeolus. He and his werewolves were instructed to kidnap Jason and kill Leo and Piper. King Lycaon escaped when the Hunters of Artemis stopped him. * King Midas - King Midas was a king who had the Golden Touch. He was referenced in \"The Battle of the Labyrinth\" where he states that Rachel's gold appearance made her look like she was touched by King Midas. In \"The Lost Hero\" King Midas was among the dead people brought back to life when the Doors of Death opened in Omaha, Nebraska. When Jason, Piper, and Leo arrived at Midas' mansion, he was polite. Midas told them that it was a silly story that he learned his lesson when he touched his daughter, turning her into solid gold. Midas touched Piper's backpack, turning it into flexible gold and making it magic, proving he still had the magic touch. Midas admitted that he had sometimes pat his son Lityerses on the pack accidentally, but he always had the lake to rinse it off. Midas finally revealed he was working for the Giants and turned Leo and Piper into gold. He gave Jason a choice: turn into a nice gold statue for his collection or fight Lityerses and die. Jason fought Lityerses and Midas. Midas and his son fought off the Hunters of Artemis before Jason managed to defeat Lityerses and unfreeze Piper and Leo. * King Minos - King Minos is a former king who is one of the Judges of the Underworld. Nico summons in book four where he pretends to advise him on how to bring Bianca back from the dead he is when really trying to bring himself back. He is also seen as a live king in Percy's dreams/flashbacks. Near the end of the book, it is revealed that he is serving his own dark purpose when he kidnaps Nico and tries to kill Deadalus and use his knowledge. When Daedalus ends up in the Underworld following his sacrifice, King Minos tried to convince the other two judges to punish him and fails. * King Sisyphus - A former ruler of Corinth. He had committed violations of guest hospitality, seduced his niece, plotted to kill his brother Salmoneus, and told the River God Asopus where Zeus had his daughter. His major crimes involved cheating death twice. The first where he tricked Thanatos into showing him how the chains worked causing Thanatos to be trapped until Ares freed him (Thanatos being trapped displeased Ares since no one in battle could die). The second time was when he complained to Persephone that his wife Merope did not give him a proper funeral and sent Sisyphus' spirit to the living. Even when Sisyphus did not want to return to the Underworld, he was forcefully dragged back there by Hermes. His punishment in The Fields of Punishment was to roll a boulder up a hill, and whenever he failed he would be tempted to try again. He appears in The Demigod Files in the story titled The Sword of Hades when Percy and Nico ask him advice while Thalia rolls the boulder up the hill. He does not really help them much, but he does say that he helped someone else. He said that he told that other person to go see Melinoe. Therefore, Percy and his friends go to see Melinoe as Sisyphus begs for them to set him free from his punishment as being here was a minor set- back. * King Tantalus - Tantalus is a king from the Fields of Punishment who is the son of Zeus. He ended up there after killing his son Pelops, cutting him up, and serving him as food to the Gods. His punishment in the Fields of Punishment was to stand under a fruit tree in the middle of a lake where the branches and water would go out of reach from him. He becomes the activities director at Camp Half-Blood after Chiron is fired. He appears in The Sea of Monsters as a minor character. Even when hired as the activities director, he could not eat or drink as the food kept evading him. He is shown to hate Percy and his friends even more than he hates most half-bloods, yet shows favoritism to Clarisse such as naming her hero when the camp was attacked by Colchis Bulls or when she wins the chariot race. He throws a banquet in her honor. When the camp is attacked by a large flock of Stymphalian birds, Tantalus blames it on Percy, Annabeth, and Tyson's \"bad chariot driving\" despite that they were the ones who defeated the birds. When Tyson is brought to camp, Tantalus insults and makes fun of him even when Tyson is claimed by Poseidon. When at the end of the book, his curse is lifted by Dionysus just before he is sent back to the Underworld as he attempts to take some food along. Though none of the campers were sad to see him go. * Lityerses - Lityerses is the son of King Midas. In \"The Lost Hero,\" he appeared alongside his father. * Medea - A sorceress and granddaughter of Helios that Jason, Piper, and Leo encountered in \"The Lost Hero.\" She is shown as the head of a mall in Chicago that Jason, Piper, and Leo visit. She begins to show the demigods her stock of magic objects and potions, but becomes angry when she hears Jason's name (as he is named after the hero that betrayed her). It quickly becomes evident to Piper that Medea is an agent of Gaia, and the one who Hera had warned them about. Jason and Leo however are entranced by the magic in Medea's voice who tells them to attack and kill one another. Piper managed to bring the two to their senses and they blew up the mall. Medea shouts that she will not be abandoned again causing the three to quickly leave before she makes another attempt to destroy them. * Oracle of Delphi - Apollo's Oracle of Delphi used to reside in the mummified remains of its host until its power was transferred to Rachel Elizabeth Dare in The Last Olympian. The Oracle's power originally passed from the deceased oracle to a newly chosen oracle; however, at the end of the second world war, the oracle gave a Great Prophecy predicting a child of the Big Three (Zeus, Poseidon, and Hades) would determine whether or not the gods would be preserved or destroyed. Using this information, the Big Three entered a pact in which none could continue to sire heroes. Before this, Hades bore two young children, Nico di Angelo and Bianca di Angelo. Zeus, fearing that either were the children of the prophecy, destroyed the hotel where the di Angelos lived with his master bolt, killing Maria di Angelo, Hades' lover. In revenge, Hades cursed the Oracle to ensure that the power of the Oracle of Delphi would not pass on to somebody else in hopes that it would soon return to the dust along with its prison. After the Battle of Manhattan in which Hades and Nico successfully assist in the defense of Mount Olympus, Zeus honors the Lord of the Dead. In response to his newfound respect from the other gods, he lifts the curse, allowing the Oracle's power to pass on into Rachel Elizabeth Dare, the last Oracle. * Procrustes - He is depicted as \"Crusty,\" the owner of a Los Angeles mattress store who appears in The Lightning Thief. He trapped Annabeth and Grover on his bed, but he was defeated by Percy. * Theseus - When Nico was trying to summon Bianca in \"The Battle of the Labyrinth,\" he ended up summoning the spirit of Theseus. ==Creatures and Monsters== * Antaeus - A half-giant who is the son of Poseidon and Gaia. He remained strong while he was on the ground. Percy managed to find a way to get him into the air and defeat him. * Argus - Argus is a multi-eyed humanoid who works as a security guard at Camp Half-Blood. He is said to have an eye on this tongue which is why Argus does not talk much. * Automaton - Automatons are like robots, but more highly developed. They have an intricate circuitry in them which makes them hard to fix. Most are made out of normal steel but some like the Bronze dragon are made out of celestial bronze. According to Annabeth, some Automatons in Manhattan were used to either attack or help defend Mount Olympus. * Bear Twins - Agrius and Oreius are humanoid bears that were a result of a union between a woman and a bear due to the power of Aphrodite. The two served as Luke's henchmen in The Sea of Monsters. * Bronze Dragon - A dragon made of bronze that created by the campers in Hephaestus' cabin to help defend Camp Half-Blood. He is later named \"Festus\" by Leo Valdez. He is also shown in The Bronze Dragon of The Demigod Files. Festus means Happy in Latin. * Centaur - Half man, half horse. Chiron is a centaur. ** Party Ponies - They are Chiron's kin. As their name suggests, they are a vast clan-like extended family of rowdy centaurs who reside in the United States with chapters hailing from each respective state. They are key players in two major incidents in the series. In The Sea of Monsters, they along with Chiron rescue Percy from Luke during their duel on the Princess Andromeda. In The Last Olympian, they help Chiron and the others fight the major battle between the gods and the Titans. * Cerberus - The three-headed dog who guards the Underworld entrance to the living. In The Lightning Thief, he befriends Annabeth. He also appears in The Last Olympian when he is playing with Mrs. O'Leary. He is the son of Echidna and Typhon. * Charybdis - One of the two monsters (the other being Scylla) that live on either side of a narrow channel of water. She takes the form of a giant mouth that swallows and releases water, creating whirlpools. * Chimera - A three-headed beast that is part lion, part goat, and has a snake-headed tail. It is first seen in the form of a Chihuahua. It confronted Percy atop the St. Louis Arch alongside its mother, Echidna. Overwhelmed by the creature and poisoned by its snake head, Percy was forced to jump into the water far below to escape it. It disappeared after Percy dove into the water. * Clazmonian Sow - A flying pig that appeared directly after Hyperion was defeated. Percy defeats it with the help of Blackjack, a statue of Hermes, and the New York Public Library's two stone lion statues. * Colchis Bull - An elephant-sized, fire-breathing bronze bull created by Hephaestus. Their horns are silver and their eyes are rubies. In The Sea of Monsters, a bunch of them attacked Camp Half-Blood and are defeated by Tyson. They were later used to make the tracks for the Chariot Race. * Cyclops - One eyed-giants who have three species as mentioned in The Lost Hero. The first are the elder cyclops, who are friendly, and help the gods, Tyson is one of them. The second is the southern species, who raise Goats and live in caves. Polyphemus is one of them. The third, introduced in The Lost Hero, is the northern group, who helped the Titans make weapons. ** Ma Gasket - A female cyclops who is the mother of Sump and Torque. She appears in \"The Lost Hero\" when Jason, Piper, and Leo visit her factory in Detroit. ** Polyphemus - Percy Jackson and his friends encounter him on an island in \"The Sea of Monsters.\" He is shown to be blind and there was also a reference about Odysseus being responsible for blinding him under the alias of \"Nobody.\" ** Sump - The son of Ma Gasket who appears in \"The Lost Hero\". ** Torque - The son of Ma Gasket who appears in \"The Lost Hero.\" * Draco Aionius - A bunch of these monsters attacked Camp Half-Blood while Percy Jackson was at the Sea of Monsters. * Drakon - A race of giant, millennium-old, serpent-like dragons. ** Lydian Drakon - The oldest and most fiercest of the Drakons. Kronos unleashed it upon Manhattan where it killed many half-bloods before being killed by Clarisse La Rue. ** Aitheopian Drakon - One was being raised by Luke in The Sea of Monsters. When one of the Bear Twins seemed stubborn on doing a job, Luke threatened him to been fed to the Drakon. * Echidna - Part woman, part snake. She is the wife of Typhon and the mother of Cerberus, Chimera, Hydra, Nemean Lion, and Ladon as well as several others not in the series. She is first seen as an old lady that owned the chihuahua that was actually Chimera in disguise. She assisted Chimera in fighting Percy at the top of the St. Louis Arch. She and Chimera disappeared after Percy dove into the water. * Empousai - Seductive shape-shifting women who are similar in appearance to vampires with both shaggy donkey legs and bronze legs. Two Empusa named Tammi and Kelli, pose as cheerleaders in The Battle of the Labyrinth. In The Last Olympian, the Empousa queen appears as part of the truce party along with Prometheus and Ethan Nakumura. * Erymanthian Boar - A giant boar sent by Pan. Percy, Thalia, Zoë, Grover and Bianca first encounter it in Cloudcroft, New Mexico. Grover is the first to identify it and its potential utility to the team as a form of transportation. * Feather-Shooting Bird - A type of large black bird that shoots it's feathers like arrows. In \"The Demigod Files,\" Phobos summons them to fight Clarisse after he steals Ares' war chariot. * Fire-Breathing Horse - A fire-breathing horse that is sold at the Triple G Ranch for war purposes. Some are shown to pull Ares' war chariot. * Flesh- Eating Horse - A bunch of them are seen at the Triple G Ranch. Some of them tried to eat Percy while he was cleaning the stables. * Flesh-Eating Sheep - A bunch of carnivorous sheep that are owned by Polyphemus. They help to guard the Golden Fleece. They are as big as a hippopotamus and attack like piranhas. * The Furies - The Furies are Hades' chief servants and torturers—therefore, they personally searched for Hades's Helm of Darkness, thinking that Percy had stolen it. ** Alecto - Alecto acted as Percy's pre-algebra teacher Mrs. Dodds in the first book. She is Hades's main servant. She is also the lawer that rescued Nico and Bianca Di Angelo from the lotus hotel (mentioned in the last book). ** Megaera - A Fury that represents grudging. ** Tisiphone - A Fury that represents avenged murder. * Gegeines - A race of six-armed giants in leather loincloths that appear in The Lost Hero. They are summoned by Enceladus to fight Jason, Piper, and Leo. * Geryon - In this series, Geryon is described as having a normal head where his face was weathered and brown from years in the sun, slick black hair, a pencil-thin moustache, two very beefy legs wearing a very large pair of Levis and each of his chests wore a different colored shirt: green, yellow and red. In \"The Battle of the Labyrinth,\" he is the owner of Triple G Ranch with Orthrus guarding the ranch. He gave Percy an impossible task. To clean out the stables of carnivorous horses (one of the tasks Hercules also did). Once Jackson completed the task, Geryon went back on his deal to let his friends free and the two fought. Jackson found Geryon a worthy battle as he was a challenge due to his three hearts which allowed him to be almost impossible to defeat. Jackson defeated Geryon with a well placed arrow (thanks to Hera) that went through Geryon's sides hitting all three hearts at once killing Geryon. * Ghoul - The Ghouls serve as security guards in the Underworld and make a sound that is similar to bats. They would escort the souls of the wicked to the Fields of Punishment as seen in \"The Lightning Thief\" when they fly a preacher that had been scamming people there. * Giant Badger - A giant badger. In \"The Last Olympian,\" it was mentioned that Gleeson Hedge tried to fend off the Giant Badgers and tried to summon Pan to help him in that. * Giant Crab - A giant crab that might be Cancer. Percy fought it in the Princess Andromeda during his mission with Charlie. He defeated it by stabbing the soft tissue in its belly. * Giant Scorpion - A giant-sized scorpion. Native to desert regions, the giant scorpion may be a descendant of the Brontoscorpio, a species of prehistoric aquatic scorpions from Paleozoic times. Daedalus in the alias of Quintus ordered some Giant Scorpions from Triple G Ranch. He kept them in their boxes in the Sword Fighting Arena. He eventually let them out in the camp's forest for a game. * Giant Squid - A giant squid that might be the Kraken. It was among the sea monsters in Oceanus' army. * Gorgon - A Gorgon is a female humanoid creature with snake-like hair. Anyone who looks at the face of the Gorgon turns to stone. ** Medusa - The Gorgon who is the sister of Stheno and Euryale. Under the moniker of \"Aunty Em,\" she attempted to lure Percy, Annabeth, and Grover into a false sense of security and turn them into stone statues. She is defeated, and her severed head is mailed to the gods of Olympus as proof of the trio's courage (though Grover notes that it is more akin to impertinence). Percy's mom uses her head to turn Gabe Ugliano to stone. ** Stheno - A Gorgon who is the sister of Medusa and Euryale. In \"The Lost Hero,\" she was mentioned to be among the characters who were brought back to life when the Doors of Death opened. Stheno is described by Percy as appearing as a dumpy old grandmother but with rooster feet and bronze boar tusk sticking out of the corners of her mouth. ** Euryale - A Gorgon who is the sister of Medusa and Stheno. * Harpy - Aello (\"storm swift\"), Celaeno (\"the dark\") – also known as Podarge (\"fleet-foot\") – and Ocypete (\"the swift wing\") are the three harpies were created by Zeus. They work in Camp Half- Blood as \"the cleaning harpies\" being allowed to eat any camper who stays in camp past noon in the last day of the summer. The Harpies also cleaned the dishes with super-hot lava and are also good in mid-town traffic. * Hekatonkheires - Hundred-Handed Ones; giants of incredible strength, superior even to the Cyclopes. They are taller than mountains. The last one, Briares, was imprisoned by Kampê in the fourth book. There was also mentionings that his brothers Cottus and Gyges have faded due to people forgetting about them. When Tyson finds that Briares is too afraid to escape, he is heartbroken. At the end, Briares returns helps defeat Luke and the Titans. In The Last Olympian, Percy sees Briares helping Poseidon defeat the forces of Oceanus. ** Briares - He first appears in The Battle of the Labyrinth when Percy, Annabeth, Tyson, and Grover rescue him from Alcatraz, where he is being held prisoner by Kampê. Briares is one of the three Hecatonchires (\"the Hundred- Handed Ones\"), elder brothers to the Cyclopes. His siblings are Kottos and Gyes. Like all other Hundred-Handed Ones, he has fifty different \"faces\" indicative of his moods. He is very frightened and timid due to his years of imprisonment and feels that he is of no use. Because of this, he runs away from Percy and his companions in the maze-like Labyrinth. However, Daedalus finds him and they both show up to fight for the Olympians in the battle at Camp Half-Blood at the end of The Battle of the Labyrinth. Briares seizes the chance to bury Kampê under a pile of rocks. At the end of The Battle of the Labyrinth, he goes to help the Cyclopes in Poseidon's forge. In The Last Olympian, Briares is shown fighting alongside Poseidon. * Hellhounds - Hellhounds are a main part of Luke's army and monsters in general. They are described as very large black dogs that have fire glowing in their eyes. They were also mentioned to reside in the Fields of Punishment. Daedalus owns a hound named Mrs. O'Leary, who, unlike her relatives, is loving and loyal. ** Mrs. O'Leary - Mrs. O'Leary is the only friendly hellhound to ever exist. Quintus (Daedalus) was her original owner, but, after asking Nico Di Angelo to kill him, Percy becomes the hellhound's owner. While Percy is in the \"mortal world\", Charles Beckendorf takes care of her at Camp Half-Blood.She rescues Percy while in the Labyrinth. * Hippalectryons – The Hippalektryons are an endangered animal that is part chicken, part horse. In \"Battle of the Labyrinth,\" they are seen at the Triple G Ranch. * Hippocampus – Hippocampi are from waist up stallion horses and from waist down have a fish tail. One is said to take a liking to Tyson, and soon enough he named it Rainbow. They are also called \"fish ponies\" by Tyson. ** Rainbow - A Hippocamus who befriends Tyson in \"The Sea of Monsters. Loves to give Tyson rides all over the sea.\" * Hyperboreans - Ice giants who freeze into ice when defeated. They side with Kronos in The Last Olympian. * Hydra - A monster with nine heads. Every time a head is chopped off, two new heads grow back. This monster appears in The Sea of Monsters where its life force is linked to the Monster Doughnut Shop as another one pops up every time the Hydra regrows a head. In The Lightning Thief film, the creature takes the form of five janitors in the Parthenon replica in Tennessee and refers himself as \"We\" and is ultimately defeated by the use of Medusa's head. * Kampê - A snake-haired, centauroid creature that is half-woman, half dragon with wings and the heads of various mutated wild animals growing from her human torso. She is a monster that imprisoned the Hundred-Handed Ones and Cyclopes during the First Great War. She is feared by all, and is defeated by Briares in the \"Battle of the Labyrinth\" by being crushed by boulders. * Keres - A bunch of battlefield spirits of famine and disease that feed on violent deaths. They reside in the Underworld and support the Titans but do not assist them in \"The Last Olympian.\" In \"The Demigod Files,\" a bunch of them attacked Percy, Thalia, and Nico where one of them poisoned Percy. Lucky for him, Bob the Titan managed to heal him. * Laistrygonians - Large, muscular cannibals who serve as the brawn of Kronos's army. Known Laistrygonians in the series are Joe Bob, Marrow Sucker, and Skull Eater * Ladon - The giant dragon who is one of the offspring of Echidna. It defends the Hesperides' apple tree. Ladon poisons Zoë Nightshade in The Titan's Curse. * Lotus-Eaters - A bunch of them run the Lotus Hotel and Casino in The Lightning Thief. * Manticore - These monsters have human faces and the bodies of lions as well as thorny tails. Dr. Thorn is a manticore. ** Dr. Thorn - He is a manticore in the form of the vice principal of Westover Hall, the school that Bianca and Nico di Angelo attended. He has two eyes of different colors, one blue and one brown. His nostrils flare up when he talks. * Minotaur - The Minotaur is part-man, part bull. The monster of the labyrinth that chased Percy all the way to Camp Half-Blood. He defeats the monster atop Half-Blood hill and claims its broken horn as a spoil of war. The Minotaur returns in The Last Olympian as a general for Kronos's army at Williamsburg Bridge and now wearing armor. It was defeated by Percy again. In the film adaption, the Minotaur's head resembles a Cape Buffalo's head. * Myrmekes - A race of giant ant-like creatures that like shiny things like gold. In \"The Demigod Files,\" A bunch of Myrmekes trapped Charles Beckendorf in their nest. * Nemean Lion - A lion that is one of the children of Echidna and Typhon. Luke and Atlas sent the Nemean Lion to the National Air and Space museum to stop the group of questing Hunters and Demigods. It battled with Percy Jackson, but was hard to defeat because of its bulletproof and sword-proof pelt. Percy eventually defeated it by throwing astronaut food into its mouth to expose its one unprotected surface, its mouth. * Ophiotaurus - A half-cow/half-snake monster. It is an ancient monster that could bring down the gods if it was slain and its entrails were sacrificed. It was nicknamed Bessie by Percy Jackson who initially assumed it was female, although Grover later informed him that it was a male. Percy saved it from a trawler's net after being fetched by the Hippocampi. ** Bessie - Bessie is the Ophiotaurus that Percy meets in \"The Titan's Curse.\" Percy named it because of its bovine appearance, but it was in fact a male. Bessie was supposedly the creature that Artemis was hunting because it could destroy Olympus. She also briefly appeared in \"The Last Olympian\" where Percy sees him an aquarium. * Orthrus - A two-headed dog owned by Geryon. * Pegasus - Pegasi are winged horses. ** Blackjack - He is the pure black version of Pegasus and Percy's loyal friend. He is first introduced in the second book The Sea of Monsters on the Princess Andromeda, Luke's demon cruise ship, where Percy rescued him from Kronos's minions. Ever since then, Blackjack has felt like he has to pay Percy back for saving him and he does whatever Percy asks. ** Guido - A Pegasus who is friends with Blackjack. In \"The Last Olympian,\" Guido and Porkpie aided Percy and Blackjack in the Battle of Manhattan. ** Porkpie - A Pegasus who is friends with Blackjack. In \"The Last Olympian,\" Guido and Porkpie aided Percy and Blackjack in the Battle of Manhattan. * Peleus - A dragon that guards the tree that Thalia was previously within. * Pit Scorpion - A deadly type of scorpion that appears in \"The Lightning Thief.\" When Luke brings Percy into the woods and reveals his allegiance to Kronos, he summoned a Pit Scorpion to attack Percy. He tells Percy he should not go for his sword, as the pit scorpion can kill in 60 seconds, and can jump up to fifteen feet. When Luke disappears, Percy manages to kill it even though it managed to sting him. With the help of the wood nymphs, Percy recovered from its poison. * Satyr/ Faun - Half man, half goat. Grover Underwood is also a satyr. * Grover Underwood is a satyr and Percy Jackson's best friend. He has found the four most powerful Greek demigods of the century: Percy Jackson (son of Poseidon), Thalia Grace (daughter of Zeus), and Nico and Bianca di Angelo (children of Hades). Before his death, Pan (the god of nature) says Grover is the bravest satyr ever to be. He names Grover as his successor to carry on his word to protect the wilderness. The Council of Cloven Elders is angered by this choice. He is the boyfriend of the tree nymph Juniper. But in The Last Olympian he is chosen as a replacement for Leneus (another Satyr who died in battle) on The Council of Cloven Elders after. ** Coach Gleeson Hedge - He is a satyr. Grover made a reference to him in \"The Last Olympian\" where he tried to summon Pan's spirit to help fend off some badgers. He played a part in the \"Heroes of Olympus\" series. ** Don ( The Faun) Don was one of the Roman fauns who hangs around Camp Jupiter, often asking for spare change and food. Ferdinand - Ferdinand is Grover's uncle who was one of the victims of Medusa in the Garden Gnome Emporium. When Kronos' army was hiding out there in \"The Last Olympian,\" his statue form is now missing an arm and has graffiti on it without Medusa watching over it. ** Leneus - Leneus is a satyr who is a member of the Council of Cloven Elders. He is killed in The Last Olympian and is reincarnated as a laurel. He hates Grover and thinks he is a liar. When he dies, Grover takes his spot in the Council of Cloven Elders. ** Maron - Maron is a satyr who is member of the Council of Cloven Elders. He only appears in book four, when he, Silenus and Leneus try to exile Grover because they think that Pan, the god of the wild, is still alive and Grover is a just lying about his death. He and the other members of the Council are described as being old and fat satyrs. ** Silenus - Silenus is a satyr appearing in books four and five. He is the leader of the Council of Cloven Elders and is shown to hate Grover, calling him an \"outcast\" and a \"liar\". that he has suspicions that he is a spy. * Scylla - One of the two monsters (the other being Charybdis) that live on either side of a narrow channel of water in The Sea of Monsters. Should a ship sail too close to her, she uses her six heads to pluck off crew members upon deck and devour them. According to Clarisse (daughter of Ares), if the crew hid below deck, Scylla would just pick up the whole boat and crush it. * Scythian Dracaenae - A race of humanoid femals with twin snake tails in place of legs. They make up a considerable portion of the Titan Lord's forces. ** Queen Sess - The Queen of the Scythian Dracaenae who appears in \"The Last Olympian.\" She fought Chiron alongside Kronos and was killed when Chiron fired one of his arrows in between Queen Sess' eyes. * Sea Serpent - One was seen amongst the sea monsters in Oceanus' army. Deimos is seen riding one in \"The Stolen Chariot.\" * Sirens - Dangerous bird-women whose sweet songs have led many sailors to watery deaths. Their hymn is almost Annabeth's undoing. * Skeleton - Skeletons were used by various people like Hades. In \"The Lightning Thief,\" Hades had skeletons in army uniforms guarding his palace. In \"The Battle of the Labyrinth,\" Nico manages to employ them as part of a ritual that will enable him to call the spirit of his sister to speak with her. In \"The Last Olympian,\" Nico and Hades manages to bring a bunch of Skeletons to help fight the Titans. They are later seen constructing a cabin at Camp Half-Blood that is dedicated to Hades. ** Skeleton Warriors - A bunch of skeletons armed with weapons. In \"The Titan's Curse,\" some skeleton warriors ambushed Percy, Thalia, Zoe, Grover, and Bianca in New Mexico. Due to her being a child of Hades, Bianca managed to destroy them. * Sphinx - A Sphinx is a monster with the head of a woman and the body of a lion. Percy Jackson and his friends encountered the Sphinx while navigating the labyrinth. Rather than tell riddles, the Sphinx asked historical questions. * Stymphalian Birds - A flock of birds once attacked Camp Half-Blood in The Sea of Monsters. Percy and Annabeth used Chiron's music so Apollo's cabin could shoot them down. * Sybaris - In \"The Titan's Curse,\" Atlas used her teeth to create Skeletons. * Talos - Talos is a giant automaton. Percy, Thalia, and Bianca fight a prototype of Talos in the Junkyard of the Gods. Apparently, he has a manhole at the base of his foot for 'servicing'. Bianca went in to mess up his circuit so they could beat him. He fell on some power lines thus electrocuting Bianca. * Telekhines - Dog-faced sea demons that reforged Kronos's blade in the fourth book. Some set Percy on fire in the fourth book. They also appear in the fifth book. In the fourth book, they are referred to as \"telekhines\", however in the fifth book, they are referred to as \"telkhines\", without the second \"e\". This may be a typographical error or something different of the author's choice. * Trojan Sea Monster - In \"The Lost Hero,\" Aeolus mentioned that Jason once slayed this monster. * Typhon - A very powerful monster. He sired many monsters by Echidna. He lives and sleeps inside Mount Saint Helens. Percy is such a powerful demigod that he almost wakes Typhon during his visit there. In The Last Olympian, he awakes and moves across America and destroys everything in his path. Due to him being concealed in mist, Typhon's appearance is not described and appears as a freak storm. The gods of Olympus try to stop him, but he is too powerful. In the end, Poseidon and his army help defeat him where Poseidon opened up a tunnel that sent Typhon into Tartarus. Once Typhon was defeated, a wave of Venti were born. * Venti - A race of storm spirits that were born when Poseidon opened a tunnel that sent Typhon into Tartarus. Depending on how chaotic they are, Venti can appear as either smokey men with angel-like wings or smokey horse. * Werewolf - A werewolf is a creature that is part man, part wolf. In \"The Lost Hero,\" King Lycaon led a pack of werewolves to kill Leo and Piper. Most of the werewolves were defeated by the Hunters of Artemis. * Wood Nymph - Wood Nymphs are a type of Nymphs that are associated with specific lands. ** Juniper - Juniper is a tree nymph. She is Grover Underwood's girlfriend, and in \"The Battle of the Labyrinth\", she informs Percy that she has seen Luke Castellan using the entrance to the Labyrinth and that she has also seen Quintus/Daedalus using the entrance to the Labyrinth. ==Mortals== * Darrin - One of the many people in the Lotus Casino. He is described as about thirteen, and \"some Elvis impersonator's son\". Percy meets him at a Virtual reality shooter game. He has apparently been in the Lotus Casino since 1977. * Gabriel \"Gabe\" Ugliano - Known as \"Smelly Gabe,\" he was Percy's stepfather. In appearance, he is heavy and bald, wearing thrift store clothes often. He managed the Electronics Mega-Mart in Queens as an occupation. As Percy described him in The Lightning Thief, he \"was nice the first thirty seconds we knew him, then showed his true colors as a world-class jerk.\" During summer break from school, Gabe asks him for money for beer and for his poker games with his friends. Supposedly he can easily guess how much money a person has. It is implied that, at least once, he hit Percy's mother. Grover later tells Percy that Sally (Percy's mother) married Gabe to protect Percy from monsters who would have tracked him down otherwise. He smelled so \"repulsively human\" that his smell hid Percy's demigod scent from monsters. If she had not married him, monsters would have found Percy sooner. At the end of Book 1, he is turned to stone by Percy's mother (using Medusa's severed head) and sold as a statue, \"The Poker Player\", earning lots of money in the process. * May Castellan - Luke's mother who attempted to become the Oracle. Since Hades's power prevented her from taking it, she was driven crazy and instead received small glimpses of her son's terrible future. She made huge amounts of sandwiches, burnt cookies, and Kool-Aid for Luke, believing that someday he would return home. She also gave him a blessing to receive the curse of Achilles. It was shown that she had numerous clippings of Hermes from advertisements and many beanbag monsters sitting in the house and on the front lawn. * Dr. Frederick Chase - Annabeth's father. He first appears in The Titan's Curse. He allows Percy, Thalia and Zoë to borrow his car to drive to Mount Tamalpais (Mount Othrys). Annabeth's father is a professor of military history. During The Titan's Curse, he was studying the Third Battle of Ypres. He owns a Sopwith Camel. He and his daughter had a lot of disagreements in the past, which is why she ran away home when she was seven years old. He lives in San Francisco with his wife and two sons, Bobby and Matthew. In The Titan's Curse, he battles the monsters on the Princess Andromeda with bullets melded with celestial bronze. * Mrs. Dare - Rachel's mother. She briefly appears in The Last Olympian. She went to Clarion Ladies' Academy, a finishing school for society girls in New Hampshire, and wants Rachel to go there as well. * Paul \"Blowfish\" Blofis - Sally Jackson's boyfriend and later husband, and thus Percy's stepfather. Percy and his mother reveal to Paul the truth, and at first he only half believes them. When Percy, Nico, and Mrs. O'Leary come unexpectedly into Sally's apartment, Paul fully believes, and thinks it's \"awesome!\". Paul turns out to be an excellent swordsman due to the fact that he was a Shakespearian actor in college and assists in the fight to save Olympus in The Last Olympian. He asks Percy for permission before proposing to Percy's mother. * Preacher - A preacher who raised money supposedly for orphans and spent it instead on his mansion until he was caught by the police. He died in a police chase when he drove his \"Lamborghini for the Lord\" off a cliff. He was carried off to the Fields of Punishment by some wisecracks in the Greek Underworld. * Rachel Elizabeth Dare - A clear-sighted mortal girl who is able to see through the Mist. She is first encountered by Percy during The Titan's Curse as he flees from the skeletons summoned by Atlas. After mistaking her for a monster and realizing she is human, Percy discovers that she can see through the mist. She leads the skeletons away from Percy. Rachel goes to the same school as Percy in \"The Battle of the Labyrinth,\" realizing that the cheerleaders are actually empousai. In The Battle of the Labyrinth, she aids Annabeth and Percy by guiding them through the labyrinth to Daedalus's workshop. From there she, Percy, Annabeth, and Nico escape, only to enter again to locate Grover and Tyson. She is present at the deathbed of Lord Pan and, like the others, takes part of his essence within her. By throwing her hairbrush at Kronos, she provided enough of a distraction for Percy to escape the Titan Lord's time manipulation. It is hinted throughout the series that she harbors romantic feelings for Percy. In The Last Olympian, she begins having strange visions and becomes the new Oracle of Delphi after Hades's curse is lifted, under the guidance of Chiron and Apollo. Her first act as the Oracle is to deliver the Great Prophecy of the next generation of heroes. * Sally Jackson - The daughter of Jim and Laura Jackson. She is the mother of Percy and she was married to \"Smelly\" Gabe.\" She then turned him to stone with the head of Medusa, and married Paul Blofis in the fifth book. In the beginning of the series, it is indicated that Sally works at a candy shop called \"Sweet on America\" and said that she wanted to be an author when she was young. In the third book, Percy guesses that Sally can see through the Mist and he believes that this was probably the reason Poseidon took interest in her. In the first book, she was thought to be killed by the Minotaur. Later on, it was discovered that she survived and that she was still alive in the clutches of Hades. She was freed once Percy gave the Helm of Darkness (which was also stolen by Luke) to the Furies. * William Dare - He is Rachel Elizabeth Dare's father, who first appears in The Last Olympian. He owns a land developing company and is very wealthy. His family lives in a mansion in Brooklyn, where Rachel lives on the top floor. Rachel hates her father because of his job, but he seems to care about her. He said that he and her mother had really been looking forward to the vacation, but, according to Rachel, they both hate the beach, and are just too stubborn to admit it. He supported Rachel's going to finishing school. He walked into Rachel's room in Percy's dream, wearing pajamas with \"WD\" monogrammed on the pocket. ==Names== Percy is one of the few demigods whose last name does not reflect his godly parent, though his first name does. Many of the campers at Camp Half-Blood have last names that consist of a traditional role or trait of their parent. Other last names are often commonplace: Rodriguez, Nakamura. * Percy Jackson: \"Percy\" is a nickname for Perseus, Percy's real name, who was a son of Zeus. Percy's godly parent is Poseidon. * Annabeth Chase Jackson: \"Annabeth\" is an anagram of Athena with a couple of extra letters. Also, \"Chase\" is a near homonym to \"Chaste\". Daughter of Athena.And finally our favorite ship. * Clarisse La Rue: \"Clarisse\" is an anagram of Ares with extra letters. Also, to rue is to regret something. * Grover Underwood: Without the suffix \"r\" Grover's name is \"Grove\" referring to The Wild. Also, Underwood contains the word \"wood\" referring to trees. He is a Satyr, worshipper of Pan, the god of The Wild. * Bianca and Nico di Angelo: \"d'Angelo\" means \"of the angels\", referring to death. Children of Hades. Their first names are versions of the sibling goddesses Bia and Nike. * Connor and Travis Stoll: Homonym to \"stole\". Hermes is the god of thieves. Children of Hermes. Percy himself pointed this out but neither of the Stoll brothers understood the joke. As well, Con, shortened from Connor, is another word for scam or trickery, as Hermes is the god of trickery. Travis can be seen connected to the word travel, and Hermes is also the god of travelers. * Jake Mason: A mason works with stone. Son of Hephaestus. * Katie Gardner: alternate spelling of \"gardener\". Daughter of Demeter. * Pollux and Castor (Last name never revealed): Pollux is the name of a demigod son of Zeus. Castor was the name of this demigod's twin brother (but, he was the son of their mortal father). In the Myth, Castor died, foreshadowing his death in the book. Twins of Dionysus. *Charles Beckendorf: Char is another word for burn. Son of Hephaestus, god of fire. * Lee Fletcher: to \"fletch\" is to add feathers to an arrow. Son of Apollo. And it may, also, be a reference to Lee Adama, a character from the TV series Battlestar Galactica, who was known by Captain Apollo. * Michael Yew: yew is a type of wood used to make longbows. Also a son of Apollo. * Silena Beauregard: literally, \"beauregard\" means \"good to look at\" in French, the language of love. Daughter of Aphrodite. * Will Solace: The prefix \"Sol\" is the Roman name for Helios, also \"sol\" often refers to the Sun, and Apollo drives the sun chariot. Solace also means comfort or consolation during a time of sadness. Since Apollo is the god of medicine, and since people are distressed when in pain, this is an appropriate name. Son of Apollo. * Thalia Grace: In mythology Thalia is the name of one of the Charites, also called the Graces. Daughter of Zeus. * Leo Valdez: \"Leo\" is the Greek word for \"lion\", but it could refer to Leonardo da Vinci, an inventor and artist, among other things. Son of Hephaestus, god of technology, craftsmen, artisans, etc. * Piper McLean: In The Lost Hero, Piper reveals that her Grandpa Tom named her Piper because she had a beautiful voice even as a baby. The name Piper means \"pipe player\". The beautiful voice might be a reference to the fact that she has the Charmspeaking ability, the ability to persuade someone to do things, a power few children of Aphrodite have. Daughter of Aphrodite, goddess of love and beauty. * Jason Grace: To appease Hera, Zeus named Jason after Hera's favorite hero, Jason, the leader of the Argonauts. Son of Jupiter(Zeus), Champion of Juno(Hera). * Frank Zhang: Zhang, in Chinese, means, \"drawing a bow\", a weapon. Son of Mars (Ares). * Hazel Levesque: Levesque means \"bishop\", who at normally related to choosing whether you go to heaven or hell. Daughter of Pluto (Hades). ==References== Camp Half- Blood Category:Lists of fictional characters",
 "title": "List of characters in the Camp Half-Blood series"
}