{
 "id": "302001",
 "text": "Hong Kong at the Olympics is a history which began in 1952. The International Olympic Committee's official abbreviation for Hong Kong was HOK. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-10-12. It is now HKG.\"Abbreviations, National Olympic Committees,\" 2009 Annual Report, p. 91 [PDF p. 92 of 94]; retrieved 2012-10-12. ==History== Hong Kong was first at the Olympic Games in 1952, then as a British colony. Hong Kong has been at every Summer Olympic Games since then except for the boycotted 1980 Summer Olympics. They have also been in the Winter Olympic Games since 2002. The National Olympic Committee (NOC) for Hong Kong was formed in 1950 as the Amateur Sports Federation and Olympic Committee of Hong Kong, and is now known as the Sports Federation and Olympic Committee of Hong Kong, China. After the sovereignty of Hong Kong was passed to the People's Republic of China in 1997, the NOC has been named Hong Kong, China. Hong Kong is separate at the Olympics by its own choice. In 2008, Hong Kong was the site of the equestrian venues for the 2008 Summer Olympics in Beijing. ==Medalists== Competitors from Hong Kong have won Olympic gold medals three times: Medal Name Games Sport Event Lee Lai Shan 1996 Atlanta Sailing Women's sailboard Cheung Ka Long 2020 Tokyo Fencing Men's Foil Vivian Kong 2024 Paris Fencing Women's Epee Ko Lai Chak and Li Ching 2004 Athens Table tennis Men's doubles Siobhan Haughey 2020 Tokyo Swimming Women's 200 m freestyle Siobhan Haughey 2020 Tokyo Swimming Women's 100 m freestyle Lee Wai Sze 2012 London Cycling Women's Keirin Doo Hoi Kem Lee Ho Ching Minnie Soo Wai Yam 2020 Tokyo Table tennis Women's team Grace Lau 2020 Tokyo Karate Women's kata Lee Wai Sze 2020 Tokyo Cycling Women's Sprint ==Related pages== * List of IOC country codes == References == ==Further reading== * ==Other websites == * Hong Kong profile at London2012.com Category:Sport in Hong Kong Category:Nations at the Olympics",
 "title": "Hong Kong at the Olympics"
}