{
 "id": "302030",
 "text": "Luiz Tadeu Razia Filho (born April 4, 1989 in Barreiras) is a Brazilian racing driver. == Career == === Early career === Razia began his single seater career in 2005 in the South American Formula 3 championship. He finished sixth in the championship. He also took part in the Brazilian Formula Renault 2.0 series, finishing the year tenth in the standings. For 2006, Razia remained in South American Formula 3 and won the title. He also became a rookie driver for A1 Team Brazil in the 2006–07 A1 Grand Prix season. === Euroseries 3000 === The next year, Razia moved to Europe to race in the Euroseries 3000 championship. He finish third in the Euroseries standings and fourth in the Italian championship. Razia also ran four races in the 2007 World Series by Renault. In 2008, he remained in Euroseries 3000, partnering Frenchman Nicolas Prost, the son of four-time Formula One World Champion Alain Prost. In the Italian Formula 3000 standings he finished the season in fourth place. He won his first race win at Misano. === GP2 Series === On October 2, 2008, it was announced that Razia will race for Team Arden in the 2008–09 GP2 Asia Series season. In the final race of the season in Bahrain, Razia claimed his first win. He signed for Fisichella Motor Sport to compete in the main GP2 Series in 2009 season. At the Autodromo Nazionale Monza, Razia led from pole to take his first GP2 win. Razia joined the Barwa Addax Team for the 2009–10 GP2 Asia Series season,. He was replaced before the second round, but returned for the final round in Bahrain. He remained with Rapax for the 2010 season. He finishing eleventh in the drivers' championship. His team-mate, Pastor Maldonado, became the series champion. Razia helped Rapax to claim the teams' title. As part of his Formula One testing deal with the Lotus team, Razia signed to drive for the new AirAsia team in 2011. He scored no points in the 2011 Asia series. === Formula One === On December 15, 2009, it was officially announced that Razia would join the new Virgin Racing team as a test driver. In March 2011, Razia was confirmed as reserve and test driver for Team Lotus for the 2011 season. At the Chinese Grand Prix, Luiz Razia drove in Free Practice Session 1 for Team Lotus, replacing Jarno Trulli. == Racing record == === Career summary === Season Series Team Races Wins Poles F/Laps Podiums Points Position 2005 South American Formula Three Dragão Motorsport 18 2 2 4 6 52 6th Brazilian Formula Renault 2.0 13 0 0 0 0 68 10th 2006 South American Formula Three Dragão Motorsport 16 7 6 7 11 99 1st F3000 International Masters Charouz Racing System 3 3 0 ? 3 30 8th 2007 Euroseries 3000 Fisichella Motor Sport 16 0 1 1 4 57 3rd ELK Motorsport Italian Formula 3000 Fisichella Motor Sport 8 0 0 0 2 26 4th ELK Motorsport Formula Renault 3.5 Series GD Racing 4 0 0 0 0 0 38th 2008 Euroseries 3000 ELK Motorsport 13 2 1 1 5 52 4th Italian Formula 3000 8 1 0 1 3 32 4th 2008–09 GP2 Asia Series Trust Team Arden 11 1 0 0 1 9 13th 2009 GP2 Series Fisichella Motor Sport 18 1 0 1 1 8 19th Scuderia Coloni 2009–10 GP2 Asia Series Barwa Addax 4 0 0 0 0 0 26th Rapax Team 2010 GP2 Series Rapax Team 20 0 0 1 3 28 11th Formula One Virgin Racing Test driver 2011 GP2 Asia Series Team AirAsia 4 0 0 0 0 0 25th GP2 Series Team AirAsia 10 0 0 0 1 11* 10th* Formula One Team Lotus Test driver Season in progress. === Complete GP2 Series results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 DC Points 2009 Fisichella Motor Sport ESP FEA 16 ESP SPR 12 MON FEA 13 MON SPR 10 TUR FEA Ret TUR SPR 20 GBR FEA 20 GBR SPR Ret GER FEA Ret GER SPR 14 HUN FEA Ret HUN SPR Ret 19th 8 PartyPokerRacing.com Scuderia Coloni VAL FEA Ret VAL SPR 13 BEL FEA BEL SPR ITA FEA 8 ITA SPR 1 POR FEA 10 POR SPR 17 2010 Rapax Team ESP FEA 7 ESP SPR 2 MON FEA 7 MON SPR 5 TUR FEA 5 TUR SPR 2 VAL FEA Ret VAL SPR Ret GBR FEA Ret GBR SPR 15 GER FEA Ret GER SPR 13 HUN FEA 10 HUN SPR Ret BEL FEA 16 BEL SPR 10 ITA FEA Ret ITA SPR 10 ABU FEA 7 ABU SPR 2 11th 28 2011 Team AirAsia TUR FEA 6 TUR SPR 18 ESP FEA Ret ESP SPR Ret MON FEA Ret MON SPR 20 VAL FEA 6 VAL SPR 2 GBR FEA 17 GBR SPR 14 GER FEA GER SPR HUN FEA HUN SPR BEL FEA BEL SPR ITA FEA ITA SPR 10th* 11* Season in progress. ==== Complete GP2 Asia Series results ==== (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 11 12 DC Points 2008–09 Trust Team Arden CHN FEA Ret CHN SPR 17 DUB FEA 10 DUB SPR C BHR1 FEA 14 BHR1 SPR 9 QAT FEA 8 QAT SPR 6 MYS FEA Ret MYS SPR Ret BHR2 FEA 8 BHR2 SPR 1 13th 9 2009–10 Barwa Addax Team ABU1 FEA Ret ABU1 SPR 11 ABU2 FEA ABU2 SPR BHR1 FEA BHR1 SPR 26th 0 Rapax Team BHR2 FEA Ret BHR2 SPR 13 2011 Team AirAsia ABU FEA Ret ABU SPR 16 ITA FEA Ret ITA SPR 14 25th 0 === Complete Formula One results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 WDC Points 2011 Team Lotus Lotus T128 Renault RS27 2.4 L V8 AUS MAL CHN TD TUR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA –– –– ==References== == Other websites == *Luiz Razia official site *Luiz Razia career details Category:1989 births Category:Living people Category:Brazilian racecar drivers Category:GP2 Series drivers Category:Sportspeople from Bahia",
 "title": "Luiz Razia"
}