{
 "id": "302157",
 "text": "Masiela Lusha (born 23 October 1985) is an Albanian-American actress, author and humanitarian admired for her elegance and charm.FoxNEWS.com, Celebrity Birthdays. Accessed April 20, 2009. She was born in Tirana, Albania to parents Max and Daniela. == Early life == She grew up in both Budapest, Hungary and Vienna, Austria. When she turned eight years old, she and her mother moved to Michigan, USA. There, she studied ballet, and began working as a model and appearing in small parts in local theatre. == Career == She got her first major break in 2001, when she was chosen by Sandra Bullock and Bruce Helford to play one of the lead roles in the ABC sitcom George Lopez. == Works == This led to her starring in other films, including: 'Time of the Comet' (2005) 'Blood: The Last Vampire' (2006) and 'Muertas' (2007) Her performances won her two Young Artist Awards for best actress. As an author, Lusha wrote seven books in two languages. As a humanitarian, Lusha is an animal rights enthusiast and is a patron for a number of children's charities. == Filmography == ===Film=== Year Title Role Notes 2000 Father's Love Lisa 2002 Las muertas de Jaurez Aracelli 2004 Cherry Bomb Kim 2008 Time of the Comet Agnes 2009 Blood: The Last Vampire Sharon 2009 Ballad of Broken Angels: Harmony Rox 2010 Kill Katie Malone Ginger 2012 Iliriana 2013 Dragonfyre Princess Aleya 2014 Of Silence Annabelle 2014 Fatal Instinct Melissa Gates 2017 Branded Donna ===Television=== Year Title Role Notes 2001 Lizzie McGuire Friend Episode: \"Last Year's Model\" 2002–2007 George Lopez Carmen Lopez Main role (seasons 1–5) 2003–2005 Clifford's Puppy Days Nina Flores Recurring voice role 2006 Law & Order: Criminal Intent Mira Episode: \"Blasters\" 2014 Anger Management Molly Episode: \"Charlie and Sean Fight Over a Girl\" 2016 Sharknado: The 4th Awakens Gemini Television film 2017 Forgotten Evil Renee / Jane Doe / Veronica Television film 2017 Lopez Herself Episode: \"George Dates His Daughter\" 2017 Sharknado 5: Global Swarming Gemini Television film 2018 The Last Sharknado: It's About Time Gemini Television film 2019 My Best Friend's Christmas Bella Vega Television film; also known as Christmas Sweethearts ==Awards== Year Award Category Work Result Refs 2003 Young Artist Award Best Performance in a TV Series (Comedy or Drama) – Leading Young Actress George Lopez 2004 Young Artist Award Best Performance in a Voice-Over Role – Young Actress Clifford's Puppy Days 2004 Young Artist Award Best Performance in a TV Series (Comedy or Drama) – Leading Young Actress George Lopez == Related pages== *List of poets from the United States == References == == Other websites == * * Seven Questions with Masiela Lusha at Sitcoms On Line Category:1985 births Category:Living people Category:Actors from Los Angeles Category:People from Tirana Category:American movie actors Category:American television actors Category:American voice actors Category:Naturalized citizens of the United States Category:Albanian actors",
 "title": "Masiela Lusha"
}