{
 "id": "302252",
 "text": "Sidney Raymond Eudy (December 16, 1960 – August 26, 2024) was an American professional wrestler, better known by his ring names Sid Justice, Sid Vicious, and Sycho Sid in World Championship Wrestling and the World Wrestling Federation (WWF, now WWE). == Professional career == === Early career === Sid started his career in 1989, hired by World Championship Wrestling. During these years, Sid competed as one of the members of the team known as \"The Skyscrapers\" with \"Mean\" Mark Callous (who later became famous in the WWF/E as The Undertaker) and then later with Dan Spivey; he used the powerbomb as his maneuver fight. After recovering from an injury, Sid returned to the ring in May 1990 as a member of the team of Ric Flair. After leaving WCW Sid jouned the World Wrestling Federation, he made his presentation as Sid Justice on the July 20, 1991 episode of WWF Superstars of Wrestling and was also was chosen as the referee for the main fight at SummerSlam that year in a tag team match between The Ultimate Warrior and Hulk Hogan versus Sgt. Slaughter and Col. Mustafa billed as \"The Match Made In Hell.\" At the 1992 Royal Rumble he was one of the last two in the ring with Ric Flair when Hogan, who was already eliminated pulled Sid over the top rope with Flair assisting from behind helping Flair win his first WWF title. His crowning moment came at WrestleMania VIII, where Sid faced Hulk Hogan, Sid lost the fight by disqualification when Papa Shango interrupted to help Sid. Sid returned to WCW in May 1993. That year he teamed with Big Van Vader. After leaving WCW again, Eudy joined the United States Wrestling Association July 16, 1994, defeating Jerry Lawler and getting the World Heavyweight Championship. === WWF Championship === In 1995 Sid returned to the WWF on Monday Night Raw. Time after time he confronted Shawn Michaels for the title and at Survivor Series in 1996, where Sid applied a powerbomb to Michaels and won the WWF Championship. At the 1997 Royal Rumble in Michaels' hometown of San Antonio, the two fought again for the title with Michaels winning his 2nd title. One month later Sid captured his second WWF title by defeating Bret Hart on Raw,who had defeated Vader, Stone Cold Steve Austin and The Undertaker in a Fatal Four Way match the night before. At WrestleMania 13 in Chicago, Sid lost the title to the Undertaker. Sid's last match in the WWF was on June 9, 1997. === After WWF === After leaving the WWF, Sid was hired by Extreme Championship Wrestling. Soon after, he found himself back with his former company, WCW. There he joined his former colleagues of the WWF: Hulk Hogan, Randy Savage, Kevin Nash, Scott Hall, Bret Hart, and new WCW superstars Bill Goldberg and Chris Benoit. His best moment was when he won the WCW championship by defeating Kevin Nash twice. ==Death== Eudy died on August 26, 2024 in Marion, Arkansas from non-Hodgkin's lymphoma, aged 63. == Championships and accomplishments == * American Wrestling Federation ** AWF Super Heavyweight Championship (1 time) * Continental Wrestling Association ** CWA Heavyweight Championship (1 time) * NWA Northeast ** NWA Northeast Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Comeback of the Year (1996) ** Ranked No. 16 of the top 500 singles wrestlers in the PWI 500 in 1991 ** Ranked No. 122 of the top 500 singles wrestlers of the \"PWI Years\" in 2003 * Southeastern Championship Wrestling ** NWA Southeastern Heavyweight Championship (Northern Division) (1 time) ** NWA Southeastern Tag Team Championship (1 time) – with Shane Douglas * United States Wrestling Association ** USWA Texas Heavyweight Championship (1 time) ** USWA Unified World Heavyweight Championship (2 times) * World Championship Wrestling ** WCW World Heavyweight Championship (2 times) ** WCW United States Heavyweight Championship (1 times) * World Wrestling Federation ** WWF Championship (2 times) * Wrestling Observer Newsletter ** Most Overrated (1993) ** Readers' Least Favorite Wrestler (1993) ** Worst on Interviews (1999) ** Worst Worked Match of the Year (1990) vs. The Nightstalker == References == == Further reading == * WrestleCrap: The Very Worst of Pro Wrestling by R. D. Reynolds,Randy Baer * Billboard Oct 30 1999 * Hardcore History: The Extremely Unauthorized Story of ECW by Scott E. Williams,George Tahinos,Shane Douglas == Other websites == * * *Pro Wrestling Archive Profile *HitTheRopes.com Interview *Oct 30 2008 Audio Interview with In Your Head Category:1960 births Category:2024 deaths Category:American professional wrestlers Category:Sportspeople from Arkansas Category:Former WWE wrestlers Category:Cancer deaths in Arkansas Category:Deaths from non-Hodgkin lymphoma",
 "title": "Sid Eudy"
}