{
 "id": "302315",
 "text": "Navy Yard, also known as Near Southeast, is a neighborhood on the Anacostia River in Southeast Washington, D.C. Navy Yard is bounded by Interstate 395 to the north, South Capitol Street to the west, and the Anacostia River to the south and east. The neighborhood is named after the Washington Navy Yard. The Navy Yard fills about half of the neighborhood. The neighborhood is in D.C.'s Ward 6, currently represented by Tommy Wells. It is served by the Navy Yard Metro station on the Green Line. ==History== Historically, the Anacostia River was once a deep water channel with natural resources and home to the Nacotchtank Indians. In 1791, Pierre Charles L’Enfant designed the plan for Washington D.C. and, recognizing the worth of the Anacostia River, set up the city’s new commercial center and wharfs there. In 1799, the Washington Navy Yard was built in the area and for many decades was the nation’s largest naval shipbuilding facility. Today, the Washington Navy Yard has been run by the Navy longer than anywhere else.Capitol Riverfront BID | History of the Neighborhood The Navy Yard was a busy center in the 19th century and was important in the development of the area. The lively wharf was a center for jobs, serving ships with lumber and raw materials for the growing city. It also played a key role in defending the city from the British during the War of 1812. Surrounding the wharfs was a large commercial district, light industrial businesses, and one of the city’s most notable neighborhoods. As the city and nation developed, the Navy Yard changed from ship building to making finished ship products and weapons ammunition. By the mid-1940s in wartime the Navy Yard and the expanded Annex area were making the most ammo with 26,000 employees in 132 buildings on of land. However, during the 20th century the river got worse. The pollution of the river made it less valuable to the city. After World War II, the Navy Yard moved everything to a smaller campus, slowing commerce in the area. For this and other reasons the riverfront neighborhoods became overrun with crime. ==Redevelopment== For many years, the neighborhood was an industrial district The area was formerly home to a large commercial and adult-entertainment district, which has now been displaced. Since 1990, the building of a new U.S. Department of Transportation office complex and Nationals Park, the new USD$600 million stadium of the Washington Nationals Major League Baseball team, caused quick changes in the neighborhood.Dana Hedgpeth - Contesting a Stadium's Power - washingtonpost.com Most of the neighborhood's land and businesses have been purchased by companies and is currently being developed into commercial and residential projects.A Transformed Neighborhood Awaits Stadium The area plans to contain 12 to of office space, 9,000 residential units, 1,200 hospitality rooms, of retail space, four public parks, and an Anacostia Riverwalk trail system.Capitol Riverfront BID | Neighborhood Dynamic ===Projects=== *Florida Rock is a site that will consists of project in four buildings. It will contain of office space, of retail, of residential units, and a hotel. There will also be two underground levels of parking with 1,087 spaces and green roofs and biofiltration systems. Construction is scheduled to start in the fall of 2009.FRP/RiverFront - Near Southeast DC Revitalization *A new Frederick Douglass Memorial Bridge on South Capitol Street has been proposed. The bridge would be shifted slightly to the south from its current location, possibly terminating in a new traffic rotary to be called Potomac Circle at South Capitol, R, and Potomac Streets.South Capitol Street/Frederick Douglass Bridge - Near Southeast DC Revitalization *The Yards is a public-private partnership spanning , of office space, 2,800 residential units, 160,000 to 350,000 square feet (15,000 to 33,000 m2) of retail space, and a riverfront park. The first construction (400 residential units) began in 2007 and the entire project is to be completed in three phases over 10–20 years.\"The Yards\"/Southeast Federal Center - Near Southeast DC Revitalization *In 2007, The United States Department of Transportation (USDoT) moved to the area with a new facility on , housing 7,000 workers. Building 170, a former electrical substation used by the Washington Navy Yard, is now owned by the USDoT.Department of Transportation HQ - Near Southeast DC Revitalization *Opening for the 2008 season, the new Nationals Park seats 41,000.Nationals Park - New DC Baseball Stadium for the Washington Nationals *The Ballpark District will contain 465,000 to 785,000 square feet (43,200 to 72,900 m2) of retail/restaurant space, 350,000 to 1,600,000 square feet (33,000 to 149,000 m2) of office space, 1,900,000 to 3,600,000 square feet (177,000 to 334,000 m2) (1570 to 2980 units) of residential space, and 7,000-8,000 parking spaces.DC Ballpark District *Capper/Carrollsburg is a redevelopment of the Capper/Carrollsburg public housing project as mixed-income residential units. The 700 Capper public housing units will be replaced one-for-one, and added to them will be another 700-plus market-rate and workforce-rate rental and ownership units. There will also be of office space and of retail space. The first townhouses will begin construction in early 2008.Capper/Carrollsburg Housing Redevelopment - Near Southeast DC Revitalization *Capper Community Center is replacing the current one at 5th and K Streets, and will include a daycare facility for 66 children, recreation center, computer laboratory, gymnasium, game room, and meeting/classrooms.New Community Center at Capper/Carrollsburg - Near Southeast DC Revitalization *In 2003, New Marine barracks were built in the area. In 1999, the DC Housing Authority transferred to the Department of the Navy about six acres of the Arthur Capper Dwellings site at 7th and K Streets, SE, for the development of Bachelor Enlisted Quarters, parking, personnel support and recreational facilities.New Marine Bachelor Enlisted Quarters *The 8th Street Historic District is a sub-area including the greatest remaining concentration of historic structures in the Near Southeast, and provides a strong connection between Capitol Hill and the Navy Yard. The rebuilding of this area is just starting, but at least one property has been bought by developers for USD $25 million dollars, and will be a new building containing of office space.8th Street Historic District - Near Southeast DC Revitalization *Maritime Plaza is a new development on East M Street. The first two phases (Buildings 1 and 2) have already been completed. The first building contains of office space, while the second houses contractors working with the Navy. Phases 3 and 4 are each 175,000 square foot/7-story office buildings. There are also plans for a 250-room 8-story hotel at the southwestern edge of the property.East M Street - Near Southeast DC Revitalization *Washington Canal Park is named for the historic Washington Canal, which provided a water-borne connection between the Anacostia River and the Potomac River via the National Mall. Designers envision \"trees, grass, plants, a splash pool, aquatic garden and fountain. Officials say runoff from area buildings will be filtered and recycled and used in the water features.\"Washington Canal Park - Near Southeast DC Revitalization *Diamond Teague Park is a planned $16 million public plaza (also referred to as the \"First Street Plaza\" or \"First Street Landing\") at the terminus of First Street envisioned as the principal \"window\" between the new baseball stadium and the river. It is expected to be constructed in phases in coordination with the redevelopment projects at Florida Rock.Diamond Teague Park/Earth Conservation Corps ==References== ==Other websites== * ANC 6B ANC 6D, Navy Yard's Advisory Neighborhood Commissions * \"A Neighborhood's Evolution\", news reports and interactive map, by The Washington Post * JDLand, news reports and pictures of Navy Yard's urban renewal * Capital Riverfront, Navy Yard's business improvement district Category:Neighborhoods in Washington, D.C. Category:1799 establishments in the United States Category:18th-century establishments in Washington, D.C.",
 "title": "Navy Yard, Washington, D.C."
}