{
 "id": "302345",
 "text": "The Getty Villa in Pacific Palisades, California, USA, is one of two locations of the J. Paul Getty Museum. The Getty Villa is an educational center and museum that covers the arts and cultures of Ancient Greece, Rome, and Etruria. The collection has 44,000 Greek, Roman, and Etruscan antiquities dating from 6,500 BC to 400 AD. The UCLA/Getty Master’s Program in Archaeological and Ethnographic Conservation is here. The online GettyGuide as well as through audio tours tell about the items owned by the museum. ==Collection== The collection has 44,000 Greek, Roman, and Etruscan antiquities dating from 6,500 BC to 400 AD. Among the outstanding items is Victorious Youth, one of few life-size Greek bronze statues to have survived to modern times. The Lansdowne Heracles is a Roman sculpture that was probably copied from an older Greek statue. The Villa also has jewelry and coin collections. The Villa's library has 20,000 books covering art from these periods. The Villa also displays the 'Getty kouros', which the museum lists as \"Greek, about 530 B.C., or modern forgery\" because scientific analysis is inconclusive as to whether the marble statue can be dated back to Greek times. If genuine, the Getty kouros is one of only twelve remaining intact kouroi.Robert Bianchi, Saga of The Getty Kouros, Archaeology (May/June 1994). The Marbury Hall Zeus is a tall marble statue that was recovered from the ruins at Tivoli near Rome. ===GettyGuide=== The \"GettyGuide\" has detailed information about the items owned by the museum. This is available both at the Museum, at various points known as \"GettyGuide stations\", and externally on its website.GettyGuide - Getty.edu Retrieved September 3, 2008. ==Photographs== Image:060807-004-GettyVilla003gallery.jpg|Gallery within the Villa Image:Pool at Getty Villa.JPG|The outer peristyle, viewed from above Image:Lansdowne Herakles.JPG|The Lansdowne Herakles, part of the museum's collection Image:Kouros_Real_or_Fake.jpg|Getty kouros, part of the museum's collection Image:Zeus_Getty_Villa.jpg|Marbury Hall Zeus, King of the Gods, at the Getty Villa Image:Head_of_Athena_Getty_Villa.jpg|Athena, Goddess of war, civilization, wisdom, strength, strategy, crafts, justice and skill Image:060807-002-GettyVilla002.jpg|Main Courtyard of the Villa == References == == Further reading == * * * == Other websites == * J. Paul Getty Trust official website * A four-part documentary about the villa and its Roman model, the Villa of the Papyri * Photos from the Getty Villa * flickr.com photos tagged with \"Getty Villa\" Category:Buildings and structures in Los Angeles Category:Museums in California Villa Category:1954 establishments in California",
 "title": "Getty Villa"
}