{
 "id": "302418",
 "text": "The Getty Research Institute (GRI), at the Getty Center in Los Angeles, California, is \"dedicated to furthering knowledge and advancing understanding of the visual arts\".About the Research Institute (Research at the Getty) Retrieved May 25, 2011. It is a program of the J. Paul Getty Trust. GRI maintains a research library, organizes exhibitions and other events, sponsors a residential scholars program, publishes books, and produces electronic databases. ==History== The GRI was originally called the \"Getty Center for the History of Art and the Humanities\", and was first discussed in 1983.Isenberg, Barbara. Manuscripts rated top Getty acquisition. Los Angeles Times, p. H1, March 10, 1983. Located in Santa Monica,Getty Center acquires sculptor's archive. New York Times, April 23, 1985. Retrieved May 25, 2011. its first director (beginning in 1985) was Kurt W. Forster.Muchnic, Suzanne. Getty Center's Kurt Forster resigns post. Los Angeles Times, p. 6, March 20, 1992. GRI's library had 30,000 volumes in 1983, but grew to 450,000 volumes by 1986. In a statement upon his departure in 1992, Forster summarized his tenure as \"Beginning with the rudiments of a small museum library... the center grew... to become one of the nation's preeminent research centers for arts and culture...\". In 1994, Salvatore Settis, a professor of the history of classical art and archeology in Italy, became the director of the Center.Briefing - Italian professor to join Getty. Daily News of Los Angeles, March 9, 1993. By 1996, the Center's name had been changed to \"Getty Research Institute for the History of Art and the Humanities\",Getty Research Institute for the History of Art and the Humanities Announces 1996-97 Getty Scholars. Retrieved May 25, 2011. and by 1999 it was known simply as \"Getty Research Institute\".The Getty Research Institute Announces 1999-2000 Getty Scholars. September 7, 1999. Retrieved May 25, 2011. One GRI's special projects was \"L.A. as Subject: The Transformative Culture of Los Angeles Communities\" conducted between 1995 and 1999, whose purposes included \"enhanc[ing] existing resources and develop new resources that support new research scholarship on LA and also encourag[ing] the preservation, conservation, and display of local material culture\". GRI worked with other local organizations to publish Cultural Inheritance/L.A.: A Resource Directory of Less Visible Archives and Collections in the Los Angeles Region in 1999.Johnson, Reed. Getty helping bring L.A. history together. Daily News of Los Angeles, June 8, 1999. In 2000, the \"L.A. as Subject\" project was transferred to the University of Southern California. That school continues to update and expand an online version of the resource directory. The Getty Information Institute (formerly the Art History Information Program, established in 1983) was dissolved in 1999 as a \"result of a change of leadership at the Getty Trust\".Fink, Eleanor E. The Getty Information Institute. A retrospective. D-Lib Magazine, March 1999, Volume 5, Issue 3. Retrieved May 25, 2011. GRI absorbed \"many of its functions\". In 2000, Thomas E. Crow was hired as GRI director to replace Settis who had resigned in 1999.Encore - short subjects. Getty's choice. Orange County Register, February 20, 2000. Crow announced in October 2006 that he would be leaving for New York University.Thomas W. Gaehtgens named director of the Getty Research Institute. August 14, 2007. Retrieved May 25, 2011. Since November 2007 Thomas W. Gaehtgens has been GRI's director;Associated Press. \"German art historian to head Getty's research institute in LA.\" International Herald Tribune, August 14, 2007. he was previously (1985–1986) a visiting scholar with the Getty Center for the History of Art and the Humanities. ==Programs== ===Library=== Among other holdings, GRI's research library owns about 900,000 volumes of books, periodicals, and auction catalogs; special collections; and two million photographs of art and architecture.Research Library Overview (Research at the Getty). Retrieved May 25, 2011. The library is at the Getty Center. It does not loan its items to be taken out of the library. However, any visitor can come to the library to use items there. ===Exhibitions and other events=== GRI holds three public art shows (exhibitions) per year in its gallery which \"focus primarily on the special collections of the Research Library or on work produced by artists in residence\". For example, in 2005–2006 GRI held an exhibition entitled \"Julius Shulman, Modernity and the Metropolis\".Getty Research Institute. Julius Shulman, modernity and the metropolis. October 11, 2005 - January 22, 2006. Retrieved May 26, 2011. The exhibition traveled to the National Building MuseumNational Building Museum. Julius Shulman: modernity and the metropolis. April 1, 2006 - July 30, 2006. Retrieved May 26, 2011. and to the Art Institute of Chicago.Art Institute of Chicago. Julius Shulman: modernity and the metropolis. September 2, 2006 - December 3, 2006. Retrieved May 26, 2011. In addition to exhibitions, GRI has lectures (open to the public), colloquia (most open to the public), workshops (by invitation only), and screenings of films and videos (open to the public).Getty Research Institute. Colloquia, lectures, and workshops. Retrieved September 2, 2008. ===Residential scholars program=== The GRI hires people who work at other art museums and colleges to work for a year at GRI. After the year is over, the people go back to their old jobs. The goal is to help spread ideas between people who work for different art museums. The residential scholars program seeks to \"integrate the often isolated territory of art history into the wider sphere of the humanities\".Muchnic, Suzanne. Getty's visiting guinea pig scholars. Los Angeles Times, p. 98, August 10, 1986. The first class of scholars arrived in 1985–1986; they had their salaries paid for and their housing provided but were under \"absolutely no obligation to produce\". Among the notable scholars was German writer Christa Wolf in 1993–1994, who wrote the novel Medea: a modern retelling during her year at GRI.Gitlin, Todd. \"I did not imagine that I lived in truth\". New York Times, April 4, 1993. Retrieved May 25, 2011.Wolf, Christa. Medea: a modern retelling. New York: Nan A. Talese, 1998. Slavitt, David R. Revenge fantasy. Christa Wolf puts a late-20th-century spin on the story of Jason and Medea. New York Times, June 14, 1998. Retrieved September 2, 2008. (paid site) Each year the scholars are invited to work on projects related to an annual theme.Getty Research Institute. Past Themes & Scholars. Retrieved May 25, 2011. In 2008–2009, the theme for the Getty Center was \"Networks and Boundaries\" and for the Getty Villa \"The Power and Function of Ancient Images\". The lengths of stay vary: Getty scholars are in residence for three, six or nine months, visiting scholars for one to three months, and predoctoral and postdoctoral fellows for a nine month academic year. In 2011-12, the theme is \"Artistic Practice\". ===Publications=== GRI publishes \"Series Imprints\" books in the categories of \"Issues and Debates\", \"Texts & Documents\", \"Introduction To\" (on \"cultural heritage information in electronic form\"), and \"ReSources\" (on the library's special collections).Getty Research Institute. Publications Overview. Retrieved September 2, 2008. In addition, GRI publishes exhibition catalogs and other materials in hardcopy form. This is a list of some of the books published by GRI, by the Getty Research Institute for the History of Art and the Humanities, by the Getty Center for the History of Art and the Humanities, by the Getty Information Institute, or by the Art History Information Program: * Bakewell, Elizabeth, et al. Object, image, inquiry: the art historian at work: report on a collaborative study by the Getty Art History Information Program (AHIP) and the Institute for Research in Information and Scholarship (IRIS), Brown University. Santa Monica, CA: AHIP, 1988. * Gaehtgens, Thomas W., and Heinz Ickstadt. American icons: transatlantic perspectives on eighteenth- and nineteenth-century American art. Santa Monica, CA: Getty Center for the History of Art and Humanities, 1992. * Necipoglu, Gülru, and Mohammad Al-Asad. The Topkapi scroll: geometry and ornament in Islamic architecture: Topkapi Palace Museum Library MS H. 1956. Santa Monica, CA: Getty Center for the History of Art and the Humanities, 1995. * Roth, Michael S., Claire L. Lyons, and Charles Merewether. Irresistible decay: ruins reclaimed. Los Angeles, CA: Getty Research Institute for the History of Art and the Humanities, 1997. * Baca, Murtha. Introduction to metadata: pathways to digital information. Los Angeles, CA: Getty Information Institute, 1998. * Warburg, Aby. The renewal of pagan antiquity: contributions to the cultural history of the European Renaissance. Los Angeles, CA: Getty Research Institute for the History of Art and the Humanities, 1999. * Paul, Carole, and Alberta Campitelli. Making a prince's museum: drawings for the late-eighteenth-century redecoration of the Villa Borghese. Los Angeles, CA: Getty Research Institute, 2000. * Phillips, Glenn, and Thomas E. Crow. Seeing Rothko. Los Angeles: Getty Research Institute, 2005. * Reed, Marcia, and Paola Demattè. China on paper: European and Chinese works from the late sixteenth to the early nineteenth century. Los Angeles: Getty Research Institute, 2007. ===Electronic databases=== GRI continues to produce some of the electronic databases from the former Getty Information Institute. They are: * Getty Vocabulary Program databases (Art & Architecture Thesaurus (AAT), Getty Thesaurus of Geographic Names (TGN), and Union List of Artist Names (ULAN))Getty Research Institute. Learn about the Getty Vocabularies. Retrieved May 26, 2011. * Bibliography of the History of ArtGetty Research Institute. Bibliography of the History of Art. Retrieved May 26, 2011. In 2006, GRI and the OCLC Online Computer Library Center announced that the Getty Vocabularies (Art & Architecture Thesaurus, Getty Thesaurus of Geographic Names, and Union List of Artist Names) will be available as a Web service.OCLC Online Computer Library Center, Inc. Getty Vocabularies added to OCLC Terminologies Service. November 9, 2006. Retrieved May 26, 2011. Until July 1, 2009, the Getty Information Institute and later GRI co-produced the Avery Index to Architectural Periodicals with the Avery Architectural and Fine Arts Library. On that date, GRI transferred the database back to Columbia University, which continues to maintain it. ==Senior staff== GRI's senior staff includes: * Thomas W. Gaehtgens, Director * Andrew Perchuk, Deputy Director * Gail Feigenbaum, Associate Director * David Farneth, Assistant Director * Kathleen Salomon, Assistant Director * Marcia Reed, Chief Curator ==Employees and budget== During the period July 2006 – June 2007, GRI had approximately 200 full-time and part-time employees. Its budget was $63.7 million. ==References== == Other websites == * Interviews with art historians, 1991-2002 The Getty Research Institute, Los Angeles, California. Transcripts, audio cassette tapes, and computer disks record interviews with contemporary art historians, archaeologists, bibliographers, and selected key individuals from the J. Paul Getty Trust. * Steve Lanzarotta records, 1983-2001 The Getty Research Institute, Los Angeles, California. These records were created and maintained by Steve Lanzarotta during his employment with the Getty Research Institute (GRI) and its predecessors, the Getty Research Institute for the History of Art and the Humanities and the Getty Center for the History of Art and the Humanities (GCHAH). * Letters and papers of British artists, 1774-1964 The Getty Research Institute, Los Angeles, California. The collection, assembled by the repository, comprises 1360 items, mostly letters signed by 507 British painters, illustrators, printmakers, draughtsmen, and sculptors. The collection includes circa 40 illustrated letters, as well as sketches, press clippings, manuscripts, and reproductions of art works. Most items date from the late 19th century. * Letters of British Architects, 1793-1921 The Getty Research Institute, Los Angeles, California. The collection includes 80 letters, 3 prints and 1 seat diagram for the 1907 RIBA annual dinner. The letters were written by 34 British architects between 1793 and 1921, most of them from the second half of the 19th century. * Letters of British art patrons, collectors, and dealers, 1821-1921 The Getty Research Institute, Los Angeles, California. The collection comprises 66 letters written by 47 persons between May 1821 and June 1921. Most letters date to the 19th century, with only a few items from the first quarter of the 20th century. * Letters of British authors, 1770-1915 The Getty Research Institute, Los Angeles, California. The collection comprises 150 letters sent by 73 persons. The letters are dated from 1770 to 1915, with the bulk from the 1840s to the 1890s. Three letters are dated from 1770, 1791 and 1798, and 24 are from the first quarter of the 20th century. Category:J. Paul Getty Trust Category:Museums in California Category:1985 establishments in California",
 "title": "Getty Research Institute"
}