{
 "id": "302471",
 "text": "is a Japanese city in Mie Prefecture on the island of Honshū. As of 2008, the city has an estimated population of 197,437 and a population density of 1,010 people per km². The total area is 194.67 km². Suzuki is about 83 km east from Nara, and 52 km southwest from Nagoya. ==History== In the Edo period, Ishiyakushi-juku and Shōno-juku were 44th and 45th of the 53 shogunate- maintained waystations (shuku-eki) along the Tōkaidō road which connected Edo and Kyoto.Nussbaum, Louis-Frédéric. (2005). \"Tōkaidō\" in Japan Encyclopedia, p. 973. Both Tōkaidō rest stops are within the boundaries of modern Suzuka. In December 1942, two towns and twelve villages were merged to form Suzuka. It was a military administered city, and had a population of 52,000. After World War II, many automotive companies and other industries moved into Suzuka. == Local Dialects == Suzuka is by the Suzuka Quasi National Park (the boundary between Suzuka and Shiga). Since the industrial boom, it has been a interchange point for the main commuter train lines. With the mix of commuters passing through Suzuka city, the local dialect (hōgen) is a mixture of three, variations of Japanese. == Industry == Suzuka has a significant industrial base. It has large factories for both Sharp and Honda. == Motor racing circuit == Suzuka Circuit was the home of the Japanese Grand Prix from 1987 to 2006. The Grand Prix returned in 2009 and the racing continues through the present. It was the only figure-of-eight circuit in the championship, and is very popular with the drivers. Next to the circuit is the Honda Safety Riding/Driving School. Thousands of car and motorcycle drivers have been trained at the school. Graduates include many police officers and instructors throughout the world. ==Gallery== File:Hiroshige, Great Tokaido Series Ishiyakushi.jpg|Ishiyakushi rest stop by Hiroshige, ukiyo-e woodblock print c. 1830s File:Tokaido45 Shono.jpg|Shōno rest stop by Hiroshige, c. 1830s File:JGR Kasado Station in.jpg|Kasado railway station, 1927 ==Related pages == * The Fifty-three Stations of the Tōkaidō == References == == Other websites == * Suzuka City website * Hiroshige prints, Ishiyakushi , Shono Category:Cities in Mie Prefecture",
 "title": "Suzuka, Mie"
}