{
 "id": "302490",
 "text": "The State University of New York Upstate Medical University is a public medical school in the city of Syracuse, New York, USA. It is part of the State University of New York system. Upstate's main departments includes the College of Medicine, College of Nursing, College of Health Professions and College of Graduate Studies. It is one of only 140 academic medical centers in the USA and takes care of 1.8 million people yearly. 10,959 people work at Upstate and it creates more than $2.5 billion in impact. Upstate is Central New York's largest employer. == History == The present-day university's earliest predecessor was Geneva Medical College founded 1834 as part of Geneva College, today known as Hobart and William Smith Colleges. The new medical college was located in Geneva, New York, and became the first college to grant a full M.D. to a woman, Elizabeth Blackwell in 1849. In 1871, the college was disbanded and its assets donated to the recently-founded Syracuse University, which subsequently founded a medical college. In 1950, Syracuse University transferred the college to the State University of New York (SUNY). It has been owned by SUNY since then. At first the school was named \"SUNY Upstate Medical Center\" and later named \"SUNY Health Science Center at Syracuse\" in 1986. The current name was adopted in 1999. A clinical campus in Binghamton, New York for third and fourth year medical students was established in 1979. A plaque in the lobby of Weiskotten Hall aptly describes one of the institution's driving philosophies: \"Dedicated to all those of scientific and technological mind who purpose to serve humanity.\" ==Campus== The university's main campus is located in downtown Syracuse, New York flanking Interstate 81. It includes the University Hospital, the Institute for Human Performance, Setnor Academic Building, Central New York Gamma Knife Center, Jacobsen Hall, Regional Oncology Center, Upstate Golisano Children's Hospital, Weiskotten Hall (which includes the Health Sciences Library), and Clark Tower dormitory for 170 students. A clinical campus in Binghamton, New York teaches third and fourth year medical students. Some students spend their first two years of medical school in Syracuse, New York and then complete their training in Binghamton. Other students stay in Syracuse for all four years. ==Organization== The College of Medicine is one of the oldest medical schools in New York. It has the highest percentage of non-white students of any medical school in the state. More physicians practicing in Central New York received their training at Upstate than at any other medical school. Upstate also ranks eighth nationally for the number of graduates who are on the faculty of a academic medical center in the United States. The Colleges of Nursing and Health Related Professions also important to Central New York. The College of Nursing is the only nursing school in New York to offer graduate programs in all major tracks: nurse practitioner, clinical nurse specialist, nurse midwifery, and nurse anesthesia. About three-fourths of its students are minorities. The College of Health Related Professions is the gateway for students seeking to enter some of the most competitive and highly paid careers in healthcare today: physician assistant, physical and occupational therapy, medical informatics, diagnostic medical imaging, and midwifery. The college is particularly proud of its historic claim to having the oldest midwifery program in the nation. The School of Graduate Studies is known for its excellence in basic science education and research. Students have the opportunity to work side by side with many of the top neuroscientists and basic researchers in the country. The university operates the Southern Tier Center on Aging in conjunction with SUNY Binghamton. The Center develops, implements and evaluates new interventions and models of service delivery geared to enhancing quality of life of older adults and their caregivers. The current president is Mantosh Dewan, MD. == Notable alums and professors == * Robert B. Barlow, Ph.D. - Professor of Ophthalmology, Director of Center for Vision Research * Elizabeth Blackwell, M.D. - First woman in the United States to be awarded the degree of Medical Doctor. Founder of The New York Infirmary, now The New York Downtown Hospital. * Joe Dervay, M.D. - NASA Flight Surgeon * Maxwell Mozell, Ph.D. - Distinguished Service Professor of Clinical Olfactory Research Institute and Chemosensory * Frederick Parker, M.D. - Professor of Cardiac Surgery, Chairman of the Department of Surgery * Robert Rohner, M.D. - Professor of Pathology, Philip Armstrong Award Winner * David P. Schenkein, M.D. - Senior Vice President Clinical Hematology/Oncology at Genentech Inc. (San Francisco, CA); Former Senior Vice President of Oncology Clinical Development at Millennium Pharmaceuticals Inc. and developer of cancer drug Velcade * Elinor Spring-Mills, Ph.D - Distinguished Service Professor of Anatomy and Cell Biology * Thomas Szasz - Professor Emeritus of Psychiatry * Irwin M. Weiner, M.D. - Professor of Renal Physiology, architect of the SUNY Graduate Research Initiative * William J. Williams, M.D. - Professor of Clinical Medicine, author of the Williams Manual of Hematology ==References== == Further reading == * == Other websites == *Official website *campus map Category:Syracuse, New York Category:1834 establishments in the United States Category:1830s establishments in New York (state) Category:Medical education in the United States Category:State University of New York",
 "title": "State University of New York Upstate Medical University"
}