{
 "id": "302593",
 "text": "Judiciary Square is a neighborhood in Northwest Washington, D.C.. It has various federal and municipal courthouses and a number of important federal and municipal office buildings. Judiciary Square is roughly between Pennsylvania Avenue to the south, H Street NW to the north, 6th Street to the west, and the I-395 access tunnel to the east. The center of the Judiciary Square neighborhood is an actual plaza by the name of Judiciary Square, so named because it is adjacent to or inclusive of most of the courthouse buildings in the area. The square is between 4th and 5th Streets, with D Street to the south and F Street to the north. Among the buildings in Judiciary Square are: *Four buildings of the H. Carl Moultrie Courthouse, which houses the Superior Court of the District of Columbia, the local trial court *Historic Courthouse, which houses the District of Columbia Court of Appeals, the highest D.C. court *E. Barrett Prettyman Federal Courthouse, which houses United States Court of Appeals for the District of Columbia Circuit *United States Court of Appeals for the Armed Forces, at 450 E Street NW *United States Court of Appeals for Veterans Claims, at 625 Indiana Avenue NW *United States Tax Court Building, which houses the United States Tax Court *Federal Bureau of Investigation Washington field office *Frances Perkins Building, which houses the United States Department of Labor, at 200 Constitution Avenue NW *Steve Young Law Enforcement Legislative Advocacy Center of the Fraternal Order of Police, at 328 Massachusetts Avenue NE *Government Accountability Office and United States Army Corps of Engineers, headquarters, at 441 G Street NW *Jackson Graham Building, headquarters of the Washington Metropolitan Area Transit Authority, at 600 5th Street NW *National Building Museum (Old Pension Building) at 4th Street, 5th Street, F Street, and G Street NW *One Judiciary Square at 441 4th Street NW. Historically the Old Courthouse, the building served as D.C.'s city hall until 1908, when city government moved to the newly built John A. Wilson Building on Pennsylvania Avenue NW. However, Judiciary Square once again became the site of District government between 1997 and 2001, when the Wilson Building was being renovated and the D.C. mayor and Council had temporary chambers and offices in the One Judiciary Square building. Today the building houses various D.C. offices **An 1868 statue of Abraham Lincoln stands in the plaza at what was the south entrance to the Old Courthouse, which today is the back entrance to the Historic Courthouse, which houses the District of Columbia Court of Appeals. This was the first public monument ever built to Lincoln, funded by Washington residents starting just days after his death. *Washington, D.C. Department of Motor Vehicles *National Law Enforcement Officers Memorial *AARP headquarters at 601 E Street NW *Monuments to Albert Pike, José de San Martín (which has since been moved to Virginia Avenue), and John Marshall. The neighborhood is served by the Judiciary Square station on the Red Line of the Washington Metro. ==History== During the first half of the 19th century, Judiciary Square was mostly residential. Its proximity to the courthouses drew a number of lawyers, judges, and clerks to the neighborhood, while its location between the White House and the Capitol made it ideal for government employees. Among its most prominent residents were Missouri Senator Thomas Hart Benton, Vice President John C. Calhoun, and Daniel Webster. As of 2006, however, nearly all of the once plentiful rowhouses in the area were gone, with the remaining houses mostly centered around the intersection of 5th and D Streets. Around the turn of the 20th century, the eastern side of Judiciary Square became an enclave of Italian immigrants in Washington - the equivalent of a Little Italy (although it was never called that). The Italian neighborhood rested on the eastern edge of the square proper, stretching eastward to about 2nd Street NW. The heart of the community was Holy Rosary Church, a chapel built at 3rd and F Streets NW. The neighborhood lasted well into the 20th century, with a particular surge of Italian immigrants in the 1950s and 60s; in the mid 1970s, however, construction of the I-395 northbound extension through the city gutted about half of the neighborhood and forced its remaining residents to move away from the heavy commuter traffic. Today the former Italian enclave is dominated by Federal office buildings and law offices for the trial attorneys who argue in Judiciary Square courthouses, although Holy Rosary Church remains standing and continues to draw a heavily Italian congregation along with its \"Casa Italia\" cultural center next door. Category:Neighborhoods in Washington, D.C.",
 "title": "Judiciary Square, Washington, D.C."
}