{
 "id": "302716",
 "text": "Jean Paul Getty (December 15, 1892 – June 6, 1976) was an American industrialist.Whitman, Alden. J. Paul Getty dead at 83; amassed billions from oil. New York Times, June 6, 1976. Retrieved September 6, 2008. He founded the Getty Oil Company. In 1957 Fortune magazine named him the richest living American.List of 76 said to hold above 75 millions. New York Times, October 28, 1957. The 1966 Guinness Book of Records named him as the world's richest private citizen, worth an estimated $1,200 million.Norris & Ross McWhirter, Guinness Book of Records, London, 1966, p.229 When he died he was worth more than $2 billion.Lenzner, Robert. The great Getty: the life and loves of J. Paul Getty, richest man in the world. New York: Crown Publishers, 1985. A book published in 1996 ranked him as the 67th richest American who ever lived. (The book ranked his wealth as a percentage of the United States gross national product.) Despite his wealth, Getty was known for being a miser. Getty enjoyed collecting art and antiquities. His collection formed the basis of the J. Paul Getty Museum in Los Angeles, California. He left $661 million to the museum after his death. He established the J. Paul Getty Trust in 1953. The trust is the world's wealthiest art institution. It operates the J. Paul Getty Museum, the Getty Foundation, the Getty Research Institute, and the Getty Conservation Institute.Edward Wyatt, \"Getty Fees and Budget Reassessed,\" The New York TImes, April 30, 2009, p. C1. ==Biography== \"The meek shall inherit the earth, but not its mineral rights.\" — dictum attributed to John Paul Getty His father George Getty owned a petroleum business in Minneapolis, Minnesota. He enrolled at the University of Southern California, then at University of California, Berkeley before graduating in 1914 from Magdalen College, Oxford with degrees in economics and political science. He spent his summers between studies working on his father's oil fields in Oklahoma. Running his own oil company in Tulsa, he made his first million by 1916. In 1917, he announced that he was retiring to become a Los Angeles-based playboy. Although he eventually returned to business, Getty had lost his father's respect. Just before George Getty died in 1930, he believed that Jean Paul would destroy the family company, and told him so. After taking a few years off from the money-making grind to enjoy spending his money on women, Getty returned to Oklahoma in 1919. During the 1920s he added about $3 million to his already sizable estate. His marriages and divorces (three during the 1920s, five throughout his life) distressed his father. J. Paul inherited only $500,000 of the $10 million the senior Getty left at his death in 1930. Getty carefully invested his resources during the Great Depression. Getty bought Pacific Western Oil Corporation. He began buying (completed in 1953) the Mission Corporation, which included Tidewater Oil and Skelly Oil. In 1967 he merged them into Getty Oil. Beginning in 1949, Getty paid Ibn Saud $9.5 million in cash and $1 million a year for a 60-year concession to a tract of barren land near the border of Saudi Arabia and Kuwait. No oil had ever been discovered there. After spending $30 million over four years, oil was discovered there. From 1953 onward, Getty's gamble produced a year. This contributed greatly to the fortune which made him one of the richest people in the world. Getty learned to speak Arabic which helped him expand his business into the Middle East. Getty owned the controlling interest in nearly 200 businesses, including Getty Oil. Associates identified his overall wealth at between $2 billion and $4 billion. It did not come easily. Perhaps it inspired Getty's widely quoted remark—\"The meek shall inherit the earth, but not the mineral rights.\"\"Thoughts On The Business Of Life\" at Forbes He moved to England in the 1950s and loved English culture. He lived and worked at his 16th-century Tudor estate, Sutton Place near Guildford. This traditional country house became the centre of Getty Oil and his associated companies. He used the estate to entertain his British and Arabian friends (including the British Rothschild family and numerous rulers of Middle Eastern countries). Getty lived the rest of his life in the British Isles. He died of heart failure at the age of 83 on June 6, 1976. ===Marriages, divorces, and children=== Getty was married and divorced five times. He had five sons with four of his wives:Vallely, Paul. Don't keep it in the family. The Independent (London), July 19, 2007. Retrieved September 6, 2008. # Jeanette Demont (married 1923 – divorced 1926); one son George Franklin Getty II (1924–1973) # Allene Ashby (1926–1928?, that is, bigamous 1926-1927 and its exact resolution is unknown) # Adolphine Helmle (1928–1932); one son Jean Ronald Getty (born 1929) # Ann Rork (1932–1936); two sons Eugene Paul Getty, later John Paul Getty Jr. (1932–2003), and Gordon Peter Getty (born 1933) # Louise Dudley Lynch (1939–1958); one son Timothy Ware Getty (1946–1958) He was quoted as saying \"A lasting relationship with a woman is only possible if you are a business failure\". ===Success as an autobiographical author=== Getty wrote a very successful book entitled How to Be Rich. === Coin-box telephone === Getty famously had a pay phone installed at Sutton Place, helping to seal his reputation as a miser. In his autobiography, he described his reasons: :Now, for months after Sutton Place was purchased, great numbers of people came in and out of the house. Some were visiting businessmen. Others were artisans or workmen engaged in renovation and refurbishing. Still others were tradesmen making deliveries of merchandise. Suddenly, the Sutton Place telephone bills began to soar. The reason was obvious. Each of the regular telephones in the house has direct access to outside lines and thus to long-distance and even overseas operators. All sorts of people were making the best of a rare opportunity. They were picking up Sutton Place phones and placing calls to girlfriends in Geneva or Georgia and to aunts, uncles and third cousins twice- removed in Caracas and Cape Town. The costs of their friendly chats were, of course, charged to the Sutton Place bill.Getty, 1976, pg.319 Getty placed dial-locks on all the regular telephones, limiting their use to authorised staff, and the coin-box telephone was installed for others. When speaking in a televised interview with Alan Whicker, Getty said that he thought guests would want to use a payphone . ==Grandson's kidnapping== On July 10, 1973 in Rome, 16 year old John Paul Getty III was kidnapped and a ransom of $17 million was demanded over the phone for his safe return. However, \"the family suspected a ploy by the rebellious teenager to extract money from his miserly grandfather.\"Sir Paul Getty (obituary). Telegraph, April 17, 2003. John Paul Getty II asked his father for the money, but was refused.Profile: Sir John Paul Getty II. BBC News, June 13, 2001. In November 1973 an envelope containing a lock of hair and a human ear was delivered to a daily newspaper. The second demand had been delayed three weeks by an Italian postal strike. The demand threatened that Paul would be further mutilated unless $3.2 million was paid: \"This is Paul’s ear. If we don’t get some money within 10 days, then the other ear will arrive. In other words, he will arrive in little bits.\" When the kidnappers finally reduced their demands to $3 million Getty senior agreed to pay no more than $2.2 million - the maximum that would be tax deductible. He loaned his son the remaining $800,000 at 4% interest. Paul III was found alive in southern Italy shortly after the ransom was paid. After his release Paul III called his grandfather to thank him for paying the ransom but Getty refused to come to the phone. Nine people were later arrested for the kidnapping, but only two were convicted.J. Paul Getty III, 54, Dies; Had Ear Cut Off by Captors The New York Times, February 7, 2011. Paul III was permanently affected by the trauma and became a drug addict. After a stroke brought on by a cocktail of drugs and alcohol in 1981, Paul III could not speak. He was nearly blind and partially paralyzed for the rest of his life. He died thirty years later on February 5, 2011 at the age of 54. Getty defended his initial refusal to pay the ransom on two points. First, he argued that to submit to the kidnappers' demands would immediately place his other fourteen grandchildren at the risk of copy-cat kidnappers. He added: :The second reason for my refusal was much broader-based. I contend that acceding to the demands of criminals and terrorists merely guarantees the continuing increase and spread of lawlessness, violence and such outrages as terror- bombings, \"skyjackings\" and the slaughter of hostages that plague our present- day world. (Getty, 1976, pg.139). The 2017 movie All the Money in the World is based on these events. Christopher Plummer plays J. Paul Getty. In 2018, a television series based on the events, Trust, premiered with Donald Sutherland playing Getty. ==Published works== * Getty, J. Paul. The history of the bigger oil business of George F.S. F. and J. Paul Getty from 1903 to 1939. Los Angeles?, 1941. * Getty, J. Paul. Europe in the eighteenth century. [Santa Monica, Calif.]: privately printed, 1949. * Le Vane, Ethel, and J. Paul Getty. Collector's choice: the chronicle of an artistic odyssey through Europe. London: W.H. Allen, 1955. * Getty, J. Paul. My life and fortunes. New York: Duell, Sloan & Pearce, 1963. * Getty, J. Paul. The joys of collecting. New York: Hawthorn Books, 1965. * Getty, J. Paul. How to be rich. Chicago: Playboy Press, 1965. * Getty, J. Paul. The golden age. New York: Trident Press, 1968. * Getty, J. Paul. How to be a successful executive. Chicago: Playboy Press, 1971. * Getty, J. Paul. As I see it: the autobiography of J. Paul Getty. Englewood Cliffs, N.J. : Prentice-Hall, 1976. ==References== ==Further reading== * Hewins, Ralph. The richest American: J. Paul Getty. New York: Dutton, 1960. * Lund, Robina. The Getty I knew. Kansas City: Sheed Andrews and McMeel, 1977. . * Miller, Russell. The house of Getty. New York: Henry Holt, 1985. . * de Chair, Somerset Struben. Getty on Getty: a man in a billion. London: Cassell, 1989. . * Pearson, John. Painfully rich: J. Paul Getty and his heirs. London: Macmillan, 1995. . ==Other websites== *J. Paul Getty Diaries, 1938-1946, 1948-1976. The Getty Research Institute. Los Angeles, California. *Guide to the J. Paul Getty Family Collected Papers, 1880s-1989. The Getty Research Institute. Los Angeles, California. Collection primarily contains letters, photographs, financial records, legal documents, and publications created or collected by J. Paul Getty and his parents, George F. Getty I and Sarah C. Getty. *J. Paul Getty and Ashby sisters papers, 1926-1992. The Getty Research Institute, Los Angeles, California. Personal correspondence and telegrams, clippings, a book, and photographs, 1926-1992 and undated, related to J. Paul Getty, Allene Ashby (Getty's second wife), and Belene Ashby. *J. Paul Getty Trust *J. Paul Getty Museum *Insecula biography *Wiki-Genealogy *Getty's How To Be Rich: A commentary by Tom Butler-Bowdon * * Encyclopedia of Oklahoma History and Culture - Getty, J. Paul * Ranch House Records, 1921, 1945-1960s, 1980s, 1999-2007, undated The Getty Research Institute, Los Angeles, California. These records are organized in four series: Series I. Historic American Buildings Survey documentation, 1999, 2001; Series II. Renovation and administration records, 1954-1982; Series III. Architectural drawings, 1921, 1945-1951, 1975-1976 and undated; Series IV. Photographs and miscellaneous file, circa 1950s-1960s, 1980s, 1999-2007. * Collected papers for biography of J. Paul Getty, circa 1890s-1973, 1984, undated (bulk 1957-1973) The Getty Research Institute, Los Angeles, California. The collection comprises material created or collected by Ralph Hewins in the course of researching and writing the biography The Richest American: J. Paul Getty (1960). Category:American autobiographers * Category:Writers from Minneapolis Category:Businesspeople from Minneapolis Category:Writers from Oklahoma Category:Businesspeople from Oklahoma Category:American billionaires Category:1892 births Category:1976 deaths Category:Deaths from congestive heart failure",
 "title": "J. Paul Getty"
}