{
 "id": "302724",
 "text": "Muammar Muhammad Abu Minyar al-Gaddafi\"Al-Qadhafi, Muammar Muhammad\". Oxford Dictionary of Political Biography( Romanized: ) ( – 20 October 2011), commonly referred to as Colonel Gaddafi, was a Libyan politician and statesman. He ruled Libya from 1969 to 2011, when he was killed in the revolts of the Arab Spring. ==Early life== Muammar al-Gaddafi was born in a tent near Qasr Abu Hadi. His family came from a small tribal group called Qadhadhfa. His family were Arabized Berber people in heritage. He joined the Libyan military in 1961; the military was one of the few ways for lower class Libyans like him to rise in social status. He became a colonel. ==Ruler of Libya== Gaddafi became head of state of Libya after removing King Idris from power in a 1969 bloodless coup. He ruled Libya from September 1, 1969 to August 23, 2011. After the coup, Gaddafi established the Libyan Arab Republic. He was one of the longest-serving non royal rulers in history, because he had ruled for more than 41 years.Charles Féraud, \"Annales Tripolitaines\", the Arabic version named \"Al Hawliyat Al Libiya\", translated to Arabic by Mohammed Abdel Karim El Wafi, Dar el Ferjani, Tripoli, Libya, vol. 3, p.797. Gaddafi used Arab socialist and Arab nationalist ideas. He published a book about his philosophical views in 1975. This book is commonly known as The Green Book. In 1977, he left the power of Libya, and continued playing role of revolutionary. People called him the \"Brother Leader and Guide of the Revolution\".Daniel Don Nanjira, African Foreign Policy and Diplomacy: From Antiquity to the 21st Century, Greenwood Publishing Group, 2010, p. 279 n. 2Background Notes, (November 2005) \"Libya – History\", United States Department of State. Retrieved on 14 July 2006. The Libyan Arab Republic was renamed to the Socialist People's Libyan Arab Jamahiriya in 1977 later it was renamed again to the Great Socialist People's Libyan Arab Jamahiriya by Gaddafi in 1986. In the 1980s, he made chemical weapons, because of it critics called Libya a pariah state. A Dutch investigation found that Gaddafi had built up a \"billion-dollar empire\", from assets in an international company in the oil industry. It also claims that his assets are scattered throughout much of Europe, Despite no trace or proof for even 1 billion have been found. Gaddafi had a strong interest in geo-political control, was a firm supporter of [OPEC] and led a Pan-African campaign for a United States of Africa. In 1986 Libya was bombed by the United States, the home of Gaddafi was also targeted but he survived. The bombing was condemned by many nations and also by UN. In 1988, the United Nations put economic sanctions onto Libya. Gaddafi started to have closer economic and security relations with the West. He cooperated with investigations into alleged Libyan anti-western acts, by 1999 he offered to dismantle weapon of mass destruction of Libya, which would be inspected in 2003. As a result, the UN sanctions were lifted in the same year. Gaddafi was elected Chairperson of the African Union in 2009. ==2011 Libyan protests== In February 2011 there were major violent protests against Libyan government. These came alongside other demonstrations in Tunisia, Egypt, and other parts of the Arab world. The protests quickly turned into a civil war. Gaddafi vowed to \"die a martyr\" if necessary in his fight against rebels and external forces; he also said that \"peaceful protest is one thing but armed rebellion is another.\" ==Accusal of Crimes== On 17 May 2011 the International Criminal Court issued a request for an arrest warrant against Gaddafi for alleged crimes against humanity,ICC requests Gaddafi arrest warrant which was approved on 27 June and a warrant was issued by the court. In June 2011, according to investigation made by Amnesty International, it was found that there was no evidence for many of the alleged crimes, and that the rebels had falsely blamed Gaddafi as well as the government. He was accused of ordering the Lockerbie bombing in Scotland that killed over 200 people. The bombing targeted a civilian plane and it was downed. == Downfall and assassination == Gaddafi faced a tumultuous downfall in 2011 during the Arab Spring. Protests and rebel forces opposed his rule, leading to a NATO intervention. Gaddafi's forces clashed with rebels, and he eventually fled Tripoli. The Libyan Civil War (2011) erupted in February. The aim was to remove Gaddafi from power. Gaddafi was captured and shot dead by NATO backed rebels in Sirte, Libya, on 20 October 2011.https://www.bbc.co.uk/news/world-africa-15390980 BBC News Africa Sirte was the last stronghold of the Gaddafi regime, marking the end of his authoritarian regime. == References == Category:1942 births Category:2011 deaths Category:African military people Category:Assassinated people Category:Berber people Category:Colonels Category:Heads of state of Libya Category:Muslims Category:Prime ministers of Libya Category:Former dictators Category:Socialists Category:African Union chairpersons",
 "title": "Muammar al-Gaddafi"
}