{
 "id": "302856",
 "text": "Arlington National Cemetery is a cemetery in Arlington County, Virginia. People who served in the United States military are buried here. The cemetery started during the American Civil War. It is on a big farm called Arlington House. Arlington House was the home of Mary Anna Custis Lee. Mary Anna Custis Lee was a great-granddaughter of Martha Washington. She was also the wife of Confederate general Robert E. Lee. Although most of the farm now has graves, the old farmhouse still stands in the middle of the cemetery. The cemetery is across the Potomac River from the Lincoln Memorial in Washington, D.C.. The cemetery covers acres. People who died serving the United States in a war, and military veterans are allowed to be buried in the cemetery. People are buried here who fought in wars from American Civil War to the military actions in Afghanistan and Iraq. People who were buried here before the Civil War were reburied after 1900. Arlington National Cemetery is taken care of by the United States Army. Arlington House (Custis-Lee Mansion) and its land are taken care of by the National Park Service as a memorial to Lee. Recently, the way the cemetery is managed caused controversy. ==History== George Washington Parke Custis was the grandson of Martha Washington, and grew up with Martha and George Washington. He got the land that now is Arlington National Cemetery in 1802. He began building Arlington House, where he lived with his wife Mary Lee Fitzhugh Custis. The land and house was given to their only child that lived to be an adult, Mary Anna Custis Lee. She was married to Robert E. Lee, a West Point graduate and United States Army officer. When Fort Sumter was forced to surrender at the beginning of the American Civil War, President Abraham Lincoln asked Lee to be the general of the federal army. Lee did not give an answer right away, but waited to see if his home state of Virginia would leave the Union. Lee left the federal army when Virginia said it was leaving the United States. He decided he could not fight against his home state. He became the leader of the armed forces of the Commonwealth of Virginia. He then became commander of the Army of Northern Virginia.Warner, Ezra, Generals in Gray, Baton Rouge, 1959, p. 181 Lee was a great commander and won several battles against the Union forces. Most Union officers thought Lee had broken his promises to the Union because he chose to fight against them. Part of Arlington was taken away from the Lee family and became a graveyard. Mostly Union dead are buried there.The Civil War: An Illustrated History, Geoffrey Ward, with Ken and Rick Burns. 2045. . Before the Civil War, the United States did not have large military-only cemeteries. Important generals were buried in the Congressional Cemetery with other important leaders. American military cemeteries were needed on distant frontiers, and near battles and hospitals where many soldiers died. When dead Civil War soldiers filled the burial grounds near Washington, D.C., Quartermaster General Montgomery C. Meigs proposed in 1864 that of the Robert E. Lee family property at Arlington be taken for a cemetery. During the Civil War, people invented tricks to capture or to make life hard for Americans that fought on the other side of the war. The government assessed taxes on properties and insisted that the owners appear in person to pay them. If the plantation owner did not come, the government would sell the land. The government bought Arlington at tax sale in 1864 for $26,800. Mrs. Lee did not show up in person, but rather had sent an agent to pay the $92.07 in property taxes that were owed for the land. The government turned away her agent, refusing to accept the tax payment. In 1874, Custis Lee, heir under his grandfather's will passing the estate in trust to his mother, sued the United States claiming ownership of Arlington. After the U.S. Supreme Court ruled 5-4 in Lee's favor in United States v. Lee, deciding that Arlington had been taken illegally, Congress returned the land to him. The next year, Custis Lee sold it back to the government for $150,000. Custis Lee and Robert Todd Lincoln, Secretary of War and son of President Lincoln, were both present when the property was officially turned over to the government. In 2011, Hurricane Irene killed six large trees at the cemetery. The 220-year-old \"Arlington Oak\" fell down near the grave of John F. Kennedy. ==Sections== Arlington National Cemetery is divided into 70 sections, with some sections in the southeast part of the cemetery saved for future use. Section 60, in the southeast part of the cemetery, is the burial ground for military personnel killed in the Iraq War and the War in Afghanistan. In 2005, Arlington National Cemetery bought another from the National Park Service, along with from the Department of Defense that was part of Fort Myer and that is the site of the Navy Annex. Section 21, also known as the Nurses Section, is the area of Arlington National Cemetery where many nurses are buried. The Nurses Memorial is there. In the cemetery, there is a Confederate section with graves of soldiers of the Confederate States of America and a Confederate Memorial. All Confederate headstones are peaked rather than rounded. In Section 27, there are buried more than 3,800 former slaves, called \"Contrabands\" during the Civil War. Their headstones are designated with the word \"Civilian\" or \"Citizen\". ==Grave markers, niches and headstones== The United States Department of Veterans Affairs takes care of the National Cemetery Administration's requests for the words and faith emblems (a cross, Jewish star, etc.) at no charge to the family of the dead put on upright marble headstones or columbarium niche covers. There are 39 authorized faith emblems available for placement to represent the deceased's faith. \"Available Emblems of Belief for Placement on Government Headstones\" and \"Markers\" MarkersIn the armed forces The cemetery had allowed privately-purchased markers in certain burial areas. Since 2001, the areas that the cemetery permitted such markers in are filled. The older sections of the cemetery have many different private markers, including artillery pieces. ==Tomb of the Unknowns== The Tomb of the Unknowns at Arlington National Cemetery is also called the \"Tomb of the Unknown Soldier\". It stands on top of a hill overlooking Washington, D.C. It honors soldiers who died without their bodies being identified. The Tomb is one of the more popular sites at the Cemetery. The tomb is made from Yule marble quarried in Colorado. It consists of seven pieces, with a total weight of 79 short tons (72 metric tons). The tomb was completed and opened to the public April 9, 1932, at a cost of $48,000. U.S. Army guards have stood watch at the Tomb of the Unknowns at all times since July 2, 1937. The 3rd U.S. Infantry Regiment (\"The Old Guard\") began guarding the Tomb April 6, 1948. ==Arlington Memorial Amphitheater== The Tomb of the Unknowns is part of the Arlington Memorial Amphitheater. The Memorial Amphitheater has hosted state funerals and Memorial Day and Veterans Day ceremonies. Ceremonies are also held for Easter. About 5,000 people attend these holiday ceremonies each year. The structure is mostly built of Imperial Danby marble from Vermont. The Memorial Display room, between the amphitheater and the Tomb of the Unknowns, uses Botticino stone, imported from Italy. The amphitheater was the result of a campaign by Ivory Kimball to construct a place to honor America's soldiers. Congress authorized the structure March 4, 1913. Woodrow Wilson laid the cornerstone for the building on October 15, 1915. The cornerstone contained 15 items including a Bible and a copy of the Constitution. ==Netherlands Carillon== The Netherlands Carillon is a carillon (bell tower) that was a gift from the Netherlands to the people of the United States in 1954, in thanks for their efforts during World War II. The bells are played by people with special training. This happens regularly during the summer and on special days. Recorded tunes are played on the hour and during the day. It is next to Arlington National Cemetery, on the north side. ==Memorials== It is now hard to find space to build new memorials at the cemetery. The army worries that new memorials take up space that could otherwise be used for graves. The army requires a joint or concurrent resolution from Congress before it will place new memorials onto the cemetery grounds. Still, there are several memorials on the cemetery grounds, and groups regularly ask for space for new memorials. The Space Shuttle Challenger Memorial was dedicated on May 20, 1986, in memory of the crew of flight STS-51-L, who died during launch on January 28, 1986. Written on the back of the stone is the text of the John Gillespie Magee, Jr. poem High Flight. Although many remains were identified and returned to the families for private burial, some were not, and were laid to rest under the marker. Two of the crew members, Scobee and Smith, are buried in Arlington, as well. There is a similar memorial to those who died when the Shuttle Columbia broke apart during reentry on February 1, 2003. It was dedicated on the first anniversary of the disaster. Astronauts Laurel Clark, David Brown and Michael Anderson are also buried in Arlington. The Cairn, the Lockerbie memorial is a memorial to the 270 killed in the bombing of Pan Am Flight 103 over Lockerbie, Scotland. The memorial is made up of 270 stones, one for each person killed in the disaster. In section 64, there is a memorial to the 184 victims of the September 11 attacks on the Pentagon. The memorial takes the shape of a pentagon, and lists the names of all the victims that were killed. There are only two mausoleums located within the confines of the cemetery. One is for the family of General Nelson Appleton Miles in Section 3 and the other one belongs to the family of General Thomas Crook Sullivan and it is in Section 1. There is a Commonwealth Cross of Sacrifice with the names of all the citizens of the USA who lost their lives fighting in the Canadian forces during the Korean War and the two world wars. The Women in Military Service for America Memorial is at the Ceremonial Entrance to Arlington National Cemetery. Coordinates Tomb of the Unknowns Arlington Memorial Amphitheater USMC War Memorial John F. Kennedy Eternal Flame Robert F. Kennedy USS Maine Memorial Space Shuttle Challenger Memorial Space Shuttle Columbia Memorial Nurses Memorial ==Notable burials== The first soldier to be buried in Arlington was Private William Henry Christman of Pennsylvania on May 13, 1864. == Notable civilians == * Julian Bartley, Sr. (54) and his son Jay Bartley (20), killed together in the 1998 bombing of the U.S. embassy in Nairobi * Harry Blackmun, Thurgood Marshall, William O. Douglas, Potter Stewart and Ruth Bader Ginsburg, five justices of the Supreme Court of the United States * Leslie Coffelt, Secret Service member killed fighting off would-be-assassins of President Harry S. Truman in the 1950 assassination attempt at Blair House * George Washington Parke Custis, founder of Arlington Plantation, grandson of Martha Washington, step-grandson of President George Washington, father to Mary Anna Custis Lee. * Mary Lee Fitzhugh Custis, wife to George Washington Parke Custis, daughter of William Fitzhugh and Ann Bolling Randolph Fitzhugh, mother to Mary Anna Custis Lee. * Albert Sabin, scientists who helped develop an oral polio vaccine. * Charles Durning, actor and personality. * Jacqueline Kennedy Onassis, former First Lady and widow of John F. Kennedy * Phyllis Kirk, famous TV and movie actress, alongside her husband. * James Parks, freedman, the only person buried at Arlington Cemetery who was born on the grounds. * Manuel Quezon (1878–1944), President of the Commonwealth of the Philippines (1935–1944), later transferred to a cemetery in Manila * Mary Randolph, first person to be buried at Arlington Plantation, descendant of Pocahontas and John Rolfe, cousin to Mary Lee Fitzhugh Custis. * Marie Teresa Rios, author of Fifteenth Pelican, basis for The Flying Nun television show. * John Gibson and Jacob Chestnut, United States Capitol Police officers killed in the 1998 Capitol shooting attack * Leslie Sherman, student killed in the 2007 Virginia Tech massacre (her parents Holly and Anthony Sherman are both veterans and will be buried next to their daughter). Whether or not they were wartime service members, U.S. presidents are eligible to be buried at Arlington, since they oversaw the armed forces as commanders-in-chief. Four state funerals have been held at Arlington: those of Presidents William Howard Taft and John F. Kennedy, that of General John J. Pershing, and that of U.S. Senator Edward M. Kennedy. ==Military burials== As of May 2006, there were 367 Medal of Honor recipients buried in Arlington National Cemetery.Medal of Honor Recipients Buried at Arlington National Cemetery , Arlington National Cemetery. Retrieved April 9, 2006. Nine of these recipients are Canadians. * Creighton Abrams (1914–1974), United States Army General who commanded U.S. military operations in the Vietnam War, 1968–1972 * Henry Harley \"Hap\" Arnold (1886–1950), first (and so far only) General of the Air Force (5-Stars) * Gordon Beecher (1904–1973), United States Navy Vice Admiral and composer * Jeremy Michael Boorda (1939–1996), US Navy Admiral and Chief of Naval Operations * Gregory \"Pappy\" Boyington (1912–1988), World War II Marine Corps fighter ace, Medal of Honor recipient, and commander of VMF-214, the \"Black Sheep Squadron\" (basis for the 1970s TV series Baa Baa Black Sheep) * Omar Nelson Bradley (1893–1981), commanded the 12th Army Group in Europe during World War II, first Chairman of the Joint Chiefs of Staff and the last living five star general. * Ruby G. Bradley (1907–2002), Colonel and, with 34 medals, one of the most decorated women in U.S. military history * Alfred Winsor Brown (1885–1938), World War I Navy officer and Governor of Guam * Miles Browning (1897–1954), World War I and World War II Navy officer and hero of the Battle of Midway * Frank Buckles (1901–2011), last known American veteran of World War I. * Omar Bundy (1861–1940), World War I Major General who commanded the 1st Brigade, 1st Expeditionary Division in France, awarded the French Legion of Honor and the Croix de Guerre. * John Allen Campbell (1835–1880), Brevet Brigadier General; American Civil War, first Governor of Wyoming Territory in 1869 and Third Assistant Secretary of State. * Roger Chaffee (1935–1967) and Gus Grissom (1926–1967), astronauts killed in the Apollo 1 fire (Edward White was buried at West Point) * Claire Lee Chennault (1893–1958), was a United States military aviator who commanded the \"Flying Tigers\" during World War II. * Bertram Tracy Clayton (1862–1918), Congressman from New York, killed in action in 1918 * Charles Austin Coolidge (1844–1926), Brigadier General, served in Civil War, Indian Wars, Spanish-American War, Philippine-American War and the China Relief Expedition. * William P. Cronan (1879–1929), US Naval officer and 19h Naval Governor of Guam. * Scott Crossfield (1921–2006), US Naval aviator and test pilot, first to fly at twice the speed of sound; played a major role in the design and development of the North American X-15. * Louis Cukela (1888–1956), Marine Corps Major, awarded two Medals of Honor for same act in World War I * Jane Delano (1862–1919), Director, Army Nursing Corps * Sir John Dill (1881–1944), British Diplomat and Field Marshal * William \"Wild Bill\" Donovan (1883–1959), Major General and Chief of the OSS during World War II * Abner Doubleday (1819–1893), Civil War general credited with inventing baseball * Clarence Ransom Edwards (1860–1931), commanded the 26th \"Yankee\" Division in World War I * Frank J. Fletcher (1885–1973), Admiral, U.S. Navy, World War II; operational commander at Coral Sea and Midway; awarded Medal of Honor. * Nathan Bedford Forrest III (1905–1943) Brigadier General of the United States Army Air Forces, and a great-grandson of Confederate General Nathan Bedford Forrest. First American general to be killed in action in Europe during World War II * Rene Gagnon, Ira Hayes and Michael Strank: three of the six servicemen in Joe Rosenthal's famous picture, Raising the Flag on Iwo Jima (Strank was killed in action just days after the photo was taken) * John Gibbon (1827–1896), Brigadier General, Union Army, Civil War, most notably commander of 2nd Division, US II Corps that repelled Pickett's Charge at the Battle of Gettysburg. * David Haskell Hackworth (1930–2005), Colonel and most decorated American soldier * William \"Bull\" Halsey (1882–1959), World War II Navy five-star Fleet Admiral * Grace Hopper (1906–1992), rear admiral, pioneering computer scientist * Kara Spears Hultgreen (1965–1994), the first female naval carrier-based fighter pilot * James Jabara (1923–1966), the first American jet ace in history. He's credited with shooting down 15 enemy aircraft during aerial combat. * Daniel \"Chappie\" James, Jr. (1920–1978), USAF, first African American four-star General in the U.S. Armed Forces * Philip Kearny (1815–1862), \"fearless\" one-armed cavalry general killed at Chantilly during the Civil War * Włodzimierz B. Krzyżanowski (1824–1887), Polish military leader and Civil War Union general * Henry Louis Larsen (1890–1962), Marine Lieutenant General; commanded the first deployed American troops in both World Wars; Governor of Guam and American Samoa. * Mark Matthews (1894–2005), last surviving Buffalo Soldier * Francis Lupo (1895–1918), Private killed in France during World War I; holds the distinction of possibly being the longest U.S. service member missing in action to be found (1918–2003) * John S. McCain, Sr. (1884–1945), USN Admiral – grandfather of Senator John McCain and father of McCain Jr. * John S. McCain, Jr. (1911–1981), USN Admiral – father of Senator John McCain * Henry Pinckney McCain (1861–1941), US Army officer and Adjutant Generals of the U.S. Army; Uncle to McCain Sr, grand-uncle of McCain Jr * David McCampbell (1910–1996), Captain, the US Navy's top World War II Ace with 34 kills * Montgomery Cunningham Meigs (1816–1892), Brigadier General. Arlington National Cemetery was established by Brig. Gen. Montgomery C. Meigs, who commanded the garrison at Arlington House and took over the grounds on June 15, 1864, for use as a military cemetery. He wanted to make the house not usable for living, in case the Lee family tried to return. A stone and masonry burial vault in the rose garden, wide and deep, and containing the remains of 2,111 Civil War dead, was among the first monuments to Union dead erected under Meigs' orders. Meigs himself was later buried within of Arlington House with his wife, father and son. * Glenn Miller (1904–1944), Major and well known band leader who disappeared over the English Channel while flying to Paris. His body was never found, but he has a memorial headstone. * Audie Murphy (1924–1971), U.S. Army, Recipient of the Medal of Honor, actor, and the most decorated U.S. Soldier during World War II. * Edward Ord (1818–1883), Major General, Army of the James during the Appomattox Campaign, Union Army, Civil War. * George S. Patton IV (1923–2004), Major General of the Army and son of famed WWII General, George S. Patton * John J. Pershing (1860–1948), America's first General of the Armies, commanded American forces in World War I * David Dixon Porter (1813–1891), Admiral, Union Navy, Civil War, most notable as the Union naval commander during the Vicksburg Campaign, a turning point of the war, which split the Confederacy in two. * Francis Gary Powers (1929–1977), American U-2 pilot shot down over the Soviet Union in 1960 * John Aaron Rawlins (1831–1869), Civil War general, chief of staff and later Secretary of War to Ulysses S. Grant * Alfred C. Richmond (1902–1984), Commandant of the United States Coast Guard * Hyman G. Rickover (1900–1986), father of the Nuclear Navy * Matthew Ridgway (1895–1993), WWII and Korea General, Chief of Staff of the Army * William S. Rosecrans (1819–1898), Major General, Army of the Cumberland, Union Army, Civil War * William T. Ryder (1913–1992), Brigadier General, first American paratrooper * Thomas Selfridge (1882–1908), First Lieutenant in the U.S. Army and the first person to die in a crash of a powered airplane * Philip Sheridan (1831–1888), commanding general, Union Army, Civil War * Daniel E. Sickles (1819–1914), Major General, III Corps, Army of the Potomac, Union Army, Civil War. Also served as U.S. Minister to Spain and as U.S. Representative from New York * Robert F. Sink (1905–1965), Lt. General, and former Regimental Commander of the 506th Parachute Infantry Regiment, 101st Airborne Division, portrayed by Vietnam Veteran, and retired Marine Captain Dale Dye in the HBO/BBC miniseries Band of Brothers. * Walter Bedell Smith (1895–1961), General, U.S. Army, World War II, Dwight D. Eisenhower's Chief of Staff during Eisenhower's time at SHAEF and Director of the CIA from 1950 to 1953. Also served as U.S. Ambassador to the Soviet Union from 1946 to 1948. * Lauri Törni, a.k.a. Larry Thorne (1919–1965), Finnish soldier who served in the US special forces and was a World War II veteran; called \"soldier who fought under three flags (Finland, Germany and USA)\". * Matt Urban (1919–1995), Colonel, U.S Army, most highly decorated soldier for valor in the history of the US Military * Jonathan Mayhew Wainwright IV (1883–1953), Major General, hero of Bataan and Corregidor; highest ranking POW in World War II * Robert Webb (1922–2002), B-17 Flying Fortress pilot * Joseph Wheeler (1836–1906), served as a Major General for two opposing forces: the Confederate Army during the Civil War, and the U.S. Army during the Spanish- American War and Philippine-American War * Orde Charles Wingate (1903–1944), British major general, creator and commander of the Chindits * Clark H. Woodward (1877–1968), Vice Admiral, served in five wars: the Spanish-American War, Philippine-American War, Boxer Rebellion and both World Wars * Charles Young (1864–1922), first African-American Lieutenant colonel in the US Army === Burial under protest === Warrant Officer Gregory S. Crandall's helicopter was shot down over Savannakhet province, Laos, on February 18, 1971. In May of that year the military listed him KIA. According to Arlington National cemetery records John Manning, chief of the Army's Mortuary Affairs Branch stated that witnesses to the crash reported that the ...\"helicopter burst into flames and exploded when it hit the ground.\". It was also reported that there were a series of seven explosions. The remains of Crandall and two other soldiers were recovered in February 1991 and on September 17, 1993, with full military honors, a full sized steel casket, and at the protest of the family, the remains of Warrant Officer Gregory S. Crandall, a single No. 4 maxillary premolar tooth, was buried. === Service members with other distinguished careers === * Sosthenes Behn, businessman and founder of ITT Corporation * Hugo Black, Associate Justice of the Supreme Court of the United States * William J. Brennan, Jr., Associate Justice of the Supreme Court of the United States * Ron Brown, United States Secretary of Commerce * William Jennings Bryan, Secretary of State, three-time presidential candidate, orator * William Francis Buckley, CIA Station Chief, murdered in Beirut. * Clark Clifford, Secretary of Defense, advisor to four presidents * Charles \"Pete\" Conrad, Jr., Apollo astronaut, third man to walk on the Moon * Denver Dickerson (1914–1981), U.S. Army veteran of World War II, Secretary of Guam (1963–1969) * Dwight F. Davis, Secretary of War, established the Davis Cup * Michael E. DeBakey, famous cardiovascular physician, U.S. Army soldier during World War II * John Foster Dulles, Secretary of State * Medgar Evers (1925–1963), U.S. Army veteran of World War II, civil rights activist * Stanley L. Greigg, U.S. Congressman from Iowa * Dashiell Hammett, author * Oliver Wendell Holmes, Jr, Associate Justice of the Supreme Court of the United States, wounded three times in the Civil War, \"The Great Dissenter\"New York Times Obituary, March 6, 1935; and www.arlingtoncemetery.net/owholmes.htm * Robert G. Ingersoll, political leader and orator, noted for his agnosticism * Edward Stanley Kellogg (1870–1948), U.S. Navy Captain, 16th Governor of American Samoa (1923–1925). * Edward M. Kennedy (1932–2009), U.S. Army Veteran (1951–1953), U.S. Senator from Massachusetts (1962–2009). * John F. Kennedy (1917–1963), U.S. Navy officer during World War II, U.S. Representative (1947–1953), U.S. Senator (1953–1961), President of the United States, (1961–1963). * Robert F. Kennedy (1925–1968), Navy veteran, Attorney General of the United States (1961–1964), U.S. Senator from New York (1965–1968). * Frank Kowalski, U.S. Army veteran of World War II; U.S. Representative from Connecticut * Pierre Charles L'Enfant, French military engineer, architect, and urban planner; designed the city of Washington * Robert Todd Lincoln, Secretary of War, son of former U.S. President Abraham Lincoln * Joe Louis, world heavyweight boxing champion * Allard Lowenstein, U.S. Congressman from New York. * John R. Lynch, freedman, U.S. Army major, and Member of Congress * Mike Mansfield, longest- serving Senate Majority Leader, United States Ambassador to Japan * George C. Marshall, Chief of Staff of the Army, General of the Army, Emissary to China, Secretary of State, and Secretary of Defense. Instrumental in developing the Marshall Plan after World War II * Lee Marvin, Marine Corps veteran and actor * Bill Mauldin, editorial cartoonist; noted for World War II–era work satirizing military life in Stars and Stripes * George B. McClellan, Jr. (1865–1940) Mayor of New York (1904–1909), son of Union Army Major General George B. McClellan * John C. Metzler, World War II sergeant, former superintendent of Arlington National Cemetery (1951–1972) * Daniel Patrick Moynihan, U.S. Senator from New York * Phelps Phelps, 38th Governor of American Samoa and United States Ambassador to the Dominican Republic * Spot Poles, considered among the greatest outfielders of the Negro Leagues * William Rehnquist, Chief Justice of the United States * Earl W. Renfroe, orthodontist who helped originate the concept of preventive and interceptive orthodontics. * Frank Reynolds, ABC television anchorman * Samuel W. Small, journalist, evangelist, prohibitionist. * Johnny Micheal Spann, CIA officer, first American killed in Afghanistan. Although Spann had served in the USMC, he was not in the military when killed. However, because he had received the CIA's Intelligence Star, considered the equivalent of the US Military's Silver Star and recognized as such by President George W. Bush, Spann was approved for burial in Arlington National Cemetery.Bush At War, Bob Woodward, Simon and Schuester, 2002, page 317 * Ted Stevens, US Senator from Alaska * Samuel S. Stratton, 15-term U.S. Representative from New York * William Howard Taft, Secretary of War, President of the United States, Chief Justice of the United States * George Westinghouse, Civil War veteran, Westinghouse Electric founder * Harvey W. Wiley, first Commissioner of the Food and Drug Administration, \"father\" of the Pure Food and Drug Act * Charles Willeford, World War II veteran and author * William Christman First soldier to be buried at Arlington Cemetery ==References== ==Further reading== * Poole, Robert M., On Hallowed Ground: The Story of Arlington National Cemetery , Walker & Co, 2009. ==Other websites== * * * * * Category:1864 establishments in the United States Category:Military monuments and memorials in the United States Category:Commonwealth War Graves Commission Category:1860s establishments in Virginia Category:1864 establishments Category:1864 in the United States Category:Burials at Arlington National Cemetery Category:History of Virginia Category:National Register of Historic Places Category:United States Army Category:Buildings and structures in Washington, D.C.",
 "title": "Arlington National Cemetery"
}