{
 "id": "303068",
 "text": "The leopard seal (Hydrurga leptonyx), also known as the sea leopard, is the second largest species of seal in the Antarctic (after the Southern Elephant Seal). It is most common in the southern hemisphere along the coast of Antarctica and on most sub-Antarctic islands, but can also be found on the coasts of southern Australia, Tasmania, South Africa, New Zealand, Lord Howe Island, Tierra del Fuego, the Cook Islands, and the Atlantic coast of South America. It can live twenty-six years, possibly more. Killer whales, and large sharks are the only natural predators of leopard seals. They eat Crabeater seals, consuming 80% of their young. They are large and strong. They have a dark grey back and a light grey stomach. Its neck is a little bit white with black spots, which is the pattern of a leopard's coat. That is how it got its name. Leopard seals are carnivores. It eats penguins, seagulls, fish, squid, octopuses, krill, shrimps, crabs and even other seals. They are the only species of seals who eat warm-blooded prey. They are the most formidable hunters of all the seals and the only ones that feed on warm-blooded prey. Leopard seals hunt alone, and they are ferocious solitary animals. They do not do well with other leopard seals and usually end up in a fight. They are very aggressive, and their only predator is the killer whale. Their mouths can open 160° and clamp down with incredible force and can quickly emerge from the water to snatch prey, such as penguins on the ice's edge. Leopard seals can easily rip penguins and baby seals to shreds by jerking their heads from side to side. They have incredibly long teeth, up to one inch long. Also, they have spotted grey skin and are 10-12 feet long and have a slender bodies. They can hold their breath for 15 minutes and are the second-largest type of seal in Antarctica and the third-largest worldwide. Leopard seals can even sing and smile underwater! They communicate by using clicking or trilling noises. When interacting with humans in the water, they are more curious than aggressive. They have a thick layer of fat called blubber under their skin to keep them warm under the icy freezing water. They weigh between 800 and 1,300 pounds which are heavier than a horse. They stay in Antarctica and sometimes come to New Zealand during the hot summer. Male seals are called bulls, females are called cows, and babies are called pups. category:Mammals of Australia Category:Pinnipeds",
 "title": "Leopard seal"
}