{
 "id": "303088",
 "text": "The 2022 FIFA World Cup was the 22nd FIFA World Cup. It was hosted in Qatar from 20 November 2022 to 18 December 2022. It was the first World Cup hosted in the Arab world, and the second to be hosted fully in Asia. This was the last World Cup played with a 32 team format. The tournament was played during the months of November and December to stay away from the hot weather during the summer months in Qatar. The reigning champions were France. There have been suspicions on whether Qatar earned hosting rights fairly. An investigation that was done by FIFA reported that Qatar earned hosting rights fairly. This investigation was criticized by Michael J. Garcia. Qatar was also criticized because of the treatment of the foreign workers preparing the World Cup stadiums.Revealed: migrant workers in Qatar forced to pay billions in recruitment fees , The Guardian, 2022-03-31. == Bidding == 2022 FIFA bidding Bidders Votes Votes Votes Votes Bidders Round 1 Round 2 Round 3 Round 4 11 10 11 14 3 5 6 8 4 5 5 3 2 1 == Qualification == FIFA's six continental confederations have their own qualifying tournaments. All 211 associations are able to enter qualification. Qatar, qualified automatically because they are the hosts. Qatar still plays in the first two rounds of AFC qualification because it is also qualification for the 2023 AFC Asian Cup. The previous World Cup champions France will participate in qualification as normal. Saint Lucia, North Korea, American Samoa, Samoa all withdrew because of safety reasons related to the COVID-19 pandemic, with North Korea withdrawing after already playing matches. Tonga withdrew because of the 2022 Hunga Tonga–Hunga Ha'apai eruption and tsunami. Russia was suspended by FIFA because of the 2022 Russian invasion of Ukraine. Vanuatu and Cook Islands both withdrew because of COVID-19 cases in their squads, with Cook Islands withdrawing after already playing matches. The amount of available World Cup slots for each confederation was discussed by the FIFA Executive Committee on 30 May 2015 in Zürich. The committee decided that the slots would be the same as 2018. * CAF (Africa): 5 * AFC (Asia): 4 or 5 (not including Qatar, the hosts) * UEFA (Europe): 13 * CONCACAF (North and Central America and Caribbean): 3 or 4 * OFC (Oceania): 0 or 1 * CONMEBOL (South America): 4 or 5 * Hosts: 1 ===Qualified teams=== Team Qualified as Host nation UEFA Group J winners UEFA Group F winners CONMEBOL winners UEFA Group D winners UEFA Group H winners UEFA Group B winners UEFA Group A winners UEFA Group I winners UEFA Group C winners UEFA Group G winners CONMEBOL runners-up AFC Third Round Group A winners AFC Third Round Group A runners-up AFC Third Round Group B runners-up AFC Third Round Group B winners CONMEBOL fourth place CONMEBOL third place CAF Third Round winner CAF Third Round winner UEFA Second Round winner UEFA Second Round winner CAF Third Round winner CAF Third Round winner CAF Third Round winner UEFA Second Round winners AFC v CONMEBOL play-off winners CONCACAF v OFC play-off winners ==Officiating== On 19 May 2022, FIFA announced the list of 36 referees, and 69 assistant referees and 24 video assistant referees for the tournament. Of the 36 referees, FIFA included two each from Argentina, Brazil, England and France. For the first time women referees will referee games at a major men's tournament. Stéphanie Frappart from France, Rwandan Salima Mukansanga and Yoshimi Yamashita from Japan became the first female referees to be appointed to a men's World Cup. They will be joined by three female assistant referees, also a first. Frappart oversaw the 2019 FIFA Women's World Cup Final. == Venues == Lusail Al Khor Doha Doha Lusail Iconic Stadium Al Bayt Stadium Stadium 974 Al Thumama Stadium Capacity: 80,000 Capacity: 60,000 Capacity: 40,000 Capacity: 40,000 Host cities in Qatar Stadiums in Doha area Al Rayyan Al Rayyan Al Rayyan Al Wakrah Education City Stadium Ahmad bin Ali Stadium Khalifa International Stadium Al Janoub Stadium Capacity: 45,350 Capacity: 44,740 Capacity: 40,000 (upgraded) Capacity: 40,000 ==Final draw== The final draw was in the Doha Exhibition and Convention Center in Doha, Qatar, on 1 April 2022, 19:00 AST, before the qualifiers finished. The two winners of the inter-confederation play-offs and the winner of the Path A of the UEFA play-offs were not known at the time of the draw. For the draw, the 32 teams were put into four pots based on their FIFA World Rankings of 31 March 2022. The teams in Pot 1 were the hosts, Qatar (who were automatically seeded as A1) and the best seven teams. The teams in Pot 2 were the next best eight teams, with the next best eight teams into Pot 3. The teams in Pot 4 were the five lowest-ranked teams, the two inter-confederation play-off winners and the UEFA Path A play-off winner. Teams from the same confederation could not be in the same group except UEFA, which allowed maximum two teams in the same group. The Pot 1 teams were automatically seeded as 1. The pots for the draw are shown below. Pot 1 Pot 2 Pot 3 Pot 4 (51) (hosts) (1) (2) (3) (4) (5) (7) (8) (9) (10) (11) (12) (13) (14) (15) (16) (20) (21) (23) (24) (25) (26) (29) (35) (37) (38) (46) (49) (60) (18) (31) (42) ==Group stage== Tie-breaking criteria for group play The ranking of teams in the group stage is determined as follows: # Points; # Goal difference; # Number of goals scored; # Points in the matches played between the tied teams; # Goal difference in the matches played between the tied teams; # Number of goals scored in the matches played between the tied teams; # Fair play points: # Drawing of lots. ===Group A=== \\---- \\---- ===Group B=== \\---- \\---- ===Group C=== \\---- \\---- ===Group D=== \\---- \\---- ===Group E=== \\---- \\---- ===Group F=== \\---- \\---- ===Group G=== \\---- \\---- ===Group H=== \\---- \\---- ==Knockout stage== In the knockout stage, if a match is tied at the end of 90 minutes of normal playing time, extra time will be played (two halves that are 15 minutes each). If it is still tied after extra time, the match will be decided by a penalty shoot-out. ===Bracket=== ===Round of 16=== \\---- \\---- \\---- \\---- \\---- \\---- \\---- ===Quarter-finals=== \\---- \\---- \\---- ===Semi- finals=== \\---- ===Third place play-off=== ===Final=== ==Marketing== ===Branding=== The official emblem was shown on 3 September 2019 at the Doha Tower, Katara Cultural Village Amphitheatre, Msheireb Downtown Doha, and Zubarah. It is designed to show the tournament trophy, the infinity symbol, and the number \"8\", which represents the eight host stadiums. It also represents shawls to highlight the tournament's winter scheduling, and has waves showing the desert dunes. The make-up of the emblem's wordmark describes kashida—extending certain parts of characters in Arabic script to give emphasis. ===Mascot=== The tournament's official mascot was shown on 1 April 2022, during the group stage draw. Its name is La’eeb, which means \"super- skilled player\" in Arabic. The official website of FIFA says: \"La’eeb will be known for his youthful spirit; spreading joy and confidence everywhere he goes\", and the official backstory of the character, published there, says that it comes from a different world where tournament mascots live, \"a world where ideas and creativity form the basis of characters that live in the minds of everyone\". ===Match ball=== The official match ball, the \"Al Rihla\", was shown on 30 March 2022. It was inspired by the culture, architecture, iconic boats and flag of Qatar. In Arabic, the word Al Rihla means “the journey”. The ball was designed with stability as the main focus. It is the first ever official match ball created with water-based glues and inks. As \"the game is getting faster\" and \"speeds up\", Adidas used some new traits, like more speed and improved accuracy of the ball. ===Official song=== The official song of the tournament is \"Hayya Hayya (Better Together)\", by Trinidad Cardona, Davido and AISHA, released on 1 April 2022 with the music video. ==Sponsorship== FIFA partners FIFA World Cup sponsors * Adidas * Coca-Cola * Hyundai–Kia * * * Visa * * *Byju's *Crypto.com * Hisense *McDonald's *Mengniu Dairy * TikTok * Vivo ==Broadcasters== ==Notes== == References == ==Other websites== * FIFA.com 2022 World Cup website 2022 Category:2022 in Asian sport Category:2020s in Qatar Category:November 2022 events Category:December 2022 events",
 "title": "2022 FIFA World Cup"
}