{
 "id": "303086",
 "text": "The 2018 FIFA World Cup was the 21st FIFA World Cup, which is a men's football tournament that takes place every four years and is organized by FIFA. The tournament took place in Russia from 14 June to 15 July 2018, after the country was awarded the hosting rights on 2 December 2010. This was the first World Cup taking place in Eastern Europe. The defending champions were Germany. France won the tournament after defeating Croatia 4–2. This was France's second World Cup title. == Qualified teams == Russia is the host country, so the Russian team automatically qualified. Team Qualified as Date of qualification CONMEBOL qualification 3rd place 10 October 2017 CONCACAF v AFC play-off winners 15 November 2017 UEFA Group H winners 3 September 2017 CONMEBOL qualification winner 28 March 2017 CONMEBOL qualification 4th place 10 October 2017 CONCACAF Fifth Round runners-up 7 October 2017 UEFA Second Round winners 12 November 2017 UEFA Second Round winners 14 November 2017 CAF Third Round Group E winners 8 October 2017 UEFA Group F winners 5 October 2017 UEFA Group A winners 10 October 2017 UEFA Group C winners 5 October 2017 UEFA Group I winners 9 October 2017 AFC Third Round Group A winners 12 June 2017 AFC Third Round Group B winners 31 August 2017 CONCACAF Fifth Round top 3 1 September 2017 CAF Third Round Group C winners 11 November 2017 CAF Third Round Group B winners 7 October 2017 CONCACAF Fifth Round 3rd place 10 October 2017 OFC v CONMEBOL play-off winners 15 November 2017 UEFA Group E winners 8 October 2017 UEFA Group B winners 10 October 2017 Host 2 December 2010 AFC Third Round Group B runners-up 5 September 2017 CAF Third Round Group D winners 10 November 2017 UEFA Group D winners 9 October 2017 AFC Third Round Group A runners-up 5 September 2017 UEFA Group G winners 6 October 2017 UEFA Second Round winners 13 November 2017 UEFA Second Round winners 12 November 2017 CAF Third Round Group A winners 11 November 2017 CONMEBOL qualification runners-up 10 October 2017 ==Draw== The draw was held in Moscow at 18:00 MSK, on Friday 1 December 2017 The teams were divided into 4 pots, 8 teams each. The number in parenthesis show positions in the FIFA World Rankings prior to the tournament. Pot 1 Pot 2 Pot 3 Pot 4 (65) (hosts) (1) (2) (3) (4) (5) (6) (7) (8) (10) (11) (12) (13) (16) (17) (18) (19) (21) (22) (25) (28) (30) (32) (34) (38) (41) (43) (44) (48) (49) (62) (63) == Stadiums == Moscow: * Luzhniki Stadium * Otkrytiye Arena Saint Petersburg: * Krestovsky Stadium Kaliningrad: * Kaliningrad Stadium Nizhny Novgorod: * Nizhny Novgorod Stadium Volgograd: * Volgograd Arena Yekaterinburg: * Central Stadium Sochi: * Fisht Olympic Stadium Rostov-on-Don: * Rostov Arena Saransk: * Mordovia Arena Samara: * Cosmos Arena Kazan * Kazan Arena ==Group stage== The top two teams of each group advance to the round of 16. Matches are played on a round-robin basis. ===Tiebreakers=== The rankings of teams in each group are determined as follows (regulations Article 32.5): If two or more teams are equal on the basis of the above three criteria, their rankings are determined as follows: ===Group A=== \\---- \\---- ===Group B=== \\---- \\---- ===Group C=== \\---- \\---- ===Group D=== \\---- \\---- ===Group E=== \\---- \\---- ===Group F=== \\---- \\---- ===Group G=== \\---- \\---- ===Group H=== \\---- \\---- == Knockout stage== ===Bracket=== ===Round of 16=== \\---- \\---- cjk \\---- \\---- \\---- \\---- \\---- ===Quarter-finals=== \\---- \\---- \\---- ===Semi-finals=== \\---- ===Third place play-off=== ===Final=== ==Statistics== ===Goalscorers=== ===Discipline=== A player is automatically suspended for the next match for the following offences: * Receiving a red card (red card suspensions may be extended for serious offences) * Receiving two yellow cards in two different matches; yellow cards expire after the completion of the quarter-finals (yellow card suspensions are not carried forward to any other future international matches) The following suspensions were served during the tournament: Player Offence(s) Suspension(s) Carlos Sánchez in Group H vs Japan (matchday 1; 19 June) Group H vs Poland (matchday 2; 24 June) Yussuf Poulsen in Group C vs Peru (matchday 1; 16 June) in Group C vs Australia (matchday 2; 21 June) Group C vs France (matchday 3; 26 June) Jérôme Boateng in Group F vs Sweden (matchday 2; 23 June) Group F vs South Korea (matchday 3; 27 June) Armando Cooper in Group G vs Belgium (matchday 1; 18 June) in Group G vs England (matchday 2; 24 June) Group G vs Tunisia (matchday 3; 28 June) Michael Amir Murillo in Group G vs Belgium (matchday 1; 18 June) in Group G vs England (matchday 2; 24 June) Group G vs Tunisia (matchday 3; 28 June) Igor Smolnikov in Group A vs Uruguay (matchday 3; 25 June) Round of 16 vs Spain (1 July) Sebastian Larsson in Group F vs Germany (matchday 2; 23 June) in Group F vs Mexico (matchday 3; 27 June) Round of 16 vs Switzerland (3 July) Héctor Moreno in Group F vs Germany (matchday 1; 17 June) in Group F vs Sweden (matchday 3; 27 June) Round of 16 vs Brazil (2 July) Stephan Lichtsteiner in Group E vs Brazil (matchday 1; 17 June) in Group E vs Costa Rica (matchday 3; 27 June) Round of 16 vs Sweden (3 July) Fabian Schär in Group E vs Brazil (matchday 1; 17 June) in Group E vs Costa Rica (matchday 3; 27 June) Round of 16 vs Sweden (3 July) Blaise Matuidi in Group C vs Peru (matchday 2; 21 June) in Round of 16 vs Argentina (30 June) Quarter-finals vs Uruguay (6 July) Casemiro in Group E vs Switzerland (matchday 1; 17 June) in Round of 16 vs Mexico (2 July) Quarter-finals vs Belgium (6 July) Mikael Lustig in Group F vs Mexico (matchday 3; 27 June) in Round of 16 vs Switzerland (3 July) Quarter-finals vs England (7 July) Thomas Meunier in Group G vs Panama (matchday 1; 18 June) in Quarter-finals vs Brazil (6 July) Semi-finals vs France (10 July) ===Awards=== Golden Ball Silver Ball Bronze Ball Luka Modrić Eden Hazard Antoine Griezmann Golden Boot Silver Boot Bronze Boot Harry Kane Antoine Griezmann Romelu Lukaku 6 goals, 0 assists 4 goals, 2 assists 4 goals, 1 assist Golden Glove Thibaut Courtois Best Young Player Kylian Mbappé FIFA Fair Play Award ==Prize money== Prize money amounts were announced in October 2017. Position Amount (USD million) Per team Total Champions 38 38 Runners-up 28 28 Third place 24 24 Fourth place 22 22 5th–8th place 16 64 9th–16th place 12 96 17th–32nd place 8 128 Total 400 ==References== == Other websites == * FIFA.com 2018 website * Welcome2018.com",
 "title": "2018 FIFA World Cup"
}