{
 "id": "303023",
 "text": "Physical chemistry uses physics to study chemical systems. It studies them at macroscopic, atomic, subatomic, and particulate levels. It looks at concepts like motion, energy, force, time, thermodynamics, quantum chemistry, statistical mechanics and dynamics. Physical chemistry is not the same as chemical physics. Physical chemistry is mostly a macroscopic or supra- molecular science. The majority of physical chemistry concepts relate to bulk properties rather than to molecular/atomic structure alone. These include chemical equilibrium and colloids. Some of the relationships that physical chemistry tries to resolve include the effects of: #Intermolecular forces on the physical properties of materials (for example, plasticity, tensile strength, surface tension in liquids). #Reaction kinetics on the rate of a reaction. #The identity of ions on the electrical conductivity of materials. #Surface chemistry and electrochemistry of membranes. == History == The term \"physical chemistry\" was first used by Mikhail Lomonosov in 1752. He presented a lecture course with the title \"A Course in True Physical Chemistry\" to the students of Petersburg University. Modern physical chemistry was developed in the 1860s to 1880s with work on chemical thermodynamics, electrolytes in solutions, chemical kinetics and other subjects. In 1876, Josiah Willard Gibbs wrote an article called, On the Equilibrium of Heterogeneous Substances. This paper introduced many of the main parts of physical chemistry, such as Gibbs energy, chemical potentials, Gibbs phase rule.Josiah Willard Gibbs, 1876, \"On the Equilibrium of Heterogeneous Substances\", Transactions of the Connecticut Academy of Sciences Other important discoveries include Heike Kamerlingh Onnes' work on enthalpy and macromolecular processes. The first scientific journal about physical chemistry was the German journal, Zeitschrift für Physikalische Chemie. It was founded in 1887 by Wilhelm Ostwald and Jacobus Henricus van 't Hoff. The two chemists and Svante August Arrhenius were the leading men in physical chemistry in the late 19th century and early 20th century. All three were awarded the Nobel Prize in Chemistry. Important discoveries were made in the 20th century. These include applying statistical mechanics to chemical systems and Irving Langmuir's work on colloids and surface chemistry. In the 1930's, Linus Pauling and others applied quantum mechanics to develop quantum chemistry. Chemical theories have grown with new experimental discoveries. New forms of spectroscopy started in the 20th century including: infrared spectroscopy, microwave spectroscopy, EPR spectroscopy and NMR spectroscopy. Physical chemistry also improved with discoveries in nuclear chemistry, especially in isotope separation. This happened around the time before and during World War II. Chemists discovered important facts in astrochemistry. ==Journals== These journals cover physical chemistry: *Zeitschrift für Physikalische Chemie (1887) *Journal of Physical Chemistry A (from 1896 as Journal of Physical Chemistry, renamed in 1997) *Physical Chemistry Chemical Physics (from 1999, formerly Faraday Transactions with a history dating back to 1905) *Macromolecular Chemistry and Physics (1947) *Annual Review of Physical Chemistry (1950) *Molecular Physics (journal)|Molecular Physics (1957) *Journal of Physical Organic Chemistry (1988) *Journal of Physical Chemistry B (1997) *ChemPhysChem (2000) *Journal of Physical Chemistry C (2007) *Journal of Physical Chemistry Letters (from 2010, combined letters previously published in the separate journals) A historical journal that covered both chemistry and physics was Annales de chimie et de physique. It started in 1789 and was published under the name given here from 1815–1914. ==Branches and related topics== *Thermochemistry *Chemical kinetics *Quantum chemistry *Electrochemistry *Photochemistry *Surface chemistry *Solid-state chemistry *Spectroscopy *Analytical chemistry *Biophysical chemistry *Materials science *Physical organic chemistry *Micromeritics == References == ==Other websites== *Physical Chemistry (Keith J. Laidler, John H. Meiser and Bryan C. Sanctuary) *The World of Physical Chemistry (Keith J. Laidler, 1993) *Physical Chemistry from Ostwald to Pauling (John W. Servos, 1996) *100 Years of Physical Chemistry (Royal Society of Chemistry, 2004) *Physical Chemistry: neither Fish nor Fowl? (Joachim Schummer, The Autonomy of Chemistry, Würzburg, Königshausen & Neumann, 1998, pp. 135–148) *Cathedrals of Science (Patrick Coffey, 2008) *The Cambridge History of Science: The modern physical and mathematical sciences (Mary Jo Nye, 2003) Category:Branches of chemistry",
 "title": "Physical chemistry"
}