{
 "id": "303184",
 "text": "\"I Wanna Go\" is a 2011 song by Britney Spears. The song is the third single from her seventh studio album, Femme Fatale. The song was released on June 13, 2011. It was an instant success, reaching the top ten of the Billboard Hot 100 a day after debuting. This resulted in a flash mob in Times Square. Spears also shut down Times Square for an unexpected performance. The song has currently been downloaded over 1.8 million times in the US as of 2016. == Music video == The video premiered on June 22, 2011, and was directed by Chris Marrs Piliero. Spears is asked questions by paparazzi in a press conference and grows tired of them, eventually saying, \"Fuck you\" to all but one of them. She then goes for a joyride with actor Guillermo Diaz, known for his role in the television series Weeds. ==Charts== ===Weekly charts=== Chart (2011) Peak position scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" Brazil (Billboard Hot 100)\"Brasil Hot 100 Airplay\". Billboard Brasil (Brasil: bpp) (2): 100. November 2011. 25 Brazil (Billboard Hot Pop Songs) 3 scope=\"row\" scope=\"row\" scope=\"row\" Croatia Airplay Chart (HRT) 12 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" France (SNEP) Download Chart 6 scope=\"row\" Global Dance Tracks (Billboard) 12 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" Italy (FIMI) 43 scope=\"row\" Lebanon (Lebanese Top 20) 5 Mexico (Airplay) 26 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" South Korea (GAON International Chart) 1 scope=\"row\" Spain (Airplay Chart) 8 scope=\"row\" scope=\"row\" UK Singles (OCC) 111 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" ===Year-end charts=== Chart (2011) Position Belgian Singles Chart (Flanders) 62 Canadian Hot 100 33 Croatia Airplay Chart (HRT) 54 France (SNEP) 45 France Airplay (SNEP) 21 Hungarian Airplay Chart 99 Lebanese Airplay Chart 22 South Korea (GAON International Chart) 15 US Billboard Hot 100 46 US Dance Club Songs (Billboard) 39 US Dance/Mix Show Airplay (Billboard) 31 US Pop Songs (Billboard) 13 US Radio Songs (Billboard) 37 ==References== Category:2011 songs Category:Britney Spears songs",
 "title": "I Wanna Go"
}