{
 "id": "303309",
 "text": "This is a list of winners of the Archibald Prize for portraiture. As many of the paintings are copyrighted, a link to images has been listed where available. ==List of winners== Year – Artist – Title *1921: W B McInnes – Desbrowe Annear Image *1922: W B McInnes – Professor Harrison Moore *1923: W B McInnes – Portrait of a Lady *1924: W B McInnes – Portrait of Miss Collins *1925: John Longstaff – Portrait of Maurice Moscovitch *1926: W B McInnes – Silk and Lace *1927: George W. Lambert – Mrs Murdoch *1928: John Longstaff – Portrait of Dr Alexander Leeper *1929: John Longstaff – W A Holman, KC *1930: W B McInnes – Drum-Major Harry McClelland *1931: John Longstaff – Sir John Sulman *1932: Ernest Buckmaster – Sir William Irvine *1933: Charles Wheeler – Ambrose Pratt *1934: Henry Hanke – Self Portrait *1935: John Longstaff – A B ('Banjo') Paterson *1936: W B McInnes – Dr. Julian Smith *1937: Normand Baker – Self Portrait *1938: Nora Heysen – Mme Elink Schuurman *1939: Max Meldrum – The Hon G J Bell, Speaker of the House of Representatives *1940: Max Meldrum – Dr J Forbes McKenzie *1941: William Dargie – Sir James Elder, KBE Image *1942: William Dargie – Corporal Jim Gordon, VC Image *1943: William Dobell – Joshua Smith Image *1944: Joshua Smith – Hon Sol Rosevear, MHR, Speaker of the House of Representatives *1945: William Dargie – Lt-General The Hon Edmund Herring, KBE, DSO, MC, ED Image *1946: William Dargie – L C Robson, MC, MA Image *1947: William Dargie – Sir Marcus Clark, KBE Image *1948: William Dobell – Margaret Olley *1949: Arthur Murch – Bonar Dunlop *1950: William Dargie – Sir Leslie McConnan Image *1951: Ivor Hele – Laurie Thomas *1952: William Dargie – Mr Essington Lewis, CH Image *1953: Ivor Hele – Sir Henry Simpson Newland, CBE, DSO, MS, FRCS *1954: Ivor Hele – Rt Hon R G Menzies, PC, CH, QC, MP *1955: Ivor Hele – Robert Campbell Esq *1956: William Dargie – Mr Albert Namatjira *1957: Ivor Hele – Self Portrait *1958: William Edwin Pidgeon – Mr Ray Walker Image *1959: William Dobell – Dr Edward MacMahon *1960: Judy Cassab – Stanislaus Rapotec *1961: William Edwin Pidgeon – Rabbi Dr I Porush Image *1962: Louis Kahan – Patrick White Image *1963: Jack Carington Smith – Professor James McAuley *1964: No Award *1965: Clifton Pugh – R A Henderson *1966: Jon Molvig – Charles Blackman *1967: Judy Cassab – Margo Lewers *1968: William Edwin Pidgeon – Lloyd Rees Image *1969: Ray Crooke – George Johnston *1970: Eric Smith – Gruzman – Architect *1971: Clifton Pugh – Sir John McEwen *1972: Clifton Pugh – The Hon E G Whitlam *1973: Janet Dawson – Michael Boddy *1974: Sam Fullbrook – Jockey Norman Stephens *1975: Kevin Connor – The Hon Sir Frank Kitto, KBE *1976: Brett Whiteley – Self Portrait in the Studio Image *1977: Kevin Connor – Robert Klippel *1978: Brett Whiteley – Art, Life and the other thing Image *1979: Wes Walters – Portrait of Phillip Adams *1980: No award *1981: Eric Smith – Rudy Komon *1982: Eric Smith – Peter Sculthorpe *1983: Nigel Thomson – Chandler Coventry *1984: Keith Looby – Max Gillies *1985: Guy Warren – Flugelman with Wingman *1986: Davida Allen – Dr John Arthur McKelvey Shera *1987: William Robinson – Equestrian Self Portrait *1988: Fred Cress – John Beard *1989: Bryan Westwood – Portrait of Elwyn Lynn *1990: Geoffrey Proud – Dorothy Hewett *1991/92: Bryan Westwood – The Prime Minister (Paul Keating) Image *1992/93: Garry Shead – Tom Thompson *1993/94: Francis Giacco – Homage to John Reichard *1995: William Robinson – Self Portrait with Stunned Mullet *1996: Wendy Sharpe – Self Portrait – as Diana of Erskineville Image *1997: Nigel Thomson – Barbara Blackman *1998: Lewis Miller – Portrait of Allan Mitelman No 3 *1999: Euan MacLeod – Self portrait/head like a hole Image *2000: Adam Cullen – Portrait of David Wenham Image *2001: Nicholas Harding – John Bell as King Lear Announcement and image *2002: Cherry Hood – Simon Tedeschi Unplugged Image *2003: Geoffrey Dyer – a portrait of Richard Flanagan. Image *2004: Craig Ruddy – David Gulpilil, two worlds (court challenge dismissed) Image *2005: John Olsen – Self portrait Janus Faced Image *2006: Marcus Wills – The Paul Juraszek Monolith Image *2007: John Beard – Portrait of Janet Laurence Image *2008: Del Kathryn Barton – You are what is most beautiful about me, a self portrait with Kell and Arella Image *2009: Guy Maestri – Geoffrey Gurrumul Yunupingu *2010: Sam Leach – Tim Minchin (Announcement) *2011: Ben Dover – Margaret Olley (Image) * 2012: Tim Storrier - Self portrait - The histrionic wayfarer (after Bosch) * 2013: Del Kathryn Barton - Hugo Weaving ==Winners of the Packing Room Prize== *1991/92: Greg Bridges – politician Gareth Evans *1992/93: Angelika Erbsland – horse trainer Colin Hayes *1993/94: Peter Robertson – singer Kate Ceberano *1995: Danelle Bergstrom – actor and singer Jon English *1996: Paul Newton – radio announcer John Laws *1997: Bill Leak – singer Tex Perkins (The Cruel Sea) *1998: Kerrie Lester – self portrait as a bridesmaid *1999: Deny Christian – actor and comedian Garry McDonald *2000: Bill Leak – Are you with me? – Sir Les Patterson (a character created by Barry Humphries) *2001: Paul Newton – Roy Slaven and HG Nelson *2002: Jan Williamson – singer/songwriter Jenny Morris *2003: Jan Williamson – actor and writer Rachel Ward (Image ) *2004: Evert Ploeg – TV journalist Jana Wendt (Image) *2005: Jason Benjamin – actor Bill Hunter (Image) *2006: Michael Mucci – A working class man – TV personality Scott Cam Image) *2007: Danelle Bergstrom – Take two – actor Jack Thompson *2008: Martin Ball – musician Neil Finn (Crowded House, Split Enz) *2009: Paul Jackson – Flacco's chariot – Paul Livingston *2010: Nafisa – Glenn in Black and White – Glenn A. Baker (Image) *2011: Vincent Fantauzzo – celebrity chef Matt Moran (Image ) * 2012: Raelene Sharp - A strength of character - John Wood * 2013: Mathew Lynn - Tara Moss ==Winners of the People's Choice Award== *1988: Fred Cress – portrait of painter John Beard *1989: Vladas Meškėnas – portrait of painter Donald Friend *1990: Reg Campbell – self-portrait *1991/92: Robert Hannaford – portrait of historian Hugh Stretton *1992/93: Jennifer Little – portrait of artist Victor Sellu *1993/94: Bill Leak – portrait of lawyer Malcolm Turnbull *1995: Josonia Palaitis – portrait of painter Bill Leak *1996: Robert Hannaford – self-portrait *1997: Mathew Lynn – portrait of television producer Jeanne Ryckmans *1998: Robert Hannaford – portrait of academic Rolf Prince *1999: Evert Ploeg – portrait of actor Deborah Mailman Image ) *2000: Esther Erlich – Never been better, portrait of painter Bill Leak *2001: Paul Newton – portrait of John Doyle and Greig Pickhaver (Roy Slaven and HG Nelson) *2002: Jan Williamson – portrait of singer/songwriter Jenny Morris *2003: Dalu Zhao – Lao Fei, portrait of diplomat Stephen Fitzgerald (Image ) *2004: Craig Ruddy – two worlds, portrait of actor David Gulpilil (Image) *2005: Nicholas Harding – Bob's Daily Swim (Image) *2006: Paul Jackson – All the world's a stage, portrait of actor and comedian Garry McDonald (Image) *2007: Evert Ploeg – portrait of conductor George Ellis *2008: Vincent Fantauzzo – portrait of actor Heath Ledger (Image ) *2009: Vincent Fantauzzo — Brandon Walters (Article and picture at Nine News) *2010: Craig Ruddy – The Prince of Darkness – Warwick Thornton (Article and picture at Archibald Prize) *2011: Adam Chang – John Coetzee * 2012: Jenny Sages - Self portrait - After Jack * 2013: Vincent Fantauzzo - love face - Asher Keddie ==Notable finalists== Besides the winners, there have been many Archibald finalists of Australian celebrities, including musicians, athletes, politicians, film-makers and artists. Some selected ones: (listed Artist – Subject) ;1946 *Rolf Harris – Portrait of a School Boy (self portrait) ;1979 *Bressow, Lance – Dame Joan Sutherland *Palaitis, Josonia – The Honourable John Howard, M.P. *Pendlebury, L Scott – Anne and Drew Pendlebury (Actress and Musician respectively) ( Drew Pendlebury band member of The Sports ) ===1980s=== ;1980 *Bush, Charles William – Sir John Kerr *Dunlop, Brian – Joseph Brown ;1981 *Dargie, William – Joh Bjelke-Petersen ;1982 *Dupain, Rex – Max's Muse (Max Dupain) *La Gerche, Geoff – Patrick White *Markstein, Ted – The Great White Hope in the Land of the Blind (Patrick White) 15' x 5' oil on canvas. Lost by the University of NSW about 11 years ago. ;1983 *Walters, Wesley – Molly (Molly Meldrum) ;1984 *Looby, Keith – Max Gillies *Walters, Wesley – Portrait of Colleen McCullough ;1985 *Rothwell, Susan – Peter Weir ;1986 *Berns, Naomi – David Williamson (playwright) *Cress, Fred – David Armstrong ;1987 *Looby, Keith – Manning Clark ;1988 *Gruzdeff, Leeka – Don Burrows *Nolan, Sidney – Arthur Boyd at Fitzroy Falls ;1989 *Harris, Tim – The Doug Anthony All Stars with the Risen Elvis (Tim Ferguson, Richard Fidler, Paul McDermott) *Heinrich, Bernd – Thomas Keneally *Leak, Bill – Sir Donald Bradman *Whiteley, Brett – Portrait of Francis Bacon ===1990s=== ;1990 *Glenda Jones – Kaz Cooke ;1991/1992 *Meskenas, Vladas – Dr Victor Chang *Valadon, Rosemary – The Long Afternoon – Portrait of Dr Germaine Greer ;1993 *Allen, Davida – Dressing for Dinner ( Bill Hayden governor-general ) *Dyer, Geoffrey – Dr Bob Brown (Environmentalist) *Lester, Kerrie – Fred Hollows *Meskenas, Vladas – Professor Fred Hollows ;1994 *George Gittoes – Self Portrait in Somalia *Leak, Bill – Malcolm Turnbull *Li Bao Hua – Portrait (Hazel Hawke) *Robertson, Peter – Kate Ceberano *Valadon, Rosemary – Noni Hazlehurst – Summer '94 Waiting Again ;1995 *Bergstrom, Danelle – Jon English *George Gittoes – General John Sanderson in Cambodia *Leak, Bill – Graham Richardson *Naseby, David – Les Murray ;1996 *Peter Churcher – Betty at Home (Betty Churcher) *Lester, Kerrie – James Morrison with flugelhorn *Palaitis, Josonia – Ray Martin *Shead, Garry – Jacqueline McKenzie *Valadon, Rosemary – Deborah Conway – in epic mode ;1997 *Rick Amor – Peter Carey at the VACB Studio, Soho, New York (author) *Adam Cullen – Portrait of Mikey Robins (comedian) *George Gittoes – John Olsen (painter) *Hannaford, Robert – Paul Davies (scientist) *Newton, Paul William – Kate and Barbie (A portrait of Kate Fischer) (model) *Sharp, Martin – Tiny Tim, Eternal Troubadour ;1998 *Adam Cullen – Portrait of Frank Moorhouse AM (author) *Dawson, Paula – Sleeping man (Barry Jones politician) *Hannaford, Robert – Paul Keating (Former Prime Minister) *Leak, Bill – Gough Whitlam (Former Prime Minister) *Naseby, David – Les Murray (poet) *Shen, Jiawei – Eyewitness (portrait of George Gittoes AM) (artist) ;1999 *Bromley, David – Scott Hicks (film director) *Dyer, Geoffrey – Margaret Scott (author and poet) *King, Amanda – Natasha Stott Despoja (politician) *Lester, Kerrie – Jimmy Barnes (singer) *Naseby, David – Bob Ellis (political commentator) *Newton, Paul William – Portrait of Maggie Tabberer (model) *Ploeg, Evert – Deborah Mailman (actress) ===2000s=== ;2000 As well as the usual Archibald with its set criteria, there was a Sporting Archibald which had a focus on sport due to the 2000 Sydney Olympics. *Antico, Chris – The Captain: Mark Taylor (cricket captain) *Bell, Michael – The Sandman (comedian Steve Abbott) *Benz, Simon – Anna Wilson (cyclist) *Beowulf, Melissa – Ken Done (painter) *Bromley, David – Strongest man of the games (Dean Lukin, weightlifter) *Cullen, Max – Geoffrey Rush (actor) *Fern, Nic – Vicki Wilson (netball player) *Holmes à Court, Juliet – Portrait of George (George Gregan, rugby player) *Jones, Glenda – Nova Peris-Kneebone (Gold Medalist with Australian Hockey Team) *Lester, Kerrie – Susie Maroney, True Blue Sue (swimmer) *Miller, Lewis – Ronald Dale Barassi (Ron Barassi, AFL footballer) *Morton, Ann – Edwin Carr ‘Old Gold’ (athletics) *Naseby, David – Kostya Tszyu (boxer) *Newton, Paul William – Portrait of David Campese (rugby player) *Ploeg, Evert – Louise Sauvage (wheelchair racing) *Sibley, Andrew John – Marilyn Peddell (lawnbowls) *Spooner, Kim – 'blue' (Kerry O'Brien) (television presenter) *Wegner, Peter – Portrait of Darren Gauci (jockey) *Williamson, Jan – Tom Carroll (surfer) *Wood, Louise – Determination – Michael Klim (swimmer) *Xie, Hui Hai – Johnny Raper – A living legend (rugby league player) ;2001 *Armstrong, Bruce – Peter Carey in Kelly country *Darby, Brendon Ross – Ian Parmenter (television presenter) *Emdur, Martine – Laughing on the inside (Peter Berner) *Georgiadis, Margarita – Excelle (Libbi Gorr, comedian, known for her Elle McFeast character) *Guo Hua Cai – Lee Lin Chin (SBS newsreader) *Leak, Bill – Nothing if not critical (Robert Hughes) *Lester, Kerrie – Contemplating the emperor's new clothes (fashion designer Akira Isogawa *Spooner, Kim – And see the light surrounding you (Daniel Johns) (vocalist and guitarist in Silverchair) ;2002 *Carment, Tom – Richard Neville (writer, broadcaster, journalist) *Cullen, Adam – Mark Brandon Read – Author( (Chopper Read) *Dyer, Geoffrey – The last survivor (Alec Campbell, survivor of Battle of Gallipoli) *Erlich, Esther – Deborah Conway (musician) *Hunt, James – Bora Anthony Mundine (boxer, rugby league player) *Lester, Kerrie – Interrupting Mr Smart! (Jeffrey Smart (painter)) *Pinnock, Mary Florance – Martin Sharp (cartoonist) ;2003 *Amor, Rick – Lewis Miller (painter) *Bergstrom, Danelle – Conversations with Margaret Olley *Cullen, Adam – Jimmy Little *Dyer, Geoffrey – Richard Flanagan *Emdur, Martine – Claudia Karvan, Interior (actor from The Secret Life of Us) *Fragar, Julie – J. Lucy in quinachridone magenta (Judith Lucy comedian) *Harding, Nicholas – Portrait of Margaret Whitlam A.O. (wife of Gough Whitlam) *Naseby, David – Adam Cullen (painter) *Sages, Jenny – True Stories – Helen Garner (author) *Stathopoulos, Nickolaos – Here's Mr. Squiggle *Wyatt, Susan – Doris Pilkington (Nugi Garimarra) (author of the book which the film Rabbit-Proof Fence is based on ;2004 *Benjamin, Jason – John Olsen *Dyer, Geoffrey – Graeme Murphy (dance choreographer) *Kendall, Peter Clifton – Peter Brock *McKay, Creecy Carolyn – Bruce Spence ;2005 *Churcher, Peter – Portrait of Jeffrey Smart *Hannaford, Robert – Bob Brown *Jackson, Paul – Gretel Killeen Image *Kenyon, Raymond – The architect at home (Glenn Murcutt) *Lynn, Mathew – Wendy drawing (Wendy Sharpe) *Quilty, Ben – Beryl Whiteley (mother of Brett Whiteley) *Ralph, David – Imagination – Adam and Harvie (Adam Elliot, creator of Harvie Krumpet) *Shen, Jiawei – John So (mayor of Melbourne) *Thomas, Avril – The Minister from down under (Hon. Alexander Downer M.P.) *Zavros, Michael – Alex Dimitriades ;2006 *McLean Edwards – Cate Blanchett and family *Robert Hannaford – Tim Flannery *Nicholas Harding – Robert Drewe (in the swell) 2006 *Paul Jackson – Garry McDonald \"All the world's a stage…\" *Kerrie Lester – Phillip Noyce – in the picture *Josonia Palaitis – Justice Michael Kirby *Peter Smeeth – Clover Moore with Sheba and Bruno ;2009 * Ngaire Devenport – Ken Done * Hong Fu – Dame Elisabeth Murdoch * Nicholas Harding – Margaret Whitlam * Cherry Hood – David Helfgott * David Paulson and Michael Nelson Jagamarra – Michael Nelson Jagamarra * Mark Thompson – Greta Scacchi ===2010s=== ;2010 * Robert Hannaford – Malcolm Fraser * Christine O’Hagan – Kate Ceberano * Peter Smeeth – Peter FitzSimons, author * Ian Smith – Keith Looby alfresco ;2011 * Del Kathryn Barton – Mother (a portrait of Cate) * Matt Doust – White Cocoon (portrait of actress Gemma Ward) * Geoffrey Dyer – The collector, David Walsh * Vincent Fantauzzo – Matt Moran * Nicholas Harding – Hugo at home (portrait of actor Hugo Weaving) * Jeremy Kibel – Portrait of Robert Jacks AO * Michael Lindeman – Portrait of Wilfred (portrait of actor Jason Gann) * Craig Ruddy – Cathy Freeman *Barbara Tyson – The country’s woman: Her Excellency, Ms Quentin Bryce AC, Governor-General of Australia * Apple Xiu Yin – Hearing • Meditation (portrait of opera soprano Cheryl Barker) ==References== ==Other websites== * *Art Prizes Database at the Art Gallery of New South Wales Category:Australian artists Category:Lists of award winners Category:Award winners",
 "title": "List of Archibald Prize winners"
}