{
 "id": "303359",
 "text": "A cognitive bias happens when someone makes a bad choice that they think is a good choice. This bias is an important part of the study of cognitive psychology.Haselton MG, Nettle D, Andrews PW (2005). \"The evolution of cognitive bias.\". In Buss D.M. (ed). The Handbook of Evolutionary Psychology. Hoboken, NJ, US: John Wiley & Sons Inc. pp. 724–746. ==Overview== Cognitive biases do happen. Primitive humans and animals do things which seem foolish later. The scientific method limits the results of cognitive bias. Cognitive bias is a natural consequence of our using \"gut feelings\" to make decisions when those decisions cannot be made rational because the evidence is not available. The notion of cognitive biases was introduced by Amos Tversky and Daniel Kahneman in 1972. ==Causes== It grew out of their experience of people's inability to reason with numbers. Tversky, Kahneman, and colleagues showed several repeatable ways in which human judgments and decisions differ from rational choice. The heuristic people use are mental shortcuts which provide swift estimates. Heuristics are simple for the brain to compute but sometimes introduce \"severe and systematic errors\". ==List of biases== Name Information Framing Belief bias Affinity bias Implicit bias Priming bias Hindsight bias Anchoring bias An example of the anchoring effect, is that a person can be more likely to buy a car if it is placed next to a more expensive model – the anchor. During negotiations, prices that are lower than the price of the anchor, may seem reasonable, or can even seem cheap to the buyer, even if those prices are (still) relatively higher than the actual market value of the car. Cho, I. et al. (2018) 'The Anchoring Effect in Decision-Making with Visual Analytics', 2017 IEEE Conference on Visual Analytics Science and Technology, VAST 2017 - Proceedings. IEEE, pp. 116–126. . Status quo bias Kahneman, D., Knetsch, J. L. and Thaler, R. H. (1991) Anomalies The Endowment Effect, Loss Aversion, and Status Quo Bias, Journal of Economic Perspectives. Dean, M. (2008) 'Status quo bias in large and small choice sets', New York, p. 52. Available at: http://www.yorkshire-exile.co.uk/Dean_SQ.pdf . Self-serving bias Confirmation bias Embodied cognition Overconfidence effect Related page: Dunning–Kruger effect. Fundamental attribution error Physical attractiveness stereotype A habit or tendency to assume that people who are physically attractive, are desirable for other reasons, too.Lorenz, Kate. (2005). \"Do Pretty People Earn More?\" http://www.CNN.com. === Other cognitive biases === There are many other cognitive biases. Anchoring biases include, * Common source bias * Conservatism bias * Functional fixedness * Law of the instrument Apophenia has several types, * Clustering illusion * Illusory correlation * Pareidolia Availability heuristic (also known as the availability bias) The availability heuristic includes or involves the following: * Anthropocentric thinking * Anthropomorphism * Attentional bias * Frequency illusion or Baader–Meinhof phenomenon * Implicit association * Salience bias See also von Restorff effect. * Selection bias * Survivorship bias * Quantification bias Related subject: McNamara fallacy. * Well travelled road effect ==Related pages== * Apophenia * Antiziganism * Antisemitism * Holocaust denial * Antisemitic stereotypes * Rwandan genocide denial * Cambodian genocide denial ==References== Category:Cognition Category:Bias",
 "title": "Cognitive bias"
}