{
 "id": "303405",
 "text": "Jared Joseph Leto (born December 26, 1971) is an American actor and musician. He is known for acting in movies such as Fight Club; Girl, Interrupted; Panic Room; American Psycho; Alexander; Requiem for a Dream; Lord of War, Prefontaine, Mr. Nobody and Suicide Squad in which he starred as The Joker. He started a rock band called Thirty Seconds to Mars in 1998 with his brother Shannon Leto. Leto was the lead singer. The band has released four albums. == Early life == Leto was born on December 26, 1971, in Bossier City, Louisiana, to Constance Leto (née Metrejon). His mother has Cajun ancestry. Leto is his stepfather's surname. His parents divorced when he was a child, and he and his older brother, Shannon, lived with their mother and their maternal grandparents, Ruby (Russell) and William Lee Metrejon. After he remarried, his father died by suicide when Jared was eight. Leto moved frequently with his family from Louisiana to different cities around the country. \"My mom's father was in the Air Force,\" Leto has explained, \"so moving around a lot was a normal way of life.\" Leto has two younger half-brothers from his father's second marriage. Constance joined the hippie movement and encouraged her sons to get involved in the arts. Leto said he \"was raised around a lot of artists, musicians, photographers, painters and people that were in theater,\" adding that \"Just having the art communal hippie experience as a child, there wasn't a clear line that was drawn. We celebrated creative experience and creative expression. We didn't try and curtail it and stunt any of that kind of growth.\" Leto started playing music with his brother at an early age; his first musical instrument was a broken-down piano. After dropping out briefly in the 10th grade, Leto decided to return and focus on his education at the private Emerson Preparatory School in Washington, D.C. He was interested in large-scale visual art and enrolled at the University of the Arts in Philadelphia. After developing an interest in filmmaking, he transferred to the School of Visual Arts in New York City. While he was a student there, he wrote and starred in his own short film, Crying Joy. He also attended the Corcoran School of the Arts and Design, now a part of George Washington University.GW Corcoran – Notable Alumni == Filmography == Actor Year Title Role Notes 1995 How to Make an American Quilt Beck 1996 Frankie Griffin Also known as Summer Fling 1997 Prefontaine Steve Prefontaine 1997 Switchback Lane Dixon 1998 Basil Basil 1998 Urban Legend Paul Gardener 1998 Second Lieutenant Whyte 1999 Black and White Casey 1999 Fight Club Angel Face 1999 Girl, Interrupted Tobias \"Toby\" Jacobs 2000 American Psycho Paul Allen 2000 Requiem for a Dream Harry Goldfarb 2000 Sunset Strip Glen Walker 2002 Highway Jack Hayes 2002 Panic Room Junior 2002 Phone Booth Bobby Uncredited cameo 2003 Sol Goode Rock Star Wannabe Uncredited 2004 Alexander Hephaestion 2005 Hubert Selby Jr: It/ll Be Better Tomorrow Himself Documentary movie 2005 Lord of War Vitaly Orlov 2006 Lonely Hearts Raymond Fernandez 2007 Chapter 27 Mark David Chapman 2009 Mr. Nobody Nemo Nobody 2011 TT3D: Closer to the Edge Narrator Voice 2012 Artifact Himself Also director 2013 Dallas Buyers Club Rayon 2016 Suicide Squad The Joker 2017 Blade Runner 2049 Niander Wallace 2018 The Outsider Nick Lowell Director Year Title Notes 2006 \"\" Music video 2006 \"From Yesterday\" Music video 2008 \"\" Music video 2009 \"Kings and Queens\" Music video 2010 \"Closer to the Edge\" Music video 2010 \"Hurricane\" Music video 2012 Artifact Documentary 2013 \"Up in the Air\" Music video 2013 \"City of Angels\" Music video 2015 Beyond the Horizon TV Documentary 2016 Great Wide Open Documentary Producer Year Title Notes 2001 Sol Goode Co-producer 2007 Chapter 27 Executive Producer 2012 Artifact Documentary 2016 Holy Hell Executive Producer Television Year Title Role Notes 1992– 1993 Camp Wilder Dexter 2 episodes 1993 Almost Home Rick Aiken Episode: \"The Fox and the Hound\" 1994– 1995 My So-Called Life Jordan Catalano 19 episodes 1994 Rebel Highway Michael Episode: \"Cool and the Crazy\" 1994 Cool and the Crazy Michael TV film 1998 Wild Life Adventures Himself Episode: \"Alaska's Bush Pilots\" 2003 Player$ Himself Episode: \"Posehn, Papa and Mars\" 2003 Hollywood High Himself Documentary film 2006 Narrator Documentary movie 2014– 2015 Into the Wild Himself Documentary; 16 episodes; also director == Other websites == * Jared Leto at the Internet Movie Database * Jared Leto on Myspace == References == Category:Actors from Louisiana Category:Actors who played the Joker Category:American movie actors Category:American rock singers Category:Best Supporting Actor Academy Award winners Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Singers from Louisiana Category:1971 births Category:Living people Category:Thirty Seconds to Mars Category:Progressive rock singers",
 "title": "Jared Leto"
}