{
 "id": "303448",
 "text": "Mugen Motorsports (M-TEC Co., Ltd) () is a Japanese company. It was formed in 1973 by Hirotoshi Honda and Masao Kimura. Hirotoshi Honda is the son of Honda Motor Company founder Soichiro Honda. Mugen is an engine tuner (performance improvement) and parts builder. They are closely linked with Honda. Mugen has never been owned by Honda. Mugen means \"Without Limit\", or \"Unlimited\". It is common to placed word \"Power\" after Mugen to say \"Unlimited Power\". The company tunes and races Honda vehicles in the Super GT championship. They also sell parts to amateur racers. Mugen was involved in Formula 3000 championships in 1990 and 1991. This led Mugen to join Formula One. They supplied engines from 1992 to 2000. They also supplied the only engines for Formula Nippon from 1996 until 2005. == Mugen Racing == === Single-seaters === In 1986, Formula 3000 was introduced into Japan. Mugen joined with Honda to build an F3000 engine. It was introduced in the 1987 season and leased to 14 teams. In 1988, Mugen won four of the top five places in the Japanese F3000 championship. In 1989, Mugen entered European F3000 with the MF308 engine. They won the championship with Jean Alesi driving a Reynard. The same year the company produced its own prototype 3.5 L V8 Formula One engine, codenamed MF350. In 1988, Mugen started tuning Honda engines for use in Formula Three. They won the Japanese series with Akihiko Nakaya, and in 1990 expanded to Europe. Mugen won its first Formula Three championships in Europe. They took the French title with Eric Hélary, and the British crown with Mika Häkkinen. They also won the title in 1991 with Rubens Barrichello. === Formula One === In 1991, Mugen built Honda V10 engines for Tyrrell. In 1992 the engine was renamed to Mugen MF351H. The engine was used by the Footwork team in 1992 and 1993. In 1994, Mugen moved to Team Lotus with the new Lotus 109. The team was underfunded and the 109 chassis was late arriving. The car and its engine was scored a single point. At the end of the year, Lotus closed down. Mugen switched to the Ligier team in 1995. In 1996 Mugen won its first Formula One race. The 3.0 L engine, codenamed MF301H, won at the 1996 Monaco Grand Prix with Olivier Panis driving. Ligier was taken over by Alain Prost in 1997, and renamed Prost Grand Prix. When Prost changed Peugeot engines in 1998, Mugen reached a two-year agreement with Jordan Grand Prix. The 1998 season saw a 1-2 finish at Spa-Francorchamps with Damon Hill and Ralf Schumacher. In 1999, Heinz-Harald Frentzen won twice and Jorden finished the constuctors championship in third place. In 2000, the Honda Motor Company announced that it would be returning for Formula One. Honda would supply its own engines in 2000 with British American Racing. At the end of the 2000 season, Mugen pulled out of F1. === Sportscar racing === In 1998, Mugen entered sports car racing. They built several NSX race cars. In 2000, the Mugen/Dome team was champion. In 2001, in the JGTC, the Mugen NSX won two races. In June, the company announced the a new 4.0 L V8. The MF408S was built for the main prototype class in the 24 Hours of Le Mans and American Le Mans Series. == Vehicles == Mugen has built concept Honda vehicles. Some models are sold in Japanese domestic market. === List of Mugen vehicles === * Honda city turbo I and II * 1984 Mugen Honda CR-X * 2004 Honda Fit Dynamite * 2005 Honda Legend Max * 2006 Honda Fit Spec.D * 2006 Honda Civic Dominator * the Road to Racing Concept (Honda Civic-based) (2007) * Open-Top Pure Sports Concept (Honda S2000-based) (2007) * Mugen Courage LC70 (Japan Le Mans Challenge LMP-1) (2007) * Mugen S2000 (2008) * Honda Fit F154SC (2008) * Mugen RR Experimental Spec. (Honda Civic Type R-based) (2008) * Honda Civic 5D MUGEN * Honda NSX Mugen RR (2009) * Honda Civic Mugen RR Advanced Concept (2009) * Honda Accord Mugen 24sc (2009) * Honda Odyssey Mugen (2009) *2005 Subaru Legacy GT Silver with Gold Rims === Production vehicles === * Civic Mugen Si * Civic Mugen RR * CR-Z Mugen * Prelude Mugen == Complete Formula One results == === As an engine supplier === (key) (Results in bold indicate pole position; results in italics indicate fastest lap.) Year Entrant Chassis Engine(s) Tyres Drivers 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 Points WCC 1992 Footwork Arrows Footwork FA13 Mugen Honda MF-351H 3.5 L V10 RSA MEX BRA ESP SMR MON CAN FRA GBR GER HUN BEL ITA POR JPN AUS 6 7th Michele Alboreto 10 13 6 5 5 7 7 7 7 9 7 Ret 7 6 15 Ret Aguri Suzuki 8 DNQ Ret 7 10 11 DNQ Ret 12 Ret Ret 9 Ret 10 8 8 1993 Footwork Arrows Footwork FA13B Footwork FA14 Mugen Honda MF-351 HB 3.5 L V10 RSA BRA EUR SMR ESP MON CAN FRA GBR GER HUN BEL ITA POR JPN AUS 4 9th Derek Warwick 7 9 Ret Ret 13 Ret 16 13 6 17 4 Ret Ret 15 14 10 Aguri Suzuki Ret Ret Ret 9 10 Ret 13 12 Ret Ret Ret Ret Ret Ret Ret 7 1994 Team Lotus Lotus 107C Lotus 109 Mugen Honda MF-351 HC 3.5 L V10 Mugen Honda MF-351 HD 3.5 L V10 BRA PAC SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR EUR JPN AUS 0 – Johnny Herbert 7 7 10 Ret Ret 8 7 11 Ret Ret 12 Ret 13 Pedro Lamy 10 8 ret 11 Alessandro Zanardi 9 15 Ret Ret Ret 13 Ret 16 13 Ret Philippe Adams Ret 16 Éric Bernard 18 Mika Salo 10 Ret 1995 Equipe Ligier Ligier JS41 Mugen Honda MF-301 3.0 L V10 BRA ARG SMR ESP MON CAN FRA GBR GER HUN BEL ITA POR EUR PAC JPN AUS 24 5th Martin Brundle 9 Ret 10 4 Ret Ret 3 Ret 8 7 Ret Aguri Suzuki 8 Ret 11 6 Ret DNS Olivier Panis Ret 7 9 6 Ret 4 8 4 Ret 6 9 Ret Ret Ret 8 5 2 1996 Equipe Ligier Ligier JS43 Mugen Honda MF-301 HA 3.0 L V10 AUS BRA ARG EUR SMR MON ESP CAN FRA GBR GER HUN BEL ITA POR JPN 15 6th Olivier Panis 7 6 8 Ret Ret 1 Ret Ret 7 Ret 7 5 Ret Ret 10 7 Pedro Diniz 10 8 Ret 10 7 Ret 6 Ret Ret Ret Ret Ret Ret 6 Ret Ret 1997 Prost Grand Prix Prost JS45 Mugen Honda MF-301 HB 3.0 L V10 AUS BRA ARG SMR MON ESP CAN FRA GBR GER HUN BEL ITA AUT LUX JPN EUR 21 6th Olivier Panis 5 3 Ret 8 4 2 11 6 Ret 7 Jarno Trulli 10 8 4 7 15 10 Ret Shinji Nakano 7 14 Ret Ret Ret Ret 6 Ret 11 7 6 Ret 11 Ret Ret Ret 10 1998 Jordan Grand Prix Jordan 198 Mugen Honda MF-301 HC 3.0 L V10 AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN 34 4th Damon Hill 8 DSQ 8 10 Ret 8 Ret Ret Ret 7 4 4 1 6 9 4 Ralf Schumacher Ret Ret Ret 7 11 Ret Ret 16 6 5 6 9 2 3 Ret Ret 1999 Jordan Grand Prix Jordan 199 Mugen Honda MF-301 HD 3.0 L V10 AUS BRA SMR MON ESP CAN FRA GBR AUT GER HUN BEL ITA EUR MAL JPN 61 3rd Damon Hill Ret Ret 4 Ret 7 Ret Ret 5 8 Ret 6 6 10 Ret Ret Ret Heinz-Harald Frentzen 2 3 Ret 4 Ret 11 1 4 4 3 4 3 1 Ret 6 4 2000 Jordan Grand Prix Jordan EJ10 Jordan EJ10B Mugen Honda MF-301 HE 3.0 L V10 AUS BRA SMR GBR ESP EUR MON CAN FRA AUT GER HUN BEL ITA USA JPN MAL 17 6th Heinz-Harald Frentzen Ret 3 Ret 17 6 Ret 10 Ret 7 Ret Ret 6 6 Ret 3 Ret Ret Jarno Trulli Ret 4 15 6 12 Ret Ret 6 6 Ret 9 7 Ret Ret Ret 13 12 Pole position in Bold. Fastest lap in Italics. === Formula One statistics === Year Team GPs Wins Points WCC 1992 Footwork- Mugen Honda 16 0 6 7th 1993 Footwork-Mugen Honda 16 0 4 9th 1994 Lotus-Mugen Honda 16 0 0 – 1995 Ligier-Mugen Honda 17 0 24 5th 1996 Ligier-Mugen Honda 16 1 15 6th 1997 Prost-Mugen Honda 17 0 21 6th 1998 Jordan-Mugen Honda 16 1 34 4th 1999 Jordan-Mugen Honda 16 2 61 3rd 2000 Jordan-Mugen Honda 17 0 17 6th == References == == Other websites == *Mugen Official Site * Forum Community for Mugen Enthusiasts and Owners *Mugen authorised agent for United States of America *Mugen authorised agent for New Zealand and Pacific Islands *2009 Civic Type R Mugen Championship White available in the UK Category:Formula One engine manufacturers",
 "title": "Mugen Motorsports"
}