{
 "id": "303618",
 "text": "The United States women's national soccer team is the United States women's team that is controlled by the United States Soccer Federation. The United States team has for a long time been a great team, and is currently ranked the second best team, by FIFA. The team has won three Women's World Cup titles (1991, 1999, 2015); four Olympic Women's Gold Medals (1996, 2004, 2008 and 2012) and eight Algarve Cups (2000, 2003, 2004, 2005, 2007, 2008, 2010 and 2011). The team was also selected as the U.S. Olympic Committee's Team of the Year (1997 and 1999). Sports Illustrated chose the team as the Sportspeople of the Year (1999). == World Cups == === 2011 === The United States lost to Japan in the finals, so United States finishes as runner-up (for the first time). They also beat Brazil, which had beaten them in the semifinals of the 2007 FIFA Women's World Cup. === 1999 === The United States won their second title on this year. After they defeated China 5-4 in the penalty kicks, a lot more people began to watch Women's football. Also, after Brandi Chastain made the last penalty, she randomly slid on the grass and ripped of her shirt. This brought a lot of attention, but Brandi Chastain said \"Momentary insanity, nothing more, nothing less. I wasn’t thinking about anything. I thought, ‘This is the greatest moment of my life on the soccer field.\" === 1991 === The United States won their first title on this year. They defeated Norway 2-1. == Most appearances == The U.S. women's team boasts the first six players in the history of the sport to have appeared 200 times for their national team. One of them, Kristine Lilly, is the only player of either sex with 300 or more appearances. Pos Player Apps Goals Career 1 Kristine Lilly 352 130 1987–2010 2 Christie Rampone 284 4 1997–2017 3 Mia Hamm 275 158 1987–2004 4 Julie Foudy 272 45 1987–2004 5 Joy Fawcett 239 27 1987–2004 6 Abby Wambach 207 184 2001–2015 7 Tiffeny Milbrett 204 100 1992–2006 8 Kate Markgraf 202 1 1998–2010 9 Brandi Chastain 192 30 1991–2004 10 Heather O'Reilly 188 36 2002–2016 == Top scorers == Pos Player Goals Apps Career 1 Abby Wambach 184 207 2001-2015 2 Mia Hamm 158 275 1987–2004 3 Kristine Lilly 130 352 1987–2010 4 Michelle Akers 105 153 1985–2000 5 Tiffeny Milbrett 100 204 1992–2006 6 Cindy Parlow 75 158 1995–2006 7 Shannon MacMillan 60 176 1994–2006 8 Carin Jennings-Gabarra 53 117 1987–1996 9 Julie Foudy 45 272 1987–2004 10 Carli Lloyd 44 157 2005–2021 10 Alex Morgan 44 68 2010–present 10 Tisha Venturini 44 132 1992–2000 ==References== Category:North American women's national association football teams Category:Soccer in the United States Category:National sports teams of the United States",
 "title": "United States women's national soccer team"
}