{
 "id": "303647",
 "text": "Pickett's Charge was an infantry attack ordered by Confederate General Robert E. Lee against Maj. Gen. George G. Meade's Union positions. The attack took place on Cemetery Ridge on July 3, 1863. It was part of the last day of the Battle of Gettysburg during the American Civil War. Lt. Gen. James Longstreet (who was in charge of attack) believed that it would fail. The farthest point reached by the attack has been called the high-water mark of the Confederacy. The charge is named after Maj. Gen. George Pickett. Pickett was one of three Confederate generals who led the attack under Longstreet. Lee hoped to attack the Union center on the third day of the Battle of Gettysburg. Confederate attacks on both Union sides had failed the day and night before. On the night of July 2, General Meade said at a council of war that he thought Lee would try an attack on his lines in the center the next day. A large attack by artillery took place before the infantry charge. The Confederates hoped the artillery attack would make the Union weaker. It did not work well. About 12,500 men in nine infantry brigades marched over open fields for three- quarters of a mile under heavy Union artillery and rifle fire. Some Confederates were able to get past the low stone wall that many of the Union defenders hid behind. However, they could not hold this area. The Union pushed the Confederates back. Over 50% of the Confederate soldiers on the charge suffered casualties. This defeat ended the three-day battle and Lee's campaign into Pennsylvania.Pfanz, pp. 44–52. Years later, when asked why his charge at Gettysburg failed, General Pickett said: \"I've always thought the Yankees had something to do with it.\"Boritt, p. 19. ==Notes== ==References== * Boritt, Gabor S., ed. Why the Confederacy Lost. Gettysburg Civil War Institute Books. New York: Oxford University Press, 1992. . * Clark, Champ, and the Editors of Time-Life Books. Gettysburg: The Confederate High Tide. Alexandria, VA: Time- Life Books, 1985. . * Coddington, Edwin B. The Gettysburg Campaign; a study in command. New York: Scribner's, 1968. . * Desjardin, Thomas A. These Honored Dead: How the Story of Gettysburg Shaped American Memory. New York: Da Capo Press, 2003. . * Dixon, Benjamin Y. Learning the Battle of Gettysburg: A Guide to the Official Records. Gettysburg, PA: Thomas Publications, 2007. . * Eicher, David J. The Longest Night: A Military History of the Civil War. New York: Simon & Schuster, 2001. . * Gallagher, Gary W. Lee and His Generals in War and Memory. Baton Rouge: Louisiana State University Press, 1998. . * Gottfried, Bradley M. The Maps of Gettysburg: An Atlas of the Gettysburg Campaign, June 3 – June 13, 1863. New York: Savas Beatie, 2007. . * Hall, Jeffrey C. The Stand of the U.S. Army at Gettysburg. Bloomington: Indiana University Press, 2003. . * Harman, Troy D. Lee's Real Plan at Gettysburg. Mechanicsburg, PA: Stackpole Books, 2003. . * Hess, Earl J. Pickett's Charge–The Last Attack at Gettysburg. Chapel Hill: University of North Carolina Press, 2001. . * Pfanz, Harry W. The Battle of Gettysburg. National Park Service Civil War series. Fort Washington, PA: U.S. National Park Service and Eastern National, 1994. . * Sears, Stephen W. Gettysburg. Boston: Houghton Mifflin, 2003. . * Stewart, George R. Pickett's Charge: A Microhistory of the Final Attack at Gettysburg, July 3, 1863. Boston: Houghton Mifflin, 1959. . * Symonds, Craig L. American Heritage History of the Battle of Gettysburg. New York: HarperCollins, 2001. . * Trudeau, Noah Andre. Gettysburg: A Testing of Courage. New York: HarperCollins, 2002. . * Wert, Jeffry D. Gettysburg: Day Three. New York: Simon & Schuster, 2001. . ==Further reading== * Bearss, Edwin C. Fields of Honor: Pivotal Battles of the Civil War. Washington, DC: National Geographic Society, 2006. . * Bearss, Edwin C. Receding Tide: Vicksburg and Gettysburg: The Campaigns That Changed the Civil War. Washington, DC: National Geographic Society, 2010. . * Gallagher, Gary W., ed. The Third Day at Gettysburg and Beyond. Chapel Hill: University of North Carolina Press, 1998. . * Haskell, Frank Aretas. The Battle of Gettysburg. Whitefish, MT: Kessinger Publishing, 2006. . * Laino, Philip, Gettysburg Campaign Atlas. 2nd ed. Dayton, OH: Gatehouse Press 2009. . * Petruzzi, J. David, and Steven Stanley. The Complete Gettysburg Guide. New York: Savas Beatie, 2009. . ==Other websites== *Pickett's Charge in Encyclopedia Virginia *Numbers at Pickett's Charge in Encyclopedia Virginia * Modern photograph of the Copse of Trees Category:American Civil War battles Category:1863 in Pennsylvania Category:Gettysburg, Pennsylvania Category:July events Category:1863 events",
 "title": "Pickett's Charge"
}