{
 "id": "303773",
 "text": "Bat-and-ball games are field games played by two teams. They are also known as safe haven (safe zone) games, because players generally score points and take risks by running between various safe zones in the field. These teams take turns \"batting\" and \"fielding.\" The team that is batting can score. The team that is fielding is defending. Both teams have equal chances batting and fielding. Bat-and-ball games are not timed, but are counted (such as by number of \"innings\" or \"rounds\".) The name bat-and-ball games comes from some common parts of most of these games. In most games, a player on the fielding team puts a ball into play, mostly by throwing the ball. (How the player does this depends on the game's rules.) Then a player on the batting team tries to hit the ball, usually with a \"bat.\" A bat is a kind of club, though the size and shape depend on the rules. This player can then run between the safe zones in the field to score points, though the fielding team can use the ball on the player from the batting team, or a target in one of the safe zones, to get the player \"out\" if they are not in a safe zone. (In cricket, a player who is out can not score points for the rest of their team's scoring turn, while in other bat-and-ball sports, they might have to wait before batting again.) Thus, the further the batting player can hit the ball away from the defensive players, the more points they are likely to be able to score. The two most popular bat- and-ball games in the world are cricket and baseball. Games like golf and hockey, which also use clubs, are not bat-and-ball games. (In golf, there are no teams. In hockey, the teams do not take turns \"batting\" and \"fielding.\") == Common parts == Here are some things many bat-and-ball games have: * When a batter makes a mistake, or one of the players on the fielding team does something good, the batter can be \"out\", meaning they stop batting. Another player on the batting team will bat when this happens. (See \"out\" in baseball and wicket/dismissal in cricket). ** If the ball is hit by the bat and caught by a fielder, the batter is out. (flyout or caught out) ** If the ball is thrown close to the batter and they don't hit it, they could be out. (Such as in a baseball strikeout, or being bowled out in cricket). ** When enough players on the batting team are out, this ends their turn to bat. (10 outs in cricket and 3 in baseball). * Having hit the ball, a batter can run from one safe place to another (e.g., the bases in baseball) and score runs. While running, or otherwise out of the safe place, the batter can be dismissed by the fielding team. Examples are the run out in cricket, and either the force play or tag out in baseball. * If the ball is hit to a certain place, or out of the field, then the batter scores a set number of runs. Examples are the home run in baseball, and the boundary in cricket). == Items used in game == * Bat: can be a baseball bat or cricket bat. It could also be like a hockey stick or something else. * Ball: A lot of the times it is the same size as a tennis ball. * Some things can be worn to protect the batter and/or fielders, like helmets or gloves. In the field, there may be: * Things showing where the safe zones for runners are (such as bases, wickets, and lines like the crease (cricket)) * Something showing the \"strike zone\" near the batter (like the target in Vitilla) * Something at the edges of the field (like the fence in baseball) == List of bat-and-ball games == * Baseball * Bat-and-Trap * British baseball * Brännboll * Corkball * Cricket **Test cricket ** First-class cricket ** Blind cricket ** Catchy Shubby ** Club cricket ** French cricket ** Kilikiti ** One Day International ** Kwik cricket ** List A cricket ** Pro40 ** Indoor Cricket ** Limited overs cricket ** Short form cricket ** Single Wicket ** Twenty20 ** Street cricket * Crocker (sport) * Danish longball * Gilli-danda * Lapta * The Massachusetts Game * Oina * Old Cat * Over-the-line * Pesäpallo * Rounders * Scrub baseball * Softball * Stickball * Stool ball * T-Ball * Town ball * Vigoro * Wiffle Ball * Wireball ==References== Category:Team sports",
 "title": "Bat-and-ball games"
}