{
 "id": "303764",
 "text": "The Croatian National Resistance (Odpor) was a terrorist Ustaše emigrant organization. The goal of this organization was to destroy Yugoslavia and to establish an independent Croatia, following the vision of Ustaše leader Ante Pavelić and ideology of Mile Budak. It was started in 1955 by escaped Ustaše war criminal Vjekoslav Luburić. He was a chief guard of the Jasenovac concentration camp. While Luburić was the head of this organization, Odpor maintained regular contacts with associations of Nazi war veterans in Germany and Spain. Very close relations were established with fascist Spanish \"Blue Guard\" veterans.Bogdan Krizman: Pavelić u bjekstvu, Globus Zagreb 1986. It had stated that: > \"[We] regard Yugoslavism and Yugoslavia as the greatest and only evil that > has caused the existing calamity [...] We therefore consider every direct or > indirect help to Yugoslavia as treason against the Croatian nation [...] > Yugoslavia must be destroyed - be it with the help of the Russians or the > Americans, of Communists, non-Communists or anti-Communists - with the help > of anyone willing the destruction of Yugoslavia: destroyed by the dialectic > of the word, or by dynamite - but at all costs destroyed.\" It had its Australian branch based in Melbourne. It was linked to the Odpor headquarters in Spain and to the Ustaše movement around the world. The Australian branch was led by Srecko Blaz Rover. Odpor was heavily involved in racketeering, extortion, hijacking, terrorist bombing, and other violent crimes. After Luburić's death made links with La Cosa Nostra, the Provisional Irish Republican Army, and the Croatian Mafia in San Pedro. Odpor most spectacular action was the 10 September 1976 hijacking of aTrans World Airlines flight from New York to Chicago. Odpor's five hijackers diverted the plane to Newfoundland, from there to Iceland, and then to Paris with passengers aboard. The terrorists had planted a bomb in Grand Central Station. After authorities met the terrorists' demands, they told them where the bomb was. The bomb deactivation killed one policeman and another three injured, when they tried to deactivate it. After the terrorists learned that the bomb in New York had exploded and killed a policeman, they surrendered to French police. The leaders of the hijackers of TWA Flight 355, Zvonko Bušić and his wife, Julienne Bušić, were both convicted on U.S. federal charges of air piracy and murder in May 1977 and sentenced to life imprisonment. Julienne Bušić was released from prison on lifelong parole in 1989. Zvonko Bušić briefly escaped from prison on 16 March 1987 but was captured two days later. Julienne Bušić was appointed by President Franjo Tudjman to the diplomatic post of adviser to the Croatian ambassador to the United States. This appointment of a convicted terrorist to a diplomatic post within the United States drew protests in December 1994 from the New York Patrolmen’s Benevolent Association as well as from Kathlyn Murray, the widow of the police officer killed by the bomb in Grand Central Station in 1976. Zvonko Bušić, was paroled in July 2008 and expelled from the U.S. to Croatia. In 1980s Odpor carried out five bombings in the United States. Bombed were (causing no injuries): *the U.S. office of a Yugoslavian bank (17 March 1980); *the home of the acting Yugoslavian ambassador (3 June 1980); *the Manhattan New York State Supreme Court (23 January 1981, pipe bomb) for which prior notice was given by the group; *the Yugoslavian Airlines office in New York City (4 July 1981); *a travel agency office in Astoria, New York (4 July 1982, pipe bomb).Anderson, Sean K., Anderson, Stephen S. (2009): Historical Dictionary of Terrorism by Sean K. Anderson and Stephen S. Anderson, Third Edition, Scarecrow Press, , , pages 129-130 Odpor was banned in Germany for terrorist activities. It had legitimate emigre functions. It also had a thuggish underworld. Its leaders tried to distance the organization from the acts of the elements that hijacked international flights and served prison sentences for extortion. It had a radical nationalist ideology that differed only marginally from Ustaše ideology. A number of terrorist attacks against Yugoslavia were organized by this Ustaše organization. They were Miro Barešić's killing of ambassador Vladimir Rolović, bomb attacks in Belgrade cinemas, terrorist group actions in Krajina region during the Croatian Spring of 1971, and the JAT Flight 367 bombing of 1972. The organization published its own magazine, Drina. It was dissolved in 1991. ==References== Category:Nationalist organizations in Europe Category:Yugoslavia Category:20th-century establishments in Croatia Category:1955 establishments in Europe Category:1991 disestablishments in Europe",
 "title": "Croatian National Resistance"
}