{
 "id": "303975",
 "text": "Mongolia at the Olympics is a history which began in 1956. The International Olympic Committee's official abbreviation for Mongolia is MGL. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-10-12. ==History== A team from Mongolia was first at the Olympic Games in 1964. They have been in every Summer Olympic Games since then, except the boycotted 1984 Summer Olympics. Mongolia has also been in the Winter Olympic Games since 1964. They have missed only the 1976 Winter Games. Mongolian athletes have won a total of 30 medals, all in Summer Olympics competitions. The Mongolian National Olympic Committee was formed in 1956 and recognized by the International Olympic Committee in 1962. ==List of medalists== Medal Name Games Sport Event 1968 Mexico Wrestling Men's freestyle middleweight In place of Tömöriin Artag and Chimedbazaryn Damdinsharav the IOC database incorrectly lists Püreviin Dagvasüren and Sükhbaataryn Sürenjav as medalists. 1968 Mexico Wrestling Men's freestyle flyweight 1968 Mexico Wrestling Men's freestyle lightweight 1968 Mexico Wrestling Men's freestyle welterweight 1972 Munich Wrestling Men's freestyle heavyweight 1976 Montreal Wrestling Men's freestyle featherweight 1980 Moscow Judo Men's half lightweight 1980 Moscow Wrestling Men's freestyle welterweight 1980 Moscow Judo Men's lightweight 1980 Moscow Wrestling Men's freestyle bantamweight 1988 Seoul Boxing Men's lightweight 1992 Barcelona Boxing Men's lightweight 1992 Barcelona Shooting Women's 25 m pistol 1996 Atlanta Judo Men's extra lightweight 2004 Athens Judo Men's extra lightweight 2008 Beijing Shooting Women's 25 m pistol 2008 Beijing Judo Men's half heavyweight 2008 Beijing Boxing Men's light fly (48 kg) 2008 Beijing Boxing Men's bantam (54 kg) 2012 London Boxing Men's flyweight (52 kg) 2012 London Judo Men's heavy (100 kg) 2012 London Judo Men's lightweight (73 kg) 2012 London Wrestling Women's freestyle wrestling (63 kg) 2012 London Boxing Men's light welterweight (64 kg) 2016 Rio de Janeiro Judo Women's 57 kg 2016 Rio de Janeiro Boxing Men's lightweight 2020 Tokyo Judo Men's 81 kg 2020 Tokyo Judo Women's 48 kg 2020 Tokyo Judo Men's 73 kg 2020 Tokyo Wrestling Women's freestyle 53 kg ==Related pages== * List of IOC country codes == References == == Other websites == Category:Nations at the Olympics Category:Sport in Mongolia",
 "title": "Mongolia at the Olympics"
}