{
 "id": "303970",
 "text": "Malaysia was first at the Olympic Games in 1956. The International Olympic Committee's official abbreviation for Malaysia was MAL. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-8-19. It is now MAS.\"Abbreviations, National Olympic Committees,\" 2009 Annual Report, p. 91 [PDF p. 92 of 94]; retrieved 2012-10-12. ==History== Teams from Malaysia have been in every Summer Olympic Games since 1956, except the boycotted 1980 Summer Olympics. Malaysia has never been in the Winter Olympic Games. As the Federation of Malaya, the nation was namedMalaya (MAL) for the 1956 and 1960 Games. North Borneo sent an independent team to the 1956 Games, and Singapore had also competed at the Olympics from 1948 to 1960. After these British colonies formed an independent Malaysia in 1963, the nation competed under that name for the first time at the 1964 Summer Olympics. Singapore regained independence from Malaysia in 1965 and competed once again as Singapore at the Olympics from 1968 onwards. Malaysian athletes have won a total of 11 Olympic medals. Most are in badminton. The National Olympic Committee for Malaysia was formed in 1953 and recognized by the International Olympic Committee in 1954. ==List of medalists== * Medalist of Demonstration & Exhibition Sports Medal Name Games Sport Event Ng Boon Bee Punch Gunalan Badminton Men's doubles Hii King Hung Taekwondo Bantamweight (47–51 kg) Razif Sidek Jalani Sidek Badminton Men's doubles Cheah Soon Kit Yap Kim Hock Badminton Men's doubles Rashid Sidek Badminton Men's singles Lim Yew Fai Wushu Men's Jianshu / Qiangshu Chai Fong Ying Wushu Men's Taijiquan / Taijijian Pui Fook Chien Wushu Men's Nanquan / Nangun Chai Fong Wei Wushu Women's Daoshu / Gunshu Diana Bong Siong Lin Wushu Women's Nanquan / Nandao Lee Chong Wei Badminton Men's singles Lee Chong Wei Badminton Men's singles Pandelela Rinong Diving Women's 10 metre platform Lee Chong Wei Badminton Men's singles Goh V Shem Tan Wee Kiong Badminton Men's doubles Chan Peng Soon Goh Liu Ying Badminton Mixed doubles Cheong Jun Hoong Pandelela Rinong Diving Women's synchronised 10 metre platform Azizulhasni Awang Cycling Men's keirin Azizulhasni Awang Cycling Men's keirin Aaron Chia Soh Wooi Yik Badminton Men's doubles Aaron Chia Soh Wooi Yik Badminton Men's doubles Lee Zii Jia Badminton Men's singles === Medals of demonstration and exhibition sports === *Only for demonstration and exhibition sports medalists ==Related pages== * List of IOC country codes ==References== == Other websites == * Malaysia profile at London2012.com Olympics Category:Nations at the Olympics Category:National sports teams of Malaysia",
 "title": "Malaysia at the Olympics"
}