{
 "id": "304694",
 "text": "Philip Anthony \"Phil\" Jones (born 21 February 1992) is an English footballer. Jones plays as a defender for Montego Bay United F.C, in Jamaica, and is a former England international. He played for Blackburn Rovers at both youth and senior levels before joining Manchester United. Jones usually plays central defender, but can also play as a right-back or defensive midfielder. ==Club career== ===Blackburn Rovers=== Jones was born in Preston, Lancashire. He grew up in Clayton-le-Woods. He joined Blackburn Rovers' youth team in 2002. He joined the senior team for the 2009–10 Premier League season. Jones signed a two-year contract with the team. He wore uniform number 28 for Blackburn. He played his first game for Blackburn on 22 September 2009 in a League Cup game against Nottingham Forest. Blackburn won 1–0. In February 2010, he signed a new five-year contract. The contract had a £16 million release clause. Jones made his first Premier League start for Blackburn against Chelsea on 21 March. The game was a 1–1 draw at Ewood Park. Jones started the 2010–11 season in midfield. He became one of the starters for the team. Jones hurt his knee in a game against West Ham United in December 2010. He could not play for three months because of the injury. ===Manchester United=== On 13 June 2011, Manchester United said that they had reached a deal to sign Jones. The deal was for an undisclosed transfer fee. The deal would be finished upon his return from international games. He played his first game for the club on the 2011 pre-season tour to the USA, in United's 3–1 victory over Chicago Fire. Jones played as a second-half substitute, replacing Rio Ferdinand, in a 3–2 win over rivals Manchester City in the 2011 Community Shield. Jones played in his first Premier League game for United a week later. He entered again as a substitute for Ferdinand. United beat West Bromwich Albion 2–1 on the opening weekend. ==International career== Jones played his first game for the England under-19 team in the 3–1 win over Turkey on 17 November 2009. He has since played three more times for the under-19s. On 4 August 2010, Jones joined the England under-21 squad. On 10 August, Jones won his first under-21 cap, starting for England against Uzbekistan. He was substituted in the 46th minute and was replaced by Liverpool's Martin Kelly. He was selected for the 2011 U-21 European Championship in Denmark. Manager Stuart Pearce made Jones the captain of the team. In 5 August 2011, he joined the England first-team squad for the friendly against the Netherlands. The game was cancelled four days later by the FA after the riots in London. In November 2011, he competed in two home games for England at Wembley. The first was a 1-0 win against the world champions, Spain. The second was also a 1-0 win over Sweden. In both games he played midfield, this is in contrast to his 'right back' role for his club side, Manchester United. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League League League FA Cup FA Cup League Cup League Cup Europe Europe Other Other Total Total Club Season Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Blackburn Rovers 2009–10 Premier League 9 0 1 0 2 0 — — — — 12 0 Blackburn Rovers 2010–11 Premier League 26 0 0 0 2 0 — — — — 28 0 Blackburn Rovers Total Total 35 0 1 0 4 0 — — — — 40 0 Manchester United 2011–12 Premier League 29 1 1 0 1 0 9 1 1 0 41 2 Manchester United 2012–13 Premier League 17 0 4 0 0 0 3 0 — — 24 0 Manchester United 2013–14 Premier League 26 1 0 0 4 1 8 1 1 0 39 3 Manchester United 2014–15 Premier League 22 0 2 0 0 0 — — — — 24 0 Manchester United 2015–16 Premier League 10 0 0 0 1 0 2 0 — — 13 0 Manchester United 2016–17 Premier League 18 0 2 0 3 0 3 0 0 0 26 0 Manchester United 2017–18 Premier League 23 0 2 0 0 0 0 0 0 0 25 0 Manchester United 2018–19 Premier League 18 0 2 0 1 0 3 0 — — 24 0 Manchester United 2019–20 Premier League 2 0 1 1 2 0 3 0 — — 8 1 Manchester United 2020–21 Premier League 0 0 0 0 0 0 0 0 — — 0 0 Manchester United 2021–22 Premier League 4 0 1 0 0 0 0 0 — — 5 0 Manchester United 2022–23 Premier League 0 0 0 0 0 0 0 0 — — 0 0 Manchester United Total Total 169 2 15 1 12 1 31 2 2 0 229 6 Career total Career total Career total 204 2 16 1 16 1 31 2 2 0 269 6 ===International=== Appearances and goals by national team and year National team Year Apps Goals England 2011 3 0 2012 2 0 2013 4 0 2014 4 0 2015 7 0 2016 0 0 2017 4 0 2018 3 0 Total 27 0 ==Honours== Manchester United *Premier League: 2012–13 *FA Cup: 2015–16 *FA Community Shield: 2011, 2013 *UEFA Europa League: 2016–17 == References == Category:1992 births Category:Living people Category:English footballers Category:Blackburn Rovers F.C. players Category:Manchester United F.C. players Category:People from Preston, Lancashire Category:Sportspeople from Lancashire Category:Premier League players Category:UEFA Euro 2012 players Category:2014 FIFA World Cup players Category:2018 FIFA World Cup players",
 "title": "Phil Jones (footballer)"
}