{
 "id": "304818",
 "text": "Andrew Barry Casson Gaze (born 24 July 1965) is a famous Australian basketball player.Basketball Australia : Board of Directors . Basketball.net.au. Retrieved on 2011-06-02.Speaker Andrew Gaze Full Biography – Speakers Bureau @ ICMI . Icmi.com.au. Retrieved on 2011-06-02.Andrew Gaze. NAB. Retrieved on 2011-06-02. He has been very successful in his career. Andrew is the son of Lindsay Gaze, who coached and played basketball himself. Andrew started playing in the NBL when he was 18 years old. He won the 'rookie of the year' prize in 1984. He scored the most points out of everyone in a season 14 times. This was because he was very good at shooting, including 'three-point' shots. Gaze played with Lanard Copeland at the Melbourne Tigers for most of his career. He often through 'alley oop' passes to Copeland.Andrew Gaze and Lanard Copeland. YouTube (2008-07-05). Retrieved on 2011-06-02. Gaze helped the Tigers reach the finals almost every year. He also helped them win two championships. Gaze played in the Olympic Games for Australia in 1984, 1988, 1992, 1996 and 2000. In 2000 he became only the third basketball player to play in 5 Olympic Games. He led the team to 4th place at the 1988, 1996 and 2000 Olympics.Andrew Gaze Biography and Olympic Results | Olympics at . Sports-reference.com. Retrieved on 2011-06-02.) He was chosen to be the flag-bearer for the Australian team at the opening ceremony at the 2000 Sydney Olympics. He has scored more points at the Olympics than any other player. He is the second-highest scorer of all-time in World Championship play. In 1988–99, Gaze played for a season college basketball at Seton Hall. His team reached the 1989 NCAA finals. They lost in overtime to Michigan. He tried out with the NBA's Seattle SuperSonics, but did not make the team.Sonics Release Gaze published October 31, 1989 In 1993–94 he played seven games for the Washington Bullets. He also played with the San Antonio Spurs in 1998, but became hurt at the end of the season. The Spurs won the title and Gaze was given a championship ring. After the Sydney Olympics, Gaze retired from playing overseas. He retired from the NBL on May 12th 2005. He had played for more than 20 years. Soon after, he wrote his autobiography, A Kid, a Ball, a Dream, with help from Grantley Bernard. Nowadays, Gaze often takes part in TV advertisements. He also commentates for channel 7, SEN 1116 and (occasionally) Fox Sports. Gaze now coaches for the Melbourne Tigers' junior basketball club. Gaze took part in series five of Dancing with the Stars He is now also working as a presenter on Channel Seven's Guide to the Good Life. ==Records and awards== *Record for most Olympic Games for an Australian basketballer (5) *Scored 18,908 points in the NBL over 612 games in a 22-season span at an average of 30.9 points per game *Received Most Valuable Player (MVP) award a record 7 times *Australian International Player of the Year (1990, 1994, 1995, 1996, 1998, 2000) *won the NBL Most Efficient Player award every year from 1990 to 1997. The award was then stopped, making Gaze the only ever person to win the award. *Crowned Moomba Monarch (usually called King of Moomba) by the Melbourne festival committee in 1994.Craig Bellamy, Gordon Chisholm, Hilary Eriksen (17 Feb 2006) Moomba: A festival for the people. pp. 17–22 *Former Consultation Committee Member of the Human Rights Consultation Committee of Vicotria which formulated the Draft Charter of Human Rights and Responsibilities, a precursor to the Victorian Charter of Rights.The Victorian Charter of Human Rights and Responsibilities: Exegesis and Criticism – [2006] MULR 28; 30(3) Melbourne University Law Review 906. Austlii.edu.au. Retrieved on 2011-06-02. ==Sources== ==Web links== *http://www.interbasket.net/players/gaze.htm * Sports-Reference Profile * Andrew Gaze's Full Biography * Gaze.com.au – Official Homepage * Follow the Bouncing Ball – interview with Andrew Gaze Radio Interview * Gaze's NBA Statistics Category:1965 births Category:Living people Category:Australian basketball players Category:Australian autobiographers Category:Point guards Category:Shooting guards Category:Sportspeople from Melbourne",
 "title": "Andrew Gaze"
}