{
 "id": "304909",
 "text": "Indre is a department in the centre of France in the Centre-Val de Loire region. It is named after the Indre river, the most important river in the department. Its prefecture is Châteauroux. ==History== The department is one of the 83 French departments made during the French revolution, on 4 March 1790. The department was created from part of the former province of Berry. The new department had six districts: Issoudun, Châteauroux, Argenton, Le Blanc, La Châtre and Marennes. The capital (now prefecture) was Châteauroux. In 1800, with the creation of the arrondissements in France, the six districts were changed into four arrondissements: Saintes, Châteauroux, Le Blanc, La Châtre and Issoudun. On 10 September 1926, the arrondissement of Issoudun was eliminated but in 1942 it was made again an arrondissement. ==Geography== Indre is part of the Centre-Val de Loire region. It has an area of . The highest point of the department is Terrior Randoin (), in the commune of Pouligny-Notre-Dame, and that is above sea level. The department is bordered by the 6 departments in 2 regions: * Centre-Val de Loire region ** Loir-et- Cher ** Cher ** Indre-et-Loire * Nouvelle-Aquitaine region ** Creuse ** Vienne ** Haute-Vienne The main rivers are: * Creuse, a tributary of the Vienne, is long. * Claise, long and a tributary of the Creuse. * Indre, that flows centrally through the department from south to north, through the major towns of La Châtre, Châteauroux and Loches. It is a tributary of the Loire, joining it at Chinon in the neighbouring department of Loir-et-Cher. === Climate === The Köppen climate classification type for the climate at Châteauroux is an \"Oceanic climate\" (also known as Marine West Coast Climate) and of the subtype Cfb. The average amount of precipitation for the year in Châteauroux is . The month with the most precipitation on average is May with of precipitation. The month with the least precipitation on average is February with an average of . The average temperature for the year in Châteauroux is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . ==Administration== The department is managed by the Departmental Council of the Indre in Châteauroux. Indre is part of the region of Centre-Val de Loire. ===Administrative divisions=== There are 4 arrondissements (districts), 13 cantons and 243 communes (municipalities) in Indre. INSEE code Arrondissement Capital Population (2014) Area (km²) Density (Inh./km²) Communes 361 Le Blanc Le Blanc 31,821 1,760.8 57 362 Châteauroux Châteauroux 126,428 2,524.3 86 363 La Châtre La Châtre 32,962 1,323.2 51 364 Issoudun Issoudun 34,964 1,182.3 49 The following is a list of the 13 cantons of the Indre department, following the French canton reorganisation which came into effect in March 2015: # Ardentes (3601) # Argenton-sur-Creuse (3602) # Le Blanc (3603) # Buzançais (3604) # Châteauroux-1 (3605) # Châteauroux-2 (3606) # Châteauroux-3 (3607) # La Châtre (3608) # Issoudun (3609) # Levroux (3610) # Neuvy-Saint-Sépulchre (3611) # Saint-Gaultier (3612) # Valençay (3613) ==Demographics== The inhabitants of Indre are known, in French, as Indriens (women: Indriennes). Indre has a population, in 2014, of 226,175, for a population density of inhabitants/km2. The arrondissement of Châteauroux, with 126,428 inhabitants, is by far the largest. Evolution of the population in Indre Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:300000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:50000 start:0 ScaleMinor = gridcolor:lightgrey increment:25000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 243178 bar:1975 from:0 till: 248523 bar:1982 from:0 till: 243191 bar:1990 from:0 till: 237510 bar:1999 from:0 till: 231139 bar:2006 from:0 till: 232959 bar:2014 from:0 till: 226175 PlotData= bar:1968 at: 243178 fontsize:S text: 243,178 shift:(-13,5) bar:1975 at: 248523 fontsize:S text: 248,523 shift:(-18,5) bar:1982 at: 243191 fontsize:S text: 243,191 shift:(-18,5) bar:1990 at: 237510 fontsize:S text: 237,510 shift:(-18,5) bar:1999 at: 231139 fontsize:S text: 231,139 shift:(-18,5) bar:2006 at: 232959 fontsize:S text: 232,959 shift:(-18,10) bar:2014 at: 226175 fontsize:S text: 226,175 shift:(-18,10) The main cities in the department are: City Population (2014) Arrondissement Châteauroux 44,479 Châteauroux Issoudun 12,270 Issoudun Déols 7,744 Châteauroux Le Blanc 6,602 Le Blanc Le Poinçonnet 5,880 Châteauroux Argenton-sur-Creuse 5,007 Châteauroux Buzançais 4,473 Châteauroux La Châtre 4,278 La Châtre Ardentes 3,886 Châteauroux Saint-Maur 3,522 Châteauroux ==Gallery== Châteauroux rue des Pavillons 3.jpg|Châteauroux Saintbenoitdusault1.JPG|Saint-Benoît-du-Sault Le Blanc chateau Naillac.JPG|Le Blanc Argenton-sur-Creuse bords de Creuse 08.jpg|Argenton-sur-Creuse ==References== ==Related pages== * Arrondissements of the Indre department * Communes of the Indre department ==Other websites== * Departmental Council website * Prefecture website * Indre Nature Category:1790 establishments in Europe",
 "title": "Indre (department)"
}