{
 "id": "305025",
 "text": "Karīm al-Ḥussayni Shah, Aga Khan IV KBE (13 December 1936 – 4 February 2025) was the 49th Imam of the Shia Ismaili Muslims from 1957 until his death in 2025. ==Nizari Ismaili Imamat== He held this position under the title of Aga Khan, starting on 11 July 1957, when, at the age of 20, he succeeded his grandfather, Sir Sultan Mahomed Shah Aga Khan. He was responsible for the interpretation of the faith for his followers and helped to improve the quality of their lives and communities. Unlike his grandfather, Aga Khan IV's higher education was in the United States at Harvard University. His children have also been educated in the U.S. Since he became imam, Aga Khan IV followed the political and economic changes which affected his followers. These events included the independence of African countries from colonial rule, the expulsion of Asians from Uganda, the independence of Central Asian countries such as Tajikistan from the former Soviet Union and the continuous turmoil in Afghanistan and Pakistan. Aga Khan IV was interested in the elimination of global poverty; the advancement of women; the promotion of Islamic culture, art, and architecture; and promoting pluralistic values in society. He was the founder and chairman of the Aga Khan Development Network, one of the largest private development networks in the world. This works for the environment, health, education, architecture, culture, microfinance, rural development, and disaster reduction. Goals include promotion of private-sector enterprise and the revitalisation of historic cities.New York Times interview Do Business and Islam Mix? Ask Him During his visit to India in 1983, the Aga Khan said, In February 2014, Aga Khan IV became the first faith leader to address the Joint Session of the Parliament of Canada. ==Personal life== The Aga Khan had been married twice, and had four children. His main residence was a vast walled compound and chateau, the Aiglemont estate near Chantilly, France. He had many awards. Especially notable were the Nishan-e-Pakistan, Pakistan's highest civil award (1983), and the Knight Grand Cross of the Order of Merit of the Italian Republic. The Aga Khan was the first Muslim to receive this honour (1977). Aga Khan IV died in Lisbon, Portugal on 4 February 2025, at the age of 88. == References == ==Other websites== * His Highness the Aga Khan * NanoWisdoms Archive – Dedicated to the Aga Khan's speeches and interviews (over 600 readings and 1,000 quotes) * His Highness the Aga Khan Spiritual Leader of Shia Ismailis * An Islamic Conscience: the Aga Khan and the Ismailis – Film of HH the Aga Khan IV * About His Highness the Karim Aga Khan * About Her Highness the Begum Aga Khan (PIF) Category:1936 births Category:2025 deaths Category:British businesspeople Category:British Muslims Category:Harvard University alumni Category:Quran reciters Category:Imams",
 "title": "Aga Khan IV"
}