{
 "id": "305010",
 "text": "The George Medal (GM) is the second highest civil award of the United Kingdom and Commonwealth.Although certain Commonwealth Realms have now instituted their own indigenous honours systems, replacing the GM and other Commonwealth awards so far as their citizens are concerned. It ranks below the George Cross. It is only awarded for non-combat acts of bravery. The GM was created on 24 September 1940 by King George VI.British Gallantry Medals, p138 At this time, during the height of The Blitz, there was a desire to reward acts of civilian courage. It was decided that the George Cross and the GM would recognise civilian bravery in the face of enemy action and brave deeds more widely. Announcing the new award, the King said: :\"In order that they should be worthily and promptly recognised, I have decided to create, at once, a new mark of honour for men and women in all walks of civilian life. I propose to give my name to this new distinction, which will consist of the George Cross, which will rank next to the Victoria Cross,The Victoria Cross is only awarded for bravery in combat. and the George Medal for wider distribution\". The Warrant for the GM was published in the London Gazette on 31 January 1941. That of the GC had been published on 24 January 1941. The medal is granted in recognition of \"acts of great bravery\".London Gazette, 31 January 1941 - Warrant, Fifth clause The GM was originally not issued posthumously, but the warrant was amended in 1977 to allow posthumous awards, several of which have been subsequently made.Warrant of 30 November 1977, published in the London Gazette on 5 December 1977 The medal is primarily a civilian award, but it may be awarded to military personnel for gallant conduct that is not in the face of the enemy.Which could not therefore be recognised by a military decoration, given that they typically require gallantry in the face of the enemy. As the Warrant states: :\"The Medal is intended primarily for civilians and award in Our military services is to be confined to actions for which purely military Honours are not normally granted\".London Gazette, 31 January 1941 - Warrant, Second clause Bars are awarded to the GM in recognition of the performance of further acts of bravery meriting the award. In undress uniform or on occasions when the medal ribbon alone is worn, a silver rosette is worn on the ribbon to indicate each bar.London Gazette, 31 January 1941 - Warrant, Seventh clause Recipients are entitled to the postnominal letters GM.London Gazette, 31 January 1941 - Warrant, Ninth clause The details of all awards to British and Commonwealth recipients are published in the London Gazette. == Related pages == * Victoria Cross * George Cross * Elizabeth Cross == References == Category:Orders, decorations, and medals of the United Kingdom",
 "title": "George Medal"
}