{
 "id": "305167",
 "text": "Thomas Wolsey (born between 1471 and 1476 at Ipswich, Suffolk; died 29 November 1530) was an English statesman and archbishop. He was made a cardinal in 1515. Of humble origin, Thomas Wolsey became the principal figure in affairs of state for many years during the reign of King Henry VIII of England before falling into disgrace. Cardinal Wolsey chiefly developed his talents in managing the foreign policy of the kingdom on behalf of Henry VIII. In spite of the many enemies who envied his ambition, he was able to acquire the confidence of the king until the latter decided to have his marriage to Catherine of Aragon annulled in order to marry Anne Boleyn. == Chronology == * Between 1471 and 1476: born at Ipswich. * 10 March 1498: ordained priest. * 1509: Dean of Lincoln; made royal almoner and member of the Council. * 1514: Took Thomas More into his service to look after his revenue. * 1515: Archbishop of York and Lord Chancellor of England. ** 10 September 1515: Pope Leo X created Wolsey a cardinal.Peter Gwyn, The King's Cardinal, p. 33 * 1516: Obtained from Leo X the title of cardinal-legate. He proceeded to take the possessions of thirty monasteries and put himself forward as a candidate to become Pope. * 1518: Bishop of Bath and Wells (while still Archbishop of York) * 1522: Resigned Bishopric of Bath and Wells * 1525: Founded Cardinal College at Oxford (afterwards Christ Church), one of the largest and richest colleges of the University of Oxford. * 1529: The varying attitudes of Wolsey, wishing to keep the Pope happy, had the effect of destroying his credit with the king. In the autumn, impelled by Anne Boleyn, Henry VIII brought charges against Thomas Wolsey. He was dismissed from his office of Lord Chancellor and deprived of his properties, including the palace of Whitehall, where Henry decided go and live, instead of Westminster Palace. * 29 November 1530: He died of exhaustion at Leicester while being transferred to the Tower of London. ==References== == Other websites == * Cardinals of the Holy Roman Church , Wolsey, Thomas * Catholic-Hierarchy, Thomas Cardinal Wolsey Category:1470s births Category:1530 deaths Category:Alumni of the University of Oxford Category:British cardinals Category:Lord Chancellors Category:People from Ipswich Category:English Roman Catholic archbishops Category:Archbishops of York",
 "title": "Thomas Wolsey"
}