{
 "id": "305128",
 "text": "This is a list of popular wrong ideas and beliefs about notable topics. Each has been discussed in published literature. ==History== ===Ancient to early modern history=== * There is no evidence that Vikings wore horns on their helmets. * King Canute did not command the tide to reverse in a fit of delusional arrogance.\"Is King Canute misunderstood?\" BBC news story. * Christopher Columbus's efforts to obtain support for his voyages were not hampered by a European belief in a flat Earth. Sailors and navigators of the time knew that the Earth was like a sphere, but (correctly) disagreed with Columbus's estimate of the distance to India, which was approximately one-sixth of the actual distance. The intellectual class had known that the Earth was spherical since the works of the Greek philosophers Plato and Aristotle. Eratosthenes made a very good estimate of the Earth's diameter around 240 BC. * There is a legend that Marco Polo imported pasta from ChinaNational Pasta Association article FAQs section \"Who \"invented\" pasta?\"; \"The story that it was Marco Polo who imported noodles to Italy and thereby gave birth to the country's pasta culture is the most pervasive myth in the history of Italian food.\" (Dickie 2008, p. 48). which originated with the Macaroni Journal, published by an association of food industries.S. Serventi, F. Sabban La pasta. Storia e cultura di un cibo universale, VII. Economica Laterza 2004 Durum wheat, and thus pasta as it is known today, was introduced by Arabs from Libya, during their conquest of Sicily in the late 7th century. * Contrary to the popular image of the Pilgrim Fathers, the early settlers of the Plymouth Colony in present-day Plymouth, Massachusetts did not dress in black, wear buckles, or wear black steeple hats. According to historian James W. Baker, this image was formed in the 19th century when buckles were a kind of emblem of quaintness. * Marie Antoinette did not actually use the words \"let them eat cake\" when she heard that the French peasantry was starving because they did not have bread to eat. The phrase was first published in Rousseau's Confessions when Marie was only 10 years old. Marie Antoinette was unpopular, and many attributed the phrase \"let them eat cake\" to her, in keeping with her reputation as being hard-hearted and disconnected from her subjects. * George Washington did not have wooden teeth. According to a study of Washington's four known dentures by a forensic anthropologist, the dentures were made of gold, hippopotamus ivory, lead, and human and animal teeth (including horse and donkey teeth). * The United States Declaration of Independence was not signed on July 4, 1776. The final language of the document was approved by the Second Continental Congress on that date, it was printed and distributed on July 4 and 5, but the actual signing occurred on August 2, 1776. * The United States Constitution was written on parchment, not hemp paper. ===Modern history=== * Napoleon I (Napoleon Bonaparte) (pictured) was not as short as people thought. After his death in 1821, his height was found to be 5 feet 2 inches in French feet. This is the same as 5 feet 6.5 inches in modern English feet, or 1.686 metres. * According to Time magazine, there is a common misconception among Americans that Abraham Lincoln freed all the millions of American slaves with the Emancipation Proclamation of January 1863, but the Confederate constitution had prohibited other nations from freeing slaves in Rebel states. The Thirteenth Amendment, ratified on December 6, 1865, officially abolished (except as a punishment for crime) in all of the United States, under President Andrew Johnson, 8 months after Lincoln had died. * Italian dictator Benito Mussolini did not \"make the trains run on time\". Much of the repair work had been performed before Mussolini and the Fascists came to power in 1922. Accounts from the era also suggest that the Italian railways' legendary adherence to timetables was more myth than reality. * During the German Invasion of Poland in 1939, there is no evidence of Polish Cavalry mounting a brave but futile charge against German tanks using lances and sabres. Polish cavalry still carried the sabre, but were trained to fight as highly mobile, dismounted infantry and issued with light anti-tank weapons. * During World War II, King Christian X of Denmark did not thwart Nazi attempts to identify Jews by wearing a yellow star himself. Jews in Denmark were never forced to wear the Star of David. The Danes did help most Jews flee the country before the end of the war. * Albert Einstein did not fail mathematics in school. When shown a column claiming this fact, Einstein said \"I never failed in mathematics... before I was fifteen I had mastered differential and integral calculus\". * John F. Kennedy's words \"\" are standard German for \"I am a Berliner\". An urban legend has it that due to his use of the indefinite article , is translated as jelly doughnut, and that the population of Berlin was amused by the supposed mistake. The word is not commonly used in Berlin to refer to the ; they are usually called . * Eva Perón never uttered the quote \"I will return and I will be millions\". The quote was first formulated by the indigenous leader Túpac Katari in 1781 shortly before being executed. The misattribution to Eva Perón originates from a poem by José María Castiñeira de Dios written in Eva Perón's first-person narrative nearly ten years after her death. There is a similar quote in the Spartacus movie.\"Volveré y seré millones\", la frase que erróneamente la historia atribuyó a Evita ==Legislation and crime== * A common misconception is that you must wait at least 24 hours before filing a missing person's report. This is rarely the case. In many cases if there is evidence of violence or of an unusual absence, law enforcement agencies sat to begin an investigation soon after they are missing. * Entrapment law in the United States does not require police officers to identify themselves as police in the case of a sting or other undercover work. The law is specifically about leading people to commit crimes they would not have considered in the normal course of events.Sloane (1990) 49 A Crim R 270. See also agent provocateur ==Food and cooking== * Searing meat does not \"seal in\" moisture, and in fact may actually cause meat to lose moisture. Generally, the value in searing meat is that it creates a brown crust with a rich flavor. Page 161, \"The Searing Question\". * Some cooks believe that food items cooked with wine or liquor will be non-alcoholic, because alcohol's low boiling point causes it to evaporate quickly when heated. However, a study found that some of the alcohol remains: 25% after 1 hour of baking or simmering, and 10% after 2 hours. * Sushi does not mean \"raw fish\", and not all sushi includes raw fish. The name sushi refers to the vinegared rice used in it. Sushi is made with sumeshi, rice which has been gently folded with rice vinegar, salt, and sugar dressing. The rice is traditionally topped by raw fish, cooked seafood, fish roe, egg, and/or vegetables such as cucumber, daikon radish, and avocado. * Microwave ovens do not cook food from the inside out. Microwave radiation penetrates food and causes direct heating only a short distance from the surface. This distance is called the skin depth. As an example, lean muscle tissue (meat) has a skin depth of only about at microwave oven frequencies. Page 43, \"Figure 1.8. ==Words and phrases== * The word 'fuck' did not come from Christianized Anglo-Saxon England and it is not any kind of acronym. The earliest recorded use of 'fuck' in English comes from about 1475, in the poem Flen flyys, where it is spelled fuccant (conjugated as if a Latin verb, meaning 'they fuck'). It is of Proto-Germanic origin, and is related to Dutch fokken and Norwegian fukka. Modern English was not spoken until the 16th century, and words such as 'fornication' did not exist in any form in English until the influence of Anglo-Norman in the late 12th century. * The word 'crap' did not originate as a back-formation of British plumber Thomas Crapper's surname. Nor does his name originate from the word 'crap', although the surname may have helped popularize the word. The surname 'Crapper' is a variant of 'Cropper', which originally referred to someone who harvested crops. The word 'crap' ultimately comes from Medieval Latin crappa, meaning 'chaff'. * The word 'gringo' is a pejorative term for an American. It did not originate during the Mexican-American War (1846–1848) or in the American Old West (~1865–1899); Nor did it originate during any of these times as a corruption of \"Green go home!\", falsely said to have been shouted at green-clad American troops. The word originally simply meant \"foreigner\", and is probably a corruption of Spanish griego, \"Greek\". * The phrase \"sleep tight\" did not originally refer to a supposed medieval or early modern practice of tightening feather mattresses with ropes. The word \"tight\" here simply means \"soundly\". * People during the Old and Middle English speaking periods never pronounced \"the\" as \"ye\". The idea that they did comes from confusion with the thorn, which in old print (þe or ye) often looked like a y. * The claim that a reporter, on assignment to Cuba, telegraphed William Randolph Hearst \"...There will be no war. I wish to return\" and Hearst responded, \"Please remain. You furnish the pictures, and I'll furnish the war.\" Although this claim is included in a book, there is no evidence that the telegraph exchange ever happened, and substantial evidence that it did not.W. Joseph Campbell, Yellow Journalism: puncturing the myths, defining the legacies (2003) p. 72 * The Dutch confections 'pepernoot' and 'kruidnoot' are often confused. Both are brown cookie-like desserts but kruidnoten are hard while pepernoten are soft and chewy. ==Science== ===Astronomy=== * It is commonly claimed that the Great Wall of China is the only human-made object visible from the Moon. This is false. None of the Apollo astronauts reported seeing any specific human-made object from the Moon, and even earth-orbiting astronauts can barely see it. City lights, however, are easily visible on the night side of Earth from orbit. Shuttle astronaut Jay Apt said \"...the Great Wall is almost invisible from only 180 miles up\". * Black holes, contrary to their common image, do not necessarily suck up all the matter around them. Were the Sun to be replaced by a black hole of the same mass, then the orbits of all the planets surrounding it would be unaffected. This is because \"if you're outside the event horizon, you can just keep going around in circles around [a black hole], in exactly the same way that you can be in orbit around any other kind of mass\". * Seasons are not caused by the Earth being closer to the Sun in the summer than in the winter. In fact, the Earth is actually farther from the Sun when it is summer in the Northern Hemisphere. Seasons are the result of the Earth being tilted on its axis by 23.4 degrees. As the Earth orbits the Sun, different parts of the world receive different amounts of direct sunlight. When an area of the Earth's surface is oriented perpendicular to the incoming sunlight, it will receive more radiation than it will when it is oriented at an angle to the incoming sunlight. In July, the Northern Hemisphere is tilted towards the Sun giving longer days and more direct sunlight; in January, it is tilted away. The seasons are reversed in the Southern Hemisphere, which is tilted towards the Sun in January and away from the Sun in July. * Meteorites are not necessarily hot when they reach the Earth. In fact, many meteorites are found with frost on them. A meteorite has been in the near-absolute zero temperature of space for billions of years, so the interior of it is very cold. A meteor's great speed is enough to melt its outside layer, but any molten metal will be quickly blown off, and the interior of the meteor does not have time to heat up because rocks are poor conductors of heat. Also, atmospheric drag can slow small meteors to terminal velocity by the time they hit the ground, giving them time to cool down.Top 10 Common Misconceptions ===Biology=== * DNA is not made of protein. DNA is instead a nucleic acid. However, DNA and protein work closely together. DNA is always accompanied by proteins in the chromatin of plants and animals. See protein biosynthesis for DNA's involvement in assembling protein. See also DNA replication and Ribonuclease. * Lemmings do not engage in mass suicidal dives off cliffs when migrating. * Bats are not blind. All bat species have eyes and can see. Further, not all bats can echolocate and these bats have excellent night vision (see megabat vs. microbat). * It is a common myth that an earthworm becomes two worms when cut in half. However, only a limited number of earthworm species are capable of anterior regeneration. When most earthworms are cut in half, only the front half of the worm (where the mouth is located) can survive, while the other half dies. Also, species of the planaria family of flatworms actually do become two new planaria when bisected or split down the middle. * According to urban myth, the daddy longlegs spider (Pholcus phalangioides) is the most venomous spider in the world, but the shape of their mandibles leaves them unable to bite humans, rendering them harmless to our species. In reality, they can indeed pierce human skin, though the tiny amount of venom they carry causes only a mild burning sensation for a few seconds.Mythbusters Daddy-longlegs (Season 1, Episode 16) In addition, there is also confusion regarding the use of the name daddy longlegs, because harvestmen (order Opiliones, which are not spiders) and crane flies (which are insects) are also known as daddy longlegs, and share (also incorrectly) the myth of being venomous. * Poinsettias are not highly toxic. They are just mildly irritating to the skin or stomach, and may sometimes cause diarrhea and vomiting if eaten. Also, Poinsettias are not highly toxic to cats. According to the ASPCA, poinsettias may cause light to mid-range gastrointestinal discomfort in felines, with diarrhea and vomiting as the most severe consequences of ingestion. * The flight mechanism and aerodynamics of the bumblebee (as well as other insects) are actually quite well understood, in spite of the legend that calculations show that they should not be able to fly. In the 1930s a German scientist, using flawed techniques, postulated that bumblebees theoretically should not be able to fly, although he later retracted the suggestion. * Sharks can actually suffer from cancer. The myth that sharks do not get cancer was spread by the 1992 book Sharks don't get cancer by I. William Lane. Extracts of shark cartilage was sold as cancer prevention treatments. Reports of carcinomas in sharks exist, and current data do not allow any speculation about the incidence of tumors in sharks. * It is not harmful to baby birds to pick them up and return them to their nests, despite the common belief that doing so will cause the mother to reject them. * Bulls are not enraged by the color red, used in capes by professional matadors. Cattle are dichromats, so red does not stand out as a bright color. It is not the color of the cape that angers the bull, but rather the movement of the fabric that irritates the bull and incites it to charge. * Contrary to popular belief, dogs do not sweat by salivating. It is not true that dogs do not have sweat glands or have sweat glands only on their tongues. They do sweat, mainly through the footpads. However, dogs do primarily regulate their body temperature through panting. ====Evolution==== * The word theory in the theory of evolution does not imply scientific doubt about its validity. The concepts of theory and hypothesis have specific meanings in science. While theory in colloquial usage may denote a hunch or conjecture, a scientific theory is a set of principles that explains observable phenomena in natural terms. \"Scientific fact and theory are not categorically separable\", and evolution is a theory in the same way as gravitation, or plate tectonics are theories. * Humans did not evolve from chimpanzees or any other modern-day primates. Humans and chimpanzees share a common ancestor that lived about seven million years ago. Humans are in the Hominidae (hominid and great ape) family, including chimpanzees, gorillas and orangutans. The common ancestor of humans and chimpanzees, which lived between 6 and 8 million years ago, evolved into two lineages. One line eventually became modern humans, and the other became the two living chimpanzee species. * Evolution is not a progression from inferior to superior organisms, because the words inferior and superior are undefined value judgements. Evolution also does not necessarily result in the evolution of complexity, though overall it has done so. A population can evolve to become simpler, having a smaller genome. * According to the California Academy of Sciences, only 59% of U.S. adults know humans and dinosaurs did not coexist. However, the last of the non-avian dinosaurs died 65.5 million years ago, after the Cretaceous–Tertiary extinction event, whereas the earliest Homo Genus (humans) evolved between 2.3 and 2.4 million years ago. * Evolution does not \"plan\" to improve an organism's fitness to survive. Misconception: \"Natural selection involves organisms 'trying' to adapt.\" Misconception: \"Natural selection gives organisms what they 'need'\". For example, an incorrect way to describe giraffe evolution is to say that giraffe necks grew longer over time because they needed to reach tall trees. Evolution does not see a need and respond to it. A mutation resulting in longer necks would be more likely to benefit an animal in an area with tall trees than an area with short trees, and thus enhance the chance of the animal surviving to pass on its longer-necked genes. Tall trees could not cause the mutation nor would they cause a higher percentage of animals to be born with longer necks. In the giraffe example, the evolution of a long neck may also have been driven by sexual selection. The idea would be that long necks evolved as a secondary sexual characteristic, giving males an advantage in \"necking\" contests over females. It is common for an adaptation to have more than one function. * Mammals did not evolve from reptiles, just as humans have not evolved from chimpanzees (above). Soon after the first vertebrate land-dwellers appeared, they split into two branches.Coven R 2000. History of life. Blackwell, Oxford. p 154 The line leading to mammals (Synapsids) diverged from the line leading to reptiles (Sauropsids) about 320 million years ago, in the mid Carboniferous period. Only much later did the modern reptilian groups (lepidosaurs, turtles and crocodiles) emerge. Mammals are the only survivors of the synapsid line.Romer A.S. & T.S. Parsons. 1977. The Vertebrate Body. 5th ed. Saunders, Philadelphia. (6th ed. 1985) The confusion over the origin of mammals comes from conflicting definitions of \"Reptile\". Under Linnaean taxonomy reptiles are all amniotes except mammals and birds, thus including the synapsids as well as the first basal amniotes. With the rise of classification based on phylogeny, the Sauropsida excludes basal amniotes and the synapsid line. The synapsids are popularly known as \"mammal-like reptiles\". An example is Dimetrodon, which is often thought of as a dinosaur, but is in fact neither a dinosaur nor closely related to modern reptiles.Kenneth D. Angielczyk, Dimetrodon is not a dinosaur: using tree thinking to understand the ancient relatives of mammals and their evolution Evolution: Education and Outreach 2, #2, 257–271, DOI: 10.1007/s12052-009-0117-4 ===Chemistry=== * Glass is not a high-viscosity liquid at room temperature: it is an amorphous solid, although it does have some chemical properties normally associated with liquids. Panes of stained glass windows often have thicker glass at the bottom than at the top, and this has been cited as an example of the slow flow of glass over centuries. However, this unevenness is due to the window manufacturing processes used in earlier eras, which produced glass panes that were unevenly thick at the time of their installation. Normally the thick end of glass would be installed at the bottom of the frame, but it is also common to find old windows where the thicker end has been installed to the sides or the top. In fact, the lead frames of the windows are less viscous than the panes, and if glass was indeed a slow moving liquid, the panes would warp at a higher degree. ===Human body and health=== ====The senses==== * Humans have more than five senses. Although definitions vary, the actual number ranges from 9 to more than 20. In addition to sight, smell, taste, touch, and hearing, which were the senses identified by Aristotle, humans can sense balance and acceleration (equilibrioception), pain (nociception), body and limb position (proprioception or kinesthetic sense), and relative temperature (thermoception). Other senses sometimes identified are the sense of time, itching, pressure, hunger, thirst, fullness of the stomach, need to urinate, need to defecate, and blood carbon dioxide levels. ====Skin and hair==== * Windburn is not caused by wind (on a cloudy day). It is actually a sunburn. * Shaving does not cause terminal hair to grow back thicker or coarser or darker. This belief is based on the fact that hair which has never been cut has a tapered end, whereas after cutting there is no taper. Thus, the cut hair appears to be thicker, and feels coarser due to the sharper, unworn edges. The fact that shorter hairs are \"harder\" (less flexible) than longer hairs also contributes to this effect.Does shaving make hair grow back thicker? – MayoClinic.comShaving tips for teen girlsCosmo Beauty Q&A;: Facial Hair Post-Shave – Cosmopolitan * Hair and fingernails do not continue to grow after a person dies. Rather, the skin dries and shrinks away from the bases of hairs and nails, giving the appearance of growth. * Hair care products cannot actually \"repair\" split ends and damaged hair. They can prevent damage from occurring in the first place, and they can also smooth down the cuticle in a glue-like fashion so that it appears repaired, and generally make hair appear in better condition. * The gene for red hair is not going extinct. In August 2007, many news organizations reported that redheads would become extinct, possibly as early as 2060, due to the gene for red hair being recessive. Although redheads may become more rare, they will not die out unless everyone who carries the gene dies or fails to reproduce. This myth has been around since at least 1865, and often resurfaces in American newspapers. The proportion of genes do not change because an allele is recessive. That has no effect whatsoever on its frequency. See Hardy–Weinberg law ====Nutrition, food, and drink==== * Eight glasses of water a day are not necessary to maintain health. Consuming things that contain water (e.g. juice, tea, milk, fruits or vegetables) also keeps a person hydrated. * Drinking normal levels of caffeinated beverages does not cause a net dehydration effect. The mild diuretic effect of caffeine is offset by the large amount of water in the caffeinated beverage. * Sugar does not cause hyperactivity in children. Double-blind trials have shown no difference in behavior between children given sugar-full or sugar-free diets, even in studies specifically looking at children with Attention-deficit hyperactivity disorder or those considered sensitive to sugar. * Alcohol does not make one warmer. The reason that alcoholic drinks create the sensation of warmth is that they cause blood vessels to dilate and stimulate nerve endings near the surface of the skin with an influx of warm blood. This can actually result in making the core body temperature lower, as it allows for easier heat exchange with a cold external environment. * Alcohol does not necessarily kill brain cells. Alcohol can however lead indirectly to the death of cells in the brain in two ways: (1) In chronic, heavy alcohol users whose brains have adapted to the effects of alcohol, abrupt cessation following heavy use can cause excitotoxicity leading to cellular death in multiple areas of the brain. (2) In alcoholics who get most of their daily calories from alcohol, a deficiency of thiamine can produce Korsakoff's syndrome, which is associated with serious brain damage. * A vegetarian or vegan diet can provide enough protein. In fact, typical protein intakes of ovo-lacto vegetarians,Who eat milk and egg products and of vegans, meet and exceed requirements. However, a strict vegan diet does require extra Vitamin B12 for good health. ====Human sexuality==== * A popular myth regarding human sexuality is that men think about sex every seven seconds. In reality, this has not been measured, and as far as researchers can tell, this statistic greatly exaggerates the frequency of sexual thoughts. * Another popular myth is that having sex in the days leading up to a sporting event or contest is detrimental to performance. Many studies have shown that there is no physiological basis to this myth. Additionally, it has been demonstrated that sex during the 24 hours prior to sports activity can elevate the levels of testosterone in males, which potentially could enhance their performance. ====The brain==== * Mental abilities are not absolutely separated into the left and right cerebral hemispheres of the brain.Westen | display-authors = etal 2006 \"Psychology: Australian and New Zealand edition\" John Wiley p.107 Some mental functions, such as speech and language, tend to activate one hemisphere of the brain more than the other. If one hemisphere is damaged at a very early age, however, these functions can often be recovered in part or even in full by the other hemisphere (see neuroplasticity). Other abilities such as motor control, memory, and general reasoning are served equally by the two hemispheres. * Until very recently medical experts believed that humans were born with all of the brain cells they would ever have. However, we now know that new neurons can be created in the postnatal brain. Researchers have observed adult neurogenesis in birds, Old World Primates, and humans. The newborn neurons migrate to the olfactory bulb and the dentate gyrus. They are believed to integrate into existing neural circuits. However, the function and physiological significance of adult-born neurons remains unclear. Some studies have suggested that post-natal neurogenesis also occurs in the neocortex, an idea that is disputed. * People do not use only ten percent of their brains. While it is true that a small minority of neurons in the brain are actively firing at any one time, the inactive neurons are important too. This myth has been commonplace in American culture at least as far back as the start of the 20th century, and was attributed to William James, who apparently used the expression metaphorically. Some findings of brain science (such as the high ratio of glial cells to neurons) have been mistakenly read as providing support for the myth. ====Disease==== * Drinking milk or consuming other dairy products does not increase mucus production. As a result, they do not need to be avoided by those suffering from flu or cold congestion. * Warts on human skin are caused by viruses that are unique to humans (human papillomavirus). Humans cannot catch warts from toads or other animals; the bumps on a toad are not warts. * Vaccines do not cause autism. Although fraudulent research by Andrew Wakefield claimed a connection, repeated attempts to reproduce the results ended in failure, and the research was ultimately shown to have been manipulated. * Cracking ones knuckles does not cause osteoarthritis. Neither does simply exercising, as long as one does not get hurt. * Eating nuts, popcorn, or seeds does not increase the risk of diverticulitis. These foods may actually have a protective effect. ====Miscellaneous==== * Waking sleepwalkers does not harm them. While it is true that a person may be confused or disoriented for a short time after awakening, this does not cause them further harm. In contrast, sleepwalkers may injure themselves if they trip over objects or lose their balance while sleepwalking. Such injuries are common among sleepwalkers. * Although it is commonly believed that most body heat is lost through a person's head, heat loss through the head is not more significant than other parts of the body when naked. This may be a generalization of situations in which it is true, such as when the head is the only uncovered part of the body. For example, it has been shown that hats effectively prevent hypothermia in infants. * Eating less than an hour before swimming does not increase the risk of experiencing muscle cramps or drowning. One study shows a correlation between alcohol consumption and drowning, but there is no evidence cited regarding stomach cramps or the consumption of food.; * Drowning is often thought to be a violent struggle, where the victim waves and calls for help. In truth, drowning is often inconspicuous to onlookers. Raising the arms and vocalising are even usually impossible due to the instinctive drowning response. Waving and yelling (known as \"aquatic distress\") is a sign of trouble, but not a dependable one: most victims demonstrating the instinctive drowning response do not show prior evidence of distress. * It is a common misconception that hydrogen peroxide is a disinfectant or antiseptic for treating wounds. While it is an effective cleaning agent, hydrogen peroxide is not an effective agent for reducing bacterial infection of wounds. Further, hydrogen peroxide applied to wounds can impede healing and lead to scarring because it destroys newly formed skin cells. ===Mathematics=== * Contrary to a widespread perception, the real number 0.999...—where the decimal point is followed by an infinite sequence of nines—is exactly equal to 1. They are two different ways of writing the same real number. * When a sequence of independent trials of a random process is observed a long run may occur. For example, when a roulette ball ended up on black 26 times in a row, and not even once on red,), the other outcome is often believed to be more likely for the next trial: it is thought to be \"due\". This misconception is known as the gambler's fallacy; in reality, by the definition of statistical independence, that outcome is just as likely or unlikely on the next trial as always—a property sometimes informally described by the phrase, \"the system has no memory\". * The correct answer to the Monty Hall Problem is that the contestant should indeed switch doors. The original problem is as follows: on a game show, there are three closed doors, one hiding a car and each of the other two doors concealing a goat. The contestant, wishing to win the car, selects a door. The door remains closed while the host, knowing where the car is hidden, proceeds to reveal a goat behind one of the remaining doors, and then offers the contestant a chance to switch his or her initial choice of door to the other closed door. Should the contestant switch? The correct answer is that the contestant should switch, as it doubles the chances of winning the car.\"The Monty Hall problem (or three door problem) is one of the most famous examples of a 'cognitive illusion'.\" Schuyler W. Huck, Statistical misconceptions. Psychology Press, Taylor & Francis group, 2009, page 100. hereMassimo Piatelli-Palmarini \"Probability blindness: Neither rational nor capricious\", Bostonia, March/April 1991, 28–35: \"No other statistical puzzle comes so close to fooling all of the people all of the time\". (As quoted in Rosenhouse, Jason: The Monty Hall Problem. Oxford University Press 2009, , p. 31.) ===Physics=== * The Coriolis effect does not determine the direction that water rotates in a bathtub drain or a flushing toilet. The Coriolis effect caused by the Earth's daily rotation is too small to affect the direction of water in a typical bathtub drain. The effect becomes significant and noticeable only at large scales, such as in weather systems or oceanic currents. Other forces dominate the dynamics of water in drains. In addition, most toilets in the United States inject water into the bowl at an angle, causing a spin too fast to be significantly affected by the Coriolis effect. * Gyroscopic forces are not needed for a rider to balance a bicycle. Although gyroscopic forces are a factor, the stability of a bicycle is determined primarily by inertia, steering geometry, and the rider's ability to counteract tilting by steering. * It is not true that air takes the same time to travel above and below an aircraft's wing. (Java applet). This misconception is widespread among textbooks and non-technical reference books, and even appears in pilot training materials. In fact the air moving over the top of an airfoil generating lift is always moving much faster than the equal transit theory would imply, as described in the incorrect and correct explanations of lift force. * The idea that lightning never strikes the same place twice is one of the oldest and most well-known superstitions about lightning. There is no reason that lightning would not be able to strike the same place twice; if there is a thunderstorm in a given area, then objects and places which are more prominent or conductive (and therefore minimize distance) are more likely to be struck. For instance, lightning strikes the Empire State Building in New York City about 100 times per year. * A penny dropped from the Empire State Building will not kill a person or crack the sidewalk. The terminal velocity of a falling penny is about 30–50 miles per hour, and the penny will not exceed that speed regardless of the height from which it is dropped. At that speed, its energy is not enough to penetrate a human skull or crack concrete, as demonstrated on an episode of Mythbusters. * It is a common misconception that the color of water in large bodies, such as the oceans, is blue due to the reflections from the sky on its surface. Reflection of light off the surface of water only contributes significantly when the water surface is extremely still, i.e., mirror-like, and the angle of incidence is high, as water's reflectivity rapidly approaches near total reflection under these circumstances, as governed by the Fresnel equations. While relatively small quantities of water are observed by humans to be colorless, pure water has a slight blue color that becomes a deeper blue as the thickness of the observed sample increases. The blue tint of water is an intrinsic property and is caused by selective absorption and scattering of white light. Impurities dissolved or suspended in water may give water different colored appearances. ===Psychology=== * Photographic or eidetic memory refers to the ability to remember images with extremely high precision—so high as to mimic a camera. However, it is highly unlikely that photographic memory exists, as to date there is no hard scientific evidence that anyone has ever had it. Many people have claimed to have a photographic memory, but those people have been shown to have good memories as a result of mnemonic devices rather than a natural capacity for detailed memory encoding. There are rare cases of individuals with exceptional memory, but none of them has a memory that mimics a camera. * Schizophrenia is not the same thing as Dissociative identity disorder, namely split or multiple personalities. Etymologically, the term \"schizophrenia\" comes from the Greek roots skhizein (σχίζειν, \"to split\") and phrēn, phren- (φρήν, φρεν-; \"mind\") and is a word proposed by the Swiss psychiatrist Eugen Bleuler. It may have given rise to this common misconception. ==Religion== ===Hebrew Bible=== * The forbidden fruit mentioned in the Book of Genesis is commonly assumed to be an apple, and is widely depicted as such in Western art, although the Bible does not identify what type of fruit it is. The original Hebrew texts mention only tree and fruit. Early Latin translations use the word mali, which can be taken to mean both \"evil\" and \"apple\". German and French artists commonly depict the fruit as an apple from the 12th century onwards, and John Milton's Areopagitica from 1644 explicitly mentions the fruit as an apple. Jewish scholars suggested that the fruit could have been a grape, a fig, wheat, or etrog.Babylonian Talmud, Berakhot, 40aGenesis Rabba 15 7The Straight Dope: Was the forbidden fruit in the Garden of Eden an apple? Likewise, the Quran speaks only of a forbidden \"tree\" and does not identify the fruit. * Nowhere in the Old Testament or the New Testament is Satan described as dwelling in or ruling over hell. * The Bible does not teach that humans can or will become angels after death. This myth has been proliferated by movies such as It's a Wonderful Life (1946) and Unlikely Angel (1996). ===Buddhism=== * The historical Buddha was not obese. The \"chubby Buddha\" or \"laughing Buddha\" is a tenth century Chinese folk hero by the name of Budai. In Chinese Buddhist culture, Budai came to be revered as an incarnation of Maitreya, the Bodhisattva who will become a Buddha to restore Buddhism after the teachings of the historical Buddha, Siddhārtha Gautama, have died. * The Buddha is not a god. In early Buddhism, Siddhārtha Gautama possessed no salvific properties and strongly encouraged \"self-reliance, self discipline and individual striving.\" However, in later developments of Mahāyāna Buddhism, notably in the Pure Land (Jìngtǔ) school of Chinese Buddhism, the Amitābha Buddha was thought to be a savior. Through faith in the Amitābha Buddha, one could be reborn in the western Pure Land. Although in Pure Land Buddhism the Buddha is considered a savior, he is still not considered a god in the common understanding of the term. ===Christianity=== * There is no evidence that Jesus was born on December 25. The Bible never claims a date of December 25, but may imply a date closer to September. * Nowhere in the Bible does it say exactly three magi came to visit the baby Jesus, nor that they were kings, rode on camels, or that their names were Casper, Melchior and Balthazar. Three magi are supposed because three gifts are described, and artistic depictions almost always show three magi. Also, the wise men in the actual biblical narrative did not visit on the day Jesus was born, but saw Jesus as a child, in a house as many as two years afterwards (). * The Immaculate Conception is not synonymous with the virgin birth of Jesus, nor is it a supposed belief in the virgin birth of Mary, his mother. Rather, the Immaculate Conception is the Roman Catholic belief that Mary was not subject to original sin from the first moment of her existence, when she was conceived. The confusion stems from a misunderstanding of the term \"immaculate,\" which means \"without stain\" (i.e. sinless). The concept of the virgin birth, on the other hand, is the belief that Mary miraculously conceived Jesus while remaining a virgin.The correct formulation is \"that Mary miraculously conceived Jesus while remaining a virgin\" as stated in the English Wikipedia article on the virgin birth of Jesus. * The doctrine of the perpetual virginity of Mary is not supported by canonical scripture, first appearing c.145 AD in the Gospel of James written several decades after the canonical ones. The Gospel of Matthew (1:24) implies that Mary and Joseph did indeed consummate a marriage after Jesus's birth, both Matthew (13:55) and the Gospel of Mark (6:3) indicate that Jesus had among his family four brothers (Joses, James, Jude and Simon) and an unspecified number of sisters. The Gospel of John makes reference to an unidentified number of Jesus's \"brothers\" associated with Mary and separate from his disciples. Nevertheless, the doctrine was held as truth by virtually all Christian authorities until the twentieth century, and remains a central tenet of the Roman Catholic Church. * Roman Catholics do not believe the pope is sinless. Catholic dogma does state that a teaching based on divine revelation stated by the pope is free from error. This does not mean that the pope or everything he says is free from error, even when speaking in his official capacity. ===Islam=== * A fatwā is a non-binding legal opinion issued by an Islamic scholar under Islamic law. The popular misconception that the word means a death sentence probably stems from the fatwā issued by Ayatollah Ruhollah Khomeini of Iran in 1989 regarding the author Salman Rushdie, whom he stated had earned a death sentence for blasphemy. This event led to fatwās gaining widespread media attention in the West. * The word \"jihad\" does not always mean \"holy war\"; literally, the word in Arabic means \"struggle\". While there is such a thing as \"jihad bil saif\", or jihad \"by the sword\", many modern Islamic scholars usually say that it implies an effort or struggle of a spiritual kind. Scholar Louay Safi asserts that \"misconceptions and misunderstandings regarding the nature of war and peace in Islam are widespread in both the Muslim societies and the West\", as much following 9/11 as before. ==Technology== ===Inventions=== * George Washington Carver did not invent peanut butter, though he reputedly discovered three hundred uses for peanuts and hundreds more for soybeans, pecans, and sweet potatoes.History of Peanut Butter Peanut-butter.org.A True Renaissance Man. American Scientist. * Thomas Crapper did not invent the flush toilet; it was invented by Sir John Harrington in 1596. Crapper, however, did much to increase its popularity and came up with some related inventions, such as the ballcock mechanism used to fill toilet tanks. He was noted for the quality of his products and received several Royal Warrants. Furthermore, his surname was not the origin of the word \"crap\" (see under Words and phrases above). * Thomas Edison did not invent the light bulb. He did, however, develop the first practical light bulb in 1880 (employing a carbonized bamboo filament), shortly before Joseph Swan, who invented an even more efficient bulb in 1881 (which used a cellulose filament). * Henry Ford did not invent either the automobile or the assembly line. He did help to develop the assembly line substantially, sometimes through his own engineering but more often through sponsoring the work of his employees. Karl Benz is credited with the invention of the first modern automobile, and the assembly line was invented before, several times.see Terracotta Army and Venetian Arsenal * Guglielmo Marconi did not invent radio, but only modernized it for public broadcasting and communication. No single person was responsible for the invention of radio. * James Watt did not invent the steam engine, The invention of the steam engine was a process of development and redevelopment. Watt developed the first commercially successful steam engine by greatly improving Newcomen's machine. ===Transportation=== * Toilet waste is never intentionally dumped overboard from an aircraft. All waste is collected in tanks which are emptied on the ground by special toilet waste vehicles. A vacuum is used to allow the toilet to be flushed with less water and because plumbing cannot rely on gravity alone in an aircraft in motion. The infamous blue ice is caused by accidental leakages from the waste tank. Passenger trains, on the other hand, have historically flushed onto the tracks; however, modern trains usually have retention tanks on board the train. ==Related pages== * MythBusters * Pseudoscience ==References== ==Further reading== * * * * * * * * * Category:Society Category:Lists Category:Knowledge",
 "title": "List of common misconceptions"
}