{
 "id": "305267",
 "text": "Cynthia DeFelice (born in 1951 in Philadelphia, Pennsylvania) is an American children's book writer. She has written 16 novels, and 12 picture books for young readers. Her novels are written for children at the reading level of ages nine to twelve. ==Biography== She was born Cynthia Carter in 1951. Her father was a psychiatrist, and her mother was an English teacher, who stopped working to raise DeFelice and her siblings. She credits her mother for her interest in books. She began writing children's books in 1987. She lives in Geneva, New York. ==Bibliography== ===Children's novels=== *The Strange Night Writing of Jessamine Colter, Atheneum (1988), *Weasel, Atheneum (1990), *Devil’s Bridge, Gale Group (1992), *The Light on Hogback Hill Atheneum (1993), *Lostman’s River, Atheneum (1994), *The Apprenticeship of Lucas Whitaker Farrar, Straus & Giroux (1996), (ALA Notable Book 1996) *The Ghost of Poplar Point, Farrar Straus (1997), *The Ghost of Fossil Glen, Farrar Straus (1998), *Nowhere to Call Home Farrar Straus (1999), *Death at Devil’s Bridge Farrar Straus (2000), *The Ghost and Mrs. Hobbs, Farrar Straus (2001) *The Ghost of Cutler Creek, Farrar Straus (2004), *Under the Same Sky, Farrar Straus (2005), *Missing Manatee, Farrar Straus (2005), *Bringing Ezra Back, Farrar Straus (2006) (sequel to Weasel) *Signal, Farrar Straus (2009), ===Select children's picture books=== *Dancing Skeleton, illustrations by Robert Andrew Parker, Atheneum (1989) (named a Best Book of the Year by the Library of Congress) *Clever Crow, illustrations by S.D. Schindler, Atheneum (1998), *Cold Feet, illustrations by Robert Andrew Parker, DK Books for Children (2000), (2001 Boston Globe-Horn Book award for best picture book) ==References== == Other websites == *author website *DeFelice at Macmillan Books website *DeFelice at the Internet Speculative Fiction Database website Category:Living people Category:Writers from Philadelphia Category:1951 births Category:American science fiction writers",
 "title": "Cynthia DeFelice"
}