{
 "id": "305283",
 "text": "Otto Koloman Wagner (13 July 1841 – 11 April 1918) was an Austrian architect and urban planner. He influenced the development of his hometown Vienna at the turn from the 19th to the 20th century. He also was the architect of important landmarks. ==Life== Otto Wagner was born in the Penzing district of Vienna. He studied in Berlin and Vienna. After work as brick layer he started as architect. His first buildings were in the historism style. In the late 1880s he became a proponent of the realism style. In 1890 he designed a city plan for Vienna but only the railway netwerk Wiener Stadtbahn was built. In 1894 he became Professor of Architecture at the Academy of Fine Arts Vienna.In 1896 he published a textbook entitled Modern Architecture in which he wrote down his ideas about the role of the architect, it based on his first lecture in the Academy. He called for an architecture based on modern materials and modern construction methods. In 1897, he joined Gustav Klimt, Joseph Maria Olbrich, Josef Hoffmann and Koloman Moser shortly after they founded the \"Vienna Secession\" artistic group. He died in 1918 in Vienna. ==Works of Otto Wagner== File:Penzing (Wien) - Otto-Wagner-Villa, Hüttelbergstraße 26 (2).JPG|Otto Wagner Villa File:Graben Vienna June 2006 285.jpg|Anker-Haus, Wien;Am Graben File:Otto-Wagner-Pavillon 110606.jpg|Railway station; Karlsplatz File:Wien - Österreichische Postsparkasse, Georg-Coch-Platz.JPG|Postal Office Savings Bank Building File:Penzing (Wien) - Kirche am Steinhof (4).JPG|Kirche Am Steinhof File:Wien - Otto-Wagner-Kirche, Innenansicht.JPG|Kirche Am Steinhof interior == Other websites == *Otto Wagner Museum in Vienna *Great Buildings Online *Images of several Wagner buildings *Otto Wagner at WOKA (de/en) *Majolica House in Vienna by Otto Wagner (with drawings and photos) *AEIOU - Das österreichische Kulturinformationssystem Digitized books from the architecture collection of AMS Historica, the digital library of the University of Bologna. * skizzen 1, Wien, 1905. * skizzen 2, Wien, 1905. * skizzen 3, Wien, 1905. Category:1841 births Category:1918 deaths Category:Austrian architects Category:People from Vienna Category:Urban planners",
 "title": "Otto Wagner"
}