{
 "id": "305278",
 "text": "The Ringstraße (also known as Ring) is a street in Austria's capital Vienna. It goes around the first district in almost the shape of a circle. The street is 5.2 km long and is divided into nine sections. It is one of the main sights in Vienna. ==History== On December 20th, 1857, emperor Franz Joseph I. ordered to destroy the old city walls and to build a street which should show the glory of the Habsburg Empire. The old walls were a traffic block because in 1850, the suburbs became part of the city as districts II. till IX. The order of the emperor outlined the exact size of the boulevard, as well as the geographical positions and functions of the new buildings. The only building which was erected by the city was the Town Hall. During the following years, a large number of important public and private buildings were erected. Nobility and bourgeoisie began to build mansions along the street. Most of them were built in the Ringstraßenstyle, which mainly quotes older styles. ==Sections of the Ringstraße== The Ringstraße has several sections. It surrounds the central area of Vienna on all sides, except for the northeast, where its place is taken by the Franz-Josephs-Kai, the street going along the Donaukanal (a branch of the Danube). Starting from the Ringturm at the northern end of the Franz-Josephs-Kai, the sections are: * Schottenring (named after the Schottenstift) * Dr.-Karl-Lueger-Ring (Karl Lueger) * Dr.-Karl-Renner-Ring (Karl Renner) * Burgring (Hofburg) * Opernring (Vienna State Opera) * Kärntner Ring (Carinthia) * Schubertring (Franz Schubert) * Parkring (Wiener Stadtpark) * Stubenring (named after the Stubenbastei, part of the viennese citywall since 1156) ===Buildings along the Ringstraße=== * The K.u.K. Hofoper (now Vienna State Opera), in neo-romantic style by August Sicard von Sicardsburg and Eduard van der Nüll, * the Akademie der bildenden Künste (Academy of Fine Arts), * the Justizpalast (now Federal Ministry of Justice), * the Parliament building, in neo-attic style (a reference to the democracy of ancient Athens) by Theophil Freiherr von Hansen, * the Rathaus (Town Hall) in Flemish-Gothic style by Friedrich Schmidt, * the K.u.K. Hofburgtheater (now Burgtheater) by Karl Freiherr von Hasenauer, * the University Building, in neo-renaissance style (a reference to the beginnings of the university system in northern Italy, * the Votivkirche, in neo-gothic style (a reference to the gothic Cathedrals of France) by Heinrich Freiherr von Ferstel, * the Börse (Stock Exchange), * the Ringturm, modern 1950s style, * the Urania observatory, * the Kriegsministerium (now Regierungsgebäude), in neo-baroque style by Ludwig Baumann, * the Postsparkasse (Postal Savings Bank), in Jugendstil by Otto Wagner, * the Museum für Angewandte Kunst (Museum of Applied Arts) in neo- renaissance style by Heinrich Freiherr von Ferstel, * the Palais Württemberg (now Hotel Imperial), ==Gallery== Wien Burgtheater um 1900.jpg|Burgtheater around 1900 Wien - Naturhistorisches Museum (1).JPG|Museum of Natural History Maria Theresien Platz, Naturhistorisches Museum.jpg|Museum of Art History Dr. Karl Lueger-Ring 01a.JPG| Palais Epstein Vienna June 2006 233.jpg|Palais Epstein Wien - Staatsoper (2).JPG|Opera IMG 0165 - Wien - Parlament.JPG|Parliament building Vienna - Rathaus.jpg|Vienna Town Hall == Other websites == * suf.at - Vienna Ringstraße * Die Ringstraße - ein Juwel unter den Straßen der Welt * viennatouristguide.at - Sights along the Ringstraße Category:Vienna",
 "title": "Ringstraße"
}