{
 "id": "305327",
 "text": "The International League (IL) is a Minor League Baseball league based in the Eastern United States. Like the Pacific Coast League, the International League plays at the Triple-A (AAA) level, the most difficult level before Major League Baseball (MLB). The league started in 1884. It had different names until it became known as the International League in 1912. The league was called that because it had teams in the United States, Canada, and Cuba. However, all the league's 20 teams are now located in the United States. After MLB took control of Minor League Baseball in 2021, it was called the Triple-A East for one season before going back to the IL name in 2022. ==Teams== Division Team Founded MLB affiliation Affiliated since City Stadium East Buffalo Bisons 1979 Toronto Blue Jays 2013 Buffalo, New York Sahlen Field Charlotte Knights 1976 Chicago White Sox 1999 Charlotte, North Carolina Truist Field Durham Bulls 1902 Tampa Bay Rays 1998 Durham, North Carolina Durham Bulls Athletic Park Jacksonville Jumbo Shrimp 1962 Miami Marlins 2021 Jacksonville, Florida 121 Financial Ballpark Lehigh Valley IronPigs 2008 Philadelphia Phillies 2007 Allentown, Pennsylvania Coca-Cola Park Norfolk Tides 1961 Baltimore Orioles 2007 Norfolk, Virginia Harbor Park Rochester Red Wings 1899 Washington Nationals 2021 Rochester, New York Innovative Field Scranton/Wilkes-Barre RailRiders 1989 New York Yankees 2007 Moosic, Pennsylvania PNC Field Syracuse Mets 1934 New York Mets 2019 Syracuse, New York NBT Bank Stadium Worcester Red Sox 2021 Boston Red Sox 2021 Worcester, Massachusetts Polar Park West Columbus Clippers 1977 Cleveland Guardians 2009 Columbus, Ohio Huntington Park Gwinnett Stripers 2009 Atlanta Braves 2009 Lawrenceville, Georgia Coolray Field Indianapolis Indians 1902 Pittsburgh Pirates 2005 Indianapolis, Indiana Victory Field Iowa Cubs 1969 Chicago Cubs 1981 Des Moines, Iowa Principal Park Louisville Bats 1982 Cincinnati Reds 2000 Louisville, Kentucky Louisville Slugger Field Memphis Redbirds 1998 St. Louis Cardinals 1998 Memphis, Tennessee AutoZone Park Nashville Sounds 1978 Milwaukee Brewers 2021 Nashville, Tennessee First Horizon Park Omaha Storm Chasers 1969 Kansas City Royals 1969 Papillion, Nebraska Werner Park St. Paul Saints 1993 Minnesota Twins 2021 Saint Paul, Minnesota CHS Field Toledo Mud Hens 1965 Detroit Tigers 1987 Toledo, Ohio Fifth Third Field ==References== ==Other websites== *Minor League Baseball's official website Category:Baseball leagues",
 "title": "International League"
}