{
 "id": "305490",
 "text": "Estado Mérida () is one of the 23 states of Venezuela. The state capital is Mérida. Mérida State covers a total surface area of 11,300 km² and, in 2007, had an estimated population of 843,800.Vila, Marco Aurelio, 1967: Aspectos geográficos del estado Mérida. Corporación Venezolana de Fomento. Caracas. 359p.Hernández Caballero, Serafín (Editor). (1998): Gran Enciclopedia de Venezuela. Editorial Globe, C.A. Caracas. 10 volúmenes. == Municipalities and municipal seats == Municipality Localization Seat Nombre de parish civiles Parish name Population (2001) Alberto Adriani El Vigía 7 Rómulo Gallegos Presidente Páez Rómulo Betancourt Gagriel Picón Gonzalez Hector Amable Mora José Nucete Sardi Pulido Méndez Andrés Bello La Azulita 1 Capital Andrés Bello Antonio Pinto Salinas Santa Cruz de Mora 3 Mesa de las Palmas Mesa Bolívar Santa Cruz de Mora Aricagua Aricagua 2 Aricagua San Antonio Arzobispo Chacón Canaguá 7 Canaguá Mucutuy Mucuchachí Chacantá El Molino Capurí Guaimaral Campo Elías Ejido 7 Fernandez Peña Matriz Montalbán Acequias Jají La Mesa San José Caracciolo Parra Olmedo Tucaní 2 Capital Caracciolo Parra Olmedo Florencio Ramírez Cardenal Quintero Santo Domingo 2 Capital Cardenal Quintero Las Piedras Guaraque Guaraque 3 Capital Guaraque Mesa de Quintero Río Negro Julio César Salas Arapuey 2 Julio César Salas Palmira Justo Briceño Torondoy 2 Capital Justo Briceño San Cristóbal de Torondoy Libertador Mérida 15 Antonio Spinetti Dini Arias Caracciolo Parra Pérez Domingo Peña El Llano Gonzalo Picón Febres Jacinto Plaza Juan Rodríguez Suárez Lasso de la Vega Mariano Picón Salas Milla Osuna Rodríguez Sagrario El Morro Los Nevados Miranda Timotes 4 Andrés Eloy Blanco La Venta Piñango Timotes Obispo Ramos de Lora Santa Elena de Arenales 3 Capital Obispo Ramos de Lora Eloy Paredes San Rafael de Alcázar Padre Noguera Santa María de Caparo 1 Padre Noguera Pueblo Llano Pueblo Llano 1 Pueblo Llano Rangel Mucuchíes 4 Cacute La Toma Mucurubá San Rafael Rivas Dávila Bailadores 2 Bailadores Gerónimo Maldonado Santos Marquina Tabay 1 Santos Marquina Sucre Lagunillas 5 Chiguará Estánques Pueblo Nuevo San Juan La Trampa Tovar Tovar 4 Tovar El Llano San Francisco El Amparo Tulio Febres Cordero Nueva Bolivia 4 Independencia Santa Apolonia Maria de La Concepción Palacios y Blanco Nueva Bolivia Zea Zea 2 Caño El Tigre Zea Total 85 ==Geography== ===Hydrography=== ====Rivers==== Hydrography is divided into two basins of the Orinoco River (Atlantic) and Lake Maracaibo (Caribbean Sea): In the Orinoco River basin major rivers are: Santo Domingo, Canaguá, Escagüey, Ticopoto, Bumbúm and Carapo; in the In the Lake Maracaibo basin major rivers are: Chama, Motatán, Mucujepe, Capaz, Torondoy, Mocotíes and Nuestra Señora. ====Lagons==== In the state there are a lot of gaps between them are: La Mucuy, Los Patos, Negra, Mucubaji, Santo Cristo, El Arco, Los Anteojos, Suero, Encierro, La Sangre, El Gallo, Don Pedro, Laguna Grande, campanario, La Honda, La Negra, Fría y La Carbonera. Other gaps: Laguna Brava, Los Lirios and Urao ===National parks=== * Sierra Nevada National Park * Paramo Batallon – La Negra National Park * Sierra de la Culata National Park * Tapo-Caparo National Park ===Natural monuments=== * Chorrera de La González * Laguna de Urao * Meseta la Galera ===Other sites of interest=== * Aguas termales de Chiguara. * Aguas termales de Jají. * Aguas termales de Tabay. * Aguas termales Valle de la Quebrada de las Tapias. * El Velo de la Novia. * Parque Natural Cascada De La India Carú * Parque Natural Cascada El Guayabal * Laguna de Mucubají o Laguna Grande. * Laguna Negra. * Kiubofibo \"Inside my mind\". * Collado del Cóndor (Pico El Águila). * Pico El Gavilán. * Pico Espejo. * Pico Mucuñuque. * Aguas termales de Santa Apolonia * Balneario de Palmarito ===Climate and Vegetation=== The climate is cold but in the relatively small area of Mérida state, there are usually several dramatic climatic changes that occur daily. The climate in Mérida city is between 19 °C and 20 °C, temperatures between 5 °C and 9 °C at El Bolivar Peak, or below zero when it snows and 28 °C in the El Vigía area. Its rains almost every late afternoon in January–February that is the coldest months an August–September and in August and September it often rains at night. The vegetation is exuberant and there are many lakes and rivers, a great number of which are well stocked with trout, one of the delicacies of Mérida. The most important river in the state is the \"Chama\" because a large part of the water resources of Venezuela originates in the Mérida mountains. The state tree is the \"Bucare\" and the state flower is the \"Frailejón\" and in the \"Coloradito\" is found the tree at the highest altitude in the world. In this mountains habitat the \"Oso Frontino\" bear and the majestic Condor flies through the skies of the páramos and in the lagoons there are many trout. ==References== == Other websites == * Government of Mérida State Category:1864 establishments Category:Establishments in Venezuela Category:19th-century establishments in South America",
 "title": "Mérida (state)"
}