{
 "id": "305534",
 "text": "Organometallic chemistry is the study of chemical compounds containing bonds between carbon and a metal. It combines aspects of inorganic chemistry (the study of non-carbon bonds) and organic chemistry (the study of carbon bonds). An example of an organometallic compounds is tetraethyllead; it was used as a fuel (leaded gasoline) additive in the past. Methylcobalamin (Vitamin B12) is a common organometallic compound. == Organometallic compounds == Organometallic compounds are compounds that have chemical bonds between an one or more metal atoms and one or more carbon atoms of an organyl group (an organic ligand). They have the prefix \"organo-\" (for example, organopalladium compounds). Organometallic compounds include subgroups like the metalloproteins such as haemoglobin. The term \"metalorganics\" usually refers to metal-containing compounds lacking direct metal-carbon bonds but which contain organic ligands which bind them to an organic compound. Metal beta- diketonates, alkoxides, and dialkylamides are members of this class. In addition to the traditional metals, elements such as boron, silicon, arsenic, and selenium form organometallic compounds. ===Coordination compounds with organic ligands=== Many complexes have coordination bonds between a metal and organic ligands. The organic ligands often bind the metal through a heteroatom such as oxygen or nitrogen, in which case such compounds are called \"coordination compounds\". Many organic coordination compounds occur in nature. For example, hemoglobin and myoglobin contain an iron center coordinated to the nitrogen atoms of a porphyrin ring; magnesium is the center of a chlorin ring in chlorophyll. The field of such inorganic compounds is known as bioinorganic chemistry. However, methylcobalamin (a form of Vitamin B12), with a cobalt-methyl bond, is a true organometallic complex, one of the few known in biology. ===Structure and properties=== The metal-carbon bond in organometallic compounds is half way between being ionic and covalent. Organometallic compounds with bonds that have characters in between ionic and covalent are very important in industry. They are both relatively stable in solutions but ionic enough to undergo reactions. Two important classes are organolithium and Grignard reagents. ==Uses== Organometallics find practical uses in stoichiometric and catalytic processes, especially processes involving carbon monoxide and alkene-derived polymers. All the world's polyethylene and polypropylene are produced with organometallic catalysts. Acetic acid is produced using metal carbonyl catalysts in the Monsanto process and Cativa process. The bulk of the synthetic alcohols, at least those larger than ethanol, are produced by hydrogenation of hydroformylation-derived aldehydes. The Wacker process is used in the oxidation of ethylene to acetaldehyde. Organomettalics are highly basic and highly reducing. They catalyze many polymerization reactions. They are also useful stoichiometrically. Organometallic compounds may be found in the environment. Environmentalists worry about organo-lead and organo-mercury compounds. They are toxic hazards. Research is underway using organometallic catalysis. The energy crisis has increased interest in more efficient ways of working with the fossil fuels we have left. The new interest in “green” technologies has also helped increase research. Many examples of organometallic research can be found in the petrochemical and pharmaceutical industries. Some current methods of chemical production are wasteful and produce toxic waste, while many organometallic catalysts show promise to change that. == History == Louis Claude Cadet synthesized methyl arsenic compounds related to cacodyl. William Christopher Zeise made platinum-ethylene complex. Edward Frankland discovered dimethyl zinc. Ludwig Mond discovered Ni(CO)4. Victor Grignard worked with organomagnesium compounds. The abundant and diverse products from coal and petroleum led to Ziegler-Natta, Fischer-Tropsch, hydroformylation catalysis which employ CO, H2, and alkenes as feedstocks and ligands. Years ago, Tetraethyllead was added to gasoline as an antiknock agent. Because lead is toxic, it is no longer used in gasoline. Instead, other organometallic compounds such as ferrocene and methylcyclopentadienyl manganese tricarbonyl are now added to gasoline to prevent knocking. The 1973 Nobel Prizes to Ernst Fischer and Geoffrey Wilkinson for work on metallocenes made organometallic chemistry more popular. In 2005, Yves Chauvin, Robert H. Grubbs and Richard R. Schrock shared the Nobel Prize for metal-catalyzed olefin metathesis. === Organometallic chemistry timeline === * 1760 Louis Claude Cadet de Gassicourt investigates inks based on Cobalt salts and isolates Cacodyl from cobalt mineral containing arsenic * 1827 Zeise's salt is the first platinum / olefin complex * 1848 Edward Frankland discovers diethylzinc * 1863 Charles Friedel and James Crafts prepare organochlorosilanes * 1890 Ludwig Mond discovers Nickel carbonyl * 1899 Introduction of Grignard reaction * 1900 Paul Sabatier works on hydrogenation organic compounds with metal catalysts. Hydrogenation of fats kicks off advances in food industry, see margarine * 1909 Paul Ehrlich introduces Salvarsan for the treatment of syphilis, an early arsenic based organometallic compound * 1912 Nobel Prize Victor Grignard and Paul Sabatier * 1930 Henry Gilman works on lithium cuprates, see Gilman reagent * 1951 Ferrocene is discovered * 1963 Nobel prize for Karl Ziegler and Giulio Natta on Ziegler-Natta catalyst * 1965 Discovery of cyclobutadieneiron tricarbonyl * 1968 Heck reaction * 1973 Nobel prize Geoffrey Wilkinson and Ernst Otto Fischer on sandwich compounds * 1981 Nobel prize Roald Hoffmann and Kenichi Fukui on Isolobal Principle * 2005 Nobel prize Yves Chauvin, Robert Grubbs, and Richard R. Schrock on metal-catalyzed alkene metathesis * 2010 Nobel prize Richard F. Heck, Ei-ichi Negishi, Akira Suzuki for their work in palladium- catalyzed coupling reactions in organic synthesis. == Related pages == *Chelation == References == == Other websites == * MIT OpenCourseWare: Organometallic Chemistry * Rob Toreki's Organometallic HyperTextbook * Web listing of US chemists who specialize in organometallic chemistry *",
 "title": "Organometallic chemistry"
}