{
 "id": "305602",
 "text": "Transitional fossils (or missing links) are the fossilised remains of lifeforms that show features typical of two distinct groups. It may be a rare fossil, such as Archaeopteryx, which shows early features of a group which later becomes widespread. The rarity of transitional forms is interesting. It suggests the new forms are not yet dominant in the ecology of their time, and their populations are relatively small. It follows that their fossils would be scarce. In the Solnhofen limestone where Archaeopteryx was found, there are more examples of pterosaurs of several genera than there are of the proto- bird.up to 29 species and nine genera of pterosaur have been found there. Bartell K.W., Swinburne N.H.M. and Conway-Morris S. 1990. Solnhofen: a study in Mesozoic palaeontology. Cambridge University Press. Transl. and revised from Bartel K.W. 1978. Ein Blick in die Erdgeschichte. Ott. In the Jurassic, the pterosaurs were dominant in the air. Large numbers of different bird species are found in the famous Chinese lagerstatten deposits such as the Jehol biota. The Lower Cretaceous birds are clearly more bird-like, and the features they developed enabled them to invade habitat niches which had been the preserve of pterosaurs, or maybe were not previously exploited at all. Pterosaur decline (if present) seems unrelated to bird diversity. In fact, at least some bird niches were reclaimed by pterosaurs just before the KT event.Longrich N.R.; Martill D.M.; Andres B. 2018. Late Maastrichtian pterosaurs from North Africa and mass extinction of Pterosauria at the Cretaceous-Paleogene boundary. PLOS Biology 16 (3): == Mosaic evolution == Typical of transitional fossils is that some features are clearly basal or primitive. Other features are advanced ('derived'). With Archaeopteryx, the front legs are derived, and show clearly the capacity for flight. Also, the feathers had the rachus (stem) off-centre, a feature of all bird flight feathers. The rest of the skeleton was just like any other small carnivorous dinosaur.Freeman, Scott & Herron, Jon; 2000. Evolutionary analysis. 2nd ed, Prentice Hall. p35 Transitional fossil flatfish are known, where the process of eye movement is not yet complete. In a typical modern flatfish, the head is asymmetric with both eyes on one side of the head. In Heteronectes, the transition from the symmetric head is incomplete, with one eye positioned near the top of the head, similar to its Italian relative Amphistium. The existence of these intermediate stages was predicted by Darwin.Friedman, Matt 2008. The evolutionary origin of flatfish asymmetry. Nature 454, 209–212. When transition takes place between one group and another, not all features change at the same time. This is called mosaic evolution.Carroll R.L. 1997. Patterns and processes of vertebrate evolution. Cambridge University Press. 408 Transitions between higher groups would involve a series of transitional species, only a few of which may be found as fossils. == References == Category:Evolutionary biology Category:Fossils",
 "title": "Transitional fossil"
}