{
 "id": "305734",
 "text": "Büsingen am Hochrhein often just known as Busingen, is a German village. It is part of the German state (Bundesland) of Baden-Württemberg. The village belongs to the district (Kreis) of Konstanz. Büsingen has an area of about . About 1,350 people live there. The village is the only exclave of Germany. It is surrounded by territory that belongs to Switzerland. A 680-metre wide strip of Swiss land separates the village from the rest of Germany. The village next to Büsingen is the Swiss village Dörflingen. There are no border controls between Büsingen and Switzerland because Büsingen is in a customs union with this country. The two countries agreed this in 1964 and the treaty became law in 1967. At the same time another even small part of West Germany separated from the rest of the country by land belonging to Switzerland, called Verenahof became part of the Swiss village of Büttenhardt. Because the village is completely surrounded by Swiss territory, but is politically German, many things exist twice there. Büsingen has for example two postal codes and residents may have phone numbers from two countries. The official currency is the Euro. However, most things like electricity and cable television come from Switzerland and have to be paid in Swiss francs. Büsingen depends heavily on Switzerland in economics. Büsingen only has one elementary school. Pupils can attend the school there up to the fourth grade. After this, the parents have to decide whether the children should attend a German or a Swiss school. A Swiss Postbus connects the village to the Swiss city Schaffhausen the Swiss villages Dörflingen, Buch and Ramsen and the German village Randegg. Most people who live in Büsingen, work in Switzerland and earn their salary in Swiss francs. Büsingen has a large proportion of residents who are retired people, many are Swiss, because they pay little or no tax on their pensions. About 30% of the resident population of Büsingen hold a Swiss passport. == History == The oldest finds in the area of Büsingen date back to the Bronze Age. The village was first mentioned in historical documents in 1090. The area belonging to the village contains the sites of two abandoned villages. == References == == Other websites == * Category:Towns in Baden-Württemberg Category:Konstanz (district)",
 "title": "Büsingen am Hochrhein"
}