{
 "id": "305768",
 "text": "CAE Global Academy Brussels Sabena Flight Academy is a Belgian flight school created in 1953.Sabena Flight Academy It is in Steenokkerzeel (Brussels Airport). The school trains airline pilot and is part of CAE Global Academy.Training specialist CAE acquires Sabena Flight Academy to address pilot shortage == History == === Belgian national aviation school === The origins of the school for airline pilots start in 1953. It was when the Belgian government, which owns the aircraft, contracted the operation thereof to Sabena under the name École d’aviation civile (EAC). The training parts are conducted at the airfield of Grimbergen in a building which no longer exists. Basic training is done through the De Havilland DH82A \"Tiger Moth\" replaced in 1968 by Siai Marchetti SF260. The advanced training is entrusted to the Saab Safir 91B, replaced in 1958 by the Cessna 310B and in 1981 by the Embraer Xingu. === Sabena airline flight school === In 1991, the government gives the École d’aviation civile to Sabena airline. It is renowned first Belgian Aviation SchoolLA BELGIAN AVIATION SCHOOL FORME DES PILOTES DE LIGNE EN VINGT MOIS. APPRENDRE A VOLER AU-DESSUS DU DESERT DE NEVADA ET DU... and then Sabena Air Training Center, and the school moved into a new building at Brussels National Airport. It was decided to carry out practical training in flight to Phoenix in U.S.A because the weather in Arizona allows flights 365 days per year in a high and complex air traffic. Despite the bankruptcy of Sabena in 2001, the activities didn't stop. In 2004, the school was sold to two former managers of Sabena and became the Sabena Flight Academy. === Acquisition by CAE === It was finally absorbed in 2008 by CAE. This was done as part of a larger program to complete a global training network: the CAE Global Academy CAE - SABENA FLIGHT ACADEMY == Bibliography == * Olivier Wilmart, De Sabena à Air France, Éditions Racine, 2002, 285 p. () * Olivier Wilmart, La nuque bleue, Éditions Racine, 2007, 196 p. () * Willy Buysse, Marguerite Coppens, Etienne Reunis, Frans Van Humbeek, Michel Wautelet, Sabena, le progrès venait du ciel, Bruxelles, Borgerhoff & Lamberigts, 2011, 224 p. () * Nicolas Tenoux (SFA 2011), 6 mois dans la vie d’un Pilote de ligne: Les secrets du quotidien..., 15 April 2020, Amazon, 51p., (), p. 12 * Nicolas Tenoux (SFA 2011), 6 months in the life of an Airline pilot: Daily life secrets …, 2020, Amazon, 77p., (), p. 12 == References == == Other websites == * CAE Oxford Aviation Academy Sabena Flight Academy website * CAE Category:Aviation organizations Category:Colleges and universities in Europe Category:1953 establishments in Europe Category:1950s establishments in Belgium Category:Organizations based in Brussels",
 "title": "Sabena Flight Academy"
}