{
 "id": "305880",
 "text": "Carbon–hydrogen bond activation or C-H activation is a reaction that breaks a carbon–hydrogen bond. Most times, the reaction involves organometallic complexes. The reaction path has coordination of a hydrocarbon to the inner- sphere of the metal atom (“M”). The reaction path includes either an intermediate “alkane or arene complex” or as a transition state leading to a \"M-C\" intermediate.Organometallic C-H Bond Activation: An Introduction Alan S. Goldman and Karen I. Goldberg ACS Symposium Series 885, Activation and Functionalization of C-H Bonds, 2004, 1–43Arndtsen, B. A.; Bergman, R. G.; Mobley, T. A.; Peterson, T. H. “Selective Intermolecular Carbon–Hydrogen Bond Activation by Synthetic Metal Complexes in Homogeneous Solution.” Accounts of Chemical Research, 1995: 28 (3) 154–162.Periana, R. A.; Bhalla, G.; Tenn, W. J., III, Young, K. J. H.; Liu, X. Y.; Mironov, O.; Jones, C.; Ziatdinov, V. R. “Perspectives on some challenges and approaches for developing the next generation of selective, low temperature, oxidation catalysts for alkane hydroxylation based on the C-H activation reaction.” Journal of Molecular Catalysis A: Chemical, 2004: 220 (1) 7–25. The reaction path makes C-H activation different from other reactions. During the C-H breaking event the hydrocarbyl group remains linked in the inner-sphere and under the influence of the metal atom. Chemists study C-H activation because for many years chemists believed that C-H bonds were unreactive. Theoretical studies and experiments now show that C-H bonds can be broken. This is done by a nearby metal atom changing the electron distribution of the C-H bond (coordination). Much chemical research looks at the design and synthesis of new reagents and catalysts that can affect C-H activation. The goal of this research is the conversion of cheap and abundant alkanes into valuable functionalized organic compounds. Otto Dimroth discovered the first C-H activation reaction. In 1902, he reported that benzene reacted with mercury(II) acetate, but some scholars do not view this reaction as being a C-H activation. Goldman & Goldberg later wrote, C-H activation looks like H-H activation: both can be achieved by electrophilic or oxidative addition. The first true C-H activation reaction was reported by Joseph Chatt in 1965The tautomerism of arene and ditertiary phosphine complexes of ruthenium(0), and the preparation of new types of hydrido-complexes of ruthenium(II) J. Chatt and J. M. Davidson, J. Chem. Soc. 1965, 843 with insertion of a ruthenium atom ligated to dmpe in the C-H bond of naphthalene. == References== ==Further reading== * “Activation of C-H Bonds by Metal Complexes”, A. E. Shilov, G. B. Shul’pin, Chem. Rev. 1997, 97, 2879–2932. * “Activation and Catalytic Reactions of Saturated Hydrocarbons in the Presence of Metal Complexes”, A. E. Shilov, G. B. Shul’pin, Kluwer Academic Publishers, Dordrecht/Boston/London, 2000 (552 p) (Springer, ). https://www.springer.com/chemistry/physical+chemistry/book/978-0-7923-6101-5 * “Alkane C-H activation and functionalization with homogeneous transition metal catalysts: a century of progress – a new millennium in prospect”, R. H. Crabtree, J. Chem. Soc., Dalton Trans. 2001, 17, 2437–2450. * “Organometallic alkane CH activation”, R. H. Crabtree, J. Organometal. Chem. 2004, 689, 4083–4091. * “Mechanistic Aspects of C−H Activation by Pt Complexes”, M. Lersch, M.Tilset, Chem. Rev. 2005, 105, 2471−2526. * “Recent Advances in the Platinum-mediated CH Bond Functionalization”, A. N. Vedernikov, Curr. Org. Chem. 2007, 11, 1401−1416. * “Catalytic C-H functionalization by metalcarbenoid and nitrenoid insertion”, H. M. L. Davies, J. R. Manning, Nature, 2008, 451, 417−424, * \"Mechanisms of C-H bond activation: rich synergy between computation and experiment”, Y. Boutadla, D. L. Davies, S. A. Macgregor, A. I. Poblador-Bahamonde, Dalton Trans. 2009, 5820−5831. * “C-H Bond Activation in Transition Metal Species from a Computational Perspective”, D. Balcells, E. Clot, O. Eisenstein, Chem. Rev. 2010, 110, 749–823. * “Palladium-Catalyzed Ligand-Directed C-H Functionalization Reactions”, T. W. Lyons, M. S. Sanford, Chem. Rev. 2010, 110, 1147–1169. * “Selectivity enhancement in functionalization of C-H bonds: A review”, G. B. Shul’pin, Org. Biomol. Chem. 2010, 8, 4217–4228. Category:Organometallic chemistry",
 "title": "Carbon–hydrogen bond activation"
}