{
 "id": "306061",
 "text": "Boko Haram is an Independent Jihadist Group, The name of the group means \"Western\" or \"non-Islamic\" education is a sin. The group is centred in Borno State in northeastern Nigeria. It wants to make Islamic law the only law in Nigeria. It also wants to outlaw education that is not based on Islam. The group sees itself as similar to the Taliban, which are active in Afghanistan. Locally, the group is known as the \"Taliban\". The official name of the group is Jama'atu Ahlis Sunna Lidda'awah wal-Jihad, which in Arabic means \"People Committed to the Propagation of the Prophet's Teachings and Jihad.\" It used to be part of the Islamic State But split off, resulting in the Islamic state to create ISWAP. The group was formed in Maiduguri, Borno State, in 2002. Its insurgency began in 2009. They follow an extreme version of Sunni Islam. Local residents of the area soon called the group Boko Haram. Loosely translated from the local Hausa language, this means Western education is forbidden. Residents gave it the name because of its strong opposition to Western education, which it sees as corrupting Muslims. The term \"Boko Haram\" comes from the Hausa word 'boko' meaning \"Animist, western or otherwise non-Islamic education\" and the Arabic word 'haram' figuratively meaning \"sin\" (literally, \"forbidden\").* Boko Haram opposes not only Western education, but Western culture and science as well. The group also forbids the wearing of shirts and trousers and the act of voting in elections. In its view, the Nigerian state is run by non-believers. In a 2009 BBC interview, Mohammed Yusuf, the group's leader at the time, said he rejects the fact that the earth is a sphere and views it as contrary to Islam, along with Darwinism and the fact that rain comes from water evaporated by the sun. Boko Haram often carry out bombings, kidnappings and shootings, as well as arson and looting. They have killed thousands of people in Africa, attacking civilian and military targets. There are many terrorist activities for which Boko Haram have claimed responsibility: * In December 2010, the group stormed and released hundreds of inmates from Bauchi prison. * In the same month, there was a bombing in Jos (Plateau state) that saw 80 people dead followed by an attack on Abuja barracks. * 2010-2011 was a year in which dozens of civilians were killed in various shootings that took place in Maiduguri and in addition, the Abuja Police Headquarters and the United Nations Headquarters. Boko Haram is not associated with the group Movement for the Emancipation of the Niger Delta which fights against the oil industry in the Niger Delta, since 2006. On 14 April 2014, Boko Haram kidnapped 276 teenagers from a secondary school in Chibok, Borno. Boko Haram killed at least 100 people in Baga, Borno, in January 2015. About 620 buildings were damaged or destroyed by fire. In the mid-2010s, Boko Haram extended its activities into Cameroon, Chad and Niger. It became part of Islamic State in March 2015. ==References== Category:2002 establishments Category:21st century in Nigeria Category:Crime in Nigeria Category:Islamic State Category:Islamist militant groups Category:Rebel militia groups in Africa Category:Sunni organizations Category:Organizations based in Nigeria",
 "title": "Boko Haram"
}