{
 "id": "306271",
 "text": "The Centers for Disease Control and Prevention (or CDC) are a United States federal agency under the Department of Health and Human Services. CDC main office is in Druid Hills, a neighborhood in northeastern Atlanta, Georgia. Home Page. Centers for Disease Control and Prevention. Retrieved on November 19, 2008. Groundbreaking held for new CDC virus research labs . Atlanta Journal-Constitution. December 3, 1985. A21. Retrieved on February 5, 2011. \"[The new facility will sit behind and be connected to CDC's red-brick complex of buildings on Clifton Road in DeKalb County[...]\"\"Druid Hills CDP, GA .\" United States Census Bureau. Retrieved on May 5, 2009. It works to protect public health and safety. It provides information to enhance health decisions. It promotes health as a partner with state health departments and other organizations. When an infectious disease or bad food can cause health problems, the CDC will tell the nation how to fight it. The CDC works on environmental health, occupational safety and health, health promotion, injury prevention and education activities designed to improve the health of the people of the United States of America. ==Agencies under the CDC== The CDC has agencies that work under it: * NIOSH, which checks things people wear for job safety. * ATSDR, which lists chemicals that make people sick. ==Foundation== The CDC FoundationCDCfoundation.org is separate from CDC as a private, nonprofit 501(c)(3) organization. It is incorporated in the State of Georgia. Section 399F of the Public Health Service Act created the foundation to help the CDC work with the private sector. ==References== ==Other websites== * The CDC Homepage * CDC Online Newsroom * CDC Health Topics A to Z * CDC Public Health Image Library * CDC Global Communications Center * CDC Emerging Infectious Diseases Laboratory– Atlanta, Georgia * Centers For Disease Control And Prevention Meeting Notices and Rule Changes from The Federal Register RSS Feed * Proposed and finalized federal regulations from the Centers for Disease Control and Prevention Category:United States Department of Health and Human Services",
 "title": "Centers for Disease Control and Prevention"
}