{
 "id": "306540",
 "text": "The Cetaceans (whales, dolphins and porpoises) are mammalian marine descendants of land mammals. Their terrestrial origins are indicated by: * Their need to breathe air from the surface; * The bones of their fins, which resemble the limbs of land mammals * The vertical movement of their spines, characteristic more of a running mammal than of the horizontal movement of fish. The question of how land animals evolved into ocean-going leviathans was a mystery until recent discoveries in Pakistan revealed several stages in the transition of cetaceans from land to sea. == DNA sequence analysis == After many years when palaeontologists thought whales had evolved from mesonychids, DNA sequence analysis showed the closest relationship was with artiodactyls, the even-toed ungulates. A new clade was created to include Cetacea and their nearest relatives, the hippopotamus family. This clade is called the Cetartiodactyla. == Fossil record == Hippo fossils are not found until the Miocene, but whale ancestors have been found from the Eocene. This leaves a gap of nearly 30 million years where no hippo ancestors are found. The most recent hypothesis is that hippos and whales shared a common semi-aquatic ancestor which branched off from other Artiodactyls around 60 million years ago (mya). This ancestral group probably split into two branches around 54 mya. One branch evolved into cetaceans, possibly beginning with the proto- whale Pakicetus from 52 mya. Pakicetus and other early whale ancestors are collectively known as the Archaeoceti. These early cetaceans gradually became adapted to life in the sea. They became the completely aquatic cetaceans. === Indohyus === Indohyus is a small deer-like creature, which lived about 48 million years ago in Kashmir. It belongs to the artiodactyls family Raoellidae, and is believed to be the closest sister group of Cetacea. About the size of a raccoon or domestic cat, this herbivorous creature shared some of the traits of whales. It also showed signs of adaptations to aquatic life, including a thick and heavy outer bone coating. This is similar to the bones of modern creatures such as the hippopotamus, and reduces buoyancy so that they can stay underwater. This suggests a similar survival strategy to the African mousedeer or water chevrotain which, when threatened by a bird of prey, dives into water and hides beneath the surface for up to four minutes. ==Size== Scientists from the University of Plymouth studied many animals that dive and hold their breath, from insects to whales, and they found that larger animals can hold their breath longer than smaller animals because they can store more oxygen for their size, and this difference was much bigger for warm-blooded animals than for cold-blooded animals. They said this may be why modern whales and extinct diving animals like plesiosaurs became so large. The blue whale is not the largest ever whale, and perhaps by quite a long way. 39 million years ago Perucetus colossus was between 85 to 340 tons, so up to 3x heavier than the blue whale.Source: Eli Amson, State Nuseum of Natural History, Stuttgart.Bianucci G.; Lambert O.; Urbina M.; Merella M.; Collareta A.; Bennion R.; Salas-Gismondi R.; Benites-Palomino A.; Post K.; de Muizon C.; Bosio G.; Di Celma C.; Malinverno E.; Pierantoni P.P.; Villa I.M.; Amson E. 2023. A heavyweight early whale pushes the boundaries of vertebrate morphology. Nature doi:10.1038/s41586-023-06381-1. PMID 37532931 == References == Category:Evolutionary biology Category:Cetaceans",
 "title": "Evolution of cetaceans"
}