{
 "id": "3065",
 "text": "Aston Villa Football Club (nicknamed Villa), is an English football club based in Birmingham. They have played at Villa Park, in Aston, since 1897. They were one of the teams that started the English Football League in 1888. They were also one of the teams that started the Premier League in 1992.Ward, Adam; Griffin, Jeremy; p. 161. They are one of five English clubs to have won the European Cup. They won this in 1982. They have also won the Football League First Division seven times, the FA Cup seven times, the League Cup five times, and the European Super Cup once. Villa have a large rivalry with nearby team Birmingham City. This is called the Second City Derby, and they have been playing against each other since 1879. The team's main home colours are claret and light blue. Their badge is a claret lion (having changed from a yellow lion in 2023). The club is owned by the NWSE group (owned by Egyptian Nassef Sawiris) and American Wes Edens. == Club honours == Aston Villa have won European and domestic league trophies. The club's last English trophy was in 1996 when they won the League Cup, and most recently they won the 2001 UEFA Intertoto Cup. === Domestic === ;League Titles *First Division / Premier League:Up until 1992, the top division of English football was the Football League First Division; since then, it has been the FA Premier League. At the same time, the Second Division was renamed the First Division, and the Third Division was renamed the Second Division. 7 ::Champions: 1893–94, 1895–96, 1896–97, 1898–99, 1899–1900, 1909–10, 1980–81 * Second Division / First Division / Championship: 2 ::Champions: 1937–38, 1959–60 ::Play-off Winners: 2018–19 * Third Division / Second Division / League One: 1 ::Champions: 1971–72 ;Cups *FA Cup: 7 ::Winners: 1886–87, 1894–95, 1896–97, 1904–05, 1912–13, 1919–20, 1956–57 *League Cup / EFL Cup: 5 ::Winners: 1960–61, 1974–75, 1976–77, 1993–94, 1995–96 *FA Charity Shield / FA Community Shield: 1 ::Winners: 1981 *Sheriff of London Charity Shield: 2 ::Winners: 1899, 1901 === European === *European Cup / UEFA Champions League: 1 ::Winners: 1981–82 *European Super Cup / UEFA Super Cup: 1 ::Winners: 1982 *Intertoto Cup: 1 ::Winners: 2001 == League position == Season League Position 2000/01 Premier League 8th 2001/02 Premier League 8th 2002/03 Premier League 16th 2003/04 Premier League 6th 2004/05 Premier League 10th 2005/06 Premier League 16th 2006/07 Premier League 11th 2007/08 Premier League 6th 2008/09 Premier League 6th 2009/10 Premier League 6th 2010/11 Premier League 9th 2011/12 Premier League 16th 2012/13 Premier League 15th 2013/14 Premier League 15th 2014/15 Premier League 17th 2015/16 Premier League 20th 2016/17 EFL Championship 13th 2017/18 EFL Championship 4th 2018/19 EFL Championship 5th 2019/20 Premier League 17th 2020/21 Premier League 11th === Former position === == Managers == Name Nationality Period Played Win Draw Lose Win% Honours From To George Ramsay August 1884 May 1926 6 FA Cups, 6 Division One championships Jimmy Hogan November 1936 September 1939 Division Two Champions Eric Houghton September 1953 November 1958 FA Cup winner Joe Mercer December 1958 July 1964 Division Two Champions, League Cup winner Inducted into the English Football Hall of Fame Ron Saunders June 1974 February 1982 2 League Cups, Division One champions. Also in 2006 was inducted into the Aston Villa Hall of Fame. Tony Barton February 1982 June 1984 European Cup, European Super Cup Jozef Vengloš July 1990 May 1991 First manager not from Britain or Ireland to take charge of a top-flight club in England. Ron Atkinson July 1991 November 1994 League Cup winner Brian Little November 1994 February 1998 League Cup winner John Gregory February 1998 January 2002 Intertoto Cup winner == References == == Other websites == * Official Aston Villa website * list of media articles concerning Aston Villa * Aston Villa Fan site * Aston Villa: From the Fans' Perspective * Heroes and Villains Fanzine * - Aston Villa fansite made for the fans, by the fans Category:Premier League clubs Category:1874 establishments in England",
 "title": "Aston Villa F.C."
}