{
 "id": "306621",
 "text": "The Hunchback of Notre Dame is a 1996 American-French animated musical drama movie based on Victor Hugo's novel. It was produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is the 34th Disney animated movie. It follows the deformed bell-ringer attempting to gain acceptance into society. The film was directed by Gary Trousdale and Kirk Wise and produced by Don Hahn, from a screenplay written by Tab Murphy, Irene Mecchi, Jonathan Roberts, and the writing team of Bob Tzudiker and Noni White, and based on a story conceived by Murphy, the film stars the voices of Tom Hulce, Demi Moore, Tony Jay, Kevin Kline, Paul Kandel, Jason Alexander, Charles Kimbrough, David Ogden Stiers and Mary Wickes in her final movie role. Produced during a period known as the Disney Renaissance, the movie is considered to be one of Disney's darkest animated movie because its narrative explores such mature themes as infanticide, lust, damnation, genocide, and sin, despite the changes made from the original source material in order to ensure a G rating received by the MPAA. The musical score was written by Alan Menken, with songs written by Menken and lyricist Stephen Schwartz, who had previously collaborated on Pocahontas. The movie was released on June 21, 1996 to largely positive reviews and was a commercial success, grossing over $325 million worldwide and becoming the fifth highest-grossing release of 1996. The movie received Academy Award and Golden Globe Award nominations for Menken's musical score. A darker, more Gothic stage adaptation of the movie, was rewritten and directed by James Lapine and produced by Walt Disney Theatrical in Berlin, Germany, as Der Glöckner von Notre Dame, and ran from 1999 to 2002. A direct-to-video sequel, The Hunchback of Notre Dame II, was released in 2002. ==Plot== In 1482 Paris, Clopin, a Gypsy puppeteer tells a group of children the origin of the titular hunchback. Twenty years earlier, a group of gypsies are arrested by Judge Claude Frollo, the corrupt and fanatical Justice Minister, who pursues a woman and her deformed baby. After killing her near the Notre Dame Cathedral, Frollo attempts to drop the baby in the well, but the archdeacon stops him. Frollo decides to raise the child at the cathedral and atone for his sin. He names him Quasimodo. Twenty years later, Quasimodo became a goodhearted but isolated young man living in the cathedral. His only friends are a trio of sentient gargoyles, Victor, Hugo and Laverne. They encourage him to attend the annual Feast of Fools. Frollo attempts to discourage him, telling him he would be shunned for his deformities. Undeterred, Quasimodo attends the festival where he is celebrated for his deformities, but is humiliated and surrounded by everyone. After freeing Quasimodo, the kind Gypsy dancer Esmeralda uses witchcraft to evade capture. As Quasimodo returns to the cathedral, Esmeralda meets Phoebus, the captain of the guard, who has her confined, instead of arresting her. Esmeralda befriends Quasimodo. He helps her escape the cathedral, and she gives him a pendant with a map to the Court of Miracles, the home of the gypsies. Frollo develops lustful feelings towards Esmeralda, calling on the Virgin Mary to protect him from her spell and avoid eternal damnation. The next day, Frollo and the guards arrest one of the civilians and burn every buildings. Phoebus defies Frollo, when he attempts to burn down the house. Phoebus falls unconscious at the river Seine, but Esmeralda rescues him and they head to the cathedral for refuge. The gargoyles try to encourage Quasimodo, but he becomes heartbroken when Esmeralda has loved Phoebus. When Frollo returns to the cathedral, he bluffs to Quasimodo that he knows the location of the gypsy hideout and Frollo will attack at dawn with a thousand men. Using Esmeralda's map, Quasimodo and Phoebus travel to the Court of Miracles, where Frollo and the guards capture everyone. Frollo prepares to burn Esmeralda at the stake after she rejects him, but she is saved by Quasimodo and is brought into the cathedral. Phoebus releases himself and the gypsies, and unites the citizens of Paris while opposing Frollo and the guards. Quasimodo and the gargoyles pour molten lead into the streets to prevent everyone from entering the cathedral. Frollo sneaks inside, and pursues Quasimodo and Esmeralda onto the balcony, where he reveals to Quasimodo that he killed his mother. Frollo falls to his death into the lake of molten copper, while Phoebus saves Quasimodo. Esmeralda and Phoebus receive a blessing for their relationship, and Quasimodo is accepted into Parisian society. == Voice cast == * Tom Hulce as Quasimodo * Demi Moore as Esmeralda (singing voice by Heidi Mollenhauer) * Tony Jay as Judge Claude Frollo * Kevin Kline as Captain Phoebus * Paul Kandel as Clopin * Jason Alexander, Charles Kimbrough, and Mary Wickes as Hugo, Victor, and Laverne respectively. This was Wickes' final acting performance, as she died a year before its release, at age 85. Jane Withers provided Laverne's remaining dialogue for the film. * David Ogden Stiers as the Archdeacon, also voices Miller. ==Release date== Country Premiere June 21, 1996 June 21, 1996 June 21, 1996 August 24, 1996 January 24, 1997 ==References== Category:1996 animated movies Category:1996 musical movies Category:American family movies Category:1990s American musical movies Category:English-language movies Category:Fiction set in the past Category:Movies based on books Category:Movies composed by Alan Menken Category:Movies composed by David Newman Category:Movies set in Paris Category:Movies about Christianity Category:Movies about rebellions Category:The Hunchback of Notre Dame (Disney) Category:Disability Category:Movies about disabilities",
 "title": "The Hunchback of Notre Dame (1996 movie)"
}