{
 "id": "306774",
 "text": "The Homeless World Cup is an football competition for homeless people all over the world. Starting in 2003 in Graz, Austria, the competition brings together homeless people with the aim to end homelessness. ==Rules== Anyone can play, male or female, as long as they are at least 16 years old. They must also have been homeless at some point after the previous year's World Cup, work as a street newspaper seller to earn money or be asylum seekers. A team of 4 players play, with 3 outfield players and 1 goalkeeper. 4 substitution players are allowed. A team gets 3 points for a win. If a match ends in a draw, it is decided by penalty shootout and the winning team gets three points and the losing team gets one point. Games are 14 minutes long, in two seven-minute halves. The field is 22m (long) x 16m (wide). ==History== Since 2003 the competition has taken place in: * Graz, Austria - 2003 * Gothenburg, Sweden - 2004 * Edinburgh, Scotland - 2005 * Cape Town, South Africa - 2006 * Copenhagen, Denmark - 2007 * Melbourne, Australia - 2008 * Milan, Italy - 2009 * Rio de Janeiro, Brazil - 2010 * Paris, France - 2011 * Mexico City, Mexico - 2012 * Poznań, Poland - 2013 * Santiago, Chile - 2014 * Amsterdam, Netherlands - 2015 * Glasgow, Scotland - 2016 *Oslo, Norway - 2017 *Mexico City, Mexico - 2018 *Cardiff, Wales - 2019 ==Kicking It documentary== The 2006 Homeless World Cup was the filmed as part of a documentary called Kicking It. directed by Susan Koch and Jeff Werner focusing on the experiences of seven homeless people at the Homeless World Cup football (soccer) game. Residents of Afghanistan; Kenya; Dublin, Ireland; Charlotte, North Carolina; Madrid, Spain and St. Petersburg in Russia were in the documentary which was narrated by actor Colin Farrell. The movie was released in January, 2008 at the Sundance Film Festival and is being distributed by Liberation Entertainment, Netflix and ESPN. ==References== == Other websites == *Official website Category:Homelessness Category:Football competitions Category:Football in Austria Category:Graz Category:2003 establishments",
 "title": "Homeless World Cup"
}