{
 "id": "306842",
 "text": "The Grignard reaction (pronounced ) is a chemical reaction (in the field of chemistry, or organometallic chemistry). The reaction forms new bonds between carbon atoms by using chemicals called Grignard reagents. The Grignard reaction is a name reaction. They are named after François Auguste Victor Grignard, who won the 1912 Nobel Prize in Chemistry for his discovery of this reaction. == Overview == A Grignard reagent has a central magnesium atom which is bonded to an organic group and a halogen atom, usually chlorine or bromine. These reagents are equivalents of carbanions, where carbon has extra electrons, making them very strong nucleophiles. ==Other information== Grignard reactions are not truly ionic, and no real carbanion is formed; the carbanion is a type of hypothetical intermediate called a synthon. The extra electrons of a Grignard reagent can form adducts with electrophiles, carbons that have a shortage of electrons. The reaction with a carbonyl is a classic example of this: : A work-up with acid removes the magnesium bromide, giving the alcohol product. Formally, this is a nucleophilic addition reaction. Unlike many nucleophilic additions, the Grignard reaction is not usually considered reversible, but reverse Grignard reactions have been observed in very specific cases. The Grignard reagent exists as an organometallic cluster (in ether). === Chemistry === The disadvantage of Grignard reagents is that they readily react with protic solvents (such as water), or with functional groups with acidic protons, such as alcohols and amines. Atmospheric humidity can alter the yield of making a Grignard reagent from magnesium turnings and an alkyl halide. One of many methods used to exclude water from the reaction atmosphere is to flame-dry the reaction vessel to evaporate all moisture, which is then sealed to prevent moisture from returning. Chemists then use ultrasound to activate the surface of the magnesium so that it consumes any water present. This can allow Grignard reagents to form with less sensitivity to water being present. Another disadvantage of Grignard reagents is that they do not readily form carbon–carbon bonds by reacting with alkyl halides by an SN2 mechanism. ===Reaction mechanism=== The addition of the Grignard reagent to a carbonyl typically proceeds through a six-membered ring transition state. However, with steric hindered Grignard reagents, the reaction may proceed by single-electron transfer. Grignard reactions will not work if water is present; water causes the reagent to rapidly decompose. So, most Grignard reactions occur in solvents such as anhydrous diethyl ether or tetrahydrofuran (THF), because the oxygen in these solvents stabilizes the magnesium reagent. The reagent may also react with oxygen present in the atmosphere. This will insert an oxygen atom between the carbon base and the magnesium halide group. Usually, this side-reaction may be limited by the volatile solvent vapors displacing air above the reaction mixture. Chemists may perform the reactions in nitrogen or argon atmospheres. In small scale reactions, the solvent vapours do not have enough space to protect the magnesium from oxygen. ===Making a Grignard reagent=== Grignard reagents are formed by the action of an alkyl or aryl halide on magnesium metal. The reaction is conducted by adding the organic halide to a suspension of magnesium in an ether, which provides ligands required to stabilize the organomagnesium compound. Typical solvents are diethyl ether and tetrahydrofuran. Oxygen and protic solvents such as water or alcohols are not compatible with Grignard reagents. The reaction proceeds through single electron transfer.Garst, J. F.; Ungvary, F. \"Mechanism of Grignard reagent formation\". In Grignard Reagents; Richey, R. S., Ed.; John Wiley & Sons: New York, 2000; pp 185–275. .Advanced Organic chemistry Part B: Reactions and Synthesis F.A. Carey, R.J. Sundberg 2nd Ed. 1983 :R−X + Mg → R−X•− \\+ Mg•+ :R−X•− → R• \\+ X− :X− \\+ Mg•+ → XMg• :R• \\+ XMg• → RMgX Grignard reactions often start slowly. First, there is an induction period during which reactive magnesium becomes exposed to the organic reagents. After this induction period, the reactions can be highly exothermic. Alkyl and aryl bromides and iodides are common substrates. Chlorides are also used, but fluorides are generally unreactive, except with specially activated magnesium, such as Rieke magnesium. Many Grignard reagents, such as methylmagnesium chloride, phenylmagnesium bromide, and allylmagnesium bromide are available commercially in tetrahydrofuran or diethyl ether solutions. Using the Schlenk equilibrium, Grignard reagents form varying amounts of diorganomagnesium compounds (R = organic group, X = halide): :2 RMgX R2Mg + MgX2 ====Initiation==== Many methods have been developed to initiate Grignard reactions that are slow to start. These methods weaken the layer of MgO that covers the magnesium. They expose the magnesium to the organic halide to start the reaction that makes the Grignard reagent. Mechanical methods include crushing of the Mg pieces in situ, rapid stirring, or using ultrasound (sonication) of the suspension. Iodine, methyl iodide, and 1,2-dibromoethane are commonly employed activating agents. Chemists use 1,2-dibromoethane because its action can be monitored by the observation of bubbles of ethylene. Also, the side-products are innocuous: : Mg + BrC2H4Br → C2H4 \\+ MgBr2 The amount of Mg consumed by these activating agents is usually insignificant. The addition of a small amount of mercuric chloride will amalgamate the surface of the metal, allowing it to react. ====Industrial production==== Grignard reagents are produced in industry for use in place, or for sale. As with at bench-scale, the main problem is that of initiation. A portion of a previous batch of Grignard reagent is often used as the initiator. Grignard reactions are exothermic. ===Reactions of Grignard reagents=== ====Reactions with carbonyl compounds==== Grignard reagents will react with a variety of carbonyl derivatives. The most common application is for alkylation of aldehydes and ketones, as in this example: Note that the acetal function (a masked carbonyl) does not react. Such reactions usually involve a water-based acidic workup, though this is rarely shown in reaction schemes. In cases where the Grignard reagent is adding to a prochiral aldehyde or ketone, the Felkin-Anh model or Cram's Rule can usually predict which stereoisomer will form. ====Reactions with other electrophiles==== In addition, Grignard reagents will react with electrophiles. Another example is making salicylaldehyde (not shown above). First, bromoethane reacts with Mg in ether. Second, phenol in THF converts the phenol into Ar-OMgBr. Third, benzene is added in the presence of paraformaldehyde powder and triethylamine. Fourth, the mixture is distilled to remove the solvents. Next, 10% HCl is added. Salicylaldehyde will be the major product as long as everything is very dry and under inert conditions. The reaction works also with iodoethane instead of bromoethane.Wang, R. X et al. Synth. Commun. 1994, 24, 1757-1760.C. Ji ; Peters, D. G. Tetrahedron Letters, Volume 42, Issue 35, 27 August 2001, Pages 6065-6067 http://www.sciencedirect.com/science/article/pii/S0040403901011789Peters, D. G.; C. Ji. J. Chem. Educ., 2006, 83 (2), p 290 http://pubs.acs.org/doi/abs/10.1021/ed083p290 ====Formation of bonds to B, Si, P, Sn==== The Grignard reagent is very useful for forming carbon–heteroatom bonds. ====Carbon–carbon coupling reactions==== A Grignard reagent can also be involved in coupling reactions. For example, nonylmagnesium bromide reacts with methyl p-chlorobenzoate to give p-nonylbenzoic acid, in the presence of Tris(acetylacetonato)iron(III), often symbolized as Fe(acac)3, after workup with NaOH to hydrolyze the ester, shown as follows. Without the Fe(acac)3, the Grignard reagent would attack the ester group over the aryl halide. For the coupling of aryl halides with aryl Grignards, nickel chloride in tetrahydrofuran (THF) is also a good catalyst. Additionally, an effective catalyst for the couplings of alkyl halides is dilithium tetrachlorocuprate (Li2CuCl4), prepared by mixing lithium chloride (LiCl) and copper(II) chloride (CuCl2) in THF. The Kumada-Corriu coupling gives access to [substituted] styrenes. ====Oxidation==== The oxidation of a Grignard reagent with oxygen takes place through a radical intermediate to a magnesium hydroperoxide. Hydrolysis of this complex yields hydroperoxides and reduction with an additional equivalent of Grignard reagent gives an alcohol. \\begin{array}{l} \\mathsf{R{-}MgX} \\quad + \\quad \\mathsf{O2} \\quad \\longrightarrow \\quad {\\color{Red}\\mathsf{ R^\\bull + O_2^{\\bull{-}}}} \\quad + \\quad \\mathsf{MgX^+} \\longrightarrow & \\mathsf{R{-}O{-}O{-}MgX} & \\+ \\quad \\mathsf{H_3O^+} & \\longrightarrow \\quad \\mathsf{R{-}O{-}O{-}H} & \\+ \\quad \\mathsf{HO{-}MgX + H^+} \\\\\\ & \\quad \\ \\ \\Bigg\\downarrow \\mathsf{R{-}MgX} \\\\\\ & \\mathsf{R{-}O{-}MgX} & \\+ \\quad \\mathsf{H_3O^+} & \\longrightarrow \\quad \\mathsf{R{-}O{-}H} & \\+ \\quad \\mathsf{HO{-}MgX + H^+} \\end{array} A reaction of Grignards with oxygen in presence of an alkene makes an ethylene extended alcohol. These are useful in synthesizing larger compounds. This modification requires aryl or vinyl Grignard reagents. Adding just the Grignard and the alkene does not result in a reaction, showing that the presence of oxygen is essential. The only drawback is the requirement of at least two equivalents of Grignard reagent in the reaction. This can addressed by using a dual Grignard system with a cheap reducing Grignard reagent such as n-butylmagnesium bromide. ====Nucleophilic aliphatic substitution==== Grignard reagents are nucleophiles in nucleophilic aliphatic substitutions for instance with alkyl halides in a key step in industrial Naproxen production: ====Elimination==== In the Boord olefin synthesis, the addition of magnesium to certain β-haloethers results in an elimination reaction to the alkene. This reaction can limit the utility of Grignard reactions. ===Grignard degradation=== Grignard degradation at one time was a tool in structure identification (elucidation) in which a Grignard RMgBr formed from a heteroaryl bromide HetBr reacts with water to Het-H (bromine replaced by a hydrogen atom) and MgBrOH. This hydrolysis method allows the determination of the number of halogen atoms in an organic compound. In modern usage, Grignard degradation is used in the chemical analysis of certain triacylglycerols. ===Industrial use=== An example of the Grignard reaction is a key step in the industrial production of Tamoxifen. (Tamoxifen is currently used for the treatment of estrogen receptor positive breast cancer): ==Gallery== File:Grignard reaction experiment 01.jpg|Magnesium turnings placed on a flask. File:Grignard reaction experiment 02.jpg|Covered with THF and a small piece of iodine added. File:Grignard reaction experiment 03.jpg|A solution of alkyl bromide was added while heating. File:Grignard reaction experiment 04.jpg|After completion of the addition, the mixture was heated for a while. File:Grignard reaction experiment 05.jpg|Formation of the Grignard reagent had completed. A small amount of magnesium still remained in the flask. File:Grignard reaction experiment 06.jpg|The Grignard reagent thus prepared was cooled to before the addition of carbonyl compound. The solution became cloudy since the Grignard reagent precipitated out. File:Grignard reaction experiment 07.jpg|A solution of carbonyl compound was added to the Grignard reagent. File:Grignard reaction experiment 08.jpg|The solution was warmed to room temperature. The reaction was complete. ==Related pages== * Wittig reaction * Barbier reaction * Bodroux-Chichibabin aldehyde synthesis * Fujimoto-Belleau reaction * Organolithium reagents * Sakurai reaction ==References== ==Further reading== * *Grignard knowledge: Alkyl coupling chemistry with inexpensive transition metals by Larry J. Westrum, Fine Chemistry November/December 2002, pp. 10–13 Category:Organometallic chemistry Category:Name reactions Category:Magnesium",
 "title": "Grignard reaction"
}