{
 "id": "306812",
 "text": "Economic boom is a phase when the economy has a huge increase. It is a natural cycle. The United States of America had an essential supply of natural resources such as timber, iron, coal, minerals, oil and land. Immigrants provided a plentiful and cheap work force to utilise these resources. This enabled America to become a huge economic power at the beginning of the 20th century. These resources were an important foundation for the economy. Whilst European economies suffered during the First World War, the USA experienced significant growth. US banks loaned money to Europe and businesses sold much needed goods. The war also provided a stimulus for inventions in production, materials and advertising. Immediately after the war there was a small slump but from 1922 the USA experienced an unprecedented economic boom. Electricity developed slowly before the war but during the 1920s the electricity industry experienced a huge boom. By 1929 the majority of houses in America had electricity and 70 per cent of them used it for lighting purposes. As a result of the development of factories to produce consumer goods for the American people, the demand for electricity doubled. Electrical power was introduced in factories to drive machinery, and thus it became possible to introduce mass production to a number of factories, e.g. refrigerators, washing machines, vacuum cleaners and radio sets. The car industry is the best example of mass production during the period. Henry Ford was a pioneer with his idea of producing affordable cars for the people of America. He set about realising his dream by producing his early cars in small workshops. He had groups of men working for him and gradually the cars were built. Henry Ford and his son posing in the model F Ford car in 1905. Henry Ford and his son posing in the model F Ford car in 1905 Henry Ford's hard work bore fruit. As he produced more and more cars, he could reduce his prices. By 1925 the price of a car was around $290, which was much cheaper than the price of $850 in 1908. Henry Ford was of the opinion that it was better to sell more cars for a small profit, as that meant employing more workers. By 1929 Americans owned 23 million cars. The workers earned good wages ($5 per day), thousands of jobs were created, roads were built, petrol stations were built, as were hotels and restaurants. Therefore, the entire economy was given a substantial boost due to the car industry. In order to help American people to purchase the new goods that were available, systems of hire-purchase and credit were introduced. This meant that a person could buy something by paying for it on a monthly basis. As a result, the majority of Americans could afford expensive goods. In order to encourage Americans to take advantage of the scheme, advertisements were placed on roadsides, on the radio, in newspapers and in cinemas. During the same period, chain stores appeared for the first time, e.g. J P Penney. Catalogue shopping also became fashionable as it was a convenient way of buying goods. Category:Economics",
 "title": "Economic boom"
}