{
 "id": "306805",
 "text": "The Ohio State Senate is the upper house of the Ohio General Assembly. There are 33 State Senators. The state legislature meets in the Ohio Statehouse in Columbus, Ohio. The President of the Senate presides over the body when in session. He is currently Matt Huffman. The Senate is currently controlled by the Republican Party. Senators serve four year terms. The terms of the Senators are staggered so that about half the membership is elected every two years. The Senators representing the even-numbered districts are elected in years evenly divisible by four. The Senators from the odd-numbered districts are elected in even-numbered years not divisible by four. Senators are limited to two terms. Each Senator represents approximately 330,000 Ohioans. Each Senate District covers three Ohio House districts. == Composition == :134th General Assembly (2021-2022) Party (Shading indicates majority caucus) Total Vacant Democratic Republican End of previous Assembly 9 24 33 0 Begin (January 4, 2021) 8 25 33 0 Latest voting share 24.2% 75.8% ===Leadership=== Presiding President of the Senate Matt Huffman President Pro Tempore Jay Hottinger Majority Leadership Majority Floor Leader Kirk Schuring Majority Whip Rob McColley Minority Leadership Minority Leader Kenny Yuko Assistant Minority Leader Cecil Thomas Minority Whip Nickie Antonio Assistant Minority Whip Tina Maharath Other Officers Clerk: According to the Rules of the Senate, the Clerk is elected by the members of the Senate and is tasked with maintaining records of all Senate bills and resolutions. The Clerk is also responsible for handling all documents received from other government departments. ===Members of the 133rd Senate=== District Senator Party Residence Counties represented Term Limited First Elected 1 Rob McColley Republican Napoleon Auglaize, Defiance, Fulton, Hancock, Hardin, Henry, Paulding, Putnam, Van Wert, Williams 2026 2017* 2 Republican Bowling Green Erie, Fulton, Lucas, Ottawa, Wood 2028 2019* 3 Tina Maharath Democratic Canal Winchester Franklin 2026 2018 4 George Lang Republican West Chester Butler 2028 2020 5 Steve Huffman Republican Tipp City Darke, Miami, Montgomery, Preble 2026 2018 6 Niraj Antani Republican Miamisburg Montgomery 2028 2020 7 Steve Wilson Republican Maineville Butler, Hamilton, Warren 2026 2017* 8 Louis Blessing Republican Colerain Township Hamilton 2028 2019* 9 Democratic Cincinnati Hamilton 2022 2014 10 Republican London Clark, Greene, Madison 2024 2016* 11 Theresa Fedor Democratic Toledo Lucas 2026 2018 12 Republican Lima Allen, Auglaize, Champaign, Darke, Logan, Mercer, Shelby 2024 2016 13 Nathan Manning Republican North Ridgeville Huron, Lorain 2026 2018 14 Terry Johnson Republican McDermott Adams, Brown, Clermont, Lawrence, Scioto 2028 2019* 15 Hearcel Craig Democratic Columbus Franklin 2026 2018 16 Stephanie Kunzie Republican Columbus Franklin 2024 2016 17 Republican Jasper Township Clinton, Fayette, Gallia, Highland, Jackson, Pickaway, Pike, Ross, Lawrence, Vinton 2022 2012* 18 Jerry Cirino Republican Kirtland Geauga, Lake, Portage 2028 2020 19 Andrew Brenner Republican Powell Delaware, Franklin, Knox 2026 2018 20 Tim Schaffer Republican Lancaster Athens, Fairfield, Guernsey, Hocking, Morgan, Muskingum, Pickaway 2028 2018* 21 Democratic Cleveland Cuyahoga 2022 2014 22 Mark Romanchuk Republican Ontario Ashland, Holmes, Medina, Richland 2028 2020 23 Nickie Antonio Democratic Lakewood Cuyahoga 2026 2018 24 Republican Chagrin Falls Cuyahoga 2024 2016 25 Democratic Richmond Heights Cuyahoga, Lake 2022 2014 26 Bill Reineke Republican Eden Township Crawford, Marion, Morrow, Sandusky, Seneca, Union, Wyandot 2028 2020 27 Kristina Roegner Republican Hudson Stark, Summit, Wayne 2026 2018 28 Democratic Akron Summit 2024 2016 29 Kirk Schuring Republican Canton Stark 2026 2018 30 Republican Adena Athens, Belmont, Carroll, Harrison, Jefferson, Meigs, Monroe, Noble, Vinton, Washington 2024 2016 31 Republican Newark Coshocton, Holmes, Licking, Perry, Tuscarawas 2022 2014 32 Sandra O'Brien Republican Rome Ashtabula, Geauga, Trumbull 2028 2020 33 Michael Rulli Republican Salem Columbiana, Mahoning 2026 2018 ==References== ==Other websites== *Ohio Senate official website *Project Vote Smart - State Senate of Ohio *Map of Ohio Senate districts *2006 Election Results from Ohio Secretary of State *2004 Election Results from Ohio Secretary of State *Reclaim Ohio - A Detailed Site About Ohio State House / Senate Election Results Category:Government of Ohio Category:State upper houses in the United States",
 "title": "Ohio Senate"
}