{
 "id": "307181",
 "text": "The Adaptive Combat Rifle (ACR) is a modular assault rifle, designed by Magpul Industries of Erie, Colorado, and known initially as the Masada. In late January 2008, Bushmaster made a licensing agreement with Magpul. In this agreement, Bushmaster would take over the production, development and sales of the ACR.Bushmaster press release: Bushmaster and Magpul Team to Bring Advanced Rifle to Market Bushmaster Firearms, with the help from Remington Arms (a sister company) has made many design changes to the ACR. These were made to meet what the U.S. military requirements. The Remington ACR which is intended for the military market is capable of fully automatic fire. Bushmaster offers a semi-automatic only ACR for the civilian market. Bushmaster says that they will soon have conversion kits which can change the caliber of the rifle. ==History== The United States army was looking for a replacement to their M4 carbine. Remington Arms was part of the Army's Individual Carbine competition, and offered a modified ACR that fits the requirements. The Masada was developed over the course of five months. It was supposed to replace the M16 rifle completely. It was supposed to do this without any fundings from the government. Prototypes were shown at the 2007 SHOT Show in Orlando, Florida. It was supposed to be released some time in 2008. However, Bushmaster said on May 16, 2008 took over production and said that the ACR would not be released to the public until 2009. This was due to Bushmaster being focused more towards military projects. On November 18, 2008, Bushmaster released a statement saying, \"The ACR is being redesigned to become a superior offering to compete for the next generation U.S. Army infantry carbine and subcompact weapon requirement and will be available to selected customers in 2009.\"AR.15.com Bushmaster Industry Forum November 18, 2008 \"ACR UPDATE 11/18/2008\" http://www.ar15.com/forums/topic.html?b=2&f;=28&t;=165873 The ACR was one of the weapons shown to the U.S. Army during an Industry Day on November 13, 2008. This Industry Day happened so that modern carbines could be looked at before it was decided what the weapon that would replace the M4 Carbine had to be like. ===Sale and recall=== On October 15, 2010, Bushmaster issued a recall of all ACR rifles, instructing users to \"Please immediately discontinue the use of your ACR rifle\" along with instructions to contact customer support for an RMA. Bushmaster stated that the recall was issued due to \"a possible firearms performance issue that may develop with a small number of ACR rifles\" and goes on to state that \"Bushmaster discovered a design flaw which could result in multiple rounds firing continuously when the trigger is pulled\". Bushmaster has stated that it will cover all of the costs associated with repairs to recalled rifles. ==Design== The first design is many recent rifle designs combined. Its designers say that it takes the best parts of each and puts them into a light, modular rifle. Some features from the Armalite AR-18, the FN SCAR, the Heckler & Koch G36/XM8, the M16/AR-15, and the M16 can be seen clearly. The cyclic rate of fire is around 650–700 rounds per minute. The ACR can easily swap caliber by changing the bolt head, magazine and barrel. The ACR is available in multiple barrel lengths; 8.25″, 10.5″, 14.5″, 16.5″ and 18.5″ barrels. For the 5.56mm configuration, it uses a 30-round Magpul PMag, though it is also compatible with STANAG magazines. Magpul claims that PMags are much more difficult to break or damage than other magazines, and is also compatible to other rifle families like the M16 rifle family. The ACR was engineered to still function reliably even if it was exposed to sand, dirt, mud and water. ==Users== * - Służba Wywiadu Wojskowego. ==References== ==Other websites== * Official ACR page by Bushmaster Firearms * Magpul Industries Category:Assault rifles Category:5.56 mm firearms Category:Automatic rifles Category:Battle rifles",
 "title": "Remington ACR"
}