{
 "id": "307468",
 "text": "\"Dondequiera Que Estés\" () is a single released by Selena with a duet with the Barrio Boyzz. The song was a major hit in 1994, staying at #1 for 6 weeks on top of the Hot Latin Tracks chart. ==Song information== The song was first released on the Barrio Boyzz album Donde Quiera Que Estes in 1993 and was never included on the Amor Prohibido album at the time of the release, but was then included on the reissued version of Amor Prohibido in 2002 and also included on Selena's greatest hits collection Ones. ==Music video== The music video for \"Dondequiera Que Estés\" was shot entirely in New York City. The video consisted of Selena and the Barrio Boyzz performing choreographed dancing. == Legacy == === Awards === Year Awards ceremony Award Results 1994 Tejano Music Awards Vocal Duo Of the Year 1995 Tejano Music Awards Single of The Year Tejano Music Awards Song of The Year Tejano Music Awards Vocal Duo Of the Year 1996 Tejano Music Awards Vocal Duo Of the Year Tejano Music Awards Song of The Year === Certifications === Country Format Certifications (sales thresholds) Sales Mexico (AMPROFON) Digital Track Gold 1,500+ Spain (PROMUSICAE) Single Gold 20,000+ Argentina (CAPIF) Digital Downloads Gold 10,000+ === Charts === Chart (1994) Peak position US Hot Latin Tracks (Billboard) 1 US Latin Pop Airplay (Billboard) 1 Chart (1995) Position US Rhythmic Top 40 (Billboard) 36 US Hot Latin Tracks (Billboard) 4 US Latin Pop Airplay (Billboard) 17 Canadian Hot 100 89 Spanish Top 50 Songs 2 SP Airplay Chart 4 == Track listing == *U.S. 12\" Vinyl (1994)EMI Telvisia (1994) _Selena/Barrio Boyzz – Donde Quiera Que Estes – Single – (Liner Notes)_ EMI Records # \"Donde Quiera Que Estes\" – 4:25 *Mexico Promo Single (1994)EMI Mexico (1994) _Selena/Barrio Boyzz – Donde Quiera Que Estes – Mexico CD Single – (Liner Notes)_ EMI Records # \"Donde Quiera Que Estes\" – 4:25 *Mexico Promo Cassette (1994)EMI Mexico (1995) _Selena/Barrio Boyzz – Donde Quiera Que Estes – Mexico Cassette (Liner Notes)_ EMI Records # \"Donde Quiera Que Estes\" – 4:25 # \"Donde Quiera Que Estes (Radio Edit)\" – 4:15 *Spain Promo Single (1995)EMI Latin (1995) _Selena/Barrio Boyzz – Donde Quiera Que Estes – Spain Single (Liner Notes)_ EMI Records # \"Donde Quiera Que Estes\" – 4:25 *Mexico Digital Download (2002) # \"Donde Quiera Que Estes\" – 4:25 *Argentina Digital Download (2002) # \"Donde Quiera Que Estes\" – 4:25 ==References== ==Other websites== *\"Donde Quiera Que Estés\" (Music Video) at YouTube Category:1994 songs Category:Selena songs Category:Songs in Spanish",
 "title": "Donde Quiera Que Estés"
}