{
 "id": "307558",
 "text": "The Wii U ( ) is a video game console that was released by Nintendo on November 18, 2012, and is the successor to the Wii. The video game machine, or console, was first shown in Nintendo's press conference at the Electronic Entertainment Expo 2011 on June 7, 2011, and was released for sale on November 18, 2012 in North America; November 30, 2012 in Europe and Australia; and December 8, 2012 in Japan.http://www.metro.co.uk/tech/games/888470-wii-u- confirmed-for-europe-this-year Wii U confirmed for Europe this year The system has been described as a part of the eighth generation of video game consoles. The Wii U is Nintendo's sixth home video game console and their first to use 1080p high-definition graphics. The Wii U has a new controller with a touchscreen, which allows the player to continue playing a game by showing the game even when the television is off. Wii games work on the Wii U, and Wii U games can be played with Wii controllers and extras, such as the Wii Remote, Wii MotionPlus, Wii Balance Board, and the Classic Controller. It also has a controller shaped like the Xbox 360 controller, called the Wii U Pro Controller. Nintendo GameCube games and controllers will not work on the Wii U without the adapter used for Super Smash Bros. for Wii U. However, it only works for that game. Like on the Wii and Nintendo 3DS, players can create Miis. The best-selling games for the system included Mario Kart 8, New Super Mario Bros. U, Nintendo Land, and Splatoon. The Wii U received positive reviews, but did not sell well. It had to deal with the confusion that the Gamepad was a Wii accessory, but it really is an advanced controller. The Wii U sold 13.56 million units, which makes it one of the lowest-selling Nintendo consoles, beating only the Virtual Boy. ==Hardware== The main controller that was used by the Wii U was the Wii U Gamepad. The controller had a screen that was wide. People can use the Gamepad in many different ways. For example, people can play games on a television like a normal controller, or play on the Gamepad without the television being on. ==Related pages== *Wii *Nintendo ==References== Category:Nintendo video game consoles",
 "title": "Wii U"
}