{
 "id": "307899",
 "text": "A fricative consonant is a consonant that is made when you squeeze air through a small hole or gap in your mouth. For example, the gaps between your teeth can make fricative consonants; when these gaps are used, the fricatives are called sibilants. Some examples of sibilants in English are , , , and . English has a fairly large number of fricatives, and it has both voiced and voiceless fricatives. Its voiceless fricatives are [s], , [f], and [θ], and its voiced fricatives are [z], [ʒ], [v], and [ð] ==Sibilant fricatives== This is a list of sibilant fricatives. * voiceless coronal sibilant, as in English sip * voiced coronal sibilant, as in English zip * voiceless palat-alveolar sibilant (domed, partially palatalized), as in English ship * voiced palat- alveolar sibilant (domed, partially palatalized), as the s in English vision * voiceless alveolo-palatal sibilant (laminal, palatalized) * voiced alveo- palatal sibilant (laminal, palatalized) * voiceless retroflex sibilant (apical or subapical) * voiced retroflex sibilant (apical or subapical) ==Non-sibilant fricatives== * voiceless bilabial fricative * voiced bilabial fricative * voiceless labiodental fricative, as in English fine * voiced labiodental fricative, as in English vine * voiceless dental fricative, as in English thing * voiced dental fricative, as in English that * voiced alveolar fricative trill * voiceless palatal fricative * voiced palatal fricative * voiceless velar fricative * voiced velar fricative * voiceless palatal-velar fricative * voiceless uvular fricative * voiced uvular fricative * voiceless pharyngeal fricative * voiced pharyngeal fricative * voiceless epiglottal fricative * voiced epiglottal fricative ==Lateral fricatives== * voiceless coronal lateral fricative * voiced coronal lateral fricative ==Pseudo- fricatives== * voiceless glottal transition, as in English hat * breathy- voiced glottal transition In many languages, such as English, the glottal \"fricatives,\" like the in English \"hat\", are not really fricatives because throughout the length of time it takes to produce this speech sound, the state of the gaps or holes in your mouth remains unchanged, without being joined by any manner, fricative or otherwise. They may be mistaken for real glottal constriction in a number of languages, such as Finnish. ==Sources== * ==References== == Other websites == * Fricatives in English Category:Consonants",
 "title": "Fricative consonant"
}