{
 "id": "308227",
 "text": "Alexander Ivanovich Oparin ; in English, Aleksander Ivanovich Oparin. Britannica Encyclopedia - Aleksandr Oparin (Uglich, Russia, – Moscow, 21 April 1980) was a Soviet biochemist. He was notable for his ideas on the origin of life, and for writing an early book The Origin of Life.Oparin A I. The Origin of Life. Moscow: Moscow Worker publisher, 1924 (in Russian) One of his ideas was that oxygen would tend to destroy organic molecules essential for the evolution of early life. It was later found that the earth's atmosphere at first had almost no oxygen in it.Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton, N.J. Schopf J.W. 1992. Geology and paleobiology of the Archean Earth, in Schopf J.W., and Klein C. The Proterozoic biosphere: a multidisciplinary study. Cambridge University Press. He also studied the biochemistry of plants, and enzyme reactions in plant cells. He developed the foundations for industrial biochemistry in the USSR.Great Soviet Encyclopedia, 3rd edition, entry on \"Опарин\", available online here == His theory == These were some of the main ideas in his first book: 1\\. There is no fundamental difference between a living organism and lifeless matter. Life must have arisen as a natural evolution of matter. 2\\. Methane is in the atmospheres of Jupiter and the other giant planets. Oparin thought the infant Earth had a strongly reducing atmosphere, containing methane, ammonia, hydrogen, and water vapor. In his opinion, these were the raw materials for the evolution of life. 3\\. At first there were the simple solutions of organic substances. Their behaviour was governed by their atoms and by the arrangement of those atoms in molecules. Gradually, as the result of the growth and increased complexity of the molecules, structures with new properties developed. These newer properties were determined by the spatial and mutual arrangement of the molecules. 4\\. In this process biological orderliness already exists. Competition, speed of cell growth, survival of the fittest, struggle for existence and, finally natural selection produced the characteristics of living things. Oparin outlined a way in which basic organic chemicals might form into microscopic localized systems. These would be precursors of the cell from which primitive living things could develop. He cited work done with organic chemicals which, in solution, form droplets and layers. Oparin suggested that different types might have formed in the Earth's primordial ocean. They were subject to a selection process leading eventually to life. == Bibliography == * Oparin A.I. 1924. The origin of life. Moscow: Moscow Worker, (in Russian). ** English translation: Oparin A.I. The origin and development of life. (NASA TTF-488) Washington: D.C.L GPO, 1968. *Oparin A.I. 1924. The origin of life, 2nd edition. Moscow. **English translation of 2nd ed: The origin of life. 1938, reprinted Dover 1952. * Oparin A. & Fesenkov V. Life in the Universe. Moscow: USSR Academy of Sciences publisher, 3rd edition, 1956 (in Russian) ** English translation: Oparin A. and V. Fesenkov. Life in the Universe. New York: Twayne Publishers 1961. == Related pages == *Miller–Urey experiment *Origin of life *Abiogenesis == References == Category:Russian chemists Category:1894 births Category:1980 deaths Category:Biochemists",
 "title": "Alexander Oparin"
}