{
 "id": "3082",
 "text": "Tottenham Hotspur Football Club is an English football club. The club plays in the Premier League. Their current stadium is The Tottenham Hotspur Stadium in north London. The captain of Tottenham Hotspur is Son Heung-min and vice- captains are Cristian Romero and James Maddison. The club's nicknames include 'Spurs' and 'The Lilywhites'. Famous Tottenham Hotspur players include Pat Jennings, Paul Gascoigne, Glenn Hoddle, Dave Mackay, Gary Lineker, Danny Blanchflower, Teddy Sheringham and Jimmy Greaves. They have many rivals in London, but their most famous rivals are Arsenal (which they play in the North London Derby). Chelsea are widely regarded as Tottenham's second biggest rival. Tottenham were the first winners of the UEFA Cup tournament, and the first team in the 20th century to achieve the league and cup double. In the 2016–17 Premier League, they finished in 2nd position and earned a place in the European Champions League. They reached the Champions League Final in the 2018–2019 season but ultimately lost 0–2 to Liverpool. There is also a Tottenham Hotspur women's football club. ==First-team squad== == Name == *1882–1884 Hotspur F.C. *1884–present Tottenham Hotspur F.C. == Directors == Role Name Executive chairman Daniel Levy Operations and finance director Matthew Collecott Executive director Donna-Maria Cullen Chief commercial officer Vacant Chief football officer Scott Munn Director of football administration and governance Rebecca Caplehorn Non-executive director Jonathan Turner == League position == Season League Position 2000/01 Premier League 12th 2001/02 Premier League 9th 2002/03 Premier League 10th 2003/04 Premier League 14th 2004/05 Premier League 9th 2005/06 Premier League 5th 2006/07 Premier League 5th 2007/08 Premier League 11th 2008/09 Premier League 8th 2009/10 Premier League 4th 2010/11 Premier League 5th 2011/12 Premier League 4th 2012/13 Premier League 5th 2013/14 Premier League 6th 2014/15 Premier League 5th 2015/16 Premier League 3rd 2016/17 Premier League 2nd 2017/18 Premier League 3rd 2018/19 Premier League 4th 2019/20 Premier League 6th 2020/21 Premier League 7th 2021/22 Premier League 4th == References == Category:1882 establishments in England Category:Premier League clubs",
 "title": "Tottenham Hotspur F.C."
}