{
 "id": "308339",
 "text": "Windows 8 is a version of the Windows computer operating system, which was published by Microsoft. Windows 8 was released everywhere on October 26, 2012. The president of the Windows Division, Steven Sinofsky, said: \"With this system we shall make the biggest change from Windows 95\". Microsoft removed the \"Start\" button and designed a new tile-based user interface to replace the \"Start\" menu (which first appeared in Windows 95). Microsoft unsupported Windows 8 from January 12, 2016, and users will upgrade Windows 8.1 after it was discontinued on January 10, 2023. Several versions of Windows 8 were made available to software developers well before the final release. The first of these, the Developer Preview, came out in September 2011. On February 29, 2012, Microsoft released a beta version of Windows 8.0 known as the Consumer Preview. Anyone could register online to download this version for free. After the Consumer Preview, a final preview named \"Release Preview\" was released on May 31, 2012. On October 26, 2012, Windows 8 became available to the general public. Windows 8 received negative reviews. Microsoft also released a version called Windows RT, which was adapted for devices using ARM processors. Windows RT could not run most Windows applications.http://blogs.windows.com/windows/b/bloggingwindows/archive/2012/07/18/windows-8-will- be-available-on.aspx On the same day, Microsoft also put new devices running Windows 8, including its newly-created Surface tablets up for sale in stores and online. An update for Windows 8 was released on October 17, 2013, and it is called Windows 8.1. Windows 8.1 returns the normal \"Start\" button to the taskbar. During development, Windows 8.1 was known as \"Blue\". Windows 10 was made to replace Windows 8 and 8.1, and it came out on July 29, 2015. Users who owned Windows 7 with Service Pack 1 installed, or Windows 8.1, were able to upgrade to Windows 10 for free until July 29, 2016. As of August 2023, Windows 8 (i.e. 8.0) was used by 0.35% of PCs; with Windows 8.1, at 1% of PCs. == Features == One new feature in Windows 8 was the Windows Store. The Windows Store lets users buy new computer programs, or download them for free. Windows 8 added a new graphic user interface called \"Modern\" (also called Metro). Modern is meant to be suitable for smartphones, tablets, notebooks, and desktop computers. This interface shows “tiles”, which work as links and also as interactive widgets (tools you can look at, like RSS feeds, weather, e-mails). The Modern interface is best used with a touchscreen, but can be controlled by a mouse or keyboard. Windows 8 still offers the classic desktop interface through the \"Desktop\" tile. Microsoft reworked the booting process, replacing the classic BIOS with a new system called UEFI. This provides Secure Boot, a feature that only lets the computer start by using software its manufacturer has allowed. Windows To Go allows users to run the complete Windows system from a USB drive. Although Windows 8 is faster than Windows 7, it demands more pixels on the screen. The minimum is 1366 x 768 pixels, which affects many laptops that have a maximum resolution of 1024 x 600 pixels. Some users with older hardware have continued to use Windows 7 for this reason. Windows 8 will work on resolutions lower than this, but some of its features will be unavailable. File Explorer, formerly called Windows Explorer, has a new ribbon bar interface. It can stop and restart a file transfer, and makes it easier to save files that have the same name. Windows 8 lets users log in using face detection, voice control, or hand gestures using a camera. ==Hardware requirements== ===PCs=== Minimum hardware requirements for Windows 8 Criteria Minimum Recommended Processor 1 GHz clock rate IA-32 or x64 architecture Support for PAE, NX and SSE2 x64 architecture Second Level Address Translation (SLAT) support Memory (RAM) IA-32 edition: 1 GB x64 edition: 2 GB 4 GB Graphics Card DirectX 9 graphics device WDDM 1.0 or higher driver DirectX 10 graphics device Display screen 1024×768 pixels 1366×768 pixels Input device Keyboard and mouse A multi-touch display screen Hard disk space IA-32 edition: 16 GB x64 edition: 20 GB Other USB 3.0 port UEFI v2.3.1 Errata B with Microsoft Windows Certification Authority in its database Trusted Platform Module (TPM) Internet connectivity ===Tablets and convertibles=== Hardware certification requirements for Windows tablets Graphics Card DirectX 9 graphics device with WDDM 1.2 or higher driver Storage 10 GB free space, after the out-of-box experience completes Standard buttons 'Power', 'Rotation lock', 'Windows Key', 'Volume-up', 'Volume-down' Screen Touch screen supporting a minimum of 5-point digitizers and resolution of at least 1366x768. The physical dimensions of the display panel must match the aspect ratio of the native resolution. The native resolution of the panel can be greater than 1366 (horizontally) and 768 (vertically). The minimum native color depth is 32-bits. Camera Minimum 720p Ambient light sensor 1–30k lux (measure of brightness) capable with the dynamic range of 5–60k Accelerometer 3 axes with data rates at or above 50 Hz USB At least one controller and exposed port. Connect Wi-Fi and Bluetooth 4.0 + LE (low energy) Other Speaker, microphone, magnetometer and gyroscope. If a mobile broadband device is integrated into a tablet or convertible system, then an assisted GPS radio is required. Devices supporting near field communication need to have visual marks to help users locate and use the proximity technology. The new button combination for Ctrl + Alt + Del is Windows Key + Power. ==Windows 8.1== Two months after Windows 8 was released, there were rumors that Microsoft was making a major update to be code-named \"Blue\". In May 2013, Microsoft announced that \"Windows Blue\" was going to be called \"Windows 8.1\". On June 26, 2013, Microsoft released build 9431 as the Windows 8.1 Preview, which could be downloaded. On August 14, 2013, Microsoft announced that Windows 8.1 would be released digitally on October 17, and released in stores and in new computers on October 18. It included greater customization, and new Modern apps, such as a calculator, sound recorder, and file manager. In April 2014, Microsoft released an update for Windows 8.1 with improvements for keyboard and mouse users. This update pins the Windows Store to the taskbar by default. Each Modern app has a bar at the top and can be closed the same way desktop apps are closed. ==References== ==Sources== *Windows 8 news microsoft.com *Computer Magazine *Technet.cz *Microsoft Windows 8 preview microsoft.com *Windows 8 system requirements microsoft.com Category:Microsoft operating systems",
 "title": "Windows 8"
}