{
 "id": "308730",
 "text": "Josip Nikolai Peruzović (also called Nikolai Volkoff, born 14 October 1947 - 29 July 2018) better known by his ring name Nikolai Volkoff. He was a Yugoslavian professional wrestler who was best known for wrestling with World Wrestling Federation. Although the character he played was portrayed as Russian, he actually came from Croatia and has a mixed background that was not entirely Russian. He was inducted into the WWE Hall of Fame in 2005 by Jim Ross. Volkoff died on July 29, 2018 at the age of 70 just days after being released from a hospital in Glen Arm, Maryland where he had been treated for dehydration. ==Championships== Volkoff held many championships during his professional wrestling career: *Championship Wrestling from Florida **NWA Florida Tag Team Championship (one time) - with Ivan Koloff *Georgia Championship Wrestling **NWA Georgia Heavyweight Championship (one time) *Mid- Atlantic Championship Wrestling **NWA Mid-Atlantic Tag Team Championship (one time) - with Chris Markoff *Mid-South Wrestling **Mid-South North American Championship (one time) *Northeast Championship Wrestling (Tom Janette) **NCW Heavyweight Championship (one time) *NWA Detroit **NWA World Tag Team Championship (Detroit version) (one time) - with Boris Volkoff *Pro Wrestling Illustrated **He was ranked as #136 of the 500 best singles wrestlers during the \"PWI Years\" in 2003. **He was ranked as #96 of the 100 best tag teams of the \"PWI Years\" with the Iron Sheik in 2003. *Universal Wrestling Association **UWA Heavyweight Championship (one time) *World Wide Wrestling Alliance **WWWA Heavyweight Championship (one time) *World Wide Wrestling Federation/World Wrestling Federation/World Wrestling Entertainment **WWF Tag Team Championship (one time) - with Iron Sheik **WWWF International Tag Team Championship (three times) - with Geto Mongol (two) and Johnny De Fazio (one) **Slammy Award for Most Ignominious (1986) **Slammy Award for Best Personal Hygiene (1987) (with Boris Zhukov and Slick) **WWE Hall of Fame (Class of 2005) *World Wrestling Association **WWA World Tag Team Championship (two times) - with Angelo Poffo (one) and Boris Volkoff (one) *World Wrestling Association (Larry Sharpe) **WWA Heavyweight Championship (one time) ==References== ==Other websites== *Nikolai Volkoff's WWE Hall of Fame profile Category:1947 births Category:Croatian sportspeople Category:Former WWE wrestlers Category:2018 deaths Category:Professional wrestlers Category:WWE Hall of Fame Category:Yugoslavian sportspeople",
 "title": "Nikolai Volkoff"
}