{
 "id": "308828",
 "text": "Lo Nuestro is an awards show for Latin music. It is produced by television network Univision. The awards began in 1989. Artists with awards are Celia Cruz, Gloria Estefan, Juan Gabriel, Juanes, Luis Miguel, Maná, RBD, Selena, Shakira and Thalía. The artist with the most Premios Lo Nuestro awards is Puerto Rican singer Olga Tañón. ==Premio Lo Nuestro host cities== Year Date Host city Venue Lifetime Achievement Award Host(s) 2003 February 6 Miami, Florida James L. Knight Center Luis Miguel Marco Antonio Regil Adal Ramones 2004 February 26 Miami Arena Ricky Martin Adal Ramones 2005 February 24 American Airlines Arena Los Temerarios Eugenio Derbez 2006 February 23 Ana Gabriel René Strickler Patricia Manterola 2007 February 22 Juan Luis Guerra Cristián de la Fuente Ninel Conde 2008 February 21 Vicente Fernández Pedro Fernández Patricia Navidad 2009 March 26 Coral Gables, Florida BankUnited Center Emmanuel Eugenio Derbez Ninel Conde 2010 February 18 Miami, Florida American Airlines Arena Chayanne Ana Bárbara Víctor Manuelle 2011 February 17 Maná Angélica Vale Jaime Camil 2012 February 16 Pepe Aguilar Jacqueline Bracamontes Eduardo Santamarina ==Premio Lo Nuestro a la Excelencia== In addition to categories for different genres of music, the honors include \"Premio Lo Nuestro a la Excelencia\", (literally, The \"Ours\" award for Excellence), a career or lifetime achievement award. The following list are past years recipients. *1990: Celia Cruz *1991: Juan Gabriel and Plácido Domingo *1992: Gloria Estefan *1993: Armando Manzanero *1994: Emilio Estefan *1995: Julio Iglesias *1996: Marco Antonio Solís *1997: Mariachi Vargas de Tecalitlán *1998: Los Panchos *1999: Los Tigres del Norte *2000: Antonio Aguilar *2001: Joan Sebastian *2002: José José *2003: Luis Miguel *2004: Ricky Martin *2005: Los Temerarios *2006: Ana Gabriel *2007: Juan Luis Guerra *2008: Vicente Fernández *2009: Emmanuel *2010: Chayanne *2011: Maná *2012: Pepe Aguilar ==Other websites== *Official website Category:Music awards",
 "title": "Premio Lo Nuestro"
}