{
 "id": "308945",
 "text": "The 1941–42 NHL season was the 25th season of the National Hockey League. Seven teams played 48 games each. The Toronto Maple Leafs would win the Stanley Cup defeating the Detroit Red Wings winning four straight after losing the first three in a best-of-seven series, a feat only repeated twice in NHL history as of the 2010 season. ==Regular season== ===Final standings=== ===Scoring leaders=== Note: GP = Games played, G = Goals, A = Assists, PTS = Points, PIM = Penalties in minutes PLAYER TEAM GP G A PTS PIM Bryan Hextall New York Rangers 48 24 32 56 30 Lynn Patrick New York Rangers 47 32 22 54 18 Don Grosso Detroit Red Wings 45 23 30 53 13 Phil Watson New York Rangers 48 15 37 52 58 Sid Abel Detroit Red Wings 48 18 31 49 45 Toe Blake Montreal Canadiens 48 17 28 45 29 Bill Thoms Chicago Black Hawks 47 15 30 45 8 Gordie Drillon Toronto Maple Leafs 48 23 18 41 6 Syl Apps Toronto Maple Leafs 38 18 23 41 0 Tommy Anderson Brooklyn Americans 48 12 29 41 64 ===Leading goaltenders=== Note: GP = Games played; Min - Minutes Played; GA = Goals Against; GAA = Goals Against Average; W = Wins; L = Losses; T = Ties; SO = Shutouts Player Team GP MIN GA GAA W L T SO Frank Brimsek Boston Bruins 47 2930 115 2.35 24 17 6 3 Turk Broda Toronto Maple Leafs 48 2960 136 2.76 27 18 3 6 Jim Henry New York Rangers 48 2960 143 2.90 29 17 2 1 Johnny Mowers Detroit Red Wings 47 2880 144 3.00 19 25 3 5 Sam LoPresti Chicago Black Hawks 47 2860 152 3.19 21 23 3 3 Paul Bibeault Montreal Canadiens 38 2380 131 3.30 17 19 2 1 Chuck Rayner N.Y. Americans 36 2380 129 3.47 13 21 2 1 Earl Robertson N.Y. Americans 12 750 46 3.68 3 8 1 0 Bert Gardiner Montreal Canadiens 10 620 42 4.06 1 8 1 0 ==Playoffs== Note: all dates in 1942 ===Playoff bracket=== ===Quarter-finals=== Boston Bruins vs. Chicago Black Hawks Date Away Score Home Score Notes March 22 Boston 2 Chicago 1 OT March 24 Chicago 4 Boston 0 March 26 Chicago 2 Boston 3 Boston wins best-of-three series 2–1 Detroit Red Wings vs. Montreal Canadiens Date Away Score Home Score Notes March 22 Montreal 1 Detroit 2 March 24 Detroit 0 Montreal 5 March 26 Montreal 2 Detroit 6 Detroit wins best-of-three series 2–1 ===Semi-finals=== New York Rangers vs. Toronto Maple Leafs Date Away Score Home Score Notes March 21 New York 1 Toronto 3 March 22 Toronto 4 New York 2 March 24 Toronto 0 New York 3 March 28 New York 1 Toronto 2 March 29 Toronto 1 New York 3 March 31 New York 2 Toronto 3 Toronto wins best-of-seven series 4–2 Boston Bruins vs. Detroit Red Wings Date Away Score Home Score Notes March 29 Detroit 6 Boston 4 March 31 Boston 1 Detroit 3 Detroit wins best-of-three series 2–0 ===Final=== Toronto Maple Leafs vs. Detroit Red Wings Date Away Score Home Score Notes April 4 Detroit 3 Toronto 2 April 7 Detroit 4 Toronto 2 April 9 Toronto 2 Detroit 5 April 12 Toronto 4 Detroit 3 April 14 Detroit 3 Toronto 9 April 16 Toronto 3 Detroit 0 April 18 Detroit 1 Toronto 3 Toronto wins best- of-seven series 4–3 ==NHL awards== Calder Trophy: Grant Warwick, New York Rangers Hart Memorial Trophy: Tommy Anderson, Brooklyn Americans Lady Byng Trophy: Syl Apps, Toronto Maple Leafs O'Brien Cup: Detroit Red Wings Prince of Wales Trophy: New York Rangers Vezina Trophy: Frank Brimsek, Boston Bruins ===All-Star teams=== First team Position Second team Frank Brimsek, Boston Bruins G Turk Broda, Toronto Maple Leafs Earl Seibert, Chicago Black Hawks D Pat Egan, Brooklyn Americans Tommy Anderson, Brooklyn Americans D Bucko McDonald, Toronto Maple Leafs Syl Apps, Toronto Maple Leafs C Phil Watson, New York Rangers Bryan Hextall, New York Rangers RW Gordie Drillon, Toronto Maple Leafs Lynn Patrick, New York Rangers LW Sid Abel, Detroit Red Wings Frank Boucher, New York Rangers Coach Paul Thompson, Chicago Black Hawks == References == * Hockey Database * NHL.com Category:1941 in North America Category:1942 in North America Category:National Hockey League seasons",
 "title": "1941–42 NHL season"
}