{
 "id": "309019",
 "text": "Palestinian Jews or Jewish Palestinians (Hebrew: ; Arabic: اليهود الفلسطينيون), also called \"the Jewish settlement in the Land of Israel ()\" denotes the Jews of historic Palestine (also called \"Land of Israel\") at various points in the region's history. Jews in Palestine before the Israeli Declaration of Independence are more commonly referred to as \"Yishuv\" (Jewish Community or Community). A distinction is drawn between the \"Old Yishuv\" that is, the Jews of Palestine before the Ottoman Empire took over the region, and the \"New Yishuv\" that is the newly-arrived Jewish immigrant communities after the First Aliyah in 1881. After the Israeli Declaration of Independence, many Jewish Palestinians became Israelis. In addition to being applied to the Jews of Mandatory Palestine, the word Palestinian described the Jewish communities of Southern Syria prior. There are historical scholarly instances where the Jewish communities of Palestina Prima, Palestina Secunda and Palestina Tertia were termed Syro-Palestinian. == History == === Ottoman era === Prior to dismemberment of the Turkish Empire, the Palestinian populace was not \"Islamic\". Under the empire's rule in the mid-16th century, there were no more than 10,000 Jews in Palestine, making up around 5% of the population. By the mid-19th century, Turkish sources recorded that 80% of the population of 600,000 was identified as Muslim(s), 10% as Christian Arab and 5–7% as Jewish. The situation of the Jewish Syro-Palestinian community was more complicated than the Jewish communities of neighboring Muslim countries. But, the Jewish communities of Lebanon, Iraq and Yemen were largely homogenous in ethnic and confessional terms. In the Mandatory Palestinian territory, Jewish pilgrims and European Christian projects attracted large number of Ashkenazi immigrants out of Eastern Europe and Bulgarian, Turkish and African Sephardim. The Jewish Palestinian people were not just of Sephardic and Maghrebic origins but included substantial Ashkenazics who had established themselves in historic Palestine centuries earlier. Towards the end of Ottoman rule over Palestine, Jewish communities were concentrated in Hebron, Jerusalem, Tiberias and Safed. The Jewish population consisted of Ashkenazi, Sepharadis and Mizrachis. The majority of Jews in the four holy cities of Judaism with exception of Jerusalem spoke Judeo-Aramaic, Judeo-Arabic and Ladino. The dominant language of Jerusalemite Jewish communities was Yiddish due to large migration of Ashkenazim from Eastern Europe and Russia. Still, in 1882, there were registered 7,620 Sephardi Jews, Mizrachi Jews and Maghrebi Jews, in Jerusalem, of whom 1,290 were Maghrebis. Natives of the city, they were Turkish subjects, and fluent in Arabic. Arabic also served as the lingua franca between the Sephardim, Mizrahim, Maghrebim and Ashkenazim and their gentile Arab counterparts in mixed cities such as Safed, Haifa, Tyre and Hebron. However, during the Greek and Roman period, the primary language of the Palestinians was Aramaic, a Semitic relative to Hebrew language. === British Mandate era === Despite the overtures in 1914 by the local Arab population, which was uniting under a new concept of Palestinianism was becoming increasingly detached from the Jewish speakers of Arabic over Zionism. Even though many Jews who spoke Arabic, identified as Arabian and maintained intellectual networks in Cairo, Beirut, and Istanbul many of them were also supporters of Zionism. Jewish newspapers such as the HaHerut which dealt with Sephardic issues were sympathetic to Zionism and the Turkish Empire and in many ways, similar to HaTzvi which was published by newly arrived Ashkenazi Jews. Attempts to ease the tensions were made by Arab-speaking Jews establishing societies such as HaMagen to counter Anti-Zionism in the Arab press, translate Arabic articles so recently arrived Jewish settlers could understand Arabians and suppress antisemitic publications but this was becoming challenging due to the rising wave of nationalist publications. == Names of Israel in Arabic == Official documents released in April 2013 by the State Archive of Israel show that days before the Israeli Declaration of Independence, Jewish officials were still debating about what the new country would be called in Arabic: Filastin, Sayoun or Isra’il. Two assumptions were made: \"That an Arab state was about to be established alongside the Jewish one in keeping with the UN's partition resolution the year before, and that the Jewish state would include a large Arab minority whose feelings needed to be taken into account\". In the end, the officials rejected the name \"Palestine\" or \"Palestinian State\" because they thought that would be the name of the new Arab state and could cause confusion so they opted for the most straightforward option: \"Israel\". == Controversies: == The British people referred to Arab Palestinians and the Yishuv as Palestinians as the word \"Palestinian\" at that time which indicated the residents of Mandatory Palestine. === Israeli usage: === Uzziel (born 1880 in Jerusalem) was the Sephardi rabbi of Mandatory Palestine from 1939 to 1948, and of Israel from 1948 to 1954. He served as a Mizrachi delegate to the Zionist Congress from 1925–46. As a religious Zionist, he strongly believed in the redemption of Israel and bringing the Jewish exiles back to the land to create a religious Jewish state of Israel. As a strong supporter of Israeli nationalism, in his writing The Redemption of Israel he wrote: \"We all desire that the in gathering of the exiles should take place from all areas where they have been scattered; and that our holy language will be upon our lips and upon the lips of our children, in building the Land and its flowering through the hands and work of Israel; and we will all strive to see the flag of freedom and redemption waving in glory and strength upon the walls of Jerusalem\". Uri Davis, an Israeli citizen, academic, activist and observer- member of the Palestinian National Council in Sakhnin, identified himself as an \"anti-Zionist Palestinian Hebrew\". Davis explained, \"I don’t describe myself as a Palestinian Hebrew, but I actually happen to be a Palestinian Hebrew, I was born in Jerusalem in 1943 in a country called Palestine and the title of my birth certificate is 'Government of Palestine'. That is neither here nor there, though. It is significant only in a political context in which I am situated, and the political context that is relevant to my work, my advocacy of a critique of Zionism. I'm an anti-Zionist.\" He has since converted to Islam in 2008 to marry a Palestinian Muslim woman, Miyassar Abu Ali, whom he met in 2006. Since then he no longer considers himself Jewish. === Syrian/Palestinian usage: === The Palestinian National Charter, as amended by the PLO's Palestinian National Council in July 1968, defined Palestinians as \"those Arab nationals who, until 1947, normally resided in Palestine regardless of whether they were evicted from it or stayed there. Anyone born, after that date, of a Palestinian father—whether in Palestine or outside it—is also a Palestinian. The Jews who had normally resided in Palestine until the beginning of the Zionist invasion will be considered Palestinians\". The term \"Jewish Palestinian\" in Syrian/Palestinian usage refers to Arab Palestinians of Jewish descent, examples of which include Ilan HaLevi, Uri Davis, Neturei Karta etc. One notable instance is the Mukhamaras, a Palestinian Jewish family in Jutta and the Hills of Hebron which claims descent out of a Jewish Arabian community that got expelled from Khaybar. According to their tradition, their ancestor, Muheimar a Judahite, conquered the village centuries ago. Additionally, there are reports of the clan observing ancient Judahite customs such as lighting candles during Hanukkah, which is common in the region. Some scholars support their origin story, while others suggest they represent remnants of an ancient Jewish community in Judeo-Samaria. Additionally, one theory proposes that their name, Makhamra, meaning \"vinters\" in Arabic, reflects a Haram profession. In addition, the origins of the Palestinian People are disputed. == See also: == * Mizrahi Jews, Israeli designation of Jews from Arab and Muslim countries. * Palestinian Talmud. * Palestinian rabbis. * Palestinian Gaonate. * Palestinian vocalization. * Judeo-Aramaic languages. * Judeo-Arabic dialects * Samaritans, a Jewish population of Palestine that traces its roots to the ancient Israelites. * Neturei Karta ==References== Category:Palestinian culture Category:Jewish ethnic groups Category:Ancient Israel and Judah Category:Judaism Category:Jewish history Category:History of Syria",
 "title": "Palestinian Jews"
}