{
 "id": "309046",
 "text": "Sociolinguistics is the study of how language is related to society. It also studies how people affect language usage. Sociolinguistics studies how variety in language changes between groups of people because of things such as race, gender, status, age, etc. Indian and Japanese linguists first studied the social parts of language in the 1930s. Louis Gauchat in Switzerland also studied this in the early 1900s. However, none of them were known in the West until much later. The study of why language changes started during the late 1900's in the wave model. Thomas Callan Hodson was the first person to us the word sociolinguistics. It was in an article he wrote in 1939 called \"Sociolinguistics in India\". This was printed in a magazine called Man in India.Paulston, Christine Bratt and G. Richard Tucker, eds. Sociolinguistics: The Essential Readings. Malden, Ma.: Wiley-Blackwell, 2003.T. C. Hodson and the Origins of British Socio-linguistics by John E. Joseph Sociolinguistics Symposium 15, Newcastle-upon-Tyne, April 2004 Sociolinguistics in the West first came in the 1960s. It was pushed forward by linguists such as William Labov (in the US) and Basil Bernstein (in the UK). In the 1960s, William Stewart and Heinz Kloss introduced the simple ideas for the concept of pluricentric languages. This explains how standard language varieties are different between countries (e.g. American/British/Canadian/Australian English; Austrian/German/Swiss German; Bosnian/Croatian/Montenegrin/Serbian Serbo-Croatian). == Applications of sociolinguistics == A sociolinguist might research how a particular variety of language (vernacular) would not be considered correct in a business place. Sociolinguists might also study the grammar, phonetics, and vocabulary of this sociolect. Similarly, dialectologists would study the same things for a regional dialect. The study of language variation focuses on how language changes with social pressure and when in a specific environment. This can include code-switching, or changing from one language or dialect to another depending on the situation. William Labov is a sociolinguist known for introducing a way to measure language variation and change.Paolillo, John C. Analyzing Linguistic Variation: Statistical Models and Methods CSLI Press 2001, Tagliamonte, Sali Analysing Sociolinguistic Variation Cambridge, 2006 He was not the first person to study sociolinguistics, but he is known for taking the lead in sociolinguistic research in the West. == Further reading == * Cook, Manuela (2019). N-V-T, a framework for the analysis of social dynamics in address pronouns. In: Bouissac, P. (Ed.). The Social Dynamics of Pronominal Systems. Amsterdam: John Benjamins. Chapter 1, pp. 17-34. {Hardbound ISBN| 978-90-272-0316-8}} and {e-Book ISBN| 978-90-272-6254-7}} *Lakoff, Robin T. (2000). The Language War. Berkeley, CA: University of California Press. *Meyerhoff, Miriam. (2006). Introducing Sociolinguistics. New York: Routledge. *Milroy, Lesley and Gordon. Matthew. (2003) Sociolinguistics: Method and Interpretation London: Blackwell Publishing. . (More advanced, but has lots of good examples and describes research methodologies to use.) *Paulston, Christina Bratt and G. Richard Tucker, editors. 1997. The early days of sociolinguistics: memories and reflections. (Publications in Sociolinguistics, 2.) Dallas: Summer Institute of Linguistics. *Trudgill, Peter. (2000). Sociolinguistics: An Introduction to Language and Society(4th Ed.). London: Penguin Books. This book is a very readable, if Anglo-centric, introduction for the non-linguist. *Watts, Richard J. (2003). Politeness. Cambridge: Cambridge University Press. . A sociolinguistics book specializing in the research in politeness. It's a little tough at times, but very helpful and informational. ==References== ==Related pages== *Linguistics *Sociology ==Other websites== * *http://www.ncsu.edu/linguistics/ncllp/aboutfieldwork.php About sociolinguistic fieldwork *Sociolinguistics: an interview with William Labov ReVEL, vol. 5, n. 9, 2007. Category:Branches of linguistics Category:Linguistics terminology",
 "title": "Sociolinguistics"
}