{
 "id": "309109",
 "text": "Selena was an American singer–songwriter. She became the \"Queen of Tejano music\" by the early 1990s.Mitchell, Rick. \"Selena\". Houston Chronicle, May 21, 1995. Retrieved on February 1, 2008. She had helped the Tejano genre become very popular in the United States. After dominating the Latin music charts, winning every nominated award and signing a tour sponsorship with Coca-Cola, Selena had begun recording songs for a crossover attempt. ==Songwriting== She wrote the songs \"Always Mine\", \"My Love\" and \"Amame\".Patoski, p. 44 She co- wrote \"Amor Prohibido\", \"Bidi Bidi Bom Bom\" and \"God's Child (Baila Conmigo)\". Her brother, A.B. Quintanilla III, became the main songwriter for Selena's songs in 1989.Patoski, p. 78 Selena y Los Dinos band members such as Ricky Vela (lead keyboardist) and Pete Astudillo (backup dancer) also wrote some songs for Selena. All the songs that were recorded were on the independent LP records Selena y Los Dinos (1984), The New Girl in Town (1985), Alpha (1986), Muñequito de Trapo (1987), And the Winner Is... (1987), Preciosa (1988) and Dulce Amor (1988). The other recorded songs were on her studio albums, Selena (1989), Ven Conmigo (1990), Entre A Mi Mundo (1992), Selena Live! (1993), Amor Prohibido (1994) and Dreaming of You (1995).Patoski, p. 370 ==Recording with other artists== Selena also had recorded several duets with other singers. \"Buenos Amigos\" was a corrido (a Spanish ballad that tells a story) with Salvadorian singer Alvaro Torres.Patoski, p. 82 \"Donde Quiera Que Estes\" was recorded with the Nuyorican band Barrio Boyzz.Patoski, p. 101 \"God's Child (Baila Conmigo)\" was a rock-gospel duet that was recorded with former Talking Heads singer David Byrne.Patoski, p. 177 \"Puede Ser\" had became Selena's final recording, she recorded the song with Puerto Rican-Dominican singer Nando \"Guero\" Dominguez. Selena had recorded several duets with backup dancer Astudillo as well. ==Range of styles== Selena had used polka, jazz fusion and traditional Tejano music in her songs during the 1980s. \"My Love\" is a freestyle song. Also coming from Selena (1989), \"No Te Vayas\" is a reggae fusion song. Songs on Ven Conmigo (1990) had more variety than her last album. On Entre A Mi Mundo (1992), the album had more Tejano songs.Richmond, p. 133 \"Missing My Baby\" is a contemporary R&B; song and \"¿Qué Creias?\" is a mariachi song. On Selena Live! (1993) most of the songs were live versions of the songs that were released before.Richmond, p. 142 There were only three new songs that were in the style of cumbia. On Amor Prohibido (1994), the album had mostly cumbia and Latin dance-pop songs. \"No Me Queda Mas\" is a power ballad song,Richmond, p. 151 while \"Techno Cumbia\" had techno fusion mixed with cumbia. \"Ya No\" is a rock song. On Dreaming of You (1995), most of the songs were pop confessionals and contemporary R&B; songs recorded in English.Richmond, p. 174 \"Captive Heart\" is an Synthpop song; it also has soul music. \"I'm Getting Used To You\" used baroque– and dream pop music while the songs \"El Toro Relajo\" and \"Tú Sólo Tú\" are ranchera songs. ==After her death== After Selena was killed in 1995, several songs were released. \"Siempre Hace Frio\" had a mixture of mariachi and ranchera music and \"Only Love\" is a pop-confessional. Both of these songs were on Siempre Selena (1996). \"A Boy Like That\" was a charity song to help AIDS patients; it was also a cover version from the West Side Story movie.Patoski, p. 181 \"Where Did the Feeling Go?\" is a ballad song, while \"Is It the Beat?\" is an electronic dance-pop song. The \"Disco Medley\" is a disco melody song; that contained the \"Last Dance\", \"The Hustle\" and \"On the Radio\" mixed into one song; these songs were originally recorded by Donna Summer (\"Last Dance\", \"On the Radio\") and Van McCoy (\"The Hustle\"). The \"Cumbia Medley\" is a live cumbia melody song; that contained \"Como La Flor\", \"La Carcacha\", \"Bidi Bidi Bom Bom\" and \"Baila Esta Cumbia\" mixed into one song; these songs are on the Selena movie soundtrack (1997). The \"Con Tanto Amor Medley\" is a ballad melody that contained \"Amor Prohibido\", \"Si Una Vez\" and \"Como La Flor\" mixed into one song; it was featured on Ones (2002). \"Puede Ser\" is a Spanish rock duet and was featured on Momentos Intimos (2004). \"Lo Dejo Solo\" is a polka song and was on the Classic Series Vol. 1 album in 2007. There are currently more unreleased songs Selena had recorded. Her father, Abraham Quintanilla Jr, and EMI Latin currently hold the rights to those songs. == A == Song Duet with Album Writer(s) Year Source Acuérdate De Mi None And the Winner Is... A.B. Quintanilla III 1987 Always Mine None Dulce Amor Quintanilla III 1988 Amame None Entre A Mi Mundo Ricky Vela, Quintanilla III 1992 Amame, Quiéreme Pete Astudillo Selena Quintanilla III 1989 Amor Prohibido None Amor Prohibido Selena, Quintanilla III, Astudillo 1994 Aunque No Salga El Sol None The New Girl in Town Manny Guerra 1985 Patoski, p. 267 == B == Song Duet with Album Writer(s) Year Source Baila Esta Cumbia None Ven Conmigo Quintanilla III, Astudillo 1990 Besitos None Selena Quintanilla III 1989 Bidi Bidi Bom Bom None Amor Prohibido Selena, Quintanillla III, Astudillo 1994 Brindis De Amor None Muñequito de Trapo Juan H. Barrón 1987 Buenos Amigos Alvaro Torres Nada Se Compara Contigo (album by Alvaro Torres) Alvaro Torres 1991 A Boy Like That None Songs of West Side Story (various artists) Leonard Bernstein, Stephen Sondheim 1996 == C == Song Duet with Album Writer(s) Year Source Call Me None Selena y Los Dinos Quintanilla III 1984 Captive Heart None Dreaming of You Kit Hain, Mark Goldenberg 1995 Cariño, Cariño Mio None Dulce Amor Quintanilla III 1988 Cariño Mio None Preciosa Vela 1988 Cien Años None Preciosa Fuentes Cervantes 1991 Cobarde None Amor Prohibido José Luis Borrego 1994 Como La Flor None Entre A Mi Mundo Quintanilla III, Astudillo 1992 Cómo Quisiera None Preciosa Quintanilla III, Vela 1988 Cómo Te Quiero None Preciosa Vela 1988 Con Esta Copa None Alpha Johnny Herrera 1986 Con Tanto Amor None Ones Quintanilla III, Astudillo 2002 Contigo Quiero Estar None Selena Alejandro Montealegre 1989 Corazón Abandonado None And the Winner Is... Abraham Quintanilla Jr 1987 Corazóncito None Alpha Quintanilla III, Guerra 1986 Costumbres None Dulce Amor Juan Gabriel 1988 Cruzare La Montaña None Selena y Los Dinos Barrón 1984 Cuando Nadie Te Quiera None And the Winner Is... José Alfredo Jiménez 1987 Cumbia Medley None Selena (soundtrack) Quintanilla III, Astudillo, Vela 1997 == D == Song Duet with Album Writer(s) Year Source Dame Tu Amor None Alpha Quintanilla Jr 1986 Dame Un Beso None Alpha Quintanilla III 1986 Después de Enero None Ven Conmigo Herrera 1990 Dejame Volar None The New Girl in Town Carlos Vargas 1985 None Muñequito de Trapo Gabriel 1987 Dime None Dulce Amor Quintanilla III 1988 Disco Medley None Selena (soundtrack) Frederick Perren, Dino Fekaris, Steve Greenberg, Paul Jabara, Van McCoy, Donna Summer, Giorgio Moroder 1997 Donde Quiera Que Estes Barrio Boyzz Donde Quiera Que Estes (album by Barrio Boyzz) K. C. Porter, Miguel Flores, Desmond Child 1994 Dreaming of You None Dreaming of You Franne Golde, Tom Snow 1995 Dulce Amor None Dulce Amor Quintanilla III 1988 == E == Song Duet with Album Writer(s) Year Source El Chico del Apartamento 512 None Amor Prohibido Quintanilla III, Vela 1994 El Ramalazo None Muñequito de Trapo Tomás Méndez 1987 El Toro Relajo None Dreaming of You Felipe Bermejo 1995 Enamorada de Ti (new version) None Ven Conmigo Quintanilla III, Astudillo 1990 Enamorada de Ti (old version) None Muñequito de Trapo Quintanilla III, Astudillo 1987 Encontre El Amor None The New Girl in Town Quintanilla Jr 1985 Estoy Contigo Roger Garcia The New Girl in Town Quintanilla III 1985 == F == Song Duet with Album Writer(s) Year Source Fotos y Recuerdos None Amor Prohibido Chrissy Hynde, Vela 1994 == G == Song Duet with Album Writer(s) Year Source Give Me One More Chance None Selena y Los Dinos Quintanilla III 1984 God's Child (Baila Conmigo) David Byrne Dreaming of You Byrne 1995 == I == Song Duet with Album Writer(s) Year Source I Could Fall In Love None Dreaming of You Keith Thomas 1995 I'm Getting Used To You None Dreaming of You Diane Warren 1995 Is It the Beat? None Selena (soundtrack) Pamela Phillips Oland, Quintanilla III 1997 == L == Song Duet with Album Writer(s) Year Source La Bamba None And the Winner Is... Beau Ryan 1987 La Carcacha None Entre A Mi Mundo Quintanilla III 1992 La Llamada None Selena Live! Quintanilla III 1993 La Mirada None Muñequito de Trapo Barrón 1987 La Tracalera None The New Girl in Town Herrea 1985 La Puerta Se Cerró None Dulce Amor Quintanilla III 1988 Las Cadenas None Entre A Mi Mundo Quintanilla III, Vela 1992 Lo Tanto Que Te Quiero None Selena y Los Dinos Quintanilla Jr 1984 Lo Dejo Solo None Classic Series Vol. 1 Quintanilla Jr 2007 == M == Song Duet with Album Writer(s) Year Source Mentiras None Selena Quintanilla III, Astudillo 1989 Missing My Baby None Entre A Mi Mundo Quintanilla III 1992 Muñequito de Trapo None Muñequito de Trapo Quintanilla III 1987 My Love None Selena Selena 1989 == N == Song Duet with Album Writer(s) Year Source No Debes Jugar None Selena Live! Quintanilla III 1993 No Lloras Más Corazón None Dulce Amor Quintanilla III 1988 No Me Queda Mas None Amor Prohibido Vela, Quintanilla III 1994 No Quiero Saber None Ven Conmigo Quintanilla III 1990 No Te Vayas None Selena Quintanilla III 1989 == O == Song Duet with Album Writer(s) Year Source Only Love None Siempre Selena Robbie Buchanan, Mark Spiro 1996 Oh Mama None The New Girl in Town Ruben Armando 1985 == P == Song Duet with Album Writer(s) Year Source Pa' Qué Me Sirve La Vida None Alpha Jesús Monge 1986 Pensando En Ti None Alpha Vela, Roger García 1986 Pero Cómo Te Ha Ido None Alpha Herrea 1986 Puede Ser Nando \"Guero\" Dominguez Momentos Intimos Chris Perez, Selena 2004 == Q == Song Duet with Album Writer(s) Year Source Qué None Dulce Amor Quintanilla III 1988 ¿Qué Creias? None Entre A Mi Mundo Quintanilla III 1992 Quiero Ser None Selena Quintanilla III 1989 Quisiera Darte None Dulce Amor Vela 1988 == R == Song Duet with Album Writer(s) Year Source Rama Caida None Muñequito de Trapo Barrón 1987 == S == Song Duet with Album Writer(s) Year Source Sabes None Preciosa Vela 1988 Salta La Ranita None And the Winner Is... Victor H. Garza 1987 Sentimientos None Alpha Quintanilla III 1986 Se Acabo Aquel Amor None Selena y Los Dinos Quintanilla Jr 1984 Se Me Hace None The New Girl in Town Gerardo Olvera 1985 Si La Quieres None Entre A Mi Mundo Vela 1992 Si Una Vez None Amor Prohibido Astudillo, Quintanilla III 1994 Siempre Estoy Pensando En Ti Astudillo Entre A Mi Mundo Quintanilla III, Astudillo 1992 Siempre Hace Frío None Siempre Selena Cuco Sanchez 1996 Soy Amiga None Alpha Vela 1986 Soy Feliz None The New Girl in Town Quintanilla Jr 1985 Sukiyaki None Selena Rokusuke Ei, Hachidai Nakamura, Quintanilla Jr, Astudillo 1989 == T == Song Duet with Album Writer(s) Year Source Te Amo Solo A Ti None And the Winner Is... E.J. Ledesma 1986 Techno Cumbia None Amor Prohibido Quintanilla III, Astudillo 1994 Tengo Ganas De Llorar None Selena Quintanilla III, Vela 1989 Terco Corazon None Preciosa Quintanilla III 1988 Tres Días None And the Winner Is... Quintanilla Jr 1987 Tres Veces No None Selena y Los Dinos Carlos Blanes 1984 Tu Eres None Selena Quintanilla III, Astudillo 1989 Tú No Sabes None And the Winner Is... Vela 1987 Tú Robaste Mi Corazón Emilio Navaria Selena Live! Quintanilla III, Astudillo 1993 Tú Sólo Tú None Dreaming of You Felipe Valdés Leal 1995 Tú Solamente Tú None Selena y Los Dinos Pendiente 1984 Tus Desprecios None Amor Prohibido Quintanilla III, Vela 1994 == U == Song Duet with Album Writer(s) Year Source Un Primer Amor None The New Girl in Town D.A.R. 1985 == V == Song Duet with Album Writer(s) Year Source Ven A Verme None And the Winner Is... Vela, García 1987 Ven Conmigo None Ven Conmigo Quintanilla III, Astudillo 1990 Vuelve A Mi None Entre A Mi Mundo Quintanilla III, Astudillo 1992 == W == Song Duet with Album Writer(s) Year Source Where Did the Feeling Go? None Selena (soundtrack) Norman Saleet 1997 Wherever You Are Barrio Boyzz Dreaming of You K. C. Porter, Miguel Flores, Desmond Child 1995 == Y == Song Duet with Album Writer(s) Year Source Ya Lo Se Que Tu Te Vas None Selena y Los Dinos Gabriel 1984 Ya No None Amor Prohibido Quintanilla III, Vela 1994 Ya Se Va None Selena y Los Dinos Jorge Antonio Ramírez 1984 Ya Ves None Entre A Mi Mundo Quintanilla III, Astudillo 1992 Yo Fui Aquella None Preciosa Quintanilla III 1988 Yo Me Voy None Ven Conmigo Quintanilla III 1990 Yo Te Amo Astudillo Ven Conmigo Quintanilla III, Astudillo 1990 Yo Te Dare None And the Winner Is... Quintanilla III 1987 Yo Te Sigo Queriendo None Entre A Mi Mundo Quintanilla III, Vela 1992 == Notes == == References == * * * * * * * * Category:Lists of songs by recording artists",
 "title": "List of Selena songs"
}