{
 "id": "30927",
 "text": "Nagorno-Karabakh is a region in the South Caucasus. It is recognized by other countries as part of Azerbaijan, but from 1994 until the 2020 Nagorno-Karabakh war, most of it was militarily controlled by Armenians as the Republic of Artsakh, which was not officially recognized by any other country, including Armenia which supported it. In September of 2023, Azerbaijan invaded the Artsakh Republic after a long siege. Within a few days, Artsakh surrendered and came under the control of Azerbaijan. Nearly all of Artsakh's population fled to Armenia as refugees. == Demographics == Year Armenians Azerbaijanis Others Total Number % Number % Number % 1921 122,426 94.73% 6,550 5.07% 267 0.21% 129,243 1923 149,600 94.8% 7,700 4.9% 500 0.3% 157,800 1925 142,470 90.28% 15,261 9.67% 76 0.05% 157,807 Historical ethnic composition of the Nagorno-Karabakh Autonomous Oblast in 1921–1989 Ethnic group 1926Всесоюзная перепись населения 1926 года. Национальный состав населения по регионам республик СССР Демоскоп 1939Всесоюзная перепись населения 1939 года. Распределение городского и сельского населения областей союзных республик по национальности и полу Демоскоп 1959Всесоюзная перепись населения 1959 года. Городское и сельское население областей республик СССР (кроме РСФСР) по полу и национальности Демоскоп 1970Всесоюзная перепись населения 1970 года. Городское и сельское население областей республик СССР (кроме РСФСР) по полу и национальности Демоскоп 1979Всесоюзная перепись населения 1979 года. Городское и сельское население областей республик СССР (кроме РСФСР) по полу и национальности Демоскоп 1989Всесоюзная перепись населения 1989 года.Распределение городского и сельского населения областей республик СССР по полу и национальности Демоскоп Number % Number % Number % Number % Number % Number % Armenians 111,694 89.24 132,800 88.04 110,053 84.39 121,068 80.54 123,076 75.89 145,450 76.92 Azerbaijanis 12,592 10.06 14,053 9.32 17,995 13.80 27,179 18.08 37,264 22.98 40,688 21.52 Russians 596 0.48 3,174 2.10 1,790 1.37 1,310 0.87 1,265 0.78 1,922 1.02 Ukrainians 35 0.03 436 0.29 238 0.18 193 0.13 140 0.09 416 0.22 Belarusians 12 0.01 11 0.01 32 0.02 35 0.02 37 0.02 79 0.04 Greeks 68 0.05 74 0.05 67 0.05 33 0.02 56 0.03 72 0.04 Tatars 6 0.00 29 0.02 36 0.03 25 0.02 41 0.03 64 0.03 Georgians 5 0.00 25 0.02 16 0.01 22 0.01 17 0.01 57 0.03 Others 151 0.12 235 0.16 179 0.14 448 0.30 285 0.18 337 0.18 Total 125,159 100.00 150,837 100.00 130,406 100.00 150,313 100.00 162,181 100.00 189,085 100.00 == Etymology == The names for the region in the different local languages all translate to \"mountainous Karabakh\", or \"mountainous black garden\". The word \"nagorno\" is Russian for \"mountainous/on the mountain\", \"kara\" is Turkish for \"black\", and \"bakh\" means \"garden\" in Azerbaijani. * Armenian: , transliterated Lernayin Gharabagh * Azerbaijani: Dağlıq Qarabağ, or Yuxarı Qarabağ (meaning \"upper Karabakh\" or \"mountainous Karabakh\") * Russian: Нагорный Карабах, transliterated Nagornyj Karabakh == History == Around 180 BC, Artsakh became one of the 15 provinces of the Armenian Kingdom and remained so until the 4th century.Hewsen, Robert H. \"The Kingdom of Artsakh\", in T. Samuelian & M. Stone, eds. Medieval Armenian Culture. Chico, CA, 1983. Then it became part of the Sasanian Empire. In the 7th century, the region was conquered by the invading Muslim Arabs. The House of Khachen, then ruled Artsakh until the early 19th century.Robert H. Hewsen, Armenia: A Historical Atlas. The University of Chicago Press, 2001, pp. 119, 155, 163, 264–65. Persia formally ceded the whole of Karabakh to the Russian Empire by the Treaty of Gulistan in 1813. In April 1920 Azerbaijan was taken over by the Bolsheviks. It was in the Azerbaijan Soviet Socialist Republic. In the 1980s there was a movement to have the autonomous oblast transferred to the Armenian SSR.Audrey L. Altstadt. The Azerbaijani Turks: power and identity under Russian rule. Hoover Press, 1992. , 9780817991821 When Mikhail Gorbachev came to power in Moscow and started campaigns of publicity and democratic reforms at the end of the 20th century, Armenians living in Nagorno-Karabakh sent letters to Gorbachev demanding him to move the autonomous oblast to the control of Armenia. When it was declined, the Armenians started an independence movement. In November 1991, seeking to stop this movement, the Parliament of Azerbaijan abolished the autonomous status of the region. In response, the Nagorno-Karabakh Armenians held a referendum on December 10, 1991, which was boycotted by Azerbaijanis living in Nagorno-Karabakh and none of them participated in it, therefore the overwhelming majority of the population voted for independence. ==Gallery== File:Five principalities of karabakh.png|In the 1500s File:Red kurdistan 1930.png|In 1930 File:Nagorno Karabakh03.png|In 2006 File:Nagorno-Karabakh regions named english.png|In 2006 File:Location Artsakh en.png|Nearby countries File:2020 Nagorno-Karabakh war.svg|Map of the war in 2020 File:2014 Górski Karabach, Klasztor Gandzasar (14).jpg|The Gandzasar monastery, built in the 1200s ==References== == Other websites == * Karabakh documents * Artsakh from ancient time till 1918 * Artsakh (Nagorno Karabakh) - France 24 Report",
 "title": "Nagorno-Karabakh"
}