{
 "id": "309220",
 "text": "A municipal corporation is a term used by the local government. An incorporated town is able to create its own laws. These laws are in addition to the laws of the country, province, or state where the town is located. Municipal corporation happens when an urban neighborhood becomes a self- governing entity under state laws. After this event, an award or declaration is presented by the municipal charter. == Municipal charters == A municipal charters is a legal paper that establishes municipality; such as a city or town. This was created in Europe during the Middle Ages time. With a municipal charter, the new towns or cities are given rights. == Municipal charters by country == === Canada === In Canada, charters are given by the provincial authorities. === Germany === In Germany, the municipal charters have existed since the Medieval Times. === India === In India the municipal corporation has a local government that is in charge of a city population that has 200,000 people or more. Because of the panchayati raj system, the city government has to discuss with the state government. Mumbai, Delhi, Kolkata, Bangalore, Chennai, Hyderabad and Ahmedabad have the biggest municipal corporations. Members are chosen from the wards of the city. The municipal corporations are responsible for roads, public transportation, water supply, records of births and deaths, sanitation that includes waste management, sewage, drainage and flood control, public safety services like fire and ambulance services, gardens and maintenance of buildings. Taxes is where the municipal corporations get their money from to fix problems in their cities. === Republic of Ireland === In Ireland municipal corporations have been in Ireland since the Medieval Times. In Dublin, the municipal corporation have been there since the 13th century. === South Africa === In Durban the municipal corporation was called the \"Durban Corporation\". === Sweden === In Sweden, cities were made by the royal charter until 1951. === Philippines === In the Philippines, cities are made by the laws enacted by a lot of national legislatures. === United Kingdom === In the United Kingdom, cities are made by the royal letter patent. === United States === In the United States, cities are made by the municipal charters. This is usually followed by a referendum vote. ==References== Category:Urban planning",
 "title": "Municipal corporation"
}