{
 "id": "309591",
 "text": "Epistemic community is a large network of people who work towards a common knowledge-based goal—like the community of people who work together to create and maintain Wikipedia.Waldman, Simon. \"Who knows?\" The Guardian (UK). October 26, 2004; excerpt, \"The site is manned by volunteers, and now owned by a foundation, which means people willingly give their time and intellectual property to the venture.... There are hundreds of thousands of \"Wikipedians\" who have contributed or edited articles.\" An epistemic community is a group of people who do not have any specific history together. They join to form a kind of community based on a similar focus on an information-based project. The community group can be made of people with a range of special interests.Haas, P. (1990). \"Obtaining international environmental protection through epistemic consensus,\" Millennium Journal of International Studies 19:3, 347-363. This kind of community has four characteristics or typical features:Haas, P. (1992). \"Introduction: epistemic communities and international policy coordination,\" International Organization 46:1, 1-35. # a shared set of principles or value-based explanations for how the community functions. # a shared understanding of the way things happen, including problems and policies and outcomes.Compare P. B. de Laat, (2012) \"Coercion or empowerment? Moderation of content in Wikipedia as 'essentially contested' bureaucratic rules.\" Ethics and Information Technology, pp. 1–13; retrieved 2013-1-25. # shared ideas about what is acceptable or valid according to specially defined ideas and evaluation practices. # a common enterprise or shared goals.Compare K. Brad Wray, \"The Epistemic Cultures of Science and Wikipedia: A Comparison,\" 'Episteme, Vol. 6, Issue 1, February 2009, pp. 38-51; retrieved 2012-1-25. The shared explanations for how the community functions includes \"the appalling silence of good people\",Axelrod, Rise B. and Charles R. Cooper (2011). Axelrod & Cooper's Concise Guide to Writing, p. 333; Ansbro, John J. (2000). Martin Luther King, Jr.: Nonviolent Strategies and Tactics for Social Change, p. 227. which encourages the growth of perverse incentives. An example of a scientific epistemic community is the 1975 Mediterranean Action Plan (MAP). This is a marine pollution control regime for the Mediterranean Sea developed by the United Nations.Haas, P. (1989) \"Do regimes matter? Epistemic communities and Mediterranean pollution control,\" International Organization, 43:3, 377-403. == Related pages== * Epistemology * Invisible College * Royal Society * Intensity of preference == References == ==Other websites== * UNEP Mediterranean Action Plan website * Dobusch, Leonhard and Sigrid Quack, Epistemic Communities and Social Movements: Transnational Dynamics in the Case of Creative Commons,\" Max-Planck-Institut für Gesellschaftsforschung, Köln (Max Planck Institute for the Study of Societies, Cologne), September 2008. * Fallis, Don. \"Toward an Epistemology of Wikipedia,\" Journal of the American Society for Information Science and Technology, Vol. 59, No. 10, pp. 1662-1674, 2008. Category:Community",
 "title": "Epistemic community"
}