{
 "id": "310171",
 "text": "Kid Nation was a reality show. It first aired on the CBS network on September 19, 2007. The show featured 40 children, aged 8–15, living in a ghost town named \"Bonanza Town\". No one had lived in the town since the 19th century. The children were required to create a functioning society in the town, as well as set up a government system used to solve problems in the town. At the end of each episode the council awards a cash prize which is a \"gold star\" worth $20,000 to one of the kids. == Episodes == No. Episode Title Days Airdate Upper-Class Merchants Cooks Laborers Town Bonus Gold Star Exits Nielsen Ratings Households Adults 18-49 1 \"I'm Trying to be a Leader Here!\"Kid Nation on CBS CBS.com Episode 1 Recap 1-4 September 19 Red Blue Yellow Green Seven Outhouses Sophia Jimmy 5.8/10 3.0/9Broadcast TV Ratings for Wednesday, September 19, 2008 2 \"To Kill or Not to Kill\"Kid Nation on CBS CBS.com Episode 2 Recap 5-7 September 26 Blue Red Yellow Green None (Task Failed) Michael None 4.8/8 2.8/8Broadcast TV Ratings for Wednesday, September 26, 2008 3 \"Deal With It!\"Kid Nation on CBS CBS.com Episode 3 Recap 8-10 October 3 Yellow Blue Green Red Microwave & Cocoa Mallory None 4.7/8 TheFutonCritic.com - The Web's Best Television Resource 4 \"Bless Us and Keep Us Safe\"Kid Nation on CBS CBS.com Episode 4 Recap 11-13 October 10 Blue Red Yellow Green Religious Books Morgan Cody 4.3/7 2.0/6Broadcast TV Ratings for Wednesday, October 10, 2007 5 \"Viva La Revolución!\"Kid Nation on CBS CBS.com Episode 5 Recap 14-16 October 17 Yellow Green Red Blue Oral Hygiene Products Greg None 4.7/8 2.4/7Broadcast TV Ratings for Wednesday, October 17, 2007 6 \"Bonanza is Disgusting\"Kid Nation on CBS CBS.com Episode 6 Recap 17-19 October 24 Red Green Yellow Blue Fruits & Vegetables DK None 5.1/8 2.5/7Broadcast TV Ratings for Wednesday, October 24, 2007 7 \"The Root Of All Evil\"Kid Nation on CBS CBS.com Episode 7 Recap 20-22 October 31 Blue Yellow Green Red New Clothes & Free Laundry Nathan None 4.4/8 2.0/7Broadcast TV Ratings for Wednesday, October 31, 2007 8 \"Starved for Entertainment\"Kid Nation on CBS CBS.com Episode 8 Recap 23-25 November 7 Green Blue Red Yellow None (Task Failed) Kennedy None 4.5/7 2.1/6Broadcast TV Ratings for Wednesday, November 7, 2007 9 \"Not Even Close to Fair\"Kid Nation on CBS CBS.com Episode 9 Recap 26-28 November 14 Blue Yellow Green Red None (Task Failed) Blaine Randi 4.7/8 2.4/7Broadcast TV Ratings for Wednesday, November 14, 2007 10 \"Let Me Talk!\"Kid Nation on CBS CBS.com Episode 10 Recap 29-31 November 21 Blue Green Yellow Red Letters From Home Laurel None 4.3/7 2.0/6Broadcast TV Ratings for Wednesday, November 21, 2007 11 \"I Just Like The Recess Part\"Kid Nation on CBS CBS.com Episode 11 Recap 32-34 November 28 Green Blue Yellow Red Town Arcade Hunter None 4.5/7 2.1/6Broadcast TV Ratings for Wednesday, November 28, 2007 12 \"Where's Bonanza, Dude?\"Kid Nation on CBS CBS.com Episode 12 Recap 35-37 December 5 Green Red Blue Yellow Hot Air Balloon Ride Alex None 4.5/7 2.2/6Broadcast TV Ratings for Wednesday, December 5, 2007 13 \"We've All Decided to Go Mad!\"Kid Nation on CBS CBS.com Episode 13 Recap 38-40 December 12 No District Assignments No District Assignments No District Assignments No District Assignments Three $50,000 Gold Stars Zach Sophia Morgan Miglė None (final episode) 4.5/7 2.2/6Broadcast TV Ratings for Wednesday, December 12, 2007 :::: These gold stars were worth $50,000 and were awarded at the final town hall meeting. == References == ==Other websites== * Official Kid Nation Site (CBS) * * Category:2007 television series debuts Category:CBS network shows Category:American reality television series Category:English- language television programs",
 "title": "Kid Nation"
}