{
 "id": "310497",
 "text": "Tyler Perry (born September 13, 1969 in New Orleans) is an American actor, director, producer, and screenwriter, whose work plays are usually for encouragement to African Americans. Having started writing plays at age 18, Perry created a successful touring theater company, videos of whose performances were sold on DVD. As of March 2005, the plays had grossed over $75 million in ticket and DVD sales. He is well known for his plays on Madea. J Rank's biography website article At age 16, he had his first name legally changed from Emmitt to Tyler in an effort to distance himself from his father. Biography.com listing for Tyler Perry ==Filmography== Year Movie Credited as Director Writer Producer Actor Role 2005 Diary of a Mad Black Woman Madea / Joe / Brian 2006 Madea's Family Reunion Madea / Joe / Brian 2007 Daddy's Little Girls 2007 Why Did I Get Married? Terry Bob 2008 Meet the Browns Madea / Joe 2008 The Family That Preys Ben 2009 Madea Goes to Jail Madea / Joe / Brian 2009 Star Trek Admiral Barnett 2009 I Can Do Bad All By Myself Madea / Joe 2009 Precious 2010 Why Did I Get Married Too? Terry Bob 2010 For Colored Girls 2011 Madea's Big Happy Family Madea / Joe 2012 Good Deeds Wesley Deeds 2012 Madea's Witness Protection Madea / Joe / Brian 2012 Alex Cross Alex Cross 2013 Temptation: Confessions of a Marriage Counselor 2013 Peeples 2013 A Madea Christmas Madea 2014 The Single Moms Club TK 2014 Gone Girl Tanner Bolt 2015 Madea's Tough Love Madea / Joe / Brian 2016 Teenage Mutant Ninja Turtles: Out of the Shadows Dr. Baxter Stockman 2016 Brain on Fire Richard 2016 Boo! A Madea Halloween Madea / Joe / Brian 2017 The Star Cyrus the Camel (voice) 2017 Boo 2! A Madea Halloween Madea / Joe / Brian 2018 Acrimony 2018 Nobody's Fool 2018 Vice Colin Powell 2019 A Madea Family Funeral Madea / Joe / Brian / Heathrow 2020 A Fall from Grace Rory Garraux 2021 Those Who Wish Me Dead Officer Arthur Phillip PAW Patrol: The Movie Truck Driver (voice) Don't Look Up Jack Bremmer 2022 A Madea Homecoming Madea / Joe 2022 A Jazzman's Blues ===Television work=== Year Show Credited as Director Writer Producer Actor Role 2007–2012; 2020–present House of Payne Madea 2009–2011 Meet the Browns 2011–2017 For Better or Worse 2013–2021 The Haves and the Have Nots 2013–2017 Love Thy Neighbor Madea If Loving You Is Wrong Too Close to Home The Passion: New Orleans Host/Narrator The Paynes The Oval Sistas Young Dylan Ruthless Bruh Assisted Living All the Queen's Men == References == == Other websites == *Tyler Perry Official website *Tyler Perry's 34th Street Films Official website * * *Interview with Tyler Perry on beliefnet.com Category:1969 births Category:Living people Category:Actors from Louisiana Category:African- American actors Category:African-American movie directors Category:African- American movie producers Category:African-American writers Category:American Christians Category:Screenwriters from Louisiana Category:Writers from New Orleans",
 "title": "Tyler Perry"
}