{
 "id": "310638",
 "text": "In linguistics, a participle is a word that shares some characteristics of both verbs and adjectives.What is a participle? in Glossary of linguistic terms at SIL International. Examples of participle formation are: Verb Past Simple Past Participle Present Participle Regular/ Irregular to hire hired hiring regular to do did done doing irregular to say said saying to eat ate eaten eating to write wrote written writing to beat beat beaten beating to sing sang sung singing to see saw seen seeing As noun- modifiers, participles usually precede the noun (like adjectives), but in many cases they can or must follow it: *The visiting dignitaries devoured the baked apples. *Please bring all the documents required. (= Please bring all the documents that are required.) *The difficulties encountered were nearly insurmountable. (= The difficulties that were encountered were nearly insurmountable.) == Present participles == The present participle in English has the same form as the gerund, but the gerund acts as a noun rather than a verb or a modifier. The word sleeping in Your job description does not include sleeping is a gerund and not a present participle. While English past participles, like past tense forms, are sometimes irregular, all English present participles are regular, being formed with the suffix -ing. The present participle in English is in the active voice and is used for: *forming the progressive aspect: Jim was sleeping.progressive aspect = continuing *modifying a noun as an adjective: Let sleeping dogs lie. (= Let dogs that are sleeping lie.) *modifying a verb or sentence in clauses: Broadly speaking, the project was successful. == Past participles == The past participle may be used in both active and passive voices: *forming the perfect: The chicken has eaten. *forming the passive voice: The chicken was eaten. *modifying a noun, with active sense: our fallen comrades (= our comrades who have fallen) *modifying a noun, with passive sense: the attached files (= the files that have been attached) *modifying a verb or sentence, with passive sense: Seen from this perspective, the problem presents no easy solution. (= When it is seen from this perspective,....) === Passive participles === Passive participles reflect past action in the passive voice, for example *The dog, having been praised by its master, was happy, or more commonly, The dog, praised by its master, was happy. Even irregular past participle verbs often follow the format -en or -ne, as may be seen from above. For examples: Verb Past Participle to beat beaten to do done to eat eaten to fall fallen to give given to help holpen Archaic form in early Modern English, used in the Book of Common Prayer version of the Magnificat, see e.g., King James Bible online. Accessed September 27, 2010. to show shown'' to see seen to write written == References == Category:Parts of speech",
 "title": "Participle"
}