{
 "id": "310668",
 "text": "(554–628) was the 33rd Emperor of Japan,Imperial Household Agency (Kunaichō): 推古天皇 (33) according to the traditional order of succession.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 48. Her reign started in 593 and ended in 628.Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 39-42; Brown, Delmer et al. (1979). Gukanshō, pp. 263-264; Varley, H. Paul. (1980). Jinnō Shōtōki, pp. 126-129; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider details about the life of Empress Suiko to be possibly legendary, but probable.Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-18. The name Suiko-tennō was created for her posthumously by later generations. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. In the history of Japan, Suiko was the first of eight women to be empress. The seven others were: (a) Kōgyoku/Saimei, (b) Jitō, (c) Gemmei, (d) Genshō, (e) Kōken/Shōtoku, (f) Meishō, and (g) Go-Sakuramachi. ==Traditional history== Suiko was the third daughter of Emperor Kimmei. She was the half-sister of Emperor Yōmei and Emperor Sushun. Suiko was also a wife of Emperor Bidatsu. ==Events of Suiko's life== When Suiko became empress, she ended a power struggle for the throne after the deaths of emperors who were her brothers. * 593 : In the 2nd year of Emperor Sushun's reign, he died. The next monarch was his half-sister who became known as Empress Suiko.Titsingh, p. 39; Brown, pp. 263-264; Varley, p. 126-127. This succession was confirmed in ceremonies.Varley, p. 44; compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. Prince Shōtoku was the most important man in Suko's court. In 599, an earthquake destroyed buildings in Yamato province which is now known as Nara Prefecture.Hammer, Joshua. (2006). Yokohama Burning: The Deadly 1923 Earthquake and Fire that Helped Forge the Path to World War II, p. 62-63. The reign of this empress was marked by the opening of relations with the Sui court in 600. The use of the Sexegenary cycle calendar (Jikkan Jūnishi) in Japan is credited to Empress Suiko in 604.Nussbaum, Louis- Frédéric. (2005). \"Jikkan Jūnishi\" in Japan Encyclopedia, p. 420. * 604: In the 12 year of Suiko's reign (the Suiko period), Japan organized its earliest Imperial calendar.National Diet Library (NDL), \"The Japanese Calendar\", \"Calendar history/The Source\"; NengoCalc, \"(596) 推古 Suiko\" ; online conversion of Japanese dates into their Western equivalents. based on tables from Paul Yachita Tsuchihashi. (1952). and Reinhard Zöllner (2003), Japanische Zeitrechnung; retrieved 2012-11-14. Suiko ruled for 35 years. She abdicated in 628.Nussbaurm, \"Suiko Tennō\" in Japan Encyclopedia, p. 910. === After her death === Suiko died in 628. This empress' official name after her death (her posthumous name) was regularized only after death. Her reign name means \"to reason from antiquity.\"Aston, William George. (1895), Nihongi, p. 121. The actual site of Suiko's grave is known. This empress is traditionally venerated at a memorial Shinto shrine (misasagi) at Osaka. The Imperial Household Agency designates this location as Suiko's mausoleum. It is formally named Shinaga no Yamada no misasagi.Ponsonby-Fane, p. 420. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Suiko seamount * Japanese empresses ==References== ==Other websites== Category:554 births Category:628 deaths Category:Emperors of Japan",
 "title": "Empress Suiko"
}