{
 "id": "310715",
 "text": "Shake It Up! is a Disney Channel original series starring Bella Thorne, Zendaya Coleman, and Roshon Fegan. The show is in a show-within-a-show format. It premiered on November 7, 2010. In 2011, Disney Channel confirmed that a movie based on the show is currently being produced. ==Plot== Two best friends (CeCe Jones and Rocky Blue) land a job as background dancers in a show, \"Shake It Up! Chicago\" thanks to their friend Deuce. The show follows their adventures in the show and features problems and issues such as; their new social status, rivals on the show, and even the ultimate test: the strength of their friendship. == Cast == * Bella Thorne as CeCe Jones * Zendaya as Rocky Blue * Davis Cleveland as Flynn Jones * Roshon Fegan as Ty Blue * Adam Irigoyen as Deuce Martinez * Kenton Duty as Gunther Hessenheffer (seasons 1-2) * Caroline Sunshine as Tinka Hessenheffer (seasons 2-3, season 1 recurring) ===Recurring=== * R. Brandon Johnson as Gary Wilde * Anita Barone as Georgia Jones * Carla Renata as Marcie Blue * Buddy Handleson as Henry * Ainsley Bailey as Dina Garcia ==Episodes== Season Episodes Originally aired (U.S. dates) Season premiere Season finale 1 21 2 28 3 26 ===Season 1 (2010/11)=== * Davis Cleveland was absent for two episodes. * Adam Irigoyen was absent for three episodes. * Roshon Fegan was absent for four episodes. * Kenton Duty was absent for nine episodes. Shake It Up Season 1 episodes No. in series No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) ===Season 2 (2011/12)=== * This is Kenton Duty's last season of the show * Caroline Sunshine joins the main cast. * Davis Cleveland was absent for four episodes. * Adam Irigoyen and Roshon Fegan was absent for eight episodes. * Kenton Duty and Caroline Sunshine was absent for fourteen episodes. Shake It Up Season 2 episodes No. in series No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) ===Season 3 (2012/13)=== * Gunther Hessenheffer (Kenton Duty) is no longer part of the main cast. This was the final season of the show. * Adam Irigoyen was absent for five episodes. * Roshon Fegan was absent for five episodes. * Caroline Sunshine was absent for ten episodes. Shake It Up Season 3 episodes No. in series No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) ==Awards and nominations== Awards Awards Awards Awards Awards Awards Year Award Category Nominee(s) Result Ref. 2011 Young Artist Award Best Performance in a TV Series Leading Young Actress Bella Thorne 2011 Young Artist Award Outstanding Young Ensemble in a TV Series Bella Thorne, Zendaya, Davis Cleveland, Adam Irigoyen, Roshon Fegan, Kenton Duty and Caroline Sunshine 2011 Imagen Award Best Young Actress – Television Bella Thorne 2011 J-14's Teen Icon Award Iconic TV Actress Bella Thorne 2011 J-14's Teen Icon Award Iconic TV Show Shake It Up ==Indian adaptation== In 2013, an Indian adaptation of the show with the same name was made. It premiered on Disney Channel India on March 30, 2013. However, it is centered on two teenage boys as opposed to two teenage girls. Like most Indian adaptations, the episodes are similar to the original. The series ran for one season only. == References == == Other websites == * * * Category:American sitcoms Category:2010s American television series Category:2010 American television series debuts Category:2013 American television series endings Category:Disney Channel television series Category:Television series by Disney Category:English- language television programs",
 "title": "Shake It Up (American TV series)"
}