{
 "id": "310857",
 "text": "Someone like You is the second hit single on Adele's record 21 released in 2011. This was her first number one song in the United Kingdom (UK) and her second in the United States (US). ==Overview== Someone like You received positive review by musical critics. The song is played only with Adele's voice and piano. In 2012, the song was certified quintuple-Platinum by the Recording Industry Association of America. \"Someone like You\" is Adele's third-best selling single in the United States, after Rolling in the Deep and Hello. It reached number 24 on Billboard's Year-End Hot 100 of 2011 and number 43 on the year-end chart for 2012. During her concert tour in August 2024, Adele revealed that this song had changed her life. ==Music video== The Music video filmed in September 2010 starts with Adele walking along a road alone in downtown Paris and singing the song sadly, during which she stops at the Pont Alexandre III to look over the Seine. She tends walks into a building, when her ex-lover shows up. However, her ex-lover walks away, leaving her staring at his back in silence. The video premiered on MTV and Vevo on 29 September 2011. The official MV has gathered over 2.24 billion views and 10 million \"Likes\" as of 19 October 2024, similar to that of Adele's another hit Rolling in the Deep whose official MV was uploaded around a year earlier. ==Reviews== The song drew a substantial amount of positive reviews from music and media critics. === Amanda Dobbins === Amanda Dobbins of the New York magazine commented that \"the secretly devastating video\" for \"Someone like You\" would remind Adele's ex-lover what he had done by leaving her. === Sarah Dean === Sarah Dean of the Huffington Post called it an \"uncomplicated, moving film\" and wrote, === Jason Lipshutz === Jason Lipshutz of Billboard magazine remarked that the video was \"as simply constructed as the song's vocal-and- piano arrangement.\" === Andrew Matson === Andrew Matson of The Seattle Times said, === Andrea Devaro === Andrea Devaro of Long Island Press claimed, ==Credits and personnel== Credits are taken from 21 liner notes. * Vocals – Adele * Production – Adele Adkins and Dan Wilson * Songwriting – Adele Adkins and Dan Wilson ==Charts== ===Weekly charts=== Weekly chart performance for \"Someone like You\" Chart (2011) Peak position Brazil (Crowley Broadcast Analysis) 1 Europe (Euro Digital Songs) 1 Greece Digital Songs (Billboard) 8 Iceland (RÚV) 1 Japan (Japan Hot 100) 43 Luxembourg Digital Songs (Billboard) 4 Mexico (Billboard Mexican Airplay) 7 Mexico Anglo (Monitor Latino) 5 Poland Digital Songs (Billboard) 1 Portugal Digital Songs (Billboard) 1 Romania (Romanian Top 100)Romanian Top 100: 3 July – 10 July 2011 2 South Korea International Singles (Gaon Chart) 9 Spain (Promusicae) 1 Ukraine (Radio Hits Top 100) 85 US Hot Dance Club Songs (Billboard) 24 US Latin Pop Songs (Billboard) 6 2013 chart performance for \"Someone like You\" Chart (2013) Peak position Slovenia (SloTop50) 31 2015 chart performance for \"Someone like You\" Chart (2015) Peak position 2018 chart performance for \"Someone like You\" Chart (2018) Peak position South Korea Digital Chart (Gaon Chart) 96 2021 chart performance for \"Someone like You\" Chart (2021) Peak position South Africa (Recording Industry of South Africa) 55 ===Year-end charts=== 2011 year-end chart performance for \"Someone like You\" Chart (2011) Position Australian Singles Chart 4 Ö3 Austria Top 40 31 Belgian Singles Chart (Flanders) 5 Belgian Singles Chart (Wallonia) 10 Brazil (Crowley) 25 Canadian Hot 100 16 Hitlisten (Danish Singles Chart) 17 German Singles Chart 28 Mahasz (Hungarian Airplay Chart) 44 Tonlist (Icelandic Singles Chart) 7 Irish Singles Chart 1 Media Forest 7 Italian Singles Chart 1 Netherlands (Dutch Top 40) 2 Netherlands (Mega Single Top 100) 10 New Zealand Singles Chart 4 Romania (Romanian Top 100) 69 Spanish Singles Chart 39 Swedish Singles Chart 4 Swiss Hitparade 9 UK Singles Chart 1 US Billboard Hot 100 24 US Adult Contemporary (Billboard) 26 US Adult Pop Songs (Billboard) 17 US Mainstream Top 40 (Billboard) 29 2012 year-end chart performance for \"Someone like You\" Chart (2012) Position Argentine Digital Singles Chart 6 Austrian Singles Chart 61 Belgian Singles Chart (Flanders) 30 Belgian Singles Chart (Wallonia) 15 Brazil (Crowley) 5 Canadian Hot 100 42 Germany (Media Control AG) 54 Italian Singles Chart 11 Netherlands (Mega Single Top 100) 90 Mahasz (Hungarian Airplay Chart) 83 PROMUSICAE (Spanish Singles Chart) 12 Swedish Singles Chart 42 Swiss Singles Chart 12 US Billboard Hot 100 43 US Adult Contemporary (Billboard) 8 US Adult Top 40 (Billboard) 44 2021 year-end chart performance for \"Someone like You\" Chart (2021) Position UK Singles (OCC) 81 2022 year-end chart performance for \"Someone like You\" Chart (2022) Position Billboard Global Excl. U.S 197 2023 year-end chart performance for \"Someone like You\" Chart (2023) Position UK Singles (OCC) 87 ===Decade-end charts=== 2010s-end chart performance for \"Someone like You\" Chart (2010–2019) Position Australia (ARIA) 10 UK Singles (Official Charts Company) 16 US Billboard Hot 100 38 ===All-time chart=== Chart (All-time) Position US Billboard Hot 100 (Women) 44 US Billboard Hot 100 144 UK Singles (Official Charts Company) 25 ==Covers== Someone like You has been covered by various singers since its release. Some of them are independent bands, including the First To Eleven. First To Eleven's cover version of the song has accumulated 535,736 views as of April 8, 2025. ==References== Category:2010s ballads Category:2010 songs Category:2011 singles Category:Adele songs Category:Pop ballads Category:Soul songs Category:R&B; songs Category:Torch songs",
 "title": "Someone like You (Adele song)"
}