{
 "id": "310830",
 "text": "Edward Estlin Cummings (October 14, 1894 – September 3, 1962) or best known as E. E. Cummings was an American poet. He is also known for his works as a painter, essayist, author, and playwright. He had created about 2,900 poems, two autobiographical novels, four plays and several essays. E. E. Cummings had done a lot of drawings as well as paintings. He is best known as the preeminent voice of 20th century poetry. == Related pages == *List of poets from North America ==References== * Bloom, Harold, Twentieth-century American literature, New York : Chelsea House Publishers, 1985-1988. . * * Friedman, Norman (editor), E. E. Cummings: A Collection of Critical Essays. * Friedman, Norman, E. E. Cummings: The Art of his Poetry. * James, George, E. E. Cummings: A Bibliography. * * McBride, Katharine, A Concordance to the Complete Poems of E.E.Cummings. * Mott, Christopher. \"The Cummings Line on Race .\" Spring: The Journal of the E. E. Cummings Society, vol. 4, pp. 71–75, Fall 1995. * Norman, Charles, E. E. Cummings: The Magic-Maker, Boston, Little Brown, 1972. * Sawyer-Lauçanno, Christopher, E. E. Cummings: A Biography, Sourcebooks, Inc. (2004) . == Other websites == * * E. E. Cummings, Lifelong Unitarian Biography of Cummings and his relationship with Unitarianism * Papers of E. E. Cummings at the Houghton Library at Harvard University * E. E. Cummings Collection at the Harry Ransom Center at the University of Texas at Austin * Poems by E. E. Cummings at PoetryFoundation.org * The paintings of E. E. Cummings * Jonathan Yardley, E. E. Cummings: A Biography, Sunday, October 17, 2004, Page BW02, The Washington Post Book Review * Christopher Sawyer- Lauçanno, E. E. Cummings: A Biography, Sourcebooks, Inc., 2004, 606 pages, * SPRING:The Journal of the E. E. Cummings Society * Modern American Poetry * American Poems, 153 poems listed with user comments Category:1894 births Category:1962 deaths Category:American poets Category:American Christians Category:Harvard University alumni Category:Writers from Massachusetts",
 "title": "E. E. Cummings"
}