{
 "id": "310974",
 "text": "Lawson Fusao Inada (born 1938 in Fresno, California) is an American poet and was the fifth poet laureate of the U.S. state of Oregon. ==Early life== Inada is a third-generation Japanese American (Sansei). As a child, Inada and his family were interned during World War II. Inada became a jazz musician, and this affected his writing. Inada cites jazz and his time in the internment camps as his chief influences as a poet. He studied writing at the University of California, Berkeley, the University of Oregon, and the University of Iowa. ==Career == He joined the faculty of Southern Oregon University in 1966. In 1994, Inada's Legends from Camp won an American Book Award; and he was awarded poetry fellowships from the National Endowment for the Arts. In 2006 Inada was named Oregon's poet laureate. ==Quotations== :::With new hope. :::We build new lives. :::Why complain when it rains? :::This is what it means to be free. :::: -- Lawson Inada, Japanese American Historical Plaza, Portland, Oregon ==Select works== * Three Northwest Poets: Drake, Inada, Lawder, Madison: Quixote Press, 1970. * Before the War; Poems as They Happened, New York: Morrow, 1971. * Aiiieeeee! An Anthology of Asian-American Writers, Washington, DC: Howard University Press, 1974 (Coeditor). * The Buddha Bandits Down Highway 99, Mountain View: Buddhahead Press, 1978 (With Garrett Kaoru Hongo and Alan Chong Lau). * The Big Aiiieeeee!: An Anthology of Chinese American and Japanese American Literature, New York: Penguin, 1990 (Coeditor). * Legends From Camp, Minneapolis: Coffee House Press, 1993. Winner, American Book Award. Finalist, Los Angeles Times Book Award for Poetry. * In This Great Land of Freedom: The Japanese Pioneers of Oregon, Los Angeles: Japanese American National Museum, 1993 (Contributor). * Touching the Stones: Tracing One Hundred Years of Japanese American History, Portland: Oregon Nikkei Endowment, 1994 (Contributor). * Just Intonations, Ashland, Oregon: Graven Images Gallery Press, 1996. * Drawing the Line, Minneapolis: Coffee House Press, 1997. Winner, Oregon Book Award for Poetry. A New York Public Library Book for the Teen Age. * Only What We Could Carry: The Japanese American Internment Experience, Berkeley: Heyday Books, 2000 (Editor and author of introduction). * Unfinished Message: Selected Works of Toshio Mori, Berkeley: Heyday Books, 2000 (Author of introduction). * A Matter of Conscience: Essays on the World War II Heart Mountain Draft Resistance Movement. Powell, Wyoming: Western History Publications, 2002 (Contributor). == Related pages == *List of poets from North America ==Notes== ==Further reading== * Leonard, George. (1999). The Asian Pacific American Heritage: A Companion to Literature and Arts. London: Taylor & Francis. * Niiya, Brian. (1993). Japanese American History: An A-to-Z Reference from 1868 to the Present. New York: Facts on File; Bonn: Verlag für die Deutsche Wirtschaft AG. OCLC: 26853950 ==Other websites== * PBS (US): Lawson Fusao Inada Category:1938 births Category:Living people Category:American jazz musicians Category:American poets Category:Musicians from Fresno, California Category:Writers from Fresno, California",
 "title": "Lawson Inada"
}