{
 "id": "311077",
 "text": "HM Prison Pentridge was an Australian prison built in 1850 in Coburg, Victoria. The first prisoners arrived in 1851. The prison was closed on 1 May 1997. Pentridge was often known by the nicknames \"The Bluestone College\", \"Coburg College\" or the \"College of Knowledge\". The grounds were originally landscaped by renowned landscape gardener Hugh Linaker. Since closing, much of the prison has been pulled down to make way for a housing development. Large buildings have been built and a 16 floor modern apartment block is being planned. The northern section of the prison being developed by Valad Property Group and the other areas by Pentridge Village. The National Trust does not like the development plans approved by Heritage Victoria. These plans include taking down sections of the outside walls and building apartments between the historic prison buildings. == Divisions == The prison was split into many divisions, named using letters of the alphabet. * A – Short and long–term prisoners of good behavior * B Long–term prisoners with behavior problems * C – Vagabonds and short term prisoners, where Ned Kelly was imprisoned (Demolished in 1976) * D – Remand prisoners waitng for trial * E – A dormitory division housing short term prisoners * F – Remand and short–term * G – Mental health problems * H – High security, discipline and protection * J – Young Offenders Group– Later for long–term with record of good behavior * Jika Jika – maximum security risk and for protection, later renamed K Division === Jika Jika high security unit === Jika Jika, opened in 1980 at a cost of AU$7 million. It was a 'gaol within a gaol', designed to hold Victoria's toughest and longest serving prisoners. It was awarded the 'Excellence in Concrete Award' by the Concrete Institute of Australia. It was closed after the deaths of five prisoners in 1987. Jika Jika had six separate units each at the end of radiating spines. It had electronic doors, closed–circuit television and remote locking. This meant it could use less staff but still have maximum security. The furnishings were sparse and prisoners exercised in escape proof yards. In 1983 four prisoners escaped from ‘escape proof’ Jika Jika. When two prison officers were disciplined in relation to the Jika Jika escape a week–long strike occurred. === 1987 Jika Jika prison fire === Inmates Robert Wright, Jimmy Loughnan, Arthur Gallagher, David McGauley and Ricky Morris – from one side of the unit – and Craig 'Slim' Minogue and three other inmates on the other side sealed off their section doors with a tennis net. Mattresses and other bedding were then stacked against the doors and set on fire. They covered windows in the day room with paper so the prison officers could not see which prisoners caused the damage. Prisoners Robert Wright, Jimmy Loughnan, Arthur Gallagher, David McGauley and Ricky Morris died in the fire. Convicted Russell Street bomber Craig Minogue and three other inmates survived as they were evacuated when the fire started. == Grave sites == The graves of executed prisoners were unmarked in a corner of the prison. In 1929, 32 bodies were moved from the Melbourne Gaol during the building of the Royal Melbourne Institute of Technology. These graves were found in 2008. The skeleton of bushranger Ned Kelly was among those discovered. ==Executions== There were 11 executions at Pentridge. The gallows beam and the trapdoor were moved from the Melbourne Gaol and put into \"D\" Division in 1924. * Robert David Bennett 26 September 1932 * Arnold Karl Sodeman 1 June 1936 * Edward Cornelius 26 June 1936 * Thomas Johnson 3 January 1939 * George Green 17 April 1939 * Alfred Bye 22 December 1941 * Eddie Leonski (US soldier and serial killer) 9 November 1942 * Jean Lee 19 February 1951 * Norman Andrews 19 February 1951 * Robert David Clayton 19 February 1951 * Ronald Joseph Ryan 3 February 1967 When the gaol was closed, the beam and the trapdoor were taken back to the Melbourne Gaol to be part of its historical display. ===Last execution=== Ronald Ryan was the last man executed at Pentridge Prison and in Australia. Ryan was hanged in \"D\" Division at 8.00 on 3 February 1967. He had been convicted of murdering a prison officer during an escape from the same prison. Later that day, Ryan's body was buried in an unmarked grave within the \"D\" Division. There is still debate about his hanging. == Notorious prisoners == * Dennis Allen, oldest member of the Pettingill family. (d. 1987) * Garry David, (d. 1993), also known as Garry Webb, responsible for the Community Protection Act 1990 * Peter Dupas, Australian serial killer * Keith Faure, Convicted of murdering Lewis Caine and Lewis Moran with Evangelos Goussis during the Melbourne gangland killings. He was also the basis for the character of Keithy George in the film Chopper * Christopher Dale Flannery, also known as \"Mr Rent–a–Kill\", hitman. * Kevin Albert Joiner, murderer, shot dead trying to escape in 1952. * Ned Kelly, bushranger * Julian Knight, murdered seven people in the Hoddle Street Massacre * Eddie Leonski, the Brownout Strangler * Craig 'Slim' Minogue, Russell Street Bomber * Clarrie O'Shea, trade unionist * Frank Penhalluriack * Victor Peirce, member of the Pettingill family, acquitted of the 1988 Walsh Street police shootings. Killed in 2002. * Harry Power, bushranger * Mark \"Chopper\" Read, Gang leader * Gregory David Roberts, Author of Shantaram, escapee of Pentridge who fled to India * Ronald Ryan – The last person to be executed in Australia. * Maxwell Carl Skinner, constant escapee, who used a tram in one of his escapes * William Stanford, sculptor * Stan Taylor, actor and convicted Russell Street bomber * Squizzy Taylor, gangster * John Zarb, first person to be found guilty of having failed to comply with his call up notice during the Vietnam War == Timeline == * 1850's 'F' Division opened * 1870's 'G' Division opened as an Industrial Reformatory School * 1894 Female prison at Pentridge ('D' Division) * 1951 Last woman executed in Australia, Jean Lee is hanged. * 1967 Last execution in Australia – Ronald Ryan (between 1842 and 1967, 186 prisoners were executed) * October 1987 – Five prisoners die in a fire in Jika Jika during riots over prison conditions. Craig Minogue and three other inmates survived the fire. * 1 May 1997 – Pentridge Prison is closed. * Present day – Redeveloped as a housing estate. ==Escapes== *1899 Pierre Douar – Suicided after recapture *1901 Edward Sparks – never heard of again *1901 John O'Connor – Caught in Sydney two weeks later *1926 John Keith Monson, also known as \"Stokesbury\" and \"Richard Morrenci\", caught several weeks later in W.A. *1939 George Thomas Howard – caught after two days *1940 Kevin R. Jones – Caught in Sydney two weeks later *1951 Victor Franz – caught next day. *1952 Kevin Joiner – Shot dead during an escape *1952 Maxwell Skinner – pushed off prison wall while fighting with a warder and broke his leg *1957 Willam O'Malley – caught after 15 minutes *1957 John Henry Taylor – caught after 15 minutes *1961 Maurice Watson – caught next day *1961 Gordon Hutchinson – caught next day *1965 Ronald Ryan – caught in Sydney 19 days later *1965 Peter Walker – caught in Sydney 19 days later *1972 Dennis Denehy – *1972 Gary Smedley – *1972 Alan Mansell – *1972 Henry Carlson – *1973 Harold Peckman – caught next day *1974 Edward \"Jockey\" Smith *1974 Robert Hughes *1974 George Carter – *1976 John Charles Walker – *1977 David Keys – *1980 Gregory David Roberts (at the time known as Gregory Smith) – escaped in broad daylight with Trevor Jolly and subsequently went to India after a brief period in New Zealand *1980 Trevor Jolly – *1982 Harry Richard Nylander – *1987 Dennis Mark Quinn – Recaptured in New Zealand 19 days later == Usage in media== * The front gate showing the \"HM Prison Pentridge\" sign is featured on the cover of Australian band Airbourne's debut album Runnin' Wild.Airbourne's official site, accessed 1 August 2009 * Episode 2, Homecomings of the 1976 ABCTV adaption of Frank Hardy's Novel Power Without Glory features John West picking his brother Frank West up from Pentridge Prison after serving 12 years for rape. * The 1988 John Hillcoat and Evan English film \"Ghosts... Of The Civil Dead\" was largely based on events which occurred in Pentridge Prison's infamous Jika Jika Maximum Security prison during the lead up to the 1987 fire. * The 1994 Australian film Everynight ... Everynight details prison life inside Pentridge's H Division.Everynight... Everynight , National Film and Sound Archive, Accessed 8 March 2008 * The 2000 Andrew Dominik film \"Chopper\" was partially filmed in H Division. == References == == Other websites == *http://www.forbidden-places.net/urban- exploration-h-m-melbourne-s-pentridge-prison Category:Prisons in Australia Category:Buildings and structures in Melbourne Category:Law enforcement in Australia Category:1851 establishments in Oceania Category:1997 disestablishments Category:1850s establishments in Australia Category:20th- century disestablishments in Australia",
 "title": "HM Prison Pentridge"
}