{
 "id": "311171",
 "text": "Reel-to-reel tape recorders (often called R2R, open reel decks, etc.) were used during the 20th century, mostly in professional studios from the 1940s and quickly spread into people’s homes in the 1950s and 1960s. Popularity peaked in the 1970s, probably because people needed higher quality recordings. This technology was like a revolution, because everyone could record any kind of sound (vinyl records, radio broadcast, voice and music), then play it many times without the quality getting worse, and they could overwrite it many times. This technology has some weak points though: size of reels, sensibility, durability; but still, it has certain advantages over today’s “digital media formats.” Also, some famous bands and artists used reel to reel technology as a musical instrument Emerick, Geoff. Here, There & Everywhere - Geoff Emerick's Life Recording The Beatles. 6. Gotham Book, 2006. 113,139,168,215. Print. or even as a separate band.http://blog.makezine.com/archive/2008/12/reeltoreel-ensemble.html == Technical information == These reel to reel decks are usually analogue sound devices using a magnetic tape of ¼ inch (i.e. 6.25 cm) width. This plastic tape is covered by a special magnetic substance which is being made into magnetic domains when it is being recorded. The tape recorder must have a record, playback and an erase head which transfer the signal onto the tape. The more expensive tape decks have three or six separate heads. Tape recorders combine knowledge both on mechanics and electronics. There must be very precise motors and moving parts, but also a complicated circuit board. It has to contain transistors, amplifiers etc. The usual functions of tape recorders are: *Playback (play) *Stop *Rewind *Fast forward *Pause These functions can be handled mechanically (system of rubber belts and metal levers), or electronically (magnets, coils, integrated circuits). == Tape speed == The tape speed \"Analog Tape Recorders.\" N.p., n.d. Web. 17 Oct 2011. . is one of the things that finds out the playback time. This table gives information on tape speed and the playback time with an 18 cm reel. Tape speed (cm/s) Description Playback time (min) 9.52 Lower, but O.K. quality 128 19.05 Standard-quality home use 64 38.10 Semi-professional or high quality use 32 76.20 Professional studio quality 16 == Major producers == There were many producers during the era of tape recorders, such as Sony, Akai, Revox, Teac, Pioneer, Technics, Tesla and many others. These producers usually had several product series', which were different in price and functions. The best ones had digital programmable counters, reverse mechanic, electronic buttons, they could use big reels (such as 26.5 cm). There was also a big selection of tape producers – Maxell,\"The Maxell Reel To Reel Tape Collection.\" 28 06 2008. Online Posting to Tapeheads.net. Web. 10 Oct. 2011. . Basf (Emtec), Quantegy, Agfa, etc. == Reel-to-reel tape recorders in Czechoslovakia == There were only a few producers of tape recorders in Czechoslovakia. The most important was Tesla, n.p.Hájek, Martin. \"Magnetofony Tesla.\" Oldradio.cz. N.p., n.d. Web. 8 Oct 2011. . The main development was realized in Tesla Pardubice, but the mass production was held in Tesla Přelouč. Product numbers were in thousands pieces and tens of model lines. One of the most popular decks was monophonic Tesla Sonet Duo (1959).\"Magnetofon Tesla Sonet Duo ANP210.\" Staré stroje. Vilém Mitlöhner, 22 09 2009. Web. 10 Oct. 2011. . It was compact, portable and reliable. The collectors of Tesla decks agree that probably the most progressive model was Tesla B73 Hi-Fi Stereo (1978)Mitlöhner, Vilém. \"Magnetofon Tesla B73 Hi-Fi stereo.\" Staré stroje. Vilém Mitlöhner, 12 11 2006. Web. 10 Oct. 2011. . which provided the principles to the later models. The supreme models were Tesla B115,Mitlöhner, Vilém. \"Magnetofon Tesla B115 Hi-Fi stereo.\" Staré stroje. Vilém Mitlöhner, 10 10 2008. Web. 10 Oct. 2011. . B116 (1981) and Tesla CM130,\"Magnetofon Tesla CM130 Hi-Fi stereo.\" Staré stroje. Vilém Mitlöhner, 11 07 2010. Web. 8 Oct. 2011. . CM160 \"Magnetofon Tesla CM160 Hi-Fi stereo.\" Staré stroje. Vilém Mitlöhner, 10 03 2008. Web. 10 Oct. 2011. . (1986) which were able to compete with similar models made by world’s producers. Still, there were (political) restrictions, so the best ideas and solutions could not be realized. The manufacture finished in 1990 as this technology turned out to be out-of-date. == Use with computers == In the 1960s and 1970s, tape recorders were used to store programs and data.http://www.ehow.com/about_5247428_use-magnetic-tape-computers.html They record data as a sequence of tones of certain frequency. Nowadays, this method is used only to create backups, because the data rate of magnetic tape is very low. == References == Category:Magnetic tape",
 "title": "Reel-to-reel tape recorders"
}