{
 "id": "311200",
 "text": "The International Covenant on Civil and Political Rights is a treaty made by the United Nations. It is to help civil rights get better. The rights are listed in the Universal Declaration of Human Rights. It is one of the most important treaties in international human rights law. The Covenant was adopted on 16 December 1966 with the International Covenant on Economic, Social and Cultural Rights. It was put into force in 1976. The United Nations set up the Committee on Civil and Political Rights (CCPR) to carry out the treaty. == Main contents == *Article 1. Right to self-determination. *Article 6. Right to life and on Genocide Convention. *Article 7. Free from torture and any inhuman treatments. *Article 8. Free from slavery and unfree labour. *Article 9. Right to personal security and protection from arbitrary arrest and detention. Right to demand remedy if proved innocent. *Article 10. The right to be treated with humanity and repected dignity while in detention. *Article 12. Freedom of movement, freedom to leave and to enter one's own country. *Article 14. The right to a fair trial and to be regarded as innocent until found guilty. *Article 16. Right to be recognized as a person before law. *Article 17. Right to privacy and protection from attack of honour. *Article 18. Freedom of thought, conscience and freedom of religion. *Article 19. Freedom of expression and freedom of speech but with special duty and responsibility not to harm others. *Article 20. prohibition of propaganda of war and any inciting of hatred and discrimination. *Article 21. Freedom of assembly. *Article 22. Right to association and trade union. *Article 23. Right to family and marriage with free will of each person (against forced marriage). *Article 25. Right to free and fair voting. *Article 26. Equality before law and protection from all discriminations by law. *Article 27. Right to minority groups and ethnic group and to use their own language. == Optional protocols == This Covenant has two optional protocols. One of them is to allow a citizen whose rights have been violated to claim before the CCPR. The other is to prohibit the death penalty. There are countries which ignore, or do not agree with, the optional protocols. ==Related pages== *Civil and political rights *Civil rights *International human rights law *Universal Declaration of Human Rights *Human rights == Other websites == *International Covenant on Civil and political Rights == References == Category:United Nations Category:Human rights",
 "title": "International Covenant on Civil and Political Rights"
}