{
 "id": "311298",
 "text": "Wolfgang Köhler (21 January 1887 – 11 June 1967) was a German psychologist who, like Max Wertheimer and Kurt Koffka, helped create Gestalt psychology. He was the first to show that apes could solve problems by thinking.Köhler, Wolfgang 1925. The mentality of apes, transl. from the 2nd German edition by Ella Winter. Kegan, Trench: London and Harcourt, Brace and World: New York. Original was Intelligenzprüfungen an Anthropoiden, Berlin 1917. ==Gestalt psychology== In 1910–13, he worked with fellow psychologists Max Wertheimer and Kurt Koffka. He and Koffka were subjects for Wertheimer’s studies, which led them to conclusions about the nature of vision.What this means is that from the eye to the visual cortex at the rear of the cerebral cortex, the structure is inherited, and the processing automatic. On the other hand, higher visual functions (like interpreting the visual field) are learned during early life. They collaborated on the founding of a new holistic attitude toward psychology called Gestalt theory, from the German word for “whole\". This was influenced by some earlier work of Carl Stumpf (Köhler’s teacher) and Christian von Ehrenfels. Wertheimer had attended Ehrenfels' lectures at the University of Prague. Köhler’s famous quote, “the whole is different from the sum of its parts” is usually quoted differently.Pratt, Carroll 1969. The task of gestalt psychology. Introduction. Though perhaps a simple error made in translation, many lectures in textbooks of modern-day psychology quote Gestalt theory by saying “the whole is greater than the sum of its parts”. It is difficult to imagine that a translation error occurred here, especially when considering that ‘greater’ is ‘größer’ and ‘different’ is ‘unterschiedlich’ in German, respectively. ==Problem solving== In 1913, Köhler left Frankfurt for the island of Tenerife in the Canary Islands, to be the Director of the Prussian Academy of Sciences anthropoid research station. Here, Köhler observed how chimpanzees solved problems, such as that of retrieving bananas when placed out of their reach. They stacked wooden crates to use as makeshift ladders, in order to get the food. If the bananas were placed on the ground outside the cage, they used sticks to lengthen the reach of their arms. Köhler concluded that the chimps had not arrived at these methods through trial-and-error. American psychologist Edward Thorndike claimed this was the basis of all animal learning: his law of effect. Instead, the chimps had an insight (also known as an “aha experience”). They saw the answer mentally, then they got the bananas in a way which was, in Köhler’s words, “unwaveringly purposeful”. So, he concluded that the animals were capable of problem-solving and that they did not arrive at their methods through trial and error. This is one of the most important findings from the research done on apes. Köhler’s work on the mentality of apes was a turning point in the psychology of thinking. In the book The mentality of apes, Köhler explains that he was inspired to work with the chimpanzees for two main reasons. The first was because the “structure of their brains is more closely related to the chemistry of the human body and brain-structure than to the chemical nature of the lower apes and their brain development” Köhler (1925). The fact that human traits can be observed in the everyday behaviours of this animal was very intriguing for Köhler. Kohler also wanted to gain knowledge of the nature of intelligent acts. Köhler recognized that, like humans, there is a great deal of individual differences in intellect. Chimps showed that they were able to grasp the objects around them in a variety of fashions. This is incorporated in their everyday playing behaviours. For this reason, it was not necessary to use experimental tests to introduce chimps to handle matter. In his book, Köhler describes how the apes use their hands: “large, powerful and flexible hands are natural links between himself and the world of things, and he attains the necessary amount of muscular force and co-ordination at an earlier age than the human child” Köhler (1925). == Books by Köhler == These are the editions in English: *1925. The mentality of apes, transl. from the 2nd German edition by Ella Winter. London: Kegan, Trench and New York: Harcourt, Brace and World. Original was Intelligenzprüfungen an Anthropoiden, Berlin 1917. 2nd German edition was titled Intelligenzprüfungen an Menschenaffen, Berlin: Springer 1921. Liveright 1976 reprint: *1929. Gestalt psychology. New York: Liveright. London: Bell 1930. A heavily revised translation into German, Psychologische Probleme, was published in 1933 by Springer, Berlin. *1938. The place of value in a world of facts. New York: Liveright. Norton reprint 1976: *1940. Dynamics in psychology. New York: Liveright. *1947. Gestalt psychology: an introduction to new concepts in modern psychology. New York: Liveright. A revised edition of the 1929 book. Norton 1992 reprint: *1969. The task of gestalt psychology. Princeton University Press. *1971. Henle, Mary (ed). The selected papers of Wolfgang Köhler. New York: Liveright. == References == Category:German psychologists Category:1887 births Category:1967 deaths",
 "title": "Wolfgang Köhler"
}