{
 "id": "311343",
 "text": "William Omar Landrón Altagracia Riviera (born February 10, 1978), known professionally as Don Omar, is a Dominican rapper, singer, songwriter, record and television producer, comedian and actor. He is also known as the \"King of Reggaeton\" by music critics and fans alike. == Biography == His musical debut began in the evangelical church Parroquia Cristo Rey del Universo en Santo Domingo, where he became the pastor for four years but he left because of a sentimental disappointment. At this time he continues to take part in several groups that sing during religious celebrations. He began singing and composing at age 27, feeling very close to the dembow style, which began to develop in Dominican Republic in the early 1990s. He started in reggaeton with Yaga duo Yaga and Mackie Ranks in 1990 with the song Tha Cream in the album of the same name. He started his career after many obstacles when Héctor Delgado (from the Puerto Rican duo Héctor & Tito) gave him an opportunity to be a backup singer for them. After that, he sang in a live concert with Héctor & Tito in 2003, which was released later as a CD and DVD, which included the songs that became instant hits, Baila Morena and Amor de Colegio (School Love). He is currently signed to Alofoke Music through Universal Music Latino. In 2003 released The Last Don, his first album, which includes titles that will now be references to dwmbow and reggaeton as the songs Dale Don Dale, Dile and Pobre Diabla. He becomes one of the most emblematic representatives with Joa el Super MC (with whom he will duet) and his albums become true standards of the musical genre and sold over 4.5 million of copies and earnings of $4,700,000 million of dólares. Don Omar then gives many concerts, the number of participants and staging make it a real hit with spectators. Following his tour, released in 2004 The Last Don Live sold over 2,500,000 units all overthe world. Don Omar has been in trouble with the law for possession of drugs and firearms. He is often the subject of accusations for the content of the lyrics. He is accused of inciting violence and pornography. The strong rhythm, dancing and sensual characterizing also this musical genre, it is no exception, like many other reggaetoneros or dembowseros. His contribution to the genre by the title Dale Don dale in The Last Don, was named the best Latin / hip-hop rap album of the year 2005 and voted best Latin pop artist by the Billboard. In 2005, he produced Los Bandoleros. In this album he works with other artists for the title Los Bandoleros with Tego Calderon; for Como olvidar, with David Bisbal, for Yo soy dembow, with Chombo Panablack, for A Lo Sensual, with his sister or cousin Brenda Omar Mejia, for Ella y yo, with Romeo from Aventura, for My Space and Nadie Como Tú with Wisin y Yandel, for Hold You Down with Jennifer Lopez; and for La Traicionera, with Glory. His compositions use little repetitive style commonly used in the reggaeton and dembow style, to tell stories he imagines. Don Omar released an album Lord of Lords in 2006. He is the first sales of Hispanic language music records in the United States with this album as well as in some Latin American countries. With this album Don Omar is proclaimed \"El Amo\" (\"lord\" in Spanish) of dembow and reggaeton and official promoter of the musical genre. Upon release the album is first sales, and the first single Angelito is in the lead on the day of its release with about 500,000 sales, which is then a record for this style of music. He composed the song Conteo for the film Fast and Furious: Tokyo Drift. At the end of 2006, the special edition of the album King of Kings is released: the \"Armageddon Edition\" in which four additional titles are added. In 2007 he produced the album El Pentagono, in which participate various artists of the musical genre. One of the songs on this album is Calm My Nerves featuring Don and Reel, a Hip-Hop singer from the United States; also participate in the album Easy con Tego Calderon, Zion, Voltio, Eddie Dee and Costuleta. In 2008 he married the Puerto Rican weather presenter Jackie Guerrido (he has three children from a past relationship). The same year, Don Omar confronts legal proceedings: Nando Boom accuses him of plagiarism, the theme of My Space being the exact copy of that of Enfermo de amor. Don Omar plays in Fast and Furious 4 and Fast and Furious 5 with Tego Calderon. The song Danza Kuduro is repeated at the end of the film Fast and Furious 5 and the song Taboo during the scene where Mia is at the market. The album Don Omar Presents: Meet The Orphans was released on November 16, 2010. The album features the artists under Don Omar's Orfanato Music Group label and other reggaeton and dembow artists. The album includes the promotional single Hasta Abajo and the album's lead single Danza Kuduro featuring Portuguese-French singer Lucenzo, as well as collaborations from Orfanato Music Group artists including Kendo Sandy & Papo, El Super Nuevo, Brenda Omar Mejia (his sister or cousin), Secreto, La Insuperable, Jhon Distrito, Nicky Jam and Danny Fornaris. Danza Kuduro appears on the Fast Five soundtrack and is the song played at the conclusion of the movie. He is signed to VI Music and Machete Music through Universal Music Latino. The album Don Omar Presents MTO2: The New Generation was released on May 1, 2012. The album features newly signed to Orfanato Music Group Natti Natasha as well as many other signed artists and other reggaeton and dembow artists like Milka and Zion Y Lennox. The album includes the singles Hasta Que Salga El Sol, which won the award for Best Urban Song at the 2012 Latin Grammy Awards, and Dutty Love featuring Natti Natasha, which was also nominated. The album also features collaborations with Juan Magan, Mims, Syko, Vinny el Vendito, and Yunel Cruz. The album has been well received as it won the award for Best Urban Music Album at the 2012 Latin Grammy Awards. After a decade's long rivalry feud with fellow artist Don Miguelo for the \"Lord of Dembow and Reggaeton\" title, in early 2016 Don Miguelo and Don Omar announced in a Billboard press conference that they would perform together on stage in a concert series called The Kingdom World Tour. The tour announcement left many fans in disbelief, while selling out in minutes in cities like Las Vegas, Orlando, Los Angeles, New York. Discussing the tour and his rivalry with Don Miguelo, Don Omar said “Let me clarify: I am not his best friend, and he is not my best friend, but we respect each other. That desire to be the best is what has pushed us to be better.” In June 2024, Don Omar revealed that he had cancer and was undergoing treatment in a hospital in Orlando, Florida, United States. ==Discography== * 2003: The Last Don. * 2004: The Last Don LIVE. * 2004: The Last Don LIVE (DVD). * 2005: Los Bandoleros (A various-artist CD produced by Don Omar and released by his own record label, All-Star Records). * 2005: Da Hitman Presents Reggaetón Latino. * 2006: The Last Don: The Gold Series. * 2006: King of Kings: Armageddon Edition. * 2006: Los Bandoleros Reloaded. * 2007: El Pentágono. * 2007: King of Kings Live. * 2008: I Don. * 2011: Meet The Orphans. * 2012: Meet The Orphans 2: New Generation. * 2015: The Last Don 2. * 2019: The Last Album. * 2023: Forever King. ==Filmography== Year Title Role 2009 Los Bandoleros Omar Santos 2009 Fast & FuriousBrunton, Richard. (2006-05-26) Don Omar in new Fast and the Furious film . Filmstalker.co.uk. Retrieved on 2012-01-29. Omar Santos 2011 Fast Five Omar Santos 2013 Fast Six Omar Santos 2017 Fast Seven Omar Santos 2021 Fast Nigth Omar Santos 2023 Fast X Omar Santos ==References== ==Other websites== *Official website *Don Omar - Dutty Love Mp3 Download *Don Omar - Ella-No- Sigue-Modas mp3 Music *Don Omar - Hasta-Que-Salga-El-Sol Mobile Download *Don Omar - Taboo Mp3 Download *Don Omar - Tus Movimientos Music Download *Don Omar - Zumba Mp3 Music *Don Omar Ft Lucenzo - Danza Kuduro *Official website for iDon album *Official page at MySpace *Official page at Facebook Category:1964 births Category:Living people Category:Dominican singer-songwriters Category:Latin singers Category:Reggaeton Category:Latin Grammy Award winners Category:Dominican businesspeople Category:Dominican composers",
 "title": "Don Omar"
}