{
 "id": "311670",
 "text": "Saeed Shehabi is a Bahraini thinker, political activist, commentator and journalist. He is a regular columnist in the daily Arabic Al-Quds newspaper.Arabic Al-Quds newspaper: http://www.alquds.co.uk/ He gives regular interviews to the BBC's Middle East Service and AlJazeera. He is also the Director of Abrar House,Abrar House: http://www.abraronline.net an Islamic community center in Central London that promotes interfaith work. He is also the leader of the pro-democractic Bahrain Freedom Movement,Bahrain Freedom Movement: http://www.vob.org that is a banned Bahraini opposition group. He was also a founding member of Al-Wefaq National Party.Al-Wefaq National Party: http://alwefaq.net/ He was previously the editor of Alalam magazine and now hosts a weekly television programme on Alalam TV.Alalam TV: http://www.alalam.ir/ He has been living in exile in London since 1979 and returned to Bahrain on two occasions in 2002. He has a PhD in engineering from City University. Saeed Shehabi is married and has seven children. On August 2010, Bahrain TV Bahrain TV: http://www.alayam.com/tv/home.htm declared that Saeed Shehabi is accused of being the second leading member of a terrorist network.Bahrain News Agency: http://english.bna.bh/?ID=89455'Terrorist Network' revealed on BTV: https://www.youtube.com/watch?v=fiHWKZ8L71c He is currently being tried in absentia along with Hassan Mushaimi. The Bahraini government claimed that a red notice was issued by interpol for his arrest, however this has not been verified.Daily Telegraph:Interpol Red Notice Issue:https://www.telegraph.co.uk/news/worldnews/middleeast/bahrain/8081933/Bahrain- royal-family-facing-unprecedented-challenge-in-election.html In 1996 he was similarly sentenced to 15 years in prison in absentia. In the summer of 2009, Saeed Shehabi's home was attacked by arsonists.House of Bahraini opposition activist firebombed: https://www.youtube.com/watch?v=IkGcZLtNboU == References == Category:1954 births Category:Living people Category:Bahraini activists Category:Journalists",
 "title": "Saeed Shehabi"
}