{
 "id": "311680",
 "text": ", also known as Heijō-tennō. was the 51st emperor of Japan,Imperial Household Agency (Kunaichō), 平城天皇 (51); retrieved 2011-10-21. according to the traditional order of succession.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, pp. 62-63. Heizei's reign started in 806 and ended in 809. ==Traditional history== Before he became the monarch, this prince's personal name (imina) was . Heizei was the eldest son of the Emperor Kammu. He had three empresses and seven sons and daughters. ===Events of Heizei's life=== Before he became the monarch, he was Crown Prince for over twenty years. * 785 (Enryaku 4, 11th month): Heizei was appointed Crown Prince at the age of 12. * 9 April 806 (Daidō 1, 17th day of the 3rd month): In the 25th year of Kammu's reign, the emperor died; and the succession (senso) was received by his son. A short time later, Emperor Heizei is said to have acceded to the throne (sokui). This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. * 809 (Daidō 4, 1st month): After a reign of four years, Heizei fell ill and he feared that he would die. Heizei abdicated in favor of his younger brother who would be known as Emperor Saga. After abdicating, Heizei moved to Nara; and he was known as the \"Emperor of Nara\" (Nara no Mikado). * 18 May 809 (Daidō 4, 1st day of the 4th month): Emperor Saga was enthroned at age 24. * 810 (Kōnin 1): Heizei became a Buddhist monk. * 5 August 824 (Tenchō 1, 7th day of the 7th month): Heizei died at 14 years after his abdication. ===After his death=== According to the Imperial Household Agency, the mausoleum (misasagi) of Heizei is in Nara. The emperor is traditionally venerated at a memorial Shinto shrine at this location. The site can be visited by the public.Nara City Sightseeing Information Center (Narashikanko): Heizei's misasagi, map ; retrieved 2011-10-21. ==Era of reign== The years of Heizei's reign are identified by only one era name (nengō). * Daidō (806-810) ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree ==References== Category:Emperors of Japan Category:773 births Category:824 deaths",
 "title": "Emperor Heizei"
}