{
 "id": "311826",
 "text": "Separatist movements are groups of people wanting to start a new country that is separate from a large existing country. In India, some groups want separate countries for groups that have ethnic or language differences. Some groups call for a separate state, others for regional autonomy while some extreme groups demand complete full independence from India. ==Arunachal Pradesh == Part of Arunachal Pradesh is belong to the disputed territory of Southern Tibet. * Proposed autonomous area: Teola country ** Militant organisation: Arunachal Dragon Force or East India Liberation Front * Proposed autonomous area: Hajong Chakma Homeland ** Political organisation: All Hajong Chakma Homeland Movement The Arunachal Dragon Force (ADF), also known as the East India Liberation Front, is a violent secessionist movement in the eastern Indian state of Arunachal Pradesh. The ADF seeks to create a state resembling the pre-British Teola Country consisting of area currently in Arunachal Pradesh as well as neighboring Assam. == Assam == * Proposed state: Assam Bodoland ** Militant organisation: United Liberation Front of Assam, National Democratic Front of Bodoland Geographically and culturally, the region now called north-east India is between the two traditions of Indic Asia and Mongoloid Asia and is regarded as part of Southeast Asia. This geographical- cultural condition of \"in-betweenness\" is an important factor in the area’s crisis of identity. The leaders of the present-day \"underground outfits\" continue to struggle for independence, as the political integration of the northeast to India was brought about without the approval of its people. The people of northeast India, who are culturally Mongoloid, refuse to accept the caste-ridden social system advocated by ‘Indian’ culture. Similar struggles for independence are also going on in other northeastern subdivisions or sister regions, such as Assam, Manipur, Mizoram, Meghalaya and Nagaland. Assam has been the hotbed of militancy for a number of years due to its porous borders with Bangladesh and Bhutan. The main causes of the friction include the anti-foreigner agitation in the 1980s and the simmering Assam-Bodo tensions. The insurgency status in Assam is classified as very active. The government of Bangladesh has arrested and extradited senior leaders of ULFA or the United Liberation Front of Asom was formed in April 1979 to establish a sovereign state of Assam through an armed struggle. In recent times the organisation has lost out its middle rung leaders after most of them were arrested. The National Democratic Front of Bodoland was formed in 1989 as the Bodo Security Force, aims to set up an autonomous region Bodoland. Problems in Meghalaya arise from the divide between tribals and non tribal settlers, identity issues and growing corruption besides the fear of being reduced to minority by native tribals. The activity status is classified as active. == Nagaland == * Proposed state: Nagalim or People's Republic of Nagaland ** Government-in-exile: Government of the People's Republic of Nagaland ** Militant organisation: National Socialist Council of Nagaland Nagaland was created in 1963 as the 16th State of Indian Union, before which it was a district of Assam.http.//.www.indianetzone.com/3/nagaland Insurgent groups classified as active, mainly demand full independence. The Naga National Council led by Phizo was the first group to dissent in 1947 and in 1956 they went underground. == Jammu and Kashmir (India) == :Note that the disputed territory of Jammu and Kashmir is not recognised by Pakistan and China * Proposed state: Independent United States of Kashmir ** Political organisations: All Parties Hurriyat Conference, Jammu Kashmir Liberation Front ** Militant organisations: Lashkar-e-Toiba, Harkat-ul-mujahideen, Jaish-e- Mohammad Both India and Pakistan say that Kashmir is a part of their nation. At one time, they were both a single country. India was divided based on which Party(Congress or Muslim league was more popular in each state. They fought wars over which country should get Kashmir. Separatists say that Kashmir should be a country that is separate from both India and Pakistan. == Punjab (India) == * Proposed state: Khalistan ** see Khalistan Movement == Andhra pradesh (India) == * Proposed state: Andhra == Telangana (India) == * Proposed state: Telangana ==References==",
 "title": "Separatist movements of India"
}