{
 "id": "312084",
 "text": "Isaac Titsingh (10 January 1745 in Amsterdam – 2 February 1812 in Paris) was a Dutch surgeon, scholar, merchant-trader and ambassador.Nussbaum, Louis- Frédéric. (2005). \"Isaak Titsingh,\" Japan Encyclopedia, p. 966. ==Japan, 1779-1784== At Dejima Island in Japan, Titsingh was the head of the Dutch East India Company(Vereenigde Oost-Indische Compagnie or \"VOC\" in Dutch) during 1779-1780, 1781–1783, and 1784. In these years, the Japanese policy of seclusion of isolation (sakoku) limited all contact with non-Japanese.Edo- Tokyo Museum. (2000). A Very Unique Collection of Historical Significance: The Kapitan (the Dutch Chief) Collection from the Edo Period -- The Dutch Fascination with Japan, p. 207. In this highly controlled context, the VOC traders became the sole official conduit for trade and for scientific-cultural exchanges between Japan and the West. Titsingh is believed to have been the first Freemason in Japan. Far East Lodge No. 1, \"A Brief History of Freemasonry in Japan;\" excerpt, Titsingh \"is believed to be the first mason to visit Japan\" in 1779 ==India, 1785-1792== In 1785, Titsingh was appointed Director of the VOC trading post at Chinsura in Bengal. He formed a friendship with William Jones, the philologist and Bengal jurist.Jones, William. (1835). Memoirs of the life, writings and correspondence of Sir William Jones, by Lord Teignmouth. London. ==Batavia, 1792-1793== Titsingh’s return to Batavia (now Jakarta, Indonesia) led to new VOC positions as Ontvanger-Generaal (Treasurer) and later as Commissaris ter Zee (Maritime Commissioner). In Batavia, Titsingh met with the British Ambassador do China, Lord Macartney who was travelling to the Imperial Court in Peking. Titsingh encouraged McCartney to give up on a planned expedition to Japan in 1793.Macartney to Dundas, 23 December 1793, British Library, India and Oriental, Factory Records, China, 1084 G/12/20. ==China, 1794-1795== Titsingh was appointed Dutch Ambassador to the court of the Emperor of China. He was in Peking for the celebrations of the sixtieth anniversary of the reign of the Qianlong Emperor. In Peking, the Titsingh delegation included Andreas Everardus van Braam Houckgeestvan Braam Houckgeest, Andreas Everardus. (1797). Voyage de l'ambassade de la Compagnie des Indes Orientales hollandaises vers l'empereur de la Chine, dans les années 1794 et 1795; see also 1798 English translation: An authentic account of the embassy of the Dutch East-India company, to the court of the emperor of China, in the years 1974 and 1795, Vol. I. and Chrétien-Louis-Joseph de Guignes.de Guignes, Chrétien-Louis-Joseph (1808). Voyage a Pékin, Manille et l'Ile de France. Titsingh is believed to have been the first Freemason in China.Screech, Timon. (2006). Secret Memoirs of the Shoguns: Isaac Titsingh and Japan, 1779-1822, p. 58; excerpt, \"Titsingh became the first Freemason ever to set foot in China....\" and the only to be received personally in the court of the Qianlong emperor. ==Return to Europe, 1796-1812== Among the Japanese books brought to Europe by Titsingh, was a copy of by Hayashi Shihei (1738–93). This book, which was published in Japan in 1785, deals with Chosen (Korea) and the kingdom of Ryukyu (Okinawa) and Ezo (Hokkaido).Cullen, Louis M. (2003). A History of Japan, 1582-1941: Internal and External Worlds, p. 137. In Paris, the text represented the first appearance of Korean han'gŭl in Europe.Vos, Ken. \"Accidental acquisitions: The nineteenth-century Korean collections in the National Museum of Ethnology, Part 1,\" p. 6. ===After his death=== Titsingh died in Paris (February 2, 1812), and he is buried in Père- Lachaise cemetery.Titsingh's gravestone reads: \"Ici repose Isaac Titsingh. Ancien conseiller des Indes hollandaises. Ambassadeur à la Chine et au Japon. Mort à Paris le 2 Février 1812, agé de 68 ans.\" (\"Here lies Isaac Titsingh, formerly a councillor of the Dutch East India Company, Ambassador to China and to Japan. Died at Paris the 2nd of February 1812, aged 68 years.\") After Titsingh's death, the printed original and Titsingh's translation were purchased by Jean-Pierre Abel-Rémusat (1788–1832) at the Collège de France.Kublin, Hyman. \"The Discovery of the Bonin Islands: A Reexamination,\" Annals of the Association of American Geographers, Vol. 43, Issue 1 (March 1, 1953). p. 35. In 1832, Julius Klaproth (1783-1735) at the Institut Royal publish his edited version of Titsingh's translation.Pouillon, François. (2008). Dictionnaire des orientalistes de langue française, p. 542. ==Selected works== In a statistical overview derived from writings by and about Seki Takakau, OCLC/WorldCat includes roughly 90+ works in 150+ publications in 7 languages and 1,600+ library holdings. WorldCat Identities: Titsingh, Isaac 1744-1812 * \"Bereiding van saké en soya,\" in Verhandelingen van het Bataviaasch genootschap van Kunsten en Wetenschappen (1781)Boxer, C. R. (1936). Jan Compagnie in Japan, 1600-1850: an essay on the cultural, artistic and scientific influence exercised by the Hollanders in Japan from the seventeenth to the nineteenth centuries, p. 172. * Cérémonies usitées au Japon pour les mariages et les funérailles (1819). * Mémoires et anecdotes sur la dynastie régnante des djogouns, souverains du Japon (1820), * Illustrations of Japan (1822) * Bijzonderheden over Japan (1824) * Annales des empereurs du Japon (1834) ==Related pages== * Nihon Odai Ichiran ==References== ==Other websites== * Titsingh, Isaac, 1744-1812 at Virtual International Authority File (VIAF) * http://www.titsingh.nl/paginas/biotitsleven.htm Category:1745 births Category:1812 deaths Category:Ambassadors of the Netherlands Category:Dutch esotericists Category:Dutch historians Category:Dutch physicians Category:Fellows of the Royal Society Category:Freemasons Category:Japanologists Category:Writers from Amsterdam Category:Surgeons",
 "title": "Isaac Titsingh"
}