{
 "id": "312176",
 "text": "Child support is continued payment performed by a parent for the financial benefits of children following marital separations, divorces or ends of civil unions. Child maintenance is paid either directly or indirect by obligors toward an obligee for care and support of children from terminated marriages, civil unions or other relationships. The obligor is the non-custodial parent; the obligee is either the custodial parent, a caregiver, a guardian or the state. ==Duration of support orders== Support orders end based on local laws and the facts of each case. Support orders usually end when the child reaches the age of majority. (This can be an age from 16Statutory Instrument 2001 No. 157 The Child Support (Maintenance Calculation Procedure) Regulations 2000 United Kingdom to 21 (New York State) Alberta Department of Justice, CanadaFAQs: Maintenance Subordinate Court of SingaporeWhat is child support? New Zealand Inland Revenue or graduates from high school.) Some countries and states have laws that make support continue past the age of majority if the child is enrolled as a full-time, degree-seeking post-secondary student.Termination of Child Support and Support Beyond Majority National Conference of State Legislatures, USA If the obligor owes back child support, the payments must continue until the debt is satisfied, regardless of the age of the child. Several factors can end a support order for a child under the age of majority. These include the child's marriage, legal emancipation or death.FAMILY CODE: CHAPTER 154. CHILD SUPPORT. SUBCHAPTER A. COURT-ORDERED CHILD SUPPORT State of Texas USAStatutory Instrument 1992 No. 1813: The Child Support (Maintenance Assessment Procedure) Applications for a Maintenance Assessment United Kingdom ==References== ==Other websites== *History of child support in the UK *Child Support Agency (CSA) Australia - includes calculators and guides for separated parents *US Federal Child Support Enforcement - child support enforcement *UK Child Support Calculator App for iOS - UK Child Support Calculator App for iOS Category:Family law",
 "title": "Child support"
}