{
 "id": "312136",
 "text": "\"Last Friday Night (T.G.I.F.)\" is a single performed by American recording artist Katy Perry. It is the fifth single from her third album Teenage Dream. The song topped the Billboard Hot 100 chart in the US. It reached the top in Canada as well. It climbed to the top five in Australia and New Zealand and the top ten in Austria and the UK. It was released June 6, 2011. A remix was later released featuring rapper Missy Elliott. The song became Perry's fifth number-one single from Teenage Dream. This was a first for a female artist. Only Michael Jackson also had five chart-toppers from one album with Bad in 1987. ==Credits and personnel== * Katy Perry – songwriter, vocals * Dr. Luke – songwriter, producer, drums, keyboards, programming * Max Martin – songwriter, producer, drums, keyboards, programming * Bonnie McKee – songwriter * Emily Wright – engineer * Sam Holland – engineer * Tucker Bodine – assistant engineer * Tatiana Gottwald – assistant engineer * Şerban Ghenea – mixing * Jon Hanes – mix engineer * Tim Roberts – assistant mix engineer * Lenny Pickett – saxophone ==Charts== ===Weekly charts=== Weekly chart performance for \"Last Friday Night (T.G.I.F.)\" Chart (2011) Peak position Iceland (Tónlistinn) 7 Lebanon (OLT20) 3 Mexico (Billboard Mexican Airplay) 2 Romania (Romanian Top 100) 56 Turkey (Number One Top 20) 19 Ukraine Airplay (TopHit) 11 Venezuela (Record Report) Pop/Rock 1 ===Monthly charts=== Monthly chart performance for \"Last Friday Night (T.G.I.F.)\" Chart (2011) Peak position Russia Airplay (TopHit) 49 Ukraine Airplay (TopHit) 16 ===Year-end charts=== Yearly chart performance for \"Last Friday Night (T.G.I.F.)\" Chart (2011) Peak position Australia (ARIA) 31 Belgium (Ultratop 50 Flanders) 86 Canada (Canadian Hot 100) 12 Germany (Official German Charts) 88 Hungary (Rádiós Top 40) 45 Netherlands (Dutch Top 40) 34 New Zealand (Recorded Music NZ) 24 Ukraine Airplay (TopHit) 70 UK Singles (OCC) 45 US Billboard Hot 100 14 Chart (2012) Position Brazil (Crowley) 17 ==Certifications== ==Release history== Release dates and formats for \"Last Friday Night (T.G.I.F.)\" Region Date Format(s) Version Label United States June 6, 2011 Original Capitol Italy June 17, 2011 Radio airplay EMI United States June 27, 2011 Capitol Various August 8, 2011 Digital download Remix featuring Missy Elliott United States Contemporary hit radio == References == Category:2011 songs Category:Katy Perry songs",
 "title": "Last Friday Night (T.G.I.F.)"
}