{
 "id": "312248",
 "text": "Moulting (or molting) is the manner in which an animal routinely casts off part of its body (usually the outer layer or covering) at particular times of year, or at specific points in its life cycle. Moulting is also known as sloughing, shedding, or for some species, ecdysis. Moulting can involve the epidermis (skin), and hair, fur, wool, or other external layer. In some species, other body parts may be shed, for example, wings in some insects. Examples include old feathers in birds, old hairs in mammals (especially dogs and other canidae), old skin in reptiles, and the entire exoskeleton in arthropods. ==Examples== Species Item shed Timing Known as Notes Chickens Feathers Usually autumn Moulting Chickens generally stop laying eggs before their moulting begins, until their new set of feathers has grown back.Harold Alvah Nourse. 1908. A book Of complete and reliable information on the more profitable production of eggs on the city lot, the village acre and the farm. 11th ed, Webb publishing company. 95-97Nicole Faires. Deliberate life: the ultimate homesteading guide. 116 Dogs and other canids Hair (Fur) Semi- annually, spring and fall (autumn) Shedding Moulting Moulting in canids, as in all mammals,Characterizing a mammalian circannual pacemaker is thought to be due to fluctuations in the amount of melatonin secreted by their pineal gland in response to seasonal sunlight variations. It has nothing to do with seasonal temperature variations. This seasonality in 'shed pattern' is most obvious in Arctic breeds of dogs that shed twice a year;Hair loss in dogs - why is my dog losing its hair? Alopecia X other breeds now shed year round. Snakes Skin Regularly, when old skin is outgrown Moulting Snakes will rub against rough surfaces to shed their skin. Lizards Skin Regularly, when old skin is outgrown Moulting Lizards consume their shed skin for calcium, grooming, and other nutrients Hermit crabs Exoskeleton Regularly, when the carapace is outgrown Moulting Land hermit crabs bury themselves for many weeks while they moult and consume their exoskeleton. Amphibians Skin Regularly Moulting Salamanders and frogs shed their skins regularly, and often eat it. == Ecdysis == In arthropods, such as insects, arachnids and crustaceans, moulting is the shedding of the exoskeleton (or shell). This process of moulting is called ecdysis. It is the defining feature of a whole group of invertebrates, the clade Ecdysozoa. This group includes the arthropods, nematodes, velvet worms, horsehair worms, rotifers, tardigrades and Cephalorhyncha. Since the cuticles of these animals often forms an inelastic exoskeleton, it is shed during growth and a new, larger covering is formed. Amongst fossils, trilobites and eurypterida used ecdysis. Ecdysis is part of the whole process of metamorphosis. The different stages (called 'instars') and the development of new 'apparatus' (such as sense organs) is necessary as the creature moves from one form to another. The new exoskeleton is initially soft but hardens after the moulting of the old exoskeleton. == References == Category:Developmental biology Category:Invertebrates",
 "title": "Moulting"
}