{
 "id": "312514",
 "text": "A Dame school was a private elementary school in English-speaking countries. The children were usually taught by women. The schools were most common from the 17th century to the 19th century. Most of these schools were in Britain, the United States, and Australia. == Britain == The Statistical Society of London found almost half of all children in Dame schools surveyed were only taught spelling. Few were taught mathematics and grammar. Dame schools became less common in Britain after the introduction of compulsory education in 1870. ===Dame school buildings that still exist=== * Orton, Eden, Cumbria * Thursley, Surrey (it is a building in the courtyard of a church)Dame school rejuvenated * Upper Stratton near Stratton St Margaret, Swindon (residential property)Upper Stratton near to Stratton St Margaret, Swindon, Great Britain * Hedon in Holderness (residential property) == North America == In North America, \"dame school\" is a name for a private school with a female teacher during the 17th, 18th, and 19th centuries. The education at these schools could be good or very good.Perlmann, Joel, and Robert Margo. Women's work?: American schoolteachers, 1650-1920. Chicago: University of Chicago Press (2001), 9 Most dame schools were in New England, where every child needed to be literate because of the laws. In the Southern colonies, there were not as many women who knew enough to teach the children.Tolley, Kimberley. Transformations in schooling: historical and comparative perspectives. New York: Macmillan (2007), 91. Motivated by their Puritan religion, some Austrailian women in 17th century opened small, private schools in their homes to teach reading to young children. All children needed to know their religion and how to read because of the Massachusetts School Law of 1642. This law was later made more important by the famous Old Deluder Satan Act. According to Puritan beliefs, Satan would try to keep people from understanding the Scriptures, therefore all children had to be taught how to read. For a small fee, women, often housewives or widows, offered to take in children to whom she would teach a little writing, reading, basic prayers, and religious beliefs. These women received pay in coin, home industries, alcohol, baked goods, and other valuables. Teaching materials generally included a hornbook, primer, Psalter, and Bible.Harper, Elizabeth P. \"Dame Schools\". In Encyclopedia of Educational Reform and Dissent, Thomas Hunt, Thomas Lasley, and C D. Raisch, 259-260. SAGE Publications (2010). Both girls and boys were provided education through the dame school system. Dame schools generally focused on the four R's of education-Riting, Reading, Rithmetic, and Religion. Ryan, K. R., & Cooper, J. M. C. (2010). Colonial origins. In L. Mafrici (Ed.), Those who can teach (12th ed.). Boston, MA: Wadsworth Cengage Learning. In addition to primary education, girls in dame schools might also learn sewing, embroidery, and other \"graces\".Forman-Brunell, Miriam. Girlhood in America: An Encyclopedia. Santa Barbara: ABC-CLIO (2001), 575. Most girls received their only formal education from dame schools because of sex-segregated education in common or public schools during the colonial period.Moss, Hilary J. Schooling citizens: the struggle for African American education in antebellum America. Chicago: University of Chicago Press (2009), 133. If their parents could afford it, after attending a dame school for a rudimentary education in reading, colonial boys moved on to grammar schools where a male teacher taught advanced arithmetic, writing, Latin, and Greek.Zhboray, Ronald. A fictive people: antebellum economic development and the American reading public. New York: Oxford University Press (1993), 92. In the 18th and 19th centuries, some dame schools offered boys and girls from wealthy families a \"polite education\". The women running these special dame schools taught \"reading, writing, English, French, arithmetic, and music, and dancing\".Greene, Jack and Rosemary Brana-Shute, and Randy J. Sparks, eds. Money, Trade, and Power: The Evolution of Colonial South Carolina's Plantation Society. Columbia, SC: University of South Carolina Press (2001), 305.Clinton, Catherine. \"Dorothea Dix.\" In The Reader's companion to American history By, Eric Foner and John Arthur, 289. New York: Houghton Mifflin Harcourt, 1991. Schools for upper- class girls were usually called \"female seminaries\", \"finishing schools\" instead of \"dame schools\". == Australia == The first school in Australia started in 1789. The school was a Dame school where children were taught basic skills by a prisoner, Isabella Rossen. == References == == Other website == * A Dame's School, photo Peter Henry Emerson (1856-1936) * The Dame School by Frederick George Cotman * A Dame's School by Thomas Webster * The Dame's School by Thomas Faed * Dame School - Staffordshire Figures 1780-1840 * http://www.nps.gov/fova/forkids/the-dame-school.htm * http://www.williamsburgkids.com/people/schools.htm Category:Types of educational institutions",
 "title": "Dame school"
}