{
 "id": "312946",
 "text": "Pope Pius VII (; 14 August 1742 – 20 August 1823), born Barnaba Niccolò Maria Luigi Chiaramonti, was an Italian priest of the Roman Catholic Church and the 252nd Pope from 14 March 1800 to 20 August 1823. \"List of Popes,\" Catholic Encyclopedia (2009); retrieved 2011-11-02. ==Early life== Chiaramonti was born at Cesena, the son of Count Scipione Chiaramonti.\"Pope Pius VII,\" Catholic Encyclopedia; retrieved 2011-10-27. His mother, Giovanna was related to the Braschi family. At the age of 16, he joined the Benedictine Order in 1756; and he was called Brother Gregory. ==Priest== Chiaramonte was ordained on 21 September 1765. ==Bishop== In 1782, Pius VI made Brother Gregory Bishop of Tivoli, which is near Rome. Later, he became the Bishop of Imola. ==Cardinal== Pius VI raised Bishop Chiaramonte to the rank of Cardinal in 1785. The see (titular church) of Cardinal Chiaramonte was the Basilica of St. Callistus. Giga-Catholic Information (GCatholic), Pope Pius VII; retrieved 2011-11-01. ==Pope== Cardinal Chiaramonti was elected pope on March 14 1800; and he chose to be called Pius VII. He appointed Ercole Consalvi as his Secretary of State. Pope Pius was involved in Italian and European political disputes. Pius traveled from Rome to Paris to crown Napoleon as Emperor of the French in 1804. Before leaving Rome, he signed abdication papers which would take effect if he were put in prison in France. \"Abdication,\" Catholic Encyclopedia; retrieved 2013-2-11. He was not put in prison; and he did not abdicate. == After his death== Pius VII's monument (1831) in St. Peter's Basilica, Rome, is by the Danish sculptor Bertel Thorvaldsen. ==Related pages== * List of popes * List of popes by length of reign ==References== == Other websites == * * Catholic hierarchy, Pope Pius VII * Cardinals of the Holy Roman Church , Cardinal Chiaramonti Category:Italian popes Category:1742 births Category:1823 deaths Category:Benedictines",
 "title": "Pope Pius VII"
}