{
 "id": "313107",
 "text": "Pope Pius X (; , 2 June 1835 – 20 August 1914), born Giuseppe Melchiorre Sarto, was an Italian priest of the Roman Catholic Church and the 258th Pope from 1903 to 1914. \"List of Popes,\" Catholic Encyclopedia (2009); retrieved 2011-11-02. He is a saint of the Catholic Church,\"Pope Pius X,\" Catholic Encyclopedia (2009); retrieved 2011-11-02. well known as being strongly against members of the Catholic Church trying to make it follow modern ideas, a movement called modernism. ==Early life== Giuseppe Sarto was born in 1835 in Riese in the Kingdom of Lombardy-Venetia. He studied at the University of Padua.Flinn, Frank K. et al. (2007). \"Pius X,\" in Encyclopedia of Catholicism, p. 519. ==Priest== Sarto was ordained as a priest on 18 September 1858. ==Bishop== In 1884, Pope Leo XIII made Sarto the Bishop of Mantua. ==Cardinal== In 1893, Pope Leo XIII made Sarto a cardinal and the Patriarch of Venice. ==Pope== On 20 4 August 1903, Cardinal Sarto was elected pope; and he chose to be called Pius X. As pope, he prevented the development of Modernism, an intellectual movement gaining attention from Catholics. He also suppressed a political movement that calls for social reforms known as Christian democracy. Despite all of these, Pius X was known for his reforms on the Catholic liturgy. He also decided to systemize the canon law over which he announced a plan in March 19, 1904. This led to the publication of a new code in 1917 under his successor, Pope Benedict XV. This new code took effect in 1918. His papacy ended when he died on August 1914 due to a bronchial attack. ==Saint== In 1951, he was beatified, which is a step in the process of naming a saint of the Catholic Church. In 1954, he was canonized as a saint. ==Related pages== * List of popes ==References== == Other websites == * * Catholic Hierarchy, Pope Pius X * Cardinals of the Holy Roman Church , Cardinal Sarto * Museo San Pio X *Fondazione Giuseppe Sarto Category:1835 births Category:1914 deaths Category:Italian popes Category:Deaths from myocardial infarction Category:Christian saints",
 "title": "Pope Pius X"
}