{
 "id": "313201",
 "text": "Chronic obstructive pulmonary disease (COPD), also known as chronic obstructive lung disease (COLD), and chronic obstructive airway disease (COAD), is a collection of diseases which make breathing gradually more difficult. Symptoms of COPD include difficulty breathing and cough, in particular coughing up lots of phlegm.Vestbo, Jorgen 2013. Global strategy for the diagnosis, management, and prevention of chronic obstructive pulmonary disease. Global initiative for chronic obstructive lung disease, Chapter 2. It is usually caused by smoking cigarettes, and around half of people who smoke for their whole lives will develop COPD.Laniado-Laborín R. 2009. Smoking and chronic obstructive pulmonary disease (COPD). Parallel epidemics of the 21 century. International Journal of Environmental Research and Public Health. 6 (1): 209–24. doi:10.3390/ijerph6010209. PMC 2672326. PMID 19440278. Air pollution can be another cause, particularly in countries where indoor fires are used without ventilation. At the beginning of the disease, the difficulty breathing is only noticeable when exercising, but over many years it gradually becomes worse, until there is difficulty breathing even when sitting or lying down.What Are the signs and symptoms of COPD?. U.S. National Heart Lung and Blood Institute. 8 June 2012. It can also lead to infections of the lung, which may be serious enough to cause death. The most important step in preventing COPD or its progression into a worse illness is to stop smoking.Decramer M; Janssens W. & Miravitlles M. 2012. Chronic obstructive pulmonary disease. Lancet 379 (9823): 1341–51. doi:10.1016/S0140-6736(11)60968-9. PMID 22314182. Exercise and medications can also help. The most commonly used medications are called bronchodilators, which help to open up the airways and allow more air into the lungs. 3% of all disability is related to COPD.Murray C.J. et al 2012. Disability-adjusted life years (DALYs) for 291 diseases and injuries in 21 regions, 1990–2010: a systematic analysis for the Global Burden of Disease Study 2010. Lancet 380 (9859): 2197–223. doi:10.1016/S0140-6736(12)61689-4. PMID 23245608. Patients with COPD should be screened for mental depression or low mood. Chronic obstructive pulmonary disease were the third most common cause of death globally in 2019. It is thought that more people will die from it in the future. == Types of COPD == * Emphysema * Chronic bronchitis * Bronchiectasis ==References== Category:Pulmonology Category:Aging-associated diseases Category:Occupational diseases",
 "title": "Chronic obstructive pulmonary disease"
}