{
 "id": "313406",
 "text": "Brenda Blethyn (born 20 February 1946) is a British actress. She has starred in movies, television and theatre. She has been nominated for Academy Awards, Golden Globe Awards and Emmy Awards. She has won a Golden Globe Award and a BAFTA Award. Notable movies she has starred in include Secrets & Lies (1996). == Filmography == Film and Television Year Title Role Notes 1987 Poor Little Rich Girl: The Barbara Hutton Story (1987 TV miniseries) Ticki Tocquet 1990 Mrs. Jenkins 1992 Mrs. Maclean 1996 Secrets & Lies Cynthia Rose Purley BAFTA Award for Best Actress in a Leading Role Boston Society of Film Critics Award for Best Actress Cannes Film Festival – Best Actress Award Empire Award – Best British Actress Golden Globe Award for Best Actress – Motion Picture Drama London Film Critics Circle Award for Best Actress Los Angeles Film Critics Association Award for Best Actress Sant Jordi Award for Best Foreign Actress Nominated—Academy Award for Best Actress Nominated—Chlotrudis Award for Best Actress Nominated—Satellite Award for Best Actress – Motion Picture Drama Nominated—Screen Actors Guild Award for Best Actress – Motion Picture 1997 Remember Me? Shirley 1998 Girls' Night Dawn Wilkinson 1998 Night Train Alice Mooney 1998 In the Winter Dark Ida Stubbs 1998 Little Voice Mari Hoff Nominated—Academy Award for Best Supporting Actress Nominated—BAFTA Award for Best Actress in a Supporting Role Nominated—Golden Globe Award for Best Supporting Actress Nominated—Satellite Award for Best Supporting Actress – Motion Picture Nominated—Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role 1998 Music from Another Room Grace Swan 2000 Saving Grace Grace Trevethyn Nominated—British Independent Film Award for Best Actress Nominated—Empire Award for Best British Actress Nominated—Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Nominated—London Film Critics Circle Award for Best Actress Nominated—Satellite Award for Best Actress – Motion Picture Musical or Comedy 2001 Anne Frank: The Whole Story Auguste van Pels Nominated—Emmy Award for Outstanding Supporting Actress – Miniseries or a Movie Nominated—Satellite Award for Best Supporting Actress – Series, Miniseries or Television Film 2001 Daddy and Them July Montgomery 2001 Lovely & Amazing Jane Marks 2001 On the Nose Mrs. Delaney 2002 Pumpkin Judy Romanoff 2002 Sonny Jewel Phillips 2002 Plots with a View Betty Rhys-Jones 2002 Mrs. Fairgood 2003 Aggie DVDX Award for Best Supporting Actress in a DVD Premiere Movie 2003 Blizzard Aunt Millie 2004 Piccadilly Jim Nina Banks 2004 Beyond the Sea Polly Cassatto 2004 Annette 2004 Belonging Jess Copple Festival International de Programmes Audiovisuels – Fiction: Actress Nominated—British Academy Television Award for Best Actress 2005 Pooh's Heffalump Movie Mama Heffalump 2005 On a Clear Day Joan 2005 Pride & Prejudice Mrs. Bennet Character and Morality in Entertainment Award Nominated—BAFTA Award for Best Actress in a Supporting Role Nominated—London Film Critics Circle Award for British Supporting Actress of the Year Nominated—Washington DC Area Film Critics Association Award for Best Supporting Actress 2006 Mysterious Creatures Wendy Ainscow 2007 Clubland Jean Nominated—AFI Award for Best Lead Actress Nominated—Inside Film Award for Best Actress 2007 Atonement Grace Turner 2007 War and Peace Márja Dmitrijewna Achrosímowa 2008 The New Adventures of Old Christine Angela Kimble 2009 London River Elisabeth Sommers 2009 Tigger and Pooh and A Musical Too Mama Heffalump 2009 Sister Ignatious 2009 Dead Man Running Mother 2009 Law & Order: Special Victims Unit (series 10, episode 8: Persona) Linnie Malcolm/Caroline Cresswell Nominated—Primetime Emmy Award for Outstanding Guest Actress in a Drama Series 2011 My Angel Headmistress 2011-present Vera Vera Stanhope ITV == Other websites == * Category:1946 births Category:Living people Category:Actors from Kent Category:BAFTA Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:Ramsgate",
 "title": "Brenda Blethyn"
}