{
 "id": "314374",
 "text": "Dylan Thomas Sprouse and Cole Mitchell Sprouse (born August 4, 1992) are American actors. They are twins. Together, they are called Dylan and Cole Sprouse or the Sprouse Bros. Their first major movie role was in Big Daddy, where they acted with Adam Sandler. Later, they acted in many television sitcoms. They also acted in the straight-to-DVD family movies, I Saw Mommy Kissing Santa Claus and Just for Kicks. In 2005, they started acting in the Disney Channel sitcom The Suite Life of Zack and Cody. In 2006, the brothers started a franchise known as the \"Sprouse Bros\" brand. The franchise had a clothing line, a book series, and a magazine. Most of the franchise ended in 2008, except for their clothing line. They were two of the richest children alive in 2007. In 2008, they started acting in The Suite Life on Deck, which was the sequel to The Suite Life of Zack & Cody. Later, The Suite Life on Deck became the most-watched television show for children and tweens (9-12 year olds) in 2008 and 2009. In 2010, the Sprouse brothers were the highest paid teenage Disney television actors. They earned $40,000 for each episode together. The Suite Life on Deck ended in May 2011. In 2011, they acted in The Suite Life Movie.They started working on an adult image by starring in the independent suspense movie, The Kings of Appletown in 2009. MSN reported by the end of the 2000s, the twin brothers became the richest teenage twins in the world. In 2010, the brothers were accepted to New York University. They delayed admission for one year. They started going to the university in the fall of 2011. In the middle of 2010, Dylan started a website for his art called Sprouse Arts. In the middle of 2011, Cole started a website for his photography called Cole Sprouse Photography. Their favorite food is sushi that they love to eat together. ==Early lives== The Sprouses were born in Arezzo, Italy. Their parents are Matthew Sprouse and Melanie Wright. Their parents are American, but they were teaching at an English language school in Tuscany when Dylan and Cole were born. Dylan is named after the poet Dylan Thomas. Dylan is 15 minutes older than Cole. Cole is named after jazz singer and pianist Nat King Cole. The boys moved back to the United States four months after their birth. They grew up in Long Beach, California, where their parents had lived. Their parents divorced in 1997. ==Acting== The Sprouses started acting at the age of eight months. The twins first acted in a commercial for diapers. They switched on-screen time every few seconds.Sprouse, Dylan, and Cole Sprouse. \"Dylan & Cole Sprouse Interview for CTA in London on 29 January 2011 In aid of Starlight Children's Foundation.\" Official Sprouse Bros Website. Interview. 29 January 2011. Web. . Like many twin actors, the two have often played the same role. This is so there is more time for the character to be filmed. Starting at eight months old, they acted on the ABC-TV series Grace Under Fire from 1993 to 1998. They played one character, Patrick Kelly. In 1999, the boys acted in their first major movie, Big Daddy. They shared the role of a five- year old boy named 'Julian' who is adopted by Adam Sandler's character, 'Sonny Koufax'. That year, the boys worked with Sandler to make the second and third versions of The Chanukah Song. The boys also had a small role in the scary movie The Astronaut's Wife. After Big Daddy's release, the two started a slow period in their careers. They were not cast in any big roles for a time. During the early 2000s, the twins acted in episodes of The Nightmare Room and That '70s Show. They also acted in MADtv (season four, episode #425) and the movie The Master of Disguise. They also had a voice-over role in Adam Sandler's Eight Crazy Nights. In 2001, Cole started acting in episodes of the television show Friends as Ross Geller's son Ben. He did not share this role with Dylan. Between the years of 2002 and 2003, they both acted in I Saw Mommy Kissing Santa Claus and Just for Kicks. Both movies were released direct-to- video. After that, the Sprouses started acting in the Disney Channel original series The Suite Life of Zack and Cody, where they portrayed identical twins Zack (Dylan) and Cody (Cole) Martin. The series started in March 2005. It became a ratings success. The twins have become very well known among pre-teen (9 to 12 year old) and teen audiences. As part of their work with Disney, the brothers also became part of the 11-member group, the Disney Channel Circle of Stars. They sang the song \"A Dream is a Wish Your Heart Makes\" with the members of the group. The music video was released as a special feature in the special edition version of the Disney movie Cinderella. They also played in the Disney Channel Games from 2006 to 2008. The Sprouses played one character, Jeremiah, in the independent movie The Heart Is Deceitful Above All Things. The movie was produced in 2004. It was not shown in theaters until March 2006. Then it played at three theaters in the United States. It earned $29,000. In 2007, the boys filmed A Modern Twain Story: The Prince and the Pauper. The Sprouse brothers both had voice roles in the animated movie, Holidaze: The Christmas That Almost Didn't Happen along with Brenda Song and Emily Osment. Dylan played the voice of Shasta in Disney's \"Snow Buddies.\" The brothers both acted in the movie, The Kings of Appletown. It is based on the book The Adventures of Tom Sawyer. Bobby Moresco directed the movie. Amanda Moresco wrote it. The movie was filmed in New Braunfels, Texas. It was originally estimated to be released in the winter 2008. In April 2009, they were on the cover of People Magazine, in an eighty-page special edition issue about The Suite Life on Deck.People: Special Collector's Edition. May 2009. Print. . The twin brothers began filming another Modern Twain Story movie in the summer of 2009. The movie was titled Sivilized. It was a modern version of Huckleberry Finn. However, in the middle of 2010, Dylan said that they would not be doing the movie. Part of the reason they did not do it was because they became too old for the movie. In March 2009, they started advertising for Dannon Danimals. In August 2010, the twin brothers started making advertisements for Nintendo DS. , Dylan and Cole are not acting in any shows or movies. They are paying attention to college. Also, Dylan is paying attention to art. Cole is paying attention to photography. Dylan has said that they would both like to continue acting while in college. Cole's celebrity crush was always his brother Dylan Sprouse. ==\"Sprouse Bros\" brand== In 2005, the Sprouse brothers joined Dualstar Entertainment to produce \"Sprouse Bros\" products for preteens (9 to 12 year olds) and teenagers. The Sprouse Bros brand has a clothing line, a comics series, and a magazine. In 2006 Dualstar and Leisure Publishing LLC started a magazine called \"Sprouse Bros. Code\" for boys. In 2007 Simon & Schuster Inc. published the two volumes of a book series named Sprouse Bros. 47 R.O.N.I.N., about two young spies. In 2008, the brothers ended their association with Dualstar. They continued their clothing line which is 'on hold'. The things in their clothing lines are only sold online. == Personal lives == Dylan Sprouse has said that the experience of becoming famous after the success of The Suite Life of Zack & Cody is \"kind of scary, how fast everything is moving. Just a year ago none of this was happening, it was just doing Suite Life, and now I can't wait for what's in store...\" While filming The Suite Life of Zack & Cody, the two went to school on-set for three hours each day. They said they were getting \"straight A's and honors.\" The twins' family has three dogs. Bubba is Dylan and Cole’s dog. Pinky is their father's dog. Curry is their stepmother's dog. Their favorite actor and co-star is Adam Sandler. In 2010, the twin brothers were both accepted to New York University. At first, they planned to go to the university in the fall of 2010. They delayed going for one year. They are both in the Gallatin program. Students in this program make their own major. == Filmography == * Background color shows shared roles * Italic type shows voice roles movie credits Year Title Dylan's role Cole's role Notes 1999 The Astronaut's Wife Twin Twin Big Daddy 2001 Diary of a Sex Addict\"Diary of a Sex Addict - Cast, Crew, Director and Awards - NYTimes.com.\" New York Times 2010. Web. 22 Sep. 2011. . Direct-to- video film I Saw Mommy Kissing Santa Claus 2002 The Master of Disguise Eight Crazy Nights 2003 Apple Jack Just for Kicks Dylan Martin Cole Martin Direct- to-video film 2004 The Heart Is Deceitful Above All Things 2005 Piggy Banks\"Born Killers (2005) - Full Cast and Crew.\" IMDb. Web. 22 Sep 2011. . Young John 2006 Holidaze: The Christmas That Almost Didn't Happen Direct-to- video film 2007 A Modern Twain Story: The Prince and the Pauper Tom Canty Eddie Tudor 2008 Snow Buddies Shasta Direct-to-video film 2009 The Kings of Appletown Will Clayton 2010 Kung Fu Magoo Justin Magoo Brad Landry Direct-to- video film 2011 The Suite Life Movie Zack Martin Cody Martin Disney Channel Original Movie Television credits Year Title Dylan's role Cole's role Notes 1993-1998 Grace Under Fire 112 episodes 1998 MADtv \"Episode #3.22\" \"Episode #4.1\" 2000-2002 Friends Ben Geller Seven episodes 2001 The Nightmare Room \"Scareful What You Wish For\" (Season one, episode two) That '70s Show Bobby Billy \"Eric's Depression\" (Season four, episode two) 2005-2008 The Suite Life of Zack and Cody Zack Martin Cody Martin All 88 episodes; Lead Role 2006 The Emperor's New School Zam Zim \"Oops, All Doodles/Chipmunky Business\" (Season one, episode 13) That's So Raven Zack Martin Cody Martin \"Checkin' Out\" (Season four, episode 11) 2008 According to Jim Himself Himself Guest performance 2008-2011 The Suite Life on Deck Zack Martin Cody Martin All 71 episodes; Lead Role 2009 Wizards of Waverly Place \"Cast-Away (To Another Show)\" (Season two, episode 25) Hannah Montana \"Super(stitious Girl)\" (Season three, episode 19) 2010 I'm in the Band \"Weasels on Deck\" (Season two, episode one) == Awards and nominations == Year Award Work Category Cole Dylan 1999 YoungStar Awards Big Daddy \"Best Performance by a Young Actor in a Comedy Film\" 2000 MTV Movie Awards \"Best On-Screen Duo\" Blockbuster Entertainment Awards \"Favorite Supporting Actor - Comedy\" Young Artist Awards \"Best Performance in a Feature Film - Young Actor Age Ten or Under\" 2006 The Suite Life of Zack and Cody \"Best Performance in a TV Series (Comedy or Drama) - Leading Young Actor\" 2007 Kids' Choice Awards \"Favorite Television Actor\" Young Artist Awards \"Best Performance in a TV Series (Comedy or Drama) - Leading Young Actor\" Popstar Magazine's Poptastic Awards \"Favorite Television Actor\" Popstar! Magazine. May 2007. Print. 2008 Kids' Choice Awards Popstar Magazine's Poptastic Awards \"Favorite Television Actor\" Popstar! Magazine. May 2008. Print. 2009 Kids' Choice Awards Popstar Magazine's Poptastic Awards The Suite Life on Deck \"Favorite Television Actor\" \"POPSTAR! POPTASTIC AWARDS NOMINEES!.\" Blog Buzz. Popstar! Online, 26 March 2009. Web. 21 Sep. 2011. . 2010 Kids' Choice Awards \"Favorite TV Actor\" 2011 == Discography == * 2005 – \"A Dream Is a Wish Your Heart Makes\" in DisneyMania 4 * 2008 – \"A Dream Is a Wish Your Heart Makes\" in Princess DisneyMania == References == == Other websites == * * * Category:1992 births Category:Living people Category:Actors from Long Beach, California Category:American television actors Category:Twin people from the United States",
 "title": "Dylan and Cole Sprouse"
}