{
 "id": "314480",
 "text": "Oleksiy Volodymyrovych \"Alexei\" Ponikarovsky (born 9 April 1980 in Kyiv, Ukrainian SSR, Soviet Union) is a Ukrainian-Canadian former professional ice hockey left winger. He played parts of 15 season in the National Hockey League (NHL). He played for the Toronto Maple Leafs, Pittsburgh Penguins, Los Angeles Kings, Carolina Hurricanes, New Jersey Devils, and Winnipeg Jets. He also played in the Kontinental Hockey League (KHL) for Donbass Donetsk, SKA Saint Petersburg, and Kunlun Red Star. He was drafted by the Toronto Maple Leafs with the 87th overall pick in the 1998 NHL Entry Draft. He also played in the NHL for the Toronto Maple Leafs for 9 seasons, the Pittsburgh Penguins for 1 season, the Los Angeles Kings for 1 season, the Carolina Hurricanes for 1 season, the New Jersey Devils for 1 season and the Winnipeg Jets for 1 season. He was traded back to the Devils on February 13, 2013 in exchange for a 4th round pick and a 7th round pick in the 2014 NHL Entry Draft. He is nicknamed \"The Poni Express\", \"The Ukraine Train\" and \"Poni\". He currently lives in Toronto with his wife Inna, daughter Jessica, and sons Alex and Maxim. He also became a Canadian citizen on June 7, 2007. == Career == In the 1998 NHL Draft, he was selected in round 4 under a total of 87 by the Toronto Maple Leafs. Has Canadian and Russian citizenship. In 2010 he was traded to the Pittsburgh Penguins. In the summer of 2010, as a free agent, he signed a contract with the Los Angeles Kings for a period of 1 year. In the summer of 2011, he changed Los Angeles to Carolina Hurricanes, signing a one-year agreement worth $ 1.5 million. In January 2012, before the expiration of his contract, he was traded to the New Jersey Devils. In the offseason 2012, signed a one-year contract with the Winnipeg Jets for $ 1.5 million Due to the NHL lockout in 2012, he signed a contract with the newcomer of the KHL, the Donbass club. After the end of the lockout he returned to the Winnipeg Jets, but after 12 games on 14 February 2013 he returned to the New Jersey Devils. In August 2016, he signed a contract with the Kunlun Red Star Kontinental Hockey League debut. In November 2017, he joined the Putin Team movement == Family == Married. He has three children. == References == == Other websites == * Category:1980 births Category:Living people Category:Carolina Hurricanes players Category:Los Angeles Kings players Category:Naturalized citizens of Canada Category:New Jersey Devils players Category:Pittsburgh Penguins players Category:Sportspeople from Kyiv Category:St. John's Maple Leafs players Category:Toronto Maple Leafs players Category:Ukrainian ice hockey players Category:Winnipeg Jets players",
 "title": "Alexei Ponikarovsky"
}