{
 "id": "314528",
 "text": "The Schengen Area is an area that includes 29 European countries. All of those countries have signed the Schengen Agreement in Schengen, Luxembourg in 1985. The Schengen area removes passport control between its member countries. This means travelers who go from one Schengen country to another do not clear immigration checks anymore. Passengers go through immigration checks if they enter or exit the Schengen Area. The current members of the Schengen Area are Austria, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland. Because Switzerland is not part of the European Economic Area, customs control in Switzerland still exists. At this moment, over 420 million people live in the area. The territory covers 4,312,099 square kilometres. == History == On 14 June 1985 the Schengen Agreement was signed. This happened on the boat Princess Marie-Astrid in the middle of the river Moselle. On that place, the borders of France, Germany and Luxembourg meet. Five countries signed the Agreement: Belgium, France, Luxembourg, Netherlands and West Germany. It was signed, but that didn't mean it was already implemented. In 26 March 1995, all European Union members (except the United Kingdom and Ireland) signed the Agreement. Norway and Iceland also signed the Agreement. On 1 May 2004, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia joined the EU. They signed the Schengen agreement on that same day. They implemented the Schengen Agreement on 21 December 2007. Switzerland joined the Schengen Area on 12 December 2008. Liechtenstein joined it on 19 December 2011. Croatia joined it on 1 January 2023. == Members == Twenty-nine countries belong to the Schengen Area. All these countries are members of the European Union, except Iceland, Liechtenstein, Norway and Switzerland. ===Current=== Flag State Area (km²) Population Signed or opted in Date of first implementation Austria Belgium Bulgaria Croatia Czech Republic Denmark (excluding Greenland and the Faroe Islands) Estonia Finland France (excluding overseas departments and territories) Germany Greece Hungary Iceland Italy Latvia Liechtenstein Lithuania Luxembourg Malta Netherlands (excluding Aruba, Curaçao, Sint Maarten and the Caribbean Netherlands) Norway (excluding Svalbard) Poland Portugal Romania Slovakia Slovenia Spain (excluding Ceuta and Melilla) Sweden Switzerland a. EFTA states outside the EU that are associated with the Schengen activities of the EU,This terminology is, for example, used in the Final Act of the Agreement concluded by the Council of the European Union and the Republic of Iceland and the Kingdom of Norway concerning the latters' association with the implementation, application and development of the Schengen acquis (OJ L 176,10 July 1999, p. 36). and where the Schengen rules apply. b. For overland borders and seaports; since 30 March 2008 also for airports. c. East Germany became part of the Federal Republic of Germany, joining Schengen, on 3 October 1990. Before this it remained outside the agreement. Despite some media reports, Heligoland is not outside Schengen; it is only outside the European Union Value Added Tax Area. d. Greenland and the Faroe Islands are not included in the Schengen area, although there might be relaxed checks in the Faroe Islands for flights from Scandinavia, thanks to the Nordic Passport Union, although a passport is still recommended. A Schengen visa issued by a Schengen state will not allow the holder access to either territories, only a Danish visa stamped with either \"Valid for the Faroe Islands\" or \"Valid for Greenland\", or both. e. However, Jan Mayen is part of the Schengen Area.Article 14 of the Final Act of the Agreement concluded by the Council of the European Union and the Republic of Iceland and the Kingdom of Norway concerning the latters' association with the implementation, application and development of the Schengen acquis (OJ L 176, 10/07/1999 P. 36) excludes Svalbard from the application of the Schengen rules. As no similar exception was made respecting Jan Mayen, it is part of the Schengen Area. f. The full Schengen acquis applies to all Spanish territories, but there are border checks on departure from Ceuta and Melilla to Spain or other Schengen countries, because of specific arrangements for visa exemptions for Moroccan nationals resident in the provinces of Tetuan and Nador.Declaration No. 1. on Ceuta and Melilla attached to the Final Act of the Accession Treaty of the Kingdom of Spain to the Schengen Agreement (OJ L 239, 22.9.2000, p. 69 ) == Schengen Visa == Some nationalities need visas to visit the Schengen Area. They only need one Schengen visa for all countries. But they must apply at the embassy of their main destination. The main destination is where a traveller wants to spend the longest time. The visa officer can issue a visa for only one trip or many trips. The officer also decides how long the visa is valid for. The traveller needs to exit before the Schengen visa expires. Travellers who do not need a Schengen visa can stay for up to 90 days in a 180-day period. == Notes == Category:European Union",
 "title": "Schengen Area"
}