{
 "id": "314677",
 "text": "FC Lustenau 07 is an football club from Lustenau, Vorarlberg in Austria. They play in the Vorarlbergliga, the highest level in Vorarlberg. The club is the oldest football club in Vorarlberg. ==History== The roots of the club laid in the Turnverein Lustenau. Many of the young members of the club played football. After discussions the football section left the club and formed on 20 September 1907 at the Gasthof zur Sonne the FC Lustenau. Many of the clubs in Vorarlberg were founded with the help of players of FC Lustenau(for example FC Dornbirn 1913 and the second club from Lustenau SC Austria Lustenau ). During the First World War there was no football in Vorarlberg. But after the war many new clubs were found. So the FC Lustenau was interested in forming a football association, which was formed in 1920. The most important player of FC Lustenau before the Second World War was Ernst Künz.He played in the 1936 Olympic football team of Austria. The team won the silver medal. During the Second World war there was again no football in Vorarlberg. But 1945 the team started again under the name FC Rapid Lustenau. In 1947 they got their old name FC Lustenau 07 back. In 2000 the club was promoted to the Austrian First League. 2004 they were relegated. In the 2005/06 season they won the Regionalliga West with 27 wins, 3 draws and 0 lost (104:22 goals). Till the 2012-13 season they played in the Austrian First League. Due to financial problems the club played the next season in Vorarlberg 2. Landesklasse (Level 7). Till the 2019-20 season they reached the Vorarlbergliga (Level 4) the highest level in Vorarlberg football. == Current squad == as on December 17th, 2021 Goalkeepers *Gerd Küng *Klaus Mendes *Noah Küng Defenders *Markus König *Luca Hollenstein *Lukas Thurnher *Maximilian König *Alex Asiu *Moritz Beck *Noel-Joshua König *Simon Häfele *Alin Mutu Midfielders *Okan Öner *Mikail Can *Ajdin Celes *Luis Bösch *Elias Jonach *Moritz Hollenstein *Mark Vogel *Vincent Scheffknecht *Simon Grabherr *Jakob Bösch *Harun Erbek *Kemal Duran *Markus Blank Forwards *Johannes Giselbrecht *Igor Marjanovic *Linus Hämmerle Transfermarkt.at:Kader FC Lustenau (German) ==Honors== * Austrian Amateur Championship runner-up: 1929, 1937 * Vorarlberg Champions: 1918, 1921–27, 1929, 1931–36, 1939 * Vorarlberg Cup: 1925, 1927, 1934, 1935, 1938, 1946 (als SC Rapid Lustenau), 1994, 2000, 2001, 2021 * Bodensee-Champion: 1910, 1911, 1912, 1913 * Champion Arlbergliga: 1958, 1959 * Champion Vorarlbergliga: 1995 * Champion Regionalliga West: 2000, 2001, 2006 de.wikipedia.org FC Lustenau Erfolge ==References== Category:Austrian football clubs Category:Football clubs of Vorarlberg Category:1907 establishments in Europe Category:1900s establishments in Austria",
 "title": "FC Lustenau 07"
}