{
 "id": "314726",
 "text": "thumb|right|280px| Cliff at Kimmeridge Bay, Dorset, England. The regular changes in the rocks (rhythmite) are caused by changes in the sea level at the time. In turn, this changes the sedimentation. thumb|right|250px|Jurassic shale cliffs of the Kimmeridge Clay formation The Kimmeridge clay formation is a sedimentary deposit of fossiliferous marine clay and mudstones. It is of Upper Jurassic age, and occurs in Europe. It gives its name to a stage in the Upper Jurassic called the Kimmeridgian, lasting from 157.3–152.1 million years ago. Kimmeridge clay is perhaps the most economically important unit of rocks in the whole of Europe, because it is the major source for oil fields in the North Sea. The clay is named after the village of Kimmeridge on the Dorset coast of England, where it is well exposed and forms part of the Jurassic Coast World Heritage Site. It exists across England, in a band stretching from Dorset in the south-west, north-east to East Anglia and Hull. The River Humber Bridge's foundations are in the Kimmeridge Clay deposits under the Humber estuary. The fossil fauna of the Kimmeridge Clay includes a reptile fauna of turtles, crocodiles, dinosaurs, plesiosaurs, pliosaurs and ichthyosaurs, as well as many invertebrate species such as Gryphaea. == Climate == The Kimmeridge Clay was laid down in an environment which is not present on the Earth today. Much of Western Europe was covered by a high sea-level: this may be related to the opening of the Atlantic. As a consequence, the UK was covered by a shallow and largely anoxic sea, perhaps less than 100m deep, with occasional landmasses.Wignall, Paul B. 1990. Benthic palaeoecology of the late Jurassic Kimmeridge Clay of England. Special Papers in Palaeontology, The Palaeontological Association, London. 43. This was shallower water than the Blue Lias of the Lower Jurassic. It was often low in oxygen, which led to its organic material being only partially decomposed. The mudstones are organic- rich, and gave rise to most of the North Sea oil.Chambers, Martin 2000. The Upper Jurassic Kimmeridge Clay. Hull Geological Society == References == Category:Jurassic Category:Sedimentary rocks Category:Geological formations",
 "title": "Kimmeridge clay"
}