{
 "id": "314830",
 "text": "Jagadguru Ramanandacharya Swami Rambhadracharya (better-known as Jagadguru Rambhadracharya or Swami Rambhadracharya) is a Hindu guru, Sanskrit scholar, writer, poet, play writer, composer, singer, philosopher and Katha artist. He is living in Chitrakoot, India. His works includes poems, plays, lectures, commentaries, religious speeches, and musical works of his works. He has written more than 90 works, including published books and unpublished hand written books, and four epic poems,Two each in Sanskrit and Hindi. a Hindi commentary on Tulsidas' Ramcharitmanas, a rhythmic Sanskrit commentary on the Ashtadhyayi, and Sanskrit commentaries on the Prasthanatrayi sacred books.Dinkar 2008, pp. 40–43. Many of his audio and video recordings have been released. He writes in Sanskrit, Hindi, Awadhi, Maithili, and many other languages.Dinkar 2008, p. 39. He is blind. Śrībhārgavarāghavīyam is his most famous work. He won many awards for it, like the Sahitya Akademi Award for Sanskrit. He has also been given many other honors and titles as a writer and poet, like Mahakavi and Kavikularatna.Nagar 2002, p. 183.Chandra 2008, p. 21. His important literature works and musical works, grouped by their type, are listed below.Nagar 2002, pp. 89–90. ==Poems== ===Mahākāvyas (Epic poems)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1994 Arundhatī () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Epic poem made in 1,279 verses, which are separated into 15 cantos on the life of the rishi couple Vasishtha and Arundhati. Rambhadracharya 1994, pp. iii—vi. 2002 Śrībhārgavarāghavīyam () Sanskrit Jagadguru Rambhadracharya Handicapped University Epic poem made of 2,121 verses in 40 Sanskrit and Prakrit metres, separated into 21 cantos of 101 verses each, with a Hindi commentary by the poet. Recipient of Sahitya Akademi Award for Sanskrit, Ramkrishna Jaidayal Dalmia Shreevani Alankaran, Banabhatta Award and Vachaspati Award. 2010 Aṣṭāvakra () Hindi Jagadguru Rambhadracharya Handicapped University Epic poem made of 864 verses separated into 8 cantos of 108 verses each. This poems tells the story of the rishi Ashtavakra, who is shown as the flag carrier of disabled people. 2011 Gītarāmāyaṇam () Sanskrit Jagadguru Rambhadracharya Handicapped University Sanskrit rhythmic epic poem, telling the Ramayana in 1,008 Sanskrit songs separated into 28 cantos of 36 songs each, based on traditional village music tunes. ===Khaṇḍakāvyas (Minor poems)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1980 Kākā Vidura () Hindi Shri Gita Gyan Mandir, Rajkot Small poem on the character Vidura from Mahabharata. 1980 Mukundasmaraṇam () Sanskrit Shri Gita Gyan Mandir, Rajkot Small poem in two parts praising Krishna. 1982 Mā̐ Śabarī () Hindi Giridhar Koshalendra Chiantan Samiti, Darbhanga Small poem on the character Shabari from Ramayana. 1996 () Sanskrit Shri Tulsi Peeth Seva Nyas Small poem on the works and life of the Indian freedom fighter Chandrashekhar Azad, with a Hindi commentary by Dr. Gita Devi Misra. 2000 Sarayūlaharī () Sanskrit Shri Tulsi Peeth Seva Nyas Small poem on the river Sarayu that flows through Ayodhya. 2001 Laghuraghuvaram () Sanskrit Shri Tulsi Peeth Seva Nyas Small poem on the baby form of Rama made only in the short syllables of Sanskrit. 2004 Bhṛṅgadūtam () Sanskrit Jagadguru Rambhadracharya Handicapped University Made of 501 verses separated in two parts and composed completely in the Mandākrānta metre, this mall poem tells the message sent by Rama through a bumblebee, living on the Pravarṣaṇa mountain in Kishkindha, to his wife Sita, who is captured by Ravana in Lanka. ===Patrakāvya (Letter poem)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 2003 Kubjāpatram () Sanskrit Jagadguru Rambhadracharya Handicapped University Letter poem; letter to Krishna from the curled woman who appeared in the Bhagavata Purana. ===Gītakāvyas (Rhythmic poems)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1991 Rāghavagītaguñjana () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Rhythmic poem. 1993 Bhaktigītasudhā () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Rhythmic poem on 438 songs on Rama and Krishna. ===Rītikāvya (Procedure–era Hindi poem)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 2008 Śrīsītārāmakelikaumudī () Hindi Jagadguru Rambhadracharya Handicapped University Rītikāvya, made of 327 mixed verses, separated in three parts of 109 verses each, composed in six Prakrit metres. The verses tells different works of the child forms of Sita and Rama. ===Śatakakāvyas (Poems of one hundred verses)=== Unpublished book written by hand. * Not marked with a date. *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1997 Śrīrāmabhaktisarvasvam () Sanskrit Shri Tulsi Peeth Seva Nyas Poem of one hundred verses. – () * Sanskrit – Poem of one hundred verses in the Arya metre. – Caṇḍīśatakam () * Sanskrit – Poem of one hundred verses in praise of the goddess Chandi. – Rāghavendraśatakam () * >Sanskrit – Poem of one hundred verses in praise of Rama. – Gaṇapatiśatakam () * Sanskrit – Poem of one hundred verses in praise of Ganesha. – Śrīrāghavacaraṇacihnaśatakam () * Sanskrit – Poem of one hundred verses in praise of signs of Rama's feet. ===Stotrakāvyas (Praises)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1987 Śrījānakīkṛpākaṭākṣastotram () Sanskrit Shri Tulsi Peeth Seva Nyas Poem praising the kind look of Sita. 1992 Śrīrāmavallabhāstotram () Sanskrit Shri Raghav Sahitya Prakashan Nidhi, Haridwar Poem praising Sita. 1994 Śrīgaṅgāmahimnastotram () Sanskrit Shri Raghava Sahitya Prakashan Nidhi, Haridwar Poem praising the greatness of the river Ganges. 1995 Śrīcitrakūṭavihāryaṣṭakam () Sanskrit Shri Raghav Sahitya Prakashan Nidhi, Haridwar Poem in eight verses praising Rama. 2002 Śrīrāghavabhāvadarśanam () Sanskrit Shri Tulsi Peeth Seva Nyas Poem of eight Śikhariṇī metres, praising the birth of Rama by comparing baby Rama with eight Utprekṣā figures of speech respectively to the moon, a dark cloud, the ocean, an emerald, a Tamāla tree, Kamadeva, a blue lotus, and a bumblebee. With an Awadhi poem translation and Hindi commentary by the poet. ===Suprabhatam kāvya (Workships sung at morning)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 2009 Śrīsītārāmasuprabhātam () Sanskrit Jagadguru Rambhadracharya Handicapped University A suprabhatam directed to Sita and Rama, made of 40 verses composed in 8 Śārdūlavikrīḍita, 24 Vasantatilakā, 4 Sragdharā, and 4 Mālinī metres. With a Hindi translation by the poet. ===Bhāṣyakāvya (Commentary poem)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1997 Aṣṭādhyāyyāḥ Pratisūtraṃ Śābdabodhasamīkṣaṇam () Sanskrit Under publication by the Rashtriya Sanskrit Sansthan Non-poetic commentary on the Sutras of the Ashtadhyayi. D Litt research paper. ==Plays== ===Nāṭakakāvya (Play poem)=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1996 Śrīrāghavābhyudayam () Sanskrit Shri Tulsi Peeth Seva Nyas Single–act play on the success of Rama. ===Nāṭaka (Play)=== * Not marked with a date. *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Notes – Utsāha () * Hindi Shri Tulsi Peeth Seva Nyas ==Text== ===Sanskrit commentaries on the Prasthānatrayī=== Rambhadracharya made Sanskrit commentaries named Śrīrāghavakṛpābhāṣyam on the Prasthanatrayi – Brahma Sutra, the Bhagavad Gita, and eleven Upanishads. These commentaries were released on 10 April 1998 by the then Prime Minister of India, Atal Behari Vajpayee.Nagar 2002, p. 88. He made Śrīrāghavakṛpābhāṣyam on Narada Bhakti Sutra in 1991. Rambhadracharya then renewed—after five hundred years—the tradition of Sanskrit commentaries on the Prasthanatrayi. His commentary was also the second Sanskrit commentary on Prasthanatrayi of Ramananda Sampradaya, an the first was made by Ramananda himself and it was named Ānandabhāṣyam. Rambhadracharya's commentary in Sanskrit on the Prasthanatrayi was the first written in almost 600 years. *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Commentary on Publisher Notes 1998 (श्रीब्रह्मसूत्रेषु श्रीराघवकृपाभाष्यम्) Brahma Sutra Shri Tulsi Peeth Seva Nyas 1998 (श्रीमद्भगवद्गीतासु श्रीराघवकृपाभाष्यम्) Bhagavad Gita Shri Tulsi Peeth Seva Nyas 1998 Kaṭhopaniṣadi Śrīrāghavakṛpābhāṣyam (कठोपनिषदि श्रीराघवकृपाभाष्यम्) Katha Upanishad Shri Tulsi Peeth Seva Nyas 1998 Kenopaniṣadi Śrīrāghavakṛpābhāṣyam (केनोपनिषदि श्रीराघवकृपाभाष्यम्) Kena Upanishad Shri Tulsi Peeth Seva Nyas 1998 Māṇḍūkyopaniṣadi Śrīrāghavakṛpābhāṣyam (माण्डूक्योपनिषदि श्रीराघवकृपाभाष्यम्) Mandukya Upanishad Shri Tulsi Peeth Seva Nyas 1998 Iśāvāsyopaniṣadi Śrīrāghavakṛpābhāṣyam (ईशावास्योपनिषदि श्रीराघवकृपाभाष्यम्) Ishavasya Upanishad Shri Tulsi Peeth Seva Nyas 1998 Praśnopaniṣadi Śrīrāghavakṛpābhāṣyam (प्रश्नोपनिषदि श्रीराघवकृपाभाष्यम्) Prashna Upanishad Shri Tulsi Peeth Seva Nyas 1998 (तैत्तिरीयोपनिषदि श्रीराघवकृपाभाष्यम्) Taittiriya Upanishad Shri Tulsi Peeth Seva Nyas 1998 Aitareyopaniṣadi Śrīrāghavakṛpābhāṣyam (ऐतरेयोपनिषदि श्रीराघवकृपाभाष्यम्) Aitareya Upanishad Shri Tulsi Peeth Seva Nyas 1998 (श्वेताश्वतरोपनिषदि श्रीराघवकृपाभाष्यम्) Shvetashvatara Upanishad Shri Tulsi Peeth Seva Nyas 1998 Chāndogyopaniṣadi Śrīrāghavakṛpābhāṣyam (छान्दोग्योपनिषदि श्रीराघवकृपाभाष्यम्) Chandogya Upanishad Shri Tulsi Peeth Seva Nyas 1998 Bṛhadāraṇyakopaniṣadi Śrīrāghavakṛpābhāṣyam (बृहदारण्यकोपनिषदि श्रीराघवकृपाभाष्यम्) Brihadaranyaka Upanishad Shri Tulsi Peeth Seva Nyas 1998 Muṇḍakopaniṣadi Śrīrāghavakṛpābhāṣyam (मुण्डकोपनिषदि श्रीराघवकृपाभाष्यम्) Mundaka Upanishad Shri Tulsi Peeth Seva Nyas ===Other Sanskrit commentaries=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Commentary on Publisher Notes 1991 Śrīnāradabhaktisūtreṣu Śrīrāghavakṛpābhāṣyam (श्रीनारदभक्तिसूत्रेषु श्रीराघवकृपाभाष्यम्) Narada Bhakti Sutra Shri Tulsi Peeth Seva Nyas 2011 Śrīrāmastavarājastotre Śrīrāghavakṛpābhāṣyam (श्रीरामस्तवराजस्तोत्रे श्रीराघवकृपाभाष्यम्) Rāmastavarājastotra Shri Tulsi Peeth Seva Nyas ===Hindi commentaries=== # Work is going on. * Not marked with a date. *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Commentary on Publisher Notes 1983 Mahavīrī (महावीरी) Critical edition of Hanuman Chalisa, with a commentary named Mahavīrī Shri Krishna Janma Seva Sansthan, Mathura 1985 Śrīgītātātparya (श्रीगीतातात्पर्य) Bhagavad Gita Shri Raghav Sahitya Prakashan Nidhi, Haridwar 2005 Bhāvārthabodhinī (भावार्थबोधिनी) Ramcharitmanas Jagadguru Rambhadracharya Handicapped University – Śrīrāghavakṛpābhāṣya (श्रीराघवकृपभाष्य) #* Commentary on the Ramcharitmanas in nine volumes. – ===Reviews=== Unpublished book written by hand. *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 1981 Adhyātmarāmāyaṇe Apāṇinīyaprayogānāṃ Vimarśaḥ () Sanskrit – Discussion on the non–Paninian uses in the Adhyātma Rāmāyaṇa. PhD research paper. 1982 Mānasa Me̐ Tāpasa Prasaṅga () Hindi Shri Gita Gyan Mandir, Rajkot Examination on the episode of the unnamed devotee in Ayodhya Kand of Ramcharitmanas. 1988 Sanātanadharma Kī Vigrahasvarūpa Gomātā () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Examination on the status of the cow in Hinduism. 1988 Śrītulasīsāhitya me̐ Kṛṣṇa Kathā () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Research on the description of Krishna in the works of Tulsidas. 1990 Sīta Nirvāsana Nahī̐ () Hindi Shri Raghav Sahitya Prakashan Nidhi, Haridwar Review which says that the episode of exile of Sita is a later addition of Valmiki in the Ramayana. 2007 Śrīrāsapañcādhyāyīvimarśaḥ () Hindi Jagadguru Rambhadracharya Handicapped University Examination on the Rāsapañcādhyāyī section, the five chapters about the dance of Krishna with the Gopis, of the Bhagavata Purana. ===Speeches=== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Book contains Publisher Notes 1980 Bharata Mahimā () Hindi A nine–day speech on the honor of Bharata in the Ramayana. Shri Gita Gyan Mandir, Rajkot 1985 Sugrīva Kā Agha Aura Vibhīṣaṇa Kī Karatūti () Hindi A nine–day Hindi speech on the two characters Sugriva and Vibhishana in the Ramayana. Shri Krishna Janma Seva Sansthan, Mathura 1989 Mānasa me̐ Sumitrā () Hindi A nine–day speech on the character of Sumitra in the Ramcharitmanas. Shri Raghav Sahitya Prakashan Nidhi, Haridwar 1992 Prabhu Kari Kṛpā Pā̐varī Dīnhī () Hindi A nine–day speech on the episode of Rama handing over his sandals to Bharata at Chitrakoot from the Ramayana. Shri Tulsi Peeth Seva Nyas 1993 Parama Baḍabhāgī Jaṭāyu () Hindi A nine–day speech on the character of Jatayu in the Ramayana. Shri Raghav Sahitya Prakashan Nidhi, Haridwar 2001 () Hindi A eight–day speech given in March 1999 on the purpose of Sita and Rama's marriage episode as said in the Ramcharitmanas. Shri Tulsi Peeth Seva Nyas 2004 Tuma Pāvaka Ma̐ha Karahu Nivāsā () Hindi A nine–day speech given in September 2003 on the episode of Sīta's stay in fire as described in the Ramcharitmanas. Jagadguru Rambhadracharya Handicapped University 2006 Ahalyoddhāra () Hindi A nine–day speech given in April 2000 on the episode of Ahalya's mukti by Rama. Jagadguru Rambhadracharya Handicapped University 2008 Hara Te Bhe Hanumāna () Hindi A four–day speech given in April 2007 on Hanuman being Shiva's form. Jagadguru Rambhadracharya Handicapped University ===Critical edition of Ramcharitmanas=== Rambhadracharya's most controversial work was the critical edition of the Ramcharitmanas. It was published as the Tulsi Peeth edition. It was said that he changed the epic, but the dispute ended when Rambhadracharya said sorry for any problem caused by the publication. A writ was also filed against him but it was not accepted. This edition was published in 2005 by Shri Tulsi Peeth Seva Nyas. ==Audio and video== *To arrange this table by year, name, or any other column, click on the icon right of the column name. Year Name Language Publisher Details Notes 2001 Bhajana Sarayū () Hindi Yuki Cassettes, Delhi Audio CD with eight Bhajans (worships) worshiped to Rama. Composed, set to music, and sung by Rambhadracharya. 2001 Bhajana Yamunā () Hindi Yuki Cassettes, Delhi Audio CD with seven Bhajans worshiped to Krishna. Composed, set to music, and sung by Rambhadracharya. 2009 () Hindi Kuber Music, New Delhi Audio CD with six Bhajans worshiped to Hanuman, and composed by Tulsidas. Set to music and sung by Rambhadracharya. 2009 () Sanskrit Yuki Cassettes, Delhi Audio CD of Śrīsītārāmasuprabhātam, a Suprabhata poem. Composed, set to music, and sung in the Vairagi Raga by Rambhadracharya. 2009 () Hindi Yuki Cassettes, Delhi DVD with a musical expression of and commentary on the Sundar Kand of Ramcharitmanas. Spoken, set to music, and sung by Rambhadracharya. ==Timeline of Works== ==Footnotes== ==References== ===Notes=== ===Works cited=== * * * ==Other websites== * * Category:Indian literature",
 "title": "Works of Rambhadracharya"
}