{
 "id": "314812",
 "text": "Malaysia is a federation with 13 states (Negeri) (Wilayah Persekutuan). Eleven states and two federal territories are located on the Malay Peninsula. The other two states and one federal territory are on the island of Borneo. ==The states and federal territories== Malaysian states are divided between the two regions of Malaysia, with 11 states and 2 federal territories on West Malaysia and the other 2 states and 1 federal territory in East Malaysia. Name Capital Population Area (km²) Population Density License plate prefix Phone area code Largest Metropolitan Abbr. ISO FIPS Federal Territory of Kuala Lumpur Kuala Lumpur 1,627,172 243 6696 W,V 03 Klang Valley KUL MY-14 Federal Territory of Labuan Victoria 85,272 91 937 L 087 \\- LBN MY-15 MY15 Federal Territory of Putrajaya Putrajaya 67,964 49 1387 Putrajaya, F 03 Klang Valley PJY MY-16 Johor Johor Bahru 3,233,434 19,210 168 J 07, 06 (Muar & Ledang) Johor Bahru JHR MY-01 MY01 Kedah Alor Setar 1,890,098 9,500 199 K 04 Alor Setar KDH MY-02 MY02 Kelantan Kota Bharu 1,459,994 15,099 97 D 09 Kota Bharu KTN MY-03 MY03 Malacca Malacca City 788,706 1,664 474 M 06 Malacca Town MLK MY-04 MY04 Negeri Sembilan Seremban 997,071 6,686 149 N 06 Seremban NSN MY-05 MY05 Pahang Kuantan 1,443,365 36,137 40 C 09, 03 (Genting), 05 (Cameron) Kuantan PHG MY-06 MY06 Perak Ipoh 2,258,428 21,035 107 A 05 Ipoh PRK MY-08 MY07 Perlis Kangar 227,025 821 277 R 04 Kangar PLS MY-09 MY08 Penang George Town 1,520,143 1,048 1451 P 04 Penang PNG MY-07 MY09 Sabah Kota Kinabalu 3,120,040 73,631 42 S 087-089 Kota Kinabalu SBH MY-12 MY16 Sarawak Kuching 2,420,009 124,450 19 Q 081-086 Kuching SWK MY-13 MY11 Selangor Shah Alam 5,411,324 8,104 668 B 03 Klang Valley SGR MY-10 MY12 Terengganu Kuala Terengganu 1,015,776 13,035 78 T 09 Kuala Terengganu TRG MY-11 MY13 ==Governance== As Malaysia is a federation. The governance of the states is divided between the federal and the state governments, while the Federal government has direct control of the federal territories. The duties of the federal and the state governments are listed in the Ninth Schedule of the Constitution of Malaysia. Theoretically, any matter not set out in the Ninth Schedule can be legislated on by the individual states. However, legal scholars generally view this as a \"pauper's bequest\" because of the large scope of the matters listed in the Ninth Schedule. The courts themselves have generally favoured a wide interpretation of the language of the Ninth Schedule, thus limiting the number of possible subjects not covered. The Ninth Schedule specifically lists the following matters as those that can only be legislated on by the states: land tenure, the Islamic religion, and local government.Wu, Min Aun & Hickling, R. H. (2003). Hickling's Malaysian Public Law, pp. 64–65. Petaling Jaya: Pearson Malaysia. . The 13 states are based on historical Malay Kingdoms. 9 of the 13 states, known as the Malay States, retain their royal families. The Federal King (titled Yang di-Pertuan Agong) is elected (de facto rotated) among the nine rulers to serve a 5-year term. The nine Malay States have a hereditary Ruler as titular Head of state and an executive Chief Minister or Menteri Besar as politically responsible Head of government. The rulers of Johor, Kedah, Kelantan, Pahang, Perak, Selangor and Terengganu are styled Sultans (typically Islamic). Only Negeri Sembilan's elective ruler holds the rare, autochthonous Malay title of Yang di-Pertuan Besar, whereas only the Ruler of Perlis is titled Raja. Former British settlements and crown colonies of Penang and Malacca (both peninsular) and Sabah and Sarawak (both on Borneo) each have a federally appointed titular Governor (styled Yang di-Pertua Negeri) and an executive Chief Minister or Ketua Menteri. ===Sabah and Sarawak=== Sabah and Sarawak have additional powers as part of the terms when they joined Malaysia, such as immigration controls. They have separate immigration policies and controls and a unique residency status. Passports are required even for Malaysians for travelling between these two states or between either state and Peninsular Malaysia, however Peninsular Malaysians who are on social/business visits up to three months are allowed to produce a MyKad or birth certificate and fill in a special form in lieu of a passport. ===Legislature=== Each state has a unicameral legislature called Dewan Undangan Negeri (DUN, State Assembly). Members of DUN are elected from single-member constituencies drawn based on the population. The state leader of the majority party in DUN is usually appointed Chief Minister by the Ruler or Governor. The term of DUN members is five years unless the assembly is dissolved earlier by the Ruler or Governor on the advise of the Chief Minister. Usually, DUN of the states in Peninsular Malaysia are dissolved in conjunction with the dissolution of the federal parliament, in order to have state elections running concurrently with the parliamentary election. However, Rulers and Governors hold discretionary powers in dissolving the DUN.Each state sends two representatives to the Dewan Negara (Senate), the upper house of the federal parliament. The Parliament of Malaysia can legislate on issues of land, Islamic religion and local government in order to provide for a uniform law between different states, or on the request of the state assembly concerned. The law in question must also be passed by the state assembly as well, except in the case of certain land law-related subjects. Non-Islamic issues that fall under the purview of the state may also be legislated on at the federal level for conforming with Malaysian treaty obligations. Each state is further divided into districts, which are then divided into mukim. In Sabah and Sarawak districts are grouped into \"Divisions\". ==Singapore and Brunei== was a Malaysian state from the formation of Malaysia on 16 September 1963 until it was expelled from the Federation on 9 August 1965. was invited to join the Federation but decided not to at the end due to several issues, such as the status of the Sultan within Malaysia, division of Bruneian oil royalties, and pressure from opposition groups which amounted to the Brunei Revolt. ==Related pages== *State emblem of Malaysia *State flags in Malaysia *Districts of Malaysia ==Notes== # The code MY10 is not used in FIPS 10-4 but was used for FIPS 10-3 (for Sabah) # Territories named in official language for both FIPS 10-4 and ISO 3166-2:MY code lists # Wilayah Persekutuan defined as the territories of Kuala Lumpur and Putrajaya. Used by FIPS only ==References== ==Other websites== * Local government in Malaysia",
 "title": "States of Malaysia"
}