{
 "id": "314850",
 "text": "Enrico Fermi's paradox wonders why, with the age and size of the universe and billions of stars and planets that have existed for billions of years, we have not detected any other alien civilizations. There have been attempts to resolve the Fermi paradox by finding evidence of alien civilizations, along with thoughts that such life could exist without humans knowing. The physicist Enrico Fermi first asked the question in an informal discussion in 1950. A paper by Michael H. Hart in 1975 made scientists more curious and they began to study the question in more detail. This is why some people call it the Fermi–Hart paradox. Other common names for the same phenomenon are Fermi's question (\"Where are they?\"), the Fermi Problem, the Great Silence, and silentium universi (Latin for \"the silence of the universe\"; the misspelling silencium universi is also common). == Why interstellar communication is difficult == === Space is deep === Extraterrestrial life might exist, but humans may not know about it. To send signals across long distances in our galaxy, and the universe, is difficult. This is because the power output needed to project the signal would be very large. Coherent (laser-like) signals travel at the speed of light, but our own galaxy is 100,000 light years across. Alien civilizations may not be able to detect the signal, or they may not understand the communication or the method used to communicate. === Space is dusty === Space is full of dust clouds and magnetic fields, which would disturb or eliminate even a coherent (laser-like) beam of electromagnetic radiation. Thousands of tons of cosmic dust are thought to reach the Earth's surface every year.Spacecraft measurements of the cosmic dust flux, Herbert A. Zook. A signal would face much interference in any long-distance travel across space. If it is difficult or impossible for us, it may also be difficult for other forms of life. As for other galaxies, the Andromeda galaxy is 2.5 million light years away.Riess, Adam G.; Fliri, Jürgen; Valls-Gabaud, David 2012. Cepheid period-luminosity relations in the near-infrared and the distance to M31 from the Hubble Space Telescope wide field camera 3\". The Astrophysical Journal 745 (2): p156. == Time == In our Galaxy, the time it takes for signals to travel is very large. Vast eras of time would pass before a reply could be received. There are theories about \"worm-holes\" in space in which communication could be sent through space more quickly, but these are just theories now. There is still a desire for space travel.Crawford I.A. 2011. Project Icarus: a review of local interstellar medium properties of relevance for space missions to the nearest stars. Acta Astronautica 68 (7–8): 691–699. Locally in the Solar System, the main goal is to get minerals which are scarce on Earth.Outer Solar System : prospective energy and material resources. Badescu, Viorel,, Zacny, Kris. Cham, Switzerland. 2018-04-28. ISBN 9783319738451 == Related pages == * Carl Sagan * Drake equation ==References== Category:Extraterrestrial life Category:Paradoxes",
 "title": "Fermi paradox"
}