{
 "id": "314811",
 "text": "Sungai Petani (abbreviated \"Sg. Petani\" or \"SP\")http://www.correctplace.com/ is a town in the state of Kedah, in the northern part of Peninsular Malaysia. Sungai Petani is the second largest town in Kedah after Alor Star. The name Sungai Petani has its roots from sungai meaning river and petani meaning farmer in the Malay language. Sungai Petani in full means \"Farmer's River\", as there are a lot of paddy fields and farmers in the state. The word \"petani\" may also refer to \"Pattani\", a city in present-day Thailand to which the river was once connected. Even the old spelling of Sungai Petani was \"Sungei Patani\", without any reference to farming. == Politics == Sungai Petani is designated as a parliamentary area in its own right. A total of 983,851 people (2008) are able to vote. It is currently represented by Johari Abdul from Parti Keadilan Rakyat. The parliamentary area of Merbok and part of the parliamentary area of Yan (Gurun) form part of Sungai Petani Municipal administrative area. == Economy == Sungai Petani has a high and medium-sized business community. Small and medium industry also play a part in the local economy, producing many products, from semiconductors to television tubes and from textile to wood products. Sungai Petani is also a booming business center with many large malls, franchise stores and business enclaves. Sungai Petani has many malls and shopping centers such as Central Square, Village Mall, Lagenda Height Tesco, Sungai Petani North Tesco, Sungai Petani South Tesco, Giant Hypermarket, Econsave, Billion, Sp Plaza and Parkson. == Transportation == The town is accessible through the Federal Route 1 and also the North-South Expressway. Sungai Petani has two highway exits while the Federal Route I runs across the city. Apart from that, it also has a train station and a makeshift express bus hub that caters to any destination within Peninsular Malaysia, Thailand and Singapore. Sungai Petani also has a relatively below average local bus service called City Liner, with air-conditioned red coaches.The express bus station not far from Sungai Petani Railway Station. The railway station is managed by Keretapi Tanah Melayu Berhad. The nearest airport is the Penang International Airport on Penang Island. Another alternative airport is the Sultan Abdul Halim Airport, Alor Star (the state capital of Kedah). === Bujang Valley === The Bujang Valley or Lembah Bujang, sometimes referred to as the Ancient Wonder of Kedah, is a rich historical site covering an area of about 400sq. km in Merbok (17 km from Sungai Petani), bounded by Bukit Coras (Choras Hill) and Gunung Jerai. This archaeological area was the site of an ancient Hindu-Buddhist kingdom that ruled the region from the 4th century AD. There is also an archaeological museum here which is known as The Lembah Bujang Archaeological Museum.http://www.jmm.gov.my/en/museum/lembah-bujang- archaeological-museum This museum displays more than 2,500 artifacts from Malaysia's earliest civilization that have been unearthed from the surrounding excavation sites. Gold, gems, ceramics, Hindu gods and beautiful Buddha stone statues dating from the third to 14th centuries are all on display, though its main feature is Chandi Bukit Batu Pahat, a reconstructed temple built to worship the Hindu god Shiva. ==Closest Cities== == References == Category:Settlements in Kedah Category:Towns in Asia",
 "title": "Sungai Petani"
}