{
 "id": "315165",
 "text": "Duluth is a city in northeast Minnesota next to Lake Superior and next to Superior, Wisconsin. It is the westernmost U.S. city on the Great Lakes. While the lake has an average elevation of 602 feet above sea level, the adjacent hills rise and an additional 800 feet above it. Duluth is the county seat of Saint Louis County. It is the fourth largest city in Minnesota. At the 2020 census, Duluth had 86,697 people. Duluth is the second largest city on Lake Superior after Thunder Bay, Ontario. It has the largest metropolitan area on Lake Superior. The Duluth MSA had 280,384 people in 2020. Duluth forms a metropolitan area with Superior, Wisconsin called the \"Twin Ports\". The harbor at Duluth-Superior is accessible to ocean-going vessels from the Atlantic Ocean away via the Great Lakes and Saint Lawrence Seaway. Together the two cities are the Great Lakes' largest port transporting coal, iron ore (taconite), and grain. Scenic Lake Superior and rugged coastline with its interesting geologic features make the Duluth area an important tourist destination for the Midwest, with a variety of activities and points of interest available to visitors. During summers, many music festivals take place on the waterfront and the Canal Park area restaurants and shops attract hundreds of thousands visitors. In the fall, visitors flock to Duluth and locations along the North Shore of Lake Superior to take in the colorful leaves and scenic vistas among the many waterfalls along Highway 61. Each year, 16,000 people come to Duluth to run the \"Grandma's Marathon\", with thousands more in attendance to show their support. In the winter, the same rugged geology that provides a scenic backdrop for the city provides many months of downhill skiing and other winter activities at Spirit Mountain. Families also flock to Bentleyvilleto take in the holiday displays that light the night. Each January, the 300 mile Johnbear Grease Sled Dog Marathonbegins in Duluth. America's only all-freshwater aquarium, the Great Lakes Aquarium. Duluth is known for the Aerial Lift Bridge, which spans the Duluth Ship Canal into the Duluth-Superior Harbor. People also visit Minnesota Point (known as Park Point locally), one of the world's longest freshwater sand spits, that is long. People come to the city to start vehicle trips along Minnesota's famous North Shore. The 610' long William A Irvin is a museum ship that used to be the flagship of the United States Steel ore carrier fleet. The city is named after Daniel Greysolon, Le Sieur du Luth, the first known European explorer of the areaand today is famously known as the birthplace of Bob Dylan. ==References== ==Other websites== * *City of Duluth – Official Website *Vintage Pictures of Duluth * Category:County seats in Minnesota Category:1857 establishments in the United States",
 "title": "Duluth, Minnesota"
}