{
 "id": "315132",
 "text": "Cape Mendocino is a geographic feature of the coastline of Northern CaliforniaThe cape is _not_ in Mendocino County, California which is south of it. that is the westernmost point of the Californian coast in Humboldt County. The cape was named in the 1540s after Antonio de Mendoza, the viceroy of New Spain.Hoover, Mildred Brooke and Douglas E. Kyle. (2002). Historic Spots in California, p. 101. ==History== Cape Mendocino has been known as a landmark since the 16th century. Spanish ships crossed the Pacific Ocean by following the Pacific trade winds. The North Equatorial Current brought them to the North American coastline.University of California Santa Barbara (UCSB), Spanish Empire, the Manila Galleon and the Settlement of California: A Historical Essay,\" p. 2; retrieved 2011-11-17 After their landfall, the Manila galleons would sail down the coast to Acapulco, Mexico. \"Oregon History: Some Came by Sea\"; retrieved 2011-11-17. Francis Drake sighted Cape Mendocino in 1576. Hasekura Tsunenaga sailed from Japan to Cape Mendocino in 1613Honda, Henry K. \"The Sendai Connection,\" Facific Citizen. April 1, 2011; retrieved 2011-11-17. on a diplomatic mission. Hasekura was traveling to the courts of Philip II of Spain and Pope Paul V.Nussbaum, Louis-Frédéric. (2002). \"Hasekura Tsunenaga\" in Japan Encyclopedia, p. 293. ==Geology== The Cape Mendocino region is an active earthquake zone. In April 1992, three major earthquakes had their epicenters near the cape.United States Geological Survey (USGS), Cape Mendocino The Mendocino Triple Junction is west of the cape and under the Pacific Ocean. It is a geologic triple junction, and three tectonic plates come together. The San Andreas Fault, a transform boundary, runs south from the junction and separates the Pacific Plate and the North American Plate. To the north is the Cascadia subduction zone, where the Gorda Plate is being subducted under the edge of the North American Plate. Running west from the Mendocino Triple Junction is the Mendocino Fracture Zone, the transform boundary between the Gorda Plate and the Pacific Plate. ==References== ==Other websites== * United States Geological Survey (USGS), M7.2 – Cape Mendocino, 1992 * Bruke Museum, Cascadia tectonic history with map Category:Landforms of California Category:Capes of the United States Category:Humboldt County, California",
 "title": "Cape Mendocino"
}