{
 "id": "315522",
 "text": "Giorgio Orsini (referred often as Giorgio da Sebenico, Giorgio di Matteo, born 1410, died 1475) was an Italian medieval sculptor and architect from Dalmatia. Orsini lived and worked mainly in the city of Sebenico (modern-day Šibenik, Croatia), Republic of Venice.Monvmental Dalmatia by Adolfo Venturi, Ettore Pais, and Pompeo Molmenti; Alfieri & Lacroix, 1917, Biography on pages 63-69 ==Life== Giorgio Orsini descends from ancient and noble House of Orsini. Hard times had been fallen upon the House branch Giorgio belonged to. Mateo, Giorgio's father, as much as Giorgio himself, has forced to support himself and his family by manual labor. As the architect and sculptor, he was educated in the art workshop of sculptors Giovanni and Bartolomeo Buon in Venice.Storia dell'arte italiana: Il Trecento e il Quattrocento by Giuseppe Mazzariol, and Terisio Pignatti; Edizioni scolastiche Mondadori, 1961, page 138 While in Venice, Giorgio married Elizabetta da Monte, who brought him a fair dowry, money and homes in Venice. He invested Elizabetta's money in a grocery store and in a merchant ship which brought them good returns. Elizabetta's husband entrusted her of a power of attorney by which she was able to attend to his affairs while he was absent. In July 1455 Giorgio bought home from a local nobleman Simeonich, where he engraved his family's heraldic symbol - a bear.A holiday in Umbria: with an account of Urbino and the Cortegiano of Castiglione by Sir Thomas Graham Jackson, J. Murray, 1917, page 38 Giorgio Orsini died in 1475, and, so far as I can ascertain, at Sebenico, where he had a house on the doorway of which he carved the bear, the badge of his family, and the mallet and chisels and other implements of his craft2. ... 2Illustrated in my Dalmatia, the Quarnero and Istria, vol. i. p. 406. When signing contracts, Giorgio often used his art name Georgius Dalmaticus, Sixty five years after his death, his grandson, Giacomo, an advocate by vocation, was recognized as a descendant of the noble House of Orsini.Delightful Dalmatia by Alice Lee Hornor Moqué; Funk & Wagnalls company, 1914, page 109 But alas, only the doorway now remains of the house which \"Michelle Simeonich, a nobleman of Sebenico, sold to Giorgio Orsini for two hundred golden ducats of just and good weight\", in the month of June and the year 1455. On the lintel of this old doorway is carved a bear, the heraldic emblem of the great house of Orsini - carved, no doubt, by George's own hand, over this door through which he must have passed so often. Giorgio's and Elizabetta's daughter Flavia married another Dalmatian painter, Giorgio Culinovich (Schiavone) in the year of 1463.Paintings from the Marches: Gentile to Raphael by Pietro Zampetti; Phaidon, 1971, page 197 Other sourceCarlo Crivelli by R. W. Lightbown; Yale University Press, 2004 , page 3 claims that the Orsinis' daughter's name was Elena (who married Schiavone). ==Art work== In Venice, in 1441, Giorgio was invited to Sebenico to replace Messer Antonio di Pietro Paolo who had fallen into disrepute with the building committee of the cathedral of Sebenico. Antonio commenced the Cathedral building in 1431.The Shores of the Adriatic by F. Hamilton Jackson; Echo Library, 2010, page 179 Giorgio abandoned the Gothic style based ideas of his predecessor and followed revolutionary ideas of Italian Renaissance architecture, The whole cathedral building is roofed with wagon vaults, made of huge slabs of marble supported on strong transverse ribs, the same stone covering forming the ceiling inside and the roof outside.Transactions of the Royal Institute of British Architects, Royal Institute of British Architects, 1887 page 176 He was the chief cathedral architect from 1441 to 1473. From July 1, 1477 the work was continued by another architect, Niccolò di Giovanni da Firenze.Storia dell'arte italiana, Volume 6 by Adolfo Venturi; U. Hoepli, 1908 page 1017 In 1444 Giorgio went to Spalato to build the chapel of S. Ranier in the church of S. Benedetto. The work was finished in two years. He came back to Spalato in 1448 to make the chapel of S. Anastasius in the cathedral.The shores of the Adriatic, the Austrian side:the Küstenlande, Istria, and Dalmatia by Frederick Hamilton Jackson, E.P. Dutton, 1908 page 249 Orsini did not follow always the Renaissance. There are also several fine late Ancona Gothic buildings, among them the facade of S. Francesco and S. Agostino churches, the build of Palazzo Benincasa, all done by Giorgio Orsini. Work on S. Agostino facade was finished in 1455. On the S. Agostino facade, Orsini worked between 1455 and 1459.F. Hamilton Jackson [1908] page 250 On the Loggia dei Mercanti, which was built by Giovanni Pace in 1443, the facade, with statues representing the virtues, is the work of Giorgio Orsini (1451-9)Italy, a Phaidon cultural guide, Prentice-Hall, Jan 1, 1985, page 35 In 1460, Giorgio returned to Sebenico. In 1464 and 1465 he was at Ragusa, where he helped in building the Torre Menze, and in restoring the palace of the Rectors. The Palace of Rectors was badly damaged by the 1462 earthquake. Orsini replaced the tree central capitals, who were damaged beyond repair, of that building.The Edinburgh review: or critical journal, Volume 167 by Sydney Smith, Lord Francis Jeffrey Jeffrey, Macvey Napier, William Empson, Henry Reeve, Sir George Cornewall Lewis, Arthur Ralph Douglas Elliot (Hon.), Harold Cox, A. Constable, 1888, page 102 The next year he was at Pago (today Pag, Croatia), improving and enlarging the courtyard of the bishop's palace. The design and work on facade of the cathedral at Ossero belongs to him, too. In the next year he undertook work on the facade of the Cappella Grande of the parish church at Pago. In 1470 he went to Rome, where his compatriot Giovanni Dalmato, the sculptor, of Trau (today Trogir, Croatia), was at work on the monument of Paul II. In 1472 he commenced the facade of S. Maria, Cittanova, in the Marche. He had many pupils, some of whom continued to work on the cathedral at Sebenico after his death in 1475. ==\"Juraj Dalmatinac\"== In Croatia, Giorgio Orsini is celebrated as a Croatian sculptor and architect, known under the Croatian name Juraj Dalmatinac. This name is translation of his art name \"Georgius Dalmaticus\". The translation is coming from the second half of 19th century. Another version of the Orsini's croatised name is Juraj Matejević. This name comes as translation of the \"Georgvs Mathei\" (Georg, Mathew's son) text engraved in the marble of St. Jacob cathedral church in Sebenico. Slovnik umjetnikah jugoslavenskih od Ivana Kukuljevića Sakcinskog, Tiskom Narodne tiskarne Dra Ludevita Gaja, Zagreb 1858. Page 249 Croatian author Fisković claims that \"Orsini\", as his family name, was never used by the artist and it was adopted by his son, after the death of his father.Juraj Dalmatinac by C. Fisković and N. Gattin; Zora Publishing House, Zagreb 1983 page 73 His claim is not supported by any documents or records dated back to the times Orsini lived and worked. Fisković's claim is defeated by the home sale contract where Giorgio Orsini was named as the home buyer.Moqué, 1914Jackson, 1917 Two Italian authors recorded the use of Giorgio's family name by his son Mateo and grandson GiovanniPer trecentosettantasette anni: la gloria di Venezia nelle testimonianze artistiche della Dalmazia by Giuseppe Maria Pilo, Edizioni della Laguna, 2000, page 37 > Giorgio di Matteo Dalmata - com'egli si firma - è probabilmente nativo di > Zara e certamente veneziano di formazione ancorché molto noto come Giorgio > da Sebenico per avervi a lungo operato e avervi creato con la cattedrale di > San Giacomo il suo capolavoro, o come Giorgio Orsini, cognome usato dal > figlio Paolo dal 1512, ufficialmente dal 1516, e confermato al nipote > Giacomo nel 1540 dal governatore veneziano dela Dalmazia Valerio Orsini > quando lo dichiara, anche con i progenitori \"ex nostra stirpe Ursina\". and refuted FiskovicAtti e memorie della Società dalmata di storia patria, Volume 6 Società dalmata di storia patria, La Società, 1969 page 164 > Ci siamo dilungati un po' a parlare del figlio Paolo per dimostrare che con > era poi quella figura \"insignificante\" come vorrebbe il Fiskovic. Croats erected a monument celebrating Orsini in the front of St. Jacob cathedral church in Šibenik, Croatia. This monument, an over-sized standing statue of Orsini, is a work of Yugoslav sculptor Ivan Meštrović. Two elementary schools in Croatia bear that name: one in Pag, Osnovna škola Jurja Dalmatinca Pag and one in Šibenik. Osnovna škola Jurja Dalmatinca Šibenik ==References== Category:Italian sculptors Category:Italian architects Category:1410 births Category:1475 deaths",
 "title": "Giorgio Orsini"
}