{
 "id": "31574",
 "text": "is one of the largest engineering company from Japan created on 24 September 1948. It is well known for making automobiles and motorcycles. Although Honda started in Japan, it now has many factories in other countries that includes the United States, Canada, Brazil, Thailand and China. Honda sells a luxury line of cars in the United States with the Acura name. 1961 ==Current models== Model Calendar year introduced Current model Main markets Vehicle description Introduction Update (facelift) Hatchback Brio 2011 2018 2023 Southeast Asia Entry-level hatchback, currently only produced in Indonesia for several Southeast Asian markets. City 1981 2020 (reintroduction) 2020 – Southeast Asia and South America Hatchback version of the City subcompact car. The newest model replaced the third- generation Fit/Jazz in some emerging markets. \\---- Civic \\----Integra (China) 1972 \\----1985 2021 \\----2023 2024 North America, Europe, Asia-Pacific \\----China Hatchback version of the Civic compact car. Also sold as the Honda Integra in China; no longer related to the Acura Integra. Fit/Jazz/Life 2001 2019 2022 Japan, China, Europe and others Practicality-oriented subcompact hatchback/supermini. Hybrid and e:HEV available. Sedan \\---- Accord \\----Inspire (China) 1976 2022 – North America, Asia-Pacific \\----China Mid- size sedan. Also available as the Inspire in China. Hybrid and PHEV available. Amaze 2013 (as Brio Amaze) 2024 – India Entry-level sedan engineered for the Indian market. \\---- City/Ballade 1996 (as a sedan) 2019 2023 Global emerging markets Subcompact/compact sedan. The latest generation is destined for emerging markets. Hybrid or e:HEV available. \\---- Civic \\----Integra (China) 1972 \\----1985 2021 \\----2021 2024 North America, Asia-Pacific \\----China Compact sedan. Oldest continuous nameplate used in a Honda automobile. \\---- Crider \\----Envix 2013 \\----2018 2018 \\----2018 2021 \\----2022 China Chinese regional products that slots between the Fit/Life and Civic/Integra, manufactured by GAC Honda and Dongfeng Honda respectively. MPV/minivan/station wagon Freed 2008 2024 – Japan and others Two or three-row Mini MPV with sliding doors for the Japanese market. Hybrid available. Mobilio 2001 (as a JDM MPV) 2014 2014 2017 Southeast Asia Three-row entry-level mini MPV engineered for the Indonesian market. Based on the Brio platform. \\---- Odyssey (international) \\----Elysion (China) 1994 \\----2004 2013 \\----2015 2020 \\----2021 Asia \\----China Three-row minivan with sliding doors. Hybrid available. The Elysion is only available in China, produced by Dongfeng Honda. Odyssey (North America) 1994 2017 2020 North America and others Three-row minivan with sliding doors engineered for the North American market, exported throughout the Americas and Middle East. Stepwgn 1996 2022 – Japan Three-row high-roof compact MPV with sliding doors mainly for the Japanese market. Hybrid also available. Crossover/SUV \\---- Avancier \\----UR-V 2016 \\----2017 2016 \\----2017 2023 \\----2023 China Two-row mid-size crossover SUV for the Chinese market produced by Guangqi Honda and Dongfeng Honda respectively. BR-V 2016 2021 – Southeast Asia and others Two-/three-row subcompact crossover SUVs destined for emerging markets. \\---- CR-V \\----Breeze (China) 1995 \\----2019 2022 \\----2022 – Global \\----China Compact crossover SUV. Available as a two- row and three-row in select markets. Hybrid, PHEV and FCEV also available. The Breeze is only available in China produced by Guangqi Honda. Elevate (India) \\----WR-V (Japan) 2023 2023 – India and Japan Subcompact crossover SUV for the Indian and Japanese market. \\---- e:NS2 \\----e:NP2 2024 \\----2024 2024 – China Battery electric crossover SUV produced by Dongfeng Honda and Guangqi Honda respectively. e:NS1 (China) \\----e:NP1 (China) \\----e:Ny1 (Europe) \\----e:N1 (Thailand) 2022 \\----2022 \\----2023 \\----2023 2022 \\----2022 \\----2023 \\----2023 – China, Europe and Thailand Battery electric version of the HR-V/Vezel subcompact crossover SUV. HR-V (global) \\----Vezel (Japan and China) \\----XR-V (China) 1998 \\----2013 \\----2014 2021 – Global (except North America and India) Subcompact crossover SUV. Hybrid available. Passport 1993 (nameplate) 2025 – North America and others Two-row mid-size crossover SUV, shorter version of the Pilot. Pilot 2002 2022 – North America and others Three-row mid-size crossover SUV mainly for the North American market. Prologue 2023 2023 – North America Two-row mid-size crossover SUV based on GM BEV3 platform. WR-V 2016 2022 – Southeast Asia Crossover SUV slotted below the HR-V. Smallest SUV model from Honda. \\---- Ye P7 \\----Ye S7 2024 \\----2024 2024 – China Battery electric compact crossover SUV produced by Dongfeng Honda and Guangqi Honda respectively. ZR-V (global) \\----HR-V (North America and China) 2022 2022 – Global (except Southeast Asia, India) Compact crossover SUV positioned below the CR-V. Sold in North America and China (by Dongfeng Honda) as the HR-V. Hybrid also available. Kei vehicles N-Box 2011 2023 – Japan Super tall-height wagon kei car with rear sliding doors. Best-selling car in any category in Japan. N-One 2012 2020 – Japan Retro-styled low-roof hatchback kei car with hinged rear doors. N-Van 2018 2018 - Japan Kei commercial microvan with rear sliding doors with the emphasis on rear cargo space. N-WGN 2013 2019 2022 Japan Semi-tall height wagon kei car with hinged rear doors. Pickup truck Ridgeline 2004 2016 2020 North America Unibody/monocoque pickup based on the Pilot and Passport. Sports/performance car Civic Type R 1997 2022 – Global Performance version of the Civic hatchback. == Former models == Model Introduced Discontinued Reintroduced Re-discontinued Notes 145 1972 1974 1300 1969 1973 Airwave/Partner 2005 2010 Ascot 1989 1997 Acty 1977 2021 Ballade 1980 1986 Beat 1991 1996 Capa 1998 2002 City/Jazz 1981 1986 Clarity 2008 2014 2016 2021 Formerly Honda FCX Clarity in 2007 through 2014 CR-X 1983 1991 a.k.a. Ballade Sports CR-X or Civic CR-X CR-X del Sol 1992 1997 CR-Z 2011 2016 Crossroad 1993 1998 2007 2010 Crosstour 2010 2015 Concerto 1988 1994 Domani 1992 2004 Element 2002 2011 EV Plus 1997 1999 an electric vehicle e 2019 2024 an electric vehicle FR-V/Edix 2004 2009 Gienia 2015 2019 Version of Sixth generation City for China Grace 2014 2020 Version of Sixth generation City for Japan Greiz 2015 2019 Version of Sixth generation City Liftback for China Horizon 1994 1999 Rebadged Isuzu Trooper Insight 1999 2014 2018 2022 A dedicated hybrid electric vehicle Jade 2013 2020 L700 1965 1966 L800 1966 1967 LaGreat 1999 2004 Version of North American Odyssey for Japan Legend 1985 2021 Life Dunk 2000 2004 Life 1971 1974 1997 2014 Logo 1996 2001 Mobilio Spike 2002 2008 N360 1967 1970 N600 1969 1972 NSX 1990 2005 2016 2022 aka Acura NSX Orthia/Partner 1996 2002 P700 1965 1966 P800 1966 1967 Prelude 1978 2001 Quint 1980 1985 Rafaga 1993 1997 S500 1963 1964 S660 2015 2022 S600 1964 1966 S800 1966 1970 S2000 1999 2009 Shuttle 2011 2022 S-MX 1996 2002 Spirior 2009 2018 Stream 2000 2014 T360/T500 1963 1967 That's 2002 2007 Today 1985 1997 Torneo 1997 2002 Tourmaster 1996 1998 Rebadged Isuzu Faster Vamos/Vamos Hobio 1970 1973 1999 2018 Z 1970 1974 1998 2002 Zest 2006 2012 Honda also makes ATVs. Honda is also known for participating in a very wide range of motorsport events, including Formula One , MotoGP, LeMans, IRL and others. Honda also makes small engines for chainsaws, lawnmowers and leaf blowers. Honda does a lot of research on humanlike robots. Honda built Asimo, a robot that can walk, talk, dance, carry things and answer questions. These are not yet for sale in the United States. Honda also creates a jet, known as the HondaJet. It is not often seen in the United States. ==Related pages== * Acura == References == == Other websites == * Official site * Honda Canada * Information on the Honda Prelude Category:Automobile companies of Japan",
 "title": "Honda"
}