{
 "id": "315833",
 "text": "Eva Marie Saint (born July 4, 1924) is an American movie and stage actress. She has performed in many movies, television programs and stage acts. She won an Academy Award for her role in the 1954 movie On the Waterfront. She also played Eve Kendall in the 1959 Alfred Hitchcock movie North by Northwest. For her role in the 1957 movie A Hatful of Rain she was nominated for a Golden Globe Award. In 1990, she won an Emmy Award for her role in the miniseries People Like Us. ==Personal life== Saint was born in Newark, New Jersey and studied at Actors Studio and Bowling Green State University. She was married to producer/director Jeffrey Hayden from 1951 until his death in 2016. They have two children, Darrell (born April 1, 1955) and Laurette (born July 19, 1958), and three grandchildren. Hayden died on December 24, 2016. ==Works== Year Title Role Notes 1947 A Christmas Carol Television movie 1948–1955 The Philco Television Playhouse TV, 4 episodes, Nominated for Best Actress Emmy 1949 Lights Out TV, 1 episode 1949 Suspense Francie TV, 1 episode 1949–1950 Actor's Studio TV, 3 episodes 1949–1953 Studio One TV, 3 episodes 1950 The Prudential Family Playhouse TV, 1 episode 1950–1951 Buck Rogers Wilma Deering TV, 41 episodes 1950–1952 One Man's Family Claudia Barbour Roberts #2 TV 1950–1951 Versatile Varieties TV, unknown episodes 1953 The Trip to Bountiful Thelma Television movie 1953 ABC Album/Jamie Cousin Liz TV, 1 episode 1953 The Web TV, 2 episodes 1953 Eye Witness TV, 1 episode 1953 The Revlon Mirror Theater TV, 1 episode 1953–1954 Goodyear Television Playhouse Frances Barclay TV, 2 episodes 1954 On the Waterfront Edie Doyle Academy Award for Best Supporting Actress Nominated for BAFTA award 1954 General Electric Theater Maudle Applegate TV, 1 episode 1955 Producers' Showcase TV, 2 episodes, Nominated for Best Actress Emmy 1956 That Certain Feeling Dunreath Henry 1957 A Hatful of Rain Celia Pope Nominated for Best Foreign Actress BAFTA Nominated for Golden Globe Nominated for Laurel Award 1957 Raintree County Nell Gaither 1959 North by Northwest Eve Kendall 1960 Exodus Kitty Fremont 1962 All Fall Down Echo O'Brien 1964 Bob Hope Presents the Chrysler Theatre Diane Wescott TV, 1 episode 1964 Carol for Another Christmas The Wave Television movie 1965 36 Hours Anna Hedler 1965 The Sandpiper Claire Hewitt 1966 The Russians Are Coming, the Russians Are Coming Elspeth Whittaker 1966 Grand Prix Louise Frederickson 1968 The Stalking Moon Sarah Carver 1970 Loving Selma Wilson 1972 Cancel My Reservation Sheila Bartlett 1974 The First Woman President Oklahoma Red Television movie 1976 The Macahans Kate Macahan Television movie 1976 The Fatal Weakness Television movie 1977 How the West Was Won Katherine \"Kate\" Macahan Miniseries, Nominated for Outstanding Lead Actress Emmy 1978 Taxi!!! Passenger Television movie, Nominated for Outstanding Lead Actress Emmy 1978 A Christmas to Remember Emma Larson Television movie 1979 When Hell Was in Session Jane Denton Television movie 1980 The Curse of King Tut's Tomb Sarah Morrissey Television movie 1981 The Best Little Girl in the World Joanne Powell Television movie 1981 Splendor in the Grass Mrs. Loomis Television movie 1983 Malibu Mary Wharton Television movie 1983 Jane Doe Dr. Addie Coleman Television movie 1983–1984 The Love Boat Priscilla TV, 4 episodes 1984 Love Leads the Way: A True Story Mrs. Eustes Television movie 1984 Fatal Vision Mildred Kassab Television movie 1986 A Year in the Life Ruth Gardner Miniseries 1986 Nothing in Common Lorraine Basner 1986 The Last Days of Patton Mrs. Beatrice Ayer Patton Television movie 1986–1988 Moonlighting Virginia Hayes TV, 6 episodes 1987 Breaking Home Ties Emma Television movie 1988 I'll Be Home for Christmas Martha Bundy Television movie 1990 Voyage of Terror: The Achille Lauro Affair Marilyn Klinghoffer Television movie 1990 People Like Us Lil Van Degan Altemus Television movie Won Outstanding Supporting Actress Emmy 1991 Palomino Caroline Lord Television movie 1993 Kiss of a Killer Mrs. Wilson Television movie 1995 My Antonia Emmaline Burden Television movie 1996 Mariette in Ecstasy Mother Saint-Raphael 1996 After Jimmy Liz Television movie 1996 Titanic Hazel Foley Miniseries 1997 Time to Say Goodbye? Ruth Klooster 1999 Frasier Joanna Doyle TV, 1 episode 2000 I Dreamed of Africa Franca 2000 Papa's Angels Dori \"Grammy\" Jenkins Television movie 2003 Open House Veronica Reynolds Television movie 2005 Because of Winn-Dixie Miss Franny 2005 Don't Come Knocking Howard's Mother 2006 Superman Returns Martha Kent 2012 The Legend of Korra Katara TV, recurring role 2013 Winter's Tale Willa (adult) ==Awards and nominations== Year Group Award Movie or series Result 1955 Academy Award Best Actress in a Supporting Role On the Waterfront 1999 Ft. Lauderdale International Film Festival Lifetime Achievement Award - 2000 Savannah Film and Video Festival Lifetime Achievement Award - 2004 San Luis Obispo International Film Festival King Vidor Memorial Award - 2007 Golden Boot Awards - - 1955 BAFTA Award Most Promising Newcomer to Film On the Waterfront 1958 BAFTA Award Best Foreign Actress Hatful of Rain 1955 Emmy Award Best Actress in a Single Performance The Philco Television Playhouse (Episode: \"Middle of the Night\") 1956 Emmy Award Best Actress - Single Performance Producers' Showcase (Episode: \"Our Town\") 1977 Emmy Award Outstanding Lead Actress in a Limited Series How the West Was Won 1978 Emmy Award Outstanding Lead Actress in a Drama or Comedy Special Taxi!!! 1990 Emmy Award Outstanding Supporting Actress in a Miniseries or a Special People Like Us 1958 Golden Globe Award Best Motion Picture Actress - Drama A Hatful of Rain 1958 Laurel Awards Top Female Dramatic Performance A Hatful of Rain 3rd Place ==References== == Other websites == * Category:American Academy Award winning actors Category:Emmy Award winning actors Category:American movie actors Category:American stage actors Category:American television actors Category:Actors from Newark, New Jersey Category:1924 births Category:Living people Category:American centenarians",
 "title": "Eva Marie Saint"
}