{
 "id": "316159",
 "text": ":This article is about the Japanese national capital in general. For the current capital, see Tokyo. The capital of Japan is Tokyo. In the course of history, the national capital has been in many locations other than Tokyo. ==History== Traditionally, the home of the Emperor was considered the capital. From 794 through 1868, the Emperor lived in Kyoto. After 1868, the seat of the Government of Japan and the location of the Emperor's home was Tokyo. In 1941, the Ministry of Education published the .国会等の移転ホームページ – 国土交通省. Mlit.go.jp. Retrieved on 2011-04-29. After World War II, the new Constitution of Japan transferred the state's sovereignty from the Emperor to the people. The people of Japan are represented by the Diet of Japan in Tokyo. Consensus considers the site of the Diet is the capital of Japan. ===Capital area=== No law makes Tokyo as the Japanese capital. However, many laws have defined a which incorporates Tokyo.The term shuto came into use during the 1860s as a gloss of the Western concept of \"capital\". This term for capital was not used to refer to Kyoto. Article 2 of the of 1956 states that :\"In this Act, the term 'capital area' shall denote a broad region comprising both the territory of Tokyo Metropolis as well as outlying regions designated by cabinet order.\"首都圏整備法 . Law.e-gov.go.jp. Retrieved on 2011-04-29. Laws which identify this \"capital area\" include the and the .首都圏近郊緑地保全法 . Law.e-gov.go.jp. Retrieved on 2011-04-29. ==List of capitals== ===Legendary=== This list of legendary capitals of Japan begins with the reign of Emperor Jimmu. The names of the Imperial palaces are in parentheses. # Kashiwabara, Yamato at the foot of Mt. Unebi during reign of Emperor JimmuPonsonby-Fane, Richard. (1915). The Imperial Family of Japan, p. 1. # Kazuraki, Yamato during reign of Emperor SuizeiPonsonby-Fane, p. 2. # Katashiha, Kawachi during the reign of Emperor Annei # Karu, Yamato during reign of Emperor Itoku.Ponsonby-Fane, pp. 2-3. # Waki-no-kami, Yamato during the reign of Emperor KoshoPonsonby-Fane, p. 3. # Muro, Yamato during reign of Emperor Koan # Kuruda, Yamato during the reign of Emperor Korei # Karu, Yamato during reign of Emperor Kōgen # Izakaha, Yamato during reign of Emperor Kaika # Shika, Yamato (Palace of Mizugaki) during reign of Emperor SujinPonsonby-Fane, p. 4. # Shika, Yamato (Palace of Tamagaki) during reign of Emperor SuininPonsonby-Fane, p. 5. # Makimuko, Yamato (Palace of Hishiro) during reign of Emperor KeikoPonsonby-Fane, p. 6. # Shiga, Ōmi (Palace of Takaanaho) during reign of Emperor SeimuPonsonby-Fane, p. 7. # Ando (Palace of Toyoura) and Kashiki on the island of Kyushu during reign of Emperor Chūai ===Historical=== This list of capitals includes the Imperial palaces names in parentheses. ; Kofun period * Karushima, Yamato (Palace of Akira), reign of Emperor OjinPonsonby-Fane, p. 8. * Naniwa, Settsu (Palace of Takatsu), reign of Emperor NintokuPonsonby-Fane, p. 9. * Ihare, Yamato (Palace of Watasakura''), reign of Emperor RichūPonsonby-Fane, p. 10. * Tajikhi, Kawachi (Palace of Shibakaki), reign of Emperor HanzeiPonsonby-Fane, p. 11. * Asuka, Yamato (Palace of Tohotsu), reign of Emperor Ingyō * Isonokami, Yamato (Palace of Anaho), reign of Emperor AnkōPonsonby-Fane, p. 12. * Sakurai, Nara (Hatsuse no Asakura Palace), 457–479 in reign of Emperor YūryakuPonsonby-Fane, p. 13. * Sakurai, Nara (Iware no Mikakuri Palace), 480–484 in reign of Emperor SeineiPonsonby-Fane, p. 14; excerpt, \"Mikaguri Palace\" * Asuka, Yamato (Chikatsu-Asuka-Yatsuri Palace), 485–487 in reign of Emperor Kenzō * Tenri, Nara (Isonokami Hirotaka Palace), 488–498 in reign of Emperor NinkenPonsonby-Fane, p. 15. * Hatsuse, Nara (Nimiki Palace), 499–506 in reign of Emperor Buretsu * Hirakata, Osaka (Kusuba Palace), 507–511 * Kyōtanabe, Kyoto (Tsutsuki Palace), 511–518 * Nagaoka-kyō (Otokuni Palace), 518–526 * Sakurai, Nara (Iware no Tamaho Palace), 526–532 in reign of Emperor KeitaiPonsonby-Fane, p. 16. * Kashihara, Nara (Magari no Kanahashi Palace), 532–535 in reign of Emperor AnkanPonsonby-Fane, p. 17; except, \"Palace of Kanahashi at Magari, Yamato\" * Sakurai, Nara (Hinokuma no Iorino Palace), 535-539 in reign of Emperor Senka ;Asuka period * Asuka, Yamato (Shikishima no Kanasashi Palace), 540–571 in reign of Emperor Kimmei * Kōryō, Nara (Kudara no Ohi Palace), 572–575 * Sakurai, Nara (Osata no Sakitama Palace or Osada no Miya), 572–585 in reight of Emperor BidatsuPonsonby-Fane, p. 18. * Shiki District, Nara (Iwareikebe no Namitsuki Palace), 585–587 in the reign of Emperor YomeiPonsonby-Fane, p. 19. * Shiki District, Nara (Kurahashi no Shibagaki Palace), 587–592 in the reign of Emperor Sushun * Asuka, Yamato (Toyura Palace or Toyura-no-miya), 593–603Asuka Historical Museum, Palaces of the Asuka Period,\" 1995; retrieved 2011-11-25. in the reign of Empress SuikoPonsonby-Fane, p. 20. * Asuka, Yamato (Oharida Palace or Oharida-no- miya), 603–629 in the reign of Empress Suiko * Asuka, Yamato (Okamoto Palace or Oakmoto-no-miya), 630–636 in the reign of Emperor JomeiPonsonby-Fane, p. 21. * Kashihara, Nara (Tanaka Palace or Tanaka-no-miya), 636–639 * Kōryō, Nara (Umayasaka Palace or Umayasaka-no-miya), 640 * Kōryō, Nara (Kudara Palace or Kudara-no-miya), 640–642 * Asuka, Yamato (Oharida Palace), 642–643 * Asuka, Yamato (Itabuki Palace or Itabuki no miya), 643–645 in the reign of Empress Kōgyoku * Osaka (Naniwa-Nagara no Toyosaki Palace), 645–654 なにわ活性化プロジェクト (Naniwa Revialization Project), August 24, 201; retrieved 2011-11-24. in the reign of Emperor KōtokuPonsonby-Fane, p. 23. * Asuka, Yamato (Itabuki Palace), 655–655 in the reign of Kōtoku * Asuka, Yamato (Kawahara Palace or Kawahara- no-miya), 655–655 * Asuka, Yamato (Okamoto Palace or Nochi no Asuka-Okamoto- no-miya), 656–660 in the reign of Emperor SaimeiPonsonby-Fane, p. 24. * Asakura, Fukuoka (Asakura no Tachibana no Hironiwa Palace or Asakure no Tachibana no Hironiwa-no-miya), 660–661 * Osaka, (Naniwa-Nagara no Toyosaki Palace), 661–667 * Ōtsu, Shiga (Ōmi Ōtsu Palace or Ōmi Ōtsu-no-miya), 667–672 in reign of Emperor Tenji and the reign of Emperor KobunPonsonby-Fane, p. 25. * Asuka, Yamato (Kiyomihara Palace or Kiomihara-no-miya), 672–694 in the reign of Emperor TemmuPonsonby-Fane, p. 26. and in the reign of Empress JitoPonsonby-Fane, p. 27. * Fujiwara-kyō (Fujiwara Palace), 694–710 in the reign of Emperor Mommu ; Nara period * Heijō-kyō (Heijō Palace), 710–740 in the reigns of Empress Genmei,Ponsonby-Fane, p. 28. Empress Gensho,Ponsonby- Fane, p. 29. and Emperor Shomu * Kuni-kyō (Kuni Palace), 740–744 in the reign of ShomuPonsonby-Fane, p. 30. * Naniwa-kyō (Naniwa Palace), 744 * Naniwa-kyō, Shigaraki Palace, 744–745 * Heijō-kyō (Heijō Palace), 745–784 * Nagaoka-kyō (Nagaoka Palace), 784–794 in the reign of Emperor KammuPonsonby-Fane, p. 34. ; Heian period * Heian-kyō (Heian Palace), 794–1180 in the reign of Kammu and others * Fukuhara Palace, 1180 in the reign of Emperor AntokuPonsonby-Fane, p. 37. * Heian-kyō/Kyoto (Heian Palace), 1180–1868 * To-kyō (Kōkyo), 1868–present ==References== ==More reading== * ==Other websites== Category:History of Japan Category:Japan-related lists",
 "title": "Capital of Japan"
}