{
 "id": "316154",
 "text": "The Azerbaijani Air and Air Defence Force often called the Azerbaijani Air Force () is the air force and air defence force of the Azerbaijani Armed Forces. The origin of the current organization goes back to June 26, 1918, when the Azerbaijan Democratic Republic which became independent in 1918, after the collapse of the Russian Empire, bought its first fighter aircraft. After the second independence of Azerbaijan in 1991, after the collapse of the Soviet Union, the presence of former Soviet air bases in Azerbaijan helped the Air and Air Defence Force develop. ==Current organization== The Azerbaijani Air and Air Defence Force has about 600 aircraft and 350 helicopters, and 7,900 personnel. The IISS list 37 fighter aircraft, 15 fighter-ground attack aircraft, four transport aircraft, 50 training aircraft (including five combat capable trainers), 15 attack helicopters, and 20 transport helicopters There are Soviet-made MiG-21s, MiG-23s, Su-24s and Su-25s, as well as fourth generation MiG-29s bought from Ukraine in 2006 and Soviet-made Il-76s. Azerbaijan is holding talks with either China or Pakistan to buy JF-17 Thunder aircraft. The MiG-29 has been chosen as the standard aircraft for the Azerbaijani Air and Air Defence Force.Azerbaijan shows 4th generation MiG-29 multirole fighter jets. ==Related pages== *Military history of Azerbaijan *Azerbaijani Armed Forces *Azerbaijani Land Force *Azerbaijani Navy *Azerbaijani National Guard *Internal Troops of Azerbaijan *State Border Service of Azerbaijan ==Other websites== *Official site of Ministry of Defence Industry of Azerbaijan Republic *Azerbaijani Army being reformed according to NATO standards *U.S. Army War College Center for Strategic Leadership, Transformation of the Azerbaijani Armed Forces , October 2008 *Official YouTube Channel of Azerbaijani Soldier program ==References== ==Other websites== * Azerbaijani Air and Air Defence Force • Azərbaycan Hərbi Hava Qüvvələri Air Force Category:Air forces",
 "title": "Azerbaijani Air Force"
}