{
 "id": "316177",
 "text": ":This article is about the Korean national capital in general. For the current capital, see Seoul or Pyongyang. The capital of Korea has been in many locations during the history of the Korean peninsula. Today there are two Koreas, each with its own capital city: * Seoul is the capital of the Republic of Korea (ROK), also known as South KoreaSeoul Metropolitan Government, \"A Brief Introduction of Seoul\" ; retrieved 2011-11-24. * Pyongyang is the capital of the Democratic People's Republic of Korea (DPRK), also known as North Korea Since the end of World War II, there have been two countries or divided Korea:Maps of the World, \"Capital of Korea\" ; retrieved 2011-11-24. If reunification were to take place someday, alternate prospects for the capital city, along with Seoul and Pyŏngyang,are Sejong City in South Korea and Kaesong in North Korea.Richardson, Harry W. and Chang-Hee Christine Bae, \"Options for the Capital of a Reunified Korea,\" SAIS Review, Vol. 29, No 1, Winter-Spring 2009, pp. 67-77; retrieved 2011-11-24. ==History== ;During the Gojoseon period The Go-Joseon period lasted from 2333 BC to 108 BC.Consulate General of the Republic of Korea, Toronto, \"A Chronological Outline\" ; retrieved 2011-11-24. * Unknown — first capital * Pyongyang — second capital (post 400 BC) ;During the Three Kingdoms period The Three Kingdoms period lasted from 57 BC to AD 676 * Jolbon – first capital of GoguryeoSin Ki-sop. (2004). Korea Annual, p. 18; Madrolle, Claudius. (1912). Northern China, the Valley of the Blue River, p. 422. * Gungnae-seong – second capital of Goguryeo * Pyongyang – third capital of Goguryeo * Wiryeseong – first capital of Baekje * Ungjin – second capital of Baekje * Sabi – third capital of Baekje * Gyeongju – capital of SillaKorea Tourism Organization, \"Gyeongju, Capital of the Silla Kingdom for a Thousand Years\" ; retrieved 2011-11-24. ;During the North-South States Period * Gyeongju – capital of Silla * Dongmo Mountain – first capital of Balhae * Junggyeong – second capital of Balhae * Sanggyeong – third capital of Balhae ;During the Later Three Kingdoms period * Gyeongju – capital of Silla * Wansanju – capital of Hubaekje * Songak – first capital of Taebong * Cheorwon – second capital of Taebong ;During the Goryeo Dynasty period The Goryeo Dynasty lasted from 918 to 1392. * GaegyeongArcheological Tours, \"An Archaeological Study Tour, South Korea,\" ; retrieved 2011-11-24. ;During the Joseon Dynasty period The Joseon Dynasty lasted from 1392 to 1910. * Hanseong ;During the Japanese colonial period The Japanese colonial period lasted from 1910 to 1945. * Seoul ==Modern capitals== * Seoul * Pyongyang ==References== Category:History of Korea",
 "title": "Capital of Korea"
}