{
 "id": "316237",
 "text": "The Jat people, also spelt as Jaat and Jatt, (supposedly derived from Jatta, a broad word used for cattle gazers and camel breeders, moving in a group-jatha) are predominantly a agriculturist and landowning community of Northern India and Pakistan. Originally agriculturalist in the lower Indus river-valley of Sindh, many Jats migrated north into the Punjab region in late medieval times, and subsequently into the Punjab Territory, northeastern Jangladesh, and the western Gangetic Plain in the 17th and 18th centuries. Found in Hindu, Muslim and Sikh faiths, they are now found mostly in the Indian states of Punjab, Haryana, Uttar Pradesh and Rajasthan and the Pakistani regions of Sindh, Punjab and AJK. ==History== The Jats are a diverse community in the Indian subcontinent, ranging from simple landowning peasants to wealthy and influential Zamindars. \"Out of the 45 parganas of the sarkars of Delhi, 17 are reported to have Jat Zamindars. Out of these 17 parganas, the Jats are exclusively found in 11, whereas in other 6 they shared Zamindari rights with other communities\" Originally pastoralists in the Indus Valley, they became farmers by the eighth century, as noted during Muhammad bin Qasim’s conquest of Sindh. Arab writers called them “Zutt” and described their presence in various regions. Jats fought against Qasim’s forces alongside King Dahir but faced discrimination under Arab rule, continuing Hindu-era practices. Between the 11th and 16th centuries, Jats migrated from Sindh to Punjab, adopting agriculture with tools like the water wheel. By Mughal times, “Jat” often meant “peasant” in Punjab, and some became landowners. “the most numerous of the agricultural tribes (in the Punjab) were the Jats. They had come from Sindh and Rajasthan along the river valleys, moving up, displacing the Gujjars and Rajputs to occupy cultural lands”. By 1595, Jat Zamindars controlled about 32% of Punjab’s Zamindaris. Initially pastoralists with little exposure to major religions, Jats adopted Islam in western Punjab, Sikhism in eastern Punjab, and Hinduism in areas between Delhi and Agra, reflecting regional religious influences. During the Mughal Empire’s decline in the 18th century, Jats led rural rebellions, gaining land and power. Some, like Badan Singh of Bharatpur, became minor princes. In 1669, Hindu Jats under Gokula rebelled against Emperor Aurangzeb. By the early 18th century, Jats dominated areas south and east of Delhi, forming petty states through alliances. Sikhism grew among Jats, especially during Guru Arjan’s time (1563–1606), when towns like Tarn Taran and Kartarpur became Sikh hubs. Jat Sikhs led most of the 12 Sikh Misls (confederacies) and resisted Mughal rule. The British later encouraged Hindu Jats to convert to Sikhism to boost Sikh army recruits. Sikh Jat rulers governed states like Patiala, Faridkot, Jind, and Nabha. “The passage to Delhi, however, lay through the cis–Sutlej states of Patiala, Jind, Nabha and Faridkot, a long chain of Jat Sikh states that had entered into a treaty of alliance with the British as far back as April 1809 to escape incorporation into the kingdom of their illustrious and much more powerful neighbour, 'the lion of Punjab, Maharaja Ranjit Singh” ==Demography== In India, Jats and Sikh form 20–25% of Haryana’s population and 20–35% of Punjab’s, with 9% in Rajasthan, 5% in Delhi, and 1.2% in Uttar Pradesh. Classified as a General (forward) caste in most states, Jats in Rajasthan (except Bharatpur and Dholpur) qualify for central OBC reservation. Seven states include Jats in their OBC lists. == Culture and society == Many Jats serve in the Indian Army, including the Jat Regiment, Sikh Regiment, Rajputana Rifles, and Grenadiers, earning numerous gallantry awards. Jats also serve in the Pakistan Army, particularly in the Punjab Regiment. During the British Raj, Jats were classified as a “martial race,” favored for recruitment due to perceived bravery and physical fitness, though considered politically subservient and intellectually inferior, lacking leadership qualities. The British preferred recruiting less-educated groups for easier control, viewing educated Indians as less brave. Jats fought in World War I and World War II with the British Indian Army. Post-1881, Sikh Jats were prioritized for recruitment as the British deemed Hindus less suitable. == Notable persons == * Charan Singh, former prime minister of India * Devi Lal, former deputy prime minister of India * Jagdeep Dhankar, current vice president of India * Bhagat Singh, Indian socialist revolutionary * Suraj Mal, Maharaja of Kingdom of Bharatpur * Virendra Sehwag, former Indian cricketer * Dharmendra, Indian actor * Chhotu Ram, Indian politician and co-founder of the Unionist Party * Hanuman Beniwal, founder of the Rashtriya Loktantrik Party ==References== ===Notes=== ===Further reading=== * Census Of India 1911 Volume XIV Punjab Part 2 by Pandit Narikishan Kaul * 'A glossary of the tribes and castes of the Punjab and North West Frontier Province' by H.A. Rose, Page 354, published in 1919. Category:Sikhism Category:Social groups of Haryana Category:Social groups of Punjab Category:Ethnic groups in Pakistan Category:Ethnic groups in India Category:Hinduism Category:Jats",
 "title": "Jat (caste)"
}