{
 "id": "316223",
 "text": ":This article is about the French national capital in general. For the current capital, see Paris. The capital of France is Paris. Paris facts; retrieved 2018-08-05. In the course of history, the national capital has been in many locations other than Paris. ==History== ===List of capitals of France=== *Tournai (before 486) *Soissons (486-ca. 900) *Paris (900-1419) The residence of the kings of France, but they were consecrated at Reims. *Orléans (1108) One of the few consecrations of a French monarch to occur outside of Reims occurred at Orléans, when Louis VI the Fat was consecrated in Orléans Cathedral by Daimbert, archbishop of Sens and from 13 December 1560 to 31 January 1561, the French States-General met here. *Troyes (1419–1422) For a short time during the Hundred Years' War, the town was the seat of the royal government. *Bourges (1422–1444) Charles VII was forced to flee from Paris. *Tours (1444—1527) Louis XI made château de Plessis-lez-Tours his residence. *Paris (1528—1588) Francis I had established his court in Paris *Tours (1589—1594) faction of parliamentarians, faithful to the king was sitting at Tours. *Paris (1594—1661) *Paris (1661-1682) Paris is the official capital, but Louis XIV disputed that Versalles will be the politic centre. *Versailles (1682–1715) In 1682, Louis XIV made Versailles his residence. *Paris (1715–1722) *Versailles (1722–1789) On October 5 and 6, 1789, a throng from Paris invaded the castle and forced the royal family to move back to Paris. The National Constituent Assembly followed the king to Paris soon afterward, and Versailles lost its role of capital city. *Paris (1789–1871) *Versailles (1871–1879) The French Third Republic established Versailles as its seat of government in March 1871 after the Paris Commune took control of Paris. *Paris (1879–1914, 1914-1940) *Bordeaux (September 1914) The French government was relocated from Paris to Bordeaux very briefly during World War I, when it was feared that Paris would soon fall into German hands. These fears were alleviated after the German Army was pushed back at the First Battle of the Marne *Tours (10–13 June 1940) Tours served as the temporary capital of France during the Second World War after the government fled Paris due to the German advance. *Bordeaux (June 1940) The French government was relocated from Paris to Tours then Bordeaux very briefly during World War II, when it became apparent that Paris would soon fall into German hands. *Vichy (1940-1944) The Parliament abolished the French Third Republic here and replaced it with the French State. *Paris (1944–present) With the liberation of Paris in 1944, Charles de Gaulle established the Provisional Government of the French Republic, restoring Paris as the French capital. ==References== Category:History of France",
 "title": "Capital of France"
}