{
 "id": "316351",
 "text": "was an ancient Imperial capital of Japan during the 6th and 7th centuries. It was in Yamato Province, which is present-day Nara Prefecture.Nussbaum, Louis- Frédéric. (2002). \"Asuka\" in Japan Encyclopedia, p. 59. == Imperial Palaces == When Asuka was Japan's capital, new palaces were constructed for each new monarch. Sometimes Imperial palaces were abandoned because of fires or bad omens. According to tradition, Asuka was the site of Chikatsu-Asuka-Yatsuri Palace during the reign of Emperor KenzoKoch, W. (1904). Japan; Geschichte nach japanischen Quellen und ethnographische Skizzen. Mit einem Stammbaum des Kaisers von Japan, p. 13. Imperial capitals in Asuka in 593-640 were: * Toyura Palace (Toyura-no-miya), 593–603Asuka Historical Museum, Palaces of the Asuka Period,\" 1995; retrieved 2011-11-25. * Oharida Palace (Oharida-no-miya), 603–629 * Okamoto Palace (Oakmoto-no-miya), 630–636 * Tanaka Palace (Tanaka- no-miya), 636–639 * Umayasaka Palace (Umayasaka-no-miya), 640 In 640-642, the court briefly moved to Kōryō and the Kudara Palace (Kudara-no-miya); then the court returned to Asuka at the Itabuki Palace (Itabuki no miya), 643–645 In 645-654, the emperor and the government moved to an area within the current city limits of Osaka. This was the Naniwa-Nagara no Toyosaki Palace (Naniwa- Nagara no Toyosaki-no-miya). なにわ活性化プロジェクト (Naniwa Revialization Project), August 24, 201; retrieved 2011-11-24. In Asuka, the Imperial capitals in 655-660 were: * Itabuki Palace, 655–655 * Kawahara Palace (Kawahara-no-miya), 655–655 * Later Okamoto Palace (Nochi no Asuka-Okamoto-no-miya), 656–660 In 660-661, the court removed to Asakura in Fukuoka Prefecture at the Asakura no Tachibana no Hironiwa Palace (Asakure no Tachibana no Hironiwa-no-miya). In 667-672, the emperor moved to the Ōmi Ōtsu Palace (Ōmi Ōtsu-no-miya) in Ōmi- kyō which is today called Ōtsu in Shiga Prefecture.Nussbaum, \"Ōtsu mo Miya\" at p. 216. In Asuka, the Imperial capitals in 672-694 were: * Shima Palace, 672 * Okamoto Palace, 672 * Kiyomihara Palace (Kiomihara-no-miya), 672–694 Asuka was abandoned when Empress Jitō moved the court and the capital to Fujiwara- kyō.Nussbaum, \"Fujiwara\" at pp. 200-201. ==Related pages== * Capital of Japan == References == Category:Former capitals of Japan",
 "title": "Asuka, Yamato"
}