{
 "id": "316303",
 "text": "The Blind men and an elephant is an idiom. The story of the blind men and an elephant comes from India. It is about a range of truths and mistakes. It is also about the need for communication and the need for respect for different perspectives. The idiom shows the effects of observation and bias.Gong, Wenxiang. (1998). Communication and Culture: China and the World Entering the 21st Century, p. 51. Idioms are a common stumbling block for learners of a language. ==Story== A group of blind men (or men in the dark) touch an elephant to learn what it is like. Each one feels a different part, but only one part. For example, one touches only the side and another touches only the tusk. The blind men discover that they disagree when each describes what he has learned from touching the elephant. ==Poem== A famous poem — \"The Blind Men and the Elephant\" by John Godfrey Saxe (1816–1887). The poem begins: > It was six men of Indostan > To learning much inclined, > Who went to see the Elephant > (Though all of them were blind), > That each by observation > Might satisfy his mindSaxe, John Godfrey. (1872). \"The Blind Men and the > Elephant,\" The poems of John Godfrey Saxe, p. 260. They conclude that the elephant is like a wall, snake, spear, tree, fan or rope, depending upon where they touch. None of blind men's description is correct for the whole elephant.Peng, T.C. and Juliana Yuan. (1995). \"Chinese Idioms and Cultural Values,\" Chinese American Forum, Vols. 11-13, p. 32. ==Related pages== * Is the glass half empty or half full? ==References== ==Other websites== * Story of the Blind Men and the Elephant from www.spiritual-education.org * All of Saxe's Poems including original printing of The Blindman and the Elephant * Buddhist Version as found in Jainism and Buddhism. Udana hosted by the University of Princeton * Jalal ad-Din Muhammad Rumi's version as translated by A.J. Arberry * Jainist Version hosted by Jainworld * John Godfrey Saxe's version hosted at Rice University Category:Idioms Category:Elephants Category:Fables Category:Parables Category:Epistemology Category:Oral tradition",
 "title": "Blind men and an elephant"
}