{
 "id": "316328",
 "text": "The Azerbaijani National Guard () is a paramilitary force in Azerbaijan. The Internal Troops is under the authority of the Government of Azerbaijan and operates as a semi-independent entity.Heydar Aliyev's Heritage International Online Library: Speech by President of the Republic of Azerbaijan, Heydar Aliyev, the High Chief in a ceremony marking the 5th anniversary of the founding of the National Guard - National Guard headquarters in Azerbaijan, 25 December 1996 The Azerbaijani National Guard was definitely active in December 1996 but has been united into the Special State Protection Service.http://www.axisglobe.com/news.asp?news=13236 The guard was established on the December 25, 1991. The Special State Protection Service (SSPS) of Azerbaijan is a military unit directly under the authority of the President of Azerbaijan. Its responsibilities include the protection of the President of Azerbaijan, the protection of the National Assembly of Azerbaijan (Parliament), the Cabinet of Ministers of Azerbaijan, the Ministry of Foreign Affairs of Azerbaijan, the Constitutional Court, the Central Election Commission and other public bodies as well as the protection of important foreign leaders visiting Azerbaijan. One of the most important tasks of the SPSS is the safety of the Baku-Tbilisi-Ceyhan petroleum and natural gas pipeline and the South Caucasus petroleum pipeline. NATO is supporting the service with several helicopters and military vehicles in order to protect the pipelines. During wartime, the Azerbaijani National Guard operates together with the Azerbaijani Land Forces, and can be involved in local defense and security of the country, along with the army.Azərbaycan Respublikası Milli Qvardiyasının yaranmasının 5-ci ildönümü Milli Qvardiyanın 10 yaşı tamam oldu Other law enforcement bodies in Azerbaijan include the Internal Troops of Azerbaijan and the State Border Service of Azerbaijan and its Coast Guard branch. ==Related pages== *Military history of Azerbaijan *Azerbaijani Armed Forces *Azerbaijani Land Force *Azerbaijani Air Force *Azerbaijani Navy *Internal Troops of Azerbaijan *State Border Service of Azerbaijan ==References== Internal Troops of Azerbaijan National Guard Category:Government agencies of Azerbaijan",
 "title": "Azerbaijani National Guard"
}