{
 "id": "316397",
 "text": "The Russian Ground Forces (), also known as the Russian Army (, ), are the land forces of the Russian Armed Forces. The main responsibilities of the Russian Ground Forces are the protection of Russia's borders, combat on land, and the defeat of enemy troops. The President of Russia is the Supreme Commander-in-Chief of the Armed Forces of the Russian Federation. The Main Command of the Ground Forces is based in Moscow. == History == As the Soviet Union dissolved, Soviet officials tried to keep the Soviet Armed Forces as a single military for the new Commonwealth of Independent States. The last Minister of Defence of the Soviet Union, Marshal Yevgeny Shaposhnikov, was made supreme commander of the CIS Armed Forces in December 1991. Once it became clear that Ukraine (and possibly the other republics) was going to form their own armed forces, the new Russian government moved to form its own armed forces. Russian President Boris Yeltsin signed a decree creating the Russian Ministry of Defence on 7 May 1992. This created the Russian Ground Forces and the other branches of the military. === Post-Soviet reform plans === The Ministry of Defence newspaper Krasnaya Zvezda published a reform plan on 21 July 1992. The General Staff turned further towards conservatism. This caused a lot of problems. The reform plan wanted a change from an Army-Division- Regiment structure to a Corps-Brigade structure. They wanted the new structures to be better in a situation with no front line. Few of the reforms planned in the early 1990s actually happened. This was for three reasons: Firstly, there was not enough help or support from the government, with President Yeltsin mainly interested in making sure that the Armed Forces were controllable and loyal, rather than reformed. Secondly, there was not enough funding. Finally, there was no consensus in the military about what reforms should happen. === Crime and corruption in the ground forces === The new Russian Ground Forces also got a growing crime problem from their Soviet predecessors. As draft resistance grew in the last years of the Soviet Union, the authorities put people with criminal records and who spoke little or no Russian in the army. Crime rates grew quickly.Odom (1998), p. 302 Weapons disappeared or were stolen more as well. In March 2011, Military Prosecutor General Sergei Fridinsky reported that crimes had been rising in the Russian Ground Forces for the past 18 months, with 500 crimes reported in the period of January to March 2011 alone.\"No solution to hideous army hazing in Russia\", Pravda (25 March 2011) In August 2012, Prosecutor General Fridinsky again said that there was a rise in crime. Murders rose by more than half, bribery cases doubled, and drug trafficking rose by 25% in the first six months of 2012 compared to the same period in 2011. The Union of the Committees of Soldiers' Mothers of Russia said the state of the Russian army was a \"crime against humanity\".\"Crime reportedly flourishes in Russian army\", Deutsche Welle (18 August 2012) In July 2013, the Prosecutor General's office showed that corruption in 2013 rose 450% compared to 2012. This corruption cost the Russian government 4.4 billion rubles (US$130 million).\"Corruption Up 450% in a Year in Russian Military – Prosecutors \", RIA Novosti (11 July 2013) === Chechen Wars === ==== First Chechen War ==== With the dissolution of the Soviet Union, the Chechens declared independence in November 1991. They declared independence under the leadership of a former Air Forces officer, General Dzhokar Dudayev. Chechen independence was seen as lowering Moscow's authority. Chechnya was seen as a haven for criminals. Soon a group within the Kremlin wanted war. A Security Council meeting was held 29 November 1994 on the issue. Yeltsin ordered the Chechens to disarm, or else Moscow would invade. Defense Minister Pavel Grachev told Yeltsin that he would \"take Grozny with one airborne assault regiment in two hours.\" [citing ] The operation started on 11 December 1994 and, by 31 December, Russian forces were entering Grozny, the Chechen capital. The 131st Motor Rifle Brigade was told to make a push for the centre of the city. However, it was almost fully destroyed in Chechen ambushes. After finally taking Grozny, Russian troops moved on to other Chechen strongholds. Chechen militants took hostages in the Budyonnovsk hospital hostage crisis in Stavropol Krai in June 1995. This caused hope for peace. However, the fighting continued. After this incident, the Chechen separatists were called insurgents or terrorists in Russia. Dzhokar Dudayev was assassinated in a Russian airstrike on 21 April 1996. In that summer, a Chechen attack retook Grozny. Secretary of the Security Council Alexander Lebed began talks with the Chechen rebel leader Aslan Maskhadov in August 1996 and signed an agreement on 22/23 August. The agreement was that by the end of that month, the fighting would end. The ceasefire was signed in the Dagestani town of Khasavyurt on 31 August 1996. ==== Second Chechen War ==== The Second Chechen War started in August 1999 after Chechen militias invaded Dagestan. After this was a series of four terrorist bombings across Russia. This caused Russian military action against the alleged Chechen culprits. In the First Chechen War, the Russians bombarded an area with artillery and airstrikes before moving the land forces. Improvements were made in the Ground Forces between 1996 and 1999 and its performance during the Second Chechen War improved because of this.Orr (2000), pp. 88–90 The war started to slow down, however. Small-scale conflict continued to happen. As of November 2007, fighting had spread across other parts of the Russian Caucasus. The Second Chechen War officially ended on 16 April 2009. === Russo-Ukrainian War === Russia started putting many troops on the Ukrainian border starting in late 2021. On February 24, 2022, Russian troops began invading Ukraine. During this invasion, Russia lost many tanks to Ukrainian anti-tank systems. As of 6 May, at least 12 generals have been killed in Ukraine. == Equipment == The Russian Ground Forces has lots of vehicles and equipment.IISS 2006, p. 155 A lot of these are older Soviet designs. New equipment, like the Armata Universal Combat Platform, Bumerang, and Kurganets-25, has been brought in since 2015. They have begun replacing old tanks and armored vehicles such as the BMPs, BTRs like the T-72, T-90, BMP-1/2/3, and BTR-80s. === Equipment summary === Figures listed as \"Active\" only include equipment that is in active service. Type Active Reserve Main battle tanks 2,800 ≈16,500T-72 , warfare.ru – Russian Military Analysis. Retrieved on 8 January 2014.T-80 , warfare.ru – Russian Military Analysis. Retrieved on 8 January 2014. Infantry fighting vehicles 5,160 ≈19,500 Armoured personnel carriers 6,100 ≈18,000+ Towed artillery 150 ≈12,415 Self-propelled artillery 1,610 ≈4,260 Rocket artillery 1,352Multiple Rocket Launchers database , warfare.ru – Russian Military Analysis. Retrieved on 2 January 2013. SAM systems 2,531SAM systems , warfare.ru – Russian Military Analysis. Retrieved on 2 January 2013. == Ranks and insignia == The Russian Army kept most of the ranks of the Soviet Army, with some small changes. == References == == Bibliography == * * * * * * * * * * * * * * * * * * * * * * * * * * * * Scott, Harriet Fast & Scott, William F. Russian Military Directories 2002 & 2004 * * Category:Russian military organizations",
 "title": "Russian Ground Forces"
}