{
 "id": "316427",
 "text": "Many Chinese dynasties have ruled the country during its history. China is a society which has had a very long history. This history was affected by the dynasties which have ruled it. They have slowly changed China into its current form. ==Dynasties== Dynasty Rulers Ruling House or Clan Years Name Chinese Pinyin Meaning Three Sovereigns and the Five Emperors Sān Huáng Wǔ Dì As English (list) various 2852-2070 BC 782 Xia Dynasty Xià Summer (list) Sì (姒) 2070–1600 BC 470 Shang Dynasty Shāng Toponym (list) Zǐ (子) 1600–1029 BC 571 Western Zhou Dynasty Xī Zhōu Toponym (list) Jī (姬) 1029–771 BC 275 Eastern Zhou Dynasty Traditionally divided into Spring and Autumn Period Warring States Period Dōng Zhōu Chūnqiū Zhànguó Toponym \"Histories\" (literally \"Spring and Autumns\") \"Warring States\" (list) (list) (list) Jī (姬) various 770–256 BC 722–476 BC 475–221 BC 514 246 254 Qin Dynasty Qín Unknown, Possibly Toponym (list) Yíng (嬴) 221–206 BC 15 Western Han Dynasty Xī Hàn Toponym (list) Liú (劉 / 刘) 206 or 202 BC–9 AD, 23-25 AD 215 Xin Dynasty Xīn \"New\" (list) Wáng (王) 9–23 AD 14 Eastern Han Dynasty Dōng Hàn Toponym (list) Liú (劉 / 刘) 25–220 195 Three Kingdoms Sān Guó As English (list) Cáo (曹) Liú (劉 / 刘) Sūn (孫 / 孙) 220–265 or 280 45 Western Jin Dynasty Xī Jìn Ducal title (list) Sīmǎ (司馬 / 司马) 265–317 52 Eastern Jin Dynasty Dōng Jìn Ducal title (list) Sīmǎ (司馬 / 司马) 317–420 103 Southern and Northern Dynasties Nán Běi Cháo As English (list) various 386 or 420–589 169 Sui Dynasty Suí Ducal title (随 homophone) (list) Yáng (楊 / 杨) 581–618 37 Tang Dynasty Táng Ducal title (list) Lǐ (李) 618–907 289 Five Dynasties and Ten Kingdoms Wǔ Dài Shí Guó As English (list) various 907–960 53 Kingdom of Dali Dàlǐ Guó Toponym (list) Duan (段) 937–1253 316 Northern Song Dynasty Běi Sòng Toponym (list) Zhào (趙 / 赵) 960–1127 167 Southern Song Dynasty Nán Sòng Toponym (list) Zhào (趙 / 赵) 1127–1279 152 Liao Dynasty Liáo \"Vast\" or \"Iron\" (Khitan homophone) (list) Yelü (; 耶律) 907 or 916–1125 209 Jin Dynasty Jīn \"Gold\" (list) Wanggiyan (; 完顏 / 完颜) 1115–1234 119 Western Xia Xī Xià Toponym (list) Li (; 李) 1038–1227 189 Yuan Dynasty Yuán \"Great\" or \"Primacy\" (list) Borjigin (; 孛兒只斤 / 孛儿只斤) 1271–1368 97 Ming Dynasty Míng \"Bright\" (list) Zhū (朱) 1368–1644 or 1662 276 Qing Dynasty Qīng \"Pure\" or \"Gold\" (Manchu homophone) (list) Aisin Gioro ( }; 愛新覺羅 / 爱新觉罗) 1636 or 1644–1911 268 ==Xia dynasty== The Xia dynasty lasted from 2070 BC until 1600 BC. It was the first ruling dynasty in Chinese history. The Xia was probably created by emperor Yu the Great. It is not known for certain if the Xia dynasty actually existed. Many people think that the Xia dynasty is only a legend. This is because there is no evidence that can prove that there was some dynasty before 1600 BC. There were found some archaeological excavations from 1500 BC which may come from the Xia dynasty. For example one of the excavations causes archaeologists to believe that the foundations of China were created during the Xia dynasty. Also there are findings of the oldest Chinese calendar called a lunar calendar. Xia dynasty was ended by a dynasty named Shang. ==Shang dynasty== The Shang dynasty lasted from 1600 BC until 1046 BC. It started when Tang took control from the last Xia emperor, Jie. The dynasty ended with the suicide of Di Xin. The Shang dynasty was important for Chinese culture. The first Chinese character fonts were created at this time. They were mainly used by seers and shaman. People made their own ritual vessels, agricultural and craft tools and even weapons. Everything was made of cast bronze. In agriculture, millets, wheats and rice were the main crops. Mulberries were also grown. They were used to feed mulberry silkworms. ==Zhou dynasty== The Zhou dynasty lasted from 1045 BC until 256 BC. The Shangs had became weak because they were always fighting with a neighboring tribes. This was good for the less advanced Zhou. They defeat the Shang in the current town of An-yang. After that, the Zhou dynasty took the government. They ruled for the longest time of all Chinese dynasties. Zhous were nomadic shepherds from the Shanxi province. The rulers of Zhou dynasty divided the country into four smaller areas. Each of these areas were controlled by relatives and members of aristocracy. Princes controlled fortified towns with a peasant background. They also helped the rulers at times of war. This form of government allowed the Zhou rulers to control more area. ==Notes== ==References== *China Handbook Editorial Committee, China Handbook Series: History (trans., Dun J. Li), Beijing, 1982, 188-89; and Shao Chang Lee, \"China Cultural Development\" (wall chart), East Lansing, 1984. ==Other websites== * Columbia University. Dynasties song sung to the tune of \"Frère Jacques\" that repeats the major Chinese dynasties in chronological order. * Category:History-related lists Category:History of East Asia Category:History of Central Asia Category:History of China Category:Empires in Asia",
 "title": "Dynasties in Chinese history"
}