{
 "id": "316594",
 "text": "Ultima Online is an fantasy-themed MMORPG (massively multiplayer online role- playing game) played all around the world. Game servers are called shards. The game was launched in 1997 by Origin Systems. Nowadays it is owned by Electronic Arts. Like in other games, play is mostly about getting the best character. == Game play == The game continues with game mechanisms from the original single player game Ultima. It was designed as a kind of social and economic experiment. === Skills === Skill are measured in percent. The game has about 50 kinds of them. Magery, Necromancy, Alchemy, Mining... The highest amount of skill is 100%, but with special items it can be raised to 120%. === Statistics === Basic player statistics are strength, intelligence and dexterity. === Craft system === Ultima Online has a huge craft system. Players can make various things from weapons to whole ships. == Datadiscs == * Ultima Online: Second Age (1998) * Ultima Online: Renaissance (2000) – world split into two copies, Felucca and Trammel * Ultima Online: Third Dawn (2001) * Ultima Online: Lord Blackthorn's Revenge (2002) * Ultima Online: Age of Shadows (2003) * Ultima Online: Samurai Empire (2004) – samurai theme * Ultima Online: Mondain's Legacy (2005) – new race Elves * Ultima Online: Kingdom Reborn (2007) * Ultima Online: Stygian Abyss (2009) – new race Gargoyles Datadiscs mostly add new monsters, items and maps. == OSI shards == OSI (Origin Systems Inc., now part of EA) is the name for official servers (shards). These servers have run more than 10 years. * Pacific * Atlantic * Great Lakes == Shard emulation == Ultima Online files can be easily modified. This ability gives a free hand to many projects. To run your shard, you need a server emulator. The EA games tolerates other projects. * RunUO * Sphere * POL == Curiosities == * Since the Renaissance, the world is split into two copies, Felucca and Trammel. The Trammel world did not allow player vs. player and was focused on fighting with monsters. The Felucca world allows player vs. player, and that makes the world darker. * The game client use images only, there aren't any 3D models. For example, each character has about 500 images. * Each character has graphics only in four directions. Another four are gotten by mirroring. * Graphic and other files can be easily edited. This ability is an advantage for non-official projects. == System requirements == * Windows 95 and newer * 32 MB of RAM memory * DirectX 5 or higher * internet connection 32kbit/s or greater == References == *http://www.uo.com *http://www.gamesites200.com/ultimaonline/ *http://www.runuo.com *http://uo2.stratics.com/ Category:1997 video games Category:Electronic Arts video games Category:Linux games Category:Massively multiplayer online role- playing games Category:Video games developed in the United States Category:Windows games",
 "title": "Ultima Online"
}