{
 "id": "316676",
 "text": "Australasia at the Olympics is a history which includes 2 games in 2 countries and 53 athletes.SportsReference.com (SR/Olympics), \"Australasia\" ; retrieved 2012-7-27. Since 1908, Australasia (ANZ) has contributed to the growth of the \"Olympic Movement\". Olympics.org, \"Factsheet: The Olympic Movement\"; retrieved 2012-7-27. ==History== Australasia's team first competed at the 1908 Summer Olympics in London. Australasia was the name of a combined team of athletes from Australia and New Zealand. They competed together at the 1908 and 1912 Summer Olympics. When the Olympic Games started up again in 1920 after World War I, the two countries sent separate teams to the Games. ==Medalists== The Australasia team won a total of twelve medals in the two games in which they competed. Most of these were in swimming. One New Zealander won a medal in 1908. Harry Kerr won a bronze in athletics. In 1912, two New Zealanders won medals. Malcolm Champion won a gold in swimming. Tony Wilding won a bronze in tennis. All other medalists for Australasia were Australians. Medal Name Games Sport Event Australia national team 1908 London Rugby union Men's competition 1908 London Boxing Men's middleweight 1908 London Swimming Men's 400 m freestyle 1908 London Athletics Men's 3500 m walk 1908 London Swimming Men's 1500 m freestyle 1912 Stockholm Swimming Women's 100 m freestyle Malcolm Champion Leslie Boardman Harold Hardwick 1912 Stockholm Swimming Men's 4×200 m freestyle relay 1912 Stockholm Swimming Men's 100 m freestyle 1912 Stockholm Swimming Women's 100 m freestyle 1912 Stockholm Swimming Men's 1500 m freestyle 1912 Stockholm Swimming Men's 400 m freestyle 1912 Stockholm Tennis Men's indoor singles ==Medals by Games== Games Gold Silver Bronze Total 1908 London 1 2 2 5 1912 Stockholm 2 2 3 7 Total 3 4 5 12 ==Medals by sport== Sport Gold Silver Bronze Total Swimming 2 3 3 8 Rugby 1 0 0 1 Boxing 0 1 0 1 Athletics 0 0 1 1 Tennis 0 0 1 1 Total 3 4 5 12 ==Related pages== * List of IOC country codes ==References== ==Other websites== * Olympic Medal Winners at Olympic.org *Australasia (until 1920) at DatabaseOlympics.com Category:Former nations at the Olympics Category:Australia at multi-sport events Category:Sport in New Zealand",
 "title": "Australasia at the Olympics"
}