{
 "id": "316607",
 "text": "The Azerbaijan Democratic Republic (ADR) also known as Azerbaijan People's Republic was the first successful attempt to create a democratic and secular republic in the Muslim world before the Republic of Turkey.Tadeusz Swietochowski. Russia and Azerbaijan: A Borderland in Transition. Columbia University Press, 1995. , 9780231070683 and Reinhard Schulze. A Modern History of the Islamic World. I.B.Tauris, 2000. , 9781860648229. Citations are at Talk:Azerbaijan Democratic Republic#First or second. It was founded on May 28, 1918 after the collapse of the Russian Empire that began with the Russian Revolution of 1917 by the Azerbaijani National Council in Tiflis, Georgia. Its borders were with Russia in the north, Democratic Republic of Georgia in the north-west, Democratic Republic of Armenia in the west, and Persian Empire (Iran) in the south. It had a population of 2.86 million.Tadeusz Swietochowski. Russian Azerbaijan, 1905-1920: The Shaping of a National Identity in a Muslim Community. Cambridge University Press, 2004, p. 129. Ganja was the temporary capital of the Republic as Baku, which is the de jure capital, was under Bolshevik control. Under the ADR, the government was a parliamentary system in which a parliament, called the Milli Majlis (National Assembly of Azerbaijan) elected on the basis of universal, free, and proportional representation, was the highest political institution of state authority and the Council of Ministers was responsible before it. Fatali Khan Khoyski became its first prime minister. Besides the political party Musavat which had the majority in parliament, other political parties were Ehrar, Ittihad, Muslim Social-democrats as well as representatives of Armenian (21 out of 120 seats), Russian, Polish, Jewish and German minorities gained seats in the parliament. Some members supported Pan-Islamist and Pan-Turkist ideologies.Musavat Party (Azerbaijan) Pan-Turkism: From Irrendentism to Coopersation by Jacob M. Landau P.55 On the Religious Frontier: Tsarist Russia and Islam in the Caucasus by Firouzeh Mostashari P. 144 Ethnic Nationalism and the Fall of Empires by Aviel Roshwald, page 100 Disaster and Development: The politics of Humanitarian Aid by Neil Middleton and Phil O'keefe P. 132 The Armenian-Azerbaijan Conflict: Causes and Implications by Michael P. Croissant P. 14 Among the important accomplishments of the parliament was to give women the right to vote, making Azerbaijan the first Muslim nation to give women equal political rights with men. Azerbaijan made these reforms earlier than the United Kingdom and the United States. Another important accomplishment of ADR was the establishment of Baku State University, which was the first modern-type university founded in Azerbaijan. ==End of the Democratic Republic of Azerbaijan, 1920== By March 1920, it became clear that Soviet Russia would attack and invade Azerbaijan. The Soviet Bolshevik leader Vladimir Lenin said that the invasion was justified by the fact that Soviet Russia could not survive without the Baku oil fields, which was at that time the largest oil field in the world with more than half of the world's oil reserves.Lenin and Caucasus oil on GlobalRus.ru Deliveries of Baku oil to Russia in April-May 1920 \"History of the City of Baku\" According to the common opinion in Moscow, Russian Bolsheviks were to \"help\" the Baku proletariat (workers) in overthrowing the \"counter-revolutionary nationalists\", meaning the government and the Azerbaijan Democratic Republic. After a major political crisis, the Fifth Cabinet of Ministers of the Azerbaijan Democratic Republic resigned on April 1, 1920. On April 25, 1920, the Soviet Russian 11th Red Army crossed into Azerbaijan, entering Baku on April 27. They demanded the closing of the Azerbaijani parliament and set up their own Bolshevik government headed by Nariman Narimanov. To avoid bloodshed, the members of parliament had to agree with the demand and the ADR officially ended on April 28, 1920, giving way to the Azerbaijan Soviet Socialist Republic as its successor state. The Red Army met very little resistance in Baku from the Azerbaijani army, which was tied up on the Karabakh front. The first Communist government of Azerbaijan consisted almost entirely of native Azerbaijanis from the left-wing political factions of the Hummat and Adalat political parties.Richard Pipes. The Formation of the Soviet Union: Communism and Nationalism 1917-1923, pp 218-220, 229 (Cambridge, Massachusetts, 1997). In May 1920, there was a major rebellion against the occupying Soviet Russian 11th Red Army in Ganja. People wanted to restore the Musavatists to power. The rebellion was crushed by government troops by May 31. Leaders of the ADR either fled to the Democratic Republic of Georgia, which was the last independent Caucasian country that was invaded in 1921 by Soviet Russia, then to Turkey and Iran, or were captured by Bolsheviks, like Mammed Amin Rasulzade, who was later allowed to emigrate, or were executed (killed) like Gen. Selimov, Gen. Sulkevich, Gen. Agalarov, a total of over 20 generals,List of Azerbaijani Generals and Admirals, Military Leaders and Heroes, May 2006 or assassinated by Armenian terrorists like Fatali Khan Khoyski and Behbudagha Javanshir.\"The Fate of some of the ADR Parliament Members\", Azerbaijan International (7.3) Autumn 1999 Most students and citizens travelling abroad remained in those countries, never to return again to their country. Other important ADR military leaders like the former Minister of Defense General Samedbey Mehmandarov and deputy defense minister General Ali-Agha Shikhlinski (who was called \"the God of Artillery\" ) were at first arrested, but released two months later thanks to efforts of Nariman Narimanov. Gen. Mehmandarov and Gen. Shikhlinsky spent their last years teaching in the Azerbaijan SSR military school. In the end, \"the Azeris did not surrender their brief independence of 1918-20 quickly or easily. As many as 20,000 died resisting what was effectively a Russian reconquest.\" Hugh Pope, \"Sons of the conquerors: the rise of the Turkic world\", New York: The Overlook Press, 2006, p. 116, However, the founding of the Azerbaijan Soviet Socialist Republic was made easier by the fact that there was a certain popular support for Bolshevik ideology in Azerbaijan, among the industrial workers in Baku.Svante Cornell. \"Undeclared War-The Nagorno-Karabakh Conflict Reconsidered\", Journal of South Asian and Middle Eastern Studies, vol. 20, no. 4, Fall 1997 ==Related pages== * Azerbaijan * Azerbaijan Soviet Socialist Republic == References == Category:20th century in Azerbaijan Category:Political history of Azerbaijan Category:Modern history of Azerbaijan Category:Azerbaijani republics Category:1918 establishments Category:1920 disestablishments Category:Former countries in Asia",
 "title": "Azerbaijan Democratic Republic"
}