{
 "id": "316715",
 "text": "ChuvashTet (short for \"Chuvash Internet\"), () is the name Chuvash-speaking Internet users commonly use for the segment of the Web about the Chuvash people or Chuvashia. It includes webpages and websites in many languages. Chuvash Internet users employ Latin and Cyrillic scripts. == Literature == * Алексеев И. В. Выбор символов для букв чувашского алфавита при размещении информации на веб-сайтах // Аспекты филологических, педагогических, журналистских исследований: Межвузовский сборник научных трудов. — Cheboksary: Новое время, 2009. — С. 244—250. * Алексеев И. В., Дегтярёв Г. А. К вопросу о создании компьютерной терминологии на чувашском языке // Чувашский язык из глубины веков в будущее / Науч. ред. и сост. Г. А. Дегтярёв. — Cheboksary: Чуваш. гос. ин-т гуманит. наук, 2007. — С. 100—103. * Андреев В. Ю. О поисковых системах Интернета // Чувашский язык и современные проблемы алтаистики: Сборник материалов Международной научной конференции «Чувашский язык и современные проблемы алтаистики». В 2-х ч. — Ч. I. — Cheboksary: Чуваш. гос. ин-т гуманит. наук, 2009. — С. 77-80. * Дегтярёв Г. А. Компьютерти чăваш чĕлхи: терминологие йĕркелес ыйтусем // Вестник Чебоксарского филиала Московского государственного гуманитарного университета имени М. А. Шолохова. № 6. — Moscow — Cheboksary, 2009. — С. 258—267. * Дегтярёва И. В. Чĕлхĕ урокĕсенче Интернет пурлăхĕпе усă курасси // Ашмаринские чтения — 6: Материалы Всероссийской научной конференции. — Cheboksary: Чуваш. гос. ин-т гуманит. наук, 2008. — С. 375—380. == Related pages == * TatNet * Chuvash Wikipedia == Other websites == * Дегтярёва И. В. Интернет чăвашла вĕрентет // Халăх шкулĕ. — Вып. 4 (97), 2008. С. 30-31. * Матвеев И. Чăваш интернечĕ: малашлăха пĕрле утар // Сувар, 2006, Jan. 27. * Яковлев В. Интернетри «Чăваштет» — чăваш этносфери // Хыпар, 2006, June. 28. * Каталог сайтов Чувашского Интернета на Chuvash.ru * Каталог сайтов Чувашского Интернета на Chuvash.net * Chuvash people site; * Official site of the Chuvash Republic . Category:Russian websites Category:Chuvash Republic",
 "title": "ChuvashTet"
}