{
 "id": "316844",
 "text": "Aspens are a type of poplar tree with leaves that move with the slightest wind. Both of its main species are called \"trembling aspens\" or \"quaking aspens\" on account of their leaves. Some, but not all, aspens are classified by botanists under the section Populus. == Species with the name \"aspen\" == These species are called aspens: * Populus adenopoda – Chinese aspen (China, south of P. tremula) * Populus davidiana – Korean aspen (Eastern Asia) * Populus grandidentata – Bigtooth aspen (eastern North America, south of P. tremuloides) * Populus sieboldii – Japanese aspen (Japan) * Populus tremula – Eurasian aspen (northern Europe and Asia) * Populus tremuloides – Quaking aspen or trembling aspen (northern and western North America) == Some types of aspens == === American aspen === Populus tremuloides is the American aspen. It is common in temperate and colder regions of North America. It forms large stands (groups) of genetically-identical trees (clones) connected by a single underground root system. Such trees form through root sprouts coming off an original parent tree. The largest-known fullyconnected aspen is a grove in Utah, nicknamed \"Pando\", and some experts call it the largest organism in the world, by mass or volume.Quaking Aspen by the Bryce Canyon National Park Service It covers 0.43 km2 (106 acres) and is estimated to weigh .Ontario Science Centre: Largest living thing === European aspen === Populus tremula is a species of poplar that is native to the cool amd temperate regions of Europe and Asia from the British IslesJames Kilkelly Irish native Aspen tree to the Kamchatka Peninsula, and from the Arctic Circle in Scandinavia and northern Russia to central Spain, Turkey, the Tian Shan Mountains, North Korea, and northern Japan. It also occurs at one site in northwesten Africa, in Algeria. In the south of its range, it occurs at high altitudes in mountains.Rushforth K. 1999. Trees of Britain and Europe. Collins . It is a hardy species and tolerates long, cold winters and short summers. Aspen is dioecious and so individual trees are either male or female (most other trees are monoecious and so have male and female flowers occur on the same tree). Flowering occurs in March and April, before the leaves appear, and both male and female trees produce catkins. Pollinated female catkins ripen in early summer and release tiny seeds, which are tufted with hairs. Like other aspens, it has as its main method of reproduction is vegetative (asexual). It spreads extensively by root sprouts, which may be produced up to 40 m from the parent tree. They form extensive clonal colonies.Trees for Life species profile: Aspen Large numbers of new shoots can be produced in this way, especially after a major disturbance such as fire. == References == == Other websites == * Bioimages: Populus grandidentata bigtooth aspen Category:Trees Category:Malpighiales",
 "title": "Aspen"
}