{
 "id": "316807",
 "text": "JLS (short for Jack the Lad Swing) are an English boy band, which consists of members Aston Merrygold, Oritsé Williams, Marvin Humes, and JB Gill, originally formed by Williams. They initially signed to Tracklacers production company New Track City and then went on to become runners-up of the fifth series of the ITV reality talent show The X Factor in 2008, coming second to Alexandra Burke. During their initial stint as as boy band, they have sold over 3 million records worldwide. They were runners-up in the 2008 UK series of The X Factor. JLS signed a record deal with Epic records in 2009. Their debut album peaked at number-one on the UK Albums Chart and sold more than 1 million copies. ==Awards and nominations== Year Ceremony Category Nominated work Result Ref 2007 Urban Music Awards Best Unsigned Act 2009 2009 BRIT Awards Best British Single \"Hero\" (with The X Factor finalists) MOBO Awards Best UK Newcomer Best UK Newcomer MOBO 2009 Nomimation Best Song \"Beat Again\" Best Song MOBO 2009 Nomination BBC Switch Live Awards Switch's Outstanding Artist Prom King Aston Merrygold Virgin Media Music Awards Best Group Best Newcomer Best Track \"Beat Again\" Hottest Male Aston Merrygold 2010 2010 BRIT Awards British Group British Breakthrough Lady Gaga, jay-Z, Lily Allen Win 2010 Brit Pop Music Awards Bloomberg.com British Single \"Beat Again\" Shockwave NME Awards Worst Band BT Digital Music Awards Best Group Best Video \"Everybody In Love\" MOBO Awards Best UK Act Best Album Urban Music Awards Best R&B; Act Urban Music Awards 2006 Best Group 2011 BT Digital Music Awards Best Group Best Video \"Eyes Wide Shut\" Best Fansite \"Eyes Wide Shut\" ==Discography== * JLS (2009) * Outta This World (2010) * Jukebox (2011) == References == == Other websites == * * Category:2013 disestablishments in the United Kingdom Category:2000s British music groups Category:2006 establishments in England Category:2010s British music groups Category:Black British people Category:English boy bands Category:English R&B; bands Category:English pop music groups Category:English hip hop bands Category:Musical groups disestablished in 2013 Category:Musical groups established in 2006 Category:Musical groups from London Category:The X Factor contestants",
 "title": "JLS"
}