{
 "id": "316990",
 "text": "Edward Durell Stone (March 9, 1902 – August 6, 1978) was an American architect. He is most known for designing buildings with modernist style between 1950-1960s. ==Notable projects== *Radio City Music Hall and the Center Theater, in Rockefeller Center, New York City, (He was senior designer working for the Rockefeller Center Associated Architects with Donald Deskey and Eugene Schoen, interior designers, 1932) *Richard H. Mandel House, Bedford Hills, New York (with Donald Deskey, interior designer, 1933) *Mepkin Plantation for Mr. and Mrs. Henry R. Luce, (now known as Mepkin Abbey), Monck's Corner, South Carolina (1936) *Museum of Modern Art, New York City, (with Philip S. Goodwin, 1937) *A. Conger Goodyear House, Old Westbury, New York (1938) *Ingersoll Steel, Utility Unit House, Kalamazoo, Michigan (1946) *El Panama Hotel, Panama City, Panama (1946) *Fine Arts Center, University of Arkansas, Fayetteville, Arkansas (1948) *United States Embassy, New Delhi, India (1954) *Phoenicia Hotel, Beirut, Lebanon (1954, changed in 1997) *Stanford Medical Center, Palo Alto, California (1955) *Bruno & Josephine Graf Residence, Dallas, Texas (1956) *Main Library and Mitchell Park Branch Library, Palo Alto, California (1956) The Mitchell Park Branch was torn down (demolished) in 2010. *Edward Durell Stone Townhouse, 130 East 64th Street, New York City (1956) *Stuart Pharmaceutical Co., Pasadena, California (1956, partially demolished) *U.S. Pavilion at the Expo 58, Brussels, Belgium (1957, partially demolished) *First Unitarian Society Church, Schenectady, New York (1958) *Gallery of Modern Art, including the Huntington Hartford Collection (now known as Museum of Arts & Design), New York City (1958. The building was changed a lot in 2006) *International Trade Mart (now known as World Trade Center of New Orleans), New Orleans, Louisiana (1959) *Robert M. Hughes Memorial Library, Norfolk, Virginia (1959) *Harvey Mudd College, Claremont, California (1959) *North Carolina State Legislative Building, Raleigh, North Carolina (1960) *Beckman Auditorium, California Institute of Technology, Pasadena, California (1960) *National Geographic Society Building, Washington, D.C. (1961) *Ponce Museum of Art, Ponce, Puerto Rico (1961) *Windham College (now known as Landmark College), Putney, Vermont (1961) *State University of New York at Albany, Albany, New York (1962) *John F. Kennedy Center for the Performing Arts, Washington, D.C. (1962) *Prince George's Center (now known as University Town Center), Hyattsville, Maryland (1962) *Busch Memorial Stadium, St. Louis, Missouri (1962, demolished 2005) *WAPDA House {Water and Power Development Authority}, Lahore, Pakistan (1962) *Stuhr Museum of the Prairie Pioneer, Grand Island, Nebraska (1963) *Claremont School of Theology, Claremont, California (1963) *Davenport Public Library, Davenport, Iowa(1964) *General Motors Building, New York City (1964) *Von KleinSmid Center, University of Southern California, Los Angeles, California (c. 1965) *Garden State Arts Center (now known as PNC Bank Arts Center), Holmdel, New Jersey (1965) *Pakistan Institute of Nuclear Science and Technology, (1965) *Georgetown University Law Center Bernard P. McDonough Hall, Washington, D.C. (1966) *W.E.B. DuBois Library, University of Massachusetts, Amherst, Massachusetts (1966) *Fort Worth City Hall, Fort Worth, Texas (1967) *PepsiCo World Headquarters Complex, Purchase, New York (1967) *Jefferson County Civic Center, Pine Bluff, Arkansas (1968) *Worcester Science Museum (now known as the EcoTarium), Worcester, Massachusetts, (1964, changed in 1998) *Standard Oil Building (now known as Aon Center), Chicago, Illinois (1972) *Scripps Green Hospital, La Jolla, California (1974) *First Bank Building (now known as First Canadian Place), Toronto, Ontario (1975) *Babin Kuk Resort, Dubrovnik, Croatia (1976) *Valamar Dubrovnik President Hotel, Dubrovnik, Croatia (by Edward Durell Stone Associates, 1976) *Florida State Capitol, Tallahassee, Florida (1977) *University of Alabama School of Law, Tuscaloosa, Alabama (1977) *Museum of Anthropology, Xalapa, Veracruz, Mexico (by Edward Durell Stone Associates, 1986) ==Gallery== Image:Stanford Medical School.JPG |Stanford U. Medical Center Palo Alto, California (1955) Image:Stuart Atrium.JPG|Atrium Stuart Pharmaceutical Co. Pasadena, California (1956) Image:Stone Townhouse.JPG|Edward Durell Stone Townhouse New York City (1956) Image:Beckman Auditorium.JPG|Beckman Auditorium California Institute of Technology Pasadena, California (1960) Image:General Motors Building.JPG|General Motors Building New York City (1964) Image:Museo de Arte, Ponce, Puerto Rico-Exterior.jpg|Ponce Museum of Art Ponce, Puerto Rico (1961) File:National Geographic Museum.JPG|National Geographic Museum Washington, D.C. (1961) File:Metro One.jpg|Metro One Building University Town Center Hyattsville, Maryland (1962) Image:Aon Center (Chicago).jpg|Aon Center Chicago, Illinois (1972) ==Awards and recognitions== ===Honorary degrees=== *Doctor of Fine Arts, University of Arkansas, 1951 *Doctor of Fine Arts, Colby College, 1959 *Master of Fine Arts, Otis Art Institute of Los Angeles County, 1961 *Doctor of Fine Arts, Hamilton College, 1962 *Doctor of Humane Letters, University of South Carolina, 1964 ===Memberships and honors=== *Medal of Honor, New York Chapter of the American Institute of Architects, 1955 *American Institute of Architects, Fellow, 1958 *National Institute of Arts & Letters, Member, 1958 *National Urban League, Trustee, 1958 *American Academy of Arts & Sciences, Fellow, 1960 *American Federation of Arts, Trustee, 1960 *Royal Society of Arts, Fellow, 1960 *National Institute of Social Sciences, Gold Medal, 1961 *Building Stone Institute, Architect of the Year, 1964 *Horatio Alger Award, 1971 *Commendatore Ordine al Merito della Repubblica Italiana [Commander, Order of Merit of the Italian Republic], 1971 ===Architectural awards=== *Silver Medal, Architectural League of New York, 1937 - Guest House for Henry R. Luce, Mepkin Plantation, Moncks Corner, South Carolina *Silver Medal, Architectural League of New York, 1950 - A. Conger Goodyear Residence, Old Westbury, New York *Gold Medal, Architectural League of New York, 1950 - Museum of Modern Art, New York City, New York (Philip Goodwin, Associate) *Gold Medal, Architectural League of New York, 1950 - El Panama Hotel, Panama City, Panama *Honorable Mention, Architectural League of New York, 1952 - University of Arkansas Fine Arts Center, Fayetteville, Arkansas *Honor Award, American Institute of Architects, 1952 - University of Arkansas Medical Center, Little Rock, Arkansas *First Honor Award, American Institute of Architects, 1958 - Stuart Pharmaceutical Co., Pasadena, California *Award of Merit, American Institute of Architects, 1958 - U.S. Pavilion, Brussels, Belgium *First Honor Award, American Institute of Architects, 1961 - U.S. Embassy, New Delhi, India *Award of Merit, American Institute of Architects, 1963 - Community Hospital of the Monterey Peninsula, Carmel, California *First Honor Award, American Institute of Architects and American Library Association, 1963 - University of South Carolina Undergraduate Library, Columbia, South Carolina *Honor Award, American Institute of Architects, 1967 - Ponce Museum of Art, Ponce, Puerto Rico ==Related pages== *Rockefeller Center *Rockefeller family *Museum of Modern Art ==References== ;Bibliography * Everett, Derek R. \"Modern Statehouses for Modern States: Edward Durell Stone's Capitol Architecture in North Carolina and Florida.\" Southern Historian, Vol. 28 (Spring 2007): pp. 74–91. * Head, Jeffrey. \"Unearthing Stone.\" Metropolis magazine, Urban Journal, January 2008. * Hunting, Mary Anne. \"Edward Durell Stone, Perception and Criticism.\" PhD diss., Graduate Center, City University of New York, 2007. * Hunting, Mary Anne. \"From Craft to Industry: Furniture Designed by Edward Durell Stone for Senator Fulbright.\" The Magazine Antiques, Vol. 165, No. 5 (May 2004): pp. 110–121. * Hunting, Mary Anne. \"Living with Antiques: The Richard H. Mandel House in Bedford Hills, New York.\" The Magazine Antiques, Vol. 160, No. 1 (July 2001): pp. 72–83. * Ricciotti, Dominic. \"Edward Durell Stone and the International Style in America: Houses of the 1930s.\" American Art Journal, Vol. 20, No. 3 (Summer 1988): pp. 48–73. * Ricciotti, Dominic. “The 1939 Building of the Museum of Modern Art: The Goodwin-Stone Collaboration.” American Art Journal, Vol. 17, No. 3 (Summer 1985): pp. 51–76. * Stone, Edward Durell. Edward Durell Stone: Recent and Future Architecture. New York: Horizon Press, 1967. * Stone, Edward Durell. The Evolution of An Architect. New York: Horizon Press, 1962. * Williams, John G. The Curious and the Beautiful. Fayetteville: University of Arkansas Press, 1984. ;Notes Category:1902 births Category:1978 deaths Category:Harvard University alumni Category:Massachusetts Institute of Technology alumni Category:American architects Category:Businesspeople from Arkansas Category:People from Fayetteville, Arkansas",
 "title": "Edward Durell Stone"
}