{
 "id": "316924",
 "text": "Adabel Guerrero is an Argentine professional theatre dancer, actress and vedette. She is of Ukrainian and Spaniard descent. Guerrero was in Dancing with the Stars in Argentina competing together with professional dancer Martin Whitecamp.Adabel Guerrero y Martín Whitencamp en Bailando 2011 They were eliminated by 41.28% of the public vote.Guerrero quedó eliminada de \"Bailando por un sueño\" == Theatre == Year Musical Show Notes Cinderella Fairy godmother Singer & Dancer - Ballerina Ballet del Teatro Argentino Dancer - Ballerina Seven years in the cast 2004 Buenos Aires al rojo vivo Dancer 2005 El humor no tiene trabas 2006 Pasajeros de la risa 2007 Irresistible, otra historia de humor Outstanding Vedette after 1st Vedette Valeria Archimaut 1st Dancer alongside Sabrina Ravelli 2008 El Fantasma de Canterville Actress - Dancer 2008 Incomparable, el humor continua Outstanding Dancer & Vedette 3rd Vedette 2008–2009 La fiesta esta en el lago Co-Lead Vedette alongside Mónica Farro & Valeria Archimó 2009 Doña flor y sus dos maridos Replacement for 1st Actress - Dancer - Singer 2010 Primera dama se busca 2nd Vedette 2010 Carnaval de estrellas 1st Vedette Joined party in June 2010 The magazine started in march 26, 2010 2010 Glamoree Guest performer 2010–2012 Exitante 1st Vedette Lead Dancer - Prima Ballerina & Singer 2011 La Revista de Buenos Aires One week replacement for 1st Vedette Covering Valeria Archimó 2011 América 20Diez, La Revista Guest performer 2012-Present El diluvio que viene 1st Actress - Dancer - Singer 2013 Stravaganza Lead Supervedette Yet to debut Pending Escandalosas 1st Vedette Yet to sign == Others == * In 2008 Guerrero modeled for Maxim in Argentina for the March cover. * In 2008 Guerrero modeled for Maxim in Argentina for the July cover. * In 2009 Guerrero modeled for Maxim in Argentina for the January cover.First cover of 2009: Adabel Guerrero * In 2010 Guerrero modeled for Playboy in Argentina for the cover of March. * In November 3, 2011 Guerrero taped a video with the band Banda XXI of her dancing & singing to their song \"Bam Bam\".Adabel Guerrero mueve el \"Bam Bam\"- 21/11/2011 * In November 2011 Guerrero created a portfolio of her named \"Dulce Rock\". Photos taken by Aníbal Pérez and clothing by Marta Trobbiani and Gisela Sabino. ==Inspirations== When asked about her inspiration on dancing Guerrero responded: > \"Julio Bocca, Maximiliano Guerra, Hernán Piquín ... They are the highest in > Argentina, each with their own style. Maxi, more manly, more land, and Julio > and Piquín more princely, more aerial. There is no first or second, they are > different from each other.They have broken their souls to get where they are > now.\" Guerrero also says that dance it self is her inspiration: > \"To me, dancing transports me, its an absolute passion. Dancing is the > best,its orgasmic.\" ==References== == Other websites == * Official web site Category:1978 births Category:Living people Category:Argentine actors Category:Argentine models Category:Argentine dancers",
 "title": "Adabel Guerrero"
}