{
 "id": "317005",
 "text": "Amy Meredith Poehler (; born September 16, 1971) is an American actress, comedian, director, producer and writer. She was a cast member of the television program Saturday Night Live between 2001 and 2008. ==Early life== Poehler was born in Newton, Massachusetts. Her parents are high school teachers Eileen Frances (née Milmore) and William Grinstead Poehler. She grew up in nearby Burlington. Her father is of German, Irish, Portuguese, and English ancestry. Her mother is of Irish ancestry. Poehler was raised in the Catholic faith.Stated in interview on Inside the Actors Studio, 2009 She graduated from Burlington High School in 1989. She studied at Boston College and at The Second City. ==Marriage and family== Poehler was married to Will Arnett in 2003. They have two children. In September 2012, Poehler and Arnett separated. The divorce was finalized in 2016. ==Filmography== ===Movies=== Year Title Role Notes 1998 Tomorrow Night Woman Sprayed with Hose Film Debut 1999 Deuce Bigalow: Male Gigolo Ruth 2001 Wet Hot American Summer Susie 2002 Martin & Orloff Patty 2004 Mean Girls Mrs. George Envy Natalie Vanderpark 2006 Southland Tales Veronica Mung / Dream Tenacious D in The Pick of Destiny Truck Stop Waitress Man of the Year Herself Saturday Night Live's Weekend Update with Tina Fey & Amy Poehler was featured in the movie 2007 The Ex Carol Lane Blades of Glory Fairchild Van Waldenberg Shrek the Third Snow White (voice) Mr. Woodcock Maggie Hoffman Shortcut to Happiness Molly Gilchrest Wild Girls Gone Doreen With Matt Besser, Ian Roberts & Matt Walsh of the Upright Citizens Brigade. 2008 Hamlet 2 Cricket Feldstein Horton Hears a Who! Sally O'Malley (voice) Baby Mama Angie Ostrowski MTV Movie Award for Best WTF Moment Nominated – MTV Movie Award for Best Comedic Performance 2009 Spring Breakdown Gayle Monsters vs. Aliens Computer (voice) Alvin and the Chipmunks: The Squeakquel Eleanor Miller (voice) 2010 Megamind Jorrie Nortion (voice) 2011 Hoodwinked Too! Hood vs. Evil Gretel (voice) Alvin and the Chipmunks: Chipwrecked Eleanor Miller (voice) Freak Dance Lillian Upright Citizens Brigade production; incl. Besser, Walsh and Roberts. 2012 The Secret World of Arrietty Homily (voice) 2013 A.C.O.D. Sondra You Are Here Janice Anchorman 2: The Legend Continues Entertainment Tonight anchor Free Birds Jenny (voice) 2014 They Came Together Molly 2015 Inside Out Joy (voice) 2015 Sisters Maura Ellis 2017 The House Kate Johansen 2019 Wine Country Abby 2021 Moxie Lisa 2023 First Time Female Director Meg 2024 Inside Out 2 Joy (voice) ===Television=== Year Title Role Notes 1996–2000 Late Night with Conan O'Brien Stacy (Andy's little sister) / Various sketch roles 1997 Apartment 2F Amy 2 episodes 1998 Spin City Susan Episode: \"Single White Male\" 1998–2000 Upright Citizens Brigade Colby / Various Characters 30 episodes 2001–2008 Saturday Night Live Herself / Various Characters 142 episodes Nominated – Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series (2008–2009) 2001–2002 Undeclared Hillary / Top Floor R.A. 3 episodes 2004–2005 Arrested Development Wife of Gob 5 episodes 2005 SpongeBob SquarePants Gramma (voice) Episode: \"Have You Seen This Snail?\" The Simpsons Jenda (voice) Episode: \"Future-Drama\" 2006 O'Grady Wendy (voice) Episode: \"Jerked\" Wonder Showzen Miss Mary 2 episodes 2008–2009 Saturday Night Live Weekend Update Thursday Herself 5 episodes 2008–2011 The Mighty B! Bessie Higgenbottom (voice) and Sissy Sullivan 40 episodes;Co-creator, Executive Producer, Writer, Voice Artist Nominated – Daytime Emmy Award for Outstanding Performer In An Animated Program (2009–2010) 2009–2016 Parks and Recreation Leslie Knope Main Role Critics' Choice Television Award for Best Actress in a Comedy Series (2012) Nominated – Critics' Choice Television Award for Best Actress in a Comedy Series (2011, 2013) Nominated – Golden Globe Award for Best Actress – Television Series (Musical or Comedy) (2012–2013) Nominated – Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series (2010–2013) Nominated – Primetime Emmy Award for Outstanding Writing for a Comedy Series (2012) Nominated – Satellite Award for Best Actress – Television Series (Musical or Comedy) (2011–2012) Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Comedy Series (2013) Nominated – TCA Award for Individual Achievement in Comedy (2011–2012) Nominated – Writers Guild of America Award for Television: Episodic Comedy (2013) 2010 Saturday Night Live Host Episode: \"Amy Poehler/Katy Perry\" Sesame Street Herself Episode: \"The Camouflage Challenge\" 2012 30 Rock Young Liz Lemon (Flashback) Episode: \"Live from Studio 6H\" Louie Debbie Episode: \"New Year's Eve\" Napoleon Dynamite Misty (voice) Episode: \"Thundercone\" 2013 70th Golden Globe Awards Host TV Special The Greatest Event in Television History Jennifer Hart Episode: \"Hart to Hart\" 2014 71st Golden Globe Awards Host TV Special 2014 Welcome to Sweden As herself ==Awards and nominations== Year Award Category Work Result 2005 Teen Choice Awards Choice Comedian Saturday Night Live 2006 Prism Award Best Performance in a TV Comedy Series Saturday Night Live 2008 Primetime Emmy Award Outstanding Supporting Actress in a Comedy Series Saturday Night Live 2009 Primetime Emmy Award Outstanding Supporting Actress in a Comedy Series Saturday Night Live 2009 Teen Choice Awards Choice Comedian Saturday Night Live 2009 MTV Movie Award Best WTF Moment Baby Mama 2009 MTV Movie Award Best Comedic Performance Baby Mama 2009 People's Choice Award Favorite On-Screen Match Up (with Tina Fey) Baby Mama 2009 Daytime Emmy Award Outstanding Performer in an Animated Program The Mighty B! 2010 Daytime Emmy Award Outstanding Performer in an Animated Program The Mighty B! 2010 People's Choice Award Favorite TV Comedy Actress Parks and Recreation 2010 Primetime Emmy Award Outstanding Lead Actress in a Comedy Series Parks and Recreation 2011 Critics' Choice Television Award Best Actress in a Comedy Series Parks and Recreation 2011 Primetime Emmy Award Outstanding Comedy Series Parks and Recreation 2011 Primetime Emmy Award Outstanding Lead Actress in a Comedy Series Parks and Recreation 2011 Satellite Award Best Actress in a TV Series - Comedy or Musical Parks and Recreation 2011 Television Critics Association Award Individual Achievement in Comedy Parks and Recreation 2011 Variety’s Power of Comedy Award 2012 The Comedy Awards Best Comedy Actress Parks and Recreation 2012 Critics' Choice Television Award Best Actress in a Comedy Series Parks and Recreation 2012 Critics' Choice Television Award Best Comedy Series Parks and Recreation 2012 Golden Globe Award Best Actress in a TV Series - Comedy or Musical Parks and Recreation 2012 Primetime Emmy Award Outstanding Lead Actress in a Comedy Series Parks and Recreation 2012 Primetime Emmy Award Outstanding Writing for a Comedy Series Parks and Recreation 2012 Producers Guild of America Award Comedy Series Parks and Recreation 2012 Satellite Award Best Actress in a TV Series - Comedy or Musical Parks and Recreation 2012 Television Critics Association Award Outstanding Individual Achievement in Comedy Parks and Recreation 2012 Women's Image Network Awards Outstanding Actress in Comedy Series Parks and Recreation 2012 Writers Guild of America Award Outstanding Comedy Series Parks and Recreation 2013 Golden Globe Award Best Actress in a TV Series - Comedy or Musical Parks and Recreation 2013 Screen Actors Guild Award Outstanding Performance by a Female Actor in a Comedy Series Parks and Recreation 2013 Writers Guild of America Award Outstanding Comedy Series Parks and Recreation 2013 Writers Guild of America Award Outstanding Episodic Comedy Parks and Recreation 2013 Gracie Awards Outstanding Female Actor Parks and Recreation 2013 Primetime Emmy Award Outstanding Lead Actress in a Comedy Series Parks and Recreation 2013 Critics' Choice Television Award Best Actress in a Comedy Series Parks and Recreation 2013 Critics' Choice Television Award Best Comedy Series Parks and Recreation 2014 Golden Globe Award Best Actress in a TV Series - Comedy or Musical Parks and Recreation ==References== ==Other websites== * * * in 2009 * Amy Poehler named one of Men's Vogue's 2008 Visionaries * TODAY talent are on People magazine annual list of 100, led by Applegate * Amy Poehler at Emmys.com Category:1971 births Category:American feminists Category:Living people Category:Comedians from Boston Category:American television actors Category:American movie actors Category:Actors from Boston Category:People from Newton, Massachusetts",
 "title": "Amy Poehler"
}