{
 "id": "317066",
 "text": "Yuko Kavaguti , born November 20, 1981– ), also known as ,When the skater's family name is converted from Japanese to Russian, \"Kawaguchi\" becomes \"Kavaguti\". is a Japanese-Russian Olympic athlete and international ice skating competitor.Clarey, Christopher. \"Figure Skating Venue Changes, but Thoughts Stay on Japan,\" New York Times, April 28, 2011; \"Figure skating, Pairs, Vancouver Olympics 2010,\" New York Times. Retrieved 2011-12-2. In December 2008, she became a Russian citizen and her Russian name is Kavaguti.\"Ukaz №1832, Ukaz signed by President Dmitry Medvedev,\" Presidential Administration of Russia. 2008-12-23. Retrieved 2011-12-2. Kawaguchi gave up her Japanese citizenship.Clarey, Christopher. \"Nationality a Fluid Thing for Pairs on Skating’s Frozen Water,\" New York Times. January 21, 2010. Retrieved 2011-12-2. == Early life == Kawaguchi was born in Funabashi, Chiba in Japan. She began skating at the age of five because her mother was a fan of ice dancing.Mittan, Barry. \"Kawaguchi and Markhuntsov Give Japan a Competitive Pairs Team,\" Golden Skate. February 13, 2003. Retrieved 2011-12-2. She studied international relations at St. Petersburg State University, completing her degree in June 2007. In addition to her native Japanese, she is also fluent in Russian and English.Flade, Tatjana. \"Russian pair team ready for breakthrough,\" Golden Skate. October 15, 2007. Retrieved 2011-12-2. == Career == In international competition, Kavaguti is pairs skater.Longman, Jeré. \"How Pairs Broke Free From Russia’s Grip,\" New York Times. February 16, 2010. Retrieved 2011-12-2. She represents Russia with Alexander Smirnov. Kavaguti became a Russian citizen so that she would qualify for a spot on the Russian Olympic team. Japan does not allow dual nationality, so she was obliged to give up her Japanese citizenship in order to compete for Russia.川口がロシア国籍を取得 フィギュアで五輪目指し , 47NEWS, 2009/01/17. Retrieved 2011-12-2. ===Kawaguchi=== As a Japanese citizen, Kawaguchi competed as a singles skater. She switched to pairs after the 1998 Winter Olympics in Nagano, Japan.Fyodorov, Gennady. \"Kawaguchi braves taunts to skate for Russia,\" Reuters. October 20, 2009. Retrieved 2011-12-2. ===Kavaguti=== As a Russian citizen, Kavagui has won many medals, including gold at 2008 Skate Canada International.2008 Skate Canada, pairs results, Golden Skate. Retrieved 2011-12-2. ;2010 Kavaguti was a partner in the pairs team which won the 2010 European Figure Skating Championships, \"Kavaguti and Smirnov win gold, Germans second,\" Golden Skate. January 20, 2010 2009. Retrieved 2011-12-2. Kavaguti and Smirnov won the 2010 Cup of Russia, \"Kavaguti and Smirnov win gold,\" Golden Skate. 25 November 2010. Retrieved 2011-12-2. They placed third in the 2010 World Figure Skating Championships.ISU World Figure Skating Championships, 2010, Golden Skate. Retrieved 2011-12-2. ;2011 Kavaguti and her partner won the 2011 Cup of China \"Kavaguti and Smirnov cruise to gold at Cup of China,\" Golden Skate. 6 November 2011. Retrieved 2011-12-2. and the 2011 NHK Trophy. \"Kavaguti and Smirnov win second gold of the season at NHK Trophy,\" Golden Skate. 12 November 2011. Retrieved 2011-12-2. == Awards and titles== * Order of the President of the Russian Federation ’For services to the development of physical culture and sports, high athletic achievements at the XXI Olympic Games 2010 in Vancouver’ (March 5, 2010) Распоряжение Президента Российской Федерации от 5 марта 2010 года № 135-рп «О поощрении» . Retrieved 2011-12-2. * The Best in the Sport of St. Petersburg (February 2010) Постановление Правительства Санкт-Петербурга от 2 февраля 2010 г. № 75 «О присвоении почётного звания „Лучший в спорте Санкт-Петербурга“» . Retrieved 2011-12-2. * Honored Master of Sports of Russia (2009) Приказ Минспорттуризма № 103 - нг от 02.08.2010 О присвоении почётного спортивного звания \"Заслуженный мастер спорта России\" . Retrieved 2011-12-2. ==Related pages== * Japan at the Olympics ==References== == Other websites == * Yuko Kavaguti at International Skating Union (ISU) Category:1981 births Category:Living people Category:Japanese figure skaters Category:Russian figure skaters Category:Sportspeople from Chiba Prefecture Category:Olympians for Russia",
 "title": "Yuko Kavaguti"
}