{
 "id": "317000",
 "text": "Bashar al-Assad (Russian:Башар Аль-Асад) (born 11 September 1965) is a Syrian politician. He was the President of Syria from 2000 to 2024. He was also the head of the Ba'ath Party in Syria from 2017 to 2024. Assad became president after the death of his father Hafez al-Assad. Bashar al-Assad was elected in 2000, and re-elected in 2007 with 97% votes. On 7 December 2024, it was widely reported that the Assad regime ended and he fled the country as rebels took over Damascus during their campaign offense across Syria. ==Early life== Assad was born on 11 September 1965 in Damascus, Syria to Hafez al-Assad and . He had two brothers, Bassel al-Assad and , and one sister, . Bashar was quiet and reserved and was not interested in politics or the military. ===Education=== Assad studied medicine at the University of Damascus and graduated in 1988. He then studied ophthalmology at a military hospital, and in 1992 studied at the in London. His father wanted Assad's elder brother Bassel to succeed him as leader of Syria. Bassel died in a car accident in 1994, and Assad returned home to Syria. When he returned, he was allegedly given training for his presidency but he denies these claims. ==Early career== He went to a military academy at Homs, and became a colonel after only five years. He worked as an adviser to his father. ==Presidency== When Bashar's father died, the government changed the constitution. Under Syrian law the president had to be at least 40 years old. With the law changed, Assad was able to be elected President of Syria in June 2000. He was also made commander-in-chief of the armed forces, and leader of the Ba'ath Party which has ruled Syria since 1961. === Syrian Civil War === Large protests began in January 2011. The protesters wanted political reforms, an end to the state of emergency (which had been in place since 1963), and the return of civil rights. The protests in March were the largest to take place, and the government used violence against the protestors. The United States placed sanctions against the al-Assad government in April 2011. Canada and the European Union also placed sanctions against the government in May 2011. In June 2011, al-Assad promised reform, a new parliamentary election, and more freedoms. He also urged refugees to return to Syria. In January 2012, Reuters claimed that over 5,000 civilians and protesters (including militants) had been killed by the Syrian army, security agents and , while 1,100 people had been killed by terrorists. In January 2012, Assad gave a speech in which he claimed that the uprising was being engineered by foreign countries. He said that a new referendum could be held in March. The referendum was held in February 2012. The referendum would change the term limits of future Syrian presidents. It passed with 90% support. The U.S. and Turkey did not accept the results. The European Union pushed new sanctions on the government. In June 2012, the ICRC announced that Syria was in a civil war. The national death toll on both sides reached 20,000. In 2014 and 2015, he began to lose some support from the Alawite community. This was because an unequal number of soldiers killed in the conflict were Alawites. In September 2015, Russia got involved in the Syrian Civil War. President of Russia Vladimir Putin said that Russia's goal in Syria is to \"stabilis[e] the legitimate power in Syria and creat[e] the conditions for political compromise.\" In November 2015, Assad said that the two months of Russian intervention had accomplished more than the U.S.-led coalition had done in a year. In December 2016, government forces recovered most of Aleppo from rebel forces. After the election of Donald Trump, the U.S. no longer wished to remove Assad from power. That changed after the . Donald Trump ordered missile strikes to hit a Syrian airbase. Assad responded by saying that the United States's behaviour was an \"unjust and arrogant aggression.\" He also said that the Syrian army had given up all its chemical weapons in 2013. He claimed that the chemical attack was a lie and was used to justify a U.S. airstrike. As of March 2018, between 350,000 and 511,000 people have been killed in the civil war. * * ===Removal from office=== On 4 December 2024, fierce clashes erupted in Hama governorate as the Syrian army engaged Islamist-led insurgents in a bid to halt their advance on the key city of . Government forces claimed to have launched a counteroffensive with air support, pushing back rebel factions, including Hayat Tahrir al-Sham (HTS), around six miles from the city. However, despite reinforcements, the rebels captured the city on 5 December. The fighting led to widespread displacement, with nearly 50,000 people fleeing the area and over 600 casualties reported, including 104 civilians. On 7 December 2024, Assad fled the capital of Damascus. Assad reportedly arrived in Moscow and was granted political asylum.with a fortune of 2 Billion dollarsMsn 9 December 2024} ==Personal life== Assad is married to Asma al-Akhras. Together, they have three children; , Zain, and Karim al-Assad. Influenced by his western education and urban upbringing, Bashar initially seemed eager to implement a cultural revolution in Syria. ==Related pages== *List of scientists from the Middle East ==References== ==Other websites== * *Official website **Biography , decrees , speeches , interviews , press releases *Profile at the LookLex Encyclopedia *Unofficial website *Unofficial website ;Articles * *Syria’s Proxy Forces in Iraq, (London), 12 April 2003 at Middle East Intelligence Bulletin *Profile: Syria's Bashar al-Assad BBC News, 10 March 2005 *Bashar al-Assad's Lebanon Gamble, William Harris, Middle East Quarterly, Summer 2005 *Assad on the Brink , , The Nation, 21 November 2005 *Syria's Leaders , Esther Pan, Council on Foreign Relations, 10 March 2006 *Connecting the dots in Lebanon , Omar Raad, Ya Libnan Volunteer, 2 December 2006 *The Assad Dynasty in Syria: From Father to Son, Deutsche Welle, 2009 at *Interview With Syrian President Bashar al- Assad, The Wall Street Journal, 31 January 2011 *Profile: Bashar al-Assad, , 25 March 2011 Category:1965 births Category:Living people Category:Former dictators Category:People from Damascus Category:Specially Designated Nationals and Blocked Persons List Category:Presidents of Syria Category:Syrian military people Category:20th-century presidents in Asia",
 "title": "Bashar al-Assad"
}