{
 "id": "317180",
 "text": "The Arab Spring (, ) is a wave of protests and demonstrations that happened in the Middle East and North Africa starting on 17 December 2010. The self- immolation of Tunisian street vendor Mohamed Bouazizi ignited the Tunisian Revolution, which quickly spread all over the MENA region. Almost all Arab countries were affected by the Arab Spring, through varying degrees of social and political unrest. In Tunisia, Egypt, Libya, Yemen, Bahrain and Syria, the influence of the Arab Spring is the most notable. However, major protests also occurred in many other Middle Eastern states. People went to protest out of anger against corruption and their often oppressive and authoritarian leaders. The demands of the protester were similar throughout the region. Common demands were freedom, justice, equal rights, economic opportunities, and democracy. Protestors were very efficient in mobilising people, communicating, and providing information. The methods they used strongly contributed to the course of the Arab Spring. Moreover, pan-Arab TV programmes, social media and other forms of pan-Arab Internet networks contributed to the high degrees of synchronisation of the protests. The Arab Spring heavily altered the political environment of the Middle East. By 2012, most of the governments involved had been defeated and replaced or had suppressed the protests. However, in most countries, the demands of the protestors were not met, leaving them discontent and leaving the country in a state of unrest and instability. == Events == On 17 December 2010, the self-immolation of the Tunisian street vendor Mohamed Bouazizi, sparked the Tunisian Jasmine Revolution.This revolution was the first of many revolutionary protests and demonstrations in the Middle East and North Africa. We know this wave of revolts, protests, and uprisings, as the Arab Spring. Protests occurred all over the Arab World. The Arab Spring resulted in conflicts in Tunisia, Algeria, Jordan, Oman, Saudi Arabia, Egypt, Syria, Yemen, Djibouti, Sudan, Palestine, Iraq, Bahrain, Libya, Kuwait, Morocco, Mauritania, and at the borders of both Lebanon and Israel. The outcomes of the Arab Spring differ per country, depending on a variety of factors. Such as the regime's response to the events, the attitude and involvement of security forces, foreign intervention, ethnic and sectarian divisions, and the existing state structure. In six of the twenty-two states of the Arab League, the Arab Spring dramatically transformed the political environment and led to major political changes. In Tunisia, Libya and Yemen, popular protests forced the authoritarian rulers out of power. In Egypt, this occurred twice. In Bahrain and Syria the demonstrations evolved into civil uprisings. In Syria, the civil uprisings against the regime of Bashar al-Assad led to a full-scale civil war. Civil wars also arose in Libya and Yemen, as a result of the Arab Spring. Other major protests occurred in Algeria, Iraq, Kuwait, Morocco and Sudan. Minor protests occurred in Jordan, Mauritania, Oman, Saudi Arabia, Djibouti, Western Sahara, Palestine and in several non- Arab countries. There were border clashes in Israel. Protests in Iranian Khuzestan by the Arab minority occurred in 2011. Weapons and Tuareg fighters returning from the Libyan civil war had encouraged a conflict in Mali in North Africa. The clashes in Lebanon were described as a spillover of violence from the Syrian uprising. == Causes == The protests of the Arab Spring resembled a 'chain effect'. Many protests all around the Middle East and North Africa arose, following the example of the Tunisian Revolution. Despite the many events related to the Arab Spring, a great number of similarities in the causes of the protests and in the demands of the protestors can be identified. Five major causes which lead to the Arab Spring, and revolutionary protests in general, are: # A demographic shift, with a rapid expansion of the youth share in a country's population, contributing to political instability. # Authoritarian regimes, which aim to control all aspects of society. # Resentment against the regime, often caused by corruption and poor economic performance. # The combination of feelings of discontent and a strong aspiration for change. # Destabilisation by external actors. Protestors of the Arab Spring took to the streets out of anger towards their authoritarian, oppressive rulers and the corruption tied to their rule. Demands were generally concerned with freedom, justice, equal rights, economic opportunities, and democracy. These demands were heard all over the MENA region, among all members of society. Participation to the protests exceeded gender, age, religion, and education. == Methods == The Arab Spring has been very influential, at least to a great extend because of the methods used by protestors and the high degree of synchronisation of the protests. The protests incorporated some techniques of civil resistance in sustained campaigns such as strikes, demonstrations, marches, and rallies. Protestors were also effective at using social media to organize, communicate, and raise awareness of state attempts at repression and Internet censorship. The protests of the Arab Spring occurred all over the Arab world, despite the different contexts of the different countries, the protests arose almost simultaneously. Four major factors can be identified which contributed to this synchronisation: # First, pan-Arab Internet networks played a great role considering exchanges and communication between Arab youth all over the Arab World. # Pan-Arab TV channels were also greatly influential, as they contributed to spreading information on the protests. # The global wave of agricultural inflation (agflation) and the corresponding world food price crisis of 2010 - 2012. # The rapid rise of the average level of education in the workforce of many Arab countries, and the non-correspondence of the demands of the labour market. Which resulted in great numbers of highly educated unemployeds. == Outcomes == The self-immolation of the Tunisian street vendor Mohamed Bouazizi on 17 December 2010 sparked a wave of revolutions and protests, which re-shaped the political environment of the MENA Region. The outcomes of the Arab Spring are of a wide variety and they differ per country. As the context and factors such as the regime's response to the events, the attitude and involvement of security forces, foreign intervention, ethnic and sectarian divisions, and the existing state structure strongly influence the outcomes of the revolutionary events of the Arab Spring. === Outcomes per country === The Arab Spring is responsible for many changes regarding Middle Eastern society and political structures. In almost all countries of the Arab League, changes occured. However, in Tunisia, Egypt, Libya, Yemen, Bahrein and Syria, these changes were more substantial and disturbing, they strongly altered the political environment of these countries. ==== Tunisia ==== The Arab Spring began in Tunisia, following the self immolation of Mohamed Bouazizi. In Tunisia, the Arab Spring resulted in a revolution, the Tunisian Revolution, also called the Jasmine Revolution. This revolution began on 17 December 2010, with calls against governmental corruption and economic stagnation, and ended on January 14th, 2011, with the ousting of president Zine El Abidine Ben Ali and his autocratic regime. In Tunisia, the Arab Spring was caused mainly by economic stagnation, lack of political legitimacy, involvement of Tunisian youth and civil society, Islamism, and the growing influence of social media. The overthrow of Ben Ali's regime allowed for more political freedom and democratization in Tunisia. The succes of the Tunisian Revolution ignited many other revolutionary acts in the MENA region. ==== Egypt ==== In Egypt, the protests started on January 25th, 2011, following the Tunisian example. The Egyptian revolution was influenced by similar factors as the Tunisian Revolution. Egyptians protested against police brutality, the state-of-emergency laws, and economic factors, such as unemployment, agricultural inflation, and low wages. They also demanded more political and civil freedoms.The main goals of the revolution are reflected in one of the main slogans of the protesters, namely “Bread, Freedom, Social Justice and Human Dignity”, relating to the poor political and economic situation of Egypt, characterised by poverty, oppression, corruption, and economic inequality. The Egyptian revolution resulted in the ousting of the Mubarak regime. After the toppling of Mubarak's regime, Egyptian politics remained unstable. ==== Yemen ==== On 27 January 2011 protests commenced in Yemen. Yemeni Protesters initially demanded less unemployment, better economic conditions, an end to governmental corruption, and adjustment to the Yemeni constitution. However, quickly the protesters began demanding the end of Ali Abdullah Saleh's presidency. The predominantly peaceful protests were met with violent responses from the government. On 27 February 2012, President Abdullah Saleh resigned, and democratic presidential elections were held, following a long period of GCC-led diplomatic negotiations. ==== Libya ==== In Libya, the first protest began on 15 February 2011. The uprisings of the Arab Spring erupted into a civil war, between Muammar al-Gaddafi's regime and the anti-Gaddafi rebels. On March 21st 2011, a NATO-led coalition military intervened in the Libyan Civil War, to protect Libyans against aggression of the government. On 23 August 2011, Muammar al- Gaddafi and his government were overthrown. However, this was followed with a period of great social, political, and military unrest. ==== Bahrain ==== 14 February 2011 marked the beginning of the Arab Spring in Bahrain. A civil uprising started, despite of the relative high degrees of prosperity and little corruption. The Arab Spring resulted in further polarisation of the Bahraini society, in which sectarian tensions were already high. The uprisings were met violently by the regime, after dialogue had failed. The Sunni- minority regime, supported by the military wing of the GCC, violently regained control over Bahraini society. ==== Syria ==== In Syria, protests began on March 15th, 2011. Protests were directed against president Bashar al-Assad, who unlike many other Middle Eastern authoritarian leaders was not ousted during the Arab Spring. As the Syrian revolution accelerated, governmental responses became increasingly violent and repressive. The Revolution of the Arab Spring transformed into a civil uprising, paving the way for a full-scale civil war, the Syrian civil war. The regime of Bashar al-Assad remains in power, even though opposition and resistance remains. Since 25 March 2011, more than 130 000 people have died and millions have been displaced, both internally and externally. ==Origin of term== The term Arab Spring (, ) is used in the media for the revolutionary wave of demonstrations and protests (both non-violent and violent), riots, and civil wars in the Arab world, however, not all participants of the protests were Arab. The first specific use of the term Arab Spring to signify these events may have been in the American political journal Foreign Policy. Marc Lynch, referring to his article in Foreign Policy, writes \"Arab Spring—a term I may have unintentionally coined in a January 6, 2011 article\". Joseph Massad on Al Jazeera said the term was \"part of a US strategy of controlling the movement's aims and goals\" and directing it towards American-style liberal democracy. Due to the electoral success of Islamist parties before protests began in many Arab countries, the events have also come to be known as \"Islamist Spring\" or \"Islamist Winter\".The Atlantic: Muslim Protests: Has Obama Helped Bring On an Anti-U.S. 'Islamist Spring'?, 23 September 2012, retrieved 2 August 2013Foreign Policy: Learning to Live With the Islamist Winter, 19 July 2012, retrieved 2 August 2013 Moreover, Some observers compared the Arab Spring movements to the Revolutions of 1989 that occurred in Eastern Europe or the Revolutions of 1848 in the German states, which are sometimes also referred to as \"Spring\" revolutions. == Related pages == * Arab Winter * Syrian civil war ==References== Category:History of the Middle East Category:Democracy movements Category:2010s protests",
 "title": "Arab Spring"
}