{
 "id": "317161",
 "text": "Naypyidaw (), also known Nay Pyi Taw or Naypyitaw, is the capital city of Myanmar, also known as Burma.Myoe, Maung Aung. (2006). \"The Road to Naypyita: Making Sense of the Myanmar Government's Decision to Move Its Capital,\" Asia Research Institute Working Paper Series No. 79 (National University of Singapore); retrieved 2011-12-2. Construction in the planned city is on- going.Thein, Cherry. \"National Library collection headed for Nay Pyi Taw,\" Myanmar Times, May 30-June 5, 2011; Oo, Sann. \"Subway plan for Nay Pyi Taw too expensive, says minister,\" Myanmar Times. September 5-11, 2011; Nikishenkov, Oleg. \"Moscow exports the metro to Myanmar,\" Rossiyskaya Gazeta (Russia). August 5, 2011; retrieved 2011-12-3. ==History== In 2005, the capital of Myanmar was officially moved inland and away from the Gulf of Martaban and the Andaman Sea. \"Built to Order: Myanmar’s New Capital Isolates and Insulates Junta,\" New York Times (US). June 24, 2008; Peck, Grant. \"Myanmar’s Remote Capital Is Still a Work in Progress,\" New York Times. October 5, 2007; retrieved 2011-12-2. ==Geography== The former capital, Yangon (Rangoon), is about 385 kilometers (240 miles) south of the new city. \"Junta in the Jungle; Myanmar Shows Off New Capital to the World,\" Der Spiegel (Germany). March 27, 2007; retrieved 2011-12-2. The new capital is located between middle mountain range of Bago Yoma and eastern mountain range of Shan Yoma. Naypyidaw covers an area of 7,054.37 square-km.\"Construction of Myanmar new capital continues,\" People's Daily (PRC). 24 December 2009; retrieved 2011-12-3. ==References== ==More reading== * \"Welcome to Naypyidaw, Madam Secretary; Hillary Clinton visits Myanmar's Potemkin capital,\" Foreign Policy (US). December 1, 2011. * McElroy, Damien. \"Burma: welcome to Naypyidaw - the home of kings - and the world's weirdest capital city,\" The Telegraph (UK). 18 November 2011. ==Other websites== * Global Security.org, Naypyidaw * \"Naypyidaw, An Unconventional Capital,\" 2011 Category:Cities in Myanmar Category:National capitals in Asia",
 "title": "Naypyidaw"
}