{
 "id": "317295",
 "text": "was a after Meitoku and before Shōchō. This period started in July 1394 and ended in April 1428. During this time, the emperors were and . ==Events of the Ōei era== * 27 August 1394 (Ōei 1, 1st day of the 7th month): Former- Emperor Chōkei died. * 1398 (Ōei 5): Kinkaku-ji or \"Gold Pavillion\" is built by Ashikaga Yoshimitsu.Asian Historical Architecture, \"Kinkaku-ji Temple - 金閣寺 (built 1398, destroyed 1950, reconstructed 1955) \"; retrieved 2012-4-27. * September 1398 (Ōei 5, 8th month): In the 6th year of the reign of King Taejong of Joseon, a Korean diplomatic mission was received in Japan. * 1399 (Ōei 6): began. Ōuchi Yoshiharu raised an army against Shogun Ashikaga Yoshimitsu. * 1401 (Ōei 8, 2nd month): The Imperial Palace was destroyed by fire. * 1402 (Ōei 9): A letter from the emperor of China was received by Yoshimitsu; and this formal communication mistakenly gives the title \"king of Japan\" to the Japanese shogun. * 1419 (Ōei 26) : was a Joseon military action in Tsushima Province (Tsushima Island). More than 200 ships and 17,000 fighting men took part in this military expedition. * 10 May 1424 (Ōei 31, 12th day of the 4th month): Former-Emperor Go-Kameyama died. ==Related pages == * Muromachi period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Ōei 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 20th 1394 1395 1396 1397 1398 1399 1400 1401 1402 1403 1404 1405 1406 1407 1408 1409 1410 1411 1412 1413 Ōei 21st 22nd 23rd 24th 25th 26th 27th 28th 29th 30th 31st 32th 33th 34th 35th 1414 1415 1416 1417 1418 1419 1420 1421 1422 1423 1424 1425 1426 1427 1428 Preceded by: Meitoku Era or nengō: Ōei Succeeded by: Shōchō Category:Japanese eras Category:1390s establishments Category:14th- century establishments in Japan Category:15th-century disestablishments Category:Disestablishments in Japan",
 "title": "Ōei"
}