{
 "id": "317658",
 "text": "Zork was one of the first interactive fiction computer games and a descendant of Colossal Cave Adventure. The first version of Zork was written in 1977–1979. \"Zork\" was originally MIT hacker slang for an unfinished program. The creators named the completed game Dungeon, but changed it back to Zork after receiving a trademark violation notice from the publisher of Dungeons & Dragons. Zork has also been adapted to a book series. Three of the original Zork programmers joined with others to found Infocom in 1979. That company adapted Zork into Zork I-III, a trilogy of games for most popular small computers of the era. Personal Software published what would become the first part of the trilogy under the name Zork when it was first released in 1980, but Infocom later handled the distribution of that game and their later games. Part of the reason for splitting Zork into three different games was that, at the time, micros did not have enough memory and disk storage to handle the entirety of the original game. In the process, more content was added to Zork to make each game stand on its own. A version of Zork I was issued as a hidden 'easter egg' in Call of Duty: Black Ops. It has exactly the same text and rules as the original. ==Setting== Zork is set in \"the ruins of an ancient empire lying far underground\". The player is a nameless adventurer \"who is venturing into this dangerous land in search of wealth and adventure\".Dave Lebling and Marc Blank. Zork Trilogy Instruction Manual. Infocom. 1984. p. 11. The goal is to return from the \"Great Underground Empire\" alive with the treasures, ultimately inheriting the title of Dungeon Master. The dungeons are stocked with many novel creatures, objects and locations, among them grues, zorkmids, and Flood Control Dam #3—all of which are referenced by subsequent Infocom text adventures. FrobozzCo International is a fictional monopoly from the game.Dave Lebling and Marc Blank. Zork Trilogy Instruction Manual. Infocom. 1984. p. cover. FrobozzCo products are littered throughout all Zork games, often with humorous effect. ==Zork series== ===The original Zork Trilogy=== * Zork I: The Great Underground Empire (1980, Infocom) * Zork II: The Wizard of Frobozz (1981, Infocom) * Zork III: The Dungeon Master (1982, Infocom) ===Later additions to the series=== All these are text-only unless otherwise noted. *The Enchanter trilogy: ** Enchanter (1983, Infocom) ** Sorcerer (1984, Infocom) ** Spellbreaker (1985, Infocom) *Games that take place somewhere in the Zork universe: ** Wishbringer: The Magick Stone of Dreams (1985, Infocom) *The Zork Quest series: ** Zork Quest: Assault on Egreth Castle (1988, Infocom, interactive computer comic book) ** Zork Quest: The Crystal of Doom (1989, Infocom, interactive computer comic book) * The Zork Anthology comprises the original Zork Trilogy plus: ** Beyond Zork: The Coconut of Quendor (1987, Infocom) ** Zork Zero: The Revenge of Megaboz (1988, Infocom, text with some graphics) After a six year hiatus, the following games were produced: * Return to Zork (1993, Infocom/Activision, graphical) * The Philosopher's Stone (Activision, unfinished text prequel to Zork Nemesis) * Zork Nemesis: The Forbidden Lands (1996, Activision, graphical) * Zork: The Undiscovered Underground (1997, written by Michael Berlyn and Marc Blank (original Infocom implementors) and released by Activision to promote the release of Zork Grand Inquisitor) * Zork Grand Inquisitor (1997, Activision, graphical) ==Related pages== * Legends of Zork, an online, browser-based spin- off * 69105, a number that became somewhat of an in-joke in several Infocom games * The Lurking Horror, another Infocom IF, that references Zork. * Grue, the infamous Zork monster * The Meteor, the Stone and a Long Glass of Sherbet, the winner of the 1996 Interactive Fiction Competition, is strongly influenced by the Zork universe and includes many elements. == References == * Montfort, Nick. Twisty Little Passages. MIT Press. 2003. . == Other websites == * Play Zork online at THCNET's interactive 404 error page. * Play Zork I online at Infocom, the place where it all started. * Download and play the original mainframe version of Zork, as well as a 1982 map of the Zork universe. * Zork I, II, III and The Undiscovered Underground Download Zork I, II and III for Win, DOS or Mac (no Z-interpreter needed), and The Undiscovered Underground (Z-machine interpreters included). Includes \"The New Zork Times\" * Infocom- IF.org, Infocom history, authors, etc.; often updated with any news from Activision; also downloads of games ready for Z-Machine interpreters like frotz. * * * Article at The Dot Eaters , featuring an extensive history of the Zork games and Infocom * The History Of Zork – Article * The Zork trilogy on Iron Realms. * Retroist Zork Podcast Category:1970s video games Category:Adventure games Category:Amiga games Category:Amstrad CPC games Category:Apple II games Category:Classic Mac OS games Category:Commodore 64 games Category:DOS games Category:Fantasy video games Category:MSX games Category:NEC PC-9801 games Category:PlayStation games Category:Sega Saturn games Category:Single-player video games Category:Video games developed in the United States Category:Zork",
 "title": "Zork"
}