{
 "id": "317655",
 "text": "Letters to Juliet is a 2010 American romantic comedy-drama movie. It stars Amanda Seyfried, Chris Egan, Vanessa Redgrave, Gael García Bernal, and Franco Nero. This was the final movie directed by Gary Winick before he died of brain cancer. The movie was released in North America and other countries on May 14, 2010. This movie was inspired by the 2006 non-fiction book, Letters to Juliet, by Lise Friedman and Ceil Friedman. ==Synopsis== When Sophie (Amanda Seyfried), a young American, travels to Verona, Italy — the romantic city where Romeo first met Juliet — she meets a group of volunteers who respond to letters written to Juliet the late wife of romeo ovie was released in North America and other countries on May 14, 2010, and was inspired by the 2006 non- fiction book \"Letters to Juliet\" by Lise Friedman and Ceil Friedman. In the film, Sophie (played by Amanda Seyfried), a young American, travels to Verona, Italy—the romantic city where Romeo first met Juliet. . Sophie finds and answers a letter that has been lost for 50 years, and is stunned when its author Claire (Vanessa Redgrave) arrives in Italy with her handsome but overprotective grandson (Christopher Egan) to find the fiance she left decades before. but juliet is mentoned by sophie when she said Enchanted by Claire's quest, Sophie joins them on an adventure through the beautiful hills of Tuscany searching for Claire's long lost Lorenzo. The journey will change their lives forever, as they discover it's never too late to find true love. with the ghosr of julet == Soundtrack Lists == * \"You Got Me\" – Colbie Caillat * \"Chianti Country\" * \"Verona\" – Andy Georges * \"Un Giorno Così\" – 883 * \"Per Avere Te\" – Franco Morselli * \"Quando, Quando, Quando\" – Laura Jane (as Lisa Jane) and Chris Mann * \"Variations On A Theme By Mozart\" – from The Magic Flute, Opus 9 * \"Sospesa\" – Malika Ayane and Pacifico * \"Per Dimenticare\" – Zero Assoluto * \"Sono Bugiarda (I'm A liar)\" – Caterina Caselli * \"Guarda Che Luna\" – Fred Buscaglione * \"Love Story\" – Taylor Swift * \"What If\" – Colbie Caillat ==References== == Other websites == * * * * * Category:2010 comedy- drama movies Category:2010 romantic comedy movies Category:2010 romantic drama movies Category:American comedy-drama movies Category:American romantic comedy movies Category:American romantic drama movies Category:2010s English-language movies Category:Italian-language movies Category:Movies about vacationing Category:Movies set in Italy Category:Multilingual movies Category:Verona",
 "title": "Letters to Juliet"
}