{
 "id": "317646",
 "text": ", also known as Tembun or Temmon, was a after Kyōroku and before Kōji. This period started in July 1532 and ended in October 1555.Nussbaum, Louis- Frédéric. (2005). \"Tembun\" in Japan encyclopedia, p. 956. During this time, the emperor was Nussbaum, \"Go-Nara Tennō,\" p. 257; Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 372-382. or .Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 372–382. ==Events of the Tenbun era== * 1536 (Tenbun 5, 26th day of the 2nd month): Go-Nara was formally established as emperor.Titsingh, p. 374; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui-no-Rei); retrieved 2012-6-29. * 1542 (Tenbun 11, 25th day of the 8th month): Imagawa Yoshimoto of Suruga Province lost battle with army of Oda Nobuhide.Titsingh, p. 376. * 1543 (Tenbun 12, 25th day of the 8th month): Portuguese ship landed at Tanegashima bringing the first gun into Japan. History of Kagoshima ; retrieved 2011-12-6. * 1543 (Tenbun 13, 7th month): Flooding in Kyoto and nearby areas.Titsingh, p. 377. * 1546 (Tenbun 15, 20th day of the 12th month): Ashikaga Yoshiteru became 13th Shōgun of the Ashikaga shogunate.Titsingh, p. 378. * 1547 (Tenbun 11): Joseon and \"Treaty of Tenbun\" limited trade to Korean port of Pusan.Hall, John Whitney. (1997). The Cambridge History of Japan: Early Modern Japan, p. 249. * 15 August 1549 (Tenbun 18, 22nd day of the 7th month): Jesuit Catholic priest Francis Xavier arrived in JapanCatholic Bishops Conference of Japan, \"An Overview of the History of the History of the Catholic Church in Japan\"; retrieved 2012-4-27. * 1551 (Tenbun 20): The first mechanical clock was brought to Japan by Xavier; and he gave it to Ouichi Yoshitaka.Oosterling, Henk. (1996). Time and Temporality in Intercultural Perspective, p. 96. ==Related pages == * Muromachi period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Tenbun 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 20th 1532 1533 1534 1535 1536 1537 1538 1539 1540 1541 1542 1543 1544 1545 1546 1547 1548 1549 1550 1551 Tenbun 21st 22nd 23rd 24th 1552 1553 1554 1555 Preceded by: Kyōroku Era or nengō: Tenbun Succeeded by: Kōji Category:Japanese eras",
 "title": "Tenbun"
}