{
 "id": "31769",
 "text": "San Antonio is a large city in southern Texas, USA. It is the second most populous city in Texas, with about 1.4 million people. It is the seventh most populous city in the United States. The city is known for The Alamo, and the River Walk along the small small San Antonio River that flows through the middle of the city. It is lined with shops and restaurants. San Antonio is also home to the San Antonio Spurs, which is a basketball team in the NBA. 64% of the population is Hispanic, 23% is white (non-Hispanic), 7% is African- American, 3% is Asian, and 3% other/mixed-race. The main industries of San Antonio are health-care, tourism, and national defense. Besides tourist attractions, the city has many medical centers and military bases. ==Geography== San Antonio is surrounded by Hill Country, Prairie, and the South Texas Plains. ==Climate== San Antonio has a semi-arid climate with characteristics of a humid subtropical climate. Like Austin, rain comes during the spring. ==Culture== San Antonio has a Mexican American culture because it was once a part of Mexico. ==Facts== The Alamo is located here. One of three SeaWorlds is located here, the other two being in Orlando and San Diego. San Antonio is home to two amusement parks, Six Flags Fiesta Texas and SeaWorld San Antonio. ==Neighborhoods== === Downtown === Downtown San Antonio, the city and metro area's urban core, encompasses many of the city's famous structures, attractions, and businesses. The central business district is generally understood to cover the northern half of the \"Downtown Loop\"— the area bordered by Cesar Chavez to the south. Due to the size of the city and its horizontal development, downtown accounts for less than one half of one percent of San Antonio's geographic area. === North Central === North Central is home to several enclaves and upscale neighborhoods including Castle Hills, Hollywood Park, Elm Creek, Inwood, and Rogers Ranch. The area is also the location of upper-middle-class neighborhoods (Deerfield, Churchill Estates, Hunter's Creek, Oak Meadow, and Summerfield). === Northwest Side === Northwest Side is the location of the main campus of the University of Texas at San Antonio, the University of Texas Health Science Center at San Antonio, and the Northwest Campus of the University of the Incarnate Word, which includes the Rosenberg School of Optometry. The Medical Center District is also located in Northwest Side. Companies with headquarters in the area include Valero and NuStar Energy. ===South Side=== The South Side area of San Antonio is characterized for its predominantly Latino and Hispanic neighborhoods, an average above 81 percent. Large growth came to South Side when Toyota constructed a manufacturing plant. Palo Alto College and the Texas A&M; University-San Antonio are located in the area. ===East Side=== East Side San Antonio is home to the San Antonio Stock Show & Rodeo, the AT&T; Center, and the Freeman Coliseum. The area has the largest concentration of Black and African American residents. ==Sports== Club League Founded Venue (capacity) Attendance Titles Championship years UTSA Roadrunners Division I (NCAA) football 2011 Alamodome (65,000) 35,521 0 San Antonio Spurs National Basketball Association 1967 AT&T; Center (18,580) 18,431 4 1999, 2002–03, 2004–05, 2006–07 San Antonio Stars WNBA 1997 AT&T; Center (18,580) 7,850 0 San Antonio Talons Arena Football League 2000 Alamodome (65,000) 7,715 2 2003, 2007 San Antonio Scorpions North American Soccer League 2010 Toyota Field (8,300) 7,074 0 San Antonio Rampage American Hockey League 2002 AT&T; Center (16,000) 6,505 0 == References == == Other websites == Category:1718 establishments Category:18th-century establishments in Mexico Category:County seats in Texas",
 "title": "San Antonio"
}