{
 "id": "317653",
 "text": "Kim Wilson (born January 6, 1951 in Detroit, Michigan) is an American blues singer and harp player. He is best known as the harp player and singer of The Fabulous Thunderbirds. ==Career== He started with the blues in the late 1960s whenhe was a senior at High school. Wilson was tutored by people like Muddy Waters, Jimmie Rogers, Eddie Taylor, Albert Collins, George \"Harmonica\" Smith, Luther Tucker and Pee Wee Crayton. He was influenced by harmonica players like Little Walter, James Cotton, Big Walter Horton, Slim Harpo and Lazy Lester. 1974 he went to Austin, Texas where he and the guitarist Jimmie Vaughan formed The Fabulous Thunderbirds. They became the house band at the blues club, Antone's. There they were the backing band of almost every blues act which came to Austin. In the 1980s they had two hits with \"Tuff Enuff\" and \"Wrap It Up.\" In the early 1990s he started a solo career but still played with the Thunderbirds. He is doing more than 200 concerts in a year playing in blues clubs and at Festivals around the world. ==Discography== ===Solo=== * 1993 Tigerman Antone's * 1994 That's Life Discovery * 1997 Will the Circle Be Unbroken Black Magic * 1997 My Blues Blue Collar Records * 2001 Smokin' Joint M.C. Records * 2003 Lookin' for Trouble Mc ===With The Fabulous Thunderbirds === * 1979 The Fabulous Thunderbirds Chrysalis Records * 1980 What's the Word Benchmark * 1981 Butt Rockin' Benchmark * 1982 T-Bird Rhythm Benchmark * 1986 Tuff Enuff Epic Associated * 1987 Hot Number Epic Associated * 1989 Powerful Stuff Epic Associated * 1991 Walk That Walk, Talk That Talk Epic Associated * 1995 Roll of the Dice Private Music * 1996 Different Tacos Country Town * 1997 High Water Windham Hill Records * 2001 Live CMC International * 2005 Painted On Tone-Cool/Artemis * 2011 Girls Go Wild ==References== Category:1951 births Category:Blues harp players Category:American blues singers Category:American blues musicians Category:Singers from Detroit Category:Musicians from Detroit Category:Living people",
 "title": "Kim Wilson"
}