{
 "id": "317748",
 "text": "Carey Bell (*14 November 1936 in Macon, Mississippi - † 6 May 2007 in Chicago, Illinois) was an American blues musician. He played the harmonica and bass in the Chicago blues style. ==Career== He was born Carey Bell Harrington. As child he liked the music of Louis Jordan. He wanted to play saxophon. The family was to poor to buy one. So he started to play the harmonica. The harmonica is also known as \"Mississippi saxophon. He tought himself to play the instrument. Soon Bell heard the music by the blues harmonica greats: DeFord Bailey, Big Walter Horton, Little Walter and Sonny Boy Williamson I and II. At the age of 13 he joined of his pianist godfather with Lovie Lee's blues band. In September 1956 he went to Chicago where he met Little Walter and his main mentor Big Walter Horton. The tought him some harp playing. To improve the possibility to find a job as musician he learned to play the electric bass. He played bass in several bands . In the late 1960s, he appeared regularly on the west side of Chicago with guitarists Eddie Taylor and Royal Johnson, playing both harmonica and bass. In 1969 Delmark Records released Bells first album Carey Bell's Blues Harp. In the late 1970s and 1971 Bell played with Muddy Waters.Russell, Tony (1997). The Blues: From Robert Johnson to Robert Cray. Dubai: Carlton Books Limited. Later he played for Willie Dixon´s Chicago Blues All-Stars. In 1972 he recorded with Big Walter Horton Big Walter Horton with Carey Bell for Alligator Records. During the 1980s Bell continued to record for various labels and to tour. In 1990 Bell recorded with harpists Junior Wells, James Cotton and Billy Branch Harp Attack!.. Harp Attack is still one of Alligator Records best selling albums. Although he worked a lot for Alligator his first solo album was Deep Down not till 1995. In 1998 he received the Blues Music Award for Traditional Male Artist Of The Year. Second Nature followed in 2004 an album he recorded with his guitarist son Lurrie Bell. Carey Bell died of heart failure on May 6, 2007, in Chicago, Illinois. ==Discography== *1969 Carey Bell's Blues Harp (Delmark) *1973 Last Night (One Way) *1977 Heartaches and Pain (Delmark) *1982 Goin' on Main Street (Evidence) *1983 Son of a Gun (Rooster Blues) *1986 Straight Shoot (Blues South West) *1988 Harpslinger (JSP) *1990 Dynasty! (JSP) *1991 Mellow Down Easy (Blind Pig) *1992 Breakdown Blues-Live (CMA Rec.) with 'The Cat' *1994 Harpmaster (JSP) *1995 Carey Bell & Spike Ravenswood (Saar) *1995 Deep Down (Alligator Records) *1997 Good Luck Man (Alligator Records) *1999 Brought Up the Hard Way (JSP CD 802) *2004 Second Nature (Alligator Records) *2007 Gettin Up: Live at Buddy Guy's Legends Rosa's (Delmark) ===with Louisiana Red=== *1980 Reality Blues (L+R) *1983 Boy from Black Bayou (L+R) *1984 My Life (L+R) *1993 Brothers in Blues (CMA Rec.) *1994 Live at 55 (Enja) *2004 The Blues Masters Bad Case of the Blues (Mojo Tone ) ===Collaborations with other artists=== *1969 Wanna dance all Night, John Lee Hooker (Musidisc) *1972/73 Lake Michigan Ain't No River with Bob Riedy Blues Band *1974 Just Off Halsted with Bob Riedy Blues Band (Flying Fish FF 006) *1980 Blues after Sunrise, Heinz Sauer, Bob Degen (L+R 40017) *1990 Harp Attack! (Alligator) with James Cotton, Junior Wells and Billy Branch *1991 Delta Bluesman, Honeyboy Edwards (Earwig 4922) *1994 Good Candy , Lovie Lee (Earwig 4928) *1996 You Can't Take My Blues, Doug MacLeod (Sledgehammer Blues 2-AQM-1041) *1998 Blues Blues Blues, The Jimmy Rogers All Stars (Atlantic) *2001 Superharps II (Telarc) with Lazy Lester, Raful Neal and Snooky Pryor ==References== Category:Chicago blues musicians Category:Blues harp players Category:1936 births Category:2007 deaths",
 "title": "Carey Bell"
}