{
 "id": "317787",
 "text": "The one-party dominant state is a system of majority rule where one political party has successively won election victories by a very large majority and is, therefore, the dominant ruling party, which does not have to form coalitions (alliances) with other smaller political parties as a result. The one-party dominant state differs from a one-party state, because opposition parties against the dominant ruling party are allowed, but have no real chance of gaining power. Many one-party dominant states are dictatorships where only one party can by law be in control, but some one-party dominant states are real democracies, where there are no limits by law against other parties. A case of this was Mexico, where Presidential candidates (the person running for this governmental office) of the Institutional Revolutionary Party were popularly elected for more than 70 years. In Sweden and Japan, the ruling party lost at least one election but soon won another and returned to power. Another example is South Africa, where the African National Congress has been the ruling party of post-apartheid South Africa since the democratization of the country with the election of Nelson Mandela in the 1994, winning every election since then. During the apartheid era, the National Party of South Africa ruled from 1948 to 1994 and imposed apartheid. In one-party dominant states that are dictatorships, methods are used to suppress other parties, without actually banning them. In some cases state power is used directly and indirectly to prevent smaller parties getting more votes. This can include electoral fraud, gerrymandering or court decisions (which are controlled by the government). In many cases, opposition leaders and other figures are prevented from using the mass media (which are controlled by the government) at election time, and also they often are threatened, harassed, jailed and even killed. In other cases, apart from the government candidates, only candidates from smaller allied parties and \"independent\" candidates who are closely allied to the dominant ruling party, get an overwhelming advantage. This undermines the legitimacy of the ruling party and the system. Russia, Belarus or Azerbaijan are examples of this. In these cases, the defeat of the government \"cannot be expected for the forseeable future\".Suttner R. 2006 Party dominance 'theory': of what value?\", Politikon 33 (3), pp. 277-297. ==References== Category:Political systems Category:Dictatorship",
 "title": "One-party dominant state"
}