{
 "id": "31775",
 "text": "Elizabeth Angela Marguerite Bowes-Lyon (4 August 1900 – 30 March 2002) was Queen of the United Kingdom and the Dominions of the British Commonwealth from 1936 to 6 February 1952 as the wife of King George VI. She was the last Empress of India until the British Raj was dissolved in August 1947. After her husband died, she was known as Queen Elizabeth The Queen Mother, to avoid confusion with her daughter, Queen Elizabeth II. ==Family== Her family belonged to the Scottish nobility. Her father was the 14th Earl of Strathmore and Kinghorne. In 1923, she became known to everyone when she married Albert, Duke of York, the second son of George V and Queen Mary. She was loved by the British people as she became a figure of family life. They had two daughters, the then-Princess Elizabeth and Princess Margaret. She was the first British royal to smile in pictures known as the \"Smiling Duchess\". ==Queen consort== In 1936, her husband unexpectedly became King when her brother-in-law, Edward VIII, abdicated because he wanted to marryAmerican, Wallis Simpson, who had been divorced. The king was known as King George VI. As his wife, she had the title of Queen Consort. She went with her husband on official tours to France and North America. During World War II, she supported the British public with great courage. After the war, the king became ill and died in 1952. She was then 51, and she lived for another 50 years. ==Queen mother== As the mother of the queen, grandmother to the queen's four children , later, great- grandmother, she continued to be a popular member of the British Royal Family. The Queen Mother had an appendectomy in 1964, colon cancer removed in 1966 and breast cancer removed in 1984.The Queen Mother's battles with cancer ===Later years=== The death of her younger daughter Princess Margaret on 9th February 2002 was a sad event for her. She died seven weeks later at the age of 101. She was the first member of the British Royal Family to live past the age of 100. The second member of the British Royal Family to live past 100 was her last surviving sister in law, Princess Alice, Duchess of Gloucester who had died in 2004 aged 102 from a stroke. ==Title and styles== *4 August 1900-16 February 1904: The Honourable Elizabeth Bowes-Lyon *16 February 1904-26 April 1923: Lady Elizabeth Bowes-Lyon *26 April 1923-11 December 1936: Her Royal Highness The Duchess of York *11 December 1936-6 February 1952: Her Majesty The Queen *11 December 1936-14 August 1947: Her Imperial Majesty The Queen- Empress *6 February 1952-30 March 2002: Her Majesty Queen Elizabeth The Queen Mother ==Notes== ==References== Category:Bailiffs Grand Cross of the Order of St John Category:British centenarians Category:Kings and Queens consort of the United Kingdom Category:Royalty from London Category:1900 births Category:2002 deaths Category:Elizabeth II Category:Deaths from bronchitis",
 "title": "Queen Elizabeth The Queen Mother"
}