{
 "id": "317717",
 "text": "was a after Kōji and before Genki. This period started in February 1558 and ended in April 1570.Nussbaum, Louis-Frédéric. (2005). \"Eiroku\" in Japan encyclopedia, p. 172. During this time, the emperor was .Nussbaum, \"Ōgimachi Tennō,\" p. 739; Titsingh, Isaac. (1834). Annales des empereurs du Japon, p. 382-388. == Events of the Eiroku era == * 1560 (Eiroku 3, 1st month): Ōgimachi was formally established as emperor.Titsingh, p. 383; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui-no-Rei); retrieved 2012-6-29. * 12 June 1560 (Eiroku 3, 19th day of the 5th month): at the Battle of Okehazama, the forces of Imagawa Yoshimoto were defeated by Oda Nobunaga.Nussbaum, \"Okehazama Tatakai\" at p. 745. * 1564 (Eiroku 7): Nobunaga took control of , also known as Gifu Castle.Titsingh, p. 385. * 1567 (Eiroku 10): Todai-ji burned in battle led by Matsunaga Hisahide.Naracity Tourist Association, World Heritage ; retrieved 2011-12-8. * 1568 (Eiroku 11): Oda Nobunaga gives land in Heian-kyō for building a Christian churchStead, Alfred. (1906). Great Japan: a Study of National Efficiency, pp. 93-94. which was first called Eiroku-jiRöpke, Ian Martin. (1999). Historical dictionary of Osaka and Kyoto, p. 204. then called Namban-ji.Nussbaum, \"Namban-ji\" in at p. 694. * 1568 (Eiroku 11, 2nd month): Ashikaga Yoshihide became shogun.Titsingh, p. 386. * 1568 (Eiroku 11, 9th month): Shogun Yoshihide died from disease. * 1569 (Eiroku 12): First Christian church opened in Nagasaki.Catholic Bishops Conference of Japan, \"An Overview of the History of the History of the Catholic Church in Japan\"; retrieved 2012-4-27. ==Related pages == * Muromachi period ==References== == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Eiroku 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 1558 1559 1560 1561 1562 1563 1564 1565 1566 1567 1568 1569 1570 Preceded by: Kōji Era or nengō: Eiroku Succeeded by: Genki Category:Japanese eras",
 "title": "Eiroku"
}