{
 "id": "317810",
 "text": "was a after Genki and before Bunroku. This period started in July 1573 and ended in December 1592. During this time, the emperors were and . The nengō Tenshō means \"Heavenly Virtue\". ==Events of the Tenshō era== Oda Nobunaga suggested that a new era should begin in 1573. The general meaning of Tenshō was \"heavenly righteousness\". * 1573 (Tenshō 1, 7th month): Shogun Ashikaga Yoshiaki became a Buddhist priest. * 1576 (Tenshō 3, 5th month): Battle of Nagashino. * 1576 (Tenshō 4): Takeda Katuyori ordered the rebuilding of the Asama Shrine at the base of Mount Fuji in Suruga province.Ponsonby-Fane, Richard. (1962). Studies in Shinto and Shrines, p.462. * 1582 (Tenshō 10): Oda Nobunaga orders the destroyed of structures built by Takeda at the Asama Shrine. * 1582 (Tenshō 10, 3rd month): Battle of Temmokuzan. * 20 February 1582 (Tenshō 10, 28th day of the 10th month):A Jesuit missionary and four Japanese Catholic boys went to Rome to see Pope Gregory XIII. This is sometimes called the \"Tenshō Embassy\". or the \"Boys' Mission of the Tenshō Period\" (Tenshō Shōnen Shisetsu).Cooper, Michael. \"When Four Boys Went to Meet the Pope, 400 Years Ago,\" Japan Times. 21 February 1982; retrieved 2011-12-7. * 1583 (Tenshō 11, 4th month): Battle of Shizugatake. * 1583 (Tenshō 12, 4th month): Battle of Komaki and Nagakute. * 1584 (Tenshō 13, 7th month): Toyotomi Hideyoshi is named kampaku by Emperor Ōgimachi. * 17 December 1586 (Tenshō 14, 7th day of the 11th month): Emperor Ogimachi abdicated; and his grandson received the succession (senso). Soon after, Emperor Go-Yōzei's role as monarch was confirmed (sokui). * 1586 (Tenshō 14, 12th month): A marriage is arranged between the youngest sister of Hideyoshi and Tokugawa Ieyasu. * 1586 (Tenshō 14, 12th month): The kampaku, Toyotomi Hideyoshi, was nominated to be Daijō-daijin. * 1587 (Tenshō 15): Gold or silver coins called Tenshō-tsūhō were minted. The gold coins (Tenshō-ōban) were oval shaped. In 1589-1590 (in the 23rd year of the reign of King Seonjo of Joseon), a diplomatic mission led by Hwang Yun-gil was sent to Japan.Rutt, Richard et al. (2003). Korea: a Historical and Cultural Dictionary, p. 190. The Joseon ambassador was received by Hideyoshi. == In popular culture == The fictional plot of the classic Akira Kurosawa film The Seven Samurai takes place in the 15th year of Tenshō. ==Related pages== * Tenshō (Heian period) == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Tenshō 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 20th 1573 1574 1575 1576 1577 1578 1579 1580 1581 1582 1583 1584 1585 1586 1587 1588 1589 1590 1591 1592 Preceded by: Genki Era or nengō: Tenshō Succeeded by: Bunroku Category:Japanese eras Category:1573 establishments Category:16th- century establishments in Japan Category:1590s disestablishments Category:16th-century disestablishments in Japan",
 "title": "Tenshō (Momoyama period)"
}