{
 "id": "317893",
 "text": "4D, meaning the common 4 dimensions, is a theoretical concept in mathematics. It has been studied by mathematicians and philosophers since the 18th century. Mathematicians who studied four-dimension space in the 19th century include Möbius, Schläfi, Bernhard Riemann, and Charles Howard Hinton. In geometry, the fourth dimension is related to the other three dimensions of length, width, and depth by imagining another direction through space. Just as the dimension of depth can be added to a square to create a cube, a fourth dimension can be added to a cube to create a tesseract. By analogy, the universe of a 2D (two dimensional) being is a plane, but this plane can be said to be in a 3d space. This means there’s an extra direction the 2d being cannot move in or see. One dimension higher, a 3d space could be in a 4d world, and that 4d world would have a direction that cannot be seen or touched. Like with the 2d case, this is because the new direction is not anywhere in the 3d creature’s 3d space. Going into theoretical physics, if we look with high energies, we may be able to see higher dimensions that are looped. The LHC and other particle colliders have tried to do that, but haven’t found any extra dimensions. 4D is also an important idea in physics, developed in the 20th century. In physics, it refers to the idea of time as a fourth dimension, added to the (3D) spatial dimensions. Albert Einstein developed the idea of spacetime by connecting space and time together. The difference is that spacetime is not a Euclidean space, but instead is called \"Minkowski spacetime\", because distances with time are different. 4d also has a new way to turn things, named double rotations. A double rotation is a way to turn all parts of a 4d shape except a single dot. Another completely new thing in 4d related to double rotations are isoclinic rotations, which can turn a 3-sphere kinda like turning a 2d circle. Everywhere on a 3-sphere would move at the same speed, like with the circle. ==Other websites== *The Cube shown in Five Dimensions Category:Geometry Category:Time",
 "title": "4D"
}