{
 "id": "317809",
 "text": "Kenneth Geddes Wilson (June 8, 1936 - June 15, 2013) was an American theoretical physicist and Nobel Prize winner. ==Education== As an undergraduate at Harvard, he was a Putnam Fellow. He earned his PhD from Caltech in 1961, studying under Murray Gell-Mann. ==Works== He became a junior faculty member in Cornell University Physics Department in 1963. He became a full professor in 1970. In 1974, he became the James A. Weeks Professor of Physics at Cornell. He was a co-winner of the Wolf Prize in physics in 1980, together with Michael E. Fisher and Leo Kadanoff. He got the 1982 Nobel Prize in Physics for combining quantum field theory and the statistical theory of critical phenomena of second-order phase transitions. In other words the prize was for his constructive theory of the renormalization group. In this theory he gave not only important, and even numerical, insights to the field of critical statics and dynamics in statistical physics, but indirectly also basic answers to the question: \"What is quantum field theory?\" and \"What does renormalization mean?\". He also gave a constructive answer to another important \"renormalization\" problem from solid-state physics, the Kondo effect. He advocated that the federal government should buy supercomputers for science research. In 1985, he was appointed as Cornell's Director of the Center for Theory and Simulation in Science and Engineering (known now as the Cornell Theory Center, one of five national supercomputer center created by the National Science Foundation. Since 1988, Dr. Wilson has been a faculty member at The Ohio State University. His current research interests include physics education research. Some of his PhD students include Roman Jackiw, Steve Shenker, and Michael Peskin. Wilson's father was the prominent chemist E. Bright Wilson, and his brother David is also a Professor at Cornell in the department of Molecular Biology and Genetics. Wilson died on June 19, 2013 from lymphoma in Saco, Maine, aged 77.Kenneth G. Wilson | 1936-2013: Nobel laureate, OSU physicist dies at 77 ==Awards== *Dannie Heineman Prize for Mathematical Physics, 1973 *Boltzmann Medal, 1975 *Wolf Prize, 1980 *Harvard University, D.Sc (Hon.), 1981 *Caltech, Distinguished Alumni Award, 1981 *Franklin Medal, 1982 *Nobel Prize for Physics, 1982 *A.C. Eringen Medal, 1984 *Aneesur Rahman Prize, 1993 ==Literature== *Wilson, K. G. \"Broken Scale Invariance and Anomalous Dimensions\", Stanford Linear Accelerator Center (SLAC,)Stanford University, Laboratory of Nuclear Studies, Cornell University, United States Department of Energy (through predecessor agency the Atomic Energy Commission), (May 1970). *Gupta, R.; Wilson, K. G.; & C. Umrigar. \"Improved Monte Carlo Renormalization Group Method\", Los Alamos National Laboratory (LANL), Cornell University, United States Department of Energy, (1985). *Wilson, K. G.:Problems in physics with many scales of length, Scientific American, August 1979 *the same:The Renormalization group (RG) and critical phenomena 1, Physical Review B, volume 4, 1971, p. 3174 *the same: The renormalization group: critical phenomena and the Kondo problem, Reviews of modern physics, 47, 1975, p. 773-839 *the same, and M. Fisher: Critical exponents in 3.99 dimensions, Physical Review Letters, 28, 1972, p. 240 *the same: Non-lagrangian models in current algebra Physical Review, 179, 1969, p. 1499-1512 (operator product expansion) *the same: Model of coupling constant renormalisation, Physical Review D, 2, 1970, p. 1438–1472 *the same: Operator product expansions and anomalous dimensions in Thirring model, ibid., p. 1473–77 *the same: Anomalous dimensions and breakdown of scale invariance in perturbation theory, ibid. p. 1478–93 *the same: RG and strong interactions Physical Review D, 3, 1971, p. 1818–46 *the same: Confinement of quarks, Physical Review D, 10, 1974, p. 2445–59 ==References== ==Other websites== * Photograph, Biography and Bibliographic Resources, from the Office of Scientific and Technical Information, United States Department of Energy * Kenneth G. Wilson * Kenneth G. Wilson's Homepage (on Archive, the original at Ohio State University no longer exists) * Kenneth G. Wilson's brief CV, from Ohio State University (PDF file) * Publications on ArXiv * Nobel Lecture * Interview with Ken Wilson in 2002 Category:1936 births Category:2013 deaths Category:Cornell University faculty Category:American Nobel Prize winners Category:Harvard University alumni Category:Scientists from Massachusetts Category:American theoretical physicists Category:Wolf Prize winners Category:Ohio State University",
 "title": "Kenneth G. Wilson"
}