{
 "id": "317944",
 "text": "was a after Genna and before Shōhō. This period started in February 1624 and ended in December 1643. During this time, the emperors and empress were , and . The nengō Kan'ei means \"Permanent Liberality\". ==Events of the Kan'ei era== * 1625 (Kan'ei 2): Founding of Kan'ei-ji, which is a Buddhist temple in Ueno. * 4 November 1626 (Kan'ei 3, 16th day of the 9th month): Emperor Go-Mizunoo visited to Nijō Castle.Ponsonby-Fane, Richard. (1956). Kyoto: the Old Capital of Japan, 794–1869, p. 317. * 22 December 1629 ( Kan'ei 6, 8th day of the 11th month): Go-Mizunoo abdicated; and his daughter received the succession (senso). Soon after, Empress Meishō's role as monarch was confirmed in ceremonies (sokui). * 14 March 1632 (Kan'ei 9, 24th day of the 1st month): Former Shogun Tokugawa Hidetada died. * 28 February 1633 (Kan'ei 10, 20th day of the 1st month): There was an earthquake in Sagami Province. * 1634 (Kan'ei 11, 7th month): Shogun Tokugawa Iemitsu visited the new empress in her court; and he visited ex-emperor Go-Mizunoo. * 1635 (Kan'ei 12): Ambassador from the King of Korea was received in Heian-kyō. * 1636 (Kan'ei 13): Coins were minted which stayed in use until 1853. * 1637 (Kan'ei 14): Christian rebellion at Shimabara Castle. * 1638 (Kan'ei 15): Christian religion was made illegal in Japan. * 1643 (Kan'ei 20): An ambassador from the king of Korea was received in Heian-kyō. * 10 November 1643 (Kan'ei 20, 29th day of the 9th month): In the 15th year of Empress Meishō's reign (明正天皇15年), the empress abdicated; and her brother became Emperor Go-Komyō in ceremonies of senso and sokui. Hayashi Razan and his son wrote Kan'ei shoka kezuden in 1641-1643. The shogun ordered the writing of this history of the great clans of Japan. ==Related pages == * Edo period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection * Bank of Japan (BOJ): Kan'ei Tsuho , Bunsen (copper coin = one mon) Kan'ei 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 20th 1624 1625 1626 1627 1628 1629 1630 1631 1632 1633 1634 1635 1636 1637 1638 1639 1640 1641 1642 1643 Kan'ei 21st 1644 Preceded by: Genna Era or nengō: Kan'ei Succeeded by: Shōhō Category:Japanese eras Category:1624 establishments Category:17th- century establishments in Japan Category:1640s disestablishments Category:17th-century disestablishments in Japan Category:1640s disestablishments in Asia Category:1620s establishments in Asia",
 "title": "Kan'ei"
}