{
 "id": "317914",
 "text": "The Blues Band is a British blues band. The band was formed in 1979 by veteran musicians of British blues of the 1960s. ==Band history== The band was formed in 1979. In the 1960s Paul Jones and Tom McGuinness played for Manfred Mann. Jones worked also as actor and radio DJ.As a harmonica man, he has performed publicly and/or recorded with Memphis Slim, Alexis Korner, Henry Gray, Alvin \"Youngblood\" Hart, Susan Tedeschi, Eric Bibb and Otis Grand. Hughie Flint was the drummer of John Mayall's Bluesbreakers. Together with McGuinness he later formed McGuiness Flint who had a hit with \"When I´m dead and gone\". Dave Kelly was guitarist in the John Dummer Blues Band and in the touring bands of Howlin' Wolf and John Lee Hooker. They played together mostly in London pubs just for fun about playing rhythm ´n blues. Their first album \"The Official Blues Band Bootleg Album\" raised no interest with record labels, so they sold it during concerts and via mail order. The record was a fine mixture of blues standards and own songs. Arista signed with the band and the album reached #40 in the charts. 1982 Hughie Flint left the band and was replaced by Rob Townsend. In 1983 they parted but they came together soon. When not playing with the Blues Band Jones, McGuinness and Townsend are playing with \"The Manfreds\". The band can be seen as the 1960s Manfred Mann Band without the leader. Dave Kelly plays often with his \"The Dave Kelly Band\". By playing a lot of concerts all over Europe they had and still have a lot of fans. Till present they recorded over 20 albums. It is said, that three generations of a family can be seen in their concerts. == Discography(album) == *1980: The Official Blues Band Bootleg Album *1980: Ready *1981: Itchy Feet *1982: Brand Loyalty *1983: Bye Bye Blues (Live) *1986: These Kind of Blues *1989: Back for More *1991: Fat City *1993: Homage *1995: Wireless *1996: Live at the BBC *1997: 18 Years Old & Alive *1999: The Best of the Blues Band (USA) *2000: Brassed Up *2001: Scratchin' on My Screen *2002: Stepping Out *2004: Be My Guest *2004: The Official Gary Fletcher Bootleg Album (demos) *2005: Blues Band Box (4-CD-Kompilation) *2005: These Kind of Blues *2006: Thank You Brother Ray *2009: Live! *2009: Wire Less ==Singles== * Come on in/The Blues Band Song (1980) * Find yourself another Fool/SUS Blues (1980) * Nadine/That's all right (1980) * Who's right, who's wrong?/Itchy Feet (1981) * Come on/Green Stuff (1981) * Take me Home/So bad (1982) * Hey Hey Little Girl/SUS Blues (1982) - limitierte live single * Seemed like a good Idea/Rolling Log (1982) * Blue Collar/Duisburg Blues (1989) == DVD == * Across Borders -Live (2004) * Steppin' Out on Main (2005) ==Quotes== *\"The music industry doesn’t bother us and we don’t bother them.\" (Gary Fletcher) == Reading== *Roy Bainton: Talk to Me Baby - The Story of the Blues Band, Firebird Books, ==Other websites== *The Blues Band *The Blues Band Rockpalast-Archiv (German) *Homepage Gary Fletcher ==References== Category:Blues bands",
 "title": "The Blues Band"
}