{
 "id": "318141",
 "text": "New Zealand at the Olympics is a history which began in 1908. The International Olympic Committee's official abbreviation for New Zealand is NZL. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-10-12. ==History== A team from New Zealand was first at the Olympic Games in 1908. They have been in every Summer Olympic Games since then. For their first two Games in 1908 and 1912, New Zealand was with Australia in a combined Australasia team. New Zealand first sent an independent team in 1920. New Zealand has been in most Winter Olympic Games since 1952, missing only the 1956 and 1964 Games. New Zealand athletes have won a total of 103 medals at the Summer Games. The most successful sport is athletics. New Zealand has only won a single medal at the Winter Games. The silver medal won by Annelise Coberger in alpine skiing at the 1992 Winter Olympics was the first medal won at the Winter Games by a Southern Hemisphere nation. == National Olympic Committee == The New Zealand Olympic Committee (NZOC) is the National Olympic Committee for New Zealand. The NZOC was formed in 1911, and recognized by the IOC in 1919. == Participation == Being in the remote South Pacific, New Zealanders had to take long sea voyages to attend the early Olympics. It wasn’t until 1920 that New Zealand sent its first team. Before that three New Zealanders won medals for Australasian teams in 1908 and 1912. As of 1111 athletes have represented New Zealand at the Olympic Games. ==Medal tables== ===Medals by Summer Games=== 1908 London as part of Australasia as part of Australasia as part of Australasia as part of Australasia 1912 Stockholm as part of Australasia as part of Australasia as part of Australasia as part of Australasia 1920 Antwerp 0 0 1 1 1924 Paris 0 0 1 1 1928 Amsterdam 1 0 0 1 1932 Los Angeles 0 1 0 1 1936 Berlin 1 0 0 1 1948 London 0 0 0 0 1952 Helsinki 1 0 2 3 1956 Melbourne/Stockholm 2 0 0 2 1960 Rome 2 0 1 3 1964 Tokyo 3 0 2 5 1968 Mexico City 1 0 2 3 1972 Munich 1 1 1 3 1976 Montreal 2 1 1 4 1980 Moscow 0 0 0 0 1984 Los Angeles 8 1 2 11 1988 Seoul 3 2 8 13 1992 Barcelona 1 4 5 10 1996 Atlanta 3 2 1 6 2000 Sydney 1 0 3 4 2004 Athens 3 2 0 5 2008 Beijing 3 2 4 9 2012 London 6 2 5 13 2016 Rio de Janeiro 4 9 5 18 Total 46 27 44 117 The total (NZ) does not include the medals won by New Zealanders as part of the combined Australasia team (ANZ) at the 1908 Summer Olympics and 1912 Summer Olympics: * bronze medal won by Harry Kerr in Men's 3500 metre walk in Athletics * gold medal won by Malcolm Champion as a member of the Men's 4x200 metre freestyle relay in Swimming * bronze medal won by Tony Wilding in Indoor men's singles in Tennis ===Medals by Winter Games=== 1952 Oslo 0 0 0 0 1956 Cortina d'Ampezzo did not participate did not participate did not participate did not participate 1960 Squaw Valley 0 0 0 0 1964 Innsbruck did not participate did not participate did not participate did not participate 1968 Grenoble 0 0 0 0 1972 Sapporo 0 0 0 0 1976 Innsbruck 0 0 0 0 1980 Lake Placid 0 0 0 0 1984 Sarajevo 0 0 0 0 1988 Calgary 0 0 0 0 1992 Albertville 0 1 0 1 1994 Lillehammer 0 0 0 0 1998 Nagano 0 0 0 0 2002 Salt Lake City 0 0 0 0 2006 Turin 0 0 0 0 2010 Vancouver 0 0 0 0 Total 0 1 0 1 ==Related pages== * List of IOC country codes == References == == Other websites == *New Zealand at Olympic.org *Athletics in the 1966 Encyclopaedia of New Zealand has a paragraph on each Olympiad and Empire Games to 1964 *The Olympics (NZHistory.net.nz) *The Joseph Romanos list of our best Olympians *Medal Count for NZ at DatabaseOlympics.com (total of 78 not complete) Category:Nations at the Olympics Category:Sport in New Zealand Category:National sports teams of New Zealand",
 "title": "New Zealand at the Olympics"
}