{
 "id": "318397",
 "text": "is a Japanese naval officer, academic, writer and senior fellow in the Asia Center at Harvard University.Schorow, Stephanie. \"Crisis in Japan: The Way Forward,\" Harvard Gazette. March 24, 2011; retrieved 2011-12-11. ==Early life== Koda was born in December 1949 at Tokushima Prefecture. He studied at the Defense Academy at Yokosuka in 1968-1972.King's College London , Yoji Koda bio note ==Career== Koda served on several JMSDF ships, including the Yudachi (DD-108), the Shirayuki (DD-123), and the Sawayuki (DD-125). ===Timeline=== * 1973: Commissioned as Ensign in the or JMSDF * 1982-1984: Exchange officer at United States Naval Academy * 1983: Lieutenant Commander * 1987: Commander * 1990-1991: Commanding Officer, Destroyer Sawayuki (DD-125) * 1991-1992: Naval Command College at U.S. Naval War College * 1997: Rear Admiral * 1997-1999: Chief of Staff, Commander Fleet Escort Force Harvard University, Fairbanks Center for Chinese Studies , \"Recent Developments in China's Naval Modernization and Foreign Policy Activism,\" April 2011; retrieved 2011-12-11. * 2003: Vice Admiral * 2005-2007: Commandant, Sasebo JMSDF District * 2007-2008: Commander in Chief, Self Defense Fleet Admiral Koda retired from JMSDF in August 2008. ==Selected works== * \"The Russo-Japanese War: Primary Causes of Japanese Success,\" Naval War College Review (Spring 2005) * \"A New Carrier Race? Strategy, Force Planning, and JS Hyuga,\" Naval War College Review (Summer 2011) ==Honours== * Griffith Asia Institute in Brisbane, Australia: 2011 Synnot LectureKoda, Yoji. \"The US-Japan Alliance and the Changing Power Balance in Asia,\" May 2011; retrieved 2011-12-11. ==References== == More reading == * Chun, Tarryn. \"Profile: Retired Vice- Admiral Yoji Koda, Asia Center Senior Fellow, 2009-2011,\" Harvard Asia Newsletter (Winter 2010), p. 5\\. Category:1949 births Category:Living people Category:Japanese admirals Category:Japanese academics Category:Japanese writers Category:People from Tokushima Prefecture",
 "title": "Yoji Koda"
}