{
 "id": "318320",
 "text": "The Emeishan Traps is a flood basalt volcanic province in Southwestern China, around Sichuan province. Many igneous rock types can be found there. This is known as large igneous province in geology. Other names for the traps include Permian Emeishan Large Igneous Province, and other variations. The Traps are the step-like rock made up of many layers of basalt, which were laid down by successive eruptions of magma. The eruptions that lead to the Emeshian traps began about 260 million years ago. The traps are much smaller than the Siberian Traps, which occurred not long afterwards, about 251 million years ago. Despite this, the Emeshian traps were large enough to have an impact on the ecology of the time, and on paleontology. They are part of the mass extinction events towards the end of the Permian period.He Bin et al 2007. Age and duration of the Emeishan flood volcanism, SW China: geochemistry and SHRIMP zircon U-Pb dating of silicic ignimbrites, post-volcanic Xuanwei Formation and clay tuff at the Chaotian section. Earth and Planetary Science Letters, 255, 306–323, 2007 (Summary)Shu-zhong Shen et al 2011. Calibrating the end-Permian mass extinction. Science, DOI:10.1126/science.1213454, 2011 (Summary) The Emeishan Traps are part of the scientific debate on the causes of mass extictions.Yukio Isozaki 2007. Plume winter scenario for biosphere catastrophe: the Permo-Trassic boundary case, in: Yuen et al Superplumes: beyond plate tectonics. Springer, New York. 409-440. The end-Guadalupian extinction occurred at almost the same time as the Emeshian Traps were formed. This supports the argument, that volcanism is the main driving force behind mass extinctions. Another theory that has been proposed to explain mass extinctions is that meteor or comet impact events caused them. In this context, the hypothesis is that impact events cause flood basalt eruptions, such as those which generated the Emeshian Traps.Adrian P. Jones et al 2003. Impact decompression melting: a possible trigger for impact induced volcanism and mantle hotspots?, in: Koeberl and Martinez-Ruiz eds. Impact markers in the stratigraphic record. Springer, New York. 91-120; esp. 110-11. This hypothesis is not widely supported. == References == * Dobretsov N.L. 2005. Large igneous provinces of Asia (250 Ma): Siberian and Emeishan traps (plateau basalts) and associated granitoids. Geologiya i geofizika. 46, 870-890. * He, Bin et al 2003. Sedimentary evidence for a rapid kilometer-scale crustal doming prior to the eruption of the Emeishan flood basalts. Earth and Planetary Science Letters. 213, 391-405. Category:Extinction events Category:Flood basalts Category:Large igneous provinces Category:Geography of the People's Republic of China",
 "title": "Emeishan Traps"
}