{
 "id": "318404",
 "text": "The Porsche 911 is a luxury two-door sports car made by Porsche AG to replace the Porsche 356 since 1964, in Stuttgart. Now in its eighth generation (992) In 1964 it used to be called as, Porsche 901 but, due to trademark problems with Peugeot, Porsche changed the name to Porsche 911 before it went on sale. Every 911 engine was placed in the rear of a car, which makes it iconic since then. The Porsche 911 was mostly known for fun-to-drive cars that can be used daily, but because the engine was placed at the rear of the car, make it often unstable and hard to control for early models. Porsche 911 was thought to be one of the longest-running car models. The Original (1963-1973) The original 911 was designed as a larger, more practical version of the Porsche 356 with an extra pair of seats. As such, critics were quick to pounce on its lack of focus. G-series (1973-1989) The G-Series also known as \"930 Generation \" ran for a long time, too, starting in 1973 and only being replaced in 1989. The most significant move made in this time was the introduction of turbocharging to the 911, the Turbo you see above arriving in 1975 with a mighty 260bhp powering the rear wheels. Making the 911 Turbo the most powerful car on the market.964 (1989-1994) The 964 arrived at the very end of the 1980s, with a little design change and more modern technology, such as the ABS and airbags. 993 (1994-1998) Five years after the 964, the 993 was put onto the production run. It’s the last Porsche with an air-cooled engine. The highest model able to buy are the 911 GT2 (993) , a powerful badge that’s defined Porsche racing and race cars since then. 996 (1998-2004) The first water-cooled engine 911, with many technologies put into the car. The interior was improved a lot compared to the “993” Therefore, it’s the most hated Porsche 911 with a very cheap second-hand price, because of its “Fried Egg Headlight” car experts often thought it ruined the iconic design that Porsche keeps the same for a long time. 997 (2004-2011) Porsche has done their homework well, Round headlights come back to the 911 again. Similar shape to the 996 but with more technology and more safety for drivers. Also, it’s the last Porsche 911 Turbo that you can get with a manual transmission. 991 (2011-2018) The 991 was made from 2011 to 2019. It kept the classic 911 shape but was larger and more modern than older models. This is the last Porsche 911 Carrera or “base model” with naturally aspirated engine 992 (2018-Now) 992 started in 2019 and is the newest version of the 911. It looks similar to older models but is wider and more high-tech. All Carrera models use turbocharged flat-six engines. The 992 also has hybrid-ready, but no hybrid model yet. It is one of the best sports cars today, keeping the 911’s tradition while adding modern performance. Category:Sports cars 911",
 "title": "Porsche 911"
}