{
 "id": "318401",
 "text": "Tawakel KarmanTawakel Karman Tawak[k]ul Karmān (born 7 February 1979) came to international attention as a leader in the 2011 Yemeni uprising, part of the Arab Spring. Yemenis have called her \"Iron Woman\" and \"Mother of the Revolution.\" She won the 2011 Nobel Peace Prize with two other women. She is the first Yemeni and the first Arab woman to win the prize. She is the second Muslim woman to win any Nobel Prize and the youngest Nobel Peace Laureate. ==Journalist, politician, and rights worker== Karman is a journalist. She is also politician and senior member of the of Al-Islah political party. She is also works to improve human rights. She is one of the people who started the group \"Women Journalists Without Chains\". She became well known in Yemen after 2005. As a journalist, she helped a mobile phone news service after the government did not give them a license. She led protests for press freedom and organized weekly protests for reform. She lead the Yemini protests to support the Arab Spring after the Tunisian people overthrew the government of Zine El Abidine Ben Ali in January 2011. She has opposed President Ali Abdullah Saleh and thinks he should not be president any longer. ==Personal== Karman earned a college degree in commerce from the University of Science and Technology, Sana'a. She also completed a graduate degree in political science from the University of Sana'a. She is married to Mohammed al-NahmiTom Finn. \"Middle East/Yemen: Undaunted by death threats: the thorn in Saleh's side.\" The Guardian, 26 March 2011. Retrieved 8 October 2011 from the Lexis Nexis Database. ==Spelling her name in English== Tawakel is sometimes spelled differently in English, for example: Tawakul, Tawakkol, Tawakkul or Tawakel Abdel-Salam KarmanEvening Times (Glasgow). Arrest Sparks Protest. 24 January 2011. Retrieved 8 October 2011 from the Lexis-Nexis Database.Emad Mekay. Arab Women Lead the Charge. Inter Press Service (Johannesburg), 11 February 2011. Retrieved 8 October 2011 from the Lexis-Nexis Database. ==Some of her writing in English== Karman, Tawakkol. \"Our revolution's doing what Saleh can't - uniting Yemen.\" The Guardian, 9 April 2011. Karman, Tawakkol. \"Yemen’s unfinished revolution.\" New York Times, 18 June 2011. Karman, Tawakkol. \"The world must not forsake Yemen's struggle for freedom.\" The Guardian, 1 November 2011. (Includes a link to the Arabic version.) Karman, Tawakkol. \"Tawakkol Karman - Nobel Lecture.\" Nobelprize.org. 10 Dec 2011. (Includes links to the English, Norwegian, and Arabic versions.) ==Related pages == * List of Nobel Prize winners by country * Leymah Gbowee * Ellen Johnson-Sirleaf ==References== == Other websites == * Renowned activist and press freedom advocate Tawakul Karman , interviewed by Nadia Al-Sakkaf, Yemen Times, 17 June 2010 * Tawakel Karman interview with Al Jazeera * Press Conference of 2011 Nobel Laureate, Tawakkul Karman Women's eNews. * Tawakkol Karman's Official Facebook * Tawakkol Karman's official Twitter * Tawakkol Karman's Official website Category:1979 births Category:Living people Category:Human rights activists Category:Asian journalists Category:Yemeni politicians Category:21st-century writers",
 "title": "Tawakel Karman"
}