{
 "id": "318591",
 "text": "Pororo the Little Penguin () is a Korean animated children's television series planned by Iconix Entertainment. Each season has 52 episodes and three seasons have been aired in South Korea until now. The first series was aired in 27 November 2003 on the Korean channel, EBS. About 110 countries imported Pororo and aired it. Pororo is so loved by children in South Korea, and he is perceived as an idol of children, so he is called Bbo-tong-ryung () which means president Pororo. == Characters == Pororo - The main character of this animation. He is little blue penguin. He always acts on impulse, because he is very curious. He is obsessed about unusual stuff. He enjoys adventures and challenges. Crong - A little dinosaur who is found in the snow. He is a troublemaker. He wants to know many things and do many things. Eddy - A little fox who wants to be a scientist. He invents many things that cause problems. He shows off himself and his inventions. Rody - A robot who is strong. He has arms and legs stretch. Eddy made Rody, imitating before. Poby - A big polar bear. He is so kind that he is always there to help his friends when they are in trouble. Tongtong - A little dragon who has magical powers. He can fly and transform before. He appears in the animation from the third series. Loopy - A little beaver. She is a crybaby who is very timid. However, she is nice to her friends and takes care of them. Petty - A little female penguin. She is good at sports although bad at cooking. Harry - A little bird who is pleasant. Even though he is tone-deaf, he enjoys singing. He always brightens up the atmosphere. Popo and Pipi - Funny aliens. Popo is timid and feminine, and Pipi is eager and outgoing. Category:2000s animated television series Category:2000s children's television series Category:2010s animated television series Category:2010s children's television series Category:2020s animated television series Category:2020s children's television series Category:2003 establishments in South Korea Category:2003 television series debuts Category:Cartoonito Category:Fictional penguins Category:South Korean animated television series",
 "title": "Pororo the Little Penguin"
}