{
 "id": "318589",
 "text": "Steven Chu (born February 28, 1948) is an American physicist. He was the 12th United States Secretary of Energy from 2009 to 2013. Chu is known for his research at Bell Labs in cooling and trapping of atoms with laser light, which won him the Nobel Prize in Physics in 1997, along with his scientific colleagues Claude Cohen-Tannoudji and William Daniel Phillips. Chu is the first Nobel Prize winner and the second Chinese American to hold a post in the United States Cabinet. Before becoming the United States Secretary of Energy, he was a professor of physics and molecular and cellular biology at the University of California, Berkeley. He was also the director of the Lawrence Berkeley National Laboratory. Before teaching at Berkeley, he was a professor of physics at Stanford University. He has argued for more research into alternative energy and nuclear power. He thinks the world should shift away from fossil fuels to help with climate change.Sarah Jane Tribble, 'Nuclear: Dark horse energy alternative,' Oakland Tribune, 2007-06-18. For example, he discusses a global \"glucose economy\". This is a form of a low-carbon economy, in which glucose from tropical plants is shipped around like oil is today. ==Early life== Chu was born in St. Louis, Missouri. He has ancestry from Taicang, Jiangsu. He attended and graduated from Garden City High School. He received both a B.A. in mathematics and a B.S. in physics in 1970 from the University of Rochester. He went on to earn his Ph.D. in physics from the University of California, Berkeley, in 1976. ==Career== He wrote a paper on gravitational redshift published in Nature (463, 926-929) in Feb 2010A precision measurement of the gravitational redshift by the interference of matter waves Nature 18-Feb-2010. According to Nature he worked on this \"during nights, weekends and on planes - after putting in 70-80 hours a week as energy secretary\" (Nature 463 p867) and a second one co-authored in July 2010. Under his leadership in 2010 the Department of Energy updated the water usage regulations on toilets and showers. ==Secretary of Energy== His nomination to be Secretary of Energy was unanimously confirmed by the United States Senate on January 20, 2009. On January 21, 2009, Chu was sworn in as Secretary of Energy in the Barack Obama administration. In March 2011 Chu said that federal regulators should not delay approving licenses for construction for planned U.S. nuclear power plants because of the Fukushima nuclear disaster. \"I think those things can proceed\", Chu told reporters on Capital Hill, referring to construction license applications pending at the U.S. Nuclear Regulatory Commission. In August 2011, Chu praised an advisory panel’s report on curbing the environmental risks of natural-gas development. Chu responded to the panel’s report on hydraulic fracturing. Hydraulic fracturing breaks up rock to get more oil and gas out of the ground. The report recommendations include: greater data collection of air and water data, “rigorous” air pollution standards and mandatory disclosure of chemicals used in the hydraulic fracturing process. “The report ... recommends a range of tools for implementing these measures, including regulation, continuous improvement in best practices by industry, and ongoing research and development,” Chu said in a statement. “I will be working closely with my colleagues in the Administration to review the recommendations and to chart a path for continued development of this vital energy resource in a safe manner,” he added. Republicans in Congress have accused Chu for changing a US$535 million federal loan to Solyndra, an energy company. When the company went bankrupt in 2011, the government lost the money. A House Energy and Commerce subcommittee asked Chu in 2011 about the loan.http://articles.sfgate.com/2011-11-20/opinion/30423943_1_ceo-brian- harrison-solyndra-loan-steven-chu On February 12, 2013, Chu was the designated survivor during the State of the Union address. On February 1, 2013, Chu announced his plans to resign. In his resignation announcement, he warned of the risks of climate change. He resigned on April 22, 2013. ==References== ==Other websites== *Secretary of Energy Steven Chu at United States Department of Energy *The Nobel Prize in Physics 1997 from Nobel Prize with biography, lecture, diploma, photos, symposia and links *Bio from Lawrence Berkeley National Laboratory **Energy@Berkeley: Solutions for Global Warming, University of California, Berkeley, November 13, 2007 includes link to event on YouTube **BP Makes Berkeley World Center for Biofuels press release on the BP collaboration February 16, 2007 **Alternative Energy Sources March 28, 2005, Chu's PowerPoint presentation *Boulder’s physicists give Chu thumbs-up Article on other Nobel laureates' reactions to Chu as secretary of energy *Biography and Bibliographic Resources, from the Office of Scientific and Technical Information, United States Department of Energy *UCTV Programs with Steven Chu **Physics Meets Biology **Berkeley's Nobel Tradition **Holding on to Atoms and Molecules with Lasers: Laser Cooling - From Atomic Clocks to Watching Biomolecules Move **What Can Physics Say About Life? **Conversations with History: A Scientist's Random Walk, with Steven Chu *Bio and personal page from Stanford University Department of Physics **Steven Chu: Uncovering the secret life of molecules from Stanford [Online] Report (July 16, 1997) *Chu's biophysics research group at University of California, Berkeley **Growing energy: Berkeley Lab's Steve Chu on what termite guts have to do with global warming from UC Berkeley News (September 30, 2005) * March 12, 2008 *\"Climate Disasters a 'Significant Possibility' Interview with Steve Chu at Copenhagen Climate Council, November 3, 2008. *Interview with Steven Chu from \"Growing Energy\" from the PBS series e² energy **Interview, April 19, 2009 * Category:1948 births Category:Living people Category:American Nobel Prize winners Category:American physicists Category:Politicians from St. Louis, Missouri Category:Scientists from St. Louis, Missouri Category:United States Secretaries of Energy Category:University of Rochester alumni Category:Democratic Party (United States) politicians Category:Stanford University faculty Category:University of California, Berkeley faculty Category:Educators from St. Louis, Missouri",
 "title": "Steven Chu"
}