{
 "id": "318803",
 "text": "Since its beginning, Christianity has been criticized by people in all professions and by people of all other religions. The reason for the criticism varies: many Christians have followed the Bible in criticising homosexuality, abortion and many other hot button issues. Also, Christianity may be rejected because of lack of interest (due to abuse of Christianity) or some just prefer to not convert into it. ==Criticism of writings== Beginning with the Enlightenment, in the 18th century, people began to apply methods of text criticism they had also applied to other documents, and philosophical writings.Browning, W.R.F. \"[/doc/1O94-biblicalcriticism.html Biblical criticism.]\" _A Dictionary of the Bible_. 1997. Encyclopedia.com. 8 Apr. 2010 This form of criticism uses reason, rather than revelations to study texts. There are four primary types of Biblical criticism: form, traditional, higher and lower criticism.Robinson, B.A. \"Biblical Criticism, including Form Criticism, Tradition Criticism, Higher Criticism, etc.\" Ontario Consultants on Religious Tolerance, 2008. Web: 8 Apr 2010. Biblical Criticism, including Form Criticism, Tradition Criticism, Higher Criticism, etc. *Form criticism tries to find the earlier oral traditions on which the texts were based. *Tradition criticism studies the Bible and looks at how traditions have changed over time. * Higher criticism: the study of the sources and literary methods employed by the biblical authors.Mather, G.A. & L.A. Nichols, \"Dictionary of Cults, Sects, Religions and the Occult,\" Zondervan (1993) (quoted in Robinson, B.A. \"Biblical Criticism, including Form Criticism, radition Criticism, Higher Criticism, etc.\" Ontario Consultants on Religious Tolerance, 2008. Web: 8 Apr 2010. http://www.religioustolerance.org/chr_hcri.htm *Lower criticism: the discipline and study of the actual wording of the Bible; a quest for textual purity and understanding. Conservative Christians, as well as much of Orthodox Judaism and Karaite Judaism, support the idea that the Bible is historically accurate. Moderate and liberal Christians generally think the Bible texts are historical, and reliable. They do however think that certain passages should not be read literally, but metaphorically. ==References== Category:Controversies",
 "title": "Criticism of Christianity"
}