{
 "id": "318855",
 "text": "was a after Kaei and before Man'en. This period started in November 1854 and ended in March 1860.Nussbaum, Louis-Frédéric. (2005). \"Ansei\" Japan Encyclopedia, p. 33. During this time, the emperor was .Nussbaum, \"Kōmei Tennō,\" p. 553. The nengō Ansei means \"tranquil government\".Satow, Ernest Mason. (1905). Japan 1853-1864, Or, Genji Yume Monogatari, p. 11. == Events of the Ansei era == * 1854 (Ansei 1): The Ansei-Tōkai Quake (安政東海地震, Ansei Tōkai Jishin) was an 8.4 magnitude earthquake which struck on December 23, 1854. The epicenter ranged from Suruga Bay to the deep ocean, and struck primarily in the Tōkai region, but destroyed houses as far away as in Edo. The accompanying tsunami caused damage along the entire coast from the Bōsō Peninsula in modern-day Chiba prefecture to Tosa province (modern-day Kōchi prefecture)_____. (2007). in , p. 253. * 1854 (Ansei 1): The Ansei-Nankai Quake (安政南海地震, Ansei Nankai Jishin) was an 8.4 magnitude earthquake which struck on December 24, 1854. Over 10,000 people from the Tōkai region down to Kyushu were killed. * 1855 (Ansei 2): After the Imperial Palace was destroyed by fire in 1854 (Kaei 7), it was re-built in nine months.Ponsonby-Fane, Richard. (1956). Kyoto: The Old Capital of Japan, 794-1869. p. 324. * 1855 (Ansei 2, 21st day of the 11th month): The emperor moved in a grand procession from the Katsura Palace to the newly completed palace in Kyoto. * 11 November 1855 (Ansei 2): Great Ansei Earthquake in Edo.Smits, Gregory. \"Shaking up Japan: Edo Society and the 1855 Catfish Picture Prints\" , Journal of Social History, No 39, No. 4, Summer 2006. Epicenter -- (Latitude: 36.000/Longitude: 140.000), 6.9 magnitude on the Richter Scale.NOAA/Japan \"Significant Earthquake Database\" -- U.S. National Oceanic and Atmospheric Administration (NOAA), National Geophysical Data Center (NGDC) * 15 November 1857 (Ansei 4): Nagasaki Medical School was opened. Dr. Pompe van Meerdevoort gave the first formal public lecture at the new school.Whitney, Willis Norton. (1885). \"Notes on the history of medical progress in Japan\", Transactions of the Asiatic Society of Japan, pp. 841-842. * 1858-1860 (Ansei 4-Ansei 6): Cholera killed between 100,000 and 200,000 people in Edo.\"Local agrarian societies in colonial India: Japanese perspectives.\". Kaoru Sugihara, Peter Robb, Haruka Yanagisawa (1996). p 313. * 1858 (Ansei 5): Establishment of Keio University.Ozaki, Yukio. (2001). The Autobiography of Ozaki Yukio, p. 21. * 29 July 1959 (Ansei 5): Ii Naosuke signs Japanese-American Treaty of Amity and Commerce (also known as the \"Harris Treaty\").Cullen, Louis M. (2003). A History of Japan, 1582-1941: Internal and External Worlds, p. 180-186. * 1858 (Ansei 5): Beginning of Ansei Purge which was ordered by Ii Naosuke.Cullen, pp. 184-188. * March 24, 1860 (Ansei 7): Ii Naosuke was assassinated, also known as the \"Sakurada-mon Incident\"Cullen, p. 184. ==Related pages == * Edo period == References == == Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection * National Diet Library, Photograph of Sakurada-mon (1909) Ansei 1st 2nd 3rd 4th 5th 6th 7th 1854 1855 1856 1857 1858 1859 1860 Preceded by: Kaei Era or nengō: Ansei Succeeded by: Man'en Category:Japanese eras Category:1854 establishments Category:19th- century establishments in Japan Category:1860s disestablishments in Japan Category:1850s establishments in Asia",
 "title": "Ansei"
}