{
 "id": "319041",
 "text": "The 2016 United States presidential election was the 58th presidential election that was held on November 8, 2016. Businessman Donald Trump and Indiana Governor Mike Pence defeated former U.S. secretary of State Hillary Clinton and U.S. senator Tim Kaine on the Republican Party ticket. Then- incumbent President Barack Obama was term limited by the Twenty-second amendment, which made him unable to serve a third presidential term. Former secretary of state Hillary Clinton won the Democratic nomination. Trump became his party's front-runner against many candidates in the Republican primary, defeating Senator Ted Cruz, Senator Marco Rubio, and Ohio Governor John Kasich among other candidates. Many third-party candidates ran, such as Gary Johnson. Trump chose Indiana governor Mike Pence as his running mate, and Clinton chose U.S. senator Tim Kaine as her running mate. Trump received 304 electoral votes, 34 more votes than what was needed to win, while Clinton received 227. Even though Trump lost the popular vote, the electoral votes decide the actual winner of the election. Trump took office on January 20, 2017. == Background == Article Two of the United States Constitution says that for a person to be elected and serve as President of the United States, they must be a natural- born citizen of the United States, at least 35 years old, and a resident of the United States for a period of no less than 14 years. Candidates for the presidency typically seek the nomination of one of the various political parties of the United States, in which case each party devises a method (such as a primary election) to choose the candidate the party deems best suited to run for the position. The party's delegates then officially nominate a candidate to run on the party's behalf. President Barack Obama was unable to seek re-election for a third term because of the Twenty-second Amendment to the United States Constitution, which states that a president may only serve up to two terms. His term as president ended at noon eastern standard time on January 20, 2017. ==Democratic Party== ===Nominees=== Democratic Party Ticket, 2016 for President for Vice President 67th U.S. Secretary of State (2009–2013) U.S. Senator from Virginia (2013-present) Campaign Campaign ===Withdrawn candidates=== Candidates in this section are sorted by date of withdrawal from the primaries Bernie Sanders Rocky De La Fuente Martin O'Malley Lawrence Lessig Lincoln Chafee Jim Webb U.S. Senator from Vermont (2007–present) Entrepreneur (1979–present) 61st Governor of Maryland (2007–2015) Harvard Law Professor (2009–2016) 74th Governor of Rhode Island (2011–2015) U.S. Senator from Virginia (2007–2013) Campaign Campaign Campaign Campaign Campaign Campaign LN: July 26, 2016 13,167,848 primary votes and 1,846 delegates LN: July 26, 2016 67,457 primary votes W: February 1, 2016 110,423 votes W: November 2, 2015 4 write-in votes in New Hampshire W: October 23, 2015 0 votes W: October 20, 2015 2 write-in votes in New Hampshire Yglesias, Matthew (February 1, 2016) \"Iowa Results: Martin O'Malley drops out after third place finish\", Vox.com. Retrieved February 1, 2016. Merica, Dan; LoBianco, Tom (October 23, 2015) \"Lincoln Chafee drops out of Democratic primary race\", CNN.com. Retrieved October 23, 2015 Walsh, Michael (October 20, 2015) \"Jim Webb drops out of Democratic primary race\", Yahoo! Politics. Retrieved October 23, 2015. ==Republican Party== Republican Party Ticket, 2016 for President for Vice President Chairman of The Trump Organization (1971–2017) 50th Governor of Indiana (2013-2017) Campaign Campaign ===Withdrawn candidates=== Candidates in this section are sorted by date of withdrawal from race John Kasich Ted Cruz Marco Rubio Ben Carson Jeb Bush Jim Gilmore Carly Fiorina Chris Christie 69th Governor of Ohio (2011–present) U.S. Senator from Texas (2013–present) U.S. Senator from Florida (2011–present) Dir. of Pediatric Neurosurgery, Johns Hopkins Hospital (1984–2013) 43rd Governor of Florida (1999–2007) 68th Governor of Virginia (1998–2002) CEO of Hewlett-Packard (1999–2005) 55th Governor of New Jersey (2010–present) Campaign Campaign Campaign Campaign Campaign Campaign Campaign Campaign W: May 4 W: May 3 W: Mar 15 W: Mar 4 W: Feb 20 W: Feb 12 W: Feb 10 W: Feb 10 Nelson, Rebecca (April 13, 2015) \"Marco Rubio Makes His Pitch as the Fresh Face of the GOP in 2016\", National Journal. Retrieved April 14, 2015. Rand Paul Rick Santorum Mike Huckabee George Pataki Lindsey Graham Bobby Jindal Scott Walker Rick Perry U.S. Senator from Kentucky (2011–present) U.S. Senator from Pennsylvania (1995–2007) 44th Governor of Arkansas (1996–2007) 53rd Governor of New York (1995–2006) U.S. Senator from South Carolina (2003–present) 55th Governor of Louisiana (2008–2016) 45th Governor of Wisconsin (2011–present) 47th Governor of Texas (2000–2015) Campaign Campaign Campaign Campaign Campaign Campaign Campaign Campaign W: Feb 3 W: Feb 3 W: Feb 1 W: Dec 29, 2015 W: Dec 21, 2015 W: Nov 17, 2015 W: Sept 21, 2015 W: Sept 11, 2015 Jaffe, Alexandra (June 1, 2015) \"Graham bets on foreign experience in White House bid announcement\", CNN. Retrieved June 1, 2015. == Major third parties == === Libertarian Party === Ballot access to all 538 electoral votes / / / / / DC Board of Elections – Candidate List ==== Nominees ==== Libertarian Party Ticket, 2016 for President for Vice President 29th Governor of New Mexico (1995–2003) 68th Governor of Massachusetts (1991-1997) Campaign Campaign \"Gary Johnson FEC filing\", FEC.gov. \"Gary Johnson FEC filing\", FEC.gov. ==== Withdrawn candidates ==== * Robert David Steele, activist and author from Virginia; candidate for the Reform Party's nomination in 2012. Suspended campaign on January 6, 2016 * Marc Allan Feldman, Anesthesiologist at The Cleveland Clinic (since 1998). Suspended after convention * John McAfee, businessman and computer scientist, founder of McAfee. Suspended after convention\"John McAfee FEC filing\", FEC.gov. * Austin Petersen, businessman and founder and CEO of Stonegait, LLC. Suspended after convention. Endorsed Gary Johnson\"Austin Petersen FEC filing\", FEC.gov. * Vermin Supreme, performance artist and activist; candidate for the Democratic Party's nomination in 2012 and 2016. Suspended after convention.Presidential Candidate Switches to the Libertarian Party File:Steele headshot never used before (afghanistan).jpg| File:Marc Allan Feldman (20277052616) (cropped).jpg| File:John McAfee by Gage Skidmore.jpg| File:Austin Petersen by Gage Skidmore.jpg| File:Vermin Supreme (St. Anselm College).jpg| === Constitution Party === Ballot access to 207 electoral votes (451 with write-in): – * As write-in: Alabama, Arizona, Connecticut, Delaware, Georgia, Illinois, Indiana, Kansas, Kentucky, Maine, Maryland, Montana, Nebraska, New Hampshire, New York, Ohio, Oregon, Rhode Island, Tennessee, Texas, Vermont, Virginia * No ballot access: California, District of Columbia, Massachusetts, North Carolina, Oklahoma ====Nominees==== Constitution Party ticket, 2016 for President for Vice President Attorney from Memphis, Tennessee Businessman from Utah Campaign Campaign === Green Party === Ballot access to 493(451) electoral votes: Ballot access currently in process: North Dakota, Rhode Island, Wyoming States currently under litigation for ballot access: Nevada, Oklahoma States with no ballot access: South Dakota As write-in: Georgia, Indiana, North Carolina. ====Nominees==== Presumptive Green Party Ticket, 2016 for President for Vice President Physician from Lexington, Massachusetts Activist from Washington, D.C. Campaign Campaign ==== Other active candidates ==== * Darryl Cherney, Earth First! organizer and musician from California * Sedinam Curry, 29th People's National Convention organizer from California * William Kreml, Professor Emeritus of University of South Carolina from South Carolina. Endorsed Jill Stein * Kent Mesplay, Inspector at the Air Pollution Control District of San Diego County (2001-2015) from California. Endorsed Jill Stein File:Darryl Cherney playing guitar.jpg| | File:Bill Kreml 2.jpg| File:Kent Mesplay by Gage Skidmore.jpg| ==== Withdrawn candidates ==== * Midge Potts, transgender peace activist from Missouri. Suspended campaign during primariesMidge Potts 2016 File:Midge Potts at State of the Union protest (cropped).jpg| === American Delta Party and Reform Party === Ballot access to 147 electoral votes (305 with write-in) * On the ballot: Alaska, Colorado, Florida, Idaho, Iowa, Kentucky, Minnesota, Mississippi, Montana, Nevada, New Hampshire, New Jersey, New Mexico, North Dakota, Rhode Island, Tennessee, Utah, Vermont, Wisconsin, Wyoming * As write-in: Alabama, Arizona, Connecticut, Delaware, Indiana, Kansas, Maryland, Missouri, Nebraska, New York, Oregon, Pennsylvania, Virginia, Washington, West Virginia * No ballot access: California, District of Columbia, Georgia, Hawaii, Illinois, Indiana, Maine, Massachusetts, Michigan, Nevada, North Carolina, Ohio, Oklahoma, South Dakota, Texas, Wyoming American Delta Party and Reform Party ticket, 2016 for President for Vice President Business Tycoon Lawyer from Florida Campaign Campaign === Independents === Ballot access to 84 electoral votes (451 with write-in): * As write-in: Alabama, Alaska, Arizona, California, Connecticut, Delaware, Georgia, Illinois, Kansas, Maine, Maryland, Massachusetts, Michigan, Missouri, Montana, Nebraska, New Hampshire, New Jersey, New York, North Dakota, Ohio, Oregon, Pennsylvania, Rhode Island, Tennessee, Texas, Vermont, Washington, West Virginia, Wisconsin * No ballot access: District of Columbia, Florida, Hawaii, Indiana, Mississippi, Nevada, North Carolina, Oklahoma, South Dakota, Wyoming Independent ticket, 2016 for President for Vice President Chief policy director for the House Republican Conference President of Empowered Women (2015–present) Campaign Campaign == Other parties == === American Freedom Party === Ballot Access to 6 electoral votes: Mississippi\"American Freedom Party Becomes a Qualified Party in Mississippi\", Ballot Access News. August 12, 2015. * Bob Whitaker, white nationalist and paleoconservative political activist from South Carolina.\"Kenn Gividen Steps Down as American Freedom Party Presidential Nominee, Bob Whitaker to Take His Place at the Top of the Ticket\", Independent Political Report. July 26, 2015. Vice-presidential nominee: Tom Bowie, from Maryland === Independent American Party === Ballot Access to 18 Electoral Votes: New Mexico, Oregon, Utah * Farley Anderson, activist from Utah. Vice Presidential nominee: Vacant === Party for Socialism and Liberation === Ballot Access to 29 electoral votes: Florida * Gloria La Riva, newspaper printer and activist from New Mexico; 2008 presidential nominee; vice-presidential nominee: Eugene Puryear === Prohibition Party === Ballot Access to 21 electoral votes: Arkansas, Colorado, Mississippi * James Hedges, Tax Assessor for Thompson Township, Fulton County, Pennsylvania 2002–2007; vice-presidential nominee: Bill Bayes of Mississippi === Peace and Freedom Party & Party of Socialism and Liberation === Ballot Access to 84 electoral votes: California, Florida * Gloria La Riva, newspaper printer and activist, from New Mexico === Socialist Party USA === Ballot Access to 0 electoral votes * Mimi Soltysik, former National Co-chair of the Socialist Party USA from California; vice-presidential nominee: Angela Walker of Wisconsin === Nutrition Party === Ballot Access to 9 electoral votes: Colorado * Rod Silva, restaurateur from New Jersey; Vice-presidential nominee: Vacant === Veterans Party of America === Ballot Access to 6 electoral votes: Mississippi * Chris Keniston, reliability engineer from Texas; vice- presidential nominee: Deacon Taylor of Nevada === Workers World Party === Ballot Access to 0 electoral votes * Monica Moorehead, perennial candidate and activist from New Jersey; vice-Presidential nominee: Lamont Lilly ==Battleground states== Battleground states during the election were: Nevada, Georgia, Michigan, Pennsylvania, Florida, New Hampshire, Maine, Ohio and North Carolina. Trump won Georgia, Michigan, Pennsylvania, Ohio, North Carolina, Florida and a congressional district in Maine. Clinton won Nevada, New Hampshire and Maine. Wisconsin, Michigan and Pennsylvania were seen as likely 'Blue' states, but Trump won all three states in what was seen as a political upset. ==Party conventions== ; Democratic Party * July 25–28, 2016: Democratic National Convention to be held in Philadelphia, Pennsylvania. ;Republican Party * July 18–21, 2016: Republican National Convention to be held in Cleveland, Ohio.\"RNC officially approves Cleveland as 2016 convention host\", CBS News. Associated Press. Retrieved August 14, 2014.Isenstadt, Alex (January 14, 2014) \"GOP convention set for July 18–21 in 2016\", Politico. Retrieved January 15, 2015. ; Green Party * August 4–7, 2016: Green National Convention was held in Houston, Texas.Winger, Richard (August 2, 2015) \"Green Party Will Hold Presidential Convention in Houston\", Ballot Access News. Retrieved August 5, 2015. ;Libertarian Party * May 26–30, 2016: Libertarian National Convention to be held in Orlando, Florida. ; Constitution Party * April 13–16, 2016: Constitution Party National Convention was held in Salt Lake City, Utah.Mills, Glen (April 14, 2016) \"The Constitution Party hosts national convention in Salt Lake City\" , Good4Utah. Retrieved September 14, 2016. ; Reform Party * July 29–31, 2016: Reform Party National Convention was held in Bohemia, New York.Ballotpedia . Retrieved October 29, 2019. ==Debates== On April 1, 2015, the Commission on Presidential Debates a (CPD) announced that each of the following 16 locations are under consideration to host one of the three presidential debates and one vice presidential debate: * Belmont University in Nashville, Tennessee * Birmingham, Alabama * Dominican University of California in San Rafael, California * Eastern Kentucky University in Richmond, Kentucky * Georgia College & State University in Milledgeville, Georgia * Hofstra University in Hempstead, New York * Jacksonville University in Jacksonville, Florida * Longwood University in Farmville, Virginia * State University of New York Rockland Community College in Suffern, New York * University of Nevada, Las Vegas * Washington University in St. Louis, Missouri * West Virginia University and West Virginia State University in Charleston, West Virginia * Wright State University in Dayton, Ohio * Texas A&M; University in College Station, Texas * Houston Community College in Houston, Texas * McAllen, Texas The three locations which will host the presidential debates and the one location selected to host the vice presidential debate are to be announced by the CPD in the fall of 2015. == Results == Candidate Party Votes % Electoral votes Donald Trump Republican 62,984,825 46.09% 304 Hillary Clinton Democratic 65,853,516 48.18% 227 Gary Johnson Libertarian 4,489,221 3.28% 0 Jill Stein Green Party 1,457,216 1.07% 0 Evan McMullin Independent 731,788 0.54% 0 Darrell Castle Constitution 203,010 0.15% 0 Gloria La Riva Peace and Freedom 74,392 0.05% 0 Rocky De La Fuente Reform Party of the United States of America 33,136 0.03% 0 Richard Duncan Independent 24,308 0% 0 Dan Vacek Legal Marijuana Now Party 13,538 0% 0 Alyson Kennedy Socialist Workers Party 12,467 0% 0 Chris Keniston Veterans Party of America 7,251 0% 0 Mike Maturen American Solidarity Party 6,797 0% 0 James Hedges Prohibition Party 5,617 0% 0 Tom Hoefling America's Party 4,856 0% 0 Monica Moorehead Workers World Party 4,319 0% 0 Laurence Kotlikoff Independent 3,603 0% 0 Peter Skewes American Party 3,246 0% 0 Rocky Giordani Independent American Party 2,752 0% 0 Mimi Soltysik Socialist Party USA 2,705 0% 0 Rod Silva Nutrition Party 751 0% 0 Jerome White Socialist Equality Party 382 0% 0 Total Total Total 136,669,237 100% 538 === Margin of victory === * Blue shows Clinton's margin of victory over Trump, while red shows Trump's margin of victory over Clinton. State Trump % Clinton % Margin Alabama 62.1% 34.4% 27.7% Alaska 51.3% 36.6% 14.7% Arizona 48.7% 45.1% 3.6% Arkansas 60.6% 33.7% 26.9% California 31.6% 61.7% 30.1% Colorado 43.3% 48.2% 4.9% Connecticut 40.9% 54.6% 13.7% Delaware 41.7% 53.1% 11.4% District of Columbia 4.1% 90.5% 86.4% Florida 49.0% 47.8% 1.2% Georgia 50.8% 45.6% 5.2% Hawaii 30.0% 62.2% 32.2% Idaho 59.3% 27.5% 31.8% Illinois 38.8% 55.8% 17.0% Indiana 56.8% 37.9% 18.9% Iowa 51.2% 41.7% 9.5% Kansas 56.7% 36.1% 20.6% Kentucky 62.5% 32.7% 29.8% Louisiana 58.1% 38.5% 19.6% Maine 44.9% 47.8% 2.9% Maryland 33.9% 60.3% 26.4% Massachusetts 32.8% 60.0% 27.2% Michigan 47.5% 47.3% 0.2% Minnesota 44.9% 46.4% 1.5% Mississippi 57.9% 40.1% 17.8% Missouri 56.8% 38.1% 18.7% Montana 56.2% 35.8% 20.4% Nebraska 58.8% 33.7% 25.1% Nevada 45.5% 47.9% 2.4% New Hampshire 46.6% 47.0% 0.4% New Jersey 41.0% 55.0% 14.0% New Mexico 40.0% 48.3% 8.3% New York 36.5% 59.0% 22.5% North Carolina 49.8% 46.2% 3.6% North Dakota 63.0% 27.2% 35.8% Ohio 51.7% 43.6% 8.1% Oklahoma 65.3% 28.9% 36.4% Oregon 39.1% 50.1% 11.0% Pennsylvania 48.2% 47.5% 0.7% Rhode Island 38.9% 54.4% 15.5% South Carolina 54.9% 40.7% 14.2% South Dakota 61.5% 31.7% 29.8% Tennessee 60.7% 34.7% 26.0% Texas 52.2% 43.2% 9.0% Utah 45.5% 27.5% 18.0% Vermont 30.3% 56.7% 26.4% Virginia 44.4% 49.7% 5.3% Washington 36.8% 52.5% 15.7% West Virginia 68.5% 26.4% 42.1% Wisconsin 47.2% 46.5% 0.7% Wyoming 67.4% 21.6% 45.8% The following table shows the swing in each state compared to the 2012 election. State 2016 Rep % 2012 Rep % 2016 Dem % 2012 Dem % Rep Change Dem Change Alabama 62.1% 60.6% 34.4% 38.4% +1.5% –4.0% Alaska 51.3% 54.8% 36.6% 40.8% –3.5% –4.2% Arizona 48.7% 53.7% 45.1% 44.6% –5.0% +0.5% Arkansas 60.6% 60.6% 33.7% 36.9% 0.0% –3.2% California 31.6% 37.1% 61.7% 60.2% –5.5% +1.5% Colorado 43.3% 46.1% 48.2% 51.5% –2.8% –3.3% Connecticut 40.9% 40.7% 54.6% 58.1% +0.2% –3.5% Delaware 41.7% 40.0% 53.1% 58.6% +1.7% –5.5% District of Columbia 4.1% 7.3% 90.5% 90.9% –3.2% –0.4% Florida 49.0% 49.1% 47.8% 50.0% –0.1% –2.2% Georgia 50.8% 53.3% 45.6% 45.5% –2.5% +0.1% Hawaii 30.0% 27.8% 62.2% 70.6% +2.2% –8.4% Idaho 59.3% 64.5% 27.5% 32.6% –5.2% –5.1% Illinois 38.8% 40.7% 55.8% 57.6% –1.9% –1.8% Indiana 56.8% 54.1% 37.9% 43.9% +2.7% –6.0% Iowa 51.2% 46.2% 41.7% 52.0% +5.0% –10.3% Kansas 56.7% 59.7% 36.1% 38.0% –3.0% –1.9% Kentucky 62.5% 60.5% 32.7% 37.8% +2.0% –5.1% Louisiana 58.1% 57.8% 38.5% 40.6% +0.3% –2.1% Maine 44.9% 41.0% 47.8% 56.3% +3.9% –8.5% Maryland 33.9% 35.9% 60.3% 62.0% –2.0% –1.7% Massachusetts 32.8% 37.5% 60.0% 60.7% –4.7% –0.7% Michigan 47.5% 44.7% 47.3% 54.2% +2.8% –6.9% Minnesota 44.9% 45.0% 46.4% 52.7% –0.1% –6.3% Mississippi 57.9% 55.3% 40.1% 43.8% +2.6% –3.7% Missouri 56.8% 53.8% 38.1% 44.4% +3.0% –6.3% Montana 56.2% 55.4% 35.8% 41.7% +0.8% –5.9% Nebraska 58.8% 59.8% 33.7% 38.0% –1.0% –4.3% Nevada 45.5% 45.7% 47.9% 52.4% –0.2% –4.5% New Hampshire 46.6% 46.4% 47.0% 52.0% +0.2% –5.0% New Jersey 41.0% 40.6% 55.0% 58.4% +0.4% –3.4% New Mexico 40.0% 42.8% 48.3% 53.0% –2.8% –4.7% New York 36.5% 35.2% 59.0% 63.4% +1.3% –4.4% North Carolina 49.8% 50.4% 46.2% 48.4% –0.6% –2.2% North Dakota 63.0% 58.3% 27.2% 38.7% +4.7% –11.5% Ohio 51.7% 47.7% 43.6% 50.7% +4.0% –7.1% Oklahoma 65.3% 66.8% 28.9% 33.2% –1.5% –4.3% Oregon 39.1% 42.2% 50.1% 54.2% –3.1% –4.1% Pennsylvania 48.2% 46.6% 47.5% 52.0% +1.6% –4.5% Rhode Island 38.9% 35.2% 54.4% 62.7% +3.7% –8.3% South Carolina 54.9% 54.6% 40.7% 44.1% +0.3% –3.4% South Dakota 61.5% 57.9% 31.7% 39.9% +3.6% –8.2% Tennessee 60.7% 59.5% 34.7% 39.1% +1.2% –4.4% Texas 52.2% 57.2% 43.2% 41.4% –5.0% +1.8% Utah 45.5% 72.8% 27.5% 24.8% –27.3% +2.7% Vermont 30.3% 31.0% 56.7% 66.6% –0.7% –9.9% Virginia 44.4% 47.3% 49.7% 51.2% –2.9% –1.5% Washington 36.8% 41.3% 52.5% 56.2% –4.5% –3.7% West Virginia 68.5% 62.3% 26.4% 35.5% +6.2% –9.1% Wisconsin 47.2% 45.9% 46.5% 52.8% +1.3% –6.3% Wyoming 67.4% 68.6% 21.6% 27.8% –1.2% –6.2% Total 46.1% 47.2% 48.2% 51.1% –1.1% –2.9% ==Notes== ==References== ==Other websites== * 2016 Presidential Form 2 Filers at the Federal Election Commission (FEC) United States presidential election",
 "title": "2016 United States presidential election"
}