{
 "id": "319003",
 "text": "Shrek the Halls is a television Christmas special. It was first shown on the American television network ABC on Wednesday, November 28, 2007. The special is based on the characters from the Shrek movies. It is thirty minutes long. The cast includes Mike Myers, Eddie Murphy, Cameron Diaz and Antonio Banderas. The television special was released on iTunes on November 2, 2008. It was shown again on December 9, 2009, December 4, 2010, December 9, 2010, and November 28, 2011 on ABC. ==Synopsis== The special is set shortly after the events of Shrek the Third and before the events of Shrek Forever After. It takes place when Shrek and Fiona's children are still infants. Shrek (Mike Myers) is quietly living in the swamp with his family when the Christmas season arrives. Donkey (Eddie Murphy) convinces Shrek to tell Princess Fiona (Cameron Diaz) to expect a special Christmas surprise. Shrek goes to the local bookstore in Far, Far Away to try to find a present for Fiona. Because he does not know what Christmas is all about, the shopkeeper (Marissa Jaret Winokur) gives Shrek a copy of the book Christmas For Village Idiots. It is a step-by- step guide to celebrating the holiday. Shrek does what the book say to do by decorating the house and getting a tree. He plans to have a quiet Christmas Eve with his family. Donkey brings the entire \"family\" to the swamp. This ruins Shrek's plans. Shrek tries to tell his own version of \"A Visit from St. Nicholas (The Night Before Christmas)\". Gingy, Donkey, and Puss in Boots (Antonio Banderas) interrupt and each tell their own version of a Christmas story. Donkey tells of floats coming to the swamp. At the end, Donkey tells of licking a very large Santa figure that is made out of waffles. Puss tells his version of the story of Santa Claus. He ends up playing with the with one of the baubles from the Christmas tree. Gingy's story is not happy. It is very scary. He tells about how his girlfriend Suzy got eaten by Santa Claus. DOnkey finds Shrek's Christmas for Village Idiots book. In a fight over the book, all of Shrek's decorations, furniture and the tree are destroyed. Shrek gets angry and tells everyone to leave the house. In a bad mood, Fiona and Shrek have a talk. After they talk, she takes the children and leaves the swamp to go and apologize to their friends. Shrek feels very bad that Christmas Eve did not go as he hoped it would. Fiona finds their friends and explains to Donkey what Shrek had wanted for Christmas. Shrek joins them and tells them he is sorry for getting mad. Donkey is surprised to learn that this is Shrek's first Christmas, because \"ogres don't celebrate anything.\" Donkey says he is sorry for being annoying. He says that Christmas never goes as planned and according to his mother, \"'Christmas ain't Christmas until somebody cries', and that's usually me.\" After a snowball fight, the friends return to the swamp. Shrek tells his story. It is about Ogre Claus, not Santa Claus. Soon they hear bells. They go outside to see Santa and his reindeer. Gingy runs back inside screaming in fear. ==Cast== *Mike Myers as Shrek and santa *Eddie Murphy as Donkey *Cameron Diaz as Fiona *Antonio Banderas as Puss in Boots *Conrad Vernon as Gingy *Cody Cameron as Pinocchio and The Three Little Pigs *Aron Warner as Big Bad Wolf *Christopher Knights as Three Blind Mice *Marissa Jaret Winokur as Bookstore Clerk *Gary Trousdale as Santa Claus *Susan Fitzer as Susie Cookie ==Production== Shrek the Halls was produced by DreamWorks Animation at the PDI/DreamWorks studio. Gary Trousdale directed the special at first, but he was later replaced by Mark Baldo. The movie was produced by Teresa Cheng, Gina Shay and Aron Warner. The screenplay was written by Bill Riling, Theresa Cullen, Gary Trousdale and Sean Bishop. == DVD release == Shrek the Halls was released on DVD in the United States on November 4, 2008. It was first sold by itself, or combined with Shrek the Third. ==Ratings== ===U.S. Nielsen ratings=== # Air Date Rating and ABC Medianet.ABC Medianet Share Rating/Share (18-49) Viewers (millions) Rank (timeslot) Rank (night) Rank (week) 1 November 28, 2007 11.0 17 7.2/20 21.06 1 1 3 2 December 11, 2007 5.7 9 3.4/9 9.97 3 6 21 3 December 1, 2008 6.2 10 3.3/9 11.17 1 3 19 4 December 22, 2008 3.7 6 1.8/6 6.51 TBA TBA TBA 5 November 30, 2009 TBA TBA 3.2/8 10.01 TBA TBA TBA 6 December 9, 2009 TBA TBA 2.6/8 8.53 TBA TBA TBA ==References== ==Other websites== * Category:Christmas movies Category:2007 television movies Category:Shrek",
 "title": "Shrek the Halls"
}