{
 "id": "319255",
 "text": "was a after Genji and before Meiji. The period started in April 1865 and ended in September 1868.Nussbaum, Louis-Frédéric. (2005). \"Keiō\" in Japan Encyclopedia, p. 505. During this time, the emperors were Nussbaum, \"Kōmei Tennō,\" p. 553. and .Nussbaum, \"Meiji Tennō,\" p. 624. The nengō Keiō means \"Joyous Concord\"Lane-Poole, Stanley. (1894). The Life of Sir Harry Parkes, p. 97. ==Events of the Keiō era== * 1866 (Keiō 2): Construction of Goryōkaku star fort at Hakodate.Nussbaum, \"Goryōkaku\" ay p. 259. * 28 September 1866 (Keiō 2, 20th day of the 8th month): Tokugawa Iemochi died at Osaka; and Tokugawa Yoshinobu was named shogun.Ponsonby-Fane, Richard. (1956). Kyoto: The Old Capital of Japan, 794-1869, p. 326. * 10 January 1867 (Keiō 2, 5th day of the 12th month): Yoshinobu was formally established as shogun. * 30 January 1867 (Keiō 2, 25th day of the 12th month): Kōmei died;Ponsonby-Fane, p. 326; Meyer, Eva-Maria. (1999). Japans Kaiserhof in der Edo-Zeit, p. 186; Imperial Household Agency (Kunaichō), 孝明天皇 (121); retrieved 2012-5-27. and the succession passed to his son (senso). * 10 November 1867 (Keiō 3, 15th day of the 10th month): An Imperial edict defines a restoration of Imperial government. * 1868 (Keiō 4, 3rd of the 1st month): The Boshin War began with the Battle of Toba-Fushimi. * 3 September 1868 (Keiō 4, 17th day of the 7th month): Edo was renamed \"Tokyo\", which means \"Eastern Capital\".Ponsonby-Fane, p. 327. * 8 October 1868 (Keiō 4, 23rd of the 8th month): Battle of Aizu began. * 12 October 1868 (Keiō 4, 27th day of the 8th month): Emperor Meiji's role as monarch was confirmed by ceremonies (sokui).Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 328; Varley, H. Paul. (1980). Jinnō Shōtōki, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui-no-Rei); retrieved 2012-6-30. * 23 October 1868 (Keiō 4, 8th day of the 9th month): The nengō was formally changed from Keiō to Meiji; and a general amnesty was granted.Ponsonby-Fane, p. 328. In 1868, the emperor moved his Imperial court to Tokyo; and Edo castle became an Imperial palace. In this way, the capital of Japan moved from Kyoto to Tokyo.Nussbaum, \"Meiji-isshin\" at p. 624. Keio University was named after this era.Nussbaum, \"Keiō Gijuku Daigaku\" at p. 505. It is the oldest existing institution of higher learning in Japan.Ozaki, Yukio. (2001). The Autobiography of Ozaki Yukio, p. 21. ==Related pages == * Edo period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" ...historical overview plus illustrative images from library's collection * National Archives of Japan Imperial standard and colors, Boshin War (1868) Keiō 1st 2nd 3rd 4th 1865 1866 1867 1868 Preceded by: Genji Era or nengō: Keiō Succeeded by: Meiji Category:Japanese eras Category:1865 establishments in Asia Category:1860s establishments in Japan Category:1868 disestablishments in Japan",
 "title": "Keiō"
}