{
 "id": "319256",
 "text": "Tula Paulinea Contostavlos (born 13 July 1988), known as Tulisa, is a English singer, songwriter, rapper, actress and television personality of Greek and Irish ancestry. She was a member of the Camden-based hip hop group N-Dubz. Tulisa was also a judge on The X Factor. == Background == Tula Paulinea Contostavlos was born on 13 July 1988 in Camden Town, London. When Contostavlos was five, her mother, who has bipolar disorder and schizoaffective disorder, was sectioned under the Mental Health Act. The 2010 BBC programme, Tulisa: My Mum and Me, described Contostavlos' life looking after her mother before joining N-Dubz. On 9 March 2020, Contostavlos revealed she suffered from Bell's palsy. === Family === Her Irish mother, Anne Byrne, was born in Churchtown, Dublin. Anne and her three sisters were in a 1980's big band and swing group, called Jeep. Contostavlos' father, Plato Contostavlos, is Greek-Cypriot and at one time was keyboardist with Mungo Jerry. Plato's brother, Byron Contostavlos, was bassist with Mungo Jerry and later became the manager of N-Dubz. == Career == Tulisa was in the band N-Dubz with her cousin Dappy and their friend Fazer. The group became very popular. Tulisa was a celebrity judge on The X Factor in 2011 and 2012. She mentored the \"Groups\" category in 2011. They included Little Mix, the first group to win the competition. Tulisa returned to the show in 2014 because Mel B was ill. As a singer, Contostavlos has recorded three studio albums with N-Dubz, Uncle B (2008), Against All Odds (2009) and Love.Live.Life (2010). In 2011, she started work on a solo album. In 2012 it was released. The Female Boss got a lot of bad reviews and did not chart well. Three singles were released from the album. The first single, \"Young\", entered the UK Singles Chart at number one. In 2022, N-Dubz went on a reunion tour. They have also appeared on Celebrity Gogglebox together since 2023. In 2024, Contostavlos was a contestant on the twenty-fourth series of I'm a Celebrity...Get Me Out of Here! where she came tenth place. == Drug trial== In June 2013, Costostavlos, along with rapper Mike GLC were arrested on suspicion of supplying class A drugs.Tulisa arrestedTulisa arrested: Friend Mike GLC insists star has \"not done anything\" and \"truth will come out\" In July 2014, Contostavlos' trial for supplying cocaine ended because it was discovered that the journalist who accused her, Mazher Mahmood, had lied to the court. In July 2014, she made a documentary about her time during the trial named Tulisa: The Price of Fame, which premiered on BBC Three to a moderate success, attracting 615,000 viewers (3.8% of the audience within its time slot). In April 2015, Justice Nicholas Kearns, President of the Irish High Court, described her as having been \"cruelly deceived in a shabby sting operation\", but dismissed her attempt to sue the Irish Sun for defamation. After the collapse of her drug trial, The Guardian Suzanne Moore wrote an article on Contostavlos image and reputation and wrote that \"Tulisa is famously a working class girl made good, though of course made good is never what she is allowed to be\". In Moore's opinion, \"Tulisa has been branded by the media as a chav and therefore almost anything can be said about her\". ==Discography== * The Female Boss (2012) ==Filmography== === Television === Year Title Role Notes 2007–2009 Dubplate Drama Laurissa Series 2–3 2010 Tulisa: My Mum & Me Herself Documentary 2010–2011 Being... N-Dubz 2010–2012 Alan Carr: Chatty Man Guest; 3 episodes 2010–2016 Celebrity Juice 10 episodes 2011 Before They Were Dubz Documentary Wall of Fame Guest Panellist 1 episode 2011–2012, 2014 The X Factor Judge 2012 Britain's Got Talent Performer 1 episode The Talent Show Story Herself 2012–2020 Loose Women Guest; 5 episodes 2013–2015 Sweat the Small Stuff 5 episodes 2014 Tulisa: The Price of Fame Documentary 2016 Hoff The Record Cameo appearance Off Their Rockers Guest Prankster Series 4, episode 6 2018 Don't Hate the Playaz Herself 1 episode 2024 I'm a Celebrity...Get Me Out of Here! Contestant === Film === Year Title Role 2011 Demons Never Die Amber Big Fat Gypsy Gangster Shaniqua ==References== == Other websites == * Category:Actors from London Category:British people convicted of assault Category:British R&B; musicians Category:English movie actors Category:English rappers Category:English singer-songwriters Category:People from the London Borough of Camden Category:Singers from London Category:Television personalities from London Category:1988 births Category:Living people Category:Musicians from London Category:English R&B; singers Category:English hip hop musicians Category:Grime music artists Category:English dance musicians Category:Urban pop musicians Category:British blue-eyed soul singers Category:English blue- eyed soul singers",
 "title": "Tulisa"
}