{
 "id": "319251",
 "text": "was a after Jōkyō and before Hōei. This period started in September 1688 and ended in March 1704. During this time, the emperor was . The years of Genroku are generally considered to be the Golden Age of the Edo period. A century of peace and seclusion created good economic conditions and cultural growth. The nengō Genroku means \"Origin of Good Fortune\"Jenkins, Donald. (1971). Ukiyo-e Prints and Paintings: the Primitive Period, 1680-1745, p. 21. ==Events of the Genroku era== * 1688 (Genroku 1): Tokugawa shogunate published a code of conduct for funerals (Fuku-kiju-ryō) and for mourning.Smith, Robert et al. (2004). Japanese Culture: Its Development And Characteristics, p. 28. * 16 September 1689 (Genroku 2, 3rd day of the 7th month): Engelbert Kaempfer arrived at Dejima.Screech, Timon. (2006). Secret Memoirs of the Shoguns: Isaac Titsingh and Japan, 1779-1822, p. 73. * 1693 (Genroku 6, 12th month): Arai Hakuseki became the tutor of Tokugawa Ienobu. * 1693 (Genroku 6): The code of conduct for funerals and mourning was changed.Smith, p. 28. * 1695 (Genroku 8, 8th month): The shogunate placed the Japanese character gen (元) on copper coins. * 4 December 1696: Former-Empress Meishō died at age 74. * 1697 (Genroku 10): The 4th official map of Japan was made.Traganeou, Jilly. (2004). The Tokaido Road: Traveling and Representation in Edo and Meiji Japan, p. 230. * 1697 (Genroku 10): Great fire in Edo. * 1698 (Genroku 11): Another great fire in Edo. * 1703 (Genroku 16, 3rd month): Ōishi Yoshio commits seppuku. * 1703 (Genroku 16, 5th month): First performance of Chikamatsu Monzaemon's play The Love Suicides at Sonezaki (Sonezaki shinjū). * 31 December 1703 (Genroku 16, 23rd day of the 11th month): The Great Genroku Earthquake shook Edo. Fire spread in the city. The coast of Honshū was hit by tsunami. ==Related pages == * Edo period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection * New York Public Library Digital Gallery, Engelbert Kaempfer's 1691 impression of Hōkō-ji compound (published 1727) Genroku 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 1688 1689 1690 1691 1692 1693 1694 1695 1696 1697 1698 1699 1700 1701 1702 1703 1704 Preceded by: Jōkyō Era or nengō: Genroku Succeeded by: Hōei Category:Japanese eras Category:1688 establishments Category:1680s establishments in Japan Category:1700s disestablishments Category:18th-century disestablishments in Japan",
 "title": "Genroku"
}