{
 "id": "319322",
 "text": "The German Democratic Republic (GDR), or East Germany, sent athletes to the Olympic Games from 1956 until 1988. They have taken part in both the Summer and Winter Games. From 1956 through 1966, East German athletes were a part of a combined team from both East and West Germany. After 1966, the East Germans were a separate team. They won a total of 519 medals at the Olympics. ==History== ===Division of Germany=== Germany was divided after World War II. Three separate states were created. German athletes tried to take part in the 1948 games but the Allies did not let this happen. Finally, in 1949, the National Olympic Committee for Germany was founded in the Western Federal Republic of Germany. The IOC accepted it as both of the larger two larger German states. The small, French-occupied Saarland and its NOC were separate until after 1955. East German authorities of the Nationales Olympisches Komitee für Ostdeutschland did not send their athletes to the 1952 games in an all-German team. The wanted a team of their own. This was not allowed by the IOC. ===United German Team=== East Germany agreed to take part in the 1956 Games. German athletes from the East and West Germany took part in the games in 1956, 1960 and 1964 as the United Team of Germany. This team was just called Germany at the time. ===Success of East Germans=== The GDR renamed their NOC to Nationales Olympisches Komitee der DDR in 1965. It was accepted by the IOC in 1968. At this point East Germany sent its own team to the Games. They did not take part in the in 1984 Summer Olympics due to the Soviet boycott. Although East Germany had a small population of about 16 million, they did very well. From 1976 to 1988, they won the second most medals in each of their three summer Olympics, behind the Soviet Union. They did much better than the West Germany. In five winter games, they placed second four times and first in the 1984 Winter Olympics. Many think that doping (mainly anabolic steroids) allowed East Germany to a world leader in sports for two decades. They won many Olympic and world gold medals but many athletes failed doping tests or were believed to be taking performance enhancing drugs.Tagliabue, John. - \"Political Pressure Dismantles East German Sports Machine\" - New York Times - February 12, 1991Janofsky, Michael. - \"OLYMPICS; Coaches Concede That Steroids Fueled East Germany's Success in Swimming\" - New York Times - December 3, 1991Kirschbaum, Erik. - \"East German dope still leaves tracks\" - Rediff from Reuters - September 15, 2000Ungerleider, Steven (2001). Faust's Gold: Inside The East German Doping Machine. Thomas Dunne Books \"Little blue pills and a lot of gold...\" - Shorel.comCulture & Lifestyle: \"Sports Doping Statistics Reach Plateau in Germany\"- Deutsche Welle - February 26, 2003 \"The East German Doping Machine\" - International Swimming Hall of FameCulture & Lifestyle: \"East Germany's Doping Legacy Returns\" - Deutsche Welle - January 10, 2004Longman, Jere. - \"East German Steroids' Toll: 'They Killed Heidi'\" - New York Times - January 26, 2004Harding, Luke. - \"Forgotten victims of East German doping take their battle to court\"- The Guardian - November 1, 2005 Jackson, Guy. Winning at Any Cost?: \"Doping for glory in East Germany\" - UNESCO - September 2006\"Ex-East German athletes compensated for doping\" - Associated Press - (c/o ESPN) - December 13, 2006\"East German doping victims to get compensation\" - Associated Press - (c/o CBC Canadian Broadcasting Corporation) - December 13, 2006Starcevic, Nesha. - \"East German doping victims to get compensation\" - Associated Press - (c/o San Diego Union- Tribune) - December 13, 2006\"Germany completes $4.1M payout to doping victims\" - USA Today - October 11, 2007\"East Germany’s Secret Doping Program\"- Secrets of the Dead - Thirteen/WNET - May 7, 2008 In many cases where doping was believed to happen, no proof was found so most of records and medals won by East German athletes still stand. Aside from doping, East Germany spent a lot of money on sports - mainly Olympic sports. They did this for prestige, propaganda and rivalry with West Germany. The government did a lot of work to find and train athletes and coaches that they believed would do very well. This made it hard say that it was doping rather than very good performance that was the reason for them winning so much. ===Germany undivided=== In 1990, the German reformed back into Germany. The \"NOC of the GDR\" joined the \"NOC of Germany\" on 17 November 1990. The German athletes took part in the Olympic Games in a single team again from 1992 forward. During the first decade after this, athletes from the Eastern part of Germany still won many of Germany's medals. This shows that doping was not the only reason East Germany did so well in the Olympics. It shows that their training conditions were also very important. As trainers and athletes started to move freely around the country, this difference between east and west became smaller. ==Medal tables== ===Medals by Summer Games=== 1952 Helsinki did not participate did not participate did not participate did not participate 1956 Melbourne/Stockholm Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1960 Rome Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1964 Tokyo Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1968 Mexico City 9 9 7 25 1972 Munich 20 23 23 66 1976 Montreal 40 25 25 90 1980 Moscow 47 37 42 126 1984 Los Angeles did not participate did not participate did not participate did not participate 1988 Seoul 37 35 30 102 Total 153 129 127 409 ===Medals by summer sport=== Athletics 38 36 35 109 Swimming 38 32 22 92 Rowing 33 7 8 48 Canoeing 14 7 9 30 Gymnastics 6 13 17 36 Cycling 6 6 4 16 Boxing 5 2 6 13 Shooting 3 8 5 16 Wrestling 2 3 2 7 Diving 2 2 3 7 Sailing 2 2 2 6 Weightlifting 1 4 6 11 Judo 1 2 6 9 Football 1 1 1 3 Handball 1 1 1 3 Volleyball 0 2 0 2 Fencing 0 1 0 1 Total 153 129 127 409 ===Medals by Winter Games=== 1952 Oslo did not participate did not participate did not participate did not participate 1956 Cortina d'Ampezzo Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1960 Squaw Valley Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1964 Innsbruck Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany Part of the United Team of Germany 1968 Grenoble 1 2 2 5 1972 Sapporo 4 3 7 14 1976 Innsbruck 7 5 7 19 1980 Lake Placid 9 7 7 23 1984 Sarajevo 9 9 6 24 1988 Calgary 9 10 6 25 Total 39 36 35 110 ===Medals by winter sport=== Luge 13 8 8 29 Speed skating 8 12 9 29 Bobsleigh 5 5 3 13 Biathlon 3 4 4 11 Figure skating 3 3 4 10 Nordic combined 3 0 4 7 Ski jumping 2 3 2 7 Cross-country skiing 2 1 1 4 Total 39 36 35 110 ==References== * ==Other websites== * GDR Sport System in German Category:Former nations at the Olympics Category:Sport in East Germany",
 "title": "East Germany at the Olympics"
}