{
 "id": "319437",
 "text": "The line of succession to the Danish throne is the list of people who may become King or Queen of Denmark. International Constitutional Law Project (ICL), Denmark; Kurrild-Klitgaard, Peter. Conditional Consent, Dynastic Rights and the Danish Law of Succession; retrieved 2011-12-19. == History == Since 2009, Danish law identifies the eldest child of a Danish monarch the royal heir. The first-born child follows his or her parent on the throne. CBC/Radio- Canada, \"Royal Succession,\" April 22, 2011; retrieved 2011-12-19. This is known as full or equal primogeniture. == Order of succession== In 2023, the current order of succession is clear. ***Margrethe II (born 1940) ** Frederik X (b. 1968) **** (1) Prince Christian (b. 2005) **** (2) Princess Isabella (b. 2007) ****(3) Prince Vincent of Denmark (b. 2011) **** (4) Princess Josephine (b. 2011) *** (5) Prince Joachim (b. 1969) **** (6) Count Nikolai of Monpezat (b. 1999) **** (7) Count Felix of Monpezat (b. 2002) **** (8) Count Henrik of Monpezat (b. 2009) **** (9) Countess Athena of Monpezat (b. 2012) ** (10) Princess Benedikte, Princess of Sayn-Wittgenstein-Berleburg (b. 1944) *** Gustav, 7th Prince of Sayn-Wittgenstein-Berleburg (b. 1969) *** Princess Alexandra of Sayn-Wittgenstein-Berleburg (b. 1970) **** Count Richard von Pfeil und Klein-Ellguth (b. 1999) **** Countess Ingrid von Pfeil und Klein- Ellguth (b. 2003) *** Princess Nathalie of Sayn-Wittgenstein-Berleburg (b. 1975) **** Konstantin Johannsmann (b. 2010) **** Louisa Johannsmann (b. 2015) ===Note=== The consent to Princess Benedikte's marriage to Prince Richard of Sayn-Wittgenstein-Berleburg in 1968 was given on the condition that their children (and further descendants) would have to take up permanent residence in Denmark during the age of mandatory education if they were to retain their succession rights. Since the condition was not met, Princess Benedikte's children are not deemed to have succession rights and are not included in the official line of succession. It is unclear whether their own descendants will have succession rights if residing in Denmark during the age of mandatory education. One Danish constitutional scholar, the late Professor Henrik Zahle, claimed that the children of Princess Benedikte do have succession rights, but without providing any arguments for the claim. == Family tree == == Related pages == * Order of succession ==References== == Other websites == * Danish Monarchy , official website * Succession to the Throne Act, 1953 Category:Danish royalty Denmark",
 "title": "Succession to the Danish throne"
}