{
 "id": "319418",
 "text": "Gerald Jatzek (born 23 January 1956 in Vienna) is an Austrian author, composer and musician. In 1980 he won the Liechtenstein price for poetry. In 2001 he was given the Austrian State Prize for Children's Poetry. == Books == * Der Lixelhix children's book, 1986 * Gegentöne - Kritische Lieder, rebellischer Rock, nonfiction, with Philipp Maurer, ÖGB-Verlag Vienna 1988 * Allerleischlau, children's book, Jugend&Volk;, Vienna - Munic 1989, * Der Tag des Riesen, Picture Book Text, graphic: Annegert Fuchshuber, Ellermann Verlag, Munic 1989 * Widerrede - Die Kabarettung Österreichs, nonfiction, with Philipp Maurer, ÖGB-Verlag, Vienna 1990 * Dina und der Zauberzwerg, children's book, Jungbrunnen Verlag, Vienna 1990, * Der freche Pelikan, Picture Book Text, graphic: Ursula Kirchberg, Ellermann Verlag, Munic 1991, * Isidor, der kleine Drache, Picture Book Text, graphic: Rosemarie P. Sohn, Ellermann Verlag, Munic 1991, * Mein Freund, der Riesenriese, children's book, Neuer Breitschopf Verlag, Vienna 1992, * Ich bin, wer ich will! children's book, with Christian Orou, Neuer Breitschopf Verlag, Wien 1992, * Freddie Flink in Schilda, children's book, with Beppo Beyerl, Neuer Breitschopf Verlag, Wien 1993, * Der Rückwärtstiger, children's book: short stories, St. Gabriel, Mödling 1995, (Paperback: dtv 1998) * Wienerisch - das andere Deutsch, with Beppo Beyerl and Klaus Hirtner, Rump Verlag, Lingen/Ems 1995, * Kuno, das Schulgespenst, children's book, 1996 * Kuno aus der Tasche, children's book: Erzählung plus Rätsel, Noten und Basteltipps, Gabriel, Vienna 1998, * Lexikon der nervigsten Dinge und ätzendsten Typen. Satires, with Beppo Beyerl, Munic 1998 * Valentin und Wanda, children's book, with Beppo Beyerl, Residenz Verlag, St. Pölten 2003 * Wie kommt der Esel auf die Brücke, nonfiction, with Hermann Schlösser, Molden Verlag, Vienna 2008, * Die rote Gitarre, children's book, illustrated by Moidi Kretschmann, G&G-Verlag;, Vienna 2010, . * Der Hase hüpft in hübschen Hosen, children's book with Audio-CD, illustrated by Lisa Manneh, G&G-Verlag;, Vienna 2010, . * Rabauken-Reime, poetrybook, illustrated by Andrea Steffen, Residenz Verlag, St. Pölten 2011, . * Podium Porträt, poetrybook, Podium, Neulengbach and Vienna 2017, . == Songs == *(with Claudia Hainschink:) Das Lied hinter dem Lied. Dialektgedichte und Chansontexte. Cassette, IDI, Vienna 1979 === with Thomas Raber === *Der Tiger und der Jäger, Zeit, Ein Kind ist keine Maschine on the CD \"Liederfundkiste - Juchhe der erste Schnee\", RATOM- Edition, Vienna 2011 *Abrakadabra, Hänsel und Gretel auf dem Klo on the \"Liederfundkiste - In Kinderstadt\", RATOM-Edition, Vienna 2012 *Tsching Tschang Tschung on the \"Liederfundkiste - Eine Schule für Coole\", RATOM- Edition, Vienna 2012 == Editorship == * Gedichte nach 1984. Poetry from Austria, by Gerald Jatzek and Hansjörg Zauner, Edition Ahnungen, Vienna 1985, * Erleichterung beim Zungezeigen. Poetry against frustration, by Gerald Jatzek and Manfred Chobot, Verlag Jugend & Volk, Vienna 1989, * Ich denk, ich denk, was du nicht denkst. Anthology for children, Neuer Breitschopf Verlag, Vienna 1991, * Wenn ich zaubern könnte! Anthology for children, Neuer Breitschopf Verlag, Vienna 1993 * Schmäh ohne, aber echt, Wiener Satire und Humor aus 100 Jahren, by Gerald Jatzek and Manfred Chobot, Edition Mokka, Vienna 2011, == Other websites == *Website von Gerald Jatzek * Official Facebook-Page with poetry in English and German, translations and videos *Biographie bei aeiou.at *Darmstädter Echo: Das Hochhaus spielt Klavier Category:Austrian musicians Category:Austrian writers Category:1956 births Category:Living people",
 "title": "Gerald Jatzek"
}