{
 "id": "319442",
 "text": "The order of succession is a sequence of people and events in a specific order. It may mean the passing of royal or other powers, such as in a dynasty. The \"order of succession\" may be used in a historical way such as in a list of former leaders. Also, the phrase may mean the plan for how a leader takes over from another because of death, resignation, or removal. ==Past lists == Succession becomes a chronology that has developed during time which has passed like a list of popes or a list of emperors of Japan. Succession histories are unique but not always obvious. For example, Charles IX of Sweden (1604–1611) was only the third Swedish king named Charles.Westrin, Johan Theodor. (1910).Karl in Nordisk familjebok; retrieved 2012-1-11. ===Popes=== Pope Francis is the 266th pope of the Roman Catholic Church. Saint Peter is listed as the first one. Across the span of centuries, there have been problems with the list and the order of succession after St. Peter. \"List of Popes,\" Catholic Encyclopedia (2009); retrieved 2011-12-23. For example: During the Western schism in the 14th century, there was more than one pope at the same time. Each had notable international support. \"Western Schism,\" Catholic Encyclopedia; retrieved 2011-12-23. Only some of then are included on the chronology of today's list. European leaders then had to choose to support one pope or the other. *France, Aragon, Castile and León, Cyprus, Burgundy, Savoy, Naples, and Scotland recognized the Avignon popes. *Denmark, England, Flanders, the Holy Roman Empire, Hungary, northern Italy, Ireland, Norway, Poland, and Sweden recognized the Roman popes. ===Japanese monarchs=== Naruhito is the 126th Emperor of Japan. Emperor Jimmu is listed as the first one. The list and the order of succession after Jimmu is not clear.Nussbaum, Louis-Frédéric. (2002). \"Tennō\" in Japan encyclopedia, pp. 962-963. For example, during the Nanboku-chō period in the 14th century, there was more than one emperor at the same time, and each had notable support.Nussbaum, \"Nambokuchō\" at p. 694. Only some of them some are included in today's list. For 500 years, the Imperial chronology included Emperor Kōgon, Emperor Kōmyō, Emperor Sukō, Emperor Go-Kōgon and Emperor Go-En'yū. In the 19th century, those men were removed from the list.Oyama, Kyohei. (1997). \"The Fourteenth Century in Twentieth Century Perspective,\" in The Origins of Japan's Medieval World: Courtiers, Clerics, Warriors, and Peasants in the Fourteenth Century (Jeffrey P. Mass, ed.), p. 397. At the same time, Emperor Go-Murakami, Emperor Chōkei and Emperor Go-Kameyama were added. ==Future list== The \"order of succession\" or \"line of succession\" is a formal plan to determine who inherits a future role or a position in a hierarchy after a death or another cause creates a vacancy or an opportunity for succession. Many countries have developed formal succession planning. In contrast, Kim Jong-il of the Democratic People's Republic of Korea selected his youngest son as the \"Dear Successor\"Kirk, Donald \"Kim Jong-il's death: 4 questions about 'dear successor' Kim Jong-un,\" Christian Science Monitor. December 20, 2011; Harlan, Chico. \"Kim Jong Il, North Korea’s ‘Dear Leader,’ dies, leaving son as successor,\" Washington Post. December 19, 2011; retrieved 2011-12-20. or \"Great Successor\".Branigan, Tania and Justin McCurry. \"North Korea mourns Kim Jong-il and prepares for the 'great successor',\" The Guardian. 20 December 2011; retrieved 2011-12-20. The process that led to his choice is not known. === Monarchies === In some countries, including Sweden since 1980, the Netherlands since 1983, Norway since 1990, Belgium since 1991, Denmark since 2009, and the United Kingdom since 2015, the oldest child of a monarch is expected to become the next monarch. CBC/Radio-Canada, \"Royal Succession,\" April 22, 2011; retrieved 2011-12-19. That is known as \"full\" or \"equal\" as primogeniture.Bloxam, Andy and James Kirkup. \"Centuries-old rule of primogeniture in Royal Family scrapped,\" The Telegraph. 28 October 2011; retrieved 2011-12-19. In many countries including Spain and Japan, special preference is given to male children. That is known as \"male primogeniture.\" === Presidencies === In the United States, the line of succession is explained in the \"Presidential Succession Act of 1947\". If the US President cannot fullfil his duties, the Vice President is expected to take his place, and the House Speaker is next.Presidential Succession: An Overview with Analysis of Legislation Proposed in the 109th Congress, Congressional Research Service Report for Congress, Order Code RL32969, June 29, 2005; retrieved 2011-12-19. ==References== * Category:Government",
 "title": "Order of succession"
}