{
 "id": "319538",
 "text": "Ecological succession, is how a specific ecology changes after a disturbance, like a fire.Connell, Joseph and R. O. Slatyer. (1977). \"Mechanisms of succession in natural communities and their role in community stability and organization,\" The American Naturalist, Vol. 111, Issue 982, pp. 1119–44. In long-term studies, there is a succession in the way forests develop.McEvoy, Thom. (2004). Positive Impact Forestry, p. 32. == Primary succession == Primary succession is the first step of ecological succession. Primary succession happens when new land is formed, allowing it to be colonized for the first time. Primary succession can last up to hundreds or thousands of years. Examples of primary succession are when lava cools and new rocks are formed, a sand dune forming, glaciers retreating and exposing the soil. == Secondary succession == Secondary succession is the second ecological succession. Secondary succession happens when a climax community or intermediate community is disturbed. It then re-establishes a better version of the community. This can take 50 years or more. When a forest is cleared by a fire, a flood, epidemic disease, or a pest attack happens, then there is a secondary growth. == Notable ecologists == * Adolphe Dureau de la Malle was the first to use the word succession. He wrote about the process of re-growth after trees in a forest had been cut down. * Henry David Thoreau described succession in an Oak-Pine forest in \"The succession of forest trees\" in the year 1859. * Henry Chandler Cowles developed a formal concept of plant-growth succession. Henry's work was based on studies of sand dunes in Danish by Eugen Warming. Cowles proposed the term sere. This is a repeat of changes which are shown in specific environmental circumstances.Goldsmith, Edward. \"Ecological succession rehabilitated,\" The Ecologist, Vol. 15 ,#3, 1985 * Frederic Clements proposed a theory that seres were highly predictable. * Henry Gleason proposed that chance factors were very important, even in highly predicable sere areas. == References == == Other websites == * ScienceAid, \"Ecosystems\", Succession Category:Ecology",
 "title": "Ecological succession"
}