{
 "id": "31962",
 "text": "A cousin is a term in genealogy. A cousin is not a direct ancestor or descendant, but is a relative who shares a common ancestor. The word 'cousin' is often used to mean a person's first cousin the child of someone's aunt or uncle. Cousin relationships can have degree and removal (e.g. a second cousin once removed is a cousin with a degree of two and a removal of one). * The family line of the cousin with smallest number of generations to the most recent common ancestor is used to determine the degree (if they are the same use either one). The number of generations from the parents to the common ancestor (number of generations minus one) is the degree. * When the cousins are separated by a different number of generations from the most recent common ancestor, the cousin relationship is \"removed\". The difference between the number of generations for each cousin is the removal. The number in the column and row headings is the number of generations to the most recent common ancestor for this row or column If the relative's → Grandparent (2) Great- grandparent (3) Great-great-grandparent (4) R generations to common ancestor Is the subject's ↓ Then the relative is the subject's ↘ Grandparent (2) 1st cousin 1st cousin once removed 1st cousin twice removed 1st cousin |R-2| times removed Great- grandparent (3) 1st cousin once removed 2nd cousin 2nd cousin once removed 2nd cousin |R-3| times removed Great-great-grandparent (4) 1st cousin twice removed 2nd cousin once removed 3rd cousin 3rd cousin |R-4| times removed S generations to common ancestor 1st cousin |S-2| times removed 2nd cousin |S-3| times removed 3rd cousin |S-4| times removed (min{R,S} - 1) th cousin |R-S| times removed ==Related pages== *Cousin marriage *Consanguinity ==Other websites== *Ancestry.com - cousin removal *Geni.com - Defining the Genealogical Term, 'Removed' *SearchforAncestors.com - Cousin Relationship Calculator *Eastman's Online Genealogy Newsletter - What Is \"Second Cousin Once Removed?\" Category:Family",
 "title": "Cousin"
}