{
 "id": "319658",
 "text": "was the 82nd emperor of Japan, according to the traditional order of succession.Imperial Household Agency (Kunaichō), 後鳥羽天皇 (82); retrieved 2011-12-20. His reign started in 1183 and ended in 1198. This 12th century sovereign was named after Emperor Toba and means \"later\". He is sometimes called the later Emperor Toba. In some older sources, this emperor may be identified as \"Toba the Second\" or as \"Toba II\". == Traditional history== Before he became the monarch, his personal name (imina) was ,Varley, p. 215. or Takanari-shinnō. He was the fourth son of Emperor Takakura. ==Events of Go- Toba's life== Go-Toba was placed on the throne at the age of three. * 8 September 1183 (Juei 2, 20th day of the 8th month): In the 3rd year of Antoku- tennō 's reign, the emperor and his court fled the capital. In the emperor's absence, former-Emperor Go-Shirakawa made Antoku's younger brother emperor by decree. A ceremony which marked the young prince's acceptance of the abdication (juzen).Varley, p. 216. * 1184' (Juei 3): Emperor Go-Toba is said to have accepted the monarch's role and duties and powers (sokui). This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go- Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. * 1192 (Kenkyū 3): Go-Shirakawa died. Go-Toba was the grandson of Emperor Go-Shirakawa. * 1198 (Kenkyū 9): In the 15th year of Go-Toba's reign, he abdicated. His successor was his eldest son who became known as Emperor Tsuchimikado. * 1210 (Jōgen 4): Go-Toba's 3rd son was named emperor; and he became known as Emperor Juntoku. * 1221 (Jōkyū 3): Go-Toba and his supporters tried and failed to take power from the Kamakura shogunate. This was known as the Jōkyū War (Jōkyū no hen) Go-Toba was exiled to the Oki Islands where he stayed until his death.Mason, R.H.P. Mason and J.G. Caiger. (1972). A History of Japan, p. 105. * 13 May 1221 (Jōkyū 3, 20th day of the 4th month): Go-Toba's 4-year-old grandson was made emperor; and he became known as Emperor Chūkyō. * 14 January 1222 (Jōkyū 3, 1st day of the 12th month): Go-Toba's nephew was made emperor; and he became known as Emperor Go-Horikawa. * 1239 (En'ō 1, 2nd month): Go-Toba died at age 60. ===After his death === Go-Toba was buried on Dōgo Island in the Oki Islands group. Later a part of his body was re-buried in Kyoto. According to the Imperial Household Agency, the mausoleum (misasagi) of Go-Toba is in Kyoto. The emperor is traditionally venerated at a memorial Shinto shrine at Ōhara no Misasagi. ==Eras of Go-Toba's reign== The years of Go-Toba's reign are marked by more than one era name:. * Juei (1182–1184) * Genryaku (1184–1185) * Bunji (1185–1190) * Kenkyū (1190–1199) == Related pages == * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Insei ==References== == Other websites == Category:Emperors of Japan Category:1180 births Category:1239 deaths",
 "title": "Emperor Go-Toba"
}