{
 "id": "319723",
 "text": ":For the 124th emperor also known as Hirohito, see Hirohito Emperor Fushimi (伏見天皇 Fushimi-tennō) (10 May 1265 - 8 October 1317) was the 92nd emperor of Japan, according to the traditional order of succession.Imperial Household Agency (Kunaichō), 伏見天皇 (92); retrieved 2011-10-20. His reign started in 1287 and ended in 1298. == Traditional history == Before he became the monarch, this prince's personal name (imina) was . ::Note: Although the Roman-alphabet spelling of the name of this 13th-century emperor is the same as the personal name of Emperor Shōwa, the kanji are different: ::: Emperor Fushimi, formerly Prince Hirohito (熈仁) ::: Emperor Shōwa, formerly Prince Hirohito (裕仁) Prince Hirohito was the second son of Emperor Go-Fukakusa. == Events of Fushimi's life == Hirohito-shinnō was named Crown Prince. He became heir to Emperor Go- Uda. * 1287 (Kōan 10, 10th month): In the 13th year of Go-Uda-tennō 's reign, he abdicated. The succession (the senso) was received by his cousin. * 1288 (Kōan 11): Emperor Fushimi is said to have accepted the monarch's role and duties and powers (sokui). This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. * 1289 (Shōō 2, 4th month): Fushimi adopted the son of his younger brother; and this new son was named Crown Prince and heir. * 19 April 1290 (Shōō 3, 9th day of the 3rd month): Assassins failed in an attempt to kill the emperor in his palace. * 1298 (Einin 6, 7th month): In the 11th year of Fushimi's reign, he abdicated. His heir became known as Emperor Go-Fushimi. * 1301 (Shōan 3, 1st month): In the 5th year of Go-Fushimi's reign, the adopted son of Fushimi was forced to abdicate. * 1308 (Tokuji 3, 8th month): In the 8th year of Emperor Go-Nijo's reign, the young ruler died at age of 24. Fushimi's grandson was named as Go-Nijo's successor. Go-Fushimi's son became known as Emperor Hanazono. * 1313 (Shōwa 2, 10th month): Retired Emperor Fushimi shaved his head and became a Buddhist monk. * 1317 (Bunpō 1, 9th month): Former-Emperor Fushimi died at age 53. ===After his death=== According to the Imperial Household Agency, the mausoleum (misasagi) of Kammu is in Kyoto. The emperor is traditionally venerated at a memorial Shinto shrine at Fukakusa no kita no misasagi (深草北陵) in Fushimi-ku in Kyoto.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 422. ==Eras of Fushimi's reign== The years of Fushimi's reign are marked by more than one era name. * Kōan (1278–1288) * Shōō (1288–1293) * Einin (1293–1299) == Related pages == * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree == References == == Other websites == Category:Emperors of Japan Category:1265 births Category:1317 deaths",
 "title": "Emperor Fushimi"
}