{
 "id": "31976",
 "text": "Livestock are domestic animals that are kept by people. Their uses are for meat, milking, wool, leather, or labor. Taking care of livestock is animal husbandry. Some types of livestock are: cattle, pigs, sheep, goats, and chickens. Chickens produce eggs; pigs produce meat; cattle, goats and sheep create milk, and sheep also create wool. Horses, cattle, camels, llamas, water buffalo, and other large animals do work for people, such as pulling wagons and other vehicles. The breeding, keeping alive, and killing of livestock is called animal husbandry. Animal husbandry have been practiced by humans for a long time. There are different animal husbandry practices used by different cultures. It is an important part of the economy and culture of many countries. Intensive animal farming, which is sometimes called \"factory farming\" is mostly used today. 99% of livestock in the US are now raised with intensive animal farming. Intensive animal farming increases the amount of things we can get from the livestock but it has also led to bad effects on animal welfare, the environment, and public health. ==Etymology== Livestock as a word was first used between 1650 and 1660. Today, cattle means domesticated bovines, while livestock now means domesticated animals. == History == Animal husbandry started when humans stopped hunting and gathering and settled in farming communities. Animals are domesticated when the way they breed and live are controlled by humans. After a long time, the way they act and the way they look changes. Today, many farm animals cannot live in the wild. The dog was domesticated in Europe and the Far East from about 15,000 years ago. Goats and sheep were domesticated between 11,000 and 5,000 years ago in Southwest Asia. Pigs were domesticated by 8,500 BC in the Near East and 6,000 BC in China. Domestication of the horse dates to around 4000 BC. Cattle have been domesticated since approximately 10,500 years ago. Chickens and other poultry may have been domesticated around 7000 BC. ==Some common livestock== Image Animal Wild ancestor Where it was domesticated Uses Horse Tarpan Mongolia For meat, milk, hide, work, riding, and racing Donkey African wild ass Africa For meat, milk, hide, work, and riding Cattle Aurochs Eurasia For meat, milk, hide, work Zebu Indian aurochs Eurasia For meat, milk, hide, work Bali cattle Banteng Southeast Asia For meat, milk, hide, work Domestic yak Wild yak Tibet For meat, milk, hide, work Water buffalo Wild water buffalo India and Southeast Asia For meat, milk, hide, work Gayal Gaur India and Malaysia For meat, milk, hide, work Domestic sheep Mouflon Iran and Asia minor For meat, milk, and fleece Domestic goat Wild goat Greece and Pakistan For meat, milk, and fleece Reindeer Reindeer Eurasia For meat, milk, hide, work Bactrian camel Wild Bactrian camel Central Asia For meat, milk, hide, work, riding, and racing Arabian camel Thomas's camel North Africa and Southwest Asia For meat, milk, hide, work, riding, and racing Llama Guanaco Andes For meat, milk, hide, and work Alpaca Guanaco Andes For meat, milk, hide, and work Domestic pig Wild boar Eurasia For meat, hide Rabbit European rabbit Europe For meat, skins, Angora wool, and as a pet Guinea pig Montane guinea pig Andes For meat and as a pet Domestic pigeon Rock dove Old World For meat, eggs, and as homing pigeons Barbary dove African collared dove Africa For meat and eggs Chicken Red junglefowl Southeast Asia For meat, eggs, and cockfighting Domestic turkey Wild turkey Central America For meat and eggs Domestic duck Mallard Southeast Asia For meat and eggs Domestic Muscovy duck Muscovy duck Americas For meat and eggs Domestic goose Greylag goose North Africa, Southern Europe, or Western Asia For meat and eggs Chinese goose African goose Swan goose China For meat and eggs Domestic guineafowl Helmeted guineafowl Africa For meat and eggs == References == Category:Domesticated animals",
 "title": "Livestock"
}