{
 "id": "319722",
 "text": "Béla Guttmann (27 January 1899 – 28 August 1981) was a Hungarian footballer and coach of Jewish origin. His playing position was midfielder. ==Career== ===Player=== He started his career with the MTK Hungária FC team of the early 1920s. He won the championship in 1920 and 1921. In 1922 he went to Vienna to escape the antisemitism of the Hungarian regime. There he played for SC Hakoah Wien. In 1925 he won another league title when Hakoah won the Austrian League. In April 1926 the SC Hakoah Wien team sailed to New York to play against different American teams. He stayed in the USA and played for the Brooklyn Wanderers, New York Giants, New York Hakoah, New York Soccer Club and the Hakoah All-Stars. As player he had 6 matches with the Hungarian national football team and scored one goal there. ===Coach=== Guttmann returned to Europe in 1932. He coached teams in Austria, The Netherlands and Hungary . (SC Hakoah Wien, SC Enschede) He had his first success with Újpest FC in the 1938–39 season. He won the Hungarian League and the Mitropa Cup. How Guttman spent the war years in unclear. Guttmann himself is said to have escaped to Switzerland where he was interned. The years after the Second World War he spent as coach in Italy, South America and Portugal.(São Paulo FC, AC Milan, Benfica Lisabon and others). Together with Márton Bukovi and Gusztáv Sebes, Guttmann formed a triumvirate of Hungarian coaches who pioneered the 4–2–4 formation. Guttman is also credited with mentoring Eusébio. He was as player and coach always good for controversy. Some people compare his self-confidence with José Mourinho.Jonathan Wilson (17 January 2007). London: http://blogs.guardian.co.uk/sport/2007/01/17/chelsea_be_warned_a_guttman_is.html. Retrieved 20 December 2011. ==Honours== ===Player=== MTK Hungária FC *Hungarian League: 2 **1919–20, 1920–21 SC Hakoah Wien *Austrian Champions: 1 **1924–25 New York Hakoah *U.S. Open Cup: 1 **1929 ===Manager=== Újpest FC/Újpesti TE *Hungarian League: 2 **1938–39, 1946–47 *Mitropa Cup: 1 **1939 São Paulo *São Paulo State Champions: 1 **1957 Porto *Portuguese Liga: 1 **1958–59 Benfica *European Champions: 2 **1960–61, 1961–62 *Portuguese Liga: 2 **1959–60, 1960–61 *Portuguese Cup: 1 **1961-62 ==References== == Other websites == *Guttmann at United States Soccer Hall of Fame *Guttmann at www.jewsinsports.org * Guttmann at www.jewishsports.net *UEFA biography *Biographical article on Guttmann, Bremen University Category:Austria national football team managers Category:Footballers from Budapest Category:Hungarian football managers Category:1899 births Category:1981 deaths Category:A.C. Milan managers Category:FK Austria Wien managers",
 "title": "Béla Guttmann"
}