{
 "id": "319897",
 "text": "Ireland has been at the Summer Olympic Games since 1924, and at the Winter Olympic Games since 1992. Before 1922, Ireland was part of the United Kingdom of Great Britain and Ireland. Irish athletes at earlier Games are counted as British in Olympic numbers. ==Medal tables== The following tables include medals won by athletes on Irish teams together with one poet. All medals are from the Summer Games. Ireland's best result at the Winter Games was fourth, by Clifton Wrottesley in the Men's Skeleton in 2002 at Salt Lake City. ===Medallists (28)=== Medal Name Games Sport Event 1924 Paris Poetry Poetry 1928 Amsterdam Athletics Men's hammer throw 1932 Los Angeles Athletics Men's 400 metre hurdles 1932 Los Angeles Athletics Men's hammer throw 1952 Helsinki Boxing Men's bantamweight 1956 Melbourne Athletics Men's 1500 metres 1956 Melbourne Boxing Men's welterweight 1956 Melbourne Boxing Men's flyweight 1956 Melbourne Boxing Men's bantamweight 1956 Melbourne Boxing Men's lightweight 1964 Tokyo Boxing Men's lightweight 1980 Moscow Boxing Men's flyweight James Wilkinson 1980 Moscow Sailing Flying Dutchman class 1984 Los Angeles Athletics Men's marathon 1992 Barcelona Boxing Men's welterweight 1992 Barcelona Boxing Men's bantamweight 1996 Atlanta Swimming Women's 400 metre freestyle 1996 Atlanta Swimming Women's 200 metre individual medley 1996 Atlanta Swimming Women's 400 metre individual medley 1996 Atlanta Swimming Women's 200 metre butterfly 2000 Sydney Athletics Women's 5000 metres 2008 Beijing Boxing Men's Light flyweight 2008 Beijing Boxing Men's Light Heavyweight 2008 Beijing Boxing Men's Middleweight 2012 London Equestrian Individual jumping 2012 London Boxing Women's lightweight 2012 London Boxing Men's light flyweight 2012 London Boxing Men's flyweight 2012 London Boxing Men's bantamweight ===Medals by Summer Games=== 1924 Paris 0 0 0 0 1928 Amsterdam 1 0 0 1 1932 Los Angeles 2 0 0 2 1936 Berlin did not participate did not participate did not participate did not participate 1948 London 0 0 0 0 1952 Helsinki 0 1 0 1 1956 Melbourne/Stockholm 1 1 3 5 1960 Rome 0 0 0 0 1964 Tokyo 0 0 1 1 1968 Mexico City 0 0 0 0 1972 Munich 0 0 0 0 1976 Montreal 0 0 0 0 1980 Moscow 0 1 1 2 1984 Los Angeles 0 1 0 1 1988 Seoul 0 0 0 0 1992 Barcelona 1 1 0 2 1996 Atlanta 3 0 1 4 2000 Sydney 0 1 0 1 2004 Athens 0 0 0 0 2008 Beijing 0 1 2 3 2012 London 1 1 3 5 Total 9 8 11 28 ===Medals by sport=== Athletics 4 2 0 6 Swimming 3 0 1 4 Boxing 2 5 9 16 Sailing 0 1 0 1 Equestrian 0 0 1 1 Total 9 8 11 28 ==Related pages== * List of IOC country codes == References == ==Other websites == * Ireland profile at London2012.com Category:Nations at the Olympics Olympics Category:National sports teams of Ireland",
 "title": "Ireland at the Olympics"
}