{
 "id": "319916",
 "text": "Liechtenstein at the Olympics is a history which began in 1948. The International Olympic Committee's official abbreviation for Liechtenstein was LIC. \"Official abbreviations\" at The Games of the XVIII Olympiad, Tokyo, 1964, [p. 9 of 409 PDF]; retrieved 2012-10-12. It is now LIE.\"Abbreviations, National Olympic Committees,\" 2009 Annual Report, p. 91 [PDF p. 92 of 94]; retrieved 2012-10-12. ==History== Liechtenstein was first at the Olympic Games in 1936. They have been in most Summer Olympic Games and Winter Olympic Games since then. Athletes from Liechtenstein have won a total of nine medals, all in alpine skiing. It is the only nation to have won all of its medals at the Winter Olympics. The National Olympic Committee for Liechtenstein was formed in 1935. Xaver Frick, a founding member of the country's NOC, is the only Liechtenstein athlete to have been in both the summer and winter Olympic games. ==Medalists== Medal Name Games Sport Event 1976 Innsbruck Alpine skiing Men's slalom 1976 Innsbruck Alpine skiing Women's slalom 1980 Lake Placid Alpine skiing Women's giant slalom 1980 Lake Placid Alpine skiing Women's slalom 1980 Lake Placid Alpine skiing Women's downhill 1980 Lake Placid Alpine skiing Men's giant slalom 1984 Sarajevo Alpine skiing Men's giant slalom 1984 Sarajevo Alpine skiing Women's slalom 1988 Calgary Alpine skiing Men's slalom ==Medals by Winter Games== 1936 Garmisch-Partenkirchen 0 0 0 0 1948 St. Moritz 0 0 0 0 1952 Oslo did not participate did not participate did not participate did not participate 1956 Cortina d'Ampezzo 0 0 0 0 1960 Squaw Valley 0 0 0 0 1964 Innsbruck 0 0 0 0 1968 Grenoble 0 0 0 0 1972 Sapporo 0 0 0 0 1976 Innsbruck 0 0 2 2 1980 Lake Placid 2 2 0 4 1984 Sarajevo 0 0 2 2 1988 Calgary 0 0 1 1 1992 Albertville 0 0 0 0 1994 Lillehammer 0 0 0 0 1998 Nagano 0 0 0 0 2002 Salt Lake City 0 0 0 0 2006 Turin 0 0 0 0 2010 Vancouver 0 0 0 0 2014 Sochi 0 0 0 0 Total 2 2 5 9 ==Related pages== * List of IOC country codes ==References== ==Other websites== * Category:Nations at the Olympics Olympics Category:National sports teams of Liechtenstein",
 "title": "Liechtenstein at the Olympics"
}