{
 "id": "319962",
 "text": "The Jin dynasty (1115–1234) is also known as the Jurchen dynasty, and as the Great Jin. It was one of the last dynasties before Mongol invasion (and eventual conquest) of China. The dynasty was founded by the Wanyan (完顏 Wányán) clan of the Jurchens.Mote, Frederick W. (2003). Imperial China 900-1800, p. 271. These were the ancestors of the Manchu, who established the Qing dynasty some 500 years later. The Jin Dynasty was founded in northern Manchuria, The founder was Wanyan Aguda (完顏阿骨打).Holcombe, Charles. (2011). A History of East Asia: from the origins of civilization to the twenty-first century, p. 129. The name of this dynasty is sometimes written as Jinn to differentiate it from an earlier Jin dynasty (265-420) of China whose name is spelt identically in the Roman alphabet. The History of Jin recorded that Tangkuo Dingge (唐括定哥), Consort Gui (貴妃) was a Jurchen woman. She was first married to the Jurchen Jin royal Wanyan Wudai (完顏烏帶. She had an affair with her Han Chinese slave, Yan Qi'er (閻乞兒) and with Wanyan Liang (Prince Hailing). When Wanyan Liang became emperor of the Jin dynasty he forced Dingge to have her husband Wanyan Wudai killed by her other slaves, Ge Wen (葛溫) and Ge Lu (葛魯) and he promised that she would be named empress. Wanyan Liang broke his promise after he got bored of her when she entered the harem. Dingge then smuggled Yan Qi'er into the palace through a trunk after first smuggling a trunk full of her clothes as a dummy and then reprimanded him for looking at her clothes so he wouldn't look when Yan Qi'er was smuggled in next. Dingge and Yan Qi'er had sex until a Jurchen maid, Guige (貴哥) told on them to the emperor and Dingge was strangled and Yan Qi'er was beheaded. Feng Menglong wrote a novelized version of the historical account in his book Stories to Awaken the World. ==References== Category:Former empires Category:Chinese dynasties Category:1110s establishments Category:1230s disestablishments",
 "title": "Jin dynasty (1115–1234)"
}