{
 "id": "319932",
 "text": "A National Olympic Committee of the Saarland14–17 May 1950: The Olympic Committee of the Federal Republic of West Germany is provisionally accepted at the 45th IOC Session in Copenhagen after a supporting letter from the High Commissioner in the FRG, Sir Hugh Robertson, is read out by Lord David Burghley. A decision as to the participation of the Germans at the 1952 Games is to be made later. At this session the foundation of the NOC for the Saarland is recognized founded in spring 1950. - Journal of Olympic History, FOUNDATION DATES OF THE GERMAN OLYMPIC COMMITTEE, by a Working Group of the Karl Diem Archive, Köln, Walter Borgers, Karl Lennartz, Dietrich R. Quanz, Walter Teutenberg was created in spring of 1950 in the Saar protectorate, a part of Western Germany that was controlled in 1945 by France. As a separate team, they only took part in the 1952 Summer Olympics. The athletes of Saar joined the German team for the summer games of 1956. 36 people, 31 men and 5 women, took part in 32 events in 9 sports. The Protectorate became the German state of Saarland after 1956. == History == After World War II, the Saarland was not allowed to become part of the Federal Republic of Germany in May 1949. Its annexation by France was not allowed by the other Allies and the Atlantic charter's points 2 and 3. Because local population did not want to join France, separate international organisations were created. These included the Saarland football team and in 1950 a NOC, in German called Nationales Olympisches Komitee des Saarlandes.1950–1957 Nationales Olympisches Komitee des Saarlandes, in Nationales Olympisches Komitee (NOK) für Deutschland - Geschichte, Struktur, Aufgaben und Arbeitsweise uni-leipzig.de ; \"Sporting Codes for Countries,\" Encyclopaedia Britannica Almanac 2009, p. 784. The region did not send athletes to Oslo for the 1952 Winter Olympics. The Saarland had history of over 500 years of coal mining. They gave a miner's safety lampOfficial Report, p. 103The Flame travelled by air in a miner's lamp presented for the purpose by the National Olympic Committee of the Saar, photo aboard airplane, Official report p. 208 in which the flame of the torch relay of the 1952 Summer Olympics in Helsinki could be carried safely on airplanes. At the opening ceremony, 36Olympische Spiele 1896-1996, Ein deutsches Politikum. Agenda Verlag Münster, 1996. athletes from the Saarland marched in front Official Report, p. 236, photos of teams presenting signs in Finnish language: RUOTSI (Sweden), SAAR (Saarland), SAKSA (Germany), SINGAPORE of the team of Germany. They did not win a medal. They were ranked 44th among a total of 69 teams Many other teams with no wins were all ranked 44th together. The Saar treaty of October 1956 allowed the Saarland to rejoin Germany as of 1 January 1957. Although it was possible, no separate Saarland teams were sent to the 1956 games. A United Team of Germany that included athletes of all three German states took part in the Olympics that year. 1952 was the only Olympic appearance of the Saarland as a separate team. The Olympic Committee of the Saarland 1950 February 1957: Formal disbanding of the Olympic Committee of the Saarland., in Nationales Olympisches Komitee (NOK) für Deutschland - Geschichte, Struktur, Aufgaben und Arbeitsweise uni-leipzig.de ended in February 1957 and its members became part of the German NOC. ==Related pages == * List of IOC country codes == References == == Other websites == * Helsinki 1952 Official Olympic Report olympic-museum.de * Helsinki 1952 Official Olympic Report la84foundation.org Category:Former nations at the Olympics Category:Sport in Saarland",
 "title": "Saar at the 1952 Summer Olympics"
}