{
 "id": "319902",
 "text": "Israel has been at the Olympic Games as a nation since 1952. Its National Olympic Committee was formed in 1933 during the British Mandate of Palestine. As the team represented the Jewish community, it boycotted the 1936 Games in Germany in protest of the Nazi Party's anti-Semitic policies. Israel has sent a team to each Summer Olympic Games since 1952 (except the 1980 Summer Olympics) and to each Winter Olympic Games since 1994. In 1972, 11 members of the Israeli delegation were murdered by Black September terrorists. ==List of medalists== Medal Name Games Sport Event 1992 Barcelona Judo Women's half middleweight 1992 Barcelona Judo Men's lightweight 1996 Atlanta Sailing Men's sailboard 2000 Sydney Canoeing Men's K-1 500 metres 2004 Athens Judo Men's half heavyweight 2004 Athens Sailing Men's sailboard 2008 Beijing Sailing Men's sailboard 2016 Rio de Janeiro Judo Women's half middleweight 2016 Rio de Janeiro Judo Men's heavyweight ==Medal tables== ===Medals by Games=== 1992 Barcelona 0 1 1 2 1996 Atlanta 0 0 1 1 2000 Sydney 0 0 1 1 2004 Athens 1 0 1 2 2008 Beijing 0 0 1 1 2012 London No medals won No medals won No medals won No medals won 2016 Rio de Janeiro 0 0 2 2 Total 1 1 7 9 ===Medals by sport=== Sailing 1 0 2 3 Judo 0 1 4 5 Canoeing 0 0 1 1 Total 1 1 7 9 ==Athletes killed in the 1972 Olympics == The eleven members of Israel's 1972 Olympic team killed during the Munich massacre: *David Berger, 28, weightlifter *Ze'ev Friedman, 28, weightlifter *Yossef Gutfreund, 40, wrestling referee *Eliezer Halfin, 24, wrestler *Yossef Romano, 31, weightlifter *Amitzur Shapira, 40, track coach *Kehat Shorr, 53, shooting coach *Mark Slavin, 18, wrestler *Andre Spitzer, 27, fencing coach *Yakov Springer, 51, weightlifting judge *Moshe Weinberg, 33, wrestling coach ==Related pages== * List of IOC country codes == References == ==Other websites == * Olympic Committee of Israel * Israel at SportsReference.com * Israel profile at London2012.com Category:Nations at the Olympics Category:Sport in Israel Category:National sports teams of Israel",
 "title": "Israel at the Olympics"
}