{
 "id": "319983",
 "text": "Royal Rumble (2012) was a professional wrestling pay-per-view (PPV) event made by WWE that took place on January 29, 2012 at the Scottrade Center in St. Louis, Missouri. It was the 25th yearly Royal Rumble event. ==Background== As is the case every year since the event's beginning, the event's main event was the 30-man over-the-top-rope battle royal, also known as the Royal Rumble match. The match started with two wrestlers and a new one was added every 90 seconds. To eliminate an opposing wrestler he must be thrown over the top rope and have both his two feet hit the floor, this will continue until there is only one man left, who is named the winner. The winner received either a WWE Championship match or a World Heavyweight Championship match at WrestleMania XXVIII. ==Matches== # Matches Stipulations Time Dark Yoshi Tatsu defeated Heath Slater Singles match 4:00 1 Daniel Bryan (c) defeated Mark Henry and Big Show Triple Threat Steel Cage match for the World Heavyweight Championship 9:08 2 Beth Phoenix, Natalya, and The Bella Twins (Nikki Bella and Brie Bella) defeated Kelly Kelly, Eve, Alicia Fox, and Tamina 8-Diva Tag Team 5:29 3 John Cena fought Kane to a double countout Singles match 10:56 4 Brodus Clay defeated Drew McIntyre 1:05 5 CM Punk (c) defeated Dolph Ziggler John Laurinaitis was the special guest referee. Vickie Guerrero and Jack Swagger were banned from ringside. 14:32 6 Sheamus last eliminated Chris Jericho to win 2012 Royal Rumble match 54:54 ==Royal Rumble entrances and eliminations== Entry order Entrant Brand Elimination order Eliminated by Time Raw 24 Big Show Raw 1 The Miz Raw 2 The Miz SD 25 Big Show SD 4 Mick Foley and Ricardo Rodriguez Raw 3 Mick Foley Legend 8 Cody Rhodes Raw 5 Santino Marella Raw 7 Cody Rhodes 10 Raw 6 Mick Foley 11 Raw 18 Sheamus 12 Legend 9 Cody Rhodes 13 Ezekiel Jackson SD 12 The Great Khali 14 SD 11 The Great Khali 15 SD 14 Cody Rhodes 16 SD 16 Kharma 17 Legend 10 Cody Rhodes 18 Raw 26 Big Show 19 Jim Duggan Legend 13 Cody Rhodes 20 Raw 15 Booker T and Jerry Lawler 21 Raw 17 Dolph Ziggler 22 SD - Winner 23 Legend 19 Wade Barrett 24 SD 20 Randy Orton 25 Raw 23 Big Show 26 SD 21 Randy Orton 27 Raw 22 Chris Jericho 28 SD 28 Chris Jericho 29 Raw 29 Sheamus 30 SD 27 Randy Orton ==References== ==Related pages== *Royal Rumble == Other websites == *Official Royal Rumble website Category:2012 in professional wrestling Category:Sports in St. Louis, Missouri 2012 Category:2012 in the United States Category:2010s in St. Louis, Missouri Category:January 2012 events",
 "title": "Royal Rumble (2012)"
}