{
 "id": "320042",
 "text": "Serbia was first at the Olympic Games in 1912. After 96 years, Serbia returned to the Olympics as an independent team at the 2008 Summer Olympics. From 1920 to the 1992 Winter Olympics Serbian athletes were part of the Yugoslavian team. At the 1992 Summer Olympics they took part as Independent Olympic Participants. This was because the United Nations was threatening to punish Serbia. Because of this, no Serbians were at the 1994 Winter Olympics. The threats stopped in 1995. From the 1996 Summer Olympics to the 2006 Winter Olympics they were part of the Serbia and Montenegro team. == Medal tables == === Medals by Summer Games === Games Athletes Gold Silver Bronze Total Rank 3 0 0 0 0 – 1920–1988 as part of as part of as part of as part of as part of as part of as part of the as part of the as part of the as part of the as part of the as part of the 1996–2004 as part of as part of as part of as part of as part of as part of 92 0 1 2 3 61 116 1 1 2 4 43 103 2 4 2 8 32 Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Future events Total Total 3 6 6 15 72 === Medals by Winter Games === Games Athletes Gold Silver Bronze Total Rank 1924–1992 as part of as part of as part of as part of as part of as part of 1994–2006 as part of as part of as part of as part of as part of as part of 10 0 0 0 0 – 8 0 0 0 0 – 4 0 0 0 0 – Future events Future events Future events Future events Future events Future events Total Total 0 0 0 0 – === Medals by sport === 1 1 0 2 1 0 2 3 1 0 0 1 0 1 1 2 0 1 1 2 0 1 0 1 0 1 0 1 0 1 0 1 0 0 1 1 0 0 1 1 Total 3 6 6 15 ==List of medalists== Medal Name(s) Games Sport Event Milorad Čavić Swimming Men's 100 m butterfly Novak Djokovic Tennis Men's singles Water polo Men's tournament Milica Mandić Taekwondo Women's +67 kg Ivana Maksimović Shooting Women's 50 m rifle three positions Andrija Zlatić Shooting Men's 10 m air pistol Water polo Men's tournament Wrestling Men's Greco-Roman 66 kg Water polo Men's tournament Tijana Bogdanović Taekwondo Women's 49 kg Marko Tomićević Milenko Zorić Canoeing Men's K-2 1000 m Volleyball Women's tournament Basketball Men's tournament Ivana Španović Athletics Women's long jump Basketball Women's tournament ==Flagbearers== ;Summer Olympics Games Athlete Sport 2012 London Tennis 2008 Beijing Jasna Šekarić Shooting ;Winter Olympics Games Athlete Sport 2010 Vancounver Jelena Lolović Alpine skiing ==Related pages== * List of IOC country codes == References == ==Other websites == * Serbia profile at London2012.com Category:Sport in Serbia Category:Nations at the Olympics",
 "title": "Serbia at the Olympics"
}