{
 "id": "320001",
 "text": "A block (known as UIB when referenced to being blocked from contributing Wikipedia) is action taken to stop certain people having access to information. If a website activates a block based on the internet protocol address (IP address) of a user, that block can effect other users that share the address. Some blocked users try to evade the block called as block evasion by making a different account called as sockpuppetry, using a proxy server, or editing unblocked IP address while their user account is blocked. == Effects == Blocked users may be completely unable to access all or part of a site's content, which is usually the case when censoring or filtering mechanisms are responsible for the block. Under a shadow ban, a user is given the false impression that their content is still being posted to the site, when in reality it is being hidden from all other users. In Wikipedia, users with blocked IP address or user account prohibit from contributing by any means through editing and creating pages, and uploading images and videos. An option to edit unprotected pages are still shown as \"Edit\" or \"Edit source\" even while an IP address or user is blocked to confuse users who try to edit them at first glance but technically, the option actually views the source of a particular page when trying to click them while the block is in effect similar to protected pages. This makes the site read and view source only that limits the user to viewing the pages and their source code. Blocks are lifted automatically if it is limited time while those that are indefinite can only be removed manually through the standard offer and reviewing administrator's decision to unblock by accepting the content of an appeal later on after the designated waiting period as part of the offer, both can make the user restore their contributing privileges. On other wiki sites, the same effect, procedure, and unblocking is the same as Wikipedia, with some differing due to the methods used on unblocking and the way administrators do when reviewing unblock appeals on a particular site. The block notice may not also show when trying to edit on some sites, with only sign that the user will not be able to contribute due to being blocked is when the flashing bar symbol do not appear when clicking while on the edit screen. Category:Internet",
 "title": "Block (Internet)"
}