{
 "id": "320009",
 "text": "Russia has been at the modern Olympic Games many times. They have been called different nations. As the Russian Empire, they were first at the 1900 Games. They returned again in 1908 and 1912. After the Russian revolution in 1917, and the establishment of the Soviet Union in 1922, they were not at the Olympics again until the 1952 Summer Olympics. After the dissolution of the Soviet Union in 1991, Russia competed as part of the Unified Team in 1992. They returned once again as Russia at the 1994 Winter Olympics. The Soviet Union hosted the 1980 Summer Olympics in Moscow. Russia has hosted the 2014 Winter Olympics in Sochi. Since 2012, Russian athletes have won a total of 404 medals (399 since 1994) at the Summer Olympic Games. They have another 91 at the Winter Olympic Games. Over the most recent ten Games (since 1994), Russia's 495 total medals, including 170 gold medals, are second only to the United States (with 631 and 237, respectively). The Russian Olympic Committee was formed in 1991 and recognized in 1993. == Medal tables == :*Red border color indicates tournament was held on home soil. === Medals by Summer Games === Games Athletes Gold Silver Bronze Total Rank 1900–1912 As part of the As part of the As part of the As part of the As part of the As part of the 1920–1948 Did not participate Did not participate Did not participate Did not participate Did not participate Did not participate 1952–1988 As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the 390 26 21 16 63 2 435 32 28 29 89 2 446 28 26 36 90 3 455 24 13 23 60 3 436 20 20 30 70 4 2911 19 17 20 56 4 Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Future event Total Total 149 125 154 428 10 === Medals by Winter Games === Games Athletes Gold Silver Bronze Total Rank 1924–1952 Did not participate Did not participate Did not participate Did not participate Did not participate Did not participate 1956–1988 As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the As part of the 113 11 8 4 23 1 122 9 6 3 18 3 151 5 4 4 13 5 190 8 6 8 22 4 177 3 5 7 15 11 232 11 9 9 29 1 As the 2 As the 2 As the 2 As the 2 As the 2 As the 2 Future event Future event Future event Future event Future event Future event Total Total 47 38 35 120 9 === Medals by summer sport === 30 11 15 56 22 22 20 64 21 20 21 62 13 5 8 26 10 5 15 30 10 0 0 10 7 13 11 31 5 9 9 23 5 5 9 19 5 4 7 16 4 8 6 18 4 7 7 18 4 1 0 5 3 3 2 8 2 3 8 13 2 1 1 4 1 3 2 6 1 0 2 3 0 2 2 4 0 1 3 4 0 1 1 2 0 1 1 2 0 0 3 3 0 0 1 1 Total 149 125 154 428 === Medals by winter sport === 14 10 9 33 14 9 3 26 10 4 8 22 3 5 5 13 3 1 1 5 2 2 1 5 1 0 2 3 0 1 3 4 0 1 1 2 0 1 1 2 0 1 0 1 0 3 0 3 0 0 1 1 Total 47 38 35 120 ;Notes * 1: partially banned due to the state-sponsored doping program. * 2: banned due to the state-sponsored doping program. ==Flag Bearers== * 1994 Winter Olympics - Sergey Chepikov * 1996 Summer Olympics - Alexander Karelin * 1998 Winter Olympics - Alexey Prokurorov * 2000 Summer Olympics - Andrey Lavrov * 2002 Winter Olympics - Alexey Prokurorov * 2004 Summer Olympics - Alexander Popov * 2006 Winter Olympics - Dmitry Dorofeev * 2008 Summer Olympics - Andrei Kirilenko * 2010 Winter Olympics - Aleksey Morozov * 2012 Summer Olympics - Maria Sharapova ==Related pages== * List of IOC country codes * Soviet Union at the Olympics ==References== ==Other websites== * * Russian Federation profile at London2012.com Olympics Category:Nations at the Olympics",
 "title": "Russia at the Olympics"
}