{
 "id": "320116",
 "text": "The Santana Formation is a high quality fossil site in Brazil 115 to 108 million years ago (mya). It is in northeastern Brazil's Araripe Basin.Martill D.M. 2007. The age of the Cretaceous Santana Formation fossil Konservat Lagerstätte of north-east Brazil: a historical review and an appraisal of the biochronostratigraphic utility of its palaeobiota. Cretaceous Research 28 895–920. It qualifies as a Lagerstätte, which means it is one of the best fossil sites, with many undisturbed fossils. The strata come from the Lower Cretaceous, laid down about 92 million years ago in a shallow inland sea. Some 25 species of fish are found, many with stomach contents preserved. This lets palaeontologists study predator–prey relationships in the ecosystem. There are also fine examples of pterosaurs, reptiles, amphibians, invertebrates (especially insects) and plants. Even dinosaurs are found here: a new maniraptor was described in 1996. Limestone nodules formed around dead organisms; this preserved even the soft parts of their anatomy. The limestone was etched away using a mild acid. The fossils were then preserved by the 'transfer technique' which means they were embedded in a plastic resin such as polyester or epoxy.Maisey J.G. et al 1991. Laboratory preparation techniques. In Maisey J.G. (ed) Santana fossils: an illustrated atlas. Tfh Pubns, 99-103\\. The nearby Crato Formation is also a lagerstätte. It was produced in similar conditions, about 10 million years before the Santana Formation. ==Notable taxa== Various remains of non-avian theropods, avialans, ornithischians, and possibly oviraptorosaurs have been found in Estado do Ceara, Brazil.Weishampel, David B et al. 2004. Dinosaur distribution (early Cretaceous, South America). In: Weishampel, David B.; Dodson, Peter; and Osmólska, Halszka (eds): The Dinosauria. 2nd ed, Berkeley: University of California Press, 563-570. Examples are spinosaurs like Irritator and maniraptors like Santanaraptor. Ornithocheirus and Tupuxuara are examples. The inland sea also had turtles, such as Santanachelys. == References == Category:Lagerstätten Category:Geography of Brazil",
 "title": "Santana Formation"
}