{
 "id": "320148",
 "text": "(1328 - 29 March 1368) was the 97th emperor of Japan,Imperial Household Agency (Kunaichō): 後村上天皇 (97) according to the traditional order of succession.Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 294-308. His reign started in September 1339 and ended on 29 March 1368..Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 158. This 14th century sovereign was named after the 10th century Emperor Murakami and go- (後), translates literally as \"later\"; and thus, he is sometimes called the \"Later Emperor Murakami\". The Japanese word \"go\" has also been translated to mean the \"second one\"; and in some older sources, this emperor may be identified as \"Murakami, the second\", or as \"Murakami II\". ==Traditional narrative== His personal name was , also known as Yoshiyoshi.Titsingh, p. 294. He reigned from Sumiyoshi, Ōsaka, Yoshino, Nara, and other temporary locations. ==Events of Go-Murakami's life== Prince Noriyoshi was a member of the Southern Court during the Nanboku-chō period of rival courts.Titsingh, p. 295. * 18 September 1339 (Engen 3, 5th day of the 8th month): In the 21st year of Go-Daigo's reign, the emperor abdicated at Yoshino in favor of his son, Prince Noriyoshi.Varley, H. Paul. (1980). Jinnō Shōtōki, p. 270. The succession (senso) was received by Noriyoshi.Titsingh, p. 295; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. * 19 September 1339 (Engen 3, 6th day of the 8th month): Go-Daigo died;Titsingh, p. 295. * 29 March 1368 (Shōhei 23, 11th day of the 3rd month): Go-Murakami died.Titsingh, p. 308; Ponsonby-Fane, p. 158. === After his death === According to the Imperial Household Agency, the mausoleum (misasagi) of Go-Murakami is in Osaka Prefecture. The emperor is traditionally venerated at a memorial Shinto shrine in the precincts of Kanshinji temple (観心寺) in Kawachinagano, Osaka.Ponsonby-Fane, p. 422. ==Eras of Go-Murakami's reign== The years of Go-Murakami's reign are more identified by more than one era name. :Nanboku-chō southern court *Eras as reckoned by legitimate Court (as determined by Meiji rescript) ** Engen (1336–1340) ** Kōkoku (1340–1346) ** Shōhei (1346–1370) :Nanboku-chō northern court *Eras as reckoned by pretender Court (as determined by Meiji rescript) ** Ryakuō (1338–1342) ** Kōei (1342–1345) ** Jōwa (1345–1350) ** Kannō (1350–1352) ** Bunna (1352–1356) ** Embun (1356–1361) ** Kōan (1361–1362) ** Jōji (1362–1368) ** Ōan (1368–1375) == Related pages == * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree == References == == Other websites == Category:1328 births Category:1368 deaths Category:Emperors of Japan",
 "title": "Emperor Go-Murakami"
}