{
 "id": "320298",
 "text": "Muryeong of Baekje (462–523, r. 501–23), also known as Sama, was a 6th-century Korean king.Kim, Wongyong. (1986). Art and Archaeology of Ancient Korea, p. 194; retrieved 2011-12-25. He was the 25th king of Baekje, which was one of the Three Kingdoms of Korea in ancient times.Korea Tourism Organization, \"Songsan-ri Tombs and Royal Tomb of King Muryeong\"; retrieved 2011-12-25. The name Muryong means \"military peace\". It is a name he got after death. ==Events of Muryeong's reign == During Muryeong’s reign, the southwestern kingdom of Baekje was allied with its eastern rival Silla against the northern kingdom of Goguryeo.Discover Korea, \"Gongju’s Songsanri Tombs,\" 19 December 2008; retrieved 2011-12-25. The king is known for expanding contacts with China and Japan.Paxton, Norbert. (2005). The Rough Guide to Korea, p. 276. ==After his death== Muryeong's tomb is located in Gongju in South Chungcheong Province.Gong ju City, Group of Ancient in Tombs Songsan-ri (Tomb of king Muryeong-wang)\" ; retrieved 2011-12-25. It has been studied by archeologists and historians. This the only ancient tomb that has been positively identified among those of this period. \"Baekje Bone Fragments 'Belonged to King or Queen',\" Chosun Ilbo (ROK). December 9, 2009; retrieved 2011-12-25. ==Legacy== In 2001, Japan's Emperor Akihito acknowledged a distant relationship with Muryeong. He explained, \"I, on my part, feel a certain kinship with Korea, given the fact that it is recorded in the Chronicles of Japan that the mother of Emperor Kammu was of the line of King Muryong of Baekje.\"Watts, Jonathan. Guardian.co.uk \"The emperor's new roots,\" The Guardian (UK). 28 December 2001; retrieved 2011-12-25. ==References== ==More Reading== * Kim, Won-Yong. “The Tomb of King Muryong of the Paekche Dynasty.” Asian Pacific Quarterly of Cultural and Social Affairs (Seoul) 3:3 (Winter 1971): 34-46. * Paik, Seung- gil. \"Excavation of the Tomb of Paekche King Muryong.\" Korea Journal 11:8 (August 1971): 48-51. == Other websites == * http://www.myj7000.jp- biz.net/clan/03/03013.htm#003 Category:History of Korea Category:460s births Category:520s deaths Category:Kings and queens",
 "title": "Muryeong of Baekje"
}