{
 "id": "320225",
 "text": "Gastroliths, or gizzard stones, are small rocks kept by an animal inside its stomach or at an early part of the alimentary canal. The function of these is to mash up the food so digestion takes place faster. Typically, animals which do this do not have suitable teeth for grinding, and the gastroliths are a good substitute for this. A second function, in aquatic animals, is that gastroliths can be used for ballast to make diving easier. ==Identification== Several pieces of evidence are needed to show that a rock was used by a fossil animal to aid its digestion. First, the stone must be unlike the rock found in its geological vicinity. Secondly, it should be rounded and polished, because inside a gizzard any genuine gastrolith would grind against other stones and fibrous materials, like the action of a rock tumbler. Lastly, the stone must be found with the fossils of the animal which ingested it. == Occurrence == Among living vertebrates, gastroliths are common among crocodiles, alligators, herbivorous birds, seals and sea lions. Domestic fowl need access to grit. Stones swallowed by ostriches can exceed a length of . Amphibians such as the Axolotl ingest rocks that are presumed to be gastroliths.Kulbisky et al The axolotl as an animal model for the comparison of 3-D ultrasound with plain film radiography rrr in Medicine and Biology, July 1999 Volume 25, Issue 6, Pages 969–975Wings, O A review of gastrolith function with implications for fossil vertebrates and a revised classification Acta Palaeontologica Polonica 52 (1): 1–16 Apparent microgastroliths have also been found in frog tadpoles.Wickramasinghe, DD et al Ontogenetic changes in diet and intestinal morphology in semi-terrestrial tadpoles of Nannophrys ceylonensis (Dicroglossidae) Copeia, Vol2007, Iss 4 (Dec 2007) Ingestion of silt and gravel by tadpoles of various frog species improves buoyancy control.Rondeau et al Larval Anurans adjust buoyancy in response to substrate ingestion Copeia: 2005 #1, pp. 188195. Sauropod dinosaurs appear to have used stones to grind tough plant matter. An example of this is the early Cretaceous theropod Caudipteryx zoui from northeastern China. It was discovered with a series of small stones, in the area of its skeleton that would have corresponded with its abdominal region. Aquatic animals, such as plesiosaurs, may have used them as ballast, to help balance themselves or to decrease their buoyancy, as crocodiles do. Some fossil gastroliths are rounded and polished, many stones in living birds are not polished at all. Gastroliths associated with dinosaur fossils can weigh several kilograms. == References == Category:Zoology",
 "title": "Gastrolith"
}