{
 "id": "320316",
 "text": "Event Centre rock (also known as arena rock, corporate rock, industry rock,or stadium rock) is a word to describe a form of rock music which is played, or intended to be played, in large venues, such as event centres, arenas, stadia, and open-air concert spaces. In such a way, genres which traditionally fall within the categories of event centre rock tend to be (yet not always) loud and anthemic; event centre rock is most traditionally associated with heavy metal, progressive rock, hard rock, glam metal or pop rock genres. Often, yet not always, event centre rock is categorised as being more mass-scale, commercially appealing, and radio-oriented music. Due to the often commercial nature of event centre rock, it is occasionally called corporate rock.W. M. Reynolds and J. A. Webber, Expanding Curriculum Theory: Dis/positions and Lines of Flight (London: Routledge, 2004), , p. 24. Event centre rock is generally associated with the grand shows that artists and groups within the style would hold. At these performances, large sound systems, and often elaborate lighting, additional effects and fireworks, would be included. The 1970s and 80s were a major period in event centre rock. Whilst event centre rock has seen large popularity over the years, especially from the 1960s to the 1980s, it has also been criticised for its often commercial and extravagant nature, especially with regards to the shows and concert tours that event centre rock bands and artists would have. To some extent, genres such as pub rock, punk rock, indie rock and alternative rock grew as a reaction against the nature and aesthetic of event centre rock, opting for a less commercial and over-the-top style. Famous bands associated with event centre rock include Kiss, Queen, Aerosmith, Journey, and Styx, amongst several others. ==Notable musicians== *AC/DC *Aerosmith *Blue Öyster Cult *Boston *Def Leppard *The Eagles *Elton John *Foreigner *Journey *Bon Jovi *Judas Priest *Kansas *Kiss *Meat Loaf *Peter Frampton *Queen *REO Speedwagon *Styx *Toto *Van Halen ==References== Category:Rock music",
 "title": "Arena rock"
}