{
 "id": "320402",
 "text": "Maccabi Tel Aviv Football Club (; Moadon Kaduregel Maccabi Tel Aviv) is an Israeli football club. It is one of the oldest clubs in Israeli football. The club is also the most successful. They have won 18 championships, 22 national cups, 2 Asian Champions Cups Before joining the UEFA Israel was member of the Asian federation. and 3 Toto cups. The homeground of the team is the Bloomfield Stadium in Tel Aviv, where also the city rival Hapoel Tel Aviv is playing. ==History== The club was founded in 1906. It was the first Jewish football club in Ottoman Palestine. The name was then Rishon Lezion-Yafo. The first match was a 3-0 win against a team of French sailors. After the foundation of Tel Aviv in 1909 the clubs name was changed into Maccabi Tel Aviv. Maccabi was founding member of the Palestine Football Association and the Palestine League. In 1936 the club was invited to play in the United States. On the way Maccabi played in France versus Racing Paris and Olympique Lille. In the United States they played against an All-star team of New York City at Yankee Stadium. Maccabi also defeated the American Soccer League team in Brooklyn and Philadelphia on their home ground 1–0. Other matches were against St. Louis Stars and the Boston Celtics. They played also in Canada, where they drew 1–1 with Toronto All-Stars. In 1939 they played 18 matches in Australia. After the independence in 1948 Tel Aviv was the most successful club in Israel's top league. The 1950s decade is considered to be their \"golden age\" because they won 5 league championships and 4 cups. The club was almost relegated in 1976 but beat Beitar Jerusalem in the relegation play-off. In the 2011/12 season they reached the group stage of the UEFA Europa League. The team played versus PSV Eindhoven, Rapid Bucharest and Legia Warsaw. They failed to reach the next stage (2 wins, 1 draw, 3 lost). ==Current team== As of 13 October 2011 In an Israel team only 5 foreigners are allowed. The foreigners are: * Nivaldo * Haris Medunjanin * Savo Pavićević * Moussa Konaté * Roberto Punčec ==Honours== *Israeli championships **Winners (25): 1935–36, 1936–37, 1938–39, 1941–42, 1946–47, 1949–50, 1951–52, 1953–54, 1955–56, 1957–58, 1966–68, 1969–70, 1971–72, 1976–77, 1978–79, 1991–92, 1994–95, 1995–96, 2002–03, 2012–13, 2013–14, 2014–15, 2018–19, 2019–20, 2023–24 *State Cup **Winners (24)Israel – List of Cup Finals RSSSF 1928–29, 1929–30, 1932–33, 1940–41, 1945–46, 1946–47, 1953–54, 1954–55, 1957–58, 1958–59, 1963–64, 1964–65, 1966–67, 1969–70, 1976–77, 1986–87, 1987–88, 1993–94, 1995–96, 2000–01, 2001–02, 2004–05, 2014–15, 2020–21 *Asian Club Championship **Winners (2) 1968–69, 1970–71 *Toto Cup **Winners (3) 1992–93, 1998–99, 2008–09 *Israeli Supercup **Winners (5)Israeli Super Cup winners RSSSF 1964–65 (shared cup with Hakoah Ramat Gan), 1967–68, 1976–77, 1978–79, 1987–88 ==References== Category:Israeli football clubs Category:Tel Aviv Category:1906 establishments in Asia Category:1900s establishments in Israel",
 "title": "Maccabi Tel Aviv F.C."
}