{
 "id": "32047",
 "text": "The Liberal Party of Australia (Liberals, or LIB for short), in coalition with the National Party of Australia (Nationals, or NAT for short), is a center- right party that is one of the two main political groups in Australian politics (the other being the Social Democratic Australian Labor Party (ALP). The Liberals/Nationals are the more conservative of the two main parties. It was founded by Sir Robert Menzies in 1944. They lost government to the ALP in the Australian federal election held on 24 November 2007. This was after 11 years in government under the previous Liberal leader, John Howard. The Liberal/National coalition were in control in the Federal Parliament of Australia after beating the ALP during an election on 7 September 2013. They lost control after losing many seats in the 2022 election. The current party leader is Sussan Ley since 13 May 2025. ==Liberal Prime Ministers of Australia== * Robert Menzies - from 1949 until his resignation in 1966. * Harold Holt - from 1966 until his death in 1967. * John Gorton - from 1968 until his resignation 1971. * William McMahon - from 1971 until his loss to Gough Whitlam (ALP) in the 1972 election. * Malcolm Fraser - from his appointment following the Dismissal of Gough Whitlam in 1975 until his defeat by Bob Hawke (ALP) in 1983. * John Howard - from his victory over Paul Keating in 1996 to his defeat by Kevin Rudd (ALP) in 2007. * Tony Abbott - from his victory over Kevin Rudd in 2013. * Malcolm Turnbull - from replacing Abbott on 14 September 2015 to his resignation on 24 August 2018. * Scott Morrison - from replacing Turnbull as leader of the Liberal Party on 24 August 2018. ==Federal Parliamentary Leaders of the Liberal Party of Australia== * Sir Robert Menzies February 1945 to 26 January 1966 * Harold Holt 26 January 1966 to 19 December 1967 * Sir John Gorton 10 January 1968 to 10 March 1971 * Sir William McMahon 10 March 1971 to 5 December 1972 * Sir Billy Snedden December 1972 to March 1975 * Malcolm Fraser March 1975 to 11 March 1983 * Andrew Peacock March 1983 to September 1985 * John Howard September 1985 to May 1989 * Andrew Peacock May 1989 to March 1990 * John Hewson April 1990 to May 1994 * Alexander Downer May 1994 to January 1995 * John Howard 30 January 1995 to 27 November 2007 * Brendan Nelson 29 November 2007 to 16 September 2008 * Malcolm Turnbull 16 September 2008 to 1 December 2009 * Tony Abbott 1 December 2009 to 14 September 2015 * Malcolm Turnbull 14 September 2015 to 24 August 2018 * Scott Morrison 24 August 2018 to 30 May 2022 * Peter Dutton 30 May 2022 to 3 May 2025 * Sussan Ley since 13 May 2025 ==Current Liberal leaders of States and Territories== * Chief Minister of the Northern Territory: Willem Westra van Holte³, since February 2015. * Premier of Tasmania: Peter Gutwein since 2014. * Premier of New South Wales: Gladys Berejiklian, since 2014. . ²In Queensland the Liberal and National parties merged into the Liberal National Party of Queensland ³In the Northern Territory the party is called the Country Liberal Party. ==Other notable Liberals== * Enid Lyons - first woman to be elected to the Australian House of Representatives (for the UAP), then served as a Liberal from 1944 to 1951 and was appointed by Robert Menzies as the first woman to sit in the Australian Cabinet. * Neville Bonner as Senator for Queensland, he became the first Indigenous Australian to sit in the Federal Parliament. * Nick Greiner - Premier of New South Wales, 1988–1992. * Jeff Kennett - Premier of Victoria, 1992–1999. * Cate Carnell - Chief Minister of the Australian Capital Territory, 1995–2000, and first Liberal woman to lead a state or territory. * Peter Costello - Australia's longest serving Treasurer (1996-2007). * Alexander Downer - Australia's longest serving Minister for Foreign Affairs (1996-2007). * Ken Wyatt - first Aboriginal member of the Australian House of Representatives (2010-) ==Notes== ==References== Category:1945 establishments Category:1940s establishments in Australia Category:Conservative parties",
 "title": "Liberal Party (Australia)"
}