{
 "id": "320595",
 "text": "Diana Santos (born June 9, 1950 in Mexico City), is a Mexican voice actress. She voiced the part of Takeshi in the Spanish dubbed version of the 1967–1968 Japanese television program Comet-San. ==Filmography== *Bo Peep in Lamp Life (short film) (2020) *Bo Peep in Toy Story 4 (2019) *Belle in Wreck-It Ralph Breaks the Internet (2018) *Mother in Rapunzel's Tangled Adventure (episode 27) (2018) *Miss Chicarelli in Kick Buttowski (2010-2013) *Minnie Mouse in Mickey's Twice Upon a Christmas (2004) *Belle and Minnie Mouse in House of Mouse (2001-2003) *Belle and Minnie Mouse in Mickey's Magical Christmas: Snowed in at the House of Mouse (2001) *Minnie Mouse in Mickey's Once Upon a Christmas (1999) *Minnie Mouse (1960s-present) *Lucille Vinson in Crazy in Alabama (1999) *Bo Peep in Toy Story 2 (1999) *Belle (speaking voice) in Belle's Tales of Friendship (1999) *Boy in hospital in Babe: Pig in the City (1998) *Belle (speaking voice) in Belle's Magical World (1998) *Belle (speaking voice) in Beauty and the Beast: The Enchanted Christmas (1997) *Felinet in The Adventures of Pinocchio (1996) *Baloo (cub) and Mowgli in Jungle Cubs (1996-1998) *Bo Peep in Toy Story (1995) *The Hoggetts' Daughter, The Singing Mice, Valda in Babe (1995) *Spanky McFarland in The Little Rascals (1994) *Sarah Sanderson in Hocus Pocus (1993) (Mexican re-dub) *Young Ebenezer Scrooge in The Muppet Christmas Carol (1992) *Belle (speaking voice) in Beauty and the Beast (1991) *Edmond in Rock-A-Doodle (1991) *Miss Bianca in The Rescuers Down Under (1990) *Rebecca Cunningham in TaleSpin (1990) *Webby in DuckTales the Movie: Treasure of the Lost Lamp (1990) *Miss Piggy in Muppet Babies (1984–1991) and Cartoon All-Stars to the Rescue (1990) *Chip in Chip 'n Dale Rescue Rangers (1989) *Anne-Marie in All Dogs Go to Heaven (1st dub) (1989) *Young Babar / Young Celeste in Babar (Mexican dub, Seasons 1-5) (1989-1991) *Young Babar / Young Celeste in Babar: The Movie (Mexican dub) (1989) *Margaret Krusemark in Angel Heart (1987) *Jeanette Miller in The Chipmunk Adventure (1987) *Twinkle in Pinocchio and the Emperor of the Night (1987) *Olivia Flaversham / Lady Mouse in The Great Mouse Detective (1986) *Alicia in He-Man & She-Ra: A Christmas Special (1985) *Sunni Gummi / Princess Calla in Disney's Adventures of the Gummi Bears (1985) *Princess Eilonwy / Fairfolk Little Girl in The Black Cauldron (1985) *Mrs. Brisby / Timothy Brisby in The Secret of NIMH (1982) *Vixey in The Fox and the Hound (1981) *Madame du Barry in Lady Oscar (1979) *Boy (speaking voice) in The Small One (1978) *Pete (speaking voice) in Pete's Dragon (1977) *Elisa in The Wild Swans (1977) *Miss Bianca in The Rescuers (1977) *Fritz in Hans Christian Andersen's The Little Mermaid (1975) *Maid Marian (speaking voice) in Robin Hood (1973) *Paul Rawlins in Bedknobs and Broomsticks (1971) (Mexican re-dub) (1986) *Mowgli in The Jungle Book (1967) *Christopher Robin in the Winnie the Pooh featurettes (1966–1974) *Liesl von Trapp (speaking voice) in The Sound of Music (1965) (Original Mexican dub) *Michael Banks and Jane Banks (singing voice) in Mary Poppins (1964) (Mexican re-dub) (1986) *Miles in The Innocents (1961) *Lucky and Penny in One Hundred and One Dalmatians (1961) *Anne Frank in The Diary of Anne Frank (1959) *Singing Harp (speaking voice) in Mickey and the Beanstalk (1947) (Mexican re-dub) (1992) *Adult Faline (speaking voice) in Bambi (1942) (Mexican re-dub) (1969) ==Honours and Awards== On November 28, 2020, during the 2nd Lavat Awards ceremony held in Mexico City, Diana Santos received an honorary award in recognition for her lifetime work as a dubbing actress spanning 64 years. The ceremony was broadcast live on the Lavat Awards official website due to the COVID-19 pandemic, as opposed to the previous year. == References == == Other websites == * Category:1950 births Category:Living people Category:Mexican voice actors Category:People from Veracruz",
 "title": "Diana Santos"
}