{
 "id": "320550",
 "text": "Beitar Jerusalem Football Club (Hebrew: מועדון כדורגל בית\"ר ירושלים, Moadon Kaduregel Beitar Yerushalayim) is an Israeli football club from Jerusalem. The club has been controversial because of its links with the right wing politics and to the Likud party since it was created. The fans chant racist things towards Arabs. ==History== The club was founded in 1936 by David Horn. He was the head of the local Betar movement. The Betar movement was a Zionist youth organisation. Most of the early players came from this group. In 1938 the club stopped playing because the manager and some of the players were arrested and deported by the British authorities in Palestine. In 1943, they were able to play again, but in 1947 the British blocked the games on the day the 1948 Arab-Israeli War started. A player was also killed when he entered a British camp. During his existence the club was very successful. The team has never been relegated from the Israeli Premier League. It was one of the original 14 Israeli Premier League teams at the time of its foundation in 1999. In the all-time table of the league Beitar ranks 4th. The farthest they have ever gone in a European competition was in the 2016-17 Europa League where they made it to the play off round. ==Current team== ==Stadium== The club first home was the \"Banana Field\" close to Beitar youth group's \"nest\". In the 1950s the club moved to the YMCA Stadium. Later it was shared with Hapoel Jerusalem. The YMCA was nicknamed the sandbox because the field was in a very poor condition. In 1991 both clubs moved to the Teddy Stadium, named after longtime Jerusalem mayor Teddy Kollek. Initially the stadium was two-sided and held 12,000 spectators. This was increased to 21,600 when a third side was completed in 1997. ==Seasons in the Premier League== ==Honours== *Israeli championships **Winners: 1986/87, 1992/93, 1996/97, 1997/98, 2006/07, 2007/08 *Second Division **Champions: 1953/54; 1957–58; 1966/68 *State Cup **Winners: 1976, 1979, 1985, 1986, 1989, 2008, 2009, 2023 *Toto Cup **Winners: 1997–98, 2009–10 *Shalom Cup (Roma) **Winners: 2000 *Israeli Supercup **Winners: 1976, 1986 *Lilian Cup **Winners: 1985 *Mini Football Championship **Winners: 1988 ==Other websites== *Official Website ==References== Category:Israeli football clubs Category:Organizations based in Jerusalem Category:1936 establishments in Asia Category:1930s establishments in Israel",
 "title": "Beitar Jerusalem F.C."
}