{
 "id": "32078",
 "text": "The Franco-Prussian War (1870-1871) was a war between France and Prussia, which was helped by German allies of Prussia. The war was provoked by Prussian prime minister Otto von Bismarck, who wanted to unite Germans under Prussian rule by making them fight together against a common enemy. Bismarck irritated French Emperor Napoleon III into declaring war on 19 July 1870. The war ended by a Prussian victory on 10 May 1871. == Causes == The French feared a Protestant country on their border. France had helped Prussia beat Austria during the Austro-Prussian War (1866), but it would not allow the North German Confederation and South German states to unify. In 1869, the throne of Spain was offered to a prince of the Catholic branch of the Prussian Hohenzollern royal family. France found out about the offer, and demanded for Prussia to reject it since France did not want to be surrounded by Hohenzollerns. The prince refused, but the French wanted Prussia to do the same. Prussian King Wilhelm I sent a telegram from Ems that assuring French Emperor Napoleon III that the prince would not become king of Spain. Prussian Chancellor Otto von Bismarck publicly released a version that he had edited or doctored to make it seem that his king had insulted the emperor's ambassador. That was part of his plan to unify the German states. Both sides exchanged angry words, and France declared war. On July 19 1870 the war started, and Prussia was fully supported by the South German states. == Results == With its German allies and universal conscription, Prussia brought together a bigger army than the French. The Prussian Army also had better weapons, training and leadership. For example, the Prussian General Staff were very well organised. The army had some old- fashioned equipment like the Dreyse needle gun, but its Krupp mobile artillery (heavy-duty guns) were far better than the old French muzzleloaders. Notable victories occurred at Sedan, Mars-la-Tour, Gravelotte and Metz. The Germans captured Napoleon in Metz, but French Republicans overthrew the Second French Empire and continued the war for a few months. The Germans conquered Paris and then made peace. After the war, France had to give Prussia some regions that had been under French control. They were most of Alsace and some of Lorraine, most of which spoke German dialects. Prussia took steps to unite the independent German states into one country, the German Empire. The historical term for that is the Unification of Germany. == References == Category:1870s in France Category:1870s in Germany Category:Prussia Category:Wars involving France Category:Wars involving Germany Category:1870 Category:1871 Category:19th-century conflicts",
 "title": "Franco-Prussian War"
}