{
 "id": "32081",
 "text": "Fernando Alonso Díaz (born July 29, 1981 in Oviedo, Spain) is a Formula One racing driver. He is from Spain. He won his first F1 title in 2005 and then became the youngest ever Formula 1 World Champion at the age of 24. Alonso drove until 2006 in Formula 1 for the Renault F1-Team, with which he achieved the driver world championship in the year 2005 and had a major part to play in the Renault F1 Team winning the constructor championship in the same year. The Drivers' Championship was won again by Fernando with Renault F1 for the second year in a row in 2006 (interestingly, had Alonso not become the youngest World Champion in 2005, he would have still achieved this feat with his 2006 victory) edging out Michael Schumacher of Scuderia Ferrari by 13 points. Renault also retained the Constructor's Championship, beating Ferrari by only five points. In 2007 Alonso joined Team Vodafone McLaren-Mercedes and entered a four-way battle for the World Championship with his team-mate, the rookie Lewis Hamilton, and Ferrari drivers Kimi Räikkönen and Felipe Massa. Halfway through the season, with wins in Sepang and Monaco, Alonso trails his rookie team-mate by 14 points. The second half of the season should prove interesting. In the second part Alonso won at Europe and Italy but missed the title by 1 point. == Racing record == === Career summary === Season Series Team Races Wins Poles FLaps Podiums Points Position 1999 Euro Open by Nissan Campos Motorsport 15 6 6 5 8 164 1st 2000 International Formula 3000 Team Astromega 9 1 1 2 2 17 4th 2001 Formula One European Minardi F1 Team 17 0 0 0 0 0 23rd 2002 Formula One Mild Seven Renault F1 Team Test driver Test driver Test driver Test driver Test driver Test driver Test driver 2003 Formula One Mild Seven Renault F1 Team 16 1 2 1 4 55 6th 2004 Formula One Mild Seven Renault F1 Team 18 0 1 0 4 59 4th 2005 Formula One Mild Seven Renault F1 Team 19 7 6 2 15 133 1st 2006 Formula One Mild Seven Renault F1 Team 18 7 6 5 14 134 1st 2007 Formula One Vodafone McLaren Mercedes 17 4 2 3 12 109 3rd 2008 Formula One ING Renault F1 Team 18 2 0 0 3 61 5th 2009 Formula One ING Renault F1 Team 17 0 1 2 1 26 9th 2010 Formula One Scuderia Ferrari Marlboro 19 5 2 5 10 252 2nd 2011 Formula One Scuderia Ferrari 19 1 0 1 10 257 4th 2012 Formula One Scuderia Ferrari 20 3 2 0 13 278 2nd 2013 Formula One Scuderia Ferrari 19 2 0 2 9 242 2nd 2014 Formula One Scuderia Ferrari 19 0 0 0 2 161 6th 2015 Formula One McLaren Honda 18 0 0 0 0 11 17th 2016 Formula One McLaren Honda 20 0 0 1 0 54 10th 2017 Formula One McLaren Honda 19 0 0 1 0 17 15th 2017 IndyCar Series McLaren-Honda-Andretti 1 0 0 0 0 47 29th 2018 Formula One McLaren F1 Team 21 0 0 0 0 50 11th 2018 24 Hours of Le Mans Toyota Gazoo Racing 1 1 1 0 1 N/A 1st 2018 WeatherTech SportsCar Championship United Autosports 1 0 0 0 0 18 58th 2018–19 FIA World Endurance Championship Toyota Gazoo Racing 8 5 4 0 7 198 1st 2019 WeatherTech SportsCar Championship Konica Minolta Cadillac 1 1 0 0 1 35 27th 2019 24 Hours of Le Mans Toyota Gazoo Racing 1 1 0 0 1 N/A 1st 2019 IndyCar Series McLaren Racing 0 0 0 0 0 0 NC 2020 Dakar Rally Toyota Gazoo Racing 1 0 N/A 0 N/A 13th 2020 IndyCar Series Arrow McLaren SP 1 0 0 0 0 18 31st 2021 Formula One Alpine F1 Team 16 0 0 0 0 * * Season still in progress. === Complete International Formula 3000 results === (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant 1 2 3 4 5 6 7 8 9 10 DC Points 2000 Team Astromega IMO 9 SIL EX CAT 15 NÜR Ret MON 8 MAG Ret A1R 6 HOC Ret HUN 2 SPA 1 4th 17 ===Complete Formula One results=== (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 Points European Minardi F1 Team Minardi PS01 European (Cosworth) 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA † GBR GER HUN BEL ITA USA JPN 23rd 0 Mild Seven Renault F1 Team Renault R23 Renault RS23 3.0 V10 AUS MAL BRA SMR ESP AUT MON CAN EUR FRA 6th 55 Mild Seven Renault F1 Team Renault R23B Renault RS23 3.0 V10 GBR GER HUN ITA USA JPN 6th 55 Mild Seven Renault F1 Team Renault R24 Renault RS24 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN BEL ITA CHN JPN BRA 4th 59 Mild Seven Renault F1 Team Renault R25 Renault RS25 3.0 V10 AUS MAL BHR SMR ESP MON EUR CAN USA FRA GBR GER HUN TUR ITA BEL BRA JPN CHN 1st 133 Mild Seven Renault F1 Team Renault R26 Renault RS26 2.4 V8 BHR MAL AUS SMR EUR ESP MON GBR CAN USA FRA GER HUN TUR ITA CHN JPN BRA 1st 134 Vodafone McLaren Mercedes McLaren MP4-22 Mercedes FO 108T 2.4 V8 AUS MAL BHR ESP MON CAN USA FRA GBR EUR HUN TUR ITA BEL JPN CHN BRA 3rd 109 ING Renault F1 Team Renault R28 Renault RS27 2.4 V8 AUS MAL BHR ESP TUR MON CAN FRA GBR GER HUN EUR BEL ITA SIN JPN CHN BRA 5th 61 ING Renault F1 Team Renault R29 Renault RS27 2.4 V8 AUS MAL CHN BHR ESP MON TUR GBR GER HUN EUR BEL ITA 9th 26 Renault F1 Team Renault R29 Renault RS27 2.4 V8 SIN JPN BRA ABU Scuderia Ferrari Marlboro Ferrari F10 Ferrari 056 2.4 V8 BHR AUS MAL † CHN ESP MON TUR CAN EUR GBR GER HUN BEL ITA SIN JPN KOR BRA ABU 2nd 252 Scuderia Ferrari Marlboro Ferrari 150º Italia Ferrari 056 2.4 V8 AUS MAL CHN TUR ESP MON CAN EUR 4th 257 Scuderia Ferrari GBR GER HUN BEL ITA SIN JPN KOR IND ABU BRA Scuderia Ferrari Ferrari F2012 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON CAN EUR GBR GER HUN BEL ITA SIN JPN KOR IND ABU USA BRA 2nd 278 Scuderia Ferrari Ferrari F138 Ferrari 056 2.4 V8 AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 2nd 242 Scuderia Ferrari Ferrari F14 T Ferrari 059/3 1.6 V6 t AUS MAL BHR CHN ESP MON CAN AUT GBR GER HUN BEL ITA SIN JPN RUS USA BRA ABU 6th 161 McLaren Honda McLaren MP4-30 Honda RA615H 1.6 V6 t AUS MAL CHN BHR ESP MON CAN AUT GBR HUN BEL ITA † SIN JPN RUS USA MEX BRA ABU 17th 11 McLaren Honda McLaren MP4-31 Honda RA616H 1.6 V6 t AUS BHR CHN RUS ESP MON CAN EUR AUT † GBR HUN GER BEL ITA SIN MAL JPN USA MEX BRA ABU 10th 54 McLaren Honda McLaren MCL32 Honda RA617H 1.6 V6 t AUS CHN BHR † RUS ESP MON CAN † AZE AUT GBR HUN BEL ITA † SIN MAL JPN USA MEX BRA ABU 15th 17 McLaren F1 Team McLaren MCL33 Renault R.E.18 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA † AUT GBR GER † HUN BEL ITA SIN RUS JPN USA MEX BRA ABU 11th 50 Alpine F1 Team Alpine A521 Renault E-Tech 20B 1.6 V6 t * * 2022 Alpine Alpine A522 Renault E-Tech RE22 BHR 9 SAU DNF AUS 17 EMI DNF MIA 11 SPA 9 MON 7 AZE 7 CAN 9 GBR 5 OOS 10 FRA 6 HON 8 BEL 5 NED 6 ITA DNF SIN DNF JPN 7 VST 7 MXS DNF SAP 51DNF ABU DNF 9 81 2023 Aston Martin Aston Martin AMR23 Mercedes F1 M14 E Performance V6 t BHR 3 SAU 3 AUS 3 AZE 64 MIA 3 MON 2 SPA 7 CAN 2 OOS 55 GBR 7 HON 9 BEL 5 NED 2 ITA 9 SIN 15 JPN 8 QAT 86 VST DNF MXS DNF SAP 3 LSV 9 ABU 7 4 206 2024* Aston Martin Aston Martin AMR24 Mercedes F1 M15 E Performance V6 t BHR 9 SAU 5 AUS 8 JPN 6 CHN MIA EMI MON CAN SPA OOS GBR HON BEL NED ITA AZE SIN VST MXS SAP LSV QAT ABU 8 24 Did not finish, but was classified as he had completed more than 90% of the race distance. Season in progress. == References == Category:1981 births Category:Living people Category:Spanish Formula One drivers Category:Formula One current Category:People from Oviedo",
 "title": "Fernando Alonso"
}