{
 "id": "320979",
 "text": "The following is a list of notable deaths in 2012. == January == * January 1 - Carlos Soria, 62, Argentine politician, shot. * January 1 - Bob Anderson, 89, English fencer, and movie sword fight choreographer. * January 1 - Kiro Gligorov, 94, former President of the Republic of Macedonia. * January 2 - William P. Carey, 81, American investment manager and philanthropist. * January 3 - Josef Skvorecky, 87, Czech writer and publisher, cancer. * January 5 - Frederica Sagor Maas, 111, American screenwriter, playwright and writer. * January 6 - Bob Holness, 83, South African-born British quiz show host. * January 8 - Alexis Weissenberg, 82, Bulgarian pianist. * January 9 - Malam Bacai Sanha, 64, President of Guinea-Bissau. * January 9 - Mae Laborde, 102, American actress, natural causes. * January 12 - Bill Janklow, 72, American politician and former Governor of South Dakota, cancer. * January 12 - Reginald Hill, 75, British crime fiction writer. * January 13 - Rauf Denktaş, 87, 1st President of the Turkish Republic of Northern Cyprus, multiple organ failure. * January 14 - Txillardegi, 82, Basque linguist, writer and politician. * January 15 - Manuel Fraga Iribarne, 89, Spanish politician and former Prime Minister of Galicia, heart failure. * January 15 - Ed Derwinski, 85, American politician. * January 16 - Gustav Leonhardt, 83, Dutch musician, conductor and teacher. * January 17 - Johnny Otis, 90, American songwriter. * January 19 - Sarah Burke, 29, Canadian freestyle skier, complications from skiing accident. * January 20 - Jiri Raska, 70, Czech ski jumper, heart disease. * January 20 - Etta James, 73, American singer, leukemia. * January 22 - Joe Paterno, 85, American college football coach, lung cancer. * January 24 - Theodoros Angelopoulos, 76, Greek movie director and screenwriter, hit by a motorcycle. * January 24 - James Farentino, 73, American actor. * January 25 - Veronica Carstens, 88, former First Lady of Germany. * January 26 - M. O. H. Farook, 74, Indian politician, diplomat and Governor of Kerala. * January 26 - Colin Tarrant, 59, British actor * January 29 - Oscar Luigi Scalfaro, 93, 9th President of Italy. * January 29 - Camilla Williams, 92, American opera singer, complications from cancer. * January 31 - Anthony Bevilacqua, 88, former Roman Catholic Archbishop of Philadelphia. * January 31 - Mike Kelley, 57, American artist and musician, suicide, (body found on this date). * January 31 - Dorothea Tanning, 101, American painter. == February == * February 1 - Wislawa Szymborska, 88, Polish poet, awarded 1996 Nobel Prize in Literature. * February 1 - Angelo Dundee, 90, American boxing trainer. * February 1 - Don Cornelius, 75, American gameshow host (Soul Train), suicide by gunshot. * February 3 - Ben Gazzara, 81, American actor, pancreatic cancer. * February 3 - Samuel Youd, 89, British science fiction writer. * February 4 - Mike deGruy, 60, American documentary movie maker, helicopter crash. * February 4 - Andrew Wight, 52, Australian screenwriter and producer, helicopter crash. * February 4 - Florence Green, 110, British supercentenarian and last-surviving World War I service veteran, natural causes. * February 6 - Antoni Tapies, 88, Spanish painter and sculptor. * February 6 - Janice E. Voss, 55, American engineer and astronaut, breast cancer. * February 11 - Whitney Houston, 48, American singer and actress, drowning. * February 12 - David Kelly, 82, Irish actor. * February 16 - Baddeley Devesi, 70, first Governor-General of the Solomon Islands. * February 16 - Anil Ramdas, 54, Surinamese-Dutch journalist and columnist, suicide. * February 16 - Anthony Shadid, 43, American journalist, asthma attack. * February 17 - Ulric Neisser, 83, American psychologist. * February 18 - Roald Aas, 83, Norwegian speed skater and cyclist. * February 18 - George Brizan, 69, former Prime Minister of Grenada, diabetes. * February 19 - Ruth Barcan Marcus, 90, American philosopher and logician. * February 19 - Renato Dulbecco, 97, Italian virologist and Nobel Prize in Physiology or Medicine winner. * February 20 - Vitaly Vorotnikov, 86, Soviet-Russian politician. * February 22 - Marie Colvin, 56, American war correspondent, killed in Syria. * February 22 - Remi Ochlik, 28, French photographer, killed in Syria. * February 24 - Infanta Maria Adelaide of Portugal, 100, Portuguese royal. * February 24 - Jan Berenstain, 88, American writer and illustrator, stroke. * February 25 - Maurice Andre, 78, French classical trumpeter. * February 25 - Red Holloway, 84, American jazz saxophonist, stroke and kidney failure. * February 25 - Erland Josephson, 88, Swedish actor and writer. * February 25 - Louisiana Red, 79, American blues musician. * February 29 - Davy Jones, 66, British actor and musician (The Monkees), heart attack. ==March== * March 1 - Lucio Dalla, 68, Italian singer-songwriter and musician, heart attack. * March 3 - Ralph McQuarrie, 82, American conceptual designer and illustrator. * March 5 - Robert B. Sherman, 86, American songwriter. * March 6 - Francisco Xavier do Amaral, 75, East Timorese politician and President in 1975. * March 7 - Wlodzimierz Smolarek, 54, Polish footballer. * March 7 - Felicien Marceau, 98, French novelist, playwright and essayist. * March 9 - Jose Tomas Sanchez, 91, Filipino cardinal. * March 10 - Jean Giraud, 73, French comic book artist and writer. * March 10 - Frank Sherwood Rowland, 84, American chemistry professor and Nobel Prize winner. * March 10 - Nick Zoricic, 29, Canadian ski cross racer, brain injuries following crash. * March 13 - Michel Duchaussoy, 73, French actor, cardiac arrest. * March 14 - Censu Tabone, 98, 4th President of Malta. * March 16 - Mervyn Davies, 65, Welsh rugby union player, cancer. * March 16 - Estanislao Basora, 85, Catalan-Spanish footballer. * March 17 - John Demjanjuk, 91, Ukrainian convicted war criminal. * March 17 - Pope Shenouda III of Alexandria, 88, Egyptian Pope of the Coptic Orthodox Church of Alexandria, cancer. * March 18 - George Tupou V, 63, King of Tonga. * March 21 - Tonino Guerra, 92, Italian writer, poet and screenwriter. * March 22 - Mohammed Merah, 23, French Islamic Jihadist and spree killer, shot. * March 23 - Abdullahi Yusuf Ahmed, 77, former President of Somalia, complications from pneumonia. * March 24 - Jocky Wilson, 62, Scottish darts player. * [March 25] - Edd Gould, 23, British animator, artist, and voice actor. He was best known for creating Eddsworld * March 25 - Antonio Tabucchi, 68, Italian writer and expert on Portuguese language and literature. * March 27 - Adrienne Rich, 82, American poet, writer and feminist, complications from rheumatoid arthritis. * March 28 - Alexander Arutunian, 91, Armenian composer. * March 28 - Earl Scruggs, 88, American musician. * March 31 - Dale R. Corson, 97, American physicist. ==April== * April 1 - Giorgio Chinaglia, 65, Italian footballer, heart attack. * April 1 - Leila Denmark, 114, American pediatrician and supercentenarian, natural causes. * April 1 - Miguel de la Madrid, 77, 52nd President of Mexico, complications from pulmonary emphysema. * April 3 - Xenia Stad-de Jong, 90, Dutch athlete. * April 5 - Jim Marshall, 88, British businessman and founder of Marshall Amplification. * April 5 - Barney McKenna, 72, Irish musician (The Dubliners). * April 5 - Bingu wa Mutharika, 78, President of Malawi, heart attack. * April 5 - Ferdinand Alexander Porsche, 76, German automobile designer and businessman. * April 6 - Fang Lizhi, 76, Chinese astrophysicist and activist. * April 6 - Thomas Kinkade, 54, American painter, accidental overdose of alcohol and valium. * April 7 - Mike Wallace, 93, American journalist and television personality. * April 8 - Jack Tramiel, 83, Polish-born American businessman, heart failure. * April 11 - Ahmed Ben Bella, 93, 1st post-independence President of Algeria. * April 14 - Émile Bouchard, 92, Canadian ice hockey player. * April 14 - Piermario Morosini, 25, Italian footballer, cardiac arrest. * April 14 - Jonathan Frid, 87, Canadian actor, pneumonia. * April 15 - Murray Rose, 73, Scottish-born Australian swimmer, leukaemia. * April 16 - Maersk Mc-Kinney Moller, 98, Danish shipping magnate. * April 18 - Dick Clark, 82, American radio and television personality, heart attack. * April 19 - Valeri Vasiliev, 62, Russian ice hockey player. * April 19 - Levon Helm, 71, American musician and actor, throat cancer. * April 21 - Charles Colson, 80, American Watergate scandal figure. * April 23 - Tommy Marth, 33, American musician (The Killers), suicide. * April 27 - David Weiss, 65, Swiss artist. * April 28 - Matilde Camus, 92, Spanish poet and writer. * April 29 - Shukri Ghanem, 69, former Prime Minister of Libya, drowning. * April 29 - Joel Goldsmith, 54, American composer. * April 29 - Amarillo Slim, 83, American professional poker player. * April 30 - Tomas Borge, 81, Nicaraguan politician, complications from surgery. * April 30 - Alexander Dale Oen, 26, Norwegian swimmer, heart failure. == May == * May == June == * June 2 - Kathryn Joosten, 72, American television actress, lung cancer. * June 2 - Richard Dawson, 79, English actor and former host of Family Feud, complications related to esophageal cancer. * June 3 - Roy Salvadori, 90, English motor racing driver. * June 4 - Eduard Khil, 77, Russian baritone singer. * June 5 - Barry Unsworth, 81, British writer. * June 5 - Ray Bradbury, 91, American writer and screenwriter, after long illness. * June 6 - Prince Tomohito of Mikasa, 66, Japanese royal, cancer. * June 6 - Vladimir Krutov, 52, Soviet-Russian ice hockey player, internal bleeding and liver failure. * June 6 - Manuel Preciado Rebolledo, 54, Spanish footballer and coach, heart attack. * June 7 - Abid Hamid Mahmud, 55, Iraqi military officer, execution by hanging. * June 7 - Bob Welch, 65, American musician, suicide by gunshot. * June 7 - J. Michael Riva, 63, American production designer, stroke. * June 10 - George Saitoti, 66, Kenyan politician and former Vice president of Kenya, helicopter crash. * June 11 - Ann Rutherford, 94, Canadian-born American actress, heart problems. * June 11 - Teofilo Stevenson, 60, Cuban boxer, heart attack. * June 12 - Henry Hill, 69, American convict. * June 12 - Elinor Ostrom, 78, American economist and Nobel laureate, cancer. * June 13 - Roger Garaudy, 98, French philosopher and Holocaust denier. * June 13 - William Standish Knowles, 95, American chemist and Nobel laureate. * June 14 - Carlos Reichenbach, 67, Brazilian movie director, heart failure.Boca do Lixo Pioneer Carlos Reichenbach Dies * June 16 - Nils Karlsson, 94, Swedish cross-country skier. * June 16 - Susan Tyrrell, 67, American actress, blood disease. * June 16 - Nayef bin Abdul-Aziz al-Saud, 78, Crown Prince of Saudi Arabia. * June 17 - Rodney King, 47, American victim of police brutality, unexplained circumstances. * June 19 - Norbert Tiemann, 87, American politician and 32nd Governor of Nebraska. * June 21 - Ramaz Shengelia, 55, Soviet-Georgian footballer, brain haemorrhage. * June 21 - Anna Schwartz, 96, American economist and writer. * June 23 - Brigitte Engerer, 59, French pianist, cancer. * June 23 - Alan McDonald, 48, Northern Irish footballer and manager. * June 24 - Lonesome George, c. 100, Ecuadorean Pinta Island tortoise and last-known survivor of his sub-species. * June 24 - Heino Kruus, 85, Estonian basketball player. * June 24 - Miki Roque, 23, Spanish footballer, pelvic cancer. * June 26 - Nora Ephron, 71, American writer, screenwriter and director, leukaemia. * June 30 - Yitzhak Shamir, 96, two-time former Prime Minister of Israel, Alzheimer's disease. ==July== * July 1 - Alan G. Poindexter, 50, American NASA astronaut, jet ski accident. * July 1 - Evelyn Lear, 86, American operatic soprano. * July 3 - Sergio Pininfarina, 85, Italian senator for life, engineer and automobile designer. * July 3 - Andy Griffith, 86, American stage, movie, and television actor, heart attack. * July 4 - Eric Sykes, 89, British actor and writer. * July 5 - Gerrit Komrij, 68, Dutch writer, cancer. * July 7 - Leon Schlumpf, 87, Swiss politician, former Member of the Federal Council and former President of the Confederation. * July 7 - Mouss Diouf, 47, Senegalese-born French actor and humorist. * July 8 - Ernest Borgnine, 95, American actor, renal failure. * July 9 - Terepai Maoate, 78, 6th Prime Minister of the Cook Islands. * July 9 - Dom Eugênio de Araújo Sales, 91, Brazilian Roman Catholic cardinal, heart failure. * July 9 - Isuzu Yamada, 95, Japanese movie actress, multiple organ failure. * July 9 - Eva Rausing, 48, American businesswoman and philanthropist (body found on this date), heart attack linked to drug abuse. * July 10 - Lol Coxhill, 79, English jazz saxophonist. * July 12 - Dara Singh, 83, Indian wrestler and actor. * July 13 - Jerzy Kulej, 71, Polish boxer and politician. * July 13 - Richard D. Zanuck, 77, American movie producer, heart attack. * July 13 - Sage Stallone, 36, American actor, movie director, producer and screenwriter, atherosclerosis (body found on this date). * July 14 - Sixten Jernberg, 83, Swedish cross-country skier. * July 15 - Celeste Holm, 95, American actress. * July 16 - Jon Lord, 71, British musician (Deep Purple), pancreatic cancer and pulmonary embolism. * July 16 - Stephen Covey, 79, American writer, complications from bicycle accident. * July 18 - Rajesh Khanna, 69, Indian actor, producer and politician. * July 18 - Jean Francois- Poncet, 83, French diplomat, politician and former Foreign Minister of France. * July 19 - Omar Suleiman, 76, Egyptian army general, politician, diplomat and intelligence officer. * July 19 - Hans Nowak, 74, German footballer. * July 22 - Bohdan Stupka, 70, Ukrainian actor and former Minister of Culture. * July 22 - George Armitage Miller, 92, American psychologist. * July 22 - Oswaldo Paya, 60, Cuban activist, traffic collision. * July 23 - Sally Ride, 61, American astronaut and astrophysicist, pancreatic cancer. * July 24 - Larry Hoppen, 61, American singer and guitarist, hanging. * July 24 - John Atta Mills, 68, President of Ghana. * July 24 - Sherman Hemsley, 74, American actor and comedian. * July 24 - Chad Everett, 76, American actor, lung cancer. * July 26 - Franz West, 65, Austrian artist. * July 26 - Lupe Ontiveros, 69, American actress. * July 27 - Norman Alden, 87, American actor, natural causes. * July 27 - R. G. Armstrong, 95, American actor, natural causes. * July 27 - Tony Martin, 98, American singer and actor, natural causes. * July 27 - Jack Taylor, 82, English football referee. * July 27 - Russ Mayberry, 86, Scottish- American television director, illness. * July 27 - Geoffrey Hughes, 68, British actor, prostate cancer. * July 30 - Chris Marker, 91, French photographer, writer and documentary moviemaker. * July 30 - Maeve Binchy, 72, Irish novelist, after short illness. * July 31 - Alfredo Ramos de Oliveira, 87, Brazilian footballer and coach. * July 31 - Gore Vidal, 86, American writer, complications from pneumonia. == August == * August 1 - Tony Sly, 41, American singer, songwriter and guitarist. * August 1 - Aldo Maldera, 58, Italian footballer. * August 2 - Mihaela Ursuleasa, 33, Romanian pianist, cerebral hemorrhage (body found on this date). * August 5 - Chavela Vargas, 93, Costa Rican-born Mexican singer-songwriter and actress, respiratory arrest. * August 6 - Bernard Lovell, 98, British physicist and radio astronomer. * August 6 - Ruggiero Ricci, 94, American violinist, heart failure. * August 6 - Marvin Hamlisch, 68, American composer, after short illness. * August 9 - Mel Stuart, 83, American director and producer, cancer. * August 9 - Al Freeman, Jr., 78, American actor. * August 10 - Carlo Rambaldi, 86, Italian special effects artist. * August 13 - Johnny Pesky, 92, American baseball player, manager and coach. * August 13 - Helen Gurley Brown, 90, American writer, publisher and businesswoman. * August 14 - Phyllis Thaxter, 92, American actress, Alzheimer's disease. * August 14 - Svetozar Gligoric, 89, Serbian chess grandmaster, stroke. * August 14 - Sergey Kapitsa, 84, Russian physicist. * August 15 - Harry Harrison, 87, American science fiction writer. * August 15 - Biff Elliot, 89, American movie and television actor. * August 16 - Abune Paulos, 76, Ethiopian Orthodox Church Patriarch. * August 16 - William Windom, 88, American movie, television, voice, and stage actor, heart failure. * August 18 - Jesse Robredo, 54, Filipino politician, plane crash. * August 18 - Scott McKenzie, 73, American singer and songwriter. * August 19 - Tony Scott, 68, British movie director and producer (brother of Ridley Scott), suicide by jumping. * August 20 - Phyllis Diller, 95, American actress and comedian, natural causes. * August 20 - Dom Mintoff, 96, former Prime Minister of Malta, natural causes. * August 20 - Meles Zenawi, 57, Prime Minister of Ethiopia and former President, illness. * August 20 - Virginia Dwyer, 92, American movie and television actress, natural causes. * August 21 - William Thurston, 65, American mathematician. * August 22 - Paul Shan Kuo- hsi, 88, Taiwanese Roman Catholic cardinal, lung cancer. * August 23 - Steve Van Buren, 91, Honduran-born American football player, pneumonia. * August 23 - Jerry Nelson, 78, American puppeteer and voice actor for The Muppets and Sesame Street, cancer. * August 24 - Felix Mielli Venerando, 74, Brazilian footballer, cardiac arrest. * August 24 - Pauli Ellefsen, 76, former Prime Minister of the Faroe Islands. * August 24 - Steven Franken, 80, American television, voice and movie actor, cancer. * August 25 - Neil Armstrong, 82, American astronaut and first person to walk on the Moon, complications from heart surgery. * August 27 - Russell Scott, 91, American entertainer, pneumonia. * August 27 - Malcolm Browne, 81, American journalist and photographer, complications from Parkinson's disease. * August 28 - Said Afandi al-Chirkawi, 74, Russian Muslim Sufi leader, bombing. * August 28 - Alfred Schmidt, 81, German philosopher. * August 30 - Chris Lighty, 44, American music executive and talent agent, suicide. * August 31 - Sergey Leonidovich Sokolov, 101, Soviet-Russian military commander. * August 31 - Carlo Maria Martini, 85, Italian Roman Catholic cardinal and Archbishop of Milan. * August 31 - Max Bygraves, 89, British talk show host, actor, singer, and comedian who hosted Family Fortunes, Alzheimer's disease. == September == * September 1 - Hal David, 91, American songwriter, complications from a stroke. * September 1 - Smarck Michel, 75, 6th Prime Minister of Haiti, brain tumor. * September 3 - Sun Myung Moon, 92, Korean religious leader, pneumonia. * September 3 - Mahmoud El-Gohary, 74, Egyptian footballer and coach, complications from a stroke. * September 3 - Michael Clarke Duncan, 54, American actor, complications from a heart attack. * September 6 - Art Modell, 87, American businessman and former NFL team owner, heart failure. * September 6 - Terry Nutkins, 66, British naturalist and television presenter, leukemia. * September 7 - Leszek Drogosz, 79, Polish Olympic boxer and actor, cancer. * September 8 - Bill Moggridge, 69, British designer, writer and educator, cancer. * September 8 - Mārtiņš Roze, 47, Latvian politician and Minister of Agriculture, blood clot. * September 8 - Thomas Szasz, 92, Hungarian psychiatrist. * September 10 - Lance LeGault, 77, American movie, television, and voice actor. * September 10 - Vondell Darr, 93, American silent movie and child actress. * September 11 - Sergio Livingstone, 92, Chilean footballer, natural causes. * September 11 - Deaths in the 2012 U.S. diplomatic missions attacks: **Christopher Stevens, 52, American diplomat and 10th Ambassador of Libya, murdered. **Sean Smith, 34, American diplomat, murdered. **Glen Doherty, 42, American security officer, murdered. **Tyrone Woods, American former U.S. Navy Seal, murdered. * September 12 - Derek Jameson, 82, British journalist and broadcaster, heart attack. * September 12 - Sid Watkins, 84, British neurosurgeon. * September 13 - Peter Lougheed, 84, Canadian politician, lawyer, and football player, natural causes. * September 16 - Princess Ragnhild of Norway, 82, Norwegian royalty, after long illness. * September 16 - John Ingle, 84, American movie, television, and voice actor. * September 17 - Russell E. Train, 92, American politician. * September 18 - Santiago Carrillo, 97, Spanish Communist politician. * September 20 - Fortunato Baldelli, 77, Italian Roman Catholic cardinal. * September 21 - Henry Bauchau, 99, Belgian psychoanalyst and writer. * September 21 - Michael Rye, 94, American movie, television, stage, voice, and video game actor, natural causes. * September 23 - Corrie Sanders, 46, South African boxer, shot. * September 23 - Pavel Grachev, 64, Russian general and politician. * September 25 - Andy Williams, 84, American singer and entertainer, bladder cancer. * September 26 - Johnny Lewis, 28, American movie and television actor, injuries from a fall. * September 27 - Herbert Lom, 95, Czech-born British movie and television actor. * September 28 - Michael O'Hare, 60, American movie, stage, and television actor, heart attack. * September 29 - Carlos Büsser, 84, Argentine military personal who was commander of Operation Rosario, heart attack. * September 29 - Hebe Camargo, 83, Brazilian actress, singer and television presenter, cardiac arrest. * September 29 - Arthur Ochs Sulzberger, 86, American publisher. * September 30 - Barbara Ann Scott, 84, Canadian figure skater. * September 30 - Barry Commoner, 95, American biologist, professor and politician, natural causes. == October == * October 1 - Eric Hobsbawm, 95, British historian and writer, after long illness. * October 1 - Dirk Bach, 51, German actor, comedian and television presenter. * October 1 - Moshe Sanbar, 86, Hungarian-born Israeli economist. * October 5 - Claude Pinoteau, 87, French movie director and screenwriter. * October 6 - Chadli Bendjedid, 83, 3rd President of Algeria. * October 7 - Heriberto Lazcano Lazcano, 37, Mexican druglord, shot. * October 8 - Ken Sansom, 85, American movie, television, stage, radio, and voice actor, stroke. * October 9 - Paddy Roy Bates, 91, British pirate radio broadcaster and founder of the Sealand micronation, Alzheimer's disease. * October 10 - Alex Karras, 77, American football player and actor, kidney failure. * October 11 - Helmut Haller, 73, German footballer, Parkinson's and Alzheimer's disease. * October 11 - Edgar Negret, 92, Colombian sculptor, cancer and heart failure. * October 13 - Gary Collins, 74, American movie, television, stage, radio, voice actor, and television host, natural causes. * October 14 - Arlen Specter, 82, American politician and former United States Senator for Pennsylvania. * October 15 - Norodom Sihanouk, 89, former King of Cambodia, heart attack. * October 15 - Claude Cheysson, 92, French politician and former foreign minister. * October 17 - Emile Allais, 100, French alpine skier. * October 17 - Sylvia Kristel, 60, Dutch actress, model and singer, complications from cancer. * October 17 - Stanford R. Ovshinsky, 89, American inventor and scientist, prostate cancer. * October 18 - Slater Martin, 86, American basketball player. * October 19 - Fiorenzo Magni, 91, Italian road racing cyclist, aneurysm. * October 20 - E. Donnall Thomas, 92, American physician and Nobel Prize winner. * October 20 - Paul Kurtz, 86, American Secular Humanist philosopher. * October 21 - George McGovern, 90, American politician, former United States Senator for South Dakota and 1972 Presidential candidate, natural causes. * October 21 - Yash Chopra, 80, Indian movie director, screenwriter and producer. * October 22 - Russell Means, 72, Native American activist, writer, musician, politician and actor, esophageal cancer. * October 22 - Shubha Phutela, 21, Indian movie actress and model, multiple organ failure. * October 23 - Sunil Gangopadhyay, 78, Indian poet and novelist, heart attack. * October 23 - Wilhelm Brasse, 94, Polish photographer and Holocaust survivor. * October 24 - Anita Bjork, 89, Swedish actress. * October 24 - Margaret Osborne duPont, 94, American tennis player. * October 25 - John Connelly, 74, English footballer. * October 25 - Jacques Barzun, 104, French- born American historian and philosopher. * October 26 - John M. Johansen, 96, American architect, heart failure. * October 27 - Hans Werner Henze, 86, German composer. * October 27 - Natina Reed, 32, American singer-songwriter, rapper and actress, traffic collision. * October 28 - Terry Callier, 67, American jazz, soul and folk guitarist and singer-songwriter, cancer. * October 29 - J. Bernlef, 75, Dutch novelist and poet. * October 29 - Albano Harguindeguy, 85, Argentine general, natural causes. * October 31 - John Fitch, 95, American racing driver, engineer and inventor. * October 31 - John H. Reed, 91, American politician and 67th Governor of Maine. == November == * November 1 - Mitch Lucker, 28, American singer (Suicide Silence), traffic collision. * November 1 - Gae Aulenti, 84, Italian architect and designer. * November 1 - Agustin Garcia Calvo, 86, Spanish academic and philosopher, respiratory failure. * November 2 - Milt Campbell, 78, American athlete, prostate cancer and diabetes. * November 4 - Ted Curson, 77, American jazz trumpeter. * November 5 - Elliott Carter, 103, American composer, natural causes. * November 6 - Maxim of Bulgaria, 98, Patriarch of the Bulgarian Orthodox Church. * November 6 - Clive Dunn, 92, British actor, comedian and writer, complications from surgery. * November 7 - Carmen Basilio, 85, American boxer, pneumonia. * November 8 - Lucille Bliss, 96, American actress, natural causes. * November 9 - Sergey Nikolsky, 107, Russian mathematician. * November 9 - Joseph D. Early, 79, American politician and member of the House of Representatives from Massachusetts, illness. * November 9 - Bill Tarmey, 71, British actor, heart attack. * November 9 - Major Harris, 65, American R&B; singer (\"Love Won't Let Me Wait\"), member of The Delfonics, heart and lung failure. * November 11 - Rex Hunt, 86, British former Governor of the Falkland Islands. * November 12 - Sergio Oliva, 71, Cuban-born American bodybuilder. * November 14 - Ahmed Jabari, 52, Palestinian military commander (Hamas), airstrike. * November 16 - Aliu Mahama, 66, former Vice president of Ghana. * November 17 - Bal Thackeray, 86, Indian politician, cardio- respiratory arrest. * November 19 - Pete La Roca, 74, American jazz drummer. * November 20 - David O'Brien Martin, 68, American politician, cancer. * November 21 - Ajmal Kasab, 25, Pakistani gunman in the 26 November 2008 Mumbai attacks, executed by hanging. * November 21 - Deborah Raffin, 59, American actress, leukemia. * November 22 - Bryce Courtenay, 79, South African- Australian writer, stomach cancer. * November 23 - Larry Hagman, 81, American actor, director and producer, leukemia. * November 24 - Héctor Camacho, 50, Puerto Rican boxer, shot. * November 25 - Dave Sexton, 82, English footballer and coach. * November 25 - Lars Hormander, 81, Swedish mathematician. * November 26 - Joseph E. Murray, 93, American doctor who performed the first successful kidney transplant, stroke. * November 28 - Zig Ziglar, 86, American writer, speaker, and salesman, pneumonia. * November 30 - I. K. Gujral, 92, former Prime Minister of India, multiple organ failure. == December == * December 1 - Mitchell Cole, 27, English footballer, heart problem. * December 1 - Phil Taylor, 95, English footballer and coach. * December 1 - Jovan Belcher, 25, American football player and murderer, suicide by gunshot. * December 2 - Ehsan Naraghi, 86, Iranian sociologist and writer, long illness. * December 4 - Miguel Calero, 41, Colombian footballer. * December 4 - Besse Cooper, 116, American supercentenarian and world's oldest person, respiratory failure. * December 5 - Dave Brubeck, 91, American jazz pianist, composer and bandleader, heart failure. * December 5 - Elisabeth Murdoch, 103, Australian philanthropist and mother of Rupert Murdoch, natural causes. * December 5 - Oscar Niemeyer, 104, Brazilian architect, cardiac arrest. * December 6 - Miguel Abia Biteo, 51, former Prime Minister of Equatorial Guinea, heart attack. * December 9 - Patrick Moore, 89, English astronomer, writer and broadcaster, infection. * December 9 - Jenni Rivera, 43, American-Mexican singer and actress, plane crash.Associated Press (December 9, 2012). Jenni Rivera, Mexican-American singer, killed in plane crash in northern Mexico; she was 43 years old. New York Daily News * December 9 - Charles Rosen, 85, American pianist and writer on music. * December 10 - Iajuddin Ahmed, 81, former President of Bangladesh, heart and kidney disease. * December 10 - Lisa Della Casa, 93, Swiss operatic soprano. * December 11 - Galina Vishnevskaya, 86, Russian operatic soprano. * December 11 - Ravi Shankar, 92, Indian sitarist, after short illness. * December 13 - Maurice Herzog, 93, French mountaineer. * December 14 - Kenneth Kendall, 88, British television broadcaster, stroke. * December 17 - Dina Manfredini, 115, Italian-American supercentenarian and world's oldest person. * December 17 - Daniel Inouye, 88, United States Senator for Hawaii, respiratory complications .Cillizza, Chris. \"Hawaii Sen. Daniel Inouye dies at age 88,\" Washington Post. December 17, 2012; retrieved 2012-12-17. * December 19 - Peter Struck, 69, German politician, heart attack. * December 19 - Robert Bork, 85, American legal scholar who was nominated to become part of the United States Supreme Court in 1987, heart disease. * December 20 - Jimmy McCracklin, 91, American blues musician, diabetes and hypertension. * December 21 - Lee Dorman, 70, American bass guitarist, natural causes. * December 22 - Cliff Osmond, 75, American actor, writer, producer, director, and screenwriter, pancreatic cancer. * December 24 - Richard Rodney Bennett, 76, British composer and musician. * December 24 - Charles Durning, 89, American actor, natural causes. * December 24 - Jack Klugman, 90, American stage, television and movie actor, prostate cancer. * December 25 - Frank Calabrese, Sr., 75, American Chicago mafia hitman (Family Secrets), suspected heart disease. * December 25 - Othmar Schneider, 84, Austrian alpine skier. * December 26 - Gerry Anderson, 83, British writer, director and producer. * December 26 - Fontella Bass, 72, American singer, heart attack. * December 27 - Norman Schwarzkopf, Jr., 78, American general, complications from pneumonia. * December 27 - Harry Carey, Jr., 91, American actor, natural causes. * December 28 - Václav Drobný, 32, Czech footballer, bobsleighing accident. * December 28 - Emmanuel Scheffer, 88, German-born Israeli football coach. * December 29 - Tony Greig, 66, South African-born English cricketer, heart attack. * December 29 - Mike Auldridge, 73, American bluegrass musician, cancer. * December 30 - Rita Levi-Montalcini, 103, Italian neurologist, neurobiologist and Nobel Prize winner, natural causes. * December 30 - Carl Woese, 84, American scientist and biologist, pancreatic cancer. ==References==",
 "title": "Deaths in 2012"
}