{
 "id": "320991",
 "text": "Louise I. Shelley is a professor at George Mason University in Virginia. She is also founder and director of the Terrorism, Transnational Crime and Corruption Center (TraCCC). She graduated from Cornell University cum laude in Penology and Russian literature in 1972. While there, she co-founded the Risley Residential College. She served on the Cornell Board of Trustees. She got a M.A. from the University of Pennsylvania in Criminology in 1973. In 1973/74, she held a Columbia University, International Research and Exchanges Board (IREX) Fellowship used to study in the Sociology Department, Law School and the Russian Institute. In 1977, Shelley earned a Ph.D. in Sociology at the University of Pennsylvania. She joined the American University as an Assistant Professor in 1977. She became a full professor in 1986. In 2007, she moved to George Mason University. Shelley has studied at Moscow State University as a Fulbright-Hayes Fellow. She studied the prison system of Russia and other nations. She studies how criminals make their money hard to trace (money laundering). ==Books== * Human Security, Transnational Crime and Human Trafficking edited with Shiro Okubo New York and London, Routledge, 2011. * Human Trafficking: A Global Perspective New York and Cambridge: Cambridge University Press, 2010. * Organised Crime and Corruption in Georgia edited with Erik R. Scott and Anthony Latta, London and New York: Routledge, 2007. * Human Traffic and Transnational Crime: Eurasian and American Perspectives edited with Sally Stoecker Lanham, Md: Rowman and Littlefield, 2004. * Izucheniye organizovannoy prestupnosti: rossiisko-amerikanskii dialog, edited with Ninel Kuznetsova and Yu. G. Kozlov, Moscow: Olimp, 1997. * Policing Soviet Society: The Evolution of State Control, London: Routledge, 1996. * Social Changes, Crime and the Police, edited with Jozsef Vigh Reading: Harwood Press, 1995. * Crime and Control in Comparative Perspective, edited with H.G. Heiland and H. Katoh. Berlin: Walter de Gruyter, 1992. * Crime and Development (edited special issue), International Annals of Criminology, 1986, Vol. 24, Nos. 1 and 2. * Lawyers in Soviet Work Life, Law, Crime and Deviance Series, Rutgers University Press, 1984. * Crime and Modernization, The Impact of Industrialization and Urbanization on Crime, Southern Illinois University Press, first printing, March 1981, second printing, March 1982. Translated into Chinese, published Bejing: Public Publishing House, 1987. * Readings in Comparative Criminology, Southern Illinois University Press, 1981 (edited Collection). * History Without Jews, B'nai B'rith, 1977. ==Other websites== * Official webpage * Bio at quarterly journal dispatches Category:American sociologists Category:Writers from Virginia Category:Living people Category:1952 births",
 "title": "Louise I. Shelley"
}