{
 "id": "32092",
 "text": "Tashkent (, )) is the capital city of Uzbekistan. It is also the most populated city in Central Asia, with a population of 2,603,000 in 2023. Its name means \"Stone City\" in English. Tashkent has been inhabited by people for thousands of years. It was destroyed by Genghis Khan in 1219, but later profited from the Silk Road. Tashkent was conquered by the Russian Empire in 1865, and became the capital of Russian Turkestan.Malikov A., The Russian conquest of the Bukharan Emirate: military and diplomatic aspects in Central Asian Survey, Volume 33, Issue 2, 2014, pp. 180–198. Under the Soviet Union, Tashkent grew in population. In 2008, Uzbeks accounted for 63% of the population, and the city has large minorities of Russians, Tatars, Koreans, and Tajiks. == Geography == Tashkent is west of the Altai Mountains, and is next to the Chirchiq River. Tashkent is situated at around 430 m (1,411 ft) above sea level. Tashkent also suffers from earthquakes, and the major 1966 earthquake destroyed most of the city. Tashkent has a mediterranean climate with continental climate influences. Winters are cold and snowy, while summers are hot, sunny, and dry. The record high temperature was 44.6 °C (112.3 °F), and the record low temperature was −29.5 °C (−21.1 °F). The city has an average of 427 mm (17 inches) of precipitation each year. == Main sights == Tashkent is full is historical sights, and this article will just mention a few. The Amir Timur Museum was opened in 1996, and is dedicated to Mongol conqueror Timur. There are at least 5,000 artifacts on display at the museum. Around 2 million people visit the location each year, and the museum is featured on the 1,000 soʻm bank note. The museum is located downtown next to the Amir Temur Square. The Kukeldash Madrasah (Tashkent) is an ancient madrasa located close to the Chorsu metro station. It was built in the 16th century during Shaybanid rule. Throughout its existence, it functioned as a caravanserai, museum, and fortress. It was one of the few buildings to survive the 1966 earthquake. The Navoi Theater, formally the Alisher Navoi Opera and Ballet Theatre, is the possibly the most notable opera house and theatre in Uzbekistan. It was designed by Alexey Shchusev, who also designed Lenin's Mausoleum in Moscow. It was partially built by the Japanese prisoners of war from 1945 to 1947. The theatre can house at least 1,400 spectators. == Sports == Tashkent is home to some of the most successful Uzbek football clubs. These include Pakhtakor Tashkent, Lokomotiv Tashkent, Bunyodkor, and Spartak Tashkent. Some notable athletes from Tashkent include cyclist Djamolidine Abdoujaparov, gymnast Elvira Saadi, and footballer Maksim Shatskikh. == References == == Other websites == * All about capital of Uzbekistan – Tashkent * Photos of historical monuments and modern buildings in Tashkent * Recent photos of Tashkent with comments in English",
 "title": "Tashkent"
}