{
 "id": "320901",
 "text": "Leka, Crown Prince of Albania was Albanian (also known as King Leka I; 5 April 193930 November 2011), was the only son of King Zog I of Albania. Leka was also called King Leka of Albania, but he was never the ruler of the country. He was born in Tirana in 1939. Two days later, the family was forced to leave Albania after Italy invaded the country. When his father died in exile in 1961, Leka was crowned king in a hotel in Paris. He returned to Albania in 1993, but was not allowed to stay in the country. He made a second visit in 1997. The country held a vote to decide whether they wanted to go back to a monarchy or stay as a republic. The country voted for a republic, but Leka said the vote had been changed. His supporters created demonstrations against the government. Several people were killed in the demonstrations. Leka again had to leave Albania. In 2002, he made an agreement with the government and came back to Tirana. ==Death== He died on 30 November 2011 in Mother Teresa Hospital, Tirana from heart and lung illnesss. He was buried next to his wife’s and mother’s grave at the public Sharra cemetery in a Tirana suburb. Later he was buried in the royal mausoleum.The Washington Post ==Ancestors== ==Other sources== * Dedet, Joséphine \"Géraldine, reine des Albanais\". Paris: Belfond, 2016, published at the occasion of Prince Leka's wedding in Tirana, on October 8, 2016 (Leka being Geraldine's grand-son) ; former editions: Criterion, 1997 and Belfond, 2012, . Biography enriched by the Queen's testimony, by her personal archives and by a huge correspondence with the author, who has benefited of many unpublished sources. * Dedet, Joséphine, Géraldine, Egy Magyar No Albania Tronjan, Budapest : Europa, 2015, , best- seller in Hungary, translation of Géraldine, reine des Albanais\". * Najbor, Patrice. \"Histoire de l'Albanie et de sa Maison Royale\" (5 volumes) - JePublie - Paris - 2008 * Rees, Neil. A Royal Exile – King Zog & Queen Geraldine of Albania including their wartime exile in the Thames Valley and Chilterns, 2010 () Category:1939 births Category:2011 deaths Category:Albanian people Category:Princes and princesses Category:People from Tirana",
 "title": "Leka, Crown Prince of Albania"
}