{
 "id": "320947",
 "text": "The International Association of Aviation Personnel Schools (IAAPS) is an association of pilot training organizations created in 1995. IAAPS is recognized by national and international aviation authorities. IAAPS is part of the rulemaking group of the European Aviation Safety Agency. (EASA)European Aviation Safety Agency (EASA), Rulemaking Group Composition, 31 October 2008; International Association of Aviation Personnel Schools (IAAPS), Projects and achievements; retrieved 2012-1-4. ==History== In 1990, the so-called \"Cyprus Agreement\" caused the European Joint Aviation Authority (JAA) to be established.IAAPS, History ; retrieved 2012-1-4. In 1995, the European Association of Airline Pilot Schools (EAAPS) was established. The EAAPS was active in the pan-European project to define and standardize the depth and scope of flight training within the JAA.Oxford Aviation Services. (2001). JAA- ATPL Theoretical Knowledge Manual: Aircraft General Knowledge, Airframes and Systems, p. 3; retrieved 2012-1-5. One of the results was the \"Joint Aviation Requirement Flight Crew Licensing code\" (JAR-FCL). In 2009, the EAAPS became a worldwide association. The name or the organization was changed changed to IAAPS. ==Mission== As a global pilot shortage grows,Pearson, David. \"Global pilots shortage worsens,\" The Australian, April 25, 2008; retrieved 2012-1-4. IAAPS members work together to maintain and improve the quality standards of pilot training. Aviation training improves air safety standards.Lekic, Slobodo. \"Shortage of pilots affecting flight safety,\" The Independent (South Africa). July 17 2007; Dahlström, Nicklas. (2002). \"Current aspects on aviation training and its relevance for safety,\" Human Factors and Safety in Aviation: Proceedings of a Conference September 26-27, 2002, Lund, Sweden, p. 47. IAAPS is recognized by the EASA as the representative of the training industry.IAAPS, Projects ; retrieved 2012-1-5. IAAPS activities include * EASA Advisory Board (EAB) * Safety Standards Consultative Committee (SSCC) * Subject Expert Team (SET) * Theoretical Knowledge Steering Group (TKStG) * Human Factor Steering Group (HFStG) IAAPS helped to develop \"learning objectives\" for aircraft and helicopters. These were published by the JAA and then by EASA. == Members == The membership is comprised of aviation training organizations. Each member organization is certified nationally. The international membership is expanding.IAAPS, Members ; retrieved 2012-1-4. ===Austria=== * AeronautX Luftfahrtschule, Hoersching ===Belgium=== * Ben-Air Flight Academy (BAFA), Antwerp * Sabena Flight Academy (SFA), Steenokkerzeel ===Croatia=== * Croatia Aviation Training Center, Lucko ===Finland=== * Finnish Aviation Academy , Pori ===France=== * Airbus Training, Blagnac * École de Pilotage Amaury de la Grange , Merville * École nationale de l'aviation civile (ÉNAC), Muret * ESMA Aviation Academy, Mauguio * Institut aéronautique Jean Mermoz, Rungis ===Germany=== * Haeusl 'air, Fürth * IKON Gmbh , Erlangen * Lufthansa Flight Training, Bremmen * Verband Deutsche Verkehrsfliegerschule (VDV), Essen ===Morocco=== * École National des Pilotes de Ligne (ENPL), Benslimane Le Magazine du Manager (Morocco),\"L'Ecole nationale des pilotes de ligne de la RAM adhère à l'International association of Aviation personnel schools\" ; RAM Academy est devenue membre de IAAPS; retrieved 2012-1-5. ===Netherlands=== * Dutch Flight Academy (DFA), Eelde * EPST, Utrecht * KLM Flight Academy, Paterswolde * Nationale Luchtvaart School CAE- NLS, Hoofddorp * Stella Aviation Academy , Teuge ===Spain=== * Asociación de Escuelas de Formación Aeronáutica (AEFA), Madrid * Flight Training Europe Ltd (FTE), Cadiz ===Sweden=== * European Flight Training Academy (EFTA), Bromma * Scandinavian aviation academy , Vasteras ===Switzerland=== * Swiss Aviation Training Ltd , Zurich ===Turkey=== * ER-AH Aviation Commerce Ltd Co. , Antalya * Istanbul DUHA Aviation Flight School, Istanbul ===United Kingdom=== * Atlantic Flight Training Ltd , Coventry * Bristol Flying Centre , Bristol * Cabair College of Air Training, Bedford * London Metropolitan University , London * Oxford Aviation Academy (OAA), Oxford == References == == Other websites == * Official website Category:Aviation organizations Category:Organizations based in the Netherlands",
 "title": "International Association of Aviation Personnel Schools"
}