{
 "id": "321138",
 "text": "The Jadeite Cabbage (), or Jadeite Cabbage with Insects, is a Chinese sculpture. It is a piece of jadeite carved into the shape of a Chinese cabbage head. It also has a locust and a katydid hiding in the leaves. The work is part of the collection of the National Palace Museum in Taipei, Taiwan.Jadeite Cabbage with Insects at the National Palace Museum website. Retrieved 20 November 2010. ==Description== The Jadeite Cabbage is a small sculpture. It measures only . It is think. It is \"hardly larger than a human hand\".Leslie Hook. \"The Jade Cabbage\" Wall Street Journal. 27 July 2007. Retrieved 20 November 2010. Jade is translucent: it lets light pass through the sculpture. The combination of several colors in the jade gives the leaves the various colors of a real cabbage. The sculpture was made from one piece of half-white, half-green jadeite. The piece of jade has many imperfections. These include cracks and patches of different colors. These were used as the veins in the cabbage's stalks and leaves.Sam Ju. \"The Crystallization of the Jadeite Cabbage.\" Translated by David Smith. Taiwan Panorama. October 2009. p. 83. Retrieved 20 November 2010. The sculpture is seen as a symbol of female virtue. The white stalk is a symbol of purity, the leaves show fertility and the locust and katydid symbolize children. ==History== The sculptor of the Jadeite Cabbage is not known. It was first shown in the Forbidden City's Yonghe Palace. This is the home of the Qing Empire's Guangxu Emperor's Consort Jin. She likely got the sculpture as part of her dowry for her wedding to Guangxu in 1889. After the end of the Qing Empire in the Chinese Revolution of 1911, the sculpture became part of the collection of the Palace Museum in the Forbidden City. The piece survived the Second Sino-Japanese War (World War II) and the Chinese Civil War. It was finally made a part of Taiwan's National Palace Museum. ==Notability== The Jadeite Cabbage has been called the \"most famous masterpiece\" of the entire National Palace Museum. It is said the be one of the \"Three Treasures of the National Palace Museum\". The other two are the Meat-Shaped Stone and the Mao Gong Ding. It was picked by the public as the most important item in the museum's entire collection. People thought it was a bad thing in 2009 when it was learned that souvenir copies of the sculpture were being made in China and not in Taiwan.\"China-made NPM souvenirs blasted.\" China Post 2 April 2009. Retrieved 20 November 2010.\"'Jadeite Cabbage' relabeled.\" Taipei Times 4 April 2009. Retrieved 20 November 2010. These copies were being sold at the museum. ==References== ==Other websites== *Jadeite Cabbage with Insects at the National Palace Museum website *Leslie Hook. \"The Jade Cabbage\" Wall Street Journal. 27 July 2007. Category:Sculptures Category:Taiwan Category:19th-century works Category:19th century in art",
 "title": "Jadeite Cabbage"
}