{
 "id": "321537",
 "text": "Alexander \"Alex\" Zickler (born 28 February 1974 in Bad Salzungen, then German Democratic Republic) is a German football manager and former football player. He played as a striker. During his career he played for FC Bayern Munich. ==Career== He started playing at the age of six with Dynamo Dresden. He played in all youth ranks. His debut in the first team was on 23 October 1992 against 1. FC Nuremberg. In July 1993 Zickler went to FC Bayern Munich where he stayed as a player for 11 seasons. During this time he was often injured. He scored 18 goals as substitute which is record in the German Bundesliga. In June 2005 he went to FC Red Bull Salzburg together with his team mate Thomas Linke. With Red Bull Salzburg he won three Austrian titles. 2006 he was elected Austrian footballer of the year by the coaches of the Austrian Bundesliga. 2010 he went to LASK Linz. After the end of the 2010/11 season he retired from football. He went back to Red Bull Salzburg where he works as contact partner for fans and partner firms. Alexander Zickler played 17 times for Germanys U21 national team and scored 7 goals. In 12 matches for the German national football team he scored two goals. ==Honours== ===Club=== ; Bayern Munich * Bundesliga (7): 1993–94, 1996–97, 1998–99, 1999–2000, 2000–01, 2002–03, 2004–05 * DFB-Pokal (4): 1997–98, 1999–2000, 2002–03, 2004–05 * DFB-Ligapokal (5): 1996–97, 1997–98, 1998–99, 1999–2000, 2003–04 * UEFA Champions League (1): 2000–01 * UEFA Cup (1): 1995–96 * Intercontinental Cup (1): 2001 ; Red Bull Salzburg * Austrian Bundesliga (3): 2006–07, 2008–09, 2009–10 ===Individual=== * Austrian League Topscorer (2): 2006-07, 2007–08 * Austrian Footballer of the Year (1): 2005–06 * Austrian Footballers Association Player of the Year (1): 2006–07 ==References== ==Other websites== * Players profile Fußballdaten.de (German) Category:1974 births Category:German football managers Category:German footballers Category:Living people Category:FC Red Bull Salzburg players Category:Sportspeople from Thuringia Category:Austrian Football Bundesliga top scorers",
 "title": "Alexander Zickler"
}