{
 "id": "321543",
 "text": "was a after Ten'an and before Gangyō. This period started in April 859 and ended in April 877.Nussbaum, Louis-Frédéric. (2005). \"Jōgan\" in Japan Encyclopedia, p. 429. During this time, the emperors were and .Titsingh, Isaac. (1834). Annales des empereurs du japon, p. 115-121; Brown, Delmer et al. (1979). Gukanshō, p. 287; Varley, H. Paul. Jinnō Shōtōki, pp. 166-17. ==Events of the Jōgan era== * 859 (Jōgan 1, 1st month): New Year's festivities were suspended during national mourning for the death of Emperor Montoku.Titsingh, p. 116. * 864 (Jōgan 6, 5th month): Mount Fuji erupted during 10 days. Cinders and ash fell to earth as far away as Kai Province.Titsingh, p. 118. * 869 (Jōgan 10): Prince Sadaakira was born. He will later become Emperor Yōzei.Titsingh, p. 122. * 9 July 869 (May 26, Jōgan 11). The 869 Sanriku earthquake and tsunami causes damage at the Sanriku coast near Sendai. * 870 (Jōgan 11): Sadaakira was named Seiwa's heir. * 876 (Jōgan 17, 11th month): In the 18th year of Seiwa's reign, the emperor abdicated. His five-year-old son received the succession (senso).Titsingh, p. 122; Brown, p. 287. Soon after,Yozei was formally established as emperor on January 20, 877 (Gangyō 1, 3rd day of the 1st month). Emperor Yōzei accepted the monarch's role and duties and powers (sokui). This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2012-1-6. A collection of laws issued after 811 was published during this era. It was called the Jōgan kyaku-siki.Nussbaum, \"Jōgan kyaku-siki\" in Japan Encyclopedia, p. 429. ==Related pages== * Heian period == References == == Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Jōgan 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 Preceded by: Ten'an Era or nengō: Jōgan Succeeded by: Gangyō Category:Japanese eras Category:850s establishments in Japan Category:9th-century disestablishments in Japan Category:870s disestablishments",
 "title": "Jōgan"
}