{
 "id": "321637",
 "text": "George Robert Stephanopoulos (; born February 10, 1961) is an American television journalist and a former political advisor. Stephanopoulos is the chief political correspondent for the news division at ABC-TV– and a co-anchor of ABC-TVs morning news program, Good Morning America (GMA). He returned as host of ABC-TV's This Week in January 2012, a Sunday morning news program produced by ABC-TV's news division. He is the main replacement anchor for ABC- TV's newscast program, World News with Diane Sawyer.Allen, Mike (October 18, 2009). \"George Stephanopoulos Role Grows at ABC\". The Politico. Retrieved December 21, 2009. In recent years, he has co-hosted ABC Newss special live coverage of political events with Charles Gibson and Diane Sawyer. He and has often been on GMA and World News. He launched George's Bottom Line, an ABCNews.com blog. Before he started working for ABC News, he was a senior political adviser to the 1992 U.S. presidential campaign of Bill Clinton. He later became the White House Communications Director for two years. He was replaced by David Gergen. This change came after the Republican party getting control of the U.S. House and Senate in the mid-term elections of 1994. In April 2020, Stephanopoulos was diagnosed with COVID-19. ==References== ==Further reading== *Clinton, Bill (2005). My Life. Vintage (New York City). . *Stephanopoulos, George (1999). All Too Human – A Political Education. Little, Brown (Boston, Massachusetts). . ==Other websites== *abcnews.com/thisweek, This Week with George Stephanopoulos official website *blogs.abcnews.com/george, George's Bottom Line, an ABC News blog by Stephanopoulos * * Category:1961 births Category:Living people Category:American television news anchors Category:White House Communications Directors Category:American television personalities Category:Columbia University alumni Category:Journalists from New York (state) Category:Writers from New York City Category:Journalists from Washington, D.C. Category:Journalists from Ohio Category:Journalists from Massachusetts Category:Democrats (United States) Category:American bloggers",
 "title": "George Stephanopoulos"
}