{
 "id": "321842",
 "text": "Augustana College is a private liberal arts college in Rock Island, Illinois, United States. The college has about 2,500 students. Its campus is on of hilly, wooded land, next to the Mississippi River. Ninety-one percent of the full-time faculty hold PhDs or the highest degrees in their field. ==History== Graduates of the universities of Uppsala and Lund in Sweden started the college in 1860 in Chicago. In 1863, Augustana moved to Paxton, Illinois. In 1875, it moved to Rock Island, Illinois to be near a large Swedish Lutheran community. It was important to the growing Swedish American community. In the early years, all the students had been born in Sweden. But by 1890, most students had been born in America. They typically had white-collar or professional backgrounds; few were the sons and daughters of farmers and laborers. These middle class youth had positive thoughts about Sweden. They were proud of what traits people from Sweden brought to the United States.Dag Blanck, The Creation of an Ethnic Identity: Being Swedish American in the Augustana Synod, 1860–1917 (2006) ==Academics== Augustana ranks among the top forty U.S. liberal arts colleges in the sciences, based on the number of graduates earning PhDs. Students accepted to Augustana typically rank in the top 10% of their high school classes. The middle 50 percent of enrolled students for the class of 2012 scored 24-29 on the ACT, well above the national averages. Augustana College is considered highly selective.Princeton Review Augustana has about sixty academic programs including nine pre- professional and eight interdisciplinary programs: ===Academic Programs=== Accounting, Africana Studies, Anthropology, Art, Art History, Astronomy, Biochemistry, Biology, Business Administration, Chinese, Chemistry, Classics, Communication Sciences & Disorders (including Speech Pathology and Audiology), Communication Studies, Computer Science, Creative Writing, Economics, Education, Engineering, Engineering Physics, English, French, Geography, Geology, German, Graphic Design, History, International Business, Japanese, Landscape Architecture, Mathematics, Multimedia Journalism, Music, Neuroscience, Philosophy, Physics, Political Science, Psychology, Religion, Scandinavian, Sociology, Spanish, Theatre, World Literature ===Pre- Professional Programs=== Dentistry, Law, Medicine, Nursing, Occupational Therapy, Optometry, Pharmacy, Physical Therapy, Veterinary Medicine ===Interdisciplinary Programs=== Africana Studies, Asian Studies, Environmental Management and Forestry, Environmental Studies, Latin American Studies, Medieval and Renaissance Studies, Neuroscience, Women's and Gender Studies ==Campus== ===Academic buildings=== Old Main was constructed between 1884 and 1893. It is listed on the National Register of Historic Places. The Hanson Hall of Science was dedicated in 1998 is the largest academic building serving about 700 students in 17 majors, minors and concentrations. The Hanson Hall of Science's facilities and resources include seven classrooms, thirty- five laboratories (including a cadaver lab), a 400 MHz liquid-and solid-state NMR (nuclear magnetic resonance) spectrometer, scanning electron microscope, instrumentation for X-ray powder crystallography and a 40-foot greenhouse. ===Residential complexes=== Augustana has five traditional residence halls: Andreen Hall, Erickson Residence Center, Seminary Hall, Swanson Commons, and Westerlin Residence Center. All five of these residence halls are coeducational. The majority of first year and sophomore year students live in one of these five residence halls. For upperclassmen, Augustana also offers Transitional Living Areas (TLAs) in which Augustana students live in either apartment-like buildings or traditional off-campus houses administered by the college's Office of Residential Life. The school takes care of basic maintenance in these areas, some of which are House on the Hill, Naeseth, and Arbaugh Apartments. These areas usually have 2-6 students who share a bathroom, a kitchen, and other living spaces. Augustana provides several services to attending students. Services include: campus ministries, career center, student counseling, academic advising, student employment, business office, food services, safety office, campus security, computer services, and campus recreation. == Athletics == The Augustana Vikings compete in the NCAA Division III College Conference of Illinois and Wisconsin (CCIW). The Vikings compete in a combined total of 22 male and female team sports, and five out of seven students compete in some form of varsity, club, or intramural sport. The Augustana College football team won four NCAA Division III national championships in a row from 1983 - 1986 under Coach Bob Reade. Coach Reade's overall winning percentage of 87% is second only to Larry Kehres and Knute Rockne on the all-time list. Augustana College was a member of the Illinois Intercollegiate Athletic Conference from 1912 to 1937. Current varsity sports include: baseball, basketball (m/w), cross country (m/w), football, golf (m/w), lacrosse (m/w), soccer (m/w), softball, swimming (m/w), tennis (m/w), track and field (m/w), volleyball, wrestling. ==References== ==Other websites== * Official website Category:Colleges and universities in Illinois Category:1860 establishments in the United States Category:National Register of Historic Places Category:1860s establishments in Illinois",
 "title": "Augustana College (Illinois)"
}