{
 "id": "321989",
 "text": "Jack Abramoff (; born February 28, 1958) is an American former lobbyist and businessman.Nir, Ori. \"House Sets Limits on Palestinian Aid As DeLay Defies Calls of Bush, Rice.\" The Forward. March 18, 2005 In 2006, courts found him guilty of mail fraud and conspiracy. He was the center of very large corruption investigation. The investigation led to the conviction of White House officials J. Steven Griles and David Safavian, U.S. Representative Bob Ney, and nine other lobbyists and Congressional aides. He served three years, six months of a six-year sentence in federal prison before being released early to a Baltimore halfway house on June 8, 2010.Schmitt, Richard. \"Jack Abramoff Sentenced to 48 Months.\" Los Angeles Times 05 Sep 2008 21 Nov 2008.Mark Leibovich, \"Abramoff, From Prison to a Pizzeria Job\", New York Times, June 23, 2010. Abramoff was College Republican National Committee National Chairman from 1981 to 1985. He was a founding member of the International Freedom Foundation. He later became a lobbyist for the firm of Preston Gates & Ellis and later the firm of Greenberg Traurig. He served as a director of the National Center for Public Policy Research, a conservative think tank, and Toward Tradition. His wife Pam and their five children live in Maryland.\"Abramoff Lawyers Ask for Access to Tax Refund\", The Washington Post, June 3, 2009 Abramoff's lobbying and the scandals and investigation are the subject of two 2010 movies. These first movie was the documentary Casino Jack and the United States of Money. It was released in May 2010.Stephen Holden, \"The Eye in a Hurricane of Corruption\", New York Times, May 7, 2010. The second movie was Casino Jack. It was released on December 17, 2010 and starred Kevin Spacey as Abramoff.Casino Jack at IMDB.\"Bagman Trailer: The Other Jack Abramoff Movie\", Vulture at New York, June 15, 2010. ==Scandal and criminal investigations== In late 2004, the Senate Indian Affairs Committee began to investigate Abramoff's lobbying for American Indian tribes and casinos. In September he was called before the committee to answer questions about that work. He did not answer their questions and pleaded the fifth.Fox News \"Timeline of Key Events in Jack Abramoff Investigation\", January 4, 2006 In August 2005, Abramoff and Kidan were indicted by a federal jury in Miami for wire fraud in their dealings with SunCruz Casinos. On January 3, 2006, Abramoff said he was guilty of three criminal felonies related to the defrauding of American Indian tribes and corruption of public officials in a Washington, D.C., federal court.Forsythe, Michael and Jonathan D. Salant. \"Abramoff Pleads Guilty, Will Help in Corruption Probe.\" Bloomberg News Service. January 3, 2006. The four tribes Abramoff and his associates had been involved with included Michigan's Saginaw Chippewas, California's Agua Caliente, the Mississippi Choctaws, and the Louisiana Coushattas. It was said that Abramoff defrauded the tribes of tens of millions of dollars.Schmidt, Susan. \"A Jackpot from Indian Gaming Tribes.\" The Washington Post Online 22 Feb 2004 14 Nov 2008 The next day, he said he was guilty of two criminal felonies in a separate federal court, in Miami. These felonies involved the SunCruz deal.\"Abramoff Pleads Guilty, Will Help in Corruption Probe.\" CBS News. January 4, 2006. On September 4, 2008, a Washington court found Abramoff guilty of trading expensive gifts, meals and sports trips for political favors. He was given a four-year term in prison. This time was to be served concurrent (\"at the same time\") with his earlier sentences. Abramoff served three and a half years of a six-year sentence for conspiracy, honest services fraud, and tax evasion. He could have spent up to 11 years in prison for the mail fraud, conspiracy, and tax evasion charges because of the influence- peddling scandal in Washington. U.S. District Judge Ellen Segal Huvelle sentenced Abramoff to four years in federal prison on September 4, 2008.Schmidt, Susan and Grimaldi, James V. (2005-11-26). \"Lawmakers Under Scrutiny in Probe of Lobbyist\".WashingtonPost.com, p. A01. Retrieved 2006-08-17. Abramoff helped in a bribery investigation involving lawmakers, their aides, and members of the George W. Bush administration. ==Biography== Jack Abramoff was born in Atlantic City, New Jersey into a wealthy and well known Jewish family. His father, Franklin Abramoff, was president of the Franchises unit of Diners Club. In 1968, when Abramoff was 10, his family moved to Beverly Hills, California. Abramoff studied at Beverly Hills High School.Associated Press. \"As Congress sweats, Abramoff will tell all.\" St. Petersburg Times. January 4, 2006. Retrieved December 2, 2007. In high school he played football and was a member of the wrestling team. As an undergraduate at Brandeis University, Abramoff was Chairman of the Massachusetts Alliance of College Republicans. That group organized student volunteers for Ronald Reagan's 1980 presidential campaign. He graduated with a B.A. in English in 1981. He took six years to finish his degree. Abramoff got his Juris Doctor from the Georgetown University Law Center in 1986. After graduating from Brandeis, Abramoff ran for election as chairman of the College Republican National Committee (CRNC). His campaign cost over $10,000 and was managed by Grover Norquist. Abramoff won the election after his main competitor was persuaded to drop out. Norquist was executive director of the committee under Abramoff. He later recruited Ralph Reed, a former president of the University of Georgia College Republicans chapter, as an unpaid intern. Reed was invited to sleep on Abramoff’s couch. At the CRNC, Abramoff created political alliances with College Republican chapter presidents across the nation. Many of these people later had key roles in state and national politics and business. Some of them would later work with Abramoff as a lobbyist. Some of those relationships were a main part of the federal investigation. In 1984, Abramoff and other College Republicans formed the \"USA Foundation\". It was a non-partisan tax-exempt organization that held two days of rallies on college campuses around the United States. These rallies celebrated the first anniversary of the invasion of Grenada. In a letter to campus Republican leaders, Abramoff said: In 1985, Abramoff joined Citizens for America. It was a pro-Reagan group that helped Oliver North build support for the Nicaraguan Contras. Citizens for America had a meeting of anti-Communist rebel leaders known as the Democratic International in Jamba, Angola. This conference included leaders of the Mujahedeen from Afghanistan, UNITA from Angola, the Contras, and opposition groups from Laos. Out of this conference came the International Freedom Foundation. Abramoff helped to organize, and also went to the conference. Abramoff's membership ended badly when Citizens for America's sponsor Lewis Lehrman, a former New York gubernatorial candidate, said that Abramoff had spent his money carelessly. In 1986, Reagan made Abramoff a member of the United States Holocaust Memorial Council. Abramoff became a full-time lobbyist and used his CRNC friends to gain access to members of the Bush Administration. He represented indian tribes and on-line gambling interests. To get the gaming interest to hire him to fight against new laws to control gambling, Abramoff had his friends start efforts against gambling. Abramoff bought a restaurant in Washington, D.C. He used it to impress clients and government officials. Abramoff got press coverage and was known for wearing a fedora hat. Abramoff started a charity called the \"Capital Athletic Foundation\". In 2002, Abramoff started an Orthodox Jewish school in Maryland called \"Eshkol Academy\". ==People convicted in Abramoff probe== The lawmakers, lobbyists, Bush administration officials, congressional staffers, and businessmen in the Jack Abramoff public corruption probe were:^ Schmidt, Susan and Grimaldi, James V. (2005-11-26). \"Lawmakers Under Scrutiny in Probe of Lobbyist\". Washington Post. p. A01. https://www.washingtonpost.com/wp- dyn/content/article/2005/11/25/AR2005112501423.html. * Adam Kidan (a former Abramoff business partner), was sentenced in Florida in March 2006 to nearly six years in prison for conspiracy and fraud. * Susan B. Ralston (R) Special Assistant to the President and Senior Advisor to Karl Rove, quit October 6, 2006 after it became known that she took gifts from and gave information to her former boss Jack Abramoff. * Roger Stillwell (R) Staff in the Department of the Interior under George W. Bush. Pleaded guilty and received two years suspended sentence for not reporting hundreds of dollars worth of sports and concert tickets he got from Abramoff. * Steven Griles, (R) (former Deputy Interior Secretary) the highest-ranking Bush administration official convicted in the scandal. He pleaded guilty to obstruction of justice. He said he lied to a Senate committee about his relationship with Abramoff, who repeatedly wantedGriles' help at Interior for Indian tribal clients. * David Safavian, (R) (former White House official), the Bush administration's former top procurement official. He was sentenced to 18 months in prison in October 2006 after he was found guilty of hiding his dealings with Abramoff. found guilty of blocking justice and lying, and sentenced to 18 months * Bob Ney, then U. S. Representative, (R-Ohio), pleaded guilty September 2006, sentenced in January 2007 to 2½ years in prison, said he took bribes from Abramoff. Ney was in the traveling party on an Abramoff-sponsored golf trip to Scotland. ** Neil Volz, (R) a former chief of staff to Ney who left government to work for Abramoff, pleaded guilty in May 2006 to conspiring to corrupt Ney and others with trips and other help. ** William Heaton, (R) former chief of staff for Ney. He pleaded guilty to a federal conspiracy charge involving a golf trip to Scotland, expensive meals, and tickets to sporting events between 2002 and 2004. ** Thomas Hart (R) former chief of staff for Ney. Hart pleaded guilty to a federal conspiracy charge involving a golf trip to Scotland, expensive meals, and tickets to sporting events. * Italia Federici, (R) co-founder of the Council of Republicans for Environmental Advocacy. Federici pleaded guilty to tax evasion and obstruction of a Senate investigation into Abramoff's relationship with officials at the Department of Interior. * Mark Zachares, former aide to U. S. Representative Don Young, (R-Alaska), pleaded guilty to conspiracy. He said he took tens of thousands of dollars worth of gifts and a golf trip to Scotland from Abramoff's team for helping Abramoff. * Kevin A. Ring former staff to John Doolittle (R-CA) was convicted of five charges of corruption.www.washingtontimes.com * James Hirni, former staff to Tim Hutchinson (R-AR) was charged with wire fraud for giving a staffer for Don Young (R) of Alaska a bribe in exchange for amendments to the Federal Highway Bill. (2008) * Tom DeLay (R-TX) The House Majority Leader was reprimanded twice by the House Ethics Committee and his aides indicted (2004–2005); eventually DeLay himself was investigated in October 2005 in connection with the Abramoff scandal, but not indicted. DeLay quit 9 June 2006.Chicago Tribune, Thursday, August 26, 2010, Section 1, pg 19, \"Delay trial to be held in Austin, judge rules,\" by News Services Delay was found to have illegally channeled funds from Americans for a Republican Majority to Republican state legislator campaigns. He was convicted of two counts of money laundering and conspiracy in 2010.\"Jury convicts Tom Delay in money laundering trial\" by Juan A. Lozano, AP. November 24, 2010 ** Michael Scanlon (R) former staff to Tom DeLay: working for Abramoff, pled guilty to bribery. ** Tony Rudy (R) former staff to Tom DeLay, pleaded guilty to conspiracy. ** James W. Ellis (R) executive director of Tom DeLay's political action committee, Americans for a Republican Majority (ARMPAC), was indicted by Texas for money laundering.\"3 DeLay Workers Indicted in Texas. Aides Charged in Fundraising Probe,\" Washington Post, September 22, 2005. ** John Colyandro executive director of Tom DeLay's political action committee, Texans for a Republican Majority (TRMPAC), was indicted by Texas for money laundering * John Albaugh former chief of staff to Ernest Istook (R-OK) pled guilty to accepting bribes connected to the Federal Highway Bill.Former Istook aide pleads guilty in lobbying scandal, Daily Oklahoman June 2, 2008 * Jared Carpenter (R) Vice- president of the Council of Republicans for Environmental Advocacy, pled guilty to income tax evasion. He got 45 days in jail, plus 4 years probation. * Robert E. Coughlin (R) Deputy Chief of Staff, Criminal Division of the Justice Department pleaded guilty to conflict of interest after taking bribes from Jack Abramoff. (2008) ===Indian tribes grand jury investigations=== Abramoff and his partner Michael Scanlon (a former Tom DeLay aide) conspired to bilk Indian casinos of about $85 million. The lobbyists also created lobbying against their own clients to force them to pay for lobbying services. These actions were the subject both of criminal prosecution and hearings by the Senate Indian Affairs Committee. On November 21, 2005, Scanlon pleaded guilty to conspiring to bribe a member of Congress and other public officials. On January 3, 2006, Abramoff pleaded guilty to three felony counts (conspiracy, fraud, and tax evasion) involving his lobbying activities in Washington on behalf of Native American tribes. Abramoff and other defendants had to pay back at least $25 million that they took from clients. Abramoff also owes the Internal Revenue Service $1.7 million because of the tax evasion. In the agreement, Abramoff said he bribed public officials, including Ney. Also included: the hiring of congressional staffers and conspiring with them to lobby their former employers. This included members of Congress. Later in 2006 Abramoff lobbyists Neil Volz and Tony Rudy pleaded guilty to conspiracy charges. In September 2006, Ney pleaded guilty to conspiracy and making false statements. ===SunCruz Casinos fraud conviction=== On August 11, 2005, Abramoff and Kidan were indicted by a federal grand jury in Fort Lauderdale, Florida, on fraud charges from a 2000 deal to buy SunCruz Casinos from Konstantinos \"Gus\" Boulis. Abramoff and Kidan were said to have used a fake wire transfer to make people believe that they had made a $23 million down payment needed to qualify for a $60 million loan. Kidan received the same sentence as Abramoff--5 years, 10 months--which he began serving at Fort Dix Federal Penetentiary, in Fort Dix, New Jersey, on October 23, 2006. Ney also was implicated in helping to make the deal. After the partners bought SunCruz in September 2000, the business relationship with Boulis got bad. It ending in a fight between Kidan and Boulis in December 2000. In February 2001 Boulis was murdered in his car. The murder is currently not solved. SunCruz is now owned by Oceans Casinos Cruises. On March 29, 2006, Abramoff and Kidan were both sentenced in the SunCruz case to the minimum amount of 70 months. They also had to pay US$21.7 million in restitution. The judge, U.S. District Judge Paul C. Huck, got over 260 pleas for leniency from people. These included \"rabbis, military officers and even a professional hockey referee.\" The defendants are still helping with federal investigators and will be sentenced later in the Indian lobbying case. ===Guam grand jury investigation=== In 2002, Guam Superior Court hired Abramoff to lobby against a bill wanting to put the Superior Court under the authority of the Guam Supreme Court. On November 18, 2002, a grand jury issued a subpoena demanding that the administrator of the Guam Superior Court release all records dealing with to the contract. On November 19, 2002, U.S. Attorney Frederick A. Black, the chief prosecutor for Guam and the person who caused the indictment, was removed from the office he had held since 1991. The federal grand jury investigation was quickly ended and took no more action. In 2005 Public Auditor Doris Flores Brooks started a new investigation of the Abramoff contract. In 2006 California attorney and Marshall Islands lobbyist Howard Hills, and Tony Sanchez, a former administrator of the Guam Superior Court, were indicted for unlawful influence, conspiracy for unlawful influence, theft of property held in trust, and official misconduct. It is believed that they allowed 36 payments of $9,000 in connection with a contract between Hills and the Guam Superior Court. These payments were written out to Hills, but went to Abramoff. Hills trusted Sanchez as a court official. Hills believed that this was temporary and agreed to help with the transition for what he thought was a standard government contract between Abramoff and the court. For this Hills got nothing. Before indictments or investigations were started, Hills ended his temporary contract with Abramoff and reported what he thought was unusual behavior to public officials when he thought that something may be wrong. In 2007, indictments were issued against Hills and Sanchez. In 2008 more indictments were handed down against Abramoff and Abramoff's firm at the time, Greenberg Traurig. The charges against both attorney Howard Hills and Greenberg Traurig have since been dismissed. ==Incarceration and recent life== On November 15, 2006, Abramoff began serving his term in the minimum security prison of Federal Correctional Institution, Cumberland, Maryland, as inmate number 27593-112. The Justice Department asked that he serve his sentence there so that he would be closer to agents in Washington to help with the investigations of his associates. On June 8, 2010, Abramoff was transferred to a halfway house in Baltimore, Maryland. While there, he worked for kosher pizza firm Tov Pizza. He earned between $7.50 and $10.00 per hour. He was released from the halfway house on December 3, 2010. On December 13, 2010, it was said that Abramoff ended working at Tov Pizza. On 8 December 2011 Abramoff was on The Colbert Report. He promoted his book Capitol Punishment: The Hard Truth About Corruption From America's Most Notorious Lobbyist. ==References== Category:1958 births Category:Living people Category:American lobbyists Category:American movie producers Category:American prisoners Category:Anti- communists Category:Businesspeople from New Jersey Category:Jewish American criminals Category:Jewish businesspeople Category:People from Beverly Hills, California Category:2006 crimes Category:American activists Category:American fraudsters Category:American screenwriters Category:Businesspeople from California Category:Crime in the United States Category:Jewish American writers Category:Lawyers from Washington, D.C. Category:Political scandals in the United States",
 "title": "Jack Abramoff"
}