{
 "id": "322069",
 "text": "The Palace of Culture and Science is the second-tallest building in Poland. It is in Warsaw. It is 237 metres high. An agreement about the building was signed between the governments of the Polish People's Republic and the Soviet Union on 5 April 1952. The tower was an imposed and unwanted \"gift\" to the people of Poland. It was erected with great propagandist fanfare and named after Joseph Stalin upon its completion in 1955. Stalin's name was later removed from the colonnade, interior lobby and one of the building's sculptures. To decide on the height of the building, Soviet and Polish architects gathered in the area of the Śląsko-Dąbrowski Bridge on the east bank of the Vistula river. Over the site of the future skyscraper flew a small plane pulling a balloon behind it. The group standing near the bridge had radio contact with the pilot of the plane. First, the balloon flew at an altitude of , then higher at and . The Soviets, led by Lev Rudnev, decided that was enough for the highest point of the city. The Poles, led by the plenipotentiary for the construction of the building and chief architect of Warsaw, Józef Sigalin, began to shout \"Higher!\" after every of balloon height increase. Finally, the tower was set at a height of , with a main structure, a turret and a spire. In 2024 it is used as an exhibition centre and office complex. There is a multiplex cinema with eight screens, four theatres , the Museum of Evolution and the Museum of Technology, offices, bookshops, a large swimming pool, an auditorium hall for 3,000 people called Congress Hall, and a university, Collegium Civitas, on the 11th and 12th floors of the building. The terrace on the 30th floor, at , is a well-known tourist attraction with a panoramic view of the city. The Warsaw City Council and city offices are located in the building. == Related pages == * Parade Square ==References== Category:Buildings and structures in Warsaw",
 "title": "Palace of Culture and Science"
}