{
 "id": "322197",
 "text": "Patrick John Warburton (born November 14, 1964) is an American actor and voice artist. He has been in many movies such as the Emperor's New Groove series, the Space Chimps movies, the Open Season franchise and the Buzz on Maggie series. He was on Family Guy. He played Jeff Bingham in Rules of Engagement. ==Filmography== ===Film=== Year Title Role Notes 1987 Dragonard Richard Abdee 1991 Scorchers Balford 1994 Dickwad Charlie's Brother Short film 1995 Toy Story Aliens Voice 1996 American Strays Rookie Cop 1999 The Woman Chaser Richard Hudson 2000 Scream 3 Steven Stone 2000 Buzz Lightyear of Star Command: The Adventure Begins Little Green Men Voice Direct-to-video 2000 The Dish Al Burnett 2000 The Emperor's New Groove Kronk Voice 2001 Camouflage Horace Tutt, Jr. 2001 Dirt Vincent 2001 Joe Somebody Mark McKinney 2001 Jimmy Neutron: Boy Genius Arena Yolkian #1 Voice 2002 Run Ronnie Run Head of Gay Conspiracy 2002 Big Trouble Officer Walter Kramitz 2002 Men in Black II Agent T 2004 Bob Steel Rudy Buckmaster 2004 Home on the Range Patrick Voice 2005 The Civilization of Maxwell Bright Max Bright 2005 Rebound Larry Burgess 2005 Chicken Little Alien Cop Voice 2005 Sky High Royal Pain Voice 2005 Stewie Griffin: The Untold Story Joe Swanson Direct-to-video 2005 Kronk's New Groove Kronk Direct-to-video 2006 Hoodwinked! The Wolf Voice 2006 The Wild Blag Voice 2006 Open Season Ian Voice 2007 I'll Believe You Dr. Seth Douglass 2007 Underdog Cad 2007 Bee Movie Ken Voice 2007 Happily N'Ever After Prince Charming Voice 2008 Get Smart Hymie 2008 Get Smart's Bruce and Lloyd: Out of Control Hymie Direct-to-video 2008 Space Chimps Titan Voice 2009 Made for Each Other Mack Mackenzie 2009 Rock Slyde Rock Slyde 2009 The Action Hero's Guide to Saving Lives Ace Mulligan 2010 Flicka 2 Hank Direct-to-DVD 2010 Space Chimps 2: Zartog Strikes Back Titan Direct-to-DVD 2010 Sophomore Mr. McKee 2011 Hoodwinked Too! Hood vs. Evil The Wolf Voice 2011 The Little Engine That Could Caboose Voice 2012 Ted Guy 2013 Movie 43 Steve 2013 Bad Milo Phil 2014 Mr. Peabody & Sherman King Agamemnon Voice 2014 Playing It Cool Dick 2014 Planes: Fire & Rescue Pulaski Voice 2014 School Dance Prairie Puff Man 2014 The Extendables 2015 Hoovey Jeff Elliot 2015 Divine Access Bob 2015 Larry Gaye: Renegade Male Flight Attendant Captain Bryce 2015 Ted 2 Guy 2015 Lost in Austin Post-production 2016 Animal Crackers Brock Voice Filming 2016 Sweetwater Joe Lapchick Pre-production ===Television=== Year Title Role Notes 1986 The Paper Chase Pool Boy Episode: \"Honor\" 1990 Quantum Leap Blaster Episode: \"The Leap Home: Part 2 (Vietnam) – April 7, 1970\" 1991 Anything But Love Episode: \"The Torrid Zone\" 1992 Grapevine Billy Episode: \"The Lisa and Billy Story\" 1992 Northern Exposure Glenn Episode: \"Northwest Passages\" 1992 Murphy Brown Bo Episode: \"A Year to Remember\" 1993 Mad About You Sam Episode: \"Love Among the Tiles\" 1993 Nurses Chuck Episode: \"What Are Friends For?\" 1993 Designing Women Craig 3 episodes 1993 Love & War Duane Episode: \"It Don't Mean a Thing If It Ain't Got That Swing\" 1995 Grace Under Fire Meter Man Episode: \"A Night at the Opera\" 1995 Ellen Jack 3 episodes 1995–1997 Dave's World Eric 34 episodes 1995–1998 Seinfeld David Puddy 10 episodes 1998 House Rules Dan Episode: \"Sex and Violence\" 1998 Maggie Winters Sonny Series 1998 Hercules: The Animated Series Agamemnon 1 episode 1998–1999 NewsRadio Johnny Johnson 5 episodes 1999 Hercules: The Animated Series Lastrigon 1 episode 1999 The Apartment Complex Morgan TV Movie 1999–2003, 2005–present Family Guy Joe Swanson Voice 2000 Angels in the Infield Eddie \"Steady\" Everett TV Movie 2000 Teacher's Pet Security Guard Voice 2000–2001 Buzz Lightyear of Star Command Buzz Lightyear Little Green Men Voice 62 episodes 2001–2002 The Tick The Tick 9 episodes 2002 Malcolm in the Middle Burt Landon Episode: \"Company Picnic: Part 1\" 2002 The Twilight Zone Azoth the Avenger Episode: \"Azoth the Avenger is a Friend of Mine\" 2002–2003 8 Simple Rules Nick Sharpe 3 episodes 2002–2007 Kim Possible Steve / Franklin Barkin Voice 35 episodes 2003 Happy Family Bill Harris Episode: \"Bill's Back\" 2003–2006 Less than Perfect Jeb Denton 49 episodes 2003–present The Venture Bros. Brock Samson Voice 54 episodes 2004 Game Over Ripley \"Rip\" Smashenburn Series 2005–2006 The Batman Cash Tankenson 2 episodes 2005–2006 The X's Mr. X Voice 20 episodes 2006–2008 The Emperor's New School Kronk Voice 52 episodes 2007 Biker Mice from Mars A-Bomb Voice Episode: \"Here Comes the Judge\" 2007 Robot Chicken Big Jim / The Riddler / Seuss Dad Voice Episode: \"Endless Breadsticks\" 2007–2008 Tak and the Power of Juju Lok Voice 15 episodes 2007–2013 Rules of Engagement Jeff Bingham 100 episodes 2009 The Fairly Odd Parents Agent #1 / #2 2 episodes 2009–2010 The Cleveland Show Joe Swanson 2 episodes 2010–2013 Scooby-Doo! Mystery Incorporated Sheriff Bronson Stone Voice 34 episodes – closing credits 2011 Archer Rip Riley Voice 3 episodes 2012 The High Fructose Adventures of Annoying Orange Big Mike Watermelon Voice Episode: \"Generic Holiday Special\" 2012 The Penguins of Madagascar Elmer Episode: \"Street Smarts/Nighty Night Ninja\" 2013–2014 Bolts and Blip Tigrr Jaxxon Voice 2014 The Soup Actor Episode: \"Clips of Love and Passion\" 2014 Sequestered Governor Bennett, Governor Warburton 2015 Transformers: Robots in Disguise 2015 Randy Cunningham: 9th Grade Ninja Ninja of '05 Episode: When Howie Met Randy 2015 Crowded Mike Gunn Main cast 2017-2019 A Series of Unfortunate Events Lemony Snicket Main cast 2020 Baby Shark's Big Show! Grandpa Shark ===Video games=== Year Title Role 2000 Spider-Man Hostage on \"What If?\" Mode 2001 The Emperor's New Groove: The Game Kronk 2003 Metal Arms: Glitch in the System Mozer 2003 Tak and the Power of Juju Lok 2004 Tak 2: The Staff of Dreams Lok 2005 Tak: The Great Juju Challenge Lok 2006 Family Guy Video Game! Joe Swanson 2006 Open Season Ian 2007 Call of Duty 4: Modern Warfare Additional Voices 2009 Leisure Suit Larry: Box Office Bust Damone 2010 Call of Duty: Black Ops S.O.G. Operative 2011 Skylanders: Spyro's Adventure Flynn the Ballooner 2012 Skylanders: Giants Flynn the Ballooner 2012 Family Guy: Back to the Multiverse Joe Swanson 2013 Poker Night 2 Brock Samson 2013 Skylanders: Swap Force Flynn the Ballooner 2014 Family Guy: The Quest for Stuff Joe Swanson 2014–2015 Tales from the Borderlands Hugo Vasquez 2014 Skylanders: Trap Team Flynn the Ballooner 2015 Nords: Heroes of the North King Björn Skylanders: SuperChargers Flynn ===Web=== Year Title Role 2013–present Yomama Brody (edit) Brock Baker from the YouTube Channel \"McGoiter\" voices Brody using Warburton's voice. 2014 How To Tell if You're a Basic Bitch Philip A. Oliva, M.D ==References== Category:1964 births Category:Living people Category:Actors from New Jersey Category:American movie actors Category:American stand-up comedians Category:American television actors Category:American voice actors Category:People from Paterson, New Jersey Category:Comedians from New Jersey",
 "title": "Patrick Warburton"
}