{
 "id": "322196",
 "text": "Cody Cameron (born October 12, 1970) is an American voice actor, writer, animator, director, artist, and screenwriter. He is the voice of many characters; this includes Pinocchio and the Three Little Pigs in the Shrek series and Mr. Weenie in the Open Season series. ==Career== Cameron first started his career at DreamWorks Animation and wrote dialogue and storyboarding for the Shrek movies, Shark Tale, and the 2005 Madagascar movie. In 2004, he decided to leave DreamWorks to join a brand new job at Sony Pictures Animation, where he worked as an actor in the Open Season series as Mr. Weenie, directed Open Season 3 and The ChubbChubbs Save Xmas (in which he also co-wrote), and worked as a story artist on Surf's Up and the Cloudy with a Chance of Meatballs movies. ==Filmography== Year Title Role Notes 2000 Chicken Run Additional story 2001 Shrek Pinocchio Three Little Pigs Story artist Additional dialogue Shrek in the Swamp Karaoke Dance Party Pinocchio Three Little Pigs Morto the Magician Special thanks 2003 Shrek 4D Pinocchio Three Little Pigs Sinbad: Legend of the Seven Seas Additional Storyboard artist 2004 Shrek 2 Pinocchio Three Little Pigs Additional dialogue Far Far Away Idol Pinocchio Three Little Pigs 2005 Madagascar Willie Additional story artist 2006 Open Season Mr. Weenie Boog and Elliot's Midnight Bun Run Mr. Weenie 2007 Surf's Up Story artist Shrek the Third Pinocchio Three Little Pigs Ogre Baby Additional dialogue Story artist The ChubbChubbs Save Xmas Elf Aliens Writer 2008 Open Season 2 Mr. Weenie 2009 Cloudy with a Chance of Meatballs Additional voices 2010 Shrek Forever After Pinocchio Three Little Pigs Open Season 3 Mr. Weenie Nate Distinctive Dog Director Scared Shrekless Pinocchio Three Little Pigs Donkey's Christmas Shrektacular Pinocchio Three Little Pigs 2011 Thriller Night Pinocchio Three Little Pigs The Pig Who Cried Werewolf Horst 2013 Cloudy with a Chance of Meatballs 2 Barry the Strawberry Dill Pickles Director 2018 Spider-Man: Into the Spider-Verse Story artist 2022 Puss in Boots: The Last Wish Pinocchio Additional story artist ==Television== Year Title Role Notes 2007 Shrek the Halls Pinocchio Three Little Pigs Made for television Voice 2010 Scared Shrekless Pinocchio Three Little Pigs Made for television Voice Donkey's Christmas Shrektacular Pinocchio Three Little Pigs Made for television Voice ==References== ==Other websites== * Category:1970 births Category:Living people Category:American voice actors Category:American movie actors Category:American television actors Category:American movie directors",
 "title": "Cody Cameron"
}