{
 "id": "322106",
 "text": "Joel Edward McHale (born November 20, 1971) is an Italian-American stand-up comedian, actor, producer, writer, voice artist, and comedian. He is best known as the host of Talk Soup and as Jeff Winger in Community. He has acted in movies including Spy Kids 4: All the Time in the World as Wilbur Wilson, Open Season 2 as the voice of Elliot (taking Ashton Kutcher's place), and Ted as Rex. ==Early life== McHale, the middle of the three brothers, was born Joel Edward McHale in Rome, Italy on November 20, 1971. His mother, Laurie, is from Vancouver, British Columbia, and his father, Jack, is from Chicago. McHale and his brothers were born in Rome, where their father worked for an American university. He grew up in the Seattle area, graduating from Mercer Island High School in 1991. Also he participated at Youth Theatre Northwest. He received a bachelor's degree in History from the University of Washington in 1995. While at the University of Washington, McHale brieflyDan Curran (October 8, 2008). OnMilwaukee. Accessed 2011-12-26. belonged to the Theta Chi Fraternity. He was recruited to be on the rowing team, but later walked onto the football team, playing tight end for two years.Dan Steinberg (February 14, 2005). THECHAT Washington Post. Accessed 2009-03-01.Joel McHale (September 29, 2009). \"Grantland\". Accessed 2011-09-30 McHale received a Master of Fine Arts degree from the Professional Actors Training Program at the University of Washington. ==Career== ===Stand-up comedy=== McHale was part of the Almost Live! cast, a local sketch-comedy TV show produced by Seattle's KING-TV (Channel 5). From 1993 until 1997, McHale was a member of the improv comedy group at Unexpected Productions, participating in Theatersports! at the Market Theater located in Pike Place Fish Market in downtown Seattle. ===Acting=== After earning his master's degree in acting, McHale moved to Los Angeles and landed small roles in Oliver Beene, CSI: Miami, and Will & Grace. He played a TV reporter in the biopic Lords of Dogtown. He guest-starred as a cast member on the NBC improv comedy show Thank God You're Here during the pilot episode and had a guest role on an episode of Pushing Daisies. McHale also appeared in Spider-Man 2 in a small role as Mr. Jacks, a bank manager. In 2004, McHale began hosting The Soup, a satirical weekly television show on the \"E!\" television network. Throughout the show, he takes the audience through the oddities and ridiculous happenings of the week in television. He frequently appears as a co-host on Loveline. He has also had a long association with Circle X Theatre, where he has done several plays. McHale was a weekly guest on The Adam Carolla Show and Mickey and Amelia, and occasional guest on the Opie and Anthony Show. He has been a judge on Iron Chef America. He was involved in the American version of the British TV show The IT Crowd. McHale made a guest appearance on the finale of Last Comic Standing sixth season, when he recapped the show's events in his typical format of jokes made popular on The Soup. He usually appeared in Countdown with Keith Olbermann in a humor sequence closing the show. McHale played FBI Agent Robert Herndon in The Informant! (2009), alongside Matt Damon. He starred in Community, which premiered in fall 2009 and ended in 2015. He also hosted The Soup from 2004 to 2025. ===Voice acting=== McHale voiced the mule Elliot in Open Season 2 (the direct-to-video sequel to Open Season) since Ashton Kutcher didn't come back; but in Open Season 3, McHale didn't return himself and got replaced by Matthew W. Taylor, who was replaced by Will Townsend in Open Season: Scared Silly. ==Personal life== McHale married Sarah Williams in 1996. They have two sons: Edward Roy, \"Eddie\" (born 2005) and Isaac Hayden (born 2008). McHale and Williams live in the Hollywood Hills. ==Filmography== Film Film Film Film Year Title Role Notes 2004 Spider- Man 2 Mr. Jacks 2005 Lords of Dogtown TV Reporter 2005 Game Time Johnson 2006 Mini's First Time Host 2008 The Onion Movie Office Worker Uncredited 2008 Open Season 2 Elliot Direct-to-video Voice only Replacing Ashton Kutcher 2009 The Informant! FBI Agent Robert Herndon 2011 What's Your Number? Paul Tyler 2011 Spy Kids 4: All the Time in the World Wilbur 2011 The Big Year Skeeter Yablans 2012 Ted Rex Filming ==Television work== Television Television Television Television Year Title Role Notes 1993–1997 Almost Live! 1998 Bill Nye the Science Guy 2001 Will & Grace Ian 2004–present The Soup Himself – Host 2005 The Huntress 2006 The Fugitive 2006 Diagnosis: Murder 2007 The IT Crowd Roy Failed Pilot 2008 Robot Chicken Various Voice only 2008 CSI: Miami Greg Welch 2009 Pushing Daisies Harold Hundin 2009–2015 Community Jeff Winger 2010 Giants of Radio 2011 Phineas and Ferb Additional Voices ==References== == Other websites == * Official website * * * E! Online Biography Category:1971 births Category:Living people Category:American movie actors Category:American television actors Category:Comedians from Seattle Category:Actors from Seattle Category:American voice actors",
 "title": "Joel McHale"
}