{
 "id": "322153",
 "text": "Hyundai Motor Company (Hangul : 현대 자동차 주식회사; Hanj : 現代自動車株式會社; , Hyŏndae, ) is a Korean car company. It is based in Seoul, South Korea. Along with Kia, it makes up the Hyundai Kia Automotive Group. The group is the world's fourth- largest maker of cars as of 2009. As of 2011, it is the world's fastest growing automaker for two years in a row. In 2008, Hyundai (without Kia) ranked as the eighth-largest automaker. In 2010, Hyundai sold over 3.6 million vehicles worldwide. In 2015 Hyundai announced it would spin off its Genesis car as a separate luxury brand, that will compete with other luxury brands like Buick, Lexus, Acura etc. == Passenger vehicles == === Current models === Model Current model Vehicle description Global sales (2022, by units) Image Name(s) Introduction ( year) Model code Introduction Main markets Hatchback HB20 2012 BR2 2019 Brazil and Mexico B-segment hatchback built for the Brazilian market. Crossover version available as the HB20X. 135,995 (incl. sedan) i10 2007 AC3/AI3 2019 Europe, India, and others A-segment hatchback mainly oriented for Europe (short wheelbase) and India (Grand i10, long wheelbase). 214,386 i20 2008 BC3/BI3 2020 Europe, India, and others B-segment hatchback mainly oriented for Europe and India. 170,440 i30 2007 PD 2016 Europe, Australia, and others C-segment hatchback mainly oriented for the European market. 76,758 (incl. estate) Sedan/liftback Accent/ Verna 1994 BN7 2023 Global (except Europe, Australasia and North America) B-segment/subcompact sedan. Known as the Solaris in CIS countries and Verna in India and China. 127,384 (incl. hatchback) Aura / Grand i10 Sedan 2020 AI3 2020 India, Middle East and South America A-segment, sub 4-metre sedan mainly built for the Indian market. Successor of the Xcent. Also called the Grand i10 sedan outside India. 67,184 Elantra / Avante / i30 Sedan 1990 CN7 2020 Global (except Western Europe and India) C-segment/compact sedan. Known as the Avante in South Korea and i30 Sedan in Australia. 370,973 Grandeur/ Azera 1986 GN7 2022 South Korea and Middle East Executive sedan oriented for the domestic South Korean market. 71,858 HB20S 2012 BR2 2019 Brazil and Mexico Sedan version of the HB20. 135,995 (incl. hatchback) Ioniq 6 2022 CE 2022 Global Electric D-segment/mid-size under the Ioniq sub-brand. 14,821 Sonata 1985 DN8 2019 Global (except Europe) D-segment/mid-size sedan. 136,088 Station wagon i30 2007 PD 2016 Europe Station wagon version of the i30. 76,758 (incl. hatchback) SUV/crossover Alcazar / Grand Creta 2021 SU2 LWB 2021 India and other emerging markets Three-row compact crossover SUV oriented for the Indian market based on Hyundai Creta. 38,433 Bayon 2021 BC3 CUV 2021 Europe Subcompact crossover SUV (B-segment) smaller than Kona based on the i20 for the European market. 45,811 Casper 2021 AX1 2021 South Korea Crossover city car oriented for the South Korean light car segment. 48,002 Casper Electric / Inster AX1 EV 2024 South Korea, Asia, Europe, Australasia Battery electric crossover based on the Casper, with longer body. Creta/ Cantus 2014 SU2 2019 Global, emerging market oriented Subcompact crossover SUV (B-segment) larger than Kona oriented for emerging markets. Known as the Cantus in Dominican Republic. 303,077 Creta Electric SU2 EV 2025 India Battery electric crossover based on the Creta. Exter 2023 AI3 CUV 2023 India Crossover based on the Grand i10 for the Indian market. - Ioniq 5 2021 NE 2021 Global Electric compact crossover SUV under the Ioniq sub-brand. 99,727 Ioniq 9 2025 ME 2025 Global Electric mid-size crossover SUV under the Ioniq sub-brand. - Kona/ Kauai 2017 SX2 2023 Global, developed market-oriented Subcompact crossover SUV (B-segment) oriented for developed markets. 232,605 Kona Electric/ Kauai EV 2018 SX2 EV Battery electric crossover based on the Kona. 52,368 Mufasa 2023 NU2 2023 China Two-row compact crossover SUV for the Chinese market. Successor to the ix35. - Nexo 2018 NH2 2025 South Korea, North America and Europe Fuel cell compact crossover SUV. 10,527 Palisade 2018 LX3 2025 South Korea, North America, Middle East and Australasia Three-row mid-size crossover SUV for the selected markets. 151,427 Santa Fe 2000 MX5 2023 Global Two or three-row mid-size crossover SUV that slots between Tucson and Palisade. 214,744 Tucson 2004 NX4 2020 Global Two-row compact crossover SUV. Best-selling Hyundai model in 2021. 560,862 Venue 2019 QX 2019 Global (except Europe and China) Subcompact crossover SUV (B-segment) smaller than Kona. 188,701 Pickup truck Santa Cruz 2021 NX4a OB 2021 U.S. and Canada Compact pickup based on the Tucson. 42,390 MPV/van Custo/ Custin 2021 KU 2021 China, Taiwan and Vietnam Minivan for the Chinese and Taiwanese market with three-row seating. 13,678 Staria 2021 US4 2021 South Korea, Australasia and others Front-wheel drive minivan. Available with one- row, three-row and four-row seating. N/A Stargazer 2022 KS 2022 Southeast Asia and Middle East Compact MPV with three-row seating. 18,384 === Former models === Model Timeline Successor Introduced Discontinued 20M 1969 1973 Aslan 2014 2017 Atos/Santro 1997 2014 i10 Eon Celesta 2017 2023 Cortina 1970 1975 Dynasty 1996 2005 Aslan Entourage 2007 2009 Eon 2011 2019 Santro (AH2) Equus/Centennial 1999 2016 Genesis G90 Excel/Presto 1985 2000 Accent Encino 2018 2020 Genesis 2007 2016 Genesis G80 Genesis Coupe 2008 2016 Granada 1978 1985 Grandeur Galloper 1991 2004 Terracan Grace/H100/Satellite 1987 1996 Starex Getz/Click 2002 2011 i20 Accent hatchback Ioniq 2016 2022 Elantra Hybrid i20 Active 2015 2020 Bayon i40 2011 2019 Sonata ix20 2010 2019 ix25 2014 2021 ix35 (NU) 2017 2023 Mufasa ix35 FCEV 2013 2018 Nexo Lavita/Matrix 2001 2010 ix20 Libero/H-1 2000 2007 Porter Marcia 1995 1998 Sonata Maxcruz/Santa Fe XL 2013 2019 Palisade Mistra 2013 2023 Pony 1975 1990 Excel Elantra Reina/Verna 2017 2021 Santamo 1996 2003 Santro (AH2) 2018 2022 Scoupe 1988 1995 Tiburon Starex 1997 2021 Staria Stellar 1983 1992 Sonata Elantra Terracan 2001 2011 Veracruz Tiburon/Coupe/Tuscani 1996 2008 Veloster Trajet 1999 2008 Custo Veloster 2011 2022 Veracruz/ix55 2006 2012 Maxcruz Xcent 2014 2020 Aura == Commercial vehicles == === Current models === Model Current model Main markets Vehicle description Image Name(s) Introduction ( year) Introduction Van H350/Solati 2014 2014 Asia, Europe and others Large van. Staria 2021 2021 Asia, Europe, Australasia and others Front-wheel drive van. Available with one-row, three-row and four-row seating. Light pickup truck Porter/H-100 1977 2004 Asia A small commercial truck. EV version comes standard (Korea only). ST1 2024 2024 South Korea and Europe (initially as the Iveco eMoove) Heavy truck Mighty 1977 2015 Pavise 2019 2019 Xcient 2013 2013 Buses Aero City 1991 2017 County 1998 1998 Green City 2010 2017 Elec City 2017 2017 Electric, Hydrogen Bus made by Hyundai. Also Double-Decker version are available. Universe 2006 2006 === Former models === Model Timeline Successor Introduced Discontinued 4.5 to 5-ton truck 1994 1997 Super Truck Medium 8ton~25tonTruck 1977 2010 Super Truck Aero 1985 2006 Universe Aero Town 1994 December 1994 Green City Aero Space 1985 2006 Chorus 1988 1998 County DQ-7 1973 1981 Chorus Aero Town FB 1979 1988 Mega Truck 2004 2021 Pavise New Power Truck 2004 2021 Xcient Trago Pavise RB 1978 1991 Aero City Aero Super Truck 1997 2004 New Power Truck Starex 1997 2023 Staria Super Truck Medium 1999 2004 Mega Truck Trago 1997 2013 Xcient ==References== ==Other websites== * Category:1960s establishments in South Korea Category:1967 establishments in Asia Category:Automobile companies Category:Manufacturing companies of South Korea",
 "title": "Hyundai Motor Company"
}