{
 "id": "322137",
 "text": "Crispin Hellion Glover (born April 20, 1964) is an American actor. He has acted in such movies as Back to the Future, Epic Movie (where he did a parody of the Willy Wonka played by Johnny Depp) and the Open Season series as Fifi. In the late 1980s, Glover started his company, Volcanic Eruptions. The company publishes his books and also is the production company for his movies, What Is It? and It is Fine. Everything is Fine!. Glover has written between 15 and 20 books. He makes the books by reusing old novels and other publications which are in the public domain due to their age. He rearranges text, blacks out certain standing passages, and adds his own prose and sometimes images. His father is actor Bruce Glover. His mother was Betty Glover who died in 2016. ==Filmography== Year Movie Character Notes/Awards 1981 Best of Times Crispin 1982 The Facts of Life Cadet #1 1983 The Kid with the 200 I.Q. My Tutor Jack High School U.S.A. Archie Feld Happy Days Roach Hill Street Blues Space Cadet 1984 Family Ties Doug Racing with the Moon Gatsby Boy Friday the 13th: The Final Chapter Jimmy Teachers Danny 1985 The Orkly Kid Larry Back to the Future George McFly Nominated - Saturn Award for Best Supporting Actor 1986 At Close Range Lucas River's Edge Layne 1989 Twister Howdy 1990 Where the Heart Is Lionel Wild at Heart Dell 1991 Rubin and Ed Rubin Farr Little Noises Joey Ferdydurke Mientus The Doors Andy Warhol 1993 Hotel Room Danny Even Cowgirls Get the Blues Howard Barth What's Eating Gilbert Grape Bobby McBurney 1994 Chasers Howard Finster 1995 Dead Man Train Fireman 1996 The People vs. Larry Flynt Arlo 2000 Nurse Betty Roy Ostery Charlie's Angels The Thin Man 2001 Bartleby Bartleby Fast Sofa Jules Langdon 2002 Crime and Punishment Raskolnikov Like Mike Stan Bittleman 2003 Willard Willard Stiles Chainsaw Award for Best Actor Nominated - Saturn Award for Best Actor Charlie's Angels: Full Throttle The Thin Man 2004 Incident at Loch Ness Party Guest 2005 What Is It? Dueling Demi- God Auteur / The young man's inner psyche Jury Award for Best Narrative Film Drop Dead Sexy Eddie 2006 Simon Says Simon / Stanley 2007 Epic Movie Willy The Wizard of Gore Montag the Magnificent It is Fine. Everything is Fine! (director) Beowulf Grendel'' 2008 Open Season 2 Fifi (voice only) Freezer Burn:The Invasion of Laxdale Viergacht 2009 The Donner Party William Foster 9 6 (voice only) 2010 Alice in Wonderland The Knave of Hearts Hot Tub Time Machine Phil Open Season 3 Fifi (voice only) ==References== ==Other websites== * Category:1964 births Category:Living people Category:American movie actors Category:American television actors Category:Comedians from New York City Category:Actors from New York City",
 "title": "Crispin Glover"
}