{
 "id": "322319",
 "text": "is an old province of Japan in the area of Tochigi Prefecture on the island of Honshū. Nussbaum, Louis-Frédéric. (2005). \"Shimotsuke\" in Japan Encyclopedia, p. 862. It was sometimes called or . The ancient capital city of the province was near Tochigi. Tokugawa Ieyasu's tomb and shrine is at Nikkō, in Shimotsuke.Titsingh, Isaac. (1834). Annales des empereurs du japon, p. 410. ==History== In the Nara period, Shimotsuke was part of Keno Province. This was changed in the reforms of the Taihō Code in 701.Tsunoda, Ryūsaku. (1951). Japan in the Chinese Dynastic Histories: Later Han through Ming dynasties, p. 18 n25. Parts of Shimotsuke were held by a several daimyo during the Sengoku period. ===Timeline=== * 1150 (Kyūan 6, 12th month): Minamoto-no Yoshikane, the head of the Ashikaga clan, was established in Shimotsuke Province.Titsingh, p. 187. * 1627 (Kan'ei 4): Inaba Masanari took control of Mōka Domain in Shimotsuke.Papinot, Edmund. (2003). \"Inaba\", Nobiliare du Japon, p. 15; Papinot, Jacques. (1906). Dictionnaire d’histoire et de géographie du Japon. * 1672 (Kanbun 12): Itakura Shigenori was given the fief of Kasuyama Domain in Shimotsuke.Papinot, \"Itakura\", pp. 16-17. * 1725 (Kyōhō 10): A cadet branch of the Ōkubo clan was established in Karasuyama Domain in Shimotsuke, where they stayed until the Meiji Restoration.Papinot, \"Ōkubo\", p. 46. In the Meiji period, the provinces of Japan were converted into prefectures. Maps of Japan and Shimotsuke Province were reformed in the 1870s.Nussbaum, \"Provinces and prefectures\" at p. 780. ==Shrines and Temples== Futarasan jinja was the chief Shinto shrine (ichinomiya) of Shimotsuke. \"Nationwide List of Ichinomiya,\" p. 2 ; retrieved 2012-1-17. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan ==References== ==Other websites == * Murdoch's map of provinces, 1903 Category:Former provinces of Japan Category:Tochigi Prefecture",
 "title": "Shimotsuke Province"
}