{
 "id": "322402",
 "text": "Charlotte Church (born Charlotte Maria Reed, 21 February 1986) is a Welsh singer-songwriter, actress and television presenter. She changed her surname when she was adopted by her stepfather. She sings classical music and pop music. She hosted a Channel 4 chat show titled The Charlotte Church Show. She has two children by rugby player Gavin Henson. By 2007, she had sold more than ten million records worldwide including over five million in the United States. In 2010 she was reported to be worth as much as £11m (though one 2003 report quoted her worth at £25m). Church released her first album in five years, titled Back to Scratch, on 17 October 2010. Church has a mezzo-soprano vocal range. ==Political activities== She has became increasingly outspoken on a number of political issues. In May 2015 she joined a demonstration organised by the People's Assembly Against Austerity in Cardiff. At the 2015 Glastonbury Festival she chaired a conversation with two members of Russian feminist punk band Pussy Riot. In September 2015, she supported Jeremy Corbyn's campaign in the Labour Party leadership election, In 2016, Church along with many other celebrities, toured the UK to support Corbyn's bid to become Prime Minister, and in March 2016, performed at a socialist fundraising event in Edinburgh for Corbyn. But by December 2016, she was calling for him to be replaced by a “fresh face” who was more electable. In May 2016, she declared her support for the Welsh nationalist party, Plaid Cymru in the National Assembly for Wales election. In January 2017, she took part in a protest in Cardiff about Donald Trump's inauguration as US president. In February 2024, she was recorded singing for Palestine in response to the attacks of Israel on Gaza after the 7 October attacks of Hamas on Israel. Church is a supporter of Welsh independence. ==Discography== ;Studio albums * Voice of an Angel (1998) * Charlotte Church (1999) * Dream a Dream (2000) * Enchantment (2001) ==References== ==Other websites== * * Official website Category:1986 births Category:Living people Category:British adoptees Category:British television talk show hosts Category:British classical musicians Category:Musicians from Cardiff Category:Welsh movie actors Category:Welsh pop singers Category:Welsh singer-songwriters Category:Welsh television actors",
 "title": "Charlotte Church"
}