{
 "id": "322489",
 "text": "Cognitive dissonance is a concept in social psychology. People who hold conflicting (very different) ideas, beliefs or values at the same time often feel cognitive dissonance. In this state, people may feel surprise, dread, guilt, anger, or embarrassment. Reacting to this bad feeling, people have a motivational drive (want) to reduce dissonance. Leon Festinger's theory of cognitive dissonance was developed to predict and explain how people react to this situation., paperback Cognitive dissonance theory says that people have a bias to search consonance between their expectations and reality. According to Festinger, people do something he called \"dissonance reduction\". This can happen in one of three ways: #lowering the importance of one of the discordant factors, #adding consonant elements, or #changing one of the dissonant factors. This bias sheds light on otherwise puzzling, irrational, and even destructive behavior. People in dissonance may change their feelings, thoughts or memories so they are less in conflict. However, often they do not, and instead set out to manipulate the social scene around them so that their embarrassment is less. For example, they may try to explain away the dissonance with a wider theory or they may intensify their efforts at persuasion and publicity so that others join them in their beliefs. == Case study == Festinger's book When Prophecy Fails is the story of how a cult leader reacted when her prophecy of doom failed. Reissued 2008 by Pinter & Martin with a foreword by Elliot Aronson, Festinger and his associates read an interesting item in their local newspaper: \"Prophecy from planet Clarion call to city: flee that flood\". The prophecy came from Dorothy Martin (1900–1992), a Chicago housewife who experimented with automatic writing. She had previously been involved with L. Ron Hubbard's Dianetics movement, and her cult incorporated ideas from what was to become Scientology.Bainbridge, William Sims & Rodney Stark 1979. Cult formation: three compatible models. Sociological Analysis. 40 (4): 90. JSTOR The group of believers had taken steps which showed their commitment to the belief. They had left jobs, college, and spouses, and had given away money and possessions. They prepared for their departure on a flying saucer, which was to rescue the group of true believers. She claimed to have received a message from a fictional planet named Clarion. These messages revealed that the world would end in a great flood before dawn on December 21, 1954. After the failure of the prediction, Dorothy Martin left Chicago after being threatened with arrest and involuntary commitment. She later founded the Association of Sananda and Sanat Kumara. Under the name 'Sister Thedra', she continued to practice channeling and to participate in contactee groups until her death in 1992.These are activities done by mediums in spiritualism. The Association is active to this day. === Sequence of events === Festinger and his colleagues infiltrated Martin's group and reported the following sequence of events: *Before December 20. The group shuns publicity. Interviews are given only grudgingly. Access to her house is only for those who can convince the group that they are true believers. The group evolves a belief system—provided by the automatic writing from the planet Clarion—to explain the details of the cataclysm, the reason for its occurrence, and the manner in which the group would be saved from the disaster. *December 20. The group expects a visitor from outer space to call upon them at midnight and to escort them to a waiting spacecraft. As instructed, the group goes to great lengths to remove all metallic items from their persons. As midnight approaches, zippers, bra straps, and other objects are discarded. The group waits. *12:05 A.M., December 21. No visitor. Someone in the group notices that another clock in the room shows 11:55. The group agrees that it is not yet midnight. *12:10 A.M. The second clock strikes midnight. Still no visitor. The group sits in stunned silence. The cataclysm itself is no more than seven hours away. *4:00 A.M. The group has been sitting in stunned silence. A few attempts at finding explanations have failed. One member begins to cry. *4:45 A.M. Another message by automatic writing is sent to Martin. It states, in effect, that the God of Earth has decided to spare the planet from destruction. The cataclysm has been called off: \"The little group, sitting all night long, had spread so much light that God had saved the world from destruction\". *Afternoon, December 21. Newspapers are called; interviews are sought. In a reversal of its previous distaste for publicity, the group begins an urgent campaign to spread its message to as broad an audience as possible. The experiences supported the idea that the group did have a bias to seek consonance between their expectations and reality. In fact, events had proved conclusively the falsehood of their ideas, but the group rearranged their explanations to give themselves the least psychological pain. == References == dissonance",
 "title": "Cognitive dissonance"
}