{
 "id": "322894",
 "text": "No Motherland Without You is a North Korean song. It is the signature song of Kim Jong-il. The song tells of the talent and virtues of Jong-il, and the attachment of the Korean people for him. The song's chorus is \"We cannot exist without you, Comrade Kim Jong-il! The motherland cannot exist without you!\" It is also thought to be the anthem of Songun politics because Jong-il started the Songun (military-first) policy of North Korean politics in 1995. It is often broadcast on the radio and from loudspeakers on the streets of Pyongyang. ==Lyrics== The civil lyrics use the phrase 김정일동지 (Comrade Kim Jong- il) to refer to the son of Kim Il-sung. The military version of the song refers to the North Korean leader as 김정일장군 (transl. Gim Jeong-il jang-gun; eng. General Kim Jong-il) because he was the Supreme Commander of the Korean People's Army since 1991. The lyrics used by the Korean Workers' Party are as follows: Chosŏn'gŭl Chosŏn'gŭl with Hancha McCune-Reischauer Revised Romanization English translation 사나운 폭풍도 쳐몰아내고 신념을 안겨준 김정일동지 당신이 없으면 우리도 없고, 당신이 없으면 조국도 없다! 미래도 희망도 다 맡아주는 민족의 운명인 김정일동지 당신이 없으면 우리도 없고, 당신이 없으면 조국도 없다! 세상이 열백번 변한다해도 인민은 믿는다 김정일동지 당신이 없으면 우리도 없고, 당신이 없으면 조국도 없다! 아…… 우리의 김정일동지 당신이 없으면 조국도 없다! 사나운 暴風도 쳐몰아내고 信念을 안겨준 金正日同志 當身이 없으면 우리도 없고, 當身이 없으면 祖國도 없다! 未來도 希望도 다 맡아주는 民族의 運命인 金正日同志 當身이 없으면 우리도 없고, 當身이 없으면 祖國도 없다! 世上이 열百番 變한다해도 人民은 믿는다 金正日同志 當身이 없으면 우리도 없고, 當身이 없으면 祖國도 없다! 아…… 우리의 金正日同志 當身이 없으면 祖國도 없다! sanaun p'okp'ungdo ch'yŏmoranaego sinnyŏmŭl an'gyŏjun Kim Chŏng-il tongji tangsini ŏpsŭmyŏn urido ŏpko, tangsini ŏpsŭmyŏn chogukto ŏpta! miraedo hŭimangdo ta mat'ajunŭn minjogŭi unmyŏng'in Kim Chŏng-il tongji tangsini ŏpsŭmyŏn urido ŏpko, tangsini ŏpsŭmyŏn chogukto ŏpta! sesang'i yŏlbaekpŏn pyŏnhandahaedo inminŭn minnŭnda Kim Chŏng-il tongji tangsini ŏpsŭmyŏn urido ŏpko, tangsini ŏpsŭmyŏn chogukto ŏpta! a…… uriŭi Kim Chŏng-il tongji tangsini ŏpsŭmyŏn chogukto ŏpta! sanaun pokpungdo chyeomoranaego sinnyeomeul an-gyeojun Gim Jeong-il dongji dangsini eopseumyeon urido eopgo, dangsini eopseumyeon jogukdo eopda! miraedo huimangdo da matajuneun minjogui unmyeong-in Gim Jeong-il dongji dangsini eopseumyeon urido eopgo, dangsini eopseumyeon jogukdo eopda! sesang-i yeolbaekbeon byeonhandahaedo inmineun minneunda Gim Jeong-il dongji dangsini eopseumyeon urido eopgo, dangsini eopseumyeon jogukdo eopda! a…… uriui Gim Jeong-il dongji dangsini eopseumyeon jogukdo eopda! You pushed away the severe storm You made us believe, Comrade Kim Jong-il We cannot live without you Our country cannot exist without you! Our future and hope depend on you People's fate depends on you, Comrade Kim Jong-il! We cannot live without you Our country cannot exist without you! Even if the world changes hundreds of times People believe in you, Comrade Kim Jong-il We cannot live without you Our country cannot exist without you! Oh... Our Comrade Kim Jong-il Our country cannot exist without you! * Note: The military version of the song refers to Kim Jong-il as General Kim Jong-il, not Comrade Kim Jong-il because he was the KPA Supreme Commander-in-Chief since 1991 and the Chairman of the DPRK National Defense Commission since 1993, while the civilian/official version refers otherwise because he was the Workers Party of Korea General Secretary since 1997 and held other civilian positions. ==Related pages== * Song of General Kim Jong-il * North Korean music * Propaganda in North Korea * Pochonbo Electronic Ensemble ==References== ==Other websites== * 당신이 없으면 조국도 없다 * Youtube - Performed by KPA state merited chorus * Youtube - Performed by Pochonbo Electronic Ensemble (Subtitles) Category:National symbols of North Korea Category:Political songs",
 "title": "No Motherland Without You"
}