{
 "id": "322896",
 "text": "The List of World Heritage Sites in the United Kingdom is a group of places chosen by UNESCO, the United Nations Educational, Scientific and Cultural Organization. There are 30 UNESCO World Heritage Sites in the United Kingdom and overseas territories. The UNESCO list has eighteen properties in England (the Frontiers of the Roman Empire is shared with Germany), five in Scotland, three in Wales, one in Northern Ireland, and one in each of the overseas territories of Bermuda, the Pitcairn Islands, and Saint Helena. ==History== UNESCO was created for the \"conservation and protection of the world’s inheritance of books, works of art and monuments of history and science\". The constitution of UNESCO was ratified in 1946 by 26 countries, including the United Kingdom.\"UNESCO Constitution\"; retrieved 2012-4-18. The UK contributes £130,000 annually to the World Heritage Fund which finances the preservation of sites in developing countries. Some locations have many sites that have a common geographical location or cultural history. ==List== The World Heritage list has developed over time. It is part of a process; and the list continues to grow. The United Kingdom National Commission for UNESCO advises the British government on policies dealing with UNESCO. The British government is responsible for maintaining its World Heritage Sites. === Original list === The first sites in the UK to be added to the World Heritage List, in 1986, were: * Giant's Causeway and Causeway Coast * Durham Castle and Cathedral * Ironbridge Gorge * Studley Royal Park and the Ruins of Fountains Abbey * Stonehenge, Avebury and Associated Sites * Castles and Town Walls of King Edward in Gwynedd The latest site to be added was Pontcysyllte Aqueduct and Canal in 2009. === Criteria === There are 10 criteria for a site to be able to be added to the list. World Heritage Site selection criteria i–iv are culturally based. selection criteria vii–x are natural criteria. Twenty-three properties are listed as \"cultural\". Four are listed as \"natural\". One is listed as \"mixed\", which means that the site is notable for both natural and cultural criteria. This is similar to the proportions of all World Heritage Sites. Of the 890 sites on the World Heritage List, 77.4% are cultural, 19.8% are natural, and 2.8% are mixed. St Kilda is the only mixed World Heritage Site in the UK. At first, it was added to the list because of its natural habitats. In 2005, the crofting community that once was part of the archipelago was added to the site. The natural sites are the Dorset and East Devon Coast, Giant's Causeway and Causeway Coast, Gough and Inaccessible Islands and Henderson Island. The rest are cultural. As of 2020, there are 30 places in the United Kingdom which are on the World Heritage List. * 25 cultural sites * 4 natural sites There are 13 sites which are on a tentative list. ===Table=== Name Image Location Notes Blaenavon Industrial LandscapeUNESCO, \"Blaenavon Industrial Landscape\"; retrieved 2012-4-20 cultural site Blenheim PalaceUNESCO, \"Blenheim Palace\"; retrieved 2012-4-20. cultural site Canterbury Cathedral, St Augustine's Abbey, and St Martin's ChurchUNESCO, \"Canterbury Cathedral, St Augustine's Abbey, and St Martin's Church\"; retrieved 2012-4-20. cultural site Castles and Town Walls of King Edward in Gwynedd cultural site City of BathUNESCO, \"City of Bath\"; retrieved 2012-4-19. cultural site Cornwall and West Devon Mining Landscape cultural site Derwent Valley MillsUNESCO, \"Derwent Valley Mills\"; retrieved 2012-4-23. cultural site Dorset and East Devon CoastUNESCO, \"Dorset and East Devon Coast\"; retrieved 2012-4-23. natural site also called Jurassic Coast Durham Castle and Cathedral cultural site Forth BridgeUNESCO, \"Forth Bridge\"; retrieved 2020-7-12. cultural site Frontiers of the Roman EmpireUNESCO, \"Frontiers of the Roman Empire\"; retrieved 2012-4-25. Hadrian's Wall, northern England and Antonine Wall, southern Scotland cultural sitescattered limes in the UK and in Germany Giant's Causeway and Causeway Coast natural site Gough and Inaccessible Island Heart of Neolithic Orkney cultural site Henderson Island natural site Historic Town of St George and Related Fortifications, Bermuda cultural site Ironbridge GorgeUNESCO, \"Ironbridge Gorge\"; retrieved 2012-4-24. cultural site Jodrell Bank ObservatoryUNESCO, \"Jodrell Bank Observatory\"; retrieved 2020-7-12. cultural site Liverpool – Maritime Mercantile City cultural site Maritime GreenwichUNESCO, \"Maritime Greenwich\"; retrieved 2012-4-25. cultural site New LanarkUNESCO, \"New Lanark\"; retrieved 2012-4-21. cultural site Old and New Towns of EdinburghUNESCO, \"Old and New Towns of Edinburgh\"; retrieved 2012-4-21. cultural site Pontcysyllte Aqueduct and Canal cultural site Royal Botanical Gardens, KewUNESCO, \"Royal Botanical Gardens, Kew\"; retrieved 2012-4-20. cultural site St KildaUNESCO, \"St Kilda\"; retrieved 2012-4-20. mixed site SaltaireUNESCO, \"Saltaire\"; retrieved 2012-4-21. cultural site Stonehenge, Avebury and Associated SitesUNESCO, \"Stonehenge, Avebury and Associated Sites\"; retrieved 2012-4-20. cultural site Stonehenge, Avebury Studley Royal Park including the Ruins of Fountains Abbey cultural site Tower of LondonUNESCO, \"Tower of London\"; retrieved 2012-4-20. cultural site Westminster Palace, Westminster Abbey and Saint Margaret's ChurchUNESCO, \"Westminster Palace, Westminster Abbey and Saint Margaret's Church\"; retrieved 2012-4-21. Houses of Parliament and Westminster Abbey, London cultural site ==Tentative list== The Tentative List is an inventory of important heritage and natural sites that a country is considering for inscription on the World Heritage List, thereby becoming World Heritage Sites. The Tentative List can be updated at any time, but inclusion on the list is a prerequisite to being considered for inscription within a five- to ten-year period. The UK's Tentative List was last updated on 25 July 2014, and consisted of 11 sites. The properties on the Tentative List are as follows: Name Image Location Date UNESCO data Chatham Dockyard and its Defences 17th–19th centuries Creswell Crags 60–15 thousand years ago Darwin's Landscape Laboratory 1842–1882 Island of St Helena Mousa, Old Scatness and Jarlshof: the Zenith of Iron Age Shetland 4,000 years ago Slate Industry of North Wales 18th–20th centuries Flow Country The Twin Monastery of Wearmouth Jarrow 672/3 (Wearmouth) 681 (Jarrow) Turks and Caicos Islands Great Spas of Europe 1st–20th centuries Many other favorite sites were left out this time, including #The Cairngorm Mountains, Scotland #The Forth Bridge, Scotland #The New Forest, England #Shakespeare's Stratford, England #The Wash and North Norfolk Coast, England ==Related pages== * UNESCO World Heritage Site ==Notes== ==References== ==Further reading== * * * * * == Other websites == * * UNESCO site * UK World Heritage Sites DCMS portal * List of World Heritage Sites in Britain * Category:Geography of the United Kingdom Category:United Kingdom-related lists United Kingdom",
 "title": "List of World Heritage Sites in the United Kingdom"
}