{
 "id": "322804",
 "text": "Gerald Joseph \"Gerry\" Mulligan (April 6, 1927 – January 20, 1996) was an American jazz saxophonist, clarinetist, composer and arranger. He was born in New York City. Though Mulligan is primarily known as one of the leading baritone saxophonists in jazz history - playing the instrument with a light and airy tone in the era of cool jazz - he was also a notable arranger, working with Claude Thornhill, Miles Davis, Stan Kenton, and others. Mulligan's pianoless quartet of the early 1950s with trumpeter Chet Baker is still regarded as one of the more important cool jazz groups. Mulligan was also a skilled pianist and played several other reed instruments. Mulligan reportedly had a relationship with actress Judy Holliday until she died in 1965, and with actress Sandy Dennis from 1965 until they broke up in 1976. Mulligan died of problems caused by knee surgery while suffering from liver cancer on January 20, 1996 at a hospital in Darien, Connecticut at the age of 68. ==Discography== ===As leader=== *1950: The Gerry Mulligan Quartet/Gerry Mulligan with the Chubby Jackson Big Band - The big band sides are from 1950, the band led by bassist Jackson included Howard McGhee, Zoot Sims, and trombonist J. J. Johnson. The quartet sides, with Chet Baker were recorded at two sessions in 1952. *1951: Historically Speaking *1951: Mulligan Plays Mulligan - Mulligan's first session as leader *1953: The Original Quartet With Chet Baker -2-CD collection of the recordings of the pianoless quartet with Chico Hamilton for Pacific Jazz *1953: Konitz Meets Mulligan (with Chet Baker) *1954: Gerry Mulligan quartet: Pleyel Concert - (2 CD, with Bob Brookmeyer (v.trb.), Red Mitchell (b), Frank Isola (d) *1956: At Storyville ( Quartet, live in Boston, Mulligan plays piano on some tracks, *1957: Reunion with Chet Baker *1957: Mulligan Meets Monk (with Thelonious Monk as co-leader) *1957: Blues in Time (Quartet with Paul Desmond Verve records, released on CD as Gerry Mulligan/Paul Desmond Quartet) *1957: Getz Meets Mulligan in Hi-Fi (with Stan Getz (t.sax), Lou Levy (p), Ray Brown (b), Stan Levey (d). *1958: Jazz Giants '58 (Verve) *1958: What Is There to Say? *1959: Gerry Mulligan Meets Ben Webster (with Ben Webster (t.sax), Jimmy Rowles (p), Leroy Vinnegar (b), Mel Lewis (d). *1960: Gerry Mulligan and the Concert Jazz Band at the Village Vanguard (with a big band driven by drummer Mel Lewis) *1962: Live at the Olympia Paris *1962: The Gerry Mulligan Quartets - Complete Studio Rec. with Bob Brookmeyer (v.trb & p) /Chet Baker (trp), Bill Crow/Henry Grimes (b), Gus Johnson/Dave Bailey (d). *1963: Jeru (with Tommy Flanagan, Ben Tucker, Dave Bailey) *1963: The Great Gerry Mulligan (Crown Records) *1963: Night Lights (with trumpeter Art Farmer, Bob Brookmeyer (v.trb), Jim Hall (g). *1964: Feelin' Good (Limelight Records) *1964: Complete Studio Recordings- The Gerry Mulligan Sextet with Art Farmer, Bob Brookmeyer, Jim Hall (g), Bill Crow (b), Dave Bailey (d). *1965: If You Can't Beat 'Em,Join 'Em, (Limelight Series) *1970: Live at the Berlin Philharmonie (with the Dave Brubeck Trio) *1971: Age of Steam Gerry Mulligan and his Orchestra *1974: Summit with Ástor Piazzolla (bnd), Angel Pocho Gatti (p), Giuseppe Prestipino (Pino Presti) (elb), Tullio De Piscopo (d), Umberto Benedetti Michelangeli (1st violin) and Strings Orchestra. *1974: Gerry Muligan/Chet Baker: Carnegie Hall Concert (with Chet Baker (trp), Ed Byrne (trb), Bob James (p), John Scofield (g), Ron Carter (b), Harvey Mason (d), Dave Samuels (vb). *1976: Gerry Mulligan meets Enrico Intra with Enrico Intra (p), Giancarlo Barigozzi (f), Sergio Farina (g), Pino Presti (b), Tullio De Piscopo (d) *1990: Lonesome Boulevard *1992: Re-Birth of the Cool *1993: Billy Taylor and Gerry Mulligan: Live at MCG (live, with pianist Billy Taylor at Manchester Craftsmen's Guild (MCG) in Pittsburgh) *1993: Paraiso with Brazilian singer Jane Duboc *1995: Dragonfly The final recordings Category:American composers Category:musicians from New York City Category:American jazz musicians Category:Deaths from surgical complications Category:Deaths from liver cancer Category:1927 births Category:1996 deaths",
 "title": "Gerry Mulligan"
}