{
 "id": "322987",
 "text": "Loyalists were people in the Thirteen Colonies who opposed the American Revolutionary War. They were also called Tories, King's Men, or Royalists. They fought with the British Empire against the Continental Army and Continental Congress, which they felt was oppressing them. During the Revolution, most Loyalists suffered little from their views. However, some were treated very roughly by revolutionaries (who often called themselves \"Patriots\"). Tory lands and other properties were taken away, and sometimes they were jailed or even killed. Some Loyalists formed militias, which were armed and supplied by the British. In total, around 19,000 Loyalists fought alongside the British in the Revolutionary War. == Who they were == Loyalists came from all walks of life. Most were small farmers, artisans and shopkeepers. Not surprisingly, most British officials remained loyal to the Crown. Wealthy merchants tended to remain loyal; so did Anglican ministers, especially in Puritan New England. Some enslaved black people were Loyalists because the British promised them their freedom. Some Native Americans and indentured servants, who had little power in colonial society, were Loyalists. So were some German immigrants, who supported the Crown mainly because King George III was of German origin. The number of Loyalists in each colony varied. Recent estimates suggest that half the population of New York was Loyalist; it had an aristocratic culture, and the British occupied the area throughout the Revolution. In the Carolinas, back-country farmers were Loyalist, whereas the Tidewater planters tended to support the Revolution. == After the war == === Return of some property === The Paris Peace Treaty required the new United States Congress to restore property that had been taken from Loyalists. This worked well in some cases. For example, generous settlements were received by the heirs of William Penn in Pennsylvania and George Calvert in Maryland. However, in the Carolinas - where dislike between rebels and Loyalists was especially strong - few Loyalists regained their property. In New York and the Carolinas, large estates were divided up and given to small farmers. This started something of a social revolution by re- distributing power. === Emigration === After the war, about 100,000 Loyalists left the new United States. Most sought asylum in Canada to escape the country and to stay loyal to King George and the British Empire. Most Black Loyalists left, because they could be re-enslaved if they remained in the United States. Brantford, Ontario is an example of a Loyalist community started by Iroquois refugees. Individuals who left the United States included William Franklin (Benjamin Franklin's son) and John Singleton Copley (the greatest American painter of the time). Some eventually returned, although several state governments excluded the Loyalists from holding public office. == Legacy == In the decades after the Revolution, Americans preferred to forget about the Loyalists. Apart from Copley, the Loyalists became nonpersons in American history. == Other websites == * United Empire Loyalists -Citizendium Category:American Revolutionary War",
 "title": "Loyalist (American Revolution)"
}