{
 "id": "322906",
 "text": "The Stop Online Piracy Act or SOPA was a proposed American law to stop copyright infringement on the Internet. The Internet community had major discussion over it in 2011 and 2012, but the bill was not passed.Jones, Melanie. \"What is SOPA Bill 2012? 7 Things to Know About Controversial Legislation,\" International Business Times (US), January 18, 2012;McCullah, Declan. \"How SOPA would affect you: FAQ,\" CNET (US), January 18, 2012; retrieved 2012-1-18. Some experts said the proposed changes to the internet would have worldwide effects.Seibt, Sébastian. \"SOPA et PIPA tentent d’imposer au monde une vision américaine du droit d’auteur,\" France24/RFI, 18 January 2021; retrieved 2012-1-18. Many critics said it would have bad unintended consequences.Espinel, Victoria et al. \"Combating Online Piracy while Protecting an Open and Innovative Internet,\" White House (US). January 14, 2012; Friedman, Allan A. \"Cybersecurity in the Balance: Weighing the Risks of the PROTECT IP Act and the Stop Online Piracy Act,\" Brookings (US), November 15, 2011; retrieved 2012-1-18. == Protest == Some people and businesses supported the new law. Others were alarmed. Supporters worried that current copyright laws are not effective in shutting down piracy websites. The opponents worried that it is a kind of censorship.Azarova, Kaerina. \"Wikipedia blackout: 24-hour strike against SOPA, PIPA is on,\" RT (Russia), 18 January, 2012; retrieved 2012-1-18. It is hard to tell which side is correct because the language in the law is still being written. The English Wikipedia masked most of its pages with a banner on January 18, 2012.Kaszor, Daniel. \"Why is Wikipedia offline and what is SOPA?\" National Post (Canada), January 17, 2012; English Wikipedia anti-SOPA blackout ; retrieved 2011-1-18. They used JavaScript to do this, which means that people could avoid the banner by just disabling JavaScript in their browser.Melanie Pinola. \"How to Access Wikipedia During the Anti-SOPA Blackout\"]; retrieved 2011-1-18. The Wikipedia blackout is intended to spotlight the value of open access to information on the Internet.Goodale, Gloria. \"Wikipedia blackout: Why even supporters question anti-SOPA move,\" Christian Science Monitor (US). January 17, 2012; retrieved 2012-1-18. Other websites joined protests against SOPA. \"Loi antipiratage américaine: RSF ferme son site en anglais en signe de protestation,\" L'Express (France). 18 January 2011; Hourdeaux, Jérôme. \"Ce mercredi, c'est la 'Journée de la censure américaine'',\" Nouvel Observateur (France). 11 November 2011; retrieved 2012-1-18. For example, Google put up a black censor board in front of its logo.Tsykayama, Hayley. \"SOPA protests planned by Google, Wikipedia and others on Jan. 18,\" Washington Post (US), January 17, 2012; retrieved 2012-1-18. Many critics questioned the value and likely effects of the protests.Barnett, Emma. \"Wikipedia Sopa blackout won't solve the problem,\" The Telegraph (UK). 18 January 2012; retrieved 2012-1-18. Some people questioned the timing of the protests. ==Related pages == * Protect IP Act ==References== ==Other websites== * Text of Stop Online Piracy Act( ); H.R. 3261 * US House Judiciary Committee website * SOPA Strike website * * * Category:United States law Category:Copyright",
 "title": "Stop Online Piracy Act"
}