{
 "id": "323455",
 "text": "The following is a list of terms commonly used in aviation. ==Airports== * Air cargo - Cargo that is moved using airplanes. Many companies that move cargo, such as FedEx and the US Postal Service, have their own airplanes for moving air cargo. Most large airports have entire sections of the airport and warehouses for dealing with air cargo. * Airport - a location where aircraft such as fixed-wing aircraft, helicopters, and blimps take off and land. * Arrival area (Arrivals) - The area of the terminal used for airplanes coming to the airport. * Baggage - luggage and other items brought on the airplane by passengers. One piece of small baggage can often be brought on the airplane by the passenger. Large baggage (or if the is many small pieces) are kept in a special part of the airplane. * Baggage area - The area of the airport terminal used for dealing with baggage. These often have one or more large moving belt(s). The passengers wait at the belt for their baggage to move to them. * Concessions - Businesses often inside the airport terminal. These usually sell food, beverages or retail goods such as book, magazines or souvenirs to passengers. * Concourse - An open space for people to move around in an airport terminal. * Departure area (Departures) - The area of the terminal for airplanes leaving the airport. * Destination - The place an aircraft is going to. An aircraft may have more than one destination. This is because it takes people to many places along its travel. For example, an aircraft leaving Atlanta, may stop at Memphis, Dallas, and Boulder before finally stopping in San Diego. San Diego is its final destination on this travel, but the other cities are also destinations. * Flight - The noun form of fly. This is the term for what a person takes when they fly. She took a flight to Atlanta. It can also be used in the name of the trip - She took Flight 213 to Atlanta. If an airport had 500 flights that day, it means airplanes came to and left the airport 500 times that day. ** Domestic flight - A flight that starts and ends in the same country. This is usually between two cities in the same country. For example, from Philadelphia, Pennsylvania to Los Angeles, California. ** International flight - A flight that starts in one county and ends in an other country. For example, from Moscow, Russia to Sydney, Australia. * Gates - The areas on the concourse where passengers get on to the airplane *Hangar - a large building which can store airplanes. * Hub - The central location an airline uses for its operations. Most airlines keep their headquarters and maintenance facilities as at a single airport. Most flights from that airline go through this airport. * Landing - The act of an airplane returning to the ground. * Runway - The part of the airport where planes take off or land. * Take-off - The act of an airplane leaving the ground. * Terminal - The main building of an airport used by passengers and cargo. * Tower - The tower in an airport is a building used for air traffic control. ==Aircraft== * Aircraft - vehicle used for flying. * Attack aircraft - A type of military aircraft used mainly to attack targets on the ground. * Biplane - an aircraft with two sets of wings mounted one above the other. * Fighter aircraft - A type of military airplane used mainly to fight with other airplanes. * Fixed-wing aircraft - The type of aircraft commonly thought of by most people. It has wings that do not move. The wings on some fixed wing aircraft can move a small distance but are generally fixed in one position. For example, the wings on an F-14 can be rotated from a forward position (for better control at slow speed and for take off and landing) to a rear position (for better control at high speed). Most airplanes are fixed wing. * Jet aircraft - Aircraft that use jet engines to make them move. * Propeller powered aircraft - Aircraft that use propellers to make them move. * Rotary wing aircraft - Aircraft such as helicopters. * Training aircraft - A type of military aircraft used mainly to train pilots. * Triplane - An aircraft with three sets of wings. German World War I pilot Manfred von Richthofen (The Red Baron) is well known for flying a triplane. * Water bomber - A type of aircraft used to fight the fire. ==Other websites== *Appendix:Glossary of aviation, aerospace, and aeronautics Terms Aviation",
 "title": "List of aviation terms"
}