{
 "id": "323438",
 "text": "List of airports in Japan may be grouped by type and or by location. ==Airport classifications== In Japan, airports serving civil aviation routes are governed by Japanese law.Isaku Shibata, \"Japanese Laws Related to Airport Development and the Need to Revise Them,\" Journal of Air Law and Commerce vol. 65 (winter 1999), p. 125. The Airport Development Law establishes four classifications for airports.Nippon Foundation Library, Airport Development Law; retrieved 2012-1-20. * Hub/First Class airports (拠点空港) serve a hub role in domestic or international transportation. : Examples are Kansai International Airport,Ministry of Land, Infrastructure, and Transport (MLIT), Kansai International Airport; retrieved 2012-1-20. Narita International AirportMLIT, Narita International Airport; retrieved 2012-1-20. * Regional/Second Class airports (地方管理空港) are regional airports which are important to national aviation. : Examples are Fukuoka Airport,About Fukuoka Airport ; retrieved 2012-1-20. Kitakyushu Airport,Kitayushu Kokura Airport Information, Kitakyushu Airport Car Rental; retrieved 2012-1-25. Sendai AirportSendai Airport Car Rental, Airport info ; retrieved 2012-1-22. * Joint- use/Third Class airports (共用空港) are smaller airports which are shared between civil aviation and the Japan Self-Defense Forces (JSDF). : Examples are Kobe Airport,Kobe Chamber of Commerce and Industry, Promoting Kobe Airport; retrieved 2012-1-21. Oki Airport,隠岐空港について ( About Oki Airport); retrieved 2012-1-22. Oshima Airport Oshima Airport RJTO; retrieved 2012-1-25. * Other airports (その他の空港) are outside the above categories. : Examples are: Kisarazu Air Field,Japanese army base (JGSDF); Facilities, Japan Ground Self Defense Force; retrieved 2012-1-21. Shimofusa Air BaseJapanese navy base (JMSDF) Some airports in Japan are not within the scope of the Japanese airport statutes. These include U.S. military bases: Kadena Air Base, Iwakuni Air Base and Yokota Air Base. ==Airports== City Prefecture Island ICAO IATA Airport name Coordinates FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS FIRST CLASS AIRPORTS Izumisano / Tajiri / Sennan Osaka Honshū RJBB KIX Kansai International Airport Narita Chiba Honshū RJAA NRT Narita International Airport Tokoname Aichi Honshū RJGG NGO Chūbu International Airport (Centrair)MLIT, CHUBU CENTRAIR International Airport; retrieved 2012-1-20. Ōta Tokyo Honshū RJTT HND Tokyo International Airport (Haneda)MLIT, Tokyo International (Haneda) Airport; retrieved 2012-1-20. Toyonaka / Ikeda / Itami Honshū RJOO ITM Osaka International Airport (Itami)Japanese Lifestyle, Osaka International Airport ; retrieved 2012-1-21. ==References== == Other websites == * http://www.mlit.go.jp/koku/english/09_data/10_airports.html * Code for Trade and Transport Locations ... UNLOCODE (JP) * Great Circle Mapper: Airports in Japan * World Aero Data: Airports in Japan * Japan Category:Japan- related lists",
 "title": "List of airports in Japan"
}