{
 "id": "323584",
 "text": "Sydney (Kingsford Smith) Airport (also known as Kingsford-Smith Airport and Sydney Airport) is in the suburb of Mascot in Sydney, Australia. It is Sydney's main airport, and is the main hub for Qantas, and a secondary hub for Virgin Australia and Jetstar Airways. It is next to Botany Bay. The airport has three runways, the \"east–west\", \"north–south\" and \"third\" runways. Sydney Airport is one of the oldest airports in the world still in use.Fact Sheet Sydney Airport It is the busiest airport in Australia, handling 36 million passengers in 2010Passenger Traffic 2009 FINAL Airports Council International and 289,741 aircraft movements in 2009.Sydney Airport – An Overview Sydney Airport It was the 28th busiest airport in the world in 2009. The airport is managed by Sydney Airport Corporation Limited (SACL). Flights from Sydney link with all parts of Australia. There are direct flights to 47 Australian cities and towns ==History== ===1920–30: Early history=== Before the airport was built, it was a field for bullocks. Nigel Love, a former World War I pilot, wanted to start building aircraft. He needed to set up a factory and an aerodrome close to the city. He found some land owned by the Kensington Race Club. It had been used by a local abattoir, which was closing down, to graze sheep and cattle. The surface was perfectly flat and was covered with a pasture of buffalo grass. This grass which had been grazed so evenly by the sheep and cattle running on it that it was easy to make it suitable to land aircraft. In addition, it was clear for aircraft on all four sides. On the sides of the field were a racecourse, gardens, a river and Botany Bay. Love set up Mascot as a private business, leasing from the Kensington Race club for three years. At first he had a small canvas structure but was later put up an imported Richards hangar. The first flight from Mascot was on 19 November 1919 when Love took movie cameraman Billy Marshall up in an Avro. The official opening flight took place on 9 January 1920, also performed by Love. In 1921 the Australian government purchased in Mascot to set up a public airfield. In 1923, at the end of Love's three-year lease, the government took the land from the racing club. The first regular flights began in 1924. ===1930–60=== In 1933, the first gravel runways were built. The course of Cooks River was moved away from the area in 1947–52 to provide more land for the airport and other small streams were filled. When Mascot was declared an aerodrome in 1920 it was known as Sydney Airport. In 1953 it was renamed Sydney (Kingsford Smith) Airport after Charles Kingsford Smith, a pioneering Australian aviator. The first paved runway was 07–25 and the next one built was 16R, sticking out into Botany Bay, starting in 1959, to land large jets. 07-25 is used mainly by lighter aircraft, although large four engine jet aircraft still land on the runway from the east, when south-westerly winds are blowing in Sydney. 16R is presently the longest operational runway in Australia, with paved length and between the zebra thresholds. ===1960–2000=== By the 1960s a new international terminal was needed, and work started in late 1966. The new building was officially opened on 3 May 1970, by Queen Elizabeth II. The first Boeing 747 \"Jumbo Jet\" to land at the airport, Pan American's Clipper Flying Cloud (N734PA), arrived on 4 October 1970. In the 1970s the north-south runway was made longer to become one of the longest runways in the southern hemisphere. The international terminal was made bigger in 1992 and has been modernized several times since then. Having only two runways that crossed each other became a problem and various governments tried to increase with Sydney airport's capacity for many years. A decision was finally made to build a third runway. This was not popular with people who lived near the airport. The third runway was built parallel to the existing main \"north–south\" runway entirely on reclaimed land from Botany Bay). A proposed new airport on the outskirts of Sydney was not developed. The \"third runway\" remained a problem because of increased aircraft movements, especially over many inner suburbs. The 1990s saw the setting up of the No Aircraft Noise Party, although it did not win any seats in Parliament. Changes for Sydney Airport's operation were introduced by the Howard government in 1996. These included: * curfews which does not allow jet movements between 2300–0600H * rotate runway operations * have planes fly into the airport from different directions * use flightpaths over water, especially Botany Bay * limit noise by reduced power settings on takeoff. ===2000–10=== In 2002, the Australian Government sold Sydney Airport to Southern Cross Airports Corporation Holdings Ltd. 82.93% of SACL is owned by MAp Airports International Limited, part of Macquarie Bank. Sydney Airport Intervest GmbH own 12.11% and Ontario Teachers' Australia Trust own 4.96%. SACL holds a 99-year lease on the airport which remains Crown land. The international terminal has been made bigger several times. The next rebuilding will take place in stages over twenty years (2005–25). This will include a high-rise office block, a multi-level car park, and bigger international and domestic terminals. This rebuilding and other plans of Macquarie Bank for the airport are seen as controversial. They do not need the legal oversight of local councils, which usually act as the local planning authority for such developments. As of April 2006, some of the proposed development has been scaled back.Sydney Morning Herald. 21 April 2006 issue Sydney Airport's International terminal underwent a $500 million rebuild that was completed in mid 2010. It included a new baggage system, an extra of space for shops and passenger waiting areas and other improvements. In March 2010, the Australian Competition and Consumer Commission said that prices at Sydney airport were too high. The report said Sydney Airport recorded the highest average prices at $13.63 per passenger, compared to the lowest of $7.96 at Melbourne Airport. The price of short-term parking had almost doubled in the 2008–09 financial year, from $28 to $50 for four hours. The report also said the airport abused its monopoly power. ===2010–20=== In December 2011, Sydney Airport said it would divide the airport into two airline based areas which would have international, domestic and regional services under the one roof by 2019. Terminal 2 and Terminal 3 would be used by Qantas, Jetstar and members of the oneworld airline alliance. Terminal 1 would be used by Virgin Australia and its international partners. Other international airlines would continue to operate from T1. ==Terminals== Sydney Airport has three passenger terminals. The International Terminal is separated from the other two by a runway. Passengers needing to catch another flight need to allow for longer transfer times. Sydney Airport requires minimum connection times: * From domestic flight to domestic flight: 30 minutes * From domestic flight to international flight: 1 hour * From international flight to domestic flight: 1 hour 15 minutes * From international flight to international flight: 1 hour The airport provides a bus service between the terminals at a cost of A$5.50. ===Terminal 1=== Terminal 1 was opened on 3 May 1970, replacing the old Overseas Passenger Terminal. Terminal 1 has been greatly expanded since then. Today it is known as the International Terminal, in the airport's north western area. It has 30 gates (Concourse B with 8–37 and Concourse C with 50–63) served by aerobridges, as well as a number of remote bays. It has room for the Airbus A380, which fly routes to Singapore (Singapore Airlines), London via Singapore and Los Angeles (Qantas), Dubai and Auckland (Emirates). The terminal building has three levels, one each for arrivals, departures and airline offices. The departure level has 20 rows of check-in desks, each with 10 single desks making a total of 200 check-in desks. The terminal also has an observation deck on the roof. The terminal has six airline lounges: Two for Qantas, and one each for Air New Zealand, Singapore Airlines, Malaysia Airlines and Emirates. The terminal underwent a major $500 million redevelopment that was completed in 2010. The shopping area was made bigger, outbound customs operations were put into one place, and the floor space of the terminal increased to 254,000 square metres. File:Sydney Airport Terminal One Airside.JPG|Central International Concourse File:Sydney International Terminal Landside.JPG|International Terminal landside File:Sydney Airport Carpark Complex.JPG|Sydney Airport Carpark Complex File:Syd Airport Int Departures.JPG|International departures drop off area ===Terminal 2=== Terminal 2, in the airport's north-eastern section, was the former home of Ansett Australia's domestic operations. It has 15 parking bays with aerobridges and a number of non-contact bays. Today it serves Virgin Australia, Jetstar, Tiger Airways, Regional Express Airlines, Aeropelican Air Services and Qantaslink services operated by Eastern Australia Airlines. There are lounges for Qantas, Virgin Australia and Regional Express Airlines. ===Terminal 3=== Terminal 3 is a domestic terminal, for Qantas and Qantaslink flights to Canberra. It was home for Trans Australia Airlines (later renamed Australian Airlines). Like Terminal 2 it is in the north-eastern section. The current terminal building is largely the result of extensions made during the late 1990s. There are 14 parking bays with aerobridges, including two with dual aerobridges. Terminal 3 has a large Qantas Club lounge, and a Business Class and Chairmans lounge. Terminal 3 also has a 'Heritage Collection', includes items from Qantas's 90 years of service, It also has a view of the airport and is used by plane-spotters. It is next to Gate 13. ===Other terminals=== Sydney Airport once had a fourth passenger terminal, east of Terminal 2. This was formerly known as Domestic Express and was used by Regional Express Airlines, Virgin Blue (now known as Virgin Australia), and Impulse Airlines. However, it's now used by DHL Express and Tasman Cargo Airlines as an office building. The Freight Terminal is north of Terminal 1. It is used for international freight operations, except for Tasman Cargo Airlines' trans-Tasman services. ==Airlines and destinations== ===Passenger=== {{Airport destination list | Air Canada | Vancouver | Air India | Delhi | Air New Zealand | Auckland, Christchurch, Queenstown, Rarotonga (resumes 30 March 2023), Wellington | Air Niugini | Port Moresby | Air Vanuatu | Port Vila | AirAsia X | Auckland, Kuala Lumpur–International | Aircalin | Nouméa | All Nippon Airways | Tokyo–Haneda | American Airlines | Los Angeles | Asiana Airlines | Seoul–Incheon | Bamboo Airways | Ho Chi Minh City | Batik Air | Denpasar (begins 4 January 2023) | Batik Air Malaysia | Denpasar, Kuala Lumpur–International | Beijing Capital Airlines | Qingdao | British Airways | London–Heathrow, Singapore | Cathay Pacific | Hong Kong | Cebu Pacific | Manila | China Airlines | Taipei–Taoyuan | China Eastern Airlines | Shanghai–Pudong | | Guangzhou | Delta Air Lines | Los Angeles | Emirates | Christchurch (resumes 26 March 2023), Dubai–International | Etihad Airways | Abu Dhabi | Fiji Airways | Nadi | FlyPelican | Bathurst, Cobar, Mudgee, Taree, Newcastle | Garuda Indonesia | Denpasar, Jakarta–Soekarno-Hatta | Hawaiian Airlines | Honolulu | Japan Airlines | Tokyo–Haneda | Jetstar | Adelaide, Auckland, Avalon, Ayers Rock, Ballina, Brisbane, Cairns, Darwin, Denpasar, Gold Coast, Hamilton Island, Hervey Bay, Hobart, Ho Chi Minh City, Honolulu, Launceston, Melbourne, Nadi, Perth, Phuket, Proserpine, Queenstown, Rarotonga (begins 29 June 2023), Seoul–Incheon, Sunshine Coast, Townsville Seasonal: Mackay | Korean Air | Seoul–Incheon | LATAM Chile | Auckland, Santiago de Chile | Link Airways | Canberra, Inverell, Narrabri, Tamworth | Malaysia Airlines | Kuala Lumpur–International | Philippine Airlines | Manila | Qantas | Adelaide, Alice Springs, Apia–Faleolo, Auckland, Ayers Rock, Bangalore, Bangkok–Suvarnabhumi, Brisbane, Cairns, Canberra, Christchurch, Dallas/Fort Worth, Darwin, Denpasar, Gold Coast, Hamilton Island, Hobart, Hong Kong, Honolulu, Jakarta–Soekarno-Hatta, Johannesburg–O.R. Tambo, London–Heathrow, Los Angeles, Manila, Melbourne, Nadi, New York–JFK (resumes 14 June 2023), Norfolk Island, Nouméa, Nuku'alofa, Osaka–Kansai, Perth, Queenstown, San Francisco (resumes 27 March 2023), Santiago de Chile, Seoul–Incheon, Shanghai–Pudong, Singapore, Sunshine Coast, Tokyo–Haneda, Vancouver, Wellington Seasonal: Broome, Rome–Fiumicino, | QantasLink | Albury, Armidale, Ballina, Bendigo, Broken Hill, Canberra, Coffs Harbour, Dubbo, Gold Coast, Griffith, Hobart, Launceston, Lord Howe Island, Merimbula, Mildura, Moree, Orange, Port Macquarie, Sunshine Coast, Tamworth, Toowoomba Wellcamp, Townsville, Wagga Wagga Seasonal: Cooma | Qatar Airways | Doha | Rex Airlines | Albury, Armidale, Brisbane, Broken Hill, Coffs Harbour, Cooma, Dubbo, Gold Coast, Griffith, Melbourne, Merimbula, Moruya, Narrandera, Newcastle, Orange, Parkes, Port Macquarie, Wagga Wagga | Samoa Airways | Apia–Faleolo | Scoot | Singapore | Singapore Airlines | Singapore | SriLankan Airlines | Colombo–Bandaranaike | Thai AirAsia X | Bangkok–Suvarnabhumi | | Bangkok–Suvarnabhumi | T'way Air | Seoul–Incheon (begins 23 December 2022) | United Airlines | Houston–Intercontinental, Los Angeles, San Francisco | Vietnam Airlines | Hanoi, Ho Chi Minh City | Virgin Australia | Adelaide, Apia–Faleolo, Ballina, Brisbane, Cairns, Darwin, Denpasar, Gold Coast, Hamilton Island, Hobart, Launceston, Melbourne, Nadi, Perth, Port Vila (begins 21 March 2023), Queenstown, Sunshine Coast, Townsville | XiamenAir | Fuzhou, Xiamen }} ===Cargo=== {{Airport destination list | Airwork | Auckland |Cathay Pacific Cargo|Hong Kong, Melbourne |DHL Aviation|Auckland, Brisbane, Cairns, Cincinnati, Los Angeles, Honolulu, Melbourne, Nouméa, Singapore |Emirates SkyCargo|Dubai–Al Maktoum, Hong Kong, Jakarta–Soekarno-Hatta, Singapore |FedEx Express|Auckland, Guangzhou, Honolulu, Los Angeles, Manila, Singapore | Garuda Cargo |Jakarta–Soekarno–Hatta |Kalitta Air|Los Angeles, Singapore |MASkargo|Da Nang, Kuala Lumpur–International |Polar Air Cargo|Honolulu, Melbourne |Qantas Freight|Auckland, Brisbane, Chicago–O'Hare, Chongqing, Christchurch, Gold Coast, Hong Kong, Honolulu, Jakarta–Soekarno Hatta, Melbourne, Shanghai–Pudong ||Auckland, Melbourne, Singapore |Toll Priority|Brisbane, Melbourne |UPS Airlines|Honolulu, Seoul–Incheon, Shanghai–Pudong, Singapore |Virgin Australia Cargo|Brisbane, Cairns, Melbourne, Townsville }} File:MascotAirport6.JPG|Signage at the entrance to the domestic side of the airport File:Sydney Airport's control tower.jpg|Control tower File:SYDAp2.JPG|A Singapore Airlines Airbus A380 and a Korean Air Boeing 747 on the tarmac File:20100126 - Sydney Airport 01 - Australia Day.jpg|Qantas jet on taxiway with aircraft viewing area and Botany Bay beach in foreground File:VH-YFK - c-n 41004 - 737-8FE - Virgin Australia - Sydney (8233792125).jpg|Virgin Australia B737 on the tarmac File:Qantas A330 rainy takeoff (6320617384).jpg|Qantas A330 taking off File:Qantas 747 landing at Sydney Airport.JPG|Qantas Boeing 747-300 landing at the airport ==Curfew== In 1995 the Australian Government passed a law through parliament called \"The Sydney Airport Curfew Act\". This limits the operating hours of the airport. This was done in an effort to stop complaints about aircraft noise. The curfew disallows aircraft from taking off or landing between the hours of 23:00 and 06:00. However, some special flights are allowed between 23:00 to midnight and 05:00 to 06:00, by Section 12 of the Act. During bad weather, flights are often late and people on late flights are unable to travel on a given day. As of 2009, four airlines had been fined for landing during the closed times. The maximum fine is A$550 000. ==Transport== ===Rail=== The airport can be reached from the city by the Airport Link underground rail line. The International railway station is under the International terminal, while the Domestic railway station is under the car park between the domestic terminals (Terminal 2 and Terminal 3). While the stations are part of the Sydney Trains network, they are privately owned and operated by Airport Link. Passengers have to pay a station fee or 'gate fee' of $11.80. This fee is added to the price of the train ticket. The trains that go to the airport are regular suburban trains. Unlike special airport trains at other airports, they do not have special provisions for customers with luggage. They do not operate express to the airport and may have all seats occupied by commuters before the trains arrive at the airport. ===Bus=== Sydney Buses operates route 400 from Burwood to Bondi Junction railway stations and stops at the International and Domestic terminals. It connects the eastern suburbs, Inner West and St George areas to the airport. Private shuttle buses also service the airport from the Sutherland Shire, Blue Mountains and Central Coast. ===Road=== Sydney Airport has road connections in all directions. Southern Cross Drive (M1), a motorway, is the fastest link with the city centre. The only other motorway, the M5 South Western Motorway (including the M5 East Freeway) links the airport with the south-western suburbs of Sydney. There is a ring road around the airport. General Holmes Drive has a tunnel under the main north-south runway and three taxiways as well as an aircraft viewing area. Inside the airport a part-ring road joins the Domestic Terminal with the control tower, the general aviation area, car-rental company storage yards, long-term car park, heliport, various retail operations and a hotel. A perimeter road runs inside the secured area for airport vehicles only. The Airport runs several official car parks: * Domestic Short Term * Domestic Remote Long Term * International Short/Long Term. There are also many private parking companies around the airport who are cheaper than the official car parks. They have free shuttle buses to the airport. ===Pedestrian and bicycle=== The International Terminal is next to a wide pedestrian and bicycle path. It links Mascot and Sydney City in the north-east with Tempe (via a foot bridge over Alexandra Canal) and Botany Bay to the south-west. All terminals have bicycle racks and are also easily reached by foot from nearby areas. ==Accidents and incidents== * On 18 June 1950 a Douglas DC-3 of Ansett Airways preparing for take-off from Sydney's former Runway 22 hit and derailed a coal train on the railway line that crossed the runway. Only the co-pilot was injured. * On 30 November 1961, Ansett-ANA Flight 325, a Vickers Viscount, crashed into Botany Bay shortly after take-off. The starboard wing failed after the aircraft flew into a thunderstorm. All 15 people on board were killed. * On 1 December 1969, Boeing 707-321B N892PA of Pan Am Flight 812 overran the runway during take-off due to bird strikes. Number 2 engine was damaged and lost power. The takeoff was abandoned. The aircraft stopped beyond the end of runway 34 (now runway 34L). During the crash, Number 2 engine hit the ground and was damaged. The nose and left main landing gears failed and the aircraft came to rest supported by engines 1 and 2, the nose, and the remainder of the main landing gear. There were no injuries to the 125 passengers and 11 crew. * On 21 February 1980, VH-AAV, a Beechcraft Super King Air took off from Sydney Airport and suffered an engine failure. The pilot flew the aircraft back to the Airport and attempted to land but crashed into the sea wall. All 13 people on board died in the accident. * On 24 April 1994, Douglas DC-3 VH-EDC of South Pacific Airmotive had an engine failure shortly after take-off on a charter flight to Norfolk Island. The plane landed in Botany Bay. All four crew and 21 passengers safely rescued. ==References== ==Other websites== * Sydney Airport Homepage * Sydney Tower * Sydney Airport Frequency and Airway Data Category:Airports in Australia Category:Buildings and structures in Sydney Category:1920s establishments in Australia Category:Transport in Sydney",
 "title": "Sydney Airport"
}