{
 "id": "323504",
 "text": "Baltimore/Washington International Thurgood Marshall Airport is an airport serving the Washington Metropolitan Area in the United States. It is commonly called BWI. The airport is in northern Anne Arundel County, Maryland. It is about south of Baltimore and northeast of Washington, DC. BWI is named after Thurgood Marshall. He is a Baltimore native and the first African American to be on the Supreme Court of the United States. BWI is a focus city for Southwest Airlines and Cape Air. It is a hub for AirTran Airways. 21.9 million passengers traveled through BWI in 2010. July was the busiest month ever in the airport's history. BWI was the 24th busiest airport in North America in 2010. The airport was also 47th in the world in total aircraft movements in 2008. In 2010, BWI was listed as the best airport of its size (15–25 mil. passengers) in the world by the Airports Council International. This was based on its 2009 Airport Service Quality survey. The airport also won second place for North American airports in the \"Best Food and Beverage Program\" of the 2010 Richard A. Griesbach Excellence in Airport Concessions Contest. ==History== The planning to build a new airport on to serve the Baltimore/Washington area began just after World War II. Construction began in 1947.\"BWI History at a Glance\" BWI Airport Timeline: 1784-1947, retrieved December 27, 2011. The airport was first named Friendship International Airport after the Friendship Methodist Church which was next to the land used to build the airport until 1948. The airport was opened on June 24, 1950, by President Harry Truman. In April 1957, the airport had 52 weekday departures. Eastern, Capital, American, National, TWA, United, 2 Delta and Allegheny flew through BWI at that time. The early Boeing 707s and Douglas DC-8s could not use Washington National, and Dulles was not built until 1962, so Baltimore became Washington's jet airport. It dealt with flights across the continent.\"BWI History at a Glance\" BWI Airport Timeline: 1950–59, retrieved 2009-11-16 The State of Maryland bought Friendship International Airport from Baltimore for $36 million in 1972. The Maryland State Aviation Administration took control of the airfield. To get more passengers from the Washington area, the airport was renamed Baltimore/Washington International Airport in 1973.\"BWI History at a Glance\" BWI Airport Timeline: 1970–79, retrieved 2009-11-17 The BWI Rail Station opened in 1980. It gave a rail connection to passengers on the Northeast Corridor though Amtrak. BWI became the first airport in the United States to be served by a major rail station.\"BWI History at a Glance\" BWI Airport Timeline: 1980–89, retrieved 2009-11-17 The station had easy access to Washington, D.C. This is something that Washington Dulles International Airport still does not have. In 1997, a new international terminal (Concourse E) was added. Dulles still deals with most of the region's international flights. Air Jamaica and British Airways have used BWI for many years. AerLingus, Air Aruba, Air Greenland, El Al, Ghana Airways, Icelandair, KLM, Ladeco, and Mexicana have used BWI in the past. Military flights by the U.S. Air Force's Air Mobility Command still use BWI. Beginning in the 1980s and for much of the 1990s, BWI was a major hub for Piedmont Airlines and US Airways. Financial problems because of the dot-com bust, the September 11 attacks, and competition which lowered ticket prices caused them to be less active at the airport. Southwest Airlines' began using the airport in September 1993. Southwest is now the airport's largest carrier. It had 56.76% of the passengers carried in 2008.2008 North American Final Rankings . Airports Council International, retrieved February 17, 2010. Southwest recently bought AirTran. Because of this, Southwest Holdings now has an average of 214 departures each day. BWI is now Southwest's 3rd largest destination. BWI has International flights to London, Mexico, Canada, and the Caribbean and domestic flights throughout the United States. ==Airlines and destinations== ===Passenger airlines=== * Air Canada Express * Alaska Airlines * American Airlines * American Eagle * British Airways * Cape Air * Condor Flugdienst * Delta Air Lines * Delta Connection * JetBlue Airways * Norwegian Air Shuttle * Southwest Airlines * Spirit Airlines * Swift Air * United Airlines * United Express: * WOW Air * Xtra Airways ===Cargo airlines=== * ABX Air * FedEx Express * FedEx Feeder operated by Mountain Air Cargo * UPS Airlines == References == ==Other websites== * Baltimore/Washington International Thurgood Marshall Airport * BWI Business Partnership * BWI Development Council * BWI 60th anniv * * Category:Airports in the United States Category:Buildings and structures in Baltimore Category:Transport in Maryland",
 "title": "Baltimore/Washington International Airport"
}