{
 "id": "323588",
 "text": "Quincy Delight Jones Jr., (March 14, 1933 – November 3, 2024) was an American arranger, composer, conductor, record producer, and film music composer born in Chicago, Illinois. He is particularly recognized as the producer of the albums Off the Wall, Thriller, and Bad by pop icon Michael Jackson, which has sold more than 110 million copies worldwide, more than any other album ever, and as the producer and conductor of the No.1 charity song “We Are the World”. He has been nominated for 79 Grammy Awards. He has won 27 Grammy Awards. This is more than any other artist who is alive. He has been nominated for 7 Academy Awards. In 1990 Jones made his own company, Quincy Jones Entertainment, which produced The Fresh Prince of Bel-Air. He joined the Rock & Roll Hall of Fame in 2013. ==Career== Jones played trumpet on Dizzy Gillespie's 1954 album Afro. Quincy Jones' first album, This Is How I Feel About Jazz, was released in 1957 on ABC Records. Jones met Michael Jackson when they worked on the 1978 movie The Wiz. He produced Michael Jackson's 1979 album Off the Wall. He produced Jackson's 1982 album Thriller. The album won eight Grammy Awards in 1984. He produced the 1985 movie The Color Purple. The last Jackson album he produced was Bad. Bad was released in 1987. It sold 30 million copies. Jones sued Jackson's estate in 2013 for 10 million dollars. In 1994 Jones won the Jean Hersholt Humanitarian Award. In 2010 Q Soul Bossa Nostra was released. Many famous musicians sang on it, including Amy Winehouse. ==Family== He has seven children from five different mothers. His daughter Rashida Jones is an actress. His other daughter, Jolie Jones Levine, is the president of the Take it Back Foundation. ==Death== Jones died on November 3, 2024 at his home in Los Angeles, California from pancreatic cancer at the age of 91. His publicist confirmed his death. == Discography == His earliest album was released in 1955, Jazz Abroad. His latest album was released in 2010, Q Soul Bossa Nostra. He also was producer for albums (before and after that year). == Filmography == * Yakety Yak, Take it Back (1991) ... Himself * Fantasia 2000 (1999) ... Himself/Host (Segment \"Rhapsody in Blue\") == References == ==Related pages== *You Don't Own Me (song produced by Quincy Jones) ==Other websites== *Official website Category:1933 births Category:2024 deaths Category:African-American musicians Category:American conductors Category:American composers Category:American jazz musicians Category:American pop musicians Category:American Grammy Award winners Category:Movie producers from Chicago Category:Musicians from Chicago Category:American record producers Category:Musicians from Seattle Category:Writers from Chicago Category:Writers from Seattle Category:American songwriters Category:American Emmy Award winners Category:Tony Award winners Category:Deaths from pancreatic cancer Category:Cancer deaths in Los Angeles",
 "title": "Quincy Jones"
}