{
 "id": "323726",
 "text": "Winnie the Pooh is a 2011 American animated musical movie produced by Walt Disney Animation Studios and distributed by Walt Disney Pictures. It is the 51st movie in the Walt Disney Animated Classics series. It is based on the A. A. Milne stories of the same name. In the movie, Winnie the Pooh, Tigger, Rabbit, Piglet, Owl, Eeyore, Kanga and Roo go on a journey to save Christopher Robin from a menacing monster called the Backson (which Owl mistakes \"back soon\" on Christopher Robin's note as such). The plot of the movie was similar to Pooh's Grand Adventure: The Search for Christopher Robin, but also had a sub-plot in which Eeyore finds his tail, which was based on 1 of the books. As of 2024, Winnie the Pooh was Walt Disney Animation Studios' most recent fully hand-drawn movie and it's most recent G-rated movie. Despite this, producer Peter Del Vecho and Frozen directors Chris Buck and Jennifer Lee confirmed in 2019 that there would be possibilities for hand-drawn feature films in the future. ==Cast== *Jim Cummings as: **Winnie the Pooh, a kind-hearted anthropomorphic bear who loves honey. Mark Henn served as the supervising animator for Pooh. **Tigger, a hyperactive and brave tiger. Andreas Deja served as the supervising animator for Tigger. *Travis Oates as Piglet, a small cowardly pig and Pooh's best friend. Bruce W. Smith served as the supervising animator for Piglet. *Bud Luckey as Eeyore, an old miserable grey donkey who loses his tail during the events of the movie. Randy Haycock served as the supervising animator for Eeyore. *Huell Howser as Backson, the mysterious creature who was thought to have kidnapped Christopher Robin. Eric Goldberg served as the supervising animator for the Backson. *Jack Boulter as Christopher Robin, a young human boy and one of Pooh's best friends. Henn also served as the supervising animator for Christopher Robin. *Tom Kenny as Rabbit, a pretentious and strait-laced rabbit who loves planting vegetables in his garden. Goldberg also served as the supervising animator for Rabbit. *Kristen Anderson-Lopez as Kanga, a female kangaroo and Roo's mother. Smith also served as the supervising animator for Kanga. *Wyatt Dean Hall as Roo, Kanga's excitable joey. Smith again served as the supervising animator for Roo. *Craig Ferguson as Owl, an elderly owl who is not as wise as he thinks and tells very long and boring stories about his family. Dale Baer served as the supervising animator for Owl. *John Cleese as The Narrator ==Awards== Award Category Recipient Result Annie Awards Animated Effects in an Animated Production Dan Lund rowspan=5 Annie Awards Character Animation in a Feature Production Andreas Deja Mark Henn Annie Awards Directing in a Feature Production Don Hall & Stephen Anderson Annie Awards Music in a Feature Production Zooey Deschannel, Kristen Anderson-Lopez, Henry Jackman, Robert Lopez Annie Awards Production Design in a Feature Production Paul Felix Annie Awards Storyboarding in a Feature Production Jeremy Spears Annie Awards Writing in a Feature Production Brian Kesinger, Kendelle Hoyer, Don Dougherty, Clio Chiang, Don Hall, Stephen Anderson, Nicole Mitchell, Jeremy Spears rowspan=3 Chicago Film Critics Association Awards Animated Film Online Film Critics Society Best Animated Film ==References== Category:2011 animated movies Category:2011 musical movies Category:2011 comedy movies Category:2011 fantasy movies Category:American buddy comedy movies Category:American family movies Category:2010s American fantasy movies Category:American musical comedy movies Category:2010s English- language movies Category:Movies about bears Category:Movies based on books Category:Movies set in the 1920s Category:Winnie the Pooh Category:American fantasy-comedy movies Category:Movies about birds Category:Movies about children Category:Movies about rabbits and hares Category:Movies about tigers Category:Movies about pigs Category:2010s buddy comedy movies Category:2010s sequel movies Category:American sequel movies",
 "title": "Winnie the Pooh (2011 movie)"
}