{
 "id": "323977",
 "text": "was an old province in the area that is today the central part of Shizuoka Prefecture.Nussbaum, Louis-Frédéric. (2005). \"Suruga\" in Japan Encyclopedia, p. 916. It was sometimes called . Suruga had borders with Izu, Kai, Sagami, Shinano, and Tōtōmi provinces. The province had access to the Pacific Ocean at Suruga Bay. ==History== Suruga was one of the original provinces of Japan. It was established in the Nara period as part of the Taihō Code reforms. During the Kamakura period, Suruga was controlled by the Hōjō clan. In the Edo period, the Tōkaidō road was the main route between the Imperial capital at Kyoto and the main city of the Tokugawa Shogunate. The road passed through Suruga.Nussbaum, \"Tōkaidō\" at p. 973. Tokugawa Ieyasu lived in Sumpu Castle in Suruga when he retired from the role of Shōgun.Terry, Thomas Philip. (1914). Terry's Japanese Empire, p. 372. He died at Sunpu.Titsingh, Issac. (1834). Annales des empereurs du japon, p. 410. During the Edo period, the chief shogunate official in Sumpu was the Sunpu jōdai.Brinkley, Frank et al.. (1915). A History of the Japanese People from the Earliest Times to the End of the Meiji Era, p. 637. After the Meiji Restoration of 1868, the last Tokugawa Shōgun, Tokugawa Yoshinobu retired to Suruga. In the Meiji period, the provinces of Japan were converted into prefectures. The maps of Japan and Izu Province were reformed in the 1870s.Nussbaum, \"Provinces and prefectures\" at p. 780. Being located near Mt. Fuji made Suruga a popular place to make maps during the Meiji period. ==Shrines and Temples== Sengen jinja was the chief Shinto shrine (ichinomiya) of Suruga. \"Nationwide List of Ichinomiya,\" p. 1 ; retrieved 2012-1-24. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan ==References== ==Other websites == * Murdoch's map of provinces, 1903 * View of Entire Suruga Region Category:Former provinces of Japan Category:Shizuoka Prefecture",
 "title": "Suruga Province"
}