{
 "id": "324107",
 "text": "Christianity has been historically intertwined with Western civilization. However, it is difficult to decide what its effects were. Through its long history, the Church has been a major source of social services. Several universities were founded by the Church.Christianity and eduction Some historians of science, have argued that the Church had a significant, positive influence on the development of science.Are Christians \"anti-science?\" Some of the Church's priests have contributed to science. In various ways the Church has sought to affect Western attitudes to vice and virtue in diverse fields. It has, over many centuries, preached the teachings of Jesus within the Western World and remains a source of continuity linking modern Western culture to classical Western culture. == Influence == The Bible and Christian theology have influenced Western philosophers and political activists. BiBle and Law Christian teachings on sexuality and marriage have been influential. The cultural influence of the Church has been vast. Festivals like Easter and Christmas are marked globally as public holidays; Pope Gregory XIII's Gregorian Calendar has been adopted internationally. Year numbering in the West is taken from the assumed date of the birth of the Church's founder, Jesus of Nazareth. In the list of the 100 most influential people in human history there are 65 Christian figures from various fields. == Science == Christian scholars and scientists have made noted contributions to science and technology fields, as well as Medicine, both historically and in modern times.Baruch A. Shalev, 100 Years of Nobel Prizes (2003), Atlantic Publishers & Distributors, p.57: between 1901 and 2000 reveals that 654 Laureates belong to 28 different religions. Most (65.4%) have identified Christianity in its various forms as their religious preference. Some scholars and historians attribute Christianity to having contributed to the rise of the Scientific Revolution.Some scholars and historians attribute Christianity to having contributed to the rise of the Scientific Revolution: * * * * *Lindberg, David. (1992) The Beginnings of Western Science University of Chicago Press. p. 204. Most scientists of that time considered themselves Christian such as Nicolaus Copernicus,Pro forma candidate to Prince-Bishop of Warmia, cf. Dobrzycki, Jerzy, and Leszek Hajdukiewicz, \"Kopernik, Mikołaj\", Polski słownik biograficzny (Polish Biographical Dictionary), vol. XIV, Wrocław, Polish Academy of Sciences, 1969, p. 11. Galileo Galilei, Johannes Kepler,\"Because he would not accept the Formula of Concord without some reservations, he was excommunicated from the Lutheran communion. Because he remained faithful to his Lutheranism throughout his life, he experienced constant suspicion from Catholics.\" John L. Treloar, \"Biography of Kepler shows man of rare integrity. Astronomer saw science and spirituality as one.\" National Catholic Reporter, 8 October 2004, p. 2a. A review of James A. Connor Kepler's Witch: An Astronomer's Discovery of Cosmic Order amid Religious War, Political Intrigue and Heresy Trial of His Mother, Harper San Francisco. Isaac NewtonRichard S. Westfall – Indiana University and Robert Boyle. Protestantism has had an important influence on science. According to the Merton thesis, there was a positive correlation between the rise of English Puritanism and German Pietism on the one hand and early experimental science on the other. Google Print, pp. 320–321 Google Print, p.125 Robert K. Merton focused on English Puritanism and German Pietism as having been responsible for the development of the scientific revolution of the 17th and 18th centuries. He explained that the connection between religious affiliation and interest in science was the result of a significant link between the ascetic Protestant values and those of modern science. Copernicus, a Catholic priest, delayed publication of his work on heliocentrism until the year of his death. The theory attracted attention among scientists. Decades later, Galileo Galilei took an interest in astronomy, and raised the question more prominently. This brought the attention of the Committee for Propaganda of the Catholic Church, otherwise known as the Inquisition. He was tried, convicted, and forced to retract his published belief in heliocentrism. Centuries later, the Catholic church had lost interest in subjecting natural philosophy to dogma. The relation of the now separate Church of England to evolution was complicated by the lack of the centralised authority of a Pope. Many conservative clerics opposed evolution fiercely, whilst few liberal clerics saw conflict with their beliefs. Before he published the On the Origin of Species, Charles Darwin feared the reaction of the church, and spent years collecting evidence as defence to the expected criticism. Long after it was all but universally accepted, some Protestant leaders continued to resist evolution. ==References== Category:History of Christianity",
 "title": "Impact of Christianity on western civilization"
}