{
 "id": "324243",
 "text": "The Montreal Mission is a ringette team at Montreal, Canada. The team plays in the National Ringette League and plays its home games in Centre Étienne Desmarteau. ==Team history== The Montreal Mission have played in the National Ringette League since its formation in 2004. For several years, the best ringette team in Quebec is the Montreal Mission. On the other hand, the team ends in the second rank in the East Conference of the National Ringette League behind a team of the Ontario, the Cambridge Turbos and it since two seasons: 2010-11 and 2009-10. In 2008-09, Montreal Mission ends its season at the top of the classification of the east Conference with two points more than the Cambridge Turbos. Season Matchs Win Losses Lost with prolongation Points Goals for Goals against standings 2010-2011 22 19 3 0 38 193 87 2 2009-2010 31 27 2 2 56 241 100 2 2008-2009 31 29 1 1 59 254 96 1 2007-2008 29 13 15 0 27 144 162 8 ==World Championship connection== The world championships of ringuette occur once in three years. Several players of Montreal Mission were able to represent it their country of origin. The team includes notable players: Year world championships of ringuette 2010 Julie Blanchette , Stéphanie Séguin , Catherine Cartier 2007 Julie Blanchette , Stéphanie Séguin , Claudia Jetté , Melanie Thomas , Catherine Cartier 2004 Julie Blanchette , Stéphanie Séguin , Melanie Thomas == Leading scorers == In 2010-11, two players of Montreal Mission dominated the classification of the league with 141 points for Julie Blanchette 1st and 132 points for Catherine Cartier 2nd. In 2009-2010 these two same players dominated the classification with 122 points for (1st) Cartier, 110 points for Blanchette 2nd and in addition 83 points for Stéphanie Séguin 4th. Season Players Matchs joués Goals Assists Points Leading scorers 2010-2011 Julie Blanchette 31 61 80 141 1 (Best scorer in the League) 2009-2010 Catherine Cartier 31 77 45 122 1 (Best scorer in the League) 2008-2009 Julie Blanchette 31 54 80 134 2 2007-2008 Catherine Cartier 30 111 44 155 1 (Best scorer in the League) ==Current roster 2011-12== No Player Position S/G Age Birthplace 4 Katherine Fallon-Simard F L 25 St-Hilaire, Canada 10 Julie-Ève Finn D L 19 Iles-des-Sœurs, Canada 17 Natali St-Germain F L 20 Montréal, Canada 18 Lynn Despiegelaere F L 31 Montreal, Canada 27 Kim Aspirot F L 20 Repentigny, Canada 30 Laurie Mathieu G L 19 Boucherville, Canada 31 Kathleen Perreault G R 21 Montreal, Canada 33 Claudia Jetté G R 35 St-Laurent, Canada 36 Arielle Sanschagrin F R 19 Montréal, Canada 44 Julie Primard F R 29 St-Constant, Canada 47 Véronike Dufort D L 21 Sainte-Catherine, Canada 66 Stéphanie Séguin F L 30 St-Laurent, Canada 77 Kassy Chhim D L 35 Boucherville, Canada 79 Karine Seguin D L 31 Saint-Laurent, Canada 87 Edith King D L 26 Repentigny, Canada 93 Catherine Cartier C L 34 Montreal, Canada 96 Annie-Pier Séguin F L 22 Kirkland, Canada 99 Julie Blanchette C L 35 Montreal, Canada == Coaching staff 2011-12== * General Manager: France Levert * Head Coach: Daniel Dussault ==References== * Montreal Mission Roster, 2011-2012 Season * National Ringette League announces annual award winners ==Other websites == *The official website of Montreal Mission *The official website of National Ringette League - Canada * Ringette Canada Category:Sport in Montreal",
 "title": "Montreal Mission"
}