{
 "id": "324280",
 "text": "Interlingua is a planned language. It uses words that are found in most West- European languages. It was made by IALA. They are a group of people (the most known was Alexander Gode) that worked on it for more than 20 years. The first dictionary for the language was finished and published in 1951. Interlingua was created on the base of languages: English, French, Spanish, Portuguese, and Italian. == Spelling == The vowels in Interlingua are pronounced like in Spanish or LFN (another planned language). The consonants are pronounced, for the most part, like in English or LFN. Interlingua keeps much of the spelling of Latin words, more near to the forms in English and French than to them in the other Romance languages. For example, it keeps q ([k]), y ([i]), ch ([k]), ph ([f]), rh ([r]), and th ([t]). It keeps also the common use of double consonants. More, it allows versions like ch for [ʃ], s between vowels like [z], c before e/i like [ts], g before e/i like [ʒ], qu before e/i like [k], etc. Accent is not indicated, even in exceptions, but it follows, for the most part, a system of rules similar to that of LFN. === Collateral spelling === Interlingua has also a \"collateral\" spelling, that simplifies the complications above to a system more like this of Spanish or LFN. This collateral spelling has the same status, but in reality it is not much used by adherents. The details: #double letters are simplified, except ss, for example ecclesia > eclesia, adducer > aducer, interrogar > interogar. #vowel y becomes i, for example tyranno > tirano. #ph becomes f, for example phonetic > fonetic. #ch, when pronounced like k, becomes c, except before e o i, for example christo > cristo. #rh and th become r and t, for example rhetoric > retoric, pathetic > patetic. #g and gi, when pronounced like French j, become j, for example sage > saje, sagio > sajo. #-isar and derivations become -izar, for example civilisar > civilizar. #-te becomes -t, except when the accent is on the third syllable from the end, for example animate > animat. #-nne, -lle, and -rre become -n, -l, and -r, for example perenne > peren, belle > bel, bizarre > bizar. == Articles == *un - a/an *le - the *al - to the *del - of the == Nouns == The plural is -s after a vowel, -es after a consonant, but -hes after final c: *catto > cattos - cat > cats *can > canes - dog > dogs *roc > roches - rook > rooks (of chess) Interlingua has no grammatical gender. Some words distinguish female from male by changing -o into -a, or by adding -essa. Other ones have two different forms. But the most of words do not distinguish: *puero > puera - boy > girl *tigre > tigressa - male tiger > female tiger *rege > regina - king > queen *jornalista - journalist (male or female) == Adjectives == Adjectives do not change for agreement with nouns. They can precede or follow the noun, except numbers, that always precede the noun. In general, short adjectives precede and long adjectives follow. *belle oculos = oculos belle - beautiful eyes *un bon idea, un idea ingeniose - a good idea, an ingenious idea To compare, use plus or minus and le plus or le minus: *un plus feroce leon - a more ferocious lion *un traino minus rapide - a less rapid train *le plus alte arbore - the highest tree *le solution le minus costose - the less costly solution One can use the suffix -issime for the absolute superlative: *un aventura excellentissime - the most excellent adventure The adjectives bon, mal, magne (big), and parve (little) have alternative irregular forms : : bon › plus bon › le plus bon or bon › melior › optime mal › plus mal › le plus mal or mal › pejor › pessime magne › plus magne › le plus magne or magne › major › maxime parve › plus parve › le plus parve or parve › minor › minime == Adverbs == There are two kinds of adverbs: first form and second form. Adverbs of first form are a closed class of grammatical words, like quasi (almost), jam (already), and totevia (nevertheless). Adverbs of second form are an open class derived from adjectives by adding the suffix -mente (or -amente after final c): *felice > felicemente - happily *magic > magicamente - magically Some common adverbs have short alternative forms that end with -o: *sol > solmente > solo - only Like adjectives, adverbs use plus, minus, le plus, and le minus: *Illa canta plus bellemente que illa parla - She sings more beautifully than she speaks *Le gepardo curre le plus rapide de omne animales - The cheetah runs the most rapidly of all animals The adverbs of bon and mal have alternative irregular forms: : bonmente › plus bonmente › le plus bonmente or ben › plus ben › le plus ben or ben › melio › optimo malmente › plus malmente› le plus malmente or mal › plus mal › le plus mal or mal › pejo › pessimo == Pronouns == === Personal pronouns === singular singular singular singular singular plural plural plural plural plural person gender subject with preposition object reflective possession subject with preposition object reflective possession 1 – io me me me mi, mie nos nos nos nos nostre 2 – tu te te te tu, tue vos vos vos vos vostre 3 male ille ille le se su, sue illes illes les se lor, lore 3 female illa illa la se su, sue illas illas las se lor, lore 3 thing illo illo lo se su, sue illos illos los se lor, lore One can use the objective form for the direct object and the indirect object. Or, one can use the preposition a before the pronoun for the indirect object: *Le caffe es excellente: proba lo! - The cafe is excellent - taste it! *Dice me le conto; dice me lo (Dice le conto a me...) - Tell the story to me; tell it to me. The reflective pronouns are used when the subject of the verb is the same as the object (direct or indirect). Like in the Romance languages, the reflective is used much more than in English: *Deo adjuta les, qui se adjuta - God helps these who help themselves *Io me sibila un melodia - I whistle a melody to myself *Tu te rasava? - Did you shave yourself? *Francese se parla in Francia - French is spoken in France Regarding the forms of possession, the longer forms are used in constructions like le auto es le mie - the car is mine. But one can also use them more like strong adjectives than the short forms: *alicun amicos mie - some friends of mine *Matre mie! Es un piccante bolla de carne! - Mama mia! That is a spicy meatball! Much speakers use vos instead of tu for courtesy in formal situations: *Esque vos passava un viage placente, Seniora Chan? - Did you have a nice journey, Mrs Chan? *Aperi vostre valise, Senior - Open your suitcase, sir Use illes for groups of persons with both men and women. Illas can be used for groups of only women. === Impersonal pronouns === Il is an impersonal pronoun for using in constructions like il pluve (it rains). Il can also be used when the real subject is a clause that occurs later in the sentence. *Il deveni tarde - It is becoming late *Il es ver que nos expende multe moneta - It is true that we spend much money *Es bon que vos veni ora - It is good that you come now On is the pronoun used when the identity of the subject is not clear. The form for objects is uno: *On non vide tal cosas actualmente - One is not seeing such things just now *On sape nunquam lo que evenira - One knows nothing that will happen *On construe un nove linea de metro al centro urban - One constructs a new line of subway to the centre of the city *On collige le recyclabiles omne venerdi - One collects the recyclables every Friday *Tal pensatas afflige uno in le profundo del depression - Such thoughts afflict one in the depth of depression === Demonstrative pronouns === demonstrative pronouns demonstrative pronouns demonstrative pronouns demonstrative pronouns demonstrative pronouns role number gender near distant adjective – – iste ille pronoun singular male iste ille female ista illa thing isto illo plural male istes illes female istas illas thing istos illos The major forms are the adjective iste or ille and the pronoun iste, ista, and isto, that can be plural. When the subject of a sentence has two possible predecessors, iste refers to the second predecessor. *Iste vino es pessime - This wine is worst *Isto es un bon idea - This is a good idea *Janet accompaniava su soror al galeria - Janet accompanied her sister to the gallery **(a) Illa es un artista notabile - Janet is a notable artist **(b) Ista es un artista notabile - The sister is a notable artist The adjective of distance is ille o aquelle. The pronouns are the same as the personal pronouns. *Io cognosce ille viro; ille se appella Smith - I know that man; his name is Smith *Illo es un obra magnific - That is a magnificent work === Relative and interrogative pronouns === The relative pronouns for persons and animals are qui (subject and after prepositions) and que (object): *Nos vole un contabile qui sape contar - We want an accountant who knows counting *Nos vole un contabile super qui nos pote contar - We want an accountant on who we can count *Nos vole un contabile que le policia non perseque - We want an accountant whom the police do not pursue The relative pronoun for things is que for all uses: Il ha duo sortas de inventiones: illos que on discoperi e illos que discoperi uno - There are two kinds of inventions: those which you discover and those which discover you Cuje - \"whose\" or \"of which\" - is used for persons and things: *un autor cuje libros se vende in milliones - an author whose books are sold in millions *un insula cuje mysterios resta irresolvite - an isle of which mysteries remain irresolved All they above can be replaced by le qual or le quales: *Mi scriptorio esseva in disordine – le qual, nota ben, es su stato normal - My desk were in disorder - which, note well, is its normal state *Duo cosinos remote, del quales io sape nihil, veni visitar - Two distant cousins, of which I know nothing, come to visit The relative pronouns are also used as interrogative pronouns. == Verbs == These are the most common forms of verbs (note exceptions in underlined letters): ending -ar -er -ir Infinitive -r parlar (\"to speak\") vider (\"to see\") audir (\"to hear\") Present - parla vide audi Past -va parlava videva audiva Future -ra parlara videra audira Hypothetical -rea parlarea viderea audirea Active participle -(e)nte parlante vidente audi _e_ nte Passive participle -te parlate vid _i_ te audite The verbs do not vary for persons and plural, except for alternative versions for esser. The tenses normal are used for the subjunctive and the command. Esse, habe, and vade have forms short for the present: es, ha, and va. === Infinitives === Infinitives are used for both the infinitive and the gerund, and can be pluralized if needed: *Cognoscer nos es amar nos - To know us is to love us *Il es difficile determinar su strategia - It is difficult to determine his strategy *Illes time le venir del locustas - They fear the coming of the locusts *Le faceres de illa evocava un admiration general - Her actions evoked the general admiration === Simple tenses === There are three simple tenses - past, present, and future. They are used for both the perfect (completed) and the imperfect, and for both the perfective and the non-perfective (continuing). *Io ama mangos; io mangia un justo ora - I love mangos; I am eating one right now *Mi auto es vetere e ha multe defectos: naturalmente illo va mal! - Me car is old and has many defects; naturally it goes badly! *Io vos diceva repetitemente: le hospites jam comenciava partir quando le casa se incendiava - I told you repeatedly: the guests were already beginning to leave when the house was set on fire *Nos volara de hic venerdi vespere, e sabbato postmeridie nos prendera le sol al plagia in Santorini - We will fly from here Friday evening, and Saturday afternoon we will be taking the sun at the beach in Santorini *Si ille faceva un melior reclamo, ille venderea le duple - If he made advertisings more good, he would sell twice === Participles === Participles formation in Interlingua follows this simple pattern: Participles formation Verb Present part. Past part. Example \\- ar stem + -nte stem + -te Amante / Amate \\- er stem + -nte stem + -ite Vidente / Vidite \\- ir stem + -ente stem + -te Dormiente / Dormite *un corvo parlante - a speaking crow *Approximante le station, io sentiva un apprehension terribile - Approaching the station, I felt an awful apprehension *un conto ben contate - a well told story *La Beltate dormiente - The Sleeping Beauty === Composed tenses === Instead of the simple tenses, one can use composed forms. For the past, one can use ha and other forms of habe, with the past participle: *Le imperio ha cadite - The empire has fallen For the future, use va and other forms of vade, with the infinitive: *Io va retornar - I will return Used rarely, velle with the infinitive is the hypothetical composed: *Io velle preferer facer lo sol - I would prefer to do it alone The passive is formed by using es or other forms of esser with the passive participle: *Iste salsicias es fabricate per experte salsicieros - These sausages are made by expert sausage makers The passive to the Past Perfect is created by using habeva essite with the passive participle: *Nostre planeta habeva essite surveliate durante multe annos - Our planet has been surveyed for many years === Other forms === Here are examples of various forms of commands: *Face lo ora! - Do it now! *Le imperatrice desira que ille attende su mandato - The empress wants him attend to her command *Va tu retro al campo; resta vos alteros hic - You: return to the camp; The rest of you: stay here *Cliccar hic - Click here *Que tu va via! - I want you to go away! *Que illes mangia le tortas - Let them eat cake / They can eat cakes *Que nos resta hic ancora un die / Vamos restar hic ancora un die - They must still remain here for a day / Let we still remain here for a day Sia is the interrogative form and the subjunctive of esser: *Sia caute! - Be cautious! *Sia ille vive o sia ille morte... - Whether he is live or he is dead... *Que lor vita insimul sia felice! - Let their life together be happy! === Alternative versions of esser === Because the verb esser is irregular in many European languages, Interlingua allows the use of versions: *es - present *sia - command and subjunctive *era - past *sera - future *serea - hypothetical Some persons use also these forms of esser in the present tense: *son - plural *me so, nos somos (much rarely) === Verbs with two roots === Because Interlingua is a \"neo-Latin\" language, it keeps any of the double roots of Latin that survive in the Romance languages and English. For example: *sentir (\"to feel\") > sen _t_ imento, sen _s_ or *repeller (\"to repulse\") > rep _ell_ ente, rep _uls_ ive *ager (\"to act\") > a _g_ ente, a _ct_ or Many speakers of Interlingua prefer the use of the more recognizable form in international vocabularies, and drop the other ones. == Syntax == The normal order of words in Interlingua is subject-verb-object, but one can use other orders if the meaning is clear: *Ille reface horologios - He repairs clocks *Amandolas ama io tanto, io comprava un amandoliera - I love almonds so much that I bought an almond orchard But pronouns tend to follow the order of the Romance languages - subject-object-verb - except for infinitives and commands, that has the object after the verb: *Ille los reface - He repairs them *Nos vole obtener lo - We want to obtain it *Jecta lo via! - Throw it away! If two pronouns - first the object direct and second the indirect object - occur with the same verb, the indirect object goes first: *Io les lo inviava per avion - I sent it to them by plane *Io la los inviava per nave - I sent them to her by ship === Questions === One can form questions in different ways: 1\\. By putting the verb before the subject: *Ha ille arrivate? - Has he arrived? *Cognosce tu ben Barcelona? - Do you know Barcelona well? *Te place le filmes de Quentin Tarantino? - Do you like the films by Quentin Tarantino? 2\\. By using a word of question instead of the subject: *Qui ha dicite isto? - Who has said this? *Que cadeva super te? Un incude - What fell on you? An anvil 3\\. By adding the particle esque (or, more rarely, an) to the beginning of the sentence: *Esque illa vermente lassava su fortuna a su catto? - Did she leave her fortune to her cat? 4\\. By change the tone of the sentence, or by adding a question mark, without change the normal order: *Tu jam ha finite tu labores? - Have you already finished your work? == References == *Gode, Alexander, and Hugh E. Blair. Interlingua: a grammar of the international language. Storm Publishers, New York, 1951. Category:Interlingua Category:Grammars of specific languages",
 "title": "Interlingua grammar"
}