{
 "id": "324239",
 "text": "Mr. Meaty is an American/Canadian television series, airing on CBC Television in Canada and the Nickelodeon in the United States. It originally began in 2005, as a series of shorts that aired on Nickelodeon. The show features puppets working at a fast food restaurant called Mr. Meaty. ==History== The show began as a series of shorts featured on CBC's The Void and in-between shows on Nickelodeon. Many of the original shorts can still be found on iTunes and TurboNick. ==Characters== * Josh Redgrove is the 16-year-old cashier and the smarter of the two Mr. Meaty employees. He is the main character. Josh is into dating and girls and is often seen hitting on his female customers. He also enjoys making movies, indie-punk, and acting cool. His ambition is to become a filmmaker/rock star. On his job application, he mentions that he enjoys buttering bread and fixing holes. He is voiced by Jamie Shannon. * Parker Dinkleman is the 15-year-old fry cook at Mr. Meaty. Dim-witted and dirty, Parker enjoys making movies with his friend Josh and cooking foods. Unfortunately, his gross habits scare away girls that Josh is talking to, and for this reason, Parker can be considered Josh's foil. His special skills that he wrote on his job application were \"Nunchucks and stopping kids from running\". Parker also used to be a member of the Bear Cub Scouts. He is voiced by Jason Hopley. * Doug the Mall Cop is the beefy security guard with a buzz haircut, black shades, and a prominent bottom lip. He speaks with a macho attitude and is very dedicated to his job. He can be friendly to the kids of the mall, or pretty aggressive to troublemakers. In the episode, \"Wedgelor,\" he thwarts the demon by going \"commando\" that day to work. He is terrified of zombies, and was trained in the martial arts (presumably by Ping, who works at Chop Schtick), and died. He seems to have a liking towards Josh and Parker, and wanted to be a hero to them (to the point of lying by pretend that he fought an army of zombies and even helped them with their movie). He is voiced by Todd Doldersum. * Edward R. Carney is Mr. Meaty's 109-year-old founder and CEO (as pointed out in Mr. Meaty Employee Training Video #77), previously cryogenically frozen. Carney serves as the main villain in a few episodes. He will not rest, until every man, woman and child has a Mr. Meaty meal 5 times a day. He claims that he had nothing, but a bathtub full of pork butt and according to him, he rules \"the ninth largest meat buffet in the universe\". He is voiced by Marty Stelnick. * Mr. Wink is the manager. He is hinted to have once been kind, but Carney used the electric chip to turn him cold, bitter, and robotic. His ancestor from many generations ago signed a contract, that forces him to work at Carney's side. Apparently, his opinion on being shocked is not as bad as it used to be; in the first few times, he would respond with terror, but later, he seems to see it coming, as he responds with a sarcastic \"Oh, here it comes.\" before being electrocuted. He is voiced by Todd Doldersum. ==Reception== Mr. Meaty received a great deal of criticism from vegetarians and parents who didn't like the gross-out humor. Many petitions were signed and sent to Nickelodeon to end the show. == Other websites == * CBC's Mr. Meaty Page * Nickelodeon's Mr. Meaty Page * * * Category:Canadian animated television series Category:2000s American animated television series Category:American teen television series Category:2006 American television series debuts Category:2000s teen television series Category:2009 American television series endings Category:Puppets Category:2000s American comedy television series Category:2006 Canadian television series debuts Category:2009 Canadian television series endings Category:American children's television series Category:Canadian children's television series Category:American animated television series Category:2000s American sitcoms Category:2000s animated television series",
 "title": "Mr. Meaty"
}