{
 "id": "324276",
 "text": "Julie Blanchette (born January 9, 1977 in Montreal, Canada) is a Canadian professional ringette player. She plays center position. Blanchette plays for the Montreal Mission of the National Ringette League. She is also a member of the Canadian national women's ringette team. == Sporting career == Blanchette started playing ringette when she was 4 years old.Blanchette Profile Her brother played ice hockey, and her parents looked for a team game for her. They signed her up with the local ringette club in Montreal. She played her sport at every amateur level in Montreal. She represented Quebec in the Canadian championships and the Canada Games. Blanchette has been at the professional elite level since 2003. She plays for Montreal Mission in the National Ringette League in Canada. In 2005, she played a season for the club Turun Ringet Turku in the professional ringette league of Finland. Since 2004, she has been a member of the ringette national team of Canada. She played in the Ringette World championships of 2004 in Stockholm, of 2007 in Ottawa and of 2010 in Tampere. She also played in the world championships of 2008 to Sault Ste-Marie. She is captain of the Canadian national team and Montreal Mission. She is also a trainer and a coach. She is the trainer of the national Team Canada Under-19 years during the world Championships Under-19 years of 2009 in Prague. In September 2011, Blanchette was named an assistant-coach of the national team of Canada. == Statistics == === in club === Season by season Season Team League Regular Season Playoffs Games play Goals Assists Points Penalties Games play Goals Assists Points Penalties 2007-08 Montreal Mission NRL 30 48 78 121 8 - - - - - 2008-09 Montreal Mission NRL 31 54 80 134 12 3 1 6 7 4 2009-10 Montreal Mission NRL 31 59 51 110 12 2 2 3 5 4 2010-11 Montreal Mission NRL 31 61 80 141 12 7 9 14 31 0 2011-12 Montreal Mission NRL 23 38 52 90 14 7 9 22 31 0 === International level === Statistics by competition Year Event Games Play Goals Assists Points +/- Punishments Minutes Result 2004 Ringette World championships n/a n/a n/a n/a n/a n/a Won Silver Medal 2007 Ringette World championships 4 5 10 15 - 8 Won Silver Medal 2008 World championships of clubs 5 10 14 24 - 8 Montreal Mission finish 5nd 2010 Ringette World championships 6 1 8 9 - 0 Won Silver Medal == Honors == * Won Gold Medal in nine times in Provincial champion of Quebec : in 1995, in 1996, in 1997, in 1998, in 1999, in 2000, in 2003, 2004 and 2005. * Won Gold Medal in 8 Canadian Championships of ringette. * Won Silver Medal in the Canadian Championship of 2000 to Prince Georges * Won Silver Medal in the 2004 world Championships * Won Silver Medal in the 2007 World Championships o * Won Bronze Medal as coach of the team of Quebec in the 2007 Winter games of Canada. * Won Silver Medal as coach of the national team Canada is U-19 in the world Championships Under 19 years in August, 2009 in Prague, in Czech Republic. * Won Silver Medal in the 2010 World championships *Top scorer of the club Montreal Mission and the 2nd top scorers in the existence of the National Ringette League in Canada. *Top Canadian scorers during the World Championship of clubs in 2008 with *Champion of top scorers for the season 2010-11 in the National Ringette League in Canada (with individual stats of 61 goals and 80 assists (for a total of 141 points) * Selected on the team of stars during Canadian championship of 2000 in Prince George. * Selected on the team of stars during championships Canadian of 2005 in Winnipeg. *Elected a MVP Player 2005-06 season and 2008-09 season in the National Ringette League. == Personal life== Blanchette also plays golf and runs in marathons. ==References== ==Other websites == * Profile of Julie Blanchette for Montreal Mission * Profile of Julie Blanchette for Canadian National Team * A ringette star for the West End, The Monitor, April 26 2007. Category:1977 births Category:Living people Category:People from Montreal Category:Sportspeople from Quebec",
 "title": "Julie Blanchette"
}