{
 "id": "324346",
 "text": "The Australian Broadcasting Corporation, (ABC) is the national broadcaster of Australia.Budget Paper No. 4 2010–2011, Retrieved 3 January 2012 \"http://www.budget.gov.au/2010-11/content/bp4/html/bp4_agency_resourcing_4_bcde.htm \" It is principally funded by direct grants from the Australian Government and is administered by a government-appointed board. The ABC is a publicly-owned body that is politically independent and fully accountable, with its charter enshrined in legislation, the Australian Broadcasting Corporation Act 1983. ABC Commercial, a profit-making division of the corporation, also helps to generate funding for content provision. The ABC was established as the Australian Broadcasting Commission on 1 July 1932 by an act of federal parliament. changed the name of the organisation to the Australian Broadcasting Corporation, from 1 July 1983. Although funded and owned by the government, the ABC remains editorially independent. This independence is part of the Australian Broadcasting Corporation Act 1983. It effectively replaced the Australian Broadcasting Company, a private company established in 1924 to provide programming for A-class radio stations. The ABC was given statutory powers that reinforced its independence from the government and enhanced its news-gathering role. Modelled after the British Broadcasting Corporation (BBC), which is funded by a television licence, the ABC was originally financed by consumer licence fees on broadcast receivers. However, the licence fees soon proved to be insufficient due to Australia's small population compared with the vast area to be serviced and the need for individual divisions in each state such that by 1949 the Chifley government decided that the ABC would be directly funded by the government. Licence fees however continued to be collected until 1947, however they were subsumed into the government's general revenue. Later funding was supplemented with commercial activities related to its core broadcasting mission. The ABC adopted its current name in 1983. The ABC provides radio, television, online, and mobile services throughout metropolitan and regional Australia. ABC Radio operates four national networks, a large number of ABC Local Radio stations, several digital stations, and the international service Radio Australia. ABC Television operates five free-to-air channels, as well as the ABC iview streaming service and the ABC Australia satellite channel. News and current affairs content across all platforms is produced by the news division. ==Radio== The ABC has 46 local radio stations, four national networks and international service Radio Australia. It also has three digital radio stations. ABC Local Radio has 46 individual stations, each with a similar format. This format is locally presented light entertainment, news, talkback, music, sport and interviews. It also has some national programs such as AM snd PM (current affairs), The World Today, sporting events and Nightlife. ABC Radio National broadcasts more than 60 special interest programs every week. These cover a range of topics including music, comedy, book readings, radio dramas, poetry, science, health, the arts, religion, social history and current affairs. ABC NewsRadio is a continuous news service. It was known as the Parliamentary and News Network. It was set up to broadcast sittings of the Australian Federal Parliament, and to provide a news service at other times. The network broadcasts news on a 24 hours a day, seven days a week, with updates on the quarter-hour. Much of the news content is produced by the ABC itself, however many programs come from the BBC World Service, NPR, Deutsche Welle, Radio Netherlands and CNN Radio. ABC Classic FM was the ABC's first FM radio service. It was originally called \"ABC FM\". Its format was based on community stations and BBC Radio 3. Triple J is a national youth radio network. It plays contemporary alternative and independent music. Its audience is people aged 18–35. While the network plays music from around the world, it has a strong focus on local artists. Triple J was formerly known as \"Double Jay\" when it launched in Sydney on 19 January 1975. ==Television== The ABC operates four TV channels. ABC TV, the Corporation's original television service, receives most of funding for television and shows new comedy, drama, documentaries, and news and current affairs. In each state and territory a local news bulletin is shown at 7.00 p.m. nightly. In 2001 ABC TV began its digital service. ABC TV Plus which began in 2005, is a digital-only channel that shows mainly repeated programs from ABC TV. It does have some original content including news programs, children's shows, animation, and music shows. ABC Me is a children's TV channel which began on 4 December 2009. ABC News is a 24-hour news channel which began on 22 July 2010. ==References== Category:Australian television networks Category:Television networks Category:Radio Category:1923 establishments in Oceania Category:1920s establishments in Australia",
 "title": "Australian Broadcasting Corporation"
}