{
 "id": "324476",
 "text": "Pharrell Lanscilo Williams (; born April 5, 1973) is an American singer, songwriter, rapper, record producer, fashion designer, and entrepreneur. Williams and Chad Hugo are members of The Neptunes. They produce hip hop, pop and R&B; music. He is also the lead vocalist of the band N*E*R*D. He formed the band with Hugo and childhood friend Shay Haley. He released his first single \"Frontin'\" in 2003. His first studio album In My Mind was released in 2006. As part of the Neptunes, Williams has produced many singles for various musicians. These artists include Jay-Z, Backstreet Boys, Blackstreet, Ludacris, Rage Against the Machine, Britney Spears, Busta Rhymes, Garbage, Mary J. Blige, and Usher. The two have earned three Grammy Awards in ten nominations. He is also the co-founder of the streetwear brands Billionaire Boys Club and Ice Cream footwear. Williams became more well-known worldwide during 2013 and 2014, when he was featured on Robin Thicke's single \"Blurred Lines\" with T.I. (which he produced) and released his own single, \"Happy\", for the movie Despicable Me 2. Both songs reached number one in several countries around the world, including the United States, United Kingdom, Canada, and Australia. He was also featured on Daft Punk's single \"Get Lucky\", another international chart-topper. ==Personal life== Williams and model/designer Helen Lasichanh have a son, Rocket Williams (born in 2008). The couple married on October 12, 2013. In January 2017, the couple welcomed triplets. ==Discography== ===Solo albums=== * In My Mind (2006) * Girl (2014) ==References== 01 Category:20th-century American musicians Category:20th- century American singers Category:21st-century American singer-songwriters Category:African-American singers Category:American fashion designers Category:1973 births Category:Living people Category:American record producers Category:American R&B; singers Category:American funk singers Category:American pop singers Category:American hip hop singers Category:American pop rappers Category:People from Virginia Beach, Virginia Category:Rappers from Virginia Category:Singers from Virginia",
 "title": "Pharrell Williams"
}