{
 "id": "324594",
 "text": "Futsal is a sport that is like association football, but on hard court. It is played on indoor courts by two teams with five players each. Its name is short for futebol de salão, which means \"room football\" in the Portuguese language, or fútbol de sala, which is the same in the Spanish language. Futsal is most popular in European countries, like Portugal, Spain, Italy, Russia and Kazakhstan and South American countries, like Brazil, Argentina and Uruguay. However, it is also played in many other countries. The pitch is between 38 and 42 meters long and between 20 and 25 meters wide. This is shorter and narrower than football. The pitch is a hard court and smooth, unlike grass in football. The halves of the game are both twenty minutes long, shorter than the usual 45 minutes in football. There are 6 players on the court in total, including the goalkeeper. Substitutions are unlimited, and the maximum number of subs is 9. Players who break the rules can get yellow or red cards. If a player gets a red card, they can't play in that game anymore. The team that got the red card also has to play with one less player for two minutes or until the other team scores a goal. Another difference from football is that when the ball goes out, instead of throwing it back in, it is kicked in. There is also no offside in futsal. A teacher from Uruguay called Juan Carlos Ceriani made the game in 1930. The rules were made in Sao Paulo, Brazil in 1933. He used rule templates from Football (soccer), Basketball, and Handball. A World Championship was held in 1971 in Rio de Janeiro, Brazil. The first Futsal World Cup was in 1989 in Rotterdam, Netherlands. Since 1992 it is played every 4 years. In the 2016 Summer Olympics, Futsal was played for the first time in the Olympics. == The importance of the futsal rules == The importance of futsal are the rules. There is a 6 second rules on the goalkeeper if they hold it longer it is a foul called on the goalkeeper. I will add the importance of no throw ins you have to set the ball on the floor and play. Free-kicks have to be 2 touch and the wall has to be 2 feet or 3 feet away The goalkeeper punts are not allowed in futsal , It is a closed area or open with a net or ceiling on top. Soccer and futsal are very different. Soccer is a sport that is played on a way bigger pitch with 10 players (110 by 100m long and 75 by 64 m wide) and it has different motion throughout the game like how the ball moves fast , slow you may never know. Futsal has about 5-6 players and the pitch is 3x smaller than a soccer pitch and it is about (25 - 42 m long 16 - 20 m wide). There are no slide tackles or else the is a foul called on you. Their is headers available but futsal is usually played fast and on the floor. If the ball touches the top net or ceiling it is the other teams ball. == FIFA Futsal World Cup winners == * Netherlands 1989: Brazil * Hong Kong 1992: Brazil * Spain 1996: Brazil * Guatemala 2000: Spain * Chinese Taipei 2004: Spain * Brazil 2008: Brazil * Thailand 2012: Brazil * Colombia 2016: Argentina * Lithuania 2021: Portugal * Uzbekistan 2024: Brazil == References == Category:Indoor sports",
 "title": "Futsal"
}