{
 "id": "324726",
 "text": "Edward Osborne Wilson (June 10, 1929 - December 26, 2021) was an American biologist, naturalist and author. He was an entomologist who studied ants, but to the public he is known for sociobiology, biodiversity and conservation. Wilson's writing has been very influential. He was a two-time winner of the Pulitzer Prize for general non-fiction. He was known for his role as \"the father of sociobiology\", his environmentalism, and his secular humanist and deist ideas on religion and ethics. He worked at Harvard University, and was a Fellow of the Committee for Skeptical Inquiry. He was a Humanist Laureate of the International Academy of Humanism.\"E.O. Wilson Profile\" - Comprehensive list of Degrees, Awards and PositionsArchive.org; E. O. Wilson biography He was awarded the National Medal of Science (1977), and the Crafoord Prize (1990), which recognizes research in scientific fields not eligible for the Nobel Prize. == Career == Wilson's work (and books) fell into at least four categories: #Ants. He was the twentieth century's leading expert on these insects. #Sociobiology. He created the term and wrote the book. He applies evolution and genetics to the study of human nature.Alexander R.D. 1979. Darwinism and human affairs. University of Wisconsin Press, p65. Stevenson, Leslie and Haberman, David L. 2009. Ten theories of human nature. 5th ed, Oxford University Press. . Chapter 10: Darwinian theories of human nature. p226–230 This part of his work has been highly controversial. The term is not as often used as it was before. The idea of evolutionary psychology is becoming more popular. #Biodiversity and conservation. This part of his work is agreed by many other experts. #Unity of knowledge. He argues that all knowledge – including humanities and social sciences – should be a kind of unified science. This is a philosophical view which has been put forward several times before.p228 ==Death== Wilson died on December 26, 2021 in Burlington, Massachusetts at the age of 92. == Books == * 1967. The theory of island biogeography, with Robert MacArthur. Princeton University Press. 2001 reprint: * 1971. The insect societies. Harvard University Press. * 1975. Sociobiology: the new synthesis. Harvard University Press. 25th anniversary edition, 2000: * 1979. On human nature. Harvard University Press. * 1981. Genes, mind and culture: the coevolutionary process. Harvard University Press. * 1983. Promethean fire: reflections on the origin of mind. Harvard University Press. * 1984. Biophilia, Harvard University Press. * 1990. Success and dominance in ecosystems: the case of the social insects. Inter-Research. ISSN 0932-2205 * 1990. The Ants, with Bert Hölldobler. Harvard University Press. , Winner of the Pulitzer Prize * 1992. The diversity of life Harvard University Press. ; The diversity of life: special edition. * 1993. The biophilia hypothesis, with Stephen R. Kellert. Shearwater Books. * 1994. Journey to the ants: a story of scientific exploration, with Bert Hölldobler. Harvard University Press. , * 1994. Naturalist. Shearwater Books. * 1996. In search of nature, with Laura Simonds Southworth. Shearwater Books. * 1998. Consilience: the unity of knowledge. Knopf. * 2002. The future of life, Knopf. * 2003. Pheidole in the New World: a dominant, hyperdiverse ant genus. Harvard University Press. * 2005. From so simple a beginning: Darwin's four great books. W.W. Norton, New York. Edited, with introductions by Edward O. Wilson. * 2006. The creation: an appeal to save life on Earth. W.W. Norton, New York. * 2006. Nature revealed: selected writings 1949-2006. *2009. The Superorganism: the beauty, elegance, and strangeness of insect societies, with Bert Hölldobler. W.W. Norton, New York. *2010. Anthill: a novel. W.W. Norton, New York. *2010. Kingdom of Ants: Jose Celestino Mutis and the dawn of natural history in the New World, with José María Gómez Durán. Johns Hopkins University Press, Baltimore. *2011. The Leafcutter Ants: civilization by instinct, with Bert Hölldobler. W.W. Norton, New York. *2012. The Social Conquest of Earth. Liveright, New York. *2014. Letters to a Young Scientist. Liveright. *2014. A Window on Eternity: A Biologist's Walk Through Gorongosa National Park. Simon & Schuster. *2014. The Meaning of Human Existence. Liveright. *2016. Half-Earth. Liveright. *2017. The Origins of Creativity. Liveright. ==Related pages== *Daniel Clarence Quinn == References == Category:1929 births Category:2021 deaths Category:American biologists Category:Writers from Birmingham, Alabama Category:Harvard University alumni Category:Pulitzer Prize winners Category:Foreign Members of the Royal Society Category:Scientists from Birmingham, Alabama Category:Humanists Category:American entomologists",
 "title": "E. O. Wilson"
}