{
 "id": "32473",
 "text": "The European Court of Human Rights (ECtHR) hears and decides particular type of complaints. These complaints relate to abuse of human rights. ECoHR’s other popular name is \"Strasbourg Court\". Member countries of the Council of Europe created ECoHR to arrange all such complaints, listen to the complaints, and to give decisions. European Convention on Human Rights tells about many human rights. ECoHR sees that people should enjoy all these human rights. ECoHR' has a number of judges. The number of judges is seven normally but at the case of dealing a great issue, the number will be 21 and the judges are equally from member countries of the Council of Europe. At present, there are forty seven member countries of the Council of Europe. Each country may have one judge in the ECoHR. But, judges work independently for the ECoHR, and not for their country. ==Judges== Name Country Position Elected Term Ends Dean Spielmann Luxembourg President 2004 Josep Casadevall Andorra vice-president 1998 Guido Raimondi Italy vice-president 2010 Ineta Ziemele Latvia Section President 2005 Isabelle Berro-Lefèvre Monaco Section President 2006 Mark Villiger Liechtenstein Section President 2006 Boštjan Zupančič Slovenia Judge 1998 Elisabeth Steiner Austria Judge 2001 Alvina Gyulumyan Armenia Judge 2003 Khanlar Hajiyev Azerbaijan Judge 2004 Ján Šikuta Slovakia Judge 2004 Dragoljub Popović Serbia Judge 2005 Päivi Hirvelä Finland Judge 2007 George Nicolaou Cyprus Judge 2008 Luis López Guerra Spain Judge 2008 András Sajó Hungary Judge 2008 Mirjana Lazarova Trajkovska Macedonia Judge 2008 Ledi Bianku Albania Judge 2008 Nona Tsotsoria Georgia Judge 2008 Ann Power-Forde Ireland Judge 2008 Zdravka Kalaydjieva Bulgaria Judge 2008 Ayşe Işıl Karakaş Turkey Judge 2008 Nebojša Vučinić Montenegro Judge 2008 Kristina Pardalos San Marino Judge 2009 Ganna Yudkivska Ukraine Judge 2010 Vincent De Gaetano Malta Judge 2010 Angelika Nussberger Germany Judge 2011 Julia Laffranque Estonia Judge 2011 Paulo Pinto de Albuquerque Portugal Judge 2011 Linos-Alexandre Sicilianos Greece Judge 2011 Erik Møse Norway Judge 2011 Helen Keller Switzerland Judge 2011 André Potocki France Judge 2011 Paul Lemens Belgium Judge 2012 Helena Jäderblom Sweden Judge 2012 Paul Mahony United Kingdom Judge 2012 Aleš Pejchal Czech Republic Judge 2012 Johannis Silvis Netherlands Judge 2012 Krzysztof Wojtyczek Poland Judge 2012 Valeriu Gritco Moldova Judge 2012 Faris Vehabović Bosnia and Herzegovina Judge 2012 Ksenija Turković Croatia Judge 2012 Dmitry Dedov Russia Judge 2013 Egidijus Kūris Lithuania Judge 2013 Robert R Spano Iceland Judge 2013 Iulia Motoc Romania Judge 2013 Jon Fridrik Kjølbro Denmark Judge 2014 ==References== Category:Human rights Category:Council of Europe Category:Courts (law)",
 "title": "European Court of Human Rights"
}