{
 "id": "324975",
 "text": "Animal color (or coloration) is produced by light reflecting from an animal's surface. The ways animals produce colors include pigments, chromatophores and other structures, and bioluminescence. Since sight is usually so important to animals, and is so often used by predators as a long-range way to find prey, an animal's color must serve one or more functions. These functions, such as finding prey, or evading capture, or finding a mate, are absolutely essential for life and survival. Therefore, animal color is determined by natural selection because it affects the survival of animals and their offspring. Some of the most obvious functions of color are: # Camouflage: enabling an animal to remain hidden from view # Signalling to other animals ## Warning coloration: signalling to other animals not to attack ## Mimicry: taking advantage of another species' warning coloration ## Sexual selection: finding a mate ## Other kinds of signalling # Diversion ## Startle defence: unexpected flashes of color or eyespots ## Dazzle: confusing a predator by moving a bold pattern (such as zebra stripes) rapidly # Physical protection: such as humans in tropical climates have dark skin pigments which protect against sunburn and skin cancer. # Incidental coloration. This is common in plants, which have green leaves because chlorophyll is green. In animals it is rare, such as having red blood (haem, needed to carry oxygen, is red). However, when the red shows on the surface it is often due to selection, as in human red lips. Overwhelmingly, the most common function of color is in predator-prey relationships. \"Anti-predator adaptations occur in every biome of the world and in almost every taxonomic group\".Ruxton G.D; Sherratt T.N. and Speed M.P. 2004. Avoiding attack: the evolutionary ecology of crypsis, warning signals and mimicry. Oxford University Press. Animal color has been a topic of interest and research in biology for a long time. According to Charles Darwin's 1859 theory of natural selection,Darwin C. 1859. On the origin of species. Murray, London. features such as coloration evolved by providing individual animals with a reproductive advantage. For example, individuals with slightly better camouflage than others of the same species would, on average, leave more offspring.Darwin C. 1859, chapter 4, discusses the effects of natural selection on animal coloration: \"When we see leaf-eating insects green, and bark-feeders mottled-grey; the alpine ptarmigan white in winter, the red-grouse the color of heather, and the black-grouse that of peaty earth, we must believe that these tints are of service to these birds and insects in preserving them from danger. Grouse, if not destroyed at some period of their lives, would increase in countless numbers; they are known to suffer largely from birds of prey; and hawks are guided by eyesight to their prey, so much so, that on parts of the Continent persons are warned not to keep white pigeons, as being the most liable to destruction. Hence I can see no reason to doubt that natural selection might be most effective in giving the proper color to each kind of grouse, and in keeping that color, when once acquired, true and constant\". == Startle and dazzle defences == Animals can have a camouflage defence at distance, but when faced by a predator they may switch to a 'flash' defence to gain time and distract the predator. The predator often blinks or turns its face away in self-defence. This is a reflex act which is there to protect its vital facial area. In the second the predator blinks, the prey flies or jumps, and lands in camouflage again. This pattern of color plus behaviour is quite common.Castner, James L. 1995. Defensive behavior and display of the leaf-mimicking katydid Pterochroza ocellata (Orthoptera: Tettigoniidae: Pseudophyllinae: Pterochrozini). Journal of Orthoptera Research. #4, August. It is called deimatic defence by textbooks,Edmunds M.A. 1974. Defence in animals: a survey of anti-predator defences. Longman, London. from the Greek for 'dread' or 'to frighten'. == Related pages == *Camouflage *Defence against predators *Mimicry *Sexual dimorphism *Warning coloration *Evolution of color vision == References == Category:Evolutionary biology",
 "title": "Animal colour"
}