{
 "id": "325348",
 "text": "Smosh is an American web-based comedy duo. The members are Ian Hecox and Anthony Padilla who have been on YouTube since 2005. Today they have over 5 different channels, over a thousand videos on their main channel and over 26.88 million subscribers and 11 billion viewers. ==History== Smosh started as early as 2002 when Anthony Padilla created a website named smosh.com and started adding different Flash animation. He said that the name \"Smosh\" came from the time where he mistook a friend explaining a mosh pit as a \"smosh pit\". Shortly after Ian Hecox joined him. They both started their YouTube channel Smosh in November 2005 uploading lip sync videos like the \"Pokémon Theme Music Video\" which eventually gained 25 million views which was, at the time, the most viewed video on YouTube, however six months later into the fame the video was removed for copyright reasons. The success of their videos led Smosh to be featured in the \"Person of the Year: You\" issue of Time, published in December 2006. Later on in March 2007 though, a user named Andi2000 re- uploaded the Pokémon video and today, it has 15 million views. Smosh also re- made the video in November 2010 changing the lyrics a little bit so it wouldn't be removed again. In 2009, smosh.com had a major redesign. Adding a games section, extras and bloopers for their skit. In 2010, the \"iShut Up App\" app was available on the App Store, Google Play and iTunes app store; and three new web-series': Ask Charlie, Lunchtime with Smosh and Ian is Bored. In 2011, Smosh was bought by Alloy Digital (later known as Defy Media), while also enjoying a 40% boost in viewership. On January 12, 2013, Smosh became the most subscribed channel on the internet beating Ray William Johnson. On June 14, 2017, Padilla said he would be leaving Smosh to make independent videos due to \"lack in creative freedom\". On November 6, 2018, Defy Media abruptly said that they were shutting down. Hecox said that Smosh was not \"going away\" and plans were made to find Smosh a new home. So on February 22, 2019, Smosh was bought by Mythical Entertainment, a production company founded by YouTube comedians Rhett & Link. Nowadays, their skits are more general and advanced. ==Channels== ===Smosh=== The head channel where Padilla and Hecox post new skits, sketches and other videos every Friday. ===Smosh Pit=== Smosh's official \"second channel\" on YouTube (originally called \"IanH\"). It is used to present more improv-based shows such as Squad Vlogs and The Show That Has No Name!. The channel has over 8 million subscribers as of December 2023. It was renamed Smosh Pit on August 14, 2017, an event that coincided with the addition of new shows. ===SmoshAlike === Padilla's personal channel, where he does unscheduled vlogs. , it has over 7 million subscribers.This channel was rechristened SmoshAlike in May 2025, thereby bringing it squarely into the Smoshverse fold. It has 7.65 million subs currently. ===ElSmosh=== ElSmosh is the Spanish version of Smosh where Padilla and Hecox post the Spanish version of Smosh Pit Weekly, El Smosh Pit de la Semana, on Wednesdays, and post a Spanish skit on Sundays, both two days after the English version. ===Smosh Games=== Smosh's gaming channel, with two new videos every day except for Saturday when they only post one video. ===SmoshCast=== Podcast created by Smosh, currently hosted by Amanda Lehan-Canto and Shayne Topp. Posts every Monday. ==References== Category:American YouTubers Category:Comedians from California Category:Podcasters",
 "title": "Smosh"
}