{
 "id": "325934",
 "text": "Hans Florian Zimmer (born 12 September 1957) is a German movie score composer, music producer and musician. He has written music for over 100 movies. His works include The Lion King (1994), Crimson Tide (1995), Gladiator (2000), Batman Begins (2005), The Dark Knight (2008), Inception (2010), Rango (2011), The Dark Knight Rises (2012), Man of Steel (2013), The Amazing Spider-Man 2 (2014), Batman v Superman: Dawn of Justice (2016), Dunkirk (2017), Widows (2018) and The Lion King (2019). His most recent work was No Time to Die (2021), Wonder Woman 1984 (2021) and Dune (2021), for which he won another Academy Award. ==Career== Zimmer spent the early part of his career in the United Kingdom before moving to the United States. Before becoming known as a film score composer, he wrote commercial jingles and was even part of the band The Buggles, known for their 1979 one-hit \"Video Killed the Radio Star\". He is in charge of the movie music division at DreamWorks studios. He also works with other composers through the company he founded, Remote Control Productions. Zimmer's works are notable for combining electronic music sounds with traditional orchestral arrangements. He has been given four Grammy Awards, two Golden Globe Awards, a Classical BRIT Award, and an Academy Award. He was also named on the list of Top 100 Living Geniuses, published by The Daily Telegraph. In 2000, Zimmer's score for Gladiator became one of the best- selling movie score albums ever. He also composed video game scores such as Call of Duty and Fortnite. ==Discography== ===As actor=== ====Feature films==== =====1980s===== Year Title Director Role Notes 1987 The Brave Little Toaster Jerry Rees Additional voices 1988 Who Framed Roger Rabbit Robert Zemeckis Oliver & Company George Scribner 1989 The Little Mermaid Ron Clements John Musker =====1990s===== Year Title Director Role Notes 1990 The Rescuers Down Under Hendel Butoy Mike Gabriel Additional voices 1991 Beauty and the Beast Gary Trousdale Kirk Wise An American Tail: Fievel Goes West Phil Nibbelink Simon Wells 1992 Aladdin John Musker Ron Clements 1994 The Lion King Roger Allers Rob Minkoff North Rob Reiner 1995 Forget Paris Billy Crystal Pocahontas Mike Gabriel Eric Goldberg The Run of the Country Peter Yates Toy Story John Lasseter 1996 City Hall Harold Becker The Hunchback of Notre Dame Gary Trousdale Kirk Wise 1997 Cats Don't Dance Mark Dindal Hercules Ron Clements John Musker 1998 Quest for Camelot Frederik Du Chau Mulan Barry Cook Tony Bancroft Antz Eric Darnell Tim Johnson The Lion King II: Simba's Pride Darrell Rooney A Bug's Life John Lasseter Male Ants The Prince of Egypt Brenda Chapman Steve Hickner Simon Wells Additional voices 1999 Doug's 1st Movie Maurice Joyce Tarzan Kevin Lima Chris Buck The Iron Giant Brad Bird Jim the Soldier, General Rogard's Army The Story of Us Rob Reiner Additional voices Toy Story 2 John Lasseter =====2000s===== Year Title Director Role Notes 2000 The Tigger Movie Jun Falkenstein Andrew Stanton Additional voices An Extremely Goofy Movie Ian Harrowell Douglas McCarthy Titan A.E. Don Bluth Gary Goldman Chicken Run Peter Lord Nick Park 102 Dalmatians Kevin Lima The Emperor's New Groove Mark Dindal 2001 Recess: School's Out Chuck Sheetz Shrek Andrew Adamson Vicky Jenson Atlantis: The Lost Empire Gary Trousdale Kirk Wise Osmosis Jones Animation: Tom Sito Piet Kroon Live-action: Bobby Farrelly Peter Farrelly Monsters, Inc. Pete Docter David Silverman 2002 Cinderella II: Dreams Come True John Kafka Direct-to- video Ice Age Chris Wedge Lilo & Stitch Chris Sanders Dean DeBlois Spirited Away Hayao Miyazaki Fire Chief Treasure Planet Ron Clements John Musker Male Alien #2, Pirates 2003 Piglet's Big Movie Francis Glebas Additional voices Finding Nemo Andrew Stanton Brother Bear Aaron Blaise Robert Walker 2004 Teacher's Pet Timothy Björklund Home on the Range Will Finn John Sanford The Incredibles Brad Bird 2005 Pooh's Heffalump Movie Frank Nissen Direct-to-video Robots Chris Wedge Madagascar Eric Darnell Tom McGrath Pooh's Heffalump Halloween Movie Elliot M. Bour Chicken Little Mark Dindal 2006 Curious George Matthew O'Callaghan Ice Age: The Meltdown Carlos Saldanha Cars John Lasseter =====2010s===== Year Title Director Role Notes 2018 Early Man Nick Park Additional voices Incredibles 2 Brad Bird ====Television==== Year Title Role Notes 1999-2003 Mona the Vampire Additional voices 2003-2004 Caillou Additional voices 5 episodes ===As composer=== ====Feature films==== =====1980s===== Year Title Director Studio / Publisher Notes 1982 Moonlighting Jerzy Skolimowski Miracle Films Composed with Stanley Myers 1984 Success Is the Best Revenge Gaumont Film Company Story of O – Chapter 2 Éric Rochat Cannon Film Distributors 1985 My Beautiful Laundrette Stephen Frears Working Title Films Channel Four Films Insignificance Nicolas Roeg Recorded Picture Company Zenith Productions 1986 The Zero Boys Nico Mastorakis Omega Entertainment Separate Vacations Michael Anderson Alliance Communications Playboy Productions 1987 Terminal Exposure Nico Mastorakis Omega Entertainment Nightmare at Noon The Wind The Nature of the Beast Franco Rosso Channel Four Films Cannon Film Distributors 1988 The Fruit Machine Philip Saville Film4 Productions Cannon Films A World Apart Chris Menges Atlantic Releasing Corporation Taffin Francis Megahy Vestron Pictures Metro-Goldwyn-Mayer United Artists Composed with Stanley Myers Paperhouse Bernard Rose Working Title Films Vestron Pictures Rain Man Barry Levinson Barris Industries Guber-Peters Company United Artists Metro-Goldwyn-Mayer Nominated–Academy Award for Best Original Score Burning Secret Andrew Birkin Vestron Pictures 1989 Twister Michael Almereyda Black Rain Ridley Scott Paramount Pictures 1st of 9 collaborations with R. Scott Diamond Skulls Nick Broomfield Film4 Productions Working Title Films Driving Miss Daisy Bruce Beresford The Zanuck Company Warner Bros. Pictures Nominated–Grammy Award for Best Song Written for Visual Media =====1990s===== Year Title Director Studio / Publisher Notes 1990 Chicago Joe and the Showgirl Bernard Rose LIVE Entertainment PolyGram Filmed Entertainment Working Title Films New Line Cinema Bird on a Wire John Badham Interscope Communications Universal Pictures Fools of Fortune Pat O'Connor Channel Four Films Days of Thunder Tony Scott Don Simpson/Jerry Bruckheimer Films Paramount Pictures 1st of 4 collaborations with T. Scott Pacific Heights John Schlesinger Morgan Creek Productions 20th Century Fox Sony Pictures Green Card Peter Weir Umbrella Entertainment Touchstone Pictures 1991 Backdraft Ron Howard Imagine Entertainment Universal Pictures 1st of 8 collaborations with Howard Thelma & Louise Ridley Scott Pathé Metro-Goldwyn-Mayer Nominated–BAFTA Award for Best Film Music Regarding Henry Mike Nichols Paramount Pictures Where Sleeping Dogs Lie Charles Finch August Entertainment Columbia TriStar Composed with Mark Mancina K2 Franc Roddam Paramount Pictures Composed with Chaz Jankel 1992 Radio Flyer Richard Donner Columbia Pictures The Power of One John G. Avildsen Regency Enterprises Le Studio Canal+ Village Roadshow Pictures Warner Bros. Pictures A League of Their Own Penny Marshall Columbia Pictures Toys Barry Levinson Baltimore Pictures 20th Century Fox Composed with Trevor Horn Nominated–Saturn Award for Best Music 1993 Point of No Return John Badham Warner Bros. Pictures Composed with Nick Glennie-Smith Younger and Younger Percy Adlon Transmundo Films Calendar Girl John Whitesell Columbia Pictures True Romance Tony Scott Morgan Creek Productions Davis Films Warner Bros. Pictures Cool Runnings Jon Turteltaub Walt Disney Pictures The House of the Spirits Bille August Constantin Film Miramax Films 1994 I'll Do Anything James L. Brooks Gracie Films Columbia Pictures 1st of 4 collaborations with Brooks Renaissance Man Penny Marshall Cinergi Pictures Touchstone Pictures The Lion King Roger Allers Rob Minkoff Walt Disney Animation Studios Walt Disney Pictures Original songs by Elton John & Tim Rice Composed with Nick Glennie-Smith and Mark Mancina Academy Award for Best Original Score Golden Globe Award for Best Original Score Nominated–BAFTA Award for Best Film Music Nominated–Grammy Award for Best Arrangement, Instrumental and Vocals Nominated–Grammy Award for Best Musical Album for Children Nominated–Grammy Award for Best Score Soundtrack for Visual Media Drop Zone John Badham Paramount Pictures 1995 Crimson Tide Tony Scott Don Simpson/Jerry Bruckheimer Films Hollywood Pictures Nominated–Grammy Award for Best Score Soundtrack for Visual Media Nominated–Saturn Award for Best Music Beyond Rangoon John Boorman Castle Rock Entertainment Columbia Pictures Nine Months Chris Columbus 1492 Pictures 20th Century Fox Something to Talk About Lasse Hallström Warner Bros. Pictures Composed with Graham Preskett Two Deaths Nicolas Roeg Castle Hill 1996 The Whole Wide World Dan Ireland Sony Pictures Classics The Kushner-Locke Company Cineville with Harry Gregson-Williams Broken Arrow John Woo 20th Century Fox Muppet Treasure Island Brian Henson Jim Henson Productions Walt Disney Pictures Original songs by Barry Mann & Cynthia Weil The Rock Michael Bay Don Simpson/Jerry Bruckheimer Films Hollywood Pictures 1st of 6 collaborations with Bay Composed with Nick Glennie-Smith & Harry Gregson-Williams Nominated–Saturn Award for Best Music The Fan Tony Scott Mandalay Entertainment Scott Free Productions TriStar Pictures The Preacher's Wife Penny Marshall The Samuel Goldwyn Company Touchstone Pictures Nominated–Academy Award for Best Original Score 1997 Smilla's Sense of Snow Bille August Bavaria Film Constantin Film Det Danske Filminstitut Greenland Film Production Nordisk Film with Harry Gregson-Williams The Peacemaker Mimi Leder DreamWorks Pictures As Good as It Gets James L. Brooks Gracie Films TriStar Pictures Nominated–Academy Award for Best Original Score 1998 The Last Days James Moll October Films Documentary film The Prince of Egypt Simon Wells Brenda Chapman Steve Hickner DreamWorks Animation DreamWorks Pictures Original songs by Stephen Schwartz Nominated–Academy Award for Best Original Score Nominated–Golden Globe Award for Best Original Score The Thin Red Line Terrence Malick Phoenix Pictures 20th Century Fox Nominated–Academy Award for Best Original Score 1999 The Iron Giant Brad Bird Warner Bros. Feature Animation Warner Bros. His first score for an animated movie. Performed by the Czech Philharmonic Orchestra. Soundtrack released by Varèse Sarabande. Chill Factor Hugh Johnson Morgan Creek Productions Warner Bros. Pictures Composed with John Powell =====2000s===== Year Title Director Studio / Publisher Notes 2000 An Everlasting Piece Barry Levinson DreamWorks Pictures (US) Columbia Pictures (International) Mission: Impossible II John Woo Cruise/Wagner Productions Paramount Pictures Gladiator Ridley Scott Scott Free Productions Red Wagon Entertainment DreamWorks Pictures (US) Universal Pictures (International) Composed with Lisa Gerrard Golden Globe Award for Best Original Score Nominated–Academy Award for Best Original Score Nominated–BAFTA Award for Best Film Music Nominated–Grammy Award for Best Score Soundtrack for Visual Media Nominated–Saturn Award for Best Music The Road to El Dorado Eric \"Bibo\" Bergeron Don Paul DreamWorks Animation DreamWorks Pictures Composed with John Powell Nominated–Annie Award Outstanding Individual Achievement for Music in an Animated Feature Production Nominated–Saturn Award for Best Music The Luke Movie Brad Bird Warner Bros. Family Entertainment His first and only score for an animated movie. Performed by the Czech Philharmonic Orchestra. Soundtrack released by Varèse Sarabande. Logan and Luke 2001 Black Hawk Down Ridley Scott Revolution Studios Jerry Bruckheimer Films Scott Free Productions Columbia Pictures Riding in Cars with Boys Penny Marshall Gracie Films Columbia Pictures Pearl Harbor Michael Bay Jerry Bruckheimer Films Touchstone Pictures Nominated–Golden Globe Award for Best Original Score Hannibal Ridley Scott Dino De Laurentiis Company Scott Free Productions Metro-Goldwyn-Mayer Universal Pictures Invincible Werner Herzog Channel Four Films (UK) Fine Line Features (US) Composed with Klaus Badelt The Pledge Sean Penn Franchise Pictures Morgan Creek Productions Warner Bros. 2002 Spirit: Stallion of the Cimarron Kelly Asbury Lorna Cook DreamWorks Animation DreamWorks Pictures Features lyrics and vocals by Bryan Adams Nominated–Golden Globe Award for Best Original Score The Ring Gore Verbinski DreamWorks Pictures 1st of 7 collaborations with Verbinski Nominated–Fangoria Chainsaw Award for Best Score 2003 The Last Samurai Edward Zwick Radar Pictures The Bedford Falls Company Cruise/Wagner Productions Warner Bros. Nominated–Golden Globe Award for Best Original Score Something's Gotta Give Nancy Meyers Columbia Pictures (US) Warner Bros. (International) Matchstick Men Ridley Scott ImageMovers Scott Free Productions Saturn Films Warner Bros. Tears of the Sun Antoine Fuqua Revolution Studios Cheyenne Enterprises Columbia Pictures 2004 Spanglish James L. Brooks Gracie Films Columbia Pictures Nominated–Golden Globe Award for Best Original Score Laura's Star Piet De Rycker Warner Bros. Family Entertainment Composed with Nick Glennie-Smith & Henning Lohner Shark Tale Vicky Jenson Bibo Bergeron Rob Letterman DreamWorks Animation DreamWorks Pictures King Arthur Antoine Fuqua Jerry Bruckheimer Films Touchstone Pictures Thunderbirds Jonathan Frakes StudioCanal Working Title Films Universal Pictures 2005 The Weather Man Gore Verbinski Escape Artists Paramount Pictures Composed with James S. Levine Der kleine Eisbär 2 – Die geheimnisvolle Insel Piet De Rycker Rothkirch Cartoon Film Warner Bros. Family Entertainment Composed with Nick Glennie-Smith Madagascar Eric Darnell Tom McGrath DreamWorks Animation DreamWorks Pictures 1st of 3 collaborations with Darnell 1st of 5 collaborations with McGrath Nominated–Annie Award for Music in a Feature Production Replaced Harry Gregson-Williams Wallace & Gromit: The Curse of the Were-Rabbit Nick Park Steve Box DreamWorks Animation Aardman Animation DreamWorks Pictures Composed with Julian Nott Batman Begins Christopher Nolan DC Comics Syncopy Inc. Legendary Pictures Warner Bros. 1st of 7 collaborations with Nolan 1st superhero film Composed with James Newton Howard Nominated–Saturn Award for Best Music 2006 Pirates of the Caribbean: Dead Man's Chest Gore Verbinski Jerry Bruckheimer Films Walt Disney Pictures Nominated–Grammy Award for Best Score Soundtrack for Visual Media The Da Vinci Code Ron Howard Imagine Entertainment Rainmaker Digital Effects Columbia Pictures Nominated–Golden Globe Award for Best Original Score Nominated–Grammy Award for Best Score Soundtrack for Visual Media The Holiday Nancy Meyers Relativity Media Waverly Films Columbia Pictures (US) Universal Pictures (International) Composed with Heitor Pereira ====Short films==== Year Title Director Studio / Publisher Notes 1986 Vardo Matthew Jacobs 1990 Arcadia Paul Bamborough Channel Four Films Working Title Films 1991 To the Moon, Alice Jessie Nelson Chanticleer Films 2008 Secrets of the Furious Five Raman Hui DreamWorks Animation Composed with Henry Jackman & John Powell Annie Award for Best Music in an Animated Television Production or Short Form 2011 Megamind: The Button of Doom Simon J. Smith DreamWorks Animation Pacific Data Images Composed with Lorne Balfe Kung Fu Panda: Secrets of the Masters Tony Leondis DreamWorks Animation Composed with Lorne Balfe & John Powell 2012 The Longest Daycare David Silverman Gracie Films Film Roman 20th Century Fox The Simpsons animated short Composed with James Dooley 2016 Kung Fu Panda: Secrets of the Scroll Rodolphe Guenoden DreamWorks Animation Composed with Lorne Balfe & John Powell ====Television==== Year Title Network Notes 1985 Wild Horses CBS Television film 1987 Comeback ITV Yorkshire Going for Gold BBC With Sandy McClelland 1988 First Born BBC Miniseries 1992 Millennium: Tribal Wisdom and the Modern World BBC Global Television Network 1993 Lifepod FOX Television film Theme music only Score composed by Mark Mancina 1993–1994 Space Rangers CBS Theme music only Score composed by Mark Mancina and John Van Tongeren 1994–1995 The Critic Columbia Pictures Television Gracie Films ABC FOX Theme music only Score composed by Alf Clausen 2000–2001 RTL Group Theme music only Score composed by Matthias Weber, Justin Burnett, James S. Levine & Geoff Zanelli 2010 The Pacific HBO DreamWorks Playtone Miniseries Theme music only Score composed by Geoff Zanelli & Blake Neely Nominated–Primetime Emmy Award for Outstanding Music Composition for a Limited Series, Movie, or Special 2011–2016 Through the Wormhole Revelations Entertainment Discovery Communications Documentary series Theme music only with Jacob Shea 2011 Curiosity Documentary series; 1 episode 2013 The Bible Lightworkers Media History Miniseries Composed with Lisa Gerrard & Lorne Balfe 2015 Premier Boxing Champions Boxing program Sons of Liberty A&E; Networks History Miniseries Theme music only Score composed by Lorne Balfe A.D. The Bible Continues NBC Music director only Score composed by Lorne Balfe 2016 Planet Earth II BBC Documentary series; 6 episodes Composed with Jasha Klebe & Jacob Shea Nominated–BAFTA Award for Best Original Music The Crown Sony Pictures Television Left Bank Pictures Netflix Theme music only Score composed by Rupert Gregson-Williams 2017 Genius National Geographic Theme music only Score composed by Lorne Balfe Nominated–Primetime Emmy Award for Outstanding Main Title Theme Music Blue Planet II BBC Documentary series; 7 episodes Composed with David Fleming & Jacob Shea 2018 Believer HBO Documentary film Composed with Dan Reynolds 2019 Seven Worlds, One Planet BBC Documentary series; 7 episodes Composed with Jacob Shea ==References== ==Other websites== * * * Interview with Hans Zimmer in Film Score Monthly * Interview with Hans Zimmer about Sherlock Holmes from C Music TV * Focus.De * Interviews with Hans Zimmer Category:1957 births Category:Living people Category:20th-century German composers Category:21st-century German composers Category:Academy Award winning composers Category:Golden Globe Award winning composers Category:Grammy Award winners Category:Movie score composers Category:People from Frankfurt Category:Saturn Award winners",
 "title": "Hans Zimmer"
}