{
 "id": "326287",
 "text": "Wallace Michael Shawn (born 12 November 1943) is an American actor, voice actor, playwright, and essayist, best known as the voice of Rex in the Toy Story series, Grand Nagus Zek in Star Trek: Deep Space Nine, Calico in Cats & Dogs: The Revenge of Kitty Galore, Vizzini in The Princess Bride, and the voice of Taotie in Kung Fu Panda: Legends of Awesomeness and most recently John Sturges in Young Sheldon. Shawn is from New York City. ==Early life== Shawn was born in New York City, to a Jewish family. His parents are William Shawn (1907–1992), the long-time editor of The New Yorker, and journalist Cecille Shawn (née Lyon; 1906–2005); his brother, Allen, is a composer.see pg. 20 of liner notes accompanying \"Allen Shawn – Piano Works\" CD issued by Coviello Classics label (COV 91414)> ==Filmography== Film Film Film Film Year Title Role Notes 1979 Manhattan Jeremiah 1979 Starting Over Workshop Member 1979 All That Jazz Assistant Insurance Man 1980 Simon Eric Van Dongen 1980 Atlantic City Waiter Credited as Wally Shawn 1981 Cheaper to Keep Her Mugger 1981 My Dinner with Andre Wally Shawn Also screenwriter 1981 Strong Medicine Uncredited 1982 A Little Sex Oliver 1983 How to Be a Perfect Person in Just Three Days Professor Silverfish 1983 Lovesick Otto Jaffe 1983 The First Time Jules Goldfarb 1983 Strange Invaders Earl 1983 Deal of the Century Harold DeVoto 1983 Saigon: Year of the Cat Frank Judd 1984 Crackers Turtle 1984 The Hotel New Hampshire Freud 1984 The Bostonians Mr. Pardon 1984 Micki + Maude Elliot Fibel 1985 Heaven Help Us Father Abruzzi 1985 Head Office Mike Hoover 1987 The Bedroom Window Henderson's Attorney 1987 Radio Days Masked Avenger 1987 Nice Girls Don't Explode Ellen 1987 Prick Up Your Ears John Lahr 1987 The Princess Bride Vizzini 1988 The Moderns Oiseau 1989 She's Out of Control Dr. Fishbinder 1989 Scenes from the Class Struggle in Beverly Hills Howard 1989 We're No Angels Translator 1991 Shadows and Fog Simon Carr 1992 Unbecoming Age Dr. Block 1992 Nickel & Dime Everett Willits 1992 Mom and Dad Save the World Sibor 1993 The Cemetery Club Larry 1993 The Meteor Man Mr. Little 1993 Eligible Dentist 1994 Mrs. Parker and the Vicious Circle Horatio Byrd 1994 Vanya on 42nd Street Vanya 1995 The Wife Cosmo 1995 Napoleon Echidna 1995 Canadian Bacon Canadian Prime Minister 1995 A Goofy Movie Principal Mazur Voice 1995 Clueless Mr. Wendell Hall 1995 Just Like Dad Stan Speigel 1995 Toy Story Rex Voice 1996 All Dogs Go to Heaven 2 Labrador MC Voice 1996 House Arrest Vic Finley 1997 Vegas Vacation Marty 1997 Just Write Arthur Blake 1997 Cats Don't Dance Man 1997 Critical Care Furnaceman 1998 Blind Men 1998 Noah Zack 1999 The Diary of the Hurdy-Gurdy Man 1999 My Favorite Martian Coleye 1999 Toy Story 2 Rex Voice 2000 The Prime Gig Gene 2001 The Curse of the Jade Scorpion George Bond 2001 Monsters, Inc. Rex Voice; uncredited 2002 Sun Gods Spaulding 2002 Love Thy Neighbor Clinic Doctor 2002 Personal Velocity: Three Portraits Mr. Gelb 2002 Mr. St. Nick Mimir 2003 Monte Walsh Colonel Wilson 2003 Duplex Herman 2003 The Haunted Mansion Ezra 2004 Teacher's Pet Crosby Strickler Voice 2004 Melinda and Melinda Sy 2004 The Incredibles Gilbert Huph Voice 2004 Karroll's Christmas Zeb Rosecog 2005 Chicken Little Principal Fetchit Voice 2006 The 12th Man Marty 2006 Southland Tales Baron Von Westphalen 2006 Air Buddies Billy Voice 2006 Tom and Jerry: Shiver Me Whiskers Purple Pirate Paul Voice 2007 Happily N'Ever After Munk Voice 2007 I Could Never Be Your Woman Math Teacher Uncredited 2007 The Simpsons Movie Angelica's Dad Voice 2007 New York City Serenade Himself 2008 Kit Kittredge: An American Girl Mr. Gibson 2008 Mia and the Migoo Migoo Voice, English-language version 2009 Capitalism: A Love Story Himself Documentary 2010 Jack and the Beanstalk Broker / Booker / Lancelot Squarejaw 2010 Furry Vengeance Christian Burr 2010 Toy Story 3 Rex Voice 2010 Cats & Dogs: The Revenge of Kitty Galore Calico Voice 2011 The Speed of Thought Sandy 2011 Tower Heist Mr. McBurns 2011 Hawaiian Vacation Rex Voice; short film 2011 Small Fry Rex Voice; short film 2012 Partysaurus Rex Rex Voice; short film 2012 A Late Quartet Gideon Rosen 2012 Vamps Van Helsing 2013 Admission Clarence 2013 Toy Story of Terror! Rex Voice; television special 2013 The Double Mr. Papadopoulos 2014 Don Peyote Psychotherapist 2014 A Master Builder Halvard Solness Also screenwriter 2014 Toy Story That Time Forgot Rex Voice; television special 2014 Club Penguin: Monster Beach Party Gary the Gadget Guy Voice; television special 2015 Club Penguin: Halloween Panic! Gary the Gadget Guy Voice; television special 2016 Animal Crackers Mr. Woodley Voice 2019 Toy Story 4 Rex Voice 2019 Woody's Roundup: The Movie Rex Voice Direct-to-video ==Television== Television Television Television Television Year Title Role Notes 1982–83 Taxi Arnie Ross Episode: \"Love Un-American Style\" Episode: \"Arnie Meets the Kids\" (as Arnie) 1987–91 The Cosby Show Jeff Engels Episode: \"Cliff's Mistake\" (as Jeffrey Engels) Episode: \"The Day the Spores Landed\" (as Jeff Engels) Episode: \"Cliff's Nightmare\" (as Jeffrey Engels; voice) Episode: \"The Moves\" (as Jeff Engels) Episode: \"Olivia's Field Trip\" (as Jeffrey Engels) 1992 The Double 0 Kid Cashpot 1992 Civil Wars Riley Baker 1992 One Life to Live Professor Marvel 1993 Matrix Mr. Gonley 1993 The Pink Panther Little Man Voice 1 episode 1994 The Nanny Charles Haste 1 episode 1995 Kalamazoo Bobby Short 1995 Something Wilder Roof Inspector 1 episode 1996 Toy Story Treats Rex Voice 1996–97 Clueless Mr. Hall 17 episodes 1994–97 Murphy Brown Stuart Best 4 episodes 1997 King of the Hill Philip Ny Voice 1 episode 1998 The Jungle Book: Mowgli's Story Tarzan Voice 1998 The Lionhearts 5 episodes 1999 Homicide: Life on the Street Frank Hopper 1 episode 1993–99 Star Trek: Deep Space Nine Grand Nagus Zek 7 episodes 1999 Cosby Mr. Fleming 2 episodes 2000 Buzz Lightyear of Star Command: The Adventure Begins Rex Voice 2000 Teacher's Pet Crosby Strickler Voice 2001 Ally McBeal Mr. Dune 1 episode 2001 Blonde I. E. Shinn 2001 Three Sisters Dean Webb 1 episode 2003 Stanley Mr. Goldberg Voice 1 episode 2002–04 Teamo Supremo Gauntlet Voice 1 episode 2004 Sex and the City Martin Grable 1 episode 2005 Fat Actress Sigmund von Oy 1 episode 2005 Stargate SG-1 Arlos Episode: \"The Ties That Bind\" 2005 Desperate Housewives Lonny Moon 1 episode 2001–06 Crossing Jordan Howard Stiles 8 episodes 2001–11 Family Guy Bertram Voice 3 episodes 2003 Mona the Vampire Dark Wizard 1 episode 2006 Tom and Jerry: Shiver Me Whiskers Purple Pirate Paul / Narrator Voice 2006 Law & Order: Criminal Intent Film Professor 1 episode 2007–2015 Ultimate Smash Brawl Scoop / George H. W. Bush / Prince Phillip / Rex / Jeff Fatt / Donkey Voice 7 episodes 2008 The Return of Jezebel James Garson Leeds 1 episode 2008 Cashmere Mafia Animal Handler 1 episode 2008 Scooby-Doo and the Goblin King Mr. Gibbles Voice 2009 Law & Order: Special Victims Unit Roy Batters 1 episode 2009 Life on Mars Stephen Morrell - \"The Sorcerer\" 1 episode 2008–09 The L Word William Halsey 5 episodes 2009 ER Teddy Lempell 1 episode 2010 The Daily Show with Jon Stewart Alan Rubin 1 episode 2010 Damages Sterling Biddle 1 episode 2008–13 Gossip Girl Cyrus Rose 11 episodes 2011 Kung Fu Panda: Legends of Awesomeness Taotie Voice only 2011 Eureka DoD psychological assessor Warren Hughes 3 episodes 2012 Fish Hooks Rat King Voice Episode: \"Guys' Night Out\" 2013–14 The Good Wife Charles Lester 2 episodes 2013 Adventure Time Rasheeta Voice Episode: \"Puhoy\" 2013 Uncle Grandpa Ule Gapa Voice Episode: \"Belly Bros\" 2014 Phineas and Ferb Saul Voice Episode: \"Phineas and Ferb Save Summer\" 2014 Mozart in the Jungle Winslow 2014 Courage the Cowardly Dog Eustace Bagge Voice The Fog of Courage (Short) ==Video games== Video Games Video Games Video Games Video Games Year Title Role Notes 1996 Toy Story: The Video Game Rex Voice only Toy Story Activity Center 2004 The Incredibles: The Video Game Gilbert Huph 2006 Family Guy Video Game! Bertram 2008 The Princess Bride Game Vizzini 2010 Toy Story 3: The Video Game Rex 2012 Family Guy: Back to the Multiverse Bertram 2015 King's Quest Manny ==Writer== Writer Writer Writer Writer Year Title Notes 1981 My Dinner with Andre 1997 The Designated Mourner Play Written by 2004 Marie and Bruce Screenplay The Fever Play Screenplay 2009 Essays Book collection of essays, by Haymarket Books 2010 Tea Time Short Script 2015 Evening at the Talk House Play Written by ==Himself== Himself Himself Himself Himself Year Title Notes 1995 Charlie Rose TV series 1 episode Showbiz Today TV series 1 episode 2001 As You Wish: The Story of The Princess Bride E! True Hollywood Story TV series 1 episode 2005 Now TV series 2 episodes Clueless: The Class of '95 2007 Strange Culture Up Close with Carrie Keagan TV series 1 episode 2008 USIDent TV: Surveilling the Southland The Windmill Movie 2009 Capitalism: A Love Story Made in Hollywood TV series 1 episode 2010 MindFlux 2012 Up with Chris Hayes TV series 1 episode 2014 BoJack Horseman TV series 1 episode ==Plays== Play Name Year Four Meals in May 1967 The Family Play 1970 The Hotel Play 1970 The Hospital Play 1971 Our Late Night 1975 A Thought in Three Parts 1976 Marie and Bruce 1978 Aunt Dan and Lemon 1985 The Fever 1990 The Designated Mourner 1997; film directed by David Hare, 1998 The Threepenny Opera 2006 Grasses of a Thousand Colors 2008 Evening at the Talk House 2015 ==References== == Further reading == * * ==Other websites== * * * * Category:1943 births Category:Comedians from New York City Category:American movie actors Category:American voice actors Category:Writers from New York City Category:Actors from New York City Category:Living people",
 "title": "Wallace Shawn"
}