{
 "id": "326577",
 "text": "\"California Gurls\" is a hit single performed by American singer Katy Perry and featuring rapper Snoop Dogg. Released in 2010, its the lead single from her 2010 album Teenage Dream. Perry, Snoop Dogg, Bonnie McKee, and producers Dr. Luke, Benny Blanco, and Max Martin wrote the song. Perry said it was her response to \"Empire State of Mind\" by Jay-Z and Alicia Keys. The song mixes disco-pop and funk-pop with hints of new wave and electropop. Its lyrics celebrate California, where both Perry and Snoop Dogg are from. It received positive reviews, with most critics calling it a \"summer anthem\" and praising its production and chorus. The song was originally set to be sent to radio on May 25, 2010, but leaked online on May 7, leading to its release on iTunes as the lead single from Teenage Dream on May 11. The song became a global hit, topping the Billboard Hot 100 for six weeks, giving Perry her second number- one in the US and Snoop Dogg his third. It also reached number one in seven countries, was the best-selling song of 2010 in Canada, and is certified Platinum or higher in nine countries, including 9× Platinum in Australia and Diamond in Canada and the US. When it was certified Diamond by the RIAA, Perry became the first female artist to have four Diamond singles in the US, along with \"Firework\", \"Dark Horse\", and \"Roar\". It was No.1 in several countries. It also went diamond in 99 countries and named as the best-selling song of all time. == Background == According to her A&R; agent Chris Anokute, Perry felt that her album Teenage Dream was missing something — specifically, an anthem that celebrated the fun, carefree spirit of California. That impulse led to the creation of \"California Gurls,\" which she co-wrote with producers Dr. Luke, Max Martin, and Benny Blanco, as well as rapper Snoop Dogg, who features on the track. The song ended up becoming a defining summer hit and a key piece of the album’s success. Perry used Wikipedia to find a rapper for \"California Gurls\" and chose Snoop Dogg from a list of West Coast artists. The song was first called \"California Girls,\" but the spelling was changed to \"California Gurls\" as a tribute to the song \"September Gurls\" by Big Star, after band member Alex Chilton passed away. Rondor Music, which owns the rights to the Beach Boys' \"California Girls,\" reportedly threatened to sue because Perry used the line \"I wish they could all be California Girls,\" which comes from their song. == Composition == \"California Gurls\" is a mix of disco-pop, funk- pop, and bubblegum pop according to Toronto Sun and The Daily Telegraph, with touches of new wave and electropop. It’s in the key of F major, has a tempo of 126 beats per minute, and is set to a house beat. Perry’s vocals range from C4 to D5. The song features synths, drums, funk guitars, and electronic sounds. == Reception == \"California Gurls\" got lots of praise from critics. Nick Levine from Digital Spy gave it five stars, liking Perry’s vocals and the catchy chorus. Entertainment Weekly and HitFix called it the summer hit of 2010. Rolling Stone said it set the mood for the Teenage Dream album. The Washington Post praised its fresh sound, great arrangement, and fun chorus, calling it a perfect summer hit. Even musician Brian Wilson from the Beach Boys complimented Perry’s singing and called the melody catchy. Glenn Gamboa from Newsday said \"California Gurls\" is light and catchy, with high-quality production. Steve Leftridge from PopMatters called it the summer hit of 2010 and praised its music, lyrics, and singalong chorus. Stephen Thomas Erlewine from AllMusic saw it as a highlight of the Teenage Dream album. Michael Cragg from musicOMH called it fun, with sweet verses and a big chorus. Edna Gundersen from USA Today said it’s a bubbly summer anthem. However, Greg Kot from the Chicago Tribune criticized it as too mechanical and over-processed. The song got a Grammy nomination and was ranked by Billboard as the top summer song of all time in 2012. == Chart Performance == \"California Gurls\" sold 294,000 downloads in its first week and hit number one on the US Digital Songs chart. It debuted at number two on the Billboard Hot 100 and later reached number one, becoming Perry's second and Snoop Dogg's third number-one hit. It was the first Capitol Records single in 43 years to reach number one in just four weeks. The song topped the Pop Songs chart and was the first in 2010 to sell over 300,000 digital copies in more than one week. In seven weeks, it sold over two million downloads, the second fastest ever at the time. It also hit number one on the Hot Dance Airplay chart. By June 2023, the song was certified Diamond and sold 5.9 million copies in the US, making Perry the first female artist with four Diamond singles. \"California Gurls\" hit number one in Canada and charted in the top 20 in Belgium, New Zealand, Norway, and France, later reaching the top five in France and selling over 140,000 copies there (certified Platinum in 2012). In Australia, it debuted at number three and later reached number one. It also topped the radio charts in New Zealand and earned Gold certification. In the UK, it debuted at number one, selling 123,607 copies in its first week and 216,000 in two weeks. By October 2010, it was certified Platinum for selling over 600,000 copies, and by 2013, it had sold 780,787 copies, making it Perry's third best-selling single in the UK. ==Music video== In the music video, Perry is a game piece in Candyfornia, a world inspired by Alice in Wonderland, Charlie and the Chocolate Factory, and the board game Candy Land. The set is decorated with cupcakes, ice cream, cotton candy, and lollipops. Snoop Dogg, called \"Sugar Daddy,\" appears as a king who keeps several women (the Queens of Candyfornia) captive using candy- themed traps. Perry travels through the land, exploring, making discoveries, and freeing the women. During the chorus, she lies on a cotton candy cloud. Snoop Dogg tries to stop her, but after she frees everyone, Perry leads a dance on the beach. Angry, \"Sugar Daddy\" attacks with an army of gummy bears, but Perry defeats them with whipped cream guns. He surrenders and is buried in the sand, still admiring the women and wishing all women could be like California girls. The video features candy versions of California landmarks like the Hollywood Sign, Golden Gate Bridge, and Venice Beach. == Formats and track listings == * Digital download # \"California Gurls\" (featuring Snoop Dogg) – 3:56 * CD single # \"California Gurls\" (featuring Snoop Dogg) – 3:56 # \"Hot n Cold\" (Yelle Remix) – 4:07 * US digital download – remix EP # \"California Gurls\" (Armand Van Helden Remix) – 5:48 # \"California Gurls\" (Innerpartysystem Main Mix) – 4:27 # \"California Gurls\" (Manhattan Clique Long Beach Mix) – 7:00 * UK digital download – remix EP # \"California Gurls\" (MSTRKRFT Main Mix) – 3:59 # \"California Gurls\" (Innerpartysystem Main Mix) – 4:27 # \"California Gurls\" (Manhattan Clique Long Beach Mix) – 7:00 ==Charts== === Weekly charts === Chart (2010) Peak position European Hot 100 Singles (Billboard) 1 Russia Airplay (TopHit) 34 Venezuela Pop Rock (Record Report) 1 ===Year-end charts=== Chart (2010) Position Australia (ARIA) 5 Belgium (Ultratop 50 Flanders) 24 Canada (Canadian Hot 100) 1 Denmark (Tracklisten) 30 Europe (European Hot 100 Singles) 14 France (SNEP) 20 Germany (Media Control AG) 20 Hungary (Rádiós Top 40) 14 Ireland (IRMA) 10 Japan Hot 100 23 Netherlands (Dutch Top 40) 10 New Zealand (RIANZ) 3 Romania (Romanian Top 100) 94 Spain (PROMUSICAE) 13 Taiwan (Hito Radio) 21 UK Singles (Official Charts Company) 8 US Billboard Hot 100 4 Worldwide (IFPI) 6 Chart (2011) Position Hungary (Rádiós Top 40) 92 ===Decade- end charts=== Chart (2010–2019) Position US Billboard Hot 100 49 ==Certifications== ==Release history== Release dates and formats for \"California Gurls\" Region Date Format(s) Version(s) Label Various May 7, 2010 Original Capitol * * * * * * Italy May 14, 2010 Radio airplay Polydor United States May 25, 2010 Capitol June 7, 2010 Hot adult contemporary radio June 10, 2010 CD Germany June 11, 2010 United Kingdom June 21, 2010 Digital download June 29, 2010 CD July 16, 2010 Digital download Remixes France July 20, 2010 United States == Notes == ==References== Category:2010 songs Category:Katy Perry songs Category:Snoop Dogg songs Category:Bubblegum pop songs Category:Pop songs Category:Songs about California Category:Songs about sexuality",
 "title": "California Gurls"
}