{
 "id": "326692",
 "text": "Throw Momma from the Train is a 1987 American black comedy movie. It was inspired by Strangers on a Train, which also plays a role in the movie. The movie's title comes from \"Mama From the Train,\" written by Irving Gordon and sung by Patti Page. It stars Danny DeVito (who also directed), Billy Crystal Anne Ramsey, Kim Greist, Rob Reiner, Branford Marsalis, and Kate Mulgrew, with a cameo appearance from Oprah Winfrey. The movie received mixed to positive reviews, but it was a commercial success. Anne Ramsey was singled out for praise for her portrayal of Mrs. Lift; she got an Academy Award nomination for Best Supporting Actress. ==Cast== * Danny DeVito as Owen Lift, the main character. He is a student at Larry's college, as well as also being his friend. Throughout the movie, he tries to kill his mother in many different ways, but in the end, he decides not to kill her after all. * Billy Crystal as Larry Donner. He is Owen's best friend. * Anne Ramsey as Mrs. Lift, also known as Momma. She is the antagonist of the movie. * Kim Greist as Beth, Larry's new girlfriend. * Kate Mulgrew as Margaret Donner, Larry's ex-wife. Larry hates her with a passion and wishes her dead, and Owen tries to kill her by pushing her overboard, but it is later revealed that she was rescued is marrying someone else. * Branford Marsalis as Lester * Rob Reiner as Joel, Larry's agent * Bruce Kirby as Detective DeBenedetto * Oprah Winfrey as Herself * Farley Granger as Guy Haines (archive footage) * Robert Walker as Bruno Anthony (archive footage) ==Other websites== * Category:1987 comedy movies Category:1987 crime movies Category:1980s black comedy movies Category:1980s criminal comedy movies Category:American black comedy movies Category:American criminal comedy movies Category:English-language movies Category:Movies about dysfunctional families Category:Movies about educators Category:Movies set on trains Category:Movies about writers Category:Movies set in Hawaii Category:American independent movies Category:Movies directed by Danny DeVito",
 "title": "Throw Momma from the Train"
}