{
 "id": "326679",
 "text": "The 26th G8 Summit was a meeting in 2000 for the leaders of Canada, the European Commission, France, Germany, Italy, Japan, Russia, the United Kingdom and the United States. \"The Group of Eight: what is it?\" Reuters. July 3, 2008; retrieved 2012-2-10. This meeting of the Group of Eight (G8) was the 26th meeting in a series which began in 1976. The G8 and the summit are part of a \"consultative process and not an international organization\".G20-G8 France 2011, \"What is G8?\" ; retrieved 2012-3-16. The meeting took place in Japan at Naha on the sothern island of Okinawa. The international group of leaders were together from July 21-23, 2000. ==Core participants== The participants were the \"core members\" of the group:Rieffel, Lex. \"Regional Voices in Global Governance: Looking to 2010 (Part IV),\" Brookings. March 27, 2009; retrieved 2012-2-10. Core G8 members Host nation and leader are indicated in bold text. Member Member Represented by Title Canada Jean Chrétien Japan Ministry of Foreign Affairs (MOFA), Chrétien; G-8 delegations ; retrieved 2012-2-10. Prime Minister France Jacques Chirac MOFA: Chirac; G-8 delegations ; retrieved 2012-2-10. President Germany Gerhard Schröder MOFA: Schröder; G-8 delegations ; retrieved 2012-2-10. Chancellor Italy Giuliano Amato MOFA: Amato; G-8 delegations ; retrieved 2012-2-10. Prime Minister Japan Yoshiro Mori MOFA: Mori; G-8 delegations ; retrieved 2012-2-10. Prime Minister Russia Vladimir Putin MOFA: Putin; G-8 delegations ; retrieved 2012-2-10. President United Kingdom Tony Blair MOFA: Blair; G-8 delegations ; retrieved 2012-2-10. Prime Minister United States Bill Clinton MOFA: Clinton; G-8 delegations ; retrieved 2012-2-10. President European Commission Romano Prodi MOFA: Prodi; G-8 delegations ; Delegation of the European Union to Japan, \"EU and the G8 & G20\"; retrieved 2012-5-21. President ==Agenda== Global health first appeared as an international agenda issue at this meeting.Kurokawa, Kyoshi et al. \"Italian G8 Summit: a critical juncture for global health,\" The Lancet (British Medical Association). Vol. 373, Issue 9663 (14 February 2009), pp. 526-527; retrieved 2012-2-10. ==Related pages== * G8 ==References== == Other websites == * Okinawa Summit 2000 * Kyushu-Okinawa Summit 2000 documents, photos * University of Toronto: G8 Information Centre * Parliament.uk, Graphic shows G8 in context 26 Category:2000 in Asia Category:2000s in Japan",
 "title": "26th G8 summit"
}