{
 "id": "326716",
 "text": "The 5th G7 summit was a meeting in 1979 for the leaders of Canada, the European Commission, France, Germany, Italy, Japan, the United Kingdom and the United States. The international group of leaders were together in Japan June 28-29.Japan Ministry of Foreign Affairs (MOFA), \"Documents of Summit Meetings in the Past\" (5th); retrieved 2012-5-21. The meetings were held at the State Guesthouse (Akasaka Palace) in Tokyo.Japan Cabinet Office, State Guesthouse, Akasaka Palace ; retrieved 2012-5-21. ==History== The Tokyo summit of the Group of Seven (G7) was the 5th meeting in a series which began in 1976. This was the first G7 summit in JapanG20/G8 France 2011, What is G8? (\"Previous summits\" section) ; retrieved 2012-5-21 The G8 and the summit are part of a consultation process. The G8 is not an international organization.G20-G8 France 2011, What is G8? (\"Language\" section) ; retrieved 2012-5-21. It is an informal group.US Dept. of State, G8 Frequently Asked Questions (\"How does the G8 work?\" section); retrieved 2012-5-21. ==Participants== The participants were the \"core members\" of the group:Rieffel, Lex. \"Regional Voices in Global Governance: Looking to 2010 (Part IV),\" Brookings. March 27, 2009; retrieved 2012-2-10. Core G7 members Host nation and leader are indicated in bold text. Member Member Represented by Title Canada Joe Clark Prime Minister France Valéry Giscard d'Estaing President West Germany Helmut Schmidt Chancellor Italy Giulio Andreotti Prime Minister Japan Masayoshi Ohira Prime Minister United Kingdom Margaret Thatcher Prime Minister United States Jimmy Carter President European Commission Roy JenkinsG8 Hokkaido Toyako summit \"History of the Summit\" (12th) ; Delegation of the European Union to Japan, \"EU and the G8 & G20\"; retrieved 2012-5-21. President ==Overview== The G7 leaders agreed to cooperate in the area of energy for developing countries. ==Related pages== * G8 * List of G8 summits ==References== ==Other websites== * University of Toronto: G8 Information Centre * Parliament.uk, Graphic shows G8 in context 05 Category:1979 Category:20th century in Tokyo Category:1970s in Japan",
 "title": "5th G7 summit"
}