{
 "id": "326791",
 "text": "Conduit is a tube that electrical wires are run through. Conduit protects the wire from damage. The most common type of conduit is called electrical metallic tubing (EMT). Conduit is common in commercial and industrial installations, and in garages and unfinished basements in homes. General wiring in homes is usually done with NM cable (commonly referred to by the trade name Romex), not conduit. Conduit is usually made of metal, but it can also be made of plastic. == Types == Conduit systems are classified based on wall thickness, mechanical rigidity, and the material of the pipe. Generally, they can be divided into metallic and non-metallic pipes. === Metallic === Rigid metal conduit (RMC) is a thick-walled threaded pipe, usually made of coated steel, stainless steel, or aluminum. Galvanized rigid conduit (GRC) is a galvanized steel pipe with a wall thick enough to be threaded. Its common application is commercial and industrial buildings. It is designed to protect wires and connectors. Intermediate metal conduit (IMC) is a steel pipe that is heavier than EMT but lighter than RMC. It can be threaded. Electrical metallic conduit (EMT), sometimes called thin-walled conduit, is often used instead of galvanized rigid conduit (GRC) because it is cheaper and lighter than GRC. EMT itself is not threaded, but can be used with threaded fittings that are clamped onto it. Different lengths of conduit are connected to each other and to the equipment with clamp-on fittings. Similar to GRC, EMT is more common in commercial and industrial buildings than in residential applications. EMT is usually made of coated steel, but may also be aluminum. Aluminum conduit is similar to galvanized steel conduit and is a rigid tube that is often used in commercial and industrial applications that require greater corrosion resistance. === Non-Metallic === PVC conduit has long been considered the lightest weight compared to steel conduit materials and is generally less expensive than other forms of conduit. In North American electrical practice, PVC conduit is available in thirteen different sizes and wall thicknesses, with thin-walled varieties only suitable for direct burial in concrete and thicker varieties for direct burial and outdoor projects. Most of the various fittings used for metal conduit are also available in PVC form. This plastic material repels moisture and resists many corrosive substances, but because the tubing is non-conductive, an additional grounding conductor must be pulled through each conduit. PVC conduit can be heated and bent in the field using specially designed heating tools. Reinforced Thermosetting Resin Conduit (RTRC) or fiberglass conduit is lightweight compared to metal conduit, helping to reduce labor costs. It is sometimes referred to as FRE, which stands for \"Fiberglass Reinforced Epoxy,\" but the term is a legally registered trademark of FRE Composites. Rigid Non-Metallic Conduit (RNC) is a non-metallic, unthreaded, smooth-wall conduit. Electrical Non-Metallic Tube (ENT) is a thin- walled corrugated conduit that is moisture-resistant and flame-retardant. It is flexible, can be bent by hand, and is generally flexible, but fittings are not. Due to its corrugated shape, it is not threaded, but some fittings may be threaded. LSZH Conduit (Low Smoke Zero Halogen Conduit): This new type of electrical conduit is usually made of plastics such as PP or PE. In the industry, it has many names, summarized in the following table: LSZH Conduit Industy Abbreviations List Abbreviations Meaning LSZH Low smoke, zero halogen LSF Low smoke, fume LSOH (LS0H) Low smoke, zero (0) halogen LSHF(LSFH) Low smoke, halogen-free(free halogen) LSNH Low smoke, non-halogen NHFR Non- halogen, flame retardant HFFR Halogen-free, flame retardant ZHFR Zero Halogen, Flame Retardant OHLS Zero Halogen, Flame Retardant HFT Halogen Free and Flame Retardant, Temperature Resistant RKHF RK means wall thickness, Halogen Free It is a new type of plastic wire conduit in the industry. Compared with PVC electrical conduit, it has three advantages. First: low smoke. Due to the unique material and formula, LSZH conduit only produces a small amount of black smoke when burning, and most compounds will absorb heat energy and release steam when burning. Compared with the large amount of smoke produced by PVC conduits, it reduces the interference to the visual field during the combustion process by reducing the amount and density of smoke; Second: halogen-free. Halogen is a heavy metal, and fluorine gas is highly toxic; inhaling fluorine at a concentration of 25 parts per million can be fatal. LSZH conduit does not produce halogens when burning, thereby reducing the possibility of being inhaled by people during combustion. Third: environmental protection. In addition to being halogen-free, when the compound reaches a specific temperature, it absorbs heat energy, releases steam and does not release corrosive gases. This can make its application more extensive; for example, in new nuclear power plants, the use of LSZH cables and conduits will increase. Fourth: flame retardant. Due to the chemical properties mentioned in the first point, the LSZH conduit absorbs heat energy and releases steam when burning, thus achieving a flame-retardant effect. The latest products on the market and UL test results can reach UL94 V-0 flame retardant with excellent performance. == References == Category:Electrical wiring",
 "title": "Electrical conduit"
}