{
 "id": "326734",
 "text": "The Marvelettes was an American singing group that were active from 1960 to 1972. Members of the group were Gladys Horton, Katherine Anderson, Wanda Rogers, Anne Bogan, Georgeanna Tillman, Wyanetta Cowart and Georgia Dobbins. They are probably best known for their #1 hit, \"Please Mr. Postman\". They were inducted into the Vocal Group Hall of Fame in 2004 and were inducted into the Michigan Rock and Roll Legends Hall of Fame in 2007. The group has received several honors, including the Vocal Group Hall of Fame and the Pioneer Award from the Rhythm and Blues Foundation. In 2005, two of the group's most successful recordings, \"Please Mr. Postman\" and \"Don't Mess with Bill\" earned million-selling Gold singles from the RIAA. In 2012, the Marvelettes were nominated for 2013 induction to the Rock & Roll Hall of Fame. Other notable recordings were \"Playboy\", \"Beechwood 4-5789\", \"Danger! Heartbreak Dead Ahead\", \"The Hunter Gets Captured by the Game\", \"When You're Young and in Love\". == Discography == The Marvelettes released 12 albums: Year Album 1961 Please Mr. Postman 1962 The Marvelettes Sing (aka Smash Hits of '62) 1962 Playboy 1963 The Marvelous Marvelettes 1963 The Marvelettes Recorded Live On Stage 1966 The Marvelettes Greatest Hits 1967 The Marvelettes (Pink Album) 1968 Sophisticated Soul 1969 In Full Bloom 1970 The Return of The Marvelettes 1975 The Marvelettes Anthology 1975 Best of The Marvelettes ==References== == Other websites == *The Marvelettes Vocal Group Hall of Fame profile Category:1960s establishments in Michigan Category:1960 establishments in the United States Category:1960s American music groups Category:1970 disestablishments in the United States Category:1970s American music groups Category:African-American musical groups Category:American girl groups Category:American pop music groups Category:American R&B; bands Category:Musical groups disestablished in 1970 Category:Musical groups established in 1960 Category:Musical groups from Michigan Category:Soul bands Category:20th-century disestablishments in Michigan",
 "title": "The Marvelettes"
}