{
 "id": "327322",
 "text": "The word \"Negro\" is used in the English-speaking world to refer to a person of black ancestry or appearance. It has been used for people of African ancestry as well as people from other places with African ancestry or people with Negroid or Negroid like appearance and with kinky or wooly hair. Negro means 'black' in Spanish and Portuguese. It comes from the Latin word niger which means 'black'. It is usually considered an offensive term nowadays. Words such as 'black' or 'African American' are preferred. ==History== \"Negro\" replaced the term \"colored\" as the more polite term. This was done when the term \"black\" was more offensive. This use of the word was accepted as normal during the Civil Rights Movement of the 1950s and 1960s. It was accepted even by the people it was used to describe. One example of this is Martin Luther King, Jr. using the term \"negro\" when talking about his own race in his 1963 speech \"I Have a Dream\". During the Civil Rights Movement, some African American leaders in the United States did not like this word. People like Malcolm X wanted the word \"Black\" to be used.Smith, Tom W. (1992) \"Changing racial labels: from 'Colored' to 'Negro' to 'Black' to 'African American'.\" Public Opinion Quarterly 56(4):496-514. This was because they saw a connection between the term \"Negro\" and slavery, segregation, and discrimination. The word is now usually considered offensive and outdated. Since the late 1960s, many other terms have been more commonly used. These include \"Black\", \"Black African\", \"Afro-American\" and \"African American\". The words \"African American\" have been used in the United States to refer to Black Americans.Christopher H. Foreman. The African-American predicament. Brookings Institution Press, 1999, p. 99. ==Modern day== The term \"Negro\" is still used in some ways. It is used by the United Negro College FundUNCF New Brand and the Negro league in sports. The United States Census Bureau said that \"Negro\" would be used on the 2010 United States Census, with \"Black\" and \"African-American\". This was because some older black Americans still feel this is the word that describes them.U.S. Census Bureau interactive form, Question 9. Accessed 7 January 2010. In South- American countries such as Argentina it is commonly used as a friendly manner to call a friend and not intended to offend anyone. This is sometimes shocking or confusing to other cultures that see this word as a forbidden one to be used.Argentina residets ==In English== Around 1442 the Portuguese first went to sub-Saharan Africa. They were trying to find a way to get to India by boat. The term \"negro\" was used by the Spanish and Portuguese as a simple description of people. It means \"black\". From the 18th century to the late 1960s, \"negro\" was the proper English-language term for most people of sub- Saharan African origin. Most people stopped using the word \"Negro\" by the early 1970s in the United States. Many older African Americans grew up when \"Negro\" was widely said to be the correct term. They thought the term \"Black\" was more offensive than \"Negro.\" This can be seen by the use the word by historical African-American organizations and institutions. Currently, \"Negro\" is generally thought to be not offensive when used in a historical way. For example, baseball's Negro Leagues of the early and mid-20th century. It is also used in the name of older organizations. These include Negro spirituals, the United Negro College Fund or the Journal of Negro Education. The U.S. Census now uses \"Black, African-American or Negro.\" The term \"Negro\" is used to try to include older African Americans who think it is a better term. ==Related pages== *African American *Black people *Mulatto *Nigger ==References== Category:Ethnic groups",
 "title": "Negro"
}