{
 "id": "327486",
 "text": "The Vought F4U Corsair was a fighter aircraft that fought in World War II and the Korean War. Vought could not keep up with demand for the aircraft, so Goodyear and Brewster made them.Shettle 2001, p. 107. It was deployed in large numbers starting in 1944, and has longest production run of any piston-engined fighter in U.S. history (1942–1953).O'Leary 1980, p. 116.Donald 1995, p. 244.Wilson 1996. The Corsair was used by the U.S. Navy, U.S. Marines, Fleet Air Arm and the Royal New Zealand Air Force, as well as the French Navy Aéronavale and other, smaller, air forces. Some Japanese pilots said it was the best American fighter of World War II,Jablonski 1979, p. 171. and the U.S. Navy reported an 11:1 kill ratio.Donald 1995, p. 246. Besides serving as a fighter, it became the most capable carrier-based fighter-bomber of World War II.Pilot's Manual 1979, Prologue. The F4U Corsair was an elite late-war fighter aircraft. The F4U corsair was primarily used by the U.S. Navy in the mid 1940’s and farther, but there were variations to create a ground-suitable model. These aircraft came equipped with several browning machine guns and a big engine, and a handy tow-hook, to assist in carrier landings. A unique characteristic of the F4U Corsair are its Gull Wings, as it began angled downwards, and then upwards. This was used for easy storing on aircraft- carriers. Though, many early accidents occured in the developing and testing of this aircraft for carrier landings. The Corsair also saw action in the Korean War and in the 1969 Soccer War. The Grumman F6F Hellcat was easier to fly The Corsair had early problems landing on an aircraft carrier, so its first combat flights were from land bases. There were three different types of the Corsair. * F4U Corsair 1-A with 6 light caliber browning machine guns, three on one wing. * F4U Corsair 1-D again with 6 light caliber browning machine gun * F4U Corsair 1-C equipped with 4 heavy caliber cannons, 2 on one wing. The Corsair had high agility. With its Pratt and Whitney R-2800 Double Wasp 18-cylinder engine producing over 2000 horsepower, the Corsair was the first US single engine fighter to fly faster than 400 miles per hour. During the war, the Corsair flew over 64,000 sorties, shot down over 2,000 enemy aircraft, and only lost 189 planes in action to the enemy. The aircraft designer, Rex Beisel, developed a new inverted gull wing design. This allowed the landing gear to be short and sturdy while still providing ground clearance for the propeller. ==References== Vought F4U Vought F4U Vought F4U",
 "title": "Vought F4U Corsair"
}