{
 "id": "327592",
 "text": "Shailene Woodley (born November 15, 1991) is an American actress. She has starred in television sitcoms. She and George Clooney starred in The Descendants. She starred in the Divergent movie trilogy adaptations based on Veronica Roth's novels. Woodley was raised in Simi Valley, California and has a younger brother named Tanner. ==Filmography== ===Film=== Year Title Role Notes 2007 Moola Ashley Hedges 2011 The Descendants Alexandra \"Alex\" King 2013 The Spectacular Now Aimee Finecky 2014 White Bird in a Blizzard Katrina \"Kat\" Connor Divergent Beatrice \"Tris\" Prior The Amazing Spider-Man 2 Mary Jane Watson Deleted scenes The Fault in Our Stars Hazel Grace Lancaster 9 Kisses Boxing Girl Short film 2015 The Divergent Series: Insurgent Beatrice \"Tris\" Prior 2016 The Divergent Series: Allegiant Snowden Lindsay Mills The Best Democracy Money Can Buy Herself Documentary 2017 Awake: A Dream From Standing Rock — Documentary, executive producer only 2018 Adrift Tami Oldham Also producer 2019 Endings, Beginnings Daphne 2021 The Mauritanian Teresa \"Teri\" Duncan 2021 The Fallout Anna 2021 The Last Letter from Your Lover Jennifer Stirling Also executive producer 2022 The Revolution Generation Herself Documentary 2023 To Catch a Killer Eleanor Falco Also producer Robots Elaine / E2 / E3 Materia Viva Herself Documentary Ferrari Lina Lardi Dumb Money Caroline Gill 2024 Killer Heat Penelope Vardakis TBA Motor City TBA Filming ===Television=== Year Title Role Notes 1999 Replacing Dad Little Girl Television film 2001–2003 The District Kristin Debreno 3 episodes 2001–2004 Crossing Jordan Young Jordan Cavanaugh 4 episodes 2003 Without a Trace Young Clare Metcalf Episode: \"Clare de Lune\" 2003–2004 Kaitlin Cooper 6 episodes 2004 Everybody Loves Raymond Snotty Girl #2 Episode: \"Party Dress\" California \"Cali\" Ford Television film 2004–2005 Jack & Bobby Chloe Benedict 2 episodes 2005 Felicity: An American Girl Adventure Felicity Merriman Television film Once Upon a Mattress Molly Television film My Name Is Earl Young Gwen Episode: \"My Name Is Earl (season 1)\" 2007 CSI: NY Evie Pierpont Episode: \"A Daze of Wine and Roaches\" Close to Home Gaby Tursi Episode: \"Getting In\" Cold Case Sarah Gunden Episode: \"Running Around\" Final Approach Maya Bender Television film 2008–2013 The Secret Life of the American Teenager Amy Juergens Main role, 121 episodes 2017, 2019 Big Little Lies Jane Chapman Main role, 14 episodes 2024 Three Women Gia Lombardi Main role, 10 episodes ===Theater=== Year Title Role Venue Ref. 2024 Cult of Love Diana Dahl Bennett Helen Hayes Theater, Broadway ===Music videos=== Year Title Artist(s) Role 2011 Our Deal Best Coast Day Trotter 2016 Stand Up / Stand N Rock #NoDAPL Taboo Singer Where's the Love? The Black Eyed Peas featuring The World Herself ===Video games=== Year Title Voice role 2016 Allegiant: VR Experience Beatrice \"Tris\" Prior ===Television=== Year Title Role Notes 1999 Replacing Dad Little Girl Television film 2001–2003 The District Kristin Debreno 3 episodes 2001–2004 Crossing Jordan Young Jordan Cavanaugh 4 episodes 2003 Without a Trace Young Clare Metcalf Episode: \"Clare de Lune\" 2003–2004 Kaitlin Cooper 6 episodes 2004 Everybody Loves Raymond Snotty Girl #2 Episode: \"Party Dress\" California \"Cali\" Ford Television film 2004–2005 Jack & Bobby Chloe Benedict 2 episodes 2005 Felicity: An American Girl Adventure Felicity Merriman Television film Once Upon a Mattress Molly Television film My Name Is Earl Young Gwen Episode: \"BB\" 2007 CSI: NY Evie Pierpont Episode: \"A Daze of Wine and Roaches\" Close to Home Gaby Tursi Episode: \"Getting In\" Cold Case Sarah Gunden Episode: \"Running Around\" Final Approach Maya Bender Television film 2008–2013 The Secret Life of the American Teenager Amy Juergens Main role, 121 episodes 2017, 2019 Big Little Lies Jane Chapman Main role, 14 episodes 2024 Three Women Gia Lombardi Main role, 10 episodes ==References== Category:1991 births Category:Living people Category:American child actors Category:American movie actors Category:Simi Valley, California Category:American television actors Category:American environmentalists Category:Actors from San Bernardino, California",
 "title": "Shailene Woodley"
}