{
 "id": "327695",
 "text": "Artillery in Japan is recorded in the 13th century. It was not used widely before the Sengoku period in the 16th century.Perrin, Noel. (1979). Giving up the Gun, Japan's Reversion to the Sword, 1543-1879, p. 93. ==History== In the 1840s, the Tokugawa Shogunate began to anticipate that either British or French military might attack Japan. Takashima Shuhan (1798-1866) submitted a petition to the shogun calling for the purchase of Western firearms. In 1841, a demonstration of Western gunnery made a strong impression.National Diet Library, \"Acceptance of Western Military Science at the End of Edo Period, Land Wrfare Tactics\"; retrieved 2012-2-22. Powerful conservative factions in the shogunate resisted change.Akamatsu, Paul. (2001). Meiji 1868: Revolution and Counter-revolution in Japan, PP. 50-51. During the 1864 Bombardment of Shimonoseki, European naval guns were shown to be superior to Japanese cannon on shore.Perrin, p. 76. Following the Meiji Restoration, Japan would pursue a policy of \"Rich country, strong army\" (富国強兵), which led to a general rearmament. ==Imperial Japanese Army == The Imperial Japanese Army (IJA) used artillery during the First Sino-Japanese War (1894–1895). Naval guns and field artillery were important in the Russo-Japanese War of 1905. Before and during World War II, the Japanese Army deployed a variety of artillery pieces. ==Imperial Japanese Navy== The Imperial Japanese Navy (IJN) developed large naval artillery pieces. ==Japan Self Defense Force (JSDF)== The self-propelled artillery of the current Japanese military include *Type 75 155 mm self- propelled howitzer *M110 howitzer *M270 MLRS *Type 99 155 mm self-propelled howitzer ==Related pages== * List of field guns * List of heavy mortars * List of howitzers ==References== ==Further reading== * Evans, David C and Mark Peattie. (1997). Kaigun: strategy, tactics, and technology in the Imperial Japanese Navy, 1887–1941 Naval Institute Press, Annapolis, Maryland ==Other websites== Category:Military of Japan Category:Artillery",
 "title": "Artillery of Japan"
}