{
 "id": "327750",
 "text": "Field guns are one of two main types of field artillery. Field guns fire a heavy shell on a relatively level trajectory from a longer barrel. This gives very high muzzle velocity and good range performance. Field guns are best for giving long range fire support and counter-battery fire. This list has two categories; field guns that were moved (towed) by horses or vehicles, and guns that could move themselves (self propelled) guns. ==Towed field guns== Caliber (mm) Weapon name Country of origin Period 70 Whitworth rifled breech loader American Civil War 75 Canon de 75 modèle 1897 World War I / World War II 75 Canon de 75 modèle 1905 Schneider World War I / World War II 75 Canon de 75 modèle 1912 Schneider World War I 75 Canon de 75 modèle 1914 Schneider World War I 75 Canon de 75 mle GP1 World War I 75 75 mm Gun M1897 World War I / World War II 75 Cannone da 75/27 modello 06 World War I / World War II 75 Cannone da 75/27 modello 11 World War I / World War II 75 Cannone da 75/32 modello 37 World War II 75 Canon de 75 mle TR World War I / World War II 75 Type 38 75 mm field gunUS War Dept. (1944). \"Model 38 75 mm field gun,\" US Technical Manual, Handbook on Japanese Military Forces, p. 221; retrieved 2012-2-18. 2nd Sino-Japanese War 75 Type 41 75 mm cavalry gun World War I 75 Reffye 75mm cannon 1870–1877 75 75 mm Gun M1916 World War I 75 75 mm Gun M1917 World War I 75 St Chamond 75 mm gun World War I 75 Canon de 75 mle GP11 World War II 75 Canon de 75 mle GP111 World War II 75 Type 90 75 mm field gun\"Model 90 75 mm field gun,\" pp. 222-223; retrieved 2012-2-18. 2nd Sino-Japanese War 75 Type 95 75 mm field gun\"Model 95 75 mm field gun,\" p. 223; retrieved 2012-2-18. 2nd Sino-Japanese War 75 Canon de 75 modèle 1922 Schneider World War II 75 7.5 cm FK 16 nA World War II 75 7.5 cm FK 18 World War II 75 7.5 cm FK 38 World War II 75 7.5 cm FK 7M85 World War II 76.2 RBL 12 pounder 8 cwt Armstrong gun 1860s 76.2 BL 12 pounder 7 cwt gun 1880s - 1890s 76.2 BL 12 pounder 6 cwt gun Second Boer War / World War I 76.2 BL 15 pounder 7 cwt gun Second Boer War / World War I 76.2 QF 12 pounder 8 cwt gun Second Boer War / World War I 76.2 76 mm gun M1900 World War I 76.2 76 mm divisional gun M1902 World War I 76.2 BLC 15 pounder gun World War I 76.2 QF 15 pounder Mk.I The Ehrhardt World War I 76.2 3-inch M1902 field gun pre–World War I 76.2 QF 13 pounder gun World War I 76.2 76 mm divisional gun M1902/30 World War II 76.2 76 mm divisional gun M1936 (F-22) World War II 76.2 76 mm divisional gun M1939 (USV) World War II 76.2 76 mm divisional gun M1942 (ZiS-3) World War II 76.5 8 cm Feldkanone M. 99 World War I 76.5 8 cm FK M. 5 World War I 76.5 8 cm FK M. 17 World War I / World War II 76.5 8 cm FK M 18 World War I 76.5 8 cm kanon vz. 30 World War II 77 7.7 cm FK 96 77 7.7 cm FK 96 n.A. World War I 77 7.7 cm FK 16 World War I 83.8 QF 18 pounder gun World War I / World War II 85 Reffye 85mm cannon 1870–1877 85 Canon de 85 modèle 1927 Schneider World War II 85 85 mm divisional gun D-44 Modern 87 87 mm light field gun M1877 87 9 cm Feldkanone M 75/96 World War I 90 De Bange 90mm cannon 1877- World War I 95 Lahitolle 95 mm cannon 1875- World War I 95.3 RBL 20 pounder Armstrong gun 1860s-1870s 100 100 mm field gun M1944 (BS-3) World War II 104 10.4 cm Feldkanone M. 15 World War I 105 CALIV Cañón Liviano 105L39 105 mm Helitransportable Light Gun In development 105 Canon de 105 mle 1913 Schneider World War I / World War II 105 Canon de 105 modèle 1925/27 Schneider World War II 105 Canon de 105 modèle 1930 Schneider World War II 105 Canon de 105 L mle 1936 Schneider World War II 105 Indian & Light Field Gun Modern 105 Type 14 105 mm cannon \"Model 14 105 mm cannon,\" pp. 223-225; retrieved 2012-2-18. 2nd Sino-Japanese War 105 Type 38 10 cm Cannon 2nd Sino-Japanese War 105 Type 92 105 mm cannon \"Model 92 105 mm cannon,\" pp. 226-228; retrieved 2012-2-18. 2nd Sino-Japanese War 105 10 cm K 04 World War I 105 10 cm K 14 World War I 105 10 cm K 17 World War I 105 10 cm sK 18 World War II 105 L118 Light Gun Modern 105 LG-1 Light Gun Modern 105 Bofors 10.5 cm Cannon Model 1927 World War II 105 Bofors 10.5 cm kanon m/34 World War II 105 10.5 cm hruby kanon vz. 35 World War II 107 42 line gun M1877 107 107 mm gun M1910 World War I 107 107 mm gun M1910/30 World War II 107 107 mm divisional gun M1940 (M-60) World War II 114 4.5 inch Mk II Medium World War II 114 4.5 inch Gun M1 World War II 117 M1857 12-Pounder Napoleon Field Gun American Civil War 120 Bofors 12 cm M. 14 World War II 120 Canone de 120 L mle 1931 World War II 120 QF 4.7 inch Gun Mk I - IV Second Boer War / World War I 120 4.7 inch Gun M1906 World War I 122 122 mm gun M1931 (A-19) World War II 122 122 mm gun M1931/37 (A-19) World War II 127 BL 60 pounder gun World War I / World War II 130 130 mm towed field gun M1954 (M-46) Cold War 130 Type 59 field gun Cold War 135 Krupp 13.5 cm FK 1909 World War I 140 BL 5.5 inch Gun World War II 149.1 Cannone da 149/35 A World War I / World War II 149.1 Cannone da 149/40 modello 35 World War II 149.1 Skoda K-series World War II 149.1 Skoda Model 1928 Gun World War II 149.1 15 cm L/40 Feldkanone i.R. World War I 149.1 15 cm Kanone 18 World War II 149.1 15 cm Kanone 39 World War II 149.1 Type 89 150 mm cannon \"Model 89 150 mm cannon,\" pp. 225-226; \"Japanese Artillery Weapons,\" CINCPAC-CINCPOA Bulletin 152-45, July 1945; retrieved 2012-2-18. 2nd Sino-Japanese War 149.3 15 cm Kanone 16 1917–1945 152.4 15 cm Autokanone M. 15/16 World War I / World War II 152.4 Cannone da 152/45 World War I / World War II 152.4 BL 6 inch Mk VII naval gun World War I 152.4 BL 6 inch Gun Mk 19 World War I / World War II 152.4 152 mm gun M1910/30 World War II 152.4 152 mm gun M1910/34 World War II 152.4 152 mm gun M1935 (Br-2) World War II 152.4 152 mm gun 2A36 Giatsint-B / M1976 Cold War 155 Canon de 155 GPF World War I World War II 155 Canone de 155 L mle 1924 World War II 155 155-mm Gun M1 / M2 / M59 Long Tom World War II 155 M198 howitzer Modern 155 M777 howitzer Modern 155 CITEFA Model 77 155 mm L33 gun Modern 155 CALA 30 155 mm L45 gun Modern 155 Norinco WAC-021 / W132 / PZL-45 155 Wahrendorff gun pre–World War I 173 17 cm Kanone 18 in Mörserlafette World War II 180 180 mm gun S-23 Cold War 203 8 inch Gun M1 World War II == Self- propelled field guns == Caliber (mm) Weapon name Country of origin Period 75 T12/M3 75 mm GMC World War II 75 SdKfz 234/3 schwerer Panzerspähwagen (7.5cm) World War II 75 SdKfz 250/8 leichter Schützenpanzerwagen (7.5cm) World War II 75 SdKfz 251/9 mittlerer Schützenpanzerwagen (7.5cm) World War II 76.2 SU-12 76.2 mm gun truck 1932–35 76.2 T-26A artillery support tank pre–World War II (few built) 76.2 BT-5A artillery support tank pre–World War II 76.2 BT-7A artillery support tank pre–World War II 76.2 SU-76 World War II 84 Birch gun 1920s 105 FV433 Abbot 149 Semovente 149/40 World War II 152 Gun Carrier Mark I World War I 155 Bandkanon 1A 155 155mm Gun Motor Carriage M40 155 M53 155mm Self-Propelled Gun 155 XM1203 NLOS Cannon Future Combat Systems 155 Norinco SP Gun 155 PLZ-45 155 Bhim T-6 self-propelled gun Modern 155 TAM VCA Modern 175 M107 Cold War 194 Canon de 194 mle GPF World War I - 1930s 203 8in Gun Motor Carriage T93 post World War II 240 T92 Howitzer Motor Carriage post World War II ==Related pages== * List of heavy mortars * List of howitzers ==Notes and references== Category:Artillery Category:Lists of weapons",
 "title": "List of field guns"
}