{
 "id": "327710",
 "text": "The AS-90 (Artillery System for the 1990s) is a lightly armoured self- propelled artillery gun. It is used by the British Army. It was first used in 1993.Additional deployment information Deagel.com The AS-90's official name is Gun Equipment 155 mm L131. The AS-90 is used by five regiments of the Royal Horse Artillery and Royal Artillery. AS-90 was designed and built by Vickers Shipbuilding and Engineering (VSEL, owned by BAE Systems since 1999). They made 179 AS-90s from 1992 to 1995. This cost £300 million. In 2002 BAE Systems were asked to give 96 British Army AS-90s a 52 calibre gun. This would make the range 30 km. With special shells, it would be able to reach 60 to 80 km.Armed Forces - a6a4 - British Army - Artillery - AS 90 However, this project ended up being ended.Army Technology - AS90 BRaveheart 155mm - Self Propelled Howitzer ==Development== AS-90 started in the mid-1980s. It was made on a \"gamble\" that the SP70 would fail. When this happened, the Ministry of Defence (MoD) asked for a new vehiicle. Four designs were handed in, and AS-90 was the only one that the MoD liked. The MoD has tried to get the Royal Navy's main ship gun to be able to use the barrel and breech from the AS-90.155MM Study Looks To Pack More Punch Into The Royal Navy's Fleet BAe Systems Press release, 14 December 2007 This would make the gun calibre of the British Army and Royal Navy the same. This would help with ammunition logistics. This would also make it possible for the Army and Navy to help each other develop weapons.Army to get new precision \"search and destroy\" anti-armour weapon MoD Press release, 20 November 2007 ==Design== The AS-90 has a special power unit. This is used so that the engine does not have to keep running. This is done to keep the batteries charged while the AS-90 is not moving. The gun can be started up when it is fully closed down in less than one minute. The AS-90 has a special computer called the Turret Control Computer (TCC). The TCC controls all main functions of the turret. == Features == * Crew: 5 * Length: 9.07 m * Width: 3.5 m * Height: 2.49 m * Weight: 45 tons * Ammunition carried: 48 shells. ==Different kinds of AS-90== AS-90D - Changed for use in the desert. This model has more cooling for the engine and other machines. AS-90 \"Braveheart\" - The AS-90 with the 52 calibre length gun. This project was cancelled. Haubicoarmata \"Krab\" - (eng. Howitzer-cannon Crab) A \"Braveheart\" turret on a Polish chassis. Designed in Poland by Huta Stalowa Wola and WB Electronics. , two Krab (\"Crab\") prototypes have been built. == References == == Other websites == * British Army information page on the AS-90 Category:Artillery Category:British Army equipment",
 "title": "AS-90"
}