{
 "id": "327816",
 "text": "A common year starting on Tuesday is a common year that begins on Tuesday, January 1 and ends on Tuesday, December 31. Thus, its dominical letter is F. Examples include 1985, 1991, 2002, 2013, 2019 and 2030 in the Gregorian calendar,\"A common year beginning on Tuesday\", jonstlouis.htmlplanet.com, 2011, webpage: HTMcal. or, likewise, 1997, 2003, 2014 and 2025 in the Julian calendar (see bottom tables). In this common year, January and October begin on Tuesday, February, March, and November begin on Friday, April and July begin on Monday, May begins on a Wednesday, June begins on a Saturday, August begins on a Thursday and September and December begin on Sunday. This common year is one of three common years with two Friday the 13ths, the other two being Common year starting on Sunday and Common year starting on Monday. The Friday the 13ths in this common year are in September and December. This characteristic share it with a Leap year starting on Monday. From July of the year preceding this type of year (either a Leap year starting on Sunday or Common year starting on Monday) is the longest gap (14 months) between two instances of Friday the 13th. Leap years starting on Saturday share this characteristic, from August of the year that precedes it (Common year starting on Friday) to October in that type of year. This common year is one of three common years with only one Friday the 17th, the others being Common year starting on Monday and Common year starting on Saturday. The only Friday the 17th in this common year is in May. Leap years starting on Monday share this characteristic. This common year is one of three common years with only one Tuesday the 13th, the others being Common year starting on Wednesday and Common year starting on Sunday. The only Tuesday the 13th in this common year is in August. Leap years starting on Monday share this characteristic, but also have another one in February. If the year following this type of year is a leap year, this type of year will have the longest gap between two instances of Tuesday the 13th, from August to October of the following year. If the year following this type of year is a common year, the gap is reduced to just 9 months as the next Tuesday the 13th is in May. In this common year, Martin Luther King Jr. Day is on its latest possible date, January 21, Valentine’s Day is on a Thursday, Presidents Day is on February 18, Daylight Savings Time begins on March 10, St. Patrick’s Day is on a Sunday, Mother’s Day is on May 12, Memorial Day is on May 27, Father’s Day is on June 16, Independence Day is on a Thursday, Labor Day is on September 2, Columbus Day is on its latest possible date, October 14, Halloween is on a Thursday, Daylight Savings Time ends on November 3, Veterans Day is on a Monday, Thanksgiving is on its latest possible date, November 28, and Christmas is on a Wednesday. In a 400-year cycle in the Gregorian Calendar, 44 or 11% of all years are common years starting on Tuesday. Like all common years, they occur in a pattern of 6-11-11 years (e.g. 2013, 2019, 2030, 2041). However, this pattern gets broken when there is a century year that is not a leap year. Over the past 400-year cycle (from 1600 to 2000), there was a 12-year gap between 1697 and 1709, 6-year gaps between 1793, 1799, 1805 and 1811 and 6-year gaps between 1889, 1895, 1901 and 1907. In the Julian Calendar there are three common years starting on Tuesday in a 28-year cycle. Millennium | Century | Gregorian Year | 2nd Millennium: | 18th century: | 1754 | 1765 | 1771 | 1782 | 1793 | 1799 ---|---|---|---|---|---|---|--- 2nd Millennium: | 19th century: | 1805 | 1811 | 1822 | 1833 | 1839 | 1850 | 1861 | 1867 | 1878 | 1889 | 1895 2nd Millennium: | 20th century: | 1901 | 1907 | 1918 | 1929 | 1935 | 1946 | 1957 | 1963 | 1974 | 1985 | 1991 3rd Millennium: | 21st century: | 2002 | 2013 | 2019 | 2030 | 2041 | 2047 | 2058 | 2069 | 2075 | 2086 | 2097 3rd Millennium: | 22nd century: | 2109 | 2115 | 2126 | 2137 | 2143 | 2154 | 2165 | 2171 | 2182 | 2193 | 2199 Millennium | Century | Julian Year \"Calendar in year 1801 (Russia)\" (Julian calendar, starting Tuesday), webpage: Julian-1801 (Romania used Julian in 1919, when Russia adopted Gregorian). | 2nd Millennium: | 19th century: | 1801 | 1807 | 1818 | 1829 | 1835 | 1846 | 1857 | 1863 | 1874 | 1885 | 1891 ---|---|---|---|---|---|---|---|---|---|---|---|--- 2nd Millennium: | 20th century: | 1902 | 1913 | 1919 | 1930 | 1941 | 1947 | 1952 | 1958 | 1969 | 1975 | 1986 | 1997 3rd Millennium: | 21st century: | 2003 | 2014 | 2025 | 2031 | 2042 | 2053 | 2059 | 2070 | 2081 | 2087 | 2098 3rd Millennium: | 22nd century: | 2109 | 2115 | 2126 | 2137 | 2143 | 2154 | 2165 | 2171 | 2182 | 2193 | 2199 ==Notes== Category:Calendars",
 "title": "Common year starting on Tuesday"
}