{
 "id": "327819",
 "text": "A common year starting on Friday is a common year that starts on Friday, January 1 and ends on Friday, December 31. Thus, its dominical letter is C. Examples include 1971, 1982, 1993, 1999, 2010, 2021, and 2027 in the Gregorian calendar\"A common year beginning on Friday\", jonstlouis.htmlplanet.com, 2011, webpage: HTMcal. or, likewise, 1994, 2005, 2011, 2022, and 2033 in the Julian calendar. This common year is one of the three possible common years in which a century year can begin on, and occurs in century years that yield a remainder of 100 when divided by 400. The most recent such year was 1700 and the next one will be 2100 in the Gregorian calendar (see bottom tables). In this common year, January and October start on Friday, February, March, and November start on Monday, April and July start on Thursday, May starts on Saturday, June starts on Tuesday, August starts on Sunday and September and December start on Wednesday. This is one of three common years with only one Friday the 13th, the other two being Common year starting on Wednesday and Common year starting on Saturday. The Friday the 13th in this common year is in August. This characteristic is shared with Leap Years starting on Thursday but also have another one in February. If the year following this type of year is a leap year, this type of year will have the longest gap between two instances of Friday the 13ths, from August of this year to October of the following year. If the year following this type of year is a common year, the gap is reduced to 9 months as the next Friday the 13th is May. This is one of three common years with two Friday the 17ths, the other two being Common year starting on Wednesday and Common year starting on Thursday. The Friday the 17ths in this common year are in September and December. Leap years starting on Thursday share this characteristic. From July of the year preceding this year (either a Leap year starting on Wednesday or Common year starting on Thursday) is the longest gap (14 months) between two instances of Friday the 17ths. Leap years starting on Tuesday share this characteristic, from August of the year that precedes it (Common year starting on Monday) to October in that type of year. This is one of three common years with two Tuesday the 13ths, the other two being Common year starting on Thursday and Common year starting on Saturday. The Tuesday the 13ths in this common year are in April and July. Leap years starting on Thursday share this characteristic, but also have another one in January. Additionally, if the year following this type of year is a common year, this type of year will have the longest gap (14 months) between two instances of Tuesday the 13ths, from July in this year to September of the following year. If the following year is a leap year, the gap is reduced to 11 months as the next Tuesday the 13th is in June. In this common year, Martin Luther King Jr. Day is on January 18, Valentine’s Day is on a Sunday, Presidents Day is on its earliest possible date, February 15, Daylight Savings Time begins on its latest possible date, March 14, St. Patrick’s Day is on a Wednesday, Mother’s Day is on May 9, Memorial Day is on its latest possible date, May 31, Father’s Day is on June 20, Independence Day is on a Sunday, Labor Day is on September 6, Columbus Day is on October 11, Halloween is on a Sunday, Daylight Savings Time ends on its latest possible date, November 7, Veterans Day is on a Thursday, Thanksgiving is on November 25, and Christmas is on a Saturday. This common year has the longest gap between Halloween (October 31) and the end of Daylight Savings Time (November 7) by 7 days. Prior to 2007, Daylight Saving Time ended on Halloween in this common year. The last such year when this happened was in 1999, though it also happened in 2004 as it also happens in a Leap year starting on Thursday. This is the only type of year with a rectangular February in places where Monday is the first day of the week. The other year where a rectangular February is possible is Common year starting on Thursday in places where Sunday is considered the first day of the week. This common year has three months (February, March, and November) that begin on the first day of the week in places where Monday is considered the first day of the week. Leap years starting on Monday share this characteristic, in the months of January, April, and July. In a 400-year cycle in the Gregorian Calendar, 43 or 10.75% of all years are common years starting on Friday. Like all common years, they occur in a pattern of 6-11-11 years (e.g. 1993, 1999, 2010, 2021). However, this pattern gets broken when there is a century year that is not a leap year. Over the past 400-year cycle (from 1600 to 2000), there were 6-year gaps between 1694, 1700, and 1706, a 12-year gap between 1790 and 1802 and another 12-year gap between 1897 and 1909. In the Julian Calendar there are three common years starting on Friday in a 28-year cycle. Millennium | Century | Gregorian Year ---|---|--- 2nd Millennium: | 19th century: | 1802 | 1813 | 1819 | 1830 | 1841 | 1847 | 1858 | 1869 | 1875 | 1886 | 1897 2nd Millennium: | 20th century: | 1909 | 1915 | 1926 | 1937 | 1943 | 1954 | 1965 | 1971 | 1982 | 1993 | 1999 3rd Millennium: | 21st century: | 2010 | 2021 | 2027 | 2038 | 2049 | 2055 | 2066 | 2077 | 2083 | 2094 | 2100 3rd Millennium: | 22nd century: | 2106 | 2117 | 2123 | 2134 | 2145 | 2151 | 2162 | 2173 | 2179 | 2190 Millennium | Century | Julian Year \"Calendar in year 1809 (Russia)\" (Julian calendar, starting Tuesday), webpage: Julian-1809 (Romania used Julian in 1919, when Russia adopted Gregorian). | 2nd Millennium: | 19th century: | 1809 | 1815 | 1826 | 1837 | 1843 | 1854 | 1865 | 1871 | 1882 | 1893 | 1899 ---|---|---|---|---|---|---|---|---|---|---|---|--- 2nd Millennium: | 20th century: | 1910 | 1921 | 1927 | 1938 | 1949 | 1955 | 1966 | 1977 | 1983 | 1994 3rd Millennium: | 21st century: | 2005 | 2011 | 2022 | 2033 | 2039 | 2050 | 2061 | 2067 | 2078 | 2089 | 2095 3rd Millennium: | 22nd century: | 2106 | 2117 | 2123 | 2134 | 2145 | 2151 | 2162 | 2173 | 2179 | 2190 This is the only year type where the nth \"Doomsday\" (this year Sunday) is not in ISO week n; it is in ISO week n-1. ==References== Category:Calendars",
 "title": "Common year starting on Friday"
}