{
 "id": "327821",
 "text": "A common year starting on Sunday is a common year that begins on Sunday, January 1 and ends on Sunday, December 31. Thus, its dominical letter is A. Examples include 1978, 1989, 1995, 2006, 2017, 2023, and 2034 in the Gregorian calendar, or, likewise, 1990, 2001, 2007, 2018, and 2029 in the Julian calendar. In this common year, January and October start on Sunday, February, March, and November start on Wednesday, April and July start on Saturday, May starts on Monday, June starts on Thursday, August starts on Tuesday, and September and December start on Friday. This common year is one of three common years with two Friday the 13ths, the other two being Common year starting on Monday and Common year starting on Tuesday. The Friday the 13ths in this common year are in January and October. This common year is the only one with three Friday the 17ths. The Friday the 17ths in this common year are in February, March, and November. The other type of year with three Friday the 17ths is Leap year starting on Wednesday, which has Friday the 17ths in January, April, and July. This common year is one of three common years with only one Tuesday the 13th, the other two being Common year starting on Tuesday and Common year starting on Wednesday. The only Tuesday the 13th in this common year is in June. Leap years starting on Saturday share this characteristic. In this common year, Martin Luther King Jr. Day is on January 16, Valentine’s Day is on a Tuesday, Presidents Day is on February 20, Daylight Savings Time begins on March 12, St. Patrick’s Day is on a Friday, Mother’s Day is on its latest possible date, May 14, Memorial Day is on May 29, Father’s Day is on June 18, Independence Day is on a Tuesday, Labor Day is on September 4, Columbus Day is on October 9, Halloween is on a Tuesday, Daylight Savings Time ends on November 5, Veterans Day is on a Saturday, Thanksgiving is on November 23, and Christmas is on a Monday. In a 400-year cycle in the Gregorian Calendar, 43 or 10.75% of all years are common years starting on Sunday. Like all common years, they occur in a pattern of 6-11-11 years (e.g. 1989, 1995, 2006, 2017). However, this pattern gets broken when there is a century year that is not a leap year. Over the past 400-year cycle (from 1600 to 2000), there was a 12-year gap between 1690 and 1702, another 12-year gap between 1797 and 1809, and 6-year gaps between 1893, 1899, 1905, and 1911. In the Julian Calendar, there are three common years starting on Sunday in a 28-year cycle. # Millennium | Century | Gregorian year\"A common year beginning on Sunday\", jonstlouis.htmlplanet.com, 2011, webpage: HTMcal. | 2nd millennium: | 18th century: | 1758 | 1769 | 1775 | 1786 | 1797 ---|---|---|---|---|---|--- 2nd millennium: | 19th century: | 1809 | 1815 | 1826 | 1837 | 1843 | 1854 | 1865 | 1871 | 1882 | 1893 | 1899 2nd millennium: | 20th century: | 1905 | 1911 | 1922 | 1933 | 1939 | 1950 | 1961 | 1967 | 1978 | 1989 | 1995 3rd millennium: | 21st century: | 2006 | 2017 | 2023 | 2034 | 2045 | 2051 | 2062 | 2073 | 2079 | 2090 | 3rd millennium: | 22nd century: | 2102 | 2113 | 2119 | 2130 | 2141 | 2147 | 2158 | 2169 | 2175 | 2186 | 2197 Millennium | Century | Julian year \"Calendar in year 1805 (Russia)\" (Julian calendar, starting Tuesday), webpage: Julian-1805 (Romania used Julian in 1919, when Russia adopted Gregorian). | 2nd millennium: | 19th century: | 1805 | 1811 | 1822 | 1833 | 1839 | 1850 | 1861 | 1867 | 1878 | 1889 | 1895 ---|---|---|---|---|---|---|---|---|---|---|---|--- 2nd millennium: | 20th century: | 1906 | 1917 | 1923 | 1934 | 1951 | 1962 | 1973 | 1979 | 1990 | 1996 | 3rd millennium: | 21st century: | 2001 | 2007 | 2018 | 2029 | 2035 | 2046 | 2057 | 2063 | 2074 | 2091 | 3rd millennium: | 22nd century: | 2102 | 2113 | 2119 | 2130 | 2141 | 2147 | 2158 | 2169 | 2175 | 2186 | 2197 ==Notes== Category:Calendars",
 "title": "Common year starting on Sunday"
}