{
 "id": "327817",
 "text": "A common year starting on Monday is a common year that begins on Monday, January 1 and ends on Monday, December 31. Thus, its dominical letter is G. Examples include 1979, 1990, 2001, 2007, 2018 and 2029 in the Gregorian calendar,\"A common year beginning on Monday\", jonstlouis.htmlplanet.com, 2011, webpage: HTMcal. or, likewise, 1991, 2002, 2013, 2019, and 2030 in the Julian calendar. This common year is one of the three possible common years in which a century year can begin on, and occurs in century years that yield a remainder of 300 when divided by 400. The most recent such year was 1900 and the next one will be 2300 in the Gregorian calendar (See tables at bottom). In this common year, January and October start on Monday, February, March and November start on Thursday, April and July start on Sunday, May starts on Tuesday, June starts on Friday, August starts on Wednesday and September and December start on Saturday. This common year is one of three common years with two Friday the 13ths, the other two being Common year starting on Sunday and Common year starting on Tuesday. The Friday the 13ths in this common year are in April and July. This characteristic is shared with Leap year starting on Sunday but they also have another one in January. If the following year is a common year, this type of year will have the longest gap (14 months) between two instances of Friday the 13th, from July of this year to September the following year. If the following year is a leap year, the gap is reduced to 11 months as the next Friday the 13th is in June. This common year is one of three common years with only one Friday the 17th, the others being Common year starting on Tuesday and Common year starting on Saturday. The only Friday the 17th in this common year is in August. Leap years starting on Sunday share this characteristic, but also have another one in February. If the year following this type of year is a leap year, this type of year will have the longest gap (14 months) between two instances of Friday the 17th, from August of this year to October the following year. If the year following this type of year is a common year, the gap is reduced to 9 months as the next Friday the 17th is in May. This common year is the only one with three Tuesday the 13ths. The Tuesday the 13ths in this common year are in February, March, and November. The other type of year with three Tuesday the 13ths is Leap year starting on Thursday, which has Tuesday the 13ths in January, April, and July. In this common year, Martin Luther King Jr. Day is on its earliest possible date, January 15, Valentine’s Day is on a Wednesday, Presidents Day is on February 19, Daylight Savings Time begins on March 11, St. Patrick’s Day is on a Saturday, Mother’s Day is on May 13, Memorial Day is on May 28, Father’s Day is on June 17, Independence Day is on a Wednesday, Labor Day is on September 3, Columbus Day is on its earliest possible date, October 8, Halloween is on a Wednesday, Daylight Savings Time ends on November 4, Veterans Day is on a Sunday, Thanksgiving is on its earliest possible date, November 22, and Christmas is on a Tuesday. In a 400-year cycle in the Gregorian Calendar, 43 or 10.75% of all years are common years starting on Monday. Like all common years, they occur in a pattern of 6-11-11 years (e.g. 2001, 2007, 2018, 2029). However, this pattern gets broken when there is a century year that is not a leap year. Over the past 400-year cycle (from 1600 to 2000), there was a 12-year gap between 1691 and 1703, another 12-year gap between 1798 and 1810 and 6-year gaps between 1894, 1900 and 1906. In the Julian Calendar there are three common years starting on Monday in a 28-year cycle. Millennium | Century | Gregorian Year ---|---|--- 2nd Millennium: | 19th century: | 1810 | 1821 | 1827 | 1838 | 1849 | 1855 | 1866 | 1877 | 1883 | 1894 | 1900 2nd Millennium: | 20th century: | 1906 | 1917 | 1923 | 1934 | 1945 | 1951 | 1962 | 1973 | 1979 | 1990 3rd Millennium: | 21st century: | 2001 | 2007 | 2018 | 2029 | 2035 | 2046 | 2057 | 2063 | 2074 | 2085 | 2091 : | 22nd century: | 2103 | 2114 | 2125 | 2131 | 2142 | 2153 | 2159 | 2170 | 2181 | 2187 | 2198 Millennium | Century | Julian Year \"Calendar in year 1806 (Russia)\" (Julian calendar, starting Tuesday), webpage: Julian-1806 (Romania used Julian in 1919, when Russia adopted Gregorian). | 2nd Millennium: | 19th century: | 1806 | 1817 | 1823 | 1834 | 1845 | 1851 | 1862 | 1873 | 1879 | 1890 ---|---|---|---|---|---|---|---|---|---|---|--- 2nd Millennium: | 20th century: | 1901 | 1907 | 1918 | 1929 | 1935 | 1946 | 1957 | 1963 | 1974 | 1985 | 1991 3rd Millennium: | 21st century: | 2002 | 2013 | 2019 | 2030 | 2041 | 2047 | 2058 | 2069 | 2075 | 2086 | 2097 3rd Millennium: | 22nd century: | 2103 | 2114 | 2125 | 2131 | 2142 | 2153 | 2159 | 2170 | 2181 | 2187 | 2198 ==References== Category:Calendars",
 "title": "Common year starting on Monday"
}