{
 "id": "327962",
 "text": "In science fiction, an ion cannon is a beam weapon. It shoots beams of ions (atoms or molecules with an electrical charge). Because of its power, it is usually said to be a superweapon. An ion cannon is a type of particle cannon. The particles it shoots are ionized. Because of their electrical charges, they can cause electronic devices, vehicles, and anything else that has an electrical or similar power source to stop working. Ion cannons are used in many science-fiction movies and television series. Ion cannons are also used in many video games. ==Real-world connections== The science fiction idea for these weapons comes from the particle cannon created by Nikola Tesla. Tesla's cannon shot ions into the ionosphere. This caused them to be charged more. Research of this idea is still being done with directed-energy weapons. ==Media references== * In the Star Wars universe, Ion weapons are common. They range from handheld pistols to star ship cannons. Ion weapons are mainly used to stop electronic systems from working. They can stop vehicles, droids and starships without doing any damage. In Star Wars Episode V: The Empire Strikes Back, the Rebel Alliance uses a large ion cannon on the planet Hoth to disable Imperial Star Destroyers near the planet. This is done to stop them from firing on Rebel ships trying to leave the planet. The Jawas used ion blasters to disable R2-D2. * In StarCraft, Raynor's faction is stopped from leaving because of Tarsonis' ion cannon. The weapon is destroyed as part of a mission. * In the computer game Conquest: Frontier Wars, huge Ion Cannon space stations can be built. * In Master of Orion 2, Ion cannons are used to damage ship's internal systems. They are not stopped by armor. * In the Pixar movie WALL-E, the robot EVE has an ion cannon in her right arm. * Destroy All Humans! and its sequels has a weapon called the Ion Detonator. * In the Command & Conquer franchise the Global Defense Initiative (GDI) uses an orbital ion cannon as that faction superweapon. * In Microsoft Urban Assault, a technologically- advanced alien faction Mykonians possess weapon systems that are entirely comprised of various types of ion cannons for their armament. ==Other websites== * Watch the C&C; Ion Cannon in action. (Created by Tiberian Dawn Mod team) Category:Science fiction technology Category:Weapons",
 "title": "Ion cannon"
}