{
 "id": "328087",
 "text": "The Orion nebula, or Messier 42, M42, or NGC 1976, is a diffuse nebula. It is visible to the naked eye in the night sky. It is exceptionally bright because it has O-type stars at its core. They are the hottest and brightest stars. The nebula is south of Orion's Belt in the constellation of Orion. M42 is 1,344 ± 20 light years away from us.Reid M.J. et al 2009. Trigonometric parallaxes of massive star forming regions: VI. Galactic structure, fundamental parameters and non-circular motions. Astrophysical Journal 700: 137. Hirota, Tomoya et al 2007. Distance to Orion KL measured with VERA. Publications of the Astronomical Society of Japan 59 (5): 897–903. It is the closest region of massive star formation to Earth. Big as it is, the Orion nebula is just part of an even larger star-forming area known as the Orion complex. == Stellar nursery == The nebula is a huge stellar nursery. 700 stars are in the process of forming there. At its heart is a very young open cluster, known as the Trapezium because of the pattern formed by its main stars. Recent observations with the Hubble Space Telescope have shown protoplanetary disks inside the Orion Nebula. This is a major discovery. They are called proplyds for short. There are more than 150 of these in the nebula. They are thought to be to be systems in the earliest stages of planetary system formation. The sheer numbers have been used as evidence that the formation of star systems is fairly common in the universe. Stars form when clumps of hydrogen and other gases in an H II region contract under their own gravity. As the gas collapses, the central clump grows stronger and the gas heats to extreme temperatures by converting gravitational potential energy to thermal energy. If the temperature gets high enough, nuclear fusion will start, and form a protostar. The protostar is 'born' when it begins to emit enough energy to balance out its gravity and halt gravitational collapse. == References == Category:Nebulae",
 "title": "Orion nebula"
}