{
 "id": "328078",
 "text": "Infantry guns are designed to give direct support for infantry forces. They fire a range of shells, usually directly at their target. Most are lightweight and can be manhandled for limited mobility to accompany infantry. == Towed infantry guns == Caliber (mm) Weapon name Country of origin Period 37 Canon d'Infanterie de 37 modèle 1916 TRP World War I 37 Type 11 infantry gun World War II 37 37-mm trench gun M1915 World War I 38 Hughes Breech-loading cannon American Civil War 40 1.59 inch Breech-Loading Vickers Q.F. Gun, Mk II World War I 75 Bofors 75 mm L/20 Interwar 75 leIG 18 World War II 75 leIG 18 F World War II 75 7.5 cm Infanteriegeschütz 37 World War II 75 7.5 cm Infanteriegeschütz 42 World War II 76 76 mm Canon de 76 Fonderie Royale des Canons Interwar/World War II 76.2 7.62 cm Infanteriegeschütz L/16.5 World War I 77 7.7 cm Infanteriegeschütz L/20 World War I 77 7.7 cm Infanteriegeschütz L/27 World War I 150 15 cm sIG 33 World War II == Self-propelled infantry guns == Self-propelled infantry guns named Assault guns are guns mounted in armored vehicles designed to provide direct fire support for infantry and armored forces. Typically, the gun is mounted in the hull and the front of the vehicle most heavily armored. Caliber (mm) Weapon name Country of origin Period 57 ASU-57 Cold War (1951) 75 StuG III World War II 75 StuG IV World War II 75 Semovente 75/18 World War II 85 Semovente 75/34 World War II 75 Semovente 75/46 World War II 76 Rooikat 76 modern 76.2 SU-76 World War II (1942) 76.2 SU-76i World War II (1943) 85 ASU-85 Cold War 90 Semovente 90/53 World War II 96 Tank, Heavy Assault, Tortoise (A39) World War II 105 StuH 42 World War II 105 Rooikat 105 Modern 105 Semovente 105/25 World War II 114 BT-42 World War II 122 SU-122 World War II 122 ISU-122 World War II (1943) 150 Sturmpanzer IV World War II 150 15 cm sIG 33 (Sf) auf Panzerkampfwagen I World War II 150 15 cm sIG 33 auf Fahrgestell Panzerkampfwagen II World War II 150 15 cm sIG 33/1 on Panzer III chassis World War II 150 15 cm sIG 33 (Sf) auf Panzerkampfwagen 38(t) World War II 152 SU-152 World War II (1943) 179 ISU-152 World War II (1943) ==References== Category:Artillery Category:Lists of weapons",
 "title": "List of infantry guns"
}