{
 "id": "328160",
 "text": "The French Revolutionary Wars are conflicts between 1792 and 1802 that started by the French Revolution in which France fought Britain, Austria, Prussia, Russia and several other countries that were called monarchies. There are (mostly) two conflicts: the War of the First Coalition (1792–1797) and the War of the Second Coalition (1798–1802). The fighting was at first mainly in Europe but then spread across the world. After ten years of fighting, France took much land from what is now Italy, Belgium, Luxembourg, the Netherlands and Germany and gave up Louisiana, which is now in the United States and Canada. Because France won the wars, it spread revolutionary ideas across much of Europe. The French Revolution removed the King of France, King Louis XVI, from power. As early as 1791, the other monarchies of Europe hated the French Revolution and wondered if they should intervene to stop the revolution from spreading, or they should take advantage of the disorder in France. Austria put many troops next to its French border and, together with Prussia, threatened France if it hurt King Louis and his wife, Queen Marie Antoinette in the Declaration of Pillnitz. After Austria refused to move its troops away from the French border or to stop threatening France, a French declaration of war on Austria and Prussia happened in the spring of 1792. Both countries then invaded France, but France won the Battle of Valmy in September. The victory gave the National Convention, a new French government, the confidence to get rid of the monarchy.TCW Blanning, The French Revolutionary Wars. pp. 78–79. France won more battles but was stopped after it was defeated at Neerwinden, now in Belgium, in the spring of 1793. France lost more battles for the rest of the year, and the difficult times allowed the Jacobins to rise to power and start the Reign of Terror, which killed people who opposed the revolution. In 1794, the situation was very good for France, which won huge battles against the Austrians and the Spanish. That started a new stage in the wars. By 1795, the French took land in much of present-day Belgium from Austria and land in much of the present-day Netherlands from the Dutch. France also made Spain and Prussia sign peace treaties to end the war. A general, Napoleon Bonaparte, who was mostly unknown, began his first campaign in Italy in April 1796. In less than a year, he led French armies that destroyed the Habsburg forces, kicked them out of Italy, won almost every battle and took 150,000 prisoners. After France started to get near Vienna, the capital of Austria, the Austrians surrendered and ended the War of the First Coalition against France. The War of the Second Coalition began in 1798 after Napoleon invaded Egypt. The other countries took advantage of Napoleon being far away to take back lost land taken by France. The war began well for them in Europe, and they kicked France out of Italy, invaded Switzerland and won many battles along the way. However, they quickly started to lose after France won a battle at Zürich in September 1799, which made Russia stop fighting.TCW Blanning, The French Revolutionary Wars. pp. 254–55. Meanwhile, Napoleon destroyed many Egyptian and Ottoman armies. Napoleon's victories in Egypt made him more popular back in France, and he returned home successful in the autumn of 1799 although he had failed his goal in Egypt. Also, the Royal Navy had won the Battle of the Nile in 1798, which gave Britain more powerful control of the Mediterranean and weakened the French Navy. Napoleon overthrew the Directory, the government of France, in a coup after he had arrived in France. He became a dictator with the title of First Consul. Napoleon then reorganised the French Army and attacked the Austrians in Italy during the spring of 1800. France won the Battle of Marengo in June 1800, which made Austria leave Italy once again. France won again at Hohenlinden, Bavaria, and made Austria surrender for a second time after the signing of the Treaty of Lunéville in 1801. Britain was alone after Austria and Russia stopped fighting, and agreed to the Treaty of Amiens with France in 1802, which ended the Revolutionary Wars. However, both countries still hated each other, and the Napoleonic Wars began over a year later after the Third Coalition had been formed. == References == Category:Revolutions Category:Wars involving France Category:1790s in Europe Category:1800s in Europe Category:18th-century conflicts Category:19th-century conflicts als:Koalitionskriege",
 "title": "French Revolutionary Wars"
}