{
 "id": "328144",
 "text": "In Gaza, same-sex sexual activity is criminalized and carries a maximum penalty of 10 years imprisonment. In addition, in the Palestinian territories there are no laws that specifically protect LGBT people from discrimination (not being treated equally because they are LGBT) or harassment. However, the Basic Law of the Palestinian Constitution claims to give all Palestinians certain freedoms. It covers freedom of belief, freedom of expression, and freedom of bodily integrity. It also gives Palestinians freedom from discrimination \"because of race, sex, color, religion, political views, or disability\". The Basic Law also protects people's human rights. In other countries, people have used these types of laws and freedoms to argue that LGBT rights should exist. In the West Bank and the Gaza Strip, the Palestinian Authority has not made laws either for or against homosexuality. Instead, the President of the Palestinian Authority decided to keep the laws that were already in place in the Gaza Strip and West Bank. On May 20, 1994, he ruled that laws that took effect before June 5, 1967 in these areas would not be changed. The laws are also more complicated because the Palestinian territories have been ruled by many different foreign powers, like the Ottoman Empire, the British Empire, Jordan, and Egypt. Each of these foreign powers, along with Israel, created their own laws for the Palestinian-occupied Israeli territories. Because of the many different laws that have been in place there, the legal situation in the territories is confusing. Sometimes, the criminal law about homosexuality is used in the territories. At other times it is not. It can be different in the different territories. ==Related pages== *LGBT rights in Israel ==References== Palestine Category:Politics of Palestine Category:LGBT-related controversies Category:public diplomacy of Israel Category:LGBT in Asia Category:LGBT in the Middle East",
 "title": "LGBT rights in the State of Palestine"
}