{
 "id": "328150",
 "text": "Cathy Cassidy (born 13 June 1962) is an English author of teenage books mainly based on domestic fiction. At the age of eight she wrote her first picture book for her brother, Jake. During her childhood, Cathy loved to create comics. She would often rent out comics to her friends for 5 pence, claim them back and then rent them out again to someone else. ==School life and early career== Cathy attended an art college in Liverpool as a young adult. After passing her degree, Cathy worked for the Jackie Magazine, as a fiction editor. Cathy has taught as an art teacher in a number of schools - 7 primary and some secondary. She illustrates many of her books and has done so for all her books in a series of Daisy Star. ==Personal life== Cassidy lives in Galloway, Scotland, with her husband Liam and her two children, Caitlin (aged 17) and Calum (aged 19). Cathy has been a veggie for 35 years and a vegan for eight of them. She has a lurcher, named Kelpie, who inspired the dog Legg-It in Dizzy, her first book. ==Writing career== Cathy Cassidy has currently written fourteen books. Her first book was Dizzy published in 2004, followed on by Indigo Blue, published in 2005. At the age of 50, Cathy Cassidy's last books were Marshmallow Skye and The Chocolate Box Girls. ==Works== *Dizzy (2004), *Indigo Blue (2005), *Driftwood (2005), *Scarlett (2006), *Sundae Girl (2007), *Lucky Star (2007), *Gingersnaps (2008), *The Cathy Cassidy Dreams and Doodles Daybook (2008), *Shine on, Daizy Star (2009), *Angel Cake (2009), *Letters to Cathy (2009), *Daizy Star and the Pink Guitar (2010), *Cherry Crush - the Chocolate Box Girls (2010), *Strike a Pose, Daizy Star (2011) and *Marshmallow Skye, The Chocolate Box Girls (2011). She has also written three mini-books: *Love Peace and Chocolate (2007), *Ice-cream and Dreams (2008) and *Cupcakes and Kisses (2009). Cathy is also currently writing three new additions to the Chocolate Box Girls series, named: 'Summer's Dream', 'Coco Caramel' and 'Sweet Honey', based on the other Tanberry sisters. The plots for 'Coco Caramel' and 'Sweet Honey' have not been confirmed yet, however, 'Summer's Dream' plot has been confirmed. ==References== ==Other websites== *Official website Category:1962 births Category:Living people Category:British children's writers",
 "title": "Cathy Cassidy"
}