{
 "id": "328273",
 "text": "Sasha Grey (born Marina Ann Hantzis on March 14, 1988) is an American former pornographic actress, who now does ordinary acting, modelling, and music. She was born and raised in North Highlands, California. In 2005, she started taking acting, dancing and music lessons. After she turned 18, she started to participate in pornographic movies in Los Angeles. She is openly bisexual.Interview Grey has released two books. A photo book, Neü Sex, was released on March 29, 2011 by VICE books. On May 9, 2013 The Juliette Society, an erotic novel, was published by Sphere. She has been in three music videos. ==Filmography== ===Film=== Year Title Role 2007 Homo Erectus Cavegirl Broken Herself 2008 9 to 5: Days in Porn Circa '82 Herself 2009 Chelsea / Christine Brown Smash Cut April Carson This Ain't Star Trek XXX Chandra Seinfeld: A XXX Parody Herself Sexpo Australia (2009) 2010 Quit Mini-mart clerk The New Erotic: Art Sex Revolution 2011 I Melt With You Raven Membunuh: Murder Bikini-clad ghost 2012 The Girl from the Naked Eye Lena Would You Rather Amy Inferno: A Linda Lovelace Story 2014 Open Windows Jill Goddard The Scribbler Bunny 2017 Black Licorice Herself ===Series=== Year Title Role Notes Publisher 2009 Porn: Business of Pleasure 1 episodeCNBC (July 15, 2009). CNBC James Gunn's PG Porn Tricia Scrotey Roadside Ass-istance Web series 2010 Entourage Herself 6 episodes HBO 2013 Sexy NSA Commercial Herself 1 episodeFunny Or Die (July 1, 2013). Funny or Die Durch die Nacht mit … …Sasha Grey und Mary Ocher Arte 2018 Into the Dark Party DJ The Body Hulu ===Music videos=== Year Title Role Musicians 2007 Superchrist Dancer The Smashing Pumpkins 2008 Birthday Girl Birthday Girl The Roots 2011 Space Bound Girl Eminem 2014 ToxicDavid J (April 15, 2014). , covering Britney Spears. Villainess David J ===Video games=== Year Title Role Notes 2011 Saints Row: The Third Viola DeWynter Voice 2015 Saints Row: Gat Out of Hell ==References== ==Other websites== * Category:1988 births Category:Living people Category:Actors from Sacramento County, California Category:American adult models Category:American LGBT sex industry people Category:American movie actors Category:American pornographic actors Category:American television actors Category:Bisexual people Category:LGBT models Category:LGBT musicians Category:LGBT people from California Category:LGBT pornographic actors Category:Models from California Category:Musicians from California Category:AVN Award winners",
 "title": "Sasha Grey"
}