{
 "id": "328352",
 "text": "Japanese calendar types have included several of official and unofficial systems. At present, Japan uses the Gregorian calendar and also the Japanese era name system.\"Calendar\" at Japan-guide.com; Bramsen, William. (1880). Japanese chronological tables, p. 25. ==History== Japan has more than one traditional system for counting years,Clement, Ernest W. (1902). \"Japanese Calendars,\" in Transactions of the Asiatic Society of Japan, Vol. 30-31, p. 3. including *The Chinese calendar (sexagenary cycle)Bramsen, pp. 5-11. *The or \"National calendar year\" based on the legendary founding of Japan by Emperor Jimmu in 660 BC.Bramsen, p. 11. *The based on the reign of the current emperorBramsen, pp. 2-5. Since the Meiji period, Japan has used the system.Bramsen, p. 25. In Japan today, the old Chinese calendar is rarely used. The system of counting years from the reign of Emperor Jimmu has been abandoned.Nussbaum, Louis-Frédéric. (2005). \"Calendar\" in Japan Encyclopedia, pp. 98-99. == Annual holidays in Japan's calendar== The Japanese calendar has yearly holidays and traditional events. Some of these preserve ancient customs.Nakamura, Akemi. \"National holidays trace roots to China, ancients, harvests,\" Japan Times. April 8, 2008; retrieved 2012-2-21. The names and dates of some of Japan's national holidays have changed over time. Date English name Official name Romanization January 1 New Year's DayBrown, Ju. (2006). China, Japan, Korea: Culture and Customs, p. 68. 元日 Ganjitsu 2nd Monday of January Coming of Age DayInfoMapJAPAN, \"Japanese National Holidays/Traditional Events\" ; retreieved 2012-2-21. 成人の日 Seijin no hi February 11 \"Japan,\" Catholic Encyclopedia (2009); retrieved 2012-2-21. National Foundation Day 建国記念の日 Kenkoku kinen no hi February 23 The Emperor's Birthday 天皇誕生日 Tennō tanjōbi March 3 Girls' Day Hinamatsuri at About.com ; retrieved 2013-3-6. 雛祭の日 Hinamatsuri March 20 or March 21 Vernal Equinox Day 春分の日 Shunbun no hi April 29 Shōwa Day 昭和の日 Shōwa no hi May 3 Constitution Memorial Day 憲法記念日 Kenpō kinenbi May 4 Greenery Day みどり(緑)の日 Midori no hi May 5 Children's Day 子供の日 Kodomo no hi 3rd Monday of July Marine Day 海の日 Umi no hi 3rd Monday of September Respect for the Aged Day 敬老の日 Keirō no hi September 23 or September 24 Autumnal Equinox Day 秋分の日 Shūbun no hi 2nd Monday of October Health-Sports Day 体育の日 Taiiku no hi November 3 Culture Day 文化の日 Bunka no hi November 23 Labour Thanksgiving Day 勤労感謝の日 Kinrō kansha no hi ==Related pages== * Japanese Imperial year * Japanese era names == References == ==Other websites== * National Diet Library, \"The Japanese Calendar\" * NengoCalc Category:Japanese culture Category:Calendars",
 "title": "Japanese calendar"
}