{
 "id": "328630",
 "text": "This article is about the American Billboard Hot 100 chart held during the 2010s. The Billboard Hot 100 is a chart that ranks the best-performing singles of the United States. Published by Billboard magazine, the data are compiled by Nielsen SoundScan based collectively on each single's weekly physical and digital sales, and airplay. A new chart is compiled and officially released to the public every Thursday in Billboard magazine and on its website. Each chart is dated with the \"week-ending\" date of the Saturday two weeks after. ==Number-one singles== ← 2000s201020112012 ;Key : - Number-one single as of February 18, 2012 : - Number-one single of the year # Reached number one Artist(s) Single Record label Weeks at number one Ref 2010 2010 2010 2010 2010 2010 2010 980 January 2, 2010 Kesha \"Tik Tok\"♪ RCA 9 981 March 6, 2010 The Black Eyed Peas \"Imma Be\" Interscope 2 982 March 20, 2010 Taio Cruz featuring Ludacris \"Break Your Heart\" Island/Mercury 1 983 March 27, 2010 Rihanna \"Rude Boy\" Def Jam 5 984 May 1, 2010 B.o.B featuring Bruno Mars \"Nothin' on You\" Grand Hustle/Rebel Rock/Atlantic 2 985 May 15, 2010 Usher featuring will.i.am \"OMG\" LaFace 4 986 May 22, 2010 Eminem \"Not Afraid\" Shady/Aftermath/Interscope 1 987 June 19, 2010 Katy Perry featuring Snoop Dogg \"California Gurls\" Capitol 6 988 July 31, 2010 Eminem featuring Rihanna \"Love the Way You Lie\" Aftermath/Interscope/Shady 7 989 September 18, 2010 Katy Perry \"Teenage Dream\" Capitol 2 990 October 2, 2010 Bruno Mars \"Just the Way You Are\" Elektra 4 991 October 30, 2010 Far East Movement featuring The Cataracs and Dev \"Like a G6\" Cherrytree 3 992 November 13, 2010 Kesha \"We R Who We R\" RCA 1 993 November 20, 2010 Rihanna featuring Drake \"What's My Name?\" Def Jam 1 994 December 4, 2010 Rihanna \"Only Girl (In the World)\" Def Jam 1 995 December 11, 2010 Pink \"Raise Your Glass\" LaFace 1 996 December 18, 2010 Katy Perry \"Firework\" Capitol 4 2011 2011 2011 2011 2011 2011 2011 997 January 8, 2011 Bruno Mars \"Grenade\" Atlantic/Elektra 4 998 January 29, 2011 Britney Spears \"Hold It Against Me\" Jive 1 999 February 19, 2011 Wiz Khalifa \"Black and Yellow\" Rostrum/Atlantic 1 1000 February 26, 2011 Lady Gaga \"Born This Way\" Streamline/Interscope/Kon Live 6 1001 April 9, 2011 Katy Perry featuring Kanye West \"E.T.\" Capitol 5 1002 April 30, 2011 Rihanna featuring Britney Spears \"S&M;\" Def Jam 1 1003 May 21, 2011 Adele \"Rolling in the Deep\"♪ XL 7 1004 July 9, 2011 Pitbull featuring Ne-Yo, Afrojack and Nayer \"Give Me Everything\" Polo Grounds/J/Mr. 305 1 1005 July 16, 2011 LMFAO featuring Lauren Bennett and GoonRock \"Party Rock Anthem\" will.i.am Music Group/Cherrytree/ Interscope/Panther Records 6 1006 August 27, 2011 Katy Perry \"Last Friday Night (T.G.I.F.)\" Capitol 2 1007 September 10, 2011 Maroon 5 featuring Christina Aguilera \"Moves Like Jagger\" A&M;/Octone 4 1008 September 17, 2011 Adele \"Someone Like You\" XL 5 1009 November 12, 2011 Rihanna featuring Calvin Harris \"We Found Love\" Def Jam 10 2012 2012 2012 2012 2012 2012 2012 1010 January 7, 2012 LMFAO \"Sexy and I Know It\" Interscope 2 1011 February 4, 2012 Adele \"Set Fire to the Rain\" XL/Columbia 2 1012 February 18, 2012 Kelly Clarkson \"Stronger (What Doesn't Kill You)\" 19/RCA 2 1013 March 3, 2012 Katy Perry \"Part of Me\" Capitol 1* ==Statistics== ===Artists by total number-one singles=== The following artists achieved two or more number-one singles during the 2010s (as of March 3, 2012). A number of artists had number-one singles on their own as well as part of a collaboration. Artist Number-one singles Rihanna 6 Katy Perry 6 Bruno Mars 3 Adele 3 Eminem 2 Kesha 2 Britney Spears 2 LMFAO 2 :*Note: Rapper will.i.am has had two number-one singles during the 2010s as part of The Black Eyed Peas and as a featured solo artist on Usher's \"OMG\", but both instances are counted separately. ===Artists by total cumulative weeks at number one=== The following artists were featured at the top of the Hot 100 for the highest cumulative number of weeks during the 2010s (as of March 3, 2012). Some totals include in part or in whole weeks spent at number one as part of a collaboration. An asterisk (*) denotes that an artist is currently at number one. Artist Weeks at number one Rihanna 25 Katy Perry 20* Adele 14 Kesha 10 Bruno Mars 10 Calvin Harris 10 Eminem 8 LMFAO 8 Snoop Dogg 6 Lady Gaga 6 Lauren Bennett 6 GoonRock 6 ===Songs by total number of weeks at number one=== The following songs were featured at the top of the Hot 100 for the highest number of weeks during the 2010s (as of March 3, 2012). An asterisk (*) denotes that the single is currently at number one. Song Weeks at number one \"We Found Love\" 10 \"Tik Tok\" 9 \"Love the Way You Lie\" 7 \"Rolling in the Deep\" 7 \"California Gurls\" 6 \"Born This Way\" 6 \"Party Rock Anthem\" 6 \"Rude Boy\" 5 \"E.T.\" 5 \"Someone Like You\" 5 \"OMG\" 4 \"Just the Way You Are\" 4 \"Firework\" 4 \"Grenade\" 4 \"Moves Like Jagger\" 4 ==References== Category:Lists of Billboard Hot 100 number-one singles Category:2010s songs",
 "title": "List of Hot 100 number-one singles of the 2010s (U.S.)"
}