{
 "id": "328851",
 "text": "Kinderszenen (original spelling Kinderscenen, (), Opus 15, is a set of 13 pieces for solo piano by Robert Schumann. It was published in 1838. Schumann was looking back on his childhood when composing these pieces. He had originally written 30 movements for Scenes from Childhood. He chose only 13 for the final set. The unused movements were published years later in Bunte Blätter, Opus 99, and Albumblätter (). Schumann originally titled the work Leichte Stücke (). The titles for the individual pieces were only added after the music was complete. Schumann described the titles as \"nothing more than delicate hints for execution and interpretation\". Timothy Taylor has discussed Schumann's choice of titles for this work in the context of the changing situation of music in 19th century culture and economics. In 1974, Eric Sams noted that there is no known complete manuscript of Kinderszenen. ==Movements== Title Key Play Notes 1\\. Von fremden Ländern und Menschen Of Foreign Lands and Peoples G major 2\\. Kuriose Geschichte A Curious Storyoriginal spelling: Curiose Geschichte D major 3\\. Hasche-Mann Blind Man's Bluff B minor 4\\. Bittendes Kind Pleading Child D major 5\\. Glückes genug Happy Enough D major 6\\. Wichtige Begebenheit An Important Event A major 7\\. Träumerei Dreaming F major This is one of Schumann's best known pieces; it was the title of a 1944 German biographical movie on Robert Schumann. Träumerei is also the opening and closing musical theme in the 1947 Hollywood movie Song of Love, starring Katharine Hepburn as Clara Schumann Wieck. 8\\. Am Kamin At the Fireside F major 9\\. Ritter vom Steckenpferd Knight of the Hobbyhorse C major 10\\. Fast zu ernst Almost Too Serious G-sharp minor 11\\. Fürchtenmachen Frightening E minor 12\\. Kind im Einschlummern Child Falling Asleep E minor 13\\. Der Dichter spricht The Poet Speaks G major == References == == Other websites == * MSN Movies page on Robert Schumann Category:Solo piano pieces Category:Compositions by Robert Schumann",
 "title": "Kinderszenen"
}