{
 "id": "328828",
 "text": "Lucille Désirée Ball (August 6, 1911 – April 26, 1989) was an American actress, comedian, and producer. She was the star of the sitcoms I Love Lucy, The Lucy–Desi Comedy Hour, The Lucy Show, Here's Lucy and Life With Lucy. Ball was one of the most popular and powerful actors in the United States during her lifetime. She also had one of Hollywood's longest careers. Ball began acting in the 1930s. She became both a radio actress and B-movie star in the 1940s. Her television career began in the 1950s. She was still making movies in the 1960s and 1970s. In 1962, Ball became the first woman to run a major television studio, Desilu. This studio made many successful and popular television series.\"Arnaz Quits Presidency Of Desilu; Former Wife, Lucille Ball, Gets Post,\" Wall Street Journal, Nov. 9, 1962, p. 18. ==Early life== Lucille Désirée Ball was born to Henry Durrell Ball (September 16, 1887 – February 19, 1915) and Desiree \"DeDe\" Evelyn Hunt (September 21, 1892 – July 20, 1977) in Jamestown, New York. Her family was Baptist. She was of French, Scottish, English, and Irish ancestry. She had a younger brother, Fred Henry Ball (July 17, 1915 – February 5, 2007). ==Early work== In 1929, Ball got work as a model. She later began her performing career on Broadway using the stage name Diane Belmont. She was in many small movie roles in the 1930s. She worked for RKO Radio Pictures at the time. Ball was named the \"Queen of the Bs\". ==I Love Lucy== In 1951, Ball was important in the creation of the television series I Love Lucy. The show ended in 1957 after 180 episodes. Then, some small changes were made to the series format. The time-length of the series was changed from 30 minutes to 60 minutes. The first program lasted 75 mins. Some new characters were added. The story was changed. After these changes, the program was renamed The Lucy-Desi Comedy Hour. It was shown from 1957 until 1960. Ball went on to star in two more successful television series. The first was The Lucy Show. It was shown on CBS from 1962 to 1968 (156 episodes). The other was Here's Lucy. It was shown from 1968 to 1974 (144 episodes). Her last television series was in 1986. It was called Life with Lucy. This program did not do very well. Only 8 of the 13 episodes that were made were shown on television. ==Marriage and family== Ball met and married Cuban band leader Desi Arnaz in 1940. On July 17, 1951, she gave birth to their first child, Lucie Désirée Arnaz. A year and a half later, Ball gave birth to their second child, Desiderio Alberto Arnaz IV, known as Desi Arnaz, Jr. Ball and Arnaz divorced on 4 May 1955 ==Health problems and death== On April 18, 1989, Ball said she had chest pains at her home in Beverly Hills and was taken to Cedars- Sinai Medical Center, where she had dissecting aortic aneurysm and had an eight-hour aortic transplant. The surgery worked, and Ball was soon able to walk around her room with very little help. She got a lot of get-well wishes. On the morning of April 26, Ball awoke with bad back pains then lost consciousness. She died at 5:47 a.m. PDT at the age of 77. Doctors thought that she had succumbed to a ruptured abdominal aortic aneurysm not that related to her ascending aortic aneurysm and surgery. Ball had been a smoker most of her life, making her risk of abdominal aortic aneurysm higher. ==Awards== Ball was nominated for an Emmy Award thirteen times. She won four times. In 1977 Ball was one of the first people to be given the Women in Film Crystal Award. She was given the Golden Globe Cecil B. DeMille Award in 1979, the Lifetime Achievement Award from the Kennedy Center Honors in 1986, and the Governors Award from the Academy of Television Arts & Sciences in 1989. ==References== Category:1911 births Category:1989 deaths Category:Deaths from aortic aneurysm Category:Actors from New York (state) Category:People from Jamestown, New York Category:American movie actors Category:American radio actors Category:American television actors Category:American television producers Category:American Emmy Award winners Category:Kennedy Center honorees Category:Presidential Medal of Freedom recipients",
 "title": "Lucille Ball"
}