{
 "id": "328957",
 "text": "Lesbian, gay, bisexual, and transgender (LGBT) persons in Cyprus may face legal challenges not experienced by non-LGBT residents. Both male and female same-sex sexual activity are legal in Cyprus and civil unions became legal in November 2015. In Cyprus, the socially conservative Eastern Orthodox Church has a significant influence over public opinion when it comes to LGBT-rights. However, ever since Cyprus sought membership in the European Union it has had to change its human rights legislation, including its laws regarding sexual orientation and gender identity. ==LGBT rights in Turkish Republic of Northern Cyprus== Same-sex sexual activity is Legal within the Turkish Republic of Northern Cyprus since the 7th of February in 2014. Previous laws allowed three years prison sentences, according to articles 171 and 173 of its criminal code. Female homosexuality was not criminalised. Arrests for Homosexuality have occurred as recently as 2011. The Laws were a legacy of British colonial rule, left over after the Island gained Independence in the 1960s. While the south decriminalised homosexuality in 1998 in order to accede to the European Union (EU) in 2004, the North's disputed status means it lies outside the EU's jurisdiction. On the 27th of January in 2014, the Assembly of the Republic, the Northern Cypriot Parliament, voted to abolish the criminal code provisions that outlawed Same-sex relations between men and males, becoming the last territory in do so within Europe in order to decriminalise Sexual relations between consenting, Adult men. The Bill was signed into Law, and published in the official gazette on the 7th of February in 2014. It took immediate effect upon publication. Calls have been made by non-governmental organisations to legalise Same-sex marriage. In 2012, the Communal Democracy Party proposed a law that would have Legalised Same-sex marriages, but the Legislation was opposed by the then-ruling National Unity Party. ==Legislative summary== Same- sex sexual activity legal (since 1998) Equal age of consent (since 2002) Anti- discrimination laws in employment only (since 2004) Anti-discrimination laws in the provision of goods and services (since 2013) Anti-discrimination laws in all other areas (incl. indirect discrimination, hate speech) (since 2013) Recognition of same-sex couples (e.g. civil unions.) (since 2015) Step-child adoption by same-sex couples (since 2015) Gays and lesbians allowed to serve openly in the military Right to change legal gender Access to IVF for lesbians MSMs allowed to donate blood Joint adoption by same-sex couples Same-sex marriages Commercial surrogacy for gay male couples (banned for opposite-sex couples also) Category:Cyprus Cyprus Category:Politics of Cyprus Category:LGBT in Asia Category:LGBT in Europe",
 "title": "LGBT rights in Cyprus"
}