{
 "id": "329240",
 "text": "was a after Angen and before Yōwa. This period started in August 1177 and ended in July 1181.Nussbaum, Louis-Frédéric. (2005). \"Jishō\" in Japan Encyclopedia, p. 425. The reigning emperors were and .Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 195-200; Brown, Delmer et al. (1979). Gukanshō, pp. 330-333; Varley, H. Paul. (1980). Jinnō Shōtōki. pp. 212-214. ==Events of the Jishō era== * 1177 (Jishō 1, 28th day of the 4th month): A great fire in the capital was spread by high winds; and the palace was destroyed.Titsingh, p. 198; Kitagawa, H. (1975). The Tale of the Heike, p. 783; Kamo no Chōmei. (1212). Hōjōki. * 1178 (Jishō 2, 12th day of the 11th month): Emperor Takakura's consort, Taira no Tokuko, gave birth to a son who will become Emperor Antoku.Kitagawa, H. (1975). The Tale of the Heike, p. 784. * 1180 (Jisho 4, 21st day of the 2nd month): Takakura abdicated. * 1180 (Jishō 4, 21st day of the 4th month): In the 12th year of Takakura's reign, the emperor was forced to abdicate; and the succession (senso) was received by his son.Titsingh, p. 200; Brown, p. 333; Kitagawa, p. 784. * 1180 (Jisho 4, 22nd day of the 4th month): The infant Emperor Antoku's accepted the monarch's role and duties and powers (sokui).Kitagawa, p. 784. This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no- Rei); retrieved 2012-2-26. * 1180 (Jisho 4, 2nd day of the 6th month): The court leaves Heian-kyō for Fukuhara, which is near modern-day Kōbe in Hyōgo. * 1180 (Jisho 4, 26th day of the 11th month): The capital is moved back to Heian-kyō.Kitagawa, p. 785. * 1180 (Jisho 4): A whirlwind causes chaos in the capital.Kamo no Chōmei. (1212). Hōjōki. * 30 January 1181 (Jisho 5, 14th day of the 1st month): Takakura died.Kitagawa, p. 785; Kunaichō, 高倉天皇 (80); retrieved 2012-5-23. ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Jishō 1st 2nd 3rd 4th 5th Gregorian 1177 1178 1179 1180 1181 Preceded by: Angen Era or nengō: Jishō Succeeded by: Yōwa Category:Japanese eras",
 "title": "Jishō"
}