{
 "id": "329360",
 "text": "Sports in Japan are a part of Japanese culture. Japan has many traditional sports such as sumo, judo, karate, and kendo. Also, there are sports which were imported from the West such as baseball, soccer, golf and skiing.Nussbaum, Louis-Frédéric. (2005). \"Sports\" in Japan Encyclopedia, pp. 905-907. Sports are popular with both participants and onlookers. ==History== Some traditional sports like yabusame have ancient histories. In the Meiji period, sports which were imported from the West became popular. * Baseball was first played at Waseda University in Tokyo in 1890.Nussbaum, \"Baseball,\" p. 71. * Golf was imported from England; and the first golf course was created in Kobe in 1903.Nussbaum, \"Golf,\" p. 256. * Gymnastics was encouraged in schools as early as 1872. * Rugby teams were created at Keiō University in Tokyo in 1899.Light, Richard. \"A Centenary of Rugby and Masculinity in Japanese Schools and Universities: Continuity and Change,\" Sporting Traditions, Vol. 16, No. 2, May 2000, p. 91 [PDF 5 of 18]; retrieved 2012-2-26. * Soccer was first played in 1878.Nussbaum, p. 906. * Swimming competition was first held at the Yokohama Amateur Rowing Club in 1898. * Tennis became popular in 1878. * Track and field competition began in 1883 at the University of Tokyo.Nussbaum, p. 905. * Volleyball was imported from the US in 1914. * Weightlifting was made popular by Jigoro Kano in 1922. Another popular spectator sport is professional wrestling, locally known as puroresu (プロレス). While the sport was known in Japan before World War II, it did not become widely popular until the rise of Rikidōzan, considered the \"father\" of puroresu, in the 1950s. While similar to professional wrestling in the rest of the world in that winners are decided before the match, puroresu has become a unique style. Most match storylines play up the wrestlers' \"fighting spirit\". Also, because many Japanese wrestlers have martial arts backgrounds, most strikes during matches make full contact. Puroresu also enjoys close ties to mixed martial arts, with some companies often holding wrestling matches and MMA fights in the same event; because of this, both wrestlers and fans treat puroresu as a combat sport. At first, Western sports were valued as a form of mental discipline, but they have become recreational activities.Web-Japan.org, \"Sports\"; retrieved 2012-2-26. Notable athletes, sports clubs, sports schools and training clinics played an important part in spreading sports in Japan.Japanese Olympic Committee (JOC), \"Olympic History in Japan, Tokyo 1964, Games of the XVIII Olympiad\"; retrieved 2012-8-23. In Japan, sports groups are an important part of school life. The time spent in these groups allows students to adjust to Japan's vertical society. For example, in sports, players learn to use keigo (formal, polite speech), respect and traditions.Ohno Higashi Junior High School, \"Clubs & Sports\"; retrieved 2012-8-23. ===Olympic games=== The 1940 Summer Olympics and the 1940 Winter Olympics were planned for Japan, but the organizers withdrew in 1938 because of the Second Sino-Japanese War.Organizing Committee of the XIIth Olympiad. (1940). Report of the Organizing Committee on Its Work for the XIIth Olympic Games of 1940 in Tokyo Until the Relinquishment, p. 177 [201 of 207 PDF]; retrieved 2012-7-25. These games were later cancelled because of World War II. Japan did host the Olympic games four times.Web-Japan.org, \"Japan and the Olympics\"; retrieved 2012-2-26. * 1964 Summer Olympics * 1972 Winter Olympics * 1998 Winter Olympics * 2020 Summer Olympics ==Related pages== * Aikido * Judo * Jujutsu * Karate * Kendo * Sumo * Kyūdō == References == == Other websites == *Ministry of Education, Culture, Sports, Science and Technology (MEXT) website The Japanese translation of this book is available at: https://la84.org/wp-content/uploads/LA84WaterPolo_J-1.pdf",
 "title": "Sport in Japan"
}