{
 "id": "329383",
 "text": "The 'Siamese' is a breed of cat from Thailand. It is a well-known cat, especially for its blue eyes and brown face, ears, tail and paws, although not all of them look like this. In Thailand, it is a native breed, and they are called Wichian Mat (), which means moon diamond. There are two different types of Siamese Cat, the Traditional or Thai Siamese, and the Modern Siamese. ==Appearance== The fur on all Siamese cats has the same sort of pattern, known as point coloration. This is when an animal has a pale body and a dark face, ears, feet and tail. ===Traditional Siamese=== The Traditional Siamese has a few features that are the same as the Modern Siamese, like the colour pattern and the short fur, but it is different because of its head and body shape. It has long legs, and is thin and is graceful. It has a wedge shaped head and muzzle, and round cheeks. The ears are large and high. The eyes are between medium and large, and have the shape of an almond. ===Modern Siamese=== The body of a Modern Siamese is flexible and well-muscled. Its head is in the shape of a triangle, with a thin snout-like muzzle. Their eyes are also almond shaped, and their ears are tall and sit more on the side of the head than the Traditional Siamese. It's neck and tail are long and thin. ==Behaviour== Siamese cats, both Traditional and Modern, are usually very friendly and loving cats, and will enjoy spending time with you, although this depends on the cat. They are known to bond to one person. They are also very smart, more so than some other cats. Some Siamese cats enjoy 'talking', which has been said to sound like a human baby, and always enjoy attention. Siamese cats love to play and run around as if they were kittens all their life. Unlike most cats, they are less active at night, and prefer to sleep through it. This might be because their eyes lack something called tapetum lucidum, which allows cats to see better in the dark. Unlike many other blue-eyed cats, Siamese cats can still hear well. Cats that are white with blue eyes are often deaf. == Temperament == thumb|\"Meezer\" of a Siamese cat Siamese cats are very friendly and smart. They love being around people and are often called \"extroverts\". They usually get very attached to one person. Myrna Milani says Siamese cats are more active during the day, like staying close to their owners, and prefer not to hunt as much as other cats. Siamese cats are famous for their loud and unique voices, often called \"meezer\" sounds. They use their voices to talk to their owners, whether they want attention, food, or just want to express themselves. Their sounds are often compared to baby cries, making them hard to ignore. ==In fiction== * Siamese cats named Si and Am have a minor role in Lady and the Tramp (1955) and its sequel, Lady and the Tramp II (2001). They were replaced with a different breed in the 2019 remake, the Devon Rex. * The cover of the Blink-182 album Cheshire Cat features a Siamese cat. ==References== Category:Colorpoint cat breeds Category:Natural cat breeds",
 "title": "Siamese cat"
}