{
 "id": "329412",
 "text": "There are not many natural freshwater lakes in Australia. This is because there was not a lot of glacial or tectonic activity in Australia. ==Types== their are six main types of lake in Australia: * coastal lakes and lagoons including perched lakes; * natural freshwater inland lakes. These are often ephemeral and part of wetland or swamp areas; * glacial lakes * salt lakes, usually dry, in the flat desert regions of the country. * lakes which have formed in the remains of volcanoes. * lakes made for water storage and other purposes. A list of the notable lakes in Australia includes: ===Coastal lakes and lagoons=== Lake name State/territory Lake Alexandrina South Australia Avoca Lake New South Wales Blue Lake Queensland Brown Lake Queensland Lake Broadwater Budgewoi Lake New South Wales Lake Como Queensland Lake Cooloola Lake Cooroibah Lake Cootharaba Queensland Lake Bonney South Australia Dee Why Lagoon New South Wales Gippsland Lakes Victoria Glenrock Lagoon New South Wales Lake Illawarra New South Wales Mallacoota Inlet Lake Macquarie New South Wales Lake Munmorah New South Wales Myall Lakes New South Wales Narrabeen Lagoon New South Wales Orielton Lagoon Tasmania Smiths Lake New South Wales St Georges Basin New South Wales and the Jervis Bay Territory Tabourie Lake New South Wales Terrigal Lagoon New South Wales Tuggerah Lake New South Wales Lake Victoria New South Wales Wallis Lake New South Wales Wamberal Lagoon New South Wales Lake Weyba Queensland Lake Wollumboola New South Wales Wonboyn Lake New South Wales ====Perched lakes==== Lake name State/territory Lake McKenzie Queensland Lake Wobby Queensland ===Freshwater lakes=== Lake name State/territory Lake Awoonga Queensland Lake Bathurst New South Wales Lake Batyo Catyo Victoria Blue Lake New South Wales Boobera Lagoon Queensland Lake Bonney (Riverland) South Australia Lake Bryde-East Lake Bryde Western Australia Lake Colac Victoria Corella Lake Northern Territory Lake Cowal New South Wales Lake Dunn Queensland Lake Elphinstone Queensland Lake George New South Wales Glenbrook Lagoon New South Wales Lake Hindmarsh Victoria Lake Magenta Western Australia Lake Miranda South Australia Menindee Lakes New South Wales Narran Lakes New South Wales Lake Nuga Nuga Queensland Tarrabool Lake Northern Territory Lake Sylvester Northern Territory Lake St Clair Tasmania Wallaga Lake New South Wales Lake Woytchugga New South Wales ===Glacial lakes=== Lake name State/territory Blue Lake New South Wales Club Lake Australian Antarctic Territory Dove Lake Tasmania Headley Tarn Lake Albina New South Wales Lake Cootapatamba New South Wales Lake Selina Tasmania ===Salt lakes=== Lake name State/territory Lake Amadeus Northern Territory Lake Barlee Western Australia Lake Buchanan Queensland Lake Cadibarrawirracanna South Australia Lake Carey Western Australia Lake Disappointment Western Australia Dumbleyung Lake Western Australia Lake Dundas Western Australia Lake Eyre South Australia Lake Frome South Australia Lake Gairdner South Australia Lake Galilee Queensland Lake Gregory South Australia Goyder Lagoon South Australia Hutt Lagoon Western Australia Lake Hart South Australia Island Lake Lake Lefroy Western Australia Murtnaghurt Lagoon Victoria Lake Mungo New South Wales Lake Torrens South Australia Lake Urana New South Wales Willandra Lakes New South Wales Lake Yamma Yamma Queensland ===Volcanic lakes=== Lake name State/territory Blue Lake South Australia Lake Barrine Queensland Lake Eacham Queensland Lake Euramoo Queensland Valley Lake South Australia ==Related pages== *List of reservoirs and dams in Australia * Australia lakes",
 "title": "List of lakes of Australia"
}