{
 "id": "329409",
 "text": "Wayne Eliot Knight (born August 7, 1955) is an American actor. He is known for his role as Newman in the television series Seinfeld. Knight is from New York City. Knight is a Democrat and attended the 2012 Democratic National Convention in support of President Obama's re-election. ==Personal life== Knight was married twice. He was first married to make-up artist Paula Sutor, they married on May 26, 1996. They remained married until they divorced in mid 2003. Knight married his second wife Clare de Chenu on October 15, 2006; together the couple have a son. ==Filmography== ===Film=== Year Title Role Notes 1979 The Wanderers Waiter Uncredited 1987 Dirty Dancing Stan 1988 Everybody's All-American Fraternity Pisser 1989 Born on the Fourth of July Official #2 – Democratic Convention 1991 V.I. Warshawski Earl 'Bonehead' Smeissen 1991 Dead Again 'Piccolo' Pete Dugan 1991 JFK Numa Bertel 1992 Basic Instinct John Correli 1993 Jurassic Park Dennis Nedry Nominated—Saturn Award for Best Supporting Actor 1995 To Die For Ed Grant 1996 Chameleon Stuart Langston 1996 Space Jam Stan Podolak 1997 Hercules Demetrius the Merchant (voice) 1997 For Richer or Poorer Bob Lachmen 1998 The Brave Little Toaster Goes to Mars Microwave (voice) 1998 Soundman Tim (voice) 1999 Hercules: Zero to Hero Orthus (voice) 1999 My Favorite Martian Zoot (voice) Uncredited 1999 Pros & Cons Wayne the Guard 1999 Tarzan Tantor (voice) 1999 Toy Story 2 Al McWhiggin (voice) 2001 Rat Race Zach Mallozzi 2003 Cheaper by the Dozen Electrician Uncredited cameo 2004 Black Cloud Mr. Tipping 2007 Forfeit Bob 2007 Throwing Stars Officer Brooks 2008 Kung Fu Panda Gang Boss (voice) 2008 Punisher: War Zone Microchip 2009 Ultimate Smash Brawl: The Movie Dr. Hammerstein (voice) 2012 She Wants Me Walter Baum 2012 Excuse Me For Living Albert 2014 Tom and Jerry: The Lost Dragon The Elf Elder (voice) ===Television=== Year Title Role Notes 1982 For Lovers Only Video Game Fanatic TV Movie Uncredited 1983 The Day After Man in hospital TV Movie 1984 The Burning Bed Juror TV Movie Uncredited 1985 Assaulted Nuts Various 7 episodes 1988 Tattingers Kenny Axelrod 2 episodes 1990 Mathnet Peter Pickwick Episode: \"The Case of the Parking Meter Massacre\" 1990 Square One TV Peter Pickwick 3 episodes 1992–1998 Seinfeld Newman 48 episodes Nominated—Q Award for Best Recurring Player (1998) 1992 Double Edge Tommy White TV Movie 1992–1993 The Edge Various Characters 18 episodes 1992 T Bone N Weasel Roy Kramp TV Movie 1993 Fallen Angels Leo Cunningham Episode: \"Dead End Delia\" 1993 Against the Grain Froggy Wilson Episode: \"Pilot\" 1993–1994 The Second Half Robert Piccolo 15 episodes 1994 Golden Gate Arthur Genopopoulos TV Movie 1996–2001 3rd Rock from the Sun Don Orville 79 episodes Nominated—Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series (1998–1999) 1997 Contempt of Court Merill Bushman TV Movie 1998 Hercules Cyclops Head #2 (voice) 2 episodes 2000 Dilbert The Security Guard (voice) Episode: \"The Security Guard\" 2001 That '70s Show The Angel Episode: \"It's a Wonderful Life\" 2001 Bleacher Bums Zig TV Movie 2002 Becker Wally Episode: \"Picture Imperfect\" 2002 Master Spy: The Robert Hanssen Story Walter Ballou TV Movie 2003 The Twilight Zone Nick Dark Episode: \"How Much Do You Love Your Kid?\" 2003–2006 Xiaolin Showdown Dojo (voice) 52 episodes 2003 Gary the Rat Gary's Rival (voice) Episode: \"The Reunion\" 2003 The Grim Adventures of Billy & Mandy Jack O'Lantern (voice) Episode: \"Billy & Mandy's Jacked-Up Halloween\" 2004 I'm with Her Kevin Episode: \"Friends in Low Places\" 2004 The Drew Carey Show Owen Episode: \"Liar Liar House on Fire\" 2004 Listen Up! Buddy Episode: \"Sweet Charity\" 2005–2007 Catscratch Mr. Blik (voice) 20 episodes 2005 Justice League Unlimited Abnegazar (voice) Episode: \"The Balance\" 2006 CSI: NY Truman Bosch Episode: \"Fare Game\" 2007 Tak and the Power of Juju Bug Juju (voice) Episode: \"Our Favorite Juju\" 2007–2014 Ultimate Smash Brawl Doctor Eggman, Bowser, David Hyde Pierce (voices) 2009–2012 The Penguins of Madagascar Max (voice) 3 episodes 2009 Woke Up Dead Andrew Batten 10 episodes 2009 CSI: Crime Scene Investigation Mr. Terrence Lombard Episode: \"Working Stiffs\" 2009 Nip/Tuck Don Hoberman Episode: \"Don Hoberman\" 2009–2011 The Super Hero Squad Show Egghead (voice) 3 episodes 2009 Curb Your Enthusiasm Himself Uncredited Episode: \"The Table Read\" 2010–2011 Hot in Cleveland Rick 5 episodes 2010 The Good Guys Perry Black Episode: \"Little Things\" 2010 The Whole Truth Judge Mark Hulverson Episode: \"Uncanny\" 2010 Bones Jimmy Walpert III Episode: \"The Babe in the Bar\" 2011 Torchwood Brian Friedkin 3 episodes 2011–2012 Kung Fu Panda: Legends of Awesomeness Jong / Jong's Son (voices) 2 episodes 2011–Present The Exes Haskell Lutz 54 episodes 2012 Green Lantern: The Animated Series Captain Goray (voice) Episode: \"Into the Abyss\" 2012 Pound Puppies Ralphie / Construction Worker #1 (voices) Episode: \"Good Dog, McLeish!\" 2013 Regular Show Guardian of the Friend Zone / God of Street Performing (voices) 2 episodes 2014 Comedians in Cars Getting Coffee Newman Episode: \"The Over- Cheer\" 2014 Unforgettable Dr. Theodore Blumer Episode: \"East of Islip\" 2015 Sirens Richard Episode: \"Sub-Primal Fears\" ===Video games=== Year Title Role Notes 2011 Jurassic Park: The Game Dennis Nedry (voice) Uncredited 2015 Lego Jurassic World Dennis Nedry (voice, archive recording) ==References== Category:1955 births Category:Living people Category:Actors from New York City Category:American movie actors Category:American television actors Category:American voice actors Category:Comedians from New York City Category:Democrats (United States) Category:Seinfeld",
 "title": "Wayne Knight"
}