{
 "id": "329469",
 "text": "The Azerbaijani law forbidding gay sex was abolished in 2000.Spartacus International Gay Guide, page 1216. Bruno Gmunder Verlag, 2007. A special edition of Azerbaijan, the official newspaper of the Parliament, published on 28 May, reported that the Parliament had approved a new Criminal Code, and that the President had signed a decree bringing it into force in September. The text of the new Criminal Code was also published. The old Article 113 (inherited from the Soviet era which punished anal sex between men with three years imprisonment) has been replaced with a new Article 150, which bans only forcible sexual acts. ==Modern times== When Azerbaijan became part of USSR, homosexuality was a crime in Azerbaijan, although it was not in Russia.Healey, Dan. \"Masculine purity and 'Gentlemen's Mischief': Sexual Exchange and Prostitution between Russian Men, 1861–1941\". Slavic Review. Vol. 60, No. 2 (Summer, 2001), p. 258. After the independence of Azerbaijan in 1991, homosexual acts were legalized in 2000. Although homosexual acts between consenting male adults were officially decriminalized, there were still reports about police abuses against gays, mainly male prostitutes. The victims wanted to remain anonymous. They were afraid of the police. (2001 Report of the International Helsinki Federation). State-controlled media outlets use homosexuality as a tool to harass and discredit critics of the government and opposition journalists. ==Living conditions== Same-sex sexual activity legal (since 2000) Equal age of consent (since 2000) Anti-discrimination laws in employment only Anti-discrimination laws in the provision of goods and services Anti-discrimination laws in all other areas (incl. indirect discrimination, hate speech) Same-sex marriages Recognition of same-sex couples Step-child adoption by same-sex couples Joint adoption by same-sex couples Gays and lesbians allowed to serve openly in the military Right to change legal gender (Transgender people can change their gender but not their legal name) Access to IVF for lesbians Commercial surrogacy for gay male couples MSMs allowed to donate blood ==References== Azerbaijan Category:Politics of Azerbaijan Category:Law of Azerbaijan",
 "title": "LGBT rights in Azerbaijan"
}