{
 "id": "329681",
 "text": "Sir Arthur John Gielgud, (; 14 April 1904 – 21 May 2000) was an English actor and director.Guardian obituary Gielgud was born in South Kensington, London and attended Westminster School. He acted in theatre, on radio, television and in movies. Gielgud won many awards, including an Academy Award, two Emmy Awards, three Tony Awards, a Grammy Award and two Golden Globe Awards. In 1992 he received a BAFTA Academy Fellowship Award, a lifetime achievement award. The Globe Theatre in London was renamed the Gielgud Theatre in 1994 in his honour. In 1991, Gielgud became an EGOT winner. At aged 87, he is the oldest person to became an EGOT winner and the first LGBT person to do so. Gielgud was gay. He was in a long-term relationship until his partner died in 1998. Gielgud died in Wootton Underwood, Buckinghamshire. ==Awards== ===Laurence Olivier Awards=== * 1985: Special Award ===Academy Awards=== * 1964: Nominated for Best Supporting Actor, for Becket * 1981: Winner for Best Supporting Actor, for Arthur ===Emmy Awards=== * 1966: Emmy for Outstanding Dramatic Program, for Gielgud's Ages of Man'' * 1982: Nominated for Outstanding Supporting Actor in a Limited Series or Special, for Brideshead Revisited * 1984: Nominated for Outstanding Supporting Actor in a Limited Series or Special, for The Master of Ballantrae * 1985: Nominated for Outstanding Supporting Actor in a Limited Series or Special, for Romance on the Orient Express * 1989: Nominated for Outstanding Lead Actor in a miniseries or Special, for War and Remembrance * 1991: Winner for Outstanding Lead Actor in a Miniseries or Movie, for Summer's Lease ===Tony Awards=== * 1948: Winner for Outstanding Foreign Company, The Importance of Being Earnest * 1959: Winner, Special Award, for contribution to theatre for his extraordinary insight into the writings of Shakespeare as demonstrated in his one-man show, Ages of Man * 1961: Winner for Best Director (Dramatic), for Big Fish, Little Fish, a play by Hugh Wheeler * 1963: Nominated for Best Director (Dramatic), for The School for Scandal * 1965: Nominated for Best Actor (Dramatic), for Tiny Alice * 1971: Nominated for Best Actor (Dramatic), for Home ===Evening Standard Awards=== * 1970 Co-winner for Best Actor for Home (with Ralph Richardson) * 1975 Winner for Best Actor for No Man's Land * 1982 Winner, Special Award for Lifetime Achievement ===Grammy Awards=== * 1959: Nominated for Best Documentary or Spoken Word Recording, for Ages of Man * 1964: Nominated for Best Documentary or Spoken Word Recording, for Hamlet with Richard Burton, Hume Cronyn, Alfred Drake, George Voskovec, Eileen Herlie, William Redfield and George Rose * 1964: Nominated for Best Documentary or Spoken Word Recording, for Ages of Man, Volume 2 (One Man in His Time) Part Two - Shakespeare * 1979: Winner for Best Spoken Word, Documentary or Drama Recording, for Ages of Man - Recordings from Shakespeare * 1982: Nominated for Best Spoken Word, Documentary or Drama Recording, for No Man's Land with Ralph Richardson * 1983: Nominated for Best Spoken Word or Non-Musical Recording, for Old Possum's Book of Practical Cats with Irene Worth * 1986: Nominated for Best Spoken Word or Non-Musical Recording, for Gulliver * 1988: Nominated for Best Spoken Word or Non-Musical Recording, for A Christmas Carol * 1989: Nominated for Best Spoken Word or Non-Musical Recording, for Sir John Gielgud Reads Alice in Wonderland * 1991: Nominated for Best Album for Children, for The Emperor's New Clothes with Mark Isham ===New York Film Critics Circle Awards=== * 1977: Best Actor, for Providence * 1981: Best Supporting Actor, for Arthur ===Los Angeles Movie Critics Association Awards=== * 1981: Best Supporting Actor, for Arthur * 1985: Best Supporting Actor, for Plenty ===Golden Globe Awards=== * 1981: Winner for Best Supporting Actor, for Arthur * 1988: Winner for Best Supporting Actor in a Series, Mini-series or Motion Picture Made for Television, for War and Remembrance * 1989: Nominated for Best Actor in a Mini-series or Motion Picture Made for Television, for War and Remembrance == References == == Other websites == * Category:English Academy Award winning actors Category:Actors from London Category:BAFTA Award winning actors Category:British radio actors Category:Emmy Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:English theatre directors Category:English LGBT people Category:Gay men Category:Golden Globe Award winning actors Category:LGBT actors Category:Movie directors from London Category:Tony Award winning actors Category:1904 births Category:2000 deaths Category:Alumni of the Royal Academy of Dramatic Art Category:Best Actor Academy Award winners Category:Best Supporting Actor Academy Award winners Category:Drama Desk Award winners Category:British Grammy Award winners Category:Knights Bachelor Category:LGBT directors Category:Order of Merit Category:People educated at Westminster School, London Category:People from the Royal Borough of Kensington and Chelsea Category:Laurence Olivier Award winners",
 "title": "John Gielgud"
}