{
 "id": "329744",
 "text": "La Dispute is an American post-hardcore band, formed in 2004 in Grand Rapids, Michigan. They have released two albums and seven EPs. The band consists of Jordan Dreyer (vocals), Brad Vander Lugt (drums), Chad Sterenberg and Kevin Whittemore (guitars) and Adam Vass (bass). La Dispute released two full-leght albums, three singles, one musical video, five EPs and two slipts. ==Style== The genre of the band is post-hardcore and experimental rock, with blues and spoken word. They also play music which sound like screamo, progressive rock, post-rock, melodic hardcore, metalcore, emo, hardcore punk. and \"screamo- revival\". The band influences are Thursday, Refused, At the Drive-In and Glassjaw. Brad Vander Lugt cites blues and jazz influences too. == Members == ;Current members *Jordan Dreyer - lead vocals (since 2004) *Chad Sterenberg - rhythm guitar, synthesizers, trumpet, glockenspiel, percussion, backing vocals (since 2006) *Kevin Whittemore - lead guitar, backing vocals (since 2004) *Adam Vass - bass, baritone guitar, additional guitars, backing vocals (since 2006) *Brad Vanger Lugt - drums, piano, keyboards, percussion backing vocals (since 2004) ;Former members *Derek Sterenberg - rhythm guitar (2004–2006) *Adam Kool - bass (2004–2006) == Discography == ;Albums *Somewhere At the Bottom of the River Between Vega and Altair (No Sleep Records, 2008) *Wildlife (No Sleep Records, 2011) US #161 / US Heat #6 / US Indie #27 ; Extended Playss *Vancouver (Friction Records, 2006) *Untitled 7\" (Forest Life Records, 2008) *Here, Hear. (Forest Life Records, 2008) *Here, Hear II.(No Sleep Records, 2008) *Here, Hear III. (Self-released, 2009) *Searching For A Pulse/The Worth Of The World (with Touché Amoré) (No Sleep Records, 2010) *Never Come Undone (with Koji) (No Sleep Records, 2011) ; Singles * Such Small Hands (2009) - Somewhere At the Bottom of the River Between Vega and Altair * The Most Beautiful Bitter Fruit (2011) \\- Wildlife * Harder Harmonies (2011) \\- Wildlife == References == == Other websites == * Official website * Official MySpace * Official Facebook Category:American punk bands Category:American rock bands Category:Post-hardcore bands Category:Emo bands Category:Blues bands Category:Musical groups from Michigan Category:Grand Rapids, Michigan Category:Musical groups established in 2004 Category:2004 establishments in the United States Category:2000s establishments in Michigan",
 "title": "La Dispute"
}