{
 "id": "329854",
 "text": "Kevin Hamilton McDonald (born May 16, 1961) is a Canadian actor, voice artist, and comedian. He's the voice of Agent Pleakley in the Lilo & Stitch series, Waffle in Catscratch and the Almighty Tallest Purple in Invader Zim. McDonald founded The Kids in the Hall with his best friend and actor Dave Foley. ==Filmography== Year Title Role Notes 2011 Keyhole 2010 Fish Hooks Dr. Frog Bea's Journalism teacher Death Comes to Town 2011 Dan Vs. Barry Ditmer 1 episode 2009 Back at the Barnyard Baxter / Flaky 4 episodes, \\- \"Puppy Love\" \\- \"Doggelganger\" \\- \"Man's Best Fiend\" \\- \"CuPig\" 2009 The Penguins of Madagascar Barry 1 episode, \"Untouchable\" 2007 WordGirl Vocab Bee, PoliceChief, Judge, The Baker 1 episode 2007 Epic Movie Harry Potter 2006 Bratz (TV series) Scott 2006 Unaccompanied Minors Guard 2006 Casper's Scare School Beaky (The Pirate's Parrot) 2006 Sketch with Kevin McDonald Host 2006 Minoriteam 2006 Leroy & Stitch Agent Pleakley 2005 Catscratch Waffle TV Series 2005 Sky High Dr. Medulla 2005 Lilo & Stitch 2: Stitch Has a Glitch Agent Pleakley 2004 Foster's Home for Imaginary Friends Ivan A seeing eye imaginary friend 2004 Zeroman Rusty Woodenwater TV Series 2004 Corner Gas Marvin Drey In the episode \"Tax Man\" 2004 Arrested Development Detective Streudler 1 episode, \"Not Without My Daughter\" 2003 Sick in the Head TV 2003 Stitch! The Movie Agent Pleakley 2003 Lilo & Stitch: The Series Agent Pleakley 2002 The True Meaning of Christmas Specials The Ghost of Christmas Specials Yet To Come TV 2002 Lilo & Stitch Agent Pleakley 2002 Kids in the Hall: Tour of Duty Various 2001 The Santa Claus Brothers Mel TV 2001 Sketch Pad The Kids in the Hall TV Series 2001 Invader ZIM Almighty Tallest Purple TV Series 2000 The Ladies Man (2000 film) Mail Man 1999 Galaxy Quest Announcer 1999 Dinner at Fred's Fred 1998 That '70s Show Pastor Dave 1998 The Godson Guppy Calzone 1998 Boy Meets Girl Jack 1998 The Angry Beavers Zookeeper 1997 Johnny Bravo Clown 1997 The Wrong Guy Motel Manager 1997 Seinfeld Denim Vest 1996 MADtv Guest Host 1996 Friends Guru Saj 1996 Kids in the Hall: Brain Candy Dr. Chris Cooper, various characters 1995 National Lampoon's Senior Trip Travis Lindsey Star Trek obsessed Crossing Guard 1995 Saving Souls Featured Church Follower 1991 Zandalee Drug Dealer 1988 The Kids in the Hall Cast Member TV Series ==References== ==Other websites== * Category:1960 births Category:Living people Category:Actors from Montreal Category:Canadian movie actors Category:Canadian television actors Category:Canadian voice actors Category:Comedians from Quebec",
 "title": "Kevin McDonald"
}