{
 "id": "329801",
 "text": "\"Snow White\" is a fairy tale about a young princess who meets a group of dwarfs after running away from her evil stepmother who is jealous of her beauty. == Story == A Queen gives birth to a daughter. She names her Snow White. The queen dies. Snow White's father, the King marries an evil woman. This new Evil Queen has a Magic Mirror that tells her she is the fairest (most beautiful) in the land. One day the mirror says Snow White is the fairest. The queen is jealous. She decides to kill Snow White. The queen's huntsman takes the child into the woods to kill her. The huntsman is too kind to kill her so he lets her escape. Snow White comes to a cottage in the forest. It belongs to seven dwarfs. They allow her to live with them. She does the housework. The evil queen learns Snow White is still alive. She decides to kill Snow White herself and disguises herself as an old woman. She tries to kill Snow White first with a bodice lace and then with a poisoned comb. When the first two attempts fail, she disguises herself a third time, this time disguised as a farmer's wife and tries it with a poisoned apple and the girl falls down as if dead. The dwarfs place her in a glass coffin on a mountain top. One day a prince rides by. He falls in love with her. The dwarfs give him permission to take the coffin to his castle. The prince's friends lift the coffin. The bit of poisoned apple in Snow White's throat is loosened. She wakes up. The prince is happy. He marries Snow White. At the wedding, the evil queen is forced to dance in red-hot iron shoes until she dies. Snow White and the Prince then live happily ever after. == History == Early printed versions are found in Giambattista Basile's Pentamerone (1634) and in J. K. Musäus's German Folktales (1782). The Brothers Grimm wrote about a version called \"Little Snow White\" () in 1812 in their Children's and Household Tales. The Grimms' story is the best-known version of \"Snow White\" today.Zipes, p. 478 == Adaptations == \"Snow White\" has been adapted many times to plays, movies, and television programs. Walt Disney adapted the Grimms version to an animated movie in 1937 called Snow White and the Seven Dwarfs. == References == == Other websites == *The Annotated Snow White and the Seven Dwarfs, including variants from other countries * Text of \"Little Snow-white\" from \"Household Tales by Brothers Grimm\" on Project Gutenberg Category:Grimms' Fairy Tales",
 "title": "Snow White"
}