{
 "id": "330037",
 "text": "Anangu, Aṉaŋu or Arnangu (), is a word used to refer to Aboriginal people in Australia. It is found in some dialects of the Western Desert Language (WDL) of western and central Australia. Before European people arrived in central Australia, the word probably meant 'human being', or 'person'. But now it is used to mean 'Aboriginal person' only. Because other Aboriginal languages have their own words for '(Aboriginal) person' the word anangu is mostly used in English to refer to the WDL-speaking people. Used in this way, it is not used to refer to any traditional grouping (or tribe), but to the WDL people as a whole. The correct term for \"black person\" in Pitjantjatjara is , literally \"dark/black person\". == Equivalents in other languages and dialects == Other Western Desert Language dialects have different words with a similar meaning and many uses. In the far west of the WDL (i.e. amongst Manyjilyjarra, Kartujarra, Putijarra and Warnman) the word martu is used, and in the central Western Desert (i.e. amongst the western Pintupi) the word purntu, although this seems to be rarely used now. There are a number of other names from Australian Aboriginal languages commonly used to identify groups based on geography: *Koori (or Koorie) in New South Wales and Victoria *Murri in southern Queensland *Nyoongar in southern Western Australia and South Australia *Nunga in southern South Australia *Palawah (or Pallawah) in Tasmania == References == *Goddard, Cliff. (1992). Pitjantjatjara/Yankunytjatjara to English Dictionary. IAD Press, Alice Springs Australia. () *Glass, Amee and Dorothy Hackett. (2003). Ngaanyatjarra & Ngaatjatjarra to English Dictionary. IAD Press, Alice Springs Australia. () *Goddard, Cliff. (1985). A Grammar of Yankunytjatjara. IAD Press, Alice Springs Australia. *Eckert, Paul and Joyce Hudson. (1988). Wangka Wiru: A handbook for the Pitjantjatjara language learner. SACAE, Underdale SA. () *Hansen, KC & LE Hansen. (1992). Pintupi/Luritja Dictionary 3rd Edition. IAD Press, Alice Springs, Australia. () * Valiquette, Hilaire (ed.). (1993). A Basic Kukatja to English Dictionary. Luurnpa Catholic School, Balgo WA. () == Other websites == *Web portal for Anangu Pitjantjatjara, Yankunytjatjara and Ngaanyatjarra peoples, communities and organisations *Description of Tjukurpa - the foundation of Anangu life at Department of Environment and Heritage Category:Indigenous peoples of Australia",
 "title": "Aṉangu"
}