{
 "id": "330160",
 "text": "The Constitution of India is the supreme law in India. The constitution of India is the framework for political principles, procedures and powers of the government. It is also the longest constitution in the world. Originally, it consisted of 395 Articles arranged under 22 Parts and 8 Schedules. As of 2023, after many amendments it has 470 Articles, 12 schedules, and 25 Parts with 5 appendices and 98 amendments. The original constitution was written on 26 November 1949, and was made the center of law on 26 January 1950. == History == India had to face many problems after independence. Rehabilitating the refugees who migrated from Pakistan, merging the princely states, maintenance of law and order were the major challenges. Sardar Patel successfully achieved the merger of the princely states and provinces with the Union of India. Even the challenge of framing a constitution in order to enable govern the country was also fulfilled. The recommendations of the Motilal Nehru Committee and the decisions taken by the meeting of National Congress at Karachi prepared for the formation of a Constituent Assembly. The first meeting of the new Constituent Assembly was conducted on 9th of December, 1946. The next meeting conducted in 11th of December, 1946 under the chairmanship of Dr. Rajendra Prasad. Participants included Jawaharlal Nehru, Sardar Vallabhbai Patel, Dr. B. R. Ambedkar and Sarojini Naidu. Dr. Ambedkar, chairman of the Drafting Committee, is often called the father of the Indian Constitution. The Constituent Assembly met for the first time in New Delhi on 9 December, 1946 in the Constitution Hall which is now known as the Central Hall of Parliament House. It had 145 meetings and framed a draft constitution. During these discussions, the various laws proposed by the British Government in 1909, 1919 and 1935, the British Parliamentary system, the American Bill of Rights, the Social Directive Policies of Ireland were studied and some parts of those were written in the Constitution. Finally, the Indian Constitution was approved on 26th of November, 1949 and came into effect on 26th of January, 1950. This day (January 26) is celebrated as the 'Republic Day' in India. == Structure == Below is a list of all articles in chronological order of the constitution. * Preamble * Part I – Union and its Territory * Part II – Citizenship. * Part III – Fundamental Rights. * Part IV – Directive Principles of State Policy. * Part IVA - Fundamental Duties. * Part V – The Union. * Part VI – The States. * Part VII – States in the B part of the First schedule(Repealed). * Part VIII – The Union Territories * Part IX – The Panchayats. * Part IXA - The Municipalities. * Part X – The scheduled and Tribal Areas * Part XI – Relations between the Union and the States. * Part XII – Finance, Property, Contracts and Suits * Part XIII – Trade and Commerce within the territory of India * Part XIV – Services Under the Union, the States. * Part XIVA - Tribunals. * Part XV – Elections * Part XVI – Special Provisions Relating to certain Classes. * Part XVII – Languages * Part XVIII – Emergency Provisions * Part XIX – Miscellaneous * Part XX – Amendment of the Constitution * Part XXI – Temporary, Transitional and Special Provisions * Part XXII – Short title, date of commencement, Authoritative text in Hindi and Repeals. ==Related pages== *Constitution *Constitutionalism ==References== *Salient Features of the Indian Constitution *Features of the Indian Constitution • ==Other websites== *Indian Constitution at Wikisource Category:Law of India India Category:1950 Category:1950s in India Category:B. R. Ambedkar",
 "title": "Constitution of India"
}