{
 "id": "330265",
 "text": "Aardman Animations Ltd., also known as Aardman, is a British stop-motion clay animation studio in Bristol, England. It is known for using techniques with the characters Wallace and Gromit modelled in plasticine. It successfully entered the computer animation market with Flushed Away (2006). Their stop- motion films are among the highest-grossing stop-motion films of all time. Their debut, Chicken Run (2000), is their top-grossing film. It is the highest-grossing stop-motion film of all time. In 1991, Park's short, Creature Comforts, was the first Aardman production to win an Academy Award. == History == === 1972–1996 === Aardman was founded in 1972 as a low-budget project by Peter Lord and David Sproxton, who wanted to realise their dream of producing an animated motion picture. The partnership provided animated sequences for the BBC series for deaf children Vision On. The company name originates from the name of their nerdish Superman character in that sequence. The process of using clay animation to produce a segment called \"Greeblies\" (1975) became the inspiration for creating Morph, a simple clay character. Around the same time, Lord and Sproxton made their first foray into adult animation with the shorts Down and Out and Confessions of a Foyer Girl, entries in the BBC's Animated Conversations series using real-life conversations as soundtracks. Aardman also created the title sequence for The Great Egg Race and supplied animation for the multiple award-winning music video of Peter Gabriel's song \"Sledgehammer\". They produced the music video for the song \"My Baby Just Cares For Me\" by Nina Simone in 1987. Also in the 1980s, they created the trombone- playing character \"Douglas\" in a television commercial for Lurpak butter. Later Aardman produced a number of shorts for Channel 4, including the Conversation Pieces series. These five shorts worked in the same area as the Animated Conversations pieces, but were more sophisticated. Lord and Sproxton began hiring more animators at this point; three of the newcomers made their directorial debut at Aardman with the Lip Synch series. Of the five Lip Synch shorts, two were directed by Lord, one by Barry Purves, one by Richard Goleszowski and one by Nick Park. In 1991, Park's short, Creature Comforts, was the first Aardman production to win an Academy Award. Park also developed the clay modelled shorts featuring the adventures of Wallace and Gromit, a comical pair of friends: Wallace being a naive English inventor with a love of cheese, and Gromit his best friend, the intelligent but silent dog. These films include A Grand Day Out (1989), The Wrong Trousers (1993) and A Close Shave (1995), the latter two winning Academy Awards. === 1997–2007 === In December 1997, Aardman and DreamWorks (later DreamWorks Animation) announced that their companies were teaming up to co-finance and distribute Chicken Run, Aardman's first feature film, which had already been in pre-production for a year. On 27 October 1999, Aardman and DreamWorks signed a $250 million deal to make an additional four films that were estimated to be completed during the next 12 years. Along with the deal their first project was announced, titled The Tortoise and the Hare. Intended to be based on Aesop's fable and directed by Richard Goleszowski, it was paused two years later because of the script problems. On 23 June 2000, Chicken Run was released to a great critical and financial success. In 2005, after ten years of absence, Wallace and Gromit returned in Academy Award-winning The Curse of the Were-Rabbit. The following year Flushed Away, Aardman's first computer-animated feature, was released. Logo used from 1998 until 2022 On 1 October 2006, right before the release of Flushed Away, The New York Times reported that due to creative differences DreamWorks Animation and Aardman would not be extending their contract. The deal was officially terminated on 30 January 2007. According to an Aardman spokesperson: \"The business model of DreamWorks no longer suits Aardman and vice versa. But the split couldn't have been more amicable.\" Unofficial reasons for departure were weak performances of the last two movies, for which DreamWorks had to take writedowns, and citing the article, \"Aardman executives chafed at the creative control DreamWorks tried to exert, particularly with Flushed Away...\" The studio had another film in development, Crood Awakening (eventually The Croods), which had been announced in 2005, with John Cleese co-writing the screenplay. With the end of the partnership, the film's rights reverted to DreamWorks. On 10 October 2005, a serious fire at a storage facility used by Aardman and other Bristol-based companies destroyed over 30 years of props, models, and scenery often built by the Bristol-based Cod Steaks. This warehouse was used for storage of past projects and so did not prevent the production of their current projects at the time. In addition, the company's library of finished films was stored elsewhere and was undamaged. An electrical fault was determined to be the cause of the blaze. Referring to the 2004 South Asia earthquake and tsunami, Park was quoted as saying, \"Even though it is a precious and nostalgic collection and valuable to the company, in light of other tragedies, today isn't a big deal.\" From 2006 to 2007, the Ghibli Museum in Mitaka, Tokyo, Japan, had an exhibit featuring the works of Aardman Studios. Sproxton and Lord visited the exhibit in May 2006 and met with animator Hayao Miyazaki during the visit. Miyazaki has long been a fan of Aardman Animations' works. === 2007–present === In April 2007, Aardman signed and in 2010 renewed a three-year deal with Sony Pictures to finance, co- produce, and distribute feature films. The next year, Aardman released a new Wallace and Gromit short film, called A Matter of Loaf and Death. The first film made in partnership with Sony was the computer-animated Arthur Christmas (2011), which is Aardman's first 3D feature film. 2012 saw the release of The Pirates! In an Adventure with Scientists! (known internationally as The Pirates! Band of Misfits), Aardman's first 3D stop-motion film and Peter Lord's first film as a director since Chicken Run. Two additional films were announced in June 2007: The Cat Burglars, a stop-motion animated heist comedy film directed by Steve Box, about cat burglars that steal milk, and their plans to pull off 'the great milk float robbery'; and an untitled Nick Park project (which would later become Early Man). The studio is also known to provide generous resources and training to young animators by providing awards at various animation festivals. For example, The Aardman Award at the UK's Animex Festival in Teesside provides story consultation to a promising young animator for their next film. In 2008, Aardman joined with Channel 4 and Lupus Films to launch a user-generated content animation portal called 4mations. They also designed the BBC One Christmas Idents for that year, which featured Wallace and Gromit to tie in with the showing of the new Wallace and Gromit film called A Matter of Loaf and Death on Christmas Day at 8:30pm. In April 2008, Aardman launched the Aardman YouTube channel, which is a YouTube Partner channel featuring the entire Creature Comforts TV series, the Morph series, Cracking Contraptions and clips from the Wallace and Gromit films. From December 2008, Aardman also started posting various flash games on Newgrounds, the majority of which are based on Wallace and Gromit and Shaun the Sheep. In 2009, Nintendo announced that Aardman would make twelve short films using only Flipnote Studio. The films were posted on Flipnote's Hatena web service provider. The first film was called The Sandwich Twins and was released on 16 September 2009. The remaining eleven films were released on a weekly basis until Christmas, and can also be downloaded using Hatena. In the same year, the headquarters of the studio moved into a new building, designed by Alec French architects, in Gas Ferry Road, Bristol, although work needing large- scale sets is still carried out in sheds in Aztec West and Bedminster. In April 2009, Aardman Animations edited the existing Watch identity by UKTV to make the inflatable eyeball (called \"Blinky\") in the idents blink. In October 2013, Peter Lord (co-founder of Aardman Animations) created a fundraising project on the crowdfunding site Kickstarter. The campaign has a target of £75,000 which will be used to fund 12 new one-minute episodes of Morph. Lord was hoping to start production in January 2014 using the original stop-frame animation. Backers of the project will receive a variety of rewards, including early access to the new animations and a small box of clay used in the production, depending on the individual's level of funding. In 2015, the studio bought a majority share in New York-based animation studio Nathan Love, announcing the merger with a short film called Introducing: Aardman Nathan Love on 25 September of the same year of that being that the British stop- motion animated series Digby Dragon debuted on Nick Jr. UK in 2016. In advance of Aardman's fortieth anniversary, BBC One aired the one-hour television documentary A Grand Night In: The Story of Aardman, first broadcast in December 2015. Narrated by Julie Walters, this career retrospective includes commentary by the company's founders and staff, as well as various friends, fans and colleagues including Terry Gilliam, John Lasseter, and Matt Groening. From 29 June 2017 to 29 October 2017, an exhibition entitled \"Wallace and Gromit and Friends\" was shown at the Australian Centre for the Moving Image (ACMI) in Melbourne. A report on this exhibition was shown on Australian ABC News Breakfast on Wednesday, 28 June, featuring an 8-minute interview with producers Peter Lord and David Sproxton. The exhibition revealed that in Nick Park's very early sketches, Gromit was originally a cat, but Park soon changed him into a dog, since it was generally agreed that a dog was clearly more suitable as a loyal pet/companion than a cat and also because a dog would be easier to make and animate in Plasticine. Embedded in the ABC News article is a video interview with Lord and Sproxton, which gives information not only on Wallace and Gromit, but also Shaun the Sheep and others. On 9 November 2018, Aardman Animations announced that Peter Lord and David Sproxton would be transferring majority ownership of the company to its employees in order to keep the studio independent. In January 2019, Lord and Sproxton released a book detailing the history of the studio, called A Grand Success! The Aardman Journey, One Frame at a Time. In December 2020, Netflix announced an Aardman Christmas musical special entitled Robin Robin. The 30-minute short, starring Bronte Carmichael, Richard E. Grant, Gillian Anderson and Adeel Akhtar, was released on the platform on November 24, 2021. On 20 January 2022, Netflix announced a sequel to Chicken Run entitled Chicken Run: Dawn of the Nugget. The film, starring Thandiwe Newton and Zachary Levi, is slated to premiere on the platform in 2023. A new, untitled Wallace and Gromit film was also confirmed to be 'in the works', and is currently slated for a 2024 release, as well as a logo change after over 23 years. == Company name == The company name is taken from one of its early characters, a superhero created for Vision On in 1972. Unlike the claymation productions that the company are famous for, Aardman was cel-animated. Peter Lord has stated that the most interesting thing about the company name is that it \"means nothing\" and is only a joke that two teenagers found funny. He has stated that the name came from a combination of \"Aardvark\" and \"Superman\" for the reason that they found aardvark to be a particularly funny word. Aardman Animations became their company name when the BBC asked them to whom they should make their first cheque out. Co-founder David Sproxton has claimed that the name was a result of being unable to \"find another word with more A's in it than 'aardvark'\" as a schoolboy. == Non-Aardman productions by Aardman directors == A number of Aardman directors have worked at other studios, taking the distinctive Aardman style with them. Aardman's Steve Box directed the animated music video for the Spice Girls' final single as a five-piece, \"Viva Forever\". Widely regarded as the Spice Girls' most critically acclaimed song,[citation needed] the video took over five months to produce, considerably longer than the group's box office hit movie, Spice World. He is also the co-creator of the Finnish- British animated series Moominvalley, based on the Moomins books. Barry Purves, director of the Aardman short Next, also directed Hamilton Mattress for Harvest Films. The film, a half-hour special that premiered on Christmas Day 2001, was produced by Chris Moll, producer of the Wallace and Gromit short film The Wrong Trousers. The models were provided by Mackinnon & Saunders, a firm that did the same for Bob the Builder and Corpse Bride. Similarly, Robbie the Reindeer in Hooves of Fire, a BBC Bristol/Comic Relief production, was directed by Richard Goleszowski, creator of Rex the Runt. Its sequel, Robbie the Reindeer in Legend of the Lost Tribe, was directed by Peter Peake, whose directorial credits for Aardman include Pib and Pog and Humdrum. Aardman alumni also produced many of the claymation shorts used in the 1986–1990 American television series Pee-wee's Playhouse. == Filmography == Aardman Animation has produced a number of animated features, shorts, videos and TV series, as well as adverts. === Short movies === ** Animated Conversations: Down and Out (1977) ** Animated Conversations: Confessions of a Foyer Girl (1978) ** Conversation Pieces: On Probation (1983) ** Conversation Pieces: Sales Pitch (1983) ** Conversation Pieces: Palmy Days (1983) ** Conversation Pieces: Early Bird (1983) ** Conversation Pieces: Late Edition (1983) ** Sweet Disaster: Babylon (1986) ** Wallace & Gromit: A Grand Day Out (1989) ** Creature Comforts (1989) ** War Story (1989) ** Going Equipped (1990) ** Ident (1990) ** Next (1990) ** Rex the Runt: How Dinosaurs Became Extinct (1991) ** Rex the Runt: Dreams (1991) ** Adam (1992) ** Never Say Pink Furry Die (1992) ** Loves Me, Loves Me Not (1993) ** Not Without My Handbag (1993) ** Wallace & Gromit: The Wrong Trousers (1993) ** Pib and Pog (1995) ** Wallace & Gromit: A Close Shave (1995) ** Rex the Runt: North by North Pole (1996) ** Pop (1996) ** Wat's Pig (1996) ** Owzat (1997) ** Stage Fright (1997) ** Al Dente (1998) ** Humdrum (1999) ** Minotaur and Little Nerkin (1999) ** The Deadline (2001) ** Len's Lens (2002) ** Vacation (2002) ** The Non-Voters (for the BBC Election coverage) (2004) ** The Adventures of Jeffrey (2005) ** Angry Kid: Who do you think you are? (2004) ** The Pearce Sisters (2007) ** Wallace & Gromit: A Matter of Loaf and Death (2008) ** Gulp (2011) ** The Itch of The Golden Nit (2011) ** Pythagasaurus (2011) ** Fly (2011) ** DC's World Funnest (\"DC Nation Shorts\") (2012–2014) ** Timmy Time – Timmy's Christmas Surprise (2011) ** Timmy Time – Timmy's Seaside Rescue (2012) ** Wallace & Gromit's Jubilee Bunt-a-thon (2012) ** The Pirates! So You Want to Be a Pirate! (2012) ** Wallace & Gromit's Musical Marvels (2012) ** Darkside (2013) ** Sphere (2013) ** Zombie Fairy (2014) ** Ray's Big Idea (2014) ** Special Delivery (2015) ** Full ANL (2015) ** Shaun the Sheep: The Farmer's Llamas (2015) ** Aardman Nathan Love (2015) ** Mac (2016) ** NSPCC (2016) ** Visualise This (2017) ** Robin Robin (2021) ** Shaun the Sheep: The Flight Before Christmas (2021) ** Star Wars: Visions: I Am Your Mother (2023) === Television Series === Title Premiere date End date Co-production with Network Vision On (segments) 1972 1976 BBC Aard-Man 1972 1973 Greeblies 1974 1975 Take Hart (segments) 1977 1982 The Great Egg Race(opening titles) 1979 1986 The Amazing Adventures of Morph October 13, 1980 1981 Hartbeat (segments) 1984 1993 Round the Bend (segments) January 6, 1989 July 1, 1991 ITV The Art Box Bunch 1995 1995 BBC The Morph Files January 4, 1996 March 29, 1996 Rex the Runt December 21, 1998 December 16, 2001 BBC Two Smart Hart 1999 2000 BBC Angry Kid (original run) 1999 2007 Channel 4 BBC Three Wallace & Gromit's Cracking Contraptions October 15, 2002 Christmas 2002 BBC One The Presentators 2003 2004 Nickelodeon Creature Comforts October 1, 2003 June 18, 2007 ITV Planet Sketch 2005 2008 Decode Entertainment CITV Purple and Brown 2006 2007 Nickelodeon Pib and Pog 2006 2006 BBC Shaun the Sheep March 5, 2007 present CBBC (Series 1-5) Netflix (series 6) Creature Comforts America June 4, 2007 June 18, 2007 CBS Chop Socky Chooks March 17, 2008 November 28, 2008 Decode Enterprises Cartoon Network Teletoon A Town Called Panic January 2009 January 2009 Nickelodeon Timmy Time April 6, 2009 July 13, 2012 CBeebies(Series 1-3) Wallace and Gromit's World of Invention November 3, 2010 December 8, 2010 BBC Canimals March 19, 2011 November 24, 2015 Ragdoll production Moonschoop telegael DC Nation Shorts (\"DC's World Funnest\" shorts) November 11, 2011 July 27, 2014 Cartoon Network Shaun the Sheep 3D March 7, 2012 June 13, 2012 Nintendo Video Shaun The Sheep Championsheeps July 2, 2012 July 13, 2012 CBBC Brand New Morph/The Epic Adventures of Morph July 4, 2014 present YouTube(series 1 Sky Kids (series 2-present) Angry Kid (revival series) July 3, 2015 November 8, 2019 Mr Morris Productions Golden Morph August 7, 2015 present YouTube Morph: The Lost Tapes November 6, 2015 January 7, 2016 YouTube Meet David Attenborough May 6, 2016 May 8, 2016 BBC One Counterfeit Cat May 12, 2016 January 22, 2017 Disney XD Lloyd of the Flies September 20, 2022 present Cyber Group Studios CITV The Very Small Creatures March 4, 2022 present Sky Kids Sky Kids Adventures of ArachnoFly October 6, 2023 present YouTube Things We Love March 8, 2024 present BBC One === Feature movies === ==== Released movies ==== # Title Release date In partnership with Distributor Budget Gross Rotten Tomatoes Metacritic 1 Chicken Run June 30, 2000 DreamWorks Animation DreamWorks Pictures (International (except for Europe)) Pathé (Europe) $45 million $224.8 million 97% 88 2 Wallace & Gromit: The Curse of the Were-Rabbit October 14, 2005 DreamWorks Pictures $30 million $192.6 million 95% 87 3 Flushed Away December 1, 2006 Paramount Pictures $149 million $178 million 73% 74 4 Arthur Christmas November 11, 2011 Sony Pictures Animation Columbia Pictures (via Sony Pictures Releasing) $100 million $147 million 92% 69 5 The Pirates! In an Adventure with Scientists! March 28, 2012 $55 million $123 million 86% 73 6 Shaun the Sheep Movie February 6, 2015 StudioCanal StudioCanal Lionsgate (USA) $25 million $106.2 million 99% 81 7 Early Man January 26, 2018 $50 million $54.6 million 82% 68 8 A Shaun the Sheep Movie: Farmageddon October 18, 2019 StudioCanal Netflix (USA and Latin America) N/Y $43 million 96% 79 9 Chicken Run: Dawn of the Nugget December 15, 2023 Netflix $75 million $385.4 million 94% 94 10 Wallace & Gromit: Vengeance Most Fowl December 25, 2024 BBC Film Netflix === Upcoming === Title Release Date In partnership with Distributor 11 Shaun the Sheep: The Beast of Mossy Bottom 2026 Note: Rights to the Aardman films produced with DreamWorks Animation are now owned by Universal Pictures, following NBCUniversal's purchase of DreamWorks in 2016. == Franchises == Title Release Date Morph 1977–present Creature Comforts 1989–2011 Wallace and Gromit 1989–present Angry Kid 1998–2019 Chicken Run 2000–present Shaun the Sheep 2007–present == Associated Studios == * Pathé * DreamWorks Animation * Sony Pictures Animation * StudioCanal == Creative people == The leading members of the company have got recognition from the British award system. They are (alphabetical order): *Peter Lord CBE *Nick Park CBE *Barry Purves CBE *David Sproxton CBE ==Other websites== * * * Aardman Animations at Newgrounds == References == Category:1975 establishments in the United Kingdom Category:Academy Award winners Category:British animation studios",
 "title": "Aardman Animations"
}