{
 "id": "330462",
 "text": "thumb|300px|Four generations of slaves on a plantation in South Carolina c. 1862 Slave breeding was long a part of slavery. As in other slave countries, its purpose was to make more slaves. Slave breeding became more important in the United States the 19th century when the Atlantic slave trade ended. As with other commodities, scarcity caused the price of slaves to rise. More slaves meant more money for their owners.Marable, Manning, How capitalism underdeveloped Black America: problems in race, political economy, and society South End Press, 2000, p 72 Pregnancy was encouraged. Many slave masters raped their own slaves to make more slave children. It produced mulatto children. White men who owned slaves would often rape black women. Slave owners to increase the number of people they enslaved without the cost of purchase, and to fill labor shortages caused by the abolition of the Atlantic slave trade.Davis, David Brion (2014) \"Slavery, Sex, and Dehumanization.\" In Gwyn Campbell and Elizabeth Elbourne's Sex, Power, and Slavery. Athens, OH: Ohio University Press, pp. 51-53. == History == For some states such as Virginia and North Carolina it was an export industry; they sold slaves to places where the price was higher, such as Alabama and Arkansas. Slave breeders favored woman slaves who could have large numbers of children. As with other livestock, breeders tried to improve the health and productivity of slaves. Breeders were approved in slave states because slaves were considered to be less than human. Human rights did not apply to them. They were livestock, like horses or dogs. == Slaves became things == By the end of the 18th century, the forced reproduction of enslaved people was a common practice. Some experts suggest that several factors led to this development. The most important of these was that several laws had been passed, that changed the nature of slaves: they were seen as things, and oculd be bought and sold as chattel. This no longer was against the religious beliefs and social norms of society. The owner of the slave had all rights. The slave did not have a right of self- determination either to their own person, spouse, or children. Enslaving people began to assert that slavery was grounded in the Bible. This view was inspired in part by an interpretation of the Genesis passage \"And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren.\" (Genesis 9); Ham, son of Noah and father of Canaan, was deemed the antediluvian progenitor of the African people. Some white people used the Bible to justify the economic use of slave labor. The subjugation of the enslaved person was taken as a natural right of the white enslavers. The second-class position of the enslaved person was not limited to the relationship with the enslaver but was to be in relation to all white people. Enslaved people were considered subject to white persons.Eddie Donoghue, Black Breeding Machines: The Breeding of Negro Slaves in the Diaspora, AuthorHouse, 2008, pp. 134–136. == References == Category:Slavery in the United States Category:African-American history",
 "title": "Slave breeding in the United States"
}