{
 "id": "330608",
 "text": "\"The Legend of Sleepy Hollow\" is a short story by Washington Irving. The story was published in 1820 in a collection of Irving's literary pieces called The Sketch Book of Geoffrey Crayon, Gent. The story was one of the first fictional works by an American author to become popular outside the United States. Adaptations include Walt Disney's animated movie The Adventures of Ichabod and Mr. Toad of 1949 and, more recently, Tim Burton's Sleepy Hollow of 1999 starring Johnny Depp. == Story == A lanky school teacher named Ichabod Crane arrives in the village of Sleepy Hollow. He is very superstitious. He falls in love with pretty Katrina Van Tassel (and her father's large farm). Katrina has a suitor though. His name is Brom Bones. Brom is a rowdy and boisterous young man. He does not like Ichabod. He does not like Ichabod hovering about Katrina. One autumn night after a party at the Van Tassel's, Ichabod sets off for home alone. He thinks he sees the Headless Horseman, a dead soldier of the Revolution whose head was blown off by a cannon ball. His ghost haunts the countryside in search of his head. He chases Ichabod. Ichabod is terrified and runs away. He is never seen again. Villagers find Ichabod's hat, saddle, and a smashed Jack-o'-lantern. Whenever the story is told, Brom gives a knowing wink. It is implied that he frightened away his rival by posing as the Headless Horseman. ==References== == Other websites == *The Legend of Sleepy Hollow original text with human-read audio. *\"The Legend of Sleepy Hollow\" from The Harvard Classics (1917), hosted online at Bartleby.com. *\"Sleepy Hollow\" , a non-fiction update on the story's locale, written by Washington Irving in 1839. *Old Dutch Burying Ground of Sleepy Hollow , the churchyard where Ichabod Crane sought sanctuary. *List of locations related to \"The Legend of Sleepy Hollow\" . *\"Rip Van Winkle\" and \"The Legend of Sleepy Hollow\" - Irving's Fictions of Revolution *. * (directed by Tim Burton). *\"The Legend of Sleepy Hollow\" Brickfilm (Lego movie). * The unabridged \"Legend of Sleepy Hollow\" (Episode Number 174) is read in its entirety in Mister Ron's Basement Podcast * A Librivox Podcast version of \"Legend of Sleepy Hollow\" can be found here as well Category:19th-century American short stories Category:Works by Washington Irving",
 "title": "The Legend of Sleepy Hollow"
}