{
 "id": "330821",
 "text": "The Inventions and Sinfonias (1720; revised 1723) are 30 pieces of keyboard music (15 each in sinfonia and invention) composed by Johann Sebastian Bach. They are sometimes known as the Two and Three Part Inventions. Bach arranged the two groups of pieces in order of ascending key. Each group covers the eight major and seven minor keys. Bach wrote them as exercises and study pieces for his 12 year old son, Wilhelm Friedemann Bach. The 1720 versions are found in the boy's Little Keyboard Book of 1722. The invention and sinfonias are often used as preparation for two volumes of Bach's The Well-Tempered Clavier.Woodstra p. 51 Bach wrote in the preface to the printed edition of the Inventions and Sinfonias: \"Honest method, by which the amateurs of the keyboard – especially, however, those desirous of learning – are shown a clear way not only (1) to learn to play cleanly in two parts, but also, after further progress, (2) to handle three obligate parts correctly and well; and along with this not only to obtain good inventions (ideas) but to develop the same well; above all, however, to achieve a cantabile style in playing and at the same time acquire a strong foretaste of composition.\" == Media == All of these sinfonias are played by Randolph Hokanson. Key Invention Sinfonia C major No. 1, BWV 787 C minor No. 2, BWV 788 D major No. 3, BWV 789 D minor No. 4, BWV 790 E-flat major No. 5, BWV 791 E major No. 6, BWV 792 E minor No. 7, BWV 793 F major No. 8, BWV 794 F minor No. 9, BWV 795 G major No. 10, BWV 796 G minor No. 11, BWV 797 A major No. 12, BWV 798 A minor No. 13, BWV 799 B-flat major No. 14, BWV 800 B minor No. 15, BWV 801 To play the Musical Instrument Digital Interface (MIDI) files (Inventions), click their titles. For information on the MIDI files, click the speaker icon. These are computer-generated representations of Bach's music, and do not convey how a human pianist would perform them. All Sinfonias played by Randolph Hokanson == References == * Woodstra, Chris (Ed.) and others. 2005. Blair Johnston in All music guide to classical music. All Media Guide. . == Other websites == * Mutopia's editions of Bach's Inventions and Sinfonias * History and analysis of Bach's inventions * Bach – Inventions ( 43:26 minutes) at BBC's Discovering Music: Listening Library * Overview of Inventions from Tim Smith's Website * Graphical Motif Extraction of the Inventions and Sinfonias Category:Compositions by Johann Sebastian Bach",
 "title": "Inventions and Sinfonias (Bach)"
}