{
 "id": "331020",
 "text": "A lenticular galaxy is a type of galaxy. These galaxies have an elliptical shape and ill-defined spiral arms. Basically, they are a combinations of spiral and elliptical galaxies. Examples include the Cartwheel Galaxy and NGC 4479. They are disk galaxies that have lost most of their interstellar matter, therefore have very little ongoing star formation. Because of this, they contain a lot of aging stars like elliptical galaxies. Despite being different shapes and a different galaxy type, lenticular and elliptical galaxies share common properties such as spectral features and sizes. They are also early- type galaxies that are slowly evolving. == Morphology and structure == === Classification === Lenticular galaxies are unique, with a visible disk component and also a prominent bulge component. The bulge is larger than the disk in ratio than a normal spiral galaxy. The large bulge is what makes them look like an elliptical galaxy. Like spiral galaxies, they can also have a central bar. Lenticular galaxies are often considered to be a poorly understood transition state between spiral and elliptical galaxies, which makes their position in the Hubble sequence. Having no spiral arms, they are not spiral galaxies. The bulge is usually spherical, thus they are not elliptical galaxies. Lenticular galaxies are divided into subclasses based on either the amount of dust present or the prominence of a central bar. Galaxies with no central bars are S01, S02 and S03, the numbers indicate the amount of gas absorption in the disk. Barred galaxies are SB01, SB02 and SB03. === Bars === Like spiral galaxies, lenticular galaxies can also have a central bar. The subclasses for the barred lenticular galaxies are SB01, SB02 and SB03. Although the numbers represents the amount of gas absorption, they can also indicate the prominence of the central bar. SB01, have the least prominent bar. SB02, have a slightly prominent bar. SB03, has the most prominent bar. Examples: File:NGC 2787.jpg|SB01 (NGC 2787) File:NGC 1533 .jpg|SB02 (NGC 1533) File:NGC 1460 -HST10217 18-R850GB475.png|SB03 (NGC 1460) == References ==",
 "title": "Lenticular galaxy"
}