{
 "id": "331218",
 "text": "Alain Fabien Maurice Marcel Delon (; 8 November 1935 – 18 August 2024) was a French actor. He became famous quickly, and by the age of 23, he was already being compared to French actors like Gérard Philipe and Jean Marais. He was also compared to American actor James Dean. He was even called the male Brigitte Bardot. During his career, Delon worked with many well-known directors. Some of these are Luchino Visconti, Jean-Luc Godard, Jean-Pierre Melville, Michelangelo Antonioni and Louis Malle. Delon was given Swiss citizenship in 1999. He had a company managing product company, and it was based in Geneva. ==Early life== Delon was born in Sceaux, Seine (now Hauts-de- Seine), Île-de-France, which is a suburb of Paris. His parents, Édith (née Arnold) and Fabien Delon, divorced when Delon was four.Alain Delon Biography (1935-) Both remarried, and Delon has a half-sister and two half-brothers. He went to a Roman CatholicCineman, About the person boarding school. This was the first school he was removed from because of bad behavior. When he was 14, Delon left school. He then worked for at his stepfather's butcher shop for some time. He joined the French Navy three years later. In 1953 and 54 he served as a fusilier marin in the First Indochina War. Delon has said that out of his four years of military service he spent eleven months in prison for being \"undisciplined\", meaning that his bad behaviour ended up getting him jailed. In 1956, he returned to France after being dishonourably discharged from the navy. He did not have any money, and lived on whatever money he could find. ==Products== Since his perfume company was started, Delon has had many products sold under his name. Some of these are wristwatches, clothes, eyewear, stationery and cigarettes. Delon's sunglasses brand became very popular in Hong Kong after actor Chow Yun-fat wore them in the 1986 movie A Better Tomorrow. He wore these in two movies after this. It is said that Delon wrote a letter to thank Chow for helping the sunglasses sell out in the region.The Films of John Woo and the Art of Heroic Bloodshed by Anthony Leong from MediaCircus.net The movie's director John Woo has said that Delon is one of his idols. He wrote a short essay on Le Samourai as well as Le Cercle Rou for the Criterion Collection DVDs. ==Death== Delon suffered a stroke in June 2019. In August 2019, he was recovering in a Swiss hospital. In September 2022, he began treatment for a slow-progressing lymphoma. In the summer of 2023, Delon's three children made the decision to stop this treatment because it was weakening him. Delon died on 18 August 2024 at his home in Douchy, France at the age of 88. He was diagnosed with B-cell lymphoma earlier in the year. == Honours == *At the 45th Berlin International Film Festival, he won the Honorary Golden Bear. *Delon is on the cover of the 1986 album The Queen Is Dead by The Smiths. * He was made Officier (Officer) of the Ordre national du Mérite in 1995. * He was made Chevalier (Knight) of the Légion d'honneur on 21 February 1991. He was promoted to Officier (Officer) in 2005. ==Movies== Year Movie Role Notes 2008 Asterix at the Olympic Games (Astérix aux Jeux Olympiques) Jules César 2003–2004 Frank Riva Frank Riva television series 1999 Les Acteurs himself 1997 Une chance sur deux Julien Vignal 1996 Le Jour et la nuit Alexandre 1995 A Hundred and One Nights (Les cent et une nuits de Simon Cinéma) Alain Delon, en visite 1993 L'Ours en peluche Jean Rivière 1992 Un Crime Maitre Charles Durand 1992 The Return of Casanova (Le Retour de Casanova) Casanova 1990 Nouvelle Vague L'homme 1990 Dancing Machine Alan Wolf 1988 Ne réveillez pas un flic qui dort Commissaire Eugène Grindel 1985 Parole de flic Daniel Pratt 1984 Notre histoire Robert Avranche won– César Award for Best Actor 1984 Le Passage Jean Diaz 1983 Le Battant Jacques Darnay 1983 Swann in Love (Un amour de Swann) Baron de Charlus 1982 The Shock (Le choc) Martin Terrier 1981 Pour la peau d'un flic Choucas 1980 Trois hommes à abattre Michel Gerfaut 1980 Teheran 43 (Teheran 43. Nid d'espions) Foche 1979 The Medic (Le Toubib) Jean-Marie Desprès 1979 The Concorde ... Airport '79 Paul Metrand 1978 Attention, les enfants regardent L'homme 1977 Le Gang Robert le Dingue 1977 Death of a Corrupt Man (Mort d'un pourri) Xavier Maréchal nominated– César Award for Best Actor 1976 Monsieur Klein Robert Klein directed by Joseph Losey nominated– César Award for Best Actor 1976 Armaguedon Dr. Michel Ambrose 1976 Comme un boomerang Jacques Batkin 1976 L'Homme pressé Pierre Niox 1975 Flic Story Roger Borniche 1975 Le Gitan Le Gitan 1975 Zorro Don Diego de la Vega/Zorro 1974 Les Seins de glace Marc Rilsen 1974 Borsalino & Co. Roch Siffredi 1973 Two Men in Town (Deux hommes dans la ville) Gino Strabliggi 1973 La Race des seigneurs Julien Dandieu 1973 The Burned Barns (Les granges brûlées) Larcher 1973 Scorpio Jean Laurier, alias Scorpio 1973 No Way Out (Tony Arzenta) Tony Arzenta 1972 Traitement de choc Devillers 1972 Il était une fois un flic Man searching Rodriguez 1972 La prima notte di quiete Daniele Dominici directed by Valerio Zurlini 1971 Un Flic Coleman 1971 La veuve Couderc Jean 1971 Red Sun (Soleil Rouge) Gauche directed by Terence Young 1971 Fantasia chez les ploucs A caïd 1971 The Assassination of Trotsky Frank Jackson directed by Joseph Losey 1970 Le Cercle rouge Corey directed by Jean- Pierre Melville 1970 Borsalino Rocco Siffredi 1970 Doucement les basses Simon 1969 The Sicilian Clan (Le Clan des Siciliens) Roger Sartet 1969 Madly Julian 1969 Jeff Laurent 1968 The Swimming Pool (La Piscine) Jean-Paul 1968 The Girl on a Motorcycle (La Motocyclette) Daniel 1968 Farewell Friend (Adieu l'ami) Dino Barran co-starring with Charles Bronson 1968 Spirits of the Dead (Histoires extraordinaires) William Wilson 1967 Le Samouraï Jef Costello directed by Jean Pierre Melville 1967 Diabolically Yours (Diaboliquement vôtre) Pierre 1966 The Last Adventure (Les Aventuriers) Manu 1966 Lost Command Capt. Philippe Esclavier 1966 Texas Across the Rive (Texas nous voilà) Don Andrea 1965 Is Paris Burning? (Paris brûle-t-il?) Jacques Chaban-Delmas 1965 Once a Thief Eddie Pedak directed by Ralph Nelson; written by Zekial Marko 1965 The Yellow Rolls-Royce Stefano 1964 L'Insoumis Thomas 1963 La Tulipe noire Count de Saint Preux 1963 The Leopard Tancredi 1963 Any Number Can Win (Mélodie en sous-sol) Francis 1963 Joy House (Les Félins) Marc 1962 The Devil and the Ten Commandments (Le Diable et les Dix Commandements) Pierre Messager 1962 Carom Shots (Carambolages) Lambert 1962 Eclipse Piero directed by Michelangelo Antonioni 1962 Love at Sea (L'Amour à la mer) The film actor 1961 Amours célèbres Prince Albert 1961 The Joy of Living (Quelle joie de vivre) Ulysse 1960 Purple Noon (Plein Soleil) Tom Ripley 1960 Rocco and His Brothers Rocco Parondi directed by Luchino Visconti 1959 Le chemin des écoliers Antoine Michaud 1959 Faibles femmes Julien Fenal 1958 Christine Franz Lobheiner 1957 Quand la femme s'en mêle Jo 1957 Sois belle et tais-toi Loulou ==References== ==Other websites== * alaindelon.ch , his official website * Category:1935 births Category:2024 deaths Category:Actors from Hauts-de-Seine Category:French movie actors Category:French movie directors Category:French movie producers Category:French screenwriters Category:French television actors Category:Swiss movie actors Category:Swiss screenwriters Category:Television producers Category:Writers from Hauts-de-Seine Category:Deaths from lymphoma",
 "title": "Alain Delon"
}