{
 "id": "331349",
 "text": "Touch is an American supernatural drama television series, written and created by Tim Kring for the Fox Broadcasting Company. It was first aired on Wednesday, January 25, 2012 as a preview and on Thursday, March 22, 2012 as a series. 13 episodes have been ordered for the first season by Fox. The series was scheduled to begin on Monday, March 19, 2012, but was moved to Thursday, March 22, 2012, and on Thursday, March 15, 2012, a rerun of the first episode was broadcast. The show has a TV-PG and a TV-14 age rating in the United States. In Canada, the show is simultaneously broadcast on the Global Television Network, and premiered on the same day at the same time as the U.S. broadcast. The show is produced by 20th Century Fox Television and Chernin Entertainment. In the United States, the second season began airing on Fridays at 9:00 p.m. == Plot == Newspaper reporter Martin Bohm was once successful, until his wife was killed on September 11, 2001 in one of the towers of the World Trade Center. His life and mental health then spiraled downhill as a result and he is fired from his job. He made his mission since to take care of his autistic, Jake, by any means necessary. However, Martin continues to fail to communicate with his son, but can not cope with his behavioral problems. Soon, child protection authority is contacted. Child service agent Clea Hopkins believes that it would be best if Jake goes to facility for special needs children. However Martin soon realizes that Jake has a special gift and it soon becomes clear that Jake can predict the future. He gets guidance and support from Arthur DeWitt, a specialist in children with unusual talents. == Production == === Development === On January 19, 2011, Fox announced that there was going to be a new pilot by Tim Kring. On January 26, 2011, Fox announced that the new pilot was going to air in the 2011–2012 television season. === Casting === On February 22, 2011, Fox said that Kiefer Sutherland would be the main actor in the show. On June 10, 2011, Danny Glover got a part in the series. On June 16, 2011, Gugu Mbatha-Raw got a part in the show. In July 2011, Titus Welliver got a part in the new show as a social worker. == Characters == The characters are created by Tim Kring. === Main characters === * Martin Bohm (played by Kiefer Sutherland) is a former journalist whose wife, Sarah, was killed in the September 11 attacks. He is the father of Jacob. He was fired from the New York Herald not long after Sarah's death. Willing to do whatever is necessary to provide for his son, he has since worked as a doorman, taxi driver, and construction worker, and currently works as a baggage handler at JFK Airport. He also helps he's son with numbers. * Clea Hopkins (played by Gugu Mbatha-Raw) is a social worker, who is assigned to evaluate Jacob Bohm's living situation and his father Martin's ability to care for him. Clea is new at her job, but appears to genuinely want to help Jacob. After deciding that Jacob would be best served by his moving into an institution for autistic children, she begins to see what Martin was trying to tell her about Jacob's gift. * Jacob \"Jake\" Bohm (portrayed by David Mazouz) is the autistic son of Martin and Sarah Bohm. Jacob does not speak or let anyone touch him, including his father. He sees the world in numbers, and seems to have a special ability to predict future events. His obsession with numbers turns out to be the way he communicates with others, mainly his father. Though he has received no formal training in complex mathematics, he has discovered the Fibonacci sequence on his own simply through observation and his unique perception of the world around him. === Other characters === * Professor Arthur Teller (portrayed by Danny Glover) is an expert on children who possess special gifts when it comes to numbers. He runs the Teller Institute (seemingly a one-man operation out of his home) which specializes in misdiagnosed mutism in children. He seems very abrasive when he first answers his front door, but his tone quickly changes when he realizes he's found another gifted child. Showing his familiarity with similar situations, Teller makes a guess about Jake's cell phone tower incidents without prior knowledge. * Kayla Graham (portrayed by Karen David) is a call center worker for a cell phone company. Kayla aspires to be a recording artist in the music industry. * Sheri Strepling (portrayed by Roxana Brusso) is the director of the facility that Jake attends. * Simon Plimpton is a British traveler who loses his phone, which contains a photo of his deceased daughter. == Series overview == Season Episodes Originally aired DVD release date Season premiere Season finale Region 1 Region 2 Region 4 1 13 == Episodes == No. Title Directed by Written by Original air date Production code U.S. viewers (million) == Reception == === Critical reception === The show mainly has positive reviews with PopMatters said the show was \"stunningly effective\" and praised \"its mix of spirituality and science, familial and global struggles.\" They also noted that \"The boy’s narration, unnervingly matter-of-fact about the nature of the universe, takes on more power when he reveals that in 11 years, he has never spoken a word.\" The New York Post said \"If you can’t get enough of number sequences and universal cylindrical patterns that constantly repeat, then for sure you’ll repeat the pattern of watching Fox’s new show....It is intriguing, and it’s great to have Sutherland back on TV\" but felt \"frankly, it’s awfully complicated.\" The Chicago Sun Times said the show \"operates on the mind-blowing premise that people around the world are linked to one another and their lives intersect — with potentially major repercussions.\" They finished the review saying it \"delivers a suspenseful ride around the world, peppered with some tear-jerking moments. The bar has been set high. Here’s hoping “Touch” continues to reach it.\" Kiefer Sutherland's performance has good reviews, with many critics saying \"He plays the part with such a combination of intensity and subtlety that we are drawn deep into Martin’s suffering, and rather than judging him, we feel with him. Every trial is etched in his face. He imbued Jack Bauer with similar stoicism, but Martin seems less resilient, more distressed.\" The Los Angeles Times gave the show a 40 of 100, which was the lowest review along with Philadelphia Daily News which was also 40 of 100. On Metacrtic, the Metascore is 63 of 100 based on 27 critic reviews. The average score for users is 8.2 of 10. The show has a 8.9 out of 10 (\"great\") score on TV.com. == Ratings == === U.S. ratings === No. Title Air date 18–49 rating Viewers (millions) Weekly rank 1 \"Pilot\" 3.9/10 12.01 #9 2 \"1+1=3\" 3.3/9 11.81 #8 3 \"Safety in Numbers\" 8.92 4 \"Kite Strings\" 5 \"Entanglement\" === Canadian ratings === No. Title Air date Viewers (millions) Weekly rank 1 \"Pilot\" January 25, 2012 1.520 #10 2 \"1+1=3\" 3 \"Safety in Numbers\" 4 \"Kite Strings\" 5 \"Entanglement\" === UK ratings === No. Title Air date Viewers Notes 1 \"Pilot\" March 20, 2012 760,000 The first episode was the highest-rated non-soap multichannel show of the night. It was ranked No. 1 in its time period among all basic cable and satellite channels. === Other countries === The show has, for the first time in history, was one of the highest-rated individual channel airing of the season, ranking #1 or #2 in its time period and outperforming the primetime average of the broadcaster by double- or triple-digit percentage increases. In Italy, it started as the channel's second highest-rated television premiere ever. In Spain, Touch ranked #1 for the first episode in the timeslot. In Latin American countries, outperformed the channels' primetime average by double- and triple-digit percentage increases in Argentina, Colombia and Mexico. Other countries had good starts, like Germany, Norway and Russia. == International broadcast == The show has started in over 100 countries including: Country Channel Premiere date Austria ORF eins February 27, 2012 (Pilot only) March 26, 2012 (regular) Australia Network Ten 2012 Brazil FOX Brazil March 19, 2012 Chile Fox Latin America March 19, 2012 Canada Global March 22, 2012 China FOX Asia March 25,2012 Croatia FOX Life March 22, 2012 Denmark TV 2 TBA Germany Pro 7 February 27, 2012 (Pilot only) March 26, 2012 (regular) Greece FX March 22, 2012 India STAR World India March 24, 2012 Israel Yes Action March 28, 2012 Italy Fox March 20, 2012 Canal FOX March 19, 2012 (2-hour premiere) Macedonia Fox Life March 27, 2012 New Zealand TV3 March 25,2012 Norway TV 2 March 19, 2012 Philippines Jack TV/CHASE on BEAM 31 March 18, 2012 Poland FOX March 26,2012 (2-hour premiere) Portugal FOX March 20, 2012 (2-hour premiere) Russia Channel One March 25, 2012 Spain Fox España March 22, 2012 Turkey Foxlife March 20, 2012 United Kingdom Ireland Sky1 March 20, 2012 Hong Kong Indonesia Malaysia Singapore Thailand FOX Asia March 25, 2012 == Online media == Most recent episodes can be viewed on Fox.com in the United States, it can also be viewed on many other sites. In Canada, recently aired full episodes air on Global Video at GlobalTV.com. == Related pages == * James Burke—a television documentarian whose works (Connections and its sequels) show how seemingly unrelated people and events in science history are actually connected * Fox Broadcasting Company * Television program == References == == Other websites == * * * Touch at TV.com * Category:2012 American television series debuts Category:2013 American television series endings Category:2010s American television series Category:American drama television series Category:Autism in fiction Category:Fox television series Category:Television series set in New York City Category:English-language television programs",
 "title": "Touch (TV series)"
}