{
 "id": "331311",
 "text": "Blaine Gabbert is an American football quarterback for the Kansas City Chiefs of the National Football League. He played college football for the Missouri Tigers. He also played for the Jacksonville Jaguars. ==Early life== Gabbert was born in Ballwin, Missouri, USA and went to Parkway West High School, where he played high school football. In his sophomore season, he threw for about 1,100 yards and 11 touchdowns as a first-year starter. As a junior, he had 1,523 yards and 20 scores and also added 458 yards and 8 TDs rushing. He threw 623 passing yards and five touchdowns as a senior, despite an injured foot that limited him to four games. He was considered one of the best players entering college at his position. ==College== Gabbert started his college football career as only a third string player. Here are his statistics with the Missouri Tigers: Year Team Attempts Completions Completion % Yards TDs INT 2008 Missouri 13 5 38.4% 43 0 0 2009 Missouri 445 262 58.8% 3,593 24 9 2010 Missouri 475 301 63.4% 3,186 16 9 College Totals College Totals 933 568 60.9% 6,822 40 18 ==Professional career== ===Jacksonville Jaguars=== After an impressive showing at the combine, Gabbert was taken 10th overall by the Jacksonville Jaguars in the 2011 NFL Draft. Gabbert, who to his credit was playing on a team that had done very poorly the past several years, had a bad season in 2011. He was sacked 40 times (3rd most in league history), fumbled 14 times, and threw only 12 touchdown passes next to eleven interceptions as Jacksonville's bad luck continued. Analysts noted how Gabbert's height decreased when he threw, which is the opposite of what is supposed to happen. === San Francisco 49ers === On March 11, 2014, Gabbert got traded to the San Francisco 49ers. ==References== * Rivals.com pro-style quarterbacks 2008, January 16, 2008 * Tucker, Billy (November 16, 2007), ESPN.com, \"Gabbert drawn by Mizzou's coaches\" * The Sporting News, September 9, 2008, \"Missouri burns QB Gabbert's redshirt\" * Laymance, Reid. Stltoday.com. \"Blaine Gabbert entering 2011 draft\". * nfldraftscout.com. \"Blaine Gabbert, DS #1 QB, Missouri\" . * nfl.com. \"NFL Events: Combine Player Profiles – Blaine Gabbert\". * Jags send two picks to 'Skins, draft QB Gabbert at No. 10-NFL.com * Jaguars sign Gabbert-ESPN Category:1989 births Category:American football quarterbacks Category:Sportspeople from Missouri Category:Jacksonville Jaguars players Category:Living people",
 "title": "Blaine Gabbert"
}