{
 "id": "331324",
 "text": "\"Waking Up in Vegas\" is a song by American singer-songwriter Katy Perry from her second studio album One of the Boys. Perry wrote it with Desmond Child and Andreas Carlsson and produced it with Greg Wells. It was released to US radio stations on April 21, 2009 as the fourth and last single of the album. It is about getting drunk and blowing money in Las Vegas, paying homage to the phrase \"what happens in Vegas, stays in Vegas\". It received positive reviews by the music critics, who complimented it's catchiness. The song achieved commercial success, reaching the top ten in eight countries. The song peaked at number nine and become her third top ten single in the U.S. At the same time it peaked at number one on the Mainstream Top 40 sub-chart in the Hungarian radio. The song peaked near number one on Billboard Hot 100, giving Perry her third top ten song off that album. It also topped number one in Australia and the Netherlands. ==Credits and personnel== Credits adapted from CD single liner notes and Tidal. ;Publishing and recording locations * Published by When I'm Rich You'll Be My Bitch/Desmando Music/Andreas Carlsson Publishing AR/WB Music Corp * Recorded at Rocket Carousel Studio, Los Angeles, California * Mixed at MixStar Studios, Virginia Beach, Virginia * Mastered at Bornie Grundman Mastering, Hollywood, California ;Personnel * Katy Perry – vocals, songwriting, production * Desmond Child – songwriting * Andreas Carlsson – songwriting * Greg Wells – production, recording assistant * Serban Ghenea – mixing * John Hanes – mixing engineering * Joe Zook – mixing engineering * Tim Roberts – mixing engineering assistant * Brian \"Big Bass\" Gardner – mastering ==Charts== ===Weekly charts=== Chart (2009) Peak position Croatia International Airplay (HRT) 28 Iceland (RÚV) 17 Mexico Anglo (Monitor Latino) 7 ===Year-end charts=== Chart (2009) Position Australia (ARIA) 67 Canada (Canadian Hot 100) 28 Hungary (Rádiós Top 40) 30 Netherlands (Dutch Top 40) 76 UK Singles (OCC) 138 US Billboard Hot 100 36 ==Certifications== ==Release history== Release dates and formats for \"Waking Up in Vegas\" Region Date Format Version(s) Label(s) United States April 21, 2009 Contemporary hit radio Original Capitol May 18, 2009 Hot adult contemporary radio Italy June 4, 2009 Radio airplay Polydor Various June 5, 2009 Digital download Remixes EP Capitol United Kingdom June 8, 2009 CD Germany June 19, 2009 Capitol ==References== category:2009 songs Category:Katy Perry songs",
 "title": "Waking Up in Vegas"
}