{
 "id": "331314",
 "text": "\"Part of Me\" is a song by American recording artist Katy Perry. The song was written by Perry, Bonnie McKee, Lukasz Gottwald, Henry Walter, and Max Martin, while the production was done by Dr. Luke and Cirkut. The song was released as the first single from Teenage Dream: The Complete Confection, which is a re- release of her album Teenage Dream. This song was leaked several times; in late 2010, the entire demo of the song leaked online, with music critics comparing the song to Perry's previous single \"California Gurls\" (2010). The lyrics were changed on the released version, prompting speculation that the lyrics were directed towards ex-husband Russell Brand, which Perry later denied. Following a performance on the 54th Grammy Awards, the song debuted at number one on the Billboard Hot 100. The song has reached number one in the UK, Canada, New Zealand, and the US. It has been certified triple-platinum in the US for sales of over three million copies there. == Music video == The video for the song features Perry driving in her car, listening to a radio show about cheating lovers. She then finds her boyfriend kissing another woman at his office. Perry has a breakdown and cuts her hair in a convenience-store bathroom before enlisting in the U.S. Army. ==Charts== === Weekly charts === Weekly chart performance for \"Part of Me\" Chart (2012) Peak position France Airplay (SNEP) 8 Italy (FIMI) 14 Japan (Japan Hot 100) 22 Lebanon (Lebanese Top 20) 3 Mexico (Billboard Mexican Airplay) 8 South Korea Foreign (Circle) 6 Turkey (Number One Top 20) 11 Ukraine Airplay (TopHit) 59 US Dance Mix/Show Airplay (Billboard) 4 Venezuela Pop Rock General (Record Report) 1 ===Monthly charts=== Monthly chart performance for \"Part of Me\" Chart (2012) Peak position Ukraine Airplay (TopHit) 76 ===Year-end charts=== 2012 year-end chart performance for \"Part of Me\" Chart (2012) Position Australia (ARIA) 45 Brazil (Crowley) 21 Canada (Canadian Hot 100) 18 France (SNEP) 98 Hungary (Rádiós Top 40) 44 Italy (FIMI) 74 New Zealand (RIANZ) 31 South Korea Foreign (Circle) 86 UK Singles (OCC) 55 US Billboard Hot 100 31 US Adult Contemporary (Billboard) 40 US Adult Top 40 (Billboard) 26 US Dance Club Songs (Billboard) 36 US Dance/Mix Show Airplay (Billboard) 31 US Mainstream Top 40 (Billboard) 24 ==Certifications== ==Release history== Release dates and formats for \"Part of Me\" Region Date Format Label Australia February 14, 2012 Digital download Capitol Austria Belgium Czech Republic Denmark Finland Germany Italy Japan Netherlands New Zealand Norway Portugal Spain Sweden Switzerland United States February 21, 2012 Contemporary hit radio Ireland March 18, 2012 Digital download United Kingdom April 23, 2012 CD ==References== Category:2012 songs Category:Katy Perry songs Category:Songs about infidelity Category:Songs with feminist themes",
 "title": "Part of Me"
}