{
 "id": "331329",
 "text": "Bob's Burgers is an American animated sitcom produced by 20th Television. It first appeared on television on January 9, 2011. This TV show would be shown during Fox's \"Animation Domination\" block, a specific television block from Fox that airs on Sunday nights. The show has been renewed for a fourteenth season and a fifteenth season. ==Plot== The show centers on the Belcher family, who run a hamburger restaurant. Throughout the series, there are stories that relate to the Belcher family and the citizens that live near them. ==Characters== ===Belcher family=== * Bob Belcher (voiced by H. Jon Benjamin) – He is the main character of the series. He is the owner of a burger restaurant which he enjoys almost more than anything else. He is the husband of Linda. He is father to Tina, Gene, and Louise. He is 47 years old. * Linda Belcher (voiced by John Roberts) – Linda will always help Bob. She likes doing new things. She is 45 years old. * Tina Belcher (voiced by Dan Mintz) – She is the oldest Belcher child. She works part-time at the restaurant and is often the voice of reason among the Belcher children. She is beginning to enter adulthood. She claims to have a complicated relationship with zombies. Tina is 15 years old beginning in season 2. Tina sounds like a man. * Gene Belcher (voiced by Eugene Mirman) – The only son of the family. He is enthusiastic about almost everything. He enjoys playing his keyboard. He wants to be a famous musician. He often promotes the restaurant by wearing a burger costume. Gene is 11 years old. * Louise Belcher (voiced by Kristen Schaal) – The youngest of the Belcher siblings. She enjoys playing jokes on people she thinks are stupid. She will exploit people if there is anything to be gained. She has an offbeat sense of humor and picks locks as a hobby. Louise is 9 years old. ===Pesto family=== * Jimmy Pesto (voiced by Jay Johnston) – He is the rival of Bob. Jimmy owns the Italian restaurant across the street from Bob's. * Ollie and Andy Pesto (voiced by Sarah Silverman and Laura Silverman) – Jimmy Pesto's twin sons. They are very childish and care for each other a lot. They are good friends with Louise and her classmates. * Jimmy Pesto Jr. (voiced by H. Jon Benjamin) – Jimmy Pesto's son. Unlike his father, Jimmy Jr. is not against the Belcher family. He and Tina are classmates. Tina would like to date Jimmy Jr. ===Recurring (minor) characters=== * Mort (voiced by Andy Kindler) – The owner of the funeral home next to the restaurant. A little odd, he is good friends with Bob and Teddy. * Teddy (voiced by Larry Murphy) – A regular customer and friend of the family. A blue-collar type, he tells many stories about his life which annoys Bob mostly. He is 49 years old. * Mr. Frond (voiced by David Herman) – The School Counselor of Wagstaff School where Louise, Gene and Tina attend. Bob describes him as a \"tall drink of annoying\" and he has stuffed animals that he talks to as if they were real. * Hugo (voiced by Sam Seder) – A health inspector who used to date Linda but got jilted by her for Bob, a fact that causes him no end of frustration, which he takes out on Bob any chance he gets. * Ron (voiced by Ron Lynch) – Hugo's assistant for health inspecting. Often quiet, he is more than willing to point out Hugo's malpractices. * Mr. Calvin Fischoeder (voiced by Kevin Kline) – Calvin Fischoeder (pronounced \"Fish- odor\") is an eccentric local businessman (who dresses in a white suit with a white eye-patch) and Bob's landlord. He owns or has a stake in just about everything down on the harbor (and many things in town). He likes Bob despite Bob always being late with his rent (partially because Bob knows a legendary burger recipe that he greatly enjoys). Louise describes him as being \"one white cat away from being a supervillain\". * Officer Julia (voiced by Jerry Minor) – a local African-American police officer. She acts tough with people she arrests. She appears mostly with Officer Cliffany. * Officer Cliffany (voiced by Sam Seder) – A local tall, androgynous, and overweight police officer. She works frequently with Officer Julia whenever there is a case in town. * Jocelyn (John Roberts) \\- Tina's 15-16 year old other 10th grade classmate. * Tamar \"Tammy Larsen\" Larson \\- Tina's bad friend. * Courtney Wheeler - 11-12 year old 6th grade student. * Millie Frock - 6-7 year old 1st grade student who is Louise's wacko friend. ==Voice cast== Main cast members Main cast members Main cast members Main cast members Main cast members H. Jon Benjamin (Bob Belcher) John Roberts (Linda Belcher) Dan Mintz (Tina Belcher) Eugene Mirman (Gene Belcher) Kristen Schaal (Louise Belcher) ==Episodes== ==Broadcast == *TVOKids (Canada) *FOX (United States) *ATV (Turkey) *Zee Tamil (India) *ABC Me (Australia) *TVNZ (New Zealand) *KBS (South Korea) *Spacetoon (Indonesia) ==References== ==Other websites== * Official website Category:2011 American television series debuts Category:2010s American sitcoms Category:2020s American sitcoms Category:2010s American workplace television series Category:2010s American animated television series Category:2020s American animated television series Category:American workplace comedy television series Category:Television series by Disney Category:Adult animated television series Category:Television series about families Category:English-language television programs",
 "title": "Bob's Burgers"
}