{
 "id": "33141",
 "text": "Methodism, or the Methodist movement, is a group of Protestant denominations. The movement started in Britain in the 18th century and spread to the United States and the British Empire. Originally it was popular with workers, poor farmers, and slaves. Mr. John Wesley started Methodism. He was a priest of the Church of England. His brother Charles Wesley was a famous writer of Church music. There are many Christians that trace their roots to the Wesley brothers. Many Churches have the word Methodist as part of their name, but others do not. Some of the churches which came from the Wesley movement are Nazarenes, Churches of God, Pentecostals, Holiness, and the Salvation Army. Many of these groups do good things to help people in addition to telling them about salvation from their sins. They start hospitals and schools and work with homeless and poor people. ==What the name means== John and Charles Wesley, and some other students at Oxford University started a \"holy club\". They used some methods to grow in Christian faith. These were prayer, Bible study, observing the Lord's supper, and helping poor people and prisoners. Other students laughed at them for their devotion. They called them \"methodists\" because of their methods. The members of the club took the name for themselves. https://www.etymonline.com/word/Methodist#:~:text=With%20a%20capital%20M-%2C%20it%20refers%20to%20the,their%20methodical%20habits%20in%20study%20and%20religious%20life. ==Methodist Beliefs== Methodists differ from other denominations in some beliefs. They are usually Arminian in their teachings about salvation. This means that they teach that anyone can choose to believe in Jesus. This is because of God's grace in making Himself known to all.https://dukespace.lib.duke.edu/dspace/bitstream/handle/10161/7972/Introducing_Wesleyan_Tradition.pdf This is also called \"free will\" teaching. Methodists differ from Baptists because Methodists baptize both babies and adults. They differ from Catholics and other conservative groups by allowing women to be pastors. Methodists tend to accept those whose beliefs are not exactly the same as theirs on less important things. The most important Methodist beliefs are listed in the 25 Articles of Religion. http://www.crivoice.org/creed25.html They also use the sermons of John Wesley to define their faith. ==Methodist organization== Because they came from the Anglican Church, most Methodists are in churches that are connectional. That means the individual churches are joined with other Methodist churches and they have Bishops that lead them. However, between 2019 and 2024 many Methodist churches left the United Methodist Church and thousands of them became independent. Many others joined a new denomination, the Global Methodist Church. This separation was mainly about different understandings of the Bible and human sexuality. United Methodist News, Disaffiliations approved by annual conferences, UMnews.org, USA, viewed Oct. 30, 2023.Michael Gryboski, Over 5,000 UMC churches granted disaffiliation amid schism over homosexuality; 3,000 in 2023, christianpost.com, USA, June 10, 2023 A few of the more progressive churches left the UMC, but most of those leaving were traditional. They left so they could continue to keep their past beliefs. ==Related pages== *George Whitefield == References == ==Other websites== *United Methodist Church website *Global Methodist Church website *Free Methodist Church website",
 "title": "Methodism"
}