{
 "id": "331507",
 "text": "NYC 22 (formerly known as Rookies and then The 2-2) is a police drama that began airing on April 15, 2012, as a midseason replacement for CSI: Miami.CBS' Robert De Niro-Produced Rookie Cops Midseason Drama Gets Sunday 10 PM Slot | Deadline It aired on Sundays at 10:00 PM on CBS in the United States. On May 13, 2012, the series was cancelled by CBS. ==Plot== The series shows a diverse group of rookie New York Police Department officers, they patrol Upper Manhattan. ==Cast== * Adam Goldberg as Ray \"Lazarus\" Harper * Leelee Sobieski as Jennifer \"White House\" Perry * Stark Sands as Kenny McLaren * Judy Marte as Tonya Sanchez * Harold House Moore as Jayson \"Jackpot\" Toney * Felix Solis as Terry Howard * Tom Reed as Ahmad Khan * Terry Kinney as Daniel \"Yoda\" Dean ==Episodes== ===Ratings=== According to TV by the Numbers, following the first episode, \"The series premiere of NYC 22 drew just a 1.5 adults 18–49 rating at 10pm....That compares with a 2.1 rating average for new episodes of CSI: Miami since January, and a 1.7 for the significantly delayed finale last week.\" The same site's \"Renew-Cancel Index\", which analyzes the odds of shows being renewed or canceled by comparing them to the 18–49 ratings for all the scripted shows on the same network, scored the show with a 0.51 index rating (51% of CBS's scripted average) and categorized the show as \"certain to be canceled\". Four weeks later, on May 13, 2012, the series was canceled. Season Episodes Timeslot Original airing Rank Viewers (in millions) Season premiere Season finale TV season 1 13 Sunday 10pm/9c (April 15, 2012 – May 6, 2012) Saturday 8pm/7c (July 7, 2012 – August 11, 2012) April 15, 2012 August 11, 2012 2012 #55 8.77 ==International broadcast== Country Network(s) Series premiere Timeslot Sources CBS April 15, 2012 Sundays at 10:00 PM Global April 15, 2012 Sundays at 10:00 PM Corus Entertainment M6 ==References== ==Other websites== * Official website * NYC 22 at the Internet Movie Database Category:CBS network shows Category:American drama television series Category:Crime television series Category:Television series set in New York City Category:English-language television programs",
 "title": "NYC 22"
}