{
 "id": "331641",
 "text": "Great Slave Lake () is the second-largest lake in the Northwest Territories of Canada. It is the deepest lake in North America at 614m, and the ninth-largest lake in the world. It is long and wide. It covers . The lake shares its name with the Slavey First Nations. Towns on the lake include: Yellowknife, Hay River, Behchoko, Fort Resolution, Lutselk'e, Hay River Reserve, Dettah and N'Dilo. == History == North American Aboriginal Peoples were the first people to live around the lake. They built communities including Dettah, which still exists today. British fur trader Samuel Hearne explored the area in 1771 and crossed the frozen lake. He named it Lake Athapuscow. This was a misunderstanding of the name Athabaska. In 1897-1898, the American frontiersman Charles \"Buffalo\" Jones traveled to the Arctic Circle. In the 1930s, gold was discovered there, and the city of Yellowknife was founded. It became the capital of the Northwest Territories. In 1967, an all-season highway was built around the lake, originally an extension of the Mackenzie Highway but now known as Yellowknife Highway or Highway 3. On January 24, 1978, a Soviet Radar Ocean Reconnaissance Satellite, named Kosmos 954 fell from orbit and broke apart. The satellite had an on board nuclear reactor. Pieces of the nuclear core fell near the Great Slave Lake. 90% of the nuclear debris was recovered by a group called Operation Morning Light. They included people from both the United States and Canada. == Geography and natural history == The Hay, Slave and Taltson Rivers enter the lake. The Mackenzie River flows out. The western shore has forests, but the east shore and northern arm are tundra-like. The southern and eastern shores reach the edge of the Canadian Shield. The Great Slave Lake remains from a large post-glacial lake along with other lakes such as the Great Bear and Athabasca. The main western part of the lake is a bowl with a surface area of and a volume of . This main portion has a maximum depth of and a mean depth of . To the east, McLeod Bay () and Christie Bay () are much deeper, with a maximum recorded depth in Christie Bay of . There is the nesting site of a flock of Whooping Cranes south of Great Slave Lake, in a remote corner of Wood Buffalo National Park. ==Ice road== There is one ice road on Great Slave Lake. It connects Yellowknife to Dettah. ==Related pages== *List of lakes of Canada ==References== ==Further reading== * Canada. (1981). Sailing directions, Great Slave Lake and Mackenzie River. Ottawa: Dept. of Fisheries and Oceans. * Gibson, J. J., Prowse, T. D., & Peters, D. L. (2006). Partitioning impacts of climate and regulation on water level variability in Great Slave Lake. Journal of Hydrology. 329 (1), 196. * Hicks, F., Chen, X., & Andres, D. (1995). Effects of ice on the hydraulics of Mackenzie River at the outlet of Great Slave Lake, N.W.T.: A case study. Canadian Journal of Civil Engineering. Revue Canadienne De G̐ưenie Civil. 22 (1), 43. * Kasten, H. (2004). The captain's course secrets of Great Slave Lake. Edmonton: H. Kasten. * Jenness, R. (1963). Great Slave Lake fishing industry. Ottawa: Northern Co-ordination and Research Centre. Dept. of Northern Affairs and National Resources. * Keleher, J. J. (1972). Supplementary information regarding exploitation of Great Slave Lake salmonid community. Winnipeg: Fisheries Research Board, Freshwater Institute. * Mason, J. A. (1946). Notes on the Indians of the Great Slave Lake area. New Haven: Published for the Department of Anthropology, Yale University, by the Yale University Press. * Sirois, J., Fournier, M. A., & Kay, M. F. (1995). The colonial waterbirds of Great Slave Lake, Northwest Territories an annotated atlas. Ottawa, Ont: Canadian Wildlife Service. ==Other websites== *Great Slave Lake pictures from Picsearch.com Category:Geography of the Northwest Territories Category:Lakes of Canada",
 "title": "Great Slave Lake"
}