{
 "id": "331797",
 "text": "The Service d'exploitation de la formation aéronautique (SEFASEFA is a French acronym. SEFA stands for \"Service d'Exploitation de la Formation Aéronautique\".) was the French national flight school, in nine places in France and managed by the direction générale de l'aviation civile (DGAC). It merged with French Civil Aviation University the 1st of January 2011.Décret n° 2010-1552 du 15 décembre 2010 modifiant le décret n° 2007-651 du 30 avril 2007 portant statut de l'École nationale de l'aviation civile - Version consolidée au 01 janvier 2011Fusion de l’École Nationale de l’Aviation Civile (ENAC) et du Service d’Exploitation de la Formation Aéronautique (SEFA) == History == === 1936 - 1946 === SEFA is a direct descendant of a long tradition of state involvement in helping to light aviation. By 1936, the Popular Front creates the \"sections d’aviation populaire\" (SAP), in order to democratize the flight training for young people and then to train more crew for the French military aviation. In 1946, the \"service de l’aviation légère et sportive\" (SALS) is created, which purpose is essentially to provide available aircraft and instructors for flying clubs. === 1946 - 1976 === In 1955, SALS becomes the \"service de la formation aéronautique et des sports aériens\" (SFASA), in 1959 the \"service de la formation aéronautique, du travail aérien et des transports\" (SFATAT), in 1964 it is renamed the \"service de la formation aéronautique\" (SFA) and finally the \"service de la formation aéronautique et du contrôle technique\" (SFACT) in 1976.Rapport annuel 2003 SFACT These designations reflect the successive changes in the organization of the civil aviation administration, but also the direct involvement of the State, in flight training. Thus \"national centers\" will be created, in 1945, for the gliding activities (Challes-les-Eaux, Beynes, Pont-Saint-Vincent, etc.), and then for the flight in piston aircraft (Carcassonne in 1945, Saint-Yan in 1947), and even skydiving (Biscarosse in 1953). === 1976 - 1996 === Over the years, the French civil aviation administration gradually withdraw from its activities in the field of gliding and skydiving. In 1959, the center of Saint-Yan welcomes the first course of airline pilot students (EPL, Elève Pilote de ligne, in English airline pilot student), ushering in a new mission of the SEFA : the training of airline pilots. The national centers were attached to the service of the civil aviation administration in charge of training. The creation of a single management structure was needed. Thus was created the SEFA in 1993, bringing together under one organization all the necessary needs to implement the tasks entrusted by the DGAC. The direction of the SEFA moved to Muret in 1996, bringing together all central services previously scattered between Saint-Cyr-l'École and Paris. === 1996 - 2011 === Finally, on the 1st of January 2011, the SEFA is merged with the French Civil Aviation University in order to create the biggest European aviation school.La France dispose de la plus grande école d’aviation européenne All the SEFA activities are now providing under the only acronym ENAC.Patrick GANDIL - Directeur général de l’aviation civile - Responsable du programme n° 611 : Formation aéronautique == References == == Bibliography == * Ariane Gilotte, Jean-Philippe Husson and Cyril Lazerge, 50 ans d'Énac au service de l'aviation, Édition S.E.E.P.P, 1999 == Other websites == * Official Category:Aviation in France Category:Schools in France Category:1993 establishments in France",
 "title": "Service d'exploitation de la formation aéronautique"
}