{
 "id": "331826",
 "text": "The City of Calgary has a number of bridges, spanning the two main rivers that cross the city, Bow River and Elbow River, as well as some other geographical and physical features. ==Crossings== ===Bow River (west of downtown)=== The Bow River enters the city from west, winds around downtown, then runs south. From west to south, the following structures cross the river. Bridge Carries Length Built Coordinates Image Remarks Bearspaw Dam Utility 1954 Dam on Calgary's west limits, east of Bearspaw; built in 1954, owned and maintained by TransAlta Stoney Trail Bridge Stoney Trail 476 m Between Trans Canada Highway and Tuscany; lower deck is pedestrian, connecting the south and north Bow River pathways 85 St SW Bridge 85 Street SW Between Bowness and Scenic Acres Bowness Pedestrian Bridge Pathway Connects Bow River pathways between Bowmont Park Natural Area and Bowness Bowness Railway Bridge Canadian Pacific Railway John Hextall Bridge Pedestrian/Cycle 1911 Between Bowness and Montgomery; parallels Shouldice Bridge and is used for pedestrian and bicycle traffic only; originally carried a streetcar. Shouldice Bridge Bowness Road NW Between Bowness, Shouldice Park and Montgomery TCH Bridge Trans-Canada Highway Between Sarcee Trail and Montgomery Edworthy Park Bridge Pedestrian Pedestrian alley in Edworthy Park, between the Bow River pathways Crowchild Trail Bridge Crowchild Trail Between Shaganappi and Kensington, lower pedestrian deck connects pathways on each side of the river 14 St SW Bridge 14 St SW Between Kensington and Sunalta ===Bow River (downtown)=== Bridge Carries Length Built Coordinates Image Remarks Louise Bridge 10 Street SW 172 m 1921 Connects Downtown West End with Memorial Drive and Kensington; named after Louise Cushing, daughter of William Henry Cushing, Calgary mayor from 1900 to 1901 Sunnyside C-Train Bridge C-Train Route 201 and pedestrian (lower deck) Between Sunnyside and 8 Street SW stations; lower deck is a pedestrian walkway Peace Bridge Pedestrian 125 m 2011 Between Downtown and Sunnyside Prince's Island Causeway Pedestrian and service road Connects Eau Claire Park pathway with west part of Prince's Island Park, provides access to Enmax stage Prince's Island Bridge Pedestrian Connects Prince's Island Park with Sunnyside, also crosses Memorial Drive Jaipur Bridge Pedestrian Connects Prince's Island Park with Eau Claire Prince's Island Bridge East End Pedestrian pathway Connects eastern Prince's Island Park with Eau Claire and Chinatown Centre Street Bridge Centre Street 178 m 1916 Connects Downtown Calgary to Crescent Heights; lower deck connects Chinatown to Memorial Drive 4th Avenue Flyover 4th Avenue SE 1972 Connects Memorial Drive to Downtown Calgary 5th Avenue Flyover 5th Avenue SE Connects Downtown Calgary to Memorial Drive, Crescent Heights and Bridgeland. Langevin Bridge Edmonton Trail 1910 Connects Bridgeland to Downtown Calgary; south terminus of Edmonton Trail; named for Sir Hector Langevin C-Train SE/Bridgeland Bridge C-Train Route 202 Between 3 Street SE and Bridgeland/Memorial stations St. Patrick's Island Bridge Bow River pathways Connects Downtown East Village, Fort Calgary and Bow River pathways with St Patrick Island and Calgary Zoo; new project to cross to Bridgeland Baines Bridge Zoo Road Connects Calgary Zoo and Bridgeland Zoo Bridge (W) Calgary Zoo pathway Connects main Calgary Zoo exhibits with the Prehistoric Park Zoo Bridge (E) Calgary Zoo pathway Connects main Calgary Zoo exhibits with the Canadian Wilds St. Georges Zoo Bridge 12 St SE Connects Calgary Zoo with Inglewood Canadian Pacific Bridge (Nose Creek) Canadian Pacific Railway Railroad bridge ===Bow River (south of downtown)=== Bridge Carries Length Built Coordinates Image Remarks Cushing Bridge Blackfoot Trail SE / International Avenue Connects Inglewood with Forest Lawn; named after William Henry Cushing, Calgary mayor from 1900 to 1901 Canadian Pacific Bridge (Alyth) Canadian Pacific Railway Railroad bridge, connects main tracks with CPR Alyth Yard Bonnybrook Bridge Ogden Road SE Connects Alyth with Foothills Industrial Park Calf Robe Bridge Deerfoot Trail Connects Deerfoot trail from Glenmore Trail to Paigan Road; named after Ben Calf Robe, a Siksika chief Canadian National Bridge CN Railway Connects Canadian Pacific Railway to Canadian National Railway Graves Bridge Glenmore Trail Connects Alyth to Riverbend and Ogden, leads to Highway 8 east; twinned in 2009 Southland Pedestrian Bridge Pedestrian Connects Southland Drive and Acadia to Riverbend Lafarge Bridge Road Connects Lafarge cement plant to Douglasglen Ivor Strong Bridge Deerfoot Trail Connects Maple Ridge to Douglasdale at the Anderson Road alignment; named after John Ivor Strong, Chief Commissioner for the City of Calgary from 1965 to 1971 Douglasdale Park Pedestrian Bridge Pedestrian Connects Douglasdale Park to Queensland McKenzie Pedestrian Bridge Pedestrian Connects Deer Ridge with McKenzie Lake Marquis de Lorne Bridge Highway 22X 2009 Connects Marquis de Lorne Trail m from Sundance and Chaparral across Fish Creek Provincial Park to McKenzie Lake and Cranston Dunbow Road Bridge Highway 2 Connects Deerfoot Trail to Macleod Trail south of Calgary, between Auburn Bay and Heritage Pointe ===Elbow River=== The Elbow River enters the city in the southwest, then turns north and merges into the Bow River immediately east of downtown. From west to north, the following structures cross the river. Bridge Carries Length Built Coordinates Image Remarks Highway 8 Bridge Highway 8 Highway 8 named Glenmore Trail east of this point Weaselhead Road Bridge Weasel Head Road Bridge for road traffic, inside the limits of the Tsuu T'ina Nation reserve Weaselhead Pedestrian Bridge Pedestrian Bridge just west of Weaslehead Natural Area, inside the limits of Tsuu T'ina Nation reserve Glenmore Trail bridge Glenmore Trail Crosses the Glenmore Reservoir Glenmore Dam Pedestrian, maintenance road 1933 Dam, created Glenmore Reservoir, allows pedestrian access and maintenance vehicles (no public vehicle access) along Glenmore Bridge Rd. Altadore Park Bridge Pedestrian Connects Altadore Park (in Altadore) and Riverdale Park (in Britannia) Elbow Park Britannia Pedestrian Bridge Pedestrian Connects Elbow River bike and pathway; between Elbow Park and Britannia Elbow Drive Bridge Elbow Drive Connects the neighbourhoods of Elbow Park and Britannia Elbow Park Roxboro Pedestrian Bridge Pedestrian Connects Elbow River bike and pathway; between Elbow Park and Roxboro 4 St SW Bridge 4 Street SW Connects the neighbourhoods of Mission and Roxboro Scollen Bridge 25 Avenue SW Connects the neighbourhoods of Mission and Erlton 21 Ave SW Talisman Pedestrian Bridge Pedestrian Between 21 Ave SW and the Talisman Centre grounds 19 Ave SW Talisman Pedestrian Bridge Pedestrian Between 19 Ave SW (behind St. Mary's Cathedral and the Talisman Centre grounds Pattison Bridge Macleod Trail South Between Mission and Talisman Centre, named for John George Pattison, Victoria Cross recipient of the 50th Battalion, CEF.\"Soldier led Vimy Charge\" Retrieved 29 March 2009 Victoria Bridge Macleod Trail North Between Mission and Talisman Centre Macleod Train Bridge C-Train Between Mission and Talisman Centre Stampede Trail Bridge Stampede Trail SE Provides entry into the Calgary Stampede grounds and access to the Stampede Grandstand Stampede Ground Bridge maintenance road Provides acceess Calgary Stampede ground buildings Stampede Ground Bridge maintenance road Provides acceess Calgary Stampede ground buildings Saddledome Trail Bridge Pedestrian Provides entry into the Calgary Stampede grounds and access to the Scotiabank Saddledome Agriculture Trail Bridge Agriculture Trail SE Service road from Calgary Stampede grounds Macdonald Avenue Bridge Macdonald Avenue SE Connects the neighbourhoods of Victoria Park and Ramsay Canadian Pacific Rail Bridge (Inglewood) Canadian Pacific Railway Connects the Canadian Pacific Railway downtown yard with the CPR Alyth Yard Inglewood Bridge 9 Avenue SE Connects Downtown East Village to Inglewood ===Fish Creek=== Fish Creek flows from west to east in the south part of the city, through the Fish Creek Provincial Park. It merges into the Bow River in the southeast quadrant of the city. Bridge Carries Length Built Coordinates Image Remarks 37 St SW Bridge 37 St SW Connects the neighbourhoods of Woodbine and Evergreen Fish Creek Pedestrian Bridge no. 1 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 2 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 3 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 4 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 5 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 6 Pathway Connects pathways in the Fish Creek Provincial Park Fish Creek Pedestrian Bridge no. 7 Pathway Connects pathways in the Fish Creek Provincial Park CPR Bridge (Fish Creek) Canadian Pacific Railway Also carriers C-Train tracks Macleod Trail Bridge Macleod Trail Connects the neighbourhoods of Canyon Meadows and Lake Bonavista to Shawnee Slopes and Midnapore Bow Bottom Bridge Bow Bottom Trail SW Connects the neighbourhoods of Deer Run and Parkland to Sikome Lake and Fish Creek Provincial Park ==Related pages== * List of bridges in Canada ==References== ==Other websites== Category:Bridges in Canada Category:Lists of bridges",
 "title": "List of bridges in Calgary"
}