{
 "id": "331836",
 "text": "This is a list of bridges in Montreal. ==Crossings== Key: Communities linked by individual bridges ===Spanning the Saint Lawrence River and Saint Lawrence Seaway=== The construction of the Saint Lawrence Seaway in the 1950s required large changes for all bridges that existed at the time. Those are not reflected in the table below. Span Picture First span built Current span built Communities linked Carries Name origin Coordinates Saint-Laurent Railway Bridge 1886 1910 (M) Borough of LaSalle Canadian Pacific Railway (CPR) Réseau de transport métropolitain (RTM) Delson-Candiac (commuter train) Saint Lawrence River (O) Kahnawake Mohawk Reserve Honoré Mercier Bridge 1934, 1963 (M) Borough of LaSalle Route 138 Honoré Mercier (1840–1894), Premier of Quebec (O) Kahnawake Mohawk Reserve Champlain Bridge Ice Structure 1964 (M) Borough of Verdun Route Verte 1 and 2 Samuel de Champlain (c. 1580–1635), founder of Quebec City (O) St. Lawrence Seaway levee Champlain Bridge 1962 2019 (M) Borough of Verdun Autoroutes 10, 15, and 20 (I) Île des Sœurs (exit) (O) Brossard Victoria Bridge 1860 1898 (M) Borough of Le Sud-Ouest Route 112 Canadian National Railway (CN) RTM Mont-Saint-Hilaire commuter train Via Rail and Amtrak passenger trains Queen Victoria of the United Kingdom (1819–1901) (O) Saint-Lambert Pont de la Concorde and Pont des Îles 1965 (M) Borough of Ville-Marie Pierre-Dupuy Avenue and Route Verte 1 and 2 Reference to Montreal's motto, Concordia salus (Pont de la Concorde) (Pont des Îles) (O) Île Sainte-Hélène and Île Notre-Dame (Parc Jean-Drapeau), borough of Ville- Marie, Montreal Montreal Metro Tunnel 1966 (M) Borough of Ville-Marie (Berri- UQAM station) Line 4 Yellow (I) Île Sainte-Hélène (Jean-Drapeau station) and Île Notre-Dame (O) Longueuil, borough of Vieux-Longueuil (Longueuil–Université-de-Sherbrooke station) Jacques Cartier Bridge 1930 (M) Borough of Ville-Marie Route 134 Pedestrians and bicycles Jacques Cartier (1491–1557), French explorer (I) Île Sainte-Hélène (exit) and Île Notre-Dame (O) Longueuil, borough of Vieux-Longueuil Louis-Hippolyte Lafontaine Bridge–Tunnel 1967 (M) Borough of Mercier–Hochelaga-Maisonneuve Autoroute 25/Trans-Canada Highway Louis-Hippolyte Lafontaine (1807–1864), Prime Minister of the United Province of Canada (I) Île Charron (Îles de Boucherville) (exit) (O) Longueuil, borough of Vieux-Longueuil ===Spanning the Rivière des Prairies=== Span Picture First span built Current span built Communities linked Carries Name origin Coordinates Le Gardeur Bridge 1939 (widened 1975) (M) Borough of Rivière-des-Prairies–Pointe-aux-Trembles Route 138 and Route Verte 5 Pierre Le Gardeur de Repentigny (1605–1648), French lord (I) Île Bourdon (O) Repentigny Laurier Railway Bridge 1904 (M) Borough of Rivière-des-Prairies–Pointe-aux-Trembles CN Via Rail Wilfrid Laurier (1841–1919), Prime Minister of Canada (I) Île Bourdon (O) Charlemagne Charles de Gaulle Bridge 1965 (M) Borough of Rivière-des-Prairies–Pointe-aux- Trembles Autoroute 40 Charles de Gaulle (1890–1970), President of France (O) Charlemagne Olivier-Charbonneau Bridge 2011 (M) Borough of Rivière-des- Prairies–Pointe-aux-Trembles Autoroute 25 Olivier Charbonneau (c.1613-1687), first European settler of Île Jésus. (O) Laval (Saint-François) Pie IX Bridge 1937 1967 (M) Borough of Montreal North Route 125 Pope Pius IX (1792–1878) (O) Laval (Saint-Vincent-de-Paul) Centrale de la Rivière des Prairies 1930 [Hydro-Québec] (M) Borough of Ahuntsic- Cartierville Hydro-Québec Rivière des Prairies (I) Île de la Visitation and Île du Cheval de Terre (O) Laval (Duvernay) Papineau-Leblanc Bridge 1969 (M) Borough of Ahuntsic- Cartierville Autoroute 19 Louis-Joseph Papineau (1786–1871), leader of the Patriote movement Alpha Leblanc (1908–1962), local landowner (I) Île de la Visitation (O) Laval (Duvernay) Viau Bridge (Ahuntsic Bridge) 1847 1962 (widened 1993) (M) Borough of Ahuntsic-Cartierville Route 335 Ahuntsic, Huron boy who drowned in 1625 The origin of the name Viau is uncertain. (O) Laval (Pont-Viau) Montreal Metro Tunnel 2007 (M) Borough of Ahuntsic-Cartierville (Henri-Bourassa station) Line 2 Orange (O) Laval (Cartier station) Bordeaux Railway Bridge 1876 (M) Borough of Ahuntsic- Cartierville CPR RTM Saint-Jerome commuter train Quebec Gatineau Railway Route Verte 1 and 2 Bordeaux, former town (I) Île PerryÎle Perry (O) Laval (Laval- des-Rapides) Médéric Martin Bridge 1958 (widened 1991) (M) Borough of Ahuntsic-Cartierville Autoroute 15/Trans-Canada Highway Médéric Martin (1869–1946), Mayor of Montreal (O) Laval (Laval-des-Rapides) Lachapelle Bridge (Cartierville Bridge) 1848 1930, 1975 The latter bridge collapsed in the 1880s and was never rebuilt. The latter bridge collapsed in the 1880s and was never rebuilt. (M) Borough of Ahuntsic-Cartierville Route 117 Pascal Persillier-Lachapelle, builder of the first bridge (O) Laval (Chomedey) Louis Bisson Bridge 1975 (M) Borough of Pierrefonds-Roxboro Autoroute 13 Louis Bisson (1909–1997), Canadian aviator (O) Laval (Chomedey / Sainte-Dorothée) Île Bigras railway crossing 1916 (M) Borough of Pierrefonds- Roxboro CN Owned by the RTM and mainly used by the Deux-Montagnes commuter train (no official name) (I) (Île Bigras) Île-Bigras commuter train station (O) Laval (Sainte-Dorothée) Jacques Bizard Bridge 1893 1966 (M) Sainte-Geneviève, Montreal, borough of L'Île- Bizard–Sainte-Geneviève Boulevard Jacques Bizard Jacques Bizard (1642–1692), local seigneur (O) Île Bizard (Montreal, borough of L'Île-Bizard–Sainte- Geneviève) ===Spanning the Lake of Two Mountains and the Ottawa River East Channel=== All three spans across the Ottawa River East Channel are twinned by another span, built simultaneously, across the West Channel. Span Picture First span built Current span built Communities linked Carries Name origin Coordinates Île aux Tourtes Bridge 1966 (M) Senneville Autoroute 40/Trans-Canada Highway Île aux Tourtes (literally, Wild Pigeon island)Fiche descriptive (Across Lake of Two Mountains) (I) Île Girwood, Île aux Tourtes (O) Vaudreuil- Dorion Canadian Pacific Rail Bridge 1893 (M) Sainte-Anne-de-Bellevue CPR (RTM Vaudreuil-Hudson commuter train) (no official names) (Across Canal Sainte-Anne) (I) Île Bellevue (O) Île Perrot Canadian National Rail Bridge 1854 (M) Sainte-Anne-de-Bellevue CN Via Rail Canada passenger trains to Ottawa/Toronto (Across Canal Sainte-Anne) (I) Île Bellevue (O) Île Perrot Galipeault Bridge 1925 1991, 2009 (M) Sainte-Anne-de-Bellevue Autoroute 20 and Route Verte 5 Antonin Galipeault (1879–1971), Quebec politician (Across Canal Sainte-Anne) (I) Île Bellevue (O) Île Perrot ==Related pages== * List of bridges in Canada ==Notes== :The section of Honoré-Mercier bridge spanning over the St. Lawrence Seaway was rebuilt to seaway standards in the 1950s. The bridge was twinned by an identical one, on the downriver side, which opened in 1963. :The Champlain Bridge Ice Structure, known in French as \"l'Estacade Champlain,\" was built to control ice floes coming from the Laprairie Basin. :At the north end of Champlain Bridge, two spans, one north- south (aut. 15 and 20) and one east-west (aut. 10) connect Île des Sœurs to I. of Montreal. These two spans, called Pont Île-des-Sœurs and Pont Clément, are part of the Champlain Bridge complex. :Victoria Bridge was built as a one- track tubular bridge which opened in 1860. It was the first bridge to cross the St. Lawrence River, and the longest bridge in the world. It was rebuilt as a two-track truss bridge in 1898. The South Y approach was rebuilt around the Saint Lambert locks of the St. Lawrence Seaway in 1961. :Pont de la Concorde (Concorde Bridge) and Pont des Îles (\"Bridge of the Islands\") were built for Expo 67. Pont de la Concorde connects Montreal Island to Saint Helen's Island, while Pont des Îles connects Saint Helen's Island to Notre-Dame Island. :Jacques-Cartier Bridge was originally named Harbour Bridge/Pont du Havre, and renamed after Jacques Cartier in 1934 (400th anniversary of Cartier's first voyage). The section over the St. Lawrence Seaway was lifted to a new height in 1962. :The Louis-Hippolyte Lafontaine complex consists of a tunnel from Montreal to Île Charron and a bridge from Île Charron to the South Shore. :Construction of the Highway 25 Bridge started in early 2008 and was finished in May 2011. It is a toll bridge. :The Rivière des Prairies hydro complex is a set of three dams: one from Montreal I. to Île de la Visitation (west of the Papineau-Leblanc Bridge), which includes a footpath; another between Île de la Visitation and Île du Cheval de Terre; and the longest span between Île du Cheval-de-Terre and Île Jésus. Île de la Visitation is joined to Montreal by another two small bridges: a road bridge, which also serves as a dam (historically, a water mill) and a footbridge. :The railway crossing at Île Bigras consists of two spans, one north and one south of Île Bigras. :A structure known as \"Île Bray Bridge\" was abandoned while still under construction in favor of Île aux Tourtes Bridge. :Galipeault Bridge was first built in 1925 and doubled in 1964. Both spans have been replaced since. Taschereau Bridge, which was part of the same project, spans the West Channel along the same highway. == References == Montreal Island of Montreal",
 "title": "List of bridges to the Island of Montreal"
}