{
 "id": "331829",
 "text": "Joan Crawford (born Lucille Fay LeSueur; March 23, 190? was an American actress. Crawford usually played as women who worked hard. Her characters were usually about women who went from being poor to becoming rich, or \"rags-to- riches\". Her characters were popular for Depression-era people. They were also popular with women. Crawford became one of Hollywood's most important actors. She was also one of the highest paid woman in the United States. However, her movies started to lose money. By the 1930s, she was called \"box office poison\" because her movies lost so much money. She won the 1945 Best Actress Academy Award for Mildred Pierce. In 1999, she was voted to be the tenth-greatest female star in the history of American movies by the American Film Institute. ==Biography== Crawford was born in San Antonio, Texas. Her real name was Lucille Fay LeSueur. She began her career as a dancer. She moved to Hollywood in 1925. She worked in silent movies. She played hard-working young women who wanted love, romance, and glamor. She made \"talkies\", too. She was given the name \"Joan Crawford\" from a magazine contest sponsored by MGM.bio: Joan Crawford Crawford won the Best Actress Academy Award for Mildred Pierce in 1945. She made many more movies, but retired in 1970. She died in New York City of a heart attack. Crawford won success with Letty Lynton (1932). The film is mostly remembered because of the \"Letty Lynton dress\". This dress was designed by Adrian. It was a white cotton organdy gown with large ruffled sleeves, puffed at the shoulder. It was with this gown that Crawford's broad shoulders began to be accentuated by costume. Macy's copied the dress in 1932, and it sold over 500,000 replicas in the United States.Leese 1991, p. 18 Crawford was married four times. First to actor Douglas Fairbanks, Jr. and then to actor Franchot Tone. Her third husband was actor Phillip Terry, and her fourth and last husband was Pepsi executive Alfred Steele. Crawford became active in the Pepsi-Cola company after Steele's death of a heart attack. Crawford adopted four children: Christina, Christopher, and \"the twins\" Cynthia and Cathy. Christina wrote a bestselling \"tell-all\" biography called Mommie Dearest. This book alleged that Crawford abused her children. It was made into a movie also called Mommie Dearest. ==Autobiographies== * * ==Notes== ==References== ==Further reading== * * ==Other websites== * Official Website * * * * * * Excerpt of March 2008 biography, VanityFair.com * * Joan Crawford profile, Virtual-History.com * Joan Crawford awards at Brandeis University * Crawford, Joan (1906–1977) in the Encyclopedia of Oklahoma History and Culture Category:1900s births Category:1977 deaths Category:Christian Scientists Category:Actors from San Antonio, Texas Category:American movie actors Category:American radio actors Category:American silent movie actors Category:American television actors Category:Deaths from myocardial infarction",
 "title": "Joan Crawford"
}