{
 "id": "331928",
 "text": "Gladys Louise Smith (April 8, 1892 – May 29, 1979), (known professionally as Mary Pickford) was a Canadian silent movie actress. She was born in Toronto, Ontario, Canada. She won the Academy Award for Best Actress for her role in Coquette. She was married to actor Charles \"Buddy\" Rogers. Pickford was co- founder of United Artists. She was one of the original 36 founders of the Academy of Motion Picture Arts and Sciences. She married silent movie star Douglas Fairbanks. They lived in a Hollywood home called Pickfair. She was called \"America's Sweetheart\" during the silent film era, and is on the list of the AFI's 100 Years...100 Stars. She is put as the 24th-top female star from the Classical Hollywood Cinema era. == References == === Citations === === Sources === * Total pages: 680. == Further reading == * * * * * Gladys goes to Hollywood at 100 Canadian Heroines: Famous and Forgotten Faces, by Merna Forster, via Google Books, pp. 204 sq. * * * Mary Pickford at the Women Film Pioneers Project * About Mary Pickford, from the Mary Pickford Foundation website * Mary Pickford CBC Radio interview May 25, 1959 * Mary Pickford at the Encyclopædia Britannica * Footage of Mary Pickford with Charlie Chaplin and Douglas Fairbanks in 1919 * Mary Pickford at Virtual History * Mary Pickford–Buddy Rogers correspondence, 1943–1976, held by the Billy Rose Theatre Division, New York Public Library for the Performing Arts * Mary Pickford scrapbook, 1915–1917, held by the Billy Rose Theatre Division, New York Public Library for the Performing Arts * Mary Pickford papers, Margaret Herrick Library, Academy of Motion Picture Arts and Sciences * Mary Pickford – Whose Real Name is Gladys Smith from Current Opinion Magazine, June, 1918 Category:1892 births Category:1979 deaths Category:Deaths from cerebral hemorrhage Category:Canadian movie actors Category:American movie actors Category:Actors from Toronto Category:Silent movie actors Category:Best Actress Academy Award winners",
 "title": "Mary Pickford"
}