{
 "id": "332033",
 "text": "is a prefecture of Japan. It is part of the Tōhoku region on the island of Honshu.Nussbaum, Louis-Frédéric. (2005). \"Yamagata prefecture\" in Japan Encyclopedia, pp. 1038-1039; \"Tōhoku\" at p. 970. Its capital is Yamagata.Nussbaum, \"Yamagata\" at p. 1038. == History == The aboriginal people once lived in the area now known as Yamagata. Yamagata was part of Dewa Province until the Meiji Restoration.Nussbaum, \"Provinces and prefectures\" at p. 780. This area was called \"Yamagata\" for the first time in the Heian period. However, different characters were used to write it. The reason why this area was called Yamagata is not clear. In the Nanboku-chō period, Yamagata was written in the same kanji that it is today. == Geography == Yamagata Prefecture is located in the southwest corner of Tōhoku. It faces the Sea of Japan. It borders Niigata Prefecture and Fukushima Prefecture on the south, Miyagi Prefecture on the east, and Akita Prefecture on the north. The Mogami and the Zaou are the two major rivers in the prefecture. ===Cities=== Thirteen cities are located in Yamagata Prefecture: *Higashine *Kaminoyama *Murayama *Nagai *Nan'yō *Obanazawa *Sagae *Sakata *Shinjō *Tendō *Tsuruoka *Yamagata (capital) *Yonezawa ===National parks=== National parks cover about 17% of the total land area of the prefecture.Japan Ministry of the Environment, \"General overview of area figures for Natural Parks by prefecture\"; retrieved 2012-3-13. They include: * Bandai-Asahi National ParkJapan Ministry of the Environment, \"Bandai-Asahi National Park\" retrieved 2012-3-19. ==Shrines and temples== Ōmonoimia jinja is the main Shinto shrine (ichinomiya) in the prefecture.\"Nationwide List of Ichinomiya,\" p. 1 ; retrieved 2012-3-13. ==Economy== Yamagata is a farming area. It grows the most cherries and pears in the country. Over 70 percent of cherries in Japan are grown in Yamagata. Growing apples is important around the city of Yonezawa. The safflower is a symbol of Yamagata Prefecture. The number of farms growing safflower have steadily decreased since the 18th century. Yonezawa beef is bred in Yonezawa city. It is one of the most famous varieties of beef in Japan. Yonezawa is also known for its soba noodles. Shogi (Japanese chess) pieces are made in the city of Tendo. The pieces are carved from wood. ==Festivals== Hanagasa festival has been held since 1963 and is one of the major festivals in the Tohoku region. At the festival, the dancers dance with \"Hanagasa\" which is a hat decorated with red flowers.http://www.jnto.go.jp/eng/location/spot/festival/yamagatahanagasa.html Uesugi snow lantern festival is held on the second weekend of February. The candles in more than 300 snow lanterns and 3,000 snow lamps are lit up. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan *Montedio Yamagata ==References== == Other websites == *http://www.pref.yamagata.jp/ou/shokokanko/110012/kokusai/english/eindex.html ; *Weather in Yamagata City *Yamagata Museum of Art *Yamagata International Documentary Film Festival * Japan Guide",
 "title": "Yamagata Prefecture"
}