{
 "id": "332152",
 "text": "Stephen L. \"Steve\" Reeves (21 January 1926 - 1 May 2000) was an American professional bodybuilder and actor. He was born in Glasgow, Montana. He moved to California with his mother at age 10. He trained as a bodybuilder. He joined the US Army and served in the Pacific during World War II. After the war, he pursued bodybuilding. In 1946, he won the title of Mr. Pacific Coast. Within the next four years he won the world's most famous titles, including Mr. America, Mr. World, and Mr. Universe. He did a full-body workout. Reeves started acting. In 1954, he had some small parts in movies and was on television. In 1957, he made Hercules, a low budget movie based on the ancient Greek stories of the Golden Fleece. The movie was a great success. It made $5 million in the United States. From 1959 through 1964, Reeves starred in many low budget peplum movies. In 1963, he married Aline Czarzawicz. The couple retired to Southern California in 1969. He wrote an exercise guide, Building the Classic Physique the Natural Way. He bought a ranch and bred horses. Reeves died from lymphoma in Escondido, California in 2000. ==Movie list== * Athena (1954) Hollywood movie directed by Richard Thorpe * Jail Bait (1954) Hollywood movie directed by Ed Wood * Hercules (1957) (Le fatiche di Ercole / The Labors of Hercules) released in Italy in 1958, released in US in 1959 * Hercules Unchained (1959) (Ercole e la regina di Lidia / Hercules and the Queen of Lydia) released in US in 1960 * Goliath and the Barbarians (1959) (Il terrore dei barbari / Terror of the Barbarians) * The Giant of Marathon (1959) (La battaglia di Maratona / The Battle of Marathon) * The Last Days of Pompeii (1959) (Gli ultimi giorni di Pompei / The Last Days of Pompeii) * The White Warrior (1959) (Hadji Murad il Diavolo Bianco / Hadji Murad, The White Devil) directed by Riccardo Freda * Morgan, the Pirate (1960) (Morgan, il pirato) * The Thief of Baghdad (1961) (Il Ladro di Bagdad / The Thief of Baghdad) * The Trojan Horse (1961) (The Trojan War) * Duel of the Titans (1961) (Romolo e Remo / Romulus And Remus) * The Slave (1962) (Il Figlio di Spartaco / Son of Spartacus) * The Avenger (1962) (La leggenda di Enea / The Legend Of Aeneas) this was a sequel to \"The Trojan Horse\" (aka The Last Glory of Troy or War of the Trojans) * Sandokan the Great (1964) (Sandokan, the Tiger of Mompracem) directed by Umberto Lenzi * Sandokan, the Pirate of Malaysia (1964) aka The Pirates of Malaysia, aka Pirates of the Seven Seas; this was a sequel to Sandokan the Great, directed by Umberto Lenzi * A Long Ride from Hell (1967) (I Live for Your Death!) spaghetti western directed by Camillo Brazzoni, produced and co-written by Steve Reeves == Other websites == *An Interview with Steve Reeves by Roy Frumkes, from The Perfect Vision Magazine, Volume 6, Issue #22, July 1994 *How Steve Reeves Trained by John Grimek, Muscular Development November 1964 , account of how Reeves trained to prepare for the 1950 Mr. Universe competition at the York Barbell Club gym * * * *Feature Films: Hercules *Feature Films: Hercules Unchained *Steve Reeves Gallery Category:Actors from Montana Category:American movie actors Category:American television actors Category:American bodybuilders Category:1926 births Category:2000 deaths Category:People from Springfield, Oregon Category:Actors from Oregon",
 "title": "Steve Reeves"
}