{
 "id": "332145",
 "text": "was a Japanese political activist and assassin. He killed Inejirō Asanuma, the head of the Japanese Socialist Party (JCP). Socialist Leader is Slain in Tokyo; Asanuma, Who Led Agitation Against U.S. Treaty, Is Stabbed at a Rally,\" New York Times. October 12, 1960; retrieved 2012-3-15. On October 12, 1960, the killing was broadcast live by NHK television.TokyoReporter.com, \"Assassin of Inejiro Asanuma remembered by right-wing groups on 50-year anniversary,\" October 14, 2010; retrieved 2012-3-15. ==Assassin== Yamaguchi was an assassin because he killed a politically active man. His reasons for the murder were political. Yamaguchi was a member of a radical group. In 1960, he killed Inejiro Asanuma, a Socialist, when he was at a public meeting. Soon after, Yamaguchi killed himself in a juvenile center. He wrote on the wall of the room in which he hung himself. His last words were written using a paste made from tooth powder and water. \"Leftist's Killer Suicide in Japan; Young Rightist Who Stabbed Asanuma Hangs Himself in Detention Center,\" New York Times. November 3, 1960; \"Assassin's Apologies,\" Time. November 14, 1960; retrieved 2012-3-15. He wrote \"Seven lives for my country ...\" which was a reference to the last words of 14th century samurai Kusunoki Masashige. ===Legacy=== Yasushi Nagao captured the assassination in a dramatic photograph. The image won the 1960 World Press Photo award. 1960 World Press Photo by Yasushi Nagao; retrieved 2012-3-15. Nobel Prize-winning writer Kenzaburō Ōe based his book Seventeen on Yamaguchi.Remmick, David. \"Reading Japan,\" New Yorker. February 6, 1995; retrieved 2012-3-15. ==Related pages== * John Wilkes Booth * Gavrilo Princip * Lee Harvey Oswald * Osama bin Laden * Kim Gu ==References== ==Other websites== * 1960 World Press Photo by Yasushi Nagao Category:1943 births Category:1960 deaths Category:Anti-communists Category:People from Tokyo Category:Assassins Category:Japanese activists",
 "title": "Otoya Yamaguchi"
}