{
 "id": "33234",
 "text": "Subaru is a car company that is part of a larger Japanese company called Fuji Heavy Industries, who also makes other things like buses and airplanes. Subaru builds cars in Japan and also builds cars in the state of Indiana. Their cars are known for having all-wheel drive, which means that the engine drives all four wheels, instead of just the wheels in the front or in the back. They also have boxer engines, which means that the pistons and the cylinders in the engine fire left to right instead of up and down or at an angle. The name Subaru is a Japanese word for a star cluster in the sky named Pleiades, and the company logo has the stars in its picture in the same place as they are in the sky. ==History== Fuji Heavy Industries in 1954 built a car called the Subaru P-1. It was named by the person who was CEO, Kenji Kita. From 1954 to 1997 the company designed and built other vehicles including the tiny 360 (1958), the Sambar (1961), the 1000 (1965), the R2 (1969), the Leone (1971), the Domingo (1983), the Alcyone (1985), the Legacy (1989), the Impreza (1993), the Sambar EV electric van (1995), and the Forester (1997). ==Current models== Body style Model Current generation Current generation Current generation Vehicle description Image Name(s) Introduction ( year) Introduction ( year) Facelift Main markets Sports car BRZ 2012 2021 - Global Front-engine, rear-wheel drive two-door 2+2 sports car. Also sold by Toyota as the GR86. Hatchback Impreza 1992 2022 - Global Compact hatchback. Sedan Legacy 1989 2020 2022 North America Mid-size sedan, compact until 1994. Phased out in most markets, continued production in North America. WRX 2015 2021 - Global Compact sedan. Station wagon Levorg/ WRX Wagon 2014 2020 – Asia Mid-size station wagon based on the Impreza and WRX. Also known as the WRX Sportswagon in Australia and WRX GT in New Zealand since 2021. Levorg Layback 2023 2023 – Japan Compact crossover-styled station wagon based on Levorg. Outback 1994 2020 2022 Global Mid-size crossover-styled station wagon based on the Legacy. SUV/ crossover Ascent/ Evoltis 2019 2019 2022 North America Three-row mid-size crossover SUV, Subaru's largest SUV and the successor of the Tribeca. Crosstrek 2012 2023 – Global Subcompact crossover SUV based on the Impreza. Formerly called XV in most international markets between 2012 and 2022. Forester 1997 2024 – Global Compact crossover SUV. Rex 1972 (nameplate) 2022 (as a crossover) 2022 – Japan Subcompact crossover SUV sold exclusively in Japan. Rebadged A200 series Daihatsu Rocky. Solterra 2022 2022 – Global Battery electric compact crossover SUV. Jointly developed with Toyota. Also called Toyota bZ4X. MPV/ minivan Justy 1984 2016 2020 Japan Subcompact minivan with sliding doors only sold in Japan. Rebadged Daihatsu Thor. Kei vehicles Chiffon 2013 2019 2022 Japan Tall-height wagon kei car with rear sliding doors. Rebadged Daihatsu Tanto. Pleo Plus 2011 2017 – Japan Low-roof hatchback kei car with hinged rear doors. Rebadged Daihatsu Mira e:S. Sambar Truck 1961 2014 2022 Japan Cabover kei truck. Rebadged Daihatsu Hijet Truck since 2012. Sambar Van 1961 2022 – Japan Cabover cargo microvan with rear sliding doors. Rebadged Daihatsu Hijet Cargo since 2012. Sambar Dias 1999 2022 – Japan Cabover passenger microvan with rear sliding doors. Rebadged Daihatsu Atrai passenger van. Formerly known as the Dias Wagon until 2022. == References == Category:1954 establishments in Asia Category:1950s establishments in Japan",
 "title": "Subaru"
}