{
 "id": "332499",
 "text": "Kim Jong-un (born 8 January 1982) is a North Korean politician and the 3rd and current Supreme Leader of North Korea since 2011. ==Early life== According to reports in Japanese newspapers, he went to school in Switzerland near Bern. First reports claimed Kim went to the private English-language International School in Gümligen under the name \"Chol-pak\" or \"Pak-chol\" from 1993 to 1998. Kim was described as shy and good student who got along well with his classmates and was a basketball fan. ==Leadership== In December 2011, Kim became the leader of North Korea after his father Kim Jong-il died on 17 December 2011. His grandfather Kim Il-Sung was the first leader of North Korea. On 9 March 2014, Kim was elected unopposed to the Supreme People's Assembly. ===Family executions=== On 12 December 2013, North Korean news outlets reported that due to alleged \"treachery\", Kim had ordered the execution of his uncle Jang Song-thaek. Kim is thought by many to have ordered the assassination of his half-brother, Kim Jong-nam, in Malaysia in February 2017.DNA Confirms Assassination Victim Was Half Brother of Kim Jong-un, Malaysia Says New York Times. By Russell Goldman. 15 March 2017. Downloaded 6 May 2017.Kim Jong-un risks vital ties with China Korea Times. By Jun Ji-hye. February 16, 2017. Downloaded May 6, 2017. ===Nuclear power=== As of 2016, the United Nations has created five rounds of sanctions against North Korea for its nuclear program and missile tests. As of March 2018, a South Korean official Chung Eui-Yong made an announcement on North Korea in the White House briefing room that the North Korean leader Kim told the South Koreans he is \"committed to denuclearisation\" and \"North Korea will refrain from any further nuclear or missile tests.\" and is open to meeting Donald Trump in North Korea. ===Human rights violations=== Human rights violations under the leadership of Kim Jong-il were condemned by the UN General Assembly. Press reports indicate that they are continuing under Kim. ===2018 international relations=== In his 2018 New Year Speech, Kim said he was open to talk with South Korea, and also to taking part in the 2018 Winter Olympics in the South. The Seoul–Pyongyang hotline was reopened after almost 2 years. North and South Korea marched together in the Olympics opening ceremony under a unified flag. In April 2018, Kim and Moon Jae-in formally attended the inter-Korean summit of 2018 and agreed to formally end the Korean War before 2019. In April and May 2018, Kim met with Xi Jinping, General Secretary of the Communist Party of China. In May 2018, Donald Trump said on Twitter that he would meet with Kim on June 12 in Singapore for peace talks. ==Personal life== Kim is married to Ri Sol-ju. They married in 2009. They had a daughter in 2010. He attended a state school in Switzerland from 1998 to 2000 posing as a diplomat's son. Kim is reported to have later attended the Kim Il Sung Military University in Pyongyang from 2002 to 2007. His mother died of cancer in 2004. In 2009, reports suggested that Kim was a diabetic and suffered from hypertension.Kim Jong-un (Kim Jong Woon) – Leadership Succession . Global Security.org. 3 July 2009 He is also known to smoke cigarettes. ==References== ==Other websites== * * North Korea's Young Leader on Show – video report by The New York Times * NSA Archive Kim Jong-Il: The \"Great Successor\" * Official short biography at Naenara * Kim Jong-un's works at Publications of the DPRK Category:1983 births Category:Living people Category:Dictators Category:North Korean generals Category:Specially Designated Nationals and Blocked Persons List Category:Presidents of North Korea Category:Current national leaders Category:People from Pyongyang",
 "title": "Kim Jong-un"
}