{
 "id": "332555",
 "text": "Cecil Blount DeMille (August 12, 1881 – January 21, 1959) was an American movie director. He was an Academy Award-winning producer of both silent and sound movies. He was renowned for the flamboyance and showmanship of his movies. His first movies were The Squaw Man and Joan the Woman. Among his best-known films are Cleopatra, Samson and Delilah; The Greatest Show on Earth, which won the Academy Award for Best Picture; and The Ten Commandments, which was his last and most successful movie. == Personal life and death == DeMille married Constance Adams on August 16, 1902 and had one child, Cecilia. The couple adopted Katherine Lester in the early 1920s. She married Anthony Quinn. They also adopted two sons, John and Richard. DeMille suffered a near fatal heart attack in 1956 during the shooting in Egypt of The Ten Commandments. He never fully recovered. He died on January 21, 1959 of heart failure. He rests in Hollywood Forever Cemetery). At the time of his death, he was planning to direct a movie about space travel. He also wanted to do a movie about the Biblical Book of Revelation.Eyman 2010, pp. 494–496, 500. == References == == Other websites == * * Bibliography of books and articles about Demille via UC Berkeley Media Resources Center * * * * Obituary, NY Times, January 22, 1959, Cecil De Mille, 77, Pioneer of Movies, Dead in Hollywood * Costs and Grosses for the Early Films of Cecil B. DeMille essay with detailed financial breakdowns by David Pierce * Official Cecil B. DeMille Site * DeMille Studio Museum also known as the Lasky-DeMille Barn, run by Hollywood Heritage. * DeMille celebrates his last birthday with Mary Pickford and Bob Hope and cake & sword 1958 * Bibliography * DeMille page at Corbis * Newsweek, Sept. 2010, How Cecil B. DeMille Created Modern Hollywood * Cecil B. DeMille's birth record * DeMille, 1900 Census * 1910 Census , 1920 Census * 1930 Census * 1942 World War II Draft Registrations . Category:American movie directors Category:American movie producers Category:American screenwriters Category:American movie actors Category:1881 births Category:1959 deaths Category:Academy Award Honorary Award winners Category:Actors from Massachusetts Category:Deaths from heart failure Category:Episcopalians Category:Writers from Massachusetts Category:19th-century American entertainers",
 "title": "Cecil B. DeMille"
}