{
 "id": "332598",
 "text": "Yundi Li (Chinese: 李云迪; pinyin: Lǐ Yúndí), born October 7, 1982 in Chongqing, Sichuan, China, is a Chinese pianist who is very famous for being the youngest pianist to win the International Frédéric Chopin Piano Competition, in 2000, at 18 years old. He now lives in Hong Kong. == Early life == Li's parents both worked at the Sichuan Chongqing Steel and Iron Company. When he was three years old, his parents bought him an accordion. He studied the instrument with Tan Jianmin, a music professor in China, and mastered it when he was four. Only one year later, he won the top prize at the Chongqing Children's Accordion Competition. At seven years old Li began to learn the piano. He continued to study with Dan Zhaoyi for another nine years. In 1994, he learned at the Shenzhen Arts School at Shenzhen, China, and later learned at the Hochschule für Musik, Theater und Medien Hannover in Hanover, Germany. == Prizes == Li won the Children's Piano Competition in Beijing in 1994. In 1995, he was awarded first place at the Stravinsky International Youth Competition. In 1998, he won the Missouri Southern International Piano Competition's junior division, and got Third Prize at the International Franz Liszt Piano Competition of Utrecht the next year. He also won the China International Piano Competition. He also got first place at the Gina Bachauer Young Artists International Piano Competition. Li participated in the 14th International Frédéric Chopin Piano Competition in Warsaw and won the first prize and the \"polonaise award\". ==Recordings== Chopin * Complete Nocturnes Chopin Recital * Piano Sonata in B minor No. 3 op. 58 * Andante spianato et Grande Polonaise brillante op. 22 * Études op. 10 Nos. 2 + 5 op. 25 No. 11 »Winter Wind« * Nocturnes op. 9 Nos. 1 + 2 op. 15 No. 2 * Impromptu op. 66 Franz Liszt * Piano Sonata in B minor * La Campanella * Widmung after Schumann: Liebeslied * Liebestraum No. 3 * Tarantella from Venezia e Napoli * Rigoletto-Paraphrase Awards: Echo Award 2003 Chopin: Scherzo & Impromptus * 4 Scherzi: * No. 1 op. 20 · No. 2 op. 31 * No. 3 op. 39 · No. 4 op. 54 * 3 Impromptus * No. 1 op. 29 · No. 2 op. 36 * No. 3 op. 51 Vienna Recital * Liszt: Rhapsodie espagnole * Mozart: Piano Sonata KV 330 * D. Scarlatti: Sonatas K. 380 + K. 13 * Schumann: Carnaval op. 9 Chopin & Liszt Piano Concerto No.1 * Liszt: Concerto for piano no.1 in E-Flat,S.124 * Chopin: Concerto for piano no.1 in E-minor,op.11 Prokofiev/Ravel: Piano Concertos * Prokofiev: Piano Concerto No. 2 in G minor * Ravel: Piano Concerto in G major Yundi – The Young Romantic * Frédéric Chopin: Scherzo in B minor, op.20 Scherzo in B flat minor, op.31 Scherzo in C sharp minor, op.39 Scherzo in E major, op.54; Franz Liszt: Grandes Études de Paganini: La Campanella * Bonus: Yundi Li plays at La Roque d’Anthéron == References == Category:1982 births Category:Living people Category:Chinese pianists",
 "title": "Yundi Li"
}