{
 "id": "332610",
 "text": "The following is the 2011–12 Canadian network television schedule. == Fall schedule == ===Sunday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Heartland Battle of the Blades Cover Me Canada The National CTV Once Upon a Time The Amazing Race Desperate Housewives Pan Am Global The Simpsons The Cleveland Show The Simpsons Allen Gregory Family Guy American Dad! The Good Wife CTV Two W5 Movie CSI: Miami Citytv Last Man Standing The Quon Dynasty Extreme Makeover: Home Edition Beyond Survival Murdoch Mysteries ===Monday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Coronation Street Jeopardy! Battle of the Blades InSecurity Being Erica The National CTV eTalk The Big Bang Theory Dancing with the Stars Castle Global ET Canada Entertainment Tonight NCIS House Hawaii Five-0 CTV Two Degrassi: The Next Generation Access Hollywood Sanctuary Two and a Half Men Mike & Molly The Mentalist Citytv How I Met Your Mother 30 Rock Terra Nova How I Met Your Mother 2 Broke Girls The Playboy Club ===Tuesday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Coronation Street Jeopardy! Rick Mercer Report This Hour Has 22 Minutes Michael, Tuesdays and Thursdays The Debaters The National CTV eTalk The Big Bang Theory Dancing with the Stars Flashpoint Unforgettable Global ET Canada Entertainment Tonight Glee NCIS: Los Angeles Parenthood CTV Two Degrassi: The Next Generation Access Hollywood The Big Bang Theory Man Up The Protector The Mentalist Citytv The Biggest Loser New Girl Raising Hope Body of Proof ===Wednesday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Coronation Street Jeopardy! Dragons' Den Camelot The National CTV eTalk The Big Bang Theory The X Factor Hot in Cleveland CSI Global ET Canada Entertainment Tonight Survivor Harry's Law Kitchen Nightmares CTV Two Degrassi: The Next Generation Access Hollywood Up All Night Free Agents Criminal Minds Law & Order: SVU Citytv How I Met Your Mother 30 Rock The Middle Suburgatory Modern Family Happy Endings Revenge ===Thursday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Coronation Street Jeopardy! The Nature of Things Doc Zone The National CTV Charlie's Angels The Big Bang Theory Whitney Grey's Anatomy The Mentalist Global ET Canada Entertainment Tonight The Office How to Be a Gentleman Bones Prime Suspect CTV Two The Vampire Diaries The X Factor America's Next Top Model Criminal Minds Citytv How I Met Your Mother 30 Rock Community Parks and Recreation Person of Interest Private Practice ===Friday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Coronation Street Jeopardy! The Ron James Show Rick Mercer Report The Fifth Estate The National CTV eTalk The Big Bang Theory Grimm CSI: NY Blue Bloods Global ET Canada Entertainment Tonight A Gifted Man I Hate My Teenage Daughter Happily Divorced Ringer CTV Two Degrassi: The Next Generation Access Hollywood Nikita Shark Tank Dateline NBC Citytv How I Met Your Mother 30 Rock Extreme Makeover: Home Edition Fringe Mantracker ===Saturday=== PM 7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 CBC Hockey Night in Canada CTV W5 The Sing-Off Crimetime Saturday Global 16:9 Recipe to Riches Movies CTV Two The Listener Flashpoint Movie Citytv What's Cooking Glenn Martin, DDS Rules of Engagement Dussault Inc. Movie Category:2011 in Canada Category:2011 in television Category:2012 in television Category:2010s in Canadian television Category:Television schedules",
 "title": "2011–12 Canadian network television schedule"
}