{
 "id": "332620",
 "text": "Xenoturbella is a genus of bilaterian animals; it contains two marine worm- like species. The first known species was discovered in 1915 but was only described in 1949.Westblad 1949. Arkiv. Zoologi. 1:3-29 A 2003 DNA study has shown it is a primitive deuterostome phylum.Bourlat S.J. et al. 2003. Xenoturbella is a deuterostome that eats molluscs. Nature 424 (6951): 925–928 The genus was the first member of its subphylum (the Xenoturbellida) to be discovered.G. Haszprunar R.M. & Rieger P. Schuchert 1991. \"Extant 'problematica' within or near the Metazoa.\" In: Simonetta A.M. & Conway Morris S. (eds): The early evolution of metazoa and the significance of problematic taxa. Oxford Univ. Press. 99–105Bourlat S.J. et al. 2006. Deuterostome phylogeny reveals monophyletic chordates and the new phylum Xenoturbellida. Nature 444 (7115): 85–88 This phylum is basal within the deuterostomes.Perseke M. et al 2007. The mitochondrial DNA of Xenoturbella bocki: genomic architecture and phylogenetic analysis. Theory Biosci. 126(1):35-42. Available on-line at It is related to the Acoelomorpha, forming a sister clade to the echinoderms and hemichordates.Philippe H. et al. 2011. Acoelomorph flatworms are deuterostomes related to Xenoturbella. Nature 470 (7333): 255-258 Other members of this phylum are now known.Morrelle, Rebecca 2016. Mystery of the deep-sea 'purple sock' solved. Xenoturbella has a very simple body plan: it has no brain, no through gut, no excretory system, no organized gonads (but does have gametes), or any other organs except for a statocyst containing flagellated cells. It has cilia and a diffuse nervous system. The animal is up to long, and has been found off the coasts of Sweden, Scotland and Iceland.Enigmatic worm identified as mankind's long lost relative – Accessed January 3, 2008 The association of specimens of Xenoturbella with mollusc larva has led many to suggest that they are molluscivores. However, another idea is that the Xenoturbella larval stage develops as an internal parasite of certain molluscs.Xenoturbella – Back to the basics – Accessed January 3, 2008 The genus Xenoturbella contains two species: * Xenoturbella bocki * Xenoturbella westbladi == References == ==Other websites== *A PCR survey of Xenoturbella bocki Hox genes *Movie of adult Xenoturbella bocki Category:Xenacoelomorpha",
 "title": "Xenoturbella"
}