{
 "id": "332611",
 "text": "Once Upon a Time (OUAT) is an American fairy tale drama television series. It was first broadcast on October 23, 2011 on ABC. It is about a woman, named Emma Swan, coming to a small town in Maine that is the home of cursed Fairytale characters who don’t remember who they are. == Storyline == The Evil Queen from Snow White was actually the daughter of the woman from Rumpelstiltskin and was named Regina. Regina fell in love with a man named Daniel so her mother Cora killed Daniel in front of her, tore his heart out of his chest and crushed it and forced Regina to marry Snow White’s father. When Regina found out that the only reason that Cora knew she was planning to marry Daniel was because Snow White told her, she decided to kill Snow White. When that didn’t work, she made a deal with Rumpelstiltskin to curse everyone in the forest to go to real world and lose their memories of ever living in a world where magic existed. But Prince Charming and Snow White made a deal with Rumpelstiltskin to find out how to break the curse. There was a prophecy that their daughter Emma Swann was The Chosen One who would break the curse. So they sent Emma, who was a baby, into the real world, just before the Queen cast the curse. So Emma grew up in an orphanage. Emma later ran away, became a criminal, had premarital sex and got pregnant. She gave birth while in jail because her boyfriend left her and decided to give her son away to be adopted. Regina later adopted him (not knowing he was Emma’s son) and named him Henry. Henry figured out that everyone he knew was a character in a fairy tale so he found Emma and brought her to the town where Regina was Mayor. == Season One == Emma is working as a Bounty hunter when on her 28th birthday, a 10 year old boy who says he’s her son Henry comes to her and asks her to save his town in Maine. Emma brings Henry back to his town and plans to leave (since she doesn’t believe him about Fairy tales) but then she meets his adoptive mother Regina and Regina is mean to her so Emma decides to stay in town. Emma lives at a Hotel but Regina gets her kicked out so Emma moves in with Henry’s teacher Mary Margaret not knowing that she’s actually her mother Snow White. Emma convinced the Sheriff to look into Regina to figure out if she had done anything bad so Regina murdered him. There was an election to choose the new Sheriff so Emma asked for help from Mister Gold and he set Regina’s house on fire knowing that Emma would save her. When Emma found out, she told everyone what Gold did and that she wouldn’t let him bully her like that. She then won the election. Gold then told her that that was actually his plan all along. There’s a flashback to how Rumpelstiltskin became The Dark One to save his son Baelfire and accidentally scared Baelfire into running away to the real world and Rumpelstiltskin was planning to go to the real world to find him ever since and everything everyone else did was actually a part of his plan. Regina hires Mr. Gold to frame Mary Margaret for murdering a woman named Kathryn and he does but then he agrees to work for Mary Margaret as her lawyer and gets her found not guilty by finding Kathryn alive (since he had kidnapped her but not killed her.) Emma decides to leave town but Regina convinces her to eat an apple turnover before leaving. Henry figures out that it’s poisoned and eats it. Henry almost dies. Regina tells Emma the truth so Emma kisses Henry and her “true love” breaks the curse and Henry wakes up. Gold finds his old girlfriend Belle and rescues her since she was kidnapped by Regina and he brings magic back. == Season Two == After the people get their memories back, Doctor Whale convinces them to kill Regina but Emma and her parents stop them since Henry doesn’t want her dead. After rescuing Belle, Mister Gold wants revenge against Regina but Belle makes him promise not to kill her. Instead, he uses magic to get a wraith to kill her for him. Emma and Mary Margaret stop it but are accidentally sent to fairy tale world. They meet Killian Jones, who is Captain Hook and he agrees to help them but Emma doesn’t trust him so she betrays him and runs away without him. Hook is angry about this so he goes to Regina’s mother Cora who is The Queen of Hearts and he uses magic beans to bring them both to the real world for revenge. Cora frames Regina for murder to get her to go back to being evil but then Mary Margaret kills Cora and Regina hates her for it. Captain Hook wants to kill Rumpelstiltskin because Rumpelstiltskin was the one who cut his hand off but he accidentally shoots Belle who loses all her memories. Rumpelstiltskin tries to kill Captain Hook for it but then a car comes to town and crashes stopping that from happening. Rumpelstiltskin gets Emma and Henry to find Baelfire for him and he turns out to be Henry’s father Neal. It turns out the driver who came to town,Greg, wants revenge on Regina since she killed his father and he and his girlfriend Tamora want to destroy magic. So they kidnap Henry and hand him to a place called Neverland where Peter Pan kills them both. Rumpelstiltskin, Neal, Emma, Regina and Mary Margaret go to Neverland to rescue Henry. It turns out that Peter Pan is actually Rumpelstiltskin’s father Malcolm and that he wants to kill Henry. After they rescue, Henry, Peter Pan follows them to their town and casts a new spell but Rumpelstiltskin kills him (even though he dies doing that.) Regina casts a spell so that everyone will go back to the Enchanted Forest and be safe except Emma and Henry who stay in the real world but get new memories of having always been together. == Season Three == The Wicked Witch of the West tricks Neal into bringing Rumpelstiltskin back to life and then dying. She tricks Regina, who turns out to be her half-sister, into bringing everyone back to the real world. Captain Hook convinces Emma that they’re all in danger to get her help. The Wicked Witch of the West mind controls Rumpelstiltskin into helping her cast a Time travel spell but after getting rescued, he kills her. Emma and Captain Hook are accidentally sent to the Enchanted Forest in the past and meet Rumpelstiltskin. They convince him to send him back to the future and he does but they accidentally bring The Snow Queen with them and she threatens the town. == Season Four == Regina realizes that all fairy tales are written by people and thinks if she can find the writer she can convince him to give her a happy ending. Rumpelstiltskin steals a hat from The Sorcerer’s Apprentice so he can get rid of the magic knife that controls him and keep his power (and tricks Captain Hook into helping him) but Belle figures out that he did that so she exiles him from the town. Rumpelstiltskin then teams up with Maleficent, Cruella de Vil and Ursula to kidnap the writer and make him give them happy endings. Emma has Regina spy on them for her. They find the author and free him from the magic book he’s trapped in. The Author, whose name is Isaac Heller, turns out to be a Villain. Isaac traps everyone except Henry in a book where the villains all get happy endings and the heroes are treated as villains so Henry has to rescue them. Then Henry rescues them by becoming the new author. Rumpelstiltskin’s evil magic called The Darkness gets out of him and almost takes control of Regina but Emma stops it by letting it take control of her and turn her into the new Dark One. == Season Five == After they go to Camelot to find out how to turn Emma back from being the Dark One, Captain Hook almost gets killed so Emma turns him into the Dark One and erases everyone’s memories. When he finds out what happens, he wants to kill Rumpelstiltskin but instead he convinces Emma to put all her evil in him and then kills himself to destroy the Dark One. Emma finds out that Rumpelstiltskin stole all of the magic from Hook and is powerful again so she convinces him to take her to Hades to rescue Hook. After Rumpelstiltskin kills Hades, it turns out that his mother is evil and coming to destroy the world. == Season Six == Rumpelstistkin’s mother kidnaps his and Belle’s son so she can use him to destroy the world. Emma marries Captain Hook. Rumpelstiltskin’s mother brainwashes Emma into thinking that none of the show happened and Henry has to convince her to believe in things again so that the world won’t get destroyed. == Season Seven == In 2018, an adult Henry, who now thinks that all of the people he knew were just characters in a novel he wrote, learns that it was all real. Then Henry (and everyone else) have to stop Alternate Universe Rumpelstiltskin from destroying the world. == References == Category:American drama television series Category:2011 American television series debuts Category:Fantasy television series Category:English- language television programs",
 "title": "Once Upon a Time (TV series)"
}