{
 "id": "332924",
 "text": "The Indoor Football League (IFL) is a professional indoor American football league created in 2008 by joining together the Intense Football League and United Indoor Football. For the 2011 season the league had 22 teams in 14 different U.S. states. The 2012 season has 16 teams. The championship is called the United Bowl. They play games in the Spring. ==2009 United Bowl Championship== The 2009 IFL United Bowl had the Intense Conference champs, the Billings Outlaws, against the upset-minded United Conference River City Rage. Scoring was common. The Outlaw defense had a pick in the 2nd quarter which led to another offensive touchdown and two score lead by halftime. The Rage fought back, recovering an onside kick at the beginning of the 3rd quarter and driving the ball the length of the field for a touchdown. That would be the closest the game would get for the Rage. The Outlaws would put up just enough points to keep a comfortable lead throughout the fourth quarter and after recovering an onside kick in the last minute of the game, the Outlaws kneeled the ball and took home the crown with a score of 71-62 in a loud, sold out Rimrock Auto Arena. ==2010 United Bowl Championship== In the 2010 IFL United Bowl, the Billings Outlaws of the Intense Conference took the league championship by beating Sioux Falls Storm of the United Conference 43-34 in front of a sold out crowd in the Billings Sportsplex (a training facility, used by the Outlaws after their arena suffered storm damage). ==Other information== The IFL got more attention when former National Football League star wide receiver Terrell Owens joined the Allen Wranglers of the IFL for the 2012 season. ==Teams== ===Current=== Team Location Arena Capacity Founded Joined Head coach Arizona Rattlers Phoenix, Arizona Gila River Arena 17,125 1992 2017 Kevin Guy Bismarck Bucks Bismarck, North Dakota Bismarck Event Center 10,100 2017 2019 Rod Miller Cedar Rapids River Kings Cedar Rapids, Iowa U.S. Cellular Center 5,700 2011 2012 Victor Mann Duke City Gladiators Albuquerque, New Mexico Tingley Coliseum 9,286 2015 2020 Martino Theus Frisco Fighters Frisco, Texas Comerica Center 3,500 2019 2020 Clint Dolezel Green Bay Blizzard Green Bay, Wisconsin Resch Center 8,600 2003 2010 Corey Roberson Iowa Barnstormers Des Moines, Iowa Wells Fargo Arena 15,181 1995 2015 Ameer Ismail Louisville Xtreme Louisville, Kentucky Freedom Hall 18,865 2012 2021 Mark Stoute Massachusetts Pirates Worcester, Massachusetts DCU Center 12,339 2017 2021 Patrick Pass Northern Arizona Wranglers Prescott Valley, Arizona Findlay Toyota Center 6,000 2020 2021 Dominic Bramante San Diego Strike Force San Diego, California Pechanga Arena 12,000 2018 2019 Burt Grossman Sioux Falls Storm Sioux Falls, South Dakota Denny Sanford Premier Center 10,678 2000 2009 Kurtiss Riggs Spokane Shock Spokane, Washington Spokane Veterans Memorial Arena 10,771 2006 2020 Billy Back Tucson Sugar Skulls Tucson, Arizona Tucson Convention Center 8,962 2018 2019 Dixie Wooten ===Inactive=== Team Location Arena Capacity Founded Joining Head coach Columbus Wild Dogs Columbus, Ohio Nationwide Arena 18,500 2019 2022 Bobby Olive Oakland Panthers Oakland, California Oakland Arena 19,596 2019 2022 Kurt Bryan Quad City Steamwheelers Moline, Illinois TaxSlayer Center 9,200 2017 2022 Cory Ross ===Map of teams=== ==References== ==Other websites== * * Owens to join Wranglers-ESPN * Outlaws win IFL championship Category:Sports leagues Category:2008 establishments in the United States",
 "title": "Indoor Football League"
}