{
 "id": "333126",
 "text": "David William Oaks (born September 16, 1955, Chicago, Illinois)The moral imperative for dialogue with organizations of survivors of coerced psychiatric human rights violations, mindfreedom.org; accessed September 27, 2014. is a civil rights activist and founder and former executive director of Eugene, Oregon-based MindFreedom International. The organization includes psychiatric survivors and dissident psychiatrists who reject what they say is the \"domination\" by the biomedical model that defines contemporary psychiatry. Oaks says that the psychiatric drugs that patients take have harmful side effects, and people can often recover without them. ==Biography== In the 1970s, David Oaks was a student at Harvard University. He was diagnosed as having schizophrenia. He was hospitalized in an institution and forcibly treated with medications. He recovered, he says, by rejecting drugs and getting support from family and friends. Oaks says he \"maintains his mental health with exercise, diet, peer counseling and wilderness trips — strategies that are well outside the mainstream thinking of psychiatrists and many patients\". Oaks is on the board of directors for the United States International Council on Disability. ==Awards== *Lane Independent Living Alliance award in 2011. *Utne Reader magazine named Oaks as one of \"50 Visionaries\" for 2009. *Barrier Awareness Day 2003 Leadership Award. *2002 Distinguished Achievement Award from the International Center for the Study of Psychiatry and Psychology. *Project Censored award 2000. *1994 David J. Vail National Advocacy Award by National Mental Health Association of Minnesota. ==Selected Articles== * Oaks, David W. (2007). ‘MindFreedom International: Activism for Human Rights as the Basis for a Nonviolent Revolution in the Mental Health System’. In Peter Stastny & Peter Lehmann (Eds.), Alternatives Beyond Psychiatry (pp. 328–336). Berlin / Eugene / Shrewsbury: Peter Lehmann Publishing. (UK), (USA). * Oaks, David W. (2007). ‘MindFreedom International - Engagement für Menschenrechte als Grundlage einer gewaltfreien Revolution im psychosozialen System’. In Peter Lehmann & Peter Stastny (Eds.), Statt Psychiatrie 2 (pp. 344–352). Berlin / Eugene / Shrewsbury: Antipsychiatrieverlag. . * Oaks, David W. (1993). 'Antipsychiatrie und Politik – 20 Jahre Widerstand in den USA' (pp. 443–448). In Kerstin Kempker & Peter Lehmann (Eds.), Statt Psychiatrie. Berlin: Antipsychiatrieverlag. . ==References== ==Other websites== *book The moral imperative for dialogue with organizations of survivors of coerced psychiatric human rights violations *MindFreedom International homepage Category:Psychiatry Category:People from Eugene, Oregon Category:Harvard University alumni Category:American activists Category:Living people Category:1955 births",
 "title": "David Oaks"
}