{
 "id": "333131",
 "text": "MindFreedom International is an international coalition of over one hundred groups and thousands of individual members from fourteen nations. Based in the USA, it was founded in 1990 to protest against forced medication, medical restraints, and involuntary electroconvulsive therapy in psychiatry. It protects the rights of people who have been labeled with psychiatric disorders.Introductory FAQ's about MFI — MFI Portal MindFreedom has been recognized by the United Nations Economic and Social Council as a human rights NGO. David Oaks is the founder and executive director of MindFreedom International. ==References== ==Other websites and References== * MindFreedom.org - MindFreedom International homepage * Utne.com - \"Freeing Your Mind\", Keith Goetzman, Utne (May/June, 2006) * PsychiatryOnline.org - 'Evolution of the Antipsychiatry Movement Into Mental Health Consumerism', Psychiatric Services, Rissmiller and Rissmiller, 57 (6): 863 (2006) * IndyStar.com - 'Eli Lilly to bolster Zyprexa warning', John Russell, Indianapolis Star (October 6, 2007) * RegisterGuard.com - 'Rights group up against Eli Lilly', Susan Palmer, The Register Guard, (January 15, 2007) * Oaks, David W. (2007). ‘MindFreedom International: Activism for Human Rights as the Basis for a Nonviolent Revolution in the Mental Health System’. In Peter Stastny & Peter Lehmann (Eds.), Alternatives Beyond Psychiatry (pp. 328–336). Berlin / Eugene / Shrewsbury: Peter Lehmann Publishing. (UK), (USA). * Oaks, David W. (2007). ‘MindFreedom International - Engagement für Menschenrechte als Grundlage einer gewaltfreien Revolution im psychosozialen System’. In Peter Lehmann & Peter Stastny (Eds.), Statt Psychiatrie 2 (pp. 344–352). Berlin / Eugene / Shrewsbury: Antipsychiatrieverlag. . Category:1990 establishments in the United States Category:Psychiatry Category:Medical and health organizations in the United States Category:Human rights organizations in the United States Category:Eugene, Oregon",
 "title": "MindFreedom International"
}