{
 "id": "333558",
 "text": "Elisabeth Judson Shue (born October 6, 1963) is an American actress. She is best known for her work in the movies The Karate Kid, Adventures in Babysitting, Cocktail, Back to the Future Parts II and III and Leaving Las Vegas. ==Early life== Shue was born in Wilmington, Delaware. Shue's mother was a descendant of Pilgrim religious leader William Brewster. Her father's family moved from Germany to Pennsylvania in the early 19th century. Shue's younger brother, Andrew, is also an actor. Shue grew up in Bergen and Essex counties in New Jersey. Her parents divorced when she was young.ArticleNew Jersey Monthly Shue graduated from Columbia High School, in Maplewood, New Jersey. She later studied at Wellesley College and Harvard University. Shue left Harvard early because of her acting career. She returned to Harvard to finish her degree in Government in 2000. ==Career== ===1980s and early 1990s=== While in high school, Shue acted in television commercials. She did ads for Burger King, DeBeers diamonds, and Hellman's mayonnaise. Her first movie role was in 1984. She acted in The Karate Kid. She played the girlfriend of Ralph Macchio. In 1986, she acted with Terrance Stamp in the British horror movie Link. Adventures in Babysitting was her first acting job where she was the main character. In 1995, Shue played a prostitute in Leaving Las Vegas, alongside Nicolas Cage. Her role in the film got her nominated for Academy Award for Best Actress, but Susan Sarandon won instead. ==Personal life== Shue is married to movie director Davis Guggenheim. Their son, Miles William, was born on November 11, 1997. She gave birth to her first daughter, Stella Street, on March 19, 2001. Her third child, Agnes Charles, was born on June 18, 2006. Her son's middle name is in honor of her second brother, William. This brother died in 1988 at the age of 26 in a swimming accident.Elisabeth Shue - Profile, Latest News and Related Articles ==Filmography== Year Title Role Notes 1984 The Karate Kid Ali Mills 1986 Link Jane Chase Nominated—Saturn Award for Best Actress 1987 Double Switch Kathy Shelton TV movie (ABC) 1987 Adventures in Babysitting Chris Parker 1988 Cocktail Jordan Mooney 1989 Back to the Future Part II Jennifer Parker/McFly 1990 Back to the Future Part III Jennifer Parker 1991 Soapdish Lori Craven 1991 Adele Horner 1993 Twenty Bucks Emily Adams 1993 Heart and Souls Anne 1994 Radio Inside Natalie 1994 Blind Justice Caroline TV movie 1995 Leaving Las Vegas Sera 1995 Underneath Susan Crenshaw 1996 Annie Kay 1997 Dr. Emma Russell 1997 Deconstructing Harry Fay 1998 Cousin Bette Jenny Cadine 1998 Palmetto Mrs. Donnelly/Rhea Malroux 1999 Molly Molly McKay 2000 Hollow Man Linda McKay 2001 Amy & Isabelle Isabelle Goodrow 2002 Tuck Everlasting Narrator voice only 2004 Mysterious Skin Mrs. McCormick 2005 Hide and Seek Elizabeth 2005 Dreamer: Inspired by a True Story Lilly Crane 2007 First Born Laura 2007 Gracie Lindsay Bowen 2008 Hamlet 2 Herself 2009 Don McKay Sonny 2010 Piranha 3-D Sheriff Julie Forester 2010 Waking Madison Dr. Elizabeth Barnes 2012 House at the End of the Street Sarah 2012 Russian of Gold Green Duck 2012 CSI: Crime Scene Investigation Julie Finlay Series regular ==References== ==Other websites== * * Elisabeth Shue at FEARnet Category:American movie actors Category:American television actors Category:Actors from Wilmington, Delaware Category:Actors from New Jersey Category:1963 births Category:Living people",
 "title": "Elisabeth Shue"
}