{
 "id": "333899",
 "text": "Marion Sylvester Barber III (June 10, 1983 - June 1, 2022) was an American football running back in the National Football League. After playing college football for the Minnesota Golden Gophers, he was drafted by the Dallas Cowboys in the fourth round of the 2005 NFL Draft. He was selected to the Pro Bowl in 2007 during his six-year career with the Cowboys. He played for the Chicago Bears in 2011. ==College== Barber played college football for Minnesota Golden Gophers. He had 35 rushing touchdowns, one more than his father, Marion Barber Jr. He and Laurence Maroney helped make the Golphers backfield one of the best in the NCAA. ==Professional career== ===Dallas Cowboys=== Barber was drafted by the Dallas Cowboys in the 4th round (109 overall) of the 2005 NFL Draft. Despite his talent, Barber's career has been harmed by injuries. he never rushed for 1,000 yards or over. He was voted to the Pro Bowl in 2007 after 204 rushing yards, 975 yards, and 10 touchdowns. He added 44 catches, 282 yards, and two receiving touchdowns in 2007. Barber was released by Dallas after the 2010 season and was signed by the Chicago Bears. ===Chicago Bears=== Barber was signed by the Chicago Bears as a backup to Matt Forte. His fumble against the Denver Broncos lost the game. In his only season in Chicago, Barber rushed for 442 yards and 6 touchdowns on 114 carries. ===Retirement=== On March 23, 2012, Barber announced his retirement. “I want to thank everyone who gave me the opportunity to play, and I’m very thankful to have had the chance to suit up for two of the NFL’s most storied organizations,” Barber said on the Bears' team website. ==Personal== Barber was the older brother of Houston Texans safety Dominique Barber and the son of former New York Jets running back Marion Barber, Jr.. Barber was found dead in his Frisco, Texas apartment on June 1, 2022, nine days before his 39th birthday. ==References== ==Other websites== * Marion Barber among Dallas Cowboys to be released-ESPN * Barber announces retirement-MSN Category:1983 births Category:2022 deaths Category:American football running backs Category:Dallas Cowboys players Category:Chicago Bears players Category:Sportspeople from Minnesota",
 "title": "Marion Barber III"
}