{
 "id": "334190",
 "text": "Dorothy Elizabeth Gish (March 11, 1898 – June 4, 1968) was an American actress. She was born in Dayton, Ohio. She was very young when her father abandoned the family. Dorothy, her older sister Lillian, and their mother entered the theatrical profession to support themselves. In 1912, actress Mary Pickford introduced them to director D. W. Griffith. The sisters began acting at Biograph Studios. Dorothy and Lillian Gish both debuted in Griffith's An Unseen Enemy. Dorothy would star in over 100 short movies and feature movies. Dorothy married actor James Rennie in 1920. They divorced in 1935. Dorothy never remarried. She died in 1968 from bronchial pneumonia in Rapallo, Liguria, Italy. She was laid to rest in Saint Bartholomew's Episcopal Church in New York City. Her sister Lillian was later laid to rest beside her. Dorothy Gish was awarded a star on the Hollywood Walk of Fame at 6385 Hollywood Blvd., Hollywood, California. Dorothy and Lillian both appeared in D. W. Griffith's Orphans of the Storm in 1921. == Sources == * David W. Menefee, The First Female Stars: Women of the Silent Era (Connecticut: Praeger, 2004) * Harold Casselton (ed.),Remembering Dorothy Gish (Minneapolis: The Society for Cinephiles, 1986) * Homer Croy, Star Maker: The Story of D. W. Griffith (New York: Duell, Sloan and Pearce, 1959) * Dorothy Gish, \"And So I am a Comedienne\", Ladies Home Journal (July 1925) * Lillian Gish, Dorothy and Lillian Gish (New York: Charles Scribner's Sons, 1973) * Lillian Gish, The Movies, Mr. Griffith, and Me (New York: Prentice Hall, 1969) * Anthony Slide, The Griffith Actresses (New York: A. S. Barnes and Company, 1973) * Margaret L. Talmadge, The Talmadge Sisters (New York: J. B. Lippincott & Co., 1924) == Other websites== * * * * The Dorothy and Lillian Gish Film Theater * Extensive Dorothy Gish gallery * The Dorothy Gish Project Category:1898 births Category:1968 deaths Category:American child actors Category:American movie actors Category:American silent movie actors Category:Deaths from pneumonia Category:Infectious disease deaths in Italy Category:Episcopalians Category:Actors from Dayton, Ohio",
 "title": "Dorothy Gish"
}