{
 "id": "334145",
 "text": "{{Infobox writer | name = Jonathan Nolan | image = Jonathan Nolan.jpg | caption = | pseudonym = | birth_name = Jonathan Nolan | birth_date = | birth_place = London, United Kingdom | death_date = | death_place = | occupation = Screenwriter, film producer | nationality = | ethnicity = | citizenship = United Kingdom United States | period = 1998-present | genre = Crime, Thriller | subject = | movement = | notableworks = | spouse = | partner = | children = | relatives = Christopher Nolan (brother) John Nolan (uncle) | influences = | influenced = | awards = | signature = | website = | portaldisp = }} Jonathan Nolan (born 6 June 1976) is a British-American author and screenwriter. He is the brother of movie director Christopher Nolan. Jonathan Nolan's story Memento Mori was made into a critically acclaimed movie Memento. He has also co-written screenplays for The Prestige and The Dark Knight Trilogy, with his brother. In movie credits, his name has appeared as Jonah.Production Assistant for the film Memento. ==Early life== He was born in London, England, to an English father and American mother. He was raised in the Chicago area. Nolan attended Loyola Academy in Illinois. He graduated from there in 1994, and then graduated from Georgetown University in Washington, D.C., in 1999. In this university, he studied English and was a staff writer for The Hoya. His brother, Christopher, speaks with a British English accent, but Jonathan speaks with an American English accent. ==Career== Nolan tells about successful work relationship with his brother in the production notes of The Prestige: \"I’ve always suspected that it has something to do with the fact that he’s left-handed and I’m right-handed, because he’s somehow able to look at my ideas and flip them around in a way that’s just a little bit more twisted and interesting. It’s great to be able to work with him like that.\" On March 23, 2007, it was announced he would pen Interstellar, a science fiction film. It is based on the theories of Kip Thorne, a theoretical physicist who is known for his theories in gravitation physics and astrophysics and for having trained a generation of scientists. The film was first reported to be directed by Steven Spielberg and eventually settled with Christopher Nolan as director and is released in 2014. Nolan worked on The Dark Knight Rises. It is the third Batman movie in The Dark Knight Trilogy. On February 10, 2011, Nolan's TV pilot Person of Interest had been picked up by CBS and plan was to make it in a TV show. The show was officially picked up by CBS on May 13, 2011, and will star Michael Emerson, Jim Caviezel, and Taraji P. Henson. It will be produced by J. J. Abrams. His company Bad Robot Productions will produce it. Nolan will be the executive producer. ==Works of fiction== *\"Memento Mori\" (2001 Short Story) the basis of Memento'' *The Prestige (2006) - screenplay (with Christopher Nolan) *The Dark Knight (2008) - screenplay (with Christopher Nolan) *Person Of Interest (TV Series 2011–2016) - creator/writer *The Dark Knight Rises (2012) - screenplay (with Christopher Nolan) ==References== ==Other websites== * Category:Christopher Nolan Category:Living people Category:1976 births Category:Screenwriters from Chicago Category:Screenwriters from London Category:British television writers Category:American television writers Category:Naturalized citizens of the United States",
 "title": "Jonathan Nolan"
}