{
 "id": "334371",
 "text": "Edward Lee \"Ted\" Thorndike (August 31, 1874 – August 9, 1949) was an American psychologist. He spent most of entire career at Teachers College, Columbia University. He worked on ethology and the learning process, which led to the theory of connectionism and helped lay the scientific foundation for modern educational psychology. Thorndike also worked on industrial problems, such as employee exams and testing. He was a member of the board of the Psychological Corporation and served as president of the American Psychological Association in 1912.Saettler, L. Paul 2004, Evolution of American educational technology. IAP. == Thorndike's law == Thorndike's law of effect basically states that “responses that produce a satisfying effect in a particular situation become more likely to occur again in that situation, and responses that produce a discomforting effect become less likely to occur again in that situation”.Hergenhahn B.R. & Olson, Matthew H. 2005. An Introduction to the theories of learning. Pearson Education. == Books == Thorndike's textbooks were widely used in psychology courses for teacher training in the first part of the 20th century: *1903 Educational psychology. New York, Lemcke & Buechner. Revised and enlarged 1910, Teachers College, Columbia University, New York. *1904 Introduction to the theory of mental and social measurements. New York: Science Press. *1905 The elements of psychology. New York: Seiler. *1911. Animal intelligence: experimental studies. New York: Macmillan. *1913. Education psychology: briefer course. New York: Routledge. *1921 The teacher's word book. 1932 A teacher's word book of the twenty thousand words found most frequently and widely in general reading for children and young people. 1944 (with J.E. Lorge) The teacher's word book of 30,000 Words. *1922 The psychology of arithmetic. New York, Macmillan. *1927 The measurement of intelligence. New York, Teachers College, Columbia University. *1931. Human learning. New York, Century. *1932 The fundamentals of learning. New York, Teachers College, Columbia University. == References == Category:1874 births Category:1949 deaths Category:American psychologists Category:Harvard University alumni Category:Columbia University alumni Category:American atheists Category:Scientists from Massachusetts Category:Ethologists",
 "title": "Edward Thorndike"
}