{
 "id": "334352",
 "text": "\"Rumpelstiltskin\" () is a fairy tale. It was first published by the Brothers Grimm in their Children's and Household Tales of 1812. There are many similar tales such as \"Tom-Tit-Tot\". Maria Tatar says that the Rumpelstiltskin story is all about greed and lying , and has little moral value for children. == Story == A poor miller tells the king that his daughter can spin straw into gold. The king locks her in a castle room to test her. She cries because it’s impossible. A little man appears and helps her. In return, she gives him her necklace. The king is happy. He does not know the girl has had help. He tests the girl again the next night. Once more, the little man does the task and receives a ring. On the third night, the girl has nothing left to give the little man and promises him her first-born child. The king marries the girl. She gives birth to a child. The little man comes to take away the child. He gives the queen the chance to keep her baby if she can guess his name. A courtier spies on the little man and finds out his name is Rumpelstiltskin. The queen confronts the little man with his name. He gets so evil that he tears himself in two. == Adaptations == In 1915, Raymond B. West made a silent movie based on Rumpelstiltskin. In it, a Dwarf wants to marry a girl named Polly but her father says no so he tricks the King into thinking that Polly can spin straw into gold. The King says he’ll kill Polly, her father and the Dwarf unless she does. The Dwarf tells Polly that he’ll spin straw into gold for her but only if she gives him her firstborn child and she says yes. A Prince named Cole falls in love with Polly but the Dwarf kidnaps her. The Prince rescues her and they get married. In 1940, a German director made a horror movie based on Rumpelstiltskin. In 1955, a different German director made a Rumpelstiltskin movie. In 1987, an American director named David Irving made a Musical movie called Rumpelstiltskin where a mute girl named Emily helps the Miller’s daughter Katie figure out Rumpelstiltskin’s name. In 1995, Mark Jones made a horror movie about Rumpelstiltskin coming to the 20th Century. == Other Media == There’s an episode of Deep Space Nine, called If Wishes Were Horses, where aliens invade Miles O’Brien’s imagination and bring Rumpelstiltskin to life and Rumpelstiltskin says he’ll save the Space Station if O’Brien gives him his daughter. Rumpelstiltskin is also the villain of Shrek 4. == Once Upon a Time == In Once Upon a Time, Rumpelstiltskin has an origin story where his mother turned into a Fairy to stop him from becoming the Chosen One but was exiled so Rumpelstiltskin’s father abandoned him and became Peter Pan. Rumpelstiltskin joined the army to prove he was brave but he heard that there was a prophecy that what he did would leave his son fatherless so he broke his own leg to get sent home. His wife hated him for it so she ran away with Captain Hook and Rumpelstiltskin lied to his son Baelfire that his mother was dead. To keep Baelfire from being forced to fight against Ogres, Rumpelstiltskin stole a magic knife from The Dark One and stabbed him so Rumpelstiltskin became the new Dark One and killed all the soldiers and all of the Ogres. Baelfire ended up being so scared of Rumpelstiltskin’s power that he ran away to The Land Without Magic. And Rumpelstiltskin killed a woman who could see the future to steal her power and found out that there was a curse that could send him to the Land Without Magic but he needed someone else to cast it. And once he was there, he could find a young boy who would lead him to his son but the boy would be Rumpelstiltskin’s undoing. So Rumpelstiltskin trained Queen Regina to use magic to cast the curse and he was transformed into a man named Mister Gold who could control her whenever he used the word “please.” Rumpelstiltskin is also an important character in the origin stories of most of the other characters. Rumpelstiltskin finds out that Henry Mills is the boy who would lead him to his son and that it’s because Baelfire is actually Henry’s father Neal. Rumpelstiltskin later dies to kill Peter Pan and save everyone else. The Wicked Witch of the West later brings Rumpelstiltskin to life by killing his son and forces him to help her cast a Time Travel spell but then he kills her. Rumpelstiltskin falls in love with Belle and becomes a better person but his Doppelgänger from an Alternate Universe tries to destroy the world so Rumpelstiltskin dies to kill him. == References == * Tatar, Maria. 2002. The Annotated Classic Fairy Tales. Norton. pp. 123-4. * Zipes, Jack (Ed.) 2000. The Oxford Companion to Fairy Tales. Oxford UP. p. 429. == Other websites== Rumpelstiltskin (1915), IMDB Rumpelstiltskin (1940), IMDB Rumpelstiltskin (1955), IMDB Rumpelstiltskin (1987), IMDB Rumpelstiltskin (1995), IMDB * Free version of translation of \"Household Tales\" by Brothers Grimm from Project Gutenberg * The Brothers Grimm's 'Rumpelstiltzkin' * 'Tom Tit Tot: an essay on savage philosophy in folk-tale' by Edward Clodd (1898) * Web Essay on the Origin of Rumpelstiltskin Category:Grimms' Fairy Tales",
 "title": "Rumpelstiltskin"
}