{
 "id": "33476",
 "text": "Mirza Ghulam Ahmad (Urdu: مرزا غلام احمد; February 13, 1835 – May 26, 1908), was a 19th-century religious leader. He founded the Ahmadiyya movement which branched out from Sunni Islam. According to Ahmadi doctrine, he was the last prophet, based on the interpretation of the Seal of Prophets that non-law bearing prophets could still come ,as well as the Mahdi and the Messiah. He is believed by Ahmadis to be the Mujaddid of the 14th Islamic century.\"The Fourteenth-Century's Reformer / Mujaddid\" , from the \"Call of Islam\", by Maulana Muhammad Ali == Biography == === Early life === Ghulam was born in the village of Qadian, Punjab region in British Raj in 1835 the surviving child of twins born to a rich family. He is reported to have spent a lot of time in the mosque and with the study of the Quran and his religion, Islam. This did not lead him to fulfill his father's wishes of his son becoming a lawyer or civil servant. He did attempt to become a lawyer but failed the test. In his course of studying religious topics, he would often interact with many Muslims, non- Muslims such as Hindus and Sikhs, and with Christian missionaries whom he would engage in debates. === Prior to his claim === When Ghulam was thirty- five years old his father died. At this time Ghulam claimed that God had begun communicating with him, often through direct revelation. Initially, Ghulam's writings from this time were intended to counter what he perceived to be anti- Islamic writings originating from various Christian missionary groups. He also focused on countering the effects of various groups such as the Brahmo Samaj. During this period of his life he was well received by the Islamic clerics of the time. === Post claim === As time progressed, his writings began to exhibit his claims of being the mujaddid or reformer of his era. These writings were compiled in one of his most well-known works: Barahin Ahmadiyya, a work consisting of 5 volumes while originally planned 50 volumes. He explained that since there is only a dot difference between 50 & 5, therefore his promise was fulfilled. In later volumes, he would essentially claim to be the messiah of Islam. This proved and continues to be very controversial, as traditional Islamic thought holds that Jesus is the Messiah, who himself will return in the flesh at the end of times. Ghulam countered this by claiming that Jesus was dead, and had in fact escaped crucifixion and died in India. According to Ghulam, the promised Mahdi was a spiritual, not military leader as is believed by most Muslims. With this proclamation, he also began to step away from the traditional idea of militant Jihad, and redefined it as a “spiritual” battle rather than a physical one. In addition to these controversial claims, he would later claim that Guru Nanak, the first Sikh Guru, was in fact a Muslim because he had gone to Mecca to take part in the Hajj pilgrimage. These writings began to turn the general Muslim ulema (religious clerics) against him, and he was often branded as a heretic. Some accused Ghulam of working for the British who were trying to use him to remove the concept of Jihad from the Muslim populations living under British rule in South Asia. Ghulam founded the Ahmadiyya movement in 1889. He claimed that the Ahmadiyya Movement stood in the same relation to Islam, as Christianity stood to Judaism at the time of Jesus. The mission of the movement according to Ghulam was the prorogation of what he considered to be Islam in its pristine form. Mirza Ghulam's teachings which differed from other Muslims of the time can be summarized as follows: * That Muhammad is the last prophet to bring a new law/religion but not the last prophet altogether... and Prophethood within the Islamic dispensation is continued after him, and that he himself was a Prophet besides claimant of Imam Mahdi and the Messiah. * The Qur'an has no contradictions (or abrogations),\"The Advent of the Messiah and Mahdi\", by Maulana A. U. Kaleem, Part II: Islam—Synopsis of Religious Preaching and has precedence over the Hadith or traditions; i.e., that one verse of the Qur'an does not cancel another and that no Hadith can contradict a verse of the Qur'an. Hadith that appear to contradict the Qu'ran are not accepted by Ahmadi Muslims.\"The Matter of Abrogation\" , by Maulana Muhammad Ali, December 20, 1914 * Jesus (called Yuz Asaf) was crucified and survived the 4 hours on the cross, then was revived from a swoon in the tomb.\"Jesus Did Not Die on the Cross\", The Promised Messiah and Mahdi by Dr. Aziz Ahmad Chaudhry, Islam International Publications Limited He died in Kashmir of old age whilst seeking the \"Lost Tribes of Israel\".\"Death of Jesus\" , by Shahid Aziz, Ahmadiyya Anjuman Ishaat Islam Lahore (U.K.), Bulletin October 2001 * That Jihad can only be used to protect against extreme religious persecution, not as a political weapon or an excuse for rulers to invade neighbouring territories.\"True Meaning of Jihad\" , compiled by Imam Kalamazad Mohammad, Muslim Literary Trust, Trinidad * That the \"Messiah\" and \"Imam Mahdi\" are the same person, and that Islam will defeat the Anti-Christ or Dajjal in a period similar to the period of time it took for nascent Christianity to rise (300 years). Mainstream Muslims believe that Jesus was not crucified, but made to look as though he had been, and that he ascended to heaven from where he will return personally in the flesh to revive Islam.\"Islamic View of the Coming/Return of Jesus\" , by Dr. Ahmad Shafaat, Islamic Perspectives, May 2003Article on Islam , MSN Encarta online Mirza Ghulam is widely acknowledged to have devoted his life to furthering the cause of his movement and countering allegations of heresy against his person till his death at Lahore in 1908. == Origin of name == The Ahmadiyya movement in Islam was founded in 1889, but the name Ahmadiyya was not adopted until about a decade later. In a manifesto dated November 4, 1900, the founder explained that the name referred to Ahmad, the alternative name of the prophet Mohammed. According to him, ‘Mohammed’, which means ‘the praised one’, refers to the glorious destiny of the prophet who adopted the name from about the time of the Hegira; but ‘Ahmad’ stands for the beauty of his sermons, and for the peace that he was destined to establish in the world through his teachings. According to Mirza Ghulam Ahmad, these names thus refer to two aspects of Islam, and in later times it was the latter aspect that commanded greater attention. In keeping with this, he believed, his object was to establish peace in the world through the spiritual teachings of Islam. He believed that his message had special relevance for the Western world which according to him had descended into materialism. == Mirza Ghulam Ahmad's legacy == One of the main sources of dispute during his lifetime and continuing since then is Mirza Ghulam Ahmad's use of the terms “Nabi” (prophet) and “Rasool” (messenger) when referring to himself. Muslims consider the Prophet Muhammad to be the last of the prophets\"Five Pillars of Islam\" , Islam 101 and believe that Mirza Ghulam Ahmad's use of these terms is a violation of the concept of “finality of prophet hood”.\"Further Similarities and Differences: (between esoteric, exoteric & Sunni/Shia) and (between Islam/Christianity/Judaism)\", Exploring World Religions, 2001, Oxford University Press Canada His followers fall into two camps in this regard: the Ahmadiyya Muslim Community, who believe in a literal interpretation of Mirza Ghulam Ahmad's prophethood (with some qualifications),\"The Question of Finality of Prophethood\", The Promised Messiah and Mahdi, by Dr. Aziz Ahmad Chaudhry, Islam International Publications Limited and the Lahore Ahmadiyya Movement, who believe in a symbolic interpretation of these two terms.\"Hazrat Mirza Ghulam Ahmad Sahib of Qadian never Claimed Prophethood (in the light of his own writings)\" , Accusations Answered, The Lahore Ahmadiyya Movement This among other reasons caused a split in the movement soon after Ahmad's death. Followers of Mirza Ghulam Ahmad have faced relentless persecution of various types over the years.\"Pakistan: Killing of Ahmadis continues amid impunity\" , Amnesity International, Public Statement, AI Index: ASA 33/028/2005 (Public), News Service No: 271, 11 October 2005 In 1974, the Pakistani parliament amended the Pakistani constitution to declare Ahmadi Muslims as non-Muslims for purposes of the constitution of the Islamic Republic.\"An Act to amend the Constitution of the Islamic Republic of Pakistan; Gazette of Pakistan, Extraordinary, Part I\" , 21st September, 1974 In 1984, a series of changes in the Pakistan Penal Code sections relating to blasphemy that, in essence, made it illegal for Ahmadis to preach their religion openly as Islam, leading to 1000s of arrests and prosecutions. ==Related pages== * Ahmadi * Islam * Lahore Ahmadiyya Movement * Ahmadiyya Muslim Community == Sources and references == == Other websites == * Official Website of the Ahmadiyya Muslim Community * Official Website of the Lahore Ahmadiyya Movement * Complete List of the Works of Mirza Ghulam Ahmad Category:1835 births Category:1908 deaths Category:Indian Islamic religious leaders Category:New religious movements",
 "title": "Mirza Ghulam Ahmad"
}