{
 "id": "33485",
 "text": "The Indo-European languages are the world's most spoken language family. Linguists believe they all come from a single language, Proto-Indo-European, which was originally spoken somewhere in Eurasia. They are now spoken all over the world. The Indo-European languages are a family of several hundred related languages and dialects,It is composed of 449 languages and dialects, according to the 2005 Ethnologue estimate, about half (219) belonging to the Indo-Aryan sub-branch. including most major languages in Europe, the Iranian plateau, and South Asia. Historically, the language family was also important in Anatolia and Central Asia. The earliest Indo-European writing is from the Bronze Age in Anatolian and Mycenaean Greek. The origin of Proto-Indo-European is after the invention of farming since some of its words have to do with farming. Although it may have fewer languages than some other language families, it has the most native speakers, about 2.7 billion. Of the 20 languages with the most speakers, 12 are Indo-European: English, Spanish, Hindi, Portuguese, Bengali, Russian, German, Sindhi, Punjabi, Marathi, French, and Urdu. Four of the six official languages of the United Nations are Indo-European: English, Spanish, French, and Russian. == Main language groups == These are the main Indo- European language groups: * Albanian * Anatolian: Luwian; Hittite * Armenian * Balto-Slavic ** Baltic (Latvian and Lithuanian) ** Slavic (such as Polish, Russian, and Serbian) * Celtic (such as Irish and Welsh) * Germanic (such as English, German, and Swedish) * Greek (and modern Greek) * Indo-Iranian ** Indo-Aryan languages (Indic) ** Iranian * Latin and the Romance languages (such as French, Italian, and Romanian) Most Indo-European languages use the Latin script, but others use the Devanagari, Cyrillic, or Arabic scripts. ==Summary== The number of speakers derived from statistics or estimates (2019) and were rounded: Number Branch Languages Native Speakers Main Writing Systems Ref 1 Albanian language 4 7,500,000 Latin 2 Armenian language 2 7,000,000 Armenian 3 Balto-Slavic languages 25 270,000,000 Cyrillic, Latin 4 Celtic languages 6 1,000,000 Latin 5 Germanic languages 47 550,000,000 Latin 6 Hellenic languages 6 15,000,000 Greek 7 Indo-Iranian languages 314 1,650,000,000 Devanagari, Perso-Arabic 8 Italic languages 44 800,000,000 Latin Total Indo-European languages 448 3,300,000,000 – == History of Indo- European linguistics == Suggestions of similarities between Indian and European languages began to be made by European visitors to India in the 16th century. In 1583, Thomas Stephens, an English Jesuit missionary in Goa, India, noticed similarities between the Indian languages and Greek and Latin and included them in a letter to his brother, but it was not published until the 20th century. The first account to mention Sanskrit is from Filippo Sassetti. Born in Florence, Italy, in 1540, he was a merchant who was among the first Europeans to study Sanskrit. Writing in 1585, he noted some word similarities between Sanskrit and Italian such as devaḥ/dio \"God\", sarpaḥ/serpe \"serpent\", sapta/sette \"seven\", aṣṭa/otto \"eight\", nava/nove \"nine\"). However, neither observation led to further scholarly inquiry. In 1647, the Dutch linguist and scholar Marcus Zuerius van Boxhorn noted the similarity among Indo-European languages and supposed that they had derived from a primitive common language. He included in his hypothesis Dutch, Greek, Latin, Persian, and German, and he later added Slavic, Celtic, and Baltic languages. However, his suggestions did not become widely known and did not stimulate further research. Gaston Coeurdoux and others had made similar observations. Coeurdoux made a thorough comparison of Sanskrit, Latin, and Greek conjugations in the late 1760s to suggest a relationship between the languages. Similarly, Mikhail Lomonosov compared different languages groups of the world, including Slavic, Baltic, Iranian, Finnish, Chinese, Hottentot and others.M.V. Lomonosov. In: Complete edition, Moscow, 1952, vol 7, pp 652-659 : (transl.) 'Imagine the depth of time when these languages separated!... Polish and Russian separated so long ago! Think when [this happened to] Latin, Greek, German, and Russian! Oh, great antiquity!' The hypothesis reappeared in 1786, 20 years after Coeurdoux, when Sir William Jones lectured on the striking similarities between three of the oldest languages known in his time: Latin, Greek, and Sanskrit. He later tentatively added Gothic, Celtic, and Old Persiancited on page 14-15. but made some errors and omissions in his classification.Blench, Roger 2004. Archaeology and language: methods and issues . In: A companion to archaeology. J. Bintliff ed. 52-74. Oxford: Basil Blackwell 2004. (He erroneously included Egyptian, Japanese and Chinese in the Indo-European languages, while omitting Hindi.) In 1813, Thomas Young was first to use the term Indo-European.In London Quarterly Review X/2 1813.; cf. Szemerényi 1999:12, footnote 6 It became the standard scientific term except in GermanyIn German it is indogermanisch 'Indo-Germanic' which indicates the east-west extension, but omits the Italic languages. through Franz Bopp's Comparative Grammar. Appearing between 1833 and 1852, it was the starting point of Indo-European studies as an academic discipline. Some 20th-century scholars thought Indo- European languages started in Armenia or India, but most now think that it started in Eastern Europe or Anatolia. == References == == Other websites == *Indo-European languages -Citizendium",
 "title": "Indo-European languages"
}