{
 "id": "334847",
 "text": "is a Japanese football player. He played for the Japan national team. ==Biography== Yamamura was born in Nagasaki on December 2, 1989. After graduating from Ryutsu Keizai University, he joined J1 League club Kashima Antlers in 2012. He played many matches as defensive midfielder and center back. Kashima won the champions in the 2012 and 2015 J.League Cup. In 2016, he moved to J2 League club Cerezo Osaka. He played as defensive midfielder and Cerezo was promoted to J1 end of the 2016 season. In 2017, he mainly played as offensive midfielder. Cerezo also won the J.League Cup and Emperor's Cup. In 2019, he moved to Kawasaki Frontale. In January 2010, when Yamamura was a Ryutsu Keizai University student, he was selected the Japan national team for 2011 Asian Cup qualification. At this qualification, he debuted against Yemen on January 6. In 2012, he was selected the Japan U-23 national team for 2012 Summer Olympics. He played 3 matches and Japan won the 4th place. ==Career statistics== === Club === Updated to 5 November 2022.Nippon Sports Kikaku Publishing inc./日本スポーツ企画出版社, \"2017 J1&J2;&J3;選手名鑑 (NSK MOOK)\", 8 February 2017, Japan, (p. 147 out of 289) Club Season League Cup1 League Cup2 Asia Other3 Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Ryutsu Keizai University FC 2008 JFL 14 1 2 0 - - - 16 1 2009 4 0 2 0 - - - 6 0 Total 18 1 4 0 0 0 0 0 0 0 22 1 Kashima Antlers 2012 J1 League 18 1 0 0 5 0 - - 23 1 2013 24 3 2 1 3 0 - 1 0 30 4 2014 8 0 1 0 1 0 - - 10 0 2015 13 0 2 0 5 1 0 0 - 20 1 Total 63 4 5 1 14 1 0 0 1 0 83 6 Cerezo Osaka 2016 J2 League 34 6 3 0 - - 2 0 39 6 2017 J1 League 27 8 5 1 3 0 - 0 0 37 9 2018 24 2 2 0 2 0 6 0 1 0 35 2 Total 85 16 10 1 5 0 6 0 3 0 111 17 Kawasaki Frontale 2019 J1 League 18 2 3 0 5 0 2 0 0 0 28 2 2020 13 1 0 0 1 0 - - 14 1 2021 17 1 5 0 2 1 7 1 0 0 31 3 2022 23 1 2 0 2 0 5 0 0 0 32 1 2023 0 0 0 0 0 0 0 0 - 32 1 Total 71 5 10 0 10 1 14 1 0 0 115 7 Career total 237 26 29 2 29 2 20 1 4 0 321 31 *1 - Includes Emperor's Cup. *2 - Includes J. League Cup. *3 - Includes Suruga Bank Championship. === International === National team Year Apps Goals Japan U20 2009 9 2 Total 9 2 Japan U23 2010 7 1 2011 7 0 Total 14 1 Japan 2010 1 0 Total 1 0 International appearances and goals # Date Venue Opponent Result Goal Competition 2009 11 January Qatar SC Stadium, Doha Syria U20 2009 Qatar International Friendship Tournament / Japan U20 13 January Qatar SC Stadium, Doha United Arab Emirates U20 2009 Qatar International Friendship Tournament / Japan U20 15 January Qatar SC Stadium, Doha Serbia U20 2009 Qatar International Friendship Tournament / Japan U20 2 August Suwon World Cup Stadium, Suwon Egypt U20 2009 Suwon International Youth Football Tournament / Japan U20 4 August Suwon World Cup Stadium, Suwon South Africa U20 2009 Suwon International Youth Football Tournament / Japan U20 2 December Siu Sai Wan Sports Ground, Hong Kong North Korea U23 2009 East Asian Games / Japan U20 7 December Siu Sai Wan Sports Ground, Hong Kong Macau U23 2009 East Asian Games / Japan U20 10 December Hong Kong Stadium, Hong Kong South Korea U20 2009 East Asian Games / Japan U20 12 December Hong Kong Stadium, Hong Kong Hong Kong U23 2009 East Asian Games / Japan U20 2010 1\\. 6 January Ali Muhesen Stadium, Sana'a 2011 AFC Asian Cup qualification 8 November Tianhe Stadium, Guangzhou China U21 2010 Asian Games / Japan U21 10 November Huadu Stadium, Guangzhou Malaysia U23 2010 Asian Games / Japan U21 13 November Huadu Stadium, Guangzhou Kyrgyzstan U23 2010 Asian Games / Japan U21 16 November Huangpu Sports Center, Guangzhou India U21 2010 Asian Games / Japan U21 19 November Huangpu Sports Center, Guangzhou Thailand U23 2010 Asian Games / Japan U21 23 November Yuexiushan Stadium, Guangzhou Iran U23 2010 Asian Games / Japan U21 25 November Tianhe Stadium, Guangzhou United Arab Emirates U23 2010 Asian Games / Japan U21 2011 9 February Mohammed Al-Hamad Stadium, Hawalli Friendly / Japan U22 12 February Bahrain National Stadium, Manama Bahrain U22 Friendly / Japan U22 26 March Pakhtakor Markaziy Stadium, Tashkent Uzbekistan U22 Friendly / Japan U22 29 March JAR Stadium, Tashkent Uzbekistan U22 Friendly / Japan U22 1 June Niigata Stadium, Niigata Australia U22 Friendly / Japan U22 19 June Toyota Stadium, Toyota Kuwait U22 2012 Summer Olympics qualification / Japan U22 23 June Mohammed Al-Hamad Stadium, Hawalli Kuwait U22 2012 Summer Olympics qualification / Japan U22 ==Honours== ===Club=== ;Kashima Antlers * J.League Cup: 2012, 2013, 2015 * Suruga Bank Championship: 2013 ;Cerezo Osaka *J.League Cup: 2017 *Emperor's Cup: 2017 ;Kawasaki Frontale *J1 League: 2020, 2021 *Emperor's Cup: 2020, 2023 *J.League Cup: 2019 ===Japan=== ;Japan U-23 *Asian Games : 2010 ==References== ==Other websites== * Category:1989 births Category:Living people Category:Footballers from Nagasaki Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:Kashima Antlers players Category:Cerezo Osaka players Category:Kawasaki Frontale players Category:Footballers at the 2012 Summer Olympics",
 "title": "Kazuya Yamamura"
}