{
 "id": "334900",
 "text": "Cherokee County, Alabama is a county of the U.S. state of Alabama. It is named for the Cherokee tribe. As of 2020 the population was 24,971. Its county seat is Centre. It is a prohibition or dry county which means alcoholic drinks cannot be sold, except in the cities of Cedar Bluff, Centre, Leesburg, and Cherokee Ridge. == History == Cherokee County was formed by European Americans on January 9, 1836. The county was created on territory of the Cherokee Nation. The Cherokee were forcibly removed by the US government in what was known as the Trail of Tears in 1838. Cherokee County was created by the Alabama legislature on 1836 January 9 after the Treaty of New Echota, 1835 December 29. The Cherokee people did not accept the Treaty because the people who signed were not authorized. An F4 tornado struck here on Palm Sunday March 27, 1994. It destroyed Goshen United Methodist Church twelve minutes after the National Weather Service of Birmingham issued a tornado warning for northern Calhoun, southeastern Etowah, and southern Cherokee counties. 22 people were killed, including the groom's 4-year-old daughter. ==Geography== According to the United States Census Bureau, the county has a total area of , of which (or 92.19%) is land and (7.7%) is water. ===Major highways=== * U.S. Highway 278 * U.S. Highway 411 * State Route 9 * State Route 35 * State Route 68 ===Border counties=== *DeKalb County, Alabama - north *Chattooga County, Georgia - northeast *Floyd County, Georgia - east *Polk County, Georgia - southeast *Cleburne County, Alabama - south *Calhoun County, Alabama - south *Etowah County, Alabama - west ===National protected areas=== * Little River Canyon National Preserve (part) * Talladega National Forest (part) == Cities and towns == *Cedar Bluff *Centre (County seat) *Collinsville (part - part of Collinsville is in DeKalb County) *Gaylesville *Leesburg *Piedmont (part - part of Piedmont is in Calhoun County) *Sand Rock (part - part of Sand Rock is in DeKalb County) ==References== Category:Alabama counties Category:1836 establishments in the United States Category:1830s establishments in Alabama",
 "title": "Cherokee County, Alabama"
}