{
 "id": "335065",
 "text": "Utagawa Kuniyoshi (, ; January 1, 1798 – April 14, 1861) also called Kuniyoshi, was a Japanese artist. He was a masters of the ukiyo-e style of woodblock prints and painting.Nussbaum, Louis Frédéric et al. (2005). \"Kuniyoshi\" in Japan Encyclopedia, p. 576. ==Career== Kuniyoshi was part of the Utagawa school of artists.Nussbaum, \"Utagawa-ryū\" at p. 1018. The range of Kuniyoshi's subjects included landscapes, beautiful women, Kabuki actors, cats, and mythical animals. He is known images of the battles of samurai and legendary heroes.Lubow, Arthur. \"Everything But the Robots: A Kuniyoshi Retrospective Reveals the Roots of Manga,\" New York Magazine. March 7, 2010; retrieved 2012-3-29. His work was affected by Western art and caricature. Tsukioka Yoshitoshi was one of his students. His work influenced Toyohara Chikanobu.\"Yōshū Chikanobu [obituary],\" Miyako Shimbun, No. 8847, October 2, 1912. p. 195. Takashi Murakami credits the influence of Kuniyoshi in his work. ==List of print series== :This list is not finished; you can help Wikipedia by adding to it. * Illustrated Abridged Biography of the Founder (c. 1831) * Famous Views of the Eastern Capital (c. 1834) * Heroes of Our Country's Suikoden (c. 1836) * Stories of Wise and Virtuous Women (c. 1841-1842) * Fifty-Three Parallels for the Tōkaidō (1843–1845) * Twenty-Four Paragons of Filial Piety (1843–1846) * Mirror of the Twenty-Four Paragons of Filial Piety (1844–1846) * Six Crystal Rivers (1847–1848) * Fidelity in Revenge (c. 1848) * Twenty-Four Chinese Paragons of Filial Piety (c. 1848) * Sixty-Nine Stations along the Kisokaido (1852) * Portraits of Samurai of True Loyalty (1852) * 24 Generals of the Kai Provence (1853) ==Gallery== ===Multi-panel impressions, tryptichs=== File:Takiyasha the Witch and the Skeleton Spectre.jpg|Takiyasha the Witch and the Skeleton Spectre File:Kagesue, Takatsuna and Shigetada crossing the Uji river.jpg|Kajiwara Kagesue, Sasaki Takatsuna, and Hatakeyama Shigetada racing to cross the Uji River before the second battle of Uji during the Genpei WarKitagawa, Hiroshi et al. (1975). The Tale of the Heike, pp. 511-513. ===Yoko-e, a print in horizontal or \"landscape\" format=== File:Kuniyoshi Utagawa, At the shore of the Sumida river.jpg|At the shore of the Sumida River File:Kuniyoshi Utagawa, Mt fuji from Sumida.jpg| Mt fuji from Sumida Image:Kuniyoshi Utagawa, Pilgrims in the waterfall.jpg|Pilgrims in the waterfall ===Single panel format=== File:Kuniyoshi Utagawa, Banners for the boys festival.jpg|Banners for boys' day festival File:Kuniyoshi Utagawa, Courtesan in training.jpg|Courtesan in training Image:Suikoden.jpg|from the series Heroes of Our Country's Suikoden File:Eight Hundred Heroes of Our Country s Suikoden 12.jpg|from the series Heroes of Our Country's Suikoden Image:Hanagami Danjo no jo Arakage fighting a giant salamander.jpg|Hanagami Danjo no jo Arakage fighting a giant salamander File:Miyamoto Musashi killing a giant nue.jpg|Miyamoto MusashiNussbaum, \"Miyamoto Musashi\" at p. 650. killing a giant shark Image:Hatsuhana doing penance under the Tonosawa waterfall.jpg|Hatsuhana doing penance under the Tonosawa waterfall Image:Keyamura Rokusuke under the Hikosan Gongen waterfall.jpg|Keyamura Rokusuke under the Hikosan Gongen waterfall File:Kakinomoto no hitomaro.jpg|Kakinomoto no HitomaroNussbaum, \"Kakinomoto no hitomaro\" at p. 456. ===Themes=== Kuniyoshi made many images of cats. File:Cats_forming_the_caracters_for_catfish.jpg|Cats forming the characters for catfish File:Kuniyoshi Utagawa, For cats in different poses.jpg|Four cats in different poses File:Cats_suggested_as_the_fifty- three_stations_of_the_Tokaido.jpg|Cats suggested as The Fifty-three Stations of the Tōkaidō :. Kuniyoshi made images which were caricatures. File:Scrbbling on the storehouse wall.jpg|Scribbling on the storehouse wall File:At first glance he looks very fiarce, but he s really a nice person.jpg|At first glance he looks very fierce, but he is actually a kind person ==References== ==Other websites== * University of Vienna, Ukiyo-e Caricatures 1842-1905 * JapanSociety.org, Graphic Heroes, Magic Monsters * Kuniyoshi Project * Artencyclopedia.com, Utagawa Kuniyoshi * Artelino.com, Utagawa Kuniyoshi Kuniyoshi Category:1798 births Category:1861 deaths",
 "title": "Utagawa Kuniyoshi"
}