{
 "id": "335076",
 "text": "Clanton is a city in Chilton County, Alabama, United States. At the 2020 census the population was 8,768. The city is the county seat of Chilton County. ==History== The town was founded by Alfred Baker in 1868, when Chilton County was formed. Clanton was named in honor of General James H. Clanton, a brigadier in the Confederate States Army. It was incorporated on April 23, 1873. Baker was also elected first mayor of the town. Early Civil Rights activist Ida B. Wells made a photographic postcard showing an 1891 lynching in Clanton. This was to educate the white public of the atrocities committed against blacks. During World War II, a small German Prisoner of War camp was located in Clanton. ==Geography== Clanton is located at 32°50'23.316\" North, 86°37'41.477\" West (32.839810, -86.628188). According to the U.S. Census Bureau, the city has a total area of . is land and (0.15%) is water. ==Government== Clanton is governed by the mayor-council system. The mayor is elected in a citywide vote. The city council has five members elected from one of five wards. ==Economy== Over 80% of Alabama's peach crop comes from Chilton County. ==Education== The Chilton County School System provides public education for Clanton. Students in Clanton may attend any public school in Chilton County. ===High Schools=== * Chilton County High School (Grades 9 through 12) * LeCroy Technical Center (Grades 10 through 12) ===Middle School=== Clanton Middle School (Grades 6 through 8) ===Elementary Schools=== * Clanton Intermediate School (Grades 3 through 5) * Clanton Elementary School (Grades K through 2) ==Media== ===Newspaper=== * The Clanton Advertiser (daily) ==Culture and recreation== Clanton has hosted the annual Chilton County Peach Festival since 1952. ==Notable residents== * Randall Atcheson, Concert PianistStaff Reports, Atcheson plays 10th Carnegie Hall concert, November 17, 2010, \"The Clanton Advertiser\", Retrieved November 18, 2010 * Clay Carroll, Major League baseball player * Jackie Hayes, major league baseball player * Jackson W. Moore, former CEO of Union Planters Bank and Regions Financial Corporation * Jarrod Patterson, major league baseball player * Drew Roy, actor Scott Mims, Local stars in Spielberg series, returns to ‘Hannah Montana’, August 20, 2010, \"The Clanton Advertiser\", October 27, 2010 * Grayson Russell, Child actor ==References== Category:Cities in Alabama Category:County seats in Alabama Category:1868 establishments in Alabama",
 "title": "Clanton, Alabama"
}