{
 "id": "335160",
 "text": "Cullman County is a county of the U.S. state of Alabama. Its name is in honor of Colonel John G. Cullmann. As of 2020, 87,866 people lived there. Its county seat is the town of the same name, Cullman, Alabama. == History == The historic Cherokee and Choctaw lived here at the time of European encounter. The Echota Cherokee are a recognized tribe still here. Cullman County was formed by German American immigrants from Cincinnati, Ohio, in 1877. ==Geography== According to the United States Census Bureau, the county has a total area of , of which is land and (2.7%) is water. ===Major highways=== * Interstate 65 * U.S. Highway 31 * U.S. Highway 278 * U.S. Highway 231 * State Route 67 * State Route 69 * State Route 91 * State Route 157 ===Rail=== *CSX Transportation ===Border counties=== *Morgan County (north) *Marshall County (northeast) *Blount County (east) *Walker County (southwest) *Winston County (west) *Lawrence County (northwest) == Cities and towns == *Arab (part - most of Arab is in Marshall County) *Ardell *Arkadelphia *Baileyton *Battleground *Berlin *Bethel *Bremen *Birdsong *Bolte *Brooklyn *Brushy Pond *Bug Tussle *Central *Clifty *Colony *Corinth *Crane Hill *Cullman *Dodge City *East Point *Etha *Fairview *Garden City (part - part of Garden City is in Blount County) *Goldridge *Good Hope *Goodwin *Hanceville *Harmony *Holly Pond *Jones Chapel *Joppa *Logan *Panama *Providence *Riverside *Simcoe *South Vinemont *Thrasher Crossroads *Trade *Trimble *Walter *Welti *West Point *Wheat *Wilburn ==Education== Public education in Cullman County is provided by two systems: the Cullman City School Board and the Cullman County School Board, which governs all municipalities except the City of Cullman. *Cullman High School - under the governance of the Cullman City School Board Private educational institutions in the county include: *Christ Covenant School - in Cullman (Grades K-2) *Cullman Christian School - in Cullman (Grades K-12) *Sacred Heart of Jesus Catholic Elementary School - in Cullman (Grades PreK-6) *St. Bernard Preparatory School - in Cullman (Grades 7-12) *St. Paul's Lutheran School - in Cullman (Grades K-6) *Vinemont Christian Academy - in South Vinemont (Grades PreK-12) Cullman is also the home of the state-owned and operated Wallace State Community College in Hanceville. It was named for the former Governor of Alabama, George C. Wallace. His father and his wife, Governor Lurleen B. Wallace, also had junior colleges named for them. ==References== Category:Alabama counties Category:1877 establishments in the United States Category:1870s establishments in Alabama",
 "title": "Cullman County, Alabama"
}