{
 "id": "33515",
 "text": "Winter Olympic Games were originally considered to be linked with the nation hosting the Summer Olympic Games. The country holding the summer games was preferred as the host for the winter games.Organizing Committee of the XIIth Olympiad. (1940). Report of the Organizing Committee on Its Work for the XIIth Olympic Games of 1940 in Tokyo Until the Relinquishment, p. 127 [151 of 207 PDF]; retrieved 2012-7-25. Since 1948, the locations of summer and winter games have developed independent of each other. * 1924 - I Olympic Winter Games - Chamonix, France * 1928 - II Olympic Winter Games - St. Moritz, Switzerland * 1932 - III Olympic Winter Games - Lake Placid, New York, United States * 1948 - V Olympic Winter GamesThe 1940 Winter Olympics and the 1944 Winter Olympics were cancelled because of World War II. \\- St. Moritz, Switzerland * 1952 - VI Olympic Winter Games - Oslo, Norway * 1956 - VII Olympic Winter Games - Cortina d'Ampezzo, Italy * 1960 - VIII Olympic Winter Games - Squaw Valley, California, United States * 1964 - IX Olympic Winter Games - Innsbruck, Austria * 1968 - X Olympic Winter Games - Grenoble, France * 1972 - XI Olympic Winter Games - Sapporo, Japan * 1976 - XII Olympic Winter Games - Innsbruck, Austria * 1980 - XIII Olympic Winter Games - Lake Placid, New York, United States * 1984 - XIV Olympic Winter Games - Sarajevo, Yugoslavia * 1988 - XV Olympic Winter Games - Calgary, Alberta, Canada * 1992 - XVI Olympic Winter Games - Albertville, France * 1994 - XVII Olympic Winter Games - Lillehammer, Norway * 1998 - XVIII Olympic Winter Games - Nagano, Japan * 2002 - XIX Olympic Winter Games - Salt Lake City, Utah, United States * 2006 - XX Olympic Winter Games - Torino, Italy * 2010 - XXI Olympic Winter Games - Vancouver, British Columbia, Canada * 2014 - XXII Olympic Winter Games - Sochi, Russia * 2018 - XXIII Olympic Winter Games - Pyeongchang, South Korea * 2022 - XXIV Olympic Winter Games - Beijing, China * 2026 - XXV Olympics Winter Games - Milan and Cortina d'Ampezzo, Italy ==References== Category:Olympics-related lists",
 "title": "Winter Olympic Games"
}