{
 "id": "335185",
 "text": "In mathematics the Axiom of Choice, sometimes called AC, is an axiom used in set theory. The Axiom of Choice says that if you have a group of sets, each containing at least one object, it is possible to take one object out of each of these smaller sets and make a new set, even if there is no rule for selecting objects. You do not always need to use the Axiom of Choice to do this. You do not need to use the Axiom of Choice if the starting set is finite or if the starting set is infinite and has a rule built in for how it can be divided. For example, you could select the smallest number in a group of sets without using the Axiom of Choice even if there are infinite sets because there is a rule for selection. A non mathematical example would be for any (infinite or finite) collection of pairs of shoes, you can identify and pick out the left shoe from each pair. However, for an infinite collection of identical pairs of equal socks, where there is no way to tell apart the socks in each pair, you could not pick from each pair as there is no left or right sock. Therefore there is no rule of selection and so you would need the Axiom of Choice to create a new set. Accepting the Axiom of Choice leads to several important results in set theory and mathematics, which include: * Zorn's Lemma, which tells us that there is always a \"largest\" or \"most complete\" element in certain partially ordered sets, * Well-Ordering Theorem, which tells us that any collection of objects can be arranged in a specific order so that every group of objects has a \"smallest\" member, * Banach-Tarski Paradox, a mathematically valid proof that shows how a solid sphere can be split into pieces and rearranged (without stretching) to form two identical copies of the original sphere, * Tychonoff's Theorem, which is important in physics and engineering, that tells us if each of many small spaces is \"compact\" (roughly meaning limited in size and well-behaved), the combined space they share is also compact. If the Axiom of Choice is not accepted, some mathematical results may not hold, such as: * In algebra, some sets of numbers or functions might not have a simplest way to describe them, making them harder to study, * Some sets might not have a logical way to arrange them so that every group of elements has a smallest member, * Some useful tools in mathematics stop working, as many proofs rely on the Axiom of Choice, * Infinity behaves differently, because the Axiom of Choice helps us describe infinite sets and their behaviors. Most modern branches of mathematics will accept the Axiom of Choice, but some areas prefer to work without it to focus on explicit and constructible methods. Category:Set theory",
 "title": "Axiom of choice"
}