{
 "id": "335293",
 "text": "The is a list of famous scenic sites in Japan. This list was developed during the reign of the current emperor. The top three are Mount Fuji, Shosenkyo gorge in Yamanashi Prefecture, and Shiretoko in Hokkaido.\"100 Landscapes of Heisei announced,\" Yomiuri Shimbun. May 2009; retrieved 2012-3-30. == History == A national poll was part of creating the at the beginning of Emperor Hirohito's reign. The Nichi Nichi Shimbun and Mainichi Shimbun supported the selection process during 1927.Japan Ministry of the Environment, 日本八景(昭和2年)の選定内容 ; retrieved 2012-3-30. In 2009, the Yomiuri Shimbun sponsored an update. The newspaper and its readers selected the . This new selection was supported by the Ministry of Land, Infrastructure, Transport and Tourism. Three hundred sites were nominated and more than 640,000 votes were collected during the polling process. == Table == Landscape Prefecture Image ice floes Hokkaidō Hokkaidō Hokkaidō Hokkaidō Hokkaidō Hokkaidō Aomori Prefecture Aomori Prefecture Aomori Prefecture Akita Prefecture Aomori Prefecture Akita Prefecture Iwate Prefecture Akita Prefecture Yamagata Prefecture Yamagata Prefecture Miyagi Prefecture Miyagi Prefecture Fukushima Prefecture Fukushima Prefecture Gunma Prefecture Fukushima Prefecture Niigata Prefecture Tochigi Prefecture Ibaraki Prefecture Gunma Prefecture Saitama Prefecture Saitama Prefecture Saitama Prefecture Chiba Prefecture Chiba Prefecture Tokyo Tokyo Tokyo Tokyo at Sensō-ji Tokyo Tokyo Chiba Prefecture Tokyo Kanagawa Prefecture Kanagawa Prefecture Kanagawa Prefecture Kanagawa Prefecture Yamanashi Prefecture Shizuoka Prefecture Yamanashi Prefecture Yamanashi Prefecture Nagano Prefecture Toyama Prefecture Gifu Prefecture Gifu Prefecture Toyama Prefecture Nagano Prefecture Nagano Prefecture Nagano Prefecture Gifu Prefecture Niigata Prefecture Toyama Prefecture Ishikawa Prefecture Fukui Prefecture Fukui Prefecture Aichi Prefecture Gifu Prefecture Aichi Prefecture Shizuoka Prefecture Gifu Prefecture Mie Prefecture Shiga Prefecture Shiga Prefecture Kyoto Prefecture Kyoto Prefecture Kyoto Prefecture Kyoto Prefecture Nara Prefecture Nara Prefecture Nara Prefecture Osaka Prefecture Osaka Prefecture Osaka Prefecture Hyōgo Prefecture Hyōgo Prefecture Wakayama Prefecture Wakayama Prefecture Wakayama Prefecture Nara Prefecture Mie Prefecture Tokushima Prefecture Kochi Prefecture Ehime Prefecture Kagawa Prefecture Kagawa Prefecture Kagawa Prefecture Tokushima Prefecture Kochi Prefecture Ehime Prefecture Tottori Prefecture Shimane Prefecture Shimane Prefecture Okayama Prefecture Hiroshima Prefecture Hiroshima Prefecture Kintai Bridge Yamaguchi Prefecture Yamaguchi Prefecture Fukuoka Prefecture Saga Prefecture Nagasaki Prefecture Nagasaki Prefecture Kumamoto Prefecture Kumamoto Prefecture Oita Prefecture Oita Prefecture Miyazaki Prefecture Kagoshima Prefecture Kagoshima Prefecture Kagoshima Prefecture Okinawa Prefecture Okinawa Prefecture == Related pages == * 100 Landscapes of Japan (Shōwa period) == References == == Other websites == * Yomiuri Shimbun, Heisei Hyakkei Category:Japanese culture",
 "title": "100 Landscapes of Japan (Heisei period)"
}