{
 "id": "335268",
 "text": "The National Alliance on Mental Illness (NAMI), formerly known as the National Alliance for the Mentally Ill, is an American non-profit national advocacy organization founded in 1979 for people affected by serious mental illnesses and their families.Jeffrey Thomas. 2006. U.S. Nonprofit Group Is “Nation’s Voice on Mental Illness”. American Information Program. America Engaging the World. December 21. NAMI Start . NAMI has over 200,000 members, offices in all 50 states, and 1200 affiliates across the United States. NAMI is a :en:grassroots organization that is run primarily by volunteers.Committee on Veterans Affairs: Hearings. U.S. Senate Committee on Veterans' Affairs. U.S. Senate Committee on Veterans' Affairs Sub-hearing. NAMI and U.S. Govt.. ==NAMI Family-to-Family== The NAMI Family-to-Family Education Program is a free 12-week course targeted toward family and friends of individuals with mental illness. The courses are taught by a NAMI-trained family member of a person diagnosed with a psychiatric disorder. Family-to-Family is taught in 44 states, and two provinces in Canada. The program was developed by Clinical Psychologist Joyce Burland, PhD. === Purpose === The Family-to-Family program provides general information about mental illness and how it is currently treated. The programs cover mental illnesses including schizophrenia, depression, bipolar disorder, etc.), as well as the benefits and side effects of medications. Family-to-Family, like the rest of NAMI programs, takes a biologically-based approach to explaining mental illness and its treatments. In addition to providing information on mental illness, the Family-to-Family program teaches coping skills and the power of advocacy to students. Empathy is hoped to be gained by students' better understanding of the subjective experience of living with a mental illness. Special workshops also teach problem solving, listening, and communication techniques. Family-to-Family also provides advocacy support, offering family members guidance on locating support and services within surrounding areas, and information on current advocacy initiatives dedicated to improving available services. === Evidence based === The NAMI Family-to-Family program has been shown to empower families in the way they solve internal problems, and reduced the anxiety of participants in randomized controlled trials, a finding which was shown to persist 6 months later. These studies confirm preliminary findings that Family-to-Family graduates describe a permanent transformation in the understanding and engagement with mental illness in themselves and their family. Because a :en:randomized controlled trial is at risk of poor :en:external validity by :en:confirmation bias, Dixon and colleges sought out to strengthen the evidence basis by confirming the benefits attributed to Family-to-Family with a subset of individuals who declined participation during initial studies === Program origins === The NAMI Family-to-Family program was found to be effective in increasing schizophrenia patient caregivers' self-efficacy while reducing a subjective burden and need for information. In light of recent research, Family-to-Family was added to the National Registry of Evidence-Based Programs and Practices. == References == == Other websites == * NAMI.org - Official NAMI website * NAMIsanDiego.org - San Diego NAMI website * NAMIsfv.org - San Fernando Valley (Los Angeles area) NAMI website Category:1979 establishments in the United States Category:Non- profit organizations of the United States Category:Medical and health organizations in the United States",
 "title": "National Alliance on Mental Illness"
}