{
 "id": "335232",
 "text": "Islam in China has a rich and longstanding history in the country. Islam has been practiced in China since the 7th century CE.. There are an estimated 17–25 million Muslims in China, less than 2 percent of the total population. Though Hui Muslims are the most numerous group, the greatest concentration of Muslims reside in northwestern China’s Xinjiang autonomous region, which contains a significant Uyghur population. Lesser yet significant populations reside in the regions of Ningxia, Gansu and Qinghai. Of China's 55 officially recognized minority peoples, ten of these groups are predominantly Sunni Muslim. Manchu officials in the Qing executed a Muslim family in 1784 in Xinjiang because their relatives revolted in Gansu despite the fact they had no idea their relatives were revolting. Hundreds of thousands of Turkic Muslims have been detained in Xinjiang. There is a policy of stripping Muslim buildings of Arabic features all over China, and in some cases replacing them with traditional Chinese designs. During Deng Xiaoping’s liberal era, a new mosque-building boom began, with a fashion for domed prayer halls and tall, slender minarets. Xi Jinping became president in 2013. In 2017, the Islamic Association of China said “Mosque architecture needs to be in harmony with our national characteristics.” In 2019 the “Five-Year Plan on the Sinicisation of Islam”, set out to standardise Chinese style in everything from Islamic clothing to ceremonies and architecture. It called for the “establishment of an Islamic theology with Chinese characteristics”. At least 1,714 mosques had Arabic-style features removed between 2018 and 2023. The government also removed crosses from the roofs of over a thousand Christian churches and demolished a vast church — the Golden Lampstand Church in Shanxi province — in 2018. The government is also trying to stop under-18s from entering religious sites, or even practising religion at all. ==References== ==Other websites== *\"A Sketch of the Islamic Law\" is an old book, from the year 1797, made in China Category:Religion in China C",
 "title": "Islam in China"
}