{
 "id": "335687",
 "text": "Speed skating or speedskating is an ice skating race, usually around an oval course. Skaters compete against each other, and everyone travels the same distance. Speed skating events almost always follow the European system, where skaters compete two-by-two. == History == === 13th to 19th centuries === As far back as the 13th century, Dutch people used skating as a tool for communication. They skated from village to village along on frozen canals to exchange information. Skating eventually spread across the English Channel to England. Soon the first skating clubs and artificial rinks formed. Several kings of England, Marie Antoinette, German writer Johann Wolfgang von Goethe, and Napoleon III were all passionate skaters. The first known skating competition in history happened in the Netherlands in 1676. However, the first official speed skating events were not held until 1863 in Oslo, Norway. In 1889, the Netherlands hosted the first World Championships, bringing together Dutch, Russian, American and English teams. === 20th century === Speed skating first appeared in the Olympic Games in 1924, at the very first Winter Olympic Games in Chamonix. Initially, only men were allowed to participate. ==== 1932 Olympic controversy ==== The 1932 Olympic Games were held in Los Angeles, California. In European-style speed skating, skaters compete two by two. However, the American organizers created an American-style competition: they planned for all of the speed skaters to start a single race at the same time. In response, many European competitors boycotted the competition, which allowed the United States to win the event's four gold medals. ==== Inclusion of women ==== The 1932 Olympic Games were the first that allowed women to compete in speed skating (which was only a demonstration sport at the time). However, women's speed skating was not officially included in the Olympic programme until the 1960 Olympic Games in Squaw. ==== New style of speed skating ==== Despite the controversy at the 1932 Olympics, the American-style system gave birth to short-track speed skating, which was added to the Olympic programme in Albertville, France, in 1992. ==References== ==Other websites== ka:ციგურებით ჩქაროსნული სრიალი",
 "title": "Speed skating"
}