{
 "id": "336174",
 "text": "A nursery is a school for children between the ages of one and five years. It is a preschool education institution, part of a child's education.Encarta definition of nursery school , accessed August 1, 2007. 2009-11-01. Nurseries take care of young children during the day while providing a safe, fun and educational environment. Most nurseries provide toys and a outdoor playground with equipment. ==Names== Nursery kindergarten (children's garden), is a name given by Friedrich Fröbel, who created the Nurseru in Germany, in 1837. Other common names are pre-school, playschool and playgroup. The German word Kindergarten is also used in many non-English-speaking countries to denote a form of pre-school education.Kindergarten definition from Microsoft Encarta 2004 CD edition However, in the United States, Canada, and some parts of Australia, kindergarten is instead the term used to describe the first year of compulsory schooling. The word kindergarten is not generally used in the UK. == United Kingdom == In the UK, most children start nursery at two or three years old and move on to primary school the academic year they turn five. Some nurseries can take care of babies as young as 3-6 months old. These nurseries are often called day nurseries or daycares. Some nurseries are called children’s centres. Some nurseries have separate rooms for different age groups. Preschools in the UK are mainly designed for children from toddler age to five years. Increasing the number of nurseries in England is part of the plan of the Government to get more women to get jobs. Working parents of three and four-year-olds in England are eligible for 30 hours of free childcare per week. Parents of 2-year-olds can get 15 hours free childcare if they get means-tested benefits or if the child is disabled. The rules are slightly different in Wales and Scotland. Jeremy Hunt announced plans to let more parents get free places in March 2023, but since then nurseries have found it difficult to get people to work for them and more than 3000 have closed. It may cost £2,000 a month for a full-time place. ==References== Category:Types of educational institutions Category:Childhood",
 "title": "Nursery"
}