{
 "id": "336257",
 "text": "South Africa has nine provinces.https://southafrica-info.com/land/nine- provinces-south-africa/ Just before the 1994 general election, the number of provinces went up from four to nine, because all the Bantustans became provinces. Provinces have their own government, led by a Premier. == List == Province Name in the most spoken native languagehttp://www.statssa.gov.za/census/census_2011/census_products/Census_2011_Census_in_brief.pdf, p. 25. Capital Largest city Area Population (2022) Density (2022) Map Eastern Cape Bhisho (Bisho) Gqeberha (Port Elizabeth) 7,230,204 Free State Bloemfontein Bloemfontein 2,964,412 Gauteng Johannesburg Johannesburg 15,099,422 KwaZulu-Natal PietermaritzburgPietermaritzburg and Ulundi were joint capitals of KwaZulu-Natal from 1994 to 2004. Durban 12,423,907 Limpopo Polokwane (Pietersburg) Polokwane 6,572,720 Mpumalanga Mbombela (Nelspruit) Mbombela 5,143,324 North West Mahikeng (Mafikeng) Rustenburg 3,804,548 Northern Cape Kimberley Kimberley 1,355,946 Western CapeThese statistics do not include the Prince Edward Islands (, with no permanent residents), which are South African territories in the sub-Antarctic Indian Ocean but part of the Western Cape for legal and electoral purposes. Cape Town Cape Town 7,433,019 Republic of South Africa Pretoria, Bloemfontein Cape TownParliament sits in Cape Town, the Supreme Court of Appeal in Bloemfontein, and the Executive branch in Pretoria. Johannesburg 62,027,503 Footnotes: === Provincial acronyms === Province HASC ISO FIPS CSS Conventional Eastern Cape ZA.EC EC SF05 02 EC Free State ZA.FS FS SF03 04 FS Gauteng ZA.GT GP SF06 07 GP KwaZulu-Natal ZA.NL KZN SF02 05 KZN Limpopo ZA.NP LP SF09 09 LP Mpumalanga ZA.MP MP SF07 08 MP Northern Cape ZA.NC NC SF08 03 NC North-West ZA.NW NW SF10 06 NW Western Cape ZA.WC WC SF11 01 WC Notes HASC: Hierarchical administrative subdivision codes ISO: Province codes from ISO 3166-2. For full identification in a global context, prefix \"ZA-\" to the code FIPS: Codes from FIPS PUB 10–4, a U.S. government standard. CSS: Province codes used by the Central Statistical Service of South Africa. == Former administrative divisions == Province Capital Peak population Location Cape of Good Hope (1910–1994) Cape Town 6,125,335 Natal (1910–1994) Pietermaritzburg 2,430,753 Orange Free State (1910–1994) Bloemfontein 2,193,062 Transvaal (1910–1994) Pretoria 9,491,265 Homelands Capital Peak population Location Bophuthatswana (1977–1994) † Mmabatho 1,478,950 Ciskei (1972–1994) † Bisho 677,920 Gazankulu (1971–1994) Giyani 954,771 KaNgwane (1981–1994) Louieville Schoemansdal (de facto) 779,240 KwaNdebele (1981–1994) KwaMhlanga 404,246 KwaZulu (1981–1994) Nongoma (until 1980) Ulundi (1980–1994) 5,524,774 Lebowa (1972–1994) Lebowakgomo 2,740,587 QwaQwa (1974–1994) Phuthaditjhaba 342,886 Transkei (1976–1994) † Umtata 2,323,650 Venda (1979–1994) † Thohoyandou 558,797 Mandates Capital Peak population South West Africa Windhoek 1,415,000 Footnotes: :† States for which the homeland was quasi-independent. ==References==",
 "title": "Provinces of South Africa"
}