{
 "id": "336442",
 "text": "Apples and oranges is a common English idiom. It is used to describe unlike objects or people.Amer, Christine. 1997. The American Heritage Dictionary of Idioms. p19 One of the most well-known bits of popular wisdom in the English- speaking world is that apples and oranges cannot be compared.Glenn, Patrick. 2007. Legal traditions of the world: sustainable diversity in law, p43. The ability to tell apples from oranges is learned.Fahle M. 2005. \"Learning to tell apples from oranges,\" Trends in Cognitive Science. 9(10):455-7; excerpt, \"sorting them into the correct perceptual categories. Without categories, apples could not be discriminated from oranges\"; retrieved 2012-4-4. The phrase is almost always used along with a warning that things in different categories cannot be compared, or that the comparison is improper. ==History== This idiom began as a comparison of \"apples and oysters\" in a book of proverbs published in 1670.Amer p19, citing John Ray. 1670. A collection of English proverbs. This idiom has become a marker in English-speaking culture. Idioms are a common stumbling block for learners of a language. ===Variants=== The idiom is not uniquely English. In French-speaking Quebec, the idiom is comparer des pommes avec des oranges (to compare apples and oranges), In Europe, the French idiom is comparer des pommes et des poires (to compare apples and pears). In Latin America, the Spanish idiom is comparar papas y boniatos (comparing potatoes and sweet potatoes) or comparar peras con manzanas (comparing pears and apples). In British English, the phrase chalk and cheese means the same thing as apples and oranges. ==Comparison== In order to compare anything, there needs to be a theory to be proven and framework for testing the theory. Three basic questions come first: # What are we comparing? # Are the subjects good for comparing? # Do the measures of comparison function in the same or similar ways? ==Scientific research== The idiom has inspired scientific research projects. For example, the British Medical Journal published a study of red delicious apples compared with navel oranges. They were found to have many similarities.Barone, James E. \"Comparing apples and oranges: a randomised prospective study,\" British Journal of Medicine (BMJ). 2000 December 23; 321(7276): 1569–1570; retrieved 2012-4-4. There are differences in nutritional value.RoadtoNutrition.com, \"Orange juice vs. apple juice\" ; retrieved 2012-4-4. Experiments at NASA Ames Research Center showed that apples and oranges decay at similar rates.Improbable.com citing Scott. (1995). \"Apples and Oranges -- a comparison,\" NASA Ames Research Center. ==Related pages== * Premise * False dilemma ==References== ==Further reading== * Cummins RO, Hazinski MF. \"Apples and oranges,\" Annals of Emergency Medicine (Ann Emerg Med). 1999;33:602–603. * Johnson W. \"Comparing apples with oranges,\" Archives of Internal Medicine (Arch Intern Med). 1998;158:1591–1592. * Lubarsky DA. \"Comparing apples to oranges,\" Anesthesia and Analgesia. (Anesth Analg). 1995 Aug;8:428–429. * Moayyedi P. \"Meta-analysis: can we mix apples and oranges?\" American Journal of Gastroentrology (Am J Gastroenterol). 2004 Dec;99(12):2297-301. ==Other websites== * Smithsonian.com, Comparing Apples and Oranges Category:Idioms Category:Apples Category:Citrus Category:Comparisons",
 "title": "Apples and oranges"
}