{
 "id": "336578",
 "text": "Major Lance (April 4, 1939,Major Lance profile Oldies.com - September 3, 1994) was a solo singer. 'Major' was his given name; it was not a nickname or stage name.Major Lance Biography The Northern Soul Nightshift Born in Winterville, Mississippi. Although he was arrested a couple of times in his life and his earliest records were not successful, Lance was most known for his music hits in the United States called \"Monkey Time\" and \"Um, um, Um, Um, Um, Um\". He was considered the most successful Okeh artist.Continuum Encyclopedia of Popular Music of the World, Volume 1 p. 746 After these hits, he became an iconic figure in Britain, where he lived throughout in the 1970s, among followers of Northern soul. Lance continued to tour and perform at clubs and music festivals, such as in the United Kingdom and England, until he died in 1994 from a certain heart attack at the age of 55. Lance is buried in Homewood, Illinois. ==Early Days== Major Lance was born in Winterville, Mississippi. There has been something confusing over Lance's birth year; some sources say he was born 1941Soul music A-Z 1995 p. 185On This Day in Music History p. 96 or 1942 (as Lance claimed),The golden age of American rock 'n roll: Volume 3; 2002 p. 556Rhythm and Blues, Rap, and Hip-hop p. 161 while his gravestone states he was born in 1939. 'Major' was his given name; it was not a nickname or stage name. Major Lance was one of 12 children. One of his hobbies was playing Baseball.Billboard August 10, 1963 p. 16 Lance moved with his family on the northwest side of Chicago in the Cabrini-Green projects,Knocking on Heaven's Door: Rock Obituaries. 2006. p. 390 where there was a lot of crime in the area, as a child. After moving to Chicago, he developed a boyhood friendship with another singer named Otis Leavill Cobb. They both attended Wells High School. This was the same school Curtis Mayfield and Jerry Butler, who were also both singers too, went to.Contemporary Black biography: Volume 43 p. 136 Mayfield called him a \"sparkly fellow, and a great basketball player, which is probably how we met. His hero was Jackie Wilson, and he was always coming round and looking through my bag for songs that I'd written but didn't want to do with the Impressions. He was pretty good at picking them, too.\" Lance and Otis both toke boxing and were also singing as members of the Five Gospel Harmonaires.[ Biography of Otis Leavill Cobb by Andrew Hamilton at AllMusic]. Accessed April 15, 2012Biography at Soulwalking.co.uk Both of them also worked together at a drug store. ==Career== Lance and Otis Leavill formed a group named the Floats in the mid-1950s. However, they broke up before recording any songs. But Lance became a featured dancer on a local TV show named \"Time for Teens\",Doowop: the Chicago scene p. 197 and presenter Jim Lounsbury gave him a one-off record deal with Mercury Records. Mercury released his single \"I Got a Girl\", written and produced by Curtis Mayfield, in 1959, which was not successful. Because of this, Lance worked at various jobs over the next few years. Lance signed with OKeh Records in 1962 as Curtis Mayfield recommended. Major was constantly showing up at the Okeh offices, offering to run errands for Carl Davis, telling him about the record he'd once made and how he and Curtis Mayfield were friends from their childhood. Major Lance's first single was called \"Delilah\", which was made by Curtis Mayfield. Although it was not successful, it made his partnership with a writing and arranging team for Curtis Mayfield, Carl Davis, and Johnny Pate, often with members of Mayfield's music group called The Impressions on backing vocals. Together they made a distinctive, Latin-tinged sound which epitomised Chicago soul unlike other music. Major Lance's second Okeh single was called \"The Monkey Time\". This song was also written by Mayfield. Unlike his first Okeh single, Monkey Time was a success, becoming #2 on the Billboard R&B; chart. It was also the #8 pop hit in 1963. \"The Monkey Time\" became Okeh's first hit single for 10 years. His hits quickly became more successful, including \"Hey Little Girl\", \"Um, Um, Um, Um, Um, Um\" (his biggest hit, reaching #5 in the US pop chart and #40 in the UK, where it was his only chart success. It was also one of the top 100 on the Billboard chart in 1964), \"The Matador\" (the only one not written by Mayfield), \"Rhythm\", \"Sometimes I Wonder\", \"Come See\", and \"Ain't It A Shame\". Lance and Davis continued to work together, during the time Pate and Mayfield left Okeh Records. \"Too Hot To Hold\" was a minor hit, but they had poor success before Davis left the company in turn. During this period, Lance toured in the United Kingdom. This is where he was supported by Bluesology, a band including pianist Reggie Dwight (Reggie was later known as Elton John.).Profiles in Popular Music p. 78 Over the next two years he began working with several music producers. Soon after Lance left OKeh Records in 1968 and moved to Dakar Records, where he had the Top 40 R&B; hit \"Follow the Leader.\" He then moved to Mayfield's label named Curtom Records, which resulted in his last two Top 40 R&B; hits, \"Stay Away From Me (I Love You too Much)\" and \"Must Be Love Coming Down.\" One of Lance's song recorded at Curtom called \"Stay Away From Me\" was listed #4 in Jet Magazine's \"Soul Brothers Top 20\". He left Curtom in 1971, and recorded for Volt and Columbia Records labels for a short amount of time. Lance moved to England in 1972. He was to become \"legendary as a UK club act, known to deliver 110% at every performance.\" During his time in England, he recorded an album, Major Lance's Greatest Hits Recorded Live At The Torch, recorded at The Torch, a club in Stoke-on-Trent, which has been described as \"perhaps the best Northern Soul album ever made\". Lance returned to Atlanta in 1974. He recorded an updated disco version of \"Um, Um, Um, Um, Um, Um\" for Playboy Records.Billboard September 7, 1974 p. 18 He set up a new label, Osiris, with Al Jackson, a former drummer for Booker T and the MG, but again with little success, and his songs became less popular. But later found that his recordings had become popular on the beach music circuit in the Carolinas, where he continued to perform at live performances. He recorded a comeback album, The Major's Back, and several tracks for the Kat Family label. ==Personal life== Major Lance was married to Christine Boular Lance, and had nine children. He was 6'6 foot tall.Rock N Roll Gold Rush: A Singles Un-Cyclopedia p. 250 Lance was arrested two times in his life. In 1965, Lance was arrested in violation of the Paternity Act. A Chicago Women, Para Lee Thomas, told she had a son named Ronnie Maurice Lance (born ). She declared Lance who promised to pay her doctor and hospital bills around $375, but defaulted in the payment. Judge Benjamin J. Kanter issued for the arrest, setting Lance's bond at $1,000. After recording briefly for the Motown Records subsidiary label Soul in 1978, he was convicted of cocaine possession and was sentenced to four years in Jail. In 1987, Lance was diagnosed with a heart attack, and he became nearly blind from glaucoma. As a result, he made no more recordings since. In June 1994, he gave his final performance at the 11th Chicago Blues Festival. In September of that year, he died in his sleep at the age of 55 of heart disease in Decatur, Georgia. He was survived by his family. He is buried at Washington Memory Gardens Cemetery in Homewood, Illinois. ==Discography== ===Singles=== Year Title Label & Cat. No. U.S. R&B; U.S. Pop UK 1959 \"I Got a Girl\"I Got a Girl. AllMusic. Accessed from April 10, 2012. Mercury 71582 - - - 1962 \"Delilah\"Delilah. AllMusic. Accessed from April 10, 2012. Okeh 7168Major Lance Okeh Discography . Accessed from April 10, 2012 \\- - - 1963 \"The Monkey Time\"Monkey Time. AllMusic. Accessed from April 10, 2012. Okeh 7175 2 8 - 1963 \"Hey Little Girl\" Okeh 7181 12 13 - 1964 \"Um, Um, Um, Um, Um, Um\"Um Um Um Um Um Um. AllMusic. Accessed from April 10, 2012. Okeh 7187 1* 5 40 1964 \"The Matador\"Matador AllMusic. Accessed from April 10, 2012. Okeh 7191 4* 20 - 1964 \"Girls\"Girls. AllMusic. Accessed from April 10, 2012. Okeh 7197 25* 68 - 1964 \"It Ain't No Use\"It Ain't No Use. AllMusic. Accessed from April 10, 2012. Okeh 7197 33* 68 - 1964 \"Think Nothing About It\"Think Nothing About It. AllMusic Accessed from April 10, 2012. Okeh 7200 \\- - - 1964 \"Rhythm\"Rhythm. AllMusic. Accessed from April 10, 2012. Okeh 7203 3* 24 - 1965 \"Sometimes I Wonder\"Sometimes I Wonder. AllMusic. Accessed from April 10, 2012. Okeh 7209 13 64 - 1965 \"Come See\"Come See. AllMusic. Accessed from April 10, 2012. Okeh 7216 20 40 - 1965 \"Ain't It a Shame\"Ain't It a Shame. AllMusic. Accessed from April 10, 2012. Okeh 7223 20 91 - 1965 \"Too Hot to Hold\"Too Hot to Hold. AllMusic. Accessed from April 10, 2012. Okeh 7226 32 93 - 1965 \"Everybody Loves a Good Time\"Everybody Loves a Good Time. AllMusic. Accessed from April 10, 2012. Okeh 7233 \\- 109 - 1966 \"Investigate\"Investigate. AllMusic. Accessed from April 10, 2012. Okeh 7250 \\- 132 - 1966 \"It's the Beat\"It's the Beat. AllMusic. Accessed from April 10, 2012. Okeh 7255 37 128 - 1967 \"Ain't No Soul (In These Old Shoes)\"Ain't No Soul (In These Old Shoes). AllMusic. Accessed from April 10, 2012. Okeh 7266 \\- - - 1967 \"You Don't Want Me No More\"You Don't Want Me No More. AllMusic. Accessed from April 10, 2012. Okeh 7284 \\- - - 1968 \"Without a Doubt\"Without a Doubt. AllMusic. Accessed from April 10, 2012. Okeh 7298 49 - - 1969 \"Follow the Leader\"Follow the Leader. AllMusic. Accessed from April 10, 2012. Dakar 608 28 125 - 1969 \"Sweeter As the Days Go By\"Sweeter as the Days Go By. AllMusic. Accessed from April 10, 2012. Dakar 612 - - - 1970 \"Stay Away From Me (I Love You Too Much)\"Stay Away From Me. AllMusic. Accessed from April 10, 2012.Stay Away from Me (I Love YouToo Much). AllMusic. Accessed from April 10, 2012. Curtom 1953 13 67 - 1970 \"Must Be Love Coming Down\"Must Be Love Coming Down. AllMusic. Accessed from April 10, 2012. Curtom 1956 31 119 - 1971 \"Girl Come On Home\"Girl Come on Home. AllMusic. Accessed from April 10, 2012. Volt 4069 - - - 1971 \"I Wanna Make Up (Before We Break Up)\"I Wanna Make up (Before We Break Up). AllMusic. Accessed from April 10, 2012. Volt 4079 - - - 1972 \"Ain't No Sweat\"Ain't No Sweat. AllMusic. Accessed from April 10, 2012. Volt 4085 - - - 1974 \"Um, Um, Um, Um, Um, Um\" New version Playboy 6017 59 - - 1975 \"Sweeter As the Days Go By\" New version Playboy 6020 58 - - 1975 \"You're Everything I Need\" Osiris 001 50 - - 1975 \"I've Got a Right To Cry\" Osiris 002 - - - 1977 \"Come What May\" Columbia 10488 - - - 1978 \"I Never Thought I'd Be Losing You\" Soul 35123 - - - 1982 \"I Wanna Go Home\" Kat Family 3024 - - - 1982 \"Are You Leaving Me\" Kat Family 4182 - - - * Billboard magazine did not publish an R&B; chart during 1964; these chart positions are from Cashbox magazine. ===Selected albums=== * The Monkey Time (OKeh 1963) * Um, Um, Um, Um, Um, Um (OKeh 1964) * The Rhythm of Major Lance (OKeh 1968) * Major Lance's Greatest Hits Recorded Live At The Torch (Contempo 1973) * Now Arriving (Soul 1978) * The Major's Back (1983) * Live At Hinkley (1986) * Um, Um, Um, Um, Um, Um (Collectables 2003) ==References== Category:1939 births Category:1994 deaths Category:African- American musicians Category:American soul musicians Category:Musicians from Mississippi",
 "title": "Major Lance"
}