{
 "id": "336735",
 "text": "Audrey Justine Tautou (born in Beaumont on 9 August 1976) is a French actress and model. She made her acting debut at 18 on television and the following year in the feature film in Venus Beauty Institute (1999) when she won the César Award for Most Promising Actress. Tautou got recognition for her work in the 2001 film Amélie, which was a box office success. She has been nominated three times for the César Award and twice for the BAFTA Award for Best Actress in a Leading Role. She became one of the few French actors in history to have been invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in June 2004; she is a member of the Academy since 1 September 2006. Tautou has modeled for companies such as Chanel, Montblanc, L'Oréal, and others. ==Early life== Tautou was born in Beaumont in the Puy-de-Dôme department, France, and was raised together with her two sisters and his brother in the city of Montluçon (Allier, Auvergne-Rhône-Alpes). Her father is a dental surgeon, and her mother is a teacher. Tautou started her acting lessons at the Cours Florent, an acting school in Paris. ==Movies== These are the movies where Tautou has acted: Title Year Role Chinese Puzzle (Casse-tête chinois) 2013 Martine Mood Indigo (L’Écume des jours) 2013 Chloé Thérèse Desqueyroux 2012 Thérèse Desqueyroux Delicacy (La délicatesse) 2011 Nathalie Full Treatment (De vrais mensonges) 2010 Emilie Dandrieux Coco Before Chanel (Coco avant Chanel) 2008 Gabrielle 'Coco' Chanel Hunting and Gathering (Ensemble, c'est tout) 2007 Camille Priceless (Hors de prix) 2006 Irène The Da Vinci Code 2006 Sophie Neveu The Russian Dolls (Les poupées russes) 2005 Martine A Very Long Engagement (Un long dimanche de fiançailles) 2004 Mathilde Nowhere to Go But Up (Happy End) 2003 Val Chipzik Not on the Lips (Pas sur la bouche) 2003 Huguette Verberie Les marins perdus 2003 Lalla Dirty Pretty Things 2002 Senay Pot Luck (L'Auberge espagnole) 2002 Martine He Loves Me... He Loves Me Not (À la folie... pas du tout) 2002 Angélique God Is Great and I'm Not (Dieu est grand, je suis toute petite) 2001 Michèle Amélie (Le fabuleux destin d'Amélie Poulain) 2001 Amélie Poulain Happenstance (Le battement d'ailes du papillon) 2000 Irène Le libertin 2000 Julie d'Holbach Pretty Devils (Voyous voyelles) 2000 Anne-Sophie Épouse-moi 2000 Marie-Ange Triste à mourir 1999 Caro Venus Beauty Institute (Vénus beauté (institut)) 1999 Marie ===TV Movies=== Year Title Role Notes 1999 Le Boiteux Blandine Piancet TV movie, episode: Baby blues 1998 Julie Lescaut Tracy TV movie, episode: Bal masqué 1998 Chaos technique Lisa TV movie 1998 Bébés boum Elsa TV movie 1998 La Vieille Barrière A girl in the district TV movie 1997 Les Cordier, juge et flic Léa TV movie, episode: Le Crime d'à côté 1997 La Vérité est un vilain défaut The telephone operator TV movie 1996 Cœur de cible TV movie ==References== == Other websites == * * Audrey Tautou in NNDB Category:1976 births Category:Living people Category:French movie actors Category:French television actors Category:Actors from Auvergne-Rhône-Alpes Category:People from Puy-de-Dôme",
 "title": "Audrey Tautou"
}