{
 "id": "336937",
 "text": "The Downtown Line (DTL), is the fifth Mass Rapid Transport line in Singapore, the third to be completely underground, and with 3-car trains, the second medium capacity line. Currently open from Bukit Panjang to Expo. The line opened up in phases, such as Stage 1 in December 2013, Stage 2 in December 2015 and Stage 3 in October 2017. The line is colored blue on the MRT Rail map. ==Overview== The downtown line starts in Bukit Panjang, where it then passes through the Creative cluster and school belt of Bukit Timah. Along the way, it passes through many food enclaves, such as at Newton. It then passes through the downtown core and financial district before heading east, towards Bedok, Tampines and the Singapore Expo. ==History== Stage 1 of the Downtown Line was originally planned as the Downtown Extension of the Circle Line since 2005. It was planned to have 6 stations from Bugis and end at Chinatown. It opened on 22 December 2013. The section would have run parallel to the Circle Line from Bayfront to Promenade. Stage 2 was originally planned as the Bukit Timah Line, and was to terminate at Nicoll Highway, but plans were changed after the Nicoll highway collapse, which deemed the original station unfit for use. It was merged with the Downtown Line in 2005. It opened on 27 December 2015. Stage 3 was originally planned as the Eastern Region Line, and was meant to relieve congestion on the East West Line. The northern part of the line from Expo to Chinatown was replaced by Downtown Line Stage 3 and opened on 21 October 2017. Hume Station (DT4) is an infill station between Hillview (DT3) and Beauty World (DT5) that opened on 28 February 2025. Stage 3e is a two station extension that would link the Downtown Line and the Thomson-East Coast Line at Sungei Bedok. It would be completed around 2026. Stage 2e is a two station extension from Bukit Panjang that would link the Downtown Line and North South Line at Sungei Kadut. Construction of the extension would begin by the forth quarter of 2025, and it would be completed in 2035. ==Stations== Below are the announced station names for all five stages of the Downtown Line. Station Number Station Name 站名 Interchange/Notes Stage 2e (under planning, to be completed in 2035) Stage 2e (under planning, to be completed in 2035) Stage 2e (under planning, to be completed in 2035) Stage 2e (under planning, to be completed in 2035) Sungei Kadut 双溪加株 Stage 2 Stage 2 Stage 2 Stage 2 Bukit Panjang 武吉班让 Bukit Panjang LRT Line Cashew 凯秀 Hillview 山景 Hume 谦道 Beauty World 美世界 King Albert Park 阿尔柏王园 Sixth Avenue 第六道 Tan Kah Kee 陈嘉庚 Botanic Gardens 植物园 Stevens 史蒂芬 Thomson–East Coast line Newton 纽顿 Little India 小印度 Rochor 梧槽 Stage 1 Stage 1 Stage 1 Stage 1 Bugis 武吉士 Promenade 宝门廊 Bayfront 海湾舫 Downtown 市中心 Telok Ayer 直落亚逸 Chinatown 牛车水 Stage 3 Stage 3 Stage 3 Stage 3 Fort Canning 福康宁 Bencoolen 明古连 Jalan Besar 惹兰勿刹 Bendemeer 明地迷亚 Geylang Bahru 芽笼峇鲁 Mattar 玛达 MacPherson 麦波申 Ubi 乌美 Kaki Bukit 加基武吉 Bedok North 勿洛北 Bedok Reservoir 勿洛蓄水池 Tampines West 淡滨尼西 Tampines 淡滨尼 Tampines East 淡滨尼东 Upper Changi 樟宜上段 Expo 博览 Stage 3e (under construction, to be completed in 2026) Stage 3e (under construction, to be completed in 2026) Stage 3e (under construction, to be completed in 2026) Stage 3e (under construction, to be completed in 2026) Xilin 锡林 Sungei Bedok 双溪勿洛 ==References== ==Other websites== * The official MRT map , released by the Land Transport Authority showing the Downtown Line Category:2013 establishments in Asia Category:2010s establishments in Singapore Category:Mass Rapid Transit (Singapore) lines",
 "title": "Downtown MRT line"
}