{
 "id": "337231",
 "text": "Jennifer Tilly (born Jennifer Ellen Chan, born September 16, 1958) is an American-born Canadian actress. She was born in Harbor City, Los Angeles, California. Her father was Chinese American; her mother was of Irish, Finnish and Native American ancestry. Tilly's sister is actress Meg Tilly (born 1960). Tilly's acting career began in 1983. She acted in Bound, Liar Liar and as Tiffany Valentine in the Child's Play series. She plays Bonnie Swanson in television series Family Guy. == Film == Year Title Role Notes 1984 No Small Affair Mona 1985 Moving Violations Amy Hopkins 1986 Inside Out Amy 1987 He's My Girl Lisa 1988 Remote Control Allegra James Johnny Be Good Connie Hisler Rented Lips Mona Lisa High Spirits Miranda 1989 Far from Home Amy Let It Ride Vicki The Fabulous Baker Boys Blanche \"Monica\" Moran 1991 The Doors Okie Girl Uncredited Scorchers Talbot 1992 Shadow of the Wolf Igiyook 1993 Made in America Stacy 1994 The Getaway Fran Carvey Double Cross Melissa Bullets over Broadway Olive Neal Nominated for Academy Award 1995 Embrace of the Vampire Marika Bird of Prey Kily Griffith Man with a Gun Rena Rushton / Kathy Payne The Pompatus of Love Tarzaan 1996 Edie & Pen Edie Piper Bound Violet American Strays Patty Mae House Arrest Cindy Figler 1997 Liar Liar Samantha Cole The Wrong Guy Lynn Holden 1998 Music from Another Room Nina Relax...It's Just Sex Tara Ricotto Hoods Mary Crippa Bride of Chucky Tiffany 1999 The Muse Herself Bartok the Magnificent Piloff (voice) Direct-to-video Goosed Charlene Do Not Disturb Cathryn Stuart Little Camille Stout (voice) Play It to the Bone Ringside Fan 2000 Cord (also released as Hide and Seek) Helen Bruno Dolores The Crew Ferris \"aka Maureen\" Lowenstein Dancing at the Blue Iguana Jo 2001 Dirt Hooker Fast Sofa Ginger Quail The Cat's Meow Louella Parsons Ball in the House Dot Monsters, Inc. Celia Mae (voice) 2003 Hollywood North Gillian Stevens Jericho Mansions Donna Cherry The Haunted Mansion Madame Leota Happy End Edna 2004 Second Best Carole Perfect Opposites Elyse Steinberg Home on the Range Grace (voice) El Padrino Sebeva Saint Ralph Nurse Alice Love on the Side Alma Kerns Seed of Chucky Tiffany / Herself 2005 Lil' Pimp Miss De La Croix (voice) The Civilization of Maxwell Bright Dr. O'Shannon Bailey's Billion$ Dolores Pennington Tideland Queen Gunhilda 2006 The Poker Movie Herself 2007 Intervention Jane 2008 Deal Karen \"Razor\" Jones The Caretaker Miss Perry Bart Got a Room Melinda Inconceivable Salome \"Sally\" Marsh 2009 An American Girl: Chrissa Stands Strong Mrs. Rundell Imps* Joni Archive footage Segment: \"Sale on Professional Men\" Empire of Silver Mrs. Landdeck Made in Romania Herself 2010 The Making of Plus One Amber 2012 30 Beats Erika 2013 Amelia's 25th Miss Celie Curse of Chucky Tiffany Cameo, Direct-to-video Return to Babylon Clara Bow The Secret Lives of Dorks Ms. Stewart 2015 Unity Narrator Documentary 2016 A Cinderella Story: If the Shoe Fits Divine Direct-to-video 2017 Cult of Chucky Tiffany Valentine Direct-to-video Ray Meets Helen Ginger 2019 Walk to Vegas Jennifer TBD Renaissance Girl Martha Pre-production == Other websites == * ==References== Category:1958 births Category:Living people Category:Actors from Los Angeles Category:American movie actors Category:American television actors Category:American voice actors Category:Canadian voice actors",
 "title": "Jennifer Tilly"
}