{
 "id": "337390",
 "text": "The Saikaidō Seamounts are an underwater feature in the Philippine Sea.Geographic.org, \"Kōkō Guyot\". Retrieved 2012-6-11. The seamounts are in the northern end of the Kyushu-Palau Ridge (KPR).KPR is an acronym. KPR means \"Kyushu-Palau Ridge\". The seabed ridge begins in an area about 900 km from the eastern end of the or \"Bungo strait\" between the Japanese islands of Kyushu and Shikoku. The ridge creates a line on the ocean floor which runs southwest in the direction of the island of Palau.VLIMAR Placedetails, Saikaido Seamount Chain, citing IHO-IOC GEBCO Gazetteer of undersea feature names (October 2002). Retrieved 2012-4-7. There is a chain of extinct volcanos on this line.Kobayashi, K. \"Origin of the Palau and Yap trench-arc systems,\" Geophysical Journal International, Vol. 157, Issue 7, p. 1306. The Saikaidō underwater mountain chain is southeast of the Japanese island of Kyushu. This seabed feature is named after Saikaidō, which was the name given to the southern region of Japan during the Asuka period.Nussbaum, Louis-Frédéric. (2005). \"Goki-shichidō\" in Japan Encyclopedia, p. 255. == Seamounts == Each of these seamounts is a submarine extinct volcano. The undersea mountain range includes: Name Translation Coordinates Notes Refs Bungo Seamount Named after the former Bungo Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"75 Bungo Seamount,\" p. 67 [PDF 79 of 120]; excerpt, \"Bungo\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Buzen Seamount Named after the former Buzen Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"74 Buzen Seamount,\" p. 67 [PDF 79 of 120]; excerpt, \"Buzen\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Chikugo Seamount Named after the former Chikugo Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"73 Chikugo Seamount,\" p. 67 [PDF 79 of 120]; excerpt, \"Chikugo\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Chikuzen Seamount Named after the former Chikuzen Province of the Saikaidō region. IOC- IHO/GEBCO SCUFN-XIV/3, \"72 Chikuzen Seamount,\" p. 67 [PDF 79 of 120]; excerpt, \"Chikuzen\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Higo Seamount Named after the former Higo Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"79 Higo Seamount,\" p. 68 [PDF 80 of 120]; excerpt, \"Higo\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Hizen Seamount Named after the former Hizen Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"76 Hizen Seamount,\" p. 68 [PDF 80 of 120]; excerpt, \"Hizen\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Komahashi Seamount Named after the former Komahashi district of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"77 Komahashi Seamount,\" p. 68 [PDF 80 of 120]; excerpt, \"Komahashi\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Komahashi-daini Seamount Named after the former Komahashi district of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"71 Komahashi-daini Seamount,\" p. 67 [PDF 79 of 120]; excerpt, \"Komahashi\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Nishinoomote Seamount Named after the former Nihinoomote district of the Saikaidō region. Intergovernmental Oceanographic Commission of UNESCO. 2001. \"70 Niahinoomote Seamount,\" Summary Report of the 14th meeting of the GEBCO sub-committee on Undersea Feature Names (SCUFN), also known as IOC- IHO/GEBCO SCUFN-XIV/3, pp. 66-67 [PDF 78-79 of 120]; excerpt, \"Nishinoomote\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Osumi Seamount Named after the former Ōsumi Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"80 Osumi Seamount,\" p. 68 [PDF 80 of 120]; excerpt, \"Osumi\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. Satsuma Seamount Named after the former Satsuma Province of the Saikaidō region. IOC-IHO/GEBCO SCUFN-XIV/3, \"78 Satsuma Seamount,\" p. 68 [PDF 80 of 120]; excerpt, \"Satsuma\" was a feudal district name in the Edo period on the island of Kyushu. Retrieved 2012-4-7. ==Related pages== * Kyūshū region * List of volcanos * Active volcano * Dormant volcano ==References== ==Other websites== * Seamount Catalog on EarthRef Category:Seamounts Category:Pacific Ocean Category:Volcanoes of Asia",
 "title": "Saikaidō Seamounts"
}