{
 "id": "337399",
 "text": "Legally Blonde is a 2001 American comedy movie based on a novel. It stars Reese Witherspoon, Selma Blair, Luke Wilson, Matthew Davis, Victor Garber, Jennifer Coolidge and Holland Taylor, and was released on July 13, 2001. The movie got a lot of good reviews and was nominated for a Golden Globe Award for Best Motion Picture: Musical or Comedy and is the 29th on Bravo's 2007 list of \"100 Funniest Movies\". For her performance, Witherspoon was nominated for Best Actress – Motion Picture Musical or Comedy and the 2002 MTV Movie Award for Best Female Performance. The movie made a lot of money at the box office, and it made almost $142 million worldwide (the budget was $18 million). The movie was later followed by two sequels and a stage play with the same name. It is set in Los Angeles, Southern California and in Harvard University, Cambridge, Massachusetts. ==Plot== Elle Woods is a sorority sister living at the Delta Nu House at the fictional California University Los Angeles (CULA) (based on the real University of California, Los Angeles (UCLA)) where she studies in \"Fashion Merchandising\" and has a 4.0 Grade Point Average. Elle's boyfriend, Warner Huntington III, the son of a U.S. congressman, breaks up with her the night she expects him to propose for marriage, claiming that he needs \"to marry a Jackie, not a Marilyn\", meaning that Elle is not a serious person for a wife and for his career. Warner will go to Harvard Law School, and Elle becomes determined to be accepted to the school to win him back. Once at Harvard, Elle learns that Warner has a new fiancée, Vivian Kensington, who is a member of the same country club as Warner's family and, like most of her classmates, sees Elle as inferior. Elle is able to exonerate a sorority sister accused of murder at a trial, and tells Warner, who wants her back after her successful legal defense, that she does not need him. Elle gives the speech to the law school class at their graduation ceremony after proving herself and earning the respect of her classmates. She begins a relationship with the former Harvard Law School student and lawyer Emmett Richmond. ==Cast== ==Related pages== *Legally Blonde 2: Red, White & Blonde (2003) – The sequel to the movie. *Legally Blonde: The Musical (2007) – The musical based on the movie. *Legally Blondes (2009) – The spin-off to the movie. ==Other websites== * * * * * Category:2001 comedy movies Category:American comedy movies Category:English-language movies Category:Legal movies Category:Movies about fraternities and sororities Category:Movies based on books Category:Movies set in Los Angeles Category:Movies set in Massachusetts Category:Movies set in universities and colleges",
 "title": "Legally Blonde"
}