{
 "id": "337535",
 "text": "The biological species concept gives an explanation of how species form (speciation). A biological species is a group of individuals that can breed together (panmixia). However, they cannot breed with other groups. In other words, the group is reproductively isolated from other groups.Mayr, Ernst 2001. What evolution is. Weidenfeld and Nicolson, London. p284Mayr, Enrst 1982. The growth of biological thought: diversity, evoluton and inheritance. Harvard. The rise of the biological species concept, p270–285 :\"The words 'reproductively isolated' are the key words of the biological species definition\". Ernst Mayr.p273 According to Ernst Mayr, a new species forms when an existing species splits. A similar idea had been suggested in the 19th century by Moritz Wagner.Wagner, Moritz 1841. Reisen in der Regentschaft Algier in den Jahren 1836, 1837 und 1838. 3 vols, Leipzig.Wagner M. 1873. The Darwinian theory and the law of the migration of organisms. Translated by I.L. Laird, London. Dobzhansky described the role of reproductive isolation in the formation of new species.Dobzhansky T. 1937. Genetics and the origin of species. New York: Columbia University Press. Once a species lives in two different areas, the geographical isolation makes breeding between the groups reduce or stop. Each group develops features which make breeding between them work less well. Eventually, each group becomes a 'good' biological species, because the two species do not reproduce with each other even when they are together. This is still considered the most common reason for species splitting, and has the technical name of allopatric speciation. It is contrasted with sympatric speciation where speciation takes place even though all the members live in the same area.Mayr E. 1970. Populations, species, and evolution. Harvard University Press, Cambridge, Mass. == Its role in taxonomy == The biological species is the main reason for classifying living things, but applying it in practice is not easy. Good examples of this are the following: :\"Lack of mating, sterility or inviability in inter-strain crosses has never been taken on its own as good evidence of separate species,Mallet J. 1996. in Gaston K.J. (ed) Biodiversity: biology of numbers and difference. Oxford: Blackwell. including even Dobzhansky's own studies of sibling Drosophila species\". :\"The biological species conceptMayr E. 1942. Systematics and the Origin of Species. Columbia University Press, New York. has no bearing on asexual organisms, and has severe limitations in its application to other organisms.Mallet J. 1995. A species definition for the modern synthesis. Trends Ecol. Evol. 10: 294–299. Groves C.P. 2001. Primate taxonomy. Smithsonian Institution Press, Washington DC. Endless time and effort can be expended on discussing the species concept, and devising yet further modifications and variations on proposed specific definitions. Such debates have great merit in encouraging more objective reasoning about evolution and taxonomy but, in the meantime, human predation and destruction of habitat continue to erase the subject species. Time is against us... Different species concepts produce [groups of subspecies], so it is futile to contemplate a definitive taxonomic system\".Brandon-Jones D. et al 2004. Asian primate classification. International Journal of Primatology. 25 (1): 100. What this is saying is that, in practice, the biological species concept is not sufficient by itself to decide on the classification of animals.The paper was about the classification of primates in Southeast Asia. == Historical developments == === John Ray === In 1686 John Ray introduced a non- evolutionary biological concept. To him, species were distinguished by always producing the same species, and this was fixed and permanent, though considerable variation was possible within a species. The idea of a species as a physical type of organism had a long history. This survives as the concept of a type specimen in taxonomy. It was the way Linnaeus worked in his binomial classification, and is still required in taxonomy when new species are described. === Charles Darwin === In the Origin, Charles Darwin said that species were labels which experts gave on the basis of their observations. :\"... I look at the term species as one arbitrarily given for the sake of convenience to a set of individuals closely resembling each other...\".Darwin, Charles 1859. The origin of species. Murray, London p469 But twenty years before, he had a much better idea. He thought of species as maintained by reproductive isolation. He even says \"Hence species may be good ones and differ scarcely at all in any external character\". Here he quotes the two sibling species of leaf warbler discovered in England by Gilbert White in 1768. At this early stage in his career, Darwin came very close to the modern biological species concept.p266 === Modern era === In the last 70 years two ideas have dominated the way biologists think about species. The first is the population genetics concept. This is where a species is seen as a group which can mate together even though they are all to some extent different. It amounts to saying that a species is a gene pool.Medawar P.B. 1977. In The Fontana dictionary of modern thought, eds Alan Bullock et al., Fontana, London. p802 The second is the use of DNA sequence analysis to show whether similar-looking species are genetically different from each other. This is especially useful when it is not practical to do breeding experiments. ==== Sibling species ==== Sibling species are often called cryptic (hidden) species because their differences can only be seen by analysing their DNA. They are very common in the marine environment. Many cryptic species exist in all habitats. In the marine bryozoan Celleporella hyalina, DNA sequence analysis was used to show that more than ten ecologically distinct species that had been diverging for many millions of years. Evidence from the identification of cryptic species means that older estimates of global species richness are too low. For example, mitochondrial DNA research suggests there are at least 11 genetically distinct populations of giraffes. Similarly, the Amazonian frog Eleutherodactylus ockendeni is at least three different species which diverged over 5 million years ago. ==Sexual reproduction and the existence of species== Charles Darwin (Darwin, 1859, p.171)Darwin, C. (1964 edition). The Origin of Species by Means of Natural Selection. Cambridge: Harvard University Press (facsimile of the first edition, 1859) posed the question “Why, if species have descended from other species by insensibly fine gradations, do we not everywhere see innumerable transitional forms? Why is not all nature in confusion instead of the species being as we see them, well defined?” To resolve this dilemma, it has been proposedBernstein H, Byerly HC, Hopf FA, Michod RE. Sex and the emergence of species. J Theor Biol. 1985 Dec 21;117(4):665-90. doi: 10.1016/s0022-5193(85)80246-0. PMID: 4094459 that the existence of species, as distinct and relatively homogeneous groups of individuals, is a logical result of the dynamics of sexual reproduction. Sexual reproduction, in contrast to asexual reproduction, requires that two individuals come together in order to mate, and this requirement leads to density dependent fitness (per capita rate of increase) with an intrinsic disadvantage when population density is low. Such a cost of rarity, associated with the reproduction of individuals, was proposed to explain the formation of distinct species as well as species homogeneity. == References == Category:Evolutionary biology",
 "title": "Biological species concept"
}