{
 "id": "337567",
 "text": "The is a Japanese term for both an ancient division of the country and the main road running through the region.Nussbaum, Louis-Frédéric. (2005). Goki- shichidō\" in Japan Encyclopedia, p. 255. ==History== Nankaidō was one of the main circuits of the Gokishichidō system. It was first established during the Asuka period. Over centuries, the government functions of the Gokishichido became less important. However, the traditional eight regions, including Nankaidō, remained cultural markers. The Nankaidō road connected the capitals of the provinces in this region.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 65-66 n3. ==Geography== Nankaidō is the geographic region of Shikoku. Awaji Island was also part of the region. Nankaidō has parts of six ancient provincesSale, George et al. (1759). \"Japan,\" An Universal history, from the earliest account of time, Vol. 30, p. 72. and one island, including: * Awa Province * Iyo Province * Kii Province * Sanuki Province * Tosa Some geological features, such as the undersea Nankai Trough, have been named for the region.Steurer, J., Underwood, M, 2003, \"Clay mineralogy of mudstone from the Nankai Trough reference sites 1173 and 1177 and frontal accretionary prism site 1174,\" Ms 190SR-211; excerpt, see Figure F1. \"Index map of the Nankai Trough study area\". Retrieved 2012-4-6. ===Nankaidō earthquakes=== Many historic earthquakes have the name \"Nankai\" or \"Nankaido\". Major earthquakes are named with the Japanese era name and the location such as Nankaido. ===Timeline=== * 1498 (Meiō 7, 2nd day of the 7th month): regional disaster called the at Latitude: 33.500/Longitude: 135.200, 7.5 on the Richter Scale.National Oceanic and Atmospheric Administration (NOAA), National Geophysical Data Center (NGDC): NOAA/Japan: Significant Earthquake Database. Retrieved 2012-4-6. * 1605 (Keichō 10): regional disaster called the * 1854 (Ansei 1): regional disaster called the Disaster Prevention System Institute, 安政南海地震 . Retrieved 2012-4-6. * 1944 (Shōwa 19): regional disaster called the * 1946 (Shōwa 21): regional disaster called the ==Related pages== * Shikoku region * Comparison of regions of Japan ==References== Category:Shikoku region",
 "title": "Nankaidō"
}