{
 "id": "33762",
 "text": "Amman (), is the capital of the Hashemite Kingdom of Jordan and the capital of the Amman Governorate. It is the largest city in the Kingdom and one of the largest Arab cities in terms of population, with a population in 2014 of about 4 million, which also makes it one of the fastest growing cities in the world. The city is located in the center of the Kingdom at latitude 31 north and longitude 35 east in an area covering 20 mountains. Amman is the commercial and administrative center of Jordan and its economic and educational heart. Amman has become a magnet for many Arab communities due to its distinguished location and contemporary architecture. Amman attracts many tourists annually from Western Europe, North America, Japan, South Korea, Southeast Asia, Australia, and from the neighboring and nearby Arab countries. Many families of the Arab Gulf countries in particular visit the city, as there are many tourist attractions in general and medical treatment in particular. As a result of Amman’s location in such a strategic location in the Levant and the Middle East, its location controls the national economy and drives 90% of investment at the national level. The history of Amman dates back to the seventh millennium BC, and thus it is considered one of the oldest inhabited cities in the world. Amman is an ancient city built on the ruins of a city known as “Rabbath Ammon,” later “Philadelphia,” and finally “Amman,” a modification from “Rabbath Ammon,” and the Ammonites took it as their capital. The city was established on seven hills, and it seems that it was the center of the region at that time. It is one of the four capitals of the Levant. It is also one of the ancient Levantine cities that became the capital of the Emirate of Transjordan and then the Hashemite Kingdom of Jordan after its independence in 1946 from Britain. Modern Amman is inhabited by a diverse group of residents of different origins who came from different regions. Some of them came from nearby Jordanian cities, some came from Palestine, and some came from the Caucasus, Syria and Iraq. The Greater Amman Municipality has recently witnessed a huge development, as Amman has expanded in a way that the city has never seen before. Amman's comprehensive plan has won international awards, including the Global Leadership Award in Urban Planning and the City Award for the Asian Continent for 2007. The number of administrative regions in the Greater Amman Municipality is 22 geographically distributed regions, each region contains its staff. As for the administrative aspect, there is the Greater Amman Municipality Council, which includes 68 members headed by the Mayor of the Capital, and the council is in turn divided into 14 different committees. It is noteworthy that March 2 was adopted as city of Amman day the after the Jordanian Cabinet approved a decision in the beginning of 2021, as part of the celebration of the 100th anniversary of the Jordanian state. ==References== == Other websites == * Amman Street Food documentary on Youtube * Amman Digital Community Facebook page * Greater Amman Municipality Facebook page * Amman public transportation map Category:National capitals in Asia Category:Cities in Jordan Category:Settlements in Amman Governorate",
 "title": "Amman"
}