{
 "id": "337660",
 "text": "John Wright Hickenlooper (born February 7, 1952) is an American politician. He is the junior United States Senator from Colorado since 2021. He was the 42nd Governor of Colorado from January 11, 2011 to January 8, 2019. Hickenlooper is a Democrat. He was the mayor of Denver, Colorado from 2003 to 2011. Hickenlooper announced his candidacy for President of the United States on March 4, 2019. He ended his campaign on August 15, 2019. A few days later, he announced his candidacy for the United States Senate challenging incumbent Senator Cory Gardner. In June 2020, he won the Democratic nomination for the U.S. Senate race. In November 2020, he won the election. At 68, Hickenlooper became the oldest first-term senator to represent Colorado. ==Early life, education and career== Hickenlooper was born in Narberth, Pennsylvania. He was raised by his mother after his father died young. He is a graduate of Wesleyan University. At Wesleyan, he earned a B.A. in English in 1974 and a master’s degree in geology in 1980. Before becoming mayor in July 2003, he was a geologist and then a businessperson. Hickenlooper owned several restaurants in the late 1980s. He was one of the founders of the original Wynkoop Brewing Company brewpub. This was the first brewpub in Colorado. ==Political positions== ===Campaign for the homeless=== Hickenlooper has wanted more homeless services since becoming mayor in 2003. He talked about his \"10 year plan to end homelessness\" at the U.S. Conference of Mayors in Washington, D.C.. ===Marijuana legalization=== In 2006, Denver became the first major American city to make legal the private use of marijuana by people over age 21. Hickenlooper was against the marijuana legalization initiative. When the voters approved it 53.49%-46.51%, he said that the vote \"reflect[s] a genuine shift in people's attitudes.\" Currently the Denver Police say the initiative does not overrule the state law, the Colorado Revised Statutes (CRS). Hickenlooper agrees with the Denver Police. The CRS currently treats marijuana possession much like driving faster than the speed limit. The penalty is fines of up to $100 and no jail time. ==2020 presidential campaign== Hickenlooper formally announced his candidacy for President of the United States on March 4, 2019. He released a campaign video titled “Standing Tall”. Before announcing his campaign, Hickenlooper was widely seen as a possible candidate for President in 2020. Hickenlooper formally launched his campaign on March 7, 2019 in Denver. After failing to obtain over 1% in polls, Hickenlooper dropped out of the race on August 15, 2019. ==2020 Senate run== In August 2019, it was revealed that Hickenlooper ended his presidential bid to run for the United States Senate in 2020 against incumbent Senator Cory Gardner. In a poll for potential Democratic candidates for the Colorado Senate, Hickenlooper was the front-runner with 61%. On August 22, 2019, Hickenlooper announced his candidacy for the Senate. In June 2020, he won the Democratic nomination. On November 3, 2020, Hickenlooper was declared the winner of the Senate race. ==Personal life== Hickenlooper's ex-wife, Helen Thorpe, is a writer. Her work has been published in The New Yorker, New York Times Magazine, George, and Texas Monthly. They lived in Denver's Park Hill neighborhood with their son, Teddy. Hickenlooper told the Philadelphia Inquirer that he and Thorpe attend Quaker meetings and try to live by Quaker values. ==References== ==Other websites== *Hickenlooper for Governor official campaign site *Profile at CityMayors.com |- |- Category:1952 births Category:Living people Category:2020 United States presidential candidates Category:United States senators from Colorado Category:American geologists Category:Mayors of Denver Category:American Protestants Category:Businesspeople from Pennsylvania Category:Governors of Colorado Category:Businesspeople from Denver Category:Scientists from Pennsylvania Category:Politicians from Denver Category:Politicians from Pennsylvania Category:Quakers Category:Scientists from Denver Category:Democratic Party (United States) politicians",
 "title": "John Hickenlooper"
}